Repository: sebras/manpages-l10n
Catalog: po/*/man1/*.1.po
Languages: nl, tr

source: April 2022
nl: Abril de 2022
tr: Abril de 2022

source: User Commands
nl: Órdenes de usuario
tr: Órdenes de usuario

source: NAME
nl: NOMBRE
tr: NOMBRE

source: tr - translate or delete characters
tr: tr - traduce o elimina caracteres

source: SYNOPSIS
nl: SINOPSIS
tr: SINOPSIS

source: B<tr> [I<\,OPTION\/>]... I<\,STRING1 \/>[I<\,STRING2\/>]
tr: B<tr> [I<\,OPCIÓN\/>]... I<\,CADENA1 \/>[I<\,CADENA2\/>]

source: DESCRIPTION
nl: DESCRIPCIÓN
tr: DESCRIPCIÓN

source: Translate, squeeze, and/or delete characters from standard input, writing to standard output. STRING1 and STRING2 specify arrays of characters ARRAY1 and ARRAY2 that control the action.
tr: traduce, expurga y/o elimina caracteres desde la entrada estándar y lo envía a la salida estándar. CADENA1 y CADENA2 definen vectores de caracteres VECTOR1 y VECTOR2 que controlan la acción.

source: use the complement of ARRAY1
tr: emplea el complemento de VECTOR1

source: delete characters in ARRAY1, do not translate
tr: borra caracteres en VECTOR1, no lo traduce

source: replace each sequence of a repeated character that is listed in the last specified ARRAY, with a single occurrence of that character
tr: sustituye cada secuencia de caracteres repetidos que figure en el último VECTOR con un único caracter eliminando la duplicación.

source: first truncate ARRAY1 to length of ARRAY2
tr: comienza cortando VECTOR1 para que tenga la misma longitud que VECTOR2.

source: display this help and exit
nl: muestra la ayuda y finaliza
tr: muestra la ayuda y finaliza

source: output version information and exit
nl: muestra la versión del programa y termina
tr: muestra la versión del programa y termina

source: ARRAYs are specified as strings of characters. Most represent themselves. Interpreted sequences are:
tr: Los VECTORES se definen como cadenas de caracteres. Muchos son representaciones de si mismos. Las secuencias que se interpretan son las siguientes:

source: character with octal value NNN (1 to 3 octal digits)
tr: caracter con valor octal NNN (1 a 3 dígitos octales)

source: backslash
tr: barra invertida

source: audible BEL
tr: timbre del sistema

source: backspace
tr: espacio-atrás

source: form feed
tr: nueva página

source: new line
tr: nueva linea

source: return
tr: retorno

source: horizontal tab
tr: tabulación horizontal

source: vertical tab
tr: tabulación vertical

source: CHAR1-CHAR2
tr: CARÁCTER1-CARÁCTER2

source: all characters from CHAR1 to CHAR2 in ascending order
tr: todos los caracteres desde CARÁCTER1 hasta CARÁCTER2 en orden ascendente

source: in ARRAY2, copies of CHAR until length of ARRAY1
tr: en el VECTOR2, copia todas las veces que sea neceario CHAR hasta alcanzar el tamaño de VECTOR1

source: REPEAT copies of CHAR, REPEAT octal if starting with 0
tr: REPITE copias de CHAR, repetirá octal si empieza por 0

source: all letters and digits
tr: todas las letras y los dígitos

source: all letters
tr: todas las letras

source: all horizontal whitespace
tr: todos los espacios en blanco horizontales

source: all control characters
tr: todos los caracteres de control

source: all digits
tr: todos los dígitos

source: all printable characters, not including space
tr: todos los caracteres imprimibles excluyendo los espacios

source: all lower case letters
tr: todas las letras minúsculas

source: all printable characters, including space
tr: todos los caracteres imprimibles incluyendo los espacios

source: all punctuation characters
tr: todos los caracteres de puntuación

source: all horizontal or vertical whitespace
tr: todos los espacios horizontales o verticales

source: all upper case letters
tr: todas las letras mayúsculas

source: all hexadecimal digits
tr: todos los dígitos hexadecimales

source: all characters which are equivalent to CHAR
tr: todos los caracteres equivalentes a CHAR

source: Translation occurs if B<-d> is not given and both STRING1 and STRING2 appear. B<-t> may be used only when translating. ARRAY2 is extended to length of ARRAY1 by repeating its last character as necessary. Excess characters of ARRAY2 are ignored. Character classes expand in unspecified order; while translating, [:lower:] and [:upper:] may be used in pairs to specify case conversion. Squeezing occurs after translation or deletion.
tr: La traducción tendrá lugar si no se indica la opción B<-d> y existen tanto CADENA1 como CADENA2. B<-t> puede usarse solo para traducciones. VECTOR2 se alarga hasta el tamaño de VECTOR1 repitiendo el último carácter las veces que sean necesarias. Los caracteres sobrantes de VECTOR no se consideran. Durante la traducción, las clases de caracteres se expandirán sin un orden definido. Puede emplearse [:lower:] y [:upper:] emparejados para definir minúsculas o mayúsculas respectivamente. El expurgado tendrá lugar después de la traducción o del borrado.

source: BUGS
tr: ERRORES

source: Full support is available only for safe single-byte locales, in which every possible input byte represents a single character. The C locale is safe in GNU systems, so you can avoid this issue in the shell by running B<LC_ALL=C tr> instead of plain B<tr>.
tr: Sólo tienen soporte completo las localizaciones de un sólo byte, donde cada byte representa un único carácter. Para ir sobre seguro, emplee la codificación C en los sistemas GNU; esto es que podrá evitar este inconveniente ejecutando B<LC_ALL=C tr> en lugar de simplemente ejecutar B<tr>.

source: AUTHOR
nl: AUTOR
tr: AUTOR

source: Written by Jim Meyering.
tr: Escrito por Jim Meyering.

source: REPORTING BUGS
nl: INFORMAR DE ERRORES
tr: INFORMAR DE ERRORES

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
tr: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
nl: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
tr: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
tr: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
nl: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
tr: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.

source: SEE ALSO
nl: VÉASE TAMBIÉN
tr: VÉASE TAMBIÉN

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/trE<gt>
tr: Documentación completa E<lt>https://www.gnu.org/software/coreutils/trE<gt>

source: or available locally via: info \(aq(coreutils) tr invocation\(aq
tr: también disponible localmente ejecutando: info \(aq(coreutils) tr invocation\(aq

source: September 2020
nl: Septiembre de 2020
tr: Septiembre de 2020

source: B<tr> [I<\,OPTION\/>]... I<\,SET1 \/>[I<\,SET2\/>]
tr: B<tr> [I<\,OPCIÓN\/>]... I<\,CONJUNTO1 \/>[I<\,CONJUNTO2\/>]

source: Translate, squeeze, and/or delete characters from standard input, writing to standard output.
tr: traduce, expurga y/o elimina caracteres desde la entrada estándar y lo envía a la salida estándar.

source: use the complement of SET1
tr: emplea el complemento de CONJUNTO1

source: delete characters in SET1, do not translate
tr: borra caracteres en CONJUNTO1, no lo traduce

source: replace each sequence of a repeated character that is listed in the last specified SET, with a single occurrence of that character
tr: sustituye cada secuencia de caracteres repetidos que figure en el último CONJUNTO con un único caracter eliminando la duplicación.

source: first truncate SET1 to length of SET2
tr: comienza cortando CONJUNTO1 para que tenga la misma longitud que CONJUNTO2.

source: SETs are specified as strings of characters. Most represent themselves. Interpreted sequences are:
tr: Los CONJUNTOS se definen como cadenas de caracteres. Muchos son representaciones de si mismos. Las secuencias que se interpretan son las siguientes:

source: in SET2, copies of CHAR until length of SET1
tr: en el CONJUNTO2, copia todas las veces que sea neceario CHAR hasta alcanzar el tamaño de CONJUNTO1

source: Translation occurs if B<-d> is not given and both SET1 and SET2 appear. B<-t> may be used only when translating. SET2 is extended to length of SET1 by repeating its last character as necessary. Excess characters of SET2 are ignored. Only [:lower:] and [:upper:] are guaranteed to expand in ascending order; used in SET2 while translating, they may only be used in pairs to specify case conversion. B<-s> uses the last specified SET, and occurs after translation or deletion.
tr: La traducción tendrá lugar si no se indica la opción B<-d> y existen tanto CONJUNTO1 como CONJUNTO2. B<-t> puede usarse solo para traducciones. CONJUNTO2 se alarga hasta el tamaño de CONJUNTO1 repitiendo el último carácter las veces que sean necesarias. Los caracteres sobrantes de CONJUNTO2 se ignorarán. Solo [:lower:] y [:upper:] se expandirán de forma segura en orden ascendente; si se aplican sobre SET2 en una traducción solo podrían usarse emparejados para definir la conversión a mayúsculas/minúsculas. B<-s> emplea el último CONJUNTO definido y se aplica después de la traducción o del borrado.

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
tr: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
nl: Octubre de 2021
tr: Octubre de 2021

source: March 2022
nl: Marzo 2022
tr: Marzo 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
tr: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
nl: Agosto de 2022
tr: Agosto de 2022

source: September 2021
nl: Septiembre de 2021
tr: Septiembre de 2021

source: [CHAR*]
tr: [ZEICHEN*]

source: [CHAR*REPEAT]
tr: [ZEICHEN*ANZAHL]

source: [=CHAR=]
tr: [=ZEICHEN=]

source: GNU coreutils 9.1
nl: ГНУ coreutils 9.1
tr: ГНУ coreutils 9.1

source: COPYRIGHT
nl: АУТОРСКА ПРАВА
tr: АУТОРСКА ПРАВА

source: GNU coreutils 8.32
nl: ГНУ coreutils 8.32
tr: ГНУ coreutils 8.32

source: GNU coreutils 9.0
tr: ГНУ coreutils 9.0

source: nl - number lines of files
nl: nl - numera las líneas de un archivo

source: B<nl> [I<\,OPTION\/>]... [I<\,FILE\/>]...
nl: B<nl> [I<\,OPCIÓN\/>]... [I<\,ARCHIVO\/>]...

source: Write each FILE to standard output, with line numbers added.
nl: Muestra cada ARCHIVO, con sus líneas numeradas, por la salida estándar.

source: With no FILE, or when FILE is -, read standard input.
nl: Si no se define ningún ARCHIVO o bien se indica '-', se lee la entrada estándar.

source: Mandatory arguments to long options are mandatory for short options too.
nl: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.

source: B<-b>, B<--body-numbering>=I<\,STYLE\/>
nl: B<-b>, B<--body-numbering>=I<\,ESTILO\/>

source: use STYLE for numbering body lines
nl: emplea el ESTILO definido para numerar las líneas

source: use CC for logical page delimiters
nl: emplea CC como separador lógico de página

source: B<-f>, B<--footer-numbering>=I<\,STYLE\/>
nl: B<-f>, B<--footer-numbering>=I<\,ESTILO\/>

source: use STYLE for numbering footer lines
nl: numera las líneas al pie con el ESTILO definido

source: B<-h>, B<--header-numbering>=I<\,STYLE\/>
nl: B<-h>, B<--header-numbering>=I<\,ESTILO\/>

source: use STYLE for numbering header lines
nl: numera las líneas del encabezado con el ESTILO definido

source: B<-i>, B<--line-increment>=I<\,NUMBER\/>
nl: B<-i>, B<--line-increment>=I<\,NÚMERO\/>

source: line number increment at each line
nl: cantidad a incrementar para cada línea

source: B<-l>, B<--join-blank-lines>=I<\,NUMBER\/>
nl: B<-l>, B<--join-blank-lines>=I<\,NÚMERO\/>

source: group of NUMBER empty lines counted as one
nl: cuenta como una solo unidad un determinado NÚMERO de líneas en blanco

source: B<-n>, B<--number-format>=I<\,FORMAT\/>
nl: B<-n>, B<--number-format>=I<\,FORMATO\/>

source: insert line numbers according to FORMAT
nl: inserta los números de línea con el FORMATO indicado

source: do not reset line numbers for each section
nl: no reinicia el conteo del número de líneas con cada sección

source: B<-s>, B<--number-separator>=I<\,STRING\/>
nl: B<-s>, B<--number-separator>=I<\,CADENA\/>

source: add STRING after (possible) line number
nl: añade CADENA trás cada (posible) número de línea

source: B<-v>, B<--starting-line-number>=I<\,NUMBER\/>
nl: B<-v>, B<--starting-line-number>=I<\,NÚMERO\/>

source: first line number for each section
nl: primer número de línea para cada sección

source: B<-w>, B<--number-width>=I<\,NUMBER\/>
nl: B<-w>, B<--number-width>=I<\,ANCHO\/>

source: use NUMBER columns for line numbers
nl: emplea un ANCHO fijo de columna para los números de línea

source: Default options are: B<-bt> B<-d>'\e:' B<-fn> B<-hn> B<-i1> B<-l1> B<-n>'rn' B<-s>E<lt>TABE<gt> B<-v1> B<-w6>
nl: Las opciones por defecto son las siguientes: B<-bt> B<-d>'\e:' B<-fn> B<-hn> B<-i1> B<-l1> B<-n>'rn' B<-s>E<lt>TABE<gt> B<-v1> B<-w6>

source: CC are two delimiter characters used to construct logical page delimiters; a missing second character implies ':'. As a GNU extension one can specify more than two characters, and also specifying the empty string (B<-d> '') disables section matching.
nl: CC se refiere a dos caracteres empleados para definir los separadores de página; si solo se indica uno de ellos, se tomará el segundo como ':' por defecto. Al ser una extensión de GNU, es posible definir mas de dos caracteres, también se desactiva la concordancia si se define un cadena vacía (B<-d> '').

source: STYLE is one of:
nl: ESTILO será uno de los siguientes:

source: number all lines
nl: numera todas las líneas

source: number only nonempty lines
nl: numera solo las líneas si no están vacías

source: number no lines
nl: no numera ninguna línea

source: number only lines that contain a match for the basic regular expression, BRE
nl: solo numera las líneas que concuerden con la expresión regular BRE

source: FORMAT is one of:
nl: FORMATO será uno de los siguientes:

source: left justified, no leading zeros
nl: justificar a la izquierda, no añade ceros al principio

source: right justified, no leading zeros
nl: justificado a la derecha, no añade ceros al principio

source: right justified, leading zeros
nl: justificado a la derecha, añade ceros al principio

source: Written by Scott Bartram and David MacKenzie.
nl: Escrito por Scott Bartram y David MacKenzie.

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/nlE<gt>
nl: Documentación completa E<lt>https://www.gnu.org/software/coreutils/nlE<gt>

source: or available locally via: info \(aq(coreutils) nl invocation\(aq
nl: disponible localmente ejecutando: info \(aq(coreutils) nl invocation\(aq

source: CC are two delimiter characters used to construct logical page delimiters; a missing second character implies ':'.
nl: CC se refiere a dos caracteres empleados para definir los separadores de página; si solo se indica uno de ellos, se tomará el segundo como ':' por defecto.

source: B<-d>, B<--section-delimiter>=I<\,CC\/>
nl: B<-d>, B<--section-delimiter>=I<\,ЦЦ\/>

source: September 2022
nl: Септембра 2022

source: pBRE
nl: pGRU
