Repository: sebras/manpages-l10n
Catalog: po/*/man1/abc2ly.1.po
Languages: it, uk

source: User Commands
it: Comandi utente
uk: Команди користувача

source: NAME
it: NOME
uk: НАЗВА

source: abc2ly - manual page for abc2ly (LilyPond) 2.22.1
it: abc2ly - pagina di manuale per abc2ly (LilyPond) 2.22.1
uk: abc2ly - сторінка посібника для abc2ly (LilyPond) 2.22.1

source: SYNOPSIS
it: SINTASSI
uk: КОРОТКИЙ ОПИС

source: B<abc2ly> [I<\,OPTION\/>]... I<\,FILE\/>
it: B<abc2ly> [I<\,OPZIONI\/>]... I<\,FILE\/>
uk: B<abc2ly> [I<\,ПАРАМЕТР\/>]... I<\,ФАЙЛ\/>

source: DESCRIPTION
it: DESCRIZIONE
uk: ОПИС

source: abc2ly converts ABC music files (see http://abcnotation.com/abc2mtex/abc.txt) to LilyPond input.
it: Questo programma converte file di musica ABC (vedere http://abcnotation.com/abc2mtex/abc.txt) in input per LilyPond. Opzioni:
uk: abc2ly конвертує файли музики ABC (дивіться http://abcnotation.com/abc2mtex/abc.txt) у ввід LilyPond.

source: OPTIONS
it: OPZIONI
uk: ПАРАМЕТРИ

source: show version number and exit
it: mostra il numero di versione del programma ed esce
uk: показує номер версії і виходить

source: show this help and exit
it: mostra questo messaggio di aiuto ed esce
uk: показує цю довідку і виходить

source: write output to FILE
it: imposta il nome del file di output a FILE
uk: пише вивід у ФАЙЛ

source: be strict about success
it: è rigoroso in caso di successo
uk: бути строгим у разі успіху

source: preserve ABC's notion of beams
it: preserva la notazione ABC delle barrette orizzontali
uk: зберегти ABC-нотацію променів

source: suppress progress messages
it: sopprime i messaggi di avanzamento
uk: приховати повідомлення про поступ

source: REPORTING BUGS
it: SEGNALAZIONE BUG
uk: ЗВІТИ ПРО НЕДОЛІКИ

source: Report bugs via bug-lilypond@gnu.org
it: I bug possono essere segnalati attraverso bug-lilypond@gnu.org
uk: Повідомляйте про недоліки на bug-lilypond@gnu.org

source: SEE ALSO
it: VEDERE ANCHE
uk: ДИВ. ТАКОЖ

source: The full documentation for B<abc2ly> is maintained as a Texinfo manual. If the B<info> and B<abc2ly> programs are properly installed at your site, the command
it: La documentazione completa per B<abc2ly> è mantenuta come manuale di Texinfo. Se i programmi B<info> e B<abc2ly> sono installati correttamente nel proprio sistema, il comando:
uk: Повна документація для B<abc2ly> підтримується як підручник Texinfo. Якщо програми B<info> та B<abc2ly> належним чином встановлені на вашому сайті, команда

source: should give you access to the complete manual.
it: dovrebbe fornire l'accesso al manuale completo.
uk: надасть вам доступ до повноцінного підручника.

source: February 2021
it: febbraio 2021

source: abc2ly - manual page for abc2ly (LilyPond) 2.22.0
it: abc2ly - pagina di manuale per abc2ly (LilyPond) 2.22.0
uk: abc2ly - сторінка посібника для abc2ly (LilyPond) 2.22.0

source: August 2021
it: agosto 2021

source: March 2021
it: marzo 2021
uk: Березень 2021 року

source: August 2020
it: agosto 2021

source: abc2ly - manual page for abc2ly (LilyPond) 2.20.0
it: abc2ly - pagina di manuale per abc2ly (LilyPond) 2.20.0

source: September 2021
it: settembre 2021
uk: Вересень 2021 року

source: abc2ly - manual page for abc2ly (LilyPond) 2.23.3
it: abc2ly - pagina di manuale per abc2ly (LilyPond) 2.23.3
uk: abc2ly - сторінка посібника для abc2ly (LilyPond) 2.23.3

source: February 2022
uk: Лютий 2022 року

source: abc2ly - manual page for abc2ly (LilyPond) 2.22.2
uk: abc2ly - сторінка посібника для abc2ly (LilyPond) 2.22.2

source: B<-o>, B<--output>=I<\,FILE\/>
uk: B<-o>, B<--output>=I<\,ФАЙЛ\/>

source: April 2022
uk: Квітень 2022 року
