Repository: sebras/manpages-l10n
Catalog: po/*/man1/biff.1.po
Languages: da

source: July 31, 1999
da: 31. juli 1999

source: NAME
da: NAVN

source: be notified if mail arrives and who it is from
da: bliv påmindet hvis post ankommer og hvem det er fra

source: DESCRIPTION
da: BESKRIVELSE

source: E<.Nm Biff> informs the system whether you want to be notified when mail arrives during the current terminal session.
da: E<.Nm Biff> informerer systemet om du ønsker at blive påmindet, når post ankommer under den nuværende terminalsession.

source: Options supported by E<.Nm biff>:
da: Tilvalg understøttet af E<.Nm biff>:

source: Disables notification.
da: Deaktiverer påmindelse.

source: Enables notification.
da: Aktiverer påmindelse.

source: When mail notification is enabled, the header and first few lines of the message will be printed on your screen whenever mail arrives. A E<.Dq Li biff y> command is often included in the file E<.Pa \&.login> or E<.Pa \&.profile> to be executed at each login.
da: Når postpåmindelse er aktiveret, vil teksthovedet og de første få linjer af beskeden blive vist på din skærm, når post ankommer. En kommando E<.Dq Li biff y> er ofte inkluderet i filen E<.Pa \&.login> eller E<.Pa \&.profile> til afvikling ved hvert logind.

source: E<.Nm Biff> operates asynchronously via the E<.Xr comsat 8> service. If that service is not enabled, E<.Nm biff> will not do anything. In that case, or for synchronous notification, use the E<.Ar MAIL> variable of E<.Xr sh 1> or the E<.Ar mail> variable of E<.Xr csh 1>.
da: E<.Nm Biff> fungerer asynkront via tjenesten E<.Xr comsat 8>. Hvis den tjeneste ikke er aktiveret vil E<.Xr comsat 8> ikke udføre noget. I det tilfælde, eller for synkron påmindelse, brug variablen E<.Ar MAIL> for E<.Xr sh 1> eller variablen E<.Ar mail> for E<.Xr csh 1>.

source: SEE ALSO
da: SE OGSÅ

source: HISTORY
da: HISTORIK

source: The E<.Nm> command appeared in E<.Bx 4.0>.
da: Kommandoen E<.Nm> kom med versionen E<.Bx 4.0>.

source: BUGS
da: FEJL

source: E<.Xr su 1>, and biff don't seem to get on too well. This is probably due to the tty still being owned by the person using su. This can result in E<.Dq Li Permission denied > messages when attempting to change the biff status of your session.
da: E<.Xr su 1>, og biff ser ikke ud til at komme overens. Dette skyldes sandsynligvis at tty stadig er ejet af personen, der bruger su. Dette kan medføre E<.Dq Li Permission denied >-beskeder under forsøget på at ændre biff-statussen for din session.

source: Please report bugs to netbug@ftp.uk.linux.org including diffs/patches, compiler error logs or as complete a bug report as is possible.
da: Send venligst fejlrapporter til netbug@ftp.uk.linux.org inklusive rettelser, kompilerfejllogge eller en så fuldstændig fejlrapport, det er muligt at lave.
