Repository: sebras/manpages-l10n
Catalog: po/*/man1/bootctl.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: bootctl - Control EFI firmware boot settings and manage boot loader
de: bootctl - Steuern der EFI-Firmware-Systemstarteinstellungen und Verwalten des Systemladeprogramms

source: SYNOPSIS
de: ÜBERSICHT

source: B<bootctl> [OPTIONS...] {COMMAND}
de: B<bootctl> [OPTIONEN…] {BEFEHL}

source: DESCRIPTION
de: BESCHREIBUNG

source: B<bootctl> can check the EFI firmware and boot loader status, list and manage available boot loaders and boot loader entries, and install, update, or remove the B<systemd-boot>(7) boot loader on the current system\&.
de: B<bootctl> kann den EFI-Firmware und Systemladerzustand prüfen, verfügbare Systemladeprogramme und -einträge auflisten und verwalten und auf dem aktuellen System den B<systemd-boot>(7)-Systemlader installieren, aktualisieren oder entfernen\&.

source: GENERIC EFI FIRMWARE/BOOT LOADER COMMANDS
de: GENERISCHE EFI-FIRMWARE/SYSTEMLADEPROGRAMM-BEFEHLE

source: These commands are available on any EFI system, regardless of the boot loader used\&.
de: Diese Befehle sind unabhängig vom verwandten Systemladeprogramm auf jedem EFI-System verfügbar\&.

source: Shows brief information about the system firmware, the boot loader that was used to boot the system, the boot loaders currently available in the ESP, the boot loaders listed in the firmware\*(Aqs list of boot loaders and the current default boot loader entry\&. If no command is specified, this is the implied default\&.
de: Zeigt eine kurze Information über die Firmware des Systems, das Systemstartprogramm, das zum Starten des Systems verwandt wurde, die derzeit in der ESP verfügbaren Systemstartprogramme, die in der Liste der Systemstartprogramme der Firmware aufgeführten Systemstartprogramme und den derzeitigen Standardsystemstartprogrammeintrag an\&. Falls kein Befehl angegeben ist, ist dies die implizierte Vorgabe\&.

source: See the example below for details of the output\&.
de: Siehe das nachfolgende Beispiel für Details zur Ausgabe\&.

source: B<reboot-to-firmware> [I<BOOL>]
de: B<reboot-to-firmware> [I<LOGISCH>]

source: Query or set the "Reboot-Into-Firmware-Setup" flag of the EFI firmware\&. Takes a boolean argument which controls whether to show the firmware setup on next system reboot\&. If the argument is omitted shows the current status of the flag, or whether the flag is supported\&. This controls the same flag as B<systemctl reboot --firmware-setup>, but is more low-level and allows setting the flag independently from actually requesting a reboot\&.
de: Fragt den Schalter »Neustart-in-die-Firmware-Einrichtung« der EFI-Firmware ab oder setzt diesen\&. Akzeptiert ein logisches Argument, das steuert, ob die Firmware-Einrichtung beim nächsten Systemneustart angezeigt wird\&. Falls das Argument nicht angegeben wird, wird der aktuelle Zustand des Schalters angezeigt, oder ob der Schalter unterstützt wird\&. Dies steuert den gleichen Schalter wie B<systemctl reboot --firmware-setup>, ist aber systemnäher und erlaubt die Einstellung des Schalters unabhängig von der tatsächlichen Neustartaufforderung\&.

source: Hint: use B<systemctl reboot --firmware-setup> to reboot into firmware setup once\&. See B<systemctl>(1) for details\&.
de: Tipp: Verwenden Sie B<systemctl reboot --firmware-setup>, um einmalig in die Firmware-Einstellungen neuzustarten\. Siehe B<systemctl>(1) für Details\&.

source: B<systemd-efi-options> [I<STRING>]
de: B<systemd-efi-options> [I<ZEICHENKETTE>]

source: When called without the optional argument, prints the current value of the "SystemdOptions" EFI variable\&. When called with an argument, sets the variable to that value\&. See B<systemd>(1) for the meaning of that variable\&.
de: Gibt beim Aufruf ohne Argument den Wert der EFI-Variablen »SystemdOptions« aus\&. Beim Aufruf mit Argument wird die Variable auf diesen Wert gesetzt\&. Siehe B<systemd>(1) für die Bedeutung dieser Variablen\&.

source: BOOT LOADER SPECIFICATION COMMANDS
de: SYSTEMSTARTPROGRAMM-SPEZIFIZIERUNGSBEFEHLE

source: These commands are available for all boot loaders that implement the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 and/or the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2, such as B<systemd-boot>\&.
de: Diese Befehle sind für alle Systemstartprogramme verfügbar, die die \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 und/oder die \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2 implementieren, wie B<systemd-boot>\&.

source: Shows all available boot loader entries implementing the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, as well as any other entries discovered or automatically generated by a boot loader implementing the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2\&. JSON output may be requested with B<--json=>\&.
de: Zeigt alle verfügbaren Systemstartprogrammeinträge, die die \m[blue]B<Systemstartprogrammspezifikation>\m[]\&\s-2\u[1]\d\s+2 implementieren, sowie jeden anderen erkannten oder automatisch durch das Systemstartprogramm erstellten Eintrag, der durch ein Systemstartprogramm erstellt wurde, der die \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2 implementiert\&. JSON-Ausgabe kann mittels B<--json=> erbeten werden\&.

source: B<set-default> I<ID>, B<set-oneshot> I<ID>
de: B<set-default> I<KENNUNG>, B<set-oneshot> I<KENNUNG>

source: Sets the default boot loader entry\&. Takes a single boot loader entry ID string or a glob pattern as argument\&. The B<set-oneshot> command will set the default entry only for the next boot, the B<set-default> will set it persistently for all future boots\&.
de: Setzt den Standard-Systemstartprogrammeintrag\&. Akzeptiert eine einzelne Systemstartprogrammeintragskennungszeichenkette oder ein Glob-Muster als Argument\&. Der Befehl B<set-oneshot> setzt den Vorgabeeintrag nur für den nächsten Systemstart, B<set-default> setzt ihn dauerhaft für alle zukünftigen Systemstarts\&.

source: B<bootctl list> can be used to list available boot loader entries and their IDs\&.
de: B<bootctl list> kann zur Auflistung verfügbarer Systemladereinträge und ihrer Kennungen verwandt werden\&.

source: In addition, the boot loader entry ID may be specified as one of: B<@default>, B<@oneshot> or B<@current>, which correspond to the current default boot loader entry for all future boots, the current default boot loader entry for the next boot, and the currently booted boot loader entry\&. These special IDs are resolved to the current values of the EFI variables I<LoaderEntryDefault>, I<LoaderEntryOneShot> and I<LoaderEntrySelected>, see \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 for details\&. These special IDs are primarily useful as a quick way to persistently make the currently booted boot loader entry the default choice, or to upgrade the default boot loader entry for the next boot to the default boot loader entry for all future boots, but may be used for other operations too\&.
de: Zusätzlich kann die Systemstartpogrammladeeintragskennung als eine der folgenden angegeben werden: B<@default>, B<@oneshot> oder B<@current>, was dem aktuellen Standardsystemstartladeeintrag für alle zukünftigen Systemstarts, dem aktuellen Vorgabe-Systemstartladeeintrag für den nächsten Systemstart und dem derzeit gestarteten Systemstartladeeintrag entspricht\&. Diese besonderen Kennungen werden auf die aktuellen Werte der EFI-Variablen I<LoaderEntryDefault>, I<LoaderEntryOneShot> und I<LoaderEntrySelected> aufgelöst, siehe \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 für Details\&. Diese besonderen Kennungen sind primär als schnelle Angabe nützlich, um den aktuellen Systemstartladeeintrag dauerhaft als Vorgabeauswahl zu setzen oder den aktuellen Systemstartladeeintrag für den nächsten Systemstart auf den Standard-Systemstartladeeintrag für alle zukünftigen Systemstarts zu aktualisieren, kann aber auch für andere Aktionen verwandt werden\&.

source: If set to B<@saved> the chosen entry will be saved as an EFI variable on every boot and automatically selected the next time the boot loader starts\&.
de: Falls auf B<@saved> gesetzt wird der ausgewählte Eintrag bei jedem Systemstart als eine EFI-Variable gesetzt und automatisch ausgewählt, wenn das Systemladeprogramm das nächste Mal startet\&.

source: When an empty string ("") is specified as the ID, then the corresponding EFI variable will be unset\&.
de: Wenn die leere Zeichenkette ("") als die Kennung angegeben wird, dann wird die entsprechende EFI-Variable zurückgesetzt\&.

source: Hint: use B<systemctl reboot --boot-loader-entry=>I<ID> to reboot into a specific boot entry and B<systemctl reboot --boot-loader-menu=>I<timeout> to reboot into the boot loader menu once\&. See B<systemctl>(1) for details\&.
de: Tipp: Verwenden Sie B<systemctl reboot --boot-loader-entry=>I<Kennung>, um in einen bestimmten Systemstarteintrag neuzustarten und B<systemctl reboot --boot-loader-menu=>I<Zeitüberschreitung>, um einmalig in das Systemladermenü neuzustarten\&. Siehe B<systemctl>(1) für Details\&.

source: B<set-timeout> I<TIMEOUT>, B<set-timeout-oneshot> I<TIMEOUT>
de: B<set-timeout> I<ZEITÜBERSCHREITUNG>, B<set-timeout-oneshot> I<ZEITÜBERSCHREITUNG>

source: Sets the boot loader menu timeout in seconds\&. The B<set-timeout-oneshot> command will set the timeout only for the next boot\&. See B<systemd.time>(7) for details about the syntax of time spans\&.
de: Setzt die Zeitüberschreitung des Systemstartmenüs in Sekunden\&. Der Befehl B<set-timeout-oneshot> setzt die Zeitüberschreitung nur für den nächsten Systemstart\&. Siehe B<systemd.time>(7) für Details über die Syntax von Zeitspannen\&.

source: If this is set to B<menu-hidden> or B<0> no menu is shown and the default entry will be booted immediately, while setting this to B<menu-force> disables the timeout while always showing the menu\&. When an empty string ("") is specified the bootloader will revert to its default menu timeout\&.
de: Falls auf B<menu-hidden> oder B<0> gesetzt, wird kein Menü gezeigt und der Vorgabeeintrag wird sofort gestartet, während die Einstellung B<menu-force> die Zeitüberschreitung deaktiviert und das Menü immer zeigt\&. Wird eine leere Zeichenkette ("") angegeben, wird das Systemstartprogramm zu seiner Standard-Menü-Zeitüberschreitung zurückkehren\&.

source: SYSTEMD-BOOT COMMANDS
de: SYSTEM-BOOT-BEFEHLE

source: These commands manage the B<systemd-boot> EFI boot loader, and do not work in conjunction with other boot loaders\&.
de: Diese Befehle verwalten das EFI-Systemstartprogramm B<systemd-boot> und funktionieren nicht mit anderen Systemstartprogrammen zusammen\&.

source: Installs B<systemd-boot> into the EFI system partition\&. A copy of B<systemd-boot> will be stored as the EFI default/fallback loader at I<ESP>/EFI/BOOT/BOOT*\&.EFI\&. The boot loader is then added to the top of the firmware\*(Aqs boot loader list\&.
de: Installiert B<systemd-boot> in die EFI-Systempartition\&. Eine Kopie von B<systemd-boot> wird in dem EFI-Standard/Ausweich-Lader unter I<ESP>/EFI/BOOT/BOOT*\&.EFI gespeichert\&. Das Systemstartprogramm wird dann am Anfang der Systemstartprogrammliste der Firmware hinzugefügt\&.

source: Updates all installed versions of B<systemd-boot>(7), if the available version is newer than the version installed in the EFI system partition\&. This also includes the EFI default/fallback loader at I<ESP>/EFI/BOOT/BOOT*\&.EFI\&. The boot loader is then added to end of the firmware\*(Aqs boot loader list if missing\&.
de: Aktualisiert alle installierten Versionen von B<systemd-boot>(7), falls die verfügbare Version neuer als die in der EFI-System-Partition installierte ist\&. Dies beinhaltet den EFI-Standard/Ausweich-Lader unter I<ESP>/EFI/BOOT/BOOT*\&.EFI\&. Das Systemstartprogramm wird dann am Ende der Systemstartprogrammliste der Firmware hinzugefügt, falls es fehlt\&.

source: Removes all installed versions of B<systemd-boot> from the EFI system partition and the firmware\*(Aqs boot loader list\&.
de: Entfernt alle installierten Versionen von B<systemd-boot> aus der EFI-Systempartition und der Systemstartprogrammliste der Firmware\&.

source: Checks whether B<systemd-boot> is installed in the ESP\&. Note that a single ESP might host multiple boot loaders; this hence checks whether B<systemd-boot> is one (of possibly many) installed boot loaders \(em and neither whether it is the default nor whether it is registered in any EFI variables\&.
de: Prüft, ob B<systemd-boot> in der ESP installiert ist\&. Beachten Sie, dass ein einzelner ESP mehrere Systemstartprogramme beherbergen kann; daher prüft dies, ob B<systemd-boot> einer (unter möglicherweise vielen) installierten Systemstartprogrammen ist\&. Es prüft auch, ob es das Vorgabesystemstartprogramm ist und ob es in irgendwelchen EFI-Variablen registriert ist\&.

source: Generates a random seed and stores it in the EFI System Partition, for use by the B<systemd-boot> boot loader\&. Also, generates a random \*(Aqsystem token\*(Aq and stores it persistently as an EFI variable, if one has not been set before\&. If the boot loader finds the random seed in the ESP and the system token in the EFI variable it will derive a random seed to pass to the OS and a new seed to store in the ESP from the combination of both\&. The random seed passed to the OS is credited to the kernel\*(Aqs entropy pool by the system manager during early boot, and permits userspace to boot up with an entropy pool fully initialized very early on\&. Also see B<systemd-boot-system-token.service>(8)\&.
de: Erstellt einen Zufallsstartwert und speichert ihn für die Verwendung durch das Systemstartprogramm B<systemd-boot> in der EFI-Systempartition\&. Erstellt auch ein zufälliges »Systemmerkmal« und speichert es dauerhaft als eine EFI-Variable, falls es nicht bereits vorher gesetzt wurde\&. Falls das Systemstartprogramm einen Zufallsstartwert in der ESP und das Systemmerkmal in der EFI-Variable findet, wird es aus einer Kombination aus beiden einen Zufallsstartwert ableiten, um ihn an das Betriebssystem weiterzugeben und einen neuen Startwert, um ihn in der ESP zu speichern\&. Der an das Betriebssystem weitergegebene Zufallsstartwert wird dem Entropie-Fundus des Kernels während der frühen Systemstartphase gutgeschrieben und erlaubt es Programmen auf der Anwendungsebene, mit einem Entropie-Fundus hochzufahren, der von einem frühen Zeitpunkt an bereits komplett initialisiert ist\&. Siehe auch B<systemd-boot-system-token.service>(8)\&.

source: See \m[blue]B<Random Seeds>\m[]\&\s-2\u[3]\d\s+2 for further information\&.
de: Siehe \m[blue]B<Zufallsstartwerte>\m[]\&\s-2\u[3]\d\s+2 für weitere Informationen\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Path to the EFI System Partition (ESP)\&. If not specified, /efi/, /boot/, and /boot/efi/ are checked in turn\&. It is recommended to mount the ESP to /efi/, if possible\&.
de: Pfad zu der EFI-Systempartition (ESP)\&. Falls nicht angegeben, werden /efi/, /boot/ und /boot/efi/ der Reihe nach geprüft\&. Es wird empfohlen, falls möglich, die ESP unter /efi/ einzuhängen\&.

source: Path to the Extended Boot Loader partition, as defined in the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2\&. If not specified, /boot/ is checked\&. It is recommended to mount the Extended Boot Loader partition to /boot/, if possible\&.
de: Pfad zu der »Extended Boot Loader«-Partition, wie diese in der \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 definiert ist\&. Falls nicht angegeben, wird /boot/ geprüft\&. Es wird empfohlen, falls möglich, die »Extended Boot Loader«-Partition unter /boot/ einzuhängen\&.

source: B<--root=>I<root>
de: B<--root=>I<Wurzel>

source: Takes a directory path as an argument\&. All paths will be prefixed with the given alternate I<root> path, including config search paths\&.
de: Akzeptiert einen Verzeichnispfad als Argument\&. Allen Pfaden wird der angegebene alternative I<Wurzel>-Pfad vorangestellt, einschließlich der Suchpfade für die Konfiguration\&.

source: B<--image=>I<image>
de: B<--image=>I<Abbild>

source: Takes a path to a disk image file or block device node\&. If specified, all operations are applied to file system in the indicated disk image\&. This option is similar to B<--root=>, but operates on file systems stored in disk images or block devices\&. The disk image should either contain just a file system or a set of file systems within a GPT partition table, following the \m[blue]B<Discoverable Partitions Specification>\m[]\&\s-2\u[4]\d\s+2\&. For further information on supported disk images, see B<systemd-nspawn>(1)\*(Aqs switch of the same name\&.
de: Akzeptiert einen Pfad zu einer Plattenabbilddatei oder einem Blockgerätenamen\&. Falls angegeben, werden alle Aktionen auf das Dateisystem in dem angegebenen Plattenabbild angewandt\&. Diese Option ist ähnlich zu B<--root=>, agiert aber auf Dateisystemen, die in Plattenabbildern oder Blockgeräten gespeichert sind\&. Das Plattenabbild sollte entweder nur ein Dateisystem oder eine Reihe von Dateisystemen innerhalb einer GPT-Partitionstabelle enthalten, die der \m[blue]B<Spezifikation für auffindbare Partitionen>\m[]\&\s-2\u[4]\d\s+2 folgt\&. Für weitere Informationen über unterstützte Plattenabbilder, siehe den Schalter von B<systemd-nspawn>(1) mit dem gleichen Namen\&.

source: When installing binaries with B<--root=> or B<--image=>, selects where to source them from\&. Takes one of "auto" (the default), "image" or "host"\&. With "auto" binaries will be picked from the specified directory or image, and if not found they will be picked from the host\&. With "image" or "host" no fallback search will be performed if the binaries are not found in the selected source\&.
de: Bei der Installation von Programmen mit B<--root=> oder B<--image=> wählt dies aus, woher diese stammen\&. Akzeptiert entweder »auto« (die Vorgabe), »image« oder »host«\&. Mit »auto« werden die Programme auf dem angegeben Verzeichnis oder Abbild aufgenommen und falls sie nicht gefunden werden, werden sie vom Rechner aufgenommen\&. Mit »image« oder »host« wird keine Rückfallsuche durchgeführt, falls die Programme nicht in der ausgewählten Quelle gefunden werden\&.

source: This option modifies the behaviour of B<status>\&. Only prints the path to the EFI System Partition (ESP) to standard output and exits\&.
de: Diese Option verändert das Verhalten von B<status>\&. Es werden nur die Pfade zu der EFI-Systempartition (ESP) auf der Standardausgabe ausgegeben und das Programm beendet\&.

source: This option modifies the behaviour of B<status>\&. Only prints the path to the Extended Boot Loader partition if it exists, and the path to the ESP otherwise to standard output and exit\&. This command is useful to determine where to place boot loader entries, as they are preferably placed in the Extended Boot Loader partition if it exists and in the ESP otherwise\&.
de: Diese Option verändert das Verhalten von B<status>\&. Gibt in die Standardausgabe nur den Pfad zu der »Extended Boot Loader«-Partition aus, falls diese existiert, und andernfalls den Pfad zur ESP\&. Danach beendet er sich\&. Dieser Befehl ist nützlich, um zu bestimmen, wo Boot-Loader-Einträge abgelegt werden, da sie bevorzugt in die »Extended Boot Loader«-Partition abgelegt werden, falls diese existiert, und andernfalls in der ESP\&.

source: Boot Loader Specification Type #1 entries should generally be placed in the directory "$(bootctl -x)/loader/entries/"\&. Existence of that directory may also be used as indication that boot loader entry support is available on the system\&. Similarly, Boot Loader Specification Type #2 entries should be placed in the directory "$(bootctl -x)/EFI/Linux/"\&.
de: Systemladerspezifikationseinträge vom Typ #1 sollten im Allgemeinen im Verzeichnis »$(bootctl -x)/loader/entries/« abgelegt werden\&. Die Existenz dieses Verzeichnisses kann auch als Anzeichen dafür verwandt werden, dass auf dem System die Unterstützung für Systemladeeinträge verfügbar ist\&. Ähnlich sollten Systemladerspezifikationseinträge vom Typ #2 im Verzeichnis »$(bootctl -x)/EFI/Linux/« abgelegt werden\&.

source: Note that this option (similarly to the B<--print-booth-path> option mentioned above), is available independently from the boot loader used, i\&.e\&. also without B<systemd-boot> being installed\&.
de: Beachten Sie, dass diese Option (ähnlich der oben erwähnten Option B<--print-booth-path>) unabhängig vom verwandten Systemstartprogramm verfügbar ist, d\&.h\&. auch ohne dass B<systemd-boot> installiert ist\&.

source: Do not touch the firmware\*(Aqs boot loader list stored in EFI variables\&.
de: Fasst die Liste der Systemladeprogramme der Firmware, die in EFI-Variablen gespeichert ist, nicht an\&.

source: Ignore failure when the EFI System Partition cannot be found, when EFI variables cannot be written, or a different or newer boot loader is already installed\&. Currently only applies to B<is-installed>, B<update>, and B<random-seed> verbs\&.
de: Ignoriert Fehlschläge, wenn die EFI-Systempartition nicht gefunden, die EFI-Variablen nicht geschrieben werden können oder ein anderes oder neueres Systemstartprogramm bereits installiert ist\&. Gilt derzeit nur für die Unterbefehle B<is-installed>, B<update> und B<random-seed>\&.

source: Suppress printing of the results of various commands and also the hints about ESP being unavailable\&.
de: Unterdrückt die Ausgabe der Ergebnisse von verschiedenen Befehlen und auch der Hinweise, dass der ESP nicht verfügbar ist\&.

source: Controls creation and deletion of the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 Type #1 entry directory on the file system containing resources such as kernel and initrd images during B<install> and B<remove>, respectively\&. The directory is named after the entry token, as specified with B<--entry-token=> parameter described below, and is placed immediately below the I<$BOOT> root directory (i\&.e\&. beneath the file system returned by the B<--print-boot-path> option, see above)\&. Defaults to "no"\&.
de: Steuert die Erstellung und Löschung der \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 Typ-#1-Eintragsverzeichnisse auf dem Dateisystem, das die Ressourcen wie Kernel- und Initrd-Abbilder während B<install> bzw. B<remove> enthält\&. Das Verzeichnis wird nach dem Eintragsmerkmal benannt, wie dieses mit dem nachfolgend beschriebenen Parameter B<--entry-token=> angegeben wird, und wird direkt unterhalb des I<$BOOT> Wurzelverzeichnisses abgelegt (d\&.h\&. unterhalb des Dateisystems, das von der Option B<--print-boot-path> zurückgeliefert wird, siehe oben)\&. Standardmäßig »no«\&.

source: Controls how to name and identify boot loader entries for this OS installation\&. Accepted during B<install>, and takes one of "auto", "machine-id", "os-id", "os-image-id" or an arbitrary string prefixed by "literal:" as argument\&.
de: Steuert, wie die Systemstartprogrammeinträge für diese Betriebssysteminstallation benannt und identifiziert werden sollen\&. Wird während B<install> berücksichtigt und akzeptiert entweder »auto«, »machine-id«, »os-id«, »os-image-id« oder eine beliebige Zeichenkette, der »literal:« vorangestellt ist, als Argument\&.

source: If set to B<machine-id> the entries are named after the machine ID of the running system (e\&.g\&. "b0e793a9baf14b5fa13ecbe84ff637ac")\&. See B<machine-id>(5) for details about the machine ID concept and file\&.
de: Wird dies auf B<machine-id> gesetzt, dann werden die Einträge nach der Maschinenkennung des laufenden Systems benannt (z\&.B\&. »b0e793a9baf14b5fa13ecbe84ff637ac«)\&. Siehe B<machine-id>(5) für Details über das Konzept der Maschinenkennung und der Datei\&.
