Repository: sebras/manpages-l10n
Catalog: po/*/man1/bootctl.1.po
Languages: de

source: If set to B<os-id> the entries are named after the OS ID of the running system, i\&.e\&. the I<ID=> field of B<os-release>(5) (e\&.g\&. "fedora")\&. Similarly, if set to B<os-image-id> the entries are named after the OS image ID of the running system, i\&.e\&. the I<IMAGE_ID=> field of os-release (e\&.g\&. "vendorx-cashier-system")\&.
de: Falls auf B<os-id> gesetzt, werden die Einträge nach der Betriebssystemkennung des laufenden Systems benannt, d\&.h\&. dem Feld I<ID=> von B<os-release>(5) (z\&.B\&. »fedora«)\&. Ähnlich werden die Einträge nach der Betriebssystem-Abbild-Kennung des laufenden Systems benannt, falls es auf B<os-image-id> gesetzt ist, d\&.h\&. dem Feld I<IMAGE_ID=> von B<os-release> (z\&.B\&. »vendorx-cashier-system«)\&.

source: If set to B<auto> (the default), the /etc/kernel/entry-token file will be read if it exists, and the stored value used\&. Otherwise if the local machine ID is initialized it is used\&. Otherwise I<IMAGE_ID=> from os-release will be used, if set\&. Otherwise, I<ID=> from os-release will be used, if set\&.
de: Falls auf B<auto> (der Vorgabe) gesetzt, wird die Datei /etc/kernel/entry-token eingelesen, falls sie existiert, und der gespeicherte Wert wird verwandt\&. Andernfalls wird die lokale Maschinenkennung verwandt, falls diese initialisiert wurde\&. Andernfalls wird I<IMAGE_ID=> aus os-release verwandt, falls gesetzt\&. Andernfalls wird I<ID=> aus os-release verwandt, falls gesetzt\&.

source: Unless set to "machine-id", or when B<--make-entry-directory=yes> is used the selected token string is written to a file /etc/kernel/entry-token, to ensure it will be used for future entries\&. This file is also read by B<kernel-install>(8), in order to identify under which name to generate boot loader entries for newly installed kernels, or to determine the entry names for removing old ones\&.
de: Die ausgewählte Merkmalzeichenketten wird in eine Datei /etc/kernel/entry-token geschrieben, außer »machine-id« ist gesetzt oder B<--make-entry-directory=yes> wird verwandt, um sicherzustellen, das sie für zukünftige Einträge verwandt wird\&. Diese Datei wird auch von B<kernel-install>(8) eingelesen, um zu ermitteln, unter welchem Namen Systemstarteinträge für neu installierte Kernel erstellt werden oder die Eintragsnamen zum Entfernen alter zu bestimmen\&.

source: Using the machine ID for naming the entries is generally preferable, however there are cases where using the other identifiers is a good option\&. Specifically: if the identification data that the machine ID entails shall not be stored on the (unencrypted) I<$BOOT> partition, or if the ID shall be generated on first boot and is not known when the entries are prepared\&. Note that using the machine ID has the benefit that multiple parallel installations of the same OS can coexist on the same medium, and they can update their boot loader entries independently\&. When using another identifier (such as the OS ID or the OS image ID), parallel installations of the same OS would try to use the same entry name\&. To support parallel installations, the installer must use a different entry token when adding a second installation\&.
de: Die Verwendung der Maschinenkennung zur Benennung der Einträge sollte bevorzugt werden, allerdings gibt es Fälle, bei denen die Verwendung anderer Kennzeichner eine gute Option ist\&. Insbesondere dann, wenn die Kennzeichnungsdaten, die die Maschinenkennung enthält, nicht auf der (unverschlüsselten) Partition I<$BOOT> gespeichert werden sollen oder falls die Kennung nicht beim ersten Systemstart erstellt werden soll und es nicht bekannt ist, wenn die Einträge vorbereitet werden\&. Beachten Sie, dass die Verwendung der Maschinenkennung den Vorteil hat, dass mehrere parallele Installationen des gleichen Betriebssystems auf dem gleichen Medium koexistieren können und dass sie ihre Systemstartladereinträge unabhängig voneinander aktualisieren können\&. Bei der Verwendung eines anderen Kennzeichners (wie der Betriebssystemkennung oder der Betriebssystem-Abbildkennung), würden parallele Installationen des gleichen Betriebssystems versuchen, den gleichen Eintragsnamen zu verwenden\&. Um parallele Installationen zu unterstützen, muss das Installationsprogramm verschiedene Eintragskennzeichnungen beim Hinzufügen einer zweiten Installation verwenden\&.

source: Install binaries for all supported EFI architectures (this implies B<--no-variables>)\&.
de: Installiert Programme für alle unterstützten EFI-Architekturen (dies impliziert B<--no-variables>)\&.

source: Description of the entry added to the firmware\*(Aqs boot option list\&. Defaults to "Linux Boot Manager"\&.
de: Beschreibung des zu der Systemstart-Optionsliste der Firmware hinzugefügten Eintrags\&. Standardmäßig »Linux Boot Manager«\&.

source: Using the default entry name "Linux Boot Manager" is generally preferable as only one bootloader installed to a single ESP partition should be used to boot any number of OS installations found on the various disks installed in the system\&. Specifically distributions should not use this flag to install a branded entry in the boot option list\&. However in situations with multiple disks, each with their own ESP partition, it can be beneficial to make it easier to identify the bootloader being used in the firmware\*(Aqs boot option menu\&.
de: Die Verwendung des Vorgabe-Eintragsnamens »Linux Boot Manager« wird im Allgemeinen bevorzugt, da nur ein Systemladeprogramm, installiert auf einer einzelnen ESP-Partition zum Starten einer Reihe von Betriebssysteminstallationen verwandt werden sollte, die auf verschiedenen Platten im System installiert sind\&. Insbesondere sollten Distributionen diesen Schalter nicht verwenden, um einen an sie angepassten Eintrag in der Systemstart-Optionsliste zu installieren\&. In Situationen mit mehreren Platten, jeweils mit ihrer eigenen ESP-Partition, kann es von Vorteil sein, die Identifikation der zu verwendenden Systemstartladeprogramme in dem Systemstart-Optionsmenü der Firmware zu erleichtern\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: B<--json=>I<MODE>
de: B<--json=>I<MODUS>

source: Shows output formatted as JSON\&. Expects one of "short" (for the shortest possible output without any redundant whitespace or line breaks), "pretty" (for a pretty version of the same, with indentation and line breaks) or "off" (to turn off JSON output, the default)\&.
de: Zeigt die Ausgabe als JSON formatiert\&. Erwartet entweder »short« (für die kürzest mögliche Ausgabe ohne unnötigen Leerraum oder Zeilenumbrüche), »pretty« (für eine schönere Version der gleichen Ausgabe, mit Einzügen und Zeilenumbrüchen) oder »off« (um die standardmäßig aktivierte JSON-Ausgabe auszuschalten)\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: SIGNED \&.EFI FILES
de: SIGNIERTE \&.EFI-DATEIEN

source: B<bootctl> B<install> and B<update> will look for a B<systemd-boot> file ending with the "\&.efi\&.signed" suffix first, and copy that instead of the normal "\&.efi" file\&. This allows distributions or end-users to provide signed images for UEFI SecureBoot\&.
de: B<bootctl> B<install> und B<update> werden zuerst nach einer B<systemd-boot>-Datei mit der Endung »\&.efi\&.signed« suchen und diese statt der normalen Datei »\&.efi« kopieren. Dies ermöglicht es Distributionen oder Endbenutzern, signierte Abbilder für UEFI SecureBoot bereitzustellen\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If I<$SYSTEMD_RELAX_ESP_CHECKS=1> is set the validation checks for the ESP are relaxed, and the path specified with B<--esp-path=> may refer to any kind of file system on any kind of partition\&.
de: Falls I<$SYSTEMD_RELAX_ESP_CHECKS=1> gesetzt ist, werden die Gültigkeitsprüfungen für die ESP gelockert und der mit B<--esp-path=> angegebene Pfad kann sich auf jede Art von Dateisystem auf jeder Art von Partition beziehen\&.

source: Similarly, I<$SYSTEMD_RELAX_XBOOTLDR_CHECKS=1> turns off some validation checks for the Extended Boot Loader partition\&.
de: Ähnlich schaltet I<$SYSTEMD_RELAX_XBOOTLDR_CHECKS=1> einige Validierungsprüfungen für die »Extended Boot Loader«-Partition aus\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&Output from status and list>
de: B<Beispiel\ \&1.\ \&Ausgabe des Staus und der Liste>

source: $ B<bootctl status> System: Firmware: UEFI 2\&.40 (I<firmware-version>) ← firmware vendor and version Secure Boot: disabled (setup) ← secure boot status TPM2 Support: yes Boot into FW: supported ← does the firmware support booting into itself
de: $ B<bootctl status> System: Firmware: UEFI 2\&.40 (I<firmware-version>) ← Firmware-Lieferant und -Version Secure Boot: disabled (setup) ← Status des sicheren Systemstarts TPM2 Support: yes Boot into FW: supported ← Unterstützt die Firmware den Systemstart in sich selbst

source: Current Boot Loader: ← details about sd-boot or another boot loader Product: systemd-boot I<version> implementing the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2 Features: ✓ Boot counting ✓ Menu timeout control ✓ One-shot menu timeout control ✓ Default entry control ✓ One-shot entry control ✓ Support for XBOOTLDR partition ✓ Support for passing random seed to OS ✓ Load drop-in drivers ✓ Boot loader sets ESP information ESP: /dev/disk/by-partuuid/01234567-89ab-cdef-dead-beef00000000 File: └─/EFI/systemd/systemd-bootx64\&.efi
de: Current Boot Loader: ← Details über sd-boot oder ein anderes Systemstartladerprogramm, Product: systemd-boot I<version> das die \m[blue]B<Boot-Loader-Schnittstelle>\m[]\&\s-2\u[2]\d\s+2 implementiert Features: ✓ Boot counting ✓ Menu timeout control ✓ One-shot menu timeout control ✓ Default entry control ✓ One-shot entry control ✓ Support for XBOOTLDR partition ✓ Support for passing random seed to OS ✓ Load drop-in drivers ✓ Boot loader sets ESP information ESP: /dev/disk/by-partuuid/01234567-89ab-cdef-dead-beef00000000 File: └─/EFI/systemd/systemd-bootx64\&.efi

source: Random Seed: ← random seed used for entropy in early boot Passed to OS: yes System Token: set Exists: yes
de: Random Seed: ← Zufallsstartwert, der für Entropie in der frühen Systemstartphase verwandt wird Passed to OS: yes System Token: set Exists: yes

source: Default Boot Loader Entry: type: Boot Loader Specification Type #1 (\&.conf) title: Fedora Linux 36 (Workstation Edition) id: \&... source: /boot/efi/loader/entries/I<entry-token>-I<kernel-version>\&.conf version: I<kernel-version> machine-id: \&... linux: /I<entry-token>/I<kernel-version>/linux initrd: /I<entry-token>/I<kernel-version>/initrd options: root=\&...
de: Default Boot Loader Entry: type: Boot Loader Specification Type #1 (\&.conf) title: Fedora Linux 36 (Workstation Edition) id: … source: /boot/efi/loader/entries/I<Eintragsmerkmal>-I<Kernelversion>\&.conf version: I<Kernelversion> machine-id: … linux: /I<Eintragsmerkmal>/I<Kernelversion>/linux initrd: /I<Eintragsmerkmal>/I<Kernelversion>/initrd options: root=…

source: $ B<bootctl list> Boot Loader Entries: type: Boot Loader Specification Type #1 (\&.conf) title: Fedora Linux 36 (Workstation Edition) (default) (selected) id: \&... source: /boot/efi/loader/entries/I<entry-token>-I<kernel-version>\&.conf version: I<kernel-version> machine-id: \&... linux: /I<entry-token>/I<kernel-version>/linux initrd: /I<entry-token>/I<kernel-version>/initrd options: root=\&...
de: $ B<bootctl list> Boot Loader Entries: type: Boot Loader Specification Type #1 (\&.conf) title: Fedora Linux 36 (Workstation Edition) (default) (selected) id: … source: /boot/efi/loader/entries/I<Eintragsmerkmal>-I<Kernelversion>\&.conf version: I<Kernelversion> machine-id: … linux: /I<Eintragsmerkmal>/I<Kernelversion>/linux initrd: /I<Eintragsmerkmal>/I<Kernelversion>/initrd options: root=…

source: In the listing, "(default)" specifies the entry that will be used by default, and "(selected)" specifies the entry that was selected the last time (i\&.e\&. is currently running)\&.
de: In der Auflistung gibt »(default)« den Eintrag an, der standardmäßig verwandt wird und »(selected)« gibt den Eintrag an, der letztes Mal ausgewählt wurde (d\&.h\&. der aktuell läuft)\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<systemd-boot>(7), \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2, B<systemd-boot-system-token.service>(8)
de: B<systemd-boot>(7), \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2, B<systemd-boot-system-token.service>(8)

source: NOTES
de: ANMERKUNGEN

source: Boot Loader Specification
de: Systemladerspezifikation

source: Boot Loader Interface
de: Boot-Loader-Schnittstelle

source: Random Seeds
de: Zufallsstartwerte

source: Discoverable Partitions Specification
de: Spezifikation für auffindbare Partitionen

source: Note that this option (similar to the B<--print-booth-path> option mentioned above), is available independently from the boot loader used, i\&.e\&. also without B<systemd-boot> being installed\&.
de: Beachten Sie, dass diese Option (ähnlich der oben erwähnten Option B<--print-booth-path>) unabhängig vom verwandten Systemstartprogramm verfügbar ist, d\&.h\&. auch ohne dass B<systemd-boot> installiert ist\&.

source: Controls creation and deletion of the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 Type #1 entry directory on the file system containing resources such as kernel images and initial RAM disk images during B<install> and B<remove>, respectively\&. The directory is named after the entry token, as specified with B<--entry-token=> parameter described below, and is placed immediately below the I<$BOOT> root directory (i\&.e\&. beneath the file system returned by the B<--print-boot-path> option, see above)\&. Defaults to "no"\&.
de: Steuert die Erstellung und Löschung der \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 Typ-#1-Eintragsverzeichnisse auf dem Dateisystem, das die Ressourcen wie Kernelabbilder und anfängliche RAM-Plattenabbilder während B<install> bzw. B<remove> enthält\&. Das Verzeichnis wird nach dem Eintragsmerkmal benannt, wie dieses mit dem nachfolgend beschriebenen Parameter B<--entry-token=> angegeben wird, und wird direkt unterhalb des I<$BOOT> Wurzelverzeichnisses abgelegt (d\&.h\&. unterhalb des Dateisystems, das von der Option B<--print-boot-path> zurückgeliefert wird, siehe oben)\&. Standardmäßig »no«\&.

source: If set to B<os-id> the entries are named after the OS ID of the running system, i\&.e\&. the I<ID=> field of B<os-release>(5) (e\&.g\&. "fedora")\&. Similar, if set to B<os-image-id> the entries are named after the OS image ID of the running system, i\&.e\&. the I<IMAGE_ID=> field of os-release (e\&.g\&. "vendorx-cashier-system")\&.
de: Falls auf B<os-id> gesetzt, werden die Einträge nach der Betriebssystemkennung des laufenden Systems benannt, d\&.h\&. dem Feld I<ID=> von B<os-release>(5) (z\&.B\&. »fedora«)\&. Ähnlich werden die Einträge nach der Betriebssystem-Abbild-Kennung des laufenden Systems benannt, falls es auf B<os-image-id> gesetzt ist, d\&.h\&. dem Feld I<IMAGE_ID=> von B<os-release> (z\&.B\&. »vendorx-cashier-system«)\&.

source: Shows all available boot loader entries implementing the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, as well as any other entries discovered or automatically generated by a boot loader implementing the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2\&.
de: Zeigt alle verfügbaren Systemstartprogrammeinträge, die die \m[blue]B<Systemstartprogrammspezifikation>\m[]\&\s-2\u[1]\d\s+2 implementieren, sowie jeden anderen erkannten oder automatisch durch das Systemstartprogramm erstellten Eintrag, der durch ein Systemstartprogramm erstellt wurde, der die \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2 implementiert\&.

source: Sets the default boot loader entry\&. Takes a single boot loader entry ID string as argument\&. The B<set-oneshot> command will set the default entry only for the next boot, the B<set-default> will set it persistently for all future boots\&. Optionally, the boot loader entry ID may be specified as one of: B<@default>, B<@oneshot> or B<@current>, which correspond to the current default boot loader entry for all future boots, the current default boot loader entry for the next boot, and the currently booted boot loader entry\&. These special IDs are resolved to the current values of the EFI variables I<LoaderEntryDefault>, I<LoaderEntryOneShot> and I<LoaderEntrySelected>, see \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 for details\&. These special IDs are primarily useful as a quick way to persistently make the currently booted boot loader entry the default choice, or to upgrade the default boot loader entry for the next boot to the default boot loader entry for all future boots, but may be used for other operations too\&. When an empty string ("") is specified as an ID, then the corresponding EFI variable will be unset\&.
de: Setzt den Standard-Systemstartprogrammeintrag\&. Akzeptiert eine einzelne Systemstartprogrammeintragskennungszeichenkette als Argument\&. Der Befehl B<set-oneshot> setzt den Vorgabeeintrag nur für den nächsten Systemstart, B<set-default> setzt ihn dauerhaft für alle zukünftigen Systemstarts\&. Optional kann die Systemstartpogrammladeeintragskennung als eine der folgenden angegeben werden: B<@default>, B<@oneshot> oder B<@current>, was dem aktuellen Standardsystemstartladeeintrag für alle zukünftigen Systemstarts, dem aktuellen Vorgabe-Systemstartladeeintrag für den nächsten Systemstart und dem derzeit gestarteten Systemstartladeeintrag entspricht\&. Diese besonderen Kennungen werden auf die aktuellen Werte der EFI-Variablen I<LoaderEntryDefault>, I<LoaderEntryOneShot> und I<LoaderEntrySelected> aufgelöst, siehe \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 für Details\&. Diese besonderen Kennungen sind primär als schnelle Angabe nützlich, um den aktuellen Systemstartladeeintrag dauerhaft als Vorgabeauswahl zu setzen oder den aktuellen Systemstartladeeintrag für den nächsten Systemstart auf den Standard-Systemstartladeeintrag für alle zukünftigen Systemstarts zu aktualisieren, kann aber auch für andere Aktionen verwandt werden\&. Wenn die leere Zeichenkette ("") als Kennung angegeben wird, dann wird die entsprechende EFI-Variable zurückgesetzt\&.

source: Ignore failure when the EFI System Partition cannot be found, or when EFI variables cannot be written\&. Currently only applies to random seed operations\&.
de: Ignoriert Fehlschläge, wenn die EFI-Systempartition nicht gefunden oder die EFI-Variablen nicht geschrieben werden können\&. Derzeit nur bei Zufallsstartwertaktionen anwendbar\&.

source: Control creation and deletion of the top-level machine ID directory on the file system containing boot loader entries (i\&.e\&. beneath the file system returned by the B<--print-boot-path> option, see above) during B<install> and B<remove>, respectively\&. "auto" is equivalent to "yes" if /etc/machine-id resides on a filesystem other than tmpfs and "no" otherwise (in the latter case the machine ID is likely transient and hence should not be used persistently in the ESP)\&. Defaults to "auto"\&. See B<machine-id>(5) for details about the machine ID concept and file\&.
de: Steuert während B<install> bzw\&. B<remove> die Erstellung bzw\&. Vernichtung des Maschinenkennungs-Verzeichnisses auf oberster Ebene auf dem Dateisystem, das die Systemstartprogrammeinträge enthält (d\&.h\&. unterhalb des durch die Option B<--print-boot-path> zurückgelieferten Dateisystems, siehe oben)\&. »auto« ist äquivalent zu »yes«, falls /etc/machine-id sich auf einem Dateisystem befindet, das sich von tmpfs unterscheidet und andernfalls »no« (in letzterem Fall ist die Maschinenkennung wahrscheinlich flüchtig und sollte nicht zur dauerhaften Speicherung im ESP verwandt werden)\&. Standardmäßig »auto«\&. Siehe B<machine-id>(5) für Details zum Konzept der Maschinenkennung und der Datei\&.

source: Overriding this may be desirable to hide the machine ID from the (unencrypted) ESP, configure a B<kernel-install>(8) script, or, conversely, commit a transient machine ID\&.
de: Es mag wünschenswert sein, dies außer Kraft zu setzen, um die Maschinenkennung vor dem (unverschlüsselten) ESP zu verstecken, ein B<kernel-install>(8)-Skript zu konfigurieren oder, umgekehrt, eine flüchtige Maschinenkennung dauerhaft zu übergeben\&.

source: The top-level machine ID directory is useful to allow smooth multi-boot installations: each installed OS instance will have a different machine ID and thus a separate directory to place its boot-time resources in\&. If this feature is turned off with this option, care needs to be taken that multiple OS instances do not place conflicting files on the shared ESP and Extended Boot Loader Partitions, or that multiple OS instances are not possible\&.
de: Das Maschinenkennungs-Verzeichnis auf oberster Ebene erlaubt geschmeidige Übergänge bei Mehr-Betriebssystem-Installationen: Jede installierte Betriebssysteminstanz wird eine andere Maschinenkennung haben und daher ein getrenntes Verzeichnis, um seine Systemstart-Ressourcen darin zu speichern\&. Falls diese Funktionalität mit dieser Option ausgeschaltet wird, muss Sorge dafür getragen werden, dass verschiedene Betriebssysteminstanzen keine im Konflikt stehende Dateien in dem gemeinsam benutzten ESP und den Erweiterten-Systemlader-Partitionen ablegen oder dass meherere Betriebssysteminstanzen nicht möglich sind\&.
