Repository: sebras/manpages-l10n
Catalog: po/*/man1/bzexe.1.po
Languages: da

source: NAME
da: NAVN

source: bzexe - compress executable files in place
da: bzexe - komprimer kørbare filer på stedet

source: B<bzexe> [ name ... ]
da: B<bzexe> [ navn ... ]

source: DESCRIPTION
da: BESKRIVELSE

source: The I<bzexe> utility allows you to compress executables in place and have them automatically uncompress and execute when you run them (at a penalty in performance). For example if you execute ``bzexe /bin/cat'' it will create the following two files:
da: Redskabet I<bzexe> gør det muligt at komprimere kørbare filer på stedet og få dem automatisk udpakket igen og afviklet (med en straf i ydelsen). For eksempel hvis du afvikler »bzexe /bin/cat«, så vil redskabet oprette de følgende to filer:

source: /bin/cat~ is the original file and /bin/cat is the self-uncompressing executable file. You can remove /bin/cat~ once you are sure that /bin/cat works properly.
da: /bin/cat~ er den oprindelige fil, og /bin/cat er den selvstændigt udpakkende kørbare fil. Du kan fjerne /bin/cat~, når du er sikker på, at /bin/cat fungerer korrekt.

source: This utility is most useful on systems with very small disks.
da: Dette redskab er mest nyttigt på systemer med meget små diske.

source: OPTIONS
da: TILVALG

source: Decompress the given executables instead of compressing them.
da: Dekomprimer de angivne kørbare filer i stedet for at komprimere dem.

source: SEE ALSO
da: SE OGSÅ

source: CAVEATS
da: FORBEHOLD

source: The compressed executable is a shell script. This may create some security holes. In particular, the compressed executable relies on the PATH environment variable to find I<gzip> and some other utilities I<(tail, chmod, ln, sleep).>
da: Den komprimerede kørbare fil er et skalskript. Dette kan skabe nogle sikkerhedshuller. Den komprimerede kørbare filer afhænger af PATH-miljøvariablen for at finde I<gzip> og nogle andre redskaber I<(tail, chmod, ln, sleep).>

source: BUGS
da: FEJL

source: I<bzexe> attempts to retain the original file attributes on the compressed executable, but you may have to fix them manually in some cases, using I<chmod> or I<chown.>
da: I<bzexe> forsøger at bevare den oprindelige fils attributter på den komprimerede kørbare fil, men du skal måske rette dem manuelt i nogle tilfælde, via I<chmod> eller I<chown.>
