Repository: sebras/manpages-l10n
Catalog: po/*/man1/bzip2.1.po
Languages: es, fr, uk

source: NAME
es: NOMBRE
fr: NOM
uk: НАЗВА

source: bzip2, bunzip2 - a block-sorting file compressor, v1.0.8
es: bzip2, bunzip2 - un compresor de ficheros por ordenación de bloques, v1.0.8
fr: bzip2, bunzip2 - compresseur de fichiers par tri de blocs, v1.0.8
uk: bzip2, bunzip2 — програма для стискання файлів із упорядковуванням блоків, версія 1.0.8

source: bzcat - decompresses files to stdout
es: bzcat - descomprime ficheros hacia la salida estándar
fr: bzcat - décompresse les fichiers sur la sortie standard
uk: bzcat — розпакувати файли до стандартного виведення

source: bzip2recover - recovers data from damaged bzip2 files
es: bzip2recover - recupera datos desde ficheros bzip2 dañados
fr: bzip2recover - récupère des données de fichiers bzip2 endommagés
uk: bzip2recover — відновлює дані з пошкоджених файлів bzip2

source: SYNOPSIS
es: SINOPSIS
uk: КОРОТКИЙ ОПИС

source: B<bzip2> [B< -cdfkqstvzVL123456789 >] [ I<filenames \&...> ]
es: B<bzip2> [B< -cdfkqstvzVL123456789 >] [ I<ficheros \&...> ]
fr: B<bzip2> [B< -cdfkqstvzVL123456789 >] [ I<noms_fichiers \&...> ]
uk: B<bzip2> [B< -cdfkqstvzVL123456789 >] [ I<назви_файлів \&...> ]

source: B<bunzip2> [B< -fkvsVL >] [ I<filenames \&...> ]
es: B<bunzip2> [B< -fkvsVL >] [ I<ficheros \&...> ]
fr: B<bunzip2> [B< -fkvsVL >] [ I<noms_fichiers \&...> ]
uk: B<bunzip2> [B< -fkvsVL >] [ I<назви_файлів \&...> ]

source: B<bzcat> [B< -s >] [ I<filenames \&...> ]
es: B<bzcat> [B< -s >] [ I<ficheros \&...> ]
fr: B<bzcat> [B< -s >] [ I<noms_fichiers \&...> ]
uk: B<bzcat> [B< -s >] [ I<назви_файлів \&...> ]

source: B<bzip2recover> I<filename>
es: B<bzip2recover> I<fichero>
fr: B<bzip2recover> I<nom_fichier>
uk: B<bzip2recover> I<назва_файла>

source: DESCRIPTION
es: DESCRIPCIÓN
uk: ОПИС

source: I<bzip2> compresses files using the Burrows-Wheeler block sorting text compression algorithm, and Huffman coding. Compression is generally considerably better than that achieved by more conventional LZ77/LZ78-based compressors, and approaches the performance of the PPM family of statistical compressors.
es: I<bzip2> comprime ficheros utilizando el algoritmo de compresión de texto por ordenación de bloques de Burrows-Wheeler. Generalmente, la compresión obtenida es considerablemente mejor que la de compresores más convencionales basados en LZ77/LZ78, y se aproxima al rendimiento de la familia PPM de compresores estadísticos.
fr: B<bzip2> compresse des fichiers en utilisant l'algorithme de compression de texte par tri de blocs de Burrows-Wheeler et le codage d'Huffman. La compression est généralement nettement meilleure que celle atteinte par des compresseurs plus conventionnels basés sur LZ77/LZ78 et approche les performances de la famille des compresseurs statistiques PPM.
uk: I<bzip2> стискає файли за допомогою алгоритму стискання тексту із упорядкуванням блоків Берроуза-Вілера і кодування Гаффмана. Загалом, стискання є значно кращим за те, яке можна досягти звичайними засобами стискання на основі LZ77/LZ78 і досягає швидкодії сімейства статистичних засобів стискання PPM.

source: The command-line options are deliberately very similar to those of I<GNU gzip,> but they are not identical.
es: Las opciones de la línea de órdenes son deliberadamente muy similares a las de I<GNU gzip,> pero no son idénticas.
fr: Les options de ligne de commandes sont délibérément très similaires à celles de B<GNU gzip>, mais elles ne sont pas identiques.
uk: Параметри командного рядка є навмисно дуже подібними до параметрів командного рядка I<GNU gzip>, але вони не є ідентичними.

source: I<bzip2> expects a list of file names to accompany the command-line flags. Each file is replaced by a compressed version of itself, with the name "original_name.bz2". Each compressed file has the same modification date, permissions, and, when possible, ownership as the corresponding original, so that these properties can be correctly restored at decompression time. File name handling is naive in the sense that there is no mechanism for preserving original file names, permissions, ownerships or dates in filesystems which lack these concepts, or have serious file name length restrictions, such as MS-DOS.
fr: B<bzip2> attend une liste de noms de fichiers pour accompagner les options de ligne de commandes. Chaque fichier est remplacé par une version compressée de lui-même, avec le nom « nom_original.bz2 ». Chaque fichier compressé a la même date de modification, les mêmes permissions et, quand c'est possible, les mêmes propriétés que celles du fichier original, de sorte que ces caractéristiques peuvent être correctement restaurées au moment de la décompression. Le traitement du nom du fichier est naïf dans le sens qu'il n'y a pas de mécanisme pour préserver les noms, permissions, propriétés et dates des fichiers situés dans des systèmes de fichiers où ces concepts font défaut, ou qui souffrent de restrictions strictes sur la longueur des noms de fichiers, comme MS-DOS.
uk: Прапорці командного рядка у I<bzip2> має бути поєднано зі списком назв файлів. Кожен файл буде замінено його стисненою версією із назвою «початкова_назва.bz2». Усі стиснуті файли матимуть ту саму дату внесення змін, права доступу і, якщо можливо, власників, що і початковий файл, отже, ці властивості буде належним чином відновлено під час розпакування. Обробка назв файлів є наївною у сенсі того, що немає механізму для збереження початкових назв файлів, прав доступу, власників або дат у файлових системах, де таких понять взагалі немає або які мають серйозні обмеження на довжину назв файлів, як у MS-DOS.

source: I<bzip2> and I<bunzip2> will by default not overwrite existing files. If you want this to happen, specify the -f flag.
es: Por defecto, I<bzip2> y I<bunzip2> no sobreescribirán ficheros existentes. Si quieres que esto ocurra, especifica la opción -f.
fr: B<bzip2> et B<bunzip2>, par défaut, n'écraseront pas les fichiers existants. Si vous voulez que cela se produise, utilisez l'option B<-f>.
uk: Типово, I<bzip2> і I<bunzip2> не перезаписуватимуть наявних файлів. Якщо вам потрібен перезапис, скористайтеся параметром -f.

source: If no file names are specified, I<bzip2> compresses from standard input to standard output. In this case, I<bzip2> will decline to write compressed output to a terminal, as this would be entirely incomprehensible and therefore pointless.
es: Si no se especifica el nombre de ningún fichero, I<bzip2> comprimirá desde la entrada estándar hacia la salida estándar. En este caso, I<bzip2> se negará a escribir la salida comprimida hacia una terminal, ya que ésta sería totalmente incomprensible y por lo tanto inútil.
fr: Si aucun nom de fichier n'est indiqué, B<bzip2> compresse de l'entrée standard vers la sortie standard. Dans ce cas, B<bzip2> n'écrira pas la sortie compressée sur un terminal, puisque cela serait incompréhensible et donc inutile.
uk: Якщо назви файлів не буде вказано, I<bzip2> стискатиме дані зі стандартного джерела вхідних даних до стандартного виведення. У такому випадку, I<bzip2> відхилятиме запис стиснутих даних до термінала, оскільки читання цих даних у терміналі є неможливим, а тому не має сенсу.

source: I<bunzip2> (or I<bzip2 -d)> decompresses all specified files. Files which were not created by I<bzip2> will be detected and ignored, and a warning issued. I<bzip2> attempts to guess the filename for the decompressed file from that of the compressed file as follows:
es: I<bunzip2> (o I<bzip2 -d>) descomprime todos los archivos indicados. Aquellos que no hayan sido creados con I<bzip2> no se procesarán emitiéndose un mensaje de advertencia. I<bzip2> trata de averiguar el nombre del archivo descomprimido a partir del comprimido del siguiente modo:
fr: B<bunzip2> (ou B<bzip2 -d)> décompresse tous les fichiers spécifiés. Les fichiers qui n'ont pas été créés par B<bzip2> seront détectés et ignorés et un avertissement sera émis. B<bzip2> tente de deviner le nom du fichier pour le fichier décompressé à partir de celui du fichier compressé de la manière suivante :
uk: I<bunzip2> (або I<bzip2 -d)> розпаковує усі вказані файли. Програма виявить і проігнорує файли, які не було створено за допомогою I<bzip2>, а також видасть відповідне попередження. I<bzip2> намагатиметься визначити назву розпакованого файла за назвою запакованого файла у такий спосіб:

source: filename.bz2 becomes filename filename.bz becomes filename filename.tbz2 becomes filename.tar filename.tbz becomes filename.tar anyothername becomes anyothername.out
es: filename.bz2 pasa a llamarse filename filename.bz pasa a llamarse filename filename.tbz2 pasa a llamarse filename.tar filename.tbz pasa a llamarse filename.tar anyothername pasa a llamarse anyothername.out
fr: nom_fichier.bz2 devient nom_fichier nom_fichier.bz devient nom_fichier nom_fichier.tbz2 devient nom_fichier.tar nom_fichier.tbz devient nom_fichier.tar autre_nom devient autre_nom.out
uk: назвафайла.bz2 стане назвафайла назвафайла.bz стане назвафайла назвафайла.tbz2 стане назвафайла.tar назвафайла.tbz стане назвафайла.tar якасьіншаназва стане якасьіншаназва.out

source: If the file does not end in one of the recognised endings, I<.bz2,> I<.bz,> I<.tbz2> or I<.tbz,> I<bzip2> complains that it cannot guess the name of the original file, and uses the original name with I<.out> appended.
es: Si el archivo tiene una de las extensiones conocidas: I<.bz2,> I<.bz,> I<.tbz2> o bien I<.tbz>, I<bzip2> indicará que no puede adivinar el nombre del archivo original y empleará el nombre completo del mismo añadiéndole la exensión I<.out>.
fr: Si le nom du fichier ne se termine pas par une des terminaisons reconnues, I<.bz2>, I<.bz>, I<.tbz2> ou I<.tbz>, B<bzip2> signale qu'il ne peut pas deviner le nom du fichier original et utilise le nom d'origine en lui ajoutant I<.out>.
uk: Якщо суфікс назви файла не належатиме до одного із відомих програмі, I<.bz2,> I<.bz,> I<.tbz2> або I<.tbz,> I<bzip2> поскаржиться, що не може визначити назву початкового файла і скористається початковою назвою із дописуванням суфікса I<.out>.

source: As with compression, supplying no filenames causes decompression from standard input to standard output.
es: Al igual que para la compersión, si no se indica ningún nombre de archivo se intentará descomprimir la entrada estándar enviando el resultado por la salida estándar.
fr: Comme pour la compression, si aucun nom de fichier n'est fourni, la commande décompresse de l'entrée standard vers la sortie standard.
uk: Як і зі стисканням, якщо не буде вказано назв файлів, відбуватиметься розпаковування зі стандартного джерела вхідних даних до стандартного виведення.

source: I<bunzip2> will correctly decompress a file which is the concatenation of two or more compressed files. The result is the concatenation of the corresponding uncompressed files. Integrity testing (-t) of concatenated compressed files is also supported.
es: I<bunzip2> descomprimirá correctamente un fichero que sea la concatenación de uno o más ficheros comprimidos. El resultado es la concatenación de los correspondientes ficheros descomprimidos. Con (-t) se puede comprobar la integridad de ficheros concatenados comprimidos.
fr: B<bunzip2> décompressera correctement un fichier qui est la concaténation de deux fichiers compressés ou plus. Le résultat est la concaténation des fichiers non compressés correspondants. Le test d'intégrité (-t) des fichiers compressés concaténés est aussi prise en charge.
uk: I<bunzip2> належним чином розпакує файл, який є поєднанням двох або декількох стиснутих файлів. Результатом буде об'єднання відповідних нестиснутих файлів. Передбачено також підтримку перевірки цілісності (-t) об'єднаних стиснених файлів.

source: You can also compress or decompress files to the standard output by giving the -c flag. Multiple files may be compressed and decompressed like this. The resulting outputs are fed sequentially to stdout. Compression of multiple files in this manner generates a stream containing multiple compressed file representations. Such a stream can be decompressed correctly only by I<bzip2> version 0.9.0 or later. Earlier versions of I<bzip2> will stop after decompressing the first file in the stream.
es: También se pueden comprimir o descomprimir ficheros a la salida estándar utilizando la opción -c. Múltiples ficheros pueden ser comprimidos y descomprimidos de esta forma. Las salidas resultantes van siendo pasadas secuencialmente hacia la salida estándar. La compresión de múltiples ficheros de esta manera genera un flujo que contiene múltiples representaciones de ficheros. Tal flujo solo puede ser descomprimido correctamente por la versión 0.9.0 o superior de I<bzip2>; versiones anteriores de I<bzip2> pararán tras descomprimir el primer fichero del flujo.
fr: Il est également possible de compresser ou décompresser vers la sortie standard en fournissant l'option B<-c>. Plusieurs fichiers peuvent être compressés ou décompressés ainsi. Les sorties résultantes sont envoyées de façon séquentielle à la sortie standard. La compression de plusieurs fichiers de cette manière génère un flux contenant la représentation des divers fichiers compressés. Un flux de ce type ne peut être décompressé correctement que par B<bzip2> version 0.9.0 ou ultérieure. Les versions antérieures de B<bzip2> s'arrêtent après la décompression du premier fichier du flux.
uk: Ви також можете стиснути або розпакувати файли до стандартного виведення шляхом задання прапорця -c. У такий спосіб може бути стиснено або розпаковано одразу декілька файлів. Виведені результати буде послідовно надіслано до стандартного виведення. Стискання декількох файлів у цей спосіб створює потік даних, що містить представлення декількох стиснених файлів. Такий потік може бути належним чином розпаковано лише версією I<bzip2> 0.9.0 або новішими версіями. Попередні версії I<bzip2> зупинять розпакування після першого файла у потоці даних.

source: I<bzcat> (or I<bzip2 -dc)> decompresses all specified files to the standard output.
es: I<bzcat> (o I<bzip2 -dc)> descomprime todos los ficheros especificados hacia la salida estándar.
fr: B<bzcat> (ou B<bzip2 -dc)> décompresse tous les fichiers spécifiés vers la sortie standard.
uk: I<bzcat> (або I<bzip2 -dc)> розпаковує усі вказані файли до стандартного виведення.

source: I<bzip2> will read arguments from the environment variables I<BZIP2> and I<BZIP,> in that order, and will process them before any arguments read from the command line. This gives a convenient way to supply default arguments.
es: I<bzip2> considera los argumentos de las variables de entorno I<BZIP2> y I<BZIP> en ese orden, procesándolos antes de los argumentos indicados por el usuario en la línea de órdenes. Esta es la forma adecuada para indicar argumentos por defecto
fr: B<bzip2> lira les arguments à partir des variables d'environnement I<BZIP2> et I<BZIP>, dans cet ordre, et les traitera avant tout argument lu à partir de la ligne de commande. Cela offre une façon pratique de fournir des arguments par défaut.
uk: I<bzip2> читатиме аргументи зі змінних середовища I<BZIP2> і I<BZIP>, саме у такому порядку, і оброблятиме їх до будь-яких аргументів, які прочитано з рядка команди. Ці змінні є зручним способом надання типових аргументів.

source: Compression is always performed, even if the compressed file is slightly larger than the original. Files of less than about one hundred bytes tend to get larger, since the compression mechanism has a constant overhead in the region of 50 bytes. Random data (including the output of most file compressors) is coded at about 8.05 bits per byte, giving an expansion of around 0.5%.
es: La compresión siempre se realiza, incluso aunque el fichero comprimido sea ligeramente mayor que el original. Los ficheros de menos de cien bytes tienden a hacerse más grandes, ya que el mecanismo de compresión tiene una sobrecarga constante de unos 50 bytes. Datos aleatorios (incluyendo la salida de la mayoría de compresores) son codificados a unos 8.05 bits por byte, dando una expansión alrededor del 0.5%.
fr: La compression est toujours effectuée, même si le fichier compressé est légèrement plus grand que le fichier original. Les fichiers de moins d'une centaine d'octets ont tendance à s'agrandir dans la mesure où le mécanisme de compression comporte une surcharge constante de l'ordre de 50 octets. Des données aléatoires (y compris la sortie de la plupart des compresseurs de fichiers) sont codées à environ 8,05 bits par octet, aboutissant à une expansion autour de 0,5 %.
uk: Стискання виконуватиметься завжди, навіть якщо стиснутий файл є дещо більшим за початковий. Файли, розмір яких є меншим за приблизно сотню байтів, зазвичай, стають більшим, оскільки у механізму стискання є стале доповнення об'єму у розмірі 50 байтів. Випадкові дані (включно із виведеними більшістю засобів стискання даними) кодуються із щільністю 8,05 бітів на байт, що дає збільшення об'єму на приблизно 0,5%.

source: As a self-check for your protection, I<bzip2> uses 32-bit CRCs to make sure that the decompressed version of a file is identical to the original. This guards against corruption of the compressed data, and against undetected bugs in I<bzip2> (hopefully very unlikely). The chances of data corruption going undetected is microscopic, about one chance in four billion for each file processed. Be aware, though, that the check occurs upon decompression, so it can only tell you that something is wrong. It can't help you recover the original uncompressed data. You can use I<bzip2recover> to try to recover data from damaged files.
es: Como autocomprobación para tu protección, I<bzip2> utiliza CRCs de 32 bits para asegurarse de que la versión descomprimida de un fichero es idéntica a la original. Esto protege contra la corrupción de los datos comprimidos, y contra fallos sin detectar en I<bzip2> (afortunadamente es muy poco probable). La posibilidad de que la corrupción de datos pase desapercibida es microscópica, alrededor de una probabilidad entre cuatro billones por cada fichero procesado. Cuidado, sin embargo, con que la comprobación se realiza tras la descompresión, por lo que solo entonces se te informará de si algo está mal. El programa no te puede ayudar a recuperar los datos originales descomprimidos. Puede utilizar I<bzip2recover> para intentar recuperar los datos de ficheros dañados.
fr: En tant que vérification interne, B<bzip2> utilise des CRC 32 bits pour s'assurer que la version décompressée d'un fichier est identique au fichier d'origine. Ceci permet une protection contre la corruption des données compressées et contre des bogues non détectés de B<bzip2> (heureusement très improbable). La probabilité qu'une corruption de données passe inaperçue est infime, environ une chance sur 4 milliards pour chaque fichier compressé. Soyez conscients, toutefois, que la vérification se produit pendant la décompression, et qu'elle ne peut donc vous informer que lorsque quelque chose s'est mal passé. Cela ne peut pas vous aider à récupérer les données non compressées d'origine. Vous pouvez utiliser B<bzip2recover> pour essayer de récupérer des données de fichiers endommagés.
uk: Для самоперевірки і захисту ваших даних I<bzip2> використовує 32-бітові CRC для забезпечення ідентичності розпакованої версії файла оригіналу. Це охороняє стиснуті дані від пошкодження і невиявлених вад у I<bzip2> (сподіваємося, дуже малоймовірних). Ймовірність невиявленого пошкодження є дуже низькою, приблизно рівною відношенню одиниці до чотирьох мільярдів для кожного обробленого файла. Зважайте на те, що перевірка виконується при розпакуванні, тому програма може лише повідомити вам, що щось не так. Вона не допоможе вам відновити початкові нестиснені дані. ви можете скористатися I<bzip2recover>, щоб спробувати відновити дані із пошкоджених файлів.

source: Return values: 0 for a normal exit, 1 for environmental problems (file not found, invalid flags, I/O errors, &c), 2 to indicate a corrupt compressed file, 3 for an internal consistency error (eg, bug) which caused I<bzip2> to panic.
es: 0 para finalización normal, 1 para problemas de entorno (fichero no encontrado, opciones no válidas, errores de E/S, etc...), 3 para un error interno de consistencia (ej. un bug o fallo) que ha provocado que I<bzip2> se asuste.
fr: Valeurs de retour : B<0> pour une sortie normale, B<1> pour des problèmes d'environnement (fichier non trouvé, options invalides, erreurs d'entrée/sortie, etc.), B<2> pour indiquer un fichier compressé corrompu, B<3> pour une erreur de consistance interne (un bogue, par exemple) qui a fait paniquer B<bzip2>.
uk: Повернуті значення: 0 для звичайного виходу, 1 для проблем із середовищем (не знайдено файл, некоректні прапорці, помилки введення-виведення тощо), 2 для позначення пошкодженого стиснутого файла, 3 для помилки внутрішньої сумісності (наприклад вади), яка спричиняє паніку I<bzip2>.

source: OPTIONS
es: OPCIONES
uk: ПАРАМЕТРИ

source: Compress or decompress to standard output.
es: Comprime o descomprime la entrada estándar.
fr: Compresser ou décompresser vers la sortie standard.
uk: Стиснути або видобути у стандартне виведення.

source: Force decompression. I<bzip2,> I<bunzip2> and I<bzcat> are really the same program, and the decision about what actions to take is done on the basis of which name is used. This flag overrides that mechanism, and forces I<bzip2> to decompress.
es: Fuerza la descompresión. I<bzip2,> I<bunzip2> y I<bzcat> son en realidad el mismo programa, y la decisión sobre la acción a realizar se toma en función del nombre que se utilice. Esta opción ignora este mecanismo y hace que I<bzip2> descomprima.
fr: Forcer la décompression. B<bzip2>, B<bunzip2> et B<bzcat> constituent en fait le même programme, et la décision quant aux actions à entreprendre est déterminée sur la base du nom utilisé. Cette option annule ce mécanisme et force B<bzip2> à décompresser.
uk: Примусове розпакування. Насправді, I<bzip2>, I<bunzip2> і I<bzcat> це та сама програма, і визначення дії, яку має бути виконано, відбувається на основі використаної назви програми. Цей прапорець надає змогу перевизначити цей механізм і примусити I<bzip2> до виконання розпакування.

source: The complement to -d: forces compression, regardless of the invocation name.
es: El complementario a -d: fuerza la compresión, independientemente del nombre con que se invoque.
fr: Le complément de B<-d> : force la compression, quel que soit le nom d'invocation.
uk: Доповнення до -d: примусове стискання, незалежно від викликаної назви.

source: Check integrity of the specified file(s), but don't decompress them. This really performs a trial decompression and throws away the result.
es: Comprueba la integridad del fichero(s) especificado, pero no lo descomprime. En realidad se realiza una descompresión de prueba y se lanza el resultado.
fr: Vérifier l'intégrité des fichiers spécifiés, mais ne pas les décompresser. Cela réalise réellement une décompression d'essai et jette le résultat.
uk: Перевірити цілісність вказаних файлів, але не розпаковувати їх. Насправді, програма виконує тестове розпакування і повідомляє результат.
