Repository: sebras/manpages-l10n
Catalog: po/*/man1/bzip2.1.po
Languages: es, fr, uk

source: Force overwrite of output files. Normally, I<bzip2> will not overwrite existing output files. Also forces I<bzip2> to break hard links to files, which it otherwise wouldn't do.
es: Fuerza la sobrescritura de los archivos de salida. En general, I<bzip2> no sobreescribe archivos ya existentes. También hace que I<bzip2> rompa enlaces duros a archivos, de otro modo no lo haría.
fr: Forcer l'écrasement des fichiers en sortie. Normalement, B<bzip2> n'écrasera pas les fichiers de sortie préexistants. L'option force également B<bzip2> à briser les liens physiques (hard links) de fichiers, ce qu'il ne ferait pas autrement.
uk: Примусово перезаписувати виведені файли. Зазвичай, I<bzip2> не перезаписуватиме наявних виведених файлів. Використання параметра також призведе до примусового розірвання I<bzip2> жорстких посилань на файли. Без цього параметра програма не розриватиме жорстких посилань.

source: bzip2 normally declines to decompress files which don't have the correct magic header bytes. If forced (-f), however, it will pass such files through unmodified. This is how GNU gzip behaves.
es: en general, bzip2 no acepta descomprimir archivos sin el byte mágico del encabezado. Si se fuerza a hacerlo, (-f) pasará estos archivos sin modificarlos. Este es el comportamiento de GNU gzip.
fr: Normalement, B<bzip2> refuse de décompresser des fichiers qui ne possèdent pas les octets magiques d'en-tête corrects. Néanmoins, s'il est forcé (B<-f>), néanmoins, il passe ces fichiers sans les modifier. C'est ainsi que B<GNU gzip> se comporte.
uk: Зазвичай, bzip2 відмовляється розпаковувати файли, у яких немає належних байтів контрольної суми у заголовку. Втім, у примусовому режимі (-f) програма передає такі файли без змін. Так поводиться GNU gzip.

source: Keep (don't delete) input files during compression or decompression.
es: Mantener (no borrar) los ficheros de entrada durante la compresión o la descompresión.
fr: conserver (ne pas supprimer) les fichiers d'entrée durant la compression ou la décompression.
uk: Зберігати (не вилучати) файли вхідних даних під час стискання або розпаковування.

source: Reduce memory usage, for compression, decompression and testing. Files are decompressed and tested using a modified algorithm which only requires 2.5 bytes per block byte. This means any file can be decompressed in 2300k of memory, albeit at about half the normal speed.
es: Reduce la utilización de memoria para la compresión, la descompresión y la comprobación. Los ficheros son descomprimidos y comprobados utilizando un algoritmo modificado que solo requiere 2.5 bytes por cada byte del bloque. Esto significa que cualquier fichero puede ser descomprimido en 2300k de memoria, aunque a la mitad de la velocidad normal.
fr: Réduire l'utilisation de la mémoire pour la compression, la décompression et la vérification. Les fichiers sont décompressés et testés en utilisant un algorithme modifié qui requiert uniquement 2,5 octets par bloc d'un octet. Cela signifie que tout fichier peut être décompressé dans 2 300 Ko de mémoire, même s'il le sera à une vitesse deux fois plus lente que la vitesse normale.
uk: Зменшити використання пам'яті для стискання, розпакування та тестування. Файли буде розпаковано і перевірено за допомогою зміненого алгоритму, який потребує лише 2,5 байтів на блоковий байт. Це означає, щоб будь-який файл можна буде розпакувати у 2300 кБ пам'яті, хоча і у половину звичайної швидкості.

source: During compression, -s selects a block size of 200k, which limits memory use to around the same figure, at the expense of your compression ratio. In short, if your machine is low on memory (8 megabytes or less), use -s for everything. See MEMORY MANAGEMENT below.
es: Durante la compresión, -s selecciona un tamaño de bloque de 200k, lo que limita el uso de memoria a aproximadamente el mismo número, a expensas del porcentaje de compresión. En pocas palabras, si su máquina no tiene mucha memoria (8 megabytes o menos), utilice -s para todo. Vea CONTROL DE MEMORIA más adelante.
fr: Durant la compression, B<-s> sélectionne une taille de bloc de 200 Ko, ce qui limite l'utilisation de mémoire au même nombre environ, aux dépens du coefficient de compression. Bref, si votre machine possède peu de mémoire vive (8 Mo ou moins), utilisez B<-s> pour tout ce que vous faites. Voir GESTION DE LA MÉMOIRE plus bas.
uk: Під час стискання -s вибирає розмір блоку у 200 кБ, що обмежує використання пам'яті майже до тих самих значень за рахунок коефіцієнта стискання. Якщо коротко, якщо на вашому комп'ютері замало оперативної пам'яті (8 мегабайтів або менше), користуйтеся -s для усього. Див. КЕРУВАННЯ ПАМ'ЯТТЮ нижче.

source: Suppress non-essential warning messages. Messages pertaining to I/O errors and other critical events will not be suppressed.
es: Evita mostrar mensajes de aviso poco importantes. Aquellos que indiquen errores de E/S y críticos sí se mostrarán.
fr: Supprimer les messages d'avertissement non essentiels. Les messages se rattachant aux erreurs d'E/S et à d'autres événements critiques ne sont pas supprimés.
uk: Придушити неважливі повідомлення-попередження. Повідомлення про помилки введення-виведення та інші критичні події не буде придушено.

source: Verbose mode -- show the compression ratio for each file processed. Further -v's increase the verbosity level, spewing out lots of information which is primarily of interest for diagnostic purposes.
es: Modo extenso (muestra el porcentaje de compresión para cada fichero procesado). El uso de más opciones -v incrementa el nivel de extensión, arrojando gran cantidad de información principalmente de interés para usos de diagnóstico.
fr: Mode bavard – montre le coefficient de compression pour chaque fichier traité. Des B<-v> supplémentaires augmentent le niveau de détail, en affichant des tas d'informations qui sont principalement utiles à des fins de diagnostic.
uk: Режим докладних повідомлень — показувати коефіцієнт стискання для усіх оброблених файлів. Додаткові -v збільшують рівень докладності, надаючи доступ до значного масиву інформації, яка, в основному, буде цікавою з метою діагностики.

source: Display the software version, license terms and conditions.
es: Muestra la versión del programa, los términos de la licencia y sus condiciones.
fr: Afficher la version du logiciel, les termes de sa licence et les conditions d'utilisation.
uk: Вивести дані щодо версії програми та умов ліцензування.

source: B<-1 (or --fast) to -9 (or --best)>
es: B<-1 (o --fast) para -9 (o --best)>
fr: B<-1 (ou --fast) à -9 (ou --best)>
uk: B<-1 (або --fast) до -9 (або --best)>

source: Set the block size to 100 k, 200 k .. 900 k when compressing. Has no effect when decompressing. See MEMORY MANAGEMENT below. The --fast and --best aliases are primarily for GNU gzip compatibility. In particular, --fast doesn't make things significantly faster. And --best merely selects the default behaviour.
fr: Fixer la taille de bloc à 100, 200, ... 900 ko pendant la compression. Cette option n'a aucun effet sur la décompression. Voir GESTION DE LA MÉMOIRE ci-dessous. Les alias B<--fast> et B< --best> existent principalement pour la compatibilité avec GNU B<gzip>. En particulier, B<--fast> ne rend pas les traitements significativement plus rapides. Et B< --best> sélectionne simplement le comportement par défaut.
uk: Встановити розмір блоку 100 кБ, 200 кБ ... 900 кБ при стисканні. Не діє при розпаковуванні. Див. КЕРУВАННЯ ПАМ'ЯТТЮ нижче. Альтернативи --fast і --best призначено, в основному, для сумісності з GNU gzip. Зокрема, --fast не робить обробку аж надто швидшою, а --best, фактично, вибирає типову поведінку.

source: Treats all subsequent arguments as file names, even if they start with a dash. This is so you can handle files with names beginning with a dash, for example: bzip2 -- -myfilename.
fr: Traite tous les arguments suivants comme des noms de fichier, même s'ils débutent par un tiret. Il est ainsi possible de traiter des fichiers dont le nom débute par un tiret, par exemple « bzip2 -- -mon_fichier ».
uk: Вважати наступні аргументи назвами файлів, навіть якщо вони починаються з дефіса. Цей параметр уможливлює роботу із файлами, назви яких починаються з дефіса. Приклад: bzip2 -- -назва_мого_файла.

source: These flags are redundant in versions 0.9.5 and above. They provided some coarse control over the behaviour of the sorting algorithm in earlier versions, which was sometimes useful. 0.9.5 and above have an improved algorithm which renders these flags irrelevant.
fr: Ces options sont redondantes dans les versions 0.9.5 et ultérieures. Elles fournissent un contrôle assez grossier sur le comportement de l'algorithme de tri dans les versions antérieures, ce qui était parfois utile. Les versions 0.9.5 et ultérieures disposent d'un algorithme amélioré qui rend l'usage de ces options inutile.
uk: Ці прапорці є зайвими, починаючи з версії 0.9.5. Вони забезпечували певний грубий контроль над поведінкою алгоритму сортування у ранніх версіях програми, коли він іноді був корисним. У версіях 0.9.5 і новіших було удосконалено алгоритм, що зробило ці прапорці непотрібними.

source: MEMORY MANAGEMENT
es: CONTROL DE MEMORIA
fr: GESTION DE LA MÉMOIRE
uk: КЕРУВАННЯ ПАМ'ЯТТЮ

source: I<bzip2> compresses large files in blocks. The block size affects both the compression ratio achieved, and the amount of memory needed for compression and decompression. The flags -1 through -9 specify the block size to be 100,000 bytes through 900,000 bytes (the default) respectively. At decompression time, the block size used for compression is read from the header of the compressed file, and I<bunzip2> then allocates itself just enough memory to decompress the file. Since block sizes are stored in compressed files, it follows that the flags -1 to -9 are irrelevant to and so ignored during decompression.
fr: B<bzip2> compresse des fichiers importants par blocs. La taille de bloc affecte à la fois le coefficient de compression atteint et la quantité de mémoire nécessaire pour la compression et la décompression. Les options B<-1> à B<-9> précisent la taille de bloc utilisée, de 100 000 octets à 900 000 octets (par défaut) respectivement. Au moment de la décompression, la taille de bloc utilisée pour la compression est lue à partir de l'en-tête du fichier compressé, et B<bunzip2> s'alloue ensuite juste assez de mémoire pour décompresser le fichier. Puisque les tailles de blocs sont conservées dans les fichiers compressés, il s'ensuit que les options B<-1> à B<-9> ne sont pas pertinentes et qu'elles sont donc ignorées durant la décompression.
uk: I<bzip2> стискає великі файли блоками. Розмір блоку впливає на досягнутий коефіцієнт стискання і об'єм пам'яті, потрібний для стискання та розпаковування. Прапорці від -1 до -9 визначають розмір блоку від 100000 байтів до 900000 байтів (типово), відповідно. Під час розпаковування розмір блоку, використаний для стикання, буде прочитано із заголовка стиснутого файла, а I<bunzip2> потім отримує саме стільки оперативної пам'яті, скільки потрібно для розпаковування файла. Оскільки розміри блоків зберігаються у стиснутих файлах, прапорці від -1 до -9 є непотрібними при розпаковуванні, а тому їх буде проігноровано.

source: Compression and decompression requirements, in bytes, can be estimated as:
fr: Les besoins en mémoire de la compression et de la décompression, en octets, peuvent être estimés à :
uk: Вимоги щодо стискання і розпакування, у байтах, мають такі оцінки:

source: Compression: 400k + ( 8 x block size )
es: Compresión: 400k + ( 8 x tamaño de bloque )
fr: Compression : 400k + ( 8 x taille de bloc )
uk: Стискання: 400кБ + ( 8 x розмір блоку )

source: Decompression: 100k + ( 4 x block size ), or 100k + ( 2.5 x block size )
es: Descompresión: 100k + ( 4 x tamaño de bloque ), o 100k + ( 2.5 x tamaño de bloque )
fr: Décompression : 100k + ( 4 x taille de bloc ), ou 100k + ( 2.5 x taille de bloc )
uk: Розпакування: 100кБ + ( 4 x розмір блоку ) або 100кБ + ( 2,5 x розмір блоку )

source: Larger block sizes give rapidly diminishing marginal returns. Most of the compression comes from the first two or three hundred k of block size, a fact worth bearing in mind when using I<bzip2> on small machines. It is also important to appreciate that the decompression memory requirement is set at compression time by the choice of block size.
es: Los tamaños de bloques más grandes producen rápidamente resultados marginales cada vez más pequeños. La mayor parte de la compresión procede de los primeros doscientos o trecientos KBs de tamaño de bloque, un hecho a considerar cuando se utilice I<bzip2> en máquinas pequeñas. También es importante apreciar que los requerimientos de memoria en la descompresión vienen dados por el tamaño de bloque elegido en la compresión.
fr: Des largeurs de blocs plus importantes voient les bénéfices marginaux retirés diminuer rapidement. L'essentiel de la compression provient des deux ou trois cents premiers ko de la taille de bloc, un fait à retenir quand on utilise B<bzip2> sur de petites machines. Il est également important de savoir que les exigences mémoire de la décompression sont fixées au moment de la compression par le choix d'une taille de bloc.
uk: Збільшення розмірів блоку дає певні переваги, які швидко зменшуються зі зростанням розмірів. Найбільше покращення спостерігається на перших двох або трьох сотнях кілобайтів розмірів блоків. На цей факт слід звернути увагу, коли ви користуєтеся I<bzip2> на малопотужних комп'ютерах. Також важливо зважати на те, що вимоги щодо пам'яті для розпаковування буде встановлено при стисканні вибором розміру блоку.

source: For files compressed with the default 900k block size, I<bunzip2> will require about 3700 kbytes to decompress. To support decompression of any file on a 4 megabyte machine, I<bunzip2> has an option to decompress using approximately half this amount of memory, about 2300 kbytes. Decompression speed is also halved, so you should use this option only where necessary. The relevant flag is -s.
es: Para ficheros comprimidos con el tamaño de bloque por defecto de 900k, I<bunzip2> requerirá aproximadamente 3700 kbytes para descomprimir. Para soportar la descompresión de cualquier fichero en una máquina de 4MB, I<bunzip2> tiene una opción para descomprimir utilizando aproximadamente la mitad de esta cantidad de memoria, unos 2300 kbytes. La velocidad de descompresión también se divide entre dos, por lo que solo se debe utilizar cuando sea necesario. La opción mencionada es -s.
fr: Pour les fichiers compressés avec la taille de bloc par défaut de 900 Ko, B<bunzip2> aura besoin d'environ 3 700 Ko pour la décompression. Pour permettre la décompression de tout fichier sur une machine avec 4 Mo de RAM, B<bunzip2> possède une option pour décompresser en n'utilisant que la moitié environ de ces 3 700 Ko, à savoir à peu près 2 300 Ko. Malheureusement, la vitesse de décompression est également réduite de moitié, donc vous ne devriez utiliser cette option (B<-s>) qu'en cas de nécessité absolue.
uk: Для файлів, які стиснуто з типовим розміром блоку 900 кБ, I<bunzip2> потребуватиме близько 3700 кілобайтів для розпаковування. Для розпаковування будь-якого файла на комп'ютері з 4 мегабайтами оперативної пам'яті у I<bunzip2> передбачено параметр для розпаковування за допомогою приблизно половини цього об'єму пам'яті, близько 2300 кілобайтів. Швидкість розпаковування також зменшиться удвічі, тому вам слід користуватися цим параметром лише там, де у цьому є потреба. Відповідним прапорцем є -s.

source: In general, try and use the largest block size memory constraints allow, since that maximises the compression achieved. Compression and decompression speed are virtually unaffected by block size.
es: En general, intenta utilizar el mayor tamaño de bloque que permita la cantidad de memoria de tu sistema, puesto que esto maximiza la compresión conseguida. La velocidad de compresión y descompresión no se ven prácticamente afectadas por el tamaño de bloque.
fr: En général, essayez d'utiliser la taille de bloc mémoire la plus grande permise, puisque cela maximise la qualité de la compression atteinte. Les vitesses de compression et de décompression ne sont en fait pas affectées par la taille de bloc.
uk: Загалом, спробуйте скористатися найбільшим за обмеженням розміром блоку у пам'яті, оскільки це робить максимальним стискання. Розмір блоку майже не впливає на швидкість стискання або розпаковування.

source: Another significant point applies to files which fit in a single block -- that means most files you'd encounter using a large block size. The amount of real memory touched is proportional to the size of the file, since the file is smaller than a block. For example, compressing a file 20,000 bytes long with the flag -9 will cause the compressor to allocate around 7600k of memory, but only touch 400k + 20000 * 8 = 560 kbytes of it. Similarly, the decompressor will allocate 3700k but only touch 100k + 20000 * 4 = 180 kbytes.
es: Otro punto importante tiene que ver con los ficheros que caben en un solo bloque -- eso equivale a la mayoría de ficheros que encontrará usando grandes tamaños de bloque. La cantidad de memoria utilizada es proporcional al tamaño del fichero, ya que el fichero es más pequeño que un bloque. Por ejemplo, comprimir un fichero de 20.000 bytes con la opción -9 hará que el compresor se asigne unos 7600k de memoria, pero solo utilice 400k + 20000 * 8 = 560 kilobytes de ella. De forma similar, el descompresor se asignará 3700k pero solo utilizará 100k + 20000 * 4 = 180 kbytes.
fr: Un autres aspect significatif s'applique aux fichiers qui peuvent tenir dans un seul bloc – c'est-à-dire la plupart des fichiers que vous rencontrez en utilisant une grande taille de bloc. La quantité réelle de mémoire utilisée est proportionnelle à la taille du fichier, puisque le fichier est plus petit qu'un bloc. Par exemple, compresser un fichier de 20 000 octets avec l'option B<-9> forcera le compresseur à allouer environ 7 600 Ko de mémoire, mais n'en utilisera réellement que 400 Ko + 20 000 * 8 = 560 Ko. De même, le décompresseur allouera 3 700 Ko mais n'utilisera que 100 Ko + 20 000 * 4 = 180 Ko.
uk: Інше важливе зауваження стосується файлів, які вкладаються у один блок — тобто більшості файлів, з якими ви можете мати справу, коли користуєтеся великим розміром блоку. Справжній об'єм пам'яті є пропорційним до розміру файла, оскільки розмір файла є меншим за розмір блоку. Наприклад, стискання файла у 20000 байтів із прапорцем -9 призведе до отримання засобом стискання близько 7600 кБ оперативної пам'яті, але використано буде лише 400 кБ + 20000 * 8 = 560 кілобайтів з цієї пам'яті. Так само, засіб розпаковування отримає 3700 кБ оперативної пам'яті, але використає лише 100 кБ + 20000 * 4 = 180 кілобайтів.

source: Here is a table which summarises the maximum memory usage for different block sizes. Also recorded is the total compressed size for 14 files of the Calgary Text Compression Corpus totalling 3,141,622 bytes. This column gives some feel for how compression varies with block size. These figures tend to understate the advantage of larger block sizes for larger files, since the Corpus is dominated by smaller files.
es: Aquí está una tabla que resume la utilización máxima de memoria para los diferentes tamaños de bloque. También se recoge el tamaño total resultante de compresión de 14 ficheros del "Calgary Text Compression Corpus" que sumaban 3,141,622 bytes. Esta columna da una idea de como varía la compresión en función del tamaño de bloque. Estos datos no llegan a dar una verdadera idea de la ventaja de tamaños de bloque grandes para ficheros grandes, ya que el Corpus está dominado por ficheros pequeños.
fr: Voici une table qui résume l'utilisation maximale de la mémoire pour différentes tailles de blocs, ainsi que la taille compressée totale de 14 fichiers du Calgary Text Compression Corpus totalisant 3 141 622 octets. Cette table donne un certain aperçu sur l'évolution de la compression avec la taille de bloc. Ces chiffres tendent à minimiser l'avantage des tailles de blocs plus importantes pour les fichiers plus imposants, car le Corpus est dominé par des petits fichiers.
uk: Нижче наведено таблицю із резюме щодо максимального використання пам'яті для різних розмірів блоків. Також записано загальний стиснений розмір для 14 файлів з набору для стискання тексту Калгарі, загальний об'єм даних у яких складає 3141622 байти. Цей стовпчик дає емпіричні дані щодо того, як залежить стискання від розміру блоку. Наведені дані дещо занижують переваги використання більшого розміру блоку для великих файлів, оскільки у використаному наборі переважно малі файли.

source: Compress Decompress Decompress Corpus Flag usage usage -s usage Size
es: Uso al Uso al Descomp. Tamaño Opción comprimir descomp. usando -s del Corpus
fr: Usage Usage Usage Taille du Option compr. décompr. décompr. -s Corpus
uk: Використано Використано Використано Розмір Прапорець стискання розпак. розпак. -s набору

source: -1 1200k 500k 350k 914704 -2 2000k 900k 600k 877703 -3 2800k 1300k 850k 860338 -4 3600k 1700k 1100k 846899 -5 4400k 2100k 1350k 845160 -6 5200k 2500k 1600k 838626 -7 6100k 2900k 1850k 834096 -8 6800k 3300k 2100k 828642 -9 7600k 3700k 2350k 828642
uk: -1 1200 кБ 500 кБ 350 кБ 914704 -2 2000 кБ 900 кБ 600 кБ 877703 -3 2800 кБ 1300 кБ 850 кБ 860338 -4 3600 кБ 1700 кБ 1100 кБ 846899 -5 4400 кБ 2100 кБ 1350 кБ 845160 -6 5200 кБ 2500 кБ 1600 кБ 838626 -7 6100 кБ 2900 кБ 1850 кБ 834096 -8 6800 кБ 3300 кБ 2100 кБ 828642 -9 7600 кБ 3700 кБ 2350 кБ 828642

source: RECOVERING DATA FROM DAMAGED FILES
es: RESCATANDO DATOS DESDE ARCHIVOS DAÑADOS
fr: RÉCUPÉRATION DE DONNÉES DE FICHIERS ENDOMMAGÉS
uk: ВІДНОВЛЕННЯ ДАНИХ З ПОШКОДЖЕНИХ ФАЙЛІВ

source: I<bzip2> compresses files in blocks, usually 900kbytes long. Each block is handled independently. If a media or transmission error causes a multi-block .bz2 file to become damaged, it may be possible to recover data from the undamaged blocks in the file.
es: I<bzip2> comprime los ficheros en bloques, normalmente de 900kbytes. Cada bloque se maneja de manera independiente. Si un error de transmisión o del medio (físico) provoca que un fichero .bz2 multibloque sea dañado, puede que sea posible recuperar los datos de los bloques intactos que queden en el fichero.
fr: B<bzip2> compresse les fichiers en blocs d'une longueur d'habituellement 900 Ko. Chaque bloc est traité indépendamment des autres. Si un défaut du support physique ou une erreur de transmission provoque l'endommagement d'un fichier multi-blocs, il peut être possible de récupérer des données à partir des blocs non endommagés du fichier.
uk: I<bzip2> стискає файли блоками, розмір яких, зазвичай, дорівнює 900 кілобайтів. Обробка кожного блоку відбувається незалежно. Якщо помилка під час зберігання на носії даних або передавання даних спричиняє пошкодження даних у багатоблоковому файлі .bz2, дані з непошкоджених блоків файла можна відновити.
