Repository: sebras/manpages-l10n
Catalog: po/*/man1/bzip2.1.po
Languages: es, fr, uk

source: The compressed representation of each block is delimited by a 48-bit pattern, which makes it possible to find the block boundaries with reasonable certainty. Each block also carries its own 32-bit CRC, so damaged blocks can be distinguished from undamaged ones.
es: La representación comprimida de cada bloque está delimitada por un patrón de 48 bits, lo que hace posible el encontrar los límites de los bloques con cierta certeza. Cada bloque contiene su propio CRC de 32 bit, por lo que los bloques dañados puedes ser distinguidos de los intactos.
fr: La représentation compressée de chaque bloc est délimitée par un motif de 48 bits, ce qui permet de trouver les limites des blocs avec une probabilité raisonnable. Chaque bloc comporte également son propre CRC 32 bits, de sorte que les blocs corrompus peuvent être distingués des autres.
uk: Стиснене представлення кожного з блоків обмежено 48-бітовим взірцем, який уможливлює пошук меж блоків з прийнятною точністю. Також у кожному з блоків зберігається його власна 32-бітова контрольна сума CRC, тому пошкоджені блоки можна відрізнити від непошкоджених.

source: I<bzip2recover> is a simple program whose purpose is to search for blocks in .bz2 files, and write each block out into its own .bz2 file. You can then use I<bzip2> -t to test the integrity of the resulting files, and decompress those which are undamaged.
es: I<bzip2recover> es un simple programa cuyo único propósito es la búsqueda de bloques en ficheros .bz2, para su posterior escritura en su propio fichero .bz2. Entonces puede utilizar I<bzip2> -t para comprobar la integridad de los ficheros resultantes y descomprimir aquellos que estén intactos.
fr: B<bzip2recover> est un programme simple dont le but est de rechercher les blocs dans les fichiers I<.bz2>, et d'écrire chaque bloc détecté dans son propre fichier I<.bz2>. Vous pouvez alors utiliser B<bzip2> B<-t> pour tester l'intégrité des fichiers résultants et décompresser ceux qui ne sont pas endommagés.
uk: I<bzip2recover> — проста програма, призначенням якої є пошук блоків у файлах .bz2 і запис кожного з блоків до власного файла .bz2. Ви можете скористатися I<bzip2> -t для перевірки цілісності отриманих файлів та розпакування тих з них, які не пошкоджено.

source: I<bzip2recover> takes a single argument, the name of the damaged file, and writes a number of files "rec00001file.bz2", "rec00002file.bz2", etc, containing the extracted blocks. The output filenames are designed so that the use of wildcards in subsequent processing -- for example, "bzip2 -dc rec*file.bz2 E<gt> recovered_data" -- processes the files in the correct order.
es: I<bzip2recover> acepta un solo argumento: el nombre del archivo dañado, y crea un grupo de archivos "rec0001archivo.bz2", "rec0002archivo.bz2", etc, con los bloques extraídos. Los nombres de salida están diseñados de forma que la utilización de comodines en un procesado posterior (por ejemplo, "bzip2 -dc rec*file.bz2 E<gt> recovered_data") los liste en el orden "correcto".
fr: B<bzip2recover> prend un seul argument, le nom du fichier endommagé, et écrit un certain nombre de fichiers « rec0001file.bz2 », « rec0002file.bz2 », etc, contenant les blocs extraits. Les noms de fichiers en sortie sont conçus de sorte que l'utilisation de jokers (wildcards) dans des traitements ultérieurs – par exemple, « bzip2 -dc rec*file.bz2 E<gt> données_récupérées » – liste les fichiers dans le bon ordre.
uk: I<bzip2recover> приймає єдиний аргумент, назву пошкодженого файла, і записує послідовність файлів «rec00001filebz2», «rec00002file.bz2» тощо, у яких містяться видобуті блоки. Назви файлів-результатів створено таким чином, щоб можна було скористатися шаблонами заміни для подальшої обробки — наприклад, «bzip2 -dc rec*file.bz2 E<gt> відновлені_дані» — обробить файли у належній послідовності.

source: I<bzip2recover> should be of most use dealing with large .bz2 files, as these will contain many blocks. It is clearly futile to use it on damaged single-block files, since a damaged block cannot be recovered. If you wish to minimise any potential data loss through media or transmission errors, you might consider compressing with a smaller block size.
es: I<bzip2recover> será de mayor provecho cuando trate ficheros .bz2 grandes, ya que estos contendrán muchos bloques. Es inútil utilizarlo en ficheros de un solo bloque dañados, ya que el bloque dañado no podrá ser recuperado. Si desea minimizar cualquier posible perdida de datos debida a un error del medio físico o de la transmisión, puede considerar la utilización de tamaños de bloque menores en la compresión.
fr: B<bzip2recover> devrait être utilisé principalement pour traiter les grands fichiers I<.bz2>, puisque ceux-ci contiennent de nombreux blocs. Il est clairement inutile d'essayer de l'utiliser sur des fichiers endommagés d'un seul bloc, car un seul bloc endommagé ne peut pas être récupéré. Si vous voulez minimiser toute perte potentielle de données à cause d'erreurs de transmission, vous devriez envisager d'utiliser une taille de bloc plus restreinte.
uk: I<bzip2recover> найкраще працює з великими файлами .bz2, оскільки вони складаються з багатьох блоків. Очевидно, марно сподіватися, що програмою можна буде скористатися для файлів, які складаються з одного блоку, оскільки пошкоджений блок не можна буде відновити. Якщо ви хочете мінімізувати потенційну ймовірність втрати даних через помилки на носії даних або під час передавання даних, варто використовувати менший розмір блоку.

source: PERFORMANCE NOTES
es: NOTAS SOBRE El FUNCIONAMIENTO DEL PROGRAMA
fr: NOTES SUR LES PERFORMANCES
uk: НОТАТКИ ЩОДО ШВИДКОДІЇ

source: The sorting phase of compression gathers together similar strings in the file. Because of this, files containing very long runs of repeated symbols, like "aabaabaabaab ..." (repeated several hundred times) may compress more slowly than normal. Versions 0.9.5 and above fare much better than previous versions in this respect. The ratio between worst-case and average-case compression time is in the region of 10:1. For previous versions, this figure was more like 100:1. You can use the -vvvv option to monitor progress in great detail, if you want.
es: La fase de ordenación del programa recoge y junta todas las cadenas similares del archivo. Debido a esto, los que contienen series muy largas de símbolos, tales como "aabaabaabaab ..." (repetida varios cientos de veces) pueden comprimirse de forma extraordinariamente lenta. Las versiones 0.9.5 y posteriores funcionan mucho mejor en este aspecto. El ratio entre el caso más desfavorable y la media está entorno a 10:1, en versiones anteriores estaba entorno a 100:1. Puede utilizar la opción -vvvv para monitorizar en detalle el progreso. La velocidad de descompresión no se ve afectada.
fr: La phase de tri de la compression réunit les chaînes de caractères similaires présentes dans le fichier. À cause de cela, les fichiers contenant de très longues suites de symboles répétés, comme « aabaabaabaab ... » (répétés plusieurs centaines de fois) peuvent être compressés plus lentement que d'habitude. Les versions 0.9.5 et ultérieures se conduisent nettement mieux que les versions précédentes de ce point de vue. Le rapport entre le temps de compression dans le pire des cas et dans le cas moyen est de l'ordre de 10 pour 1. Pour les versions antérieures, ce rapport était de 100 pour 1. Vous pouvez utiliser l'option B<-vvvv> pour voir la progression dans les détails, si vous le souhaitez.
uk: При стисканні під час фази упорядковування програма збирає разом подібні рядки у файлі. Через це, стискання файлів, які містять дуже довгі послідовності повторюваних символів, наприклад «aabaabaabaab ...» (з повтором декілька сотень разів) може бути повільнішим за стискання звичайних файлів. У таких випадках версія 0.9.5 і новіші працюють набагато краще за своїх попередників. Співвідношенням для часу стискання у найгіршому та середньому випадках складає 10:1. У попередніх версіях воно могло складати щось близько 100:1. Для спостереження за усіма подробицями поступу стискання можна скористатися, якщо ви цього хочете, параметром -vvvv.

source: Decompression speed is unaffected by these phenomena.
es: La velocidad de descompresión no se ve afectada por este hecho.
fr: La vitesse de décompression n'est pas affectée par ces phénomènes.
uk: Швидкості розпакування це не стосується.

source: I<bzip2> usually allocates several megabytes of memory to operate in, and then charges all over it in a fairly random fashion. This means that performance, both for compressing and decompressing, is largely determined by the speed at which your machine can service cache misses. Because of this, small changes to the code to reduce the miss rate have been observed to give disproportionately large performance improvements. I imagine I<bzip2> will perform best on machines with very large caches.
es: Normalmente I<bzip2> reserva varios megabytes de memoria para operar en ellos, y entonces los utiliza de una manera bastante aleatoria. Esto significa que el funcionamiento del programa, tanto para comprimir como para descomprimir, se ve en gran parte determinado por la velocidad a la que su máquina sea capaz de servir fallos de caché. Debido a esto, se ha observado que pequeños cambios en el código para reducir la tasa de fallos proporcionan una mejora desproporcionadamente grande en el funcionamiento del programa. Supongo que I<bzip2> funcionará mejor en máquinas con caches de gran tamaño.
fr: B<bzip2> alloue d'habitude plusieurs Mo de mémoire pour ses besoins, et ensuite charge le tout d'une manière assez aléatoire. Cela signifie que les performances, à la fois pour la compression et la décompression, sont largement déterminées par la vitesse à laquelle votre machine peut traiter les défauts de cache. À cause de cela, de petites modifications du code pour réduire le taux d'échec en cache ont donné des améliorations de performances disproportionnées. B<bzip2> aura sans doute de meilleur performances sur des machines avec de très grands caches.
uk: Зазвичай, I<bzip2> отримує декілька мегабайтів оперативної пам'яті для роботи, а потім заповнює їх доволі випадковим чином. Це означає, що швидкодія, при стисканні та розпаковуванні, значним чином визначається швидкістю, з якою комп'ютер може обслуговувати промахи у кеші. Через це, незначні зміни у коді для зменшення частоти промахів дають непропорційно велике підвищення швидкодії. Автор вважає, що I<bzip2> найкраще працює на комп'ютерах із дуже великим кешем.

source: CAVEATS
es: ADVERTENCIAS
fr: AVERTISSEMENTS
uk: ЗАСТЕРЕЖЕННЯ

source: I/O error messages are not as helpful as they could be. I<bzip2> tries hard to detect I/O errors and exit cleanly, but the details of what the problem is sometimes seem rather misleading.
es: Los mensajes de error de E/S no son tan útiles como podrían. I<bzip2> intenta detectar errores de E/S y salir limpiamente, pero los detalles sobre la causa del problema a veces pueden ser engañosos.
fr: Les messages d'erreurs d'E/S ne sont pas d'une grande utilité. B<bzip2> essaie vraiment de détecter les erreurs d'E/S et de s'arrêter proprement, mais les détails du problème rencontré peuvent parfois induire en erreur.
uk: Повідомлення щодо помилок введення-виведення не такі корисні, як могли б бути. I<bzip2> намагається з усіх сил виявити помилки введення-виведення і завершити роботу у штатному режимі, але подробиці щодо того, з чим виникли проблеми, іноді є доволі оманливими.

source: This manual page pertains to version 1.0.8 of I<bzip2.> Compressed data created by this version is entirely forwards and backwards compatible with the previous public releases, versions 0.1pl2, 0.9.0, 0.9.5, 1.0.0, 1.0.1, 1.0.2 and above, but with the following exception: 0.9.0 and above can correctly decompress multiple concatenated compressed files. 0.1pl2 cannot do this; it will stop after decompressing just the first file in the stream.
es: Esta página del manual pertenece a la versión 1.0.8 de I<bzip2.> Los datos comprimidos creados por esta versión son totalmente compatibles con la anteriorversión, las versiones 0.1pl2, 0.9.0, 0.9.5, 1.0.0, 1.0.1, 1.0.2 y superiores con con la siguiente excepción: Solo la versión 0.9.0 puede descomprimir correctamente múltiples archivos concatenados. La 0.1pl2 no puede hacer esto; parará justo después de descomprimir el primer archivo en el flujo de datos.
fr: Cette page de manuel concerne la version 1.0.8 de B<bzip2>. Les données compressées créées par cette version sont entièrement compatibles de façon descendante et ascendante avec les versions antérieures 0.1pl2, 0.9.0, 0.9.5, 1.0.0, 1.0.1, 1.0.2 et ultérieures, à l'exception que les versions 0.9.0 et ultérieures peuvent correctement décompresser de multiples fichiers compressés et concaténés. La version 0.1pl2 ne sait pas le faire; elle s'arrêtera après la décompression du premier fichier du flux.
uk: Ця сторінка підручника містить відомості щодо версії 1.0.8 I<bzip2>. Стиснені дані, які створено за допомогою цієї версії, є в обох напрямках сумісними із попередніми загальнодоступними випусками, версіями 0.1pl2, 0.9.0, 0.9.5, 1.0.0, 1.0.1, 1.0.2 та новішими, за таким винятком: версія 0.9.0 і новіші здатні правильно розпаковувати декілька поєднаних стиснених файлів. Версія 0.1pl2 не здатна це робити; вона зупиниться після розпакування лише першого файла у потоці даних.

source: I<bzip2recover> versions prior to 1.0.2 used 32-bit integers to represent bit positions in compressed files, so they could not handle compressed files more than 512 megabytes long. Versions 1.0.2 and above use 64-bit ints on some platforms which support them (GNU supported targets, and Windows). To establish whether or not bzip2recover was built with such a limitation, run it without arguments. In any event you can build yourself an unlimited version if you can recompile it with MaybeUInt64 set to be an unsigned 64-bit integer.
fr: Les versions B<bzip2recover> antérieures à 1.0.2 utilisait des entiers de 32 bits pour représenter les positions des bits dans les fichiers compressés ; de ce fait, elles ne pouvaient traiter de fichiers compressés de plus de 512 Mo de long. Les versions 1.0.2 et ultérieures utilisent des entiers de 64 bits sur certaines plateformes qui les prennent en charge (cibles gérées par GNU et Windows). Pour savoir si B<bzip2recover> a été construit avec ou sans cette limitation, exécutez-le sans argument. Dans tous les cas, vous pouvez reconstruire une version non limitée si vous pouvez le recompiler avec MaybeUInt64 défini comme un entier 64 bits non signé.
uk: У версіях I<bzip2recover> до 1.0.2 для представлення бітових позицій у стиснутих файлах використано 32-бітові цілі числа, тому ці версії не можуть працювати із стисненими файлами, об'єм яких перевищує 512 мегабайтів. У версіях 1.0.2 і новіших використано 64-бітові цілі числа на деяких платформах, де передбачено підтримку таких чисел (підтримувані платформи GNU та Windows). Щоб визначити, чи було bzip2recover зібрано з таким обмеженням, запустіть програму без аргументів. Щоб там не сталося, ви можете зібрати версію без обмежень власноруч, якщо ви можете повторно зібрати програму із встановленим для MaybeUInt64 значенням 64-бітового цілого числа без знаку.

source: AUTHOR
es: AUTOR
fr: AUTEUR
uk: АВТОР

source: The ideas embodied in I<bzip2> are due to (at least) the following people: Michael Burrows and David Wheeler (for the block sorting transformation), David Wheeler (again, for the Huffman coder), Peter Fenwick (for the structured coding model in the original I<bzip,> and many refinements), and Alistair Moffat, Radford Neal and Ian Witten (for the arithmetic coder in the original I<bzip).> I am much indebted for their help, support and advice. See the manual in the source distribution for pointers to sources of documentation. Christian von Roques encouraged me to look for faster sorting algorithms, so as to speed up compression. Bela Lubkin encouraged me to improve the worst-case compression performance. Donna Robinson XMLised the documentation. The bz* scripts are derived from those of GNU gzip. Many people sent patches, helped with portability problems, lent machines, gave advice and were generally helpful.
fr: Les idées intégrées à B<bzip2> sont dues (entre autres) aux personnes suivantes : Michael Burrows et David Wheeler (pour la transformation de tri de blocs), David Wheeler (à nouveau, pour le codeur Huffman), Peter Fenwick (pour le modèle de codage structuré du B<bzip> original et pour de nombreux raffinements), et Alistair Moffat, Radford Neal et Ian Witten (pour le codeur arithmétique du B<bzip> original). Je suis très reconnaissant à ces personnes pour leur aide, leur soutien et leurs conseils. Voyez le manuel dans la distribution source pour obtenir des liens vers les sources de documentation. Christian von Roques m'encouragea à chercher des algorithmes de tri plus rapides, pour accélérer la compression. Bela Lubkin m'encouragea à améliorer la performance de la compression dans le pire des cas. Beaucoup de personnes m'ont envoyé des correctifs, aidé pour des problèmes de portabilité, prêté des machines, donné des conseils et ont été généralement utiles.
uk: Ідеї, які покладено в основу I<bzip2>, належать (принаймні) таким людям: Майклу Берроузу (Michael Burrows) та Девіду Вілеру (David Wheeler) (перетворення з упорядковуванням блоків), Девіду Вілеру (знову, кодувальник Гаффмана), Пітеру Фенвіку (Peter Fenwick) (модель структурованого кодування у початковій версії I<bzip> та багато удосконалень) та Алістеру Моффату (Alistair Moffat), Редфорду Нілу (Radford Neal) і Яну Віттену (арифметичний кодувальник у початковій версії I<bzip>). Я дуже вдячний їм за допомогу, підтримку та поради. Посилання на джерела документації можна знайти у підручнику у дистрибутиві із початковим кодом програми. Крістіан фон Рокес (Christian von Roques) заохотив мене до пошуку швидших алгоритмів упорядковування для пришвидшення стискання. Бела Любкін (Bela Lubkin) заохотив мене до удосконалення швидкодії стискання у найгіршому випадку. Донна Робінсон (Donna Robinson) виконала перетворення документації на код XML. Скрипти bz* походять зі скриптів GNU gzip. Багато людей надсилало латки, допомагало із проблемами з портуванням, надавало обчислювальні потужності, надсилало поради та допомагало у інший спосіб.

source: Reduce memory usage, for compression, decompression and testing. Files are decompressed and tested using a modified algorithm which only requires 2.5 bytes per block byte. This means any file can be decompressed in 2300\ k of memory, albeit at about half the normal speed.
es: Reduce la utilización de memoria para la compresión, la descompresión y la comprobación. Los ficheros son descomprimidos y comprobados utilizando un algoritmo modificado que solo requiere 2.5 bytes por cada byte del bloque. Esto significa que cualquier fichero puede ser descomprimido en 2300\ k de memoria, aunque a la mitad de la velocidad normal.
fr: Réduire l'utilisation de la mémoire pour la compression, la décompression et la vérification. Les fichiers sont décompressés et testés en utilisant un algorithme modifié qui requiert uniquement 2,5 octets par bloc d'un octet. Cela signifie que tout fichier peut être décompressé dans 2 300 Ko de mémoire, même s'il le sera à une vitesse deux fois plus lente que la vitesse normale.
uk: Зменшити використання пам'яті для стискання, розпакування та тестування. Файли буде розпаковано і перевірено за допомогою зміненого алгоритму, який потребує лише 2,5 байтів на блоковий байт. Це означає, щоб будь-який файл можна буде розпакувати у 2300\ кБ пам'яті, хоча і у половину звичайної швидкості.

source: During compression, -s selects a block size of 200\ k, which limits memory use to around the same figure, at the expense of your compression ratio. In short, if your machine is low on memory (8 megabytes or less), use -s for everything. See MEMORY MANAGEMENT below.
fr: Durant la compression, B<-s> sélectionne une taille de bloc de 200 Ko, ce qui limite l'utilisation de mémoire à environ le même nombre, aux dépens du coefficient de compression. Bref, si votre machine possède peu de mémoire vive (8 Mo ou moins), utilisez B<-s> pour tout ce que vous faites. Voir GESTION DE LA MÉMOIRE plus bas.
uk: Під час стискання -s вибирає розмір блоку у 200\ кБ, що обмежує використання пам'яті майже до тих самих значень за рахунок коефіцієнта стискання. Якщо коротко, якщо на вашому комп'ютері замало оперативної пам'яті (8 мегабайтів або менше), користуйтеся -s для усього. Див. КЕРУВАННЯ ПАМ'ЯТТЮ нижче.

source: Print a help message and exit.
es: Muestra un mensaje de ayuda y finaliza.
fr: Afficher un message d'aide puis quitter.
uk: Вивести короткий текст довідки і завершити роботу.

source: Set the block size to 100 k, 200 k ... 900 k when compressing. Has no effect when decompressing. See MEMORY MANAGEMENT below. The --fast and --best aliases are primarily for GNU gzip compatibility. In particular, --fast doesn't make things significantly faster. And --best merely selects the default behaviour.
fr: Fixer la taille de bloc à 100, 200, ... 900 ko pendant la compression. Cette option n'a aucun effet sur la décompression. Voir GESTION DE LA MÉMOIRE ci-dessous. Les alias B<--fast> et B< --best> existent principalement pour la compatibilité avec GNU B<gzip>. En particulier, B<--fast> ne rend pas les traitements significativement plus rapides. Et B< --best> sélectionne simplement le comportement par défaut.
uk: Встановити розмір блоку 100 кБ, 200 кБ ... 900 кБ при стисканні. Не діє при розпаковуванні. Див. КЕРУВАННЯ ПАМ'ЯТТЮ нижче. Альтернативи --fast і --best призначено, в основному, для сумісності з GNU gzip. Зокрема, --fast не робить обробку аж надто швидшою, а --best, фактично, вибирає типову поведінку.

source: Compression: 400\ k + ( 8 x block size )
es: Compresión: 400\ k + ( 8 x tamaño de bloque )
fr: Compression : 400\ k + ( 8 x taille de bloc )
uk: Стискання: 400\ кБ + ( 8 x розмір блоку )

source: Decompression: 100\ k + ( 4 x block size ), or 100\ k + ( 2.5 x block size )
es: Descompresión: 100\ k + ( 4 x tamaño de bloque ), o 100\ k + ( 2.5 x tamaño de bloque )
fr: Décompression : 100\ k + ( 4 x taille de bloc ), ou 100\ k + ( 2.5 x taille de bloc )
uk: Розпакування: 100\ кБ + ( 4 x розмір блоку ) або 100\ кБ + ( 2,5 x розмір блоку )
