Repository: sebras/manpages-l10n
Catalog: po/*/man1/bzip2.1.po
Languages: es, fr, uk

source: For files compressed with the default 900\ k block size, I<bunzip2> will require about 3700 kbytes to decompress. To support decompression of any file on a 4 megabyte machine, I<bunzip2> has an option to decompress using approximately half this amount of memory, about 2300 kbytes. Decompression speed is also halved, so you should use this option only where necessary. The relevant flag is -s.
es: Para ficheros comprimidos con el tamaño de bloque por defecto de 900\ k, I<bunzip2> requerirá aproximadamente 3700 kbytes para descomprimir. Para soportar la descompresión de cualquier fichero en una máquina de 4MB, I<bunzip2> tiene una opción para descomprimir utilizando aproximadamente la mitad de esta cantidad de memoria, unos 2300 kbytes. La velocidad de descompresión también se divide entre dos, por lo que solo se debe utilizar cuando sea necesario. La opción mencionada es -s.
fr: Pour les fichiers compressés avec la taille de bloc par défaut de 900 Ko, B<bunzip2> aura besoin d'environ 3 700 Ko pour la décompression. Pour permettre la décompression de tout fichier sur une machine avec 4 Mo de RAM, B<bunzip2> possède une option pour décompresser en n'utilisant que la moitié environ de ces 3 700 Ko, à savoir à peu près 2 300 Ko. Malheureusement, la vitesse de décompression est également réduite de moitié, et donc vous ne devriez utiliser cette option (B<-s>) qu'en cas de nécessité absolue.
uk: Для файлів, які стиснуто з типовим розміром блоку 900\ кБ, I<bunzip2> потребуватиме близько 3700 кілобайтів для розпаковування. Для розпаковування будь-якого файла на комп'ютері з 4 мегабайтами оперативної пам'яті у I<bunzip2> передбачено параметр для розпаковування за допомогою приблизно половини цього об'єму пам'яті, близько 2300 кілобайтів. Швидкість розпаковування також зменшиться удвічі, тому вам слід користуватися цим параметром лише там, де у цьому є потреба. Відповідним прапорцем є -s.

source: Another significant point applies to files which fit in a single block -- that means most files you'd encounter using a large block size. The amount of real memory touched is proportional to the size of the file, since the file is smaller than a block. For example, compressing a file 20,000 bytes long with the flag -9 will cause the compressor to allocate around 7600\ k of memory, but only touch 400\ k + 20000 * 8 = 560 kbytes of it. Similarly, the decompressor will allocate 3700\ k but only touch 100\ k + 20000 * 4 = 180 kbytes.
es: Otro punto importante tiene que ver con los ficheros que caben en un solo bloque -- eso equivale a la mayoría de ficheros que encontrará usando grandes tamaños de bloque. La cantidad de memoria utilizada es proporcional al tamaño del fichero, ya que el fichero es más pequeño que un bloque. Por ejemplo, comprimir un fichero de 20.000 bytes con la opción -9 hará que el compresor se asigne unos 7600\ k de memoria, pero solo utilice 400\ k + 20000 * 8 = 560 kilobytes de ella. De forma similar, el descompresor se asignará 3700\ k pero solo utilizará 100\ k + 20000 * 4 = 180 kbytes.
fr: Un autres aspect significatif s'applique aux fichiers qui peuvent tenir dans un seul bloc – c'est-à-dire la plupart des fichiers que vous rencontrez en utilisant une grande taille de bloc. La quantité réelle de mémoire utilisée est proportionnelle à la taille du fichier, puisque le fichier est plus petit qu'un bloc. Par exemple, compresser un fichier de 20 000 octets avec l'option B<-9> forcera le compresseur à allouer environ 7 600 Ko de mémoire, mais n'en utilisera réellement que 400 Ko + 20 000 * 8 = 560 Ko. De même, le décompresseur allouera 3 700 Ko mais n'utilisera que 100 Ko + 20 000 * 4 = 180 Ko.
uk: Інше важливе зауваження стосується файлів, які вкладаються у один блок — тобто більшості файлів, з якими ви можете мати справу, коли користуєтеся великим розміром блоку. Справжній об'єм пам'яті є пропорційним до розміру файла, оскільки розмір файла є меншим за розмір блоку. Наприклад, стискання файла у 20000 байтів із прапорцем -9 призведе до отримання засобом стискання близько 7600\ кБ оперативної пам'яті, але використано буде лише 400\ кБ + 20000 * 8 = 560 кілобайтів з цієї пам'яті. Так само, засіб розпаковування отримає 3700\ кБ оперативної пам'яті, але використає лише 100\ кБ + 20000 * 4 = 180 кілобайтів.

source: I<bzip2> compresses files in blocks, usually 900\ kbytes long. Each block is handled independently. If a media or transmission error causes a multi-block .bz2 file to become damaged, it may be possible to recover data from the undamaged blocks in the file.
es: I<bzip2> comprime los ficheros en bloques, normalmente de 900\ kbytes. Cada bloque se maneja de manera independiente. Si un error de transmisión o del medio (físico) provoca que un fichero .bz2 multibloque sea dañado, puede que sea posible recuperar los datos de los bloques intactos que queden en el fichero.
fr: B<bzip2> compresse les fichiers en blocs d'une longueur d'habituellement 900 Ko. Chaque bloc est traité indépendamment des autres. Si un défaut du support physique ou une erreur de transmission provoque l'endommagement d'un fichier I<.bz1> multi-blocs, il peut être possible de récupérer des données à partir des blocs non endommagés du fichier.
uk: I<bzip2> стискає файли блоками, розмір яких, зазвичай, дорівнює 900\ кілобайтів. Обробка кожного блоку відбувається незалежно. Якщо помилка під час зберігання на носії даних або передавання даних спричиняє пошкодження даних у багатоблоковому файлі .bz2, дані з непошкоджених блоків файла можна відновити.

source: I<bzip2recover> takes a single argument, the name of the damaged file, and writes a number of files "rec00001file.bz2", "rec00002file.bz2", etc., containing the extracted blocks. The output filenames are designed so that the use of wildcards in subsequent processing -- for example, "bzip2 -dc rec*file.bz2 E<gt> recovered_data" -- processes the files in the correct order.
fr: B<bzip2recover> prend un seul argument, le nom du fichier endommagé, et écrit un certain nombre de fichiers « rec0001file.bz2 », « rec0002file.bz2 », etc, contenant les blocs extraits. Les noms de fichiers en sortie sont conçus de sorte que l'utilisation de jokers (wildcards) dans des traitements ultérieurs – par exemple, « bzip2 -dc rec*file.bz2 E<gt> données_récupérées » – liste les fichiers dans le bon ordre.
uk: I<bzip2recover> приймає єдиний аргумент, назву пошкодженого файла, і записує послідовність файлів «rec00001file.bz2», «rec00002file.bz2» тощо, у яких містяться видобуті блоки. Назви файлів-результатів створено таким чином, щоб можна було скористатися шаблонами заміни для подальшої обробки — наприклад, «bzip2 -dc rec*file.bz2 E<gt> відновлені_дані» — обробить файли у належній послідовності.

source: The sorting phase of compression gathers together similar strings in the file. Because of this, files containing very long runs of repeated symbols, like "aabaabaabaab ...\&" (repeated several hundred times) may compress more slowly than normal. Versions 0.9.5 and above fare much better than previous versions in this respect. The ratio between worst-case and average-case compression time is in the region of 10:1. For previous versions, this figure was more like 100:1. You can use the -vvvv option to monitor progress in great detail, if you want.
es: La fase de ordenación de la compresión recoge y junta todas las cadenas similares del archivo. Debido a esto, los archivos con series muy largas de símbolos, tales como "aabaabaabaab ...\&" (repetida varios cientos de veces) pueden comprimirse de modo extraordinariamente lento. La versión 0.9.5 y posteriores mejoran mucho este aspecto. El tiempo empleado entre el caso más desfavorable y un caso promedio está entorno a 10:1 cuando en versiones anteriores estaba entorno a 100:1. Puede monitorizar con gran precisión la ejecución con la opción -vvvv.
fr: La phase de tri de la compression réunit les chaînes de caractères similaires présentes dans le fichier. À cause de cela, les fichiers contenant de très longues suites de symboles répétés, comme « aabaabaabaab ... » (répétés plusieurs centaines de fois) peuvent être compressés plus lentement que d'habitude. Les versions 0.9.5 et ultérieures se conduisent nettement mieux que les versions précédentes de ce point de vue. Le rapport entre le temps de compression dans le pire des cas et dans le cas moyen est de l'ordre de 10 pour 1. Pour les versions antérieures, ce rapport était de 100 pour 1. Vous pouvez utiliser l'option B<-vvvv> pour voir la progression dans les détails, si vous le souhaitez.
uk: При стисканні під час фази упорядковування програма збирає разом подібні рядки у файлі. Через це, стискання файлів, які містять дуже довгі послідовності повторюваних символів, наприклад «aabaabaabaab ...» (з повтором декілька сотень разів) може бути повільнішим за стискання звичайних файлів. У таких випадках версія 0.9.5 і новіші працюють набагато краще за своїх попередників. Співвідношенням для часу стискання у найгіршому та середньому випадках складає 10:1. У попередніх версіях воно могло складати щось близько 100:1. Для спостереження за усіма подробицями поступу стискання можна скористатися, якщо ви цього хочете, параметром -vvvv.

source: Unlike I<GNU gzip,> I<bzip2> will not create a cascade of I<.bz2> suffixes even when using the I<--force> option:
es: A diferencia de I<GNU gzip,>, I<bzip2> no añadirá sufijos I<.bz2> en cascada aunque se emplee la opción I<--force>:
fr: À la différence de I<GNU gzip>, I<bzip2> ne crée pas une cascade de suffixes I<.bz2> même lorsque l'option I<--force> est utilisée :
uk: На відміну I<GNU gzip>, I<bzip2> не створюватиме каскаду суфіксів I<.bz2>, навіть якщо використано параметр I<--force>:

source: filename.bz2 does not become filename.bz2.bz2
es: filename.bz2 no se convierte en filename.bz2.bz2
fr: nom_fichier.bz2 ne devient pas nom_fichier.bz2.bz2
uk: назвафайла.bz2 не стане назвафайла.bz2.bz2
