Repository: sebras/manpages-l10n
Catalog: po/*/man1/cal.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: cal - display a calendar
uk: cal — вивести календар

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<cal> [options] [[[I<day>] I<month>] I<year>]
uk: B<cal> [параметри] [[[I<день>] I<місяць>] I<рік>]

source: B<cal> [options] [I<timestamp>|I<monthname>]
uk: B<cal> [параметри] [I<часова позначка>|I<назва місяця>]

source: DESCRIPTION
uk: ОПИС

source: B<cal> displays a simple calendar. If no arguments are specified, the current month is displayed.
uk: B<cal> виводить простий календар. Якщо не вказано аргументів, буде показано календар на поточний місяць.

source: The I<month> may be specified as a number (1-12), as a month name or as an abbreviated month name according to the current locales.
uk: Аргумент I<місяць> можна задати як число (1-12), як назву місяця або як скорочену назву місяця, відповідно до поточних локалей.

source: Two different calendar systems are used, Gregorian and Julian. These are nearly identical systems with Gregorian making a small adjustment to the frequency of leap years; this facilitates improved synchronization with solar events like the equinoxes. The Gregorian calendar reform was introduced in 1582, but its adoption continued up to 1923. By default B<cal> uses the adoption date of 3 Sept 1752. From that date forward the Gregorian calendar is displayed; previous dates use the Julian calendar system. 11 days were removed at the time of adoption to bring the calendar in sync with solar events. So Sept 1752 has a mix of Julian and Gregorian dates by which the 2nd is followed by the 14th (the 3rd through the 13th are absent).
uk: Використано дві різні календарні системи, григоріанську та юліанську. Ці системи майже ідентичні, але у григоріанській системі внесено невеличке коригування щодо частоти високосних років; це забезпечує кращу синхронізацію із рухом Сонця на небі, зокрема рівноденнями. Григоріанську реформу календаря було запроваджено у 1582 році, але, загалом, вона тривала до 1923 року. Типово, у B<cal> використано дату впровадження 3 вересня 1752 року. Починаючи з цієї дати, буде показано дати у григоріанському календарі; попередні дати буде показано у юліанській календарній системі. На момент впровадження реформи було вилучено 11 днів для збереження синхронізації календаря із рухом Сонця. Тому вересень 1752 року є сумішшю юліанських та григоріанських дат, у якій після другого числа йде одразу 14 (чисел від третього до тринадцятого просто немає).

source: Optionally, either the proleptic Gregorian calendar or the Julian calendar may be used exclusively. See B<--reform> below.
uk: Якщо потрібно, можна скористатися випереджальним григоріанським календарем або лише юліанським календарем. Див. B<--reform> нижче.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Display single month output. (This is the default.)
uk: Показати виведеним один місяць. (Типова поведінка.)

source: Display three months spanning the date.
uk: Показати дані для попереднього, поточного і наступного місяця.

source: B<-n , --months> I<number>
uk: B<-n , --months> I<число>

source: Display I<number> of months, starting from the month containing the date.
uk: Показати вказане I<число> місяців, починаючи з місяця, у якому міститься дата.

source: Display months spanning the date.
uk: Показати дані місяців навколо дати.

source: Display Sunday as the first day of the week.
uk: Показувати неділю, як перший день тижня.

source: Display Monday as the first day of the week.
uk: Показувати понеділок як перший день тижня.

source: Display using a vertical layout (aka B<ncal>(1) mode).
uk: Вивести з використанням вертикального компонування (тобто режим B<ncal>(1)).

source: Display the proleptic Gregorian calendar exclusively. This option does not affect week numbers and the first day of the week. See B<--reform> below.
uk: Показувати усі дати лише у григоріанському календарі. Цей параметр не впливає на номери тижнів і перший день тижня. Див. B<--reform> нижче.

source: Use day-of-year numbering for all calendars. These are also called ordinal days. Ordinal days range from 1 to 366. This option does not switch from the Gregorian to the Julian calendar system, that is controlled by the B<--reform> option.
uk: Використовувати нумерацію дня року для усіх календарів. Номери називаються порядковими днями. Порядкові дні є числами у діапазоні від 1 до 366. Цей параметр не перемикає дати з григоріанської на юліанську календарну систему — цим керує параметр B<--reform>.

source: Sometimes Gregorian calendars using ordinal dates are referred to as Julian calendars. This can be confusing due to the many date related conventions that use Julian in their name: (ordinal) julian date, julian (calendar) date, (astronomical) julian date, (modified) julian date, and more. This option is named julian, because ordinal days are identified as julian by the POSIX standard. However, be aware that B<cal> also uses the Julian calendar system. See B<DESCRIPTION> above.
uk: Іноді григоріанські календарі, де використано порядкові дати, називають юліанськими календарями. Це може заплутати, оскільки існує багато традиційних типових назв, де використано слово «юліанська» у назві: (порядкова) юліанська дата, юліанська (календарна) дата, (астрономічна) юліанська дата, (змінена) юліанська дата тощо. Цей параметр має назву «julian», оскільки порядкові дати визначаються як юліанські стандартом POSIX. Втім, майте на увазі, що B<cal> також використовує юліанську календарну систему. Див. B<ОПИС> вище.

source: B<--reform> I<val>
uk: B<--reform> I<знач>

source: This option sets the adoption date of the Gregorian calendar reform. Calendar dates previous to reform use the Julian calendar system. Calendar dates after reform use the Gregorian calendar system. The argument I<val> can be:
uk: Цей параметр встановлює дату впровадження григоріанської календарної реформи. Календарні дати до дати реформи обчислюються за юліанською календарною системою. Для календарних дат після дати реформи буде використано григоріанську календарну систему. Аргументом I<знач> можуть бути такі записи:

source: I<1752> - sets 3 September 1752 as the reform date (default). This is when the Gregorian calendar reform was adopted by the British Empire.
uk: I<1752> — дата реформи 3 вересня 1752 року (типове значення). Це дата впровадження григоріанського календаря у Британській імперії.

source: I<gregorian> - display Gregorian calendars exclusively. This special placeholder sets the reform date below the smallest year that B<cal> can use; meaning all calendar output uses the Gregorian calendar system. This is called the proleptic Gregorian calendar, because dates prior to the calendar system\(cqs creation use extrapolated values.
uk: I<gregorian> — показувати лише григоріанські календарі. Це особливий замінник, який встановлює дату реформації до найменшого року, який може бути використано у B<cal>; це означатиме, що усі виведені календарі будуть григоріанськими. Це називають випереджальним григоріанським календарем, оскільки дати до створення календарної системи будуть екстрапольованими.

source: I<iso> - alias of I<gregorian>. The ISO 8601 standard for the representation of dates and times in information interchange requires using the proleptic Gregorian calendar.
uk: I<iso> — інший варіант I<gregorian>. Стандарт ISO 8601 для представлення дати і часу при обміні даними вимагає використання випереджального григоріанського календаря.

source: I<julian> - display Julian calendars exclusively. This special placeholder sets the reform date above the largest year that B<cal> can use; meaning all calendar output uses the Julian calendar system.
uk: I<julian> — показувати лише юліанські календарі. Цей особливий замінник встановлює дату реформи, яка перевищує найбільший рік, календар за який може показувати B<cal>; це означає, що при виведенні будь-яких календарів буде використано юліанську календарну систему.

source: See B<DESCRIPTION> above.
uk: Див. B<ОПИС> вище.

source: Display a calendar for the whole year.
uk: Показати календар на цілий рік.

source: Display a calendar for the next twelve months.
uk: Показати календар на наступні дванадцять місяців.

source: B<-w>, B<--week>[=I<number>]
uk: B<-w>, B<--week>[=I<число>]

source: Display week numbers in the calendar (US or ISO-8601). See the B<NOTES> section for more details.
uk: Показати номери тижнів у календарі (США або ISO-8601). Див. розділ B<НОТАТКИ>, щоб дізнатися більше.

source: B<--color>[=I<when>]
uk: B<--color>[=I<умова>]

source: Colorize the output. The optional argument I<when> can be B<auto>, B<never> or B<always>. If the I<when> argument is omitted, it defaults to B<auto>. The colors can be disabled; for the current built-in default see the B<--help> output. See also the B<COLORS> section.
uk: Розфарбувати виведені дані. Значенням додаткового аргументу I<варіант> може бути *auto*, *never* або *always*. Якщо аргумент I<варіант> пропущено, типовим значенням вважається *auto*. Розфарбовування можна вимкнути. Із поточним вбудованим типовим значенням можна ознайомитися за допомогою виведення команди з параметром *--help*. Див. також розділ КОЛЬОРИ.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: PARAMETERS
uk: ПАРАМЕТРИ

source: B<Single digits-only parameter (e.g., \(aqcal 2020\(aq)>
uk: B<Одинарний цифровий параметр (наприклад, \(aqcal 2020\(aq)>

source: Specifies the I<year> to be displayed; note the year must be fully specified: B<cal 89> will not display a calendar for 1989.
uk: Задає I<рік>, який має бути показано; зауважте, що рік має бути вказано повністю: B<cal 89> не покаже календар на 1989 рік.

source: B<Single string parameter (e.g., \(aqcal tomorrow\(aq or \(aqcal August\(aq)>
uk: B<Одинарний рядковий параметр (наприклад, \(aqcal завтра\(aq або \(aqcal серпень\(aq)>

source: Specifies I<timestamp> or a I<month name> (or abbreviated name) according to the current locales.
uk: Задає I<часову позначку> або I<назву місяця> (або скорочену назву) відповідно до поточних локалей.

source: The special placeholders are accepted when parsing timestamp, "now" may be used to refer to the current time, "today", "yesterday", "tomorrow" refer to of the current day, the day before or the next day, respectively.
uk: Передбачено обробку спеціальних замінників під час обробки часової позначки, замінником «зараз» можна скористатися для посилання на поточний момент часу, замінники «сьогодні», «вчора», «завтра» позначають поточний день, попередній день та наступний день, відповідно.

source: The relative date specifications are also accepted, in this case "+" is evaluated to the current time plus the specified time span. Correspondingly, a time span that is prefixed with "-" is evaluated to the current time minus the specified time span, for example \(aq+2days\(aq. Instead of prefixing the time span with "+" or "-", it may also be suffixed with a space and the word "left" or "ago" (for example \(aq1 week ago\(aq).
uk: Також можна визначати відносні дати. У випадку визначення відносної дати «+» означатиме поточну дату разом із вказаним часовим проміжком. Відповідно, часовий проміжок із префіксом «-» означатиме поточний час без вказаного проміжку часу. Приклад: «+2days». Замість префіксів «+» або «-» для часових проміжків можна використовувати суфікси і пробілом і словами «left» або «ago» (приклад: «1 week ago»).

source: B<Two parameters (e.g., \(aqcal 11 2020\(aq)>
uk: B<Два параметри (наприклад, \(aqcal 11 2020\(aq)>

source: Denote the I<month> (1 - 12) and I<year>.
uk: Визначити I<місяць> (1 - 12) і I<рік>.

source: B<Three parameters (e.g., \(aqcal 25 11 2020\(aq)>
uk: B<Три параметри (наприклад, \(aqcal 25 11 2020\(aq)>

source: Denote the I<day> (1-31), I<month and year>, and the day will be highlighted if the calendar is displayed on a terminal. If no parameters are specified, the current month\(cqs calendar is displayed.
uk: Визначають I<день> (1-31), I<місяць> і I<рік>. День буде позначено, якщо календар показано у терміналі. Якщо параметрів не задано, буде показано календар на поточний місяць.

source: NOTES
uk: ПРИМІТКИ

source: A year starts on January 1. The first day of the week is determined by the locale or the B<--sunday> and B<--monday> options.
uk: Рік починається з першого січня. Перший день тижня визначається локаллю або параметрами B<--sunday> і B<--monday>.

source: The week numbering depends on the choice of the first day of the week. If it is Sunday then the customary North American numbering is used, where 1 January is in week number 1. If it is Monday (B<-m>) then the ISO 8601 standard week numbering is used, where the first Thursday is in week number 1.
uk: Нумерація тижнів залежить від вибору першого дня тижня. Якщо це неділя, буде використано типову північноамериканську нумерацію, де 1 січня міститься у першому тижні. Якщо першим днем тижня є понеділок (B<-m>), буде використано стандартну нумерацію тижнів ISO 8601, де перший четвер міститься у першому тижні.

source: COLORS
uk: КОЛЬОРИ

source: The output colorization is implemented by B<terminal-colors.d>(5) functionality. Implicit coloring can be disabled by an empty file
uk: Розфарбовування виведених даних реалізовано у можливості B<terminal-colors.d>(5). Неявне розфарбовування може бути вимкнено спорожненням файла

source: for the B<cal> command or for all tools by
uk: для команди B<cal> або для усіх інструментів

source: The user-specific I<$XDG_CONFIG_HOME/terminal-colors.d> or I<$HOME/.config/terminal-colors.d> overrides the global setting.
uk: Специфічні для користувача I<$XDG_CONFIG_HOME/terminal-colors.d> та I<$HOME/.config/terminal-colors.d> мають пріоритет над загальними параметрами.

source: Note that the output colorization may be enabled by default, and in this case I<terminal-colors.d> directories do not have to exist yet.
uk: Зауважте, що можна типово увімкнути розфарбовування виведених даних і у цьому випадку каталоги I<terminal-colors.d> не повинні існувати.

source: HISTORY
uk: ЖУРНАЛ

source: A B<cal> command appeared in Version 6 AT&T UNIX.
uk: Команда B<cal> з'явилася у версії 6 AT&T UNIX.

source: BUGS
uk: ВАДИ

source: The default B<cal> output uses 3 September 1752 as the Gregorian calendar reform date. The historical reform dates for the other locales, including its introduction in October 1582, are not implemented.
uk: Типовий B<cal> виводить дати, використовуючи 3 вересня 1752 року як дату григоріанської календарної реформи. Використання історичних дат реформації для інших локалей, включно із датою впровадження реформи у жовтні 1582 року, не реалізовано.

source: Alternative calendars, such as the Umm al-Qura, the Solar Hijri, the Ge\(cqez, or the lunisolar Hindu, are not supported.
uk: Підтримки альтернативних календарів, зокрема Умм аль-Кура, сонячної хіджри, ґеез або місячно-сонячного індуїстського, не передбачено.

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<cal> command is part of the util-linux package which can be downloaded from
uk: B<cal> є частиною пакунка util-linux, який можна отримати з

source: Display week numbers in the calendar (US or ISO-8601). See NOTES section for more details.
uk: Показати номери тижнів у календарі (США або ISO-8601). Див. розділ B<НОТАТКИ>, щоб дізнатися більше.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: Implicit coloring can be disabled as follows:
uk: Неявне розфарбування можна вимкнути так:

source: See B<terminal-colors.d>(5) for more details about colorization configuration.
uk: Див. B<terminal-colors.d>(5), щоб дізнатися більше про налаштовування розфарбування.
