Repository: sebras/manpages-l10n
Catalog: po/*/man1/chown.1.po
Languages: hu, nl, sv

source: User Commands
hu: Felhasználói parancsok
nl: Opdrachten voor gebruikers
sv: Användarkommandon

source: NAME
hu: NÉV
nl: NAAM
sv: NAMN

source: chown - change file owner and group
nl: chown - eigenaar en groep van bestanden veranderen

source: SYNOPSIS
hu: ÖSSZEGZÉS
nl: SAMENVATTING

source: B<chown> [I<\,OPTION\/>]... [I<\,OWNER\/>][I<\,:\/>[I<\,GROUP\/>]] I<\,FILE\/>...
hu: B<chown> [I<\,KAPCSOLÓ\/>]... [I<\,TULAJDONOS\/>][I<\,:\/>[I<\,CSOPORT\/>]] I<\,FÁJL\/>...
nl: B<chown> [I<\,OPTIE\/>]... [I<\,EIGENAAR\/>][I<\,:\/>[I<\,GROEP\/>]] I<\,BESTAND\/>...
sv: B<chown> [I<\,FLAGGA\/>]... [I<\,ÄGARE\/>][I<\,:\/>[I<\,GRUPP\/>]] I<\,FIL\/>...

source: B<chown> [I<\,OPTION\/>]... I<\,--reference=RFILE FILE\/>...
hu: B<chown> [I<\,KAPCSOLÓ\/>]... I<\,--reference=REFERENCIAFÁJL FÁJL\/>...
nl: B<chown> [I<\,OPTIE\/>]... I<\,--reference=REFERENTIEBESTAND BESTAND\/>...
sv: B<chown> [I<\,FLAGGA\/>]... I<\,--reference=RFIL FIL\/>...

source: DESCRIPTION
hu: LEÍRÁS
nl: BESCHRIJVING
sv: BESKRIVNING

source: This manual page documents the GNU version of B<chown>. B<chown> changes the user and/or group ownership of each given file. If only an owner (a user name or numeric user ID) is given, that user is made the owner of each given file, and the files' group is not changed. If the owner is followed by a colon and a group name (or numeric group ID), with no spaces between them, the group ownership of the files is changed as well. If a colon but no group name follows the user name, that user is made the owner of the files and the group of the files is changed to that user's login group. If the colon and group are given, but the owner is omitted, only the group of the files is changed; in this case, B<chown> performs the same function as B<chgrp>. If only a colon is given, or if the entire operand is empty, neither the owner nor the group is changed.
nl: Deze handleiding documenteert de GNU-versie van B<chown>. B<chown> verandert de eigenaar en/of groep van elk gegeven bestand. Als alleen een gebruiker (een gebruikersnaam of numeriek gebruikers-ID) werd opgegeven, dan wordt deze gebruiker de eigenaar van elk opgegeven bestand, de groep wordt niet veranderd. Als de gebruikersnaam wordt gevolgd door een dubbele punt en een groep (of numeriek groep-ID), zonder tussen liggende spaties, dan wordt de groep ook veranderd. Als een dubbele punt niet gevolgd wordt door een groep, dan wordt de gebruiker de eigenaar van de bestanden en de groep wordt veranderd naar de login-groep van de eigenaar. Als zowel de dubbele punt als de groep werden opgegeven, maar de gebruiker niet dan wordt alleen de groep veranderd; in dat geval doet B<chown> hetzelfde als B<chgrp>. Als alleen een dubbele punt werd gegeven, of als de hele operand leeg was, dan worden zowel eigenaar als groep niet veranderd.

source: OPTIONS
hu: KAPCSOLÓK
nl: OPTIES
sv: FLAGGOR

source: Change the owner and/or group of each FILE to OWNER and/or GROUP. With B<--reference>, change the owner and group of each FILE to those of RFILE.
hu: Megváltoztatja mindegyik FÁJL tulajdonosát és/vagy csoportját a TULAJDONOSRA és/vagy a CSOPORTRA. A B<--reference> használata esetén mindegyik FÁJL tulajdonosát és csoportját a REFERENCIAFÁJLÉRA változtatja.
nl: De eigenaar en/of groep van elk gegeven BESTAND veranderen naar de gegeven EIGENAAR en/of GROEP, of naar de eigenaar en groep van REFERENTIEBESTAND.
sv: Ändra ägaren och/eller gruppen på varje FIL till ÄGARE och/eller GRUPP. Med B<--reference>, ändra ägaren och gruppen för varje FIL till dem för RFIL.

source: like verbose but report only when a change is made
hu: mint a bőbeszédű mód, de csak a végrehajtott változásokat jelzi
nl: zoals uitgebreid maar geef alleen een melding als er een verandering is aangebracht
sv: Som B<--verbose> men rapportera bara när ändringar görs.

source: suppress most error messages
hu: megszünteti a legtöbb hibaüzenetet
nl: onderdruk de meeste foutmeldingen
sv: Utelämna de flesta felmeddelanden.

source: output a diagnostic for every file processed
hu: minden feldolgozott fájl után diagnosztikai üzenetet ír ki
nl: geef een melding voor elk verwerkt bestand
sv: Skriv ut ett meddelande för varje bearbetad fil.

source: affect the referent of each symbolic link (this is the default), rather than the symbolic link itself
hu: nem a szimbolikus link csoportját változtatja meg, hanem a fájlét, amire az mutat (ez az alapértelmezett)
nl: niet de symbolische koppelingen bewerken maar de bestanden waarnaar ze verwijzen (standaard)
sv: Ändra referensen för varje symbolisk länk (detta är standard) istället för den symboliska länken själv.

source: affect symbolic links instead of any referenced file (useful only on systems that can change the ownership of a symlink)
hu: a szimbolikus linket érinti, és nem a fájlt (csak azokon a rendszereken hasznos, ahol a szimbolikus link tulajdonosa módosítható)
nl: de symbolische koppelingen zelf bewerken in plaats van de bestanden waarnaar ze verwijzen (alleen nuttig op systemen waar de eigenaar van een symbolische koppeling veranderd kan worden)
sv: Ändra symboliska länkar istället för refererade filer (meningsfullt endast på system där det går att ändra ägare på en symbolisk länk).

source: B<--from>=I<\,CURRENT_OWNER\/>:CURRENT_GROUP
hu: B<--from>=I<\,JELENLEGI_TULAJ\/>:JELENLEGI_CSOPORT
nl: B<--from>=I<\,HUIDIGE_EIGENAAR\/>:HUIDIGE_GROEP
sv: B<--from>=I<\,NUVARANDE_ÄGARE\/>:NUVARANDE_GRUPP

source: change the owner and/or group of each file only if its current owner and/or group match those specified here. Either may be omitted, in which case a match is not required for the omitted attribute
hu: csak akkor változtatja meg a fájl tulajdonosát és/vagy csoportját, ha a jelenlegi beállítások megegyeznek a megadottakkal. A két attribútum közül bármelyik elhagyható, ebben az esetben nincs szükség egyezésre a kihagyott attribútumhoz
nl: eigenaar en/of groep van een bestand alleen wijzigen als huidige eigenaar en groep overeenkomen met de hier gegeven; één van de elementen mag weggelaten worden, een overeenkomst daarmee is dan niet vereist
sv: Byt ägare och/eller grupp på varje fil endast om dess nuvarande ägare och/eller grupp stämmer med de som anges här. Endera kan utelämnas, och då ställs inget krav på tillhörighet för det utelämnade attributet.

source: do not treat '/' specially (the default)
hu: a „/”-t ne kezelje speciálisan (alapértelmezett)
nl: de '/' niet speciaal behandelen (standaard)
sv: Behandla inte ”/” speciellt (normalfall).

source: fail to operate recursively on '/'
hu: a rekurzív működés visszautasítása a „/” könyvtáron
nl: niet recursief werken op '/'
sv: Låt bli att arbeta på ”/”.

source: B<--reference>=I<\,RFILE\/>
hu: B<--reference>=I<\,RFÁJL\/>
nl: B<--reference>=I<\,REFERENTIEBESTAND\/>
sv: B<--reference>=I<\,RFIL\/>

source: use RFILE's owner and group rather than specifying OWNER:GROUP values
hu: a megadott RFÁJL csoportját és tulajdonosát állítja be TULAJ:CSOPORT értékek megadása helyett
nl: de eigenaar en groep van REFERENTIEBESTAND gebruiken i.p.v. EIGENAAR:GROEP
sv: Använd RFILs ägare och grupp istället för att ange ÄGARE:GRUPPvärden.

source: operate on files and directories recursively
hu: rekurzívan működik a fájlokon és könyvtárakon
nl: bestanden en mappen recursief behandelen
sv: Arbeta på filer och kataloger rekursivt.

source: The following options modify how a hierarchy is traversed when the B<-R> option is also specified. If more than one is specified, only the final one takes effect.
hu: Az alábbi kapcsolók a hierarchia bejárását módosítják, ha a B<-R> kapcsoló is meg van adva. Ha egynél több van megadva, akkor csak a legutolsó fejti ki hatását.
nl: De volgende opties veranderen de wijze van doorlopen van de mappen hiërarchie als optie B<-R> gegeven is. Bij meerdere van deze opties, geldt de laatste.
sv: Följande flaggor modifierar hur en hierarki traverseras när flaggan B<-R> också anges. Om mer än en anges har enbart den sista någon verkan.

source: if a command line argument is a symbolic link to a directory, traverse it
hu: ha egy parancssori argumentum szimbolikus link egy könyvtárra, akkor bejárja
nl: als een argument op de opdrachtregel een symbolische koppeling naar een map is, dan deze map doorlopen
sv: Om ett kommandoradsargument för ett kommando är en symbolisk länk, följ den.

source: traverse every symbolic link to a directory encountered
hu: minden könyvtárra mutató szimbolikus link bejárása
nl: elke symbolische koppeling naar een map volgen
sv: Följ varje symbolisk länk till en katalog som påträffas.

source: do not traverse any symbolic links (default)
hu: ne járjon be egyetlen szimbolikus linket sem (alapértelmezett)
nl: symbolische koppelingen niet volgen (standaard)
sv: Följ inga symboliska länkar (normalfall).

source: display this help and exit
hu: ezen súgó megjelenítése és kilépés
nl: toon de helptekst en stop
sv: Visa denna hjälp och avsluta.

source: output version information and exit
hu: verzióinformációk megjelenítése és kilépés
nl: toon programmaversie en stop
sv: Visa versionsinformation och avsluta.

source: Owner is unchanged if missing. Group is unchanged if missing, but changed to login group if implied by a ':' following a symbolic OWNER. OWNER and GROUP may be numeric as well as symbolic.
hu: A tulajdonos változatlan marad, ha nincs megadva. A csoport változatlan marad, ha nincs megadva, de megváltozik a bejelentkezési csoportra, a „:”-ot követő TULAJDONOS nevének megadásakor. A TULAJDONOST és a CSOPORTOT meg lehet adni számmal vagy névvel.
nl: Als EIGENAAR ontbreekt, blijft deze onveranderd. Als GROEP ontbreekt, blijft deze onveranderd, tenzij met een ':' na een symbolische EIGENAAR impliciet de inloggroep gegeven is. Verder mogen EIGENAAR en GROEP zowel numeriek als symbolisch zijn.
sv: Ägaren byts inte om den utelämnas. Grupp byts inte om utelämnad, men byts till inloggningsgrupp om underförstådd av ”:” efter en symbolisk ÄGARE. ÄGARE och GRUPP kan vara numeriska såväl som symboliska.

source: EXAMPLES
hu: PÉLDÁK
nl: VOORBEELDEN
sv: EXEMPEL

source: chown root /u
nl: chown root /w

source: Change the owner of /u to "root".
hu: A /u tulajdonosának megváltoztatása „root”-ra.
nl: Verandert de eigenaar van /w naar "root".
sv: Ändra ägare av /u till ”root”.

source: chown root:staff /u
nl: chown root:team /w

source: Likewise, but also change its group to "staff".
hu: Hasonló, de a csoportot megváltoztatja „staff”-ra.
nl: Idem, maar verandert ook de groep naar "team".
sv: Samma, men ändra även dess grupp till ”staff”.

source: Change the owner of /u and subfiles to "root".
hu: A /u és az alatta található fájlok tulajdonosának módosítása „root”-ra.
nl: Verandert de eigenaar van /w en subbestanden naar "root".
sv: Ändra ägare av /u och underfiler till ”root”.

source: AUTHOR
hu: SZERZŐ
nl: AUTEUR
sv: UPPHOVSMAN

source: Written by David MacKenzie and Jim Meyering.
hu: Írta David MacKenzie és Jim Meyering.
nl: Geschreven door David MacKenzie en Jim Meyering.
sv: Skrivet av David MacKenzie och Jim Meyering.

source: REPORTING BUGS
hu: HIBÁK JELENTÉSE
nl: RAPPORTEREN VAN BUGS
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Online hulp bij GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
nl: Meld alle vertaalfouten op E<lt>https://translationproject.org/team/nl.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2022 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
hu: LÁSD MÉG
nl: ZIE OOK
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/chownE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/chownE<gt>
nl: Volledige documentatie op: E<lt>https://www.gnu.org/software/coreutils/chownE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/chownE<gt>

source: or available locally via: info \(aq(coreutils) chown invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) chown invocation\(aq
nl: of lokaal via: info \(aq(coreutils) chown invocation\(aq
sv: eller tillgängligt lokalt via: info \(aq(coreutils) chown invocation\(aq

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
hu: 2021 október
nl: Oktober 2021
sv: oktober 2021

source: March 2022
nl: Maart 2022
sv: mars 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: April 2022
hu: 2022 április

source: COPYRIGHT
hu: SZERZŐI JOG

source: September 2020
hu: 2020 szeptember

source: September 2021
hu: 2021 szeptember

source: chown(2)
sv: B<chown>(2)

source: August 2022
sv: augusti 2022
