Repository: sebras/manpages-l10n
Catalog: po/*/man1/colcrt.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: colcrt - filter nroff output for CRT previewing
uk: colcrt — фільтрування виведених даних nroff для попереднього перегляду CRT.

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<colcrt> [options] [I<file> ...]
uk: B<colcrt> [параметри] [I<файл> ...]

source: DESCRIPTION
uk: ОПИС

source: B<colcrt> provides virtual half-line and reverse line feed sequences for terminals without such capability, and on which overstriking is destructive. Half-line characters and underlining (changed to dashing `-\(aq) are placed on new lines in between the normal output lines.
uk: B<colcrt> надає у ваше розпорядження піврядкові послідовності та послідовності оберненої подачі рядка для терміналів без таких можливостей, на яких перекреслювання символів є руйнівним. Піврядкові символи та підкреслювання (змінені на дефіси «-») буде розташовано у нових рядках між звичайними рядками виведення даних.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Suppress all underlining. This option is especially useful for previewing I<allboxed> tables from B<tbl>(1).
uk: Придушити усе підкреслювання. Цей параметр особливо корисним для попереднього перегляду таблиць I<allboxed> з B<tbl>(1).

source: Causes all half-lines to be printed, effectively double spacing the output. Normally, a minimal space output format is used which will suppress empty lines. The program never suppresses two consecutive empty lines, however. The B<-2> option is useful for sending output to the line printer when the output contains superscripts and subscripts which would otherwise be partially invisible.
uk: Призводить до виведення усіх напіврядків, насправді збільшуючи удвічі інтервали у виведених даних. Зазвичай, буде використано формат виведення із мінімальним інтервалом, за якого буде придушено виведення порожніх рядків. Втім, програма ніколи не придушує подвійні послідовні порожні рядки. Параметр B<-2> є корисним для надсилання виведених даних на лінійний принтер, якщо у виведених даних містяться верхні та нижні індекси, які інакше були б частково невидимими.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: HISTORY
uk: ЖУРНАЛ

source: The B<colcrt> command appeared in 3.0BSD.
uk: Команда B<colcrt> з'явилася у 3.0BSD.

source: BUGS
uk: ВАДИ

source: Should fold underlines onto blanks even with the B<-> option so that a true underline character would show.
uk: Має згорнути підкреслення у пробіли, навіть з параметром B<->, отже має бути показано справжній підкреслений символ.

source: Can\(cqt back up more than 102 lines.
uk: Не можна резервувати більше за 102 рядки.

source: General overstriking is lost; as a special case \(aq|\(aq overstruck with \(aq-\(aq or underline becomes \(aq+\(aq.
uk: Загальне перекреслення буде втрачено; як особливий випадок, «|» перекреслюється «-» або підкреслюється, даючи «+».

source: Lines are trimmed to 132 characters.
uk: Рядки буде обрізано на позиції у 132 символи.

source: Some provision should be made for processing superscripts and subscripts in documents which are already double-spaced.
uk: Для обробки верхніх і нижніх індексів у документах, де вже використано подвійні пробіли, слід вжити певних додаткових заходів.

source: EXAMPLES
uk: ПРИКЛАДИ

source: A typical use of B<colcrt> would be:
uk: Типовий приклад використання B<colcrt>:

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<colcrt> command is part of the util-linux package which can be downloaded from
uk: B<colcrt> є частиною пакунка util-linux, який можна отримати з

source: September 2011
uk: Вересень 2011 року

source: B<colcrt> [options] [I<file>...]
uk: B<colcrt> [параметри] [I<файл> ...]

source: B<colcrt> provides virtual half-line and reverse line feed sequences for terminals without such capability, and on which overstriking is destructive. Half-line characters and underlining (changed to dashing `-') are placed on new lines in between the normal output lines.
uk: B<colcrt> надає у ваше розпорядження піврядкові послідовності та послідовності оберненої подачі рядка для терміналів без таких можливостей, на яких перекреслювання символів є руйнівним. Піврядкові символи та підкреслювання (змінені на дефіси «-») буде розташовано у нових рядках між звичайними рядками виведення даних.

source: Suppress all underlining. This option is especially useful for previewing I<allboxed> tables from B<tbl>(1).
uk: Придушити усе підкреслювання. Цей параметр особливо корисним для попереднього перегляду таблиць I<allboxed> з B<tbl>(1).

source: Causes all half-lines to be printed, effectively double spacing the output. Normally, a minimal space output format is used which will suppress empty lines. The program never suppresses two consecutive empty lines, however. The B<-2> option is useful for sending output to the line printer when the output contains superscripts and subscripts which would otherwise be invisible.
uk: Призводить до виведення усіх напіврядків, насправді збільшуючи удвічі інтервали у виведених даних. Зазвичай, буде використано формат виведення із мінімальним інтервалом, за якого буде придушено виведення порожніх рядків. Втім, програма ніколи не придушує подвійні послідовні порожні рядки. Параметр B<-2> є корисним для надсилання виведених даних на лінійний принтер, якщо у виведених даних містяться верхні та нижні індекси, які інакше були б частково невидимими.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: Should fold underlines onto blanks even with the B<'-'> option so that a true underline character would show.
uk: Має згорнути підкреслення у пробіли, навіть з параметром B<->, отже має бути показано справжній підкреслений символ.

source: Can't back up more than 102 lines.
uk: Не можна резервувати більше за 102 рядки.

source: General overstriking is lost; as a special case '|' overstruck with '-' or underline becomes '+'.
uk: Загальне перекреслення буде втрачено; як особливий випадок, «|» перекреслюється «-» або підкреслюється, даючи «+».

source: The colcrt command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма colcrt є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: Causes all half-lines to be printed, effectively double spacing the output. Normally, a minimal space output format is used which will suppress empty lines. The program never suppresses two consecutive empty lines, however. The B<-2> option is useful for sending output to the line printer when the output contains superscripts and subscripts which would otherwise be invisible.
uk: Призводить до виведення усіх напіврядків, насправді збільшуючи удвічі інтервали у виведених даних. Зазвичай, буде використано формат виведення із мінімальним інтервалом, за якого буде придушено виведення порожніх рядків. Втім, програма ніколи не придушує подвійні послідовні порожні рядки. Параметр B<-2> є корисним для надсилання виведених даних на лінійний принтер, якщо у виведених даних містяться верхні та нижні індекси, які інакше були б частково невидимими.

source: Should fold underlines onto blanks even with the B<\(aq-\(aq> option so that a true underline character would show.
uk: Має згорнути підкреслення у пробіли, навіть з параметром B<->, отже має бути показано справжній підкреслений символ.
