Repository: sebras/manpages-l10n
Catalog: po/*/man1/coredumpctl.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: coredumpctl - Retrieve and process saved core dumps and metadata
de: coredumpctl - Abfragen und Verarbeiten gespeicherter Speicherauszüge und Metadaten

source: SYNOPSIS
de: ÜBERSICHT

source: B<coredumpctl> [OPTIONS...] {COMMAND} [PID|COMM|EXE|MATCH...]
de: B<coredumpctl> [OPTIONEN…] {BEFEHL} [PID|PROG|BEF|TREFFER…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<coredumpctl> is a tool that can be used to retrieve and process core dumps and metadata which were saved by B<systemd-coredump>(8)\&.
de: B<coredumpctl> ist ein Werkzeug, das zur Abfrage und Verarbeitung von durch B<systemd-coredump>(8) gespeicherten Speicherauszügen und Metadaten verwandt werden kann\&.

source: COMMANDS
de: BEFEHLE

source: The following commands are understood:
de: Die folgenden Befehle werden verstanden:

source: List core dumps captured in the journal matching specified characteristics\&. If no command is specified, this is the implied default\&.
de: Listet im Journal eingesammelte Speicherauszüge auf, die auf angegebene Charakteristika passen\&. Falls kein Befehl angegeben ist, ist dies die implizierte Vorgabe\&.

source: The output is designed to be human readable and contains a table with the following columns:
de: Die Ausgabe soll menschenlesbar sein und enthält eine Tabelle mit den folgenden Spalten:

source: The timestamp of the crash, as reported by the kernel\&.
de: Der Zeitstempel des Absturzes, wie vom Kernel gemeldet\&.

source: The identifier of the process that crashed\&.
de: Die Kennzeichnung des abgestürzten Prozesses\&.

source: The user and group identifiers of the process that crashed\&.
de: Die Benutzer- und Gruppenkennzeichner des abgestürzten Prozesses\&.

source: The signal that caused the process to crash, when applicable\&.
de: Das Signal, das den Prozess zum Absturz brachte, falls zutreffend\&.

source: Information whether the coredump was stored, and whether it is still accessible: "none" means the core was not stored, "-" means that it was not available (for example because the process was not terminated by a signal), "present" means that the core file is accessible by the current user, "journal" means that the core was stored in the "journal", "truncated" is the same as one of the previous two, but the core was too large and was not stored in its entirety, "error" means that the core file cannot be accessed, most likely because of insufficient permissions, and "missing" means that the core was stored in a file, but this file has since been removed\&.
de: Informationen, ob der Speicherauszug gespeichert wurde und ob er noch zugreifbar ist: »none« bedeutet, dass der Speicherauszug nicht gespeichert wurde, »-« bedeutet, dass er nicht verfügbar war (weil der Prozess beispielsweise nicht durch ein Signal beendet wurde), »present« bedeutet, dass der aktuelle Benutzer auf den Speicherauszug zugreifen kann, »journal« bedeutet, dass der Speicherauszug im »journal« gespeichert wurde, »truncated« ist das gleiche wie die vorherigen zwei, aber der Speicherauszug war zu groß und wurde nicht als Ganzes gespeichert, »error« bedeutet, dass auf die Speicherauszugsdatei nicht zugegriffen werden kann, wahrscheinlich aufgrund nicht ausreichender Rechte und »missing« bedeutet, dass der Speicherauszug in einer Datei gespeichert wurde, aber die Datei wurde danach entfernt\&.

source: The full path to the executable\&. For backtraces of scripts this is the name of the interpreter\&.
de: Der komplette Pfad zum Programm\&. Für Backtraces von Skripten ist dies der Name des Interpreters\&.

source: It\*(Aqs worth noting that different restrictions apply to data saved in the journal and core dump files saved in /var/lib/systemd/coredump, see overview in B<systemd-coredump>(8)\&. Thus it may very well happen that a particular core dump is still listed in the journal while its corresponding core dump file has already been removed\&.
de: Es ist gut zu wissen, dass verschiedene Beschränkungen für Daten, die im Journal gespeichert werden und für Speicherauszüge, die in /var/lib/systemd/coredump abgelegt sind, gelten\&. Lesen Sie den Überblick in B<systemd-coredump>(8)\&. Daher ist es gut möglich, dass ein bestimmter Speicherauszug noch im Journal aufgeführt ist, obwohl die entsprechende Speicherauszugsdatei bereits entfernt wurde\&.

source: Show detailed information about the last core dump or core dumps matching specified characteristics captured in the journal\&.
de: Zeigt detaillierte Informationen über den neusten Speicherauszug an, der auf die angegebenen Charakteristika passt und im Journal gesammelt wurde\&.

source: Extract the last core dump matching specified characteristics\&. The core dump will be written on standard output, unless an output file is specified with B<--output=>\&.
de: Extrahiert den neusten Speicherauszug, der auf die angegebenen Charakteristika passt\&. Der Speicherauszug wird auf die Standardausgabe geschrieben, außer eine Ausgabedatei wurde mit B<--output=> angegeben\&.

source: Invoke a debugger on the last core dump matching specified characteristics\&. By default, B<gdb>(1) will be used\&. This may be changed using the B<--debugger=> option or the I<$SYSTEMD_DEBUGGER> environment variable\&. Use the B<--debugger-arguments=> option to pass extra command line arguments to the debugger\&.
de: Ruft einen Debugger auf den neusten Speicherauszug auf, der auf die angegebenen Charakteristika passt\&. Standardmäßig wird B<gdb>(1) verwandt\&. Dies kann mittels der Option B<--debugger=> oder der Umgebungsvariable I<$SYSTEMD_DEBUGGER> geändert werden\&. Verwenden Sie die Option B<--debugger-arguments=>, um zusätzliche Befehlszeilenargumente an den Debugger zu übergeben\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Do not print the legend, i\&.e\&. column headers and the footer with hints\&.
de: Gibt die Legende nicht aus, d\&.h\&. die Spaltenköpfe und die Fußzeile mit Hinweisen\&.

source: B<--json=>I<MODE>
de: B<--json=>I<MODUS>

source: Shows output formatted as JSON\&. Expects one of "short" (for the shortest possible output without any redundant whitespace or line breaks), "pretty" (for a pretty version of the same, with indentation and line breaks) or "off" (to turn off JSON output, the default)\&.
de: Zeigt die Ausgabe als JSON formatiert\&. Erwartet entweder »short« (für die kürzest mögliche Ausgabe ohne unnötigen Leerraum oder Zeilenumbrüche), »pretty« (für eine schönere Version der gleichen Ausgabe, mit Einzügen und Zeilenumbrüchen) oder »off« (um die standardmäßig aktivierte JSON-Ausgabe auszuschalten)\&.

source: Show information of the most recent core dump only, instead of listing all known core dumps\&. Equivalent to B<--reverse -n 1>\&.
de: Nur Informationen über den neusten Speicherauszug anzeigen, statt alle bekannten Speicherauszüge aufzulisten\&. Äquivalent zu B<--reverse -n 1>\&.

source: B<-n> I<INT>
de: B<-n> I<ANZ>

source: Show at most the specified number of entries\&. The specified parameter must be an integer greater or equal to 1\&.
de: Höchstens die angegebene Anzahl von Einträgen anzeigen\&. Der angegebene Parameter muss eine Ganzzahl größer oder gleich 1 sein\&.

source: Only print entries which are since the specified date\&.
de: Gibt nur Einträge seit dem angegebenen Datum aus\&.

source: Only print entries which are until the specified date\&.
de: Gibt nur Einträge bis zu dem angegebenen Datum aus\&.

source: Reverse output so that the newest entries are displayed first\&.
de: Invertiert die Ausgabe, so dass die neusten Einträge zuerst dargestellt werden\&.

source: B<-F> I<FIELD>, B<--field=>I<FIELD>
de: B<-F> I<FELD>, B<--field=>I<FELD>

source: Print all possible data values the specified field takes in matching core dump entries of the journal\&.
de: Gibt alle möglichen Datenwerte aus, die das angegebene Feld beim Abgleich von Speicherauszugseinträgen im Journal akzeptiert\&.

source: B<-o> I<FILE>, B<--output=>I<FILE>
de: B<-o> I<DATEI>, B<--output=>I<DATEI>

source: Write the core to B<FILE>\&.
de: Schreibt den Speicherauszug nach B<DATEI>\&.

source: Use the given debugger for the B<debug> command\&. If not given and I<$SYSTEMD_DEBUGGER> is unset, then B<gdb>(1) will be used\&.
de: Verwendet den angegebenen Debugger für den Befehl B<debug>\&. Falls nicht übergeben und I<$SYSTEMD_DEBUGGER> nicht gesetzt ist, dann wird B<gdb>(1) verwandt\&.

source: B<-A> I<ARGS>, B<--debugger-arguments=>I<ARGS>
de: B<-A> I<ARG>, B<--debugger-arguments=>I<ARG>

source: Pass the given I<ARGS> as extra command line arguments to the debugger\&. Quote as appropriate when I<ARGS> contain whitespace\&. (See Examples\&.)
de: Die angegebene I<ARG> als zusätzliche Befehlszeilenargumente an den Debugger übergeben\&. Wenn I<ARG> Leerraumzeichen enthält, müssen Sie geeignet englische Anführungszeichen verwenden\&. (Siehe Beispiele\&.)

source: Takes a file glob as an argument\&. If specified, coredumpctl will operate on the specified journal files matching I<GLOB> instead of the default runtime and system journal paths\&. May be specified multiple times, in which case files will be suitably interleaved\&.
de: Akzeptiert einen Datei-Glob als Argument\&. Falls angegeben, wird Coredumpctl auf den auf I<GLOB> passenden Journal-Dateien statt den vorgegebenen Laufzeit- und System-Journal-Pfaden arbeiten\&. Kann mehrfach angegeben werden, dann werden Dateien geeignet verschachtelt\&.

source: B<-D> I<DIR>, B<--directory=>I<DIR>
de: B<-D> I<VERZ>, B<--directory=>I<VERZ>

source: Use the journal files in the specified B<DIR>\&.
de: Verwendet die Journal-Datei im angegebenen B<VERZ>\&.

source: Suppresses informational messages about lack of access to journal files and possible in-flight coredumps\&.
de: Unterdrückt informelle Meldungen über fehlenden Zugriff auf Journaldateien und möglicherweise gerade ablaufende Speicherauszüge\&.

source: Look at all available journal files in /var/log/journal/ (excluding journal namespaces) instead of only local ones\&.
de: Schaut in alle verfügbaren Journal-Dateien in /var/log/journal/ (ohne Journal-Namensräume), statt nur in lokale Dateien\&.

source: MATCHING
de: ÜBEREINSTIMMUNG

source: A match can be:
de: Eine Übereinstimmung kann Folgendes sein:

source: Process ID of the process that dumped core\&. An integer\&.
de: Prozesskennung des Prozesses, der den Speicherauszug erzeugte\&. Eine Ganzzahl\&.

source: I<COMM>
de: I<PROG>

source: Name of the executable (matches B<COREDUMP_COMM=>)\&. Must not contain slashes\&.
de: Name des Programms (passt auf B<COREDUMP_COMM=>)\&. Darf keinen Schrägstrich enthalten\&.

source: I<EXE>
de: I<BEF>

source: Path to the executable (matches B<COREDUMP_EXE=>)\&. Must contain at least one slash\&.
de: Pfad zu dem Programm (passt auf B<COREDUMP_EXE=>)\&. Muss mindestens einen Schrägstrich enthalten\&.

source: I<MATCH>
de: I<TREFFER>

source: General journalctl match filter, must contain an equals sign ("=")\&. See B<journalctl>(1)\&.
de: Allgemeiner-Journalctl-Treffer-Filter, muss ein Gleichheitszeichen (»=«) enthalten\&. Siehe B<journalctl>(1)\&.

source: On success, 0 is returned; otherwise, a non-zero failure code is returned\&. Not finding any matching core dumps is treated as failure\&.
de: Im Erfolgsfall wird 0 zurückgeliefert; andernfalls wird ein von Null verschiedener Fehler-Code zurückgeliefert\&. Werden keine passenden Speicherauszüge gefunden, wird dies als Fehler betrachtet\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: Use the given debugger for the B<debug> command\&. See the B<--debugger=> option\&.
de: Verwendet den übergebenen Debugger für den Befehl B<debug>\&. Siehe die Option B<--debugger=>\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&List all the core dumps of a program>
de: B<Beispiel\ \&1.\ \&Alle Speicherauszüge eines Programms auflisten>

source: The journal has three entries pertaining to /usr/lib64/firefox/firefox, and only the last entry still has an available core file (in external storage on disk)\&.
de: Das Journal hat drei Einträge, die sich auf /usr/lib64/firefox/firefox beziehen und nur beim letzten Eintrag ist eine Speicherauszugsdatei (in externem Speicher auf Platte) verfügbar\&.

source: Note that coredumpctl needs access to the journal files to retrieve the relevant entries from the journal\&. Thus, an unprivileged user will normally only see information about crashing programs of this user\&.
de: Beachten Sie, dass coredumpctl Zugriff auf die Journal-Dateien haben muss, um die relevanten Einträge aus dem Journal herauszuholen\&. Daher wird ein nicht privilegierter Benutzer normalerweise nur die Informationen über abstürzende Programme dieses Benutzers sehen\&.

source: B<Example\ \&2.\ \&Invoke gdb on the last core dump>
de: B<Beispiel\ \&2.\ \&Gdb auf den letzten Speicherauszug anwenden>

source: B<Example\ \&3.\ \&Use gdb to display full register info from the last core dump>
de: B<Beispiel\ \&3.\ \&Gdb verwenden, um die vollständigen Registerinformationen des letzten Speicherauszugs anzuzeigen>

source: B<Example\ \&4.\ \&Show information about a core dump matched by PID>
de: B<Beispiel\ \&4.\ \&Informationen über den Speicherauszug basierend auf der PID anzeigen>

source: B<Example\ \&5.\ \&Extract the last core dump of /usr/bin/bar to a file named bar\&.coredump>
de: B<Beispiel\ \&5.\ \&Den neusten Speicherauszug aus /usr/bin/bar in eine Datei namens bar\&.coredump extrahieren>

source: SEE ALSO
de: SIEHE AUCH

source: The journal has three entries pertaining to /lib64/firefox/firefox, and only the last entry still has an available core file (in external storage on disk)\&.
de: Das Journal hat drei Einträge, die sich auf /lib64/firefox/firefox beziehen und nur beim letzten Eintrag ist eine Speicherauszugsdatei (in externem Speicher auf Platte) verfügbar\&.
