Repository: sebras/manpages-l10n
Catalog: po/*/man1/cut.1.po
Languages: de, hu

source: April 2022
hu: 2022 április

source: User Commands
de: Dienstprogramme für Benutzer
hu: Felhasználói parancsok

source: NAME
de: BEZEICHNUNG
hu: NÉV

source: cut - remove sections from each line of files
de: cut - Teile jeder Zeile aus Dateien entfernen
hu: cut - sorok kiválasztott részeit írja ki

source: SYNOPSIS
de: ÜBERSICHT
hu: ÖSSZEGZÉS

source: B<cut> I<\,OPTION\/>... [I<\,FILE\/>]...
de: B<cut> I<\,OPTION\/>… [I<\,DATEI\/>]…
hu: B<cut> [I<\,KAPCSOLÓ\/>]... [I<\,FÁJL\/>]...

source: DESCRIPTION
de: BESCHREIBUNG
hu: LEÍRÁS

source: Print selected parts of lines from each FILE to standard output.
de: Ausgewählte Teile aller Zeilen aus jeder DATEI auf Standardausgabe ausgeben.
hu: Minden egyes FÁJL kiválasztott részeinek kiírása a szabványos kimenetre.

source: With no FILE, or when FILE is -, read standard input.
de: liest ohne I<DATEI> oder wenn I<DATEI> B<-> ist, aus der Standardeingabe.
hu: Ha a FÁJL nincs megadva, vagy -, akkor a szabványos bemenetet olvassa.

source: Mandatory arguments to long options are mandatory for short options too.
de: Die obligatorischen Argumente für Optionen sind für deren Kurz- und Langform gleich.
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők.

source: B<-b>, B<--bytes>=I<\,LIST\/>
de: B<-b>, B<--bytes>=I<\,LISTE\/>
hu: B<-b>, B<--bytes>=I<\,LISTA\/>

source: select only these bytes
de: Nur diese Bytes auswählen
hu: csak ezen bájtok kiválasztása

source: B<-c>, B<--characters>=I<\,LIST\/>
de: B<-c>, B<--characters>=I<\,LISTE\/>
hu: B<-c>, B<--characters>=I<\,LISTA\/>

source: select only these characters
de: Nur diese Zeichen auswählen
hu: csak ezen karakterek kiválasztása

source: B<-d>, B<--delimiter>=I<\,DELIM\/>
de: B<-d>, B<--delimiter>=I<\,TRENNER\/>
hu: B<-d>, B<--delimiter>=I<\,ELHAT\/>

source: use DELIM instead of TAB for field delimiter
de: TRENNER anstelle des Tabulators als Feldtrennzeichen benutzen
hu: az ELHAT használata a TAB helyett mezőelválasztóként

source: B<-f>, B<--fields>=I<\,LIST\/>
de: B<-f>, B<--fields>=I<\,LISTE\/>
hu: B<-f>, B<--fields>=I<\,LISTA\/>

source: select only these fields; also print any line that contains no delimiter character, unless the B<-s> option is specified
de: Nur diese Felder auswählen; außerdem jede Zeile ausgeben, die kein Trennzeichen enthält, es sei denn, die Option B<-s> ist angegeben
hu: csak ezen mezők kiválasztása; valamint bármely sor kiírása, amely nem tartalmaz elhatárolókaraktert, kivéve ha a B<-s> kapcsoló meg van adva

source: (ignored)
de: (ignoriert)
hu: (figyelmen kívül marad)

source: complement the set of selected bytes, characters or fields
de: Das Komplement der Menge der gewählten Bytes, Zeichen oder Felder bilden
hu: a kijelölt bájtok, karakterek vagy mezők halmazának kiegészítése.

source: do not print lines not containing delimiters
de: Keine Zeilen ausgeben, die keine Trennzeichen enthalten
hu: ne írja ki az elhatárolókat nem tartalmazó sorokat

source: B<--output-delimiter>=I<\,STRING\/>
de: B<--output-delimiter>=I<\,ZEICHENKETTE\/>
hu: B<--output-delimiter>=I<\,KARAKTERLÁNC\/>

source: use STRING as the output delimiter the default is to use the input delimiter
de: ZEICHENKETTE als Ausgabetrennzeichen benutzen; Voreinstellung ist das Eingabetrennzeichen
hu: a KARAKTERLÁNC használata a kimenet elhatárolójaként, az alapértelmezés a bemenet elhatárolójának használata

source: line delimiter is NUL, not newline
de: Zeilen mit Nullbyte (NUL) trennen, nicht mit Zeilenumbruch
hu: a sorok elválasztója NUL, nem új sor

source: display this help and exit
de: zeigt Hilfeinformationen an und beendet das Programm.
hu: ezen súgó megjelenítése és kilépés

source: output version information and exit
de: gibt Versionsinformationen aus und beendet das Programm.
hu: verzióinformációk megjelenítése és kilépés

source: Use one, and only one of B<-b>, B<-c> or B<-f>. Each LIST is made up of one range, or many ranges separated by commas. Selected input is written in the same order that it is read, and is written exactly once. Each range is one of:
de: Benutzen Sie genau eines der Argumente aus B<-b>, B<-c> oder B<-f>. Jede LISTE besteht aus einem Bereich oder mehreren, durch Kommata getrennten, Bereichen. Die ausgewählte Eingabe wird in derselben Reihenfolge geschrieben, wie sie gelesen wird und genau einmal geschrieben. Jeder Bereich ist eins aus:
hu: A B<-b>, B<-c> vagy B<-f> közül csak egyet használj. Minden egyes LISTA legalább egy, vesszőkkel elválasztott tartományból áll. A kiválasztott bemenet a beolvasás sorrendjében és pontosan egyszer kerül kiírásra. Minden egyes tartomány az alábbiak egyike:

source: N'th byte, character or field, counted from 1
de: N-tes Byte, Zeichen oder Feld, beginnend bei 1
hu: N. bájt, karakter vagy mező, 1-től számítva

source: from N'th byte, character or field, to end of line
de: Vom N-ten Byte, Zeichen oder Feld bis zum Ende der Zeile
hu: az N. bájttól, karaktertől vagy mezőtől a sor végéig

source: from N'th to M'th (included) byte, character or field
de: Vom N-ten zum M-ten (eingeschlossen) Byte, Zeichen oder Feld
hu: az N. bájttól, karaktertől vagy mezőtől az M.-ig (azt is beleértve)

source: from first to M'th (included) byte, character or field
de: Vom ersten zum M-ten (eingeschlossen) Byte, Zeichen oder Feld
hu: az első bájttól, karaktertől vagy mezőtől az M.-ig (azt is beleértve)

source: AUTHOR
de: AUTOR
hu: SZERZŐ

source: Written by David M. Ihnat, David MacKenzie, and Jim Meyering.
de: Geschrieben von David M. Ihnat, David MacKenzie und Jim Meyering.
hu: Írta David M. Ihnat, David MacKenzie, és Jim Meyering.

source: REPORTING BUGS
de: FEHLER MELDEN
hu: HIBÁK JELENTÉSE

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
de: Onlinehilfe für GNU coreutils: E<.UR https://www.gnu.org/software/coreutils/>E<.UE>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: COPYRIGHT
hu: SZERZŐI JOG

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2022 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
hu: Copyright \(co 2022 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.

source: SEE ALSO
de: SIEHE AUCH
hu: LÁSD MÉG

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/cutE<gt>
de: Vollständige Dokumentation unter: E<lt>https://www.gnu.org/software/coreutils/cutE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/cutE<gt>

source: or available locally via: info \(aq(coreutils) cut invocation\(aq
de: oder lokal verfügbar mit: info \(aq(coreutils) cut invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) cut invocation\(aq

source: September 2020
hu: 2020 szeptember

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2020 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
de: Oktober 2021
hu: 2021 október

source: March 2022
hu: 2022 március

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2021
hu: 2021 szeptember

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
de: Melden Sie Fehler in der Übersetzung an E<.UR https://translationproject.org/team/de.html> das deutschsprachige Team beim GNU Translation ProjectE<.UE .>

source: with B<-b>: don't split multibyte characters
de: mit B<-b>: teilt Multibyte-Zeichen nicht
