Repository: sebras/manpages-l10n
Catalog: po/*/man1/date.1.po
Languages: es, uk

source: April 2022
es: Abril de 2022
uk: Квітень 2022 року

source: User Commands
es: Órdenes de usuario
uk: Команди користувача

source: NAME
es: NOMBRE
uk: НАЗВА

source: date - print or set the system date and time
es: date - muestra o define la fecha y hora del sistema
uk: date — виведення або встановлення дати і часу у системі

source: SYNOPSIS
es: SINOPSIS
uk: КОРОТКИЙ ОПИС

source: B<date> [I<\,OPTION\/>]... [I<\,+FORMAT\/>]
es: B<date> [I<\,OPCIÓN\/>]... [I<\,+FORMATO\/>]
uk: B<date> [I<\,ПАРАМЕТР\/>]... [I<\,+ФОРМАТ\/>]

source: B<date> [I<\,-u|--utc|--universal\/>] [I<\,MMDDhhmm\/>[[I<\,CC\/>]I<\,YY\/>][I<\,.ss\/>]]
uk: B<date> [I<\,-u|--utc|--universal\/>] [I<\,ММДДггхх\/>[[I<\,СС\/>]I<\,РР\/>][I<\,.сс\/>]]

source: DESCRIPTION
es: DESCRIPCIÓN
uk: ОПИС

source: Display date and time in the given FORMAT. With B<-s>, or with [MMDDhhmm[[CC]YY][.ss]], set the date and time.
es: Muestra la fecha y hora actual en el FORMATO indicado. Con la opción B<-s> o con [MMDDhhmm[[CC]YY][.ss]] define la fecha y la hora.
uk: Показати дату і час у вказаному ФОРМАТі. З B<-s> або з [ММДДггхх[[СС]РР][.сс]] встановити дату і час.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
uk: Обов'язкові аргументи для довгих параметрів також є обов'язковими для коротких параметрів.

source: B<-d>, B<--date>=I<\,STRING\/>
es: B<-d>, B<--date>=I<\,CADENA\/>
uk: B<-d>, B<--date>=I<\,РЯДОК\/>

source: display time described by STRING, not 'now'
es: muestra la fecha y hora según se indique en la CADENA, por ejemplo "now"
uk: показати час, описаний РЯДКОМ, а не поточний.

source: annotate the parsed date, and warn about questionable usage to stderr
es: muestra la fecha solicitada dando cuenta por la salida de error estándar de cualquier uso cuestionable
uk: анотувати оброблену дату, і попередити щодо проблем до stderr

source: B<-f>, B<--file>=I<\,DATEFILE\/>
es: B<-f>, B<--file>=I<\,ARCHIVO\/>
uk: B<-f>, B<--file>=I<\,ФАЙЛ_ДАТИ\/>

source: like B<--date>; once for each line of DATEFILE
es: igual que B<--date>; pero ejecutando una vez por cada línea de ARCHIVO
uk: подібний до B<--date> для кожного з рядків ФАЙЛ_ДАТИ

source: B<-I[FMT]>, B<--iso-8601>[=I<\,FMT\/>]
uk: B<-I[СПЕЦЧАСУ]>, B<--iso-8601>[=I<СПЕЦЧАСУ\/>]

source: output date/time in ISO 8601 format. FMT='date' for date only (the default), \&'hours', 'minutes', 'seconds', or 'ns' for date and time to the indicated precision. Example: 2006-08-14T02:34:56-06:00
es: muestra la fecha y hora en formato ISO 8601. Puede usarse FMT="date" si se desea ver solo la fecha (por defecto), "hours", "minutes", "seconds" o "ns" para obtener otros formatos de fecha y hora. Por ejemplo: 2006-08-14T02:34:56-06:00
uk: вивести дату і час у форматі ISO 8601. СПЕЦЧАСУ='date' визначає лише дату (типово), 'hours', 'minutes', 'seconds' і 'ns' -- дата і час із відповідною точністю. Приклад: 2006-08-14T02:34:56-06:00

source: output the available resolution of timestamps Example: 0.000000001
es: muestra la exactitud disponible para las marcas de tiempo, p. ej: 0.000000001
uk: вивести доступну роздільність часових позначок. Приклад: 0.000000001

source: output date and time in RFC 5322 format. Example: Mon, 14 Aug 2006 02:34:56 B<-0600>
es: muestra la fecha y hora en el formato definido en el RFC 5322. Por ejemplo: Mon, 14 Aug 2006 02:34:56 B<-0600>
uk: виводити час відповідно до RFC 5322. Приклад: Mon, Mon, 14 Aug 2006 02:34:56 B<-0600>

source: B<--rfc-3339>=I<\,FMT\/>
uk: B<--rfc-3339>=I<\,СПЕЦ\/>

source: output date/time in RFC 3339 format. FMT='date', 'seconds', or 'ns' for date and time to the indicated precision. Example: 2006-08-14 02:34:56-06:00
es: muestra la fecha/hora con formato RFC 3339. "FMT" puede ser "date", "seconds" o "ns" según la precisión deseada. Por ejemplo: 2021-05-30 14:54:04+02:00
uk: вивести дату/час у форматі RFC 3339. СПЕЦ='date', 'seconds' або 'ns' для отримання дати та часу з вказаною точністю. Приклад: 2006-08-14 02:34:56-06:00

source: B<-r>, B<--reference>=I<\,FILE\/>
es: B<-r>, B<--reference>=I<\,ARCHIVO\/>
uk: B<-r>, B<--reference>=I<\,ФАЙЛ\/>

source: display the last modification time of FILE
es: muestra la fecha y hora de la última modificación de ARCHIVO
uk: показати час останньої зміни ФАЙЛа

source: B<-s>, B<--set>=I<\,STRING\/>
es: B<-s>, B<--set>=I<\,CADENA\/>
uk: B<-s>, B<--set>=I<\,РЯДОК\/>

source: set time described by STRING
es: define la fecha y hora tal como se especifica en CADENA
uk: встановити час, описаний у РЯДКУ

source: print or set Coordinated Universal Time (UTC)
es: muestra o define fecha y hora en formato UTC (Coordinated Universal Time)
uk: вивести або встановити значення за координованим всесвітнім часом (UTC)

source: display this help and exit
es: muestra la ayuda y finaliza
uk: відображає довідку і виходить

source: output version information and exit
es: muestra la versión del programa y finaliza
uk: виводить інформацію про версію і виходить

source: FORMAT controls the output. Interpreted sequences are:
es: FORMATO controla la salida. Las secuencias que se interpretan son las siguientes:
uk: ФОРМАТ керує виводом так само, як у функції C printf. Приймаються наступні послідовності:

source: a literal %
es: símbolo "%" literal
uk: символ відсотків («%»)

source: locale's abbreviated weekday name (e.g., Sun)
es: nombre del día de la semana localizado y abreviado (p.ej. Dom)
uk: скорочена форма запису дня тижня у локалі (наприклад, Нд)

source: locale's full weekday name (e.g., Sunday)
es: nombre del día de la semana localizado completo (p.ej. Domingo)
uk: повна назва дня тижня у локалі (наприклад, неділя)

source: locale's abbreviated month name (e.g., Jan)
es: nombre del mes localizado y abreviado (p.ej. ene)
uk: скорочена назва місяця у локалі (наприклад, січ)

source: locale's full month name (e.g., January)
es: nombre del mes localizado y completo (p.ej. agosto)
uk: повна назва місяця у локалі (наприклад, січня)

source: locale's date and time (e.g., Thu Mar 3 23:05:25 2005)
es: fecha y hora localizadas (por ejemplo: dom 30 may 2021 15:09:59)
uk: дата і час у локалі (наприклад, пт, 29-кві-2022 21:45:24 +0300)

source: century; like %Y, except omit last two digits (e.g., 20)
es: siglo, al igual que %Y pero omitiendo los dos últimos dígitos (p.ej: 21)
uk: століття; як %Y, але без двох останніх цифр (наприклад 20)

source: day of month (e.g., 01)
es: día del mes (p.ej:05)
uk: день місяця (наприклад 01)

source: date; same as %m/%d/%y
es: fecha; igual que %m/%d/%y
uk: дата; те саме, що і %m/%d/%y

source: day of month, space padded; same as %_d
es: día del mes, con separación; igual que %_d
uk: день місяця, доповнений пробілами; те саме, що і %_d

source: full date; like %+4Y-%m-%d
es: fecha completa, igual que %+4Y-%m-%d
uk: дата повністю; подібно до %+4Y-%m-%d

source: last two digits of year of ISO week number (see %G)
es: últimos dos dígitos del año correspondiente al número de semana ISO (consulte %G)
uk: останні дві цифри року номера тижня ISO (див. %G)

source: year of ISO week number (see %V); normally useful only with %V
es: año correspondiente al número de semana ISO (consulte %V); en general solo es útil combinado con %V
uk: рік для номера тижня ISO (див. %V); зазвичай, корисно лише з %V

source: same as %b
es: idéntico a %b
uk: те саме, що і %b

source: hour (00..23)
es: hora (00..23)
uk: година (00..23)

source: hour (01..12)
es: hora (01..12)
uk: година (01..12)

source: day of year (001..366)
es: día del año (001..366)
uk: день року (001..366)

source: hour, space padded ( 0..23); same as %_H
es: hora, espaciada ( 0..23); igual que %_H
uk: години, доповнені пробілами; те саме, що і %_H

source: hour, space padded ( 1..12); same as %_I
es: hora, espaciada ( 1..12; igual que %_I
uk: години, доповнені пробілами ( 1..12); те саме, що і %_I

source: month (01..12)
es: mes (01..12)
uk: місяць (01..12)

source: minute (00..59)
es: minuto (00..59)
uk: хвилина (00..59)

source: a newline
es: nueva línea
uk: символ розриву рядка

source: nanoseconds (000000000..999999999)
es: nanosegundos (000000000..999999999)
uk: наносекунди (000000000..999999999)

source: locale's equivalent of either AM or PM; blank if not known
es: equivalente localizado de AM o PM; en blanco si es desconocido
uk: еквівалент AM або PM у локалі; порожнє значення, якщо таких не передбачено

source: like %p, but lower case
es: igual que %p, pero en mayúsculas
uk: подібний до %p, але літерами нижнього регістру

source: quarter of year (1..4)
es: cuatrimestre (1..4)
uk: квартал року (1..4)

source: locale's 12-hour clock time (e.g., 11:11:04 PM)
es: hora localizada en el sistema horario de 12 horas (por ejemplo: 04:30:42)
uk: час у 12-годинному форматі для локалі (наприклад, 11:11:04 PM)

source: 24-hour hour and minute; same as %H:%M
es: hora y minuto en el sistema horario de 24 horas; igual que %H:%M
uk: години і хвилин за 24-годинним форматом; те саме, що і %H:%M

source: seconds since the Epoch (1970-01-01 00:00 UTC)
es: segundos desde el Inicio (Epoch) 1970-01-01 00:00:00 UTC
uk: кількість секунд від початку епохи (1970-01-01 00:00 UTC)

source: second (00..60)
es: segundo (00..60)
uk: секунди (00..60)

source: a tab
es: tabulación
uk: символ табуляції

source: time; same as %H:%M:%S
es: hora; igual que %H:%M:%S
uk: час; те саме, що і %H:%M:%S

source: day of week (1..7); 1 is Monday
es: día de la semana (1..7); 1 corresponde a lunes
uk: день тижня (1..7); 1 — понеділок

source: week number of year, with Sunday as first day of week (00..53)
es: número de semana dentro del año, considerando el domingo como primer día de la semana (00..53)
uk: номер тижня року, де першим днем тижня є неділя (00..53)

source: ISO week number, with Monday as first day of week (01..53)
es: Número de semana ISO, considera el lunes como primer día de la semana (01..53)
uk: номер тижня у форматі ISO, понеділок — перший день тижня (01..53)

source: day of week (0..6); 0 is Sunday
es: día de la semana(00..6); 0el 0 correspondería al domingo
uk: день тижня (0..6); 0 — неділя

source: week number of year, with Monday as first day of week (00..53)
es: número de semana en el año, considera el lunes como primer día de la semana (00..53)
uk: номер тижня року, де першим днем тижня є понеділок (00..53)

source: locale's date representation (e.g., 12/31/99)
es: representación localizada de la fecha (p.ej: 30/05/21)
uk: представлення дати у локалі (наприклад, 30.04.22)

source: locale's time representation (e.g., 23:13:48)
es: representación de la hora en formato localizado (p.ej: 16:41:56)
uk: представлення часу у локалі (наприклад, 23:13:48)

source: last two digits of year (00..99)
es: últimos dos dígitos del año (00..99)
uk: останні дві цифри року (00..99)

source: year
es: año
uk: рік

source: +hhmm numeric time zone (e.g., B<-0400>)
es: +hhmm representación numérica de la zona horaria (p.ej: B<+0200>)
uk: числове представлення часового поясу у форматі +ггхх (наприклад, B<+0300>)

source: +hh:mm numeric time zone (e.g., B<-04>:00)
es: +hh:mm representación numérica de la zona horaria (p.ej: B<+02>:00)
uk: числове представлення часового поясу у форматі +гг:хх (наприклад, B<+03>:00)

source: +hh:mm:ss numeric time zone (e.g., B<-04>:00:00)
es: +hh:mm:ss representación numérica de la zona horaria (p.ej: B<+02>:00:00)
uk: числове представлення часового поясу у форматі +гг:хх:сс (наприклад, B<+03>:00:00)

source: numeric time zone with : to necessary precision (e.g., B<-04>, +05:30)
es: representación numérica de la zona horaria con la precisión requerida (p.ej: B<+02>, +02:10)
uk: числове представлення часового поясу з : із потрібною точністю (наприклад, B<-04>, +05:30)

source: alphabetic time zone abbreviation (e.g., EDT)
es: Abreviatura alfabética de la zona horaria (p.ej: CEST)
uk: текстове скорочення запису часового поясу (наприклад, EEST)

source: By default, date pads numeric fields with zeroes. The following optional flags may follow '%':
es: Por defecto, se rellenarán con ceros los huecos en las fechas. Estas opciones pueden ir a continuación de '%':
uk: Типово, date доповнює числові поля нулями. Після «%» можна вказувати додаткові прапорці:

source: (hyphen) do not pad the field
es: (guión) no rellena
uk: (дефіс) не доповнювати поле

source: (underscore) pad with spaces
es: (guión bajo) rellena con espacios
uk: (підкреслювання) доповнити пробілами

source: (zero) pad with zeros
es: (zero) rellena con ceros
uk: (нуль) доповнити нулями

source: pad with zeros, and put '+' before future years with E<gt>4 digits
es: separa con ceros y añade un '+' antes de un año con E<gt>4 dígitos si corresponde al futuro.
uk: доповнити нулями і додати «+» перед наступними роками з E<gt>4 цифрами

source: use upper case if possible
es: emplea mayúsculas si posible
uk: використовувати верхній регістр, якщо можна

source: use opposite case if possible
es: emplea minúsculas si es posible
uk: використовувати протилежний регістр, якщо можна

source: After any flags comes an optional field width, as a decimal number; then an optional modifier, which is either E to use the locale's alternate representations if available, or O to use the locale's alternate numeric symbols if available.
es: Después de cualquier opción viene un ancho de campo opcional, en forma de número decimal; luego un modificador opcional, que es E para usar las representaciones alternativas de la configuración regional si están disponibles, o O para usar los símbolos numéricos alternativos de la configuración regional si están disponibles.
uk: Після будь-якої з ознак йде необов'язкова ширина поля у вигляді десяткового числа, потім необов'язковий модифікатор, один з наступних: E -- якщо можливо, вживати альтернативне представлення для поточної локалі або O -- якщо можливо, використовувати альтернативні числові символи локалі.

source: EXAMPLES
es: EJEMPLOS
uk: ПРИКЛАДИ

source: Convert seconds since the Epoch (1970-01-01 UTC) to a date
es: convierte los segundos desde el Inicio (Epoch: 01-01-1970 UTC) a una determinada fecha
uk: Перетворити кількість секунд від початку епохи (1970-01-01 UTC) на дату

source: Show the time on the west coast of the US (use B<tzselect>(1) to find TZ)
es: muestra la hora en la costa oeste de EEUU (emplea tzselect(1) para averiguar la zona horaria)
uk: Показати час на західному узбережжі США (скористайтеся B<tzselect>(1) для пошуку часового поясу)

source: Show the local time for 9AM next Friday on the west coast of the US
es: Muestra la hora local para las 9AM del próximo miércoles en la costa oeste de EEUU
uk: Показати місцевий час для 9 до опівдня наступної п'ятниці на західному узбережжі США

source: DATE STRING
es: CADENA DE FECHA
uk: РЯДОК ДАТИ

source: The --date=STRING is a mostly free format human readable date string such as "Sun, 29 Feb 2004 16:21:42 -0800" or "2004-02-29 16:21:42" or even "next Thursday". A date string may contain items indicating calendar date, time of day, time zone, day of week, relative time, relative date, and numbers. An empty string indicates the beginning of the day. The date string format is more complex than is easily documented here but is fully described in the info documentation.
es: --date=CADENA es una cadena de texto con un formato más o menos libre para indicar una fecha, por ejemplo "lun 02 nov 2020 22:38:49 CET" o bien "2020-02-29 16:21:42", incluso podría ser "next Thursday". El texto de fecha puede incluir la fecha, la hora, la zona horaria, el día de la semana, fechas y horas relativas así como otros datos. Una cadena vacía hace referencia al inicio del día. La cadena de fecha tiene un formato más complejo que el descrito aquí, puede consultar la página info para una descripción más detallada.
uk: Параметр B<--date>=I<РЯДОК>, здебільшого, довільний формат зручної для читання дати, зокрема «Sun, 29 Feb 2004 16:21:42 -0800», або «2004-02-29 16:21:42», або навіть «next Thursday». У рядку дати можуть міститися записи, які вказують на календарну дату, час доби, часовий пояс, день тижня, відносний час, відносну дату і числа. Порожній рядок відповідає початку дня. Формат рядка дати доволі складний, щоб його можна було тут описати, але його повний опис можна знайти у документації info.

source: AUTHOR
es: AUTOR
uk: АВТОР

source: Written by David MacKenzie.
es: Escrito por David MacKenzie.
uk: Автором є David MacKenzie.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
uk: ЗВІТИ ПРО ВАДИ

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
uk: Мережева довідка GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
uk: Повідомляйте про будь-які помилки в перекладі на E<lt>https://translationproject.org/team/E<gt>

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2022 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: SEE ALSO
es: VÉASE TAMBIÉN
uk: ДИВ. ТАКОЖ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/dateE<gt>
es: Documentación completa E<lt>https://www.gnu.org/software/coreutils/dateE<gt>
uk: Повна документація: E<lt>https://www.gnu.org/software/coreutils/dateE<gt>

source: or available locally via: info \(aq(coreutils) date invocation\(aq
es: también disponible localemente ejecutando: info \(aq(coreutils) date invocation\(aq
uk: або доступна локально через виклик info \(aq(coreutils) date invocation\(aq

source: September 2020
es: Septiembre de 2020
uk: Вересень 2020 року

source: Display the current time in the given FORMAT, or set the system date.
es: Muestra la fecha y hora actual en el FORMATO indicado o define la del sistema.
uk: Показати поточний час у вказаному ФОРМАТі або встановити системну дату.

source: seconds since 1970-01-01 00:00:00 UTC
es: segundos desde 1970-01-01 00:00:00 UTC
uk: секунди з 1970-01-01 00:00:00 UTC

source: Convert seconds since the epoch (1970-01-01 UTC) to a date
es: convierte los segundos desde el inicio de la época (01-01-1970 UTC) a una fecha
uk: Перетворити кількість секунд від початку епохи (1970-01-01 UTC) на дату

source: Show the time on the west coast of the US (use tzselect(1) to find TZ)
es: muestra la hora en la costa oeste de EEUU (emplea tzselect(1) para averiguar la zona horaria)
uk: Показати час на західному узбережжі США (скористайтеся tzselect(1) для пошуку часового поясу)

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2020 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
uk: Жовтень 2021 року

source: March 2022
uk: Березень 2022 року

source: ENVIRONMENT
es: ENTORNO
uk: СЕРЕДОВИЩЕ

source: Specifies the timezone, unless overridden by command line parameters. If neither is specified, the setting from /etc/localtime is used.
es: Define la zona horaria, salvo que se indique otra expresamente al definir los parámetros. Si no se define de ninguno de los dos modos, se emplea la que aparezca en /etc/localtime.
uk: Вказує часовий пояс, якщо не перевизначено параметрами рядка команди. Якщо значення не вказано, буде використано параметр з /etc/localtime.

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2021 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2021
uk: Вересень 2021 року

source: November 2022
es: Noviembre de 2022

source: September 2022
es: Septiembre de 2022

source: August 2022
es: Agosto de 2022
