Repository: sebras/manpages-l10n
Catalog: po/*/man1/df.1.po
Languages: es, nl, pt_br, sr, uk

source: This manual page documents the GNU version of B<df>. B<df> displays the amount of disk space available on the file system containing each file name argument. If no file name is given, the space available on all currently mounted file systems is shown. Disk space is shown in 1K blocks by default, unless the environment variable POSIXLY_CORRECT is set, in which case 512-byte blocks are used.
es: Esta página de manual documenta la versión GNU de B<df>. B<df> muestra el nivel de uso del sistema de archivos que contiene a cada archivo que se especifica como argumento. Si no se proporciona ningún nombre de archivo, se muestra el nivel de uso del espacio en todos los sistemas de archivos montados. Por defecto, el espacio en disco se muestra en bloques de 1K, a menos que se establezca la variable de entorno POSIXLY_CORRECT, en cuyo caso se hará en bloques de 512 bytes.
nl: Deze handleiding documenteert de GNU versie van B<df>. B<df> toont de hoeveelheid beschikbare schijfruimte op de bestandssystemen aangeduid met het bestandsnaam argument. Als geen bestandsnaam opgegeven werd, wordt de ruimte op alle gekoppelde bestandssystemen getoond. Schijfruimte wordt standaard in blokken van 1K blokken vermeld,, behalve als de omgevingsvariable POSIXLY_CORRECT is gezet, in dat geval worden 512-byte blokken gebruikt,
pt_br: Esta página de manual documenta a versão GNU de B<df>. B<df> exibe a quantidade de espaço em disco disponível no sistema de arquivos contendo cada argumento de nome de arquivo. Se nenhum nome de arquivo for fornecido, o espaço disponível em todos os sistemas de arquivos montados atualmente é mostrado. O espaço em disco é mostrado em blocos de 1K por padrão, a menos que a variável de ambiente POSIXLY_CORRECT seja definida, caso em que blocos de 512 bytes são usados.
uk: Ця сторінка документує B<df> версії GNU. B<df> показує об'єм доступного дискового простору для кожної файлової системи, яка вказана як аргумент. Якщо не вказано назву файла, то буде показано доступний простір для всіх змонтованих у даний час файлових систем. Типово, місце на диску буде показано у блоках по 1 кБ, якщо не вказана змінна середовища POSIXLY_CORRECT, яка використовує блоки по 512 байтів.

source: If an argument is the absolute file name of a disk device node containing a mounted file system, B<df> shows the space available on that file system rather than on the file system containing the device node. This version of B<df> cannot show the space available on unmounted file systems, because on most kinds of systems doing so requires very nonportable intimate knowledge of file system structures.
es: Si un argumento es el nombre de archivo absoluto de un nodo de dispositivo de disco que contiene un sistema de archivos montado, B<df> mostrará el espacio disponible en ese sistema de archivos en lugar de en el sistema de archivos que contiene el nodo de dispositivo. Esta versión de B<df> no puede mostrar el espacio disponible en los sistemas de archivos sin montar, porque sería necesario un profundo conocimiento de la estructura de ese sistema de archivo, algo muy difícil de portar.
nl: Als een argument gelijk is aan de absolute bestandsnaam van een schijf apparaat dat een gekoppeld bestandssysteem bevat, dan toont B<df> de beschikbare ruimte op dat bestandssysteem in plaats van van het bestandssysteem dat het apparaat bevat. Deze versie van B<df> kan niet de ruimte op niet-gekoppelde bestandssystemen tonen, omdat op de meeste systemen dit een niet-overdraagbare en gedetailleerde kennis van de bestandssystemen structuren zou vereisen.
pt_br: Se um argumento for o nome de arquivo absoluto de um nó de dispositivo de disco que contém um sistema de arquivos montado, B<df> mostra o espaço disponível nesse sistema de arquivos em vez do sistema de arquivos que contém o nó de dispositivo. Esta versão do B<df> não pode mostrar o espaço disponível em sistemas de arquivos não montados, porque na maioria dos tipos de sistemas, fazer isso requer um conhecimento íntimo não portável das estruturas do sistema de arquivos.
uk: Якщо аргументом є абсолютна назва файла вузла пристрою диска, що містить змонтовану файлову систему, то B<df> показує доступний простір на цій файловій системі, а не у файловій системі, що містить вузол пристрою. Ця версія B<df> не може показувати доступний простір на демонтованих файлових системах, тому що більшість видів систем вимагають непереносимих інтимних знань про структуру файлової системи.

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2020 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2020 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
nl: Oktober 2021
pt_br: Outubro de 2021
sr: Октобра 2021
uk: Жовтень 2021 року

source: August 2022
es: Agosto de 2022
nl: Augustus 2022
uk: Серпень 2022 року

source: show statistics for a file instead of mount point
es: muestra información sobre un archivo en lugar de hacerlo acerca del punto de montaje
nl: statistieken van een bestand in plaats van aankoppelpunt tonen
pt_br: mostra estatísticas para um arquivo em vez do ponto de montagem
uk: показати статистику для файла замість точки монтування

source: September 2021
pt_br: Setembro de 2021
sr: Септембра 2021
uk: Вересень 2021 року

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2021 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2021 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2022
es: Septiembre de 2022

source: March 2022
pt_br: Março de 2022

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32
