Repository: sebras/manpages-l10n
Catalog: po/*/man1/df.1.po
Languages: es, nl, pt_br, sr, uk

source: April 2022
es: Abril de 2022
pt_br: Abril de 2022
uk: Квітень 2022 року

source: User Commands
es: Órdenes de usuario
nl: Opdrachten voor gebruikers
pt_br: Comandos de usuário
sr: Корисничке наредбе
uk: Команди користувача

source: NAME
es: NOMBRE
nl: NAAM
pt_br: NOME
sr: НАЗИВ
uk: НАЗВА

source: df - report file system space usage
es: df - informa de la utilización del espacio de disco en sistemas de archivo
nl: df - rapporteer schijf ruimte gebruik
uk: df - повідомляє про використання місця у файловій системі

source: SYNOPSIS
es: SINOPSIS
nl: SAMENVATTING
pt_br: SINOPSE
sr: УВОД
uk: КОРОТКИЙ ОПИС

source: B<df> [I<\,OPTION\/>]... [I<\,FILE\/>]...
es: B<df> [I<\,OPCIÓN\/>]... [I<\,FICHERO\/>]...
nl: B<df> [I<\,OPTIE\/>]... [I<\,BESTAND\/>]...
pt_br: B<df> [I<\,OPÇÃO\/>]... [I<\,ARQUIVO\/>]...
sr: B<df> [I<\,ОПЦИЈА\/>]... [I<\,ДАТОТЕКА\/>]...
uk: B<df> [I<\,ПАРАМЕТР\/>]... [I<\,ФАЙЛ\/>]...

source: DESCRIPTION
es: DESCRIPCIÓN
nl: BESCHRIJVING
pt_br: DESCRIÇÃO
sr: ОПИС
uk: ОПИС

source: This manual page documents the GNU version of B<df>. B<df> displays the amount of space available on the file system containing each file name argument. If no file name is given, the space available on all currently mounted file systems is shown. Space is shown in 1K blocks by default, unless the environment variable POSIXLY_CORRECT is set, in which case 512-byte blocks are used.
es: Esta página de manual documenta la versión GNU de B<df>. B<df> muestra el nivel de uso del sistema de archivos que contiene a cada archivo que se especifica como argumento. Si no se proporciona ningún nombre de archivo, se muestra el nivel de uso del espacio en todos los sistemas de archivos montados. Por defecto, el espacio en disco se muestra en bloques de 1K, a menos que se establezca la variable de entorno POSIXLY_CORRECT, en cuyo caso se hará en bloques de 512 bytes.
nl: Deze handleiding documenteert de GNU versie van B<df>. B<df> toont de hoeveelheid beschikbare schijfruimte op de bestandssystemen zoals opgegeven in het bestandsnaam argument. Als geen bestandsnaam opgegeven werd, wordt de ruimte op alle gekoppelde bestandssystemen getoond. Schijfruimte wordt standaard in blokken van 1K blokken vermeld,, behalve als de omgevingsvariable POSIXLY_CORRECT is gezet, in dat geval worden 512-byte blokken gebruikt,
uk: Цю сторінку підручника присвячено B<df> версії GNU. B<df> показує об'єм доступного місця для кожної файлової системи, яка вказана як аргумент. Якщо не вказано назву файла, буде показано доступне місце для всіх поточний змонтованих файлових систем. Типово, місце буде показано у блоках по 1 кБ, якщо не вказана змінна середовища POSIXLY_CORRECT, яка змінює режим показу на режим із одиницями у 512 байтів.

source: If an argument is the absolute file name of a device node containing a mounted file system, B<df> shows the space available on that file system rather than on the file system containing the device node. This version of B<df> cannot show the space available on unmounted file systems, because on most kinds of systems doing so requires very nonportable intimate knowledge of file system structures.
es: Si un argumento es el nombre de archivo absoluto de un nodo de dispositivo que contiene un sistema de archivos montado, B<df> mostrará el espacio disponible en ese sistema de archivos en lugar de en el sistema de archivos que contiene el nodo de dispositivo. Esta versión de B<df> no puede mostrar el espacio disponible en los sistemas de archivos sin montar, porque sería necesario un profundo conocimiento de la estructura de ese sistema de archivo, algo muy difícil de portar.
nl: Als een argument gelijk is aan de absolute bestandsnaam van een schijf apparaat dat een gekoppeld bestandssysteem bevat, dan toont B<df> de beschikbare ruimte op dat bestandssysteem in plaats van van het bestandssysteem dat het apparaat bevat. Deze versie van B<df> kan niet de ruimte op niet-gekoppelde bestandssystemen tonen, omdat dit op de meeste systemen een niet-overdraagbare en gedetailleerde kennis van de bestandssystemen structuren zou vereisen.
uk: Якщо аргументом є абсолютна назва файла вузла пристрою, що містить змонтовану файлову систему, то B<df> показує доступний простір на цій файловій системі, а не в файловій системі, що містить вузол пристрою. Ця версія B<df> не може показувати доступний простір на демонтованих файлових системах, тому що більшість видів систем вимагають непереносимих інтимних знань про структуру файлової системи.

source: OPTIONS
es: OPCIONES
nl: OPTIES
pt_br: OPÇÕES
sr: ОПЦИЈЕ
uk: ПАРАМЕТРИ

source: Show information about the file system on which each FILE resides, or all file systems by default.
es: Muestra información acerca del sistema de archivos en donde se aloja cada archivo o, por defecto, de todos ellos.
nl: Toont gebruikte en beschikbare ruimte van alle aangekoppelde bestandssystemen,of van de bestandssystemen waarop de gegeven BESTANDen zich bevinden.
pt_br: Mostra informações sobre os sistemas de arquivos nos quais cada ARQUIVO reside ou, por padrão, sobre todos os sistemas de arquivos.
sr: Приказује податке о систему датотека на коме се налази свака ДАТОТЕКА, или свих система датотека по основи.
uk: Буде показано відомості щодо файлової системи для кожного вказаного ФАЙЛА або, типово, для усіх файлових систем.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
nl: Een verplicht argument bij een lange optie is ook verplicht voor de korte optie.
pt_br: Argumentos obrigatórios para opções longas também o são para opções curtas.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
uk: Обов'язкові аргументи для довгих параметрів також є обов'язковими для коротких параметрів.

source: include pseudo, duplicate, inaccessible file systems
es: Incluye también duplicados, inaccesibles y pseudo-sistemas de archivo.
nl: ook pseudo-, duplicaat, en ontoegankelijke bestandssystemen tonen
pt_br: inclui pseudo sistemas de arquivos, além de duplicados e inacessíveis
sr: укључује привидне, удвојене, неприступиве системе датотека
uk: враховуючи псевдо-, дублікати та недоступні файлові системи

source: B<-B>, B<--block-size>=I<\,SIZE\/>
es: B<-B>, B<--block-size>=I<\,TAMAÑO\/>
nl: B<-B>, B<--block-size>=I<\,GROOTTE\/>
pt_br: B<-B>, B<--block-size>=I<\,TAM\/>
sr: B<-B>, B<--block-size>=I<\,ВЕЛИЧИНА\/>
uk: B<-B>, B<--block-size>=I<\,РОЗМІР\/>

source: scale sizes by SIZE before printing them; e.g., \&'-BM' prints sizes in units of 1,048,576 bytes; see SIZE format below
es: escale los tamaños por TAMAÑO antes de imprimirlos; por ejemplo, \ & '- BM' imprime tamaños en unidades de 1.048.576 bytes; consulte a continuación el formato TAMAÑO
nl: de te tonen groottes schalen naar deze waarde; \&'-BM' bijvoorbeeld toont de groottes in eenheden van 1.048.576 bytes; zie hieronder voor meer info
pt_br: o tamanho considera blocos de TAM bytes; por exemplo, \&"-BM" emite tamanhos em unidades de 1.048.576 bytes; veja o formato de TAM abaixo
sr: сразмерава величине ВЕЛИЧИНОМ пре него ли их испише; нпр., \&„-BM“ исписује величине у јединицама од 1,048,576 бајта; видите запис ВЕЛИЧИНЕ испод
uk: масштабує розміри згідно вказаного РОЗМІРУ перед виведенням; наприклад, \&'-BM' виводить розміри в одиницях по 1,048,576 байтів; формат РОЗМІРУ дивіться нижче

source: print sizes in powers of 1024 (e.g., 1023M)
es: muestra los tamaños en potencias de 1024 (p.e. 1023M)
nl: groottes in machten van 1024 tonen (bijv. 234M)
pt_br: emite tamanhos na potência de 1024 (p.ex.: 1023M)
sr: исписује величине као степене од 1024 (нпр., 1023M)
uk: виводить розміри в степенях числа 1024 (напр., 1023М)

source: print sizes in powers of 1000 (e.g., 1.1G)
es: muestra los tamaños en potencias de 1000 (p.e. 1.1G)
nl: groottes in machten van 1000 tonen (bijv. 245M)
pt_br: emite tamanhos na potência de 1000 (p.ex.: 1.1G)
sr: исписује величине као степене од 1000 (нпр., 1.1G)
uk: виводить розміри в степенях числа 1000 (напр., 1.1G)

source: list inode information instead of block usage
es: muestra la información de nodos-i en lugar del uso de bloques
nl: inode-informatie tonen in plaats van blokgebruik
pt_br: lista informações do inode, em vez de uso de bloco
sr: исписује податке и-чвора уместо искоришћености блока
uk: виводить інформацію в індексних вузлах замість використання блоків

source: like B<--block-size>=I<\,1K\/>
es: como B<--block-size>=I<\,1K\/>
nl: hetzelfde als B<--block-size>=I<\,1K\/>
pt_br: o mesmo que B<--block-size>=I<\,1K\/>
sr: као B<--block-size>=I<\,1K\/>
uk: like B<--block-size>=I<\,1К\/>

source: limit listing to local file systems
es: limita el listado a los sistemas de ficheros locales
nl: de opsomming beperken tot lokale bestandssystemen
pt_br: limita a listagem a sistemas de arquivos locais
sr: ограничава исписивање на месне системе датотека
uk: обмежити список до локальних файлових систем

source: do not invoke sync before getting usage info (default)
es: no llama a sync antes de obtener el modo de empleo (por defecto)
nl: geen 'sync' doen vóór ophalen van info (standaard)
pt_br: não invoca "sync" ao obter informações de uso (padrão)
sr: не призива усаглашавање пре добављања података искоришћености (основно)
uk: не запускати синхронізацію, поки не буде отримано інформацію про використання (типова поведінка)

source: B<--output>[=I<\,FIELD_LIST\/>]
es: B<--output>[=I<\,LISTA_DE_CAMPOS\/>]
nl: B<--output>[=I<\,VELDENLIJST\/>]
pt_br: B<--output>[=I<\,LISTA_CAMPOS\/>]
sr: B<--output>[=I<\,СПИСАК_ПОЉА\/>]
uk: B<--output>[=I<\,СПИСОК_ПОЛІВ\/>]

source: use the output format defined by FIELD_LIST, or print all fields if FIELD_LIST is omitted.
es: usa el formato de salida definido por LISTA_DE_CAMPOS, o muestra todos los campos si se omite LISTA_DE_CAMPOS.
nl: de gegeven uitvoeropmaak gebruiken, of alle velden tonen als VELDENLIJST ontbreekt
pt_br: usa o formato de saída definido por LISTA_CAMPOS ou exibe todos os campos, se LISTA_CAMPOS for omitido.
sr: користи излазни запис одређен СПИСКОМ_ПОЉА, или исписује сва поља ако је изостављен СПИСАК_ПОЉА.
uk: використовувати формат виведення визначений у СПИСКУ_ПОЛІВ або вивести всі поля, якщо СПИСОК_ПОЛІВ опущено.

source: use the POSIX output format
es: utiliza el formato POSIX para el resultado
nl: de POSIX-uitvoeropmaak gebruiken
pt_br: usa o formato de saída POSIX
sr: користи излазни запис ПОСИКС-а
uk: використовувати формат виведення POSIX

source: invoke sync before getting usage info
es: llama a sync antes de obtener el modo de empleo
nl: een 'sync' doen vóór het ophalen van gebruiksinfo
pt_br: invoca "sync" antes de obter informações de uso
sr: призива усаглашавање пре добављања података искоришћености
uk: виконувати синхронізацію перед отриманням інформації про використання

source: elide all entries insignificant to available space, and produce a grand total
es: omite todas las entradas insignificantes respecto del espacio total disponible y las totaliza
nl: alle items die irrelevant zijn voor de beschikbare ruimte weglaten en een eindtotaal tonen
pt_br: suprime todas as entradas insignificantes para o espaço disponível e produz um total geral
sr: изоставља све уносе безначајне доступном простору, и ствара велики збир
uk: пропустити всі записи, що не впливають на доступне місце і вивести рядок із загальною сумою

source: B<-t>, B<--type>=I<\,TYPE\/>
es: B<-t>, B<--type>=I<\,TIPO\/>
pt_br: B<-t>, B<--type>=I<\,TIPO\/>
sr: B<-t>, B<--type>=I<\,ВРСТА\/>
uk: B<-t>, B<--type>=I<\,ТИП\/>

source: limit listing to file systems of type TYPE
es: restringe el listado a sistemas de ficheros de tipo TIPO
nl: alleen bestandssystemen van dit type tonen
pt_br: limita a listagem a sistemas de arquivo de tipo TIPO
sr: ограничава исписивање на системе датотека врсте ВРСТА
uk: обмежити список до файлових систем із типом ТИП

source: print file system type
es: muestra el tipo del sistema de ficheros
nl: van elk bestandssysteem ook het type tonen
pt_br: emite o tipo de sistema de arquivo
sr: исписује врсту система датотека
uk: показувати типи файлових систем

source: B<-x>, B<--exclude-type>=I<\,TYPE\/>
es: B<-x>, B<--exclude-type>=I<\,TIPO\/>
pt_br: B<-x>, B<--exclude-type>=I<\,TIPO\/>
sr: B<-x>, B<--exclude-type>=I<\,ВРСТА\/>
uk: B<-x>, B<--exclude-type>=I<\,ТИП\/>

source: limit listing to file systems not of type TYPE
es: restringe el listado a los sistemas de ficheros que no son del tipo TIPO
nl: bestandssystemen van dit type niet tonen
pt_br: limita a listagem a sistemas de arquivo que não sejam do tipo TIPO
sr: ограничава исписивање на системе датотека који нису врсте ВРСТА
uk: обмежити список до файлових систем без типу ТИП

source: (ignored)
es: (no tiene efecto)
nl: (genegeerde optie)
pt_br: (ignorado)
sr: (занемарено)
uk: (буде проігноровано)

source: display this help and exit
es: muestra la ayuda y finaliza
nl: toon de helptekst en stop
pt_br: mostra esta ajuda e sai
sr: приказује ову помоћ и излази
uk: відображає довідку і виходить

source: output version information and exit
es: muestra la versión del programa y termina
nl: toon programmaversie en stop
pt_br: informa a versão e sai
sr: исписује податке о издању и излази
uk: виводить інформацію про версію і виходить

source: Display values are in units of the first available SIZE from B<--block-size>, and the DF_BLOCK_SIZE, BLOCK_SIZE and BLOCKSIZE environment variables. Otherwise, units default to 1024 bytes (or 512 if POSIXLY_CORRECT is set).
es: Los valores de visualización están en las mismas unidades del primer TAMAÑO disponible de B<--block-size> y las variables de entorno DF_BLOCK_SIZE, BLOCK_SIZE y BLOCKSIZE. De lo contrario, las unidades tienen un valor predeterminado de 1024 bytes (o 512 si se establece POSIXLY_CORRECT).
nl: Getoonde waarden zijn in eenheden van de eerst beschikbare GROOTTE uit B<--block-size> en de omgevingsvariabelen DF_BLOCK_SIZE, BLOCK_SIZE en BLOCKSIZE. Anders is de eenheid standaard 1024 bytes (of 512 als POSIXLY_CORRECT gezet is).
pt_br: Valores exibidos estão em unidades da primeiro TAM disponível de B<--block-size>, e das variáveis de ambiente DF_BLOCK_SIZE, BLOCK_SIZE e BLOCKSIZE. Do contrário, as unidades são definidas com 1024 bytes (ou 512 se POSIXLY_CORRECT estiver definido).
sr: Приказане вредности у јединицама прве доступне ВЕЛИЧИНЕ из B<--block-size>, и „DF_BLOCK_SIZE“, „BLOCK_SIZE“ и „BLOCKSIZE“ променљиве окружења. У супротном, јединице прелазе на 1024 бајта (или 512 ако је подешено „POSIXLY_CORRECT“).
uk: Значення показуються в одиницях першого доступного РОЗМІРУ, що вказаний у B<--block-size> чи змінних середовища DF_BLOCK_SIZE, BLOCK_SIZE і BLOCKSIZE. В іншому випадку, типово, одиниця дорівнює 1024 байтам (або 512 байтам, якщо вказано POSIXLY_CORRECT).

source: The SIZE argument is an integer and optional unit (example: 10K is 10*1024). Units are K,M,G,T,P,E,Z,Y (powers of 1024) or KB,MB,... (powers of 1000). Binary prefixes can be used, too: KiB=K, MiB=M, and so on.
es: El argumento TAMAÑO es un entero y una unidad opcional (ejemplo: 10K es 10 * 1024). Las unidades son K, M, G, T, P, E, Z, Y (potencias de 1024) o KB, MB, ... (potencias de 1000). También se pueden usar prefijos binarios: KiB = K, MiB = M, etc.
nl: GROOTTE is een geheel getal met een optionele eenheid (bijv. 10K is 10*1024). Mogelijke eenheden zijn: K, M, G, T, P, E, Z, Y (machten van 1024) of KB, MB, ... (machten van 1000). Binaire prefixen mogen ook gebruikt worden: KiB=K, MiB=M, etc.
pt_br: O argumento TAM é uma unidade opcional e inteiro (exemplo: 10K é 10*1024). As unidades são K,M,G,T,P,E,Z,Y (vezes 1024) ou KB,MB,... (vezes 1000). Prefixos binários também podem ser usados: KiB=K, MiB=M e assim por diante.
sr: Аргумент ВЕЛИЧИНА је цео број и изборна јединица (пример: 10K је 10*1024). Јединице су K,M,G,T,P,E,Z,Y (степени од 1024) или KB,MB,... (степени од 1000). Бинарни префикси се могу користити, такође: KiB=K, MiB=M, и тако редом.
uk: Аргумент РОЗМІР є цілим числом із необов'язковою одиницею (наприклад: 10К дорівнює 10*1024). Одиниці можуть бути K,M,G,T,P,E,Z,Y (степені числа 1024) або KB,MB,... (степені числа 1000). Двійкові префікси також можна використовувати, як-от KiB=K, MiB=M і так далі.

source: FIELD_LIST is a comma-separated list of columns to be included. Valid field names are: 'source', 'fstype', 'itotal', 'iused', 'iavail', 'ipcent', \&'size', 'used', 'avail', 'pcent', 'file' and 'target' (see info page).
es: LISTA_DE_CAMPOS es una lista separada por comas de columnas que se incluirán. Los nombres de campos válidos son: 'source', 'fstype', 'itotal', 'iused', 'iavail', 'ipcent', 'size', 'used', 'avail', 'pcent', 'file' y 'target' (véase la página info).
nl: VELDENLIJST is een komma gescheiden lijst van te tonen kolommen. Geldige veldnamen zijn: 'source', 'fstype', 'itotal', 'iused', 'iavail', 'ipcent', \&'size', 'used', 'avail', 'pcent', 'file' en 'target' (zie de Info-pagina).
pt_br: LISTA_CAMPOS é uma lista separada por vírgula de colunas a serem incluídas. Nomes válidos de campos são: "source", "fstype", "itotal", "iused", "iavail", "ipcent", \&"size", "used", "avail", "pcent", "file" e "target" (veja a página info).
sr: СПИСАК_ПОЉА је зарезом раздвојени списак стубаца који ће бити укључени. Исправни називи поља су: „source“, „fstype“, „itotal“, „iused“, „iavail“, „ipcent“, „size“, „used“, „avail“, „pcent“, „file“ и „target“ (погледајте страницу података).
uk: СПИСОК_ПОЛІВ це розділений комами список стовпців, які будуть виведені. Правильними назвами полів є 'source', 'fstype', 'itotal', 'iused', 'iavail', 'ipcent', \&'size', 'used', 'avail', 'pcent', 'file' і 'target' (дивіться сторінку info).

source: AUTHOR
es: AUTOR
nl: AUTEUR
pt_br: AUTOR
sr: АУТОР
uk: АВТОР

source: Written by Torbjorn Granlund, David MacKenzie, and Paul Eggert.
es: Escrito por Torbjorn Granlund, David MacKenzie y Paul Eggert.
nl: Geschreven door Torbjorn Granlund, David MacKenzie en Paul Eggert.
pt_br: Escrito por Torbjorn Granlund, David MacKenzie e Paul Eggert.
sr: Написали су Торбјорн Гранлунд, Дејвид Мек Кензи и Пол Егерт.
uk: Авторами є Torbjorn Granlund, David MacKenzie і Paul Eggert.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
nl: RAPPORTEREN VAN BUGS
pt_br: RELATANDO PROBLEMAS
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
uk: ЗВІТИ ПРО ВАДИ

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Online hulp bij GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
pt_br: Página de ajuda do GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
uk: Мережева довідка GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
nl: Meld alle vertaalfouten op E<lt>https://translationproject.org/team/nl.htmlE<gt>
pt_br: Relate erros de tradução para E<lt>https://translationproject.org/team/pt_BR.htmlE<gt>.
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
uk: Повідомляйте про будь-які помилки в перекладі на E<lt>https://translationproject.org/team/E<gt>

source: COPYRIGHT
pt_br: DIREITOS AUTORAIS
sr: АУТОРСКА ПРАВА
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2022 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2022 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
pt_br: Este é um software livre: você é livre para alterá-lo e redistribuí-lo. NÃO HÁ QUALQUER GARANTIA, na máxima extensão permitida em lei.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: SEE ALSO
es: VÉASE TAMBIÉN
nl: ZIE OOK
pt_br: VEJA TAMBÉM
sr: ВИДИТЕ ТАКОЂЕ
uk: ДИВ. ТАКОЖ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/dfE<gt>
es: Ayuda en línea: E<lt>https://www.gnu.org/software/coreutils/dfE<gt>
nl: Volledige documentatie op: E<lt>https://www.gnu.org/software/coreutils/dfE<gt>
pt_br: Documentação completa E<lt>https://www.gnu.org/software/coreutils/dfE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/dfE<gt>
uk: Повна документація E<lt>https://www.gnu.org/software/coreutils/dfE<gt>

source: or available locally via: info \(aq(coreutils) df invocation\(aq
es: también disponible en modo local ejecutando: info \(aq(coreutils) df invocation\(aq
nl: of lokaal via: info \(aq(coreutils) df invocation\(aq
pt_br: ou disponível localmente via: info \(aq(coreutils) df invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) df invocation\(aq“
uk: або доступна локально через: info \(aq(coreutils) df invocation\(aq

source: September 2020
es: Septiembre de 2020
pt_br: Setembro de 2020
sr: Септембра 2020
uk: Вересень 2020 року

source: df - report file system disk space usage
es: df - informa de la utilización del espacio de disco en sistemas de ficheros
nl: df - rapporteer schijf ruimte gebruik
pt_br: df - relata o espaço de disco usado pelo sistema de arquivo
uk: df - звіт щодо використання файловою системою місця на диску
