Repository: sebras/manpages-l10n
Catalog: po/*/man1/diff.1.po
Languages: es, hu, nl, sr, sv, uk

source: LETTERs are as follows for new group, lower case for old group:
es: Las LETRAs pueden ser como siguen para grupos nuevos (en minúsculas para grupos antiguos):
hu: A BETŰK a következők lehetnek az új csoporthoz, kisbetűsek a régi csoporthoz:
nl: LETTERs zijn als volgt voor nieuwe groep, kleine letter voor oude groep:
sr: СЛОВО за нову групу, мала слова за стару групу:
sv: BOKSTÄVER är enligt följande för ny grupp, gemen för gammal grupp:
uk: ЛІТЕРА має наступні значення для нових груп, маленькі для старих:

source: first line number
es: número de la primera línea
hu: első sor száma
nl: eerste regelnummer
sr: број првог реда
sv: första radnumret
uk: номер першого рядка

source: last line number
es: número de la última línea
hu: utolsó sor száma
nl: laatste regelnummer
sr: број последњег реда
sv: sista radnumret
uk: номер останнього рядка

source: number of lines = L-F+1
es: número de líneas = L-F+1
hu: sorok száma = L-F+1
nl: het aantal regels (L-F+1)
sr: број редова = L-F+1
sv: antal rader = L-F+1
uk: кількість рядків = L-F+1

source: if A equals B then T else E
es: si A es igual a B entonces T en caso contrario E
hu: ha A egyenlő B, akkor T, egyébként E
nl: als A gelijk is aan B, dan Z anders V
sr: ако је А исто као Б онда Т супротно Е
sv: om A är lika med B då T annars E
uk: якщо A дорівнює B, T, інакше E

source: LFMT (only) may contain:
es: LFMT (solamente) puede contener:
hu: Az LFMT (csak) a következőket tartalmazhatja:
nl: LOPMAAK mag bevatten:
sr: РОБЛ (само) може садржати:
sv: RFMT (endast) kan innehålla:
uk: СФМТ може містити:

source: contents of line
es: contenido de la línea
hu: a sor tartalma
nl: inhoud van regel
sr: садржај реда
sv: radinnehåll
uk: вміст рядка

source: contents of line, excluding any trailing newline
es: contenido de la línea, excluyendo caracteres de nueva línea finales
hu: a sor tartalma, kivéve bármilyen záró üres karaktert
nl: inhoud van regel, behalve eventuele witregel aan einde
sr: садржај реда, изузев пратећих знакова за нови ред
sv: radinnehåll exklusive avslutande nyrad
uk: вміст рядка без символу нового рядка наприкінці

source: %[-][WIDTH][.[PREC]]{doxX}n
es: %[-][ANCHO][.[PRECISIÓN]]{doxX}n
hu: %[-][SZÉLESSÉG][.[PONTOSSÁG]]{doxX}n
nl: %[-][BREEDTE][.[PREC]]{doxX}n
sr: %[-][ШИРН][.[ТАЧН]]{doxX}n
sv: %[-][BREDD][.[PREC]]{doxX}n
uk: %[-][ШИРИНА][.[ТОЧН]]{doxX}n

source: printf-style spec for input line number
es: especificación en estilo printf para el número de línea de entrada
hu: printf-stílusú megadás a bemeneti
nl: specificatie in printf-stijl voor invoerregelnummer
sr: printf-стил за улазни број реда
sv: printf-stil spec. för inradnummer
uk: формат номеру вхідного рядка у стилі B<printf>(1)

source: Both GFMT and LFMT may contain:
es: Tanto GFMT como LFMT pueden contener:
hu: A GFMT és az LFMT is tartalmazhatja:
nl: GOPMAAK en LOPMAAK mogen bevatten:
sr: Било ГОБЛ или РОБЛ могу садржати:
sv: Både GFMT och RFMT kan innehålla:
uk: Обидва ГФМТ та СФМТ можуть містити:

source: the single character C
es: el carácter C
hu: az önálló C karakter
nl: het enkele teken C
sr: само један знак „З“
sv: det ensamma tecknet C
uk: один символ С

source: the character with octal code OOO
es: el carácter con código octal OOO
hu: a OOO oktális kódú karakter
nl: het teken met octaalcode OOO
sr: знак са окталним кодом OOO
sv: tecknet med oktalkod OOO
uk: один символ з вісімковим кодом OOO

source: C
sr: З

source: the character C (other characters represent themselves)
es: el carácter C (los otros caracteres se representan a sí mismos)
hu: a C karakter (más karakterek saját magukat ábrázolják)
nl: het teken C (andere tekens representeren zichzelf)
sr: знак З (други знаци представљају сами себе)
sv: tecknet C (övriga tecken representerar sig själva)
uk: символ C (інші символи не оброблятимуться)

source: try hard to find a smaller set of changes
es: se esfuerza en encontrar un grupo de cambios menor
hu: igyekszik egy kisebb változási halmazt megtalálni
nl: moeite doen om een kleinere verzameling wijzigingen te vinden
sr: труди се да нађе мањи скуп промена
sv: Arbeta hårt för att hitta en mindre mängd av ändringar.
uk: намагатись знайти найменший набір змін

source: B<--horizon-lines>=I<NUM>
es: B<--horizon-lines>=I<NÚM>
hu: B<--horizon-lines>=I<SZÁM>
nl: B<--horizon-lines>=I<AANTAL>
sr: B<--horizon-lines>=I<БРЈ>
sv: B<--horizon-lines>=I<ANT>
uk: B<--horizon-lines>=I<ЧИСЛО>

source: keep NUM lines of the common prefix and suffix
es: mantiene NÚM líneas de prefijos y sufijos comunes
hu: a közös előtag és utótag SZÁM sorának megtartása
nl: dit AANTAL regels met identieke kop en staart bij vergelijkingsproces meenemen
sr: чува БРЈ редова заједничког префикса и суфикса
sv: Spara ANT rader av gemensamt prefix och suffix.
uk: зберегти ЧИСЛО спільних рядків, до та після різних

source: assume large files and many scattered small changes
es: supone que los ficheros son grandes y los cambios son numerosos, pequeños y dispersos
hu: nagy fájlokat és sok apró kis változást tételez fel
nl: aannemen dat bestanden groot zijn met veel verspreide kleine wijzigingen
sr: за велике датотеке са много раштрканих малих измена
sv: Antag stora filer och små spridda ändringar.
uk: вважати файли великими з багатьма розкиданими дрібними змінами.

source: B<--color>[=I<WHEN>]
es: B<--color>[=I<CASO>]
hu: B<--color>[=I<MIKOR>]
nl: B<--color>[=I<WANNEER>]
sr: B<--color>[=I<КАДА>]
sv: B<--color>[=I<NÄR>]
uk: B<--color>[=I<КОЛИ>]

source: color output; WHEN is 'never', 'always', or 'auto'; plain B<--color> means B<--color=>'auto'
es: colorea la salida; la variable CASO puede ser 'never' (nunca), 'always' (siempre) o 'auto' (por defecto). 'plain' es sinónimo de B<--color=>'auto'
nl: de uitvoer kleuren; WANNEER is 'always' (altijd), 'never' (nooit), of 'auto'; standaard B<--color> betekent B<--color=>'auto'
sr: обојава излаз; КАДА може бити „never“ (никада), „always“ (увек), или „auto“ (подразумевано); обична B<--color> значи B<--color=>'auto'
sv: Färgad utdata; NÄR kan vara ”never”, ”always” eller ”auto”; bara B<--color> betyder B<--color>='auto'.
uk: розфарбовувати виведення; значенням КОЛИ може бути 'never', 'always', або 'auto'; просто B<--color> означає B<--color>='auto'

source: B<--palette>=I<PALETTE>
es: B<--palette>=I<PALETA>
hu: B<--palette>=I<PALETTA>
nl: B<--palette>=I<PALET>
sr: B<--palette>=I<ПАЛЕТА>
sv: B<--palette>=I<PALETT>
uk: B<--palette>=I<ПАЛІТРА>

source: the colors to use when B<--color> is active; PALETTE is a colon-separated list of terminfo capabilities
es: indica lo colores a usar cuando se indica la opción B<--color>; PALETA consiste en una lista de capacidades de terminfo
hu: a használandó szín, amikor a B<--color> meg van adva; a PALETTA a terminfo képességek kettősponttal elválasztott listája
nl: te gebruiken kleuren bij B<--color>; PALET is een lijst van terminfo-capabilities gescheiden door dubbelepunten
sr: боје за коришћење када је B<--color> активно; ПАЛЕТА је списак могућности података термина раздвојен двотачком
sv: Färgerna att använda när B<--color> är aktivt; PALETT är en kolonseparerad lista av terminfoförmågor.
uk: кольори, які слід використовувати, якщо додано B<--color>; ПАЛІТРА — відокремлений двокрапками список можливостей B<terminfo>(5)

source: display this help and exit
es: muestra la ayuda y finaliza
hu: ezen súgó megjelenítése és kilépés
nl: toon de helptekst en stop
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.
uk: відображає довідку і виходить

source: output version information and exit
es: muestra la versión del programa y finaliza
hu: verzióinformációk megjelenítése és kilépés
nl: toon programmaversie en stop
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.
uk: виводить інформацію про версію і виходить

source: FILES are 'FILE1 FILE2' or 'DIR1 DIR2' or 'DIR FILE' or 'FILE DIR'. If B<--from-file> or B<--to-file> is given, there are no restrictions on FILE(s). If a FILE is '-', read standard input. Exit status is 0 if inputs are the same, 1 if different, 2 if trouble.
es: FICHEROS puede ser 'FICHERO1 FICHERO2' o 'DIRECTORIO1 DIRECTORIO2' o 'DIRECTORIO FICHERO' o 'FICHERO DIRECTORIO'. Si se da B<--from-file> o B<--to-file>, no hay restricciones en FICHERO(s). Si un FICHERO es '-', lee la entrada estándar. El estado de salida es 0 si las entradas son iguales, 1 si son diferentes, 2 en caso de problema.
hu: A FÁJLOK az alábbiak lehetnek „FÁJL1 FÁJL2” vagy „KÖNYVTÁR1 KÖNYVTÁR2” vagy „KÖNYVTÁR FÁJL” vagy „FÁJL KÖNYVTÁR”. Ha a B<--from-file> vagy a B<--to-file> meg van adva, akkor nincsenek megszorítások a FÁJLOKRA. Ha a FÁJL a „-”, akkor a szabványos bemenetről olvas. A kilépési állapotkód 0, ha a bemenetek azonosak; 1, ha különbözők; 2, ha hiba történt.
nl: BESTANDEN is 'BESTAND1 BESTAND2' of 'MAP1 MAP2' of 'MAP BESTAND...' of 'BESTAND... MAP'. Als B<--from-file> of B<--to-file> gegeven is, mag BESTANDEN van alles zijn. Als een BESTAND '-' is, wordt er van standaardinvoer gelezen.
sr: ДАТОТЕКЕ су „ТЕКА1 ТЕКА2“ или „ДИР1 ДИР2“ или „ДИР ТЕКА“ или „ТЕКА ДИР“. Нема ограничења за ДАТОТЕКЕ ако је задато B<--from-file> или B<--to-file>. Ако је ДАТОТЕКА „-“, чита стандардни улаз. Излазно стање је 0 ако су улази исти, 1 за различите, 2 за грешку.
sv: FILER är ”FIL1 FIL2” eller ”KAT1 KAT2” eller ”KAT FIL” eller ”FIL KAT”. Om B<--from-file> eller B<--to-file> är angivet finns det inga begränsningar på FILER. Om en FIL är ”-”, läs standard in. Slutsstatus är 0 om indata är lika, 1 om olika, 2 vid problem.
uk: ФАЙЛИ — це «ФАЙЛ1 ФАЙЛ2», чи «КАТАЛОГ1 КАТАЛОГ2», чи «КАТАЛОГ ФАЙЛ», чи «ФАЙЛ КАТАЛОГ». Якщо вказано B<--from-file> чи B<--to-file>, на ФАЙЛИ обмежень немає. Якщо ФАЙЛ вказано як «-», дані буде прочитано зі стандартного потоку введення. Код завершення дорівнює 0, якщо вхідні файли ідентичні, 1 -- якщо відрізняються, та 2 при виникненні помилок.

source: AUTHOR
es: AUTOR
hu: SZERZŐ
nl: AUTEUR
sr: АУТОР
sv: UPPHOVSMAN
uk: АВТОР

source: Written by Paul Eggert, Mike Haertel, David Hayes, Richard Stallman, and Len Tower.
es: Escrito por Paul Eggert, Mike Haertel, David Hayes, Richard Stallman y Len Tower.
hu: Írta: Paul Eggert, Mike Haertel, David Hayes, Richard Stallman és Len Tower.
nl: Geschreven door Paul Eggert, Mike Haertel, David Hayes, Richard Stallman en Len Tower.
sr: Написали су Пол Егерт, Мајк Хартел, Дејвид Хејес, Ричард Столман и Лен Тауер.
sv: Skrivet av Paul Eggert, Mike Haertel, David Hayes, Richard Stallman och Len Tower.
uk: Автори програми -- Paul Eggert, Mike Haertel, David Hayes, Richard Stallman та Len Tower.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
hu: HIBÁK JELENTÉSE
nl: RAPPORTEREN VAN BUGS
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL
uk: ЗВІТИ ПРО ВАДИ

source: Report bugs to: bug-diffutils@gnu.org
es: Comunicar errores en el programa a: bug-diffutils@gnu.org
hu: A hibák a(z) bug-diffutils@gnu.org címen jelenthetők.
nl: Rapporteer gebreken in het programma aan bug-diffutils@gnu.org; meld fouten in de vertaling aan E<lt>vertaling@vrijschrift.orgE<gt>.
sr: Грешке пријавите на: bug-diffutils@gnu.org
sv: Rapportera fel till: E<lt>bug-diffutils@gnu.orgE<gt>; rapportera synpunkter på översättningen till: E<lt>tp-sv@listor.tp-sv.seE<gt>.
uk: Повідомляйте про вади на адресу: E<lt>bug-diffutils@gnu.orgE<gt>

source: GNU diffutils home page: E<lt>https://www.gnu.org/software/diffutils/E<gt>
es: GNU diffutils página inicial: E<lt>https://www.gnu.org/software/diffutils/E<gt>
hu: A(z) GNU diffutils honlapja: E<lt>https://www.gnu.org/software/diffutils/E<gt>
nl: Webpagina van GNU diffutils: E<lt>http://www.gnu.org/software/diffutils/E<gt>
sr: GNU diffutils матична страница: E<lt>https://www.gnu.org/software/diffutils/E<gt>
sv: GNU diffutils hemsida: E<lt>https://www.gnu.org/software/diffutils/E<gt>
uk: Домашня сторінка GNU diffutils: E<lt>https://www.gnu.org/software/diffutils/E<gt>

source: General help using GNU software: E<lt>https://www.gnu.org/gethelp/E<gt>
es: Ayuda general sobre el uso de software de GNU: E<lt>https://www.gnu.org/gethelp/E<gt>
hu: Általános segítség a GNU szoftverek használatához: E<lt>https://www.gnu.org/gethelp/E<gt>
nl: Algemene hulp bij gebruik van GNU-software: E<lt>https://www.gnu.org/gethelp/E<gt>
sr: Општа помоћ за коришћење ГНУ софтвера: E<lt>https://www.gnu.org/gethelp/E<gt>
sv: Allmän hjälp med att använda GNU-program: E<lt>https://www.gnu.org/gethelp/E<gt>
uk: Загальна довідкова інформація щодо використання програмного забезпечення GNU: E<lt>https://www.gnu.org/gethelp/E<gt>

source: COPYRIGHT
hu: SZERZŐI JOG
sr: АУТОРСКА ПРАВА
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2021 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: SEE ALSO
es: VÉASE TAMBIÉN
hu: LÁSD MÉG
nl: ZIE OOK
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ
uk: ДИВ. ТАКОЖ

source: The full documentation for B<diff> is maintained as a Texinfo manual. If the B<info> and B<diff> programs are properly installed at your site, the command
es: La documentación completa de B<diff> está en formato Texinfo. Si B<info> y B<diff> están bien instalados en su equipo, la orden
nl: De volledige documentatie voor B<diff> wordt bijgehouden als een Texinfo-handleiding. Als de programma´s B<info> en B<diff> correct op uw systeem zijn geïnstalleerd, geeft de opdracht
sr: Потпуна документација за B<diff> је одржавана као Тексинфо упутство. Ако су B<info> и B<diff> исправно инсталирани на вашем сајту, наредба
sv: Den fullständiga dokumentationen för B<diff> underhålls som en Texinfo-manual. Om programmen B<info> och B<diff> är ordentligt installerade på ditt system, bör kommandot
uk: Повноцінну документацію з B<diff> можна знайти у довіднику Texinfo. Якщо у вашій системі встановлено B<info>(1) та B<diff> за допомогою команди

source: should give you access to the complete manual.
es: debería acceder al manual completo.
nl: toegang tot de volledige handleiding.
sr: треба да вам да приступ потпуном упутству.
sv: ge dig tillgång till den kompletta manualen.
uk: ви зможете отримати доступ до повноцінного підручника.

source: GNU
nl: DIFF
sr: DIFF
sv: DIFF
uk: DIFF

source: December 2018
es: Diciembre 2018
hu: 2018. december
sr: Децембра 2018
uk: грудень 2018 року

source: GNU diff - compare files line by line
es: GNU diff - compara archivos línea por línea
hu: GNU diff - fájlok összehasonlítása sorról sorra
nl: GNU diff - zoek verschillen tussen twee bestanden
sr: ГНУ diff - поредите датотеке ред по ред
sv: GNU diff - jämför filer rad för rad
uk: GNU diff - порівняння файлів за рядками

source: colorize the output; WHEN can be 'never', 'always', or 'auto' (the default)
es: colorea la salida; la variable CASO puede ser 'never' (nunca), 'always' (siempre) o 'auto' (por defecto)
nl: de uitvoer kleuren; WANNEER is 'always' (altijd), 'never' (nooit), of 'auto' (standaard)
sr: обојава излаз; КАДА може бити „never“ (никада), „always“ (увек), или „auto“ (подразумевано; основно)
sv: Färgad utdata; NÄR kan vara ”never”, ”always” eller ”auto” (standard).
uk: розфарбовувати виведене; значенням КОЛИ може бути «never» (ніколи), «always» (завжди) або «auto» (авто, типовий варіант)

source: Copyright \(co 2018 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2018 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2018 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2018 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2018 Free Software Foundation, Inc. Дозвола ОЈЛв3+: Гнуова ОЈЛ издање 3 или новије E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2018 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: \(co Free Software Foundation, Inc., 2018. Умови ліцензування GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: The full documentation for B<GNU> is maintained as a Texinfo manual. If the B<info> and B<GNU> programs are properly installed at your site, the command
es: La documentación completa de B<diff> está en formato Texinfo. Si B<info> y B<diff> están bien instalados en su equipo, la orden
nl: De volledige documentatie voor B<diff> wordt bijgehouden als een Texinfo-handleiding. Als de programma´s B<info> en B<diff> correct op uw systeem zijn geïnstalleerd, geeft de opdracht
sr: Потпуна документација за B<diff> је одржавана као Тексинфо упутство. Ако су B<info> и B<diff> исправно инсталирани на вашем сајту, наредба
sv: Den fullständiga dokumentationen för B<diff> underhålls som en Texinfo-manual. Om programmen B<info> och B<diff> är ordentligt installerade på ditt system, bör kommandot
uk: Повноцінну документацію з B<diff> можна знайти у довіднику Texinfo. Якщо у вашій системі встановлено B<info>(1) та B<diff> за допомогою команди

source: B<info GNU>
es: B<info DIFF>
nl: B<info diff>
sr: B<info diff>
sv: B<info diff>
uk: B<info diff>

source: January 2022
hu: 2020 január
nl: Januari 2022
sr: Jануара 2022
sv: januari 2022

source: GNU diffutils home page: E<lt>http://www.gnu.org/software/diffutils/E<gt>
es: GNU diffutils página inicial: E<lt>http://www.gnu.org/software/diffutils/E<gt>
hu: A(z) GNU diffutils honlapja: E<lt>http://www.gnu.org/software/diffutils/E<gt>
nl: Webpagina van GNU diffutils: E<lt>http://www.gnu.org/software/diffutils/E<gt>
sr: GNU diffutils матична страница: E<lt>http://www.gnu.org/software/diffutils/E<gt>
sv: GNU diffutils hemsida: E<lt>https://www.gnu.org/software/diffutils/E<gt>
uk: Домашня сторінка GNU diffutils: E<lt>https://www.gnu.org/software/diffutils/E<gt>

source: General help using GNU software: E<lt>http://www.gnu.org/gethelp/E<gt>
es: Ayuda general sobre el uso de software de GNU: E<lt>https://www.gnu.org/gethelp/E<gt>
hu: Általános segítség a GNU szoftverek használatához: E<lt>http://www.gnu.org/gethelp/E<gt>
nl: Algemene hulp bij gebruik van GNU-software: E<lt>https://www.gnu.org/gethelp/E<gt>
sr: Општа помоћ користећи ГНУ софтвер: E<lt>http://www.gnu.org/gethelp/E<gt>
uk: Загальна довідкова інформація щодо використання програмного забезпечення GNU: E<lt>https://www.gnu.org/gethelp/E<gt>

source: wdiff(1), cmp(1), diff3(1), sdiff(1), patch(1)
hu: B<wdiff>(1), B<cmp>(1), B<diff3>(1), B<sdiff>(1), B<patch>(1)
sv: B<wdiff>(1), B<cmp>(1), B<diff3>(1), B<sdiff>(1), B<patch>(1)
uk: B<wdiff>(1), B<cmp>(1), B<diff3>(1), B<sdiff>(1), B<patch>(1)

source: July 2022
es: Julio de 2020
nl: Juli 2022
uk: липень 2022 року

source: May 2017
es: Mayo de 2017
hu: 2017 május
nl: Mei 2017
uk: травень 2017 року

source: Copyright \(co 2017 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2017 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2017 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2018 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: \(co Free Software Foundation, Inc., 2017. Умови ліцензування GPLv3+: GNU GPL версії 3 або пізнішої E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.

source: %(A=B?T:E)
nl: %(A=B?Z:V)
