Repository: sebras/manpages-l10n
Catalog: po/*/man1/diff.1.po
Languages: es, hu, nl, sr, sv, uk

source: August 2021
es: Agosto de 2021
hu: 2021. augusztus
nl: Augustus 2021
sr: Августа 2021
sv: augusti 2021
uk: Серпень 2021 року

source: User Commands
es: Órdenes de usuario
hu: Felhasználói parancsok
nl: Opdrachten voor gebruikers
sr: Корисничке наредбе
sv: Användarkommandon
uk: Команди користувача

source: NAME
es: NOMBRE
hu: NÉV
nl: NAAM
sr: НАЗИВ
sv: NAMN
uk: НАЗВА

source: diff - compare files line by line
es: diff - compara archivo línea por línea
hu: diff - fájlok összehasonlítása sorról sorra
nl: diff - vergelijk bestanden regel voor regel
sr: diff - поредите датотеке ред по ред
sv: diff - jämför filer rad för rad
uk: diff - порівняння файлів за рядками

source: SYNOPSIS
es: SINOPSIS
hu: ÖSSZEGZÉS
nl: SAMENVATTING
sr: УВОД
uk: КОРОТКИЙ ОПИС

source: B<diff> [I<OPTION>]... I<FILES>
es: B<diff> [I<OPCIÓN>]... I<ARCHIVOS>
hu: B<diff> [I<KAPCSOLÓ>]... I<FÁJLOK>
nl: B<diff> [I<OPTIE>]... I<BESTANDEN>
sr: B<diff> [I<ОПЦИЈА>]... I<ДАТОТЕКЕ>
sv: B<diff> [I<FLAGGA>]... I<FILER>
uk: B<diff> [I<КЛЮЧ>]... I<ФАЙЛИ>

source: DESCRIPTION
es: DESCRIPCIÓN
hu: LEÍRÁS
nl: BESCHRIJVING
sr: ОПИС
sv: BESKRIVNING
uk: ОПИС

source: Compare FILES line by line.
es: Compara ARCHIVOS línea por línea.
hu: FÁJLOK összehasonlítása sorról sorra.
nl: Bestanden regel-voor-regel vergelijken.
sr: Поредите ДАТОТЕКЕ ред по ред.
sv: Jämför FILER rad för rad.
uk: Порівнює два файли за рядками.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők.
nl: Een verplicht argument bij een lange optie is ook verplicht voor de korte optie.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.
uk: Обов'язкові аргументи для довгих параметрів також є обов'язковими для коротких параметрів.

source: output a normal diff (the default)
es: produce un diff normal (predeterminado)
hu: egy normál diff kimenet (az alapértelmezett)
nl: een gewone diff produceren (standaard)
sr: исписује обичне разлике (основно)
sv: Skriv ut en normal diff (standard).
uk: вивести дані у форматі звичайного diff (типово)

source: report only when files differ
es: indica solo si los archivos difieren
hu: csak akkor jelent, ha a fájlok eltérnek
nl: alleen aangeven of bestanden verschillen
sr: исписује само када се датотеке разликују
sv: Rapportera endast när filer skiljer sig.
uk: сповіщати лише про різні файли

source: report when two files are the same
es: notifica cuándo dos archivos son idénticos
hu: jelentés, ha a két fájl ugyanaz
nl: vermelden of twee bestanden hetzelfde zijn
sr: извештава када су две датотеке исте
sv: Rapportera om två filer är lika.
uk: сповіщати про однакові файли

source: B<-c>, B<-C> NUM, B<--context>[=I<NUM>]
es: B<-c>, B<-C> NÚM, B<--context>[=I<NÚM>]
hu: B<-c>, B<-C> SZÁM, B<--context>[=I<SZÁM>]
nl: B<-c>, B<-C> AANTAL, B<--context>[=I<AANTAL>]
sr: B<-c>, B<-C> БРОЈ, B<--context>[=I<БРОЈ>]
sv: B<-c>, B<-C> ANT, B<--context>[=I<ANT>]
uk: B<-c>, B<-C> КТЬ, B<--context>[=I<КТЬ>]

source: output NUM (default 3) lines of copied context
es: muestra NÚM (por omisión 3) líneas de contexto
hu: a másolt környezet SZÁM (alapértelmezetten 3) sorának kiírása
nl: dit AANTAL regels (standaard 3) van gekopieerde context tonen
sr: исписује БРОЈ (почетно 3) редова умноженог склопа
sv: Skriv ANT (3 som standard) rader kopia av sammanhang.
uk: вивести КТЬ (типово 3) рядки скопійованого контексту

source: B<-u>, B<-U> NUM, B<--unified>[=I<NUM>]
es: B<-u>, B<-U> NÚM, B<--unified>[=I<NÚM>]
hu: B<-u>, B<-U> SZÁM, B<--unified>[=I<SZÁM>]
nl: B<-u>, B<-U> AANTAL, B<--unified>[=I<AANTAL>]
sr: B<-u>, B<-U> БРОЈ, B<--unified>[=I<БРОЈ>]
sv: B<-u>, B<-U> ANT, B<--unified>[=I<ANT>]
uk: B<-u>, B<-U> ЧИСЛО, B<--unified>[=I<ЧИСЛО>]

source: output NUM (default 3) lines of unified context
es: muestra NÚM (por omisión 3) línea de contexto unificado
hu: a egységesített környezet SZÁM (alapértelmezetten 3) sorának kiírása
nl: dit AANTAL regels (standaard 3) van geünificeerde context tonen
sr: исписује БРОЈ (почетно 3) редова обједињеног склопа
sv: Skriv ut ANT (3 som standard) rader med sammanslagen omgivning.
uk: вивести ЧИСЛО (типово 3) рядків спільного контексту

source: output an ed script
es: produce un script ed
hu: egy ed parancsfájl kiírása
nl: een ed-script produceren
sr: исписује ед спис
sv: Skriv ut ett B<ed>(1)-skript.
uk: вивести дані у форматі запису B<ed>(1)

source: output an RCS format diff
es: produce un diff en formato RCS
hu: egy RCS formátumú diff kiírása
nl: een diff in RCS-opmaak produceren
sr: исписује РЦС запис разлика
sv: Skriv ut skillnader i RCS-format.
uk: виводити у форматі diff систем керування версіями

source: output in two columns
es: muestra en dos columnas
hu: kimenet két oszlopban
nl: het resultaat weergeven in twee kolommen
sr: исписује у две колоне
sv: Skriv ut i två kolumner.
uk: вивести дані у два стовпчики

source: B<-W>, B<--width>=I<NUM>
es: B<-W>, B<--width>=I<NÚM>
hu: B<-W>, B<--width>=I<SZÁM>
nl: B<-W>, B<--width>=I<AANTAL>
sr: B<-W>, B<--width>=I<БРОЈ>
sv: B<-W>, B<--width>=I<ANT>
uk: B<-W>, B<--width>=I<ЧИСЛО>

source: output at most NUM (default 130) print columns
es: muestra como mucho NÚM columnas de impresión (por omisión 130)
hu: legfeljebb SZÁM (alapértelmezetten 130) nyomtatási oszlop kiírása
nl: maximaal dit AANTAL kolommen tonen (standaard 130)
sr: исписује на највише БРОЈ (почетно 130) колона
sv: Skriv ut högst ANT (130 som standard) kolumner.
uk: виводити текст не більше ніж у ЧИСЛО (типово 130) позицій у рядок

source: output only the left column of common lines
es: muestra solo en la columna izquierda las líneas comunes
hu: a közös soroknak csak a bal oszlopának kiírása
nl: bij gelijke regels alleen de linkerkolom tonen
sr: исписује само леву колону заједничких редова
sv: Skriv endast ut gemensamma raders vänstra kolumn.
uk: виводити спільні рядки лише у ліву колонку

source: do not output common lines
es: no muestra las líneas comunes
hu: ne írja ki a közös sorokat
nl: de gelijke regels onderdrukken
sr: не приказује заједничке редове
sv: Skriv inte ut gemensamma rader.
uk: не виводити спільні рядки

source: show which C function each change is in
es: muestra en qué función de C está cada cambio
hu: jelenítse meg, mely C függvényben van változás
nl: vermelden in welke C-functie elke wijziging is
sr: приказује у којој Ц функцији је свака промена
sv: Visa vilken C-funktion varje rad finns i.
uk: показати дані щодо функцій C у яких виявлено кожну зі змін

source: B<-F>, B<--show-function-line>=I<RE>
es: B<-F>, B<--show-function-line>=I<ER>
hu: B<-F>, B<--show-function-line>=I<RK>
sr: B<-F>, B<--show-function-line>=I<РИ>
sv: B<-F>, B<--show-function-line>=I<RU>

source: show the most recent line matching RE
es: muestra la línea más reciente que encaje con ER
hu: a legutóbbi RK-ra illeszkedő sor megjelenítése
nl: recentste regel overeenkomend met RE tonen
sr: приказује најскорији ред који одговара РИ
sv: Visa den senaste raden som matchar RU.
uk: показати останній рядок, що відповідає формальному виразу RE

source: B<--label> LABEL
es: B<--label> ETIQUETA
hu: B<--label> CÍMKE
sr: B<--label> ОЗНАКА
sv: B<--label> ETIKETT
uk: B<--label> МІТКА

source: use LABEL instead of file name and timestamp (can be repeated)
es: utiliza ETIQUETA en lugar del nombre del archivo y la marca horaria (se puede repetir)
hu: CÍMKE használata fájlnév és időbélyeg helyett (ismételhető)
nl: dit LABEL gebruiken in plaats van bestandsnaam plus tijdsstempel (mag herhaald worden)
sr: користи ОЗНАКУ уместо назива датотеке и временске ознаке (може да се понавља)
sv: Använd ETIKETT istället för filnamn och tidsstämpel (kan upprepas).
uk: використати МІТКУ замість назви файла і часової позначки (можна використовувати декілька разів)

source: expand tabs to spaces in output
es: expande los tabuladores a espacios en la salida
hu: tabulátorok bővítése szóközökké a kimeneten
nl: tabs uitschrijven naar spaties in uitvoer
sr: развија табулаторе у размаке за излаз
sv: Expandera tabulatorer till blanksteg i utdata.
uk: замінювати символи табуляції пробілами у виводі

source: make tabs line up by prepending a tab
es: hace que los tabuladores se alineen anteponiendo uno
hu: beigazítja a tabulátorokat egy tabulátor hozzáfűzésével
nl: tabs uitlijnen door invoegen van tab aan het begin
sr: поравнава табулаторе додајући један табулатор
sv: Justera tabulatorer genom att skjuta in en tabulator.
uk: вирівнювати табуляцію додаючи на початок символ табуляції

source: B<--tabsize>=I<NUM>
es: B<--tabsize>=I<NÚM>
hu: B<--tabsize>=I<SZÁM>
nl: B<--tabsize>=I<AANTAL>
sr: B<--tabsize>=I<БРОЈ>
sv: B<--tabsize>=I<N>
uk: B<--tabsize>=I<ЧИСЛО>

source: tab stops every NUM (default 8) print columns
es: los topes de tabulación están separados por NÚM columnas de impresión (por omisión, 8)
hu: a tabulátor megáll minden SZÁMADIK (alapértelmezetten 8) nyomtatási oszlopnál
nl: tab-stops op elke AANTAL posities (standaard 8)
sr: величина табулатора је БРОЈ (почетно 8) колона
sv: Tabulatorstopp var N:e (8 som standard) kolumn.
uk: табуляція кожні ЧИСЛО позицій виведення (типово 8)

source: suppress space or tab before empty output lines
es: suprime espacios o tabs antes de una línea vacía
hu: szóköz vagy tabulátor elnyomása az üres kimeneti sorok előtt
nl: spatie of tab onderdrukken voor lege uitregels
sr: потискује размак или табулатор пре празних редова излаза
sv: Undertryck blanka eller tabulatorer före tomma utrader.
uk: не показувати пробіли або табуляції перед порожніми рядками

source: pass output through 'pr' to paginate it
es: pasa la salida a través de 'pr' para paginarla
hu: kimenet átadása a „pr” parancsnak lapszámozáshoz
nl: de uitvoer door 'pr' halen om deze in pagina's in te delen
sr: пропушта излаз кроз „pr“ за прелом
sv: Skicka utdata till B<pr>(1) för paginering.
uk: спрямувати дані до B<pr>(1) для розбиття на сторінки.

source: recursively compare any subdirectories found
es: compara recursivamente cualesquier subdirectorios encontrados
hu: a talált alkönyvtár rekurzív összehasonlítása
nl: recursief elke gevonden submap vergelijken
sr: дубински упоређује све пронађене поддиректоријуме
sv: Jämför underkataloger som hittas rekursivt.
uk: рекурсивно порівняти всі знайдені підкаталоги

source: don't follow symbolic links
es: no sigue los enlaces simbólicos
hu: ne kövesse a szimbolikus linkeket
nl: symbolische koppelingen niet volgen
sr: не прати симболичке везе
sv: Följ inte symboliska länkar.
uk: не переходити за символічними посиланнями

source: treat absent files as empty
es: trata los archivos que no existan como vacíos
hu: a hiányzó fájlokat üresként kezelje
nl: afwezige bestanden als leeg behandelen
sr: сматра празним недостајуће датотеке
sv: Behandla saknade filer som tomma.
uk: вважати незнайдені файли порожніми

source: treat absent first files as empty
es: trata los archivos originales que no existan como vacíos
hu: a hiányzó első fájlokat üresként kezelje
nl: alleen bestanden die afwezig zijn in de eerste map als leeg behandelen
sr: сматра празним прве недостајуће датотеке
sv: Behandla saknade förstafiler som tomma.
uk: вважати незнайдені у першому джерелі файли порожніми

source: ignore case when comparing file names
es: descarta las diferencias entre mayúsculas y minúsculas al comparar los nombres de archivos
hu: kis- és nagybetűk figyelmen kívül hagyása fájlnevek összehasonlításakor
nl: verschil tussen hoofd- en kleine letters negeren bij vergelijken van bestandsnamen
sr: занемарује словну величину поређујући назива датотека
sv: Bortse från skiftläge när filnamn jämförs.
uk: ігнорувати регістр назв файлів під час порівняння

source: consider case when comparing file names
es: considera distintas mayúsculas y minúsculas cuando compara los nombres de archivos
hu: kis- és nagybetűk figyelembe vétele fájlnevek összehasonlításakor
nl: onderscheid maken tussen hoofd- en kleine letters bij vergelijken van bestandsnamen
sr: урачунава словну величину поређујући називе датотека
sv: Ta hänsyn till skiftläge när filnamn jämförs.
uk: враховувати регістр символів назв файлів

source: B<-x>, B<--exclude>=I<PAT>
hu: B<-x>, B<--exclude>=I<MINTA>
nl: B<-x>, B<--exclude>=I<PATROON>
sr: B<-x>, B<--exclude>=I<ОБР>
sv: B<-x>, B<--exclude>=I<MNS>
uk: B<-x>, B<--exclude>=I<ЗРАЗОК>

source: exclude files that match PAT
es: excluye los archivos que coincidan con PAT
hu: a MINTÁRA illeszkedő fájlok kizárása
nl: bestanden uitsluiten als ze overeenkomen met PATROON
sr: искључује датотеке које поклапају ОБР
sv: Ta inte med filer som matchar MNS.
uk: виключити файли, назви яких відповідають ЗРАЗКУ

source: B<-X>, B<--exclude-from>=I<FILE>
es: B<-X>, B<--exclude-from>=I<FICHERO>
hu: B<-X>, B<--exclude-from>=I<FÁJL>
nl: B<-X>, B<--exclude-from>=I<BESTAND>
sr: B<-X>, B<--exclude-from>=I<ТЕКА>
sv: B<-X>, B<--exclude-from>=I<FIL>
uk: B<-X>, B<--exclude-from>=I<ФАЙЛ>

source: exclude files that match any pattern in FILE
es: excluye los archivos que coincidan con alguna expresión regular de FICHERO
hu: a FÁJLBAN található mintákra illeszkedő fájlok kihagyása
nl: bestanden weglaten die overeenkomen met een patroon in BESTAND
sr: искључује датотеке које одговарају сваком шаблону у ДАТОТЕЦИ
sv: Uteslut filer som matchar något mönster i FIL.
uk: виключити файли, назви яких відповідають зразкам з файла

source: B<-S>, B<--starting-file>=I<FILE>
es: B<-S>, B<--starting-file>=I<ARCHIVO>
hu: B<-S>, B<--starting-file>=I<FÁJL>
nl: B<-S>, B<--starting-file>=I<BESTAND>
sr: B<-S>, B<--starting-file>=I<ТЕКА>
sv: B<-S>, B<--starting-file>=I<FIL>
uk: B<-S>, B<--starting-file>=I<ФАЙЛ>

source: start with FILE when comparing directories
es: comienza por ARCHIVO cuando se comparan directorios
hu: a FÁJLLAL kezdjen könyvtárak összehasonlítását
nl: beginnen met BESTAND bij vergelijken van mappen
sr: почиње од ТЕКА при поређењу директоријума
sv: Börja med FIL när kataloger jämförs.
uk: починати порівняння каталогів на файлі ФАЙЛ

source: B<--from-file>=I<FILE1>
es: B<--from-file>=I<ARCHIVO1>
hu: B<--from-file>=I<FÁJL1>
nl: B<--from-file>=I<BESTAND1>
sr: B<--from-file>=I<ТЕКА1>
sv: B<--from-file>=I<FIL1>
uk: B<--from-file>=I<ФАЙЛ1>

source: compare FILE1 to all operands; FILE1 can be a directory
es: compara ARCHIVO1 con todos los operandos; ARCHIVO1 puede ser un directorio
hu: FÁJL1 összehasonlítása minden operandussal; FÁJL1 lehet könyvtár is
nl: BESTAND1 met alle argumenten vergelijken; BESTAND1 mag een map zijn
sr: упоређује ТЕКУ1 са свим оперантима. ТЕКА1 може бити директоријум
sv: Jämför FIL1 med alla operander; FIL1 kan vara en katalog.
uk: порівняти ФАЙЛ1 з усіма операндами; ФАЙЛ1 може бути каталогом

source: B<--to-file>=I<FILE2>
es: B<--to-file>=I<FICHERO2>
hu: B<--to-file>=I<FÁJL2>
nl: B<--to-file>=I<BESTAND2>
sr: B<--to-file>=I<ТЕКА2>
sv: B<--to-file>=I<FIL2>
uk: B<--to-file>=I<ФАЙЛ2>

source: compare all operands to FILE2; FILE2 can be a directory
es: compara todos los operandos con FICHERO2; FICHERO2 puede ser un directorio
hu: minden operandus összehasonlítása FÁJL2-vel; FÁJL2 lehet könyvtár is
nl: alle argumenten met BESTAND2 vergelijken; BESTAND2 mag een map zijn
sr: упоређује све операнте са ТЕКОМ2. ТЕКА2 може бити директоријум
sv: Jämför alla operander med FIL2; FIL2 kan vara en katalog.
uk: порівняти всі операнди з ФАЙЛОМ 2; ФАЙЛ2 може бути каталогом.

source: ignore case differences in file contents
es: descarta las diferencias entre mayúsculas y minúsculas en el contenido de los ficheros
hu: kis- és nagybetű eltérések figyelmen kívül hagyása a fájlok tartalmában
nl: verschil tussen hoofd- en kleine letters negeren in bestandsinhoud
sr: занемарује словну величину у склопу датотека
sv: Bortse från skillnader i skiftläge i filinnehåll.
uk: ігнорувати регістр літер у вмісті файлів

source: ignore changes due to tab expansion
es: descarta cambios debidos a expansiones de tabs
hu: a tabulátorbővítés miatti változások mellőzése
nl: omzettingen van tabs in spaties negeren
sr: занемарује промене услед развијања табулатора
sv: Ignorera ändringar på grund av tabulatorexpansion.
uk: ігнорувати зміни, викликані заміною табуляції пробілами

source: ignore white space at line end
es: descarta espacio en blanco al final de línea
hu: a sorvégi üres helyek mellőzése
nl: witruimte aan einde van regel negeren
sr: занемарује размак на крају реда
sv: Ignorera alla blanktecken i slutet av raden.
uk: ігнорувати пробіли наприкінці рядка

source: ignore changes in the amount of white space
es: descarta las diferencias en la cantidad de espacio en blanco
hu: üres helyek számában lévő változások mellőzése
nl: wijzigingen in hoeveelheid witruimte negeren
sr: занемарује промене због количине празног простора
sv: Ignorera ändringar i antalet blanka.
uk: ігнорувати зміни у кількості пробілів

source: ignore all white space
es: descarta los espacios en blanco
hu: minden üres hely mellőzése
nl: alle witruimte negeren
sr: занемарује све размаке
sv: Ignorera alla blanktecken.
uk: ігнорувати усі пробіли

source: ignore changes where lines are all blank
es: descarta los cambios en líneas completamente vacías
hu: változások mellőzése, ahol a sorok üresek
nl: wijzigingen waarvan alle regels leeg zijn negeren
sr: занемарује промене услед празних редова
sv: Bortse från ändringar där raderna är helt blanka.
uk: ігнорувати зміни кількості порожніх рядків

source: B<-I>, B<--ignore-matching-lines>=I<RE>
es: B<-I>, B<--ignore-matching-lines>=I<EXPR-REG>
hu: B<-I>, B<--ignore-matching-lines>=I<RK>
sr: B<-I>, B<--ignore-matching-lines>=I<РИ>
sv: B<-I>, B<--ignore-matching-lines>=I<RU>

source: ignore changes where all lines match RE
es: descarta las líneas que coincidan con EXPR-REG
hu: változások mellőzése, ahol minden sor illeszkedik az RK-ra
nl: wijzigingen waarvan alle regels overeenkomen met reguliere expressie RE negeren
sr: занемарује промене чији редови поклапају РИ
sv: Bortse från ändringar där alla rader matchar RU.
uk: ігнорувати зміни, які відповідають формальному виразу RE

source: treat all files as text
es: trata todos los archivos como de tipo texto
hu: az összes fájl szövegként kezelése
nl: alle bestanden als tekst behandelen
sr: сматра све датотеке као текст
sv: Betrakta alla filer som text.
uk: вважати всі файли текстовими

source: strip trailing carriage return on input
es: elimina los retornos de carro finales en la entrada
hu: a záró kocsi vissza levágása a bemenetről
nl: Enter-tekens (CR's) aan einde van regels weglaten
sr: огољава пратеће E<lt>CRE<gt> на улазу
sv: Tag bort avslutande vagnreturer i indata.
uk: вилучити з виведених даних всі завершальні символи нового рядка

source: B<-D>, B<--ifdef>=I<NAME>
es: B<-D>, B<--ifdef>=I<NOMBRE>
hu: B<-D>, B<--ifdef>=I<NÉV>
nl: B<-D>, B<--ifdef>=I<NAAM>
sr: B<-D>, B<--ifdef>=I<НАЗИВ>
sv: B<-D>, B<--ifdef>=I<NAMN>
uk: B<-D>, B<--ifdef>=I<НАЗВА>

source: output merged file with '#ifdef NAME' diffs
es: genera un fichero combinado que muestra las diferencias con '#ifdef NOMBRE'
hu: egyesített fájlkiírás a „#ifdef NÉV” diffs használatával
nl: samengevoegd bestand tonen om verschillen in '#ifdef NAAM' te laten zien
sr: исписује стопљену датотеку да прикаже „#ifdef НАЗИВ“ разлике
sv: Skriv sammanslagen fil med skillnader inom ”#ifdef NAMN”.
uk: виводити diff-блоки, що використовують конструкцію «#ifdef НАЗВА».

source: B<--GTYPE-group-format>=I<GFMT>
nl: B<--GSOORT-group-format>=I<GOPMAAK>
sr: B<--GTYPE-group-format>=I<ГОБЛ>
uk: B<--ГТИП-group-format>=I<ГФМТ>

source: format GTYPE input groups with GFMT
es: formatea los grupos de entrada GTYPE con GFMT
hu: a GTYPE bemeneti csoportok formázása GFMT-vel
nl: iets dergelijks, maar dan invoergroepen van soort GSOORT opmaken met GOPMAAK
sr: обликује GTYPE улазне групе са ГОБЛ
sv: Formatera GTYP-ingrupper med GFMT.
uk: форматувати вхідні групи типу ГТИП у відповідності до формату ГФМТ.

source: B<--line-format>=I<LFMT>
nl: B<--line-format>=I<LOPMAAK>
sr: B<--line-format>=I<РОБЛ>
sv: B<--line-format>=I<RFMT>
uk: B<--line-format>=I<СФМТ>

source: format all input lines with LFMT
es: formatea todas las líneas de entrada con LFMT
hu: minden bemeneti sor formázása LFMT-vel
nl: iets dergelijks, maar dan alle invoerregels opmaken met LOPMAAK
sr: обликује све улазне редове са РОБЛ
sv: Formatera alla inrader med RFMT.
uk: форматувати всі вхідні рядки за допомогою СФМТ.

source: B<--LTYPE-line-format>=I<LFMT>
nl: B<--LSOORT-line-format>=I<LOPMAAK>
sr: B<--LTYPE-line-format>=I<РОБЛ>
sv: B<--RTYP-line-format>=I<RFMT>
uk: B<--CТИП-group-format>=I<СФМТ>

source: format LTYPE input lines with LFMT
es: formatea las líneas de entrada LTYPE con LFMT
hu: az LTYPE bemeneti sorok formázása LFMT-vel
nl: iets dergelijks, maar dan invoerregels van "" soort LSOORT opmaken met LOPMAAK
sr: обликује LTYPE улазне редове са РОБЛ
sv: Formatera RTYP-inrader med RFMT.
uk: форматувати вхідні рядки типу СТИП у відповідності до формату СФМТ

source: These format options provide fine-grained control over the output
es: Estas opciones de formato proporcionan un control preciso sobre el resultado
hu: Ezek a formázási lehetőségek részletes vezérlést biztosítanak a diff
nl: Deze opmaakopties bieden een fijnafregeling van de uitvoer aan
sr: Ове опције записа обезбеђује фино подешено управљање преко излаза
sv: Dessa formatflaggor gör det möjligt att finjustera utskriften från
uk: За допомогою цих параметрів форматування можна точно налаштувати

source: of diff, generalizing B<-D>/--ifdef.
es: de diff, generalizando B<-D>/--ifdef.
hu: kimenetén, általánosítva: -D/--ifdef.
nl: een generalisatie van de optie B<-D>/--ifdef.
sr: различника, генерализујући B<-D>/--ifdef.
sv: B<diff>, generaliserande B<-D>/B<--ifdef>.
uk: вивід diff, з узагальненням B<-D>/B<--ifdef>.

source: LTYPE is 'old', 'new', or 'unchanged'.
es: LTYPE es 'old' (antiguo), 'new' (nuevo) o 'unchanged' (sin cambios).
hu: Az LTYPE „old”, „new” vagy „unchanged”.
nl: LSOORT is 'old' (oud), 'new' (nieuw), of 'unchanged' (ongewijzigd).
sr: LTYPE је „old“, „new“, или „unchanged“.
sv: RTYP är ”old”, ”new” eller ”unchanged”.
uk: СТИП може бути «old», «new» чи «unchanged».

source: GTYPE is LTYPE or 'changed'.
es: GTYPE es como LTYPE o 'changed' (cambiado).
hu: A GTYPE értéke LTYPE vagy „changed”.
nl: GSOORT is LSOORT of 'changed' (gewijzigd).
sr: GTYPE је LTYPE или „changed“.
sv: GTYP är RTYP eller ”changed”.
uk: ГТИП — те саме або «changed».

source: GFMT (only) may contain:
es: GFMT (solamente) puede contener:
hu: A GFMT (csak) a következőket tartalmazhatja:
nl: GOPMAAK mag bevatten:
sr: ГОБЛ (само) може садржати:
sv: GFMT (endast) kan innehålla:
uk: ГФМТ може містити:

source: lines from FILE1
es: líneas del FICHERO1
hu: FÁJL1 sorai
nl: regels van BESTAND1
sr: редове из ДАТОТЕКЕ1
sv: rader från FIL1
uk: рядки з ФАЙЛА1

source: lines from FILE2
es: líneas del FICHERO2
hu: FÁJL2 sorai
nl: regels van BESTAND2
sr: редове из ДАТОТЕКЕ2
sv: rader från FIL2
uk: рядки з ФАЙЛА2

source: lines common to FILE1 and FILE2
es: líneas comunes a FICHERO1 y FICHERO2
hu: FÁJL1 és FÁJL2 közös sorai
nl: regels overeenkomend in BESTAND1 en BESTAND2
sr: редове заједничке у ДАТОТЕЦИ1 и ДАТОТЕЦИ2
sv: gemensamma rader i FIL1 och FIL2
uk: рядки, спільні для ФАЙЛА1 та ФАЙЛА2

source: %[-][WIDTH][.[PREC]]{doxX}LETTER
es: %[-][ANCHO][.[PRECISIÓN]]{doxX}LETRA
hu: %[-][SZÉLESSÉG][.[PONTOSSÁG]]{doxX}BETŰ
nl: %[-][BREEDTE][.[PREC]]{doxX}LETTER
sr: %[-][ШИРН][.[ТАЧН]]{doxX}СЛОВО
sv: %[-][BREDD][.[PREC]]{doxX}BOKSTAV
uk: %[-][ШИРИНА][.[ТОЧН]]{doxX}ЛІТЕРА

source: printf-style spec for LETTER
es: especificación printf para LETRA
hu: a BETŰ printf-stílusú megadása
nl: printf-stijl specificatie voor LETTER
sr: printf-стил за СЛОВО
sv: printf-lik spec. för BOKSTAV
uk: формат для ЛІТЕРА у стилі B<printf>(1)
