Repository: sebras/manpages-l10n
Catalog: po/*/man1/dvipdf.1.po
Languages: uk

source: 21 September 2022
uk: 21 вересня 2022 року

source: NAME
uk: НАЗВА

source: dvipdf - Convert TeX DVI file to PDF using ghostscript and dvips
uk: dvipdf - конвертує файл TeX DVI у PDF за допомогою ghostscript та dvips

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<dvipdf> [ I<options> ] I<input.dvi> [ I<output.pdf> ] ...
uk: B<dvipdf> [ I<параметри> ] I<input.dvi> [ I<output.pdf> ] ...

source: DESCRIPTION
uk: ОПИС

source: This script invokes B<dvips>(1) with the B<-q> option, and pipes its output into B<gs>(1) with the following options:
uk: Цей скрипт виконує B<dvips>(1) з параметром B<-q>, і передає виведення в B<gs>(1) із наступними параметрами:

source: as well as B<-sOutputFile> and any options from the command-line.
uk: а також B<-sВихіднийФайл> та будь-які парамтери командного рядка.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: VERSION
uk: ВЕРСІЯ

source: This document was last revised for Ghostscript version 10.00.0.
uk: Востаннє цей документ переглядався у Ghostscript версії 10.00.0.

source: AUTHOR
uk: АВТОР

source: Artifex Software, Inc. are the primary maintainers of Ghostscript. This manpage by George Ferguson.
uk: Основними супровідниками Ghostscript є Artifex Software, Inc. Дана man-сторінка від George Ferguson.

source: 1 October 2020
uk: 1 жовтня 2020

source: This document was last revised for Ghostscript version 9.53.3.
uk: Востаннє цей документ переглядався Ghostscript версії 9.53.3.

source: 4 April 2022
uk: 4 квітня 2022

source: This document was last revised for Ghostscript version 9.56.1.
uk: Востаннє цей документ переглядався Ghostscript версії 9.56.1.
