Repository: sebras/manpages-l10n
Catalog: po/*/man1/ed.1.po
Languages: de, nl, pl

source: February 2022
de: Februar 2022
pl: luty 2022

source: User Commands
de: Dienstprogramme für Benutzer
nl: Opdrachten voor gebruikers
pl: Polecenia użytkownika

source: NAME
de: BEZEICHNUNG
nl: NAAM
pl: NAZWA

source: ed - line-oriented text editor
de: ed - zeilenorientierter Texteditor
nl: ed - regel georiënteerde tekstverwerker
pl: ed, red - wierszowy edytor tekstu

source: SYNOPSIS
de: ÜBERSICHT
nl: SAMENVATTING
pl: SKŁADNIA

source: B<ed> [I<\,options\/>] [I<\,file\/>]
de: B<ed> [I<\,Optionen\/>] [I<\,Datei\/>]
nl: B<ed> [I<\,opties\/>] [I<\,bestand\/>]
pl: B<ed> [I<\,opcje\/>] [I<\,plik\/>]

source: DESCRIPTION
de: BESCHREIBUNG
nl: BESCHRIJVING
pl: OPIS

source: GNU ed is a line-oriented text editor. It is used to create, display, modify and otherwise manipulate text files, both interactively and via shell scripts. A restricted version of ed, red, can only edit files in the current directory and cannot execute shell commands. Ed is the \&'standard' text editor in the sense that it is the original editor for Unix, and thus widely available. For most purposes, however, it is superseded by full-screen editors such as GNU Emacs or GNU Moe.
de: GNU B<ed> ist ein zeilenorientierter Texteditor. Er wird zum Erstellen, Anzeigen, Bearbeiten und anderweitigen Verändern von Textdateien verwendet, sowohl interaktiv als auch über Shell-Skripte. Eine eingeschränkte Version von B<ed> namens B<red> kann nur Dateien im aktuellen Verzeichnis bearbeiten und ist nicht in der Lage, Shell-Befehle auszuführen. B<ed> ist der »Standard«-Texteditor in dem Sinne, dass er der Original-Texteditor von Unix und daher weit verbreitet ist. Für die meisten Zwecke wurde er jedoch von Vollbild-Texteditoren wie GNU Emacs oder GNU Moe abgelöst.
nl: GNU B<ed> is een regel georiënteerde tekstverwerker. Hij wordt gebruikt voor het maken, tonen, veranderen en op andere manieren manipuleren van tekstbestanden, zowel interactief als via shell scripts. Een beperkte versie van B<ed>, ´red´, kan alleen bestanden in de huidige map bewerken en kan geen shell commando´s uitvoeren. B<ed> is de \&'standaard' tekstverwerker in de zin dat het de originele tekstverwerker was voor Unix en dus overal beschikbaar. Echter, voor de meeste toepassingen, is B<ed> opgevolgd door scherm georiënteerde tekstverwerkers als GNU Emacs of GNU Moe.

source: OPTIONS
de: OPTIONEN
nl: OPTIES
pl: OPCJE

source: display this help and exit
de: zeigt Hilfeinformationen an und beendet das Programm.
nl: toon de helptekst en stop
pl: wyświetla ten tekst i kończy pracę

source: output version information and exit
de: gibt Versionsinformationen aus und beendet das Programm.
nl: toon programmaversie en stop
pl: wyświetla informacje o wersji i kończy działanie

source: use extended regular expressions
de: verwendet erweiterte reguläre Ausdrücke
nl: gebruik uitgebreide reguliere expressies
pl: używa rozszerzonych wyrażeń regularnych

source: run in compatibility mode
de: aktiviert die Ausführung im Kompatibilitätsmodus.
nl: draai in compatibiliteit modus.
pl: działa w trybie kompatybilności

source: exit with 0 status even if a command fails
de: beendet das Programm selbst dann mit 0, wenn ein Befehl fehlschlägt.
nl: beëindig met 0 status zelfs als een commando faalt
pl: wychodzi z kodem zakończenia 0, nawet gdy polecenie się nie powiedzie

source: B<-p>, B<--prompt>=I<\,STRING\/>
de: B<-p>, B<--prompt>=I<\,ZEICHENKETTE\/>
nl: B<-p>, B<--prompt>=I<\,TEKST\/>
pl: B<-p>, B<--prompt>=I<\,NAPIS\/>

source: use STRING as an interactive prompt
de: verwendet die angegebene ZEICHENKETTE als interaktive Eingabeaufforderung.
nl: gebruik TEKST als de interactieve vraag
pl: Używa I<NAPISU> jako znaku zachęty

source: run in restricted mode
de: aktiviert die Ausführung im eingeschränkten Modus.
nl: draai in beperkte modus
pl: działa w trybie okrojonym

source: suppress diagnostics, byte counts and '!' prompt
de: unterdrückt Diagnosemeldungen, Byte-Zähler und die B<!>-Eingabeaufforderung.
nl: onderdruk diagnoses, byte teller en de '|' vraag
pl: wyłącza diagnostykę, zliczanie bajtów i znak zachęty "!"

source: be verbose; equivalent to the 'H' command
de: gibt ausführliche Meldungen aus; ist gleichbedeutend mit dem Befehl B<H>.
nl: uitgebreide meldingen weergeven; gelijk aan het opdracht 'H'
pl: bardziej szczegółowe wyjście; ekwiwalent polecenia "H"

source: strip carriage returns at end of text lines
de: entfernt Wagenrückläufe (Carriage Return) am Ende von Textzeilen

source: Start edit by reading in 'file' if given. If 'file' begins with a '!', read output of shell command.
de: Die Bearbeitung beginnt durch Lesen in der I<Datei>, sofern diese angegeben ist. Falls die Angabe der I<Datei> mit B<!> beginnt, wird die Ausgabe des Shell-Befehls gelesen.
nl: Begin het verwerken door 'bestand' te lezen als gegeven. Als 'bestand' begint met een '|' lees dan de uitvoer van een shell commando.
pl: Zaczyna edycję od odczytu I<pliku>. jeśli go podano. Jeśli I<plik> zaczyna się od B<!>, czyta wyjście polecenia powłoki.

source: Exit status: 0 for a normal exit, 1 for environmental problems (file not found, invalid flags, I/O errors, etc), 2 to indicate a corrupt or invalid input file, 3 for an internal consistency error (e.g., bug) which caused ed to panic.
de: Exit-Status: 0 für normales Beenden, 1 für Probleme in der Umgebung (Datei nicht gefunden, ungültige Schalter, E/A-Fehler usw.), 2 bei einer beschädigten oder ungültigen Eingabedatei, 3 für einen internen Konsistenzfehler (zum Beispiel einen Bug), der in B<ed> ein »panic« ausgelöst hat.

source: REPORTING BUGS
de: FEHLER MELDEN
nl: RAPPORTEREN VAN BUGS
pl: ZGŁASZANIE BŁĘDÓW

source: Report bugs to bug-ed@gnu.org
de: Melden Sie Fehler an E<.MT bug-ed@gnu.org>E<.ME .>
nl: Rapporteer gebreken in het programma aan bug-ed@gnu.org
pl: Błędy prosimy zgłaszać na adres bug-ed@gnu.org

source: Ed home page: http://www.gnu.org/software/ed/ed.html
de: Homepage von Ed: E<.UR http://www.gnu.org/software/ed/ed.html>E<.UE>
nl: Webpagina van Ed: http://www.gnu.org/software/ed/ed.html
pl: Strona domowa Ed: http://www.gnu.org/software/ed/ed.html

source: General help using GNU software: http://www.gnu.org/gethelp
de: Allgemeine Hilfe zur Benutzung von GNU-Software: E<.UR http://www.gnu.org/gethelp>E<.UE>
nl: Algemene hulp bij gebruik van GNU-software: http://www.gnu.org/gethelp
pl: Ogólna pomoc dotycząca oprogramowania GNU: http://www.gnu.org/gethelp

source: Copyright \(co 2022 Antonio Diaz Diaz. License GPLv2+: GNU GPL version 2 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
de: Copyright \(co 2022 Antonio Diaz Diaz. Lizenz GPLv2+: E<.UR https://www.gnu.org/licenses/old-licenses/gpl-2.0.html> GNU GPL Version 2 E<.UE> oder neuer.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
pl: Jest to wolne oprogramowanie: można je zmieniać i rozpowszechniać. Nie ma ŻADNEJ GWARANCJI, w granicach określonych przez prawo.

source: SEE ALSO
de: SIEHE AUCH
nl: ZIE OOK
pl: ZOBACZ TAKŻE

source: The full documentation for B<ed> is maintained as a Texinfo manual. If the B<info> and B<ed> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<ed> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<ed> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl
nl: De volledige documentatie voor B<ed> wordt bijgehouden als een Texinfo-handleiding. Als de programma's B<info> en B<ed> correct op uw systeem zijn geïnstalleerd, geeft u de opdracht
pl: Pełna dokumentacja dla programu B<ed> jest utrzymywana jako podręcznik Texinfo. Jeśli programy B<info> oraz B<ed> są właściwie zainstalowane, polecenie

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
nl: toegang tot de volledige handleiding.
pl: powinno dać dostęp do pełnego podręcznika.

source: January 2021
de: Januar 2021
nl: Januari 2021
pl: styczeń 2021

source: Exit status: 0 for a normal exit, 1 for environmental problems (file not found, invalid flags, I/O errors, etc), 2 to indicate a corrupt or invalid input file, 3 for an internal consistency error (eg, bug) which caused ed to panic.
de: Exit-Status: 0 für normales Beenden, 1 für Probleme in der Umgebung (Datei nicht gefunden, ungültige Schalter, E/A-Fehler usw.), 2 bei einer beschädigten oder ungültigen Eingabedatei, 3 für einen internen Konsistenzfehler (zum Beispiel einen Bug), der in B<ed> ein »panic« ausgelöst hat.
nl: Afsluit status: 0 bij een normale beëindiging, 1 voor omgevings problemen (bestand niet gevonden, ongeldige vlaggen, I/O fouten, etc.), 2 geeft aan dat het invoer bestand fout of ongeldig was, 3 voor een interne consistentie fout (b.v. een bug) die ervoor zorgde dat ´ed' panikeerde.
pl: Kod zakończenia: 0 dla normalnego wyjścia, 1 dla problemów technicznych (plik nieznaleziony, niewłaściwy parametr, błąd wejścia/wyjścia itp.), 2 dla zasygnalizowania błędnego lub uszkodzonego pliku wejściowego, 3 dla wewnętrznego błędu (np. bug), który zmusił B<ed> do przerwania.

source: Copyright \(co 2021 Antonio Diaz Diaz. License GPLv3+: GNU GPL version 3 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
de: Copyright \(co 2021 Antonio Diaz Diaz. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
nl: Copyright \(co 2021 Antonio Diaz Diaz. Licentie GPLv3+: GNU GPL version 3 of later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
pl: Copyright \(co 2021 Antonio Diaz Diaz. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: February 2017
nl: Februari 2017
pl: luty 2017

source: GNU Ed - The GNU line editor.
nl: GNU Ed - De GNU regel tekstverwerker.
pl: GNU Ed - Edytor wierszowy GNU.

source: Copyright \(co 2017 Antonio Diaz Diaz. License GPLv3+: GNU GPL version 3 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
nl: Copyright \(co 2017 Antonio Diaz Diaz. Licentie GPLv3+: GNU GPL version 3 of later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
pl: Copyright \(co 2017 Antonio Diaz Diaz. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
