Repository: sebras/manpages-l10n
Catalog: po/*/man1/env.1.po
Languages: de, es, fr, nl, pl

source: April 2022
es: Abril de 2022
fr: Avril 2022
pl: kwiecień 2022

source: User Commands
de: Dienstprogramme für Benutzer
es: Órdenes de usuario
fr: Commandes de l'utilisateur
nl: Opdrachten voor gebruikers
pl: Polecenia użytkownika

source: NAME
de: BEZEICHNUNG
es: NOMBRE
fr: NOM
nl: NAAM
pl: NAZWA

source: env - run a program in a modified environment
de: env - ein Programm in einer veränderten Umgebung laufen lassen
es: env - ejecuta un programa con un entorno modificado
fr: env - Exécuter un programme dans un environnement modifié
nl: env - voer een programma in een gewijzigde omgeving uit
pl: env - uruchamia program w zmienionym środowisku

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS
nl: SAMENVATTING
pl: SKŁADNIA

source: B<env> [I<\,OPTION\/>]... [I<\,-\/>] [I<\,NAME=VALUE\/>]... [I<\,COMMAND \/>[I<\,ARG\/>]...]
de: B<env> [I<\,OPTION\/>]… [I<\,-\/>] [I<\,NAME=WERT\/>]… [I<\,BEFEHL \/>[I<\,ARG\/>]…]
es: B<env> [I<\,OPCIÓN\/>]... [I<\,-\/>] [I<\,NOMBRE=VALOR\/>]... [I<\,ORDEN \/>[I<\,ARGUMENTO\/>]...]
fr: B<env> [I<\,OPTION\/>]... [I<\,-\/>] [I<\,NOM=VALEUR\/>]... [I<\,COMMANDE \/>[I<\,PARAM\/>]...]
nl: B<env> [I<\,OPTIE\/>]... [I<\,-\/>] [I<\,NAAM=WAARDE\/>]... [I<\,COMMANDO \/>[I<\,ARGUMENT\/>]...]
pl: B<env> [I<OPCJA>]... [B<->] [I<NAZWA>B<=>I<WARTOŚĆ>]... [I<POLECENIE >[I<ARG>]...]

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN
nl: BESCHRIJVING
pl: OPIS

source: Set each NAME to VALUE in the environment and run COMMAND.
de: Jeden NAMEn in der Umgebung auf WERT setzen und BEFEHL ausführen.
es: Asigna a cada NOMBRE el VALOR en el entorno y ejecuta ORDEN.
fr: Initialiser chaque I<NOM> à la I<VALEUR> dans l'environnement et exécuter la I<COMMANDE>.
nl: Kent de gegeven WAARDE aan omgevingsvariabele NAAM toe en voert COMMANDO uit.
pl: Ustawia każdą zmienną środowiskową I<NAZWA> na I<WARTOŚĆ> i wykonuje I<POLECENIE>.

source: Mandatory arguments to long options are mandatory for short options too.
de: Die obligatorischen Argumente für Optionen sind für deren Kurz- und Langform gleich.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
fr: Les paramètres obligatoires pour les options de forme longue le sont aussi pour les options de forme courte.
nl: Een verplicht argument bij een lange optie is ook verplicht voor de korte optie.
pl: Argumenty, które są obowiązkowe dla długich opcji, są również obowiązkowe dla krótkich.

source: start with an empty environment
de: Mit einer leeren Umgebung beginnen
es: comienza con un entorno vacío
fr: débuter avec un environnement vide
nl: alle ongenoemde omgevingsvariabelen verwijderen
pl: zaczyna z pustym środowiskiem

source: end each output line with NUL, not newline
de: Jede Ausgabezeile mit einem Nullbyte statt des Zeilenumbruchs abschließen
es: termina cada línea con NULL, no con nueva línea
fr: terminer chaque ligne produite par un caractère NULL plutôt que par un changement de ligne
nl: elke regel afsluiten met NUL-byte, niet met nieuwe regel
pl: kończy każdy wiersz bajtem NUL, zamiast znakiem nowego wiersza

source: B<-u>, B<--unset>=I<\,NAME\/>
es: B<-u>, B<--unset>=I<\,NOMBRE\/>
fr: B<-u>, B<--unset>=I<\,NOM\/>
nl: B<-u>, B<--unset>=I<\,NAAM\/>
pl: B<-u>, B<--unset>=I<NAZWA>

source: remove variable from the environment
de: Variable aus der Umgebung entfernen
es: borra la variable del entorno
fr: retirer la I<VARIABLE> de l'environnement
nl: de genoemde variabele uit de omgeving verwijderen
pl: usuwa zmienną I<NAZWA> ze środowiska

source: B<-C>, B<--chdir>=I<\,DIR\/>
de: B<-C>, B<--chdir>=I<\,VERZ\/>
fr: B<-C>, B<--chdir>=I<\,RÉP\/>
nl: B<-C>, B<--chdir>=I<\,MAP\/>
pl: B<-C>, B<--chdir>=I<\,KATALOG\/>

source: change working directory to DIR
de: Arbeitsverzeichnis auf VERZ ändern
es: modifica el directorio de trabajo a DIR
fr: passer au répertoire de travail I<RÉP>
nl: huidige map wijzigen naar MAP
pl: zmienia katalog roboczy na B<KATALOG>

source: process and split S into separate arguments; used to pass multiple arguments on shebang lines
de: Verarbeitet und trennt S in getrennte Argumente; wird zur Übergabe von mehreren Argumenten auf Shebang-Zeilen verwandt
es: procesa y trocea S en argumentos separados; usado para poner varios argumentos en la línea del shebang
fr: traite et divise S en arguments séparés ; utilisé pour passer plusieurs arguments sur des lignes shebang
nl: deze tekenreeks in aparte argumenten opsplitsen; nuttig voor de '#!'-regel in scripts
pl: procesuje i dzieli B<S> na osobne argumenty; używane by przekazać kilka argumentów na linię shebang

source: B<--block-signal>[=I<\,SIG\/>]
fr: B<--block-size>=I<TAILLE>
pl: B<--block-signal>[=I<\,SYGNAŁ\/>]

source: block delivery of SIG signal(s) to COMMAND
de: Blockiert die Auslieferung der Signale SIG an BEFEHL
es: bloquea la(s) señal(es) SIG a la orden
fr: bloquer l'émission de signaux SIG sur COMMANDE
nl: signalen (of dit signaal) aan COMMANDO blokkeren
pl: blokuje dostarczenie sygnał(ów) B<SYGNAŁ> do komendy

source: B<--default-signal>[=I<\,SIG\/>]
fr: B<-s>, B<--signal=>I<SIGNAL>
pl: B<--default-signal>[=I<\,SYGNAŁ\/>]

source: reset handling of SIG signal(s) to the default
de: Setzt die Handhabung der Signale SIG auf die Vorgabe zurück
es: el efecto de la(s) señal(es) SIG será el que tienen por defecto
fr: réinitialise la gestion des signaux aux valeurs par défaut
nl: afhandeling van signalen (of van dit signaal) terugzetten op de standaard
pl: resetuje sposób obsługi sygnał(ów) B<SYGNAŁ> do ustawień domyślnych

source: B<--ignore-signal>[=I<\,SIG\/>]
pl: B<--ignore-signal>[=I<\,SYGNAŁ\/>]

source: list non default signal handling to stderr
de: Berichtet von der Vorgabe abweichende Signal-Handler auf Stderr
es: muestra por la salida de error estándar las señales que tienen su interpretación modificada
fr: lister la gestion des signaux non par défaut sur la sortie d’erreur
nl: de niet-standaard signaalafhandelingen tonen
pl: wypisuje niedomyślne sposoby obsługi sygnałów na stderr

source: print verbose information for each processing step
de: Zeigt ausführliche Informationen für jeden Verarbeitungsschritt an
es: muestra información prolija para cada paso
fr: afficher des informations bavardes pour chaque étape en cours
nl: gedetailleerde informatie weergeven voor elke stap
pl: wypisuje szczegółowe informacje dla każdego kroku procesowania

source: display this help and exit
de: zeigt Hilfeinformationen an und beendet das Programm.
es: muestra la ayuda y finaliza
fr: afficher l'aide-mémoire et quitter
nl: toon de helptekst en stop
pl: wyświetla ten tekst i kończy pracę

source: output version information and exit
de: gibt Versionsinformationen aus und beendet das Programm.
es: muestra la versión del programa y termina
fr: afficher les informations de version et quitter.
nl: toon programmaversie en stop
pl: wyświetla informacje o wersji i kończy działanie

source: A mere - implies B<-i>. If no COMMAND, print the resulting environment.
de: Ein einzelnes »-« impliziert B<-i>. Wenn kein BEFEHL angegeben ist, wird die resultierende Umgebung ausgegeben.
es: Un simple - implica B<-i>. Si no hay ORDEN, muestra el entorno resultante.
fr: Un simple « B<-> » implique B<-i>. Si aucune I<COMMANDE> n'est fournie, afficher l’environnement résultant.
nl: Een losse '-' betekent hetzelfde als B<-i>. Zonder COMMANDO wordt de resulterende omgeving getoond.
pl: Argument B<-> implikuje B<-i>. Jeśli nie podano I<POLECENIA>, wyświetlane jest otrzymane środowisko.

source: SIG may be a signal name like 'PIPE', or a signal number like '13'. Without SIG, all known signals are included. Multiple signals can be comma-separated.
de: SIG darf ein Signalname wie »PIPE« oder eine Signalnummer wie »13« sein. Ohne »SIG« sind alle bekannten Signale eingeschlossen. Mehrere Signale können durch Kommata getrennt werden.
es: SIG puede ser un nombre de señal como 'PIPE', un número como '13'. Sin SIG, se incluirán todas las señales conicidas. Para indicar varias, tienen que separarse por comas.
fr: I<SIG> peut être le nom d'un signal comme « PIPE », ou le numéro d'un signal comme « 13 ». Sans I<SIG>, tous les signaux connus sont inclus. Plusieurs signaux peuvent être séparés par des virgules.
nl: SIGNAAL mag een signaalnaam zijn zoals 'PIPE', of een signaalnummer zoals '13'. Zonder SIGNAAL worden all bekende signalen genomen. Meerdere signalen kunnen gegeven worden gescheiden door komma's.
pl: B<SYGNAŁ> może być nazwą sygnału jak "PIPE" lub numerem sygnału jak "13". Bez B<SYGNAŁU>, wszystkie znane sygnały są dołączone. Kolejne sygnały należy rozdzielić średnikiem.

source: OPTIONS
de: OPTIONEN
es: OPCIONES
nl: OPTIES
pl: OPCJE

source: -S/--split-string usage in scripts
de: -S/--split-string-Verwendung in Skripten
es: -S/--split-string uso en scripts
fr: Utilisation de -S/--split-string dans des scripts
nl: -S/--split-string gebruik in scripts
pl: Użycie -S/--split-string w skryptach

source: The B<-S> option allows specifying multiple parameters in a script. Running a script named B<1.pl> containing the following first line:
de: Die Option B<-S> ermöglicht die Festlegung mehrerer Parameter in einem Skript. Wird ein Skript namens B<1.pl> mit den folgenden ersten Zeilen
es: La opción B<-S> permite proporcionar varios parámetros a un script. Por ejemplo, si ejecutamos un script B<1.pl> con el siguiente contenido en su primera linea:
fr: L'option B<-S> permet de spécifier plusieurs paramètres dans un script. L’exécution d’un script nommé B<1.pl> contenant la première ligne suivante :
nl: De B<-S> optie staat toe om meerdere parameters te gebruiken in een script. Uitvoeren van een script met de naam B<1.pl> dat als eerste regel bevat:
pl: Opcja B<-S> zezwala na określenie kilku parametrów w skrypcie. Uruchomienie skryptu o nazwie B<1.pl> zawierającego następującą pierwszą linię:

source: Will execute B<perl -w -T 1.pl .>
de: ausgeführt, wird B<perl -w -T 1.pl> ausgeführt.
es: Ejecutará B<perl -w -T 1.pl .>
fr: exécutera B<perl -w -T 1.pl .>
nl: zal uitvoeren B<perl -w -T 1.pl .>
pl: Wywoła B<perl -w -T 1.pl .>

source: Without the B<'-S'> parameter the script will likely fail with:
de: Ohne den Parameter B<»-S«> wird das Skript wahrscheinlich wie folgt fehlschlagen:
es: Si no si indica el parámetro B<'-S'>,el script seguramente dé el siguiente error:
fr: Sans paramètre « B<-S> », le script échouera probablement avec :
nl: Zonder de B<'-S'> parameter zal het script falen met:
pl: Bez parametru B<'-S'> skrypt z argumentu prawdopodobnie zwróci błąd:

source: See the full documentation for more details.
de: Siehe die vollständige Dokumentation für weitere Details.
es: Consulte la documentación completa para más detalles.
fr: Voir la documentation complète pour plus de détails.
nl: Zie de volledige documentatie voor meer details.
pl: Więcej detali w pełnej dokumentacji.

source: --default-signal[=SIG] usage
de: --default-signal[=SIG] Verwendung
es: --default-signal[=SIG] uso
fr: Utilisation de --default-signal[=SIG]
nl: --default-signal[=SIG] gebruik
pl: użycie --default-signal[=SYGNAŁ]

source: This option allows setting a signal handler to its default action, which is not possible using the traditional shell trap command. The following example ensures that seq will be terminated by SIGPIPE no matter how this signal is being handled in the process invoking the command.
de: Diese Option erlaubt das Einstellen eines Signal-Handlers auf seine Standardaktion, was über den traditionellen Befehl »trap« der Shell nicht möglich ist. Das nachfolgende Beispiel stellt sicher, dass »seq« mit SIGPIPE beendet wird, unabhängig davon, wie die Signale in dem Prozess, der den Befehl aufruft, gehandhabt werden.
es: Esta opción permite que un gestor de señales tenga un comportamiento predeterminado, lo cual no es posible usando la orden tradicional 'trap' de shell. El siguiente ejemplo asegura que seq será terminado por SIGPIPE independientemente de cómo se maneje esta señal en el proceso que invoca la orden.
fr: Cette option permet de demander au gestionnaire de signaux son action par défaut, ce qui n'est pas possible en utilisant la commande B<trap> d'un interpréteur traditionnel. L'exemple suivant s'assure que B<seq> se terminera avec I<SIGPIPE> quelle que soit la manière dont le signal est géré lors du traitement du lancement de la commande.
nl: Deze optie staat toe de standaard actie voor de signaal verwerker in te stellen, iets dat niet mogelijk is bij gebruik van het gewone shell trap commando. Het volgende voorbeeld zorgt ervoor dat seq wordt beeindigd door SIGPIPE waarbij het niet uitmaakt hoe dit signaal wordt afgehandeld door het proces dat het commando heeft aangeroepen.
pl: Ta opcja pozwala ustawić obsługę sygnału do wartości domyślnych, co nie jest możliwe używając tradycyjnej komendy shell trap. Następujący przykład zapewnia, że ta sekwencja zostanie zakończona przez SIGPIPE, bez znaczenia jak sygnał jest obsługiwany w procesie wywołującym komendę.

source: NOTES
de: ANMERKUNGEN
es: NOTAS
nl: OPMERKINGEN
pl: UWAGI

source: many existing applications wrongly assume that they start with certain signals set to the default action and/or unblocked.... Therefore, it is best not to block or ignore signals across execs without explicit reason to do so, and especially not to block signals across execs of arbitrary (not closely cooperating) programs.
de: viele existierende Anwendungen nehmen irrtümlicherweise an, dass sie mit bestimmten Signalen starten, die auf ihre Vorgabe gesetzt und/oder nicht blockiert sind… Daher ist es am besten, Signale über Exec hinweg nicht zu blockieren oder zu ignorieren, ohne einen expliziten Grund dafür, und insbesondere Signale nicht über Execs von beliebigen (nicht eng zusammenarbeitenden) Programmen zu blockieren.
es: muchas aplicaciones existentes asumen erróneamente un funcionamiento estándar de las señales (que no se ignoren ni se bloqueen..). Por lo tanto, es mejor no bloquear o ignorar señales entre ejecuciones sin una buena razón para hacerlo, y especialmente no bloquear señales a través de la ejecución de programas arbitrarios (que no cooperen estrechamente entre si).
fr: de nombreuses applications supposent, à tort, qu'elles démarrent avec certains signaux paramétrés sur l'action par défaut et/ou débloqués... Il vaut donc mieux ne pas bloquer ou ignorer des signaux d'exécutables sans raison particulière, et surtout ne pas bloquer les signaux des exécutables de programmes de votre choix (sans étroite coopération).
nl: veel bestaande toepassingen maken de aanname dat zij starten met bepaalde signalen die zijn ingesteld als standaard actie en/of niet geblokkeerd.... Daarom, is het beter signalen niet te blokkeren of te negeren voor uitvoeren zonder een expliciete reden om dat te doen, en speciaal signalen voor uitvoeren niet te blokkeren van willekeurige programma´s
pl: wiele istniejących aplikacji błędnie zakłada, że startują one z konkretnymi sygnałami ustawionymi na akcje domyślne lub/i odblokowanymi... Dlatego, najlepiej nie blokować czy ignorować sygnałów wśród wywołań beż szczególnego powodu, a szczególnie nie blokować sygnałów pośród wywołań arbitralnych (nie współpracujących ze sobą) programów.

source: AUTHOR
de: AUTOR
es: AUTOR
fr: AUTEUR
nl: AUTEUR
pl: AUTOR

source: Written by Richard Mlynarik, David MacKenzie, and Assaf Gordon.
de: Geschrieben von Richard Mlynarik, David MacKenzie und Assaf Gordon.
es: Escrito por Richard Mlynarik, David MacKenzie y Assaf Gordon.
fr: Écrit par Richard Mlynarik, David MacKenzie et Assaf Gordon.
nl: Geschreven door Richard Mlynarik, David MacKenzie en Assaf Gordon.
pl: Napisane przez Richarda Mlynarika, Davida MacKenzie oraz Assaf Gordon.

source: REPORTING BUGS
de: FEHLER MELDEN
es: INFORMAR DE ERRORES
fr: SIGNALER DES BOGUES
nl: RAPPORTEREN VAN BUGS
pl: ZGŁASZANIE BŁĘDÓW

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
de: Onlinehilfe für GNU coreutils: E<.UR https://www.gnu.org/software/coreutils/>E<.UE>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
fr: Aide en ligne de GNU coreutils : E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Online hulp bij GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
pl: Strona internetowa z pomocą GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
de: Melden Sie Fehler in der Übersetzung an E<.UR https://translationproject.org/team/de.html> das deutschsprachige Team beim GNU Translation ProjectE<.UE .>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
fr: Signaler toute erreur de traduction à E<lt>https://translationproject.org/team/fr.htmlE<gt>
nl: Meld alle vertaalfouten op E<lt>https://translationproject.org/team/nl.htmlE<gt>
pl: O błędach tłumaczenia poinformuj przez E<lt>https://translationproject.org/team/pl.htmlE<gt>

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2022 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
fr: Copyright \(co 2022 Free Software Foundation, Inc. Licence GPLv3+\ : GNU GPL version 3 ou ultérieure E<lt>https://gnu.org/licenses/gpl.htmlE<gt>
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pl: Copyright \(co 2022 Free Software Foundation, Inc. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
fr: Ce programme est un logiciel libre. Vous pouvez le modifier et le redistribuer. Il n'y a AUCUNE GARANTIE dans la mesure autorisée par la loi.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
pl: Jest to wolne oprogramowanie: można je zmieniać i rozpowszechniać. Nie ma ŻADNEJ GWARANCJI, w granicach określonych przez prawo.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN
fr: VOIR AUSSI
nl: ZIE OOK
pl: ZOBACZ TAKŻE

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/envE<gt>
de: Vollständige Dokumentation unter: E<lt>https://www.gnu.org/software/coreutils/envE<gt>
es: Ayuda en línea: E<lt>https://www.gnu.org/software/coreutils/envE<gt>
fr: Documentation complète : E<lt>I<https://www.gnu.org/software/coreutils/env>E<gt>
nl: Volledige documentatie op: E<lt>https://www.gnu.org/software/coreutils/envE<gt>
pl: Pełna dokumentacja na stronie: E<lt>https://www.gnu.org/software/coreutils/envE<gt>

source: or available locally via: info \(aq(coreutils) env invocation\(aq
de: oder lokal verfügbar mit: info \(aq(coreutils) env invocation\(aq
es: también disponible localmente ejecutando: info \(aq(coreutils) env invocation\(aq
fr: aussi disponible localement à l’aide de la commande : info \(aq(coreutils) env invocation\(aq
nl: of lokaal via: info \(aq(coreutils) env invocation\(aq
pl: lub lokalnie, za pomocą B<info \(aq(coreutils) env invocation\(aq>

source: September 2020
es: Septiembre de 2020
fr: Septembre 2020
pl: wrzesień 2020

source: set handling of SIG signals(s) to do nothing
de: Setzt die Handhabung der Signale SIG, so dass sie nichts machen
es: ignora la(s) señal(es) SIG
fr: paramétrer la gestion du/des signaux I<SIG> pour qu'elle ne fasse rien
nl: signalen (of dit signaal) negeren
pl: ustawia sposób obsługi sygnał(ów) B<SYGNAŁ> by nie miały efektu

source: POSIX's exec(2) pages says:
de: POSIX Handbuchseite exec(2) schreibt:
es: La página POSIX de exec(2) dice lo siguiente:
fr: Les pages de B<exec>(2) de POSIX disent :
nl: POSIX's exec(2) pagina schrijft:
pl: Pordręcznik POSIX dla exec(2) mówi:

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2020 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
fr: Copyright \(co 2020 Free Software Foundation, Inc. Licence GPLv3+\ : GNU GPL version 3 ou ultérieure E<lt>https://gnu.org/licenses/gpl.htmlE<gt>
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pl: Copyright \(co 2020 Free Software Foundation, Inc. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
de: Oktober 2021
es: Octubre de 2021
fr: Octobre 2021
nl: Oktober 2021
pl: październik 2021

source: August 2022
es: Agosto de 2022
nl: Augustus 2022
pl: sierpień 2022

source: September 2021
fr: Septembre 2021
pl: wrzesień 2021

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2021 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
fr: Copyright \(co 2021 Free Software Foundation, Inc. Licence GPLv3+\ : GNU GPL version 3 ou ultérieure E<lt>https://gnu.org/licenses/gpl.htmlE<gt>
pl: Copyright \(co 2021 Free Software Foundation, Inc. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: set handling of SIG signal(s) to do nothing
de: Setzt die Handhabung der Signal(e) SIG, so dass sie nichts machen
es: no responde a la(s) señal(es) SIG
nl: stel afhandeling van SIG signa(a)l(en) in op negeren

source: /usr/bin/env: 'perl -w -T': No such file or directory
es: /usr/bin/env: 'perl -w -T':No existe el fichero o el directorio
fr: /usr/bin/env: 'perl -w -T': Aucun fichier ou répertoire de ce type
nl: /usr/bin/env: 'perl -w -T': Bestand of map niet gevonden

source: POSIX's B<exec>(3p) pages says:
de: Die POSIX-Handbuchseite B<exec>(3p) schreibt:
es: La página POSIX de B<exec>(3p) dice lo siguiente:
nl: POSIX's B<exec>(3p) pagina schrijft:

source: sigaction(2), sigprocmask(2), signal(7)
de: B<sigaction>(2), B<sigprocmask>(2), B<signal>(7)
fr: B<sigaction>(2), B<sigprocmask>(2), B<signal>(7)

source: March 2022
de: März 2022
fr: Mars 2022

source: B<-S>, B<--split-string>=I<\,S\/>
nl: B<-S>, B<--split-string>=I<\,T\/>
