Repository: sebras/manpages-l10n
Catalog: po/*/man1/fallocate.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: fallocate - preallocate or deallocate space to a file
uk: fallocate — попередньо отримати місце у файлі або скасувати отримання місця у файлі

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<fallocate> [B<-c>|B<-p>|B<-z>] [B<-o> I<offset>] B<-l> I<length> [B<-n>] I<filename>
uk: B<fallocate> [B<-c>|B<-p>|B<-z>] [B<-o> I<відступ>] B<-l> I<довжина> [B<-n>] I<назва-файла>

source: B<fallocate> B<-d> [B<-o> I<offset>] [B<-l> I<length>] I<filename>
uk: B<fallocate> B<-d> [B<-o> I<відступ>] [B<-l> I<довжина>] I<назва-файла>

source: B<fallocate> B<-x> [B<-o> I<offset>] B<-l> I<length filename>
uk: B<fallocate> B<-x> [B<-o> I<відступ>] B<-l> I<довжина назва-файла>

source: DESCRIPTION
uk: ОПИС

source: B<fallocate> is used to manipulate the allocated disk space for a file, either to deallocate or preallocate it. For filesystems which support the B<fallocate>(2) system call, preallocation is done quickly by allocating blocks and marking them as uninitialized, requiring no IO to the data blocks. This is much faster than creating a file by filling it with zeroes.
uk: B<fallocate> використовують для роботи із отриманим місцем на диску для файла — скасування отримання місця або попереднього отримання місця для нього. Для файлових систем, для яких передбачено підтримку системного виклику B<fallocate>(2), попереднє отримання місця буде виконано швидко отриманням блоків і позначенням їх як неініціалізованих, що не потребуватиме введення-виведення до блоків даних. Це набагато швидше за створення файла заповненням його нулями.

source: The exit status returned by B<fallocate> is 0 on success and 1 on failure.
uk: Станом виходу з B<fallocate> є 0, якщо дію буде виконано успішно, і 1, якщо станеться помилка.

source: OPTIONS
uk: ПАРАМЕТРИ

source: The I<length> and I<offset> arguments may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB, and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB") or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB, and YB.
uk: Після аргументів I<довжина> і I<відступ> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB.

source: The options B<--collapse-range>, B<--dig-holes>, B<--punch-hole>, and B<--zero-range> are mutually exclusive.
uk: Параметри B<--collapse-range>, B<--dig-holes>, B<--punch-hole> і B<--zero-range> не можна використовувати одночасно.

source: Removes a byte range from a file, without leaving a hole. The byte range to be collapsed starts at I<offset> and continues for I<length> bytes. At the completion of the operation, the contents of the file starting at the location I<offset>+I<length> will be appended at the location I<offset>, and the file will be I<length> bytes smaller. The option B<--keep-size> may not be specified for the collapse-range operation.
uk: Вилучає діапазон байтів з файла без залишення дірки. Діапазон байтів, який буде згорнуто, починатиметься із позиції I<відступ> і продовжуватиметься I<довжина> байтів. По завершенню дії вміст файла, що починається із позиції I<відступ>+I<довжина> буде дописано з позиції I<відступ>, а файл стане на I<довжина> байтів меншим. Якщо виконується дія із згортання діапазону, параметр B<--keep-size> не може бути вказано у рядку команди.

source: Available since Linux 3.15 for ext4 (only for extent-based files) and XFS.
uk: Доступна з Linux 3.15 для ext4 (лише для файлів на основі розширення) і XFS.

source: A filesystem may place limitations on the granularity of the operation, in order to ensure efficient implementation. Typically, I<offset> and I<length> must be a multiple of the filesystem logical block size, which varies according to the filesystem type and configuration. If a filesystem has such a requirement, the operation will fail with the error B<EINVAL> if this requirement is violated.
uk: Файлова система може накладати обмеження на дискретизацію дії для того, щоб забезпечити ефективну реалізацію. Типово, I<відступ> і I<довжина> мають бути кратним до розміру логічного блоку файлової системи, який залежить від типу та налаштувань файлової системи. Якщо у файловій системі встановлено подібні обмеження, спроба виконання дії завершиться помилкою B<EINVAL> при порушенні обмежень.

source: Detect and dig holes. This makes the file sparse in-place, without using extra disk space. The minimum size of the hole depends on filesystem I/O block size (usually 4096 bytes). Also, when using this option, B<--keep-size> is implied. If no range is specified by B<--offset> and B<--length>, then the entire file is analyzed for holes.
uk: Виявляти і усувати дірки. Це робитиме файл розрідженим на місці без використання зайвого місця на диску. Мінімальний розмір дірки залежить від розміру блоку введення-виведення файлової системи (зазвичай, він дорівнює 4096 байтів). Також, при використанні цього параметра неявним чином встановлюється B<--keep-size>. Якщо діапазон не вказано за допомогою B<--offset> і B<--length>, буде виконано виявлення дірок в усьому файлі.

source: You can think of this option as doing a "B<cp --sparse>" and then renaming the destination file to the original, without the need for extra disk space.
uk: Цей параметр можна вважати таким собі способом виконати B<cp --sparse>, а потім замістити файлом призначення початковий файл без потреби у додатковому місці на диску.

source: See B<--punch-hole> for a list of supported filesystems.
uk: Див. B<--punch-hole>, щоб ознайомитися зі списком підтримуваних файлових систем.

source: Insert a hole of I<length> bytes from I<offset>, shifting existing data.
uk: Вставити дірку довжиною I<довжина> байтів з позиції I<відступ>, зсунувши наявні дані.

source: B<-l>, B<--length> I<length>
uk: B<-l>, B<--length> I<довжина>

source: Specifies the length of the range, in bytes.
uk: Вказує довжину діапазону у байтах.

source: Do not modify the apparent length of the file. This may effectively allocate blocks past EOF, which can be removed with a truncate.
uk: Не змінювати видиму довжину файла. Насправді, може призвести до отримання блоків за EOF, які може бути вилучено обрізанням.

source: B<-o>, B<--offset> I<offset>
uk: B<-o>, B<--offset> I<відступ>

source: Specifies the beginning offset of the range, in bytes.
uk: Вказати початковий відступ діапазону у байтах.

source: Deallocates space (i.e., creates a hole) in the byte range starting at I<offset> and continuing for I<length> bytes. Within the specified range, partial filesystem blocks are zeroed, and whole filesystem blocks are removed from the file. After a successful call, subsequent reads from this range will return zeroes. This option may not be specified at the same time as the B<--zero-range> option. Also, when using this option, B<--keep-size> is implied.
uk: Скасувати розміщення (тобто створити дірку) у діапазоні байтів, який починається з I<відступ> і має розмір I<довжина> байтів. У вказаному діапазоні часткові блоки файлової системи буде занулено, а цілі блоки файлової системи вилучено з файла. Після успішного виклику наступні читання з вказаного діапазону файла повертатимуть нулі. Цей параметр не можна вказувати разом із параметром B<--zero-range>. Також при використанні цього параметра неявним чином встановлюється B<--keep-size>.

source: Supported for XFS (since Linux 2.6.38), ext4 (since Linux 3.0), Btrfs (since Linux 3.7), tmpfs (since Linux 3.5) and gfs2 (since Linux 4.16).
uk: Передбачено підтримку XFS (починаючи з Linux 2.6.38), ext4 (починаючи з Linux 3.0), Btrfs (починаючи з Linux 3.7), tmpfs (починаючи з Linux 3.5) і gfs2 (починаючи з Linux 4.16).

source: Enable verbose mode.
uk: Увімкнути докладний режим.

source: Enable POSIX operation mode. In that mode allocation operation always completes, but it may take longer time when fast allocation is not supported by the underlying filesystem.
uk: Увімкнути режим сумісності з POSIX. У цьому режимі дія із отримання пам'яті завжди завершується, але може тривати довше, якщо якщо у базовій системі не передбачено підтримки швидкого розміщення.

source: Zeroes space in the byte range starting at I<offset> and continuing for I<length> bytes. Within the specified range, blocks are preallocated for the regions that span the holes in the file. After a successful call, subsequent reads from this range will return zeroes.
uk: Записати нулями місце у діапазоні байтів від I<відступ_ довжиною _довжина> байтів. У вказаному діапазоні блоки буде попередньо отримано для областей, які займають у файлі дірки. Після успішного виклику наступні читання з цього діапазону даватимуть нулі.

source: Zeroing is done within the filesystem preferably by converting the range into unwritten extents. This approach means that the specified range will not be physically zeroed out on the device (except for partial blocks at the either end of the range), and I/O is (otherwise) required only to update metadata.
uk: Пріоритетним варіантом занулення у файловій системі є перетворення діапазону не незаписане розширення. Цей підхід передбачає, що вказаний діапазон не буде фізично записано нулями на пристрої (окрім часткових блоків на кінцях діапазону), а дії з введення-виведення будуть потрібні лише для оновлення метаданих.

source: Option B<--keep-size> can be specified to prevent file length modification.
uk: Може бути вказано параметр B<--keep-size> для запобігання зміні довжини файла.

source: Available since Linux 3.14 for ext4 (only for extent-based files) and XFS.
uk: Доступна з Linux 3.14 для ext4 (лише для файлів на основі розширення) і XFS.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: AUTHORS
uk: АВТОРИ

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<fallocate> command is part of the util-linux package which can be downloaded from
uk: B<fallocate> є частиною пакунка util-linux, який можна отримати з

source: April 2014
uk: Квітень 2014 року

source: B<fallocate -d> [B<-o> I<offset>] [B<-l> I<length>] I<filename>
uk: B<fallocate> B<-d> [B<-o> I<відступ>] [B<-l> I<довжина>] I<назва-файла>

source: B<fallocate -x> [B<-o> I<offset>] B<-l> I<length> I<filename>
uk: B<fallocate> B<-x> [B<-o> I<відступ>] B<-l> I<довжина назва-файла>

source: B<fallocate> is used to manipulate the allocated disk space for a file, either to deallocate or preallocate it. For filesystems which support the fallocate system call, preallocation is done quickly by allocating blocks and marking them as uninitialized, requiring no IO to the data blocks. This is much faster than creating a file by filling it with zeroes.
uk: B<fallocate> використовують для роботи із отриманим місцем на диску для файла — скасування отримання місця або попереднього отримання місця для нього. Для файлових систем, для яких передбачено підтримку системного виклику B<fallocate>(2), попереднє отримання місця буде виконано швидко отриманням блоків і позначенням їх як неініціалізованих, що не потребуватиме введення-виведення до блоків даних. Це набагато швидше за створення файла заповненням його нулями.

source: Removes a byte range from a file, without leaving a hole. The byte range to be collapsed starts at I<offset> and continues for I<length> bytes. At the completion of the operation, the contents of the file starting at the location I<offset>+I<length> will be appended at the location I<offset>, and the file will be I<length> bytes smaller. The option B<--keep-size> may not be specified for the collapse-range operation.
uk: Вилучає діапазон байтів з файла без залишення дірки. Діапазон байтів, який буде згорнуто, починатиметься із позиції I<відступ> і продовжуватиметься I<довжина> байтів. По завершенню дії вміст файла, що починається із позиції I<відступ>+I<довжина> буде дописано з позиції I<відступ>, а файл стане на I<довжина> байтів меншим. Якщо виконується дія із згортання діапазону, параметр B<--keep-size> не може бути вказано у рядку команди.

source: A filesystem may place limitations on the granularity of the operation, in order to ensure efficient implementation. Typically, offset and len must be a multiple of the filesystem logical block size, which varies according to the filesystem type and configuration. If a filesystem has such a requirement, the operation will fail with the error EINVAL if this requirement is violated.
uk: Файлова система може накладати обмеження на дискретизацію дії для того, щоб забезпечити ефективну реалізацію. Типово, відступ і довжина мають бути кратним до розміру логічного блоку файлової системи, який залежить від типу та налаштувань файлової системи. Якщо у файловій системі встановлено подібні обмеження, спроба виконання дії завершиться помилкою EINVAL при порушенні обмежень.

source: Detect and dig holes. This makes the file sparse in-place, without using extra disk space. The minimum size of the hole depends on filesystem I/O block size (usually 4096 bytes). Also, when using this option, B<--keep-size> is implied. If no range is specified by B<--offset> and B<--length>, then the entire file is analyzed for holes.
uk: Виявляти і усувати дірки. Це робитиме файл розрідженим на місці без використання зайвого місця на диску. Мінімальний розмір дірки залежить від розміру блоку введення-виведення файлової системи (зазвичай, він дорівнює 4096 байтів). Також, при використанні цього параметра неявним чином встановлюється B<--keep-size>. Якщо діапазон не вказано за допомогою B<--offset> і B<--length>, буде виконано виявлення дірок в усьому файлі.

source: B<-l>, B<--length >I<length>
uk: B<-l>, B<--length> I<довжина>

source: Do not modify the apparent length of the file. This may effectively allocate blocks past EOF, which can be removed with a truncate.
uk: Не змінювати видиму довжину файла. Насправді, може призвести до отримання блоків за EOF, які може бути вилучено обрізанням.

source: B<-o>, B<--offset >I<offset>
uk: B<-o>, B<--offset> I<відступ>

source: Deallocates space (i.e., creates a hole) in the byte range starting at I<offset> and continuing for I<length> bytes. Within the specified range, partial filesystem blocks are zeroed, and whole filesystem blocks are removed from the file. After a successful call, subsequent reads from this range will return zeroes. This option may not be specified at the same time as the B<--zero-range> option. Also, when using this option, B<--keep-size> is implied.
uk: Скасувати розміщення (тобто створити дірку) у діапазоні байтів, який починається з I<відступ> і має розмір I<довжина> байтів. У вказаному діапазоні часткові блоки файлової системи буде занулено, а цілі блоки файлової системи вилучено з файла. Після успішного виклику наступні читання з вказаного діапазону файла повертатимуть нулі. Цей параметр не можна вказувати разом із параметром B<--zero-range>. Також при використанні цього параметра неявним чином встановлюється B<--keep-size>.

source: Enable POSIX operation mode. In that mode allocation operation always completes, but it may take longer time when fast allocation is not supported by the underlying filesystem.
uk: Увімкнути режим сумісності з POSIX. У цьому режимі дія із отримання пам'яті завжди завершується, але може тривати довше, якщо якщо у базовій системі не передбачено підтримки швидкого розміщення.

source: Zeroes space in the byte range starting at I<offset> and continuing for I<length> bytes. Within the specified range, blocks are preallocated for the regions that span the holes in the file. After a successful call, subsequent reads from this range will return zeroes.
uk: Записати нулями місце у діапазоні байтів від I<відступ_ довжиною _довжина> байтів. У вказаному діапазоні блоки буде попередньо отримано для областей, які займають у файлі дірки. Після успішного виклику наступні читання з цього діапазону даватимуть нулі.

source: Zeroing is done within the filesystem preferably by converting the range into unwritten extents. This approach means that the specified range will not be physically zeroed out on the device (except for partial blocks at the either end of the range), and I/O is (otherwise) required only to update metadata.
uk: Пріоритетним варіантом занулення у файловій системі є перетворення діапазону не незаписане розширення. Цей підхід передбачає, що вказаний діапазон не буде фізично записано нулями на пристрої (окрім часткових блоків на кінцях діапазону), а дії з введення-виведення будуть потрібні лише для оновлення метаданих.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: The fallocate command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма fallocate є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: B<fallocate> is used to manipulate the allocated disk space for a file, either to deallocate or preallocate it. For filesystems which support the fallocate system call, preallocation is done quickly by allocating blocks and marking them as uninitialized, requiring no IO to the data blocks. This is much faster than creating a file by filling it with zeroes.
uk: B<fallocate> використовують для роботи із отриманим місцем на диску для файла — скасування отримання місця або попереднього отримання місця для нього. Для файлових систем, для яких передбачено підтримку системного виклику B<fallocate>(2), попереднє отримання місця буде виконано швидко отриманням блоків і позначенням їх як неініціалізованих, що не потребуватиме введення-виведення до блоків даних. Це набагато швидше за створення файла заповненням його нулями.

source: A filesystem may place limitations on the granularity of the operation, in order to ensure efficient implementation. Typically, offset and len must be a multiple of the filesystem logical block size, which varies according to the filesystem type and configuration. If a filesystem has such a requirement, the operation will fail with the error EINVAL if this requirement is violated.
uk: Файлова система може накладати обмеження на дискретизацію дії для того, щоб забезпечити ефективну реалізацію. Типово, відступ і довжина мають бути кратним до розміру логічного блоку файлової системи, який залежить від типу та налаштувань файлової системи. Якщо у файловій системі встановлено подібні обмеження, спроба виконання дії завершиться помилкою EINVAL при порушенні обмежень.
