Repository: sebras/manpages-l10n
Catalog: po/*/man1/fuser.1.po
Languages: pl

source: User Commands
pl: Polecenia użytkownika

source: NAME
pl: NAZWA

source: fuser - identify processes using files or sockets
pl: fuser - podaje procesy korzystające z plików lub gniazd

source: SYNOPSIS
pl: SKŁADNIA

source: B<fuser> [B<-fuv>] [B<-a>|B<-s>] [B<-4>|B<-6>] [B<-c>|B<-m>|B<-n> I<space>] [B<\ -k> [B<-i>] [B<-M>] [B<-w>] [B<->I<SIGNAL>] ] I<name> ...
pl: B<fuser> [B<-fuv>] [B<-a>|B<-s>] [B<-4>|B<-6>] [B<-c>|B<-m>|B<-n> I<przestrzeń>] [B<\ -k> [B<-i>] [B<-M>] [B<-w>] [B<->I<SYGNAŁ>] ] I<nazwa> ..."

source: DESCRIPTION
pl: OPIS

source: B<fuser> displays the PIDs of processes using the specified files or file systems. In the default display mode, each file name is followed by a letter denoting the type of access:
pl: B<fuser> wyświetla PID-y procesów, które korzystają z podanych plików lub systemów plików. W domyślnym trybie wyświetlania po każdej nazwie pliku występuje litera, oznaczająca rodzaj dostępu:

source: current directory.
pl: bieżący katalog.

source: executable being run.
pl: uruchomiony plik wykonywalny.

source: open file. B<f> is omitted in default display mode.
pl: otwarty plik. B<f> jest pomijane w domyślnym trybie wyświetlania.

source: open file for writing. B<F> is omitted in default display mode.
pl: plik otwarty do zapisu. B<F> jest pomijane w domyślnym trybie wyświetlania.

source: root directory.
pl: katalog główny.

source: mmap'ed file or shared library.
pl: mmap-owany plik lub biblioteka dzielona.

source: B<fuser> returns a non-zero return code if none of the specified files is accessed or in case of a fatal error. If at least one access has been found, B<fuser> returns zero.
pl: B<fuser> zwraca niezerowy kod, jeśli nie można było dostać się do żadnego z plików lub po błędzie krytycznym. Jeśli udał się dostęp do choćby jednego pliku, to B<fuser> zwraca zero.

source: In order to look up processes using TCP and UDP sockets, the corresponding name space has to be selected with the B<-n> option. By default B<fuser> will look in both IPv6 and IPv4 sockets. To change the default, behavior, use the B<-4> and B<-6> options. The socket(s) can be specified by the local and remote port, and the remote address. All fields are optional, but commas in front of missing fields must be present:
pl: Aby móc wyszukać procesy używające gniazd TCP lub UDP, trzeba za pomocą opcji B<-n> wybrać odpowiednią przestrzeń nazw. Domyślnie B<fuser> będzie szukać gniazd zarówno IPv6, jak i IPv4. Aby to zmienić, należy użyć opcji B<-4> i B<-6>. Gniazda mogą być określone przez podanie portów lokalnego i zdalnego oraz zdalnego adresu. Wszystkie pola są nieobowiązkowe, trzeba jednak podać przecinki poprzedzające opuszczone pola:

source: B<[>I<lcl_port>B<][>,B<[>I<rmt_host>B<][>,B<[>I<rmt_port>B<]]]>
pl: B<[>I<port_lokalny>B<][>,B<[>I<zdalny_komputer>B<][>,B<[>I<port_zdalny>B<]]]>

source: Either symbolic or numeric values can be used for IP addresses and port numbers.
pl: Adresy IP oraz numery portów mogą być podane albo w postaci symbolicznej, albo jako numery.

source: B<fuser> outputs only the PIDs to stdout, everything else is sent to stderr.
pl: B<fuser> wyświetla na standardowym wyjściu tylko identyfikatory procesów, wszystko inne jest wysyłane na standardowe wyjście błędów.

source: OPTIONS
pl: OPCJE

source: Show all files specified on the command line. By default, only files that are accessed by at least one process are shown.
pl: Pokazuje wszystkie pliki podane w linii komend. Domyślnie pokazywane są tylko pliki, do których dostęp uzyskał przynajmniej jeden proces.

source: Same as -m option, used for POSIX compatibility.
pl: To samo co opcja B<-m>. Używane w celu zachowania kompatybilności z POSIX-em.

source: Silently ignored, used for POSIX compatibility.
pl: Ignorowane. Używane w celu zachowania kompatybilności z POSIX-em.

source: Kill processes accessing the file. Unless changed with B<->I<SIGNAL>, SIGKILL is sent. An B<fuser> process never kills itself, but may kill other B<fuser> processes. The effective user ID of the process executing B<fuser> is set to its real user ID before attempting to kill.
pl: Zabija procesy korzystające z pliku. Jeśli nie jest użyta opcja B<->I<SYGNAŁ>, wysyłany jest SIGKILL. Proces B<fuser> nigdy sam siebie nie zabije, lecz może zabić inne procesy B<fuser>. Przed próbą zabicia, efektywny ID użytkownika procesu B<fuser> jest ustawiany na rzeczywisty ID.

source: Ask the user for confirmation before killing a process. This option is silently ignored if B<-k> is not present too.
pl: Przed zabiciem procesu, prosi użytkownika o potwierdzenie. Opcja ta jest ignorowana, jeżeli nie podano opcji B<-k>.

source: List all known signal names.
pl: Wyświetla wszystkie znane nazwy sygnałów.

source: B<-m> I<NAME>, B<--mount> I<NAME>
pl: B<-m> I<NAZWA>, B<--mount> I<NAZWA>

source: I<NAME> specifies a file on a mounted file system or a block device that is mounted. All processes accessing files on that file system are listed. If a directory file is specified, it is automatically changed to I<NAME>/. to use any file system that might be mounted on that directory.
pl: I<NAZWA> określa plik na zamontowanym systemie plików lub zamontowane urządzenie blokowe. Wszystkie korzystające z niego procesy zostaną wypisane. Jeśli podany plik jest katalogiem, to zmieniany jest automatycznie na I<NAZWA>/., aby używać dowolnego systemu plików, który mógłby być zamontowany w tym katalogu.

source: Request will be fulfilled only if I<NAME> specifies a mountpoint. This is an invaluable seatbelt which prevents you from killing the machine if I<NAME> happens to not be a filesystem.
pl: Żądanie będzie spełnione, jeśli I<NAZWA> oznacza punkt montowania. Jest to nieoceniony pas bezpieczeństwa chroniący przed zabiciem maszyny, jeśli okazałoby się, że I<NAZWA> nie jest systemem plików.

source: Kill only processes which have write access. This option is silently ignored if B<-k> is not present too.
pl: Zabija tylko te procesy, które mają dostęp w trybie do zapisu. Opcja ta jest ignorowana, jeżeli nie podano opcji B<-k>.

source: B<-n >I<SPACE>, B<--namespace> I<SPACE>
pl: B<-n >I<PRZESTRZEŃ>, B<--namespace> I<PRZESTRZEŃ>

source: Select a different name space. The name spaces B<file> (file names, the default), B<udp> (local UDP ports), and B<tcp> (local TCP ports) are supported. For ports, either the port number or the symbolic name can be specified. If there is no ambiguity, the shortcut notation I<name>B</>I<space> (e.g. I<80>B</>I<tcp>) can be used.
pl: Wybiera inną przestrzeń nazw. Dostępne są następujące przestrzenie nazw: B<file> (nazwy plików, ustawienie domyślne), B<udp> (lokalne porty UDP) i B<tcp> (lokalne porty TCP). Porty mogą być podane w postaci nazw symbolicznych albo jako numery. Jeżeli nie spowoduje to dwuznaczności, można użyć skróconej notacji I<nazwa>B</>I<przestrzeń> (np. I<80>B</>I<tcp>).

source: Silent operation. B<-u> and B<-v> are ignored in this mode. B<-a> must not be used with B<-s>.
pl: Ciche działanie. B<-u> i B<-v> są w tym trybie ignorowane. B<-a> nie może być użyta z B<-s>.

source: B<->I<SIGNAL>
pl: B<->I<SYGNAŁ>

source: Use the specified signal instead of SIGKILL when killing processes. Signals can be specified either by name (e.g. B<-HUP>)B<or>by number (e.g. B<-1>). This option is silently ignored if the B<-k> option is not used.
pl: Używa podanego sygnału zamiast SIGKILL do zabicia procesu. Sygnały można podawać albo za pomocą ich nazw (np. B<-HUP>) B<lub> przez liczbę (np. B<-1>). Opcja jest ignorowana, jeśli nie podano opcji B<-k>.

source: Append the user name of the process owner to each PID.
pl: Do każdego PID-a dodaj nazwę użytkownika, który jest jego właścicielem.

source: Verbose mode. Processes are shown in a B<ps>-like style. The fields PID, USER and COMMAND are similar to B<ps>. ACCESS shows how the process accesses the file. Verbose mode will also show when a particular file is being accessed as a mount point, knfs export or swap file. In this case B<kernel> is shown instead of the PID.
pl: Tryb gadatliwy. Procesy są pokazywane w stylu B<ps>(1). Pola PID, USER i COMMAND są podobne do tych w B<ps>. ACCESS pokazuje sposób dostępu do pliku. Tryb gadatliwy pokaże także pliki będące punktami montowania, eksportami knfs lub plikiem wymiany. W takim wypadku wartością pola PID będzie B<kernel>.

source: Display version information.
pl: Wyświetla informacje o wersji.

source: Search only for IPv4 sockets. This option must not be used with the B<-6> option and only has an effect with the tcp and udp namespaces.
pl: Wyszukuje tylko gniazda IPv4. Ta opcja nie może być używana łącznie z opcją B<-6>, a używanie jej ma efekt tylko z przestrzeniami nazw tcp i udp.

source: Search only for IPv6 sockets. This option must not be used with the B<-4> option and only has an effect with the tcp and udp namespaces.
pl: Wyszukuje tylko gniazda IPv6. Ta opcja nie może być używana łącznie z opcją B<-4>, a używanie jej ma efekt tylko z przestrzeniami nazw tcp i udp.

source: Reset all options and set the signal back to SIGKILL.
pl: Resetuje wszystkie opcje i ustawia sygnał z powrotem na SIGKILL.

source: FILES
pl: PLIKI

source: location of the proc file system
pl: położenie systemu plików proc

source: EXAMPLES
pl: PRZYKŁADY

source: kills all processes accessing the file system /home in any way.
pl: zabija wszystkie procesy, które w jakikolwiek sposób korzystają z systemu plików /home.

source: B<if fuser -s /dev/ttyS1; then :; else >I<something>B<; fi>
pl: B<if fuser -s /dev/ttyS1; then :; else >I<coś>B<; fi>

source: invokes I<something> if no other process is using /dev/ttyS1.
pl: wywołuje I<coś>, jeśli żaden inny proces nie używa I</dev/ttyS1>.

source: shows all processes at the (local) TELNET port.
pl: pokazuje wszystkie procesy nasłuchujące na (lokalnym) porcie TELNET.

source: RESTRICTIONS
pl: OGRANICZENIA

source: Processes accessing the same file or file system several times in the same way are only shown once.
pl: Procesy korzystające z tych samych plików lub systemu plików kilkukrotnie są wyświetlane tylko raz.

source: If the same object is specified several times on the command line, some of those entries may be ignored.
pl: Jeśli ten sam obiekt jest podany kilka razy w linii poleceń, to niektóre z tych wpisów mogą zostać zignorowane.

source: B<fuser> may only be able to gather partial information unless run with privileges. As a consequence, files opened by processes belonging to other users may not be listed and executables may be classified as mapped only.
pl: B<fuser> jest w stanie uzyskać tylko częściowe dane, chyba że ma się odpowiednie uprawnienia. Dlatego otwarte pliki należące do innych użytkowników mogą nie być wymienione, a pliki wykonywalne mogą być sklasyfikowane jako tylko zmapowane.

source: B<fuser> cannot report on any processes that it doesn't have permission to look at the file descriptor table for. The most common time this problem occurs is when looking for TCP or UDP sockets when running B<fuser> as a non-root user. In this case B<fuser> will report no access.
pl: B<fuser> nie może wyświetlić procesów, dla których nie ma praw do odczytu ich tabeli deskryptorów plików. Najczęściej ten problem występuje podczas wyszukiwania gniazd TCP lub UDP przez B<fuser> uruchomiony nie przez administratora systemu. W takim przypadku B<fuser> zgłosi brak dostępu.

source: Installing B<fuser> SUID root will avoid problems associated with partial information, but may be undesirable for security and privacy reasons.
pl: Instalowanie B<fuser> z SUID root zapobiegłoby problemom z częściowymi danymi, lecz mogłoby być niepożądane z przyczyn bezpieczeństwa.

source: B<udp> and B<tcp> name spaces, and UNIX domain sockets can't be searched with kernels older than 1.3.78.
pl: Przestrzenie nazw B<udp> i B<tcp> oraz gniazda domeny UNIX nie mogą być wyszukiwane, jeżeli wersja jądra jest mniejsza niż 1.3.78.

source: Accesses by the kernel are only shown with the B<-v> option.
pl: Informacje o tym, że to jądro systemu używa jakiegoś pliku, są wyświetlane tylko wtedy, gdy podano opcję B<-v>.

source: The B<-k> option only works on processes. If the user is the kernel, B<fuser> will print an advice, but take no action beyond that.
pl: Opcja B<-k> dotyczy tylko procesów. Jeżeli dany system plików używany jest przez jądro systemu, to B<fuser> wypisze ostrzeżenia, ale nie podejmie żadnej akcji.

source: BUGS
pl: BŁĘDY

source: fuser -m /dev/sgX will show (or kill with the -k flag) all processes, even if you don't have that device configured. There may be other devices it does this for too.
pl: fuser -m /dev/sgX pokaże (lub zabije, jeśli podano opcję -k) wszystkie procesy, nawet jeśli to urządzenie nie zostało skonfigurowane. Mogą istnieć inne urządzenia, które zachowają się podobnie.

source: SEE ALSO
pl: ZOBACZ TAKŻE
