Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Print I<NUM> lines of trailing context after matching lines. Places a line containing a group separator (B<-\^->) between contiguous groups of matches. With the B<-o> or B<-\^-only-matching> option, this has no effect and a warning is given.
fr: Afficher les I<N> lignes qui suivent celles contenant le motif. Une ligne contenant B<-\^-> est insérée entre les groupes contigus de correspondances. Avec l'option B<-o> ou B<-\^-only-matching>, ça n'a aucun effet et un avertissement est affiché.
nl: Toon I<NUM> regels van voorafgaande context na gevonden regels. Plaatst een regel die de groep scheider (B<-\^->) bevat tussen opeenvolgende groep van vondsten. Met de B<-o> of B<-\^-only-matching> optie, heeft dit geen effect en er zal een waarschuwing gegeven worden.
pl: Wyświetla I<LICZBĘ> wierszy z kontekstem, następujących po dopasowanych wierszach. Pomiędzy ciągłymi grupami dopasowań umieszczany jest wiersz zawierający separator grupy (B<-\^->). Nie działa z opcją B<-o> lub B<-\^-only-matching>, wyświetlane jest wówczas również ostrzeżenie.
pt_br: Emite I<NÚM> linhas de contexto à direita após as ocorrências. Coloca uma linha que contém um separador de grupo (B<-\^->) entre grupos contíguos de coincidências. Com a opção B<-o> ou B<-\^-only-matching>, isso não tem efeito e um aviso é dado.
uk: Виводить I<ЧИСЛО> рядків кінцевого контексту після відповідних рядків. Розміщує рядок із роздільником груп (B<-\^->) між безперервними групами збігів. З опцією B<-o> або B<-\^-only-matching> команда, про що виводиться попередження.

source: B<-B>I< NUM>,B< -\^-before-context=>I<NUM>
fr: B<-B> I<N>,B< -\^-before-context=>I<N>
nl: B<-B>I< AANTAL>,B< -\^-before-context=>I<AANTAL>
pl: B<-B>I< LICZBA>,B< -\^-before-context=>I<LICZBA>
pt_br: B<-B>I< NÚM>,B< -\^-before-context=>I<NÚM>
uk: B<-B>I<ЧИСЛО>,B< -\^-before-context=>I<ЧИСЛО>

source: Print I<NUM> lines of leading context before matching lines. Places a line containing a group separator (B<-\^->) between contiguous groups of matches. With the B<-o> or B<-\^-only-matching> option, this has no effect and a warning is given.
fr: Afficher les I<N> lignes qui précèdent celles contenant le motif. Une ligne contenant B<-\^-> est insérée entre les groupes contigus de correspondances. Avec l'option B<-o> ou B<-\^-only-matching>, ça n'a aucun effet et un avertissement est affiché.
nl: Toon I<NUM> regels van voorafgaande context na gevonden regels. Plaatst een regel die de groep scheider (B<-\^->) bevat tussen opeenvolgende groep van vondsten. Met de B<-o> of B<-\^-only-matching> optie, heeft dit geen effect en er zal een waarschuwing gegeven worden.
pl: Wyświetla I<LICZBĘ> wierszy z kontekstem, poprzedzających dopasowane wiersze. Pomiędzy ciągłymi grupami dopasowań umieszczany jest wiersz zawierający separator grupy (B<-\^->). Nie działa z opcją B<-o> lub B<-\^-only-matching>, wyświetlane jest wówczas również ostrzeżenie.
pt_br: Emite I<NÚM> linhas de contexto no início antes das ocorrências. Coloca uma linha que contém um separador de grupo (B<-\^->) entre grupos contíguos de coincidências. Com a opção B<-o> ou B<-\^-only-matching>, isso não tem efeito e um aviso é dado.
uk: Виводить I<ЧИСЛО> рядків початкового контексту перед відповідними рядками. Розміщує рядок із роздільником груп (B<-\^->) між безперервними групами збігів. З опцією B<-o> або B<-\^-only-matching> команда не працює, про що виводиться попередження.

source: B<-C>I< NUM>,B< ->I<NUM>,B< -\^-context=>I<NUM>
fr: B<-C> I<N>,B< ->I<N>,B< -\^-context=>I<N>
nl: B<-C>I< AANTAL>,B< ->I<AANTAL>,B< -\^-context=>I<AANTAL>
pl: B<-C>I< LICZBA>,B< ->I<LICZBA>,B< -\^-context=>I<LICZBA>
pt_br: B<-C>I< NÚM>,B< ->I<NÚM>,B< -\^-context=>I<NÚM>
uk: B<-C>I<ЧИСЛО>,B< ->I<ЧИСЛО>,B< -\^-context=>I<ЧИСЛО>

source: Print I<NUM> lines of output context. Places a line containing a group separator (B<-\^->) between contiguous groups of matches. With the B<-o> or B<-\^-only-matching> option, this has no effect and a warning is given.
fr: Afficher I<N> lignes de contexte. Une ligne contenant B<-\^-> est insérée entre les groupes contigus de correspondances. Avec l'option B<-o> ou B<-\^-only-matching>, ça n'a aucun effet et un avertissement est affiché.
nl: Toon I<NUM> regels context. Plaatst een regel die de groep scheider (B<-\^->) bevat tussen opeenvolgende groep van vondsten. Met de B<-o> of B<-\^-only-matching> optie, heeft dit geen effect en er zal een waarschuwing gegeven worden.
pl: Wyświetla I<LICZBĘ> wierszy z kontekstem. Pomiędzy ciągłymi grupami dopasowań umieszczany jest wiersz zawierający separator grupy (B<-\^->). Nie działa z opcją B<-o> lub B<-\^-only-matching>, wyświetlane jest wówczas również ostrzeżenie.
pt_br: Emite I<NÚM> linhas de saída do contexto. Coloca uma linha que contém um separador de grupo (B<-\^->) entre grupos contíguos de coincidências. Com a opção B<-o> ou B<-\^-only-matching>, isso não tem efeito e um aviso é dado.
uk: Виводить I<ЧИСЛО> рядків вихідного контексту. Розміщує рядок із роздільником груп (B<-\^->) між безперервними групами збігів. З опцією B<-o> або B<-\^-only-matching> команда не працює, про що виводиться попередження.

source: B<-\^-group-separator=>I<SEP>
pl: B<-\^-group-separator=>I<SEPARATOR>
uk: B<-\^-group-separator=>I<РОЗДІЛЬНИК>

source: When B<-A>, B<-B>, or B<-C> are in use, print I<SEP> instead of B<-\^-> between groups of lines.
fr: Quand les options B<-A>, B<-B> ou B<-C> sont utilisées, afficher I<SEP> à la place de B<-\^-> entre les groupes de lignes.
nl: Als B<-A>, B<-B> of B<-C> in gebruik zijn, druk dan I<SEP> af in plaats van B<-\^-> groepen van regels.
pl: Gdy użyto B<-A>, B<-B>, lub B<-C> wypisuje I<SEPARATOR> zamiast B<-\^-> pomiędzy grupami wierszy.
uk: Коли використовуються опції B<-A>, B<-B> або B<-C>, друкуйте I<РОЗДІЛЬНИК> замість B<-\^-> між групами рядків.

source: When B<-A>, B<-B>, or B<-C> are in use, do not print a separator between groups of lines.
fr: Quand les options B<-A>, B<-B> ou B<-C> sont utilisées, ne pas afficher de séparateur entre les groupes de lignes.
nl: Als B<-A>, B<-B> of B<-C> in gebruik zijn, druk dan geen scheidingsteken af tussen groepen van regels.
pl: Gdy użyto B<-A>, B<-B>, lub B<-C> nie wypisuje separatora pomiędzy grupami wierszy.
uk: Коли використовуються опції B<-A>, B<-B> або B<-C>, не друкуйте роздільник між групами рядків.

source: File and Directory Selection
fr: Sélection de fichiers ou répertoires
nl: Bestand en Map Selectie
pl: Wybór plików i katalogów
pt_br: Seleção de arquivo e diretório
uk: Вибір файлів і каталогів

source: Process a binary file as if it were text; this is equivalent to the B<-\^-binary-files=text> option.
fr: Traiter un fichier binaire comme s'il s'agissait de texte\ ; c'est l'équivalent de l'option B<-\^-binary-files=text>.
nl: Verwerk een binair bestand alsof het tekst was; dit is equivalent aan de B<-\^-binary-files=text> optie.
pl: Przetwarza plik binarny tak, jakby był on plikiem tekstowym; jest to odpowiednik opcji B<-\^-binary-files=text>.
pt_br: Processa um arquivo binário como se fosse texto; isso é equivalente à opção B<-\^-binary-files=text>.
uk: Двійковий файл обробляється так, ніби це текст; це еквівалентно параметру B<-\^-binary-files=text>.

source: B<-\^-binary-files=>I<TYPE>
nl: B<-\^-binary-files=>I<SOORT>
pl: B<-\^-binary-files=>I<TYP>
pt_br: B<-\^-binary-files=>I<TIPO>
uk: B<-\^-binary-files=>I<ТИП>

source: If a file's data or metadata indicate that the file contains binary data, assume that the file is of type I<TYPE>. Non-text bytes indicate binary data; these are either output bytes that are improperly encoded for the current locale, or null input bytes when the B<-z> option is not given.
fr: Si les données ou les métadonnées d'un fichier indiquent qu'il contient des données binaires, supposer que le fichier est de type I<TYPE>. Les données non textuelles indiquent que le fichier est binaire ; ce sont soit des octets affichés mal encodés pour la locale, soit des octets NULL quand l'option B<-z> n'est pas donnée.
nl: Als de data of metadata van een bestand aangeeft dat het bestand binaire data bevat, neem dan aan de het bestand van type I<TYPE> is. Niet-tekst bytes geven binaire data aan; dit zijn ofwel uit voer bytes die niet goed gecodeerd zijn voor de huidige locale , of nul invoer bytes indien de B<-z> optie niet opgegeven werd.
pl: Jeżeli dane lub metadane pliku wskazują na to, że zawiera on dane binarne, zakłada, że jest on typu I<TYP>. Bajty nietekstowe oznaczają dane binarne; są to albo niepoprawnie zakodowane znaki, albo bajty wejściowe null, kiedy opcja B<-z> nie została użyta.
pt_br: Se os dados ou metadados de um arquivo indicarem que o arquivo contém dados binários, supõe que o arquivo seja do tipo I<TIPO>. Bytes sem texto indicam dados binários; esses são bytes de saída codificados incorretamente para o código do idioma atual ou bytes de entrada nulos quando a opção B<-z> não é fornecida.
uk: Якщо дані або метадані файлу вказують, що цей файл містить двійкові дані, припускається що файл має тип I<ТИП>. Нетекстові байти вказують на двійкові дані; це або вихідні байти, які неправильно закодовані для поточної локалі, або нульові вхідні байти, якщо параметр B<-z> не заданий.

source: By default, I<TYPE> is B<binary>, and B<grep> suppresses output after null input binary data is discovered, and suppresses output lines that contain improperly encoded data. When some output is suppressed, B<grep> follows any output with a one-line message saying that a binary file matches.
fr: Par défaut, I<TYPE> est un B<binary> et B<grep> supprime l'affichage après avoir trouvé des données NULL dans le binaire d’entrée et il supprime les lignes qui contiennent des données mal encodées. Lorsqu'une partie de la sortie est supprimée, B<grep> fait suivre n’importe quelle sortie par un message d’une ligne informant de la correspondance d’un fichier binaire.
nl: Standaard zullen I<SOORT> B<binair>, en B<grep> uitvoer onderdrukken na een het ontdekken van een nul in de binaire invoer, en ook uitvoer regels onderdrukken die ongeldige gecodeerde data bevatten. Indien uitvoer werd onderdrukt, dan zal B<grep> zal de uitvoer voorzien van een bericht met de mededeling dat een binair bestand gevonden werd.
pl: Domyślnym I<TYPEM> jest B<binary>, a B<grep> przerywa zwracanie wyników gdy wykryje binarny null w danych wejściowych oraz blokuje na wyjściu linie, które zawierają źle sformatowane dane. Gdy część wyjścia jest zablokowana, B<grep> kończy każdy wynik jednowierszową wiadomością informującą, że plik binarny pasuje do wzorca.
pt_br: Por padrão, I<TIPO> é B<binary> e B<grep> inibe a saída após a descoberta de dados binários de entrada nula e inibe linhas de saída que contêm dados codificados incorretamente. Quando alguma saída é inibida, B<grep> segue qualquer saída com uma mensagem de uma linha dizendo que um arquivo binário coincide.
uk: Стандартним значенням I<ТИП> є B<binary>, а B<grep> придушує виведення після виявлення нульових вхідних двійкових даних і пригнічує вихідні рядки, які містять неправильно закодовані дані. Коли деякий вихід пригнічено, B<grep> виводить повідомлення, що цей файл є двійковим "binary file matches".

source: If I<TYPE> is B<without-match>, when B<grep> discovers null input binary data it assumes that the rest of the file does not match; this is equivalent to the B<-I> option.
fr: Si I<TYPE> vaut B<without-match>, quand B<grep> trouve des données NULL de binaire d’entrée, il suppose que le reste du fichier ne correspond pas à la recherche ; c'est un équivalent de l'option B<-I>.
nl: Als I<SOORT> B<without-match> is, dan zal wanneer B<grep> nul invoer binaire data ontdekt het aanneemt dat de rest van het bestand niet overeenkomt; dit is gelijk aan de B<-I> optie.
pl: Jeżeli I<TYPEM> jest B<without-match>, to kiedy grep wykryje, że wejście zawiera binarny null, zakłada, że reszta pliku nie pasuje. Jest to odpowiednik opcji B<-I>.
pt_br: Se I<TIPO> for B<without-match>, quando B<grep> descobre dados binários de entrada nula, ele presume que o restante do arquivo não coincide; isso é equivalente à opção B<-I>.
uk: Якщо I<ТИП> є B<without-match>, коли B<grep> виявляє нульові вхідні двійкові дані, вважатиметься що жодний файл не є двійковим, це відповідає опції B<-I>..

source: If I<TYPE> is B<text>, B<grep> processes a binary file as if it were text; this is equivalent to the B<-a> option.
fr: Si I<TYPE> vaut B<text>, B<grep> traite un fichier binaire comme un fichier texte ; c'est un équivalent de l'option B<-a>.
nl: Als I<SOORT> B<text> is, dan verwerkt B<grep> een binair bestand alsof het tekst was; dit is gelijk aan de B<-a> optie.
pl: Jeżeli I<TYPEM> jest B<text>, to B<grep> przetwarza plik binarny tak, jakby był on plikiem tekstowym; jest to odpowiednik opcji B<-a>.
pt_br: Se I<TIPO> for B<text>, B<grep> processa um arquivo binário como se fosse texto; isso é equivalente à opção B<-a>.
uk: Якщо I<ТИП> є B<text>, B<grep> обробляє двійковий файл так, ніби це текст; це еквівалентно параметру B<-a>.

source: When I<type> is B<binary>, B<grep> may treat non-text bytes as line terminators even without the B<-z> option. This means choosing B<binary> versus B<text> can affect whether a pattern matches a file. For example, when I<type> is B<binary> the pattern B<q$ might> match B<q> immediately followed by a null byte, even though this is not matched when I<type> is B<text>. Conversely, when I<type> is B<binary> the pattern B<.\&> (period) might not match a null byte.
fr: Quand I<type> est B<binary>, B<grep> peut traiter des données non textuelles comme des marqueurs de fin de ligne même sans l'option B<-z>. Cela signifie que le choix B<binary> versus B<text> peut influer sur la correspondance d'un motif à un fichier. Par exemple, quand I<type> est B<binary>, le motif B<q$ might> correspond à un B<q> suivi immédiatement d'un octet NULL, alors que cela ne correspond à rien quand I<type> est B<text>. À l'inverse, quand I<type> est B<binary>, B<.\&> (point) pourrait ne pas trouver d'octet NULL.
nl: Wanneer I<SOORT> B<binary> is, dan kan B<grep> niet-tekst bytes als regel einden behandelen zelfs zonder de B<-z> optie is. Dit betekent dat B<binary> versus B<text> kan beïnvloeden dat een patroon op een bestand past. Bijvoorbeeld, wanneer I<SOORT> gelijk is aan B<binary> dan B<q$ kan> patroon overeenkomen met B<q> onmiddellijk gevolgd door een nul-byte, zelfs als die niet past wanneer I<SOORT> gelijk is aan B<text>. Andersom, wanneer I<SOORT> is B<binary> dan komt B<.\&> (period) niet overeen met een nul byte.
pl: Kiedy I<TYP> ma wartość B<binary>, B<grep> może traktować bajty nietekstowe jako zakończenia wierszy nawet bez opcji B<-z>. To oznacza, że wybór między B<binary> a B<text> może wpływać na to, czy wzorzec pasuje do pliku. Na przykład, kiedy I<TYPEM> jest B<binary>, to wzorzec B<q$> może pasować do B<q> po którym niespodziewanie następuje bajt null, nawet jeśli te wzorce nie zostałaby dopasowane, gdyby I<TYPEM> był B<text>. I odwrotnie, kiedy I<TYPEM> jest B<binary>, wzorzec B<.\&> (kropka) może nie zgadzać się z bajtem null.
pt_br: Quando I<tipo> é B<binary>, B<grep> pode tratar bytes, que não sejam de texto, como terminadores de linha, mesmo sem a opção B<-z>. Isso significa que escolher B<binary> em vez de B<text> pode afetar se um padrão coincide com um arquivo. Por exemplo, quando I<tipo> é B<binary>, o padrão B<q$ might> coincide com B<q> imediatamente seguido por um byte nulo, mesmo que isso não coincida quando I<tipo> é B<text>. Por outro lado, quando I<tipo> é B<binary>, o padrão B<.\&> (ponto) pode não coincidir a um byte nulo.
uk: Коли I<тип> є B<binary>, B<grep> може розглядати нетекстові блоки як команди терміналу навіть без параметра B<-z>. Це означає, що вибір B<binary> замість B<text> може вплинути на те, чи відповідає шаблон файлу. Наприклад, коли I<тип> є B<binary>, зразок B<q$ might> відповідатиме B<q>, за яким одразу слідує нульовий байт, навіть якщо він не збігається, коли I<тип> є B<text>.

source: I<Warning:> The B<-a> option might output binary garbage, which can have nasty side effects if the output is a terminal and if the terminal driver interprets some of it as commands. On the other hand, when reading files whose text encodings are unknown, it can be helpful to use B<-a> or to set B<LC_ALL='C'> in the environment, in order to find more matches even if the matches are unsafe for direct display.
fr: I<Attention :> l'option B<-a> pourrait afficher des déchets de binaire et avoir des effets indésirables si la sortie est le terminal et que le pilote du terminal les interprète comme des commandes. D'un autre côté, quand on lit des fichiers à l'encodage inconnu, il peut être utile d'utiliser B<-a> ou de définir B<LC_ALL='C'> dans l'environnement pour trouver plus de correspondances même si certaines ne sont pas sécurisées pour un affichage direct.
nl: I<Waarschuwing:> B<grep \-\^\-binary-files=text> kan binaire onzin genereren, wat vervelende bijeffecten kan hebben als de uitvoer naar een terminal gaat en als de terminal driver deze interpreteert als een commando. Aan de andere kant, als bestanden gelezen worden waarvan de codering onbekend is, dan kan het helpen om B<-a> op te geven of om B<LC_ALL=C> in de omgeving te zetten, om zo meer overeenkomsten te vinden zelfs als deze niet veilig zijn om meteen te tonen.
pl: I<Ostrzeżenie:> Opcja B<-a> może zwrócić binarny śmietnik, co może mieć nieprzyjemne skutki, jeżeli wyjściem jest terminal, a sterownik terminala zinterpretuje to wszystko jako polecenia. Z drugiej jednak strony, czytając pliki, których kodowanie tekstu pozostaje nieznane, przydatne może być użycie B<-a> lub ustawienie zmiennej B<LC_ALL='C'> w środowisku, aby znaleźć więcej dopasowań, nawet jeśli ich bezpośrednie wyświetlenie byłoby niebezpieczne.
pt_br: I<Aviso:> A opção B<-a> pode gerar lixo binário, que pode ter efeitos colaterais desagradáveis se a saída for um terminal e se o driver do terminal interpretar alguns deles como comandos. Por outro lado, ao ler arquivos cujas codificações de texto são desconhecidas, pode ser útil usar B<-a> ou definir B<LC_ALL='C'> no ambiente, para encontrar ocorrências, mesmo que estas não sejam seguras para exibição direta.
uk: I<Попередження:> Опція B<-a> може виводити двійкове сміття, що може мати неприємні побічні ефекти, якщо результат виводиться у термінал і движок терміналу інтерпретує це як команди. З іншого боку, під час читання файлів, кодування тексту яких невідомі, може бути корисним використовувати B<-a> або встановити у середовищі B<LC_ALL='C'>, щоб знайти більше збігів, навіть якщо збіги небезпечні для прямого показу.

source: B<-D>I< ACTION>,B< -\^-devices=>I<ACTION>
nl: B<-D>I< ACTIE>,B< -\^-devices=>I<ACTIE>
pl: B<-D>I< DZIAŁANIE>,B< -\^-devices=>I<DZIAŁANIE>
pt_br: B<-D>I< AÇÃO>,B< -\^-devices=>I<AÇÃO>
uk: B<-D>I< ДІЯ>,B< -\^-devices=>I<ДІЯ>

source: If an input file is a device, FIFO or socket, use I<ACTION> to process it. By default, I<ACTION> is B<read>, which means that devices are read just as if they were ordinary files. If I<ACTION> is B<skip>, devices are silently skipped.
fr: Si le fichier est un périphérique, une FIFO ou une socket, utiliser I<ACTION> dessus. Par défaut, I<ACTION> est B<read> (lecture), ce qui signifie que les périphériques sont lus comme des fichiers normaux. Si I<ACTION> est B<skip>, les périphériques sont ignorés en silence.
nl: Als het invoer bestand een apparaat is, FIFO of socket, gebruik dan I<ACTIE> om het te verwerken. Standaard, I<ACTIE> is B<read>, hetgeen betekent dat apparaten gelezen worden net als dat het normale bestanden waren. Als I<ACTIE> is B<skip> dan worden apparaten overgeslagen.
pl: Jeśli plik wejściowy jest urządzeniem, kolejką FIFO lub gniazdem, używa I<DZIAŁANIA> do przetworzenia go. Domyślnym I<DZIAŁANIEM> jest B<read>, co znaczy, że urządzenia są odczytywane dokładnie tak samo, jak gdyby były zwykłymi plikami. Jeśli wartością I<DZIAŁANIA> jest B<skip>, to urządzenia są po cichu pomijane.
pt_br: Se um arquivo de entrada for um dispositivo, FIFO ou soquete, usa I<AÇÃO> para processá-lo. Por padrão, I<AÇÃO> é B<read>, o que significa que os dispositivos são lidos como se fossem arquivos comuns. Se I<AÇÃO> for B<skip>, os dispositivos serão ignorados silenciosamente.
uk: Якщо вхідний файл є пристроєм, FIFO або сокетом, використовуйте I<ДІЯ> для обробки вводу. Типово, I<ДІЯ> має значення B<read>, це означає, що пристрої читаються так само, ніби звичайні файли. Якщо I<ДІЯ> має значення B<skip>, пристрої ігноруються.

source: B<-d>I< ACTION>,B< -\^-directories=>I<ACTION>
nl: B<-d>I< ACTIE>,B< -\^-directories=>I<ACTIE>
pl: B<-d>I< DZIAŁANIE>,B< -\^-directories=>I<DZIAŁANIE>
pt_br: B<-d>I< AÇÃO>,B< -\^-directories=>I<AÇÃO>
uk: B<-d>I< ДІЯ>,B< -\^-directories=>I<ДІЯ>

source: If an input file is a directory, use I<ACTION> to process it. By default, I<ACTION> is B<read>, i.e., read directories just as if they were ordinary files. If I<ACTION> is B<skip>, silently skip directories. If I<ACTION> is B<recurse>, read all files under each directory, recursively, following symbolic links only if they are on the command line. This is equivalent to the B<-r> option.
fr: Si le fichier est un répertoire, utiliser I<ACTION>. Par défaut, I<ACTION> est B<read>, ce qui signifie que les répertoires sont lus comme des fichiers normaux. Si I<ACTION> est B<skip>, les répertoires sont ignorés et aucun message n'est affiché. Si I<ACTION> est B<recurse>, B<grep> lit tous les fichiers présents dans chaque répertoire, récursivement, en ne suivant que les liens symboliques indiqués sur la ligne de commande. C'est équivalent à l'option B<-r>.
nl: Als een invoer bestand een map is, gebruik I<ACTIE> om het te verwerken. Normaal is I<ACTIE> B<read>, wat betekend dat mappen gelezen worden alsof het gewone bestanden waren. Als I<ACTIE> B<skip> is, worden mappen in stilte overgeslagen. Als I<ACTIE> B<recurse> is, leest B<grep> alle bestanden in elke map, recursief, alleen symbolische koppelingen volgend als die op de commando regel stonden. Dit is gelijk aan de B<-r> optie.
pl: Jeśli plik wejściowy jest katalogiem, używa I<DZIAŁANIA> do przetworzenia go. Domyślnym I<DZIAŁANIEM> jest B<read>, tzn. odczytywanie katalogów dokładnie tak samo, jak gdyby były zwykłymi plikami. Jeśli wartością I<DZIAŁANIA> jest B<skip>, to urządzenia są po cichu pomijane. Jeśli I<DZIAŁANIEM> jest B<recurse>, odczytywane są rekurencyjnie wszystkie pliki w danym katalogu, podążając za dowiązaniami symbolicznymi wyłącznie wtedy, gdy zostały podane w wierszu polecenia. Jest to równoważne podaniu opcji B<-r>.
pt_br: Se um arquivo de entrada for um diretório, usa I<AÇÃO> para processá-lo. Por padrão, I<AÇÃO> é B<read>, ou seja, lê os diretórios como se fossem arquivos comuns. Se I<AÇÃO> for B<skip>, pula silenciosamente os diretórios. Se I<AÇÃO> for B<recurse>, lê todos os arquivos em cada diretório, recursivamente, seguindo os links simbólicos apenas se estiverem na linha de comando. Isso é equivalente à opção B<-r>.
uk: Якщо вхідний файл є каталогом, використовуйте для його обробки I<ДІЯ>. Типовим значенням I<ДІЯ> є B<read>, тобто читати каталоги так, як якщо б вони були звичайними файлами. Якщо I<ДІЯ> є B<skip>, каталоги пропускаються "мовчки". Якщо I<ДІЯ> є B<recurse>, всі файли в кожному каталозі читаються рекурсивно, з переходом за символічними посиланнями, лише якщо вони знаходяться в командному рядку. Це подібно параметру B<-r>.

source: B<-\^-exclude=>I<GLOB>
nl: B<-\^-exclude=>I<BESTANDSPATROON>
pl: B<-\^-exclude=>I<WZORZEC>
uk: B<-\^-exclude=>I<ШАБЛОН ПОШУКУ>
