Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Boolean value that reverses (swaps) the meanings of the B<sl=> and B<cx=> capabilities when the B<-v> command-line option is specified. The default is false (i.e., the capability is omitted).
fr: Valeur booléenne qui inverse la signification des capacités B<sl=> et B<cx=> quand l’option de ligne de commande B<-v> est indiquée. La valeur par défaut est le booléen faux (c'est-à-dire la capacité est omise).
nl: Logische waarde dat de betekenis omdraait van de B<sl=> and B<cx=> capabilities indien de B<-v> command-regel optie werd gespecificeerd. De standaard is ONWAAR (m.a.w. the capaciteit is weggelaten).
pl: Wartość logiczna, która odwraca znaczenie możliwości B<sl=> i B<cx=>, kiedy podano opcję wiersza poleceń B<-v>. Domyślnie jest ustawiona na fałsz (tzn. możliwość jest pominięta).
pt_br: Valor booleano que reverte (troca) os significados dos recursos B<sl=> e B<cx=> quando a opção da linha de comandos B<-v> é especificada. O padrão é falso (ou seja, o recurso é omitido).
uk: Логічне значення, яке змінює (міняє місцями) значення можливостей B<sl=> і B<cx=>, коли вказано параметр командного рядка B<-v>. Типово — false (тобто можливість пропущена).

source: SGR substring for matching non-empty text in any matching line (i.e., a selected line when the B<-v> command-line option is omitted, or a context line when B<-v> is specified). Setting this is equivalent to setting both B<ms=> and B<mc=> at once to the same value. The default is a bold red text foreground over the current line background.
fr: Sous-chaîne SGR pour le texte non vide qui correspond dans les lignes qui correspondent (c'est-à-dire une ligne sélectionnée quand l'option en ligne de commande B<-v> n'est pas utilisée, ou une ligne de contexte quand B<-v> est spécifiée). L'utiliser est équivalent à utiliser à la fois B<ms=> et B<mc=> avec la même valeur. La valeur par défaut correspond à du texte rouge en gras sur le fond de la ligne actuelle.
nl: SGR sub-tekst voor passende niet-lege tekst in ieder passend regel (m.a.w., een geselecteerde regel wanneer de B<-v> commando-regel optie werd weggelaten, of een context regel als B<-v> werd opgegeven. Deze instelling is equivalent aan het instellen van B<ms=> en B<mc=> in een keer op dezelfde waarde. De standaard is vette rode tekst in de voorgrond tegen de bestaande regel achtergrond.
pl: Podciąg SGR (zob. niżej) do pasującego, niepustego tekstu w dowolnym pasującym wierszu (tzn. wybranego wiersza, jeśli nie podano opcji wiersza poleceń B<-v> lub wiersza kontekstu w przeciwnym wypadku). Ustawienie go jest odpowiednikiem podania B<ms=> i B<mc=> z tą samą wartością. Domyślnie jest to czerwony, pogrubiony tekst na aktualnym tle wiersza.
pt_br: Parte de texto de SGR para coincidir com um texto não vazio em qualquer ocorrência (ou seja, uma linha selecionada quando a opção de linha de comando B<-v> for omitida ou uma linha de contexto quando B<-v> for especificado). Definir isso é equivalente a definir B<ms=> e B<mc=> de uma só vez para o mesmo valor. O padrão é um primeiro plano em texto em negrito sobre o plano de fundo da linha atual.
uk: Підрядок SGR для збігу непорожнього тексту в будь-якому відповідному рядку (тобто виділений рядок, коли параметр командного рядка B<-v> опущено, або контекстний рядок, коли вказано B<-v>). Це налаштування еквівалентно одночасному встановленню одного значення для B<ms=> і B<mc=>. Типово — напівжирний червоний текст на поточному фоні рядка.

source: SGR substring for matching non-empty text in a selected line. (This is only used when the B<-v> command-line option is omitted.) The effect of the B<sl=> (or B<cx=> if B<rv>) capability remains active when this kicks in. The default is a bold red text foreground over the current line background.
fr: Sous-chaîne SGR pour le texte non vide qui correspond dans une ligne sélectionnée (ce n'est utilisé que quand l'option en ligne de commande B<-v> n'est pas utilisée). L'effet de la capacité B<sl=> (ou B<cx=> si B<rv> est activée) reste actif quand c'est utilisé. La valeur par défaut correspond à du texte rouge en gras sur le fond de la ligne actuelle.
nl: SGR sub-tekst voor passende niet-lege tekst in een passende regel (dit wordt alleen gebruikt als de B<-v> commando-regel optie werd weggelaten.) Het effect van de B<sl=> (of B<cx=> als B<rv>) capaciteit blijft actief wanneer dit optreedt. De standaard is vette rode tekst in de voorgrond tegen de bestaande regel achtergrond.
pl: Podciąg SGR do pasującego, niepustego tekstu w wybranym wierszu (jest używana tylko jeśli nie podano opcji wiersza poleceń B<-v>). Efekt możliwości B<sl=> (lub B<cx=> w przypadku B<rv>) pozostaje aktywny. Domyślnie jest to czerwony, pogrubiony tekst na aktualnym tle wiersza.
pt_br: Parte de texto de SGR para coincidir com um texto não vazio em uma linha selecionada. (Isso é usado apenas quando a opção de linha de comando B<-v> é omitida.) O efeito do recurso B<sl=> (ou B<cx=> se B<rv>) permanece ativo quando isso ocorre. O padrão é um primeiro plano em texto em negrito sobre o plano de fundo da linha atual.
uk: Підрядок SGR для збігу непорожнього тексту у виділеному рядку. (Використовується лише тоді, коли параметр командного рядка B<-v> опущено.) Ефект від можливості B<sl=> (або B<cx=>, якщо B<rv>) залишається активним, коли команда повторюється. Типово — напівжирний червоний текст на поточному фоні рядка.

source: SGR substring for matching non-empty text in a context line. (This is only used when the B<-v> command-line option is specified.) The effect of the B<cx=> (or B<sl=> if B<rv>) capability remains active when this kicks in. The default is a bold red text foreground over the current line background.
fr: Sous-chaîne SGR pour le texte non vide qui correspond dans les lignes de contexte (ce n'est utilisé que quand l'option en ligne de commande B<-v> n'est pas utilisée). L'effet de la capacité B<cx=> (ou B<sl=> si B<rv> est activée) reste actif quand c'est utilisé. La valeur par défaut correspond à du texte rouge en gras sur le fond de la ligne actuelle.
nl: SGR sub-tekst voor passende niet-lege tekst in een context regel (dit wordt alleen gebruikt als de B<-v> commando-regel optie werd gegeven.) Het effect van de B<cx=> (of B<sl=> als B<rv>) capaciteit blijft actief wanneer dit optreedt. De standaard is vette rode tekst in de voorgrond tegen de bestaande regel achtergrond.
pl: Podciąg SGR do pasującego, niepustego tekstu w wierszu kontekstu (jest używana tylko jeśli podano opcję wiersza poleceń B<-v>). Efekt możliwości B<cx=> (lub B<sl=> w przypadku B<rv>) pozostaje aktywny. Domyślnie jest to czerwony, pogrubiony tekst na aktualnym tle wiersza.
pt_br: Parte de texto de SGR para coincidir com um texto não vazio em uma linha de contexto. (Isso é usado apenas quando a opção de linha de comando B<-v> é especificada.) O efeito do recurso B<cx=> (ou B<sl=> se B<rv>) permanece ativo quando isso ocorre. O padrão é um primeiro plano em texto em negrito sobre o plano de fundo da linha atual.
uk: Підрядок SGR для збігу непорожнього тексту в контекстному рядку. (Використовується лише тоді, коли вказано параметр командного рядка B<-v>.) Ефект від можливості B<cx=> (або B<sl=>, якщо B<rv>) залишається активним, коли команда. Типово — напівжирний червоний текст на поточному фоні рядка.

source: SGR substring for file names prefixing any content line. The default is a magenta text foreground over the terminal's default background.
fr: Sous-chaîne SGR pour les noms de fichier qui préfixent les lignes de contenu. La valeur par défaut correspond à du texte de couleur magenta sur le fond par défaut du terminal.
nl: SGR sub-tekst voor bestandsnamen die vooraf gaan aan een regel inhoud. De standaard is magenta tekst voorgrond tegen de standaard terminal achtergrond.
pl: Podciąg SGR do nazw plików poprzedzających wszystkie wiersze zawartości. Domyślnie jest to purpurowy tekst na domyślnym tle terminala.
pt_br: Parte de texto de SGR para nomes de arquivos que prefixam qualquer linha de conteúdo. O padrão é um texto em primeiro plano de magenta sobre o plano de fundo padrão do terminal.
uk: Підрядок SGR для назв файлів із префіксом рядка будь-якого вмісту. За замовчуванням текст пурпурового кольору на фоні терміналу.

source: SGR substring for line numbers prefixing any content line. The default is a green text foreground over the terminal's default background.
fr: Sous-chaîne SGR pour les numéros de ligne qui préfixent les lignes de contenu. La valeur par défaut correspond à du texte de couleur vert sur le fond par défaut du terminal.
nl: SGR sub-tekst voor regel nummer die vooraf gaan aan een regel inhoud. De standaard is groene tekst voorgrond tegen de standaard terminal achtergrond.
pl: Podciąg SGR do numerów wierszy poprzedzających wszystkie wiersze zawartości. Domyślnie, jest to zielony tekst na domyślnym tle terminala.
pt_br: Parte de texto de SGR para números de linhas que prefixam qualquer linha de conteúdo. O padrão é um texto em primeiro plano verde sobre o plano de fundo padrão do terminal.
uk: Підрядок SGR для номерів рядків із префіксом рядка будь-якого вмісту. За замовчуванням текст зеленого кольору на фоні терміналу за замовчуванням.

source: SGR substring for byte offsets prefixing any content line. The default is a green text foreground over the terminal's default background.
fr: Sous-chaîne SGR pour les emplacements qui préfixent les lignes de contenu. La valeur par défaut correspond à du texte de couleur vert sur le fond par défaut du terminal.
nl: SGR sub-tekst voor byte posities die vooraf gaan aan een regel inhoud. De standaard is groene tekst voorgrond tegen de standaard terminal achtergrond.
pl: Podciąg SGR do offsetu bajtowego poprzedzającego wszystkie wiersze zawartości. Domyślnie, jest to zielony tekst na domyślnym tle terminala.
pt_br: Parte de texto de SGR para posições de bytes que prefixam qualquer linha de conteúdo. O padrão é um texto em primeiro plano verde sobre o plano de fundo padrão do terminal.
uk: Підрядок SGR для байтових зміщень із префіксом рядка будь-якого вмісту. За замовчуванням текст зеленого кольору на фоні терміналу за замовчуванням.

source: SGR substring for separators that are inserted between selected line fields (B<:>), between context line fields, (B<->), and between groups of adjacent lines when nonzero context is specified (B<-\^->). The default is a cyan text foreground over the terminal's default background.
fr: Sous-chaîne SGR pour les séparateurs qui sont insérés entre les champs des lignes sélectionnées (B<:>), entre les champs des lignes de contexte (B<->) et entre les groupes de lignes adjacentes quand un contexte non nul est spécifié (B<-\^->). La valeur par défaut correspond à du texte de couleur cyan sur le fond par défaut du terminal.
nl: SGR sub-tekst voor scheiders die zijn ingevoegd tussen geselecteerde regel velden (B<:>, tussen context regel velden, (B<->, en tussen groepen van aansluitende regels als een niet-lege context werd opgegeven (B<-\^->). De standaard is cyaan tekst voorgrond tegen de standaard terminal achtergrond.
pl: Podciąg SGR do separatorów wstawianych pomiędzy wybranymi polami wiersza (B<:>), pomiędzy polami wierszy kontekstu (B<-> i pomiędzy grupami przyległych wierszy, jeśli wybrano niezerowy kontekst (B<-\^->). Domyślnie jest to cyjanowy tekst na domyślnym tle terminala.
pt_br: Parte de texto de SGR para separadores que são inseridos entre os campos de linha selecionados (B<:>), entre os campos de linha de contexto, (B<->) e entre grupos de linhas adjacentes quando um contexto diferente de zero é especificado (B<-\^->). O padrão é um texto em primeiro plano ciano sobre o plano de fundo padrão do terminal.
uk: Підрядок SGR для роздільників, які вставляють між вибраними полями рядка (B<:>), між полями рядка контексту, (B<->) та між групами суміжних рядків, коли вказано ненульовий контекст (B<-\^->) . Типово блакитний текст на фоні терміналу за замовчуванням.

source: Boolean value that prevents clearing to the end of line using Erase in Line (EL) to Right (B<\e33[K>) each time a colorized item ends. This is needed on terminals on which EL is not supported. It is otherwise useful on terminals for which the B<back_color_erase> (B<bce>) boolean terminfo capability does not apply, when the chosen highlight colors do not affect the background, or when EL is too slow or causes too much flicker. The default is false (i.e., the capability is omitted).
fr: Valeur booléenne qui évite l'effacement de la fin de la ligne en utilisant une séquence EL (« Erase in Line », ou en français « Effacement en Ligne »), vers la droite (B<\e\33[K>) à chaque fois qu'un élément coloré se termine. C'est nécessaire pour les terminaux sur lesquels EL n'est pas pris en charge. Sinon, c'est aussi utile pour les terminaux sur lesquels la capacité booléenne terminfo « B<back_color_erase> » (B<bce>) ne s'applique pas, quand les couleurs de mise en évidence ne touchent pas à la couleur de fond, quand EL est trop lent ou cause trop de scintillements. La valeur par défaut est le booléen faux (c'est-à-dire que la capacité n'est pas activée).
nl: Logische waarde die het wissen tot regel einde voor komt door gebruik van Erase in Line (EL) naar Rechts (B<\e33[K>) elke keer een gekleurd item eindigt. Dit is nodig op terminals waar EL niet ondersteund wordt. Het is ook nuttig op terminals waar de B<back_color_erase> (B<bce>) logische terminfo capaciteit niet van toepassing is, wanneer de gekozen opvallende kleuren niet van invloed zijn op de achtergrond, of wanneer EL te langzaam is en flakker veroorzaakt. De standaard is ONWAAR (m.a.w. de capaciteit wordt weggelaten).
pl: Wartość logiczna, która zapobiega czyszczeniu końca wiersza przy użyciu sekwencji Erase in Line (EL) to Right (B<\e\33[K>) za każdym razem, gdy kończy pokolorowany wpis. Jest to wymagane na terminalach, które nie obsługują EL. Wartość jednak potrzebna na terminalach, dla których możliwość logiczna B<back_color_erase> (B<bce>) nie ma zastosowania, gdy wybrane kolory podświetlenia nie zmieniają tła, gdy EL jest zbyt wolne bądź powoduje znaczne migotanie. Domyślnym ustawieniem jest fałsz (tzn. możliwość jest pominięta).
pt_br: Valor booleano que impede a limpeza até o final da linha usando Apagar na Linha (EL) para Direita (B<\e33[K>) toda vez que um item colorido termina. Isso é necessário em terminais nos quais o EL não é suportado. Caso contrário, é útil em terminais para os quais o recurso booleano terminfo B<back_color_erase> (B<bce>) não se aplica, quando as cores de realce escolhidas não afetam o plano de fundo ou quando o EL é muito lento ou causa muita oscilação. O padrão é falso (ou seja, o recurso é omitido).
uk: Логічне значення, яке запобігає очищенню до кінця рядка за допомогою Стерти в рядку (EL) Направо (B<\e33[K>) щоразу, коли закінчується розфарбований елемент. Це потрібно на терміналах, на яких EL не підтримується. Інакше кажучи це корисно на терміналах, для яких не застосовується логічна функція terminfo B<back_color_erase> (B<bce>), коли вибрані кольори виділення не впливають на фон, або коли EL надто повільний або викликає занадто сильне мерехтіння. Типово значення false (тобто можливість пропущена).

source: Note that boolean capabilities have no B<=>.\|.\|.\& part. They are omitted (i.e., false) by default and become true when specified.
fr: Notez que les capacités booléennes n'ont pas de partie « B<=>... ». Elles sont omises par défaut (ce qui correspond à une valeur booléenne faux) et deviennent vrai si elles sont précisées.
nl: Merk op dat de logische capaciteiten geen B<=>.\|.\|.\& deel hebben. Ze worden standaard weggelaten (m.a.w. ONWAAR) en worden WAAR indien opgegeven.
pl: Proszę zauważyć, że wartości logiczne nie posiadają części "B<=>.\|.\|.\&". Są one domyślne pominięte (tzn. fałszywe) i stają się prawdziwe, jeśli zostaną podane.
pt_br: Observe que os recursos booleanos não possuem uma parte B<=>.\|.\|.\&. Eles são omitidos (ou seja, false) por padrão e se tornam verdadeiros quando especificados.
uk: Зауважте, що логічні можливості не мають частини B<=>.\|.\|.\&. Вони пропущені (тобто false) за замовчуванням і стають істинними, коли це вказано.

source: See the Select Graphic Rendition (SGR) section in the documentation of the text terminal that is used for permitted values and their meaning as character attributes. These substring values are integers in decimal representation and can be concatenated with semicolons. B<grep> takes care of assembling the result into a complete SGR sequence (B<\e33[>.\|.\|.B<m>). Common values to concatenate include B<1> for bold, B<4> for underline, B<5> for blink, B<7> for inverse, B<39> for default foreground color, B<30> to B<37> for foreground colors, B<90> to B<97> for 16-color mode foreground colors, B<38;5;0> to B<38;5;255> for 88-color and 256-color modes foreground colors, B<49> for default background color, B<40> to B<47> for background colors, B<100> to B<107> for 16-color mode background colors, and B<48;5;0> to B<48;5;255> for 88-color and 256-color modes background colors.
fr: Voir la section Select Graphic Rendition (SGR) dans la documentation du terminal texte utilisé pour avoir la liste des valeurs autorisées et leur signification comme attributs de caractère. Ces valeurs de sous-chaînes sont des entiers sous forme décimale et peuvent être concaténées à l'aide de points-virgules. B<grep> se charge d'assembler le résultat en une séquence SGR complète (B<\e\33[>...B<m>). Les valeurs courantes à concaténer sont entre autres B<1> (gras), B<4> (souligné), B<5> (clignotant), B<7> (inversé), B<39> (couleur de trait par défaut), B<30> à B<37> (couleurs de trait), B<90> à B<97> (couleurs de trait en mode 16 couleurs), B<38;5;0> à B<38;5;255> (couleurs de trait en mode 88 et 256 couleurs), B<49> (couleur de fond par défaut), B<40> à B<47> (couleurs de fond), B<100> à B<107> (couleurs de fond en mode 16 couleurs) et B<48;5;0> à B<48;5;255> (couleurs de fond en mode 88 et 256 couleurs).
nl: Zie de Select Graphic Rendition (SGR) sectie in de documentatie van de tekst terminal die wordt gebruikt om toegestane waarden en hun betekenis als tekst attributen. Deze sub-tekst waarden zijn gehele getallen in decimale notatie en kunnen worden geconcateneerd met puntkomma´s. B<grep> zorgt voor het samenstellen van het resultaat in een complete SGR sequentie (B<\e33[>.\|.\|.B<m>). Voorkomende waarden voor concatenatie zijn o.m. B<1> voor vet, B<4> voor onderstrepen, B<5> voor knipperen, B<7> voor omkeren, B<39> voor standaard voorgrond kleur, B<30> tot B<37> voor voorgrond kleuren, B<90> tot B<97> voor 16-kleurenmode voorgrond kleuren, B<38;5;0> tot B<38;5;255> for 88-kleuren and 256-kleuren modes voorgrond kleuren, B<49> voor default achtergrond kleur, B<40> tot B<47> voor achtergrond kleuren, B<100> tot B<107> for 16-kleuren mode achtergrond kleuren, and B<48;5;0> tot B<48;5;255> voor 88-kleuren en 256-kleuren modes achtergrond kleuren.
pl: Proszę zapoznać się z rozdziałem Select Graphic Rendition (SGR) w dokumentacji używanego terminala tekstowego, aby dowiedzieć się jakie są dozwolone wartości oraz poznać ich znaczenie. Te wartości podciągów są liczbami całkowitymi w systemie dziesiętnym i mogą być łączone średnikami. Program B<grep> zajmuje się łączeniem rezultatu w kompletną sekwencję SGR (B<\e33[>.\|.\|.B<m>). Najczęściej używane wartości to: B<1> - pogrubienie, B<4> - podkreślenie, B<5> - miganie, B<7> - odwrócenie kolorów, B<39> - domyślny kolor tła, od B<30> do B<37> - kolory tekstu, od B<90> do B<97> - kolory tekstu w trybie 16 kolorów, od B<38;5;0> do B<38;5;255> - kolory tekstu w trybie 88 i 256 kolorów, B<49> - domyślny kolor tła, od B<40> do B<47> kolory tła, od B<100> do B<107> - kolory tła w trybie 16 kolorów i od B<48;5;0> do B<48;5;255> - kolory tła w trybie 88 i 256 kolorów.
pt_br: Consulte a seção Select Graphic Rendition (SGR) na documentação do terminal de texto usado para valores permitidos e seu significado como atributos de caractere. Esses valores de parte de texto são números inteiros na representação decimal e podem ser concatenados com ponto e vírgula. O B<grep> cuida da montagem do resultado em um texto SGR completo (B<\e33[>.\|.\|.B<m>). Os valores comuns a concatenar incluem B<1> para negrito, B<4> para sublinhado, B<5> para piscar, B<7> para inversa, B<39> para cor de primeiro plano padrão, B<30> a B<37> para cores de primeiro plano, B<90> a B<97> para modo de 16 cores de primeiro plano, B<38;5;0> a B<38;5;255> para modos de 88 cores e 256 cores de primeiro plano, B<49> para cor de plano de fundo padrão, B<40> a B<47> para cores de plano de fundo, B<100> a B<107> para cores de plano de fundo no modo de 16 cores e B<48;5;0> para B<48;5;255> para os modos 88 e 256 cores.
uk: Дивіться розділ Select Graphic Rendition (SGR) у документації текстового терміналу, який використовується для дозволених значень та їх значення як атрибутів символів. Ці значення підрядка є цілими числами в десятковому представленні і можуть бути об'єднані крапкою з комою. B<grep> забезпечує збірку результату в повну послідовність SGR (B<\e33[>.\|.\|.B<m>). Загальні значення для об'єднання включають B<1> для напівжирного, B<4> для підкреслення, B<5> для миготіння, B<7> для інвертованого, B<39> для кольору тексту за замовчуванням, B<30> до B<37 > для кольорів тексту, B<90> до B<97> для 16-кольорового режиму кольорів тексту, B<38;5;0> до B<38;5;255> для кольорів тексту з 88 та 256 кольорів , B<49> для кольору фону за замовчуванням, B<40> до B<47> для кольорів фону, B<100> до B<107> для 16-кольорового режиму кольорів фону та B<48;5;0> до B<48;5;255> для кольорів фону у режимах 88 та 256 кольорів.

source: These variables specify the locale for the B<LC_COLLATE> category, which determines the collating sequence used to interpret range expressions like B<[a-z]>.
fr: Ces variables indiquent le choix des paramètres régionaux pour la catégorie B<LC_COLLATE>, qui détermine l'ordre des caractères utilisé pour l'interprétation des intervalles tels que B<[a-z]>.
nl: Deze variabelen specificeren de taaldefinitie voor de B<LC_COLLATE> categorie, deze bepaald de verzameling volgorde die gebruikt wordt om bereik expressies te ontleden zoals B<[a-z]>.
pl: Zmienne określające ustawienia regionalne dla kategorii B<LC_COLLATE>, która wyznacza kolejność sortowania używaną do interpretowania wyrażeń zakresowych, takich jak B<[a-z]>.
pt_br: Essas variáveis especificam o código de idioma da categoria B<LC_COLLATE>, que determina a sequência de agrupamento usada para interpretar expressões de intervalo como B<[a-z]>.
uk: Ці змінні визначають локаль для категорії B<LC_COLLATE>, яка визначає послідовність символів, яка використовується для інтерпретації виразів діапазону, наприклад B<[a-z]>.
