Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: The fundamental building blocks are the regular expressions that match a single character. Most characters, including all letters and digits, are regular expressions that match themselves. Any meta-character with special meaning may be quoted by preceding it with a backslash.
fr: Les briques élémentaires sont les expressions rationnelles correspondant à un seul caractère. La plupart des caractères, y compris les lettres et les chiffres, constituent des expressions rationnelles et correspondent avec eux-mêmes. Tout métacaractère ayant une signification particulière doit être protégé en le faisant précéder d'une contre-oblique (I<backslash>).
nl: De fundamentele bouwstenen zijn de reguliere expressies, die passen op een enkel karakter. De meeste tekens, ook alle letters en cijfers, zijn reguliere expressies die op zichzelf passen. Elk meta-teken met een speciale betekenis kan geciteerd worden door het vooraf te laten gaan door een backslash.
pl: Podstawowymi "cegiełkami" są wyrażenia regularne pasujące do pojedynczego znaku. Większość znaków, w tym wszystkie litery i cyfry są wyrażeniami regularnymi pasującymi do samych siebie. Każdy metaznak mający specjalne znaczenie może być zacytowany przez poprzedzenie go odwrotnym ukośnikiem.
pt_br: Os blocos de construção fundamentais são as expressões regulares que coincidem com um único caractere. A maioria dos caracteres, incluindo todas as letras e dígitos, são expressões regulares coincidentes. Qualquer metacaractere com significado especial pode ser citado precedendo-o com uma barra invertida.
uk: Основними складовими частинами є регулярні вирази, які відповідають одному символу. Більшість символів, включаючи всі літери та цифри, є регулярними виразами, які відповідають самі собі. Будь-який знак із спеціальним значенням може бути екрановано, якщо поставити перед ним обернений слеш.

source: The period B<.\&> matches any single character. It is unspecified whether it matches an encoding error.
fr: Le point B<.\&> correspond à n'importe quel caractère. Il n'est pas spécifié s’il correspond avec une erreur d'encodage.
nl: De punt B<.\&> past elk enkelvoudig karakter. Het is niet gespecificeerd of het past op een codering fout.
pl: Kropka B<.\&> pasuje do każdego pojedynczego znaku. Nie jest określone czy pasuje ona do błędu kodowania.
pt_br: O ponto B<.\&> coincide com qualquer caractere único. Não é especificado se coincide com um erro de codificação.
uk: Крапка B<.\&> відповідає будь-якому окремому символу. Не вказується, чи відповідає він помилці кодування.

source: Character Classes and Bracket Expressions
fr: Classes de caractères et expressions entre crochets
nl: Teken klassen en Expressies met Haakjes
pl: Klasy znakowe i wyrażenia klamrowe
pt_br: Classes de caracteres e expressões entre colchetes
uk: Класи Символів та Вирази в Дужках

source: A I<bracket expression> is a list of characters enclosed by B<[> and B<]>. It matches any single character in that list. If the first character of the list is the caret B<^> then it matches any character I<not> in the list; it is unspecified whether it matches an encoding error. For example, the regular expression B<[0123456789]> matches any single digit.
fr: Une I<expression entre crochets> est une liste de caractères encadrée par un B<[> et un B<]>. Elle est en correspondance avec n'importe quel caractère appartenant à la liste. Si le premier caractère de la liste est un caret «\ B<^>\ », alors la mise en correspondance se fait avec n'importe quel caractère I<absent> de la liste ; il n'est pas spécifié s'il correspond avec une erreur d'encodage. Par exemple, l'expression rationnelle B<[0123456789]> concorde avec n'importe quel chiffre.
nl: Een I<haakjes expressie> is een lijst van tekens omsloten door B<[> en B<]>. Het past elk enkelvoudig teken van die lijst. Als het eerste karakter van de lijst het dakje B<^> is, dan past het elk enkelvoudig teken I<niet> in die lijst. Het is niet gespecificeerd of het past op een codering fout. Bijvoorbeeld, de reguliere expressie B<[0123456789]> past elk enkelvoudig cijfer.
pl: I<Wyrażenie klamrowe> jest listą znaków zawartych pomiędzy B<[> a B<]>. Pasuje do każdego pojedynczego znaku na tej liście. Jeśli pierwszy znak z listy jest daszkiem B<^>, to wyrażenie pasuje do każdego pojedynczego znaku I<nie> znajdującego się na liście; nie jest określone czy pasuje do błędu kodowania. Na przykład, wyrażenie regularne B<[0123456789]> pasuje do każdej pojedynczej cyfry.
pt_br: Uma I<expressão entre colchetes> é uma lista de caracteres entre B<[> e B<]>. Coincide com qualquer caractere único nessa lista. Se o primeiro caractere da lista for o sinal de intercalação B<^>, ele coincidirá com qualquer caractere que I<não> esteja na lista; não é especificado se coincide com um erro de codificação. Por exemplo, a expressão regular B<[0123456789]> coincide com qualquer dígito único.
uk: I<вираз у дужках> — це список символів, укладених між B<[> та B<]>. Це відповідає будь-якому окремому символу з цьому списку. Якщо першим символом списку є каретка B<^>, то він відповідає будь-якому символу якого I<немає> у списку; чи він відповідає помилці кодуванні. Наприклад, регулярний вираз B<[0123456789]> відповідає будь-якій одній цифрі.

source: Within a bracket expression, a I<range expression> consists of two characters separated by a hyphen. It matches any single character that sorts between the two characters, inclusive, using the locale's collating sequence and character set. For example, in the default C locale, B<[a-d]> is equivalent to B<[abcd]>. Many locales sort characters in dictionary order, and in these locales B<[a-d]> is typically not equivalent to B<[abcd]>; it might be equivalent to B<[aBbCcDd]>, for example. To obtain the traditional interpretation of bracket expressions, you can use the C locale by setting the B<LC_ALL> environment variable to the value B<C>.
fr: Entre ces crochets, un I<intervalle> de caractères consiste en deux caractères séparés par un tiret. Il correspond avec n'importe quel caractère compris entre les deux caractères caractère (ceux-ci inclus), l'ordre des caractères dépendant des paramètres régionaux (I<locale>, en anglais) actuels. Ainsi, avec les paramètres par défaut («\ C\ »), B<[a-d]> est équivalent à B<[abcd]>. Avec beaucoup de paramètres régionaux, les caractères sont triés en suivant l'ordre des dictionnaires, et B<[a-d]> n'est alors en général pas équivalent à B<[abcd]>, mais peut l'être à B<[aBbCcDd]>, par exemple. Pour que ces listes aient le comportement habituel de «\ C\ », vous pouvez positionner la variable d'environnement B<LC_ALL> à la valeur B<C>.
nl: In een haakjes expressie, bestaat een I<bereik expressie> uit twee tekens gescheiden door een koppelteken. Dit vind elk enkel teken dat past tussen twee de twee tekens, inclusief, het gebruik van de taaldefinitie verzameling volgorde en teken set. Bij voorbeeld, in de standaard C taaldefinitie, B<[a-d]> is equivalent aan B<[abcd]>. Veel locales sorteren tekens in woord volgorde, en in deze is B<[a-d]> gewoonlijk niet equivalent B<[abcd]>; het kan equivalent zijn aan B<[aBbCcDd]>, bij voorbeeld. Om de klassieke interpretatie van haakjes expressie te verkrijgen, kun je best de C taaldefinitie instellen door het zetten van de B<LC_ALL> omgevingsvariabele op de waarde B<C>.
pl: W obrębie wyrażenia klamrowego, I<wyrażenie zakresowe> składa się z dwóch znaków rozdzielonych minusem. Pasuje do pojedynczego znaku, który mieści się między tymi dwoma znakami, łącznie z nimi, używając ustawień językowych (locale) określających kolejność i zestaw znaków. Na przykład, w domyślnych ustawieniach locale C, B<[a-d]> jest odpowiednikiem B<[abcd]>. Wiele ustawień regionalnych sortuje znaki w kolejności słownikowej, i B<[a-d]> nie jest wtedy z reguły odpowiednikiem B<[abcd]>, może być na przykład równoważne B<[aBbCcDd]> (dla języka polskiego: B<[aąbcćd]> - tłum.). Aby uzyskać tradycyjną interpretację wyrażeń zakresowych, można użyć locale C, przypisując zmiennej środowiskowej B<LC_ALL> wartość B<C>.
pt_br: Dentro de uma expressão entre colchetes, uma I<expressão de intervalo> consiste em dois caracteres separados por um hífen. Coincide com qualquer caractere único que classifique entre os dois caracteres, inclusive, usando a sequência de agrupamento e o conjunto de caracteres da localidade. Por exemplo, no código de idioma C padrão, B<[a-d]> é equivalente a B<[abcd]>. Muitos códigos de idioma classificam caracteres na ordem do dicionário e, nesses locais, B<[a-d]> normalmente não é equivalente a B<[abcd]>; pode ser equivalente a B<[aBbCcDd]>, por exemplo. Para obter a interpretação tradicional de expressões entre colchetes, você pode usar o código de idioma C configurando a variável de ambiente B<LC_ALL> para o valor B<C>.
uk: Вираз в дужках I<діапазон виразу> складається з двох символів, розділених дефісом. Він відповідає будь-якому окремому символу, який знаходиться між двома символами включно із цими символами, використовуючи послідовності відносно до локалі та набору символів. Наприклад, у стандартній локалі C, типово, B<[a-d]> еквівалентно B<[abcd]>. Є багато мовних локалей, які сортують символи в порядку словника, і в цих мовах B<[a-d]> зазвичай не еквівалентне B<[abcd]>; це може бути еквівалентним, наприклад, B<[aBbCcDd]>. Щоб отримати традиційну інтерпретацію виразів у квадратних дужках, можна використовувати локаль C, встановивши для змінної середовища B<LC_ALL> значення B<C>.

source: Finally, certain named classes of characters are predefined within bracket expressions, as follows. Their names are self explanatory, and they are B<[:alnum:]>, B<[:alpha:]>, B<[:blank:]>, B<[:cntrl:]>, B<[:digit:]>, B<[:graph:]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]>, and B<[:xdigit:]>. For example, B<[[:alnum:]]> means the character class of numbers and letters in the current locale. In the C locale and ASCII character set encoding, this is the same as B<[0-9A-Za-z]>. (Note that the brackets in these class names are part of the symbolic names, and must be included in addition to the brackets delimiting the bracket expression.) Most meta-characters lose their special meaning inside bracket expressions. To include a literal B<]> place it first in the list. Similarly, to include a literal B<^> place it anywhere but first. Finally, to include a literal B<-> place it last.
fr: Enfin, certaines classes de caractères prédéfinies existent à l'intérieur de crochets comme suit. Leurs noms sont assez explicites\ : B<[:alnum:]>, B<[:alpha:]>, B<[:blank:]>, B<[:cntrl:]>, B<[:digit:]> (chiffres), B<[:graph:]>, B<[:lower:]> (minuscules), B<[:print:]> (affichables), B<[:punct:]> (ponctuation), B<[:space:]> (espace), B<[:upper:]> (majuscules), et B<[:xdigit:]> (chiffres hexadécimaux). Par exemple, B<[[:alnum:]]> correspond aux chiffres et lettres pour les paramètres régionaux actuels. Dans les paramètres régionaux C et avec le codage de caractères \s-1ASCII\s0, c'est équivalent à B<[0-9A-Za-z]>. Remarquez que les crochets dans les noms de classes font partie intégrante du nom symbolique, et qu'ils doivent donc être inclus en plus des crochets encadrant ces expressions entre crochets. La plupart des métacaractères perdent leur signification particulière à l'intérieur d'une expression entre crochets. Pour inclure un caractère B<]>, mettez-le en premier dans la liste. De même, pour inclure un caractère B<^>, placez-le n'importe où sauf au début de la liste. Enfin, pour inclure un B<->, placez-le en dernier.
nl: Tenslotte, bepaalde benoemde klassen van tekens zijn voorgedefinieerd. Hun namen spreken voor zichzelf, en het zijn B<[:alnum:]>, B<[:alpha:]>, B<[:cntrl:]>, B<[:digit:]>, B<[:graph:]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]> en B<[:xdigit:]>. Bijvoorbeeld B<[[:alnum:]]> betekend B<[0-9A-Za-z]>, behalve dat de laatste vorm afhankelijk is van de POSIX taaldefinitie en de ASCII tekenset, terwijl de eerste onafhankelijk is van taaldefinitie en tekenset. (Merk op dat de rechte haakjes in deze klasse namen onderdeel zijn van de symbolische namen, en ook gegeven moeten worden bij de ook al rechte haakjes die de rechte-haakjes-lijst omsluiten.) De meeste meta-tekens verliezen hun speciale betekenis binnen een lijst. Om een letterlijke B<]> op te geven, plaats het als eerste in de lijst. Hetzelfde idee voor een letterlijke B<^>, plaats het overal behalve als eerste. Tenslotte, om een letterlijke B<-> bij te voegen, plaats het als laatste.
pl: Istnieją predefiniowane, nazwane klasy znakowe, których można używać wewnątrz wyrażeń klamrowych. Posiadają opisowe nazwy w języku angielskim i są to: B<[:alnum:]> (litery i cyfry), B<[:alpha:]> (litery), B<[:blank:]> (puste), B<[:cntrl:]> (znaki kontrolne), B<[:digit:]> (cyfry), B<[:graph:]> ([:alnum:] i [:punct:]), B<[:lower:]> (małe litery), B<[:print:]> ([:graph:] i spacja), B<[:punct:]> (znaki przestankowe), B<[:space:]> (białe znaki), B<[:upper:]> (duże litery) i B<[:xdigit:]> (znaki szesnastkowe). Na przykład B<[[:alnum:]]> zawiera zestaw liter i cyfr zależnych od aktualnych ustawień językowych. W ustawieniach locale C i kodowaniu znaków ASCII, jest to odpowiednik B<[0-9A-Za-z]> (w polskich ustawieniach [0-9A-Ża-ż] - tłum.). (Proszę zauważyć, że nawiasy kwadratowe w nazwach klas są częścią nazw symbolicznych i muszą być umieszczone dodatkowo, oprócz pary nawiasów ograniczającej samą listę.) Większość metaznaków traci swoje szczególne znaczenie wewnątrz wyrażeń klamrowych. Aby umieścić tam dosłowny znak B<]>, należy go umieścić jako pierwszy. Podobnie, dosłowny B<^>, może się znaleźć gdziekolwiek poza pierwszym miejscem. W końcu, dosłowny B<-> musi się znaleźć na końcu.
pt_br: Finalmente, certas classes nomeadas de caracteres são predefinidas nas expressões entre colchetes, da seguinte maneira. Seus nomes são autoexplicativos e são B<[:alnum:]>, B<[:alpha:]>, B<[:blank:]>, B<[:cntrl:]>, B<[:digit:]>, B<[:graph:]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]> e B<[:xdigit:]>. Por exemplo, B<[[:alnum:]]> significa a classe de caracteres de números e letras no local atual. Na localidade C e na codificação do conjunto de caracteres ASCII, é igual a B<[0-9A-Za-z]>. (Observe que os colchetes nesses nomes de classe fazem parte dos nomes simbólicos e devem ser incluídos além dos colchetes que delimitam a expressão entre colchetes.) A maioria dos metacaracteres perde seu significado especial nas expressões entre colchetes. Para incluir um B<]> literal, coloque-o primeiro na lista. Da mesma forma, para incluir um B<^> literal, coloque-o em qualquer lugar, exceto primeiro. Finalmente, para incluir um literal B<->, coloque-o por último.
uk: Нарешті, певні іменовані класи символів попередньо визначені у виразах у дужках, як показано нижче. Їхні назви зрозумілі самі собою: B<[:alnum:]>, B<[:alpha:]>, B<[:blank:]>, B<[:cntrl:]>, B<[:digit :]>, B<[:graph:]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]> і B<[:xdigit:]>. Наприклад, B<[[:alnum:]]> означає клас символів цифр та букв у поточній мові. У кодуванні мови C та набору символів ASCII це те саме, що B<[0-9A-Za-z]>. (Зверніть увагу, що дужки в назвах класів є частиною символічних імен і повинні бути включені на додаток до дужок, що розмежовують вирази у дужках.) Більшість спеціальних знаків втрачають своє особливе значення всередині виразів у дужках. Щоб включити символ B<]>, розмістіть його першим у списку. Аналогічно, щоб включити символ B<^>, розмістіть його спочатку списку. Нарешті, щоб включити символ B<->, поставте його останнім.

source: Anchoring
fr: Ancrage
nl: Verankering
pl: Początek i koniec wiersza
pt_br: Ancoragem
uk: Прив'язування

source: The caret B<^> and the dollar sign B<$> are meta-characters that respectively match the empty string at the beginning and end of a line.
fr: Le caret «\ B<^>\ » et le symbole dollar «\ B<$>\ » sont des métacaractères correspondant respectivement à une chaîne vide au début et en fin de ligne.
nl: Het dakje B<^> en het dollar teken B<$> zijn meta-tekens die op respectievelijk de lege string aan het begin, en aan het einde van een regel passen.
pl: Znak daszka B<^> i dolara B<$> są metaznakami, które pasują odpowiednio do łańcucha pustego na początku i końcu wiersza.
pt_br: O acento circunflexo (caret) B<^> e o cifrão B<$> são metacaracteres que coincidem respectivamente com o texto vazio no início e no final de uma linha.
uk: Каретка B<^> та знак долара B<$> є спеціальними символами, які позначають у порожньому рядку початок і кінець рядка відповідно.

source: The Backslash Character and Special Expressions
fr: Caractère contre-oblique et expressions spéciales
nl: Het backslash teken en Speciale Expressies
pl: Ukośnik i wyrażenia specjalne
pt_br: O caractere de barra invertida e expressões especiais
uk: Символ Зворотнього Слешу та Спеціальні Вирази

source: The symbols B<\eE<lt>> and B<\eE<gt>> respectively match the empty string at the beginning and end of a word. The symbol B<\eb> matches the empty string at the edge of a word, and B<\eB> matches the empty string provided it's I<not> at the edge of a word. The symbol B<\ew> is a synonym for B<[_[:alnum:]]> and B<\eW> is a synonym for B<[^_[:alnum:]]>.
fr: Les symboles B<\eE<lt>> et B<\eE<gt>> correspondent respectivement à une chaîne vide en début et en fin de mot. Le symbole B<\eb> correspond à une chaîne vide à l'extrémité d'un mot, et B<\eB> correspond à une chaîne vide ne se trouvant I<pas> à une extrémité de mot. Le symbole B<\ew> est un synonyme pour B<[_[:alnum:]]> et B<\eW> est un synonyme pour B<[^_[:alnum:]]>.
nl: De symbolen B<\eE<lt>> en B<\eE<gt>> passen respectievelijk de lege tekst aan het begin, en aan het einde van een woord. Het symbool B<\eb> past de lege string aan de rand van een woord, en B<\eB> past de lege string als het I<niet> de rand van een woord is. Het symbool B<\ew> is een synoniem voor B<[_[:alnum:]]> en B<\eW> is een synoniem voor B<[^_[:alnum:]]>.
pl: Symbole B<\eE<lt>> i B<\eE<gt>> oznaczają pusty łańcuch odpowiednio na początku i końcu słowa. Symbol B<\eb> pasuje do pustego łańcucha na krawędzi słowa, zaś B<\eB> pasuje do ciągu pustego zakładając, że I<nie> jest na krawędzi słowa. Symbol B<\ew> jest synonimem B<[_[:alnum:]]>, z kolei B<\eW> jest synonimem B<[^_[:alnum:]]>.
pt_br: Os símbolos B<\eE<lt>> e B<\eE<gt>> respectivamente coincidem com o texto vazio no início e no final de uma palavra. O símbolo B<\eb> coincide com o texto vazio na borda de uma palavra e B<\eB> coincide com o texto vazio, desde que eu não esteja na borda de uma palavra. O símbolo B<\ew> é sinônimo de B<[_[:alnum:]]> e B<\eW> é sinônimo de B<[^_[:alnum:]]>.
uk: Символи B<\eE<lt>> і B<\eE<gt>> відповідно відповідають порожньому рядку на початку і в кінці слова. Символ B<\eb> відповідає порожньому рядку на краю слова, а B<\eB> відповідає порожньому рядку за умови, що це I<НЕ> на краю слова. Символ B<\ew> є синонімом B<[_[:alnum:]]>, а B<\eW> є синонімом B<[^_[:alnum:]]>.

source: Repetition
fr: Répétitions
nl: Herhaling
pl: Powtarzanie
pt_br: Repetição
uk: Повторення

source: A regular expression may be followed by one of several repetition operators:
fr: Dans une expression rationnelle, un caractère peut être suivi par l'un des opérateurs de répétition suivants\ :
nl: Een reguliere expressie mag gevolgd worden door een of meerdere herhaal operatoren:
pl: Po wyrażeniach regularnych mogą się znajdować jeden lub kilka operatorów powtórzenia:
pt_br: Uma expressão regular pode ser seguida por um dos vários operadores de repetição:
uk: За регулярним виразом може слідувати один з кількох операторів повторення:

source: The preceding item is optional and matched at most once.
fr: L'élément précédent est facultatif et peut être rencontré au plus une fois.
nl: Het voorgaande item is optioneel en paste ten hoogste één keer.
pl: Poprzedzający element jest opcjonalny i dopasowany co najwyżej jeden raz.
pt_br: O item anterior é opcional e coincide com o máximo uma vez.
uk: Попередній елемент є необов'язковим і збігається не більше одного разу.

source: The preceding item will be matched zero or more times.
fr: L'élément précédent peut être rencontré zéro ou plusieurs fois.
nl: Het voorgaande item zal nul of meer keer gepast worden.
pl: Poprzedzający element będzie dopasowany zero lub więcej razy.
pt_br: O item anterior coincidirá com zero ou mais vezes.
uk: Попередній елемент буде збігатися нуль або більше разів.

source: The preceding item will be matched one or more times.
fr: L'élément précédent peut être rencontré une ou plusieurs fois.
nl: Het voorgaande item zal één of meer keer gepast worden.
pl: Poprzedzający element będzie dopasowany jeden lub więcej razy.
pt_br: O item anterior coincidirá com uma ou mais vezes.
uk: Попередній елемент буде збігатися один або кілька разів.

source: The preceding item is matched exactly I<n> times.
fr: L'élément précédent doit correspondre exactement I<n> fois.
nl: Het voorgaande item zal precies I<n> keer gepast worden.
pl: Poprzedzający element pasuje dokładnie I<n> razy.
pt_br: O item anterior é coincidido exatamente I<n> vezes.
uk: Попередній елемент збігається точно I<n> разів.

source: The preceding item is matched I<n> or more times.
fr: L'élément précédent doit correspondre I<n> fois ou plus.
nl: Het voorgaande item zal I<n> of meer keer gepast worden.
pl: Poprzedzający element pasuje I<n> lub więcej razy.
pt_br: O item anterior é coincidido a I<n> ou mais vezes.
uk: Попередній елемент збігається I<n> або більше разів.

source: The preceding item is matched at most I<m> times. This is a GNU extension.
fr: L'élément précédent doit correspondre au plus I<m> fois. C’est une extension \s-1GNU\s0.
nl: Het voorafgaande item past op zijn meest I<m> keer. Dit is een GNU uitbreiding.
pl: Poprzedzający element pasuje co najwyżej I<m> razy. Jest to rozszerzenie GNU.
pt_br: O item anterior é coincidido no máximo I<m> vezes. Esta é uma extensão GNU.
uk: Попередній елемент збігається не більше I<m> разів. Це розширення GNU.

source: The preceding item is matched at least I<n> times, but not more than I<m> times.
fr: L'élément précédent doit correspondre au moins I<n> fois, mais au plus I<m> fois.
nl: Het voorgaande item zal minstens I<n> keer, maar niet meer dan I<m> keer gepast worden.
pl: Poprzedzający element pasuje co najmniej I<n> razy, ale nie więcej niż I<m> razy.
pt_br: O item anterior é coincidido pelo menos I<n> vezes, mas não mais que I<m> vezes.
uk: Попередній елемент збігається щонайменше I<n> разів, але не більше I<m> разів.

source: Concatenation
fr: Concaténations
nl: Concatenatie
pl: Suma
pt_br: Concatenação
uk: Ланцюжок
