Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Skip any command-line file with a name suffix that matches the pattern I<GLOB>, using wildcard matching; a name suffix is either the whole name, or any suffix starting after a B</> and before a +non-B</>. When searching recursively, skip any subfile whose base name matches I<GLOB>; the base name is the part after the last B</>. A pattern can use B<*>, B<?>, and B<[>...B<]> as wildcards, and B<\e> to quote a wildcard or backslash character literally.
fr: Sauter tout fichier sur la ligne de commande dont le suffixe du nom correspond au motif I<GLOB>, en utilisant la correspondance de jokers ; un suffixe de nom est soit tout le nom, soit n'importe quel suffixe débutant après une barre oblique (B</>) et avant un caractère qui n'est pas une barre oblique (B</>). Lors d'une recherche récursive, sauter tous les sous-fichiers dont le nom de base correspond à I<GLOB> ; le nom de base est la partie après la dernière barre oblique B</>. Un motif peut utiliser B<*>, B<?> et B<[>...B<]> comme joker et B<\e> pour interpréter littéralement les caractères joker ou barre oblique inversée.
pl: Pomija jakiekolwiek pliki z przyrostkiem nazwy, który zgadza się ze I<WZORCEM> używając dopasowania wieloznacznego; przyrostek nazwy jest albo całą nazwą pliku, albo dowolnym sufiksem występującym po B</> oraz przed nie-B</>. Przy wyszukiwaniu rekurencyjnym, pomija jakikolwiek podplik, którego bazowa nazwa zgadza się z I<WZORCEM>; nazwa bazowa jest częścią po ostatnim B</>. Wzorzec może wykorzystywać B<*>, B<?> albo B<[>.\|.\|.B<]> jako wieloznaczniki oraz B<\e>, aby zacytować wieloznacznik lub odwrócony ukośnik.
uk: Пропускає будь-який файл командного рядка із суфіксом імені, який відповідає зразку I<ШАБЛОН ПОШУКУ>, використовуючи підстановку; суфікс імені – це або ціла назва, або будь-який суфікс, що починається після B</> і перед +не-B</>. Під час рекурсивного пошуку пропускається будь-який підфайл, базова назва якого відповідає I<ШАБЛОН ПОШУКУ>; базова назва — частина після останнього B</>. Зразок може використовувати B<*>, B<?> і B<[>...B<]> як символи підстановки, а B<\e> для буквального цитування символу підстановки або зворотної косої риски.

source: Search only files whose base name matches I<GLOB> (using wildcard matching as described under B<-\^-exclude>).
fr: Ne rechercher que les fichiers dont le nom de fichier correspond à I<GLOB> (en utilisant les jokers comme décrit pour B<-\^-exclude>).
pl: Wyszukuje jedynie pliki, których nazwa pasuje do I<WZORCA> (używając masek, opisanych w opcji B<\^-exclude>).
uk: Шукайте лише файли, базова назва яких відповідає I<ШАБЛОН ПОШУКУ> (використовуючи підстановку, як описано в розділі B<-\^-exclude>).

source: The period B<.\&> matches any single character.
fr: Le point B<.\&> correspond à n'importe quel caractère.
pl: Kropka B<.\&> pasuje do każdego pojedynczego znaku.
uk: Крапка B<.\&> відповідає будь-якому окремому символу.

source: A I<bracket expression> is a list of characters enclosed by B<[> and B<]>. It matches any single character in that list; if the first character of the list is the caret B<^> then it matches any character I<not> in the list. For example, the regular expression B<[0123456789]> matches any single digit.
fr: Une I<expression entre crochets> est une liste de caractères encadrée par un B<[> et un B<]>. Elle est en correspondance avec n'importe quel caractère appartenant à la liste. Si le premier caractère de la liste est un caret «\ B<^>\ », alors la mise en correspondance se fait avec n'importe quel caractère I<absent> de la liste. Par exemple, l'expression rationnelle B<[0123456789]> concorde avec n'importe quel chiffre.
pl: I<Wyrażenie klamrowe> jest listą znaków zawartych pomiędzy B<[> a B<]>. Pasuje do każdego pojedynczego znaku na tej liście; jeśli pierwszy znak z listy jest daszkiem B<^>, to wyrażenie pasuje do każdego pojedynczego znaku I<nie> znajdującego się na liście. Na przykład, wyrażenie regularne B<[0123456789]> pasuje do każdej pojedynczej cyfry.
uk: I<вираз у дужках> — це список символів, укладених B<[> і B<]>. Він відповідає будь-якому окремому символу в цьому списку; якщо першим символом списку є каретка B<^>, то він відповідає будь-якому символу I<ні> у списку. Наприклад, регулярний вираз B<[0123456789]> відповідає будь-якій одній цифрі.

source: Finally, certain named classes of characters are predefined within bracket expressions, as follows. Their names are self explanatory, and they are B<[:alnum:]>, B<[:alpha:]>, B<[:cntrl:]>, B<[:digit:]>, B<[:graph:]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]>, and B<[:xdigit:].> For example, B<[[:alnum:]]> means the character class of numbers and letters in the current locale. In the C locale and ASCII character set encoding, this is the same as B<[0-9A-Za-z]>. (Note that the brackets in these class names are part of the symbolic names, and must be included in addition to the brackets delimiting the bracket expression.) Most meta-characters lose their special meaning inside bracket expressions. To include a literal B<]> place it first in the list. Similarly, to include a literal B<^> place it anywhere but first. Finally, to include a literal B<-> place it last.
fr: Enfin, certaines classes de caractères prédéfinies existent à l'intérieur de crochets comme suit. Leurs noms sont assez explicites\ : B<[:alnum:]>, B<[:alpha:]>, B<[:cntrl:]>, B<[:digit:]> (chiffres), B<[:graph:]>, B<[:lower:]> (minuscules), B<[:print:]> (affichables), B<[:punct:]> (ponctuation), B<[:space:]> (espace), B<[:upper:]> (majuscules), et B<[:xdigit:]> (chiffres hexadécimaux). Par exemple, B<[[:alnum:]]> correspond aux chiffres et lettres pour les paramètres régionaux actuels. Dans les paramètres régionaux C et avec le codage de caractères \s-1ASCII\s0, c'est équivalent à B<[0-9A-Za-z]>. Remarquez que les crochets dans les noms de classes font partie intégrante du nom symbolique, et qu'ils doivent donc être inclus en plus des crochets encadrant ces expressions entre crochets. La plupart des métacaractères perdent leur signification particulière à l'intérieur d'une expression entre crochets. Pour inclure un caractère B<]>, mettez-le en premier dans la liste. De même, pour inclure un caractère B<^>, placez-le n'importe où sauf au début de la liste. Enfin, pour inclure un B<->, placez-le en dernier.
pl: Istnieją predefiniowane, nazwane klasy znakowe, których można używać wewnątrz wyrażeń klamrowych. Posiadają opisowe nazwy w języku angielskim i są to: B<[:alnum:]> (litery i cyfry), B<[:alpha:]> (litery), B<[:cntrl:]> (znaki kontrolne), B<[:digit:]> (cyfry), B<[:graph:]> ([:alnum:] i [:punct:]), B<[:lower:]> (małe litery), B<[:print:]> ([:graph:] i spacja), B<[:punct:]> (znaki przestankowe), B<[:space:]> (białe znaki), B<[:upper:]> (duże litery) i B<[:xdigit:]> (znaki szesnastkowe). Na przykład B<[[:alnum:]]> zawiera zestaw liter i cyfr zależnych od aktualnych ustawień językowych. W ustawieniach locale C i kodowaniu znaków ASCII, jest to odpowiednik B<[0-9A-Za-z]>. Proszę zauważyć, że nawiasy kwadratowe w nazwach klas są częścią nazw symbolicznych i muszą być umieszczone dodatkowo, oprócz pary nawiasów ograniczającej samą listę. Większość metaznaków traci swoje szczególne znaczenie wewnątrz wyrażeń klamrowych. Aby umieścić tam dosłowny znak B<]>, należy go umieścić jako pierwszy. Podobnie, dosłowny B<^>, może się znaleźć gdziekolwiek poza pierwszym miejscem. W końcu, dosłowny B<-> musi się znaleźć na końcu.
uk: Нарешті, певні іменовані класи символів попередньо визначені у виразах у дужках, як показано нижче. Їхні назви зрозумілі самі за собою: B<[:alnum:]>, B<[:alpha:]>, B<[:cntrl:]>, B<[:digit:]>, B<[:graph :]>, B<[:lower:]>, B<[:print:]>, B<[:punct:]>, B<[:space:]>, B<[:upper:]> і B<[:xdigit:].>. Наприклад, B<[[:alnum:]]> означає клас символів цифр і літер у поточній мовній локалі. У кодуванні локалі C і набору символів ASCII це те саме, що B<[0-9A-Za-z]>. (Зауважте, що дужки в назвах класів є частиною символічних імен і повинні бути включені на додаток до дужок, що розмежовують вираз у дужках.) Більшість спеціальних символів втрачають своє особливе значення всередині виразів у дужках. Щоб включити символ B<]>, розмістіть його першим у списку. Аналогічно, щоб включити символ B<^>, розмістіть його де завгодно, але спочатку. Нарешті, щоб включити символ B<->, поставте його останнім.

source: Back References and Subexpressions
fr: Références arrières et sous-expressions
pl: Odwołania zwrotne i podwyrażenia
uk: Зворотні посилання та підвирази

source: ENVIRONMENT VARIABLES
fr: VARIABLES D'ENVIRONNEMENT
pl: ZMIENNE ŚRODOWISKOWE
uk: ЗМІННІ СЕРЕДОВИЩА

source: This variable specifies default options to be placed in front of any explicit options. As this causes problems when writing portable scripts, this feature will be removed in a future release of B<grep>, and B<grep> warns if it is used. Please use an alias or script instead.
fr: Cette variable indique les options par défaut à placer avant toute option explicite. Comme cela pose des problèmes lors de l'écriture de scripts portables, cette fonctionnalité sera supprimée dans une prochaine version de B<grep> et B<grep> met en garde si elle est utilisée. Veuillez utiliser un alias ou un script à la place.
pl: Ta zmienna uściśla domyślne opcje, które mają zostać umieszczone przed wszystkimi opcjami jawnymi. Jako, że powoduje to problemy z pisaniem skryptów przenośnych, ta funkcja zostanie usunięta w przyszłym wydaniu B<grep> oraz sam B<grep> ostrzega o tym, kiedy zostaje użyta. W zamian proszę używać aliasów bądź skryptów.
uk: Ця змінна визначає параметри за замовчуванням, які розміщуються перед будь-якими явними параметрами. Оскільки це спричиняє проблеми під час написання переносимих скриптів, ця функція буде вилучена в наступному випуску B<grep>, і B<grep> попереджає, якщо вона використовується. Натомість використовуйте аліас або скрипт.

source: Boolean value that prevents clearing to the end of line using Erase in Line (EL) to Right (B<\e\33[K>) each time a colorized item ends. This is needed on terminals on which EL is not supported. It is otherwise useful on terminals for which the B<back_color_erase> (B<bce>) boolean terminfo capability does not apply, when the chosen highlight colors do not affect the background, or when EL is too slow or causes too much flicker. The default is false (i.e., the capability is omitted).
fr: Valeur booléenne qui évite l'effacement de la fin de la ligne en utilisant une séquence EL (« Erase in Line », ou en français « Effacement en Ligne »), vers la droite (B<\e\33[K>) à chaque fois qu'un élément coloré se termine. C'est nécessaire pour les terminaux sur lesquels EL n'est pas pris en charge. Sinon, c'est aussi utile pour les terminaux sur lesquels la capacité booléenne terminfo « B<back_color_erase> » (B<bce>) ne s'applique pas, quand les couleurs de mise en évidence ne touchent pas à la couleur de fond, quand EL est trop lent ou cause trop de scintillements. La valeur par défaut est le booléen faux (c'est-à-dire que la capacité n'est pas activée).
pl: Wartość logiczna, która zapobiega czyszczeniu końca wiersza przy użyciu sekwencji Erase in Line (EL) to Right (B<\e\33[K>) za każdym razem, gdy kończy pokolorowany wpis. Jest to wymagane na terminalach, które nie obsługują EL. Wartość jednak potrzebna na terminalach, dla których możliwość logiczna B<back_color_erase> (B<bce>) nie ma zastosowania, gdy wybrane kolory podświetlenia nie zmieniają tła, gdy EL jest zbyt wolne bądź powoduje znaczne migotanie. Domyślnym ustawieniem jest fałsz (tzn. możliwość jest pominięta).
uk: Логічне значення, яке запобігає очищенню до кінця рядка за допомогою Стерти в рядку (EL) Направо (B<\e33[K>) щоразу, коли закінчується розфарбований елемент. Це потрібно в терміналах, в яких EL не підтримується. Інакше кажучи, це корисно в терміналах, для яких не застосовується логічна функція terminfo B<back_color_erase> (B<bce>), коли вибрані кольори виділення не впливають на фон, або коли EL надто повільний або викликає занадто сильне мерехтіння. Типове значення — false (тобто можливість пропущена).

source: Note that boolean capabilities have no B<=>... part. They are omitted (i.e., false) by default and become true when specified.
fr: Notez que les capacités booléennes n'ont pas de partie « B<=>... ». Elles sont omises par défaut (ce qui correspond à une valeur booléenne faux) et deviennent vrai si elles sont précisées.
pl: Proszę zauważyć, że wartości logiczne nie posiadają części "B<=>...". Są one domyślne pominięte (tzn. fałszywe) i stają się prawdziwe, jeśli zostaną podane.
uk: Зауважте, що логічні можливості не мають частини B<=>.... Вони пропущені (тобто false) за замовчуванням і стають істинними, коли це вказано.

source: See the Select Graphic Rendition (SGR) section in the documentation of the text terminal that is used for permitted values and their meaning as character attributes. These substring values are integers in decimal representation and can be concatenated with semicolons. B<grep> takes care of assembling the result into a complete SGR sequence (B<\e\33[>...B<m>). Common values to concatenate include B<1> for bold, B<4> for underline, B<5> for blink, B<7> for inverse, B<39> for default foreground color, B<30> to B<37> for foreground colors, B<90> to B<97> for 16-color mode foreground colors, B<38;5;0> to B<38;5;255> for 88-color and 256-color modes foreground colors, B<49> for default background color, B<40> to B<47> for background colors, B<100> to B<107> for 16-color mode background colors, and B<48;5;0> to B<48;5;255> for 88-color and 256-color modes background colors.
fr: Voir la section Select Graphic Rendition (SGR) dans la documentation du terminal texte utilisé pour avoir la liste des valeurs autorisées et leur signification comme attributs de caractère. Ces valeurs de sous-chaînes sont des entiers sous forme décimale et peuvent être concaténées à l'aide de points-virgules. B<grep> se charge d'assembler le résultat en une séquence SGR complète (B<\e\33[>...B<m>). Les valeurs courantes à concaténer sont entre autres B<1> (gras), B<4> (souligné), B<5> (clignotant), B<7> (inversé), B<39> (couleur de trait par défaut), B<30> à B<37> (couleurs de trait), B<90> à B<97> (couleurs de trait en mode 16 couleurs), B<38;5;0> à B<38;5;255> (couleurs de trait en mode 88 et 256 couleurs), B<49> (couleur de fond par défaut), B<40> à B<47> (couleurs de fond), B<100> à B<107> (couleurs de fond en mode 16 couleurs) et B<48;5;0> à B<48;5;255> (couleurs de fond en mode 88 et 256 couleurs).
pl: Proszę zapoznać się z rozdziałem Select Graphic Rendition (SGR) w dokumentacji używanego terminala tekstowego, aby dowiedzieć się jakie są dozwolone wartości oraz poznać ich znaczenie. Te wartości podciągów są liczbami całkowitymi w systemie dziesiętnym i mogą być łączone średnikami. Program B<grep> zajmuje się łączeniem rezultatu w kompletną sekwencję SGR (B<\e33[>...B<m>). Najczęściej używane wartości to: B<1> - pogrubienie, B<4> - podkreślenie, B<5> - miganie, B<7> - odwrócenie kolorów, B<39> - domyślny kolor tła, od B<30> do B<37> - kolory tekstu, od B<90> do B<97> - kolory tekstu w trybie 16 kolorów, od B<38;5;0> do B<38;5;255> - kolory tekstu w trybie 88 i 256 kolorów, B<49> - domyślny kolor tła, od B<40> do B<47> kolory tła, od B<100> do B<107> - kolory tła w trybie 16 kolorów i od B<48;5;0> do B<48;5;255> - kolory tła w trybie 88 i 256 kolorów.
uk: Дивіться розділ Select Graphic Rendition (SGR) у документації текстового терміналу, який використовується для дозволених значень та їх значення як атрибутів символів. Ці значення підрядка є цілими числами в десятковому представленні і можуть бути об'єднані крапкою з комою. B<grep> піклується про складання результату в повну послідовність SGR (B<\e\33[>...B<m>). Загальні значення для об'єднання включають B<1> для напівжирного, B<4> для підкреслення, B<5> для миготіння, B<7> для зворотного, B<39> для кольору тексту за замовчуванням, B<30> до B<37 > для кольорів тексту, B<90> до B<97> для 16-кольорового режиму кольорів тексту, B<38;5;0> до B<38;5;255> для кольорів тексту з 88 та 256 кольорів , B<49> для кольору фону за замовчуванням, B<40> до B<47> для кольорів фону, B<100> до B<107> для 16-кольорового режиму кольорів фону та від B<48;5;0> до B<48;5;255> для кольорів фону у режимах 88 та 256 кольорів.

source: Copyright 1998\(en2000, 2002, 2005\(en2017 Free Software Foundation, Inc.
uk: Авторські права належать 1998\(en2000, 2002, 2005\(en2017 Free Software Foundation, Inc.)

source: Email bug reports to
fr: Envoyez les rapports de bogues à
pl: Zgłoszenia błędów proszę wysyłać na adres:
uk: Надсилайте повідомлення про помилки електронною поштою

source: and a
fr: et un
pl: i
uk: та

source: are available.
fr: sont disponibles
uk: доступні

source: POSIX Programmer's Manual Page
fr: Page du Manuel du programmeur POSIX
pl: Podręcznik programisty POSIX
uk: Сторінка підручника програміста POSIX

source: is available. If the B<info> and B<grep> programs are properly installed at your site, the command
fr: est disponible. Si les programmes B<info> et B<grep> sont correctement installés sur votre système, la commande
pl: . Jeśli programy B<info> i B<grep> są poprawnie zainstalowane, polecenie
uk: доступний. Якщо програми B<info> і B<grep> правильно встановлені на вашому сайті, команда

source: An
fr: Un
pl: Dostępne są:

source: A
fr: Un
pl: Dostępny jest:
