Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: User Commands
fr: Commandes de l'utilisateur
nl: Opdrachten voor gebruikers
pl: Polecenia użytkownika
pt_br: Comandos de usuário
uk: Команди користувача

source: NAME
fr: NOM
nl: NAAM
pl: NAZWA
pt_br: NOME
uk: НАЗВА

source: grep, egrep, fgrep - print lines that match patterns
fr: grep, egrep, fgrep - Afficher les lignes correspondant à un motif donné
nl: grep, egrep, fgrep - toon regels die voldoen aan een patroon
pl: grep, egrep, fgrep - wypisuje wiersze pasujące do wzorca
pt_br: grep, egrep, fgrep - emite linhas que coincidam com padrões
uk: grep, egrep, fgrep - вивід рядків узгоджених із зразком

source: SYNOPSIS
nl: SAMENVATTING
pl: SKŁADNIA
pt_br: SINOPSE
uk: КОРОТКИЙ ОПИС

source: B<grep> [I<OPTION>.\|.\|.]\& I<PATTERNS> [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTION>.\|.\|.]\& I<MOTIF> [I<FICHIER>.\|.\|.]
nl: B<grep> [I<OPTIE>.\|.\|.]\& I<PATRONEN> [I<BESTAND>.\|.\|.]
pl: B<grep> [I<OPCJA>.\|.\|.]\& I<WZORCE> [I<PLIK>.\|.\|.]
pt_br: B<grep> [I<OPÇÃO>.\|.\|.]\& I<PADRÕES> [I<ARQUIVO>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>.\|.\|.]\& I<ЗРАЗОК> [I<ФАЙЛ>.\|.\|.]

source: B<grep> [I<OPTION>.\|.\|.]\& B<-e> I<PATTERNS> \&.\|.\|.\& [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTION>.\|.\|.]\& B<-e> I<MOTIF> \&.\|.\|.\& [I<FICHIER>.\|.\|.]
nl: B<grep> [I<OPTIE>.\|.\|.]\& B<-e> I<PATRONEN> \&.\|.\|.\& [I<BESTAND>.\|.\|.]
pl: B<grep> [I<OPCJA>.\|.\|.]\& B<-e> I<WZORCE> \&.\|.\|.\& [I<PLIK>.\|.\|.]
pt_br: B<grep> [I<OPÇÃO>.\|.\|.]\& B<-e> I<PADRÕES> \&.\|.\|.\& [I<ARQUIVO>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>.\|.\|.]\& B<-e> I<ЗРАЗОК> \&.\|.\|.\& [I<ФАЙЛ>.\|.\|.]

source: B<grep> [I<OPTION>.\|.\|.]\& B<-f> I<PATTERN_FILE> \&.\|.\|.\& [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTION>.\|.\|.]\& B<-f> I<MOTIF_FICHIER> \&.\|.\|.\& [I<FICHIER>.\|.\|.]
nl: B<grep> [I<OPTIE>.\|.\|.]\& B<-f> I<PATROON_BESTAND> \&.\|.\|.\& [I<BESTAND>.\|.\|.]
pl: B<grep> [I<OPCJA>.\|.\|.]\& B<-f> I<PLIK_WZORCOWY> \&.\|.\|.\& [I<PLIK>.\|.\|.]
pt_br: B<grep> [I<OPÇÃO>.\|.\|.]\& B<-f> I<ARQUIVO_PADRÃO> \&.\|.\|.\& [I<ARQUIVO>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>.\|.\|.]\& B<-f> I<ФАЙЛ_ВЗІРЦІВ> \&.\|.\|.\& [I<ФАЙЛ>.\|.\|.]

source: DESCRIPTION
nl: BESCHRIJVING
pl: OPIS
pt_br: DESCRIÇÃO
uk: ОПИС

source: B<grep> searches for I<PATTERNS> in each I<FILE>. I<PATTERNS> is one or more patterns separated by newline characters, and B<grep> prints each line that matches a pattern. Typically I<PATTERNS> should be quoted when B<grep> is used in a shell command.
fr: B<grep> cherche un I<MOTIF> dans chaque I<FICHIER>. I<MOTIF> est un ou plusieurs motifs séparés par un retour à la ligne et B<grep> affiche chaque ligne correspondant à un motif. Généralement, I<MOTIF> devrait être entre guillemets lorsque B<grep> est utilisé dans un interpréteur de commandes.
nl: B<grep> zoekt het I<PATROON> in elk I<BESTAND>. I<PATROON> zijn een of meer patronen gescheiden voor nieuwe regel tekens, B<grep> toont dan elke regel dit voldoet aan een patroon. Als B<grep> in een shell commando gebruikte wordt dan zal I<PATROON> tussen aanhalingstekens moeten staan.
pl: B<grep> szuka I<WZORCÓW> w każdym I<PLIKU>. Wzorców może być więcej niż jeden, należy je wówczas rozdzielić znakiem nowego wiersza, przy czym B<grep> wypisze każdy wiersz pasujący do któregoś z wzorców. I<WZORCE> powinny być zwykle cytowane, jeśli B<grep> jest używany jako polecenie powłoki.
pt_br: B<grep> pesquisa I<PADRÕES> em cada I<ARQUIVO>. I<PADRÕES> é um ou mais padrões separados por caracteres de nova linha e B<grep> emite cada linha que coincide com um padrão. Normalmente, I<PADRÕES> deve ser colocado entre aspas quando B<grep> é usado em um comando shell.
uk: B<grep> шукає відповідність зі I<ЗРАЗКОМ> у кожному I<ФАЙЛІ>. I<ЗРАЗОК> – це один або кілька шаблонів, розділених символами нового рядка, а B<grep> виводить кожен рядок, який відповідає шаблону. Зазвичай, коли B<grep> використовується в командній оболонці, I<ШАБЛОН> слід вводити в лапках.

source: A I<FILE> of ``B<->'' stands for standard input. If no I<FILE> is given, recursive searches examine the working directory, and nonrecursive searches read standard input.
fr: Un fichier « B<-> » signifie l'entrée standard. Si aucun I<FICHIER> n'est donné, les recherches récursives explorent le répertoire de travail et celles non récursives lisent l'entrée standard.
nl: Een I<BESTAND> of `B<->` betekent standaard invoer. Als geen I<BESTAND> werd opgegeven, dan zullen de werk map recursief doorzocht worden, en niet recursieve zoekopdrachten lezen de standaard invoer.
pl: I<PLIK> B<-> oznacza standardowe wejście. Jeśli nie podano I<PLIKU>, rekurencyjne wyszukiwania sprawdzą obecny katalog roboczy, a nierekurencyjne - czytają ze standardowego wejścia.
pt_br: Um I<ARQUIVO> de ``B<->'' significa entrada padrão. Se nenhum I<ARQUIVO> for fornecido, as pesquisas recursivas examinam o diretório de trabalho e as pesquisas não-recursivas leem a entrada padrão.
uk: I<ФАЙЛ> із ``B<->'' означає стандартне введення. Якщо I<ФАЙЛ> не вказано, рекурсивний пошук перевіряє поточний каталог, а нерекурсивний зчитує стандартне введення.

source: In addition, the variant programs B<egrep> and B<fgrep> are the same as B<grep\ -E> and B<grep\ -F>, respectively. These variants are deprecated, but are provided for backward compatibility.
fr: En outre, les variantes B<egrep> et B<fgrep> sont respectivement les mêmes que les programmes B<grep\ -E> et B<grep\ -F>. Ces variantes sont obsolètes mais sont fournies pour la rétro compatibilité.
nl: In aanvulling hierop, de varianten B<egrep> en B<fgrep> komen overeen met B<grep\ -E> respectievelijk B<grep\ -F>. Deze varianten zijn afgekeurd, maar worden behouden vanwege compatibiliteit.
pl: Dodatkowo, programy wariantowe B<egrep> oraz B<fgrep> są synonimami odpowiednio: B<grep\ -E> oraz B<grep\ -F>. Te warianty są przestarzałe, ale są utrzymywane w celu zachowania kompatybilności wstecznej.
pt_br: Além disso, os programas variantes B<egrep> e B<fgrep> são os mesmos que B<grep\ -E> e B<grep\ -F>, respectivamente. Essas variantes foram descontinuadas, mas são fornecidas para compatibilidade com versões anteriores.
uk: Крім того, варіанти програм B<egrep> та B<fgrep> роблять те саме, що й B<grep\ -E> та B<grep\ -F> відповідно. Ці варіанти не підтримуються, але надаються для зворотної сумісності.

source: OPTIONS
nl: OPTIES
pl: OPCJE
pt_br: OPÇÕES
uk: ПАРАМЕТРИ

source: Generic Program Information
fr: Informations générales sur le programme
nl: Algemene Programma Informatie
pl: Standardowe informacje programu
pt_br: Informações genéricas do programa
uk: Загальна інформація про програму

source: Output a usage message and exit.
fr: Afficher un message d'utilisation et quitter.
nl: Geef een kort help bericht en stop.
pl: Wyświetla komunikat pomocy i wychodzi.
pt_br: Emite uma mensagem de uso e sai.
uk: Виводить повідомлення щодо користування програмою та закривається.

source: Output the version number of B<grep> and exit.
fr: Afficher le numéro de version de B<grep> et quitter.
nl: Toon versie nummer van B<grep> en stop.
pl: Wyświetla numer wersji B<grep> i wychodzi.
pt_br: Mostra o número de versão do B<grep> e sai.
uk: Виводить номер версії B<grep>.

source: Pattern Syntax
fr: Syntaxe du motif
nl: Patroon syntaxis
pl: Składnia wzorca
pt_br: Sintaxe de padrão
uk: Синтаксис шаблонів

source: Interpret I<PATTERNS> as extended regular expressions (EREs, see below).
fr: Interpréter le I<MOTIF> comme une expression rationnelle étendue (ERE, voir ci-dessous).
nl: Interpreteer I<PATROON> uit als een uitgebreide reguliere expressie (zie onder).
pl: Interpretuje I<WZORCE> jako rozszerzone wyrażenie regularne (ERE, patrz niżej).
pt_br: Interpreta I<PADRÕES> como expressões regulares estendidas (EREs, veja abaixo).
uk: I<ЗРАЗОК> розглядається як розширені регулярні вирази (ERE, див. нижче).

source: Interpret I<PATTERNS> as fixed strings, not regular expressions.
fr: Interpréter le I<MOTIF> comme étant une chaîne figée, pas une expression rationnelle.
nl: Interpreteer I<PATROON> als vaste tekst, niet als reguliere expressies.
pl: Interpretuje I<WZORCE> jako literalne ciągi znaków, a nie jako wyrażenia regularne.
pt_br: Interpreta I<PADRÕES> como textos fixos, não como expressões regulares.
uk: I<ЗРАЗОК> розглядається як фіксовані рядки, а не регулярні вирази.

source: Interpret I<PATTERNS> as basic regular expressions (BREs, see below). This is the default.
fr: Interpréter le I<MOTIF> comme une expression rationnelle simple (BRE, voir ci-dessous). C'est le comportement par défaut.
nl: Interpreteer I<PATROON> als een reguliere expressie (BRE´s, zie hieronder). Dit is de standaard.
pl: Interpretuje I<WZORCE> jako podstawowe wyrażenie regularne (BRE, patrz niżej). Jest to zachowanie domyślne.
pt_br: Interpreta I<PADRÕES> como expressões regulares básicas (BREs, veja abaixo). Esse é o padrão.
uk: I<ЗРАЗОК> інтерпретується як основні регулярні вирази (BRE, див. нижче). Це є типове значення.

source: Interpret IE<lt>PATTERNSE<gt> as Perl-compatible regular expressions (PCREs). This option is experimental when combined with the B<-z> (B<-\^-null-data>) option, and B<grep -P> may warn of unimplemented features.
fr: Interpréter le I<MOTIF> comme une expression rationnelle Perl (PCRE, voir ci-dessous). Cette option est expérimentale quand on la combine à B<-z> (B<-\^-null-data>) et B<grep -P> pourrait signaler des fonctionnalités non implémentées.
nl: #FIXME PATTERNSE -> PATTERNS Interpreteer IE<lt>PATROON<gt> als een PERL-compatibele reguliere expressie (PCRE´s). Deze optie is experimenteel indien deze gecombineerd wordt met de met B<-z> (B<-\^-null-data>) optie, en B<grep -P> zou kunnen waarschuwen over niet geïmplementeerde features.
pl: Interpretuje I<WZORCE> jako wyrażenie regularne kompatybilne z Perlem (PCRE). Jest to opcja wysoce eksperymentalna, połączenie z opcjami B<-z> (B<-\^-null-data>) oraz B<grep -P> może ostrzegać o jeszcze niewdrożonych funkcjach.
uk: IE<lt>ЗРАЗОКE<gt> розглядається як Perl-сумісний формальний вираз (PCRE). Цей параметр є експериментальним у поєднанні з параметром B<-z> (B<-\^-null-data>), а B<grep -P> може попереджати про нереалізовані функції.

source: Matching Control
fr: Contrôle de correspondance
nl: Vergelijkings instellingen
pl: Kontrola dopasowania
pt_br: Controle de coincidências
uk: Контроль відповідності

source: B<-e>I< PATTERNS>,B< -\^-regexp=>I<PATTERNS>
fr: B<-e> I<MOTIF>,B< -\^-regexp=>I<MOTIF>
nl: B<-e>I< PATRONEN>,B< -\^-regexp=>I<PATRONEN>
pl: B<-e> I<WZORCE>,B< -\^-regexp=>I<WZORCE>
pt_br: B<-e>I< PADRÕES>,B< -\^-regexp=>I<PADRÕES>
uk: B<-e>I< PATTERNS>,B< -\^-regexp=>I<ЗРАЗОК>

source: Use I<PATTERNS> as the patterns. If this option is used multiple times or is combined with the B<-f> (B<-\^-file>) option, search for all patterns given. This option can be used to protect a pattern beginning with ``-''.
fr: Utiliser I<MOTIF> comme motif. Si cette option est utilisée plusieurs fois ou en combinaison avec l'option B<-f> (B<-\\^-file>), rechercher les motifs donnés. Cette option peut être utilisée pour protéger un motif commençant par « - ».
nl: Gebruik I<PATRONEN> als patronen. Als deze optie meerdere keren gebruikt of gecombineerd wordt de met B<-f> (B<-\^-file>) optie, zoek dan alle gegeven patronen. Deze optie kan gebruikt worden om patronen die beginnen met "-" te beschermen.
pl: Używa I<WZORCE> jako wzorca. Jeżeli ta opcja została użyta wielokrotnie lub jest połączona z opcją B<-f> (B<-\^-file>), szuka wszystkich podanych wzorców. Ta opcja może być użyta do ochrony wzorców rozpoczynających się znakiem "-".
pt_br: Usa I<PADRÕES> como os padrões. Se esta opção for usada várias vezes ou for combinada com a opção B<-f> (B<-\^-file>), pesquisa por todos os padrões fornecidos. Esta opção pode ser usada para proteger um padrão começando com ``-''.
uk: I<ЗРАЗОК> використовується як шаблон. Якщо цей параметр використовувати кілька разів або поєднати з параметром B<-f> (B<-\^-file>), відшукуються усі задані зразки. Цей параметр можна використовувати для захисту зразка, який починається з ``-''.

source: B<-f>I< FILE>,B< -\^-file=>I<FILE>
fr: B<-f> I<FICHIER>,B< -\^-file=>I<FICHIER>
nl: B<-f>I< BESTAND>,B< -\^-file=>I<BESTAND>
pl: B<-f>I< PLIK>,B< -\^-file=>I<PLIK>
pt_br: B<-f>I< ARQUIVO>,B< -\^-file=>I<ARQUIVO>
uk: B<-f>I< ФАЙЛ>,B< -\^-file=>I<ФАЙЛ>

source: Obtain patterns from I<FILE>, one per line. If this option is used multiple times or is combined with the B<-e> (B<-\^-regexp>) option, search for all patterns given. The empty file contains zero patterns, and therefore matches nothing.
fr: Utiliser les motifs depuis I<FICHIER>, un par ligne. Si cette option est utilisée plusieurs fois ou combinée avec l'option B<-e> (B<-\^-regexp>), rechercher tous les motifs donnés. Un fichier vide ne contient pas de motif et ne donne donc aucun résultat.
nl: Lees de patronen uit I<BESTAND>, een per regel. Als deze optie meerdere keren gebruikt of gecombineerd wordt de met B<-e> (B<-\^-regexp>) optie, zoek dan alle gegeven patronen. Een leeg bestand bevat geen patronen en vergelijkt daarom niets.
pl: Pobiera wzorce z I<PLIKU>, po jednym na wiersz. Jeżeli ta opcja została użyta wielokrotnie lub jest połączona z opcją B<-e> (B<-\^-regexp>), szuka wszystkich podanych wzorców. Pusty plik zawiera zero wzorców, więc nie pasuje do niczego.
pt_br: Obtém padrões de I<ARQUIVO>, um por linha. Se esta opção for usada várias vezes ou for combinada com a opção B<-e> (B<-\^-regexp>), pesquisa todos os padrões fornecidos. O arquivo vazio contém zero padrões e, portanto, não coincide com nada.
uk: З I<ФАЙЛ>, отримуються зразки по одному на рядок. Якщо цей параметр використовувати кілька разів або поєднати з параметром B<-e> (B<-\^-regexp>), відшукуються усі задані зразки. Порожній файл не містить зразків, тому нічого не відповідає.

source: Ignore case distinctions in patterns and input data, so that characters that differ only in case match each other.
fr: Ignorer les distinctions de casse dans les motifs et les données d'entrée, pour que les correspondances incluent les caractères qui ne diffèrent que par leur casse.
nl: Negeer het verschil tussen hoofd- en kleine letters in patronen en de invoer bestanden, zodat alleen tekens die hierdoor verschillen bij elkaar horen.
pl: Ignoruje różnicę wielkości liter we wzorcach oraz danych wejściowych, tak by znaki, które różnią się tylko wielkością pasowały do siebie.
pt_br: Ignora as diferenças entre maiúsculas e minúsculas nos padrões e nos dados de entrada, para que os caracteres que diferem apenas no caso de coincidirem um ao outro.
uk: У зразках та вхідних даних ігнорується різниця регістру, щоб символи, які відрізняються лише регістром, вважалися відповідними.

source: Do not ignore case distinctions in patterns and input data. This is the default. This option is useful for passing to shell scripts that already use B<-i>, to cancel its effects because the two options override each other.
fr: Ne pas ignorer les distinctions de casse dans les motifs et les données d'entrée, c'est le comportement par défaut. Cette option sert à dire aux scripts shell qui utilisent déjà B<-i> d'annuler ses effets puisque les deux options s'outrepassent entre elles.
nl: Negeer verschillen in hoofd- en kleine letters in patronen en invoer data niet. Dit is de standaard. Deze optie is nuttig voor doorgeven naar shell scripts die al B<-i> gebruiken, om het effect te onderdrukken want de twee opties overschrijven elkaar.
pl: Nie ignoruje różnicy wielkości liter we wzorcach oraz w danych wejściowych. Jest to zachowanie domyślne. Ta opcja jest użyteczna by przekazać skryptowi powłoki, który już używa B<-i>, by anulował ten efekt ponieważ te dwie opcje się nadpisują.
pt_br: Não ignora as diferenças entre maiúsculas e minúsculas nos padrões e nos dados de entrada. Esse é o padrão. Esta opção é útil para passar para shell scripts que já usam B<-i>, para cancelar seus efeitos porque as duas opções se substituem.
uk: У зразках та вхідних даних не ігнорується регістр. Це типове значення. Цей параметр корисний для передавання до скриптів оболонки, які вже використовують B<-i>, для скасування його ефектів, оскільки ці два параметри перемикають один одного.

source: Invert the sense of matching, to select non-matching lines.
fr: Inverser la mise en correspondance, pour sélectionner les lignes ne correspondant pas au motif.
nl: Keer de manier van vergelijken om, om niet-passende regels te kiezen.
pl: Odwraca sens dopasowania, wybierając wiersze niepasujące.
pt_br: Inverte o sentido de coincidência, para selecionar linhas que não coincidem.
uk: Параметр відповідності обертається, щоб вибирати невідповідні зразку рядки.

source: Select only those lines containing matches that form whole words. The test is that the matching substring must either be at the beginning of the line, or preceded by a non-word constituent character. Similarly, it must be either at the end of the line or followed by a non-word constituent character. Word-constituent characters are letters, digits, and the underscore. This option has no effect if B<-x> is also specified.
fr: Ne sélectionner que les lignes contenant des correspondances formant des mots complets. La sous-chaîne correspondante doit donc soit se trouver au début de la ligne, soit être précédée d'un caractère ne pouvant entrer dans la constitution d'un mot. De même, elle doit soit se trouver à la fin de la ligne, soit être suivie par un caractère ne pouvant entrer dans la constitution d'un mot. Les caractères composant les mots sont les lettres, les chiffres et le souligné «\ _\ ». Cette option est sans effet si B<-x> est également spécifié.
nl: Selecteer alleen die regels die passen op hele woorden. Er wordt getest of de passende sub-tekst aan het begin van de regel zit, of voorafgegaan door een niet-woord teken. Net zo, moet het aan het einde van de regel zitten, of gevolgd worden door een niet-woord karakter. Tekens die in woorden voorkomen zijn letters, cijfers en het liggende streepje. Deze optie heeft geen effect als ook B<-x> werd opgegeven.
pl: Wybiera tylko te wiersze, w których dopasowane wzorce tworzą całe słowa. Przeprowadzany test polega na tym, że dopasowany podłańcuch musi albo znajdować się na początku wiersza, albo być poprzedzony znakiem nietworzącym słowa. Podobnie, musi albo znajdować się na końcu wiersza, albo musi następować po nim znak nietworzący słowa. Znakami tworzącymi słowa są litery, cyfry i znak podkreślenia. Ta opcja nie zadziała, jeśli podano również B<-x>.
pt_br: Seleciona apenas as linhas que coincidem formando palavras inteiras. O teste é que a parte de texto coincidente deve estar no início da linha ou precedida por um caractere que não seja de palavra. Da mesma forma, ele deve estar no final da linha ou ser seguido por um caractere que não seja de palavra. Os caracteres constituintes da palavra são letras, dígitos e o sublinhado. Esta opção não tem efeito se B<-x> também estiver especificado.
uk: Вибираються лише ті рядки, що містять збіги, які утворюють цілі слова. Перевірка полягає в тому, що підрядок, який збігається, може знаходитися на початку рядка, або передувати символу, який не входить до складу слова. Так само він може бути в кінці рядка, або за ним може слідувати символ, який не входить до складу слова. Символами, що входять до складу слова, є літери, цифри та символ підкреслення. Цей параметр не діє, якщо також вказано B<-x>.

source: Select only those matches that exactly match the whole line. For a regular expression pattern, this is like parenthesizing the pattern and then surrounding it with B<^> and B<$>.
fr: Ne sélectionner que les correspondances exactes de ligne entière. Pour un motif d'expression rationnelle, c'est comme si on met le motif entre parenthèses et qu'on l'ancre entre B<^> et B<$>.
nl: Selecteer alleen die overeenkomsten die precies met een hele regel overeenkomen. Voor een reguliere expressie patroon, komt dit overeen met het tussen haakjes zetten van het patroon en het omgeven met B<^> en B<$>.
pl: Wybiera tylko te dopasowania, które dokładnie pasują do całego wiersza. W przypadku wzoru wyrażenia regularnego, ma to taki sam skutek, jak umieszczenie całego wyrażenia w nawiasach i otoczenie go B<^> oraz B<$>.
pt_br: Seleciona apenas as partes de texto que coincidem exatamente com a linha inteira. Para um padrão de expressão regular, é como colocar parênteses no padrão e depois envolvê-lo com B<^> e B<$>.
uk: Вибираються лише повністю відповідні зразку строки. Для зразка регулярного виразу це все одно, що помістити шаблон у круглі дужки, а потім оточити його B<^> і B<$>.

source: Obsolete synonym for B<-i>.
fr: Synonyme obsolète de B<-i>.
nl: Verouderd synoniem voor B<-i>.
pl: Przestarzały synonim B<-i>.
pt_br: Sinônimo obsoleto para B<-i>.
uk: Застарілий синонім до B<-i>.

source: General Output Control
fr: Contrôle général de l'affichage
nl: Algemene uitvoer instellingen
pl: Ogólna kontrola wyniku
pt_br: Controle geral de saída
uk: Загальне керування виведенням

source: Suppress normal output; instead print a count of matching lines for each input file. With the B<-v>, B<-\^-invert-match> option (see below), count non-matching lines.
fr: Ne pas afficher les résultats normaux. À la place, afficher un décompte des lignes correspondant au motif pour chaque fichier. Avec l'option B<-v>, B<-\^-invert-match> (voir ci-dessous), afficher le nombre de lignes ne contenant pas le motif.
nl: Onderdruk normale uitvoer; druk in plaats daarvan een optelling van de passende regels af voor elk invoer bestand. Met de B<-v>, B<-\^-invert-match> optie (zie onder), tel niet-overeenkomende regels.
pl: Wyłącza normalne wyjście, zamiast niego, dla każdego pliku wejściowego, wypisuje liczbę pasujących wierszy. Z opcją B<-v>, B<-\^-invert-match> (patrz niżej), liczy wiersze niepasujące.
pt_br: Inibe saída normal; em vez disso, emite uma contagem de linhas que coincidam a cada arquivo de entrada. Com a opção B<-v>, B<-\^-invert-match> (veja acima), conta linhas que não coincidem.
uk: Пригнічує звичайний вивід; замість цього виводить кількість відповідних рядків для кожного файлу вводу. За допомогою параметра B<-v>, B<-\^-invert-match> (див. нижче), виводить число рядків, які не збігаються.

source: B<-\^-color>[B<=>I<WHEN>], B<-\^-colour>[B<=>I<WHEN>]
fr: B<-\^-color>[B<=>I<QUAND>], B<-\^-colour>[B<=>I<QUAND>]
nl: B<-\^-color>[B<=>I<WANNEER>], B<-\^-colour>[B<=>I<WANNEER>]
pl: B<-\^-color>[B<=>I<KIEDY>], B<-\^-colour>[B<=>I<KIEDY>]
pt_br: B<-\^-color>[B<=>I<QUANDO>], B<-\^-colour>[B<=>I<QUANDO>]
uk: B<-\^-color>[B<=>I<КОЛИ>], B<-\^-colour>[B<=>I<КОЛИ>]
