Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: These variables specify the locale for the B<LC_CTYPE> category, which determines the type of characters, e.g., which characters are whitespace. This category also determines the character encoding, that is, whether text is encoded in UTF-8, ASCII, or some other encoding. In the C or POSIX locale, all characters are encoded as a single byte and every byte is a valid character.
fr: Ces variables spécifient les paramètres régionaux de la catégorie B<LC_CTYPE>, ce qui détermine le type de caractères, par exemple, quels caractères sont des blancs. Cette catégorie détermine aussi l'encodage de caractères, c'est-à-dire si le texte est encodé en UTF-8, ASCII ou un autre encodage. Avec la locale C ou POSIX, tous les caractères sont encodés sur un octet et chaque octet est un caractère valable.
nl: Deze variabelen geven de B<LC_CTYPE> taaldefinitie op, die het soort karakters bepaalt, o.a. welke tekens witruimte zijn. De taaldefinitie wordt bepaald door de eerste van deze variabelen die is gezet. De POSIX taaldefinitie wordt gebruikt als geen van deze omgevingsvariabelen zijn gezet, of als de taaldefinitie verzameling niet is geïnstalleerd, of als B<grep> niet was gecompileerd met talen ondersteuning (NLS)
pl: Te zmienne ustawiają locale dla kategorii B<LC_CTYPE>, od której zależą typy znaków, np. które są znakami białymi. Ta kategoria również ustala kodowanie znaków, czyli to, czy tekst jest zakodowany w UTF-8, ASCII czy jakiejkolwiek innej stronie kodowej. W locale C lub POSIX, każdy znak jest zakodowany jako pojedynczy bajt, więc każdy bajt jest poprawnym znakiem.
pt_br: Essas variáveis especificam o código de idioma da categoria B<LC_CTYPE>, que determina o tipo de caracteres, por exemplo, quais caracteres são espaços em branco. Essa categoria também determina a codificação de caracteres, ou seja, se o texto é codificado em UTF-8, ASCII ou alguma outra codificação. No código de idioma C ou POSIX, todos os caracteres são codificados como um único byte e cada byte é um caractere válido.
uk: Ці змінні визначають локаль для категорії B<LC_CTYPE>, яка визначає тип символів, наприклад, які символи є пробілами. Ця категорія також визначає кодування символів, тобто кодування тексту в UTF-8, ASCII чи іншому кодуванні. У мовному стандарті C або POSIX всі символи кодуються як один байт, і кожен байт є дійсним символом.

source: These variables specify the locale for the B<LC_MESSAGES> category, which determines the language that B<grep> uses for messages. The default C locale uses American English messages.
fr: Ces variables indiquent le choix des paramètres régionaux pour la catégorie B<LC_MESSAGES>, qui détermine la langue utilisée par B<grep> pour ses messages. Les paramètres «\ C\ » utilisés par défaut sont en anglais américain.
nl: Deze variabelen specificeren de B<LC_MESSAGES> categorie, die de taal bepaalt die B<grep> gebruikt voor berichten. De standaard C taaldefinitie gebruikt Amerikaans Engelse berichten.
pl: Zmienne określające ustawienia regionalne dla kategorii B<LC_MESSAGES>, która wyznacza język, używany przez B<grep>a do wyświetlania komunikatów. Domyślne locale C używają wiadomości w amerykańskiej odmianie angielskiego.
pt_br: Essas variáveis especificam o código de idioma da categoria B<LC_MESSAGES>, que determina o idioma que B<grep> usa para mensagens. A localidade C padrão usa mensagens em inglês americano.
uk: Ці змінні визначають локаль для категорії B<LC_MESSAGES>, яка визначає мову, що B<grep> використовується для повідомлень. Місцевий стандарт C за замовчуванням використовує повідомлення американською англійською мовою.

source: If set, B<grep> behaves as POSIX requires; otherwise, B<grep> behaves more like other GNU programs. POSIX requires that options that follow file names must be treated as file names; by default, such options are permuted to the front of the operand list and are treated as options. Also, POSIX requires that unrecognized options be diagnosed as ``illegal'', but since they are not really against the law the default is to diagnose them as ``invalid''. B<POSIXLY_CORRECT> also disables B<_>I<N>B<_GNU_nonoption_argv_flags_>, described below.
fr: Si cette variable est positionnée, B<grep> se comporte comme indiqué dans la norme \s-1POSIX\s0. Sinon, B<grep> se comporte plus comme les autres programmes \s-1GNU\s0. \s-1POSIX\s0 requiert que les options qui suivent des noms de fichiers soient considérées aussi comme des noms de fichiers. Par défaut, ces options sont déplacées avant la liste des opérandes et sont traitées comme des options. \s-1POSIX\s0 requiert aussi que les options non reconnues soient considérées comme «\ illégales\ »\ ; mais comme elles n'enfreignent pas vraiment les règles, elles sont rapportées comme étant «\ incorrectes\ » par défaut. B<POSIXLY_CORRECT> désactive aussi l'option B<_>I<N>B<_GNU_nonoption_argv_flags_>, qui est décrite plus bas.
nl: Indien gezet gedraagt B<grep> zich zoals POSIX; anders gedraagt B<grep> zich meer zoals andere GNU programma's. POSIX vereist dat de opties die volgen op bestandsnamen, behandeld moeten worden als bestandsnamen; standaard worden dergelijke opties verplaatst naar het begin van de operanden lijst en worden behandeld als opties. Ook eist POSIX dat de niet herkende opties als "onwettig" worden aangemerkt, maar omdat ze niet echt tegen de wet zijn worden ze normaal aangemerkt als "ongeldig". B<POSIXLY_CORRECT> zet ook B<_>I<N>B<_GNU_nonoption_argv_flags_> uit, hieronder beschreven.
pl: Jeśli jest ustawiona, to B<grep> zachowuje się zgodnie z wymaganiami normy POSIX; w przeciwnym razie B<grep> działa bardziej jak inne programy GNU. POSIX wymaga, by opcje, które występują po nazwach plików były traktowane jak nazwy plików; domyślnie zaś, opcje takie są przesuwane na początek listy argumentów i traktowane jak opcje. Ponadto, POSIX wymaga, by nierozpoznane opcje były zgłaszane jako "nielegalne" ("illegal"), ale ponieważ tak naprawdę nie naruszają one prawa, domyślnie zgłaszane są jako "nieprawidłowe" ("invalid"). B<POSIXLY_CORRECT> wyłącza także B<_>I<N>B<_GNU_nonoption_argv_flags_>, opisane poniżej.
pt_br: Se definida, B<grep> se comporta conforme requer o POSIX; caso contrário, B<grep> se comporta mais como outros programas GNU. O POSIX requer que as opções que seguem os nomes dos arquivos sejam tratadas como nomes de arquivo; por padrão, essas opções são permutadas para a frente da lista de operandos e são tratadas como opções. Além disso, o POSIX exige que as opções não reconhecidas sejam diagnosticadas como ``ilegais'', mas como elas não são realmente contrárias à lei, o padrão é diagnosticá-las como ``inválidas''. B<POSIXLY_CORRECT> também desativa B<_>I<N>B<_GNU_nonoption_argv_flags_>, descrito abaixo.
uk: Якщо це встановлено, B<grep> поводить себе так, як вимагає POSIX; інакше B<grep> поводить себе більше як інші програми GNU. POSIX вимагає, щоб параметри, які йдуть за іменами файлів, розглядалися як імена файлів; за замовчуванням такі параметри переміщуються на початку списку операндів і розглядаються як параметри. Крім того, POSIX вимагає, щоб нерозпізнані параметри були діагностовані як "незаконні", але оскільки вони насправді не суперечать закону, за замовчуванням їх діагностують як "недійсні". B<POSIXLY_CORRECT> також вимикає B<_>I<N>B<_GNU_nonoption_argv_flags_>, описану нижче.

source: (Here I<N> is B<grep>'s numeric process ID.) If the I<i>th character of this environment variable's value is B<1>, do not consider the I<i>th operand of B<grep> to be an option, even if it appears to be one. A shell can put this variable in the environment for each command it runs, specifying which operands are the results of file name wildcard expansion and therefore should not be treated as options. This behavior is available only with the GNU C library, and only when B<POSIXLY_CORRECT> is not set.
fr: (Ici, I<N> est l'identifiant numérique du processus de B<grep>). Si le I<i>-ième caractère de la valeur de cette variable d'environnement vaut B<1>, le I<i>-ième opérande de B<grep> n'est pas considéré comme étant une option, même s'il semble l'être. Un shell peut placer cette variable dans l'environnement de chaque commande lancée, pour spécifier quels opérandes sont le résultat du remplacement de métacaractères et ne doivent donc pas être considérés comme des options. Ce comportement n'est présent qu'avec la bibliothèque C de \s-1GNU\s0, et seulement si B<POSIXLY_CORRECT> n'est pas positionnée.
nl: (Hier is I<N> B<grep>'s numerieke proces ID.) Als het I<i>de teken van deze omgevingsvariabele waarde B<1> is, beschouw het I<i>de operand voor B<grep> niet als een optie, zelfs als het er een lijkt te zijn. De shell kan deze variabele in de omgeving plaatsen voor elke opdracht die het start, daarmee opgevend welke operanden het resultaat zijn van jokerteken expansie en daarom niet behandeld zou moeten worden als een optie. Dit gedrag is alleen beschikbaar met de GNU C bibliotheek, en alleen wanneer B<POSIXLY_CORRECT> niet gezet is.
pl: I<N> jest tu numerycznym identyfikatorem procesu B<grep>a. Jeśli I<i>-tym znakiem wartości tej zmiennej środowiska jest B<1>, to I<i>-ty argument przekazany do B<grep>a nie jest uważany za opcję, nawet jeśli na nią wygląda. Powłoka może umieścić tę zmienną w środowisku dla każdego polecenia jakie uruchamia, podając, które argumenty są wynikiem rozwinięcia nazw plików i dlatego nie powinny być traktowane jako opcje. Zachowanie to jest dostępne tylko z biblioteką GNU C i tylko wtedy, gdy nie ustawiono B<POSIXLY_CORRECT>.
pt_br: (Aqui I<N> é o ID numérico do processo de B<grep>.) Se o I<i>-nésimo caractere do valor dessa variável de ambiente for B<1>, não considera o I<i>-nésimo operando de B<grep> para ser uma opção, mesmo que pareça ser uma. Um shell pode colocar essa variável no ambiente para cada comando executado, especificando quais operandos são os resultados da expansão de curinga do nome do arquivo e, portanto, não devem ser tratados como opções. Esse comportamento está disponível apenas na biblioteca GNU C e somente quando B<POSIXLY_CORRECT> não está definida.
uk: (Тут I<N> — числовий ідентифікатор процесу B<grep>.) Якщо I<i>-й символ значення цієї змінної середовища є B<1>, I<i>-й операнд B<grep> не розглядає як опцію, навіть якщо здається, що це так. Оболонка може розмістити цю змінну в середовищі для кожної команди, яку вона запускає, вказуючи, які операнди є результатами розширення підстановки імені файлу, і тому не повинні розглядатися як параметри. Ця поведінка доступна лише з бібліотекою GNU C і лише тоді, коли не встановлено B<POSIXLY_CORRECT>.

source: NOTES
nl: OPMERKINGEN
pl: UWAGI
pt_br: NOTAS
uk: ПРИМІТКИ

source: This man page is maintained only fitfully; the full documentation is often more up-to-date.
fr: Cette page de manuel est maintenue de façon intermittente. La documentation complète est mise à jour plus souvent.
nl: Deze handleiding wordt sporadisch onderhouden; de volledige documentatie is vaker beter bijgewerkt.
pl: Niniejsza strona podręcznika jest utrzymywana jedynie częściowo - pełna dokumentacja jest często aktualniejsza.
pt_br: Esta página man é mantida apenas de forma adequada; a documentação completa geralmente é mais atualizada.
uk: Ця довідкова сторінка підтримується лише періодично; повна документація часто є більш актуальною.

source: COPYRIGHT
pl: PRAWA AUTORSKIE
pt_br: DIREITOS AUTORAIS
uk: АВТОРСЬКІ ПРАВА

source: Copyright 1998-2000, 2002, 2005-2021 Free Software Foundation, Inc.
nl: Copyright 1998-2000, 2002, 2005-2020 Free Software Foundation, Inc.
uk: Авторські права належать 1998-2000, 2002, 2005-2021 Free Software Foundation, Inc.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
fr: C'est un logiciel libre ; consultez les sources pour les conditions de copie. Il n'y a AUCUNE garantie ; même pas de VALEUR MARCHANDE ou d'ADÉQUATION À UNE UTILISATION PARTICULIÈRE.
nl: Dit is vrije software; zie de programmatekst voor de kopieervoorwaarden. Er is GEEN garantie; zelfs niet voor VERKOOPBAARHEID of GESCHIKTHEID VOOR EEN BEPAALD DOEL.
pl: Jest to wolne oprogramowanie; warunki rozpowszechniania znajdują się w źródle programu. NIE ma gwarancji, nawet PRZYDATNOŚCI HANDLOWEJ czy PRZYDATNOŚCI DO OKREŚLONEGO CELU.
pt_br: Este é um software livre; consulte o código-fonte para condições de cópia. Há NENHUMA garantia; nem mesmo para COMERCIALIZAÇÃO ou ADEQUAÇÃO A UM OBJETIVO ESPECÍFICO.
uk: Це безкоштовне програмне забезпечення; дивіться джерело для умов копіювання. НЕМАЄ гарантії; навіть не для ПРОДАЖУ чи ПРИДАТНОСТІ ДЛЯ КОНКРЕТНОЇ МЕТИ.

source: BUGS
fr: BOGUES
pl: BŁĘDY
uk: ВАДИ

source: Reporting Bugs
fr: Remonter des bogues
nl: Bugs Rapporteren
pl: Zgłaszanie błędów
pt_br: Relatando erros
uk: Повідомлення про помилки

source: Email bug reports to E<.MT bug-grep@gnu.org> the bug-reporting address E<.ME .> An E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> email archive E<.UE> and a E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep> bug tracker E<.UE> are available.
fr: Envoyez par courriel les signalements de bogues à E<.MT bug-grep@gnu.org> l'adresse E<.ME .> Une E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> archive de courrier électronique E<.UE> et un E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep> gestionnaire de bogues E<.UE> sont disponibles.
nl: Email bug rapporten naar E<.MT bug-grep@gnu.org> het bug-rapportage adres E<.ME .> Een E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> email archief E<.UE> en een E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep> bug volger E<.UE> zijn beschikbaar.
pl: Raporty błędów wysyłać mailem na adres E<.MT bug-grep@gnu.org>E<.ME .> Archiwum email E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> oraz bug tracker E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep>E<.UE>.
pt_br: Envie por e-mail relatórios de erros para E<.MT bug-grep@gnu.org> o endereço de relatório de erros E<.ME .> Um E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> arquivo de e-mails E<.UE> e um E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep> rastreador de erros E<.UE> estão disponíveis.
uk: Надсилайте повідомлення про помилки електронною поштою на адресу E<.MT bug-grep@gnu.org> на адресу повідомлення про помилки E<.ME .> An E<.UR https://lists.gnu.org/mailman/listinfo/bug-grep> Доступні архів електронної пошти E<.UE> і E<.UR https://debbugs.gnu.org/cgi/pkgreport.cgi?package=grep> засіб відстеження помилок E<.UE>.

source: Known Bugs
fr: Bogues connus
nl: Bekende Bugs
pl: Znane błędy
pt_br: Erros conhecidos
uk: Відомі Помилки

source: Large repetition counts in the B<{>I<n>B<,>I<m>B<}> construct may cause B<grep> to use lots of memory. In addition, certain other obscure regular expressions require exponential time and space, and may cause B<grep> to run out of memory.
fr: Dans les constructions B<{>I<n>B<,>I<m>B<}> de grandes valeurs de répétition peuvent pousser B<grep> à utiliser beaucoup de mémoire. D'autres expressions rationnelles tordues peuvent prendre un temps très long et mener à une insuffisance de mémoire.
nl: Grote herhalingsaantallen voor de B<{>I<n>B<,>I<m>B<}> bouwsteen kunnen zorgen dat grep veel geheugen gebruikt. Daar bovenop kunnen sommige obscure reguliere expressies exponentieel meer tijd en ruimte vragen, en kunnen ervoor zorgen dat het geheugen voor B<grep> opraakt.
pl: Duże liczniki powtórzeń w konstrukcji B<{>I<n>B<,>I<m>B<}> mogą spowodować, że B<grep> zużyje mnóstwo pamięci. Oprócz tego, pewne inne niejasne wyrażenia regularne wymagają czasu i przestrzeni rosnącej wykładniczo i mogą spowodować, że B<grep>owi zabraknie pamięci.
pt_br: Grandes contagens de repetição na construção B<{>I<n>B<,>I<m>B<}> podem fazer com que B<grep> use muita memória. Além disso, certas outras expressões regulares obscuras exigem tempo e espaço exponenciais e podem causar a falta de memória de B<grep>.
uk: Велика кількість повторень у конструкції B<{>I<n>B<,>I<m>B<}> може призвести до того, що B<grep> використовує багато пам'яті. Крім того, деякі інші незрозумілі регулярні вирази вимагають експоненційного часу та простору, і можуть призвести до того, що для B<grep> не вистачить пам'яті.

source: Back-references are very slow, and may require exponential time.
fr: Les références arrières sont très lentes et peuvent demander un temps très important (exponentiel).
nl: Terugverwijzingen zijn heel langzaam, en kunnen exponentieel meer tijd vragen.
pl: Odwołania zwrotne są bardzo powolne i mogą wymagać czasu rosnącego wykładnicza.
pt_br: As retrorreferências são muito lentas e podem exigir tempo exponencial.
uk: Зворотні посилання дуже повільні і можуть вимагати експоненційного часу.

source: EXAMPLE
fr: EXEMPLE
nl: VOORBEELD
pl: PRZYKŁAD
pt_br: EXEMPLO
uk: ПРИКЛАДИ

source: The following example outputs the location and contents of any line containing ``f'' and ending in ``.c'', within all files in the current directory whose names contain ``g'' and end in ``.h''. The B<-n> option outputs line numbers, the B<--> argument treats expansions of ``*g*.h'' starting with ``-'' as file names not options, and the empty file /dev/null causes file names to be output even if only one file name happens to be of the form ``*g*.h''.
fr: L'exemple suivant affiche l'emplacement et le contenu de n'importe quelle ligne contenant « f » et se terminant par « .c » dans tous les fichiers du répertoire courant dont le nom contient « g » et se termine par « .h ». L'option B<-n> affiche les numéros de ligne, l'argument B<--> traite les expansions de « *g*.h » commençant par « - » comme des noms de fichier, pas des options, et le fichier I</dev/null> fait en sorte que les noms de fichier soient affichés même si un seul nom de fichier a la forme « *g*.h ».
nl: Het volgende voorbeeld toont locatie en inhoud van elke regel die "f" bevat en eindigt op ".c", in elk bestand in de huidige werkmap waarvan de naam "g" bevat en eindigt in "*.h". De B<-n> optie toont regel nummers, het B<--> argument behandelt expansie van "*g*.h" beginnend met "-" als bestandsnamen niet als opties, en het lege bestand /dev/null zorgt er voor dat bestandsnamen getoond worden zelfs als alleen een bestandsnaam van de vorm "*g*.h" is.
pl: Przykład poniżej zwraca lokację oraz zawartość każdego wiersza zawierającego "f" oraz kończącego się ".c" we wszystkich plikach w obecnym katalogu, których nazwy zawierają "g" oraz kończą się ".h". Opcja B<-n> zwraca numery wierszy, parametr B<--> traktuje rozszerzenia ""*g*.h" zaczynające się od "-" jako nazwy plików zamiast jako opcje, a pusty plik /dev/null sprawia, że nazwy plików zostaną zwrócone, nawet jeśli tylko jedna nazwa będzie miała formę "*g.h".
pt_br: O exemplo a seguir exibe o local e o conteúdo de qualquer linha que contém ``f'' e termina em ``.c'', em todos os arquivos no diretório atual cujos nomes contêm ``g'' e terminam em ``.h''. A opção B<-n> emite números de linha, o argumento B<--> trata expansões de ``*g*.h'' começando com ``-'' como nomes de arquivos, não como opções, e o arquivo vazio /dev/null faz com que os nomes dos arquivos sejam gerados, mesmo que apenas um nome esteja no formato ``*g*.h''.
uk: У наступному прикладі виводиться розташування та вміст будь-якого рядка, що містить ``f'' і закінчується на ``.c'', у всіх файлах у поточному каталозі, імена яких містять ``g'' та закінчуються на ``.h' '. Параметр B<-n> виводить номери рядків, аргумент B<--> розглядає розширення ``*g*.h'', починаючи з ``-'' як імена файлів, а не параметри, і порожній файл /dev/null призводить до виведення імен файлів, навіть якщо тільки одне ім'я файлу має вигляд ``*g*.h''.

source: The only line that matches is line 1 of argmatch.h. Note that the regular expression syntax used in the pattern differs from the globbing syntax that the shell uses to match file names.
fr: La seule ligne qui correspond est la première ligne d'I<argmatch.h>. Remarquez que la syntaxe de l'expression rationnelle utilisée dans le motif diffère de celle avec des jokers (glob) utilisée par l'interpréteur pour les correspondances de noms de fichier.
nl: De enige regel dit past is regel 1 van argmatch.h. Merk op dat de reguliere expressie syntaxis gebruikt in het patroon verschilt van de globbing syntaxis die de shell gebruikt om bestandsnamen te zoeken.
pl: Jedynym wierszem pasującym do wzorca jest pierwszy wiersz pliku argmatch.h. Należy zauważyć, że składnia wyrażenia regularnego użyta we wzorcu różni się od ogólnej składni używanej przez powłoki by dopasować nazwy plików.
pt_br: A única linha que coincide é a linha 1 de argmatch.h. Observe que a sintaxe da expressão regular usada no padrão difere da sintaxe flutuante que o shell usa para coincidir com os nomes dos arquivos.
uk: Єдиний рядок, який збігається, це рядок 1 argmatch.h. Зауважте, що синтаксис регулярного виразу, використаний у шаблоні, відрізняється від глобального синтаксису, який використовує оболонка для відповідності імен файлів.

source: SEE ALSO
fr: VOIR AUSSI
nl: ZIE OOK
pl: ZOBACZ TAKŻE
pt_br: VEJA TAMBÉM
uk: ДИВ. ТАКОЖ

source: Regular Manual Pages
fr: Pages de manuel
nl: Reguliere Handleidingen
pl: Zwykłe strony man
pt_br: Páginas de manual comuns
uk: Наступні сторінки посібника

source: Full Documentation
fr: Documentation complète
nl: Volledige documentatie
pl: Pełna dokumentacja
pt_br: Documentação completa
uk: Повна документація

source: A E<.UR https://www.gnu.org/software/grep/manual/> complete manual E<.UE> is available. If the B<info> and B<grep> programs are properly installed at your site, the command
fr: Un E<.UR https://www.gnu.org/software/grep/manual/> manuel complet E<.UE> est disponible. Si les programmes B<info> et B<grep> sont correctement installés sur votre système, la commande
nl: Een E<.UR https://www.gnu.org/software/grep/manual/> volledige handleiding E<.UE> is beschikbaar. Als de programma's B<info> en B<grep> correct op uw systeem zijn geïnstalleerd, dan geeft de opdracht
pl: Pod adresem https://www.gnu.org/software/grep/manual/ dostępny jest pełen podręcznik B<grep>. Jeśli programy B<info> i B<grep> są poprawnie zainstalowane, polecenie:
pt_br: Um E<.UR https://www.gnu.org/software/grep/manual/> manual completo E<.UE> está disponível. Se os programas B<info> e B<grep> estiverem instalados adequadamente em seu sistema, o comando
uk: Доступний повний посібник E<.UR https://www.gnu.org/software/grep/manual/> E<.UE .> Якщо програми B<info> і B<grep> правильно встановлені на вашому сайті, команда

source: should give you access to the complete manual.
fr: devrait vous donner accès au manuel complet.
nl: toegang tot de volledige handleiding.
pl: powinno dać dostęp do pełnego podręcznika.
pt_br: deve lhe dar acesso ao manual completo.
uk: ви зможете отримати доступ до повноцінного підручника.

source: grep, egrep, fgrep, rgrep - print lines that match patterns
fr: grep, egrep, fgrep, rgrep - Afficher les lignes correspondant à un motif donné
nl: grep, egrep, fgrep, rgrep - toon regels die voldoen aan een patroon
pl: grep, egrep, fgrep, rgrep - wypisuje wiersze pasujące do wzorca
pt_br: grep, egrep, fgrep, rgrep - emite linhas que coincidem com padrões
uk: grep, egrep, fgrep, rgrep - друкують рядки, які відповідають зразкам
