Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: In addition, the variant programs B<egrep>, B<fgrep> and B<rgrep> are the same as B<grep\ -E>, B<grep\ -F>, and B<grep\ -r>, respectively. These variants are deprecated, but are provided for backward compatibility.
fr: En outre, les variantes B<egrep>, B<fgrep> et B<rgrep>\ sont respectivement les mêmes que les programmes B<grep\ -E>, B<grep\ -F> et B<grep\ -r>. Ces variantes sont obsolètes mais sont fournies pour assurer la rétro-compatibilité.
nl: In aanvulling hierop, de varianten B<egrep>, B<fgrep> en B<rgrep> zijn identiek aan B<grep\ -E>, B<grep\ -F>, respectievelijk B<grep\ -r>. Deze varianten zijn afgekeurd, maar worden behouden vanwege compatibiliteit.
pl: Dodatkowo, programy wariantowe B<egrep>, B<fgrep> and B<rgrep> są zupełnie tym samym, co B<grep\ -E>, B<grep\ -F>, and B<grep\ -r>. Te warianty są już zdeprecjonowane, ale działają nadal w celu zachowania kompatybilności wstecznej.
pt_br: Além disso, os programas variantes B<egrep>, B<fgrep> e B<rgrep> são os mesmos que B<grep\ -E>, B<grep\ -F> e B<grep\ -r>, respectivamente. Essas variantes foram descontinuadas, mas são fornecidas para compatibilidade com versões anteriores.
uk: Крім того, варіанти програм B<egrep>, B<fgrep> і B<rgrep> працюють так само, як B<grep\ -E>, B<grep\ -F> і B<grep\ -r> відповідно. Ці варіанти не підтримуються, але надаються для зворотної сумісності.

source: Interpret PATTERNS as Perl-compatible regular expressions (PCREs). This option is experimental when combined with the B<-z> (B<-\^-null-data>) option, and B<grep -P> may warn of unimplemented features.
fr: Interpréter le I<MOTIF> comme une expression rationnelle Perl (PCRE, voir ci-dessous). Cette option est expérimentale quand on la combine à B<-z> (B<-\^-null-data>) et B<grep -P> pourrait signaler des fonctionnalités non implémentées.
nl: Interpreteer PATROON als PERL-compatibele reguliere expressie (PCRE´s). Deze optie is experimenteel indien die gecombineerd wordt met de met B<-z> (B<-\^-null-data>) optie, en B<grep -P> zou kunnen waarschuwen over niet geïmplementeerde features.
pl: Interpretuje B<WZORCE> jako wyrażenie regularne kompatybilne z Perlem (PCRE). Jest to opcja wysoce eksperymentalna, połączenie z opcjami B<-z> (B<-\^-null-data>) oraz B<grep -P> może ostrzegać o jeszcze niewdrożonych funkcjach.
pt_br: Interpreta I<PADRÕES> como expressões regulares compatíveis com Perl (PCREs). Essa opção é experimental quando combinada com a opção B<-z> (B<-\^-null-data>) e B<grep -P> pode avisar sobre recursos não implementados.
uk: Інтерпретувати ЗРАЗКИ як Perl-сумісні регулярні вирази (PCRE). Цей параметр є експериментальним у поєднанні з опцією B<-z> (B<-\^-null-data>), а B<grep -P> може попереджати про нереалізовані функції.

source: Suppress normal output; instead print the name of each input file from which no output would normally have been printed. The scanning will stop on the first match.
fr: Ne pas afficher les résultats normaux. À la place, indiquer le nom des fichiers pour lesquels aucun résultat n'aurait été affiché. La recherche dans chaque fichier cesse dès la première correspondance.
nl: Onderdruk gewone uitvoer; druk in plaats daarvan de naam van elk invoer bestand af waar normaal geen uitvoer van zou zijn worden afgedrukt. Het zoeken zal stoppen bij de eerste overeenkomst.
pl: Wyłącza normalne wyjście, zamiast niego wypisuje nazwę każdego pliku, z którego normalnie nie wypisano by żadnego wyniku. Przeszukiwanie zakończy się na pierwszym pasującym wyniku.
pt_br: Inibe saída normal; em vez disso, emite o nome de cada arquivo de entrada do qual normalmente nenhuma saída seria emitida. A varredura será interrompida na primeira coincidência.
uk: Пригнічує нормальний вивід; замість цього виводить ім'я кожного файлу, з якого зазвичай не було б виведено жодного результату. Сканування зупиниться на першому збігу.

source: Suppress normal output; instead print the name of each input file from which output would normally have been printed. The scanning will stop on the first match.
fr: Ne pas afficher les résultats normaux. À la place, indiquer le nom des fichiers pour lesquels un résultat aurait été affiché. La recherche dans chaque fichier cesse dès la première correspondance.
nl: Onderdruk gewone uitvoer; druk in plaats daarvan de naam van elk invoer bestand af waar normaal uitvoer van zou zijn worden afgedrukt. Het zoeken zal stoppen bij de eerste overeenkomst.
pl: Wyłącza normalne wyjście, zamiast niego wypisuje nazwę każdego pliku, z którego normalnie wypisanoby wynik. Przeszukiwanie zakończy się na pierwszym pasującym wyniku.
pt_br: Inibe saída normal; em vez disso, emite o nome de cada arquivo de entrada do qual normalmente alguma saída seria emitida. A varredura será interrompida na primeira coincidência.
uk: Пригнічує нормальний вивід; натомість виводить ім'я кожного вхідного файлу, з якого зазвичай було б виведено вихідні дані. Сканування зупиниться на першому збігу.

source: Print the file name for each match. This is the default when there is more than one file to search.
fr: Afficher le nom du fichier pour chaque correspondance. C'est le comportement par défaut quand la recherche est effectuée sur plusieurs fichiers.
nl: Toon de bestandsnaam voor elke vondst. Dit is standaard wanneer er meer dan een bestand doorzocht moet worden.
pl: Wyświetla nazwę pliku dla każdego dopasowania. Jest to domyślne ustawienia, jeśli jest więcej niż jeden plik do przeszukania.
pt_br: Emite o nome do arquivo para cada coincidência. Esse é o padrão quando há mais de um arquivo para pesquisar.
uk: Виводить назву файлу для кожного збігу. Це значення за замовчуванням, якщо для пошуку потрібно більше одного файлу.

source: Report Unix-style byte offsets. This switch causes B<grep> to report byte offsets as if the file were a Unix-style text file, i.e., with CR characters stripped off. This will produce results identical to running B<grep> on a Unix machine. This option has no effect unless B<-b> option is also used; it has no effect on platforms other than MS-DOS and MS-Windows.
fr: Afficher la position relative en octets dans le style UNIX. Avec cette option, B<grep> affiche la position relative en octets comme si le fichier était un fichier de texte de type UNIX, c'est-à-dire avec les caractères CR supprimés. Cela permet d'avoir un résultat identique à celui retourné par B<grep> sur une machine UNIX. Cette option n'a d'effet que si elle est utilisée conjointement avec l'option B<-b>, et sur une machine \s-1MS-DOS\s0 ou \s-1MS\s0-Windows.
nl: Rapporteer Unix-stijl byte posities. Deze optie veroorzaakt dat B<grep> byte posities rapporteert alsof het bestand een Unix-stijl tekst bestand was, o.a. met CR tekens verwijderd. Dit zal dezelfde uitkomsten opleveren als het uitvoeren van B<grep> op een Unix machine. Deze optie heeft geen gevolg tenzij de B<-b> optie ook wordt gebruikt; het heeft geen gevolg op andere platformen dan MS-DOS en MS-Windows.
pl: Wyświetla offsety bajtowe w stylu uniksowym. Przełącznik ten powoduje, że B<grep> wyświetla offsety bajtowe tak, jakby był plikiem tekstowym typu uniksowego tzn. bez znaków CR (powrót karetki). Da to rezultaty identyczne jak uruchomienie B<grep>a na systemie uniksowym. Opcja ta nie wywołuje żadnego efektu, chyba że użyto także opcji B<-b>; nie ma też żadnego efektu na platformach innych niż MS-DOS i MS Windows.
pt_br: Relata posições de bytes no estilo Unix. Essa opção faz com que B<grep> relate posições de bytes como se o arquivo fosse um arquivo de texto no estilo Unix, ou seja, com caracteres CR removidos. Isso produzirá resultados idênticos aos da execução de B<grep> em uma máquina Unix. Esta opção não tem efeito, a menos que a opção B<-b> também seja usada; não tem efeito em plataformas diferentes de MS-DOS e MS-Windows.
uk: Зміщення байтів у стилі Unix. Цей ключ змушує B<grep> повідомляти про зміщення байтів, як якщо б файл був текстовим файлом у стилі Unix, тобто з вилученими символами CR. Це дасть результати, ідентичні запуску B<grep> на машині Unix. Ця опція не діє, якщо також не використовується параметр B<-b>; він не впливає на інші платформи, крім MS-DOS та MS-Windows.

source: Read all files under each directory, recursively, following symbolic links only if they are on the command line. Note that if no file operand is given, grep searches the working directory. This is equivalent to the B<-d recurse> option.
fr: Lire récursivement tous les fichiers à l'intérieur de chaque répertoire, en ne suivant les liens symboliques que s'ils sont indiqués sur la ligne de commande. Remarquez que si vous ne donnez aucun opérande de fichier, B<grep> recherche dans le répertoire courant. C'est l'équivalent de l'option B<-d recurse>.
nl: Lees alle bestanden in elke map, recursief, symbolische koppelingen volgens alleen als ze op de commando regel stonden. Merk op dat als geen bestand werd gegeven, B<grep> alleen in de werk map zoekt. Dit is equivalent aan de B<-drecurse> optie.
pl: Czyta rekurencyjnie wszystkie pliki pod każdym katalogiem, podążając za dowiązaniami symbolicznymi tylko jeśli zostały podane w wierszu polecenia. Proszę zauważyć, że jeżeli nie jest dany żaden argument operacji, grep przeszukuje katalog roboczy. Jest to równoważne opcji B<-d recurse>.
pt_br: Lê todos os arquivos em cada diretório, recursivamente, seguindo os links simbólicos apenas se estiverem na linha de comando. Observe que, se nenhum operando de arquivo for fornecido, o grep pesquisará o diretório de trabalho. Isso é equivalente à opção B<-d recurse>.
uk: Всі файли в кожному каталозі читаються рекурсивно, з переходами за символічними посиланнями, лише якщо вони знаходяться в командному рядку. Зверніть увагу, що якщо не вказано операнд файлу, grep шукає лише робочому каталозі. Це еквівалентно параметру B<-d recurse>.

source: B<grep> understands three different versions of regular expression syntax: ``basic'' (BRE), ``extended'' (ERE) and ``perl'' (PCRE). In GNU B<grep> there is no difference in available functionality between basic and extended syntaxes. In other implementations, basic regular expressions are less powerful. The following description applies to extended regular expressions; differences for basic regular expressions are summarized afterwards. Perl-compatible regular expressions give additional functionality, and are documented in pcresyntax(3) and pcrepattern(3), but work only if PCRE is available in the system.
fr: B<Grep> gère trois styles de syntaxe pour les expressions rationnelles\ : «\ simple\ » (I<basic>, BRE), «\ étendue\ » (I<extended>, ERE) et « I<Perl> » (PCRE). Dans la version \s-1GNU\s0 de B<grep>, il n'y a pas de différence dans les fonctionnalités disponibles pour les styles I<basic> et I<extended>. Dans d'autres implémentations, les expressions rationnelles simples sont moins complètes. La description ci-dessous correspond aux expressions étendues, les différences avec les expressions simples étant résumées ensuite. Les expressions rationnelles Perl offrent des fonctionnalités supplémentaires et sont documentées dans B<pcresyntax>(3) et B<pcrepattern>(3), mais ne fonctionnent que si les PCRE sont disponibles sur le système.
nl: B<grep> begrijpt drie verschillende versies van reguliere-expressies syntaxis: ``basic'' (BRE), ``extended'' (ERE) and ``perl'' (PCRE). In GNU B<grep> is er geen verschil in bruikbaarheid tussen de drie versies. In andere implementaties zijn basis reguliere expressies minder krachtig. De volgende beschrijving gaat op voor uitgebreide reguliere expressies; verschillen met de basis reguliere expressies worden naderhand samengevat. Perl-compatibele reguliere expressies geven additionele functionaliteit, en zijn gedocumenteerd in pcresyntax(3) en pcrepattern(3), maar werken alleen als PCRE beschikbaar is in het systeem
pl: Program B<grep> rozumie trzy różne wersje składni wyrażeń regularnych: "podstawową" (BRE), "rozszerzoną" (ERE) i "perlową" (PCRE). W GNU B<grep> nie ma różnicy w funkcjonalności pomiędzy składniami podstawową i rozszerzoną. W innych implementacjach, podstawowe wyrażenia regularne są uboższe. Poniższy opis stosuje się do rozszerzonych wyrażeń regularnych; różnice w stosunku do wyrażeń podstawowych podsumowano na końcu. Wyrażenia regularne kompatybilne z Perlem dają dodatkowe funkcjonalności, udokumentowane w podręcznikach systemowych pcresyntax(3) i pcrepattern(3), lecz działają tylko jeśli w systemie jest dostępne PCRE.
pt_br: B<grep> compreende três versões diferentes da sintaxe de expressão regular: ``básica'' (BRE), ``estendida'' (ERE) e ``perl'' (PCRE). No GNU B<grep>, não há diferença na funcionalidade disponível entre sintaxes básica e estendida. Em outras implementações, expressões regulares básicas são menos poderosas. A descrição a seguir se aplica a expressões regulares estendidas; as diferenças para expressões regulares básicas são resumidas posteriormente. Expressões regulares compatíveis com Perl fornecem funcionalidade adicional e estão documentadas em pcresyntax(3) e pcrepattern(3), mas funcionam apenas se PCRE estiver disponível no sistema.
uk: B<grep> розуміє три різні версії синтаксису регулярних виразів: ``основний'' (BRE), ``розширений'' (ERE) та ``perl'' (PCRE). У GNU B<grep> немає різниці в доступній функціональності між основним і розширеним синтаксисами. В інших реалізаціях базові регулярні вирази менш потужні. Наступний опис стосується розширених регулярних виразів; згодом підсумовуються відмінності для основних регулярних виразів. Регулярні вирази, сумісні з Perl, надають додаткову функціональність і задокументовані в pcresyntax(3) і pcrepattern(3), але працюють, лише якщо PCRE доступний у системі.

source: Copyright 1998-2000, 2002, 2005-2020 Free Software Foundation, Inc.
uk: Авторські права належать 1998-2000, 2002, 2005-2020 Free Software Foundation, Inc.

source: grep, egrep, fgrep - print lines matching a pattern
fr: grep, egrep, fgrep - Afficher les lignes correspondant à un motif donné
pl: grep, egrep, fgrep - wypisuje wiersze pasujące do wzorca
uk: grep, egrep, fgrep - друкувати рядки, що відповідають зразку

source: B<grep> [I<OPTIONS>] I<PATTERN> [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTIONS>] I<MOTIF> [I<FICHIER>.\|.\|.]
pl: B<grep> [I<OPCJE>.\|.\|.]\& I<WZORCE> [I<PLIK>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>] I<ЗРАЗОК> [I<ФАЙЛ>.\|.\|.]

source: B<grep> [I<OPTIONS>] B<-e> I<PATTERN> \&.\|.\|.\& [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTIONS>] B<-e> I<MOTIF> \&.\|.\|.\& [I<FICHIER>.\|.\|.]
pl: B<grep> [I<OPCJE>] B<-e> I<WZORCE> \&.\|.\|.\& [I<PLIK>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>] B<-e> I<ЗРАЗОК> \&.\|.\|.\& [I<ФАЙЛ>.\|.\|.]

source: B<grep> [I<OPTIONS>] B<-f> I<FILE> \&.\|.\|.\& [I<FILE>.\|.\|.]
fr: B<grep> [I<OPTIONS>] B<-f> I<FICHIER> \&.\|.\|.\& [I<FICHIER>.\|.\|.]
pl: B<grep> [I<OPCJE>] B<-f> I<PLIK> \&.\|.\|.\& [I<PLIK>.\|.\|.]
uk: B<grep> [I<ПАРАМЕТР>] B<-f> I<ФАЙЛ> \&.\|.\|.\& [I<ФАЙЛ>.\|.\|.]

source: B<grep> searches for I<PATTERN> in each I<FILE>. A I<FILE> of ``B<->'' stands for standard input. If no I<FILE> is given, recursive searches examine the working directory, and nonrecursive searches read standard input. By default, B<grep> prints the matching lines.
fr: B<grep> cherche un I<MOTIF> dans chaque I<FICHIER>. Un I<FICHIER> « B<-> » signifie l'entrée standard. Si aucun I<FICHIER> n'est donné, les recherches récursives explorent le répertoire de travail et celles non récursives lisent l'entrée standard. Par défaut, B<grep> affiche les lignes correspondantes.
pl: B<grep> szuka I<WZORCÓW> w każdym I<PLIKU>. I<PLIK> B<-> oznacza standardowe wejście. Jeśli nie podano I<PLIKU>, rekursywnie wyszukiwanie sprawdza obecny katalog roboczy, a nierekursywne wyszukiwanie czyta ze standardowego wejścia. Domyślnie B<grep> wypisuje pasujące wiersze.
uk: B<grep> шукає I<ЗРАЗОК> у кожному I<ФАЙЛІ>. I<ФАЙЛ> із ``B<->'' означає стандартне введення. Якщо I<ФАЙЛ> не вказано, рекурсивний пошук перевіряє робочий каталог, а нерекурсивний пошук зчитує стандартне введення. За замовчуванням B<grep> виводить відповідні рядки.

source: Matcher Selection
fr: Sélection du style de correspondance
pl: Wybór dopasowań
uk: Відбір збігу

source: Interpret I<PATTERN> as an extended regular expression (ERE, see below).
fr: Interpréter le I<MOTIF> comme une expression rationnelle étendue (ERE, voir ci-dessous).
pl: Interpretuje I<WZORZEC> jako rozszerzone wyrażenie regularne (ERE, patrz niżej).
uk: Інтерпретуе I<ЗРАЗОК> як розширений регулярний вираз (ERE, див. нижче).

source: Interpret I<PATTERN> as a list of fixed strings (instead of regular expressions), separated by newlines, any of which is to be matched.
fr: Interpréter le I<MOTIF> comme une liste de chaînes fixes (plutôt que comme des expressions rationnelles), séparées par des changements de ligne, et chacune d'entre elles doit correspondre.
pl: Interpretuje I<WZORZEC> jako listę ciągów (a nie wyrażeń regularnych) umieszczonych po jednym w każdym wierszu, z których dowolny ma zostać dopasowany.
uk: Інтерпретує I<ЗРАЗОК> як список фіксованих рядків (замість регулярних виразів), розділених новими рядками, будь-який з яких має бути зіставлений.

source: Interpret I<PATTERN> as a basic regular expression (BRE, see below). This is the default.
fr: Interpréter le I<MOTIF> comme une expression rationnelle simple (BRE, voir ci-dessous). C'est le comportement par défaut.
pl: Interpretuje I<WZORZEC> jako podstawowe wyrażenie regularne (BRE, patrz niżej). Jest to zachowanie domyślne.
uk: Інтерпретує I<ЗРАЗОК> як базовий регулярний вираз (BRE, див. нижче). Це значення за замовчуванням.

source: Interpret the pattern as a Perl-compatible regular expression (PCRE). This is experimental and B<grep -P> may warn of unimplemented features.
fr: Interpréter le I<MOTIF> comme une expression rationnelle Perl (PCRE, voir ci-dessous). Cette option est expérimentale et B<grep -P> pourrait signaler des fonctionnalités non implémentées.
pl: Interpretuje wzorzec jako wyrażenie regularne kompatybilne z Perlem - PCRE. Jest to opcja eksperymentalna i B<grep -P> może ostrzegać o jeszcze niewdrożonych funkcjach.
uk: Інтерпретує зразок як Perl-сумісний регулярний вираз (PCRE). Це експериментальна можливість, опція B<grep -P> може попереджати про нереалізовані функції.

source: B<-e>I< PATTERN>,B< -\^-regexp=>I<PATTERN>
fr: B<-e> I<MOTIF>,B< -\^-regexp=>I<MOTIF>
pl: B<-e>I<WZORZEC>,B< -\^-regexp=>I<WZORZEC>
uk: B<-e>I< ЗРАЗОК>,B< -\^-regexp=>I<ЗРАЗОК>

source: Use I<PATTERN> as the pattern. If this option is used multiple times or is combined with the B<-f> (B<--file>) option, search for all patterns given. This option can be used to protect a pattern beginning with ``-''.
fr: Utiliser I<MOTIF> comme motif. Si cette option est utilisée plusieurs fois ou en combinaison avec l'option B<-f> (B<--file>), rechercher les motifs donnés. Cette option peut être utilisée pour protéger un motif commençant par « - ».
pl: Używa I<WZORCA> jako wzorca. Jeżeli ta opcja została użyta wielokrotnie lub jest połączona z opcją B<-f> (B<--file>), szuka wszystkich podanych wzorców. Ta opcja może być użyta do ochrony wzorców rozpoczynających się znakiem "-".
uk: Використовує I<ЗРАЗОК> як шаблон. Якщо цей параметр використовується кілька разів або поєднується з параметром B<-f> (B<--file>), знаходить усі задані зразки. Цей параметр можна використовувати для захисту шаблону, який починається з ``-''.

source: Obtain patterns from I<FILE>, one per line. If this option is used multiple times or is combined with the B<-e> (B<--regexp>) option, search for all patterns given. The empty file contains zero patterns, and therefore matches nothing.
fr: Utiliser les motifs depuis I<FICHIER>, un par ligne. Si cette option est utilisée plusieurs fois ou combinée avec l'option B<-e> (B<--regexp>), rechercher tous les motifs donnés. Un fichier vide ne contient pas de motif et ne donne donc aucun résultat.
pl: Pobiera wzorce z I<PLIKU>, po jednym na wiersz. Jeżeli ta opcja została użyta wielokrotnie lub jest połączona z opcją B<-e> (B<--regexp>), szuka wszystkich podanych wzorców. Pusty plik zawiera zero wzorców, więc nie pasuje do niczego.
uk: Отримує зразки з I<ФАЙЛ>, по одному на рядок. Якщо цей параметр використовується кілька разів або поєднується з параметром B<-e> (B<--regexp>), знаходить усі задані зразки. Порожній файл не містить зразків, тому нічого не виводить.

source: Ignore case distinctions, so that characters that differ only in case match each other.
fr: Ignorer les distinctions de casse pour que les correspondances incluent les caractères qui ne diffèrent que par leur casse.
pl: Ignoruje różnicę wielkości liter, tak by znaki, które różnią się tylko wielkością pasowały do siebie.
uk: Ігнорує розбіжності регістру, тож символи, які відрізняються лише регістром, відповідають один одному.

source: Display input actually coming from standard input as input coming from file I<LABEL>. This is especially useful when implementing tools like B<zgrep>, e.g., B<gzip -cd foo.gz | grep --label=foo -H something>. See also the B<-H> option.
fr: Afficher les données provenant de l'entrée standard comme si elles provenaient du fichier I<ÉTIQUETTE>. C'est particulièrement utile pour l'implémentation d'outils comme B<zgrep>, par exemple B<gzip -cd truc.gz | grep --label=truc -H quelque_chose>. Consultez également l'option B<-H>.
pl: Wyświetla wejście, które w rzeczywistości pochodzi ze standardowego wejścia, jako wejście pochodzące z pliku I<ETYKIETA>. Jest to szczególnie przydatne w implementacji narzędzi takich jak B<zgrep> np. B<gzip -cd foo.gz | grep --label=foo -H coś>. Patrz też: opcja B<-H>.
uk: Відображає вхідні дані, які фактично надходять зі стандартного введення, як вхідні дані, що надходять із файлу I<ЯРЛИК>. Це особливо корисно під час реалізації таких інструментів, як B<zgrep>, наприклад, B<gzip -cd foo.gz | grep --label=foo -H щось>. Дивіться також параметр B<-H>.

source: By default, I<TYPE> is B<binary>, and when B<grep> discovers that a file is binary it suppresses any further output, and instead outputs either a one-line message saying that a binary file matches, or no message if there is no match.
fr: Par défaut, I<TYPE> est un B<binary> et, quand B<grep> découvre qu'un fichier est binaire, il supprime toute sortie supplémentaire et affiche à la place soit un message d’une ligne informant de la correspondance d’un fichier binaire, soit aucun message s'il n'y a pas de correspondance.
pl: Domyślny I<TYP> to B<binary>, więc kiedy B<grep> wykryje, że plik zawiera dane binarne, zatrzymuje dalsze wyjście. Zamiast tego wyświetla albo jednowierszową wiadomość (jeżeli plik binarny się zgadza) lub zupełnie nic, jeżeli nie ma dopasowania.
uk: Типово I<ТИП> є B<binary>, і коли B<grep> виявляє, що файл є двійковим, він пригнічує будь-який подальший вивід, а замість цього виводить однорядкове повідомлення про те, що файл є двійковий, або немає повідомлення якщо відповідності немає.

source: If I<TYPE> is B<without-match>, when B<grep> discovers that a file is binary it assumes that the rest of the file does not match; this is equivalent to the B<-I> option.
fr: Si I<TYPE> vaut B<without-match>, quand B<grep> découvre qu'un fichier est un fichier binaire, il suppose que le reste du fichier ne correspond pas à la recherche ; c'est un équivalent de l'option B<-I>.
pl: Jeżeli I<TYPEM> jest B<without-match>, to kiedy B<grep> wykryje, że plik zawiera dane binarne, zakłada, że reszta pliku nie pasuje. Jest to odpowiednik opcji B<-I>.
uk: Якщо I<ТИП> є B<without-match>, коли B<grep> визначає, що файл є двійковим, він припускає, що решта файлу не збігається (із зразком); це еквівалентно параметру B<-I>.
