Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Surround the matched (non-empty) strings, matching lines, context lines, file names, line numbers, byte offsets, and separators (for fields and groups of context lines) with escape sequences to display them in color on the terminal. The colors are defined by the environment variable B<GREP_COLORS>. The deprecated environment variable B<GREP_COLOR> is still supported, but its setting does not have priority. I<WHEN> is B<never>, B<always>, or B<auto>.
fr: Encadrer les chaînes (non vides) des correspondances, les lignes qui correspondent, les lignes de contexte, les noms de fichiers, les numéros de lignes, les positions relatives en octets et les séparateurs (pour les champs et groupes de lignes de contexte) avec des séquences d'échappement pour les afficher en couleur sur le terminal. Les couleurs sont définies par la variable d'environnement B<GREP_COLORS>. L'ancienne variable d'environnement B<GREP_COLOR> est toujours gérée, mais elle a une priorité inférieure pour décider de la configuration. I<QUAND> vaut B<never> (jamais), B<always> (toujours) ou B<auto>.
nl: Omgeeft de gevonden (niet-lege) teksten, passende regels, context regels, bestandsnamen, regel nummers, byte afstand, en de scheiders (voor velden en groepen van context regels) met stuurcodes om ze in kleur op de terminal te tonen. De kleuren zijn bepaald in de omgevingsvariabele B<GREP_COLORS>. De afgekeurde omgevingsvariabele B<GREP_COLOR> wordt nog ondersteund, maar de instelling heeft geen prioriteit. I<WHEN> is B<never>, B<always>, of B<auto>.
pl: Otacza pasujące (niepuste) łańcuchy, pasujące wiersze, wiersze kontekstu, nazwy plików, numery wierszy, przesunięcie w bajtach oraz separatory (dla pól i grup w wierszach kontekstu) znakami odpowiadającymi za wyświetlanie kolorów w terminalu. Kolory są zdefiniowane przez zmienną środowiskową B<GREP_COLORS>. Przestarzała zmienna środowiskowa B<GREP_COLOR> jest wciąż obsługiwana, ale jej ustawienia nie mają pierwszeństwa. Parametr I<KIEDY> może przyjmować wartości: B<never> (nigdy), B<always> (zawsze) i B<auto> (automatycznie).
pt_br: Coloca os textos que coincidem (não vazios), as linhas que coincidem, as linhas de contexto, os nomes dos arquivos, os números das linhas, os posições de bytes e os separadores (para campos e grupos de linhas de contexto) com sequências de escape para exibi-las em cores no terminal. As cores são definidas pela variável de ambiente B<GREP_COLORS>. A variável de ambiente obsoleta B<GREP_COLOR> ainda é suportada, mas sua configuração não tem prioridade. I<QUANDO> é B<never>, B<always> ou B<auto>.
uk: Оточує відповідні (непорожні) рядки, відповідні рядки, контекстні рядки, імена файлів, номери рядків, зміщення байтів і роздільники (для полів і груп контекстних рядків) escape-послідовністю, щоб відобразити їх у кольорі в терміналі. Кольори визначаються змінною середовища B<GREP_COLORS>. Застаріла змінна середовища B<GREP_COLOR> все ще підтримується, але її налаштування не мають пріоритету. I<КОЛИ> – це B<ніколи>, B<завжди> або B<auto>.

source: Suppress normal output; instead print the name of each input file from which no output would normally have been printed.
fr: Ne pas afficher les résultats normaux. À la place, indiquer le nom des fichiers pour lesquels aucun résultat n'aurait été affiché.
nl: Onderdruk gewone uitvoer; druk in plaats daarvan de naam van elk invoer bestand af, waar normaal geen uitvoer van zou zijn afgedrukt.
pl: Wyłącza normalne wyjście, zamiast niego wypisuje nazwę każdego pliku, z którego normalnie nie wypisano by żadnego wyniku.
uk: Пригнічує звичайний вивід, натомість виводить назви файлів в яких збігів не відбулося. Пошук всередині кожного файлу припиняється після першого збігу.

source: Suppress normal output; instead print the name of each input file from which output would normally have been printed. Scanning each input file stops upon first match.
fr: Ne pas afficher les résultats normaux. À la place, indiquer le nom des fichiers pour lesquels un résultat aurait été affiché. La recherche dans chaque fichier cesse dès la première correspondance.
nl: Onderdruk gewone uitvoer; druk in plaats daarvan de naam van elk invoer bestand af, waar normaal geen uitvoer van zou zijn afgedrukt.
pl: Wyłącza normalne wyjście, zamiast niego wypisuje nazwę każdego pliku, z którego normalnie wypisano by wynik. Przeszukiwanie każdego pliku wejściowego kończy się na pierwszym pasującym wyniku.
uk: Пригнічує звичайний вивід; натомість виводить назви файлів, що містять збіги. Пошук всередині кожного файлу припиняється після першого збігу.

source: B<-m>I< NUM>,B< -\^-max-count=>I<NUM>
fr: B<-m> I<N>, B<-\^-max-count=>I<N>
nl: B<-m>I< AANTAL>,B< -\^-max-count=>I<AANTAL>
pl: B<-m>I< LICZBA>,B< -\^-max-count=>I<LICZBA>
pt_br: B<-m>I< NÚM>,B< -\^-max-count=>I<NÚM>
uk: B<-m>I<ЧИСЛО>,B< -\^-max-count=>I<ЧИСЛО>

source: Stop reading a file after I<NUM> matching lines. If the input is standard input from a regular file, and I<NUM> matching lines are output, B<grep> ensures that the standard input is positioned to just after the last matching line before exiting, regardless of the presence of trailing context lines. This enables a calling process to resume a search. When B<grep> stops after I<NUM> matching lines, it outputs any trailing context lines. When the B<-c> or B<-\^-count> option is also used, B<grep> does not output a count greater than I<NUM>. When the B<-v> or B<-\^-invert-match> option is also used, B<grep> stops after outputting I<NUM> non-matching lines.
fr: Arrêter de lire un fichier après avoir trouvé I<N> lignes sélectionnées. Si l'entrée est l'entrée standard prise depuis un fichier normal, et si I<N> lignes qui correspondent sont affichées, B<grep> s'assure avant de s'arrêter que l'entrée standard est positionnée juste après la dernière ligne qui concorde, même s'il y a des lignes de contexte supplémentaires. Cela permet au processus d'appel de redémarrer une recherche. Quand B<grep> s'arrête après I<N> lignes de concordance, il affiche toutes les lignes de contexte suivantes. Quand l'option B<-c> ou B<-\^-count> est utilisée, B<grep> n'affiche pas plus de I<N> lignes. Quand l'option B<-v> ou B<-\^-invert-match> est aussi utilisée, B<grep> s'arrête après avoir affiché I<N> lignes qui ne contiennent pas le motif.
nl: Stop met het lezen van een bestand na I<NUM> overeenkomende regels. Als de invoer gelezen wordt van standaard invoer van een normaal bestand, en I<NUM> passende regels werden getoond, dan zal B<grep> er voor zorgen dat de standaard invoer wordt gezet precies na de laatste passende regel voor dat het stopt, ook al zijn er nakomende context regels. Dit zorgt ervoor dat het aanroepende proces kan doorgaan met zoeken. Als B<grep> stopt na I<NUM> passende regels, zal het nog volgende context regels tonen. Indien de B<-c> of B<-\^-count> optie werd gebruikt, dan zal B<grep> geen teller groter dan I<NUM> tonen. Als ook de B<-v> of B<-\^-invert-match> werd gebruikt, dan zal B<grep> stoppen na het tonen van I<NUM> niet-passende regels.
pl: Zatrzymuje odczytywanie pliku po I<LICZBIE> pasujących wierszy. Jeśli wejście jest standardowym wejściem ze zwykłego pliku i wypisano I<LICZBĘ> pasujących wierszy, to B<grep> upewnia się przed zakończeniem działania, że standardowe wejście jest ustawione zaraz za ostatnim pasującym wierszem, niezależnie od obecności końcowych wierszy kontekstu. Umożliwia to wywołującemu procesowi wznowienie wyszukiwania. Jeśli B<grep> zatrzyma się po I<LICZBIE> pasujących wierszy, nie wyświetla końcowych wierszy kontekstu. Jeżeli podano także opcję B<-c> lub B<-\^-count>, B<grep> nie wyświetla liczby większej niż I<LICZBA>. Jeśli podano również opcję B<-v> lub B<-\^-invert-match>, to B<grep> zatrzymuje wyświetlanie po wypisaniu I<LICZBY> niepasujących wierszy.
pt_br: Interrompe a leitura um arquivo depois de I<NÚM> ocorrências. Se a entrada for uma entrada padrão de um arquivo comum e I<NÚM> ocorrências forem exibidas, B<grep> garantirá que a entrada padrão seja posicionada logo após a última ocorrência antes de sair, independentemente da presença de linhas de contexto à direita. Isso permite que um processo de chamada retome uma pesquisa. Quando B<grep> interrompe após I<NÚM> ocorrências, ele exibe quaisquer linhas de contexto ao final. Quando a opção B<-c> ou B<-\^-count> também é usada, B<grep> não gera uma contagem maior que I<NÚM>. Quando a opção B<-v> ou B<-\^-invert-match> também é usada, B<grep> interrompe após a saída de I<NÚM> linhas não coincidentes.
uk: Пошук у файлі припиняється після вказаного I<ЧИСЛА> рядків, які збіглися. Якщо ввід відбувається зі звичайного файлу, grep зупинить пошук одразу ж на наступному рядку після останнього рядка, який збігається і припинить роботу. Це дозволяє поновити процес пошуку з місця зупинки. Коли B<grep> зупиняється після вказаного I<ЧИСЛА> відповідних рядків, він виводить будь-який наступний рядок. Якщо додатково використовується параметр B<-c> або B<-\^-count>, B<grep> не виводить кількість більшу, ніж I<ЧИСЛО>. Коли додатково вживається параметр B<-v> або B<-\^-invert-match>, B<grep> зупиняється після виведення I<ЧИСЛА> невідповідних рядків.

source: Print only the matched (non-empty) parts of a matching line, with each such part on a separate output line.
fr: N'afficher que les parties (non vides) correspondantes des lignes sélectionnées, chaque partie étant affichée sur une ligne séparée.
nl: Toon alleen gevonden (niet-lege) delen van de gevonden regel, met elk deel op een aparte uitvoer regel.
pl: Wyświetla tylko pasujące (niepuste) części pasującego wiersza, każda w osobnym wierszu.
pt_br: Emite apenas as partes coincidentes (não vazias) de uma ocorrência, com cada uma dessas partes em uma linha de saída separada.
uk: Виводить лише узгоджені (непорожні) частини відповідного рядка, причому кожний збіг виводиться в окремий рядок.

source: Quiet; do not write anything to standard output. Exit immediately with zero status if any match is found, even if an error was detected. Also see the B<-s> or B<-\^-no-messages> option.
fr: Silencieux ; ne rien écrire sur la sortie standard. Quitter immédiatement avec un code zéro si une correspondance a été trouvée même si une erreur a été détectée. Voir aussi l'option B<-s> ou B<-\^-no-messages>.
nl: Stil; schrijf niets naar standaard uitvoer. Stop onmiddellijk met een nul eind waarde wanneer een overeenkomst werd gevonden, zelfs als een fout was vastgesteld. Zie ook de B<-s> of B<-\^-no-messages> optie.
pl: Po cichu, nie wyświetla niczego na standardowe wyjście. Przeszukiwanie zakończy się na pierwszym pasującym wierszu ze statusem zero, nawet jeśli wykryto błąd. Patrz również opcje B<-s> lub B<-\^-no-messages>.
pt_br: Quieto; não escreve nada na saída padrão. Sai imediatamente com o status zero se alguma coincidente for encontrada, mesmo que um erro tenha sido detectado. Consulte também a opção B<-s> ou B<-\^-no-messages>.
uk: Мовчазний вивід; не виводить нічого в звичайному випадку. Негайно припиняє роботу із нульовим статусом, якщо знайдено будь-який збіг, навіть якщо була виявлена помилка. Також дивіться параметр B<-s> або B<-\^-no-messages>.

source: Suppress error messages about nonexistent or unreadable files.
fr: Supprimer les messages d'erreur sur la non existence ou l'illisibilité des fichiers.
nl: Onderdruk fout berichten over niet-bestaande of onleesbare bestanden.
pl: Ignoruje błędy spowodowane przez nieistniejące lub nieczytelne pliki.
pt_br: Inibe mensagens de erro sobre arquivos inexistentes ou ilegíveis.
uk: Пригнічуються повідомлення про помилки щодо неіснуючих або недоступних файлів.

source: Output Line Prefix Control
fr: Contrôle du préfixe à l'affichage
nl: Uitvoer regel voorvoegsel instellingen
pl: Kontrola przedrostków w wierszu wyjścia
pt_br: Controle de prefixo de linha de saída
uk: Управління Префіксом Вихідного Рядка

source: Print the 0-based byte offset within the input file before each line of output. If B<-o> (B<-\^-only-matching>) is specified, print the offset of the matching part itself.
fr: Afficher l'emplacement dans le fichier (qui commence à l'octet 0) devant chaque ligne de sortie. Si B<-o> (B<-\^-only-matching>) est spécifiée, afficher l'emplacement de la partie qui correspond.
nl: Toon de 0-gebaseerde byte positie in het invoer bestand voor elke regel van de uitvoer. Toon de positie van het gevonden deel zelf als B<-o> (B<-\^-only-matching>) is opgegeven.
pl: Wypisuje przed każdym wierszem wyjścia jego, liczone od 0, przesunięcie bajtowe w pliku wejściowym. Jeśli użyto opcji B<-o> (B<-\^-only-matching>), wyświetla przesunięcie samej pasującej części.
pt_br: Emite a posição de byte baseada em 0 no arquivo de entrada antes de cada linha de saída. Se B<-o> (B<-\^-only-matching>) for especificado, emite a posição da própria parte coincidente.
uk: Ставить перед кожним рядком номер блоку, в якому він був знайдений, починаючи з 0. Якщо додатково вказати B<-o> (B<-\^-only-matching>), виводить номер блоку найбільш відповідної частини.

source: Print the file name for each match. This is the default when there is more than one file to search. This is a GNU extension.
fr: Afficher le nom du fichier pour chaque correspondance. C'est le comportement par défaut quand la recherche est effectuée sur plusieurs fichiers. C’est une extension \s-1GNU\s0.
nl: Toon de bestandsnaam voor elke overeenkomst. Dit is standaard wanneer er meer dan een bestand doorzocht moet worden.
pl: Wyświetla nazwę pliku dla każdego dopasowania. Jest to domyślne ustawienie, jeśli jest więcej niż jeden plik do przeszukania. Rozszerzenie GNU.
uk: Виводить назву файлу для кожного збігу. Це типове значення, якщо пошук виконують у декількох файлах. Це розширення GNU.

source: Suppress the prefixing of file names on output. This is the default when there is only one file (or only standard input) to search.
fr: Ne pas afficher le nom des fichiers au début des lignes qui correspondent. C'est le comportement par défaut quand il n'y a qu'un fichier (ou que l'entrée standard) dans lequel effectuer la recherche.
nl: Onderdruk het voorvoegen van bestandsnamen in de uitvoer. Dit is standaard wanneer er precies een bestand (of alleen standaard invoer) doorzocht wordt.
pl: Odwołuje poprzedzanie wyjścia nazwami plików. Jest to ustawienie domyślne, jeśli jest tylko jeden plik (lub standardowe wejście) do przeszukania.
pt_br: Inibe a prefixação dos nomes dos arquivos na saída. Esse é o padrão quando há apenas um arquivo (ou apenas entrada padrão) para pesquisar.
uk: Пригнічує показ імен файлів у виводі. Це типове значення, якщо пошук проводиться лише в одному файлі (або стандартний ввід).

source: B<-\^-label=>I<LABEL>
fr: B<-\^-label=>I<ÉTIQUETTE>
pl: B<-\^-label=>I<ETYKIETA>
pt_br: B<-\^-label=>I<RÓTULO>
uk: B<-\^-label=>I<НАЗВА>

source: Display input actually coming from standard input as input coming from file I<LABEL>. This can be useful for commands that transform a file's contents before searching, e.g., B<gzip -cd foo.gz | grep -\^-label=foo -H 'some pattern'>. See also the B<-H> option.
fr: Afficher les données provenant de l'entrée standard comme si elles provenaient du fichier I<ÉTIQUETTE>. C'est particulièrement utile pour des outils qui modifient le contenu d'un fichier avant la recherche, comme B<gzip -cd truc.gz |grep --label=truc quelquechose>. Consultez également l'option B<-H>.
nl: Toon invoer komende van standaard invoer als invoer afkomstig van bestand I<LABEL>. Dit is nuttig voor commando´s die de bestand inhoud transformeren vóór het doorzoeken, b.v. B<gzip -cd foo.gz | grep -\^-label=foo -H 'some pattern'>. Zie ook de B<-H> optie.
pl: Wyświetla wejście, które w rzeczywistości pochodzi ze standardowego wejścia, jako wejście pochodzące z pliku I<ETYKIETA>. Może to być szczególnie przydatne przy komendach, które przekształcają zawartość pliku przed wyszukiwaniem, np. B<gzip -cd foo.gz | grep -\^-label=foo -H 'jakiś wzorzec'>. Patrz też: opcja B<-H>.
pt_br: Exibe a entrada proveniente da entrada padrão como uma entrada proveniente do I<RÓTULO> de arquivo. Isso pode ser útil para comandos que transformam o conteúdo de um arquivo antes de pesquisar, por exemplo, B<gzip -cd foo.gz | grep -\^-label=foo -H 'algum padrão'>. Veja também a opção B<-H>.
uk: Вказує ніби ввід надходить з файла з назвою I<НАЗВА>. Це може бути корисно для команд, які перетворюють вміст файлу перед пошуком, наприклад, B<gzip -cd foo.gz | grep -\^-label=foo -H 'ЗРАЗОК'>. Дивіться також параметр B<-H>.

source: Prefix each line of output with the 1-based line number within its input file.
fr: Préfixer chaque ligne de sortie par le numéro, débutant à un, de la ligne débutant dans le fichier.
nl: Voeg vóór elke regel uitvoer het regelnummer toe in het invoer bestand.
pl: Poprzedza każdy wiersz wyjścia, liczonym od 1, numerem wiersza z pliku wejściowego.
pt_br: Prefixa cada linha de saída com o número da linha com base em 1 em seu arquivo de entrada.
uk: Виводить перед кожним рядком його номер у файлі (нумерація починається з 1).

source: Make sure that the first character of actual line content lies on a tab stop, so that the alignment of tabs looks normal. This is useful with options that prefix their output to the actual content: B<-H>,B<-n>, and B<-b>. In order to improve the probability that lines from a single file will all start at the same column, this also causes the line number and byte offset (if present) to be printed in a minimum size field width.
fr: S'assurer que le premier caractère correspondant au contenu réel de la ligne est placé à un emplacement d'arrêt d'une tabulation, pour que l'alignement des tabulations paraisse normal. Cela est utile avec les options qui utilisent un préfixe avant le contenu réel de la ligne : B<-H>, B<-n> et B<-b>. Pour augmenter la probabilité que toutes les lignes d'un fichier commencent à la même colonne, cela force aussi le numéro de ligne et l'emplacement (s'ils sont présents) à être affichés dans un champ de taille minimale.
nl: Zorg ervoor dat het eerste teken van een regel inhoud op een tabstop ligt, waarmee de uitlijning van tabs normaal uit ziet. Dit is nuttig samen met de opties die hun uitvoer vooraf laten gaan met de inhoud: B<-H>,B<-n>, and B<-b>. Om de kans te vergroten dat de regels van een enkel bestand zullen starten in dezelfde kolom, zal het regelnummer en de byte positie (indien aanwezig) getoond worden in de minimale veld breedte.
pl: Upewnia się, że pierwszy znak wiersza zawartości zależy od tabulacji, dzięki czemu wyrównanie tabulacji wygląda normalnie. Jest to użyteczne z opcjami, które poprzedzają swoje wyjście jakąś zawartością: B<-H>, B<-n> i B<-b>. Aby zwiększyć prawdopodobieństwo, że wiersze z danego pliku będą się zaczynać w tej samej kolumnie, numer wiersza i przesunięcie bajtowe (jeśli są obecne) zostaną wyświetlone z najmniejszą szerokością pola.
pt_br: Verifica se o primeiro caractere do conteúdo real da linha está em uma parada de tabulação, para que o alinhamento das tabulações pareça normal. Isso é útil com opções que prefixam sua saída para o conteúdo real: B<-H>, B<-n> e B<-b>. Para aumentar a probabilidade de que as linhas de um único arquivo sejam iniciadas na mesma coluna, isso também faz com que o número da linha e a posição de bytes (se houver) sejam emitidos em uma largura de campo de tamanho mínimo.
uk: Перевіряє, що перший символ фактичного вмісту рядка лежить на табуляції, щоб вирівнювання табуляторів виглядало нормально. Це корисно робити разом з параметрами, які передбачають вивід до фактичного вмісту: B<-H>, B<-n> і B<-b>. Щоб підвищити ймовірність того, що всі рядки з одного файлу будуть починатися з одного стовпця, також друкується номер рядка та зміщення блоків (якщо воно є) у мінімальній ширині розміру поля.

source: Output a zero byte (the ASCII B<NUL> character) instead of the character that normally follows a file name. For example, B<grep -lZ> outputs a zero byte after each file name instead of the usual newline. This option makes the output unambiguous, even in the presence of file names containing unusual characters like newlines. This option can be used with commands like B<find -print0>, B<perl -0>, B<sort -z>, and B<xargs -0> to process arbitrary file names, even those that contain newline characters.
fr: Afficher un octet NULL (le caractère \s-1ASCII\s0 NULL) à la place du caractère qui suit d'ordinaire le nom du fichier. Par exemple, B<grep -lZ> affiche un octet NULL après chaque nom de fichier, à la place du changement de ligne. Cette option permet de rendre la sortie non ambiguë, même quand les noms de fichiers contiennent des caractères inhabituels, comme des changements de ligne. Cette option peut être utilisée avec des commandes telles que B<find -print0>, B<perl -0>, B<sort -z>, et B<xargs -0> pour traiter des fichiers avec des noms quelconques, même ceux contenant des changements de ligne.
nl: Voer een nul byte (het ASCII B<NUL> karakter) uit, in plaats van het karakter dat gewoonlijk volgt op een bestandsnaam. Bijvoorbeeld, B<grep -lZ> voert een nul byte uit na elke bestandsnaam, in plaats van de gewone nieuwe regel. Deze optie maakt de uitvoer eenduidig, zelfs bij het voorkomen van bestandsnamen die ongewone karakters zoals nieuwe regels bevatten. Deze optie kan worden gebruikt met opdrachten zoals B<find -print0>, B<perl -0>, B<sort -z> en B<xargs -0> om willekeurige bestandsnamen te verwerken, zelfs als die nieuwe regel-tekens bevatten.
pl: Zamiast znaku, który normalnie występuje po nazwie pliku, wypisuje bajt zerowy (ASCII B<NUL>). Na przykład, B<grep -lZ> wypisuje po nazwie pliku bajt zerowy, zamiast, jak zwykle, znak nowego wiersza. Opcja ta powoduje, że wyjście jest jednoznaczne, nawet przy nazwach plików zawierających niecodzienne znaki, jak znak nowego wiersza. Może być wykorzystywana z poleceniami typu: B<find -print0>, B<perl -0>, B<sort -z> i B<xargs -0>, umożliwiając przetwarzanie plików o dowolnych nazwach, nawet zawierających znaki nowego wiersza.
pt_br: Emite um byte zero (o caractere ASCII B<NUL>) em vez do caractere que normalmente segue um nome de arquivo. Por exemplo, B<grep -lZ> gera um byte zero após cada nome de arquivo, em vez da nova linha usual. Essa opção torna a saída inequívoca, mesmo na presença de nomes de arquivos contendo caracteres incomuns, como novas linhas. Essa opção pode ser usada com comandos como B<find -print0>, B<perl -0>, B<sort -z> e B<xargs -0> para processar nomes de arquivos arbitrários, mesmo aqueles que contêm caracteres de nova linha.
uk: Виведіть нульовий байт (символ ASCII B<NUL>) замість символу, який зазвичай слідує після імені файлу. Наприклад, B<grep -lZ> виводить нульовий байт після кожного імені файлу замість звичайного нового рядка. Ця опція забезпечує однозначний вивід, навіть у випадку назв файлів що містять незвичні знаки, такі як знак нового рядка. Ця опція може використовуватись разом з такими командами як B<find -print0>, B<perl -0>, B<sort -z> та B<xargs -0> для обробки довільних назв файлів.

source: Context Line Control
fr: Contrôle des lignes de contexte
nl: Context Regel Instellingen
pl: Kontrola wierszy z kontekstem
pt_br: Controle de linha de contexto
uk: Контроль контексту рядка

source: B<-A>I< NUM>,B< -\^-after-context=>I<NUM>
fr: B<-A> I<N>,B< -\^-after-context=>I<N>
nl: B<-A>I< AANTAL>,B< -\^-after-context=>I<AANTAL>
pl: B<-A>I< LICZBA>,B< -\^-after-context=>I<LICZBA>
pt_br: B<-A>I< NÚM>,B< -\^-after-context=>I<NÚM>
uk: B<-A>I<ЧИСЛО>,B< -\^-after-context=>I<ЧИСЛО>
