Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Two regular expressions may be concatenated; the resulting regular expression matches any string formed by concatenating two substrings that respectively match the concatenated expressions.
fr: Deux expressions rationnelles peuvent être concaténées\ ; l'expression résultante correspondra à toute chaîne formée par la concaténation de deux sous-chaînes correspondant respectivement aux expressions concaténées.
nl: Twee reguliere expressies kunnen worden geconcateneerd; de reguliere expressie die dat oplevert past elk tekst die bestaat uit de twee samen gevoegde sub-teksten die op de twee respectievelijke sub-expressies passen.
pl: Dwa wyrażenia regularne można ze sobą złączyć; do wynikowego wyrażenia regularnego pasuje każdy łańcuch utworzony przez złączenie dwóch podłańcuchów, które odpowiednio pasują do złączonych wyrażeń.
pt_br: Duas expressões regulares podem ser concatenadas; a expressão regular resultante coincide com qualquer sequência formada concatenando duas partes de texto que coincidem respectivamente às expressões concatenadas.
uk: Два регулярних вирази можуть бути об'єднані; отриманий регулярний вираз відповідає будь-якому рядку, утвореному шляхом зчеплення двох підрядків, які відповідно збігаються об'єднаним виразам.

source: Alternation
fr: Alternatives
nl: Afwisseling
pl: Alternatywa
pt_br: Alternação
uk: Черговість

source: Two regular expressions may be joined by the infix operator B<|>; the resulting regular expression matches any string matching either alternate expression.
fr: Deux expressions rationnelles peuvent être reliées par l'opérateur infixe B<|>\ ; l'expression résultante correspondra à toute chaîne qui comporte l'une ou l'autre des deux expressions.
nl: Twee reguliere expressies kunnen samengevoegd worden door de invoeg operator B<|>; de reguliere expressie die dat oplevert past elke string die of de ene, of de andere sub-expressie past.
pl: Dwa wyrażenia regularne można połączyć operatorem wrostkowym B<|>; do wynikowego wyrażenia regularnego pasuje dowolny łańcuch pasujące do jednego bądź do drugiego z podwyrażeń.
pt_br: Duas expressões regulares podem ser unidas pelo operador de infixo B<|>; a expressão regular resultante coincide com qualquer texto que coincida com a expressão alternativa.
uk: Два регулярні вирази можуть бути об'єднані за допомогою оператора B<|>; отриманий регулярний вираз відповідає будь-якому рядку, що відповідає будь-якому альтернативному виразу.

source: Precedence
fr: Priorités
nl: Voorrang
pl: Kolejność wykonywania
pt_br: Precedência
uk: Пріоритетність

source: Repetition takes precedence over concatenation, which in turn takes precedence over alternation. A whole expression may be enclosed in parentheses to override these precedence rules and form a subexpression.
fr: Les répétitions ont priorité sur les concaténations, qui à leur tour ont priorité sur les alternatives. Une sous-expression peut être entourée par des parenthèses pour modifier ces règles de priorité et former une expression.
nl: Herhaling heeft voorrang boven achter elkaar aanzetten, wat weer voorrang heeft boven wisselen. Een hele sub-expressie kan omgeven worden door haakjes om deze voorrangsregels te omzeilen.
pl: Powtarzanie ma priorytet na sumowaniem, które z kolei ma priorytet nad alternatywą. Całe wyrażenie regularne można ująć w nawiasy, celem unieważnienia reguł priorytetowych. W ten sposób zostanie utworzone podwyrażenie.
pt_br: A repetição tem precedência sobre a concatenação, que por sua vez tem precedência sobre a alternância. Uma expressão inteira pode estar entre parênteses para substituir essas regras de precedência e formar uma subexpressão.
uk: Повторення має перевагу над ланцюжком, який, у свою чергу, має перевагу над черговістю. Щоб замінити ці правила пріоритету та сформувати підвираз, цілий вираз може бути узятий у дужки.

source: Back-references and Subexpressions
fr: Références arrières et sous-expressions
nl: Terugverwijzingen en Sub-expressies
pl: Odwołania zwrotne i podwyrażenia
pt_br: Retrorreferências e subexpressões
uk: Зворотні посилання та підвирази

source: The back-reference B<\e>I<n>\&, where I<n> is a single digit, matches the substring previously matched by the I<n>th parenthesized subexpression of the regular expression.
fr: La référence arrière B<\e>I<n>\&, où I<n> est un chiffre unique, correspond à la sous-chaîne déjà mise en correspondance avec la I<n>-ième sous-expression rationnelle entre parenthèses.
nl: De terugverwijzing B<\e>I<n>\&, waar I<n> een enkel cijfer is, past de sub-tekst daarvóór gepast door de I<n>de met haakjes omsloten sub-tekst in de reguliere expressie.
pl: Odwołanie zwrotne B<\e>I<n>\&, gdzie I<n> jest cyfrą pasującą do podłańcucha dopasowanego poprzednio przez I<n>-te podwyrażenie wyrażenia regularnego, ujęte w nawiasy.
pt_br: A retrorreferência B<\e>I<n>\&, onde I<n> é um único dígito, coincide à parte de texto anteriormente coincidida pela I<n>-ésima subexpressão entre parênteses da expressão regular.
uk: Зворотне посилання B<\e>I<n>\&, де I<n> є однією цифрою, відповідає підрядку, який раніше відповідав I<n>-му підвиразу регулярного виразу в дужках.

source: Basic vs Extended Regular Expressions
fr: Expressions rationnelles basiques et étendues
nl: Basis versus uitgebreide Reguliere Expressies
pl: Podstawowe i rozszerzone wyrażenia regularne
pt_br: Expressões regulares básicas vs estendidas
uk: Базові з Розширеними регулярні вирази

source: In basic regular expressions the meta-characters B<?>, B<+>, B<{>, B<|>, B<(>, and B<)> lose their special meaning; instead use the backslashed versions B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(>, and B<\e)>.
fr: Dans les expressions rationnelles simples, les métacaractères B<?>, B<+>, B<{>, B<|>, B<(>, et B<)> perdent leur signification spéciale, il faut utiliser à la place leur version avec la contre-oblique B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(>, et B<\e)>.
nl: In basis reguliere expressies verliezen de meta-tekens B<?>, B<+>, B<{>, B<|>, B<(> en B<)> hun speciale betekenis; in plaats daarvan gebruik de versies met backslash B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(> en B<\e)>.
pl: W podstawowych wyrażeniach regularnych metaznaki B<?>, B<+>, B<{>, B<|>, B<(> i B<)> tracą swoje szczególne znaczenie; zamiast nich należy używać wersji z odwrotnym ukośnikiem: B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(> oraz B<\e)>.
pt_br: Nas expressões regulares básicas, os metacaracteres B<?>, B<+>, B<{>, B<|>, B<(> e B<)> perdem seu significado especial; em vez disso, use as versões com barra invertida B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(> e B<\e)>.
uk: У базових регулярних виразах метасимволи B<?>, B<+>, B<{>, B<|>, B<(> і B<)> втрачають своє особливе значення; замість цього використовуйте версії B<\e?>, B<\e+>, B<\e{>, B<\e|>, B<\e(> і B<\e)>.

source: EXIT STATUS
fr: CODE DE RETOUR
nl: EIND WAARDE
pl: KOD ZAKOŃCZENIA
pt_br: STATUS DE SAÍDA
uk: СТАН ВИХОДУ

source: Normally the exit status is 0 if a line is selected, 1 if no lines were selected, and 2 if an error occurred. However, if the B<-q> or B<-\^-quiet> or B<-\^-silent> is used and a line is selected, the exit status is 0 even if an error occurred.
fr: Normalement, le code de retour est B<0> si des concordances ont été trouvées, B<1> si aucune concordance n'a été trouvée et B<2> si une erreur est survenue. Toutefois, si les options B<-q>, B<-\^-quiet> ou B<-\^-silent> sont utilisées et si une ligne est trouvée, le code de retour est B<0> même si une erreur est survenue.
nl: Normaal is de eind waarde 0 als er overeenkomsten werden gevonden, en 1 als geen overeenkomsten werden gevonden en 2 als er een fout optrad. Hoewel, als of B<-q> of B<-\^-quiet> of B<-\^-silent> werd gebruikt en een regel werd gevonden, dan is de eind waarde 0 zelfs als er een fout optrad.
pl: Typowo, statusem wyjściowym jest 0 jeśli dopasowano wiersz, 1, gdy nic nie dopasowano oraz 2, jeżeli wystąpił błąd. Jednakże, jeżeli użyto B<-q>, B<-\^-quiet> lub B<-\^-silent> oraz dopasowano wiersz, statusem wyjściowym będzie 0, nawet jeśli wystąpił błąd.
pt_br: Normalmente, o status de saída é 0 se uma linha for selecionada, 1 se nenhuma linha foi selecionada e 2 se ocorreu um erro. No entanto, se B B<-q> ou B<-\^-quiet> ou B<-\^-silent> for usado e uma linha for selecionada, o status de saída será 0, mesmo que tenha ocorrido um erro.
uk: Зазвичай статус виходу дорівнює 0, якщо вибрано рядок, 1, якщо рядки не вибрано, і 2, якщо сталася помилка. Однак якщо використовується B<-q> або B<-\^-quiet> або B<-\^-silent> і вибрано рядок, статус виходу дорівнює 0, навіть якщо сталася помилка.

source: ENVIRONMENT
fr: ENVIRONNEMENT
nl: OMGEVING
pl: ŚRODOWISKO
pt_br: AMBIENTE
uk: СЕРЕДОВИЩЕ

source: The behavior of B<grep> is affected by the following environment variables.
fr: Le comportement de B<grep> est modifié par les variables d'environnement suivantes\ :
nl: Het gedrag van B<grep> wordt beïnvloed door de volgende omgevingsvariabelen
pl: Zachowanie B<grep>a można zmienić poniższymi zmiennymi środowiskowymi.
pt_br: O comportamento de B<grep> é afetado pelas seguintes variáveis de ambiente.
uk: На поведінку B<grep> впливають наступні змінні середовища.

source: The locale for category B<LC_>I<foo> is specified by examining the three environment variables B<LC_ALL>, B<LC_>I<foo>, B<LANG>, in that order. The first of these variables that is set specifies the locale. For example, if B<LC_ALL> is not set, but B<LC_MESSAGES> is set to B<pt_BR>, then the Brazilian Portuguese locale is used for the B<LC_MESSAGES> category. The C locale is used if none of these environment variables are set, if the locale catalog is not installed, or if B<grep> was not compiled with national language support (NLS). The shell command B<locale -a> lists locales that are currently available.
fr: Les paramètres régionaux pour la catégorie B<LC_>I<truc> sont définis par les trois variables d'environnement B<LC_ALL>, B<LC_>I<truc>, B<LANG>, dans cet ordre. La variable positionnée en premier détermine le choix des paramètres régionaux. Par exemple, si B<LC_ALL> n'est pas positionnée, mais B<LC_MESSAGES> vaut B<fr_FR>, alors le français est utilisé pour l'affichage des messages. Par défaut «\ C\ » est utilisée si aucune variable d'environnement n'est trouvée, si le catalogue des paramètres régionaux n'est pas installé ou bien si B<grep> a été compilé sans le support pour les langues nationales (\s-1NLS\s0). La commande B<locale -a> liste les paramètres régionaux actuellement disponibles.
nl: De taaldefinitie van de categorie B<LC_>I<foo> wordt gespecificeerd door drie omgevingsvariabelen B<LC_ALL>, B<LC_>I<foo>, B<LANG> in die volgorde te bekijken. De eerste van deze variabelen die is gezet bepaald de taaldefinitie. Bij voorbeeld, als B<LC_ALL> niet is gezet, maar B<LC_MESSAGES> is gezet op B<pt_BR>, dan wordt de Braziliaans-Portugese taaldefinitie gebruikt voor de B<LC_MESSAGES> categorie. De C taaldefinitie wordt gebruikt als geen enkele taaldefinitie is gezet, als de taal catalogus niet werd geïnstalleerd, of B<grep> werd niet gebouwd met nationale taal ondersteuning (NLS). Het shell commando B<locale -a> toont beschikbare taaldefinities.
pl: Ustawienia regionalne (locale) dla kategorii B<LC_>I<foo> są określane przez sprawdzanie trzech zmiennych środowiska, B<LC_ALL>, B<LC_>I<foo>, B<LANG>; w tej kolejności. Pierwsza z tych zmiennych, która jest ustawiona, określa locale. Na przykład, jeśli B<LC_ALL> nie jest ustawiona, ale B<LC_MESSAGES> jest ustawiona na B<pt_BR>, to dla kategorii B<LC_MESSAGES> używane są ustawienia brazylijskiej odmiany portugalskiego. Jeśli żadna z powyższych zmiennych nie jest ustawiona, katalog locale nie jest zainstalowany, lub B<grep> nie został skompilowany z obsługą języka narodowego (NLS), to używane są locale C. Dostępne locale można sprawdzić komendą B<locale -a>.
pt_br: O código do idioma da categoria B<LC_>I<foo> é especificado examinando as três variáveis de ambiente B<LC_ALL>, B<LC_>I<foo>, B<LANG>, nessa ordem. A primeira dessas variáveis configuradas especifica o código do idioma. Por exemplo, se B<LC_ALL> não estiver definido, mas B<LC_MESSAGES> estiver definido como B<pt_BR>, o código do idioma português do Brasil será usado para a categoria B<LC_MESSAGES>. O código de idioma C é usado se nenhuma dessas variáveis de ambiente estiver definida, se o catálogo de códigos de idioma não estiver instalado ou se B<grep> não tiver sido compilado com suporte ao idioma nacional (NLS). O comando de shell B<locale -a> lista as localidades que estão disponíveis no momento.
uk: Локаль для категорії B<LC_>I<foo> визначається шляхом вивчення трьох змінних середовища B<LC_ALL>, B<LC_>I<foo>, B<LANG> саме в такому порядку. Перша з цих змінних, яка встановлюється, визначає локаль. Наприклад, якщо B<LC_ALL> не встановлено, але B<LC_MESSAGES> встановлено на B<pt_BR>, тоді для категорії B<LC_MESSAGES> використовується бразильська португальська мова. Локаль C використовується, якщо жодна з цих змінних середовища не встановлена, якщо каталог мовних стандартів не встановлено, або якщо B<grep> не було скомпільовано з підтримкою національної мови (NLS). Команда оболонки B<locale -a> перелічує доступні на даний момент локалі.

source: This variable specifies the color used to highlight matched (non-empty) text. It is deprecated in favor of B<GREP_COLORS>, but still supported. The B<mt>, B<ms>, and B<mc> capabilities of B<GREP_COLORS> have priority over it. It can only specify the color used to highlight the matching non-empty text in any matching line (a selected line when the B<-v> command-line option is omitted, or a context line when B<-v> is specified). The default is B<01;31>, which means a bold red foreground text on the terminal's default background.
fr: Cette variable spécifie la couleur utilisée pour mettre en évidence le texte qui correspond (et n'est pas vide). Elle est dépréciée en faveur de B<GREP_COLORS>, mais est encore prise en charge. Les capacités B<mt>, B<ms> et B<mc> de B<GREP_COLORS> sont prioritaires sur celle-ci. Cette variable ne peut que spécifier la couleur pour mettre en évidence le texte non vide concordant dans une ligne qui correspond (une ligne sélectionnée quand l'option de la ligne de commande B<-v> n'est pas utilisée, ou une ligne de contexte quand B<-v> est spécifiée). La valeur par défaut est B<01;31>, ce qui correspond à un texte rouge en gras sur le fond par défaut du terminal.
nl: Deze variabele bepaald de kleur die gebruikt wordt om gevonden (niet lege) \ tekst te accentueren. Hij is afgekeurd ten gunste van B<GREP_COLORS>, maar wordt nog ondersteund. De B<mt>, B<ms>, en B<mc> vormen van B<GREP_COLORS> hebben hogere prioriteit. Hij kan alleen de kleur die gebruikt wordt om gevonden niet-lege tekst te accentueren in een gevonden regel (een gevonden regel als de B<-v> commando-regel optie werd weggelaten, of een context regel als B<-v> werd opgegeven), De standaard is B<01;31>, hetgeen een rode voorgrond tekst op de standaard achtergrond van de terminal inhoud.
pl: Ta zmienna określa kolor używany do podświetlenia dopasowanego (niepustego) tekstu. Jest przestarzała, lecz wciąż obsługiwana; powinno się obecnie używać B<GREP_COLORS>. Możliwości B<mt>, B<ms> i B<mc> zmiennej B<GREP_COLORS> mają nad nią priorytet. Zmienna może określać jedynie kolor używany do podświetlania pasującego, niepustego tekstu w pasującym wierszu (wybranym, jeśli nie podano opcji B<-v> albo wierszu kontekstu jeśli ją wpisano). Domyślnym ustawieniem jest B<01;31>, czyli pogrubiony, czerwony tekst na domyślnym tle terminala.
pt_br: Essa variável especifica a cor usada para realçar o texto coincidente (não vazio). Ela foi descontinuada em favor de B<GREP_COLORS>, mas ainda é suportada. Os recursos B<mt>, B<ms> e B<mc> de B<GREP_COLORS> têm prioridade sobre ela. Ela pode especificar apenas a cor usada para realçar o texto não vazio coincidente em qualquer ocorrência (uma linha selecionada quando a opção de linha de comando B<-v> for omitida ou uma linha de contexto quando B<-v> for especificado) . O padrão é B<01;31>, o que significa um texto em primeiro plano em negrito no fundo padrão do terminal.
uk: Ця змінна визначає колір, який використовується для виділення відповідного (непорожнього) тексту. Це застаріла опція в B<GREP_COLORS>, але вона ще підтримується. Можливості B<mt>, B<ms> і B<mc> B<GREP_COLORS> мають пріоритет над нею. Вона може лише вказати колір, який використовується для виділення відповідного непорожнього тексту в будь-якому відповідному рядку (вибраний рядок, коли параметр командного рядка B<-v> опущено, або контекстний рядок, коли вказано B<-v>). Типовим значенням є B<01;31>, що означає напівжирний червоний текст та типовий фон термінала.

source: Specifies the colors and other attributes used to highlight various parts of the output. Its value is a colon-separated list of capabilities that defaults to B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36> with the B<rv> and B<ne> boolean capabilities omitted (i.e., false). Supported capabilities are as follows.
fr: Indiquer les couleurs et autres attributs utilisés pour mettre en évidence différentes parties de la sortie. Sa valeur est une liste de capacités séparées par des deux-points, qui vaut par défaut B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36> sans les capacités booléennes B<rv> et B<ne> (qui prennent alors la valeur « false », faux). Les capacités prises en charge sont les suivantes :
nl: Specificeert kleuren en andere attributen die gebruikt kunnen worden om de diverse onderdelen van de uitvoer te accentueren. Zijn waarde is een komma-gescheiden lijst van mogelijkheden met B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36> als standaard waarde en de B<rv> en B<ne> logische mogelijkheden zijn weggelaten (m.a.w. onwaar). Ondersteunde mogelijkheden zijn de volgende.
pl: Określa kolory i inne atrybuty użyte do podświetlania różnych części wyniku. Jej wartością jest lista możliwości, oddzielonych dwukropkami, która domyślnie wygląda następująco: B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36>, z pominiętymi wartościami logicznymi B<rv> i B<ne> (tzn. ustawionymi na fałsz). Obsługiwane możliwości to:
pt_br: Especifica as cores e outros atributos usados para realçar várias partes da saída. Seu valor é uma lista de recursos separados por dois pontos, cujo padrão é B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36> com os recursos booleanos B<rv> e B<ne> omitidos (ou seja, false). Os recursos suportados são os seguintes.
uk: Визначає кольори та інші атрибути, які використовуються для виділення різних частин виводу. Його значення — це список можливостей, розділений двокрапкою, який типово має значення B<ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36> з логічні можливості B<rv> і B<ne> пропущені (тобто false). Підтримувані можливості наступні.

source: SGR substring for whole selected lines (i.e., matching lines when the B<-v> command-line option is omitted, or non-matching lines when B<-v> is specified). If however the boolean B<rv> capability and the B<-v> command-line option are both specified, it applies to context matching lines instead. The default is empty (i.e., the terminal's default color pair).
fr: Sous-chaîne SGR (« Select Graphic Rendition ») pour les lignes entières sélectionnées (c'est-à-dire les lignes qui correspondent quand l'option en ligne de commande B<-v> n'est pas utilisée, ou les lignes qui ne correspondent pas quand B<-v> est spécifiée). Si cependant la capacité booléenne B<rv> et l'option en ligne de commande B<-v> sont toutes deux indiquées, cela s'applique à la place aux lignes de contexte qui correspondent. La valeur par défaut est vide (c'est-à-dire la paire de couleurs par défaut du terminal).
nl: SGR sub-tekst voor compleet geselecteerde regels (m.a.w. passende regels als de B<-v> commando-regel optie werd weggelaten, of niet-passende regels als B<-v> werd opgegeven). Als zowel de logische B<rv> optie en de B<-v> commando-regel opgegeven werden, dan is dit van toepassing op passende contex regels. De standaard is leeg (m.a.w. het standaard kleuren paar van de terminal).
pl: Podciąg SGR dla całego wybranego wiersza (tzn. pasującego, jeśli nie podano opcji B<-v> lub niepasującego w przeciwnym wypadku). Jeśli jednak wartość logiczna B<rv> i opcja wiersza poleceń B<-v> zostały podane, to będzie on dotyczył w zamian kontekstu pasujących wierszy. Domyślnie jest pusta (tzn. ustawiona jest domyślna para kolorów terminala).
pt_br: Parte de texto de SGR para linhas selecionadas inteiras (ou seja, ocorrências quando a opção de linha de comando B<-v> for omitida ou linhas não coincidentes quando B<-v> for especificado). Se, no entanto, o recurso booleano B<rv> e a opção de linha de comando B<-v> forem especificadas, ela se aplicará às ocorrências ao contexto. O padrão está vazio (ou seja, o par de cores padrão do terminal).
uk: Підрядок SGR для цілих виділених рядків (тобто рядки, що збігаються, коли параметр командного рядка B<-v> опущено, або невідповідні рядки, коли вказано B<-v>). Проте, якщо вказано логічну можливість B<rv> і параметр командного рядка B<-v>, це застосовується натомість до рядків відповідності контексту.

source: SGR substring for whole context lines (i.e., non-matching lines when the B<-v> command-line option is omitted, or matching lines when B<-v> is specified). If however the boolean B<rv> capability and the B<-v> command-line option are both specified, it applies to selected non-matching lines instead. The default is empty (i.e., the terminal's default color pair).
fr: Sous-chaîne SGR pour les lignes de contexte entières (c'est-à-dire les lignes qui ne correspondent pas quand l'option en ligne de commande B<-v> n'est pas utilisée, ou les lignes qui correspondent quand B<-v> est indiquée). Si cependant la capacité booléenne B<rv> et l'option en ligne de commande B<-v> sont toutes deux indiquées, cela s'applique à la place aux lignes qui ne correspondent pas. La valeur par défaut est vide (c'est-à-dire la paire de couleurs par défaut du terminal).
nl: SGR sub-tekst for hele context regels (m.a.w. niet-passende regels als de B<-v> commando-regel optie is weggelaten, or passend regels als B<-v> werd opgegeven. Als echter zowel de logische B<rv> als de B<-v> commando-regel optie werden opgegeven, dan is dit alleen van toepassing op geselecteerde niet-passende regels. De standaard is leeg (.m.a.w. het standaard kleuren paar van de terminal).
pl: Podciąg SGR dla wszystkich wierszy kontekstu (tzn. niepasujących wierszy, jeśli nie podano opcji B<-v> lub pasujących w przeciwnym wypadku). Jeśli jednak wartość logiczna B<rv> i opcja wiersza poleceń B<-v> zostały podane, to będzie on dotyczył w zamian wybranych, niepasujących wierszy. Domyślnie jest pusta (tzn. ustawiona jest domyślna para kolorów terminala).
pt_br: Parte de texto de SGR para linhas de contexto inteiras (ou seja, linhas não coincidentes quando a opção de linha de comando B<-v> for omitida ou ocorrências quando B<-v> for especificado). Se, no entanto, o recurso booleano B<rv> e a opção de linha de comando B<-v> forem especificadas, ela se aplicará às linhas não coincidentes selecionadas. O padrão está vazio (ou seja, o par de cores padrão do terminal).
uk: Підрядок SGR для цілих рядків контексту (тобто невідповідні рядки, коли параметр командного рядка B<-v> опущено, або відповідні рядки, коли вказано B<-v>). Проте, якщо вказано логічну можливість B<rv> і параметр командного рядка B<-v>, вона застосовується замість цього до вибраних невідповідних рядків. Типово порожній (тобто типова пара кольорів термінала).
