Repository: sebras/manpages-l10n
Catalog: po/*/man1/grep.1.po
Languages: fr, nl, pl, pt_br, uk

source: Skip any command-line file with a name suffix that matches the pattern I<GLOB>, using wildcard matching; a name suffix is either the whole name, or a trailing part that starts with a non-slash character immediately after a slash (B</>) in the name. When searching recursively, skip any subfile whose base name matches I<GLOB>; the base name is the part after the last slash. A pattern can use B<*>, B<?>, and B<[>.\|.\|.B<]\&> as wildcards, and B<\e> to quote a wildcard or backslash character literally.
fr: Sauter tout fichier sur la ligne de commande dont le suffixe du nom correspond au motif I<GLOB>, en utilisant la correspondance de jokers ; un suffixe de nom est soit tout le nom, soit la partie qui commence par un caractère, n’étant pas une barre oblique, immédiatement après une barre oblique (B</>) dans un nom. Lors d'une recherche récursive, sauter tous les sous-fichiers dont le nom de base correspond à I<GLOB> ; le nom de base est la partie après la dernière barre oblique. Un motif peut utiliser B<*>, B<?> et B<[>.\|.\|.B<]\&> comme jocker et B<\e> pour interpréter littéralement les caractères joker ou barre oblique inversée.
nl: Sla elke commando-regel bestand over met een achtervoegsel dat past op het patroon I<GLOB>, gebruik makend van jokerteken; een naam achtervoegsel is of de volledige naam of een volgend deel dat begint met een niet-slash teken onmiddellijk na de slash (B</>) in de naam. Als er recursief gezocht wordt, sla dan elke bestand over waarvan de basis naam past op I<GLOB>; de basis naam is het deel na de laatste slash. Een patroon mag B<*>, B<?>, en B<[>.\|.\|.B<]\&> als jokertekens, en B<\e> gebruiken om een jokerteken of backslash teken letterlijk te citeren.
pl: Pomija jakiekolwiek pliki z przyrostkiem nazwy, który zgadza się ze I<WZORCEM> używając dopasowania wieloznacznego; przyrostek nazwy jest albo całą nazwą pliku, albo końcową częścią, która zaczyna się od znaku innego niż ukośnik występującego od razu po ukośniku B</> w nazwie. Przy wyszukiwaniu rekurencyjnym, pomija jakikolwiek podplik, którego bazowa nazwa zgadza się z I<WZORCEM>; nazwa bazowa jest częścią po ostatnim B</>. Wzorzec może wykorzystywać B<*>, B<?> albo B<[>.\|.\|.B<]\&> jako wieloznaczniki oraz B<\e>, aby zacytować wieloznacznik lub odwrócony ukośnik.
pt_br: Pula qualquer arquivo de linha de comando com um sufixo de nome que coincida com o padrão I<GLOB>, usando coincidência de curinga; um sufixo de nome é o nome inteiro ou uma parte à direita que começa com um caractere sem barra imediatamente após uma barra (B</>) no nome. Ao pesquisar recursivamente, pula qualquer subarquivo cujo nome base coincida com I<GLOB>; o nome base é a parte após a última barra. Um padrão pode usar B<*>, B<?> e B<[>.\|.\|.B<]\&> como curingas e B<\e> para colocar entre aspas um caractere curinga ou barra invertida literalmente.
uk: Пропускає будь-який файл командного рядка із суфіксом імені, який відповідає шаблону I<ШАБЛОН ПОШУКУ>, використовуючи підстановку; суфікс назви – це або ціла назва, або частина в кінці, яка починається з символу без косої риски відразу після косої риски (B</>) у назві. Під час рекурсивного пошуку пропускається будь-який файл, базова назва якого відповідає I<ШАБЛОН ПОШУКУ>; базова назва — частина після останньої косої риски. Зразок може використовувати B<*>, B<?> і B<[>.\|.\|.B<]\&> як символи підстановки та B<\e> для буквального цитування символу підстановки або зворотної косої риски.

source: B<-\^-exclude-from=>I<FILE>
fr: B<-\^-exclude-from=>I<FICHIER>
nl: B<-\^-exclude-from=>I<BESTAND>
pl: B<-\^-exclude-from=>I<PLIK>
pt_br: B<-\^-exclude-from=>I<ARQUIVO>
uk: B<-\^-exclude-from=>I<ФАЙЛ>

source: Skip files whose base name matches any of the file-name globs read from I<FILE> (using wildcard matching as described under B<-\^-exclude>).
fr: Sauter les fichiers dont le nom de fichier correspond à un des motifs contenus dans le I<FICHIER> (en utilisant les jokers comme décrit pour B<-\^-exclude>).
nl: Sla bestanden over waarvan de basis naam past op een van de algemene bestandsnamen gelezen van I<BESTAND> (gebruik jokerteken passend zoals beschreven onder B<-\^-exclude>).
pl: Pomija pliki, których nazwa pasuje do któregoś ze wzorców odczytanego z I<PLIKU> (używając masek, opisanych w opcji B<\^-exclude>).
pt_br: Ignora arquivos cujo nome base coincide com qualquer um dos globs de nome de arquivo lidos em I<ARQUIVO> (usando a coincidência curinga conforme descrito em B<-\^-exclude>).
uk: Пропускаються файли, базова назва яких збігається з будь-яким із назв файлів, зчитаних з I<ФАЙЛ> (з використанням зіставлення підстановки, як описано в розділі B<-\^-exclude>).

source: B<-\^-exclude-dir=>I<GLOB>
nl: B<-\^-exclude-dir=>I<BESTANDSPATROON>
pl: B<-\^-exclude-dir=>I<WZORZEC>
uk: B<-\^-exclude-dir=>I<ШАБЛОН ПОШУКУ>

source: Skip any command-line directory with a name suffix that matches the pattern I<GLOB>. When searching recursively, skip any subdirectory whose base name matches I<GLOB>. Ignore any redundant trailing slashes in I<GLOB>.
fr: Sauter tout répertoire sur la ligne de commande dont le suffixe de nom correspond au motif I<GLOB>. Lors d'une recherche récursive, sauter tout sous-répertoire dont le nom de base correspond à I<GLOB>. Ignorer les barres obliques redondantes finales dans I<GLOB>.
nl: Sla elke commando-regel map over met een achtervoegsel dat past op het patroon I<GLOB>. Als er recursief gezocht wordt, sla een map over waarvan de basis naam past op I<GLOB>. Negeer overtollige slashes achter in I<GLOB>.
pl: Pomija jakiekolwiek katalogi z przyrostkiem nazwy, który zgadza się ze I<WZORCEM>. Przy wyszukiwaniu rekurencyjnym, pomija jakiekolwiek podkatalogi, których bazowa nazwa zgadza się ze I<WZORCEM>. Ignoruje wszystkie powtarzające się ukośniki we I<WZORCU>.
pt_br: Pula qualquer diretório da linha de comandos com um sufixo de nome que coincida com o padrão I<GLOB>. Ao pesquisar recursivamente, pula qualquer subdiretório cujo nome base coincida com I<GLOB>. Ignora as barras finais redundantes em I<GLOB>.
uk: Пропускається будь-який каталог командного рядка із суфіксом імені, який відповідає шаблону I<ШАБЛОН ПОШУКУ>. Під час рекурсивного пошуку пропускається будь-який підкаталог, базова назва якого відповідає I<ШАБЛОН ПОШУКУ>. Будь-які зайві кінцеві косі риски в I<ШАБЛОН ПОШУКУ> ігноруються.

source: Process a binary file as if it did not contain matching data; this is equivalent to the B<-\^-binary-files=without-match> option.
fr: Traiter un fichier binaire comme s'il ne contenait aucune correspondance\ ; c'est équivalent à l'option B<-\^-binary-files=without-match>.
nl: Verwerk een binair bestand als of het geen passende gegevens bevatte; dit is gelijk aan de B<-\^-binary-files=without-match> optie.
pl: Przetwarza plik binarny tak, jakby nie zawierał pasujących danych, jest to równoważne opcji B<-\^-binary-files=without-match>.
pt_br: Processa um arquivo binário como se não contivesse dados de coincidência isso é equivalente à opção B<-\^-binary-files=without-match>.
uk: Двійковий файл обробляється так, ніби він не містить відповідних даних; це еквівалентно параметру B<-\^-binary-files=without-match>.

source: B<-\^-include=>I<GLOB>
nl: B<-\^-include=>I<BESTANDSPATROON>
pl: B<-\^-include=>I<WZORZEC>
uk: B<-\^-include=>I<ШАБЛОН ПОШУКУ>

source: Search only files whose base name matches I<GLOB> (using wildcard matching as described under B<-\^-exclude>). If contradictory B<-\^-include> and B<-\^-exclude> options are given, the last matching one wins. If no B<-\^-include> or B<-\^-exclude> options match, a file is included unless the first such option is B<-\^-include>.
fr: Ne rechercher que les fichiers dont le nom correspond à I<GLOB> (en utilisant des jokers correspondant comme décrit sous B<-\^-exclude>). Si vous donnez des options B<-\^-include> et B<-\^-eclude> contradictoires, la dernière correspondance gagne. Si ni B<-\^-include>, ni B<-\^-exclude> ne correspondent, un fichier est inclus à la recherche sauf si la première est B<-\^-include>.
nl: Zoek alleen bestanden waarvan de basis naam past op I<GLOB> (gebruik van jokerteken zoals beschreven in B<-\^-exclude>). Als daarentegen de B<-\^-include> en de B<-\^-exclude> opties werden opgegeven, dan wordt een bestand mee genomen tenzij de eerste van die opties B<-\^-include> is.
pl: Wypisuje jedynie pliki, których nazwy bazowe pasują do I<WZORCA> (używając masek opisanych w opcji B<-\^-exclude>). Jeśli podano sprzeczne opcje B<-\^-include> i B<-\^-exclude>, wygrywa opcja, której uda dopasować się jako ostatniej. Jeśli obydwu opcjom nie uda się niczego dopasować, plik jest uwzględniany, chyba że jako pierwszą podano opcję B<-\^-include>.
pt_br: Pesquisa apenas arquivos cujo nome base coincida a I<GLOB> (usando coincidência de curinga conforme descrito em B<-\^-exclude>). Se as opções B<-\^-include> e B<-\^-exclude> contraditórias forem fornecidas, a última coincidência vence. Se nenhuma opção B<-\^-include> ou B<-\^-exclude> coincidir, um arquivo será incluído, a menos que a primeira opção seja B<-\^-include>.
uk: Шукаються лише файли, базова назва яких відповідає I<ШАБЛОН ПОШУКУ> (використовуючи відповідність підстановки, як описано в розділі B<-\^-exclude>).

source: Read all files under each directory, recursively, following symbolic links only if they are on the command line. Note that if no file operand is given, BE<lt>grepE<gt> searches the working directory. This is equivalent to the B<-d recurse> option.
fr: Lire récursivement tous les fichiers à l'intérieur de chaque répertoire, en ne suivant les liens symboliques que s'ils sont indiqués sur la ligne de commande. Remarquez que si vous ne donnez aucun opérande de fichier, B<grep> recherche dans le répertoire courant. C'est l'équivalent de l'option B<-d recurse>.
nl: Lees alle bestanden in elke map, recursief, volg symbolische koppelingen alleen als ze op de commando regel stonden. Merk op dat als geen bestand werd gegeven, B<grep> alleen in de werk map zoekt. Dit is equivalent aan de B<-drecurse> optie.
pl: Czyta rekurencyjnie wszystkie pliki pod każdym katalogiem, podążając za dowiązaniami symbolicznymi tylko jeśli zostały podane w wierszu polecenia. Proszę zauważyć, że jeżeli nie jest dany żaden argument operacji, B<grep> przeszukuje katalog roboczy. Jest to równoważne opcji B<-d recurse>.
uk: Всі файли в кожному каталозі читаються рекурсивно, з переходами за символічними посиланнями, лише якщо вони знаходяться в командному рядку. Зауважте, що якщо не вказано операнд файлу, BE<lt>grepE<gt> пошук виконується в робочому каталозі. Це еквівалентно параметру B<-d recurse>.

source: Read all files under each directory, recursively. Follow all symbolic links, unlike B<-r>.
fr: Lire récursivement tous les fichiers à l'intérieur de chaque répertoire. Suivre tous les liens symboliques, contrairement à B<-r>.
nl: Lees alle bestanden in elke map, recursief. Volg alle symbolische koppelingen, in tegenstelling to B<-r>.
pl: Czyta rekurencyjnie wszystkie pliki pod każdym katalogiem. Podąża za każdym dowiązaniem symbolicznym, w odróżnieniu od B<-r>.
pt_br: Lê todos os arquivos em cada diretório, recursivamente. Segue todos os links simbólicos, ao contrário de B<-r>.
uk: Рекурсивно читаються всі файли в кожному каталозі. Перехід за всіма символічними посиланнями робиться, на відміну від B<-r>.

source: Other Options
fr: Autres options
nl: Andere Opties
pl: Inne opcje
pt_br: Outras opções
uk: Інші параметри

source: Use line buffering on output. This can cause a performance penalty.
fr: Utiliser un tampon de ligne sur le flux de sortie. Cela peut réduire les performances.
nl: Gebruik regel buffering bij uitvoer. Dit kan een prestaties kosten.
pl: Używa buforowania wierszy wyjścia. Użycie tej opcji może spowodować niższą wydajność.
pt_br: Usa buffer de linha na saída. Isso pode causar uma penalidade de desempenho.
uk: Використовується буферизація рядків на виводі. Це може призвести до зниження продуктивності.

source: Treat the file(s) as binary. By default, under MS-DOS and MS-Windows, B<grep> guesses whether a file is text or binary as described for the B<-\^-binary-files> option. If B<grep> decides the file is a text file, it strips the CR characters from the original file contents (to make regular expressions with B<^> and B<$> work correctly). Specifying B<-U> overrules this guesswork, causing all files to be read and passed to the matching mechanism verbatim; if the file is a text file with CR/LF pairs at the end of each line, this will cause some regular expressions to fail. This option has no effect on platforms other than MS-DOS and MS-Windows.
fr: Traiter les fichiers comme s'ils étaient des fichiers binaires. Par défaut, sous \s-1MS-DOS\s0 et \s-1MS\s0-Windows, B<grep> détermine le type de fichier comme cela est décrit pour l'option B<-\^-binary-files>. Si B<grep> décide que le fichier est un fichier de texte, il enlève les retours chariot (CR) du contenu du fichier original (afin que les expressions avec B<^> et B<$> fonctionnent correctement). L'option B<-U> modifie ce comportement, tous les fichiers sont alors lus et traités tels quels. Si le fichier est un fichier de texte avec des paires CR-LF en fin de ligne, certaines expressions rationnelles peuvent échouer. Cette option n'a aucun effet sur des plates-formes autres que \s-1MS-DOS\s0 et \s-1MS\s0-Windows.
nl: Behandel de bestand(en) als binair. Standaard, onder MS-DOS en MS-win, gokt B<grep> of een bestand een tekst of binair bestand is zoals beschreven voor de B<-\^-binary-files> optie . Als B<grep> besluit dat het bestand een tekst bestand is haalt het de CR karakters uit de originele bestand inhoudt (om reguliere expressies met B<^> en B<$> goed te laten werken). Opgeven van B<-U> overstemd dit gokken, en veroorzaakt dat alle bestanden gelezen worden en doorgegeven worden aan het "passen-op"-mechanisme. Hoe dan ook, als een bestand een tekst bestand met CR/LF paren aan het einde van elke regel is, zal dat ervoor zorgen dat sommige reguliere expressies zullen falen. Deze optie heeft geen zin op andere platformen anders dan MS-DOS en MS-Windows.
pl: Traktuje plik(i) jako binarne. Domyślnie, w MS-DOS i MS-Windows, B<grep> zgaduje, czy plik zawiera tekst lub dane binarne, jak zostało to opisane przy opcji B<-\^-binary-files>. Jeśli B<grep> zdecyduje, że plik jest tekstowy, usuwa znaki CR (powrót karetki) z oryginalnej zawartości pliku (po to, żeby wyrażenia regularne z B<^> i B<$> działały poprawnie). Podanie B<-U> wyłącza tę analizę powodując, że wszystkie pliki są odczytywane i przekazywane mechanizmowi dopasowującemu dosłownie; jeśli plik jest plikiem tekstowym z parami CR/LF na końcu wierszy, spowoduje to, że niektóre wyrażenia regularne nie zadziałają. Opcja ta nie działa na platformach innych niż MS-DOS i MS-Windows.
pt_br: Trata os arquivos como binários. Por padrão, em MS-DOS e MS-Windows, B<grep> calcula se um arquivo é texto ou binário, conforme descrito para a opção B<-\^-binary-files>. Se B<grep> decidir que o arquivo é um arquivo de texto, ele remove os caracteres CR do conteúdo original do arquivo (para fazer expressões regulares com B<^> e B<$> funcionarem corretamente). A especificação de B<-U> anula essas suposições, fazendo com que todos os arquivos sejam lidos e passados para o mecanismo de coincidência literalmente; se o arquivo for um arquivo de texto com pares CR/LF no final de cada linha, isso fará com que algumas expressões regulares falhem. Esta opção não tem efeito em plataformas diferentes do MS-DOS e MS-Windows.
uk: Файл(и) розглядається як двійковий. Типово, у системах MS-DOS та MS-Windows, B<grep> вгадує, чи є файл текстовим чи двійковим, за описом у параметрі B<-\^-binary-files>. Якщо B<grep> вирішить, що файл є текстовим, він видаляє CR знаки з оригінального файлу (щоб регулярні вирази з B<^> і B<$> працювали правильно). Вказання B<-U> скасовує вгадування, зумовлюючи прочитання всіх файлів і буквальну передачу їх механізму порівнювання; якщо це був текстовий із CR/LF парою наприкінці кожного рядка, це може призвести до розбіжності з деякими зразками. Цей параметр не впливає на інші платформи, крім MS-DOS і MS-Windows.

source: Treat input and output data as sequences of lines, each terminated by a zero byte (the ASCII NUL character) instead of a newline. Like the B<-Z> or B<-\^-null> option, this option can be used with commands like B<sort -z> to process arbitrary file names.
fr: Traiter les données d’entrée et de sortie sous forme d’ensembles de lignes, chacune terminée par un octet NULL (le caractère \s-1ASCII\s0 NULL) au lieu d'un changement de ligne. Comme l'option B<-Z> ou B<--null>, cette option peut être combinée avec des commandes comme B<sort -z> pour traiter des fichiers ayant un nom quelconque.
nl: Behandel invoer en uitvoer data als opeenvolgende regels, elke afgesloten met een nul-byte (het ASCII NUL teken) in plaats van een nieuwe regel. Net als de B<-Z> of B<-\^-null> optie, kan deze optie gebruikt worden met commando´s zoals B<sort -z> om willekeurige bestandsnamen te verwerken.
pl: Traktuje dane wejściowe i wyjściowe jako sekwencje wierszy zakończonych bajtem zerowym (znak ASCII NUL) zamiast znakiem końca wiersza. Podobnie jak opcje B<-Z> lub B<-\^-null>, ta opcja może być używana z programami takimi jak B<sort -z>, aby przetworzyć nazwy plików o dowolnych nazwach.
pt_br: Trata os dados de entrada e saída como sequências de linhas, cada uma terminada por um byte zero (o caractere ASCII NUL) em vez de uma nova linha. Como a opção B<-Z> ou B<-\^-null>, esta opção pode ser usada com comandos como B<sort -z> para processar nomes de arquivos arbitrários.
uk: Ввідні та вихідні дані розглядаються як послідовності рядків, кожен з яких закінчується нульовим байтом (символом ASCII NUL) замість знака нового рядка. Так само як B<-Z> або B<-\^-null>, цю опцію можна використовувати з такими командами, як B<sort -z> для обробки довільних назв файлів.

source: REGULAR EXPRESSIONS
fr: EXPRESSIONS RATIONNELLES
nl: REGULIERE EXPRESSIES
pl: WYRAŻENIA REGULARNE
pt_br: EXPRESSÕES REGULARES
uk: РЕГУЛЯРНІ ВИРАЗИ

source: A regular expression is a pattern that describes a set of strings. Regular expressions are constructed analogously to arithmetic expressions, by using various operators to combine smaller expressions.
fr: Une expression rationnelle est un motif qui permet de décrire un ensemble de chaînes. Les expressions rationnelles sont construites comme des opérations arithmétiques\ ; elles utilisent différents opérateurs pour combiner des expressions plus petites.
nl: Een reguliere expressie is een patroon dat een verzameling teksten beschrijft. Reguliere expressies worden op dezelfde manier gebouwd als rekenkundige expressies: door met gebruik van verschillende operatoren kleinere delen samen te binden.
pl: Wyrażenie regularne to wzorzec opisujący zbiór łańcuchów. Wyrażenia regularne są budowane analogicznie do wyrażeń arytmetycznych, przez zastosowanie do połączenia mniejszych wyrażeń, rozmaitych operatorów.
pt_br: Uma expressão regular é um padrão que descreve um conjunto de textos. Expressões regulares são construídas analogamente às expressões aritméticas, usando vários operadores para combinar expressões menores.
uk: Регулярний вираз — це зразок, що описує набір текстових рядків. Регулярні вирази будуються аналогічно арифметичним, з використанням різних операторів для комбінації менших виразів.

source: B<grep> understands three different versions of regular expression syntax: ``basic'' (BRE), ``extended'' (ERE) and ``perl'' (PCRE). In GNU B<grep> there is no difference in available functionality between basic and extended syntaxes. In other implementations, basic regular expressions are less powerful. The following description applies to extended regular expressions; differences for basic regular expressions are summarized afterwards. Perl-compatible regular expressions give additional functionality, and are documented in BE<lt>pcresyntaxE<gt>(3) and BE<lt>pcrepatternE<gt>(3), but work only if PCRE support is enabled.
fr: B<Grep> gère trois styles de syntaxe pour les expressions rationnelles\ : «\ simple\ » (I<basic>, BRE), «\ étendue\ » (I<extended>, ERE) et « I<Perl> » (PCRE). Dans la version \s-1GNU\s0 de B<grep>, il n'y a pas de différence dans les fonctionnalités disponibles pour les styles I<basic> et I<extended>. Dans d'autres implémentations, les expressions rationnelles simples sont moins complètes. La description ci-dessous correspond aux expressions étendues, les différences avec les expressions simples étant résumées ensuite. Les expressions rationnelles Perl offrent des fonctionnalités supplémentaires et sont documentées dans B<pcresyntax>(3) et B<pcrepattern>(3), mais ne fonctionnent que si les PCRE sont disponibles sur le système.
nl: B<grep> begrijpt drie verschillende versies van reguliere-expressies syntaxis: ``basic'' (BRE), ``extended'' (ERE) en ``perl'' (PCRE). In GNU B<grep> is er geen verschil in bruikbaarheid tussen de drie versies. In andere implementaties zijn de basis reguliere expressies minder krachtig. De volgende beschrijving gaat op voor uitgebreide reguliere expressies; verschillen met de basis reguliere expressies worden naderhand samengevat. Perl-compatibele reguliere expressies geven additionele functionaliteit, en zijn gedocumenteerd in BE<lt>pcresyntaxE<gt>(3) en BE<lt>pcrepatternE<gt>(3), maar werken alleen als PCRE beschikbaar is in het systeem
pl: Program B<grep> rozumie trzy różne wersje składni wyrażeń regularnych: "podstawową" (BRE), "rozszerzoną" (ERE) i "perlową" (PCRE). W GNU B<grep> nie ma różnicy w funkcjonalności pomiędzy składniami podstawową i rozszerzoną. W innych implementacjach, podstawowe wyrażenia regularne są uboższe. Poniższy opis stosuje się do rozszerzonych wyrażeń regularnych; różnice w stosunku do wyrażeń podstawowych podsumowano na końcu. Wyrażenia regularne kompatybilne z Perlem dają dodatkowe funkcjonalności, udokumentowane w podręcznikach systemowych B<pcresyntax>(3) i B<pcrepattern>(3), lecz działają tylko jeśli w systemie jest dostępne PCRE.
uk: B<grep> розуміє три різні версії синтаксису регулярних виразів: ``basic'' (BRE), ``extended'' (ERE) та ``perl'' (PCRE) (базовий, розширений та perl). У GNU B<grep> немає різниці в доступній функціональності для перших двох версій. В інших реалізаціях базові регулярні вирази менш потужні. Наступний опис стосується розширених регулярних виразів; після чого підсумовуються відмінності для базових регулярних виразів. Регулярні вирази, сумісні з Perl, надають додаткову функціональність і задокументовані в BE<lt>pcresyntaxE<gt>(3) і BE<lt>pcrepatternE<gt>(3), але працюють лише за умови ввімкненої підтримки PCRE.
