Repository: sebras/manpages-l10n
Catalog: po/*/man1/grub2-render-label.1.po
Languages: sr

source: Wed Feb 26 2014
sr: У среду 26.02.2014

source: NAME
sr: НАЗИВ

source: SYNOPSIS
sr: УВОД

source: B<grub-render-label> [-b | --bgcolor=I<COLOR>] [-c | --color=I<COLOR>]
sr: B<grub-render-label> [-b | --bgcolor=I<БОЈА>] [-c | --color=I<БОЈА>]

source: [-f | --font=I<FILE>] [-i | --input=I<FILE>]
sr: [-f | --font=I<ДАТОТЕКА>] [-i | --input=I<ДАТОТЕКА>]

source: [-o | --output=I<FILE>] [-t | --text=I<STRING>]
sr: [-o | --output=I<ДАТОТЕКА>] [-t | --text=I<НИСКА>]

source: DESCRIPTION
sr: ОПИС

source: OPTIONS
sr: ОПЦИЈЕ

source: B<--color>=I<COLOR>
sr: B<--color>=I<БОЈА>

source: B<--bgcolor>=I<COLOR>
sr: B<--bgcolor>=I<БОЈА>

source: B<--font>=I<FILE>
sr: B<--font>=I<ДАТОТЕКА>

source: --input=I<FILE>
sr: --input=I<ДАТОТЕКА>

source: --output=I<FILE>
sr: --output=I<ДАТОТЕКА>

source: --text=I<STRING>
sr: --text=I<НИСКА>

source: Print verbose output.
sr: Исписује опширне поруке.

source: SEE ALSO
sr: ВИДИТЕ ТАКОЂЕ

source: User Commands
sr: Корисничке наредбе

source: B<grub-render-label> [I<\,OPTION\/>...] [I<\,OPTIONS\/>]
sr: B<grub-render-label> [I<\,ОПЦИЈА\/>...] [I<\,ОПЦИЈЕ\/>]

source: Render Apple .disk_label.
sr: Ствара Ејпол „.disk_label“.

source: B<-b>, B<--bgcolor>=I<\,COLOR\/>
sr: B<-b>, B<--bgcolor>=I<\,БОЈА\/>

source: use COLOR for background
sr: користи БОЈУ за позадину

source: B<-c>, B<--color>=I<\,COLOR\/>
sr: B<-c>, B<--color>=I<\,БОЈА\/>

source: use COLOR for text
sr: користи БОЈУ за текст

source: B<-f>, B<--font>=I<\,FILE\/>
sr: B<-f>, B<--font>=I<\,ДАТОТЕКА\/>

source: use FILE as font (PF2).
sr: користи ДАТОТЕКУ као словни лик (ПФ2).

source: B<-i>, B<--input>=I<\,FILE\/>
sr: B<-i>, B<--input>=I<\,ДАТОТЕКА\/>

source: read text from FILE.
sr: чита текст из ДАТОТЕКЕ.

source: B<-o>, B<--output>=I<\,FILE\/>
sr: B<-o>, B<--output>=I<\,ДАТОТЕКА\/>

source: set output filename. Default is STDOUT
sr: поставља назив излазне датотеке. Основно је СТНДИЗЛАЗ.

source: B<-t>, B<--text>=I<\,STRING\/>
sr: B<-t>, B<--text>=I<\,НИСКА\/>

source: set the label to render
sr: поставља натпис за стварање

source: print verbose messages.
sr: исписује опширне поруке.

source: give this help list
sr: приказује овај списак помоћи

source: give a short usage message
sr: приказује кратку поруку коришћења

source: print program version
sr: исписује издање програма

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
sr: Обавезни или изборни аргументи за дуге опције су такође обавезни или изборни за било које одговарајуће кратке опције.

source: REPORTING BUGS
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА

source: Report bugs to E<lt>bug-grub@gnu.orgE<gt>.
sr: Грешке пријавите на: E<lt>bug-grub@gnu.orgE<gt>.

source: The full documentation for B<grub-render-label> is maintained as a Texinfo manual. If the B<info> and B<grub-render-label> programs are properly installed at your site, the command
sr: Потпуна документација за B<grub-render-label> је одржавана као Тексинфо упутство. Ако су B<info> и B<grub-render-label> исправно инсталирани на вашем сајту, наредба

source: should give you access to the complete manual.
sr: треба да вам да приступ потпуном упутству.

source: GRUB2 2.06
sr: ГРУБ2 2.06
