Repository: sebras/manpages-l10n
Catalog: po/*/man1/grub2-mkimage.1.po
Languages: de

source: Wed Feb 26 2014
de: Mittwoch, 26. Februar 2014

source: NAME
de: BEZEICHNUNG

source: B<grub-mkimage> \(em Make a bootable GRUB image.
de: B<grub-mkimage> \(em ein startfähiges GRUB-Abbild erstellen

source: SYNOPSIS
de: ÜBERSICHT

source: B<grub-mkimage> [-c | --config=FILEI<] [-C | --compression=(xz>,I<none>,I<auto>)]
de: B<grub-mkimage> [-c | --config=DATEII<] [-C | --compression=(xz>,I<none>,I<auto>)]

source: [-d | --directory=DIR] [-k | --pubkey=I<FILE>]
de: [-d | --directory=VERZEICHNIS] [-k | --pubkey=I<DATEI>]

source: [-m | --memdisk=I<FILE>] [-n | --note] [-o | --output=I<FILE>]
de: [-m | --memdisk=I<DATEI>] [-n | --note] [-o | --output=I<DATEI>]

source: [-O | --format=I<FORMAT>] [-p | --prefix=I<DIR>]
de: [-O | --format=I<FORMAT>] [-p | --prefix=I<VERZEICHNIS>]

source: [-v | --verbose] I<MODULES>
de: [-v | --verbose] I<MODULE>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<grub-mkimage> builds a bootable image of GRUB.
de: B<grub-mkimage> erstellt ein startfähiges GRUB-Abbild.

source: OPTIONS
de: OPTIONEN

source: --config=I<FILE>
de: --config=I<DATEI>

source: Embed I<FILE> as the image's initial configuration file.
de: bettet die angegebene I<DATEI> als Frühkonfiguration für das Abbild ein.

source: Use one of I<xz>, I<none>, or I<auto> as the compression method for the core image.
de: wählt die für das Speicherkern-Abbild zu verwendende Kompression aus I<xz>, I<none> oder I<auto> aus.

source: --directory=I<DIR>
de: --directory=I<VERZEICHNIS>

source: Use images and modules from I<DIR>. The default value is B</usr/lib/grub/E<lt>platformE<gt>>.
de: verwendet Abbilder und Module im angegebenen I<VERZEICHNIS>. Vorgabe ist B</usr/""lib/grub/E<lt>PlattformE<gt>>.

source: --pubkey=I<FILE>
de: --pubkey=I<DATEI>

source: Embed the public key I<FILE> for signature checking.
de: bettet die angegebene I<DATEI> als öffentlichen Schlüssel für die Überprüfung der Signatur ein.

source: --memdisk=I<FILE>
de: --memdisk=I<DATEI>

source: Embed the memdisk image I<FILE>. If no B<-p> option is also specified, this implies I<-p (memdisk)/boot/grub>.
de: bettet die angegebene I<DATEI> als Arbeitsspeicherplatten-Abbild ein. Dies impliziert B<-p (Arbeitsspeicherplatte)/boot/grub>, falls keine Option B<-p> angegeben ist.

source: Add a CHRP I<NOTE> section. This option is only valid on IEEE1275 platforms.
de: fügt ein I<NOTE>-Segment für CHRP hinzu. Diese Option ist nur auf IEEE1275-Plattformen gültig.

source: --output=I<FILE>
de: --output=I<DATEI>

source: Write the generated file to I<FILE>. The default is to write to standard output.
de: schreibt die erzeugte Datei in die angegebene I<DATEI>. Per Vorgabe wird in die Standardausgabe geschrieben.

source: Generate an image in the specified I<FORMAT>. Valid values are:
de: erzeugt ein Abbild im angegebenen I<FORMAT>. Gültige Werte sind:

source: --prefix=I<DIR>
de: --prefix=I<VERZEICHNIS>

source: Set prefix directory. The default value is I</boot/grub>.
de: legt das Präfix-Verzeichnis fest. Der Vorgabewert ist I</boot/grub>.

source: Print verbose messages.
de: gibt ausführliche Meldungen aus.

source: I<MODULES>
de: I<MODULE>

source: Include I<MODULES>.
de: bezieht die angegebenen I<MODULE> ein.

source: SEE ALSO
de: SIEHE AUCH

source: December 2021
de: Dezember 2021

source: User Commands
de: Dienstprogramme für Benutzer

source: grub-mkimage - make a bootable image of GRUB
de: grub-mkimage - ein startfähiges GRUB-Abbild erstellen

source: B<grub-mkimage> [I<\,OPTION\/>...] [I<\,OPTION\/>]... [I<\,MODULES\/>]
de: B<grub-mkimage> [I<\,OPTION\/>…] [I<\,OPTION\/>]… [I<\,MODULE\/>]

source: Make a bootable image of GRUB.
de: Erstellt ein startfähiges GRUB-Abbild.

source: B<-c>, B<--config>=I<\,FILE\/>
de: B<-c>, B<--config>=I<\,DATEI\/>

source: embed FILE as an early config
de: bettet die angegebene DATEI als Frühkonfiguration ein.

source: choose the compression to use for core image
de: wählt die für das Speicherkern-Abbild zu verwendende Kompression.

source: B<-d>, B<--directory>=I<\,DIR\/>
de: B<-d>, B<--directory>=I<\,VERZEICHNIS\/>

source: use images and modules under DIR [default=/usr/share/grub2/E<lt>platformE<gt>]
de: verwendet Abbilder und Module im angegebenen VERZEICHNIS (Vorgabe ist /usr/share/grub2/E<lt>PlattformE<gt>).

source: disable shim_lock verifier
de: deaktiviert die shim_lock-Überprüfung.

source: B<-D>, B<--dtb>=I<\,FILE\/>
de: B<-D>, B<--dtb>=I<\,DATEI\/>

source: embed FILE as a device tree (DTB)
de: bettet die angegebene DATEI als »Device tree« (DTB) ein.

source: B<-k>, B<--pubkey>=I<\,FILE\/>
de: B<-k>, B<--pubkey>=I<\,DATEI\/>

source: embed FILE as public key for signature checking
de: bettet die angegebene DATEI als öffentlichen Schlüssel für die Überprüfung der Signatur ein.

source: B<-m>, B<--memdisk>=I<\,FILE\/>
de: B<-m>, B<--memdisk>=I<\,DATEI\/>

source: embed FILE as a memdisk image
de: bettet die angegebene DATEI als Speichergerät-Abbild ein.

source: Implies `-p (memdisk)/boot/grub' and overrides
de: Impliziert B<-p (Speichergerät)/boot/grub> und setzt jedes

source: any prefix supplied previously, but the prefix
de: vorher übergebene Präfix außer Kraft, aber das Präfix

source: itself can be overridden by later options
de: selbst kann durch später angegebene Optionen außer Kraft gesetzt werden.

source: add NOTE segment for CHRP IEEE1275
de: fügt einen NOTE-Teil für CHRP IEEE1275 hinzu.

source: B<-o>, B<--output>=I<\,FILE\/>
de: B<-o>, B<--output>=I<\,DATEI\/>

source: output a generated image to FILE [default=stdout]
de: gibt das erzeugte Abbild in die angegebene DATEI aus (per Vorgabe wird in die Standardausgabe geschrieben).

source: generate an image in FORMAT available formats: i386-coreboot, i386-multiboot, i386-pc, i386-xen_pvh, i386-pc-pxe, i386-pc-eltorito, i386-efi, i386-ieee1275, i386-qemu, x86_64-efi, i386-xen, x86_64-xen, mipsel-yeeloong-flash, mipsel-fuloong2f-flash, mipsel-loongson-elf, powerpc-ieee1275, sparc64-ieee1275-raw, sparc64-ieee1275-cdcore, sparc64-ieee1275-aout, ia64-efi, mips-arc, mipsel-arc, mipsel-qemu_mips-elf, mips-qemu_mips-flash, mipsel-qemu_mips-flash, mips-qemu_mips-elf, arm-uboot, arm-coreboot-vexpress, arm-coreboot-veyron, arm-efi, arm64-efi, riscv32-efi, riscv64-efi
de: erzeugt ein Abbild im angegebenen FORMAT. Folgende Formate sind verfügbar: i386-coreboot, i386-multiboot, i386-pc, i386-xen_pvh, i386-pc-pxe, i386-pc-eltorito, i386-efi, i386-ieee1275, i386-qemu, x86_64-efi, i386-xen, x86_64-xen, mipsel-yeeloong-flash, mipsel-fuloong2f-flash, mipsel-loongson-elf, powerpc-ieee1275, sparc64-ieee1275-raw, sparc64-ieee1275-cdcore, sparc64-ieee1275-aout, ia64-efi, mips-arc, mipsel-arc, mipsel-qemu_mips-elf, mips-qemu_mips-flash, mipsel-qemu_mips-flash, mips-qemu_mips-elf, arm-uboot, arm-coreboot-vexpress, arm-coreboot-veyron, arm-efi, arm64-efi, riscv32-efi, riscv64-efi

source: B<-p>, B<--prefix>=I<\,DIR\/>
de: B<-p>, B<--prefix>=I<\,VERZEICHNIS\/>

source: set prefix directory
de: legt das Präfix-Verzeichnis fest.

source: B<-s>, B<--sbat>=I<\,FILE\/>
de: B<-s>, B<--sbat>=I<\,DATEI\/>

source: SBAT metadata
de: SBAT-Metadaten

source: print verbose messages.
de: gibt ausführliche Meldungen aus.

source: -?, B<--help>
de: B<-?>, B<--help>

source: give this help list
de: gibt eine kurze Hilfe aus.

source: give a short usage message
de: gibt eine kurze Meldung zur Verwendung aus.

source: print program version
de: gibt die Programmversion aus.

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
de: Erforderliche oder optionale Argumente für lange Optionen sind ebenso erforderlich bzw. optional für die entsprechenden Kurzoptionen.

source: REPORTING BUGS
de: FEHLER MELDEN

source: Report bugs to E<lt>bug-grub@gnu.orgE<gt>.
de: Melden Sie Fehler (auf Englisch) an E<lt>bug-grub@gnu.orgE<gt>.

source: The full documentation for B<grub-mkimage> is maintained as a Texinfo manual. If the B<info> and B<grub-mkimage> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<grub-mkimage> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info> und B<grub-mkimage> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
