Repository: sebras/manpages-l10n
Catalog: po/*/man1/grub2-set-bootflag.1.po
Languages: da, de

source: Tue Jun 12 2018
da: Tir Jun 12 2018
de: Dienstag, 12. Juli 2018

source: NAME
da: NAVN
de: BEZEICHNUNG

source: B<grub-set-bootflag> \(em Set a bootflag in the GRUB environment block.
da: B<grub-set-bootflag> \(em Angiv et opstartsflag i GRUB-miljøblokken.
de: B<grub-set-bootflag> \(em eine Bootfähig-Markierung im GRUB-Umgebungsblock setzen

source: SYNOPSIS
de: ÜBERSICHT

source: B<grub-set-bootflag> E<lt>I<BOOTFLAG>E<gt>
da: B<grub-set-bootflag> E<lt>I<OPSTARTSFLAG>E<gt>
de: B<grub-set-bootflag> E<lt>I<BOOTFÄHIG-MARKIERUNG>E<gt>

source: DESCRIPTION
da: BESKRIVELSE
de: BESCHREIBUNG

source: B<grub-set-bootflag> is a command line to set bootflags in GRUB's stored environment.
da: B<grub-set-bootflag> er en kommandolinje til at angive opstartsflag i GRUB's lagret miljø.
de: B<grub-set-bootflag> ist ein Befehlszeilenwerkzeug zum Setzen der Bootfähig-Markierung in der gespeicherten GRUB-Umgebung.

source: COMMANDS
da: KOMMANDOER
de: BEFEHLE

source: B<BOOTFLAG>
de: B<BOOTFÄHIG-MARKIERUNG>

source: Bootflag to set, one of I<boot_success> or I<show_menu_once>.
da: Opstartsflag, vælg mellem I<boot_success> eller I<show_menu_once>.
de: gibt die zu setzende Bootfähig-Markierung an, entweder I<boot_success> oder I<show_menu_once>.

source: SEE ALSO
da: SE OGSÅ
de: SIEHE AUCH

source: July 2022
de: Juli 2022

source: User Commands
da: Brugerkommandoer
de: Dienstprogramme für Benutzer

source: grub-set-bootflag - set a bootflag in the GRUB environment block
da: grub-set-bootflag - angiv et opstartsflag i GRUB-miljøblokken
de: grub-set-bootflag - eine Bootfähig-Markierung im GRUB-Umgebungsblock setzen

source: B<'grub-set-bootflag> I<\,E<lt>bootflagE<gt>', where E<lt>bootflagE<gt> is one of:\/>
da: B<'grub-set-bootflag> I<\,E<lt>bootflagE<gt>', hvor E<lt>bootflagE<gt> er en af:\/>
de: B<'grub-set-bootflag> I<\,E<lt>BootflagE<gt>', wobei I<Bootflag> eines der beiden folgenden ist:\/>

source: The full documentation for B<grub-set-bootflag> is maintained as a Texinfo manual. If the B<info> and B<grub-set-bootflag> programs are properly installed at your site, the command
da: Den fulde dokumentation for B<grub-set-bootflag> vedligeholdes som en Texinfo-manual. Hvis programmerne B<info> og B<grub-set-bootflag> er korrekt installeret, så vil kommandoen
de: Die vollständige Dokumentation für B<grub-set-bootflag> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<grub-set-bootflag> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
da: give dig adgang til den fulde manual.
de: auf das vollständige Handbuch zugreifen.

source: June 2022
da: juni 2022
de: Juni 2022
