Repository: sebras/manpages-l10n
Catalog: po/*/man1/hardlink.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: hardlink - link multiple copies of a file
uk: hardlink — пов'язування посиланнями декількох копій файла

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<hardlink> [options] [I<directory>|I<file>]...
uk: B<hardlink> [параметри] [I<каталог>|I<файл>]...

source: DESCRIPTION
uk: ОПИС

source: B<hardlink> is a tool that replaces copies of a file with either hardlinks or copy-on-write clones, thus saving space.
uk: B<hardlink> — інструмент, який заміняє копії файла їхніми жорсткими посиланнями або клонами копіювання-при-записі, які надають змогу заощадити місце на диску.

source: B<hardlink> first creates a binary tree of file sizes and then compares the content of files that have the same size. There are two basic content comparison methods. The B<memcmp> method directly reads data blocks from files and compares them. The other method is based on checksums (like SHA256); in this case for each data block a checksum is calculated by the Linux kernel crypto API, and this checksum is stored in userspace and used for file comparisons.
uk: Спочатку, B<hardlink> створює бінарне дерево розмірів файлів, а потім порівнює вміст файлів, які мають однаковий розмір. Передбачено два базових методів порівняння вмісту. При використанні методу B<memcmp> програма безпосередньо читає блоки даних з файлів і порівнює її. Інший метод засновано на контрольних сумах (подібних до SHA256); у цьому випадку для кожного з блоків даних буде обчислено контрольну суму за допомогою програмного інтерфейсу шифрування ядра Linux, і цю контрольну суму буде збережено у просторі користувача і використано для порівняння.

source: For each file also an "intro" buffer (32 bytes) is cached. This buffer is used independently from the comparison method and requested cache-size and io-size. The "intro" buffer dramatically reduces operations with data content as files are very often different from the beginning.
uk: Для кожного файла також буде кешовано «вступний» буфер (32 байти). Цей буфер буде використано незалежно від методу порівняння і запитаного розміру кешу та розміру введення-виведення. «Вступний» буфер значно зменшує потребу у діях із даними, оскільки файли дуже часто відрізняються уже початковим вмістом.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit. If specified once, every hardlinked file is displayed, if specified twice, it also shows every comparison.
uk: Вивести дані щодо версії і завершити роботу. Якщо вказано один раз, буде показано кожен файл із жорсткими посиланнями; якщо вказано двічі, також показує усі порівняння.

source: Quiet mode, don\(cqt print anything.
uk: Режим без повідомлень — нічого не виводити.

source: Do not act, just print what would happen.
uk: Не виконувати дій, лише вивести дані щодо того, що буде зроблено.

source: B<-y>, B<--method> I<name>
uk: B<-y>, B<--method> I<назва>

source: Set the file content comparison method. The currently supported methods are sha256, sha1, crc32c and memcmp. The default is sha256, or memcmp if Linux Crypto API is not available. The methods based on checksums are implemented in zero-copy way, in this case file contents are not copied to the userspace and all calculation is done in kernel.
uk: Встановити метод порівняння файлів. Серед методів, підтримку яких передбачено у програмі, sha256, sha1, crc32c і memcmp. Типовим є sha256 або memcmp, якщо програмний інтерфейс Linux є недоступним. Методи, засновані на контрольних сумах, реалізовано у спосіб нуль-копіювання. У цьому випадку вміст файла не буде скопійовано до простору користувача, а усі обчислення буде виконано в ядрі.

source: B<--reflink>[=I<when>]
uk: B<--reflink>[=I<умова>]

source: Create copy-on-write clones (aka reflinks) rather than hardlinks. The reflinked files share only on-disk data, but the file mode and owner can be different. It\(cqs recommended to use it with B<--ignore-owner> and B<--ignore-mode> options. This option implies B<--skip-reflinks> to ignore already cloned files.
uk: Створити клони з копіюванням-при-запису, а не жорсткі посилання. Спільними для файлів-клонів є лише дані на диску, а режим доступу до файлів та власник можуть бути різними. Рекомендуємо використовувати його з параметрами B<--ignore-owner> і B<--ignore-mode>. Цей параметр неявним чином встановлює B<--skip-reflinks> для ігнорування вже клонованих файлів.

source: The optional argument I<when> can be B<never>, B<always>, or B<auto>. If the I<when> argument is omitted, it defaults to B<auto>, in this case, B<hardlink> checks filesystem type and uses reflinks on BTRFS and XFS only, and fallback to hardlinks when creating reflink is impossible. The argument B<always> disables filesystem type detection and fallback to hardlinks, in this case, only reflinks are allowed.
uk: Значенням необов'язкового аргументу I<умова> може бути B<never>, B<always> або B<auto>. Якщо аргумент I<умова> пропущено, типовим значенням є B<auto>. У цьому випадку B<hardlink> перевіряє тип файлової системи і використовує клони лише у BTRFS і XFS, а резервне повернення до жорстких посилань, якщо створення клону є неможливим. Значення аргументу B<always> призводить до вимикання виявлення типу файлової системи і повернення до жорстких посилань; у цьому випадку дозволеними будуть лише клони.

source: Ignore already cloned files. This option may be used without B<--reflink> when creating classic hardlinks.
uk: Ігнорувати вже клоновані файли. Цим параметром можна скористатися без B<--reflink> при створенні класичних жорстких посилань.

source: Only try to link files with the same (base)name. It\(cqs strongly recommended to use long options rather than B<-f> which is interpreted in a different way by other B<hardlink> implementations.
uk: Намагатися створити посилання лише для файлів з однаковою (основною) назвою. Наполегливо рекомендуємо використовувати довгі версії запису параметрів, а не B<-f>, який може бути оброблено у різний спосіб іншими реалізаціями B<hardlink>.

source: Link and compare files even if their mode is different. Results may be slightly unpredictable.
uk: Створити посилання і порівняти файли, навіть якщо режим доступу до файлів є різним. Результати можуть бути дещо непередбачуваними.

source: Link and compare files even if their owner information (user and group) differs. Results may be unpredictable.
uk: Створити посилання і порівняти файли, навіть якщо дані щодо власника (користувача і групи) є різними. Результати можуть бути непередбачуваними.

source: Link and compare files even if their time of modification is different. This is usually a good choice.
uk: Створити посилання і порівняти файли, навіть якщо час внесення змін до файлів є різним. Зазвичай, варто цим скористатися.

source: Only try to link files with the same extended attributes.
uk: Намагатися пов'язати посиланням файли, лише якщо у них однакові розширені атрибути.

source: Among equal files, keep the file with the highest link count.
uk: Серед однакових файлів зберігати файл із найвищою кількістю посилань.

source: Among equal files, keep the file with the lowest link count.
uk: Серед однакових файлів зберігати файл із найнижчою кількістю посилань.

source: Among equal files, keep the oldest file (least recent modification time). By default, the newest file is kept. If B<--maximize> or B<--minimize> is specified, the link count has a higher precedence than the time of modification.
uk: Серед однакових файлів зберегти найдавніший файл (файл із найдавнішим часом внесення змін). Типово, буде збережено найновіший файл. Якщо вказано B<--maximize> або B<--minimize>, кількість посилань матиме вищий пріоритет за час внесення змін.

source: B<-x>, B<--exclude> I<regex>
uk: B<-x>, B<--exclude> I<формальний_вираз>

source: A regular expression which excludes files from being compared and linked.
uk: Формальний вираз, який виключає файли із порівняння і створення посилань.

source: B<-i>, B<--include> I<regex>
uk: B<-i>, B<--include> I<формальний_вираз>

source: A regular expression to include files. If the option B<--exclude> has been given, this option re-includes files which would otherwise be excluded. If the option is used without B<--exclude>, only files matched by the pattern are included.
uk: Формальний вираз для включення файлів. Якщо було вказано параметр B<--exclude>, цей параметр повторно включає файли, які інакше було б виключено. Якщо параметр використано без B<--exclude>, буде включено лише файли, які відповідають взірцю.

source: B<-s>, B<--minimum-size> I<size>
uk: B<-s>, B<--minimum-size> I<розмір>

source: The minimum size to consider. By default this is 1, so empty files will not be linked. The I<size> argument may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB").
uk: Мінімальний розмір, який слід розглядати. Типовим є 1, посилання на порожні файли не створюватимуться. За аргументом I<розмір> можна вказати одиницю виміру: KiB (=124), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад «K» є тим самим, що і «KiB»)

source: B<-S>, B<--maximum-size> I<size>
uk: B<-S>, B<--maximum-size> I<розмір>

source: The maximum size to consider. By default this is 0 and 0 has the special meaning of unlimited. The I<size> argument may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB").
uk: Максимальний розмір, який слід розглядати. Типовим є 0, тобто «без обмежень». За аргументом I<розмір> можна вказати одиницю виміру: KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад «K» є тим самим, що і «KiB»).

source: B<-b>, B<--io-size> I<size>
uk: B<-b>, B<--io-size> I<розмір>

source: The size of the B<read>(2) or B<sendfile>(2) buffer used when comparing file contents. The I<size> argument may be followed by the multiplicative suffixes KiB, MiB, etc. The "iB" is optional, e.g., "K" has the same meaning as "KiB". The default is 8KiB for memcmp method and 1MiB for the other methods. The only memcmp method uses process memory for the buffer, other methods use zero-copy way and I/O operation is done in the kernel. The size may be altered on the fly to fit a number of cached content checksums.
uk: Розмір буфера B<read>(2) або B<sendfile>(2), який буде використано для порівняння вмісту файлів. Після аргументу I<розмір> може бути вказано суфікси розмірностей — KiB, MiB тощо. Частина рядка «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB». Типовим є розмір 8 КіБ для методу memcmp і 1 МіБ для інших методів. Пам'ять процесів для буфера використовує лише метод memcmp, інші методи використовують нуль-копіювання, а дію з введення-виведення виконує ядро. Розмір може бути змінено на льоту так, щоб він відповідав кількості контрольних сум кешованих даних.

source: B<-r>, B<--cache-size> I<size>
uk: B<-r>, B<--cache-size> I<розмір>

source: The size of the cache for content checksums. All non-memcmp methods calculate checksum for each file content block (see B<--io-size>), these checksums are cached for the next comparison. The size is important for large files or a large sets of files of the same size. The default is 10MiB.
uk: Розмір кешу для контрольних сум даних. Для усіх методи, окрім memcmp, контрольну суму буде обчислено для кожного блоку даних файла (див. B<--io-size>), ці контрольні суми буде кешовано для наступного порівняння. Розмір є важливим для великих файлів або великих наборів файлів однакового розміру. Типовим є розмір у 10 МіБ.

source: ARGUMENTS
uk: АРГУМЕНТИ

source: B<hardlink> takes one or more directories which will be searched for files to be linked.
uk: B<hardlink> приймає один або декілька записів каталогів, у яких відбуватиметься пошук файлів для створення посилань.

source: BUGS
uk: ВАДИ

source: The original B<hardlink> implementation uses the option B<-f> to force hardlinks creation between filesystem. This very rarely usable feature is no more supported by the current B<hardlink>.
uk: У початковій реалізації B<hardlink> використано параметр B<-f> для примусового створення жорстких посилань між файловими системами. Підтримки цієї рідкісної у використанні можливості у поточній версії B<hardlink> не передбачено.

source: B<hardlink> assumes that the trees it operates on do not change during operation. If a tree does change, the result is undefined and potentially dangerous. For example, if a regular file is replaced by a device, B<hardlink> may start reading from the device. If a component of a path is replaced by a symbolic link or file permissions change, security may be compromised. Do not run B<hardlink> on a changing tree or on a tree controlled by another user.
uk: При створенні B<hardlink> було зроблено припущення, що ієрархії файлової системи, з якими працює програма, не змінюються під час її роботи. Якщо в ієрархії відбуваються зміни, результат роботи може бути невизначеним або потенційно небезпечним для даних. Наприклад, якщо звичайний файл буде замінено файлом пристрою, B<hardlink> може розпочати читання з пристрою. Якщо компонент шляху буде замінено символічним посиланням або змінено права доступу до файла, може постраждати захист системи. Не запускайте B<hardlink> для ієрархії файлів, у якій відбуваються зміни, або ієрархії файлів, яку контролює інший користувач.

source: AUTHOR
uk: АВТОР

source: There are multiple B<hardlink> implementations. The very first implementation is from Jakub Jelinek for Fedora distribution, this implementation has been used in util-linux between versions v2.34 to v2.36. The current implementations is based on Debian version from Julian Andres Klode.
uk: Існує декілька реалізацій B<hardlink>. Найпершу було створено Jakub Jelinek для дистрибутиву Fedora. Цю реалізацію було використано в util-linux між версіями 2.34 і 2.36. Поточну реалізацію засновано на версії для Debian, автором якої є Julian Andres Klode.

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<hardlink> command is part of the util-linux package which can be downloaded from
uk: B<hardlink> є частиною пакунка util-linux, який можна отримати з

source: hardlink - Link multiple copies of a file
uk: hardlink — пов'язування посиланнями декількох копій файла

source: B<hardlink> [I<option>]... [I<directory>|I<file>]...
uk: B<hardlink> [I<параметр>]... [I<каталог>|I<файл>]...

source: B<hardlink> is a tool which replaces copies of a file with hardlinks, therefore saving space.
uk: B<hardlink> — інструмент, який заміняє копії файла їхніми жорсткими посиланнями або клонами копіювання-при-записі, які надають змогу заощадити місце на диску.

source: B<-h or --help>
uk: B<-h або --help>

source: print quick usage details to the screen.
uk: вивести на екран короткі відомості щодо користування.

source: B<-v or --verbose>
uk: B<-v або --verbose>

source: More verbose output. If specified once, every hardlinked file is displayed, if specified twice, it also shows every comparison.
uk: Вивести докладніші повідомлення. Якщо вказано один раз, буде показано кожен файл із жорсткими посиланнями; якщо вказано двічі, також показує усі порівняння.

source: B<-n or --dry-run>
uk: B<-n або --dry-run>

source: Do not act, just print what would happen
uk: Не виконувати дій, лише вивести дані щодо того, що буде зроблено.

source: B<-f or --respect-name>
uk: B<-f або --respect-name>

source: Only try to link files with the same (basename).
uk: Намагатися пов'язати посиланням файли, лише якщо у них однакова основна назва.

source: B<-p or --ignore-mode>
uk: B<-p або --ignore-mode>

source: Link/compare files even if their mode is different. This may be a bit unpredictable.
uk: Створити посилання і порівняти файли, навіть якщо режим доступу до файлів є різним. Результати можуть бути дещо непередбачуваними.

source: B<-o or --ignore-owner>
uk: B<-o>, B<--ignore-owner>

source: Link/compare files even if their owner (user and group) is different. It is not predictable
uk: Створити посилання і порівняти файли, навіть якщо дані щодо власника (користувача і групи) є різними Результати можуть бути непередбачуваними.

source: B<-t or --ignore-time>
uk: B<-t>, B<--ignore-time>

source: Link/compare files even if their time of modification is different. You almost always want this.
uk: Створити посилання і порівняти файли, навіть якщо час внесення змін до файлів є різним. Зазвичай, варто цим скористатися.

source: B<-X or --respect-xattrs>
uk: B<-X>, B<--respect-xattrs>

source: B<-m or --maximize>
uk: B<-m>, B<--maximize>

source: B<-M or --minimize>
uk: B<-M>, B<--minimize>

source: B<-O or --keep-oldest>
uk: B<-O>, B<--keep-oldest>

source: Among equal files, keep the oldest file (least recent modification time). By default, the newest file is kept. If --maximize or --minimize is specified, the link count has a higher precedence than the time of modification.
uk: Серед однакових файлів зберегти найдавніший файл (файл із найдавнішим часом внесення змін). Типово, буде збережено найновіший файл. Якщо вказано B<--maximize> або B<--minimize>, кількість посилань матиме вищий пріоритет за час внесення змін.

source: B<-x or --exclude>
uk: B<-x або --exclude>

source: B<-i or --include>
uk: B<-i або--include>

source: A regular expression to include files. If the option --exclude has been given, this option re-includes files which would otherwise be excluded. If the option is used without --exclude, only files matched by the pattern are included.
uk: Формальний вираз для включення файлів. Якщо було вказано параметр B<--exclude>, цей параметр повторно включає файли, які інакше було б виключено. Якщо параметр використано без B<--exclude>, буде включено лише файли, які відповідають взірцю.

source: B<-s or --minimum-size>
uk: B<-s або --minimum-size>

source: The minimum size to consider. By default this is 1, so empty files will not be linked. An optional suffix of K,M,G,T may be provided, indicating that the file size is KiB,MiB,GiB,TiB.
uk: Мінімальний розмір, який слід розглядати. Типовим є 1, посилання на порожні файли не створюватимуться. Можна вказувати суфікс K, M, G, T для позначення розміру у КіБ, МіБ, ГіБ та ТіБ.

source: B<hardlink> assumes that the trees it operates on do not change during operation. If a tree does change, the result is undefined and potentially dangerous. For example, if a regular file is replaced by a device, hardlink may start reading from the device. If a component of a path is replaced by a symbolic link or file permissions change, security may be compromised. Do not run hardlink on a changing tree or on a tree controlled by another user.
uk: При створенні B<hardlink> було зроблено припущення, що ієрархії файлової системи, з якими працює програма, не змінюються під час її роботи. Якщо в ієрархії відбуваються зміни, результат роботи може бути невизначеним або потенційно небезпечним для даних. Наприклад, якщо звичайний файл буде замінено файлом пристрою, B<hardlink> може розпочати читання з пристрою. Якщо компонент шляху буде замінено символічним посиланням або змінено права доступу до файла, може постраждати захист системи. Не запускайте B<hardlink> для ієрархії файлів, у якій відбуваються зміни, або ієрархії файлів, яку контролює інший користувач.

source: B<hardlink> , as of version 0.3 RC1, improperly calculates the amount of space saved if the option --respect-name is specified. In previous versions, the amount was wrong in almost all other cases as well.
uk: B<hardlink>, станом на версію 0.3 RC1, помилково обчислює об'єм заощадженого місця, якщо вказано параметр --respect-name. У попередніх версіях об'єм обчислювався помилково і у майже усіх інших випадках.

source: The program hardlink and this manpage have been written by Julian Andres Klode, and are licensed under the MIT license. See the code of hardlink for further information.
uk: Програму hardlink та цю сторінку підручника до неї було написано Julian Andres Klode і випущено за умов дотримання ліцензійної угоди MIT. Докладніші відомості можна отримати з файлів коду hardlink.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: B<hardlink> is a tool which replaces copies of a file with hardlinks or copy-on-write clones, therefore saving space.
uk: B<hardlink> — інструмент, який заміняє копії файла їхніми жорсткими посиланнями або клонами копіювання-при-записі, які надають змогу заощадити місце на диску.

source: B<hardlink> creates a binary tree from file sizes and after that, it compares files with the same sizes. There are two basic content comparison methods. B<memcmp> method directly reads data blocks from files and compares them. The other method is based on checksums (like SHA256), in this case for each data block is calculated checksum by Linux kernel crypto API, and this checksum is stored in userspace and used for files comparison. For each file is also cached "intro" buffer (32 bytes), this buffer is used independently on the comparison method and requested cache-size and io-size. The "intro" buffer dramatically reduces operations with data content as files are very often different from the beginning.
uk: Спочатку, B<hardlink> створює бінарне дерево розмірів файлів, а потім порівнює вміст файлів, які мають однаковий розмір. Передбачено два базових методів порівняння вмісту. При використанні методу B<memcmp> програма безпосередньо читає блоки даних з файлів і порівнює її. Інший метод засновано на контрольних сумах (подібних до SHA256); у цьому випадку для кожного з блоків даних буде обчислено контрольну суму за допомогою програмного інтерфейсу шифрування ядра Linux, і цю контрольну суму буде збережено у просторі користувача і використано для порівняння. Для кожного файла також буде кешовано «вступний» буфер (32 байти). Цей буфер буде використано незалежно від методу порівняння і запитаного розміру кешу та розміру введення-виведення. «Вступний» буфер значно зменшує потребу у діях із даними, оскільки файли дуже часто відрізняються уже початковим вмістом.

source: The original B<hardlink> implementation uses the option B<-f> to force hardlinks creation between filesystem. This very rarely usable feature is no more supported by the current hardlink.
uk: У початковій реалізації B<hardlink> використано параметр B<-f> для примусового створення жорстких посилань між файловими системами. Підтримки цієї рідкісної у використанні можливості у поточній версії B<hardlink> не передбачено.

source: Only try to link files with the same (basename). It\(cqs strongly recommended to use long options rather than B<-f> which is interpreted in a different way by others B<hardlink> implementations.
uk: Намагатися створити посилання лише для файлів з однаковою (основною) назвою. Наполегливо рекомендуємо використовувати довгі версії запису параметрів, а не B<-f>, який може бути оброблено у різний спосіб іншими реалізаціями B<hardlink>.

source: Link/compare files even if their owner (user and group) is different. It is not predictable.
uk: Створити посилання і порівняти файли, навіть якщо дані щодо власника (користувача і групи) є різними. Результати можуть бути непередбачуваними.
