Repository: sebras/manpages-l10n
Catalog: po/*/man1/hostname.1.po
Languages: de, es

source: FILES
de: DATEIEN
es: ARCHIVOS

source: B</etc/hostname> Historically this file was supposed to only contain the hostname and not the full canonical FQDN. Nowadays most software is able to cope with a full FQDN here. This file is read at boot time by the system initialization scripts to set the hostname.
de: B</etc/hostname>: Früher sollte diese Datei nur den Hostnamen und nicht den FQDN enthalten. Heutzutage ist die meiste Software in der Lage, mit einem FQDN umzugehen. Diese Datei wird beim Systemstart durch die System-Initialisierungsskripte eingelesen, um den Hostnamen zu setzen.
es: B</etc/hostname> Históricamente, este archivo contenía solo el nombre del equipo y no el FQDN pero actualmente, la mayoría de aplicaciones aceptan que contenga un FQDN. Los scripts de inicialización del sistema leen su contenido durante el inicio para definir el nombre del equipo.

source: B</etc/hosts> Usually, this is where one sets the domain name by aliasing the host name to the FQDN.
de: B</etc/hosts>: Dies ist üblicherweise die Stelle, an der der Domain-Name gesetzt wird, indem der Hostname als Alias für den FQDN eingetragen wird.
es: B</etc/hosts> aquí suele definirse el nombre de dominio asignando un el nombre de equipo como un alias del FQDN.

source: AUTHORS
de: AUTOREN
es: AUTORES

source: Bernd Eckenfels, E<lt>net-tools@lina.inka.deE<gt> (NIS and manpage).
de: Bernd Eckenfels, E<lt>net-tools@lina.inka.deE<gt> (NIS und Handbuchseite).
es: Bernd Eckenfels, E<lt>net-tools@lina.inka.deE<gt> (NIS y la página de manual).

source: The function B<gethostname(2)> is used to get the hostname. When the B<hostname -a, -d, -f or -i> is called will B<gethostbyname(3)> be called. The difference in B<gethostname(2)> and B<gethostbyname(3)> is that B<gethostbyname(5)> is network aware, so it consults I</etc/nsswitch.conf> and I</etc/host.conf> to decide whether to read information in I</etc/hostname> or I</etc/hosts>
de: Die Funktion B<gethostname>(2) wird zum Erhalten des Hostnames verwandt\&. Beim Aufruf von B<hostname -a, -d, -f oder -i> wird B<gethostbyname>(3) aufgerufen. Der Unterscheid zwischen B<gethostname>(2) und B<gethostbyname>(3) liegt darin, dass B<gethostbyname>(5) Netzwerk-bewusst ist und daher I</etc/nsswitch.conf> und I</etc/host.conf> berücksichtigt, um zu entscheiden, ob die Informationen in I</etc/hostname> oder I</etc/hosts> gelesen werden soll.
es: La función B<gethostname(2)> se emplea para obtener el nombre del equipo. Cada vez que se ejecuta B<hostname -a, -d, -f o -i>, se invoca B<gethostbyname(3)>. La diferencia entre B<gethostname(2)> y B<gethostbyname(3)> reside en que B<gethostbyname(5)> reconoce la red comprobando I</etc/nsswitch.conf> y I</etc/host.conf> para saber si tiene que leer información en I</etc/hostname> o en I</etc/hosts>

source: The host name is usually set once at system startup (normally by reading the contents of a file which contains the host name, e.g. I</etc/hostname>).
de: Der Hostname wird üblicherweise einmal beim Systemstart gesetzt (normalerweise durch Lesen einer Datei, die den Hostnamen enthält, z.B. I</etc/hostname>).
es: El nombre del equipo suele definirse una única vez durante el inicio del sistema, generalmente a través de un archivo que lo contenga (por ejemplo I</etc/hostname>).

source: The function B<gethostname(2)> is used to get the hostname. When the B<hostname -a, -d, -f or -i> is called will B<gethostbyname(3)> be called. The difference in B<gethostname(2)> and B<gethostbyname(3)> is that B<gethostbyname(3)> is network aware, so it consults I</etc/nsswitch.conf> and I</etc/host.conf> to decide whether to read information in I</etc/hostname> or I</etc/hosts>
de: Die Funktion B<gethostname>(2) wird zum Erhalten des Hostnames verwandt\&. Beim Aufruf von B<hostname -a, -d, -f oder -i> wird B<gethostbyname>(3) aufgerufen. Der Unterscheid zwischen B<gethostname>(2) und B<gethostbyname>(3) liegt darin, dass B<gethostbyname>(3) Netzwerk-bewusst ist und daher I</etc/nsswitch.conf> und I</etc/host.conf> berücksichtigt, um zu entscheiden, ob die Informationen in I</etc/hostname> oder I</etc/hosts> gelesen werden soll.
es: La función B<gethostname(2)> se emplea para obtener el nombre del equipo. Cada vez que se ejecuta B<hostname -a, -d, -f o -i>,se invoca B<gethostbyname(3)>. La diferencia entre B<gethostname(2)> y B<gethostbyname(3)> reside en que B<gethostbyname(5)> reconoce la red comprobando I</etc/nsswitch.conf> y I</etc/host.conf> para saber si tiene que leer información en I</etc/hostname> o en I</etc/hosts>

source: B<domainname> will print the NIS domainname of the system. B<domainname> uses the B<gethostname>(2) function, while B<ypdomainname> and B<nisdomainname> use the B<yp_get_default_domain>(3).
de: B<domainname> wird den NIS-Domain-Namen des Systems ausgeben. B<domainname> benutzt die Funktion B<gethostname>(2), während B<ypdomainname> und B<nisdomainname> B<yp_get_default_domain>(3) benutzen.
es: B<domainname> muestra el nombre de dominio NIS del sistema empleando la función B<gethostname>(2), mientras que B<ypdomainname> y B<nisdomainname> utilizan B<yp_get_default_domain>(3).

source: When called with one argument or with the B<--file> option, the commands set the host name or the NIS/YP domain name. B<hostname> uses the B<sethostname>(2) function, while all of the three B<domainname,> B<ypdomainname> and B<nisdomainname> use B<setdomainname>(2). Note, that this is effective only until the next reboot. Edit /etc/hostname for permanent change.
de: Wenn der Befehl ohne Argument oder mit der Option B<--file> aufgerufen wird, setzt er den Hostnamen oder den NIS-/YP-Domain-Namen. B<hostname> benutzt die Funktion B<sethostname>(2), während B<domainname>, B<ypdomainname> und B<nisdomainname> B<setdomainname>(2) benutzen. Beachten Sie, dass dies effektiv nur bis zum nächsten Neustart der Fall ist. Bearbeiten Sie /etc/hostname, um es permanent zu ändern.
es: Cuando se ejecuta con un argumento o con la opción B<--file>, la orden define el nombre del equipo o el nombre de dominio NIS/YP. B<hostname> emplea la función B<sethostname>(2) mientras que las otras tres: B<domainname,> B<ypdomainname> y B<nisdomainname> utilizan B<setdomainname>(2).

source: Always set a hostname; this allows the file specified by I<-F> to be non-existant or empty, in which case the default hostname I<localhost> will be used if none is yet set.
de: setzt immer einen Hostnamen; dies erlaubt, dass die per I<-F> angegebene Datei nicht existiert oder leer ist. In diesem Fall wird der vorgegebene Hostname I<localhost> benutzt, falls noch keiner gesetzt ist.
es: Define siempre un nombre de equipo; Así se permite que el archivo definido por la opción I<-F> esté vacío o ni siquiera exista, en cuyo case se usará I<localhost> por defecto siempre que no se haya definido otro.

source: -?, B<--help>
de: B<-?>, B<--help>
