Repository: sebras/manpages-l10n
Catalog: po/*/man1/hostname.1.po
Languages: de, es

source: September 2021
es: Septiembre de 2021

source: User Commands
de: Dienstprogramme für Benutzer
es: Órdenes de usuario

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: hostname - show or set system host name
de: hostname - zeigt den Hostnamen des Systems an oder setzt ihn
es: hostname - muestra o define el nombre de un equipo

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: B<hostname> [I<\,OPTION\/>...] [I<\,NAME\/>]
es: B<hostname> [I<\,OPCIÓN\/>...] [I<\,NOMBRE\/>]

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: Show or set the system's host name.
de: zeigt den Hostnamen des Systems an oder setzt ihn.
es: Muestra o define el nombre de un equipo.

source: alias names
de: Alias-Namen
es: sobrenombres asignados a los equipos

source: DNS domain name
es: Nombre de dominio DNS

source: DNS host name or FQDN
de: DNS-Hostname oder FQDN
es: Nombre de dominio DNS o FQDN

source: B<-F>, B<--file>=I<\,FILE\/>
de: B<-F>, B<--file>=I<\,DATEI\/>
es: B<-F>, B<--file>=I<\,ARCHIVO\/>

source: set host name or NIS domain name from FILE
de: setzt den Hostnamen oder NIS-Domainnamen aus DATEI.
es: define el nombre del equipo o el NIS a partir de ARCHIVO

source: addresses for the host name
de: Adressen für den Hostnamen.
es: direcciones para el nombre del equipo

source: short host name
de: Kurzer Hostname
es: nombre breve del equipo

source: NIS/YP domain name
es: Nombre dedominio NIS/YP

source: give this help list
de: gibt eine kurze Hilfe aus.
es: da esta lista de ayuda

source: give a short usage message
de: gibt eine kurze Meldung zur Verwendung aus.
es: da un mensaje de uso corto

source: print program version
de: gibt die Programmversion aus.
es: muestra la versión del programa

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
de: Erforderliche oder optionale Argumente für lange Optionen sind ebenso erforderlich bzw. optional für die entsprechenden Kurzoptionen.
es: Los argumentos obligatorios u opcionales para las opciones largas son también obligatorios u opcionales para las opciones cortas correspondientes.

source: AUTHOR
de: AUTOR
es: AUTOR

source: Written by Debarshi Ray.
de: Geschrieben von Debarshi Ray.
es: Escrito por Debarshi Ray.

source: REPORTING BUGS
de: FEHLER MELDEN
es: INFORMAR DE ERRORES

source: Report bugs to E<lt>bug-inetutils@gnu.orgE<gt>.
de: Melden Sie Fehler (auf Englisch) an E<lt>bug-inetutils@gnu.orgE<gt>.
es: Informe de cualquier fallo a E<lt>bug-inetutils@gnu.orgE<gt>.

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2021 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: The full documentation for B<hostname> is maintained as a Texinfo manual. If the B<info> and B<hostname> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<hostname> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<hostname> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl
es: La documentación completa de B<hostname> se mantiene como manual Texinfo. Si los programas B<info> y B<hostname> están adecuadamente instalados en su sistema, la orden

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
es: debería acceder al manual completo.

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: hostname - show or set the system's host name
de: hostname - zeigt den Hostnamen des Systems an oder setzt ihn
es: hostname - define o simplemente muestra el nombre de un equipo

source: domainname - show or set the system's NIS/YP domain name
de: domainname - zeigt den NIS-/YP-Domain-Namen des Systems an oder setzt ihn
es: domainname - define o simplemente muestra el nombre NIS/YP de un equipo

source: ypdomainname - show or set the system's NIS/YP domain name
de: ypdomainname - zeigt den NIS-/YP-Domain-Namen des Systems an oder setzt ihn
es: ypdomainname - define o simplemente muestra el nombre NIS/YP de un equipo

source: nisdomainname - show or set the system's NIS/YP domain name
de: nisdomainname - zeigt den NIS-/YP-Domain-Namen des Systems an oder setzt ihn
es: nisdomainname - define o simplemente muestra el nombre NIS/YP de un equipo

source: dnsdomainname - show the system's DNS domain name
de: dnsdomainname - zeigt den DNS-Domain-Namen des Systems an
es: dnsdomainname - muestra el nombre DNS de un equipo

source: B<hostname> [B<-b|--boot>] [B<-F|--file\ filename>] [B<hostname>]
de: B<hostname> [B<-b|--boot>] [B<-F|--file\ Dateiname>] [B<Hostname>]
es: B<hostname> [B<-b|--boot>] [B<-F|--archivos\ nombre de archivo>] [B<hostname>]

source: B<domainname> [B<nisdomain>] [B<-F\ file>]
de: B<domainname> [B<NISDOMAIN>] [B<-F\ DATEI>]
es: B<domainname> [B<nisdomain>] [B<-F\ archivo>]

source: B<ypdomainname> [B<nisdomain>] [B<-F\ file>]
de: B<ypdomainname> [B<NISDOMAIN>] [B<-F\ DATEI>]
es: B<ypdomainname> [B<nisdomain>] [B<-F\ archivo>]

source: B<nisdomainname> [B<nisdomain>] [B<-F\ file>]
de: B<nisdomainname> [B<NISDOMAIN>] [B<-F\ DATEI>]
es: B<nisdomainname> [B<nisdomain>] [B<-F\ archivo>]

source: B<Hostname> is used to display the system's DNS name, and to display or set its hostname or NIS domain name.
de: B<hostname> wird benutzt, um den DNS-Namen des Systems anzuzeigen und um seinen Host- oder NDIS-Domain-Namen anzuzeigen oder zu setzen.
es: B<Hostname> suele emplearse para mostrar el nombre DNS del equipo y para mostrar o definir su nombre o nombre de dominio NIS.

source: GET NAME
de: NAMEN ABFRAGEN
es: MOSTRAR NOMBRE

source: When called without any arguments, the program displays the current names:
de: Wenn das Programm ohne irgendwelche Argumente aufgerufen wird, zeigt es die aktuellen Namen an:
es: Cuando se ejecuta sin argumentos, ocurrirá lo siguiente:

source: B<hostname> will print the name of the system as returned by the B<gethostname>(2) function.
de: B<hostname> wird den Namen des Systems so ausgeben, wie er von der Funktion B<gethostname>(2) zurückgegeben wird.
es: B<hostname> muestra el nombre del equipo tal como lo recibe de la función B<gethostname>(2).

source: B<domainname> will print the NIS domainname of the system. B<domainname> uses the B<gethostname>(2) function, while B<ypdomainname> and B<nisdomainname> use the B<getdomainname>(2).
de: B<domainname> wird den NIS-Domain-Namen des Systems ausgeben. B<domainname> benutzt die Funktion B<gethostname>(2), während B<ypdomainname> und B<nisdomainname> B<getdomainname>(2) benutzen.
es: B<domainname> muestra el nombre de dominio NIS del equipo. B<domainname> emplea la función B<gethostname>(2). En cambio, B<ypdomainname> y B<nisdomainname> emplean B<getdomainname>(2).

source: B<dnsdomainname> will print the domain part of the FQDN (Fully Qualified Domain Name). The complete FQDN of the system is returned with B<hostname --fqdn> (but see the warnings in section B<THE FQDN> below).
de: B<dnsdomainname> wird den Domain-Teil des FQDN (Fully Qualified Domain Name/vollständiger Name einer Domain) ausgeben. Der komplette FQDN des Systems wird von B<hostname --fqdn> zurückgegeben (beachten Sie aber die Warnungen im folgenden Abschnitt B<DER FQDN>.
es: B<dnsdomainname> mostrará la parte correspondiente al dominio del FQDN. El FQDN del equipo se obtiene mediante B<hostname --fqdn> (no obstante, consulte las advertencias en la sección B<El FQDN> a continuación).

source: SET NAME
de: NAMEN SETZEN
es: DEFINE NOMBRE

source: When called with one argument or with the B<--file> option, the commands set the host name or the NIS/YP domain name. B<hostname> uses the B<sethostname>(2) function, while all of the three B<domainname>, B<ypdomainname> and B<nisdomainname> use B<setdomainname>(2). Note, that this is effective only until the next reboot. Edit /etc/hostname for permanent change.
de: Wenn der Befehl ohne Argument oder mit der Option B<--file> aufgerufen wird, setzt er den Hostnamen oder den NIS-/YP-Domain-Namen. B<hostname> benutzt die Funktion B<sethostname>(2), während B<domainname>, B<ypdomainname> und B<nisdomainname> B<setdomainname>(2) benutzen. Beachten Sie, dass dies effektiv nur bis zum nächsten Neustart der Fall ist. Bearbeiten Sie /etc/hostname, um es permanent zu ändern.
es: Cuando se ejecuta con un solo argumento o con la opción B<--file> , éstas órdenes definirán el nombre del equipo o el nombre de dominio NIS/YP. B<hostname> emplea para ello la función B<sethostname>(2), mientras que las otras 3: B<domainname>, B<ypdomainname> and B<nisdomainname> lo hacen mediante B<setdomainname>(2). Observe que estos cambios se guardan solo hasta el siguiente reinicio, para que sea definitivos es necesario editar el archivo /etc/hostname.

source: Note, that only the super-user can change the names.
de: Beachten Sie, dass die Namen nur vom Super-User geändert werden können.
es: Observe que solo el administrador puede cambiar los nombres.

source: It is not possible to set the FQDN or the DNS domain name with the B<dnsdomainname> command (see B<THE FQDN> below).
de: Es ist nicht möglich den FQDN oder DNS-Namen mit dem Befehl B<dnsdomainname> zu setzen (lesen Sie im Folgenden B<DER FQDN>).
es: No es posible definir el FQDN ni el nombre de dominio DNS con la orden B<dnsdomainname> (consulte B<EL FQDN> a continuación).

source: The host name is usually set once at system startup in I</etc/init.d/hostname.sh> (normally by reading the contents of a file which contains the host name, e.g. I</etc/hostname>).
de: Der Hostname wird üblicherweise einmal beim Systemstart in I</etc/init.d/hostname.sh> gesetzt (normalerweise durch Lesen einer Datei, die den Hostnamen enthält, z.B. I</etc/hostname>).
es: El nombre del equipo suele definirse durante el inicio del sisteama en I</etc/init.d/hostname.sh>. Generalmente se hace mediante la lectura de un archivo que contenga esta información como suele ser I</etc/hostname>.

source: THE FQDN
de: DER FQDN
es: EL FQDN

source: The FQDN (Fully Qualified Domain Name) of the system is the name that the B<resolver>(3) returns for the host name, such as, I<ursula.example.com>. It is usually the hostname followed by the DNS domain name (the part after the first dot). You can check the FQDN using B<hostname --fqdn> or the domain name using B<dnsdomainname>.
de: Der FQDN (vollqualifizierter Domain-Name) des Systems ist der Name, den der B<resolver>(3) für den Hostnamen zurückgibt, wie I<ursula.example.com>. Es ist üblicherweise der Hostname gefolgt vom DNS-Domain-Namen (dem Teil nach dem ersten Punkt). Sie können den FQDN mittels B<hostname --fqdn> oder den Domain-Namen mittels B<dnsdomainname> überprüfen.
es: El FQDN (siglas en inglés de nombre de dominio completamente cualificado) de un equipo es el nombre que muestra B<resolver>(3), por ejemplo I<ursula.example.com>. Suele ser el nombre del equipo seguido del nombre dominio DNS (la parte después del primer punto). Puede ver el FQDN mediante B<hostname --fqdn> o solo la parte del dominio con B<dnsdomainname>.

source: You cannot change the FQDN with B<hostname> or B<dnsdomainname>.
de: Sie können den FQDN nicht mit B<hostname> oder B<dnsdomainname> ändern.
es: No es posible modificar el FQDN con B<hostname> ni con B<dnsdomainname>.

source: The recommended method of setting the FQDN is to make the hostname be an alias for the fully qualified name using I</etc/hosts>, DNS, or NIS. For example, if the hostname was "ursula", one might have a line in I</etc/hosts> which reads
de: Die empfohlene Methode, den FQDN zu setzen, besteht darin, mittels I</etc/hosts>, DNS oder NIS den Hostnamen als Alias für den vollqualifizierten Namen zu setzen. Falls der Hostname zum Beispiel »ursula« war, könnten Sie eine Zeile wie die folgende in I</etc/hosts> haben:
es: El método más adecuado para definir el FQDN consiste en hacer que el nombre del equipo sea un alias del mismo ya sea a través de I</etc/hosts>, DNS o NIS. Por ejemplo si el nombre del equipo es "ursula", tendríamos esta línea en I</etc/hosts>:

source: Technically: The FQDN is the name B<getaddrinfo>(3) returns for the host name returned by B<gethostname>(2). The DNS domain name is the part after the first dot.
de: Technisch: Der FQDN ist der Name, den B<getaddrinfo>(3) für den Hostnamen zurückgibt, der von B<gethostname>(2) zurückgegeben wurde. Der DNS-Domain-Name ist der Teil nach dem ersten Punkt.
es: Tecnícamente: el FQDN es el nombre que daría B<getaddrinfo>(3) para el nombre de equipo dado por B<gethostname>(2). El nombre de dominio DNS es la parte que está después del primer punto.

source: Therefore it depends on the configuration of the resolver (usually in I</etc/host.conf>) how you can change it. Usually the hosts file is parsed before DNS or NIS, so it is most common to change the FQDN in I</etc/hosts>.
de: Daher hängt es von der Konfiguration des Resolvers (üblicherweise in I</etc/host.conf>) ab, wie Sie ihn ändern können. Normalerweise wird die Datei »hosts« vor DNS oder NIS ausgewertet, weswegen der FQDN meist in I</etc/hosts> geändert werden kann.
es: Esto hace que dependa de la configuración de resolver (generalmente en I</etc/host.conf>) el modo de modificarlo. El archivo hosts suele leerse antes de DNS o de NIS por lo que es habitual modificarlo en I</etc/hosts>.

source: If a machine has multiple network interfaces/addresses or is used in a mobile environment, then it may either have multiple FQDNs/domain names or none at all. Therefore avoid using B<hostname --fqdn>, B<hostname --domain> and B<dnsdomainname>. B<hostname --ip-address> is subject to the same limitations so it should be avoided as well.
de: Wenn eine Maschine mehrere Netzwerkschnittstellen/-adressen hat oder in einer mobilen Umgebung benutzt wird, dann kann sie entweder mehrere FQDN/Domain-Namen oder nichts von alledem haben. Vermeiden Sie es daher B<hostname --fqdn>, B<hostname --domain> und B<dnsdomainname> zu benutzen. B<hostname --ip-address> unterliegt den gleichen Einschränkungen und sollte deshalb auch vermieden werden.
es: Si un equipo tiene diversas interfaces de red/direcciones o se usa en distintas redes, puede tener varios FQDN/dominios o incluso no tiener ninguno. En estos casos, se recomienda evitar el uso de B<hostname --fqdn>, B<hostname --domain> y B<dnsdomainname>. Como B<hostname --ip-address> también sufre las mismas limitaciones, tampoco se recomienda su uso.

source: OPTIONS
de: OPTIONEN
es: OPCIONES

source: Display the alias name of the host (if used). This option is deprecated and should not be used anymore.
de: zeigt den Alias-Namen des Hosts (falls benutzt). Diese Option wird missbilligt und sollte nicht mehr benutzt werden.
es: Muestra el sobrenombre dado al equipo (si lo tuviese). Esta opción está obsoleta y no se recomienda su uso.

source: Displays all FQDNs of the machine. This option enumerates all configured network addresses on all configured network interfaces, and translates them to DNS domain names. Addresses that cannot be translated (i.e. because they do not have an appropriate reverse IP entry) are skipped. Note that different addresses may resolve to the same name, therefore the output may contain duplicate entries. Do not make any assumptions about the order of the output.
de: zeigt alle FQDNs der Maschine. Diese Option zählt alle konfigurierten Netzwerkadressen auf allen konfigurierten Netzwerkschnittstellen auf und übersetzt sie in DNS-Domain-Namen. Adressen, die nicht übersetzt werden können (d.h. weil sie keinen geeigneten umgekehrten IP-Eintrag haben) werden übersprungen. Beachten Sie, dass unterschiedliche Adressen auf den gleichen Namen aufgelöst werden können und daher die Ausgabe einen Eintrag mehrfach enthalten kann. Treffen Sie keine Annahmen über die Reihenfolge der Ausgabe.
es: Muestra todos los FQDN del equipo. Con esta opción se enumeran todas lasdirecciones de red de todas las interfaces configuradas, en forma de dominios DNS. Se saltan las direcciones que no se puedan traduccir (por ejemplo si esa IP no tiene un nombre asociado). Observe que distintas direcciones pueden estar asociadas al mismo nombre de dominio, por lo tanto la salida podrá contener entradas duplicadas. Tampoco saque ninguna conclusión acerca del orden en que aparezcan.

source: Always set a hostname; this allows the file specified by I<-F> to be non-existent or empty, in which case the default hostname I<localhost> will be used if none is yet set.
de: setzt immer einen Hostnamen; dies erlaubt, dass die per I<-F> angegebene Datei nicht existiert oder leer ist. In diesem Fall wird der vorgegebene Hostname I<localhost> benutzt, falls noch keiner gesetzt ist.
es: Siempre define un nombre de equipo. Esto hace que el archivo definido mediante la opción I<-F> podrá no existir, en cuyo caso se usará por defecto I<localhost> siempre y cuando no se haya definido otro distinto por otra vía.

source: Display the name of the DNS domain. Don't use the command B<domainname> to get the DNS domain name because it will show the NIS domain name and not the DNS domain name. Use B<dnsdomainname> instead. See the warnings in section B<THE FQDN> above, and avoid using this option.
de: zeigt den Namen der DNS-Domain an. Benutzen Sie nicht den Befehl B<domainname>, um den DNS-Domain-Namen abzufragen, weil er den NIS-Domain-Namen und nicht den DNS-Domain-Namen anzeigen wird. Benutzen Sie stattdessen B<dnsdomainname>. Lesen Sie die Warnungen im Abschnitt B<DER FQDN> oben und vermeiden Sie es, diese Option zu benutzen.
es: Muestra el nombre de dominio DNS. No debe emplear B<domainname> para ver el nombre de dominio DNS, sino B<dnsdomainname>porque lo que obtendrá será el nombre NIS. Lea las advertencias en la sección B<FQDN> y evite el uso de esta opción.

source: Display the FQDN (Fully Qualified Domain Name). A FQDN consists of a short host name and the DNS domain name. Unless you are using bind or NIS for host lookups you can change the FQDN and the DNS domain name (which is part of the FQDN) in the I</etc/hosts> file. See the warnings in section B<THE FQDN> above und use B<hostname --all-fqdns> instead wherever possible.
de: zeigt den FQDN (Fully Qualified Domain Name/vollständiger Name einer Domain) an. Ein FQDN besteht aus einem kurzen Hostnamen und dem DNS-Domain-Namen. Sofern Sie nicht Bind oder NIS zum Abfragen von Hosts benutzen, können Sie den FQDN und DNS-Domain-Namen (der Teil des FQDN ist) in der Datei I</etc/hosts> ändern. Lesen Sie die Warnungen im Abschnitt B<DER FQDN> oben und benutzen Sie stattdessen B<hostname --all-fqdns>, wo dies möglich ist.
es: Muestra el FQDN, éste consiste en el nombre del equipo seguido del nombre de dominio. Salvo que use bind o NIS para la búsqueda de nombres, podrá cambiar el FQDN y el nombre de dominio DNS (que forma parte del FQDN) en el archivo I</etc/hosts>. Consulte las advertencias en la sección B<FQDN> y emplee B<hostname --all-fqdns> siempre que sea posible.

source: I<-F, --file filename>
de: I<-F, --file DATEINAME>
es: I<-F, --file nombrefichero>

source: Read the host name from the specified file. Comments (lines starting with a `#') are ignored.
de: liest den Hostnamen aus der angegebenen Datei. Kommentare (Zeilen die mit # beginnen) werden ignoriert.
es: Lee el nombre del equipo desde un archivo dado. Los comentarios (líneas que comienzan con "#"), si los tuviese, se ignoran.

source: Display the network address(es) of the host name. Note that this works only if the host name can be resolved. Avoid using this option; use B<hostname --all-ip-addresses> instead.
de: zeigt die Netzwerkadresse(n) des Hostnamens. Beachten Sie, dass dies nur funktioniert, wenn der Hostname aufgelöst werden kann. Vermeiden Sie es, diese Option zu benutzen; benutzen Sie stattdessen B<hostname --all-ip-addresses>.
es: Muestra la dirección (o dorecciones) de red del nombre de equipo. Observe que esto solo funcionará si es posible resolver dicho nombre. Evite el uso de esta opción, en su lugar emplee B<hostname --all-ip-addresses>.

source: Display all network addresses of the host. This option enumerates all configured addresses on all network interfaces. The loopback interface and IPv6 link-local addresses are omitted. Contrary to option I<-i>, this option does not depend on name resolution. Do not make any assumptions about the order of the output.
de: zeigt alle Netzwerkadressen des Hosts. Diese Option zählt alle konfigurierten Adressen auf allen Netzwerkschnittstellen auf. Die Loopback-Schnittstelle und IPv6-link-lokale Adressen werden ausgelassen. Im Gegensatz zur Option I<-i> hängt diese Option nicht von der Namensauflösung ab. Treffen Sie keine Annahmen über die Reihenfolge der Ausgabe.
es: Muestra todas las direcciones de red del equipo, es decir todas las direcciones configuradas en todas las interfaces de red. Se omitirán la interfaz de loopback y direcciones locales en IPv6. Contrariamente a la opción I<-i>, ésta no depende de la resolución de nombres. No se debería asumir que la salida tendrá un orden concreto.

source: Display the short host name. This is the host name cut at the first dot.
de: gibt den Kurznamen des Hosts an. Dies ist der Hostname, der am ersten Punkt abgeschnitten wurde.
es: Muestra el nombre corto del equipo, es decir el nombre del equipo hasta el primer punto.

source: Print version information on standard output and exit successfully.
de: gibt Versionsinformation auf der Standardausgabe aus und beendet sich erfolgreich.
es: Imprime información sobre la versión en la salida estándar y termina correctamente.

source: Display the NIS domain name. If a parameter is given (or B<--file name> ) then root can also set a new NIS domain.
de: zeigt den NIS-Domain-Namen an. Falls ein Parameter angegeben wurde (oder B<--file name>), dann kann auch Root einen neuen NIS-Domain-Namen setzen.
es: Muestra el nombre de dominio NIS. Si se aporta un parámetro (o B<--file name>), el administrador también puede definir un nuevo dominio NIS.

source: Print a usage message and exit.
de: gibt eine Nachricht über den Aufruf aus und beendet sich.
es: Muestra un mensaje en la salida estándar y finaliza.

source: NOTES
de: ANMERKUNGEN
es: NOTAS

source: The address families B<hostname> tries when looking up the FQDN, aliases and network addresses of the host are determined by the configuration of your resolver. For instance, on GNU Libc systems, the resolver can be instructed to try IPv6 lookups first by using the B<inet6> option in B</etc/resolv.conf>.
de: Die B<hostname>-Adressfamilien versuchen beim Abfragen des FQDN, der Aliase und der Netzwerkadressen des Hosts, ob diese durch die Konfiguration des Resolvers festgelegt werden. Auf GNU-Libc-Systemen kann der Resolver zum Beispiel angewiesen werden zuerst IPv6 nachzuschlagen, indem die Option B<inet6> in B</etc/resolv> benutzt wird.
es: Las familias de direcciones que B<hostname> prueba cuando busca el FQDN, los alias y las direcciones de red vienen determinadas por la configuración de resolver. Por ejemplo: en equipos con GNU Libc, es posible configurar resolver para que intente buscar primero IPv6 mediante la opción B<inet6> en B</etc/resolv.conf>.
