Repository: sebras/manpages-l10n
Catalog: po/*/man1/intro.1.po
Languages: es, it, nl, pt_br, uk

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: NAME
es: NOMBRE
it: NOME
nl: NAAM
pt_br: NOME
uk: НАЗВА

source: intro - introduction to user commands
es: intro - introducción a órdenes de usuario
it: intro - Introduzione ai comandi utente
nl: intro - inleiding voor gebruiker commando´s
pt_br: intro - Introdução para os comandos de usuários
uk: intro — вступ до команд користувача

source: DESCRIPTION
es: DESCRIPCIÓN
it: DESCRIZIONE
nl: BESCHRIJVING
pt_br: DESCRIÇÃO
uk: ОПИС

source: Section 1 of the manual describes user commands and tools, for example, file manipulation tools, shells, compilers, web browsers, file and image viewers and editors, and so on.
es: La sección 1 de este manual describe órdenes y herramientas para usuarios. Por ejemplo: para manipular archivos, shells, compiladores, navegadores web, visores de imágenes, editors de texto y similares.
it: La sezione 1 del manuale descrive i comandi e gli strumenti per l'utente, per esempio gli strumenti per manipolare i file, le shell, i compilatori, i browser web, i visualizzatori e gli editor di file e di immagini, e così via.
nl: Sectie 1 van deze handleiding beschrijft de gebruiker commando´s en hulpmiddelen, bij voorbeeld, hulpmiddelen om bestanden te bewerken, shells, compilers, web browsers, bestand en beeld weergave, tekstverwerker, enzovoort.
pt_br: A seção 1 do manual descreve comandos e ferramentas do usuário, por exemplo, ferramentas de manipulação de arquivos, shells, compiladores, navegadores da web, visualizadores e editores de arquivos e imagens, e assim por diante.
uk: У розділі 1 підручника наведено описи команд та інструментів користувача, наприклад, засобів для роботи з файлами, командних оболонок, компіляторів, програм для перегляду інтернету, файлів, зображень, редакторів тощо.

source: NOTES
es: NOTAS
it: NOTE
nl: OPMERKINGEN
pt_br: NOTAS
uk: ПРИМІТКИ

source: Linux is a flavor of UNIX, and as a first approximation all user commands under UNIX work precisely the same under Linux (and FreeBSD and lots of other UNIX-like systems).
es: Linux es un tipo de UNIX y, en principio, todos las órdenes de usuario funcionan exactamente igual en UNIX que en Linux (también lo hacen en FreeBDS y muchas otras variantes de UNIX).
it: Linux è una variante di Unix, e come prima approssimazione tutti i comandi utente sotto Unix lavorano esattamente nello stesso modo sotto Linux (e FreeBSD e molti altri sistemi tipo Unix).
nl: Linux is een variant van UNIX, praktisch alle gebruiker commando´s onder UNIX werken exact hetzelfde onder Linux (en FreeBSD en een veel andere UNIX-achtige systemen)
pt_br: O Linux é uma versão do UNIX e, como primeira aproximação, todos os comandos do usuário no UNIX funcionam exatamente da mesma maneira no Linux (e no FreeBSD e em muitos outros sistemas semelhantes ao UNIX).
uk: Linux є різновидом UNIX, і, з певною точністю, усі команди користувача у UNIX працюють так само і у Linux (а також FreeBSD та багатьох інших UNIX-подібних системах).

source: Under Linux, there are GUIs (graphical user interfaces), where you can point and click and drag, and hopefully get work done without first reading lots of documentation. The traditional UNIX environment is a CLI (command line interface), where you type commands to tell the computer what to do. That is faster and more powerful, but requires finding out what the commands are. Below a bare minimum, to get started.
es: En Linux existen diversas GUI (interfaces gráficas) donde puede trabajar en modo gráfico y, seguramente, hacer su trabajo sin necesidad de leer un buen montón de documentos antes de empezar. El tradicional entorno de trabajo de UNIX es CLI (modo texto), donde tiene que teclear órdenes para indicarle a la máquina lo que quiere hacer. Esto último es más rápido y eficaz pero requiere indagar acerca de esas órdenes que va a necesitar. A continuación se explica lo mínimo para empezar.
it: Sotto Linux ci sono GUI (interfacce grafiche utente), in cui si può puntare, cliccare e trascinare, e, si spera, completare il lavoro senza leggere prima tonnellate di documentazione. L'ambiente Unix tradizionale è una CLI (interfaccia a linea di comando), in cui si digitano comandi per dire al computer cosa fare. Ciò è più rapido e più potente, ma è necessario scoprire quali siano i comandi. Di seguito il minimo essenziale per partire.
nl: Onder Linux, bestaan er GUI´s (Grafische Gebruikersinterface), waar je kunt aanwijzen, klikken en slepen en je hopelijk werk kunt verzetten zonder eerst veel documentatie te moeten lezen. De traditionele UNIX omgeving is een CLI (commando interface), waar je commando´s moet intikken om de computer opdrachten te geven. Dat is sneller en krachtiger, maar vereist wél dat je moet weten welke commando´s er bestaan. Hieronder staat een minimale hoeveelheid, om je aan de gang te helpen.
pt_br: No Linux, existem GUIs (interfaces gráficas do usuário), nas quais você pode apontar, clicar e arrastar e, esperançosamente, realizar o trabalho sem primeiro ler muita documentação. O ambiente UNIX tradicional é uma CLI (interface da linha de comandos), na qual você digita comandos para informar ao computador o que fazer. Isso é mais rápido e mais poderoso, mas requer descobrir quais são os comandos. Abaixo de um mínimo, para começar.
uk: У Linux є графічні середовища, де ви можете позначати об'єкти, клацати, перетягувати і досягати результатів без читання значного обсягу документації. Традиційним же середовищем UNIX є інтерфейс командного рядка, у якому ви вводите команди, щоб повідомити комп'ютеру, що слід робити. Цей інтерфейс є швидшим та потужнішим, але потребує знання команд. Нижче наведено мінімальний початковий набір відомостей та команд.

source: Login
es: Inicio
uk: Вхід до системи

source: In order to start working, you probably first have to open a session by giving your username and password. The program B<login>(1) now starts a I<shell> (command interpreter) for you. In case of a graphical login, you get a screen with menus or icons and a mouse click will start a shell in a window. See also B<xterm>(1).
es: Para empezar a trabajar, seguramente necesite iniciar una sesión con su nombre de usuario y contraseña. La aplicación B<login>(1) le iniciará una shell (el intérprete de órdenes). Si está en un entorno gráfico, verá una pantalla con menús o iconos y podrá iniciar una shell haciendo click en una ventana. Vea también B<xterm>(1).
it: Per iniziare a lavorare probabilmente bisognerà prima aprire una sessione dando il nome utente e la password. Il programma B<login>(1) avvia ora una I<shell> (interprete dei comandi) per l'utente. In caso di login grafico si accede a uno schermo con menù o icone e un click del mouse avvierà una shell in una finestra. Vedere anche B<xterm>(1).
nl: Om te kunnen werken, moet je hoogstwaarschijnlijk een sessie openen door een gebruikersnaam en wachtwoord in te geven. Het programma B<login>(1) start nu een I<shell> (commando vertaler). In het geval van een grafische login, krijg je een scherm met menu´s of iconen waarna met een klik van de muis een shell in een venster zal starten. Zie ook B<xterm>(1).
pt_br: Para começar a trabalhar, você provavelmente precisará primeiro abrir uma sessão, fornecendo seu nome de usuário e senha. O programa B<login>(1) agora inicia um I<shell> (interpretador de comandos) para você. No caso de um login gráfico, você obtém uma tela com menus ou ícones e um clique do mouse inicia um shell em uma janela. Veja também B<xterm>(1).
uk: Щоб розпочати роботу, вам, ймовірно, спершу слід відкрити сеанс, вказавши ваше ім'я користувача та пароль. Програма B<login>(1) запускає для вас I<командну оболонку> (інтерпретатор команд). Якщо ви скористаєтеся графічною оболонкою для входу до системи, ви побачите екран з меню або піктограмами, а оболонку у вікні можна буде запустити простим клацанням кнопкою миші. Див. також B<xterm>(1).

source: The shell
es: La shell
it: La shell
nl: De shell
pt_br: O shell
uk: Оболонка

source: One types commands to the I<shell>, the command interpreter. It is not built-in, but is just a program and you can change your shell. Everybody has their own favorite one. The standard one is called I<sh>. See also B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
es: Los usuarios y administradores teclean órdenes en una I<shell>: el intérprete de esas órdenes. No es algo intrínseco del sistema, sino que puede elegir la que desee. Vea también B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
it: I comandi si digitano nella I<shell>, l'interprete dei comandi. La shell non è incorporata nel sistema, è solo un programma, e l'utente può cambiare la propria shell. Ciascuno ha la sua favorita. Quella standard si chiama I<sh>. Vedere anche B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
nl: Commando´s geef je in in de I<shell>, de commando vertaler. Die is niet ingebouwd, maar is slechts een programma dat je ook kunt veranderen. Iedereen heeft zijn eigen favoriet. De standaard shell wordt I<sh> genoemd. Zie ook B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
pt_br: Digita-se comandos no I<shell>, o interpretador de comandos. Ele não está embutido, mas é apenas um programa e você pode alterar seu shell. Todo mundo tem seu próprio favorito. O padrão é chamado I<sh>. Veja também B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
uk: Команди слід вводити у I<оболонці>, інтерпретаторі команд. Оболонка не є вбудованою до системи, — це лише програма, ви можете змінити оболонку. У кожного є своя улюблена оболонка. Стандартна оболонка має назву I<sh>. Див. також B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).

source: A session might go like:
es: Una sesión podría transcurrir de este modo:
it: Una sessione può essere così:
nl: Een typische sessie is:
pt_br: Uma sessão pode ser algo como:
uk: Сеанс може відбуватися таким чином:

source: Here typing Control-D ended the session.
es: Tecleando Ctrl-D se finaliza la sesión.
it: A questo punto digitando Control-D si termina la sessione.
nl: Het ingeven van Control-D beëindigde de sessie.
pt_br: Aqui, digitar Control-D encerrou a sessão.
uk: Тут натискання Ctrl-D завершує сеанс.

source: The B<$> here was the command prompt\(emit is the shell's way of indicating that it is ready for the next command. The prompt can be customized in lots of ways, and one might include stuff like username, machine name, current directory, time, and so on. An assignment PS1="What next, master? " would change the prompt as indicated.
es: El signo B<$> es un símbolo del sistema\(emes la forma en que la consola nos indica que está lista para ejecutar la siguiente orden. Este símbolo puede personalizarse en muchos aspectos tales como incluir el nombre de usuario, el las sistema, el directorio actual, la hora, etc.... Asignando PS1="¿Qué hacemos ahora, jefe?" hará que este símbolo se cambie por esta frase.
it: Il carattere B<$> in questo caso è il prompt dei comandi \(cioè il modo della shell di indicare che è pronta per il prossimo comando). Il prompt può essere personalizzato in moltissimi modi, includendo cose come nome utente, nome macchina, directory attuale, ora, ecc. Un'assegnazione PS1="Cosa faccio ora, capo? " cambierebbe il prompt come indicato.
nl: De B<$> is de commando prompt\(emhet is dé manier van de shell om aan te geven dat hij wacht op een volgend commando. De prompt kan op verschillende manieren worden aangepast, zoals bijvoorbeeld het opnemen van gebruikersnaam, computer naam, huidige map, tijd, etc. Het toekennen van PS1="En nu, meester?" zou de prompt zoals aangegeven veranderen.
pt_br: O B<$> aqui era o prompt de comando \(em é a maneira do shell indicar que está pronto para o próximo comando. O prompt pode ser personalizado de várias maneiras, e pode-se incluir itens como nome de usuário, nome da máquina, atual diretório, hora e assim por diante. Uma atribuição PS1="O que mais, mestre?" mudaria o prompt conforme indicado.
uk: B<$> тут позначає запит щодо команди\(emit — спосіб оболонки вказати, що вона готова до введення наступної команди. Запит щодо команди можна налаштувати, до нього можна включити дані щодо користувача, назви комп'ютера, поточного каталогу, часу тощо. Якщо скористатися встановленням значення PS1="What next, master? ", запит щодо команди буде змінено на відповідний.

source: We see that there are commands I<date> (that gives date and time), and I<cal> (that gives a calendar).
es: Como ve, existen órdenes que proporcionan la fecha y la hora (I<date>), incluso un calendario (I<cal>).
it: Vediamo che ci sono comandi I<date> (che fornisce data e ora), e I<cal> (che fornisce un calendario).
nl: We vinden commando´s zoals I<date> (dat geeft datum en tijd), en I<cal> (dat geeft de kalender).
pt_br: Vemos que existem comandos os I<date> (que fornece data e hora) e I<cal> (que fornece um calendário).
uk: Як можна було зауважити, є команди I<date> (повідомляє про дату і час) та I<cal> (показує календар).

source: The command I<ls> lists the contents of the current directory\(emit tells you what files you have. With a I<-l> option it gives a long listing, that includes the owner and size and date of the file, and the permissions people have for reading and/or changing the file. For example, the file "tel" here is 37 bytes long, owned by aeb and the owner can read and write it, others can only read it. Owner and permissions can be changed by the commands I<chown> and I<chmod>.
es: La orden I<ls> muestra el contenido del directorio actual \(emvamos, los archivos. Si usa la opción I<-l>, mostrará más información como el propietario, el tamaño y la fecha del archivo así como los permisos de acceso que tienen sobre ellos los distintos usuarios. En este ejemplo, el archivo "tel" ocupa 37 bytes, su propietario es aeb y éste puede leerlo y modificarlo, otros usuario también pueden leerlos. Tanto el propietario como los permisos se pueden modificar usando las I<chown> y I<chmod>.
it: Il comando I<ls> elenca i contenuti della directory attuale \(cioè elenca i file presenti). Con l'opzione I<-l> fornisce un elenco lungo, che include proprietario, dimensione e data del file, e i permessi degli utenti per modificare o cambiare il file. Per esempio il file "tel" è lungo 37 byte, il proprietario è aeb che può leggerlo e scriverlo, altri possono solo leggerlo. Proprietario e permessi possono essere cambiati dai comandi I<chown> e I<chmod>.
nl: Het command I<ls> geeft de inhoud van de huidige map\(emhet laat zien welke bestanden je hebt. Met een I<-l> optie verkrijg je een lange lijst, inclusief de eigenaar, grootte en datum van het bestand, en tevens de rechten die personen hebben om het bestand te lezen en/of te veranderen. Bijvoorbeeld, het bestand "tel" is 37 bytes lang, eigendom van aeb, die het kan lezen en schrijven, anderen kunnen het alleen lezen. Eigenaar en rechten kunnen veranderd worden met de commando's I<chown> en I<chmod>.
pt_br: O comando I<ls> lista o conteúdo do diretório atual \(em informa quais arquivos você possui. Com uma opção I<-l>, ele fornece uma lista longa, que inclui o dono, o tamanho e a data do arquivo, e as permissões que as pessoas têm para ler e/ou alterar o arquivo.Por exemplo, o arquivo "tel" aqui possui 37 bytes, de propriedade de aeb e o dono pode lê-lo e gravá-lo, outros podem apenas lê-lo. Dono e permissões podem ser alterados pelos comandos I<chown> e I<chmod>.
uk: Команда I<ls> виводить список вмісту поточного каталогу\(emit повідомляє вам про наявні файли. Із параметром I<-l> вона виводить довгий список, до якого включено дані щодо власника, розміру і дати файла, а також прав доступу, які користувачі мають для читання і/або внесення змін до файла. Наприклад, файл «tel» має розмір 37 байтів, його власником є aeb, і власник має право читати з файла дані і записувати дані до нього. Інші користувачі можуть лише читати дані. Власника і права доступу можна змінити за допомогою команд I<chown> і I<chmod>.

source: The command I<cat> will show the contents of a file. (The name is from "concatenate and print": all files given as parameters are concatenated and sent to "standard output" (see B<stdout>(3)), here the terminal screen.)
es: La orden I<cat> mostrará el contenido de una archivo (su nombre proviene del ingles "concatenate and print": todos los archivo que ponga como argumentos se concatenarán y el resultado saldrá por la "salida estándar" (lea B<stdout>(3)), en este caso por la ventana de la consola).
it: Il comando I<cat> visualizzerà il contenuto di un file. (Il nome viene da "concatenate and print": tutti i file indicati come parametri sono concatenati e inviati allo "standard output" (si veda B<stdout>(3)), che qui è il terminale video).
nl: Het commando I<cat> toont de inhoud van een bestand. (De naam is afkomstig van de "concateneer en print": alle bestanden mee gegeven als parameter worden geconcateneerd en verstuurd naar "standaard uitvoer" (zie B<stdout>(3)), Hier kom het scherm.)
pt_br: O comando I<cat> mostrará o conteúdo de um arquivo. (O nome vem de "concatenate and print": todos os arquivos fornecidos como parâmetros são concatenados e enviados para a "saída padrão" (consulte B<stdout>(3)), aqui na tela do terminal.)
uk: Команда I<cat> покаже вам вміст файла. (Назва походить від «concatenate and print»: усі файли, які передано як параметри, буде з'єднано і надіслано до «стандартного виведення» (див. B<stdout>(3)), у нашому прикладі — екрана термінала.)

source: The command I<cp> (from "copy") will copy a file.
es: La orden I<cp> (de "copia") copiará un archivo.
it: Il comando I<cp> (da "copy") copierà un file.
nl: Het commando I<cp> (van "copy") zal een bestand kopiëren.
pt_br: O comando I<cp> (de "copy") vai copiar um arquivo.
uk: Команда I<cp> (від «copy») скопіює файл.

source: The command I<mv> (from "move"), on the other hand, only renames it.
es: En cambio, la orden I<mv> le cambiará el nombre.
it: Il comando I<mv> (da "move"), d'altra parte, si limita a rinominarlo.
nl: Het commando I<mv> (van "move"), aan de andere kant, zal het alleen hernoemen.
pt_br: O comando I<mv> (de "move"), por outro lado, apenas o renomeia.
uk: З іншого боку, команда I<mv> (від «move») лише перейменує його.

source: The command I<diff> lists the differences between two files. Here there was no output because there were no differences.
es: La orden I<diff> muestra las diferencias entre dos archivos. Aquí no muestra nada porque no hay ninguna.
it: Il comando I<diff> elenca le differenze tra due file. In questo caso non c'è output perché non ci sono differenze.
nl: Het commando I<diff> toont de verschillen tussen twee bestanden. De uitvoer ontbrak hier want er waren geen verschillen.
pt_br: O comando I<diff> lista as diferenças entre dois arquivos. Aqui não houve saída porque não houve diferenças.
uk: Команда I<diff> показує список відмінностей між двома файлами. У нашому прикладі нічого не виведено, оскільки між файлами немає відмінностей.

source: The command I<rm> (from "remove") deletes the file, and be careful! it is gone. No wastepaper basket or anything. Deleted means lost.
es: La orden I<rm> (viene de "remove", "eliminar" en castellano) borra archivos. Tenga cuidado porque no existe ninguna "papelera de reciclaje" ni nada parecido, simplemente desaparecen.
it: Il comando I<rm> (da "remove") cancella il file, e si faccia attenzione: è andato. Nessun cestino per la carta straccia o altro. Cancellato significa perso.
nl: Het commando I<rm> (van "remove") wist een bestand, ben voorzichtig want weg is weg. Er is géén prullenbak of dergelijke. Gewist betekent écht weg.
pt_br: O comando I<rm> (de "remove") exclui o arquivo e tenha cuidado: já era! Não há lixeiras nem nada. Excluído significa perdido.
uk: Команда I<rm> (від «remove») вилучає файл. Будьте обережні! Файл буде втрачено. Немає ніякого кошика для вилучених файлів. «Вилучено» означає «втрачено».

source: The command I<grep> (from "g/re/p") finds occurrences of a string in one or more files. Here it finds Maja's telephone number.
es: La orden I<grep> (el nombre procede de las expresiones regulares "g/re/p") buscará coincidencias de una cadena de texto en uno o más archivos. En este ejemplo, encuentra el número de teléfono de Maja.
it: Il comando I<grep> (da "g/re/p") trova le ricorrenze di una stringa in uno o più file. In questo caso trova il numero di telefono di Maja.
nl: Het commando I<grep> (van "g/re/p") zoekt het voorkomen van een tekst in een of meerdere bestanden. Hier vindt het Maja´s telefoonnummer.
pt_br: O comando I<grep> (de "g/re/p") localiza ocorrências de uma string em um ou mais arquivos. Aqui encontra o número de telefone de Maja.
uk: Команда I<grep> (від «g/re/p») шукає входження рядка у одному або декількох файлах. Тут ми шукаємо номер телефону Маї.

source: Pathnames and the current directory
es: Rutas y el directorio actual
it: Nomi di percorso e la directory attuale
nl: Pad namen en de huidige map.
pt_br: Nomes de caminhos e o diretório atual
uk: Шляхи і поточний каталог
