Repository: sebras/manpages-l10n
Catalog: po/*/man1/intro.1.po
Languages: es, it, nl, pt_br, uk

source: One types commands to the I<shell>, the command interpreter. It is not built-in, but is just a program and you can change your shell. Everybody has her own favorite one. The standard one is called I<sh>. See also B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
es: Los usuarios y administradores teclean órdenes en una I<shell>: el intérprete de esas órdenes. No es algo intrínseco del sistema, sino que se trata de una simple aplicación y puede elegir la que desee. Vea también B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
it: I comandi si digitano nella I<shell>, l'interprete dei comandi. La shell non è incorporata nel sistema, è solo un programma, e l'utente può cambiare la propria shell. Ciascuno ha la sua favorita. Quella standard si chiama I<sh>. Vedere anche B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
nl: Commando´s geef je in in de I<shell>, de commando vertaler. Die is niet ingebouwd, maar is slechts een programma dat je zelfs kunt veranderen. Iedereen heeft zijn eigen favoriet. De standaard shell wordt I<sh> genoemd. Zie ook B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
pt_br: Digita-se comandos no I<shell>, o interpretador de comandos. Ele não está embutido, mas é apenas um programa e você pode alterar seu shell. Todo mundo tem seu próprio favorito. O padrão é chamado I<sh>. Veja também B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).
uk: Команди слід вводити у I<оболонці>, інтерпретаторі команд. Оболонка не є вбудованою до системи, — це лише програма, ви можете змінити оболонку. У кожного є своя улюблена оболонка. Стандартна оболонка має назву I<sh>. Див. також B<ash>(1), B<bash>(1), B<chsh>(1), B<csh>(1), B<dash>(1), B<ksh>(1), B<zsh>(1).

source: Try alternatively I<cd> and I<pwd> commands and explore I<cd> usage: "cd", "cd .", "cd ..", "cd /" and "cd ~".
es: Pruebe las órdenes I<cd> y I<pwd>. Indague el uso de I<cd> ejecutando: "cd", "cd .", "cd ..", "cd /" and "cd ~".
it: Si provino alternativamente i comandi I<cd> e I<pwd> e si esamini l'uso di I<cd>: "cd", "cd .", "cd ..", "cd /" e "cd ~".
nl: Probeer de I<cd> en I<pwd> commando´s en verken het gebruik van I<cd>: "cd", "cd .", "cd ..", "cd /" and "cd ~".
pt_br: Tente, alternativamente, os comandos I<cd> e I<pwd> e explore o uso de I<cd>: "cd", "cd .", "cd ..", "cd /" e "cd ~".
uk: Спробуйте скористатися командами I<cd> і I<pwd> і вивчіть користування командою I<cd>: "cd", "cd .", "cd ..", "cd /" і "cd ~".

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 4.16 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 4.16 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.

source: knuth login: B<aeb> Password: B<********> $ B<date> Tue Aug 6 23:50:44 CEST 2002 $ B<cal> August 2002 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31
nl: knuth login: B<aeb> Password: B<********> $ B<date> Di Aug 6 23:50:44 CEST 2002 $ B<cal> Augustus 2002 Zo Ma Di Wo Do Vr Za 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31
pt_br: knuth login: B<aeb> Senha: B<********> $ B<date> Ter Ago 6 18:50:44 BRT 2002 $ B<cal> agosto 2002 do se te qu qu se sá 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31

source: $ B<ls> bin tel $ B<ls -l> total 2 drwxrwxr-x 2 aeb 1024 Aug 6 23:51 bin -rw-rw-r-- 1 aeb 37 Aug 6 23:52 tel $ B<cat tel> maja 0501-1136285 peter 0136-7399214 $ B<cp tel tel2> $ B<ls -l> total 3 drwxr-xr-x 2 aeb 1024 Aug 6 23:51 bin -rw-r--r-- 1 aeb 37 Aug 6 23:52 tel -rw-r--r-- 1 aeb 37 Aug 6 23:53 tel2 $ B<mv tel tel1> $ B<ls -l> total 3 drwxr-xr-x 2 aeb 1024 Aug 6 23:51 bin -rw-r--r-- 1 aeb 37 Aug 6 23:52 tel1 -rw-r--r-- 1 aeb 37 Aug 6 23:53 tel2 $ B<diff tel1 tel2> $ B<rm tel1> $ B<grep maja tel2> maja 0501-1136285 $
pt_br: $ B<ls> bin tel $ B<ls -l> total 2 drwxrwxr-x 2 aeb 1024 ago 6 23:51 bin -rw-rw-r-- 1 aeb 37 ago 6 23:52 tel $ B<cat tel> maja 0501-1136285 peter 0136-7399214 $ B<cp tel tel2> $ B<ls -l> total 3 drwxr-xr-x 2 aeb 1024 ago 6 23:51 bin -rw-r--r-- 1 aeb 37 ago 6 23:52 tel -rw-r--r-- 1 aeb 37 ago 6 23:53 tel2 $ B<mv tel tel1> $ B<ls -l> total 3 drwxr-xr-x 2 aeb 1024 ago 6 23:51 bin -rw-r--r-- 1 aeb 37 ago 6 23:52 tel1 -rw-r--r-- 1 aeb 37 ago 6 23:53 tel2 $ B<diff tel1 tel2> $ B<rm tel1> $ B<grep maja tel2> maja 0501-1136285 $

source: INTRO
uk: ВСТУП
