Repository: sebras/manpages-l10n
Catalog: po/*/man1/intro.1.po
Languages: es, it, nl, pt_br, uk

source: Files live in a large tree, the file hierarchy. Each has a I<pathname> describing the path from the root of the tree (which is called I</>) to the file. For example, such a full pathname might be I</home/aeb/tel>. Always using full pathnames would be inconvenient, and the name of a file in the current directory may be abbreviated by giving only the last component. That is why I</home/aeb/tel> can be abbreviated to I<tel> when the current directory is I</home/aeb>.
es: Los archivos residen en una especie de gran árbol jerárquico. Cada uno de ellos tiene un I<pathname> que describe la ruta desde la raiz de ese árbol (llamado I</>) hasta el archivo. Un ejemplo de una de estas rutas podría ser I</home/aeb/tel>. Para evitar tener que usar siempre la ruta completa para referirse a un archivo, existe la posibilidad de abreviarlo utilizando solo su nombre. Por ejemplo, I</home/aeb/tel> puede abreviarse como I<tel> si el directorio actual es I</home/aeb>.
it: I file risiedono in un grande albero, la gerarchia dei file. Ciascuno ha un I<nome di percorso> che descrive il percorso dalla radice dell'albero (che è chiamata I</>) al file. Per esempio, un nome di percorso completo potrebbe essere I</home/aeb/tel>. Usare sempre nomi di percorso completi non sarebbe conveniente, e il nome di un file nella directory attuale potrebbe essere abbreviato dando solo l'ultimo componente. Questa è la ragione per cui I</home/aeb/tel> può essere abbreviato in I<tel> quando la directory attuale è I</home/aeb>.
nl: Bestanden leven een in grote boom, de bestandssysteem hiërarchie. Elk bestand heeft een I<padnaam> dat het pad beschrijft van de wortel van de boom (genoemd I</>) naar het bestand. Een voorbeeld van een padnaam is I</home/aeb/tel>. Het zou omslachtig zijn om die altijd te moeten gebruiken, de naam van een bestand in de huidige map mag dan ook afgekort worden door alleen de laatste component te gebruiken. Daarom mag I</home/aeb/tel> worden afgekort tot I<tel> als de huidige map I</home/aeb> is.
pt_br: Os arquivos vivem em uma grande árvore, a hierarquia de arquivos. Cada um possui um I<nome-de-caminho> descrevendo o caminho da raiz da árvore (chamada de I</>) para o arquivo. Por exemplo, um nome de caminho completo pode ser I</home/aeb/tel>. Sempre usar nomes de caminho completos seria inconveniente, e o nome de um arquivo no diretório atual pode ser abreviado, fornecendo apenas o último componente. É por isso que I</home/aeb/tel> pode ser abreviado para I<tel> quando o diretório atual é I</home/aeb>.
uk: Файли перебувають у великому дереві, ієрархії файлів. У кожного є I<шлях>, який описує подорож від кореня дерева (який має назву I</>) до самого файла. Наприклад, таким повним шляхом може бути I</home/aeb/tel>. Використовувати всюди повні шляхи не зручно, тому назву файла у поточному каталозі можна скоротити до останнього її компонента. Ось чому замість I</home/aeb/tel> можна скорочено написати I<tel>, якщо поточним каталогом є I</home/aeb>.

source: The command I<pwd> prints the current directory.
es: La orden I<pwd> indica el directorio actual.
it: Il comando I<pwd> stampa la directory attuale.
nl: Het commando I<pwd> toont de huidige map.
pt_br: O comando I<pwd> imprime o diretório atual.
uk: Команда I<pwd> виводить поточний каталог.

source: The command I<cd> changes the current directory.
es: La orden I<cd> cambia el directorio actual.
it: Il comando I<cd> cambia la directory attuale.
nl: Het commando I<cd> verandert de huidige map.
pt_br: O comando I<cd> muda o diretório atual.
uk: Команда I<cd> змінює поточний каталог.

source: Try alternatively I<cd> and I<pwd> commands and explore I<cd> usage: "cd", "cd .", "cd ..", "cd /", and "cd \(ti".
es: Pruebe las órdenes I<cd> y I<pwd>e indague el uso de I<cd> ejecutando: "cd", "cd .", "cd ..", "cd /" and "cd \(ti".
it: Si provino alternativamente i comandi I<cd> e I<pwd> e si esamini l'uso di I<cd>: "cd", "cd .", "cd ..", "cd /" e "cd \(ti".
nl: Probeer de alternatieve I<cd> en I<pwd> commando´s en verken het gebruik van I<cd>: "cd", "cd .", "cd ..", "cd /" en "cd \(ti".
pt_br: Alternativamente, tente os comandos I<cd> e I<pwd> e explore o uso de I<cd>: "cd", "cd .", "cd ..", "cd /", e "cd \(ti".
uk: Спробуйте скористатися командами I<cd> і I<pwd> і вивчіть користування командою I<cd>: "cd", "cd .", "cd ..", "cd /" і "cd \(ti".

source: Directories
es: Directorios
it: Directory
nl: Mappen
pt_br: Diretórios
uk: Каталоги

source: The command I<mkdir> makes a new directory.
es: La órden I<mkdir> crea un nuevo directorio.
it: Il comando I<mkdir> crea una nuova directory.
nl: Het commando I<mkdir> maakt een nieuwe map aan.
pt_br: O comando I<mkdir> cria um novo diretório.
uk: Команда I<mkdir> створює каталог.

source: The command I<rmdir> removes a directory if it is empty, and complains otherwise.
es: La orden I<rmdir> borra un directorio si está vacío. Si no lo está devuelve un mensaje de error.
it: Il comando I<rmdir> rimuove una directory se è vuota, altrimenti si lamenta.
nl: Het commando I<rmdir> verwijdert een map mits die leeg is, anders zal geklaagd worden.
pt_br: O comando I<rmdir> remove um diretório se ele estiver vazio e, do contrário, reclama.
uk: Команда I<rmdir> вилучає каталог, якщо він порожній і повідомляє про помилку, якщо це не так.

source: The command I<find> (with a rather baroque syntax) will find files with given name or other properties. For example, "find . -name tel" would find the file I<tel> starting in the present directory (which is called I<.>). And "find / -name tel" would do the same, but starting at the root of the tree. Large searches on a multi-GB disk will be time-consuming, and it may be better to use B<locate>(1).
es: La orden I<find> (con una syntaxis algo anticuada) se emplea para buscar archivos en base a su nombre o a otra característica. Por ejemplo: "find . -name tel" buscará un archivo I<tel> empezando desde el directorio actual (referido con el punto I<.>), en cambio "find / -name tel" buscará lo mismo pero empezando en el directorio raiz. Búsquedas en discos duros muy grande pueden alargarse mucho y es mejor usar B<locate>(1).
it: Il comando I<find> (con una sintassi piuttosto barocca) troverà file con il nome indicato o con altre proprietà. Per esempio "find . -name tel" troverà il file I<tel> a partire dalla directory attuale (che è chiamata I<.>). E "find / -name tel" farà lo stesso, ma partendo dalla radice dell'albero. Ricerche ampie su un disco di molti GB richiederanno tempo, e potrebbe essere meglio usare B<locate>(1).
nl: Het commando I<find> (met een omslachtige syntaxis) vind bestanden met gegeven naam en andere eigenschappen. Bijvoorbeeld, "find . -name tel" vind het bestand I<tel> beginnend in de huidige map (die wordt aangeduid als I<.>). En "find / -name tel" doet hetzelfde, maar start bij de wortel van de boom. Zoeken op een schijf met een grootte van meerdere-GB kost veel tijd, daarom kan het zijn om B<locate>(1) te gebruiken.
pt_br: O comando I<find> (com uma sintaxe bastante barroca) encontrará arquivos com nome ou outras propriedades. Por exemplo, "find . -name tel" localizaria o arquivo I<tel> iniciando no diretório atual (que é chamado de I<.>). E "find / -name tel" faria o mesmo, mas começando pela raiz da árvore. Pesquisas grandes em um disco com vários GB demoram e pode ser melhor usar B<locate>(1).
uk: Команда I<find> (із доволі вигадливим синтаксисом) знайде файли за заданою назвою або іншими властивостями. Наприклад, «find . -name tel» шукатиме файл I<tel>, починаючи з поточного каталогу (який має назву I<.>). А команда «find / -name tel» виконає той самий пошук, але починаючи з кореня дерева. Пошук на диску об'ємом у сотні гігабайтів може бути доволі тривалми, тому, можливо, варто скористатися B<locate>(1).

source: Disks and filesystems
es: Discos y sistemas de archivo
it: Dischi e Filesystem
nl: Schijven en bestandssystemen
pt_br: Discos e sistemas de arquivos
uk: Диски і файлові системи

source: The command I<mount> will attach the filesystem found on some disk (or floppy, or CDROM or so) to the big filesystem hierarchy. And I<umount> detaches it again. The command I<df> will tell you how much of your disk is still free.
es: La orden I<mount> conecta el sistema de archivos de un disco (puede ser un disquette, un CDROM o similar) al sistema de archivos de la máquina. La órden I<umount> hace el proceso contrario. La orden I<df> informa del espacio libre que queda en el disco.
it: Il comando I<mount> attaccherà il filesystem presente su un disco (o floppy, o CDROM o altro) alla grande gerarchia del filesystem. E I<umount> lo stacca di nuovo. Il comando I<df> informerà su quanto spazio è ancora libero sul disco.
nl: Het commando I<mount> koppelt een bestandssysteem zoals beschikbaar op een schijf (of floppy, CDROM en dergelijke) aan de grote bestandssysteem hiërarchie. En I<umount> koppelt het weer af. Het commando I<df> laat zien hoeveel ruimte er nog beschikbaar is op de schijf.
pt_br: O comando I<mount> anexa o sistema de arquivos encontrado em algum disco (ou disquete, ou CD-ROM e outros) à grande hierarquia do sistema de arquivos. E I<umount> desanexa-o novamente. O comando I<df> lhe dirá quanto do seu disco ainda está livre.
uk: Команда I<mount> долучає файлову систему на певному диску (або дискеті, компакт-диску чи іншому носії) до великої ієрархії файлової системи. Команда I<umount> від'єднує долучену файлову систему. Команда I<df> виводить дані щодо того, скільки вільного місця лишилося на вашому диску.

source: Processes
es: Procesos
it: Processi
nl: Processen
pt_br: Processos
uk: Процеси

source: On a UNIX system many user and system processes run simultaneously. The one you are talking to runs in the I<foreground>, the others in the I<background>. The command I<ps> will show you which processes are active and what numbers these processes have. The command I<kill> allows you to get rid of them. Without option this is a friendly request: please go away. And "kill -9" followed by the number of the process is an immediate kill. Foreground processes can often be killed by typing Control-C.
es: En un sistema UNIX hay varios usuarios y procesos de forma simultánea. Unos se ejecutan en I<foreground> mientras otros los hacen en I<background>. La orden I<ps> muestra qué procesos están activos así como el número que tienen asignado. La orden I<kill> permite eliminarlos; si se ejecuta sin ninguna opción adicional, el sistema intentará terminar el proceso siguiendo todos los pasos. Si ejecuta "kill -9" seguido del número asignado a ese proceso, el sistema lo terminará sin más. Los procesos en primer plano suelen poder terminar tecleando Ctrl-C.
it: Su un sistema Unix molti processi degli utenti e di sistema sono in funzione contemporaneamente. Quello che si sta utilizzando funziona in I<primo piano>, gli altri sullo I<sfondo>. Il comando I<ps> visualizzerà i processi attivi e i numeri a loro associati. Il comando I<kill> permette di sbarazzarsene. Senza opzioni è una richiesta amichevole: per favore vattene. E "kill -9" seguito dal numero del processo terminerà immediatamente il processo stesso. I processi in primo piano possono spesso essere interrotti digitando Control-C.
nl: Op een UNIX systeem draaien gebruiker en systeem processen gelijktijdig, Het proces waar tegen je praat draait in de I<voorgrond>, de andere in de I<achtergrond>. Het commando I<ps> toont welke processen actief zijn en welke nummers deze hebben. Het commando I<kill> kan deze stoppen. Zonder extra optie zal dat een vriendelijk verzoek zijn: "ga weg a.u.b." Een "kill -9" gevolgd door het nummer van een proces veroorzaakt een onverbiddelijke stop. Voorgrond processen kunnen vaak gestopt worden door Control-C te tikken.
pt_br: Em um sistema UNIX, muitos processos do usuário e do sistema são executados simultaneamente. Aquele com quem você está falando é executado em I<primeiro plano>, os outros no I<segundo plano>. O comando I<ps> mostrará quais processos estão ativos e quais números esses processos têm. O comando I<kill> permite que você se livre deles. Sem opção, este é um pedido amigável: vá embora. E "kill -9" seguido pelo número do processo resulta em uma morte imediata do mesmo. Os processos em primeiro plano geralmente podem ser eliminados digitando Control-C.
uk: У системі UNIX одночасно працюють багато процесів користувача і системи. Той, з яким ви працюєте працює в I<основному режимі>, інші — у I<фоновому>. Команда I<ps> показує, які процеси є активними та їхні числові дані. За допомогою команди I<kill> ви можете позбутися від процесів. Без параметрів вона просить програму: «Будь ласка, забирайся!». Якщо ж скомандувати «kill -9», вказавши номер процесу, процес буде негайно знищено. Процеси в основному режимі часто можна завершити простим натисканням Ctrl-C.

source: Getting information
es: Donde obtener información
it: Ottenere informazioni
nl: Verkrijgen van informatie
pt_br: Obtendo informações
uk: Отримання інформації

source: There are thousands of commands, each with many options. Traditionally commands are documented on I<man pages>, (like this one), so that the command "man kill" will document the use of the command "kill" (and "man man" document the command "man"). The program I<man> sends the text through some I<pager>, usually I<less>. Hit the space bar to get the next page, hit q to quit.
es: Existen miles de ordenes, cada una de ellas con distintas opciones. Normalmente, la documentación de dichas órdenes se hace mediante I<páginas de manual> (como lo que está leyendo ahora). Por ejemplo la orden "man kill" mostrará el uso de la orden "kill" y la orden "man man" mostrará el uso de la orden "man". La aplicación I<man> envía el texto a un I<paginador>, por lo general I<less>. Pulse la barra espaciadora para avanzar en el documento y q para salir.
it: Esistono migliaia di comandi, ciascuno con molte opzioni. I comandi tradizionali sono documentati nelle I<pagine di manuale>, (come questa), dunque il comando "man kill" documenterà l'uso del comando "kill" (e "man man" documenterà il comando "man"). Il programma I<man> invia il testo a qualche I<paginatore>, di solito I<less>. Premere la barra spaziatrice per andare alla pagina successiva, premere q per uscire.
nl: Er zijn duizenden commando´s, elk met veel opties. Traditioneel worden commando´s gedocumenteerd op I<man pagina´s>, (zoals deze), waardoor het commando "man kill" het gebruik van het commando "kill" toont (en "man man" toont het commando "man"). Het programma I<man> stuurt de tekst door een I<pager>, normaliter I<less>. Tik de spatiebalk om de volgende pagina te zien, tik q om te stoppen.
pt_br: Existem milhares de comandos, cada um com muitas opções. Tradicionalmente, os comandos são documentados em I<páginas man>, como esta, para que o comando "man kill" documente o uso do comando "kill" (e "man man" documente o comando "man"). O programa que eu I<man> envia o texto através de um I<paginador>, geralmente o I<less>. Pressione a barra de espaço para obter a próxima página, pressione q para sair.
uk: Існують тисячі команд. У кожної багато параметрів. Традиційно, документацію до команд можна знайти на I<сторінках підручника> (подібних до цієї), отже, скомандувавши «man kill» ви побачите документацію щодо використання команди «kill» (а «man man» покаже документацію до команди «man»). Програма I<man> надсилає текст з використанням якогось I<засобу поділу на сторінки>, зазвичай, I<less>. Натисніть пробіл, щоб перейти до наступної сторінки, натисніть Q, щоб вийти.

source: In documentation it is customary to refer to man pages by giving the name and section number, as in B<man>(1). Man pages are terse, and allow you to find quickly some forgotten detail. For newcomers an introductory text with more examples and explanations is useful.
es: Se suele hacer referencia a una paǵina de manual mediante el nombre de la aplicación y el número de sección a la que pertenece, por ejemplo B<man>(1). Las páginas de manual son breves y suele ser fácil encontrar pronto cualquier detalle. Para los recién llegados, es útil disponer de una introducción con ejemplos comentados.
it: Nella documentazione è abitudine fare riferimento alle pagine di manuale indicando nome e numero di sezione, come in B<man>(1). Le pagine di manuale sono concise, e permettono di trovare rapidamente qualche dettaglio dimenticato. Per i nuovi arrivati è utile un testo introduttivo con più esempi e spiegazioni.
nl: In de documentatie is het de gewoonte om naar de man pagina te refereren door het geven van de naam en het sectie nummer, zoals in B<man>(1). Man pagina´s zijn beknopt, en helpen vlot om vergeten details op te zoeken. Voor nieuwkomers is een inleidende tekst met voorbeelden en uitleg nuttig.
pt_br: Na documentação, é habitual consultar as páginas man, fornecendo o nome e o número da seção, como em B<man>(1). As páginas man são concisas e permitem encontrar rapidamente alguns detalhes esquecidos. Para os recém-chegados, é útil um texto introdutório com mais exemplos e explicações.
uk: У документації звичними є посилання на сторінки підручника із зазначенням назви сторінки та номера розділу, зокрема B<man>(1). Сторінки підручника є дуже стислими. За їхньою допомогою ви зможете швидко знайти щось, що ви підзабули. Для початківців стане у пригоді вступний текст із додатковими прикладами і поясненнями.

source: A lot of GNU/FSF software is provided with info files. Type "info info" for an introduction on the use of the program I<info>.
es: Gran cantidad de aplicaciones de GNU/FSF vienen con páginas info. Teclee "info info" para leer una introducción del formato I<info>.
it: Molto del software GNU/FSF è fornito con file info. Digitare "info info" per un'introduzione all'uso del programma I<info>.
nl: Veel van de GNU/FSF software is voorzien van info bestanden. Tik "info info" voor een introductie van het gebruik van het programma I<info> .
pt_br: Muitos softwares do GNU e da FSF são fornecidos com arquivos info. Digite "info info" para obter uma introdução sobre o uso do programa I<info>.
uk: Багато програм GNU/FSF мають власні файли info. Скористайтеся командою "info info", щоб ознайомитися із вступними зауваженнями щодо користування програмою I<info>.

source: Special topics are often treated in HOWTOs. Look in I</usr/share/doc/howto/en> and use a browser if you find HTML files there.
es: En los HOWTO se suelen tratar temas concretos. Mire en I</usr/share/doc/howto/en> y use un navegador si se encuentra algún archivo HTML.
it: Argomenti speciali sono spesso trattati in HOWTO. Si guardi in I</usr/share/doc/howto/en> usando un browser se vi si trovano file in HTML.
nl: Speciale onderwerpen worden behandeld in HOWTO´s. Kijk in I</usr/share/doc/howto/en> en gebruik een browser als je daar HTML bestanden vind.
pt_br: Tópicos especiais são geralmente tratados em guias HOWTOs. Confira em I</usr/share/doc/howto/en> e use um navegador se você encontrar arquivos HTML lá.
uk: Обговорення спеціалізованих тем часто можна знайти у рецептах (HOWTO). Зазирніть до I</usr/share/doc/howto/en> і скористайтеся програмою для перегляду сторінок інтернету для перегляду файлів HTML, які там зберігаються.

source: SEE ALSO
es: VÉASE TAMBIÉN
it: VEDERE ANCHE
nl: ZIE OOK
pt_br: VEJA TAMBÉM
uk: ТАКОЖ ПЕРЕГЛЯНЬТЕ

source: Linux User's Manual
es: Manual de Usuario de Linux
it: Manuale dell'utente Linux
nl: Linux Gebruikershandleiding
pt_br: Manual do Usuário do Linux
uk: Підручник користувача Linux

source: Try alternatively I<cd> and I<pwd> commands and explore I<cd> usage: "cd", "cd .", "cd ..", "cd /" and "cd \(ti".
es: Pruebe las órdenes I<cd> y I<pwd>. Indague el uso de I<cd> ejecutando: "cd", "cd .", "cd ..", "cd /" and "cd \(ti".
it: Si provino alternativamente i comandi I<cd> e I<pwd> e si esamini l'uso di I<cd>: ""cd .", "cd ..", "cd /" e "cd \(ti".
nl: Probeer opeenvolgend I<cd> en I<pwd> commando´s en verken het gebruik van I<cd>: "cd", "cd .", "cd ..", "cd /" en "cd \(ti".
pt_br: Alternativamente, tente os comandos I<cd> e I<pwd> e explore o uso de I<cd>: "cd", "cd .", "cd ..", "cd /" and "cd \(ti".
uk: Спробуйте скористатися командами I<cd> і I<pwd> і вивчіть користування командою I<cd>: "cd", "cd .", "cd ..", "cd /" і "cd \(ti".

source: COLOPHON
es: COLOFÓN
nl: COLOFON
pt_br: COLOFÃO
uk: ПІСЛЯМОВА

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 5.10 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 5.13 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 5.13 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.
