Repository: sebras/manpages-l10n
Catalog: po/*/man1/irqtop.1.po
Languages: de, uk

source: User Commands
de: Dienstprogramme für Benutzer
uk: Команди користувача

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: irqtop - utility to display kernel interrupt information
de: irqtop - Dienstprogramm zum Anzeigen von Informationen zu Kernel-Interrupts
uk: irqtop — допоміжна програма для показу даних щодо переривань ядра

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<irqtop> [options]
de: B<irqtop> [Optionen]
uk: B<irqtop> [параметри]

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: Display kernel interrupt counter information in B<top>(1) style view.
de: Zeigt Informationen zum Kernel-Interrupt-Zähler im Stil von B<top>(1) an.
uk: Показ даних лічильника переривань ядра у стилі показу B<top>(1).

source: The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using B<--output>.
de: Die standardmäßige Ausgabe kann sich ändern. Daher sollten Sie vermeiden, standardmäßige Ausgaben in Ihren Skripten zu verwenden, wo immer es möglich ist. Definieren Sie stets die erwarteten Spalten, indem Sie die Option B<--output> angeben.
uk: Типовий формат виведення може бути змінено авторами програми. Тому, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output>.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: B<-o>, B<--output> I<list>
de: B<-o>, B<--output> I<Liste>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns. The default list of columns may be extended if list is specified in the format I<+list>.
de: gibt die anzuzeigenden Spalten an. Mit B<--help> erhalten Sie eine Liste aller unterstützten Spalten. Die Vorgabeliste der Spalten kann erweitert werden, falls die Liste im Format I<+Liste> angegeben ist.
uk: Вказати, які стовпчики слід вивести. Скористайтеся параметром B<--help>, щоб переглянути опис стовпчиків. Типовий список стовпчиків може бути розширено, якщо список вказано у форматі I<+список>.

source: B<-d>, B<--delay> I<seconds>
de: B<-d>, B<--delay> I<Sekunden>
uk: B<-d>, B<--delay> I<секунди>

source: Update interrupt output every I<seconds> intervals.
de: aktualisiert die Ausgabe der Interrupts alle angegebenen I<Sekunden>.
uk: Оновлювати виведення щодо переривань з інтервалом у вказану кількість I<секунд>.

source: B<-s>, B<--sort> I<column>
de: B<-s>, B<--sort> I<Spalte>
uk: B<-s>, B<--sort> I<стовпчик>

source: Specify sort criteria by column name. See B<--help> output to get column names. The sort criteria may be changes in interactive mode.
de: gibt die Sortierkriterien nach Spaltenname an. Siehe die Ausgabe von B<--help> für die Spaltennamen. Im interaktiven Modus können die Sortierkriterien geändert werden.
uk: Вказати критерій упорядковування за назвою стовпчика. Див. дані, які виведено B<--help>, щоб дізнатися назви стовпчиків. Критерії упорядковування можна змінювати в інтерактивному режимі.

source: Show softirqs information.
de: zeigt Informationen zu Softirqs an.
uk: Вивести дані щодо softirq.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
uk: Вивести текст довідки і завершити роботу.

source: INTERACTIVE MODE KEY COMMANDS
de: TASTATURBEFEHLE IM INTERAKTIVEN MODUS
uk: КЛАВІАТУРНІ КОМАНДИ ІНТЕРАКТИВНОГО РЕЖИМУ

source: sort by short irq name or number field
de: sortiert nach IRQ-Kurzname oder Nummer-Feld
uk: упорядкувати за короткою назвою irq або полем кількості

source: sort by total count of interrupts (the default)
de: sortiert nach Gesamtanzahl der Interrupts (Vorgabe)
uk: упорядкувати за загальною кількістю переривань (типово)

source: sort by delta count of interrupts
de: sortiert nach der Änderung der Anzahl der Interrupts
uk: упорядкувати за лічильником різниці переривань

source: sort by long descriptive name field
de: sortiert nach dem Feld mit der Langbeschreibung
uk: упорядкувати за полем довгої описової назви

source: stop updates and exit program
de: bricht die Aktualisierung ab und beendet das Programm
uk: припинити оновлення і вийти з програми

source: AUTHORS
de: AUTOREN
uk: АВТОРИ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: The B<irqtop> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<irqtop> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<irqtop> є частиною пакунка util-linux, який можна отримати з

source: March 2018
de: März 2018
uk: Березень 2018 року

source: irqtop - Observe IRQ and SoftIRQ in a top-like fashion
de: irqtop - IRQ aud SoftIRQ im Stil von Top anzeigen
uk: irqtop — спостереження за IRQ і SoftIRQ у top-подібному вигляді

source: Shows interrupt rates (per second) per cpu. Also shows irq affinity ('.' for disabled cpus), and rps/xps affinity ('+' rx, '-' tx, '*' tx/rx). Can show packet rate per eth queue.
de: Zeigt die Interrupt-Raten (pro Sekunde) pro CPU an. Außerdem wird die IRQ-Affinität ('.' für deaktivierte CPUs) und die RPS/XPS-Affinität ('+' rx, '-' tx, '*' tx/rx) angezeigt. Es ist möglich, die Paketrate pro Eth-Warteschlange anzuzeigen.
uk: Вивести частоти переривань (за секунду) за процесорами. Також вивести спорідненість irq («.» для вимкнених процесорів) і спорідненість rps/xps («+» — отримання, «-» — надсилання, «*» — надсилання/отримання). Можливий показ частоти пакетів за чергами eth.

source: refresh interval
de: gibt das Aktualisierungsintervall an.
uk: інтервал оновлення

source: select softirqs only
de: wählt nur Softirqs aus.
uk: вибрати лише softirq

source: select hardware irqs only
de: wählt nur Hardware-Irqs aus.
uk: вибрати лише апаратні irq

source: show extra eth stats (from ethtool)
de: zeigt zusätzliche Eth-Status an (von B<ethtool>(8)).
uk: показати додаткові статистичні дані eth (з ethtool)

source: enable display of rps/xps
de: aktiviert die Anzeige von RPS/XPS.
uk: увімкнути показ rps/xps

source: output in table mode (default)
de: zeigt die Ausgabe als Tabelle an (Voreinstellung).
uk: вивести дані у табличному режимі (типова поведінка)

source: output in flat top mode
de: zeigt im vereinfachten Top-Modus an.
uk: вивести дані у простому режимі top

source: output non-interactively
de: zeigt eine nicht-interaktive Ausgabe an.
uk: виводити дані неінтерактивно

source: reverse sort order
de: kehrt die Sortierreihenfolge um.
uk: обернений порядок записів

source: disable colors
de: deaktiviert die farbliche Darstellung.
uk: вимкнути розфарбовування

source: NOTES
de: ANMERKUNGEN
uk: ПРИМІТКИ

source: Rates marked as '.' is forbidden by smp_affinity mask.
de: Mit ».« markierte Raten sind durch die smp_affinity-Maske verboten.
uk: Оцінки, позначені як «.», є забороненим маскою smp_affinity.

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: AUTHOR AND LICENSE
de: AUTOR UND LIZENZ
uk: АВТОР І ЛІЦЕНЗУВАННЯ

source: I<irqtop> was written by ABC E<lt>abc@openwall.comE<gt> and is licensed under the GNU GPL.
de: I<irqtop> wurde von ABC E<lt>abc@openwall.comE<gt> geschrieben und ist unter der GNU GPL lizenziert.
uk: I<irqtop> було написано ABC E<lt>abc@openwall.comE<gt> і ліцензовано за умов дотримання GNU GPL.

source: This man page was written by Axel Beckert E<lt>abe@debian.orgE<gt> for the Debian GNU/Linux distribution (but it may be used by others).
de: Diese Handbuchseite wurde von Axel Beckert E<lt>abe@debian.orgE<gt> für das Debian GNU/Linux-System geschrieben (darf aber auch von anderen verwendet werden).
uk: Цю сторінку підручника написав Axel Beckert E<lt>abe@debian.orgE<gt> для дистрибутива Debian GNU/Linux (але може використовуватися й на інших).

source: February 2020
de: Februar 2020

source: Display kernel interrupt counter information in B<top>(1) style view.
de: Zeigt Informationen zum Kernel-Interrupt-Zähler im Stil von B<top>(1) an.

source: The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using B<--output>.
de: Die standardmäßige Ausgabe kann sich ändern. Daher sollten Sie vermeiden, standardmäßige Ausgaben in Ihren Skripten zu verwenden, wo immer es möglich ist. Definieren Sie stets die erwarteten Spalten, indem Sie die Option B<--output> angeben.

source: B<-o>,B< --output >I<list>
de: B<-o>,B< --output >I<Liste>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns. The default list of columns may be extended if list is specified in the format I<+list>.
de: gibt die anzuzeigenden Spalten an. Mit B<--help> erhalten Sie eine Liste aller unterstützten Spalten. Die Vorgabeliste der Spalten kann erweitert werden, falls die Liste im Format I<+Liste> angegeben ist.

source: B<-d>,B< --delay >I<seconds>
de: B<-d>,B< --delay >I<Sekunden>

source: B<-s>,B< --sort >I<column>
de: B<-s>,B< --sort >I<Spalte>

source: Specify sort criteria by column name. See B<--help> output to get column names. The sort criteria may be changes in interactive mode.
de: gibt die Sortierkriterien nach Spaltenname an. Siehe die Ausgabe von B<--help> für die Spaltennamen. Im interaktiven Modus können die Sortierkriterien geändert werden.

source: The irqtop command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
de: Der Befehl B<irqtop> ist Teil des Pakets util-linux, welches aus dem E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel-Archiv E<.UE> heruntergeladen werden kann.

source: B<-c>, B<--cpu-stat> I<mode>
uk: B<-c>, B<--cpu-stat> I<режим>

source: Show per-cpu statistics by specified mode. Available modes are: B<auto>, B<enable>, B<disable>. The default option B<auto> detects the width of window, then shows the per-cpu statistics if the width of window is large enouth to show a full line of statistics.
uk: Вивести статистику для окремих процесорів за вказаним режимом. Доступні режими: B<auto>, B<enable>, B<disable>. Використання типового параметра B<auto> призводить до виявлення ширини вікна з наступним показом статистики для окремих процесорів, якщо ширина вікна є достатньо великою для показу повного рядка статистики.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.
