Repository: sebras/manpages-l10n
Catalog: po/*/man1/isoinfo.1.po
Languages: pl

source: Version 2.0
pl: Wersja 2.0

source: NAME
pl: NAZWA

source: devdump, isoinfo, isovfy, isodump - Utility programs for dumping and verifying iso9660 images.
pl: devdump, isoinfo, isovfy, isodump - Programy użytkowe do zrzucania i weryfikacji obrazów iso9660.

source: SYNOPSIS
pl: SKŁADNIA

source: B<devdump> I<isoimage>
pl: B<devdump> I<obraz_iso>

source: B<isodump> I<isoimage>
pl: B<isodump> I<obraz_iso>

source: B<isoinfo> [ B<-d> ] [ B<-h> ] [ B<-R> ] [ B<-J> ] [ B<-j> I<charset> ] [ B<-f> ] [ B<-l> ] [ B<-p> ] [ B<-T> I<sector> ] [ B<-N> I<sector> ] [ B<-i> I<isoimage> ] [ B<-x> I<path> ]
pl: B<isoinfo> [ B<-d> ] [ B<-h> ] [ B<-R> ] [ B<-J> ] [ B<-j> I<zestaw_znaków> ] [ B<-f> ] [ B<-l> ] [ B<-p> ] [ B<-T> I<sektor> ] [ B<-N> I<sektor> ] [ B<-i> I<obraz_iso> ] [ B<-x> I<ścieżka> ]

source: B<isovfy> I<isoimage>
pl: B<isovfy> I<obraz_iso>

source: DESCRIPTION
pl: OPIS

source: B<devdump> is a crude utility to interactively display the contents of device or filesystem images. The initial screen is a display of the first 256 bytes of the first 2048 byte sector. The commands are the same as with B<isodump>.
pl: B<devdump> jest prostym narzędziem interaktywnie wyświetlającym zawartość urządzenia lub obraz systemu plików. Początkowy obraz to pierwsze 256 bajtów pierwszego 2048-bajtowego sektora. Polecenia są takie same jak w przypadku B<isodump>.

source: B<isodump> is a crude utility to interactively display the contents of iso9660 images in order to verify directory integrity. The initial screen is a display of the first part of the root directory, and the prompt shows you the extent number and offset in the extent.
pl: B<isodump> jest prostym narzędziem interaktywnie wyświetlającym zawartość obrazów iso9660 w celu weryfikacji integralności katalogów. Początkowy obraz to pierwsza część katalogu głównego, i znak zachęty wyświetlający zakres i przesunięcie w tym zakresie.

source: You can use the 'a' and 'b' commands to move backwards and forwards within the image. The 'g' command allows you to goto an arbitrary extent, and the 'f' command specifies a search string to be used. The '+' command searches forward for the next instance of the search string, and the 'q' command exits B<devdump> or B<isodump>.
pl: Można użyć poleceń 'a' i 'b' aby poruszać się w przód i w tył wewnątrz obrazu. Polecenie 'g' pozwala przeskoczyć do konkretnego miejsca, a polecenie 'f' pozwala na wpisanie frazy wyszukiwania. Polecenie '+' przeszukuje w przód aż do następnego wystąpienia frazy wyszukiwania, a polecenie 'q' kończy działanie programu B<devdump> lub B<isodump>.

source: B<isoinfo> is a utility to perform directory like listings of iso9660 images.
pl: B<isoinfo> jest narzędziem pozwalającym na listowanie zawartości obrazu iso9660 tak jak katalogu.

source: B<isovfy> is a utility to verify the integrity of an iso9660 image. Most of the tests in B<isovfy> were added after bugs were discovered in early versions of B<genisoimage.> It isn't all that clear how useful this is anymore, but it doesn't hurt to have this around.
pl: B<isovfy> jest narzędziem do weryfikacji integralności obrazu iso9660. Większość testów w B<isovfy> zostało dodanych po tym jak odnaleziono błędy we wczesnych wersjach B<genisoimage>. Trudno określić jak użyteczne jest to aktualnie, ale nie zaszkodzi spróbować.

source: OPTIONS
pl: OPCJE

source: The options common to all programs are B<-help>,B<-h>,B<-version>, B<i>I<=name,>B<dev>I<=name.> The B<isoinfo> program has additional command line options. The options are:
pl: Opcjami wspólnymi dla wszystkich programów są B<-help>, B<-h>, B<-version>, B<i=>I<nazwa>, B<dev=>I<nazwa>. Program B<isoinfo> ma dodatkowe opcje.

source: print a summary of all options.
pl: wyświetla podsumowanie wszystkich opcji.

source: Print information from the primary volume descriptor (PVD) of the iso9660 image. This includes information about Rock Ridge, Joliet extensions and Eltorito boot information if present.
pl: Wypisuje informacje z podstawowego deskryptora woluminu (ang. primary volume descriptor - PVD) obrazu iso9660. Obejmuje to informacje o Rock Ridge, rozszerzeniach Joliet i informacjach rozruchowych Eltorito - jeśli są obecne.

source: generate output as if a 'find . -print' command had been run on the iso9660 image. You should not use the B<-l> image with the B<-f> option.
pl: tworzy taki wynik, jakby ktoś wykonał 'find . -print' na obrazie iso9660. Nie należy używać obrazu B<-l> razem z opcją B<-f>.

source: B<-i iso_image>
pl: B<-i obraz_iso>

source: Specifies the path of the iso9660 image that we wish to examine. The options B<-i> and B<dev=>I<target> are mutual exclusive.
pl: Określa ścieżkę do obrazu iso9660, który chcemy sprawdzić. Opcje B<-i> oraz B<dev=>I<cel> wzajemnie się wykluczają.

source: B<dev=>I<target>
pl: B<dev=>I<cel>

source: Sets the SCSI target for the drive, see notes above. A typical device specification is B<dev=>I<6,0> \&. If a filename must be provided together with the numerical target specification, the filename is implementation specific. The correct filename in this case can be found in the system specific manuals of the target operating system. On a I<FreeBSD> system without I<CAM> support, you need to use the control device (e.g. I</dev/rcd0.ctl>). A correct device specification in this case may be B<dev=>I</dev/rcd0.ctl:@> \&.
pl: Ustawia cel SCSI jako napęd, zob. uwagi powyżej. Zwykle ma on postać B<dev=>I<6,0> \&. Jeśli konieczne jest podanie nazwy pliku z określeniem numerycznym, nazwa pliku zależy od implementacji. Prawidłową nazwę pliku można wówczas znaleźć w podręczniku systemowym docelowego systemu operacyjnego. W systemie I<FreeBSD> bez obsługi I<CAM>, konieczne jest użycia urządzenia sterującego (np. I</dev/rcd0.ctl>). Prawidłowa postać I<celu> może być wówczas następująca: B<dev=>I</dev/rcd0.ctl:@> \&.

source: On Linux, drives connected to a parallel port adapter are mapped to a virtual SCSI bus. Different adapters are mapped to different targets on this virtual SCSI bus.
pl: W Linuksie, napędy podłączone do adaptera portu równoległego są przypisane wirtualnej szynie SCSI. Różne adaptery są mapowane do różnych celów tejże szyny.

source: If no I<dev> option is present, the program will try to get the device from the B<CDR_DEVICE> environment.
pl: Jeśli nie poda się opcji B<dev>, program spróbuje uzyskać urządzenie ze zmiennej środowiskowej B<CDR_DEVICE>.

source: If the argument to the B<dev=> option does not contain the characters ',', '/', '@' or ':', it is interpreted as an label name that may be found in the file /etc/wodim.conf (see FILES section).
pl: Jeśli argument podany opcji B<dev=> nie zawiera następujących znaków: ",", "/", "@" lub ":", jest interpretowany jako nazwa etykiety, taka jak w pliku /etc/wodim.conf (zob. rozdział PLIKI).

source: The options B<-i> and B<dev=>I<target> are mutual exclusive.
pl: Opcje B<-i> i B<dev=>I<cel> wzajemnie się wykluczają.

source: generate output as if a 'ls -lR' command had been run on the iso9660 image. You should not use the B<-f> image with the B<-l> option.
pl: tworzy taki wynik, jakby ktoś wykonał 'ls -lR' na obrazie iso9660. Nie należy używać obrazu B<-f> razem z opcją B<-l>.

source: B<-N sector>
pl: B<-N sektor>

source: Quick hack to help examine single session disc files that are to be written to a multi-session disc. The sector number specified is the sector number at which the iso9660 image should be written when send to the cd-writer. Not used for the first session on the disc.
pl: Szybki sposób na analizowanie jednosesyjnych obrazów, która mają być wypalone na płycie wielosesyjnej. Podany numer sektora jest sektorem, od którego obraz iso9660 powinien być zapisany przy wysyłaniu do nagrywarki. Opcja nie służy do nagrywania pierwszej sesji na dysku.

source: Print path table information.
pl: Wyświetla informację o tablicy ścieżek.

source: Extract information from Rock Ridge extensions (if present) for permissions, file names and ownerships.
pl: Wyciąga informacje z rozszerzenia Rock Ridge (jeśli jest obecne) o prawach, nazwach plików i właścicielu.

source: Extract information from Joliet extensions (if present) for file names.
pl: Wyciąga informacje z rozszerzenia Joliet (jeśli jest obecne) o nazwach plików.

source: B<-j charset>
pl: B<-j zestaw_znaków>

source: Convert Joliet file names (if present) to the supplied charset. See B<genisoimage>(8) for details.
pl: Przekształca nazwy plików Joliet (jeśli są obecne) do podanego zestawu znaków. Więcej informacji w podręczniku B<genisoimage>(8)

source: B<-T sector>
pl: B<-T sektor>

source: Quick hack to help examine multi-session images that have already been burned to a multi-session disc. The sector number specified is the sector number for the start of the session we wish to display.
pl: Szybki sposób na analizowanie wielosesyjnych obrazów, które zostały już wypalone na płycie wielosesyjnej. Numer sektora podany tutaj to numer sektora, w którym zaczyna się dana sesja na płycie.

source: B<-x pathname>
pl: B<-x ścieżka>

source: Extract specified file to stdout.
pl: Wyodrębnia podany plik na standardowe wyjście.

source: AUTHOR
pl: AUTOR

source: The author of the original sources (1993 .\|.\|. 1998) is Eric Youngdale E<lt>ericy@gnu.ai.mit.eduE<gt> or E<lt>eric@andante.jic.comE<gt> is to blame for these shoddy hacks. J\*org Schilling wrote the SCSI transport library and its adaptation layer to the programs and newer parts (starting from 1999) of the utilities, this makes them Copyright (C) 1999-2004 J\*org Schilling. Patches to improve general usability would be gladly accepted.
pl: O te liche dodatki należy winić Erica Youngdale'a E<lt>ericy@gnu.ai.mit.eduE<gt> lub E<lt>eric@andante.jic.comE<gt> - autora oryginalnych źródeł (1993 .\|.\|. 1998) . J\*org Schilling utworzył bibliotekę transportową SCSI i jej warstwę kompatybilności do programów, a także nowsze części (począwszy od 1999) narzędzi, co upoważnia go do opatrzenia ich etykietą Copyright (C) 1999-2004 J\*org Schilling. Patche poprawiające używalność byłyby mile widziane.

source: This manpage describes the program implementation of B<isoinfo> as shipped by the cdrkit distribution. See B<http://alioth.debian.org/projects/debburn/> for details. It is a spinoff from the original program distributed in the cdrtools package [1]. However, the cdrtools developers are not involved in the development of this spinoff and therefore shall not be made responsible for any problem caused by it. Do not try to get support for this program by contacting the original author(s).
pl: Niniejsza strona podręcznika systemowego opisuje implementację B<isoinfo> dostarczaną przez dystrybucję cdrkit. Więcej informacji pod adresem B<http://alioth.debian.org/projects/debburn/>. Jest to odmiana oryginalnego programu dystrybuowana z pakietem cdrtools[1]. Deweloperzy cdrtools nie są jednak odpowiedzialni za jej rozwój, ani za problemy wynikłe z jej działania. Z tego powodu prosimy o niekontaktowanie się z oryginalnymi autorami, w celu uzyskania wsparcia.

source: If you have support questions, send them to
pl: Pytania dotyczące programu można kierować (w języku angielskim) pod adres

source: If you have definitely found a bug, send a mail to this list or to
pl: Jeśli natomiast odkryło się niewątpliwy błąd, należy wysłać wiadomość (w języku angielskim) na tę listę lub pod adres

source: writing at least a short description into the Subject and "Package: cdrkit" into the first line of the mail body.
pl: z co najmniej krótkim opisem w tytule; przy czym pierwszy wiersz wiadomości musi brzmieć "Package: cdrkit".

source: BUGS
pl: BŁĘDY

source: The user interface really sucks.
pl: Interfejs użytkownika jest do bani.

source: FUTURE IMPROVEMENTS
pl: PRZYSZŁE UDOSKONALENIA

source: These utilities are really quick hacks, which are very useful for debugging problems in genisoimage or in an iso9660 filesystem. In the long run, it would be nice to have a daemon that would NFS export a iso9660 image.
pl: Te narzędzia to tylko szybkie sztuczki, które są bardzo użyteczne podczas odpluskwiania problemów w genisoimage lub systemie plików iso9660. Na dłuższą metę, byłoby miło mieć demon, który by eksportował obraz iso9660 po NFS-ie.

source: The isoinfo program is probably the program that is of the most use to the general user.
pl: Isoinfo jest programem, który jest prawdopodobnie najbardziej użyteczny dla zwykłego użytkownika.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: These utilities come with the B<cdrkit> package, and the primary download site is http://debburn.alioth.debian.org/ and FTP mirrors of distributions. Despite the name, the software is not beta.
pl: Te narzędzia zostały dostarczone wraz z pakietem B<cdrtools>, a główną stroną do pobrań jest https://sourceforge.net/projects/cdrtools/files/ oraz serwery lustrzane FTP dystrybucji. Pomimo nazwy, oprogramowanie to nie jest wersją beta.

source: ENVIRONMENT
pl: ŚRODOWISKO

source: This may either hold a device identifier that is suitable to the open call of the SCSI transport library or a label in the file /etc/wodim.conf.
pl: Zmienna może zawierać albo identyfikator urządzenia zdolnego do otwierania wywołań biblioteki transportowej SCSI lub etykietę z pliku /etc/wodim.conf.

source: If the B<RSH> environment is present, the remote connection will not be created via B<rcmd>(3) but by calling the program pointed to by B<RSH>. Use e.g. B<RSH=>/usr/bin/ssh to create a secure shell connection.
pl: Jeśli zmienna B<RSH> jest ustawiona, zdalne połączenia nie będą tworzone poleceniem B<rcmd>(3) lecz wywołaniem programu, na który wskazuje zmienna B<RSH>. Przykładowo podanie B<RSH=>I</usr/bin/ssh> spowoduje zestawienie bezpiecznego połączenia powłoki.

source: Note that this forces the program to create a pipe to the B<rsh(1)> program and disallows the program to directly access the network socket to the remote server. This makes it impossible to set up performance parameters and slows down the connection compared to a B<root> initiated B<rcmd(3)> connection.
pl: Proszę zauważyć, że zmusza to program do utworzenia potoku do programu B<rsh(1)> i nie pozwala na bezpośredni dostęp do gniazda sieciowego zdalnego serwera. W ten sposób niemożliwe jest ustawienie parametrów wydajnościowych, co spowalnia połączenie w stosunku do połączenia B<rcmd(3)> zestawionego przez B<root>-a.

source: If the B<RSCSI> environment is present, the remote SCSI server will not be the program B</opt/schily/sbin/rscsi> but the program pointed to by B<RSCSI>. Note that the remote SCSI server program name will be ignored if you log in using an account that has been created with a remote SCSI server program as login shell.
pl: Jeśli obecna jest zmienna środowiskowa B<RSCSI> zdalnym serwerem SCSI nie będzie program I</opt/schily/sbin/rscsi>, lecz program na który wskazuje zmienna B<RSCSI>. Proszę zauważyć, że nazwa programu na zdalnym serwerze zostanie zignorowana, jeśli logowanie nastąpi z konta, które zostało utworzone z programem SCSI zdalnego serwera ustawionym jako powłoka logowania.

source: FILES
pl: PLIKI

source: /etc/wodim.conf
pl: I</etc/wodim.conf>

source: Default values can be set for the following options in /etc/wodim.conf.
pl: Wartości domyślne poniższych opcji można ustawić w pliku /etc/wodim.conf.

source: This may either hold a device identifier that is suitable to the open call of the SCSI transport library or a label in the file /etc/wodim.conf that allows to identify a specific drive on the system.
pl: Zmienna może zawierać albo identyfikator urządzenia zdolnego do otwierania wywołań biblioteki transportowej SCSI lub etykietę z pliku /etc/wodim.conf pozwalającą na zidentyfikowanie określonego napędu w systemie.

source: Any other label
pl: Dowolna inna etykieta

source: is an identifier for a specific drive on the system. Such an identifier may not contain the characters ',', '/', '@' or ':'.
pl: jest identyfikatorem określonego napędu w systemie. Nie może zawierać następujących znaków: ",","/", "@" i ":".

source: Each line that follows a label contains a TAB separated list of items. Currently, four items are recognized: the SCSI ID of the drive, the default speed that should be used for this drive, the default FIFO size that should be used for this drive and drive specific options. The values for I<speed> and I<fifosize> may be set to -1 to tell the program to use the global defaults. The value for driveropts may be set to "" if no driveropts are used. A typical line may look this way:
pl: Każdy następny wiersz zawiera etykietę zawierającą oddzieloną tabulatorem listę wpisów. Obecnie rozpoznawane są cztery wpisy: identyfikator SCSI napędu; domyślna prędkość, która powinna być zastosowana dla tego napędu; domyślny rozmiar FIFO, który powinien być zastosowany dla danego napędu; opcje charakterystyczne dla napędu. Wartości B<speed> (prędkości) i B<fifosize> (rozmiaru FIFO) można ustawić na -1, aby program użył globalnych ustawień domyślnych. Jeśli wartość dla B<driveropts> będzie wynosiła "", nie będą użyte żadne opcje charakterystyczne dla napędu. Typowy wiersz może wyglądać następująco:

source: This tells the program that a drive named I<teac1> is at scsibus 0, target 5, lun 0 and should be used with speed 4 and a FIFO size of 8 MB. A second drive may be found at scsibus 1, target 6, lun 0 and uses the default speed and the default FIFO size.
pl: Nakazuje to programowi użycie napędu o nazwie I<teac1> na szynie scsi 0, celu 5, numerze logicznym (lun) 0 z prędkością 4 i rozmiarze FIFO 8 MB. Drugi napęd znajduje się na szynie scsi 1, celu 6, lun 0 i używa domyślnych wartości dla prędkości i rozmiaru FIFO.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: SOURCES
pl: ŹRÓDŁA

source: [1] Cdrtools 2.01.01a08 from May 2006, http://cdrecord.berlios.de
pl: [1] Cdrtools 2.01.01a08 z maja 2006, http://cdrecord.berlios.de
