Repository: sebras/manpages-l10n
Catalog: po/*/man1/ldd.1.po
Languages: da, es, it

source: Linux Programmer's Manual
da: Linuxprogrammørens manual
es: Manual del Programador de Linux
it: Manuale del programmatore di Linux

source: NAME
da: NAVN
es: NOMBRE
it: NOME

source: ldd - print shared object dependencies
da: ldd - vis delte objektafhængigheder
es: ldd - muestra las dependencias de objetos compartidos
it: ldd - stampa le dipendenze degli oggetti condivisi

source: SYNOPSIS
es: SINOPSIS
it: SINTASSI

source: B<ldd> [I<option>]... I<file>...
da: B<ldd> [I<tilvalg>]... I<fil>...
es: B<ldd> [I<opción>]... I<fichero>....
it: B<ldd> [I<opzione>]... I<file>...

source: DESCRIPTION
da: BESKRIVELSE
es: DESCRIPCIÓN
it: DESCRIZIONE

source: B<ldd> prints the shared objects (shared libraries) required by each program or shared object specified on the command line. An example of its use and output is the following:
da: B<ldd> viser de delte objekter (delte biblioteker) krævet af hvert program eller hvert objekt specificeret på kommandolinjen. Et eksempel på dets brug og resultat:
es: B<ldd> muestra las bibliotecas compartidas requeridas por cada programa o biblioteca compartida especificada en la línea de órdenes. Un ejemplo de su uso sería el siguiente:
it: B<ldd> stampa gli oggetti condivisi (librerie condivise) richiesti da ciascun programma od oggetto condiviso specificato sulla riga di comando. Un esempio d'uso e di output è il seguente:

source: In the usual case, B<ldd> invokes the standard dynamic linker (see B<ld.so>(8)) with the B<LD_TRACE_LOADED_OBJECTS> environment variable set to 1. This causes the dynamic linker to inspect the program's dynamic dependencies, and find (according to the rules described in B<ld.so>(8)) and load the objects that satisfy those dependencies. For each dependency, B<ldd> displays the location of the matching object and the (hexadecimal) address at which it is loaded. (The I<linux-vdso> and I<ld-linux> shared dependencies are special; see B<vdso>(7) and B<ld.so>(8).)
da: I det normale tilfælde igangsætter B<ldd> den dynamiske standardlænker (se B<ld.so>(8) med miljøvariablen B<LD_TRACE_LOADED_OBJECTS> sat til 1. Dette får den dynamiske lænker til at inspicere programmets dynamiske afhængigheder og finde (jævnfør reglerne beskrevet i B<ld.so>(8)) og indlæse objekterne, der opfylder disse afhængigheder. For hver afhængighed viser B<ldd> placeringen af det matchende objekt og adressen (hexadecimal) hvorpå objektet er indlæst. (De delte afhængigheder I<linux-vdso> og I<ld-linux> er specielle; se B<vdso>(7) og B<ld.so>(8).)
es: Normalmente, B<ldd> invoca el enlazador dinámico estándar (consulte B<ld.so>(8)) con la variable de entorno B<LD_TRACE_LOADED_OBJECTS> con el valor 1. Esto hará que el enlazador dinámico inspeccione las dependencias dinámicas del programa, encuentre (según las reglas descritas en B<ld.so>(8)) y cargue los objetos para satisfacerlas. Para cada dependencia, B<ldd> muestra la ubicación del objeto coincidente y la dirección (hexadecimal) en la que se carga. (Las dependencias compartidas I<linux-vdso> e I<ld-linux> son especiales; consulte B<vdso>(7) y B<ld.so>(8).)
it: Usualmente, B<ldd> invoca il linker dinamico standard (vedere B<ld.so>(8)) e assegna la variabile d'ambiente B<LD_TRACE_LOADED_OBJECTS> impostandola a 1. Questo fa sì che il linker dinamico ispezioni le dipendenze dinamiche del programma, e trovi (in accordo con le regole descritte in B<ld.so>(8)) e carichi gli oggetti che soddisfano quelle dipendenze. Per ogni dipendenza, B<ldd> mostra la posizione dell'oggetto trovato e l'indirizzo (esadecimale) in cui è stato caricato. (Le dipendenze condivise I<linux-vdso> e I<ld-linux> sono speciali; vedi B<vdso>(7) e B<ld.so>(8).)

source: Security
da: Sikkerhed
es: Seguridad
it: Sicurezza

source: Be aware that in some circumstances (e.g., where the program specifies an ELF interpreter other than I<ld-linux.so>), some versions of B<ldd> may attempt to obtain the dependency information by attempting to directly execute the program, which may lead to the execution of whatever code is defined in the program's ELF interpreter, and perhaps to execution of the program itself. (In glibc versions before 2.27, the upstream B<ldd> implementation did this for example, although most distributions provided a modified version that did not.)
da: Vær opmærksom på at i nogle tilfælde (f.eks. hvor programmer specificerer en anden ELF-fortolker end I<ld-linux.so>) kan nogle versioner af B<ldd> forsøge at indhente afhængighedsinformation ved direkte at forsøge at afvikle programmet, hvilket kan føre til afviklingen af kode uanset koden defineret i programmets ELF-fortolkler, og måske til afviklingen af selve programmet. (I glibc-versioner før 2.27 gjorde f.eks. opstrømsimplementeringen af B<ldd> dette, selvom de fleste distributioner tilbød en ændret version, der ikke gjorde dette).
es: Tenga en cuenta que en algunas circunstancias (por ejemplo, cuando el programa especifica un intérprete ELF distinto de I<ld-linux.so>), algunas versiones de B<ldd> pueden intentar averiguar las dependencias intentando ejecutar directamente el programa, lo que puede dar lugar a la ejecución de cualquier código definido en el intérprete ELF del mismo, y quizás a su ejecución. (En las versiones de glibc anteriores a 2.27, la implementación de B<ldd> original hacía esto, aunque la mayoría de las distribuciones proporcionaron una versión modificada para evitarlo.
it: È bene sapere che in qualche caso (p.es. quando il programma specifica un interprete ELF oltre a I<ld-linux.so>), alcune versioni di B<ldd> possono tentare di ottenere le informazioni sulle dipendenze tentando di eseguire direttamente il programma, che può portare all'esecuzione di qualsivoglia codice sia definito nell'interprete ELF del programma, e forse all'esecuzione del programma stesso. (Nelle versioni di glibc precedenti alla 2.27, l'implementazione upstream di B<ldd> faceva questo, per esempio, sebbene la maggior parte delle distribuzioni forniscano una versione modificata che non lo fa.)

source: Thus, you should I<never> employ B<ldd> on an untrusted executable, since this may result in the execution of arbitrary code. A safer alternative when dealing with untrusted executables is:
da: Du bør derfor I<aldrig> anvende B<ldd> på en utroværdig kørbar fil, da dette kan medføre afviklingen af arbitrær kode. Et mere sikkert alternativ, når utroværdige kørbare filer håndteres, er:
es: De ahí que I<NUNCA> se debería usar B<ldd> con un ejecutable del que no se conozca su procedencia, ya que podría ejecutar código malicioso. Una alternativa más segura para dichos ejecutables desconocidos sería:
it: Perciò, non si dovrebbe I<mai> impiegare B<ldd> su un eseguibile non fidato, poiché può avere come risultato l'esecuzione di codice arbitrario. Un'alternativa più sicura quando si ha a che fare con eseguibili non fidati è:

source: $ B<objdump -p /path/to/program | grep NEEDED>
da: $ B<objdump -p /sti/til/program | grep NEEDED>
es: $ B<objdump -p /ruta/hasta/el/program | grep NEEDED>
it: $ B<objdump -p /percorso/del/programma | grep NEEDED>

source: Note, however, that this alternative shows only the direct dependencies of the executable, while B<ldd> shows the entire dependency tree of the executable.
da: Bemærk dog at dette alternativ kun viser de direkte afhængigheder for den kørbare fil, da B<ldd> viser hele afhængighedstræet for den kørbare fil.
es: Esta alternativa solo mostrará las dependencias directas del ejecutable, mientras que B<ldd> muestra el árbol completo.
it: Si noti, comunque, che questa alternativa mostra solo le dipendenze dirette dell'eseguibile, mentre B<ldd> mostra l'intero albero delle dipendenze dell'eseguibile.

source: OPTIONS
da: TILVALG
es: OPCIONES
it: OPZIONI

source: Print the version number of B<ldd>.
da: Vis versionsnummeret for B<ldd>.
es: Imprime el número de versión de B<ldd>.
it: Stampa il numero di versione di B<ldd>.

source: Print all information, including, for example, symbol versioning information.
da: Vis al information, inklusive, for eksempel, symbolversioneringsinformation.
es: Muestra toda la información, incluyendo p.e. información sobre versiones de símbolos.
it: Stampa tutte le informazioni, inclusa ad es. la versione.

source: Print unused direct dependencies. (Since glibc 2.3.4.)
da: Vis ubrugte direkte afhængihgeder. (Siden glibc 2.3.4).
es: Muestra las dependencias directas sin usar (a partir de glibc 2.3.4).
it: Stampa le dipendenze dirette inutilizzate. (A partire da glibc 2.3.4.)

source: Perform relocations and report any missing objects (ELF only).
da: Udfører flytninger og rapporterer om manglende objekter (kun ELF).
es: Lleva a cabo las relocalizaciones e informa de cualquier objeto no encontrado (solo ELF).
it: Effettua rilocazioni e riporta ogni oggetto mancante (solo ELF).

source: Perform relocations for both data objects and functions, and report any missing objects or functions (ELF only).
da: Udfører flytninger for både dataobjekter og funktioner, og rapporterer alle manglende objekter eller funktioner (kun ELF).
es: Lleva a cabo las relocalizaciones para los objetos de datos y las funciones, e informa de cualquier objeto o función no encontrados (solo ELF).
it: Effettua rilocazioni sia per oggetti dati che per funzioni, e riporta tutti gli oggetti o funzioni mancanti (solo ELF).

source: Usage information.
da: Information om brug.
es: Información de uso.
it: Informazioni sull'uso.

source: BUGS
da: FEJL
es: ERRORES
it: BUG

source: B<ldd> does not work on a.out shared libraries.
da: B<ldd> fungerer ikke på a.out-delte biblioteker.
es: B<ldd> no funciona con bibliotecas compartidas a.out.
it: B<ldd> non funziona con librerie condivise a.out.

source: B<ldd> does not work with some extremely old a.out programs which were built before B<ldd> support was added to the compiler releases. If you use B<ldd> on one of these programs, the program will attempt to run with I<argc> = 0 and the results will be unpredictable.
da: B<ldd> fungerer ikke med nogle ekstremt gamle a.out-programmer, der blev bygget før B<ldd>-understøttelse blev tilføjet til kompilerudgivelserne. Hvis du bruger B<ldd> på et af disse programmer, så vil programmet forsøge at blive afviklet med I<argc> = 0 og resultaterne vil være uforudsigelige.
es: B<ldd> no funciona con algunos programas a.out extremadamente antiguos que fueron construidos antes de que el soporte para B<ldd> fuera añadido a las versiones de los compiladores. Si usa B<ldd> con alguno de estos programas, el programa intentará ejecutarse con I<argc> = 0 y los resultados serán impredecibles.
it: B<ldd> non funziona con alcuni programmi a.out molto vecchi, che sono stati costruiti prima che il supporto di B<ldd> fosse aggiunto alle release del compilatore. Se si usa B<ldd> in uno di questi programmi il programma tenterà di funzionare con I<argc> = 0 e i risultati saranno non prevedibili.

source: SEE ALSO
da: SE OGSÅ
es: VÉASE TAMBIÉN
it: VEDERE ANCHE

source: COLOPHON
da: KOLOFON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
da: Denne side er en del af udgivelse 5.13 for Linux I<man-pages>-projektet. En beskrivelse af projektet, information om fejlrapporter og den seneste version af denne side, kan findes på \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: B<ldd> [I<option>]... I<file>...
da: B<ldd> [I<tilvalg>]... I<fil>...
es: B<ldd> [I<opción>]... I<fichero>...
it: B<ldd> [I<opzione>]... I<file>...

source: B<ldd> prints the shared objects (shared libraries) required by each program or shared object specified on the command line. An example of its use and output (using B<sed>(1) to trim leading white space for readability in this page) is the following:
da: B<ldd> viser de delte objekter (delte biblioteker) krævet af hvert program eller delt objekt specificeret på kommandolinjen. Et eksempel på dets brug og resultat (med B<sed>(1) til at trimme foranstillede mellemrum for bedre læsbarhed på denne side):
es: B<ldd> imprime los objetos compartidos (bibliotecas compartidas) requeridos por cada programa u objeto compartido especificado en la línea de órdenes. Un ejemplo de su uso (usando B<sed> (1) para recortar el espacio en blanco inicial para facilitar la lectura) es el siguiente:
it: B<ldd> stampa gli oggetti condivisi (librerie condivise) richiesti da ciascun programma od oggetto condiviso specificato sulla riga di comando. Un esempio d'uso e di output (usando B<sed>(1) per tagliare gli spazi bianchi iniziali per una migliore leggibilità in questa pagina) è il seguente:

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
da: Denne side er en del af udgivelse 5.10 for Linux I<man-pages>-projektet. En beskrivelse af projektet, information om fejlrapporter og den seneste version af denne side, kan findes på \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
da: Denne side er en del af udgivelse 4.16 for Linux I<man-pages>-projektet. En beskrivelse af projektet, information om fejlrapporter og den seneste version af denne side, kan findes på \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
