Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: Causes consecutive blank lines to be squeezed into a single blank line. This is useful when viewing I<nroff> output.
uk: Спричиняє стиснення послідовних порожніх рядків до одного порожнього рядка. Це корисно під час перегляду виводу I<nroff>.

source: -S or --chop-long-lines
uk: -S або --chop-long-lines

source: Causes lines longer than the screen width to be chopped (truncated) rather than wrapped. That is, the portion of a long line that does not fit in the screen width is not displayed until you press RIGHT-ARROW. The default is to wrap long lines; that is, display the remainder on the next line.
uk: Спричиняє обрізання, а не перенесення рядків, довших за ширину екрана. Тобто частину довгого рядка, яка не поміщається в ширину екрана, не видно, доки не натиснуто Стрілку праворуч. Типово довгі рядки переносяться; тобто залишок виводиться в наступному рядку.

source: -tI<tag> or --tag=I<tag>
uk: -tI<мітка> або --tag=I<мітка>

source: The -t option, followed immediately by a TAG, will edit the file containing that tag. For this to work, tag information must be available; for example, there may be a file in the current directory called "tags", which was previously built by I<ctags>(1) or an equivalent command. If the environment variable LESSGLOBALTAGS is set, it is taken to be the name of a command compatible with I<global>(1), and that command is executed to find the tag. (See
uk: Використання параметра -t, за яким одразу вказано МІТКУ, призведе до редагування файла, що містить цю мітку. Щоб це спрацювало, мають бути доступними дані щодо мітки; наприклад, у поточному каталозі може бути файл із назвою «tags», який раніше було зібрано за допомогою I<ctags>(1) або подібної команди. Якщо встановлено значення змінної середовища LESSGLOBALTAGS, його буде використано як назву команди, сумісної із I<global>(1) і виконано відповідну команду для пошуку мітки. (Див.

source: The -t option may also be specified from within I<less> (using the - command) as a way of examining a new file. The command ":t" is equivalent to specifying -t from within I<less>.
uk: Параметр -t також можна вказати з самої I<less> (за допомогою команди -) — спосіб інспектування нового файла. Команда «:t» еквівалентна до визначення -t з самої I<less>.

source: -TI<tagsfile> or --tag-file=I<tagsfile>
uk: -TI<файл_міток> або --tag-file=I<файл_міток>

source: Specifies a tags file to be used instead of "tags".
uk: Визначає файл міток, які буде використано замість «міток».

source: -u or --underline-special
uk: -u або --underline-special

source: Causes backspaces and carriage returns to be treated as printable characters; that is, they are sent to the terminal when they appear in the input.
uk: Наказує обробляти символи забою та повернення каретки як друковані символи; таким чином, їх буде надіслано на термінал, якщо буде виявлено у вхідних даних.

source: -U or --UNDERLINE-SPECIAL
uk: -U або --UNDERLINE-SPECIAL

source: Causes backspaces, tabs, carriage returns and "formatting characters" (as defined by Unicode) to be treated as control characters; that is, they are handled as specified by the -r option.
uk: Наказує обробляти символи забою, табуляції, повернення каретки та «символи форматування» (як визначено у Unicode) як керівні символи; тобто, їх буде оброблено, як вказано параметром -r.

source: By default, if neither -u nor -U is given, backspaces which appear adjacent to an underscore character are treated specially: the underlined text is displayed using the terminal's hardware underlining capability. Also, backspaces which appear between two identical characters are treated specially: the overstruck text is printed using the terminal's hardware boldface capability. Other backspaces are deleted, along with the preceding character. Carriage returns immediately followed by a newline are deleted. Other carriage returns are handled as specified by the -r option. Unicode formatting characters, such as the Byte Order Mark, are sent to the terminal. Text which is overstruck or underlined can be searched for if neither -u nor -U is in effect.
uk: Типово, якщо не вказано ні -u, ні -U, символи забою, які є сусідніми із символом підкреслювання, буде оброблено особливо: підкреслений текст буде показано за допомогою апаратної можливості підкреслювання термінала. Крім того, символи забою, які буде використано між двома ідентичними символами, буде оброблено по-особливому: перекреслений текст буде виведено за допомогою апаратних можливостей зі створення напівжирного тексту термінала. Інші символи забою буде вилучено разом із попереднім символом. Символи повернення каретки, за якими одразу вказано символ нового рядка, буде вилучено. Інші символи повернення каретки буде оброблено так, як вказано параметром -r. Символи форматування Unicode, зокрема позначку порядку байтів (BOM), буде надіслано у термінал. Пошук у текстах із перекресленням або підкреслюванням може бути здійснено, якщо не діє ні параметр -u, ні параметр -U.

source: -V or --version
uk: -V або --version

source: Displays the version number of I<less>.
uk: Показує номер версії програми I<less>.

source: -w or --hilite-unread
uk: -w або --hilite-unread

source: -W or --HILITE-UNREAD
uk: -W або --HILITE-UNREAD

source: Like -w, but temporarily highlights the first new line after any forward movement command larger than one line.
uk: Подібний до -w, але тимчасово підсвічує перший новий рядок після будь-якої команди з пересування вперед на понад один рядок.

source: -xI<n>,...\& or --tabs=I<n>,...
uk: -xI<n>,...\& або --tabs=I<n>,...

source: Sets tab stops. If only one I<n> is specified, tab stops are set at multiples of I<n>. If multiple values separated by commas are specified, tab stops are set at those positions, and then continue with the same spacing as the last two. For example, I<-x9,17> will set tabs at positions 9, 17, 25, 33, etc. The default for I<n> is 8.
uk: Встановлює пункти табуляції. Якщо вказано лише один I<n>, пункти табуляції буде встановлено на позиціях, які кратні до I<n>. Якщо вказано декілька значень, які відокремлено комами, пункти табуляції буде встановлено у цих позиціях, а потім продовжено із тим самим інтервалом, що і між останніми двома пунктами. Наприклад, I<-x9,17> встановлює пункти табуляцій у позиціях 9, 17, 25, 33 тощо. Типовим значенням I<n> є 8.

source: -X or --no-init
uk: -X або --no-init

source: Disables sending the termcap initialization and deinitialization strings to the terminal. This is sometimes desirable if the deinitialization string does something unnecessary, like clearing the screen.
uk: Вимикає надсилання рядків ініціалізації та деініціалізації termcap до термінала. Це іноді є бажаним, якщо рядок деініціалізації робить щось непотрібне, зокрема очищує екран.

source: -yI<n> or --max-forw-scroll=I<n>
uk: -yI<n> або --max-forw-scroll=I<n>

source: Specifies a maximum number of lines to scroll forward. If it is necessary to scroll forward more than I<n> lines, the screen is repainted instead. The -c or -C option may be used to repaint from the top of the screen if desired. By default, any forward movement causes scrolling.
uk: Вказує максимальну кількість рядків для гортання вперед. Якщо потрібне гортання вперед на понад I<n> рядків, має бути перемальовано екран. Можна скористатися параметром -c або -C для перемальовування згори екрана, якщо це потрібно. Типово, гортання спричиняє будь-який рух вперед.

source: -zI<n> or --window=I<n> or -I<n>
uk: -zI<n>, або --window=I<n>, або -I<n>

source: Changes the default scrolling window size to I<n> lines. The default is one screenful. The z and w commands can also be used to change the window size. The "z" may be omitted for compatibility with some versions of I<more>. If the number I<n> is negative, it indicates I<n> lines less than the current screen size. For example, if the screen is 24 lines, I<-z-4> sets the scrolling window to 20 lines. If the screen is resized to 40 lines, the scrolling window automatically changes to 36 lines.
uk: Змінює типовий розмір вікна гортання до I<n> рядків. Типовим розміром є один цілий екран. Для зміни розміру вікна також можна скористатися командами z і w. Літеру «z» можна пропустити для сумісності із деякими версіями I<more>. Якщо число I<n> є від'ємним, воно вказує значення на I<n> рядків менше за поточний розмір екрана. Наприклад, якщо розмір екрана дорівнює 24 рядкам, I<-z-4> встановлює вікно гортання у 20 рядків. Якщо розмір екрана змінено на 40 рядків, розмір вікна гортання буде автоматично змінено на 36 рядків.

source: -"I<cc>\ or\ --quotes=I<cc>
uk: -"I<cc>\ або\ --quotes=I<cc>

source: Changes the filename quoting character. This may be necessary if you are trying to name a file which contains both spaces and quote characters. Followed by a single character, this changes the quote character to that character. Filenames containing a space should then be surrounded by that character rather than by double quotes. Followed by two characters, changes the open quote to the first character, and the close quote to the second character. Filenames containing a space should then be preceded by the open quote character and followed by the close quote character. Note that even after the quote characters are changed, this option remains -" (a dash followed by a double quote).
uk: Змінює символ екранування для назв файлів. У цьому може виникнути потреба, якщо ви намагаєтеся скористатися назвою файла, яка містить одразу пробіли і лапки. Якщо наступним вказано одинарний символ, який змінює символ екранування на вказаний символ. Назви файлів, які містять пробіл, після цього слід брати у пару вказаних символів, але подвійні лапки. Якщо наступними вказано два символи, початкові лапки буде замінено на перший символ, а завершальні лапки — на другий символ. Назви файлів, що містять пробіл після цього слід розміщувати між початковим символом екранування і кінцевим завершальним символом екранування. Зауважте, що навіть після зміни символів екранування, цей параметр лишає -" (дефіс, за яким вказано подвійні лапки).

source: -~ or --tilde
uk: -~ або --tilde

source: Normally lines after end of file are displayed as a single tilde (~). This option causes lines after end of file to be displayed as blank lines.
uk: Зазвичай, рядки після кінця файла буде показано як одинарну тильду (~). Використання цього параметра спричиняє показ рядків після кінця файла як порожніх рядків.

source: -# or --shift
uk: -# або --shift

source: Specifies the default number of positions to scroll horizontally in the RIGHTARROW and LEFTARROW commands. If the number specified is zero, it sets the default number of positions to one half of the screen width. Alternately, the number may be specified as a fraction of the width of the screen, starting with a decimal point: \&.5 is half of the screen width, \&.3 is three tenths of the screen width, and so on. If the number is specified as a fraction, the actual number of scroll positions is recalculated if the terminal window is resized, so that the actual scroll remains at the specified fraction of the screen width.
uk: Вказує типову кількість позицій горизонтального гортання у відповідь на команди «Стрілка праворуч» і «Стрілка ліворуч». Якщо вказаним числом є нуль, типова кількість позицій визначатиметься половиною ширини екрана. Крім того, число можна вказати як частку ширини екрана, якщо почати його з десяткової крапки: \&.5 — половина ширини екрана, \&.3 — три десятих ширини екрана тощо. Якщо число вказано як частку, кількість позицій гортання буде обчислюватися повторно кожного разу, коли змінюватиметься розмір вікна термінала, тому дійсна величина гортання лишатиметься рівною вказаній частці ширини екрана.

source: Normally, if the input file is renamed while an F command is executing, I<less> will continue to display the contents of the original file despite its name change. If --follow-name is specified, during an F command I<less> will periodically attempt to reopen the file by name. If the reopen succeeds and the file is a different file from the original (which means that a new file has been created with the same name as the original (now renamed) file), I<less> will display the contents of that new file.
uk: Зазвичай, якщо під час виконання команди F файл вхідних даних буде перейменовано, I<less> продовжуватиме показ вмісту початкового файла, хоча його назву було змінено. Якщо вказано --follow-name, під час виконання команди F I<less> періодично намагатиметься повторно відкрити файл за назвою. Якщо повторне відкриття буде успішним, а файл відрізнятиметься від початкового (це означає, що було створено новий файл із тією самою назвою, що і початковий (вже перейменований) файл), I<less> покаже вміст цього нового файла.

source: Subsequent search commands will be "incremental"; that is, I<less> will advance to the next line containing the search pattern as each character of the pattern is typed in.
uk: Наступні команди пошуку будуть «нарощувальними»; тобто I<less> переходитиме до наступного рядка, який містить взірець для пошуку із введенням кожного наступного символу взірця.

source: Sets the minimum width of the line number field when the -N option is in effect. The default is 7 characters.
uk: Встановлює мінімальну ширину поля номера рядка, якщо використано параметр -N. Типовою є ширина у 7 символів.

source: Enables mouse input: scrolling the mouse wheel down moves forward in the file, scrolling the mouse wheel up moves backwards in the file, and clicking the mouse sets the "#" mark to the line where the mouse is clicked. The number of lines to scroll when the wheel is moved can be set by the --wheel-lines option. Mouse input works only on terminals which support X11 mouse reporting, and on the Windows version of I<less>.
uk: Увімкнути введення даних з миші: гортання коліщатком миші вниз пересуватиме текст вперед у файлі, гортання коліщатком вгору пересуватиме позицію у напрямку назад у файлі, а клацання лівою кнопкою миші встановлюватиме позначку «#» до рядка, у якому було здійснено клацання кнопкою миші. Кількість рядків для гортання у відповідь на прокручування коліщатка можна встановити за допомогою параметра --wheel-lines. Введення з миші працює лише у терміналах, де передбачено підтримку звітування миші X11, та у версії I<less> для Windows.

source: Like --mouse, except the direction scrolled on mouse wheel movement is reversed.
uk: Подібний до --mouse, але зі зворотним напрямком гортання у відповідь на прокручування коліщатка миші.

source: Disables sending the keypad initialization and deinitialization strings to the terminal. This is sometimes useful if the keypad strings make the numeric keypad behave in an undesirable manner.
uk: Вимикає надсилання рядків ініціалізації та деініціалізації цифрової панелі клавіатури до термінала. Іноді корисно, якщо рядки цифрової панелі спричиняють небажану поведінку цієї панелі.

source: This option changes the behavior so that if a search string or file name is typed in, and the same string is already in the history list, the existing copy is removed from the history list before the new one is added. Thus, a given string will appear only once in the history list. Normally, a string may appear multiple times.
uk: Цей параметр змінює поведінку програми так, що при введенні рядка пошуку або назви файла, якщо такий рядок вже є у списку журналу, наявну копію буде вилучено зі списку журналу, перш ніж до неї буде додано новий рядок. Таким чином, у списку журналу завжди буде лише один запис заданого рядка. Зазвичай, рядок може траплятися у списку журналу декілька разів.

source: This option changes the character used to mark truncated lines. It may begin with a two-character attribute indicator like LESSBINFMT does. If there is no attribute indicator, standout is used. If set to "-", truncated lines are not marked.
uk: Цей параметр змінює символ, який буде використано для позначення обрізаних рядків. Може починатися із дволітерного індикатора атрибуту, подібно до LESSBINFMT. Якщо немає індикатора атрибуту, буде використано виокремлення. Якщо встановлено значення «-», обрізані рядки позначено не буде.

source: Save marks in the history file, so marks are retained across different invocations of I<less>.
uk: Зберегти позначки у файлі журналу, щоб тими самими позначками можна було користуватися під час різних викликів I<less>.

source: Sets the width of the status column when the -J option is in effect. The default is 2 characters.
uk: Встановлює ширину стовпчика стану, якщо використано параметр -J. Типовою є ширина у 2 символів.

source: This option changes the interpretations of options which follow this one. After the --use-backslash option, any backslash in an option string is removed and the following character is taken literally. This allows a dollar sign to be included in option strings.
uk: Цей параметр змінює інтерпретацію параметрів, які вказано після нього. Після параметра --use-backslash усі символи зворотної похилої риски у рядку параметрів буде вилучено, а усі наступні символи буде використано буквально, без обробки. Це надає змогу включати до рядків параметрів символ долара.

source: Set the number of lines to scroll when the mouse wheel is scrolled and the --mouse or --MOUSE option is in effect. The default is 1 line.
uk: Встановити кількість рядків гортання при прокручування коліщатка миші, якщо вказано параметр --mouse або --MOUSE. Типовим значенням є 1 рядок.

source: A command line argument of "--" marks the end of option arguments. Any arguments following this are interpreted as filenames. This can be useful when viewing a file whose name begins with a "-" or "+".
uk: Аргумент командного рядка "--" позначає кінець аргументів параметра. Будь-які наступні аргументи інтерпретуються як назви файлів. Це може бути корисним під час перегляду файла, назва якого починається з «-» або «+».

source: If a command line option begins with B<+>, the remainder of that option is taken to be an initial command to I<less>. For example, +G tells I<less> to start at the end of the file rather than the beginning, and +/xyz tells it to start at the first occurrence of "xyz" in the file. As a special case, +E<lt>numberE<gt> acts like +E<lt>numberE<gt>g; that is, it starts the display at the specified line number (however, see the caveat under the "g" command above). If the option starts with ++, the initial command applies to every file being viewed, not just the first one. The + command described previously may also be used to set (or change) an initial command for every file.
uk: Якщо параметр командного рядка починається з B<+>, залишок цього параметра вважається початковою командою для I<less>. Наприклад, +G змушує I<less> почати з кінця файла, а не з початку, а +/xyz змушує почати з першого входження "xyz" у файл. Як особливий випадок, +E<lt>числоE<gt> діє як +E<lt>числоE<gt>g; тобто, показ починається зі вказаного номера рядка (однак дивіться застереження до команди "g" вище). Якщо параметр починається з ++, початкова команда застосовується до кожного файла, який переглядається, а не лише до першого. Команду +, описану раніше, також можна використати для встановлення (або змінення) початкової команди для кожного файла.

source: LINE EDITING
uk: РЕДАГУВАННЯ РЯДКІВ

source: When entering a command line at the bottom of the screen (for example, a filename for the :e command, or the pattern for a search command), certain keys can be used to manipulate the command line. Most commands have an alternate form in [ brackets ] which can be used if a key does not exist on a particular keyboard. (Note that the forms beginning with ESC do not work in some MS-DOS and Windows systems because ESC is the line erase character.) Any of these special keys may be entered literally by preceding it with the "literal" character, either ^V or ^A. A backslash itself may also be entered literally by entering two backslashes.
uk: Під час уведення командного рядка в нижній частині екрана (наприклад, назви файла для команди :e або шаблону для команди пошуку), для керування командним рядком можна використовувати деякі клавіші. Більшість команд мають альтернативну форму в [ дужках ], яку можна використовувати, якщо клавіші не існує на певній клавіатурі. (Зауважте, що форми, які починаються з ESC, не працюють у деяких системах MS-DOS і Windows, оскільки ESC є символом стирання рядка.) Будь-яку з цих спеціальних клавіш можна вводити буквально, додаючи літеру, наприклад, ^V. або ^A. Саму зворотну похилу риску також можна ввести буквально, ввівши дві зворотні похилі риски.

source: LEFTARROW [ ESC-h ]
uk: Стрілка ліворуч [ ESC-h ]

source: Move the cursor one space to the left.
uk: Пересунути курсор на одну позицію ліворуч.

source: RIGHTARROW [ ESC-l ]
uk: Стрілка праворуч [ ESC-l ]

source: Move the cursor one space to the right.
uk: Пересунути курсор на одну позицію праворуч.

source: ^LEFTARROW [ ESC-b or ESC-LEFTARROW ]
uk: ^Стрілка ліворуч [ ESC-b або ESC-Стрілка ліворуч ]

source: (That is, CONTROL and LEFTARROW simultaneously.) Move the cursor one word to the left.
uk: (Тобто CTRL і Стрілка ліворуч одночасно.) Пересунути курсор на одне слово ліворуч.

source: ^RIGHTARROW [ ESC-w or ESC-RIGHTARROW ]
uk: ^Стрілка праворуч [ ESC-w або ESC-Стрілка праворуч ]

source: (That is, CONTROL and RIGHTARROW simultaneously.) Move the cursor one word to the right.
uk: (Тобто CTRL і Стрілка праворуч одночасно.) Пересунути курсор на одне слово праворуч.

source: Move the cursor to the beginning of the line.
uk: Пересуває курсор на початок рядка.

source: Move the cursor to the end of the line.
uk: Пересуває курсор у кінець рядка.

source: Delete the character to the left of the cursor, or cancel the command if the command line is empty.
uk: Вилучити символ ліворуч від курсора або скасувати команду, якщо рядок команди є порожнім.

source: DELETE or [ ESC-x ]
uk: DELETE або [ ESC-x ]

source: Delete the character under the cursor.
uk: Вилучити символ під курсором.

source: (That is, CONTROL and BACKSPACE simultaneously.) Delete the word to the left of the cursor.
uk: (Тобто CTRL і BACKSPACE одночасно.) Вилучити слово ліворуч від курсора.

source: ^DELETE [ ESC-X or ESC-DELETE ]
uk: ^DELETE [ ESC-X або ESC-DELETE ]

source: (That is, CONTROL and DELETE simultaneously.) Delete the word under the cursor.
uk: (Тобто CTRL і DELETE одночасно.) Вилучити слово під курсором.

source: UPARROW [ ESC-k ]
uk: Стрілка вгору [ ESC-k ]

source: Retrieve the previous command line. If you first enter some text and then press UPARROW, it will retrieve the previous command which begins with that text.
uk: Отримати попередній рядок команди. Якщо ви спочатку введете якийсь текст, а потім натиснете стрілку вгору, програма покаже попередню команду, яка починається із введеного тексту.

source: DOWNARROW [ ESC-j ]
uk: Стрілка вниз [ ESC-j ]

source: Retrieve the next command line. If you first enter some text and then press DOWNARROW, it will retrieve the next command which begins with that text.
uk: Отримати наступний рядок команди. Якщо ви спочатку введете якийсь текст, а потім натиснете стрілку вниз, програма покаже наступну команду, яка починається із введеного тексту.
