Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: The uppercase letters can be used only when the --use-color option is enabled. When text color is specified by both an uppercase letter and a lowercase letter, the uppercase letter takes precedence. For example, error messages are normally displayed as standout text. So if both "s" and "E" are given a color, the "E" color applies to error messages, and the "s" color applies to other standout text. The "d" and "u" letters refer to bold and underline text formed by overstriking with backspaces (see the -u option), not to text using ANSI escape sequences with the -R option.
uk: Літери верхнього регістру можна використовувати, лише якщо використано параметр --use-color. Якщо колір тексту буде вказано одразу літерою верхнього регістру і літерою нижнього регістру, вищий пріоритет матиме літера верхнього регістру. Наприклад, повідомлення про помилку, зазвичай, буде показано виокремленим текстом. Отже, якщо буде одразу вказано кольори «s» і «E», до повідомлень про помилки буде застосовано колір «E», а колір «s» буде застосовано до іншого виокремленого тексту. Літери «d» і «u» стосуються напівжирного та підкресленого тексту, який формується перекресленням літер символом підкреслювання (див. параметр -u), а не до тексту з використанням керівних послідовностей ANSI із параметром -R.

source: I<color> is either a 4-bit color string or an 8-bit color string:
uk: Значенням I<колір> має бути або 4-бітовий рядок кольору, або 8-бітовий рядок кольору:

source: A 4-bit color string is zero, one or two characters, where the first character specifies the foreground color and the second specifies the background color as follows:
uk: 4-бітовий рядок може бути нулем, одним або двома символами, перший з яких визначає колір тексту, а другий — колір тла (фоновий колір) ось так:

source: Blue
uk: Синій

source: Cyan
uk: Блакитний

source: Green
uk: Зелений

source: Black
uk: Чорний

source: Magenta
uk: Бузковий

source: White
uk: Білий

source: Yellow
uk: Жовтий

source: The corresponding upper-case letter denotes a brighter shade of the color. For example, -DNGk displays line numbers as bright green text on a black background, and -DEbR displays error messages as blue text on a bright red background. If either character is a "-" or is omitted, the corresponding color is set to that of normal text.
uk: Відповідні літери верхнього регістру позначають світліші відтінки кольорів. Наприклад, використання -DNGk призводить до показу номерів рядків світло-зеленим кольором на чорному тлі, а використання -DEbR призводить до показу повідомлень про помилки синім кольором на яскраво-червоному тлі. Якщо якийсь із символів замінено на «-» або пропущено, для відповідного кольору буде використано колір звичайного тексту.

source: An 8-bit color string is one or two decimal integers separated by a dot, where the first integer specifies the foreground color and the second specifies the background color. Each integer is a value between 0 and 255 inclusive which selects a "CSI 38;5" color value (see
uk: Запис 8-бітового кольору складається із одного або двох десяткових цілих чисел, які відокремлено крапкою. Перше число визначає колір тексту, а друге — колір тла. Кожне з цих цілих чисел є значенням від 0 до 255, включно, яке вибирає значення кольору «CSI 38;5» (див.

source: If either integer is a "-" or is omitted, the corresponding color is set to that of normal text. On MS-DOS versions of I<less>, 8-bit color is not supported; instead, decimal values are interpreted as 4-bit CHAR_INFO.Attributes values (see
uk: Якщо якесь із цілих чисел замінено на «-» або пропущено, для відповідного кольору буде використано колір звичайного тексту. У версіях I<less> для MS-DOS не передбачено підтримки 8-бітових кольорів; замість цього десяткові значення буде оброблено як 4-бітові CHAR_INFO. Значення атрибутів (див.

source: -e or --quit-at-eof
uk: -e або --quit-at-eof

source: Causes I<less> to automatically exit the second time it reaches end-of-file. By default, the only way to exit I<less> is via the "q" command.
uk: Спричиняє автоматичне завершення роботи I<less>, коли після другого отримання символу кінця файла. Типово, єдиним способом виходу з I<less> є команда «q».

source: -E or --QUIT-AT-EOF
uk: -E або --QUIT-AT-EOF

source: Causes I<less> to automatically exit the first time it reaches end-of-file.
uk: Спричиняє автоматичне завершення роботи I, коли після першого отримання символу кінця файла.

source: -f or --force
uk: -f або --force

source: Forces non-regular files to be opened. (A non-regular file is a directory or a device special file.) Also suppresses the warning message when a binary file is opened. By default, I<less> will refuse to open non-regular files. Note that some operating systems will not allow directories to be read, even if -f is set.
uk: Наказує відкривати файли, які не є звичайними. (Незвичайний файл є файлом каталогу або особливим файлом пристрою.) Також придушити повідомлення-попередження при відкритті двійкового файла. Типово, I<less> відмовляється відкривати незвичайні файли. Зауважте, що у деяких операційних системах не дозволено читати каталоги, навіть якщо встановлено параметр -f.

source: -F or --quit-if-one-screen
uk: -F або --quit-if-one-screen

source: Causes I<less> to automatically exit if the entire file can be displayed on the first screen.
uk: Спричиняє автоматичний вихід з I<less>, якщо на першому екрані можна буде показати увесь файл.

source: -g or --hilite-search
uk: -g або --hilite-search

source: Normally, I<less> will highlight ALL strings which match the last search command. The -g option changes this behavior to highlight only the particular string which was found by the last search command. This can cause I<less> to run somewhat faster than the default.
uk: Зазвичай, I<less> підсвічуватиме УСІ рядки, які відповідають критерію останньої команди пошуку. Використання параметра -g змінює поведінку програми: вона підсвічує лише один певний рядок, який було знайдено у результаті останньої команди пошуку. Це, типово, трохи пришвидшує роботу I<less>.

source: -G or --HILITE-SEARCH
uk: -G або --HILITE-SEARCH

source: The -G option suppresses all highlighting of strings found by search commands.
uk: Використання параметра -G придушує усе підсвічування рядків, які буде знайдено внаслідок застосування команд пошуку.

source: -hI<n> or --max-back-scroll=I<n>
uk: -hI<n> або --max-back-scroll=I<n>

source: Specifies a maximum number of lines to scroll backward. If it is necessary to scroll backward more than I<n> lines, the screen is repainted in a forward direction instead. (If the terminal does not have the ability to scroll backward, -h0 is implied.)
uk: Визначає максимальну кількість рядків для гортання назад. Якщо потрібно буде виконати гортання назад на кількість рядків, яка перевищує I<n>, програма перемалює екран у напрямку вперед. (Якщо у терміналі не передбачено можливості гортання назад, неявним чином буде встановлено -h0.)

source: -i or --ignore-case
uk: -i або --ignore-case

source: Causes searches to ignore case; that is, uppercase and lowercase are considered identical. This option is ignored if any uppercase letters appear in the search pattern; in other words, if a pattern contains uppercase letters, then that search does not ignore case.
uk: Наказує ігнорувати регістр символів під час пошуку. Таким чином, літери верхнього та нижнього регістру вважатимуться однаковими. Цей параметр буде проігноровано, якщо у взірці для пошуку буде виявлено хоч одну літеру верхнього регістру. Іншими словами, якщо у взірці будуть великі літери, під час пошуку регістр символів братиметься до уваги.

source: -I or --IGNORE-CASE
uk: -I або --IGNORE-CASE

source: Like -i, but searches ignore case even if the pattern contains uppercase letters.
uk: Подібний до -i, але наказує ігнорувати регістр символів, навіть якщо у взірці містяться літери верхнього регістру.

source: -jI<n> or --jump-target=I<n>
uk: -jI<n> або --jump-target=I<n>

source: Specifies a line on the screen where the "target" line is to be positioned. The target line is the line specified by any command to search for a pattern, jump to a line number, jump to a file percentage or jump to a tag. The screen line may be specified by a number: the top line on the screen is 1, the next is 2, and so on. The number may be negative to specify a line relative to the bottom of the screen: the bottom line on the screen is -1, the second to the bottom is -2, and so on. Alternately, the screen line may be specified as a fraction of the height of the screen, starting with a decimal point: \&.5 is in the middle of the screen, \&.3 is three tenths down from the first line, and so on. If the line is specified as a fraction, the actual line number is recalculated if the terminal window is resized, so that the target line remains at the specified fraction of the screen height. If any form of the -j option is used, repeated forward searches (invoked with "n" or "N") begin at the line immediately after the target line, and repeated backward searches begin at the target line, unless changed by -a or -A. For example, if "-j4" is used, the target line is the fourth line on the screen, so forward searches begin at the fifth line on the screen. However nonrepeated searches (invoked with "/" or "?") always begin at the start or end of the current screen respectively.
uk: Вказує рядок на екрані, де має бути розташовано рядок «призначення». Рядок призначення — це рядок, який вказано будь-якою командою для пошуку взірця, переходу до рядка з вказаним номером, переходу до позиції у файлі за відсотками або переходу до мітки. Рядок на екрані має бути вказано за номером: верхній рядок має номер 1, наступний — 2 тощо. Номер може бути від'ємним, якщо рядок вказано відносно нижнього краю екрана: нижній рядок на екрані має номер -1, другий від нижнього краю — номер -2 тощо. Крім того, рядок на екрані можна задати як частку від висоти екрана, запис має починатися з десяткової крапки: \&.5 — середина екрана, \&.3 — три десятих вниз від першого рядка тощо. Якщо рядок вказано за часткою, справжній номер рядка буде переобчислено, якщо розмір вікна термінала буде змінено, так, що рядок призначення лишився на позиції, яку вказано часткою від висоти екрана. Якщо використано будь-яку з форм параметра -j, повторні пошуки вперед (викликані за допомогою команд «n» і «N») розпочинатимуться одразу після рядка призначення, а повторні пошуки назад розпочинатимуться з рядка призначення, якщо таку поведінку не змінено параметрами -a або -A. Наприклад, якщо використано «-j4», рядком призначення буде четвертий рядок на екрані, отже пошук вперед починатимуться з п'ятого рядка на екрані. Втім, неповторювані пошуки (які викликано командами «/» та «?») завжди починатимуться з початку або кінця поточного екрана, відповідно.

source: -J or --status-column
uk: -J або --status-column

source: Displays a status column at the left edge of the screen. The status column shows the lines that matched the current search, and any lines that are marked (via the m or M command).
uk: Наказує показувати стовпчик стану на лівому краю екрана. У стовпчику стану буде показано рядки, які відповідають поточному критерію пошуку та усі позначені рядки (за допомогою команди m або M).

source: -kI<filename> or --lesskey-file=I<filename>
uk: -kI<назва_файла> або --lesskey-file=I<назва_файла>

source: Causes I<less> to open and interpret the named file as a I<lesskey>(1) binary file. Multiple -k options may be specified. If the LESSKEY or LESSKEY_SYSTEM environment variable is set, or if a lesskey file is found in a standard place (see KEY BINDINGS), it is also used as a I<lesskey> file.
uk: Наказує I<less> відкрити і обробити іменований файл як двійковий файл I<lesskey>(1). Можна вказати декілька параметрів -k в одному рядку команди. Якщо встановлено змінні середовища LESSKEY або LESSKEY_SYSTEM або якщо файл lesskey зберігається у стандартному місці (див. ПРИВ'ЯЗКА КЛАВІШ), його також буде використано як файл I<lesskey>.

source: --lesskey-src=I<filename>
uk: --lesskey-src=I<назва_файла>

source: Causes I<less> to open and interpret the named file as a I<lesskey>(1) source file. If the LESSKEYIN or LESSKEYIN_SYSTEM environment variable is set, or if a lesskey source file is found in a standard place (see KEY BINDINGS), it is also used as a I<lesskey source> file. Prior to version 582, the I<lesskey> program needed to be run to convert a I<lesskey source> file to a I<lesskey binary> file for I<less> to use. Newer versions of I<less> read the I<lesskey source> file directly and ignore the binary file if the source file exists.
uk: Наказує I<less> відкрити і обробити іменований файл як файл початкового коду I<lesskey>(1). Якщо встановлено значення змінної середовища LESSKEYIN або LESSKEYIN_SYSTEM або файл початкового коду lesskey буде виявлено у стандартному місці (див. ПРИВ'ЯЗКА КЛАВІШ), відповідний файл буде також використано як файл I<початкового коду lesskey>. До версії 582 слід було запустити програму I<lesskey>, щоб перетворити файл I<початкового коду lesskey> на I<двійковий файл lesskey> для використання у I<less>. Новіші версії I<less> читають файл I<початковоо коду lesskey> безпосередньо і ігнорує двійковий файл, якщо існує файл початкового коду.

source: -K or --quit-on-intr
uk: -K або --quit-on-intr

source: Causes I<less> to exit immediately (with status 2) when an interrupt character (usually ^C) is typed. Normally, an interrupt character causes I<less> to stop whatever it is doing and return to its command prompt. Note that use of this option makes it impossible to return to the command prompt from the "F" command.
uk: Наказує I<less> негайно завершити роботу (зі станом 2), якщо буде введено символ переривання (зазвичай, ^C). Типово, символ переривання наказує I<less> перервати поточну дію і повернутися до рядка запиту щодо команди. Зауважте, що використання цього параметра робить неможливим повернення до запиту команди за допомогою команди «F».

source: -L or --no-lessopen
uk: -L або --no-lessopen

source: Ignore the LESSOPEN environment variable (see the INPUT PREPROCESSOR section below). This option can be set from within I<less>, but it will apply only to files opened subsequently, not to the file which is currently open.
uk: Ігнорувати змінну середовища LESSOPEN (див. розділ ПОПЕРЕДНЯ ОБРОБКА ВХІДНИХ ДАНИХ нижче). Цей параметр можна вказати з самої I<less>, але тоді його буде застосовано лише до наступних відкритих файлів, а не до поточного відкритого файла.

source: -m or --long-prompt
uk: -m або --long-prompt

source: Causes I<less> to prompt verbosely (like I<more>), with the percent into the file. By default, I<less> prompts with a colon.
uk: Наказує I<less> показувати докладний запит щодо команди (подібно до I<more>), із часткою у файлі у відсотках. Типовим запитом у I<less> є проста двокрапка.

source: -M or --LONG-PROMPT
uk: -M або --LONG-PROMPT

source: Causes I<less> to prompt even more verbosely than I<more>.
uk: Наказує I<less> робити запити, які є докладнішими за запити I<more>.

source: -n or --line-numbers
uk: -n або --line-numbers

source: Suppresses line numbers. The default (to use line numbers) may cause I<less> to run more slowly in some cases, especially with a very large input file. Suppressing line numbers with the -n option will avoid this problem. Using line numbers means: the line number will be displayed in the verbose prompt and in the = command, and the v command will pass the current line number to the editor (see also the discussion of LESSEDIT in PROMPTS below).
uk: Придушити показ номерів рядків. Типова поведінка (показувати номери рядків) може спричиняти уповільнення роботи I<less> у деяких випадках, особливо, якщо розмір файла вхідних даних є дуже великим. Придушення показу номерів рядків за допомогою параметра -n надає змогу уникнути цієї проблеми. Використання номерів рядків означає, що номер рядка буде показано у докладному запиті щодо команди і у команді =, команда v передаватиме номер поточного рядка редактору (див. також обговорення змінної LESSEDIT у розділі ЗАПИТИ нижче).

source: -N or --LINE-NUMBERS
uk: -N або --LINE-NUMBERS

source: Causes a line number to be displayed at the beginning of each line in the display.
uk: Наказує програмі показувати на початку кожного рядка на дисплеї його номер.

source: -oI<filename> or --log-file=I<filename>
uk: -oI<назва_файла> або --log-file=I<назва_файла>

source: Causes I<less> to copy its input to the named file as it is being viewed. This applies only when the input file is a pipe, not an ordinary file. If the file already exists, I<less> will ask for confirmation before overwriting it.
uk: Наказує I<less> скопіювати вхідні дані до іменованого файла так, наче його переглядають. Працює, лише якщо вхідний файл є каналом даних, а не звичайним файлом. Якщо файл вже існує, I<less> попросить про підтвердження, перш ніж перезаписувати його.

source: -OI<filename> or --LOG-FILE=I<filename>
uk: -OI<назва_файла> або --LOG-FILE=I<назва_файла>

source: The -O option is like -o, but it will overwrite an existing file without asking for confirmation.
uk: Параметр -O подібний до параметра -o, але призводить до пперезапису наявного файла без прохань щодо підтвердження дії.

source: If no log file has been specified, the -o and -O options can be used from within I<less> to specify a log file. Without a file name, they will simply report the name of the log file. The "s" command is equivalent to specifying -o from within I<less>.
uk: Якщо не було вказано файла журналу, можна скористатися параметрами -o і -O з самої I<less>, щоб вказати файл журналу. Без назви файла, використання цих параметрів призведе просто до виведення назви файла журналу. Команда «s» є еквівалентом визначення -o у самій I<less>.

source: -pI<pattern> or --pattern=I<pattern>
uk: -pI<взірець> або --pattern=I<взірець>

source: The -p option on the command line is equivalent to specifying +/I<pattern>; that is, it tells I<less> to start at the first occurrence of I<pattern> in the file.
uk: Параметр -p у командному рядку є еквівалентом +/I<взірець>; тобто він повідомляє I<less>, що слід розпочати з першого відповідника I<взірця> у файлі.

source: -PI<prompt> or --prompt=I<prompt>
uk: -PI<запит> або --prompt=I<запит>

source: All prompt strings consist of a sequence of letters and special escape sequences. See the section on PROMPTS for more details.
uk: В усіх рядках запитів міститься послідовність літер та особливі керівні послідовності. Докладніше про це можна дізнатися з розділу «ЗАПИТИ».

source: -q or --quiet or --silent
uk: -q, або --quiet, або --silent

source: Causes moderately "quiet" operation: the terminal bell is not rung if an attempt is made to scroll past the end of the file or before the beginning of the file. If the terminal has a "visual bell", it is used instead. The bell will be rung on certain other errors, such as typing an invalid character. The default is to ring the terminal bell in all such cases.
uk: Викликає помірно «тиху» роботу: дзвінок термінала не дзвонить за спроби прокрутити після кінця файла або перед початком файла. Натомість використовується «візуальний дзвінок», якщо термінал має його. У разі деяких інших помилок, як-от введення недопустимого символу, звучатиме дзвінок. Типово у всіх таких випадках звучить дзвінок термінала.

source: -Q or --QUIET or --SILENT
uk: -Q, або --QUIET, або --SILENT

source: Causes totally "quiet" operation: the terminal bell is never rung. If the terminal has a "visual bell", it is used in all cases where the terminal bell would have been rung.
uk: Викликає повністю «тиху» роботу: дзвінок термінала не звучить ніколи. Якщо термінал має «візуальний дзвінок», він використовується у всіх випадках, коли має звучати дзвінок термінала.

source: -r or --raw-control-chars
uk: -r або --raw-control-chars

source: Causes "raw" control characters to be displayed. The default is to display control characters using the caret notation; for example, a control-A (octal 001) is displayed as "^A". Warning: when the -r option is used, I<less> cannot keep track of the actual appearance of the screen (since this depends on how the screen responds to each type of control character). Thus, various display problems may result, such as long lines being split in the wrong place.
uk: Вмикає показ «необроблених» керівних символів. Типово керівні символи позначаються дашком; наприклад, Ctrl-A (вісімкове число 001) виводиться як "^A". Попередження: коли використовується параметр -r, I<less> не може відстежувати фактичного вигляду екрана (оскільки це залежить від того, як екран реагує на кожен з керувальних символів). Таким чином, можуть виникнути різні проблеми з виведенням, наприклад, довгі рядки будуть розділені не в тому місці.

source: USE OF THE -r OPTION IS NOT RECOMMENDED.
uk: НЕ РЕКОМЕНДУЄМО КОРИСТУВАТИСЯ ПАРАМЕТРОМ -r.

source: -R or --RAW-CONTROL-CHARS
uk: -R або --RAW-CONTROL-CHARS

source: Like -r, but only ANSI "color" escape sequences and OSC 8 hyperlink sequences are output in "raw" form. Unlike -r, the screen appearance is maintained correctly, provided that there are no escape sequences in the file other than these types of escape sequences. Color escape sequences are only supported when the color is changed within one line, not across lines. In other words, the beginning of each line is assumed to be normal (non-colored), regardless of any escape sequences in previous lines. For the purpose of keeping track of screen appearance, these escape sequences are assumed to not move the cursor.
uk: Подібно до -r, але лише escape-послідовності ANSI «кольору» і послідовності гіперпосилань OSC 8 виводяться у «сирому» вигляді. На відміну від -r, вигляд екрана підтримується правильно, за умови, що у файлі немає escape-послідовностей відмінних від цих типів. Escape-послідовності кольору підтримуються лише тоді, коли колір змінюється в межах одного рядка, а не через рядки. Іншими словами, початок кожного рядка вважається нормальним (не забарвленим), незалежно від будь-яких escape-послідовностей у попередніх рядках. З метою відстеження вигляду екрана передбачається, що ці escape-послідовності не переміщують курсора.

source: OSC 8 hyperlinks are sequences of the form:
uk: Гіперпосилання OSC 8 є послідовностями у такій формі:

source: The terminating sequence may be either a BEL character (\e7) or the two-character sequence "ESC \e".
uk: Завершальна послідовність може бути символом BEL (\e7) або послідовністю з двох "ESC \e".

source: ANSI color escape sequences are sequences of the form:
uk: Колірні escape-послідовності ANSI мають такий вигляд:

source: where the "...\&" is zero or more color specification characters. You can make I<less> think that characters other than "m" can end ANSI color escape sequences by setting the environment variable LESSANSIENDCHARS to the list of characters which can end a color escape sequence. And you can make I<less> think that characters other than the standard ones may appear between the ESC and the m by setting the environment variable LESSANSIMIDCHARS to the list of characters which can appear.
uk: де «...\&» — нуль або більше символів специфікації кольору. Ви можете наказати I<less> вважати, що керівні послідовності кольорів ANSI можуть завершуватися символами, відмінними від «m», встановивши для змінної середовища LESSANSIENDCHARS значення списку символів, які можуть завершувати керівну послідовність кольору. Ви також можете наказати I<less> вважати, що між ESC і «m» можуть бути символи, відмінні від стандартних, встановивши для змінної середовища LESSANSIMIDCHARS значення списку символів, які може бути для цього використано.

source: -s or --squeeze-blank-lines
uk: -s або --squeeze-blank-lines
