Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: User's search path (used to find a lesskey file on MS-DOS and OS/2 systems).
uk: Шлях пошуку користувача (буде використано для пошуку файла lesskey в операційних системах MS-DOS і OS/2).

source: The shell used to execute the !\& command, as well as to expand filenames.
uk: Оболонка, яку буде використано для виконання команди !\&, а також для розгортання назв файлів.

source: The type of terminal on which I<less> is being run.
uk: Тип термінала, на якому запущено I<less>.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: less is part of the GNU project and is free software. You can redistribute it and/or modify it under the terms of either (1) the GNU General Public License as published by the Free Software Foundation; or (2) the Less License. See the file README in the less distribution for more details regarding redistribution. You should have received a copy of the GNU General Public License along with the source for less; see the file COPYING. If not, write to the Free Software Foundation, 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA. You should also have received a copy of the Less License; see the file LICENSE.
uk: less є частиною проєкту GNU. Програма є вільним програмним забезпеченням. Ви можете поширювати і/або вносити зміни до її тексту за умов дотримання або (1) загальної громадської ліцензії GNU (GNU General Public License) відповідно до оприлюдненого Free Software Foundation тексту цієї ліцензії або (2) ліцензії Less. Див. файл README у дистрибутиві less, щоб дізнатися більше про поширення програми. Ви маєте отримати копію загальної громадської ліцензії GNU (GNU General Public License) разом із початковим кодом less; див. файл COPYING. Якщо ви не отримали цієї копії, напишіть до Free Software Foundation, 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA. Ви також маєте отримати копію ліцензії Less; див. файл LICENSE.

source: less is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
uk: less розповсюджується зі сподіванням, що програма буде корисною, але БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ; не гарантується навіть ПРИДАТНІСТЬ чи ВІДПОВІДНІСТЬ ПЕВНІЙ МЕТІ. Для отримання додаткової інформації ознайомтесь з GNU General Public License.

source: AUTHOR
uk: АВТОР

source: Report bugs at https://github.com/gwsw/less/issues.
uk: Про вади можна повідомити на сторінці https://github.com/gwsw/less/issues.

source: For more information, see the less homepage at
uk: Щоб дізнатися більше, ознайомтеся із домашньою сторінкою less за адресою

source: Version 590: 03 Jun 2021
uk: Версія 590: 3 червня 2021 року

source: I<Less> is a program similar to I<more>(1), but it has many more features. I<Less> does not have to read the entire input file before starting, so with large input files it starts up faster than text editors like I<vi>(1). I<Less> uses termcap (or terminfo on some systems), so it can run on a variety of terminals. There is even limited support for hardcopy terminals. (On a hardcopy terminal, lines which should be printed at the top of the screen are prefixed with a caret.)
uk: I<Less> — програма, подібна до I<more>(1), але така, що має набагато ширші можливості. Крім того, I<less> не потребує читання усього файла вхідних даних перед початком обробки, тому для великих файлів вхідних даних програма запускається швидше за текстові редактори, подібні до I<vi>(1). У I<Less> використано termcap (або terminfo у деяких системах), тому програма може працювати у широкому спектрі терміналів. Реалізовано навіть обмежену підтримку друкувальних терміналів. (У друкувальних терміналах, рядки, які має бути надруковано у верхній частині екрана мають префікс знак вставляння.)

source: Scroll forward, and keep trying to read when the end of file is reached. Normally this command would be used when already at the end of the file. It is a way to monitor the tail of a file which is growing while it is being viewed. (The behavior is similar to the "tail -f" command.) To stop waiting for more data, enter the interrupt character (usually ^C). On some systems you can also use ^X.
uk: Гортати вперед і намагатися читати місце кінця файла. Зазвичай, цією командою користуються, коли позиція вже близька до кінця файла. Це спосіб стежити за кінцем файла, який зростає під час його перегляду. (Поведінка є подібною до поведінки команди «tail -f».) Щоб зупинити очікування на додаткові дані, введіть символ переривання (зазвичай, ^C). У деяких системах ви можете також скористатися ^X.

source: If a right curly bracket appears in the bottom line displayed on the screen, the } command will go to the matching left curly bracket. The matching left curly bracket is positioned on the top line of the screen. If there is more than one right curly bracket on the top line, a number N may be used to specify the N-th bracket on the line.
uk: Якщо у нижньому рядку, який показано на екрані, буде права фігурна дужка, команда } призведе до переходу до відповідної лівої фігурної дужки. Гортання буде виконано так, щоб відповідна ліва фігурна дужка опинилася у верхньому рядку екрана. Якщо у верхньому рядку буде декілька правих фігурних дужок, числом N можна скористатися для визначення N-ої дужки на рядку.

source: WRAP around the current file. That is, if the search reaches the end of the current file without finding a match, the search continues from the first line of the current file up to the line where it started.
uk: Переходити циклічно у поточному файлі. Тобто, якщо пошук завершується на кінці поточного файла без знаходження відповідника, пошук продовжується з першого рядка поточного файла до рядка, на якому його було розпочато.

source: A lowercase letter may be followed by a + to indicate that both the normal format change and the specified color should both be used. For example, -Dug displays underlined text as green without underlining; the green color has replaced the usual underline formatting. But -Du+g displays underlined text as both green and in underlined format.
uk: Після літери нижнього регістру може бути вказано + для позначення того, що одразу слід застосувати звичайну зміну формату та вказаний колір. Наприклад, -Dug призведе до показу підкресленого тексту зеленим кольором без підкреслювання; зелений колір буде замінено звичайним форматуванням із підкреслюванням. Але -Du+g призведе до показу підкресленого тексту одразу зеленим кольором і підкреслюванням у форматуванні.

source: Provides a way to tailor the three prompt styles to your own preference. This option would normally be put in the LESS environment variable, rather than being typed in with each I<less> command. Such an option must either be the last option in the LESS variable, or be terminated by a dollar sign. -Ps followed by a string changes the default (short) prompt to that string. -Pm changes the medium (-m) prompt. -PM changes the long (-M) prompt. -Ph changes the prompt for the help screen. -P= changes the message printed by the = command. -Pw changes the message printed while waiting for data (in the F command).
uk: Надає змогу скоригувати три стилі запитів за вашими уподобаннями. Зазвичай, цей параметр варто додати до змінної середовища LESS, а не вводити кожного разу разом із командою I<less>. Цей параметр має бути або останнім параметром у змінній LESS, або завершуватися символом долара. -Ps, за яким вказано рядок, змінює типовий (короткий) запит на вказаний рядок. -Pm змінює середній (-m) запит. -PM змінює довгий (-M) запит. -Ph змінює запит для екрана довідки. -P= змінює повідомлення, яке буде виведено у відповідь на команду =. -Pw змінює повідомлення, яке буде виведено під час очікування на дані (у команді F).

source: Temporarily highlights the first "new" line after a forward movement of a full page. The first "new" line is the line immediately following the line previously at the bottom of the screen. Also highlights the target line after a g or p command. The highlight is removed at the next command which causes movement. The entire line is highlighted, unless the -J option is in effect, in which case only the status column is highlighted.
uk: Тимчасово підсвічує перший «новий» рядок після пересування вперед на цілу сторінку. Перший «новий» рядок — рядок, за яким безпосередньо слідує рядок, кий раніше був найнижчим на сторінці. Також підсвічує рядок призначення після команди g або p. Підсвічування буде вилучено після наступної команди, яка спричинить пересування. Буде підсвічено увесь рядок, якщо не діє параметр -J. Якщо ж цей параметр діє, буде підсвічено лише стовпчик стану.

source: If --file-size is specified, I<less> will determine the size of the file immediately after opening the file. Normally this is not done, because it can be slow if the input file is large.
uk: Якщо вказано --file-size, I<less> обчислюватиме розмір файла негайно після його відкриття. Зазвичай, це обчислення не виконуватиметься, оскільки воно може бути повільним, якщо файл вхідних даних є надто великим.

source: Enables the colored text in various places. The -D option can be used to change the colors. Colored text works only if the terminal supports ANSI color escape sequences (as defined in ECMA-48 SGR; see
uk: Вмикає розфарбовування тексту у різних місцях. Для внесення змін до кольорів можна скористатися параметром -D. Розфарбовування тексту працює, лише якщо у терміналі передбачено підтримку керівних послідовностей кольорів ANSI (як їх визначено у ECMA-48 SGR; див.

source: You may define your own I<less> commands by creating a lesskey source file. This file specifies a set of command keys and an action associated with each key. You may also change the line-editing keys (see LINE EDITING), and to set environment variables. If the environment variable LESSKEYIN is set, I<less> uses that as the name of the lesskey source file. Otherwise, I<less> looks in a standard place for the lesskey source file: On Unix systems, I<less> looks for a lesskey file called "$XDG_CONFIG_HOME/lesskey" or "$HOME/.lesskey". On MS-DOS and Windows systems, I<less> looks for a lesskey file called "$HOME/_lesskey", and if it is not found there, then looks for a lesskey file called "_lesskey" in any directory specified in the PATH environment variable. On OS/2 systems, I<less> looks for a lesskey file called "$HOME/lesskey.ini", and if it is not found, then looks for a lesskey file called "lesskey.ini" in any directory specified in the INIT environment variable, and if it not found there, then looks for a lesskey file called "lesskey.ini" in any directory specified in the PATH environment variable. See the I<lesskey> manual page for more details.
uk: Ви можете визначити ваші власні команди I<less> створенням файла початкового коду lesskey. Цей файл вказує набір клавіш-команд і дій, які пов'язано із кожною клавішею. Ви можете також змінити клавіші редагування рядків (див. РЕДАГУВАННЯ РЯДКІВ) і встановити значення змінних середовища. Якщо встановлено значення змінної середовища LESSKEYIN, I<less> буде використовувати значення цієї змінної як назву файла початкового коду lesskey. Якщо значення змінної не встановлено, I<less> шукатиме у стандартному місці для файла початкового коду lesskey: у системах Unix I<less> шукає файл lesskey із назвою «$XDG_CONFIG_HOME/lesskey» або «$HOME/.lesskey». У системах MS-DOS і Windows I<less> шукає файл lesskey з назвою «$HOME/_lesskey» і, якщо файл там не буде знайдено, шукатиме файл lesskey із назвою «_lesskey» у будь-якому каталозі, який є у списку змінної середовища PATH. У системах OS/2 I<less> шукає файл lesskey із назвою «$HOME/lesskey.ini» і, якщо його не буде знайдено, шукати файл lesskey із назвою «lesskey.ini» у будь-якому каталозі, який визначено у змінній середовища INIT, і, якщо його там не буде знайдено, шукає файл lesskey із назвою «lesskey.ini» у будь-якому каталозі, який вказано у списку змінної середовища PATH. Див. сторінку підручника I<lesskey>, щоб дізнатися більше.

source: Note that a preprocessor cannot output an empty file, since that is interpreted as meaning there is no replacement, and the original file is used. To avoid this, if LESSOPEN starts with two vertical bars, the exit status of the script becomes meaningful. If the exit status is zero, the output is considered to be replacement text, even if it is empty. If the exit status is nonzero, any output is ignored and the original file is used. For compatibility with previous versions of I<less>, if LESSOPEN starts with only one vertical bar, the exit status of the preprocessor is ignored.
uk: Зауважте, що засіб попередньої обробки не може виводити порожній файл, оскільки тоді програма вважатиме, що заміни немає, і використовуватиме початковий файл. Щоб уникнути цього, якщо LESSOPEN починатиметься з двох вертикальних рисок, буде взято до уваги стан виходу зі скрипту. Якщо станом виходу буде нуль, виведення скрипту вважатиметься текстом-замінником, навіть якщо він буде порожнім. Якщо стан виходу буде ненульовим, усі виведені дані буде проігноровано, і програма використовуватиме початковий файл. Для сумісності із попередніми версіями I<less>, якщо LESSOPEN починатиметься із лише однієї вертикальної риски, стан виходу засобу попередньої обробки буде проігноровано.

source: Name of the history file used to remember search commands and shell commands between invocations of I<less>. If set to "-" or "/dev/null", a history file is not used. The default is "$XDG_DATA_HOME/lesshst" or "$HOME/.lesshst" on Unix systems, "$HOME/_lesshst" on DOS and Windows systems, or "$HOME/lesshst.ini" or "$INIT/lesshst.ini" on OS/2 systems.
uk: Назва файла журналу, яку буде використано для запам'ятовування команд пошуку і команд оболонки між викликами I<less>. Якщо встановлено значення «-» або «/dev/null», файл журналу використано не буде. Типовим значенням є «$XDG_DATA_HOME/lesshst» або «$HOME/.lesshst» у системах Unix, «$HOME/_lesshst» у системах DOS і Windows, або «$HOME/lesshst.ini» або «$INIT/lesshst.ini» у системах OS/2.

source: Copyright (C) 1984-2021 Mark Nudelman
uk: © Mark Nudelman, 1984–2021

source: Reverts to the old bottom of screen behavior. This can be sometimes desirable if the long lines are not wrapped correctly when reaching the bottom of the terminal, while scrolling forward.
uk: Повертає програму до застарілої поведінки щодо низу екрана. Іноді така поведінка є бажаною, якщо програма не може впоратися із перенесенням довгих рядків при досягненні нижнього краю термінала при гортанні вперед.

source: There are used following files to set up default preprocessor:
uk: Вказані нижче файли використовують для налаштовування типового попереднього обробника:

source: These files set up /usr/bin/lesspipe.sh as a default filter. An user defined filter can be specified in ~/.lessfilter. This file should have an execute bit set and accept only one parameter, which represents a filename. If the user defined filter process the file, zero should be returned. Otherwise ~/.lessfilter tries to handle the file.
uk: Ці файли налаштовують /usr/bin/lesspipe.sh як типовий фільтр. Визначений користувачем фільтр можна вказати у ~/.lessfilter. Для цього файла має бути визначено біт виконання. Програма має приймати лише один параметр, який визначає назву файла. Якщо файл буде вдало оброблено визначеним користувачем фільтром, має бути повернуто нуль. В інших випадках буде виконано спробу обробити файл за допомогою ~/.lessfilter.

source: Invokes a shell to run the shell-command given. A percent sign (%) in the command is replaced by the name of the current file. A pound sign (#) is replaced by the name of the previously examined file. "!!" repeats the last shell command. "!" with no shell command simply invokes a shell. On Unix systems, the shell is taken from the environment variable LESSSHELL, or defaults to "sh". On MS-DOS and OS/2 systems, the shell is the normal command processor.
uk: Викликає командну оболонку для запуску команди оболонки. Символ відсотків (%) у команді буде замінено на назву поточного файла. Символ решітки (#) буде замінено назвою попереднього інспектованого файла. «!!» повторює останню команду оболонки. «!» без команди оболонки просто викликає оболонку. У системах Unix команду оболонки буде визначено за змінною середовища LESSSHELL або використано типову — sh. У системах MS-DOS і OS/2 оболонка є звичайним обробником команд.
