Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: Complete the partial filename to the left of the cursor. If it matches more than one filename, the first match is entered into the command line. Repeated TABs will cycle thru the other matching filenames. If the completed filename is a directory, a "/" is appended to the filename. (On MS-DOS systems, a "\e" is appended.) The environment variable LESSSEPARATOR can be used to specify a different character to append to a directory name.
uk: Доповнити частину назви файла ліворуч від курсора. Якщо відповідність буде встановлено для декількох назв файлів, у рядок команди буде введено перший відповідник. Повторне натискання TAB призводитиме до циклічного переходу списком інших варіантів назв файлів. Якщо доповнена назва файла є каталогом, до назви файла буде дописано «/». (У системах MS-DOS буде дописано «\e».) Для визначення іншого символу для дописування до назви каталогу можна скористатися змінною середовища LESSSEPARATOR.

source: Like, TAB, but cycles in the reverse direction thru the matching filenames.
uk: Подібна до TAB, але здійснює циклічний перехід відповідними назвами файлів у зворотному напрямку.

source: Complete the partial filename to the left of the cursor. If it matches more than one filename, all matches are entered into the command line (if they fit).
uk: Доповнити часткову назву файла ліворуч від курсора. Якщо буде встановлено відповідність декільком назвам файлів, усі відповідники буде введено до рядка команди (якщо вони вмістяться).

source: ^U (Unix and OS/2) or ESC (MS-DOS)
uk: ^U (Unix і OS/2) або ESC (MS-DOS)

source: Delete the entire command line, or cancel the command if the command line is empty. If you have changed your line-kill character in Unix to something other than ^U, that character is used instead of ^U.
uk: Вилучити увесь рядок команди або скасувати команду, якщо рядок команди є порожнім. Якщо вами було змінено ваш символ знищення рядка у Unix у якесь інше значення, ніж ^U, замість ^U буде використано цей символ.

source: Delete the entire command line and return to the main prompt.
uk: Вилучити увесь рядок команди і повернутися до основного запиту.

source: KEY BINDINGS
uk: ПРИВ'ЯЗКА КЛАВІШ

source: A system-wide lesskey source file may also be set up to provide key bindings. If a key is defined in both a local lesskey file and in the system-wide file, key bindings in the local file take precedence over those in the system-wide file. If the environment variable LESSKEYIN_SYSTEM is set, I<less> uses that as the name of the system-wide lesskey file. Otherwise, I<less> looks in a standard place for the system-wide lesskey file: On Unix systems, the system-wide lesskey file is /usr/local/etc/syslesskey. (However, if I<less> was built with a different sysconf directory than /usr/local/etc, that directory is where the sysless file is found.) On MS-DOS and Windows systems, the system-wide lesskey file is c:\e_syslesskey. On OS/2 systems, the system-wide lesskey file is c:\esyslesskey.ini.
uk: Можна також налаштувати загальносистемний файл початкового коду lesskey для надання даних щодо прив'язок клавіш. Якщо клавішу налаштовано одразу у локальному файлі lesskey і у загальносистемному файлі, пріоритет над загальносистемним файлом матиме локальний файл. Якщо встановлено значення змінної середовища LESSKEYIN_SYSTEM, I<less> скористається ним як назвою загальносистемного файла lesskey. В інших випадках I<less> шукатиме загальносистемний файл lesskey у стандартних місцях: у системах Unix загальносистемним файлом lesskey є /usr/local/etc/syslesskey. (Втім, якщо I<less> було зібрано із іншим каталогом sysconf, ніж /usr/local/etc, каталогом буде той каталог, де зберігається файл sysless.) У системах MS-DOS і Windows, загальносистемним файлом lesskey є c:\e_syslesskey. У системах OS/2 загальносистемним файлом lesskey є c:\esyslesskey.ini.

source: Previous versions of I<less> (before v582) used lesskey files with a binary format, produced by the I<lesskey> program. It is no longer necessary to use the I<lesskey> program.
uk: У попередніх версіях I<less> (до версії 582) було використано файли lesskey у двійковому форматі, які створено програмою I<lesskey>. У нових версіях потреби у використанні програми I<lesskey> немає.

source: INPUT PREPROCESSOR
uk: ПОПЕРЕДНЯ ОБРОБКА ВХІДНИХ ДАНИХ

source: You may define an "input preprocessor" for I<less>. Before I<less> opens a file, it first gives your input preprocessor a chance to modify the way the contents of the file are displayed. An input preprocessor is simply an executable program (or shell script), which writes the contents of the file to a different file, called the replacement file. The contents of the replacement file are then displayed in place of the contents of the original file. However, it will appear to the user as if the original file is opened; that is, I<less> will display the original filename as the name of the current file.
uk: Ви можете визначити «обробник вхідних даних» для I<less>. Перш ніж I<less> відкриє файл, програма спочатку надасть вашому обробнику вхідних даних можливість вносити зміни до вмісту показаного файла. Обробник вхідних даних є простою виконуваною програмою (або скриптом командної оболонки), яка записує вміст файла до іншого файла, який називають файлом-замінником. Вміст файла-замінника потім буде показано замість вмісту початкового файла. Втім, для користувача він виглядатиме як початковий відкритий файл; тобто I<less> показуватиме початкову назву файла як назву поточного файла.

source: An input preprocessor receives one command line argument, the original filename, as entered by the user. It should create the replacement file, and when finished, print the name of the replacement file to its standard output. If the input preprocessor does not output a replacement filename, I<less> uses the original file, as normal. The input preprocessor is not called when viewing standard input. To set up an input preprocessor, set the LESSOPEN environment variable to a command line which will invoke your input preprocessor. This command line should include one occurrence of the string "%s", which will be replaced by the filename when the input preprocessor command is invoked.
uk: Засіб попередньої обробки вхідних даних приймає один аргумент командного рядка — назву початкового файла, як її введено користувачем. Він має створити файл-замінник, і після завершення обробки вивести назву файла-замінника на власне стандартне виведення. Якщо обробник вхідних даних не виводить назву файла-замінника, I<less> використає початковий файл, як звично. Засіб попередньої обробки вхідних даних не буде викликано при перегляді стандартного джерела вхідних даних. Щоб налаштувати обробник вхідних даних, встановіть для змінної середовища LESSOPEN значення рядка команди, яка викликатиме ваш обробник вхідних даних. У цьому рядку команди має бути одне включення рядка «%s», який буде замінено назвою файла при виклику команди попередньої обробки.

source: When I<less> closes a file opened in such a way, it will call another program, called the input postprocessor, which may perform any desired clean-up action (such as deleting the replacement file created by LESSOPEN). This program receives two command line arguments, the original filename as entered by the user, and the name of the replacement file. To set up an input postprocessor, set the LESSCLOSE environment variable to a command line which will invoke your input postprocessor. It may include two occurrences of the string "%s"; the first is replaced with the original name of the file and the second with the name of the replacement file, which was output by LESSOPEN.
uk: Коли I<less> закриває файл, який відкрито у такий спосіб, вона викликає іншу програму, яку називають остаточним обробником вхідних даних, який може виконувати будь-які бажані дії із очищення (зокрема вилучення файла-замінника, який створено LESSOPEN). Ця програма отримує два аргументи командного рядка — назву початкового файла, як її введено користувачем, і назву файла-замінника. Щоб налаштувати засіб остаточної обробки вхідних даних, встановіть для змінної середовища LESSCLOSE значення рядка команди, який викличе засіб остаточної обробки вхідних даних. Він може включати два записи рядка «%s»; перший буде замінено на назву початкового файла, а другий — назвою файла-замінника, до якого виведено дані LESSOPEN.

source: For example, on many Unix systems, these two scripts will allow you to keep files in compressed format, but still let I<less> view them directly:
uk: Наприклад, у багатьох системах Unix ці два скрипти надають вам змогу зберігати файли у стиснутому форматі, але надає змогу I<less> переглядати їх безпосередньо:

source: To use these scripts, put them both where they can be executed and set LESSOPEN="lessopen.sh\ %s", and LESSCLOSE="lessclose.sh\ %s\ %s". More complex LESSOPEN and LESSCLOSE scripts may be written to accept other types of compressed files, and so on.
uk: Щоб скористатися цими скриптами, розмістіть їх обидва там, де їх можна виконати, і встановіть LESSOPEN="lessopen.sh\ %s" і LESSCLOSE="lessclose.sh\ %s\ %s". Можна написати складніші скрипти LESSOPEN і LESSCLOSE, щоб вони приймали інші типи стиснутих файлів тощо.

source: It is also possible to set up an input preprocessor to pipe the file data directly to I<less>, rather than putting the data into a replacement file. This avoids the need to decompress the entire file before starting to view it. An input preprocessor that works this way is called an input pipe. An input pipe, instead of writing the name of a replacement file on its standard output, writes the entire contents of the replacement file on its standard output. If the input pipe does not write any characters on its standard output, then there is no replacement file and I<less> uses the original file, as normal. To use an input pipe, make the first character in the LESSOPEN environment variable a vertical bar (|) to signify that the input preprocessor is an input pipe. As with non-pipe input preprocessors, the command string must contain one occurrence of %s, which is replaced with the filename of the input file.
uk: Також можна налаштувати засіб попередньої обробки вхідних даних для передавання каналом даних файла безпосередньо до I<less>, замість розміщення даних у файлі-заміннику. Таким чином можна уникнути розпакування усього файла перед його переглядом. Засіб попередньої обробки вхідних даних, який працює у цей спосіб, називається вхідним каналом. Вхідний канал, замість записування назви файла-замінника до стандартного виведення, записує увесь вміст файла-замінника до свого стандартного виведення. Якщо вхідний канал не записує жодних символів до стандартного виведення, файла-замінника не буде, і I<less> використовуватиме початковий файл, як звично. Щоб скористатися вхідним каналом, зробіть першим символом у змінній середовища LESSOPEN вертикальну риску (|) для позначення, що засіб попередньої обробки вхідних даних є каналом вхідних даних. Як і у засобах попередньої обробки вхідних даних, які не є каналами даних, рядок команди має містити один запис %s, який буде замінено назвою файла вхідних даних.

source: For example, on many Unix systems, this script will work like the previous example scripts:
uk: Наприклад, у багатьох системах Unix, цей скрипт працюватиме як скрипти у попередніх прикладах:

source: To use this script, put it where it can be executed and set LESSOPEN="|lesspipe.sh %s".
uk: Щоб скористатися цим скриптом, розмістіть його десь, де його можна буде виконати, і встановіть LESSOPEN="|lesspipe.sh %s".

source: When an input pipe is used, a LESSCLOSE postprocessor can be used, but it is usually not necessary since there is no replacement file to clean up. In this case, the replacement file name passed to the LESSCLOSE postprocessor is "-".
uk: Якщо використано канал вхідних даних, можна скористатися засобом остаточної обробки LESSCLOSE, але у цьому, зазвичай, немає потреби, оскільки не буде файла-замінника, який слід вилучити. У цьому випадку переданою назвою файла-замінника для засобу остаточної обробки LESSCLOSE буде «-».

source: For compatibility with previous versions of I<less>, the input preprocessor or pipe is not used if I<less> is viewing standard input. However, if the first character of LESSOPEN is a dash (-), the input preprocessor is used on standard input as well as other files. In this case, the dash is not considered to be part of the preprocessor command. If standard input is being viewed, the input preprocessor is passed a file name consisting of a single dash. Similarly, if the first two characters of LESSOPEN are vertical bar and dash (|-) or two vertical bars and a dash (||-), the input pipe is used on standard input as well as other files. Again, in this case the dash is not considered to be part of the input pipe command.
uk: Для сумісності із попередніми версіями I<less> обробник вхідних даних або канал не буде використано, якщо I<less> використано для перегляду стандартного джерела вхідних даних. Втім, якщо першим символом LESSOPEN є дефіс (-), обробник вхідних даних буде використано для стандартного джерела вхідних даних, а також інших файлів. У цьому випадку дефіс вважатиметься частиною команди засобу попередньої обробки. Якщо відбувається перегляд стандартного джерела вхідних даних, засобу попередньої обробки вхідних даних буде передано назву файла, що складається з одинарного дефіса. Так само, якщо першими двома символами LESSOPEN є вертикальна риска і дефіс (|-) або дві вертикальні риски і дефіс (||-), буде використано канал вхідних даних на стандартному джерелі вхідних даних, а також на інших файлах. Знову ж, у цьому випадку дефіс не вважатиметься частиною команди вхідного каналу.

source: NATIONAL CHARACTER SETS
uk: МІЖНАРОДНІ НАБОРИ СИМВОЛІВ

source: There are three types of characters in the input file:
uk: У файлі вхідних даних є три типи символів:

source: normal characters
uk: звичайні символи

source: can be displayed directly to the screen.
uk: може бути безпосередньо показано на екрані.

source: control characters
uk: керівні символи

source: should not be displayed directly, but are expected to be found in ordinary text files (such as backspace and tab).
uk: не має бути показано безпосередньо, але їх можна знайти у звичайних текстових файлах (зокрема символи забою або символи табуляції).

source: binary characters
uk: двійкові символи

source: should not be displayed directly and are not expected to be found in text files.
uk: не має бути показано безпосередньо, і їх навряд чи можна зустріти у текстових файлах.

source: A "character set" is simply a description of which characters are to be considered normal, control, and binary. The LESSCHARSET environment variable may be used to select a character set. Possible values for LESSCHARSET are:
uk: «Набір символів» є простим описом того, які символи вважатимуться звичайними, керівними та двійковими. Для вибору набору символів можна скористатися змінною середовища LESSCHARSET. Можливими значеннями LESSCHARSET є такі:

source: BS, TAB, NL, CR, and formfeed are control characters, all chars with values between 32 and 126 are normal, and all others are binary.
uk: BS, TAB, NL, CR та подача сторінки є керівними символами, усі символи зі значеннями від 32 до 126 є звичайними, а усі інші символи є двійковими.

source: Selects an ISO 8859 character set. This is the same as ASCII, except characters between 160 and 255 are treated as normal characters.
uk: Вибирає набір символів ISO 8859. Цей той самий набір, що і ASCII, але символи від 160 до 255 вважають звичайними символами.

source: Same as iso8859.
uk: Те саме, що і iso8859.

source: Selects a character set appropriate for MS-DOS.
uk: Вибирає набір символів, який є придатним для MS-DOS.

source: Selects an EBCDIC character set.
uk: Вибирає набір символів EBCDIC.

source: Selects an EBCDIC character set used by OS/390 Unix Services. This is the EBCDIC analogue of latin1. You get similar results by setting either LESSCHARSET=IBM-1047 or LC_CTYPE=en_US in your environment.
uk: Вибирає набір символів EBCDIC, який використано службами OS/390 Unix. Це аналог EBCDIC для latin1. Ви отримаєте подібні результати встановленням LESSCHARSET=IBM-1047 або LC_CTYPE=en_US у вашому середовищі.

source: Selects a Russian character set.
uk: Вибирає російський набір символів.

source: Selects a character set appropriate for NeXT computers.
uk: Вибирає набір символів, який є придатним для комп'ютерів NeXT.

source: Selects the UTF-8 encoding of the ISO 10646 character set. UTF-8 is special in that it supports multi-byte characters in the input file. It is the only character set that supports multi-byte characters.
uk: Вибирає кодування UTF-8 набору символів ISO 10646. Кодування UTF-8 є особливим у тому, що у ньому передбачено багатобайтові символи у файлі вхідних даних. Це єдиний набір символів, у якому передбачено підтримку багатобайтових символів.

source: Selects a character set appropriate for Microsoft Windows (cp 1251).
uk: Вибирає набір символів, який є придатним для Microsoft Windows (cp 1251).

source: In rare cases, it may be desired to tailor I<less> to use a character set other than the ones definable by LESSCHARSET. In this case, the environment variable LESSCHARDEF can be used to define a character set. It should be set to a string where each character in the string represents one character in the character set. The character ".\&" is used for a normal character, "c" for control, and "b" for binary. A decimal number may be used for repetition. For example, "bccc4b.\&" would mean character 0 is binary, 1, 2 and 3 are control, 4, 5, 6 and 7 are binary, and 8 is normal. All characters after the last are taken to be the same as the last, so characters 9 through 255 would be normal. (This is an example, and does not necessarily represent any real character set.)
uk: У рідкісних випадках може бути бажаним скоригувати налаштування I<less> так, щоб можна було визначити набір символів, окрім тих, які можна визначити за допомогою LESSCHARSET. У цьому випадку для визначення набору символів можна скористатися змінною середовища LESSCHARDEF. Для змінної слід встановити значення рядка, де кожен символ у рядку відповідає одному символу у наборі символів. Символ «.\&» є позначенням звичайного символу, «c» — керівного, або «b» — двійкового. Для повторення можна скористатися десятковим числом. Наприклад, «bccc4b.\&» означатиме, що символ 0 є двійковим, символи 1, 2 і 3 — керівними, 4, 5, 6 і 7 — двійковими, а 8 — звичайним. Усі символи після останнього вважатимуться тими самими, що і останній, тому символи від 9 до 255 вважатимуться звичайними. (Це приклад, який не обов'язково відтворює якийсь справжній набір символів.)

source: This table shows the value of LESSCHARDEF which is equivalent to each of the possible values for LESSCHARSET:
uk: У цій таблиці показано значення LESSCHARDEF, яке є еквівалентним до кожного з можливих значень LESSCHARSET:

source: If neither LESSCHARSET nor LESSCHARDEF is set, but any of the strings "UTF-8", "UTF8", "utf-8" or "utf8" is found in the LC_ALL, LC_CTYPE or LANG environment variables, then the default character set is utf-8.
uk: Якщо не встановлено значень ні LESSCHARSET, ні LESSCHARDEF, а у змінних середовища LC_ALL, LC_CTYPE або LANG буде знайдено «UTF-8», «UTF8», «utf-8» або «utf8», типовим набором символів буде utf-8.

source: If that string is not found, but your system supports the I<setlocale> interface, I<less> will use setlocale to determine the character set. setlocale is controlled by setting the LANG or LC_CTYPE environment variables.
uk: Якщо цей рядок не буде знайдено, але у вашій системі передбачено інтерфейс I<setlocale>, I<less> використає setlocale для визначення набору символів. Керування setlocale можна здійснювати встановленням змінних середовища LANG і LC_CTYPE.

source: Finally, if the I<setlocale> interface is also not available, the default character set is latin1.
uk: Нарешті, якщо інтерфейс I<setlocale> є недоступним, типовим набором символів буде latin1.

source: Control and binary characters are displayed in standout (reverse video). Each such character is displayed in caret notation if possible (e.g.\& ^A for control-A). Caret notation is used only if inverting the 0100 bit results in a normal printable character. Otherwise, the character is displayed as a hex number in angle brackets. This format can be changed by setting the LESSBINFMT environment variable. LESSBINFMT may begin with a "*" and one character to select the display attribute: "*k" is blinking, "*d" is bold, "*u" is underlined, "*s" is standout, and "*n" is normal. If LESSBINFMT does not begin with a "*", normal attribute is assumed. The remainder of LESSBINFMT is a string which may include one printf-style escape sequence (a % followed by x, X, o, d, etc.). For example, if LESSBINFMT is "*u[%x]", binary characters are displayed in underlined hexadecimal surrounded by brackets. The default if no LESSBINFMT is specified is "*sE<lt>%02XE<gt>". Warning: the result of expanding the character via LESSBINFMT must be less than 31 characters.
uk: Керівні та двійкові символи буде показано як виокремлені (інвертовані). Кожен із таких символів буде показано із символом «^», якщо це можливо (наприклад, \& ^A для Ctrl-A). Позначення із «^» буде використано, лише якщо інвертування біту 0100 дає звичайний друкований символ. Якщо це не так, символ буде показано як шістнадцяткове число у кутових дужках. Цей формат можна змінити встановленням значення змінної середовища LESSBINFMT. Значення LESSBINFMT може починатися з «*» і одного символу для вибору атрибуту показу: «*k» — блимання, «*d» — напівжирний, «*u» — підкреслений, «*s» — виокремлений і «*n» — звичайний. Якщо LESSBINFMT не починається з «*», буде використано звичайний атрибут. Рештою LESSBINFMT є рядок, який може містити керівні послідовності у стилі printf (% з наступними x, X, o, d тощо). Наприклад, якщо значенням LESSBINFMT є «*u[%x]», двійкові символи буде показано підкресленим шістнадцятковим числом у квадратних дужках. Типовим варіантом, якщо не встановлено значення LESSBINFMT, є «*sE<lt>%02XE<gt>». Увага! Результат розгортання символу із використанням LESSBINFMT не повинен перевищувати у довжину 31 символ.

source: When the character set is utf-8, the LESSUTFBINFMT environment variable acts similarly to LESSBINFMT but it applies to Unicode code points that were successfully decoded but are unsuitable for display (e.g., unassigned code points). Its default value is "E<lt>U+%04lXE<gt>". Note that LESSUTFBINFMT and LESSBINFMT share their display attribute setting ("*x") so specifying one will affect both; LESSUTFBINFMT is read after LESSBINFMT so its setting, if any, will have priority. Problematic octets in a UTF-8 file (octets of a truncated sequence, octets of a complete but non-shortest form sequence, invalid octets, and stray trailing octets) are displayed individually using LESSBINFMT so as to facilitate diagnostic of how the UTF-8 file is ill-formed.
uk: Якщо встановлено набір символів utf-8, змінна середовища LESSUTFBINFMT працює подібно до LESSBINFMT, але її буде застосовано до символів Unicode, які було успішно декодовано, але які не можна показати (наприклад, позицій у таблиці, для яких не визначено символів). Типовим значенням змінної є «E<lt>U+%04lXE<gt>». Зауважте, що LESSUTFBINFMT і LESSBINFMT мають спільний атрибут показу («*x»), тому визначення однієї зі змінних стосується обох; LESSUTFBINFMT буде прочитано після LESSBINFMT, тому встановлення значення першої змінної, якщо його буде виконано, матиме вищий пріоритет. Проблематичні октети у файлі UTF-8 (октети обрізаних послідовностей, повні октети, але не у послідовності найкоротшої форми, некоректні октети і окремі кінцеві октети) буде показано окремо з використанням LESSBINFMT. Так зроблено, щоб полегшити діагностику причин помилкового форматування файла UTF-8.
