Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: NAME
uk: НАЗВА

source: less - opposite of more
uk: less — протилежність more

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<[-b >I<space\/>B<] [-h >I<lines\/>B<] [-j >I<line\/>B<] [-k >I<keyfile\/>B<]>
uk: B<[-b >I<місце\/>B<] [-h >I<рядки\/>B<] [-j >I<рядок\/>B<] [-k >I<файл_клавіш\/>B<]>

source: B<[-{oO} >I<logfile\/>B<] [-p >I<pattern\/>B<] [-P >I<prompt\/>B<] [-t >I<tag\/>B<]>
uk: B<[-{oO} >I<файл_журналу\/>B<] [-p >I<взірець\/>B<] [-P >I<запит\/>B<] [-t >I<мітка\/>B<]>

source: B<[-T >I<tagsfile\/>B<] [-x >I<tab\/>B<,...] [-y >I<lines\/>B<] [-[z] >I<lines\/>B<]>
uk: B<[-T >I<файл_міток\/>B<] [-x >I<табуляція\/>B<,...] [-y >I<рядки\/>B<] [-[z] >I<рядки\/>B<]>

source: B<[-# >I<shift\/>B<] [+[+]>I<cmd\/>B<] [--] [>I<filename\/>B<]...>
uk: B<[-# >I<зсув\/>B<] [+[+]>I<команда\/>B<] [--] [>I<назва_файла\/>B<]...>

source: (See the OPTIONS section for alternate option syntax with long option names.)
uk: (Див. розділ ПАРАМЕТРИ щодо альтернативного синтаксису параметрів із довгими назвами параметрів.)

source: DESCRIPTION
uk: ОПИС

source: I<Less> is a program similar to I<more>(1), but which allows backward movement in the file as well as forward movement. Also, I<less> does not have to read the entire input file before starting, so with large input files it starts up faster than text editors like I<vi>(1). I<Less> uses termcap (or terminfo on some systems), so it can run on a variety of terminals. There is even limited support for hardcopy terminals. (On a hardcopy terminal, lines which should be printed at the top of the screen are prefixed with a caret.)
uk: I<Less> — програма, подібна до I<more>(1), але така, уможливлює зворотне просування у файлі, окрім пересування вперед. Крім того, I<less> не потребує читання усього файла вхідних даних перед початком обробки, тому для великих файлів вхідних даних програма запускається швидше за текстові редактори, подібні до I<vi>(1). У I<less> використано termcap (або terminfo у деяких системах), тому програма може працювати у широкому спектрі терміналів. Реалізовано навіть обмежену підтримку друкувальних терміналів. (У друкувальних терміналах, рядки, які має бути надруковано у верхній частині екрана мають префікс знак вставляння.)

source: Commands are based on both I<more> and I<vi>. Commands may be preceded by a decimal number, called N in the descriptions below. The number is used by some commands, as indicated.
uk: Команди засновано на I<more> і I<vi>. Перед командами можна вказати десяткове число, яке у наведених нижче описах позначено N. Число, як це вказано, буде використано деякими командами.

source: COMMANDS
uk: КОМАНДИ

source: In the following descriptions, ^X means control-X. ESC stands for the ESCAPE key; for example ESC-v means the two character sequence "ESCAPE", then "v".
uk: У наведених нижче описах ^X означає Ctrl-X. ESC позначено клавішу ESCAPE; наприклад, ESC-v означає двосимвольну послідовність: «ESCAPE», потім «v».

source: h or H
uk: h або H

source: Help: display a summary of these commands. If you forget all the other commands, remember this one.
uk: Довідка: вивести резюме щодо цих команд. Якщо ви забули усі інші команди, запам'ятайте цю.

source: SPACE or ^V or f or ^F
uk: Пробіл, або ^V, або f, або ^F

source: Scroll forward N lines, default one window (see option -z below). If N is more than the screen size, only the final screenful is displayed. Warning: some systems use ^V as a special literalization character.
uk: Гортати вперед на N рядків, типово на одне вікно (див. параметр -z нижче). Якщо N перевищує висоту екрана, буде показано лише кінцеву частину рядків гортання. Попередження: у деяких системах ^V використано для переведення термінала у буквальний режим.

source: Like SPACE, but if N is specified, it becomes the new window size.
uk: Подібне до пробілу, але якщо вказано N, N стає новим розміром вікна.

source: ESC-SPACE
uk: ESC-Пробіл

source: Like SPACE, but scrolls a full screenful, even if it reaches end-of-file in the process.
uk: Подібний до пробілу, але гортає на екран, навіть якщо досягнуто кінця файла.

source: ENTER or RETURN or ^N or e or ^E or j or ^J
uk: ENTER, або RETURN, або ^N, або e, або ^E, або j, або ^J

source: Scroll forward N lines, default 1. The entire N lines are displayed, even if N is more than the screen size.
uk: Гортання вперед на N рядків, типово, на 1. Буде показано усі N рядків, наві якщо N перевищує розмір екрана.

source: d or ^D
uk: d або ^D

source: Scroll forward N lines, default one half of the screen size. If N is specified, it becomes the new default for subsequent d and u commands.
uk: Гортання вперед на N рядків, типово, на половину розміру екрана. Якщо задано N, воно стає новим типовим значенням для наступних команд d і u.

source: b or ^B or ESC-v
uk: b, або ^B, або ESC-v

source: Scroll backward N lines, default one window (see option -z below). If N is more than the screen size, only the final screenful is displayed.
uk: Гортати назад на N рядків, типово на одне вікно (див. параметр -z нижче). Якщо N перевищує висоту екрана, буде показано лише кінцеву частину рядків гортання.

source: Like ESC-v, but if N is specified, it becomes the new window size.
uk: Подібне до ESC-v, але якщо вказано N, N стає новим розміром вікна.

source: y or ^Y or ^P or k or ^K
uk: y, або ^Y, або ^P, або k, або ^K

source: Scroll backward N lines, default 1. The entire N lines are displayed, even if N is more than the screen size. Warning: some systems use ^Y as a special job control character.
uk: Гортання назад на N рядків, типово, на 1. Буде показано усі N рядків, наві якщо N перевищує розмір екрана. Попередження: у деяких системах ^Y є спеціальним символом керування завданнями.

source: u or ^U
uk: u або ^U

source: Scroll backward N lines, default one half of the screen size. If N is specified, it becomes the new default for subsequent d and u commands.
uk: Гортання назад на N рядків, типово, на половину розміру екрана. Якщо задано N, воно стає новим типовим значенням для наступних команд d і u.

source: Like j, but continues to scroll beyond the end of the file.
uk: Подібне до j, але продовжує гортати за межі кінця файла.

source: K or Y
uk: K або Y

source: Like k, but continues to scroll beyond the beginning of the file.
uk: Подібно до j, але продовжує гортати за межі початку файла.

source: ESC-) or RIGHTARROW
uk: ESC-) або стрілка праворуч

source: Scroll horizontally right N characters, default half the screen width (see the -# option). If a number N is specified, it becomes the default for future RIGHTARROW and LEFTARROW commands. While the text is scrolled, it acts as though the -S option (chop lines) were in effect.
uk: Гортати горизонтально праворуч на N символів, типово, на половину ширини екрана (див. параметр -#). Якщо вказано число N, воно стане типовим для наступних команд Стрілка праворуч і Стрілка ліворуч. Під час гортання тексту працює так, наче вказано параметр -S (обрізати рядки).

source: ESC-( or LEFTARROW
uk: ESC-( або стрілка ліворуч

source: Scroll horizontally left N characters, default half the screen width (see the -# option). If a number N is specified, it becomes the default for future RIGHTARROW and LEFTARROW commands.
uk: Гортати горизонтально ліворуч на N символів, типово, на половину ширини екрана (див. параметр -#). Якщо вказано число N, воно стане типовим для наступних команд Стрілка праворуч і Стрілка ліворуч.

source: ESC-} or ^RIGHTARROW
uk: ESC-} або ^стрілка праворуч

source: Scroll horizontally right to show the end of the longest displayed line.
uk: Гортати горизонтально праворуч, щоб показати кінець найдовшого рядка.

source: ESC-{ or ^LEFTARROW
uk: ESC-{ або ^стрілка ліворуч

source: Scroll horizontally left back to the first column.
uk: Гортати горизонтально ліворуч назад до першої позиції у рядку.

source: r or ^R or ^L
uk: r, або ^R, або ^L

source: Repaint the screen.
uk: Перемалювати екран.

source: Repaint the screen, discarding any buffered input. That is, reload the current file. Useful if the file is changing while it is being viewed.
uk: Перемалювати екран, відкинувши усі буферизовані вхідні дані. Тобто, перезавантажити поточний файл. Корисно, якщо до файла було внесено зміни під час його перегляду.

source: Like F, but as soon as a line is found which matches the last search pattern, the terminal bell is rung and forward scrolling stops.
uk: Подібне до F, але щойно буде знайдено рядок, який відповідає останньому взірцю пошуку, буде увімкнено дзвінок термінала і гортання вперед буде зупинено.

source: g or E<lt> or ESC-E<lt>
uk: g, або E<lt>, або ESC-E<lt>

source: Go to line N in the file, default 1 (beginning of file). (Warning: this may be slow if N is large.)
uk: Перейти до рядка N у файлі, типовим є рядок 1 (початок файла). (Попередження: може бути дуже повільно, якщо N є великим.)

source: G or E<gt> or ESC-E<gt>
uk: G, або E<gt>, або ESC-E<gt>

source: Go to line N in the file, default the end of the file. (Warning: this may be slow if N is large, or if N is not specified and standard input, rather than a file, is being read.)
uk: Перейти до рядка N у файлі, типово до кінця файла. (Попередження: може бути дуже повільно, якщо N є великим, або, якщо N не вказано, і читання буде виконуватися зі стандартного джерела даних, а не з файла.)

source: Same as G, except if no number N is specified and the input is standard input, goes to the last line which is currently buffered.
uk: Те саме, що і G, окрім того, що якщо не вказано числа N, і вхідні дані надходять зі стандартного джерела вхідних даних, перехід здійснюється до останнього рядка, який перебуває у поточному буфері.

source: p or %
uk: p або %

source: Go to a position N percent into the file. N should be between 0 and 100, and may contain a decimal point.
uk: Перейти до позиції у N відсотків у файлі. N має бути між 0 і 100, і може містити десяткову крапку.

source: Go to the line containing byte offset N in the file.
uk: Перейти до рядка, що містить байт зі зміщенням N у файлі.

source: If a left curly bracket appears in the top line displayed on the screen, the { command will go to the matching right curly bracket. The matching right curly bracket is positioned on the bottom line of the screen. If there is more than one left curly bracket on the top line, a number N may be used to specify the N-th bracket on the line.
uk: Якщо у верхньому рядку, який показано на екрані, буде ліва фігурна дужка, команда { призведе до переходу до відповідної правої фігурної дужки. Гортання буде виконано так, щоб відповідна права фігурна дужка опинилася у нижньому рядку екрана. Якщо у верхньому рядку буде декілька лівих фігурних дужок, числом N можна скористатися для визначення N-ої дужки на рядку.

source: Like {, but applies to parentheses rather than curly brackets.
uk: Подібне до {, але застосовується до круглих дужок замість фігурних.

source: Like }, but applies to parentheses rather than curly brackets.
uk: Подібне до }, але застосовується до круглих дужок замість фігурних.

source: Like {, but applies to square brackets rather than curly brackets.
uk: Подібне до {, але застосовується до квадратних дужок замість фігурних.

source: Like }, but applies to square brackets rather than curly brackets.
uk: Подібне до }, але застосовується до квадратних дужок замість фігурних.

source: Followed by two characters, acts like {, but uses the two characters as open and close brackets, respectively. For example, "ESC ^F E<lt> E<gt>" could be used to go forward to the E<gt> which matches the E<lt> in the top displayed line.
uk: Якщо далі вказано два символи, працює подібно до {, але використовує два символи як початкову і кінцеву дужки, відповідно. Наприклад, можна скористатися «ESC ^F E<lt> E<gt>», що перейти вперед до E<gt>, яка є відповідною до E<lt> у верхньому показаному рядку.

source: Followed by two characters, acts like }, but uses the two characters as open and close brackets, respectively. For example, "ESC ^B E<lt> E<gt>" could be used to go backward to the E<lt> which matches the E<gt> in the bottom displayed line.
uk: Якщо далі вказано два символи, працює подібно до }, але використовує два символи як початкову і кінцеву дужки, відповідно. Наприклад, можна скористатися «ESC ^B E<lt> E<gt>», що перейти назад до E<lt>, яка є відповідною до E<gt> у нижньому показаному рядку.

source: Followed by any lowercase or uppercase letter, marks the first displayed line with that letter. If the status column is enabled via the -J option, the status column shows the marked line.
uk: Якщо далі буде введено будь-яку малу або велику літеру, позначає перший показаний рядок із цією літерою. Якщо увімкнено стовпчик стану за допомогою параметра -J, у стовпчику стану буде показано позначений рядок.

source: Acts like m, except the last displayed line is marked rather than the first displayed line.
uk: Працює як m, але позначено буде останній показаний рядок, а не перший показаний рядок.

source: (Single quote.) Followed by any lowercase or uppercase letter, returns to the position which was previously marked with that letter. Followed by another single quote, returns to the position at which the last "large" movement command was executed. Followed by a ^ or $, jumps to the beginning or end of the file respectively. Marks are preserved when a new file is examined, so the ' command can be used to switch between input files.
uk: (Одинарні лапки.) Якщо далі буде введено будь-яку малу або велику літеру, повертає до позиції, яку раніше було позначено цією літерою. Якщо далі буде введено ще одні одинарні лапки, повертає до позиції, на якій було виконано останню «велику» команду з переходу. Якщо далі буде введено ^ або $, буде виконано перехід до початку або кінця файла, відповідно. Позначки буде збережено при перегляді нового файла, тому командою ' можна скористатися для перемикання між файлами вхідних даних.

source: Same as single quote.
uk: Те саме, що і одинарні лапки.

source: Followed by any lowercase or uppercase letter, clears the mark identified by that letter.
uk: Якщо далі буде введено будь-яку малу або велику літеру, знімає позначку, яку вказано цією літерою.

source: /pattern
uk: /взірець

source: Search forward in the file for the N-th line containing the pattern. N defaults to 1. The pattern is a regular expression, as recognized by the regular expression library supplied by your system. The search starts at the first line displayed (but see the -a and -j options, which change this).
uk: Шукати вперед у файлі N-ий рядок, у якому міститься взірець. Типовим значенням N є 1. Взірець є формальним виразом, який розпізнається бібліотекою обробки формальних виразів, яку надано системою. Пошук розпочинається з першого показаного рядка (втім, див. параметри -a і -j, які змінюють цю поведінку).

source: Certain characters are special if entered at the beginning of the pattern; they modify the type of search rather than become part of the pattern:
uk: Деякі символи є особливими, якщо їх введено на початку взірця; вони змінюють тип пошуку, а не стають частиною взірця:

source: ^N or !
uk: ^N або !

source: Search for lines which do NOT match the pattern.
uk: Шукати рядки, які НЕ відповідають взірцю.

source: ^E or *
uk: ^E або *

source: Search multiple files. That is, if the search reaches the END of the current file without finding a match, the search continues in the next file in the command line list.
uk: Шукати у декількох файлах. Тобто, якщо під час пошуку програма досягає кінця поточного файла, не знайшовши нічого, пошук продовжується у наступному файлі зі списку у рядку команди.

source: ^F or @
uk: ^F або @

source: Begin the search at the first line of the FIRST file in the command line list, regardless of what is currently displayed on the screen or the settings of the -a or -j options.
uk: Розпочати пошук на першому рядку першого файла у списку рядку команди, незалежно від того, що у поточний момент показано на екрані, або параметрів -a чи -j.

source: Highlight any text which matches the pattern on the current screen, but don't move to the first match (KEEP current position).
uk: Підсвітити будь-який текст, який відповідає взірцю на поточному екрані, але не переходити до першого відповідника (зберігати поточну позицію).

source: Don't interpret regular expression metacharacters; that is, do a simple textual comparison.
uk: Не обробляти метасимволи формальних виразів; тобто виконати просте текстове порівняння.

source: ?pattern
uk: ?взірець

source: Search backward in the file for the N-th line containing the pattern. The search starts at the last line displayed (but see the -a and -j options, which change this).
uk: Шукати назад у файлі N-ий рядок, у якому міститься взірець. Пошук розпочинається з останнього показаного рядка (втім, див. параметри -a і -j, які змінюють цю поведінку).

source: Certain characters are special as in the / command:
uk: Певні символи є спеціальними, як у команді /:

source: Search multiple files. That is, if the search reaches the beginning of the current file without finding a match, the search continues in the previous file in the command line list.
uk: Шукати у декількох файлах. Тобто, якщо під час пошуку програма досягає початку поточного файла, не знайшовши нічого, пошук продовжується у попередньому файлі зі списку у рядку команди.

source: Begin the search at the last line of the last file in the command line list, regardless of what is currently displayed on the screen or the settings of the -a or -j options.
uk: Розпочати пошук на останньому рядку останнього файла у списку рядку команди, незалежно від того, що у поточний момент показано на екрані, або параметрів -a чи -j.

source: As in forward searches.
uk: Як у пошуках вперед.

source: WRAP around the current file. That is, if the search reaches the beginning of the current file without finding a match, the search continues from the last line of the current file up to the line where it started.
uk: Переходити циклічно у поточному файлі. Тобто, якщо пошук завершується на початку поточного файла без знаходження відповідника, пошук продовжується з останнього рядка поточного файла до рядка, на якому його було розпочато.

source: ESC-/pattern
uk: ESC-/взірець

source: Same as "/*".
uk: Те саме, що і «/*».

source: ESC-?pattern
uk: ESC-?взірець

source: Same as "?*".
uk: Те саме, що і «?*».

source: Repeat previous search, for N-th line containing the last pattern. If the previous search was modified by ^N, the search is made for the N-th line NOT containing the pattern. If the previous search was modified by ^E, the search continues in the next (or previous) file if not satisfied in the current file. If the previous search was modified by ^R, the search is done without using regular expressions. There is no effect if the previous search was modified by ^F or ^K.
uk: Повторити попередній пошук для N-го рядка, який містить останній взірець. Якщо попередній пошук було видозмінено використанням ^N, пошук буде виконано для N-го рядка, що не містить взірця. Якщо попередній пошук було змінено ^E, пошук буде продовжено на наступному (або попередньому) файлі, якщо нічого не буде знайдено у поточному файлі. Якщо попередній пошук було видозмінено ^R, пошук буде виконано без використання формальних виразів. Ні на що не вплине, якщо попередній пошук було видозмінено ^F або ^K.

source: Repeat previous search, but in the reverse direction.
uk: Повторити попередній пошук, але у зворотному напрямку.

source: Repeat previous search, but crossing file boundaries. The effect is as if the previous search were modified by *.
uk: Повторити попередній пошук, але з переходом за межі файлів. Результат буде таким, наче попередній пошук було видозмінено *.

source: Repeat previous search, but in the reverse direction and crossing file boundaries.
uk: Повторити попередній пошук, але у зворотному напрямку із переходом за межі файла.

source: Undo search highlighting. Turn off highlighting of strings matching the current search pattern. If highlighting is already off because of a previous ESC-u command, turn highlighting back on. Any search command will also turn highlighting back on. (Highlighting can also be disabled by toggling the -G option; in that case search commands do not turn highlighting back on.)
uk: Скасувати підсвічування при пошуку. Вимкнути підсвічування рядків, які відповідають поточному взірцю для пошуку. Якщо підсвічування вже вимкнено через попередню команду ESC-u, його буде знову увімкнено. Будь-яка команда пошуку також знову увімкне підсвічування. (Підсвічування також можна вимкнути перемиканням параметра -G; у цьому випадку команди пошуку не вмикатимуть підсвічування.)

source: Like ESC-u but also clears the saved search pattern. If the status column is enabled via the -J option, this clears all search matches marked in the status column.
uk: Подібне до ESC-u, але із очищенням збереженого взірця пошуку. Якщо увімкнено стовпчик стану за допомогою параметра -J, буде знято усі позначені відповідники критерію пошуку у стовпчику стану.

source: &pattern
uk: &взірець

source: Display only lines which match the pattern; lines which do not match the pattern are not displayed. If pattern is empty (if you type & immediately followed by ENTER), any filtering is turned off, and all lines are displayed. While filtering is in effect, an ampersand is displayed at the beginning of the prompt, as a reminder that some lines in the file may be hidden. Multiple & commands may be entered, in which case only lines which match all of the patterns will be displayed.
uk: Показати лише рядки, які відповідають взірцю; рядки, які не відповідають взірцю, показано не буде. Якщо взірець виявиться порожнім (якщо ви введете & і одразу натиснете ENTER), фільтрування буде вимкнено — програма покаже усі рядки. Доки працює фільтрування, на початку запиту щодо команди буде показано амперсанд, як нагадування, що деякі рядки у файлі може бути приховано. Може бути введено декілька команд &. У цьому випадку буде показано лише рядки, які відповідають усіх взірцям одразу.

source: Display only lines which do NOT match the pattern.
uk: Вивести рядки, які НЕ відповідають взірцю.

source: :e [filename]
uk: :e [назва_файла]
