Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: PROMPTS
uk: ЗАПИТИ

source: The -P option allows you to tailor the prompt to your preference. The string given to the -P option replaces the specified prompt string. Certain characters in the string are interpreted specially. The prompt mechanism is rather complicated to provide flexibility, but the ordinary user need not understand the details of constructing personalized prompt strings.
uk: За допомогою параметра -P ви можете скоригувати запит за власними уподобаннями. Рядок, переданий параметру -P замінить вказаний рядок запиту. Певні символи у рядку буде оброблено в особливий спосіб. Механізм запиту є доволі складним для надання гнучкіших можливостей, але звичайному користувачу не обов'язково знати усі подробиці, щоб побудувати персоналізований рядок запиту.

source: A percent sign followed by a single character is expanded according to what the following character is:
uk: Символ відсотків, після якого вказано одинарний символ, буде розгорнуто відповідно до того, який з символів було використано:

source: Replaced by the byte offset into the current input file. The b is followed by a single character (shown as I<X> above) which specifies the line whose byte offset is to be used. If the character is a "t", the byte offset of the top line in the display is used, an "m" means use the middle line, a "b" means use the bottom line, a "B" means use the line just after the bottom line, and a "j" means use the "target" line, as specified by the -j option.
uk: Буде замінено на відступ у байтах у поточному файлі вхідних даних. Після b має бути вказано одинарний символ (який позначено вище як I<X>), який задає рядок, відступ якого буде використано. Якщо символом є «t» для показу буде використано відступ у байтах верхнього рядка екрана, «m» — використати для обчислень середній рядок екрана, «b» — нижній, «B» — рядок одразу за нижнім рядком екрана, а «j» — рядок «призначення», як його вказано за допомогою параметра -j.

source: Replaced by the size of the current input file.
uk: Буде замінено на розмір поточного файла вхідних даних.

source: Replaced by the column number of the text appearing in the first column of the screen.
uk: Буде замінено на номер позиції у рядку тексту, який відповідає показаному у першому стовпчику екрана.

source: Replaced by the page number of a line in the input file. The line to be used is determined by the I<X>, as with the %b option.
uk: Буде замінено на номер сторінки у файлі вхідних даних. Рядок, який буде використано, визначається I<X>, так само, як для параметра %b.

source: Replaced by the number of pages in the input file, or equivalently, the page number of the last line in the input file.
uk: Буде замінено на кількість сторінок у файлі вхідних даних, або, що те саме, на номер сторінки останнього рядка у файлі вхідних даних.

source: Replaced by the name of the editor (from the VISUAL environment variable, or the EDITOR environment variable if VISUAL is not defined). See the discussion of the LESSEDIT feature below.
uk: Буде замінено на назву редактора (зі змінної середовища VISUAL або змінної середовища EDITOR, якщо не встановлено значення змінної VISUAL). Див. обговорення LESSEDIT нижче.

source: Replaced by the name of the current input file.
uk: Буде замінено на назву поточного файла вхідних даних.

source: Replaced by the last component of the name of the current input file.
uk: Буде замінено на останній компонент назви поточного файла вхідних даних.

source: Replaced by the shell-escaped name of the current input file. This is useful when the expanded string will be used in a shell command, such as in LESSEDIT.
uk: Буде замінено на назву поточного файла вхідних даних з екрануванням для командної оболонки. Це корисно, якщо розгорнутий рядок буде використано у команді оболонки, зокрема у команді для LESSEDIT.

source: Replaced by the index of the current file in the list of input files.
uk: Буде замінено на індекс поточного файла у списку файлів вхідних даних.

source: Replaced by the line number of a line in the input file. The line to be used is determined by the I<X>, as with the %b option.
uk: Буде замінено на номер рядка у файлі вхідних даних. Рядок, який буде використано, визначається I<X>, так само, як для параметра %b.

source: Replaced by the line number of the last line in the input file.
uk: Буде замінено на номер останнього рядка у файлі вхідних даних.

source: Replaced by the total number of input files.
uk: Буде замінено на загальну кількість файлів вхідних даних.

source: Replaced by the percent into the current input file, based on byte offsets. The line used is determined by the I<X> as with the %b option.
uk: Буде замінено на частку у відсотках у поточному файлі вхідних даних на основі зсуву у байтах. Рядок, який буде використано для обчислень, буде визначено за аргументом I<X>, як і для параметра %b.

source: Replaced by the percent into the current input file, based on line numbers. The line used is determined by the I<X> as with the %b option.
uk: Буде замінено на частку у відсотках у поточному файлі вхідних даних на основі номерів рядків. Рядок, який буде використано для обчислень, буде визначено за аргументом I<X>, як і для параметра %b.

source: Same as %B.
uk: Те саме, що і %B.

source: Causes any trailing spaces to be removed. Usually used at the end of the string, but may appear anywhere.
uk: Наказує програмі вилучити усі кінцеві пробіли. Зазвичай, використовують наприкінці рядка, але можна використати будь-де.

source: Normally expands to the word "file". However if viewing files via a tags list using the -t option, it expands to the word "tag".
uk: Зазвичай, розгортається до слова «file». Втім, якщо перегляд файлів здійснюється з використанням списку міток з використанням параметра -t, розгортається до слова «tag».

source: Replaced by the name of the next input file in the list.
uk: Буде замінено на назву наступного файла вхідних даних у списку.

source: If any item is unknown (for example, the file size if input is a pipe), a question mark is printed instead.
uk: Якщо запис є невідомим (наприклад, розмір файла, якщо вхідні дані надходять каналом), буде виведено знак питання.

source: The format of the prompt string can be changed depending on certain conditions. A question mark followed by a single character acts like an "IF": depending on the following character, a condition is evaluated. If the condition is true, any characters following the question mark and condition character, up to a period, are included in the prompt. If the condition is false, such characters are not included. A colon appearing between the question mark and the period can be used to establish an "ELSE": any characters between the colon and the period are included in the string if and only if the IF condition is false. Condition characters (which follow a question mark) may be:
uk: Формат рядка запиту можна змінити залежно від певних умов. Символ знаку питання із наступним одинарним символом працює як «IF»: залежно від символу, буде перевірено умову. Якщо умова справджується, усі символи після символу знаку питання і символу умови, аж до крапки, буде включено до запиту. Якщо умова не справджується, ці символи не буде включено. Двокрапкою між знаком питання і крапкою можна скористатися для додавання «ELSE»: будь-які символи між двокрапкою і крапкою буде включено до рядка, якщо і лише якщо умова IF не справджуватиметься. Символи умов (які може бути вказано після знаку питання):

source: True if any characters have been included in the prompt so far.
uk: «Істина», якщо у запит включено будь-які символи.

source: True if the byte offset of the specified line is known.
uk: «Істина», якщо зсув у байтах вказаного рядка є відомим.

source: True if the size of current input file is known.
uk: «Істина», якщо розмір поточного файла вхідних даних є відомим.

source: True if the text is horizontally shifted (%c is not zero).
uk: «Істина, якщо текст зсунуто горизонтально (%c не є нульовим).

source: True if the page number of the specified line is known.
uk: «Істина», якщо відомим є номер сторінки вказаного рядка.

source: True if at end-of-file.
uk: «Істина», якщо перебуваємо на кінці файла.

source: True if there is an input filename (that is, if input is not a pipe).
uk: «Істина», якщо є назва файла вхідних даних (так буває, якщо вхідні дані не є каналом даних).

source: True if the line number of the specified line is known.
uk: «Істина», якщо номер вказаного рядка є відомим.

source: True if the line number of the last line in the file is known.
uk: «Істина», якщо відомим є номер останнього рядка у файлі.

source: True if there is more than one input file.
uk: «Істина», якщо є декілька файлів вхідних даних.

source: True if this is the first prompt in a new input file.
uk: «Істина», якщо цей перший запит у новому файлі вхідних даних.

source: True if the percent into the current input file, based on byte offsets, of the specified line is known.
uk: «Істина», якщо відсоткова частка у поточному файлі вхідних даних, на основі зсуву за байтами, для вказаного рядка є відомою.

source: True if the percent into the current input file, based on line numbers, of the specified line is known.
uk: «Істина», якщо відсоткова частка у поточному файлі вхідних даних, на основі кількості рядків, для вказаного рядка є відомою.

source: Same as "?B".
uk: Те саме, що і «?B».

source: True if there is a next input file (that is, if the current input file is not the last one).
uk: «Істина», якщо є наступний файл вхідних даних (тобто якщо поточний файл вхідних даних не є останнім у списку).

source: Any characters other than the special ones (question mark, colon, period, percent, and backslash) become literally part of the prompt. Any of the special characters may be included in the prompt literally by preceding it with a backslash.
uk: Будь-які символи, відмінні від спеціальних (знаку питання, двокрапки, крапки, відсотків та зворотної похилої риски) буде буквально відтворено у запиті. Будь-який зі спеціальних символів може бути включено у запит буквально, якщо перед ним вказати символ зворотної похилої риски.

source: Some examples:
uk: Декілька прикладів:

source: This prompt prints the filename, if known; otherwise the string "Standard input".
uk: Цей запит виводить назву файла, якщо така відома; якщо не відома, виводить рядок «Standard input».

source: This prompt would print the filename, if known. The filename is followed by the line number, if known, otherwise the percent if known, otherwise the byte offset if known. Otherwise, a dash is printed. Notice how each question mark has a matching period, and how the % after the %pt is included literally by escaping it with a backslash.
uk: Цей запит виводитиме назву файла, якщо така є відомою. Після назви файла буде показано номер рядка, якщо він є відомим. Якщо номер рядка є невідомим, буде показано зміщення у байтах, якщо він є відомим. Якщо зміщення є невідомим, буде виведено дефіс. Зауважте, що у кожного знаку питання є відповідна крапка, і що % після %pt буде включено буквально, оскільки його екрановано символом зворотної похилої риски.

source: This prints the filename if this is the first prompt in a file, followed by the "file N of N" message if there is more than one input file. Then, if we are at end-of-file, the string "(END)" is printed followed by the name of the next file, if there is one. Finally, any trailing spaces are truncated. This is the default prompt. For reference, here are the defaults for the other two prompts (-m and -M respectively). Each is broken into two lines here for readability only.
uk: Виведе назву файла, якщо це перший запит у файлі, далі повідомлення «file N of N», якщо файлів вхідних даних декілька. Потім, якщо ми перебуваємо на кінці файла, буде виведено рядок «(END)», і далі назву наступного файла, якщо такий існує. Нарешті, буде обрізано будь-які кінцеві пробіли. Це типовий запит. З довідковою метою тут наведено типові рядки для інших двох запитів (-m і -M, відповідно). Кожен з них розбито на два рядки для полегшення читання.

source: And here is the default message produced by the = command:
uk: І ось типове повідомлення, яке виводить команда =:

source: The prompt expansion features are also used for another purpose: if an environment variable LESSEDIT is defined, it is used as the command to be executed when the v command is invoked. The LESSEDIT string is expanded in the same way as the prompt strings. The default value for LESSEDIT is:
uk: Можливостями розгортання запитів можна також скористатися з іншою метою: якщо встановлено значення змінної середовища LESSEDIT, його буде використано як команду, яку слід виконати, при виклику команди v у less. Рядок LESSEDIT буде розгорнуто у такий самий спосіб, що і рядки запиту. Типовим значенням LESSEDIT є таке:

source: Note that this expands to the editor name, followed by a + and the line number, followed by the shell-escaped file name. If your editor does not accept the "+linenumber" syntax, or has other differences in invocation syntax, the LESSEDIT variable can be changed to modify this default.
uk: Зауважте, що результатом розгортання буде назва редактора, потім + і номер рядка, потім назва файла із екрануванням командної оболонки. Якщо ваш редактор не приймає синтаксичної конструкції «+номер_рядка» або має інші відмінності у синтаксисі виклику, слід внести зміни до значення змінної LESSEDIT для зміни типової поведінки.

source: SECURITY
uk: БЕЗПЕКА

source: When the environment variable LESSSECURE is set to 1, I<less> runs in a "secure" mode. This means these features are disabled:
uk: Якщо змінна середовища LESSSECURE має значення 1, I<less> працюватиме у «безпечному» режимі. Це означає, що такі можливості буде вимкнено:

source: the shell command
uk: команда оболонки

source: the pipe command
uk: команда конвеєра

source: the examine command.
uk: команда інспектування.

source: the editing command
uk: команда редагування

source: log files
uk: файли журналу

source: use of lesskey files
uk: використання файлів lesskey

source: use of tags files
uk: використання файлів tags

source: metacharacters in filenames, such as *
uk: метасимволи у назвах файлів, зокрема *

source: filename completion (TAB, ^L)
uk: доповнення назви файла (TAB, ^L)

source: Less can also be compiled to be permanently in "secure" mode.
uk: Крім того, less можна зібрати так, що програма постійно працюватиме у «безпечному» режимі.

source: COMPATIBILITY WITH MORE
uk: СУМІСНІСТЬ ІЗ MORE

source: If the environment variable LESS_IS_MORE is set to 1, or if the program is invoked via a file link named "more", I<less> behaves (mostly) in conformance with the POSIX "more" command specification. In this mode, less behaves differently in these ways:
uk: Якщо для змінної середовища LESS_IS_MORE встановлено значення 1 або якщо програму викликано за допомогою посилання на файл із назвою «more», I<less> поводитиме себе (загалом) відповідно до специфікації POSIX для команди «more». У цьому режимі less поводитиме себе інакше, ось так:

source: The -e option works differently. If the -e option is not set, I<less> behaves as if the -e option were set. If the -e option is set, I<less> behaves as if the -E option were set.
uk: Інакше працюватиме параметр -e. Якщо параметр -e не вказано, I<less> поводитиме себе так, наче параметр -e вказано. Якщо параметр -e вказано, I<less> поводитиме себе так, наче вказано параметр -E.

source: The -m option works differently. If the -m option is not set, the medium prompt is used, and it is prefixed with the string "--More--". If the -m option is set, the short prompt is used.
uk: Параметр -m працює інакше. Якщо параметр -m не встановлено, буде використано середній запит, у запиті буде вжито префікс — рядок «--More--». Якщо встановлено параметр -m, буде використано короткий запит.

source: The -n option acts like the -z option. The normal behavior of the -n option is unavailable in this mode.
uk: Параметр -n працює подібно до параметра -z. У цьому режимі звичайна поведінка параметра -n є недоступною.

source: The parameter to the -p option is taken to be a I<less> command rather than a search pattern.
uk: Аргумент параметра -p буде використано як команду I<less>, а не взірець для пошуку.

source: The LESS environment variable is ignored, and the MORE environment variable is used in its place.
uk: Змінну середовища LESS буде проігноровано, замість неї буде використано змінну середовища MORE.

source: ENVIRONMENT VARIABLES
uk: ЗМІННІ СЕРЕДОВИЩА

source: Environment variables may be specified either in the system environment as usual, or in a I<lesskey>(1) file. If environment variables are defined in more than one place, variables defined in a local lesskey file take precedence over variables defined in the system environment, which take precedence over variables defined in the system-wide lesskey file.
uk: Змінні середовища можна вказати або у середовищі системи у звичний спосіб, або у файлі I<lesskey>(1). Якщо змінні середовища визначено у декількох місцях, змінні, які визначено у локальному файлі lesskey, мають вищий пріоритет за визначені у загальносистемному середовищі, які мають вищий пріоритет за змінні, які визначено у загальносистемному файлі lesskey.

source: Sets the number of columns on the screen. Takes precedence over the number of columns specified by the TERM variable. (But if you have a windowing system which supports TIOCGWINSZ or WIOCGETD, the window system's idea of the screen size takes precedence over the LINES and COLUMNS environment variables.)
uk: Встановлює кількість стовпчиків на екрані. Має пріоритет над кількістю стовпчиків, які вказано змінною TERM. (Втім, якщо ви маєте справу із системами керування вікнами, у яких передбачено підтримку TIOCGWINSZ або WIOCGETD, параметри системи керування вікнами, які пов'язано із розміром екрана, мають пріоритет над змінними середовища LINES і COLUMNS.)

source: The name of the editor (used for the v command).
uk: Назва редактора (буде використано для команди v).

source: Name of the user's home directory (used to find a lesskey file on Unix and OS/2 systems).
uk: Назва домашнього каталогу користувача (буде використано для пошуку файла lesskey у системах Unix та OS/2).

source: Concatenation of the HOMEDRIVE and HOMEPATH environment variables is the name of the user's home directory if the HOME variable is not set (only in the Windows version).
uk: Об'єднанням змінних середовища HOMEDRIVE і HOMEPATH є назва домашнього каталогу користувача, якщо не встановлено значення змінної HOME (лише у версії для Windows).

source: Name of the user's init directory (used to find a lesskey file on OS/2 systems).
uk: Назва каталогу ініціалізації облікового запису користувача (буде використано для пошуку файла lesskey у системах OS/2).

source: Language for determining the character set.
uk: Мова для визначення набору символів.

source: Options which are passed to I<less> automatically.
uk: Параметри, які передано I<less> автоматично.

source: Characters which may end an ANSI color escape sequence (default "m").
uk: Символи, які можуть завершувати екрановану послідовність кольору ANSI (типовим є «m»).

source: Characters which may appear between the ESC character and the end character in an ANSI color escape sequence (default "0123456789:;[?!"'#%()*+\ ".
uk: Символи, які може бути використано між символом ESC і кінцевим символом у керівній послідовності кольору ANSI (типові символи: «0123456789:;[?!"'#%()*+\ »).

source: Format for displaying non-printable, non-control characters.
uk: Формат показу непридатних до друку некерівних символів.

source: Defines a character set.
uk: Визначає набір символів.

source: Selects a predefined character set.
uk: Вибирає попередньо визначений набір символів.

source: Command line to invoke the (optional) input-postprocessor.
uk: Рядок команди для виклику (необов'язкового) засобу остаточної обробки вхідних даних.

source: Name of the lessecho program (default "lessecho"). The lessecho program is needed to expand metacharacters, such as * and ?, in filenames on Unix systems.
uk: Назва програми lessecho (типово, «lessecho»). Програма lessecho потрібна для розгортання метасимволів, зокрема * і ? у назвах файлів у системах Unix.

source: Editor prototype string (used for the v command). See discussion under PROMPTS.
uk: Рядок прототипу редактора (буде використано у команді v). Див. обговорення у розділі «ЗАПИТИ».

source: Name of the command used by the -t option to find global tags. Normally should be set to "global" if your system has the I<global>(1) command. If not set, global tags are not used.
uk: Назва команди, яку буде використано при використанні параметра -t для пошуку загальних міток. Зазвичай, має бути встановлено значення «global», якщо у вашій системі є команда I<global>(1). Якщо значення змінної не встановлено, загальні мітки не буде використано.

source: The maximum number of commands to save in the history file. The default is 100.
uk: Максимальна кількість команд, які буде збережено у файлі журналу. Типовим значенням є 100.

source: Name of the default I<lesskey source> file.
uk: Назва типового файла I<початкового коду lesskey>.

source: Name of the default I<lesskey binary> file. (Not used if "$LESSKEYIN" exists.)
uk: Назва типового I<двійкового файла lesskey>. (Не буде використано, якщо існує «$LESSKEYIN».)

source: Name of the default system-wide I<lesskey source> file.
uk: Назва типового загальносистемного файла I<початкового коду lesskey>.

source: Name of the default system-wide I<lesskey binary> file. (Not used if "$LESSKEYIN_SYSTEM" exists.)
uk: Назва типового загальносистемного I<двійкового файла lesskey>. (Не використовується якщо існує «$LESSKEYIN_SYSTEM».)

source: List of characters which are considered "metacharacters" by the shell.
uk: Список символів, які оболонка вважає «метасимволами».

source: Prefix which less will add before each metacharacter in a command sent to the shell. If LESSMETAESCAPE is an empty string, commands containing metacharacters will not be passed to the shell.
uk: Префікс, який less додасть перед кожним метасимволом у команді, яку буде надіслано до командної оболонки. Якщо значенням LESSMETAESCAPE є порожній рядок, команди, які містять метасимволи, не буде передано командній оболонці.

source: Command line to invoke the (optional) input-preprocessor.
uk: Рядок команди для виклику (необов'язкового) засобу попередньої обробки вхідних даних.

source: Runs less in "secure" mode. See discussion under SECURITY.
uk: Запускає less у «безпечному» режимі. Див. обговорення у розділі БЕЗПЕКА.

source: String to be appended to a directory name in filename completion.
uk: Рядок, який слід дописати до назви каталогу при доповненні назв файлів.

source: Format for displaying non-printable Unicode code points.
uk: Формат показу непридатних до друку символів Unicode.

source: Emulate the I<more>(1) command.
uk: Імітувати команду I<more>(1).

source: Sets the number of lines on the screen. Takes precedence over the number of lines specified by the TERM variable. (But if you have a windowing system which supports TIOCGWINSZ or WIOCGETD, the window system's idea of the screen size takes precedence over the LINES and COLUMNS environment variables.)
uk: Встановлює кількість рядків на екрані. Має пріоритет над кількістю рядків, які вказано змінною TERM. (Втім, якщо ви маєте справу із системами керування вікнами, у яких передбачено підтримку TIOCGWINSZ або WIOCGETD, параметри системи керування вікнами, які пов'язано із розміром екрана, мають пріоритет над змінними середовища LINES і COLUMNS.)

source: Options which are passed to I<less> automatically when running in I<more> compatible mode.
uk: Параметри, які буде передано до I<less> автоматично при запуску сумісному із I<more> режимі.
