Repository: sebras/manpages-l10n
Catalog: po/*/man1/less.1.po
Languages: uk

source: Examine a new file. If the filename is missing, the "current" file (see the :n and :p commands below) from the list of files in the command line is re-examined. A percent sign (%) in the filename is replaced by the name of the current file. A pound sign (#) is replaced by the name of the previously examined file. However, two consecutive percent signs are simply replaced with a single percent sign. This allows you to enter a filename that contains a percent sign in the name. Similarly, two consecutive pound signs are replaced with a single pound sign. The filename is inserted into the command line list of files so that it can be seen by subsequent :n and :p commands. If the filename consists of several files, they are all inserted into the list of files and the first one is examined. If the filename contains one or more spaces, the entire filename should be enclosed in double quotes (also see the -" option).
uk: Інспектувати новий файл. Якщо не вказано назви файла, буде повторно інспектовано «поточний» файл (див. команди :n і :p нижче) зі списку файлів у рядку команди. Символ відсотків (%) у назві файла буде замінено на назву поточного файла. Символ решітки (#) буде замінено на назву попереднього інспектованого файла. Втім, два послідовних символи відсотків буде просто замінено на одинарний символ відсотків. У такий спосіб можна вводити назви файлів, які містять символ відсотків. Так само, два послідовних символів решітки буде замінено на одинарний символ решітки. Назву файла буде вставлено до списку файлів рядка команди, отже, її можна буде переглянути, скориставшись наступними командами :n і :p. Якщо назва файла складається з декількох назв файлів, їх усі буде вставлено до списку файлів, а перший буде відкрито для інспектування. Якщо у назві файла міститься один або декілька пробілів, усю назву слід взяти у подвійні лапки (див. також параметр -").

source: ^X^V or E
uk: ^X^V або E

source: Same as :e. Warning: some systems use ^V as a special literalization character. On such systems, you may not be able to use ^V.
uk: Те саме, що і :e. Попередження: у деяких системах ^V є особливим символом переходу до буквального режиму. У таких системах ви не зможете користуватися ^V.

source: Examine the next file (from the list of files given in the command line). If a number N is specified, the N-th next file is examined.
uk: Інспектувати наступний файл (зі списку файлів, які надано у рядку команди). Якщо вказано число N, буде виконано інспектування наступного N-го файла.

source: Examine the previous file in the command line list. If a number N is specified, the N-th previous file is examined.
uk: Інспектувати попередній файл у списку рядка команди. Якщо вказано число N, буде виконано інспектування попереднього N-го файла.

source: Examine the first file in the command line list. If a number N is specified, the N-th file in the list is examined.
uk: Інспектувати перший файл у списку рядка команди. Якщо вказано число N, буде виконано інспектування N-го файла у списку.

source: Remove the current file from the list of files.
uk: Вилучити поточний файл зі списку файлів.

source: Go to the next tag, if there were more than one matches for the current tag. See the -t option for more details about tags.
uk: Перейти до наступної мітки, якщо було декілька відповідників для поточної мітки. Див. параметр -t, щоб дізнатися більше про мітки.

source: Go to the previous tag, if there were more than one matches for the current tag.
uk: Перейти до попередньої мітки, якщо було декілька відповідників для поточної мітки.

source: = or ^G or :f
uk: =, або ^G, або :f

source: Prints some information about the file being viewed, including its name and the line number and byte offset of the bottom line being displayed. If possible, it also prints the length of the file, the number of lines in the file and the percent of the file above the last displayed line.
uk: Виводить деякі відомості щодо показаного файла, зокрема його назву та номер рядка, а також відступ нижнього показаного рядка щодо початку файла. Якщо це можливо, також виводить довжину файла, кількість рядків у файлі та частку файла над останнім показаним рядком у відсотках.

source: Followed by one of the command line option letters (see OPTIONS below), this will change the setting of that option and print a message describing the new setting. If a ^P (CONTROL-P) is entered immediately after the dash, the setting of the option is changed but no message is printed. If the option letter has a numeric value (such as -b or -h), or a string value (such as -P or -t), a new value may be entered after the option letter. If no new value is entered, a message describing the current setting is printed and nothing is changed.
uk: Якщо ввести одну з літер параметрів командного рядка одразу після дефіса (див. ПАРАМЕТРИ нижче), програма застосує вказаний параметр і виведе повідомлення з описом нового стану. Якщо після дефіса одразу буде введено ^P (Ctrl-P), буде змінено значення параметра, але повідомлення виведено не буде. Якщо у літери параметра є числове значення (наприклад, маємо -b або -h) або рядкове значення (наприклад, маємо -P або -t), нове значення можна буде ввести після літери параметра. Якщо нового значення введено не буде, буде виведено повідомлення щодо поточного стану параметра, а змін внесено не буде.

source: Like the - command, but takes a long option name (see OPTIONS below) rather than a single option letter. You must press ENTER or RETURN after typing the option name. A ^P immediately after the second dash suppresses printing of a message describing the new setting, as in the - command.
uk: Подібна до команди -, але приймає довгу назву параметра (див. ПАРАМЕТРИ нижче), але не одинарну літеру параметра. Вам слід натиснути ENTER або RETURN після введення назви параметра. Натискання ^P одразу після другого дефіса придушує виведення повідомлення, яке описує нове значення параметра, як у команді -.

source: Followed by one of the command line option letters this will reset the option to its default setting and print a message describing the new setting. (The "-+I<X>" command does the same thing as "-+I<X>" on the command line.) This does not work for string-valued options.
uk: Якщо далі введено одну з літер параметрів командного рядка, значення відповідного параметра буде скинуто до типового, а програма виведе повідомлення, яке описує нове значення параметра. (Команда «-+I<X>» дає той самий результат, що і «-+I<X>» у рядку команди.) Це не працює для параметрів із рядковими значеннями.

source: Like the -+ command, but takes a long option name rather than a single option letter.
uk: Подібне до команди -+, але приймає довгий варіант назви параметра, а не односимвольний запис параметра.

source: Followed by one of the command line option letters, this will reset the option to the "opposite" of its default setting and print a message describing the new setting. This does not work for numeric or string-valued options.
uk: Якщо далі введено одну з літер параметрів командного рядка, значення відповідного параметра буде скинуто до протилежного до типового, а програма виведе повідомлення, яке описує нове значення параметра. Це не працює для параметрів із числовими або рядковими значеннями.

source: Like the -!\& command, but takes a long option name rather than a single option letter.
uk: Подібне до команди -!\&, але приймає довгий варіант назви параметра, а не односимвольний запис параметра.

source: (Underscore.) Followed by one of the command line option letters, this will print a message describing the current setting of that option. The setting of the option is not changed.
uk: (Підкреслення.) Якщо після підкреслення введено одну з літер параметрів командного рядка, команда виведе повідомлення, яке описує стан параметра. Значення параметра не буде змінено.

source: (Double underscore.) Like the _ (underscore) command, but takes a long option name rather than a single option letter. You must press ENTER or RETURN after typing the option name.
uk: (Подвійне підкреслювання.) Подібна до команди _ (підкреслювання), але приймає довгу назву параметра, але не одинарну літеру параметра. Вам слід натиснути ENTER або RETURN після введення назви параметра.

source: +cmd
uk: +команда

source: Causes the specified cmd to be executed each time a new file is examined. For example, +G causes I<less> to initially display each file starting at the end rather than the beginning.
uk: Спричиняє виконання вказаної команди кожного разу, коли буде інспектовано новий файл. Наприклад, +G спричиняє I<less> показ усіх файлів від початку з кінця, а не з початку.

source: Prints the version number of I<less> being run.
uk: Вивести номер версії запущеного I<less>.

source: q or Q or :q or :Q or ZZ
uk: q, або Q, або :q, або :Q, або ZZ

source: Exits I<less>.
uk: Завершує роботу I<less>.

source: The following four commands may or may not be valid, depending on your particular installation.
uk: Вказані нижче чотири команди можуть бути чинними або нечинними, залежно від конкретної збірки програми.

source: Invokes an editor to edit the current file being viewed. The editor is taken from the environment variable VISUAL if defined, or EDITOR if VISUAL is not defined, or defaults to "vi" if neither VISUAL nor EDITOR is defined. See also the discussion of LESSEDIT under the section on PROMPTS below.
uk: Викликає редактор для редагування поточного файла, який ви переглядаєте. Редактор буде визначено зі змінної середовища VISUAL, якщо її визначено, або EDITOR, якщо VISUAL не визначено, або, типово, «vi», якщо не визначено ні VISUAL, ні EDITOR. Див. також обговорення LESSEDIT у розділі «ЗАПИТИ» нижче.

source: ! shell-command
uk: ! команда-оболонки

source: Invokes a shell to run the shell-command given. A percent sign (%) in the command is replaced by the name of the current file. A pound sign (#) is replaced by the name of the previously examined file. "!!" repeats the last shell command. "!" with no shell command simply invokes a shell. On Unix systems, the shell is taken from the environment variable SHELL, or defaults to "sh". On MS-DOS and OS/2 systems, the shell is the normal command processor.
uk: Викликає командну оболонку для запуску команди оболонки. Символ відсотків (%) у команді буде замінено на назву поточного файла. Символ решітки (#) буде замінено назвою попереднього інспектованого файла. «!!» повторює останню команду оболонки. «!» без команди оболонки просто викликає оболонку. У системах Unix команду оболонки буде визначено за змінною середовища SHELL або використано типову — sh. У системах MS-DOS і OS/2 оболонка є звичайним обробником команд.

source: | E<lt>mE<gt> shell-command
uk: | E<lt>mE<gt> команда-оболонки

source: E<lt>mE<gt> represents any mark letter. Pipes a section of the input file to the given shell command. The section of the file to be piped is between the position marked by the letter and the current screen. The entire current screen is included, regardless of whether the marked position is before or after the current screen. E<lt>mE<gt> may also be ^ or $ to indicate beginning or end of file respectively. If E<lt>mE<gt> is \&.\& or newline, the current screen is piped.
uk: E<lt>mE<gt> відповідає будь-якій літері позначки. Передає частину файла вхідних даних заданій команді оболонки. Переданою частиною файла буде частина між позицією, яка визначається літерою і поточним екраном. Буде включено увесь поточний екран, незалежно від того, перебуває поточна позиція перед чи після поточного екрана. E<lt>mE<gt> також може бути ^ або $ для позначення початку або кінця файла, відповідно. Якщо E<lt>mE<gt> є \&.\& або символом нового рядка, буде передано поточний екран.

source: s filename
uk: s назва_файла

source: Save the input to a file. This only works if the input is a pipe, not an ordinary file.
uk: Зберегти вхідні дані до файла. Працює, лише якщо вхідні дані є каналом, а не звичайним файлом.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Command line options are described below. Most options may be changed while I<less> is running, via the "-" command.
uk: Нижче наведено параметри командного рядка. Більшість параметрів може бути змінено під час роботи I<less> за допомогою команди «-».

source: Most options may be given in one of two forms: either a dash followed by a single letter, or two dashes followed by a long option name. A long option name may be abbreviated as long as the abbreviation is unambiguous. For example, --quit-at-eof may be abbreviated --quit, but not --qui, since both --quit-at-eof and --quiet begin with --qui. Some long option names are in uppercase, such as --QUIT-AT-EOF, as distinct from --quit-at-eof. Such option names need only have their first letter capitalized; the remainder of the name may be in either case. For example, --Quit-at-eof is equivalent to --QUIT-AT-EOF.
uk: Більшість параметрів може бути передано у двох формах: дефіс із наступною одинарною літерою або два дефіси із наступною довгою назвою параметра. Довгу назву параметра можна скоротити до рядка, який визначатиме її однозначно. Наприклад, --quit-at-eof можна скоротити до --quit, але не до --qui, оскільки на --qui починаються параметри --quit-at-eof і --quiet. Деякі назви довгих параметрів визначаються великими літерами, зокрема --QUIT-AT-EOF, на відміну від --quit-at-eof. У таких назвах параметрів можна вказати лише першу велику літеру, а решту літер вказати у будь-якому регістрі. Наприклад, --Quit-at-eof є тим самим, що і --QUIT-AT-EOF.

source: Options are also taken from the environment variable "LESS". For example, to avoid typing "less -options \&...\&" each time I<less> is invoked, you might tell I<csh>:
uk: Крім того, програма приймає параметри від змінної середовища «LESS». Наприклад, щоб не вводити «less -параметри \&...\&» кожного разу, коли ви викликаєте I<less>, ви можете скомандувати I<csh>:

source: setenv LESS "-options"
uk: setenv LESS "-параметри"

source: or if you use I<sh>:
uk: або, якщо ви користуєтеся I<sh>:

source: LESS="-options"; export LESS
uk: LESS="-параметри"; export LESS

source: On MS-DOS, you don't need the quotes, but you should replace any percent signs in the options string by double percent signs.
uk: В MS-DOS потреби у лапках немає, але вам слід замінити усі символи відсотків у рядку параметрів подвійними символами відсотків.

source: The environment variable is parsed before the command line, so command line options override the LESS environment variable. If an option appears in the LESS variable, it can be reset to its default value on the command line by beginning the command line option with "-+".
uk: Змінну середовища буде оброблено перед рядком команди, тому параметри рядка команди мають вищий пріоритет за змінну середовища LESS. Якщо параметр вказано у змінній LESS, його можна скинути до типового значення у рядку команди, розпочавши параметр рядка команд з «-+».

source: Some options like -k or -D require a string to follow the option letter. The string for that option is considered to end when a dollar sign ($) is found. For example, you can set two -D options on MS-DOS like this:
uk: Деякі параметри, зокрема -k та -D, потребують рядка за літерою параметра. Рядок для цього параметра вважається завершеним на символі долара ($). Наприклад, ви можете вказати два параметри -D у MS-DOS ось так:

source: If the --use-backslash option appears earlier in the options, then a dollar sign or backslash may be included literally in an option string by preceding it with a backslash. If the --use-backslash option is not in effect, then backslashes are not treated specially, and there is no way to include a dollar sign in the option string.
uk: Якщо у початковому блоці параметрів було використано параметр --use-backslash, наступні за ним символи долара або зворотної похилої риски може бути включено буквально до прядка параметрів, якщо перед ними вказати символ зворотної похилої риски. Якщо параметр --use-backslash вимкнено, зворотні похилі риски не оброблятимуться особливим чином, і символ долара не можна буде включити до рядка параметрів.

source: -? or --help
uk: -? або --help

source: This option displays a summary of the commands accepted by I<less> (the same as the h command). (Depending on how your shell interprets the question mark, it may be necessary to quote the question mark, thus: "-\e?".)
uk: За допомогою цього параметра можна переглянути резюме щодо команд, які приймає I<less> (те саме, що і для команди h). (Залежно від того, як в командній оболонці буде оброблено символ знаку питання, можливо, доведеться брати знаки питання у лапки, ось так: "-\e?".)

source: -a or --search-skip-screen
uk: -a або --search-skip-screen

source: By default, forward searches start at the top of the displayed screen and backwards searches start at the bottom of the displayed screen (except for repeated searches invoked by the n or N commands, which start after or before the "target" line respectively; see the -j option for more about the target line). The -a option causes forward searches to instead start at the bottom of the screen and backward searches to start at the top of the screen, thus skipping all lines displayed on the screen.
uk: Типово, пошук вперед розпочинається з верхнього рядка показаного екрана, пошук назад — з нижнього рядка показаного екрана (окрім повторних пошуків, які викликано командами n і N; ці пошуки розпочинаються після або перед рядком-ціллю, відповідно; див. опис параметра -j, щоб дізнатися більше про рядок-ціль). Використання параметра -a призведе того, що пошук вперед буде виконано від нижнього рядка екрана, а пошук назад — від верхнього рядка, тобто буде пропущено усі рядки, які показано на екрані.

source: -A or --SEARCH-SKIP-SCREEN
uk: -A або --SEARCH-SKIP-SCREEN

source: Causes all forward searches (not just non-repeated searches) to start just after the target line, and all backward searches to start just before the target line. Thus, forward searches will skip part of the displayed screen (from the first line up to and including the target line). Similarly backwards searches will skip the displayed screen from the last line up to and including the target line. This was the default behavior in less versions prior to 441.
uk: Наказує програмі розпочинати усі пошуки вперед (не лише неповторювані пошуки) одразу після рядка призначення, а усі пошуки назад — перед рядком призначення. Таким чином, при пошуку вперед буде пропущено частину показаного екрана (від першого рядка і до рядка призначення, включно). Так само, пошуки назад пропускатимуть показаний екран з останнього рядка вгору і включно із рядком призначення. Це була типова поведінка less до версії 441.

source: -bI<n> or --buffers=I<n>
uk: -bI<n> або --buffers=I<n>

source: Specifies the amount of buffer space I<less> will use for each file, in units of kilobytes (1024 bytes). By default 64\ KB of buffer space is used for each file (unless the file is a pipe; see the -B option). The -b option specifies instead that I<n> kilobytes of buffer space should be used for each file. If I<n> is -1, buffer space is unlimited; that is, the entire file can be read into memory.
uk: Вказує, який об'єм буфера I<less> використовуватиме для кожного файла у одиницях кілобайтів (1024 байтів). Типово, для кожного файла буде використано об'єм буфера 64\ кБ (якщо файл не є каналом; див. параметр -B). Параметр -b вказує, що слід використати для кожного файла буфер розміром I<n> кілобайтів. Якщо для I<n> вказано -1, розмір буфера не буде обмежено; тобто, до пам'яті буде прочитано увесь файл.

source: -B or --auto-buffers
uk: -B або --auto-buffers

source: By default, when data is read from a pipe, buffers are allocated automatically as needed. If a large amount of data is read from the pipe, this can cause a large amount of memory to be allocated. The -B option disables this automatic allocation of buffers for pipes, so that only 64\ KB (or the amount of space specified by the -b option) is used for the pipe. Warning: use of -B can result in erroneous display, since only the most recently viewed part of the piped data is kept in memory; any earlier data is lost.
uk: Типово, при читанні з каналу даних, буфери буде розподілено автоматично, за потреби. Якщо з каналу даних буде прочитано великий об'єм даних, буде отримано великий об'єм пам'яті. Використання параметра -B вимикає такий автоматичний розподіл буферів для каналів даних, отже, буде використано лише 64\ кБ (або об'єм пам'яті, який визначено за допомогою параметра -b) для каналу даних. Попередження: використання параметра -B може призвести до некоректного показу даних, оскільки у пам'яті зберігатиметься лише найостанніша переглянута частина даних з каналу; попередні ж дані буде втрачено.

source: -c or --clear-screen
uk: -c або --clear-screen

source: Causes full screen repaints to be painted from the top line down. By default, full screen repaints are done by scrolling from the bottom of the screen.
uk: Спричиняє перемальовування усього екрана з верхнього рядка униз. Типово, перемальовування екрана відбувається гортанням з нижньої частини екрана.

source: -C or --CLEAR-SCREEN
uk: -C або --CLEAR-SCREEN

source: Same as -c, for compatibility with older versions of I<less>.
uk: Те саме, що і -c, для сумісності із застарілими версіями I<less>.

source: -d or --dumb
uk: -d або --dumb

source: The -d option suppresses the error message normally displayed if the terminal is dumb; that is, lacks some important capability, such as the ability to clear the screen or scroll backward. The -d option does not otherwise change the behavior of I<less> on a dumb terminal.
uk: Параметр -d придушує повідомлення про помилку, яке буде типово показано, якщо терміналу не вистачає якихось можливостей, зокрема можливості очищення екрана або гортання назад. В інших випадках параметр -d не змінює поведінку I<less> на поведінку програми у такому обмеженому терміналі.

source: -DB<x>I<color> or --color=B<x>I<color>
uk: -DB<x>I<колір> або --color=B<x>I<колір>

source: Changes the color of different parts of the displayed text. B<x> is a single character which selects the type of text whose color is being set:
uk: Змінює колір різних частин показаного тексту. B<x> є одинарним символом, який вибирає тип тексту, для якого буде встановлено колір:

source: Binary characters.
uk: Двійкові символи.

source: Control characters.
uk: Керівні символи.

source: Errors and informational messages.
uk: Помилки та інформаційні повідомлення.

source: Mark letters in the status column.
uk: Позначати літери у стовпчику стану.

source: Line numbers enabled via the -N option.
uk: Номери рядків можна увімкнути параметром -N.

source: Prompts.
uk: Запити.

source: The rscroll character.
uk: Символ rscroll.

source: Search results.
uk: Результати пошуку.

source: The highlight enabled via the -w option.
uk: Підсвічування можна увімкнути параметром -w.

source: Bold text.
uk: Текст напівжирним.

source: Blinking text.
uk: Текст, що блимає.

source: Standout text.
uk: Виокремлений текст.

source: Underlined text.
uk: Підкреслений текст.
