Repository: sebras/manpages-l10n
Catalog: po/*/man1/localectl.1.po
Languages: pt_br

source: NAME
pt_br: NOME

source: localectl - Control the system locale and keyboard layout settings
pt_br: localectl - Controla as configurações do layout de teclado e da localidade do sistema

source: SYNOPSIS
pt_br: SINOPSE

source: B<localectl> [OPTIONS...] {COMMAND}
pt_br: B<localectl> [OPÇÕES...] {COMANDO}

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: B<localectl> may be used to query and change the system locale and keyboard layout settings\&. It communicates with B<systemd-localed>(8) to modify files such as /etc/locale\&.conf and /etc/vconsole\&.conf\&.
pt_br: B<localectl> pode ser usado para consultar e alterar as configurações do layout de teclado e da localidade do sistema\&. Ele se comunica com B<systemd-localed>(8) para modificar arquivos como /etc/locale\&.conf e /etc/vconsole\&.conf\&.

source: The system locale controls the language settings of system services and of the UI before the user logs in, such as the display manager, as well as the default for users after login\&.
pt_br: A localidade do sistema controla as configurações de idioma dos serviços do sistema e da UI antes do usuário se autenticar, tal como o gerenciador de exibição, bem como o padrão para usuários após estar autenticado\&

source: The keyboard settings control the keyboard layout used on the text console and of the graphical UI before the user logs in, such as the display manager, as well as the default for users after login\&.
pt_br: As configurações de teclado controlam o layout de teclado usado no console de texto e da UI gráfica antes do usuário se autenticar, tal como o gerenciador de exibição, bem como o padrão para usuários após estar autenticado\&

source: Note that B<systemd-firstboot>(1) may be used to initialize the system locale for mounted (but not booted) system images\&.
pt_br: Observe que B<systemd-firstboot>(1) pode ser usado para inicializar a localidade do sistema para imagens montadas (mas não inicializadas) do sistema\&.

source: COMMANDS
pt_br: COMANDOS

source: The following commands are understood:
pt_br: Os seguintes comandos são aceitos:

source: Show current settings of the system locale and keyboard mapping\&. If no command is specified, this is the implied default\&.
pt_br: Mostra as configurações atuais da localidade do sistema e mapeamento de teclado\&. Se nenhum comando for especificado, isto está implícito por padrão\&.

source: B<set-locale LOCALE>, B<set-locale VARIABLE=LOCALE\&...>
pt_br: B<set-locale LOCALIDADE>, B<set-locale VARIÁVEL=LOCALIDADE\&...>

source: Set the system locale\&. This takes one locale such as "en_US\&.UTF-8", or takes one or more locale assignments such as "LANG=de_DE\&.utf8", "LC_MESSAGES=en_GB\&.utf8", and so on\&. If one locale without variable name is provided, then "LANG=" locale variable will be set\&. See B<locale>(7) for details on the available settings and their meanings\&. Use B<list-locales> for a list of available locales (see below)\&.
pt_br: Define a localidade do sistema\&. Recebe uma localidade como "en_US\&.UTF-8" ou recebe uma ou mais atribuições de localidades tais como "LANG=de_DE\&.utf8", "LC_MESSAGES=en_GB\&.utf8" e por aí vai\&. Se uma localidade sem nome de variável é fornecida, então a variável de localidade "LANG=" será definida\&. Consulte B<locale>(7) para detalhes nas configurações disponíveis e seus significados\&. Use B<list-locales> para uma lista de localidades disponíveis (consulte abaixo)\&.

source: List available locales useful for configuration with B<set-locale>\&.
pt_br: Lista as localidades disponíveis úteis para configurações com B<set-locale>\&.

source: B<set-keymap MAP [TOGGLEMAP]>
pt_br: B<set-keymap MAPA [MAPA_ALTERNATIVO]>

source: Set the system keyboard mapping for the console and X11\&. This takes a mapping name (such as "de" or "us"), and possibly a second one to define a toggle keyboard mapping\&. Unless B<--no-convert> is passed, the selected setting is also applied as the default system keyboard mapping of X11, after converting it to the closest matching X11 keyboard mapping\&. Use B<list-keymaps> for a list of available keyboard mappings (see below)\&.
pt_br: Define o mapeamento de teclado do sistema para o console e o X11\&. Recebe um nome de mapeamento (como "de" ou "us") e possivelmente um segundo para definir um mapeamento de teclado alternativo\&. A menos que B<--no-convert> seja passado, a configuração selecionada também é aplicada como o mapeamento padrão de teclado do sistema para X11, após convertê-lo para correspondência mais próxima de mapeamento de teclado para X11\&. Use B<list-keymaps> para uma lista de mapeamentos de teclado disponíveis (veja abaixo)\&.

source: List available keyboard mappings for the console, useful for configuration with B<set-keymap>\&.
pt_br: Lista mapeamentos de teclado disponíveis par o console, útil para a configuração com B<set-keymap>\&.

source: B<set-x11-keymap LAYOUT [MODEL [VARIANT [OPTIONS]]]>
pt_br: B<set-x11-keymap LAYOUT [MODELO [VARIANTE [OPÇÕES]]]>

source: Set the system default keyboard mapping for X11 and the virtual console\&. This takes a keyboard mapping name (such as "de" or "us"), and possibly a model, variant, and options, see B<kbd>(4) for details\&. Unless B<--no-convert> is passed, the selected setting is also applied as the system console keyboard mapping, after converting it to the closest matching console keyboard mapping\&.
pt_br: Define o mapeamento de teclado padrão do sistema para X11 e o console virtual\&. Recebe um nome de mapeamento de teclado (como "de" ou "us") e, possivelmente, um modelo, variante e opções, consulte B<kbd>(4) para obter detalhes\&. A menos que B<--no-convert> seja passado, a configuração selecionada também é aplicada como o mapeamento do teclado do console do sistema, após convertê-lo para o mapeamento de teclado do console mais próximo\&.

source: List available X11 keymap models, layouts, variants and options, useful for configuration with B<set-keymap>\&. The command B<list-x11-keymap-variants> optionally takes a layout parameter to limit the output to the variants suitable for the specific layout\&.
pt_br: Lista os modelos de teclado X11 disponíveis, layouts, variantes e opções, úteis para configuração com B<set-keymap>\&. O comando B<list-x11-keymap-variants>, opcionalmente, recebe um parâmetro de layout para limitar a saída às variantes adequadas para o layout específico\&.

source: OPTIONS
pt_br: OPÇÕES

source: The following options are understood:
pt_br: As seguintes opções são aceitas:

source: Do not query the user for authentication for privileged operations\&.
pt_br: Não pergunta ao usuário por autenticação para operações privilegiadas\&.

source: If B<set-keymap> or B<set-x11-keymap> is invoked and this option is passed, then the keymap will not be converted from the console to X11, or X11 to console, respectively\&.
pt_br: Se B<set-keymap> ou B<set-x11-keymap> é chamado e esta opção é passada, então o mapa de teclas não será convertido do console para X11, ou X11 para console, respectivamente\&.

source: Execute the operation remotely\&. Specify a hostname, or a username and hostname separated by "@", to connect to\&. The hostname may optionally be suffixed by a port ssh is listening on, separated by ":", and then a container name, separated by "/", which connects directly to a specific container on the specified host\&. This will use SSH to talk to the remote machine manager instance\&. Container names may be enumerated with B<machinectl -H >I<HOST>\&. Put IPv6 addresses in brackets\&.
pt_br: Executa a operação remotamente\&. Especifique um nome de host, ou um nome de usuário e nome de host separados por "@", para se conectar\&. O nome do host pode opcionalmente ser sufixado por uma porta na qual o ssh está escutando, separado por ":" e, em seguida, um nome de contêiner, separado por "/", que se conecta diretamente a um contêiner específico no host especificado\&. Isso usará SSH para se comunicar com a instância do gerenciador de máquina remota\&. Os nomes dos contêineres podem ser enumerados com B<machinectl -H>I<HOST>\&. Coloque os endereços IPv6 entre colchetes\&.

source: Execute operation on a local container\&. Specify a container name to connect to, optionally prefixed by a user name to connect as and a separating "@" character\&. If the special string "\&.host" is used in place of the container name, a connection to the local system is made (which is useful to connect to a specific user\*(Aqs user bus: "--user --machine=lennart@\&.host")\&. If the "@" syntax is not used, the connection is made as root user\&. If the "@" syntax is used either the left hand side or the right hand side may be omitted (but not both) in which case the local user name and "\&.host" are implied\&.
pt_br: Executa a operação em um contêiner local\&. Especifique um nome de contêiner para se conectar, opcionalmente prefixado por um nome de usuário para se conectar e um caractere de separação "@"\&. Se a string especial "\&.host" for usada no lugar do nome do contêiner, uma conexão com o sistema local é feita (o que é útil para se conectar a um barramento de usuário especifício para o usuário: "--user --machine=lennart@\&.host")\&. Se a sintaxe "@" não for usada, a conexão será feita como usuário root\&. Se a sintaxe "@" for usada do lado esquerdo ou direito, pode ser omitido (mas não ambos), caso em que o nome de usuário local e "\&.host" estão implícitos\&.

source: Print a short help text and exit\&.
pt_br: Imprime um texto de ajuda curto e sai\&.

source: Print a short version string and exit\&.
pt_br: Imprime uma string curta de versão e sai\&.

source: Do not pipe output into a pager\&.
pt_br: Não encadeia a saída para um paginador\&.

source: EXIT STATUS
pt_br: STATUS DE SAÍDA

source: On success, 0 is returned, a non-zero failure code otherwise\&.
pt_br: Em caso de sucesso, 0 é retornado; do contrário, é um código de falha não zero\&.

source: ENVIRONMENT
pt_br: AMBIENTE

source: The maximum log level of emitted messages (messages with a higher log level, i\&.e\&. less important ones, will be suppressed)\&. Either one of (in order of decreasing importance) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, or an integer in the range 0\&...7\&. See B<syslog>(3) for more information\&.
pt_br: O nível máximo de log de mensagens emitidas (mensagens com um nível de log mais alto, ou seja, os menos importantes, serão suprimidas)\&. Qualquer um de (em ordem decrescente de importância) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, ou um número inteiro no intervalo 0\&...7\&. Veja B<syslog>(3) para obter mais informações\&.

source: A boolean\&. If true, messages written to the tty will be colored according to priority\&.
pt_br: Um booleano\&. Se verdadeiro, as mensagens gravadas no tty serão coloridas de acordo com a prioridade\&.

source: This setting is only useful when messages are written directly to the terminal, because B<journalctl>(1) and other tools that display logs will color messages based on the log level on their own\&.
pt_br: Esta configuração só é útil quando as mensagens são gravadas diretamente no terminal, porque B<journalctl>(1) e outras ferramentas que exibem logs irão colorir mensagens com base no nível de log por conta própria\&.

source: A boolean\&. If true, console log messages will be prefixed with a timestamp\&.
pt_br: Um booleano\&. Se verdadeiro, as mensagens de log do console serão prefixadas com um carimbo de data/hora\&.

source: This setting is only useful when messages are written directly to the terminal or a file, because B<journalctl>(1) and other tools that display logs will attach timestamps based on the entry metadata on their own\&.
pt_br: Esta configuração só é útil quando as mensagens são gravadas diretamente no terminal ou em um arquivo, porque B<journalctl>(1) e outras ferramentas que exibem logs irão anexar carimbos de data/hora com base nos metadados de entrada por conta própria\&.

source: A boolean\&. If true, messages will be prefixed with a filename and line number in the source code where the message originates\&.
pt_br: Um booleano &. Se verdadeiro, as mensagens serão prefixadas com um nome de arquivo e número de linha no código-fonte onde a mensagem se origina\&.

source: Note that the log location is often attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
pt_br: Observe que o local do registro é frequentemente anexado como metadados às entradas de journal de qualquer maneira\&. Incluí-lo diretamente no texto da mensagem pode, no entanto, ser conveniente ao depurar programas\&.

source: A boolean\&. If true, messages will be prefixed with the current numerical thread ID (TID)\&.
pt_br: Um booleano\&. Se verdadeiro, as mensagens serão prefixadas com o ID de thread numérico atual (TID)\&.

source: Note that the this information is attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
pt_br: Observe que essas informações são anexadas como metadados às entradas de journal de qualquer maneira\&. Incluí-las diretamente no texto da mensagem pode, no entanto, ser conveniente ao depurar programas\&.

source: The destination for log messages\&. One of B<console> (log to the attached tty), B<console-prefixed> (log to the attached tty but with prefixes encoding the log level and "facility", see B<syslog>(3), B<kmsg> (log to the kernel circular log buffer), B<journal> (log to the journal), B<journal-or-kmsg> (log to the journal if available, and to kmsg otherwise), B<auto> (determine the appropriate log target automatically, the default), B<null> (disable log output)\&.
pt_br: O destino das mensagens de log\&. Um de B<console> (log para o tty anexado), B<console-prefixed> (log para o tty anexado, mas com prefixos que codificam o nível de log e "facilidade", consulte B<syslog>(3), B<kmsg> (log para o buffer de log circular do kernel), B<journal> (log para o journal), B<journal-or-kmsg> (log para o journal se disponível, e para kmsg caso contrário), B<auto> (determinar o destino de log apropriado automaticamente, o padrão), B<null> (desabilita a saída de log)\&.

source: Pager to use when B<--no-pager> is not given; overrides I<$PAGER>\&. If neither I<$SYSTEMD_PAGER> nor I<$PAGER> are set, a set of well-known pager implementations are tried in turn, including B<less>(1) and B<more>(1), until one is found\&. If no pager implementation is discovered no pager is invoked\&. Setting this environment variable to an empty string or the value "cat" is equivalent to passing B<--no-pager>\&.
pt_br: Paginador a ser usado quando B<--no-pager> não é fornecido; substitui I<$PAGER>\&. Se nem I<$SYSTEMD_PAGER> nem I<$PAGER> forem definidos, um conjunto de implementações de paginador bem conhecidas é tentado por sua vez, incluindo B<less>(1) e B<more>(1), até que um seja encontrado\&. Se nenhuma implementação de paginador for descoberta, nenhum paginador será chamado\&. Definir esta variável de ambiente como uma string vazia ou o valor "cat" é equivalente a passar B<--no-pager>\&.

source: Note: if I<$SYSTEMD_PAGERSECURE> is not set, I<$SYSTEMD_PAGER> (as well as I<$PAGER>) will be silently ignored\&.
pt_br: Nota: Se I<$SYSTEMD_PAGERSECURE> não estiver definido, I<$SYSTEMD_PAGER> (assim como I<$PAGER>) será ignorado silenciosamente\&.

source: Override the options passed to B<less> (by default "FRSXMK")\&.
pt_br: Substitui as opções passadas para B<less> (por padrão, "FRSXMK")\&.

source: Users might want to change two options in particular:
pt_br: Usuários podem querer alterar duas opções em particular:

source: This option instructs the pager to exit immediately when Ctrl+C is pressed\&. To allow B<less> to handle Ctrl+C itself to switch back to the pager command prompt, unset this option\&.
pt_br: Esta opção instrui o paginador a sair imediatamente quando Ctrl+C é pressionado\&. Para permitir que B<less> manipule o Ctrl+C ele mesmo para voltar ao prompt de comando do paginador, desmarque esta opção\&.

source: If the value of I<$SYSTEMD_LESS> does not include "K", and the pager that is invoked is B<less>, Ctrl+C will be ignored by the executable, and needs to be handled by the pager\&.
pt_br: Se o valor de I<$SYSTEMD_LESS> não incluir "K" e o paginador que é chamado é B<less>, Ctrl+C será ignorado pelo executável e precisa ser manipulado pelo paginador\&.

source: This option instructs the pager to not send termcap initialization and deinitialization strings to the terminal\&. It is set by default to allow command output to remain visible in the terminal even after the pager exits\&. Nevertheless, this prevents some pager functionality from working, in particular paged output cannot be scrolled with the mouse\&.
pt_br: Esta opção instrui o paginador a não enviar strings de inicialização e desinicialização do termcap para o terminal\&. É definido por padrão para permitir que a saída do comando permaneça visível no terminal mesmo após a saída do paginador\&. No entanto, isso impede que algumas funcionalidades do paginador funcionem, em particular a saída paginada não pode ser rolada com o mouse\&.

source: See B<less>(1) for more discussion\&.
pt_br: Veja B<less>(1) para mais discussão\&.

source: Override the charset passed to B<less> (by default "utf-8", if the invoking terminal is determined to be UTF-8 compatible)\&.
pt_br: Substitui o conjunto de caracters passado para B<less> (por padrão, "utf-8", se o terminal chamador é determinado como sendo compatível com UTF-8)\&.

source: Takes a boolean argument\&. When true, the "secure" mode of the pager is enabled; if false, disabled\&. If I<$SYSTEMD_PAGERSECURE> is not set at all, secure mode is enabled if the effective UID is not the same as the owner of the login session, see B<geteuid>(2) and B<sd_pid_get_owner_uid>(3)\&. In secure mode, B<LESSSECURE=1> will be set when invoking the pager, and the pager shall disable commands that open or create new files or start new subprocesses\&. When I<$SYSTEMD_PAGERSECURE> is not set at all, pagers which are not known to implement secure mode will not be used\&. (Currently only B<less>(1) implements secure mode\&.)
pt_br: Recebe um argumento booleano\&. Quando verdadeiro, o modo "seguro" do paginador é habilitado; se falso, desabilitado\&. Se I<$SYSTEMD_PAGERSECURE> não estiver definido, o modo seguro é habilitado se o UID efetivo não for o mesmo que o dono da sessão de login, consulte B<geteuid>(2) e B<sd_pid_get_owner_uid>(3)\& . No modo seguro, B<LESSSECURE=1> será definido ao chamar o paginador, e o paginador deve desabilitar comandos que abrem ou criam novos arquivos ou iniciam novos subprocessos\&. Quando I<$SYSTEMD_PAGERSECURE> não está configurado, paginadores que não são conhecidos por implementar o modo seguro não serão usados\&. (Atualmente, apenas B<less>(1) implementa o modo seguro\&.)

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completely disable the pager using B<--no-pager> instead\&.
pt_br: Nota: quando os comandos são chamados com privilégios elevados, por exemplo, sob B<sudo>(8) ou B<pkexec>(1), deve-se tomar cuidado para garantir que recursos interativos indesejados não sejam ativados\&. O modo "seguro" para o paginador pode ser habilitado automaticamente conforme descrito acima\&. Definir I<SYSTEMD_PAGERSECURE=0> ou não removê-lo do ambiente herdado permite que o usuário chame comandos arbitrários\&. Observe que se as variáveis I<$ SYSTEMD_PAGER> ou I<$PAGER> devem ser respeitadas, I<$SYSTEMD_PAGERSECURE> também deve ser definido\&. Pode ser razoável desabilitar completamente o pager usando B<--no-pager> ao invés\&.

source: Takes a boolean argument\&. When true, B<systemd> and related utilities will use colors in their output, otherwise the output will be monochrome\&. Additionally, the variable can take one of the following special values: "16", "256" to restrict the use of colors to the base 16 or 256 ANSI colors, respectively\&. This can be specified to override the automatic decision based on I<$TERM> and what the console is connected to\&.
pt_br: Recebe um argumento booleano\&. Quando verdadeiro, B<systemd> e utilitários relacionados usarão cores em sua saída, caso contrário, a saída será monocromática\&. Além disso, a variável pode aceitar um dos seguintes valores especiais: "16", "256" para restringir o uso de cores às cores de base 16 ou 256 ANSI, respectivamente\&. Isso pode ser especificado para substituir a decisão automática com base no I<$TERM> e a que o console está conectado\&.

source: The value must be a boolean\&. Controls whether clickable links should be generated in the output for terminal emulators supporting this\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and other conditions\&.
pt_br: O valor deve ser um booleano\&. Controla se links clicáveis devem ser gerados na saída para emuladores de terminal terem suporte a isso\&. Isso pode ser especificado para substituir a decisão que o B<systemd> toma baseado no I<$TERM> e outras condições\&.

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: NOTES
pt_br: NOTAS

source: The XKB Configuration Guide
pt_br: O Guia de Configuração do XKB

source: Note that the changes performed using this tool might require the initramfs to be rebuilt to take effect during early system boot\&. The initramfs is not rebuilt automatically by localectl\&.
pt_br: Observe que as alterações realizadas usando esta ferramenta podem exigir que o initramfs seja recompilado para surtir efeito durante os primeiros estágios de inicialização do sistema\&. P initramfs não é recompilado automaticamente pelo localectl\&.

source: B<systemd>(1), B<locale>(7), B<locale.conf>(5), B<vconsole.conf>(5), B<loadkeys>(1), B<kbd>(4), \m[blue]B<The XKB Configuration Guide>\m[]\&\s-2\u[1]\d\s+2, B<systemctl>(1), B<systemd-localed.service>(8), B<systemd-firstboot>(1), B<mkinitrd>(8)
pt_br: B<systemd>(1), B<locale>(7), B<locale.conf>(5), B<vconsole.conf>(5), B<loadkeys>(1), B<kbd>(4), \m[blue]B<O Guia de Configuração do XKB>\m[]\&\s-2\u[1]\d\s+2, B<systemctl>(1), B<systemd-localed.service>(8), B<systemd-firstboot>(1), B<mkinitrd>(8)
