Repository: sebras/manpages-l10n
Catalog: po/*/man1/ls.1.po
Languages: hu, pt_br, sr

source: September 2021
hu: 2021 szeptember
pt_br: Setembro de 2021
sr: Септембра 2021

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: User Commands
hu: Felhasználói parancsok
pt_br: Comandos de usuário
sr: Корисничке наредбе

source: NAME
hu: NÉV
pt_br: NOME
sr: НАЗИВ

source: SYNOPSIS
hu: ÖSSZEGZÉS
pt_br: SINOPSE
sr: УВОД

source: B<ls> [I<\,OPTION\/>]... [I<\,FILE\/>]...
hu: B<ls> [I<\,KAPCSOLÓ\/>]... [I<\,FÁJL\/>]...
pt_br: B<ls> [I<\,OPÇÃO\/>]... [I<\,ARQUIVO\/>]...
sr: B<ls> [I<\,ОПЦИЈА\/>]... [I<\,ДАТОТЕКА\/>]...

source: DESCRIPTION
hu: LEÍRÁS
pt_br: DESCRIÇÃO
sr: ОПИС

source: List information about the FILEs (the current directory by default). Sort entries alphabetically if none of B<-cftuvSUX> nor B<--sort> is specified.
hu: Információt ír ki a FÁJLOKRÓL, alapértelmezésben az aktuális könyvtárról. Ábécé sorrendbe rendezi a bejegyzéseket, ha nincs megadva a B<-cftuvSUX> vagy a B<--sort> kapcsolók valamelyike.
pt_br: Lista informações sobre os ARQUIVOs (o diretório atual por padrão). Classifica as entradas em ordem alfabética se não for usada nenhuma opção -cftuvSUX nem --sort.
sr: Исписује податке о ДАТОТЕКАМА (текући директоријум по основи). Ређа уносе азбучним редом ако није наведено ни B<-cftuvSUX> ни B<--sort>.

source: Mandatory arguments to long options are mandatory for short options too.
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők.
pt_br: Argumentos obrigatórios para opções longas também o são para opções curtas.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.

source: do not ignore entries starting with .
hu: nem rejti el a .-tal kezdődő bejegyzéseket
pt_br: não ignora entradas começando com .
sr: не занемарује уносе који почињу тачком (.)

source: do not list implied . and ..
hu: nem listázza ki a . és .. bejegyzéseket
pt_br: não lista as entradas implícitas . e ..
sr: не исписује подразумевану . и ..

source: with B<-l>, print the author of each file
hu: a B<-l> kapcsolóval kiírja az egyes fájlok szerzőjét
pt_br: com B<-l>, emite o autor de cada arquivo
sr: са B<-l>, исписује аутора сваке датотеке

source: print C-style escapes for nongraphic characters
hu: C-stílusú escape karaktereket jelenít meg a nem-grafikus karakterek helyett
pt_br: emite escapes no estilo C para caracteres não-gráficos
sr: исписује завршетке у Ц-стилу за неграфичке знакове

source: B<--block-size>=I<\,SIZE\/>
hu: B<--block-size>=I<\,MÉRET\/>
pt_br: B<--block-size>=I<\,TAM\/>
sr: B<--block-size>=I<\,ВЕЛИЧИНА\/>

source: with B<-l>, scale sizes by SIZE when printing them; e.g., '--block-size=M'; see SIZE format below
hu: a B<-l> kapcsolóval: a MÉRET mint skála használata kiíráskor; pl. „--block-size=M”; lásd alább a MÉRET formátumát
pt_br: com B<-l>, escala os tamanhos por TAM ao exibi-los; por exemplo, “--block-size=M”; veja o formato de TAM abaixo
sr: са B<-l>, сразмерава величине ВЕЛИЧИНОМ када их исписује; нпр.., B<--block-size>=I<M>; видите запис ВЕЛИЧИНЕ испод

source: do not list implied entries ending with ~
hu: nem listázza ki a ~-ra végződő fájlokat
pt_br: não lista as entradas implícitas terminadas com ~
sr: не исписује подразумеване уносе који се завршавају на ~

source: with B<-lt>: sort by, and show, ctime (time of last modification of file status information); with B<-l>: show ctime and sort by name; otherwise: sort by ctime, newest first
hu: B<-lt>-vel: rendezés és kiírás ctime (fájlállapot- információk utolsó módosításának ideje) szerint B<-l>-lel: a ctime kiírása, és rendezés név szerint, egyébként: rendezés ctime szerint, legújabb előre
pt_br: com B<-lt>: ordena por, e mostra, ctime (hora da última modificação da informação de estado do arquivo); com B<-l>: mostra o ctime e ordena por nome demais casos: ordena por ctime, mais novos primeiro
sr: са B<-lt>: ређа према, и показује, „ctime“ (време последње измене података стања датотеке); са B<-l>: показује „ctime“ и ређа према називу; у супротном: ређа према „ctime“-у, прво новије

source: list entries by columns
hu: oszlopok szerinti listázás
pt_br: lista as entradas em colunas
sr: исписује уносе према ступцима

source: B<--color>[=I<\,WHEN\/>]
hu: B<--color>[=I<\,EKKOR\/>]
pt_br: B<--color>[=I<\,QUANDO\/>]
sr: B<--color>[=I<\,КАДА\/>]

source: colorize the output; WHEN can be 'always' (default if omitted), 'auto', or 'never'; more info below
hu: kimenet színezése, az EKKOR lehet vagy „always” (alap, ha nincs megadva), „auto” vagy „never”, további információk alább
pt_br: coloriza a saída. QUANDO pode ser “always” (sempre, se omitido), “auto” (automaticamente) ou “never”; veja abaixo para mais informações
sr: обојава излаз; КАДА може бити „always“ — увек (основно ако је изостављено), „auto“ — самостално или „never“ — никада; више података испод

source: list directories themselves, not their contents
hu: könyvtár listázása a könyvtár tartalma helyett
pt_br: lista os diretórios em si, e não seu conteúdo
sr: исписује саме директоријуме, а не њихов садржај

source: generate output designed for Emacs' dired mode
hu: az Emacs dired módjához tervezett kimenet
pt_br: gera a saída projetada para modo “dired” do Emacs
sr: ствара излаз осмишљен за Емаксов тешки режим

source: likewise, except do not append '*'
hu: hasonló az előzőhöz, kivéve a „*”-ot
pt_br: similar, exceto que não anexa “*”
sr: слично, осим што не придодаје *

source: B<--format>=I<\,WORD\/>
hu: B<--format>=I<\,SZÓ\/>
pt_br: B<--format>=I<\,PALAVRA\/>
sr: B<--format>=I<\,РЕЧ\/>

source: across B<-x>, commas B<-m>, horizontal B<-x>, long B<-l>, single-column B<-1>, verbose B<-l>, vertical B<-C>
hu: az érvényes értékek és a kapcsoló, amelynek megfelelnek: across B<-x>, commas B<-m>, horizontal B<-x>, long B<-l>, single-column B<-1>, verbose B<-l>, vertical B<-C>
sr: кроз B<-x>, зарези B<-m>, водоравно B<-x>, дуго B<-l>, један стубац B<-1>, опширно B<-l>, усправно B<-C>

source: like B<-l> B<--time-style>=I<\,full-iso\/>
hu: mint a B<-l> B<--time-style>=I<\,full-iso\/>
pt_br: o mesmo que B<-l> B<--time-style>=I<\,full-iso\/>
sr: као B<-l> B<--time-style>=I<\,full-iso\/>

source: like B<-l>, but do not list owner
hu: mint a B<-l>, de tulajdonos kiírása nélkül
pt_br: o mesmo que B<-l>, mas não lista o dono
sr: као B<-l>, али не исписује власника

source: group directories before files;
hu: könyvtárak fájlok elé csoportosítása.
pt_br: agrupa diretórios antes de arquivos;
sr: групише директоријуме пре датотека;

source: can be augmented with a B<--sort> option, but any use of B<--sort>=I<\,none\/> (B<-U>) disables grouping
hu: kiegészíthető B<--sort> kapcsolóval, de a B<--sort>=I<\,none> (B<-U>) használata letiltja a csoportosítást
pt_br: pode ser ampliado com a opção B<--sort>, mas o uso de B<--sort>=I<\,none\/> (B<-U>) desabilita o agrupamento de diretórios
sr: може бити повећано опцијом B<--sort>, али свако коришћење B<--sort>=I<\,none\/> (B<-U>) искључује груписање

source: in a long listing, don't print group names
hu: hosszú felsorolásnál nem írja ki a csoportneveket
pt_br: em lista longa, não emite os nomes de grupo
sr: у дугом спсику, не исписује називе група

source: with B<-l> and B<-s>, print sizes like 1K 234M 2G etc.
hu: B<-l> és B<-s> kapcsolóval közérthető formában írja ki a méreteket (például 1K 234M 2G)
pt_br: com B<-l>, e/ou B<-s>, emite tamanhos tipo 1K 234M 2G etc.
sr: са B<-l> и B<-s>, исписује величине као 1K 234M 2G итд.

source: likewise, but use powers of 1000 not 1024
hu: hasonlóképpen, de 1000 hatványát használja 1024 helyett
pt_br: similar, mas usa potências de 1000, não de 1024
sr: слично, али користе степене од 1000 а не 1024

source: follow symbolic links listed on the command line
hu: parancssorban megadott szimbolikus linkek követése
pt_br: segue os links simbólicos listados na linha de comando
sr: прати симболичке везе исписане на линији наредби

source: follow each command line symbolic link
hu: minden egyes parancssori szimbolikus link követése
pt_br: segue cada link simbólico da linha de comando
sr: прати сваку симболичку везу линије наредби

source: that points to a directory
hu: amely egy könyvtárra mutat
pt_br: que apontar para um diretório
sr: која указује на директоријумциљ

source: B<--hide>=I<\,PATTERN\/>
hu: B<--hide>=I<\,MINTA\/>
pt_br: B<--hide>=I<\,PADRÃO\/>
sr: B<--hide>=I<\,ШАБЛОН\/>

source: do not list implied entries matching shell PATTERN (overridden by B<-a> or B<-A>)
hu: ne listázza a parancsértelmező MINTÁRA illeszkedő bejegyzéseket (a B<-a> vagy B<-A> felülbírálja)
pt_br: não lista entradas implícitas que coincidam com o PADRÃO em sintaxe shell (ignorado por B<-a> ou B<-A>)
sr: не исписује подразумеване уносе који одговарају ШАБЛОНУ шкољке (превазиђено са B<-a> или B<-A>)

source: B<--hyperlink>[=I<\,WHEN\/>]
hu: B<--hyperlink>[=I<\,MIKOR\/>]
pt_br: B<--hyperlink>[=I<\,QUANDO\/>]
sr: B<--hyperlink>[=I<\,КАДА\/>]

source: hyperlink file names; WHEN can be 'always' (default if omitted), 'auto', or 'never'
hu: fájlnevek hiperlinkké alakítása; a MIKOR lehet 'always' (alapértelmezett, ha hiányzik), 'auto' vagy 'never'
pt_br: nomes de arquivos de hiperlink; QUANDO pode ser “always” (padrão, se omitido), “auto” ou “never”
sr: ствара хипер везе назива датотека; КАДА може бити „always“ (увек) (подразумева се ако је изостављено), „auto“, или „never“ (никад)

source: B<--indicator-style>=I<\,WORD\/>
hu: B<--indicator-style>=I<\,SZÓ\/>
pt_br: B<--indicator-style>=I<\,PALAVRA\/>
sr: B<--indicator-style>=I<\,РЕЧ\/>

source: append indicator with style WORD to entry names: none (default), slash (B<-p>), file-type (B<--file-type>), classify (B<-F>)
hu: a bejegyzésnevekhez jelet fűz a SZÓ alapján: none (alapértelmezett), slash (B<-p>), file-type (B<--file-type>) classify (B<-F>)
pt_br: anexa o indicador de tipo no estilo PALAVRA para os nomes das entradas: “none” (nenhum, padrão), “slash” (B<-p>), “file-type” (B<--file-type>), “classify” (B<-F>)
sr: придодаје указивач са стилом РЕЧИ на називе уноса: ништа (основно), коса црта (B<-p>), врста датотеке (B<--file-type>), разврстај (B<-F>)

source: print the index number of each file
hu: kiírja az egyes fájlok indexszámát
pt_br: emite o número de índice de cada arquivo
sr: исписује број индекса сваке датотеке

source: B<-I>, B<--ignore>=I<\,PATTERN\/>
hu: B<-I>, B<--ignore>=I<\,MINTA\/>
pt_br: B<-I>, B<--ignore>=I<\,PADRÃO\/>
sr: B<-I>, B<--ignore>=I<\,ШАБЛОН\/>

source: do not list implied entries matching shell PATTERN
hu: nem írja ki a parancsértelmező MINTÁRA illeszkedő bejegyzéseket
pt_br: não lista as entradas implícitas que coincidam com o PADRÃO
sr: не исписује подразумеване уносе који одговарају ШАБЛОНУ шкољке

source: use a long listing format
hu: hosszú formátum
pt_br: usa o formato de lista longa
sr: користи дуги запис списка

source: when showing file information for a symbolic link, show information for the file the link references rather than for the link itself
hu: szimbolikus linkek fájlinformációinak megjelenítésekor a szimbolikus linkek által mutatott fájlok adatait jeleníti meg a link adatai helyett
pt_br: ao mostrar informações de um link simbólico, mostra as do arquivo ao qual ele referencia, e não do arquivo tipo link em si
sr: када показује податке о датотеци за симболичку везу, показује податке за датотеку на коју упућује веза уместо са саму везу

source: fill width with a comma separated list of entries
hu: a szélességet a bejegyzések vesszővel elválasztott listájával tölti ki
pt_br: preenche toda a largura com uma lista de entradas separadas por vírgula
sr: испуњава ширину зарезом раздвојеним списком уноса

source: like B<-l>, but list numeric user and group IDs
hu: mint a B<-l>, de az felhasználó- és csoportazonosítókat számmal írja ki
pt_br: como B<-l>, mas lista usuário e grupo em IDs numéricos
sr: као B<-l>, али исписује бројчане кориснике и ИБ-ове група

source: print entry names without quoting
hu: bejegyzésnevek kiírása idézőjelek nélkül
pt_br: emite nomes de entrada sem apas
sr: исписује називе уноса без наводника

source: like B<-l>, but do not list group information
hu: mint a B<-l>, de a csoportinformációk kiírása nélkül
pt_br: como B<-l>, mas não lista informações sobre o grupo
sr: као B<-l>, али не исписује податке о групи

source: B<-p>, B<--indicator-style>=I<\,slash\/>
sr: B<-p>, B<--indicator-style>=I<\,коса црта\/>

source: append / indicator to directories
hu: egy / jelet fűz a könyvtárakhoz
pt_br: anexa o indicador / aos diretórios
sr: придодаје указник / директоријумима

source: print ? instead of nongraphic characters
hu: ? kiírása a nem grafikus karakterek helyett
pt_br: emite ? em vez de caracteres não gráficos
sr: исписује ? уместо неграфичких знакова

source: show nongraphic characters as-is (the default, unless program is 'ls' and output is a terminal)
hu: megjeleníti a nem grafikus karaktereket (alapértelmezett, kivéve ha a program az „ls” és a kimenet egy terminál)
pt_br: mostra caracteres não gráficos como são (padrão a menos que o programa seja o “ls” e a saída seja um terminal)
sr: приказује неграфичке знакове каквим јесу (подразумевано, осим ако програм није B<ls> а излаз терминал)

source: enclose entry names in double quotes
hu: minden bejegyzésnevet idézőjelbe tesz
pt_br: coloca os nomes das entradas entre aspas duplas
sr: ставља називе уноса под двоструке наводнике

source: B<--quoting-style>=I<\,WORD\/>
hu: B<--quoting-style>=I<\,SZÓ\/>
pt_br: B<--quoting-style>=I<\,PALAVRA\/>
sr: B<--quoting-style>=I<\,РЕЧ\/>

source: use quoting style WORD for entry names: literal, locale, shell, shell-always, shell-escape, shell-escape-always, c, escape (overrides QUOTING_STYLE environment variable)
hu: a SZÓ stílusnak megfelelően idézőjelez: literal, locale, shell, shell-always, shell-escape, shell-escape-always, c, escape; felülbírálja a QUOTING_STYLE környezeti változót
pt_br: usa estilo de aspas PALAVRA para os nomes das entradas: literal, locale, shell, shell-always, shell-escape, shell-escape-always, c, escape (substitui a variável QUOTING_STYLE)
sr: користи РЕЧ стила цитирања за називе уноса: literal, locale, shell, shell-always, shell-escape, shell-escape-always, c, escape (преписује променљиву окружења „СТИЛ_ЦИТИРАЊА“)

source: reverse order while sorting
hu: sorrend megfordítása rendezéskor
pt_br: inverte a ordem na ordenação
sr: прокреће редослед приликом ређања

source: list subdirectories recursively
hu: alkönyvtárak rekurzív listázása
pt_br: lista os subdiretórios recursivamente
sr: исписује поддиректоријуме дубински

source: print the allocated size of each file, in blocks
hu: az egyes fájlok méretének kiírása blokkban
pt_br: emite o tamanho alocado de cada arquivo, em blocos
sr: исписује додељену величину сваке датотеке, у блоковима

source: sort by file size, largest first
hu: rendezés fájlméret alapján, a legnagyobbal kezdve
pt_br: ordena por tamanho de arquivo, maior primeiro
sr: ређа према величини датотеке, прво највеће

source: B<--sort>=I<\,WORD\/>
hu: B<--sort>=I<\,SZÓ\/>
pt_br: B<--sort>=I<\,PALAVRA\/>
sr: B<--sort>=I<\,РЕЧ\/>

source: B<--time>=I<\,WORD\/>
hu: B<--time>=I<\,SZÓ\/>
pt_br: B<--time>=I<\,PALAVRA\/>
sr: B<--time>=I<\,РЕЧ\/>

source: change the default of using modification times; access time (B<-u>): atime, access, use; change time (B<-c>): ctime, status; birth time: birth, creation;
pt_br: altera o padrão usando horários de modificação; horário de acesso (B<-u>): atime, access, use; horário de alteração (B<-c>): ctime, status; horário de criação: birth, creation;
sr: мења подразумевано коришћења времена измена; време приступа (B<-u>): atime, access, use; време измене (B<-c>): ctime, status; време рођења: birth, creation;

source: with B<-l>, WORD determines which time to show; with B<--sort>=I<\,time\/>, sort by WORD (newest first)
pt_br: com B<-l>, PALAVRA determina o tempo para mostrar; com B<--sort>=I<\,time\/>, ordena por PALAVRA com o mais
sr: са B<-l>, РЕЧ одређује које време се користи; са B<--sort>=I<\,време\/>, ређа према РЕЧИ (најновије прво)

source: B<--time-style>=I<\,TIME_STYLE\/>
hu: B<--time-style>=I<\,IDŐSTÍLUS\/>
pt_br: B<--time-style>=I<\,ESTILO_HORA\/>
sr: B<--time-style>=I<\,СТИЛ_ВРЕМЕНА\/>

source: time/date format with B<-l>; see TIME_STYLE below
hu: dátum/idő formátum a B<-l> kapcsolóhoz; lásd az IDŐSTÍLUS leírását alább
pt_br: formato de hora/data com -l; veja TIME_STYLE abaixo
sr: запис време/датум са B<-l>; видите „СТИЛ_ВРЕМЕНА“ испод

source: sort by time, newest first; see B<--time>
pt_br: ordena por horário, mais novo primário; veja B<--time>
sr: ређа према времену, прво новије; видите B<--time>

source: B<-T>, B<--tabsize>=I<\,COLS\/>
hu: B<-T>, B<--tabsize>=I<\,OSZL\/>
sr: B<-T>, B<--tabsize>=I<\,СТУПЦИ\/>

source: assume tab stops at each COLS instead of 8
hu: tabulátor minden OSZL-nál, 8 helyett
pt_br: presume paradas de tabulação a cada COLS em vez de 8
sr: подразумева застој табулатора на сваком СТУПЦУ уместо на 8

source: with B<-lt>: sort by, and show, access time; with B<-l>: show access time and sort by name; otherwise: sort by access time, newest first
hu: B<-lt>-vel: rendezés és kiírás hozzáférési idő szerint; B<-l>-lel: a hozzáférési idő kiírása, és rendezés név szerint; egyébként: rendezés hozzáférési idő szerint, a legújabbal kezdve
pt_br: com B<-lt>: mostra e ordena por horário de acesso com B<-l>: mostra o horário de acesso e ordena por nome; demais casos: ordena por horário de acesso, mais novos primeiro
sr: са B<-lt>: ређа према, и приказује, време приступа; са B<-l>: приказује време приступа и ређа према називу; у супротном: ређа према времену приступа, прво најновије

source: do not sort; list entries in directory order
hu: nincs rendezés; a bejegyzések felsorolása könyvtári sorrendben
pt_br: não ordena; lista entradas na ordem do diretório
sr: не ређа; исписује уносе поретку директоријума

source: natural sort of (version) numbers within text
hu: (verzió)számok természetes rendezése a szövegen belül
pt_br: ordem natural de números (de versão) com texto
sr: природно ређање бројева (издања) у тексту

source: B<-w>, B<--width>=I<\,COLS\/>
hu: B<-w>, B<--width>=I<\,OSZL\/>
sr: B<-w>, B<--width>=I<\,СТУБАЦА\/>

source: set output width to COLS. 0 means no limit
hu: OSZL kimeneti szélesség beállítása. 0 = korlátlan
pt_br: define largura saída com COLS. 0 significa sem limite
sr: поставља ширину излаза на бр. СТУБАЦА. 0 значи без ограничења

source: list entries by lines instead of by columns
hu: bejegyzések listázása soronként oszloponkénti listázás helyett
pt_br: lista as entradas por linhas em vez de por colunas
sr: исписује уносе по редовима уместо по ступцима

source: sort alphabetically by entry extension
hu: ábécé sorba rendezés kiterjesztés szerint
pt_br: ordena alfabeticamente pela extensão da entrada
sr: ређа азбучним редом према проширењу уноса

source: print any security context of each file
hu: az egyes fájlok bármely biztonsági környezetének kiírása
pt_br: emite qualquer contexto de segurança de cada arquivo
sr: исписује сваки безбедносни садржај сваке датотеке

source: display this help and exit
hu: ezen súgó megjelenítése és kilépés
pt_br: mostra esta ajuda e sai
sr: приказује ову помоћ и излази

source: output version information and exit
hu: verzióinformációk megjelenítése és kilépés
pt_br: informa a versão e sai
sr: исписује податке о издању и излази

source: The SIZE argument is an integer and optional unit (example: 10K is 10*1024). Units are K,M,G,T,P,E,Z,Y (powers of 1024) or KB,MB,... (powers of 1000). Binary prefixes can be used, too: KiB=K, MiB=M, and so on.
pt_br: O argumento TAM é uma unidade opcional e inteiro (exemplo: 10K é 10*1024). As unidades são K,M,G,T,P,E,Z,Y (vezes 1024) ou KB,MB,... (vezes 1000). Prefixos binários também podem ser usados: KiB=K, MiB=M e assim por diante.
sr: Аргумент ВЕЛИЧИНА је цео број и изборна јединица (пример: 10K је 10*1024). Јединице су K,M,G,T,P,E,Z,Y (степени од 1024) или KB,MB,... (степени од 1000). Бинарни префикси се могу користити, такође: KiB=K, MiB=M, и тако редом.

source: The TIME_STYLE argument can be full-iso, long-iso, iso, locale, or +FORMAT. FORMAT is interpreted like in date(1). If FORMAT is FORMAT1E<lt>newlineE<gt>FORMAT2, then FORMAT1 applies to non-recent files and FORMAT2 to recent files. TIME_STYLE prefixed with 'posix-' takes effect only outside the POSIX locale. Also the TIME_STYLE environment variable sets the default style to use.
hu: Az IDŐSTÍLUS argumentum a full-iso, long-iso, iso, locale vagy +FORMÁTUM lehet. A FORMÁTUM értelmezése egyezik a B<date>(1) esetével. Ha a FORMÁTUM a FORMÁTUM1E<lt>newlineE<gt>FORMÁTUM2, akkor a FORMÁTUM1 a nem legutóbbi fájlokra lesz érvényes, a FORMÁTUM2 pedig a legutóbbiakra. A 'posix-' előtagú IDŐFORMÁTUM csak a POSIX területi beállításon kívül érvényes. Az IDŐSTÍLUS környezeti változó beállítja a használandó alapértelmezett stílust.
pt_br: O argumento ESTILO_HORA pode ser full-iso, long-iso, iso, locale ou +FORMAT. FORMATO é interpretado como no date(1). Se FORMATO for FORMATO1E<lt>nova-linhaE<gt>FORMATO2, então FORMATO1 se aplica a arquivos não recentes e FORMATO2 a arquivos recentes. ESTILO_HORA prefixado com “posix-” tem efeito somente fora do locale POSIX. Além disso, a variável de ambiente TIME_STYLE define o estilo padrão para usar.
sr: Аргумент „СТИЛ_ВРЕМЕНА“ може бити „full-iso“, „long-iso“, „iso“, „locale“, или „+ЗАПИС“. ЗАПИС се тумачи као у „date(1)“. Ако је ЗАПИС „ЗАПИС1E<lt>нови_редE<lt>ЗАПИС2“,тада се ЗАПИС1 примењује на не тако скорије датотеке а ЗАПИС2 на скорије датотеке. СТИЛ_ВРЕМЕНА са префиксом „posix-“ делује само ван „POSIX“ језика. Такође променљива окружења СТИЛ_ВРЕМЕНА подешава основни стил за коришћење.

source: Using color to distinguish file types is disabled both by default and with B<--color>=I<\,never\/>. With B<--color>=I<\,auto\/>, ls emits color codes only when standard output is connected to a terminal. The LS_COLORS environment variable can change the settings. Use the dircolors command to set it.
hu: A fájltípusok megkülönböztetése szín alapján alapértelmezésben és a B<--color>=I<\,never\/> esetén is le van tiltva. A B<--color>=I<\,auto\/> esetén az ls csak akkor ad színkódokat, ha a szabványos kimenet egy terminál. Az LS_COLORS környezeti változóval módosíthatók a beállítások, ehhez a dircolors parancs használható.
pt_br: O uso de cor para distinguir tipos de arquivos é desabilitado por padrão e com B<--color>=I<\,never\/>. B<--color>=I<\,auto\/>, ls emite códigos de cor apenas quando a saída padrão está conectada a um terminal. A variável de ambiente LS_COLORS pode alterar as configurações. Use o comando dircolors configurá-la.
sr: Коришћење боје за разликовање врста датотека је искључено и по основи и са B<--color>=I<\,never\/>. Са B<--color>=I<\,auto\/>, B<ls>(1) издаје кодове боје само када је стандардни излаз повезан на терминал. Променљива окружења „LS_COLORS“ може да измени подешавања. Користите наредбу B<dircolors>(1) да их подесите.

source: Exit status:
hu: Kilépési állapot:
pt_br: Status de saída:
sr: Стања излаза:

source: if OK,
hu: ha OK,
pt_br: se OK,
sr: ако је у реду,

source: if minor problems (e.g., cannot access subdirectory),
hu: kisebb problémák esetén (például nem érhető el az alkönyvtár),
pt_br: se problemas menores (por exemplo, sem acesso ao subdiretório);
sr: за мање проблеме (нпр., не може приступити поддиректоријуму),

source: if serious trouble (e.g., cannot access command-line argument).
hu: komoly problémák esetén (például nem érhető el a parancssori paraméter).
pt_br: se sérios problemas (por exemplo, sem acesso ao argumento de linha de comando).
sr: за озбиљне проблеме (нпр., не може приступити аргументу линије наредби).

source: AUTHOR
hu: SZERZŐ
pt_br: AUTOR
sr: АУТОР

source: Written by Richard M. Stallman and David MacKenzie.
hu: Írta Richard M. Stallman és David MacKenzie.
pt_br: Escrito por Richard M. Stallman e David MacKenzie.
sr: Написали су Ричард М. Столман и Дејвид Мек Кензи.
