Repository: sebras/manpages-l10n
Catalog: po/*/man1/ls.1.po
Languages: hu, pt_br, sr

source: REPORTING BUGS
hu: HIBÁK JELENTÉSE
pt_br: RELATANDO PROBLEMAS
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>
pt_br: Página de ajuda do GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
pt_br: Relate erros de tradução para E<lt>https://translationproject.org/team/pt_BR.htmlE<gt>.
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>

source: COPYRIGHT
hu: SZERZŐI JOG
pt_br: DIREITOS AUTORAIS
sr: АУТОРСКА ПРАВА

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2021 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
pt_br: Este é um software livre: você é livre para alterá-lo e redistribuí-lo. NÃO HÁ QUALQUER GARANTIA, na máxima extensão permitida em lei.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.

source: SEE ALSO
hu: LÁSD MÉG
pt_br: VEJA TAMBÉM
sr: ВИДИТЕ ТАКОЂЕ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/lsE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/lsE<gt>
pt_br: Documentação completa E<lt>https://www.gnu.org/software/coreutils/lsE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/lsE<gt>

source: or available locally via: info \(aq(coreutils) ls invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) ls invocation\(aq
pt_br: ou localmente disponível em: info \(aq(coreutils) ls invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) ls invocation\(aq“

source: September 2020
hu: 2020 szeptember
pt_br: Setembro de 2020
sr: Септембра 2020

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: append indicator (one of */=E<gt>@|) to entries
hu: jelet fűz a bejegyzéshez (a */=E<gt>@ vagy | egyikét)
pt_br: anexa indicador (um dos */=E<gt>@|) às entradas
sr: придодаје указивач (један од */=E<gt>@|) уносима

source: default to 1024-byte blocks for disk usage; used only with B<-s> and per directory totals
hu: alapesetben 1024 bájtos blokkok lemezhasználathoz; csak a B<-s> kapcsolóval, könyvtárak összegzéseihez
pt_br: por padrão, blocos de 1024 bytes para uso do disco; usado apenas com B<-s> e por totais de diretório
sr: основност за 1024-бајтне блокове за коришћење диска; користи се само са B<-s> и за тотале директоријума

source: sort by WORD instead of name: none (B<-U>), size (B<-S>), time (B<-t>), version (B<-v>), extension (B<-X>)
hu: rendezés a SZÓ szerint a név helyett: none (B<-U>), size (B<-S>), time (B<-t>), version (B<-v>), extension (B<-X>)
pt_br: ordena por PALAVRA em vez de pelo nome: none (B<-U>), size (B<-S>), time (B<-t>), version (B<-v>), extension (B<-X>)
sr: ређа према РЕЧИ уместо према називу: ништа (B<-U>), величина (B<-S>), време (B<-t>), издање (B<-v>), проширење (B<-X>)

source: list one file per line. Avoid '\en' with B<-q> or B<-b>
hu: soronként egy fájl listázása. Kerülje a „\en” megadását a B<-q> vagy B<-b> kapcsolókkal
pt_br: lista um arquivo por linha. Com B<-q> ou B<-b>, evita “\en”
sr: исписује једну датотеку у реду. Избегава „\en“ са B<-q> или B<-b>

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2020 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
hu: 2021 október
pt_br: Outubro de 2021
sr: Октобра 2021

source: January 2022
sr: Jануара 2022

source: March 2022
sr: Марта 2022

source: ls - list directory contents
pt_br: ls - lista conteúdo de diretórios

source: do not sort, enable B<-aU>, disable B<-ls> B<--color>
hu: nem rendez, bekapcsolja a B<-aU> kapcsolókat, kikapcsolja a B<-ls> B<--color> kapcsolókat
pt_br: não ordena, habilita B<-aU>, desabilita B<-ls> B<--color>

source: March 2020
pt_br: Março de 2020

source: October 2020
hu: 2020 október
pt_br: Outubro de 2020

source: April 2021
pt_br: Abril de 2021

source: end each output line with NUL, not newline
hu: minden kimeneti sor lezárása NUL-lal új sor helyett
