Repository: sebras/manpages-l10n
Catalog: po/*/man1/lsmem.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: lsmem - list the ranges of available memory with their online status
uk: lsmem — виведення списку діапазонів доступної пам'яті із даними щодо їхнього стану роботи

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<lsmem> [options]
uk: B<lsmem> [параметри]

source: DESCRIPTION
uk: ОПИС

source: The B<lsmem> command lists the ranges of available memory with their online status. The listed memory blocks correspond to the memory block representation in sysfs. The command also shows the memory block size and the amount of memory in online and offline state.
uk: Команда B<lsmem> виводить список діапазонів доступної пам'яті із даними щодо їхнього стану працездатності. Блоки пам'яті зі списку відповідають представленню блоків пам'яті у sysfs. Програма також показує розмір блоків пам'яті та об'єм пам'яті у активному та пасивному стані.

source: The default output is compatible with original implementation from s390-tools, but it\(cqs strongly recommended to avoid using default outputs in your scripts. Always explicitly define expected columns by using the B<--output> option together with a columns list in environments where a stable output is required.
uk: Типовий формат виведення є сумісним із початковою реалізацією із s390-tools, але, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> разом зі списком стовпчиків у середовищах, де потрібне виведення стабільного набору даних.

source: The B<lsmem> command lists a new memory range always when the current memory block distinguish from the previous block by some output column. This default behavior is possible to override by the B<--split> option (e.g., B<lsmem --split=ZONES>). The special word "none" may be used to ignore all differences between memory blocks and to create as large as possible continuous ranges. The opposite semantic is B<--all> to list individual memory blocks.
uk: Програма B<lsmem> завжди виводить список нового діапазону пам'яті, якщо поточний блок пам'яті відрізняється від попереднього блоку в якомусь зі стовпчиків виведених даних. Цю типову поведінку можна перевизначити за допомогою параметра B<--split> (наприклад, B<lsmem --split=ZONES>). Можна скористатися особливим словом "none" для ігнорування усіх відмінностей між блоками пам'яті і створення якомога більшої кількості неперервних діапазонів. Протилежним за семантикою до цього параметра є параметр B<--all>, використання якого призводить до виведення списку окремих блоків пам'яті.

source: Note that some output columns may provide inaccurate information if a split policy forces B<lsmem> to ignore differences in some attributes. For example if you merge removable and non-removable memory blocks to the one range than all the range will be marked as non-removable on B<lsmem> output.
uk: Зауважте, що у деяких стовпчиках виведення може бути представлено неточні дані, якщо правила поділу примушують B<lsmem> до ігнорування різниці у деяких атрибутах. Наприклад, якщо ви об'єднаєте придатні до вилучення і непридатні до вилучення блоки в один діапазон, у виведених даних B<lsmem> увесь діапазон буде позначено як непридатний до вилучення.

source: Not all columns are supported on all systems. If an unsupported column is specified, B<lsmem> prints the column but does not provide any data for it.
uk: Підтримку усіх стовпчиків передбачено не в усіх системах. Якщо вказано непідтримуваний стовпчик, B<lsmem> виведе стовпчик, але не надасть ніяких даних для нього.

source: Use the B<--help> option to see the columns description.
uk: Скористайтеся параметром B<--help>, щоб переглянути опис стовпчиків.

source: OPTIONS
uk: ПАРАМЕТРИ

source: List each individual memory block, instead of combining memory blocks with similar attributes.
uk: Вивести список для кожного окремого блоку пам'яті, а не поєднувати блоки пам'яті із однаковими атрибутами.

source: Print the sizes in bytes rather than in a human-readable format.
uk: Вивести розмір у байтах, а не у зручному для читання форматі.

source: By default, the unit, sizes are expressed in, is byte, and unit prefixes are in power of 2^10 (1024). Abbreviations of symbols are exhibited truncated in order to reach a better readability, by exhibiting alone the first letter of them; examples: "1 KiB" and "1 MiB" are respectively exhibited as "1 K" and "1 M", then omitting on purpose the mention "iB", which is part of these abbreviations.
uk: Типово, одиницею, у якій показано розміри, є байт, а префікси одиниць є степенями 2^10 (1024). Для забезпечення зручності читання відбувається скорочення позначень до першої літери запису; приклади: «1 КіБ» та «1 МіБ» буде показано як «1 K» та «1 M», із вилученням «іБ», яке є частиною цих скорочень.

source: Use JSON output format.
uk: Bикористати формат виведення JSON.

source: Do not print a header line.
uk: Не виводити рядок заголовка.

source: B<-o>, B<--output> I<list>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns. The default list of columns may be extended if I<list> is specified in the format B<+>I<list> (e.g., B<lsmem -o +NODE>).
uk: Вказати, які стовпчики слід вивести. Скористайтеся параметром B<--help>, щоб переглянути опис стовпчиків. Типовий список стовпчиків може бути розширено, якщо I<список> вказано у форматі B<+>I<список> (наприклад, B<lsmem -o +NODE>).

source: Output all available columns.
uk: Вивести список усіх доступних стовпчиків.

source: Produce output in the form of key="value" pairs. All potentially unsafe value characters are hex-escaped (\(rsxE<lt>codeE<gt>).
uk: Вивести дані у формі пар ключ="значення". Усі потенційно небезпечні символи значень буде екрановано (\(rsxE<lt>кодE<gt>).

source: Produce output in raw format. All potentially unsafe characters are hex-escaped (\(rsxE<lt>codeE<gt>).
uk: Вивести дані у форматі без обробки. Усі потенційно небезпечні символи буде екрановано (\(rsxE<lt>кодE<gt>)

source: B<-S>, B<--split> I<list>
uk: B<-S>, B<--split> I<список>

source: Specify which columns (attributes) use to split memory blocks to ranges. The supported columns are STATE, REMOVABLE, NODE and ZONES, or "none". The other columns are silently ignored. For more details see B<DESCRIPTION> above.
uk: Вказати, які стовпчики (атрибути) слід використати для поділу блоків пам'яті на діапазони. Підтримуваними стовпчиками є STATE, REMOVABLE, NODE і ZONES, або «none». Інші стовпчики буде без повідомлень буде проігноровано. Щоб дізнатися більше, зверніться до розділу B<ОПИС> вище.

source: B<-s>, B<--sysroot> I<directory>
uk: B<-s>, B<--sysroot> I<каталог>

source: Gather memory data for a Linux instance other than the instance from which the B<lsmem> command is issued. The specified I<directory> is the system root of the Linux instance to be inspected.
uk: Зібрати дані щодо пам'яті для екземпляра Linux, відмінного від екземпляра, з якого запущено команду B<lsmem>. Вказаний I<каталог> є кореневим каталогом системи екземпляра Linux, ревізію якого слід виконати.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: B<--summary>[=I<when>]
uk: B<--summary>[=I<умова>]

source: This option controls summary lines output. The optional argument I<when> can be B<never>, B<always> or B<only>. If the I<when> argument is omitted, it defaults to B<"only">. The summary output is suppressed for B<--raw>, B<--pairs> and B<--json>.
uk: Цей параметр керує виведенням рядків резюме. Необов'язковим аргументом I<умова> може бути B<never>, B<always> або B<only>. Якщо аргумент I<умова> не вказано, типовим буде значення B<only>. Виведення резюме буде придушено для B<--raw>, B<--pairs> і B<--json>.

source: AUTHORS
uk: АВТОРИ

source: B<lsmem> was originally written by Gerald Schaefer for s390-tools in Perl. The C version for util-linux was written by Clemens von Mann, Heiko Carstens and Karel Zak.
uk: Початкову версію B<lsmem> було написано Gerald Schaefer для s390-tools мовою Perl. Версію мовою C для util-linux було написано Clemens von Mann, Heiko Carstens та Karel Zak.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<lsmem> command is part of the util-linux package which can be downloaded from
uk: B<lsmem> є частиною пакунка util-linux, який можна отримати з

source: October 2016
uk: Жовтень 2016 року

source: The default output compatible with original implementation from s390-tools, but it's strongly recommended to avoid using default outputs in your scripts. Always explicitly define expected columns by using the B<--output> option together with a columns list in environments where a stable output is required.
uk: Типовий формат виведення є сумісним із початковою реалізацією із s390-tools, але, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> разом зі списком стовпчиків у середовищах, де потрібне виведення стабільного набору даних.

source: The B<lsmem> command lists a new memory range always when the current memory block distinguish from the previous block by some output column. This default behavior is possible to override by the B<--split> option (e.g., B<lsmem --split=ZONES>). The special word "none" may be used to ignore all differences between memory blocks and to create as large as possible continuous ranges. The opposite semantic is B<--all> to list individual memory blocks.
uk: Програма B<lsmem> завжди виводить список нового діапазону пам'яті, якщо поточний блок пам'яті відрізняється від попереднього блоку в якомусь зі стовпчиків виведених даних. Цю типову поведінку можна перевизначити за допомогою параметра B<--split> (наприклад, B<lsmem --split=ZONES>). Можна скористатися особливим словом "none" для ігнорування усіх відмінностей між блоками пам'яті і створення якомога більшої кількості неперервних діапазонів. Протилежним за семантикою до цього параметра є параметр B<--all>, використання якого призводить до виведення списку окремих блоків пам'яті.

source: Not all columns are supported on all systems. If an unsupported column is specified, B<lsmem> prints the column but does not provide any data for it.
uk: Підтримку усіх стовпчиків передбачено не в усіх системах. Якщо вказано непідтримуваний стовпчик, B<lsmem> виведе стовпчик, але не надасть ніяких даних для нього.

source: Print the SIZE column in bytes rather than in a human-readable format.
uk: Вивести стовпчик розміру у байтах, а не у зручному для читання форматі.

source: B<-o>,B< --output >I<list>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns. The default list of columns may be extended if I<list> is specified in the format B<+>I<list>B< (e.g., lsmem -o +NODE).>
uk: Вказати, які стовпчики слід вивести Скористайтеся параметром B<--help>, щоб переглянути опис стовпчиків Типовий список стовпчиків може бути розширено, якщо I<список> вказано у форматі B<+>I<список> (наприклад, B<lsmem -o +NODE>).

source: Produce output in the form of key="value" pairs. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>).
uk: Вивести дані у формі пар ключ="значення". Усі потенційно небезпечні символи буде екрановано (\exE<lt>кодE<gt>).

source: Produce output in raw format. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>).
uk: Вивести дані у формі пар ключ="значення". Усі потенційно небезпечні символи буде екрановано (\exE<lt>кодE<gt>).

source: B<-S>,B< --split >I<list>
uk: B<-S>, B<--split> I<список>

source: Specify which columns (attributes) use to split memory blocks to ranges. The supported columns are STATE, REMOVABLE, NODE and ZONES, or "none". The other columns are silently ignored. For more details see DESCRIPTION above.
uk: Вказати, які стовпчики (атрибути) слід використати для поділу блоків пам'яті на діапазони. Підтримуваними стовпчиками є STATE, REMOVABLE, NODE і ZONES, або «none». Інші стовпчики буде без повідомлень буде проігноровано. Щоб дізнатися більше, зверніться до розділу B<ОПИС> вище.

source: B<-s>,B< --sysroot >I<directory>
uk: B<-s>, B<--sysroot> I<каталог>

source: Gather memory data for a Linux instance other than the instance from which the B<lsmem> command is issued. The specified I<directory> is the system root of the Linux instance to be inspected.
uk: Зібрати дані щодо пам'яті для екземпляра Linux, відмінного від екземпляра, з якого запущено команду B<lsmem>. Вказаний I<каталог> є кореневим каталогом системи екземпляра Linux, ревізію якого слід виконати.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: This option controls summary lines output. The optional argument I<when> can be B<never>, B<always> or B<only>. If the I<when> argument is omitted, it defaults to B<"only">. The summary output is suppressed for B<--raw>, B<--pairs> and B<--json>.
uk: Цей параметр керує виведенням рядків резюме. Необов'язковим аргументом I<умова> може бути B<never>, B<always> або B<only>. Якщо аргумент I<умова> не вказано, типовим буде значення B<only>. Виведення резюме буде придушено для B<--raw>, B<--pairs> і B<--json>.

source: The B<lsmem> command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма lsmem є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: The default output compatible with original implementation from s390-tools, but it\(cqs strongly recommended to avoid using default outputs in your scripts. Always explicitly define expected columns by using the B<--output> option together with a columns list in environments where a stable output is required.
uk: Типовий формат виведення є сумісним із початковою реалізацією із s390-tools, але, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> разом зі списком стовпчиків у середовищах, де потрібне виведення стабільного набору даних.

source: Specify which columns (attributes) use to split memory blocks to ranges. The supported columns are STATE, REMOVABLE, NODE and ZONES, or "none". The other columns are silently ignored. For more details see DESCRIPTION above.
uk: Вказати, які стовпчики (атрибути) слід використати для поділу блоків пам'яті на діапазони. Підтримуваними стовпчиками є STATE, REMOVABLE, NODE і ZONES, або «none». Інші стовпчики буде без повідомлень буде проігноровано. Щоб дізнатися більше, зверніться до розділу B<ОПИС> вище.
