Repository: sebras/manpages-l10n
Catalog: po/*/man1/lz.1.po
Languages: da, uk

source: Wed Feb 23 00:00:00 EET 2000
da: Ons Feb 23 00:00:00 EET 2000
uk: Середа, 23 лютого 00:00:00 EET 2000 року

source: Mtools Users Manual
da: Mtools-brugermanual
uk: Підручник користувача Mtools

source: NAME
da: NAVN
uk: НАЗВА

source: lz - gunzips and shows a listing of a gzip'd tar'd archive
da: lz - gunzips og viser en liste over et gzip'd tar'd-arkiv
uk: lz виконує gunzip і показує список стисненого gzip архіву tar

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<lz> I<file>
da: B<lz> I<fil>
uk: B<lz> I<файл>

source: DESCRIPTION
da: BESKRIVELSE
uk: ОПИС

source: B<lz> provides a listing of a gzip'd tar'd archive, that is a B<tar>(1) archive compressed with the B<gzip>(1) utility. It is not strictly necessary on Debian GNU/Linux, because the GNU B<tar>(1) program provides the same capability with the command
da: B<lz> tilbyder en list over et gzip'd tar'd-arkiv, der er et B<tar>(1)-arkiv komprimeret med redskabet B<gzip>(1). Det er ikke strengt nødvendigt på Debian GNU/Linux, da programmet GNU B<tar>(1) tilbyder den samme funktionalitet med kommandoen
uk: B<lz> надає список вмісту архіву tar запакованого gzip, тобто архіву B<tar>(1), стискання якого виконано за допомогою програми B<gzip>(1). Ця програма не є обов'язковою для Debian GNU/Linux, оскільки сама програма GNU B<tar>(1) надає ті самі можливості, якщо скористатися форматом команди

source: B<tar -tzf> I<file>
da: B<tar -tzf> I<fil>
uk: B<tar -tzf> I<файл>

source: but this utility is provided in the mtools package for other platforms and is retained here for completeness.
da: men dette redskab tilbydes i pakken mtools for andre platforme og bevares her for fuldstændighedens skyld.
uk: але цей інструмент надається у форматі пакунка mtools для інших платформа і зберігається тут заради повноти.

source: AUTHOR
da: FORFATTER
uk: АВТОР

source: Robert King (Robert.King@mailbox.gu.edu.au) wrote this page for the I<Debian/GNU> mtools package.
da: Robert King (Robert.King@mailbox.gu.edu.au) skrev denne side for I<Debian/GNU>s mtools-pakke.
uk: Цю сторінку підручника написано Robert King (Robert.King@mailbox.gu.edu.au) для пакунка mtools I<Debian/GNU>.

source: SEE ALSO
da: SE OGSÅ
uk: ДИВ. ТАКОЖ
