Repository: sebras/manpages-l10n
Catalog: po/*/man1/machinectl.1.po
Languages: de

source: Show a list of locally installed container and VM images\&. This enumerates all raw disk images and container directories and subvolumes in /var/lib/machines/ (and other search paths, see below)\&. Use B<start> (see above) to run a container off one of the listed images\&. Note that, by default, containers whose name begins with a dot ("\&.") are not shown\&. To show these too, specify B<--all>\&. Note that a special image "\&.host" always implicitly exists and refers to the image the host itself is booted from\&.
de: Zeigt eine Liste von lokal installierten Container- und VM-Abbildern\&. Dies zählt alle rohen Platten-Abbilder und -Containerverzeichnisse und Teildatenträger in /var/lib/machines/ (und anderen Suchpfaden, siehe unten) auf\&. Verwenden Sie B<start> (siehe oben), um einen Container aus den aufgeführten Abbildern auszuführen\&. Beachten Sie, dass standardmäßig Container, deren Namen mit einem Punkt (»\&.«) beginnen, nicht angezeigt werden\&. Geben Sie B<--all> an, um diese auch anzuzeigen\&. Beachten Sie, dass das besondere Abbild »\&.host« immer impliziet existiert und sich auf das Abbild bezieht, von dem der Rechner selbst gestartet wurde\&.

source: Show terse status information about one or more container or VM images\&. This function is intended to generate human-readable output\&. Use B<show-image> (see below) to generate computer-parsable output instead\&.
de: Zeigt knappe Statusinformationen über einen oder mehrere Container- oder VM-Abbilder an\&. Diese Funktion ist zur Erzeugung menschenlesbarer Ausgabe gedacht\&. Verwenden Sie B<show-image> (siehe unten), um stattdessen Computer-auswertbare Ausgabe zu erstellen\&.

source: Show properties of one or more registered virtual machine or container images, or the manager itself\&. If no argument is specified, properties of the manager will be shown\&. If a NAME is specified, properties of this virtual machine or container image are shown\&. By default, empty properties are suppressed\&. Use B<--all> to show those too\&. To select specific properties to show, use B<--property=>\&. This command is intended to be used whenever computer-parsable output is required\&. Use B<image-status> if you are looking for formatted human-readable output\&.
de: Zeigt Eigenschaften von einem oder mehreren registrierten virtuellen Maschinen oder Container-Abbildern oder dem Verwalter selbst an\&. Falls kein Argument angegeben ist, werden die Eigenschaften des Verwalters angezeigt\&. Falls NAME angegeben ist, werden die Eigenschaften dieser virtuellen Maschine oder des Container-Abbilds angezeigt\&. Standardmäßig werden leere Eigenschaften unterdrückt\&. Verwenden Sie B<--all>, um diese auch anzuzeigen\&. Um bestimmte Eigenschaften zur Anzeige auszuwählen, verwenden Sie B<--property=>\&. Dieser Befehl ist dafür gedacht, wenn Computer-auswertbare Ausgabe benötigt wird\&. Verwenden Sie B<image-status>, falls Sie formatierte, menschenlesbare Ausgabe suchen\&.

source: Clones a container or VM image\&. The arguments specify the name of the image to clone and the name of the newly cloned image\&. Note that plain directory container images are cloned into btrfs subvolume images with this command, if the underlying file system supports this\&. Note that cloning a container or VM image is optimized for file systems that support copy-on-write, and might not be efficient on others, due to file system limitations\&.
de: Klont einen Container- oder ein VM-Abbild\&. Die Argumente geben den Namen des zu klonenden und den Namen des frisch geklonten Abbildes an\&. Beachten Sie, dass einfache Container-Abbilder mit diesem Befehl in Btrfs-Teildatenträger-Abbilder geklont werden, falls dies das zugrundeliegende Dateisystem unterstützt\&. Beachten Sie, dass Klonen eines Container- oder VM-Abbildes für Dateisysteme optimiert ist, die »Kopieren-beim-Schreiben« unterstützen und für andere Dateisysteme, aufgrund von deren Beschränkungen, weniger effizient sein könnte\&.

source: Note that this command leaves hostname, machine ID and all other settings that could identify the instance unmodified\&. The original image and the cloned copy will hence share these credentials, and it might be necessary to manually change them in the copy\&.
de: Beachten Sie, dass dieser Befehl den Rechnernamen, die Maschinenkennung und alle anderen Einstellungen, die diese Instanz identifizieren könnten, unverändert lässt\&. Das ursprüngliche Abbild und die geklonte Kopie werden daher beide diese Berechtigungsnachweise gemeinsam nutzen und es mag notwendig sein, diese in der Kopie manuell zu ändern\&.

source: If combined with the B<--read-only> switch a read-only cloned image is created\&.
de: Wird dies mit dem Schalter B<--read-only> kombiniert, dann wird ein nur-lesbares geklontes Abbild erstellt\&.

source: Renames a container or VM image\&. The arguments specify the name of the image to rename and the new name of the image\&.
de: Benennt ein Container- oder VM-Abbild um\&. Die Argumente geben den Namen des umzubenennenden und den neuen Namen des Abbildes an\&.

source: B<read-only> I<NAME> [I<BOOL>]
de: B<read-only> I<NAME> [I<LOGISCH>]

source: Marks or (unmarks) a container or VM image read-only\&. Takes a VM or container image name, followed by a boolean as arguments\&. If the boolean is omitted, positive is implied, i\&.e\&. the image is marked read-only\&.
de: Markiert ein Container- oder VM-Abbild nur-lesbar oder hebt dieses auf\&. Akzeptiert als Argumente einen VM- oder Container-Abbildnamen, gefolgt von einem logischen Wert\&. Falls der logische Wert fehlt, wird positiv impliziert, d\&.h\&. das Abbild wird als nur-lesbar markiert\&.

source: Removes one or more container or VM images\&. The special image "\&.host", which refers to the host\*(Aqs own directory tree, may not be removed\&.
de: Entfernt eines oder mehrere Container- oder VM-Abbilder\&. Das besondere Abbild »\&.host«, das sich auf den Verzeichnisbaum des Rechners selbst bezieht, darf nicht entfernt werden\&.

source: B<set-limit> [I<NAME>] I<BYTES>
de: B<set-limit> [I<NAME>] I<BYTE>

source: Sets the maximum size in bytes that a specific container or VM image, or all images, may grow up to on disk (disk quota)\&. Takes either one or two parameters\&. The first, optional parameter refers to a container or VM image name\&. If specified, the size limit of the specified image is changed\&. If omitted, the overall size limit of the sum of all images stored locally is changed\&. The final argument specifies the size limit in bytes, possibly suffixed by the usual K, M, G, T units\&. If the size limit shall be disabled, specify "-" as size\&.
de: Setzt die maximale Größe in Byte, zu der ein bestimmtes Container- oder VM-Abbild, oder alle Abbilder auf der Platte anwachsen dürfen (Plattenkontingent)\&. Akzeptiert entweder einen oder zwei Parameter\&. Der erste, optionale Parameter bezieht sich auf den Namen eines Containers oder einer VM\&. Falls angegeben, wird die Größenbegrenzung des angegebenen Abbilds geändert\&. Falls der Parameter fehlt, dann wird die Gesamtgrößenbegrenzung der Summe aller lokal gespeicherten Abbilder geändert\&. Das abschließende Argument gibt die Größenbegrenzung in Byte an, die üblichen Einheiten K, M, G, T können optional angehängt werden\&. Falls die Größenbegrenzung deaktiviert werden soll, geben Sie »-« als Größe an\&.

source: Note that per-container size limits are only supported on btrfs file systems\&.
de: Beachten Sie, dass die Container-bezogenen Größenbeschränkungen nur auf Btrfs-Dateisystemen unterstützt werden\&.

source: Remove hidden VM or container images (or all)\&. This command removes all hidden machine images from /var/lib/machines/, i\&.e\&. those whose name begins with a dot\&. Use B<machinectl list-images --all> to see a list of all machine images, including the hidden ones\&.
de: Entfernt versteckte VM- oder Container-Abbilder (oder alle)\&. Dieser Befehl entfernt alle versteckten Maschinenabbilder aus /var/lib/machines/, d\&.h\&. solche, deren Namen mit einem Punkt beginnen\&. Verwenden Sie B<machinectl list-images --all>, um eine Liste aller Maschinenabbilder zu sehen, einschließlich der versteckten\&.

source: When combined with the B<--all> switch removes all images, not just hidden ones\&. This command effectively empties /var/lib/machines/\&.
de: Bei der Kombination mit dem Schalter B<--all> werden alle Abbilder entfernt, nicht nur die versteckten\&. Dieser Befehl leert effektiv /var/lib/machines/\&.

source: Note that commands such as B<machinectl pull-tar> or B<machinectl pull-raw> usually create hidden, read-only, unmodified machine images from the downloaded image first, before cloning a writable working copy of it, in order to avoid duplicate downloads in case of images that are reused multiple times\&. Use B<machinectl clean> to remove old, hidden images created this way\&.
de: Beachten Sie, dass Befehle wie B<machinectl pull-tar> oder B<machinectl pull-raw> normalerweise zuerst versteckte, nur-lesbare und unveränderte Maschinenabbilder aus dem heruntergeladenen Abbild erstellen, bevor sie eine schreibbare Arbeitskopie davon klonen, um mehrfaches Herunterladen zu vermeiden, falls Abbilder mehrmals verwandt werden\&. Verwenden Sie B<machinectl clean>, um auf diese Art erstellte alte, versteckte Abbilder zu entfernen\&.

source: Image Transfer Commands
de: Abbildübertragungsbefehle

source: Downloads a \&.tar container image from the specified URL, and makes it available under the specified local machine name\&. The URL must be of type "http://" or "https://", and must refer to a \&.tar, \&.tar\&.gz, \&.tar\&.xz or \&.tar\&.bz2 archive file\&. If the local machine name is omitted, it is automatically derived from the last component of the URL, with its suffix removed\&.
de: Lädt ein \&.tar-Container-Abbild von der angegebenen URL herunter und macht es unter dem angegebenen lokalen Maschinennamen verfügbar\&. Die URL muss vom Typ »http://« oder »https://« sein und muss sich auf eine \&.tar-, \&.tar\&.gz-, \&.tar\&.xz- oder \&.tar\&.bz2-Archivdatei beziehen\&. Falls der lokale Maschinenname nicht angegeben wird, wird er aus der letzten Komponente der URL automatisch ermittelt, wobei die Endung entfernt wird\&.

source: The image is verified before it is made available, unless B<--verify=no> is specified\&. Verification is done either via an inline signed file with the name of the image and the suffix \&.sha256 or via separate SHA256SUMS and SHA256SUMS\&.gpg files\&. The signature files need to be made available on the same web server, under the same URL as the \&.tar file\&. With B<--verify=checksum>, only the SHA256 checksum for the file is verified, based on the \&.sha256 suffixed file or the SHA256SUMS file\&. With B<--verify=signature>, the sha checksum file is first verified with the inline signature in the \&.sha256 file or the detached GPG signature file SHA256SUMS\&.gpg\&. The public key for this verification step needs to be available in /usr/lib/systemd/import-pubring\&.gpg or /etc/systemd/import-pubring\&.gpg\&.
de: Das Abbild wird verifiziert, bevor es verfügbar gemacht wird, außer B<--verify=no> ist angegeben\&. Die Verifizierung erfolgt entweder über eine integrierte signierte Datei mit dem Namen des Abbildes und der Endung \&.sha256 oder mit separaten SHA256SUMS- und SHA256SUMS\&.gpg-Dateien\&. Die Signaturdateien müssen auf dem gleichen Web-Server unter der gleichen URL wie die \&.tar-Datei verfügbar gemacht werden\&. Mit B<--verify=checksum> wird nur die SHA256-Prüfsumme für die Datei verifiziert, basierend auf der Datei mit Endung \&.sha256 oder der SHA256SUMS-Datei\&. Mit B<--verify=signature> wird zuerst die SHA-Prüfsumme der Datei mit der integrierten Signatur in der \&.sha256-Datei oder der separaten GPG-Signaturdatei SHA256SUMS\&.gpg verifiziert\&. Der öffentliche Schlüssel für diesen Verifikationsschritt muss in /usr/lib/systemd/import-pubring\&.gpg oder /etc/systemd/import-pubring\&.gpg verfügbar sein\&.

source: The container image will be downloaded and stored in a read-only subvolume in /var/lib/machines/ that is named after the specified URL and its HTTP etag\&. A writable snapshot is then taken from this subvolume, and named after the specified local name\&. This behavior ensures that creating multiple container instances of the same URL is efficient, as multiple downloads are not necessary\&. In order to create only the read-only image, and avoid creating its writable snapshot, specify "-" as local machine name\&.
de: Das Container-Abbild wird in einen nur-lesbaren Teildatenträger in /var/lib/machines/, der nach der angegebenen URL und seinem HTTP-etag benannt ist, heruntergeladen und gespeichert\&. Von diesem Teildatenträger wird dann ein schreibbarer Schnappschuss genommen, der nach dem angegebenen lokalen Namen benannt wird\&. Dieses Verhalten stellt sicher, dass die Erstellung mehrerer Container-Instanzen von der gleichen URL effizient erfolgt, da mehrfaches Herunterladen nicht notwendig ist\&. Um nur das nur-lesbare Abbild zu erstellen und die Erstellung des schreibbaren Schnappschusses zu vermeiden, geben Sie »-« als lokalen Maschinennamen an\&.

source: Note that the read-only subvolume is prefixed with \&.tar-, and is thus not shown by B<list-images>, unless B<--all> is passed\&.
de: Beachten Sie, dass einem nur-lesbaren Teildatenträger \&.tar- vorangestellt und es daher durch B<list-images> nur angezeigt wird, wenn auch B<--all> übergeben wird\&.

source: Note that pressing C-c during execution of this command will not abort the download\&. Use B<cancel-transfer>, described below\&.
de: Beachten Sie, dass Drücken von Strg-C während der Ausführung dieses Befehls das Herunterladen nicht abbricht\&. Verwenden Sie das nachfolgend beschriebene B<cancel-transfer>\&.

source: Downloads a \&.raw container or VM disk image from the specified URL, and makes it available under the specified local machine name\&. The URL must be of type "http://" or "https://"\&. The container image must either be a \&.qcow2 or raw disk image, optionally compressed as \&.gz, \&.xz, or \&.bz2\&. If the local machine name is omitted, it is automatically derived from the last component of the URL, with its suffix removed\&.
de: Lädt ein \&.raw-Container- oder VM-Plattenabbild von der angegebenen URL herunter und macht ihn unter dem angegebenen lokalen Maschinennamen verfügbar\&. Das Container-Abbild muss entweder eine \&.qcow2 oder ein rohes Platten-Abbild sein, das optional als \&.gz, \&.xz oder \&.bz2 komprimiert sein kann\&. Falls der lokale Maschinenname nicht angegeben wird, wird er aus der letzten Komponente der URL automatisch ermittelt, wobei die Endung entfernt wird\&.

source: Image verification is identical for raw and tar images (see above)\&.
de: Abbild-Überprüfung ist für rohe und Tar-Abbilder identisch (siehe oben)\&.

source: If the downloaded image is in \&.qcow2 format it is converted into a raw image file before it is made available\&.
de: Falls das heruntergeladene Abbild im Format \&.qcow2 ist, dann wird es vor der Bereitstellung in eine rohe Abbilddatei konvertiert\&.

source: Downloaded images of this type will be placed as read-only \&.raw file in /var/lib/machines/\&. A local, writable (reflinked) copy is then made under the specified local machine name\&. To omit creation of the local, writable copy pass "-" as local machine name\&.
de: Heruntergeladene Abbilder dieses Typs werden als nur-lesbare \&.raw-Dateien in /var/lib/machines/ abgelegt\&. Eine lokale, schreibbare (Referenz-gelinkte) Kopie wird dann unter dem angegebenen lokalen Maschinennamen zur Verfügung gestellt\&. Um die Erstellung der lokalen, schreibbaren Kopie zu überspringen, übergeben Sie »-« als lokalen Maschinennamen\&.

source: Similarly to the behavior of B<pull-tar>, the read-only image is prefixed with \&.raw-, and thus not shown by B<list-images>, unless B<--all> is passed\&.
de: Ähnlich dem Verhalten von B<pull-tar> wird dem nur-lesbaren Abbild \&.raw- vorangestellt und damit wird es durch B<list-images> nur angezeigt, wenn auch B<--all> übergeben wird\&.

source: B<import-tar> I<FILE> [I<NAME>], B<import-raw> I<FILE> [I<NAME>]
de: B<import-tar> I<DATEI> [I<NAME>], B<import-raw> I<DATEI> [I<NAME>]

source: Imports a TAR or RAW container or VM image, and places it under the specified name in /var/lib/machines/\&. When B<import-tar> is used, the file specified as the first argument should be a tar archive, possibly compressed with xz, gzip or bzip2\&. It will then be unpacked into its own subvolume in /var/lib/machines/\&. When B<import-raw> is used, the file should be a qcow2 or raw disk image, possibly compressed with xz, gzip or bzip2\&. If the second argument (the resulting image name) is not specified, it is automatically derived from the file name\&. If the filename is passed as "-", the image is read from standard input, in which case the second argument is mandatory\&.
de: Importiert ein TAR- oder RAW-Container- oder VM-Abbild und legt es unter dem angegebenen Namen in /var/lib/machines/ ab\&. Wird B<import-tar> verwandt, dann sollte die als erstes Argument übergebene Datei ein Tar-Archiv sein, das gegebenenfalls mit Xz, Gzip oder Bzip2 komprimiert sein kann\&. Es wird dann in seinen eigenen Teildatenträger in /var/lib/machines/ abgelegt\&. Wird B<import-raw> verwandt, dann sollten die Dateien qcow2- oder rohe Plattenabbilder sein, die gegebenenfalls mit Xz, Gzip oder Bzip2 komprimiert sein können\&. Falls das zweite Argument (der entstehende Abbildname) nicht angegeben ist, dann wird er automatisch vom Dateinamen abgeleitet\&. Falls der Dateiname als »-« übergeben wird, dann wird das Abbild von der Standardeingabe gelesen, das zweite Argument ist dann verpflichtend\&.

source: Optionally, the B<--read-only> switch may be used to create a read-only container or VM image\&. No cryptographic validation is done when importing the images\&.
de: Optional kann der Schalter B<--read-only> zur Erstellung eines nur-lesbaren Container- oder VM-Abbildes verwandt werden\&. Beim Importieren des Abbildes erfolgt keine kryptographische Validierung\&.

source: Much like image downloads, ongoing imports may be listed with B<list-transfers> and aborted with B<cancel-transfer>\&.
de: Ähnlich wie beim Herunterladen von Abbildern können laufende Importvorgänge mit B<list-transfers> aufgeführt und mit B<cancel-transfer> abgebrochen werden\&.

source: B<import-fs> I<DIRECTORY> [I<NAME>]
de: B<import-fs> I<VERZEICHNIS> [I<NAME>]

source: Imports a container image stored in a local directory into /var/lib/machines/, operates similarly to B<import-tar> or B<import-raw>, but the first argument is the source directory\&. If supported, this command will create a btrfs snapshot or subvolume for the new image\&.
de: Importiert einen in einem lokalen Verzeichnis gespeicherten Container in /var/lib/machines/\&. Dies funktioniert ähnlich B<import-tar> oder B<import-raw>, aber das erste Argument ist das Quellverzeichnis\&. Falls unterstützt, erzeugt dieser Befehl einen Btrfs-Schnappschuss oder -Teildatenträger für das neue Abbild\&.

source: B<export-tar> I<NAME> [I<FILE>], B<export-raw> I<NAME> [I<FILE>]
de: B<export-tar> I<NAME> [I<DATEI>], B<export-raw> I<NAME> [I<DATEI>]

source: Exports a TAR or RAW container or VM image and stores it in the specified file\&. The first parameter should be a VM or container image name\&. The second parameter should be a file path the TAR or RAW image is written to\&. If the path ends in "\&.gz", the file is compressed with gzip, if it ends in "\&.xz", with xz, and if it ends in "\&.bz2", with bzip2\&. If the path ends in neither, the file is left uncompressed\&. If the second argument is missing, the image is written to standard output\&. The compression may also be explicitly selected with the B<--format=> switch\&. This is in particular useful if the second parameter is left unspecified\&.
de: Exportiert ein TAR- oder RAW-Container- oder VM-Abbild und speichert es in der angegebenen Datei\&. Der erste Parameter sollte ein VM- oder Container-Abbild-Name sein\&. Der zweite Parameter sollte ein Dateipfad sein, in den das TAR- oder RAW-Abbild geschrieben wird\&. Falls der Pfad auf »\&.gz« endet, wird die Datei mit Gzip komprimiert, falls sie auf »\&.xz« endet, mit Xz und falls sie auf »\&.bz2« endet, mit Bzip2\&. Falls sie keine dieser Endungen hat, bleibt die Datei unkomprimiert\&. Falls das zweite Argument fehlt, wird das Abbild in die Standardausgabe geschrieben\&. Die Komprimierung kann mit dem Schalter B<--format=> auch explizit ausgewählt werden\&. Dies ist insbesondere nützlich, wenn der zweite Parameter nicht angegeben wird\&.

source: Much like image downloads and imports, ongoing exports may be listed with B<list-transfers> and aborted with B<cancel-transfer>\&.
de: Ähnlich wie beim Herunterladen und Importieren von Abbildern können laufende Exportvorgänge mit B<list-transfers> aufgeführt und mit B<cancel-transfer> abgebrochen werden\&.

source: Note that, currently, only directory and subvolume images may be exported as TAR images, and only raw disk images as RAW images\&.
de: Beachten Sie, dass derzeit nur Verzeichnisse und Teildatenträger-Abbilder als TAR-Abbilder und dass nur rohe Platten-Abbilder als RAW-Abbilder exportiert werden können\&.

source: Shows a list of container or VM image downloads, imports and exports that are currently in progress\&.
de: Zeigt eine Liste von aktiven Herunterlade-, Import- und Exportvorgängen von Container- oder VM-Abbildern\&.

source: B<cancel-transfer> I<ID>\&...
de: B<cancel-transfer> I<KENNUNG>…

source: Aborts a download, import or export of the container or VM image with the specified ID\&. To list ongoing transfers and their IDs, use B<list-transfers>\&.
de: Bricht das Herunterladen, den Im- oder Export des Container- oder VM-Abbildes mit der angegebenen Kennung ab\&. Um laufende Übertragungen und ihre Kennungen anzuzeigen, verwenden Sie B<list-transfers>\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: When showing machine or image properties, limit the output to certain properties as specified by the argument\&. If not specified, all set properties are shown\&. The argument should be a property name, such as "Name"\&. If specified more than once, all properties with the specified names are shown\&.
de: Bei der Anzeige von Maschinen- oder Abbildeigenschaften wird die Ausgabe auf bestimmte, durch die Argumente angegebene Eigenschaften beschränkt\&. Falls nicht angegeben, werden alle gesetzten Eigenschaften angezeigt\&. Das Argument sollte ein Eigenschaftsname, wie »Name«, sein\&. Falls mehr als einmal angegeben, werden alle Eigenschaften mit den angegebenen Namen angezeigt\&.

source: When showing machine or image properties, show all properties regardless of whether they are set or not\&.
de: Bei der Anzeige der Maschinen- oder Abbildeigenschaften werden alle Eigenschaften angezeigt, unabhängig davon, ob sie gesetzt sind oder nicht\&.

source: When listing VM or container images, do not suppress images beginning in a dot character ("\&.")\&.
de: Beim Auflisten von VM- oder Container-Abbildern werden Abbilder, deren Name mit einem Punkt (»\&.«) beginnt, auch aufgeführt\&.

source: When cleaning VM or container images, remove all images, not just hidden ones\&.
de: Beim Bereinigen von VM- oder Container-Abbildern werden alle Abbilder, nicht nur die versteckten, entfernt\&.

source: When printing properties with B<show>, only print the value, and skip the property name and "="\&.
de: Bei der Ausgabe der Eigenschaften mit B<show> wird nur der Wert angezeigt, der Eigenschaftsname und das »=« wird übersprungen\&.
