Repository: sebras/manpages-l10n
Catalog: po/*/man1/machinectl.1.po
Languages: de

source: Override the options passed to B<less> (by default "FRSXMK")\&.
de: Setzt die an B<less> übergebenen Optionen (standardmäßig »FRSXMK«) außer Kraft\&.

source: Users might want to change two options in particular:
de: Benutzer könnten insbesondere zwei Optionen ändern wollen:

source: This option instructs the pager to exit immediately when Ctrl+C is pressed\&. To allow B<less> to handle Ctrl+C itself to switch back to the pager command prompt, unset this option\&.
de: Diese Option weist das Textanzeigeprogramm an, sich sofort beim Druck von Strg-C zu beenden\&. Um B<less> die Handhabung von Strg-C selbst zum Umschalten auf die Eingabeaufforderung zu erlauben, setzen Sie diese Option zurück\&.

source: If the value of I<$SYSTEMD_LESS> does not include "K", and the pager that is invoked is B<less>, Ctrl+C will be ignored by the executable, and needs to be handled by the pager\&.
de: Falls der Wert von I<$SYSTEMD_LESS> kein »K« enthält und B<less> das aufgerufene Textanzeigeprogramm ist, wird Strg+C durch das Programm ignoriert und muss durch das Textanzeigeprogramm selbst gehandhabt werden\&.

source: This option instructs the pager to not send termcap initialization and deinitialization strings to the terminal\&. It is set by default to allow command output to remain visible in the terminal even after the pager exits\&. Nevertheless, this prevents some pager functionality from working, in particular paged output cannot be scrolled with the mouse\&.
de: Diese Option weist das Textanzeigeprogramm an, keine Termcap-Initialisierungs- und -Deinitalisierungszeichenketten an das Terminal zu senden\&. Dies ist standardmäßig gesetzt, damit die Darstellung von Befehlen selbst nach dem Beenden des Textanzeigeprogramms sichtbar bleibt\&. Allerdings stehen dadurch einige Funktionen des Textanzeigeprogramms nicht zur Verfügung; insbesondere ist das Scrollen in der Ausgabe mit der Maus nicht möglich\&.

source: See B<less>(1) for more discussion\&.
de: Siehe B<less>(1) für weitere Ausführungen\&.

source: Override the charset passed to B<less> (by default "utf-8", if the invoking terminal is determined to be UTF-8 compatible)\&.
de: Setzt den an B<less> zu übergebenden Zeichensatz (standardmäßig »utf-8«, falls das aufrufende Terminal als UTF-8-kompatibel erkannt wurde) außer Kraft\&.

source: Takes a boolean argument\&. When true, the "secure" mode of the pager is enabled; if false, disabled\&. If I<$SYSTEMD_PAGERSECURE> is not set at all, secure mode is enabled if the effective UID is not the same as the owner of the login session, see B<geteuid>(2) and B<sd_pid_get_owner_uid>(3)\&. In secure mode, B<LESSSECURE=1> will be set when invoking the pager, and the pager shall disable commands that open or create new files or start new subprocesses\&. When I<$SYSTEMD_PAGERSECURE> is not set at all, pagers which are not known to implement secure mode will not be used\&. (Currently only B<less>(1) implements secure mode\&.)
de: Akzeptiert einen logischen Wert\&. Wenn wahr, wird der »sichere« Modus des Seitenanzeigeprogramms verwandt, falls falsch, wird dieser deaktiviert\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, dann wird der sichere Modus aktiviert, falls die effektive Kennung nicht identisch zu dem Eigentümer der Anmeldesitzung ist, siehe B<geteuid>(2) und B<sd_pid_get_owner_uid>(3)\&. Im sicheren Modus wird B<LESSSECURE=1> beim Aufruf des Seitenanzeigeprogramms gesetzt und das Seitenanzeigeprogramm muss Befehle deaktivieren, die neue Dateien öffnen oder erstellen oder die einen neuen Unterprozess starten\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, werden Seitenanzeigeprogramme, bei denen unbekannt ist, ob sie einen sicheren Modus implementieren, nicht verwandt\&. (Derzeit implementiert nur B<less>(1) einen sicheren Modus\&.)

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completely disable the pager using B<--no-pager> instead\&.
de: Hinweis: Wenn Befehle mit erhöhten Rechten ausgeführt werden, beispielsweise mittels B<sudo>(8) oder B<pkexec>(1), muss Vorsicht walten gelassen werden, um sicherzustellen, dass keine ungeplanten interaktiven Funktionalitäten aktiviert werden\&. Der »sichere« Modus für das Seitenanzeigeprogramm kann wie oben beschrieben automatisch aktiviert werden\&. Durch Setzen von I<SYSTEMD_PAGERSECURE=0> oder durch Nichtenfernen dieser Einstellung aus der ererbten Umgebung wird es dem Benutzer ermöglicht, beliebige Befehle auszuführen\&. Beachten Sie, dass auch I<$SYSTEMD_PAGERSECURE> gesetzt werden muss, falls die Variablen I<$SYSTEMD_PAGER> oder I<$PAGER> berücksichtigt werden sollen\&. Es kann sinnvoll sein, stattdessen den Seitenanzeiger komplett mit B<--no-pager> zu deaktivieren\&.

source: Takes a boolean argument\&. When true, B<systemd> and related utilities will use colors in their output, otherwise the output will be monochrome\&. Additionally, the variable can take one of the following special values: "16", "256" to restrict the use of colors to the base 16 or 256 ANSI colors, respectively\&. This can be specified to override the automatic decision based on I<$TERM> and what the console is connected to\&.
de: Akzeptiert ein logisches Argument\&. Wenn wahr, werden B<systemd> und verwandte Hilfswerkzeuge Farben in ihrer Ausgabe verwenden, andernfalls wird die Ausgabe einfarbig sein\&. Zusätzlich kann die Variable eine der folgenden besonderen Werte annehmen: »16«, »256«, um die Verwendung von Farbe auf die grundlegenden 16 bzw. 256 ANSI-Farben zu beschränken\&. Dies kann festgelegt werden, um die auf I<$TERM> und der vorliegenden Verbindung der Konsole basierende automatische Entscheidung außer Kraft zu setzen\&.

source: The value must be a boolean\&. Controls whether clickable links should be generated in the output for terminal emulators supporting this\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and other conditions\&.
de: Dies muss ein logischer Wert sein\&. Er steuert, ob anklickbare Links für Terminal-Emulatoren, die dies unterstützen, erstellt werden sollen\&. Dies kann angegeben werden, um die Entscheidung, die B<systemd> basierend auf I<$TERM> und anderen Bedingungen trifft, außer Kraft zu setzen\&.

source: SEE ALSO
de: SIEHE AUCH

source: Open an interactive shell session in a container or on the local host\&. The first argument refers to the container machine to connect to\&. If none is specified, or the machine name is specified as the empty string, or the special machine name "\&.host" (see below) is specified, the connection is made to the local host instead\&. This works similar to B<login> but immediately invokes a user process\&. This command runs the specified executable with the specified arguments, or the default shell for the user if none is specified, or /bin/sh if no default shell is found\&. By default, B<--uid=>, or by prefixing the machine name with a username and an "@" character, a different user may be selected\&. Use B<--setenv=> to set environment variables for the executed process\&.
de: Öffnet eine interaktive Shell-Sitzung in einem Container oder der lokalen Maschine\&. Das erste Argument bezieht sich auf die zu verbindende Container-Maschine\&. Falls keine angegeben ist oder der Container-Name als leere Zeichenkette oder der besondere Maschinenname »\&.host« angegeben ist (siehe unten), erfolgt die Verbindung stattdessen zum lokalen Rechner\&. Dies funktioniert ähnlich zu B<login>, ruft aber sofort einen Benutzerprozess auf\&. Dieser Befehl führt das angegebene Benutzerprogramm mit den angegebenen Argumenten oder die Standard-Shell für den Benutzer, falls kein Befehl angegeben ist, oder /bin/sh, falls keine Vorgabe-Shell gefunden wird, aus\&. Standardmäßig kann ein anderer Benutzer ausgewählt werden, indem B<--uid=> verwandt oder dem Maschinennamen ein Benutzername und das Zeichen »@« vorangestellt wird\&. Verwenden Sie B<--setenv=>, um Umgebungsvariablen für den ausgeführten Prozess zu setzen\&.

source: When using the B<shell> command without arguments, (thus invoking the executed shell or command on the local host), it is in many ways similar to a B<su>(1) session, but, unlike B<su>, completely isolates the new session from the originating session, so that it shares no process or session properties, and is in a clean and well-defined state\&. It will be tracked in a new utmp, login, audit, security and keyring session, and will not inherit any environment variables or resource limits, among other properties\&.
de: Der Einsatz des Befehls B<shell> ohne Argumente (womit der aufgerufene Befehl oder die Shell auf dem lokalen Rechner ausgeführt wird) ist auf viele Arten ähnlich einer B<su>(1)-Sitzung, isoliert aber anders als B<su> die neue Sitzung von der ursprünglichen Sitzung, so dass kein Prozess und keine Sitzungseigenschaften gemeinsam benutzt werden und sie in einem sauberen und gut-definiertem Zustand ist\&. Sie wird in einer neuen Utmp-, Anmelde-, Audit-, Sicherheits- und Schlüsselbund-Sitzung nachverfolgt und wird keine Umgebungsvariablen oder Ressourcenbegrenzungen (und andere Eigenschaften) erben\&.

source: Note that B<systemd-run>(1) with its B<--machine=> switch may be used in place of the B<machinectl shell> command, and allows non-interactive operation, more detailed and low-level configuration of the invoked unit, as well as access to runtime and exit code/status information of the invoked shell process\&. In particular, use B<systemd-run>\*(Aqs B<--wait> switch to propagate exit status information of the invoked process\&. Use B<systemd-run>\*(Aqs B<--pty> switch for acquiring an interactive shell, similar to B<machinectl shell>\&. In general, B<systemd-run> is preferable for scripting purposes\&. However, note that B<systemd-run> might require higher privileges than B<machinectl shell>\&.
de: Beachten Sie, dass anstelle des Befehls B<machinectl shell> B<systemd-run>(1) mit seinem Schalter B<--machine=> verwandt werden kann, was nicht-interaktive Aktionen, detailliertere und systemnahere Konfiguration der betroffenen Unit sowie den Zugriff auf Laufzeit- und Exit-Code/Status-Informationen des aufgerufenen Shell-Prozesses ermöglicht\&. Verwenden Sie insbesondere den Schalter B<--wait> von B<systemd-run>, um Exit-Statusinformationen vom aufgerufenen Prozess weiterzuleiten\&. Verwenden Sie den Schalter B<--pty> von B<systemd-run>, um eine interaktive Shell zu erlangen, ähnlich zu B<machinectl shell>\&. Im Allgemeinen wird B<systemd-run> für Skripting-Zwecke bevorzugt\&. Beachten Sie allerdings, dass B<systemd-run> höhere Privilegien als B<machinectl shell> erlangen könnte\&.

source: Enable or disable a container as a system service to start at system boot, using B<systemd-nspawn>(1)\&. This enables or disables systemd-nspawn@\&.service, instantiated for the specified machine name, similar to the effect of B<systemctl enable> or B<systemctl disable> on the service name\&.
de: Aktiviert oder deaktiviert das Starten eines Containers mittels B<systemd-nspawn>(1) als Systemdienst beim Systemstart\&. Dies aktiviert oder deaktiviert systemd-nspawn@\&.service, instanziiert für den angegebenen Maschinennamen, von der Wirkung ähnlich B<systemctl enable> oder B<systemctl disable> auf den Dienstenamen\&.

source: Send a signal to one or more processes of the virtual machine or container\&. This means processes as seen by the host, not the processes inside the virtual machine or container\&. Use B<--kill-who=> to select which process to kill\&. Use B<--signal=> to select the signal to send\&.
de: Sendet ein Signal an einen oder mehrere Prozesse der virtuellen Maschine oder des Containers\&. Dies bezieht sich auf Prozesse, wie sie vom Wirtsrechner gesehen werden, nicht Prozesse innerhalb der virtuellen Maschine oder des Containers\&. Wählen Sie die zu tötenden Prozesse mit B<--kill-who=>\&. Verwenden Sie B<--signal=> zur Auswahl des zu sendenden Signals\&.

source: B<copy-to> I<NAME> I<PATH> [I<PATH>]
de: B<copy-to> I<NAME> I<PFAD> [I<PFAD>]

source: B<copy-from> I<NAME> I<PATH> [I<PATH>]
de: B<copy-from> I<NAME> I<PFAD> [I<PFAD>]

source: Similar to the behavior of B<pull-tar>, the read-only image is prefixed with \&.raw-, and thus not shown by B<list-images>, unless B<--all> is passed\&.
de: Ähnlich dem Verhalten von B<pull-tar> wird dem nur-lesbaren Abbild \&.raw- vorangestellt und damit wird es durch B<list-images> nur angezeigt, wenn auch B<--all> übergeben wird\&.

source: Imports a container image stored in a local directory into /var/lib/machines/, operates similar to B<import-tar> or B<import-raw>, but the first argument is the source directory\&. If supported, this command will create btrfs snapshot or subvolume for the new image\&.
de: Importiert einen in einem lokalen Verzeichnis gespeicherten Container in /var/lib/machines/\&. Dies funktioniert ähnlich B<import-tar> oder B<import-raw>, aber das erste Argument ist das Quellverzeichnis\&. Falls unterstützt, erzeugt dieser Befehl einen Btrfs-Schnappschuss oder -Teildatenträger für das neue Abbild\&.

source: When used with the B<list-machines> command, limits the number of ip addresses output for every machine\&. Defaults to 1\&. All addresses can be requested with "all" as argument to B<--max-addresses=>\&. If the argument to B<--max-addresses=> is less than the actual number of addresses, "\&..."follows the last address\&.
de: Begrenzt bei der Verwendung mit dem Befehl B<list-machines> die Anzahl der für jede Maschine ausgegebenen IP-Adressen\&. Standardmäßig 1\&. Durch Verwendung von »all« als Argument für B<--max-addresses=> können alle Adressen angefordert werden\&. Falls das Argument von B<--max-addresses=> geringer als die tatsächliche Anzahl von Adressen ist, dann folgt »…« der letzten Adresse\&.

source: B<-E >I<NAME>B<=>I<VALUE>, B<--setenv=>I<NAME>B<=>I<VALUE>
de: B<-E >I<NAME>B<=>I<WERT>, B<--setenv=>I<NAME>B<=>I<WERT>

source: When used with the B<shell> command, sets an environment variable to pass to the executed shell\&. Takes an environment variable name and value, separated by "="\&. This switch may be used multiple times to set multiple environment variables\&. Note that this switch is not supported for the B<login> command (see below)\&.
de: Bei der Verwendung mit dem Befehl B<shell> wird eine an die ausgeführte Shell zu übergebende Umgebungsvariable gesetzt\&. Akzeptiert einen Umgebungsvariablennamen und -wert, getrennt durch »=«\&. Dieser Schalter kann mehrfach verwandt werden, um mehrere Umgebungsvariablen zu setzen\&. Beachten Sie, dass dieser Schalter nicht für den Befehl B<login> unterstützt wird (siehe oben)\&.
