Repository: sebras/manpages-l10n
Catalog: po/*/man1/machinectl.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: machinectl - Control the systemd machine manager
de: machinectl - Steuert den Systemd-Maschinenverwalter

source: SYNOPSIS
de: ÜBERSICHT

source: B<machinectl> [OPTIONS...] {COMMAND} [NAME...]
de: B<machinectl> [OPTIONEN…] {BEFEHL} [NAME…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<machinectl> may be used to introspect and control the state of the B<systemd>(1) virtual machine and container registration manager B<systemd-machined.service>(8)\&.
de: B<machinectl> kann zur Untersuchung und Steuerung des Zustand des Registrierungsverwalters B<systemd-machined.service>(8) von B<systemd>(1) für virtuelle Maschinen und Container verwandt werden\&.

source: B<machinectl> may be used to execute operations on machines and images\&. Machines in this sense are considered running instances of:
de: B<machinectl> kann zur Ausführung von Aktionen auf Maschinen und Abbildern verwandt werden\&. In diesem Zusammenhang werden Maschinen als folgende laufende Instanzen betrachtet:

source: Virtual Machines (VMs) that virtualize hardware to run full operating system (OS) instances (including their kernels) in a virtualized environment on top of the host OS\&.
de: Virtuelle Maschinen (VMs), die Hardware virtualisieren, um vollständige Betriebssysteminstanzen (einschließlich ihrer Kernel) in einer virtualisierten Umgebung oberhalb des Wirtsbetriebssystems auszuführen\&.

source: Containers that share the hardware and OS kernel with the host OS, in order to run OS userspace instances on top the host OS\&.
de: Container, die Hardware und Betriebssystemkernel mit dem Wirtsbetriebssystem gemeinsam benutzen, um eine Betriebssystem-Benutzerinstanz oberhalb des Wirtsbetriebssystems auszuführen\&.

source: The host system itself\&.
de: Das Wirtsystem selbst\&.

source: Machines are identified by names that follow the same rules as UNIX and DNS hostnames\&. For details, see below\&.
de: Maschinen werden durch Namen identifiziert, die den gleichen Regeln wie UNIX- und DNS-Rechnernamen folgen\&. Details nachfolgend\&.

source: Machines are instantiated from disk or file system images that frequently\ \&\(em but not necessarily\ \&\(em carry the same name as machines running from them\&. Images in this sense may be:
de: Maschinen werden von Platte oder Systemabbildern instanziiert, die häufig, aber nicht notwendigerweise, die gleichen Namen wie Maschinen, von denen sie ausgeführt werden, tragen\&. In diesem Zusammenhang können Abbilder Folgendes sein:

source: Directory trees containing an OS, including the top-level directories /usr/, /etc/, and so on\&.
de: Verzeichnisbäume, die ein Betriebssystem enthalten, einschließlich der Verzeichnisse auf oberster Ebene wie /usr/, /etc/ usw\&.

source: btrfs subvolumes containing OS trees, similar to regular directory trees\&.
de: Btrfs-Teildatenträger, die Betriebssystembäume, ähnlich zu regulären Verzeichnisbäumen enthalten\&.

source: Binary "raw" disk image files containing MBR or GPT partition tables and Linux file systems\&.
de: Binäre »rohe« Plattenabbilddateien, die MBR- oder GPT-Partitionstabellen und Linux-Dateisysteme enthalten\&.

source: Similarly, block devices containing MBR or GPT partition tables and file systems\&.
de: Ähnlicherweise Blockgeräte, die MBR- oder GPT-Partitionstabellen und Dateisysteme enthalten\&.

source: The file system tree of the host OS itself\&.
de: Der Dateisystembaum des Wirtsbetriebssystems selbst\&.

source: COMMANDS
de: BEFEHLE

source: The following commands are understood:
de: Die folgenden Befehle werden verstanden:

source: Machine Commands
de: Maschinenbefehle

source: List currently running (online) virtual machines and containers\&. To enumerate machine images that can be started, use B<list-images> (see below)\&. Note that this command hides the special "\&.host" machine by default\&. Use the B<--all> switch to show it\&.
de: Listet die derzeit laufenden (online) virtuellen Maschinen und Container auf\&. Um startfähige Maschinenabbilder aufzuzählen, verwenden Sie B<list-images> (siehe unten)\&. Beachten Sie, dass dieser Befehl standardmäßig die besondere Maschine »\&.host« versteckt\&. Verwenden Sie den Schalter B<--all>, um sie anzuzeigen\&.

source: Show runtime status information about one or more virtual machines and containers, followed by the most recent log data from the journal\&. This function is intended to generate human-readable output\&. If you are looking for computer-parsable output, use B<show> instead\&. Note that the log data shown is reported by the virtual machine or container manager, and frequently contains console output of the machine, but not necessarily journal contents of the machine itself\&.
de: Zeigt Laufzeitstatusinformationen über eine oder mehrere virtuelle Maschinen und Container an, gefolgt von den neusten Protokolldaten aus dem Journal\&. Diese Funktion ist zur Darstellung menschenlesbarer Ausgabe gedacht\&. Falls Sie Computer-auswertbare Ausgaben benötigen, verwenden Sie stattdessen B<show>\&. Beachten Sie, dass die angezeigten Protokolldaten durch den Verwalter der virtuellen Maschine oder Container gemeldet werden und häufig Konsolenausgabe aus der Maschine enthält, aber nicht notwendigerweise Journal-Inhalte der Maschine selbst\&.

source: Show properties of one or more registered virtual machines or containers or the manager itself\&. If no argument is specified, properties of the manager will be shown\&. If a NAME is specified, properties of this virtual machine or container are shown\&. By default, empty properties are suppressed\&. Use B<--all> to show those too\&. To select specific properties to show, use B<--property=>\&. This command is intended to be used whenever computer-parsable output is required, and does not print the control group tree or journal entries\&. Use B<status> if you are looking for formatted human-readable output\&.
de: Zeigt die Eigenschaften einer oder mehrerer registrierter virtueller Maschinen oder Container oder des Verwalters selbst an\&. Falls kein Argument angegeben ist, werden die Eigenschaften des Verwalters angezeigt\&. Falls ein NAME angegeben ist, werden die Eigenschaften dieser virtuellen Maschine oder dieses Containers angezeigt\&. Standardmäßig werden leere Eigenschaften unterdrückt\&. Verwenden Sie B<--all>, um diese auch anzuzeigen\&. Um bestimmte anzuzeigende Eigenschaften auszuwählen, verwenden Sie B<--property=>\&. Dieser Befehl ist dafür gedacht, eingesetzt zu werden, wenn Computer-auswertbare Ausgabe benötigt wird und gibt nicht den gesamten Control-Gruppenbaum oder Journal-Einträge aus\&. Verwenden Sie B<status>, falls Sie menschenlesbare Ausgabe benötigen\&.

source: Start a container as a system service, using B<systemd-nspawn>(1)\&. This starts systemd-nspawn@\&.service, instantiated for the specified machine name, similar to the effect of B<systemctl start> on the service name\&. B<systemd-nspawn> looks for a container image by the specified name in /var/lib/machines/ (and other search paths, see below) and runs it\&. Use B<list-images> (see below) for listing available container images to start\&.
de: Startet einen Container mittels B<systemd-nspawn>(1) als Systemdienst\&. Dies startet systemd-nspawn@\&.service, instanziiert für den angegebenen Maschinennamen, ähnlich der Wirkung von B<systemctl start> auf den Dienstenamen\&. B<systemd-nspawn> sucht nach einem Container-Abbild des angegebenen Namens in /var/lib/machines/ (und anderen Suchpfaden, siehe unten) und führt ihn aus\&. Verwenden Sie B<list-images> (siehe unten) zur Auflistung verfügbarer, startfähiger Container-Abbilder\&.

source: Note that B<systemd-machined.service>(8) also interfaces with a variety of other container and VM managers, B<systemd-nspawn> is just one implementation of it\&. Most of the commands available in B<machinectl> may be used on containers or VMs controlled by other managers, not just B<systemd-nspawn>\&. Starting VMs and container images on those managers requires manager-specific tools\&.
de: Beachten Sie, dass B<systemd-machined.service>(8) auch mit einer Reihe von anderen Container- und VM-Verwaltern koppelt, B<systemd-nspawn> ist nur eine Implementierung davon\&. Die meisten in B<machinectl> verfügbaren Befehle können auch auf durch andere Verwalter, nicht nur B<systemd-nspawn>, gesteuerte Container oder VMs angewandt werden\&. Das Starten von VMs und Container-Abbildern bei diesen Verwaltungsprogrammen benötigt angepasste Werkzeuge\&.

source: To interactively start a container on the command line with full access to the container\*(Aqs console, please invoke B<systemd-nspawn> directly\&. To stop a running container use B<machinectl poweroff>\&.
de: Um auf der Befehlszeile einen Container interaktiv mit vollem Zugriff auf die Konsole des Containers zu starten, rufen Sie B<systemd-nspawn> direkt auf\&. Zum Stoppen eines Containers verwenden Sie B<machinectl poweroff>\&.

source: Open an interactive terminal login session in a container or on the local host\&. If an argument is supplied, it refers to the container machine to connect to\&. If none is specified, or the container name is specified as the empty string, or the special machine name "\&.host" (see below) is specified, the connection is made to the local host instead\&. This will create a TTY connection to a specific container or the local host and asks for the execution of a getty on it\&. Note that this is only supported for containers running B<systemd>(1) as init system\&.
de: Öffnet eine interaktive Terminalanmeldesitzung in einem Container oder auf der lokalen Maschine\&. Falls ein Argument bereitgestellt wird, bezieht es sich auf die Container-Maschine, zu der verbunden werden soll\&. Falls keine angegeben ist oder der Container-Name als leere Zeichenkette oder der besondere Maschinenname »\&.host« angegeben ist (siehe unten), erfolgt die Verbindung stattdessen zum lokalen Rechner\&. Dies erstellt eine TTY-Verbindung zu dem angegebenen Container oder der lokalen Maschine und bittet um die Ausführung eines Getty darauf\&. Beachten Sie, dass dies nur für Container unterstützt wird, die B<systemd>(1) als Init-System ausführen\&.

source: This command will open a full login prompt on the container or the local host, which then asks for username and password\&. Use B<shell> (see below) or B<systemd-run>(1) with the B<--machine=> switch to directly invoke a single command, either interactively or in the background\&.
de: Dieser Befehl öffnet eine vollständige Anmeldeaufforderung im Container oder der lokalen Maschine, die dann um Benutzername und Passwort bittet\&. Verwenden Sie B<shell> (siehe unten) oder B<systemd-run>(1) mit dem Schalter B<--machine=>, um direkt einen einzelnen Befehl aufzurufen, entweder interaktiv oder im Hintergrund\&.

source: B<shell> [[I<NAME>@]I<NAME> [I<PATH> [I<ARGUMENTS>\&...]]]
de: B<shell> [[I<NAME>@]I<NAME> [I<PFAD> [I<ARGUMENTE>…]]]

source: Open an interactive shell session in a container or on the local host\&. The first argument refers to the container machine to connect to\&. If none is specified, or the machine name is specified as the empty string, or the special machine name "\&.host" (see below) is specified, the connection is made to the local host instead\&. This works similarly to B<login>, but immediately invokes a user process\&. This command runs the specified executable with the specified arguments, or the default shell for the user if none is specified, or /bin/sh if no default shell is found\&. By default, B<--uid=>, or by prefixing the machine name with a username and an "@" character, a different user may be selected\&. Use B<--setenv=> to set environment variables for the executed process\&.
de: Öffnet eine interaktive Shell-Sitzung in einem Container oder der lokalen Maschine\&. Das erste Argument bezieht sich auf die zu verbindende Container-Maschine\&. Falls keine angegeben ist oder der Container-Name als leere Zeichenkette oder der besondere Maschinenname »\&.host« angegeben ist (siehe unten), erfolgt die Verbindung stattdessen zum lokalen Rechner\&. Dies funktioniert ähnlich zu B<login>, ruft aber sofort einen Benutzerprozess auf\&. Dieser Befehl führt das angegebene Benutzerprogramm mit den angegebenen Argumenten oder die Standard-Shell für den Benutzer, falls kein Befehl angegeben ist, oder /bin/sh, falls keine Vorgabe-Shell gefunden wird, aus\&. Standardmäßig kann ein anderer Benutzer ausgewählt werden, indem B<--uid=> verwandt oder dem Maschinennamen ein Benutzername und das Zeichen »@« vorangestellt wird\&. Verwenden Sie B<--setenv=>, um Umgebungsvariablen für den ausgeführten Prozess zu setzen\&.

source: Note that B<machinectl shell> does not propagate the exit code/status of the invoked shell process\&. Use B<systemd-run> instead if that information is required (see below)\&.
de: Beachten Sie, dass B<machinectl shell> den Exit-Code/Status des aufgerufenen Shell-Prozesses nicht weiterleitet\&. Verwenden Sie stattdessen B<systemd-run>, falls diese Information benötigt wird (siehe unten)\&.

source: Using the B<shell> command without arguments (thus invoking the executed shell or command on the local host), is in many ways similar to a B<su>(1) session, but, unlike B<su>, completely isolates the new session from the originating session, so that it shares no process or session properties and is in a clean well-defined state\&. It will be tracked in a new utmp, login, audit, security, and keyring sessions, and will not inherit any environment variables or resource limits, among other properties\&.
de: Der Einsatz des Befehls B<shell> ohne Argumente (womit der aufgerufene Befehl oder die Shell auf dem lokalen Rechner ausgeführt wird) ist auf viele Arten ähnlich einer B<su>(1)-Sitzung, isoliert aber anders als B<su> die neue Sitzung von der ursprünglichen Sitzung, so dass kein Prozess und keine Sitzungseigenschaften gemeinsam benutzt werden und sie in einem sauberen und gut-definiertem Zustand ist\&. Sie wird in einer neuen Utmp-, Anmelde-, Audit-, Sicherheits- und Schlüsselbund-Sitzung nachverfolgt und wird keine Umgebungsvariablen oder Ressourcenbegrenzungen (und andere Eigenschaften) erben\&.

source: Note that B<systemd-run>(1) with its B<--machine=> switch may be used in place of the B<machinectl shell> command, and allows non-interactive operation, more detailed and low-level configuration of the invoked unit, as well as access to runtime and exit code/status information of the invoked shell process\&. In particular, use B<systemd-run>\*(Aqs B<--wait> switch to propagate exit status information of the invoked process\&. Use B<systemd-run>\*(Aqs B<--pty> switch to acquire an interactive shell, similarly to B<machinectl shell>\&. In general, B<systemd-run> is preferable for scripting purposes\&. However, note that B<systemd-run> might require higher privileges than B<machinectl shell>\&.
de: Beachten Sie, dass anstelle des Befehls B<machinectl shell> B<systemd-run>(1) mit seinem Schalter B<--machine=> verwandt werden kann, was nicht-interaktive Aktionen, detailliertere und systemnahere Konfiguration der betroffenen Unit sowie den Zugriff auf Laufzeit- und Exit-Code/Status-Informationen des aufgerufenen Shell-Prozesses ermöglicht\&. Verwenden Sie insbesondere den Schalter B<--wait> von B<systemd-run>, um Exit-Statusinformationen vom aufgerufenen Prozess weiterzuleiten\&. Verwenden Sie den Schalter B<--pty> von B<systemd-run>, um eine interaktive Shell zu erlangen, ähnlich zu B<machinectl shell>\&. Im Allgemeinen wird B<systemd-run> für Skripting-Zwecke bevorzugt\&. Beachten Sie allerdings, dass B<systemd-run> höhere Privilegien als B<machinectl shell> erlangen könnte\&.

source: Enable or disable a container as a system service to start at system boot, using B<systemd-nspawn>(1)\&. This enables or disables systemd-nspawn@\&.service, instantiated for the specified machine name, similarly to the effect of B<systemctl enable> or B<systemctl disable> on the service name\&.
de: Aktiviert oder deaktiviert das Starten eines Containers mittels B<systemd-nspawn>(1) als Systemdienst beim Systemstart\&. Dies aktiviert oder deaktiviert systemd-nspawn@\&.service, instanziiert für den angegebenen Maschinennamen, von der Wirkung ähnlich B<systemctl enable> oder B<systemctl disable> auf den Dienstenamen\&.

source: Power off one or more containers\&. This will trigger a reboot by sending SIGRTMIN+4 to the container\*(Aqs init process, which causes systemd-compatible init systems to shut down cleanly\&. Use B<stop> as alias for B<poweroff>\&. This operation does not work on containers that do not run a B<systemd>(1)-compatible init system, such as sysvinit\&. Use B<terminate> (see below) to immediately terminate a container or VM, without cleanly shutting it down\&.
de: Schaltet einen oder mehrere Container aus\&. Dies wird durch Senden von SIGRTMIN+4 an den Init-Prozess des Containers einen Neustart auslösen, wodurch Systemd-kompatible Init-Systeme sauber heruntergefahren werden\&. Verwenden Sie B<stop> als Alias für B<poweroff>\&. Diese Aktion funktioniert bei Containern, die keine B<systemd>(1)-kompatiblen Init-Systeme, wie Sysvinit, ausführen, nicht\&. Verwenden Sie das (nachfolgend beschriebene) B<terminate>, um einen Container oder eine VM sofort zu beenden, ohne sie sauber herunterzufahren\&.

source: Reboot one or more containers\&. This will trigger a reboot by sending SIGINT to the container\*(Aqs init process, which is roughly equivalent to pressing Ctrl+Alt+Del on a non-containerized system, and is compatible with containers running any system manager\&.
de: Startet einen oder mehrere Container neu\&. Dies wird durch Senden von SIGINT an den Init-Prozess des Containers einen Neustart auslösen\&. Dies ist grob äquivalent zum Drücken von Strg-Alt-Entf auf einem System außerhalb eines Containers und kompatibel mit Containern mit beliebigen Systemverwaltern\&.

source: Immediately terminates a virtual machine or container, without cleanly shutting it down\&. This kills all processes of the virtual machine or container and deallocates all resources attached to that instance\&. Use B<poweroff> to issue a clean shutdown request\&.
de: Beendet die virtuelle Maschine oder den Container sofort, ohne ihn sauber herunterzufahren\&. Dies tötet alle Prozesse der virtuellen Maschine oder des Containers und gibt alle dieser Instanz zugeordneten Ressourcen frei\&. Verwenden Sie B<poweroff>, um ein sauberes Herunterfahren anzufordern\&.

source: Send a signal to one or more processes of the virtual machine or container\&. This means processes as seen by the host, not the processes inside the virtual machine or container\&. Use B<--kill-whom=> to select which process to kill\&. Use B<--signal=> to select the signal to send\&.
de: Sendet ein Signal an einen oder mehrere Prozesse der virtuellen Maschine oder des Containers\&. Dies bezieht sich auf Prozesse, wie sie vom Wirtsrechner gesehen werden, nicht Prozesse innerhalb der virtuellen Maschine oder des Containers\&. Wählen Sie die zu tötenden Prozesse mit B<--kill-whom=>\&. Verwenden Sie B<--signal=> zur Auswahl des zu sendenden Signals\&.

source: B<bind> I<NAME> I<PATH> [I<PATH>]
de: B<bind> I<NAME> I<PFAD> [I<PFAD>]

source: Bind mounts a file or directory from the host into the specified container\&. The first path argument is the source file or directory on the host, the second path argument is the destination file or directory in the container\&. When the latter is omitted, the destination path in the container is the same as the source path on the host\&. When combined with the B<--read-only> switch, a ready-only bind mount is created\&. When combined with the B<--mkdir> switch, the destination path is first created before the mount is applied\&. Note that this option is currently only supported for B<systemd-nspawn>(1) containers, and only if user namespacing (B<--private-users>) is not used\&. This command supports bind mounting directories, regular files, device nodes, B<AF_UNIX> socket nodes, as well as FIFOs\&.
de: Hängt eine Datei oder ein Verzeichnis vom Wirtssystem in den angegebenen Container mit »bind« ein\&. Das erste Pfadargument ist die Quelldatei oder das Quellverzeichnis auf dem Wirtssystem, das zweite Pfadargument ist die Zieldatei oder der Zielpfad im Container\&. Wenn Letzterer fehlt, wird dafür das gleiche wie der Quellpfad auf dem Wirtssystem verwandt\&. Bei der Kombination mit dem Schalter B<--read-only> wird eine nur-lesbare Bind-Einhängung erstellt\&. Bei der Kombination mit dem Schalter B<--mkdir> wird vor dem Einhängen der Zielpfad zuerst erstellt\&. Beachten Sie, dass diese Option derzeit nur für B<systemd-nspawn>(1)-Container unterstützt wird, und nur wenn Benutzer-Namensräume (B<--private-users>) nicht verwandt werden\&. Dieser Befehl unterstützt das Bind-Einhängen von Verzeichnissen, regulären Dateien, Geräteknoten, B<AF_UNIX>-Socket-Knoten sowie FIFOs\&.

source: B<copy-to> I<NAME> I<PATH> [I<PATH>] B<--force>
de: B<copy-to> I<NAME> I<PFAD> [I<PFAD>] B<--force>

source: Copies files or directories from the host system into a running container\&. Takes a container name, followed by the source path on the host and the destination path in the container\&. If the destination path is omitted, the same as the source path is used\&.
de: Kopiert Dateien oder Verzeichnisse vom Wirtssystem in einen laufenden Container\&. Akzeptiert einen Container-Namen, gefolgt vom Quellpfad auf dem Wirtssystem und dem Zielpfad im Container\&. Falls der Zielpfad fehlt, wird dafür das gleiche wie der Quellpfad verwandt\&.

source: If host and container share the same user and group namespace, file ownership by numeric user ID and group ID is preserved for the copy, otherwise all files and directories in the copy will be owned by the root user and group (UID/GID 0)\&.
de: Falls der Rechner und der Container den gleichen Benutzer- und Gruppennamensraum benutzen, wird die Dateieigentümerschaft durch numerische Benutzer- und Gruppenkennung für die Kopie erhalten, andernfalls gehören alle Dateien und Gruppen dem Benutzer und der Gruppe root (UID/GID 0)\&.

source: B<copy-from> I<NAME> I<PATH> [I<PATH>] B<--force>
de: B<copy-from> I<NAME> I<PFAD> [I<PFAD>] B<--force>

source: Copies files or directories from a container into the host system\&. Takes a container name, followed by the source path in the container and the destination path on the host\&. If the destination path is omitted, the same as the source path is used\&.
de: Kopiert Dateien oder Verzeichnisse aus dem Container auf den Rechner\&. Akzeptiert einen Container-Namen, gefolgt von einem Quellpfad im Container und dem Zielpfad im Rechner\&. Falls der Zielpfad entfällt, wird er identisch zum Quellpfad verwandt\&.

source: Image Commands
de: Abbild-Befehle
