Repository: sebras/manpages-l10n
Catalog: po/*/man1/machinectl.1.po
Languages: de

source: Do not ellipsize process tree entries or table\&. This implies B<--max-addresses=full>\&.
de: Verkürzt die Prozessbaumeinträge oder die -tabelle nicht\&. Dies impliziert B<--max-addresses=full>\&.

source: When used with B<kill>, choose which processes to kill\&. Must be one of B<leader>, or B<all> to select whether to kill only the leader process of the machine or all processes of the machine\&. If omitted, defaults to B<all>\&.
de: Wählt bei der Verwendung mit B<kill> den zu tötenden Prozess aus\&. Muss entweder B<leader> oder B<all> sein, um auszuwählen, ob nur der Leitungsprozess der Maschine oder alle Prozesse der Maschine getötet werden sollen\&. Falls nicht angegeben, ist die Vorgabe B<all>\&.

source: When used with B<kill>, choose which signal to send to selected processes\&. Must be one of the well-known signal specifiers such as B<SIGTERM>, B<SIGINT> or B<SIGSTOP>\&. If omitted, defaults to B<SIGTERM>\&.
de: Sucht bei der Verwendung mit B<kill> das Signal aus, das an ausgewählte Prozesse gesandt wird\&. Muss eines der gut bekannten Signalkennungen wie B<SIGTERM>, B<SIGINT> oder B<SIGSTOP> sein\&. Falls weggelassen, ist die Vorgabe B<SIGTERM>\&.

source: The special value "help" will list the known values and the program will exit immediately, and the special value "list" will list known values along with the numerical signal numbers and the program will exit immediately\&.
de: Der besondere Wert »help« wird alle bekannten Werte darstellen und das Programm wird sich sofort beenden; der besondere Wert »list« wird alle bekannten Werte zusammen mit ihren numerischen Signalnummern darstellen und das Programm wird sich sofort beenden\&.

source: When used with the B<shell> command, chooses the user ID to open the interactive shell session as\&. If the argument to the B<shell> command also specifies a user name, this option is ignored\&. If the name is not specified in either way, "root" will be used by default\&. Note that this switch is not supported for the B<login> command (see below)\&.
de: Wählt bei der Verwendung mit dem Befehl B<shell> die Benutzerkennung aus, unter der die interaktive Shell-Sitzung geöffnet werden soll\&. Falls das Argument des Befehls B<shell> auch einen Benutzernamen angibt, wird diese Option ignoriert\&. Falls der Name nicht auf eine der Arten angegeben ist, dann wird standardmäßig »root« verwandt\&. Beachten Sie, dass dieser Schalter nicht für den Befehl B<login> unterstützt wird (siehe unten)\&.

source: B<-E >I<NAME>B<[=>I<VALUE>B<]>, B<--setenv=>I<NAME>B<[=>I<VALUE>B<]>
de: B<-E >I<NAME>B<[=>I<WERT>B<]>, B<--setenv=>I<NAME>B<[=>I<WERT>B<]>

source: When used with the B<shell> command, sets an environment variable for the executed shell\&. This option may be used more than once to set multiple variables\&. When "=" and I<VALUE> are omitted, the value of the variable with the same name in the program environment will be used\&.
de: Bei der Verwendung mit dem Befehl B<shell> wird eine Umgebungsvariable für die ausgeführte Shell gesetzt\&. Diese Option kann mehrfach angegeben werden, um mehrere Variablen zu setzen\&. Wenn »=« und I<WERT> fehlen, wird der Wert der Variablen mit dem gleichen Namen in der Programmumgebung verwandt\&.

source: Note that this option is not supported for the B<login> command\&.
de: Beachten Sie, dass diese Option für den Befehl B<login> nicht unterstützt wird\&.

source: When used with B<bind>, creates the destination file or directory before applying the bind mount\&. Note that even though the name of this option suggests that it is suitable only for directories, this option also creates the destination file node to mount over if the object to mount is not a directory, but a regular file, device node, socket or FIFO\&.
de: Wird dies mit B<bind> verwandt, dann wird die Zieldatei oder das Zielverzeichnis erstellt, bevor die Bind-Einhängung angewandt wird\&. Beachten Sie, dass der Name dieser Option zwar anzeigt, dass sie nur für Verzeichnisse geeignet ist, sie aber auch den Zieldateiknoten, über den eingehängt werden soll, falls das einzuhängende Objekt kein Verzeichnis, sondern eine reguläre Datei, ein Geräteknoten, ein Socket oder ein FIFO ist, erstellt\&.

source: When used with B<bind>, creates a read-only bind mount\&.
de: Erstellt bei der Verwendung mit B<bind> eine nur lesbare Bind-Einhängung\&.

source: When used with B<clone>, B<import-raw> or B<import-tar> a read-only container or VM image is created\&.
de: Bei der Verwendung mit B<clone>, B<import-raw> oder B<import-tar> wird ein nur-lesbares Container- oder VM-Abbild erstellt\&.

source: When used with B<status>, controls the number of journal lines to show, counting from the most recent ones\&. Takes a positive integer argument\&. Defaults to 10\&.
de: Steuert bei der Verwendung mit B<status> die Anzahl der anzuzeigenden Journal-Einträge, gezählt vom neusten\&. Akzeptiert eine positive Ganzzahl als Argument\&. Standardmäßig 10\&.

source: When used with B<status>, controls the formatting of the journal entries that are shown\&. For the available choices, see B<journalctl>(1)\&. Defaults to "short"\&.
de: Steuert bei der Verwendung mit B<status> die Formatierung der angezeigten Journal-Einträge\&. Für die Auswahlmöglichkeiten siehe B<journalctl>(1)\&. Standardmäßig »short«\&.

source: When downloading a container or VM image, specify whether the image shall be verified before it is made available\&. Takes one of "no", "checksum" and "signature"\&. If "no", no verification is done\&. If "checksum" is specified, the download is checked for integrity after the transfer is complete, but no signatures are verified\&. If "signature" is specified, the checksum is verified and the image\*(Aqs signature is checked against a local keyring of trustable vendors\&. It is strongly recommended to set this option to "signature" if the server and protocol support this\&. Defaults to "signature"\&.
de: Gibt beim Herunterladen eines Container- oder VM-Abbildes an, ob das Abbild vor der Bereitstellung verifiziert werden soll\&. Akzeptiert »no«, »checksum« oder »signature«\&. Falls »no«, erfolgt keine Verifizierung\&. Falls »checksum« angegeben ist, wird nach Abschluss des Herunterladens die Integrität überprüft, aber es erfolgt keine Signaturverifizierung\&. Falls »signature« angegeben ist, wird die Prüfsumme und die Signatur des Abbildes unter Verwendung des lokalen Schlüsselbundes mit vertrauenswürdigen Lieferanten geprüft\&. Es wird nachdrücklich empfohlen, diese Option auf »signature« zu setzen, falls der Server und das Protokoll dies unterstützen\&. Standardmäßig »signature«\&.

source: When downloading a container or VM image, and a local copy by the specified local machine name already exists, delete it first and replace it by the newly downloaded image\&.
de: Wird ein Container- oder VM-Abbild heruntergeladen und eine lokale Kopie des angegebenen Maschinennamens existiert bereits, dann wird diese zuerst gelöscht und durch das neu heruntergeladene Abbild ersetzt\&.

source: When used with the B<export-tar> or B<export-raw> commands, specifies the compression format to use for the resulting file\&. Takes one of "uncompressed", "xz", "gzip", "bzip2"\&. By default, the format is determined automatically from the image file name passed\&.
de: Gibt bei der Verwendung mit den Befehlen B<export-tar> und B<export-raw> das für die erstellte Datei zu verwendende Kompressionsformat an\&. Akzeptiert entweder »uncompressed«, »xz«, »gzip« oder »bzip2«\&. Standardmäßig wird das Format automatisch vom übergebenen Abbilddateinamen ermittelt\&.

source: Suppresses additional informational output while running\&.
de: Unterdrückt bei der Ausführung zusätzliche Informationsausgabe\&.

source: Execute the operation remotely\&. Specify a hostname, or a username and hostname separated by "@", to connect to\&. The hostname may optionally be suffixed by a port ssh is listening on, separated by ":", and then a container name, separated by "/", which connects directly to a specific container on the specified host\&. This will use SSH to talk to the remote machine manager instance\&. Container names may be enumerated with B<machinectl -H >I<HOST>\&. Put IPv6 addresses in brackets\&.
de: Führt die Aktion aus der Ferne aus\&. Geben Sie den Rechnernamen oder einen Benutzernamen und Rechnernamen (getrennt durch »@«) an, zu dem verbunden werden soll\&. Dem Rechnernamen darf optional ein Port, auf dem SSH auf Anfragen wartet, getrennt durch »:« und dann ein Container auf dem angegebenen Host angehängt werden, womit direkt zu einem bestimmten Container auf dem angegebenen Rechner verbunden wird\&. Dies verwendet SSH, um mit der Maschinen-Verwalterinstanz auf dem Rechner in der Ferne zu kommunizieren\&. Container-Namen dürfen mit B<machinectl -H >I<RECHNER> aufgezählt werden\&. Stellen Sie IPv6-Adressen in Klammern\&.

source: Connect to B<systemd-machined.service>(8) running in a local container, to perform the specified operation within the container\&.
de: Verbindet zu dem in dem lokalen Container laufenden B<systemd-machined.service>(8), um die angegebenen Aktionen innerhalb des Containers auszuführen\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Do not print the legend, i\&.e\&. column headers and the footer with hints\&.
de: Gibt die Legende nicht aus, d\&.h\&. die Spaltenköpfe und die Fußzeile mit Hinweisen\&.

source: Do not query the user for authentication for privileged operations\&.
de: Befragt den Benutzer nicht für Authentifizierung für privilegierte Aktionen\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: MACHINE AND IMAGE NAMES
de: MASCHINEN- UND ABBILDNAMEN

source: The B<machinectl> tool operates on machines and images whose names must be chosen following strict rules\&. Machine names must be suitable for use as hostnames following a conservative subset of DNS and UNIX/Linux semantics\&. Specifically, they must consist of one or more non-empty label strings, separated by dots\&. No leading or trailing dots are allowed\&. No sequences of multiple dots are allowed\&. The label strings may only consist of alphanumeric characters as well as the dash and underscore\&. The maximum length of a machine name is 64 characters\&.
de: Das Werkzeug B<machinectl> agiert auf Maschinen und Abbildern, deren Namen strengen Regeln folgen müssen\&. Maschinennamen müssen für den Einsatz als Rechnernamen geeignet sein und daher einer konservativen Teilmenge der DNS- und UNIX/Linux-Semantik folgen\&. Insbesondere müssen sie aus einer oder mehreren, durch Punkte getrennten nicht-leeren Kennzeichnungszeichenketten bestehen\&. Es sind keine Punkte am Anfang oder Ende erlaubt\&. Es ist keine Abfolge von mehreren Punkten erlaubt\&. Die Kennzeichnungszeichenkette darf nur aus alphanumerischen Zeichen sowie dem Binde- und dem Unterstrich bestehen\&. Die maximale Länge von Maschinennamen ist 64 Zeichen\&.

source: A special machine with the name "\&.host" refers to the running host system itself\&. This is useful for execution operations or inspecting the host system as well\&. Note that B<machinectl list> will not show this special machine unless the B<--all> switch is specified\&.
de: Eine besondere Maschine mit dem Namen »\&.host« bezieht sich auf den laufenden Rechner selbst\&. Dies ist auch für die Ausführung von Aktionen oder Untersuchungen des Rechners selbst nützlich\&. Beachten Sie, dass B<machinectl list> diese besondere Maschine nur anzeigt, wenn der Schalter B<--all> angegeben ist\&.

source: Requirements on image names are less strict, however, they must be valid UTF-8, must be suitable as file names (hence not be the single or double dot, and not include a slash), and may not contain control characters\&. Since many operations search for an image by the name of a requested machine, it is recommended to name images in the same strict fashion as machines\&.
de: Anforderungen an Abbildnamen sind allerdings weniger streng\&. Sie müssen gültiges UTF-8 und als Dateinamen geeignet sein (und damit weder der einzelne noch der doppelte Punkt sein noch Schrägstriche enthalten) sowie keine Steuerzeichen enthalten\&. Da viele Aktionen nach einem Abbild über den Namen der angeforderten Maschine suchen, wird empfohlen, Abbilder auf die gleiche strenge Art wie Maschinen zu benennen\&.

source: A special image with the name "\&.host" refers to the image of the running host system\&. It hence conceptually maps to the special "\&.host" machine name described above\&. Note that B<machinectl list-images> will not show this special image either, unless B<--all> is specified\&.
de: Ein besonderes Abbild mit dem Namen »\&.host« bezieht sich auf das Abbild des laufenden Rechners\&. Er wird daher konzeptionell auf den oben beschriebenen Maschinennamen »\&.host« abgebildet\&. Beachten Sie, dass B<machinectl list-images> dieses besondere Abbild auch nur anzeigen wird, wenn B<--all> angegeben ist\&.

source: FILES AND DIRECTORIES
de: DATEIEN UND VERZEICHNISSE

source: Machine images are preferably stored in /var/lib/machines/, but are also searched for in /usr/local/lib/machines/ and /usr/lib/machines/\&. For compatibility reasons, the directory /var/lib/container/ is searched, too\&. Note that images stored below /usr/ are always considered read-only\&. It is possible to symlink machines images from other directories into /var/lib/machines/ to make them available for control with B<machinectl>\&.
de: Maschinenabbilder werden bevorzugt in /var/lib/machines/ gespeichert, aber es wird auch in /usr/local/lib/machines/ und /usr/lib/machines/ nach ihnen gesucht\&. Aus Kompatibilitätsgründen wird auch das Verzeichnis /var/lib/container/ durchsucht\&. Beachten Sie, dass unterhalb von /usr/ gespeicherte Abbilder immer als nur-lesbar betrachtet werden\&. Es ist möglich, Maschinenabbilder von anderen Verzeichnissen nach /var/lib/machines/ zu symlinken, um sie der Steuerung durch B<machinectl> zur Verfügung zu stellen\&.

source: Note that some image operations are only supported, efficient or atomic on btrfs file systems\&.
de: Beachten Sie, dass einige Abbildaktionen nur auf Btrfs-Dateisystemen unterstützt werden, effizient oder atomar sind\&.

source: Disk images are understood by B<systemd-nspawn>(1) and B<machinectl> in three formats:
de: B<systemd-nspawn>(1) und B<machinectl> verstehen Plattenabbilder in drei Formaten:

source: A simple directory tree, containing the files and directories of the container to boot\&.
de: Ein einfacher Verzeichnisbaum, der die Dateien und Verzeichnisse des zu startenden Containers enthält\&.

source: Subvolumes (on btrfs file systems), which are similar to the simple directories, described above\&. However, they have additional benefits, such as efficient cloning and quota reporting\&.
de: Teildatenträger (auf Btrfs-Dateisystemen), die ähnlich zu den oben beschriebenen einfachen Verzeichnissen sind\&. Sie verfügen allerdings über zusätzliche Vorteile, wie effizientes Klonen und Kontingentmeldungen\&.

source: "Raw" disk images, i\&.e\&. binary images of disks with a GPT or MBR partition table\&. Images of this type are regular files with the suffix "\&.raw"\&.
de: »Rohe« Plattenabbilder, d\&.h\&. Binärabbilder von Platten mit einer GPT- oder MBR-Partitionstabelle\&. Abbilder dieses Typs sind normale Dateien mit der Endung »\&.raw«\&.

source: See B<systemd-nspawn>(1) for more information on image formats, in particular its B<--directory=> and B<--image=> options\&.
de: Siehe B<systemd-nspawn>(1) für weitere Informationen über Abbildformate, insbesondere dessen Optionen B<--directory=> und B<--image=>\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&Download an Ubuntu image and open a shell in it>
de: B<Beispiel\ \&1.\ \&Ein Ubuntu-Abbild herunterladen und darin eine Shell öffnen>

source: This downloads and verifies the specified \&.tar image, and then uses B<systemd-nspawn>(1) to open a shell in it\&.
de: Dies lädt das angegebene \&.tar-Abbild herunter, verifiziert es und verwendet dann B<systemd-nspawn>(1) zum Öffnen einer Shell darin\&.

source: B<Example\ \&2.\ \&Download a Fedora image, set a root password in it, start it as a service>
de: B<Beispiel\ \&2.\ \&Ein Fedora-Abbild herunterladen, ein Passwort für root setzen, es als ein Dienst starten>

source: This downloads the specified \&.raw image with verification disabled\&. Then, a shell is opened in it and a root password is set\&. Afterwards the shell is left, and the machine started as system service\&. With the last command a login prompt into the container is requested\&.
de: Dies lädt das angegebene \&.raw-Abbild ohne Verifizierung herunter\&. Dann wird darin eine Shell geöffnet und das Passwort für root gesetzt\&. Danach wird die Shell verlassen und die Maschine als Systemdienst gestartet\&. Mit dem letzten Befehl wird eine Anmeldeshell im Container erbeten\&.

source: B<Example\ \&3.\ \&Exports a container image as tar file>
de: B<Beispiel\ \&3.\ \&Ein Container-Abbild als Tar-Datei exportieren>

source: Exports the container "fedora" as an xz-compressed tar file myfedora\&.tar\&.xz into the current directory\&.
de: Exportiert den Container »fedora« als Xz-komprimierte Tar-Datei myfedora\&.tar\&.xz in das aktuelle Verzeichnis\&.

source: B<Example\ \&4.\ \&Create a new shell session>
de: B<Beispiel\ \&4.\ \&Eine neue Shellsitzung erstellen>

source: This creates a new shell session on the local host for the user ID "lennart", in a B<su>(1)-like fashion\&.
de: Dies erstellt in einer B<su>(1)-artigen Weise eine neue Shellsitzung auf dem lokalen Rechner für die Benutzerkennung »lennart«\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The maximum log level of emitted messages (messages with a higher log level, i\&.e\&. less important ones, will be suppressed)\&. Either one of (in order of decreasing importance) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, or an integer in the range 0\&...7\&. See B<syslog>(3) for more information\&.
de: Die maximale Protokollierstufe ausgesandter Nachrichten (Nachrichten mit einer höheren Protokollierstufe, d\&.h\&. weniger wichtige, werden unterdrückt)\&. Sie muss (in absteigender Reihenfolge) entweder B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug> oder eine Ganzzahl im Bereich 0…7 sein\&. Siehe B<syslog>(3) für weitere Informationen\&.

source: A boolean\&. If true, messages written to the tty will be colored according to priority\&.
de: Ein logischer Wert\&. Falls wahr, werden auf das TTY geschriebene Nachrichten gemäß ihrer Priorität eingefärbt\&.

source: This setting is only useful when messages are written directly to the terminal, because B<journalctl>(1) and other tools that display logs will color messages based on the log level on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Nachrichten gemäß ihrer Protokollierungsstufe einfärben\&.

source: A boolean\&. If true, console log messages will be prefixed with a timestamp\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten der Konsole ein Zeitstempel vorangestellt\&.

source: This setting is only useful when messages are written directly to the terminal or a file, because B<journalctl>(1) and other tools that display logs will attach timestamps based on the entry metadata on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal oder in eine Datei geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Zeitstempel basierend auf ihren Metadaten den Nachrichten anhängen werden\&.

source: A boolean\&. If true, messages will be prefixed with a filename and line number in the source code where the message originates\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten ein Dateinamen und eine Zeilenummer in dem Quellcode, aus dem die Nachrichten stammen, vorangestellt\&.

source: Note that the log location is often attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass der Protokollierort sowieso oft als Metadaten zu den Journal-Einträgen angehängt ist\&. Die Aufnahme in den Nachrichtentext kann bei der Fehlersuche in Programmen dennoch praktisch sein\&.

source: A boolean\&. If true, messages will be prefixed with the current numerical thread ID (TID)\&.
de: Ein logischer Wert\&. Falls wahr, wird den Nachrichten die aktuelle numerische Thread-Kennung (TID) vorangestellt\&.

source: Note that the this information is attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass diese Informationen sowieso als Metadatan an Journal-Einträge angehängt wird\&. Die Aufnahme direkt im Nachrichtentext kann aber trotzdem bei der Fehlersuche in Programmen praktisch sein\&.

source: The destination for log messages\&. One of B<console> (log to the attached tty), B<console-prefixed> (log to the attached tty but with prefixes encoding the log level and "facility", see B<syslog>(3), B<kmsg> (log to the kernel circular log buffer), B<journal> (log to the journal), B<journal-or-kmsg> (log to the journal if available, and to kmsg otherwise), B<auto> (determine the appropriate log target automatically, the default), B<null> (disable log output)\&.
de: Das Ziel für Protokolliernachrichten\&. Entweder B<console> (auf das angehängte TTY protokollieren), B<console-prefixed> (auf das angehängte TTY protokollieren, aber die Protokollierstufe und »Einrichtung« voranstellen, siehe B<syslog>(3)), B<kmsg> (in den zirkulären Kernel-Protokollpuffer protokollieren), B<journal> (in das Journal protokollieren (B<journal-or-kmsg> (in das Journal protokollieren, falls verfügbar, und andernfalls nach Kmsg), B<auto> (das geeignete Protokollierziel automatisch ermitteln, die Vorgabe) oder B<null> (die Protokollierung deaktivieren)\&.

source: Pager to use when B<--no-pager> is not given; overrides I<$PAGER>\&. If neither I<$SYSTEMD_PAGER> nor I<$PAGER> are set, a set of well-known pager implementations are tried in turn, including B<less>(1) and B<more>(1), until one is found\&. If no pager implementation is discovered no pager is invoked\&. Setting this environment variable to an empty string or the value "cat" is equivalent to passing B<--no-pager>\&.
de: Zu verwendendes Textanzeigeprogramm, wenn B<--no-pager> nicht angegeben ist; setzt I<$PAGER> außer Kraft\&. Falls weder I<$SYSTEMD_PAGER> noch I<$PAGER> gesetzt sind, wird eine Reihe wohlbekannter Textanzeigeprogrammimplementierungen der Reihe nach ausprobiert, einschließlich B<less>(1) und B<more>(1), bis eines gefunden wird\&. Falls keine Textanzeigeprogrammimplementierung gefunden wird, wird keines aufgerufen\&. Setzen der Umgebungsvariablen auf die leere Zeichenkette oder den Wert »cat« ist äquivalent zur Übergabe von B<--no-pager>\&.

source: Note: if I<$SYSTEMD_PAGERSECURE> is not set, I<$SYSTEMD_PAGER> (as well as I<$PAGER>) will be silently ignored\&.
de: Beachten Sie: Falls I<$SYSTEMD_PAGERSECURE> nicht gesetzt ist, dann wird I<$SYSTEMD_PAGER> (sowie I<$PAGER>) ohne Rückmeldung ignoriert\&.
