Repository: sebras/manpages-l10n
Catalog: po/*/man1/make.1.po
Languages: de

source: 28 February 2016
de: 28. Februar 2016

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: make - GNU make utility to maintain groups of programs
de: make - GNU-Make-Dienstprogramm zur Verwaltung von Programmgruppen

source: SYNOPSIS
de: ÜBERSICHT

source: B<make> [I<OPTION>]... [I<TARGET>]...
de: B<make> [I<OPTION>] … [I<ZIEL>] …

source: DESCRIPTION
de: BESCHREIBUNG

source: The I<make> utility will determine automatically which pieces of a large program need to be recompiled, and issue the commands to recompile them. The manual describes the GNU implementation of B<make>, which was written by Richard Stallman and Roland McGrath, and is currently maintained by Paul Smith. Our examples show C programs, since they are very common, but you can use B<make> with any programming language whose compiler can be run with a shell command. In fact, B<make> is not limited to programs. You can use it to describe any task where some files must be updated automatically from others whenever the others change.
de: Das Dienstprogramm B<make> bestimmt automatisch, welche Teile eines großen Programms neu kompiliert werden müssen und gibt die Befehle zur Neukompilierung aus. Das Handbuch beschreibt die GNU-Implementierung von B<make>, die von Richard Stallman und Roland McGrath geschrieben wurde und gegenwärtig von Paul Smith betreut wird. Unsere Beispiele zeigen C-Programme, da diese sehr verbreitet sind, aber Sie können B<make> mit jeder Programmiersprache verwenden, deren Compiler mit einem Shell-Befehl aufgerufen werden kann. Tatsächlich ist B<make> nicht auf Programme beschränkt. Sie können damit jede Aufgabe beschreiben, in der einige Dateien automatisch aus anderen aktualisiert werden müssen, wann immer sich wiederum andere ändern.

source: To prepare to use B<make>, you must write a file called the I<makefile> that describes the relationships among files in your program, and the states the commands for updating each file. In a program, typically the executable file is updated from object files, which are in turn made by compiling source files.
de: Um die Verwendung von B<make> vorzubereiten, müssen Sie eine Datei namens I<makefile> (eine Make-Steuerdatei) schreiben, welche die Beziehungen zwischen den Dateien in Ihrem Programm beschreibt und die Befehle zur Aktualisierung jeder der Dateien angibt. In einem Programm wird die ausführbare Datei typischerweise aus Objektdateien aktualisiert, die im Gegenzug durch Kompilieren von Quelldateien erzeugt werden.

source: Once a suitable makefile exists, each time you change some source files, this simple shell command:
de: Sobald eine geeignetes Makefile existiert, können Sie nach jeder Änderung an den Quelldateien mit dem einfachen Shell-Befehl

source: suffices to perform all necessary recompilations. The B<make> program uses the makefile description and the last-modification times of the files to decide which of the files need to be updated. For each of those files, it issues the commands recorded in the makefile.
de: alle erforderlichen Neukompilierungen durchführen. Das Programm B<make> entscheidet anhand der Beschreibung im Makefile und der Zeitstempel der letzten Änderungen an den Dateien, welche Dateien aktualisiert werden müssen. Für jede dieser Dateien führt es die im Makefile angegebenen Befehle aus.

source: B<make> executes commands in the I<makefile> to update one or more target I<names>, where I<name> is typically a program. If no B<-f> option is present, B<make> will look for the makefiles I<GNUmakefile>, I<makefile>, and I<Makefile>, in that order.
de: B<make> führt die im I<makefile> angegebenen Befehle aus, um ein oder mehrere I<Ziele> zu aktualisieren, wobei ein I<Ziel> typischerweise ein Programm ist. Falls die Option B<-f> nicht angegeben ist, schaut B<make> nach den Dateien I<GNUmakefile>, I<makefile> und I<Makefile>, in dieser Reihenfolge.

source: Normally you should call your makefile either I<makefile> or I<Makefile>. (We recommend I<Makefile> because it appears prominently near the beginning of a directory listing, right near other important files such as I<README>.) The first name checked, I<GNUmakefile>, is not recommended for most makefiles. You should use this name if you have a makefile that is specific to GNU B<make>, and will not be understood by other versions of B<make>. If I<makefile> is '-', the standard input is read.
de: Normalerweise sollten Sie Ihr Makefile entweder I<makefile> oder I<Makefile> nennen. Wir empfehlen I<Makefile>, da es so an exponierter Stelle nahe des Anfangs einer Verzeichnisauflistung erscheint, auch nahe zu anderen wichtigen Dateien wie I<README>. Der Name I<GNUmakefile>, nach dem zuerst gesucht wird, ist für die meisten Makefiles nicht zu empfehlen. Sie sollten diesen Namen nur verwenden, wenn Ihr Makefile speziell für GNU B<make> geschrieben ist und von anderen Versionen von B<make> nicht verstanden wird. Falls »-« als I<makefile> angegeben ist, wird aus der Standardeingabe gelesen.

source: B<make> updates a target if it depends on prerequisite files that have been modified since the target was last modified, or if the target does not exist.
de: B<make> aktualisiert ein Ziel, falls dieses von anderen Dateien abhängt, die seit der letzten Aktualisierung des Ziels verändert wurden, oder falls das Ziel nicht existiert.

source: OPTIONS
de: OPTIONEN

source: These options are ignored for compatibility with other versions of B<make>.
de: Diese Optionen werden ignoriert und sind nur zwecks Kompatibilität zu anderen Versionen von B<make> vorhanden.

source: Unconditionally make all targets.
de: erstellt bedingungslos alle Ziele.

source: B<-C> I<dir>, B<--directory>=I<dir>
de: B<-C> I<Verzeichnis>, B<--directory>=I<Verzeichnis>

source: Change to directory I<dir> before reading the makefiles or doing anything else. If multiple B<-C> options are specified, each is interpreted relative to the previous one: B<-C >/ B<-C >etc is equivalent to B<-C >/etc. This is typically used with recursive invocations of B<make>.
de: wechselt in das angegebene I<Verzeichnis>, bevor die Makefiles gelesen werden oder irgendetwas anderes getan wird. Falls Sie die Option B<-C> mehrmals angeben, wird jede davon relativ zur vorherigen interpretiert: B<-C >/ B<-C >etc ist gleichbedeutend mit B<-C >/etc. Dies ist bei rekursiven Aufrufen von B<make> typisch.

source: Print debugging information in addition to normal processing. The debugging information says which files are being considered for remaking, which file-times are being compared and with what results, which files actually need to be remade, which implicit rules are considered and which are applied---everything interesting about how B<make> decides what to do.
de: gibt zusätzlich Debugging-Meldungen zu den normalen Verarbeitungsmeldungen aus. Die Debugging-Informationen sagen, welche Dateien zum Neuerstellen infrage kommen, welche Zeitstempel verglichen werden und mit welchen Ergebnissen, welche Dateien tatsächlich neu erstellt werden müssen, welche impliziten Regeln dabei berücksichtigt und welche angewendet werden – einfach alles von Interesse, wie und warum B<make> entscheidet, was zu tun ist.

source: B<--debug>I<[=FLAGS]>
de: B<--debug>I<[=SCHALTER]>

source: Print debugging information in addition to normal processing. If the I<FLAGS> are omitted, then the behavior is the same as if B<-d> was specified. I<FLAGS> may be I<a> for all debugging output (same as using B<-d>), I<b> for basic debugging, I<v> for more verbose basic debugging, I<i> for showing implicit rules, I<j> for details on invocation of commands, and I<m> for debugging while remaking makefiles. Use I<n> to disable all previous debugging flags.
de: gibt zusätzlich Debugging-Meldungen zu den normalen Verarbeitungsmeldungen aus. Falls die I<SCHALTETR> weggelassen werden, dann ist das Verhalten so, als wäre B<-d> angegeben worden. B<SCHALTER> kann entweder I<a> für alle Debug-Ausgaben (gleichbedeutend mit B<-d>), I<b> für grundlegende Debug-Ausgaben, I<v> für ausführlichere grundlegende Debug-Ausgaben, I<i> für die Anzeige der impliziten Regeln, I<j> für Details zu den Befehlsaufrufen und I<m> für Debugging während der Neuerstellung der Makefiles sein. Mit I<n> können Sie alle vorherigen Debugging-Schalter deaktivieren.

source: Give variables taken from the environment precedence over variables from makefiles.
de: bevorzugt Umgebungsvariablen gegenüber den Variablen in Makefiles.

source: B<-E> I<string>, B<--eval> I<string>
de: B<-E> I<Zeichenkette>, B<--eval> I<Zeichenkette>

source: Interpret I<string> using the B<eval> function, before parsing any makefiles.
de: interpretiert die angegebene I<Zeichenkette> mit der Funktion B<eval>, bevor irgendwelche Makefiles ausgewertet werden.

source: B<-f> I<file>, B<--file>=I<file>, B<--makefile>=I<FILE>
de: B<-f> I<Datei>, B<--file>=I<Datei>, B<--makefile>=I<DATEI>

source: Use I<file> as a makefile.
de: verwendet die angegebene I<Datei> als Makefile.

source: Ignore all errors in commands executed to remake files.
de: ignoriert alle von den Befehlen zur Neuerstellung von Dateien ausgegebenen Fehlermeldungen.

source: B<-I> I<dir>, B<--include-dir>=I<dir>
de: B<-I> I<Verzeichnis>, B<--include-dir>=I<Verzeichnis>

source: Specifies a directory I<dir> to search for included makefiles. If several B<-I> options are used to specify several directories, the directories are searched in the order specified. Unlike the arguments to other flags of B<make>, directories given with B<-I> flags may come directly after the flag: B<-I>I<dir> is allowed, as well as B<-I> I<dir>. This syntax is allowed for compatibility with the C preprocessor's B<-I> flag.
de: gibt ein I<Verzeichnis> an, in dem nach darin enthaltenen Makefiles gesucht werden soll. Falls die Option B<-I> mehrmals mit verschiedenen Verzeichnissen angegeben ist, werden die Verzeichnisse in genau der angegebenen Reihenfolge durchsucht. Im Gegensatz zu den Argumenten anderer Schalter für B<make> dürfen Sie Verzeichnisse direkt nach dem Schalter angeben: B<-I>I<Verzeichnis> ist ebenso zulässig wie B<-I> I<Verzeichnis>. Diese Syntax dient der Kompatibilität zum Schalter B<-I> des C-Präprozessors.

source: B<-j> [I<jobs>], B<--jobs>[=I<jobs>]
de: B<-j> [I<Aufträge>], B<--jobs>[=I<Aufträge>]

source: Specifies the number of I<jobs> (commands) to run simultaneously. If there is more than one B<-j> option, the last one is effective. If the B<-j> option is given without an argument, B<make> will not limit the number of jobs that can run simultaneously.
de: gibt die Anzahl der I<Aufträge> (Befehle) an, die gleichzeitig ausgeführt werden sollen. Wird die Option B<-j> mehrmals angegeben, ist die zuletzt angegebene wirksam. Wird die Option B<-j> ohne Argument angegeben, begrenzt B<make> die Anzahl der gleichzeitig ausführbaren Aufträge nicht.

source: Continue as much as possible after an error. While the target that failed, and those that depend on it, cannot be remade, the other dependencies of these targets can be processed all the same.
de: setzt nach einer Fehlermeldung so weit wie möglich fort. Während zwar das fehlgeschlagene Ziel und die davon abhängigen Ziele nicht neu erstellt werden können, ist es dennoch möglich, andere Abhängigkeiten dieser Ziele zu verarbeiten.

source: B<-l> [I<load>], B<--load-average>[=I<load>]
de: B<-l> [I<Last>], B<--load-average>[=I<Last>]

source: Specifies that no new jobs (commands) should be started if there are others jobs running and the load average is at least I<load> (a floating-point number). With no argument, removes a previous load limit.
de: gibt an, dass keine neuen Aufträge (Befehle) gestartet werden sollen, wenn bereits andere Aufträge ausgeführt werden und die gemittelte Last mindestens der angegebenen I<Last> entspricht (eine Fließkommazahl). Ohne Argument wird die vorherige Lastbegrenzung aufgehoben.

source: Use the latest mtime between symlinks and target.
de: verwendet die letzte »mtime« (Veränderungszeit) zwischen Symlinks und Zielen.

source: Print the commands that would be executed, but do not execute them (except in certain circumstances).
de: gibt die Befehle aus, die ausgeführt werden würden, aber führt sie nicht wirklich aus (außer unter bestimmten Umständen).

source: B<-o> I<file>, B<--old-file>=I<file>, B<--assume-old>=I<file>
de: B<-o> I<Datei>, B<--old-file>=I<Datei>, B<--assume-old>=I<Datei>

source: Do not remake the file I<file> even if it is older than its dependencies, and do not remake anything on account of changes in I<file>. Essentially the file is treated as very old and its rules are ignored.
de: erstellt die angegebene I<Datei> nicht neu, selbst wenn sie älter als ihre Abhängigkeiten ist, und erneuert nichts aufgrund von Änderungen in der angegebenen I<Datei>. Im Wesentlichen wird die Datei als uralt betrachtet und deren Regeln werden ignoriert.

source: B<-O>[I<type>], B<--output-sync>[=I<type>]
de: B<-O>[I<Typ>], B<--output-sync>[=I<Typ>]

source: When running multiple jobs in parallel with B<-j>, ensure the output of each job is collected together rather than interspersed with output from other jobs. If I<type> is not specified or is B<target> the output from the entire recipe for each target is grouped together. If I<type> is B<line> the output from each command line within a recipe is grouped together. If I<type> is B<recurse> output from an entire recursive make is grouped together. If I<type> is B<none> output synchronization is disabled.
de: stellt beim parallelen Ausführen mehrerer Aufträge mit B<-j> sicher, dass die Ausgabe jedes Auftrags zusammengeführt wird, statt sich mit den Ausgaben anderer Aufträge zu überschneiden. Falls kein I<Typ> angegeben wird oder B<target> ist, wird die Ausgabe des gesamten Rezepts für jedes Ziel zusammengefasst. Falls B<line> als I<Typ> angegeben ist, wird die Ausgabe jeder Befehlszeile innerhalb eines Rezepts zusammengefasst. Falls B<recurse> als I<Typ> angegeben ist, wird die Ausgabe eines gesamten Make-Aufrufs rekursiv zusammengefasst. Falls B<none> als I<Typ> angegeben ist, ist die Synchronisierung der Ausgabe deaktiviert.

source: Print the data base (rules and variable values) that results from reading the makefiles; then execute as usual or as otherwise specified. This also prints the version information given by the B<-v> switch (see below). To print the data base without trying to remake any files, use I<make -p -f/dev/null>.
de: gibt die Datenbasis (Regeln und Variablenwerte) aus, die sich aus der Auswertung der Makefiles ergibt. Dann wird wie üblich oder anderweitig angegeben fortgesetzt. Damit werden auch Versionsinformationen angezeigt, die mit dem Schalter B<-v> ausgegeben werden (siehe nachfolgend). Um die Datenbasis auszugeben, ohne zu versuchen, irgendwelche Dateien neu zu erstellen, verwenden Sie I<make -p -f/dev/null>.

source: ``Question mode''. Do not run any commands, or print anything; just return an exit status that is zero if the specified targets are already up to date, nonzero otherwise.
de: aktiviert den »Fragemodus«. Es werden keine Befehle ausgeführt oder etwas ausgegeben. Es wird lediglich ein Exit-Status ausgegeben, der 0 ist, sofern die angegebenen Ziele bereits aktuell sind, oder anderenfalls 1.

source: Eliminate use of the built-in implicit rules. Also clear out the default list of suffixes for suffix rules.
de: deaktiviert die Berücksichtigung der eingebauten impliziten Regeln. Außerdem wird die Standardliste der Suffixe für die Suffix-Regeln geleert.

source: Don't define any built-in variables.
de: definiert keine der eingebauten Variablen.

source: Silent operation; do not print the commands as they are executed.
de: aktiviert den stillen Modus, in dem die ausgeführten Befehle nicht ausgegeben werden.

source: Cancel the effect of the B<-s> option.
de: setzt die Option B<-s> außer Kraft.

source: Cancel the effect of the B<-k> option.
de: setzt die Option B<-k> außer Kraft.

source: Touch files (mark them up to date without really changing them) instead of running their commands. This is used to pretend that the commands were done, in order to fool future invocations of B<make>.
de: greift auf Dateien zu (markiert sie als aktuell, ohne sie wirklich zu verändern), anstelle deren Befehle auszuführen. Dadurch wird vorgegaukelt, dass die Befehle bereits ausgeführt wurden, um zukünftige Aufrufe von B<make> zu täuschen.

source: Information about the disposition of each target is printed (why the target is being rebuilt and what commands are run to rebuild it).
de: gibt Informationen zur Verwendung jedes Ziels aus, also warum das Ziel zur Neuerstellung vorgesehen ist und welche Befehle zur Neuerstellung ausgeführt werden.

source: Print the version of the B<make> program plus a copyright, a list of authors and a notice that there is no warranty.
de: gibt die Version von B<make> sowie einen Urheberrechtshinweis, eine Liste der Autoren und einen Hinweis zum Haftungsausschluss aus.

source: Print a message containing the working directory before and after other processing. This may be useful for tracking down errors from complicated nests of recursive B<make> commands.
de: gibt eine Meldung aus, welche das Arbeitsverzeichnis vor und nach der weiteren Verarbeitung angibt. Dies ist hilfreich, um Fehler einzugrenzen, die in komplizierten Verschachtelungen rekursiver B<make>-Aufrufe entstehen.

source: Turn off B<-w>, even if it was turned on implicitly.
de: deaktiviert B<-w> selbst dann, wenn es implizit aktiviert wurde.

source: B<-W> I<file>, B<--what-if>=I<file>, B<--new-file>=I<file>, B<--assume-new>=I<file>
de: B<-W> I<Datei>, B<--what-if>=I<Datei>, B<--new-file>=I<Datei>, B<--assume-new>=I<Datei>

source: Pretend that the target I<file> has just been modified. When used with the B<-n> flag, this shows you what would happen if you were to modify that file. Without B<-n>, it is almost the same as running a I<touch> command on the given file before running B<make>, except that the modification time is changed only in the imagination of B<make>.
de: täuscht vor, dass die angegebene Ziel-I<Datei> gerade geändert wurde. Wenn dies zusammen mit dem Schalter B<-n> verwendet wird, zeigt es Ihnen, was geschehen würde, wenn Sie die Datei verändern würden. Ohne B<-n> ist es fast das Gleiche wie die Ausführung eines I<touch>-Befehls mit der angegebenen Datei vor der Ausführung von B<make>, aber mit dem Unterschied, dass der Änderungszeitpunkt nur in der Fantasie von B<make> geändert wurde.

source: Warn when an undefined variable is referenced.
de: warnt, wenn eine nicht definierte Variable referenziert wird.

source: GNU B<make> exits with a status of zero if all makefiles were successfully parsed and no targets that were built failed. A status of one will be returned if the B<-q> flag was used and B<make> determines that a target needs to be rebuilt. A status of two will be returned if any errors were encountered.
de: GNU B<make> beendet sich mit dem Status 0, wenn alle Makefiles erfolgreich ausgewertet wurden und für keines der Ziele die Erstellung fehlgeschlagen ist. Der Status 1 wird zurückgeliefert, wenn der Schalter B<-q> angegeben wurde und B<make> ermittelt hat, dass ein Ziel neu erstellt werden muss. Der Status 2 wird zurückgeliefert, falls irgendwelche Fehler aufgetreten sind.

source: SEE ALSO
de: SIEHE AUCH

source: The full documentation for B<make> is maintained as a Texinfo manual. If the B<info> and B<make> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<make> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<make> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.

source: BUGS
de: FEHLER

source: See the chapter ``Problems and Bugs'' in I<The GNU Make Manual>.
de: Siehe das Kapitel »Problems and Bugs« in I<The GNU Make Manual>.

source: AUTHOR
de: AUTOR

source: This manual page contributed by Dennis Morse of Stanford University. Further updates contributed by Mike Frysinger. It has been reworked by Roland McGrath. Maintained by Paul Smith.
de: Diese Handbuchseite wurde von Dennis Morse von der Stanford University geschrieben. Spätere Aktualisierungen stammen von Mike Frysinger. Sie wurde von Roland McGrath überarbeitet und wird derzeit von Paul Smith betreut.

source: Copyright \(co 1992-1993, 1996-2020 Free Software Foundation, Inc. This file is part of I<GNU make>.
de: Copyright \(co 1992-1993, 1996-2020 Free Software Foundation, Inc. Diese Datei ist Teil von I<GNU make>.

source: GNU Make is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.
de: GNU Make ist freie Software; Sie können es weitergeben und/oder verändern, solange Sie sich an die Regeln der »GNU General Public License« halten, so wie sie von der Free Software Foundation festgelegt wurden; entweder in Version 3 der Lizenz oder (nach Ihrem Ermessen) in jeder neueren Version.

source: GNU Make is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
de: GNU Make wurde mit dem Ziel veröffentlicht, dass Sie es nützlich finden, jedoch OHNE JEGLICHE GARANTIE, sogar ohne eine implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN SPEZIELLEN ZWECK. Schauen Sie für weitere Informationen bitte in der »GNU General Public License« (GNU GPL) nach.

source: You should have received a copy of the GNU General Public License along with this program. If not, see I<http://www.gnu.org/licenses/>.
de: Zusammen mit diesem Programm sollten Sie außerdem eine Kopie der »GNU General Public License« erhalten haben. Wenn dem nicht so ist, siehe I<http://www.gnu.org/licenses/>.

source: Specifies the number of I<jobs> (commands) to run simultaneously. If there is more than one B<-j> option, the last one is effective. If the B<-j> option is given without an argument, B<make> will not limit the number of jobs that can run simultaneously. When B<make> invokes a B<sub-make,> all instances of make will coordinate to run the specified number of jobs at a time; see the section B<PARALLEL MAKE AND THE JOBSERVER> for details.
de: gibt die Anzahl der I<Aufträge> (Befehle) an, die gleichzeitig ausgeführt werden sollen. Wird die Option B<-j> mehrmals angegeben, ist die zuletzt angegebene wirksam. Wird die Option B<-j> ohne Argument angegeben, begrenzt B<make> die Anzahl der gleichzeitig ausführbaren Aufträge nicht. Wenn B<make> ein untergeordnetes B<make> aufruft, werden alle Instanzen von B<make> untereinander koordiniert, um die angegebene Anzahl der Aufträge gleichzeitig auszuführen. Im Abschnitt B<PARALLELES MAKE UND DER AUFTRAGSSERVER> finden Sie weitere Details.

source: Internal option B<make> uses to pass the jobserver pipe read and write file descriptor numbers to B<sub-makes;> see the section B<PARALLEL MAKE AND THE JOBSERVER> for details
de: wird von B<make> intern verwendet, um die gelesenen und geschriebenen Dateideskriptornummern an untergeordnete B<make>s zu übergeben. Im Abschnitt B<PARALLELES MAKE UND DER AUFTRAGSSERVER> finden Sie Details hierzu.
