Repository: sebras/manpages-l10n
Catalog: po/*/man1/make.1.po
Languages: de

source: Cancel the effect of the B<-k> option. This is never necessary except in a recursive B<make> where B<-k> might be inherited from the top-level B<make> via MAKEFLAGS or if you set B<-k> in MAKEFLAGS in your environment.
de: setzt die Wirkung der Option B<-k> außer Kraft. Dies ist nur bei einem rekursiven B<make> erforderlich, wobei B<-k> von einem B<make> höherer Ebene durch MAKEFLAGS geerbt werden kann, oder falls Sie B<-k> in MAKEFLAGS in Ihrer Umgebung gesetzt haben.

source: should give you access to the complete manual. Additionally, the manual is also available online at I<https://www.gnu.org/software/make/manual/html_node/index.html>
de: auf das vollständige Handbuch zugreifen. Zusätzlich ist das Handbuch online auf I<https://www.gnu.org/software/make/manual/html_node/index.html> verfügbar.

source: PARALLEL MAKE AND THE JOBSERVER
de: PARALLELES MAKE UND DER AUFTRAGSSERVER

source: Using the I<-j> option, the user can instruct B<make> to execute tasks in parallel. By specifying a numeric argument to I<-j> the user may specify an upper limit of the number of parallel tasks to be run.
de: Mit der Option I<-j> können Sie B<make> anweisen, Prozesse parallel auszuführen. Mit einem numerischen Argument für I<-j> können Sie eine Obergrenze für die Anzahl parallel auszuführender Prozesse angeben.

source: When the build environment is such that a top level B<make> invokes B<sub-makes> (for instance, a style in which each sub-directory contains its own I<Makefile> ), no individual instance of B<make> knows how many tasks are running in parallel, so keeping the number of tasks under the upper limit would be impossible without communication between all the B<make> instances running. While solutions like having the top level B<make> serve as a central controller are feasible, or using other synchronization mechanisms like shared memory or sockets can be created, the current implementation uses a simple shared pipe.
de: Wenn in einer Bauumgebung ein B<make> der obersten Ebene B<sub-makes> aufruft (zum Beispiel in einem Stil, in dem jedes Unterverzeichnis sein eigenes I<Makefile> enthält), weiß keine der individuellen Instanzen von B<make>, wie viele Prozesse parallel laufen. Daher wäre es unmöglich, ohne Kommunikation zwischen allen laufenden B<make>-Instanzen die Anzahl der Prozesse unter der Obergrenze zu halten. Zwar sind Lösungen möglich, bei denen ein B<make> der obersten Ebene als zentrale Steuerung fungiert, oder andere Synchronisationsmechanismen wie gemeinsamer Speicher oder Sockets erstellt werden können, benutzt die aktuelle Implementierung einfach eine gemeinsame Pipe.

source: This pipe is created by the top-level B<make> process, and passed on to all the B<sub-makes.> The top level B<make>processB<writes> B<N-1> one-byte tokens into the pipe (The top level B<make> is assumed to reserve one token for itself). Whenever any of the B<make> processes (including the top-level B<make> ) needs to run a new task, it reads a byte from the shared pipe. If there are no tokens left, it must wait for a token to be written back to the pipe. Once the task is completed, the B<make> process writes a token back to the pipe (and thus, if the tokens had been exhausted, unblocking the first B<make> process that was waiting to read a token). Since only B<N-1> tokens were written into the pipe, no more than B<N> tasks can be running at any given time.
de: Diese Pipe wird vom B<make>-Prozess der obersten Ebene angelegt und an alle untergeordneten B<make>s übergeben. Der B<make>-Prozess der obersten Ebene schreibt B<N-1> Ein-Byte-Tokens in die Pipe (wobei angenommen wird, dass das B<make> der obersten Ebene einen Token für sich selbst reserviert). Wann immer einer der B<make>-Prozesse (einschließlich des B<make> der obersten Ebene) eine neue Aufgabe ausführen muss, liest er ein Byte aus der gemeinsamen Pipe. Falls keine Tokens mehr übrig sind, muss er warten, bis ein Token in die Pipe zurückgeschrieben wird. Sobald die Ausführung des Prozesses abgeschlossen ist, schreibt der B<make>-Prozess einen Token in die Pipe zurück (und hebt, falls die Tokens ausgeschöpft waren, die Blockierung des ersten B<make>-Prozesses auf, der auf einen Token wartet). Da nur B<N-1> Tokens in die Pipe geschrieben wurden, können zu jeder Zeit nicht mehr als B<N> Prozesse ausgeführt werden.

source: If the job to be run is not a B<sub-make> then B<make> will close the jobserver pipe file descriptors before invoking the commands, so that the command can not interfere with the I<jobserver,> and the command does not find any unusual file descriptors.
de: Falls der auszuführende Auftrag kein untergeordnetes B<make> ist, wird B<make> die Dateideskriptoren der Auftragsserver-Pipe schließen, bevor die Befehle aufgerufen werden, so dass sich der Befehl nicht mit dem I<Auftragsserver> überschneidet und der Befehl keine ungewöhnlichen Dateideskriptoren vorfindet.

source: Copyright \(co 1992-1993, 1996-2016 Free Software Foundation, Inc. This file is part of I<GNU make>.
de: Copyright \(co 1992-1993, 1996-2016 Free Software Foundation, Inc. Diese Datei ist Teil von I<GNU make>.

source: B<--jobserver-style=>I<style>
de: B<--jobserver-style=>I<Art>

source: The style of jobserver to use. The I<style> may be one of B<fifo>, B<pipe>, or B<sem> (Windows only).
de: gibt die Art des zu verwendenden Auftragsservers an. Die I<Art> kann B<fifo>, B<pipe> oder B<sem> sein (nur unter Windows).
