Repository: sebras/manpages-l10n
Catalog: po/*/man1/mcopy.1.po
Languages: de, pl

source: 06Aug21
de: 6. August 2021
pl: 6 sierpnia 2021

source: mcopy - copy MSDOS files to/from Unix
de: mcopy - MSDOS-Dateien von und nach Unix kopieren
pl: mcopy - kopiuje pliki pomiędzy MS-DOS-em a Uniksem

source: Note\ of\ warning
de: Warnhinweis
pl: OSTRZEŻENIE

source: This manpage has been automatically generated from mtools's texinfo documentation, and may not be entirely accurate or complete. See the end of this man page for details.
de: Diese Handbuchseite wurde automatisch aus der Texinfo-Dokumentation der Mtools erstellt und kann fehlerhaft bzw. unvollständig sein. Lesen Sie die Details am Ende dieser Handbuchseite.
pl: Ta strona podręcznika ekranowego została automatycznie wygenerowana z dokumentacji texinfo pakietu mtools i może nie być kompletna i całkowicie dokładna. Szczegóły można znaleźć na końcu strony.

source: Description
de: Beschreibung
pl: opis

source: The \&CW<mcopy> command is used to copy MS-DOS files to and from Unix. It uses the following syntax:
de: Der Befehl \&CW<mcopy> wird zum Kopieren von MSDOS-Dateien von und nach Unix verwendet. Er verwendet die folgende Syntax:
pl: Polecenie \&CW<mcopy> służy do kopiowania plików MS-DOS do Uniksa i na odwrót. Używa następującej składni:

source: B<\&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<clash_option>\&CW<] >I<sourcefile>\&CW< >I<targetfile>\&CW< \&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<clash_option>\&CW<] >I<sourcefile>\&CW< [ >I<sourcefiles>\&CW<\&... ] >I<targetdirectory>\&CW< \&>\&CW<mcopy [>\&CW<-tnvm] >I<MSDOSsourcefile>\&
de: B<\&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<Kollisionsoption>\&CW<] >I<Quelldatei>\&CW< >I<Zieldatei>\&CW< \&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<Kollisionsoption>\&CW<] >I<Quelldatei>\&CW< [ >I<Quelldateien>\&CW< … ] >I<Zielverzeichnis>\&CW< \&>\&CW<mcopy [>\&CW<-tnvm] >I<MS-DOS-Quelldatei>\&
pl: B<\&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<opcja_clash>\&CW<] >I<sourcefile>\&CW< >I<plikdocelowy>\&CW< \&>\&CW<mcopy [>\&CW<-bspanvmQT] [>\&CW<-D >I<opcja_clash>\&CW<] >I<plikźródłowy>\&CW< [ >I<plikiźródłowe>\&CW<\&... ] >I<katalogdocelowy>\&CW< \&>\&CW<mcopy [>\&CW<-tnvm] >I<plikźródłowyMSDOS>\&

source: \&\&CW<Mcopy> copies the specified file to the named file, or copies multiple files to the named directory. The source and target can be either MS-DOS or Unix files.
de: \&\&CW<Mcopy> kopiert eine Datei wie angegeben auf eine andere Datei oder kopiert mehrere Dateien in ein benanntes Verzeichnis. Quelle und Ziel können entweder MS-DOS- oder Unix-Dateien sein.
pl: \&\&CW<Mcopy> kopiuje podany plik na plik o zadanej nazwie lub kopiuje wiele plików do podanego katalogu. Źródło jak i cel mogą być zarówno plikami MS-DOS-u, jak i Uniksa.

source: The use of a drive letter designation on the MS-DOS files, 'a:' for example, determines the direction of the transfer. A missing drive designation implies a Unix file whose path starts in the current directory. If a source drive letter is specified with no attached file name (e.g. \&CW<mcopy a: .>), all files are copied from that drive.
de: Die Angabe eines Laufwerksbuchstabens in den MS-DOS-Dateien, zum Beispiel »a:«, bestimmt die Richtung der Übertragung. Eine fehlendes Laufwerksangabe impliziert eine Unix-Datei, deren Pfad im aktuellen Verzeichnis beginnt. Falls für die Quelldatei ein Laufwerksbuchstabe ohne Dateiname angegeben wird (beispielsweise \&CW<mcopy a: .>), werden alle Dateien von diesem Laufwerk kopiert.
pl: Użycie litery napędu dla plików MS-DOS-u, na przykład "a:", określa kierunek translacji. Brak określenia napędu oznacza plik Uniksa, którego ścieżka rozpoczyna się w bieżącym katalogu. Jeśli podano literę napędu bez dołączenia do niej nazwy pliku (np. "\&CW<mcopy a: .>" ), to kopiowane są wszystkie pliki z tego napędu.

source: If only a single, MS-DOS source parameter is provided (e.g. "mcopy a:foo.exe"), an implied destination of the current directory (`\&CW<.>') is assumed.
de: Falls nur ein einzelner MS-DOS-Quellparameter angegeben wird (zum Beispiel »mcopy a:foo.exe«), dann wird als implizites Ziel das aktuelle Verzeichnis (»\&CW<.>«) angenommen.
pl: Jeżeli podano jeden parametr źródła MS-DOS-u (np. "mcopy a:foo.exe"), to celem jest katalog bieżący ("\&CW<.>").

source: A filename of `\&CW<->' means standard input or standard output, depending on its position on the command line.
de: Wird statt des Datenamens ein Bindestrich (\&CW<->) angegeben, bedeutet dies, dass aus der Standardeingabe gelesen oder in die Standardausgabe geschrieben wird, abhängig von dessen Position innerhalb der Befehlszeile.
pl: Podanie jako nazwy pliku "\&CW<->" oznacza standardowe wejście lub standardowe wyjście, w zależności od położenia w linii poleceń.

source: \&\&CW<Mcopy> accepts the following command line options:
de: \&\&CW<Mcopy> akzeptiert die folgenden Befehlszeilenoptionen:
pl: \&\&CW<Mcopy> przyjmuje następujące opcje linii poleceń:

source: Text file transfer. Mcopy translates incoming carriage return/line feeds to line feeds when copying from MS-DOS to Unix, and vice-versa when copying from Unix to MS-DOS.
de: überträgt Textdateien. Mcopy wandelt die Wagenrückläufe/Zeilenvorschübe in der Eingabe in Zeilenvorschübe um, wenn von MS-DOS nach Unix kopiert wird, und umgekehrt, wenn von Unix nach MS-DOS kopiert wird.
pl: Transfer plików tekstowych. Mcopy zamienia napotkane znaki powrót karetki/nowa linia (CR/LF) na znaki nowej linii (LF) podczas kopiowania z MS-DOS-u do Uniksa oraz wykonuje odwrotne zmiany podczas kopiowania plików z Uniksa do MS-DOS-u.

source: Batch mode. Optimized for huge recursive copies, but less secure if a crash happens during the copy.
de: überträgt im Stapelverarbeitungsmodus. Dieser Modus ist für große rekursive Kopien optimiert, ist aber weniger sicher, wenn während des Kopiervorgangs ein Absturz geschieht.
pl: Tryb wsadowy. Zoptymalizowany dla wielkich kopii rekurencyjnych, ale mniej bezpieczny w przypadku załamania podczas kopiowania.

source: Recursive copy. Also copies directories and their contents
de: Rekursives Kopieren, bei dem auch Verzeichnisse und deren Inhalte kopiert werden.
pl: Kopiowanie rekurencyjne. Kopiuje również podkatalogi i ich zawartość.

source: Preserves the attributes of the copied files
de: erhält die Attribute der kopierten Dateien.
pl: Zachowuje atrybuty kopiowanych plików.

source: When mcopying multiple files, quits as soon as one copy fails (for example due to lacking storage space on the target disk)
de: Beim Kopieren mehrerer Dateien mit \&CW<mcopy> wird der Vorgang beendet, sobald eine Kopie fehlschlägt (zum Beispiel wegen unzureichenden Speicherplatzes auf der Zielplatte).
pl: Przy kopiowaniu wielu plików kończy pracę natychmiast po pierwszej nieudanej kopii (na przykład z powodu braku miejsca na dysku docelowym).

source: Text (ASCII) file transfer. \&CW<ASCII> translates incoming carriage return/line feeds to line feeds.
de: überträgt (ASCII-)Textdateien. \&CW<ASCII> wandelt Wagenrückläufe/Zeilenvorschübe in der Eingabe in Zeilenvorschübe um.
pl: Transfer plików tekstowych (ASCII). \&CW<ASCII> zamienia napotkane znaki powrotu karetki/wysuw linii (CR/LF) na znaki wysuwu linii (LF)

source: Text (ASCII) file transfer with character set conversion. Differs from \&\&CW<-a> in the \&CW<ASCII> also translates incoming PC-8 characters to ISO-8859-1 equivalents as far as possible. When reading DOS files, untranslatable characters are replaced by '\&CW<#>'; when writing DOS files, untranslatable characters are replaced by '\&CW<.>'.
de: überträgt (ASCII-)Textdateien und wandelt den Zeichensatz um. Dies unterscheidet sich von \&CW<-a> in \&CW<ASCII> darin, dass auch PC-8-Zeichen in der Eingabe in deren ISO-8859-1-Äquivalente umgewandelt werden, sofern möglich. Beim Lesen von DOS-Dateien werden nicht umwandelbare Zeichen durch »\&CW<#>'« ersetzt; beim Schreiben von DOS-Dateien werden nicht umwandelbare Zeichen durch »\&CW<.>« ersetzt.
pl: Transfer plików tekstowych (ASCII) z konwersją zestawu znaków. Różni się od \&\&CW<-a>, tak że \&CW<ASCII> także przekształca przychodzące znaki PC-8 na ich odpowiedniki ISO-8859-1, jeśli tylko jest to możliwe. Podczas czytania plików DOS nieprzetłumaczalne znaki są zastępowane przez "\&CW<#>"; podczas zapisywania plików DOS nieprzetłumaczalne znaki są zastępowane przez "\&CW<.>".

source: No confirmation when overwriting Unix files. \&CW<ASCII> doesn't warn the user when overwriting an existing Unix file. If the target file already exists, and the \&CW<-n> option is not in effect, \&\&CW<mcopy> asks whether to overwrite the file or to rename the new file (see \(ifname clashes\(is) for details). In order to switch off confirmation for DOS files, use \&CW<-o>.
de: bittet nicht um Bestätigung, wenn Unix-Dateien überschrieben werden würden. \&CW<ASCII> warnt den Benutzer nicht, wenn eine vorhandene Unix-Datei überschrieben wird. Falls die Zieldatei bereits existiert und die Option \&CW<-n> nicht aktiv ist, fragt \&\&CW<mcopy>, ob die Datei überschrieben oder die neue Datei umbenannt werden soll (siehe »Namenskollisionen« für Details). Mit der Option \&CW<-o> können Sie die Bestätigung für DOS-Dateien deaktivieren.

source: Preserve the file modification time.
de: erhält die Änderungszeit der Datei.
pl: Zachowuje czas modyfikacji pliku.

source: Verbose. Displays the name of each file as it is copied.
de: aktiviert den ausführlichen Modus. Der Name jeder Datei wird angezeigt, wenn sie kopiert wird.
pl: Szczegóły. Wyświetla nazwę każdego kopiowanego pliku.

source: Bugs
de: Fehler
pl: BŁĘDY

source: Unlike MS-DOS, the '+' operator (append) from MS-DOS is not supported. However, you may use \&CW<mtype> to produce the same effect:
de: Im Gegensatz zu MS-DOS wird der Operator »+« (anhängen) nicht unterstützt. Jedoch können Sie \&CW<mtype> verwenden, um die gleiche Wirkung zu erzielen:
pl: W odróżnieniu od MS-DOSu nie jest obsługiwany operator B<+> (dołącz). Można jednak użyć B<mtype>, by osiągnąc ten sam efekt:

source: B<mtype a:file1 a:file2 a:file3 E<gt>unixfile mtype a:file1 a:file2 a:file3 | mcopy - a:msdosfile>
de: B<mtype a:Datei1 a:Datei2 a:Datei3 E<gt>Unix-Datei mtype a:Datei1 a:Datei2 a:Datei3 | mcopy - a:MS-DOS-Datei>
pl: B<mtype>I< a:plik1 a:plik2 a:plik3 >B<E<gt>>I<plikunixa> B<mtype>I< a:plik1 a:plik2 a:plik3>B< | mcopy - >I<a:plikdosu>

source: See\ Also
de: Siehe\ auch
pl: ZOBACZ TAKŻE

source: Mtools' texinfo doc
de: Texinfo-Dokumentation von Mtools
pl: Dokumentacja texinfo pakietu mtools

source: Viewing\ the\ texi\ doc
de: Texi\ Dokumentation\ anzeigen
pl: PRZEGLĄDANIE DOKUMENTACJI TEXINFO

source: This manpage has been automatically generated from mtools's texinfo documentation. However, this process is only approximative, and some items, such as crossreferences, footnotes and indices are lost in this translation process. Indeed, these items have no appropriate representation in the manpage format. Moreover, not all information has been translated into the manpage version. Thus I strongly advise you to use the original texinfo doc. See the end of this manpage for instructions how to view the texinfo doc.
de: Diese Handbuchseite wurde automatisch aus der Texinfo-Dokumentation der Mtools erstellt. Dieser Prozess funktioniert allerdings nur ungefähr und einige Einträge, wie Querverweise, Fußnoten und Indizes, gehen bei der Umwandlung verloren. Allerdings haben diese Einträge auch keine entsprechende Darstellung im Handbuchseitenformat. Desweiteren wurde nicht sämtliche Information in das Handbuchseitenformat übertragen. Daher empfehle ich Ihnen nachdrücklich, die ursprüngliche Texinfo-Dokumentation zu verwenden. Lesen Sie am Ende dieser Handbuchseite die Anweisungen, wie Sie die Texinfo-Dokumentation ansehen können.
pl: Ta strona podręcznika została utworzona automatycznie z dokumentacji texinfo pakietu mtools. Proces ten jednak jest tylko przybliżony i niektóre elementy, jak odnośniki czy indeksy, mogą być utracone. W rzeczywistości elementy te nie mają właściwych odpowiedników w formacie stron podręcznika ekranowego. Ponadto nie wszystkie informacje zostały przełożone na wersję podręcznika ekranowego. Dlatego zdecydowanie zalecamy użycie oryginalnej dokumentacji texinfo. Na końcu niniejszej strony znajdują się instrukcje, jak przeglądać dokumentację w tym formacie.

source: To generate a printable copy from the texinfo doc, run the following commands:
de: Um eine ausdruckbare Version aus der Texinfo-Dokumentation zu erzeugen, führen Sie folgende Befehle aus:
pl: Zdatną do wydrukowania postać dokumentacji texinfo można otrzymać, uruchamiając poniższe polecenia:

source: To generate a html copy, run:
de: Um eine Kopie im HTML-Format zu erzeugen, führen Sie Folgendes aus:
pl: Aby utworzyć wersję html, należy uruchomić:

source: \&A premade html can be found at \&\&CW<\(ifhttp://www.gnu.org/software/mtools/manual/mtools.html\(is>
de: \&Ein bereits erstelltes HTML befindet sich unter \&\&CW<\(ifhttp://www.gnu.org/software/mtools/manual/mtools.html\(is>
pl: Już utworzone wersje html można znaleźć na stronie \&\&CW<\(ifhttp://www.gnu.org/software/mtools/manual/mtools.html\(is>

source: To generate an info copy (browsable using emacs' info mode), run:
de: Um eine Kopie im Info-Format (im Emacs-Info-Modus verwendbar) zu erzeugen, führen Sie Folgendes aus:
pl: Aby utworzyć kopię info (możliwą do przeglądania w trybie info Emacsa), należy uruchomić:

source: The texinfo doc looks most pretty when printed or as html. Indeed, in the info version certain examples are difficult to read due to the quoting conventions used in info.
de: Diese Texinfo-Dokumentation sieht ausgedruckt oder im HTML-Format am besten aus, denn in der Info-Version sind einige Beispiele aufgrund der Zitierkonventionen von Info schwer zu lesen.
pl: Dokumentacja texinfo wygląda najlepiej wydrukowana lub w postaci html. W wersji info niektóre przykłady są naprawdę trudne w czytaniu z powodu konwencji cytowania używanych w formacie info.

source: 10Dec18
de: 10. Dezember 2018

source: No confirmation when overwriting Unix files. \&CW<ASCII> doesn't warn the user when overwriting an existing Unix file. If the target file already exists, and the \&CW<-n> option is not in effect, \&CW<mcopy> asks whether to overwrite the file or to rename the new file (\(ifname clashes\(is) for details). In order to switch off confirmation for DOS files, use \&CW<-o>.
de: bittet nicht um Bestätigung, wenn Unix-Dateien überschrieben werden würden. \&CW<ASCII> warnt den Benutzer nicht, wenn eine vorhandene Unix-Datei überschrieben wird. Falls die Zieldatei bereits existiert und die Option \&CW<-n> nicht aktiv ist, fragt \&CW<mcopy>, ob die Datei überschrieben oder die neue Datei umbenannt werden soll (siehe »Namenskollisionen« für Details). Mit der Option \&CW<-o> können Sie die Bestätigung für DOS-Dateien deaktivieren.

source: 10Jul21
de: 10. Juli 2021
pl: 10 lipca 2021

source: 23Jul21
de: 23. Juli 2021

source: 09Jan13
de: 9. Januar 2013

source: Name
pl: Nazwa

source: 28Nov20
pl: 28 listopada 2020
