Repository: sebras/manpages-l10n
Catalog: po/*/man1/mdiff.1.po
Languages: de

source: January 2022
de: Januar 2022

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: mdiff - manual page for mdiff 1.2.2
de: mdiff - Handbuchseite für mdiff 1.2.2

source: SYNOPSIS
de: ÜBERSICHT

source: B<mdiff> [I<\,OPTION\/>]... [I<\,FILE\/>]...
de: B<mdiff> [I<\,OPTION\/>] … [I<\,DATEI\/>] …

source: DESCRIPTION
de: BESCHREIBUNG

source: mdiff - Studies multiple files and searches for similar sequences, it then produces possibly detailed lists of differences and similarities.
de: B<mdiff> untersucht mehrere Dateien und sucht nach ähnlichen Sequenzen. Danach erstellt es detaillierte Listen möglicher Unterschiede und Ähnlichkeiten.

source: Operation modes:
de: Operationsmodi:

source: (ignored)
de: (ignoriert)

source: report a few statistics on stderr
de: schreibt einige Statistikmeldungen in die Standardfehlerausgabe.

source: display this help then exit
de: zeigt eine Hilfe an und beendet das Programm.

source: display program version then exit
de: zeigt die Programmversion an und beendet das Programm.

source: Formatting output:
de: Formatierung der Ausgabe:

source: produce TAB instead of initial space
de: gibt einen Tabulator anstelle eines anfänglichen Leerzeichens aus.

source: paginate output through `pr'
de: leitet die Ausgabe durch B<pr>(1).

source: B<-S>, B<--string>[=I<\,STRING\/>]
de: B<-S>, B<--string>[=I<\,ZEICHENKETTE\/>]

source: take note of another user STRING
de: bezieht eine weitere benutzerdefinierte I<ZEICHENKETTE> ein.

source: give file and line references in annotations
de: fügt in den Anmerkungen Referenzen zu Dateien und Zeilen hinzu.

source: expand tabs to spaces in the output
de: expandiert in der Ausgabe Tabulatoren zu Leerzeichen.

source: output many details about what is going on
de: gibt viele Details darüber aus, was vorgeht.

source: Word mode options:
de: Optionen für den Wortmodus:

source: inhibit output of deleted words
de: unterdrückt die Ausgabe gelöschter Wörter.

source: inhibit output of inserted words
de: unterdrückt die Ausgabe eingefügter Wörter.

source: inhibit output of common words
de: unterdrückt die Ausgabe in beiden Versionen vorhandener Wörter.

source: automatically calls a pager
de: ruft automatisch ein Textanzeigeprogramm auf.

source: variation of printer mode for "less"
de: ist eine Variante des Druckermodus für B<less>(1).

source: do not extend fields through newlines
de: erweitert keine Felder durch Zeilenumbrüche.

source: overstrike as for printers
de: »Fettschrift« wie für Drucker

source: use termcap as for terminal displays
de: verwendet B<termcap>(5) wie für Terminalanzeigen.

source: B<-O>, B<--item-regexp>=I<\,REGEXP\/>
de: B<-O>, B<--item-regexp>=I<\,REG_AUSDR\/>

source: compare items as defined by REGEXP
de: vergleicht Einträge, wie durch I<REG_AUSDR> angegeben.

source: compare words instead of lines
de: vergleicht Wörter anstelle von Zeilen.

source: With no FILE, or when FILE is -, read standard input.
de: liest ohne I<DATEI> oder wenn I<DATEI> B<-> ist, aus der Standardeingabe.

source: AUTHOR
de: AUTOR

source: Written by Franc,ois Pinard E<lt>pinard@iro.umontreal.caE<gt>.
de: Geschrieben von François Pinard E<lt>pinard@iro.umontreal.caE<gt>.

source: REPORTING BUGS
de: FEHLER MELDEN

source: Report bugs to E<lt>wdiff-bugs@gnu.orgE<gt>.
de: Melden Sie Fehler (auf Englisch) an E<lt>wdiff-bugs@gnu.orgE<gt>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
de: Dies ist freie Software, in den Quellen finden Sie die Bedingungen zur Weitergabe. Es gibt KEINE Garantie, auch nicht für die MARKTREIFE oder die TAUGLICHKEIT FÜR EINEN BESTIMMTEN ZWECK.

source: SEE ALSO
de: SIEHE AUCH

source: The full documentation for B<mdiff> is maintained as a Texinfo manual. If the B<info> and B<mdiff> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<mdiff> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info> und B<mdiff> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
