Repository: sebras/manpages-l10n
Catalog: po/*/man1/mev.1.po
Languages: es

source: February 1995
es: Febrero 1995

source: NAME
es: NOMBRE

source: mev - a program to report mouse events
es: mev - un programa para informar de los eventos del ratón

source: SYNOPSIS
es: SINOPSIS

source: B<mev> [ I<options> ]
es: B<mev> [ I<opciones> ]

source: DESCRIPTION
es: DESCRIPCIÓN

source: The `mev' program is part of the gpm package. The information below is extracted from the texinfo file, which is the preferred source of information.
es: El programa ``mev'' es parte del paquete gpm. La información de más abajo está extraída del fichero texinfo, la cual es la fuente de información preferida.

source: The mev program is modeled after xev. It prints to stdout the mouse console events it gets.
es: El programa `mev' se ha realizado tomando como modelo `xev'. Imprime en la salida estándar (stdout) de la consola los eventos que recibe, tanto del telclado como del ratón.

source: mev's default behaviour is to get anything, but command line switches can be used to set the various fields in the Gpm_Connect structure, in order to customize the program's behaviour. I'm using mev to handle mouse events to Emacs.
es: El comportamiento por defecto de `mev' es capturar cualquier cosa, pero se pueden usar las opciones de la línea de órdenes para establecer diferentes campos en la estructura `Gpm_Connect', para personalizar el comportamiento del programa. Estoy usando `mev' para manejar los eventos del ratón en emacs.

source: Command line switches for mev are the following:
es: Las opciones de la línea de órdenes para `mev' son las siguientes:

source: -C B<number>
es: -C B<número>

source: Select a virtual console to get events from. This is intended to be used for debugging.
es: Selecciona una consola virtual desde la que recibir eventos. Esto está pensado para ser usado para depuración.

source: -d B<number>
es: -d B<número>

source: Choose a default mask. By default the server gets any events not belonging to the event mask. The mask can be provided either as a decimal number, or as a symbolic string.
es: Selecciona una máscara por defecto. Por defecto el servidor recibe cualquier evento no perteneciente a la máscara de eventos. La máscara puede ser suministrada bien como un número decimal o una cadena simbólica.

source: -e B<number>
es: -e B<número>

source: Choose the event mask. By default any event is received. The mask can be provided either as a decimal number, or as a symbolic string.
es: Selecciona la máscara de eventos. Por defecto cualquier evento es recibido. La máscara puede ser suministrada bien como un número decimal o una cadena simbólica.

source: Enter emacs mode. In emacs mode events are reported as lisp forms rather than numbers. This is the format used by the t-mouse package within emacs.
es: Pasa a modo emacs. En modo emacs los eventos son informados en formato lisp en lugar de números. Este es el formato usado por el paquete t-mouse dentro de emacs.

source: Interactive. Accepts input from stdin to change connection parameters.
es: Modo interactivo. Acepta entradas desde la entrada estándar para cambiar parámetros de conexión.

source: -m B<number>
es: -m B<número>

source: Choose the minimum modifier mask. Any event with fewer modifiers will not be reported to mev. It defaults to 0. The mask must be provided either as a decimal number, or as a symbolic string.
es: Selecciona la máscara de modificadores mínimos. Cualquier evento menos modificadores de los indicados no serán informado a mev. Por defecto es 0. La máscara debe ser suministrada bien como un número decimal o una cadena simbólica.

source: -M B<number>
es: -M B<número>

source: Choose the maximum modifier mask. Any event with more modifier than specified will not be reported to mev. It defaults to \~~0, i.e. all events are received. The mask must be provided either as a decimal number, or as a symbolic string.
es: Selecciona la máscara de modificadores máximos. Cualquier evento con más modificadores que los indicados no será informado a mev. Por defecto es 0, es decir, todos los eventos serán recibidos. La máscara debe ser suministrada bien como un número decimal o una cadena simbólica.

source: Requests to draw the pointer during drags. This option is used by emacs to avoid invoking ioctl() from lisp code.
es: Solicita dibujar el puntero mientras se arrastra. Esta opción es usada por emacs para evitar invocar a ioctl() desde el código lisp.

source: When the arguments are not decimal integers, they are considered lists of alphanumeric characters, separated by a single non-alphanumeric character. I use the comma (,), but any will do.
es: Cuando los argumento no son decimales enteros, son considerados listas de caracteres alfanuméricos, separados por un único carácter no alfanumérico. Yo uso la coma ``,'', pero cualquier otro funcionará.

source: Allowed names for events are move, drag, down or press, up or release, motion (which is both move and drag), and hard.
es: Los nombres permitidos para eventos son `move', `drag', `down' o `press', `up' o `release', `motion' (el cual es `move' y `drag') y `hard'.

source: Allowed names for modifiers are shift, leftAlt, rightAlt, anyAlt (one or the other), control.
es: Los nombres permitidos para modificadores son `shift', `leftAlt', `rightAlt', `anyAlt' (uno o el otro), `control'.

source: When the -i switch is specified, mev looks at its standard input as command lines rather than events. The input lines are parsed, and the commands push and pop are recognized.
es: Cuando se especificada la opción `-i', `mev' mira a su entrada estándar como una línea de órdenes en lugar de eventos. Las líneas de entrada son analizadas, y las órdenes push y pop son reconocidas.

source: The push command, then, accepts the options -d, -e, -m and -M, with the same meaning described above. Unspecified options retain the previous value and the resulting masks are used to reopen the connection with the server. pop is used to pop the connection stack. If an empty stack is popped the program exits.
es: La orden `push', entonces, acepta las opciones `-d', `-e', `-m' y `-M', con el mismo significado descrito anteriormente. Las opciones no especificadas mantienen los valores previos y las máscaras resultante son usadas para reabrir la conexión con el servidor. `pop' es usado para desapilar de la pila la conexión. Si se intenta desapilar de una pila vacía, el programa terminará.

source: BUGS
es: ERRORES

source: AUTHOR
es: AUTOR

source: FILES
es: ARCHIVOS

source: /dev/gpmctl The socket used to connect to gpm.
es: /dev/gpmctl En enchufe (socket) usado para conectarse a gpm.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: B<gpm(8) > The mouse server B<gpm-root(1) > An handler for Control-Mouse events.
es: B<gpm(8) > El servidor del ratón B<gpm-root(1) > Un manejador de eventos para Control-Mouse.

source: The info file about `gpm', which gives more complete information and explains how to write a gpm client.
es: El fichero info sobre `gpm', el cual da una completa información y explica como escribir un cliente gpm.

source: The `mev' program is modeled after `xev'. It prints to `stdout' the mouse console events it gets.
es: El programa `mev' se ha realizado tomando como modelo `xev'. Imprime en la salida estándar (stdout) de la consola los eventos que recibe, tanto del telclado como del ratón.

source: `mev''s default behaviour is to get anything, but command line switches can be used to set the various fields in the `Gpm_Connect' structure, in order to customize the program's behaviour. I'm using `mev' to handle mouse events to Emacs.
es: El comportamiento por defecto de `mev' es capturar cualquier cosa, pero se pueden usar las opciones de la línea de órdenes para establecer diferentes campos en la estructura `Gpm_Connect', para personalizar el comportamiento del programa. Estoy usando `mev' para manejar los eventos del ratón en emacs.

source: Command line switches for `mev' are the following:
es: Las opciones de la línea de órdenes para `mev' son las siguientes:

source: -C I<number>
es: -C I<número>

source: -d I<number>
es: -d I<número>

source: -e I<number>
es: -e I<número>

source: Interactive. Accepts input from `stdin' to change connection parameters.
es: Modo interactivo. Acepta entradas desde la entrada estándar para cambiar parámetros de conexión.

source: -m I<number>
es: -m I<número>

source: Choose the minimum modifier mask. Any event with fewer modifiers will not be reported to `mev'. It defaults to `0'. The mask must be provided either as a decimal number, or as a symbolic string.
es: Selecciona la máscara de modificadores mínimos. Cualquier evento menos modificadores de los indicados no serán informado a mev. Por defecto es 0. La máscara debe ser suministrada bien como un número decimal o una cadena simbólica.

source: -M I<number>
es: -M I<número>

source: Choose the maximum modifier mask. Any event with more modifier than specified will not be reported to `mev'. It defaults to `\~~0', i.e. all events are received. The mask must be provided either as a decimal number, or as a symbolic string.
es: Selecciona la máscara de modificadores máximos. Cualquier evento con más modificadores que los indicados no será informado a mev. Por defecto es 0, es decir, todos los eventos serán recibidos. La máscara debe ser suministrada bien como un número decimal o una cadena simbólica.

source: Requests to draw the pointer during drags. This option is used by emacs to avoid invoking `ioctl()' from lisp code.
es: Solicita dibujar el puntero mientras se arrastra. Esta opción es usada por emacs para evitar invocar a ioctl() desde el código lisp.

source: When the arguments are not decimal integers, they are considered lists of alphanumeric characters, separated by a single non-alphanumeric character. I use the comma (`,'), but any will do.
es: Cuando los argumento no son decimales enteros, son considerados listas de caracteres alfanuméricos, separados por un único carácter no alfanumérico. Yo uso la coma ``,'', pero cualquier otro funcionará.

source: Allowed names for events are `move', `drag', `down' or `press', `up' or `release', `motion' (which is both `move' and `drag'), and `hard'.
es: Los nombres permitidos para eventos son `move', `drag', `down' o `press', `up' o `release', `motion' (el cual es `move' y `drag') y `hard'.

source: Allowed names for modifiers are `shift', `leftAlt', `rightAlt', `anyAlt' (one or the other), `control'.
es: Los nombres permitidos para modificadores son `shift', `leftAlt', `rightAlt', `anyAlt' (uno o el otro), `control'.

source: When the `-i' switch is specified, `mev' looks at its standard input as command lines rather than events. The input lines are parsed, and the commands `push' and `pop' are recognized.
es: Cuando se especificada la opción `-i', `mev' mira a su entrada estándar como una línea de órdenes en lugar de eventos. Las líneas de entrada son analizadas, y las órdenes push y pop son reconocidas.

source: The `push' command, then, accepts the options `-d', `-e', `-m' and `-M', with the same meaning described above. Unspecified options retain the previous value and the resulting masks are used to reopen the connection with the server. `pop' is used to pop the connection stack. If an empty stack is popped the program exits.
es: La orden 'push', entonces, acepta las opciones `-d', `-e', `-m' y `-M', con el mismo significado descrito anteriormente. Las opciones no especificadas mantienen los valores previos y las máscaras resultante son usadas para reabrir la conexión con el servidor. `pop' es usado para desapilar de la pila la conexión. Si se intenta desapilar de una pila vacía, el programa terminará.

source: B<gpm(8) > The mouse server
es: B<gpm(8) > El servidor del ratón

source: B<gpm(8) > The mouse server B<gpm-types(7) > Description of mouse types supported by gpm.
es: B<gpm(8) > El servidor del ratón B<gpm-types(7) > Un manejador de eventos para Control-Mouse.
