Repository: sebras/manpages-l10n
Catalog: po/*/man1/msgmerge.1.po
Languages: de

source: July 2020
de: Juli 2020

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: msgmerge - merge message catalog and template
de: msgmerge - Meldungskatalog und Vorlage zusammenführen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: Merges two Uniforum style .po files together. The def.po file is an existing PO file with translations which will be taken over to the newly created file as long as they still match; comments will be preserved, but extracted comments and file positions will be discarded. The ref.pot file is the last created PO file with up-to-date source references but old translations, or a PO Template file (generally created by xgettext); any translations or comments in the file will be discarded, however dot comments and file positions will be preserved. Where an exact match cannot be found, fuzzy matching is used to produce better results.
de: Führt zwei .po-Dateien im Uniforum-Stil zusammen. Die Datei I<def.po> ist eine vorhandene PO-Datei mit Übersetzungen, die in die neu erstellte Datei übernommen werden, sofern sie noch passen. Kommentare bleiben dabei erhalten, aber Quelltextkommentare und Dateipositionen werden verworfen. Die Datei I<ref.pot> ist die zuletzt erstellte PO-Datei mit aktuellen Quellreferenzen, aber alten Übersetzungen, oder eine POT-Vorlagendatei (allgemein durch B<xgettext>(1) erstellt). Jegliche Übersetzungen oder Kommentare in der Datei werden verworfen, jedoch bleiben Kommentare mit vorangestelltem Punkt sowie Dateipositionen erhalten. Wo keine exakte Übereinstimmung gefunden werden kann, wird eine unscharfe (»fuzzy«) Logik verwendet, um bessere Ergebnisse zu erzielen.

source: Mandatory arguments to long options are mandatory for short options too.
de: Die obligatorischen Argumente für Optionen sind für deren Kurz- und Langform gleich.

source: Input file location:
de: Orte der Eingabedateien:

source: translations referring to old sources
de: enthält Übersetzungen, die auf den alten Quellen basieren.

source: references to new sources
de: enthält Referenzen zu den neuen Quellen.

source: B<-D>, B<--directory>=I<\,DIRECTORY\/>
de: B<-D>, B<--directory>=I<\,VERZEICHNIS\/>

source: add DIRECTORY to list for input files search
de: fügt das angegebene VERZEICHNIS zur Liste hinzu, in der nach Eingabedateien gesucht wird.

source: B<-C>, B<--compendium>=I<\,FILE\/>
de: B<-C>, B<--compendium>=I<\,DATEI\/>

source: additional library of message translations, may be specified more than once
de: gibt eine zusätzliche Bibliothek von Meldungsübersetzungen an (Mehrfachangabe ist möglich).

source: Operation mode:
de: Betriebsmodus:

source: update def.po, do nothing if def.po already up to date
de: aktualisiert I<def.po>; lässt diese unverändert, wenn sie bereits aktuell ist.

source: Output file location:
de: Orte der Ausgabedateien:

source: B<-o>, B<--output-file>=I<\,FILE\/>
de: B<-o>, B<--output-file>=I<\,DATEI\/>

source: write output to specified file
de: schreibt die Ausgabe in die angegebene DATEI.

source: The results are written to standard output if no output file is specified or if it is -.
de: Die Ergebnisse werden in die Standardausgabe geschrieben, wenn keine Datei oder »-« angegeben ist.

source: Output file location in update mode: The result is written back to def.po.
de: Ort der Ausgabedatei im Aktualisierungsmodus: Das Ergebnis wird in die Datei I<def.po> zurückgeschrieben.

source: B<--backup>=I<\,CONTROL\/>
de: B<--backup>=I<\,WERT\/>

source: make a backup of def.po
de: erstellt eine Sicherung der Datei I<def.po>.

source: override the usual backup suffix
de: überschreibt die übliche Endung für Sicherungskopien.

source: The version control method may be selected via the B<--backup> option or through the VERSION_CONTROL environment variable. Here are the values:
de: Die Versionsverwaltungsmethode kann mit der Option B<--backup> oder über die Umgebungsvariable VERSION_CONTROL bestimmt werden. Folgende Werte werden akzeptiert:

source: never make backups (even if B<--backup> is given)
de: erstellt niemals Sicherheitskopien (selbst wenn B<--backup> angegeben wurde).

source: make numbered backups
de: erstellt nummerierte Sicherheitskopien.

source: numbered if numbered backups exist, simple otherwise
de: erstellt nummerierte (»numbered«) Sicherheitskopien, wenn solche existieren, sonst einfache (»simple«).

source: always make simple backups
de: erstellt immer einfache Sicherheitskopien.

source: The backup suffix is '~', unless set with B<--suffix> or the SIMPLE_BACKUP_SUFFIX environment variable.
de: Die Endung für Sicherungen ist »~«, außer sie wird mit B<--suffix> oder durch die Umgebungsvariable SIMPLE_BACKUP_SUFFIX bestimmt.

source: Operation modifiers:
de: Optionen:

source: apply ref.pot to each of the domains in def.po
de: wendet I<ref.po> auf jede der Domains in I<def.po> an.

source: produce output for 'msgfmt', not for a translator
de: erstellt die Ausgabe für B<msgfmt>(1), nicht für einen Übersetzer.

source: do not use fuzzy matching
de: verwendet keine unscharfe Vergleichslogik (»fuzzy«).

source: keep previous msgids of translated messages
de: behält die vorherigen »msgids« der übersetzten Meldungen bei.

source: Input file syntax:
de: Syntax der Eingabedatei:

source: input files are in Java .properties syntax
de: Eingabedateien folgen der I<.properties>-Syntax von Java.

source: input files are in NeXTstep/GNUstep .strings syntax
de: Eingabedateien folgen der I<.strings>-Syntax von NeXTstep/GNUstep.

source: Output details:
de: Details zur Ausgabe:

source: B<--lang>=I<\,CATALOGNAME\/>
de: B<--lang>=I<\,KATALOGNAME\/>

source: set 'Language' field in the header entry
de: setzt das »Language«-Feld im Kopfeintrag.

source: use colors and other text attributes always
de: verwendet immer Farben und andere Text-Attribute.

source: B<--color>=I<\,WHEN\/>
de: B<--color>=I<\,WERT\/>

source: use colors and other text attributes if WHEN. WHEN may be 'always', 'never', 'auto', or 'html'.
de: verwendet Farben und andere Text-Attribute. Der angegebene I<WERT> kann »always«, »never«, »auto« oder »html« sein.

source: B<--style>=I<\,STYLEFILE\/>
de: B<--style>=I<\,STILDATEI\/>

source: specify CSS style rule file for B<--color>
de: gibt die CSS-Datei mit Stil-Regel für B<--color> an.

source: do not use C escapes in output (default)
de: verwendet keine C-Maskier-Sequenzen in der Ausgabe (Vorgabe).

source: use C escapes in output, no extended chars
de: verwendet C-Maskier-Sequenzen in der Ausgabe, keine erweiterten Zeichen.

source: write PO file even if empty
de: erstellt die PO-Datei auch dann, wenn sie leer ist.

source: indented output style
de: stellt die Ausgabe eingerückt dar.

source: suppress '#: filename:line' lines
de: schreibt keine Zeilen mit »#: Dateiname:Zeilennummer«.

source: preserve '#: filename:line' lines (default)
de: schreibt Zeilen mit »#: Dateiname:Zeilennummer« (Vorgabe).

source: strict Uniforum output style
de: schreibt die Ausgabe strikt im Uniforum-Stil.

source: write out a Java .properties file
de: schreibt eine I<.properties>-Datei für Java.

source: write out a NeXTstep/GNUstep .strings file
de: schreibt eine I<.strings>-Datei für NeXTstep/GNUstep.

source: B<-w>, B<--width>=I<\,NUMBER\/>
de: B<-w>, B<--width>=I<\,ANZAHL\/>

source: set output page width
de: legt die Breite der Ausgabe auf die angegebene ANZAHL Spalten fest.

source: do not break long message lines, longer than the output page width, into several lines
de: bricht Zeilen in Meldungen, die länger als die Breite der Ausgabe sind, nicht auf mehrere Zeilen um.

source: generate sorted output
de: erstellt eine sortierte Ausgabe.

source: sort output by file location
de: sortiert die Ausgabe gemäß Vorkommen in Dateien.

source: Informative output:
de: Informative Ausgabe:

source: display this help and exit
de: zeigt Hilfeinformationen an und beendet das Programm.

source: output version information and exit
de: gibt Versionsinformationen aus und beendet das Programm.

source: increase verbosity level
de: erhöht die Ausführlichkeitsstufe.

source: suppress progress indicators
de: unterdrückt Fortschrittsanzeiger.

source: AUTHOR
de: AUTOR

source: Written by Peter Miller.
de: Geschrieben von Peter Miller.

source: REPORTING BUGS
de: FEHLER MELDEN

source: Report bugs in the bug tracker at E<lt>https://savannah.gnu.org/projects/gettextE<gt> or by email to E<lt>bug-gettext@gnu.orgE<gt>.
de: Melden Sie Fehler im Fehlererfassungssystem auf E<lt>https://savannah.gnu.org/projects/gettextE<gt> oder per E-Mail an E<lt>bug-gettext@gnu.orgE<gt> (jeweils auf Englisch).

source: Copyright \(co 1995-2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>
de: Copyright \(co 1995-2020 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.

source: SEE ALSO
de: SIEHE AUCH

source: The full documentation for B<msgmerge> is maintained as a Texinfo manual. If the B<info> and B<msgmerge> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<msgmerge> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<msgmerge> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.

source: February 2021
de: Februar 2021

source: March 2022
de: März 2022
