Repository: sebras/manpages-l10n
Catalog: po/*/man1/mtools.1.po
Languages: pl

source: This method permits storage of up to 1992K on a 3 1/2 HD disk.
pl: Metoda ta umożliwia przechowanie do 1992K na dyskietkach 3,5HD.

source: Mtools supports these formats only on Linux.
pl: Mtools obsługują te formaty tylko w Linuksie.

source: The 2m format was originally invented by Ciriaco Garcia de Celis. It also uses bigger sectors than usual in order to fit more data on the disk. However, it uses the standard format (18 sectors of 512 bytes each) on the first cylinder, in order to make these disks easier to handle by DOS. Indeed this method allows you to have a standard sized boot sector, which contains a description of how the rest of the disk should be read.
pl: Format 2m został pierwotnie wynaleziony przez Ciriaco Garcia de Celis. On również używa większych niż zwykle sektorów, by pomieścić więcej danych na dyskietce. Posługuje się jednak standardowym formatem (18 sektorów po 512 bajtów każdy) na pierwszym cylindrze, by ułatwić obsługę tych dyskietek w DOS-ie. Faktycznie, metoda ta pozwala na użycie sektora startowego (bootsector) o standardowym rozmiarze, zawierającego opis, jak powinna być odczytana reszta dyskietki.

source: However, the drawback of this is that the first cylinder can hold less data than the others. Unfortunately, DOS can only handle disks where each track contains the same amount of data. Thus 2m hides the fact that the first track contains less data by using a I<shadow FAT>. (Usually, DOS stores the FAT in two identical copies, for additional safety. XDF stores only one copy, but tells DOS that it stores two. Thus the space that would be taken up by the second FAT copy is saved.) This also means that you should B<never use a 2m disk to store anything else than a DOS file system>.
pl: Wadą tego rozwiązania jest to, że pierwszy cylinder może pomieścić mniej danych niż pozostałe. Niestety, DOS potrafi obsługiwać wyłącznie dyskietki o tej samej ilości danych na każdej ścieżce. A zatem 2m ukrywa fakt, iż pierwsza ścieżka zawiera mniej danych przez użycie I<shadow FAT>. (Zwykle DOS przechowuje FAT w dwu identycznych kopiach, dla dodatkowego bezpieczeństwa. XDF przechowuje tylko jedną kopię, ale mówi DOS-owi, że przechowuje dwie. W ten sposób oszczędzane jest miejsce, jakie byłoby zajęte przez drugą kopię FAT). Oznacza to również, że B<nie powinno się nigdy używać dyskietek 2m do zapisywania czegokolwiek innego niż system plików DOS>.

source: XDF is a high capacity format used by OS/2. It can hold 1840 K per disk. That's lower than the best 2m formats, but its main advantage is that it is fast: 600 milliseconds per track. That's faster than the 21 sector format, and almost as fast as the standard 18 sector format. In order to access these disks, make sure mtools has been compiled with XDF support, and set the \&CW<use_xdf> variable for the drive in the configuration file. See section Compiling mtools, and \(ifmiscellaneous variables\(is, for details on how to do this. Fast XDF access is only available for Linux kernels which are more recent than 1.1.34.
pl: XDF jest formatem dużej gęstości używanym przez OS/2. Umożliwia przechowywanie na dyskietce do 1840K. Jest to mniej niż najlepsze formaty 2m, ale jego główną zaletą jest szybkość: 600 milisekund na ścieżkę. Jest to szybciej niż dla formatu 21-sektorowego i prawie tak szybko jak dla standardowego formatu o 18 sektorach. Chcąc zapewnić dostęp do tych dyskietek, należy sprawdzić, że mtools zostały skompilowane z obsługą XDF i ustawić zmienną \&CW<use_xdf> dla napędu w pliku konfiguracyjnym. Szczegóły można znaleźć w rozdziałach B<Kompilowanie mtools> i B<Różne zmienne>. Szybki dostęp XDF osiągalny jest przy jądrze Linuksa nowszym niż 1.1.34.

source: Mtools supports this format only on Linux.
pl: Mtools obsługuje ten format tylko w Linuksie.

source: \&B<Caution / Attention distributors>: If mtools is compiled on a Linux kernel more recent than 1.3.34, it won't run on an older kernel. However, if it has been compiled on an older kernel, it still runs on a newer kernel, except that XDF access is slower. It is recommended that distribution authors only include mtools binaries compiled on kernels older than 1.3.34 until 2.0 comes out. When 2.0 will be out, mtools binaries compiled on newer kernels may (and should) be distributed. Mtools binaries compiled on kernels older than 1.3.34 won't run on any 2.1 kernel or later.
pl: \&B<Ostrzeżenie / Uwaga dystrybutorzy>: mtools skompilowane pod jądrem Linuksa nowszym niż 1.3.34 nie będzie działać przy starszym jądrze. Skompilowane jednak na starszym jądrze działa nadal na nowszym, z wyjątkiem tego, że dostęp XDF jest wolniejszy. Zaleca się, by autorzy dystrybucji dołączali binaria mtools skompilowane wyłącznie pod jądrze starszym niż 1.3.34, aż do ukazania się 2.0. Po ukazaniu się 2.0 mogą (i powinny) być rozpowszechniane binaria mtools kompilowane pod nowszymi jądrami. Binaria mtools kompilowane pod jądrami starszymi niż 1.3.24 nie będą działać przy żadnym z jąder 2.1 lub późniejszym.

source: Exit\ codes
pl: Kody zakończenia

source: All the Mtools commands return 0 on success, 1 on utter failure, or 2 on partial failure. All the Mtools commands perform a few sanity checks before going ahead, to make sure that the disk is indeed an MS-DOS disk (as opposed to, say an ext2 or MINIX disk). These checks may reject partially corrupted disks, which might otherwise still be readable. To avoid these checks, set the MTOOLS_SKIP_CHECK environmental variable or the corresponding configuration file variable (see section global variables)
pl: Wszystkie polecenia mtools zwracają 0 w przypadku powodzenia, 1 przy kompletnym niepowodzeniu lub 2 przy częściowym. Wszystkie polecenia mtools przed pracą dokonują pewnych sprawdzeń poprawności, by upewnić się, że dysk jest rzeczywiście dyskiem MS-DOS (a nie, powiedzmy, dyskiem systemu ext2 czy MINIX). Kontrole te mogą odrzucić dyski częściowo uszkodzone, które mimo to mogą być czytelne. Można uniknąć tych kontroli przez ustawienie zmiennej środowiska MTOOLS_SKIP_CHECK lub odpowiedniej zmiennej pliku konfiguracyjnego (patrz rozdział B<Zmienne globalne> w B<mtools>(5)).

source: Bugs
pl: BŁĘDY

source: An unfortunate side effect of not guessing the proper device (when multiple disk capacities are supported) is an occasional error message from the device driver. These can be safely ignored.
pl: Niefortunnym efektem ubocznym odgadywania poprawnego urządzenia (przy obsługiwaniu wielu pojemności dyskietek) jest sporadyczny komunikat o błędzie ze sterownika urządzenia. Może być on spokojnie zignorowany.

source: The fat checking code chokes on 1.72 Mb disks mformatted with pre-2.0.7 mtools. Set the environmental variable MTOOLS_FAT_COMPATIBILITY (or the corresponding configuration file variable, \(ifglobal variables\(is) to bypass the fat checking.
pl: Kod sprawdzający formatowanie zatyka się na dyskietkach 1.72M formatowanych przy użyciu mformat z mtools wersji wcześniejszych niż 2.0.7. Należy ustawić zmienną środowiska MTOOLS_FAT_COMPATIBILITY (lub odpowiednią zmienną pliku konfiguracyjnego, patrz B<Zmienne globalne> w B<mtools>(5)), by pominąć sprawdzanie fat.

source: See also
pl: Zobacz także

source: 10Dec18
pl: 10 grudnia 2018

source: Before reporting a bug, make sure that it has not yet been fixed in the Alpha patches which can be found at:
pl: Przed zgłoszeniem błędu należy sprawdzić, że nie został już poprawiony w łatkach alfa, które można znaleźć na:

source: There is an mtools mailing list at mtools @ tux.org . Please send all bug reports to this list. You may subscribe to the list by sending a message with 'subscribe mtools @ tux.org' in its body to majordomo @ tux.org . (N.B. Please remove the spaces around the "@" both times. I left them there in order to fool spambots.) Announcements of new mtools versions will also be sent to the list, in addition to the Linux announce newsgroups. The mailing list is archived at http://lists.gnu.org/pipermail/info-mtools/
pl: Pod adresem "mtools @ tux.org" jest lista dyskusyjna. Proszę przesyłać wszystkie zgłoszenia błędów na tę listę. Można zapisać się na listę wysyłając wiadomość o treści "subscribe mtools @ tux.org" do "majordomo @ tux.org". (Uwaga: proszę usunąć odstępy przed i po znaku "@". Pozostawiłem je dla oszukania spambotów). Zawiadomienia o nowych wersjach mtools, oprócz przesyłania na ogłoszeniowe grupy Linuksa, będą również wysyłane na tę listę. Archiwum listy prowadzone jest na http://lists.gnu.org/pipermail/info-mtools/.

source: Mtools supports a number of formats which allows storage of more data on disk as usual. Due to different operating system abilities, these formats are not supported on all operating systems. Mtools recognizes these formats transparently where supported.
pl: Mtools obsługują wiele sposobów formatowania, pozwalających na przechowywanie na dyskietce większej niż zwykle ilości danych. W związku z różnymi możliwościami systemów operacyjnych, formaty te nie są obsługiwane we wszystkich systemach. Mtools rozpoznają te formaty tam, gdzie są one obsługiwane.
