Repository: sebras/manpages-l10n
Catalog: po/*/man1/mtools.1.po
Languages: pl

source: Name
pl: Nazwa

source: mtools - utilities to access DOS disks in Unix.
pl: mtools - narzędzia dostępu do dysków DOS w Uniksie

source: Introduction
pl: Wstęp

source: Mtools is a collection of tools to allow Unix systems to manipulate MS-DOS files: read, write, and move around files on an MS-DOS file system (typically a floppy disk). Where reasonable, each program attempts to emulate the MS-DOS equivalent command. However, unnecessary restrictions and oddities of DOS are not emulated. For instance, it is possible to move subdirectories from one subdirectory to another.
pl: Mtools jest zbiorem narzędzi pozwalających systemom uniksowym na operowanie plikami systemu MS-DOS: odczyt, zapis i przemieszczanie plików położonych na systemie plików MS-DOS (zwykle dyskietce). Gdy jest to uzasadnione, każdy z programów usiłuje emulować odpowiednie polecenie MS-DOS. Nie są jednak emulowane zbędne ograniczenia i osobliwości DOS-u. Na przykład, możliwe jest przesuwanie podkatalogów z jednego podkatalogu do innego.

source: Mtools is sufficient to give access to MS-DOS file systems. For instance, commands such as \&CW<mdir a:> work on the \&CW<a:> floppy without any preliminary mounting or initialization (assuming the default \&\&CW<\(if/etc/mtools.conf\(is> works on your machine). With mtools, one can change floppies too without unmounting and mounting.
pl: Mtools wystarczają do zapewnienia dostępu do systemów plikowych MS-DOS. Na przykład, polecenia takie jak \&CW<mdir a:> działają na napędzie \&CW<a:> bez uprzedniego montowania (dołączania) czy inicjacji (zakładając, że na maszynie działa domyślny plik \&\&CW<\(if/etc/mtools.conf\(is>. Przy pomocy mtools można zmieniać dyskietki bez potrzeby ich dołączania i odłączania.

source: Where\ to\ get\ mtools
pl: Skąd wziąć mtools

source: Mtools can be found at the following places (and their mirrors):
pl: Mtools można znaleźć w następujących miejscach (i ich mirrorach):

source: These patches are named \&\&CW<mtools->I<version>\&CW<->I<ddmm>\&CW<.taz>, where version stands for the base version, I<dd> for the day and I<mm> for the month. Due to a lack of space, I usually leave only the most recent patch.
pl: Łaty mają nazwy \&\&CW<mtools->I<wersja>\&CW<->I<ddmm>\&CW<.taz>, gdzie wersja oznacza wersję podstawową, dd - dzień, a mm - miesiąc. Z powodu braku miejsca zwykle pozostawiam jedynie najnowszą łatę.

source: Common\ features\ of\ all\ mtools\ commands
pl: Wspólne cechy wszystkich poleceń mtools

source: Options\ and\ filenames
pl: Opcje i nazwy plików

source: MS-DOS filenames are composed of a drive letter followed by a colon, a subdirectory, and a filename. Only the filename part is mandatory, the drive letter and the subdirectory are optional. Filenames without a drive letter refer to Unix files. Subdirectory names can use either the \&'\&CW</>' or '\&CW<\e>' separator. The use of the '\&CW<\e>' separator or wildcards requires the names to be enclosed in quotes to protect them from the shell. However, wildcards in Unix filenames should not be enclosed in quotes, because here we B<want> the shell to expand them.
pl: Nazwy plików MS-DOS składają się z litery napędu, po której następuje dwukropek, podkatalog i nazwa pliku. Tylko nazwa pliku jest obowiązkowa, litera napędu i podkatalog są opcjonalne. Nazwy plików bez litery napędu odnoszą się do plików unixowych. Nazwy podkatalogów mogą używać zarówno separatora B<\e> jak i B<\e>. Użycie separatora B<\e> lub znaków uogólniających wymaga otoczenia nazw znakami cytowania (apostrofami, cudzysłowami) dla ochrony przed ich interpretacją przez powłokę. Jednakże znaki uogólniające w nazwach plików unixowych nie powinny być cytowane, gdyż B<chcemy> by powłoka je rozwinęła.

source: The regular expression "pattern matching" routines follow the Unix-style rules. For example, `\&CW<*>' matches all MS-DOS files in lieu of `\&CW<*.*>'. The archive, hidden, read-only and system attribute bits are ignored during pattern matching.
pl: Procedury "wyszukiwania wzorców" wyrażeń regularnych stosują się do reguł uniksowych. Na przykład, B<*> oznacza wszystkie pliki DOSowe (zamiast B<*.*>). Bity określające atrybuty pliku (archiwalny, ukryty, tylko-do-odczytu, systemowy) podczas wyszukiwania wzorca są ignorowane.

source: All options use the \&CW<-> (minus) as their first character, not \&\&CW</> as you'd expect in MS-DOS.
pl: Wszystkie opcje używają znaku B<-> (minus) jako pierwszego znaku, nie zaś B</> (ukośnika), jak mógłbyś się spodziewać w DOSie.

source: Most mtools commands allow multiple filename parameters, which doesn't follow MS-DOS conventions, but which is more user-friendly.
pl: Większość poleceń mtools pozwala na użycie wielu nazw plików jako parametrów, co nie jest zgodne z konwencjami DOSu, ale jest przyjaźniejsze dla użytkownika.

source: Most mtools commands allow options that instruct them how to handle file name clashes. See section name clashes, for more details on these. All commands accept the \&CW<-V> flags which prints the version, and most accept the \&CW<-v> flag, which switches on verbose mode. In verbose mode, these commands print out the name of the MS-DOS files upon which they act, unless stated otherwise. See section Commands, for a description of the options which are specific to each command.
pl: Większość poleceń mtools posiada opcje informujące je, jak obsługiwać kolizje nazw plików. Więcej szczegółów znajdziesz w sekcji B<Kolizje nazw>. Wszystkie polecenia akceptują opcję B<-V> wyświetlającą wersję, a większość również opcję B<-v> przełączającą tryb wyświetlania szczegółów (verbose). Patrz sekcja B<Polecenia>, gdzie umieszczono szczegółowy opis opcji charakterystycznych dla poszczególnych poleceń.

source: Drive\ letters
pl: Litery napędów

source: The meaning of the drive letters depends on the target architectures. However, on most target architectures, drive A is the first floppy drive, drive B is the second floppy drive (if available), drive J is a Jaz drive (if available), and drive Z is a Zip drive (if available). On those systems where the device name is derived from the SCSI id, the Jaz drive is assumed to be at SCSI target 4, and the Zip at SCSI target 5 (factory default settings). On Linux, both drives are assumed to be the second drive on the SCSI bus (/dev/sdb). The default settings can be changes using a configuration file (see section Configuration).
pl: Znaczenie liter napędów zależy od konfiguracji sprzętowej. Przy większości konfiguracji jednak, napęd A jest pierwszym napędem dyskietek, napęd B drugim napędem dyskietek (jeśli jest dostępny), napęd J jest napędem Jaz (jeśli dostępny), zaś napęd Z - napędem typu Zip (jeśli dostępny). W systemach, gdzie nazwa urządzenia pochodzi od identyfikatora SCSI, napęd Jaz przyjmowany jest za 4 obiekt SCSI, a Zip za SCSI 5 (domyślne ustawienia fabryczne). W Linuksie, w przypadku obu tych napędów, przyjmuje się, że jest to drugi napęd szyny SCSI (/dev/sdb). Ustawienia domyślne mogą być zmienione przez zmianę pliku konfiguracyjnego (patrz opis konfiguracji w B<mtools>(5)).

source: The drive letter : (colon) has a special meaning. It is used to access image files which are directly specified on the command line using the \&\&CW<-i> options.
pl: Litera dysku : (dwukropek) ma specjalne znaczenia. Jest używana do uzyskania dostępu do plików, które są wprost podane w linii poleceń za pomocą opcji \&\&CW<-i>.

source: Example:
pl: Przykład:

source: This copies \&CW<file1> and \&CW<file2> from the image file (\&CW<my-image-file.bin>) to the \&CW</tmp> directory.
pl: Kopiuje to \&CW<file1> i \&CW<file2> z pliku obrazu (\&CW<my-image-file.bin>) do katalogu \&CW</tmp>.

source: You can also supply an offset within the image file by including \&\&CW<@@>I<offset> into the file name.
pl: Można także podać offset w pliku obrazu przez dodanie do nazwy pliku \&CW<@@>I<offset>.

source: This looks for the image at the offset of 1M in the file, rather than at its beginning.
pl: Powyższe zaczyna szukać obrazu w pliku od offsetu 1M zamiast od początku pliku.

source: Current\ working\ directory
pl: Bieżący katalog roboczy

source: The \&CW<mcd> command (\(ifmcd\(is) is used to establish the device and the current working directory (relative to the MS-DOS file system), otherwise the default is assumed to be \&CW<A:/>. However, unlike MS-DOS, there is only one working directory for all drives, and not one per drive.
pl: Polecenie \&CW<mcd> jest używane do ustawienia urządzenia i bieżącego katalogu (odnoszącego się do systemu plikowego MS-DOS). Jeśli nie zostanie użyte to domyślnym katalogiem jest \&CW<A:/>. Jednak w przeciwieństwie do MS-DOS-u, istnieje tylko jeden katalog roboczy dla wszystkich napędów, nie zaś po jednym na napęd.

source: VFAT-style\ long\ file\ names
pl: Długie nazwy plików VFAT

source: This version of mtools supports VFAT style long filenames. If a Unix filename is too long to fit in a short DOS name, it is stored as a VFAT long name, and a companion short name is generated. This short name is what you see when you examine the disk with a pre-7.0 version of DOS. The following table shows some examples of short names:
pl: Niniejsza wersja mtools obsługuje długie nazwy plików stosowane w VFAT. Jeśli unixowa nazwa pliku jest zbyt długa, by zmieścić się w krótkiej nazwie DOSu, zachowywana jest jako długa nazwa VFAT i tworzona jest towarzysząca jej krótka nazwa. Tę krótką nazwę widzisz sprawdzając dysk DOSem w wersji wcześniejszej niż 7.0. Poniższe zestawienie pokazuje kilka przykładów krótkich nazw:

source: B<Long name MS-DOS name Reason for the change --------- ---------- --------------------- thisisatest THISIS~1 filename too long alain.knaff ALAIN~1.KNA extension too long prn.txt PRN~1.TXT PRN is a device name \&\&.abc ABC~1 null filename hot+cold HOT_CO~1 illegal character>
pl: B< Długa nazwa Nazwa MS_DOS Powód zmiany nazwy ----------- ------------ ----------------------- ToJestTest TOJEST~1 zbyt długa nazwa pliku alain.knaff ALAIN~1.KNA za długie rozszerzenie prn.txt PRN~1.TXT PRN jest nazwą urządzenia .abc ABC~1 pusta nazwa pliku hot+cold HOT_CO~1 niedozwolony znak>

source: As you see, the following transformations happen to derive a short name:
pl: Jak widać, w celu uzyskania krótkiej nazwy zastosowano następujące przekształcenia:

source: Illegal characters are replaced by underscores. The illegal characters are \&CW<;+=[]',\e"*\e\eE<lt>E<gt>/?:|>.
pl: Niedozwolone znaki są zastąpione podkreśleniem. Znakami zabronionymi są: ;+=[]',\e"*\eE<lt>E<gt>/?:|.

source: Extra dots, which cannot be interpreted as a main name/extension separator are removed
pl: Usunięte są dodatkowe kropki, które nie mogą być zinterpretowane jako główny separator nazwy/rozszerzenia.

source: A \&CW<~>I<n> number is generated,
pl: Tworzony jest licznik dla przyrostka B<~>I<n>,

source: The name is shortened so as to fit in the 8+3 limitation
pl: Nazwa skracana jest tak, by spełnić ograniczenie 8+3.

source: The initial Unix-style file name (whether long or short) is also called the I<primary> name, and the derived short name is also called the \&I<secondary> name.
pl: Początkowa, uniksowa nazwa pliku (długa lub krótka) zwana jest również nazwą I<pierwotną> lub I<główną> (primary), zaś pochodząca od niej nazwa krótka zwana jest I<wtórną> lub I<dodatkową> (secondary).

source: Example:
pl: Przykład:

source: \& Mtools creates a VFAT entry for Reallylongname, and uses REALLYLO as a short name. Reallylongname is the primary name, and REALLYLO is the secondary name.
pl: Mtools utworzą wpis w VFAT dla `DlugaNazwa' i użyją `DLUGANAZ' jako nazwy krótkiej. `DlugaNazwa' jest tutaj nazwą główną, zaś `DLUGANAZ' nazwą dodatkową.

source: \& Motd fits into the DOS filename limits. Mtools doesn't need to derivate another name. Motd is the primary name, and there is no secondary name.
pl: `motd' spełnia ograniczenia stawiane nazwom pliku DOS. Mtools nie musi tworzyć z niej innej nazwy. Nazwą pierwotną jest `motd', a nie ma nazwy wtórnej.

source: In a nutshell: The primary name is the long name, if one exists, or the short name if there is no long name.
pl: W skrócie: nazwą główną jest długa nazwa, jeśli taka istnieje, lub krótka nazwa, jeśli nie ma długiej nazwy.

source: Although VFAT is much more flexible than FAT, there are still names that are not acceptable, even in VFAT. There are still some illegal characters left (\&CW<\e"*\e\eE<lt>E<gt>/?:|>), and device names are still reserved.
pl: Mimo, iż VFAT jest dużo elastyczniejszy niż FAT, nawet w nim nadal istnieją niedopuszczalne nazwy plików. Pozostały jeszcze niektóre niedozwolone znaki (\e"*\eE<lt>E<gt>/?:|), zaś nazwy urządzeń w dalszym ciągu są zarezerwowane.

source: B<Unix name Long name Reason for the change --------- ---------- --------------------- prn prn-1 PRN is a device name ab:c ab_c-1 illegal character>
pl: B<Nazwa uniksowa Długa nazwa Powód zmiany ------------- ----------- ------------------------- prn prn-1 PRN jest nazwą urządzenia ab:c ab_c-1 niedozwolony znak>

source: As you see, the following transformations happen if a long name is illegal:
pl: Jak widać, w przypadku niedozwolonej długiej nazwy, wykonywane są następujące przekształcenia:

source: Illegal characters are replaces by underscores,
pl: Niedozwolone znaki zastępowane są podkreśleniami,

source: A \&CW<->I<n> number is generated,
pl: Tworzony jest licznik dla przyrostka B<~>I<n>,

source: Name\ clashes
pl: Kolizje nazw

source: When writing a file to disk, its long name or short name may collide with an already existing file or directory. This may happen for all commands which create new directory entries, such as \&CW<mcopy>, \&\&CW<mmd>, \&CW<mren>, \&CW<mmove>. When a name clash happens, mtools asks you what it should do. It offers several choices:
pl: Podczas zapisu pliku na dysk, jego długa lub krótka nazwa może kolidować z nazwą istniejącego pliku lub katalogu. Może się to zdarzyć dla każdego z poleceń tworzących nowy katalog lub wpis w katalogu, takiemu jak \&CW<mcopy>, \&\&CW<mmd>, \&CW<mren>, \&CW<mmove>. W przypadku kolizji nazw polecenia mtools pytają o sposób postępowania. Oferują kilka możliwości:

source: Overwrites the existing file. It is not possible to overwrite a directory with a file.
pl: Nadpisuje istniejący plik. Nie jest możliwe nadpisanie katalogu plikiem.

source: Renames the newly created file. Mtools prompts for the new filename
pl: Zmienia nazwę nowo tworzonego pliku. Mtools pytają o nową nazwę pliku.

source: Renames the newly created file. Mtools chooses a name by itself, without prompting
pl: Zmienia nazwę nowo tworzonego pliku. Mtools wybierają same nazwę, bez pytania.

source: Gives up on this file, and moves on to the next (if any)
pl: Pomiń ten plik, zajmij się następnym (jeśli jest).

source: To chose one of these actions, type its first letter at the prompt. If you use a lower case letter, the action only applies for this file only, if you use an upper case letter, the action applies to all files, and you won't be prompted again.
pl: By wybrać jedną z powyższych akcji, po zachęcie ze strony polecenia, wpisz jej pierwszą literę. Jeśli użyjesz małej litery, to akcja będzie się odnosić wyłącznie do tego pliku; użycie dużej litery spowoduje zastosowanie danej akcji do wszystkich plików bez dalszych pytań.

source: You may also chose actions (for all files) on the command line, when invoking mtools:
pl: Można również wybrać akcje (dla wszystkich plików) w linii poleceń, przy wywołaniu mtools:

source: Overwrites primary names by default.
pl: Domyślnie nadpisuje nazwy pierwotne.

source: Overwrites secondary names by default.
pl: Domyślnie nadpisuje nazwy wtórne.

source: Renames primary name by default.
pl: Domyślnie zmienia nazwę pierwotną.

source: Renames secondary name by default.
pl: Domyślnie zmienia nazwę wtórną.

source: Autorenames primary name by default.
pl: Domyślnie automatycznie zmienia nazwę pierwotną.

source: Autorenames secondary name by default.
pl: Domyślnie automatycznie zmienia nazwę wtórną.

source: Skip primary name by default.
pl: Domyślnie przeskocz nazwę pierwotną.

source: Skip secondary name by default.
pl: Domyślnie przeskocz nazwę wtórną.

source: Ask user what to do with primary name.
pl: Pytaj użytkownika, co zrobić z nazwą pierwotną.

source: Ask user what to do with secondary name.
pl: Pytaj użytkownika, co zrobić z nazwą wtórną.

source: Note that for command line switches lower/upper differentiates between primary/secondary name whereas for interactive choices, lower/upper differentiates between just-this-time/always.
pl: Zauważ, że w linii poleceń przełączniki małe/duże odróżniają polecenia dla nazwy pierwotnej/wtórnej, podczas gdy przy wyborze interakcyjnym małe/duże różnicują zakres: tym-razem/zawsze.

source: The primary name is the name as displayed in Windows 95 or Windows NT: i.e. the long name if it exists, and the short name otherwise. The secondary name is the "hidden" name, i.e. the short name if a long name exists.
pl: Nazwa pierwotna jest nazwą wyświetlaną w Windows 95 lub Windows NT, tj. nazwą długą, jeśli takowa istnieje, w przeciwnym razie krótką. Nazwa wtórna jest nazwą "ukrytą", tj. nazwą krótką jeśli istnieje długa.

source: By default, the user is prompted if the primary name clashes, and the secondary name is autorenamed.
pl: Przy domyślnym sposobie działania mtools użytkownik jest proszony o reakcję w przypadku kolizji nazw pierwotnych, zaś nazwy wtórne zmieniane są automatycznie.

source: If a name clash occurs in a Unix directory, mtools only asks whether to overwrite the file, or to skip it.
pl: Jeśli kolizja nazw zdarzy się w katalogu Unixa, mtools pytają tylko czy nadpisać plik, czy go pominąć.

source: Case\ sensitivity\ of\ the\ VFAT\ file\ system
pl: Rozróżnianie dużych i małych liter w systemie VFAT

source: The VFAT file system is able to remember the case of the filenames. However, filenames which differ only in case are not allowed to coexist in the same directory. For example if you store a file called LongFileName on a VFAT file system, mdir shows this file as LongFileName, and not as Longfilename. However, if you then try to add LongFilename to the same directory, it is refused, because case is ignored for clash checks.
pl: System plików VFAT potrafi zapamiętać wielkość znaków (małe/duże litery) w nazwach plików. W tym samym katalogu nie mogą jednak istnieć pliki o nazwach różniących się jedynie wielkością liter. Jeśli na przykład zapisano plik o nazwie DlugaNazwaPliku w systemie plikowym VFAT, mdir pokaże go jako DlugaNazwaPliku, a nie jako DlugaNazwapliku. Jednak polecenie odmówi dodania pliku DlugaNazwapliku do tego samego katalogu, gdyż wielkość liter jest ignorowana przy sprawdzaniu kolizji.

source: The VFAT file system allows you to store the case of a filename in the attribute byte, if all letters of the filename are the same case, and if all letters of the extension are the same case too. Mtools uses this information when displaying the files, and also to generate the Unix filename when mcopying to a Unix directory. This may have unexpected results when applied to files written using an pre-7.0 version of DOS: Indeed, the old style filenames map to all upper case. This is different from the behavior of the old version of mtools which used to generate lower case Unix filenames.
pl: System VFAT umożliwia przechowywanie wielkości liter nazwy pliku w bajcie atrybutu, jeśli wszystkie litery tej nazwy są duże (bądź małe) oraz wszystkie litery rozszerzenia też są duże (lub odpowiednio, małe). Mtools używają tej informacji do wyświetlania nazw plików oraz tworzenia nazw uniksowych przy kopiowaniu (mcopy) do katalogu Unixa. Może to dawać nieoczekiwane efekty w odniesieniu do plików zapisanych przy użyciu DOS w wersji wcześniejszej niż 7.0: nazwy takich plików będą w całości zamienione na duże litery. Zachowanie to różni się od poprzedniej wersji mtools, która tworzyła nazwy plików uniksowych złożone z małych liter.

source: high\ capacity\ formats
pl: Formatowanie o dużej gęstości

source: In order to format these disks, you need to use an operating system specific tool. For Linux, suitable floppy tools can be found in the \&\&CW<fdutils> package at the following locations~:
pl: W celu sformatowania takich dyskietek powinieneś użyć narzędzia odpowiedniego do systemu operacyjnego. Dla Linuksa, odpowiednie narzędzia obsługi dyskietek można znaleźć w pakiecie I<fdutils> w następujących miejscach:

source: See the manual pages included in that package for further detail: Use \&\&CW<superformat> to format all formats except XDF, and use \&\&CW<xdfcopy> to format XDF.
pl: Dalszych szczegółów szukaj w dokumentacji dołączonej do tego pakietu. Należy użyć \&CW<superformat>, by sformatować dyskietkę w dowolnym z formatów oprócz XDF, oraz \&CW<xdfcopy> do formatowania XDF.

source: \ \ More\ sectors
pl: Więcej sektorów

source: The oldest method of fitting more data on a disk is to use more sectors and more cylinders. Although the standard format uses 80 cylinders and 18 sectors (on a 3 1/2 high density disk), it is possible to use up to 83 cylinders (on most drives) and up to 21 sectors. This method allows to store up to 1743K on a 3 1/2 HD disk. However, 21 sector disks are twice as slow as the standard 18 sector disks because the sectors are packed so close together that we need to interleave them. This problem doesn't exist for 20 sector formats.
pl: Najstarszą metodą umieszczenia większej ilości danych na dyskietce jest użycie większej liczy sektorów i cylindrów. Mimo, że standardowy format używa 80 cylindrów i 18 sektorów (na 3,5" dyskietkach dużej gęstości), to możliwe jest użycie do 83 cylindrów (na większości napędów) i do 21 sektorów. Metoda ta pozwala na zapisanie do 1743K na dyskietce 3,5"HD. Dyskietki o 21 sektorach są jednak dwukrotnie wolniejsze od standardowych dyskietek o 18 sektorach, gdyż sektory są upakowane tak blisko siebie, że zachodzi potrzeba ich przeplotu. Problem ten nie istnieje przy formatach o 20 sektorach.

source: These formats are supported by numerous DOS shareware utilities such as \&\&CW<fdformat> and \&CW<vgacopy>. In his infinite hubris, Bill Gate$ believed that he invented this, and called it \&CW<\(ifDMF disks\(is>, or \&\&CW<\(ifWindows formatted disks\(is>. But in reality, it has already existed years before! Mtools supports these formats on Linux, on SunOS and on the DELL Unix PC.
pl: Formaty te są obsługiwane przez liczne shareware'owe DOSowe programy narzędziowe takie jak \&CW<fdformat> i \&CW<vgacopy>. W swej nieskończonej arogancji Bill Gate$ wierzył, że to on to wynalazł i nazwał je "\&CW<dyskami DMF>" lub "\&CW<Windows formatted disks>". W rzeczywistości, rozwiązanie to istniało już od lat! Mtools obsługują te formaty w Linuksie, SunOS oraz DELL Unix PC.

source: \ \ Bigger\ sectors
pl: Większe sektory

source: By using bigger sectors it is possible to go beyond the capacity which can be obtained by the standard 512-byte sectors. This is because of the sector header. The sector header has the same size, regardless of how many data bytes are in the sector. Thus, we save some space by using \&I<fewer>, but bigger sectors. For example, 1 sector of 4K only takes up header space once, whereas 8 sectors of 512 bytes have also 8 headers, for the same amount of useful data.
pl: Użycie większych sektorów umożliwia przekroczenie pojemności możliwej do uzyskania przy standardowych sektorach 512-bajtowych. Powodem jest nagłówek sektora. Nagłówek sektora ma taki sam rozmiar, niezależnie od liczby bajtów danych w sektorze. Możemy zatem zaoszczędzić nieco miejsca używając I<mniejszej liczby> większych sektorów. Na przykład, 1 sektor 4-kilobajtowy zabiera tylko jedno miejsce na nagłówek, podczas gdy 8 sektorów po 512 bajtów ma 8 nagłówków, przy tej samej ilości danych użytkowych.
