Repository: sebras/manpages-l10n
Catalog: po/*/man1/mv.1.po
Languages: pt_br

source: April 2022
pt_br: Abril de 2022

source: User Commands
pt_br: Comandos de usuário

source: NAME
pt_br: NOME

source: mv - move (rename) files
pt_br: mv - movimenta (renomeia) os arquivos

source: SYNOPSIS
pt_br: SINOPSE

source: B<mv> [I<\,OPTION\/>]... [I<\,-T\/>] I<\,SOURCE DEST\/>
pt_br: B<mv> [I<\,OPÇÃO\/>]... [I<\,-T\/>] I<\,ORIGEM DESTINO\/>

source: B<mv> [I<\,OPTION\/>]... I<\,SOURCE\/>... I<\,DIRECTORY\/>
pt_br: B<mv> [I<\,OPÇÃO\/>]... I<\,ORIGEM\/>... I<\,DIRETÓRIO\/>

source: B<mv> [I<\,OPTION\/>]... I<\,-t DIRECTORY SOURCE\/>...
pt_br: B<mv> [I<\,OPÇÃO\/>]... I<\,-t DIRETÓRIO ORIGEM\/>...

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: Rename SOURCE to DEST, or move SOURCE(s) to DIRECTORY.
pt_br: Renomeia ORIGEM para DESTINO ou move ORIGEM(ns) para DIRETÓRIO.

source: Mandatory arguments to long options are mandatory for short options too.
pt_br: Argumentos obrigatórios para opções longas também o são para opções curtas.

source: B<--backup>[=I<\,CONTROL\/>]
pt_br: B<--backup>[=I<\,CONTROLE\/>]

source: make a backup of each existing destination file
pt_br: faz uma cópia de segurança de cada arquivo de destino já existente

source: like B<--backup> but does not accept an argument
pt_br: como B<--backup>, mas não aceita argumentos

source: do not prompt before overwriting
pt_br: não pergunta antes de sobrescrever

source: prompt before overwrite
pt_br: pergunta antes de sobrescrever

source: do not overwrite an existing file
pt_br: não sobrescreve um arquivo existente

source: If you specify more than one of B<-i>, B<-f>, B<-n>, only the final one takes effect.
pt_br: Se você especificar mais que um dentre B<-i>, B<-f> ou B<-n>, apenas o último terá efeito.

source: remove any trailing slashes from each SOURCE argument
pt_br: remove quaisquer barras ao final de cada argumento ORIGEM

source: B<-S>, B<--suffix>=I<\,SUFFIX\/>
pt_br: B<-S>, B<--suffix>=I<\,SUFIXO\/>

source: override the usual backup suffix
pt_br: sobrescreve o sufixo comum de cópia de segurança

source: B<-t>, B<--target-directory>=I<\,DIRECTORY\/>
pt_br: B<-t>, B<--target-directory>=I<\,DIRETÓRIO\/>

source: move all SOURCE arguments into DIRECTORY
pt_br: move todos os argumentos ORIGEM para o DIRETÓRIO

source: treat DEST as a normal file
pt_br: trata DESTINO como um arquivo normal

source: move only when the SOURCE file is newer than the destination file or when the destination file is missing
pt_br: move somente quando o arquivo de ORIGEM for mais novo do que o de destino ou quando o arquivo de destino não existe

source: explain what is being done
pt_br: explica o que está sendo feito

source: set SELinux security context of destination file to default type
pt_br: define o contexto de segurança SELinux do arquivo de destino para o tipo padrão

source: display this help and exit
pt_br: mostra esta ajuda e sai

source: output version information and exit
pt_br: informa a versão e sai

source: The backup suffix is '~', unless set with B<--suffix> or SIMPLE_BACKUP_SUFFIX. The version control method may be selected via the B<--backup> option or through the VERSION_CONTROL environment variable. Here are the values:
pt_br: O sufixo de cópia de segurança é "~", a não ser que esteja definido B<--suffix> ou SIMPLE_BACKUP_SUFFIX. O método de controle de versão pode ser definido com B<--backup> ou a variável de ambiente VERSION_CONTROL. Os valores possíveis são:

source: never make backups (even if B<--backup> is given)
pt_br: nunca faz cópias de segurança (mesmo se B<--backup> for especificado)

source: make numbered backups
pt_br: faz cópias de segurança numeradas

source: numbered if numbered backups exist, simple otherwise
pt_br: numeradas se já existirem cópias de segurança numeradas, simples em caso contrário

source: always make simple backups
pt_br: sempre faz cópias de segurança simples

source: AUTHOR
pt_br: AUTOR

source: Written by Mike Parker, David MacKenzie, and Jim Meyering.
pt_br: Escrito por Mike Parker, David MacKenzie e Jim Meyering.

source: REPORTING BUGS
pt_br: RELATANDO PROBLEMAS

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
pt_br: Página de ajuda do GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
pt_br: Relate erros de tradução para E<lt>https://translationproject.org/team/pt_BR.htmlE<gt>.

source: COPYRIGHT
pt_br: DIREITOS AUTORAIS

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2022 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
pt_br: Este é um software livre: você é livre para alterá-lo e redistribuí-lo. NÃO HÁ QUALQUER GARANTIA, na máxima extensão permitida em lei.

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/mvE<gt>
pt_br: Documentação completa: E<lt>https://www.gnu.org/software/coreutils/mvE<gt>

source: or available locally via: info \(aq(coreutils) mv invocation\(aq
pt_br: ou disponível localmente via: info \(aq(coreutils) mv invocation\(aq

source: September 2020
pt_br: Setembro de 2020

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2020 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
pt_br: Outubro de 2021

source: March 2022
pt_br: Março de 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pt_br: Copyright \(co 2021 Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2021
pt_br: Setembro de 2021
