Repository: sebras/manpages-l10n
Catalog: po/*/man1/nsenter.1.po
Languages: nl

source: Enter the user namespace. If no file is specified, enter the user namespace of the target process. If I<file> is specified, enter the user namespace specified by I<file>. See also the B<--setuid> and B<--setgid> options.
nl: Gebruik de gebruiker naamruimte. Als geen bestand werd opgegeven, gebruik dan de gebruiker naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de gebruiker naamruimte zoals opgegeven door I<bestand>.

source: Enter the cgroup namespace. If no file is specified, enter the cgroup namespace of the target process. If I<file> is specified, enter the cgroup namespace specified by I<file>.
nl: Gebruik de cgroup naamruimte. Als geen bestand werd opgegeven, gebruik dan de cgroup naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de cgroup naamruimte zoals opgegeven door I<bestand>.

source: Enter the time namespace. If no file is specified, enter the time namespace of the target process. If I<file> is specified, enter the time namespace specified by I<file>.
nl: Geef de tijd naamruimte. Als geen bestand werd opgegeven, geef dan de tijd naamruimte van het doel proces. Als I<bestand> werd opgegeven, geen de tijd naamruimte gespecificeerd door I<bestand>.

source: Set the group ID which will be used in the entered namespace and drop supplementary groups. B<nsenter>(1) always sets GID for user namespaces, the default is 0.
nl: Zet de groep ID die zal worden gebruikte in de opgegeven naamruimte en laat aanvullende groepen vallen. B<nsenter>(1) zet altijd GID voor gebruiker naamruimtes, de standaard is 0.

source: Set the user ID which will be used in the entered namespace. B<nsenter>(1) always sets UID for user namespaces, the default is 0.
nl: Zet de gebruiker ID die zal worden gebruikt in de opgegeven naamruimte. B<nsenter>(1) zet altijd UID voor gebruiker naamruimtes, de standaard is 0.

source: Don't modify UID and GID when enter user namespace. The default is to drops supplementary groups and sets GID and UID to 0.
nl: Verander UID en GID niet bij het opgeven van gebruiker naamruimte. De standaard is om aanvullende groepen te laten vallen en GID en UID op 0 te zetten.

source: Set the root directory. If no directory is specified, set the root directory to the root directory of the target process. If directory is specified, set the root directory to the specified directory.
nl: Zet de systeembeheerder map. Als geen map werd opgegeven, zet de systeembeheerder map op de systeembeheerder map van het doel proces. Als de map werd opgegeven, zet dan de systeembeheerder map op de opgegeven map.

source: Set the working directory. If no directory is specified, set the working directory to the working directory of the target process. If directory is specified, set the working directory to the specified directory.
nl: Zet de werkmap. Als geen map werd opgegeven, zet de werkmap op de werkmap van het doel proces. Als de map werd opgegeven, zet dan de werkmap op de opgegeven map.

source: Do not fork before exec'ing the specified program. By default, when entering a PID namespace, B<nsenter> calls B<fork> before calling B<exec> so that any children will also be in the newly entered PID namespace.
nl: Vork niet voor het uitvoeren van het opgegeven programma. Standaard, bij het binnen gaan van de PID naamruimte, roept B<nsenter>() B<fork> aan voordat het B<exec>() aanroept zodat elk kind ook in de nieuwe PID naamruimte zullen zitten.

source: Display version information and exit.
nl: programmaversie tonen en stoppen.

source: The nsenter command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
nl: Het nsenter commando is onderdeel van het util-linux pakket en is beschikbaar van E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>

source: Set the root directory. If no directory is specified, set the root directory to the root directory of the target process. If directory is specified, set the root directory to the specified directory.
nl: Zet de systeembeheerder map. Als geen map werd opgegeven, zet de systeembeheerder map op de systeembeheerder map van het doel proces. Als de map werd opgegeven, zet dan de systeembeheerder map op de opgegeven map.

source: Set the working directory. If no directory is specified, set the working directory to the working directory of the target process. If directory is specified, set the working directory to the specified directory.
nl: Zet de werkmap. Als geen map werd opgegeven, zet de werkmap op de werkmap van het doel proces. Als de map werd opgegeven, zet dan de werkmap op de opgegeven map.
