Repository: sebras/manpages-l10n
Catalog: po/*/man1/nsenter.1.po
Languages: nl

source: User Commands
nl: Opdrachten voor gebruikers

source: NAME
nl: NAAM

source: nsenter - run program in different namespaces
nl: nsenter - voer programma uit in een andere naamruimte

source: SYNOPSIS
nl: SAMENVATTING

source: B<nsenter> [options] [I<program> [I<arguments>]]
nl: B<nsenter> [opties] [I<program> [I<arguments>]]

source: DESCRIPTION
nl: BESCHRIJVING

source: The B<nsenter> command executes I<program> in the namespace(s) that are specified in the command-line options (described below). If I<program> is not given, then "${SHELL}" is run (default: I</bin/sh>).
nl: Het B<nsenter> commando voert I<programma> uit in de naamruimte(s) die worden opgegeven in de commando regel opties (hieronder beschreven). Als I<programma> niet werd opgegeven, dan wordt ``${SHELL}'' uitgevoerd (standaard: /bin\:/sh).

source: Enterable namespaces are:
nl: Beschikbare naamruimtes zijn:

source: B<mount namespace>
nl: B<mount naamruimte>

source: Mounting and unmounting filesystems will not affect the rest of the system, except for filesystems which are explicitly marked as shared (with B<mount --make-shared>; see I</proc/self/mountinfo> for the B<shared> flag). For further details, see B<mount_namespaces>(7) and the discussion of the B<CLONE_NEWNS> flag in B<clone>(2).
nl: Aan en afkoppelen van bestandssystemen zal de rest van het systeem niet beïnvloeden, behalve voor bestandssystemen die expliciet gemarkeerd zijn als gedeeld (met B<mount --make-\:shared>; zie I</proc\:/self\:/mountinfo> voor de B<shared> vlag). Voor meer details, zie B<mount_namespaces>(7) en de discussie over de B<CLONE_NEWNS> vlag in B<clone>(2).

source: B<UTS namespace>
nl: B<UTS naamruimte>

source: Setting hostname or domainname will not affect the rest of the system. For further details, see B<uts_namespaces>(7).
nl: Het instellen van machinenaam of domeinnaam beïnvloed de rest van het systeem niet. Voor verdere details, zie B<uts_namespaces>(7).

source: B<IPC namespace>
nl: B<IPC naamruimte>

source: The process will have an independent namespace for POSIX message queues as well as System V message queues, semaphore sets and shared memory segments. For further details, see B<ipc_namespaces>(7).
nl: Het proces zal een onafhankelijke naamruimte voor POSIX bericht wachtrijen zowel als System V bericht wachtrijen, seinpaal verzamelingen en gedeelde geheugen segmenten hebben. Voor mee details, zie B<ipc_namespaces>(7).

source: B<network namespace>
nl: B<network naamruimte>

source: The process will have independent IPv4 and IPv6 stacks, IP routing tables, firewall rules, the I</proc/net> and I</sys/class/net> directory trees, sockets, etc. For further details, see B<network_namespaces>(7).
nl: Het proces zal onafhankelijke IPv4 en IPv6 stapels, IP routering tabellen, firewall regels hebben, de I</proc\:/net> en I</sys\:/class\:/net> map bomen, sockets, etc. Voor meer details, zie B<network_namespaces>(7).

source: B<PID namespace>
nl: B<PID naamruimte>

source: Children will have a set of PID to process mappings separate from the B<nsenter> process. B<nsenter> will fork by default if changing the PID namespace, so that the new program and its children share the same PID namespace and are visible to each other. If B<--no-fork> is used, the new program will be exec\(cqed without forking. For further details, see B<pid_namespaces>(7).
nl: Kinderen zullen een verzameling PID´s hebben om instellingen apart van het B<nsenter> proces te verwerken. B<nsenter> zal standaard vorken zodra de PID naamruimte verandert, waarmee het nieuwe programma en zijn kinderen dezelfde PID naamruimte delen en onderling zichtbaar zijn. Als B<--no-fork> werd gebruikt, dan wordt het nieuwe programma uitgevoerd zonder te vorken. Voor meer details zie B<pid_namespaces>(7).

source: B<user namespace>
nl: B<gebruiker naamruimte>

source: The process will have a distinct set of UIDs, GIDs and capabilities. For further details, see B<user_namespaces>(7).
nl: Het proces zal een verschillende verzameling UID´s, GID´s en capaciteiten hebben. Voor verdere details, zie B<user_namespaces>(7).

source: B<cgroup namespace>
nl: B<cgroup naamruimte>

source: The process will have a virtualized view of I</proc/self/cgroup>, and new cgroup mounts will be rooted at the namespace cgroup root. For further details, see B<cgroup_namespaces>(7).
nl: Het proces zal een virtueel zicht op I</proc\:/self\:/cgroup> hebben, en nieuwe cgroup koppelingen zullen beginnen bij de naamruimte cgroup root. Voor verdere details, zie B<cgroup_namespaces>(7).

source: B<time namespace>
nl: B<time naamruimte>

source: The process can have a distinct view of B<CLOCK_MONOTONIC> and/or B<CLOCK_BOOTTIME> which can be changed using I</proc/self/timens_offsets>. For further details, see B<time_namespaces>(7).
nl: Het proces zal een verschillend zicht op B<CLOCK_MONOTONIC> en/of B<CLOCK_BOOTTIME> hebben hetgeen kan worden verandert met I</proc/self/timens_offsets>. Voor verder details, zie B<time_namespaces>(7).

source: OPTIONS
nl: OPTIES

source: Various of the options below that relate to namespaces take an optional I<file> argument. This should be one of the I</proc/[pid]/ns/*> files described in B<namespaces>(7), or the pathname of a bind mount that was created on one of those files.
nl: Diverse van de hieronder gegeven opties die betrekking hebben op naamruimtes gebruiken een optioneel I<bestand> argument. Dit moet een van de I</proc/[pid]/ns/*> bestanden zijn, zoals beschreven in B<namespaces>(7), of de padnaam van een aankoppeling die werd aangemaakt door een van deze bestanden.

source: Enter all namespaces of the target process by the default I</proc/[pid]/ns/*> namespace paths. The default paths to the target process namespaces may be overwritten by namespace specific options (e.g., B<--all --mount>=[I<path>]).
nl: Geef alle naamruimtes van het doel proces door de standaard I</proc/[pid]/ns/*> naamruimtes paden. De standaard paden van de doel proces naamruimtes kunnen overschreven worden door naamruimte specifieke opties (b.v., B<--all --mount>=[I<pad>]).

source: The user namespace will be ignored if the same as the caller\(cqs current user namespace. It prevents a caller that has dropped capabilities from regaining those capabilities via a call to setns(). See B<setns>(2) for more details.
nl: De gebruiker naamruimte wordt genegeerd als deze dezelfde is dan de huidige naamruimte van de aanroeper. Dit voorkomt dat een aanroeper die zijn capaciteiten liet vallen deze opnieuw verkrijgt door een aanroep van B<setns>(). Zie B<setns>(2) voor meer details.

source: Specify a target process to get contexts from. The paths to the contexts specified by I<pid> are:
nl: Geef het doel proces op waarvan de context verkregen moet worden. De paden van de contexten opgegeven door I<pid> zijn:

source: the mount namespace
nl: de aankoppel naamruimte

source: the UTS namespace
nl: de UTS naamruimte

source: the IPC namespace
nl: de IPC naamruimte

source: the network namespace
nl: de netwerk naamruimte

source: the PID namespace
nl: de PID naamruimte

source: the user namespace
nl: de gebruiker naamruimte

source: the cgroup namespace
nl: de cgroup naamruimte

source: the time namespace
nl: de tijd naamruimte

source: the root directory
nl: de root map

source: the working directory respectively
nl: de respectievelijke werkmap

source: B<-m>, B<--mount>[=I<file>]
nl: B<-m>, B<--mount>[=I<bestand>]

source: Enter the mount namespace. If no file is specified, enter the mount namespace of the target process. If I<file> is specified, enter the mount namespace specified by I<file>.
nl: Gebruik de aankoppel naamruimte. Als geen bestand werd opgegeven, gebruik dan de aankoppel naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de aankoppel naamruimte zoals opgegeven door I<bestand>.

source: B<-u>, B<--uts>[=I<file>]
nl: B<-u>, B<--uts>[=I<bestand>]

source: Enter the UTS namespace. If no file is specified, enter the UTS namespace of the target process. If I<file> is specified, enter the UTS namespace specified by I<file>.
nl: Gebruik de UTS naamruimte. Als geen bestand werd opgegeven, gebruik dan de UTS naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de UTS naamruimte zoals opgegeven door I<bestand>.

source: B<-i>, B<--ipc>[=I<file>]
nl: B<-i>, B<--ipc>[=I<bestand>]

source: Enter the IPC namespace. If no file is specified, enter the IPC namespace of the target process. If I<file> is specified, enter the IPC namespace specified by I<file>.
nl: Gebruik de IPC naamruimte. Als geen bestand werd opgegeven, gebruik dan de IPC naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de IPC naamruimte zoals opgegeven door I<bestand>.

source: B<-n>, B<--net>[=I<file>]
nl: B<-n>, B<--net>[=I<bestand>]

source: Enter the network namespace. If no file is specified, enter the network namespace of the target process. If I<file> is specified, enter the network namespace specified by I<file>.
nl: Gebruik de netwerk naamruimte. Als geen bestand werd opgegeven, gebruik dan de netwerk naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de netwerk naamruimte zoals opgegeven door I<bestand>.

source: B<-p>, B<--pid>[=I<file>]
nl: B<-p>, B<--pid>[=I<bestand>]

source: Enter the PID namespace. If no file is specified, enter the PID namespace of the target process. If I<file> is specified, enter the PID namespace specified by I<file>.
nl: Gebruik de PID naamruimte. Als geen bestand werd opgegeven, gebruik dan de PID naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de PID naamruimte zoals opgegeven door I<bestand>.

source: B<-U>, B<--user>[=I<file>]
nl: B<-U>, B<--user>[=I<bestand>]

source: Enter the user namespace. If no file is specified, enter the user namespace of the target process. If I<file> is specified, enter the user namespace specified by I<file>. See also the B<--setuid> and B<--setgid> options.
nl: Gebruik de gebruiker naamruimte. Als geen bestand werd opgegeven, gebruik dan de gebruiker naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de gebruiker naamruimte zoals opgegeven door I<bestand>.

source: B<-C>, B<--cgroup>[=I<file>]
nl: B<-C>, B<--cgroup>[=I<bestand>]

source: Enter the cgroup namespace. If no file is specified, enter the cgroup namespace of the target process. If I<file> is specified, enter the cgroup namespace specified by I<file>.
nl: Gebruik de cgroup naamruimte. Als geen bestand werd opgegeven, gebruik dan de cgroup naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de cgroup naamruimte zoals opgegeven door I<bestand>.

source: B<-T>, B<--time>[=I<file>]
nl: B<-u>, B<--uts>[=I<bestand>]

source: Enter the time namespace. If no file is specified, enter the time namespace of the target process. If I<file> is specified, enter the time namespace specified by I<file>.
nl: Geef de tijd naamruimte. Als geen bestand werd opgegeven, geef dan de tijd naamruimte van het doel proces. Als I<bestand> werd opgegeven, geen de tijd naamruimte gespecificeerd door I<bestand>.

source: Set the group ID which will be used in the entered namespace and drop supplementary groups. B<nsenter> always sets GID for user namespaces, the default is 0.
nl: Zet de GID die zal worden gebruikte in de opgegeven naamruimte en laat aanvullende groepen vallen. B<nsenter>(1) zet altijd GID voor gebruiker naamruimtes, de standaard is 0.

source: Set the user ID which will be used in the entered namespace. B<nsenter> always sets UID for user namespaces, the default is 0.
nl: Zet de gebruiker ID die zal worden gebruikt in de opgegeven naamruimte. B<nsenter>(1) zet altijd UID voor gebruiker naamruimtes, de standaard is 0.

source: Don\(cqt modify UID and GID when enter user namespace. The default is to drops supplementary groups and sets GID and UID to 0.
nl: Verander UID en GID niet bij het binnen gaan van gebruiker naamruimte. De standaard is om aanvullende groepen te laten vallen en GID en UID op 0 te zetten.

source: B<-r>, B<--root>[=I<directory>]
nl: B<-r>, B<--root>[=I<map>]

source: Set the root directory. If no directory is specified, set the root directory to the root directory of the target process. If directory is specified, set the root directory to the specified directory. The specified I<directory> is open before it switches to the requested namespaces.
nl: Zet de systeembeheerder map. Als geen map werd opgegeven, zet de systeembeheerder map dan op de systeembeheerder map van het doel proces. Als de map wel werd opgegeven, zet dan de systeembeheerder map op de opgegeven map. De opgegeven I<map> is open voordat het naar de gevraagd naamruimtes omschakelt.

source: B<-w>, B<--wd>[=I<directory>]
nl: B<-w>, B<--wd>[=I<map>]

source: Set the working directory. If no directory is specified, set the working directory to the working directory of the target process. If directory is specified, set the working directory to the specified directory. The specified I<directory> is open before it switches to the requested namespaces, it means the specified directory works as "tunnel" to the current namespace. See also B<--wdns>.
nl: Zet de werkmap. Als geen map werd opgegeven, zet de werkmap op de werkmap van het doel proces. Als de map werd opgegeven, zet dan de werkmap op de opgegeven map. De opgegeven I<map> is open voordat het omschakelt naar de gevraagde naamruimtes, dit betekent dat de opgegeven map werkt als een "tunnel" naar de opgegeven naamruimte. Zie ook B<--wdns>.

source: B<-W>, B<--wdns>[=I<directory>]
nl: B<-w>, B<--wdns>[=I<map>]

source: Set the working directory. The I<directory> is open after switch to the requested namespaces and after B<chroot>(2) call. The options B<--wd> and B<--wdns> are mutually exclusive.
nl: Zet de werkmap. De I<map> is open na de omschakeling naar de gevraagde naamruimte en na de B<chroot>(2) aanroep. De optie B<--wd> en B<--wdns> sluiten elkaar uit.

source: Do not fork before exec\(cqing the specified program. By default, when entering a PID namespace, B<nsenter> calls B<fork> before calling B<exec> so that any children will also be in the newly entered PID namespace.
nl: Vork niet voor het uitvoeren van het opgegeven programma. Standaard, bij het binnen gaan van de PID naamruimte, roept B<nsenter>() B<fork> aan voordat het B<exec>() aanroept zodat elk kind ook in de nieuwe PID naamruimte zullen zitten.

source: Set the SELinux security context used for executing a new process according to already running process specified by B<--target> PID. (The util-linux has to be compiled with SELinux support otherwise the option is unavailable.)
nl: Zet de SELinux veiligheid context die gebruikt is om een nieuw proces uit te voeren volgens het proces dat wordt uitgevoerd met B<--target> PID. (Dan moet util-linux gecompileerd zijn met SELinux ondersteuning anders is deze optie niet beschikbaar.)

source: Display help text and exit.
nl: een hulptekst tonen en stoppen.

source: Print version and exit.
nl: Toon versie en stop.

source: AUTHORS
nl: AUTEURS

source: SEE ALSO
nl: ZIE OOK

source: B<clone>(2), B<setns>(2), B<namespaces>(7)
nl: B<clone>(2), B<setns>(2), B<naamruimtes>(7)

source: REPORTING BUGS
nl: RAPPORTEREN VAN BUGS

source: For bug reports, use the issue tracker at
nl: Gebruik om bugs te rapporteren de issue tracker op

source: AVAILABILITY
nl: BESCHIKBAARHEID

source: The B<nsenter> command is part of the util-linux package which can be downloaded from
nl: The B<nsenter> commando is onderdeel van het util-linux pakket dan kan worden gedownload van

source: June 2013
nl: Juni 2013

source: The B<nsenter> command executes I<program> in the namespace(s) that are specified in the command-line options (described below). If I<program> is not given, then ``${SHELL}'' is run (default: /bin\:/sh).
nl: Het B<nsenter> commando voert I<programma> uit in de naamruimte(s) die worden opgegeven in de commando regel opties (hieronder beschreven). Als I<programma> niet werd opgegeven, dan wordt ``${SHELL}'' uitgevoerd (standaard: /bin\:/sh).

source: Mounting and unmounting filesystems will not affect the rest of the system, except for filesystems which are explicitly marked as shared (with B<mount --make-\:shared>; see I</proc\:/self\:/mountinfo> for the B<shared> flag). For further details, see B<mount_namespaces>(7) and the discussion of the B<CLONE_NEWNS> flag in B<clone>(2).
nl: Aan en afkoppelen van bestandssystemen zal de rest van het systeem niet beïnvloeden, behalve voor bestandssystemen die expliciet gemarkeerd zijn als gedeeld (met B<mount --make-\:shared>; zie I</proc\:/self\:/mountinfo> voor de B<shared> vlag). Voor meer details, zie B<mount_namespaces>(7) en de discussie over de B<CLONE_NEWNS> vlag in B<clone>(2).

source: Setting hostname or domainname will not affect the rest of the system. For further details, see B<uts_namespaces>(7).
nl: Het instellen van machinenaam of domeinnaam beïnvloed de rest van het systeem niet. Voor verdere details, zie B<uts_namespaces>(7).

source: The process will have an independent namespace for POSIX message queues as well as System V message queues, semaphore sets and shared memory segments. For further details, see B<ipc_namespaces>(7).
nl: Het proces zal een onafhankelijke naamruimte voor POSIX bericht wachtrijen zowel als System V bericht wachtrijen, seinpaal verzamelingen en gedeeld geheugen segmenten hebben. Voor mee details, zie B<ipc_namespaces>(7).

source: The process will have independent IPv4 and IPv6 stacks, IP routing tables, firewall rules, the I</proc\:/net> and I</sys\:/class\:/net> directory trees, sockets, etc. For further details, see B<network_namespaces>(7).
nl: Het proces zal onafhankelijke IPv4 en IPv6 stapels, IP routerings tabellen, firewall regels hebben, de I</proc\:/net> en I</sys\:/class\:/net> map bomen, sockets, etc. Voor meer details, zie B<network_namespaces>(7).

source: Children will have a set of PID to process mappings separate from the B<nsenter> process. B<nsenter> will fork by default if changing the PID namespace, so that the new program and its children share the same PID namespace and are visible to each other. If B<--no-fork> is used, the new program will be exec'ed without forking. For further details, see B<pid_namespaces>(7).
nl: Kinderen zullen een verzameling PID´s om instellingen apart van het B<nsenter> proces te verwerken. B<nsenter> zal standaard vorken zodra de PID naamruimte verandert, waarmee het nieuwe programma en zijn kinderen dezelfde PID naamruimte delen en onderling zichtbaar zijn. Als B<--no-fork> werd gebruikt, dan wordt het nieuwe programma uitgevoerd zonder te vorken. Voor meer details zie B<pid_namespaces>(7).

source: The process will have a distinct set of UIDs, GIDs and capabilities. For further details, see B<user_namespaces>(7).
nl: Het proces zal onderscheiden verzameling UID´s, GID´s en capaciteiten hebben. Voor verdere details, zie B<user_namespaces>(7).

source: The process will have a virtualized view of I</proc\:/self\:/cgroup>, and new cgroup mounts will be rooted at the namespace cgroup root. For further details, see B<cgroup_namespaces>(7).
nl: Het proces zal een virtueel zicht op I</proc\:/self\:/cgroup> hebben, en nieuwe cgroup koppelingen zullen beginnen bij de naamruimte cgroup root. Voor verdere details, zie B<cgroup_namespaces>(7).

source: The process can have a distinct view of B<CLOCK_MONOTONIC> and/or B<CLOCK_BOOTTIME> which can be changed using I</proc/self/timens_offsets>. For further details, see B<time_namespaces>(7).
nl: Het proces zal een onderscheiden zicht op B<CLOCK_MONOTONIC> en/of B<CLOCK_BOOTTIME> hetgeen kan worden verandert met I</proc/self/timens_offsets>. Voor verder details, zie B<time_namespaces>(7).

source: Various of the options below that relate to namespaces take an optional I<file> argument. This should be one of the I</proc/[pid]/ns/*> files described in B<namespaces>(7), or the pathname of a bind mount that was created on one of those files.
nl: Diverse van de hieronder gegeven opties die betrekking hebben op naamruimtes gebruiken een optioneel I<bestand> argument. Dit moet een van de I</proc/[pid]/ns/*> bestanden zijn, beschreven in B<namespaces>(7), of de padnaam van een aankoppeling die werd aangemaakt door een van deze bestanden.

source: Enter all namespaces of the target process by the default I</proc/[pid]/ns/*> namespace paths. The default paths to the target process namespaces may be overwritten by namespace specific options (e.g., --all --mount=[path]).
nl: Geef alle naamruimtes van het doel proces met de standaard I</proc/[pid]/ns/*> naamruimtes paden. De standaard paden van de doel proces naamruimtes kunnen overschreven worden door naamruimte specifieke opties (b.v. --all --mount=[pad]).

source: The user namespace will be ignored if the same as the caller's current user namespace. It prevents a caller that has dropped capabilities from regaining those capabilities via a call to setns(). See B<setns>(2) for more details.
nl: De gebruiker naamruimte wordt genegeerd als het dezelfde is aan de huidige naamruimte van de aanroeper. Dit voorkomt een aanroeper die zijn capaciteiten liet vallen deze opnieuw verkrijgt door een aanroep van B<setns>(). Zie B<setns>(2) voor meer details.

source: Specify a target process to get contexts from. The paths to the contexts specified by I<pid> are:
nl: Geef het doel proces op waarvan de context verkregen moet worden. De paden van de contexten opgegeven door I<pid> zijn:

source: Enter the mount namespace. If no file is specified, enter the mount namespace of the target process. If I<file> is specified, enter the mount namespace specified by I<file>.
nl: Gebruik de aankoppel naamruimte. Als geen bestand werd opgegeven, gebruik dan de aankoppel naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de aankoppel naamruimte zoals opgegeven door I<bestand>.

source: Enter the UTS namespace. If no file is specified, enter the UTS namespace of the target process. If I<file> is specified, enter the UTS namespace specified by I<file>.
nl: Gebruik de UTS naamruimte. Als geen bestand werd opgegeven, gebruik dan de UTS naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de UTS naamruimte zoals opgegeven door I<bestand>.

source: Enter the IPC namespace. If no file is specified, enter the IPC namespace of the target process. If I<file> is specified, enter the IPC namespace specified by I<file>.
nl: Gebruik de IPC naamruimte. Als geen bestand werd opgegeven, gebruik dan de IPC naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de IPC naamruimte zoals opgegeven door I<bestand>.

source: Enter the network namespace. If no file is specified, enter the network namespace of the target process. If I<file> is specified, enter the network namespace specified by I<file>.
nl: Gebruik de netwerk naamruimte. Als geen bestand werd opgegeven, gebruik dan de netwerk naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de netwerk naamruimte zoals opgegeven door I<bestand>.

source: Enter the PID namespace. If no file is specified, enter the PID namespace of the target process. If I<file> is specified, enter the PID namespace specified by I<file>.
nl: Gebruik de PID naamruimte. Als geen bestand werd opgegeven, gebruik dan de PID naamruimte van het doel proces. Als I<bestand> werd opgegeven, gebruik dan de PID naamruimte zoals opgegeven door I<bestand>.
