Repository: sebras/manpages-l10n
Catalog: po/*/man1/numfmt.1.po
Languages: es, nl, sr

source: April 2022
es: Abril de 2022
sr: Априла 2022

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: User Commands
es: Órdenes de usuario
nl: Opdrachten voor gebruikers
sr: Корисничке наредбе

source: NAME
es: NOMBRE
nl: NAAM
sr: НАЗИВ

source: SYNOPSIS
es: SINOPSIS
nl: SAMENVATTING
sr: УВОД

source: B<numfmt> [I<\,OPTION\/>]... [I<\,NUMBER\/>]...
es: B<numfmt> [I<\,OPCIÓN\/>]... [I<\,NÚMERO\/>]...
nl: B<numfmt> [I<\,OPTIE\/>]... [I<\,GETAL\/>]...
sr: B<numfmt> [I<\,ОПЦИЈА\/>]... [I<\,БРОЈ\/>]...

source: DESCRIPTION
es: DESCRIPCIÓN
nl: BESCHRIJVING
sr: ОПИС

source: Reformat NUMBER(s), or the numbers from standard input if none are specified.
es: Cambia el formato a NÚMERO(s), si no se especifica ninguno emplea la entrada estándar.
nl: Herformatteer GETAL(len), of de getallen van standaard invoer als er geen gegeven zijn.
sr: Преобликује БРОЈ(еве), или бројеве са стандардног улаза ако ниједан није наведен.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
nl: Een verplicht argument bij een lange optie is ook verplicht voor de korte optie.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.

source: print warnings about invalid input
es: muestra avisos para entradas inválidas
nl: waarschuwingen tonen bij ongeldige invoer
sr: исписује упозорења о неисправном улазу

source: use X instead of whitespace for field delimiter
es: emplea X para separar campos en lugar de un espacio en blanco
nl: te gebruiken scheidingsteken (in plaats van witruimte)
sr: користи Х уместо празнине за граничник поља

source: B<--field>=I<\,FIELDS\/>
es: B<--field>=I<\,CAMPOS\/>
nl: B<--field>=I<\,VELDEN\/>
sr: B<--field>=I<\,ПОЉА\/>

source: B<--format>=I<\,FORMAT\/>
es: B<--format>=I<\,FORMATO\/>
nl: B<--format>=I<\,OPMAAK\/>
sr: B<--format>=I<\,ЗАПИС\/>

source: use printf style floating-point FORMAT; see FORMAT below for details
es: emplea el FORMATO de coma flotante de printf. Consulte FORMATO más adelante
nl: gebruik het printf drijvende komme getal formaat; zie FORMAAT hier onder voor details
sr: користи ЗАПИС покретног зареза у „printf“ стилу; видите ЗАПИС испод за појединости

source: B<--from>=I<\,UNIT\/>
es: B<--from>=I<\,UNIDAD\/>
nl: B<--from>=I<\,EENHEID\/>
sr: B<--from>=I<\,ЈЕДИНИЦА\/>

source: auto-scale input numbers to UNITs; default is 'none'; see UNIT below
es: escala automáticamente los números dados en las UNIDAD(es) dadas. Por defecto se considera 'none'. Consulte UNIDAD más adelante.
nl: invoergetallen herschalen naar deze EENHEID (zie onder); standaard is 'none'
sr: самостално сразмерава улазне бројеве на ЈЕДИНИЦУ; основно је „none“; видите ЈЕДИНУЦА испод

source: specify the input unit size (instead of the default 1)
es: define las unidades de la entrada (en lugar de tomar la opción por defecto: 1)
nl: de grootte van de invoereenheid (in plaats van 1)
sr: одређује улазну величину јединице (уместо основног 1)

source: use locale-defined grouping of digits, e.g. 1,000,000 (which means it has no effect in the C/POSIX locale)
es: agrupa las cifras según la localización del equipo, por ejemplo: 1,000,000 (esto carece de efecto el la localización estándar C/POSIX)
nl: door de taalregio bepaalde cijfergroepering gebruiken (heeft dus geen effect in C- of POSIX-taalregio)
sr: користи груписање цифара одређено језиком, нпр. 1.000.000 (што значи да нема дејства у језику Ц/ПОСИКС)

source: print (without converting) the first N header lines; N defaults to 1 if not specified
es: muestra (sin realizar ninguna conversión) las primeras N líneas de encabezado. Por defecto, N=1.
nl: de eerste N kopregels zonder converteren tonen; N is 1 wanneer niet opgegeven
sr: исписује (без претварања) првих N редова заглавља; за N се подразумева 1 ако није наведено

source: B<--invalid>=I<\,MODE\/>
es: B<--invalid>=I<\,MODO\/>
nl: B<--invalid>=I<\,MODUS\/>
sr: B<--invalid>=I<\,РЕЖИМ\/>

source: failure mode for invalid numbers: MODE can be: abort (default), fail, warn, ignore
es: acción a realizar en caso de econtrarse n número inválida. MODO puede ser: abort (por defecto), fail, warn, ignore
nl: wat te doen bij ongeldige getallen; MODUS kan zijn: 'abort' (standaard), 'fail', 'warn', 'ignore'
sr: режим неуспеха за неисправне бројеве: РЕЖИМ може бити: „abort“ — прекини (основно), „fail“ — неуспех, „warn“ — упозори, „ignore“ — занемари

source: pad the output to N characters; positive N will right-align; negative N will left-align; padding is ignored if the output is wider than N; the default is to automatically pad if a whitespace is found
es: añade N caracteres para espaciar la salida. Valores positivos de N alinean a la derecha mientras que valores negativos lo harán a la izquierda. Se ignora el margen si la salida es más ancha que N. Por defecto, se añaden estos caracteres si se encuentra algún espacio en blanco.
nl: de uitvoer uitvullen tot dit aantal tekens; een positief getal lijnt rechts uit, een negatief getal links; uitvulling wordt genegeerd als de uitvoer breder is; standaard wordt uitgevuld als witruimte gevonden wordt
sr: попуњава излаз до N знакова; позитивно N ће поравнати на десно; негативно N ће поравнати на лево; попуњавање се занемарује ако је излаз већи од N; основно је самостално попуњавање ако се пронађе празнина

source: B<--round>=I<\,METHOD\/>
es: B<--round>=I<\,MÉTODO\/>
nl: B<--round>=I<\,METHODE\/>
sr: B<--round>=I<\,НАЧИН\/>

source: use METHOD for rounding when scaling; METHOD can be: up, down, from-zero (default), towards-zero, nearest
es: Emplea MÉTODO para redondear la escala. MÉTODO puede adoptar los siguientes valores: uo, down, from-zero (por defecto), towards-zero y nearest
nl: te gebruiken afrondingsmethode bij herschalen; METHODE kan zijn: 'up', 'down', 'from-zero' (standaard), 'towards-zero', 'nearest'
sr: користи НАЧИН за заокруживање приликом сразмеравања; НАЧИН може бити: „up“ — горе, „down“ — доле, „from-zero“ — од нуле (основно), „towards-zero“ — изнад нуле, „nearest“ — најближе

source: B<--suffix>=I<\,SUFFIX\/>
es: B<--suffix>=I<\,SUFIJO\/>
nl: B<--suffix>=I<\,ACHTERVOEGSEL\/>
sr: B<--suffix>=I<\,СУФИКС\/>

source: add SUFFIX to output numbers, and accept optional SUFFIX in input numbers
es: añade SUFIJO a los números de salida y acepta SUFIJO opcional en los números de entrada
nl: dit achtervoegsel toevoegen aan uitvoergetallen, en accepteren bij invoergetallen
sr: додаје СУФИКС излазним бројевима, и прихвата изборни СУФИКС у улазним бројевима

source: B<--to>=I<\,UNIT\/>
es: B<--to>=I<\,UNIDAD\/>
nl: B<--to>=I<\,EENHEID\/>
sr: B<--to>=I<\,ЈЕДИНИЦА\/>

source: auto-scale output numbers to UNITs; see UNIT below
es: reescala los números de salida a UNIDAD(es). Consulte UNIDAD más adelante
nl: uitvoergetallen herschalen naar deze EENHEID (zie onder)
sr: самостално сразмерава излазне бројеве на ЈЕДИНИЦУ; видите испод ЈЕДИНИЦУ

source: the output unit size (instead of the default 1)
es: tamaño de unidad de salida (por defecto: 1)
nl: de grootte van de uitvoereenheid (in plaats van 1)
sr: величина излазне јединице (уместо основног 1)

source: line delimiter is NUL, not newline
es: las líneas se delimitan con NUL en lugar de nueva línea
nl: regels afsluiten met 0-byte, niet met nieuweregel
sr: ограничавач реда је НИШТА, не нови ред

source: display this help and exit
es: muestra la ayuda y finaliza
nl: toon de helptekst en stop
sr: приказује ову помоћ и излази

source: output version information and exit
es: muestra la versión del programa y termina
nl: toon programmaversie en stop
sr: исписује податке о издању и излази

source: UNIT options:
es: UNIDAD opciones:
nl: Mogelijkheden voor EENHEID zijn:
sr: Опције ЈЕДИНИЦЕ:

source: no auto-scaling is done; suffixes will trigger an error
es: no se escala de manera automática; los sufijos provocarán errores
nl: geen automatische herschaling; achtervoegsels geven een fout
sr: не ради се самостално сразмеравање; суфикси ће окинути грешку

source: accept optional single/two letter suffix:
es: acepta sufijos opcionales de una o dos letras:
nl: een optioneel achtervoegsel van één of twee letters accepteren:
sr: прихвата изборне суфиксе од једног/два слова:

source: accept optional single letter suffix:
es: acepta un sufijo opcional de una letra:
nl: een optioneel achtervoegsel van één letter accepteren:
sr: прихвата изборни суфикс од једног слова:

source: accept optional two-letter suffix:
es: acepta un sufijo opcional de dos letras
nl: een optioneel achtervoegsel van twee letters accepteren:
sr: прихвата изборни суфикс од једног слова:

source: FIELDS supports cut(1) style field ranges:
es: CAMPOS permite emplear intervalos al estilo de cut(1)
nl: VELDEN ondersteund cut(1) stijl veld bereiken
sr: ПОЉА подржавају опсеге поља у стилу B<cut>(1):

source: N'th field, counted from 1
es: enésimo campo, empezando en el 1
nl: N-de veld (tellend vanaf 1)
sr: N-то поље, бројећи од 1

source: from N'th field, to end of line
es: desde el enésimo campo hasta el final de la línea
nl: van N-de veld tot het einde van de regel
sr: од N-тог поља, до краја реда

source: from N'th to M'th field (inclusive)
es: desde el enésimo campo hasta el emésimo (ambos inclusive)
nl: van N-de tot en met M-de veld
sr: од N-тог до M-тог поља (закључно)

source: from first to M'th field (inclusive)
es: desde el primer hasta el emésimo campo (incluido)
nl: van eerste tot en met M-de veld
sr: од првог до M-тог поља (закључно)

source: all fields
es: todos los campos
nl: alle velden
sr: сва поља

source: Multiple fields/ranges can be separated with commas
es: Pueden separarse los campos/intervalos mediante comas
nl: Meerdere velden en/of bereiken zijn mogelijk, gescheiden door komma's.
sr: Више поља/опсега може бити раздвојено зарезима.

source: FORMAT must be suitable for printing one floating-point argument '%f'. Optional quote (%'f) will enable B<--grouping> (if supported by current locale). Optional width value (%10f) will pad output. Optional zero (%010f) width will zero pad the number. Optional negative values (%-10f) will left align. Optional precision (%.1f) will override the input determined precision.
es: El FORMATO debe permitir la impresión de un argumento de coma flotante '%f'. Si se añade una comilla (%'f') activa B<--grouping> siempre que la localización del equipo lo permita. El valor opcional de ancho (%10f) define el espaciado de la salida. El cero (%010f) dejará a los números sin espaciado. Valores negativos (%-10f) harán que se alinee a la izquierda. Si se define la precisión (%.1f), se anulará cualquier otro valor dado en la entrada.
nl: FORMAAT moet geschikt zijn om een drijvende komma getal "%f' af te drukken. Een optioneel aanhalingsteken (%´f) maakt B<--grouping> mogelijk (als dat ondersteund wordt door de locale). Een optionele breedte waarde (%10f) zal de uitvoer opvullen. Een optionele nul (%010f) zal met nullen opvullen. Een optionele negatieve waarde (%-10f) zal links uitlijnen. De optionele precisie (%.1f) zal de door de invoer bepaalde precisie overschrijven.
sr: ЗАПИС мора бити подесан за исписивање једног аргумента са покретним зарезом „%f“. Изборни наводник (%'f) ће укључити B<--grouping> (ако је подржано текућим језиком). Изборна вредност ширине (%10f) ће попунити излаз. Изборна нулта (%010f) ширина ће нулом попунити број. Изборне негативне вредности (%-10f) ће попунити с лева. Изборна тачност (%.1f) ће преписати улазом одређену тачност.

source: Exit status is 0 if all input numbers were successfully converted. By default, numfmt will stop at the first conversion error with exit status 2. With B<--invalid=>'fail' a warning is printed for each conversion error and the exit status is 2. With B<--invalid=>'warn' each conversion error is diagnosed, but the exit status is 0. With B<--invalid=>'ignore' conversion errors are not diagnosed and the exit status is 0.
es: El estado de salida será cero si todos los números dados han sido correctamente convertidos. Por defecto, numfmt se detendrá en el primer error de conversión con un estado de salida de 2. Con la opción B<--invalid=>'fail' se muestra un aviso para cada error finalizando con estado de salida 2. Si se emplea B<--invalid=>'warn' se revisa cada error de conversión pero el estado de salida será cero, mientras que con B<--invalid=>'ignore' no se revisan los errores de conversión y el estado de salida será cero.
nl: De afsluit-waarde is 0 als alle invoer getallen succesvol geconverteerd werden. Standaard stopt B<numfmt> na de eerste conversie fout met afsluit-waarde 2. B<--invalid=>'fail' zal een waarschuwing tonen bij elke conversie fout en de afsluit-waarde is 2. B<--invalid=>'warn' diagnosticeert elke conversie fout, maar de afsluit-waarde is 0. Met B<--invalid=>'ignore' wordt elke fout niet gediagnosticeerd en de afsluit-waarde is 0.
sr: Излазно стање је 0 ако су сви улазни бројеви успешно претворени. По основи, %s ће стати при првој грешци претварања са излазним стањем 2. Са B<--invalid=>'fail' исписује се упозорење за сваку грешку претварањаа излазно стање је 2. Са B<--invalid=>'warn' свака грешка претварања се дијагностикује, али излазно стање је 0. Са B<--invalid=>'ignore' грешке претварање се не дијагностикују а излазно стање је 0.

source: EXAMPLES
es: EJEMPLOS
nl: VOORBEELDEN
sr: ПРИМЕРИ

source: AUTHOR
es: AUTOR
nl: AUTEUR
sr: АУТОР

source: Written by Assaf Gordon.
es: Escrito por Assaf Gordon.
nl: Geschreven door Assaf Gordon.
sr: Написао је Асаф Гордон.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
nl: RAPPORTEREN VAN BUGS
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Online hulp bij GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
nl: Meld alle vertaalfouten op E<lt>https://translationproject.org/team/nl.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>

source: COPYRIGHT
sr: АУТОРСКА ПРАВА

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.

source: SEE ALSO
es: VÉASE TAMBIÉN
nl: ZIE OOK
sr: ВИДИТЕ ТАКОЂЕ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/numfmtE<gt>
es: Documentación completa E<lt>https://www.gnu.org/software/coreutils/numfmtE<gt>
nl: Volledige documentatie op: E<lt>https://www.gnu.org/software/coreutils/numfmtE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/numfmtE<gt>

source: or available locally via: info \(aq(coreutils) numfmt invocation\(aq
es: también disponible localmente ejecutando: info \(aq(coreutils) numfmt invocation\(aq
nl: of lokaal via: info \(aq(coreutils) numfmt invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) numfmt invocation\(aq“

source: September 2020
es: Septiembre de 2020
sr: Септембра 2020

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: replace the numbers in these input fields (default=1) see FIELDS below
es: sustituye los números de los campos indicados (por defecto 1). Consulte CAMPOS más adelante
nl: getallen in deze invoer velden vervangen (standaard=1) zie VELDEN hier onder
sr: замењује бројеве у тим улазним пољима (основно је 1); видите ПОЉА испод

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
nl: Oktober 2021
sr: Октобра 2021

source: March 2022
sr: Марта 2022

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2021
es: Septiembre de 2021
sr: Септембра 2021

source: numfmt - Convert numbers from/to human-readable strings
es: numfmt - Convierte números a/desde un formato humanamente legible
nl: numfmt - converteer getallen van/naar leesbare teksten

source: replace the numbers in these input fields (default=1); see FIELDS below
es: sustituye los números de los campos indicados (por defecto=1). Consulte CAMPOS más adelante
nl: getallen in deze invoer velden vervangen (standaard=1); zie VELDEN hier onder

source: August 2022
es: Agosto de 2022
nl: Augustus 2022

source: B<--from-unit>=I<\,N\/>
nl: B<--from-unit>=I<\,GETAL\/>

source: B<--padding>=I<\,N\/>
nl: B<--padding>=I<\,GETAL\/>

source: B<--to-unit>=I<\,N\/>
nl: B<--to-unit>=I<\,GETAL\/>
