Repository: sebras/manpages-l10n
Catalog: po/*/man1/openvt.1.po
Languages: de

source: 19 Jul 1996
de: 19. Juli 1996

source: NAME
de: BEZEICHNUNG

source: openvt - start a program on a new virtual terminal (VT).
de: openvt - ein Programm in einem neuen virtuellen Terminal (VT) starten.

source: SYNOPSIS
de: ÜBERSICHT

source: B<openvt> [-c vtnumber] [OPTIONS] [--] command
de: B<openvt> [-c VT-Nummer] [OPTIONEN] [--] Befehl

source: DESCRIPTION
de: BESCHREIBUNG

source: B<openvt> will find the first available VT, and run on it the given B<command> with the given B<command options ,> standard input, output and error are directed to that terminal. The current search path ($PATH) is used to find the requested command. If no command is specified then the environment variable $SHELL is used.
de: B<openvt> findet das erste verfügbare virtuelle Terminal (VT) und führt darauf den angegebenen B<Befehl> mit den angegebenen B<OPTIONEN> aus, wobei Standardeingabe, Standardausgabe und Standardfehlerausgabe an dieses Terminal geleitet werden. Der aktuelle Suchpfad ($PATH) wird zum Finden des angeforderten Befehls verwendet. Wird kein Befehl angegeben, wird die Umgebungsvariable $SHELL verwendet.

source: OPTIONS
de: OPTIONEN

source: I<-c, --console=VTNUMBER>
de: I<-c, --console=VT-NUMMER>

source: Use the given VT number and not the first available. Note you must have write access to the supplied VT for this to work.
de: verwendet die angegebene VT-Nummer anstelle des ersten verfügbaren. Beachten Sie, dass Sie über Schreibzugriff auf das angegebene VT verfügen müssen, damit dies funktioniert.

source: Force opening a VT without checking whether it is already in use.
de: erzwingt das Öffnen eines VT, ohne zu prüfen, ob es bereits verwendet wird.

source: Directly execute the given command, without forking. This option is meant for use in I</etc/inittab>.
de: führt den angegebenen Befehl direkt aus, ohne es mit fork() zu starten. Diese Option ist für die Verwendung in I</etc/inittab> gedacht.

source: Switch to the new VT when starting the command. The VT of the new command will be made the new current VT.
de: wechselt beim Starten des Befehls zum neuen VT. Das VT des neuen Befehls wird zum neuen aktuellen VT.

source: Figure out the owner of the current VT, and run login as that user. Suitable to be called by init. Shouldn't be used with I<-c> or I<-l>.
de: ermittelt den Benutzer des aktuellen VTs und führt B<login>(1) als dieser Benutzer aus. Dies ist zum Aufruf durch B<init> geeignet. Es sollte nicht mit B<-c> oder B<-l> verwendet werden.

source: Make the command a login shell. A - is prepended to the name of the command to be executed.
de: macht den Befehl zur Anmeldeshell. Dem auszuführenden Befehl wird ein B<-> vorangestellt.

source: Be a bit more verbose.
de: schreibt ausführlichere Ausgaben.

source: wait for command to complete. If -w and -s are used together then B<openvt> will switch back to the controlling terminal when the command completes.
de: wartet auf den Abschluss der Ausführung des Befehls. Falls B<-w> und B<-s> zusammen verwendet werden, wechselt B<openvt> zurück zum steuernden Terminal, sobald die Befehlsausführung abgeschlossen ist.

source: print program version and exit.
de: gibt die Programmversion aus und beendet das Programm.

source: show this text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.

source: end of options to B<openvt>.
de: markiert das Ende der Optionen für B<openvt>.

source: NOTE
de: ANMERKUNGEN

source: If B<openvt> is compiled with a getopt_long() and you wish to set options to the command to be run, then you must supply the end of options -- flag before the command.
de: Falls B<openvt> mit getopt_long() kompiliert ist und Sie Optionen an den auszuführenden Befehl übergeben wollen, dann müssen Sie vor den Befehl die Ende-der-Optionen-Markierung B<--> setzen.

source: EXAMPLES
de: BEISPIELE

source: B<openvt> can be used to start a shell on the next free VT, by using the command:
de: B<openvt> kann mit folgendem Befehl zum Starten einer Shell auf dem nächsten freien VT verwendet werden:

source: To start the shell as a login shell, use:
de: Um eine Shell als Anmeldeshell zu starten, geben Sie Folgendes ein:

source: To get a long listing you must supply the -- separator:
de: Um eine lange Auflistung zu erhalten, müssen Sie B<--> als Trenner verwenden:

source: HISTORY
de: GESCHICHTE

source: Earlier, B<openvt> was called B<open>. It was written by Jon Tombs E<lt>jon@gtex02.us.esE<gt> or E<lt>jon@robots.ox.ac.ukE<gt>. The I<-w> idea is from "sam".
de: Frühere Versionen von B<openvt> hießen B<open>. Es wurde von Jon Tombs E<lt>jon@gtex02.us.esE<gt> oder E<lt>jon@robots.ox.ac.ukE<gt> geschrieben. Die Idee für B<-w> stammt von »sam«.

source: SEE ALSO
de: SIEHE AUCH

source: Directly execute the given command, without forking. This option is meant for use in I</etc/inittab>. If you want to use this feature in another context, be aware that B<openvt> has to be a session leader in order for -e to work. See B<setsid>(2) or B<setsid>(1) on how to achieve this.
de: führt den angegebenen Befehl direkt aus, ohne es mit fork() zu starten. Diese Option ist für die Verwendung in I</etc/inittab> gedacht. Wenn Sie diese Funktion in einem anderen Kontext verwenden wollen, achten Sie darauf, dass B<openvt> der Sitzungsleiter sein muss, damit B<-e> funktioniert. In B<setsid>(2) oder B<setsid>(1) finden Sie weitere Informationen, wie Sie dies erreichen können.

source: B<openvt> will find the first available VT, and run on it the given B<command> with the given B<command options>, standard input, output and error are directed to that terminal. The current search path ($PATH) is used to find the requested command. If no command is specified then the environment variable $SHELL is used.
de: B<openvt> findet das erste verfügbare virtuelle Terminal (VT) und führt darauf den angegebenen B<Befehl> mit den angegebenen B<OPTIONEN> aus, wobei Standardeingabe, Standardausgabe und Standardfehlerausgabe an dieses Terminal geleitet werden. Der aktuelle Suchpfad ($PATH) wird zum Finden des angeforderten Befehls verwendet. Wird kein Befehl angegeben, wird die Umgebungsvariable $SHELL verwendet.

source: Use the given VT number and not the first available. Note you must have write access to the supplied VT for this to work;
de: verwendet die angegebene VT-Nummer anstelle des ersten verfügbaren. Beachten Sie, dass Sie über Schreibzugriff auf das angegebene VT verfügen müssen, damit dies funktioniert.

source: Force opening a VT without checking whether it is already in use;
de: erzwingt das Öffnen eines VT, ohne zu prüfen, ob es bereits verwendet wird.

source: Directly execute the given command, without forking. This option is meant for use in I</etc/inittab>;
de: führt den angegebenen Befehl direkt aus, ohne es mit fork() zu starten. Diese Option ist für die Verwendung in I</etc/inittab> gedacht.

source: Switch to the new VT when starting the command. The VT of the new command will be made the new current VT;
de: wechselt beim Starten des Befehls zum neuen VT. Das VT des neuen Befehls wird zum neuen aktuellen VT.

source: Figure out the owner of the current VT, and run login as that user. Suitable to be called by init. Shouldn't be used with -c or -l;
de: ermittelt den Benutzer des aktuellen VTs und führt B<login>(1) als dieser Benutzer aus. Dies ist zum Aufruf durch B<init> geeignet. Es sollte nicht mit B<-c> oder B<-l> verwendet werden.

source: Make the command a login shell. A - is prepended to the name of the command to be executed;
de: macht den Befehl zur Anmeldeshell. Dem auszuführenden Befehl wird ein B<-> vorangestellt.

source: Be a bit more verbose;
de: schreibt ausführlichere Ausgaben.

source: wait for command to complete. If -w and -s are used together then B<openvt> will switch back to the controlling terminal when the command completes;
de: wartet auf den Abschluss der Ausführung des Befehls. Falls B<-w> und B<-s> zusammen verwendet werden, wechselt B<openvt> zurück zum steuernden Terminal, sobald die Befehlsausführung abgeschlossen ist.

source: print program version and exit;
de: gibt die Programmversion aus und beendet das Programm.

source: Earlier, B<openvt> was called B<open>. It was written by Jon Tombs E<lt>jon@gtex02.us.es or jon@robots.ox.ac.ukE<gt>. The -w idea is from "sam".
de: Frühere Versionen von B<openvt> hießen B<open>. Es wurde von Jon Tombs E<lt>jon@gtex02.us.esE<gt> oder E<lt>jon@robots.ox.ac.ukE<gt> geschrieben. Die Idee für B<-w> stammt von »sam«.
