Repository: sebras/manpages-l10n
Catalog: po/*/man1/pacreport.1.po
Languages: de

source: Title
de: Titel

source: NAME
de: BEZEICHNUNG

source: pacreport - display a summary of installed packages
de: pacreport - eine Zusammenfassung der installierten Pakete anzeigen

source: SYNOPSIS
de: ÜBERSICHT

source: \& pacreport [options] \& pacreport (--help|--version)
de: \& pacreport [Optionen] \& pacreport (--help|--version)

source: DESCRIPTION
de: BESCHREIBUNG

source: Generate a report of installed packages including:
de: Einen Bericht zu installierten Paketen erstellen, der Folgendes umfasst:

source: unneeded packages installed explicitly
de: nicht notwendige Pakete, die explizit installiert wurden

source: unneeded packages installed as dependencies
de: nicht notwendige Pakete, die als Abhängigkeiten installiert wurden

source: unneeded packages in a dependency cycle
de: nicht notwendige Pakete in einer Abhängigkeitsschleife

source: installed packages not in a repository
de: installierte Pakete, die in keinem Repositorium vorhanden sind

source: packages missing from specified groups
de: fehlende Pakete aus den angegebenen Gruppen

source: missing package files
de: fehlende Paketdateien

source: unmerged backup files
de: nicht zusammengeführte Sicherungsdateien

source: unowned files
de: Dateien ohne Eigentümer

source: cache directory sizes
de: Größe der Zwischenspeicherverzeichnisse

source: Package sizes include dependencies not needed by other packages.
de: Größen von Paketen schließen deren Abhängigkeiten ein, die nicht von anderen Paketen benötigt werden.

source: Packages prefixed by an asterisk (CW<\*(C`*\*(C'>) are optional dependencies for another package.
de: Pakete, denen ein Stern (»*«) vorangestellt ist, sind optionale Abhängigkeiten eines anderen Pakets.

source: OPTIONS
de: OPTIONEN

source: B<--config>=I<path>
de: B<--config>=I<Pfad>

source: --config=path
de: --config=Pfad

source: Set an alternate pacman configuration file path.
de: gibt einen alternativen Pfad zur Pacman-Konfigurationsdatei an.

source: B<--dbext>=I<extension>
de: B<--dbext>=I<Erweiterung>

source: --dbext=extension
de: --dbext=Erweiterung

source: Set an alternate sync database extension.
de: gibt eine alternative synchronisierte Datenbankerweiterung an.

source: B<--dbpath>=I<path>
de: B<--dbpath>=I<Pfad>

source: --dbpath=path
de: --dbpath=Pfad

source: Set an alternate database path.
de: gibt den Pfad zu einer alternativen Datenbank an.

source: B<--root>=I<path>
de: B<--root>=I<Pfad>

source: --root=path
de: --root=Pfad

source: Set an alternate installation root.
de: gibt eine alternative Installationswurzel an.

source: B<--sysroot>=I<path>
de: B<--sysroot>=I<Pfad>

source: --sysroot=path
de: --sysroot=Pfad

source: Set an alternate system root. See B<pacutils-sysroot>\|(7).
de: gibt eine alternative Systemwurzel an. Siehe B<pacutils-sysroot>\|(7).

source: B<--cache-dir>=I<path>
de: B<--cache-dir>=I<Pfad>

source: --cache-dir=path
de: --cache-dir=Pfad

source: Set an alternate cache directory path.
de: gibt einen Pfad zu einem alternativen Zwischenspeicherverzeichnis an.

source: Search for I<.pac{save,orig,new}> files. By default I</etc> is searched and all known config files are checked; pass twice to search outside I</etc>.
de: sucht nach I<.pac{save,orig,new}>-Dateien. Standardmäßig wird I</etc> durchsucht und alle bekannten Konfigurationsdateien werden geprüft; übergeben Sie diese Option zweimal, um außerhalb von I</etc> zu suchen.

source: B<--group>=I<name>
de: B<--group>=I<Gruppe>

source: --group=name
de: --group=Gruppe

source: Display any packages in group I<name> that are not currently installed. May be specified multiple times.
de: zeigt die Pakete in der angegebenen I<Gruppe> an, die gegenwärtig nicht installiert sind. Dies kann mehrfach angegeben werden.

source: Check for missing package files.
de: prüft auf fehlende Paketdateien.

source: Check for unowned files. See I</etc/pacreport.conf> under \s-1FILES\s0 for more information.
de: prüft auf Dateien, die zu keinem Paket gehören. Siehe I</etc/pacreport.conf> unter \s-1DATEIEN\s0 für weitere Informationen.

source: Take optional dependencies into account when listing unneeded packages and dependency loops.
de: berücksichtigt optionale Abhängigkeiten, wenn unnötige Pakete und Abhängigkeitsschleifen aufgelistet werden.

source: Display usage information and exit.
de: zeigt Hinweise zur Verwendung an und beendet das Programm.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: FILES
de: DATEIEN

source: INI-style configuration file listing paths to ignore when run with \&B<--unowned-files>. Paths which should always be ignored may be specified with \&CW<\*(C`IgnoreUnowned\*(C'> in the CW<\*(C`Options\*(C'> section. Paths which should only be ignored if a particular package is installed can be listed under the section \&CW<\*(C`PkgIgnoreUnowned\*(C'> using the package name as the option name and the path to be ignored as the value. All options can be specified multiple times. Paths may include shell-style globs. The installation root should not be included in paths.
de: Konfigurationsdatei im INI-Stil, die bei der Ausführung mit \&B<--unowned-files> zu ignorierende Pfade auflistet. Pfade, die immer ignoriert werden sollen, können mit »IgnoreUnowned« im Abschnitt »Options« angegeben werden. Pfade, die nur dann ignoriert werden sollen, wenn ein bestimmtes Paket installiert ist, können im Abschnitt »PkgIgnoreUnowned« angegeben werden, wobei der Paketname als Name und der zu ignorierende Pfad als Wert der Option verwendet werden. Alle Optionen können mehrfach angegeben werden. Pfade dürfen Globs im Shell-Stil enthalten. Die Installationswurzel sollte in Pfade nicht eingeschlossen werden.
