Repository: sebras/manpages-l10n
Catalog: po/*/man1/pdf2ps.1.po
Languages: da

source: Ghostscript Tools
da: Ghostscript-værktøjer

source: NAME
da: NAVN

source: pdf2ps - Ghostscript PDF to PostScript translator
da: pdf2ps - Ghostscript PDF til PostScript-oversætter

source: B<pdf2ps> [ I<options> ] I<input.pdf [output.ps]>
da: B<pdf2ps> [ I<tilvalg> ] I<inddata.pdf [uddata.ps]>

source: DESCRIPTION
da: BESKRIVELSE

source: B<pdf2ps> uses B<gs>(1) to convert the Adobe B<Portable Document Format> (PDF) file "input.pdf" to B<PostScript>(tm) in "output.ps". Normally the output is allowed to use PostScript Level 2 (but not PostScript LanguageLevel 3) constructs; the B<-dLanguageLevel=1> option restricts the output to Level 1, while B<-dLanguageLevel=3> allows using LanguageLevel 3 in the output.
da: B<pdf2ps> bruger B<gs>(1) til at konvertere filen Adobe B<Portable Document Format> (PDF) »inddata.pdf« til B<PostScript>(tm) i »uddata.ps«. Normalt kan resultatet bruge PostScript Level 2-konstruktioner (men ikke PostScript LanguageLevel 3); tilvalget B<-dLanguageLevel=1> begrænser resultatet til Level 1, mens B<-dLanguageLevel=3> gør at LanguageLevel 3 kan bruges i resultatet.

source: FILES
da: FILER

source: Run "B<gs -h>" to find the location of Ghostscript documentation on your system, from which you can get more details.
da: Afvikl »B<gs -h>« for at finde placeringen af Ghostscript-dokumentationen på dit system, hvor du kan se yderligere detaljer.

source: This document was last revised for Ghostscript version 9.56.1.
da: Dette dokument blev sidst revideret for Ghostscript version 9.56.1.

source: AUTHOR
da: FORFATTER

source: Artifex Software, Inc. are the primary maintainers of Ghostscript.
da: Artifex Software, Inc. er den primære vedligeholder for Ghostscript.

source: 1 October 2020
da: 1. oktober 2020

source: This document was last revised for Ghostscript version 9.53.3.
da: Dette dokument blev sidst revideret for Ghostscript version 9.53.3.

source: This document was last revised for Ghostscript version 9.55.0.
da: Dette dokument blev sidst revideret for Ghostscript version 9.55.0.
