Repository: sebras/manpages-l10n
Catalog: po/*/man1/perl.1.po
Languages: de

source: \& perlbook Perl book information \& perlcommunity Perl community information \& \& perldoc Look up Perl documentation in Pod format \& \& perlhist Perl history records \& perldelta Perl changes since previous version \& perl5260delta Perl changes in version 5.26.0 \& perl5242delta Perl changes in version 5.24.2 \& perl5241delta Perl changes in version 5.24.1 \& perl5240delta Perl changes in version 5.24.0 \& perl5224delta Perl changes in version 5.22.4 \& perl5223delta Perl changes in version 5.22.3 \& perl5222delta Perl changes in version 5.22.2 \& perl5221delta Perl changes in version 5.22.1 \& perl5220delta Perl changes in version 5.22.0 \& perl5203delta Perl changes in version 5.20.3 \& perl5202delta Perl changes in version 5.20.2 \& perl5201delta Perl changes in version 5.20.1 \& perl5200delta Perl changes in version 5.20.0 \& perl5184delta Perl changes in version 5.18.4 \& perl5182delta Perl changes in version 5.18.2 \& perl5181delta Perl changes in version 5.18.1 \& perl5180delta Perl changes in version 5.18.0 \& perl5163delta Perl changes in version 5.16.3 \& perl5162delta Perl changes in version 5.16.2 \& perl5161delta Perl changes in version 5.16.1 \& perl5160delta Perl changes in version 5.16.0 \& perl5144delta Perl changes in version 5.14.4 \& perl5143delta Perl changes in version 5.14.3 \& perl5142delta Perl changes in version 5.14.2 \& perl5141delta Perl changes in version 5.14.1 \& perl5140delta Perl changes in version 5.14.0 \& perl5125delta Perl changes in version 5.12.5 \& perl5124delta Perl changes in version 5.12.4 \& perl5123delta Perl changes in version 5.12.3 \& perl5122delta Perl changes in version 5.12.2 \& perl5121delta Perl changes in version 5.12.1 \& perl5120delta Perl changes in version 5.12.0 \& perl5101delta Perl changes in version 5.10.1 \& perl5100delta Perl changes in version 5.10.0 \& perl589delta Perl changes in version 5.8.9 \& perl588delta Perl changes in version 5.8.8 \& perl587delta Perl changes in version 5.8.7 \& perl586delta Perl changes in version 5.8.6 \& perl585delta Perl changes in version 5.8.5 \& perl584delta Perl changes in version 5.8.4 \& perl583delta Perl changes in version 5.8.3 \& perl582delta Perl changes in version 5.8.2 \& perl581delta Perl changes in version 5.8.1 \& perl58delta Perl changes in version 5.8.0 \& perl561delta Perl changes in version 5.6.1 \& perl56delta Perl changes in version 5.6 \& perl5005delta Perl changes in version 5.005 \& perl5004delta Perl changes in version 5.004 \& \& perlexperiment A listing of experimental features in Perl \& \& perlartistic Perl Artistic License \& perlgpl GNU General Public License
de: \& perlbook Perl-Buch-Informationen \& perlcommunity Perl-Gemeinschafts-Informationen \& \& perldoc Perl-Dokumentation im Pod-Format nachschlagen \& \& perlhist Perl-Geschichtsblätter \& perldelta Perl-Änderungen seit vorherigen Versionen \& perl5260delta Perl-Änderungen in Version 5.26.0 \& perl5242delta Perl-Änderungen in Version 5.24.2 \& perl5241delta Perl-Änderungen in Version 5.24.1 \& perl5240delta Perl-Änderungen in Version 5.24.0 \& perl5224delta Perl-Änderungen in Version 5.22.4 \& perl5223delta Perl-Änderungen in Version 5.22.3 \& perl5222delta Perl-Änderungen in Version 5.22.2 \& perl5221delta Perl-Änderungen in Version 5.22.1 \& perl5220delta Perl-Änderungen in Version 5.22.0 \& perl5203delta Perl-Änderungen in Version 5.20.3 \& perl5202delta Perl-Änderungen in Version 5.20.2 \& perl5201delta Perl-Änderungen in Version 5.20.1 \& perl5200delta Perl-Änderungen in Version 5.20.0 \& perl5184delta Perl-Änderungen in Version 5.18.4 \& perl5182delta Perl-Änderungen in Version 5.18.2 \& perl5181delta Perl-Änderungen in Version 5.18.1 \& perl5180delta Perl-Änderungen in Version 5.18.0 \& perl5163delta Perl-Änderungen in Version 5.16.3 \& perl5162delta Perl-Änderungen in Version 5.16.2 \& perl5161delta Perl-Änderungen in Version 5.16.1 \& perl5160delta Perl-Änderungen in Version 5.16.0 \& perl5144delta Perl-Änderungen in Version 5.14.4 \& perl5143delta Perl-Änderungen in Version 5.14.3 \& perl5142delta Perl-Änderungen in Version 5.14.2 \& perl5141delta Perl-Änderungen in Version 5.14.1 \& perl5140delta Perl-Änderungen in Version 5.14.0 \& perl5125delta Perl-Änderungen in Version 5.12.5 \& perl5124delta Perl-Änderungen in Version 5.12.4 \& perl5123delta Perl-Änderungen in Version 5.12.3 \& perl5122delta Perl-Änderungen in Version 5.12.2 \& perl5121delta Perl-Änderungen in Version 5.12.1 \& perl5120delta Perl-Änderungen in Version 5.12.0 \& perl5101delta Perl-Änderungen in Version 5.10.1 \& perl5100delta Perl-Änderungen in Version 5.10.0 \& perl589delta Perl-Änderungen in Version 5.8.9 \& perl588delta Perl-Änderungen in Version 5.8.8 \& perl587delta Perl-Änderungen in Version 5.8.7 \& perl586delta Perl-Änderungen in Version 5.8.6 \& perl585delta Perl-Änderungen in Version 5.8.5 \& perl584delta Perl-Änderungen in Version 5.8.4 \& perl583delta Perl-Änderungen in Version 5.8.3 \& perl582delta Perl-Änderungen in version 5.8.2 \& perl581delta Perl-Änderungen in Version 5.8.1 \& perl58delta Perl-Änderungen in Version 5.8.0 \& perl561delta Perl-Änderungen in Version 5.6.1 \& perl56delta Perl-Änderungen in Version 5.6 \& perl5005delta Perl-Änderungen in Version 5.005 \& perl5004delta Perl-Änderungen in Version 5.004 \& \& perlexperiment Eine Liste von experimentellen Funktionalitäten in Perl \& \& perlartistic Perl Artistic Lizenz \& perlgpl GNU General Public Lizenz

source: \& perlaix Perl notes for AIX \& perlamiga Perl notes for AmigaOS \& perlandroid Perl notes for Android \& perlbs2000 Perl notes for POSIX-BC BS2000 \& perlce Perl notes for WinCE \& perlcygwin Perl notes for Cygwin \& perldos Perl notes for DOS \& perlfreebsd Perl notes for FreeBSD \& perlhaiku Perl notes for Haiku \& perlhpux Perl notes for HP-UX \& perlhurd Perl notes for Hurd \& perlirix Perl notes for Irix \& perllinux Perl notes for Linux \& perlmacos Perl notes for Mac OS (Classic) \& perlmacosx Perl notes for Mac OS X \& perlnetware Perl notes for NetWare \& perlopenbsd Perl notes for OpenBSD \& perlos2 Perl notes for OS/2 \& perlos390 Perl notes for OS/390 \& perlos400 Perl notes for OS/400 \& perlplan9 Perl notes for Plan 9 \& perlqnx Perl notes for QNX \& perlriscos Perl notes for RISC OS \& perlsolaris Perl notes for Solaris \& perlsymbian Perl notes for Symbian \& perlsynology Perl notes for Synology \& perltru64 Perl notes for Tru64 \& perlvms Perl notes for VMS \& perlvos Perl notes for Stratus VOS \& perlwin32 Perl notes for Windows
de: \& perlaix Perl Hinweise für AIX \& perlamiga Perl Hinweise für AmigaOS \& perlandroid Perl Hinweise für Android \& perlbs2000 Perl Hinweise für POSIX-BC BS2000 \& perlce Perl Hinweise für WinCE \& perlcygwin Perl Hinweise für Cygwin \& perldos Perl Hinweise für DOS \& perlfreebsd Perl Hinweise für FreeBSD \& perlhaiku Perl Hinweise für Haiku \& perlhpux Perl Hinweise für HP-UX \& perlhurd Perl Hinweise für Hurd \& perlirix Perl Hinweise für Irix \& perllinux Perl Hinweise für Linux \& perlmacos Perl Hinweise für Mac OS (Classic) \& perlmacosx Perl Hinweise für Mac OS X \& perlnetware Perl Hinweise für NetWare \& perlopenbsd Perl Hinweise für OpenBSD \& perlos2 Perl Hinweise für OS/2 \& perlos390 Perl Hinweise für OS/390 \& perlos400 Perl Hinweise für OS/400 \& perlplan9 Perl Hinweise für Plan 9 \& perlqnx Perl Hinweise für QNX \& perlriscos Perl Hinweise für RISC OS \& perlsolaris Perl Hinweise für Solaris \& perlsymbian Perl Hinweise für Symbian \& perlsynology Perl Hinweise für Synology \& perltru64 Perl Hinweise für Tru64 \& perlvms Perl Hinweise für VMS \& perlvos Perl Hinweise für Stratus VOS \& perlwin32 Perl Hinweise für Windows

source: See perlrun.
de: Siehe B<perlrun>(1).

source: \& http://www.perl.org/ the Perl homepage \& http://www.perl.com/ Perl articles (O\*(AqReilly) \& http://www.cpan.org/ the Comprehensive Perl Archive \& http://www.pm.org/ the Perl Mongers
de: \& https//www.perl.org/ die Perl-Homepage \& http://www.perl.com/ Perl-Artikel(O\*(AqReilly) \& http://www.cpan.org/ das Umfassende Perl-Archiv \& http://www.pm.org/ die Perl-Händler

source: Perl is at the mercy of your machine's definitions of various operations such as type casting, I<atof()>, and floating-point output with I<sprintf()>.
de: Perl ist der Definitionen Ihrer Maschine für verschiedene Operationen wie Typ-Bestimmung, B<atof>(3) und der Ausgabe von Fließkommazahlen mit B<sprintf>(3) ausgeliefert.

source: If your stdio requires a seek or eof between reads and writes on a particular stream, so does Perl. (This doesn't apply to I<sysread()> and I<syswrite()>.)
de: Falls Ihr Stdio ein Seek oder EOF zwischen Lese- und Schreibaktionen bei einem bestimmten Datenstrom benötigt, trifft dies auch auf Perl zu. (Dies trifft nicht auf B<sysread>() und B<syswrite>() zu.)

source: You may mail your bug reports (be sure to include full configuration information as output by the myconfig program in the perl source tree, or by CW<\*(C`perl -V\*(C'>) to perlbug@perl.org . If you've succeeded in compiling perl, the perlbug script in the I<utils/> subdirectory can be used to help mail in a bug report.
de: Sie können Ihre Fehlerberichte an perlbug@perl.org schicken. Denken Sie daran, die vollständigen Konfigurationsinformationen als Ausgabe des Programms »myconfig« im Perl-Quellbaum oder mittels CW<\*(C`perl -V\*(C'> beizufügen. Falls Sie Perl erfolgreich kompiliert haben, kann das Skript perlbug in dem Unterverzeichnis I<utils/> Ihnen beim Schicken eines Fehlerberichts helfen.
