Repository: sebras/manpages-l10n
Catalog: po/*/man1/perl.1.po
Languages: de

source: Perl officially stands for Practical Extraction and Report Language, except when it doesn't.
de: Perl steht offiziell für »Practical Extraction and Report Language« (Praktische Auslese- und Berichtssprache), außer wenn das nicht der Fall ist.

source: Perl was originally a language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information. It quickly became a good language for many system management tasks. Over the years, Perl has grown into a general-purpose programming language. It's widely used for everything from quick \*(L"one-liners\*(R" to full-scale application development.
de: Perl war ursprüngliche eine Sprache, die zum Durchsuchen beliebiger Textdateien, Auslesen von Informationen aus diesen Textdateien und zum Ausgeben von Berichten basierend auf diesen Informationen optimiert wurde. Sie wurde schnell eine gute Sprache für viele Systemverwaltungsaufgaben. Im Laufe der Jahre wuchs Perl zu einer Allzweck-Programmiersprache heran. Sie wird breit für alles von schnellen \*(L»Einzeilern\*(R« bis zur vollausgewachsenen Anwendungsprogrammierung verwandt.

source: The language is intended to be practical (easy to use, efficient, complete) rather than beautiful (tiny, elegant, minimal). It combines (in the author's opinion, anyway) some of the best features of B<sed>, \&B<awk>, and B<sh>, making it familiar and easy to use for Unix users to whip up quick solutions to annoying problems. Its general-purpose programming facilities support procedural, functional, and object-oriented programming paradigms, making Perl a comfortable language for the long haul on major projects, whatever your bent.
de: Die Sprache ist für praktischen (leichte Verwendung, effizient, komplett) statt schönen Einsatz (klein, elegant, minimal) gedacht. Sie kombiniert (zumindestes in der Meinung des Autors) einige der besten Funktionalitäten von B<sed>(1), \&B<awk>(1) und B<sh>(1), wodurch sie für UNIX-Benutzer vertraut und einfach verwandt werden kann, um schnell eine Lösung für nervende Probleme zusammenzustellen. Ihre Allzweck-Programmier-Einrichtungen unterstützen prozedurale, funktionale und objektorientierte Programmier-Paradigmen, wodurch Perl eine bequeme Sprache für den größten Teil der wichtigsten Projekte wird, wie auch immer Sie es drehen.

source: Perl's roots in text processing haven't been forgotten over the years. It still boasts some of the most powerful regular expressions to be found anywhere, and its support for Unicode text is world-class. It handles all kinds of structured text, too, through an extensive collection of extensions. Those libraries, collected in the \s-1CPAN,\s0 provide ready-made solutions to an astounding array of problems. When they haven't set the standard themselves, they steal from the best \&\*(-- just like Perl itself.
de: Perls Wurzeln in der Textverabeitung wurden im Lauf der Jahre nicht vergessen. Sie rühmt sich immer noch mit den leistungsfähigsten regulären Ausdrücken und ihre Unterstützung für Unicode-Text ist Weltspitze. Sie handhabt auch sämtliche Arten von strukturiertem Text mittels einer umfangreichen Sammlung an Erweiterungen. Diese Bibliotheken, gesammelt im »CPAN«, stellen einsatzbereite Lösungen für eine verblüffende Anzahl an Problemen bereit. Wenn sie nicht selbst den Standard gesetzt haben, dann klauen sie von den Besten \&\*(-- genau wie Perl selbst.

source: AVAILABILITY
de: VERFÜGBARKEIT

source: Perl is available for most operating systems, including virtually all Unix-like platforms. See \*(L"Supported Platforms\*(R" in perlport for a listing.
de: Perl ist für die meisten Betriebssysteme verfügbar, einschließlich praktisch aller Unix-artigen Plattformen. Siehe\*(L"Supported Platforms\*(R" in B<perlport>(1) für eine Auflistung.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: See \*(L"\s-1ENVIRONMENT\*(R"\s0 in perlrun.
de: Siehe \*(L"\s-1ENVIRONMENT\*(R"\s0 in B<perlrun>(1).

source: AUTHOR
de: AUTOR

source: Larry Wall E<lt>larry@wall.orgE<gt>, with the help of oodles of other folks.
de: Larry Wall E<lt>larry@wall.orgE<gt> mit der Hilfe von einer Unmenge anderer Leute.

source: If your Perl success stories and testimonials may be of help to others who wish to advocate the use of Perl in their applications, or if you wish to simply express your gratitude to Larry and the Perl developers, please write to perl-thanks@perl.org .
de: Falls Ihre Perl-Erfolgsgeschichten und Erfahrungsberichte anderen, die den Einsatz von Perl in ihren Anwendungen bewerben möchten, helfen könnten oder Sie einfach Ihre Dankbarkeit an Larry und die Perl-Entwickler ausdrücken möchten, schreiben Sie bitte auf Englisch an perl-thanks@perl.org.

source: FILES
de: DATEIEN

source: \& "@INC" locations of perl libraries
de: \& "@INC" Ort der Perl-Bibliotheken

source: \&\*(L"@INC\*(R" above is a reference to the built-in variable of the same name; see perlvar for more information.
de: Vorstehendes \&\*(L"@INC\*(R" ist eine Referenz an die eingebaute Variable mit dem gleichen Namen; siehe B<perlvar>(1) für weitere Informationen.

source: SEE ALSO
de: SIEHE AUCH

source: \& https://www.perl.org/ the Perl homepage \& https://www.perl.com/ Perl articles \& https://www.cpan.org/ the Comprehensive Perl Archive \& https://www.pm.org/ the Perl Mongers
de: \& https://www.perl.org/ die Perl-Homepage \& https://www.perl.com/ Perl-Artikel \& https://www.cpan.org/ das Umfassende Perl-Archiv \& https://www.pm.org/ die Perl-Händler

source: DIAGNOSTICS
de: DIAGNOSE

source: Using the CW<\*(C`use strict\*(C'> pragma ensures that all variables are properly declared and prevents other misuses of legacy Perl features.
de: Die Verwendung des Pragmas CW<\*(C`use strict\*(C'> stellt sicher, dass alle Variablen vernünftig deklariert sind und verhindert andere Missbräuche veralteter Perl-Funktionalitäten.

source: The CW<\*(C`use warnings\*(C'> pragma produces some lovely diagnostics. One can also use the B<-w> flag, but its use is normally discouraged, because it gets applied to all executed Perl code, including that not under your control.
de: Das Pragma CW<\*(C`use warnings\*(C'> erstellt liebenswerte Diagnosen. Sie können auch den Schalter B<-w> verwenden, aber sein Einsatz wird normalerweise missbilligt, da er auf sämtlichen ausgeführten Perl-Code angewandt wird, einschließlich dem Teil, der nicht Ihrer Kontrolle unterliegt.

source: See perldiag for explanations of all Perl's diagnostics. The CW<\*(C`use diagnostics\*(C'> pragma automatically turns Perl's normally terse warnings and errors into these longer forms.
de: Siehe B<perldiag>(1) für Erklärungen sämtlicher Perl-Diagnosen. Das Pragma CW<\*(C`use diagnostics\*(C'> schaltet automatisch die knappen Warnungen und Fehler in diese längeren Formen.

source: Compilation errors will tell you the line number of the error, with an indication of the next token or token type that was to be examined. (In a script passed to Perl via B<-e> switches, each \&B<-e> is counted as one line.)
de: Kompilierungsfehler teilen Ihnen die Zeilennummer des Fehlers unter der Angabe, welches nächste Token oder welcher nächste Token-Typ untersucht werden soll, mit. (In einem an Perl mittels des Schalters B<-e> übergebenen Skript zählt jedes \&B<-e> als eine Zeile.)

source: Setuid scripts have additional constraints that can produce error messages such as \*(L"Insecure dependency\*(R". See perlsec.
de: Setuid-Skripte unterliegen zusätzlichen Beschränkungen, die Fehlermeldungen wie \*(L"Insecure dependency\*(R" ausgeben können. Siehe B<perlsec>(1).

source: Did we mention that you should definitely consider using the B<use warnings> pragma?
de: Haben wir erwähnt, dass Sie die Verwendung des Pragmas B<use warnings> in Betracht ziehen sollen?

source: BUGS
de: FEHLER

source: The behavior implied by the B<use warnings> pragma is not mandatory.
de: Das vom Pragma B<use warnings> implizierte Verhalten ist nicht verpflichtend.

source: Perl is at the mercy of your machine's definitions of various operations such as type casting, B<atof()>, and floating-point output with B<sprintf()>.
de: Perl ist der Definitionen Ihrer Maschine für verschiedene Operationen wie Typ-Bestimmung, B<atof>(3) und der Ausgabe von Fließkommazahlen mit B<sprintf>(3) ausgeliefert.

source: If your stdio requires a seek or eof between reads and writes on a particular stream, so does Perl. (This doesn't apply to B<sysread()> and B<syswrite()>.)
de: Falls Ihr Stdio ein Seek oder EOF zwischen Lese- und Schreibaktionen bei einem bestimmten Datenstrom benötigt, trifft dies auch auf Perl zu. (Dies trifft nicht auf B<sysread>() und B<syswrite>() zu.)

source: While none of the built-in data types have any arbitrary size limits (apart from memory size), there are still a few arbitrary limits: a given variable name may not be longer than 251 characters. Line numbers displayed by diagnostics are internally stored as short integers, so they are limited to a maximum of 65535 (higher numbers usually being affected by wraparound).
de: Obwohl keine der eingebauten Datentypen irgendeiner willkürlichen Größenbeschränkung unterliegt (abgesehen von der Speichergröße), gibt es dennoch ein paar willkürliche Beschränkungen: ein bestimmter Variablenname darf nicht länger als 251 Zeiuchen sein. Zur Diagnose angezeigte Zeilennummern werden intern als kurze Ganzzahlen gespeichert, daher sind sie auf ein Maximum von 65535 beschränkt (höhere Nummern unterliegen normalerweise einem Überlauf und fangen wieder von vorne an).

source: You may submit your bug reports (be sure to include full configuration information as output by the myconfig program in the perl source tree, or by CW<\*(C`perl -V\*(C'>) to E<lt>https://github.com/Perl/perl5/issuesE<gt>.
de: Sie können Ihre Fehlerberichte auf Englisch unter E<lt>https://github.com/Perl/perl5/issuesE<gt> einreichen. Denken Sie daran, die vollständigen Konfigurationsinformationen als Ausgabe des Programms »myconfig« im Perl-Quellbaum oder mittels CW<\*(C`perl -V\*(C'> beizufügen.

source: Perl actually stands for Pathologically Eclectic Rubbish Lister, but don't tell anyone I said that.
de: Perl steht eigentlich für »Pathologically Eclectic Rubbish Lister« (Pathologischer, wählerischer Müllauflister). Verraten Sie aber nicht, dass ich Ihnen das gesagt habe.

source: NOTES
de: ANMERKUNGEN

source: The Perl motto is \*(L"There's more than one way to do it.\*(R" Divining how many more is left as an exercise to the reader.
de: Das Perl-Motto lautet \*(L"Es gibt mehr als einen Weg, es zu erledigen.\*(R" Weiszusagen, wie viele noch übergeblieben sind, ist eine Hausaufgabe für den Leser.

source: The three principal virtues of a programmer are Laziness, Impatience, and Hubris. See the Camel Book for why.
de: Die drei Haupttugenden eines Programmierers sind Faulheit, Ungeduld und Überheblichkeit. Lesen Sie das Kamelbuch für die Begründung.

source: \& perlsyn Perl syntax \& perldata Perl data structures \& perlop Perl operators and precedence \& perlsub Perl subroutines \& perlfunc Perl built-in functions \& perlopentut Perl open() tutorial \& perlpacktut Perl pack() and unpack() tutorial \& perlpod Perl plain old documentation \& perlpodspec Perl plain old documentation format specification \& perldocstyle Perl style guide for core docs \& perlpodstyle Perl POD style guide \& perldiag Perl diagnostic messages \& perldeprecation Perl deprecations \& perllexwarn Perl warnings and their control \& perldebug Perl debugging \& perlvar Perl predefined variables \& perlre Perl regular expressions, the rest of the story \& perlrebackslash Perl regular expression backslash sequences \& perlrecharclass Perl regular expression character classes \& perlreref Perl regular expressions quick reference \& perlref Perl references, the rest of the story \& perlform Perl formats \& perlobj Perl objects \& perltie Perl objects hidden behind simple variables \& perldbmfilter Perl DBM filters \& \& perlipc Perl interprocess communication \& perlfork Perl fork() information \& perlnumber Perl number semantics \& \& perlthrtut Perl threads tutorial \& \& perlport Perl portability guide \& perllocale Perl locale support \& perluniintro Perl Unicode introduction \& perlunicode Perl Unicode support \& perlunicook Perl Unicode cookbook \& perlunifaq Perl Unicode FAQ \& perluniprops Index of Unicode properties in Perl \& perlunitut Perl Unicode tutorial \& perlebcdic Considerations for running Perl on EBCDIC platforms \& \& perlsec Perl security \& perlsecpolicy Perl security report handling policy \& \& perlmod Perl modules: how they work \& perlmodlib Perl modules: how to write and use \& perlmodstyle Perl modules: how to write modules with style \& perlmodinstall Perl modules: how to install from CPAN \& perlnewmod Perl modules: preparing a new module for distribution \& perlpragma Perl modules: writing a user pragma \& \& perlutil utilities packaged with the Perl distribution \& \& perlfilter Perl source filters \& \& perldtrace Perl\*(Aqs support for DTrace \& \& perlglossary Perl Glossary
de: \& perlsyn Perl Syntax \& perldata Perl Datenstrukturen \& perlop Perl Operatoren und Vorrang \& perlsub Perl Subroutinen \& perlfunc Perl eingebaute Funktionen \& perlopentut Perl open()-Anleitung \& perlpacktut Perl pack()- und unpack()-Anleitung \& perlpod Perl einfache altertümliche Dokumentation \& perlpodspec Perl einfache altertümliche Dokumentation: Formatspezifikation \& perldocstyle Perl-Stilanleitung für Kerndokumentation \& perlpodstyle Perl POD-Stilanleitung \& perldiag Perl Diagnosemeldungen \& perldeprecation Perl-Missbilligungen \& perllexwarn Perl-Warnungen und ihre Steuerung \& perldebug Perl-Fehlersuche \& perlvar Perl vordefinierte Variablen \& perlre Perl reguläre Ausdrücke, der Rest der Geschichte \& perlrebackslash Perl reguläre Ausdrücke: Rückwärtsschrägstrich-Sequenzen \& perlrecharclass Perl reguläre Ausdrücke: Zeichenklassen \& perlreref Perl reguläre Ausdrücke: Schnellreferenz \& perlref Perl-Referenzen, der Rest der Geschichte \& perlform Perl-Formate \& perlobj Perl-Objekte \& perltie Perl-Objekte, die hinter einfachen Variablen versteckt sind \& perldbmfilter Perl DBM-Filter \& \& perlipc Perl Interprozesskommunikation \& perlfork Perl fork()-Information \& perlnumber Perl Zahlensemantik \& \& perlthrtut Perl Threads-Anleitung \& \& perlport Perl Portabilitätsanleitung \& perllocale Perl Locale-Unterstützung \& perluniintro Perl Unicode-Einleitung \& perlunicode Perl Unicode-Unterstützung \& perlunicook Perl Unicode-Kochbuch \& perlunifaq Perl Unicode FAQ \& perluniprops Index der Unicode-Eigenschaften in Perl \& perlunitut Perl Unicode-Anleitung \& perlebcdic Erörterungen zur Ausführung von Perl auf EBCDIC-Plattformen \& \& perlsec Perl-Sicherheit \& perlsecpolicy Perl Handhabung von Sicherheitsmeldungen \& \& perlmod Perl Module: wie sie funktionieren \& perlmodlib Perl Module: wie sie zu schreiben und verwenden sind \& perlmodstyle Perl Module: wie Module mit Stil zu schreiben sind \& perlmodinstall Perl Module: wie sie von CPAN zu installieren sind \& perlnewmod Perl Module: Vorbereitung eines Modules zum Vertrieb \& perlpragma Perl Module: Schreiben eines Benutzer-Pragmas \& \& perlutil Hilfswerkzeuge, die mit der Perl-Distribution paketiert sind \& \& perlfilter Perl-Quellcode-Filter \& \& perldtrace Perls Unterstützung für DTrace \& \& perlglossary Perl Glossar

source: History
de: Geschichte

source: \& perlhist Perl history records \& perldelta Perl changes since previous version \& perl5321delta Perl changes in version 5.32.1 \& perl5320delta Perl changes in version 5.32.0 \& perl5303delta Perl changes in version 5.30.3 \& perl5302delta Perl changes in version 5.30.2 \& perl5301delta Perl changes in version 5.30.1 \& perl5300delta Perl changes in version 5.30.0 \& perl5283delta Perl changes in version 5.28.3 \& perl5282delta Perl changes in version 5.28.2 \& perl5281delta Perl changes in version 5.28.1 \& perl5280delta Perl changes in version 5.28.0 \& perl5263delta Perl changes in version 5.26.3 \& perl5262delta Perl changes in version 5.26.2 \& perl5261delta Perl changes in version 5.26.1 \& perl5260delta Perl changes in version 5.26.0 \& perl5244delta Perl changes in version 5.24.4 \& perl5243delta Perl changes in version 5.24.3 \& perl5242delta Perl changes in version 5.24.2 \& perl5241delta Perl changes in version 5.24.1 \& perl5240delta Perl changes in version 5.24.0 \& perl5224delta Perl changes in version 5.22.4 \& perl5223delta Perl changes in version 5.22.3 \& perl5222delta Perl changes in version 5.22.2 \& perl5221delta Perl changes in version 5.22.1 \& perl5220delta Perl changes in version 5.22.0 \& perl5203delta Perl changes in version 5.20.3 \& perl5202delta Perl changes in version 5.20.2 \& perl5201delta Perl changes in version 5.20.1 \& perl5200delta Perl changes in version 5.20.0 \& perl5184delta Perl changes in version 5.18.4 \& perl5182delta Perl changes in version 5.18.2 \& perl5181delta Perl changes in version 5.18.1 \& perl5180delta Perl changes in version 5.18.0 \& perl5163delta Perl changes in version 5.16.3 \& perl5162delta Perl changes in version 5.16.2 \& perl5161delta Perl changes in version 5.16.1 \& perl5160delta Perl changes in version 5.16.0 \& perl5144delta Perl changes in version 5.14.4 \& perl5143delta Perl changes in version 5.14.3 \& perl5142delta Perl changes in version 5.14.2 \& perl5141delta Perl changes in version 5.14.1 \& perl5140delta Perl changes in version 5.14.0 \& perl5125delta Perl changes in version 5.12.5 \& perl5124delta Perl changes in version 5.12.4 \& perl5123delta Perl changes in version 5.12.3 \& perl5122delta Perl changes in version 5.12.2 \& perl5121delta Perl changes in version 5.12.1 \& perl5120delta Perl changes in version 5.12.0 \& perl5101delta Perl changes in version 5.10.1 \& perl5100delta Perl changes in version 5.10.0 \& perl589delta Perl changes in version 5.8.9 \& perl588delta Perl changes in version 5.8.8 \& perl587delta Perl changes in version 5.8.7 \& perl586delta Perl changes in version 5.8.6 \& perl585delta Perl changes in version 5.8.5 \& perl584delta Perl changes in version 5.8.4 \& perl583delta Perl changes in version 5.8.3 \& perl582delta Perl changes in version 5.8.2 \& perl581delta Perl changes in version 5.8.1 \& perl58delta Perl changes in version 5.8.0 \& perl561delta Perl changes in version 5.6.1 \& perl56delta Perl changes in version 5.6 \& perl5005delta Perl changes in version 5.005 \& perl5004delta Perl changes in version 5.004
de: perlhist Perl-Geschichtsblätter \& perldelta Perl-Änderungen seit vorherigen Versionen\& perl5321delta Perl-Perl-Änderungen in Version 5.32.1 \& perl5320delta Perl-Änderungen in Version 5.32.0 \& perl5303delta Perl-Änderungen in Version 5.30.3 \& perl5302delta Perl-Änderungen in Version 5.30.2 \& perl5301delta Perl-Änderungen in Version 5.30.1 \& perl5300delta Perl-Änderungen in Version 5.30.0 \& perl5283delta Perl-Änderungen in Version 5.28.3 \& perl5282delta Perl-Änderungen in Version 5.28.2 \& perl5281delta Perl-Änderungen in Version 5.28.1 \& perl5280delta Perl-Änderungen in Version 5.28.0 \& perl5263delta Perl-Änderungen in Version 5.26.3 \& perl5262delta Perl-Änderungen in Version 5.26.2 \& perl5261delta Perl-Änderungen in Version 5.26.1 \& perl5260delta Perl-Änderungen in Version 5.26.0 \& perl5244delta Perl-Änderungen in Version 5.24.4 \& perl5243delta Perl-Änderungen in Version 5.24.3 \& perl5242delta Perl-Änderungen in Version 5.24.2 \& perl5241delta Perl-Änderungen in Version 5.24.1 \& perl5240delta Perl-Änderungen in Version 5.24.0 \& perl5224delta Perl-Änderungen in Version 5.22.4 \& perl5223delta Perl-Änderungen in Version 5.22.3 \& perl5222delta Perl-Änderungen in Version 5.22.2 \& perl5221delta Perl-Änderungen in Version 5.22.1 \& perl5220delta Perl-Änderungen in Version 5.22.0 \& perl5203delta Perl-Änderungen in Version 5.20.3 \& perl5202delta Perl-Änderungen in Version 5.20.2 \& perl5201delta Perl-Änderungen in Version 5.20.1 \& perl5200delta Perl-Änderungen in Version 5.20.0 \& perl5184delta Perl-Änderungen in Version 5.18.4 \& perl5182delta Perl-Änderungen in Version 5.18.2 \& perl5181delta Perl-Änderungen in Version 5.18.1 \& perl5180delta Perl-Änderungen in Version 5.18.0 \& perl5163delta Perl-Änderungen in Version 5.16.3 \& perl5162delta Perl-Änderungen in Version 5.16.2 \& perl5161delta Perl-Änderungen in Version 5.16.1 \& perl5160delta Perl-Änderungen in Version 5.16.0 \& perl5144delta Perl-Änderungen in Version 5.14.4 \& perl5143delta Perl-Änderungen in Version 5.14.3 \& perl5142delta Perl-Änderungen in Version 5.14.2 \& perl5141delta Perl-Änderungen in Version 5.14.1 \& perl5140delta Perl-Änderungen in Version 5.14.0 \& perl5125delta Perl-Änderungen in Version 5.12.5 \& perl5124delta Perl-Änderungen in Version 5.12.4 \& perl5123delta Perl-Änderungen in Version 5.12.3 \& perl5122delta Perl-Änderungen in Version 5.12.2 \& perl5121delta Perl-Änderungen in Version 5.12.1 \& perl5120delta Perl-Änderungen in Version 5.12.0 \& perl5101delta Perl-Änderungen in Version 5.10.1 \& perl5100delta Perl-Änderungen in Version 5.10.0 \& perl589delta Perl-Änderungen in Version 5.8.9 \& perl588delta Perl-Änderungen in Version 5.8.8 \& perl587delta Perl-Änderungen in Version 5.8.7 \& perl586delta Perl-Änderungen in Version 5.8.6 \& perl585delta Perl-Änderungen in Version 5.8.5 \& perl584delta Perl-Änderungen in Version 5.8.4 \& perl583delta Perl-Änderungen in Version 5.8.3 \& perl582delta Perl-Änderungen in version 5.8.2 \& perl581delta Perl-Änderungen in Version 5.8.1 \& perl58delta Perl-Änderungen in Version 5.8.0 \& perl561delta Perl-Änderungen in Version 5.6.1 \& perl56delta Perl-Änderungen in Version 5.6 \& perl5005delta Perl-Änderungen in Version 5.005 \& perl5004delta Perl-Änderungen in Version 5.004 \&

source: \& perlbook Perl book information \& perlcommunity Perl community information \& \& perldoc Look up Perl documentation in Pod format \& \& perlexperiment A listing of experimental features in Perl \& \& perlartistic Perl Artistic License \& perlgpl GNU General Public License
de: \& perlbook Perl-Buch-Informationen \& perlcommunity Perl-Gemeinschafts-Informationen \& \& perldoc Perl-Dokumentation im Pod-Format nachschlagen \& \& perlexperiment Eine Liste von experimentellen Funktionalitäten in Perl \& \& perlartistic Perl Artistic Lizenz \& perlgpl GNU General Public Lizenz

source: \& perlcn Perl for Simplified Chinese (in UTF-8) \& perljp Perl for Japanese (in EUC-JP) \& perlko Perl for Korean (in EUC-KR) \& perltw Perl for Traditional Chinese (in Big5)
de: \& perlcn Perl für vereinfachtes Chinesisch (in UTF-8) \& perljp Perl für Japanisch (in EUC-JP) \& perlko Perl für Koreanisch (in EUC-KR) \& perltw Perl für traditionelles Chinesisch (in Big5)
