Repository: sebras/manpages-l10n
Catalog: po/*/man1/perl.1.po
Languages: de

source: Perl Programmers Reference Guide
de: Perl-Referenzanleitung für Programmierer

source: NAME
de: BEZEICHNUNG

source: perl - The Perl 5 language interpreter
de: perl - Der Perl-5-Sprachinterpreter

source: SYNOPSIS
de: ÜBERSICHT

source: \&B<perl> [\ B<-sTtuUWX>\ ] [\ B<-hv>\ ]\ [\ B<-V>[:I<configvar>]\ ] [\ B<-cw>\ ]\ [\ B<-d>[B<t>][:I<debugger>]\ ]\ [\ B<-D>[I<number/list>]\ ] [\ B<-pna>\ ]\ [\ B<-F>I<pattern>\ ]\ [\ B<-l>[I<octal>]\ ]\ [\ B<-0>[I<octal/hexadecimal>]\ ] [\ B<-I>I<dir>\ ]\ [\ B<-m>[B<->]I<module>\ ]\ [\ B<-M>[B<->]I<'module...'>\ ]\ [\ B<-f>\ ] [\ B<-C\ [>\f(BInumber/listB<]\ >] [\ B<-S>\ ] [\ B<-x>[I<dir>]\ ] [\ B<-i>[I<extension>]\ ] [\ [B<-e>|B<-E>]\ I<'command'>\ ]\ [\ B<-->\ ]\ [\ I<programfile>\ ]\ [\ I<argument>\ ]...
de: \&B<perl> [\ B<-sTtuUWX>\ ] [\ B<-hv>\ ]\ [\ B<-V>[:I<Konfigvar>]\ ] [\ B<-cw>\ ]\ [\ B<-d>[B<t>][:I<Debugger>]\ ]\ [\ B<-D>[I<Nummer/Liste>]\ ] [\ B<-pna>\ ]\ [\ B<-F>I<Muster>\ ]\ [\ B<-l>[I<oktal>]\ ]\ [\ B<-0>[I<oktal/hexadezimal>]\ ] [\ B<-I>I<Verz>\ ]\ [\ B<-m>[B<->]I<Modul>\ ]\ [\ B<-M>[B<->]I<'Modul…'>\ ]\ [\ B<-f>\ ] [\ B<-C\ [>\f(BINummer/ListeB<]\ >] [\ B<-S>\ ] [\ B<-x>[I<Verz>]\ ] [\ B<-i>[I<Erweiterung>]\ ] [\ [B<-e>|B<-E>]\ I<'Befehl'>\ ]\ [\ B<-->\ ]\ [\ I<Programmdatei>\ ]\ [\ I<Argument>\ ]…

source: For more information on these options, you can run CW<\*(C`perldoc perlrun\*(C'>.
de: Für weitere Informationen über diese Optionen können Sie CW<\*(C`perldoc perlrun\*(C'> ausführen.

source: GETTING HELP
de: HILFE ERHALTEN

source: The I<perldoc> program gives you access to all the documentation that comes with Perl. You can get more documentation, tutorials and community support online at E<lt>https://www.perl.org/E<gt>.
de: Das Programm B<perldoc>(1) gibt Ihnen auf die gesamte Dokumentation Zugriff, die mit Perl kommt. Sie können weitere Dokumentation, Anleitungen und Hilfe aus der Gemeinschaft online unter E<lt>https://www.perl.org/E<gt> erhalten.

source: If you're new to Perl, you should start by running CW<\*(C`perldoc perlintro\*(C'>, which is a general intro for beginners and provides some background to help you navigate the rest of Perl's extensive documentation. Run CW<\*(C`perldoc perldoc\*(C'> to learn more things you can do with I<perldoc>.
de: Falls Sie bei Perl neu dabei sind, sollten Sie am Anfang CW<\*(C`perldoc perlintro\*(C'> ausführen. Hier finden Sie eine allgemeine Einführung für Anfänger und es werden Hintergrundinformationen bereitgestellt, um Ihnen beim Navigieren durch die restliche ausführliche Dokumentation von Perl zu helfen. Führen Sie CW<\*(C`perldoc perldoc\*(C'> aus, um mehr darüber zu erfahren, was Sie mit B<perldoc>(1) machen können.

source: For ease of access, the Perl manual has been split up into several sections.
de: Um den Zugriff zu erleichtern, wurde das Perl-Handbuch in mehrere Abschnitte aufgeteilt.

source: Overview
de: Überblick

source: \& perl Perl overview (this section) \& perlintro Perl introduction for beginners \& perlrun Perl execution and options \& perltoc Perl documentation table of contents
de: \& perl Perl-Überblick (dieser Abschnitt) \& perlintro Perl-Einführung für Anfänger \& perlrun Perl-Ausführung und Optionen \& perltoc Inhaltsverzeichnis der Perl-Dokumentation

source: Tutorials
de: Anleitungen

source: \& perlreftut Perl references short introduction \& perldsc Perl data structures intro \& perllol Perl data structures: arrays of arrays \& \& perlrequick Perl regular expressions quick start \& perlretut Perl regular expressions tutorial \& \& perlootut Perl OO tutorial for beginners \& \& perlperf Perl Performance and Optimization Techniques \& \& perlstyle Perl style guide \& \& perlcheat Perl cheat sheet \& perltrap Perl traps for the unwary \& perldebtut Perl debugging tutorial \& \& perlfaq Perl frequently asked questions \& perlfaq1 General Questions About Perl \& perlfaq2 Obtaining and Learning about Perl \& perlfaq3 Programming Tools \& perlfaq4 Data Manipulation \& perlfaq5 Files and Formats \& perlfaq6 Regexes \& perlfaq7 Perl Language Issues \& perlfaq8 System Interaction \& perlfaq9 Networking
de: \& perlreftut Perl Referenzen - kurze Einführung \& perldsc Perl Datenstrukturen: Einleitung \& perllol Perl Datenstrukturen: Felder von Feldern \& \& perlrequick Perl regulär Ausdrücke: Schnellstart \& perlretut Perl reguläre Ausdrücke: Anleitung \& \& perlootut Perl OO-Anleitung für Anfänger \& \& perlperf Perl-Leistung- und Optimierungstechniken \& \& perlstyle Perl Stil-Anleitung \& \& perlcheat Perl Schummelseite \& perltrap Perl Fallen für die Unaufmerksamen \& perldebtut Perl Fehlersuch-Anleitung \& \& perlfaq Perl häufig gestellte Fragen \& perlfaq1 Allgemeine Fragen über Perl \& perlfaq2 Finden von und Lernen über Perl \& perlfaq3 Programmierwerkzeuge \& perlfaq4 Datenbearbeitung \& perlfaq5 Dateien und Formate \& perlfaq6 Reguläre Ausdrücke \& perlfaq7 Perl-Sprachprobleme \& perlfaq8 System-Interaktion \& perlfaq9 Vernetzung

source: Reference Manual
de: Referenzhandbuch

source: \& perlsyn Perl syntax \& perldata Perl data structures \& perlop Perl operators and precedence \& perlsub Perl subroutines \& perlfunc Perl built-in functions \& perlopentut Perl open() tutorial \& perlpacktut Perl pack() and unpack() tutorial \& perlpod Perl plain old documentation \& perlpodspec Perl plain old documentation format specification \& perlpodstyle Perl POD style guide \& perldiag Perl diagnostic messages \& perldeprecation Perl deprecations \& perllexwarn Perl warnings and their control \& perldebug Perl debugging \& perlvar Perl predefined variables \& perlre Perl regular expressions, the rest of the story \& perlrebackslash Perl regular expression backslash sequences \& perlrecharclass Perl regular expression character classes \& perlreref Perl regular expressions quick reference \& perlref Perl references, the rest of the story \& perlform Perl formats \& perlobj Perl objects \& perltie Perl objects hidden behind simple variables \& perldbmfilter Perl DBM filters \& \& perlipc Perl interprocess communication \& perlfork Perl fork() information \& perlnumber Perl number semantics \& \& perlthrtut Perl threads tutorial \& \& perlport Perl portability guide \& perllocale Perl locale support \& perluniintro Perl Unicode introduction \& perlunicode Perl Unicode support \& perlunicook Perl Unicode cookbook \& perlunifaq Perl Unicode FAQ \& perluniprops Index of Unicode properties in Perl \& perlunitut Perl Unicode tutorial \& perlebcdic Considerations for running Perl on EBCDIC platforms \& \& perlsec Perl security \& perlsecpolicy Perl security report handling policy \& \& perlmod Perl modules: how they work \& perlmodlib Perl modules: how to write and use \& perlmodstyle Perl modules: how to write modules with style \& perlmodinstall Perl modules: how to install from CPAN \& perlnewmod Perl modules: preparing a new module for distribution \& perlpragma Perl modules: writing a user pragma \& \& perlutil utilities packaged with the Perl distribution \& \& perlfilter Perl source filters \& \& perldtrace Perl\*(Aqs support for DTrace \& \& perlglossary Perl Glossary
de: \& perlsyn Perl Syntax \& perldata Perl Datenstrukturen \& perlop Perl Operatoren und Vorrang \& perlsub Perl Subroutinen \& perlfunc Perl eingebaute Funktionen \& perlopentut Perl open()-Anleitung \& perlpacktut Perl pack()- und unpack()-Anleitung \& perlpod Perl einfache altertümliche Dokumentation \& perlpodspec Perl einfache altertümliche Dokumentation: Formatspezifikation \& perlpodstyle Perl POD-Stilanleitung \& perldiag Perl Diagnosemeldungen \& perldeprecation Perl-Missbilligungen \& perllexwarn Perl-Warnungen und ihre Steuerung \& perldebug Perl-Fehlersuche \& perlvar Perl vordefinierte Variablen \& perlre Perl reguläre Ausdrücke, der Rest der Geschichte \& perlrebackslash Perl reguläre Ausdrücke: Rückwärtsschrägstrich-Sequenzen \& perlrecharclass Perl reguläre Ausdrücke: Zeichenklassen \& perlreref Perl reguläre Ausdrücke: Schnellreferenz \& perlref Perl-Referenzen, der Rest der Geschichte \& perlform Perl-Formate \& perlobj Perl-Objekte \& perltie Perl-Objekte, die hinter einfachen Variablen versteckt sind \& perldbmfilter Perl DBM-Filter \& \& perlipc Perl Interprozesskommunikation \& perlfork Perl fork()-Information \& perlnumber Perl Zahlensemantik \& \& perlthrtut Perl Threads-Anleitung \& \& perlport Perl Portabilitätsanleitung \& perllocale Perl Locale-Unterstützung \& perluniintro Perl Unicode-Einleitung \& perlunicode Perl Unicode-Unterstützung \& perlunicook Perl Unicode-Kochbuch \& perlunifaq Perl Unicode FAQ \& perluniprops Index der Unicode-Eigenschaften in Perl \& perlunitut Perl Unicode-Anleitung \& perlebcdic Erörterungen zur Ausführung von Perl auf EBCDIC-Plattformen \& \& perlsec Perl-Sicherheit \& perlsecpolicy Perl Handhabung von Sicherheitsmeldungen \& \& perlmod Perl Module: wie sie funktionieren \& perlmodlib Perl Module: wie sie zu schreiben und verwenden sind \& perlmodstyle Perl Module: wie Module mit Stil zu schreiben sind \& perlmodinstall Perl Module: wie sie von CPAN zu installieren sind \& perlnewmod Perl Module: Vorbereitung eines Modules zum Vertrieb \& perlpragma Perl Module: Schreiben eines Benutzer-Pragmas \& \& perlutil Hilfswerkzeuge, die mit der Perl-Distribution paketiert sind \& \& perlfilter Perl-Quellcode-Filter \& \& perldtrace Perls Unterstützung für DTrace \& \& perlglossary Perl Glossar

source: Internals and C Language Interface
de: Interna und C-Sprachschnittstelle

source: \& perlembed Perl ways to embed perl in your C or C++ application \& perldebguts Perl debugging guts and tips \& perlxstut Perl XS tutorial \& perlxs Perl XS application programming interface \& perlxstypemap Perl XS C/Perl type conversion tools \& perlclib Internal replacements for standard C library functions \& perlguts Perl internal functions for those doing extensions \& perlcall Perl calling conventions from C \& perlmroapi Perl method resolution plugin interface \& perlreapi Perl regular expression plugin interface \& perlreguts Perl regular expression engine internals \& \& perlapi Perl API listing (autogenerated) \& perlintern Perl internal functions (autogenerated) \& perliol C API for Perl\*(Aqs implementation of IO in Layers \& perlapio Perl internal IO abstraction interface \& \& perlhack Perl hackers guide \& perlsource Guide to the Perl source tree \& perlinterp Overview of the Perl interpreter source and how it works \& perlhacktut Walk through the creation of a simple C code patch \& perlhacktips Tips for Perl core C code hacking \& perlpolicy Perl development policies \& perlgov Perl Rules of Governance \& perlgit Using git with the Perl repository
de: \& perlembed Perl-Wege, um Perl in Ihre C- oder C++-Anwendung einzubetten \& perldebguts Perl-Fehlersuche Tipps und Tricks \& perlxstut Perl XS-Anleitung \& perlxs Perl XS-Anwendungs-Programmierschnittstelle \& perlxstypemap Perl XS C/Perl type conversion tools \& perlclib Internal replacements for standard C-Bibliotheksfunktionen \& perlguts Perl-interne Funktionen für alle, die Erweiterungen erstellen \& perlcall Perl Aufrufkonvention aus C \& perlmroapi Perl-Methoden-Auflösungs-Erweiterungs-Schnittstelle \& perlreapi Perl reguläre Ausdrücke: Erweiterungsschnittstelle \& perlreguts Perl Interna der regulären Ausdruck-Maschine \& \& perlapi Perl API-Auflistung (automatisch erstellt) \& perlintern Perl-interne Funktionen (automatisch erstellt) \& perliol C-API für Perl\*(Aqs Implementierung von E/A in Layern \& perlapio Perl-interne E/A-Abstrahierungsschnittstelle \& \& perlhack Perl-Hacker-Anleitung \& perlsource Anleitung für den Perl-Quellbaum \& perlinterp Überblick über die Quellen des Perl-Interpreters und wie er funktioniert \& perlhacktut Durchlauf durch die Erstellung eines einfachen C-Code-Patches \& perlhacktips Tipps zum Code-Hacking des Perl-Kerns \& perlpolicy Perl Entwicklungsrichtlinien \& perlgov Perl-Regeln der Projektsteuerung \& perlgit Verwendung von Git mit dem Perl-Depot

source: Miscellaneous
de: Verschiedenes

source: \& perlbook Perl book information \& perlcommunity Perl community information \& \& perldoc Look up Perl documentation in Pod format \& \& perlhist Perl history records \& perldelta Perl changes since previous version \& perl5320delta Perl changes in version 5.32.0 \& perl5303delta Perl changes in version 5.30.3 \& perl5302delta Perl changes in version 5.30.2 \& perl5301delta Perl changes in version 5.30.1 \& perl5300delta Perl changes in version 5.30.0 \& perl5283delta Perl changes in version 5.28.3 \& perl5282delta Perl changes in version 5.28.2 \& perl5281delta Perl changes in version 5.28.1 \& perl5280delta Perl changes in version 5.28.0 \& perl5263delta Perl changes in version 5.26.3 \& perl5262delta Perl changes in version 5.26.2 \& perl5261delta Perl changes in version 5.26.1 \& perl5260delta Perl changes in version 5.26.0 \& perl5244delta Perl changes in version 5.24.4 \& perl5243delta Perl changes in version 5.24.3 \& perl5242delta Perl changes in version 5.24.2 \& perl5241delta Perl changes in version 5.24.1 \& perl5240delta Perl changes in version 5.24.0 \& perl5224delta Perl changes in version 5.22.4 \& perl5223delta Perl changes in version 5.22.3 \& perl5222delta Perl changes in version 5.22.2 \& perl5221delta Perl changes in version 5.22.1 \& perl5220delta Perl changes in version 5.22.0 \& perl5203delta Perl changes in version 5.20.3 \& perl5202delta Perl changes in version 5.20.2 \& perl5201delta Perl changes in version 5.20.1 \& perl5200delta Perl changes in version 5.20.0 \& perl5184delta Perl changes in version 5.18.4 \& perl5182delta Perl changes in version 5.18.2 \& perl5181delta Perl changes in version 5.18.1 \& perl5180delta Perl changes in version 5.18.0 \& perl5163delta Perl changes in version 5.16.3 \& perl5162delta Perl changes in version 5.16.2 \& perl5161delta Perl changes in version 5.16.1 \& perl5160delta Perl changes in version 5.16.0 \& perl5144delta Perl changes in version 5.14.4 \& perl5143delta Perl changes in version 5.14.3 \& perl5142delta Perl changes in version 5.14.2 \& perl5141delta Perl changes in version 5.14.1 \& perl5140delta Perl changes in version 5.14.0 \& perl5125delta Perl changes in version 5.12.5 \& perl5124delta Perl changes in version 5.12.4 \& perl5123delta Perl changes in version 5.12.3 \& perl5122delta Perl changes in version 5.12.2 \& perl5121delta Perl changes in version 5.12.1 \& perl5120delta Perl changes in version 5.12.0 \& perl5101delta Perl changes in version 5.10.1 \& perl5100delta Perl changes in version 5.10.0 \& perl589delta Perl changes in version 5.8.9 \& perl588delta Perl changes in version 5.8.8 \& perl587delta Perl changes in version 5.8.7 \& perl586delta Perl changes in version 5.8.6 \& perl585delta Perl changes in version 5.8.5 \& perl584delta Perl changes in version 5.8.4 \& perl583delta Perl changes in version 5.8.3 \& perl582delta Perl changes in version 5.8.2 \& perl581delta Perl changes in version 5.8.1 \& perl58delta Perl changes in version 5.8.0 \& perl561delta Perl changes in version 5.6.1 \& perl56delta Perl changes in version 5.6 \& perl5005delta Perl changes in version 5.005 \& perl5004delta Perl changes in version 5.004 \& \& perlexperiment A listing of experimental features in Perl \& \& perlartistic Perl Artistic License \& perlgpl GNU General Public License
de: \& perlbook Perl-Buch-Informationen \& perlcommunity Perl-Gemeinschafts-Informationen \& \& perldoc Perl-Dokumentation im Pod-Format nachschlagen \& \& perlhist Perl-Geschichtsblätter \& perldelta Perl-Änderungen seit vorherigen Versionen \& perl5320delta Perl-Änderungen in Version 5.32.0 \& perl5303delta Perl-Änderungen in Version 5.30.3 \& perl5302delta Perl-Änderungen in Version 5.30.2 \& perl5301delta Perl-Änderungen in Version 5.30.1 \& perl5300delta Perl-Änderungen in Version 5.30.0 \& perl5283delta Perl-Änderungen in Version 5.28.3 \& perl5282delta Perl-Änderungen in Version 5.28.2 \& perl5281delta Perl-Änderungen in Version 5.28.1 \& perl5280delta Perl-Änderungen in Version 5.28.0 \& perl5263delta Perl-Änderungen in Version 5.26.3 \& perl5262delta Perl-Änderungen in Version 5.26.2 \& perl5261delta Perl-Änderungen in Version 5.26.1 \& perl5260delta Perl-Änderungen in Version 5.26.0 \& perl5244delta Perl-Änderungen in Version 5.24.4 \& perl5243delta Perl-Änderungen in Version 5.24.3 \& perl5242delta Perl-Änderungen in Version 5.24.2 \& perl5241delta Perl-Änderungen in Version 5.24.1 \& perl5240delta Perl-Änderungen in Version 5.24.0 \& perl5224delta Perl-Änderungen in Version 5.22.4 \& perl5223delta Perl-Änderungen in Version 5.22.3 \& perl5222delta Perl-Änderungen in Version 5.22.2 \& perl5221delta Perl-Änderungen in Version 5.22.1 \& perl5220delta Perl-Änderungen in Version 5.22.0 \& perl5203delta Perl-Änderungen in Version 5.20.3 \& perl5202delta Perl-Änderungen in Version 5.20.2 \& perl5201delta Perl-Änderungen in Version 5.20.1 \& perl5200delta Perl-Änderungen in Version 5.20.0 \& perl5184delta Perl-Änderungen in Version 5.18.4 \& perl5182delta Perl-Änderungen in Version 5.18.2 \& perl5181delta Perl-Änderungen in Version 5.18.1 \& perl5180delta Perl-Änderungen in Version 5.18.0 \& perl5163delta Perl-Änderungen in Version 5.16.3 \& perl5162delta Perl-Änderungen in Version 5.16.2 \& perl5161delta Perl-Änderungen in Version 5.16.1 \& perl5160delta Perl-Änderungen in Version 5.16.0 \& perl5144delta Perl-Änderungen in Version 5.14.4 \& perl5143delta Perl-Änderungen in Version 5.14.3 \& perl5142delta Perl-Änderungen in Version 5.14.2 \& perl5141delta Perl-Änderungen in Version 5.14.1 \& perl5140delta Perl-Änderungen in Version 5.14.0 \& perl5125delta Perl-Änderungen in Version 5.12.5 \& perl5124delta Perl-Änderungen in Version 5.12.4 \& perl5123delta Perl-Änderungen in Version 5.12.3 \& perl5122delta Perl-Änderungen in Version 5.12.2 \& perl5121delta Perl-Änderungen in Version 5.12.1 \& perl5120delta Perl-Änderungen in Version 5.12.0 \& perl5101delta Perl-Änderungen in Version 5.10.1 \& perl5100delta Perl-Änderungen in Version 5.10.0 \& perl589delta Perl-Änderungen in Version 5.8.9 \& perl588delta Perl-Änderungen in Version 5.8.8 \& perl587delta Perl-Änderungen in Version 5.8.7 \& perl586delta Perl-Änderungen in Version 5.8.6 \& perl585delta Perl-Änderungen in Version 5.8.5 \& perl584delta Perl-Änderungen in Version 5.8.4 \& perl583delta Perl-Änderungen in Version 5.8.3 \& perl582delta Perl-Änderungen in version 5.8.2 \& perl581delta Perl-Änderungen in Version 5.8.1 \& perl58delta Perl-Änderungen in Version 5.8.0 \& perl561delta Perl-Änderungen in Version 5.6.1 \& perl56delta Perl-Änderungen in Version 5.6 \& perl5005delta Perl-Änderungen in Version 5.005 \& perl5004delta Perl-Änderungen in Version 5.004 \& \& perlexperiment Eine Liste von experimentellen Funktionalitäten in Perl \& \& perlartistic Perl Artistic Lizenz \& perlgpl GNU General Public Lizenz

source: Language-Specific
de: Sprach-Spezifika

source: \& perlcn Perl for Simplified Chinese (in EUC-CN) \& perljp Perl for Japanese (in EUC-JP) \& perlko Perl for Korean (in EUC-KR) \& perltw Perl for Traditional Chinese (in Big5)
de: \& perlcn Perl für vereinfachtes Chinesisch (in EUC-CN) \& perljp Perl für Japanisch (in EUC-JP) \& perlko Perl für Koreanisch (in EUC-KR) \& perltw Perl für traditionelles Chinesisch (in Big5)

source: Platform-Specific
de: Plattform-Spezifika

source: \& perlaix Perl notes for AIX \& perlamiga Perl notes for AmigaOS \& perlandroid Perl notes for Android \& perlbs2000 Perl notes for POSIX-BC BS2000 \& perlcygwin Perl notes for Cygwin \& perldos Perl notes for DOS \& perlfreebsd Perl notes for FreeBSD \& perlhaiku Perl notes for Haiku \& perlhpux Perl notes for HP-UX \& perlhurd Perl notes for Hurd \& perlirix Perl notes for Irix \& perllinux Perl notes for Linux \& perlmacos Perl notes for Mac OS (Classic) \& perlmacosx Perl notes for Mac OS X \& perlnetware Perl notes for NetWare \& perlopenbsd Perl notes for OpenBSD \& perlos2 Perl notes for OS/2 \& perlos390 Perl notes for OS/390 \& perlos400 Perl notes for OS/400 \& perlplan9 Perl notes for Plan 9 \& perlqnx Perl notes for QNX \& perlriscos Perl notes for RISC OS \& perlsolaris Perl notes for Solaris \& perlsymbian Perl notes for Symbian \& perlsynology Perl notes for Synology \& perltru64 Perl notes for Tru64 \& perlvms Perl notes for VMS \& perlvos Perl notes for Stratus VOS \& perlwin32 Perl notes for Windows
de: \& perlaix Perl Hinweise für AIX \& perlamiga Perl Hinweise für AmigaOS \& perlandroid Perl Hinweise für Android \& perlbs2000 Perl Hinweise für POSIX-BC BS2000 \& perlcygwin Perl Hinweise für Cygwin \& perldos Perl Hinweise für DOS \& perlfreebsd Perl Hinweise für FreeBSD \& perlhaiku Perl Hinweise für Haiku \& perlhpux Perl Hinweise für HP-UX \& perlhurd Perl Hinweise für Hurd \& perlirix Perl Hinweise für Irix \& perllinux Perl Hinweise für Linux \& perlmacos Perl Hinweise für Mac OS (Classic) \& perlmacosx Perl Hinweise für Mac OS X \& perlnetware Perl Hinweise für NetWare \& perlopenbsd Perl Hinweise für OpenBSD \& perlos2 Perl Hinweise für OS/2 \& perlos390 Perl Hinweise für OS/390 \& perlos400 Perl Hinweise für OS/400 \& perlplan9 Perl Hinweise für Plan 9 \& perlqnx Perl Hinweise für QNX \& perlriscos Perl Hinweise für RISC OS \& perlsolaris Perl Hinweise für Solaris \& perlsymbian Perl Hinweise für Symbian \& perlsynology Perl Hinweise für Synology \& perltru64 Perl Hinweise für Tru64 \& perlvms Perl Hinweise für VMS \& perlvos Perl Hinweise für Stratus VOS \& perlwin32 Perl Hinweise für Windows

source: Stubs for Deleted Documents
de: Stümpfe für gelöschte Dokumente

source: On Debian systems, you need to install the B<perl-doc> package which contains the majority of the standard Perl documentation and the \&I<perldoc> program.
de: Auf Debian-Systemen müssen Sie das Paket B<perl-doc> installieren, das den Großteil der Standard-Perl-Dokumentation und das Programm B<perldoc>(1) enthält.

source: Extensive additional documentation for Perl modules is available, both those distributed with Perl and third-party modules which are packaged or locally installed.
de: Es ist eine ausführliche zusätzliche Dokumentation für Perl-Module verfügbar, sowohl von denen mit Perl vertriebenen als auch von denen Dritter, die paketiert oder lokal installiert sind.

source: You should be able to view Perl's documentation with your B<man>\|(1) program or B<perldoc>\|(1).
de: Sie sollten die Perl-Dokumentation mit Ihrem Programm B<man>\|(1) oder B<perldoc>\|(1) betrachten können.

source: Some documentation is not available as man pages, so if a cross-reference is not found by man, try it with perldoc. Perldoc can also take you directly to documentation for functions (with the B<-f> switch). See CW<\*(C`perldoc --help\*(C'> (or CW<\*(C`perldoc perldoc\*(C'> or CW<\*(C`man perldoc\*(C'>) for other helpful options perldoc has to offer.
de: Ein Teil der Dokumentation ist nicht als Handbuchseite verfügbar. Falls daher eine Kreuzreferenz von B<man>(1) nicht gefunden wird, versuchen Sie es mit B<perldoc>(1). Perldoc kann Sie auch direkt zur Dokumentationen für Funktionen bringen (mit dem Schalter B<-f>). Siehe CW<\*(C`perldoc --help\*(C'> (oder CW<\*(C`perldoc perldoc\*(C'> oder CW<\*(C`man perldoc\*(C'>) für weiter hilfreiche Optionen im Angebot.

source: In general, if something strange has gone wrong with your program and you're not sure where you should look for help, try making your code comply with \&B<use strict> and B<use warnings>. These will often point out exactly where the trouble is.
de: Im Allgemeinen gilt: Wenn etwas merkwürdiges mit Ihrem Programm schief gelaufen ist und Sie nicht wissen, wo Sie nach Hilfe suchen sollen, dann sollten Sie Ihren Code so anpassen, dass er \&B<use strict> und B<use warnings> erfüllt. Diese weisen oft darauf hin, wo genau das Problem liegt.

source: DESCRIPTION
de: BESCHREIBUNG
