Repository: sebras/manpages-l10n
Catalog: po/*/man1/pinky.1.po
Languages: sv

source: User Commands
sv: Användarkommandon

source: NAME
sv: NAMN

source: B<pinky> [I<\,OPTION\/>]... [I<\,USER\/>]...
sv: B<pinky> [I<\,FLAGGA\/>]... [I<\,ANVÄNDARE\/>]...

source: DESCRIPTION
sv: BESKRIVNING

source: produce long format output for the specified USERs
sv: Skriv ut i långt format för den angivna ANVÄNDAREn.

source: omit the user's home directory and shell in long format
sv: Utelämna användarens hemkatalog och skal i det långa formatet.

source: omit the user's project file in long format
sv: Utelämna användarens projektfil i det långa formatet.

source: omit the user's plan file in long format
sv: Utelämna användarens planfil i det långa formatet.

source: do short format output, this is the default
sv: Skriv ut i kort format, detta är standard.

source: omit the line of column headings in short format
sv: Utelämna raden med kolumnrubriker i kort format.

source: omit the user's full name in short format
sv: Utelämna användarens fullständiga namn i kort format.

source: omit the user's full name and remote host in short format
sv: Utelämna användarens fullständiga namn och fjärrvärd i kort format.

source: omit the user's full name, remote host and idle time in short format
sv: Utelämna användarens fullständiga namn, fjärrvärd och overksamma tiden i kort format.

source: display this help and exit
sv: Visa denna hjälp och avsluta.

source: output version information and exit
sv: Visa versionsinformation och avsluta.

source: A lightweight 'finger' program; print user information. The utmp file will be I<\,/var/run/utmp\/>.
sv: Ett lättviktigt ”finger”-program; skriver ut användarinformation. utmp-filen kommer att vara I<\,/var/run/utmp\/>.

source: AUTHOR
sv: UPPHOVSMAN

source: Written by Joseph Arceneaux, David MacKenzie, and Kaveh Ghazi.
sv: Skrivet av Joseph Arceneaux, David MacKenzie och Kaveh Ghazi.

source: REPORTING BUGS
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/pinkyE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/pinkyE<gt>

source: or available locally via: info \(aq(coreutils) pinky invocation\(aq
sv: eller tillgängligt lokalt via: info \(aq(coreutils) pinky invocation\(aq

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
sv: augusti 2022

source: A lightweight 'finger' program; print user information. The utmp file will be I<\,/run/utmp\/>.
sv: Ett lättviktigt ”finger”-program; skriver ut användarinformation. utmp-filen kommer att vara I<\,/run/utmp\/>.

source: October 2021
sv: oktober 2021
