Repository: sebras/manpages-l10n
Catalog: po/*/man1/pr.1.po
Languages: es, hu, sr, sv

source: April 2022
es: Abril de 2022
hu: 2022 április
sr: Априла 2022

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: User Commands
es: Órdenes de usuario
hu: Felhasználói parancsok
sr: Корисничке наредбе
sv: Användarkommandon

source: NAME
es: NOMBRE
hu: NÉV
sr: НАЗИВ
sv: NAMN

source: SYNOPSIS
es: SINOPSIS
hu: ÖSSZEGZÉS
sr: УВОД

source: B<pr> [I<\,OPTION\/>]... [I<\,FILE\/>]...
es: B<pr> [I<\,OPCIÓN\/>]... [I<\,FICHERO\/>]...
hu: B<pr> [I<\,KAPCSOLÓ\/>]... [I<\,FÁJL\/>]...
sr: B<pr> [I<\,ОПЦИЈА\/>]... [I<\,ДАТОТЕКА\/>]...
sv: B<pr> [I<\,FLAGGA\/>]... [I<\,FIL\/>]...

source: DESCRIPTION
es: DESCRIPCIÓN
hu: LEÍRÁS
sr: ОПИС
sv: BESKRIVNING

source: Paginate or columnate FILE(s) for printing.
es: Pagina o encolumna FICHERO(s) para su impresión.
hu: A FÁJLOK oldalakra tördelése vagy oszlopokba rendezése nyomtatáshoz.
sr: Спрема ДАТОТЕКУ(Е) као странице или ступце за исписивање.
sv: Paginera eller skapa kolumner av FIL(er) för utskrift.

source: With no FILE, or when FILE is -, read standard input.
es: Si no se define ningún ARCHIVO o bien se indica '-', se lee la entrada estándar.
hu: Ha a FÁJL nincs megadva, vagy -, akkor a szabványos bemenetet olvassa.
sr: Без ДАТОТЕКЕ, или када је ДАТОТЕКА -, чита стандардни улаз.
sv: Utan FIL, eller när FIL är -, läs standard in.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.

source: +FIRST_PAGE[:LAST_PAGE], B<--pages>=I<\,FIRST_PAGE[\/>:LAST_PAGE]
es: +PRIMERA_PAGINA[:ÚLTIMA_PAGINA], B<--pages>=I<\,PRIMERA_PAGINA[\/>:ÚLTIMA_PAGINA]
hu: +ELSŐ_OLDAL[:UTOLSÓ_OLDAL], B<--pages>=I<\,ELSŐ_OLDAL[\/>:UTOLSÓ_OLDAL]
sr: +ПРВА_СТРАНИЦА[:ПОСЛЕДЊА_СТРАНИЦА], B<--pages>=I<\,ПРВА_СТРАНИЦА[\/>:ПОСЛЕДЊА_СТРАНИЦА]
sv: +FÖRSTA_SIDA[:SISTA_SIDA], B<--pages>=I<\,FÖRSTA_SIDA[\/>:SISTA_SIDA]

source: begin [stop] printing with page FIRST_[LAST_]PAGE
es: comienza [termina] a imprimir por PRIMERA_[ÚLTIMA_]PÁGINA
hu: a nyomtatás elkezdése [befejezése] az ELSŐ_[UTOLSÓ]_OLDALON
sr: почиње [зауставља] исписивање страницом ПРВА_[ПОСЛЕДЊА_]СТРАНИЦА
sv: Börja [sluta] skriva vid sida FÖRSTA_[SISTA_]SIDA.

source: B<-COLUMN>, B<--columns>=I<\,COLUMN\/>
es: B<-COLUMNAS>, B<--columns>=I<\,COLUMNAS\/>
hu: B<-OSZLOP>, B<--columns>=I<\,OSZLOP\/>
sr: B<-СТУБАЦ>, B<--columns>=I<\,СТУБАЦ\/>
sv: B<-KOLUMN>, B<--columns>=I<\,KOLUMN\/>

source: output COLUMN columns and print columns down, unless B<-a> is used. Balance number of lines in the columns on each page
es: muestra una salida en COLUMNAS columnas e imprime las columnas, a menos que se especifique B<-a>. Equilibra el número de líneas de cada columna en cada página
hu: OSZLOP darab oszlop előállítása és az oszlopok nyomtatása, lefelé, hacsak a -a nincs megadva. A sorok számának kiegyensúlyozása az oszlopokban minden egyes oldalon.
sr: исписује СТУБАЦ стубаца и исписује ступце, осим ако се не користи B<-a>. Уравнотежава број редова у ступцима на свакој страници
sv: Skapa KOLUMN kolumner och skriv kolumner nedåt, om inte B<-a> används. Balansera antalet rader i kolumnerna på varje sida.

source: print columns across rather than down, used together with B<-COLUMN>
es: crea las columnas transversalmente en lugar de en paralelo, se utiliza junto con B<-COLUMNAS>
hu: oszlopok kiírása vízszintesen és nem függőlegesen, a B<-OSZLOP> kapcsolóval együtt használatos
sr: исписује ступце унакрст уместо доле, користи се заједно са B<-СТУБАЦ>
sv: Skriv kolumner på tvären i stället för nedåt, används tillsammans med B<-KOLUMN>.

source: use hat notation (^G) and octal backslash notation
es: muestra los caracteres de control con notación gorro (^G) o secuencias de escape octales
hu: kalapos (^G) és oktális visszaper jelölés használata
sr: користи назначавање капицом (^G) и октално назначавање контра косом цртом
sv: Använd hattnotation (^G) och oktal notation med omvänt snedstreck.

source: double space the output
es: salida con espaciado doble
hu: a kimenet dupla kitöltése
sr: удвостручава простор излаза
sv: Skriv ut med dubbelt radavstånd.

source: B<-D>, B<--date-format>=I<\,FORMAT\/>
es: B<-D>, B<--date-format>=I<\,FORMATO\/>
hu: B<-D>, B<--date-format>=I<\,FORMÁTUM\/>
sr: B<-D>, B<--date-format>=I<\,ЗАПИС\/>

source: use FORMAT for the header date
es: utiliza FORMATO para la fecha de la cabecera
hu: a FORMÁTUM használata a fejléc dátumához
sr: користи ЗАПИС за датум заглавља
sv: Använd FORMAT för huvuddatum.

source: B<-e[CHAR[WIDTH]]>, B<--expand-tabs>[=I<\,CHAR[WIDTH]\/>]
es: B<-e[CARÁCTER[ANCHO]]>, B<--expand-tabs>[=I<\,CARÁCTER[ANCHO]\/>]
hu: B<-e[KAR[SZÉLESSÉG]]>, B<--expand-tabs>[=I<\,KAR[SZÉLESSÉG]\/>]
sr: B<-e[ЗНАК[ШИРИНА]]>, B<--expand-tabs>[=I<\,ЗНАК[ШИРИНА]\/>]
sv: B<-e[TECKEN[BREDD]]>, B<--expand-tabs>[=I<\,TECKEN[BREDD]\/>]

source: expand input CHARs (TABs) to tab WIDTH (8)
es: sustituye el carácter de tabulación (o el CARÁCTER) por ANCHO (8) espacios
hu: a bemeneti KARAKTEREK (TAB-ok) kiterjesztése a tab SZÉLESSÉGÉRE (8)
sr: проширује улазни(е) ЗНАК(е) (ТАБУЛАТОРе) на ШИРИНУ табулатора (8)
sv: Expandera inmatade TECKEN (tabulatorer) till tabulatorBREDD (8).

source: use form feeds instead of newlines to separate pages (by a 3-line page header with B<-F> or a 5-line header and trailer without B<-F>)
es: utiliza saltos de página en lugar de caracteres de nueva línea para separar páginas (con una cabecera de página de 3 líneas con B<-f> o una cabecera y una cola de 5 líneas sin B<-F>)
hu: lapdobások használata új sorok helyett az oldalak elválasztására (egy 3 soros oldalfejléccel a B<-F> vagy egy 5 soros fejléccel és bevezetővel az B<-F> nélkül)
sr: користи доводе облика уместо нових редова за раздвајање страница (заглављем 3-редне странице са B<-F> или 5-редним заглављем и завршетком без B<-F>)
sv: Använd sidmatning i stället för nya rader för att separera sidor (med ett 3-raders huvud vid -F eller 5-raders huvud och fot utan B<-F>).

source: B<-h>, B<--header>=I<\,HEADER\/>
es: B<-h>, B<--header>=I<\,CABECERA\/>
hu: B<-h>, B<--header>=I<\,FEJLÉC\/>
sr: B<-h>, B<--header>=I<\,ЗАГЛАВЉЕ\/>
sv: B<-h>, B<--header>=I<\,HUVUD\/>

source: use a centered HEADER instead of filename in page header, B<-h> "" prints a blank line, don't use B<-h>""
es: utiliza una CABECERA centrada en lugar del nombre del fichero en la cabecera de la página, B<-h> "" muestra una línea en blanco, no use B<-h>""
hu: egy középre igazított FEJLÉC használata a fájlnév helyett az oldalfejlécben, a B<-h> "" egy üres sort nyomtat, ne használja a B<-h>"" kapcsolót
sr: користи усредиштено ЗАГЛАВЉЕ уместо назива датотеке у заглављу странице, B<-h> "" исписује празан ред, не користи B<-h>""
sv: Använd ett centrerat HUVUD i stället för filnamn i sidhuvud, B<-h> "" skriver en tom rad, använd inte B<-h>"".

source: B<-i[CHAR[WIDTH]]>, B<--output-tabs>[=I<\,CHAR[WIDTH]\/>]
es: B<-i[CARÁCTER[ANCHO]]>, B<--output-tabs>[=I<\,CARÁCTER[ANCHO]\/>]
hu: B<-i[KAR[SZÉLESSÉG]]>, B<--output-tabs>[=I<\,KAR[SZÉLESSÉG]\/>]
sr: B<-i[ЗНАК[ШИРИНА]]]>, B<--output-tabs>[=I<\,ЗНАК[ШИРИНА]]\/>]
sv: B<-i[TECKEN[BREDD]]>, B<--output-tabs>[=I<\,TECKEN[BREDD]\/>]

source: replace spaces with CHARs (TABs) to tab WIDTH (8)
es: reemplaza los espacios con tabulaciones (o con CARÁCTER) de ancho ANCHO (8)
hu: a szóközök cseréje KARAKTEREKRE (TAB-okra) a tab SZÉLESSÉGÉIG (8)
sr: замењује размаке ЗНАКОМ(цима) (ТАБУЛАТОРОМ/има) на ШИРИНУ табулатора (8)
sv: Ersätt mellanslag med TECKEN (tabulatorer), BREDD breda (8).

source: merge full lines, turns off B<-W> line truncation, no column alignment, B<--sep-string>[=I<\,STRING\/>] sets separators
es: mezcla líneas completas, desactiva el truncamiento de líneas B<-W>, no alinea las columnas, B<--sep-string>[=I<\,CADENA\/>] establece los separadores
hu: teljes sorok összefésülése, kikapcsolja a B<-W> sorcsonkítást, nincs oszlopigazítás, a B<--sep-string>[=I<\,KARAKTERLÁNC\/>] beállítja az elválasztókat
sr: стапа читаве редове, искључује B<-W> краћење реда, без поравнања ступца, B<--sep-string>[=I<\,НИСКА\/>] подешава раздвојнике
sv: Sammanfoga hela rader, stänger av -W avhuggning av rader, ingen kolumnjustering, B<--sep-string>[=I<\,STRÄNG\/>] anger avskiljare.

source: B<-l>, B<--length>=I<\,PAGE_LENGTH\/>
es: B<-l>, B<--length>=I<\,LONG_PÁGINA\/>
hu: B<-l>, B<--length>=I<\,OLDALHOSSZ\/>
sr: B<-l>, B<--length>=I<\,ДУЖИНА_СТРАНИЦЕ\/>
sv: B<-l>, B<--length>=I<\,SIDLÄNGD\/>

source: set the page length to PAGE_LENGTH (66) lines (default number of lines of text 56, and with B<-F> 63). implies B<-t> if PAGE_LENGTH E<lt>= 10
es: establece la longitud de la página a LONG_PÁGINA (66) líneas. El número de líneas de texto por defecto es 56, con B<-F>, 63. B<-t> está implícito si LONG_PÁGINA E<lt>= 10
hu: beállítja az oldalhosszúságot OLDALHOSSZ (66) sorra (a szövegsorok alapértelmezett száma 56, és a B<-F> esetén 63). a B<-t> használata következik belőle, ha az OLDALHOSSZ E<lt>= 10
sr: подешава дужину странице на ДУЖИНА_СТРАНИЦЕ (66) редова (основни број редова текста је 56, а са B<-F> 63) подразумева B<-t> ако је ВЕЛИЧИНА_СТРАНИЦЕ E<lt>= 10
sv: Sätt sidlängden till SIDLÄNGD (66) rader (standard 56 rader text, och med B<-F> 63). Implicerar B<-t> om SIDLÄNGD E<lt>= 10.

source: print all files in parallel, one in each column, truncate lines, but join lines of full length with B<-J>
es: muestra todos los ficheros en paralelo, uno en cada columna, trunca líneas, pero une líneas de longitud completa con B<-J>
hu: az összes fájl párhuzamos nyomtatása, egyet minden oszlopba, a sorokat csonkítja, de a teljes hosszúságú sorokat a B<-J> használatakor összekapcsolja
sr: исписује све датотеке у паралели, једну у сваком ступцу, крати редове, али припаја редове пуне дужине са B<-J>
sv: Skriv alla filer parallellt, en i varje kolumn, hugg av rader, men slå samman rader till full längd med B<-J>.

source: B<-n[SEP[DIGITS]]>, B<--number-lines>[=I<\,SEP[DIGITS]\/>]
es: B<-n[SEP[DÍGITOS]]>, B<--number-lines>[=I<\,SEP[DÍGITOS]\/>]
hu: B<-n[ELV[SZÁMJEGYEK]>, B<--number-lines>[=I<\,ELV[SZÁMJEGYEK]\/>]
sr: B<-n[РАЗ[ЦИФРЕ]]>, B<--number-lines>[=I<\,РАЗ[ЦИФРЕ]\/>]
sv: B<-n[SEP[SIFFROR]]>, B<--number-lines>[=I<\,SEP[SIFFROR]\/>]

source: number lines, use DIGITS (5) digits, then SEP (TAB), default counting starts with 1st line of input file
es: numera las líneas, utiliza DÍGITOS (5) dígitos, luego SEP (TAB), la cuenta predeterminada comienza con la primera línea del fichero de entrada
hu: sorok számozása, SZÁMJEGYEK (5) darab számjegy, majd az ELVÁLASZTÓ (TAB) használatával, a számolás alapértelmezésben a bemeneti fájl első sorával kezdődik.
sr: пише бројеве редова, користи ЦИФРЕ (5) цифара, затим РАЗДВОЈНИК (ТАБУЛАТОР), основно бројање почиње првим редом улазне датотеке
sv: Numrera rader, använd SIFFROR (5) siffror, sedan SEP (TAB), i normalläge startar räkning vid infilens första rad.

source: B<-N>, B<--first-line-number>=I<\,NUMBER\/>
es: B<-N>, B<--first-line-number>=I<\,NÚMERO\/>
hu: B<-N>, B<--first-line-number>=I<\,SZÁM\/>
sr: B<-N>, B<--first-line-number>=I<\,БРОЈ\/>
sv: B<-N>, B<--first-line-number>=I<\,NUMMER\/>

source: start counting with NUMBER at 1st line of first page printed (see +FIRST_PAGE)
es: comienza a contar con NÚMERO en la primera línea de la primera página impresa (véase +PRIMERA_PÁGINA)
hu: a számolás kezdése a SZÁMMAL az első kinyomtatott oldal első sorában (lásd +ELSŐ_OLDAL)
sr: почиње бројање БРОЈЕМ на првом реду прве исписане странице (видите +ПРВА_СТРАНИЦА)
sv: Börja räkna med NUMMER vid första raden på första sidan som skrivs ut (se +FÖRSTA_SIDA).

source: B<-o>, B<--indent>=I<\,MARGIN\/>
es: B<-o>, B<--indent>=I<\,MARGEN\/>
hu: B<-o>, B<--indent>=I<\,MARGÓ\/>
sr: B<-o>, B<--indent>=I<\,ИВИЦА\/>
sv: B<-o>, B<--indent>=I<\,MARGINAL\/>

source: offset each line with MARGIN (zero) spaces, do not affect B<-w> or B<-W>, MARGIN will be added to PAGE_WIDTH
es: desplaza cada línea con MARGEN (cero) espacios, no afecta a B<-w> ni a B<-W>, MARGEN será añadido a ANCHO_PÁGINA
hu: minden egyes sor eltolása MARGÓ (nulla) szóközzel, nincs hatással a B<-w> vagy B<-W> kapcsolókra, a MARGÓ az OLDAL_SZÉLESSÉGHEZ lesz hozzáadva.
sr: помера сваки ред са ИВИЦА (нула) размака, не утиче на B<-w> или B<-W>, ИВИЦА ће бити додата на ШИРИНУ_СТРАНИЦЕ
sv: Skjut in varje rad med MARGINAL (noll) mellanrum, påverka ej B<-w> eller B<-W>, MARGINAL läggs till SIDBREDD.

source: omit warning when a file cannot be opened
es: omite el aviso cuando no se puede abrir un fichero
hu: figyelmeztetés kihagyása, ha egy fájl nem nyitható meg
sr: изоставља упозорење када датотека не може бити отворена
sv: Utelämna varning när en fil inte kan öppnas.

source: B<-s[CHAR]>, B<--separator>[=I<\,CHAR\/>]
es: B<-s[CAR]>, B<--separator>[=I<\,CAR\/>]
hu: B<-s[KARAKTER]>, B<--separator>[=I<\,KARAKTER\/>]
sr: B<-s[ЗНАК]>, B<--separator>[=I<\,ЗНАК\/>]
sv: B<-s[TECKEN]>, B<--separator>[=I<\,TECKEN\/>]

source: separate columns by a single character, default for CHAR is the E<lt>TABE<gt> character without B<-w> and 'no char' with B<-w>. B<-s[CHAR]> turns off line truncation of all 3 column options (B<-COLUMN>|-a B<-COLUMN>|-m) except B<-w> is set
es: separa las columnas mediante un solo carácter, el valor predeterminado de CAR es el carácter de E<lt>TABE<gt> sin B<-w> y 'no char' con B<-w>. La opción B<-s[CAR]> desactiva el truncamiento de líneas de las 3 opciones de columnas (B<-COLUMN>|-a B<-COLUMN>|-m) excepto si se usa B<-w>
hu: oszlopok elválasztása egyetlen karakterrel, a KARAKTER alapértelmezetten E<lt>TABE<gt> karakter a -w nélkül és „semmi” a B<-w> esetén. A B<-s[KARAKTER]> kikapcsolja a sorcsonkítást mind a 3 oszlopkapcsolóhoz (B<-OSZLOP>|-a B<-OSZLOP>|-m), kivéve ha a B<-w> be van állítva
sr: раздваја ступце једним знаком, основно за ЗНАК је E<lt>ТАБE<gt> знак без B<-w> и „no ЗНАК“ са B<-w>. B<-s[ЗНАК]> искључује краћење реда за све 3 опције ступца (B<-СТУБАЦ>|-a B<-СТУБАЦ>|-m) осим ако је B<-w> подешено
sv: Åtskilj kolumner med ett enda tecken, standard för TECKEN är tabulatortecknet utan B<-w> och ”inget tecken” med B<-w>. B<-s[TECKEN]> slår av avhuggning för alla tre kolumnflaggorna (B<-KOLUMN>|-a B<-KOLUMN>|-m) utom när B<-w> är angivet.

source: B<-S[STRING]>, B<--sep-string>[=I<\,STRING\/>]
es: B<-S[CADENA]>, B<--sep-string>[=I<\,CADENA\/>]
hu: B<-S[KARAKTERLÁNC]>, B<--sep-string>[=I<\,KARAKTERLÁNC\/>]
sr: B<-S[НИСКА]>, B<--sep-string>[=I<\,НИСКА\/>]
sv: B<-S[STRÄNG]>, B<--sep-string>[=I<\,STRÄNG\/>]

source: separate columns by STRING, without B<-S>: Default separator E<lt>TABE<gt> with B<-J> and E<lt>spaceE<gt> otherwise (same as B<-S>" "), no effect on column options
es: separa las columnas mediante CADENA, sin B<-S>: El separador predeterminado es E<lt>TABE<gt> con B<-J> y E<lt>espacioE<gt> en caso contrario (lo mismo que B<-S>" "), no hay ningún efecto en las opciones de columnas
hu: az oszlopok elválasztása a KARAKTERLÁNCCAL, a B<-S> nélkül: az alapértelmezett elválasztó a E<lt>TABE<gt> a B<-J> kapcsolóval és E<lt>szóközE<gt> egyébként (ugyanaz, mint a B<-S>" ") nincs hatással az oszlopkapcsolókra
sr: раздваја ступце НИСКОМ, без B<-S>: Основни раздвојник E<lt>ТАБE<gt> са B<-J> и E<lt>размакE<gt> у супротном (исто као B<-S>" "), нема дејства на опције ступца
sv: Åtskilj kolumner med STRÄNG, utan B<-S>: Standardseparator E<lt>TABE<gt> med B<-J> och E<lt>blankE<gt> annars (samma som B<-S>" "), ingen effekt på kolumnflaggor.

source: omit page headers and trailers; implied if PAGE_LENGTH E<lt>= 10
es: no muestra cabeceras ni colas, está implícito si LONG_PÁGINA E<lt>= 10
hu: oldalfejlécek és befejezők kihagyása használata az OLDALHOSSZ E<lt>= 10-ből következik
sr: изоставља заглавља странице и завршетке; подразумева се ако је ДУЖИНА_СТРАНИЦЕ E<lt>= 10
sv: Utelämna sidhuvud och sidfot implicit om SIDLÄNGD E<lt>= 10.

source: omit page headers and trailers, eliminate any pagination by form feeds set in input files
es: no muestra cabeceras ni colas, descarta cualquier formato de página establecido con saltos de página en los ficheros de entrada
hu: oldalfejlécek és befejezők kihagyása, a bemeneti fájlokban található lapdobások által beállított oldalakra tördelés megszüntetése
sr: изоставља заглавља страница и завршетке, елиминише сва остраничења из подешавања довода у улазним датотекама
sv: Utelämna sidhuvud och sidfot, ta bort paginering gjord med sidmatning i infiler.

source: use octal backslash notation
es: usa la notación octal de barra invertida
hu: oktális visszaper jelölés használata
sr: користи октално назначавање контра косе црте
sv: Använd oktal notation med omvänt snedstreck.

source: B<-w>, B<--width>=I<\,PAGE_WIDTH\/>
es: B<-w>, B<--width>=I<\,ANCHO_PÁGINA\/>
hu: B<-w>, B<--width>=I<\,OLDAL_SZÉLESSÉG\/>
sr: B<-w>, B<--width>=I<\,ШИРИНА_СТРАНИЦЕ\/>
sv: B<-w>, B<--width>=I<\,SIDBREDD\/>

source: set page width to PAGE_WIDTH (72) characters for multiple text-column output only, B<-s[char]> turns off (72)
es: establece el ancho de página en ANCHO_PÁGINA caracteres (por omisión, 72) solamente para salida de texto en varias columnas, B<-s[car]> lo desactiva (72)
hu: az oldalszélesség beállítása OLDAL_SZÉLESSÉG (72) karakterre, csak több szöveges oszlopot tartalmazó kimenethez, az B<-s[karakter]> kikapcsolja (72)
sr: подешава ширину странице на ШИРИНА_СТРАНИЦЕ (72) знакова за вишеструки излаз текста-ступца само, B<-s[знак]> искључује (72)
sv: Sätt sidbredd till SIDBREDD (72) kolumner vid utmatning med flera textkolumner, B<-s[TECKEN]> slår av (72).

source: B<-W>, B<--page-width>=I<\,PAGE_WIDTH\/>
es: B<-W>, B<--page-width>=I<\,ANCHO_PÁGINA\/>
hu: B<-W>, B<--page-width>=I<\,OLDAL_SZÉLESSÉG\/>
sr: B<-W>, B<--page-width>=I<\,ШИРИНА_СТРАНИЦЕ\/>
sv: B<-W>, B<--page-width>=I<\,SIDBREDD\/>

source: set page width to PAGE_WIDTH (72) characters always, truncate lines, except B<-J> option is set, no interference with B<-S> or B<-s>
es: establece el ancho de página siempre en ANCHO_PÁGINA caracteres (por omisión 72), trunca las líneas, excepto si se usa la opción B<-J>, no interfiere con las opciones B<-S> o B<-s>
hu: az oldalszélesség beállítása OLDAL_SZÉLESSÉG (72) karakterre mindig, a sorok csonkítása, kivéve ha a B<-J> kapcsoló be van állítva, nincs interferencia a B<-S> vagy B<-s> kapcsolókkal
sr: подешава ширину странице на ШИРИНА_СТРАНИЦЕ (72) знакова увек, крати редове, осим ако је постављена опција B<-J>, не утиче на B<-S> или B<-s>
sv: Sätt sidbredd till SIDBREDD (72) kolumner vid all utmatning, hugg av rader utom om flagga B<-J> är satt, ingen koppling till B<-S> eller B<-s>.

source: display this help and exit
es: muestra la ayuda y finaliza
hu: ezen súgó megjelenítése és kilépés
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.

source: output version information and exit
es: muestra la versión del programa y termina
hu: verzióinformációk megjelenítése és kilépés
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.

source: AUTHOR
es: AUTOR
hu: SZERZŐ
sr: АУТОР
sv: UPPHOVSMAN

source: Written by Pete TerMaat and Roland Huebner.
es: Escrito por Pete TerMaat y Roland Huebner.
hu: Írta Pete TerMaat és Roland Huebner.
sr: Написали су Пете ТерМат и Роланд Хуебнер.
sv: Skrivet av Pete TerMaat och Roland Huebner.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
hu: HIBÁK JELENTÉSE
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: COPYRIGHT
hu: SZERZŐI JOG
sr: АУТОРСКА ПРАВА

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2022 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
es: VÉASE TAMBIÉN
hu: LÁSD MÉG
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/prE<gt>
es: Ayuda en línea: E<lt>https://www.gnu.org/software/coreutils/prE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/prE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/prE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/prE<gt>

source: or available locally via: info \(aq(coreutils) pr invocation\(aq
es: también disponible localmente ejecutando: info \(aq(coreutils) pr invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) pr invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) pr invocation\(aq“
sv: eller tillgängligt lokalt via: info \(aq(coreutils) pr invocation\(aq

source: September 2020
es: Septiembre de 2020
hu: 2020 szeptember
sr: Септембра 2020

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
hu: 2021 október
sr: Октобра 2021
sv: oktober 2021

source: March 2022
es: Marzo 2022
sr: Марта 2022
sv: mars 2022

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0
