Repository: sebras/manpages-l10n
Catalog: po/*/man1/pr.1.po
Languages: es, hu, sr, sv

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
es: Agosto de 2022
sr: Августа 2022
sv: augusti 2022

source: September 2021
es: Septiembre de 2021
hu: 2021 szeptember
sr: Септембра 2021

source: pr - convert text files for printing
es: pr - convierte ficheros de texto para imprimirlos
hu: pr - szövegfájlokat konvertál nyomtatáshoz
