Repository: sebras/manpages-l10n
Catalog: po/*/man1/prlimit.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: prlimit - get and set process resource limits
uk: prlimit — отримання і встановлення обмежень ресурсів для процесів

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<prlimit> [options] [B<--resource>[=I<limits>]] [B<--pid> I<PID>]
uk: B<prlimit> [параметри] [B<--resource>[=I<обмеження>]] [B<--pid> I<PID>]

source: B<prlimit> [options] [B<--resource>[=I<limits>]] I<command> [I<argument>...]
uk: B<prlimit> [параметри] [B<--resource>[=I<обмеження>]] I<команда> [I<аргумент>...]

source: DESCRIPTION
uk: ОПИС

source: Given a process ID and one or more resources, B<prlimit> tries to retrieve and/or modify the limits.
uk: За заданим ідентифікатором процесу та одним або декількома ресурсами B<prlimit> намагається отримати і/або внести зміни в обмеження.

source: When I<command> is given, B<prlimit> will run this command with the given arguments.
uk: Якщо вказано аргумент I<команда>, B<prlimit> запустить вказану команду із заданими аргументами.

source: The I<limits> parameter is composed of a soft and a hard value, separated by a colon (:), in order to modify the existing values. If no I<limits> are given, B<prlimit> will display the current values. If one of the values is not given, then the existing one will be used. To specify the unlimited or infinity limit (B<RLIM_INFINITY>), the -1 or \(aqunlimited\(aq string can be passed.
uk: Параметр I<обмеження> має складатися з м'якого і жорсткого значення, які відокремлено двокрапкою (:), його призначено для зміни наявних значень. Якщо I<обмеження> не задано, B<prlimit> виведе поточні значення. Якщо не вказано одне зі значень обмеження, буде використано наявне значення. Щоб зняти обмеження або встановити нескінченне значення обмеження (B<RLIM_INFINITY>), можна передати -1 або рядок «unlimited».

source: Because of the nature of limits, the soft limit must be lower or equal to the high limit (also called the ceiling). To see all available resource limits, refer to the B<RESOURCE OPTIONS> section.
uk: Через природу обмежень м'яке обмеження має бути нижчим або рівним за вище обмеження (яке також називають стелею). Щоб переглянути усі доступні обмеження ресурсів, зверніться до розділу *ПАРАМЕТРИ РЕСУРСІВ*.

source: I<soft>:_hard_ Specify both limits.
uk: I<м'яке>:I<жорстке> Вказати обидва обмеження.

source: I<soft>: Specify only the soft limit.
uk: I<м'яке>: Вказати лише м'яке обмеження.

source: :I<hard> Specify only the hard limit.
uk: :I<жорстке> Вказати лише жорстке обмеження.

source: I<value> Specify both limits to the same value.
uk: I<значення> Вказати для обох обмежень однакове значення.

source: GENERAL OPTIONS
uk: ЗАГАЛЬНІ ПАРАМЕТРИ

source: Do not print a header line.
uk: Не виводити рядок заголовка.

source: B<-o, --output> I<list>
uk: B<-o>, B<--output> I<список>

source: Define the output columns to use. If no output arrangement is specified, then a default set is used. Use B<--help> to get a list of all supported columns.
uk: Визначити стовпчики виведення для використання. Якщо не визначено компонування виведених даних, буде використано типовий набір. Скористайтеся параметром B<--help>, щоб отримати список усіх підтримуваних стовпчиків.

source: Specify the process id; if none is given, the running process will be used.
uk: Вказати ідентифікатор процесу; якщо ідентифікатор не вказано, буде використано запущений процес.

source: Use the raw output format.
uk: Використовувати формат виведення без обробки.

source: Verbose mode.
uk: Режим докладних повідомлень.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: RESOURCE OPTIONS
uk: ПАРАМЕТРИ РЕСУРСУ

source: B<-c, --core>[=I<limits>]
uk: B<-c, --core>[=I<обмеження>]

source: Maximum size of a core file.
uk: Максимальний розмір файла ядра.

source: B<-d, --data>[=I<limits>]
uk: B<-d, --data>[=I<обмеження>]

source: Maximum data size.
uk: Максимальний розмір даних.

source: B<-e, --nice>[=I<limits>]
uk: B<-e, --nice>[=I<обмеження>]

source: Maximum nice priority allowed to raise.
uk: Максимальна пріоритетність виконання, до якої можна підвищувати значення.

source: B<-f, --fsize>[=I<limits>]
uk: B<-f, --fsize>[=I<обмеження>]

source: Maximum file size.
uk: Максимальний розмір файла.

source: B<-i, --sigpending>[=I<limits>]
uk: B<-i, --sigpending>[=I<обмеження>]

source: Maximum number of pending signals.
uk: Максимальна кількість сигналів у черзі.

source: B<-l, --memlock>[=I<limits>]
uk: B<-l, --memlock>[=I<обмеження>]

source: Maximum locked-in-memory address space.
uk: Максимальний простір адрес блокування у пам'яті.

source: B<-m, --rss>[=I<limits>]
uk: B<-m, --rss>[=I<обмеження>]

source: Maximum Resident Set Size (RSS).
uk: Максимальний розмір резидентного набору (RSS).

source: B<-n, --nofile>[=I<limits>]
uk: B<-n, --nofile>[=I<обмеження>]

source: Maximum number of open files.
uk: Максимальна кількість відкритих файлів.

source: B<-q, --msgqueue>[=I<limits>]
uk: B<-q, --msgqueue>[=I<обмеження>]

source: Maximum number of bytes in POSIX message queues.
uk: Максимальна кількість байтів у чергах повідомлень POSIX.

source: B<-r, --rtprio>[=I<limits>]
uk: B<-r, --rtprio>[=I<обмеження>]

source: Maximum real-time priority.
uk: Максимальна пріоритетність планування у режимі реального часу.

source: B<-s, --stack>[=I<limits>]
uk: B<-s, --stack>[=I<обмеження>]

source: Maximum size of the stack.
uk: Максимальний розмір стека.

source: B<-t, --cpu>[=I<limits>]
uk: B<-t, --cpu>[=I<обмеження>]

source: CPU time, in seconds.
uk: Час процесора у секундах.

source: B<-u, --nproc>[=I<limits>]
uk: B<-u, --nproc>[=I<обмеження>]

source: Maximum number of processes.
uk: Максимальна кількість процесів.

source: B<-v, --as>[=I<limits>]
uk: B<-v, --as>[=I<обмеження>]

source: Address space limit.
uk: Обмеження простору адрес.

source: B<-x, --locks>[=I<limits>]
uk: B<-x, --locks>[=I<обмеження>]

source: Maximum number of file locks held.
uk: Максимальна кількість утримуваних блокувань файлів.

source: B<-y, --rttime>[=I<limits>]
uk: B<-y, --rttime>[=I<обмеження>]

source: Timeout for real-time tasks.
uk: Час очікування для завдань реального часу.

source: NOTES
uk: ПРИМІТКИ

source: The B<prlimit>(2) system call is supported since Linux 2.6.36, older kernels will break this program.
uk: З випуску ядра Linux 2.6.36 передбачено підтримку системного виклику B<prlimit>(2). У старіших версіях ядра ця програма не працює.

source: EXAMPLES
uk: ПРИКЛАДИ

source: Display limit values for all current resources.
uk: Вивести значення обмежень для усіх поточних ресурсів.

source: Display the limits of the RSS, and set the soft and hard limits for the number of open files to 1024 and 4095, respectively.
uk: Вивести обмеження на RSS і встановити м'яке і жорстке обмеження для кількості відкритих файлів у 1024 і 4095, відповідно.

source: Modify only the soft limit for the number of processes.
uk: Змінити лише м'яке обмеження щодо кількості процесів.

source: Set for the current process both the soft and ceiling values for the number of processes to unlimited.
uk: Встановити для поточного процесу одразу для м'якого обмеження і стелі кількості процесів необмежені значення.

source: Set both the soft and hard CPU time limit to ten seconds and run B<sort>(1).
uk: Встановити для м'якого і жорсткого обмежень часу процесора значення десять секунд і запустити B<sort>(1).

source: AUTHORS
uk: АВТОРИ

source: - In memory of Dennis M. Ritchie.
uk: — у пам'ять про Dennis M. Ritchie.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<prlimit> command is part of the util-linux package which can be downloaded from
uk: B<prlimit> є частиною пакунка util-linux, який можна отримати з

source: July 2014
uk: липень 2014 року

source: B<prlimit> [options] [B<-->I<resource>[B<=>I<limits>] [B<--pid\ >I<PID>]
uk: B<prlimit> [параметри] [B<--resource>[=I<обмеження>]] [B<--pid> I<PID>]

source: B<prlimit> [options] [B<-->I<resource>[B<=>I<limits>] I<command >[I<argument>...]
uk: B<prlimit> [параметри] [B<--resource>[=I<обмеження>]] I<команда> [I<аргумент>...]

source: The I<limits> parameter is composed of a soft and a hard value, separated by a colon (:), in order to modify the existing values. If no I<limits> are given, B<prlimit> will display the current values. If one of the values is not given, then the existing one will be used. To specify the unlimited or infinity limit (RLIM_INFINITY), the -1 or 'unlimited' string can be passed.
uk: Параметр I<обмеження> має складатися з м'якого і жорсткого значення, які відокремлено двокрапкою (:), його призначено для зміни наявних значень. Якщо I<обмеження> не задано, B<prlimit> виведе поточні значення. Якщо не вказано одне зі значень обмеження, буде використано наявне значення. Щоб зняти обмеження або встановити нескінченне значення обмеження (B<RLIM_INFINITY>), можна передати -1 або рядок «unlimited».

source: Because of the nature of limits, the soft limit must be lower or equal to the high limit (also called the ceiling). To see all available resource limits, refer to the RESOURCE OPTIONS section.
uk: Через природу обмежень м'яке обмеження має бути нижчим або рівним за вище обмеження (яке також називають стелею). Щоб переглянути усі доступні обмеження ресурсів, зверніться до розділу B<ПАРАМЕТРИ РЕСУРСІВ>.

source: I<soft>:I<hard> Specify both limits.
uk: I<м'яке>:I<жорстке> Вказати обидва обмеження.

source: I<soft>: Specify only the soft limit.
uk: I<м'яке>: Вказати лише м'яке обмеження.

source: :I<hard> Specify only the hard limit.
uk: :I<жорстке> Вказати лише жорстке обмеження.

source: I<value> Specify both limits to the same value.
uk: I<значення> Вказати для обох обмежень однакове значення.

source: B<-o, --output >I<list>
uk: B<-o>, B<--output> I<список>

source: Define the output columns to use. If no output arrangement is specified, then a default set is used. Use B<--help> to get a list of all supported columns.
uk: Визначити стовпчики виведення для використання. Якщо не визначено компонування виведених даних, буде використано типовий набір. Скористайтеся параметром B<--help>, щоб отримати список усіх підтримуваних стовпчиків.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: The prlimit system call is supported since Linux 2.6.36, older kernels will break this program.
uk: З випуску ядра Linux 2.6.36 передбачено підтримку системного виклику prlimit(2). У старіших версіях ядра ця програма не працює.

source: Set both the soft and hard CPU time limit to ten seconds and run 'sort'.
uk: Встановити для м'якого і жорсткого обмежень часу процесора значення десять секунд і запустити B<sort>(1).

source: Davidlohr Bueso E<lt>dave@gnu.orgE<gt> - In memory of Dennis M. Ritchie.
uk: Davidlohr Bueso E<lt>dave@gnu.orgE<gt> — у пам'ять про Dennis M. Ritchie.

source: The prlimit command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
uk: Програма prlimit є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Because of the nature of limits, the soft limit must be lower or equal to the high limit (also called the ceiling). To see all available resource limits, refer to the RESOURCE OPTIONS section.
uk: Через природу обмежень м'яке обмеження має бути нижчим або рівним за вище обмеження (яке також називають стелею). Щоб переглянути усі доступні обмеження ресурсів, зверніться до розділу B<ПАРАМЕТРИ РЕСУРСІВ>.

source: The B<prlimit> system call is supported since Linux 2.6.36, older kernels will break this program.
uk: З випуску ядра Linux .6.36 передбачено підтримку системного виклику B<prlimit>(2). У старіших версіях ядра ця програма не працює.

source: Set both the soft and hard CPU time limit to ten seconds and run \(aqsort\(aq.
uk: Встановити для м'якого і жорсткого обмежень часу процесора значення десять секунд і запустити B<sort>(1).
