Repository: sebras/manpages-l10n
Catalog: po/*/man1/ps2pdfwr.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: ps2pdfwr - Convert PostScript to PDF without specifying CompatibilityLevel, using ghostscript
de: ps2pdfwr - PostScript mittels ghostscript in PDF konvertieren, ohne CompatibilityLevel anzugeben

source: SYNOPSIS
de: ÜBERSICHT

source: B<ps2pdfwr> [options...] {input.[e]ps|-} [output.pdf|-]
de: B<ps2pdfwr> [Optionen…] {Eingabe.[e]ps|-} [Ausgabe.pdf|-]

source: DESCRIPTION
de: BESCHREIBUNG

source: This wrapper script invokes B<gs>(1) with following arguments
de: Dieses Wrapper-Skript ruft B<gs>(1) mit den folgenden Argumenten auf:

source: as well as the appropriate B<-dOutputFile> argument, all preceded and followed by any command-line arguments. Finally, the security option B<-dSAFER> is prepended before all the other options (This is now redundant as "SAFER" is now the default, but the option does no harm).
de: Zusätzlich mit dem passenden Argument B<-dOutputFile>. Allen werden die Befehlzeilenargumente vorangestellt und angehängt. Schließlich wird vor allen Optionen die Sicherheitsoption B<-dSAFER> vorangestellt. (Dies ist jetzt redundant, da »SAFER« die Vorgabe ist, aber die Option stört nicht.)

source: The version-specific B<ps2pdf> scripts all invoke this one with the addition of the respective compatibility level option.
de: Die versionsspezifischen B<ps2pdf>-Skripte rufen alle dieses eine Skript auf, wobei sie die Option für die jeweilige Kompatibilitätsstufe hinzufügen.

source: SEE ALSO
de: SIEHE AUCH

source: gs(1), ps2pdf(1)
de: B<gs>(1), B<ps2pdf>(1)

source: This document was last revised for Ghostscript version 9.56.1.
de: Dieses Dokument wurde letztmalig für Ghostscript Version 9.56.1 überarbeitet.

source: AUTHOR
de: AUTOR

source: Artifex Software, Inc. are the primary maintainers of Ghostscript. This manpage by George Ferguson.
de: Artifex Software, Inc. sind der primäre Betreuer von Ghostscript. Diese Handbuchseite ist von George Ferguson.

source: 1 October 2020
de: 1. Oktober 2020

source: as well as the appropriate B<-dOutputFile> argument, all preceded and followed by any command-line arguments. Finally, the security option B<-dSAFER> is prepended before all the other options.
de: Zusätzlich mit dem passenden Argument B<-dOutputFile>. Allen werden die Befehlzeilenargumente vorangestellt und angehängt. Schließlich wird vor allen Optionen die Sicherheitsoption B<-dSAFER> vorangestellt.

source: This document was last revised for Ghostscript version 9.53.3.
de: Dieses Dokument wurde letztmalig für Ghostscript Version 9.53.3 überarbeitet.

source: This document was last revised for Ghostscript version 9.55.0.
de: Dieses Dokument wurde letztmalig für Ghostscript Version 9.55.0 überarbeitet.
