Repository: sebras/manpages-l10n
Catalog: po/*/man1/psfaddtable.1.po
Languages: da, de, es

source: 25 Oct 1994
da: 25 okt 1994
de: 25. Oktober 1994
es: 25 de Octubre de 1994

source: NAME
da: NAVN
de: BEZEICHNUNG
es: NOMBRE

source: psfaddtable - add a Unicode character table to a console font
da: psfaddtable - tilføj en Unicode-tegntabel til en konsolskrifttype
de: psfaddtable - eine Unicode-Zeichentabelle zu einer Konsolenschrift hinzufügen
es: psfaddtable - añade una tabla de caracteres Unicode a un tipo de letra de consola

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: B<psfaddtable> I<fontfile tablefile outfile>
da: B<psfaddtable> I<skriftfil tabelfil udfil>
de: B<psfaddtable> I<Schriftdatei Tabellendatei Ausgabedatei>
es: B<psfaddtable> I<fichero-de-tipos fichero-tabla fichero-salida>

source: DESCRIPTION
da: BESKRIVELSE
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: psfaddtable command
da: psfaddtable kommando
de: psfaddtable-Befehl
es: orden psfaddtable

source: \fLpsfaddtable\fR command
da: \fLpsfaddtable\fR kommando
de: \fLpsfaddtable\fR-Befehl
es: orden \fLpsfaddtable\fR

source: B<psfaddtable> takes a console font in .psf format given by I<fontfile> and merges it with the Unicode character table given by I<tablefile> to produce a font file with an embedded character table, which is written to I<outfile>. An input file name of "-" denotes standard input, and an output file name of "-" denotes standard output. If the I<fontfile> already contains an embedded character table, it is ignored.
da: B<psfaddtable> benytter en konsolskrifttype i formatet .psf givet af I<skriftfil> og sammenføjer den med Unicode-tegntabellen givet af I<tabelfil> for at fremstille en skriftfil med en indlejret tegntabel, der skrives til I<udfil>. Filnavnet »-« for kilden betegner standardind, og et filnavn for resultatet »-« betegner standardud. Hvis I<skriftfilen> allerede indeholder en indlejret tegntabel ignoreres denne.
de: B<psfaddtable> nimmt eine als I<Schriftdatei> angegebene Konsolenschrift im .psf-Format und führt diese mit der als I<Tabellendatei> angegebenen Unicode-Zeichentabelle zusammen, um daraus eine Schriftdatei mit einer eingebetteten Zeichentabelle zu erstellen. Diese wird in die I<Ausgabedatei> geschrieben. Wird die Eingabedatei als »-« angegeben, wird aus der Standardeingabe gelesen, ebenso bezeichnet der als »-« angegebene Name der Ausgabedatei die Standardausgabe. Falls die I<Schriftdatei> bereits eine eingebettete Zeichentabelle enthält, wird diese ignoriert.

source: TABLE FILE FORMAT
da: TABELFILFORMAT
de: FORMAT DER TABELLENDATEI
es: FORMATO DEL FICHERO DE TABLA

source: Each line in the I<tablefile> should be either blank, contain a comment (preceded by I<#>), or contain a sequence of numbers in either decimal (default), octal (preceded by I<0>), or hexadecimal (preceded by I<0x>) format, separated by spaces or tabs. The first number on each line indicates the glyph slot in the font that is being referred to, this is between 0 and 0xff for a 256-character font and 0 and 0x1ff for a 512-character font. Any subsequent numbers on the same line are Unicodes matched by this specific glyph slot. Instead of a single Unicode one may have a sequence of Unicodes separates by commas, to denote that the glyph depicts the corresponding composed symbol. It is permissible to have multiple lines for the same glyph.
da: Hver linje i I<tabelfilen> skal enten være blank, indeholde en kommentar (foranstillet I<#>) eller indeholde en talsekvens i enten decimaltal (standard), oktal (foranstillet I<0>) eller hexadecimal (foranstillet I<0x>), adskilt af mellemrum eller indryk. Det første nummer på hver linje indikerer skrifttegnspladsen i skrifttypen, der refereres til. Dette er mellem 0 og 0xff for en 256-tegns skrifttype og 0 og 0x1ff for en 512-tegns skrifttype. Alle efterfølgende numre på den samme linje er Unicoder matchet af denne specifikke skrifttegnsplads. I stedet for en enkel Unicode kan man have en sekvens af Uniocoder adskiltet af kommaer, for at betegne at skrifttypen afspejler det tilsvarende sammensatte symbol. Det er tilladt at have flere linjer for det samme skrifttegn.
de: Jede Zeile in der I<Tabellendatei> sollte entweder leer sein, einen Kommentar (mit vorangestelltem I<#>) oder eine Zahlenfolge enthalten. Diese kann entweder dezimal (Standard), oktal (mit vorangestellter I<0>) oder hexadezimal (mit vorangestelltem I<0x>) notiert sein. Die erste Zahl in jeder Zeile bezeichnet den Glyphen-Slot in der Schrift, auf die Bezug genommen wird; dies ist für eine 256-Zeichen-Schrift eine Zahl von 0 bis 0xff und für eine 512-Zeichen-Schrift eine Zahl von 0 bis 0x1ff. Jegliche folgenden Zahlen in der gleichen Zeile sind Unicodes, die diesem bestimmten Glyphen-Slot entsprechen. Anstelle eines einzelnen Unicodes kann auch eine Folge mehrerer, durch Kommata getrennter Unicodes festgelegt werden, um anzuzeigen, dass die Glyphe aus den entsprechenden Symbolen zusammengesetzt wird. Mehrere Zeilen für die gleiche Glyphe sind zulässig.

source: SEE ALSO
da: SE OGSÅ
de: SIEHE AUCH
es: VÉASE TAMBIÉN
