Repository: sebras/manpages-l10n
Catalog: po/*/man1/psfxtable.1.po
Languages: da, de

source: 9 Dec 1999
da: 9. december 1999
de: 9. Dezember 1999

source: NAME
da: NAVN
de: BEZEICHNUNG

source: psfxtable - handle Unicode character tables for console fonts
da: psfxtable - håndter Unicode-tegntabeller for konsolskrifttyper
de: psfxtable - Unicode-Zeichentabellen für Konsolenschriften verarbeiten

source: SYNOPSIS
de: ÜBERSICHT

source: B<psfxtable> [B<-i> I<infont>] [B<-o> I<outfont>] [B<-it> I<intable>] [B<-ot> I<outtable>] [B<-nt>]
da: B<psfxtable> [B<-i> I<ind_skrift>] [B<-o> I<ud_skrift>] [B<-it> I<ind_tabel>] [B<-ot> I<ud_tabel>] [B<-nt>]
de: B<psfxtable> [B<-i> I<Eingabeschrift>] [B<-o> I<Ausgabeschrift>] [B<-it> I<Eingabetabelle>] [B<-ot> I<Ausgabetabelle>] [B<-nt>]

source: DESCRIPTION
da: BESKRIVELSE
de: BESCHREIBUNG

source: psfxtable command
da: psfxtable kommando
de: psfxtable-Befehl

source: \fLpsfxtable\fR command
da: \fLpsfxtable\fR kommando
de: \fLpsfxtable\fR-Befehl

source: B<psfxtable> handles the embedded Unicode character table for .psf format console fonts. It reads a font and possibly a table and writes a font and/or a table. B<psfaddtable>(1), B<psfgettable>(1) and B<psfstriptable>(1) are links to it.
da: B<psfxtable> håndterer den indlejrede Unicode-tegntabel for konsolskrifttyper i formatet .psf. Programmet læser en skrifttype og muligvis en tabel og skriver en skrifttype og/eller en tabel. B<psfaddtable>(1), B<psfgettable>(1) og B<psfstriptable>(1) er lænker til programmet.
de: B<psfxtable> verarbeitet die eingebetteten Zeichentabellen für Konsolenschriften im .psf-Format. Es liest eine Schriftdatei und eventuell eine Tabelle und schreibt eine Schriftdatei und/oder eine Tabelle. B<psfaddtable>(1), B<psfgettable>(1) und B<psfstriptable>(1) sind Links auf diesen Befehl.

source: Each of the filenames I<infont>, I<outfont>, I<intable>, and I<outtable> may be replaced by a single dash (-), in which case standard input or standard output is used. If no I<-i> option is given, the font is read from standard input. If no I<-it> or I<-o> or I<-ot> option is given, no input table is read or no output font or output table is written.
da: Hvert af filnavnene I<ind_skrift>, I<ud_skrift>, I<ind_tabel> og I<ud_tabel> kan erstattes af en enkel bindestreg (-). I de tilfælde bruges standardind og standardud. Hvis ikke tilvalget I<-i> er angivet, læses skrifttypen fra standardind. Hvis tilvalgene I<-it> eller I<-o> eller I<-ot> er angivet, så læses inddatatabellen ikke eller ingen uddataskrifttype eller uddatatabel skrives.
de: Jeder der Dateinamen I<Eingabeschrift>, I<Ausgabeschrift>, I<Eingabetabelle> und I<Ausgabetabelle> kann durch einen einzelnen Bindestrich (-) ersetzt werden. In diesem Fall werden Standardeingabe oder Standardausgabe verwendet. Ist die Option B<-i> nicht angegeben, wird die Schrift aus der Standardeingabe gelesen. Falls die Optionen B<-it> oder B<-o> oder B<-ot> nicht angegeben ist, wird keine Eingabetabelle gelesen beziehungsweise keine Schrift oder Tabelle ausgegeben.

source: By default the output font (if any) will have a Unicode table when either the input font has one, or an explicit table (which overrides an input font table) has been provided. The option I<-nt> causes output of a font without table. When I<outfont> is requested it will get a psf1 header when infont has a psf1 header and I<intable> does not have sequences and a psf2 header otherwise.
da: Som standard vil uddataskrifttypen (om nogen) have en Unicode-tabel, når enten inddataskrifttypen har en, eller en eksplicit tabel (der overskriver en inddataskrifttypetabel) er specificeret. Tilvalget I<-nt> gør, at resultatet for en skrifttype er uden tabel. Når der anmodes om I<ud_skrift>, så vil den få et psf1-teksthoved, når indskrifttypen har et psf1-teksthoved og I<indtabel> ikke har sekvenser og et psf2-teksthoved i alle andre tilfælde.
de: Standardmäßig ist die Ausgabetabelle (sofern diese ausgegeben wird) eine Unicode-Tabelle, wenn entweder die Eingabeschrift eine solche hat oder eine Tabelle (die eine Eingabeschrift außer Kraft setzt) explizit bereitgestellt wurde. Die Option B<-nt> bewirkt die Ausgabe einer Schrift ohne Tabelle. Wenn eine I<Ausgabeschrift> angefordert wurde, erhält diese einen PSF1-Kopf, wenn die Eingabeschrift einen PSF1-Kopf und die I<Eingabetabelle> keine Sequenzen hat; anderenfalls wird ein PSF2-Kopf ausgegeben.

source: SEE ALSO
da: SE OGSÅ
de: SIEHE AUCH
