Repository: sebras/manpages-l10n
Catalog: po/*/man1/ptx.1.po
Languages: es, sr, sv

source: April 2022
es: Abril de 2022
sr: Априла 2022

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: User Commands
es: Órdenes de usuario
sr: Корисничке наредбе
sv: Användarkommandon

source: NAME
es: NOMBRE
sr: НАЗИВ
sv: NAMN

source: SYNOPSIS
es: SINOPSIS
sr: УВОД

source: B<ptx> [I<\,OPTION\/>]... [I<\,INPUT\/>]... I<\,(without -G)\/>
es: B<ptx> [I<\,OPCIÓN\/>]... [I<\,ENTRADA\/>]... I<\,(sin -G)\/>
sr: B<ptx> [I<\,ОПЦИЈА\/>]... [I<\,УЛАЗ\/>]... I<\,(без -G)\/>
sv: B<ptx> [I<\,FLAGGA\/>]... [I<\,INFIL\/>]... I<\,(utan -G)\/>

source: B<ptx> I<\,-G \/>[I<\,OPTION\/>]... [I<\,INPUT \/>[I<\,OUTPUT\/>]]
es: B<ptx> I<\,-G \/>[I<\,OPCIÓN\/>]... [I<\,ENTRADA \/>[I<\,SALIDA\/>]]
sr: B<ptx> I<\,-G \/>[I<\,ОПЦИЈА\/>]... [I<\,УЛАЗ \/>[I<\,ИЗЛАЗ\/>]]
sv: B<ptx> I<\,-G \/>[I<\,FLAGGA\/>]... [I<\,INFIL \/>[I<\,UTFIL\/>]]

source: DESCRIPTION
es: DESCRIPCIÓN
sr: ОПИС
sv: BESKRIVNING

source: Output a permuted index, including context, of the words in the input files.
es: Crea un índice permutado, con su contexto, de las palabras en los archivo dados.
sr: Даје пермутовани индекс, укључујући контекст, речи у улазним датотекама.
sv: Mata ut ett permuterat index, med sammanhang, av orden i indatafilerna.

source: With no FILE, or when FILE is -, read standard input.
es: Si no se define ningún ARCHIVO o bien se indica '-', se lee la entrada estándar.
sr: Без ДАТОТЕКЕ, или када је ДАТОТЕКА -, чита стандардни улаз.
sv: Utan FIL, eller när FIL är -, läs standard in.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.

source: output automatically generated references
es: muestra las referencias generadas automáticamente
sr: исписује самостално створене упуте
sv: Skriv ut automatiskt genererade referenser.

source: behave more like System V 'ptx'
es: hace que su ejecución se asemeje más a la versión de 'ptx' de System V.
sr: понаша се више као „ptx“ Система V
sv: Uppträd mer som System V:s B<ptx>.

source: B<-F>, B<--flag-truncation>=I<\,STRING\/>
es: B<-F>, B<--flag-truncation>=I<\,CADENA\/>
sr: B<-F>, B<--flag-truncation>=I<\,НИСКА\/>
sv: B<-F>, B<--flag-truncation>=I<\,STRÄNG\/>

source: use STRING for flagging line truncations. The default is '/'
es: emplea CADENA para marcar los cortes de línea. Por defecto emplea '/'
sr: користи НИСКУ за постављање заставица на скраћивања редова. Основно је „/“
sv: Använd STRÄNG för att markera avhuggna rader. Standard är ”/”.

source: B<-M>, B<--macro-name>=I<\,STRING\/>
es: B<-M>, B<--macro-name>=I<\,CADENA\/>
sr: B<-M>, B<--macro-name>=I<\,НИСКА\/>
sv: B<-M>, B<--macro-name>=I<\,STRÄNG\/>

source: macro name to use instead of 'xx'
es: se emplea CADENA como nombre para la macro en lugar de 'xx'
sr: назив макроа за коришћење уместо „xx“
sv: Makronamn att använda istället för ”xx”.

source: generate output as roff directives
es: la salida serán directivas roff
sr: ствара излаз као прописе рофф-а
sv: Generera utdata som roff-direktiv.

source: put references at right, not counted in B<-w>
es: sitúa las referencias a la derecha, no contabilizado en B<-w>
sr: ставља упуте на десно, не броји се у B<-w>
sv: Skriv referenser till höger, ej med i B<-w>.

source: B<-S>, B<--sentence-regexp>=I<\,REGEXP\/>
sr: B<-S>, B<--sentence-regexp>=I<\,РЕГИЗР\/>
sv: B<-S>, B<--sentence-regexp>=I<\,REGUTTR\/>

source: for end of lines or end of sentences
es: para el fin de línea o de frase
sr: за крај редова или за крај реченица
sv: För radslut eller meningsslut.

source: generate output as TeX directives
es: la salida serán directivas TeX
sr: ствара излаз као пропис ТеКс-а
sv: Generera utdata som TeX-direktiv.

source: B<-W>, B<--word-regexp>=I<\,REGEXP\/>
sr: B<-W>, B<--word-regexp>=I<\,РЕГИЗР\/>
sv: B<-W>, B<--word-regexp>=I<\,REGUTTR\/>

source: use REGEXP to match each keyword
es: emplea la expresión regular REGEXP para concordar con cada palabra clave
sr: користи РЕГИЗР за поклапање сваке кључне речи
sv: Använd REGUTTR för att matcha varje nyckelord.

source: B<-b>, B<--break-file>=I<\,FILE\/>
es: B<-b>, B<--break-file>=I<\,ARCHIVO\/>
sr: B<-b>, B<--break-file>=I<\,ДАТОТЕКА\/>
sv: B<-b>, B<--break-file>=I<\,FIL\/>

source: word break characters in this FILE
es: caracteres de separación de palabras en este ARCHIVO
sr: знаци прекида речи у овој ДАТОТЕЦИ
sv: Ordmellanrumstecken i denna FIL.

source: fold lower case to upper case for sorting
es: ordena sin distinguir mayúsculas y minúsculas
sr: мења мала слова у велика за ређање
sv: Gör om gemener till versaler för sortering.

source: B<-g>, B<--gap-size>=I<\,NUMBER\/>
es: B<-g>, B<--gap-size>=I<\,NÚMERO\/>
sr: B<-g>, B<--gap-size>=I<\,БРОЈ\/>
sv: B<-g>, B<--gap-size>=I<\,ANTAL\/>

source: gap size in columns between output fields
es: tamaño en columnas del intervalo entre campos
sr: величина размака у ступцима исмеђу излазних поља
sv: Mellanrum i kolumner mellan utdatafält.

source: B<-i>, B<--ignore-file>=I<\,FILE\/>
es: B<-i>, B<--ignore-file>=I<\,ARCHIVO\/>
sr: B<-i>, B<--ignore-file>=I<\,ДАТОТЕКА\/>
sv: B<-i>, B<--ignore-file>=I<\,FIL\/>

source: read ignore word list from FILE
es: toma la lista de palabras a ignorar de este ARCHIVO
sr: чита списак речи занемаривања из ДАТОТЕКЕ
sv: Läs lista av ord att ignorera från FIL.

source: B<-o>, B<--only-file>=I<\,FILE\/>
es: B<-o>, B<--only-file>=I<\,ARCHIVO\/>
sr: B<-o>, B<--only-file>=I<\,ДАТОТЕКА\/>
sv: B<-o>, B<--only-file>=I<\,FIL\/>

source: read only word list from this FILE
es: toma las palabras a considerar de este archivo
sr: чита списак речи само из ове ДАТОТЕКЕ
sv: Läs lista av ord att endast använda från FIL.

source: first field of each line is a reference
es: el primer campo de cada línea es una referencia
sr: прво поље сваког реда је упута
sv: Första fältet på varje rad är en referens.

source: B<-t>, B<--typeset-mode> - not implemented -
es: B<-t>, B<--typeset-mode> - sin implementar -
sr: B<-t>, B<--typeset-mode> - није примењено -
sv: B<-t>, B<--typeset-mode> - ej implementerat -

source: B<-w>, B<--width>=I<\,NUMBER\/>
es: B<-w>, B<--width>=I<\,NÚMERO\/>
sr: B<-w>, B<--width>=I<\,БРОЈ\/>
sv: B<-w>, B<--width>=I<\,ANTAL\/>

source: output width in columns, reference excluded
es: ancho de las columnas que se muestran, sin considerar la referencia
sr: излазна ширина у ступцима, упута искључена
sv: Utmatningsbredd i kolumner, utan referenser.

source: display this help and exit
es: muestra la ayuda y finaliza
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.

source: output version information and exit
es: muestra la versión del programa y termina
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.

source: AUTHOR
es: AUTOR
sr: АУТОР
sv: UPPHOVSMAN

source: Written by F. Pinard.
es: Escrito por F. Pinard.
sr: Написао је Ф. Пинар.
sv: Skrivet av F. Pinard.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: COPYRIGHT
sr: АУТОРСКА ПРАВА

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
es: VÉASE TAMBIÉN
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/ptxE<gt>
es: Documentación completa E<lt>https://www.gnu.org/software/coreutils/ptxE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/ptxE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/ptxE<gt>

source: or available locally via: info \(aq(coreutils) ptx invocation\(aq
es: también disponible localmente ejecutando: info \(aq(coreutils) ptx invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) ptx invocation\(aq“
sv: eller tillgängligt lokalt via: info \(aq(coreutils) ptx invocation\(aq

source: September 2020
es: Septiembre de 2020
sr: Септембра 2020

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
sr: Октобра 2021
sv: oktober 2021

source: March 2022
es: Marzo 2022
sr: Марта 2022
sv: mars 2022

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
es: Agosto de 2022
sr: Августа 2022
sv: augusti 2022

source: September 2021
es: Septiembre de 2021
sr: Септембра 2021

source: ptx - produce a permuted index of file contents
es: ptx - crea un índice permutado del contenido de un archivo
