Repository: sebras/manpages-l10n
Catalog: po/*/man1/repoclosure.1.po
Languages: de

source: 13 January 2013
de: 13. Januar 2013

source: NAME
de: BEZEICHNUNG

source: repoclosure - display a list of unresolved dependencies for a yum repository
de: repoclosure - eine Liste unaufgelöster Abhängigkeiten für eine Yum-Paketquelle anzeigen

source: SYNOPSIS
de: ÜBERSICHT

source: B<repoclosure> [options]
de: B<repoclosure> [Optionen]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<repoclosure> is a program that reads package metadata from one or more yum repositories, checks all dependencies, and displays a list of packages with unresolved dependencies.
de: B<repoclosure> liest Paket-Metadaten aus einer oder mehreren Yum-Paketquellen, überprüft alle Abhängigkeiten und zeigt eine Liste von Paketen mit nicht aufgelösten Abhängigkeiten an.

source: OPTIONS
de: OPTIONEN

source: Display a help message, and then quit.
de: zeigt eine Hilfemeldung an und beendet das Programm.

source: B<-c CONFIG, --config=CONFIG>
de: B<-c KONFIGURATION, --config=KONFIGURATION>

source: Config file to use (defaults to /etc/yum.conf).
de: gibt die zu verwendende Konfigurationsdatei an, Vorgabe ist /etc/yum.conf.

source: Check packages of the given archs, can be specified multiple times (default: current arch).
de: prüft die Pakete für die angegebenen Architekturen. Dies kann mehrmals angegeben werden, Vorgabe ist die aktuelle Architektur.

source: B<--basearch=BASEARCH>
de: B<--basearch=BASIS-ARCH>

source: Set the basearch for yum to run as.
de: legt die Basisarchitektur fest, für die Yum ausgeführt werden soll.

source: Check build dependencies only (needs source repos enabled).
de: überprüft lediglich die für die Erstellung nötigen Abhängigkeiten. Dazu müssen die Paketquellen mit Quell-RPMs aktiviert sein.

source: B<-l LOOKASIDE, --lookaside=LOOKASIDE>
de: B<-l WEITERE, --lookaside=WEITERE>

source: Specify a lookaside repo id to query, can be specified multiple times.
de: gibt die ID einer weiteren abzufragenden Paketquelle an. Dies kann mehrmals angegeben werden.

source: B<-r REPOID, --repoid=REPOID>
de: B<-r PAKETQUELLEN-ID, --repoid=PAKETQUELLEN-ID>

source: Specify repo ids to query, can be specified multiple times (default is all enabled).
de: gibt die Kennungen der abzufragenden Paketquellen an. Dies kann mehrmals angegeben werden, in der Voreinstellung sind alle aktiviert.

source: Use a temp dir for storing/accessing yum-cache.
de: verwendet ein temporäres Verzeichnis zum Speichern und für den Zugriff auf den Yum-Zwischenspeicher.

source: Run quietly: no warnings printed to stderr.
de: aktiviert den stillen Modus: Es werden keine Warnungen in die Standardfehlerausgabe geleitet.

source: Check only the newest packages in the repos.
de: prüft nur die neuesten Pakete in den Paketquellen.

source: B<--repofrompath=REPOID,PATH/URL>
de: B<--repofrompath=PAKETQUELLEN-ID,PFAD/URL>

source: Specify a path or url to a repository (same path as in a baseurl) to add to the repositories for this query. This option can be used multiple times. If you want to view only the pkgs from this repository combine this with --repoid. The repoid for the repository is specified by REPOID.
de: gibt einen Pfad oder eine URL zu einer Paketquelle an (gleicher Pfad wie in einer Basis-URL), die als zusätzliche Paketquelle in diese Abfrage einbezogen werden soll. Diese Option kann mehrfach angegeben werden. Wenn lediglich die Pakete aus genau dieser Paketquelle berücksichtigt werden sollen, können Sie dies mit --repoid kombinieren. Die Paketquellen-ID wird durch PAKETQUELLEN-ID angegeben.

source: B<-p PKG, --pkg=PKG>
de: B<-p PAKET, --pkg=PAKET>

source: Check closure for this package only
de: zeigt den Auflösungsstatus der Abhängigkeiten nur für dieses Paket an.

source: B<-g GROUP, --group=GROUP>
de: B<-g GRUPPE, --group=GRUPPE>

source: Check closure for packages in this group only
de: zeigt den Auflösungsstatus der Abhängigkeiten nur für diese Gruppe an.

source: SEE ALSO
de: SIEHE AUCH

source: I<yum.conf (5)> http://yum.baseurl.org/
de: B<yum.conf>(5) http://yum.baseurl.org/

source: AUTHORS
de: AUTOREN

source: See the Authors file included with this program.
de: Lesen Sie die mit diesem Programm gelieferte Autorenliste.
