Repository: sebras/manpages-l10n
Catalog: po/*/man1/rnano.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: rnano - a restricted nano
de: rnano - ein eingeschränkter Nano

source: SYNOPSIS
de: ÜBERSICHT

source: B<rnano> [I<options>] [[+I<line>[,I<column>]]\ I<file>]...
de: B<rnano> [I<Optionen>] [[+I<Zeile>[,I<Spalte>]]\ I<Datei>]…

source: DESCRIPTION
de: BESCHREIBUNG

source: B<rnano> runs the B<nano> editor in restricted mode. This allows editing only the specified file or files, and doesn't allow the user access to the filesystem nor to a command shell.
de: B<rnano> führt den Editor B<nano> im eingeschränkten Modus aus. Dies ermöglicht es, ausschließlich die angegebene(n) Datei(en) zu bearbeiten und verhindert den Benutzerzugriff auf sowohl das Dateisystem als auch die Befehlszeile.

source: In restricted mode, B<nano> will:
de: Im eingeschränkten Modus wird B<nano>:

source: not allow suspending;
de: den Rechner nicht in einen Energiesparmodus versetzen;

source: not allow saving the current buffer under a different name;
de: den aktuellen Puffer nicht unter einem anderen Namen speichern;

source: not allow inserting another file or opening a new buffer;
de: nicht erlauben, eine andere Datei einzufügen oder einen neuen Puffer zu öffnen;

source: not allow appending or prepending to any file;
de: nicht erlauben, etwas an eine andere Datei anzuhängen oder ihr voranzustellen;

source: not make backup files nor do spell checking.
de: weder Sicherungsdateien erstellen noch eine Rechtschreibprüfung vornehmen.

source: OPTIONS
de: OPTIONEN

source: Show the available command-line options and exit.
de: zeigt die verfügbaren Befehlszeilenoptionen an und beendet das Programm.

source: For all existing options, see the B<nano>(1) man page.
de: Für alle verfügbaren Optionen, siehe die Handbuchseite zu B<nano>(1).

source: BUGS
de: FEHLER

source: Please report bugs via I<https://savannah.gnu.org/bugs/?group=nano>.
de: Bitte melden Sie Fehler (auf Englisch) auf I<https://savannah.gnu.org/bugs/?group=nano>.

source: SEE ALSO
de: SIEHE AUCH

source: December 2020
de: Dezember 2020

source: December 2021
de: Dezember 2021

source: October 2021
de: Oktober 2021
