Repository: sebras/manpages-l10n
Catalog: po/*/man1/rpmlint.1.po
Languages: de

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: rpmlint - check common problems in rpm packages
de: rpmlint - auf häufig vorkommende Probleme in RPM-Paketen prüfen

source: SYNOPSIS
de: ÜBERSICHT

source: B<rpmlint> [I<OPTION>]... [I<FILE>|I<PACKAGE>]...
de: B<rpmlint> [I<OPTION>] … [I<DATEI>|I<PAKET>] …

source: DESCRIPTION
de: BESCHREIBUNG

source: B<rpmlint> is a tool for checking common errors in rpm packages. It can be used to test individual packages and spec files before uploading or to check an entire distribution. By default all applicable checks are processed but specific checks can be performed by using command line parameters.
de: B<rpmlint> ist ein Werkzeug zum Prüfen auf häufig vorkommende Fehler in RPM-Paketen. Es kann zum Testen einzelner Pakete und Spec-Dateien vor dem Hochladen oder zum Überprüfen ganzer Distributionen verwendet werden. Standardmäßig werden alle anwendbaren Überprüfungen durchgeführt, aber spezifische Prüfungen können auch über Befehlszeilenparameter ausgeführt werden.

source: I<FILE> can be a rpm package file, a spec file, or a directory. In case of a directory, it is recursively searched for rpm and spec files to check. The special value B<-> results in standard input being read and treated as (single) spec file content. I<PACKAGE> is the name of an installed package or a B<glob>(7) pattern to match installed packages, unless a file by that name exists.
de: I<DATEI> kann eine RPM-Paketdatei, eine Spec-Datei oder ein Verzeichnis sein. Im Fall eines Verzeichnisses wird rekursiv nach zu überprüfenden RPM- und Spec-Dateien gesucht. Der spezielle Wert B<-> sorgt dafür, dass aus der Standardeingabe gelesen wird und dies als Inhalt einer (einzelnen) Spec-Datei aufgefasst wird. I<PAKET> ist der Name eines installierten Pakets oder ein B<glob>(7)-Muster, das auf installierte Pakete passt, es sei denn, eine Datei dieses Namens existiert.

source: Display explanations for reported messages.
de: zeigt Erklärungen zu den ausgegebenen Meldungen an.

source: B<-I>, B<--explain>=I<messageid>
de: B<-I>, B<--explain>=I<Meldungskennung>

source: Display explanations for the specified message identifiers and exit. This option may be given multiple times.
de: zeigt Erklärungen zu den angegebenen Meldungskennungen an und beendet das Programm. Diese Option kann mehrmals angegeben werden.

source: B<-c>, B<--check>=I<check>
de: B<-c>, B<--check>=I<Prüfung>

source: Run only the specified check. This option may be given multiple times to specify multiple checks to run. I<check> is the name of the Python module (as it would be given to Python's import statement) containing the check.
de: führt nur die angegebene Prüfung aus. Diese Option kann mehrmals angegeben werden, falls mehrere Prüfungen ausgeführt werden sollen. I<Prüfung> ist der Name des Python-Moduls (so wie es in der Import-Anweisung in Python angegeben werden würde), das die Prüfung enthält.

source: Check all installed packages.
de: überprüft alle installierten Pakete.

source: B<-C>, B<--checkdir>=I<dir>
de: B<-C>, B<--checkdir>=I<Verzeichnis>

source: Insert I<dir> to the front of the list of paths to load checks from, unless it is already in the list. The default list of check dirs typically contains only /usr/share/rpmlint. Directories in the check dirs list are also inserted to the front of the list of paths to load Python modules from when the check process begins.
de: stellt das angegebene I<Verzeichnis> der Pfadliste voran, aus der Prüfungen geladen werden sollen, sofern es sich noch nicht in der Liste befindet. Die vorgegebene Liste von Prüfungsverzeichnissen enthält typischerweise nur /usr/share/rpmlint. Die Verzeichnisse in den Prüfungsverzeichnislisten werden auch am Anfang der Liste der Pfade, aus denen Python-Module geladen werden, eingefügt, wenn der Prüfungsvorgang beginnt.

source: Display summary of command line options and exit.
de: zeigt eine Zusammenfassung der Befehlszeilenoptionen an und beendet das Programm.

source: Operate in verbose mode.
de: agiert im ausführlichen Modus.

source: B<-E>, B<--extractdir>=I<dir>
de: B<-E>, B<--extractdir>=I<Verzeichnis>

source: Base directory for extracted temporary files, default is what Python's tempfile.gettempdir() returns.
de: gibt das Basisverzeichnis für entpackte temporäre Dateien an. Die Vorgabe ist das, was die Python-Funktion B<tempfile.gettempdir>() zurückgibt.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: Ignore output filters.
de: ignoriert Ausgabefilter.

source: B<--rawout>=I<file>
de: B<--rawout>=I<Datei>

source: Write unfiltered output to I<file>.
de: schreibt die ungefilterte Ausgabe in die angegebene I<Datei>.

source: B<-f>, B<--file>=I<conffile>
de: B<-f>, B<--file>=I<Konfigurationsdatei>

source: Load user configuration from the specified file, default is $XDG_CONFIG_HOME/rpmlint (~/.config/rpmlint if $XDG_CONFIG_HOME is empty or not set).
de: lädt die Benutzerkonfiguration aus der angegebenen Datei. Die Vorgabe ist B<$XDG_CONFIG_HOME/rpmlint> (B<~/.config/rpmlint>, falls B<$XDG_CONFIG_HOME> leer oder nicht gesetzt ist).

source: B<-o>, B<--option>=I<value>
de: B<-o>, B<--option>=I<Wert>

source: Override a configuration option. I<value> is a whitespace separated string, first word of which is the option name to set, and the Python eval() return value for the rest is set as the value for the option. Passing only an option name is treated as if None was passed as its value. See the file "config" shipped with rpmlint for the list of configuration options and their types. For example: -o "NetworkEnabled True" -o "Distribution \(aqMy favorite distro\(aq" -o "MaxLineLength 80" -o "ValidShells (\(aq/bin/sh\(aq, \(aq/bin/bash\(aq)"
de: setzt eine Konfigurationsoption außer Kraft. Der angegebene I<Wert> ist eine durch Leerraum getrennte Zeichenkette, deren erstes Wort der Name der zu festzulegenden Option ist. Der Rückgabewert der Python-Funktion B<eval>() wird für den Rest als Wert für die Option festgelegt. Wenn nur ein Optionsname übergeben wird, dann wird dies so aufgefasst, als ob nichts als Wert übergeben worden wäre. Siehe die mit B<rpmlint> gelieferte Datei B<config> für eine Liste der Konfigurationsoptionen und deren Typen. Zum Beispiel: -o "NetworkEnabled True" -o "Distribution \(aqMeine Lieblingsdistribution\(aq" -o "MaxLineLength 80" -o "ValidShells (\(aq/bin/sh\(aq, \(aq/bin/bash\(aq)"

source: CAVEATS
de: EINSCHRÄNKUNGEN

source: All checks do not apply to all argument types. For best check coverage, run rpmlint on all source and binary packages your build produces. The set of checks rpmlint runs on source packages is a superset of the one for plain specfiles, the set of checks run for installed binary packages is a superset of the one for uninstalled binary package files, and the source and binary package check sets are quite different.
de: Nicht alle Prüfungen sind auf alle Argumenttypen anwendbar. Um die Prüfungen bestmöglich zu nutzen, führen Sie B<rpmlint> mit allen Quell- und Binärpaketen aus, die in Ihrer Erstellung produziert werden. Die Gruppe der Prüfungen, die B<rpmlint> auf Quellpakete anwendet, ist eine Obermenge derjenigen für einfache Spec-Dateien, die Gruppe der Prüfungen, die auf installierte Binärpakete angewendet werden, ist eine Obermenge derjenigen für nicht installierte Binärpaket-Dateien und die Prüfungen für Quell- und Binärpakete sind recht unterschiedlich.

source: FILES
de: DATEIEN

source: Built-in configuration. When invoked as I<someprefix>-rpmlint, /usr/share/rpmlint/config.I<someprefix> is used if it exists, otherwise /usr/share/rpmlint/config.
de: Eingebaute Konfiguration. Wenn als I<irgendein_Präfix>-rpmlint aufgerufen, wird B</usr/share/rpmlint/config.>I<irgendein_Präfix> verwendet, falls es existiert, anderenfalls B</usr/share/rpmlint/config>.

source: System wide configuration.
de: Systemweite Konfiguration.

source: B<$XDG_CONFIG_HOME/rpmlint> or B<~/.config/rpmlint>
de: B<$XDG_CONFIG_HOME/rpmlint> oder B<~/.config/rpmlint>

source: User configuration.
de: Benutzerkonfiguration.

source: No errors.
de: Keine Fehler.

source: Unspecified error.
de: Nicht spezifizierter Fehler.

source: Interrupted.
de: Abgebrochen.

source: One or more error message printed.
de: Eine oder mehrere Fehlermeldungen wurden ausgegeben.

source: Badness threshold exceeded.
de: Schlechtigkeitsschwellwert wurde überschritten.

source: AUTHOR
de: AUTOR

source: Originally written by Frdric Lepied, modified and maintained by numerous contributors since.
de: Ursprünglich von Frédéric Lepied geschrieben, seitdem von verschiedenen Mitwirkenden bearbeitet und betreut.

source: This program is licensed under the GNU General Public License, see the file COPYING included in the distribution archive.
de: Dieses Programm ist unter der GNU General Public License lizenziert, siehe die Datei COPYING im Distributionsarchiv.
