Repository: sebras/manpages-l10n
Catalog: po/*/man1/rsh.1.po
Languages: uk

source: September 2021
uk: Вересень 2021 року

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: rsh - Remote shell client
uk: rsh — клієнт віддаленої оболонки

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<rsh> [I<\,OPTION\/>...] [I<\,USER@\/>]I<\,HOST \/>[I<\,COMMAND \/>[I<\,ARG\/>...]]
uk: B<rsh> [I<\,ПАРАМЕТР\/>...] [I<\,КОРИСТУВАЧ@\/>]I<\,ВУЗОЛ \/>[I<\,КОМАНДА \/>[I<\,АРГУМЕНТ\/>...]]

source: DESCRIPTION
uk: ОПИС

source: remote shell
uk: віддалена оболонка

source: use only IPv4
uk: використовувати лише IPv4

source: use only IPv6
uk: використовувати лише IPv6

source: allows an eight-bit input data path at all times
uk: безумовно дозволяє шлях восьмибітових вхідних даних

source: turns on socket debugging (see setsockopt(2))
uk: вмикає діагностику сокета (див. setsockopt(2))

source: B<-e>, B<--escape>=I<\,CHAR\/>
uk: B<-e>, B<--escape>=I<\,СИМВОЛ\/>

source: allows user specification of the escape character (``~'' by default)
uk: уможливлює задання користувачем символу екранування (типовим символом є ``~'')

source: B<-l>, B<--user>=I<\,USER\/>
uk: B<-l>, B<--user>=I<\,КОРИСТУВАЧ\/>

source: run as USER on the remote system
uk: запустити від імені КОРИСТУВАЧА на віддаленій системі

source: use I<\,/dev/null\/> as input
uk: скористатися I<\,/dev/null\/>, як вхідними даними

source: give this help list
uk: показати ці довідкові дані

source: give a short usage message
uk: отримати коротке повідомлення щодо користування

source: print program version
uk: вивести дані щодо версії програми

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
uk: Обов’язкові і додаткові аргументи до довгих форм запису параметрів є також обов’язковими або додатковими для всіх відповідних скорочених форм запису.

source: AUTHOR
uk: АВТОР

source: Written by many authors.
uk: Має багато авторів.

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: Report bugs to E<lt>bug-inetutils@gnu.orgE<gt>.
uk: Про вади слід повідомляти за адресою E<lt>bug-inetutils@gnu.orgE<gt>.

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2021 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: The full documentation for B<rsh> is maintained as a Texinfo manual. If the B<info> and B<rsh> programs are properly installed at your site, the command
uk: Повноцінну документацію з B<rsh> можна знайти у довіднику Texinfo. Якщо у вашій системі встановлено B<info> та B<rsh>, за допомогою команди

source: should give you access to the complete manual.
uk: ви зможете отримати доступ до повноцінного підручника.
