Repository: sebras/manpages-l10n
Catalog: po/*/man1/rwall.1.po
Languages: da, hu

source: August 15, 1999
da: 15. august 1999
hu: 1999. augusztus 15.

source: NAME
da: NAVN
hu: NÉV

source: send a message to users logged on a host
da: send en besked til brugere der er logget på en vært
hu: üzenetet küld a bejelentkezett felhasználóknak egy távoli gépre

source: E<.Nm rwall> E<.Ar host> E<.Op Ar file>
da: E<.Nm rwall> E<.Ar vært> E<.Op Ar fil>
hu: E<.Nm rwall> E<.Ar host> E<.Op Ar fájl>

source: DESCRIPTION
da: BESKRIVELSE
hu: LEÍRÁS

source: The E<.Nm rwall> command sends a message to the users logged into the specified host. The message to be sent can be typed in and terminated with EOF or it can be in a E<.Ar file>.
da: Kommandoen E<.Nm rwall> sender en besked til de brugere, der er logget ind på den specificerede vært. Beskeden, der sendes, kan tastes ind og afsluttes med EOF, eller den kan være i en E<.Ar fil>.
hu: Az E<.Nm rwall> parancs üzenetet küld a bejelentkezett felhasználóknak a megadott gépre. Az üzenetet begépelhetjük, a végét egy EOF-al lezárva, vagy egy E<.Ar fájl> -ba is írhatjuk.

source: DIAGNOSTICS
da: DIAGNOSTIK
hu: DIAGNOSZTIKA

source: rwall: RPC: Program not registered
da: rwall: RPC: Program ikke registreret

source: The E<.Xr rpc.rwalld 8> daemon has not been started on the remote host.
da: Dæmonen E<.Xr rpc.rwalld 8> er ikke blevet startet på den eksterne vært.
hu: Az E<.Xr rpc.rwalld 8> démon nincs elindítva a távoli gépen.

source: rwall: RPC: Timed out
da: rwall: RPC: Tidsudløb

source: A communication error occurred. Either the network is excessively congested, or the E<.Xr rpc.rwalld 8> daemon has terminated on the remote host.
da: Der opstod en kommunikationsfejl. Enten er netværket overbelastet, eller også er dæmonen E<.Xr rpc.rwalld 8> blevet stoppet på den eksterne vært.
hu: Kommunkikációs hiba. Vagy a hálózat túlterhelt, vagy az E<.Xr rpc.rwalld 8> démon futása szakadt meg a távoli gépen.

source: rwall: RPC: Port mapper failure - RPC: Timed out
da: rwall: RPC: Port mapper-fejl - RPC: Tidsudløb

source: The remote host is not running the portmapper (see E<.Xr portmap 8 ),> and cannot accommodate any RPC-based services. The host may be down.
da: Den eksterne vært afvikler ikke portmapper (se E<.Xr portmap 8 ),> og kan derfor ikke imødekomme RPC-baserede tjenester. Værten kan være nede.
hu: A távoli gépen nem fut a a portmapper (lásd E<.Xr portmap 8 ),> és nem tud fogadni RPC alapú szolgáltatásokat. A gép talán ki van kap- csolva.

source: SEE ALSO
da: SE OGSÅ
hu: LÁSD MÉG

source: HISTORY
da: HISTORIK
hu: TÖRTÉNET

source: The E<.Nm rwall> command appeared in E<.Tn SunOS>.
da: Kommandoen E<.Nm rwall> fremgik af E<.Tn SunOS>.
hu: Az E<.Nm rwall> parancs előszőr a E<.Tn SunOS> -ben jelent meg.

source: E<.Nm rwall> E<.Ar host> E<.Op Ar file> E<.Nm rwall> E<.Ar -n netgroup> E<.Op Ar file>
da: E<.Nm rwall> E<.Ar vært> E<.Op Ar fil> E<.Nm rwall> E<.Ar -n netgroup> E<.Op Ar fil>
hu: E<.Nm rwall> E<.Ar host> E<.Op Ar fájl> E<.Nm rwall> E<.Ar -n netgroup> E<.Op Ar fájl>

source: The E<.Nm rwall> command sends a message to the users logged into the specified host or to users on all hosts in the specified netgroup. The message to be sent can be typed in and terminated with EOF or it can be in a E<.Ar file>.
da: Kommandoen E<.Nm rwall> sender en besked til brugerne logget på den specificerede vært eller til brugere på alle værter i den specificerede netgruppe. Beskeden, der sendes, kan tastes ind og afsluttes med EOF, eller den kan være i en E<.Ar fil>.

source: The remote host is not running the portmapper (see E<.Xr portmap 8 ),> and cannot accomodate any RPC-based services. The host may be down.
da: Den eksterne vært afvikler ikke portmapper (se E<.Xr portmap 8 ),> og kan derfor ikke imødekomme RPC-baserede tjenester. Værten kan være nede.
hu: A távoli gépen nem fut a portmapper (lásd E<.Xr portmap 8 ),> így nem tud RPC alapú szolgáltatásokat nyújtani. Lehet hogy a host nem működik.

source: SYNOPSIS
hu: ÖSSZEGZÉS
