Repository: sebras/manpages-l10n
Catalog: po/*/man1/sane-config.1.po
Languages: de

source: 10 Jul 2008
de: 10. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-config - get information about the installed version of libsane
de: sane-config - Informationen über die installierte Version von Libsane erhalten

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<sane-config> is a tool that is used to determine the compiler and linker flags that should be used to compile and link SANE frontends to a SANE backend library (libsane).
de: Mit dem Werkzeug B<sane-config> können Sie die Compiler- und Linker-Flags bestimmen, die zum Kompilieren und Linken von SANE-Frontends mit einer SANE-Backend-Bibliothek (Libsane) verwendet werden sollten.

source: OPTIONS
de: OPTIONEN

source: B<sane-config> accepts the following options (you can't use more than one option at the same time):
de: B<sane-config> akzeptiert die folgenden Optionen (Sie können nicht mehrere Optionen gleichzeitig verwenden):

source: Print the currently installed version of libsane on the standard output.
de: gibt die aktuell installierte Version von Libsane in die Standardausgabe aus.

source: Print a short usage message. If I<OPTION> is specified, help for that option (e.g. B<--libs>) is printed (if available).
de: gibt eine kurze Hilfemeldung aus. Falls eine I<OPTION> angegeben ist, wird die Hilfe für diese Option (zum Beispiel B<--libs>) ausgegeben (sofern verfügbar).

source: Print the additional libraries that are necessary to link a SANE frontend to libsane.
de: gibt die zusätzlichen Bibliotheken aus, die zum Linken eines SANE-Frontends mit Libsane nötig sind.

source: Print the linker flags that are necessary to link a SANE frontend to libsane.
de: gibt die Linker-Flags aus, die zum Linken eines SANE-Frontends mit Libsane nötig sind.

source: Print the compiler flags that are necessary to compile a SANE frontend.
de: gibt die Compiler-Flags aus, die Kompilieren eines SANE-Frontends nötig sind.

source: Print the prefix used during compilation of libsane.
de: gibt das Präfix aus, das während der Kompilierung von Libsane verwendet wurde.

source: Print the exec-prefix used during compilation of libsane.
de: gibt das Präfix für ausführbare Dateien aus, das während der Kompilierung von Libsane verwendet wurde.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: This manual page was written by Julien BLACHE E<lt>I<jblache@debian.org>E<gt>I<,> for the Debian GNU/Linux system (but may be used by others).
de: Diese Handbuchseite wurde von Julien BLACHE E<lt>I<jblache@debian.org>E<gt> für das Debian GNU/Linux-System geschrieben (darf aber auch von anderen verwendet werden).

source: B<sane-config> is a tool that is used to determine the compiler and linker flags that should be used to compile and link B<SANE> frontends to a B<SANE> backend library (libsane).
de: Mit dem Werkzeug B<sane-config> können Sie die Compiler- und Linker-Flags bestimmen, die zum Kompilieren und Linken von B<SANE>-Frontends mit einer B<SANE>-Backend-Bibliothek (Libsane) verwendet werden sollten.

source: Print a short usage message. If OPTION is specified, help for that option (e.g. --libs) is printed (if available).
de: gibt eine kurze Hilfemeldung aus. Falls eine OPTION angegeben ist, wird die Hilfe für diese Option (zum Beispiel B<--libs>) ausgegeben (sofern verfügbar).

source: Print the additional libraries that are necessary to link a B<SANE> frontend to libsane.
de: gibt die zusätzlichen Bibliotheken aus, die zum Linken eines B<SANE>-Frontends mit Libsane nötig sind.

source: Print the linker flags that are necessary to link a B<SANE> frontend to libsane.
de: gibt die Linker-Flags aus, die zum Linken eines B<SANE>-Frontends mit Libsane nötig sind.

source: Print the compiler flags that are necessary to compile a B<SANE> frontend.
de: gibt die Compiler-Flags aus, die Kompilieren eines B<SANE>-Frontends nötig sind.

source: This manual page was written by Julien BLACHE E<lt>jblache@debian.orgE<gt>, for the Debian GNU/Linux system (but may be used by others).
de: Diese Handbuchseite wurde von Julien BLACHE E<lt>jblache@debian.orgE<gt> für das Debian GNU/Linux-System geschrieben (darf aber auch von anderen verwendet werden).
