Repository: sebras/manpages-l10n
Catalog: po/*/man1/scriptlive.1.po
Languages: uk

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: scriptlive - re-run session typescripts, using timing information
uk: scriptlive — повторний запуск скриптів введення з використанням даних щодо часу

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<scriptlive> [options] [B<-t>] I<timingfile> [B<-I>|B<-B>] I<typescript>
uk: B<scriptlive> [параметри] [B<-t>] I<файл-часу> [B<-I>|B<-B>] I<скрипт-введення>

source: DESCRIPTION
uk: ОПИС

source: This program re-runs a typescript, using stdin typescript and timing information to ensure that input happens in the same rhythm as it originally appeared when the script was recorded.
uk: Ця програма повторно запускає скрипт введення, користуючись даними щодо скрипту із стандартного джерела вхідних даних (stdin) і даними щодо часу для забезпечення того самого ритму введення, який було використано у початковому скрипті.

source: The B<session is executed> in a newly created pseudoterminal with the user\(cqs $SHELL (or defaults to I</bin/bash>).
uk: B<Сеанс буде виконано> у новоствореному псевдотерміналі із значенням $SHELL користувача (або типовим I</bin/bash>).

source: B<Be careful!> Do not forget that the typescript may contains arbitrary commands. It is recommended to use B<"scriptreplay --stream in --log-in typescript"> (or with B<--log-io> instead of B<--log-in>) to verify the typescript before it is executed by B<scriptlive>.
uk: B<Будьте обережні!> Не забувайте, що скрипт введення може містити довільні команди. Рекомендуємо скористатися B<"scriptreplay --stream in --log-in скрипт-введення"> (або з B<--log-io> замість B<--log-in>), щоб перевірити скрипт введення до того, як його буде виконано B<scriptlive>.

source: The timing information is what B<script>(1) outputs to file specified by B<--log-timing>. The typescript has to contain stdin information and it is what script1 outputs to file specified by B<--log-in> or B<--log-io>.
uk: Дані щодо часу — це те, що B<script>(1) виводить до файла, який вказано за допомогою параметра B<--log-timing>. Скрипт введення має містити дані stdin і це те, що script(1) виводить до файла, який вказано за допомогою параметра B<--log-in> або B<--log-io>.

source: OPTIONS
uk: ПАРАМЕТРИ

source: B<-I>, B<--log-in> I<file>
uk: B<-I>, B<--log-in> I<файл>

source: File containing B<script>\(aqs terminal input.
uk: Файл, що містить виведення до термінала B<скрипту>.

source: B<-B>, B<--log-io> I<file>
uk: B<-B>, B<--log-io> I<файл>

source: File containing B<script>\(aqs terminal output and input.
uk: Файл, що містить виведені і введення до термінала дані B<script>.

source: B<-t>, B<--timing> I<file>
uk: B<-t>, B<--timing> I<файл>

source: File containing B<script>\(aqs timing output. This option overrides old-style arguments.
uk: Файл, що містить виведені дані щодо часу B<script>. Цей параметр перевизначає аргументи у застарілому стилі.

source: B<-T>, B<--log-timing> I<file>
uk: B<-T>, B<--log-timing> I<файл>

source: Aliased to B<-t>, maintained for compatibility with B<script>(1) command-line options.
uk: Альтернативна форма B<-t>, супроводжується для сумісності із параметрами командного рядка B<script>(1).

source: B<-d>, B<--divisor> I<number>
uk: B<-d>, B<--divisor> I<число>

source: Speed up the replay displaying this I<number> of times. The argument is a floating-point number. It\(cqs called divisor because it divides the timings by this factor. This option overrides old-style arguments.
uk: Пришвидшити відтворення у вказану аргументом I<число> кількість разів. Аргументом може бути будь-яке десяткове дробове число із рухомою крапкою. Його називають дільником, оскільки на нього буде поділено часові значення. Цей параметр має вищий пріоритет за аргументи у застарілому стилі.

source: B<-m>, B<--maxdelay> I<number>
uk: B<-m>, B<--maxdelay> I<число>

source: Set the maximum delay between updates to I<number> of seconds. The argument is a floating-point number. This can be used to avoid long pauses in the typescript replay.
uk: Встановити максимальну затримку між оновленнями у значення I<число> секунд. Аргументом є дійсне число із рухомою крапкою. За допомогою цього параметра можна уникнути довгих пауз у відтворенні скрипту введення.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: EXAMPLES
uk: ПРИКЛАДИ

source: % script --log-timing file.tm --log-in script.in Script started, file is script.out % date E<lt>etc, etcE<gt> % exit Script done, file is script.out % scriptlive --log-timing file.tm --log-in script.in
uk: % script --log-timing file.tm --log-in script.in Скрипт запущено, файлом є script.out % date E<lt>тощо, тощоE<gt> % exit Скрипт виконано, файлом є script.out % scriptlive --log-timing file.tm --log-in script.in

source: AUTHORS
uk: АВТОРИ

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: Copyright © 2019 Karel Zak
uk: © Karel Zak, 2019

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
uk: Це програмне забезпечення є вільним, умови копіювання викладено у його початкових кодах. Умовами ліцензування програми НЕ передбачено жодних гарантій, зокрема гарантій працездатності або придатності для певної мети.

source: Released under the GNU General Public License version 2 or later.
uk: Випущено за умов дотримання Загальної громадської ліцензії GNU (GPL) версії 2 або новішої версії.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<scriptlive> command is part of the util-linux package which can be downloaded from
uk: B<scriptlive> є частиною пакунка util-linux, який можна отримати з

source: October 2019
uk: Жовтень 2019 року

source: B<scriptlive> [options] [B<-t>] I<timingfile> [B<-I|-B>] I<typescript>
uk: B<scriptlive> [параметри] [B<-t>] I<файл-часу> [B<-I>|B<-B>] I<скрипт-введення>

source: The B<session is executed> in a newly created pseudoterminal with the user's $SHELL (or defaults to /bin/bash).
uk: B<Сеанс буде виконано> у новоствореному псевдотерміналі із значенням $SHELL користувача (або типовим I</bin/bash>).

source: B<Be careful!> Do not forget that the typescript may contains arbitrary commands. It is recommended to use B<"scriptreplay --stream in --log-in typescript"> (or with B<--log-io> instead of B<--log-in\)> to verify the typescript before it is executed by B<scriptlive>(1).
uk: *Будьте обережні!* Не забувайте, що скрипт введення може містити довільні команди. Рекомендуємо скористатися *"scriptreplay --stream in --log-in скрипт-введення"* (або з B<--log-io> замість B<--log-in>), щоб перевірити скрипт введення до того, як його буде виконано B<scriptlive>(1).

source: The timing information is what B<script>(1) outputs to file specified by B<--log-timing>. The typescript has to contain stdin information and it is what B<script>(1) outputs to file specified by B<--log-in> or B<--log-io>.
uk: Дані щодо часу — це те, що B<script>(1) виводить до файла, який вказано за допомогою параметра B<--log-timing>. Скрипт введення має містити дані stdin і це те, що B<script>(1) виводить до файла, який вказано за допомогою параметра B<--log-in> або B<--log-io>.

source: B<-I>,B< --log-in >I<file>
uk: B<-I>, B<--log-in> I<файл>

source: File containing B<script>'s terminal input.
uk: Файл, що містить виведення до термінала B<скрипту>.

source: B<-B>,B< --log-io >I<file>
uk: B<-B>, B<--log-io> I<файл>

source: File containing B<script>'s terminal output and input.
uk: Файл, що містить виведені і введення до термінала дані B<script>.

source: B<-t>,B< --timing >I<file>
uk: B<-t>, B<--timing> I<файл>

source: File containing B<script>'s timing output. This option overrides old-style arguments.
uk: Файл, що містить виведені дані щодо часу B<script>. Цей параметр перевизначає аргументи у застарілому стилі.

source: B<-T>,B< --log-timing >I<file>
uk: B<-T>, B<--log-timing> I<файл>

source: Aliased to B<-t>, maintained for compatibility with B<script>(1) command-line options.
uk: Альтернативна форма B<-t>, супроводжується для сумісності із параметрами командного рядка B<script>(1).

source: B<-d>,B< --divisor >I<number>
uk: B<-d>,B< --divisor >I<число>

source: Speed up the replay displaying this I<number> of times. The argument is a floating-point number. It's called divisor because it divides the timings by this factor. This option overrides old-style arguments.
uk: Пришвидшити відтворення у вказану аргументом I<число> кількість разів. Аргументом може бути будь-яке десяткове дробове число із рухомою крапкою. Його називають дільником, оскільки на нього буде поділено часові значення. Цей параметр має вищий пріоритет за аргументи у застарілому стилі.

source: B<-m>,B< --maxdelay >I<number>
uk: B<-m>, B<--maxdelay> I<число>

source: Set the maximum delay between updates to I<number> of seconds. The argument is a floating-point number. This can be used to avoid long pauses in the typescript replay.
uk: Встановити максимальну затримку між оновленнями у значення I<число> секунд. Аргументом є дійсне число із рухомою крапкою. За допомогою цього параметра можна уникнути довгих пауз у відтворенні скрипту введення.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: Copyright \(co 2019 Karel Zak
uk: \(co Karel Zak, 2019

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
uk: Це безкоштовне програмне забезпечення; дивіться джерело для умов копіювання. НЕМАЄ гарантії; навіть не для ПРОДАЖУ чи ПРИДАТНОСТІ ДЛЯ КОНКРЕТНОЇ МЕТИ.

source: The scriptlive command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма sciptlive є частиною пакунка util-linux і доступна з E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: The timing information is what script1 outputs to file specified by B<--log-timing>. The typescript has to contain stdin information and it is what script1 outputs to file specified by B<--log-in> or B<--log-io>.
uk: Дані щодо часу — це те, що B<script>(1) виводить до файла, який вказано за допомогою параметра B<--log-timing>. Скрипт введення має містити дані stdin і це те, що script(1) виводить до файла, який вказано за допомогою параметра B<--log-in> або B<--log-io>.
