Repository: sebras/manpages-l10n
Catalog: po/*/man1/smime_keys.1.po
Languages: de

source: September 19, 2020
de: 19. September 2020

source: User Manuals
de: Benutzerhandbücher

source: NAME
de: BEZEICHNUNG

source: smime_keys - Utility to add S/MIME certificate to the internal database used by mutt
de: smime_keys - Dienstprogramm zum Hinzufügen eines S/MIME-Zertifikats zu der von Mutt genutzten internen Datenbank

source: SYNOPSIS
de: ÜBERSICHT

source: B<smime_keys> E<lt>operationE<gt> [file(s) | keyID [file(s)]]
de: B<smime_keys> E<lt>AktionE<gt> [Datei(en) | Schlüsselkennung [Datei(en)]]

source: DESCRIPTION
de: BESCHREIBUNG

source: The purpose of this tool is to manipulate the internal database of S/MIME certificates used by mutt to sign mail messages which will be sent or to verify mail messages received and signed with S/MIME.
de: Der Zweck dieses Werkzeugs ist die Bearbeitung der internen Datenbank der S/MIME-Zertifikate. Diese wird von Mutt zum Signieren der zu sendenden E-Mail-Nachrichten oder zum Überprüfen der empfangenen, mit S/MIME signierten Nachrichten verwendet.

source: OPTIONS
de: OPTIONEN

source: no files needed, inits directory structure.
de: Keine Dateien notwendig, Verzeichnisstruktur wird initialisiert.

source: no files needed. refreshes index files, including trust flag/expiration.
de: Keine Dateien notwendig, Indexdateien werden aktualisiert, einschließlich Vertrauensstufe und Ablauf.

source: lists the certificates stored in database.
de: listet die in der Datenbank gespeicherten Zertifikate auf.

source: keyID required. changes/removes/adds label.
de: Schlüsselkennung erforderlich. Label wird geändert/entfernt/hinzugefügt.

source: keyID required.
de: Schlüsselkennung erforderlich.

source: 1=keyID and optionally 2=CRL. Verifies the certificate chain, and optionally whether this certificate is included in supplied CRL (PEM format). Note: to verify all certificates at the same time, replace keyID with "all".
de: 1=Schlüsselkennung und optional 2=CRL. Überprüft die Zertifikatkette und optional, ob dieses Zertifikat in der angegebenen CRL enthalten ist (im PEM-Format). Hinweis: Um alle Zertifikate zugleich zu überprüfen, ersetzen Sie die Schlüsselkennung durch »all«.

source: certificate required.
de: Zertifikat erforderlich.

source: three files reqd: 1=Key, 2=certificate plus 3=intermediate certificate(s).
de: Drei Dateien sind erforderlich: 1=Schlüssel, 2=Zertifikat und 3=Zwischenzertifikat(e).

source: one file reqd. Adds keypair to database. file is PKCS12 (e.g. export from netscape).
de: Eine Datei ist erforderlich. Fügt ein Schlüsselpaar zur Datenbank hinzu. Die Datei ist im PKCS12-Format (zum Beispiel aus Netscape exportiert).

source: one file reqd. Adds keypair to database. (file was converted from e.g. PKCS12).
de: Eine Datei erforderlich. Fügt ein Schlüsselpaar zur Datenbank hinzu (die Datei wurde beispielsweise aus PKCS12 konvertiert).

source: one file reqd. Adds PEM root certificate to the location specified within muttrc (smime_verify_* command).
de: Eine Datei erforderlich. Fügt ein PEM-Wurzelzertifikat zum in der Datei »muttrc« angegebenen Speicherort hinzu (Befehl »smime_verify *«).

source: NO WARRANTIES
de: KEINE GARANTIEN

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
de: Dieses Programm wurde mit dem Ziel veröffentlicht, dass Sie es nützlich finden, jedoch OHNE JEGLICHE GARANTIE, sogar ohne eine implizite Garantie der MARKTREIFE oder der EIGNUNG FÜR EINEN SPEZIELLEN ZWECK. Schauen Sie für weitere Informationen bitte in der »GNU General Public License« (GNU GPL) nach.

source: Mutt Home Page: http://www.mutt.org/
de: E<.UR http://www.mutt.org/> Mutt-ProjektseiteE<.UE>

source: May 2009
de: Mai 2009

source: The purpose of this tool is to manipulate the internal database of S/MIME certificates used by mutt to sign mail messages which will be sent or to verify mail messages received and signed with S/MIME
de: Der Zweck dieses Werkzeugs ist die Bearbeitung der internen Datenbank der S/MIME-Zertifikate. Diese wird von Mutt zum Signieren der zu sendenden E-Mail-Nachrichten oder zum Überprüfen der empfangenen, mit S/MIME signierten Nachrichten verwendet.

source: 1=keyID and optionally 2=CRL Verifies the certificate chain, and optionally whether this certificate is included in supplied CRL (PEM format). Note: to verify all certificates at the same time, replace keyID with "all"
de: 1=Schlüsselkennung und optional 2=CRL. Überprüft die Zertifikatkette und optional, ob dieses Zertifikat in der angegebenen CRL enthalten ist (im PEM-Format). Hinweis: Um alle Zertifikate zugleich zu überprüfen, ersetzen Sie die Schlüsselkennung durch »all«.

source: one file reqd. Adds PEM root certificate to the location specified within muttrc (smime_verify_* command)
de: Eine Datei erforderlich. Fügt ein PEM-Wurzelzertifikat zum in der Datei »muttrc« angegebenen Speicherort hinzu (Befehl »smime_verify *«).
