Repository: sebras/manpages-l10n
Catalog: po/*/man1/sort.1.po
Languages: de, es, hu, sr, sv

source: April 2022
es: Abril de 2022
hu: 2022 április
sr: Априла 2022

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: User Commands
de: Dienstprogramme für Benutzer
es: Órdenes de usuario
hu: Felhasználói parancsok
sr: Корисничке наредбе
sv: Användarkommandon

source: NAME
de: BEZEICHNUNG
es: NOMBRE
hu: NÉV
sr: НАЗИВ
sv: NAMN

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS
hu: ÖSSZEGZÉS
sr: УВОД

source: B<sort> [I<\,OPTION\/>]... [I<\,FILE\/>]...
de: B<sort> [I<\,OPTION\/>]… [I<\,DATEI\/>]…
es: B<sort> [I<\,OPCIÓN\/>]... [I<\,ARCHIVO\/>]...
hu: B<sort> [I<\,KAPCSOLÓ\/>]... [I<\,FÁJL\/>]...
sr: B<sort> [I<\,ОПЦИЈА\/>]... [I<\,ДАТОТЕКА\/>]...
sv: B<sort> [I<\,FLAGGA\/>]... [I<\,FIL\/>]...

source: B<sort> [I<\,OPTION\/>]... I<\,--files0-from=F\/>
de: B<sort> [I<\,OPTION\/>]… I<\,--files0-from=D\/>
es: B<sort> [I<\,OPCIÓN\/>]... I<\,--files0-from=F\/>
hu: B<sort> [I<\,KAPCSOLÓ\/>]... [I<\,--files0-from=F\/>
sr: B<sort> [I<\,ОПЦИЈА\/>]... I<\,--files0-from=Д\/>
sv: B<sort> [I<\,FLAGGA\/>]... I<\,--files0-from=F\/>

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN
hu: LEÍRÁS
sr: ОПИС
sv: BESKRIVNING

source: Write sorted concatenation of all FILE(s) to standard output.
de: Sortierte Verkettung aller DATEI(en) in die Standardausgabe schreiben.
es: Muestra todos los ARCHIVO(S) ordenados y concatenados por la salida estándar.
hu: Az összes FÁJL rendezett konkatenációjának kiírása a szabványos kimenetre.
sr: Исписује поређано надодавање свих ДАТОТЕКА на стандардни излаз.
sv: Skriv en sorterad sammanfogning av alla FIL(er) till standard ut.

source: With no FILE, or when FILE is -, read standard input.
de: liest ohne I<DATEI> oder wenn I<DATEI> B<-> ist, aus der Standardeingabe.
es: Si no se define ningún ARCHIVO o bien se indica '-', se lee la entrada estándar.
hu: Ha a FÁJL nincs megadva, vagy -, akkor a szabványos bemenetet olvassa.
sr: Без ДАТОТЕКЕ, или када је ДАТОТЕКА -, чита стандардни улаз.
sv: Utan FIL, eller när FIL är -, läs standard in.

source: Mandatory arguments to long options are mandatory for short options too. Ordering options:
de: Die obligatorischen Argumente für Optionen sind für deren Kurz- und Langform gleich. Sortieroptionen:
es: Los argumentos obligatorios para las opciones largas también los son para las opciones cortas. Opciones de ordenado:
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők. Rendezési lehetőségek:
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође. Опције ређања:
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta. Sorteringsflaggor:

source: ignore leading blanks
de: Führende Leerzeichen ignorieren
es: ignora los espacios en blanco iniciales
hu: kezdő üreshelyek figyelmen kívül hagyása
sr: занемарује водеће празнине
sv: Ignorera inledande mellanslag.

source: consider only blanks and alphanumeric characters
de: Nur Leer‐ und alphanumerische Zeichen berücksichtigen
es: solo tiene en cuenta espacios en blanco y los caracteres alfanuméricos
hu: csak üres és alfanumerikus karakterek figyelembe vétele
sr: узима у обзир само празнине и словно-бројевне знаке
sv: Betrakta endast alfanumeriska och blanka tecken.

source: fold lower case to upper case characters
de: Klein‐ als Großbuchstaben behandeln
es: no distingue entre mayúsculas y minúsculas
hu: kisbetűk nagybetűkké alakítása
sr: пребацује знакове малих слова у велика
sv: Byt gemener mot versaler.

source: compare according to general numerical value
de: Anhand des allgemeinen numerischen Wertes vergleichen
es: realiza la comparación según el valor numérico
hu: összehasonlítás az általános számérték szerint
sr: упоређује према општој бројчаној вредности
sv: Jämför enligt generellt numeriskt värde.

source: consider only printable characters
de: Nur druckbare Zeichen berücksichtigen
es: solo tiene en cuenta caracteres imprimibles
hu: csak nyomtatható karakterek figyelembe vétele
sr: узима у обзир само исписиве знакове
sv: Beakta endast skrivbara tecken.

source: compare (unknown) E<lt> 'JAN' E<lt> ... E<lt> 'DEC'
de: Reihenfolge: (unbekannt) E<lt> »JAN« E<lt> … E<lt> »DEZ«
es: compara (desconocido) E<lt> 'ENE' E<lt> ... E<lt> 'DIC'
hu: összehasonlítás: (ismeretlen) E<lt> „JAN” E<lt> … E<lt> „DEC”
sr: упоређује (непознато) E<lt> „ЈАН“ E<lt> ... E<lt> „ДЕЦ“
sv: Jämför (okänd) E<lt> 'JAN' E<lt> … E<lt> 'DEC'.

source: compare human readable numbers (e.g., 2K 1G)
de: Vergleicht menschenlesbare Zahlen (z. B. 2K 1G)
es: compara números en formato humanamente legible (p.ej: 2K,1G, etc...)
hu: közérthető számok összehasonlítása (például: 2K 1G)
sr: пореди људима читљиве бројеве (нпр., 2K 1G)
sv: Jämför mänskligt läsbara tal (t.ex., 2K 1G).

source: compare according to string numerical value
de: Anhand des numerischen Werts der Zeichenkette vergleichen
es: compara según el número
hu: karakterláncok számértéke szerinti összehasonlítás
sr: упоређује према општој бројчаној вредности
sv: Jämför enligt strängens numeriska värde.

source: B<--random-source>=I<\,FILE\/>
de: B<--random-source>=I<\,DATEI\/>
es: B<--random-source>=I<\,ARCHIVO\/>
hu: B<--random-source>=I<\,FÁJL\/>
sr: B<--random-source>=I<\,ДАТОТЕКА\/>
sv: B<--random-source>=I<\,FIL\/>

source: get random bytes from FILE
de: Zufällige Byte aus DATEI nehmen
es: extrae bytes aleatoriamente de ARCHIVO
hu: véletlen bájtok a FÁJLBÓL
sr: добавља насумичне бајтове из ДАТОТЕКЕ
sv: Hämta slumpbyte:ar från FIL.

source: reverse the result of comparisons
de: Das Ergebnis der Vergleiche umkehren
es: invierte el resultado de las comparaciones
hu: az összehasonlítások eredményének megfordítása
sr: окреће резултат поређења
sv: Vänd på resultatet av jämförelserna.

source: B<--sort>=I<\,WORD\/>
de: B<--sort>=I<\,WORT\/>
es: B<--sort>=I<\,PALABRA\/>
hu: B<--sort>=I<\,SZÓ\/>
sr: B<--sort>=I<\,РЕЧ\/>
sv: B<--sort>=I<\,ORD\/>

source: sort according to WORD: general-numeric B<-g>, human-numeric B<-h>, month B<-M>, numeric B<-n>, random B<-R>, version B<-V>
de: Gemäß WORT sortieren: general-numeric B<-g>, human-numeric B<-h>, month B<-M>, numeric B<-n>, random B<-R>, version B<-V>
es: ordena según la PALABRA: B<-g> por número en general, B<-h> genérico tal como lo haría un humano, B<-n> numérico, B<-R> aleatorio, B<-V> por número de versión
hu: rendezés a SZÓ szerint: general-numeric B<-g>, human-numeric B<-h>, month B<-M>, numeric B<-n>, random B<-R>, version B<-V>
sr: ређа према РЕЧИ: опште-бројчано B<-g>, људско-бројчано B<-h>, месец B<-M>, бројчано B<-n>, насумично B<-R>, издање B<-V>
sv: Sortera enligt ORD: general-numeric B<-g>, human-numeric B<-h>, month B<-M>, numeric B<-n>, random B<-R>, version B<-V>.

source: natural sort of (version) numbers within text
de: Natürliche Sortierung von (Versions)nummern im Text
es: ordena de modo natural los número de versión según el texto
hu: (verzió)számok természetes rendezése a szövegen belül
sr: природно ређање бројева (издања) у тексту
sv: Naturlig sortering av (versions)nummer i text.

source: Other options:
de: Andere Optionen:
es: Otras opciones:
hu: Egyéb kapcsolók:
sr: Остале опције:
sv: Andra flaggor:

source: B<--batch-size>=I<\,NMERGE\/>
de: B<--batch-size>=I<\,ANZAHL\/>
es: B<--batch-size>=I<\,NFUSIÓN\/>
sr: B<--batch-size>=I<\,БРСТАПАЊА\/>
sv: B<--batch-size>=I<\,ANTAL\/>

source: merge at most NMERGE inputs at once; for more use temp files
de: Höchstens ANZAHL Eingaben gleichzeitig zusammenführen; bei mehr Eingaben temporäre Dateien benutzen
es: fusiona un máximo de NFUSIÓN entradas al mismo tiempo. Si fuese un mayor número, emplearía archivos temporales
hu: egyszerre legfeljebb NMERGE bemenet összefésülése, többhöz használjon ideiglenes fájlokat
sr: стапа највише БРСТАПАЊА улаза одједном; за већу употребу привремених датотека
sv: Slå samman högst ANTAL indatafiler åt gången, använd temporärfiler för filer.

source: check for sorted input; do not sort
de: Überprüfen, ob die Eingabe sortiert ist; nicht sortieren
es: solo comprueba si la entrada ya está ordenada. No ordena nada
hu: a bemenet rendezettségének ellenőrzése; ne rendezzen
sr: проверава за поређаним улазом; не ређа
sv: Kontrollera om indata är sorterad, sortera ej.

source: like B<-c>, but do not report first bad line
de: Wie B<-c>, aber erste schlechte Zeile nicht melden
es: igual que B<-c> pero no emite ningún diagnóstico
hu: mint a B<-c>, de nem jelenti az első hibás sort
sr: као B<-c>, али не извештава о првом лошем реду
sv: Som B<-c>, men rapportera inte en första felaktig rad.

source: B<--compress-program>=I<\,PROG\/>
sr: B<--compress-program>=I<\,ПРОГ\/>

source: compress temporaries with PROG; decompress them with PROG B<-d>
de: Temporäre Dateien mit PROG komprimieren; mit PROG B<-d> wieder entpacken
es: comprime temporalmente con PROG. Para descomprimir utiliza PROG B<-d>
hu: ideiglenes fájlok tömörítése a PROG, kibontása a PROG -d segítségével
sr: пакује привремености ПРОГРАМОМ; распакује их са ПРОГРАМ B<-d>
sv: Komprimera temporärfiler med PROG; packa upp dem med PROG B<-d>.

source: annotate the part of the line used to sort, and warn about questionable usage to stderr
de: Den Teil der Zeile, der für die Sortierung benutzt wurde, mit Kommentar beschriften und bei fraglicher Verwendung eine Warnung auf die Standardfehlerausgabe schreiben
es: destaca la parte de la línea empleada por sort e informa por la salida de error estándar de cualquier problema.
hu: a rendezésre használt sorszakasz jelzése, és figyelmeztetés a megkérdőjelezhető használatról a szabványos kimenetre
sr: прибележава део реда коришћеног за ређање, и упозорава о упитљивом коришћењу на стандардној грешци
sv: Annotera delarna av raden som används för sortering, och varna om tveksam användning till standard fel.

source: B<--files0-from>=I<\,F\/>
de: B<--files0-from>=I<\,D\/>
es: B<--files0-from>=I<\,ARCHIVO\/>
sr: B<--files0-from>=I<\,Д\/>

source: read input from the files specified by NUL-terminated names in file F; If F is - then read names from standard input
de: Eingabe aus Dateien lesen, deren Namen NULL-terminiert in der Datei D aufgeführt sind; wenn D »-« ist, wird aus der Standardeingabe gelesen
es: toma los datos de los archivos definidos mediante nombres terminados con el NUL en ARCHIVO. Si ARCHIVO es '-', se toman en la entrada estándar.
hu: bemenet olvasása az F fájlban található, NULL végű nevek által megadott fájlokból. Ha az F a -, akkor a szabványos bemenetről olvassa a neveket
sr: чита улаз из датотека наведених називима завршеним на НИШТА у датотеци Д; Ако је Д -, тада чита називе са стандардног улаза
sv: Läs indata från filerna som anges med nollterminerade namn i filen F. Om F är - så läs namn från standard in.

source: B<-k>, B<--key>=I<\,KEYDEF\/>
de: B<-k>, B<--key>=I<\,SCHLÜSSELDEF\/>
hu: B<-k>, B<--key>=I<\,KULCSDEF\/>
sr: B<-k>, B<--key>=I<\,ОДРКЉУЧА\/>
sv: B<-k>, B<--key>=I<\,NYCKELDEF\/>

source: sort via a key; KEYDEF gives location and type
de: Anhand eines Schlüssels sortieren; SCHLÜSSELDEF legt Position und Art fest
es: ordena según una determinada clave; KEYDEF indica el tipo y localización
hu: rendezés kulccsal; a KULCSDEF megadja a helyet és típust
sr: ређа путем кључа; ОДРЕДНИЦАКЉУЧА даје место и врсту
sv: Sortera via en nyckel; NYCKELDEF anger plats och typ.

source: merge already sorted files; do not sort
de: Bereits sortierte Dateien zusammenführen; nicht sortieren
es: fusiona archivos previamente ordenados; no ordena nada
hu: a már rendezett fájlok összefésülése; ne rendezzen
sr: стапа већ поређане датотеке; не ређа
sv: Slå samman redan sorterade filer, sortera inte.

source: B<-o>, B<--output>=I<\,FILE\/>
de: B<-o>, B<--output>=I<\,DATEI\/>
es: B<-o>, B<--output>=I<\,ARCHIVO\/>
hu: B<-o>, B<--output>=I<\,FÁJL\/>
sr: B<-o>, B<--output>=I<\,ДАТОТЕКА\/>
sv: B<-o>, B<--output>=I<\,FIL\/>

source: write result to FILE instead of standard output
de: Ergebnis in DATEI statt in die Standardausgabe schreiben
es: envía el resultado a ARCHIVO en lugar de hacerlo por la salida estándar
hu: az eredmény írása a FÁJLBA a szabványos kimenet helyett
sr: пише резултат у ДАТОТЕКУ уместо на стандардни излаз
sv: Skriv resultatet till FIL i stället för standard ut.

source: stabilize sort by disabling last-resort comparison
de: Sortierung stabilisieren, indem der Rückzugsvergleich deaktiviert wird
es: hace que sort sea más estable eliminando la comparación de último recurso
hu: a rendezés stabilizálása az utolsó újrarendezési összehasonlítás letiltásával
sr: стабилизује ређање искључивањем поређења последњег поновног ређања
sv: Stabilisera sortering genom att stänga av sista-utvägsjämförelse.

source: B<-S>, B<--buffer-size>=I<\,SIZE\/>
de: B<-S>, B<--buffer-size>=I<\,GRÖSSE\/>
es: B<-S>, B<--buffer-size>=I<\,TAMAÑO\/>
hu: B<-S>, B<--buffer-size>=I<\,MÉRET\/>
sr: B<-S>, B<--buffer-size>=I<\,ВЕЛИЧИНА\/>
sv: B<-S>, B<--buffer-size>=I<\,STORLEK\/>

source: use SIZE for main memory buffer
de: GRÖSSE für Hauptspeicherpuffer benutzen
es: utiliza TAMAÑO como buffer principal de memoria
hu: a MÉRET használata a fő memóriapufferhez
sr: користи ВЕЛИЧИНУ за главну међумеморију
sv: Använd STORLEK för huvudminnesbuffert.

source: B<-t>, B<--field-separator>=I<\,SEP\/>
de: B<-t>, B<--field-separator>=I<\,TRENN\/>
hu: B<-t>, B<--field-separator>=I<\,ELV\/>
sr: B<-t>, B<--field-separator>=I<\,РАЗД\/>

source: use SEP instead of non-blank to blank transition
de: TRENN benutzen statt des Übergangs von Nichtleerraum zu Leerraum
es: considera SEP en lugar de espacios en blanco como separador
hu: az ELV használata a nem üresről üresre áttérés helyett
sr: користи РАЗДВОЈНИК уместо не-празних у празне прелазе
sv: Använd SEP istället för övergång från ej blanka till blanka.

source: B<-T>, B<--temporary-directory>=I<\,DIR\/>
de: B<-T>, B<--temporary-directory>=I<\,VERZ\/>
hu: B<-T>, B<--temporary-directory>=I<\,KÖNYVTÁR\/>
sr: B<-T>, B<--temporary-directory>=I<\,ДИРЕКТОРИЈУМ\/>
sv: B<-T>, B<--temporary-directory>=I<\,KAT\/>

source: use DIR for temporaries, not $TMPDIR or I<\,/tmp\/>; multiple options specify multiple directories
de: Für temporäre Dateien wird VERZ statt $TMPDIR oder I<\,/tmp\/> verwendet; mehrfache Optionen geben mehrere Verzeichnisse an
es: utiliza DIR como directorio temporal en lugar de $TMPDIR o I<\,/tmp\/>. Es posible definir varios directorios a empleando múltiples opciones
hu: a KÖNYVTÁR használata az átmeneti fájlokhoz a $TMPDIR vagy a(z) I<\,/tmp\/> helyett; több kapcsolóval több könyvtár adható meg
sr: користи ДИРЕКТОРИЈУМ за привремености, а не „$TMPDIR“ или I<\,/tmp\/>; више опција наводе више директоријума
sv: Använd KAT för tillfälliga filer, ej $TMPDIR eller I<\,/tmp\/>; flera argument anger flera kataloger.

source: change the number of sorts run concurrently to N
de: Ändern der Anzahl der gleichzeitig laufenden Sortierungen auf N
es: define a 'N' la cantidad total de ejecuciones en paralelo de sort
hu: a párhuzamosan futó rendezések számának módosítása N-re
sr: мења број покретања ређања истовремено на N
sv: Ändra antalet samtidiga sorteringskörningar till N.

source: with B<-c>, check for strict ordering; without B<-c>, output only the first of an equal run
de: Mit B<-c> auf strikte Ordnung prüfen; ohne B<-c> nur den Ersten von mehreren Gleichen ausgeben
es: Con la opción B<-c> comprobará si el ordenamiento es estricto. Sin esta opción solo muestra la primera de una serie de duplicados
hu: a B<-c> esetén szigorú rendezés ellenőrzése, a B<-c> nélkül csak az elsőt írja ki egy egyenlő menetből
sr: са B<-c>, проверава за изричитим уређењем; без B<-c>, исписује само прво од истог покретања
sv: Med B<-c>, kontrollera strikt ordningsföljd; utan B<-c>, skriv ut endast den första av flera lika.

source: line delimiter is NUL, not newline
de: Zeilen mit Nullbyte (NUL) trennen, nicht mit Zeilenumbruch
es: las líneas se delimitan con NUL en lugar de nueva línea
hu: a sorok elválasztója NUL, nem új sor
sr: ограничавач реда је НИШТА, не нови ред
sv: Radavgränsare är NOLL, inte nyrad.

source: display this help and exit
de: zeigt Hilfeinformationen an und beendet das Programm.
es: muestra la ayuda y finaliza
hu: ezen súgó megjelenítése és kilépés
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.

source: output version information and exit
de: gibt Versionsinformationen aus und beendet das Programm.
es: muestra la versión del programa y finaliza
hu: verzióinformációk megjelenítése és kilépés
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.

source: KEYDEF is F[.C][OPTS][,F[.C][OPTS]] for start and stop position, where F is a field number and C a character position in the field; both are origin 1, and the stop position defaults to the line's end. If neither B<-t> nor B<-b> is in effect, characters in a field are counted from the beginning of the preceding whitespace. OPTS is one or more single-letter ordering options [bdfgiMhnRrV], which override global ordering options for that key. If no key is given, use the entire line as the key. Use B<--debug> to diagnose incorrect key usage.
de: SCHLÜSSELDEF ist F[.Z][OPTS][,F[.Z][OPTS]] für die Anfangs- und Endposition, wobei F eine Feldnummer und Z eine Zeichenposition im Feld ist; beide starten bei 1 und die Endposition ist in der Voreinstellung das Zeilenende. Wenn weder B<-t> noch B<-b> angegeben sind, werden die Zeichen in einem Feld ausgehend vom Anfang des vorhergehenden Leerraums gezählt. OPTS setzt sich zusammen aus einer oder mehreren Ordnungsoptionen mit einem Buchstaben [bdfgiMhnRrV], die die globalen Ordnungsoptionen für diesen Schlüssel außer Kraft setzen. Wenn kein Schlüssel angegeben wurde, wird die ganze Zeile als Schlüssel benutzt. Mit B<--debug> erhalten Sie Diagnosemeldungen zur inkorrekten Schlüsselverwendung.
es: KEYDEF es F[.C][OPTS][,F[.C][OPTS]] para las posiciones inicial y final, F es un número de campo y C la posición de un caracter en dicho campo. En ambos casos empiezan en 1 y, por defecto, terminan al final de la línea. Si no se indican ni la opción B<-t> ni la B<-b>, se contabilizan los caracteres de un campo desde el inicio del anterior espacio en blanco. OPT consiste en una o más letras que representan las opciones de ordenamiento: [bdfgiMhnRrV]. Éstas anulan las opciones de ordenamiento globales para esta clave. Si no se aporta ninguna clave, se empleará la totalidad de la línea como tal. Use B<--debug> para detectar error con el uso de la clave.
hu: A KULCSDEF M[.K][KAPCS][,M[.K][KAPCS]] alakú a kezdő és befejező pozícióhoz, ahol az M a mező száma és a K a karakterpozíció a mezőben, mindkettő 1-ről indul, és a befejező alapértelmezése a sor vége. Ha sem a B<-t>, sem a B<-b> kapcsoló nincs megadva, akkor a mező karakterei a megelőző üreshely karaktertől lesznek számolva. A KAPCS néhány egybetűs rendezési kapcsoló lehet: [bdfgiMhnRrV], amelyek felülbírálják az adott kulcsra vonatkozó globális rendezési kapcsolókat. Ha nincs kulcs megadva, akkor a teljes sort használja kulcsként. Használja a B<--debug> kapcsolót a helytelen kulcshasználat felismerésére.
sr: ОДРЕДБАКЉУЧА F[.C][ОПЦИЈЕ][,F[.C][ОПЦИЈЕ]] за положај покретања и заустављања, где је F број поља а C положај знака у пољу; оба су порекла 1, а положај заустављања подразумева се на крај реда. Ако ни B<-t> ни B<-b> није удејству, знаци у пољу се броје од почетка претходеће празнине. ОПЦИЈЕ је једна или више једнословних опција сређивања [bdfgiMhnRrV], која превазилази опште опције сређивања за тај кључ. Ако кључ није дат, користи цео ред као кључ. Користите B<--debug> да установите неисправну употребу кључева.
sv: NYCKELDEF är F[.C][FLGR][,F[.C][FLGR]] för start och slutposition, där F är ett fältnummer och C en teckenpositionen inom fältet; båda börjar på 1, och som standard är slutpositionen radens slut. Om vare sig B<-t> eller B<-b> är på räknas tecken i fältet från början av föregående blanktecken. FLGR är en eller flera enbokstavs ordningsflaggor [bdfgiMhnRrV], vilka ersätter globala ordningsflaggor för den nyckeln. Om ingen nyckel är angiven, använd hela raden som nyckel. Använd B<--debug> för att diagnostisera felaktigt användande av nycklar.

source: SIZE may be followed by the following multiplicative suffixes: % 1% of memory, b 1, K 1024 (default), and so on for M, G, T, P, E, Z, Y.
de: GRÖSSE kann von einer der folgenden multiplikativen Endungen gefolgt werden: % 1% des Speichers, b 1, K 1024 (Vorgabe) und so weiter für M, G, T, P, E, Z, Y.
es: TAMAÑO puede ir seguido de los siguientes sufijos mltiplicadores: % 1% de memoria, b 1, K 1024 (por defecto) y así succesivamente con M, G, T, P, E, Z, Y.
hu: A MÉRETET a következő többszöröző utótagok követhetik: % 1% a memóriából, b 1, K 1024 (alapértelmezett), és ugyanígy M, G, T, P, E, Z, Y.
sr: За ВЕЛИЧИНОМ могу да иду пратећи умножавајући суфикси: % 1% меморије, b 1, K 1024 (основно), и тако редом за M, G, T, P, E, Z, Y.
sv: STORLEK kan följas av följande multiplikativa ändelser: % 1% av minne, b 1, K 1024 (standard), och så vidare för M, G, T, P, E, Z, Y.

source: *** WARNING *** The locale specified by the environment affects sort order. Set LC_ALL=C to get the traditional sort order that uses native byte values.
de: *** WARNUNG *** Die in der Umgebung eingestellte Locale beeinflusst die Sortierreihenfolge. Setzen Sie LC_ALL=C, um die traditionelle Sortierreihenfolge zu aktivieren, bei der native Bytewerte verwendet werden.
es: **** IMPORTANTE **** la localización definida en el sistema afecta al resultado de la ordenación. Defina LC_ALL=C para un funcionamiento predeterminado de sort empleando valores de bytes nativos.
hu: *** FIGYELMEZTETÉS *** A környezet által megadott területi beállítások befolyásolják a rendezési sorrendet. Az LC_ALL=C beállításával megkapható a hagyományos rendezési sorrend, amely a natív bájtértékeket használja.
sr: *** УПОЗОРЕЊЕ *** Локалитет наведен окружењем утиче на редослед ређања. Подешава „LC_ALL=C“ да добави традиционални редослед ређања који користи изворне вредности бајта.
sv: *** VARNING *** Lokalen som är angiven i omgivningen påverkar sorteringsordning. Sätt LC_ALL=C för att få traditionell sorteringsordning som använder de underliggande bytevärdena.

source: AUTHOR
de: AUTOR
es: AUTOR
hu: SZERZŐ
sr: АУТОР
sv: UPPHOVSMAN

source: Written by Mike Haertel and Paul Eggert.
de: Geschrieben von Mike Haertel und Paul Eggert.
es: Escrito por Mike Haertel y Paul Eggert.
hu: Írta Mike Haertel és Paul Eggert.
sr: Написали су Мајк Хартел и Пол Егерт.
sv: Skrivet av Mike Haertel och Paul Eggert.

source: REPORTING BUGS
de: FEHLER MELDEN
es: INFORMAR DE ERRORES
hu: HIBÁK JELENTÉSE
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
de: Onlinehilfe für GNU coreutils: E<.UR https://www.gnu.org/software/coreutils/>E<.UE>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
de: Melden Sie Fehler in der Übersetzung an E<.UR https://translationproject.org/team/de.html> das deutschsprachige Team beim GNU Translation ProjectE<.UE .>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: COPYRIGHT
hu: SZERZŐI JOG
sr: АУТОРСКА ПРАВА
