Repository: sebras/manpages-l10n
Catalog: po/*/man1/sort.1.po
Languages: de, es, hu, sr, sv

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2022 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2022 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN
hu: LÁSD MÉG
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/sortE<gt>
de: Vollständige Dokumentation unter: E<lt>https://www.gnu.org/software/coreutils/sortE<gt>
es: Documentación completa E<lt>https://www.gnu.org/software/coreutils/sortE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/sortE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/sortE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/sortE<gt>

source: or available locally via: info \(aq(coreutils) sort invocation\(aq
de: oder lokal verfügbar mit: info \(aq(coreutils) sort invocation\(aq
es: también disponible localmente ejecutando: info \(aq(coreutils) sort invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) sort invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) sort invocation\(aq“
sv: eller tillgängligt lokalt via: info \(aq(coreutils) sort invocation\(aq

source: September 2020
es: Septiembre de 2020
hu: 2020 szeptember
sr: Септембра 2020

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: shuffle, but group identical keys. See shuf(1)
de: zufällige Anordnung, aber identische Schlüssel werden gruppiert. Siehe B<shuf>(1)
es: mezcla las líneas, pero agrupará aquellas con un mismo patrón. Consulte shuf(1)
hu: keverés az azonos kulcsok csoportosításával. Lásd még: shuf(1)
sr: меша, али групише истоветне кључеве. Видите B<shuf>(1)
sv: Blanda, men gruppera identiska nycklar. Se B<shuf>(1).

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2020 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: shuf(1), uniq(1)
de: B<shuf>(1), B<uniq>(1)
sr: B<shuf>(1), B<uniq>(1)
sv: B<shuf>(1), B<uniq>(1)

source: October 2021
de: Oktober 2021
es: Octubre de 2021
hu: 2021 október
sr: Октобра 2021
sv: oktober 2021

source: March 2022
de: März 2022
sr: Марта 2022
sv: mars 2022

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2021 Free Software Foundation, Inc. Lizenz GPLv3+: E<.UR https://gnu.org/licenses/gpl.html> GNU GPL Version 3 E<.UE> oder neuer.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
es: Agosto de 2022
hu: 2022. augusztus
sr: Августа 2022
sv: augusti 2022

source: September 2021
sr: Септембра 2021

source: sort - sort lines of text files
de: sort - Zeilen von Textdateien sortieren
es: sort - ordena las líneas de un archivo de texto
hu: sort - szövegfile sorainak rendezése

source: shuffle, but group identical keys. See B<shuf>(1)
de: zufällige Anordnung, aber identische Schlüssel werden gruppiert. Siehe B<shuf>(1)
es: mezcla las líneas, pero agrupará aquellas con un mismo patrón. Consulte B<shuf>(1)

source: November 2022
es: Noviembre de 2022

source: September 2022
es: Septiembre de 2022
hu: 2022 szeptember
