Repository: sebras/manpages-l10n
Catalog: po/*/man1/split.1.po
Languages: es, hu, pl, sr, sv

source: March 2020
es: Marzo 2020
pl: marzec 2020

source: User Commands
es: Órdenes de usuario
hu: Felhasználói parancsok
pl: Polecenia użytkownika
sr: Корисничке наредбе
sv: Användarkommandon

source: NAME
es: NOMBRE
hu: NÉV
pl: NAZWA
sr: НАЗИВ
sv: NAMN

source: split - split a file into pieces
es: split - divide un archivo en varios fragmentos
hu: split - darabokra hasítja a fájlokat
pl: split - dzieli pliki na części

source: SYNOPSIS
es: SINOPSIS
hu: ÖSSZEGZÉS
pl: SKŁADNIA
sr: УВОД

source: B<split> [I<\,OPTION\/>]... [I<\,FILE \/>[I<\,PREFIX\/>]]
es: B<split> [I<\,OPCIÓN\/>]... [I<\,ARCHIVO \/>[I<\,PREFIJO\/>]]
hu: B<split> [I<\,KAPCSOLÓ\/>]… [I<\,FÁJL \/>[I<\,ELŐTAG\/>]]
pl: B<split> [I<OPCJA>]... [I<PLIK >[I<PRZEDROSTEK>]]
sr: B<split> [I<\,ОПЦИЈА\/>]... [I<\,ДАТОТЕКА \/>[I<\,ПРЕФИКС\/>]]
sv: B<split> [I<\,FLAGGA\/>]... [I<\,FIL \/>[I<\,PREFIX\/>]]

source: DESCRIPTION
es: DESCRIPCIÓN
hu: LEÍRÁS
pl: OPIS
sr: ОПИС
sv: BESKRIVNING

source: Output pieces of FILE to PREFIXaa, PREFIXab, ...; default size is 1000 lines, and default PREFIX is 'x'.
es: Crea fragmentos de ARCHIVO con los nombres PREFIJOaa, PREFIJOab...por defecto serán de 1000 líneas y con una 'x' como prefijo.
hu: A FÁJL darabjainak kiírása az ELŐTAGaa, ELŐTAGab, …; fájlokba, az alapértelmezett méret 1000 sor, és az alapértelmezett ELŐTAG az „x”.
pl: Wypisuje równe części I<PLIKU> do plików I<PRZEDROSTEK>B<aa> I<PRZEDROSTEK>B<ab>, ...; domyślnym rozmiarem jest 1000 wierszy, a domyślnym I<PRZEDROSTKIEM> jest B<x>.
sr: Исписује комаде сталне величине ДАТОТЕКЕ на ПРЕФИКСaa, ПРЕФИКСab, ...; основна величина је 1000 редова, а основни ПРЕФИКС је „x“.
sv: Skriv ut delar av FIL till PREFIXaa, PREFIXab, …;standardstorlek är 1000 rader, och standardPREFIX är ”x”.

source: With no FILE, or when FILE is -, read standard input.
es: Si no se define ningún ARCHIVO o bien se indica '-', se lee la entrada estándar.
hu: Ha a FÁJL nincs megadva, vagy -, akkor a szabványos bemenetet olvassa.
pl: Jeśli nie podano I<PLIKU> lub jako I<PLIK> podano B<->, czyta standardowe wejście.
sr: Без ДАТОТЕКЕ, или када је ДАТОТЕКА -, чита стандардни улаз.
sv: Utan FIL, eller när FIL är -, läs standard in.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
hu: A hosszú kapcsolók kötelező argumentumai a rövid kapcsolókhoz is kötelezők.
pl: Argumenty, które są obowiązkowe dla długich opcji, są również obowiązkowe dla krótkich.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.

source: generate suffixes of length N (default 2)
es: crea sufijos de longitud N (por defecto: N=2)
hu: N hosszúságú utótagok használata (alapértelmezett: 2)
pl: używa przyrostków długości I<N> (domyślnie 2)
sr: ствара суфиксе дужине N (основно је 2)
sv: Använd ändelser av längd N (standard 2).

source: B<--additional-suffix>=I<\,SUFFIX\/>
es: B<--additional-suffix>=I<\,SUFIJO\/>
hu: B<--additional-suffix>=I<\,UTÓTAG\/>
pl: B<--additional-suffix>=I<PRZYROSTEK>
sr: B<--additional-suffix>=I<\,СУФИКС\/>
sv: B<--additional-suffix>=I<\,ÄNDELSE\/>

source: append an additional SUFFIX to file names
es: añade un sufijo adicional a los nombres de fragmento
hu: az UTÓTAG hozzáfűzése a fájlnevekhez
pl: dodaje dodatkowy I<PRZYROSTEK> do nazw plików
sr: придодаје додатни СУФИКС на називе датотека
sv: Lägg till en extra ÄNDELSE på filnamn.

source: B<-b>, B<--bytes>=I<\,SIZE\/>
es: B<-b>, B<--bytes>=I<\,TAMAÑO\/>
hu: B<-b>, B<--bytes>=I<\,MÉRET\/>
pl: B<-b>, B<--bytes>=I<ROZMIAR>
sr: B<-b>, B<--bytes>=I<\,ВЕЛИЧИНА\/>
sv: B<-b>, B<--bytes>=I<\,STORLEK\/>

source: put SIZE bytes per output file
es: crea fragmentos con TAMAÑO bytes
hu: MÉRET darab bájt kimeneti fájlonként
pl: określa rozmiar każdego z plików wyjściowych na I<ROZMIAR>
sr: ставља ВЕЛИЧИНА бајтова по излазној датотеци
sv: Placera STORLEK byte i varje utfil.

source: B<-C>, B<--line-bytes>=I<\,SIZE\/>
es: B<-C>, B<--line-bytes>=I<\,TAMAÑO\/>
hu: B<-C>, B<--line-bytes>=I<\,MÉRET\/>
pl: B<-C>, B<--line-bytes>=I<ROZMIAR>
sr: B<-C>, B<--line-bytes>=I<\,ВЕЛИЧИНА\/>
sv: B<-C>, B<--line-bytes>=I<\,STORLEK\/>

source: put at most SIZE bytes of records per output file
es: pone un máximo de TAMAÑO bytes por cada fragmento
hu: legfeljebb MÉRET darab bájt hosszú sorok kimeneti fájlonként
pl: używa najwyżej I<ROZMIARU> bajtów na rekord w każdym pliku wyjściowym
sr: ставља највише ВЕЛИЧИНА бајтова записа по излазној датотеци
sv: Placera max STORLEK byte med poster per utfil.

source: use numeric suffixes starting at 0, not alphabetic
es: emplea sufijos numéricos en lugar de alfabéticos partiendo de 0.
hu: numerikus utótagok használata alfabetikusok helyett 0-tól kezdve
pl: używa przyrostków liczbowych poczynając od 0, nie alfabetycznych
sr: користи бројчане суфиксе почевши од 0, не азбучне
sv: Använd numeriska suffix från 0, inte alfabetiska.

source: B<--numeric-suffixes>[=I<\,FROM\/>]
es: B<--numeric-suffixes>[=I<\,DESDE\/>]
hu: B<--numeric-suffixes>[=I<\,INNEN\/>]
pl: B<--numeric-suffixes>[=I<OD>]
sr: B<--numeric-suffixes>[=I<\,ОД\/>]
sv: B<--numeric-suffixes>[=I<\,FRÅN\/>]

source: same as B<-d>, but allow setting the start value
es: igual que B<-d> pero permite definir el valor inicial
hu: mint a B<-d>, de beállítható a kezdőérték
pl: jak B<-d>, ale pozwala wybrać wartość początkową
sr: исто као B<-d>, али допушта подешавање почетне вредности
sv: Samma som B<-d>, men tillåt att startvärdet sätts.

source: B<--hex-suffixes>[=I<\,FROM\/>]
es: B<--hex-suffixes>[=I<\,DESDE\/>]
hu: B<--hex-suffixes>[=I<\,INNEN\/>]
pl: B<--hex-suffixes>[=I<\,OD\/>]
sr: B<--hex-suffixes>[=I<\,ОД\/>]
sv: B<--hex-suffixes>[=I<\,FRÅN\/>]

source: same as B<-x>, but allow setting the start value
es: igual que B<-x> pero permite definir el valor inicial
hu: mint a B<-x>, de beállítható a kezdőérték
pl: jak B<-x>, ale pozwala wybrać wartość początkową
sr: исто као B<-x>, али омогућава подешавање почетне вредности
sv: Samma som B<-x>, men tillåt att startvärdet sätts.

source: do not generate empty output files with '-n'
es: no crea archivo vacío con '-n'
hu: ne generáljon üres kimeneti fájlokat a „-n”-nel
pl: nie wypisuje pustych wierszy dla opcji B<-n>
sr: не ствара празне излазне датотеке са B<-n>
sv: Generera inte tomma utfiler med B<-n>.

source: B<--filter>=I<\,COMMAND\/>
es: B<--filter>=I<\,ORDEN\/>
hu: B<--filter>=I<\,PARANCS\/>
pl: B<--filter>=I<POLECENIE>
sr: B<--filter>=I<\,НАРЕДБА\/>
sv: B<--filter>=I<\,KOMMANDO\/>

source: write to shell COMMAND; file name is $FILE
es: envía el contenido a ORDEN, el nombre del archivo es $FILE
hu: írás a shell PARANCSBA, a fájlnév a $FÁJL
pl: pisze do I<POLECENIA> powłoki, nazwą pliku jest B<$FILE>
sr: пише НАРЕДБУ на шкољку; назив датотеке је „$ДАТОТЕКА“
sv: Skriv till skalKOMMANDO; filnamnet är $FILE.

source: B<-l>, B<--lines>=I<\,NUMBER\/>
es: B<-l>, B<--lines>=I<\,NÚMERO\/>
hu: B<-l>, B<--lines>=I<\,SZÁM\/>
pl: B<-l>, B<--lines>=I<LICZBA>
sr: B<-l>, B<--lines>=I<\,БРОЈ\/>
sv: B<-l>, B<--lines>=I<\,ANTAL\/>

source: put NUMBER lines/records per output file
es: inserta NÚMERO de líneas/registros en cada fragmento
hu: SZÁM darab sor kimeneti fájlonként
pl: używa I<LICZBY> wierszy/rekordów na każdy plik wyjściowy
sr: ставља БРОЈ редова по излазној датотеци
sv: Placera ANTAL rader/poster i varje utfil.

source: B<-n>, B<--number>=I<\,CHUNKS\/>
es: B<-n>, B<--number>=I<\,PEDAZOS\/>
hu: bB<-n>, B<--number>=I<\,DARABOK\/>
pl: B<-n>, B<--number>=I<CZĘŚCI>
sr: B<-n>, B<--number>=I<\,ДЕЛИЋИ\/>
sv: B<-n>, B<--number>=I<\,BITAR\/>

source: generate CHUNKS output files; see explanation below
es: crea PEDAZOS archivos, vea la explicación más adelante
hu: DARABOK számú kimeneti fájl generálása, lásd alább
pl: dzieli plik na podaną liczbę I<CZĘŚCI>, patrz niżej
sr: ствара ДЕЛИЋА излазне датотеке; видите објашњење испод
sv: Generera BITAR utfiler; se förklaring nedan.

source: B<-t>, B<--separator>=I<\,SEP\/>
hu: B<-t>, B<--separator>=I<\,ELV\/>
pl: B<-s>, B<--separator>=I<SEPARATOR>
sr: B<-t>, B<--separator>=I<\,РАЗДВ\/>

source: use SEP instead of newline as the record separator; \&'\e0' (zero) specifies the NUL character
es: usa SEP en lugar de nueva línea com separación entre registros. \&'\e0' (cero) denota el carácter NUL
hu: az ELV használata új sor helyett rekordelválasztóként; a \&„\e0” (nulla) a NULL karaktert jelenti
pl: używa I<SEPARATORA> zamiast nowego wiersza jak separatora rekordów; "\e0" (zero) wybiera znak NUL
sr: користи РАЗДВОЈНИК уместо новог реда као раздвојник записа; \&'\e0' (нула) наводи знак НИШТИЦЕ
sv: Använd SEP istället för nyrader som postseparator; \&'\e0' (noll) anger NOLL-tecknet.

source: immediately copy input to output with '-n r/...'
es: envía directamente la entrada a la salida con '-n r/...'
hu: bemenet azonnali kimenetre másolása a „-n r/...” használatával
pl: natychmiast kopiuje wejście na wyjście z opcją B<-n r/>I<...>
sr: одмах умножава улаз на излаз са „-n r/...“
sv: Kopiera omedelbart indata till utdata med ”-n r/…”.

source: print a diagnostic just before each output file is opened
es: muestra el estado justo antes de abrir cada fragmento
hu: diagnosztikai üzenet kiírása minden egyes kimeneti fájl megnyitása előtt
pl: wyświetla informacje diagnostyczne zaraz przed otwarciem każdego pliku wynikowego
sr: исписује дијагнозу одмах пре отварања сваке излазне датотеке
sv: Skriv ett meddelande strax före varje utfil öppnas.

source: display this help and exit
es: muestra la ayuda y finaliza
hu: ezen súgó megjelenítése és kilépés
pl: wyświetla ten tekst i kończy pracę
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.

source: output version information and exit
es: muestra la versión del programa y termina
hu: verzióinformációk megjelenítése és kilépés
pl: wyświetla informacje o wersji i kończy działanie
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.

source: The SIZE argument is an integer and optional unit (example: 10K is 10*1024). Units are K,M,G,T,P,E,Z,Y (powers of 1024) or KB,MB,... (powers of 1000). Binary prefixes can be used, too: KiB=K, MiB=M, and so on.
es: El argumento TAMAÑO es un entero y una unidad opcional (ejemplo: 10K es 10 * 1024). Las unidades son K, M, G, T, P, E, Z, Y (potencias de 1024) o KB, MB, ... (potencias de 1000). También se pueden usar prefijos binarios: KiB = K, MiB = M, etc.
pl: I<ROZMIAR> jest liczbą całkowitą wraz z opcjonalną jednostką (np. 10K to 10*1024). Jednostki to: B<K>, B<M>, B<G>, B<T>, B<P>, B<E>, B<Z>, B<Y> (potęgi 1024) lub B<KB>, B<MB> itd. (potęgi 1000). Można używać również przyrostków binarnych, np. B<KiB>=K, B<MiB>=M itd.
sr: Аргумент ВЕЛИЧИНА је цео број и изборна јединица (пример: 10K је 10*1024). Јединице су K,M,G,T,P,E,Z,Y (степени од 1024) или KB,MB,... (степени од 1000). Бинарни префикси се могу користити, такође: KiB=K, MiB=M, и тако редом.
sv: Argumentet STORLEK är ett heltal och eventuell enhet (exempel: 10K är 10·1024). Enheter är K, M, G, T, P, E, Z, Y (potenser av 1024) eller KB, MB, … (potenser av 1000). Binära prefix kan också användas: KiB=K, MiB=M, och så vidare.

source: CHUNKS may be:
es: PEDAZOS puede ser:
hu: A DARABOK lehet:
pl: I<CZĘŚCIĄ> może być:
sr: ДЕЛИЋИ могу бити:
sv: BITAR kan vara:

source: split into N files based on size of input
es: divide en N fragmentos en base al tamaño de entrada
hu: N fájlra osztás a bemenet mérete alapján
pl: dzieli na I<N> części w oparciu o wielkość wejścia
sr: дели на N датотека на основу величине улаза
sv: dela i N filer baserat på storleken på indata

source: K/N
pl: I<K>B</>I<N>

source: output Kth of N to stdout
es: muestra el fragmento K de N
hu: az N K. részének szabványos kimenetre írása
pl: wypisuje I<K>-tą część z I<N> na standardowe wyjście
sr: даје K-ти од N на стандардни излаз
sv: mata ut K:e av N till standard ut

source: l/N
pl: B<1/>I<N>

source: split into N files without splitting lines/records
es: divide en N fragmentos sin dividir líneas/registros
hu: N fájlra osztás a sorok/rekordok megosztása nélkül
pl: dzieli na I<N> plików, bez rozdzielania wierszy/rekordów
sr: дели на N датотека без дељења редова/записа
sv: dela i N filer utan att dela rader/poster

source: l/K/N
pl: B<l/>I<K>B</>I<N>

source: output Kth of N to stdout without splitting lines/records
es: muestra el fragmento K de N sin dividir líneas/regsitros
hu: az N K. részének szabványos kimenetre írása, sorok/rekordok megosztása nélkül
pl: wypisuje I<K>-tą część z I<N> na standardowe wyjście, bez rozdzielania wierszy/rekordów
sr: даје K-ти од N на стандардни излаз без дељења редова/записа
sv: mata ut K:e av N till standard ut utan att dela rader/poster

source: r/N
pl: B<r/>I<N>

source: like 'l' but use round robin distribution
es: igual que 'l' per con una distribución rotatoria
hu: mint az „l”, de körbeforgó elosztás használatával
pl: jak B<l>, lecz używa algorytmu karuzelowego (ang. round robin)
sr: као „l“ али користи расподелу кружног додељивања
sv: som ”l” men använd turordningsdistribution

source: r/K/N
pl: B<r/>I<K>B</>I<N>

source: likewise but only output Kth of N to stdout
es: de igual modo pero sólo muestra el fragmento K de N
hu: hasonló, de csak az N K. részének szabványos kimenetre írása
pl: podobnie, lecz wypisuje tylko I<K>-tą część z I<N> na standardowe wyjście
sr: слично али даје само K-ти од N на стандардни излаз
sv: likadant men mata bara ut K:e av N till standard ut

source: AUTHOR
es: AUTOR
hu: SZERZŐ
pl: AUTOR
sr: АУТОР
sv: UPPHOVSMAN

source: Written by Torbjorn Granlund and Richard M. Stallman.
es: Escrito por Torbjorn Granlund y Richard M. Stallman.
hu: Írta Torbjorn Granlund és Richard M. Stallman.
pl: Napisane przez Torbjorna Granlunda i Richarda M. Stallmana.
sr: Написали су Торбјорн Гранлунд и Ричард М. Столман.
sv: Skrivet av Torbjorn Granlund och Richard M. Stallman.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
hu: HIBÁK JELENTÉSE
pl: ZGŁASZANIE BŁĘDÓW
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
hu: A(z) GNU coreutils online súgója: E<lt>https://www.gnu.org/software/coreutils/E<gt>
pl: Strona internetowa z pomocą GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
pl: O błędach tłumaczenia poinformuj przez E<lt>https://translationproject.org/team/pl.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: COPYRIGHT
hu: SZERZŐI JOG
pl: PRAWA AUTORSKIE
sr: АУТОРСКА ПРАВА

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2020 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pl: Copyright \(co 2020 Free Software Foundation, Inc. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
hu: Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
pl: Jest to wolne oprogramowanie: można je zmieniać i rozpowszechniać. Nie ma ŻADNEJ GWARANCJI, w granicach określonych przez prawo.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
es: VÉASE TAMBIÉN
hu: LÁSD MÉG
pl: ZOBACZ TAKŻE
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
es: Documentación completa E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
hu: Teljes dokumentáció E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
pl: Pełna dokumentacja: E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/splitE<gt>

source: or available locally via: info \(aq(coreutils) split invocation\(aq
es: también disponibles localmente ejecutandoinfo \(aq(coreutils) split invocation\(aq
hu: vagy helyileg elérhető: info \(aq(coreutils) split invocation\(aq
pl: lub lokalnie, za pomocą B<info \(aqcoreutils) split invocation\(aq>
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) split invocation\(aq“
sv: eller tillgängligt lokalt via: info \(aq(coreutils) split invocation\(aq

source: February 2019
es: Febrero 2019
pl: luty 2019

source: The SIZE argument is an integer and optional unit (example: 10K is 10*1024). Units are K,M,G,T,P,E,Z,Y (powers of 1024) or KB,MB,... (powers of 1000).
es: El argumento TAM es un entero y una unidad opcional (ejemplo: 10M es 10*1024*1024). Las unidades son K,M,G,T,P,E,Z,Y (potencias de 1024) o KB,MB, ... (potencias de 1000).
pl: I<ROZMIAR> jest liczbą całkowitą wraz z opcjonalną jednostką (np. 10K to 10*1024). Jednostki to: B<K>, B<M>, B<G>, B<T>, B<P>, B<E>, B<Z>, B<Y> (potęgi 1024) lub B<KB>, B<MB> itd. (potęgi 1000).

source: Report split translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Inform de cualquier error en la traducción de split en: E<lt>https://translationproject.org/team/es.htmlE<gt>
pl: Zgłoszenia błędów w tłumaczeniu split proszę wysyłać na adres E<lt>https://translationproject.org/team/pl.htmlE<gt>

source: Copyright \(co 2018 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2018 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
pl: Copyright \(co 2018 Free Software Foundation, Inc. Licencja GPLv3+: GNU GPL w wersji 3 lub późniejszej E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: Full documentation at: E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
es: Documentación completa en: E<lt>https://www.gnu.org/software/coreutils/splitE<gt>
pl: Pełna dokumentacja na stronie: E<lt>https://www.gnu.org/software/coreutils/splitE<gt>

source: September 2020
es: Septiembre de 2020
hu: 2020 szeptember
pl: wrzesień 2020
sr: Септембра 2020

source: July 2021
pl: lipiec 2021

source: October 2020
es: Octubre de 2020
pl: październik 2020

source: April 2021
es: Abril de 2021
pl: kwiecień 2021

source: use hex suffixes starting at 0, not alphabetic
es: emple sufijos hexadecimales en lugar de alfabéticos siendo el 0 el primero.
hu: hexa utótagok használata 0-tól, alfabetikusok helyett
sr: користи хексадецимални суфикс са почетком на 0, не азбучни
sv: Använd hex-suffix från 0, inte alfabetiska.

source: May 2021
es: Mayo de 2021

source: April 2022
hu: 2022 április
sr: Априла 2022

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2022 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: August 2022
sr: Августа 2022
sv: augusti 2022

source: October 2021
hu: 2021 október
sr: Октобра 2021
sv: oktober 2021

source: March 2022
hu: 2022 március
sv: mars 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
hu: Copyright \(co 2021 Free Software Foundation, Inc. A licenc GPLv3+: a GNU GPL 3. vagy újabb változata: E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: September 2021
hu: 2021 szeptember
