Repository: sebras/manpages-l10n
Catalog: po/*/man1/ssh-copy-*.1.po
Languages: de, uk

source: $Mdocdate: June 17 2010 $
de: $Mdocdate: 17. Juni 2010 $
uk: $Mdocdate: 17 червня 2010 року $

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: use locally available keys to authorise logins on a remote machine
de: lokal verfügbare Schlüssel zur Autorisierung von Anmeldungen an fernen Maschinen verwenden
uk: використання доступних локально ключів для уповноважених входів до віддаленої системи

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl s> E<.Op Fl i Op Ar identity_file> E<.Op Fl p Ar port> E<.Op Fl o Ar ssh_option> E<.Op Ar user Ns @ Ns> E<.Ar hostname> E<.Nm> E<.Fl h | Fl ?>
de: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl s> E<.Op Fl i Op Ar Identitätsdatei> E<.Op Fl p Ar Port> E<.Op Fl o Ar SSH-Option> E<.Op Ar Benutzer Ns @ Ns> E<.Ar Rechnername> E<.Nm> E<.Fl h | Fl ?>
uk: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl s> E<.Op Fl i Op Ar файл_профілю> E<.Op Fl p Ar порт> E<.Op Fl o Ar параметр_ssh> E<.Op Ar користувач Ns @ Ns> E<.Ar назва_вузла> E<.Nm> E<.Fl h | Fl ?>

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: E<.Nm> is a script that uses E<.Xr ssh 1> to log into a remote machine (presumably using a login password, so password authentication should be enabled, unless you've done some clever use of multiple identities). It assembles a list of one or more fingerprints (as described below) and tries to log in with each key, to see if any of them are already installed (of course, if you are not using E<.Xr ssh-agent 1> this may result in you being repeatedly prompted for pass-phrases). It then assembles a list of those that failed to log in, and using ssh, enables logins with those keys on the remote server. By default it adds the keys by appending them to the remote user's E<.Pa ~/.ssh/authorized_keys> (creating the file, and directory, if necessary). It is also capable of detecting if the remote system is a NetScreen, and using its E<.Ql set ssh pka-dsa key ...> command instead.
de: E<.Nm> ist ein Skript, das E<.Xr ssh 1> zur Anmeldung an fernen Maschinen verwendet (vermutlich mittels eines Anmeldepasswortes, daher sollte Passwort-Authentifizierung aktiviert sein, außer Sie haben mehrere Identitäten geschickt eingesetzt). Es stellt eine Liste von einem oder mehreren Fingerabdrücken zusammen (wie nachfolgend beschrieben) und versucht, sich mit jedem Schlüssel anzumelden, um zu prüfen, ob einer von ihnen bereits installiert wurde (wenn sie natürlich E<.Xr ssh-agent 1> nicht verwenden, kann dies dazu führen, dass sie wiederholt nach einer Passphrase gefragt werden). Es stellt dann eine Liste derer zusammen, bei denen keine Anmeldung gelang und ermöglicht dann mit Ssh Anmeldungen mit diesen Schlüsseln auf den fernen Servern. Standardmäßig fügt es die Schlüssel hinzu, indem es sie an die Datei E<.Pa ~/.ssh/authorized_keys> des Benutzers auf dem fernen Rechner anhängt (und dabei, falls notwendig, die Datei und das Verzeichnis erstellt). Es ist auch in der Lage zu erkennen, ob das ferne System ein NetScreen ist, um dann stattdessen seinen Befehl E<.Ql set ssh pka-dsa key …> zu verwenden.
uk: E<.Nm> є скриптом, який використовує E<.Xr ssh 1> для входу до віддалених машин (ймовірно, якщо не налаштовано якогось вигадливого використання декількох профілів, за допомогою пароля до облікового запису, тому має бути увімкнено розпізнавання за паролем). Скрипт збирає список з одного або декількох відбитків (як це описано нижче) і намагається здійснити вхід за допомогою кожного з ключів, щоб перевірити, чи якийсь з них вже встановлено (Звичайною, якщо ви не користуєтеся E<.Xr ssh-agent 1>, це може призвести до потреби у повторному введенні пароля). Потім скрипт збирає список тих відбитків, за якими увійти не вдалося, і, використовуючи ssh, вмикає вхід за ключами на віддаленому сервері. Типово, скрипт додає ключі, дописуючи їх до файла E<.Pa ~/.ssh/authorized_keys> віддаленого користувача (створюючи файл, і каталог, якщо це потрібно). Скрипт також може виявляти, чи є віддалена система системою NetScreen, і користуватися її командою E<.Ql set ssh pka-dsa key ...>.

source: The options are as follows:
de: Folgende Optionen stehen zur Verfügung:
uk: Параметри є такими:

source: Fl i Ar identity_file
de: Fl i Ar Identitätsdatei
uk: Fl i Ar файл_профілю

source: Use only the key(s) contained in E<.Ar identity_file> (rather than looking for identities via E<.Xr ssh-add 1> or in the E<.Ic default_ID_file>). If the filename does not end in E<.Pa .pub> this is added. If the filename is omitted, the E<.Ic default_ID_file> is used.
de: Verwendet nur Schlüssel, die in der E<.Ar Identitätsdatei> enthalten sind (statt mittels E<.Xr ssh-add 1> oder in der E<.Ic Vorgabekennungsdatei> nach Identitäten zu schauen). Falls der Dateiname nicht auf E<.Pa .pub> endete, wird diese Endung hinzugefügt. Falls der Dateiname nicht angegeben wird, wird E<.Ic Vorgabekennungsdatei> verwandt.
uk: Використовувати лише ключі, які містяться у E<.Ar файлі_профілю> (а не шукати профілі за допомогою E<.Xr ssh-add 1> або E<.Ic default_ID_file>). Якщо назва файла не завершується на E<.Pa .pub>, цей суфікс буде додано. Якщо назви файла не вказано, буде використано назву E<.Ic default_ID_file>.

source: Note that this can be used to ensure that the keys copied have the comment one prefers and/or extra options applied, by ensuring that the key file has these set as preferred before the copy is attempted.
de: Beachten Sie, dass dies dazu verwandt werden kann, sicherzustellen, dass die kopierten Schlüssel die bevorzugten Kommentare und/oder zusätzlichen Optionen gesetzt haben, indem sichergestellt wird, dass die Schlüsseldatei diese wie gewünscht gesetzt hat, bevor das Kopieren versucht wird.
uk: Зауважте, що цим можна скористатися для забезпечення того, щоб до скопійованих ключів було застосовано бажаний коментар і/або додаткові параметри, шляхом забезпечення цього набору параметрів до спроби копіювання ключа.

source: Forced mode: doesn't check if the keys are present on the remote server. This means that it does not need the private key. Of course, this can result in more than one copy of the key being installed on the remote system.
de: Zwangsmodus: Überprüft nicht, ob die Schlüssel auf dem fernen Server vorhanden sind. Dies bedeutet, dass es nicht den privaten Schlüssel benötigt. Natürlich kann dies dazu führen, dass auf dem fernen System mehr als eine Kopie des Schlüssels installiert wird.
uk: Примусовий режим: не перевіряти, якщо ключі є на віддаленому сервері. Це означає, що закритий ключ не потрібен. Звичайно ж, це може призвести до встановлення у віддаленій системі декількох копій ключа.

source: do a dry-run. Instead of installing keys on the remote system simply prints the key(s) that would have been installed.
de: Führt einen Probleauf aus. Statt Schlüssel auf dem fernen System zu installieren, werden lediglich der oder die Schlüssel ausgegeben, die installiert würden.
uk: Виконати тестовий пуск. Замість встановлення ключів до віддаленої системи, просто вивести список ключів, які було б встановлено.

source: SFTP mode: usually the public keys are installed by executing commands on the remote side. With this option the user's E<.Pa ~/.ssh/authorized_keys> file will be downloaded, modified locally and uploaded with sftp. This option is useful if the server has restrictions on commands which can be used on the remote side.
de: SFTP-Modus: normalerweise werden die öffentlichen Schlüssel installiert, indem auf der fernen Seite Befehle ausgeführt werden. Mit dieser Option wird die Datei E<.Pa ~/.ssh/authorized_keys> des Benutzers heruntergeladen, lokal verändert, und mit Sftp hochgeladen. Diese Option ist nützlich, falls auf dem fernen Server die ausführbaren Befehle eingeschränkt sind\&.
uk: Режим SFTP: зазвичай, відкриті ключі встановлюють виконанням команд на боці віддаленої системи. Якщо вказано цей параметр, буде отримано файл E<.Pa ~/.ssh/authorized_keys> користувача, до файла буде внесено зміни у локальній системі, а результати буде вивантажено за допомогою sftp на віддалену систему. Цей параметр корисний, якщо на сервері є обмеження щодо команд, якими можна скористатися на віддаленому боці.

source: Print Usage summary
de: Gibt eine Benutzungszusammenfassung aus.
uk: Вивести дані щодо користування

source: These two options are simply passed through untouched, along with their argument, to allow one to set the port or other E<.Xr ssh 1> options, respectively.
de: Diese zwei Optionen werden einfach unverändert zusammen mit ihren Argumenten durchgereicht. Sie erlauben das Setzen des Ports bzw. anderer Optionen von E<.Xr ssh 1>.
uk: Ці два параметри буде просто передано незмінними, разом із їхніми аргументами, щоб уможливити встановлення порту або інших параметрів E<.Xr ssh 1>, відповідно.

source: Rather than specifying these as command line options, it is often better to use (per-host) settings in E<.Xr ssh 1 Ns 's> configuration file: E<.Xr ssh_config 5>.
de: Statt diese als Befehlszeilenoptionen anzugeben, ist es oft besser, (rechnerbezogene) Einstellungen in der Konfigurationsdatei von E<.Xr ssh 1> zu verwenden: E<.Xr ssh_config 5>.
uk: Замість встановлення цих параметрів у рядку команди, часто краще скористатися (окремими для вузла) параметрами у файлі налаштувань E<.Xr ssh 1>: E<.Xr ssh_config 5>.

source: Default behaviour without E<.Fl i>, is to check if E<.Ql ssh-add -L> provides any output, and if so those keys are used. Note that this results in the comment on the key being the filename that was given to E<.Xr ssh-add 1> when the key was loaded into your E<.Xr ssh-agent 1> rather than the comment contained in that file, which is a bit of a shame. Otherwise, if E<.Xr ssh-add 1> provides no keys contents of the E<.Ic default_ID_file> will be used.
de: Ohne E<.Fl i> wird standardmäßig geprüft, ob E<.Ql ssh-add -L> eine Ausgabe erzeugt. Ist dies der Fall, dann werden diese Schlüssel verwandt. Beachten Sie, dass dieses dazu führt, dass der Kommentar des Schlüssel der Dateiname ist, der an E<.Xr ssh-add 1> übergeben wurde, als der Schlüssel in Ihren E<.Xr ssh-agent 1> geladen wurde, statt der Kommentar, der in dieser Datei enthalten ist, was sehr unschön ist. Andernfalls werden die Inhalte in E<.Ic Vorgabekennungsdatei> verwandt, falls E<.Xr ssh-add 1> keine Schlüssel bereitstellt.
uk: Типовою поведінкою без зазначення E<.Fl i>, буде перевірка того, чи виводить щось E<.Ql ssh-add -L>, і якщо щось буде виведено, використати виведені ключі. Зауважте, що результатом цього буде те, що назвою файла буде коментар щодо ключа, який було задано E<.Xr ssh-add 1>, коли ключ було завантажено до вашого E<.Xr ssh-agent 1>, а не коментар, що міститься у цьому файлі, і це трохи сумно. В інших випадках, якщо E<.Xr ssh-add 1> не надасть ключів, буде використано вміст E<.Ic default_ID_file>.

source: The E<.Ic default_ID_file> is the most recent file that matches: E<.Pa ~/.ssh/id*.pub>, (excluding those that match E<.Pa ~/.ssh/*-cert.pub>) so if you create a key that is not the one you want E<.Nm> to use, just use E<.Xr touch 1> on your preferred key's E<.Pa .pub> file to reinstate it as the most recent.
de: Die E<.Ic Vorgabekennungsdatei> ist die neuste Datei, die auf folgende passt: E<.Pa ~/.ssh/id*.pub> (allerdings ausschließlich solchen, die auf E<.Pa ~/.ssh/*-cert.pub> passen). Falls Sie also einen Schlüssel erstellen, der nicht der ist, den Sie E<.Nm> verwenden lassen wollen, setzen Sie einfach E<.Xr touch 1> auf der E<.Pa .pub>-Datei Ihres bevorzugten Schlüssels ein, um diesen wieder als den neusten einzustellen.
uk: E<.Ic default_ID_file> найсвіжіший файл, який відповідає: E<.Pa ~/.ssh/id*.pub>, (виключаючи відповідники взірцю E<.Pa ~/.ssh/*-cert.pub>), отже, якщо ви створите ключ, який не слід використовувати в E<.Nm>, просто скористайтеся E<.Xr touch 1> для файла E<.Pa .pub> бажаного ключа, щоб зробити його найсвіжішим.

source: EXAMPLES
de: BEISPIELE
uk: ПРИКЛАДИ

source: If you have already installed keys from one system on a lot of remote hosts, and you then create a new key, on a new client machine, say, it can be difficult to keep track of which systems on which you've installed the new key. One way of dealing with this is to load both the new key and old key(s) into your E<.Xr ssh-agent 1>. Load the new key first, without the E<.Fl c> option, then load one or more old keys into the agent, possibly by ssh-ing to the client machine that has that old key, using the E<.Fl A> option to allow agent forwarding:
de: Falls Sie bereits Schlüssel von einem System auf einer Reihe von fernen Rechnern installiert haben und Sie dann einen neuen Schlüssel auf einer neuen Client-Maschine erstellen, kann es schwierig sein, nachzuverfolgen, auf welchen Systemen Sie den neuen Schlüssel installiert haben. Eine Möglichkeit, damit umzugehen, besteht im Laden des alten und des oder der neuen Schlüssel in Ihren E<.Xr ssh-agent 1>. Laden Sie zuerst den neuen Schlüssel, ohne die Option E<.Fl c>, und laden Sie dann einen oder mehrere alte Schlüssel in den Vermittler, möglicherweise indem Sie sich mit Ssh in die Client-Maschine anmelden, die den alten Schlüssel hat, mittels der Option E<.Fl A>, um die Weiterleitung des Vermittlers zu erlauben:
uk: Якщо ви вже встановили ключі з однієї системи на багатьох віддалених вузлах, а потім, скажімо, створили ключ на новій клієнтській машині, буде важкою стежити за тим, у яких системах ви вже встановили новий ключ. Одним із вирішень цієї проблеми є завантаження нового і старого ключів до вашого E<.Xr ssh-agent 1>. Спочатку завантажте новий ключ без параметра E<.Fl c>, потім завантажте до агента один або декілька старих ключів, можливо, скориставшись ssh до клієнтської машини, де є цей старий ключ, з параметром E<.Fl A> для уможливлення переспрямування агента:

source: user@newclient$ ssh-add
de: Benutzer@NeuerClient$ ssh-add

source: user@newclient$ ssh -A old.client
de: Benutzer@NeuerClient$ ssh -A alter.Client

source: user@oldl$ ssh-add -c
de: Benutzer@alter$ ssh-add -c

source: No ... prompt for pass-phrase ...
de: Keine … Abfrage für Passphrase …
uk: Ні ... запит щодо пароля ...

source: user@old$ logoff
de: Benutzer@alter$ logoff

source: user@newclient$ ssh someserver
de: Benutzer@NeuerClient$ ssh Irgendeinserver

source: now, if the new key is installed on the server, you'll be allowed in unprompted, whereas if you only have the old key(s) enabled, you'll be asked for confirmation, which is your cue to log back out and run
de: Falls jetzt der neue Schlüssel auf dem Server installiert ist, können Sie sich ohne Passwortabfrage anmelden. Falls aber nur die alten Schlüssel aktiviert sind, werden Sie um Bestätigung gebeten. Dies ist der Hinweis, sich wieder abzumelden und Folgendes auszuführen:
uk: тепер, якщо новий ключ встановлено на сервері, ви зможете увійти до системи без запиту, оскільки, якщо у вас увімкнено лише старі ключі, система попросить підтвердження, що і є вашим сигналом для входу і віддання команди

source: user@newclient$ ssh-copy-id -i someserver
de: Benutzer@NeuerClient$ ssh-copy-id -i Irgendeinserver

source: The reason you might want to specify the -i option in this case is to ensure that the comment on the installed key is the one from the E<.Pa .pub> file, rather than just the filename that was loaded into your agent. It also ensures that only the id you intended is installed, rather than all the keys that you have in your E<.Xr ssh-agent 1>. Of course, you can specify another id, or use the contents of the E<.Xr ssh-agent 1> as you prefer.
de: Der Grund für die Angabe der Option »-i« für diesen Fall liegt darin, sicherzustellen, dass der Kommentar bei dem installierten Schlüssel der aus der E<.Pa .pub>-Datei ist und nicht nur der Dateiname, der in Ihren Vermittler geladen wurde. Sie stellt auch sicher, dass nur die beabsichtigten Kennungen installiert werden, statt alle Schlüssel, die sich in Ihrem E<.Xr ssh-agent 1> befinden. Natürlich können Sie eine andere Kennung angeben oder den Inhalt von E<.Xr ssh-agent 1> verwenden, ganz wie Sie möchten.
uk: Причиною для використання тут параметра B<-i> є забезпечення того, щоб коментарем до встановленого ключа був коментар з файла E<.Pa .pub>, а не просто назва файла, який було завантажено до вашого агента. Цим також забезпечується те, що буде встановлено лише потрібний вам ідентифікатор, а не усі ключі, які є у вашому E<.Xr ssh-agent 1>. Звичайно ж, ви можете вказати інший ідентифікатор або скористатися, якщо хочете, даними E<.Xr ssh-agent 1>.

source: Having mentioned E<.Xr ssh-add 1 Ns 's> E<.Fl c> option, you might consider using this whenever using agent forwarding to avoid your key being hijacked, but it is much better to instead use E<.Xr ssh 1 Ns 's> E<.Ar ProxyCommand> and E<.Fl W> option, to bounce through remote servers while always doing direct end-to-end authentication. This way the middle hop(s) don't get access to your E<.Xr ssh-agent 1>. A web search for E<.Ql ssh proxycommand nc> should prove enlightening (N.B. the modern approach is to use the E<.Fl W> option, rather than E<.Xr nc 1>).
de: Sie könnten in Betracht ziehen, die Option E<.Fl c> von E<.Xr ssh-add 1> zu verwenden, immer wenn Sie die Weiterleitung des Vermittlers verwenden, um das Entführen Ihrer Schlüssel zu vermeiden. Allerdings ist es viel besser, stattdessen die Optionen E<.Ar ProxyCommand> und E<.Fl W> von E<.Xr ssh-add 1> zu verwenden, um durch ferne Rechner zu springen, aber immer direkte Ende-zu-Ende-Authentifzierung durchzuführen. Auf diese Weise erhalten die zwischenliegenden Systeme keinen Zugriff auf Ihren E<.Xr ssh-agent 1>. Eine Websuche nach E<.Ql ssh proxycommand nc> sollte dazu erhellend wirken (Nebenmerkung: Der modernere Ansatz ist die Verwendung der Option E<.Fl W> statt E<.Xr nc 1>).
uk: Якщо вже згадали параметр E<.Xr ssh-add 1> E<.Fl c>, вам варто користуватися ним кожного разу при переспрямуванні агента, щоб уникнути перехоплення вашого ключа. Втім, набагато кращим виходом є використання параметрів E<.Xr ssh 1> E<.Ar ProxyCommand> та E<.Fl W> для усування проміжних віддалених серверів і безумовного використання безпосереднього розпізнавання між кінцями ланцюга зв'язку. Якщо користуватися цими параметрами, проміжні ланки не отримуватимуть доступу до вашого E<.Xr ssh-agent 1>. Якщо пошукати в інтернеті E<.Ql ssh proxycommand nc>, ви отримаєте достатні матеріали (N.B. сучасним підходом є використання параметра E<.Fl W>, а не E<.Xr nc 1>).

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl i Op Ar identity_file> E<.Op Fl p Ar port> E<.Op Fl o Ar ssh_option> E<.Op Ar user Ns @ Ns> E<.Ar hostname> E<.Nm> E<.Fl h | Fl ?>
de: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl i Op Ar Identitätsdatei> E<.Op Fl p Ar Port> E<.Op Fl o Ar SSH-Option> E<.Op Ar Benutzer Ns @ Ns> E<.Ar Rechnername> E<.Nm> E<.Fl h | Fl ?>
uk: E<.Nm> E<.Op Fl f> E<.Op Fl n> E<.Op Fl i Op Ar файл_профіль> E<.Op Fl p Ar порт> E<.Op Fl o Ar параметр_ssh> E<.Op Ar користувач Ns @ Ns> E<.Ar назва_вузла> E<.Nm> E<.Fl h | Fl ?>

source: Fl p Ar port , Fl o Ar ssh_option
uk: Fl p Ar порт , Fl o Ar параметр_ssh
