Repository: sebras/manpages-l10n
Catalog: po/*/man1/stat.1.po
Languages: es, sr, sv, uk

source: April 2022
es: Abril de 2022
sr: Априла 2022
uk: Квітень 2022 року

source: User Commands
es: Órdenes de usuario
sr: Корисничке наредбе
sv: Användarkommandon
uk: Команди користувача

source: NAME
es: NOMBRE
sr: НАЗИВ
sv: NAMN
uk: НАЗВА

source: stat - display file or file system status
es: stat - muestra el estado de un archivo o sistema de archivos
sr: stat - приказује стање датотеке или система датотека
sv: stat - visa fil- eller filsystemstatus
uk: stat — показ стану файла або файлової системи

source: SYNOPSIS
es: SINOPSIS
sr: УВОД
uk: КОРОТКИЙ ОПИС

source: B<stat> [I<\,OPTION\/>]... I<\,FILE\/>...
es: B<stat> [I<\,OPCIÓN\/>]... I<\,ARCHIVO\/>...
sr: B<stat> [I<\,ОПЦИЈА\/>]... I<\,ДАТОТЕКА\/>...
sv: B<stat> [I<\,FLAGGA\/>]... I<\,FIL\/>...
uk: B<stat> [I<\,ПАРАМЕТР\/>]... I<\,ФАЙЛ\/>...

source: DESCRIPTION
es: DESCRIPCIÓN
sr: ОПИС
sv: BESKRIVNING
uk: ОПИС

source: Display file or file system status.
es: Muestra el estado de un archivo o sistema de archivos
sr: Приказује стање датотеке или система датотека.
sv: Visa fil- eller filsystemstatus.
uk: Показати файл або стан файлової системи.

source: Mandatory arguments to long options are mandatory for short options too.
es: Los argumentos obligatorios para las opciones largas son también obligatorios para las opciones cortas.
sr: Обавезни аргументи за дуге опције су обавезни и за кратке опције такође.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.
uk: Обов'язкові аргументи для довгих параметрів також є обов'язковими для коротких параметрів.

source: follow links
es: sigue los enlaces
sr: прати везе
sv: Följ länkar.
uk: переходити за посиланнями

source: display file system status instead of file status
es: muestra el estado del sistema de archivos en lugar del estado del propio archivo
sr: приказује стање система датотека уместо стања датотеке
sv: Visa filsystemstatus istället för filstatus.
uk: показати стан файлової системи, а не файла

source: B<--cached>=I<\,MODE\/>
es: B<--cached>=I<\,MODO\/>
sr: B<--cached>=I<\,РЕЖИМ\/>
sv: B<--cached>=I<\,LÄGE\/>
uk: B<--cached>=I<\,РЕЖИМ\/>

source: specify how to use cached attributes; useful on remote file systems. See MODE below
es: define cómo emplear los atributos guardados; útil para sistemas de archivo remotos. Consulte MODO a continuación.
sr: одређује како се користе кеширани атрибути; корисно на удаљеним системима датотека. Видите РЕЖИМ испод
sv: Ange hur cachade attribut används; användbart på fjärrsystem. Se LÄGE nedan.
uk: вказати, як використовувати кешовані атрибути; корисно на віддалених файлових системах. Див. РЕЖИМ нижче.

source: B<-c> B<--format>=I<\,FORMAT\/>
es: B<-c> B<--format>=I<\,FORMATO\/>
sr: B<-c> B<--format>=I<\,ЗАПИС\/>
uk: B<-c> B<--format>=I<\,ФОРМАТ\/>

source: use the specified FORMAT instead of the default; output a newline after each use of FORMAT
es: utiliza el FORMATO definido en lugar del asignado por defecto. Crea un salto de línea después de cada uso de FORMATO
sr: користи наведени ЗАПИС уместо основног; даје нови ред након сваког коришћења ЗАПИСА
sv: Använd angivet FORMAT istället för standardformat; skriv ut en nyrad efter varje användning av FORMAT.
uk: скористатися вказаним ФОРМАТом замість типового; виводити символ нового рядка після кожного використання ФОРМАТу

source: B<--printf>=I<\,FORMAT\/>
es: B<--printf>=I<\,FORMATO\/>
sr: B<--printf>=I<\,ЗАПИС\/>
uk: B<--printf>=I<\,ФОРМАТ\/>

source: like B<--format>, but interpret backslash escapes, and do not output a mandatory trailing newline; if you want a newline, include \en in FORMAT
es: Igual que B<--format> salvo que interpreta las barras invertidas y no crea una nueva línea. Si quiere que se cree una nueva línea, deberá incluir \en en FORMATO
sr: као B<--format>, али тумачи крајичнике контра косе црте, а не даје обавезни пратећи нови ред; ако желите нови ред, укључите \en у ЗАПИСУ
sv: Som B<--format>, men tolka specialkoder med omvänt snedstreck, och skriv inte ut en obligatorisk avslutande nyrad; om du vill ha en nyrad, ta med \en i FORMAT.
uk: подібний до B<--format>, але з обробкою екранування символом зворотної похилої риски і без виведення обов'язкового кінцевого символу нового рядка; якщо вам потрібен символ нового рядка, включіть до ФОРМАТу \en

source: print the information in terse form
es: muestra información succíntamente
sr: исписује податке у сажетом облику
sv: Skriv informationen på kortfattad form.
uk: вивести відомості у скороченій формі

source: display this help and exit
es: muestra la ayuda y finaliza
sr: приказује ову помоћ и излази
sv: Visa denna hjälp och avsluta.
uk: відображає довідку і виходить

source: output version information and exit
es: muestra la versión del programa y termina
sr: исписује податке о издању и излази
sv: Visa versionsinformation och avsluta.
uk: виводить інформацію про версію і виходить

source: The MODE argument of B<--cached> can be: always, never, or default. \&'always' will use cached attributes if available, while \&'never' will try to synchronize with the latest attributes, and \&'default' will leave it up to the underlying file system.
es: El argumento de B<--cached> puede ser: 'always', 'never' o 'default'. \&'always' emplea los atributos guardados si están disponibles, \&'never' intenta sincronizarse con los últimos atributos mientras que \&'default' lo deja en manos del sistema de archivo.
sv: Argumentet LÄGE till B<--cached> kan vara: always, never eller default. ”always” kommer använda cachade attribut om de finns, medan ”never” kommer försöka synkronisera med de senaste attributen och ”default” kommer överlåta detta till det underliggande filsystemet.
uk: Аргументом РЕЖИМ параметра B<--cached> може бути одне з таких значень: always, never або default.\&«always» -- використовувати кешовані атрибути, якщо такі доступні, \&«never» -- намагатися синхронізуватися із найсвіжішими атрибутами,\&«default» -- використовувати параметри базової файлової системи.

source: The valid format sequences for files (without B<--file-system>):
es: Estas son las secuencias válidas para los archivos (sin B<--file-system>):
sr: Исправни низови записа за датотеке (без B<--file-system>):
sv: De giltiga formatsekvenserna för filer (utan B<--file-system>):
uk: Коректні послідовності форматів для файлів (без B<--file-system>):

source: permission bits in octal (note '#' and '0' printf flags)
es: permisos en formato octal (observe las marcas '#' y '0') de printf
sr: битови овлашћења у окталу (бележи # и 0 заставице „printf“-а)
sv: åtkomstbitar oktalt (notera printf-flaggorna ”#” och ”0”)
uk: біти прав доступу у вісімковому форматі (зауважте прапорці printf «#» та «0»)

source: permission bits and file type in human readable form
es: permisos y tipo de archivo en formato humanamente legible
sr: битови овлашћења у облику читљивом људима
sv: åtkomstbitar och filtyp i format läsbart för människa
uk: біти прав доступу і тип файла у зручній для читання формі

source: number of blocks allocated (see %B)
es: cantidad de bloques empleados (consulte %B)
sr: број додељених блокова (видите %B)
sv: antal använda block (se %B)
uk: кількість розподілених блоків (див. %B)

source: the size in bytes of each block reported by %b
es: tamaño en bytes de cada bloque dado por %b
sr: величина у бајтовима сваког блока које извести %b
sv: storleken i byte på varje block rapporterat av %b
uk: розмір у байтах для кожного з блоків, які буде виведено, якщо використано %b

source: SELinux security context string
es: Contexto de seguridad de SELinux
sr: ниска безбедносног контекста СЕЛинукса
sv: SELinux-säkerhetskontextsträng
uk: рядок контексту захисту SELinux

source: device number in decimal (st_dev)
es: número del dispositivo en formato decimal (st_dev)
sv: enhetsnummer decimalt (st_dev)
uk: число пристрою у десятковій формі (st_dev)

source: device number in hex (st_dev)
es: número del dispositivo en formato hexadecimal (st_dev)
sv: enhetsnummer hexadecimalt (st_dev)
uk: число пристрою у шістнадцятковій формі (st_dev)

source: major device number in decimal
es: número mayor del dispositivo en formato decimal
sv: övre enhetsnummer decimalt
uk: число основного пристрою у десятковій формі

source: minor device number in decimal
es: número menor del dispositivo en formato decimal
sv: undre enhetsnummer decimalt
uk: число другорядного пристрою у десятковій формі

source: raw mode in hex
es: modo raw en formato hexadecimal
sr: хексадецимални сирови режим
sv: tillståndet rått hexadecimalt
uk: необроблене значення прав доступу у шістнадцятковій формі

source: file type
es: tipo de archivo
sr: врста датотеке
sv: filtyp
uk: тип файла

source: group ID of owner
es: ID del grupo del propietario
sr: ИБ групе власника
sv: grupp-ID på ägare
uk: ідентифікатор групи власника

source: group name of owner
es: nombre del grupo del propietario
sr: назив групе власника
sv: gruppnamn på ägare
uk: назва групи власника

source: number of hard links
es: cantidad de enlaces duros
sr: број чврстих веза
sv: antal hårda länkar
uk: кількість жорстких посилань

source: inode number
es: número del inodo
sr: број и-чвора
sv: inodnummer
uk: номер inode

source: mount point
es: punto de montaje
sr: тачка качења
sv: monteringspunkt
uk: точка монтування

source: file name
es: nombre del archivo
sr: назив датотеке
sv: filnamn
uk: назва файла

source: quoted file name with dereference if symbolic link
es: nombre del archivo o de su referente si es un enlace simbólico
sr: цитирани назив датотеке са разупутом ако је симболичка веза
sv: citerat filnamn, med dereferens om symbolisk länk
uk: назва файла у лапках із розіменуванням, якщо файл є символьним посиланням

source: optimal I/O transfer size hint
es: sugerencia para una óptima transferencia E/S
sr: оптимална величина У/И преноса
sv: tips om optimal storlek för I/O-överföringar
uk: оптимальний розмір передавання введення-виведення

source: total size, in bytes
es: tamaño total en bytes
sr: укупна величина, у бајтовима
sv: total storlek, i byte
uk: загальний розмір у байтах

source: device type in decimal (st_rdev)
es: tipo del dispositivo en formato decimal (st_rdev)
sv: enhetstyp decimalt (st_rdev)
uk: тип пристрою у десятковій формі (st_rdev)

source: device type in hex (st_rdev)
es: tipo de dispositivo en formato hexadecimal (st_rdev)
sv: enhetstyp hexadecimalt (st_rdev)
uk: тип пристрою у шістнадцятковій формі (st_rdev)

source: major device type in decimal, for character/block device special files
es: tipo principal de dispositivo en formato decimal, para archivos especiales de bloques/caracteres
sv: övre enhetstyp decimalt, för tecken-/blockenhetsspecialfiler
uk: тип основного пристрою у десятковій формі, для особливих файлів символьних/блокових пристроїв

source: minor device type in decimal, for character/block device special files
es: subtipo de dispositivo en formato decimal, para archivos especiales de bloques/caracteres
sv: undre enhetstyp decimalt, för tecken-/blockenhetsspecialfiler
uk: тип другорядного пристрою у десятковій формі, для особливих файлів символьних/блокових пристроїв

source: major device type in hex, for character/block device special files
es: tipo principal de dispositivo en formato hexadecimal, para archivos especiales de bloques/caracteres
sr: врста већег уређаја хексадецимално, за посебне датотеке уређаја знака/блока
sv: övre enhetsnummer hexadecimalt, för tecken-/blockenhetsspecialfiler
uk: тип основного пристрою у шістнадцятковій формі, для особливих файлів символьних/блокових пристроїв

source: minor device type in hex, for character/block device special files
es: subtipo de dispositivo en formato hexadecimal, para archivos especiales de bloques/caracteres
sr: врста мањег уређаја хексадецимално, за посебне датотеке уређаја знака/блока
sv: undre enhetsnummer hexadecimalt, för tecken-/blockenhetsspecialfiler
uk: тип другорядного пристрою у шістнадцятковій формі, для особливих файлів символьних/блокових пристроїв

source: user ID of owner
es: ID de usuario del propietario
sr: кориснички ИБ власника
sv: användar-ID på ägare
uk: ідентифікатор користувача-власника

source: user name of owner
es: nombre de usuario del propietario
sr: корисничко име власника
sv: användarnamn på ägare
uk: ім'я користувача-власника

source: time of file birth, human-readable; - if unknown
es: hora de creación del archivo en formato humanamente legible. Si es desconocido se emplea '-'
sr: време стварања датотеке, људима читљиво; - ако је непознато
sv: filens födelsetid, läsbar för människa, eller - om okänd
uk: момент народження файла у зручній для читання формі; -, якщо невідомий

source: time of file birth, seconds since Epoch; 0 if unknown
es: hora de creación del archivo en segundos desde el Inicio (Epoch). Se asigna 0 si es desconocido
sr: време стварања датотеке, секунде од старине; 0 ако је непознато
sv: filens födelsetid, sekunder sedan Epok, eller 0 om okänd
uk: момент народження файла у секундах з початку епохи; 0, якщо невідомий

source: time of last access, human-readable
es: hora del último acceso en formato humanamente legible
sr: време последњег приступа, људима читљиво
sv: senaste åtkomsttid, läsbar för människa
uk: момент останнього доступу у зручному для читання форматі

source: time of last access, seconds since Epoch
es: hora del último acceso. En segundos desde el Inicio (Epoch)
sr: време последњег приступа, секунде од старине
sv: senaste åtkomsttid, sekunder sedan Epok
uk: момент останнього доступу у секундах з початку епохи

source: time of last data modification, human-readable
es: hora de la última modificación en formato humanamente legible
sr: време последње измене података, људима читљиво
sv: senaste datamodifieringstid, läsbar för människa
uk: момент останнього внесення змін до даних у зручній для читання формі

source: time of last data modification, seconds since Epoch
es: fecha de la última modificación en segundos desde el Inicio (Epoch)
sr: време последње измене података, секунде од старине
sv: senaste datamodifieringstid, sekunder sedan Epok
uk: момент останнього внесення змін до даних у секундах з початку епохи

source: time of last status change, human-readable
es: fecha del último cambio de estado en formato humanamente entendible.
sr: време последње промене стања, људима читљиво
sv: senaste statusändringstid, läsbar för människa
uk: момент останньої зміни стану у зручному для читання форматі

source: time of last status change, seconds since Epoch
es: fecha del último cambio de estado en segundos desde el Inicio (Epoch)
sr: време последње промене стања, секунде од старине
sv: senaste statusändringstid, sekunder sedan Epok
uk: момент останньої зміни стану у секундах з початку епохи

source: Valid format sequences for file systems:
es: Formatos válidos para sistemas de archivo:
sr: Исправни низови записа за системе датотека:
sv: Giltiga formatsekvenser för filsystem:
uk: Коректні послідовності форматів для файлових систем:

source: free blocks available to non-superuser
es: bloques disponibles para usuarios no administradores
sr: слободни блокови доступни обичном кориснику
sv: fria block tillgängliga för icke superanvändare
uk: вільні блоки, які доступні користувачеві, який не є суперкористувачем

source: total data blocks in file system
es: cantidad total de bloques de datos en el sistema de archivos
sr: укупно блокова података на систему датотека
sv: totalt antal datablock i filsystem
uk: загальна кількість блоків у файловій системі

source: total file nodes in file system
es: nodos totoales en el sistema de archivo
sr: укупно чворова датотека на систему датотека
sv: totalt antal filnoder i filsystem
uk: загальна кількість вузлів у файловій системі

source: free file nodes in file system
es: nodos libres en el sistema de archivo
sr: слободни чворови датотека на систему датотека
sv: fria filnoder i filsystem
uk: кількість вільних файлових вузлів у файловій системі

source: free blocks in file system
es: bloques libres en el sistema de archivos
sr: слободни блокови на систему датотека
sv: fria block i filsystem
uk: кількість вільних блоків у файловій системі

source: file system ID in hex
es: ID del sistema de archivo en formato hexadecimal
sr: ИБ система датотека хексадецимално
sv: filsystem-ID hexadecimalt
uk: ідентифікатор файлової системи у шістнадцятковій формі

source: maximum length of filenames
es: longitud máxima para los nombres de archivo
sr: највећа дужина назива датотека
sv: maxlängd på filnamn
uk: максимальна довжина назви файла

source: block size (for faster transfers)
es: tamaño de bloque (para transferencias más rápidas)
sr: величина блока (за бржи пренос)
sv: blockstorlek (för snabbare överföringar)
uk: розмір блоку (для швидких передавань даних)

source: fundamental block size (for block counts)
es: tamaño de bloque fundamental (para contabilizarlos)
sr: основна величина блока (за број блокова)
sv: grundläggande blockstorlek (för antal block)
uk: розмір фундаментального блоку (для лічильників блоків)

source: file system type in hex
es: tipo de sistema de archivos en formato hexadecimal
sr: врста система датотека хексадецимално
sv: filsystemstyp hexadecimalt
uk: тип файлової системи у шістнадцятковій формі

source: file system type in human readable form
es: tipo de sistema de archivo en formato humanamente legible
sr: врста система датотека у облику читљивом људима
sv: filsystemstyp i format läsbart för människa
uk: тип файлової системи у зручній для читання формі

source: --terse is equivalent to the following FORMAT:
es: --terse equivale a los siguientes FORMATOS:
sr: B<--terse> је еквивалент следећем ЗАПИСУ:
sv: B<--terse> är likvärdigt med följande FORMAT:
uk: --terse еквівалентний до такого значення ФОРМАТ:

source: --terse --file-system is equivalent to the following FORMAT:
es: --terse --file-system equivale al siguiente FORMATO:
sr: B<--terse> B<--file-system> је еквивалент следећем ЗАПИСУ:
sv: B<--terse> B<--file-system> är likvärdigt med följande FORMAT:
uk: --terse --file-system еквівалентне до такого значення ФОРМАТ:

source: NOTE: your shell may have its own version of stat, which usually supersedes the version described here. Please refer to your shell's documentation for details about the options it supports.
es: NOTA: su shell puede incluir su propia versión de stat que suele prevalecer sobre la aquí descrita. Vea la documentación de su shell para ver qué opciones incluye.
sr: НАПОМЕНА: ваша шкољка може имати своје издање B<stat>, које обично смењује издање које је описано овде. Молим погледајте документацију ваше шкољке за детаље о опцијама које подржава.
sv: OBS: ditt skal kan ha sin egen version av B<stat>, som ofta ersätter versionen som beskrivs här. Se dokumentationen för ditt skal för detaljer om valen det stödjer.
uk: ПРИМІТКА: ваша оболонка може надавати свою версію stat, яка, зазвичай, перекриває версію, описану тут. Зверніться до документації з вашої оболонки, щоб дізнатись, підтримку яких параметрів у ній передбачено.

source: AUTHOR
es: AUTOR
sr: АУТОР
sv: UPPHOVSMAN
uk: АВТОР

source: Written by Michael Meskes.
es: Escrito por Michael Meskes.
sr: Написао је Мајкл Мескес.
sv: Skrivet av Michael Meskes.
uk: Автором програми є Michael Meskes.

source: REPORTING BUGS
es: INFORMAR DE ERRORES
sr: ПРИЈАВЉИВАЊЕ ГРЕШАКА
sv: RAPPORTERA FEL
uk: ЗВІТИ ПРО ВАДИ

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
es: Ayuda en línea de GNU Coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sr: Помоћ на мрежи за ГНУ coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>
uk: Мережева довідка GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
es: Informe cualquier error de traducción a E<lt>https://translationproject.org/team/es.htmlE<gt>
sr: Грешке у преводу пријавите на E<lt>https://translationproject.org/team/sr.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.
uk: Повідомляйте про будь-які помилки в перекладі на E<lt>https://translationproject.org/team/E<gt>

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2022 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2022 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2022 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
es: Esto es software libre: usted es libre de cambiarlo y redistribuirlo. NO HAY GARANTÍA, en la medida permitida por la legislación.
sr: Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: SEE ALSO
es: VÉASE TAMBIÉN
sr: ВИДИТЕ ТАКОЂЕ
sv: SE OCKSÅ
uk: ДИВ. ТАКОЖ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/statE<gt>
es: Documentación completa: E<lt>https://www.gnu.org/software/coreutils/statE<gt>
sr: Сва документација се налази на E<lt>https://www.gnu.org/software/coreutils/statE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/statE<gt>
uk: Повна документація: E<lt>https://www.gnu.org/software/coreutils/statE<gt>

source: or available locally via: info \(aq(coreutils) stat invocation\(aq
es: también disponible localmente ejecutando:info \(aq(coreutils) stat invocation\(aq
sr: или је доступна на рачунару путем наредбе „info \(aq(coreutils) stat invocation\(aq“
sv: eller tillgängligt lokalt via: info \(aq(coreutils) stat invocation\(aq
uk: або доступна локально через виклик info \(aq(coreutils) stat invocation\(aq

source: September 2020
es: Septiembre de 2020
sr: Септембра 2020
uk: Вересень 2020 року

source: The B<--cached> MODE argument can be; always, never, or default. `always` will use cached attributes if available, while `never` will try to synchronize with the latest attributes, and `default` will leave it up to the underlying file system.
es: El argumento de B<--cached> puede ser: 'always', 'never' o 'default'. 'always' emplea los atributos guardados si están disponibles, 'never' intenta sincronizarse con los últimos atributos mientras que 'default' lo deja en manos del sistema de archivo.
sr: Аргумент B<--cached> РЕЖИМ може бити: „always“, „never“, или „default“. „always“ (увек) ће користити кеширане атрибуте ако су доступни, „never“ (никад) ће покушати да усагласи са последњим атрибутима „default“ (основно) ће оставити подређеном систему датотека.
sv: Argumentet B<--cached> LÄGE kan vara: always, never eller default. ”always” kommer använda cachade attribut om de finns, medan ”never” kommer försöka synkronisera med de senaste attributen och ”default” kommer överlåta detta till det underliggande filsystemet.
uk: Аргументом РЕЖИМ параметра B<--cached> може бути одне з таких значень: always, never або default. «always» -- використовувати кешовані атрибути, якщо такі доступні, «never» -- намагатися синхронізуватися із найсвіжішими атрибутами, «default» -- використовувати параметри базової файлової системи.
