Repository: sebras/manpages-l10n
Catalog: po/*/man1/stat.1.po
Languages: es, sr, sv, uk

source: device number in decimal
es: número del dispositivo en formato decimal
sr: децимални број уређаја
sv: enhetsnummer decimalt
uk: число пристрою у десятковій формі

source: device number in hex
es: número del dispositivo en formato hexadecimal
sr: хексадецимални број уређаја
uk: номер пристрою у шістнадцятковій формі

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2020 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2020 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2020 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
es: Octubre de 2021
sr: Октобра 2021
sv: oktober 2021
uk: Жовтень 2021 року

source: March 2022
es: Marzo 2022
sr: Марта 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
es: Copyright \(co 2021 Free Software Foundation, Inc. Licencia GPLv3+: GNU GPL versión 3 o posterior E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sr: Copyright \(co 2021 Free Software Foundation, Inc. Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: August 2022
es: Agosto de 2022
sr: Августа 2022
uk: Серпень 2022 року

source: September 2021
es: Septiembre de 2021
sr: Септембра 2021

source: COPYRIGHT
sr: АУТОРСКА ПРАВА
uk: АВТОРСЬКІ ПРАВА

source: stat(2), statfs(2), statx(2)
sr: B<stat>(2), B<statfs>(2), B<statx>(2)
sv: B<stat>(2), B<statfs>(2), B<statx>(2)
uk: B<stat>(2), B<statfs>(2), B<statx>(2)

source: September 2022
uk: Вересень 2022 року

source: GNU coreutils 9.1
sr: ГНУ coreutils 9.1

source: GNU coreutils 8.32
sr: ГНУ coreutils 8.32

source: GNU coreutils 9.0
sr: ГНУ coreutils 9.0

source: March 2020
sv: mars 2020

source: October 2020
sv: oktober 2020
