Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-firstboot.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-firstboot, systemd-firstboot.service - Initialize basic system settings on or before the first boot-up of a system
de: systemd-firstboot, systemd-firstboot.service - Initialisiert grundlegende Systemeinstellungen während oder vor dem ersten Hochfahren eines Systems

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-firstboot> [OPTIONS...]
de: B<systemd-firstboot> [OPTIONEN…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-firstboot> initializes the most basic system settings interactively on the first boot, or optionally non-interactively when a system image is created\&. The service is started if I<ConditionFirstBoot=yes> is satisfied\&. This essentially means that /etc/ is empty, see B<systemd.unit>(5) for details\&.
de: B<systemd-firstboot> initialisiert die meisten grundlegenden Systemeinstellungen interaktiv während des ersten Systemstarts oder optional nichtinteraktiv bei der Erstellung des System-Abbildes\&. Der Dienst wird gestartet, falls I<ConditionFirstBoot=yes> erfüllt ist\&. Dies bedeutet im Wesentlichen, dass /etc/ leer ist, siehe B<systemd.unit>(5) für Details\&.

source: The following settings may be set up:
de: Die folgenden Einstellungen können eingerichtet werden:

source: The system locale, more specifically the two locale variables I<LANG=> and I<LC_MESSAGES>
de: Die Locale des Systems, genauer die zwei Locale-Variablen I<LANG=> und I<LC_MESSAGES>

source: The system keyboard map
de: Die Tastaturzuordnung des Systems

source: The system time zone
de: Die Zeitzone des Systems

source: The system hostname
de: Der Rechnername des Systems

source: The machine ID of the system
de: Die Maschinenkennung des Systems

source: The root user\*(Aqs password
de: Das Passwort des Benutzers »root«

source: Each of the fields may either be queried interactively by users, set non-interactively on the tool\*(Aqs command line, or be copied from a host system that is used to set up the system image\&.
de: Jedes der Felder kann entweder interaktiv durch Benutzer abgefragt, nicht interaktiv über die Befehlszeile des Werkzeugs gesetzt oder von einem Wirtssystem, das zum Einrichten des Systemabbildes verwandt wird, kopiert werden\&.

source: If a setting is already initialized, it will not be overwritten and the user will not be prompted for the setting\&.
de: Falls eine Einstellung bereits initialisiert ist, wird sie nicht überschrieben und der Benutzer wird nicht für die Einstellung befragt\&.

source: Note that this tool operates directly on the file system and does not involve any running system services, unlike B<localectl>(1), B<timedatectl>(1) or B<hostnamectl>(1)\&. This allows B<systemd-firstboot> to operate on mounted but not booted disk images and in early boot\&. It is not recommended to use B<systemd-firstboot> on the running system while it is up\&.
de: Beachten Sie, dass dieses Werkzeug direkt auf dem Dateisystem agiert und keine laufenden Systemdienste beteiligt, anders als B<localectl>(1), B<timedatectl>(1) oder B<hostnamectl>(1)\&. Dies erlaubt B<systemd-firstboot> auf eingehängten, aber nicht gestarteten Plattenabbildern und in der frühen Systemstartphase zu agieren\&. Es wird nicht empfohlen, B<systemd-firstboot> im laufenden System, während es hochgefahren ist, zu verwenden\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: B<--root=>I<root>
de: B<--root=>I<Wurzel>

source: Takes a directory path as an argument\&. All paths will be prefixed with the given alternate I<root> path, including config search paths\&. This is useful to operate on a system image mounted to the specified directory instead of the host system itself\&.
de: Akzeptiert einen Verzeichnispfad als Argument\&. Allen Pfaden wird der übergebene alternative I<Wurzel>pfad vorangestellt, einschließlich Konfigurationssuchpfaden\&. Dies ist zur Arbeit auf Systemabbildern nützlich, die auf dem angegebenen Verzeichnis eingehängt sind, statt auf dem Wirtssystem selbst\&.

source: B<--image=>I<path>
de: B<--image=>I<Pfad>

source: Takes a path to a disk image file or block device node\&. If specified all operations are applied to file system in the indicated disk image\&. This is similar to B<--root=> but operates on file systems stored in disk images or block devices\&. The disk image should either contain just a file system or a set of file systems within a GPT partition table, following the \m[blue]B<Discoverable Partitions Specification>\m[]\&\s-2\u[1]\d\s+2\&. For further information on supported disk images, see B<systemd-nspawn>(1)\*(Aqs switch of the same name\&.
de: Akzeptiert einen Pfad zu einer Plattenabbilddatei oder einem Blockgerätenamen\&. Falls angegeben, werden alle Aktionen auf das Dateisystem in dem angegebenen Plattenabbild angewandt\&. Dies ist ähnlich zu B<--root=>, agiert aber auf Dateisystemen, die in Plattenabbildern oder Blockgeräten gespeichert sind\&. Das Plattenabbild sollte entweder nur ein Dateisystem oder eine Reihe von Dateisystemen innerhalb einer GPT-Partitionstabelle enthalten, die der \m[blue]B<Spezifikation für auffindbare Partitionen>\m[]\&\s-2\u[1]\d\s+2 folgt\&. Für weitere Informationen über unterstützte Plattenabbilder, siehe den Schalter von B<systemd-nspawn>(1) mit dem gleichen Namen\&.

source: Sets the system locale, more specifically the I<LANG=> and I<LC_MESSAGES> settings\&. The argument should be a valid locale identifier, such as "de_DE\&.UTF-8"\&. This controls the B<locale.conf>(5) configuration file\&.
de: Setzt die System-Locale, genauer die Einstellungen I<LANG=> und I<LC_MESSAGES>\&. Das Argument sollte ein gültiger Locale-Kennzeichner wie »de_DE\&.UTF-8« sein\&. Dies steuert die Konfigurationsdatei B<locale.conf>(5)\&.

source: B<--keymap=>I<KEYMAP>
de: B<--keymap=>I<TASTENZUORDNUNG>

source: Sets the system keyboard layout\&. The argument should be a valid keyboard map, such as "de-latin1"\&. This controls the "KEYMAP" entry in the B<vconsole.conf>(5) configuration file\&.
de: Setzt die Systemtastaturbelegung\&. Das Argument sollte eine gültige Tastaturzuordnung sein, wie »de-latin1«\&. Dies steuert den Eintrag »KEYMAP« in der Konfigurationsdatei B<vconsole.conf>(5)\&.

source: B<--timezone=>I<TIMEZONE>
de: B<--timezone=>I<ZEITZONE>

source: Sets the system time zone\&. The argument should be a valid time zone identifier, such as "Europe/Berlin"\&. This controls the B<localtime>(5) symlink\&.
de: Setzt die Zeitzone des Systems\&. Das Argument sollte ein gültiger Zeitzonenkennzeichner wie »Europe/Berlin« sein\&. Dies steuert den Symlink B<localtime>(5)\&.

source: B<--hostname=>I<HOSTNAME>
de: B<--hostname=>I<RECHNERNAME>

source: Sets the system hostname\&. The argument should be a hostname, compatible with DNS\&. This controls the B<hostname>(5) configuration file\&.
de: Setzt den Rechnernamen des Systems\&. Das Argument sollte ein zum DNS kompatibler Rechnername sein\&. Dies steuert die Konfigurationsdatei B<hostname>(5)\&.

source: B<--machine-id=>I<ID>
de: B<--machine-id=>I<KENNUNG>

source: Sets the system\*(Aqs machine ID\&. This controls the B<machine-id>(5) file\&.
de: Setzt die Maschinenkennung des Systems\&. Dies steuert die Datei B<machine-id>(5)\&.

source: B<--root-password=>I<PASSWORD>, B<--root-password-file=>I<PATH>, B<--root-password-hashed=>I<HASHED_PASSWORD>
de: B<--root-password=>I<PASSWORT>, B<--root-password-file=>I<PFAD>, B<--root-password-hashed=>I<GEHASHTES_PASSWORT>

source: Sets the password of the system\*(Aqs root user\&. This creates/modifies the B<passwd>(5) and B<shadow>(5) files\&. This setting exists in three forms: B<--root-password=> accepts the password to set directly on the command line, B<--root-password-file=> reads it from a file and B<--root-password-hashed=> accepts an already hashed password on the command line\&. See B<shadow>(5) for more information on the format of the hashed password\&. Note that it is not recommended to specify plaintext passwords on the command line, as other users might be able to see them simply by invoking B<ps>(1)\&.
de: Setzt das Passwort des Benutzers root des Systems\&. Dies erstellt/verändert die B<passwd>(5)- und B<shadow>(5)-Datei\&. Diese Einstellung existiert auf drei Arten: B<--root-password=> akzeptiert das zu setzende Passwort direkt auf der Befehlszeile, B<--root-password-file=> liest es aus einer Datei und B<--root-password-hashed=> akzeptiert ein bereits gehashtes Passwort auf der Befehlszeile\&. Siehe B<shadow>(5) für weitere Informationen über das Format der gehashten Passwörter\&. Beachten Sie, dass die Angabe von Passwörtern auf der Befehlszeile nicht empfohlen wird, da andere Benutzer durch einfachen Aufruf von B<ps>(1) sie beobachten könnten\&.

source: Sets the shell of the system\*(Aqs root user\&. This creates/modifies the B<passwd>(5) file\&.
de: Setzt die Shell des Benutzer root des Systems\&. Dies erstellt/verändert die Datei B<passwd>(5)\&.

source: B<--kernel-command-line=>I<CMDLINE>
de: B<--kernel-command-line=>I<BEFEHLSZEILE>

source: Sets the system\*(Aqs kernel command line\&. This controls the /etc/kernel/cmdline file which is used by B<kernel-install>(8)\&.
de: Setzt die Kernelbefehlszeile des Systems\&. Dies steuert die Datei /etc/kernel/cmdline, die von B<kernel-install>(8) verwandt wird\&.

source: Prompt the user interactively for a specific basic setting\&. Note that any explicit configuration settings specified on the command line take precedence, and the user is not prompted for it\&.
de: Fragt den Benutzer interaktiv nach einer bestimmten grundlegenden Einstellung\&. Beachten Sie, dass jede explizit angegebene Einstellung auf der Befehlszeile Vorrang hat und der Benutzer nicht danach gefragt wird\&.

source: Query the user for locale, keymap, timezone, hostname, root\*(Aqs password, and root\*(Aqs shell\&. This is equivalent to specifying B<--prompt-locale>, B<--prompt-keymap>, B<--prompt-timezone>, B<--prompt-hostname>, B<--prompt-root-password>, B<--prompt-root-shell> in combination\&.
de: Fragt nach der Locale, Tastenzuordnung, Zeitzone, dem Rechnernamen, dem Passwort und der Shell von root\&. Dies ist äquivalent zur Angabe der Kombination von B<--prompt-locale>, B<--prompt-keymap>, B<--prompt-timezone>, B<--prompt-hostname>, B<--prompt-root-password>, B<--prompt-root-shell>\&.

source: Copy a specific basic setting from the host\&. This only works in combination with B<--root=> (see above)\&.
de: Kopiert eine bestimmte grundlegende Eigenschaft vom Rechner\&. Dies funktioniert nur in Kombination mit B<--root=> (siehe oben)\&.

source: Copy locale, keymap, time zone, root password and shell from the host\&. This is equivalent to specifying B<--copy-locale>, B<--copy-keymap>, B<--copy-timezone>, B<--copy-root-password>, B<--copy-root-shell> in combination\&.
de: Kopiert die Locale, Tastenzuordnung, Zeitzone, das root-Passwort und die Shell vom Rechner\&. Dies ist äquivalent zur Angabe der Kombination von B<--copy-locale>, B<--copy-keymap>, B<--copy-timezone>, B<--copy-root-password>, B<--copy-root-shell>\&.

source: Initialize the system\*(Aqs machine ID to a random ID\&. This only works in combination with B<--root=>\&.
de: Initialisiert die Maschinenkennung des Systems auf eine Zufallskennung\&. Dies funktioniert nur in Kombination mit B<--root=>\&.

source: systemd-firstboot doesn\*(Aqt modify existing files unless B<--force> is specified\&. For modifications to /etc/passwd and /etc/shadow, systemd-firstboot only modifies the entry of the "root" user instead of overwriting the entire file\&.
de: Systemd-firstboot verändert keine bestehenden Dateien, außer B<--force> ist angegeben\&. Für Veränderungen an /etc/passwd und /etc/shadow verändert Systemd-firstboot nur die Einträge des Benutzers »root«, anstatt die gesamte Datei zu überschreiben\&.

source: Removes the password of the system\*(Aqs root user, enabling login as root without a password unless the root account is locked\&. Note that this is extremely insecure and hence this option should not be used lightly\&.
de: Entfernt das Passwort vom Benutzer root des Systems und aktiviert die Anmeldung als root ohne Passwort, außer das Konto von root ist gesperrt\&. Beachten Sie, dass dies extrem unsicher ist und daher diese Option nicht leichtfertig verwandt werden sollte\&.

source: Takes a boolean argument\&. By default when prompting the user for configuration options a brief welcome text is shown before the first question is asked\&. Pass false to this option to turn off the welcome text\&.
de: Akzeptiert ein logisches Argument\&. Standardmäßig wird dem Benutzer bei der Aufforderung zur Eingabe von Konfigurationsoptionen ein kurzer Begrüßungstext gezeigt, bevor die erste Frage gestellt wird\&. Übergeben Sie falsch an diese Option, um diesen Begrüßungstext abzuschalten\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: KERNEL COMMAND LINE
de: KERNEL-BEFEHLSZEILE

source: Takes a boolean argument, defaults to on\&. If off, systemd-firstboot\&.service won\*(Aqt interactively query the user for basic settings at first boot, even if those settings are not initialized yet\&.
de: Akzeptiert ein logisches Argument, standardmäßig »on«\&. Falls »off«, wird systemd-firstboot\&.service den Benutzer beim ersten Systemstart nicht nach grundlegenden Eigenschaften befragen, selbst wenn diese Eigenschaften noch nicht initialisiert sind\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: Discoverable Partitions Specification
de: Spezifikation für auffindbare Partitionen

source: CREDENTIALS
de: ZUGANGSDATEN

source: B<systemd-firstboot> supports the service credentials logic as implemented by I<LoadCredential=>/I<SetCredential=> (see B<systemd.exec>(1) for details)\&. The following credentials are used when passed in:
de: B<systemd-firstboot> unterstützt die Dienste-Anmeldedaten-Logik, wie sie von I<LoadCredential=>/I<SetCredential=> implementiert ist (siehe B<systemd.exec>(1) für Details)\&. Die folgenden Anmeldedaten werden verwandt, wenn sie hereingereicht werden:

source: A hashed or plaintext version of the root password to use, in place of prompting the user\&. These credentials are equivalent to the same ones defined for the B<systemd-sysusers.service>(8) service\&.
de: Ein gehashtes oder eine Klartextversion des Passworts für root, anstelle den Benutzer zu fragen\&. Diese Anmeldedaten sind identisch zu den für den Dienst B<systemd-sysusers.service>(8) definierten\&.

source: Specifies the shell binary to use for the specified account when creating it\&. Equivalent to the credential of the same name defined for the B<systemd-sysusers.service>(8) service\&.
de: Legt das Shell-Programm, das für das festgelegte Konto bei der Erstellung verwandt werden soll, fest\&. Äquivalent zu dem für den Dienst B<systemd-sysusers.service>(8) definierten Anmeldedatum gleichen Namens\&.

source: These credentials specify the locale settings to set during first boot, in place of prompting the user\&.
de: Diese Anmeldedaten legen die Locale-Einstellungen fest, die während des ersten Systemstarts gesetzt werden, anstelle den Benutzer zu fragen\&.

source: This credential specifies the keyboard setting to set during first boot, in place of prompting the user\&.
de: Dieses Anmeldedatum legen die Tastatureinstellungen fest, die während des ersten Systemstarts gesetzt werden, anstelle den Benutzer zu fragen\&.

source: This credential specifies the system timezone setting to set during first boot, in place of prompting the user\&.
de: Dieses Anmeldedatum legt die beim ersten Systemstart zu setzende System-Zeitzoneneinstellung fest, anstelle den Benutzer zu fragen\&.

source: Note that by default the systemd-firstboot\&.service unit file is set up to inherit the listed credentials from the service manager\&. Thus, when invoking a container with an unpopulated /etc/ for the first time it is possible to configure the root user\*(Aqs password to be "systemd" like this:
de: Beachten Sie, dass standardmäßig die Unit-Datei systemd-firstboot\&.service so eingerichtet ist, dass sie die aufgeführten Anmeldedaten vom Diensteverwalter erbt\&. Wird daher der Container mit einem leeren /etc/ erstmalig aufgerufen, kann das Passwort des Benutzers root wie folgt auf »systemd« konfiguriert werden:

source: Note that these credentials are only read and applied during the first boot process\&. Once they are applied they remain applied for subsequent boots, and the credentials are not considered anymore\&.
de: Beachten Sie, dass diese Anmeldedaten nur während des ersten Systemstartprozesses gelesen und angewandt werden\&. Sobald sie angewandt wurden, bleiben sie für nachfolgende Systemstarts angewandt und die Anmeldedaten werden nicht mehr weiter betrachtet\&.

source: B<systemd-firstboot> initializes the most basic system settings interactively on the first boot, or optionally non-interactively when a system image is created\&. The service is started if I<ConditionFirstBoot=yes> is satisfied\&. This essentially means that /etc is empty, see B<systemd.unit>(5) for details\&.
de: B<systemd-firstboot> initialisiert die meisten grundlegenden Systemeinstellungen interaktiv während des ersten Systemstarts oder optional nichtinteraktiv bei der Erstellung des System-Abbildes\&. Der Dienst wird gestartet, falls I<ConditionFirstBoot=yes> erfüllt ist\&. Dies bedeutet im Wesentlichen, dass /etc leer ist, siehe B<systemd.unit>(5) für Details\&.

source: Query the user for locale, keymap, timezone, hostname and root password\&. This is equivalent to specifying B<--prompt-locale>, B<--prompt-keymap>, B<--prompt-timezone>, B<--prompt-hostname>, B<--prompt-root-password>, B<--prompt-root-shell> in combination\&.
de: Fragt nach der Locale, Tastenzuordnung, Zeitzone, dem Rechnernamen und dem root-Passwort\&. Dies ist äquivalent zur Angabe der Kombination von B<--prompt-locale>, B<--prompt-keymap>, B<--prompt-timezone>, B<--prompt-hostname>, B<--prompt-root-password>, B<--prompt-root-shell>\&.

source: Copy locale, keymap, time zone and root password from the host\&. This is equivalent to specifying B<--copy-locale>, B<--copy-keymap>, B<--copy-timezone>, B<--copy-root-password>, B<--copy-root-shell> in combination\&.
de: Kopiert die Locale, Tastenzuordnung, Zeitzone und das root-Passwort vom Rechner\&. Dies ist äquivalent zur Angabe der Kombination von B<--copy-locale>, B<--copy-keymap>, B<--copy-timezone>, B<--copy-root-password>, B<--copy-root-shell>\&.
