Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: Reset the "failed" state of the specified units, or if no unit name is passed, reset the state of all units\&. When a unit fails in some way (i\&.e\&. process exiting with non-zero error code, terminating abnormally or timing out), it will automatically enter the "failed" state and its exit code and status is recorded for introspection by the administrator until the service is stopped/re-started or reset with this command\&.
uk: Скинути стан «failed» («помилка») вказаних модулів або, якщо не вказано назв модулів, скинути стан для усіх модулів\&. Якщо робота модуля якимось чином завершується помилкою (тобто процес завершує роботу із ненульовим кодом помилки, нештатно перериває роботу або перевищує час очікування на дані), його автоматично буде переведено у стан «failed», а його код виходу та стан буде записано для вивчення адміністратором, аж доки службу не буде зупинено і повторно запущено або скинуто за допомогою цієї команди\&.

source: In addition to resetting the "failed" state of a unit it also resets various other per-unit properties: the start rate limit counter of all unit types is reset to zero, as is the restart counter of service units\&. Thus, if a unit\*(Aqs start limit (as configured with I<StartLimitIntervalSec=>/I<StartLimitBurst=>) is hit and the unit refuses to be started again, use this command to make it startable again\&.
uk: На додачу до скидання стану «failed» модуля команда також скидає різноманітні інші властивості для окремого модуля: обмежувальний лічильник запуску для модулів усіх типів буде скинуто до нуля, як і лічильник перезапуску модулів служб\&. Таким чином, якщо досягнуто обмеження на запуск модуля (як його налаштовано за допомогою I<StartLimitIntervalSec=>/I<StartLimitBurst=>), і модуль не вдається запустити знову, скористайтеся цією командою, щоб зробити модуль знову придатним до запуску\&.

source: Unit File Commands
uk: Команди файла модуля

source: B<list-unit-files> [I<PATTERN\&...>]
uk: B<list-unit-files> [I<ВЗІРЕЦЬ\&...>]

source: List unit files installed on the system, in combination with their enablement state (as reported by B<is-enabled>)\&. If one or more I<PATTERN>s are specified, only unit files whose name matches one of them are shown (patterns matching unit file system paths are not supported)\&.
uk: Вивести список файлів, які встановлено у системі, у поєднанні із даними щодо їхньої увімкненості (як про це повідомляє команда B<is-enabled>)\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде показано лише файли модулів, які відповідають одному з взірців (підтримки встановлення відповідності за шляхами у файловій системі взірцям не передбачено)\&.

source: Unlike B<list-units> this command will list template units in addition to explicitly instantiated units\&.
uk: На відміну від B<list-units>, ця команда виводить список шаблонів модулів, окрім модулів із явними екземплярами\&.

source: B<enable >I<UNIT>B<\&...>, B<enable >I<PATH>B<\&...>
uk: B<enable >I<МОДУЛЬ>B<\&...>, B<enable >I<ШЛЯХ>B<\&...>

source: Enable one or more units or unit instances\&. This will create a set of symlinks, as encoded in the [Install] sections of the indicated unit files\&. After the symlinks have been created, the system manager configuration is reloaded (in a way equivalent to B<daemon-reload>), in order to ensure the changes are taken into account immediately\&. Note that this does I<not> have the effect of also starting any of the units being enabled\&. If this is desired, combine this command with the B<--now> switch, or invoke B<start> with appropriate arguments later\&. Note that in case of unit instance enablement (i\&.e\&. enablement of units of the form foo@bar\&.service), symlinks named the same as instances are created in the unit configuration directory, however they point to the single template unit file they are instantiated from\&.
uk: Увімкнути один або декілька модулів або екземплярів модулів\&. У результаті буде створено набір символічних посилань у кодуванні розділів [Install] вказаних файлів модулів\&. Після створення символічних посилань налаштування засобу керування системою буде перезавантажено (у еквівалентний до B<daemon-reload> спосіб) з метою забезпечення негайного врахування змін\&. Зауважте, що це I<не> означатиме запуску будь-яких модулів, які вмикаються\&. Якщо слід запустити якісь модулі, поєднайте цю команду із перемикачем B<--now> або потім віддайте команду B<start> із відповідними аргументами\&. Зауважте, що у випадку вмикання екземплярів модулів (тобто вмикання модулів у формі щось@десь\&.service) буде створено символічні посилання із назвами, які збігаються зі назвами екземплярів, у каталозі налаштувань модулів, втім, ці посилання вказуватимуть на єдиний файл шаблонів модуля, з якого було створено екземпляр\&.

source: This command expects either valid unit names (in which case various unit file directories are automatically searched for unit files with appropriate names), or absolute paths to unit files (in which case these files are read directly)\&. If a specified unit file is located outside of the usual unit file directories, an additional symlink is created, linking it into the unit configuration path, thus ensuring it is found when requested by commands such as B<start>\&. The file system where the linked unit files are located must be accessible when systemd is started (e\&.g\&. anything underneath /home/ or /var/ is not allowed, unless those directories are located on the root file system)\&.
uk: Цій команді слід передавати або коректні назви модулів (у цьому випадку буде виконано пошук файлів модулів із відповідними назвами у різноманітних каталогах файлів модулів), або абсолютні шляхи до файлів модулів (у цьому випадку файли буде прочитано безпосередньо)\&. Якщо вказаний файл модуля розташовано поза звичайними каталогами файлів модулів, буде створено додаткове символічне посилання, які пов'язуватиме його із каталогом налаштувань модулів, а отже, забезпечуватиме можливість знайти його у відповідь на запит команд, подібних до B<start>\&. Файлова система, де зберігаються пов'язані файли модулів, має бути доступною на момент запуску systemd (наприклад, не можна зберігати такі файли у /home/ або /var/, якщо цих каталогів немає у кореневій файловій системі)\&.

source: This command will print the file system operations executed\&. This output may be suppressed by passing B<--quiet>\&.
uk: Ця команда виводить список виконаних із файловою системою дій\&. Виведення даних можна придушити за допомогою параметра B<--quiet>\&.

source: Note that this operation creates only the symlinks suggested in the [Install] section of the unit files\&. While this command is the recommended way to manipulate the unit configuration directory, the administrator is free to make additional changes manually by placing or removing symlinks below this directory\&. This is particularly useful to create configurations that deviate from the suggested default installation\&. In this case, the administrator must make sure to invoke B<daemon-reload> manually as necessary, in order to ensure the changes are taken into account\&.
uk: Зауважте, що ця дія створює лише символічні посилання, які запропоновано у розділі [Install] файлів модулів\&. Хоча ця команда є рекомендованим способом керування каталогом налаштувань модулів, адміністратор може вносити додаткові зміни вручну, створюючи або вилучаючи символічні посилання у цьому каталозі\&. Такі дії можуть знадобитися для створення налаштувань, які відрізняються від пропонованих у типовому комплекті для встановлення\&. Якщо буде внесено такі зміни, адміністратор має, за потреби, викликати B<daemon-reload> вручну, щоб забезпечити врахування внесених змін\&.

source: Enabling units should not be confused with starting (activating) units, as done by the B<start> command\&. Enabling and starting units is orthogonal: units may be enabled without being started and started without being enabled\&. Enabling simply hooks the unit into various suggested places (for example, so that the unit is automatically started on boot or when a particular kind of hardware is plugged in)\&. Starting actually spawns the daemon process (in case of service units), or binds the socket (in case of socket units), and so on\&.
uk: Вмикання модулів не слід плутати із запуском (активацією) модулів, який виконує команда B<start>\&. Вмикання і запуск модулів є зовсім різними речима: модулі може бути увімкнено без запуску і запущено без вмикання\&. Вмикання лише вписує модуль у різноманітні відповідні місця (наприклад, робить так, щоб модуль автоматично запускався під час завантаження системи або з'єднання з комп'ютером певного типу обладнання)\&. Запуск ініціалізує процес фонової служби (у випадку модулів служб) або пов'язує модуль із сокетом (у випадку модулів сокетів) тощо\&.

source: Depending on whether B<--system>, B<--user>, B<--runtime>, or B<--global> is specified, this enables the unit for the system, for the calling user only, for only this boot of the system, or for all future logins of all users\&. Note that in the last case, no systemd daemon configuration is reloaded\&.
uk: Залежно від того, чи вказано B<--system>, B<--user>, B<--runtime> або B<--global>, ця команда вмикає модуль для системи, лише для користувача, який її віддав, лише на одне завантаження системи або для усіх наступних входів до системи усіх користувачів\&. Зауважте, що в останньому випадку не буде перезавантажено налаштування фонових служб systemd\&.

source: Using B<enable> on masked units is not supported and results in an error\&.
uk: Підтримки команди B<enable> для замаскованих модулів не передбачено. Якщо віддати цю команду для замаскованого модуля, буде повідомлено про помилку\&.

source: B<disable >I<UNIT>B<\&...>
uk: B<disable >I<МОДУЛЬ>B<\&...>

source: Disables one or more units\&. This removes all symlinks to the unit files backing the specified units from the unit configuration directory, and hence undoes any changes made by B<enable> or B<link>\&. Note that this removes I<all> symlinks to matching unit files, including manually created symlinks, and not just those actually created by B<enable> or B<link>\&. Note that while B<disable> undoes the effect of B<enable>, the two commands are otherwise not symmetric, as B<disable> may remove more symlinks than a prior B<enable> invocation of the same unit created\&.
uk: Вимикає один або декілька модулів\&. У результаті з каталогу налаштувань модулів буде вилучено усі символічні посилання на файли модулів, які є основою вказаних модулів, а отже, буде скасовано усі зміни, які було внесено командою B<enable> або B<link>\&. Зауважте, що це призведе до вилучення I<усіх> символічних посилань на відповідні файли модулів, зокрема створених вручну посилань, а не лише створених за допомогою B<enable> чи B<link>\&. Зауважте, що хоча B<disable> скасовує результати роботи B<enable>, ці дві команди не є симетричними, оскільки B<disable> може вилучити більше символічних посилань, ніж було створено попередньою командою B<enable>\&.

source: This command expects valid unit names only, it does not accept paths to unit files\&.
uk: Цій команді можна передавати лише назви чинних модулів, вона не приймає шляхи до файлів модулів\&.

source: In addition to the units specified as arguments, all units are disabled that are listed in the I<Also=> setting contained in the [Install] section of any of the unit files being operated on\&.
uk: Окрім модулів, які буде вказано як аргументи, буде вимкнено усі модулі зі списку у параметрі I<Also=> розділу [Install] усіх файлів модулів, з якими працюватиме програма\&.

source: This command implicitly reloads the system manager configuration after completing the operation\&. Note that this command does not implicitly stop the units that are being disabled\&. If this is desired, either combine this command with the B<--now> switch, or invoke the B<stop> command with appropriate arguments later\&.
uk: Ця команда неявним чином перезавантажує налаштування засобу керування системою після завершення виконання дії\&. Зауважте, що ця команда не виконує неявного зупинення модулів, які було вимкнено\&. Якщо потрібно зупинити роботу таких модулів, або поєднайте цю команду із перемикачем B<--now>, або потім викличте команду B<stop> із відповідними аргументами\&.

source: This command will print information about the file system operations (symlink removals) executed\&. This output may be suppressed by passing B<--quiet>\&.
uk: Ця команда виводить відомості щодо виконаних із файловою системою дій (вилучення символічних посилань)\&. Виведення даних можна придушити за допомогою параметра B<--quiet>\&.

source: This command honors B<--system>, B<--user>, B<--runtime> and B<--global> in a similar way as B<enable>\&.
uk: Ця команда враховує B<--system>, B<--user>, B<--runtime> і B<--global> у спосіб, подібний до B<enable>\&.

source: B<reenable >I<UNIT>B<\&...>
uk: B<reenable >I<МОДУЛЬ>B<\&...>

source: Reenable one or more units, as specified on the command line\&. This is a combination of B<disable> and B<enable> and is useful to reset the symlinks a unit file is enabled with to the defaults configured in its [Install] section\&. This command expects a unit name only, it does not accept paths to unit files\&.
uk: Повторно увімкнути один або декілька модулів, як вказано у рядку команди\&. Це поєднання послідовних B<disable> і B<enable>. Корисне для скидання символічних посилань на момент вмикання файла модуля до типових налаштувань, які вказано у розділі [Install]\&. Цій команді можна передавати лише назву модуля, вона не приймає шляхів до файла модуля\&.

source: B<preset >I<UNIT>B<\&...>
uk: B<preset >I<МОДУЛЬ>B<\&...>

source: Reset the enable/disable status one or more unit files, as specified on the command line, to the defaults configured in the preset policy files\&. This has the same effect as B<disable> or B<enable>, depending how the unit is listed in the preset files\&.
uk: Скинути стан вмикання-вимикання одного або декількох файлів модулів, які вказано у рядку команди, до типових значень, які зазначено у файлах наборів правил модулів\&. Результат буде той самий, що і у команд B<disable> або B<enable>, залежно від того, що вказано для модуля у файлах наборів налаштувань\&.

source: Use B<--preset-mode=> to control whether units shall be enabled and disabled, or only enabled, or only disabled\&.
uk: Скористайтеся параметром B<--preset-mode=> для керування тим, має бути модулі увімкнено і вимкнено, лише вимкнено чи лише вимкнено\&.

source: If the unit carries no install information, it will be silently ignored by this command\&. I<UNIT> must be the real unit name, any alias names are ignored silently\&.
uk: Якщо у модулі не вказано даних щодо встановлення, його буде без попереджень проігноровано під час виконання цієї команди\&. Значенням аргументу I<МОДУЛЬ> має бути дійсна назва модуля, усі альтернативні назви буде без попереджень проігноровано\&.

source: For more information on the preset policy format, see B<systemd.preset>(5)\&.
uk: Щоб дізнатися більше про формат правил набору налаштувань, ознайомтеся зі сторінкою підручника щодо B<systemd.preset>(5)\&.

source: Resets all installed unit files to the defaults configured in the preset policy file (see above)\&.
uk: Скидає усі встановлені файли модулів до типових параметрів, які налаштовано у файлі правил набору налаштувань (див. вище)\&.

source: B<is-enabled >I<UNIT>B<\&...>
uk: B<is-enabled >I<МОДУЛЬ>B<\&...>

source: Checks whether any of the specified unit files are enabled (as with B<enable>)\&. Returns an exit code of 0 if at least one is enabled, non-zero otherwise\&. Prints the current enable status (see table)\&. To suppress this output, use B<--quiet>\&. To show installation targets, use B<--full>\&.
uk: Перевіряє, чи увімкнено якийсь із вказаних файлів модулів (як за допомогою команди B<enable>)\&. Повертає стан виходу 0, якщо увімкнено принаймні один модуль, і ненульовий стан, якщо це не так\&. Виводить поточний стан вмикання (див. таблицю)\&. Щоб придушити виведення даних, скористайтеся параметром B<--quiet>\&. Щоб було виведено цілі встановлення, скористайтеся параметром B<--full>\&.

source: B<Table\ \&1.\ \& is-enabled output>
uk: B<Таблиця\ \&1.\ \& Виведення is-enabled>

source: Name
uk: Назва

source: Description
uk: Опис

source: Exit Code
uk: Код виходу

source: enabled
uk: увімкнено

source: Enabled via \&.wants/, \&.requires/ or I<Alias=> symlinks (permanently in /etc/systemd/system/, or transiently in /run/systemd/system/)\&.
uk: Увімкнено за допомогою символічних посилань \&.wants/, \&.requires/ або I<Alias=> (остаточно в /etc/systemd/system/ або тимчасово у /run/systemd/system/)\&.

source: enabled-runtime
uk: увімкнено-робота

source: linked
uk: пов'язано

source: Made available through one or more symlinks to the unit file (permanently in /etc/systemd/system/ or transiently in /run/systemd/system/), even though the unit file might reside outside of the unit file search path\&.
uk: Стає доступним через одне або декілька символічних посилань на файл модуля (остаточно в /etc/systemd/system/ або тимчасово у /run/systemd/system/), навіть якщо файл модуля може зберігатися поза шляхом пошуку файлів модулів\&.

source: The name is an alias (symlink to another unit file)\&.
uk: Назва альтернативи (символічного посилання на файл іншого модуля)\&.

source: Completely disabled, so that any start operation on it fails (permanently in /etc/systemd/system/ or transiently in /run/systemd/systemd/)\&.
uk: Повністю вимкнено так, що будь-яка дія із запуску завершиться помилкою (остаточно в /etc/systemd/system/ або тимчасово у /run/systemd/systemd/)\&.

source: The unit file is not enabled, and has no provisions for enabling in the [Install] unit file section\&.
uk: Файл модуля не увімкнено і немає умов для вмикання його у розділі [Install] файла модуля\&.

source: The unit file itself is not enabled, but it has a non-empty I<Also=> setting in the [Install] unit file section, listing other unit files that might be enabled, or it has an alias under a different name through a symlink that is not specified in I<Also=>\&. For template unit files, an instance different than the one specified in I<DefaultInstance=> is enabled\&.
uk: Сам файл модуля не увімкнено, але він містить непорожній запис I<Also=> у розділі [Install] файла модуля, де вказано список інших файлів модулів, які може бути увімкнено, або у нього є альтернатива на основі символічного посилання із іншою назвою, яку не вказано у I<Also=>\&. Для файлів шаблонів модулів буде увімкнено екземпляр, відмінний від того, який вказано у I<DefaultInstance=> is enabled\&.

source: The unit file is not enabled, but contains an [Install] section with installation instructions\&.
uk: Файл модуля не увімкнено, але у ньому міститься розділ [Install] із настановами щодо встановлення\&.

source: The unit file was generated dynamically via a generator tool\&. See B<systemd.generator>(7)\&. Generated unit files may not be enabled, they are enabled implicitly by their generator\&.
uk: Файл модуля було створено динамічно за допомогою інструмента створення файлів\&. Див. B<systemd.generator>(7)\&. Створені файли модулів не може бути увімкнено, їх неявним чином вмикає їхній засіб породження\&.

source: The unit file has been created dynamically with the runtime API\&. Transient units may not be enabled\&.
uk: Файл модуля було створено динамічно за допомогою програмного інтерфейсу середовища виконання\&. Тимчасові модулі не можна вмикати\&.

source: The unit file is invalid or another error occurred\&. Note that B<is-enabled> will not actually return this state, but print an error message instead\&. However the unit file listing printed by B<list-unit-files> might show it\&.
uk: Файл модуля є некоректним або сталася якась інша помилка\&. Зауважте, що B<is-enabled> насправді не повертатиме цього стану, а просто виведе повідомлення про помилку\&. Втім, його може бути виведено у списку файлів модулів, які програма виводить, якщо використано B<list-unit-files>\&.

source: B<mask >I<UNIT>B<\&...>
uk: B<mask >I<МОДУЛЬ>B<\&...>

source: Mask one or more units, as specified on the command line\&. This will link these unit files to /dev/null, making it impossible to start them\&. This is a stronger version of B<disable>, since it prohibits all kinds of activation of the unit, including enablement and manual activation\&. Use this option with care\&. This honors the B<--runtime> option to only mask temporarily until the next reboot of the system\&. The B<--now> option may be used to ensure that the units are also stopped\&. This command expects valid unit names only, it does not accept unit file paths\&.
uk: Замаскувати один або декілька модулів, як вказано у рядку команди\&. Це пов'яже файли модулів із /dev/null, унеможлививши їх запуск\&. Це потужніша версія B<disable>, оскільки вона забороняє будь-який тип активації модуля, включно із вмиканням та активацією вручну\&. Будьте обережні із цим параметром\&. При цьому враховується параметр B<--runtime> для тимчасового маскування, аж до наступного перезавантаження системи\&. Можна скористатися параметром B<--now> для забезпечення паралельної зупинки модулів\&. Цій команді можна передавати лише назви модулів, вона не приймає шляхів до файлів модулів\&.

source: B<unmask >I<UNIT>B<\&...>
uk: B<unmask >I<МОДУЛЬ>B<\&...>

source: Unmask one or more unit files, as specified on the command line\&. This will undo the effect of B<mask>\&. This command expects valid unit names only, it does not accept unit file paths\&.
uk: Скасувати маскування одного або декількох файлів модулів, як їх вказано у рядку команди\&. Скасовує результат застосування B<mask>\&. Цій команді можна передавати лише назви модулів, вона не приймає шляхів до файлів модулів\&.

source: B<link >I<PATH>B<\&...>
uk: B<link >I<ШЛЯХ>B<\&...>

source: Link a unit file that is not in the unit file search paths into the unit file search path\&. This command expects an absolute path to a unit file\&. The effect of this may be undone with B<disable>\&. The effect of this command is that a unit file is made available for commands such as B<start>, even though it is not installed directly in the unit search path\&. The file system where the linked unit files are located must be accessible when systemd is started (e\&.g\&. anything underneath /home/ or /var/ is not allowed, unless those directories are located on the root file system)\&.
uk: Створити посилання на файл модуля, який зберігається поза шляхами пошуку файлів модулів, до шляху пошуку файлів модулів\&. Цій команді має бути передано абсолютний шлях до файла модуля\&. Результат виконання команди можна скасувати за допомогою B<disable>\&. Результатом виконання команди є те, що файл модуля стане доступним для команд, подібних до as B<start>, хоча сам файл не встановлено безпосередньо до шляху пошуку модулів\&. Файлова система, де зберігаються пов'язані файли модулів, має бути доступною на момент запуску systemd (наприклад, не можна зберігати такі файли у /home/ або /var/, якщо цих каталогів немає у кореневій файловій системі)\&.

source: B<revert >I<UNIT>B<\&...>
uk: B<revert >I<МОДУЛЬ>B<\&...>
