Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: In B<pipe> mode, /dev/console will not exist in the container\&. This means that the container payload generally cannot be a full init system as init systems tend to require /dev/console to be available\&. On the other hand, in this mode container invocations can be used within shell pipelines\&. This is because intermediary pseudo TTYs do not permit independent bidirectional propagation of the end-of-file (EOF) condition, which is necessary for shell pipelines to work correctly\&. I<Note that the >B<pipe>I< mode should be used carefully>, as passing arbitrary file descriptors to less trusted container payloads might open up unwanted interfaces for access by the container payload\&. For example, if a passed file descriptor refers to a TTY of some form, APIs such as B<TIOCSTI> may be used to synthesize input that might be used for escaping the container\&. Hence B<pipe> mode should only be used if the payload is sufficiently trusted or when the standard input/output/error output file descriptors are known safe, for example pipes\&.
de: Im Modus B<pipe> existiert /dev/console im Container nicht\&. Das bedeutet, dass der Container-Inhalt im Allgemeinen kein vollständiges Init-System sein kann, da Init-Systeme dazu neigen, /dev/console zu benötigen\&. Auf der anderen Seite können in diesem Modus Container-Aufrufe innerhalb von Shell-Weiterleitungen verwandt werden\&. Dies liegt daran, dass zwischengeschaltete Pseudo-TTYs keine unabhängige, bidirektionale Weiterleitung der Dateiendebedingung (EOF) erlauben, was allerdings für den korrekten Betrieb von Shell-Weiterleitungen benötigt wird\&. I<Beachten Sie, dass der Modus >B<pipe>I< vorsichtig verwandt werden sollte>, da die Übergabe beliebiger Dateideskriptoren an weniger vertrauenswürdige Container-Inhalte unerwünschte Schnittstellen für Zugriffe des Container-Inhaltes öffnen könnten\&. Falls sich ein übergebener Dateideskriptor beispielsweise auf ein TTY in irgendeiner Weise bezieht, können APIs wie B<TIOCSTI> dazu verwandt werden, Eingaben künstlich zu erzeugen, die zum Ausbruch aus dem Container verwandt werden können\&. Daher sollte der Modus B<pipe> nur verwandt werden, wenn dem Inhalt hinreichend vertraut wird oder wenn die Dateideskriptoren der Standardeingabe, -ausgabe und Fehlerausgabe bekanntermaßen sicher sind, zum Beispiel Pipes\&.

source: Equivalent to B<--console=pipe>\&.
de: Äquivalent zu B<--console=pipe>\&.

source: Credentials
de: Zugangsdaten

source: B<--load-credential=>I<ID>:I<PATH>, B<--set-credential=>I<ID>:I<VALUE>
de: B<--load-credential=>I<KENNUNG>:I<PFAD>, B<--set-credential=>I<KENNUNG>:I<WERTE>

source: Pass a credential to the container\&. These two options correspond to the I<LoadCredential=> and I<SetCredential=> settings in unit files\&. See B<systemd.exec>(5) for details about these concepts, as well as the syntax of the option\*(Aqs arguments\&.
de: Gibt ein Zugangsdatum an den Container weiter\&. Diese zwei Optionen entsprechen den Einstellungen I<LoadCredential=> und I<SetCredential=> in Unit-Dateien\&. Siehe B<systemd.exec>(5) für Details über diese Konzepte, sowie die Syntax der Argumente der Option\&.

source: Note: when B<systemd-nspawn> runs as systemd system service it can propagate the credentials it received via I<LoadCredential=>/I<SetCredential=> to the container payload\&. A systemd service manager running as PID 1 in the container can further propagate them to the services it itself starts\&. It is thus possible to easily propagate credentials from a parent service manager to a container manager service and from there into its payload\&. This can even be done recursively\&.
de: Beachten Sie: Wenn B<systemd-nspawn> als Systemd-Systemdienst ausgeführt wird, kann es die mittels I<LoadCredential=>/I<SetCredential=> empfangenen Zugangsdaten an den Nutzinhalt des Containers weiterleiten\&. Ein Systemd-Diensteverwalter, der als PID 1 im Container ausgeführt wird, kann sie noch weiter zu den Diensten, die er selber startet, weiterleiten\&. Es ist daher möglich, Zugangsdaten leicht vom übergeordneten Diensteverwalter zu einem Container-Verwalterdienst und von dort in seine Nutzlast weiterzuleiten\&. Das kann sogar rekursiv erfolgen\&.

source: In order to embed binary data into the credential data for B<--set-credential=> use C-style escaping (i\&.e\&. "\en" to embed a newline, or "\ex00" to embed a B<NUL> byte\&. Note that the invoking shell might already apply unescaping once, hence this might require double escaping!)\&.
de: Um Binärdaten in die Zugangsdaten für B<--set-credential=> einzubetten, verwenden Sie C-artige Maskierung (d\&.h\&. »\en«, um einen Zeilenumbruch einzubetten oder »\ex00«, um ein B<NUL>-Byte einzubetten\&. Beachten Sie, dass die aufrufende Shell die Maskierung bereits einmal entfernt haben könnte, daher könnte dieses doppelte Maskierung benötigen!)\&.

source: The B<systemd-sysusers.service>(8) and B<systemd-firstboot>(1) services read credentials configured this way for the purpose of configuring the container\*(Aqs root user\*(Aqs password and shell, as well as system locale, keymap and timezone during the first boot process of the container\&. This is particularly useful in combination with B<--volatile=yes> where every single boot appears as first boot, since configuration applied to /etc/ is lost on container reboot cycles\&. See the respective man pages for details\&. Example:
de: Die Dienste B<systemd-sysusers.service>(8) und B<systemd-firstboot>(1) lesen die auf diese Art konfigurierten Anmeldedaten zum Zweck der Konfiguration des Passworts und der Shell des Benutzers root des Containers, sowie der Locale, der Tastaturzuordnung und der Zeitzone des Systems während des ersten Systemstartprozesses des Containers\&. Dies ist insbesondere in Kombination mit B<--volatile=yes> nützlich, wo jeder einzelne Systemstart wie der erste Systemstart aussieht, da die in /etc/ angewandte Konfiguration verloren geht, wenn der Container einen Neustart durchführt\&. Siehe die entsprechenden Handbuchseiten für Details\&. Beispiel:

source: The above command line will invoke the specified image file image\&.raw in volatile mode, i\&.e\&. with empty /etc/ and /var/\&. The container payload will recognize this as a first boot, and will invoke systemd-firstboot\&.service, which then reads the two passed credentials to configure the system\*(Aqs initial locale and root password\&.
de: Der obige Befehl wird die angegebene Abbilddatei image\&.raw im flüchtigen Modus aufrufen, d\&.h\&. mit leerem /etc/ und /var/\&. Die Nutzlast des Containers wird dies als ersten Systemstart erkennen und den Dienst systemd-firstboot\&.service startet, der dann die zwei übergebenen Anmeldedaten einliest, um die anfängliche Locale und das Passwort von Root des Systems zu konfigurieren\&.

source: Other
de: Weitere

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The maximum log level of emitted messages (messages with a higher log level, i\&.e\&. less important ones, will be suppressed)\&. Either one of (in order of decreasing importance) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, or an integer in the range 0\&...7\&. See B<syslog>(3) for more information\&.
de: Die maximale Protokollierstufe ausgesandter Nachrichten (Nachrichten mit einer höheren Protokollierstufe, d\&.h\&. weniger wichtige, werden unterdrückt)\&. Sie muss (in absteigender Reihenfolge) entweder B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug> oder eine Ganzzahl im Bereich 0…7 sein\&. Siehe B<syslog>(3) für weitere Informationen\&.

source: A boolean\&. If true, messages written to the tty will be colored according to priority\&.
de: Ein logischer Wert\&. Falls wahr, werden auf das TTY geschriebene Nachrichten gemäß ihrer Priorität eingefärbt\&.

source: This setting is only useful when messages are written directly to the terminal, because B<journalctl>(1) and other tools that display logs will color messages based on the log level on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Nachrichten gemäß ihrer Protokollierungsstufe einfärben\&.

source: A boolean\&. If true, console log messages will be prefixed with a timestamp\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten der Konsole ein Zeitstempel vorangestellt\&.

source: This setting is only useful when messages are written directly to the terminal or a file, because B<journalctl>(1) and other tools that display logs will attach timestamps based on the entry metadata on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal oder in eine Datei geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Zeitstempel basierend auf ihren Metadaten den Nachrichten anhängen werden\&.

source: A boolean\&. If true, messages will be prefixed with a filename and line number in the source code where the message originates\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten ein Dateinamen und eine Zeilenummer in dem Quellcode, aus dem die Nachrichten stammen, vorangestellt\&.

source: Note that the log location is often attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass der Protokollierort sowieso oft als Metadaten zu den Journal-Einträgen angehängt ist\&. Die Aufnahme in den Nachrichtentext kann bei der Fehlersuche in Programmen dennoch praktisch sein\&.

source: A boolean\&. If true, messages will be prefixed with the current numerical thread ID (TID)\&.
de: Ein logischer Wert\&. Falls wahr, wird den Nachrichten die aktuelle numerische Thread-Kennung (TID) vorangestellt\&.

source: Note that the this information is attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass diese Informationen sowieso als Metadatan an Journal-Einträge angehängt wird\&. Die Aufnahme direkt im Nachrichtentext kann aber trotzdem bei der Fehlersuche in Programmen praktisch sein\&.

source: The destination for log messages\&. One of B<console> (log to the attached tty), B<console-prefixed> (log to the attached tty but with prefixes encoding the log level and "facility", see B<syslog>(3), B<kmsg> (log to the kernel circular log buffer), B<journal> (log to the journal), B<journal-or-kmsg> (log to the journal if available, and to kmsg otherwise), B<auto> (determine the appropriate log target automatically, the default), B<null> (disable log output)\&.
de: Das Ziel für Protokolliernachrichten\&. Entweder B<console> (auf das angehängte TTY protokollieren), B<console-prefixed> (auf das angehängte TTY protokollieren, aber die Protokollierstufe und »Einrichtung« voranstellen, siehe B<syslog>(3)), B<kmsg> (in den zirkulären Kernel-Protokollpuffer protokollieren), B<journal> (in das Journal protokollieren (B<journal-or-kmsg> (in das Journal protokollieren, falls verfügbar, und andernfalls nach Kmsg), B<auto> (das geeignete Protokollierziel automatisch ermitteln, die Vorgabe) oder B<null> (die Protokollierung deaktivieren)\&.

source: Pager to use when B<--no-pager> is not given; overrides I<$PAGER>\&. If neither I<$SYSTEMD_PAGER> nor I<$PAGER> are set, a set of well-known pager implementations are tried in turn, including B<less>(1) and B<more>(1), until one is found\&. If no pager implementation is discovered no pager is invoked\&. Setting this environment variable to an empty string or the value "cat" is equivalent to passing B<--no-pager>\&.
de: Zu verwendendes Textanzeigeprogramm, wenn B<--no-pager> nicht angegeben ist; setzt I<$PAGER> außer Kraft\&. Falls weder I<$SYSTEMD_PAGER> noch I<$PAGER> gesetzt sind, wird eine Reihe wohlbekannter Textanzeigeprogrammimplementierungen der Reihe nach ausprobiert, einschließlich B<less>(1) und B<more>(1), bis eines gefunden wird\&. Falls keine Textanzeigeprogrammimplementierung gefunden wird, wird keines aufgerufen\&. Setzen der Umgebungsvariablen auf die leere Zeichenkette oder den Wert »cat« ist äquivalent zur Übergabe von B<--no-pager>\&.

source: Note: if I<$SYSTEMD_PAGERSECURE> is not set, I<$SYSTEMD_PAGER> (as well as I<$PAGER>) will be silently ignored\&.
de: Beachten Sie: Falls I<$SYSTEMD_PAGERSECURE> nicht gesetzt ist, dann wird I<$SYSTEMD_PAGER> (sowie I<$PAGER>) ohne Rückmeldung ignoriert\&.

source: Override the options passed to B<less> (by default "FRSXMK")\&.
de: Setzt die an B<less> übergebenen Optionen (standardmäßig »FRSXMK«) außer Kraft\&.

source: Users might want to change two options in particular:
de: Benutzer könnten insbesondere zwei Optionen ändern wollen:

source: This option instructs the pager to exit immediately when Ctrl+C is pressed\&. To allow B<less> to handle Ctrl+C itself to switch back to the pager command prompt, unset this option\&.
de: Diese Option weist das Textanzeigeprogramm an, sich sofort beim Druck von Strg-C zu beenden\&. Um B<less> die Handhabung von Strg-C selbst zum Umschalten auf die Eingabeaufforderung zu erlauben, setzen Sie diese Option zurück\&.

source: If the value of I<$SYSTEMD_LESS> does not include "K", and the pager that is invoked is B<less>, Ctrl+C will be ignored by the executable, and needs to be handled by the pager\&.
de: Falls der Wert von I<$SYSTEMD_LESS> kein »K« enthält und B<less> das aufgerufene Textanzeigeprogramm ist, wird Strg+C durch das Programm ignoriert und muss durch das Textanzeigeprogramm selbst gehandhabt werden\&.

source: This option instructs the pager to not send termcap initialization and deinitialization strings to the terminal\&. It is set by default to allow command output to remain visible in the terminal even after the pager exits\&. Nevertheless, this prevents some pager functionality from working, in particular paged output cannot be scrolled with the mouse\&.
de: Diese Option weist das Textanzeigeprogramm an, keine Termcap-Initialisierungs- und -Deinitalisierungszeichenketten an das Terminal zu senden\&. Dies ist standardmäßig gesetzt, damit die Darstellung von Befehlen selbst nach dem Beenden des Textanzeigeprogramms sichtbar bleibt\&. Allerdings stehen dadurch einige Funktionen des Textanzeigeprogramms nicht zur Verfügung; insbesondere ist das Scrollen in der Ausgabe mit der Maus nicht möglich\&.

source: See B<less>(1) for more discussion\&.
de: Siehe B<less>(1) für weitere Ausführungen\&.

source: Override the charset passed to B<less> (by default "utf-8", if the invoking terminal is determined to be UTF-8 compatible)\&.
de: Setzt den an B<less> zu übergebenden Zeichensatz (standardmäßig »utf-8«, falls das aufrufende Terminal als UTF-8-kompatibel erkannt wurde) außer Kraft\&.

source: Takes a boolean argument\&. When true, the "secure" mode of the pager is enabled; if false, disabled\&. If I<$SYSTEMD_PAGERSECURE> is not set at all, secure mode is enabled if the effective UID is not the same as the owner of the login session, see B<geteuid>(2) and B<sd_pid_get_owner_uid>(3)\&. In secure mode, B<LESSSECURE=1> will be set when invoking the pager, and the pager shall disable commands that open or create new files or start new subprocesses\&. When I<$SYSTEMD_PAGERSECURE> is not set at all, pagers which are not known to implement secure mode will not be used\&. (Currently only B<less>(1) implements secure mode\&.)
de: Akzeptiert einen logischen Wert\&. Wenn wahr, wird der »sichere« Modus des Seitenanzeigeprogramms verwandt, falls falsch, wird dieser deaktiviert\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, dann wird der sichere Modus aktiviert, falls die effektive Kennung nicht identisch zu dem Eigentümer der Anmeldesitzung ist, siehe B<geteuid>(2) und B<sd_pid_get_owner_uid>(3)\&. Im sicheren Modus wird B<LESSSECURE=1> beim Aufruf des Seitenanzeigeprogramms gesetzt und das Seitenanzeigeprogramm muss Befehle deaktivieren, die neue Dateien öffnen oder erstellen oder die einen neuen Unterprozess starten\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, werden Seitenanzeigeprogramme, bei denen unbekannt ist, ob sie einen sicheren Modus implementieren, nicht verwandt\&. (Derzeit implementiert nur B<less>(1) einen sicheren Modus\&.)

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completely disable the pager using B<--no-pager> instead\&.
de: Hinweis: Wenn Befehle mit erhöhten Rechten ausgeführt werden, beispielsweise mittels B<sudo>(8) oder B<pkexec>(1), muss Vorsicht walten gelassen werden, um sicherzustellen, dass keine ungeplanten interaktiven Funktionalitäten aktiviert werden\&. Der »sichere« Modus für das Seitenanzeigeprogramm kann wie oben beschrieben automatisch aktiviert werden\&. Durch Setzen von I<SYSTEMD_PAGERSECURE=0> oder durch Nichtenfernen dieser Einstellung aus der ererbten Umgebung wird es dem Benutzer ermöglicht, beliebige Befehle auszuführen\&. Beachten Sie, dass auch I<$SYSTEMD_PAGERSECURE> gesetzt werden muss, falls die Variablen I<$SYSTEMD_PAGER> oder I<$PAGER> berücksichtigt werden sollen\&. Es kann sinnvoll sein, stattdessen den Seitenanzeiger komplett mit B<--no-pager> zu deaktivieren\&.

source: Takes a boolean argument\&. When true, B<systemd> and related utilities will use colors in their output, otherwise the output will be monochrome\&. Additionally, the variable can take one of the following special values: "16", "256" to restrict the use of colors to the base 16 or 256 ANSI colors, respectively\&. This can be specified to override the automatic decision based on I<$TERM> and what the console is connected to\&.
de: Akzeptiert ein logisches Argument\&. Wenn wahr, werden B<systemd> und verwandte Hilfswerkzeuge Farben in ihrer Ausgabe verwenden, andernfalls wird die Ausgabe einfarbig sein\&. Zusätzlich kann die Variable eine der folgenden besonderen Werte annehmen: »16«, »256«, um die Verwendung von Farbe auf die grundlegenden 16 bzw. 256 ANSI-Farben zu beschränken\&. Dies kann festgelegt werden, um die auf I<$TERM> und der vorliegenden Verbindung der Konsole basierende automatische Entscheidung außer Kraft zu setzen\&.

source: The value must be a boolean\&. Controls whether clickable links should be generated in the output for terminal emulators supporting this\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and other conditions\&.
de: Dies muss ein logischer Wert sein\&. Er steuert, ob anklickbare Links für Terminal-Emulatoren, die dies unterstützen, erstellt werden sollen\&. Dies kann angegeben werden, um die Entscheidung, die B<systemd> basierend auf I<$TERM> und anderen Bedingungen trifft, außer Kraft zu setzen\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&Download a Fedora image and start a shell in it>
de: B<Beispiel\ \&1.\ \&Herunterladen eines Fedora-Abbildes und starten einer Shell darin>

source: This downloads an image using B<machinectl>(1) and opens a shell in it\&.
de: Damit wird ein Abbild mittels B<machinectl>(1) heruntergeladen und eine Shell darin geöffnet\&.

source: B<Example\ \&2.\ \&Build and boot a minimal Fedora distribution in a container>
de: B<Beispiel\ \&2.\ \&Bauen und Starten einer minimalen Fedora-Distribution in einem Container>

source: This installs a minimal Fedora distribution into the directory /var/lib/machines/f36 and then boots that OS in a namespace container\&. Because the installation is located underneath the standard /var/lib/machines/ directory, it is also possible to start the machine using B<systemd-nspawn -M f36>\&.
de: Dies installiert eine minimale Fedora-Distribution in das Verzeichnis /var/lib/machines/f36 und startet dann dies Betriebssystem in einem Namensraum-Container\&. Da sich die Installation unterhalb des Standard-/var/lib/machines/-Verzeichnisses befindet, ist es möglich, die Maschine mittels B<systemd-nspawn -M f36> zu starten\&.

source: B<Example\ \&3.\ \&Spawn a shell in a container of a minimal Debian unstable distribution>
de: B<Beispiel\ \&3.\ \&Erzeugen einer Shell in einem Container einer minimalen Debian-Unstable-Distribution>

source: This installs a minimal Debian unstable distribution into the directory ~/debian-tree/ and then spawns a shell from this image in a namespace container\&.
de: Dies installiert eine minimale Debian-Unstable-Distribution in ein Verzeichnis ~/debian-tree/ und erzeugt dann eine Shell aus diesem Abbild in einem Namensraum-Container\&.

source: B<debootstrap> supports \m[blue]B<Debian>\m[]\&\s-2\u[7]\d\s+2, \m[blue]B<Ubuntu>\m[]\&\s-2\u[8]\d\s+2, and \m[blue]B<Tanglu>\m[]\&\s-2\u[9]\d\s+2 out of the box, so the same command can be used to install any of those\&. For other distributions from the Debian family, a mirror has to be specified, see B<debootstrap>(8)\&.
de: B<debootstrap> unterstützt \m[blue]B<Debian>\m[]\&\s-2\u[7]\d\s+2, \m[blue]B<Ubuntu>\m[]\&\s-2\u[8]\d\s+2 und \m[blue]B<Tanglu>\m[]\&\s-2\u[9]\d\s+2 von Haus aus, daher kann der gleiche Befehl zur Installation von allen drei verwandt werden\&. Für andere Distributionen der Debian-Familie muss ein Spiegel angegeben werden, siehe B<debootstrap>(8)\&.

source: B<Example\ \&4.\ \&Boot a minimal Arch Linux distribution in a container>
de: B<Beispiel\ \&4.\ \&Starten einer minimalen Arch-Linux-Distribution in einem Container>

source: This installs a minimal Arch Linux distribution into the directory ~/arch-tree/ and then boots an OS in a namespace container in it\&.
de: Dies installiert eine minimale Arch-Linux-Distribution in das Verzeichnis ~/arch-tree/ und startet dann ein Betriebssystem in einem Namensraum-Container darin\&.

source: B<Example\ \&5.\ \&Install the OpenSUSE Tumbleweed rolling distribution>
de: B<Beispiel\ \&5.\ \&Installion der OpenSUSE-Tumbleweed-Rolling-Distribution>

source: B<Example\ \&6.\ \&Boot into an ephemeral snapshot of the host system>
de: B<Beispiel\ \&6.\ \&Starten eines flüchtigen Schnappschusses des Systems>

source: This runs a copy of the host system in a snapshot which is removed immediately when the container exits\&. All file system changes made during runtime will be lost on shutdown, hence\&.
de: Dies führt eine Kopie des Systems in einem Schnappschuss aus, der sofort wieder entfernt wird, wenn sich der Container beendet\&. Alle zur Laufzeit erfolgten Dateiänderungen gehen daher beim Herunterfahren verloren\&.

source: B<Example\ \&7.\ \&Run a container with SELinux sandbox security contexts>
de: B<Beispiel\ \&7.\ \&Ausführen eines Containers mit SELinux-Sandbox-Sicherheitskontext>

source: B<Example\ \&8.\ \&Run a container with an OSTree deployment>
de: B<Beispiel\ \&8.\ \&Ausführen eines Containers mit einer OSTree-Verwendung>

source: The exit code of the program executed in the container is returned\&.
de: Es wird der Exit-Code des im Container ausgeführten Programms zurückgeliefert\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN
