Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: List one or more additional capabilities to grant the container\&. Takes a comma-separated list of capability names, see B<capabilities>(7) for more information\&. Note that the following capabilities will be granted in any way: B<CAP_AUDIT_CONTROL>, B<CAP_AUDIT_WRITE>, B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, B<CAP_FSETID>, B<CAP_IPC_OWNER>, B<CAP_KILL>, B<CAP_LEASE>, B<CAP_LINUX_IMMUTABLE>, B<CAP_MKNOD>, B<CAP_NET_BIND_SERVICE>, B<CAP_NET_BROADCAST>, B<CAP_NET_RAW>, B<CAP_SETFCAP>, B<CAP_SETGID>, B<CAP_SETPCAP>, B<CAP_SETUID>, B<CAP_SYS_ADMIN>, B<CAP_SYS_BOOT>, B<CAP_SYS_CHROOT>, B<CAP_SYS_NICE>, B<CAP_SYS_PTRACE>, B<CAP_SYS_RESOURCE>, B<CAP_SYS_TTY_CONFIG>\&. Also B<CAP_NET_ADMIN> is retained if B<--private-network> is specified\&. If the special value "all" is passed, all capabilities are retained\&.
de: Listet eine oder mehrere zusätzliche Capabilities auf, die dem Container gewährt werden sollen\&. Akzeptiert eine Kommata-getrennte Liste von Capability-Namen, siehe B<capabilities>(7) für weitere Informationen\&. Beachten Sie, dass die folgenden Capabilities auf jeden Fall gewährt werden: B<CAP_AUDIT_CONTROL>, B<CAP_AUDIT_WRITE>, B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, B<CAP_FSETID>, B<CAP_IPC_OWNER>, B<CAP_KILL>, B<CAP_LEASE>, B<CAP_LINUX_IMMUTABLE>, B<CAP_MKNOD>, B<CAP_NET_BIND_SERVICE>, B<CAP_NET_BROADCAST>, B<CAP_NET_RAW>, B<CAP_SETFCAP>, B<CAP_SETGID>, B<CAP_SETPCAP>, B<CAP_SETUID>, B<CAP_SYS_ADMIN>, B<CAP_SYS_BOOT>, B<CAP_SYS_CHROOT>, B<CAP_SYS_NICE>, B<CAP_SYS_PTRACE>, B<CAP_SYS_RESOURCE>, B<CAP_SYS_TTY_CONFIG>\&. Auch wird B<CAP_NET_ADMIN> behalten, falls B<--private-network> angegeben ist\&. Falls der besondere Wert »all« übergeben wird, werden alle Capabilities behalten\&.

source: If the special value of "help" is passed, the program will print known capability names and exit\&.
de: Falls der besondere Wert »help« übergeben wird, wird das Programm die bekannten Capability-Namen ausgeben und sich beenden\&.

source: This option sets the bounding set of capabilities which also limits the ambient capabilities as given with the B<--ambient-capability=>\&.
de: Diese Option setzt die Begrenzungsmenge der Capabilities, die auch die Umgebungs-Capabilities, wie sie mit B<--ambient-capability=> übergeben werden, begrenzt\&.

source: Specify one or more additional capabilities to drop for the container\&. This allows running the container with fewer capabilities than the default (see above)\&.
de: Gibt eine oder mehrere zusätzliche Capabilities an, die für den Container entfernt werden sollen\&. Dies erlaubt den Betrieb des Containers mit weniger als den Standard-Capabilities (siehe oben)\&.

source: Specify one or more additional capabilities to pass in the inheritable and ambient set to the program started within the container\&. The value "all" is not supported for this setting\&.
de: Gibt eine oder mehrere zusätzliche Capabilities an, die an die vererbare und Umgebungsmenge von Programmen, die im Container gestartet werden, übergeben werden sollen\&. Der Wert »all« wird für diese Einstellung nicht unterstützt\&.

source: All capabilities specified here must be in the set allowed with the B<--capability=> and B<--drop-capability=> options\&. Otherwise, an error message will be shown\&.
de: Alle hier angegebenen Capabilities müssen in der mit den Optionen B<--capability=> und B<--drop-capability=> erlaubten Menge sein\&. Andernfalls wird eine Fehlermeldung angezeigt\&.

source: This option cannot be combined with the boot mode of the container (as requested via B<--boot>)\&.
de: Diese Option kann nicht mit dem Systemstartmodus des Containers (wie mit B<--boot> erbeten) kombiniert werden\&.

source: Takes a boolean argument\&. Specifies the value of the B<PR_SET_NO_NEW_PRIVS> flag for the container payload\&. Defaults to off\&. When turned on the payload code of the container cannot acquire new privileges, i\&.e\&. the "setuid" file bit as well as file system capabilities will not have an effect anymore\&. See B<prctl>(2) for details about this flag\&.
de: Akzeptiert ein logisches Argument\&. Gibt den Wert des Schalters B<PR_SET_NO_NEW_PRIVS> für den Container-Inhalt an\&. Standardmäßig »off«\&. Wenn eingeschaltet, kann der Inhaltscode des Containers keine neuen Privilegien erlangen, d\&.h\&. das Datei-Bit »setuid« und Dateisystem-Capabilities haben keine Wirkung mehr\&. Siehe B<prctl>(2) für Details über diesen Schalter\&.

source: Alter the system call filter applied to containers\&. Takes a space-separated list of system call names or group names (the latter prefixed with "@", as listed by the B<syscall-filter> command of B<systemd-analyze>(1))\&. Passed system calls will be permitted\&. The list may optionally be prefixed by "~", in which case all listed system calls are prohibited\&. If this command line option is used multiple times the configured lists are combined\&. If both a positive and a negative list (that is one system call list without and one with the "~" prefix) are configured, the negative list takes precedence over the positive list\&. Note that B<systemd-nspawn> always implements a system call allow list (as opposed to a deny list!), and this command line option hence adds or removes entries from the default allow list, depending on the "~" prefix\&. Note that the applied system call filter is also altered implicitly if additional capabilities are passed using the B<--capabilities=>\&.
de: Ändert den auf Container angewandten Systemaufruffilter\&. Akzeptiert eine Leerzeichen-getrennte Liste von Systemaufrufnamen oder -gruppennamen (Letzteren wird »@« vorangestellt, wie dies durch den Befehl B<syscall-filter> von B<systemd-analyze>(1) aufgeführt wird)\&. Der Liste kann optional »~« vorangestellt werden, wodurch alle aufgeführten Systemaufrufe verboten sind\&. Falls diese Befehlszeilenoption mehrfach verwandt wird, werden die konfigurierten Listen kombiniert\&. Falls sowohl eine positive als auch eine negative Liste (das bedeutet, eine Liste ohne und eine Liste mit vorangestelltem »~«) konfiguriert werden, hat die negative Liste Vorrang vor der positiven Liste\&. Beachten Sie, dass B<systemd-nspawn> immer eine Erlaubnisliste von Systemaufrufen implementiert (im Gegensatz zu einer Ausschlussliste), und dieser Befehl daher Einträge zu dieser Vorgabeerlaubnisliste hinzufügt oder aus ihr entfernt, abhängig, ob »~« vorangestellt ist\&. Beachten Sie, dass der angewandte Systemaufruffilter auch implizit geändert wird, falls mittels B<--capabilities=> zusätzliche Capabilities übergeben werden\&.

source: Sets the SELinux security context to be used to label processes in the container\&.
de: Setzt den für die Markierung von Prozessen in dem Container zu verwendenden Sicherheitskontext\&.

source: Sets the SELinux security context to be used to label files in the virtual API file systems in the container\&.
de: Setzt den für die Markierung von Dateien in dem virtuellen API-Dateisystem im Container zu verwendenden Sicherheitskontext\&.

source: Resource Options
de: Ressourcenoptionen

source: Sets the specified POSIX resource limit for the container payload\&. Expects an assignment of the form "I<LIMIT>=I<SOFT>:I<HARD>" or "I<LIMIT>=I<VALUE>", where I<LIMIT> should refer to a resource limit type, such as B<RLIMIT_NOFILE> or B<RLIMIT_NICE>\&. The I<SOFT> and I<HARD> fields should refer to the numeric soft and hard resource limit values\&. If the second form is used, I<VALUE> may specify a value that is used both as soft and hard limit\&. In place of a numeric value the special string "infinity" may be used to turn off resource limiting for the specific type of resource\&. This command line option may be used multiple times to control limits on multiple limit types\&. If used multiple times for the same limit type, the last use wins\&. For details about resource limits see B<setrlimit>(2)\&. By default resource limits for the container\*(Aqs init process (PID 1) are set to the same values the Linux kernel originally passed to the host init system\&. Note that some resource limits are enforced on resources counted per user, in particular B<RLIMIT_NPROC>\&. This means that unless user namespacing is deployed (i\&.e\&. B<--private-users=> is used, see above), any limits set will be applied to the resource usage of the same user on all local containers as well as the host\&. This means particular care needs to be taken with these limits as they might be triggered by possibly less trusted code\&. Example: "--rlimit=RLIMIT_NOFILE=8192:16384"\&.
de: Setzt die angegebene POSIX-Ressourcenbeschränkung für den Container-Inhalt\&. Erwartet eine Zuweisung der Form »I<BESCHRÄNKUNG>=I<WEICH>:I<HART>« oder »I<BESCHRÄNKUNG>=I<WERT>«, wobei sich I<BESCHRÄNKUNG> auf einen Ressourcenbeschränkungstyp wie B<RLIMIT_NOFILE> oder B<RLIMIT_NICE> beziehen sollte\&. Die Felder I<WEICH> und I<HART> sollten sich auf die numerischen weichen und harten Ressourcenbeschränkungswerte beziehen\&. Falls die zweite Form verwandt wird, kann I<WERT> einen Wert angeben, der sowohl als weiche als auch als harte Beschränkung verwandt wird\&. Anstelle eines numerischen Wertes kann die besondere Zeichenkette »infinity« verwandt werden, die zum Abschalten der Beschränkung für den angegebenen Ressourcentyp eingesetzt werden kann\&. Diese Befehlszeilenoption kann mehrfach verwandt werden, um die Beschränkungen für mehrere Beschränkungstypen zu steuern\&. Falls sie mehrfach für den gleichen Beschränkungstyp verwandt wird, gewinnt die letzte Verwendung\&. Für Details über Ressourcenbeschränkungen siehe B<setrlimit>(2)\&. Standardmäßig werden Ressourcenbeschränkungen für den Init-Prozess (PID 1) des Containers auf die gleichen Werte gesetzt, die der Linux-Kernel ursprünglich an das Init-System des Rechners übergeben hat\&. Beachten Sie, dass einige Ressourcenbeschränkungen benutzerbezogen erzwungen werden, insbesondere B<RLIMIT_NPROC>\&. Dies bedeutet, dass sämtliche Beschränkungen auf die Ressourcenverwendung des gleichen Benutzers auf allen lokalen Containern sowie dem Rechner angewandt werden, außer es werden Benutzer-Namensräume eingesetzt (d\&.h\&. B<--private-users=> verwandt wird, siehe oben)\&. Dies bedeutet, dass besondere Vorsicht mit diesen Beschränkungen walten gelassen werden muss, da sie von möglicherweise weniger vertrauenswürdigem Code ausgelöst werden könnten\&. Beispiel: »--rlimit=RLIMIT_NOFILE=8192:16384«\&.

source: Changes the OOM ("Out Of Memory") score adjustment value for the container payload\&. This controls /proc/self/oom_score_adj which influences the preference with which this container is terminated when memory becomes scarce\&. For details see B<proc>(5)\&. Takes an integer in the range -1000\&...1000\&.
de: Ändert den OOM (»Speichererknappheits«)-Anpassungsbewertungswert für den Container-Inhalt\&. Dies steuert /proc/self/oom_score_adj, das die Rangfolge beeinflusst, mit dem einzelne Container beendet werden, wenn der Speicher rar wird\&. Für Details siehe B<proc>(5)\&. Akzeptiert eine Ganzzahl im Bereich -1000…1000\&.

source: Controls the CPU affinity of the container payload\&. Takes a comma separated list of CPU numbers or number ranges (the latter\*(Aqs start and end value separated by dashes)\&. See B<sched_setaffinity>(2) for details\&.
de: Steuert die CPU-Affinität für den Inhalt des Containers\&. Akzeptiert eine Kommata-getrennte Liste von CPU-Nummern oder Nummern-Bereichen (bei diesen trennen Sie Start- und Endwert durch Bindestriche)\&. Siehe B<sched_setaffinity>(2) für Details\&.

source: Control the architecture ("personality") reported by B<uname>(2) in the container\&. Currently, only "x86" and "x86-64" are supported\&. This is useful when running a 32-bit container on a 64-bit host\&. If this setting is not used, the personality reported in the container is the same as the one reported on the host\&.
de: Steuert die durch B<uname>(2) im Container gemeldete Architektur (»Personalität«)\&. Derzeit werden nur »x86« und »x86-64« unterstützt\&. Dies ist zum Betrieb von 32-Bit-Containern auf 64-Bit-Rechnern nützlich\&. Falls diese Einstellung nicht verwandt wird, ist die im Container gemeldete Personalität identisch zu der auf dem Rechner gemeldeten\&.

source: Integration Options
de: Integrationsoptionen

source: Configures how /etc/resolv\&.conf inside of the container shall be handled (i\&.e\&. DNS configuration synchronization from host to container)\&. Takes one of "off", "copy-host", "copy-static", "copy-uplink", "copy-stub", "replace-host", "replace-static", "replace-uplink", "replace-stub", "bind-host", "bind-static", "bind-uplink", "bind-stub", "delete" or "auto"\&.
de: Konfiguriert, wie /etc/resolv\&.conf innerhalb des Containers gehandhabt werden soll (d\&.h\&. die DNS-Synchronisierung vom Rechner zum Container)\&. Akzeptiert entweder »off«, »copy-host«, »copy-static«, »copy-uplink«, »copy-stub«, »replace-host«, »replace-static«, »replace-uplink«, »replace-stub«, »bind-host«, »bind-static«, »bind-uplink«, »bind-stub«, »delete« oder »auto«\&.

source: If set to "off" the /etc/resolv\&.conf file in the container is left as it is included in the image, and neither modified nor bind mounted over\&.
de: Falls auf »off« gesetzt, dann wird die Datei /etc/resolv\&.conf im Container so belassen, wie sie im Abbild enthalten ist und weder verändert noch eine Bind-Einhängung darüber durchgeführt\&.

source: If set to "copy-host", the /etc/resolv\&.conf file from the host is copied into the container, unless the file exists already and is not a regular file (e\&.g\&. a symlink)\&. Similar, if "replace-host" is used the file is copied, replacing any existing inode, including symlinks\&. Similar, if "bind-host" is used, the file is bind mounted from the host into the container\&.
de: Falls auf »copy-host« gesetzt, wird die Datei /etc/resolv\&.conf vom Rechner in den Container kopiert, außer die Datei existiert bereits und ist keine reguläre Datei (z\&.B\&. ein Symlink)\&. Ähnlich wird beim Einsatz von »replace-host« die Datei kopiert und jede existierende Inode ersetzt, einschließlich Symlinks\&. Ähnlich wird beim Einsatz von »bind-host« die Datei vom Rechner in den Container Bind-eingehängt\&.

source: If set to "copy-static", "replace-static" or "bind-static" the static resolv\&.conf file supplied with B<systemd-resolved.service>(8) (specifically: /usr/lib/systemd/resolv\&.conf) is copied or bind mounted into the container\&.
de: Falls auf »copy-static«, »replace-static« oder »bind-static« gesetzt, wird die durch B<systemd-resolved.service>(8) bereitgestellte statische resolv\&.conf-Datei (konkret: /usr/lib/systemd/resolv\&.conf) in den Container kopiert oder Bind-eingehängt\&.

source: If set to "copy-uplink", "replace-uplink" or "bind-uplink" the uplink resolv\&.conf file managed by systemd-resolved\&.service (specifically: /run/systemd/resolve/resolv\&.conf) is copied or bind mounted into the container\&.
de: Falls auf »copy-uplink«, »replace-uplink« oder »bind-uplink« gesetzt, wird die durch Systemd-resolved\&.service verwaltete Uplink-resolv\&.conf-Datei (konkret: /run/systemd/resolve/resolv\&.conf) in den Container kopiert oder Bind-eingehängt\&.

source: If set to "copy-stub", "replace-stub" or "bind-stub" the stub resolv\&.conf file managed by systemd-resolved\&.service (specifically: /run/systemd/resolve/stub-resolv\&.conf) is copied or bind mounted into the container\&.
de: Falls auf »copy-stub«, »replace-stub« oder »bind-stub« gesetzt, wird die durch Systemd-resolved\&.service verwaltete Rumpf-resolv\&.conf-Datei (konkret: /run/systemd/resolve/stub-resolv\&.conf) in den Container kopiert oder Bind-eingehängt\&.

source: If set to "delete" the /etc/resolv\&.conf file in the container is deleted if it exists\&.
de: Falls auf »delete« gesetzt, wird die Datei /etc/resolv\&.conf gelöscht, falls sie existiert\&.

source: Finally, if set to "auto" the file is left as it is if private networking is turned on (see B<--private-network>)\&. Otherwise, if systemd-resolved\&.service is running its stub resolv\&.conf file is used, and if not the host\*(Aqs /etc/resolv\&.conf file\&. In the latter cases the file is copied if the image is writable, and bind mounted otherwise\&.
de: Falls schließlich auf »auto« gesetzt, wird die Datei so belassen, wie sie ist, falls privates Netzwerken aktiviert ist (siehe B<--private-network>)\&. Falls andernfalls Systemd-resolved\&.service läuft, wird dessen Rumpf-resolv\&.conf-Datei verwandt und falls nicht, die Datei /etc/resolv\&.conf des Rechners\&. In letzterem Fall wird die Datei kopiert, falls das Abbild beschreibbar ist und andernfalls Bind-eingehängt\&.

source: It\*(Aqs recommended to use "copy-\&..." or "replace-\&..." if the container shall be able to make changes to the DNS configuration on its own, deviating from the host\*(Aqs settings\&. Otherwise "bind" is preferable, as it means direct changes to /etc/resolv\&.conf in the container are not allowed, as it is a read-only bind mount (but note that if the container has enough privileges, it might simply go ahead and unmount the bind mount anyway)\&. Note that both if the file is bind mounted and if it is copied no further propagation of configuration is generally done after the one-time early initialization (this is because the file is usually updated through copying and renaming)\&. Defaults to "auto"\&.
de: Es wird empfohlen, »copy-…« oder »replace-…« zu verwenden, falls der Container in der Lage sein soll, selbst an seiner DNS-Einstellung Änderungen vorzunehmen, die sich von denen des Rechners unterscheiden\&. Andernfalls ist »bind« zu bevorzugen, da dies bedeutet, dass direkte Änderungen an /etc/resolv\&.conf im Container nicht erlaubt sind, da es eine schreibgeschützte Bind-Einhängung ist (beachten Sie aber, dass der Container einfach die Bind-Einhängung aushängen könnte, falls er über genug Privilegien verfügt)\&. Beachten Sie, dass in beiden Fällen (Bind-Einhängen und Kopieren der Datei) im Allgemeinen keine weitere Weitergabe der Konfiguration nach dieser einmaligen Initialisierung erfolgt (dies kommt daher, da die Datei normalerweise durch Kopieren und Umbenennen aktualisiert wird)\&. Standardmäßig »auto«\&.

source: Configures how /etc/localtime inside of the container (i\&.e\&. local timezone synchronization from host to container) shall be handled\&. Takes one of "off", "copy", "bind", "symlink", "delete" or "auto"\&. If set to "off" the /etc/localtime file in the container is left as it is included in the image, and neither modified nor bind mounted over\&. If set to "copy" the /etc/localtime file of the host is copied into the container\&. Similarly, if "bind" is used, the file is bind mounted from the host into the container\&. If set to "symlink", a symlink is created pointing from /etc/localtime in the container to the timezone file in the container that matches the timezone setting on the host\&. If set to "delete", the file in the container is deleted, should it exist\&. If set to "auto" and the /etc/localtime file of the host is a symlink, then "symlink" mode is used, and "copy" otherwise, except if the image is read-only in which case "bind" is used instead\&. Defaults to "auto"\&.
de: Steuert, wie mit /etc/localtime innerhalb des Containers (d\&.h\&. der Zeitsynchronisation vom Rechner zum Container) umgegangen werden soll\&. Akzeptiert entweder »off«, »copy«, »bind«, »symlink«, »delete« oder »auto«\&. Falls auf »off« gesetzt, verbleibt die Datei /etc/localtime im Container, wie sie im Abbild enthalten ist; sie wird weder verändert noch erfolgt darüber eine bind-Einhängung\&. Falls auf »copy« gesetzt, wird die Datei /etc/localtime vom Rechner in den Container kopiert\&. Ähnlich wird bei der Verwendung von »bind« die Datei vom Rechner in den Container bind-eingehängt\&. Falls auf »symlink« gesetzt, wird ein Symlink erstellt, der von /etc/localtime im Container auf die Zeitzonendatei im Container, die auf die Zeitzoneneinstellung im Rechner passt, zeigt\&. Falls auf »delete« gesetzt, wird die Datei im Container gelöscht, falls sie existiert\&. Falls auf »auto« gesetzt und die Datei /etc/localtime des Rechners ein Symlink ist, dann wird der »symlink«-Modus verwandt, ansonsten »copy«, falls das Abbild schreibbar ist und andernfalls »bind«\&. Standardmäßig »auto«\&.

source: Control whether the container\*(Aqs journal shall be made visible to the host system\&. If enabled, allows viewing the container\*(Aqs journal files from the host (but not vice versa)\&. Takes one of "no", "host", "try-host", "guest", "try-guest", "auto"\&. If "no", the journal is not linked\&. If "host", the journal files are stored on the host file system (beneath /var/log/journal/I<machine-id>) and the subdirectory is bind-mounted into the container at the same location\&. If "guest", the journal files are stored on the guest file system (beneath /var/log/journal/I<machine-id>) and the subdirectory is symlinked into the host at the same location\&. "try-host" and "try-guest" do the same but do not fail if the host does not have persistent journaling enabled\&. If "auto" (the default), and the right subdirectory of /var/log/journal exists, it will be bind mounted into the container\&. If the subdirectory does not exist, no linking is performed\&. Effectively, booting a container once with "guest" or "host" will link the journal persistently if further on the default of "auto" is used\&.
de: Steuert, ob das Journal des Containers für den Rechner sichtbar sein soll\&. Falls aktiviert, erlaubt dies das Betrachten der Journal-Dateien des Containers vom Rechner aus (aber nicht andersherum)\&. Akzeptiert entweder »no«, »host«, »try-host«, »guest«, »try-guest« oder »auto«\&. Falls »no«, wird das Journal nicht verlinkt\&. Falls »host«, werden die Journal-Dateien auf dem Dateisystem des Rechners gespeichert (unterhalb von /var/log/journal/I<Maschinenkennung>) und das Unterverzeichnis wird im Container am gleichen Ort bind-eingehängt\&. Falls »guest«, werden die Journal-Dateien im Gast-Dateisystem (unterhalb von /var/log/journal/I<Maschinenkennung>) gespeichert und das Unterverzeichnis wird im Rechner am gleichen Ort verlinkt\&. »try-host« und »try-guest« machen das gleiche, schlagen aber nicht fehl, falls der Rechner kein dauerhaftes Journal aktiviert hat\&. Falls »auto« (die Vorgabe) und das richtige Unterverzeichnis von /var/log/journal existiert, wird es in den Container bind-eingehängt\&. Falls das Unterverzeichnis nicht existiert, erfolgt keine Verlinkung\&. Effektiv führt einmaliges Starten eines Containers mit »guest« oder »host« dazu, dass das Journal dauerhaft verlinkt wird, falls zukünftig die Vorgabe »auto« verwandt wird\&.

source: Note that B<--link-journal=try-guest> is the default if the systemd-nspawn@\&.service template unit file is used\&.
de: Beachten Sie, dass B<--link-journal=try-guest> die Vorgabe ist, falls die Unit-Vorlagendatei systemd-nspawn@\&.service verwandt wird\&.

source: Equivalent to B<--link-journal=try-guest>\&.
de: Äquivalent zu B<--link-journal=try-guest>\&.

source: Mount Options
de: Einhängeoptionen
