Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: NAME
uk: НАЗВА

source: systemctl - Control the systemd system and service manager
uk: systemctl — керування системою systemd та засіб керування службами

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<systemctl> [OPTIONS...] COMMAND [UNIT...]
uk: B<systemctl> [ПАРАМЕТРИ...] КОМАНДА [МОДУЛЬ...]

source: DESCRIPTION
uk: ОПИС

source: B<systemctl> may be used to introspect and control the state of the "systemd" system and service manager\&. Please refer to B<systemd>(1) for an introduction into the basic concepts and functionality this tool manages\&.
uk: B<systemctl> можна використати для інтроспекції і керування станом «systemd» і засобом керування службами\&. Будь ласка, зверніться до B<systemd>(1), щоб ознайомитися із вступом до базових понять та функціональними можливостями, якими керує цей інструмент\&.

source: COMMANDS
uk: КОМАНДИ

source: The following commands are understood:
uk: Передбачено обробку таких команд:

source: Unit Commands (Introspection and Modification)
uk: Команди модулів (інтроспекція і модифікація)

source: B<list-units> [I<PATTERN>\&...]
uk: B<list-units> [I<ВЗІРЕЦЬ>\&...]

source: List units that B<systemd> currently has in memory\&. This includes units that are either referenced directly or through a dependency, units that are pinned by applications programmatically, or units that were active in the past and have failed\&. By default only units which are active, have pending jobs, or have failed are shown; this can be changed with option B<--all>\&. If one or more I<PATTERN>s are specified, only units matching one of them are shown\&. The units that are shown are additionally filtered by B<--type=> and B<--state=> if those options are specified\&.
uk: Виводить список модулів, які B<systemd> у поточний момент тримає у пам'яті\&. До списку буде включено модулів, на які є безпосередні посилання або посилання за залежністю, модулі, які пришпилено програмами на рівні коду, або модулів, які були активними, але виконання яких завершилося помилкою\&. Типово, буде показано лише модулі, які є активними, мають заплановані завдання, або виконання яких завершилося помилкою; змінити це можна за допомогою параметра B<--all>\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде показано лише модулі, які відповідають хоч одному з них\&. Подальше фільтрування можливе за допомогою параметрів B<--type=> і B<--state=>, якщо такі вказано\&.

source: Note that this command does not show unit templates, but only instances of unit templates\&. Units templates that aren\*(Aqt instantiated are not runnable, and will thus never show up in the output of this command\&. Specifically this means that foo@\&.service will never be shown in this list \(em unless instantiated, e\&.g\&. as foo@bar\&.service\&. Use B<list-unit-files> (see below) for listing installed unit template files\&.
uk: Зауважте, що ця команда не показує шаблонів модулів, але лише екземпляри шаблонів модулів\&. Шаблони модулів, які не матимуть екземплярів, не є придатними до запуску, отже, їх ніколи не буде показано у даних, які виведено цією командою\&. Це, зокрема, значить, що щось@\&.service ніколи не буде показано у цьому списку, якщо у нього не буде екземплярів, наприклад щось@десь\&.service\&. Скористайтеся командою B<list-unit-files> (див. нижче), щоб отримати список встановлених файлів шаблонів модулів\&.

source: Produces output similar to
uk: Виводити дані, подібні до таких:

source: LOAD = Reflects whether the unit definition was properly loaded\&. ACTIVE = The high-level unit activation state, i\&.e\&. generalization of SUB\&. SUB = The low-level unit activation state, values depend on unit type\&.
uk: LOAD = Повідомляє, чи було успішно завантажено визначення модуля\&. ACTIVE = Стан активації модуля верхнього рівня, тобто узагальнення SUB\&. SUB = Стан активації модуля нижнього рівня, значення залежать від типу модуля\&.

source: The header and the last unit of a given type are underlined if the terminal supports that\&. A colored dot is shown next to services which were masked, not found, or otherwise failed\&.
uk: Заголовок і останній модуль заданого типу буде підкреслено, якщо у терміналі передбачено підтримку цього\&. Поряд із пунктом служб, які було замасковано, які не було знайдено, та тих, які є помилковими з інших причин, буде показано кольорову крапку\&.

source: The LOAD column shows the load state, one of B<loaded>, B<not-found>, B<bad-setting>, B<error>, B<masked>\&. The ACTIVE columns shows the general unit state, one of B<active>, B<reloading>, B<inactive>, B<failed>, B<activating>, B<deactivating>\&. The SUB column shows the unit-type-specific detailed state of the unit, possible values vary by unit type\&. The list of possible LOAD, ACTIVE, and SUB states is not constant and new systemd releases may both add and remove values\&.
uk: У стовпчику LOAD буде показано стан завантаження, одне із таких значень: B<loaded>, B<not-found>, B<bad-setting>, B<error>, B<masked>\&. У стовпчиках ACTIVE буде показано загальний стан модуля, одне з таких значень: B<active>, B<reloading>, B<inactive>, B<failed>, B<activating>, B<deactivating>\&. У стовпчику SUB буде показано специфічний до типу модуля докладний стан модуля, можливі значення залежать від типу модуля\&. Список можливих станів LOAD, ACTIVE і SUB не є сталим. У нових випусках systemd може бути додано або вилучено значення\&.

source: command maybe be used to display the current set of possible values\&.
uk: командою можна скористатися для показу поточного набору можливих значень\&.

source: This is the default command\&.
uk: Це типова команда\&.

source: B<list-sockets> [I<PATTERN>\&...]
uk: B<list-sockets> [I<ВЗІРЕЦЬ>\&...]

source: List socket units currently in memory, ordered by listening address\&. If one or more I<PATTERN>s are specified, only socket units matching one of them are shown\&. Produces output similar to
uk: Вивести список модулів сокетів у пам'яті, упорядкований за адресами очікування на дані\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде показано лише модулі сокетів, які відповідають одному з цих взірців\&. Виводить дані, подібні до даних, які виводить

source: Note: because the addresses might contains spaces, this output is not suitable for programmatic consumption\&.
uk: Зауваження: через те, що в адресах можуть міститися пробіли, виведені дані можуть бути незручними для програмної обробки\&.

source: Also see B<--show-types>, B<--all>, and B<--state=>\&.
uk: Див. також B<--show-types>, B<--all> і B<--state=>\&.

source: B<list-timers> [I<PATTERN>\&...]
uk: B<list-timers> [I<ВЗІРЕЦЬ>\&...]

source: List timer units currently in memory, ordered by the time they elapse next\&. If one or more I<PATTERN>s are specified, only units matching one of them are shown\&. Produces output similar to
uk: Вивести список модулів таймерів у пам'яті, упорядкований за часом, який вони відлічили\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде показано лише модулі, які відповідають одному з цих взірців\&. Виводить дані, подібні до даних, які виводить

source: I<NEXT> shows the next time the timer will run\&.
uk: I<NEXT> показує час наступного запуску таймера\&.

source: I<LEFT> shows how long till the next time the timer runs\&.
uk: I<LEFT> показує, скільки лишилося до наступного запуску таймера\&.

source: I<LAST> shows the last time the timer ran\&.
uk: I<LAST> показує останній момент часу, коли було запущено таймер\&.

source: I<PASSED> shows how long has passed since the timer last ran\&.
uk: I<PASSED> показує, скільки часу минуло з моменту останнього запуску таймера\&.

source: I<UNIT> shows the name of the timer
uk: I<UNIT> показує назву таймера

source: I<ACTIVATES> shows the name the service the timer activates when it runs\&.
uk: I<ACTIVATES> показує назву служби, яку активує таймер, коли його запущено\&.

source: Also see B<--all> and B<--state=>\&.
uk: Див. також B<--all> і B<--state=>\&.

source: B<is-active >I<PATTERN>B<\&...>
uk: B<is-active >I<ВЗІРЕЦЬ>B<\&...>

source: Check whether any of the specified units are active (i\&.e\&. running)\&. Returns an exit code B<0> if at least one is active, or non-zero otherwise\&. Unless B<--quiet> is specified, this will also print the current unit state to standard output\&.
uk: Перевірити, чи є активним (тобто запущеним) якийсь із вказаних модулів\&. Повертає код виходу B<0>, якщо принаймні один модуль є активним, або ненульове значення в інших випадках\&. Якщо не вказано B<--quiet>, також виведе стан поточного модуля до стандартного виведення\&.

source: B<is-failed >I<PATTERN>B<\&...>
uk: B<is-failed >I<ВЗІРЕЦЬ>B<\&...>

source: Check whether any of the specified units are in a "failed" state\&. Returns an exit code B<0> if at least one has failed, non-zero otherwise\&. Unless B<--quiet> is specified, this will also print the current unit state to standard output\&.
uk: Перевірити, чи перебуває у стані помилки якийсь із вказаних модулів\&. Повертає код виходу B<0>, якщо принаймні один модуль перебуває у стані помилки, або ненульове значення в інших випадках\& Якщо не вказано B<--quiet>, також виведе стан поточного модуля до стандартного виведення\&

source: B<status> [I<PATTERN>\&...|I<PID>\&...]]
uk: B<status> [I<ВЗІРЕЦЬ>\&...|I<PID>\&...]]

source: Show terse runtime status information about one or more units, followed by most recent log data from the journal\&. If no units are specified, show system status\&. If combined with B<--all>, also show the status of all units (subject to limitations specified with B<-t>)\&. If a PID is passed, show information about the unit the process belongs to\&.
uk: Вивести короткі дані щодо стану роботи, що стосуються одного або декількох модулів, разом із найсвіжішими даними з журналу\&. Якщо модулів не вказано, вивести стан системи\&. Якщо поєднати з B<--all>, також вивести стан усіх модулів (є предметом обмежень, вказаних за допомогою B<-t>)\&. Якщо передано PID, вивести дані щодо модуля, якому належить процес\&.

source: This function is intended to generate human-readable output\&. If you are looking for computer-parsable output, use B<show> instead\&. By default, this function only shows 10 lines of output and ellipsizes lines to fit in the terminal window\&. This can be changed with B<--lines> and B<--full>, see above\&. In addition, B<journalctl --unit=>I<NAME> or B<journalctl --user-unit=>I<NAME> use a similar filter for messages and might be more convenient\&.
uk: Цю функцію призначено для створення зручних для читання даних\&. Якщо вам потрібні дані, які просто обробляти на комп'ютері, скористайтеся замість неї B<show>\&. Типово, ця функція виводить лише 10 рядків даних і обриває рядки багатокрапкою так, щоб вони вміщалися у вікно термінала\&. Змінити це можна за допомогою параметрів B<--lines> і B<--full>, див. вище\&. Крім того, B<journalctl --unit=>I<НАЗВА> або B<journalctl --user-unit=>I<НАЗВА> використовують подібне фільтрування для повідомлень, і можуть бути зручнішими\&.

source: Note that this operation only displays I<runtime> status, i\&.e\&. information about the current invocation of the unit (if it is running) or the most recent invocation (if it is not running anymore, and has not been released from memory)\&. Information about earlier invocations, invocations from previous system boots, or prior invocations that have already been released from memory may be retrieved via B<journalctl --unit=>\&.
uk: Зауважте, що у результаті цієї дії буде показано лише I<динамічний> стан, тобто дані щодо поточного виклику модуля (якщо його запущено) або найостаннішого виклику (якщо він уже не працює і його пам'ять не було звільнено)\&. Відомості щодо попередніх викликів, викликів під час попередніх запусків системи або попередніх викликів, пам'ять яких вже було звільнено, можна отримати за допомогою команди B<journalctl --unit=>\&.

source: systemd implicitly loads units as necessary, so just running the B<status> will attempt to load a file\&. The command is thus not useful for determining if something was already loaded or not\&. The units may possibly also be quickly unloaded after the operation is completed if there\*(Aqs no reason to keep it in memory thereafter\&.
uk: За потреби, systemd завантажує модулі неявним чином, тому запуск B<status> призведе до спроби завантажити файл\&. Тому ця команда не придатна для перевірки того, чи вже завантажено щось\&. Також можливий випадок, коли модулі буде швидко вивантажено одразу після завершення дії, якщо немає потреби тримати їх у пам'яті після неї\&.

source: B<Example\ \&1.\ \&Example output from systemctl status>
uk: B<Приклад\ \&1.\ \&Приклад виведення systemctl status>

source: The dot ("●") uses color on supported terminals to summarize the unit state at a glance\&. Along with its color, its shape varies according to its state: "inactive" or "maintenance" is a white circle ("○"), "active" is a green dot ("●"), "deactivating" is a white dot, "failed" or "error" is a red cross ("\(mu"), and "reloading" is a green clockwise circle arrow ("↻")\&.
uk: Для крапки («●») у терміналах із підтримкою кольорів буде використано колір для того, щоб стан модуля був помітним з першого погляду\&. Разом із кольором змінюватиметься форма, відповідно до стану: для станів «неактивний» та «супровід» буде показано біле коло («○»), для стану «активний» — зелену крапку («●»), для стану «деактивація» — білу крапку, для стану «помилка» — червоний хрестик («\(mu»), а для стану «перезавантаження» — зелену кругову стрілку за годинниковою стрілкою («↻»)\&.

source: The "Loaded:" line in the output will show "loaded" if the unit has been loaded into memory\&. Other possible values for "Loaded:" include: "error" if there was a problem loading it, "not-found" if no unit file was found for this unit, "bad-setting" if an essential unit file setting could not be parsed and "masked" if the unit file has been masked\&. Along with showing the path to the unit file, this line will also show the enablement state\&. Enabled units are included in the dependency network between units, and thus are started at boot or via some other form of activation\&. See the full table of possible enablement states \(em including the definition of "masked" \(em in the documentation for the B<is-enabled> command\&.
uk: У рядку «Loaded:» виведених даних буде показано «loaded», якщо модуль було завантажено до пам'яті\&. Іншими можливими значеннями для «Loaded:» є такі: «error», якщо виникла проблема під час завантаження; «not-found», якщо не було знайдено файл модуля; «bad-setting», якщо не вдалося обробити критичний параметр файла модуля, і «masked», якщо файл модуля було замасковано\&. Разом із показом шляху до файла модуля, у цьому рядку також буде показано стан вмикання\&. Увімкнені модулі буде включено до мережі залежностей між модулями, а тому буде запущено під час завантаження або за допомогою якихось інших форм активації\&. Із повною таблицею можливих станів вмикання, разом із визначенням терміна «masked», можна ознайомитися у документації з команди B<is-enabled>\&.

source: The "Active:" line shows active state\&. The value is usually "active" or "inactive"\&. Active could mean started, bound, plugged in, etc depending on the unit type\&. The unit could also be in process of changing states, reporting a state of "activating" or "deactivating"\&. A special "failed" state is entered when the service failed in some way, such as a crash, exiting with an error code or timing out\&. If the failed state is entered the cause will be logged for later reference\&.
uk: У рядку «Active:» буде показано стан активності\&. Значенням, зазвичай, є «active» (активний) або «inactive» (неактивний)\&. Активний стан може означати «запущено», «пов'язано», «увімкнено» тощо, залежно від типу модуля\&. Модуль може також перебувати у процесі зміни станів, повідомляючи про стан «activating» (активація) або «deactivating» (деактивація)\&. Спеціальний стан «failed» буде показано, якщо робота служби завершилася якоюсь помилкою, зокрема аварійно, у результаті виходу з кодом помилки або перевищення часу очікування\&. Якщо модуль увійде до стану помилки, причину буде записано до журналу для подальшого вивчення\&.

source: B<show> [I<PATTERN>\&...|I<JOB>\&...]
uk: B<show> [I<ВЗІРЕЦЬ>\&...|I<ЗАВДАННЯ>\&...]

source: Show properties of one or more units, jobs, or the manager itself\&. If no argument is specified, properties of the manager will be shown\&. If a unit name is specified, properties of the unit are shown, and if a job ID is specified, properties of the job are shown\&. By default, empty properties are suppressed\&. Use B<--all> to show those too\&. To select specific properties to show, use B<--property=>\&. This command is intended to be used whenever computer-parsable output is required\&. Use B<status> if you are looking for formatted human-readable output\&.
uk: Вивести властивості одного або декількох модулів, завдань або самого засобу керування\&. Якщо аргумент не вказано, буде виведено властивості засобу керування\&. Якщо вказано назву модуля, буде виведено властивості модуля, а якщо вказано ідентифікатор завдання, буде виведено властивості завдання\&. Типово, властивості із порожніми значеннями виведено не буде.\&. Скористайтеся параметром B<--all>, щоб програма вивела і ці властивості\&. Щоб вибрати для показу якісь властивості, скористайтеся параметром B<--property=>\&. Цю команду призначено для використання у випадку потреби у обробці виведених даних комп'ютером\&. Якщо вам потрібні форматовані зручні для читання виведені дані, скористайтеся командою B<status>\&.

source: Many properties shown by B<systemctl show> map directly to configuration settings of the system and service manager and its unit files\&. Note that the properties shown by the command are generally more low-level, normalized versions of the original configuration settings and expose runtime state in addition to configuration\&. For example, properties shown for service units include the service\*(Aqs current main process identifier as "MainPID" (which is runtime state), and time settings are always exposed as properties ending in the "\&...USec" suffix even if a matching configuration options end in "\&...Sec", because microseconds is the normalized time unit used internally by the system and service manager\&.
uk: Багато властивостей, значення яких виводить B<systemctl show> безпосередньо пов'язано із параметрами налаштувань системи та засобу керування службами та його файлами модулів\&. Зауважте, що властивості, які виведено цією командою, загалом, є нижчого рівня, нормалізованими версіями початкових параметрів налаштувань, і вказують на динамічний стан на додачу до налаштувань\&. Наприклад, властивості, які виведено для модулів служб, включають поточний ідентифікатор основного процесу служби як «MainPID» (динамічний стан), а параметри часу завжди виводяться як властивості із кінцевим суфіксом «\&...USec», навіть якщо відповідні параметри налаштувань мають назви, які закінчуються на «\&...Sec», оскільки мікросекунди є нормалізованою одиницею часу, яку на внутрішньому рівні використовує система на засіб керування службами\&.

source: For details about many of these properties, see the documentation of the D-Bus interface backing these properties, see B<org.freedesktop.systemd1>(5)\&.
uk: Докладніший опис багатьох цих властивостей можна знайти у документації до базового компонента цих властивостей, інтерфейсу D-Bus, див. B<org.freedesktop.systemd1>(5)\&.

source: B<cat >I<PATTERN>B<\&...>
uk: B<cat >I<ВЗІРЕЦЬ>B<\&...>

source: Show backing files of one or more units\&. Prints the "fragment" and "drop-ins" (source files) of units\&. Each file is preceded by a comment which includes the file name\&. Note that this shows the contents of the backing files on disk, which may not match the system manager\*(Aqs understanding of these units if any unit files were updated on disk and the B<daemon-reload> command wasn\*(Aqt issued since\&.
uk: Вивести базові файли одного або декількох модулів\&. Виводить «fragment» і «drop-ins» (початкові файли) модулів\&. Перед пунктом кожного файла буде виведено коментар із назвою файла\&. Зауважте, що буде виведено вміст базових файлів на диску, який може відрізнятися від даних засобу керування службами для цих модулів, якщо файли модулів було оновлено на диску, і з того часу не було віддано команду B<daemon-reload>\&.

source: B<help >I<PATTERN>B<\&...|>I<PID>B<\&...>
uk: B<help >I<ВЗІРЕЦЬ>B<\&...|>I<PID>B<\&...>

source: Show manual pages for one or more units, if available\&. If a PID is given, the manual pages for the unit the process belongs to are shown\&.
uk: Вивести сторінки підручника для одного або декількох модулів, якщо такі доступні\&. Якщо задано PID, буде показано сторінки підручника для модуля, якому належить процес\&.

source: B<list-dependencies> [I<UNIT>\&.\&.\&.]
uk: B<list-dependencies> [I<МОДУЛЬ>\&.\&.\&.]

source: Shows units required and wanted by the specified units\&. This recursively lists units following the I<Requires=>, I<Requisite=>, I<ConsistsOf=>, I<Wants=>, I<BindsTo=> dependencies\&. If no units are specified, default\&.target is implied\&.
uk: Виводить модулі, які потрібні і бажані для вказаних модулів\&. Виводить рекурсивний список модулів із наступними залежностями I<Requires=>, I<Requisite=>, I<ConsistsOf=>, I<Wants=>, I<BindsTo=>\&. Якщо модулів не вказано, буде неявно використано default\&.target\&.

source: By default, only target units are recursively expanded\&. When B<--all> is passed, all other units are recursively expanded as well\&.
uk: Типово, буде рекурсивно розгорнуто лише модулі призначення\&. Якщо буде передано параметр B<--all>, також буде рекурсивно розгорнуто усі інші модулі\&.

source: Options B<--reverse>, B<--after>, B<--before> may be used to change what types of dependencies are shown\&.
uk: Змінити типи показаних залежностей можна за допомогою параметрів B<--reverse>, B<--after>, B<--before>\&.

source: Note that this command only lists units currently loaded into memory by the service manager\&. In particular, this command is not suitable to get a comprehensive list at all reverse dependencies on a specific unit, as it won\*(Aqt list the dependencies declared by units currently not loaded\&.
uk: Зауважте, що ця команда виводить список лише тих модулів, які у поточний момент завантажено до пам'яті засобом керування службами\&. Зокрема, ця команда непридатна для отримання повного списку щодо усіх зворотних залежностей певного модуля, оскільки вона не виводить залежностей, які оголошено модулями і у поточний момент не завантажено\&.

source: B<start >I<PATTERN>B<\&...>
uk: B<start >I<ВЗІРЕЦЬ>B<\&...>

source: Start (activate) one or more units specified on the command line\&.
uk: Запустити (активувати) один або декілька модулів, які вказано у рядку команди\&.

source: Note that unit glob patterns expand to names of units currently in memory\&. Units which are not active and are not in a failed state usually are not in memory, and will not be matched by any pattern\&. In addition, in case of instantiated units, systemd is often unaware of the instance name until the instance has been started\&. Therefore, using glob patterns with B<start> has limited usefulness\&. Also, secondary alias names of units are not considered\&.
uk: Зауважте, що взірці назв модулів із символами-замінниками розгортаються до назв модулів, які зараз перебувають в оперативній пам'яті\&. Модулі, які є неактивними і не перебувають у стані помилки, зазвичай, не перебувають у пам'яті, отже, для них не буде встановлено відповідності жодному взірцю\&. Крім того, у випадку модулів із екземплярами systemd часто не знає назви екземпляра до запуску цього екземпляра\&. Отже, використання взірців із символами-замінниками у B<start> не дуже-то й корисне\&. Крім того, вторинні назви-альтернативи модулів не буде взято до уваги\&.
