Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-nspawn - Spawn a command or OS in a light-weight container
de: systemd-nspawn - Erzeugt einen Befehl oder ein Betriebssystem in einem leichtgewichtigen Container

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-nspawn> [OPTIONS...] [I<COMMAND>\ [ARGS...]]
de: B<systemd-nspawn> [OPTIONEN…] [I<BEFEHL>\ [ARG…]]

source: B<systemd-nspawn> --boot [OPTIONS...] [ARGS...]
de: B<systemd-nspawn> --boot [OPTIONEN…] [ARG…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-nspawn> may be used to run a command or OS in a light-weight namespace container\&. In many ways it is similar to B<chroot>(1), but more powerful since it fully virtualizes the file system hierarchy, as well as the process tree, the various IPC subsystems and the host and domain name\&.
de: B<systemd-nspawn> kann zur Ausführung eines Befehls oder Betriebssystems (OS) in einem leichtgewichtigen Namensraum-Container verwandt werden\&. In vielerlei Art ist es zu B<chroot>(1) ähnlich, aber leistungsfähiger, da es die Dateisystemhierarchie sowie den Prozessbaum, die verschiedenen IPC-Untersysteme und den Rechner- und Domain-Namen komplett virtualisiert\&.

source: B<systemd-nspawn> may be invoked on any directory tree containing an operating system tree, using the B<--directory=> command line option\&. By using the B<--machine=> option an OS tree is automatically searched for in a couple of locations, most importantly in /var/lib/machines/, the suggested directory to place OS container images installed on the system\&.
de: B<systemd-nspawn> kann in jedem Verzeichnisbaum, der einen Betriebssystembaum enthält, mittels der Befehlszeilenoption B<--directory=> aufgerufen werden\&. Durch Verwendung der Option B<--machine=> wird der OS-Baum automatisch nach einer Reihe von Orten durchsucht, am wichtigsten dabei ist /var/lib/machines/, das bevorzugte Verzeichnis, um auf dem System installierte OS-Container-Abbilder abzulegen\&.

source: In contrast to B<chroot>(1)\ \&B<systemd-nspawn> may be used to boot full Linux-based operating systems in a container\&.
de: Im Gegensatz zu B<chroot>(1) kann B<systemd-nspawn> zum Starten kompletter, Linux-basierter Betriebssysteme in einem Container verwandt werden\&.

source: B<systemd-nspawn> limits access to various kernel interfaces in the container to read-only, such as /sys/, /proc/sys/ or /sys/fs/selinux/\&. The host\*(Aqs network interfaces and the system clock may not be changed from within the container\&. Device nodes may not be created\&. The host system cannot be rebooted and kernel modules may not be loaded from within the container\&.
de: B<systemd-nspawn> begrenzt den Zugriff auf verschiedene Kernelschnittstellen, wie /sys/, /proc/sys/ oder /sys/fs/selinux/, im Container auf nur-lesbar\&. Die Netzwerkschnittstelle des Wirts und die Systemuhr können aus dem Container heraus nicht geändert werden\&. Geräteknoten können nicht erstellt werden\&. Das Wirtssystem kann nicht neu gestartet werden und Kernelmodule dürfen von innerhalb des Containers nicht geladen werden\&.

source: Use a tool like B<dnf>(8), B<debootstrap>(8), or B<pacman>(8) to set up an OS directory tree suitable as file system hierarchy for B<systemd-nspawn> containers\&. See the Examples section below for details on suitable invocation of these commands\&.
de: Verwenden Sie Werkzeuge wie B<dnf>(8), B<debootstrap>(8) oder B<pacman>(8), um eine geeignete OS-Verzeichnisbaumhierarchie für B<systemd-nspawn> einzurichten\&. Lesen Sie den nachfolgenden Abschnitt »Beispiele« für geeignete Aufrufe dieser Befehle\&.

source: As a safety check B<systemd-nspawn> will verify the existence of /usr/lib/os-release or /etc/os-release in the container tree before starting the container (see B<os-release>(5))\&. It might be necessary to add this file to the container tree manually if the OS of the container is too old to contain this file out-of-the-box\&.
de: Als Sicherheitsprüfung wird B<systemd-nspawn> die Existenz von /usr/lib/os-release oder /etc/os-release im Container-Baum überprüfen, bevor der Container gestartet wird (siehe B<os-release>(5))\&. Es könnte notwendig sein, diese Datei manuell zum Container-Baum hinzuzufügen, falls das OS des Containers zu alt ist, um diese Datei bereits mitgeliefert zu haben\&.

source: B<systemd-nspawn> may be invoked directly from the interactive command line or run as system service in the background\&. In this mode each container instance runs as its own service instance; a default template unit file systemd-nspawn@\&.service is provided to make this easy, taking the container name as instance identifier\&. Note that different default options apply when B<systemd-nspawn> is invoked by the template unit file than interactively on the command line\&. Most importantly the template unit file makes use of the B<--boot> which is not the default in case B<systemd-nspawn> is invoked from the interactive command line\&. Further differences with the defaults are documented along with the various supported options below\&.
de: B<systemd-nspawn> kann direkt von der interaktiven Befehlszeile aus oder als Systemdienst im Hintergrund aufgerufen werden\&. In diesem Modus betreibt jede Container-Instanz seine eigene Dienste-Instanz; eine Standard-Vorlagen-Unit-Datei systemd-nspawn@\&.service wird bereitgestellt, um dies leicht zu ermöglichen; sie akzeptiert den Container-Namen als Instanzen-Kennzeichner\&. Beachten Sie, dass andere Vorgabeoptionen gelten, wenn B<systemd-nspawn> durch die Vorlagen-Unit-Datei als wenn es interaktiv auf der Befehlszeile aufgerufen wird\&. Der wichtigste Unterschied bei den Vorgaben ist, dass die Vorlagen-Unit-Datei B<--boot> verwendet, während dies beim Aufruf von B<systemd-nspawn> auf der Befehlszeile nicht der Fall ist\&. Weitere Unterschiede in den Vorgaben sind zusammen mit den verschiedenen unterstützten Optionen weiter unten dokumentiert\&.

source: The B<machinectl>(1) tool may be used to execute a number of operations on containers\&. In particular it provides easy-to-use commands to run containers as system services using the systemd-nspawn@\&.service template unit file\&.
de: Das Werkzeug B<machinectl>(1) kann zur Ausführung einer Reihe von Aktionen an Containern verwandt werden\&. Es stellt insbesondere leicht zu benutzende Befehle bereit, um Container als Systemdienste mittels der Vorlagen-Unit-Datei systemd-nspawn@\&.service auszuführen\&.

source: Along with each container a settings file with the \&.nspawn suffix may exist, containing additional settings to apply when running the container\&. See B<systemd.nspawn>(5) for details\&. Settings files override the default options used by the systemd-nspawn@\&.service template unit file, making it usually unnecessary to alter this template file directly\&.
de: Neben jedem Container kann eine Einstellungsdatei mit der Endung \&.nspawn existieren, die zusätzliche, bei der Ausführung des Containers anzuwendende Einstellungen enthält\&. Siehe B<systemd.nspawn>(5) für Details\&. Einstellungsdateien setzen die von der Vorlagen-Unit-Datei systemd-nspawn@\&.service verwandten Vorgabeoptionen außer Kraft, wodurch es im Allgemeinen unnötig wird, diese Vorlagendatei direkt zu ändern\&.

source: Note that B<systemd-nspawn> will mount file systems private to the container to /dev/, /run/ and similar\&. These will not be visible outside of the container, and their contents will be lost when the container exits\&.
de: Beachten Sie, dass B<systemd-nspawn> Dateisysteme privat für den Container nach /dev/, /run/ und ähnlichem einhängen wird\&. Diese werden außerhalb des Containers nicht sichtbar sein und ihre Inhalte gehen verloren, wenn sich der Container beendet\&.

source: Note that running two B<systemd-nspawn> containers from the same directory tree will not make processes in them see each other\&. The PID namespace separation of the two containers is complete and the containers will share very few runtime objects except for the underlying file system\&. Use B<machinectl>(1)\*(Aqs B<login> or B<shell> commands to request an additional login session in a running container\&.
de: Beachten Sie, dass die Ausführung von zwei B<systemd-nspawn>-Containern aus dem gleichen Verzeichnis nicht dazu führt, dass sich die Prozesse in beiden gegenseitig sehen\&. Die PID-Namensraumtrennung der zwei Container ist vollständig und die Container nutzen sehr wenige Laufzeitobjekte gemeinsam, außer das unterliegende Dateisystem\&. Verwenden Sie die Befehle B<login> oder B<shell> von B<machinectl>(1), um zusätzliche Anmeldesitzungen in einem laufenden Container zu erbitten\&.

source: B<systemd-nspawn> implements the \m[blue]B<Container Interface>\m[]\&\s-2\u[1]\d\s+2 specification\&.
de: B<systemd-nspawn> implementiert die Spezifikation \m[blue]B<Container-Schnittstelle>\m[]\&\s-2\u[1]\d\s+2\&.

source: While running, containers invoked with B<systemd-nspawn> are registered with the B<systemd-machined>(8) service that keeps track of running containers, and provides programming interfaces to interact with them\&.
de: Während des Betriebs werden mittels B<systemd-nspawn> aufgerufene Container mit dem Dienst B<systemd-machined>(8) registriert\&. Dieser verfolgt die laufenden Container nach und stellt Programmierschnittstellen bereit, um mit ihnen zu interagieren\&.

source: OPTIONS
de: OPTIONEN

source: If option B<-b> is specified, the arguments are used as arguments for the init program\&. Otherwise, I<COMMAND> specifies the program to launch in the container, and the remaining arguments are used as arguments for this program\&. If B<--boot> is not used and no arguments are specified, a shell is launched in the container\&.
de: Falls die Option B<-b> angegeben ist, werden die Argumente als Argumente für das Init-Programm verwandt\&. Andernfalls gibt I<BEFEHL> das zu startende Programm in dem Container an und die verbleibenden Argumente werden als Argumente für dieses Programm benutzt\&. Falls B<--boot> nicht verwandt wird und keine Argumente angegeben sind, wird eine Shell in dem Container gestartet\&.

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Turns off any status output by the tool itself\&. When this switch is used, the only output from nspawn will be the console output of the container OS itself\&.
de: Schaltet sämtliche Statusausgaben des Werkzeuges selbst aus\&. Wird dieser Schalter verwandt, wird die einzige Ausgabe von Nspawn die Ausgabe der Konsole des Container-Betriebssystems selbst sein\&.

source: B<--settings=>I<MODE>
de: B<--settings=>I<MODUS>

source: Controls whether B<systemd-nspawn> shall search for and use additional per-container settings from \&.nspawn files\&. Takes a boolean or the special values B<override> or B<trusted>\&.
de: Steuert, ob B<systemd-nspawn> nach Container-bezogenen Einstellungen aus \&.nspawn-Dateien suchen und diese verwenden soll\&. Akzeptiert einen logischen oder die besonderen Werte B<override> oder B<trusted>\&.

source: If enabled (the default), a settings file named after the machine (as specified with the B<--machine=> setting, or derived from the directory or image file name) with the suffix \&.nspawn is searched in /etc/systemd/nspawn/ and /run/systemd/nspawn/\&. If it is found there, its settings are read and used\&. If it is not found there, it is subsequently searched in the same directory as the image file or in the immediate parent of the root directory of the container\&. In this case, if the file is found, its settings will be also read and used, but potentially unsafe settings are ignored\&. Note that in both these cases, settings on the command line take precedence over the corresponding settings from loaded \&.nspawn files, if both are specified\&. Unsafe settings are considered all settings that elevate the container\*(Aqs privileges or grant access to additional resources such as files or directories of the host\&. For details about the format and contents of \&.nspawn files, consult B<systemd.nspawn>(5)\&.
de: Falls aktiviert (die Vorgabe), wird eine Einstellungsdatei, die nach der Maschine (wie mit der Einstellung B<--machine=> angegeben oder aus dem Verzeichnis oder Abbildnamen abgeleitet) mit der Endung\&.nspawn benannt ist, in /etc/systemd/nspawn/ und /run/systemd/nspawn/ gesucht\&. Falls sie dort gefunden wird, werden deren Einstellungen gelesen und verwandt\&. Falls sie dort nicht gefunden wird, wird sie nachfolgend in dem gleichen Verzeichnis wie die Abbilddatei oder in dem Verzeichnis direkt über dem Wurzelverzeichnis des Containers gesucht\&. Falls die Datei in diesem Fall gefunden wird, werden ihre Einstellungen auch gelesen und verwandt, aber möglicherweise unsichere Einstellungen werden ignoriert\&. Beachten Sie, dass in beiden Fällen die Einstellungen auf der Befehlszeile Vorrang gegenüber den entsprechenden Einstellungen aus geladenen \&.nspawn-Dateien haben, falls beide angegeben sind\&. Alle Einstellungen, die die Privilegien des Containers erhöhen oder Zugriff auf zusätzliche Ressourcen wie Dateien oder Verzeichnissen auf der Wirtsmaschine geben können, werden als unsichere Einstellungen betrachtet\&. Für Details über das Format und die Inhalte von \&.nspawn-Dateien lesen Sie bitte B<systemd.nspawn>(5)\&.

source: If this option is set to B<override>, the file is searched, read and used the same way, however, the order of precedence is reversed: settings read from the \&.nspawn file will take precedence over the corresponding command line options, if both are specified\&.
de: Falls diese Option auf B<override> gesetzt ist, wird die Datei durchsucht, gelesen und auf die gleiche Art verwandt, allerdings ist die Vorrangreihenfolge umgedreht: Einstellungen aus den \&.nspawn-Dateien haben Vorrang vor den entsprechenden Einstellungen der Befehlszeilenoptionen, falls beide angegeben sind\&.

source: If this option is set to B<trusted>, the file is searched, read and used the same way, but regardless of being found in /etc/systemd/nspawn/, /run/systemd/nspawn/ or next to the image file or container root directory, all settings will take effect, however, command line arguments still take precedence over corresponding settings\&.
de: Falls diese Option auf B<trusted> gesetzt ist, wird die Datei durchsucht, gelesen und auf die gleiche Art verwandt, unabhängig davon, wo sie in /etc/systemd/nspawn/, /run/systemd/nspawn/ oder neben der Abbild-Datei oder dem Wurzelverzeichnis des Containers gefunden wurde, alle Einstellungen werden wirksam, allerdings haben Befehlszeilenoptionen weiterhin Vorrang vor den entsprechenden Einstellungen\&.

source: If disabled, no \&.nspawn file is read and no settings except the ones on the command line are in effect\&.
de: Falls deaktiviert, werden keine \&.nspawn-Dateien gelesen und keine Einstellungen außer denen auf der Befehlszeile werden wirksam\&.

source: Image Options
de: Abbild-Optionen

source: Directory to use as file system root for the container\&.
de: Verzeichnis, das als Dateisystemwurzel für den Container verwandt werden soll\&.

source: If neither B<--directory=>, nor B<--image=> is specified the directory is determined by searching for a directory named the same as the machine name specified with B<--machine=>\&. See B<machinectl>(1) section "Files and Directories" for the precise search path\&.
de: Falls weder B<--directory=> noch B<--image=> angegeben sind, wird das Verzeichnis ermittelt, indem nach einem Verzeichnis, dessen Namen mit einem mittels B<--machine=> übergebenen Maschinennamen übereinstimmt, gesucht wird\&. Siehe den Abschnitt »Dateien und Verzeichnisse« in B<machinectl>(1) für den genauen Suchpfad\&.

source: If neither B<--directory=>, B<--image=>, nor B<--machine=> are specified, the current directory will be used\&. May not be specified together with B<--image=>\&.
de: Falls weder B<--directory=>, B<--image=> noch B<--machine=> angegeben sind, wird das aktuelle Verzeichnis verwandt\&. Darf nicht zusammen mit B<--image=> angegeben werden\&.

source: Directory or "btrfs" subvolume to use as template for the container\*(Aqs root directory\&. If this is specified and the container\*(Aqs root directory (as configured by B<--directory=>) does not yet exist it is created as "btrfs" snapshot (if supported) or plain directory (otherwise) and populated from this template tree\&. Ideally, the specified template path refers to the root of a "btrfs" subvolume, in which case a simple copy-on-write snapshot is taken, and populating the root directory is instant\&. If the specified template path does not refer to the root of a "btrfs" subvolume (or not even to a "btrfs" file system at all), the tree is copied (though possibly in a \*(Aqreflink\*(Aq copy-on-write scheme \(em if the file system supports that), which can be substantially more time-consuming\&. Note that the snapshot taken is of the specified directory or subvolume, including all subdirectories and subvolumes below it, but excluding any sub-mounts\&. May not be specified together with B<--image=> or B<--ephemeral>\&.
de: Verzeichnis oder »btrfs«-Teildatenträger, das/der als Vorlage für das Wurzelverzeichnis des Containers verwandt werden soll\&. Falls dies angegeben ist und das Wurzelverzeichnis des Containers (wie mit B<--directory=> konfiguriert) noch nicht existiert, wird es als »btrfs«-Schnappschuss (falls unterstützt) oder als einfaches Verzeichnis (andernfalls) erstellt und von diesem Vorlagenbaum befüllt\&. Idealerweise bezieht sich der angegebene Vorlagenpfad auf das Wurzelverzeichnis eines »btrfs«-Teildatenträgers, wodurch in diesem Fall ein einfacher »Kopieren-beim-Schreiben«-Schnappschuss gemacht wird und das Befüllen des Wurzelverzeichnisses instantan erfolgt\&. Falls sich der angegebene Vorlagenpfad nicht auf die Wurzel eines »btrfs«-Teildatenträgers bezieht (oder noch nicht einmal auf einem »btrfs«-Dateisystem liegt), wird der Verzeichnisbaum kopiert (möglicherweise allerdings in einem »reflink«-»Kopieren-beim-Schreiben«-Schema \(em falls das Dateisystem dies unterstützt), was deutlich mehr Zeit benötigen kann\&. Beachten Sie, dass der Schnappschuss von dem angegebenen Verzeichnis oder Teildatenträger vorgenommen wird, einschließlich aller Unterverzeichnisse und Teildatenträger, aber ausschließlich aller Untereinhängungen\&. Darf nicht zusammen mit B<--image=> oder B<--ephemeral> angegeben werden\&.

source: Note that this switch leaves hostname, machine ID and all other settings that could identify the instance unmodified\&.
de: Beachten Sie, dass dieser Schalter den Rechnernamen, die Maschinenkennung und alle anderen Einstellungen, die die Instanz identifizieren könnten, unverändert lässt\&.

source: If specified, the container is run with a temporary snapshot of its file system that is removed immediately when the container terminates\&. May not be specified together with B<--template=>\&.
de: Führt den Container mit einem temporären Schnappschuss seines Dateisystems aus, falls angegeben\&. Dieser wird direkt nach Beenden des Containers entfernt\&. Darf nicht zusammen mit B<--template=> angegeben werden\&.

source: Note that this switch leaves hostname, machine ID and all other settings that could identify the instance unmodified\&. Please note that \(em as with B<--template=> \(em taking the temporary snapshot is more efficient on file systems that support subvolume snapshots or \*(Aqreflinks\*(Aq natively ("btrfs" or new "xfs") than on more traditional file systems that do not ("ext4")\&. Note that the snapshot taken is of the specified directory or subvolume, including all subdirectories and subvolumes below it, but excluding any sub-mounts\&.
de: Beachten Sie, dass dieser Schalter den Rechnernamen, die Maschinenkennung und alle anderen Einstellungen, die die Instanz identifizieren könnten, unverändert lässt\&. Beachten Sie, dass wie bei B<--template=> das Vornehmen eines temporären Schnappschusses auf Dateisystemen, die Teildatenträger oder nativ »reflinks« unterstützen (»btrfs« oder neues »xfs«), effizienter als auf traditionelleren Dateisystemen, die das nicht tun (»ext4«), ist\&. Beachten Sie, dass der aufgenommene Schnappschuss das gesamte angegebene Verzeichnis oder Teildatenträger umfasst, einschließlich aller Unterverzeichnisse und Teildatenträger darunter, aber ausschließlich aller Untereinhängungen\&.

source: With this option no modifications of the container image are retained\&. Use B<--volatile=> (described below) for other mechanisms to restrict persistency of container images during runtime\&.
de: Mit dieser Option werden keine Änderungen am Container-Abbild erhalten\&. Verwenden Sie (das nachfolgend beschriebene) B<--volatile=> als weiteren Mechanismus, um die Dauerhaftigkeit von Container-Abbildern zur Laufzeit zu begrenzen\&.

source: Disk image to mount the root directory for the container from\&. Takes a path to a regular file or to a block device node\&. The file or block device must contain either:
de: Plattenabbild, aus dem das Wurzelverzeichnis für den Container geladen werden soll\&. Akzeptiert einen Pfad zu einer regulären Datei oder zu einem Blockgeräteknoten\&. Die Datei oder das Blockgerät muss eines der Folgenden enthalten:

source: An MBR partition table with a single partition of type 0x83 that is marked bootable\&.
de: Eine MBR-Partitionstabelle mit einer einzelnen Partition vom Typ 0x83, der startfähig markiert ist\&.

source: A GUID partition table (GPT) with a single partition of type 0fc63daf-8483-4772-8e79-3d69d8477de4\&.
de: Eine GUID-Partitionstablle (GPT) mit einer einzelnen Partition vom Typ 0fc63daf-8483-4772-8e79-3d69d8477de4\&.

source: A GUID partition table (GPT) with a marked root partition which is mounted as the root directory of the container\&. Optionally, GPT images may contain a home and/or a server data partition which are mounted to the appropriate places in the container\&. All these partitions must be identified by the partition types defined by the \m[blue]B<Discoverable Partitions Specification>\m[]\&\s-2\u[2]\d\s+2\&.
de: Eine GUID-Partitionstabelle (GPT) mit einer markierten Wurzelpartition, die als Wurzelverzeichnis des Containers eingehängt ist\&. Optional dürfen GPT-Abbilder auch eine Home- oder Serverdatenpartition enthalten, die an den geeigneten Stellen im Container eingehängt sind\&. Alle diese Partitionen müssen durch die in \m[blue]B<Spezifikation auffindbarer Partitionen>\m[]\&\s-2\u[2]\d\s+2 definierten Partitionstypen identifiziert werden\&.

source: No partition table, and a single file system spanning the whole image\&.
de: Keine Partitionstabelle und eine einzelne Datei, die sich über das gesamte Abbild erstreckt\&.

source: On GPT images, if an EFI System Partition (ESP) is discovered, it is automatically mounted to /efi (or /boot as fallback) in case a directory by this name exists and is empty\&.
de: Falls eine EFI-Systempartition (ESP) auf GPT-Abbildern entdeckt wird, wird diese automatisch nach /efi (oder /boot als Rückfall) eingehängt, falls ein Verzeichnis dieses Namens existiert und leer ist\&.

source: Partitions encrypted with LUKS are automatically decrypted\&. Also, on GPT images dm-verity data integrity hash partitions are set up if the root hash for them is specified using the B<--root-hash=> option\&.
de: Mit LUKS verschlüsselte Partitionen werden automatisch entschlüsselt\&. Auf GPT-Abbildern prüft dm-verity auch, ob die Datenintegritäts-Hash-Partitionen eingerichtet sind, falls der Wurzel-Hash für sie mit der Option B<--root-hash=> angegeben wurde\&.
