Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: Single file system images (i\&.e\&. file systems without a surrounding partition table) can be opened using dm-verity if the integrity data is passed using the B<--root-hash=> and B<--verity-data=> (and optionally B<--root-hash-sig=>) options\&.
de: Einzelne Dateisystemabbilder (d\&.h\&. Dateisysteme ohne eine umgebende Partitionstabelle) können mittels Dm-verity geöffnet werden, falls die Integritätsdaten mittels der Optionen B<--root-hash=> und B<--verity-data=> (und optional B<--root-hash-sig=>) übergeben werden\&.

source: Any other partitions, such as foreign partitions or swap partitions are not mounted\&. May not be specified together with B<--directory=>, B<--template=>\&.
de: Alle anderen Partitionen, wie fremde Partitionen oder Auslagerungspartitionen, werden nicht eingehängt\&. Darf nicht zusammen mit B<--directory=>, B<--template=> angegeben werden\&.

source: Takes the path to an OCI runtime bundle to invoke, as specified in the \m[blue]B<OCI Runtime Specification>\m[]\&\s-2\u[3]\d\s+2\&. In this case no \&.nspawn file is loaded, and the root directory and various settings are read from the OCI runtime JSON data (but data passed on the command line takes precedence)\&.
de: Akzeptiert einen Pfad zu einem aufzurufenden OCI-Laufzeitbündel, wie in der \m[blue]B<OCI-Laufzeit-Spezifikation>\m[]\&\s-2\u[3]\d\s+2 spezifiziert ist\&. In diesem Fall wird keine \&.nspawn-Datei geladen und das Wurzelverzeichnis und verschiedene Einstellungen werden aus den OCI-Laufzeit-JSON-Daten eingelesen (allerdings haben auf der Befehlszeile übergebene Daten Vorrang)\&.

source: Mount the container\*(Aqs root file system (and any other file systems container in the container image) read-only\&. This has no effect on additional mounts made with B<--bind=>, B<--tmpfs=> and similar options\&. This mode is implied if the container image file or directory is marked read-only itself\&. It is also implied if B<--volatile=> is used\&. In this case the container image on disk is strictly read-only, while changes are permitted but kept non-persistently in memory only\&. For further details, see below\&.
de: Hängt das Wurzeldateisystem des Containers (und alle anderen Dateisysteme-Container in dem Container-Abbild) nur-lesbar ein\&. Dies hat für zusätzliche Einhängungen mit B<--bind=>, B<--tmpfs=> und ähnlichen Optionen keine Wirkung\&. Dieser Modus ist impliziert, falls das Container-Abbild oder Verzeichnis als nur-lesbar markiert wurde\&. Beim Einsatz von B<--volatile=> wird dies auch impliziert\&. In diesem Fall ist das Container-Abbild auf Platte streng nur-lesbar, wobei Änderungen erlaubt sind, aber nur nicht dauerhaft im Arbeitsspeicher gehalten werden\. Weitere Details finden Sie nachfolgend\&.

source: B<--volatile>, B<--volatile=>I<MODE>
de: B<--volatile>, B<--volatile=>I<MODUS>

source: Boots the container in volatile mode\&. When no mode parameter is passed or when mode is specified as B<yes>, full volatile mode is enabled\&. This means the root directory is mounted as a mostly unpopulated "tmpfs" instance, and /usr/ from the OS tree is mounted into it in read-only mode (the system thus starts up with read-only OS image, but pristine state and configuration, any changes are lost on shutdown)\&. When the mode parameter is specified as B<state>, the OS tree is mounted read-only, but /var/ is mounted as a writable "tmpfs" instance into it (the system thus starts up with read-only OS resources and configuration, but pristine state, and any changes to the latter are lost on shutdown)\&. When the mode parameter is specified as B<overlay> the read-only root file system is combined with a writable tmpfs instance through "overlayfs", so that it appears at it normally would, but any changes are applied to the temporary file system only and lost when the container is terminated\&. When the mode parameter is specified as B<no> (the default), the whole OS tree is made available writable (unless B<--read-only> is specified, see above)\&.
de: Startet den Container im flüchtigen Mouds\&. Wird kein Modusparameter übergeben oder der Modus als B<yes> angegeben, dann wird der vollständige flüchtige Modus aktiviert\&. Dies bedeutet, dass das Wurzelverzeichnis eine größtenteils leere »tmpfs«-Instanz ist und /usr/ aus dem Betriebssystembaum dort nur-lesbar hineingehängt ist (das System startet daher mit einem nur-lesbaren Betriebssystemabbild aber einem jungfräulichen Zustand und jungfräulicher Konfiguration und sämtliche Änderungen an Letzterem gehen beim Herunterfahren verloren)\&. Falls der Modusparameter als B<overlay> angegeben ist, wird das nur-lesbare Wurzeldateisystem mit einer schreibbaren Tmpfs-Instanz mittels »overlayfs« kombiniert, so dass es sich wie normalerweise verhält, aber sämtliche Änderungen nur an dem temporären Dateisystem vorgenommen werden und daher bei der Beendigung des Containers verloren gehen\&. Falls der Modusparameter als B<no> angegeben ist (die Vorgabe), dann wird der gesamte Betriebssystembaum schreibbar zur Verfügung gestellt (außer B<--read-only> ist angegeben, siehe oben)\&.

source: Note that if one of the volatile modes is chosen, its effect is limited to the root file system (or /var/ in case of B<state>), and any other mounts placed in the hierarchy are unaffected \(em regardless if they are established automatically (e\&.g\&. the EFI system partition that might be mounted to /efi/ or /boot/) or explicitly (e\&.g\&. through an additional command line option such as B<--bind=>, see below)\&. This means, even if B<--volatile=overlay> is used changes to /efi/ or /boot/ are prohibited in case such a partition exists in the container image operated on, and even if B<--volatile=state> is used the hypothetical file /etc/foobar is potentially writable if B<--bind=/etc/foobar> if used to mount it from outside the read-only container /etc/ directory\&.
de: Beachten Sie, dass bei der Auswahl einer der flüchtigen Modi die Auswirkung auf das Wurzeldateisystem (oder im Falle von B<state> /var/) begrenzt wird und jede andere, in der Hierarchie angeordnete Einhängung davon unbetroffen ist, unabhängig davon, ob sie automatisch (z\&.B\&. die EFI-Systempartition, die nach /efi/ oder /boot/ eingehängt sein könnte) oder explizit (z.\&.B\&. durch eine zusätzliche Befehlszeilenoption wie B<--bind=>, siehe unten) etabliert wurden\&. Dies bedeutet, dass Änderungen an /efi/ oder /boot/ verboten sind, selbst falls B<--volatile=overlay> verwandt wurde und eine solche Partition im betroffenen Container-Abbild existiert und selbst falls B<--volatile=state> verwandt wird, wird eine hypothetische Datei /etc/foobar möglicherweise schreibbar, falls B<--bind=/etc/foobar> zum Einhängen von außerhalb des nur lesbaren Container-/etc/-Verzeichnisses verwnadt wird\&.

source: The B<--ephemeral> option is closely related to this setting, and provides similar behaviour by making a temporary, ephemeral copy of the whole OS image and executing that\&. For further details, see above\&.
de: Die Option B<--ephemeral> hat einen engen Bezug zu dieser Einstellung und stellt ähnliches Verhalten bereit, bei dem eine temporäre und vergängliche Kopie des gesamten Betriebssystemabbildes erfolgt und diese dann ausgeführt wird\&. Weitere Details finden Sie weiter oben\&.

source: The B<--tmpfs=> and B<--overlay=> options provide similar functionality, but for specific sub-directories of the OS image only\&. For details, see below\&.
de: Die Option B<--tmpfs=> und B<--overlay=> stellen ähnliche Funktionalität bereit, allerdings nur für bestimmte Unterverzeichnisse des Betriebssystemabbildes\&. Details finden Sie nachfolgend\&.

source: This option provides similar functionality for containers as the "systemd\&.volatile=" kernel command line switch provides for host systems\&. See B<kernel-command-line>(7) for details\&.
de: Diese Option stellt ähnliche Funktionalität für Container bereit, wie der Befehlszeilenschalter »systemd\&.volatile=« dies für Rechner selbst darstellt\&. Siehe B<kernel-command-line>(7) für Details\&.

source: Note that setting this option to B<yes> or B<state> will only work correctly with operating systems in the container that can boot up with only /usr/ mounted, and are able to automatically populate /var/ (and /etc/ in case of "--volatile=yes")\&. Specifically, this means that operating systems that follow the historic split of /bin/ and /lib/ (and related directories) from /usr/ (i\&.e\&. where the former are not symlinks into the latter) are not supported by "--volatile=yes" as container payload\&. The B<overlay> option does not require any particular preparations in the OS, but do note that "overlayfs" behaviour differs from regular file systems in a number of ways, and hence compatibility is limited\&.
de: Beachten Sie, dass das Setzen dieser Option auf B<yes> oder B<state> nur funktioniert, falls das Betriebssystem des Containers einen Systemstart mit ausschließlich eingehängtem /usr/ durchführen und dann selbständig /var/ bevölkern (und im Falle von »--volatile=yes« auch /etc/) kann\&. Dies bedeutet insbesondere, dass Betriebssysteme, die der historischen Aufteilung von /bin/ und /lib/ (und zugehörigen Verzeichnissen) von /usr/ folgen (d\&.h\&. bei denen Erstere keine Symlinks in Letztere sind), bei »--volatile=yes« nicht als Container-Inhalt unterstützt werden\&. Die Option B<overlay> verlangt keine besonderen Vorbereitungen von dem Betriebssystem, aber beachten Sie, dass sich das Verhalten von »overlayfs« von dem regulärer Dateisysteme in einer Reihe von Punkten unterscheidet und somit die Kompatibilität eingeschränkt ist\&.

source: Takes a data integrity (dm-verity) root hash specified in hexadecimal\&. This option enables data integrity checks using dm-verity, if the used image contains the appropriate integrity data (see above)\&. The specified hash must match the root hash of integrity data, and is usually at least 256 bits (and hence 64 formatted hexadecimal characters) long (in case of SHA256 for example)\&. If this option is not specified, but the image file carries the "user\&.verity\&.roothash" extended file attribute (see B<xattr>(7)), then the root hash is read from it, also as formatted hexadecimal characters\&. If the extended file attribute is not found (or is not supported by the underlying file system), but a file with the \&.roothash suffix is found next to the image file, bearing otherwise the same name (except if the image has the \&.raw suffix, in which case the root hash file must not have it in its name), the root hash is read from it and automatically used, also as formatted hexadecimal characters\&.
de: Akzeptiert einen hexadezimalen Dateiintegritäts-Wurzel-Hash (dm-verity)\&. Diese Option aktiviert Datenintegritätsüberprüfungen mittels dm-verity, falls das verwandte Abbild die notwendigen Integritätsdaten enthält (siehe oben)\&. Der angegebene Hash muss auf den Wurzel-Hash der Integritätsdaten passen und ist normalerweise mindestens 256 Bit (und damit 64 formatierte hexadezimale Zeichen) lang (im beispielhaften Fall von SHA256)\&. Falls diese Option nicht angegeben ist, aber das Abbild das erweiterte Attribut »user\&.verity\&.roothash« trägt (siehe B<xattr>(7)), dann wird der Wurzel-Hash und auch die formatierten hexadezimalen Zeichen daraus gelesen\&. Falls das erweiterte Dateiattribut nicht gefunden wird (oder von dem zugrundeliegenden Dateisystem nicht unterstützt wird), aber eine Datei mit der Endung \&.roothash neben dem Abbild gefunden wird, das ansonsten den gleichen Namen trägt (außer falls das Abbild die Endung \&.raw enthält, dann darf die Root-Hash-Datei dies nicht in ihrem Namen enthalten), dann wird der Wurzel-Hash und auch die formatierten hexadezimalen Zeichen daraus gelesen und automatisch verwandt\&.

source: Note that this configures the root hash for the root file system\&. Disk images may also contain separate file systems for the /usr/ hierarchy, which may be Verity protected as well\&. The root hash for this protection may be configured via the "user\&.verity\&.usrhash" extended file attribute or via a \&.usrhash file adjacent to the disk image, following the same format and logic as for the root hash for the root file system described here\&. Note that there\*(Aqs currently no switch to configure the root hash for the /usr/ from the command line\&.
de: Beachten Sie, dass dies den Wurzel-Hash für das Wurzeldateisystem konfiguriert\&. Plattenabbilder können auch separate Dateiystem für die /usr/-Hierarchie enthalten, die auch Verity-geschützt sein kann\&. Der Wurzel-Hash für diesen Schutz kann mit dem erweiterten Dateiattribut »user\&.verity\&.usrhash« oder mittels einer \&.usrhash-Datei neben dem Plattenabbild konfiguriert werden\&. Dies folgt dem gleichen Format und der gleichen Logik wie für den hier beschriebenen Wurzel-Hash für das Wurzeldateisystem\&. Beachten Sie, dass es derzeit keinen Schalter gibt, um den Wurzel-Hash für /usr/ von der Befehlszeile aus zu konfigurieren\&.

source: Also see the I<RootHash=> option in B<systemd.exec>(5)\&.
de: Siehe auch die Option I<RootHash=> in B<systemd.exec>(5)\&.

source: Takes a PKCS7 signature of the B<--root-hash=> option\&. The semantics are the same as for the I<RootHashSignature=> option, see B<systemd.exec>(5)\&.
de: Akzeptiert eine PKCS7-Signatur der Option B<--root-hash=>\&. Die Semantik ist zur Option I<RootHashSignature=> identisch, siehe B<systemd.exec>(5)\&.

source: Takes the path to a data integrity (dm-verity) file\&. This option enables data integrity checks using dm-verity, if a root-hash is passed and if the used image itself does not contains the integrity data\&. The integrity data must be matched by the root hash\&. If this option is not specified, but a file with the \&.verity suffix is found next to the image file, bearing otherwise the same name (except if the image has the \&.raw suffix, in which case the verity data file must not have it in its name), the verity data is read from it and automatically used\&.
de: Akzeptiert einen Pfad zu einer Datenintegritätsdatei (dm-verity)\&. Diese Option aktiviert Datenintegritätsüberprüfungen mittels Dm-verity, falls ein Wurzel-Hash übergeben wird und falls das verwandte Abbild selbst keine Integritätsdaten enthält\&. Die Integritätsdaten müssen mit dem Wurzel-Hash übereinstimmen\&. Falls diese Option nicht angegeben ist, aber eine Datei mit der Endung »\&.verity« neben der Abbild-Datei gefunden wird, die ansonsten den gleichen Namen trägt (außer falls das Abbild die Endung »\&.raw« hat, in welchem Falle die Verity-Datendatei dies nicht in ihrem Namen haben darf), dann werden die Verity-Daten daraus gelesen und automatisch verwandt\&.

source: Pivot the specified directory to / inside the container, and either unmount the container\*(Aqs old root, or pivot it to another specified directory\&. Takes one of: a path argument \(em in which case the specified path will be pivoted to / and the old root will be unmounted; or a colon-separated pair of new root path and pivot destination for the old root\&. The new root path will be pivoted to /, and the old / will be pivoted to the other directory\&. Both paths must be absolute, and are resolved in the container\*(Aqs file system namespace\&.
de: Schwenkt in das angegebene Verzeichnis als / innerhalb des Containers um und hängt entweder die alte Wurzel des Containers aus oder schwenkt sie auf ein anderes angegebenes Verzeichnis um\&. Akzeptiert entweder ein Pfadargument (in diesem Fall wird der angegebene Pfad zu / verschwenkt und die alte Wurzel ausgehängt) oder ein Doppelpunkt-getrenntes Paar aus neuem Wurzelpfad und Schwenkziel für die alte Wurzel\&. Der neue Wurzelpfad wird auf / verschwenkt und die alte / wird auf das andere Verzeichnis verschwenkt\&. Beide Pfade müssen absolut und im Dateisystemnamensraum des Containers auflösbar sein\&.

source: This is for containers which have several bootable directories in them; for example, several \m[blue]B<OSTree>\m[]\&\s-2\u[4]\d\s+2 deployments\&. It emulates the behavior of the boot loader and initial RAM disk which normally select which directory to mount as the root and start the container\*(Aqs PID 1 in\&.
de: Dies ist für Container, die mehrere startfähige Verzeichnisse enthalten, beispielweise mehrere \m[blue]B<OSTree>\m[]\&\s-2\u[4]\d\s+2-Einsätze\&. Sie emuliert das Verhalten eines Systemstartprogrammes und einer anfänglichen RAM-Platte, die normalerweise auswählt, welches Verzeichnis als Wurzel eingehängt und darin PID 1 des Containers gestartet wird\&.

source: Execution Options
de: Ausführungsoptionen

source: Invoke the shell or specified program as process ID (PID) 2 instead of PID 1 (init)\&. By default, if neither this option nor B<--boot> is used, the selected program is run as the process with PID 1, a mode only suitable for programs that are aware of the special semantics that the process with PID 1 has on UNIX\&. For example, it needs to reap all processes reparented to it, and should implement B<sysvinit> compatible signal handling (specifically: it needs to reboot on SIGINT, reexecute on SIGTERM, reload configuration on SIGHUP, and so on)\&. With B<--as-pid2> a minimal stub init process is run as PID 1 and the selected program is executed as PID 2 (and hence does not need to implement any special semantics)\&. The stub init process will reap processes as necessary and react appropriately to signals\&. It is recommended to use this mode to invoke arbitrary commands in containers, unless they have been modified to run correctly as PID 1\&. Or in other words: this switch should be used for pretty much all commands, except when the command refers to an init or shell implementation, as these are generally capable of running correctly as PID 1\&. This option may not be combined with B<--boot>\&.
de: Ruft die Shell oder das angegebene Programm als Prozesskennung (PID) 2 statt als PID 1 (Init) auf\&. Standardmäßig wird das ausgewählte Programm als Prozess mit PID 1 ausgeführt, falls weder diese noch die Option B<--boot> verwandt wird\&. Dieser Modus ist nur für Programme geeignet, die sich der besonderen Semantik, die Prozesse mit der PID 1 unter UNIX haben, bewusst sind\&. Beispielsweise muss er alle (Zombie-)Prozesse beseitigen, deren Elternprozess er geworden ist, und sollte B<sysvinit>-kompatible Signalhandhabung implementieren (insbesondere muss sie bei SIGINT das System neu starten, bei SIGTERM sich selbst neu ausführen, ihre Konfiguration bei SIGHUP neu einlesen und so weiter)\&. Mit B<--as-pid2> wird ein minimaler Init-Prozess als PID 1 und das ausgewählte Programm wird als PID 2 ausgeführt (und muss daher keine besonderen Semantiken implementieren)\&. Der minimale Init-Prozess wird (Zombie-)Prozesse wie nötig beseitigen und geeignet auf Signale reagieren\&. Es wird empfohlen, diesen Modus zum Aufruf von beliebigen Befehlen in Containern zu verwenden, außer diese wurden zum Betrieb als PID 1 angepasst\&. Mit anderen Worten: dieser Schalter sollte für so ziemlich alle Befehle verwendet werden, außer der Befehl bezieht sich auf eine Init- oder Shell-Implementierung, da diese im Allgemeinen in der Lage sind, korrekt als PID 1 zu laufen\&. Diese Option darf nicht mit B<--boot> kombiniert werden\&.

source: Automatically search for an init program and invoke it as PID 1, instead of a shell or a user supplied program\&. If this option is used, arguments specified on the command line are used as arguments for the init program\&. This option may not be combined with B<--as-pid2>\&.
de: Sucht automatisch nach einem Init-Programm und ruft es als PID 1 statt einer Shell oder eines benutzerdefinierten Programms auf\&. Falls diese Option verwandt wird, werden auf der Befehlszeile übergebene Argumente als Argumente für das Init-Programm verwandt\&. Diese Option darf nicht mit B<--as-pid2> kombiniert werden\&.

source: The following table explains the different modes of invocation and relationship to B<--as-pid2> (see above):
de: Die nachfolgende Tabelle erklärt die verschiedenen Aufrufmodi und die Beziehung zu B<--as-pid2> (siehe oben):

source: B<Table\ \&1.\ \&Invocation Mode>
de: B<Tabelle\ \&1.\ \&Aufrufmodus>

source: Switch
de: Schalter

source: Explanation
de: Erklärung

source: Neither B<--as-pid2> nor B<--boot> specified
de: Weder B<--as-pid2> noch B<--boot> angegeben

source: The passed parameters are interpreted as the command line, which is executed as PID 1 in the container\&.
de: Die übergebenen Parameter werden als Befehlszeile interpretiert, die als PID 1 im Container ausgeführt wird\&.

source: B<--as-pid2> specified
de: B<--as-pid2> angegeben

source: The passed parameters are interpreted as the command line, which is executed as PID 2 in the container\&. A stub init process is run as PID 1\&.
de: Die übergebenen Parameter werden als Befehlszeile interpretiert, die als PID 2 im Container ausgeführt wird\&. Ein minimaler Init-Prozess wird als PID 1 ausgeführt\&.

source: B<--boot> specified
de: B<--boot> angegeben

source: An init program is automatically searched for and run as PID 1 in the container\&. The passed parameters are used as invocation parameters for this process\&.
de: Im Container wird automatisch nach einem Init-Programm gesucht und dieses als PID 1 ausgeführt\&. Die übergebenen Parameter werden als Aufrufparameter für diesen Prozess verwandt\&.

source: Note that B<--boot> is the default mode of operation if the systemd-nspawn@\&.service template unit file is used\&.
de: Beachten Sie, dass B<--boot> der Standardaktionsmodus ist, falls die Vorlagen-Unit-Datei systemd-nspawn@\&.service verwandt wird\&.

source: Change to the specified working directory before invoking the process in the container\&. Expects an absolute path in the container\*(Aqs file system namespace\&.
de: Wechselt vor Aufruf des Prozesses im Container zu dem angegebenen Arbeitsverzeichnis\&. Erwartet einen absoluten Pfad in dem Dateisystemnamensraum des Containers\&.

source: B<-E >I<NAME>B<[=>I<VALUE>B<]>, B<--setenv=>I<NAME>B<[=>I<VALUE>B<]>
de: B<-E >I<NAME>B<[=>I<WERT>B<]>, B<--setenv=>I<NAME>B<[=>I<WERT>B<]>

source: Specifies an environment variable to pass to the init process in the container\&. This may be used to override the default variables or to set additional variables\&. It may be used more than once to set multiple variables\&. When "=" and I<VALUE> are omitted, the value of the variable with the same name in the program environment will be used\&.
de: Gibt die Umgebungsvariablen an, die an den Init-Prozess im Container übergeben werden soll\&. Dies kann zum Außerkraftsetzen der Vorgabenvariablen oder zum Setzen zusätzlicher Variablen verwandt werden\&. Es kann mehr als einmal benutzt werden, um mehrere Variablen zu setzen\&. Wenn »=« und I<WERT> nicht angegeben sind, dann wird der Wert der Variablen mit dem gleichen Namen in der Programmumgebung verwandt\&.

source: After transitioning into the container, change to the specified user defined in the container\*(Aqs user database\&. Like all other systemd-nspawn features, this is not a security feature and provides protection against accidental destructive operations only\&.
de: Wechselt nach Übergang in den Container zu dem angegebenen Benutzer, wie er in der Benutzerdatenbank im Container definiert ist\&. Wie alle anderen Systemd-nspawn-Funktionalitäten ist dies keine Sicherheitsfunktionalität und stellt nur einen Schutz gegen versehentliche zerstörerische Aktionen dar\&.
