Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: Note that any I<After=> dependency is automatically mirrored to create a I<Before=> dependency\&. Temporal dependencies may be specified explicitly, but are also created implicitly for units which are I<WantedBy=> targets (see B<systemd.target>(5)), and as a result of other directives (for example I<RequiresMountsFor=>)\&. Both explicitly and implicitly introduced dependencies are shown with B<list-dependencies>\&.
uk: Зауважте, що будь-яку залежність I<After=> буде автоматично віддзеркалено для створення залежності I<Before=>\&. Тимчасові залежності може бути вказано явним чином, але також буде створено неявним чином для модулів, які є цілями I<WantedBy=> (див. B<systemd.target>(5)), і як результат інших інструкцій (наприклад I<RequiresMountsFor=>)\&. Явні і неявні впроваджені залежності буде виведено у відповідь на команду B<list-dependencies>\&.

source: When passed to the B<list-jobs> command, for each printed job show which other jobs are waiting for it\&. May be combined with B<--before> to show both the jobs waiting for each job as well as all jobs each job is waiting for\&.
uk: Якщо передано команді B<list-jobs> для кожного виведеного завдання вивести, які інші завдання очікують на нього\&. Можна поєднати з B<--before>, щоб програма вивела і завдання, які очікують на якесь завдання, і усі завдання, на які очікує якесь завдання\&.

source: With B<list-dependencies>, show the units that are ordered after the specified unit\&. In other words, recursively list units following the I<Before=> dependency\&.
uk: Із B<list-dependencies> вивести дані модулів, які перебувають у порядку після вказаного модуля\&. Іншими словами, вивести рекурсивний список модулів із залежністю I<Before=>\&.

source: When passed to the B<list-jobs> command, for each printed job show which other jobs it is waiting for\&. May be combined with B<--after> to show both the jobs waiting for each job as well as all jobs each job is waiting for\&.
uk: Якщо передано команді B<list-jobs> для кожного виведеного завдання вивести, які інші завдання очікують на нього\& Можна поєднати з B<--after>, щоб програма вивела і завдання, які очікують на якесь завдання, і усі завдання, на які очікує якесь завдання\&.

source: When used with B<status>, B<cat>, B<list-units>, and B<list-unit-files>, those commands print all specified units and the dependencies of those units\&.
uk: Якщо їх використано разом із B<status>, B<cat>, B<list-units> і B<list-unit-files>, ці команди виводять дані усіх вказаних модулів і залежності для цих модулів\&.

source: Do not ellipsize unit names, process tree entries, journal output, or truncate unit descriptions in the output of B<status>, B<list-units>, B<list-jobs>, and B<list-timers>\&.
uk: Не обривати багатокрапкою надто довгі назви модулів, записи ієрархії процесів, виведені повідомлення журналу, і не обрізати описи модулів у виведених даних B<status>, B<list-units>, B<list-jobs> і B<list-timers>\&.

source: Also, show installation targets in the output of B<is-enabled>\&.
uk: Крім того, вивести цілі встановлення у даних, які виведено B<is-enabled>\&.

source: When printing properties with B<show>, only print the value, and skip the property name and "="\&. Also see option B<-P> above\&.
uk: При виведенні властивостей за допомогою B<show> вивести лише значення без назви властивості і символу «=»\&. Див. також параметр B<-P> вище\&.

source: When showing sockets, show the type of the socket\&.
uk: При показі сокетів вивести тип сокета\&.

source: When queuing a new job, this option controls how to deal with already queued jobs\&. It takes one of "fail", "replace", "replace-irreversibly", "isolate", "ignore-dependencies", "ignore-requirements", "flush", or "triggering"\&. Defaults to "replace", except when the B<isolate> command is used which implies the "isolate" job mode\&.
uk: При додаванні нового завдання до черги цей параметр керує тим, як працювати з завданнями, які вже перебувають у черзі\&. Приймає одне зі значень, «fail», «replace», «replace-irreversibly», «isolate», «ignore-dependencies», «ignore-requirements», «flush» або «triggering»\&. Типовим є «replace», якщо не використано команду B<isolate>, яка неявним чином встановлює режим завдання «isolate»\&.

source: If "fail" is specified and a requested operation conflicts with a pending job (more specifically: causes an already pending start job to be reversed into a stop job or vice versa), cause the operation to fail\&.
uk: Якщо вказано «fail», і запитана дія конфліктує із завданням у черзі (специфічніше: спричиняє обернення у зупинене завдання і навпаки для завдання запуску, яке вже перебуває у черзі), спричиняє режим помилки для дії\&.

source: If "replace" (the default) is specified, any conflicting pending job will be replaced, as necessary\&.
uk: Якщо вказано «replace» (типовий варіант), будь-яке конфліктне завдання у черзі у разі потреби буде замінено\&.

source: If "replace-irreversibly" is specified, operate like "replace", but also mark the new jobs as irreversible\&. This prevents future conflicting transactions from replacing these jobs (or even being enqueued while the irreversible jobs are still pending)\&. Irreversible jobs can still be cancelled using the B<cancel> command\&. This job mode should be used on any transaction which pulls in shutdown\&.target\&.
uk: Якщо вказано «replace-irreversibly», діяти, як для «replace», але також позначити нові завдання як непридатні до обернення\&. Це запобігає майбутнім конфліктним операціям з заміни цих завдань (або навіть додавання до черги таких операцій, доки непридатні до обернення завдання перебувають у черзі)\&. Непридатні до обернення завдання, попри це, можна скасувати за допомогою команди B<cancel>\&. Цим режимом завдання слід користуватися для будь-якої операції, яка включає shutdown\&.target\&.

source: "isolate" is only valid for start operations and causes all other units to be stopped when the specified unit is started\&. This mode is always used when the B<isolate> command is used\&.
uk: «isolate» є чинним лише для дій із запуску і спричиняє зупинення усіх інших модулів при запуску вказаного модуля\&. Цей режим завжди використовує команда B<isolate>\&.

source: "flush" will cause all queued jobs to be canceled when the new job is enqueued\&.
uk: «flush» спричиняє скасування усіх завдань з черги при додаванні нового завдання до черги\&.

source: If "ignore-dependencies" is specified, then all unit dependencies are ignored for this new job and the operation is executed immediately\&. If passed, no required units of the unit passed will be pulled in, and no ordering dependencies will be honored\&. This is mostly a debugging and rescue tool for the administrator and should not be used by applications\&.
uk: Якщо вказано «ignore-dependencies», усі залежності модулів буде проігноровано для цього нового завдання, і дію буде виконано негайно\&. Якщо передано у команді, для переданого модуля не викликатимуться потрібні для нього модулі, а залежності упорядковування не буде взято до уваги\&. Здебільшого, цей параметр призначено для діагностики та порятунку для адміністратора. Не слід користуватися ним у програмах\&.

source: "ignore-requirements" is similar to "ignore-dependencies", but only causes the requirement dependencies to be ignored, the ordering dependencies will still be honored\&.
uk: «ignore-requirements» є подібним до «ignore-dependencies», але спричиняє ігнорування лише вимог залежностей, залежності упорядковування буде взято до уваги\&.

source: "triggering" may only be used with B<systemctl stop>\&. In this mode, the specified unit and any active units that trigger it are stopped\&. See the discussion of I<Triggers=> in B<systemd.unit>(5) for more information about triggering units\&.
uk: «triggering» можна використовувати лише з B<systemctl stop>\&. У цьому режимі вказаний модуль і усі активні модулі, які увімкнули його, буде зупинено\&. Див. обговорення I<Triggers=> на сторінці підручника B<systemd.unit>(5), щоб дізнатися більше про вмикання модулів\&.

source: When enqueuing a unit job (for example as effect of a B<systemctl start> invocation or similar), show brief information about all jobs enqueued, covering both the requested job and any added because of unit dependencies\&. Note that the output will only include jobs immediately part of the transaction requested\&. It is possible that service start-up program code run as effect of the enqueued jobs might request further jobs to be pulled in\&. This means that completion of the listed jobs might ultimately entail more jobs than the listed ones\&.
uk: При додавання завдання модуля до черги обробки (наприклад, у результаті виклику B<systemctl start> або подібної команди) вивести короткі відомості щодо усіх завдань з черги, що стосуються одразу запитаного завдання та усіх завдань, які додано через залежності модуля\&. Зауважте, що до виведених даних буде включено лише завдання, які є безпосередньою частиною запитаної операції\&. Може так статися, що виконання програмного коду запуску служби у результаті виконання завдань з черги може потребувати подальшого запуску завдань\&. Це означає, що завершення виконання завдань зі списку може потребувати ширшого кола завдань, ніж буде виведено у списку\&.

source: Shorthand for B<--job-mode=>fail\&.
uk: Скорочення для B<--job-mode=>fail\&.

source: When used with the B<kill> command, if no units were killed, the operation results in an error\&.
uk: Якщо використано у поєднанні з командою B<kill>, результатом дії буде помилка, якщо не завершено роботу жодного модуля\&.

source: When system shutdown or sleep state is request, this option controls how to deal with inhibitor locks\&. It takes one of "auto", "yes" or "no"\&. Defaults to "auto", which will behave like "yes" for interactive invocations (i\&.e\&. from a TTY) and "no" for non-interactive invocations\&. "yes" will let the request respect inhibitor locks\&. "no" will let the request ignore inhibitor locks\&.
uk: Якщо надіслано запит щодо вимикання або присипляння системи, цей параметр керує тим, як працювати із блокуваннями уповільнення\&. Приймає одне з таких значень: «auto», «yes» або «no»\&. Типовим варіантом є «auto». Цей варіант працює як «yes» для інтерактивних викликів (тобто викликів з інтерактивного термінала) і «no» для неінтерактивних викликів\&. «yes» дозволить запиту брати до уваги блокування уповільнення\&. «no» дозволить запиту ігнорувати блокування уповільнення\&.

source: Applications can establish inhibitor locks to avoid that certain important operations (such as CD burning or suchlike) are interrupted by system shutdown or a sleep state\&. Any user may take these locks and privileged users may override these locks\&. If any locks are taken, shutdown and sleep state requests will normally fail (unless privileged) and a list of active locks is printed\&. However, if "no" is specified or "auto" is specified on a non-interactive requests, the established locks are ignored and not shown, and the operation attempted anyway, possibly requiring additional privileges\&. May be overridden by B<--force>\&.
uk: Програми можуть встановлювати блокування уповільнення для уникнення переривання вимиканням системи або станом сну певних важливих дій (зокрема процедури записування компакт-диска чи подібних операцій)\&. Створити ці блокування може будь-який користувач, а привілейовані користувачі можуть перевизначати ці блокування\&. Якщо визначено якесь блокування, запити щодо вимикання або присипляння, зазвичай, завершуватимуться помилкою (якщо користувач не є привілейованим) із виведенням списку активних блокувань\&. Втім, якщо вказано «no» або «auto» для неінтерактивних запитів, встановлені блокування буде проігноровано і не показано, а спробу виконання дії буде повторено, — можливо, знадобляться додаткові привілеї\&. Можна перевизначити за допомогою B<--force>\&.

source: Shortcut for B<--check-inhibitors=no>\&.
uk: Скорочення для B<--check-inhibitors=no>\&.

source: Just print what would be done\&. Currently supported by verbs B<halt>, B<poweroff>, B<reboot>, B<kexec>, B<suspend>, B<hibernate>, B<hybrid-sleep>, B<suspend-then-hibernate>, B<default>, B<rescue>, B<emergency>, and B<exit>\&.
uk: Просто вивести список дій\&. У поточній версії передбачено підтримку у командах B<halt>, B<poweroff>, B<reboot>, B<kexec>, B<suspend>, B<hibernate>, B<hybrid-sleep>, B<suspend-then-hibernate>, B<default>, B<rescue>, B<emergency> і B<exit>\&.

source: Suppress printing of the results of various commands and also the hints about truncated log lines\&. This does not suppress output of commands for which the printed output is the only result (like B<show>)\&. Errors are always printed\&.
uk: Придушити виведення результатів різноманітних команд, а також підказок щодо обрізаних рядків журналу\&. Це не може придушити виведення команд, для яких єдиним результатом роботи є виведення даних (подібних до B<show>)\&. Повідомлення про помилки виводяться завжди\&.

source: Do not synchronously wait for the requested operation to finish\&. If this is not specified, the job will be verified, enqueued and B<systemctl> will wait until the unit\*(Aqs start-up is completed\&. By passing this argument, it is only verified and enqueued\&. This option may not be combined with B<--wait>\&.
uk: Не очікувати синхронно на завершення запитаної дії\&. Якщо цього не вказано, завдання буде перевірено, додано до черги, а B<systemctl> очікуватиме, аж доки буде завершено запуск модуля\&. Якщо передано цей аргумент, завдання буде лише перевірено і додано до черги обробки\&. Цей параметр не можна поєднувати із B<--wait>\&.

source: Synchronously wait for started units to terminate again\&. This option may not be combined with B<--no-block>\&. Note that this will wait forever if any given unit never terminates (by itself or by getting stopped explicitly); particularly services which use "RemainAfterExit=yes"\&.
uk: Синхронно чекати на переривання запущених модулів знову\&. Цей параметр не можна поєднувати з B<--no-block>\&. Зауважте, що очікування буде необмеженим, якщо вказаний модуль не перерве роботи (самостійно або його не буде зупинено явним чином); подібний випадок може трапитися зі службами, у яких використано «RemainAfterExit=yes»\&.

source: When used with B<is-system-running>, wait until the boot process is completed before returning\&.
uk: Якщо використано з B<is-system-running>, очікувати на завершення процедури завантаження, перш ніж повертати керування\&.

source: Talk to the service manager of the calling user, rather than the service manager of the system\&.
uk: Обмінюватися даними із засобом керування службами користувача, який викликав команду, а не з засобом керування службами системи\&.

source: Talk to the service manager of the system\&. This is the implied default\&.
uk: Обмінюватися даними із загальносистемним засобом керування службами\&. Це неявний типовий варіант\&.

source: List units in failed state\&. This is equivalent to B<--state=failed>\&.
uk: Вивести список усіх модулів у стані помилки\&. Є еквівалентом B<--state=failed>\&.

source: Do not send wall message before halt, power-off and reboot\&.
uk: Не надсилати повідомлень на стіну перед перериванням, вимиканням і перезавантаженням\&.

source: When used with B<enable> and B<disable>, operate on the global user configuration directory, thus enabling or disabling a unit file globally for all future logins of all users\&.
uk: Якщо використано разом із B<enable> або B<disable>, працювати із загальним каталогом налаштувань користувачів, таким чином, вмикати або вимикати файл модуля на загальному рівні для усіх майбутніх входів до системи усіх користувачів\&.

source: When used with B<enable> and B<disable>, do not implicitly reload daemon configuration after executing the changes\&.
uk: Якщо використано разом із B<enable> або B<disable>, не перезавантажувати неявним чином налаштування фонових служб після внесення змін\&.

source: When used with B<start> and related commands, disables asking for passwords\&. Background services may require input of a password or passphrase string, for example to unlock system hard disks or cryptographic certificates\&. Unless this option is specified and the command is invoked from a terminal, B<systemctl> will query the user on the terminal for the necessary secrets\&. Use this option to switch this behavior off\&. In this case, the password must be supplied by some other means (for example graphical password agents) or the service might fail\&. This also disables querying the user for authentication for privileged operations\&.
uk: Якщо використано разом із B<start> та пов'язаними командами, вимикає запити щодо паролів\&. Базові служби можуть потребувати введення пароля або рядка ключа, наприклад, Для розблоковування дисків системи або сертифікатів шифрування\&. Якщо цей параметр не вказано, і команду викликано з термінала, B<systemctl> проситиме користувача ввести потрібні реєстраційні дані у терміналі\&. Скористайтеся цим параметром, щоб вимкнути цю поведінку\&. Якщо параметр вказано, пароль має бути надано у якийсь інший спосіб (наприклад, за допомогою графічних агентів введення пароля), інакше служба може завершити роботу із повідомленням про помилку\&. Крім того, цей параметр вимикає запити щодо розпізнавання користувача для виконання привілейованих дій\&.

source: When used with B<kill>, choose which processes to send a signal to\&. Must be one of B<main>, B<control> or B<all> to select whether to kill only the main process, the control process or all processes of the unit\&. The main process of the unit is the one that defines the life-time of it\&. A control process of a unit is one that is invoked by the manager to induce state changes of it\&. For example, all processes started due to the I<ExecStartPre=>, I<ExecStop=> or I<ExecReload=> settings of service units are control processes\&. Note that there is only one control process per unit at a time, as only one state change is executed at a time\&. For services of type I<Type=forking>, the initial process started by the manager for I<ExecStart=> is a control process, while the process ultimately forked off by that one is then considered the main process of the unit (if it can be determined)\&. This is different for service units of other types, where the process forked off by the manager for I<ExecStart=> is always the main process itself\&. A service unit consists of zero or one main process, zero or one control process plus any number of additional processes\&. Not all unit types manage processes of these types however\&. For example, for mount units, control processes are defined (which are the invocations of /usr/bin/mount and /usr/bin/umount), but no main process is defined\&. If omitted, defaults to B<all>\&.
uk: Якщо використано разом із B<kill>, визначає, яким процесам слід надіслати сигнал\&. Має бути одним з таких значень: B<main>, B<control> або B<all> — для вибору того, слід припинити роботу основного процесу, процесу керування або усіх процесів модуля\&.Основним процесом модуля є процес, який визначає його термін роботи\&. Процесом керування модуля є процес, який було викликано засобом керування для виконання змін стану модуля\&. Наприклад, усі процеси, які запущено через використання параметрів I<ExecStartPre=>, I<ExecStop=> або I<ExecReload=> модулів служб, є процесами керування\&. Зауважте, що одночасно у кожного модуля може бути лише один процес керування, оскільки одночасно можна виконувати лише одну зміну стану\&. Для служб типу I<Type=forking>, процесом керування є початковий процес, який запущено засобом керування для I<ExecStart=>, а повністю відгалужений від нього процес вже буде розглядатися як основний процес модуля (якщо його можна визначити)\&. У цьому відмінність від модулів служб інших типів, де відгалужений засобом керування процес для I<ExecStart=> є завжди самим по собі основним процесом\&. Модуль служби складається з нуля або одного основного процесу, нуля або одного процесу керування і будь-якої кількості додаткових процесів\&. Втім, процесами цих типів керують не усі типи модулів\&. Наприклад, для модулів монтування визначено процеси керування (ними є виклики /usr/bin/mount і /usr/bin/umount), але основного процесу не визначено\&. Якщо не вказано, типовим варіантом є B<all>\&.

source: When used with B<kill>, choose which signal to send to selected processes\&. Must be one of the well-known signal specifiers such as B<SIGTERM>, B<SIGINT> or B<SIGSTOP>\&. If omitted, defaults to B<SIGTERM>\&.
uk: Якщо використано разом із B<kill>, вибрати, який сигнал буде надіслано до вибраних процесів\&. Має бути один із відомих специфікаторів сигналів, зокрема B<SIGTERM>, B<SIGINT> або B<SIGSTOP>\&. Якщо не вказано, типовим є сигнал B<SIGTERM>\&.

source: The special value "help" will list the known values and the program will exit immediately, and the special value "list" will list known values along with the numerical signal numbers and the program will exit immediately\&.
uk: Використання особливого значення «help» призведе до виведення списку відомих значень і негайного виходу з програми, а особливого значення «list» — до списку відомих значень разом із числовими номерами сигналів і негайного виходу з програми\&.

source: Select what type of per-unit resources to remove when the B<clean> command is invoked, see below\&. Takes one of B<configuration>, B<state>, B<cache>, B<logs>, B<runtime> to select the type of resource\&. This option may be specified more than once, in which case all specified resource types are removed\&. Also accepts the special value B<all> as a shortcut for specifying all five resource types\&. If this option is not specified defaults to the combination of B<cache> and B<runtime>, i\&.e\&. the two kinds of resources that are generally considered to be redundant and can be reconstructed on next invocation\&.
uk: Вибрати тип ресурсів окремих модулів, які слід вилучити при виклику команди B<clean>, див. нижче\&. Приймає одне з таких значень: B<configuration>, B<state>, B<cache>, B<logs>, B<runtime>, — для вибору типу ресурсу\&. Цей параметр можна вказувати декілька разів — буде вилучено ресурси усіх вказаних типів\&. Також приймає особливе значення B<all>, як скорочення для визначення ресурсів усіх п'яти типів\&. Якщо цей параметр не вказано, типовою є комбінації B<cache> і B<runtime>, тобто двох типів ресурсів, які, загалом, вважаються зайвими і можуть бути відтворені під час наступного виклику\&.

source: When used with B<enable>, overwrite any existing conflicting symlinks\&.
uk: Якщо використано у поєднанні із B<enable>, перезаписати усі наявні конфліктні символічні посилання\&.

source: When used with B<edit>, create all of the specified units which do not already exist\&.
uk: Якщо використано разом із B<edit>, створити усі вказані модулі, яких ще не існує\&.
