Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: When used with B<halt>, B<poweroff>, B<reboot> or B<kexec>, execute the selected operation without shutting down all units\&. However, all processes will be killed forcibly and all file systems are unmounted or remounted read-only\&. This is hence a drastic but relatively safe option to request an immediate reboot\&. If B<--force> is specified twice for these operations (with the exception of B<kexec>), they will be executed immediately, without terminating any processes or unmounting any file systems\&. Warning: specifying B<--force> twice with any of these operations might result in data loss\&. Note that when B<--force> is specified twice the selected operation is executed by B<systemctl> itself, and the system manager is not contacted\&. This means the command should succeed even when the system manager has crashed\&.
uk: Якщо використано разом із B<halt>, B<poweroff>, B<reboot> або B<kexec>, виконати вибрану дію без завершення роботи усіх модулів\&. Втім, усі процеси буде завершено у примусовому режимі, а усі файлові системи буде демонтовано або повторно змонтовано у режимі лише читання\&. Отже, це доволі сильнодійний, але відносно безпечний спосіб надсилання запиту щодо негайного перезавантаження\&. Якщо B<--force> вказано двічі для цих дій (окрім B<kexec>), їх буде виконано негайно, без переривання будь-яких процесів і демонтування будь-яких файлових систем\&. Попередження: подвійне вказування B<--force> із будь-якою з цих дій може призвести до втрати даних\&. Зауважте, що якщо B<--force> вказано двічі, вибрану дію буде виконано самою програмою B<systemctl>, а обмін даними із загальносистемним засобом керування не встановлюватиметься\&. Це означає, що програма має завершити роботу успішно, навіть якщо загальносистемний засіб керування завершить роботу в аварійному режимі\&.

source: When used with B<halt>, B<poweroff> or B<reboot>, set a short message explaining the reason for the operation\&. The message will be logged together with the default shutdown message\&.
uk: Якщо використано разом із B<halt>, B<poweroff> or B<reboot>, встановити коротке повідомлення, яке пояснюватиме причину дії\&. Повідомлення буде записано до журналу разом із типовим повідомленням про завершення роботи\&.

source: When used with B<enable>, the units will also be started\&. When used with B<disable> or B<mask>, the units will also be stopped\&. The start or stop operation is only carried out when the respective enable or disable operation has been successful\&.
uk: Якщо використано разом з B<enable>, модулі також буде запущено\&. Якщо використано разом із B<disable> або B<mask>, модулі також буде зупинено\&. Дії із запуску або зупинення будбе виконано, лише якщо відповідні дії вмикання або вимикання були успішними\&.

source: When used with B<enable>/B<disable>/B<is-enabled> (and related commands), use the specified root path when looking for unit files\&. If this option is present, B<systemctl> will operate on the file system directly, instead of communicating with the B<systemd> daemon to carry out changes\&.
uk: Якщо використано разом із B<enable>/B<disable>/B<is-enabled> (і пов'язаними командами), використати вказаний шлях до кореневої теки при пошуку файлів модулів\&. Якщо вказано цей параметр, B<systemctl> працюватиме із файловою системою безпосередньо, замість обміну даними з фоновою службою B<systemd> для внесення змін\&.

source: When used with B<enable>, B<disable>, B<edit>, (and related commands), make changes only temporarily, so that they are lost on the next reboot\&. This will have the effect that changes are not made in subdirectories of /etc/ but in /run/, with identical immediate effects, however, since the latter is lost on reboot, the changes are lost too\&.
uk: Якщо використано разом із B<enable>, B<disable>, B<edit> (і пов'язаними командами), вносити зміни лише тимчасово, щоб їх було скасовано під час наступного перезавантаження системи\&. Це стосуватиметься тих змін, які не було внесено до підкаталогів /etc/, а лише до /run/, втім, із ідентичними результатами, оскільки останні буде втрачено під час перезавантаження системи, а отже, буде втрачено і зміни\&.

source: Similarly, when used with B<set-property>, make changes only temporarily, so that they are lost on the next reboot\&.
uk: Так само, при використанні разом із B<set-property>, внести зміни лише тимчасово, так, щоб їх було скасовано під час наступного перезавантаження системи\&.

source: Takes one of "full" (the default), "enable-only", "disable-only"\&. When used with the B<preset> or B<preset-all> commands, controls whether units shall be disabled and enabled according to the preset rules, or only enabled, or only disabled\&.
uk: Приймає одне з таких значень: «full» (типовий варіант), «enable-only» (лише увімкнути), «disable-only» (лише вимкнути)\&. Якщо використано разом із командами B<preset> та B<preset-all>, керує тим, чи модулі має бути вимкнено і увімкнено відповідно до правил набору параметрів, чи має бути лише увімкнено, чи має бути лише вимкнено\&.

source: When used with B<status>, controls the number of journal lines to show, counting from the most recent ones\&. Takes a positive integer argument, or 0 to disable journal output\&. Defaults to 10\&.
uk: Якщо використано разом із B<status>, керує кількістю виведених рядків журналу, із відліком від найсвіжіших\&. Приймає додатний цілий аргумент або 0 для вимикання виведення з журналу\&. Типовим є значення 10\&.

source: When used with B<status>, controls the formatting of the journal entries that are shown\&. For the available choices, see B<journalctl>(1)\&. Defaults to "short"\&.
uk: Якщо використано разом із B<status>, керує форматуванням виведених записів журналу\&. Доступні варіанти описано на сторінці підручника щодо B<journalctl>(1)\&. Типовим є варіант «short»\&.

source: When used with the B<reboot> command, indicate to the system\*(Aqs firmware to reboot into the firmware setup interface\&. Note that this functionality is not available on all systems\&.
uk: Якщо використано разом із командою B<reboot>, вказати мікропрограмі системи, що перезавантаження слід виконати до інтерфейсу налаштовування мікропрограми\&. Зауважте, що скористатися цією можливістю можна не в усіх системах\&.

source: B<--boot-loader-menu=>I<timeout>
uk: B<--boot-loader-menu=>I<час очікування>

source: When used with the B<reboot> command, indicate to the system\*(Aqs boot loader to show the boot loader menu on the following boot\&. Takes a time value as parameter \(em indicating the menu timeout\&. Pass zero in order to disable the menu timeout\&. Note that not all boot loaders support this functionality\&.
uk: Якщо використано разом із командою B<reboot>, вказати засобу завантаження системи, що під час наступного завантаження слід показати меню завантаження\&. Приймає значення часу як параметр, який вказує час очікування меню на реакцію користувача\&. Передайте нульове значення, щоб вимкнути час очікування меню\&. Зауважте, що підтримку цієї можливості передбачено не в усіх засобах завантаження системи\&.

source: B<--boot-loader-entry=>I<ID>
uk: B<--boot-loader-entry=>I<ідентифікатор>

source: When used with the B<reboot> command, indicate to the system\*(Aqs boot loader to boot into a specific boot loader entry on the following boot\&. Takes a boot loader entry identifier as argument, or "help" in order to list available entries\&. Note that not all boot loaders support this functionality\&.
uk: Якщо використано разом із командою B<reboot>, вказує, що під час наступного завантаження системи засіб завантаження має завантажити вказаний запис завантаження\&. Приймає ідентифікатор запису засобу завантаження як аргумент або «help», якщо потрібно вивести список доступних записів\&. Зауважте, що підтримку цієї можливості передбачено не в усіх засобах завантаження системи\&.

source: This switch is used with B<reboot>\&. The value is architecture and firmware specific\&. As an example, "recovery" might be used to trigger system recovery, and "fota" might be used to trigger a \(lqfirmware over the air\(rq update\&.
uk: Цей перемикач використовують разом із B<reboot>\&. Значенням залежить від архітектури і мікропрограми\&. Наприклад, можна скористатися «recovery» для ініціювання відновлення системи, і «fota» для ініціювання оновлення мікропрограми «повітрям»\&.

source: When used with B<list-dependencies>, B<list-units> or B<list-machines>, the output is printed as a list instead of a tree, and the bullet circles are omitted\&.
uk: Якщо використано разом із B<list-dependencies>, B<list-units> or B<list-machines>, виведені дані буде показано як список, а не як ієрархію, а крапки для пунктів буде прибрано\&.

source: Change the format of printed timestamps\&. The following values may be used:
uk: Змінити формат виведених часових позначок\&. Можна використовувати такі значення:

source: B<pretty> (this is the default)
uk: B<pretty> (типовий варіант)

source: Day YYYY-MM-DD HH:MM:SS TZ
uk: День РРРР-ММ-ДД ГГ:ХХ:СС ЧП

source: Day YYYY-MM-DD HH:MM:SS\&.UUUUUU TZ
uk: День РРРР-ММ-ДД ГГ:ХХ:СС\&.ДДДДДДД ЧП

source: Day YYYY-MM-DD HH:MM:SS UTC
uk: День РРРР-ММ-ДД ГГ:ХХ:СС UTC

source: Day YYYY-MM-DD HH:MM:SS\&.UUUUUU UTC
uk: День РРРР-ММ-ДД ГГ:ХХ:СС\&.ДДДДДД UTC

source: When used with B<bind>, creates the destination file or directory before applying the bind mount\&. Note that even though the name of this option suggests that it is suitable only for directories, this option also creates the destination file node to mount over if the object to mount is not a directory, but a regular file, device node, socket or FIFO\&.
uk: Якщо використано разом із B<bind>, створює файл або каталог призначення до застосування монтування із прив'язкою\&. Зауважте, що хоча за назвою цього параметра можна припустити, що він застосовний лише до каталогів, у результаті використання цього параметра також буде створено вузол файла призначення для монтування, якщо об'єктом монтування є не каталог, а звичайний файл, вузол пристрою, сокет або FIFO\&.

source: Only allowed with B<reload-or-restart>\&. Enqueues restart jobs for all units that have the "needs-restart" mark, and reload jobs for units that have the "needs-reload" mark\&. When a unit marked for reload does not support reload, restart will be queued\&. Those properties can be set using B<set-property Marks>\&.
uk: Можна використовувати лише разом із B<reload-or-restart>\&. Ставить у чергу усі завдання з перезапуску для усіх модулів, які позначено як «needs-restart», і перезавантажує завдання для модулів, які позначено як «needs-reload»\&. Якщо для модуля, який позначено для перезавантаження, не передбачено підтримки перезавантаження, до черги буде поставлено перезапуск\&. Встановити відповідні властивості модулів можна за допомогою B<позначок set-property>\&.

source: Unless B<--no-block> is used, B<systemctl> will wait for the queued jobs to finish\&.
uk: Якщо не використано B<--no-block>, B<systemctl> чекатиме на завершення завдань з черги\&.

source: When used with B<bind>, creates a read-only bind mount\&.
uk: Якщо використано разом із B<bind>, створює придатне лише для читання монтування прив'язки\&.

source: Execute the operation remotely\&. Specify a hostname, or a username and hostname separated by "@", to connect to\&. The hostname may optionally be suffixed by a port ssh is listening on, separated by ":", and then a container name, separated by "/", which connects directly to a specific container on the specified host\&. This will use SSH to talk to the remote machine manager instance\&. Container names may be enumerated with B<machinectl -H >I<HOST>\&. Put IPv6 addresses in brackets\&.
uk: Виконати дію віддалено\&. Вкажіть назву вузла або відокремлені символом «@» ім'я користувача і назву вузла, з якими слід встановити з'єднання\&. До назви вузла можна дописати суфікс порту, на якому очікуватиме на з'єднання ssh. Суфікс має бути відокремлено двокрапкою\&. Далі, можна вказати назву контейнера, відокремлену «/», яка вказуватиме що з'єднання слід встановити безпосередньо із вказаним контейнером на вказаному вузлі\&. Для обміну даними із екземпляром засобу керування на віддаленому комп'ютері буде використано SSH\&. Назви контейнерів можна нумерувати за допомогою B<machinectl -H >I<ВУЗОЛ>\&. Адреси IPv6 слід брати у квадратні дужки\&.

source: Execute operation on a local container\&. Specify a container name to connect to, optionally prefixed by a user name to connect as and a separating "@" character\&. If the special string "\&.host" is used in place of the container name, a connection to the local system is made (which is useful to connect to a specific user\*(Aqs user bus: "--user --machine=lennart@\&.host")\&. If the "@" syntax is not used, the connection is made as root user\&. If the "@" syntax is used either the left hand side or the right hand side may be omitted (but not both) in which case the local user name and "\&.host" are implied\&.
uk: Виконати дію у локальному контейнері\&. Вкажіть назву контейнера, з якими слід встановити з'єднання, із необов'язковим префіксом імені користувача, який слід відокремити від назви контейнера символом «@»\&. Якщо замість контейнера використати особливий рядок «\&.host», буде встановлено з'єднання із локальною системою (це корисно для встановлення з'єднання із каналом даних певного користувача: «--user --machine=lennart@\&.host»)\&. Якщо не буде використано синтаксичної конструкції із «@», буде встановлено з'єднання від імені користувача root\&. Якщо використано «@», ліву чи праву частину синтаксичного виразу навколо нього може бути пропущено (але не обидві частини). У цьому випадку неявно буде використано ім'я локального користувача і «\&.host», відповідно\&.

source: Do not pipe output into a pager\&.
uk: Не передавати виведені дані до засобу поділу на сторінки\&.

source: B<--legend=>I<BOOL>
uk: B<--legend=>I<булеве значення>

source: Enable or disable printing of the legend, i\&.e\&. column headers and the footer with hints\&. The legend is printed by default, unless disabled with B<--quiet> or similar\&.
uk: Увімкнути або вимкнути виведення умовних позначень, тобто стовпчика заголовків та нижнього колонтитула із підказками\&. Типово, умовні позначення буде виведено, якщо їх не вимкнено за допомогою B<--quiet> або подібного параметра\&.

source: Print a short help text and exit\&.
uk: Вивести короткий текст довідки і завершити роботу\&.

source: Print a short version string and exit\&.
uk: Вивести короткі дані щодо версії і завершити роботу\&.

source: EXIT STATUS
uk: СТАН ВИХОДУ

source: On success, 0 is returned, a non-zero failure code otherwise\&.
uk: Якщо команду буде виконано успішно, буде повернуто 0; в інших випадках, буде повернуто ненульовий код помилки\&.

source: B<systemctl> uses the return codes defined by LSB, as defined in \m[blue]B<LSB 3\&.0\&.0>\m[]\&\s-2\u[1]\d\s+2\&.
uk: У B<systemctl> використано коди повернення, які визначено LSB, зокрема у \m[blue]B<LSB 3\&.0\&.0>\m[]\&\s-2\u[1]\d\s+2\&.

source: B<Table\ \&3.\ \&LSB return codes>
uk: B<Таблиця\ \&3.\ \&Коди повернення LSB>

source: Value
uk: Значення

source: Description in LSB
uk: Опис у LSB

source: Use in systemd
uk: Використання у systemd

source: program is running or service is OK
uk: програма працює або служба працює нормально

source: unit is active
uk: модуль є активним

source: program is dead and /var/run pid file exists
uk: програма «вмерла» і файл pid у /var/run існує

source: unit I<not> failed (used by B<is-failed>)
uk: виконання модуля I<не> завершилося помилкою (використовується B<is-failed>)

source: program is dead and /var/lock lock file exists
uk: програма «вмерла», і існує файл блокування у /var/lock

source: unused
uk: не використовується

source: program is not running
uk: програму не запущено

source: unit is not active
uk: модуль не є активним

source: program or service status is unknown
uk: стан програми або служби є невідомим

source: no such unit
uk: Немає такого модуля

source: The mapping of LSB service states to systemd unit states is imperfect, so it is better to not rely on those return values but to look for specific unit states and substates instead\&.
uk: Відповідність між станами служб у LSB та станами модулів systemd не є ідеальною, тому краще не покладатися на ці повернуті значення, а звернутися до станів певного модуля і підмодулів\&.

source: ENVIRONMENT
uk: СЕРЕДОВИЩЕ

source: Editor to use when editing units; overrides I<$EDITOR> and I<$VISUAL>\&. If neither I<$SYSTEMD_EDITOR> nor I<$EDITOR> nor I<$VISUAL> are present or if it is set to an empty string or if their execution failed, systemctl will try to execute well known editors in this order: B<editor>(1), B<nano>(1), B<vim>(1), B<vi>(1)\&.
uk: Редактор, яким слід скористатися для редагування модулів; має пріоритет над I<$EDITOR> і I<$VISUAL>\&. Якщо не вказано жодного зі значень I<$SYSTEMD_EDITOR>, I<$EDITOR> або I<$VISUAL>, або якщо вказано порожні значення або не вдається запустити жоден із вказаних редакторів, systemctl спробує запустити відомі редактори у такому порядку: B<editor>(1), B<nano>(1), B<vim>(1), B<vi>(1)\&.

source: The maximum log level of emitted messages (messages with a higher log level, i\&.e\&. less important ones, will be suppressed)\&. Either one of (in order of decreasing importance) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, or an integer in the range 0\&...7\&. See B<syslog>(3) for more information\&.
uk: Максимальний рівень журналювання виданих повідомлень (повідомлення із вищим рівнем журналювання, тобто менш важливі, буде придушено)\&. Одне з таких значень (у порядку зменшення важливості): B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, або ціле число у діапазоні 0\&...7\&. Див. B<syslog>(3), щоб дізнатися більше\&.

source: A boolean\&. If true, messages written to the tty will be colored according to priority\&.
uk: Булеве значення\&. Якщо істинне, повідомлення, які записано до термінал, буде розфарбовано за пріоритетністю\&.

source: This setting is only useful when messages are written directly to the terminal, because B<journalctl>(1) and other tools that display logs will color messages based on the log level on their own\&.
uk: Цей параметр є корисним, лише якщо повідомлення буде записано безпосередньо до термінала, оскільки B<journalctl>(1) та інші інструменти для показу журналу розфарбовуватимуть повідомлення на основі рівня журналювання власними засобами\&.

source: A boolean\&. If true, console log messages will be prefixed with a timestamp\&.
uk: Булеве значення\&. Якщо істинне, до повідомлень журналу у консолі буде додано префікс із часової позначки\&.

source: This setting is only useful when messages are written directly to the terminal or a file, because B<journalctl>(1) and other tools that display logs will attach timestamps based on the entry metadata on their own\&.
uk: Цей параметр є корисним, лише якщо повідомлення буде записано безпосередньо до термінала або файла, оскільки B<journalctl>(1) та інші інструменти для показу журналу додаватимуть часові позначки на основі метаданих запису власними засобами\&.

source: A boolean\&. If true, messages will be prefixed with a filename and line number in the source code where the message originates\&.
uk: Булеве значення\& Якщо істинне, до повідомлень журналу буде додано префікс із назви файла і номера рядка у початковому коді, звідки походить повідомлення\&.

source: Note that the log location is often attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
uk: Зауважте, що часто до записів журналу все одно буде дописано розташування журналу\&. Тим не менше, включення його безпосередньо до тексту повідомлення може бути зручним для діагностичних програм\&.

source: The destination for log messages\&. One of B<console> (log to the attached tty), B<console-prefixed> (log to the attached tty but with prefixes encoding the log level and "facility", see B<syslog>(3), B<kmsg> (log to the kernel circular log buffer), B<journal> (log to the journal), B<journal-or-kmsg> (log to the journal if available, and to kmsg otherwise), B<auto> (determine the appropriate log target automatically, the default), B<null> (disable log output)\&.
uk: Призначення для повідомлень журналу\&. Одне з таких значень: B<console> (виводити повідомлення до долученого термінала), B<console-prefixed> (виводити повідомлення до долученого термінала, але із префіксом, де закодовано рівень журналювання і «процес», див\&. B<syslog>(3), B<kmsg> (виводити повідомлення до циклічного буфера журналу ядра), B<journal> (виводити повідомлення до журналу), B<journal-or-kmsg> (виводити повідомлення до журналу, якщо він доступний, і до kmsg, якщо недоступний), B<auto> (визначити відповідне призначення повідомлень журналу автоматично, типовий варіант), B<null> (вимкнути виведення повідомлень)\&.

source: Pager to use when B<--no-pager> is not given; overrides I<$PAGER>\&. If neither I<$SYSTEMD_PAGER> nor I<$PAGER> are set, a set of well-known pager implementations are tried in turn, including B<less>(1) and B<more>(1), until one is found\&. If no pager implementation is discovered no pager is invoked\&. Setting this environment variable to an empty string or the value "cat" is equivalent to passing B<--no-pager>\&.
uk: Засіб показу сторінок, яким слід скористатися, якщо не вказано B<--no-pager>; перевизначає I<$PAGER>\&. Якщо не встановлено ні I<$SYSTEMD_PAGER>, ні I<$PAGER>, буде виконано спробу скористатися відомими реалізаціями послідовно, включно з B<less>(1) і B<more>(1), аж доки не буде щось знайдено\&. Якщо не буде виявлено реалізації засобу показу сторінок, засіб показу сторінок викликано не буде\&. Встановлення для значення цієї змінної середовища порожнього рядка або значення «cat» є еквівалентом передавання параметра B<--no-pager>\&.

source: Note: if I<$SYSTEMD_PAGERSECURE> is not set, I<$SYSTEMD_PAGER> (as well as I<$PAGER>) will be silently ignored\&.
uk: Зауваження: якщо не встановлено значення I<$SYSTEMD_PAGERSECURE>, буде без попередження проігноровано I<$SYSTEMD_PAGER> (а також I<$PAGER>)\&.

source: Override the options passed to B<less> (by default "FRSXMK")\&.
uk: Перевизначає параметри, які буде передано B<less> (типово, «FRSXMK»)\&.

source: Users might want to change two options in particular:
uk: Користувачам, можливо, варто змінити два параметри:

source: This option instructs the pager to exit immediately when Ctrl+C is pressed\&. To allow B<less> to handle Ctrl+C itself to switch back to the pager command prompt, unset this option\&.
uk: Цей параметр наказує засобу поділу на сторінки негайно завершити роботу, якщо натиснуто Ctrl+C\&. Щоб дозволити B<less> обробляти Ctrl+C самостійно для перемикання назад на запит команди засобу, скасуйте встановлення цього параметра\&.

source: If the value of I<$SYSTEMD_LESS> does not include "K", and the pager that is invoked is B<less>, Ctrl+C will be ignored by the executable, and needs to be handled by the pager\&.
uk: Якщо значення I<$SYSTEMD_LESS> не включає «K», і викликаним засобом поділу на сторінки є B<less>, Ctrl+C буде проігноровано виконуваним файлом — його має обробляти сам засіб поділу на сторінки\&.
