Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: Bind mount a file or directory from the host into the container\&. Takes one of: a path argument\ \&\(em in which case the specified path will be mounted from the host to the same path in the container, or a colon-separated pair of paths\ \&\(em in which case the first specified path is the source in the host, and the second path is the destination in the container, or a colon-separated triple of source path, destination path and mount options\&. The source path may optionally be prefixed with a "+" character\&. If so, the source path is taken relative to the image\*(Aqs root directory\&. This permits setting up bind mounts within the container image\&. The source path may be specified as empty string, in which case a temporary directory below the host\*(Aqs /var/tmp/ directory is used\&. It is automatically removed when the container is shut down\&. The B<--bind-ro=> option creates read-only bind mounts\&. Backslash escapes are interpreted, so "\e:" may be used to embed colons in either path\&. This option may be specified multiple times for creating multiple independent bind mount points\&.
de: Hängt eine Datei oder ein Verzeichnis vom Rechner in den Container mit bind ein\&. Akzeptiert entweder ein Pfad-Argument (dann wird der angegebene Pfad vom Rechner zum gleichen Pfad im Container eingehängt), ein durch Doppelpunkt getrenntes Paar von Pfaden (dann wird der zuerst angegebene Pfad als Quelle auf dem Rechner und der zweite Pfad als Ziel im Container verwandt) oder ein Doppelpunkt-getrenntes Tripel von Quellpfad, Zielpfad und Einhängeoptionen\&. Dem Quellpfad darf optional ein »+«-Zeichen vorangestellt werden\&. In diesem Fall wird der Quellpfad relativ zum Wurzelverzeichnis des Containers betrachtet\&. Damit wird die Einrichtung von bind-Einhängungen innerhalb des Container-Abbildes ermöglicht\&. Der Quellpfad kann als leere Zeichenkette angegeben werden\&. Dann wird ein temporäres Verzeichnis unterhalb von /var/tmp/ im Rechner verwandt\&. Dieses wird beim Herunterfahren des Containers automatisch entfernt\&. Die Option B<--bind-ro=> erstellt nur-lesbare Bind-Einhängungen\&. Maskierungen durch Rückwärtsschrägstriche werden interpretiert, so kann »\e:« verwandt werden, um Doppelpunkte in Pfade einzubetten\&. Diese Option kann mehrfach verwandt werden, um mehrere unabhängige bind-Einhängepunkte zu erzeugen\&.

source: Mount options are comma-separated\&. B<rbind> and B<norbind> control whether to create a recursive or a regular bind mount\&. Defaults to "rbind"\&. B<idmap> and B<noidmap> control if the bind mount should use filesystem id mappings\&. Using this option requires support by the source filesystem for id mappings\&. Defaults to "noidmap"\&.
de: Einhängeoptionen werden durch Kommata getrennt\&. B<rbind> und B<norbind> steuern, ob eine rekursive oder eine reguläre Bind-Einhängung erstellt wird\&. Standardmäßig »rbind«\&. B<idmap> und B<noidmap> steuern, ob die Bind-Einhängung die Dateisystemkennungsabbildungen verwenden soll\&. Um diese Option zu verwenden, wird die Unterstützung durch das Quelldateisystem für Kennungsabbildungen benötigt\&. Standardmäßig »noidmap«\&.

source: Note that when this option is used in combination with B<--private-users>, the resulting mount points will be owned by the B<nobody> user\&. That\*(Aqs because the mount and its files and directories continue to be owned by the relevant host users and groups, which do not exist in the container, and thus show up under the wildcard UID 65534 (nobody)\&. If such bind mounts are created, it is recommended to make them read-only, using B<--bind-ro=>\&. Alternatively you can use the "idmap" mount option to map the filesystem ids\&.
de: Beachten Sie, dass die entstehenden Einhängepunkte dem Benutzer B<nobody> gehören werden, falls dies in Kombination mit B<--private-users> verwandt wird\&. Dies ist der Fall, da die Einhängung und deren Dateien und Verzeichnisse weiterhin dem relevanten Benutzer und der relevanten Gruppe des Rechners gehören, die im Container nicht existieren, und daher unter der Joker-UID 65534 (nobody) erscheinen\&. Falls solche bind-Einhängungen erstellt werden, wird empfohlen, diese mit B<--bind-ro=> nur-lesbar zu machen\&. Alternativ können Sie die Einhängeoption »idmap« verwenden, um die Dateisystemkennungen abzubilden\&.

source: Binds the home directory of the specified user on the host into the container\&. Takes the name of an existing user on the host as argument\&. May be used multiple times to bind multiple users into the container\&. This does three things:
de: Bindet das Home-Verzeichnis des angegebenen Benutzers auf dem Rechner in den Container\&. Akzeptiert den Namen eines bestehenden Benutzers auf dem Rechner als Argument\&. Kann mehrfach verwandt werden, um mehrere Benutzer in den Container zu binden\&. Dies macht drei Dinge:

source: The user\*(Aqs home directory is bind mounted from the host into /run/hosts/home/\&.
de: Das Home-Verzeichnis des Benutzers wird vom Rechner in /run/hosts/home/ bind-eingehängt\&.

source: An additional UID/GID mapping is added that maps the host user\*(Aqs UID/GID to a container UID/GID, allocated from the 60514\&...60577 range\&.
de: Eine zusätzliche UID/GID-Abbildung wird hinzugefügt, die die UID/GID des Benutzers des Rechners auf die UID/GID des Containers abbildet, ausgewählt aus dem Bereich 60514…...60577\&.

source: A JSON user and group record is generated in /run/userdb/ that describes the mapped user\&. It contains a minimized representation of the host\*(Aqs user record, adjusted to the UID/GID and home directory path assigned to the user in the container\&. The B<nss-systemd>(8) glibc NSS module will pick up these records from there and make them available in the container\*(Aqs user/group databases\&.
de: Ein JSON-Benutzer- und -Gruppendatensatz wird in /run/userdb/ erstellt, der die abgebildeten Benutzer beschreibt\&. Er enthält eine minimale Darstellung des Benutzerdatensatzes des Rechners, angepasst auf die UID/GID und den Home-Verzeichnispfad, der dem Benutzer in dem Container zugeordnet ist\&. Das Glibc-NSS-Modul B<nss-systemd>(8) wird diese Datensätze dort aufnehmen und sie in den Benutzer-/Gruppendatenbanken des Containers zur Verfügung stellen\&.

source: The combination of the three operations above ensures that it is possible to log into the container using the same account information as on the host\&. The user is only mapped transiently, while the container is running, and the mapping itself does not result in persistent changes to the container (except maybe for log messages generated at login time, and similar)\&. Note that in particular the UID/GID assignment in the container is not made persistently\&. If the user is mapped transiently, it is best to not allow the user to make persistent changes to the container\&. If the user leaves files or directories owned by the user, and those UIDs/GIDs are reused during later container invocations (possibly with a different B<--bind-user=> mapping), those files and directories will be accessible to the "new" user\&.
de: Die Kombination der obigen drei Aktionen stellt sicher, dass es möglich ist, sich an dem Container mit den gleichen Konto-Informationen wie auf dem Rechner anzumelden\&. Der Benutzer wird nur flüchtig während der Container betrieben wird abgebildet und die Abbildung selbst führt nicht zu dauerhaften Änderungen im Container (außer vielleicht für erstellte Protokollmeldungen zum Anmeldezeitpunkt und ähnlichem)\&. Beachten Sie, dass insbesondere die UID/GID-Zuweisung im Container nicht dauerhaft erfolgt\&. Falls der Benutzer flüchtig abgebildet wird, ist es am besten, dem Benutzer keine Änderungen an dem Container zu erlauben\&. Falls der Benutzer Dateien oder Verzeichnisse, die ihm gehören, in dem Container zurücklässt und diese UIDs/GIDs während späterer Container-Aufrufe erneut verwandt werden (möglicherweise mit einer anderen B<--bind-user=>-Abbildung), dann kann der »neu« Benutzer nicht auf diese Dateien und Verzeichnisse zugreifen\&.

source: The user/group record mapping only works if the container contains systemd 249 or newer, with B<nss-systemd> properly configured in nsswitch\&.conf\&. See B<nss-systemd>(8) for details\&.
de: Die Benutzer-/Gruppen-Datensatz-Zuordnung funktioniert nur, falls der Container Systemd 249 oder neuer enthält und B<nss-systemd> korrekt in nsswitch\&.conf konfiguriert ist\&. Siehe B<nss-systemd>(8) für Details\&.

source: Note that the user record propagated from the host into the container will contain the UNIX password hash of the user, so that seamless logins in the container are possible\&. If the container is less trusted than the host it\*(Aqs hence important to use a strong UNIX password hash function (e\&.g\&. yescrypt or similar, with the "$y$" hash prefix)\&.
de: Beachten Sie, dass der vom Rechner in den Container ausgebreitete Benutzerdatensatz den UNIX-Passwort-Hash des Benutzers enthalten wird, so dass nahtlose Anmeldungen in dem Container möglich sind\&. Falls dem Container weniger als dem Rechner vertraut wird, ist es daher wichtig, eine starke UNIX-Passwort-Hash-Funktion zu verwenden (z\&.B\&. yescrypt oder ähnlich, mit dem Hash vorangestelltem »$y$«)\&.

source: When binding a user from the host into the container checks are executed to ensure that the username is not yet known in the container\&. Moreover, it is checked that the UID/GID allocated for it is not currently defined in the user/group databases of the container\&. Both checks directly access the container\*(Aqs /etc/passwd and /etc/group, and thus might not detect existing accounts in other databases\&.
de: Beim Anbinden eines Benutzers vom Rechner in den Container werden Überprüfungen ausgeführt, um sicherzustellen, dass der Benutzername im Container noch nicht bekannt ist\&. Desweiteren wird überprüft, dass die zugewiesenen UID/GID derzeit in der Benutzer-/Gruppendatenbank des Containers nicht definiert ist\&. Beide Überprüfungen greifen direkt auf die /etc/passwd und /etc/group im Container zu und könnten daher bestehende Konten in anderen Datenbanken nicht erkennen\&.

source: This operation is only supported in combination with B<--private-users=>/B<-U>\&.
de: Diese Aktion wird nur in Kombination mit B<--private-users=>/B<-U> unterstützt\&.

source: Make the specified path inaccessible in the container\&. This over-mounts the specified path (which must exist in the container) with a file node of the same type that is empty and has the most restrictive access mode supported\&. This is an effective way to mask files, directories and other file system objects from the container payload\&. This option may be used more than once in case all specified paths are masked\&.
de: Macht den angegebenen Pfad im Container nicht zugreifbar\&. Damit wird über den angegebenen Pfad (der im Container existieren muss) ein leerer Dateiknoten des gleichen Typs eingehängt, der so restriktive Zugriffsmodi wie möglich hat\&. Dies ist eine wirksame Methode, Dateien, Verzeichnisse und andere Dateisystemobjekte vom Container-Inhalt zu maskieren\&. Diese Option kann mehr als einmal verwandt werden, wodurch alle angegebenen Pfade maskiert werden\&.

source: Mount a tmpfs file system into the container\&. Takes a single absolute path argument that specifies where to mount the tmpfs instance to (in which case the directory access mode will be chosen as 0755, owned by root/root), or optionally a colon-separated pair of path and mount option string that is used for mounting (in which case the kernel default for access mode and owner will be chosen, unless otherwise specified)\&. Backslash escapes are interpreted in the path, so "\e:" may be used to embed colons in the path\&.
de: Hängt ein Tmpfs-Dateisystem in den Container ein\&. Akzeptiert ein einzelnes, absolutes Pfadargument, das angibt, wohin die Tmpfs-Instanz eingehängt wird (in diesem Fall ist der Verzeichniszugriffsmodus als 0755 und der Eigentümer root/root ausgewählt) oder optional ein Doppelpunkt-getrenntes Paar von Pfad- und Einhängeoptionszeichenkette, die zum Einhängen verwandt wird (in diesem Fall werden die Kernelvorgaben für Zugriffsmodus und Eigentümer ausgewählt, falls nicht anderweitig angegeben)\&. Maskierungen durch Rückwärtsschrägstriche werden im Pfad interpretiert, so kann »\e:« verwandt werden, um Doppelpunkte in Pfade einzubetten\&.

source: Note that this option cannot be used to replace the root file system of the container with a temporary file system\&. However, the B<--volatile=> option described below provides similar functionality, with a focus on implementing stateless operating system images\&.
de: Beachten Sie, dass diese Option nicht zur Ersetzung des Wurzeldateisystems des Containers durch ein temporäres Dateisystem verwandt werden kann\&. Die nachfolgend beschriebene Option B<--volatile=> stellt allerdings eine ähnliche Funktionalität bereit, wobei der Fokus auf zustandslosen Betriebssystemabbildern liegt\&.

source: Combine multiple directory trees into one overlay file system and mount it into the container\&. Takes a list of colon-separated paths to the directory trees to combine and the destination mount point\&.
de: Kombiniert mehrere Verzeichnisbäume in ein Überlagerungsdateisystem und hängt es im Container ein\&. Akzeptiert eine Liste von Doppelpunkt-getrennten Pfaden zu den zu kombinierenden Verzeichnisbäumen und dem Zieleinhängepunkt\&.

source: Backslash escapes are interpreted in the paths, so "\e:" may be used to embed colons in the paths\&.
de: Maskierungen durch Rückwärtsschrägstriche werden im Pfad interpretiert; so kann »\e:« verwandt werden, um Doppelpunkte in Pfade einzubetten\&.

source: If three or more paths are specified, then the last specified path is the destination mount point in the container, all paths specified before refer to directory trees on the host and are combined in the specified order into one overlay file system\&. The left-most path is hence the lowest directory tree, the second-to-last path the highest directory tree in the stacking order\&. If B<--overlay-ro=> is used instead of B<--overlay=>, a read-only overlay file system is created\&. If a writable overlay file system is created, all changes made to it are written to the highest directory tree in the stacking order, i\&.e\&. the second-to-last specified\&.
de: Falls drei oder mehr Pfade angegeben werden, dann ist der letzte angegebene Pfad der Zieleinhängepunkt im Container; alle vorher angegebenen Pfade beziehen sich auf Verzeichnisbäume im Rechner und werden in der angegebenen Reihenfolge in das Überlagerungsdateisystem kombiniert\&. Der am weitesten links stehende Pfad ist daher der niedrigste Verzeichnisbaum, der vorletzte Pfad der höchste Verzeichnisbaum in der Stapelreihenfolge\&. Falls B<--overlay-ro=> anstelle von B<--overlay=> verwandt wird, dann wird ein nur-lesbares Überlagerungsdateisystem erstellt\&. Falls ein schreibbares Überlagerungsdateisystem erstellt wird, werden alle an ihm vorgenommenen Änderungen zum höchsten Verzeichnisbaum in der Stapelreihenfolge geschrieben, d\&.h\&. im vorletzten angegebenen\&.

source: If only two paths are specified, then the second specified path is used both as the top-level directory tree in the stacking order as seen from the host, as well as the mount point for the overlay file system in the container\&. At least two paths have to be specified\&.
de: Falls nur zwei Pfade angegeben werden, dann wird der zweite angegebene Pfad sowohl als oberstes Verzeichnis in der Stapelreihenfolge (wie vom Rechner gesehen) betrachtet, sowie auch als Einhängepunkt für das Überlagerungsdateisystem im Container\&. Es müssen mindestens zwei Pfade angegeben werden\&.

source: The source paths may optionally be prefixed with "+" character\&. If so they are taken relative to the image\*(Aqs root directory\&. The uppermost source path may also be specified as an empty string, in which case a temporary directory below the host\*(Aqs /var/tmp/ is used\&. The directory is removed automatically when the container is shut down\&. This behaviour is useful in order to make read-only container directories writable while the container is running\&. For example, use "--overlay=+/var::/var" in order to automatically overlay a writable temporary directory on a read-only /var/ directory\&.
de: Den Quellpfaden darf optional das Zeichen »+« vorangestellt werden\&. In diesem Falle werden die Pfade relativ zum Wurzelverzeichnis des Abbildes behandelt\&. Der oberste Quellpfad kann auch als eine leere Zeichenkette angegeben werden, dann wird ein temporäres Verzeichnis unterhalb von /var/tmp/ auf dem Rechner verwandt\&. Das Verzeichnis wird automatisch entfernt, wenn der Container heruntergefahren wird\&. Dieses Verhalten ist nützlich, um nur-lesbare Container-Verzeichnisse schreibbar zu machen, während der Container läuft\&. Verwenden Sie beispielweise »--overlay=+/var::/var«, um automatisch ein temporäres schreibbares Verzeichnis über ein nur-lesbares /var/-Verzeichnis zu legen\&.

source: For details about overlay file systems, see \m[blue]B<overlayfs\&.txt>\m[]\&\s-2\u[5]\d\s+2\&. Note that the semantics of overlay file systems are substantially different from normal file systems, in particular regarding reported device and inode information\&. Device and inode information may change for a file while it is being written to, and processes might see out-of-date versions of files at times\&. Note that this switch automatically derives the "workdir=" mount option for the overlay file system from the top-level directory tree, making it a sibling of it\&. It is hence essential that the top-level directory tree is not a mount point itself (since the working directory must be on the same file system as the top-most directory tree)\&. Also note that the "lowerdir=" mount option receives the paths to stack in the opposite order of this switch\&.
de: Für Details zu Überlagerungsdateisystemen, siehe \m[blue]B<overlayfs\&.txt>\m[]\&\s-2\u[5]\d\s+2\&. Beachten Sie, dass sich die Semantiken eines Überlagerungsdateisystems deutlich von denen normaler Dateisysteme unterscheiden, insbesondere im Hinblick auf die gemeldeten Geräte- und Inode-Informationen\&. Geräte- und Inode-Informationen einer Datei können sich während des Hineinschreibens ändern und zeitweilig könnten Prozesse veraltete Versionen von Dateien sehen\&. Beachten Sie, dass dieser Schalter automatisch die Einhängeoption »workdir=« für das Überlagerungsdateisystem vom obersten Verzeichnisbaum ableitet und damit zum Geschwisterverzeichnis wird\&. Es ist damit wesentlich, dass das Verzeichnis oberster Ebene selbst kein Einhängepunkt ist (da das Arbeitsverzeichnis auf dem gleichen Dateisystem wie der oberste Verzeichnisbaum sein muss)\&. Beachten Sie auch, dass die Einhängeoption »lowerdir=« die zu stapelnden Pfade in der umgekehrten Reihenfolge wie bei diesem Schalter erhält\&.

source: Note that this option cannot be used to replace the root file system of the container with an overlay file system\&. However, the B<--volatile=> option described above provides similar functionality, with a focus on implementing stateless operating system images\&.
de: Beachten Sie, dass diese Option nicht zur Ersetzung des Wurzeldateisystems eines Containers durch ein Überlagerungsdateisystem verwandt werden kann\&. Allerdings stellt die oben beschriebene Option B<--volatile=> eine ähnliche Funktionalität bereit, wobei der Fokus auf zustandslosen Betriebssystemabbildern liegt\&.

source: Input/Output Options
de: Ein-/Ausgabeoptionen

source: B<--console=>I<MODE>
de: B<--console=>I<MODUS>

source: Configures how to set up standard input, output and error output for the container payload, as well as the /dev/console device for the container\&. Takes one of B<interactive>, B<read-only>, B<passive>, B<pipe> or B<autopipe>\&. If B<interactive>, a pseudo-TTY is allocated and made available as /dev/console in the container\&. It is then bi-directionally connected to the standard input and output passed to B<systemd-nspawn>\&. B<read-only> is similar but only the output of the container is propagated and no input from the caller is read\&. If B<passive>, a pseudo TTY is allocated, but it is not connected anywhere\&. In B<pipe> mode no pseudo TTY is allocated, but the standard input, output and error output file descriptors passed to B<systemd-nspawn> are passed on \(em as they are \(em to the container payload, see the following paragraph\&. Finally, B<autopipe> mode operates like B<interactive> when B<systemd-nspawn> is invoked on a terminal, and like B<pipe> otherwise\&. Defaults to B<interactive> if B<systemd-nspawn> is invoked from a terminal, and B<read-only> otherwise\&.
de: Konfiguriert, wie die Standardeingabe, -ausgabe und die Fehlerausgabe für den Container-Inhalt konfiguriert wird, sowie /dev/console-Geräte für den Container\&. Akzeptiert entweder B<interactive>, B<read-only>, B<passive>, B<pipe> oder B<autopipe>\&. Falls B<interactive>, wird ein Pseudo-TTY reserviert und als /dev/console im Container verfügbar gemacht\&. Es wird dann bidirektional mit der Standardeingabe verbunden; die Standardausgabe wird an B<systemd-nspawn> übergeben\&. B<read-only> ist ähnlich, aber nur die Ausgabe des Containers wird weitergeleitet und keine Eingaben vom Aufrufenden werden gelesen\&. Falls B<passive>, wird ein Pseudo-TTY-Gerät reserviert, aber es wird mit nichts verbunden\&. Im B<pipe>-Modus wird kein Pseudo-TTY reserviert, aber die an B<systemd-nspawn> übergebenen Standardeingabedeskriptoren, -ausgabedeskriptoren und die Fehlerausgabedeskriptoren werden \(em so wie sie sind \(em an den Container-Inhalt weitergegeben, siehe dazu den nächsten Absatz\&. B<autopipe> agiert schießlich wie B<interactive> wenn B<systemd-nspawn> auf einem Terminal gestartet wird und andernfalls wie B<pipe>\&. Standardmäßig B<interactive>, falls B<systemd-nspawn> von einem Terminal aus aufgerufen wird, und ansonsten B<read-only>\&.
