Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: Revert one or more unit files to their vendor versions\&. This command removes drop-in configuration files that modify the specified units, as well as any user-configured unit file that overrides a matching vendor supplied unit file\&. Specifically, for a unit "foo\&.service" the matching directories "foo\&.service\&.d/" with all their contained files are removed, both below the persistent and runtime configuration directories (i\&.e\&. below /etc/systemd/system and /run/systemd/system); if the unit file has a vendor-supplied version (i\&.e\&. a unit file located below /usr/) any matching persistent or runtime unit file that overrides it is removed, too\&. Note that if a unit file has no vendor-supplied version (i\&.e\&. is only defined below /etc/systemd/system or /run/systemd/system, but not in a unit file stored below /usr/), then it is not removed\&. Also, if a unit is masked, it is unmasked\&.
uk: Повернути один або декілька файлів модулів до версії їхнього постачальника\&. Ця команда вилучає створені файли налаштувань, які вносять зміни до вказаних модулів, а також будь-які налаштовані користувачами файли модулів, які перевизначають відповідний файл модуля від постачальника\&. Зокрема, для модуля «щось\&.service» буде вилучено відповідні каталоги «щось\&.service\&.d/» із файлами, які у них містяться, у каталогах сталих та динамічних налаштувань (тобто в /etc/systemd/system і /run/systemd/system); якщо у файла є версія від постачальника (тобто файл модуля, який зберігається у /usr/), усі відповідні сталі або динамічні файли, які перевизначають типові, буде також вилучено\&. Зауважте, що якщо у файла модуля немає версії від постачальника (тобто його визначено лише у /etc/systemd/system або /run/systemd/system, але немає файла модуля, який зберігається у /usr/), файл не буде вилучено\&. Крім того, якщо модуль замасковано, його маскування буде знято\&.

source: Effectively, this command may be used to undo all changes made with B<systemctl edit>, B<systemctl set-property> and B<systemctl mask> and puts the original unit file with its settings back in effect\&.
uk: Насправді, цією командою можна скористатися для скасування усіх змін, які було внесено за допомогою команд B<systemctl edit>, B<systemctl set-property> і B<systemctl mask>. Команда також повертає дію початкового файла модуля із його параметрами\&.

source: B<add-wants >I<TARGET>B< >I<UNIT>B<\&...>, B<add-requires >I<TARGET>B< >I<UNIT>B<\&...>
uk: B<add-wants >I<ЦІЛЬ>B< >I<МОДУЛЬ>B<\&...>, B<add-requires >I<ЦІЛЬ>B< >I<МОДУЛЬ>B<\&...>

source: Adds "Wants=" or "Requires=" dependencies, respectively, to the specified I<TARGET> for one or more units\&.
uk: Додає залежності «Wants=» або «Requires=», відповідно, для вказаної I<ЦІЛІ> для одного або декількох модулів\&.

source: This command honors B<--system>, B<--user>, B<--runtime> and B<--global> in a way similar to B<enable>\&.
uk: Ця команда враховує B<--system>, B<--user>, B<--runtime> і B<--global> у спосіб, подібний до B<enable>\&.

source: B<edit >I<UNIT>B<\&...>
uk: B<edit >I<МОДУЛЬ>B<\&...>

source: Edit a drop-in snippet or a whole replacement file if B<--full> is specified, to extend or override the specified unit\&.
uk: Редагувати вставний фрагмент або увесь файл-замінник, якщо вказано B<--full>, для розширення або перевизначення вказаного модуля\&.

source: Depending on whether B<--system> (the default), B<--user>, or B<--global> is specified, this command creates a drop-in file for each unit either for the system, for the calling user, or for all futures logins of all users\&. Then, the editor (see the "Environment" section below) is invoked on temporary files which will be written to the real location if the editor exits successfully\&.
uk: Залежно від того, вказано B<--system> (типовий варіант), B<--user> чи B<--global>, ця команда створить вставний файл для кожного модуля для системи, лише для користувача, який її віддав, або для усіх наступних входів до системи усіх користувачів\&. Потім буде викликано редактор (див. розділ «Середовище» нижче) для тимчасових файлів, які буде записано до справжнього місця зберігання, якщо редактор успішно завершить роботу\&.

source: If B<--full> is specified, this will copy the original units instead of creating drop-in files\&.
uk: Якщо вказано B<--full>, буде скопійовано початкові модулі, а не створено фіктивні файли\&.

source: If B<--force> is specified and any units do not already exist, new unit files will be opened for editing\&.
uk: Якщо вказано B<--force>, і якихось модулів ще не існує, для редагування буде відкрито нові файли модулів\&.

source: If B<--runtime> is specified, the changes will be made temporarily in /run/ and they will be lost on the next reboot\&.
uk: Якщо вказано B<--runtime>, зміни буде внесено до /run/ тимчасово — їх буде втрачено під час перезавантаження системи\&.

source: If the temporary file is empty upon exit, the modification of the related unit is canceled\&.
uk: Якщо тимчасовий файл буде порожнім на момент виходу, внесені до пов'язаного модуля зміни буде скасовано\&.

source: After the units have been edited, systemd configuration is reloaded (in a way that is equivalent to B<daemon-reload>)\&.
uk: Після редагування модулів налаштування systemd буде перезавантажено (у спосіб, який є еквівалентним до команди B<daemon-reload>)\&.

source: Note that this command cannot be used to remotely edit units and that you cannot temporarily edit units which are in /etc/, since they take precedence over /run/\&.
uk: Зауважте, що цю команду не можна використовувати для віддаленого редагування модулів, і ви не можете тимчасово редагувати модулі, які зберігаються в /etc/, оскільки вони мають вищий пріоритет над тими, які зберігаються у /run/\&.

source: Return the default target to boot into\&. This returns the target unit name default\&.target is aliased (symlinked) to\&.
uk: Повертає типову ціль завантаження системи\&. У результаті буде повернуто назву модуля, з яким пов'язано (символічним посиланням) default\&.target\&.

source: B<set-default >I<TARGET>
uk: B<set-default >I<ЦІЛЬ>

source: Set the default target to boot into\&. This sets (symlinks) the default\&.target alias to the given target unit\&.
uk: Встановити типову ціль завантаження системи\&. У результаті буде встановлено (за допомогою символічних посилань) альтернативу для default\&.target так, щоб вона вказувала на заданий цільовий модуль\&.

source: Machine Commands
uk: Команди машини

source: B<list-machines> [I<PATTERN>\&...]
uk: B<list-machines> [I<ВЗІРЕЦЬ>\&...]

source: List the host and all running local containers with their state\&. If one or more I<PATTERN>s are specified, only containers matching one of them are shown\&.
uk: Виводить список вузлів і усіх запущених локальних контейнерів із даними щодо їхнього стану\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде виведено лише контейнери, які відповідають одному із взірців\&.

source: Job Commands
uk: Команди завдання

source: B<list-jobs >B<[>I<PATTERN\&...>]
uk: B<list-jobs >B<[>I<ВЗІРЕЦЬ\&...>]

source: List jobs that are in progress\&. If one or more I<PATTERN>s are specified, only jobs for units matching one of them are shown\&.
uk: Виводить список завдань, виконання яких триває\&. Якщо вказано один або декілька I<ВЗІРЦІВ>, буде виведено лише завдання для модулів, які відповідають одному із взірців\&.

source: When combined with B<--after> or B<--before> the list is augmented with information on which other job each job is waiting for, and which other jobs are waiting for it, see above\&.
uk: Якщо поєднано із B<--after> або B<--before> список буде розширено відомостями щодо того, на яке завдання очікує кожне завдання, і які завдання очікують на це завдання, див. вище\&.

source: B<cancel >I<JOB>B<\&...>
uk: B<cancel >I<ЗАВДАННЯ>B<\&...>

source: Cancel one or more jobs specified on the command line by their numeric job IDs\&. If no job ID is specified, cancel all pending jobs\&.
uk: Скасувати одне або декілька завдань, які вказано у рядку команди за їхніми числовими ідентифікаторами завдання\&. Якщо не вказано ідентифікатора завдання, скасувати усі завдання з черги\&.

source: Environment Commands
uk: Команди середовища

source: B<systemd> supports an environment block that is passed to processes the manager spawns\&. The names of the variables can contain ASCII letters, digits, and the underscore character\&. Variable names cannot be empty or start with a digit\&. In variable values, most characters are allowed, but the whole sequence must be valid UTF-8\&. (Note that control characters like newline (B<NL>), tab (B<TAB>), or the escape character (B<ESC>), I<are> valid ASCII and thus valid UTF-8)\&. The total length of the environment block is limited to B<_SC_ARG_MAX> value defined by B<sysconf>(3)\&.
uk: У B<systemd> передбачено підтримку блоків середовища, яке буде передано процесам, породженим засобом керування\&. Назви змінних можуть містити літери ASCII, цифри та символи підкреслення\&. Назви змінних не можуть бути порожніми або починатися з цифри\&. У значеннях змінних можна використовувати більшість символів, але уся послідовність має бути коректним рядком UTF-8\&. (Зауважте, що символи керування, подібні до символу нового рядка (B<NL>), табуляції (B<TAB>) або символу скасування (B<ESC>), I<є> коректними символами ASCII, а отже, коректними символами UTF-8)\&. Загальна довжина блоку середовища обмежена значенням B<_SC_ARG_MAX>, яке визначено B<sysconf>(3)\&.

source: Dump the systemd manager environment block\&. This is the environment block that is passed to all processes the manager spawns\&. The environment block will be dumped in straightforward form suitable for sourcing into most shells\&. If no special characters or whitespace is present in the variable values, no escaping is performed, and the assignments have the form "VARIABLE=value"\&. If whitespace or characters which have special meaning to the shell are present, dollar-single-quote escaping is used, and assignments have the form "VARIABLE=$\*(Aqvalue\*(Aq"\&. This syntax is known to be supported by B<bash>(1), B<zsh>(1), B<ksh>(1), and B<busybox>(1)\*(Aqs B<ash>(1), but not B<dash>(1) or B<fish>(1)\&.
uk: Створити дамп блоку середовища засобу керування systemd\&. Це блок середовища, який буде передано усім процесам, які породжено засобом керування системою\&. Дамп блоку середовища буде створено у прямій формі, яка пасує для передавання у більшість командних оболонок\&. Якщо у значеннях змінних немає спеціальних символів або пробілів, екранування не виконуватиметься, а встановлення значень відбувається у формі «ЗМІННА=значення»\&. Якщо у значеннях містяться пробіли або символи, які мають спеціальне значення у командній оболонці, використовують екранування символом долара і одинарних лапок, а встановлення значень відбувається у формі «ЗМІННА=$\*(Aqзначення\*(Aq»\&. Відомо, що підтримку таких синтаксичних конструкцій передбачено у B<bash>(1), B<zsh>(1), B<ksh>(1), та B<ash>(1) з B<busybox>(1), але не у B<dash>(1) або B<fish>(1)\&.

source: B<set-environment >I<VARIABLE=VALUE>B<\&...>
uk: B<set-environment >I<ЗМІННА=ЗНАЧЕННЯ>B<\&...>

source: Set one or more systemd manager environment variables, as specified on the command line\&. This command will fail if variable names and values do not conform to the rules listed above\&.
uk: Встановити одну або декілька змінних середовища засобу керування systemd, як вказано у рядку команди\&. Виконання цієї команди завершиться помилкою, якщо назви і значення змінних не відповідають вказаним вище правилам\&.

source: B<unset-environment >I<VARIABLE>B<\&...>
uk: B<unset-environment >I<ЗМІННА>B<\&...>

source: Unset one or more systemd manager environment variables\&. If only a variable name is specified, it will be removed regardless of its value\&. If a variable and a value are specified, the variable is only removed if it has the specified value\&.
uk: Скасувати встановлення однієї або декількох змінних середовища засобу керування systemd\&. Якщо вказано лише назву змінної, її буде вилучено незалежно від значення\&. Якщо вказано змінну і значення, змінну буде вилучено, лише якщо вона має вказане значення\&.

source: B<import-environment> I<VARIABLE\&...>
uk: B<import-environment> I<ЗМІННА\&...>

source: Import all, one or more environment variables set on the client into the systemd manager environment block\&. If a list of environment variable names is passed, client-side values are then imported into the manager\*(Aqs environment block\&. If any names are not valid environment variable names or have invalid values according to the rules described above, an error is raised\&. If no arguments are passed, the entire environment block inherited by the B<systemctl> process is imported\&. In this mode, any inherited invalid environment variables are quietly ignored\&.
uk: Імпортувати усі, одну або декілька змінних середовища, які встановлено на клієнті, до блоку середовища засобу керування systemd\&. Якщо передано список назв змінних середовища, значення на боці клієнта буде імпортовано до блоку середовища засобу керування\&. Якщо якісь назви не є коректними назвами змінних середовища або мають некоректні значення за правилами, які описано вище, буде повідомлено про помилку\&. Якщо не буде передано аргументів, буде імпортовано увесь блок середовища, який успадковано B<systemctl>\&. У цьому режимі усі успадковані некоректні змінні середовища буде без повідомлень проігноровано\&.

source: Importing of the full inherited environment block (calling this command without any arguments) is deprecated\&. A shell will set dozens of variables which only make sense locally and are only meant for processes which are descendants of the shell\&. Such variables in the global environment block are confusing to other processes\&.
uk: Імпортування усього блоку середовища (виклик цієї команди без аргументів) вважається застарілим\&. Оболонка встановлює десятки змінних, які мають лише локальне значення, і які призначено лише для процесів, які є нащадками командної оболонки\&. Такі змінні у загальному блоці середовища є конфліктними щодо інших процесів\&.

source: Manager State Commands
uk: Команди стану засобу керування

source: Reload the systemd manager configuration\&. This will rerun all generators (see B<systemd.generator>(7)), reload all unit files, and recreate the entire dependency tree\&. While the daemon is being reloaded, all sockets systemd listens on behalf of user configuration will stay accessible\&.
uk: Перезавантажити налаштування засобу керування systemd\&. У результаті буде перезапущено усі засоби породження (див. B<systemd.generator>(7)), перезавантажено усі файли модулів і повторно створено усе дерево залежностей\&. Під час перезавантаження фонової служби лишатимуться доступними усі сокети systemd, на яких програма очікує дані від імені користувача\&.

source: This command should not be confused with the B<reload> command\&.
uk: Цю команду не слід плутати із командою B<reload>\&.

source: Reexecute the systemd manager\&. This will serialize the manager state, reexecute the process and deserialize the state again\&. This command is of little use except for debugging and package upgrades\&. Sometimes, it might be helpful as a heavy-weight B<daemon-reload>\&. While the daemon is being reexecuted, all sockets systemd listening on behalf of user configuration will stay accessible\&.
uk: Повторно виконати засіб керування systemd\&. У результаті стан засобу керування буде переведено у послідовну форму, процес буде повторно виконано, а потім стан буде знову переведено у попередню форму\&. Ця команда малокорисна, якщо ви не переймаєтеся діагностикою або оновленням пакунків\&. Іноді, у ній може бути користь, як у потужному варіанті B<daemon-reload>\&. Під час повторного виконання фонової служби лишатимуться доступними усі сокети systemd, на яких програма очікує дані від імені користувача\&.

source: B<log-level> [I<LEVEL>]
uk: B<log-level> [I<РІВЕНЬ>]

source: If no argument is given, print the current log level of the manager\&. If an optional argument I<LEVEL> is provided, then the command changes the current log level of the manager to I<LEVEL> (accepts the same values as B<--log-level=> described in B<systemd>(1))\&.
uk: Якщо не вказано аргументу, буде виведено поточний рівень журналювання засобу керування\&. Якщо вказано необов'язковий аргумент I<РІВЕНЬ>, команда змінить поточний рівень журналювання засобу керування на I<РІВЕНЬ> (приймаються ті самі значення, що і для параметра B<--log-level=>, який описано у B<systemd>(1))\&.

source: B<log-target> [I<TARGET>]
uk: B<log-target> [I<ЦІЛЬ>]

source: If no argument is given, print the current log target of the manager\&. If an optional argument I<TARGET> is provided, then the command changes the current log target of the manager to I<TARGET> (accepts the same values as B<--log-target=>, described in B<systemd>(1))\&.
uk: Якщо не вказано аргументу, буде виведено поточну ціль журналювання засобу керування\&. Якщо вказано необов'язковий аргумент I<ЦІЛЬ>, команда змінить поточну ціль журналювання засобу керування на I<ЦІЛЬ> (приймаються ті самі значення, що і для параметра B<--log-target=>, який описано у B<systemd>(1))\&.

source: If no argument is given, print the current state of service runtime watchdogs of the manager\&. If an optional boolean argument is provided, then globally enables or disables the service runtime watchdogs (B<WatchdogSec=>) and emergency actions (e\&.g\&. B<OnFailure=> or B<StartLimitAction=>); see B<systemd.service>(5)\&. The hardware watchdog is not affected by this setting\&.
uk: Якщо не вказано аргументу, вивести поточний стан динамічних засобів спостереження за службами засобу керування системою\&. Якщо вказано необов'язковий булевий аргумент, увімкнути або вимкнути динамічні засоби спостереження за службами (B<WatchdogSec=>) та термінові дії (наприклад, B<OnFailure=> або B<StartLimitAction=>); див. B<systemd.service>(5)\&. Цей параметр не впливає на апаратний засіб спостереження\&.

source: System Commands
uk: Команди системи

source: Checks whether the system is operational\&. This returns success (exit code 0) when the system is fully up and running, specifically not in startup, shutdown or maintenance mode, and with no failed services\&. Failure is returned otherwise (exit code non-zero)\&. In addition, the current state is printed in a short string to standard output, see the table below\&. Use B<--quiet> to suppress this output\&.
uk: Перевіряє, чи є система працездатною\&. Повертає «успіх» (код виходу 0), якщо система є повністю працездатною, а саме, не перебуває у режимі запуску, вимикання або супроводу і не має служб у стані помилки\&. В інших випадках буде повернуто стан помилки (ненульовий код виходу)\&. Крім того, до стандартного виведення буде виведено короткий рядок поточного стану, див. наведену нижче таблицю\&. Скористайтеся B<--quiet>, щоб придушити виведення цих даних\&.

source: Use B<--wait> to wait until the boot process is completed before printing the current state and returning the appropriate error status\&. If B<--wait> is in use, states I<initializing> or I<starting> will not be reported, instead the command will block until a later state (such as I<running> or I<degraded>) is reached\&.
uk: Скористайтеся B<--wait>, щоб наказати системі чекати, аж доки завершиться процес завантаження, перш ніж виводити поточний стан і повертати відповідний стан помилки\&. Якщо використано B<--wait>, про стани I<initializing> та I<starting> повідомлено не буде. Замість цього команду буде заблоковано, аж до досягнення наступного стану (зокрема I<running> або I<degraded>)\&.

source: B<Table\ \&2.\ \&is-system-running output>
uk: B<Таблиця\ \&2.\ \&Виведення is-system-running>

source: Early bootup, before basic\&.target is reached or the I<maintenance> state entered\&.
uk: Раннє завантаження, до досягнення basic\&.target або входу до стану I<maintenance>\&.

source: Late bootup, before the job queue becomes idle for the first time, or one of the rescue targets are reached\&.
uk: Пізнє завантаження, до того, як черга завдань стане бездіяльною уперше, або буде досягнуто одну з цілей порятунку системи\&.

source: The system is fully operational\&.
uk: Система є повноцінно функціональною\&.

source: The system is operational but one or more units failed\&.
uk: Система є функціональною, але один або декілька модулів є непрацездатними\&.

source: The rescue or emergency target is active\&.
uk: Активною є ціль порятунку або критична ціль\&.

source: The manager is shutting down\&.
uk: Засіб керування завершує роботу\&.

source: The manager is not running\&. Specifically, this is the operational state if an incompatible program is running as system manager (PID 1)\&.
uk: Засіб керування не запущено\&. Зокрема, це стан роботи, якщо як засіб керування системою (PID 1) запущено несумісну програму\&.

source: The operational state could not be determined, due to lack of resources or another error cause\&.
uk: Не вдалося визначити функціональний стан через брак ресурсів або з іншої причини\&.

source: Enter default mode\&. This is equivalent to B<systemctl isolate default\&.target>\&. This operation is blocking by default, use B<--no-block> to request asynchronous behavior\&.
uk: Увійти в типовий режим\&. Це еквівалентно B<systemctl isolate default\&.target>\&. Цю операцію типово заблоковано, для запиту асинхронної поведінки скористайтесь B<--no-block>\&.

source: Enter rescue mode\&. This is equivalent to B<systemctl isolate rescue\&.target>\&. This operation is blocking by default, use B<--no-block> to request asynchronous behavior\&.
uk: Увійти в режим порятунку\&. Це еквівалентно B<systemctl isolate rescue\&.target>\&. Цю операцію типово заблоковано, для запиту асинхронної поведінки скористайтесь B<--no-block>\&.

source: Enter emergency mode\&. This is equivalent to B<systemctl isolate emergency\&.target>\&. This operation is blocking by default, use B<--no-block> to request asynchronous behavior\&.
uk: Увійти в аварійний режим\&. Це еквівалентно B<systemctl isolate emergency\&.target>\&. Цю операцію типово заблоковано, для запиту асинхронної поведінки скористайтесь B<--no-block>\&.

source: Shut down and halt the system\&. This is mostly equivalent to B<systemctl start halt\&.target --job-mode=replace-irreversibly --no-block>, but also prints a wall message to all users\&. This command is asynchronous; it will return after the halt operation is enqueued, without waiting for it to complete\&. Note that this operation will simply halt the OS kernel after shutting down, leaving the hardware powered on\&. Use B<systemctl poweroff> for powering off the system (see below)\&.
uk: Вимкнути і зупинити систему\&. Це майже еквівалентно B<systemctl start halt\&.target --job-mode=replace-irreversibly --no-block>, але також виводить повідомлення на стіні для всіх користувачів\&. Ця команда є асинхронною; повернення відбувається після того, як дію зупинки поставлено в чергу, не чекаючи її завершення\&. Зауважте, що ця операція просто зупинить ядро ОС після закінчення роботи, залишивши апаратні засоби увімкненими\&. Для вимкнення системи скористайтесь B<systemctl poweroff> (див. нижче)\&.
