Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: If combined with B<--force>, shutdown of all running services is skipped, however all processes are killed and all file systems are unmounted or mounted read-only, immediately followed by the system halt\&. If B<--force> is specified twice, the operation is immediately executed without terminating any processes or unmounting any file systems\&. This may result in data loss\&. Note that when B<--force> is specified twice the halt operation is executed by B<systemctl> itself, and the system manager is not contacted\&. This means the command should succeed even when the system manager has crashed\&.
uk: Якщо в поєднанні з B<--force>, закриття всіх запущених служб пропускається, однак усі процеси припиняються, а всі файлові системи буде демонтовано або змонтовано лише для читання, одразу після чого відбувається зупинка системи\&. Якщо B<--force> вказано двічі, операція виконується негайно без завершення будь-яких процесів або демонтування будь-яких файлових систем\&. Це може призвести до втрати даних\&. Зауважте, що коли B<--force> вказано двічі, операцію зупинки виконує сама B<systemctl>, без зв'язку із засобом керування системою\&. Це означає, що команда має бути успішною, навіть якщо засіб керування системою зазнав збою\&.

source: Shut down and power-off the system\&. This is mostly equivalent to B<systemctl start poweroff\&.target --job-mode=replace-irreversibly --no-block>, but also prints a wall message to all users\&. This command is asynchronous; it will return after the power-off operation is enqueued, without waiting for it to complete\&.
uk: Закрити і вимкнути систему\&. Це здебільшого еквівалентно B<systemctl start poweroff\&.target --job-mode=replace-irreversibly --no-block>, але також друкує повідомлення на стіні для всіх користувачів\&. Ця команда є асинхронною; повернення відбувається після того, як операцію вимкнення поставлено в чергу, не чекаючи її завершення\&.

source: If combined with B<--force>, shutdown of all running services is skipped, however all processes are killed and all file systems are unmounted or mounted read-only, immediately followed by the powering off\&. If B<--force> is specified twice, the operation is immediately executed without terminating any processes or unmounting any file systems\&. This may result in data loss\&. Note that when B<--force> is specified twice the power-off operation is executed by B<systemctl> itself, and the system manager is not contacted\&. This means the command should succeed even when the system manager has crashed\&.
uk: Якщо в поєднанні з B<--force>, закриття всіх запущених служб пропускається, однак усі процеси припиняються, а всі файлові системи буде демонтовано або змонтовано лише для читання, одразу після чого відбувається вимкнення системи\&. Якщо B<--force> вказано двічі, операція виконується негайно без завершення будь-яких процесів або демонтування будь-яких файлових систем\&. Це може призвести до втрати даних\&. Зауважте, що коли B<--force> вказано двічі, операцію зупинки виконує сама B<systemctl>, без зв'язку із засобом керування системою\&. Це означає, що команда має бути успішною, навіть якщо засіб керування системою зазнав збою\&.

source: Shut down and reboot the system\&.
uk: Вимкнути і перезавантажити систему\&.

source: This command mostly equivalent to B<systemctl start reboot\&.target --job-mode=replace-irreversibly --no-block>, but also prints a wall message to all users\&. This command is asynchronous; it will return after the reboot operation is enqueued, without waiting for it to complete\&.
uk: Ця команда майже еквівалентна B<systemctl start reboot\&.target --job-mode=replace-irreversibly --no-block>, але також друкує повідомлення на стіні для всіх користувачів\&. Ця команда є асинхронною; повернення відбувається після того, як операцію зупинки поставлено в чергу, не чекаючи її завершення\&.

source: If combined with B<--force>, shutdown of all running services is skipped, however all processes are killed and all file systems are unmounted or mounted read-only, immediately followed by the reboot\&. If B<--force> is specified twice, the operation is immediately executed without terminating any processes or unmounting any file systems\&. This may result in data loss\&. Note that when B<--force> is specified twice the reboot operation is executed by B<systemctl> itself, and the system manager is not contacted\&. This means the command should succeed even when the system manager has crashed\&.
uk: Якщо в поєднанні з B<--force>, закриття всіх запущених служб пропускається, однак усі процеси припиняються, а всі файлові системи буде демонтовано або змонтовано лише для читання, одразу після чого відбудеться перезавантаження системи\& Якщо B<--force> вказано двічі, операція виконується негайно без завершення будь-яких процесів або демонтування будь-яких файлових систем\&. Це може призвести до втрати даних\&. Зауважте, що коли B<--force> вказано двічі, дію з перезавантаження виконує сама B<systemctl>, без зв'язку із засобом керування системою\&. Це означає, що команда має бути успішною, навіть якщо засіб керування системою зазнав збою\&.

source: If the switch B<--reboot-argument=> is given, it will be passed as the optional argument to the B<reboot>(2) system call\&.
uk: Якщо вказано перемикач B<--reboot-argument=>, його буде передано як додатковий аргумент системному виклику B<reboot>(2)\&.

source: Options B<--boot-loader-entry=>, B<--boot-loader-menu=>, and B<--firmware-setup> can be used to select what to do I<after> the reboot\&. See the descriptions of those options for details\&.
uk: Параметрами B<--boot-loader-entry=>, B<--boot-loader-menu=> і B<--firmware-setup> можна скористатися для вибору дії, яку слід виконати I<після> перезавантаження\&. Див. опис цих параметрів, щоб дізнатися більше\&.

source: Shut down and reboot the system via B<kexec>\&. This is equivalent to B<systemctl start kexec\&.target --job-mode=replace-irreversibly --no-block>\&. This command is asynchronous; it will return after the reboot operation is enqueued, without waiting for it to complete\&.
uk: Закрити і перезавантажити систему за допомогою B<kexec>\&. Це еквівалентно B<systemctl start kexec\&.target --job-mode=replace-irreversibly --no-block>\&. Ця команда є асинхронною; повернення відбувається після того, як операцію зупинки поставлено в чергу, не чекаючи її завершення\&.

source: If combined with B<--force>, shutdown of all running services is skipped, however all processes are killed and all file systems are unmounted or mounted read-only, immediately followed by the reboot\&.
uk: Якщо поєднано із B<--force>, завершення роботи усіх запущених служб буде пропущено, втім, усі процеси буде завершено, а усі файлові системи демонтовано або змонтовано у режимі лише читання з негайним перезавантаженням системи після цього\&.

source: B<exit> [I<EXIT_CODE>]
uk: B<exit> [I<КОД_ВИХОДУ>]

source: Ask the service manager to quit\&. This is only supported for user service managers (i\&.e\&. in conjunction with the B<--user> option) or in containers and is equivalent to B<poweroff> otherwise\&. This command is asynchronous; it will return after the exit operation is enqueued, without waiting for it to complete\&.
uk: Попросити засіб керування службами завершити свою роботу\&. Підтримку передбачено лише для засобів керування службами користувача (тобто у поєднанні із параметром B<--user>) або у контейнерах. В усіх інших аспектах, є еквівалентом B<poweroff>\&. Ця команда є асинхронною; вона повертає керування після додавання до черги дії з виходу, без очікування на завершення дії\&.

source: The service manager will exit with the specified exit code, if I<EXIT_CODE> is passed\&.
uk: Засіб керування службами завершить роботу із вказаним кодом виходу, якщо передано I<КОД_ВИХОДУ>\&.

source: B<switch-root> I<ROOT> [I<INIT>]
uk: B<switch-root> I<КОРІНЬ> [I<ІНІЦІАЛІЗАЦІЯ>]

source: Switches to a different root directory and executes a new system manager process below it\&. This is intended for usage in initial RAM disks ("initrd"), and will transition from the initrd\*(Aqs system manager process (a\&.k\&.a\&. "init" process) to the main system manager process which is loaded from the actual host volume\&. This call takes two arguments: the directory that is to become the new root directory, and the path to the new system manager binary below it to execute as PID 1\&. If the latter is omitted or the empty string, a systemd binary will automatically be searched for and used as init\&. If the system manager path is omitted, equal to the empty string or identical to the path to the systemd binary, the state of the initrd\*(Aqs system manager process is passed to the main system manager, which allows later introspection of the state of the services involved in the initrd boot phase\&.
uk: Перемикає на інший кореневий каталог і виконує новий процес засобу керування системою у ньому\&. Цю команду призначено для використання на початкових дисках у RAM («initrd») і переходу з процесу засобу керування системою initrd (тобто процесу «init») до основного процесу засобу керування системою, який завантажується з самого тому зберігання даних основної системи\&. Цей виклик приймає два аргументи: каталог, який має стати новим кореневим каталогом, і шлях до виконуваного файла нового засобу керування системою, який слід виконувати як PID 1\&. Якщо останній не буде вказано або буде вказано порожній рядок, буде виконано автоматичний пошук виконуваного файла systemd, який і буде використано як init\&. Якщо не вказано шляху до засобу керування системою, цей шлях є порожнім рядком або він збігається зі шляхом до виконуваного файла systemd, основному засобу керування системою буде передано стан процесу засобу керування системою initrd, що надасть змогу пізніше виконати інтроспекцію стану служб, які було включено до фази завантаження initrd\&.

source: Suspend the system\&. This will trigger activation of the special target unit suspend\&.target\&. This command is asynchronous, and will return after the suspend operation is successfully enqueued\&. It will not wait for the suspend/resume cycle to complete\&.
uk: Призупинити роботу системи\&. Ця команда увімкне активацію модуля спеціальної цілі suspend\&.target\&. Ця команда є асинхронною. Вона поверне керування після успішного додавання до черги дії із призупинення\&. Команда не чекатиме на завершення циклу призупинення-відновлення роботи\&.

source: Hibernate the system\&. This will trigger activation of the special target unit hibernate\&.target\&. This command is asynchronous, and will return after the hibernation operation is successfully enqueued\&. It will not wait for the hibernate/thaw cycle to complete\&.
uk: Приспати систему\&. Ця команда увімкне активацію модуля спеціальної цілі hibernate\&.target\&. Ця команда є асинхронною. Вона поверне керування після успішного додавання до черги дії із присипляння\&. Команда не чекатиме на завершення циклу присипляння-розморожування\&.

source: Hibernate and suspend the system\&. This will trigger activation of the special target unit hybrid-sleep\&.target\&. This command is asynchronous, and will return after the hybrid sleep operation is successfully enqueued\&. It will not wait for the sleep/wake-up cycle to complete\&.
uk: Приспати і призупинити роботу системи\&. Ця команда увімкне активацію модуля спеціальної цілі hybrid-sleep\&.target\&. Ця команда є асинхронною. Вона поверне керування після успішного додавання до черги дії із гібридного присипляння\&. Команда не чекатиме на завершення циклу присипляння-пробудження\&.

source: Suspend the system and hibernate it after the delay specified in systemd-sleep\&.conf\&. This will trigger activation of the special target unit suspend-then-hibernate\&.target\&. This command is asynchronous, and will return after the hybrid sleep operation is successfully enqueued\&. It will not wait for the sleep/wake-up or hibernate/thaw cycle to complete\&.
uk: Призупинити роботу системи і приспати її із затримкою, визначеною у systemd-sleep\&.conf\&. Ця команда увімкне активацію модуля спеціальної цілі suspend-then-hibernate\&.target\&. Ця команда є асинхронною. Вона поверне керування після успішного додавання до черги дії із гібридного присипляння\&. Команда не чекатиме на завершення циклу присипляння-пробудження або призупинення-розморожування\&.

source: Parameter Syntax
uk: Синтаксис параметрів

source: Unit commands listed above take either a single unit name (designated as I<UNIT>), or multiple unit specifications (designated as I<PATTERN>\&...)\&. In the first case, the unit name with or without a suffix must be given\&. If the suffix is not specified (unit name is "abbreviated"), systemctl will append a suitable suffix, "\&.service" by default, and a type-specific suffix in case of commands which operate only on specific unit types\&. For example,
uk: Команди із наведеного вище списку приймають або одну назву модуля (позначену як I<МОДУЛЬ>), або декілька специфікацій модулів (позначених як I<ВЗІРЕЦЬ>\&...)\&. У першому випадку слід надати назву модуля з суфіксом або без нього\&. Якщо суфікс не вказано (назву модуля «скорочено»), systemctl допише відповідний суфікс: типово, «\&.service» або специфічний до типу суфікс у випадку команд, які працюють лише з певним типом модулів\&. Приклад:

source: and
uk: і

source: are equivalent, as are
uk: є еквівалентними, як є еквівалентними

source: Note that (absolute) paths to device nodes are automatically converted to device unit names, and other (absolute) paths to mount unit names\&.
uk: Зауважте, що (абсолютні) шляхи до вузлів пристроїв буде автоматично перетворено на назви модулів пристроїв, а інші (абсолютні) шляхи — на назви модулів монтування\&.

source: are equivalent to:
uk: є еквівалентом такого:

source: In the second case, shell-style globs will be matched against the primary names of all units currently in memory; literal unit names, with or without a suffix, will be treated as in the first case\&. This means that literal unit names always refer to exactly one unit, but globs may match zero units and this is not considered an error\&.
uk: У другому випадку взірці із символами-замінниками у стилі командної оболонки буде зіставлено із основними назвами усіх модулів, які перебувають в оперативній пам'яті; буквально вказані назви модулів, із суфіксом чи без нього, буде оброблено за першим випадком\&. Це означає, що буквально вказані назви модулів завжди стосуються точно одного модуля, а взірці можуть відповідати нульовій кількості модулів, і це не вважатиметься помилкою\&.

source: Glob patterns use B<fnmatch>(3), so normal shell-style globbing rules are used, and "*", "?", "[]" may be used\&. See B<glob>(7) for more details\&. The patterns are matched against the primary names of units currently in memory, and patterns which do not match anything are silently skipped\&. For example:
uk: Для взірців із символами-замінниками використано B<fnmatch>(3), тому встановлення відповідності відбувається за звичайними правилами у стилі командної оболонки, і можна використовувати «*», «?», «[]»\&. Див. B<glob>(7), щоб дізнатися більше\&. Встановлення відповідності взірцям відбуватиметься для основних назв модулів, які перебувають у оперативній пам'яті, а взірці, відповідників яких не вдасться виявити, буде без повідомлень пропущено\&. Приклад:

source: will stop all sshd@\&.service instances\&. Note that alias names of units, and units that aren\*(Aqt in memory are not considered for glob expansion\&.
uk: зупинить усі екземпляри sshd@\&.service\&. Зауважте, що альтернативні назви модулів і модулі, які не перебувають в оперативній пам'яті, не буде розглянуто під час розгортання взірця\&.

source: For unit file commands, the specified I<UNIT> should be the name of the unit file (possibly abbreviated, see above), or the absolute path to the unit file:
uk: Для команд файлів модулів вказаний I<МОДУЛЬ> має бути назвою файла модуля (можливо, скороченою, див. вище) або абсолютним шляхом до файла модуля:

source: or
uk: або

source: # systemctl link /path/to/foo\&.service
uk: # systemctl link /шлях/до/foo\&.service

source: OPTIONS
uk: ПАРАМЕТРИ

source: The following options are understood:
uk: Передбачено обробку таких параметрів:

source: The argument should be a comma-separated list of unit types such as B<service> and B<socket>\&.
uk: Аргументом має бути список відокремлених комами типів модулів, наприклад B<service> або B<socket>\&.

source: If one of the arguments is a unit type, when listing units, limit display to certain unit types\&. Otherwise, units of all types will be shown\&.
uk: Якщо одним з аргументів є тип модулів, при виведенні списку модулів обмежитися показом модулів певних типів\&. Якщо ж тип модулів не вказано, буде виведено дані щодо модулів усіх типів\&.

source: As a special case, if one of the arguments is B<help>, a list of allowed values will be printed and the program will exit\&.
uk: В особливому випадку, якщо одним з аргументів є B<help>, буде виведено список усіх дозволених значень, і програма завершить роботу\&.

source: The argument should be a comma-separated list of unit LOAD, SUB, or ACTIVE states\&. When listing units, show only those in the specified states\&. Use B<--state=failed> to show only failed units\&.
uk: Аргументом має бути список відокремлених комами станів LOAD, SUB або ACTIVE модуля\&. При побудові списку вивести лише ті модулі, які перебувають у вказаних станах\&. Скористайтеся B<--state=failed>, щоб отримати список лише модулів із помилками\&.

source: When showing unit/job/manager properties with the B<show> command, limit display to properties specified in the argument\&. The argument should be a comma-separated list of property names, such as "MainPID"\&. Unless specified, all known properties are shown\&. If specified more than once, all properties with the specified names are shown\&. Shell completion is implemented for property names\&.
uk: При виведенні властивостей модуля, завдання чи засобу керування за допомогою команди B<show> обмежитися виведенням властивостей, які вказано в аргументі\&. Аргументом має бути список відокремлених комами назв властивостей, наприклад «MainPID»\&. Якщо властивостей не вказано, буде виведено усі властивості\&. Якщо параметр вказано декілька разів, буде виведено усі властивості із вказаними назвами\&. Для назв властивостей буде реалізовано можливість доповнення у командній оболонці\&.

source: For the manager itself, B<systemctl\ \&show> will show all available properties, most of which are derived or closely match the options described in B<systemd-system.conf>(5)\&.
uk: Для самого засобу керування B<systemctl\ \&show> виведе усі доступні властивості, більшість з яких є похідними або дуже схожими на параметри, описані на сторінці підручника щодо B<systemd-system.conf>(5)\&.

source: Properties for units vary by unit type, so showing any unit (even a non-existent one) is a way to list properties pertaining to this type\&. Similarly, showing any job will list properties pertaining to all jobs\&. Properties for units are documented in B<systemd.unit>(5), and the pages for individual unit types B<systemd.service>(5), B<systemd.socket>(5), etc\&.
uk: Властивості модулів різних типів є доволі різними, тому виведення даних для будь-якого модуля (навіть такого, якого не існує) є способом ознайомитися зі списком властивостей відповідного типу\&. Так само, виведення списку властивостей для довільного завдання призведе до виведення властивостей, які є в усіх завдань\&. Властивості модулів задокументовано на сторінці підручника B<systemd.unit>(5), а сторінками для окремих типів модулів є B<systemd.service>(5), B<systemd.socket>(5) тощо\&.

source: Equivalent to B<--value> B<--property=>, i\&.e\&. shows the value of the property without the property name or "="\&. Note that using B<-P> once will also affect all properties listed with B<-p>/B<--property=>\&.
uk: Еквівалент B<--value> B<--property=>, тобто виводить значення властивості без назви властивості або «=»\&. Зауважте, що навіть одноразове використання B<-P> стoсуватиметься усіх властивостей зі списку, який отримано за допомогою B<-p>/B<--property=>\&.

source: When listing units with B<list-units>, also show inactive units and units which are following other units\&. When showing unit/job/manager properties, show all properties regardless whether they are set or not\&.
uk: При побудові списку модулів з використанням B<list-units>, також вивести дані неактивних модулів та модулів, які є похідними від інших модулів\&. При показі властивостей модуля, завдання або засобу керування вивести усі властивості, незалежно від того, було встановлено для них значення чи ні\&.

source: To list all units installed in the file system, use the B<list-unit-files> command instead\&.
uk: Щоб отримати список усіх встановлених у файловій системі модулів, скористайтеся замість цієї команди командою B<list-unit-files>\&.

source: When listing units with B<list-dependencies>, recursively show dependencies of all dependent units (by default only dependencies of target units are shown)\&.
uk: При побудові списку модулів за допомогою B<list-dependencies> вивести рекурсивні залежності усіх залежних модулів (типово, буде виведено лише залежності цільових модулів)\&.

source: When used with B<status>, show journal messages in full, even if they include unprintable characters or are very long\&. By default, fields with unprintable characters are abbreviated as "blob data"\&. (Note that the pager may escape unprintable characters again\&.)
uk: Якщо використано разом із B<status>, показувати повідомлення журналу повністю, навіть якщо вони містять непридатні до друку символи або є дуже довгими\&. Типово, поля із непридатними до друку символами обрізаються як «бінарні дані»\&. (Зауважте, що програма поділу даних на сторінки може виконати додаткове екранування непридатних до друку символів\&.)

source: When listing units, also show units of local containers\&. Units of local containers will be prefixed with the container name, separated by a single colon character (":")\&.
uk: При побудові списку модулів також вивести дані модулів локальних контейнерів\&. Записи модулів локальних контейнерів матимуть префікс — назву контейнера, відокремлений від назви одинарною двокрапкою («:»)\&.

source: Show reverse dependencies between units with B<list-dependencies>, i\&.e\&. follow dependencies of type I<WantedBy=>, I<RequiredBy=>, I<PartOf=>, I<BoundBy=>, instead of I<Wants=> and similar\&.
uk: Вивести зворотні залежності між модулями з використанням B<list-dependencies>, тобто слідувати залежностям типу I<WantedBy=>, I<RequiredBy=>, I<PartOf=>, I<BoundBy=>, замість I<Wants=> і подібних\&.

source: With B<list-dependencies>, show the units that are ordered before the specified unit\&. In other words, recursively list units following the I<After=> dependency\&.
uk: Із B<list-dependencies> вивести дані модулів, які перебувають у порядку перед вказаним модулем\&. Іншими словами, вивести рекурсивний список модулів із залежністю I<After=>\&.
