Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: Specify the process signal to send to the container\*(Aqs PID 1 when nspawn itself receives B<SIGTERM>, in order to trigger an orderly shutdown of the container\&. Defaults to B<SIGRTMIN+3> if B<--boot> is used (on systemd-compatible init systems B<SIGRTMIN+3> triggers an orderly shutdown)\&. If B<--boot> is not used and this option is not specified the container\*(Aqs processes are terminated abruptly via B<SIGKILL>\&. For a list of valid signals, see B<signal>(7)\&.
de: Gibt das an PID 1 des Containers zu sendende Prozesssignal an, wenn Nspawn selbst B<SIGTERM> empfängt, um ein geordnetes Herunterfahren des Containers auszulösen\&. Standardmäßig B<SIGRTMIN+3>, falls B<--boot> verwandt wird (auf Systemd-kompatiblen Init-Systemen löst B<SIGRTMIN+3> ein geordnetes Herunterfahren aus)\&. Falls B<--boot> nicht verwandt wird und diese Option nicht angegeben ist, dann werden die Prozesse im Container abrupt mit B<SIGKILL> beendet\&. Siehe B<signal>(7) für eine Liste gültiger Signale\&.

source: Configures support for notifications from the container\*(Aqs init process\&. B<--notify-ready=> takes a boolean (B<no> and B<yes>)\&. With option B<no> systemd-nspawn notifies systemd with a "READY=1" message when the init process is created\&. With option B<yes> systemd-nspawn waits for the "READY=1" message from the init process in the container before sending its own to systemd\&. For more details about notifications see B<sd_notify>(3)\&.
de: Konfiguriert Unterstützung für Benachrichtigungen von dem Init-Prozess des Containers\&. B<--notify-ready=> akzeptiert einen logischen Wert (B<no> und B<yes>)\&. Mit der Option B<no> benachrichtigt Systemd-nspawn Systemd mit einer »READY=1«-Meldung, wenn der Init-Prozess erstellt wurde\&. Mit der Option B<yes> wartet Systemd-nspawn auf die Meldung »READY=1« vom Init-Prozess im Container, bevor er seine eigene an Systemd sendet\&. Weitere Details über Benachrichtigungen finden Sie in B<sd_notify>(3)\&.

source: Expects a boolean argument\&. If true, turns off any form of on-disk file system synchronization for the container payload\&. This means all system calls such as B<sync>(2), B<fsync()>, B<syncfs()>, \&... will execute no operation, and the B<O_SYNC>/B<O_DSYNC> flags to B<open>(2) and related calls will be made unavailable\&. This is potentially dangerous, as assumed data integrity guarantees to the container payload are not actually enforced (i\&.e\&. data assumed to have been written to disk might be lost if the system is shut down abnormally)\&. However, this can dramatically improve container runtime performance \(en as long as these guarantees are not required or desirable, for example because any data written by the container is of temporary, redundant nature, or just an intermediary artifact that will be further processed and finalized by a later step in a pipeline\&. Defaults to false\&.
de: Erwartet ein logisches Argument\&. Falls wahr, wird für den Inhalt des Containers jegliche Form von plattengebundener Dateisynchronisation ausgeschaltet\&. Das bedeutet, dass alle Dateisystemaufrufe wie B<sync>(2), B<fsync()>, B<syncfs()>, … nichts ausführen werden und die Schalter B<O_SYNC>/B<O_DSYNC> von B<open>(2) und verwandten Aufrufen nicht verfügbar sein werden\&. Dies ist möglicherweise gefährlich, da angenommene Datenintegritätsgarantien für den Inhalt des Containers nicht tatsächlich durchgesetzt werden (d\&h\&. Daten, von den Schreiben auf Platte angenommen wurden, könnten verlorengehen, falls das System ungewöhnlich heruntergefahren wird)\&. Allerdings kann es die Laufzeitleistung des Containers massiv erhöhen \(en solange diese Garantien weder benötigt noch gewünscht werden, beispielsweise da sämtliche vom Container geschriebenen Daten temporärer, redundanter Art sind oder nur ein Zwischenartefakt, das weiterverarbeitet wird und in einem späteren Schritt in dem Verarbeitungssystem finalisiert wird\&. Standardmäßig falsch\&.

source: System Identity Options
de: Systemidentitätsoptionen

source: Sets the machine name for this container\&. This name may be used to identify this container during its runtime (for example in tools like B<machinectl>(1) and similar), and is used to initialize the container\*(Aqs hostname (which the container can choose to override, however)\&. If not specified, the last component of the root directory path of the container is used, possibly suffixed with a random identifier in case B<--ephemeral> mode is selected\&. If the root directory selected is the host\*(Aqs root directory the host\*(Aqs hostname is used as default instead\&.
de: Setzt den Maschinennamen für diesen Container\&. Dieser Name kann zur Identifizierung des Containers während der Laufzeit verwandt werden (beispielsweise in Werkzeugen wie B<machinectl>(1) und ähnlichen)\&. Er wird zur Initialisierung des Rechnernamens des Containers verwandt (der im Container allerdings außer Kraft gesetzt werden kann)\&. Falls nicht angegeben, wird die letzte Komponente des Wurzelverzeichnispfades des Containers verwandt, wobei möglicherweise eine zufällige Kennzeichnung angehängt wird, falls der Modus B<--ephemeral> ausgewählt ist\&. Falls das ausgewählte Wurzelverzeichnis mit dem Wurzelverzeichnis des Rechners übereinstimmt, wird der eigene Rechnername stattdessen als Vorgabe im Container verwandt\&.

source: Controls the hostname to set within the container, if different from the machine name\&. Expects a valid hostname as argument\&. If this option is used, the kernel hostname of the container will be set to this value, otherwise it will be initialized to the machine name as controlled by the B<--machine=> option described above\&. The machine name is used for various aspect of identification of the container from the outside, the kernel hostname configurable with this option is useful for the container to identify itself from the inside\&. It is usually a good idea to keep both forms of identification synchronized, in order to avoid confusion\&. It is hence recommended to avoid usage of this option, and use B<--machine=> exclusively\&. Note that regardless whether the container\*(Aqs hostname is initialized from the name set with B<--hostname=> or the one set with B<--machine=>, the container can later override its kernel hostname freely on its own as well\&.
de: Steuert den innerhalb des Containers zu setzenden Rechnernamen, falls vom Maschinennamen verschieden\&. Erwartet einen gültigen Rechnernamen als Argument\&. Falls diese Option verwandt wird, wird der Kernel-Rechnername des Containers auf diesen Wert gesetzt, andernfalls wird dieser auf den Maschinennamen, wie mit der oben beschrieben Option B<--machine=> gesteuert, gesetzt\&. Der Maschinenname wird für verschiedene Identifikationsaspekte des Containers von außerhalb verwandt, der mit dieser Option konfigurierbare Kernel-Rechnername ist für die Identifikation des Containers von innen nützlich\&. Normalerweise ist es eine gute Idee, beide Identifikationsformen synchronisiert zu halten, um Verwirrung zu vermeiden\&. Es wird daher empfohlen, die Verwendung dieser Option zu vermeiden und ausschließlich B<--machine=> zu verwenden\&. Beachten Sie, dass der Container später seinen Kernel-Rechnernamen selbst frei außer Kraft setzen kann, unabhängig davon, ob der Name mit der Option B<--hostname=> oder über die Option B<--machine=> initialisiert wurde\&.

source: Set the specified UUID for the container\&. The init system will initialize /etc/machine-id from this if this file is not set yet\&. Note that this option takes effect only if /etc/machine-id in the container is unpopulated\&.
de: Setzt die angegebene UUID für den Container\&. Das Init-System wird /etc/machine-id daraus initialisieren, falls diese Datei noch nicht gesetzt ist\&. Beachten Sie, dass diese Option nur wirksam wird, falls /etc/machine-id im Container noch leer ist\&.

source: Property Options
de: Eigenschaftsoptionen

source: Make the container part of the specified slice, instead of the default machine\&.slice\&. This applies only if the machine is run in its own scope unit, i\&.e\&. if B<--keep-unit> isn\*(Aqt used\&.
de: Fügt den Container als Teil der angegebenen Scheibe hinzu, statt der Vorgabe machine\&.slice\&. Dies gilt nur, falls die Maschine in ihrer eigenen Bereichs-Unit ausgeführt wird, d\&.h\&. falls B<--keep-unit> nicht verwandt wird\&.

source: Set a unit property on the scope unit to register for the machine\&. This applies only if the machine is run in its own scope unit, i\&.e\&. if B<--keep-unit> isn\*(Aqt used\&. Takes unit property assignments in the same format as B<systemctl set-property>\&. This is useful to set memory limits and similar for container\&.
de: Setzt eine Unit-Eigenschaft der für diese Maschine zu registrierenden Bereichs-Unit\&. Dies gilt nur, falls die Maschine in ihrer eigenen Bereichs-Unit ausgeführt wird, d\&.h\&. falls B<--keep-unit> nicht verwandt wird\&. Akzeptiert eine Unit-Eigenschaftszuweisung im gleichen Format wie B<systemctl set-property>\&. Dies ist zum Setzen von Speicherbeschränkungen und Ähnlichem für Container nützlich\&.

source: Controls whether the container is registered with B<systemd-machined>(8)\&. Takes a boolean argument, which defaults to "yes"\&. This option should be enabled when the container runs a full Operating System (more specifically: a system and service manager as PID 1), and is useful to ensure that the container is accessible via B<machinectl>(1) and shown by tools such as B<ps>(1)\&. If the container does not run a service manager, it is recommended to set this option to "no"\&.
de: Steuert, ob der Container mit B<systemd-machined>(8) registriert wird\&. Akzeptiert ein logisches Argument, standardmäßig »yes«\&. Diese Option sollte aktiviert werden, wenn der Container ein vollständiges Betriebssystem ausführt (genauer: ein System- und Diensteverwalter als PID 1)\&. Sie ist nützlich, um sicherzustellen, dass auf den Container mit B<machinectl>(1) zugegriffen und dieser durch Werkzeuge wie B<ps>(1) angezeigt werden kann\&. Falls der Container keinen Diensteverwalter ausführt, wird empfohlen, diese Option auf »no« zu setzen\&.

source: Instead of creating a transient scope unit to run the container in, simply use the service or scope unit B<systemd-nspawn> has been invoked in\&. If B<--register=yes> is set this unit is registered with B<systemd-machined>(8)\&. This switch should be used if B<systemd-nspawn> is invoked from within a service unit, and the service unit\*(Aqs sole purpose is to run a single B<systemd-nspawn> container\&. This option is not available if run from a user session\&.
de: Verwendet einfach die Dienste- oder Bereichs-Unit, in der B<systemd-nspawn> aufgerufen wurde, anstatt eine flüchtige Bereichs-Unit, in der der Container ausgeführt wird, zu erstellen\&. Falls B<--register=yes> gesetzt ist, wird diese Unit mit B<systemd-machined>(8) registriert\&. Dieser Schalter sollte verwandt werden, falls B<systemd-nspawn> aus einer Dienste-Unit heraus aufgerufen wurde und der einzige Zweck der Dienste-Unit die Ausführung eines einzelnen B<systemd-nspawn>-Containers ist\&. Diese Option ist bei der Ausführung aus einer Benutzersitzung heraus nicht verfügbar\&.

source: Note that passing B<--keep-unit> disables the effect of B<--slice=> and B<--property=>\&. Use B<--keep-unit> and B<--register=no> in combination to disable any kind of unit allocation or registration with B<systemd-machined>\&.
de: Beachten Sie, dass die Verwendung von B<--keep-unit> die Wirkung von B<--slice=> und B<--property=> deaktiviert\&. Verwenden Sie B<--keep-unit> und B<--register=no> in Kombination, um jegliche Art von Unit-Zuweisung oder -Registrierung mit B<systemd-machined> zu deaktivieren\&.

source: User Namespacing Options
de: Benutzernamensraum-Optionen

source: Controls user namespacing\&. If enabled, the container will run with its own private set of UNIX user and group ids (UIDs and GIDs)\&. This involves mapping the private UIDs/GIDs used in the container (starting with the container\*(Aqs root user 0 and up) to a range of UIDs/GIDs on the host that are not used for other purposes (usually in the range beyond the host\*(Aqs UID/GID 65536)\&. The parameter may be specified as follows:
de: Steuert Benutzernamensräume\&. Falls aktiviert, wird der Container in seiner eigenen privaten Gruppe an UNIX-Benutzer- und Gruppenkennungen (UIDs und GIDs) ausgeführt\&. Dazu gehört die Abbildung der im Container verwandten privaten UIDs/GIDs (beginnend mit dem Benutzer root mit 0 und höher) auf den Bereich von UIDs/GIDs auf dem Rechner, die noch nicht für andere Zwecke verwandt sind (normalerweise im Bereich höher als UID/GID 65536 auf dem Rechner), abgebildet\&. Dieser Parameter kann wie folgt angegeben werden:

source: If one or two colon-separated numbers are specified, user namespacing is turned on\&. The first parameter specifies the first host UID/GID to assign to the container, the second parameter specifies the number of host UIDs/GIDs to assign to the container\&. If the second parameter is omitted, 65536 UIDs/GIDs are assigned\&.
de: Falls eine oder zwei Doppelpunkt-getrennte Zahlen angegeben sind, werden Benutzernamensräume eingeschaltet\&. Der erste Parameter gibt die erste UID/GID des Rechners an, die dem Container zugewiesen werden soll, der zweite Parameter gibt die Anzahl an UIDs/GIDs an, die dem Container zugewiesen werden soll\&. Falls der zweite Parameter fehlt, werden 65536 UIDs/GIDs zugewiesen\&.

source: If the parameter is "yes", user namespacing is turned on\&. The UID/GID range to use is determined automatically from the file ownership of the root directory of the container\*(Aqs directory tree\&. To use this option, make sure to prepare the directory tree in advance, and ensure that all files and directories in it are owned by UIDs/GIDs in the range you\*(Aqd like to use\&. Also, make sure that used file ACLs exclusively reference UIDs/GIDs in the appropriate range\&. In this mode, the number of UIDs/GIDs assigned to the container is 65536, and the owner UID/GID of the root directory must be a multiple of 65536\&.
de: Falls der Parameter »yes« ist, werden Benutzernamensräume eingeschaltet\&. Der zu verwendende UID-/GID-Bereich wird automatisch aus der Dateieigentümerschaft des Wurzelverzeichnisses des Verzeichnisbaums des Containers bestimmt\&. Um diese Option zu verwenden, muss der Verzeichnisbaum vorher vorbereitet werden, um sicherzustellen, dass alle Dateien und Verzeichnisse UIDs/GIDs in dem von Ihnen gewünschten Bereich gehören\&. Auch müssen alle Datei-ACLs ausschließlich UIDs/GIDs im gewünschten Bereich referenzieren\&. In diesem Modus ist die Anzahl der dem Container zugewiesenen UIDs/GIDS 65536, und die Eigentümer-UID/GID des Wurzelverzeichnisses muss ein Vielfaches von 65536 sein\&.

source: If the parameter is "no", user namespacing is turned off\&. This is the default\&.
de: Falls der Parameter »no« ist, werden Benutzernamensräume ausgeschaltet\&. Dies ist die Vorgabe\&.

source: If the parameter is "identity", user namespacing is employed with an identity mapping for the first 65536 UIDs/GIDs\&. This is mostly equivalent to B<--private-users=0:65536>\&. While it does not provide UID/GID isolation, since all host and container UIDs/GIDs are chosen identically it does provide process capability isolation, and hence is often a good choice if proper user namespacing with distinct UID maps is not appropriate\&.
de: Falls dieser Parameter »identity« ist, werden Benutzer-Namensräume mit einer identischen Abbildung für die ersten 65536 UIDs/GIDs eingesetzt\&. Dies ist größtenteils äquivalent zu B<--private-users=0:65536>\&. Während es keine UID/GID-Isolierung bereitstellt, da alle Rechner- und Container-UIDs/GIDs identisch ausgewählt werden, bietet es dennoch Isolation der Prozess-Capabilitys und ist daher oft eine gute Wahl, falls ein ordentlicher Benutzernamensraum mit unterschiedlichen UID-Abbildungen nicht angemessen ist\&.

source: The special value "pick" turns on user namespacing\&. In this case the UID/GID range is automatically chosen\&. As first step, the file owner UID/GID of the root directory of the container\*(Aqs directory tree is read, and it is checked that no other container is currently using it\&. If this check is successful, the UID/GID range determined this way is used, similar to the behavior if "yes" is specified\&. If the check is not successful (and thus the UID/GID range indicated in the root directory\*(Aqs file owner is already used elsewhere) a new \(en currently unused \(en UID/GID range of 65536 UIDs/GIDs is randomly chosen between the host UID/GIDs of 524288 and 1878982656, always starting at a multiple of 65536, and, if possible, consistently hashed from the machine name\&. This setting implies B<--private-users-ownership=auto> (see below), which possibly has the effect that the files and directories in the container\*(Aqs directory tree will be owned by the appropriate users of the range picked\&. Using this option makes user namespace behavior fully automatic\&. Note that the first invocation of a previously unused container image might result in picking a new UID/GID range for it, and thus in the (possibly expensive) file ownership adjustment operation\&. However, subsequent invocations of the container will be cheap (unless of course the picked UID/GID range is assigned to a different use by then)\&.
de: Der besondere Wert »pick« schaltet Benutzernamensräume ein\&. In diesem Fall wird der UID/GID-Bereich automatisch ausgewählt\&. Im ersten Schritt wird die Eigentümer-UID/GID des Wurzelverzeichnisses des Verzeichnisbaums des Containers eingelesen und überprüft, dass ihn derzeit kein anderer Container verwendet\&. Falls die Überprüfung erfolgreich ist, wird der auf diesem Weg ermittelte UID/GID-Bereich verwandt, ähnlich wie bei der Angabe von »yes«\&. Falls die Überprüfung nicht erfolgreich ist (und daher der durch den Eigentümer des Wurzelverzeichnis angezeigte UID/GID-Bereich bereits woanders verwandt wird), wird ein neuer, derzeit nicht verwendeter, UID/GID-Bereich von 65536 UIDs/GIDs aus dem Bereich 524288 bis 1878982656 auf dem Rechner zufällig ausgewählt, wobei immer bei Vielfachen von 65536 begonnen und, falls möglich, konsistent vom Maschinennamen gehasht wird\&. Diese Einstellung impliziert B<--private-users-ownership=auto> (siehe unten), was möglicherweise bewirkt, dass die Dateien und Verzeichnisse im Verzeichnisbaum des Containers den passenden Benutzern in dem ausgewählten Bereich gehören\&. Mit dieser Option wird das Verhalten von Benutzernamensräumen vollständig automatisiert\&. Beachten Sie, dass der erste Aufruf eines bisher nicht verwandten Containers zur Auswahl eines neuen UID/GID-Bereichs dafür führen könnte und daher eine (möglicherweise aufwändige) Anpassungsaktion für Dateieigentümerschaften erfolgen könnte\&. Der Aufwand für nachfolgende Ausführungen des Containers wird allerdings gering sein (außer natürlich der ausgewählte UID/GID-Bereich wird zu diesem Zeitpunkt anders verwandt)\&.

source: It is recommended to assign at least 65536 UIDs/GIDs to each container, so that the usable UID/GID range in the container covers 16 bit\&. For best security, do not assign overlapping UID/GID ranges to multiple containers\&. It is hence a good idea to use the upper 16 bit of the host 32-bit UIDs/GIDs as container identifier, while the lower 16 bit encode the container UID/GID used\&. This is in fact the behavior enforced by the B<--private-users=pick> option\&.
de: Es wird empfohlen, jedem Container mindestens 65536 UIDs/GIDs zuzuweisen, so dass der verwendbare Bereich an UIDs/GIDs im Container 16 Bit überdeckt\&. Für größtmögliche Sicherheit sollten sich die UID/GID-Bereiche je zweier Container nicht überlappen\&. Daher ist es eine gute Idee, die oberen 16 Bit der 32-Bit-UIDs/GIDs des Rechners als Container-Kennzeichner und die unteren 16-Bit zur Kodierung der im Container verwandten UID/GIDs zu verwenden\&. Dies ist tatsächlich das Verhalten, das die Option B<--private-users=pick> erzwingt\&.

source: When user namespaces are used, the GID range assigned to each container is always chosen identical to the UID range\&.
de: Werden Benutzernamensräume verwandt, wird der jedem Container zugewiesene GID-Bereich immer identisch zu dem UID-Bereich ausgewählt\&.

source: In most cases, using B<--private-users=pick> is the recommended option as it enhances container security massively and operates fully automatically in most cases\&.
de: In den meisten Fällen ist B<--private-users=pick> die empfohlene Option, da sie die Container-Sicherheit massiv erhöht und in den meisten Fällen vollautomatisch funktioniert\&.

source: Note that the picked UID/GID range is not written to /etc/passwd or /etc/group\&. In fact, the allocation of the range is not stored persistently anywhere, except in the file ownership of the files and directories of the container\&.
de: Beachten Sie, dass der ausgewählte UID/GID-Bereich nicht in /etc/passwd oder /etc/group geschrieben wird\&. Tatsächlich wird die Zuweisung des Bereiches nicht irgendwo dauerhaft gespeichert, außer in den Dateieigentümerschaften der Dateien und Verzeichnisse des Containers\&.

source: Note that when user namespacing is used file ownership on disk reflects this, and all of the container\*(Aqs files and directories are owned by the container\*(Aqs effective user and group IDs\&. This means that copying files from and to the container image requires correction of the numeric UID/GID values, according to the UID/GID shift applied\&.
de: Beachten Sie, dass sich dies bei der Verwendung von Benutzernamensräumen in den Dateieigentümerschaften auf der Platte widerspiegelt und alle Dateien und Verzeichnisse des Containers den effektiven Benutzer- und Gruppenkennungen des Containers gehören\&. Dies bedeutet, dass das Kopieren von Dateien in und aus dem Container heraus die Anpassung der numerischen UID/GID-Werte verlangt, je nach angewandter UID/GID-Verschiebung\&.

source: Controls how to adjust the container image\*(Aqs UIDs and GIDs to match the UID/GID range chosen with B<--private-users=>, see above\&. Takes one of "off" (to leave the image as is), "chown" (to recursively B<chown()> the container\*(Aqs directory tree as needed), "map" (in order to use transparent ID mapping mounts) or "auto" for automatically using "map" where available and "chown" where not\&.
de: Steuert, wie die UIDs und GIDs des Containers angepasst werden, um auf den mit B<--private-users=> gewählten UID/GID-Bereich zu passen, siehe oben\&. Akzeptiert entweder »off« (um das Abbild unverändert zu lassen), »chown« (um den Verzeichnisbaum des Containers nach Notwendigkeit rekursiv mit B<chown()> anzupassen), »map« (um Einhängungen mit transparenter Abbildung der Kennungen zu verwenden) oder »auto«, um automatisch »map« wo verfügbar zu verwenden und »chown« wo nicht\&.

source: If "chown" is selected, all files and directories in the container\*(Aqs directory tree will be adjusted so that they are owned by the appropriate UIDs/GIDs selected for the container (see above)\&. This operation is potentially expensive, as it involves iterating through the full directory tree of the container\&. Besides actual file ownership, file ACLs are adjusted as well\&.
de: Passt, falls »chown« ausgewählt ist, alle Dateien und Verzeichnisse im Verzeichnisbaum des Containers an, so dass sie den passenden, für den Container ausgewählten UIDs/GIDs gehören (siehe oben)\&. Diese Aktion ist möglicherweise aufwändig, da sie den vollen Durchlauf durch den Verzeichnisbaum des Containers verlangt\&. Neben der eigentlichen Dateieigentümerschaft werden auch ACLs angepasst\&.
