Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: This option instructs the pager to not send termcap initialization and deinitialization strings to the terminal\&. It is set by default to allow command output to remain visible in the terminal even after the pager exits\&. Nevertheless, this prevents some pager functionality from working, in particular paged output cannot be scrolled with the mouse\&.
uk: Цей параметр наказує засобу поділу на сторінки не надсилати рядки ініціалізації та деініціалізації termcap на термінал\&. Його типово встановлено, щоб лишити видимим виведення команди у терміналі, навіть після завершення роботи засобу поділу на сторінки\&. Тим не менше, це заважає роботі деяких можливостей засобу поділу на сторінки, зокрема виведені дані не можна буде гортати за допомогою миші\&.

source: See B<less>(1) for more discussion\&.
uk: Див. B<less>(1), щоб дізнатися більше\&.

source: Override the charset passed to B<less> (by default "utf-8", if the invoking terminal is determined to be UTF-8 compatible)\&.
uk: Перевизначити набір символів, який передано B<less> (типовим набором є «utf-8», якщо викликаний термінал є сумісним із UTF-8)\&.

source: Takes a boolean argument\&. When true, the "secure" mode of the pager is enabled; if false, disabled\&. If I<$SYSTEMD_PAGERSECURE> is not set at all, secure mode is enabled if the effective UID is not the same as the owner of the login session, see B<geteuid>(2) and B<sd_pid_get_owner_uid>(3)\&. In secure mode, B<LESSSECURE=1> will be set when invoking the pager, and the pager shall disable commands that open or create new files or start new subprocesses\&. When I<$SYSTEMD_PAGERSECURE> is not set at all, pagers which are not known to implement secure mode will not be used\&. (Currently only B<less>(1) implements secure mode\&.)
uk: Приймає булевий аргумент\&. Якщо істина, буде увімкнено «безпечний» режим програми для поділу на сторінки; якщо хибність, режим буде вимкнено\&. Якщо значення I<$SYSTEMD_PAGERSECURE> не встановлено взагалі, безпечний режим буде увімкнено, якщо ефективний UID не збігається із ідентифікатором власника сеансу входу до системи, див\&. B<geteuid>(2) і B<sd_pid_get_owner_uid>(3)\&. У безпечному режимі B<LESSSECURE=1> буде встановлено при виклику засобу поділу на сторінки, і засіб вимкне команди, які відкривають або створюють файли або запускають нові підпроцеси\&. Якщо значення I<$SYSTEMD_PAGERSECURE> взагалі не встановлено, засоби поділу на сторінки, про реалізацію безпечного режиму у яких нічого не відомо, не буде використано\&. (У поточній версії безпечний режим реалізовано лише у B<less>(1)\&.)

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completely disable the pager using B<--no-pager> instead\&.
uk: Зауваження: якщо команди викликають із підвищеними привілеями, наприклад, з використанням B<sudo>(8) або B<pkexec>(1), слід подбати про те, щоб небажані інтерактивні можливості не було увімкнено\&. «Безпечний» режим для засобу поділу на сторінки може бути автоматично увімкнуто, як це описано вище\&. Якщо встановлено значення I<SYSTEMD_PAGERSECURE=0> або якщо змінну не усунено з успадкованого середовища, користувач зможе викликати довільні команди\&. Зауважте, що якщо змінні I<$SYSTEMD_PAGER> або I<$PAGER> слід брати до уваги, то слід встановити і значення I<$SYSTEMD_PAGERSECURE>\&. Втім, у такому випадку, можливо, варто взагалі вимкнути засіб поділу на сторінки за допомогою параметра B<--no-pager>\&.

source: Takes a boolean argument\&. When true, B<systemd> and related utilities will use colors in their output, otherwise the output will be monochrome\&. Additionally, the variable can take one of the following special values: "16", "256" to restrict the use of colors to the base 16 or 256 ANSI colors, respectively\&. This can be specified to override the automatic decision based on I<$TERM> and what the console is connected to\&.
uk: Приймає булевий аргумент\&. Якщо істина, B<systemd> і пов'язані інструменти використовуватимуть кольори у виведених даних\&. Якщо хибність, виведення буде монохроматичним\&. Крім того, змінна може приймати одне з таких особливих значень: «16», «256», щоб обмежити використання кольорів базовими 16 або 256 кольорами ANSI, відповідно\&. Це значення можна встановити для перевизначення автоматичного значення на основі I<$TERM> та того, з чим з'єднано консоль\&.

source: The value must be a boolean\&. Controls whether clickable links should be generated in the output for terminal emulators supporting this\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and other conditions\&.
uk: Значення має бути булевим\&. Визначає, чи має бути створено придатні до натискання посилання у виведенні до емуляторів терміналів, у яких передбачено відповідну підтримку\&. Це значення можна встановити для перевизначення значення, яке встановлено B<systemd> на основі I<$TERM> та інших умов\&.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: NOTES
uk: ПРИМІТКИ

source: When used with B<kill>, choose which processes to send a signal to\&. Must be one of B<main>, B<control> or B<all> to select whether to kill only the main process, the control process or all processes of the unit\&. The main process of the unit is the one that defines the life-time of it\&. A control process of a unit is one that is invoked by the manager to induce state changes of it\&. For example, all processes started due to the I<ExecStartPre=>, I<ExecStop=> or I<ExecReload=> settings of service units are control processes\&. Note that there is only one control process per unit at a time, as only one state change is executed at a time\&. For services of type I<Type=forking>, the initial process started by the manager for I<ExecStart=> is a control process, while the process ultimately forked off by that one is then considered the main process of the unit (if it can be determined)\&. This is different for service units of other types, where the process forked off by the manager for I<ExecStart=> is always the main process itself\&. A service unit consists of zero or one main process, zero or one control process plus any number of additional processes\&. Not all unit types manage processes of these types however\&. For example, for mount units, control processes are defined (which are the invocations of /bin/mount and /bin/umount), but no main process is defined\&. If omitted, defaults to B<all>\&.
uk: Якщо використано разом із B<kill>, визначає, яким процесам слід надіслати сигнал\&. Має бути одним з таких значень: B<main>, B<control> або B<all> — для вибору того, слід припинити роботу основного процесу, процесу керування або усіх процесів модуля\&.Основним процесом модуля є процес, який визначає його термін роботи\&. Процесом керування модуля є процес, який було викликано засобом керування для виконання змін стану модуля\&. Наприклад, усі процеси, які запущено через використання параметрів I<ExecStartPre=>, I<ExecStop=> або I<ExecReload=> модулів служб, є процесами керування\&. Зауважте, що одночасно у кожного модуля може бути лише один процес керування, оскільки одночасно можна виконувати лише одну зміну стану\&. Для служб типу I<Type=forking>, процесом керування є початковий процес, який запущено засобом керування для I<ExecStart=>, а повністю відгалужений від нього процес вже буде розглядатися як основний процес модуля (якщо його можна визначити)\&. У цьому відмінність від модулів служб інших типів, де відгалужений засобом керування процес для I<ExecStart=> є завжди самим по собі основним процесом\&. Модуль служби складається з нуля або одного основного процесу, нуля або одного процесу керування і будь-якої кількості додаткових процесів\&. Втім, процесами цих типів керують не усі типи модулів\&. Наприклад, для модулів монтування визначено процеси керування (ними є виклики /bin/mount і /bin/umount), але основного процесу не визначено\&. Якщо не вказано, типовим варіантом є B<all>\&.

source: $ systemctl status bluetooth ● bluetooth\&.service - Bluetooth service Loaded: loaded (/usr/lib/systemd/system/bluetooth\&.service; enabled; vendor preset: enabled) Active: active (running) since Wed 2017-01-04 13:54:04 EST; 1 weeks 0 days ago Docs: man:bluetoothd(8) Main PID: 930 (bluetoothd) Status: "Running" Tasks: 1 Memory: 648\&.0K CPU: 435ms CGroup: /system\&.slice/bluetooth\&.service └─930 /usr/lib/bluetooth/bluetoothd
uk: $ systemctl status bluetooth ● bluetooth\&.service - Bluetooth service Loaded: loaded (/usr/lib/systemd/system/bluetooth\&.service; enabled; vendor preset: enabled) Active: active (running) since Sun 2022-05-01 08:05:44 EEST; 3h 18min ago Docs: man:bluetoothd(8) Main PID: 899 (bluetoothd) Status: "Running" Tasks: 1 (limit: 7107) Memory: 2\&.0M CPU: 32ms CGroup: /system\&.slice/bluetooth\&.service └─899 /usr/libexec/bluetooth/bluetoothd

source: The "Loaded:" line in the output will show "loaded" if the unit has been loaded into memory\&. Other possible values for "Loaded:" include: "error" if there was a problem loading it, "not-found" if no unit file was found for this unit, "bad-setting" if an essential unit file setting could not be parsed and "masked" if the unit file has been masked\&. Along with showing the path to the unit file, this line will also show the enablement state\&. Enabled commands start at boot\&. See the full table of possible enablement states \(em including the definition of "masked" \(em in the documentation for the B<is-enabled> command\&.
uk: У рядку «Loaded:» виведених даних буде показано «loaded», якщо модуль було завантажено до пам'яті\&. Іншими можливими значеннями для «Loaded:» є такі: «error», якщо виникла проблема під час завантаження; «not-found», якщо не було знайдено файл модуля; «bad-setting», якщо не вдалося обробити критичний параметр файла модуля, і «masked», якщо файл модуля було замасковано\&. Разом із показом шляху до файла модуля, у цьому рядку також буде показано стан вмикання\&. Увімкнені команди запускатимуться під час завантаження системи\&. Із повною таблицею можливих станів вмикання, разом із визначенням терміна «masked», можна ознайомитися у документації з команди B<is-enabled>\&.

source: Dump the systemd manager environment block\&. This is the environment block that is passed to all processes the manager spawns\&. The environment block will be dumped in straight-forward form suitable for sourcing into most shells\&. If no special characters or whitespace is present in the variable values, no escaping is performed, and the assignments have the form "VARIABLE=value"\&. If whitespace or characters which have special meaning to the shell are present, dollar-single-quote escaping is used, and assignments have the form "VARIABLE=$\*(Aqvalue\*(Aq"\&. This syntax is known to be supported by B<bash>(1), B<zsh>(1), B<ksh>(1), and B<busybox>(1)\*(Aqs B<ash>(1), but not B<dash>(1) or B<fish>(1)\&.
uk: Створити дамп блоку середовища засобу керування systemd\&. Це блок середовища, який буде передано усім процесам, які породжено засобом керування системою\&. Дамп блоку середовища буде створено у прямій формі, яка пасує для передавання у більшість командних оболонок\&. Якщо у значеннях змінних немає спеціальних символів або пробілів, екранування не виконуватиметься, а встановлення значень відбувається у формі «ЗМІННА=значення»\&. Якщо у значеннях містяться пробіли або символи, які мають спеціальне значення у командній оболонці, використовують екранування символом долара і одинарних лапок, а встановлення значень відбувається у формі «ЗМІННА=$\*(Aqзначення\*(Aq»\&. Відомо, що підтримку таких синтаксичних конструкцій передбачено у B<bash>(1), B<zsh>(1), B<ksh>(1), та B<ash>(1) з B<busybox>(1), але не у B<dash>(1) або B<fish>(1)\&.

source: Shut down and reboot the system\&. This is mostly equivalent to B<systemctl start reboot\&.target --job-mode=replace-irreversibly --no-block>, but also prints a wall message to all users\&. This command is asynchronous; it will return after the reboot operation is enqueued, without waiting for it to complete\&.
uk: Закрити і перезавантажити систему\&. Це майже еквівалентно B<systemctl start reboot\&.target --job-mode=replace-irreversibly --no-block>, але також друкує повідомлення на стіні для всіх користувачів\&. Ця команда є асинхронною; повернення відбувається після того, як операцію зупинки поставлено в чергу, не чекаючи її завершення\&.
