Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-inhibit.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-inhibit - Execute a program with an inhibition lock taken
de: systemd-inhibit - Ein Programm mit gesetzter Unterdrückungssperre ausführen

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-inhibit >B<[OPTIONS...]>B< >B<[COMMAND]>B< >B<[ARGUMENTS...]>
de: B<systemd-inhibit >B<[OPTIONEN…]>B< >B<[BEFEHL]>B< >B<[ARGUMENTE…]>

source: B<systemd-inhibit >B<[OPTIONS...]>B< --list>
de: B<systemd-inhibit >B<[OPTIONEN…]>B< --list>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-inhibit> may be used to execute a program with a shutdown, sleep, or idle inhibitor lock taken\&. The lock will be acquired before the specified command line is executed and released afterwards\&.
de: B<systemd-inhibit> kann zum Ausführen eines Programms verwandt werden, während die Herunterfahr-, Schlaf- oder Leerlauf-Unterdrückungssperre gesetzt ist\&. Die Sperre wird vor der Ausführung des angegebenen Befehls erlangt und danach wieder freigegeben\&.

source: Inhibitor locks may be used to block or delay system sleep and shutdown requests from the user, as well as automatic idle handling of the OS\&. This is useful to avoid system suspends while an optical disc is being recorded, or similar operations that should not be interrupted\&.
de: Unterdrückungssperren können zum Blocken oder Verzögern von Anfragen des Benutzer zum Systemschlaf und Herunterfahren sowie zur automatischen Leerlaufhandhabung des Betriebssystems verwandt werden\&. Dies ist nützlich, um Systemsuspendierungen zu vermeiden, während optische Platten bespielt werden oder ähnliche Aktionen stattfinden, die nicht unterbrochen werden sollten\&.

source: For more information see the \m[blue]B<Inhibitor Lock Developer Documentation>\m[]\&\s-2\u[1]\d\s+2\&.
de: Für weitere Informationen siehe die \m[blue]B<Entwicklerdokumentation für Unterdrückungssperren>\m[]\&\s-2\u[1]\d\s+2\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Takes a colon-separated list of one or more operations to inhibit: "shutdown", "sleep", "idle", "handle-power-key", "handle-suspend-key", "handle-hibernate-key", "handle-lid-switch", for inhibiting reboot/power-off/halt/kexec, suspending/hibernating, the automatic idle detection, or the low-level handling of the power/sleep key and the lid switch, respectively\&. If omitted, defaults to "idle:sleep:shutdown"\&.
de: Akzeptiert eine Doppelpunkt-getrennte Liste von einer oder mehrerer zu unterdrückenden Aktionen: »shutdown«, »sleep«, »idle«, »handle-power-key«, »handle-suspend-key«, »handle-hibernate-key«, »handle-lid-switch« zum Unterdrücken von Neustart/Ausschalten/Halten/Kexec, Supendierung/Ruhen, der automatischen Leerlauferkennung bzw\&. dem maschinennahen Umgang mit der Einschalt-/Schlaftaste und dem Deckelschalter\&. Falls er fehlt, ist die Vorgabe »idle:sleep:shutdown«\&.

source: Takes a short, human-readable descriptive string for the program taking the lock\&. If not passed, defaults to the command line string\&.
de: Akzeptiert eine kurze, menschenlesbare beschreibende Zeichenkette für das Programm, das diese Sperre setzt\&. Falls nicht angegeben ist, ist die Vorgabe die Befehlszeilenzeichenkette\&.

source: Takes a short, human-readable descriptive string for the reason for taking the lock\&. Defaults to "Unknown reason"\&.
de: Akzeptiert eine kurze, menschenlesbare beschreibende Zeichenkette für den Grund für das Setzen der Sperre\&. Standardmäßig »Unknown reason«\&.

source: Takes either "block" or "delay" and describes how the lock is applied\&. If "block" is used (the default), the lock prohibits any of the requested operations without time limit, and only privileged users may override it\&. If "delay" is used, the lock can only delay the requested operations for a limited time\&. If the time elapses, the lock is ignored and the operation executed\&. The time limit may be specified in B<logind.conf>(5)\&. Note that "delay" is only available for "sleep" and "shutdown"\&.
de: Akzeptiert entweder »block« oder »delay« und beschreibt, wie die Sperre angewandt wird\&. Falls (die Vorgabe) »block« verwandt wird, verhindert die Sperre jede der angeforderten Aktionen ohne Zeitbeschränkung und nur privilegierte Benutzer dürfen sie außer Kraft setzen\&. Falls »delay« verwandt wird, kann die Sperre nur die angeforderten Aktionen für eine begrenzte Zeit verzögern\&. Falls die Zeit abläuft, wird die Sperre ignoriert und die Aktion ausgeführt\&. Die Zeitbeschränkung kann in B<logind.conf>(5) angegeben werden\&. Beachten Sie, dass »delay« nur für »sleep« und »shutdown« verfügbar ist\&.

source: Lists all active inhibition locks instead of acquiring one\&.
de: Listet alle aktiven Unterdrückungssperren auf, statt welche zu erlangen\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Do not print the legend, i\&.e\&. column headers and the footer with hints\&.
de: Gibt die Legende nicht aus, d\&.h\&. die Spaltenköpfe und die Fußzeile mit Hinweisen\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: Returns the exit status of the executed program\&.
de: Liefert den Exit-Status des ausgeführten Programms zurück\&.

source: EXAMPLE
de: BEISPIEL

source: This burns the ISO image foobar\&.iso on a CD using B<wodim>(1), and inhibits system sleeping, shutdown and idle while doing so\&.
de: Dies brennt das ISO-Image foobar\&.iso mittels B<wodim>(1) auf eine CD und verhindert dabei den Systemschlaf, das Systemherunterfahren und den Leerlauf\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The maximum log level of emitted messages (messages with a higher log level, i\&.e\&. less important ones, will be suppressed)\&. Either one of (in order of decreasing importance) B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>, or an integer in the range 0\&...7\&. See B<syslog>(3) for more information\&.
de: Die maximale Protokollierstufe ausgesandter Nachrichten (Nachrichten mit einer höheren Protokollierstufe, d\&.h\&. weniger wichtige, werden unterdrückt)\&. Sie muss (in absteigender Reihenfolge) entweder B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug> oder eine Ganzzahl im Bereich 0…7 sein\&. Siehe B<syslog>(3) für weitere Informationen\&.

source: A boolean\&. If true, messages written to the tty will be colored according to priority\&.
de: Ein logischer Wert\&. Falls wahr, werden auf das TTY geschriebene Nachrichten gemäß ihrer Priorität eingefärbt\&.

source: This setting is only useful when messages are written directly to the terminal, because B<journalctl>(1) and other tools that display logs will color messages based on the log level on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Nachrichten gemäß ihrer Protokollierungsstufe einfärben\&.

source: A boolean\&. If true, console log messages will be prefixed with a timestamp\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten der Konsole ein Zeitstempel vorangestellt\&.

source: This setting is only useful when messages are written directly to the terminal or a file, because B<journalctl>(1) and other tools that display logs will attach timestamps based on the entry metadata on their own\&.
de: Diese Einstellung ist nur nützlich, falls die Nachrichten direkt auf das Terminal oder in eine Datei geschrieben werden, da B<journalctl>(1) und andere Werkzeuge, die Protokolle anzeigen, selbständig Zeitstempel basierend auf ihren Metadaten den Nachrichten anhängen werden\&.

source: A boolean\&. If true, messages will be prefixed with a filename and line number in the source code where the message originates\&.
de: Ein logischer Wert\&. Falls wahr, wird den Protokollnachrichten ein Dateinamen und eine Zeilenummer in dem Quellcode, aus dem die Nachrichten stammen, vorangestellt\&.

source: Note that the log location is often attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass der Protokollierort sowieso oft als Metadaten zu den Journal-Einträgen angehängt ist\&. Die Aufnahme in den Nachrichtentext kann bei der Fehlersuche in Programmen dennoch praktisch sein\&.

source: A boolean\&. If true, messages will be prefixed with the current numerical thread ID (TID)\&.
de: Ein logischer Wert\&. Falls wahr, wird den Nachrichten die aktuelle numerische Thread-Kennung (TID) vorangestellt\&.

source: Note that the this information is attached as metadata to journal entries anyway\&. Including it directly in the message text can nevertheless be convenient when debugging programs\&.
de: Beachten Sie, dass diese Informationen sowieso als Metadatan an Journal-Einträge angehängt wird\&. Die Aufnahme direkt im Nachrichtentext kann aber trotzdem bei der Fehlersuche in Programmen praktisch sein\&.

source: The destination for log messages\&. One of B<console> (log to the attached tty), B<console-prefixed> (log to the attached tty but with prefixes encoding the log level and "facility", see B<syslog>(3), B<kmsg> (log to the kernel circular log buffer), B<journal> (log to the journal), B<journal-or-kmsg> (log to the journal if available, and to kmsg otherwise), B<auto> (determine the appropriate log target automatically, the default), B<null> (disable log output)\&.
de: Das Ziel für Protokolliernachrichten\&. Entweder B<console> (auf das angehängte TTY protokollieren), B<console-prefixed> (auf das angehängte TTY protokollieren, aber die Protokollierstufe und »Einrichtung« voranstellen, siehe B<syslog>(3)), B<kmsg> (in den zirkulären Kernel-Protokollpuffer protokollieren), B<journal> (in das Journal protokollieren (B<journal-or-kmsg> (in das Journal protokollieren, falls verfügbar, und andernfalls nach Kmsg), B<auto> (das geeignete Protokollierziel automatisch ermitteln, die Vorgabe) oder B<null> (die Protokollierung deaktivieren)\&.

source: Pager to use when B<--no-pager> is not given; overrides I<$PAGER>\&. If neither I<$SYSTEMD_PAGER> nor I<$PAGER> are set, a set of well-known pager implementations are tried in turn, including B<less>(1) and B<more>(1), until one is found\&. If no pager implementation is discovered no pager is invoked\&. Setting this environment variable to an empty string or the value "cat" is equivalent to passing B<--no-pager>\&.
de: Zu verwendendes Textanzeigeprogramm, wenn B<--no-pager> nicht angegeben ist; setzt I<$PAGER> außer Kraft\&. Falls weder I<$SYSTEMD_PAGER> noch I<$PAGER> gesetzt sind, wird eine Reihe wohlbekannter Textanzeigeprogrammimplementierungen der Reihe nach ausprobiert, einschließlich B<less>(1) und B<more>(1), bis eines gefunden wird\&. Falls keine Textanzeigeprogrammimplementierung gefunden wird, wird keines aufgerufen\&. Setzen der Umgebungsvariablen auf die leere Zeichenkette oder den Wert »cat« ist äquivalent zur Übergabe von B<--no-pager>\&.

source: Override the options passed to B<less> (by default "FRSXMK")\&.
de: Setzt die an B<less> übergebenen Optionen (standardmäßig »FRSXMK«) außer Kraft\&.

source: Users might want to change two options in particular:
de: Benutzer könnten insbesondere zwei Optionen ändern wollen:

source: This option instructs the pager to exit immediately when Ctrl+C is pressed\&. To allow B<less> to handle Ctrl+C itself to switch back to the pager command prompt, unset this option\&.
de: Diese Option weist das Textanzeigeprogramm an, sich sofort beim Druck von Strg-C zu beenden\&. Um B<less> die Handhabung von Strg-C selbst zum Umschalten auf die Eingabeaufforderung zu erlauben, setzen Sie diese Option zurück\&.

source: If the value of I<$SYSTEMD_LESS> does not include "K", and the pager that is invoked is B<less>, Ctrl+C will be ignored by the executable, and needs to be handled by the pager\&.
de: Falls der Wert von I<$SYSTEMD_LESS> kein »K« enthält und B<less> das aufgerufene Textanzeigeprogramm ist, wird Strg+C durch das Programm ignoriert und muss durch das Textanzeigeprogramm selbst gehandhabt werden\&.

source: This option instructs the pager to not send termcap initialization and deinitialization strings to the terminal\&. It is set by default to allow command output to remain visible in the terminal even after the pager exits\&. Nevertheless, this prevents some pager functionality from working, in particular paged output cannot be scrolled with the mouse\&.
de: Diese Option weist das Textanzeigeprogramm an, keine Termcap-Initialisierungs- und -Deinitalisierungszeichenketten an das Terminal zu senden\&. Dies ist standardmäßig gesetzt, damit die Darstellung von Befehlen selbst nach dem Beenden des Textanzeigeprogramms sichtbar bleibt\&. Allerdings stehen dadurch einige Funktionen des Textanzeigeprogramms nicht zur Verfügung; insbesondere ist das Scrollen in der Ausgabe mit der Maus nicht möglich\&.

source: See B<less>(1) for more discussion\&.
de: Siehe B<less>(1) für weitere Ausführungen\&.

source: Override the charset passed to B<less> (by default "utf-8", if the invoking terminal is determined to be UTF-8 compatible)\&.
de: Setzt den an B<less> zu übergebenden Zeichensatz (standardmäßig »utf-8«, falls das aufrufende Terminal als UTF-8-kompatibel erkannt wurde) außer Kraft\&.

source: Takes a boolean argument\&. When true, the "secure" mode of the pager is enabled; if false, disabled\&. If I<$SYSTEMD_PAGERSECURE> is not set at all, secure mode is enabled if the effective UID is not the same as the owner of the login session, see B<geteuid>(2) and B<sd_pid_get_owner_uid>(3)\&. In secure mode, B<LESSSECURE=1> will be set when invoking the pager, and the pager shall disable commands that open or create new files or start new subprocesses\&. When I<$SYSTEMD_PAGERSECURE> is not set at all, pagers which are not known to implement secure mode will not be used\&. (Currently only B<less>(1) implements secure mode\&.)
de: Akzeptiert einen logischen Wert\&. Wenn wahr, wird der »sichere« Modus des Seitenanzeigeprogramms verwandt, falls falsch, wird dieser deaktiviert\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, dann wird der sichere Modus aktiviert, falls die effektive Kennung nicht identisch zu dem Eigentümer der Anmeldesitzung ist, siehe B<geteuid>(2) und B<sd_pid_get_owner_uid>(3)\&. Im sicheren Modus wird B<LESSSECURE=1> beim Aufruf des Seitenanzeigeprogramms gesetzt und das Seitenanzeigeprogramm muss Befehle deaktivieren, die neue Dateien öffnen oder erstellen oder die einen neuen Unterprozess starten\&. Falls I<$SYSTEMD_PAGERSECURE> überhaupt nicht gesetzt ist, werden Seitenanzeigeprogramme, bei denen unbekannt ist, ob sie einen sicheren Modus implementieren, nicht verwandt\&. (Derzeit implementiert nur B<less>(1) einen sicheren Modus\&.)

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completely disable the pager using B<--no-pager> instead\&.
de: Hinweis: Wenn Befehle mit erhöhten Rechten ausgeführt werden, beispielsweise mittels B<sudo>(8) oder B<pkexec>(1), muss Vorsicht walten gelassen werden, um sicherzustellen, dass keine ungeplanten interaktiven Funktionalitäten aktiviert werden\&. Der »sichere« Modus für das Seitenanzeigeprogramm kann wie oben beschrieben automatisch aktiviert werden\&. Durch Setzen von I<SYSTEMD_PAGERSECURE=0> oder durch Nichtenfernen dieser Einstellung aus der ererbten Umgebung wird es dem Benutzer ermöglicht, beliebige Befehle auszuführen\&. Beachten Sie, dass auch I<$SYSTEMD_PAGERSECURE> gesetzt werden muss, falls die Variablen I<$SYSTEMD_PAGER> oder I<$PAGER> berücksichtigt werden sollen\&. Es kann sinnvoll sein, stattdessen den Seitenanzeiger komplett mit B<--no-pager> zu deaktivieren\&.

source: Takes a boolean argument\&. When true, B<systemd> and related utilities will use colors in their output, otherwise the output will be monochrome\&. Additionally, the variable can take one of the following special values: "16", "256" to restrict the use of colors to the base 16 or 256 ANSI colors, respectively\&. This can be specified to override the automatic decision based on I<$TERM> and what the console is connected to\&.
de: Akzeptiert ein logisches Argument\&. Wenn wahr, werden B<systemd> und verwandte Hilfswerkzeuge Farben in ihrer Ausgabe verwenden, andernfalls wird die Ausgabe einfarbig sein\&. Zusätzlich kann die Variable eine der folgenden besonderen Werte annehmen: »16«, »256«, um die Verwendung von Farbe auf die grundlegenden 16 bzw. 256 ANSI-Farben zu beschränken\&. Dies kann festgelegt werden, um die auf I<$TERM> und der vorliegenden Verbindung der Konsole basierende automatische Entscheidung außer Kraft zu setzen\&.

source: The value must be a boolean\&. Controls whether clickable links should be generated in the output for terminal emulators supporting this\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and other conditions\&.
de: Dies muss ein logischer Wert sein\&. Er steuert, ob anklickbare Links für Terminal-Emulatoren, die dies unterstützen, erstellt werden sollen\&. Dies kann angegeben werden, um die Entscheidung, die B<systemd> basierend auf I<$TERM> und anderen Bedingungen trifft, außer Kraft zu setzen\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: Inhibitor Lock Developer Documentation
de: Entwicklerdokumentation für die Unterdrückungssperre

source: The value must be a boolean\&. Controls whether colorized output should be generated\&. This can be specified to override the decision that B<systemd> makes based on I<$TERM> and what the console is connected to\&.
de: Dies muss ein logischer Wert sein\&. Er steuert, ob farbige Ausgabe erstellt werden soll\&. Dies kann angegeben werden, um die Entscheidung, die B<systemd> basierend auf I<$TERM> und der Art der angebundenen Konsole trifft, außer Kraft zu setzen\&.

source: Note: when commands are invoked with elevated privileges, for example under B<sudo>(8) or B<pkexec>(1), care must be taken to ensure that unintended interactive features are not enabled\&. "Secure" mode for the pager may be enabled automatically as describe above\&. Setting I<SYSTEMD_PAGERSECURE=0> or not removing it from the inherited environment allows the user to invoke arbitrary commands\&. Note that if the I<$SYSTEMD_PAGER> or I<$PAGER> variables are to be honoured, I<$SYSTEMD_PAGERSECURE> must be set too\&. It might be reasonable to completly disable the pager using B<--no-pager> instead\&.
de: Hinweis: Wenn Befehle mit erhöhten Rechten ausgeführt werden, beispielsweise mittels B<sudo>(8) oder B<pkexec>(1), muss Vorsicht walten gelassen werden, um sicherzustellen, dass keine ungeplanten interaktiven Funktionalitäten aktiviert werden\&. Der »sichere« Modus für das Seitenanzeigeprogramm kann wie oben beschrieben automatisch aktiviert werden\&. Durch Setzen von I<SYSTEMD_PAGERSECURE=0> oder durch Nichtenfernen dieser Einstellung aus der ererbten Umgebung wird es dem Benutzer ermöglicht, beliebige Befehle auszuführen\&. Beachten Sie, dass auch I<$SYSTEMD_PAGERSECURE> gesetzt werden muss, falls die Variablen I<$SYSTEMD_PAGER> oder I<$PAGER> berücksichtigt werden sollen\&. Es kann sinnvoll sein, stattdessen den Seitenanzeiger komplett mit B<--no-pager> zu deaktivieren\&.
