Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemctl.1.po
Languages: uk

source: Option B<--all> may be used to also operate on inactive units which are referenced by other loaded units\&. Note that this is not the same as operating on "all" possible units, because as the previous paragraph describes, such a list is ill-defined\&. Nevertheless, B<systemctl start --all >I<GLOB> may be useful if all the units that should match the pattern are pulled in by some target which is known to be loaded\&.
uk: Для роботи із неактивними модулями, на які посилаються інші завантажені модулі, можна також скористатися параметром B<--all>\&. Зауважте, що це не те саме, що працювати із «усіма» можливими модулями, оскільки, як про це вже написано у попередньому абзаці, такий список є некоректним\&. Втім, B<systemctl start --all >I<ВЗІРЕЦЬ> може бути корисним, якщо усі модулі, які слід знайти за шаблоном, запускаються певною ціллю, про яку відомо, що її буде завантажено\&.

source: B<stop >I<PATTERN>B<\&...>
uk: B<stop >I<ВЗІРЕЦЬ>B<\&...>

source: Stop (deactivate) one or more units specified on the command line\&.
uk: Зупинити (деактивувати) один або декілька модулів, які вказано у рядку команди\&.

source: This command will fail if the unit does not exist or if stopping of the unit is prohibited (see I<RefuseManualStop=> in B<systemd.unit>(5))\&. It will I<not> fail if any of the commands configured to stop the unit (I<ExecStop=>, etc\&.) fail, because the manager will still forcibly terminate the unit\&.
uk: Виконання цієї команди завершиться помилкою, якщо модуля не існує або якщо зупинення модуля заборонено (див. I<RefuseManualStop=> у B<systemd.unit>(5))\&. Виконання I<не> завершиться помилкою, якщо виконання будь-якої з команд, які налаштовано для зупинення модуля (I<ExecStop=> тощо), завершиться помилкою, оскільки засіб керування все одно примусово зупинить роботу модуля\&.

source: B<reload >I<PATTERN>B<\&...>
uk: B<reload >I<ВЗІРЕЦЬ>B<\&...>

source: Asks all units listed on the command line to reload their configuration\&. Note that this will reload the service-specific configuration, not the unit configuration file of systemd\&. If you want systemd to reload the configuration file of a unit, use the B<daemon-reload> command\&. In other words: for the example case of Apache, this will reload Apache\*(Aqs httpd\&.conf in the web server, not the apache\&.service systemd unit file\&.
uk: Наказує усім модулям зі списку у рядку команди перезавантажити налаштування\&. Зауважте, що у результаті буде перезавантажено специфічні для служби налаштування, а не файл налаштувань модуля systemd\&. Якщо вам потрібно, щоб програма systemd перезавантажила файл налаштувань модуля, скористайтеся командою B<daemon-reload>\&. Іншими словами, у випадку, наприклад, Apache, у результаті буде перезавантажено httpd\&.conf у вебсервері Apache, але не файл модуля systemd apache\&.service\&.

source: This command should not be confused with the B<daemon-reload> command\&.
uk: Цю команду не слід плутати із командою B<daemon-reload>\&.

source: B<restart >I<PATTERN>B<\&...>
uk: B<restart >I<ВЗІРЕЦЬ>B<\&...>

source: Stop and then start one or more units specified on the command line\&. If the units are not running yet, they will be started\&.
uk: Зупинити і потім знову запустити один або декілька модулів, які вказано у рядку команди\&. Якщо модулі ще не запущено, їх буде запущено\&.

source: Note that restarting a unit with this command does not necessarily flush out all of the unit\*(Aqs resources before it is started again\&. For example, the per-service file descriptor storage facility (see I<FileDescriptorStoreMax=> in B<systemd.service>(5)) will remain intact as long as the unit has a job pending, and is only cleared when the unit is fully stopped and no jobs are pending anymore\&. If it is intended that the file descriptor store is flushed out, too, during a restart operation an explicit B<systemctl stop> command followed by B<systemctl start> should be issued\&.
uk: Зауважте, що перезапуск модуля за допомогою цієї команди не обов'язково скине усі ресурси модуля, перш ніж його буде знову запущено\&. Наприклад, сховище дескрипторів файлів окремої служби (див. I<FileDescriptorStoreMax=> in B<systemd.service>(5)) лишиться незмінним, доки завдання модуля перебуватиме у черзі обробки — його буде очищено, коли роботу модуля буде повністю зупинено, і у нього не лишиться завдань у черзі\&. Якщо треба скинути і сховище дескрипторів файлів, під час дії з перезапуску слід віддати явно команду B<systemctl stop>, а потім команду B<systemctl start>\&.

source: B<try-restart >I<PATTERN>B<\&...>
uk: B<try-restart >I<ВЗІРЕЦЬ>B<\&...>

source: Stop and then start one or more units specified on the command line if the units are running\&. This does nothing if units are not running\&.
uk: Зупинити і потім знову запустити один або декілька модулів, які вказано у рядку команди, якщо модулі запущено\&. Якщо модулі не запущено, ніяких дій щодо них не виконуватиметься\&.

source: B<reload-or-restart >I<PATTERN>B<\&...>
uk: B<reload-or-restart >I<ВЗІРЕЦЬ>B<\&...>

source: Reload one or more units if they support it\&. If not, stop and then start them instead\&. If the units are not running yet, they will be started\&.
uk: Перезавантажити один або декілька модулів, якщо у них передбачено підтримку таких дій\&. Якщо підтримки перезавантаження не передбачено, зупинити і потім знову запустити ці модулі\&. Якщо модулі ще не запущено, їх буде запущено\&.

source: B<try-reload-or-restart >I<PATTERN>B<\&...>
uk: B<try-reload-or-restart >I<ВЗІРЕЦЬ>B<\&...>

source: Reload one or more units if they support it\&. If not, stop and then start them instead\&. This does nothing if the units are not running\&.
uk: Перезавантажити один або декілька модулів, якщо у них передбачено підтримку таких дій\&. Якщо підтримки перезавантаження не передбачено, зупинити і потім знову запустити ці модулі\&. Якщо модулі не запущено, ніяких дій виконано не буде\&.

source: B<isolate >I<UNIT>
uk: B<isolate >I<МОДУЛЬ>

source: Start the unit specified on the command line and its dependencies and stop all others, unless they have B<IgnoreOnIsolate=yes> (see B<systemd.unit>(5))\&. If a unit name with no extension is given, an extension of "\&.target" will be assumed\&.
uk: Запустити модуль, який вказано у рядку команди, і усі його залежності, і зупинити усі інші, якщо для них не вказано B<IgnoreOnIsolate=yes> (див. B<systemd.unit>(5))\&. Якщо вказано назву модуля без суфікса, програма припускатиме, що суфіксом є «\&.target»\&.

source: This command is dangerous, since it will immediately stop processes that are not enabled in the new target, possibly including the graphical environment or terminal you are currently using\&.
uk: Ця команда є небезпечною, оскільки вона негайно припиняє роботу процесів, які не увімкнено у новій цілі, можливо, разом із графічним середовищем або терміналом, яким ви користуєтеся на момент виконання команди\&.

source: Note that this is allowed only on units where B<AllowIsolate=> is enabled\&. See B<systemd.unit>(5) for details\&.
uk: Зауважте, що це є можливим лише для модулів, для яких увімкнено B<AllowIsolate=>\&. Див. B<systemd.unit>(5), щоб дізнатися більше\&.

source: B<kill >I<PATTERN>B<\&...>
uk: B<kill >I<ВЗІРЕЦЬ>B<\&...>

source: Send a signal to one or more processes of the unit\&. Use B<--kill-who=> to select which process to kill\&. Use B<--signal=> to select the signal to send\&.
uk: Надіслати сигнал одному або декільком процесам модуля\&. Скористайтеся B<--kill-who=>, щоб вибрати, роботу якого з процесів слід завершити\&. Скористайтеся B<--signal=>, щоб вибрати сигнал, який слід надіслати\&.

source: B<clean >I<PATTERN>B<\&...>
uk: B<clean >I<ВЗІРЕЦЬ>B<\&...>

source: Remove the configuration, state, cache, logs or runtime data of the specified units\&. Use B<--what=> to select which kind of resource to remove\&. For service units this may be used to remove the directories configured with I<ConfigurationDirectory=>, I<StateDirectory=>, I<CacheDirectory=>, I<LogsDirectory=> and I<RuntimeDirectory=>, see B<systemd.exec>(5) for details\&. For timer units this may be used to clear out the persistent timestamp data if I<Persistent=> is used and B<--what=state> is selected, see B<systemd.timer>(5)\&. This command only applies to units that use either of these settings\&. If B<--what=> is not specified, both the cache and runtime data are removed (as these two types of data are generally redundant and reproducible on the next invocation of the unit)\&.
uk: Вилучити налаштування, стан, кеш, журнал та динамічні дані вказаних модулів\&. Скористайтеся B<--what=>, щоб вибрати тип ресурсу для вилучення\&. Для модулів служб цією командою можна скористатися для вилучення каталогів, які налаштовано за допомогою I<ConfigurationDirectory=>, I<StateDirectory=>, I<CacheDirectory=>, I<LogsDirectory=> та I<RuntimeDirectory=>, див. B<systemd.exec>(5), щоб дізнатися більше\&. Для модулів таймера цією командою можна скористатися для вилучення сталих даних часових позначок, якщо використано I<Persistent=> і вибрано B<--what=state>, див. B<systemd.timer>(5)\&. Ця команда застосовується лише до модулів, у яких використовуються якісь з цих параметрів\&. Якщо не вказано B<--what=>, буде вилучено одразу дані з кешу і динамічні дані (оскільки ці два типи даних є зайвими і відтворюються під час наступного виклику цього модуля)\&.

source: B<freeze >I<PATTERN>B<\&...>
uk: B<freeze >I<ВЗІРЕЦЬ>B<\&...>

source: Freeze one or more units specified on the command line using cgroup freezer
uk: Заморозити один або декілька модулів, які вказано у командному рядку за допомогою засобу замороження cgroup

source: Freezing the unit will cause all processes contained within the cgroup corresponding to the unit to be suspended\&. Being suspended means that unit\*(Aqs processes won\*(Aqt be scheduled to run on CPU until thawed\&. Note that this command is supported only on systems that use unified cgroup hierarchy\&. Unit is automatically thawed just before we execute a job against the unit, e\&.g\&. before the unit is stopped\&.
uk: Заморожування модуля спричинить призупинення усіх процесів, які місяться у cgroup, що відповідає модулю\&. Призупинення означає, що процеси модуля не буде заплановано для виконання на центральному процесорі, доки модуль не буде розморожено\&. Зауважте, що підтримку цієї команди передбачено лише на системах, які використовують уніфіковану ієрархію cgroup\&. Модуль буде автоматично розморожено одразу перед виконанням завдання щодо модуля, наприклад, перед тим, як модуль буде зупинено\&.

source: B<thaw >I<PATTERN>B<\&...>
uk: B<thaw >I<ВЗІРЕЦЬ>B<\&...>

source: Thaw (unfreeze) one or more units specified on the command line\&.
uk: Розтопити (розморозити) один або декілька модулів, які вказано у рядку команди\&.

source: This is the inverse operation to the B<freeze> command and resumes the execution of processes in the unit\*(Aqs cgroup\&.
uk: Це обернена дія до команди B<freeze>, і вона відновлює виконання процесів для cgroup модуля\&.

source: B<set-property >I<UNIT>B< >I<PROPERTY>B<=>I<VALUE>B<\&...>
uk: B<set-property >I<МОДУЛЬ>B< >I<ВЛАСТИВІСТЬ>B<=>I<ЗНАЧЕННЯ>B<\&...>

source: Set the specified unit properties at runtime where this is supported\&. This allows changing configuration parameter properties such as resource control settings at runtime\&. Not all properties may be changed at runtime, but many resource control settings (primarily those in B<systemd.resource-control>(5)) may\&. The changes are applied immediately, and stored on disk for future boots, unless B<--runtime> is passed, in which case the settings only apply until the next reboot\&. The syntax of the property assignment follows closely the syntax of assignments in unit files\&.
uk: Встановити вказані властивості модуля у середовищі виконання, де передбачено відповідну підтримку\&. Ця команда уможливлює зміну властивостей параметра налаштувань, зокрема параметрів керування ресурсами у середовищі виконання\&. Не усі властивості може бути динамічно змінено, але багато з параметрів керування ресурсами (в основному, властивостей у B<systemd.resource-control>(5)) можна\&. Зміни буде застосовано негайно і збережено на диск для майбутніх завантажень, якщо не буде передано параметр B<--runtime>, бо у цьому випадку параметри буде застосовано лише під час наступного перезавантаження системи\&. Синтаксис надання властивостям значень близько наслідує синтаксис надання значень у файлах модулів\&.

source: Example: B<systemctl set-property foobar\&.service CPUWeight=200>
uk: Приклад: B<systemctl set-property foobar\&.service CPUWeight=200>

source: If the specified unit appears to be inactive, the changes will be only stored on disk as described previously hence they will be effective when the unit will be started\&.
uk: Якщо вказаний модуль виглядає неактивним, зміни буде збережено на лише диску, як це описано раніше, отже вони набудуть чинності, коли модуль буде запущено\&.

source: Note that this command allows changing multiple properties at the same time, which is preferable over setting them individually\&.
uk: Зауважте, що за допомогою цієї команди можна змінити декілька властивостей одночасно. Це пріоритетніший спосіб за встановлення значень кожної властивості окремою командою\&.

source: Example: B<systemctl set-property foobar\&.service CPUWeight=200 MemoryMax=2G IPAccounting=yes>
uk: Приклад: B<systemctl set-property foobar\&.service CPUWeight=200 MemoryMax=2G IPAccounting=yes>

source: Like with unit file configuration settings, assigning an empty setting usually resets a property to its defaults\&.
uk: Подібно параметрам налаштування у файлі модуля, встановлення порожнього значення скидає властивість до типового значення\&.

source: Example: B<systemctl set-property avahi-daemon\&.service IPAddressDeny=>
uk: Приклад: B<systemctl set-property avahi-daemon\&.service IPAddressDeny=>

source: B<bind> I<UNIT> I<PATH> [I<PATH>]
uk: B<bind> I<МОДУЛЬ> I<ШЛЯХ> [I<ШЛЯХ>]

source: Bind-mounts a file or directory from the host into the specified unit\*(Aqs mount namespace\&. The first path argument is the source file or directory on the host, the second path argument is the destination file or directory in the unit\*(Aqs mount namespace\&. When the latter is omitted, the destination path in the unit\*(Aqs mount namespace is the same as the source path on the host\&. When combined with the B<--read-only> switch, a ready-only bind mount is created\&. When combined with the B<--mkdir> switch, the destination path is first created before the mount is applied\&.
uk: Монтує з прив'язкою файл або каталог з основної системи до вказаного простору монтування модуля\&. Першим аргументом шляху є початковий файл або каталог в основній системі, другим аргументом шляху є файл або каталог призначення у просторі назв модуля\&. Якщо останній пропущено, шлях призначення у просторі назв модуля є тим самим, що і початковий шлях в основній системі\&. Якщо поєднано із перемикачем B<--read-only>, буде створено монтування з прив'язкою лише для читання\&. Якщо поєднано із перемикачем B<--mkdir>, шлях призначення буде створено ще до застосування монтування\&.

source: Note that this option is currently only supported for units that run within a mount namespace (e\&.g\&.: with B<RootImage=>, B<PrivateMounts=>, etc\&.)\&. This command supports bind-mounting directories, regular files, device nodes, B<AF_UNIX> socket nodes, as well as FIFOs\&. The bind mount is ephemeral, and it is undone as soon as the current unit process exists\&. Note that the namespace mentioned here, where the bind mount will be added to, is the one where the main service process runs\&. Other processes (those exececuted by B<ExecReload=>, B<ExecStartPre=>, etc\&.) run in distinct namespaces\&.
uk: Зауважте, що підтримку цього параметра у поточній версії передбачено лише для модулів, які запущено у просторі назв монтування (приклади: B<RootImage=>, B<PrivateMounts=> тощо)\&. У цій команді передбачено підтримку монтування каталогів, звичайних файлів, вузлів пристроїв, вузлів сокетів B<AF_UNIX>, а також FIFO з прив'язкою\&. Монтування з прив'язкою є недовговічним, його можна скасувати, щойно роботу поточного процесу модуля буде завершено\&. Зауважте, що згаданий тут простір назв, до якого буде додано монтування з прив'язкою, є простором назв, у якому працює основний процес служби\&. Інші процеси (ті, які виконуються B<ExecReload=>, B<ExecStartPre=> тощо) працюють в окремих просторах назв\&.

source: B<mount-image> I<UNIT> I<IMAGE> [I<PATH> [I<PARTITION_NAME>:I<MOUNT_OPTIONS>]]
uk: B<mount-image> I<МОДУЛЬ> I<ОБРАЗ> [I<ШЛЯХ> [I<НАЗВА_РОЗДІЛУ>:I<ПАРАМЕТРИ_МОНТУВАННЯ>]]

source: Mounts an image from the host into the specified unit\*(Aqs mount namespace\&. The first path argument is the source image on the host, the second path argument is the destination directory in the unit\*(Aqs mount namespace (i\&.e\&. inside B<RootImage=>/B<RootDirectory=>)\&. The following argument, if any, is interpreted as a colon-separated tuple of partition name and comma-separated list of mount options for that partition\&. The format is the same as the service B<MountImages=> setting\&. When combined with the B<--read-only> switch, a ready-only mount is created\&. When combined with the B<--mkdir> switch, the destination path is first created before the mount is applied\&.
uk: Монтує образ з основної системи до простору назв вказаного модуля\&. Перший аргумент шляху є образ джерела в основній системи, другий аргумент шляху є каталогом призначення у просторі назв монтування модуля (тобто у B<RootImage=>/B<RootDirectory=>)\&. Наступний аргумент, якщо його вказано, буде оброблено як відокремлений двокрапкою кортеж назви розділу і списку відокремлених комами параметрів монтування для цього розділу\&. Формат є тим самим, як для параметра служби B<MountImages=>\&. Якщо поєднано із перемикачем B<--read-only>, буде створено монтування лише для читання\&. Якщо поєднано із перемикачем B<--mkdir>, шлях призначення буде створено ще до застосування монтування\&.

source: Note that this option is currently only supported for units that run within a mount namespace (i\&.e\&. with B<RootImage=>, B<PrivateMounts=>, etc\&.)\&. Note that the namespace mentioned here where the image mount will be added to, is the one where the main service process runs\&. Note that the namespace mentioned here, where the bind mount will be added to, is the one where the main service process runs\&. Other processes (those exececuted by B<ExecReload=>, B<ExecStartPre=>, etc\&.) run in distinct namespaces\&.
uk: Зауважте, що підтримку цього параметра у поточній версії передбачено лише для модулів, які запущено у просторі назв монтування (приклади: B<RootImage=>, B<PrivateMounts=> тощо)\&. Зауважте, що згаданий тут простір назв, до якого буде додано монтування з прив'язкою, є простором назв, у якому працює основний процес служби\&. Інші процеси (ті, які виконуються B<ExecReload=>, B<ExecStartPre=> тощо) працюють в окремих просторах назв\&.

source: Example:
uk: Приклад:

source: B<service-log-level> I<SERVICE> [I<LEVEL>]
uk: B<service-log-level> I<СЛУЖБА> [I<РІВЕНЬ>]

source: If the I<LEVEL> argument is not given, print the current log level as reported by service I<SERVICE>\&.
uk: Якщо аргумент I<РІВЕНЬ> не вказано, вивести поточний рівень журналювання, як його повідомляє служба I<СЛУЖБА>\&.

source: If the optional argument I<LEVEL> is provided, then change the current log level of the service to I<LEVEL>\&. The log level should be a typical syslog log level, i\&.e\&. a value in the range 0\&...7 or one of the strings B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>; see B<syslog>(3) for details\&.
uk: Якщо вказано додатковий аргумент I<РІВЕНЬ>, змінити поточний рівень журналювання служби на I<РІВЕНЬ>\&. Рівнем журналювання має бути типовий рівень журналювання syslog, тобто значення у діапазоні 0\&...7 або один з таких рядків: B<emerg>, B<alert>, B<crit>, B<err>, B<warning>, B<notice>, B<info>, B<debug>; див. B<syslog>(3), щоб дізнатися більше\&.

source: The service must have the appropriate I<BusName=>I<destination> property and also implement the generic B<org.freedesktop.LogControl1>(5) interface\&. (systemctl will use the generic D-Bus protocol to access the org\&.freedesktop\&.LogControl1\&.LogLevel interface for the D-Bus name I<destination>\&.)
uk: Служба повинна мати відповідну властивість I<BusName=>I<призначення>, а також реалізовувати загальний інтерфейс B<org.freedesktop.LogControl1>(5)\&. (systemctl скористається загальним протоколом D-Bus для доступу до інтерфейсу org\&.freedesktop\&.LogControl1\&.LogLevel для назви D-Bus I<призначення>\&.)

source: B<service-log-target> I<SERVICE> [I<TARGET>]
uk: B<service-log-target> I<СЛУЖБА> [I<ЦІЛЬ>]

source: If the I<TARGET> argument is not given, print the current log target as reported by service I<SERVICE>\&.
uk: Якщо аргумент I<ЦІЛЬ> не вказано, вивести поточну ціль журналювання, як її повідомляє служба I<СЛУЖБА>\&.

source: If the optional argument I<TARGET> is provided, then change the current log target of the service to I<TARGET>\&. The log target should be one of the strings B<console> (for log output to the service\*(Aqs standard error stream), B<kmsg> (for log output to the kernel log buffer), B<journal> (for log output to B<systemd-journald.service>(8) using the native journal protocol), B<syslog> (for log output to the classic syslog socket /dev/log), B<null> (for no log output whatsoever) or B<auto> (for an automatically determined choice, typically equivalent to B<console> if the service is invoked interactively, and B<journal> or B<syslog> otherwise)\&.
uk: Якщо надано додатковий аргумент I<ЦІЛЬ>, змінити поточну ціль журналювання служби на I<ЦІЛЬ>\&. Ціллю журналювання має бути один з таких рядків: B<console> (щоб записувати виведені дані до стандартного потоку помилок служби), B<kmsg> (щоб записувати виведення журналу до буфера журналу ядра), B<journal> (щоб записувати виведення журналу до B<systemd-journald.service>(8) за допомогою власного протоколу журналу), B<syslog> (щоб записувати виведення журналу до класичного сокета syslog /dev/log), B<null> (щоб не записувати виведення журналу нікуди) або B<auto> (щоб автоматично вибирати варіант, типово, еквівалент B<console>, якщо службу викликано інтерактивно, і B<journal> або B<syslog> в інших випадках)\&.

source: For most services, only a small subset of log targets make sense\&. In particular, most "normal" services should only implement B<console>, B<journal>, and B<null>\&. Anything else is only appropriate for low-level services that are active in very early boot before proper logging is established\&.
uk: Для більшості служб має сенс використання лише незначної підмножини цілей журналювання\&. Зокрема, більшість «звичайних» служб мають реалізовувати лише B<console>, B<journal> і B<null>\&. Усе інше стосується лише низькорівневих служб, які є активними на дуже ранніх етапах завантаження системи, до того, як буде встановлено належне журналювання\&.

source: B<reset-failed [>I<PATTERN>B<\&...]>
uk: B<reset-failed [>I<ВЗІРЕЦЬ>B<\&...]>
