Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: Container Interface
de: Container-Schnittstelle

source: Discoverable Partitions Specification
de: Spezifikation für auffindbare Partitionen

source: OCI Runtime Specification
de: OCI-Laufzeit-Spezifikation

source: Note that B<systemd-networkd.service>(8) includes by default a network file /lib/systemd/network/80-container-ve\&.network matching the host-side interfaces created this way, which contains settings to enable automatic address provisioning on the created virtual link via DHCP, as well as automatic IP routing onto the host\*(Aqs external network interfaces\&. It also contains /lib/systemd/network/80-container-host0\&.network matching the container-side interface created this way, containing settings to enable client side address assignment via DHCP\&. In case systemd-networkd is running on both the host and inside the container, automatic IP communication from the container to the host is thus available, with further connectivity to the external network\&.
de: Beachten Sie, dass B<systemd-networkd.service>(8) eine Vorgabe-Netzwerkdatei /lib/systemd/network/80-container-ve\&.network enthält, die auf die auf diese Art erstellte Schnittstelle im Rechner passt und die Einstellungen enthält, um die automatische Adressbereitstellung auf der erstellten virtuellen Verbindung mittels DHCP sowie das automatische IP-Routen auf der externen Netzwerkschnittstelle des Rechners aktiviert\&. Sie enthält auch /lib/systemd/network/80-container-host0\&.network, die auf die auf diese Art erstellte Schnittstelle im Container passt und die Einstellung zur Aktivierung der Adresszuweisung mittels DHCP für den Client enthält\&. Wenn Systemd-networkd sowohl im Rechner als auch im Container läuft, ist daher automatische IP-Kommunikation vom Container zum Rechner verfügbar, mit weiterer Verbindung zum externen Netz\&.

source: Note that B<systemd-networkd.service>(8) includes by default a network file /lib/systemd/network/80-container-vz\&.network matching the bridge interfaces created this way, which contains settings to enable automatic address provisioning on the created virtual network via DHCP, as well as automatic IP routing onto the host\*(Aqs external network interfaces\&. Using B<--network-zone=> is hence in most cases fully automatic and sufficient to connect multiple local containers in a joined broadcast domain to the host, with further connectivity to the external network\&.
de: Beachten Sie, dass B<systemd-networkd.service>(8) standardmäßig eine Netzwerkdatei /lib/systemd/network/80-container-vz\&.network enthält, die auf die auf diese Art erstellte Bridge-Schnittstelle passt und die Einstellungen enthält, die die automatische Bereitstellung von Adressen mittels DHCP im erstellten virtuellen Netzwerk sowie das automatische IP-Routen auf den externen Netzwerkschnittstellen des Rechners aktivieren\&. Die Verwendung von B<--network-zone=> ist daher in den meisten Fällen vollautomatisch und ausreichend, um mehrere lokale Container in einer vereinigten Broadcast-Domain mit dem Rechner zu verbinden, einschließlich weiterer Verbindung zum externen Netzwerk\&.

source: B<systemd-nspawn> may be invoked directly from the interactive command line or run as system service in the background\&. In this mode each container instance runs as its own service instance; a default template unit file systemd-nspawn@\&.service is provided to make this easy, taking the container name as instance identifier\&. Note that different default options apply when B<systemd-nspawn> is invoked by the template unit file than interactively on the command line\&. Most importantly the template unit file makes use of the B<--boot> option which is not the default in case B<systemd-nspawn> is invoked from the interactive command line\&. Further differences with the defaults are documented along with the various supported options below\&.
de: B<systemd-nspawn> kann direkt von der interaktiven Befehlszeile aus oder als Systemdienst im Hintergrund aufgerufen werden\&. In diesem Modus betreibt jede Container-Instanz seine eigene Dienste-Instanz; eine Standard-Vorlagen-Unit-Datei systemd-nspawn@\&.service wird bereitgestellt, um dies leicht zu ermöglichen; sie akzeptiert den Container-Namen als Instanzen-Kennzeichner\&. Beachten Sie, dass andere Vorgabeoptionen gelten, wenn B<systemd-nspawn> durch die Vorlagen-Unit-Datei als wenn es interaktiv auf der Befehlszeile aufgerufen wird\&. Der wichtigste Unterschied bei den Vorgaben ist, dass die Vorlagen-Unit-Datei die Option B<--boot> verwendet, während dies beim Aufruf von B<systemd-nspawn> auf der Befehlszeile nicht der Fall ist\&. Weitere Unterschiede in den Vorgaben sind zusammen mit den verschiedenen unterstützten Optionen weiter unten dokumentiert\&.

source: Note that running two B<systemd-nspawn> containers from the same directory tree will not make processes in them see each other\&. The PID namespace separation of the two containers is complete and the containers will share very few runtime objects except for the underlying file system\&. Rather use B<machinectl>(1)\*(Aqs B<login> or B<shell> commands to request an additional login session in a running container\&.
de: Beachten Sie, dass die Ausführung von zwei B<systemd-nspawn>-Containern aus dem gleichen Verzeichnis nicht dazu führt, dass sich die Prozesse in beiden gegenseitig sehen\&. Die PID-Namensraumtrennung der zwei Container ist vollständig und die Container nutzen sehr wenige Laufzeitobjekte gemeinsam, außer das unterliegende Dateisystem\&. Verwenden Sie eher die Befehle B<login> oder B<shell> von B<machinectl>(1), um zusätzliche Anmeldesitzungen in einem laufenden Container zu erbitten\&.

source: If option B<--boot> is specified, the arguments are used as arguments for the init program\&. Otherwise, I<COMMAND> specifies the program to launch in the container, and the remaining arguments are used as arguments for this program\&. If B<--boot> is not used and no arguments are specified, a shell is launched in the container\&.
de: Falls die Option B<-boot> angegeben ist, werden die Argumente als Argumente für das Init-Programm verwandt\&. Andernfalls gibt I<BEFEHL> das zu startende Programm in dem Container an und die verbleibenden Argumente werden als Argumente für dieses Programm benutzt\&. Falls B<--boot> nicht verwandt wird und keine Argumente angegeben sind, wird eine Shell in dem Container gestartet\&.

source: This is for containers which have several bootable directories in them; for example, several \m[blue]B<OSTree>\m[]\&\s-2\u[4]\d\s+2 deployments\&. It emulates the behavior of the boot loader and the initrd which normally select which directory to mount as the root and start the container\*(Aqs PID 1 in\&.
de: Dies ist für Container, die mehrere startfähige Verzeichnisse enthalten, beispielweise mehrere \m[blue]B<OSTree>\m[]\&\s-2\u[4]\d\s+2-Einsätze\&. Sie emuliert das Verhalten eines Systemstartprogrammes und einer Initrd, die normalerweise auswählt, welches Verzeichnis als Wurzel eingehängt und darin PID 1 des Containers gestartet wird\&.

source: Set a unit property on the scope unit to register for the machine\&. This applies only if the machine is run in its own scope unit, i\&.e\&. if B<--keep-unit> isn\*(Aqt used\&. Takes unit property assignments in the same format as B<systemctl set-property>\&. This is useful to set memory limits and similar for the container\&.
de: Setzt eine Unit-Eigenschaft der für diese Maschine zu registrierenden Bereichs-Unit\&. Dies gilt nur, falls die Maschine in ihrer eigenen Bereichs-Unit ausgeführt wird, d\&.h\&. falls B<--keep-unit> nicht verwandt wird\&. Akzeptiert eine Unit-Eigenschaftszuweisung im gleichen Format wie B<systemctl set-property>\&. Dies ist zum Setzen von Speicherbeschränkungen und Ähnlichem für den Container nützlich\&.

source: The special value "pick" turns on user namespacing\&. In this case the UID/GID range is automatically chosen\&. As first step, the file owner UID/GID of the root directory of the container\*(Aqs directory tree is read, and it is checked that no other container is currently using it\&. If this check is successful, the UID/GID range determined this way is used, similarly to the behavior if "yes" is specified\&. If the check is not successful (and thus the UID/GID range indicated in the root directory\*(Aqs file owner is already used elsewhere) a new \(en currently unused \(en UID/GID range of 65536 UIDs/GIDs is randomly chosen between the host UID/GIDs of 524288 and 1878982656, always starting at a multiple of 65536, and, if possible, consistently hashed from the machine name\&. This setting implies B<--private-users-ownership=auto> (see below), which possibly has the effect that the files and directories in the container\*(Aqs directory tree will be owned by the appropriate users of the range picked\&. Using this option makes user namespace behavior fully automatic\&. Note that the first invocation of a previously unused container image might result in picking a new UID/GID range for it, and thus in the (possibly expensive) file ownership adjustment operation\&. However, subsequent invocations of the container will be cheap (unless of course the picked UID/GID range is assigned to a different use by then)\&.
de: Der besondere Wert »pick« schaltet Benutzernamensräume ein\&. In diesem Fall wird der UID/GID-Bereich automatisch ausgewählt\&. Im ersten Schritt wird die Eigentümer-UID/GID des Wurzelverzeichnisses des Verzeichnisbaums des Containers eingelesen und überprüft, dass ihn derzeit kein anderer Container verwendet\&. Falls die Überprüfung erfolgreich ist, wird der auf diesem Weg ermittelte UID/GID-Bereich verwandt, ähnlich wie bei der Angabe von »yes«\&. Falls die Überprüfung nicht erfolgreich ist (und daher der durch den Eigentümer des Wurzelverzeichnis angezeigte UID/GID-Bereich bereits woanders verwandt wird), wird ein neuer, derzeit nicht verwendeter, UID/GID-Bereich von 65536 UIDs/GIDs aus dem Bereich 524288 bis 1878982656 auf dem Rechner zufällig ausgewählt, wobei immer bei Vielfachen von 65536 begonnen und, falls möglich, konsistent vom Maschinennamen gehasht wird\&. Diese Einstellung impliziert B<--private-users-ownership=auto> (siehe unten), was möglicherweise bewirkt, dass die Dateien und Verzeichnisse im Verzeichnisbaum des Containers den passenden Benutzern in dem ausgewählten Bereich gehören\&. Mit dieser Option wird das Verhalten von Benutzernamensräumen vollständig automatisiert\&. Beachten Sie, dass der erste Aufruf eines bisher nicht verwandten Containers zur Auswahl eines neuen UID/GID-Bereichs dafür führen könnte und daher eine (möglicherweise aufwändige) Anpassungsaktion für Dateieigentümerschaften erfolgen könnte\&. Der Aufwand für nachfolgende Ausführungen des Containers wird allerdings gering sein (außer natürlich der ausgewählte UID/GID-Bereich wird zu diesem Zeitpunkt anders verwandt)\&.

source: If set to "copy-host", the /etc/resolv\&.conf file from the host is copied into the container, unless the file exists already and is not a regular file (e\&.g\&. a symlink)\&. Similarly, if "replace-host" is used the file is copied, replacing any existing inode, including symlinks\&. Similarly, if "bind-host" is used, the file is bind mounted from the host into the container\&.
de: Falls auf »copy-host« gesetzt, wird die Datei /etc/resolv\&.conf vom Rechner in den Container kopiert, außer die Datei existiert bereits und ist keine reguläre Datei (z\&.B\&. ein Symlink)\&. Ähnlich wird beim Einsatz von »replace-host« die Datei kopiert und jede existierende Inode ersetzt, einschließlich Symlinks\&. Ähnlich wird beim Einsatz von »bind-host« die Datei vom Rechner in den Container Bind-eingehängt\&.

source: Note that when this option is used in combination with B<--private-users>, the resulting mount points will be owned by the B<nobody> user\&. That\*(Aqs because the mount and its files and directories continue to be owned by the relevant host users and groups, which do not exist in the container, and thus show up under the wildcard UID 65534 (nobody)\&. If such bind mounts are created, it is recommended to make them read-only, using B<--bind-ro=>\&. Alternatively you can use the "idmap" mount option to map the filesystem IDs\&.
de: Beachten Sie, dass die entstehenden Einhängepunkte dem Benutzer B<nobody> gehören werden, falls dies in Kombination mit B<--private-users> verwandt wird\&. Dies ist der Fall, da die Einhängung und deren Dateien und Verzeichnisse weiterhin dem relevanten Benutzer und der relevanten Gruppe des Rechners gehören, die im Container nicht existieren, und daher unter der Joker-UID 65534 (nobody) erscheinen\&. Falls solche bind-Einhängungen erstellt werden, wird empfohlen, diese mit B<--bind-ro=> nur-lesbar zu machen\&. Alternativ können Sie die Einhängeoption »idmap« verwenden, um die Dateisystemkennungen abzubilden\&.

source: For details about overlay file systems, see \m[blue]B<Overlay Filesystem>\m[]\&\s-2\u[5]\d\s+2\&. Note that the semantics of overlay file systems are substantially different from normal file systems, in particular regarding reported device and inode information\&. Device and inode information may change for a file while it is being written to, and processes might see out-of-date versions of files at times\&. Note that this switch automatically derives the "workdir=" mount option for the overlay file system from the top-level directory tree, making it a sibling of it\&. It is hence essential that the top-level directory tree is not a mount point itself (since the working directory must be on the same file system as the top-most directory tree)\&. Also note that the "lowerdir=" mount option receives the paths to stack in the opposite order of this switch\&.
de: Für Details zu Überlagerungsdateisystemen, siehe \m[blue]B<Überlagerungsdateisystem>\m[]\&\s-2\u[5]\d\s+2\&. Beachten Sie, dass sich die Semantiken eines Überlagerungsdateisystems deutlich von denen normaler Dateisysteme unterscheiden, insbesondere im Hinblick auf die gemeldeten Geräte- und Inode-Informationen\&. Geräte- und Inode-Informationen einer Datei können sich während des Hineinschreibens ändern und zeitweilig könnten Prozesse veraltete Versionen von Dateien sehen\&. Beachten Sie, dass dieser Schalter automatisch die Einhängeoption »workdir=« für das Überlagerungsdateisystem vom obersten Verzeichnisbaum ableitet und damit zum Geschwisterverzeichnis wird\&. Es ist damit wesentlich, dass das Verzeichnis oberster Ebene selbst kein Einhängepunkt ist (da das Arbeitsverzeichnis auf dem gleichen Dateisystem wie der oberste Verzeichnisbaum sein muss)\&. Beachten Sie auch, dass die Einhängeoption »lowerdir=« die zu stapelnden Pfade in der umgekehrten Reihenfolge wie bei diesem Schalter erhält\&.

source: Overlay Filesystem
de: Überlagerungsdateisystem

source: B<-E >I<NAME>B<=>I<VALUE>, B<--setenv=>I<NAME>B<=>I<VALUE>
de: B<-E >I<NAME>B<=>I<WERT>, B<--setenv=>I<NAME>B<=>I<WERT>

source: Specifies an environment variable assignment to pass to the init process in the container, in the format "NAME=VALUE"\&. This may be used to override the default variables or to set additional variables\&. This parameter may be used more than once\&.
de: Gibt die Umgebungsvariablenzuweisung im Format »NAME=WERT« an, die an den Init-Prozess im Container übergeben werden soll\&. Dies kann zum Außerkraftsetzen der Vorgabevariablen oder zum Setzen zusätzlicher Variablen verwandt werden\&. Dieser Parameter kann mehr als einmal verwandt werden\&.

source: Bind mount a file or directory from the host into the container\&. Takes one of: a path argument\ \&\(em in which case the specified path will be mounted from the host to the same path in the container, or a colon-separated pair of paths\ \&\(em in which case the first specified path is the source in the host, and the second path is the destination in the container, or a colon-separated triple of source path, destination path and mount options\&. The source path may optionally be prefixed with a "+" character\&. If so, the source path is taken relative to the image\*(Aqs root directory\&. This permits setting up bind mounts within the container image\&. The source path may be specified as empty string, in which case a temporary directory below the host\*(Aqs /var/tmp/ directory is used\&. It is automatically removed when the container is shut down\&. Mount options are comma-separated and currently, only B<rbind> and B<norbind> are allowed, controlling whether to create a recursive or a regular bind mount\&. Defaults to "rbind"\&. Backslash escapes are interpreted, so "\e:" may be used to embed colons in either path\&. This option may be specified multiple times for creating multiple independent bind mount points\&. The B<--bind-ro=> option creates read-only bind mounts\&.
de: Hängt eine Datei oder ein Verzeichnis vom Rechner in den Container mit bind ein\&. Akzeptiert entweder ein Pfad-Argument (dann wird der angegebene Pfad vom Rechner zum gleichen Pfad im Container eingehängt), ein durch Doppelpunkt getrenntes Paar von Pfaden (dann wird der zuerst angegebene Pfad als Quelle auf dem Rechner und der zweite Pfad als Ziel im Container verwandt) oder ein Doppelpunkt-getrenntes Tripel von Quellpfad, Zielpfad und Einhängeoptionen\&. Dem Quellpfad darf optional ein »+«-Zeichen vorangestellt werden\&. In diesem Fall wird der Quellpfad relativ zum Wurzelverzeichnis des Containers betrachtet\&. Damit wird die Einrichtung von bind-Einhängungen innerhalb des Container-Abbildes ermöglicht\&. Der Quellpfad kann als leere Zeichenkette angegeben werden\&. Dann wird ein temporäres Verzeichnis unterhalb von /var/tmp/ im Rechner verwandt\&. Dieses wird beim Herunterfahren des Containers automatisch entfernt\&. Einhängeoptionen werden durch Kommata getrennt und derzeit sind nur B<rbind> und B<norbind> erlaubt, wodurch gesteuert wird, ob rekursive oder reguläre bind-Einhängungen erstellt werden sollen\&. Standardmäßig »rbind«\&. Maskierungen durch Rückwärtsschrägstriche werden interpretiert, so kann »\e:« verwandt werden, um Doppelpunkte in Pfade einzubetten\&. Diese Option kann mehrfach verwandt werden, um mehrere unabhängige bind-Einhängepunkte zu erzeugen\&. Die Option B<--bind-ro=> erstellt nur-lesbare bind-Einhängungen\&.

source: Note that when this option is used in combination with B<--private-users>, the resulting mount points will be owned by the B<nobody> user\&. That\*(Aqs because the mount and its files and directories continue to be owned by the relevant host users and groups, which do not exist in the container, and thus show up under the wildcard UID 65534 (nobody)\&. If such bind mounts are created, it is recommended to make them read-only, using B<--bind-ro=>\&.
de: Beachten Sie, dass die entstehenden Einhängepunkte dem Benutzer B<nobody> gehören werden, falls dies in Kombination mit B<--private-users> verwandt wird\&. Dies ist der Fall, da die Einhängung und deren Dateien und Verzeichnisse weiterhin dem relevanten Benutzer und der relevanten Gruppe des Rechners gehören, die im Container nicht existieren, und daher unter der Joker-UID 65534 (nobody) erscheinen\&. Falls solche bind-Einhängungen erstellt werden, wird empfohlen, diese mit B<--bind-ro=> nur-lesbar zu machen\&.

source: This installs a minimal Fedora distribution into the directory /var/lib/machines/f35 and then boots that OS in a namespace container\&. Because the installation is located underneath the standard /var/lib/machines/ directory, it is also possible to start the machine using B<systemd-nspawn -M f35>\&.
de: Dies installiert eine minimale Fedora-Distribution in das Verzeichnis /var/lib/machines/f35 und startet dann dies Betriebssystem in einem Namensraum-Container\&. Da sich die Installation unterhalb des Standard-/var/lib/machines/-Verzeichnisses befindet, ist es möglich, die Maschine mittels B<systemd-nspawn -M f35> zu starten\&.
