Repository: sebras/manpages-l10n
Catalog: po/*/man1/systemd-nspawn.1.po
Languages: de

source: Typically "map" is the best choice, since it transparently maps UIDs/GIDs in memory as needed without modifying the image, and without requiring an expensive recursive adjustment operation\&. However, it is not available for all file systems, currently\&.
de: Normalerweise ist »map« die beste Wahl, da es transparent die UIDs/GIDs im Speicher wie notwendig ohne Veränderung des Abbilds abbildet und auch keine teure rekursive Anpassungsaktion benötigt\&. Allerdings ist sie derzeit nicht für alle Dateisysteme verfügbar\&.

source: The B<--private-users-ownership=auto> option is implied if B<--private-users=pick> is used\&. This option has no effect if user namespacing is not used\&.
de: Die Option B<--private-users-ownership=auto> wird impliziert, falls B<--private-users=pick> verwandt wird\&. Diese Option hat nur eine Auswirkung, falls Benutzernamensräume verwandt werden\&.

source: If the kernel supports the user namespaces feature, equivalent to B<--private-users=pick --private-users-ownership=auto>, otherwise equivalent to B<--private-users=no>\&.
de: Falls der Kernel die Benutzernamensraumfunktionalität unterstützt, ist dies äquivalent zu B<--private-users=pick --private-users-ownership=auto>, ansonsten zu B<--private-users=no>\&.

source: Note that B<-U> is the default if the systemd-nspawn@\&.service template unit file is used\&.
de: Beachten Sie, dass B<-U> die Vorgabe ist, falls die Vorlagendatei systemd-nspawn@\&.service verwandt wird\&.

source: Note: it is possible to undo the effect of B<--private-users-ownership=chown> (or B<-U>) on the file system by redoing the operation with the first UID of 0:
de: Hinweis: Das Ergebnis von B<--private-users-ownership=chown> (oder B<-U>) auf das Dateisystem kann rückgängig gemacht werden, indem die Aktion mit der ersten UID 0 erneut durchgeführt wird:

source: Networking Options
de: Vernetzungsoptionen

source: Disconnect networking of the container from the host\&. This makes all network interfaces unavailable in the container, with the exception of the loopback device and those specified with B<--network-interface=> and configured with B<--network-veth>\&. If this option is specified, the B<CAP_NET_ADMIN> capability will be added to the set of capabilities the container retains\&. The latter may be disabled by using B<--drop-capability=>\&. If this option is not specified (or implied by one of the options listed below), the container will have full access to the host network\&.
de: Trennt die Vernetzung zwischen Containers und Rechner\&. Damit werden alle Netzwerkschnittstellen im Container nicht mehr verfügbar, Ausnahmen sind nur das Loopback-Gerät und die mit B<--network-interface=> angegebenen und mit B<--network-veth> konfigurierten Schnittstellen\&. Falls diese Option angegeben ist, wird die Capability B<CAP_NET_ADMIN> zu der Gruppe der Capabilities hinzugefügt, die der Container behält\&. Letzteres kann mit B<--drop-capability=> deaktiviert werden\&. Falls diese Option nicht angegeben (oder durch eine der nachfolgend aufgeführten Optionen impliziert) ist, hat der Container vollen Zugriff auf das Netzwerk des Rechners\&.

source: Assign the specified network interface to the container\&. This will remove the specified interface from the calling namespace and place it in the container\&. When the container terminates, it is moved back to the calling namespace\&. Note that B<--network-interface=> implies B<--private-network>\&. This option may be used more than once to add multiple network interfaces to the container\&.
de: Weist die angegebene Netzwerkschnittstelle dem Container zu\&. Dies entfernt die angegebene Schnittstelle aus dem Namensraum des Aufrufenden und legt sie in den Container\&. Wenn der Container sich beendet, wird diese zum aufrufenden Namensraum zurückverschoben\&. Beachten Sie, dass B<--network-interface=> B<--private-network> impliziert\&. Diese Option kann mehr als einmal verwandt werden, um mehrere Netzwerkschnittstellen in dem Container hinzuzufügen\&.

source: Note that any network interface specified this way must already exist at the time the container is started\&. If the container shall be started automatically at boot via a systemd-nspawn@\&.service unit file instance, it might hence make sense to add a unit file drop-in to the service instance (e\&.g\&. /etc/systemd/system/systemd-nspawn@foobar\&.service\&.d/50-network\&.conf) with contents like the following:
de: Beachten Sie, dass alle auf diese Art festgelegten Schnittstellen zum Zeitpunkt des Startens des Containers bereits existieren müssen\&. Falls der Container automatisch beim Systemstart mittels der Unit-Dateiinstanz systemd-nspawn@\&.service gestartet werden soll, kann es daher sinnvoll sein, eine Unit-Dateiergänzung für die Diensteinstanz hinzuzufügen (z\&.B\&. /etc/systemd/system/systemd-nspawn@foobar\&.service\&.d/50-network\&.conf), die Inhalte folgender Art enthält:

source: This will make sure that activation of the container service will be delayed until the "ens1" network interface has shown up\&. This is required since hardware probing is fully asynchronous, and network interfaces might be discovered only later during the boot process, after the container would normally be started without these explicit dependencies\&.
de: Dies stellt sicher, dass die Aktivierung des Container-Dienstes verzögert wird, bis die Netzwerkschnittstelle »ens1« aufgetaucht ist\&. Dies ist notwendig, da Hardwareermittlung vollständig asynchron erfolgt und Netzwerkschnittstellen erst später während des Systemstartprozesses erkannt werden könnten, nachdem der Container normalerweise ohne diese expliziten Abhängigkeiten gestartet worden wäre\&.

source: Create a "macvlan" interface of the specified Ethernet network interface and add it to the container\&. A "macvlan" interface is a virtual interface that adds a second MAC address to an existing physical Ethernet link\&. The interface in the container will be named after the interface on the host, prefixed with "mv-"\&. Note that B<--network-macvlan=> implies B<--private-network>\&. This option may be used more than once to add multiple network interfaces to the container\&.
de: Erstellt eine »macvlan«-Schnittstelle auf der angegebenen Ethernet-Netzwerkschnittstelle und fügt sie dem Container hinzu\&. Eine »macvlan«-Schnittstelle ist eine virtuelle Schnittstelle, die eine zweite MAC-Adresse zu einer bestehenden physischen Ethernet-Verbindung hinzufügt\&. Die Adresse im Container wird nach der Schnittstelle auf dem Rechner benannt, wobei »mv-« vorangestellt wird\&. Beachten Sie, dass B<--network-ipvlan=> B<--private-network> impliziert\&. Diese Option kann mehr als einmal verwandt werden, um mehrere Netzwerkschnittstellen in dem Container hinzuzufügen\&.

source: As with B<--network-interface=>, the underlying Ethernet network interface must already exist at the time the container is started, and thus similar unit file drop-ins as described above might be useful\&.
de: Wie bei B<--network-interface=> muss die zugrundeliegende Ethernet-Netzwerkschnittstelle zum Zeitpunkt des Startens des Containers bereits existieren und daher könnten ähnliche Unit-Dateiergänzungen wie oben beschrieben nützlich sein\&.

source: Create an "ipvlan" interface of the specified Ethernet network interface and add it to the container\&. An "ipvlan" interface is a virtual interface, similar to a "macvlan" interface, which uses the same MAC address as the underlying interface\&. The interface in the container will be named after the interface on the host, prefixed with "iv-"\&. Note that B<--network-ipvlan=> implies B<--private-network>\&. This option may be used more than once to add multiple network interfaces to the container\&.
de: Erstellt eine »ipvlan«-Schnittstelle auf der angegebenen Ethernet-Netzwerkschnittstelle und fügt sie dem Container hinzu\&. Eine »ipvlan«-Schnittstelle ist eine virtuelle Schnittstelle, ähnlich einer »macvlan«-Schnittstelle, die die gleiche MAC-Adresse wie die zugrundeliegende Schnittstelle auf dem Rechner verwendet\&. Die Adresse im Container wird nach der Schnittstelle auf dem Rechner benannt, wobei »iv-« vorangestellt wird\&. Beachten Sie, dass B<--network-ipvlan=> B<--private-network> impliziert\&. Diese Option kann mehr als einmal verwandt werden, um mehrere Netzwerkschnittstellen in dem Container hinzuzufügen\&.

source: Create a virtual Ethernet link ("veth") between host and container\&. The host side of the Ethernet link will be available as a network interface named after the container\*(Aqs name (as specified with B<--machine=>), prefixed with "ve-"\&. The container side of the Ethernet link will be named "host0"\&. The B<--network-veth> option implies B<--private-network>\&.
de: Erstellt eine virtuelle Ethernet-Verbindung (»veth«) zwischen dem Rechner und dem Container\&. Die Rechnerseite der Ethernet-Verbindung wird als Netzwerkschnittstelle verfügbar sein, die nach dem Namen der Maschine (wie mit B<--machine=> angegeben) benannt ist, der »ve-« vorangestellt ist\&. Die Container-Seite der Ethernetverbindung wird »host0« heißen\&. Die Option B<--network-veth> impliziert B<--private-network>\&.

source: Note that B<systemd-networkd.service>(8) includes by default a network file /usr/lib/systemd/network/80-container-ve\&.network matching the host-side interfaces created this way, which contains settings to enable automatic address provisioning on the created virtual link via DHCP, as well as automatic IP routing onto the host\*(Aqs external network interfaces\&. It also contains /usr/lib/systemd/network/80-container-host0\&.network matching the container-side interface created this way, containing settings to enable client side address assignment via DHCP\&. In case systemd-networkd is running on both the host and inside the container, automatic IP communication from the container to the host is thus available, with further connectivity to the external network\&.
de: Beachten Sie, dass B<systemd-networkd.service>(8) eine Vorgabe-Netzwerkdatei /usr/lib/systemd/network/80-container-ve\&.network enthält, die auf die auf diese Art erstellte Schnittstelle im Rechner passt und die Einstellungen enthält, um die automatische Adressbereitstellung auf der erstellten virtuellen Verbindung mittels DHCP sowie das automatische IP-Routen auf der externen Netzwerkschnittstelle des Rechners aktiviert\&. Sie enthält auch /usr/lib/systemd/network/80-container-host0\&.network, die auf die auf diese Art erstellte Schnittstelle im Container passt und die Einstellung zur Aktivierung der Adresszuweisung mittels DHCP für den Client enthält\&. Wenn Systemd-networkd sowohl im Rechner als auch im Container läuft, ist daher automatische IP-Kommunikation vom Container zum Rechner verfügbar, mit weiterer Verbindung zum externen Netz\&.

source: Note that B<--network-veth> is the default if the systemd-nspawn@\&.service template unit file is used\&.
de: Beachten Sie, dass B<--network-veth> die Vorgabe ist, falls die Vorlagen-Unit-Datei systemd-nspawn@\&.service verwandt wird\&.

source: Note that on Linux network interface names may have a length of 15 characters at maximum, while container names may have a length up to 64 characters\&. As this option derives the host-side interface name from the container name the name is possibly truncated\&. Thus, care needs to be taken to ensure that interface names remain unique in this case, or even better container names are generally not chosen longer than 12 characters, to avoid the truncation\&. If the name is truncated, B<systemd-nspawn> will automatically append a 4-digit hash value to the name to reduce the chance of collisions\&. However, the hash algorithm is not collision-free\&. (See B<systemd.net-naming-scheme>(7) for details on older naming algorithms for this interface)\&. Alternatively, the B<--network-veth-extra=> option may be used, which allows free configuration of the host-side interface name independently of the container name \(em but might require a bit more additional configuration in case bridging in a fashion similar to B<--network-bridge=> is desired\&.
de: Beachten Sie, dass Netzwerkschnittstellennamen unter Linux eine maximale Länge von 15 Zeichen haben dürfen, während Container-Namen 64 Zeichen lang sein dürfen\&. Da diese Option den Schnittstellennamen auf der Rechnerseite vom Container-Namen ableitet, ist der Name möglicherweise abgeschnitten\&. Daher muss in diesem Falle aufgepasst werden, dass die Schnittstellennamen eindeutig bleiben; besser noch, Container-Namen sollten im Allgemeinen so ausgewählt werden, dass sie nicht länger als 12 Zeichen sind, um das Abschneiden zu vermeiden\&. Falls der Name abgeschnitten ist, wird B<systemd-nspawn> automatisch einen 4-ziffrigen Hash-Wert an den Namen anhängen, um die Möglichkeit von Kollisionen zu verringern\&. Allerdings ist der Hash-Algorithmus nicht kollisionsfrei\&. (Siehe B<systemd.net-naming-scheme>(7) für Details über ältere Benennungsalgorithmen für diese Schnittstelle)\&. Alternativ kann die Option B<--network-veth-extra=> verwandt werden\&. Sie erlaubt die freie Konfiguration des Schnittstellennamens auf der Rechnerseite unabhängig vom Container-Namen \(em könnte aber ein bisschen mehr an Konfiguration benötigen, falls Bridging im Stile von B<--network-bridge=> erwünscht ist\&.

source: Adds an additional virtual Ethernet link between host and container\&. Takes a colon-separated pair of host interface name and container interface name\&. The latter may be omitted in which case the container and host sides will be assigned the same name\&. This switch is independent of B<--network-veth>, and \(em in contrast \(em may be used multiple times, and allows configuration of the network interface names\&. Note that B<--network-bridge=> has no effect on interfaces created with B<--network-veth-extra=>\&.
de: Fügt eine zusätzliche virtuelle Ethernet-Vebindung zwischen dem Rechner und dem Container hinzu\&. Akzeptiert ein Doppelpunkt-getrenntes Paar von Schnittstellennamen (auf dem Rechner und in dem Container)\&. Letzerer kann entfallen; dann wird auf Seiten des Containers und des Rechners der gleiche Name zugewiesen\&. Dieser Schalter ist unabhängig von B<--network-veth> und kann im Gegensatz zu diesem mehrfach verwandt werden und erlaubt die Konfiguration von Netzwerkschnittstellennamen\&. Beachten Sie, dass B<--network-bridge=> auf mit B<--network-veth-extra=> erstellten Schnittstellen keine Auswirkung hat\&.

source: Adds the host side of the Ethernet link created with B<--network-veth> to the specified Ethernet bridge interface\&. Expects a valid network interface name of a bridge device as argument\&. Note that B<--network-bridge=> implies B<--network-veth>\&. If this option is used, the host side of the Ethernet link will use the "vb-" prefix instead of "ve-"\&. Regardless of the used naming prefix the same network interface name length limits imposed by Linux apply, along with the complications this creates (for details see above)\&.
de: Fügt die Rechnerseite der mit B<--network-veth> erstellten Ethernet-Verbindung zu der angegebenen Ethernet-Bridge-Schnittstelle hinzu\&. Erwartet als Argument einen gültigen Netzwerkschnittstellennamen für das Bridge-Gerät\&. Beachten Sie, dass B<--network-bridge=> B<--network-veth> impliziert\&. Falls diese Option verwandt wird, verwendet die Rechnerseite des Ethernet-Links das Präfix »vb-« anstelle von »ve-«\&. Unabhängig vom verwandten Benennungschema gelten die gleichen Längenbeschränkungen von Linux für Netzwerkschnittstellennamen, zusammen mit den hierdurch entstehenden Komplikationen (siehe oben für Details)\&.

source: As with B<--network-interface=>, the underlying bridge network interface must already exist at the time the container is started, and thus similar unit file drop-ins as described above might be useful\&.
de: Wie bei B<--network-interface=> muss die zugrundeliegende Bridge-Netzwerkschnittstelle zum Zeitpunkt des Startens des Containers bereits existieren und daher könnten ähnliche Unit-Dateiergänzungen wie oben beschrieben nützlich sein\&.

source: Creates a virtual Ethernet link ("veth") to the container and adds it to an automatically managed Ethernet bridge interface\&. The bridge interface is named after the passed argument, prefixed with "vz-"\&. The bridge interface is automatically created when the first container configured for its name is started, and is automatically removed when the last container configured for its name exits\&. Hence, each bridge interface configured this way exists only as long as there\*(Aqs at least one container referencing it running\&. This option is very similar to B<--network-bridge=>, besides this automatic creation/removal of the bridge device\&.
de: Erstellt eine virtuelle Ethernet-Verbindung (»veth«) für den Container und fügt ihn zu den automatisch verwalteten Ethernet-Bridge-Schnittstellen hinzu\&. Die Bridge-Schnittstelle wird nach dem übergebenen Argument benannt, dem »vz-« vorangestellt wird\&. Die Bridge-Schnittstelle wird automatisch erstellt, wenn der erste für diesen Namen konfigurierte Container gestartet wird und automatisch entfernt, wenn der letzte für diesen Namen konfigurierte Container sich beendet\&. Daher existiert jede auf diese Art erstellte Bridge-Schnittstelle nur so lange mindestens ein Container läuft, der sie referenziert\&. Diese Option ist sehr ähnlich zu B<--network-bridge=>, abgesehen von der automatischen Erstellung/Entfernung des Bridge-Gerätes\&.

source: This setting makes it easy to place multiple related containers on a common, virtual Ethernet-based broadcast domain, here called a "zone"\&. Each container may only be part of one zone, but each zone may contain any number of containers\&. Each zone is referenced by its name\&. Names may be chosen freely (as long as they form valid network interface names when prefixed with "vz-"), and it is sufficient to pass the same name to the B<--network-zone=> switch of the various concurrently running containers to join them in one zone\&.
de: Diese Einstellung macht es leicht, mehrere zusammengehörige Container in eine gemeinsame, virtuelle, Ethernet-basierte Broadcast-Domäne zu legen, die hier »Zone« genannt wird\&. Jeder Container darf nur Teil einer Zone sein, aber jede Zone kann eine beliebige Anzahl an Containern enthalten\&. Auf jede Zone kann mit ihrem Namen Bezug genommen werden\&. Namen können frei ausgewählt werden (solange sie einen gültigen Netzwerkschnittstellenamen bilden, denen »vz-« vorangestellt ist) und es reicht aus, den gleichen Namen an den Schalter B<--network-zone=> für die verschiedenen, gleichzeitig laufenden Container zu übergeben, um sie in eine Zone aufzunehmen\&.

source: Note that B<systemd-networkd.service>(8) includes by default a network file /usr/lib/systemd/network/80-container-vz\&.network matching the bridge interfaces created this way, which contains settings to enable automatic address provisioning on the created virtual network via DHCP, as well as automatic IP routing onto the host\*(Aqs external network interfaces\&. Using B<--network-zone=> is hence in most cases fully automatic and sufficient to connect multiple local containers in a joined broadcast domain to the host, with further connectivity to the external network\&.
de: Beachten Sie, dass B<systemd-networkd.service>(8) standardmäßig eine Netzwerkdatei /usr/lib/systemd/network/80-container-vz\&.network enthält, die auf die auf diese Art erstellte Bridge-Schnittstelle passt und die Einstellungen enthält, die die automatische Bereitstellung von Adressen mittels DHCP im erstellten virtuellen Netzwerk sowie das automatische IP-Routen auf den externen Netzwerkschnittstellen des Rechners aktivieren\&. Die Verwendung von B<--network-zone=> ist daher in den meisten Fällen vollautomatisch und ausreichend, um mehrere lokale Container in einer vereinigten Broadcast-Domain mit dem Rechner zu verbinden, einschließlich weiterer Verbindung zum externen Netzwerk\&.

source: Takes the path to a file representing a kernel network namespace that the container shall run in\&. The specified path should refer to a (possibly bind-mounted) network namespace file, as exposed by the kernel below /proc/$PID/ns/net\&. This makes the container enter the given network namespace\&. One of the typical use cases is to give a network namespace under /run/netns created by B<ip-netns>(8), for example, B<--network-namespace-path=/run/netns/foo>\&. Note that this option cannot be used together with other network-related options, such as B<--private-network> or B<--network-interface=>\&.
de: Akzeptiert einen Pfad zu einer Datei, die einen Netzwerk-Namensraum darstellt, in dem der Container ausgeführt werden soll\&. Der angegebene Pfad sollte sich auf eine (möglicherweise »bind«-eingehängte) Netzwerk-Namensraum-Datei beziehen, wie diese durch den Kernel unterhalb von /proc/$PID/ns/net offengelegt wird\&. Dies führt dazu, dass der Container in den durch B<ip-netns>(8) unter /run/netns erstellten angegebenen Netzwerk-Namensraum eintritt\&. Beispiel: B<--network-namespace-path=/run/netns/foo>\&. Beachten Sie, dass diese Option nicht zusammen mit anderen Netzwerk-bezogenen Optionen verwandt werden kann, wie B<--private-network> oder B<--network-interface=>\&.

source: If private networking is enabled, maps an IP port on the host onto an IP port on the container\&. Takes a protocol specifier (either "tcp" or "udp"), separated by a colon from a host port number in the range 1 to 65535, separated by a colon from a container port number in the range from 1 to 65535\&. The protocol specifier and its separating colon may be omitted, in which case "tcp" is assumed\&. The container port number and its colon may be omitted, in which case the same port as the host port is implied\&. This option is only supported if private networking is used, such as with B<--network-veth>, B<--network-zone=> B<--network-bridge=>\&.
de: Bildet einen IP-Port auf dem Rechner auf einen IP-Port im Container ab, falls private Netzwerke aktiviert sind\&. Akzeptiert einen Protokollkennzeichner (entweder »tcp« oder »udp«), getrennt durch einen Doppelpunkt von der Port-Nummer des Rechners im Bereich 1 bis 65535, getrennt durch einen Doppelpunkt von der Container-Port-Nummer im Bereich 1 bis 65535\&. Der Protokollkennzeichner und sein trennender Doppelpunkt kann entfallen, wodurch »tcp« angenommen wird\&. Die Container-Port-Nummer und ihr Doppelpunkt kann entfallen, wodurch der gleiche Port wie auf dem Rechner impliziert wird\&. Diese Option wird nur unterstützt, falls private Netzwerke verwandt werden, wie mit B<--network-veth>, B<--network-zone=> B<--network-bridge=> ausgewählt\&.

source: Security Options
de: Sicherheitsoptionen
