Repository: sebras/manpages-l10n
Catalog: po/*/man1/tapestat.1.po
Languages: de

source: JUNE 2020
de: Juni 2020

source: Linux User's Manual
de: Linux-Anwenderhandbuch

source: NAME
de: BEZEICHNUNG

source: tapestat - Report tape statistics.
de: tapestat - Statistiken zu Bandlaufwerken erstellen.

source: SYNOPSIS
de: ÜBERSICHT

source: B<tapestat [ -k | -m ] [ -t ] [ -V ] [ -y ] [ -z ] [ --human ] [> I<interval >B<[ >I<count >B<] ]>
de: B<tapestat [ -k | -m ] [ -t ] [ -V ] [ -y ] [ -z ] [ --human ] [> I<Intervall> B<[> I<Anzahl> B<] ]>

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<tapestat> command is used for monitoring the activity of tape drives connected to a system.
de: Der Befehl B<tapestat> wird zur Überwachung der Aktivität von Bandlaufwerken verwendet, die mit dem System verbunden sind.

source: The first report generated by the B<tapestat >command provides statistics concerning the time since the system was booted, unless the B<-y> option is used, when this first report is omitted. Each subsequent report covers the time since the previous report.
de: Der erste vom Befehl B<tapestat> erstellte Bericht stellt Statistiken über den Zeitraum seit dem Systemstart bereit, es sei denn, die Option B<-y> wird verwendet, wodurch dieser erste Bericht ausgelassen wird. Jeder der darauf folgenden Berichte bezieht sich auf die Zeit seit dem vorhergehenden Bericht.

source: The I<interval> parameter specifies the amount of time in seconds between each report. The I<count> parameter can be specified in conjunction with the I<interval >parameter. If the I<count >parameter is specified, the value of I<count> determines the number of reports generated at I<interval >seconds apart. If the I<interval >parameter is specified without the I<count> parameter, the B<tapestat> command generates reports continuously.
de: Der Parameter I<Intervall> gibt die Zeit in Sekunden zwischen den einzelnen Berichten an. Der Parameter I<Anzahl> kann zusammen mit dem Parameter I<Intervall> angegeben werden. Falls der Parameter I<Anzahl> angegeben ist, bestimmt dieser Wert die Anzahl der Berichte, die im Abstand von I<Intervall> (in Sekunden) erfolgen. Falls der Parameter I<Intervall> ohne den Parameter I<Anzahl> angegeben ist, erzeugt der Befehl B<tapestat> die Berichte fortlaufend.

source: REPORT
de: BERICHT

source: The B<tapestat> report provides statistics for each tape drive connected to the system. The following data are displayed:
de: Der B<tapestat>-Bericht stellt Statistiken für jedes mit dem System verbundene Bandlaufwerk bereit. Die folgenden Daten werden angezeigt:

source: The number of reads issued expressed as the number per second averaged over the interval.
de: Anzahl der ausgegebenen Lesevorgänge als durchschnittliche Anzahl pro Sekunde gemittelt im Intervall.

source: The number of writes issued expressed as the number per second averaged over the interval.
de: Anzahl der ausgegebenen Schreibvorgänge als durchschnittliche Anzahl pro Sekunde im Intervall.

source: The amount of data read expressed in kilobytes (by default or if option B<-k >used) or megabytes (if option B<-m> used) per second averaged over the interval.
de: Menge der gelesenen Daten, ausgedrückt in Kilobyte (standardmäßig oder wenn die Option B<-k> verwendet wird) oder Megabyte (wenn die Option B<-m> verwendet wird) pro Sekunde, als Durchschnittswert im Intervall ermittelt.

source: The amount of data written expressed in kilobytes (by default or if option B<-k >used) or megabytes (if option B<-m> used) per second averaged over the interval.
de: Menge der geschriebenen Daten, ausgedrückt in Kilobyte (standardmäßig oder wenn die Option B<-k> verwendet wird) oder Megabyte (wenn die Option B<-m> verwendet wird) pro Sekunde, als Durchschnittswert im gesamten Intervall ermittelt.

source: Read percentage wait - The percentage of time over the interval spent waiting for read requests to complete. The time is measured from when the request is dispatched to the SCSI mid-layer until it signals that it completed.
de: Prozentsatz der Lese-Wartezeit - der Prozentsatz der Zeit innerhalb des Intervalls, die mit Warten auf Abschluss von Leseanfragen verbracht wurde. Die Zeit wird vom Aussenden der Anfrage an die SCSI-Zwischenebene bis zur Abschlussmeldung gemessen.

source: Write percentage wait - The percentage of time over the interval spent waiting for write requests to complete. The time is measured from when the request is dispatched to the SCSI mid-layer until it signals that it completed.
de: Prozentsatz der Schreib-Wartezeit - der Prozentsatz der Zeit innerhalb des Intervalls, die mit Warten auf Abschluss von Schreibanfragen verbracht wurde. Die Zeit wird vom Aussenden der Anfrage an die SCSI-Zwischenebene bis zur Abschlussmeldung gemessen.

source: Overall percentage wait - The percentage of time over the interval spent waiting for any I/O request to complete (read, write, and other).
de: Prozentsatz der Gesamt-Wartezeit - der Prozentsatz der Zeit innerhalb des Intervalls, die mit Warten auf Abschluss aller E/A-Anfragen verbracht wurde (lesen, schreiben und andere).

source: The number of I/Os, expressed as the number per second averaged over the interval, where a non-zero residual value was encountered.
de: bezeichnet die Anzahl der E/A-Vorgänge, ausgedrückt als durchschnittliche Anzahl pro Sekunde im Intervall, wobei ein von Null verschiedener Restwert festgestellt wurde.

source: The number of I/Os, expressed as the number per second averaged over the interval, that were included as "other". Other I/O includes ioctl calls made to the tape driver and implicit operations performed by the tape driver such as rewind on close (for tape devices that implement rewind on close). It does not include any I/O performed using methods outside of the tape driver (e.g. via sg ioctls).
de: Die Anzahl der E/A-Vorgänge, ausgedrückt als durchschnittliche Anzahl pro Sekunde innerhalb des Intervalls, die als »andere« einbezogen wurden. Andere E/A-Vorgänge beziehen ioctl-Aufrufe an den Bandlaufwerk-Treiber und implizite Vorgänge wie Zurückspulen beim Schließen ein (für Bandlaufwerke, die Zurückspulen beim Schließen unterstützen). Nicht einbezogen werden E/A-Vorgänge, die mittels Methoden außerhalb des Bandlaufwerk-Treibers ausgeführt werden (zum Beispiel über Sg-Ioctls).

source: OPTIONS
de: OPTIONEN

source: Print sizes in human readable format (e.g. 1.0k, 1.2M, etc.) The units displayed with this option supersede any other default units (e.g. kilobytes, sectors...) associated with the metrics.
de: gibt Größen in einem menschenlesbaren Format aus (zum Beispiel 1.0k, 1.2M, usw.). Die mit dieser Option angezeigten Einheiten ersetzen jegliche andere Standardeinheiten (zum Beispiel Kilobyte oder Sektoren usw.), die den Metriken zugeordnet sind.

source: Show the amount of data written or read in kilobytes per second instead of megabytes. This option is mutually exclusive with B<-m>.
de: zeigt die Menge der geschriebenen oder gelesenen Daten in Kilobyte pro Sekunde statt in Megabyte pro Sekunde an. Diese Option und die Option B<-m> schließen sich gegenseitig aus.

source: Show the amount of data written or read in megabytes per second instead of kilobytes. This option is mutually exclusive with B<-k>.
de: zeigt die Menge der geschriebenen oder gelesenen Daten in Megabyte pro Sekunde statt in Kilobyte pro Sekunde an. Diese Option und die Option B<-k> schließen sich gegenseitig aus.

source: Display time stamps. The time stamp format may depend on the value of the B<S_TIME_FORMAT >environment variable (see below).
de: zeigt Zeitstempel an. Das Zeitstempelformat kann vom Wert der Umgebungsvariable B<S_TIME_FORMAT> abhängen (siehe unten).

source: Print version and exit.
de: Version anzeigen und beenden.

source: Omit the initial statistic showing values since boot.
de: lässt die ursprüngliche Statistik aus, welche die Werte seit dem Systemstart anzeigt.

source: Tell B<tapestat> to omit output for any tapes for which there was no activity during the sample period.
de: weist B<tapestat> an, die Ausgabe für Bandlaufwerke auszulassen, für die keine Aktivität während der Überwachungsperiode festgestellt wurde.

source: CONSIDERATIONS
de: ÜBERLEGUNGEN

source: It is possible for a percentage value (read, write, or other) to be greater than 100 percent (the B<tapestat> command will never show a percentage value more than 999). If rewinding a tape takes 40 seconds where the interval time is 5 seconds the %Oa value would show as 0 in the intervals before the rewind completed and then show as approximately 800 percent when the rewind completes.
de: Es ist möglich, dass ein Prozentwert (lesen, schreiben oder andere) größer als 100 sein kann (der Befehl B<tapestat> zeigt niemals einen Prozentwert größer als 999 an). Wenn das Intervall auf 5 Sekunden festgelegt ist, aber Zurückspulen eines Bandes 40 Sekunden dauert, wird der %0a-Wert als 0 in den Intervallen angezeigt, bevor das Zurückspulen abgeschlossen ist, und nach abgeschlossenem Zurückspulen als etwa 800 Prozent.

source: Similar values will be observed for %Rd and %Wr if a tape drive stops reading or writing and then restarts (that is it stopped streaming). In such a case you may see the r/s or w/s drop to zero and the %Rd/%Wr value could be higher than 100 when reading or writing continues (depending on how long it takes to restart writing or reading). This is only an issue if it happens a lot as it may cause tape wear and will impact on the backup times.
de: Ähnliche Werte werden für %Rd und %Wr beobachtet, wenn ein Bandlaufwerk das Lesen oder Schreiben unterbricht und dann neu startet (das heißt, dass die Datenstromübertragung gestoppt wird). In einem solchen Fall kann es vorkommen, dass die Lese- oder Schreibvorgänge pro Sekunde auf Null fallen und der %Rd/%Wr-Wert höher als 100 sein könnte, wenn das Lesen oder Schreiben fortgesetzt wird (je nachdem, wie lange der Neustart des Lesens oder Schreibens dauert). Dies ist nur dann ein Problem, wenn es häufig vorkommt, da dies zu Bandverschleiß führen kann und sich auf die Datensicherungszeiten auswirkt.

source: For fast tape drives you may see low percentage wait times. This does not indicate an issue with the tape drive. For a slower tape drive (e.g. an older generation DDS drive) the speed of the tape (and tape drive) is much slower than filesystem I/O, percent wait times are likely to be higher. For faster tape drives (e.g. LTO) the percentage wait times are likely to be lower as program writing to or reading from tape is going to be doing a lot more filesystem I/O because of the higher throughput.
de: Bei schnellen Bandlaufwerken werden möglicherweise geringe prozentuale Wartezeiten angezeigt. Das weist nicht auf ein Problem mit dem Bandlaufwerk hin. Für ein langsameres Bandlaufwerk (zum Beispiel ein DDS-Laufwerk der älteren Generation) ist die Geschwindigkeit des Bandes (und somit des Bandlaufwerks) viel geringer als die der E/A-Vorgänge im Dateisystem, daher sind die prozentualen Wartezeiten wahrscheinlich höher. Bei schnelleren Bandlaufwerken (zum Beispiel LTO) sind die prozentualen Wartezeiten wahrscheinlich geringer, da ein Programm, das auf das Band schreibt oder vom Band liest, aufgrund des höheren Durchsatzes mehr Dateisystem-E/A-Vorgänge bewältigen kann.

source: Although tape statistics are implemented in the kernel using atomic variables they cannot be read atomically as a group. All of the statistics values are read from different files under I</sys>, because of this there may be I/O completions while reading the different files for the one tape drive. This may result in a set of statistics for a device that contain some values before an I/O completed and some after.
de: Bandstatistiken werden zwar mittels atomarer Variablen im Kernel implementiert, können aber nicht atomar als Gruppe gelesen werden. Alle statistischen Werte werden aus verschiedenen Dateien unterhalb von I</sys> gelesen. Deshalb kann es vorkommen, dass E/A-Vorgänge erst beim Lesen der verschiedenen Dateien für das eine Bandlaufwerk abgeschlossen werden. Dies kann zu einer Reihe von Statistiken für ein Gerät führen, die einige Werte enthalten, bevor ein E/A-Vorgang abgeschlossen wurde und einige für danach.

source: This command uses rounding down as the rounding method when calculating per second statistics. If, for example, you are using B<dd >to copy one tape to another and running B<tapestat> with an interval of 5 seconds and over the interval there were 3210 writes and 3209 reads then w/s would show 642 and r/s 641 (641.8 rounded down to 641). In such a case if it was a tar archive being copied (with a 10k block size) you would also see a difference between the kB_read/s and kB_wrtn/s of 2 (one I/O 10k in size divided by the interval period of 5 seconds). If instead there were 3210 writes and 3211 reads both w/s and r/s would both show 642 but you would still see a difference between the kB_read/s and kB_wrtn/s values of 2 kB/s.
de: Dieser Befehl rundet Werte ab, wenn die sekundenbezogenen Statistiken ermittelt werden. Falls Sie beispielsweise B<dd> dazu verwenden, ein Band auf ein anderes zu kopieren und B<tapestat> mit einem Intervall von 5 Sekunden ausführen und während des Intervalls 3210 Schreibvorgänge und 3209 Lesevorgänge stattfanden, dann würden 642 Schreibvorgänge pro Sekunde und 641 Lesevorgänge pro Sekunde (641,8 wird dabei auf 641 abgerundet) angezeigt. Wenn es ein zu kopierendes Tar-Archiv (mit einer Blockgröße von 10 kB) wäre, würden Sie auch einen Unterschied von 2 zwischen dem Datendurchsatz (kB_read/s und kB_wrtn/s) erkennen (ein E/A-Vorgang der Größe 10 kB geteilt durch die Intervalldauer von 5 Sekunden). Falls es stattdessen 3210 Schreibvorgänge und 3211 Lesevorgänge gab, würde für beides der gleiche Wert von 642 Vorgängen pro Sekunde angezeigt, aber für den Datendurchsatz würde sich dennoch zwischen den Werten für kB_read/s und kB_wrtn/s eine Differenz von 2kB/s ergeben.

source: This command is provided with an interval in seconds. However internally the interval is tracked per device and can potentially have an effect on the per second statistics reported. The time each set of statistics is captured is kept with those statistics. The difference between the current and previous time is converted to milliseconds for use in calculations. We can look at how this can impact the statistics reported if we use an example of a tar archive being copied between two tape drives using B<dd>. If both devices reported 28900 kilobytes transferred and the reading tape drive had an interval of 5001 milliseconds and the writing tape drive 5000 milliseconds that would calculate out as 5778 kB_read/s and 5780 kB_wrtn/s.
de: Dieser Befehl arbeitet mit einem Intervall in Sekunden. Allerdings wird intern das Intervall pro Gerät erfasst, was sich möglicherweise auf die sekundenbezogenen Statistiken auswirken kann. Die Zeit, zu der jeder Statistiksatz erfasst wird, wird für diese Statistiken beibehalten. Der Unterschied zwischen der aktuellen und der vorherigen Zeit wird zur Verwendung in Berechnungen in Millisekunden umgewandelt. Wir können uns anschauen, wie sich dies auf die gemeldeten Statistiken auswirken kann, wenn wir zum Beispiel ein Tar-Archiv mit B<dd> zwischen zwei Bandlaufwerken kopieren. Wird von beide Geräten eine Übertragung von 28900 Kilobyte gemeldet und das Lesebandlaufwerk hatte einen Intervall von 5001 Millisekunden und das Schreibbandlaufwerk 5000 Millisekunden, dann würden sich 5778 kB_read/s (gelesene Daten pro Sekunde) und 5780 kB_wrtn/s (geschriebene Daten pro Sekunde) ergeben.

source: The impact of some retrieving statistics during an I/O completion, rounding down, and small differences in the interval period on the statistics calculated should be minimal but may be non-zero.
de: Der Einfluss auf die Ermittlung der Statistiken, während ein E/A-Vorgang abgeschlossen wird, oder durch das Abrunden oder durch geringe Unterschiede in der Intervalldauer, ist minimal in Bezug auf die errechneten Statistiken, ist aber dennoch nicht Null.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The B<tapestat> command takes into account the following environment variables:
de: Der Befehl B<tapestat> berücksichtigt die folgenden Umgebungsvariablen:

source: By default statistics are displayed in color when the output is connected to a terminal. Use this variable to change the settings. Possible values for this variable are I<never>, I<always >or I<auto> (the latter is equivalent to the default settings).
de: Standardmäßig werden die Statistiken im Terminal in Farbe dargestellt. Verwenden Sie diese Variable, um die Einstellungen zu ändern. Mögliche Werte für diese Variable sind I<never>, I<always> oder I<auto> (Letzteres ist die Standardeinstellung).

source: Please note that the color (being red, yellow, or some other color) used to display a value is not indicative of any kind of issue simply because of the color. It only indicates different ranges of values.
de: Beachten Sie, dass die Farbe (egal ob rot, gelb oder irgendeine andere Farbe), die zum Anzeigen eines Wertes verwendet wird, nicht allein durch die Färbung eine Bedeutung für die Ausgabe hat. Sie zeigt lediglich verschiedene Wertebereiche an.

source: Specify the colors and other attributes used to display statistics on the terminal. Its value is a colon-separated list of capabilities that defaults to B<H=31;1:I=32;22:M=35;1:N=34;1:Z=34;22>. Supported capabilities are:
de: Diese Variable gibt die Farben und andere Attribute an, die zur Anzeige der Statistiken im Terminal verwendet werden. Deren Wert ist eine durch Doppelpunkte getrennte Liste der Fähigkeiten, standardmäßig B<H=31;1:I=32;22:M=35;1:N=34;1:Z=34;22>. Folgende Fähigkeiten werden unterstützt:

source: SGR (Select Graphic Rendition) substring for percentage values greater than or equal to 75%.
de: SGR-Teilzeichenkette (Select Graphic Rendition) für Prozentwerte größer oder gleich 75%.

source: SGR substring for tape names.
de: SGR-Teilzeichenkette für Bandlaufwerksnamen.

source: SGR substring for percentage values in the range from 50% to 75%.
de: SGR-Teilzeichenkette für Prozentwerte im Bereich von 50% bis 75%.

source: SGR substring for non-zero statistics values.
de: SGR-Teilzeichenkette für von Null verschiedene statistische Werte.

source: SGR substring for zero values.
de: SGR-Teilzeichenkette für Null-Werte.

source: If this variable exists and its value is B<ISO> then the current locale will be ignored when printing the date in the report header. The B<tapestat> command will use the ISO 8601 format (YYYY-MM-DD) instead. The timestamp displayed with option B<-t> will also be compliant with ISO 8601 format.
de: Falls diese Variable existiert und deren Wert auf B<ISO> gesetzt ist, dann wird die aktuelle Locale bei der Ausgabe des Datums in der Berichtsüberschrift ignoriert. Der Befehl B<tapestat> wird dann stattdessen das ISO-8601-Format (JJJJ-MM-TT) verwenden. Der mit der Option B<-t> angezeigte Zeitstempel wird auch zum ISO-8601-Format kompatibel sein.

source: BUGS
de: FEHLER

source: I</sys >filesystem must be mounted for B<tapestat> to work. It will not work on kernels that do not have sysfs support
de: Das I</sys>-Dateisystem muss eingehängt sein, damit B<tapestat> funktioniert. Es wird mit Kerneln nicht funktionieren, die nicht über Sysfs-Unterstützung verfügen.

source: This command requires kernel version 4.2 or later (or tape statistics support backported for an earlier kernel version).
de: Dieser Befehl benötigt einen Kernel der Version 4.2 oder neuer (oder die auf eine frühere Kernelversion zurückportierte Unterstützung für Bandlaufwerk-Statistiken).

source: Although B<tapestat> speaks of kilobytes (kB), megabytes (MB)..., it actually uses kibibytes (kiB), mebibytes (MiB)... A kibibyte is equal to 1024 bytes, and a mebibyte is equal to 1024 kibibytes.
de: Obwohl B<tapestat> Kilobyte (kB), Megabyte (MB) usw. meldet, sind eigentlich Kibibyte (kiB), Mebibyte (MiB) usw. gemeint. Ein Kibibyte ist gleich 1024 Byte und ein Mebibyte ist gleich 1024 Kibibyte.

source: FILES
de: DATEIEN

source: I</sys/class/scsi_tape/stE<lt>numE<gt>/stats/*>
de: I</sys/class/scsi_tape/stE<lt>ZahlE<gt>/stats/*>

source: Statistics files for tape devices.
de: Statistikdateien für Bandlaufwerke.

source: I</proc/uptime >contains system uptime.
de: I</proc/uptime> enthält die Laufzeit des Systems.

source: AUTHOR
de: AUTOR

source: Initial revision by Shane M. SEYMOUR (shane.seymour E<lt>atE<gt> hpe.com)
de: Ursprüngliche Revision von Shane M. SEYMOUR (shane.seymour E<lt>atE<gt> hpe.com)

source: Modified for sysstat by Sebastien Godard (sysstat E<lt>atE<gt> orange.fr)
de: Für Sysstat angepasst von Sebastien Godard (sysstat E<lt>atE<gt> orange.fr)

source: SEE ALSO
de: SIEHE AUCH

source: JULY 2018
de: Juli 2018

source: B<tapestat [ -k | -m ] [ -t ] [ -V ] [ -y ] [ -z ] [ --human ] [> I<interval> B<[> I<count> B<] ]>
de: B<tapestat [ -k | -m ] [ -t ] [ -V ] [ -y ] [ -z ] [ --human ] [> I<Intervall> B<[> I<Anzahl> B<] ]>

source: The first report generated by the B<tapestat> command provides statistics concerning the time since the system was booted, unless the B<-y> option is used, when this first report is omitted. Each subsequent report covers the time since the previous report.
de: Der erste vom Befehl B<tapestat> erstellte Bericht stellt Statistiken über den Zeitraum seit dem Systemstart bereit, es sei denn, die Option B<-y> wird verwendet, wodurch dieser erste Bericht ausgelassen wird. Jeder der darauf folgenden Berichte bezieht sich auf die Zeit seit dem vorhergehenden Bericht.

source: The I<interval> parameter specifies the amount of time in seconds between each report. The I<count> parameter can be specified in conjunction with the I<interval> parameter. If the I<count> parameter is specified, the value of I<count> determines the number of reports generated at I<interval> seconds apart. If the I<interval> parameter is specified without the I<count> parameter, the B<tapestat> command generates reports continuously.
de: Der Parameter I<Intervall> gibt die Zeit in Sekunden zwischen den einzelnen Berichten an. Der Parameter I<Anzahl> kann zusammen mit dem Parameter I<Intervall> angegeben werden. Falls der Parameter I<Anzahl> angegeben ist, bestimmt dieser Wert die Anzahl der Berichte, die im Abstand von I<Intervall> (in Sekunden) erfolgen. Falls der Parameter I<Intervall> ohne den Parameter I<Anzahl> angegeben ist, erzeugt der Befehl B<tapestat> die Berichte fortlaufend.

source: The amount of data read expressed in kilobytes (by default or if option -k used) or megabytes (if option -m used) per second averaged over the interval.
de: Menge der gelesenen Daten, ausgedrückt in Kilobyte (standardmäßig oder wenn die Option B<-k> verwendet wird) oder Megabyte (wenn die Option B<-m> verwendet wird) pro Sekunde, als Durchschnittswert im Intervall ermittelt.

source: The amount of data written expressed in kilobytes (by default or if option -k used) or megabytes (if option -m used) per second averaged over the interval.
de: Menge der geschriebenen Daten, ausgedrückt in Kilobyte (standardmäßig oder wenn die Option B<-k> verwendet wird) oder Megabyte (wenn die Option B<-m> verwendet wird) pro Sekunde, als Durchschnittswert im gesamten Intervall ermittelt.

source: Show the amount of data written or read in kilobytes per second instead of megabytes. This option is mutually exclusive with -m.
de: zeigt die Menge der geschriebenen oder gelesenen Daten in Kilobyte pro Sekunde statt in Megabyte pro Sekunde an. Diese Option und die Option B<-m> schließen sich gegenseitig aus.

source: Show the amount of data written or read in megabytes per second instead of kilobytes. This option is mutually exclusive with -k.
de: zeigt die Menge der geschriebenen oder gelesenen Daten in Megabyte pro Sekunde statt in Kilobyte pro Sekunde an. Diese Option und die Option B<-k> schließen sich gegenseitig aus.
