Repository: sebras/manpages-l10n
Catalog: po/*/man1/tapestat.1.po
Languages: de

source: Display time stamps. The time stamp format may depend on the value of the S_TIME_FORMAT environment variable (see below).
de: zeigt Zeitstempel an. Das Zeitstempelformat kann vom Wert der Umgebungsvariable B<S_TIME_FORMAT> abhängen (siehe unten).

source: Although tape statistics are implemented in the kernel using atomic variables they cannot be read atomically as a group. All of the statistics values are read from different files under /sys, because of this there may be I/O completions while reading the different files for the one tape drive. This may result in a set of statistics for a device that contain some values before an I/O completed and some after.
de: Bandstatistiken werden zwar mittels atomarer Variablen im Kernel implementiert, können aber nicht atomar als Gruppe gelesen werden. Alle statistischen Werte werden aus verschiedenen Dateien unterhalb von I</sys> gelesen. Deshalb kann es vorkommen, dass E/A-Vorgänge erst beim Lesen der verschiedenen Dateien für das eine Bandlaufwerk abgeschlossen werden. Dies kann zu einer Reihe von Statistiken für ein Gerät führen, die einige Werte enthalten, bevor ein E/A-Vorgang abgeschlossen wurde und einige für danach.

source: This command uses rounding down as the rounding method when calculating per second statistics. If, for example, you are using dd to copy one tape to another and running B<tapestat> with an interval of 5 seconds and over the interval there were 3210 writes and 3209 reads then w/s would show 642 and r/s 641 (641.8 rounded down to 641). In such a case if it was a tar archive being copied (with a 10k block size) you would also see a difference between the kB_read/s and kB_wrtn/s of 2 (one I/O 10k in size divided by the interval period of 5 seconds). If instead there were 3210 writes and 3211 reads both w/s and r/s would both show 642 but you would still see a difference between the kB_read/s and kB_wrtn/s values of 2 kB/s.
de: Dieser Befehl rundet Werte ab, wenn die sekundenbezogenen Statistiken ermittelt werden. Falls Sie beispielsweise B<dd> dazu verwenden, ein Band auf ein anderes zu kopieren und B<tapestat> mit einem Intervall von 5 Sekunden ausführen und während des Intervalls 3210 Schreibvorgänge und 3209 Lesevorgänge stattfanden, dann würden 642 Schreibvorgänge pro Sekunde und 641 Lesevorgänge pro Sekunde (641,8 wird dabei auf 641 abgerundet) angezeigt. Wenn es ein zu kopierendes Tar-Archiv (mit einer Blockgröße von 10 kB) wäre, würden Sie auch einen Unterschied von 2 zwischen dem Datendurchsatz (kB_read/s und kB_wrtn/s) erkennen (ein E/A-Vorgang der Größe 10 kB geteilt durch die Intervalldauer von 5 Sekunden). Falls es stattdessen 3210 Schreibvorgänge und 3211 Lesevorgänge gab, würde für beides der gleiche Wert von 642 Vorgängen pro Sekunde angezeigt, aber für den Datendurchsatz würde sich dennoch zwischen den Werten für kB_read/s und kB_wrtn/s eine Differenz von 2kB/s ergeben.

source: This command is provided with an interval in seconds. However internally the interval is tracked per device and can potentially have an effect on the per second statistics reported. The time each set of statistics is captured is kept with those statistics. The difference between the current and previous time is converted to milliseconds for use in calculations. We can look at how this can impact the statistics reported if we use an example of a tar archive being copied between two tape drives using dd. If both devices reported 28900 kilobytes transferred and the reading tape drive had an interval of 5001 milliseconds and the writing tape drive 5000 milliseconds that would calculate out as 5778 kB_read/s and 5780 kB_wrtn/s.
de: Dieser Befehl arbeitet mit einem Intervall in Sekunden. Allerdings wird intern das Intervall pro Gerät erfasst, was sich möglicherweise auf die sekundenbezogenen Statistiken auswirken kann. Die Zeit, zu der jeder Statistiksatz erfasst wird, wird für diese Statistiken beibehalten. Der Unterschied zwischen der aktuellen und der vorherigen Zeit wird zur Verwendung in Berechnungen in Millisekunden umgewandelt. Wir können uns anschauen, wie sich dies auf die gemeldeten Statistiken auswirken kann, wenn wir zum Beispiel ein Tar-Archiv mit B<dd> zwischen zwei Bandlaufwerken kopieren. Wird von beide Geräten eine Übertragung von 28900 Kilobyte gemeldet und das Lesebandlaufwerk hatte einen Intervall von 5001 Millisekunden und das Schreibbandlaufwerk 5000 Millisekunden, dann würden sich 5778 kB_read/s (gelesene Daten pro Sekunde) und 5780 kB_wrtn/s (geschriebene Daten pro Sekunde) ergeben.

source: When this variable is set, display statistics in color on the terminal. Possible values for this variable are I<never>, I<always> or I<auto> (the latter is the default).
de: Wenn diese Variable gesetzt ist, werden die Statistiken im Terminal in Farbe dargestellt. Mögliche Werte für diese Variable sind I<never>, I<always> oder I<auto> (Letzteres ist die Standardeinstellung).

source: If this variable exists and its value is B<ISO> then the current locale will be ignored when printing the date in the report header. The B<tapestat> command will use the ISO 8601 format (YYYY-MM-DD) instead. The timestamp displayed with option -t will also be compliant with ISO 8601 format.
de: Falls diese Variable existiert und deren Wert auf B<ISO> gesetzt ist, dann wird die aktuelle Locale bei der Ausgabe des Datums in der Berichtsüberschrift ignoriert. Der Befehl B<tapestat> wird dann stattdessen das ISO-8601-Format (JJJJ-MM-TT) verwenden. Der mit der Option B<-t> angezeigte Zeitstempel wird auch zum ISO-8601-Format kompatibel sein.

source: I</sys> filesystem must be mounted for B<tapestat> to work. It will not work on kernels that do not have sysfs support
de: Das I</sys>-Dateisystem muss eingehängt sein, damit B<tapestat> funktioniert. Es wird mit Kerneln nicht funktionieren, die nicht über Sysfs-Unterstützung verfügen.

source: I</sys/class/scsi_tape/stE<lt>numE<gt>/stats/*> Statistics files for tape devices.
de: I</sys/class/scsi_tape/stE<lt>ZahlE<gt>/stats/*> Statistikdateien für Bandlaufwerke.

source: I</proc/uptime> contains system uptime.
de: I</proc/uptime> enthält die Laufzeit des Systems.
