Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: Set quoting style for file and member names. Valid values for I<STYLE> are B<literal>, B<shell>, B<shell-always>, B<c>, B<c-maybe>, B<escape>, B<locale>, B<clocale>.
nl: Stel aanhalingstekens stijl in voor bestands- en ledennamen. Geldige waarden voor I<STIJL> zijn B<literal>, B<shell>, B<shell-always>, B<c>, B<c-maybe>, B<escape>, B<locale>, B<clocale>.
uk: Встановити стиль взяття у лапки для назв файлів та елементів. Коректними значеннями для аргументу I<СТИЛЬ> є B<literal>, B<shell>, B<shell-always>, B<c>, B<c-maybe>, B<escape>, B<locale>, B<clocale>.

source: Show block number within archive with each message.
nl: Bloknummer binnen archief tonen bij elk bericht.
uk: Виводити номер блоку у архіві із кожним повідомленням.

source: When listing or extracting, list each directory that does not match search criteria.
nl: Bij opsommen of uitpakken: elke map opsommen die niet aan zoekcriteria voldoet.
uk: Під час виведення вмісту або видобування файлів друкувати назви каталогів, що не відповідають критеріям пошуку.

source: Show file or archive names after transformation by B<--strip> and B<--transform> options.
nl: Bestands- of archiefnamen na transformatie tonen door B<--strip> en B<--transform> opties.
uk: Вивести назви файлів або архіву після перетворення з використанням параметрів B<--strip> і B<--transform>.

source: B<--totals>[=I<SIGNAL>]
nl: B<--totals>[=I<SIGNAAL>]
uk: B<--totals>[=I<СИГНАЛ>]

source: Print total bytes after processing the archive. If I<SIGNAL> is given, print total bytes when this signal is delivered. Allowed signals are: B<SIGHUP>, B<SIGQUIT>, B<SIGINT>, B<SIGUSR1>, and B<SIGUSR2>. The B<SIG> prefix can be omitted.
nl: Na verwerking van het archief het totaal aantal bytes printen. Als een argument gegeven werd, dan het totaal aantal bytes printen als dit SIGNAAL ontvangen werd. Mogelijke signalen zijn: B<SIGHUP>, B<SIGQUIT>, B<SIGINT>, B<SIGUSR1>, en B<SIGUSR2>. Het B<SIG> voorvoegsel mag weg gelaten worden.
uk: друкувати статистику після завершення роботи; якщо вказаний аргумент I<СИГНАЛ> — вивести статистику з отримання цього сигналу; дозволеними сигналами є B<SIGHUP>, B<SIGQUIT>, B<SIGINT>, B<SIGUSR1> і B<SIGUSR2>, а також ці назви без префікса B<SIG>.

source: Print file modification times in UTC.
nl: Bestandswijzigingstijden in UTC tonen.
uk: Виводити час модифікації файлів у UTC.

source: Verbosely list files processed. Each instance of this option on the command line increases the verbosity level by one. The maximum verbosity level is 3. For a detailed discussion of how various verbosity levels affect tar's output, please refer to B<GNU Tar Manual>, subsection 2.5.1 "B<The --verbose Option>".
nl: Uitgebreid tonen van de lijst van bewerkte bestanden. Elke gebruik van deze optie op de commando regel verhoogt het niveau met een. Het maximum niveau is 3. Voor een gedetailleerde discussie over hoe de verschillende niveau´s de uitvoer van tar beïnvloeden, lees dan de B<GNU Tar Handleiding>, subsectie 2.5.1 "B<De --verbose Optie>".
uk: Вивести докладний список оброблених файлів. Кожен екземпляр цього параметра у командному рядку збільшує рівень докладності на одиницю. Максимальним рівнем докладності є 3. Докладне обговорення того, як різні рівні докладності впливають на виведені tar дані, можна знайти у B<Підручнику з GNU Tar>, підрозділ 2.5.1 «B<Параметр --verbose>».

source: B<--warning>=I<KEYWORD>
nl: B<--warning>=I<SLEUTELWOORD>
uk: B<--warning>=I<КЛЮЧОВЕ_СЛОВО>

source: Enable or disable warning messages identified by I<KEYWORD>. The messages are suppressed if I<KEYWORD> is prefixed with B<no-> and enabled otherwise.
nl: Schakel waarschuwingsberichten geïdentificeerd door I<SLEUTELWOORD> in of uit. De berichten worden onderdrukt als I<SLEUTELWOORD> wordt voorafgegaan door B<no-> anders ingeschakeld.
uk: Увімкнути або вимкнути повідомлення-попередження, вказані за допомогою аргументу I<КЛЮЧОВЕ_СЛОВО>. Повідомлення буде придушено, якщо I<КЛЮЧОВЕ_СЛОВО> матиме префікс B<no->, і увімкнено, якщо цього префікса не буде.

source: Multiple B<--warning> messages accumulate.
nl: Meerdere B<--warning> berichten verzamelen.
uk: Якщо вказано декілька B<--warning>, масив повідомлень складатиметься з усіх вказаних варіантів.

source: Keywords controlling general B<tar> operation:
nl: Sleutelwoorden die de algemene B<tar> werking bepalen:
uk: Ключові слова, які керують загальними діями B<tar>:

source: Enable all warning messages. This is the default.
nl: Schakel alle waarschuwingen in. Dit is de standaard.
uk: Увімкнути усі повідомлення-попередження. Типова поведінка.

source: Disable all warning messages.
nl: Schakel alle waarschuwingen uit.
uk: Вимкнути усі повідомлення-попередження.

source: %s: file name read contains nul character
nl: %s: gelezen bestandsnaam bevat een NUL-teken
uk: %s: прочитана назва файла містить нульовий символ

source: A lone zero block at %s
nl: Een los blok met nullen op %s
uk: Самотній блок нулів, зсув %s

source: Keywords applicable for B<tar --create>:
nl: Sleutelwoorden van toepassing voor B<tar --create>
uk: Ключові слова, які можна застосовувати для B<tar --create>:

source: %s: contains a cache directory tag %s; %s
nl: %s: map bevat cache-markering %s; %s
uk: %s: містить мітку каталогу кешування «%s»; %s

source: %s: File shrank by %s bytes; padding with zeros
nl: %s: Bestand is gekrompen met %s byte; aangevuld met nullen
uk: %s: Файл скоротився на %s байт; заповнення нулями

source: %s: file is on a different filesystem; not dumped
nl: %s: bestand staat op een ander bestandssysteem; niet gearchiveerd
uk: %s: файл знаходиться в іншої файлової системі; не архівується

source: %s: Unknown file type; file ignored
nl: %s: Onbekende bestandssoort; bestand genegeerd
uk: %s: Невідомий тип файла; Файл проігноровано

source: %s: socket ignored
nl: %s: socket genegeerd
uk: %s: сокет проігноровано

source: %s: door ignored
nl: %s: deur genegeerd
uk: %s: двері проігноровано

source: %s: file is unchanged; not dumped
nl: %s: bestand is ongewijzigd; niet gearchiveerd
uk: %s: файл не змінено; не архівується

source: %s: file is the archive; not dumped
nl: %s: bestand is het archief zelf; niet gearchiveerd
uk: %s: файл є архівом; не архівується

source: %s: File removed before we read it
nl: %s: Bestand werd verwijderd voordat het gelezen kon worden
uk: %s: Файл було вилучено перед тим як tar встиг його прочитати

source: %s: file changed as we read it
nl: %s: bestand is gewijzigd tijdens het lezen
uk: %s: файл змінився під час читання

source: Suppresses warnings about unreadable files or directories. This keyword applies only if used together with the B<--ignore-failed-read> option.
nl: Onderdrukt waarschuwingen over niet leesbare bestande of mappen. Die sleutelwoord is alleen van toepassing indien het samen met de B<--ignore-failed-read> optie gebruikt wordt.
uk: Придушити попередження щодо непридатних до читання файлів або каталогів. Це ключове слово застосовується, лише якщо його використано разом із параметром B<--ignore-failed-read>.

source: Keywords applicable for B<tar --extract>:
nl: Sleutelwoorden van toepassing voor B<tar --extract>
uk: Ключові слова, які можна застосовувати для B<tar --extract>:

source: %s: skipping existing file
nl: %s: bestaand bestand wordt overgeslagen
uk: %s: пропускаємо наявний файл

source: %s: implausibly old time stamp %s
nl: %s: onwaarschijnlijk oud tijdsstempel %s
uk: %s: неймовірно стара дата %s

source: %s: time stamp %s is %s s in the future
nl: %s: tijdsstempel %s ligt %s seconden in de toekomst
uk: %s: мітка часу %s зсунута на %s сек. до майбутнього

source: Extracting contiguous files as regular files
nl: Aaneengesloten bestanden worden uitgepakt als gewone bestanden
uk: Витягування безперервних файлів у звичайні

source: Attempting extraction of symbolic links as hard links
nl: Poging om symbolische koppelingen als harde koppelingen uit te pakken...
uk: Спроба перетворити символічні посилання на жорсткі

source: %s: Unknown file type '%c', extracted as normal file
nl: %s: Onbekende bestandssoort '%c'; uitgepakt als gewoon bestand
uk: %s: невідомий тип файла «%c», видобуто як звичайний файл

source: Current %s is newer or same age
nl: Huidige %s is nieuwer of even oud
uk: Поточний файл «%s» є новішим

source: Ignoring unknown extended header keyword '%s'
nl: Genegeerd: onbekend sleutelwoord '%s' in uitgebreide kop
uk: Ігноруємо невідоме ключове слово розширеного заголовка, «%s»

source: Controls verbose description of failures occurring when trying to run alternative decompressor programs. This warning is disabled by default (unless B<--verbose> is used). A common example of what you can get when using this warning is:
nl: Bepaalt uitgebreide beschrijving van fouten die optreden wanneer geprobeerd wordt om alternatieve decompressie programma´s uit te voeren. Deze waarschuwing is standaard uitgeschakeld (behalve als B<--verbose> werd gebruikt. Een gebruikelijk voorbeeld van wat u kunt zien bij het optreden van deze waarschuwing is:
uk: Керує докладним описом помилок, які трапляються при спробі запустити альтернативні програми для розпаковування. Це попередження буде типово вимкнено (якщо не вказано параметра B<--verbose>). Типовим прикладом того, що ви можете отримати при використанні цього попередження, є такий:

source: This means that B<tar> first tried to decompress B<archive.Z> using B<compress>, and, when that failed, switched to B<gzip>.
nl: Dit betekent dat B<tar> eerst probeerde om B<archive.Z> te decomprimeren door B<compress> te gebruiken, en nadat dat faalde, B<gzip> gebruikte.
uk: Це означає, що програма B<tar> спершу спробувала розпакувати B<archive.Z> за допомогою B<compress>, і, коли спроба завершилася невдало, перемкнулася на B<gzip>.

source: Record size = %lu blocks
nl: Recordgrootte = %lu blokken
uk: Розмір запису = %lu блоки

source: Keywords controlling incremental extraction:
nl: Sleutelwoorden die incrementele extractie bepalen:
uk: Ключові слова, які керують нарощувальним видобуванням:

source: %s: Directory has been renamed from %s
nl: %s: Map is hernoemd van %s
uk: %s: Каталог перейменовано з %s

source: %s: Directory has been renamed
nl: %s: Map is hernoemd
uk: %s: каталог перейменовано

source: %s: Directory is new
nl: %s: Map is nieuw
uk: %s: Новий каталог

source: %s: directory is on a different device: not purging
nl: %s: Map staat op een ander bestandssysteem; niet leeggemaakt
uk: %s: Каталог знаходиться на іншому пристрої: не очищується

source: Malformed dumpdir: 'X' never used
nl: Onjuiste archiveringsmap: 'X' is nergens gebruikt
uk: Некоректний формат dumpdir: «X» не використаний

source: Ask for confirmation for every action.
nl: Bij elke actie om toestemming vragen.
uk: Запитувати підтвердження кожної дії.

source: Compatibility options
nl: Compatibiliteitsopties
uk: Параметри сумісності

source: When creating, same as B<--old-archive>. When extracting, same as B<--no-same-owner>.
nl: Bij aanmaken, hetzelfde als B<--old-archive>. Bij uitpakken, hetzelfde als B<--no-same-owner>.
uk: Під час створення архіву, те ж саме, що і B<--old-archive>. Під час видобування, те ж саме, що B<--no-same-owner>.

source: Size suffixes
nl: Grootte achtervoegsels.
uk: Суфікси розмірів

source: Suffix Units Byte Equivalent b Blocks I<SIZE> x 512 B Kilobytes I<SIZE> x 1024 c Bytes I<SIZE> G Gigabytes I<SIZE> x 1024^3 K Kilobytes I<SIZE> x 1024 k Kilobytes I<SIZE> x 1024 M Megabytes I<SIZE> x 1024^2 P Petabytes I<SIZE> x 1024^5 T Terabytes I<SIZE> x 1024^4 w Words I<SIZE> x 2
nl: Achtervoegsel Eenheid Byte Equivalent b Blokken I<SIZE> x 512 B Kilobytes I<SIZE> x 1024 c Bytes I<SIZE> G Gigabytes I<SIZE> x 1024^3 K Kilobytes I<SIZE> x 1024 k Kilobytes I<SIZE> x 1024 M Megabytes I<SIZE> x 1024^2 P Petabytes I<SIZE> x 1024^5 T Terabytes I<SIZE> x 1024^4 w Woorden I<SIZE> x 2
uk: Суфікс Одиниці Еквівалент у байтах b Блоки I<РОЗМІР> x 512 B Кілобайти I<РОЗМІР> x 1024 c Байти I<РОЗМІР> G Гігабайти I<РОЗМІР> x 1024^3 K Кілобайти I<РОЗМІР> x 1024 k Кілобайти I<РОЗМІР> x 1024 M Мегабайти I<РОЗМІР> x 1024^2 P Петабайти I<РОЗМІР> x 1024^5 T Терабайти I<РОЗМІР> x 1024^4 w Слова I<РОЗМІР> x 2

source: RETURN VALUE
nl: EIND WAARDE
uk: ПОВЕРНУТЕ ЗНАЧЕННЯ

source: Tar exit code indicates whether it was able to successfully perform the requested operation, and if not, what kind of error occurred.
nl: Tar eind code geeft aan of het de gevraagde operatie succesvol kon beëindigen, en indien niet, welke soort fout optrad.
uk: Код виходу tar вказує на те, чи вдалося програмі успішно виконати вказану дію, і якщо дію не вдалося виконати успішно, якого типу помилка сталася.

source: Successful termination.
nl: Succesvolle beëindiging.
uk: Успішне переривання.

source: I<Some files differ.> If tar was invoked with the B<--compare> (B<--diff>, B<-d>) command line option, this means that some files in the archive differ from their disk counterparts. If tar was given one of the B<--create>, B<--append> or B<--update> options, this exit code means that some files were changed while being archived and so the resulting archive does not contain the exact copy of the file set.
nl: I<Sommige bestanden verschillen.> Indien tar gestart werd met de B<--compare> (B<--diff>, B<-d>) commando regel optie, betekent dit dat sommige bestanden in het archief verschillen van hun tegenhanger op de schijf. Als tar was gestart met een van B<--create>, B<--append> of B<--update> opties, dan betekent deze eind code dat bestanden zijn verandert terwijl ze werden ingepakt en dat daarom het resulterende archief geen exacte kopie van de bestanden bevat.
uk: I<Якісь файли відрізняються.> Якщо tar було викликано з параметром командного рядка B<--compare> (B<--diff>, B<-d>), це означає, що деякі файли в архіві відрізняються від своїх відповідників на диску. Якщо tar було передано один з параметрів B<--create>, B<--append> або B<--update>, цей код виходу означає, що деякі файли було змінено під час архівування, а отже, архів-результат не міститиме точної копії набору файлів.

source: I<Fatal error.> This means that some fatal, unrecoverable error occurred.
nl: I<Fatal error.> Dit betekent dat een fatale, onoverkomelijke fout optrad.
uk: I<Критична помилка.> Це означає, що сталася якась критична невиправна помилка.

source: If a subprocess that had been invoked by B<tar> exited with a nonzero exit code, B<tar> itself exits with that code as well. This can happen, for example, if a compression option (e.g. B<-z>) was used and the external compressor program failed. Another example is B<rmt> failure during backup to a remote device.
nl: Als een subproces dat werd gestart door B<tar> eindigde met een niet-nul eind code, dan zal B<tar> ook eindigen met deze code. Dit kan bij voorbeeld gebeuren, als een compressie optie (b.v. B<-z> werd gebruikt en het externe compressie programma faalde. Een ander voorbeeld is het falen van B<rmt> gedurende het backupen naar een andere computer.
uk: Якщо підпроцес, який було викликано B<tar>, завершив роботу із ненульовим кодом виходу, B<tar> також завершить роботу із цим кодом. Таке може трапитися, наприклад, якщо було використано параметр стиснення (наприклад, B<-z>), а зовнішня програма для стиснення не змогла вдало завершити роботу. Іншим прикладом є помилка B<rmt> під час створення резервної копії на віддаленому пристрої.

source: SEE ALSO
nl: ZIE OOK
uk: ДИВ. ТАКОЖ

source: Complete B<tar> manual: run B<info tar> or use B<emacs>(1) info mode to read it.
nl: De volledige B<tar> handleiding: voer B<info tar> uit of gebruikt B<emacs>(1) info modus om het te lezen.
uk: Повний підручник з B<tar>: віддайте команду B<info tar> або скористайтеся режимом info B<emacs>(1), щоб ознайомитися з ним.

source: Online copies of B<GNU tar> documentation in various formats can be found at:
nl: Online kopieën van de B<GNU tar> documentatie in diverse formaten zijn te vinden op:
uk: Інтернет-копії документації з B<GNU tar> у різних форматах можна знайти тут:

source: BUG REPORTS
nl: BUG RAPPORTEN
uk: ЗВІТУВАННЯ ПРО ВАДИ

source: Report bugs to E<lt>bug-tar@gnu.orgE<gt>.
nl: Rapporteer gebreken in het programma aan E<lt>bug-tar@gnu.orgE<gt>; meld fouten in de vertaling aan E<lt>vertaling@vrijschrift.orgE<gt>.
uk: Про вади слід повідомляти за адресою E<lt>bug-tar@gnu.orgE<gt>.

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2013-2019 Free Software Foundation, Inc.
uk: Авторські права належать \(co Free Software Foundation, Inc., 2013-2019

source: License GPLv3+: GNU GPL version 3 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
nl: Licentie GPLv3+: GNU GPL versie 3 of later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>
uk: Умови ліцензування GPLv3+: GNU GPL версії 3 або пізнішої E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
uk: Це вільне програмне забезпечення: Ви можете вільно змінювати і розповсюджувати його. БЕЗ ЖОДНИХ ГАРАНТІЙ, в межах, дозволених законом.

source: User Commands
nl: Opdrachten voor gebruikers
uk: Команди користувача

source: A tar (tape archiver) program.
nl: Een tar (tape archiver) programma.
uk: Програма tar (tape archiver або стрічковий архіватор).

source: B<tar> [I<OPTION>...] [I<FILE>]...
nl: B<tar> [I<OPTIES>...] [I<BESTAND>]...
uk: B<tar> [I<ПАРАМЕТР>...] [I<ФАЙЛ>]...

source: GNU 'tar' saves many files together into a single tape or disk archive, and can restore individual files from the archive.
nl: GNU 'tar' slaat bestanden samen op in een enkele band of schijf archief, en kan individuele bestanden uit het archief uit pakken.
uk: GNU tar зберігає багато файлів разом в одну стрічкою або дисковий архів і може відновити окремі файли з архіву.

source: EXAMPLES
nl: VOORBEELDEN
uk: ПРИКЛАДИ

source: # Create archive.tar from files foo and bar.
nl: # Maak archive.tar van de bestanden foo en bar.
uk: # Створити archive.tar з файлів foo і bar.

source: # List all files in archive.tar verbosely.
nl: # Toon uitgebreid alle bestanden in archive.tar
uk: # Вивести докладний список усіх файлів в archive.tar.

source: # Extract all files from archive.tar.
nl: # Alle bestanden uit archive.tar uitpakken
uk: # Видобути усі файли з archive.tar.

source: Main operation mode:
nl: Hoofdbewerkingen:
uk: Режими роботи:

source: append tar files to an archive
nl: tar-bestanden aan een archief toevoegen
uk: долучити архів до архіву

source: create a new archive
nl: een nieuw archief aanmaken
uk: створити новий архів

source: delete from the archive (not on mag tapes!)
nl: uit het archief verwijderen (niet gebruiken bij magneetbanden!)
uk: вилучити файли з архіву (не на стрічці!)

source: find differences between archive and file system
nl: verschillen tussen archief en bestandssyteem vinden
uk: порівняти файли в архіві з файлами у файлової системі

source: append files to the end of an archive
nl: bestanden aan het eind van een archief toevoegen
uk: долучити файли до наявного архіву

source: test the archive volume label and exit
nl: label van archiefdeel controleren en stoppen
uk: перевірити мітку тому та вийти

source: list the contents of an archive
nl: de inhoud van een archief opsommen
uk: вивести вміст архіву

source: only append files newer than copy in archive
nl: alleen bestanden toevoegen die nieuwer zijn dan hun versie in het archief
uk: долучати тільки такі файли, що є новішими за їх копії в архіві

source: extract files from an archive
nl: bestanden uit een archief uitpakken
uk: витягнути файли з архіву

source: Operation modifiers:
nl: Werkingsaanpassers:
uk: Модифікатори режиму роботи:

source: check device numbers when creating incremental archives (default)
nl: apparaatnummers controleren tijdens aanmaken van incrementele archieven (standaard)
uk: перевіряти номери пристрою під час створювання інкрементних архівів (типово)

source: handle new GNU-format incremental backup
nl: nieuwe GNU-indeling van incrementeel archief verwerken
uk: обробка нового формату інкрементного архіву GNU

source: handle old GNU-format incremental backup
nl: oude GNU-indeling van incrementeel archief verwerken
uk: обробка старого формату інкрементного архіву GNU

source: B<--hole-detection>=I<TYPE>
uk: B<--hole-detection>=I<ТИП>

source: technique to detect holes
nl: te gebruiken methode om gaten te detecteren
uk: техніка розпізнавання дір

source: do not exit with nonzero on unreadable files
nl: niet afsluiten met een foutcode bij onleesbare bestanden
uk: ігнорувати помилки читання файлів

source: dump level for created listed-incremental archive
nl: dump-niveau voor aan te maken incrementeel archief
uk: рівень архівної копії для створення інкрементного архіву

source: do not check device numbers when creating incremental archives
nl: geen apparaatnummers controleren tijdens aanmaken van incrementele archieven
uk: не перевіряти номери пристрою під час створювання інкрементних архівів

source: archive is not seekable
nl: in archief kan niet worden gesprongen
uk: архів не підтримує операцію seek

source: archive is seekable
nl: in archief kan worden gesprongen
uk: архів підтримує операцію seek

source: B<--occurrence>[=I<NUMBER>]
nl: B<--occurrence>[=I<AANTAL>]
uk: B<--occurrence>[=I<ЧИСЛО>]

source: process only the NUMBERth occurrence of each file in the archive; this option is valid only in conjunction with one of the subcommands B<--delete>, B<--diff>, B<--extract> or B<--list> and when a list of files is given either on the command line or via the B<-T> option; NUMBER defaults to 1
nl: alleen het AANTALste voorkomen van elk bestand in het archief verwerken; deze optie is alleen geldig samen met een van de subopdrachten B<--delete>, B<--diff>, B<--extract> of B<--list>, en wanneer een lijst van bestanden gegeven is op de opdrachtregel of via optie B<-T>; AANTAL is standaard 1
uk: обробляти тільки вказане входження кожного файла в архіві. Ця параметр є дійсною тільки разом з одним з параметрів B<--delete>, B<--diff>, B<--extract> або B<--list> і з переліком файлів (у командному рядку або за допомогою параметра B<-T>). Типове ЧИСЛО: 1.

source: B<--sparse-version>=I<MAJOR[>.MINOR]
uk: B<--sparse-version>=I<ОСНОВНА[>.ДРУГОРЯДНА]

source: set version of the sparse format to use (implies B<--sparse>)
nl: versie van te gebruiken luchtige indeling (impliceert B<--sparse>)
uk: встановити версію формату розріджених файлів (вмикає B<--sparse>)

source: handle sparse files efficiently
nl: luchtige bestanden efficiënt verwerken
uk: заощаджувати простір під час зберігання розріджених файлів

source: Local file name selection:
nl: Lokale bestandsnaamkeuze:
uk: Вибір локальних файлів:

source: add given FILE to the archive (useful if its name starts with a dash)
nl: het gegeven BESTAND aan het archief toevoegen (handig als de naam begint met een '-')
uk: долучити ФАЙЛ до архіву (корисне, якщо його назва починається з -)

source: change to directory DIR
nl: naar MAP gaan
uk: перейти до вказаного каталогу

source: exclude files, given as a PATTERN
nl: bestanden uitsluiten, gegeven als een PATROON
uk: не обробляти файли, назви яких відповідають вказаному шаблону

source: exclude backup and lock files
nl: reservekopieën en vergrendelingsbestanden uitsluiten
uk: не архівувати резерві файли та файли блокування

source: exclude contents of directories containing CACHEDIR.TAG, except for the tag file itself
nl: inhoud van mappen die CACHEDIR.TAG bevatten uitsluiten, behalve CACHEDIR.TAG zelf
uk: не архівувати файли в каталогах, що містять CACHEDIR.TAG, з винятком самого файла

source: exclude directories containing CACHEDIR.TAG
nl: mappen die CACHEDIR.TAG bevatten uitsluiten
uk: не архівувати каталоги, що містять CACHEDIR.TAG
