Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: Operation modifiers
nl: Werkings aanpassers
uk: Модифікатори режиму роботи

source: Check device numbers when creating incremental archives (default).
nl: Apparaat nummers controleren tijdens aanmaken van incrementele archieven (standaard).
uk: Перевіряти номери пристрою під час створювання інкрементних архівів (типово).

source: B<-g>, B<--listed-incremental>=I<FILE>
nl: B<-g>, B<--listed-incremental>=I<BESTAND>
uk: B<-g>, B<--listed-incremental>=I<ФАЙЛ>

source: Handle new GNU-format incremental backups. I<FILE> is the name of a B<snapshot file>, where tar stores additional information which is used to decide which files changed since the previous incremental dump and, consequently, must be dumped again. If I<FILE> does not exist when creating an archive, it will be created and all files will be added to the resulting archive (the B<level 0> dump). To create incremental archives of non-zero level B<N>, create a copy of the snapshot file created during the level B<N-1>, and use it as I<FILE>.
nl: Het nieuwe GNU-formaat voor incrementele reservekopieën gebruiken. I<BESTAND> is de naam van de B<momentopname.bestand>, waarin tar additionele informatie bewaard die gebruikt wordt om te beslissen welke bestanden werden veranderd sinds de vorige incrementele opslag en, die daarom nog een keer opgeslagen moet worden. Als I<BESTAND> niet bestaat tijdens het aanmaken van archief, dan wordt het gemaakt en worden alle bestanden toegevoegd aan het resulterende archief (de B<niveau 0> opslag). Om incrementele archieven van niet-nul niveau B<N> te maken: maak een kopie van het momentopname bestand zoals gecreëerd tijdens niveau B<N-1> en gebruikt het als I<BESTAND>.
uk: Обробити нові нарощувальні резервні копії у новому форматі GNU. I<ФАЙЛ> є назвою B<файла знімка>, у якому tar зберігає додаткові відомості, які використовують для визначення, які файли було змінено з часу створення попереднього нарощувального дампу, і, відповідно, для яких слід знову створити дамп. Якщо I<ФАЙЛ>а не існує під час створення архіву, його буде створено, і усі файли буде додано до архіву-результату (дампу B<рівня 0>). Для створення нарощувальних архівів ненульового рівня B<N>, створіть копію файл знімка, створеного на рівні B<N-1>, і скористайтеся його назвою як аргументом I<ФАЙЛ>.

source: When listing or extracting, the actual contents of I<FILE> is not inspected, it is needed only due to syntactical requirements. It is therefore common practice to use B</dev/null> in its place.
nl: Zowel bij tonen als uitpakken wordt de actuele inhoud van I<BESTAND> niet bekeken, de inhoud is alleen nodig vanwege syntactische redenen. Daarom wordt in het dagelijkse gebruik B</dev/null> gebruikt in zijn plaats.
uk: При виведенні списків вмісту або видобуванні сам вміст I<ФАЙЛ>а не буде проаналізовано — він потрібен лише через синтаксичні вимоги. Через це, типовим є використання значення B</dev/null>.

source: B<--hole-detection>=I<METHOD>
nl: B<--hole-detection>=I<METHODE>
uk: B<--hole-detection>=I<МЕТОД>

source: Use I<METHOD> to detect holes in sparse files. This option implies B<--sparse>. Valid values for I<METHOD> are B<seek> and B<raw>. Default is B<seek> with fallback to B<raw> when not applicable.
nl: I<METHODE> gebruiken om gaten in ijle bestanden te detecteren. Deze optie impliceert B<--sparse>. Geldige waarden voor I<METHODE> zijn B<seek> en B<raw>. B<seek> is standaard met terugval naar B<raw> wanneer deze niet van toepassing is.
uk: Скористатися I<МЕТОД>ом для виявлення порожнин у розріджених файлах. Цей параметр неявним чином встановлює параметр B<--sparse>. Коректними значеннями для I<МЕТОД>у є B<seek> і B<raw>. Типовим є B<seek> із резервним варіантом B<raw>, якщо цей варіант застосувати не вдасться.

source: Handle old GNU-format incremental backups.
nl: Oude GNU-indeling van incrementele reservekopieën verwerken.
uk: Обробка застарілого формату GNU нарощувальних резервних копій.

source: Do not exit with nonzero on unreadable files.
nl: Niet afsluiten met een foutcode bij onleesbare bestanden.
uk: Ігнорувати помилки читання файлів.

source: B<--level>=I<NUMBER>
nl: B<--level>=I<NUMMER>
uk: B<--level>=I<ЧИСЛО>

source: Set dump level for created listed-incremental archive. Currently only B<--level=0> is meaningful: it instructs B<tar> to truncate the snapshot file before dumping, thereby forcing a level 0 dump.
nl: Opslag niveau instellen voor aangemaakte vermeldde-incrementele archieven. Momenteel is alleen B<--level=0> van betekenis: het instrueert B<tar> om de momentopname af te kappen voor het opslaan, en tevens het 0 opslag niveau te forceren.
uk: Встановити рівень створення дампу для списково-нарощувального архіву. У поточній версії має значення лише B<--level=0>: його використання призводить до того, що B<tar> обрізатиме файл знімка до створення дампу, тобто застосовуватиме рівень 0 дампу.

source: Assume the archive is seekable. Normally B<tar> determines automatically whether the archive can be seeked or not. This option is intended for use in cases when such recognition fails. It takes effect only if the archive is open for reading (e.g. with B<--list> or B<--extract> options).
nl: Aannemen dat het archief doorzoekbaar is. Normaliter bepaalt B<tar> automatisch of een archief doorzocht kan worden of niet. Deze optie is bedoeld om te gebruiken in die gevallen waar die herkenning faalt. Het heeft alleen effect als het archief geopend is om te lezen (b.v. met de B<--list> of B<--extract> opties).
uk: Припускати, що в архіві можливе позиціювання. Зазвичай, B<tar> автоматично визначає, чи є можливе в архіві позиціювання. Цей параметр призначено для використання у випадках, коли розпізнавання зазнає невдачі. Він працює, лише якщо архів відкрито для читання (наприклад, з параметрами B<--list> і B<--extract>).

source: Do not check device numbers when creating incremental archives.
nl: Geen apparaatnummers controleren tijdens aanmaken van incrementele archieven.
uk: Не перевіряти номери пристрою під час створювання інкрементних архівів.

source: Assume the archive is not seekable.
nl: Aannemen dat het archief niet doorzoekbaar is.
uk: Припускати, що в архіві не можна виконувати позиціювання.

source: Process only the I<N>th occurrence of each file in the archive. This option is valid only when used with one of the following subcommands: B<--delete>, B<--diff>, B<--extract> or B<--list> and when a list of files is given either on the command line or via the B<-T> option. The default I<N> is B<1>.
nl: Alleen het I<AANTAL>ste voorkomen van elk bestand in het archief verwerken. Deze optie is alleen geldig in combinatie met een van de subopdrachten B<----delete>, B<--diff>, B<--extract> of B<--list> én wanneer een lijst van bestanden gegeven is op de opdrachtregel of via optie B<-T>. Standaard: I<AANTAL> is B<1>
uk: Обробляти тільки I<N>-е входження кожного файла в архіві. Цей параметр є дійсним тільки разом з одним з параметрів B<--delete>, B<--diff>, B<--extract>, B<--list> і з переліком файлів (у командному рядку або за допомогою параметра B<-T>). Типовим значенням I<N> є B<1>.

source: Disable the use of some potentially harmful options.
nl: Het gebruik van potentieel gevaarlijke opties of opdrachten uitschakelen.
uk: Заборонити користування деякими потенційно небезпечними параметрами.

source: B<--sparse-version>=I<MAJOR>[.I<MINOR>]
nl: B<--sparse-version>=I<HOOFD>[.I<SUB>]
uk: B<--sparse-version>=I<ОСНОВНА>[.I<ПРОМІЖНА>]

source: Set version of the sparse format to use (implies B<--sparse>). This option implies B<--sparse>. Valid argument values are B<0.0>, B<0.1>, and B<1.0>. For a detailed discussion of sparse formats, refer to the B<GNU Tar Manual>, appendix B<D>, "B<Sparse Formats>". Using B<info> reader, it can be accessed running the following command: B<info tar 'Sparse Formats'>.
nl: Versie van het ijle formaat instellen (impliceert B<--sparse>). Deze optie impliceert B<--sparse>. Geldige waarden voor de argumenten zijn B<0.0>, B<0.1> en B<1.0>. Een gedetailleerde discussie over ijle formaten is te vinden in appendix B<D> , "B<Sparse Formats>" van de B<GNU Tar Manual>. Bij gebruik van de B<info> lezer kunt u het vinden m.b.v. het commando: B<info tar 'Sparse Formats'>.
uk: Встановити версію розрідженого формату, якою слід скористатися (неявним чином встановлює B<--sparse>). Коректними значеннями аргументу є такі: B<0.0>, B<0.1> та B<1.0>. Докладний опис розріджених форматів можна знайти у B<Підручнику з GNU Tar>, додаток B<D>, «B<Розріджені формати>». Якщо скористатися B<info>, доступ до документації можна отримати за допомогою такої команди: B<info tar 'Sparse Formats'>.

source: Handle sparse files efficiently. Some files in the file system may have segments which were actually never written (quite often these are database files created by such systems as B<DBM>). When given this option, B<tar> attempts to determine if the file is sparse prior to archiving it, and if so, to reduce the resulting archive size by not dumping empty parts of the file.
nl: IJle bestanden efficient behandelen. Sommige bestanden in het bestandssysteem hebben onbeschreven segmenten (vaak zijn dit database bestanden aangemaakt door B<DBM> systemen. Als deze optie is gebruikt dan zal B<tar> voor het archiveren proberen te bepalen of het bestand ijl is, en als dat zo is, dan zal het de grootte van resulterende archief beperken door de lege delen van het bestand niet op te slaan.
uk: Ефективна обробка розріджених файлів. Деякі файли у файловій системі можуть мати сегменти, які, насправді, ніколи не записуються (дуже часто це файли бази даних, які створено такими системами, як B<DBM>). Якщо вказано цей параметр, B<tar> спробує визначити, чи є файл розрідженим до його архівування, і якщо це так, зменшити розмір архіву-результату шляхом пропускання порожніх частин файла.

source: Overwrite control
nl: Overschrijvingsopties
uk: Керування перезаписом

source: These options control B<tar> actions when extracting a file over an existing copy on disk.
nl: Deze opties bepalen acties van B<tar> bij het uitpakken van een bestand uit een bestaande kopie op de schijf.
uk: Ці параметри керують діями B<tar> при видобуванні файла до наявної копії на диску.

source: Don't replace existing files when extracting.
nl: Bestaande bestanden bij het uitpakken niet overschrijven.
uk: Не перезаписувати наявні файли під час видобування.

source: Don't replace existing files that are newer than their archive copies.
nl: Bestaande bestanden die nieuwer zijn dan die in het archief niet vervangen.
uk: Не заміняти наявні файли, що є новішими за їхні копії у архіві.

source: Don't replace existing symlinks to directories when extracting.
nl: Bestaande symbolische koppelingen naar mappen behouden bij het uitpakken.
uk: Не заміняти наявні символічні посилання на каталоги під час видобування.

source: Preserve metadata of existing directories.
nl: Metagegevens van bestaande mappen behouden.
uk: Зберігати метадані наявних каталогів.

source: B<--one-top-level>[B<=>I<DIR>]
nl: B<--one-top-level>[B<=>I<MAP>]
uk: B<--one-top-level>[B<=>I<КАТАЛОГ>]

source: Extract all files into I<DIR>, or, if used without argument, into a subdirectory named by the base name of the archive (minus standard compression suffixes recognizable by B<--auto-compress).>
nl: Pak alle bestanden uit in I<MAP>, of, indien gebruikt zonder argument, in een submap genoemd naar de basis naam van het archief (minus de standaard compressie achtervoegsels, herkenbaar aan B<--auto-compress>).
uk: Видобути усі файли до I<КАТАЛОГ>у або, якщо використано без аргументу, до підкаталогу із назвою, яка збігається із базовою назвою архіву (без стандартних суфіксів, які розпізнаються B<--auto-compress>).

source: Overwrite existing files when extracting.
nl: Bestaande bestanden bij het uitpakken overschrijven.
uk: Перезаписувати наявні файли під час видобування.

source: Overwrite metadata of existing directories when extracting (default).
nl: De metagegevens van bestaande mappen bij het uitpakken overschrijven (standaard).
uk: Перезаписувати метадані наявних каталогів під час видобування (типово).

source: Recursively remove all files in the directory prior to extracting it.
nl: Alle bestanden in de map recursief verwijderen alvorens het archief uit te pakken
uk: Рекурсивно вилучати усі файли у каталозі перед видобуванням до нього.

source: Remove files from disk after adding them to the archive.
nl: Bestanden na hun toevoeging aan het archief verwijderen.
uk: Вилучати файли з диска після додавання їх до архіву.

source: Don't replace existing files when extracting, silently skip over them.
nl: Bij het uitpakken bestaande bestanden niet vervangen; stilletjes overslaan.
uk: Не заміняти наявні файли під час видобування, мовчки пропускати такі файли.

source: Remove each file prior to extracting over it.
nl: Elk bestand verwijderen voor het uit te pakken.
uk: Вилучати кожний файл перед видобуванням його копії.

source: Verify the archive after writing it.
nl: Het archief na het schrijven verifiëren.
uk: Перевірити архів після запису.

source: Output stream selection
nl: Selecteren van uitvoerkanaal
uk: Вибір потоку виведення даних

source: Ignore subprocess exit codes.
nl: Eind waarden van dochter processen negeren.
uk: Ігнорувати коди виходу підпроцесу.

source: Treat non-zero exit codes of children as error (default).
nl: Eind waarden van dochter processen die niet nul zijn als fout behandelen (standaard).
uk: Вважати ненульовий код завершення нащадка помилкою (типово).

source: Extract files to standard output.
nl: Bestanden uitpakken naar standaard uitvoer.
uk: Видобути файли у стандартне виведення.

source: B<--to-command>=I<COMMAND>
nl: B<--to-command>=I<OPDRACHT>
uk: B<--to-command>=I<КОМАНДА>

source: Pipe extracted files to I<COMMAND>. The argument is the pathname of an external program, optionally with command line arguments. The program will be invoked and the contents of the file being extracted supplied to it on its standard input. Additional data will be supplied via the following environment variables:
nl: Sluis uitgepakte bestanden door I<OPDRACHT>. Het argument is de pad naam van een extern programma, optioneel met commando regel argumenten. Het programma wordt aangeroepen en de inhoud van een uitgepakt bestand wordt eraan aangeboden via de standaard invoer. Additionele data zal worden aangeboden via de volgende omgevingsvariabelen:
uk: Передати видобуті файли каналом до I<КОМАНДИ>. Аргументом є шлях до зовнішньої програми, можливо, з аргументами командного рядка. Буде викликано програму і передано їй на стандартне введення вміст видобутого файла. Додаткові дані буде передано за допомогою таких змінних середовища:

source: Type of the file. It is a single letter with the following meaning:
nl: Type van het bestand. Dit is een enkele letter met de volgende betekenis:
uk: Тип файла. Одна літера із таким значенням:

source: f Regular file d Directory l Symbolic link h Hard link b Block device c Character device
nl: f Normaal bestand d Map l Symbolische koppeling h Harde koppeling b Blok apparaat c Teken apparaat
uk: f звичайний файл d каталог l символічне посилання h жорстке посилання b блоковий пристрій c символьний пристрій

source: Currently only regular files are supported.
nl: Momenteel worden alleen normale bestanden ondersteund.
uk: У поточній версії передбачено підтримку лише звичайних файлів.

source: File mode, an octal number.
nl: Bestands modus, een octaal getal
uk: Режим доступу до файла у формі вісімкового числа.

source: The name of the file.
nl: De naam van het bestand.
uk: Назва файла.

source: Name of the file as stored in the archive.
nl: Naam van het bestand zoals opgeslagen in het archief.
uk: Назва файла, як її вказано в архіві.

source: Name of the file owner.
nl: Naam van de eigenaar van het bestand.
uk: Ім'я власника файла.

source: Name of the file owner group.
nl: Naam van de groep van het bestand.
uk: Назва групи власника файла.

source: Time of last access. It is a decimal number, representing seconds since the Epoch. If the archive provides times with nanosecond precision, the nanoseconds are appended to the timestamp after a decimal point.
nl: Tijd van de laatste toegang. Dit is een decimaal getal, dat het aantal seconden sinds de Epoch voorsteld. Als het archief tijden met nanoseconden precisie bevat, dan worden de nanoseconden achter de decimale punt van de tijdstempel toegevoegd.
uk: Момент останнього доступу. Це десяткове число, яке відповідає кількості секунд з моменту початку епохи. Якщо в архіві визначено моменти часу з точністю до наносекунд, наносекунди буде дописано до часової позначки після десяткової крапки.

source: Time of last modification.
nl: Tijd van de laatste wijziging.
uk: Час останнього внесення змін.

source: Time of last status change.
nl: Tijd van de laatste status verandering.
uk: Момент останньої зміни стану.

source: Size of the file.
nl: Grootte van het bestand.
uk: Розмір файла.

source: UID of the file owner.
nl: UID van de eigenaar van het bestand.
uk: UID власника файла.

source: GID of the file owner.
nl: GID van de eigenaar van het bestand.
uk: GID власника файла.

source: Additionally, the following variables contain information about B<tar> operation mode and the archive being processed:
nl: Bovendien bevatten de volgende variabelen informatie over de werking modus en het archief van wordt bewerkt van B<tar>:
uk: Крім того, дані щодо режиму дій та архіву, який обробляє B<tar>, зберігаються у таких змінних:

source: GNU B<tar> version number.
nl: GNU B<tar> versie nummer.
uk: Номер версії GNU B<tar>.

source: The name of the archive B<tar> is processing.
nl: De naam van het archief dat B<tar> bewerkt.
uk: Назва архіву, який обробляє B<tar>.

source: Current blocking factor, i.e. number of 512-byte blocks in a record.
nl: Huidige blok factor, m.a.w. het aantal 512-byte blokken in een record.
uk: Поточний блоковий коефіцієнт, тобто кількість 512-байтових блоків у записі.

source: Ordinal number of the volume B<tar> is processing (set if reading a multi-volume archive).
nl: Ordinaal getal van het volume dat B<tar> verwerkt (gezet bij het lezen vaneen multi-volume archief)
uk: Порядковий номер тому, який обробляє B<tar> (встановлюється при читанні багатотомного архіву).

source: Format of the archive being processed. One of: B<gnu>, B<oldgnu>, B<posix>, B<ustar>, B<v7>.
nl: Indeling van het archief dat verwerkt wordt. Een van: B<gnu>, B<oldgnu>, B<posix>, B<ustar>, B<v7>.
uk: Формат архіву, який обробляє програма. Одне з таких значень: B<gnu>, B<oldgnu>, B<posix>, B<ustar>, B<v7>.

source: A short option (with a leading dash) describing the operation B<tar> is executing.
nl: Een korte optie (met voorafgaand streepje) die de operatie die B<tar> uitvoert beschrijft.
uk: Короткий запис параметра (із початковим дефісом), що описує дію, яку виконує B<tar>.

source: Handling of file attributes
nl: Behandeling van bestandskenmerken
uk: Обробка атрибутів файла

source: B<--atime-preserve>[=I<METHOD>]
nl: B<--atime-preserve>[=I<METHODE>]
uk: B<--atime-preserve>[=I<МЕТОД>]

source: Preserve access times on dumped files, either by restoring the times after reading (I<METHOD>=B<replace>, this is the default) or by not setting the times in the first place (I<METHOD>=B<system>)
nl: Toegangstijdsstempels van gearchiveerde bestanden behouden, ofwel door het herstellen van de tijdsstempels na het lezen (I<MANIER>=B<replace>, ofwel of door de tijdstempels met rust te laten (I<MANIER>=B<system>)
uk: Відтворювати час доступу до доданих файлів через відновлювання часу після читання (типово, I<МЕТОД>=B<replace>), або через запобігання оновленню часу (I<МЕТОД>=B<system>)

source: Delay setting modification times and permissions of extracted directories until the end of extraction. Use this option when extracting from an archive which has unusual member ordering.
nl: Uitstellen van het zetten van permissies en tijdstempels van uitgepakte mappen tot na het uitpakken. Gebruik deze optie om uit te pakken uit een archief met een ongebruikelijke ordening van leden.
uk: Затримати встановлення часу модифікації та прав доступу до каталогів до кінця видобування. Скористайтеся цим параметром при видобуванні з архіву, у якому використано незвичний порядок елементів.

source: B<--group>=I<NAME>[:I<GID>]
nl: B<--group>=I<NAAM>[:I<GID>]
uk: B<--group>=I<НАЗВА>[:I<GID>]

source: Force I<NAME> as group for added files. If I<GID> is not supplied, I<NAME> can be either a user name or numeric GID. In this case the missing part (GID or name) will be inferred from the current host's group database.
nl: Forceer I<NAAM> als groep voor toegevoegde bestanden. Als I<GID> niet opgegeven werd, dan kan I<NAAM> ofwel een gebruikersnaam ofwel een numeriek GID zijn. In dit geval zal het ontbrekende deel (GID of naam) afgeleid worden van de groep database van het systeem.
uk: Примусово призначити I<НАЗВУ>, як групу для доданих файлів. Якщо I<GID> не вказано, I<НАЗВА> може бути як назвою групи, так і числовим значенням GID. У такому випадку, пропущену частину (GID або назву групи) буде встановлено на основі бази даних поточного вузла.

source: When used with B<--group-map>=I<FILE>, affects only those files whose owner group is not listed in I<FILE>.
nl: Indien gebruikt met B<--group-map>=I<BESTAND>, beïnvloed alleen die bestanden waarvan de groepseigenaar niet voorkomt in I<BESTAND>.
uk: Якщо використано із B<--group-map>=I<ФАЙЛ>, стосується лише тих файлів, групи власника яких немає у списку I<ФАЙЛ>.

source: B<--group-map>=I<FILE>
nl: B<--group-map>=I<BESTAND>
uk: B<--group-map>=I<ФАЙЛ>

source: Read group translation map from I<FILE>. Empty lines are ignored. Comments are introduced with B<#> sign and extend to the end of line. Each non-empty line in I<FILE> defines translation for a single group. It must consist of two fields, delimited by any amount of whitespace:
nl: Lees de groep vertaal tabel uit I<BESTAND>. Lege regels worden genegeerd. Commentaar begint met het B<#> teken en eindigt bij het einde van de regel. Elke niet lege regel in I<BESTAND> bepaald de vertaling van een enkele groep. Die regel moet bestaan uit twee velden, gescheiden door elk aantal van witruimtes.
uk: Прочитати карту переходу груп з I<ФАЙЛ>а. Порожні рядки буде проігноровано. Коментарі додають за допомогою символу B<#>. Усе після цього символу і до кінця рядка вважають коментарем. Будь-який непорожній рядок у I<ФАЙЛ>і визначають перехід для однієї групи. Він має містити два поля, відокремлені будь-якою кількістю пробілів:

source: I<OLDGRP> I<NEWGRP>[B<:>I<NEWGID>]
nl: I<OUDE_GROEP> I<NIEUWE_GROEP>[B<:>I<NIEUW_GID>]
uk: I<СТАРА_ГРУПА> I<НОВА_ГРУПА>[B<:>I<НОВИЙ_GID>]

source: I<OLDGRP> is either a valid group name or a GID prefixed with B<+>. Unless I<NEWGID> is supplied, I<NEWGRP> must also be either a valid group name or a B<+>I<GID>. Otherwise, both I<NEWGRP> and I<NEWGID> need not be listed in the system group database.
nl: I<OUDE_GROEP> is ofwel een geldige groep ofwel een GID voorafgegaan met B<+>. Behalve als I<NIEUW_GID> werd gegeven, moet I<NIEUWE_GROEP> ofwel een geldige groepsnaam ofwel een B<+>I<GID> zijn. Anders hoeven zowel I<NIEUWE_GROEP> als I<NIEUW_GID> niet vermeld te worden in de groep database van het systeem.
uk: I<СТАРА_ГРУПА> — або коректна назва групи, або GID із префіксом B<+>. Якщо не вказано I<НОВИЙ_GID>, I<НОВА_ГРУПА> має також бути або коректною назвою групи, або B<+>I<GID>. В усіх інших випадках, I<НОВА_ГРУПА> і I<НОВИЙ_GID> не повинні бути частиною бази даних груп системи.
