Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: print a message if not all links are dumped
nl: een bericht tonen als niet alle links gearchiveerd werden
uk: виводити повідомлення якщо до архіву було додано не всі посилання

source: disable quoting for characters from STRING
nl: de tekens in TEKENREEKS niet aanhalen
uk: вимкнути взяття у лапки вказаних символів

source: additionally quote characters from STRING
nl: ook de tekens in TEKENREEKS aanhalen
uk: брати у лапки також вказані РЯДКОМ символи

source: set name quoting style; see below for valid STYLE values
nl: aanhalingsstijl voor namen instellen (zie verderop voor geldige waarden van STIJL)
uk: встановити стиль взяття у лапки; дозволені стилі див. нижче

source: show block number within archive with each message
nl: bloknummer binnen archief tonen bij elk bericht
uk: попереджувати кожне повідомлення номером блоку в архіві

source: show tar defaults
nl: standaardinstellingen van 'tar' tonen
uk: вивести типові налаштування

source: when listing or extracting, list each directory that does not match search criteria
nl: bij opsommen of uitpakken: elke map opsommen die niet aan zoekcriteria voldoet
uk: під час виведення вмісту або видобування файлів друкувати назви каталогів, що не відповідають критеріям пошуку

source: show valid ranges for snapshot-file fields
nl: geldige bereiken tonen voor snapshot-velden
uk: вивести коректні діапазони для полів файлів-знімків

source: show file or archive names after transformation
nl: bestands- of archiefnamen na transformatie tonen
uk: показувати перетворені назви файлів

source: print total bytes after processing the archive; with an argument - print total bytes when this SIGNAL is delivered; Allowed signals are: SIGHUP, SIGQUIT, SIGINT, SIGUSR1 and SIGUSR2; the names without SIG prefix are also accepted
nl: na verwerking van het archief het totaal aantal bytes printen; als een argument gegeven is, dan het totaal aantal bytes printen als dit SIGNAAL ontvangen wordt; mogelijke signalen zijn: SIGHUP, SIGQUIT, SIGINT, SIGUSR1 en SIGUSR2; de namen zonder het voorvoegsel SIG worden ook geaccepteerd
uk: друкувати статистику після завершення роботи; якщо вказаний аргумент СИГНАЛ - друкувати статистику по отриманню цього сигналу; дозволеними сигналами є SIGHUP, SIGQUIT, SIGINT, SIGUSR1 і SIGUSR2, а також ці назви без префікса SIG

source: print file modification times in UTC
nl: bestandswijzigingstijden in UTC tonen
uk: друкувати час модифікації файлів у UTC

source: verbosely list files processed
nl: de verwerkte bestanden opsommen
uk: виводити докладну інформацію про оброблені файли

source: warning control
nl: waarschuwingsbeleid
uk: керування попередженнями

source: ask for confirmation for every action
nl: bij elke actie om toestemming vragen
uk: Запитувати підтвердження кожної дії

source: Compatibility options:
nl: Compatibiliteitsopties:
uk: Параметри сумісності:

source: when creating, same as B<--old-archive>; when extracting, same as B<--no-same-owner>
nl: bij aanmaken hetzelfde als B<--old-archive>; bij uitpakken hetzelfde als B<--no-same-owner>
uk: під час створення архіву, те ж саме, що і B<--old-archive>. Під час видобування, те ж саме, що B<--no-same-owner>

source: Other options:
nl: Andere opties:
uk: Інші параметри:

source: give this help list
nl: een hulptekst tonen
uk: показати ці довідкові дані

source: disable use of some potentially harmful options
nl: het gebruik van potentieel gevaarlijke opties of opdrachten uitschakelen
uk: заборонити користування деякими потенційно небезпечними параметрами

source: give a short usage message
nl: een korte gebruikssamenvatting tonen
uk: отримати коротке повідомлення щодо користування

source: print program version
nl: programmaversie tonen
uk: вивести дані щодо версії програми

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
nl: Een verplicht argument bij een lange optie geldt ook voor de korte vorm.
uk: Обов’язкові і додаткові аргументи до довгих форм запису параметрів є також обов’язковими або додатковими для всіх відповідних скорочених форм запису.

source: The backup suffix is '~', unless set with B<--suffix> or SIMPLE_BACKUP_SUFFIX. The version control may be set with B<--backup> or VERSION_CONTROL, values are:
nl: Het reservekopie-achtervoegsel is '~', tenzij anders ingesteld met B<--suffix> of via omgevingsvariable SIMPLE_BACKUP_SUFFIX. Het versiebeheer kan worden ingesteld met de optie B<--backup> of via omgevingsvariabele VERSION_CONTROL; dit zijn de mogelijke waarden (methodes):
uk: Типовий суфікс для резервних копій — «~», якщо не встановлено значення змінної середовища SIMPLE_BACKUP_SUFFIX або не використано параметр B<--suffix>. Спосіб керування версіями можна вказати за допомогою параметра B<--backup> або змінною середовища VERSION_CONTROL. Можливі значення:

source: never make backups
nl: nooit reservekopieën maken
uk: ніколи не робити резервних копій

source: make numbered backups
nl: genummerde reservekopieën maken
uk: робити нумеровані резервні копії

source: numbered if numbered backups exist, simple otherwise
nl: genummerde reserves maken als er al zijn, anders eenvoudig
uk: нумерований, якщо існують нумеровані резервні копії, простий в інших випадках

source: always make simple backups
nl: altijd eenvoudige reservekopieën maken
uk: завжди робити прості резервні копії

source: Valid arguments for the B<--quoting-style> option are:
nl: Geldige argumenten van de optie B<--quoting-style> zijn:
uk: Коректними аргументами до параметра B<--quoting-style> є такі:

source: *This* tar defaults to: B<--format>=I<gnu> B<-f-> B<-b20> B<--quoting-style>=I<escape> B<--rmt-command=>/usr/sbin/rmt B<--rsh-command=>/usr/bin/ssh
nl: *Deze* tar gebruikt de volgende standaardwaarden: B<--format>=I<gnu> B<-f-> B<-b20> B<--quoting-style>=I<escape> B<--rmt-command=>/usr/sbin/rmt B<--rsh-command=>/usr/bin/ssh
uk: Типові параметри *цього варіанта* tar: B<--format>=I<gnu> B<-f-> B<-b20> B<--quoting-style>=I<escape> B<--rmt-command=>/usr/sbin/rmt B<--rsh-command=>/usr/bin/ssh

source: AUTHOR
nl: AUTEUR
uk: АВТОР

source: Written by John Gilmore and Jay Fenlason.
nl: Geschreven door John Gilmore en Jay Fenlason.
uk: Авторами програми є John Gilmore і Jay Fenlason.

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
uk: Авторські права \(co 2021 Free Software Foundation, Inc. Ліцензія GPLv3+: GNU GPL версії 3 або пізнішої E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: The full documentation for B<tar> is maintained as a Texinfo manual. If the B<info> and B<tar> programs are properly installed at your site, the command
nl: De volledige documentatie voor B<tar> wordt bijgehouden als een Texinfo-handleiding. Als de programma's B<info> en B<tar> correct op uw systeem zijn geïnstalleerd, geeft u de opdracht
uk: Повноцінну документацію з B<tar> можна знайти у довіднику Texinfo. Якщо у вашій системі встановлено B<info>(1) та B<tar>, за допомогою команди

source: B<--occurrence>[=I<N>]
nl: B<--occurrence>[=I<AANTAL>]

source: B<TAR_SUBCOMMAND>
nl: B<TAR_SUBCOMMANDO>

source: October 2022
nl: Oktober 2022

source: handling)
nl: afhandeling)
