Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: July 13, 2020
nl: 13 juli 2020
uk: 13 липня 2020 року

source: GNU TAR Manual
nl: GNU TAR Gebruikershandleiding
uk: Підручник з GNU TAR

source: NAME
nl: NAAM
uk: НАЗВА

source: tar - an archiving utility
nl: tar - een archivering hulpprogramma
uk: tar — програма для архівування

source: SYNOPSIS
nl: SAMENVATTING
uk: КОРОТКИЙ ОПИС

source: Traditional usage
nl: Traditioneel gebruik
uk: Традиційне користування

source: B<tar> {B<A>|B<c>|B<d>|B<r>|B<t>|B<u>|B<x>}[B<GnSkUWOmpsMBiajJzZhPlRvwo>] [I<ARG>...]
uk: B<tar> {B<A>|B<c>|B<d>|B<r>|B<t>|B<u>|B<x>}[B<GnSkUWOmpsMBiajJzZhPlRvwo>] [I<АРГУМЕНТ>...]

source: UNIX-style usage
nl: UNIX-stijl gebruik
uk: Користування у стилі UNIX

source: B<tar> B<-A> [I<OPTIONS>] I<ARCHIVE> I<ARCHIVE>
nl: B<tar> B<-A> [I<OPTIES>] I<ARCHIEF> I<ARCHIEF>
uk: B<tar> B<-A> [I<ПАРАМЕТРИ>] I<АРХІВ> I<АРХІВ>

source: B<tar> B<-c> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<-c> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<-c> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<-d> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<-d> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<-d> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<-t> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<MEMBER>...]
nl: B<tar> B<-t> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<LID>...]
uk: B<tar> B<-t> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ЕЛЕМЕНТ>...]

source: B<tar> B<-r> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<-r> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<-r> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<-u> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<-u> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<-u> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<-x> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<MEMBER>...]
nl: B<tar> B<-x> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<LID>...]
uk: B<tar> B<-x> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ЕЛЕМЕНТ>...]

source: GNU-style usage
nl: GNU-stijl gebruik
uk: Користування у стилі GNU

source: B<tar> {B<--catenate>|B<--concatenate>} [I<OPTIONS>] I<ARCHIVE> I<ARCHIVE>
nl: B<tar> {B<--catenate>|B<--concatenate>} [I<OPTIES>] I<ARCHIEF> I<ARCHIEF>
uk: B<tar> {B<--catenate>|B<--concatenate>} [I<ПАРАМЕТРИ>] I<АРХІВ> I<АРХІВ>

source: B<tar> B<--create> [B<--file> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<--create> [B<--file> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<--create> [B<--file> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> {B<--diff>|B<--compare>} [B<--file> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> {B<--diff>|B<--compare>} [B<--file> I<ARCHEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> {B<--diff>|B<--compare>} [B<--file> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<--delete> [B<--file> I<ARCHIVE>] [I<OPTIONS>] [I<MEMBER>...]
nl: B<tar> B<--delete> [B<--file> I<ARCHIEF>] [I<OPTIES>] [I<LID>...]
uk: B<tar> B<--delete> [B<--file> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ЕЛЕМЕНТ>...]

source: B<tar> B<--append> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<--append> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<--append> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<--list> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<MEMBER>...]
nl: B<tar> B<--list> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<LID>...]
uk: B<tar> B<--list> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ЕЛЕМЕНТ>...]

source: B<tar> B<--test-label> [B<--file> I<ARCHIVE>] [I<OPTIONS>] [I<LABEL>...]
nl: B<tar> B<--test-label> [B<--file> I<ARCHIEF>] [I<OPTIES>] [I<LABEL>...]
uk: B<tar> B<--test-label> [B<--file> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<LABEL>...]

source: B<tar> B<--update> [B<--file> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<--update> [B<--file> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<--update> [B<--file> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> B<--update> [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<FILE>...]
nl: B<tar> B<--update> [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<BESTAND>...]
uk: B<tar> B<--update> [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ФАЙЛ>...]

source: B<tar> {B<--extract>|B<--get>} [B<-f> I<ARCHIVE>] [I<OPTIONS>] [I<MEMBER>...]
nl: B<tar> {B<--extract>|B<--get>} [B<-f> I<ARCHIEF>] [I<OPTIES>] [I<LID>...]
uk: B<tar> {B<--extract>|B<--get>} [B<-f> I<АРХІВ>] [I<ПАРАМЕТРИ>] [I<ЕЛЕМЕНТ>...]

source: NOTE
nl: OPMERKING
uk: НОТАТКА

source: This manpage is a short description of GNU B<tar>. For a detailed discussion, including examples and usage recommendations, refer to the B<GNU Tar Manual> available in texinfo format. If the B<info> reader and the tar documentation are properly installed on your system, the command
nl: Deze man-pagina bevat een korte beschrijving van GNU B<tar>. Voor een gedetailleerde discussie, inclusief voorbeelden en aanbevelingen over gebruik, verwijzen we naar de B<GNU Tar Handleiding> beschikbaar in texinfo formaat. Als de B<info> lezer en de tar documentatie correct op jouw systeem zijn geïnstalleerd, dan geeft het commando
uk: На цій сторінці підручника наведено короткий опис GNU B<tar>. Докладне обговорення, разом із прикладами та рекомендаціями щодо застосування, наведено у B<підручнику з GNU Tar> у форматі texinfo. Якщо у вашій системі встановлено засіб для читання B<info> і належним чином встановлено документацію з tar, за допомогою команди

source: should give you access to the complete manual.
nl: toegang tot de volledige handleiding.
uk: ви зможете отримати доступ до повноцінного підручника.

source: You can also view the manual using the info mode in B<emacs>(1), or find it in various formats online at
nl: U kunt de manual ook lezen door gebruik te maken van de info modus in B<emacs>(1), of hem vinden in de diverse formaten online op
uk: Ви також можете переглянути цей підручник, скориставшись режимом info в B<emacs>(1) або знайти у його у різноманітних форматах в інтернеті за адресою

source: If any discrepancies occur between this manpage and the B<GNU Tar Manual>, the later shall be considered the authoritative source.
nl: Als er een verschil optreed tussen deze man-pagina en de B<GNU Tar Handleiding>, dan dient de laatste beschouwd te worden als de bepalende bron.
uk: Якщо існують якісь відмінності між цією сторінкою підручника і B<Підручником з GNU Tar>, слід вважати авторитетнішим джерелом саме підручник.

source: DESCRIPTION
nl: BESCHRIJVING
uk: ОПИС

source: GNU B<tar> is an archiving program designed to store multiple files in a single file (an B<archive>), and to manipulate such archives. The archive can be either a regular file or a device (e.g. a tape drive, hence the name of the program, which stands for B<t>ape B<ar>chiver), which can be located either on the local or on a remote machine.
nl: GNU B<tar> is een archivering programma ontworpen om meerdere bestanden in een enkel bestand op te slaan, en om zulke archieven te bewerken. Het archief kan een normaal bestand of apparaat zijn (b.v. een band apparaat, vandaar de naam van het programma, dat B<t>ape B<ar>chiver betekent, die zich bevind op de lokale of een machine op afstand.
uk: GNU B<tar> — програма для архівування, яку розроблено для зберігання декількох файлів в одному файлі (B<архіві>), та роботи з архівами. Архівом може бути або звичайний файл, або пристрій (наприклад, накопичувач на магнітній стрічці, звідки походить назва програми B<t>ape B<ar>chiver або «архіватор на стрічці»), які може бути розташовано на локальній або віддаленій машині.

source: Option styles
nl: Optie stijlen
uk: Стилі параметрів

source: Options to GNU B<tar> can be given in three different styles. In B<traditional style>, the first argument is a cluster of option letters and all subsequent arguments supply arguments to those options that require them. The arguments are read in the same order as the option letters. Any command line words that remain after all options has been processed are treated as non-optional arguments: file or archive member names.
nl: Opties voor GNU B<tar> kunnen bestaan uit drie verschillende stijlen. In de B<traditionele stijl>, is het eerste argument een groep van optie letters en alle volgende argumenten geven argumenten aan die opties die zo nodig hebben. De argumenten worden gelezen in dezelfde volgorde als de optie letters. Elk commando dat resteert nadat alle opties zijn verwerkt worden behandeld als niet-optionele argumenten: bestandsnamen of namen van leden van archieven.
uk: Параметри GNU B<tar> можна передавати у трьох різних стилях. У B<традиційному стилі> першим аргументом є поєднання літер параметрів, а усі наступні аргументи є аргументами параметрів, які їх потребують. Аргументи буде прочитано у тому самому порядку, у якому вказано літери параметрів. Усі слова командного рядка, які лишаться після обробки усіх параметрів вважаються аргументами поза параметрами: назвами файлів або елементів архіву.

source: For example, the B<c> option requires creating the archive, the B<v> option requests the verbose operation, and the B<f> option takes an argument that sets the name of the archive to operate upon. The following command, written in the traditional style, instructs tar to store all files from the directory B</etc> into the archive file B<etc.tar> verbosely listing the files being archived:
nl: Bijvoorbeeld, de B<c> optie zal een archief aanmaken, de B<v> optie vraagt om veel informatie te geven, en de B<f> optie vraagt om een argument van de naam van het archief om op te werken. Het volgende commando, geschreven in de traditionele stijl, instrueert tar om alle bestanden van de map B</etc> op te slaan in het archief bestand B<etc.tar> daarbij uitgebreide informatie gevend over de bestanden die worden gearchiveerd:
uk: Наприклад, параметр B<c> вказує на створення архіву, параметр B<v> вказує на режим докладних повідомлень, а параметр B<f> приймає аргумент, який встановлює назву архіву, з яким слід працювати. Вказана нижче команда, яку записано у традиційному стилі, наказує tar зберегти усі файли з каталогу B</etc> до файла архіву B<etc.tar> із виведенням докладного списку файлів, які архівовано:

source: In B<UNIX >orB< short-option style>, each option letter is prefixed with a single dash, as in other command line utilities. If an option takes argument, the argument follows it, either as a separate command line word, or immediately following the option. However, if the option takes an B<optional> argument, the argument must follow the option letter without any intervening whitespace, as in B<-g/tmp/snar.db>.
nl: In B<UNIX> of B<korte-optie stijl>, is elke optie een letter voorafgegaan door een enkel verbindingsstreepje, net als in andere commando´s. Als een optie een argument nodig heeft, dan moet dat meteen volgen, ofwel als een apart commando woord, ofwel onmiddellijk na de optie. Echter, als een optie een B<optioneel> argument nodig heeft, dan moet die onmiddellijk na de optie volgen, zonder een tussenliggende witruimte, net als in B<-g/tmp/snar.db>.
uk: У стилі B<UNIX> або B<стилі коротких параметрів> до кожної літери додається префікс-дефіс, як в інших допоміжних програмах командного рядка. Якщо параметр приймає аргумент, аргумент вказують після нього, як окреме слово рядка команди, або одразу після параметра. Втім, якщо параметр приймає B<необов'язковий> аргумент, цей аргумент має бути вказано одразу після параметра без пробілів, ось так: B<-g/tmp/snar.db>.

source: Any number of options not taking arguments can be clustered together after a single dash, e.g. B<-vkp>. Options that take arguments (whether mandatory or optional), can appear at the end of such a cluster, e.g. B<-vkpf a.tar>.
nl: Opties die geen argumenten nodig hebben mogen samen gegroepeerd worden na een enkel verbindingsstreepje, b.v. B<-vkp>. Opties die argumenten nodig hebben (zowel verplicht als optioneel), mogen gegeven worden ná zulk een groep, b.v. B<-vkpf a.tar>.
uk: Довільну кількість параметрів, які не приймають аргументів, можна поєднати в один запис після початкового одинарного дефіса. Приклад: B<-vkp>. Параметри, які приймають аргументи (обов'язкові чи необов'язкові) можна вказати наприкінці поєднання. Приклад: B<-vkpf a.tar>.

source: The example command above written in the B<short-option style> could look like:
nl: Het hierboven gegeven commando kan er in de B<korte-optie stijl> uitzien als:
uk: Приклад команди, використаної вище, у B<стилі коротких параметрів> може виглядати так:

source: or
nl: of
uk: або

source: In B<GNU >orB< long-option style>, each option begins with two dashes and has a meaningful name, consisting of lower-case letters and dashes. When used, the long option can be abbreviated to its initial letters, provided that this does not create ambiguity. Arguments to long options are supplied either as a separate command line word, immediately following the option, or separated from the option by an equals sign with no intervening whitespace. Optional arguments must always use the latter method.
nl: In B<GNU> of B<lange-optie stijl> begint elke optie met twee verbindingsstreepjes en heeft een betekenis volle naam, bestaande of kleine letters and streepjes. Indien die gebruikte wordt, kan de lange optie afgekort worden tot zijn initiële letter, mits dat geen ambiguïteit creëert. Argumenten voor lange opties worden gegeven als ofwel als een apart commando woord, onmiddellijk na de optie, ofwel gescheiden van de optie door een is-teken zonder tussen liggende witruimte. Optionele argumenten moeten altijd de laatste methode volgen.
uk: У стилі B<GNU> або B<стилі довгих параметрів> запис кожного параметра починається з двох дефісів, а самі параметри мають зручну для читання і розуміння назви, які складаються з літер нижнього регістру та дефісів. При використанні довгий параметр можна скоротити до його початкових літер, якщо це не створює неоднозначностей. Аргументи до довгих параметрів вказують або як окреме слово команди, яке має бути вказано безпосередньо за параметром, або відокремивши його від параметра символом рівності без проміжних пробілів. Необов'язкові параметри слід завжди вказувати за другим варіантом запису.

source: Here are several ways of writing the example command in this style:
nl: Hier zijn verschillende manieren van het voorbeeld commando in deze stijl:
uk: Ось декілька способів написання команди-прикладу у цьому стилі:

source: or (abbreviating some options):
nl: of (afkorten van sommige opties):
uk: або (скорочення деяких параметрів):

source: The options in all three styles can be intermixed, although doing so with old options is not encouraged.
nl: De opties in alle drie de stijlen mogen gemengd worden, alhoewel dit niet wordt aangeraden voor oude opties.
uk: Параметри усіх трьох стилів можна використовувати разом, хоча не варто цього робити із застарілими параметрами.

source: Operation mode
nl: Bewerkingen
uk: Режим операції

source: The options listed in the table below tell GNU B<tar> what operation it is to perform. Exactly one of them must be given. Meaning of non-optional arguments depends on the operation mode requested.
nl: De opties in de tabel hieronder vertellen wat GNU B<tar> moet doen. Precies één van deze moet opgegeven worden. De betekenis van niet-optionele argumenten hangt af van de opgegeven modus.
uk: За допомогою вказаних у наведеній нижче таблиці параметрів можна повідомити GNU B<tar>, яку саме дію слід виконати. Вказати в одній команді можна лише один з цих параметрів. Призначення обов'язкових аргументів залежить від визначеного режиму дій.

source: Append archive to the end of another archive. The arguments are treated as the names of archives to append. All archives must be of the same format as the archive they are appended to, otherwise the resulting archive might be unusable with non-GNU implementations of B<tar>. Notice also that when more than one archive is given, the members from archives other than the first one will be accessible in the resulting archive only if using the B<-i> (B<--ignore-zeros>) option.
nl: Archief aan het eind van een ander archief toevoegen . De argumenten worden behandeld als de namen van de toe te voegen archieven. Alle archieven moeten van hetzelfde formaat zijn als het archief dat toegevoegd gaat worden, anders zou het resulterende archief mogelijk niet bruikbaar zijn voor niet-GNU implementaties van B<tar>. Merk op dat wanneer meer dan een archief werd gegeven, de leden van de archieven anders dan de eerste, alleen toegankelijk zijn in het resulterende archief door gebruik van de optie B<-i> (B<--ignore-zeros>).
uk: Дописати архів наприкінці іншого архіву. Аргументи вважають назвами архівів, які слід дописати. Усі архіви має бути створено в одному форматі із архівом, до якого їх дописують, оскільки якщо таке правило буде порушено, архів-результат може стати непридатним у реалізаціях B<tar>, відмінних від GNU. Зауважте також, що якщо вказано декілька архівів, елементи з архівів, окрім першого, будуть доступними, лише якщо використано параметр B<-i> (B<--ignore-zeros>).

source: Compressed archives cannot be concatenated.
nl: Gecomprimeerde archieven kunnen niet geconcateneerd worden.
uk: Стиснені архіви не можна об'єднувати.

source: Create a new archive. Arguments supply the names of the files to be archived. Directories are archived recursively, unless the B<--no-recursion> option is given.
nl: Een nieuw archief creëren. Argumenten geven de namen van bestanden die gearchiveerd moeten worden. Mappen worden recursief gearchiveerd, behalve als de B<--no-recursion> werd gebruikt.
uk: Створити архів. Аргументи визначають назви файлів, які слід архівувати. Каталоги буде архівовано рекурсивно, якщо не вказано параметра B<--no-recursion>.

source: Find differences between archive and file system. The arguments are optional and specify archive members to compare. If not given, the current working directory is assumed.
nl: De verschillen tussen archief en het bestandssysteem zoeken. De argumenten zijn optioneel en specificeren welke leden te vergelijken. Niet gegeven betekent dat de werkmap wordt gebruikt.
uk: Виявити відмінності між архівом і файловою системою. Аргументи є необов'язковими і вказують елементи архіву, які слід порівняти. Якщо аргументів не вказано, буде використано поточний робочий каталог.

source: Delete from the archive. The arguments supply names of the archive members to be removed. At least one argument must be given.
nl: Uit archief verwijderen. De argumenten geven de namen van leden die verwijderd moet worden. Minstens een argument moet opgegeven worden.
uk: Вилучити з архіву. Аргументи визначають назви елементів архіву, які слід вилучити. Має бути вказано принаймні один аргумент.

source: This option does not operate on compressed archives. There is no short option equivalent.
nl: Deze optie werkt niet op gecomprimeerde archieven. Er bestaat geen korte-optie equivalent.
uk: Цей параметр не працює для стиснених архівів. Короткого еквівалента у цього параметра немає.

source: Append files to the end of an archive. Arguments have the same meaning as for B<-c> (B<--create>).
nl: Bestanden toe voegen aan het einde van het archief. Argumenten hebben dezelfde betekenis als voor B<-c> (B<--create>).
uk: Дописати файли наприкінці архіву. Аргументи мають те саме значення, що і для B<-c> (B<--create>).

source: List the contents of an archive. Arguments are optional. When given, they specify the names of the members to list.
nl: De inhoud van een archief tonen. Argumenten zijn optioneel. Indien opgegeven, dan specificeren ze de te tonen namen van leden.
uk: Вивести список вмісту архіву. Аргументи є необов'язковими. Якщо вказано, вони визначають назви елементів архіву, які слід вивести у списку.

source: Test the archive volume label and exit. When used without arguments, it prints the volume label (if any) and exits with status B<0>. When one or more command line arguments are given. B<tar> compares the volume label with each argument. It exits with code B<0> if a match is found, and with code B<1> otherwise. No output is displayed, unless used together with the B<-v> (B<--verbose>) option.
nl: Het volume label van het archief testen en stoppen. Indien gebruikt zonder argumenten dan toont het het volume label (als er een is) en stopt met de eind waarde B<0>. Indien een of meer argumenten werden gegeven dan vergelijkt B<tar> het volume label met elk argument. Het stopt met code B<0> als er een overeenkomst werd gevonden en anders met eind waarde B<1>. Er wordt geen uitvoer getoond, behalve in combinatie met de B<-v> (B<--verbose>) optie.
uk: Перевірити мітку тому архіву і вийти. При використанні без аргументів виводить мітку тому (якщо таку визначено) і завершує роботу зі станом B<0>. Якщо надано один або декілька аргументів командного рядка, B<tar> порівняє мітку тому з кожним аргументом. Програма завершить роботу з кодом B<0>, якщо буде знайдено відповідник, і з кодом B<1> в інших випадках. Нічого не буде виведено, якщо не буде використано разом із параметром B<-v> (B<--verbose>).

source: There is no short option equivalent for this option.
nl: Er is geen korte optie equivalent voor deze optie.
uk: Короткого еквівалента у цього параметра немає.

source: Append files which are newer than the corresponding copy in the archive. Arguments have the same meaning as with B<-c> and B<-r> options. Notice, that newer files don't replace their old archive copies, but instead are appended to the end of archive. The resulting archive can thus contain several members of the same name, corresponding to various versions of the same file.
nl: Bestanden toe voegen indien deze nieuwer zijn dan de overeenkomstige bestanden in het archief. Argumenten hebben dezelfde betekenis als bij de B<-c> en B<-r> opties. Merk op dat nieuwere bestanden hun oude archief kopieën niet vervangen, maar in plaats daarvan toegevoegd worden aan het eind van het archief. Het resulterende archief kan dus meerdere leden met dezelfde naam bevatten, overeenkomende met de verschillende versies van hetzelfde bestand.
uk: Дописати файли, які є новішими за відповідну копію в архіві. Аргументи мають те саме призначення, що і у параметрах B<-c> і B<-r>. Зауважте, що новіші файли не замінять старі копії в архіві, а будуть дописані наприкінці архіву. Архів-результат може, таким чином, містити декілька елементів із однаковими назвами. Ці елементи будуть різними версіями того самого файла.

source: Extract files from an archive. Arguments are optional. When given, they specify names of the archive members to be extracted.
nl: Bestanden uit een archief extraheren. Argumenten zijn optioneel. Als gegeven dan specificeren ze de namen van leden die uitgepakt moeten worden.
uk: Видобути файли з архіву. Аргументи є необов'язковими. Якщо аргументи вказано, вони визначають назви елементів архіву, які слід видобути.

source: Show built-in defaults for various B<tar> options and exit. No arguments are allowed.
nl: Ingebouwde standaard waarden voor de verschillende B<tar> opties tonen en stoppen. Er zijn geen argumenten toegestaan.
uk: Вивести вбудовані типові значення для різноманітних параметрів B<tar> і вийти. Аргументи використовувати не можна.

source: Display a short option summary and exit. No arguments allowed.
nl: De verkorte opties samenvatting tonen en stoppen. Argumenten zijn niet toegestaan.
uk: Вивести резюме щодо коротких параметрів і вийти. Аргументи використовувати не можна.

source: Display a list of available options and exit. No arguments allowed.
nl: De lijst van beschikbare opties tonen en stoppen. Geen argumenten toegestaan.
uk: Вивести список доступних параметрів і вийти. Аргументи використовувати не можна.

source: Print program version and copyright information and exit.
nl: Programma versie tonen en stoppen.
uk: Вивести дані щодо версії програми і авторських прав і завершити роботу.

source: OPTIONS
nl: OPTIES
uk: ПАРАМЕТРИ
