Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: As a result, each input file with owner group I<OLDGRP> will be stored in archive with owner group I<NEWGRP> and GID I<NEWGID>.
nl: Het resultaat is dat elk invoer bestand met groep eigenaar I<OUDE_GROEP> opgeslagen wordt in het archief met groep eigenaar I<NIEUWE_GROEP> en GID I<NIEUW_GID>.
uk: У результаті кожен файл вхідних даних із групою власника I<СТАРА_ГРУПА> буде збережено в архіві із групою власника I<НОВА_ГРУПА> і GID I<НОВИЙ_GID>.

source: B<--mode>=I<CHANGES>
nl: B<--mode>=I<WIJZIGINGEN>
uk: B<--mode>=I<ЗМІНИ>

source: Force symbolic mode I<CHANGES> for added files.
nl: Toegevoegde bestanden krijgen (symbolische) I<WIJZIGINGEN> in hun modus.
uk: Встановити режим I<ЗМІНИ> для доданих файлів.

source: B<--mtime>=I<DATE-OR-FILE>
nl: B<--mtime>=I<DATUM-OF-BESTAND>
uk: B<--mtime>=I<ДАТА-АБО-ФАЙЛ>

source: Set mtime for added files. I<DATE-OR-FILE> is either a date/time in almost arbitrary format, or the name of an existing file. In the latter case the mtime of that file will be used.
nl: Stel de mtime in voor toegevoegde bestanden. I<DATE-OR-FILE> is ofwel een datum/tijd in bijna willekeurig formaat, of de naam van een bestand bestand. In het laatste geval zal de mtime van dat bestand gebruikt worden.
uk: Встановити mtime для доданих файлів. Значенням I<ДАТА-АБО-ФАЙЛ> є або датою/часом у майже довільному форматі, або назвою наявного файла. В останньому випадку буде використано mtime відповідного файла.

source: Don't extract file modified time.
nl: Bestandswijzigingstijden niet uitpakken.
uk: Не видобувати час модифікації файлів.

source: Cancel the effect of the prior B<--delay-directory-restore> option.
nl: Het effect van de optie B<--delay-directory-restore> ongedaan maken.
uk: Скасувати дію попередньо встановленого параметра B<--delay-directory-restore>.

source: Extract files as yourself (default for ordinary users).
nl: Bestanden uitpakken als uzelf (standaard voor gewone gebruikers).
uk: Стати власником витягнутих файлів (типово для звичайного користувача).

source: Apply the user's umask when extracting permissions from the archive (default for ordinary users).
nl: De umask van de gebruiker toepassen bij het uitpakken van bestandspermissies (standaard voor gewone gebruikers).
uk: Встановлювати права доступу згідно зі значенням umask (типово для звичайного користувача).

source: Always use numbers for user/group names.
nl: Altijd getallen gebruiken voor gebruikers- en groepsnamen.
uk: Завжди використовувати числа замість назв власника/групи.

source: B<--owner>=I<NAME>[:I<UID>]
nl: B<--owner>=I<NAAM>[:I<UID>]
uk: B<--owner>=I<ІМ'Я>[:I<UID>]

source: Force I<NAME> as owner for added files. If I<UID> is not supplied, I<NAME> can be either a user name or numeric UID. In this case the missing part (UID or name) will be inferred from the current host's user database.
nl: Forceer I<NAAM> als groep voor toegevoegde bestanden. Als I<UID> niet opgegeven werd, dan kan I<NAAM> ofwel een gebruikersnaam ofwel een numeriek UID zijn. In dit geval zal het ontbrekende deel (UID of naam) afgeleid worden van de groep database van het systeem.
uk: Примусово призначити I<НАЗВУ>, як вкасника для доданих файлів Якщо I<UID> не вказано, I<НАЗВА> може бути як ім'ям користувача, так і числовим значенням UID. У такому випадку, пропущену частину (UID або ім'я користувача) буде встановлено на основі бази даних поточного вузла.

source: When used with B<--owner-map>=I<FILE>, affects only those files whose owner is not listed in I<FILE>.
nl: Indien gebruikt met B<--owner-map>=I<BESTAND>, dan worden alleen die bestanden beïnvloed waarvan de eigenaar niet voorkomt in I<BESTAND>.
uk: Якщо використано із B<--owner-map>=I<ФАЙЛ>, стосується лише тих файлів, власника яких немає у списку I<ФАЙЛ>.

source: B<--owner-map>=I<FILE>
nl: B<--owner-map>=I<BESTAND>
uk: B<--owner-map>=I<ФАЙЛ>

source: Read owner translation map from I<FILE>. Empty lines are ignored. Comments are introduced with B<#> sign and extend to the end of line. Each non-empty line in I<FILE> defines translation for a single UID. It must consist of two fields, delimited by any amount of whitespace:
nl: Lees de eigenaar vertaal tabel uit I<BESTAND>. Lege regels worden genegeerd. Commentaar begint met het B<#> teken en eindigt bij het einde van de regel. Elke niet lege regel in I<BESTAND> bepaald de vertaling van een enkele UID. Die regel moet bestaan uit twee velden, gescheiden door elk aantal van witruimtes.
uk: Прочитати карту переходу власників з I<ФАЙЛ>а Порожні рядки буде проігноровано. Коментарі додають за допомогою символу B<#>. Усе після цього символу і до кінця рядка вважають коментарем. Будь-який непорожній рядок у I<ФАЙЛ>і визначають перехід для одного UID. Він має містити два поля, відокремлені будь-якою кількістю пробілів:

source: I<OLDUSR> I<NEWUSR>[B<:>I<NEWUID>]
nl: I<OUDE_EIGENAAR> I<NIEUWE_EIGENAAR>[B<:>I<NIEUW_UID>]
uk: I<СТАРИЙ_КОРИСТУВАЧ> I<НОВИЙ_КОРИСТУВАЧ>[B<:>I<НОВИЙ_UID>]

source: I<OLDUSR> is either a valid user name or a UID prefixed with B<+>. Unless I<NEWUID> is supplied, I<NEWUSR> must also be either a valid user name or a B<+>I<UID>. Otherwise, both I<NEWUSR> and I<NEWUID> need not be listed in the system user database.
nl: I<OUDE_EIGENAAR> is ofwel een geldige gebruiker ofwel een UID voorafgegaan met B<+>. Behalve als I<NIEUW_UID> werd gegeven, moet I<NIEUWE_EIGENAARP> ofwel een geldige gebruiker ofwel een B<+>I<UID> zijn. Anders hoeven zowel I<NIEUWE_EIGENAARP> als I<NIEUW_UID> niet vermeld te worden in de gebruiker database van het systeem.
uk: I<СТАРИЙ_КОРИСТУВАЧ> — або коректне ім'я користувача, або UID із префіксом B<+>. Якщо не вказано I<НОВИЙ_UID>, I<НОВИЙ_КОРИСТУВАЧ> має також бути або коректним іменем користувача, або B<+>I<UID>. В усіх інших випадках, I<НОВИЙ_КОРИСТУВАЧ> і I<НОВИЙ_UID> не повинні бути частиною бази даних користувачів системи.

source: As a result, each input file owned by I<OLDUSR> will be stored in archive with owner name I<NEWUSR> and UID I<NEWUID>.
nl: Het resultaat is dat elk invoer bestand van gebruiker I<OUDE_EIGENAAR> opgeslagen wordt in het archief onder gebruiker I<NIEUWE_EIGENAAR> en UID I<NIEUW_UID>.
uk: У результаті кожен вхідний файл, власником якого є I<СТАРИЙ_КОРИСТУВАЧ>, буде збережено в архіві із новим власником I<НОВИЙ_КОРИСТУВАЧ> та UID I<НОВИЙ_UID>.

source: extract information about file permissions (default for superuser)
nl: bestandspermissies ook uitpakken (standaard voor root)
uk: встановлювати права доступу згідно з даними архіву (типово для супер-користувача)

source: Try extracting files with the same ownership as exists in the archive (default for superuser).
nl: Bestanden proberen uit te pakken met dezelfde eigenaar als in het archief (standaard voor root).
uk: Встановлювати власників файлів за даними з архіву (типово для супер-користувача).

source: Sort names to extract to match archive
nl: Uit te pakken namen sorteren zodanig dat ze overeenkomen met de volgorde in het archief.
uk: Упорядкувати назви для видобування за порядком в архіві

source: B<--sort=>I<ORDER>
nl: B<--sort=>I<VOLGORDE>
uk: B<--sort=>I<ПОРЯДОК>

source: When creating an archive, sort directory entries according to I<ORDER>, which is one of B<none>, B<name>, or B<inode>.
nl: Bij het aanmaken van een archief, sorteer inschrijvingen in de map volgens I<VOLGORDE>, dat een van B<none>, B<name>, of B<inode> is.
uk: При створення архіву упорядкувати записи каталогу за вказаним I<ПОРЯДКОМ>, можливі значення: B<none>, B<name> або B<inode>.

source: The default is B<--sort=none>, which stores archive members in the same order as returned by the operating system.
nl: De standaard is B<--sort=none>, dat slaat archief leden in dezelfde volgorde op zoals terug gegeven door het besturingssysteem.
uk: Типовим варіантом є B<--sort=none>, тобто «зберігати елементи архіву у тому самому порядку, у якому їх повернуто операційною системою».

source: Using B<--sort=name> ensures the member ordering in the created archive is uniform and reproducible.
nl: Gebruik van B<--sort=name> zorgt ervoor dat de volgorde van leden in het gemaakte archief uniform en reproduceerbaar is.
uk: Використання B<--sort=name> призведе до упорядковування елементів у створеному архіві у стандартний та відтворюваний спосіб.

source: Using B<--sort=inode> reduces the number of disk seeks made when creating the archive and thus can considerably speed up archivation. This sorting order is supported only if the underlying system provides the necessary information.
nl: Gebruik van B<--sort=inode> verminderd het aantal zoek operaties op de schijf die worden gemaakt bij het aanmaken van het archief en kan daarom het archiveren aanzienlijk versnellen. Deze sorteer volgorde wordt alleen ondersteund indien het onderliggende systeem de noodzakelijk informatie aanlevert.
uk: Використання варіанта B<--sort=inode> зменшить кількість позиціювань на диску, які слід буде виконати під час створення архіву, а отже, значно пришвидшити архівування. Підтримку цього упорядковування передбачено, лише якщо у базовій системі передбачено надання відповідних даних.

source: Extended file attributes
nl: Uitgebreide bestandskenmerken
uk: Розширені атрибути файлів

source: Enable POSIX ACLs support.
nl: Ondersteuning voor POSIX ACL's inschakelen.
uk: Увімкнути підтримку ACL POSIX.

source: Disable POSIX ACLs support.
nl: Ondersteuning voor POSIX ACL's uitschakelen.
uk: Вимкнути підтримку ACL POSIX.

source: Enable SELinux context support.
nl: Ondersteuning voor SELinux-contexten inschakelen.
uk: Увімкнути підтримку контекстів SELinux.

source: Disable SELinux context support.
nl: Ondersteuning voor SELinux-contexten uitschakelen.
uk: Вимкнути підтримку контекстів SELinux.

source: Enable extended attributes support.
nl: Ondersteuning voor uitgebreide kenmerken inschakelen.
uk: Увімкнути підтримку розширених атрибутів.

source: Disable extended attributes support.
nl: Ondersteuning voor uitgebreide kenmerken uitschakelen.
uk: Вимкнути підтримку розширених атрибутів.

source: B<--xattrs-exclude=>I<PATTERN>
nl: B<--xattrs-exclude=>I<PATROON>
uk: B<--xattrs-exclude=>I<ВЗІРЕЦЬ>

source: Specify the exclude pattern for xattr keys. I<PATTERN> is a POSIX regular expression, e.g. B<--xattrs-exclude='^user.'>, to exclude attributes from the user namespace.
nl: Specificeert het uitsluit patroon van xattr sleutels. I<PATROON> is een POSIX reguliere expressie, b.v. B<--xattrs-exclude='^user.'> om attributen uit de gebruikersnaam ruimte uit te sluiten.
uk: Вказати взірець виключення для ключів xattr. I<ВЗІРЕЦЬ> є формальним виразом POSIX, наприклад, B<--xattrs-exclude='^user.'>, щоб виключити атрибути з простору назв користувача.

source: B<--xattrs-include=>I<PATTERN>
nl: B<--xattrs-include=>I<PATROON>
uk: B<--xattrs-include=>I<ВЗІРЕЦЬ>

source: Specify the include pattern for xattr keys. I<PATTERN> is a POSIX regular expression.
nl: Patroon van in te sluiten xattr-sleutels. I<PATROON> is een reguliere POSIX expressie.
uk: Вказати взірець включення для ключів xattr. I<ВЗІРЕЦЬ> є формальним виразом POSIX.

source: Device selection and switching
nl: Apparaat selectie en -wisseling
uk: Вибір та зміна пристрою

source: B<-f>, B<--file>=I<ARCHIVE>
nl: B<-f>, B<--file>=I<ARCHIEF>
uk: B<-f>, B<--file>=I<АРХІВ>

source: Use archive file or device I<ARCHIVE>. If this option is not given, B<tar> will first examine the environment variable `TAPE'. If it is set, its value will be used as the archive name. Otherwise, B<tar> will assume the compiled-in default. The default value can be inspected either using the B<--show-defaults> option, or at the end of the B<tar --help> output.
nl: Gebruik het archief bestand of apparaat I<ARCHIEF>. Als deze optie niet opgegeven werd, dan zal B<tar> eerst de omgevingsvariable 'TAPE' bekijken. Als deze gezet is, dan zal zijn waarde gebruikt worden als archief naam. Anders zal B<tar> de ingebouwde standaard gebruiken. De standaard waarde kan bekeken worden door gebruik van de B<--show-defaults> optie, of aan het einde van de B<tar --help> uitvoer.
uk: Скористатися файлом архіву або пристроєм I<АРХІВ>. Якщо вказано цей параметр, B<tar> спочатку проаналізує змінну середовища «TAPE». Якщо для нього встановлено значення, це значення буде використано як назву архіву. В усіх інших випадках, B<tar> припускатиме визначені під час збирання програми типові значення. Ознайомитися із типовим значенням можна за допомогою параметра B<--show-defaults> або наприкінці виведених B<tar --help> даних.

source: An archive name that has a colon in it specifies a file or device on a remote machine. The part before the colon is taken as the machine name or IP address, and the part after it as the file or device pathname, e.g.:
nl: Een archief naam met een dubbele punt erin, specificeert een bestand of een apparaat op een andere computer. Het deel vóór de dubbele punt wordt geïnterpreteerd als computernaam of IP adres, en het deel achter de dubbele punt als bestand of apparaat padnaam, b.v.:
uk: Назва архіву, яка містить двокрапку, визначає файл або пристрій на віддаленій машині. Частину до двокрапки буде оброблено як назву машини або IP-адресу, а частина після двокрапки — як назву файла або пристрою. Приклад:

source: An optional username can be prefixed to the hostname, placing a B<@> sign between them.
nl: Een optionele gebruikersnaam mag voorafgegaan worden door een hostnaam, door er een B<@> tussen te plaatsen.
uk: Перед назвою вузла можна вказати ім'я користувача, розташувавши між ними символ B<@>.

source: By default, the remote host is accessed via the B<rsh>(1) command. Nowadays it is common to use B<ssh>(1) instead. You can do so by giving the following command line option:
nl: Standaard kan de andere computer benaderd worden met het B<rsh>(1) commando. Tegenwoordig is het gewoond om in plaats daarvan B<ssh>(1) te gebruiken. U kunt dit ook doen met de volgende optie op de commando regel:
uk: Типово, доступ до віддаленого вузла здійснюватиметься за допомогою програми B<rsh>(1). У сучасних умовах поширенішим є використання B<ssh>(1). Скористатися новим варіантом можна за допомогою такого параметра командного рядка:

source: The remote machine should have the B<rmt>(8) command installed. If its pathname does not match B<tar>'s default, you can inform B<tar> about the correct pathname using the B<--rmt-command> option.
nl: Op de andere computer moet het commando B<rmt>(8) geïnstalleerd zijn. Als daarvan de padnaam niet overeenkomt met de standaard van B<tar>, dan kunt u de juiste padnaam aan B<tar> laten weten door gebruik van de B<--rmt-command> optie.
uk: У віддаленій системі має бути встановлено програму B<rmt>(8). Якщо шлях до програми не збігається із типовим для B<tar>, ви можете повідомити B<tar> про належний шлях за допомогою параметра B<--rmt-command>.

source: Archive file is local even if it has a colon.
nl: Archiefbestand is lokaal, zelfs als het een dubbele punt bevat.
uk: Файл архіву є локальним, навіть якщо його назва містить двокрапку.

source: B<-F>, B<--info-script>=I<COMMAND>, B<--new-volume-script>=I<COMMAND>
nl: B<-F>, B<--info-script>=I<OPDRACHT>, B<--new-volume-script>=I<OPDRACHT>
uk: B<-F>, B<--info-script>=I<КОМАНДА>, B<--new-volume-script>=I<КОМАНДА>

source: Run I<COMMAND> at the end of each tape (implies B<-M>). The command can include arguments. When started, it will inherit B<tar>'s environment plus the following variables:
nl: Voer I<COMMANDO> uit aan het eind van elke band (impliceert B<-M>. Het commando mag argumenten bevatten. Bij de start zal het de omgeving van B<tar> erven en daarenboven de volgende variabelen:
uk: Запускати I<КОМАНДУ> наприкінці кожної стрічки (неявним чином встановлює B<-M>). До команди можна включати аргументи. Після запуску вона успадкує середовище B<tar> і такі змінні:

source: File descriptor which can be used to communicate the new volume name to B<tar>.
nl: Bestands beschrijving die gebruikt kan worden om de nieuwe volume naam aan B<tar> te laten weten.
uk: Дескриптор файла, яким можна скористатися для передавання назви нового тому B<tar>.

source: If the info script fails, B<tar> exits; otherwise, it begins writing the next volume.
nl: Als het info script faalt dan stopt B<tar>; anders begint het het volgende volume te schrijven.
uk: Якщо виконання скрипту не дасть результатів, B<tar> завершить роботу; в інших випадках, програма почне записувати наступний том.

source: Change tape after writing I<N>x1024 bytes. If I<N> is followed by a size suffix (see the subsection B<Size suffixes> below), the suffix specifies the multiplicative factor to be used instead of 1024.
nl: Verander band na het schrijven van I<N>x1024 bytes. Indien I<N> gevolgd werd door een grootte achtervoegsel (zie subsectie B<Size suffixes> hieronder), dan bepaald het achtervoegsel de vermenigvuldigingsfactor in plaats van 1024.
uk: Змінити стрічку після запису I<N>x1024 байтів. Якщо після I<N> вказано суфікс назви (див. підрозділ B<Суфікси розмірів> нижче), суфікс визначатиме коефіцієнт множення, який буде використано замість 1024.

source: This option implies B<-M>.
nl: Deze optie impliceert B<-M>.
uk: Цей параметр автоматично встановлює параметр B<-M>.

source: Create/list/extract multi-volume archive.
nl: Meerdelig archief aanmaken/opsommen/uitpakken.
uk: Створення, виведення вмісту та видобування файлів з багатотомного архіву.

source: B<--rmt-command>=I<COMMAND>
nl: B<--rmt-command>=I<OPDRACHT>
uk: B<--rmt-command>=I<КОМАНДА>

source: Use I<COMMAND> instead of B<rmt> when accessing remote archives. See the description of the B<-f> option, above.
nl: Gebruik I<COMMANDO> in plaats van B<rmt> bij het benaderen van archieven op andere computers. Zie de beschrijving van de B<-f> optie, hierboven.
uk: Скористатися I<КОМАНДОЮ> замість B<rmt> при доступ до віддалених систем. Див. опис параметра B<-f> вище.

source: B<--rsh-command>=I<COMMAND>
nl: B<--rsh-command>=I<OPDRACHT>
uk: B<--rsh-command>=I<КОМАНДА>

source: Use I<COMMAND> instead of B<rsh> when accessing remote archives. See the description of the B<-f> option, above.
nl: Gebruik I<COMMANDO> in plaats van B<rsh> bij het benaderen van archieven op andere computers. Zie de beschrijving van de B<-f> optie, hierboven.
uk: Скористатися I<КОМАНДОЮ> замість B<rsh> при доступ до віддалених систем. Див. опис параметра B<-f> вище.

source: B<--volno-file>=I<FILE>
nl: B<--volno-file>=I<BESTAND>
uk: B<--volno-file>=I<ФАЙЛ>

source: When this option is used in conjunction with B<--multi-volume>, B<tar> will keep track of which volume of a multi-volume archive it is working in I<FILE>.
nl: Indien deze optie gebruikt wordt samen met B<--multi-volume>, dan zal B<tar> bijhouden welk volume van een multi-volume archief het bewerkt in I<BESTAND>.
uk: Якщо цей параметр використано у поєднанні із B<--multi-volume>, B<tar> стежитиме за тим, з яким томом багатотомного архіву програма працює у I<ФАЙЛ>і.

source: Device blocking
nl: Blokverwerking
uk: Поділ пристрою на блоки

source: B<-b>, B<--blocking-factor>=I<BLOCKS>
nl: B<-b>, B<--blocking-factor>=I<BLOKKEN>
uk: B<-b>, B<--blocking-factor>=I<БЛОКИ>

source: Set record size to I<BLOCKS>xB<512> bytes.
nl: Stel de grootte van een record in op I<BLOKKEN>xB<512> bytes.
uk: Встановити розмір запису у I<БЛОКИ>xB<512> байтів.

source: When listing or extracting, accept incomplete input records after end-of-file marker.
nl: Accepteer niet-complete invoer records na de einde-bestand markering bij tonen of uitpakkken
uk: При виведенні списку або видобуванні приймати неповні вхідні запис після позначки кінця файла.

source: Ignore zeroed blocks in archive. Normally two consecutive 512-blocks filled with zeroes mean EOF and tar stops reading after encountering them. This option instructs it to read further and is useful when reading archives created with the B<-A> option.
nl: Negeer blokken met nullen in het archief. Normaliter betekenen twee opeenvolgende 512-blokken gevuld met nullen EOF en tar stopt dan met lezen na deze tegen gekomen te zijn. Deze optie instrueert het om door te lezen en is nuttig bij het lezen van archieven die met de B<-A> optie zijn aangemaakt.
uk: Ігнорувати занулені блоки в архіві. Зазвичай, два послідовних 512-байтових блоки, які заповнено нулями, означають кінець файла, і tar припиняє читання, коли отримає такі дані. Якщо використано цей параметр, програма продовжуватиме читання даних. Параметр корисний при читанні архівів, які створено за допомогою параметра B<-A>.

source: B<--record-size>=I<NUMBER>
nl: B<--record-size>=I<AANTAL>
uk: B<--record-size>=I<ЧИСЛО>

source: Set record size. I<NUMBER> is the number of bytes per record. It must be multiple of B<512>. It can can be suffixed with a B<size suffix>, e.g. B<--record-size=10K>, for 10 Kilobytes. See the subsection B<Size suffixes>, for a list of valid suffixes.
nl: Set de record grootte in. I<AANTAL> is het aantal bytes per record. Het moet een meervoud zijn van B<512>. Het mag gevolgd worden door een B<grootte achtervoegsel>, e.g. B<--record-size=10K>, voor 10 Kilobytes. Zie de subsectie B<grootte achtervoegsel>, voor een lijst met geldige achtervoegsels.
uk: Встановити розмір запису. I<ЧИСЛО> є кількістю байтів на запис. Має бути кратним до B<512>. Можна використовувати із B<суфіксом розміру>. Приклад: B<--record-size=10K> — 10 кілобайтів. Див. підрозділ B<Суфікси розмірів>, щоб ознайомитися зі списком коректних суфіксів.

source: Archive format selection
nl: Archiefindelingskeuze
uk: Вибір формату архіву

source: B<-H>, B<--format>=I<FORMAT>
nl: B<-H>, B<--format>=I<FORMAAT>
uk: B<-H>, B<--format>=I<ФОРМАТ>

source: Create archive of the given format. Valid formats are:
nl: een archief maken in het gekozen formaat. Geldige formaten zijn:
uk: Створити архів у вказаному форматі. Коректні формати:

source: GNU tar 1.13.x format
nl: GNU-indeling van tar 1.13.x
uk: формат GNU, сумісний з версією tar 1.13.x

source: GNU format as per tar E<lt>= 1.12.
nl: GNU-indeling van tar E<lt>= 1.12.
uk: Формат GNU tar E<lt>= 1.12.

source: POSIX 1003.1-2001 (pax) format.
nl: POSIX 1003.1-2001 (pax-indeling).
uk: формат POSIX 1003.1-2001 (pax).

source: POSIX 1003.1-1988 (ustar) format.
nl: POSIX 1003.1-1988 (ustar-indeling).
uk: формат POSIX 1003.1-1988 (ustar).

source: Old V7 tar format.
nl: Oude V7 tar-indeling.
uk: Старий формат V7.

source: Same as B<--format=v7>.
nl: Hetzelfde als B<--format=v7>.
uk: Те саме, що і B<--format=v7>.

source: B<--pax-option>=I<keyword>[[:]=I<value>][,I<keyword>[[:]=I<value>]]...
nl: B<--pax-option>=I<sleutelwoord>[[:]=I<waarde>][,I<sleutelwoord>[[:]=I<waarde>]]...
uk: B<--pax-option>=I<ключове_слово>[[:]=I<значення>][,I<ключове_слово>[[:]=I<значення>]]...

source: Control pax keywords when creating B<PAX> archives (B<-H pax>). This option is equivalent to the B<-o> option of the B<pax>(1) utility.
nl: Bepaal pax sleutelwoorden bij aanmaken van B<PAX> archieven (B<-H pax>). Deze optie is equivalent´ aan de B<-o> van het B<pax>(1) hulpprogramma.
uk: Керує ключовими словами pax при створенні архівів B<PAX> (B<-H pax>). Цей параметр є еквівалентним до параметра B<-o> допоміжної програми B<pax>(1).

source: Same as B<--format=posix>.
nl: Hetzelfde als B<--format=posix>.
uk: Те саме, що і B<--format=posix>.

source: B<-V>, B<--label>=I<TEXT>
nl: B<-V>, B<--label>=I<TEKST>
uk: B<-V>, B<--label>=I<ТЕКСТ>

source: Create archive with volume name I<TEXT>. If listing or extracting, use I<TEXT> as a globbing pattern for volume name.
nl: Een archief met de volume naam I<TEKST> maken; bij opsommen/uitpakken I<TEKST> als zoekpatroon voor de volume naam gebruiken.
uk: Створити архів з назвою тому I<ТЕКСТ>. Під час виведення вмісту або видобування, використовувати I<ТЕКСТ> як шаблон пошуку тому.

source: Compression options
nl: Compressie-opties
uk: Параметри стиснення

source: Use archive suffix to determine the compression program.
nl: Compressieprogramma afleiden uit het archief achtervoegsel.
uk: Вибирати програму стиснення за суфіксом архіву.
