Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: B<-I>, B<--use-compress-program>I<=COMMAND>
nl: B<-I>, B<--use-compress-program>I<=OPDRACHT>
uk: B<-I>, B<--use-compress-program>I<=КОМАНДА>

source: Filter data through I<COMMAND>. It must accept the B<-d> option, for decompression. The argument can contain command line options.
nl: Filter data met behulp van I<COMMANDO>. Dit moet de B<-d> optie om te decomprimeren accepteren. Het argument mag commando regel opties bevatten.
uk: Фільтрувати дані через I<КОМАНДУ>. Команда має приймати параметр B<-d> для розтискання. Аргумент може містити параметри командного рядка.

source: Filter the archive through B<bzip2>(1).
nl: Het archief door B<bzip2>(1) filteren.
uk: Фільтрувати архів через B<bzip2>(1).

source: Filter the archive through B<xz>(1).
nl: Het archief door B<xz>(1) filteren.
uk: Фільтрувати архів через B<xz>(1).

source: Filter the archive through B<lzip>(1).
nl: Het archief door B<lzip>(1) filteren.
uk: Фільтрувати архів через B<lzip>(1).

source: Filter the archive through B<lzma>(1).
nl: Het archief door B<lzma>(1) filteren.
uk: Фільтрувати архів через B<lzma>(1).

source: Filter the archive through B<lzop>(1).
nl: Het archief door B<lzop>(1) filteren.
uk: Фільтрувати архів через B<lzop>(1).

source: Do not use archive suffix to determine the compression program.
nl: Compressieprogramma niet afleiden uit archief achtervoegsel.
uk: Не використовувати суфікс для вибору програми стиснення.

source: Filter the archive through B<gzip>(1).
nl: Het archief door B<gzip>(1) filteren.
uk: Фільтрувати архів через B<gzip>(1).

source: Filter the archive through B<compress>(1).
nl: Het archief door B<compress>(1) filteren.
uk: Фільтрувати архів через B<compress>(1).

source: Filter the archive through B<zstd>(1).
nl: Het archief door B<zstd>(1) filteren.
uk: Фільтрувати архів через B<zstd>(1).

source: Local file selection
nl: Lokale bestandskeuze
uk: Вибір локальних файлів

source: B<--add-file>=I<FILE>
nl: B<--add-file>=I<BESTAND>
uk: B<--add-file>=I<ФАЙЛ>

source: Add I<FILE> to the archive (useful if its name starts with a dash).
nl: Het gegeven I<BESTAND> aan het archief toevoegen (handig als de naam begint met een '-').
uk: Долучити I<ФАЙЛ> до архіву (корисне, якщо його назва починається з -)

source: B<--backup>[=I<CONTROL>]
nl: B<--backup>[=I<MANIER>]
uk: B<--backup>[=I<КЕРУВАННЯ>]

source: Backup before removal. The I<CONTROL> argument, if supplied, controls the backup policy. Its valid values are:
nl: Reservekopie maken voor verwijderen. Het I<MANIER> argument, indien gegeven, bepaalt het reservekopie beleid. Geldige waarden zijn:
uk: Створити резервну копію перед вилученням. Аргумент I<КЕРУВАННЯ>, якщо його вказано, керує правилами створення резервних копій. Коректними значеннями є такі:

source: Never make backups.
nl: Nooit reservekopieën maken.
uk: Ніколи не робити резервних копій.

source: Make numbered backups.
nl: Genummerde reservekopieën maken.
uk: Робити нумеровані резервні копії.

source: Make numbered backups if numbered backups exist, simple backups otherwise.
nl: Genummerde reservekopieën maken als ze al bestaan, anders eenvoudige reservekopieën.
uk: Створювати нумеровані резервні копії, якщо існують нумеровані резервні копії, і прості копії в усіх інших випадках.

source: Always make simple backups
nl: Altijd eenvoudige reservekopieën maken
uk: Завжди робити прості резервні копії

source: If I<CONTROL> is not given, the value is taken from the B<VERSION_CONTROL> environment variable. If it is not set, B<existing> is assumed.
nl: Als I<MANIER> niet werd opgegeven, dan zal de waarde van de B<VERSION_CONTROL> omgevingsvariable genomen worden. Als hij niet is gezet dan wordt B<existing> aangenomen.
uk: Якщо не вказано I<КЕРУВАННЯ>, значення буде взято зі змінної середовища B<VERSION_CONTROL>. Якщо значення змінної не встановлено, буде використано B<existing>.

source: B<-C>, B<--directory>=I<DIR>
nl: B<-C>, B<--directory>=I<MAP>
uk: B<-C>, B<--directory>=I<КАТАЛОГ>

source: Change to I<DIR> before performing any operations. This option is order-sensitive, i.e. it affects all options that follow.
nl: Verander naar I<MAP> voor het uitvoeren van elke bewerking. Deze optie is volgorde afhankelijk, m.a.w. hij beïnvloed alle volgende opties.
uk: Змінити каталог на I<КАТАЛОГ> до виконання будь-яких дій. Робота цього параметра залежить від того, де його вказано, тобто він впливає на усі параметри, які за ним вказано.

source: B<--exclude>=I<PATTERN>
nl: B<--exclude>=I<PATROON>
uk: B<--exclude>=I<ВЗІРЕЦЬ>

source: Exclude files matching I<PATTERN>, a B<glob>(3)-style wildcard pattern.
nl: Sluit bestanden die passen op I<PATROON> uit, een B<glob>(3)-stijl jokerteken patroon.
uk: Виключити файли, які відповідають I<ВЗІРЦЮ>, взірцю у стилі шаблонів B<glob>(3).

source: Exclude backup and lock files.
nl: Reservekopieën en vergrendelingsbestanden uitsluiten.
uk: Не архівувати резерві файли та файли блокування.

source: Exclude contents of directories containing file B<CACHEDIR.TAG>, except for the tag file itself.
nl: Inhoud van mappen die B<CACHEDIR.TAG> bevatten uitsluiten, behalve B<CACHEDIR.TAG> zelf.
uk: Не архівувати файли в каталогах, що містять B<CACHEDIR.TAG>, за винятком самого файла

source: Exclude directories containing file B<CACHEDIR.TAG> and the file itself.
nl: Mappen die B<CACHEDIR.TAG> bevatten uitsluiten, behalve B<CACHEDIR.TAG> zelf.
uk: Виключити каталоги, які містять файл B<CACHEDIR.TAG>, і сам файл.

source: Exclude everything under directories containing B<CACHEDIR.TAG>
nl: Alles onder mappen die B<CACHEDIR.TAG> bevatten uitsluiten.
uk: Не архівувати жодні файли в каталогах, що містять I<CACHEDIR.TAG>

source: B<--exclude-ignore=>I<FILE>
nl: B<--exclude-ignore=>I<BESTAND>
uk: B<--exclude-ignore=>I<ФАЙЛ>

source: Before dumping a directory, see if it contains I<FILE>. If so, read exclusion patterns from this file. The patterns affect only the directory itself.
nl: Voor dumpen van een map, kijk of hij I<BESTAND> bevat. Als dit zo is, lees dan de uitsluit patronen van die bestand. De patronen beïnvloeden alleen de map zelf.
uk: Перш ніж створювати дамп каталогу, виконати пошук у ньому I<ФАЙЛ>а. Якщо файл буде виявлено, прочитати взірці виключення з цього файла. Взірці стосуються лише самого каталогу.

source: B<--exclude-ignore-recursive=>I<FILE>
nl: B<--exclude-ignore-recursive=>I<BESTAND>
uk: B<--exclude-ignore-recursive=>I<ФАЙЛ>

source: Same as B<--exclude-ignore>, except that patterns from I<FILE> affect both the directory and all its subdirectories.
nl: Gelijk aan B<--exclude-ignore>, behalve dat patronen uit I<BESTAND> zowel de map als zijn submappen beïnvloeden.
uk: Те саме, що і B<--exclude-ignore>, окрім того, що взірці з I<ФАЙЛ>а стосуються каталогу і усі його підкаталоги.

source: B<--exclude-tag>=I<FILE>
nl: B<--exclude-tag>=I<BESTAND>
uk: B<--exclude-tag>=I<ФАЙЛ>

source: Exclude contents of directories containing I<FILE>, except for I<FILE> itself.
nl: Inhoud van mappen die I<BESTAND> bevatten uitsluiten, behalve I<BESTAND> zelf.
uk: Не архівувати файли в каталогах, що містять I<ФАЙЛ>, за винятком самого I<ФАЙЛ>а

source: B<--exclude-tag-all>=I<FILE>
nl: B<--exclude-tag-all>=I<BESTAND>
uk: B<--exclude-tag-all>=I<ФАЙЛ>

source: Exclude directories containing I<FILE>.
nl: Mappen die I<BESTAND> bevatten uitsluiten.
uk: Не архівувати каталоги, що містять I<ФАЙЛ>.

source: B<--exclude-tag-under>=I<FILE>
nl: B<--exclude-tag-under>=I<BESTAND>
uk: B<--exclude-tag-under>=I<ФАЙЛ>

source: Exclude everything under directories containing I<FILE>.
nl: Alles onder de mappen die I<BESTAND> bevatten uitsluiten.
uk: Не архівувати жодні файли в каталогах, що містять I<ФАЙЛ>.

source: Exclude version control system directories.
nl: Systeemmappen van versiebeheer uitsluiten.
uk: Не архівувати каталоги систем керування версіями.

source: Exclude files that match patterns read from VCS-specific ignore files. Supported files are: B<.cvsignore>, B<.gitignore>, B<.bzrignore>, and B<.hgignore>.
nl: Sluit bestanden uit die passen op patronen gelezen uit VCS-specifieke negeer bestanden. Ondersteunde bestanden zijn: B<.cvsignore>, B<.gitignore>, B<.bzrignore>, en B<.hgignore>.
uk: Виключити файли, які відповідають взірцю, прочитаного зі специфічних файлів ігнорування систем керування версіями. Підтримуваними файлами є такі: B<.cvsignore>, B<.gitignore>, B<.bzrignore> і B<.hgignore>.

source: Follow symlinks; archive and dump the files they point to.
nl: Symbolische koppelingen volgen; de bestanden waar ze naar verwijzen archiveren.
uk: Переходити за символьними посиланнями; архівувати і створити дампи файли, на які вони вказують.

source: Follow hard links; archive and dump the files they refer to.
nl: Harde koppelingen volgen; de bestanden waar ze naar verwijzen archiveren.
uk: Переходити за жорсткими посиланнями; архівувати і створювати дами для файлів, на які вони вказують

source: B<-K>, B<--starting-file>=I<MEMBER>
nl: B<-K>, B<--starting-file>=I<LID>
uk: B<-K>, B<--starting-file>=I<ЕЛЕМЕНТ>

source: Begin at the given member in the archive.
nl: Begin bij dit LID van het archief
uk: Почати з заданого елемента архіву.

source: B<--newer-mtime>=I<DATE>
nl: B<--newer-mtime>=I<DATUM>
uk: B<--newer-mtime>=I<ДАТА>

source: Work on files whose data changed after the I<DATE>. If I<DATE> starts with B</> or B<.> it is taken to be a file name; the mtime of that file is used as the date.
nl: Bewerk bestanden waarvan de data is veranderd na I<DATUM>. Als I<DATUM> begint met B</> of B<.> dan wordt deze aangezien voor een bestandsnaam; de mtime van dat bestand wordt dan gebruikt als de datum.
uk: Працювати з файлами, чиї дані було змінено після настання I<ДАТИ>. Якщо запис I<ДАТА> починається з B</> або B<.>, запис вважатиметься назвою файла; mtime цього файла буде використано як дату.

source: Disable the effect of the previous B<--null> option.
nl: Het resultaat van de vorige B<--null>-optie ongedaan maken.
uk: Вимкнути дію попереднього параметра B<--null>.

source: Avoid descending automatically in directories.
nl: Niet automatisch afdalen in mappen.
uk: Не заходити автоматично у каталоги.

source: Do not unquote input file or member names.
nl: Geen aanhalingstekens verwijderen rond namen van invoerbestand of van leden.
uk: Не усувати лапки з назв вхідних файлів або файлів в архіві.

source: Treat each line read from a file list as if it were supplied in the command line. I.e., leading and trailing whitespace is removed and, if the resulting string begins with a dash, it is treated as B<tar> command line option.
nl: Behandel elke regel gelezen uit een lijst in een bestand alsof deze werd gegeven op de commando regel. M.a.w. voorafgaande of nakomende witruimtes worden verwijderd en, als de resulterende tekenreeks begint met een streepje dan wordt deze behandeld als een B<tar> commando regel optie.
uk: Обробляти усі рядки, які прочитано зі списку файлів так, наче їх вказано у рядку команди. Таким чином, початкові і кінцеві пробіли буде вилучено і, якщо рядок-результат починається з дефіса, його буде оброблено як параметр командного рядка B<tar>.

source: This is the default behavior. The B<--no-verbatim-files-from> option is provided as a way to restore it after B<--verbatim-files-from> option.
nl: Dit is standaard gedrag. De B<--no-verbatim-files-from> optie is voorzien als een manier om het terug te zetten na de B<--verbatim-files-from> optie.
uk: Це типова поведінка. Параметр B<--no-verbatim-files-from> є способом відновити типову поведінку після використання параметра B<--verbatim-files-from>.

source: This option is positional: it affects all B<--files-from> options that occur after it in, until B<--verbatim-files-from> option or end of line, whichever occurs first.
nl: Die optie is optioneel: het beïnvloed alle B<--files-from> opties die erna komen, tot aan de B<--verbatim-files-from> optie of aan einde van de regel, welke het eerst voorkomt.
uk: Цей параметр є позиційним: він працює з усіма параметрами B<--files-from>, які вказано у рядку команди після цього параметра, аж до параметра B<--verbatim-files-from> або кінця рядка, що б не трапилося першим.

source: It is implied by the B<--no-null> option.
nl: Dit werd geïmpliceerd door de B<--no-null> optie.
uk: Неявним чином встановлюється при використанні параметра B<--no-null>.

source: Instruct subsequent B<-T> options to read null-terminated names verbatim (disables special handling of names that start with a dash).
nl: Instrueert volgende B<-T> opties om met nul afgesloten namen letterlijk te lezen (schakelt speciale afhandeling van namen die beginnen met een streepje uit).
uk: Наказати при обробці наступних параметрів B<-T> читати завершені нуль-символом назви буквально (вимкнути особливу обробку назв, які починаються з дефіса).

source: See also B<--verbatim-files-from>.
nl: Zie ook B<--verbatim-files-from>.
uk: Див. також B<--verbatim-files-from>.

source: B<-N>, B<--newer>=I<DATE>, B<--after-date>=I<DATE>
nl: B<-N>, B<--newer>=I<DATUM>, B<--after-date>=I<DATUM>
uk: B<-N>, B<--newer>=I<ДАТА>, B<--after-date>=I<ДАТА>

source: Only store files newer than DATE. If I<DATE> starts with B</> or B<.> it is taken to be a file name; the mtime of that file is used as the date.
nl: Sla alleen bestanden op die nieuwer zijn dan DATUM. Als I<DATUM> begint met een B</> of B<.> dan wordt deze aangezien voor een bestandsnaam; de mtime van dat bestand wordt dan gebruikt als de datum.
uk: Зберігати, лише якщо є новішими за I<ДАТУ>. Якщо запис I<ДАТА> починається з B</> або B<.>, запис вважатиметься назвою файла; mtime цього файла буде використано як дату.

source: Stay in local file system when creating archive.
nl: In het lokale bestandssysteem blijven bij maken van archief.
uk: Залишатися у локальної файлової системі під час створення архіву.

source: Don't strip leading slashes from file names when creating archives.
nl: Voorafgaande '/' niet uit bestandsnamen verwijderen bij aanmaken van archieven.
uk: Не вилучати початкові символи похилої риски з назв файлів при створенні архівів.

source: Recurse into directories (default).
nl: Recursief in mappen afdalen (standaard).
uk: Рекурсивно проходити каталоги (типово).

source: B<--suffix>=I<STRING>
nl: B<--suffix>=I<TEKENREEKS>
uk: B<--suffix>=I<РЯДОК>

source: Backup before removal, override usual suffix. Default suffix is B<~>, unless overridden by environment variable B<SIMPLE_BACKUP_SUFFIX>.
nl: Voor verwijderen een reservekopie maken. Met B<~> als achtervoegsel, tenzij deze door de omgevingsvariable B<SIMPLE_BACKUP_SUFFIX> werd veranderd.
uk: Перед вилученням перевизначити звичайний суфікс. Типовим суфіксом є B<~>, якщо не перевизначено змінною середовища B<SIMPLE_BACKUP_SUFFIX>.

source: B<-T>, B<--files-from>=I<FILE>
nl: B<-T>, B<--files-from>=I<BESTAND>
uk: B<-T>, B<--files-from>=I<ФАЙЛ>

source: Get names to extract or create from I<FILE>.
nl: Namen van in of uit te pakken bestanden uit I<BESTAND> halen.
uk: Отримати назви файлів, які слід видобути або створити, з I<ФАЙЛ>а.

source: Unless specified otherwise, the I<FILE> must contain a list of names separated by ASCII B<LF> (i.e. one name per line). The names read are handled the same way as command line arguments. They undergo quote removal and word splitting, and any string that starts with a B<-> is handled as B<tar> command line option.
nl: Behalve als anders opgegeven, I<BESTAND> moet een lijst van bestanden bevatten gescheiden door ASCII B<LF> (m.a.w. een naam per regel). De gelezen namen worden net zo behandeld als commando regel argumenten. Ze ondergaan het verwijderen van aanhalingstekens en opsplitsen van woorden, en elke tekenreeks die begint met B<-> wordt gezien als een B<tar> commando regel optie.
uk: Якщо цього спеціально не вказано, I<ФАЙЛ> має містити список назв, які відокремлено B<LF> ASCII (тобто по одній назві на рядок). Прочитані назви буде оброблено у такий самий спосіб, що і аргументи командного рядка. Вони підлягатимуть вилученню лапок і поділу на слова, а будь-який рядок, який починається з B<->, буде оброблено як параметр командного рядка B<tar>.

source: If this behavior is undesirable, it can be turned off using the B<--verbatim-files-from> option.
nl: Als dit gedrag niet gewenst is dan kan het worden uitgezet met de B<--verbatim-files-from> optie.
uk: Якщо ця поведінка є небажаною, її можна вимкнути за допомогою параметра B<--verbatim-files-from>.

source: The B<--null> option instructs B<tar> that the names in I<FILE> are separated by ASCII B<NUL> character, instead of B<LF>. It is useful if the list is generated by B<find>(1) B<-print0> predicate.
nl: De B<--null> optie instrueert B<tar> dat namen in I<BESTAND> zijn gescheiden door een ASCII B<NUL> teken, in plaats van een B<LF>. Dat is handig als de lijst werd gemaakt met het B<find>(1) B<-print0> predicaat.
uk: Використання параметра B<--null> вказує B<tar>, що назви у файлі I<ФАЙЛ> відокремлено символом B<NUL> ASCII, замість B<LF>. Корисно, якщо список створено B<find>(1) з предикатом B<-print0>.

source: Unquote file or member names (default).
nl: Aanhalingstekens verwijderen rond bestand of namen van leden (standaard).
uk: Усувати лапки з назв файлів або файлів в архіві (типово).

source: Treat each line obtained from a file list as a file name, even if it starts with a dash. File lists are supplied with the B<--files-from> (B<-T>) option. The default behavior is to handle names supplied in file lists as if they were typed in the command line, i.e. any names starting with a dash are treated as B<tar> options. The B<--verbatim-files-from> option disables this behavior.
nl: Behandelt elke regel verkregen van een bestandslijst als een bestandsnaam, zelfs als deze begint met een streepje. Bestandslijsten worden opgegeven met de B<--files-from> (B<-T>) optie. Het standaard gedrag is om de namen uit de opgegeven lijst te behandelen alsof ze werden getikt op de commando regel, m.a.w. alle namen die beginnen met een streepje worden gezien als B<tar> opties. De B<--verbatim-files-from> optie schakelt dit gedrag uit.
uk: Вважати кожен рядок, отриманий зі списку файлів, назвою файла, навіть якщо він починається з дефіса. Списки файлів слід вказувати за допомогою параметра B<--files-from> (B<-T>). Типовою є обробка назв, наданих у списках файлів так, наче їх було введено у командному рядку, тобто, будь-які назви, що починаються з дефіса, будуть вважатися параметрами B<tar>. Параметр B<--verbatim-files-from> вимикає цю поведінку.

source: This option affects all B<--files-from> options that occur after it in the command line. Its effect is reverted by the B<--no-verbatim-files-from} option.>
nl: Deze optie beïnvloed alle B<--files-from> opties die hierna komen op de commando regel. Zijn effect wordt ongedaan gemaakt door de B<--no-verbatim-files-from> optie.
uk: Цей параметр стосується усіх параметрів B<--files-from>, які буде вказано після нього у рядку команди. Результат його застосування можна скасувати за допомогою параметра B<--no-verbatim-files-from>.

source: B<This option is implied by the --null> option.
nl: B<This option is implied by the --null> optie.
uk: B<Цей параметр автоматично вмикається, що використано параметр --null>.

source: See also B<--add-file>.
nl: Zie ook B<--add-file>.
uk: Див. також B<--add-file>.

source: B<-X>, B<--exclude-from>=I<FILE>
nl: B<-X>, B<--exclude-from>=I<BESTAND>
uk: B<-X>, B<--exclude-from>=I<ФАЙЛ>

source: Exclude files matching patterns listed in FILE.
nl: Sluit bestanden uit waarvan de patronen passen op die zoals opgesomd in BESTAND
uk: Виключити назви, що відповідають взірцям, вказаним у ФАЙЛі.

source: File name transformations
nl: Bestandsnaam-transformaties
uk: Перетворювання назв файлів

source: B<--strip-components>=I<NUMBER>
nl: B<--strip-components>=I<AANTAL>
uk: B<--strip-components>=I<ЧИСЛО>

source: Strip I<NUMBER> leading components from file names on extraction.
nl: Dit I<AANTAL> leidende componenten uit bestandsnamen verwijderen.
uk: Вилучити вказане I<ЧИСЛО> компонентів з початку назв файлів.

source: B<--transform>=I<EXPRESSION>, B<--xform>=I<EXPRESSION>
nl: B<--transform>=I<EXPRESSIE>, B<--xform>=I<EXPRESSIE>
uk: B<--transform>=I<ВИРАЗ>, B<--xform>=I<ВИРАЗ>

source: Use sed replace I<EXPRESSION> to transform file names.
nl: Deze vervangings-I<EXPRESSIE> gebruiken om bestandsnamen met 'sed' te transformeren.
uk: Скористатися I<ВИРАЗ>ом заміни sed для перетворення назв файлів.

source: File name matching options
nl: Bestandsaanmaak-opties
uk: Параметри встановлення відповідності назв файлів

source: These options affect both exclude and include patterns.
nl: Bestandsnaam selectie-opties (voor zowel in- als uitsluitingpatronen):
uk: Ці параметри стосуються як взірців виключення, так і взірців включення.

source: Patterns match file name start.
nl: Patronen komen overeen met begin van bestandsnaam.
uk: Порівнювати шаблони з назвами файлів, починаючи від початку назви.

source: Ignore case.
nl: Verschil tussen hoofd- en kleine letters negeren.
uk: Не враховувати регістр символів.

source: Patterns match after any B</> (default for exclusion).
nl: Patronen komen overeen met alles na een B</> (is standaard bij uitsluiting).
uk: Відповідність взірцям після усіх B</> (типово для виключення)

source: Case sensitive matching (default).
nl: Hoofdlettergevoelige vergelijking (standaard).
uk: Відповідність взірцям із врахуванням регістру символів (типово).

source: Verbatim string matching.
nl: Exacte tekenreeksvergelijking.
uk: Порівнювати рядки буквально.

source: Wildcards do not match B</>.
nl: Jokertekens komen niet overeen met B</>.
uk: Шаблони заміни не стосуються B</>.

source: Use wildcards (default for exclusion).
nl: Jokertekens gebruiken (is standaard bij uitsluiting).
uk: Користатися шаблонами (типово для виключення).

source: Wildcards match B</> (default for exclusion).
nl: Jokertekens komen overeen met B</> (is standaard bij uitsluiting).
uk: Шаблони стосуються B</> (типово для виключення)

source: Informative output
nl: Informatieve uitvoer
uk: Показ інформації

source: Display progress messages every I<N>th record (default 10).
nl: Voortgangsberichten tonen voor elk I<N>ste record (standaard 10).
uk: Виводити контрольне повідомлення кожні I<N> записів (типово, 10)

source: B<--checkpoint-action>=I<ACTION>
nl: B<--checkpoint-action>=I<ACTIE>
uk: B<--checkpoint-action>=I<ДІЯ>

source: Run I<ACTION> on each checkpoint.
nl: Bij elk controlepunt deze I<ACTIE> uitvoeren.
uk: Виконати вказану I<ДІЮ> у кожному контрольному пункті.

source: Only set time when the file is more recent than what was given with --mtime.
nl: Tijdsstempel alleen zetten wanneer het bestand recenter is dan wat gegeven is met '--mtime'.
uk: Встановлювати час лише для файлів, що є новішими за файл, вказаний з --mtime.

source: Print file time to its full resolution.
nl: Bestandstijden in volledige resolutie tonen.
uk: Виводити час модифікації файлів у повній роздільній здатності.

source: B<--index-file>=I<FILE>
nl: B<--index-file>=I<BESTAND>
uk: B<--index-file>=I<ФАЙЛ>

source: Send verbose output to I<FILE>.
nl: Gedetailleerde uitvoer naar I<BESTAND> sturen.
uk: Надіслати докладне виведення до I<ФАЙЛ>аю

source: Print a message if not all links are dumped.
nl: Een bericht tonen als niet alle links gearchiveerd werden.
uk: Виводити повідомлення, якщо до архіву було додано не всі посилання.

source: B<--no-quote-chars>=I<STRING>
nl: B<--no-quote-chars>=I<TEKST>
uk: B<--no-quote-chars>=I<РЯДОК>

source: Disable quoting for characters from I<STRING>.
nl: De tekens in I<TEKST> niet aanhalen.
uk: Вимкнути взяття у лапки для символів з I<РЯДКА>.

source: B<--quote-chars>=I<STRING>
nl: B<--quote-chars>=I<TEKST>
uk: B<--quote-chars>=I<РЯДОК>

source: Additionally quote characters from I<STRING>.
nl: Ook de tekens in I<TEKST> aanhalen.
uk: брати у лапки також вказані I<РЯДКОМ> символи

source: B<--quoting-style>=I<STYLE>
nl: B<--quoting-style>=I<STIJL>
uk: B<--quoting-style>=I<СТИЛЬ>
