Repository: sebras/manpages-l10n
Catalog: po/*/man1/tar.1.po
Languages: nl, uk

source: B<--exclude-caches-under> exclude everything under directories containing
nl: B<--exclude-caches-under> sluit alles uit in mappen die bevatten
uk: B<--exclude-caches-under> виключити усе у каталогах, які містять

source: B<--exclude-ignore>=I<FILE>
nl: B<--exclude-ignore>=I<BESTAND>
uk: B<--exclude-ignore>=I<ФАЙЛ>

source: read exclude patterns for each directory from FILE, if it exists
nl: uitsluitingspatronen voor mappen uit BESTAND lezen, als deze bestaat
uk: прочитати взірці виключення для кожного з каталогів із файла ФАЙЛ, якщо такий існує

source: B<--exclude-ignore-recursive>=I<FILE>
nl: B<--exclude-ignore-recursive>=I<BESTAND>
uk: B<--exclude-ignore-recursive>=I<ФАЙЛ>

source: read exclude patterns for each directory and its subdirectories from FILE, if it exists
nl: uitsluitingspatronen voor mappen en submappen uit BESTAND lezen, als deze bestaat
uk: прочитати взірці виключення для кожного з каталогів і його підкаталогів із файла ФАЙЛ, якщо такий існує

source: exclude contents of directories containing FILE, except for FILE itself
nl: inhoud van mappen die BESTAND bevatten uitsluiten, behalve BESTAND zelf
uk: не архівувати файли в каталогах, що містять ФАЙЛ, з винятком самого файла

source: B<--exclude-tag-all>=I<FILE> exclude directories containing FILE
nl: B<--exclude-tag-all>=I<BESTAND> mappen die BESTAND bevatten uitsluiten
uk: B<--exclude-tag-all>=I<ФАЙЛ> — виключити каталоги, у яких міститься ФАЙЛ

source: exclude everything under directories containing FILE
nl: alles onder mappen die BESTAND bevatten uitsluiten
uk: не архівувати жодні файли в каталогах, що містять ФАЙЛ

source: exclude version control system directories
nl: systeemmappen van versiebeheer uitsluiten
uk: не архівувати каталоги систем керування версіями

source: read exclude patterns from the VCS ignore files
nl: uitsluitingspatronen uit VCS-ignore-bestanden lezen
uk: прочитати взірці виключення із файлів ігнорування системи керування версіями

source: disable the effect of the previous B<--null> option
nl: het resultaat van de vorige B<--null>-optie ongedaan maken
uk: вимкнути дію попереднього параметра B<--null>

source: avoid descending automatically in directories
nl: niet automatisch afdalen in mappen
uk: не заходити автоматично у каталоги

source: do not unquote input file or member names
nl: geen aanhalingstekens verwijderen rond invoerbestand of lidnamen
uk: не усувати лапки з назв вхідних файлів або файлів в архіві

source: B<--no-verbatim-files-from> B<-T> treats file names starting with dash as
nl: '-T' ziet bestandsnamen die beginnen met een streepje als
uk: -B<--no-verbatim-files-from> B<-T> обробляє слова, що починаються з риски, як

source: options (default)
nl: opties (standaard)
uk: параметри (типові)

source: B<--null> B<-T> reads null-terminated names; implies
nl: B<--null> B<-T> leest met NUL afgesloten namen; impliceert
uk: B<--null> B<-T> читає назви, які відокремлено нуль-символом; автоматично вмикає

source: recurse into directories (default)
nl: recursief in mappen afdalen (standaard)
uk: рекурсивно проходити каталоги (типово)

source: get names to extract or create from FILE
nl: namen van in of uit te pakken bestanden uit BESTAND halen
uk: читати назви файлів для додання/видобування з вказаного файла

source: unquote input file or member names (default)
nl: aanhalingstekens verwijderen rond invoerbestand of lidnamen (standaard)
uk: усувати лапки з назв вхідних файлів або файлів в архіві (типово)

source: B<--verbatim-files-from> B<-T> reads file names verbatim (no escape or option
nl: B<--verbatim-files-from> B<-T> leest bestandsnamen letterlijk (geen escape of optie
uk: B<--verbatim-files-from> B<-T> читає назви файлів буквально (без екранування або обробки

source: exclude patterns listed in FILE
nl: uitsluitingspatronen staan opgesomd in BESTAND
uk: виключити назви що відповідають шаблонам, вказаним у файлі

source: File name matching options (affect both exclude and include patterns):
nl: Bestandsnaamselectie-opties (voor zowel in- als uitsluitingspatronen):
uk: Керування порівнюванням назв (впливає на взірці як вилучення, так і долучення):

source: patterns match file name start
nl: patronen komen overeen met begin van bestandsnaam
uk: порівнювати шаблони з назвами файлів починаючи від початку назви

source: ignore case
nl: verschil tussen hoofd- en kleine letters negeren
uk: шаблони ігнорують відмінності у регістрі символів

source: patterns match after any '/' (default for exclusion)
nl: patronen komen overeen met alles na een '/' (is standaard bij uitsluiting)
uk: відповідність взірцям після усіх '/' (типово для виключення)

source: case sensitive matching (default)
nl: hoofdlettergevoelige vergelijking (standaard)
uk: шаблони враховують регістр (типово)

source: verbatim string matching
nl: exacte tekenreeksvergelijking
uk: порівнювати назви буквально

source: wildcards do not match '/'
nl: jokertekens komen niet overeen met '/'
uk: шаблони не стосуються до '/'

source: use wildcards (default for exclusion)
nl: jokertekens gebruiken (is standaard bij uitsluiting)
uk: користатися шаблонами (типово для вилучення)

source: wildcards match '/' (default for exclusion)
nl: jokertekens komen overeen met '/' (is standaard bij uitsluiting)
uk: шаблони стосуються '/' (типово для виключення)

source: Overwrite control:
nl: Overschrijvingsopties:
uk: Керування перезаписом:

source: preserve existing symlinks to directories when extracting
nl: bestaande symbolische koppelingen naar mappen behouden bij het uitpakken
uk: зберігати наявні символічні посилання на каталоги під час видобування

source: don't replace existing files that are newer than their archive copies
nl: bestaande bestanden die nieuwer zijn dan die in het archief niet vervangen
uk: не заміняти наявні файли що є новішими за їх копії у архіві

source: don't replace existing files when extracting, treat them as errors
nl: bij het uitpakken bestaande bestanden niet vervangen; behandelen als fouten
uk: не заміняти наявні файли під час видобування, вважати наявність файла помилкою

source: preserve metadata of existing directories
nl: metagegevens van bestaande mappen behouden
uk: зберігати мета-дані наявних каталогів

source: B<--one-top-level>[=I<DIR>]
nl: B<--one-top-level>[=I<MAP>]
uk: B<--one-top-level>[=I<КАТАЛОГ>]

source: create a subdirectory to avoid having loose files extracted
nl: een submap aanmaken om het uitpakken van losse bestanden te vermijden
uk: створити підкаталог для уникнення втрати видобутих файлів

source: overwrite existing files when extracting
nl: bestaande bestanden bij het uitpakken overschrijven
uk: перезаписувати наявні файли під час видобування

source: overwrite metadata of existing directories when extracting (default)
nl: de metagegevens van bestaande mappen bij het uitpakken overschrijven (standaard)
uk: перезаписувати метадані наявних каталогів під час видобування (типово)

source: empty hierarchies prior to extracting directory
nl: bestaande mappen leegmaken alvorens eroverheen uit te pakken
uk: спорожняти старий каталог перед видобуванням його копії з архіву

source: remove files after adding them to the archive
nl: bestanden na hun toevoeging aan het archief verwijderen
uk: вилучати файли після додавання до архіву

source: don't replace existing files when extracting, silently skip over them
nl: bij het uitpakken bestaande bestanden niet vervangen; stilletjes overslaan
uk: не заміняти наявні файли під час видобування, мовчки пропускати такі файли

source: remove each file prior to extracting over it
nl: elk bestand verwijderen alvorens eroverheen uit te pakken
uk: вилучяти кожний файл перед видобуванням його копії

source: attempt to verify the archive after writing it
nl: het archief na het schrijven proberen te verifiëren
uk: перевірити архів після запису в нього

source: Select output stream:
nl: Selecteren van uitvoerkanaal:
uk: Вибір вихідного потоку:

source: B<--ignore-command-error> ignore exit codes of children
nl: B<--ignore-command-error> afsluitwaardes van dochterprocessen negeren
uk: B<--ignore-command-error> — ігнорувати коди завершення процесів-нащадків

source: treat non-zero exit codes of children as error
nl: afsluitwaardes van dochterprocessen die niet nul zijn als fout behandelen
uk: вважати ненульовий код завершення нащадка помилкою

source: extract files to standard output
nl: bestanden uitpakken naar standaarduitvoer
uk: видобувати файли у стандартний вивід

source: pipe extracted files to another program
nl: uitgepakte bestanden via pijp naar gegeven programma sluizen
uk: передавати витягнуті файли до стандартного вводу іншої програми

source: Handling of file attributes:
nl: Behandeling van bestandskenmerken:
uk: Обробка атрибутів файла:

source: preserve access times on dumped files, either by restoring the times after reading (METHOD='replace'; default) or by not setting the times in the first place (METHOD='system')
nl: toegangstijdsstempels van gearchiveerde bestanden behouden: door het herstellen van de tijdsstempels na het lezen (MANIER='replace'; standaard), of door de tijdsstempels met rust te laten (MANIER='system')
uk: відтворювати час доступу до доданих файлів через відновлювання часу після читання (типово, МЕТОД='replace'), або через запобігання оновленню часу (МЕТОД='system')

source: only set time when the file is more recent than what was given with B<--mtime>
nl: tijdsstempel alleen zetten wanneer het bestand recenter is dan wat gegeven is met B<--mtime>
uk: встановлювати час лише для файлів, що є новіші за файл, який вказано з B<--mtime>

source: delay setting modification times and permissions of extracted directories until the end of extraction
nl: het zetten van permissies en tijdsstempels van mappen uitstellen tot na het uitpakken
uk: затримати встановлення часу модифікації та прав доступу до каталогів до кінця видобування

source: B<--group>=I<NAME>
nl: B<--group>=I<NAAM>
uk: B<--group>=I<НАЗВА>

source: force NAME as group for added files
nl: forceer NAAM als groep van toegevoegde bestanden
uk: встановлення групи з вказаною назвою групою власника доданих файлів

source: use FILE to map file owner GIDs and names
nl: GID's en groepsnamen uit BESTAND halen
uk: читати мапу трансляції імен груп та значень GID з ФАЙЛА

source: force (symbolic) mode CHANGES for added files
nl: toegevoegde bestanden krijgen (symbolische) WIJZIGINGEN in hun modus
uk: встановлення вказаних символічно прав доступу для доданих файлів

source: set mtime for added files from DATE-OR-FILE
nl: wijzigingstijd zetten van bestanden die wegens DATUM-OF-BESTAND zijn toegevoegd
uk: встановлення часу останньої зміни доданих файлів

source: don't extract file modified time
nl: bestandswijzigingstijden niet uitpakken
uk: не видобувати час модифікації файлів

source: cancel the effect of B<--delay-directory-restore> option
nl: het effect van de optie B<--delay-directory-restore> ongedaan maken
uk: скасувати дію параметра B<--delay-directory-restore>

source: extract files as yourself (default for ordinary users)
nl: bestanden uitpakken als uzelf (standaard voor gewone gebruikers)
uk: стати власником витягнутих файлів (типово для звичайного користувача)

source: apply the user's umask when extracting permissions from the archive (default for ordinary users)
nl: de umask van de gebruiker toepassen bij het uitpakken van bestandspermissies (standaard voor gewone gebruikers)
uk: встановлювати права доступу згідно зі значенням umask (типово для звичайного користувача)

source: always use numbers for user/group names
nl: altijd getallen gebruiken voor gebruikers- en groepsnamen
uk: завжди використовувати числа замість назв власника/групи

source: B<--owner>=I<NAME>
nl: B<--owner>=I<NAAM>
uk: B<--owner>=I<НАЗВАE>

source: force NAME as owner for added files
nl: toegevoegde bestanden krijgen NAAM als eigenaar
uk: встановлення вказаного користувача власником доданих файлів

source: use FILE to map file owner UIDs and names
nl: UID's en gebruikersnamen uit BESTAND halen
uk: читати мапу трансляції імен користувачів та значень UID з ФАЙЛА

source: try extracting files with the same ownership as exists in the archive (default for superuser)
nl: bestanden proberen uit te pakken met dezelfde eigenaar als in het archief (standaard voor root)
uk: встановлювати власників файлів за даними з архіву (типово для супер-користувача)

source: B<--sort>=I<ORDER>
nl: B<--sort>=I<VOLGORDE>
uk: B<--sort>=I<ПОРЯДОК>

source: directory sorting order: none (default), name or inode
nl: sorteervolgorde van mappen: 'none' (geen, standaard), 'name' (naam) of 'inode'
uk: спосіб упорядковування каталогів: none (немає, типовий), name (за назвою) або inode (за номером вузла)

source: member arguments are listed in the same order as the files in the archive
nl: lid-argumenten worden getoond in de volgorde die ze hebben in het archief
uk: назви файлів вказано у тому самому порядку, що і файли у архіві

source: Handling of extended file attributes:
nl: Behandeling van uitgebreide bestandskenmerken:
uk: Обробка розширених атрибутів файлів:

source: Enable the POSIX ACLs support
nl: Ondersteuning voor POSIX ACL's inschakelen
uk: Увімкнути підтримку ACL POSIX

source: Disable the POSIX ACLs support
nl: Ondersteuning voor POSIX ACL's uitschakelen
uk: Вимкнути підтримку ACL POSIX

source: Disable the SELinux context support
nl: Ondersteuning voor SELinux-contexten uitschakelen
uk: Вимкнути підтримку контекстів SELinux

source: Disable extended attributes support
nl: Ondersteuning voor uitgebreide kenmerken uitschakelen
uk: Вимкнути підтримку розширених атрибутів

source: Enable the SELinux context support
nl: Ondersteuning voor SELinux-contexten inschakelen
uk: Увімкнути підтримку контекстів SELinux

source: Enable extended attributes support
nl: Ondersteuning voor uitgebreide kenmerken inschakelen
uk: Увімкнути підтримку розширених атрибутів

source: B<--xattrs-exclude>=I<MASK>
uk: B<--xattrs-exclude>=I<МАСКА>

source: specify the exclude pattern for xattr keys
nl: patroon van uit te sluiten xattr-sleutels
uk: вказати взірець виключення для ключів xattr

source: B<--xattrs-include>=I<MASK>
uk: B<--xattrs-include>=I<МАСКА>

source: specify the include pattern for xattr keys
nl: patroon van in te sluiten xattr-sleutels
uk: вказати взірець включення для ключів xattr

source: Device selection and switching:
nl: Apparaatselectie en -wisseling:
uk: Вибір та зміна пристрою:

source: archive file is local even if it has a colon
nl: archiefbestand is lokaal, zelfs als het een dubbele punt bevat
uk: файл архіву є локальним, навіть якщо його назва містить двокрапку

source: use archive file or device ARCHIVE
nl: archiefbestand of apparaat ARCHIEF gebruiken
uk: використовувати вказаний файл або пристрій

source: B<-F>, B<--info-script>=I<NAME>, B<--new-volume-script>=I<NAME>
nl: B<-F>, B<--info-script>=I<NAAM>, B<--new-volume-script>=I<NAAM>
uk: B<-F>, B<--info-script>=I<НАЗВА>, B<--new-volume-script>=I<НАЗВА>

source: run script at end of each tape (implies B<-M>)
nl: script uitvoeren aan einde van elke band (impliceert B<-M>)
uk: запускати сценарій наприкінці кожної стрічки (вмикає B<-M>)

source: B<-L>, B<--tape-length>=I<NUMBER>
uk: B<-L>, B<--tape-length>=I<ЧИСЛО>

source: change tape after writing NUMBER x 1024 bytes
nl: band wisselen na schrijven van AANTAL x 1024 bytes
uk: змінити стрічку після запису ЧИСЛА x 1024 байтів

source: create/list/extract multi-volume archive
nl: meerdelig archief aanmaken/opsommen/uitpakken
uk: створити, виводити вміст або видобувати файли з багатотомного архіву

source: use given rmt COMMAND instead of rmt
nl: deze OPDRACHT gebruiken in plaats van 'rmt'
uk: використовувати вказану команду замість rmt

source: use remote COMMAND instead of rsh
nl: deze OPDRACHT gebruiken in plaats van 'rsh'
uk: використовувати вказану команду замість rsh

source: use/update the volume number in FILE
nl: het deelnummer in BESTAND gebruiken/bijwerken
uk: використовувати/оновлювати номер тому у ФАЙЛІ

source: Device blocking:
nl: Blokverwerking:
uk: Блокування пристрою:

source: BLOCKS x 512 bytes per record
nl: BLOKKEN x 512 bytes per record
uk: розмір запису ЧИСЛО-БЛОКІВ x 512 байтів

source: reblock as we read (for 4.2BSD pipes)
nl: doorgaan met lezen tot blok compleet is (voor 4.2BSD-pijpen)
uk: розбивати на блоки під час читання (для каналів 4.2BSD)

source: ignore zeroed blocks in archive (means EOF)
nl: blokken met nullen in archief negeren (betekenen einde-van-bestand)
uk: ігнорувати нульові блоки в архіві (звичайно вказують кінець файла)

source: NUMBER of bytes per record, multiple of 512
nl: AANTAL bytes per record (een veelvoud van 512)
uk: встановити розмір запису у блоках по 512 байтів

source: Archive format selection:
nl: Archiefindelingskeuze:
uk: Вибір формату архіву:

source: create archive of the given format
nl: een archief maken in de gekozen indeling
uk: створити архів у вказаному форматі

source: FORMAT is one of the following:
nl: INDELING is een van de volgende:
uk: ФОРМАТ будь-який з наступних:

source: GNU format as per tar E<lt>= 1.12
nl: GNU-indeling van tar E<lt>= 1.12
uk: формат GNU, сумісний з версією tar E<lt>= 1.12

source: POSIX 1003.1-2001 (pax) format
nl: POSIX 1003.1-2001 (pax-indeling)
uk: формат POSIX 1003.1-2001 (pax)

source: same as pax
nl: hetzelfde als pax
uk: те ж, що і pax

source: POSIX 1003.1-1988 (ustar) format
nl: POSIX 1003.1-1988 (ustar-indeling)
uk: формат POSIX 1003.1-1988 (ustar)

source: old V7 tar format
nl: oude V7 tar-indeling
uk: старий формат V7

source: same as B<--format>=I<v7>
nl: hetzelfde als B<--format>=I<v7>
uk: те саме, що і B<--format>=I<v7>

source: B<--pax-option>=I<keyword[[>:]=value][,keyword[[:]=value]]...
nl: B<--pax-option>=I<sleutelwoord[[>:]=waarde][,sleutelwoord[[:]=waarde]]...
uk: B<--pax-option>=I<ключове_слово[[>:]=значення][,ключове_слово[[:]=значення]]...

source: control pax keywords
nl: het aangeven van pax-sleutelwoorden
uk: керування ключовими словами pax

source: same as B<--format>=I<posix>
nl: hetzelfde als B<--format>=I<posix>
uk: те саме, що і B<--format>=I<posix>

source: create archive with volume name TEXT; at list/extract time, use TEXT as a globbing pattern for volume name
nl: een archief met deelnaam TEKST maken; bij opsommen/uitpakken TEKST als zoekpatroon voor de deelnaam gebruiken
uk: створити архів з назвою тому «ТЕКСТ». Під час виведення вмісту або видобування, використовувати ТЕКСТ як шаблон пошуку тому

source: Compression options:
nl: Compressie-opties:
uk: Параметри стиснення:

source: use archive suffix to determine the compression program
nl: compressieprogramma afleiden uit bestandsachtervoegsel
uk: вибирати програму стиснення за суфіксом архіву

source: B<-I>, B<--use-compress-program>=I<PROG>
uk: B<-I>, B<--use-compress-program>=I<ПРОГРАМА>

source: filter through PROG (must accept B<-d>)
nl: het archief door dit programma filteren (moet B<-d> accepteren)
uk: фільтрувати через ПРОГРАМУ (має приймати B<-d>)

source: filter the archive through bzip2
nl: het archief door bzip2 filteren
uk: фільтрувати архів через bzip2

source: filter the archive through xz
nl: het archief door xz filteren
uk: фільтрувати архів через xz

source: filter the archive through lzip
nl: het archief door lzip filteren
uk: фільтрувати архів через lzip

source: filter the archive through lzop
nl: het archief door lzop filteren
uk: фільтрувати архів через lzop

source: do not use archive suffix to determine the compression program
nl: compressieprogramma niet afleiden uit bestandsachtervoegsel
uk: не використовувати суфікс для вибору програми стиснення

source: filter the archive through xz B<--format>=I<lzma>
nl: het archief door xz B<--format>=I<lzma> filteren
uk: фільтрувати архів через xz B<--format>=I<lzma>

source: filter the archive through zstd
nl: het archief door zstd filteren
uk: фільтрувати архів через zstd

source: filter the archive through gzip
nl: het archief door gzip filteren
uk: фільтрувати архів через gzip

source: filter the archive through compress
nl: het archief door compress filteren
uk: фільтрувати архів через compress

source: Local file selection:
nl: Lokale bestandskeuze:
uk: Вибір файлів:

source: backup before removal, choose version CONTROL
nl: voor verwijdering een reservekopie maken, op de aangegeven MANIER
uk: перед вилученням створювати резервні файли у вказаному режимі

source: follow hard links; archive and dump the files they refer to
nl: harde koppelingen volgen; de bestanden waar ze naar verwijzen archiveren
uk: Переходити за жорсткими посиланнями: долучати файли, на які вони вказують

source: follow symlinks; archive and dump the files they point to
nl: symbolische koppelingen volgen; de bestanden waar ze naar verwijzen archiveren
uk: Переходити за символьними посиланнями: долучати файли, на які вони вказують

source: B<-K>, B<--starting-file>=I<MEMBER-NAME>
nl: B<-K>, B<--starting-file>=I<LIDNAAM>
uk: B<-K>, B<--starting-file>=I<НАЗВА-ЕЛЕМЕНТА>

source: begin at member MEMBER-NAME when reading the archive
nl: beginnen bij lid LIDNAAM tijdens lezen van het archief
uk: починати читання архіву з вказаного файла

source: compare date and time when data changed only
nl: datum en tijd alleen vergelijken wanneer gegevens veranderd zijn
uk: порівнювати тільки дату і час зміни даних

source: B<-N>, B<--newer>=I<DATE-OR-FILE>, B<--after-date>=I<DATE-OR-FILE>
nl: B<-N>, B<--newer>=I<DATUM-OF-BESTAND>, B<--after-date>=I<DATUM-OF-BESTAND>
uk: B<-N>, B<--newer>=I<ДАТА-АБО-ФАЙЛ>, B<--after-date>=I<ДАТА-АБО-ФАЙЛ>

source: only store files newer than DATE-OR-FILE
nl: alleen bestanden opslaan die nieuwer zijn dan DATUM-OF-BESTAND
uk: долучати тільки такі файли, що є новіші за вказану дату або файл

source: stay in local file system when creating archive
nl: in het lokale bestandssysteem blijven bij maken van archief
uk: залишатися у локальної файлової системі під час створення архіву

source: don't strip leading '/'s from file names
nl: leidende '/' niet uit bestandsnamen verwijderen
uk: не вилучати початкову похилу риску, '/', з назв файлів

source: backup before removal, override usual suffix ('~' unless overridden by environment variable SIMPLE_BACKUP_SUFFIX)
nl: voor verwijdering een reservekopie maken, met TEKENREEKS als achtervoegsel (in plaats van '~', die standaard is tenzij door omgevingsvariable SIMPLE_BACKUP_SUFFIX veranderd)
uk: перед вилученням створювати резервні файли з указаним суфіксом (типово '~', якщо не перевизначено змінною середовища SIMPLE_BACKUP_SUFFIX)

source: File name transformations:
nl: Bestandsnaam-transformaties:
uk: Перетворювання назв файлів:

source: strip NUMBER leading components from file names on extraction
nl: dit AANTAL leidende componenten uit bestandsnamen verwijderen
uk: вилучяти вказане ЧИСЛО компонентів з початку назв файлів

source: use sed replace EXPRESSION to transform file names
nl: deze vervangings-EXPRESSIE gebruiken om bestandsnamen met 'sed' te transformeren
uk: перетворювати назви файлів за допомогою вказаного виразу заміни

source: Informative output:
nl: Informatieve uitvoer:
uk: Показ інформації:

source: B<--checkpoint>[=I<NUMBER>]
nl: B<--checkpoint>[=I<AANTAL>]
uk: B<--checkpoint>[=I<ЧИСЛО>]

source: display progress messages every NUMBERth record (default 10)
nl: voortgangsberichten tonen voor elk AANTALste record (standaard 10)
uk: виводити контрольне повідомлення кожне ЧИСЛО записів (типово 10)

source: execute ACTION on each checkpoint
nl: bij elk controlepunt deze ACTIE uitvoeren
uk: виконати вказану дію у контрольному пункті

source: print file time to its full resolution
nl: bestandstijden in volledige resolutie tonen
uk: друкувати час модифікації файлів у повній вирізняльної здатності

source: send verbose output to FILE
nl: gedetailleerde uitvoer naar BESTAND sturen
uk: виводити детальну інформацію у ФАЙЛ
