Repository: sebras/manpages-l10n
Catalog: po/*/man1/time.1.po
Languages: es, fr, it

source: NAME
es: NOMBRE
fr: NOM
it: NOME

source: time - time a simple command or give resource usage
es: time - temporiza una orden sencilla o devuelve la utilización de recursos
fr: time - Chronométrer ou évaluer les ressources employées par une commande simple
it: time - temporizza un semplice comando o informa sull'uso delle risorse

source: SYNOPSIS
es: SINOPSIS
it: SINTASSI

source: B<time .RI [ options ] command [ arguments... ]>
es: B<time .RI [ opciones ] orden [ argumentos... ]>
it: B<time .RI [ opzioni ] comando [ argomenti... ]>

source: DESCRIPTION
es: DESCRIPCIÓN
it: DESCRIZIONE

source: The B<time> command runs the specified program I<command> with the given arguments. When I<command> finishes, B<time> writes a message to standard error giving timing statistics about this program run. These statistics consist of (i) the elapsed real time between invocation and termination, (ii) the user CPU time (the sum of the I<tms_utime> and I<tms_cutime> values in a I<struct tms> as returned by B<times>(2)), and (iii) the system CPU time (the sum of the I<tms_stime> and I<tms_cstime> values in a I<struct tms> as returned by B<times>(2)).
es: La orden B<time> ejecuta el programa I<orden> con los argumentos dados. Una vez que I<orden> termina, B<time> escribe un mensaje en la salida de error estándar con información acerca de la ejecución de dicho programa. Ésta información consta de (i) el tiempo real transcurrido entre la llamada y la finalización de I<orden>, (ii) el tiempo de usuario del procesador empleado (la suma de los valores I<tms_utime> y I<tms_cutime> en un I<struct tms> tal y como lo da B<times>(2)), y (iii) el tiempo de sistema del procesador (la suma de los valores I<tms_stime> y I<tms_cstime> en un I<struct tms> tal y como lo da B<times>(2)).
fr: La fonction B<time> lance le programme représenté par la I<commande> indiquée, avec les I<arguments> fournis. Lorsque la I<commande> se termine, B<time> affiche un message sur la sortie d'erreur contenant des statistiques sur l'exécution du programme. Ces statistiques contiennent (i) le temps écoulé entre l'invocation et la fin de la commande, (ii) le temps CPU écoulé en mode utilisateur (la somme des valeurs I<tms_utime> et I<tms_cutime> de la structure I<struct tms> fournie par l'appel système B<times>(2)), et (iii) le temps CPU passé en mode système (la somme des champs I<tms_stime> et I<tms_cstime> de la I<struct tms> fournie par l'appel système B<times>(2)).
it: Il comando B<time> esegue il programma I<comando> specificato con gli argomenti dati. Quando I<comando> termina, B<time> scrive un messaggio sullo standard error, che fornisce le statistiche temporali sull'esecuzione del programma. Queste statistiche consistono nel (i) tempo reale trascorso tra chiamata e termine, (ii) tempo utente della CPU (la somma dei valori di I<tms_utime> e I<tms_cutime> in formato I<struct tms> come restituito da B<times>(2)), e (iii) tempo di sistema della CPU (la somma dei valori di I<tms_stime> e I<tms_cstime> in formato I<struct tms> come restituito da B<times>(2)).

source: Note: some shells (e.g., B<bash>(1)) have a built-in B<time> command that provides similar information on the usage of time and possibly other resources. To access the real command, you may need to specify its pathname (something like I</usr/bin/time>).
es: Observación: algunas shells (por ejemplo B<bash>(1)) incorporan una orden B<time> que suele realizar aproximadamente la misma función. Si desea acceder a esta orden en concreto, tendrá que especificar su ruta completa (seguramente I</usr/bin/time>).
fr: Note\ : certains interpréteurs (comme par exemple B<bash>(1)) possèdent une commande B<time> qui fournit des informations identiques sur l'utilisation du temps et peut-être d'autres ressources. Pour accéder à la commande réelle, il se peut que vous soyez obligé d'indiquer le chemin complet (quelque chose comme I</usr/bin/time>).
it: Nota: alcune shell (per esempio B<bash>(1)) hanno un comando B<time> precompilato che fornisce infomazioni simili sull'utilizzazione del tempo e forse anche altre risorse. Per accedere al programma reale, potrebbe essere necessario specificarne il percorso (qualcosa come I</usr/bin/time>).

source: OPTIONS
es: OPCIONES
it: OPZIONI

source: When in the POSIX locale, use the precise traditional format
es: Cuando se use la localización POSIX, usar el formato tradicional preciso
fr: Dans la localisation POSIX, utiliser le format traditionnel
it: Quando si è in ambiente POSIX usare l'esatto formato tradizionale

source: (with numbers in seconds) where the number of decimals in the output for %f is unspecified but is sufficient to express the clock tick accuracy, and at least one.
es: (con números en segundos) donde el número de decimales en la salida de %f está sin especificar pero es suficiente para expresar la precisión del flanco de reloj, y al menos uno.
fr: (avec des nombres exprimés en secondes) où le nombre de décimales dans le format %f n'est pas précisé, mais suffisant pour exprimer le top d'horloge précisément.
it: (con numeri in secondi) dove il numero di decimali nell'output per %f non è specificato, ma è almeno uno, ed è sufficiente per esprimere l'accuratezza dell'orologio.

source: EXIT STATUS
es: ESTADO DE SALIDA
fr: CODE DE RETOUR
it: STATO DI USCITA

source: If I<command> was invoked, the exit status is that of I<command>. Otherwise, it is 127 if I<command> could not be found, 126 if it could be found but could not be invoked, and some other nonzero value (1\(en125) if something else went wrong.
es: Si se invocó I<orden> , el estado de salida será el de I<orden>. En otro caso, es 127 si I<orden> no se pudo encontrar, 126 si se pudo encontrar pero no pudo invocarse, y algún otro valor distinto de cero (1\(en125) si ocurrió algun otro error.
fr: Si la I<commande> a été invoquée, le code de sortie est celui de la I<commande>. Sinon, il s'agit de 127 si la I<commande> n'a pas été trouvée, 126 si elle a été trouvée mais n'a pas pu être invoquée, et une autre valeur non nulle (1-125) si quelque chose d'autre a échoué.
it: Se è stato invocato il I<comando> lo stato di uscita è quello del I<comando>. Altrimenti è 127 se I<comando> non può essere trovato, 126 se può essere trovato ma non può essere chiamato, e qualche altro valore diverso da zero (1\(en125) se qualcosa è andato storto.

source: ENVIRONMENT
es: ENTORNO
fr: ENVIRONNEMENT
it: AMBIENTE

source: The variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC>, and B<NLSPATH> are used for the text and formatting of the output. B<PATH> is used to search for I<command>.
es: Las variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> y B<NLSPATH> se usan para dar forma a la salida. B<PATH> se usa para buscar una I<orden>.
it: Le variabili B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> e B<NLSPATH> sono usate per il testo e per la formattazione dell'output. B<PATH> è usata per la ricerca del I<comando>.

source: GNU VERSION
es: VERSIÓN GNU
fr: VERSION GNU
it: VERSIONE GNU

source: Below a description of the GNU 1.7 version of B<time>. Disregarding the name of the utility, GNU makes it output lots of useful information, not only about time used, but also on other resources like memory, I/O and IPC calls (where available). The output is formatted using a format string that can be specified using the I<-f> option or the B<TIME> environment variable.
es: A continuación, una descripción de la versión 1.7 de GNU de B<time>. A pesar del nombre de la utilidad, GNU hace que devuelva gran cantidad de información útil, no solo sobre el tiempo utilizado, sino además sobre otros recursos como memoria, llamadas E/S o IPC (si están disponibles). La salida se formatea utilizando una cadena de formato que se puede especificar utilizando la opción I<-f> o la variable de entorno B<TIME>.
fr: Suit une description de la version GNU 1.7 de B<time>. Contrairement au nom de cet utilitaire, GNU ajoute un grand nombre d'informations utiles, concernant non seulement le temps écoulé, mais également d'autres ressources, comme la mémoire, les entrées-sorties ou les communications IPC (si disponibles). La sortie est formatée en utilisant une chaîne qui peut être transmise avec l'option I<-f> ou en utilisant la variable d'environnement B<TIME>.
it: Di seguito una descrizione della versione GNU 1.7 di B<time>. Indipendentemente dal nome dell'utilità, GNU emette molte informazioni utili, non solo sul tempo utilizzato, ma anche su altre risorse come memoria, I/O e chiamate IPC (ove disponibili). L'output è formattato usando un formato stringa che può essere specificato usando l'opzione I<-f> o la variabile d'ambiente B<TIME>.

source: The default format string is:
es: La cadena de formato por defecto es:
fr: La chaîne de format par défaut est
it: Il formato stringa predefinito è

source: When the I<-p> option is given, the (portable) output format is used:
es: Cuando se indica la opción I<-p>, se usa el formato de salida portable:
fr: Lorsque l'option I<-p> est fournie, le format de sortie (portable) est utilisé :
it: Quando è indicata l'opzione I<-p>, si usa il formato di output (portabile)

source: The format string
es: La cadena de formato
fr: Chaîne de format
it: Il formato stringa

source: The format is interpreted in the usual printf-like way. Ordinary characters are directly copied, tab, newline, and backslash are escaped using \et, \en, and \e\e, a percent sign is represented by %%, and otherwise % indicates a conversion. The program B<time> will always add a trailing newline itself. The conversions follow. All of those used by B<tcsh>(1) are supported.
es: El formato se interpreta de igual modo que con printf. Los caracteres habituales se copian directamente mientras que las tabulaciones, nuevas líneas y barras invertidas se escapan usando \et, \en y \e\e, el signo de porcentaje se representa mediante %%, % indica una conversión. El programa B<time> añadirá siempre una línea vacía final. A continuación se presentan las conversiones. Es posible el uso de cualquiera de las que emplea B<tcsh>(1).
it: Il formato è interpretato nel solito modo in stile printf. I caratteri ordinari sono copiati direttamente, tab, newline e backslash vengono generati con i caratteri di escape usando \et, \en e \e\e, un segno di percentuale è rappresentato da %%, mentre invece % indica una conversione. Il programma B<time> aggiungerà sempre da sè una newline finale. Seguono le conversioni. Sono supportate tutte quelle usate da B<tcsh>(1).

source: Elapsed real time (in [hours:]minutes:seconds).
es: Tiempo real transcurrido (en [horas:]minutos:segundos).
fr: Temps réel écoulé (en [heures:]minutes:secondes).
it: Tempo reale trascorso (in [ore:]minuti:secondi).

source: (Not in B<tcsh>(1).) Elapsed real time (in seconds).
es: (No aparece en B<tcsh>(1).) Tiempo real transcurrido (en segundos).
fr: (pas avec B<tcsh>(1).) Temps réel écoulé (en secondes).
it: (Non in B<tcsh>(1).) Tempo reale trascorso (in secondi).

source: Total number of CPU-seconds that the process spent in kernel mode.
es: Número total de segundos de CPU que el proceso consumió en modo de núcleo.
fr: Nombre total de secondes-CPU passées par le processus en mode noyau.
it: Numero totale di secondi-CPU che il processo ha speso in kernel mode.

source: Total number of CPU-seconds that the process spent in user mode.
es: Número total de segundos de CPU que el proceso consumió en modo de usuario.
fr: Nombre total de secondes-CPU passées par le processus en mode utilisateur.
it: Numero totale di secondi-CPU che il processo ha speso in user mode.

source: Percentage of the CPU that this job got, computed as (%U + %S) / %E.
es: Porcentaje de CPU que recibió este trabajo, calculado como (%U + %S) / %E.
fr: Pourcentage de CPU obtenu par cette tâche, calculé comme (%U + %S) / %E.
it: Percentuale di CPU che questo lavoro ha preso, conteggiata come (%U + %S) / %E.

source: Maximum resident set size of the process during its lifetime, in Kbytes.
es: Conjunto máximo residente del proceso durante su tiempo de vida, en KBytes.
fr: Taille maximale du processus en mémoire physique durant son exécution, en kilooctets.
it: Massima dimensione dell'insieme residente del processo durante la sua esistenza, in chilobyte.

source: (Not in B<tcsh>(1).) Average resident set size of the process, in Kbytes.
es: (No aparece en B<tcsh>(1).) Tamaño aproximado del conjunto residente del proceso, en KBytes.
fr: (pas avec B<tcsh>(1).) Taille moyenne du processus en mémoire physique durant son exécution, en kilooctets.
it: (Non in B<tcsh>(1).) Dimensione media dell'insieme residente del processo, in chilobyte.

source: Average total (data+stack+text) memory use of the process, in Kbytes.
es: Uso de memoria total aproximado (datos+pila+texto) del proceso, en KBytes.
fr: Mémoire moyenne (donnée + pile + code) utilisée par le processus, en kilooctets.
it: Media totale (data+stack+text) della memoria usata dal processo, in chilobytes.

source: Average size of the process's unshared data area, in Kbytes.
es: Tamaño aproximado del área de datos no compartida del proceso, en KBytes.
fr: Taille moyenne des données non partagées du processus, en kilooctets.
it: Dimensione media delle aree dati non condivise dei processi, in chilobyte.

source: (Not in B<tcsh>(1).) Average size of the process's unshared stack space, in Kbytes.
es: (No aparece en B<tcsh>(1).) Tamaño aproximado del espacio de pila no compartido del proceso, en KBytes.
fr: (pas avec B<tcsh>(1).) Taille moyenne de la pile non partagée du processus, en kilooctets.
it: (Non in B<tcsh>(1).) Dimensione media dello spazio stack non condiviso dei processi in chilobyte.

source: Average size of the process's shared text space, in Kbytes.
es: Tamaño aproximado del espacio de texto compartido del proceso, en KBytes.
fr: Taille moyenne du code partagé du processus, en kilooctets.
it: Dimensione media dello spazio di testo condiviso dei processi, in chilobyte.

source: (Not in B<tcsh>(1).) System's page size, in bytes. This is a per-system constant, but varies between systems.
es: (No aparece en B<tcsh>(1).) Tamaño de página del sistema, en KBytes. Esto es una constante del sistema, pero varía entre un sistema y otro.
fr: (pas avec B<tcsh>(1).) Taille de page du système, en octets. Ceci est une constante sur un système, mais varie de système en système.
it: (Non in B<tcsh>(1).) Dimensione della pagina di sistema, in byte. Questa è una costante di sistema, ma varia tra i sistemi.

source: Number of major page faults that occurred while the process was running. These are faults where the page has to be read in from disk.
es: Número de faltas de página principales, que ocurrieron mientras el proceso se ejecutaba. Estas son faltas en las que la página debe ser leída desde disco.
fr: Nombre de fautes de pages majeures durant l'exécution. Ce sont les fautes où des pages ont dû être rechargées depuis le disque.
it: Numero di errori maggiori di pagina accaduti durante il funzionamento del processo. Sono errori in cui la pagina deve essere registrata dal disco.

source: Number of minor, or recoverable, page faults. These are faults for pages that are not valid but which have not yet been claimed by other virtual pages. Thus the data in the page is still valid but the system tables must be updated.
es: Número de faltas de página menores o recuperables. Estas son faltas para páginas que no son válidas pero que no han sido reclamadas aún por otras páginas virtuales. De este modo, los datos en la página son todavía válidos, pero las tablas de sistema deben actualizarse.
fr: Nombre de fautes de pages mineures durant l'exécution. Ce sont les fautes où des pages ne sont plus valides, mais n'ont pas encore été réutilisées. Les données y sont encore présentes et seules les tables système doivent être mises à jour.
it: Numero di errori minori di pagina, o recuperabili. Sono errori per pagine che non sono valide ma che non sono ancora state reclamate da altre pagine virtuali. Di conseguenza il dato nella pagina è ancora valido, ma le tabelle di sistema devono venire aggiornate.

source: Number of times the process was swapped out of main memory.
es: Número de veces que el proceso fue intercambiado hacia afuera de la memoria principal.
fr: Nombre de fois où le processus a été envoyé sur la mémoire de swap.
it: Numero di volte che il processo è stato spostato fuori dalla memoria principale.

source: Number of times the process was context-switched involuntarily (because the time slice expired).
es: Número de veces que el proceso fue intercambiado de contexto involuntariamente (porque finalizase la porción de tiempo).
fr: Nombre de fois où le processus a été préempté involontairement (sa tranche de temps ayant expiré).
it: Numero di volte che il processo è stato scambiato involontariamente nel contesto (perché la porzione di tempo è scaduta).

source: Number of waits: times that the program was context-switched voluntarily, for instance while waiting for an I/O operation to complete.
es: Número de esperas: veces que el programa fue intercambiado de contexto voluntariamente, por ejemplo, mientras se espera a que se complete una operación de E/S.
fr: Nombre de fois où le processus a été commuté volontairement, en passant en attente par exemple de la fin d'une entrée-sortie.
it: Numero di attese: volte che il programma è stato scambiato volontariamente nel contesto, per esempio mentre era in attesa del completamente di un'operazione di I/O.

source: B<I/O>
es: B<E/S>
fr: B<Entrées/Sorties>

source: Number of filesystem inputs by the process.
es: Número de entradas al sistema de archivos por el proceso.
fr: Nombre de lectures depuis un fichier
it: Numero di input del processo nel filesystem.

source: Number of filesystem outputs by the process.
es: Número de salidas al sistema de archivos por el proceso.
fr: Nombre d'écritures dans un fichier
it: Numero di output del processo nel filesystem.

source: Number of socket messages received by the process.
es: Número de mensajes de conexión recibidos por el proceso.
fr: Nombre de messages reçus par le processus sur une socket.
it: Numero di messaggi di socket ricevuti dal processo.

source: Number of socket messages sent by the process.
es: Número de mensajes de conexión enviados por el proceso.
fr: Nombre de messages envoyés par le processus sur une socket.
it: Numero di messaggi di socket inviati dal processo.

source: Number of signals delivered to the process.
es: Número de señales entregadas al proceso.
fr: Nombre de signaux délivrés au processus.
it: Numero di segnali recapitati al processo.

source: (Not in B<tcsh>(1).) Name and command-line arguments of the command being timed.
es: (No aparece en B<tcsh>(1).) Nombre y argumentos en línea de órdenes de la orden temporizada.
fr: (pas avec B<tcsh>(1).) Nom de la commande examinée avec ses arguments.
it: (Non in B<tcsh>(1).) Nome e argomenti da riga di comando del comando che è stato misurato.

source: (Not in B<tcsh>(1).) Exit status of the command.
es: (No aparece en B<tcsh>(1).) Estado de salida de la orden.
fr: (pas avec B<tcsh>(1).) Code de retour de la commande.
it: (Non in B<tcsh>(1).) Stato di uscita del comando.

source: GNU options
es: Opciones de GNU
fr: Options GNU
it: Opzioni GNU

source: B<-f >I<format>B<, --format=>I<format>
es: B<-f >I<formato>B<, --format=>I<formato>
it: B<-f >I<formato>B<, --format=>I<formato>

source: Specify output format, possibly overriding the format specified in the environment variable TIME.
es: Especificar el formato de salida, posiblemente redefiniendo el formato especificado en la variable de entorno TIME.
fr: Préciser le format de sortie, en écrasant celui mentionné éventuellement dans la variable d'environnement TIME.
it: Specifica il formato di output, possibilmente sovrascrivendo il formato specificato nella variabile d'ambiente TIME.

source: Use the portable output format.
es: Usar el formato de salida transportable.
fr: Utiliser le format de sortie portable.
it: Usa il formato di output portabile.

source: B<-o >I<file>B<, --output=>I<file>
es: B<-o >I<archivo>B<, --output=>I<archivo>
fr: B<-o >I<fichier>B<, --output=>I<fichier>

source: Do not send the results to I<stderr>, but overwrite the specified file.
es: No enviar los resultados a I<stderr>, sino sobreescribir el fichero especificado.
fr: Ne pas envoyer les résultats sur la sortie d'erreur standard, mais écraser le fichier indiqué.
it: Non invia i risultati a I<stderr>, ma sovrascrive il file specificato.

source: (Used together with -o.) Do not overwrite but append.
es: (Usado en conjunción con -o.) No sobreescribir, sino añadir al final.
fr: En conjonction avec -o, ne pas écraser le fichier, mais ajouter les résultats à la fin.
it: (Usato assieme a -o.) Non sovrascrive ma aggiunge.

source: Give very verbose output about all the program knows about.
es: Ofrece una salida detallada sobre todo lo que el programa conoce.
fr: Afficher des informations concernant le programme.
it: Fornisce un output con molti dettagli su tutto ciò che il programma sa.

source: Don't report abnormal program termination (where I<command> is terminated by a signal) or nonzero exit status.
es: No informa de un final inesperado del programa (cuando I<orden> finaliza al recibir una señal) o con un estdo de salida distinto de cero.
fr: Ne pas signaler quand le programme se termine de manière anormale (quand I<commande> se termine avec un signal) ou avec un code de retour autre que zéro.
it: Non riporta l'interruziona anomala del programma (dove I<comando> è stato interrotto da un segnale) o da uno stato d'uscita diverso da zero.

source: GNU standard options
es: Opciones estándar de GNU
fr: Options standard GNU
it: Opzioni GNU standard

source: Print a usage message on standard output and exit successfully.
es: Muestra un mensaje en la salida estándar sobre el modo de empleo y acaba con código de éxito.
fr: Afficher un message d'aide sur la sortie standard et terminer normalement.
it: Stampa un messaggio di uso sullo standard output ed esce con successo.

source: Print version information on standard output, then exit successfully.
es: Muestra en la salida estándar información sobre la versión, y luego acaba con código de éxito.
fr: Afficher le numéro de version sur la sortie standard et terminer normalement.
it: Stampa informazioni sulla versione sullo standard output ed esce con successo.

source: Terminate option list.
es: Termina la lista de opciones.
fr: Terminer la liste des options.
it: Termina l'elenco delle opzioni.

source: BUGS
es: ERRORES
fr: BOGUES
it: BUG

source: Not all resources are measured by all versions of UNIX, so some of the values might be reported as zero. The present selection was mostly inspired by the data provided by 4.2 or 4.3BSD.
es: No todos los recursos son medidos por todas las versiones de UNIX, de modo que algunos valores pueden ser devueltos como cero. La selección presente fue mayormente inspirada por los datos suministrados por 4.2 o 4.3BSD.
fr: Toutes les ressources ne sont pas disponibles avec toutes les versions d'UNIX, ainsi certaines valeurs peuvent être toujours à zéro. La sélection proposée a été essentiellement inspirée des données disponibles sur des systèmes BSD\ 4.2 ou 4.3.
it: Non tutte le risorse sono misurate da tutte le versioni di Unix, perciò alcuni valori potrebbero essere riportati come zeri. La presente selezione è stata ispirata per la maggior parte dai dati forniti dalle versioni 4.2 o 4.3 di BSD.
