Repository: sebras/manpages-l10n
Catalog: po/*/man1/time.1.po
Languages: es, fr, it

source: GNU time version 1.7 is not yet localized. Thus, it does not implement the POSIX requirements.
es: La versión 1.7 de GNU de time aún no está localizada. De modo que no implementa los requisitos de POSIX.
fr: La version\ 1.7 GNU de time ne supporte pas encore la localisation.
it: GNU time versione 1.7 non è ancora localizzata. Perciò non implementa i requisiti POSIX.

source: The environment variable B<TIME> was badly chosen. It is not unusual for systems like B<autoconf>(1) or B<make>(1) to use environment variables with the name of a utility to override the utility to be used. Uses like MORE or TIME for options to programs (instead of program pathnames) tend to lead to difficulties.
es: La variable de entorno B<TIME> no fue elegida correctamente. No es inusual en sistemas como B<autoconf>(1) o B<make>(1) usar variables de entorno con el nombre de una utilidad para reemplazar la utilidad a usar. Usos como MORE o TIME para opciones a programas (en lugar de nombres de ruta a programas) tiende a llevar a dificultades.
fr: Le choix de la variable d'environnement B<TIME> est une erreur. Il n'est pas rare que des systèmes comme B<autoconf>(1) ou B<make>(1) emploient une variable avec le nom d'un utilitaire pour remplacer l'invocation directe. L'utilisation de noms de variables comme B<MORE> ou B<TIME> au lieu des noms de programmes conduit parfois à des problèmes.
it: La variabile d'ambiente B<TIME> è stata scelta malamente. Non è inusuale per sistemi come B<autoconf>(1) o B<make>(1) usare variabili d'ambiente con il nome di un'utilità per sovrascrivere l'utilità da usare. Usi come MORE o TIME per le opzioni di programmi (invece dei nomi di percorso del programma) tende a generare difficoltà.

source: It seems unfortunate that I<-o> overwrites instead of appends. (That is, the I<-a> option should be the default.)
es: Parece desafortunado que I<-o> sobreescriba en lugar de añadir al final. (Esto es, la opción por defecto debería ser I<-a>.)
fr: Il est plutôt malheureux que I<-o> écrase le fichier plutôt que d'y ajouter ses informations (le comportement de I<-a> devrait être celui par défaut).
it: Sembra sfortunato che I<-o> sovrascriva invece di aggiungere. (Perciò l'opzione I<-a> dovrebbe essere quella predefinita).

source: Mail suggestions and bug reports for GNU B<time> to I<bug-time@gnu.org>. Please include the version of B<time>, which you can get by running
es: Para comunicar sugerencias o errores en B<time>, diríjase a I<bug-time@gnu.org>. Indique la versión de B<time> ejecutando
fr: Envoyez vos suggestions et vos rapports de bogues concernant GNU B<time> à I<bug-time@gnu.org>. Veuillez indiquer la version de B<time> que vous pouvez connaître en invoquant
it: Inviare suggerimenti via posta e rapporti di errore per il comando GNU B<time> a I<bug-time@gnu.org>. Per favore includere la versione di B<time>, che si può ottenere eseguendo

source: and the operating system and C compiler you used.
es: y el sistema operativo y el compilador de C utilizado.
fr: ainsi que le système d'exploitation et le compilateur C utilisés.
it: e il sistema operativo e compilatore C usati.

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI
it: VEDERE ANCHE

source: time - run programs and summarize system resource usage
es: time - temporiza la ejecución de una orden e informa del uso del sistema
fr: time - Lancer des programmes et résumer l'utilisation des ressources du système
it: time - esegue programmi e riepiloga l'uso delle risorse di sistema

source: [ B<-apqvV> ] [ B<-f>I< FORMAT> ] [ B<-o>I< FILE> ]
es: [ B<-apqvV> ] [ B<-f>I< FORMATO> ] [ B<-o>I< ARCHIVO> ]
fr: [ B<-apqvV> ] [ B<-f>I< FORMAT> ] [ B<-o>I< FICHIER> ]
it: [ B<-apqvV> ] [ B<-f>I< FORMATO> ] [ B<-o>I< FILE> ]

source: [ B<--format=>I<FORMAT> ] [ B<--output=>I<FILE> ] [ B<--version> ]
es: [ B<--format=>I<FORMATO> ] [ B<--output=>I<ARCHIVO> ] [ B<--version> ]
fr: [ B<--format=>I<FORMAT> ] [ B<--output=>I<FICHIER> ] [ B<--version> ]
it: [ B<--format=>I<FORMATO> ] [ B<--output=>I<FILE> ] [ B<--version> ]

source: [ B<--help> ] I<COMMAND> [ I<ARGS> ]
es: [ B<--help> ] I<ORDEN> [ I<ARGS> ]
fr: [ B<--help> ] I<COMMANDE> [ I<PARAMS> ]
it: [ B<--help> ] I<COMANDO> [ I<ARGOMENTI> ]

source: B<time> run the program I<COMMAND> with any given arguments I<ARG...>. When I<COMMAND> finishes, B<time> displays information about resources used by I<COMMAND> (on the standard error output, by default). If I<COMMAND> exits with non-zero status, B<time> displays a warning message and the exit status.
es: B<time> ejecuta una orden con cualquier opción I<ARGS> que se le añada. Una vez que I<ORDEN> termina, B<time> nos muestra (por defecto a través de la salida de error estándar) el informe de los recursos empleados por esta I<ORDEN>. en caso de que finalice son un estado de salida diferente a cero, B<time> mostrará un aviso y el código de ese estado de salida.
fr: B<time> lance un programme I<COMMANDE> avec des paramètres I<PARAM...> donnés. Quand I<COMMANDE> se termine, B<time> affiche des informations sur les ressources utilisées par I<COMMANDE> (par défaut, sur la sortie d'erreur standard). Si I<COMMANDE> quitte avec un autre retour que zéro, B<time> affiche un message d'avertissement et le code de retour.
it: B<time> esegue il progamma I<COMANDO> con gli argomenti I<ARGOMENTO...>. Quando I<COMANDO> termina, B<time> mostra informazioni sulle risorse usate da I<COMANDO> (per impostazione predefinita, sullo standard error). Se I<COMANDO> esce con uno stato diverso da zero, B<time> mostra un messaggio di avvertimento e lo stato d'uscita.

source: B<time> determines which information to display about the resources used by the I<COMMAND> from the string I<FORMAT>. If no format is specified on the command line, but the B<TIME> environment variable is set, its value is used as the format. Otherwise, a default format built into B<time> is used.
es: B<time> utliza la cadena I<FORMATO> para decidir qué información mostrar acerca de la ejecución de I<ORDEN>. Si no se especifica ningún formato junto a la orden, se usará el valor de la variable de entorno B<TIME> y si no está definida, B<time> usará el formato por defecto.
fr: B<time> détermine les informations à afficher sur les ressources utilisées par la I<COMMANDE> à partir de la chaîne I<FORMAT>. Si aucun format n'est indiqué sur la ligne de commande mais que la variable d'environnement B<TIME> est positionnée, sa valeur est utilisée pour le format. Sans cela, un format par défaut interne à B<time> est utilisé.
it: B<time> stabilisce quali informazioni mostrare sulle risorse usate dal I<COMANDO> prendendole dalla stringa I<FORMATO>. Se non è specificato un formato sulla riga di comando, ma la variabile d'ambiente B<TIME> è impostata, viene usato questo valore come formato. Altrimenti viene usato un formato predefinito precompilato in B<time>

source: Options to B<time> must appear on the command line before I<COMMAND>. Anything on the command line after I<COMMAND> is passed as arguments to I<COMMAND>.
es: Las opciones de la orden B<time> tienen que indicarse antes de I<ORDEN> ya que todo lo que vaya después se entiende como opciones de ésta última orden.
fr: Les otpions de B<time> doivent apparaître sur la ligne de commande avant I<COMMANDE>. Tout ce qui vient après I<COMMANDE> sur la ligne de commande est un paramètre de I<COMMANDE>.
it: Le opzioni di B<time> devono comparire sulla riga di comando prima di I<COMANDO>. Tutto ciò che sulla riga di comando compare dopo è passato come argomento a I<COMANDO>.

source: B<-o>I< FILE, >B<--output=>I<FILE >
es: B<-o>I< ARCHIVO, >B<--output=>I<ARCHIVO >
fr: B<-o>I< FICHIER, >B<--output=>I<FICHIER >

source: Write the resource use statistics to I<FILE> instead of to the standard error stream. By default, this overwrites the file, destroying the file's previous contents. This option is useful for collecting information on interactive programs and programs that produce output on the standard error stream.
es: Escribe la salida en I<ARCHIVO> en lugar de hacerlo en la salida de error estándar sobreescribiendo el fichero si existiese. Esta opción es útil pasa utilizar en programas interactivos y en aquellos que envían datos a la salida de error estándar.
fr: Écrire les statistiques de l'utilisation des ressources dans I<FICHIER> au lieu du flux de la sortie standard. Par défaut, cela écrase le fichier, détruisant son contenu précédent. Cette option sert à récupérer des informations sur des programmes interactifs ou qui produisent un affichage sur la sortie d'erreur standard.
it: Scrive le statistiche sull'uso delle risorse su I<FILE> invece che sullo standard error. Per impostazione predefinita, questo sovrascrive il precedente contenuto del file. Quest'opzione è utile per raccogliere informazioni su programmi interattivi e su programmi che producono risultati sul canale standard error.

source: Append the resource use information to the output file instead of overwriting it. This option is only useful with the `-o' or `--output' option.
es: Añade la salida al archivo en lugar de sobreescribirlo. Esta opción solo se puede usar conjuntamente con `-o' o con `--input'.
fr: Mettre les informations de l'utilisation des ressources à la fin du fichier de sortie au lieu de l'écraser. Cette option n'est utile qu'avec l'option « -o » ou « --output ».
it: Aggiunge le informazioni sull'uso delle risorse nel file in output invece di sovrascriverle. Quest'opzione è utile solo con l'opzione `-o' o `--output' .

source: B<-f>I< FORMAT, >B<--format>I< FORMAT >
es: B<-f>I< FORMATO, >B<--format>I< FORMATO >
it: B<-f>I< FORMATO, >B<--format>I< FORMATO >

source: Use I<FORMAT> as the format string that controls the output of B<time>. See the below more information.
es: Utiliza I<FORMATO> para definir el formato en que se muestra la salida de B<time>. Más adelante se explica en detalle.
fr: Utiliser I<FORMAT> comme chaîne de formatage pour contrôler l'affichage de B<time>. Voir les informations ci-dessous.
it: Usa I<FORMATO> come stringa di formato che controlla il risultato di B<time>. Si vedano ulteriori informazioni più avanti.

source: Print a summary of the command line options and exit.
es: Imprime un resumen las las opciones existentes y termina.
fr: Afficher un résumé des options de la ligne de commande et quitter.
it: Stampa una sintesi delle opzioni della riga di comando ed esce.

source: Use the following format string, for conformance with POSIX standard 1003.2: real %e user %U sys %S
es: Utiliza el siguiente formato para adecuarse al estándar POSIX 1003.2: real %e user %U sys %S
fr: Utiliser la chaîne de format suivante conformément au standard POSIX 1003.2 : real %e user %U sys %S
it: Usa la seguente stringa di formato, per conformità con lo standard POSIX 1003.2: real %e user %U sys %S

source: Use the built-in verbose format, which displays each available piece of information on the program's resource use on its own line, with an English description of its meaning.
es: Utiliza su propio formato prolijo que muestra cada uno de los datos disponibles acerca del uso de recursos del programa en su propia línea. Se añade una descripción en inglés sobre su significado.
fr: Utiliser le format d'affichage interne qui affiche toute les informations disponibles sur l'utilisation des ressources par le programme sur une ligne dédiée, avec une description en anglais de sa signification.
it: Usa il formato verboso precompilato, che mostra ogni informazione disponibile sull'uso delle risorse del programma, ognuna su una propria riga, con una descrizione in inglese del suo significato.

source: Do not report the status of the program even if it is different from zero.
es: No muestra el estado de salida del programa aunque sea distinto de cero.
fr: Ne pas renvoyer l'état du programme même s'il n'est pas zéro.
it: Non riporta lo stato del programma anche se è diverso da zero.

source: Print the version number of B<time> and exit.
es: Muestra la versión de B<time> y termina.
fr: Afficher le numéro de version de B<time> et quitter.
it: Stampa il numero di versione del programma ed esce.

source: FORMATTING THE OUTPUT
es: FORMATO DE SALIDA
fr: FORMATAGE DE LA SORTIE
it: FORMATTARE L'OUTPUT

source: The format string I<FORMAT> controls the contents of the B<time> output. The format string can be set using the `-f' or `--format', `-v' or `--verbose', or `-p' or `--portability' options. If they are not given, but the I<TIME> environment variable is set, its value is used as the format string. Otherwise, a built-in default format is used. The default format is: %Uuser %Ssystem %Eelapsed %PCPU (%Xtext+%Ddata %Mmax)k %Iinputs+%Ooutputs (%Fmajor+%Rminor)pagefaults %Wswaps
es: La cadena I<FORMATO> define el contenido de la salida de B<TIME> Este formato se puede definir mediante las opciones `-f' o `--format', `-v' o `--verbose', o bien `-p' o `--portability'. Si no se da ninguna de estas opciones pero sí se define la variable de entorno I<time> se usará su valor. Por defecto, el formato es el siguiente: %Uuser %Ssystem %Eelapsed %PCPU (%Xtext+%Ddata %Mmax)k %Iinputs+%Ooutputs (%Fmajor+%Rminor)pagefaults %Wswaps
fr: La chaîne de format I<FORMAT> contrôle le contenu de la sortie de B<time>. La chaîne de format peut être définie en utilisant les options « -f » ou « --format », « -v » ou « --verbose », « -p » ou « --portability ». Si elles ne sont pas données mais si la variable d'environnement « TIME » est positionnée, sa valeur est utilisée pour le formatage. Sans cela, un format par défaut interne à B<time> est utilisé. Le format par défaut est : %Uuser %Ssystem %Eelapsed %PCPU (%Xtext+%Ddata %Mmax)k %Iinputs+%Ooutputs (%Fmajor+%Rminor)pagefaults %Wswaps
it: La stringa di formato I<FORMATO> controlla il contenuto dell'output di B<time>. La strinfa di formato può essere impostata usando le opzioni `-f' o `--format', `-v' o `--verbose', o `-p' o `--portability'. se queste non sono fornite, ma è impostata la variabile d'ambiente IR<TIME> , il suo valore è usato come stringa di formato. Altrimenti, viene usato un formato predefnito precompilato. Il formato predefinito è: %Uuser %Ssystem %Eelapsed %PCPU (%Xtext+%Ddata %Mmax)k %Iinputs+%Ooutputs (%Fmajor+%Rminor)pagefaults %Wswaps

source: The format string usually consists of `resource specifiers' interspersed with plain text. A percent sign (`%') in the format string causes the following character to be interpreted as a resource specifier, which is similar to the formatting characters in the B<printf>(3) function.
es: La cadena de formato suele estar formada por `especificadores de recursos' intercalados entre el resto de la cadena. El símbolo de porcentaje (`%') en la cadena hará que el siguiente carácter sea interpretado como uno de esos especificadores de recursos. Esto es muy parecido al formato de la función B<printf>.
fr: La chaîne de formatage consiste généralement dans des « spécificateurs de ressource » interprétés en texte brut. Un signe pour-cent (« % ») dans la chaîne de formatage fait interpréter les caractères consécutifs comme un spécificateur de ressource, ce qui revient aux caractères de formatage de la fonction B<printf>(3).
it: La stringa di formato generalmente consiste di 'specificatori di risorse' frammiste a testo normale. Un segno di percentuale (`%') nella stringa di f ormato fa interpretare il carattere che segue come specificatore di risorsa, che è simile ai caratteri di formattazione della funzione B<printf>(3) .

source: A backslash (`\e') introduces a `backslash escape', which is translated into a single printing character upon output. `\et' outputs a tab character, `\en' outputs a newline, and `\e\e' outputs a backslash. A backslash followed by any other character outputs a question mark (`?') followed by a backslash, to indicate that an invalid backslash escape was given.
es: Una barra invertida (`\e') hará que se interprete el caracter siguiente imprimiéndose un único carácter. Así, `\et' imprime una tabulación, `\en' imprime un salto de línea y `\e\e' imprimirá una barra invertida. Si ponemos cualquier otro caracter a continuación de la barra invertida, saldrá un interrogante (`?') seguido de una barra invertida para indicarnos que insertamos una secuencia de escape inválida.
fr: Une barre oblique inversée (« \ ») introduit une séquence d'échappement traduite en un seul caractère affichable sur la sortie. « \et » génère une tabulation, « \en » un retour à la ligne, « \e\e » une barre oblique inversée. Une barre oblique inversée suivie d'un autre caractère affiche un point d'interrogation (« ? ») suivi d'une barre oblique pour indiquer qu'une séquence d'échappement non valide a été donnée.
it: Una barra rovesciata dichiara una sequenza di protezione (backslash escape), che viene tradotta in un solo carattere di stampa sull'output. `\et' dà come risultato un carattere di tabulazione, `\en' un ritorno a capo, e `\e\e' una barra rovesciata. Una barra rovesciata seguita da qualsiasi altro carattere dà come risultato un punto interrogativo ('?') seguito da una barra rovesciata, per indicare che è stata data una sequenza di protezione non valida.

source: Other text in the format string is copied verbatim to the output. B<time> always prints a newline after printing the resource use information, so normally format strings do not end with a newline character (or `\en').
es: Cualquier otra cadena de texto se enviará directamente a la salida. B<time> siempre imprime un salto de línea seguidamente a la información que nos da por lo que las cadenas de formato no suelen terminar con un salto de línea (`\en').
fr: Tout autre texte dans la chaîne de formatage est copié tel quel sur la sortie. B<time> affiche toujours un retour à la ligne après les informations sur l'utilisation des ressources, donc en principe, les chaînes de formatage ne se terminent pas par un caractère de retour à la ligne (« \en »).
it: Ulteriote teso nella stringa di formato è copiato letteralmente nell'output. B<time> stampa sempre un carattere di newline alla fine della stampa delle informaizoni sull'uso dele risorse, per cui normalmente le stringhe di formato non finiscono con un caratter di newline (o `\en').

source: There are many resource specifications. Not all resources are measured by all versions of Unix, so some of the values might be reported as zero. Any character following a percent sign that is not listed in the table below causes a question mark (`?') to be output, followed by that character, to indicate that an invalid resource specifier was given.
es: Existen varios especificadores de recursos y no todos están disponibles en todas las versiones de Unix por lo algunos de sus valores estarán están siempre a cero. Cualquier carácter que pongamos a continuación del símbolo de porcentaje y que no aparezca en la tabla a continuación se traducirá en un interrogante (`?') al imprimir el resultado para indicar que se introdujo un especificador de recursos no válido.
fr: Il existe de nombreuses spécifications des ressources. Toutes les ressources ne sont pas examinées par toutes les versions d'Unix, donc certaines valeurs pourraient renvoyer zéro. Tout caractère après un signe pour-cent non listé dans le tableau ci-dessous affiche un point d'interrogation (« ? ») suivi du caractère, pour indiquer qu'un spécificateur de ressource non valide a été fourni.
it: Ci sono molte specifiche di risorsa. Non tutte le risorse sono misurate da tutte le versioni di Unix, per cui alcuni dei valori vengono riportati come zero. Qualsiasi carattere che segue un segno di percentuale che non è elencato nella tabella qui sotto dà come risultato un punto interrogativo, seguito da quel carattere, per indicare che è stato dato uno specificatore di risorsa non valido.

source: The resource specifiers, which are a superset of those recognized by the B<tcsh>(1) builtin `time' command, are:
es: Los especificadores de recursos, conjunto superior de aquellos reconocidos por la orden `time' propia de B<tcsh> son lo siguientes:
fr: Les spécificateurs de ressources, qui vont plus loin que ceux reconnus par la commande « time » de B<tcsh>(1), sont :
it: Gli specificatori di risorsa, che sono un soprainsieme di quelli riconosciuti dal comando precompilato `time' di B<tcsh>(1), sono:

source: A literal `%'.
es: Símbolo literal `%'.
fr: Un signe « % » littéral.
it: Un '%' letterale.

source: Name and command line arguments of the command being timed.
es: Nombre y argumentos en línea de órdenes de la orden temporizada.
fr: Nom et arguments de la ligne de commande de la commande à examiner.
it: Nome e argomenti da riga di comando del comando che è stato misurato.

source: Average size of the process's unshared data area, in Kilobytes.
es: Tamaño aproximado del área de datos no compartida del proceso, en Kilobytes.
fr: Taille moyenne des données non partagées du processus, en kilooctets.
it: Dimensione media delle aree dati non condivise dei processi, in chilobyte.

source: Elapsed real (wall clock) time used by the process, in [hours:]minutes:seconds.
es: Tiempo real total empleado por el proceso (medido en [horas:]minutos:segundos).
fr: Temps réel (de la pendule) mis par le processus, en [heures:]minutes:secondes.
it: Tempo reale (quel che mostra l'orologio a muro) trascorso usato dal processo, (in [ore:]minuti:secondi).

source: Number of major, or I/O-requiring, page faults that occurred while the process was running. These are faults where the page has actually migrated out of primary memory.
es: Número de faltas de página principales o de solicitudes de I/O que ocurrieron mientras el proceso se ejecutaba. Estas son faltas en las que la página debe ser leída desde disco.
fr: Nombre d'erreurs majeures ou exigeant une E/S qui se sont produites durant l'exécution du processus. Il s'agit d'erreurs par lesquelles la page est sortie de la mémoire primaire.
it: Numero di errori di pagina, maggiori o che richiedono I/O, accaduti durante il funzionamento del processo. Sono errori in cui la pagina è effetivamente portata fuori dalla memoria primaria.

source: Number of file system inputs by the process.
es: Número de entradas al sistema de archivos por el proceso.
fr: Nombre d'entrées dans le système de fichiers par le processus.
it: Numero di input del processo nel filesystem.

source: Average total (data+stack+text) memory use of the process, in Kilobytes.
es: Uso de memoria total aproximado (datos+pila+texto) del proceso, en Kilobytes.
fr: Mémoire moyenne (donnée + pile + code) utilisée par le processus, en kilooctets.
it: Media totale (data+stack+text) della memoria usata dal processo, in chilobyte.

source: Maximum resident set size of the process during its lifetime, in Kilobytes.
es: Conjunto máximo residente del proceso durante su tiempo de vida, en Kilobytes.
fr: Taille maximale du processus en mémoire physique durant son exécution, en kilooctets.
it: Massima dimensione dell'insieme residente del processo durante la sua esistenza, in chilobyte.

source: Number of file system outputs by the process.
es: Número de salidas al sistema de archivos por el proceso.
fr: Nombre de sorties du système de fichiers par le processus.
it: Numero di output del processo nel filesystem.
