Repository: sebras/manpages-l10n
Catalog: po/*/man1/time.1.po
Languages: es, fr, it

source: Percentage of the CPU that this job got. This is just user + system times divided by the total running time. It also prints a percentage sign.
es: Porcentaje de CPU empleado para finalizar la tarea. Es el resultado de la suma de usuario y sistema dividido entre el tiempo total de ejecución. También imprime el símbolo de porcentaje.
fr: Pourcentage du processeur utilisé par ce processus. Il s'agit des temps utilisateur + système divisés par le temps total d'exécution. Il affiche aussi un signe de pourentage.
it: Percentuale di CPU che questo lavoro ha preso. Questa è conteggiata come tempo consumato dall'utente + tempo consumato dal sistema diviso per il tempo totale. Stampa anche un segno di percentuale.

source: Number of minor, or recoverable, page faults. These are pages that are not valid (so they fault) but which have not yet been claimed by other virtual pages. Thus the data in the page is still valid but the system tables must be updated.
es: Número de faltas de página menores o recuperables. Estas son faltas inválidas pero que no han sido reclamadas aún por otras páginas virtuales. De este modo, los datos en la página son todavía válidos, pero las tablas de sistema deben actualizarse.
fr: Nombre d'erreurs de pages mineures ou rattrapables. Ce sont les erreurs où des pages ne sont plus valides (et donc sont des erreurs), mais n'ont pas encore été remplacées par d'autres pages virtuelles. Les données y sont encore présentes et seules les tables système doivent être mises à jour.
it: Numero di errori minori di pagina, o recuperabili. Sono errori per pagine che non sono valide ma che non sono ancora state reclamate da altre pagine virtuali. Di conseguenza il dato nella pagina è ancora valido, ma le tabelle di sistema devono venire aggiornate.

source: Total number of CPU-seconds used by the system on behalf of the process (in kernel mode), in seconds.
es: Número total de segundos de CPU que el proceso consumió en modo de núcleo.
fr: Nombre total de secondes-CPU passées par le système du fait du processus (en mode noyau).
it: Numero totale di secondi-CPU usati dal sistema per conto del processo (in kernel mode), in secondi.

source: Total number of CPU-seconds that the process used directly (in user mode), in seconds.
es: Número total de segundos de CPU que el proceso consumió en modo de usuario.
fr: Nombre total de secondes-CPU passées directement par le processus (en mode utilisateur).
it: Numero totale di secondi-CPU che il processo ha usato direttamente (in user mode), in secondi.

source: Average amount of shared text in the process, in Kilobytes.
es: Tamaño aproximado del espacio de texto compartido del proceso, en KBytes.
fr: Taille moyenne du code partagé du processus, en kilooctets.
it: Dimensione media dello spazio di testo condiviso nel processo, in chilobyte.

source: System's page size, in bytes. This is a per-system constant, but varies between systems.
es: Tamaño de página del sistema, en KBytes. Esto es una constante del sistema, pero varía entre un sistema y otro.
fr: Taille de page du système, en octets. Cela est une constante sur un système, mais varie de système en système.
it: Dimensione della pagina di sistema, in byte. Questa è una costante di sistema, ma varia tra i sistemi.

source: Elapsed real (wall clock) time used by the process, in seconds.
es: Tiempo total empleado por el proceso en segundos.
fr: Temps réel (sur la pendule) écoulé consommé par le processus, en secondes.
it: Tempo reale (quel che mostra l'orologio a muro) trascorso usato dal processo, in secondi.

source: Average unshared stack size of the process, in Kilobytes.
es: Tamaño medio de memoria no compartida del proceso en kilobytes.
fr: Taille moyenne de la pile non partagée du processus, en kilooctets.
it: Dimensione media dello spazio stack non condiviso del processo in chilobyte.

source: Average resident set size of the process, in Kilobytes.
es: Tamaño aproximado del conjunto residente del proceso, en Kilobytes.
fr: Taille moyenne du processus en mémoire physique, en kilooctets.
it: Dimensione media dell'insieme residente del processo, in chilobyte.

source: Number of times that the program was context-switched voluntarily, for instance while waiting for an I/O operation to complete.
es: Número de veces que el programa fue intercambiado de contexto voluntariamente, por ejemplo, mientras se espera a que se complete una operación de E/S.
fr: Nombre de fois où le processus a été commuté volontairement, en passant en attente par exemple de la fin d'une entrée-sortie.
it: Numero di volte che il programma è stato scambiato volontariamente nel contesto, per esempio mentre era in attesa del completamente di un'operazione di I/O.

source: Exit status of the command.
es: Estado de salida de la orden.
fr: Code de retour de la commande.
it: Stato di uscita del comando.

source: EXAMPLES
es: EJEMPLOS
fr: EXEMPLES
it: ESEMPI

source: To run the command `wc /etc/hosts' and show the default information: time wc /etc/hosts
es: Para ejecutar la orden 'wc /etc/hosts' y ver la información por defecto: time wc /etc/hosts
fr: Pour lancer la commande « wc /etc/hosts » et afficher les informations par défaut : time wc /etc/hosts
it: Per eseguire il comando `wc /etc/hosts' e mostrare le informazioni predefinite: time wc /etc/hosts

source: To run the command `ls -Fs' and show just the user, system, and total time: time -f "\et%E real,\et%U user,\et%S sys" ls -Fs
es: Temporización de la orden `ls -Fs' mostrando solo el usuario, el sistema y la totalización time: time -f "\et%E real,\et%U user,\et%S sys" ls -Fs
fr: Pour lancer la commande « ls -Fs » et afficher le temps d'utilisateur, du système et total : time -f "\et%E real,\et%U user,\et%S sys\" ls -Fs
it: Per eseguire il comando `ls -Fs' e mostrare solo il tempo consumato dall'utente, dal sistema e il tempo totale: time -f "\et%E real,\et%U user,\et%S sys" ls -Fs

source: To edit the file BORK and have `time' append the elapsed time and number of signals to the file `log', reading the format string from the environment variable `TIME': export TIME="\et%E,\et%k" # If using bash or ksh setenv TIME "\et%E,\et%k" # If using csh or tcsh time -a -o log emacs bork
es: Para editar el archivo BORK y que `time' añade el tiempo transcurrido y el código de las señales al archivo `log' tomando el formato de la variable de entorno `TIME': export TIME="\et%E,\et%k" # Si usa la shell bash o ksh setenv TIME "\et%E,\et%k" # Si usa csh or tcsh time -a -o log emacs bork
fr: Pour éditer le fichier FOFO et que « time » indique le temps écoulé et le nombre de signaux dans le fichier « journal » (log), en lisant la chaîne de formatage depuis la variable d'environnement « TIME » : export TIME="\et%E,\et%k" # Si on utilise bash ou ksh setenv TIME "\et%E,\et%k" # Si on utilise csh ou tcsh time -a -o log emacs fofo
it: Per editare il file BORK e aggiungere il tempo trascorso e il numero di segnali al file `log', leggendo la stringa di formato dalla variabile d'ambiente `TIME': export TIME="\et%E,\et%k" # se si usa bash o ksh setenv TIME "\et%E,\et%k" # se si usa csh o tcsh time -a -o log emacs bork

source: Users of the B<bash> shell need to use an explicit path in order to run the external B<time> command and not the shell builtin variant. On system where B<time> is installed in I</usr/bin>, the first example would become /usr/bin/time wc /etc/hosts
es: Los usuarios de la shell B<bash> necesitan indicar expresamente la ruta para ejecutar la orden externa B<time> sino se ejecutará la que viene incluida en la propia shell. En los sistemas donde esté instalado en I</usr/bin>, el primer ejemplo sería /usr/bin/time wc /etc/hosts
fr: Les utilisateurs de l'interpréteur B<bash> doivent utiliser un chemin explicite pour lancer une commande B<time> externe, et non la variante de la commande interne à l'interpréteur. Sur un système où B<time> est installé dans I</usr/bin>, le premier exemple deviendrait /usr/bin/time wc /etc/hosts
it: Gli utenti della shell B<bash> devono usare un percorso esplicito per eseguire il comando esterno B<time> e non la variante precompilata della shell. Sui sistemi in cui B<time> è installato in I</usr/bin>, il primo esempio diventerebbe /usr/bin/time wc /etc/hosts

source: ACCURACY
es: EXACTITUD
fr: ATTENTION
it: PRECISIONE

source: The elapsed time is not collected atomically with the execution of the program; as a result, in bizarre circumstances (if the B<time> command gets stopped or swapped out in between when the program being timed exits and when B<time> calculates how long it took to run), it could be much larger than the actual execution time.
es: El tiempo transcurrido no se recoge de forma separada para la ejecución del programa por lo que, aunque improbable, puede ocurrir que se registre un tiempo mucho mayor que el real. Esto se daría si B<time> se detiene o se reinicia en el transcurso de la temporización.
fr: Le temps écoulé n'est pas calculé de manière atomique pendant l'exécution du programme ; donc dans des circonstances étranges (si la commande B<time> s'est arrêtée ou s'est mélangée entre le temps de fin du programme et celui passé par B<time> à calculer), il pourrait être beaucoup plus important que le temps d'exécution réel.

source: When the running time of a command is very nearly zero, some values (e.g., the percentage of CPU used) may be reported as either zero (which is wrong) or a question mark.
es: Cuano el tiempo de ejecución de una orden es casi nulo, algunos valores como el porcentaje de CPU empleado puede salir a cero o con un interrogante.
fr: Quand le temps d'exécution d'une commande est proche de zéro, certaines valeurs (comme le pourcentage de processeur utilisé) pourraient afficher zéro (ce qui est faux) ou un point d'interrogation.
it: Quando il tempo di esecuzione di un comando è molto prossimo a zero, alcuni valori (p.es. la percentuale di CPU usata) può essere riportato o come zero (il che è errato) o con un punto interrogativo.

source: Most information shown by B<time> is derived from the B<wait3>(2) system call. The numbers are only as good as those returned by B<wait3>(2). On systems that do not have a B<wait3>(2) call that returns status information, the B<times>(2) system call is used instead. However, it provides much less information than B<wait3>(2), so on those systems B<time> reports the majority of the resources as zero.
es: La mayor parte de la información dada por B<time> proviene de la llamada del sistema B<wait3>(2), por lo que ésta será tan exacta como lo sea B<wait3>(2). En lo sistemas que no tengan esa llamada B<wait3>(2), se usará en su lugar B<time>(2) aunque aporte muchos menos datos y se pueden ver la mayoría de ellos a cero.
fr: La plupart des informations affichées par B<time> proviennent de l'appel système B<wait3>(2). Les chiffres sont aussi bons que ceux renvoyés par B<wait3>(2). Sur des systèmes n'ayant pas l'appel B<wait3>(2) pour renvoyer des informations d'état, l'appel système B<times>(2) est utilisé à la place. Il fournit toutefois beaucoup moins d'informations que B<wait3>(2), donc sur de tels systèmes, B<time> indique la majorité des informations comme étant de zéro.
it: La maggior parte delle informazioni mostrate da B<time> deriva dalla chiamata di sistema B<wait3>(2). I numeri dipendono da quelli restituiti da B<wait3>(2). Su sistemi che non hanno la chiamata B<wait3>(2) che restituisce informazioni sullo stato, viene usata la chiamata di sistema B<times>(2), checomunque fornisce molte meno informazioni di B<wait3>(2), per cui sui queisistemi B<time> riporta la maggior parte delle risorse come zero.

source: The `%I' and `%O' values are allegedly only `real' input and output and do not include those supplied by caching devices. The meaning of `real' I/O reported by `%I' and `%O' may be muddled for workstations, especially diskless ones.
es: Los valores `%I' y `%O' supuestamente correponden únicamente a entrada/salida `real' sin incluir los de los dispositivos de almacenamiento de caché. El significado de I/O `real' puede resultar confuso sobretodo en el caso de aquellas sin disco.
fr: Les valeurs « %I » et « %O » sont censées n'être que des entrées et sorties « réelles » et elles n'incluent pas celles fournies par les périphériques de mise en cache. Le sens des valeurs E/S « réelles » indiquées par « %I » et « %O » peut être mélangé sur les stations de travail, surtout celles sans disque.

source: DIAGNOSTICS
es: DIAGNÓSTICOS
it: DIAGNOSTICA

source: The B<time> command returns when the program exits, stops, or is terminated by a signal. If the program exited normally, the return value of B<time> is the return value of the program it executed and measured. Otherwise, the return value is 128 plus the number of the signal which caused the program to stop or terminate.
es: La orden B<time> nos da información cuando el programa sale, termina por si solo o porque recibe alguna señal. Si el programa termina normalmente, B<time> nos dará la salida del programa que analizó. Si no es así, nos dará un valor de salida de 128 más el número de señal que provocó la finalización del programa.
fr: La commande B<time> signale quand le programme quitte, s'arrête ou quand un signal de fin lui est envoyé. Si le programme quitte normalement, le code de retour de B<time> est celui du programme exécuté et analysé. Sinon, le code de retour est 128 et le numéro du signal qui a arrêté ou terminé le programme.
it: Il comando B<time> restituisce risultati quando il programma esce, viene arrestato, o è stato terminato da un segnale. Se il programma esce normalmente, il codice di ritorno di B<time> è il codice di ritorno del programma che è stato eseguito e misurato. Altrimenti, il codice di ritorno è 128 più il numero del segnale che ha causato l'arresto o il termine del programma.

source: AUTHOR
es: AUTOR
fr: AUTEUR
it: AUTORE

source: B<time> was written by David MacKenzie. This man page was added by Dirk Eddelbuettel E<lt>edd@debian.orgE<gt>, the Debian GNU/Linux maintainer, for use by the Debian GNU/Linux distribution but may of course be used by others.
es: B<time> fue escrito por David MacKenzie. Esta página de manual fue añadida por Dirk Eddelbuettel E<lt>edd@debian.orgE<gt> para su uso en Debian GNU/Linux pero puede ser usada por otras distribuciones.
fr: B<time> a été écrit par David MacKenzie. Cette page de manuel a été ajoutée par Dirk Eddelbuettel E<lt>edd@debian.orgE<gt>, le responsable Debian GNU/Linux, pour une utilisation dans la distribution Debian GNU/Linux, mais elle peut bien sûr être utilisée pour les autres.
it: B<time> è stata scritta da David MacKenzie. Questa pagina di manuale è stata aggiunta da Dirk Eddelbuettel E<lt>edd@debian.orgE<gt>, il manutentore di Debian GNU/Linux, per essere usata dalla distribuzione Debian GNU/Linux, ma naturalmente può essere usata anche da altri.

source: Linux User's Manual
es: Manual de Usuario de Linux
fr: Manuel de l'utilisateur Linux
it: Manuale dell'utente Linux

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: B<time [>I<options>B<] >I<command>B< [>I<arguments...>B<] >
es: B<time [>I<opciones>B<] >I<orden>B< [>I<argumentos...>B<] >
it: B<time [>I<opzioni>B<] >I<comando>B< [>I<argomenti...>B<] >

source: The variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC>, and B<NLSPATH> are used for the text and formatting of the output. B<PATH> is used to search for I<command>. The remaining ones for the text and formatting of the output.
es: Las variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> y B<NLSPATH> se usan para dar forma a la salida. B<PATH> se usa para buscar una I<orden>. El resto se usan para el texto y para dar forma a la información que da en programa.
fr: Les variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> et B<NLSPATH> sont utilisées pour le texte et la sortie. B<PATH> sert à rechercher la I<commande>. Les autres servent au formatage du texte et de la sortie.
it: Le variabili B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> e B<NLSPATH> sono usate per il testo e per la formattazione dell'output. B<PATH> è usata per la ricerca del I<comando>. Le rimanenti per il testo e la formattazione dell'output.

source: The format is interpreted in the usual printf-like way. Ordinary characters are directly copied, tab, newline and backslash are escaped using \et, \en and \e\e, a percent sign is represented by %%, and otherwise % indicates a conversion. The program B<time> will always add a trailing newline itself. The conversions follow. All of those used by B<tcsh>(1) are supported.
es: El formato se interpreta de igual modo que de printf. Los caracteres habituales se copian directamente mientras que tabulación, nueva línea y barra invertida se escapan usando \et, \en y \e\e, el signo de porcentaje se representa por %%, % indica una conversión. El programa B<time> añadirá siempre una línea final. A continuación se presentan las conversiones. Es posible el uso de cualquiera de las que emplea B<tcsh>(1).
fr: Le format est interprété comme d'habitude à la manière de B<printf>(3). Les caractères ordinaires sont copiés directement, les tabulations, sauts de lignes et barres obliques inversées (I<backslash>) sont protégés par \et, \en et \e\e. Un signe pourcent est représenté par %%, sinon % indique une conversion. Le programme B<time> ajoutera toujours un saut de ligne à la fin de la sortie. Les conversions se trouvent ci-dessous. Toutes celles utilisées par B<tcsh>(1) sont disponibles.
it: Il formato è interpretato nel solito modo in stile printf. I caratteri ordinari sono copiati direttamente, tab, newline e backslash vengono generati con i caratteri di escape usando \et, \en e \e\e, un segno di percentuale è rappresentato da %%, mentre invece % indica una conversione. Il programma B<time> aggiungerà sempre da sè una newline finale. Seguono le conversioni. Sono supportate tutte quelle usate da B<tcsh>(1).

source: Mail suggestions and bug reports for GNU B<time> to I<bug-utils@prep.ai.mit.edu>. Please include the version of B<time>, which you can get by running
es: Para comunicar sugerencias o errores en GNU B<time>, diríjase a I<bug-utils@prep.ai.mit.edu>. Indique la versión de B<time> ejecutando
it: Inviare suggerimenti via posta e rapporti di errore per il comando GNU B<time> a I<bug-utils@prep.ai.mit.edu>. Per favore includere la versione di B<time>, che si può ottenere eseguendo

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: Linux man-pages (unreleased)
fr: Pages du manuel de Linux (inédites)

source: B<Time>
fr: B<Temps>
it: B<Tempo>

source: B<Memory>
fr: B<Mémoire>
it: B<Memoria>

source: B<-v, --verbose>
fr: B<-v>, B<--verbose>

source: O
fr: B<O>

source: r
fr: B<r>

source: s
fr: B<s>

source: t
fr: B<t>
