Repository: sebras/manpages-l10n
Catalog: po/*/man1/uniq.1.po
Languages: nl, sv

source: User Commands
nl: Opdrachten voor gebruikers
sv: Användarkommandon

source: NAME
nl: NAAM
sv: NAMN

source: uniq - report or omit repeated lines
nl: uniq - rapporteer of filter gedupliceerde regels

source: SYNOPSIS
nl: SAMENVATTING

source: B<uniq> [I<\,OPTION\/>]... [I<\,INPUT \/>[I<\,OUTPUT\/>]]
nl: B<uniq> [I<\,OPTIE\/>]... [I<\,INVOER \/>[I<\,UITVOER\/>]]
sv: B<uniq> [I<\,FLAGGA\/>]... [I<\,INFIL \/>[I<\,UTFIL\/>]]

source: DESCRIPTION
nl: BESCHRIJVING
sv: BESKRIVNING

source: Filter adjacent matching lines from INPUT (or standard input), writing to OUTPUT (or standard output).
nl: Filtert opeenvolgende gedupliceerde regels uit de INVOER (of standaard invoer) en schrijft naar UITVOER (of standaard uitvoer).
sv: Filtrera intilliggande matchande rader från INFIL (eller standard in), skriv till UTFIL (eller standard ut).

source: With no options, matching lines are merged to the first occurrence.
nl: Zonder opties worden identieke regels samengedrukt tot één voorkomen.
sv: Utan flaggor slås matchande rader samman till den första förekomsten.

source: Mandatory arguments to long options are mandatory for short options too.
nl: Een verplicht argument bij een lange optie is ook verplicht voor de korte optie.
sv: Obligatoriska argument till långa flaggor är obligatoriska även för de korta.

source: prefix lines by the number of occurrences
nl: het aantal gelijke regels vooraan de regel zetten
sv: Skriv antalet gånger raden förekom framför raden.

source: only print duplicate lines, one for each group
nl: alleen de regels tonen die meerdere keren voorkomen
sv: Skriv endast repeterade rader, en för varje grupp.

source: print all duplicate lines
nl: alle regels tonen die meerdere keren voorkomen
sv: Skriv ut alla upprepade rader.

source: B<--all-repeated>[=I<\,METHOD\/>]
nl: B<--all-repeated>[=I<\,SCHEIDINGSMETHODE\/>]
sv: B<--all-repeated>[=I<\,METOD\/>]

source: like B<-D>, but allow separating groups with an empty line; METHOD={none(default),prepend,separate}
nl: als B<-D>, maar groepen eventueel scheiden met witregel; SCHEIDINGSMETHODE kan zijn: 'none' (niets, standaard),
sv: Visa alla saker, separera grupper med en tom rad; METOD={separate(standard),prepend,append,both}.

source: avoid comparing the first N fields
nl: de eerste N velden niet vergelijken
sv: Undvik att jämföra de första N fälten.

source: B<--group>[=I<\,METHOD\/>]
nl: B<--group>[=I<\,SCHEIDINGSMETHODE\/>]
sv: B<--group>[=I<\,METOD\/>]

source: show all items, separating groups with an empty line; METHOD={separate(default),prepend,append,both}
nl: alle items tonen; regels scheiden met blanco regel; SCHEIDINGSMETHODE: 'separate' (gescheiden, standaard), 'prepend' (voorvoegen), 'append' (achtervoegen), of 'both' (beide, zowel voor- als achtervoegen)
sv: Visa alla saker, separera grupper med en tom rad; METOD={separate(standard),prepend,append,both}.

source: ignore differences in case when comparing
nl: verschil tussen hoofd- en kleine letters negeren
sv: Ignorera skillnader i skiftläge vid jämförelse.

source: avoid comparing the first N characters
nl: de eerste N tekens niet vergelijken
sv: Undvik jämförelse av de första N tecknen.

source: only print unique lines
nl: alleen unieke regels tonen
sv: Skriv endast unika rader.

source: line delimiter is NUL, not newline
nl: regels afsluiten met 0-byte, niet met nieuweregel
sv: Radavgränsare är NOLL, inte nyrad.

source: compare no more than N characters in lines
nl: niet meer dan N tekens per regel vergelijken
sv: Jämför inte mer än N tecken i rader.

source: display this help and exit
nl: toon de helptekst en stop
sv: Visa denna hjälp och avsluta.

source: output version information and exit
nl: toon programmaversie en stop
sv: Visa versionsinformation och avsluta.

source: A field is a run of blanks (usually spaces and/or TABs), then non-blank characters. Fields are skipped before chars.
nl: Een veld is witruimte (gewoonlijk spaties en/of tabs), daarna tekens die geen witruimte zijn. Eerst worden velden overgeslagen, dan tekens.
sv: Ett fält är en följd av blanka (vanligen mellanslag och/eller tabulatorer) och sedan tecken som ej är blanka. Fält hoppas över före tecken.

source: Note: 'uniq' does not detect repeated lines unless they are adjacent. You may want to sort the input first, or use 'sort B<-u>' without 'uniq'.
nl: Opmerking: 'uniq' detecteert gedupliceerde regels alleen als ze onmiddellijk na elkaar staan; u zou de invoer eerst kunnen sorteren, of 'sort B<-u>' gebruiken zonder 'uniq'.
sv: Obs: B<uniq> upptäcker inte upprepade rader om de inte är efter varandra. Du kanske vill sortera indata först, eller använda B<sort -u> utan B<uniq>.

source: AUTHOR
nl: AUTEUR
sv: UPPHOVSMAN

source: Written by Richard M. Stallman and David MacKenzie.
nl: Geschreven door Richard M. Stallman en David MacKenzie.
sv: Skrivet av Richard M. Stallman och David MacKenzie.

source: REPORTING BUGS
nl: RAPPORTEREN VAN BUGS
sv: RAPPORTERA FEL

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
nl: Online hulp bij GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>
sv: GNU coreutils hjälp på nätet: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report any translation bugs to E<lt>https://translationproject.org/team/E<gt>
nl: Meld alle vertaalfouten op E<lt>https://translationproject.org/team/nl.htmlE<gt>
sv: Rapportera anmärkningar på översättningen till E<lt>tp-sv@listor.tp-sv.seE<gt>.

source: Copyright \(co 2022 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2022 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2022 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
nl: Dit is vrije software: u mag het vrijelijk wijzigen en verder verspreiden. Deze software kent GEEN GARANTIE, voor zover de wet dit toestaat.
sv: Detta är fri programvara: du får fritt ändra och vidaredistribuera den. Det finns INGEN GARANTI, så långt lagen tillåter.

source: SEE ALSO
nl: ZIE OOK
sv: SE OCKSÅ

source: Full documentation E<lt>https://www.gnu.org/software/coreutils/uniqE<gt>
nl: Volledige documentatie op: E<lt>https://www.gnu.org/software/coreutils/uniqE<gt>
sv: Fullständig dokumentation E<lt>https://www.gnu.org/software/coreutils/uniqE<gt>

source: or available locally via: info \(aq(coreutils) uniq invocation\(aq
nl: of lokaal via: info \(aq(coreutils) uniq invocation\(aq
sv: eller tillgängligt lokalt via: info \(aq(coreutils) uniq invocation\(aq

source: Copyright \(co 2020 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2020 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2020 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: October 2021
nl: Oktober 2021
sv: oktober 2021

source: August 2022
nl: Augustus 2022
sv: augusti 2022

source: Copyright \(co 2021 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
nl: Copyright \(co 2021 Free Software Foundation, Inc. Licentie GPLv3+: GNU GPL versie 3 of later E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.
sv: Copyright \(co 2021 Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare E<lt>https://gnu.org/licenses/gpl.htmlE<gt>.

source: comm(1), join(1), sort(1)
sv: B<comm>(1), B<join>(1), B<sort>(1)
