Repository: sebras/manpages-l10n
Catalog: po/*/man1/unshare.1.po
Languages: de

source: Recursively set the mount propagation flag in the new mount namespace. The default is to set the propagation to I<private>. It is possible to disable this feature with the argument B<unchanged>. The option is silently ignored when the mount namespace (B<--mount>) is not requested.
de: Setzt den Einhängeausbreitungsschalter in dem neuen Einhängenamensraum rekursiv. Die Vorgabe ist, die Ausbreitung auf I<private> zu setzen. Es ist möglich, diese Funktionalität mit dem Argument B<unchanged> zu deaktivieren. Diese Option wird ohne Rückmeldung ignoriert, wenn der Einhängenamensraum (B<--mount>) nicht angefordert wird.

source: Allow or deny the B<setgroups>(2) system call in a user namespace.
de: Erlaubt oder verweigert den Systemaufruf B<setgroups>(2) in Benutzer-Namensräumen.

source: To be able to call B<setgroups>(2), the calling process must at least have CAP_SETGID. But since Linux 3.19 a further restriction applies: the kernel gives permission to call B<\%setgroups>(2) only after the GID map (B</proc/>I<pid>B</gid_map>) has been set. The GID map is writable by root when B<\%setgroups>(2) is enabled (i.e., B<allow>, the default), and the GID map becomes writable by unprivileged processes when B<\%setgroups>(2) is permanently disabled (with B<deny>).
de: Um B<setgroups>(2) aufrufen zu können, muss der aufrufende Prozess mindestens über CAP_SETGID verfügen. Seit Linux 3.19 gilt eine weitere Einschränkung: Der Kernel erteilt die Berechtigung, B<\%setgroups>(2) aufzurufen, nur nachdem die GID-Abbildung (B</proc/>I<PID>B</gid_map>) eingerichtet wurde. Die GID-Abbildung ist durch Root beschreibbar, wenn B<\%setgroups>(2) aktiviert ist (d.h. B<allow>, die Vorgabe) und die GID-Abbildung wird durch unprivilegierte Prozesse beschreibbar, wenn B<\%setgroups>(2) permanent deaktiviert ist (mit B<deny>).

source: B<-R>,B< --root=>I<dir>
de: B<-R>,B< --root=>I<Verzeichnis>

source: B<-w>,B< --wd=>I<dir>
de: B<-w>,B< --wd=>I<Verzeichnis>

source: B<--monotonic>I< offset>
de: B<--monotonic>I< Versatz>

source: B<--boottime>I< offset>
de: B<--boottime>I< Versatz>

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: The proc and sysfs filesystems mounting as root in a user namespace have to be restricted so that a less privileged user can not get more access to sensitive files that a more privileged user made unavailable. In short the rule for proc and sysfs is as close to a bind mount as possible.
de: Die proc- und sysfs-Dateisystemeinhängungen als Root in einem Benutzernamensraum müssen eingeschränkt werden, so dass ein weniger privilegierter Benutzer nicht mehr Zugriffe auf sensible Dateien haben kann, als ein höher privilegierter Benutzer unverfügbar gemacht hat. Kurz gesagt, die Regeln für proc und sysfs sind so ähnlich zu einer Bind-Einhängung wie möglich.

source: The following command creates a PID namespace, using B<--fork> to ensure that the executed command is performed in a child process that (being the first process in the namespace) has PID 1. The B<--mount-proc> option ensures that a new mount namespace is also simultaneously created and that a new B<proc>(5) filesystem is mounted that contains information corresponding to the new PID namespace. When the B<readlink> command terminates, the new namespaces are automatically torn down.
de: Der folgende Befehl erzeugt einen PID-Namensraum, wobei B<--fork> verwendet wird, um sicherzustellen, dass der aufgerufene Befehl in einem Kind-Namensraum ausgeführt wird (welcher der erste Prozess im Namensraum ist), der die PID 1 hat. Die Option B<--mount-proc> sorgt dafür, dass gleichzeitig auch ein neuer Einhängenamensraum erzeugt und ein neues B<proc>(5)-Dateisystem eingehängt wird, das Informationen zum neuen PID-Namensraum enthält. Wenn der Befehl B<readlink> beendet wird, werden die neuen Namensräume automatisch zerstört.

source: As an unprivileged user, create a new user namespace where the user's credentials are mapped to the root IDs inside the namespace:
de: Mit den Rechten eines unprivilegierten Benutzers einen neuen Benutzernamensraum erstellen, in welchem die Anmeldedaten des Benutzers auf die Root-Kennungen innerhalb des Namensraums abgebildet werden:

source: The first of the following commands creates a new persistent UTS namespace and modifies the hostname as seen in that namespace. The namespace is then entered with B<nsenter>(1) in order to display the modified hostname; this step demonstrates that the UTS namespace continues to exist even though the namespace had no member processes after the B<unshare> command terminated. The namespace is then destroyed by removing the bind mount.
de: Der erste der folgenden Befehle erzeugt einen neuen dauerhaften UTS-Namenraum und ändert den Rechnernamen so, wie er im Namensraum gesehen wird. Der Namensraum wird dann mit B<nsenter>(1) betreten, um den geänderten Rechnernamen anzuzeigen; dieser Schritt demonstriert, dass der UTS-Namensraum weiter existiert, obwohl der Namensraum nach dem Beenden des B<unshare>-Prozesses keine eigenen Mitgliedprozesse mehr hat. Der Namensraum wird dann durch Entfernen der Bind-Einhängung zerstört.

source: The following commands establish a persistent mount namespace referenced by the bind mount I</root/namespaces/mnt>. In order to ensure that the creation of that bind mount succeeds, the parent directory (I</root/namespaces>) is made a bind mount whose propagation type is not B<shared>.
de: Die folgenden Befehle etablieren einen dauerhaften Einhängenamensraum, der von der »bind«-Einhängung /root/namespaces/mnt angegeben wird. Um sicherzustellen, dass die Erzeugung dieser Bind-Einhängung erfolgreich ist, wird das Elternverzeichnis (I</root/namespaces>) zu einer Bind-Einhängung, deren Ausbreitungstyp nicht B<shared> ist.

source: B<# set +m ># Don't print job status messages B<# unshare --pid --fork --mount-proc --kill-child -- \e> B<bash --norc -c \(aq(sleep 555 &) && (ps a &) && sleep 999\(aq &> [1] 53456 # PID TTY STAT TIME COMMAND 1 pts/3 S+ 0:00 sleep 999 3 pts/3 S+ 0:00 sleep 555 5 pts/3 R+ 0:00 ps a
de: B<# set +m ># Keine Meldungen zum Auftragsstatus ausgeben B<# unshare --pid --fork --mount-proc --kill-child -- \e> B<bash --norc -c \(aq(sleep 555 &) && (ps a &) && sleep 999\(aq &> [1] 53456 # PID TTY STAT TIME COMMAND 1 pts/3 S+ 0:00 sleep 999 3 pts/3 S+ 0:00 sleep 555 5 pts/3 R+ 0:00 ps a

source: B<# ps h -o 'comm' $! ># Show that background job is unshare(1) unshare B<# kill $! ># Kill unshare(1) B<# pidof sleep>
de: B<# ps h -o 'comm' $! ># Zeigen, dass der Hintergrund-Job unshare(1) ist unshare B<# kill $! ># unshare(1) töten B<# pidof sleep>

source: The B<pidof> command prints no output, because the B<sleep> processes have been killed. More precisely, when the B<sleep> process that has PID 1 in the namespace (i.e., the namespace's init process) was killed, this caused all other processes in the namespace to be killed. By contrast, a similar series of commands where the B<--kill-child> option is not used shows that when B<unshare> terminates, the processes in the PID namespace are not killed:
de: Der Befehl B<pidof> gibt nichts aus, da die Kindprozesse getötet wurden. Genauer gesagt: Wenn der B<sleep>-Prozess, der in dem Namensraum die Prozesskennung 1 hat (also der Init-Prozess dieses Namensraums) getötet wurde, dann werden daraufhin alle anderen Prozesse in diesem Namensraum getötet. Im Gegensatz dazu zeigt eine ähnliche Reihe von Befehlen, bei denen die Option B<--kill-child> nicht verwendet wird, dass die Prozesse in diesem PID-Namensraum beim Beenden von B<unshare> nicht getötet werden:

source: B<# uptime -p ># Show uptime in initial time namespace up 21 hours, 30 minutes B<# unshare --time --fork --boottime 300000000 uptime -p> up 9 years, 28 weeks, 1 day, 2 hours, 50 minutes
de: B<# uptime -p ># Betriebszeit im ursprünglichen Zeit-Namensraum anzeigen up 21 hours, 30 minutes B<# unshare --time --fork --boottime 300000000 uptime -p> up 9 years, 28 weeks, 1 day, 2 hours, 50 minutes

source: The unshare command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl unshare ist Teil des Pakets util-linux und kann von https://www.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.

source: By default, a new namespace persists only as long as it has member processes. A new namespace can be made persistent even when it has no member processes by bind mounting /proc/I<pid>/ns/I<type> files to a filesystem path. A namespace that has been made persistent in this way can subsequently be entered with B<nsenter>(1) even after the I<program> terminates (except PID namespaces where a permanently running init process is required). Once a persistent namespace is no longer needed, it can be unpersisted by using B<umount>(8) to remove the bind mount. See the EXAMPLES section for more details.
de: In der Voreinstellung ist ein neuer Namensraum nur so lange beständig, wie er Mitgliedprozesse hat. Ein neuer Namensraum kann beständig gemacht werden, selbst wenn es keine Mitgliedprozesse gibt, indem /proc/I<PID>/ns/I<Typ>-Dateien mit »bind« in einen Dateisystempfad eingebunden werden. Ein Namensraum, der auf diese Weise beständig gemacht wurde, kann anschließend mit B<nsenter>(1) betreten werden, sogar, wenn das I<Programm> beendet wird (außer PID-Namensräume, bei denen ein dauerhaft laufender Init-Prozess benötigt wird). Sobald ein beständiger Namensraum nicht länger benötigt wird, kann die Beständigkeit mit B<umount>(8) aufgehoben werden, um die Einhängung mit B<bind>(2) aufzuheben. Weitere Einzelheiten finden Sie im Abschnitt BEISPIELE.

source: Unshare the IPC namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des IPC-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer Einhängung mit B<bind>(2) erstellt.

source: Unshare the mount namespace. If I<file> is specified, then a persistent namespace is created by a bind mount. Note that I<file> must be located on a mount whose propagation type is not B<shared> (or an error results). Use the command B<findmnt -o+PROPAGATION> when not sure about the current setting. See also the examples below.
de: Hebt die Freigabe des eingehängten Namensraums auf. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum durch ein Einhängen mit B<bind>(2) erstellt. Beachten Sie, dass I<Datei> auf einem Dateisystem liegen muss, dessen Ausbreitungstyp nicht auf B<shared> gesetzt ist (anderenfalls würde ein Fehler auftreten). Verwenden Sie den Befehl B<findmnt -o+PROPAGATION>, wenn Sie sich bezüglich der derzeitigen Einstellung nicht sicher sind. Lesen Sie auch die nachfolgenden Beispiele.

source: Unshare the network namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des Netz-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer Einhängung mit B<bind>(2) erstellt.

source: Unshare the PID namespace. If I<file> is specified, then a persistent namespace is created by a bind mount. (Creation of a persistent PID namespace will fail if the B<--fork> option is not also specified.)
de: Trennen des PID-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer Einhängung erstellt. (Die Erstellung eines beständigen Namensraums wird fehlschlagen, wenn nicht auch die Option B<--fork> angegeben ist.)

source: Unshare the UTS namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des UTS-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: Unshare the user namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des Benutzer-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: Unshare the cgroup namespace. If I<file> is specified, then persistent namespace is created by bind mount.
de: Trennen des Cgroup-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: Unshare the time namespace. If I<file> is specified, then a persistent namespace is created by a bind mount. The B<--monotonic> and B<--boottime> options can be used to specify the corresponding offset in the time namespace.
de: Trennen des Zeit-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt. Mit den Optionen B<--monotonic> und B<--bootime> können Sie den korrespondierenden Versatz im Zeit-Namensraum angeben.

source: The following command creates a PID namespace, using B<--fork> to ensure that the executed command is performed in a child process that (being the first process in the namespace) has PID 1. The B<--mount-proc> option ensures that a new mount namespace is also simultaneously created and that a new B<proc>(5) filesystem is mounted that contains information corresponding to the new PID namespace. When the B<readlink> command terminates, the new namespaces are automatically torn down.
de: Der folgende Befehl erzeugt einen PID-Namensraum, wobei B<--fork> verwendet wird, um sicherzustellen, dass der aufgerufene Befehl in einem Kind-Namensraum ausgeführt wird (welcher der erste Prozess im Namensraum ist), der die PID 1 hat. Die Option B<--mount-proc> sorgt dafür, dass gleichzeitig auch ein neuer Einhängenamensraum erzeugt und ein neues B<proc>(5)-Dateisystem eingehängt wird, das Informationen zum neuen PID-Namensraum enthält. Wenn der Befehl B<readlink> beendet wird, werden die neuen Namensräume automatisch zerstört.
