Repository: sebras/manpages-l10n
Catalog: po/*/man1/unshare.1.po
Languages: de

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: unshare - run program in new namespaces
de: unshare - Programm in neuen Namensräumen ausführen

source: SYNOPSIS
de: ÜBERSICHT

source: B<unshare> [options] [I<program> [I<arguments>]]
de: B<unshare> [Optionen] [I<Programm> [I<Argumente>]]

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<unshare> command creates new namespaces (as specified by the command-line options described below) and then executes the specified I<program>. If I<program> is not given, then "${SHELL}" is run (default: I</bin/sh>).
de: Der Befehl B<unshare> erzeugt neue Namensräume (wie in den nachfolgend beschriebenen Befehlszeilenoptionen angegeben) und führt dann das angegebene I<Programm> aus. Falls kein I<Programm> angegeben ist, dann wird »${SHELL}« ausgeführt (Vorgabe: I</bin/sh>).

source: By default, a new namespace persists only as long as it has member processes. A new namespace can be made persistent even when it has no member processes by bind mounting /proc/I<pid>/ns/I<type> files to a filesystem path. A namespace that has been made persistent in this way can subsequently be entered with B<nsenter>(1) even after the I<program> terminates (except PID namespaces where a permanently running init process is required). Once a persistent namespace is no longer needed, it can be unpersisted by using B<umount>(8) to remove the bind mount. See the B<EXAMPLES> section for more details.
de: In der Voreinstellung ist ein neuer Namensraum nur so lange beständig, wie er Mitgliedprozesse hat. Ein neuer Namensraum kann beständig gemacht werden, selbst wenn es keine Mitgliedprozesse gibt, indem /proc/I<PID>/ns/I<Typ>-Dateien mit »bind« in einen Dateisystempfad eingebunden werden. Ein Namensraum, der auf diese Weise beständig gemacht wurde, kann anschließend mit B<nsenter>(1) betreten werden, sogar, wenn das I<Programm> beendet wird (außer PID-Namensräume, bei denen ein dauerhaft laufender Init-Prozess benötigt wird). Sobald ein beständiger Namensraum nicht länger benötigt wird, kann die Beständigkeit mit B<umount>(8) aufgehoben werden, um die Bind-Einhängung aufzuheben. Weitere Einzelheiten finden Sie im Abschnitt B<BEISPIELE>.

source: B<unshare> since util-linux version 2.36 uses I</proc/[pid]/ns/pid_for_children> and I</proc/[pid]/ns/time_for_children> files for persistent PID and TIME namespaces. This change requires Linux kernel 4.17 or newer.
de: B<unshare> verwendet seit Util-linux Version 2.36 die Dateien I</proc/[PID]/ns/pid_for_children> und I</proc/[PID]/ns/time_for_children> für dauerhafte PID- und ZEIT-Namensräume. Diese Änderung erfordert einen Linux-Kernel der Version 4.17 oder neuer.

source: The following types of namespaces can be created with B<unshare>:
de: Die folgenden Namensraumtypen können mit B<unshare> erzeugt werden:

source: B<mount namespace>
de: B<Einhänge-Namensraum>

source: Mounting and unmounting filesystems will not affect the rest of the system, except for filesystems which are explicitly marked as shared (with B<mount --make-shared>; see I</proc/self/mountinfo> or B<findmnt -o+PROPAGATION> for the B<shared> flags). For further details, see B<mount_namespaces>(7).
de: Ein- und Aushängen von Dateisystemen betrifft den Rest des Systems nicht, außer für Dateisysteme, die explizit als Mehrfacheinhängungen markiert sind (mit B<mount --make-shared>; siehe I</proc/self/mountinfo> oder B<findmnt -o+PROPAGATION> für die B<shared>-Schalter). Für weitere Details siehe B<mount_namespaces>(7).

source: B<unshare> since util-linux version 2.27 automatically sets propagation to B<private> in a new mount namespace to make sure that the new namespace is really unshared. It\(cqs possible to disable this feature with option B<--propagation unchanged>. Note that B<private> is the kernel default.
de: Seit Util-Linux Version 2.27 setzt B<unshare> die Ausbreitung in einem neuen Einhängenamensraum auf B<private>, um sicherzustellen, dass der neue Namensraum wirklich getrennt ist. Diese Funktionalität kann mit der Option B<--propagation unchanged> deaktiviert werden. Beachten Sie, dass B<private> die Vorgabe des Kernels ist.

source: B<UTS namespace>
de: B<UTS-Namensraum>

source: Setting hostname or domainname will not affect the rest of the system. For further details, see B<uts_namespaces>(7).
de: Setzen des Rechner- oder Domain-Namens wird den Rest des Systems nicht betreffen. Für weitere Details siehe B<uts_namespaces>(7).

source: B<IPC namespace>
de: B<IPC-Namensraum>

source: The process will have an independent namespace for POSIX message queues as well as System V message queues, semaphore sets and shared memory segments. For further details, see B<ipc_namespaces>(7).
de: Der Prozess erhält einen unabhängigen Namensraum für POSIX-Meldungswarteschlangen sowie System-V-Meldungswarteschlangen, Semaphor-Gruppen und gemeinsam genutzte Speichersegmente. Für weitere Details siehe B<ipc_namespaces>(7).

source: B<network namespace>
de: B<Netz-Namensraum>

source: The process will have independent IPv4 and IPv6 stacks, IP routing tables, firewall rules, the I</proc/net> and I</sys/class/net> directory trees, sockets, etc. For further details, see B<network_namespaces>(7).
de: Der Prozess erhält unabhängige IPv4- und IPv6-Stapel, IP-Routing-Tabellen, Firewall-Regeln, die Verzeichnisbäume I</proc/net> und I</sys/class/net>, Sockets usw. Für weitere Details siehe B<network_namespaces>(7).

source: B<PID namespace>
de: B<PID-Namensraum>

source: Children will have a distinct set of PID-to-process mappings from their parent. For further details, see B<pid_namespaces>(7).
de: Kindprozesse werden eine eigene Gruppe von Abbildungen der PIDs zu Prozessen haben. Für weitere Details siehe B<pid_namespaces>(7).

source: B<cgroup namespace>
de: B<Cgroup-Namensraum>

source: The process will have a virtualized view of I</proc/self/cgroup>, and new cgroup mounts will be rooted at the namespace cgroup root. For further details, see B<cgroup_namespaces>(7).
de: Der Prozess wird über einen virtualisierten Blick auf I</proc/self/cgroup> verfügen und neue Cgroup-Einhängungen werden ihre Wurzel in der Wurzel der Cgroup-Namensraum-Wurzel haben. Für weitere Details siehe B<cgroup_namespaces>(7).

source: B<user namespace>
de: B<Benutzer-Namensraum>

source: The process will have a distinct set of UIDs, GIDs and capabilities. For further details, see B<user_namespaces>(7).
de: Der Prozess wird über eine eindeutige Gruppe an UIDs, GIDS und Capabilities verfügen. Für weitere Details siehe B<user_namespaces>(7).

source: B<time namespace>
de: B<Zeit-Namensraum>

source: The process can have a distinct view of B<CLOCK_MONOTONIC> and/or B<CLOCK_BOOTTIME> which can be changed using I</proc/self/timens_offsets>. For further details, see B<time_namespaces>(7).
de: Der Prozess kann eine abweichende Sicht auf B<CLOCK_MONOTONIC> und/oder B<CLOCK_BOOTTIME> haben, was mittels I</proc/self/timens_offsets> geändert werden kann. Für weitere Details, siehe B<time_namespaces>(7).

source: OPTIONS
de: OPTIONEN

source: B<-i>, B<--ipc>[B<=>I<file>]
de: B<-i>, B<--ipc>[B<=>I<Datei>]

source: Create a new IPC namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>.
de: Erzeugen eines neuen IPC-Namensraums. Falls eine I<Datei> angegeben ist, wird der Namensraum beständig gemacht, indem eine »bind«-Einhängung auf der I<Datei> erstellt wird.

source: B<-m>, B<--mount>[B<=>I<file>]
de: B<-m>, B<--mount>[B<=>I<Datei>]

source: Create a new mount namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>. Note that I<file> must be located on a mount whose propagation type is not B<shared> (or an error results). Use the command B<findmnt -o+PROPAGATION> when not sure about the current setting. See also the examples below.
de: erstellt einen neuen Einhänge-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht. Beachten Sie, dass die I<Datei> auf einem Dateisystem liegen muss, dessen Ausbreitungstyp nicht auf B<shared> gesetzt ist (anderenfalls würde ein Fehler auftreten). Verwenden Sie den Befehl B<findmnt -o+PROPAGATION>, wenn Sie sich bezüglich der derzeitigen Einstellung nicht sicher sind. Lesen Sie auch die nachfolgenden Beispiele.

source: B<-n>, B<--net>[B<=>I<file>]
de: B<-n>, B<--net>[B<=>I<Datei>]

source: Create a new network namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>.
de: erstellt einen neuen Netz-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht.

source: B<-p>, B<--pid>[B<=>I<file>]
de: B<-p>, B<--pid>[B<=>I<Datei>]

source: Create a new PID namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>. (Creation of a persistent PID namespace will fail if the B<--fork> option is not also specified.)
de: erstellt einen neuen PID-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht. (Die Erstellung eines beständigen PID-Namensraums wird fehlschlagen, wenn nicht auch die Option B<--fork> angegeben ist.)

source: See also the B<--fork> and B<--mount-proc> options.
de: Siehe auch die Optionen B<--fork> und B<--mount-proc>.

source: B<-u>, B<--uts>[B<=>I<file>]
de: B<-u>, B<--uts>[B<=>I<Datei>]

source: Create a new UTS namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>.
de: erstellt einen neuen UTS-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht.

source: B<-U>, B<--user>[B<=>I<file>]
de: B<-U>, B<--user>[B<=>I<Datei>]

source: Create a new user namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>.
de: erstellt einen neuen Benutzer-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht.

source: B<-C>, B<--cgroup>[B<=>I<file>]
de: B<-C>, B<--cgroup>[B<=>I<Datei>]

source: Create a new cgroup namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>.
de: erstellt einen neuen Cgroup-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht.

source: B<-T>, B<--time>[B<=>I<file>]
de: B<-T>, B<--time>[B<=>I<Datei>]

source: Create a new time namespace. If I<file> is specified, then the namespace is made persistent by creating a bind mount at I<file>. The B<--monotonic> and B<--boottime> options can be used to specify the corresponding offset in the time namespace.
de: erstellt einen neuen Zeit-Namensraum. Falls eine I<Datei> angegeben ist, wird der Namensraum durch Erzeugen einer »bind«-Einhängung in I<Datei> beständig gemacht. Mit den Optionen B<--monotonic> und B<--boottime> können Sie den korrespondierenden Versatz im Zeit-Namensraum angeben.

source: Fork the specified I<program> as a child process of B<unshare> rather than running it directly. This is useful when creating a new PID namespace. Note that when B<unshare> is waiting for the child process, then it ignores B<SIGINT> and B<SIGTERM> and does not forward any signals to the child. It is necessary to send signals to the child process.
de: Forkt das angegebene I<Programm> als Kindprozess von B<unshare>, anstatt es direkt auszuführen. Dies ist nützlich, wenn Sie einen neuen PID-Namensraum erstellen. Beachten Sie: Wenn B<unshare> auf einen Kindprozess wartet, dann ignoriert es B<SIGINT> und B<SIGTERM> und leitet keine Signale an den Kindprozess weiter. Es ist daher nötig, Signale an den Kindprozess zu senden.

source: When the B<--user> option is given, ensure that capabilities granted in the user namespace are preserved in the child process.
de: stellt bei übergebener Option B<--user> sicher, dass die im Benutzernamensraum gewährten Capabilities im Kindprozess erhalten bleiben.

source: When B<unshare> terminates, have I<signame> be sent to the forked child process. Combined with B<--pid> this allows for an easy and reliable killing of the entire process tree below B<unshare>. If not given, I<signame> defaults to B<SIGKILL>. This option implies B<--fork>.
de: Wenn sich B<unshare> beendet, soll I<Signame> an den mit Fork erstellten Kindprozess gesandt werden. Kombiniert mit B<--pid> erlaubt dies ein leichtes und zuverlässiges Töten eines gesamten Prozessbaums unterhalb von B<unshare>. Falls nicht angegeben, ist I<Signame> standardmäßig B<SIGKILL>. Diese Option impliziert B<--fork>.

source: B<--mount-proc>[B<=>I<mountpoint>]
de: B<--mount-proc>[B<=>I<Einhängepunkt>]

source: Just before running the program, mount the proc filesystem at I<mountpoint> (default is I</proc>). This is useful when creating a new PID namespace. It also implies creating a new mount namespace since the I</proc> mount would otherwise mess up existing programs on the system. The new proc filesystem is explicitly mounted as private (with B<MS_PRIVATE>|B<MS_REC>).
de: Direkt vor Ausführung des Programms wird das proc-Dateisystem unter I<Einhängepunkt> (Vorgabe ist I</proc>) eingehängt. Das ist bei der Erstellung eines neuen PID-Namensraums nützlich. Dies impliziert auch die Erstellung eines neuen Einhängenamensraums, da die I</proc>-Einhängung ansonsten bestehende Programme auf dem System durcheinanderbringen würde. Das neue proc-Dateisystem wird explizit als privat eingehängt (mit B<MS_PRIVATE>|B<MS_REC>).

source: Run the program only after the current effective user ID has been mapped to I<uid>. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--user>.
de: führt das Programm erst aus, nachdem die aktuelle effektive Benutzerkennung auf I<UID> gesetzt wurde. Falls diese Option mehrfach angegeben wird, hat die zuletzt angegebene Option Vorrang. Diese Option impliziert B<--user>.

source: B<--map-users=>I<outeruid,inneruid,count>|B<auto>
de: B<--map-users=>I<äußere_UID,innere_UID,Anzahl>|B<auto>

source: Run the program only after the block of user IDs of size I<count> beginning at I<outeruid> has been mapped to the block of user IDs beginning at I<inneruid>. This mapping is created with B<newuidmap>(1). If the range of user IDs overlaps with the mapping specified by B<--map-user>, then a "hole" will be removed from the mapping. This may result in the highest user ID of the mapping not being mapped. The special value B<auto> will map the first block of user IDs owned by the effective user from I</etc/subuid> to a block starting at user ID 0. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--user>.
de: führt das Programm nur aus, nachdem der Block der Benutzer-IDs der Größe I<Anzahl> beginnend bei der I<äußeren_UID> auf den Block der Benutzer-IDs beginnend bei der I<inneren_UID> abgebildet wurde. Diese Abbildung geschieht mittels B<newuidmap>(1). Falls die Bereiche der Benutzer-IDs mit der durch B<--map-user> angegebenen Abbildung überlappen, wird ein »Loch« aus der Abbildung entfernt. Dadurch kann es passieren, dass die höchste Benutzer-ID der Abbildung nicht abgebildet wird. Der spezielle Wert B<auto> bildet den ersten Block der Benutzer-IDs, der dem effektiven Benutzer aus I</etc/subuid> gehört, auf einen Block ab, der bei der Benutzer-ID 0 beginnt. Falls diese Option mehrmals angegeben wird, erhält die letzte Angabe Vorrang. Diese Option impliziert B<--user>.

source: Run the program only after the current effective group ID has been mapped to I<gid>. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--setgroups=deny> and B<--user>.
de: führt das Programm erst aus, nachdem die aktuelle effektive Gruppenkennung auf I<GID> gesetzt wurde. Falls diese Option mehrfach angegeben wird, hat die zuletzt angegebene Option Vorrang. Diese Option impliziert B<--setgroups=deny> und B<--user>.

source: B<--map-groups=>I<outergid,innergid,count>|B<auto>
de: B<--map-groups=>I<äußere_GID,innere_GID,Anzahl>|B<auto>

source: Run the program only after the block of group IDs of size I<count> beginning at I<outergid> has been mapped to the block of group IDs beginning at I<innergid>. This mapping is created with B<newgidmap>(1). If the range of group IDs overlaps with the mapping specified by B<--map-group>, then a "hole" will be removed from the mapping. This may result in the highest group ID of the mapping not being mapped. The special value B<auto> will map the first block of user IDs owned by the effective user from I</etc/subgid> to a block starting at group ID 0. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--user>.
de: führt das Programm nur aus, nachdem der Block der Gruppen-IDs der Größe _Anzahl_ beginnend bei der I<äußeren_GID> auf den Block der Gruppen-IDs beginnend bei der I<inneren_GID> abgebildet wurde. Diese Abbildung geschieht mittels B<newgidmap>(1). Falls die Bereiche der Gruppen-IDs mit der durch B<--map-group> angegebenen Abbildung überlappen, wird ein »Loch« aus der Abbildung entfernt. Dadurch kann es passieren, dass die höchste Gruppen-ID der Abbildung nicht abgebildet wird. Der spezielle Wert B<auto> bildet den ersten Block der Benutzer-IDs, der dem effektiven Benutzer aus I</etc/subgid> gehört, auf einen Block ab, der bei der Gruppen-ID 0 beginnt. Falls diese Option mehrmals angegeben wird, erhält die letzte Angabe Vorrang. Diese Option impliziert B<--user>.

source: Map the first block of user IDs owned by the effective user from I</etc/subuid> to a block starting at user ID 0. In the same manner, also map the first block of group IDs owned by the effective group from I</etc/subgid> to a block starting at group ID 0. This option is intended to handle the common case where the first block of subordinate user and group IDs can map the whole user and group ID space. This option is equivalent to specifying B<--map-users=auto> and B<--map-groups=auto>.
de: bildet den ersten Block der Benutzerkennungen, die dem effektiven Benutzer aus I</etc/subuid> gehören, auf einen Block beginnend mit der Benutzerkennung 0 ab. Auf die gleiche Weise wird auch der erste Block der Gruppenkennungen, die der effektiven Gruppe aus I</etc/subgid> gehören, auf einen Block beginnend mit der Gruppenkennung 0 abgebildet. Diese Option ist für den häufig vorkommenden Fall gedacht, in dem der erste Block von Subordinaten-Benutzer- und Gruppenkennungen den gesamten Benutzer- und Gruppenkennungsraum abbilden kann. Diese Option ist gleichbedeutend mit der gleichzeitigen Angabe von B<--map-users=auto> und B<--map-groups=auto>.

source: Run the program only after the current effective user and group IDs have been mapped to the superuser UID and GID in the newly created user namespace. This makes it possible to conveniently gain capabilities needed to manage various aspects of the newly created namespaces (such as configuring interfaces in the network namespace or mounting filesystems in the mount namespace) even when run unprivileged. As a mere convenience feature, it does not support more sophisticated use cases, such as mapping multiple ranges of UIDs and GIDs. This option implies B<--setgroups=deny> and B<--user>. This option is equivalent to B<--map-user=0 --map-group=0>.
de: Führt das Programm erst aus, wenn die effektive Benutzer- und Gruppenkennungen auf die UID und GID des Systemverwalters in dem neu erstellten Namensraum abgebildet wurde. Dies ermöglicht es, bequem die benötigten Capabilities zu erlangen, um verschiedene Aspekte in dem neu erstellten Namensraum zu verwalten (wie die Konfiguration von Schnittstellen im Netz-Namensraum oder das Einhängen von Dateisystemen in dem Einhängenamensraum), selbst bei unprivilegierter Ausführung. Als reine Bequemlichkeitsfunktionalität unterstützt es keine fortgeschritteneren Anwendungsfälle, wie das Abbilden von mehreren Bereichen von UIDs und GIDs. Diese Option impliziert B<--setgroups=deny> und B<--user>. Diese Option ist äquivalent zu B<--map-user=0 --map-group=0>.

source: Run the program only after the current effective user and group IDs have been mapped to the same UID and GID in the newly created user namespace. This option implies B<--setgroups=deny> and B<--user>. This option is equivalent to B<--map-user=$(id -ru) --map-group=$(id -rg)>.
de: führt das Programm erst aus, nachdem die aktuellen effektiven Benutzer- und Gruppenkennungen im neu erzeugten Benutzernamensraum auf die gleiche UID und GID gesetzt wurde. Diese Option impliziert B<--setgroups=deny> und B<--user>. Diese Option ist äquivalent zu B<--map-user=$(id -ru) --map-group=$(id -rg)>.

source: Recursively set the mount propagation flag in the new mount namespace. The default is to set the propagation to I<private>. It is possible to disable this feature with the argument B<unchanged>. The option is silently ignored when the mount namespace (B<--mount>) is not requested.
de: Setzt den Einhängeausbreitungsschalter in dem neuen Einhängenamensraum rekursiv. Die Vorgabe ist, die Ausbreitung auf I<private> zu setzen. Es ist möglich, diese Funktionalität mit dem Argument B<unchanged> zu deaktivieren. Diese Option wird ohne Rückmeldung ignoriert, wenn der Einhängenamensraum (B<--mount>) nicht angefordert wird.

source: Allow or deny the B<setgroups>(2) system call in a user namespace.
de: Erlaubt oder verweigert den Systemaufruf B<setgroups>(2) in Benutzer-Namensräumen.

source: To be able to call B<setgroups>(2), the calling process must at least have B<CAP_SETGID>. But since Linux 3.19 a further restriction applies: the kernel gives permission to call B<setgroups>(2) only after the GID map (B</proc/>I<pid>*/gid_map*) has been set. The GID map is writable by root when B<setgroups>(2) is enabled (i.e., B<allow>, the default), and the GID map becomes writable by unprivileged processes when B<setgroups>(2) is permanently disabled (with B<deny>).
de: Um B<setgroups>(2) aufrufen zu können, muss der aufrufende Prozess mindestens über B<CAP_SETGID> verfügen. Seit Linux 3.19 gilt eine weitere Einschränkung: Der Kernel erteilt die Berechtigung, B<setgroups>(2) aufzurufen, nur nachdem die GID-Abbildung (B</proc/>I<PID>B</gid_map>) eingerichtet wurde. Die GID-Abbildung ist durch Root beschreibbar, wenn B<setgroups>(2) aktiviert ist (d.h. B<allow>, die Vorgabe) und die GID-Abbildung wird durch unprivilegierte Prozesse beschreibbar, wenn B<setgroups>(2) permanent deaktiviert ist (mit B<deny>).

source: B<-R>, B<--root=>I<dir>
de: B<-R>, B<--root=>I<Verzeichnis>

source: run the command with root directory set to I<dir>.
de: führt den Befehl aus, wobei das Wurzelverzeichnis auf das angegebene I<Verzeichnis> gesetzt wird.

source: B<-w>, B<--wd=>I<dir>
de: B<-w>, B<--wd=>I<Verzeichnis>

source: change working directory to I<dir>.
de: ändert das Arbeitsverzeichnis auf das angegebene I<Verzeichnis>.

source: Set the user ID which will be used in the entered namespace.
de: legt die Benutzerkennung fest, die in dem betretenen Namensraum verwendet wird.

source: Set the group ID which will be used in the entered namespace and drop supplementary groups.
de: legt die Gruppenkennung fest, die in dem betretenen Namensraum verwendet wird und entfernt zusätzliche Gruppen.

source: B<--monotonic> I<offset>
de: B<--monotonic> I<Versatz>
