Repository: sebras/manpages-l10n
Catalog: po/*/man1/unshare.1.po
Languages: de

source: Set the offset of B<CLOCK_MONOTONIC> which will be used in the entered time namespace. This option requires unsharing a time namespace with B<--time>.
de: legt den Versatz von B<CLOCK_MONOTONIC> fest, der im betretenen Zeit-Namensraum verwendet wird. Diese Option erfordert die Trennung eines Zeit-Namensraums mit B<--time>.

source: B<--boottime> I<offset>
de: B<--boottime> I<Versatz>

source: Set the offset of B<CLOCK_BOOTTIME> which will be used in the entered time namespace. This option requires unsharing a time namespace with B<--time>.
de: legt den Versatz von B<CLOCK_BOOTTIME> fest, der im betretenen Zeit-Namensraum verwendet wird. Diese Option erfordert die Trennung eines Zeit-Namensraums mit B<--time>.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.

source: NOTES
de: ANMERKUNGEN

source: The proc and sysfs filesystems mounting as root in a user namespace have to be restricted so that a less privileged user cannot get more access to sensitive files that a more privileged user made unavailable. In short the rule for proc and sysfs is as close to a bind mount as possible.
de: Die proc- und sysfs-Dateisystemeinhängungen als Root in einem Benutzernamensraum müssen eingeschränkt werden, so dass ein weniger privilegierter Benutzer nicht mehr Zugriffe auf sensible Dateien haben kann, als ein höher privilegierter Benutzer unverfügbar gemacht hat. Kurz gesagt, die Regeln für proc und sysfs sind so ähnlich zu einer Einhängung mit B<bind>(2) wie möglich.

source: EXAMPLES
de: BEISPIELE

source: The following command creates a PID namespace, using B<--fork> to ensure that the executed command is performed in a child process that (being the first process in the namespace) has PID 1. The B<--mount-proc> option ensures that a new mount namespace is also simultaneously created and that a new B<proc>(5) filesystem is mounted that contains information corresponding to the new PID namespace. When the B<readlink>(1) command terminates, the new namespaces are automatically torn down.
de: Der folgende Befehl erzeugt einen PID-Namensraum, wobei B<--fork> verwendet wird, um sicherzustellen, dass der aufgerufene Befehl in einem Kind-Namensraum ausgeführt wird (welcher der erste Prozess im Namensraum ist), der die PID 1 hat. Die Option B<--mount-proc> sorgt dafür, dass gleichzeitig auch ein neuer Einhängenamensraum erzeugt und ein neues B<proc>(5)-Dateisystem eingehängt wird, das Informationen zum neuen PID-Namensraum enthält. Wenn der Befehl B<readlink>(1) beendet wird, werden die neuen Namensräume automatisch zerstört.

source: As an unprivileged user, create a new user namespace where the user\(cqs credentials are mapped to the root IDs inside the namespace:
de: Mit den Rechten eines unprivilegierten Benutzers einen neuen Benutzernamensraum erstellen, in welchem die Anmeldedaten des Benutzers auf die Root-Kennungen innerhalb des Namensraums abgebildet werden:

source: As an unprivileged user, create a user namespace where the first 65536 IDs are all mapped, and the user\(cqs credentials are mapped to the root IDs inside the namespace. The map is determined by the subordinate IDs assigned in B<subuid>(5) and B<subgid>(5). Demonstrate this mapping by creating a file with user ID 1 and group ID 1. For brevity, only the user ID mappings are shown:
de: Als unprivilegierter Benutzer einen Benutzer-Namensraum erstellen, in dem die ersten 65536 IDs alle abgebildet sind und die Anmeldedaten der Benutzer auf die Root-IDs innerhalb dieses Namensraums abgebildet sind. Die Abbildung wird durch die in B<subuid>(5) und B<subgid>(5) zugewiesenen Subordinaten-IDs bestimmt. Diese Abbildung durch Erstellung einer Datei mit der Benutzer-ID 1 und der Gruppen-ID 1 demonstrieren. Der Kürze halber werden nur die Abbildungen der Benutzer-IDs angezeigt:

source: The first of the following commands creates a new persistent UTS namespace and modifies the hostname as seen in that namespace. The namespace is then entered with B<nsenter>(1) in order to display the modified hostname; this step demonstrates that the UTS namespace continues to exist even though the namespace had no member processes after the B<unshare> command terminated. The namespace is then destroyed by removing the bind mount.
de: Der erste der folgenden Befehle erzeugt einen neuen dauerhaften UTS-Namenraum und ändert den Rechnernamen so, wie er im Namensraum gesehen wird. Der Namensraum wird dann mit B<nsenter>(1) betreten, um den geänderten Rechnernamen anzuzeigen; dieser Schritt demonstriert, dass der UTS-Namensraum weiter existiert, obwohl der Namensraum nach dem Beenden des B<unshare>-Prozesses keine eigenen Mitgliedprozesse mehr hat. Der Namensraum wird dann durch Entfernen der Bind-Einhängung zerstört.

source: The following commands establish a persistent mount namespace referenced by the bind mount I</root/namespaces/mnt>. In order to ensure that the creation of that bind mount succeeds, the parent directory (I</root/namespaces>) is made a bind mount whose propagation type is not B<shared>.
de: Die folgenden Befehle etablieren einen dauerhaften Einhängenamensraum, der von der »bind«-Einhängung I</root/namespaces/mnt> angegeben wird. Um sicherzustellen, dass die Erzeugung dieser Bind-Einhängung erfolgreich ist, wird das Elternverzeichnis (I</root/namespaces>) zu einer Bind-Einhängung, deren Ausbreitungstyp nicht B<shared> ist.

source: The following commands demonstrate the use of the B<--kill-child> option when creating a PID namespace, in order to ensure that when B<unshare> is killed, all of the processes within the PID namespace are killed.
de: Die folgenden Befehle demonstrieren die Verwendung der Option B<--kill-child> beim Erzeugen eines PID-Namensraums, um sicherzustellen, dass beim Töten von B<unshare> alle Prozesse innerhalb des PID-Namensraums getötet werden.

source: # set +m # Don\(aqt print job status messages
de: # set +m # Keine Meldungen zum Auftragsstatus ausgeben

source: # ps h -o \(aqcomm\(aq $! # Show that background job is unshare(1) unshare # kill $! # Kill unshare(1) # pidof sleep
de: # ps h -o \(aqcomm\(aq $! # Zeigen, dass der Hintergrund-Job unshare(1) ist unshare # kill $! # unshare(1) töten # pidof sleep

source: The B<pidof>(1) command prints no output, because the B<sleep> processes have been killed. More precisely, when the B<sleep> process that has PID 1 in the namespace (i.e., the namespace\(cqs init process) was killed, this caused all other processes in the namespace to be killed. By contrast, a similar series of commands where the B<--kill-child> option is not used shows that when B<unshare> terminates, the processes in the PID namespace are not killed:
de: Der Befehl B<pidof>(1) gibt nichts aus, da die Kindprozesse getötet wurden. Genauer gesagt: Wenn der B<sleep>-Prozess, der in dem Namensraum die Prozesskennung 1 hat (also der Init-Prozess dieses Namensraums) getötet wurde, dann werden daraufhin alle anderen Prozesse in diesem Namensraum getötet. Im Gegensatz dazu zeigt eine ähnliche Reihe von Befehlen, bei denen die Option B<--kill-child> nicht verwendet wird, dass die Prozesse in diesem PID-Namensraum beim Beenden von B<unshare> nicht getötet werden:

source: The following example demonstrates the creation of a time namespace where the boottime clock is set to a point several years in the past:
de: Der folgende Befehl demonstriert die Erzeugung eines Zeit-Namensraums, in dem die Bootzeit-Uhr auf einen Zeitpunkt gesetzt ist, der einige Jahre in der Vergangenheit liegt:

source: # uptime -p # Show uptime in initial time namespace up 21 hours, 30 minutes # unshare --time --fork --boottime 300000000 uptime -p up 9 years, 28 weeks, 1 day, 2 hours, 50 minutes
de: # uptime -p # Betriebszeit im ursprünglichen Zeit-Namensraum anzeigen up 21 hours, 30 minutes # unshare --time --fork --boottime 300000000 uptime -p up 9 years, 28 weeks, 1 day, 2 hours, 50 minutes

source: AUTHORS
de: AUTOREN

source: SEE ALSO
de: SIEHE AUCH

source: REPORTING BUGS
de: FEHLER MELDEN

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The B<unshare> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<unshare> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:

source: February 2016
de: Februar 2016

source: The B<unshare> command creates new namespaces (as specified by the command-line options described below) and then executes the specified I<program>. If I<program> is not given, then ``${SHELL}'' is run (default: /bin/sh).
de: Der Befehl B<unshare> erzeugt neue Namensräume (wie in den nachfolgend beschriebenen Befehlszeilenoptionen angegeben) und führt dann das angegebene I<Programm> aus. Falls kein I<Programm> angegeben ist, dann wird »${SHELL}« ausgeführt (Vorgabe: /bin/sh).

source: By default, a new namespace persists only as long as it has member processes. A new namespace can be made persistent even when it has no member processes by bind mounting /proc/I<pid>/ns/I<type> files to a filesystem path. A namespace that has been made persistent in this way can subsequently be entered with B<\%nsenter>(1) even after the I<program> terminates (except PID namespaces where a permanently running init process is required). Once a persistent \%namespace is no longer needed, it can be unpersisted by using B<umount>(8) to remove the bind mount. See the B<EXAMPLES> section for more details.
de: In der Voreinstellung ist ein neuer Namensraum nur so lange beständig, wie er Mitgliedprozesse hat. Ein neuer Namensraum kann beständig gemacht werden, selbst wenn es keine Mitgliedprozesse gibt, indem /proc/I<PID>/ns/I<Typ>-Dateien mit »bind« in einen Dateisystempfad eingebunden werden. Ein Namensraum, der auf diese Weise beständig gemacht wurde, kann anschließend mit B<\%nsenter>(1) betreten werden, sogar, wenn das I<Programm> beendet wird (außer PID-Namensräume, bei denen ein dauerhaft laufender Init-Prozess benötigt wird). Sobald ein beständiger \%Namensraum nicht länger benötigt wird, kann die Beständigkeit mit B<umount>(8) aufgehoben werden, um die Bind-Einhängung aufzuheben. Weitere Einzelheiten finden Sie im Abschnitt B<BEISPIELE>.

source: B<unshare> since util-linux version 2.36 uses /I<proc/[pid]/ns/pid_for_children> and I</proc/[pid]/ns/time_for_children> files for persistent PID and TIME namespaces. This change requires Linux kernel 4.17 or newer.
de: B<unshare> verwendet seit Util-linux Version 2.36 die Dateien /I<proc/[PID]/ns/pid_for_children> und I</proc/[PID]/ns/time_for_children> für dauerhafte PID- und ZEIT-Namensräume. Diese Änderung erfordert einen Linux-Kernel der Version 4.17 oder neuer.

source: Mounting and unmounting filesystems will not affect the rest of the system, except for filesystems which are explicitly marked as shared (with B<mount --make-shared>; see I</proc/self/mountinfo> or B<findmnt -o+PROPAGATION> for the B<shared> flags). For further details, see B<mount_namespaces>(7).
de: Ein- und Aushängen von Dateisystemen betrifft den Rest des Systems nicht, außer für Dateisysteme, die explizit als Mehrfacheinhängungen markiert sind (mit B<mount --make-shared>; siehe I</proc/self/mountinfo> oder B<findmnt -o+PROPAGATION> für die B<shared>-Schalter). Für weitere Details siehe B<mount_namespaces>(7).

source: B<unshare> since util-linux version 2.27 automatically sets propagation to B<private> in a new mount namespace to make sure that the new namespace is really unshared. It's possible to disable this feature with option B<--propagation unchanged>. Note that B<private> is the kernel default.
de: Seit Util-Linux Version 2.27 setzt B<unshare> die Ausbreitung in einem neuen Einhängenamensraum auf B<private>, um sicherzustellen, dass der neue Namensraum wirklich getrennt ist. Diese Funktionalität kann mit der Option B<--propagation unchanged> deaktiviert werden. Beachten Sie, dass B<private> die Vorgabe des Kernels ist.

source: Setting hostname or domainname will not affect the rest of the system. For further details, see B<uts_namespaces>(7).
de: Setzen des Rechner- oder Domain-Namens wird den Rest des Systems nicht betreffen. Für weitere Details siehe B<uts_namespaces>(7).

source: The process will have an independent namespace for POSIX message queues as well as System V \%message queues, semaphore sets and shared memory segments. For further details, see B<ipc_namespaces>(7).
de: Der Prozess wird einen unabhängigen Namensraum für POSIX-Nachrichtenwarteschlangen sowie System-V-\%Nachrichtenwarteschlangen, Semaphore-Gruppen und gemeinsame Speichersegmente haben. Für weitere Details siehe B<ipc_namespaces>(7).

source: The process will have independent IPv4 and IPv6 stacks, IP routing tables, firewall rules, the I</proc/net> and I</sys/class/net> directory trees, sockets, etc. For further details, see B<network_namespaces>(7).
de: Der Prozess wird über unabhängige IPv4- und IPv6-Stapel, IP-Routing-Tabellen, Firewall-Regeln, die Verzeichnisbäume I</proc/net> und I</sys/class/net> usw. verfügen. Für weitere Details siehe B<network_namespaces>(7).

source: Children will have a distinct set of PID-to-process mappings from their parent. For further details, see B<pid_namespaces>(7).
de: Kindprozesse werden eine eigene Gruppe von Abbildungen der PIDs zu Prozessen haben. Für weitere Details siehe B<pid_namespaces>(7).

source: The process will have a virtualized view of I</proc\:/self\:/cgroup>, and new cgroup mounts will be rooted at the namespace cgroup root. For further details, see B<cgroup_namespaces>(7).
de: Der Prozess wird über einen virtualisierten Blick auf I</proc\:/self\:/cgroup> verfügen und neue Cgroup-Einhängungen werden ihre Wurzel in der Wurzel der Cgroup-Namensraum-Wurzel haben. Für weitere Details siehe B<cgroup_namespaces>(7).

source: The process will have a distinct set of UIDs, GIDs and capabilities. For further details, see B<user_namespaces>(7).
de: Der Prozess wird über eine eindeutige Gruppe an UIDs, GIDS und Capabilities verfügen. Für weitere Details siehe B<user_namespaces>(7).

source: The process can have a distinct view of B<CLOCK_MONOTONIC> and/or B<CLOCK_BOOTTIME> which can be changed using I</proc/self/timens_offsets>. For further details, see B<time_namespaces>(7).
de: Der Prozess kann eine abweichende Sicht auf B<CLOCK_MONOTONIC> und/oder B<CLOCK_BOOTTIME> haben, was mittels I</proc/self/timens_offsets> geändert werden kann. Für weitere Details, siehe B<time_namespaces>(7).

source: B<-i>,B< --ipc>[B<=>I<file>]
de: B<-i>,B< --ipc>[B<=>I<Datei>]

source: Unshare the IPC namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des IPC-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: B<-m>,B< --mount>[B<=>I<file>]
de: B<-m>,B< --mount>[B<=>I<Datei>]

source: Unshare the mount namespace. If I<file> is specified, then a persistent namespace is created by a bind mount. Note that I<file> must be located on a mount whose propagation type is not B<shared> (or an error results). Use the command B<findmnt -o+PROPAGATION> when not sure about the current setting. See also the examples below.
de: Hebt die Freigabe des eingehängten Namensraums auf. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum durch ein Einhängen mit »bind« erstellt. Beachten Sie, dass I<Datei> auf einem Dateisystem liegen muss, dessen Ausbreitungstyp nicht auf B<shared> gesetzt ist (anderenfalls würde ein Fehler auftreten). Verwenden Sie den Befehl B<findmnt -o+PROPAGATION>, wenn Sie sich bezüglich der derzeitigen Einstellung nicht sicher sind. Lesen Sie auch die nachfolgenden Beispiele.

source: B<-n>,B< --net>[B<=>I<file>]
de: B<-n>,B< --net>[B<=>I<Datei>]

source: Unshare the network namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des Netz-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: B<-p>,B< --pid>[B<=>I<file>]
de: B<-p>,B< --pid>[B<=>I<Datei>]

source: Unshare the PID namespace. If I<file> is specified, then a persistent namespace is created by a bind mount. (Creation of a persistent PID namespace will fail if the B<--fork> option is not also specified.)
de: Trennen des PID-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt. (Die Erstellung eines beständigen Namensraums wird fehlschlagen, wenn nicht auch die Option B<--fork> angegeben ist.)

source: B<-u>,B< --uts>[B<=>I<file>]
de: B<-u>,B< --uts>[B<=>I<Datei>]

source: Unshare the UTS namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des UTS-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: B<-U>,B< --user>[B<=>I<file>]
de: B<-U>,B< --user>[B<=>I<Datei>]

source: Unshare the user namespace. If I<file> is specified, then a persistent namespace is created by a bind mount.
de: Trennen des Benutzer-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: B<-C>,B< --cgroup>[B<=>I<file>]
de: B<-C>,B< --cgroup>[B<=>I<Datei>]

source: Unshare the cgroup namespace. If I<file> is specified then persistent namespace is created by bind mount.
de: Trennen des Cgroup-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt.

source: B<-T>,B< --time>[B<=>I<file>]
de: B<-T>,B< --time>[B<=>I<Datei>]

source: Unshare the time namespace. If I<file> is specified then a persistent namespace is created by a bind mount. The B<--monotonic> and B<--boottime> options can be used to specify the corresponding offset in the time namespace.
de: Trennen des Zeit-Namensraums. Falls I<Datei> angegeben ist, wird ein beständiger Namensraum mit einer »bind«-Einhängung erstellt. Mit den Optionen B<--monotonic> und B<--bootime> können Sie den korrespondierenden Versatz im Zeit-Namensraum angeben.

source: Fork the specified I<program> as a child process of B<unshare> rather than running it directly. This is useful when creating a new PID namespace. Note that when B<unshare> is waiting for the child process, then it ignores SIGINT and SIGTERM and does not forward any signals to the child. It is necessary to send signals to the child process.
de: Forkt das angegebene I<Programm> als Kindprozess von B<unshare>, anstatt es direkt auszuführen. Dies ist nützlich, wenn Sie einen neuen PID-Namensraum erstellen. Beachten Sie: Wenn B<unshare> auf einen Kindprozess wartet, dann ignoriert es SIGINT und SIGTERM und leitet keine Signale an den Kindprozess weiter. Es ist daher nötig, Signale an den Kindprozess zu senden.

source: When B<unshare> terminates, have I<signame> be sent to the forked child process. Combined with B<--pid> this allows for an easy and reliable killing of the entire process tree below B<unshare>. If not given, I<signame> defaults to B<SIGKILL>. This option implies B<--fork>.
de: Wenn sich B<unshare> beendet, soll I<Signame> an den mit Fork erstellten Kindprozess gesandt werden. Kombiniert mit B<--pid> erlaubt dies ein leichtes und zuverlässiges Töten eines gesamten Prozessbaums unterhalb von B<unshare>. Falls nicht angegeben, ist I<Signame> standardmäßig B<SIGKILL>. Diese Option impliziert B<--fork>.

source: Just before running the program, mount the proc filesystem at I<mountpoint> (default is /proc). This is useful when creating a new PID namespace. It also implies creating a new mount namespace since the /proc mount would otherwise mess up existing programs on the system. The new proc filesystem is explicitly mounted as private (with MS_PRIVATE|MS_REC).
de: Direkt vor Ausführung des Programms wird das proc-Dateisystem unter I<Einhängepunkt> (Vorgabe ist /proc) eingehängt. Das ist bei der Erstellung eines neuen PID-Namensraums nützlich. Dies impliziert auch die Erstellung eines neuen Einhängenamensraums, da die /proc-Einhängung ansonsten bestehende Programme auf dem System durcheinanderbringen würde. Das neue proc-Dateisystem wird explizit als privat eingehängt (mit MS_PRIVATE|MS_REC).

source: Run the program only after the current effective user ID has been mapped to I<uid>. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--user>.
de: führt das Programm erst aus, nachdem die aktuelle effektive Benutzerkennung auf I<UID> gesetzt wurde. Falls diese Option mehrfach angegeben wird, hat die zuletzt angegebene Option Vorrang. Diese Option impliziert B<--user>.

source: Run the program only after the current effective group ID has been mapped to I<gid>. If this option is specified multiple times, the last occurrence takes precedence. This option implies B<--setgroups=deny> and B<--user>.
de: führt das Programm erst aus, nachdem die aktuelle effektive Gruppenkennung auf I<GID> gesetzt wurde. Falls diese Option mehrfach angegeben wird, hat die zuletzt angegebene Option Vorrang. Diese Option impliziert B<--setgroups=deny> und B<--user>.

source: Run the program only after the current effective user and group IDs have been mapped to the superuser UID and GID in the newly created user namespace. This makes it possible to conveniently gain capabilities needed to manage various aspects of the newly created namespaces (such as configuring interfaces in the network namespace or mounting filesystems in the mount namespace) even when run unprivileged. As a mere convenience feature, it does not support more sophisticated use cases, such as mapping multiple ranges of UIDs and GIDs. This option implies B<--setgroups=deny> and B<--user>. This option is equivalent to B<--map-user=0 --map-group=0>.
de: Führt das Programm erst aus, wenn die effektive Benutzer- und Gruppenkennungen auf die UID und GID des Systemverwalters in dem neu erstellten Namensraum abgebildet wurde. Dies ermöglicht es, bequem die benötigten Capabilities zu erlangen, um verschiedene Aspekte in dem neu erstellten Namensraum zu verwalten (wie die Konfiguration von Schnittstellen im Netz-Namensraum oder das Einhängen von Dateisystemen in dem Einhängenamensraum), selbst bei unprivilegierter Ausführung. Als reine Bequemlichkeitsfunktionalität unterstützt es keine fortgeschritteneren Anwendungsfälle, wie das Abbilden von mehreren Bereichen von UIDs und GIDs. Diese Option impliziert B<--setgroups=deny> und B<--user>. Diese Option ist äquivalent zu B<--map-user=0 --map-group=0>.

source: Run the program only after the current effective user and group IDs have been mapped to the same UID and GID in the newly created user namespace. This option implies B<--setgroups=deny> and B<--user>. This option is equivalent to B<--map-user=$(id -ru) --map-group=$(id -rg)>.
de: führt das Programm erst aus, nachdem die aktuellen effektiven Benutzer- und Gruppenkennungen im neu erzeugten Benutzernamensraum auf die gleiche UID und GID gesetzt wurden. Diese Option impliziert B<--setgroups=deny> und B<--user>. Diese Option ist äquivalent zu B<--map-user=$(id -ru) --map-group=$(id -rg)>.
