Repository: sebras/manpages-l10n
Catalog: po/*/man1/usb-devices.1.po
Languages: de

source: 23 June 2009
de: 23. Juni 2009

source: Linux USB Utilities
de: Linux USB-Dienstprogramme

source: NAME
de: BEZEICHNUNG

source: usb-devices - print USB device details
de: usb-devices - Details zu USB-Geräten ausgeben

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<usb-devices> is a shell script that can be used to display details of USB buses in the system and the devices connected to them.
de: B<usb-devices> ist ein Shellskript, das zum Anzeigen der Details zu USB-Bussen im System und den damit verbundenen Geräten verwendet werden kann.

source: The output of the script is similar to the I<usb/devices> file available either under I</proc/bus> (if usbfs is mounted), or under I</sys/kernel/debug> (if debugfs is mounted there). The script is primarily intended to be used if the file is not available.
de: Die Ausgabe des Skripts ähnelt der Datei I<usb/devices>, die normalerweise unter I</proc/bus> (bei eingehängtem usbfs) oder unter I</sys/kernel/debug> (bei dort eingehängtem debugfs) gefunden werden kann. Das Skript ist vorrangig dazu gedacht, verwendet zu werden, falls die Datei nicht verfügbar ist.

source: In contrast to the I<usb/devices> file, this script only lists I<active> interfaces (those marked with a "*" in the I<usb/devices> file) and their endpoints.
de: Im Gegensatz zur Datei I<usb/devices> führt dieses Skript nur I<aktive> Schnittstellen (jene, die mit einem »*« in der Datei I<usb/devices> markiert sind) und deren Endpunkte auf.

source: Be advised that there can be differences in the way information is sorted, as well as in the format of the output.
de: Beachten Sie, dass die Art der Sortierung sowie das Format der ausgegebenen Informationen unterschiedlich sein können.

source: RETURN VALUE
de: RÜCKGABEWERT

source: If sysfs is not mounted, a non-zero exit code is returned.
de: Falls sysfs nicht eingehängt ist, wird ein von Null verschiedener Exit-Code zurückgegeben.

source: FILES
de: DATEIEN

source: The part of the sysfs tree the script walks through to assemble the printed information.
de: Der Teil des Sysfs-Baums, den das Skript durchläuft, um die auszugebenden Informationen zusammenzustellen.

source: Location where the I<usb/devices> file can normally be found for Linux kernels before 2.6.31, if usbfs is mounted.
de: Ort, an dem die Datei I<usb/devices> für Linux-Kernel vor 2.6.31 normalerweise gefunden werden kann, falls usbfs eingehängt ist.

source: Location where the I<usb/devices> file can normally be found for Linux kernel 2.6.31 and later, if debugfs is mounted.
de: Ort, an dem die Datei I<usb/devices> für Linux-Kernel der Version 2.6.31 und neuer normalerweise gefunden werden kann, falls debugfs eingehängt ist.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: B<usb-devices> is a (bash) shell script that can be used to display details of USB buses in the system and the devices connected to them.
de: B<usb-devices> ist ein (Bash-)Shellskript, das zum Anzeigen der Details zu USB-Bussen im System und den damit verbundenen Geräten verwendet werden kann.
