Repository: sebras/manpages-l10n
Catalog: po/*/man1/uucp.1.po
Languages: pl

source: NAME
pl: NAZWA

source: uucp - Unix to Unix copy
pl: uucp - Kopiowanie z Uniksa na Unix (Unix to Unix copy)

source: SYNOPSIS
pl: SKŁADNIA

source: B<uucp> [ options ] source-file destination-file
pl: B<uucp> [I<opcje>] I<plik-źródłowy plik-docelowy>

source: B<uucp> [ options ] source-file... destination-directory
pl: B<uucp> [I<opcje>] I<plik-źródłowy... katalog-docelowy>

source: DESCRIPTION
pl: OPIS

source: The I<uucp> command copies files between systems. Each I<file> argument is either a pathname on the local machine or is of the form
pl: Polecenie I<uucp> kopiuje pliki między dwoma systemami. Każdy argument plikowy może być albo ścieżką do pliku na lokalnej maszynie, albo może mieć postać

source: system!path
pl: system!ścieżka

source: which is interpreted as being on a remote system. In the first form, the contents of the first file are copied to the second. In the second form, each source file is copied into the destination directory.
pl: która jest odczytywana jako plik na zdalnym systemie. W pierwszej postaci, zawartość pierwszego pliku jest kopiowana do drugiego. W drugim wypadku, każdy plik źródłowy jest kopiowany do katalogu docelowego.

source: A file be transferred to or from I<system2> via I<system1> by using
pl: Plik może być przeniesiony z lub do I<systemu2> poprzez I<system1> przy użyciu

source: system1!system2!path.
pl: system1!system2!ścieżka.

source: Any pathname that does not begin with / or ~ will be appended to the current directory (unless the B<-W> or B<--noexpand> option is used); this resulting path will not necessarily exist on a remote system. A pathname beginning with a simple ~ starts at the UUCP public directory; a pathname beginning with ~name starts at the home directory of the named user. The ~ is interpreted on the appropriate system. Note that some shells will interpret a simple ~ to the local home directory before I<uucp> sees it; to avoid this the ~ must be quoted.
pl: Każda ścieżka, która nie zaczyna się od / lub ~, będzie doklejona do bieżącego katalogu roboczego (chyba że użyto opcji B<-W> lub B<--noexpand>); tak powstała ścieżka niekoniecznie musi istnieć na maszynie zdalnej. Ścieżka rozpoczynająca się od ~ wskazuje na katalog publiczny UUCP; ścieżka zaczynająca się od ~nazwa wskazuje na katalog domowy podanego użytkownika. ~ jest interpretowane na odpowiednim systemie. Zauważ, że niektóre powłoki interpretują tyldę ~ jako katalog domowy zanim zostanie przekazana do I<uucp>; aby temu zapobiec, ~ powinno być cytowane.

source: Shell metacharacters ? * [ ] are interpreted on the appropriate system, assuming they are quoted to prevent the shell from interpreting them first.
pl: Metaznaki ? * [ ] powłoki są interpretowane na odpowiednim systemie, przy założeniu, że są zacytowane, aby zapobiec ich interpretacji przez lokalną powłokę.

source: The copy does not take place immediately, but is queued up for the I<uucico> (8) daemon; the daemon is started immediately unless the B<-r> or B<--nouucico> switch is given. In any case, the next time the remote system is called the file(s) will be copied.
pl: Kopiowanie nie następuje natychmiast, lecz jest kolejkowane dla demona I<uucico>(8); demon jest uruchamiany natychmiast, chyba że podano przełączniki B<-r> lub B<--nouucico>. W każdym wypadku pliki zostaną skopiowane podczas następnej sesji połączeniowej ze zdalnym systemem.

source: OPTIONS
pl: OPCJE

source: The following options may be given to I<uucp.>
pl: Programowi I<uucp> można przekazać następujące opcje:

source: Do not copy local source files to the spool directory. If they are removed before being processed by the I<uucico> (8) daemon, the copy will fail. The files must be readable by the I<uucico> (8) daemon, and by the invoking user.
pl: Zakazuje kopiowania lokalnych plików źródłowych do katalogu kolejkowego. Jeśli zostaną one usunięte przed obróbką przez demona I<uucico>(8), to kopiowanie się nie powiedzie. Pliki muszą być odczytywalne przez demona I<uucico>(8) oraz przez wywołującego użytkownika.

source: Copy local source files to the spool directory. This is the default.
pl: Kopiuje lokalne pliki źródłowe do katalogu kolejkowego. Tak jest domyślnie.

source: Create all necessary directories when doing the copy. This is the default.
pl: Podczas kopiowania tworzy wszystkie potrzebne katalogi. Tak jest domyślnie.

source: If any necessary directories do not exist for the destination path, abort the copy.
pl: Jeśli potrzebne katalogi nie istnieją w ścieżce docelowej, przerywa kopiowanie.

source: If any of the source file names are directories, copy their contents recursively to the destination (which must itself be a directory).
pl: Jeśli jakaś z nazw plików źródłowych wskazuje na katalog, kopiuje rekurencyjnie jego zawartość.

source: B<-g grade, --grade grade>
pl: B<-g stopień, --grade stopień>

source: Set the grade of the file transfer command. Jobs of a higher grade are executed first. Grades run 0 ... 9 A ... Z a ... z from high to low.
pl: Ustawia poziom polecenia transferu plików. Zadania o wyższym poziomie są wywoływane jako pierwsze. Poziomy odpowiadają 0 ... 9 A ... Z a ... z od najwyższego do najniższego.

source: Report completion or failure of the file transfer by I<mail> (1).
pl: Zgłasza zakończenie lub błąd transferu za pomocą I<mail>(1).

source: B<-n user, --notify user>
pl: B<-n user, --notify użytkownik>

source: Report completion or failure of the file transfer by I<mail> (1) to the named user on the remote system.
pl: Zgłasza zakończenie lub błąd transferu za pomocą I<mail>(1) wskazanemu użytkownikowi systemu zdalnego.

source: Do not start I<uucico> (8) daemon immediately; merely queue up the file transfer for later execution.
pl: Nie uruchamia demona I<uucico>(8) natychmiast; zamiast tego po prostu kolejkuje zadanie na przyszłość.

source: Print jobid on standard output. The job may be later cancelled by passing the jobid to the B<-k> switch of I<uustat> (1). It is possible for some complex operations to produce more than one jobid, in which case each will be printed on a separate line. For example
pl: Wypisuje na standardowym wyjściu identyfikator zadania. Zadanie może być potem odwołane przez przekazanie identyfikatora przełącznikowi B<-k> polecenia I<uustat>(1). W przypadku złożonych operacji możliwe jest utworzenie więcej niż jednego identyfikatora; wówczas zostaną one wypisane w oddzielnych wierszach. Na przykład

source: will generate two separate jobs, one for the system I<sys1> and one for the system I<sys2.>
pl: wygeneruje dwa oddzielne zadania, jedno dla systemu I<sys1>, a drugie dla systemu I<sys2>.

source: Do not prepend remote relative path names with the current directory.
pl: Nie dopisuje zdalnych względnych ścieżek do katalogu bieżącego.

source: This option is used by the I<uuto> shell script. It causes I<uucp> to interpret the final argument as I<system!user.> The file(s) are sent to I<~/receive/USER/LOCAL> on the remote system, where I<USER> is from the final argument and I<LOCAL> is the local UUCP system name. Also, I<uucp> will act as though I<--notify user> were specified.
pl: Opcja ta jest używana przez skrypt powłoki I<uuto>. Powoduje ona, że I<uucp> interpretuje ostatni argument jako I<system!user>. Pliki są wysyłane do I<~/receive/USER/LOCAL> zdalnego systemu, gdzie I<USER> jest ostatnim argumentem, a I<LOCAL> jest lokalną nazwą systemu UUCP. Dodatkowo, I<uucp> będzie się zachowywać tak, jakby podano I<--notify>userI<.>

source: B<-x type, --debug type>
pl: B<-x typ, --debug typ>

source: Turn on particular debugging types. The following types are recognized: abnormal, chat, handshake, uucp-proto, proto, port, config, spooldir, execute, incoming, outgoing. Only abnormal, config, spooldir and execute are meaningful for I<uucp.>
pl: Włącza dany rodzaj diagnostyki. Rozpoznawane są następujące: abnormal, chat, handshake, uucp-proto, proto, port, config, spooldir, execute, incoming, outgoing. Znaczenie dla uucp mają tylko abnormal, config, spooldir i execute.

source: Multiple types may be given, separated by commas, and the B<--debug> option may appear multiple times. A number may also be given, which will turn on that many types from the foregoing list; for example, B<--debug 2> is equivalent to B<--debug abnormal,chat.>
pl: Można podać wiele typów rozdzielonych przecinkami, a opcja B<--debug> może pojawić się wiele razy. Można podać również liczbę, która włączy kolejne opcje listy, na przykład B<--debug 2> jest równoważne B<--debug abnormal,chat.>

source: B<-I file, --config file>
pl: B<-I plik, --config plik>

source: Set configuration file to use. This option may not be available, depending upon how I<uucp> was compiled.
pl: Wskazuje plik konfiguracyjny, z którego ma korzystać program. Opcja ta może być niedostępna, zależnie od tego, jak skompilowano I<uucp>.

source: Report version information and exit.
pl: Pokazuje informację o wersji programu i kończy działanie.

source: Print a help message and exit.
pl: Wyświetla komunikat pomocy i wychodzi.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: BUGS
pl: BŁĘDY

source: Some of the options are dependent on the capabilities of the I<uucico> (8) daemon on the remote system.
pl: Niektóre opcje zależą od właściwości demona I<uucico>(8) zdalnego systemu.

source: The I<-n> and I<-m> switches do not work when transferring a file from one remote system to another.
pl: Przełączniki I<-n> i I<-m> nie działają podczas transferowania pliku z jednego zdalnego systemu na inny.

source: File modes are not preserved, except for the execute bit. The resulting file is owned by the uucp user.
pl: Nie są chronione prawa plików, poza bitem wykonania. Właścicielem pliku wynikowego jest użytkownik uucp.

source: AUTHOR
pl: AUTOR

source: Do not copy local source files to the spool directory. If they are removed before being processed by the I<uucico> (8) daemon, the copy will fail. The files must be readable by the I<uucico> (8) daemon, and by the invoking user. This is the default.
pl: Zakazuje kopiowania lokalnych plików źródłowych do katalogu kolejkowego. Jeśli zostaną one usunięte przed obróbką przez demona I<uucico>(8), to kopiowanie się nie powiedzie. Pliki muszą być odczytywalne przez demona I<uucico>(8) oraz przez wywołującego użytkownika. Tak jest domyślnie.

source: Copy local source files to the spool directory.
pl: Kopiuje lokalne pliki źródłowe do katalogu kolejkowego.
