Repository: sebras/manpages-l10n
Catalog: po/*/man1/vlock.1.po
Languages: de

source: 16 May 1996
de: 16. Mai 1996

source: NAME
de: BEZEICHNUNG

source: vlock - Virtual Console lock program
de: vlock - Sperren von virtuellen Konsolen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<vlock> is a program to lock one or more sessions on the Linux console. This is especially useful for Linux machines which have multiple users with access to the console. One user may lock his or her session(s) while still allowing other users to use the system on other virtual consoles. If desired, the entire console may be locked and virtual console switching disabled.
de: B<vlock> ist ein Programm zum Sperren einer oder mehrerer Sitzungen auf der Linux-Konsole. Dies ist besonders für Linux-Maschinen nützlich, bei denen mehrere Benutzer Zugriff auf die Konsole haben. Ein(e) Benutzer(in) kann seine/ihre Sitzung(en) sperren und dennoch können andere Benutzer das System auf anderen virtuellen Konsolen benutzen. Falls gewünscht, kann die gesamte Konsole gesperrt und das Umschalten zwischen virtuellen Konsolen deaktiviert werden.

source: By default, only the current VC (virtual console) is locked. With the B<-a,-all> option all VCs are locked. The locked VCs cannot be unlocked without the invoker's password. And, for the paranoid, vlock makes it a trying experience for those attempting to guess the password, so unauthorized access to session(s) is highly unlikely.
de: Standardmäßig wird nur die aktuelle VC (virtuelle Konsole) gesperrt. Mit der Option B<-a,-all> werden alle virtuellen Konsolen gesperrt. Die gesperrten VCs können ohne das Passwort des Aufrufenden nicht entsperrt werden. Und für die Paranoiden macht Vlock es zu einer Herausforderung, das Passwort zu raten, so dass unberechtigter Zugriff auf Sitzung(en) sehr unwahrscheinlich wird.

source: Please note that it is entirely possible to completely lock yourself out of the console with the B<-a,--all> option if you cannot remember your password! Unless you are able to kill vlock by logging in remotely via a serial terminal or network, a hard reset is the only method of ``unlocking'' the display.
de: Bitte beachten Sie, dass es gut möglich ist, dass Sie sich selber von der Konsole mit der Option B<-a,--all> aussperren, falls Sie sich nicht an Ihr Passwort erinnern können. Dann ist ein harter Neustart die einzige Methode, die Anzeige zu »entsperren«, wenn Sie keine Möglichkeit haben, sich aus der Ferne über ein serielles Terminal oder das Netzwerk anzumelden und Vlock zu töten.

source: B<vlock> works for console sessions primarily. However, there is support for trying to lock non-console sessions as well, but that support has not been well tested.
de: B<vlock> funktioniert hauptsächlich für das Sperren von Konsole-Sitzungen. Es gibt aber auch Unterstützung für das Sperren von Nicht-Konsole-Sitzungen; dies wurde aber nicht ausreichend getestet.

source: OPTIONS
de: OPTIONEN

source: Lock all console sessions and disable VC switching.
de: Alle Konsolensitzungen sperren und VC-Umschaltung deaktivieren.

source: Lock the current session (this is the default).
de: Die aktuelle Sitzung sperren (dies ist die Vorgabe).

source: Print a brief help message.
de: Eine kurze Hilfemeldung ausgeben.

source: Print the version number of B<vlock>.
de: Die Versionsnummer von B<vlock> ausgeben.

source: AUTHOR
de: AUTOR

source: 28 July 2007
de: 28. Juli 2007

source: Linux User's Manual
de: Linux-Anwenderhandbuch

source: B<vlock [ -acns ] [ -t E<lt>timeoutE<gt> ] [ plugins... ]>
de: B<vlock [ -acns ] [ -t E<lt>ZeitüberschreitungE<gt> ] [ Erweiterungen… ]>

source: By default, only the current VC (virtual console) is locked. With the B<-a,--all> option all VCs are locked. The locked VCs cannot be unlocked without the invoker's password or the root password. The root password will always be able to unlock any or all sessions, unless disabled at compile time.
de: Standardmäßig wird nur die aktuelle VC (virtuelle Konsole) gesperrt. Mit der Option B<-a,--all> werden alle virtuellen Konsolen gesperrt. Die gesperrten VCs können ohne das Passwort des Aufrufenden oder von Root nicht entsperrt werden. Das Root-Passwort ist immer in der Lage, jede oder alle Sitzungen zu entsperren, außer dies wurde beim Kompilieren deaktiviert.

source: When locking the entire console display it is sometimes still possible to kill vlock using the Secure Access Key (SAK) or other commands that are available through the SysRq mechanism. When the B<-s,--disable-sysrq> and B<-a,--all> options are given the SysRq mechanism is disabled while vlock is running. See /usr/src/linux/Documentation/sysrq.txt for more details.
de: Wenn die gesamte Konsolenanzeige gesperrt wurde, ist es manchmal noch möglich, Vlock über den Sicheren Zugriffsschlüssel (SAK) oder andere Befehle, die über den SysRq-Mechanismus verfügbar sind, zu töten. Wenn die Optionen B<-s,--disable-sysrq> und B<-a,--all> angegeben sind, wird der SysRq-Mechanismus zur Laufzeit von Vlock deaktiviert. Siehe I</usr/src/linux/Documentation/sysrq.txt> für weitere Details.

source: vlock works for console sessions primarily. To lock the entire console display from an X session use the B<-n,--new> option. This will make vlock switch to an empty virtual console to lock the display.
de: Vlock funktioniert primär von Konsole-Sitzungen aus. Um die gesamte Konsolenanzeige aus einer X-Sitzung zu sperren, verwenden Sie die Option B<-n,--new>. Damit schaltet Vlock auf eine leere virtuelle Konsole um, um die Anzeige zu sperren.

source: The options B<-n,--new>, B<-s,--disable-sysrq>, and B<-t,--timeout> only work if vlock is compiled with plugin support. See the PLUGINS section for more information.
de: Die Optionen B<-n,--new>, B<-s,--disable-sysrq> und B<-t,--timeout> funktionieren nur, falls Vlock mit Unterstützung für Erweiterungen kompiliert wurde. Siehe den Abschnitt ERWEITERUNGEN für weitere Informationen.

source: Switch to a new virtual console before locking all console sessions.
de: Auf eine neue virtuelle Konsole umschalten, bevor alle Konsolesitzungen gesperrt werden.

source: Disable the SysRq mechanism while consoles are locked. This option only works if the B<-a,--all> option given.
de: Den SysRq-Mechanismus deaktivieren, während die Konsolen gesperrt sind. Diese Option funktioniert nur, falls die Option B<-a,--all> angegeben wurde.

source: B<-t,--timeout E<lt>secondsE<gt>>
de: B<-t,--timeout E<lt>SekundenE<gt>>

source: Specify the timeout for the screensaver plugins. See vlock-plugins(5) for more information.
de: Gibt die Zeitüberschreitung für die Bildschirmschoner-Erweiterungen an. Siehe B<vlock-plugins>(5) für weitere Informationen.

source: Print the version number.
de: Gibt die Versionsnummer aus.

source: ENVIRONMENT VARIABLES
de: UMGEBUNGSVARIABLEN

source: The following environment variables can be used to change vlock's behavior:
de: Die folgenden Umgebungsvariablen können zur Änderung des Verhaltens von Vlock verwandt werden:

source: If this variable is when B<vlock> is run as root (uid 0) vlock locks the screen as this user instead of root. The root password will still be able to unlock the session, unless disabled at compile time.
de: Falls diese Variable gesetzt ist, wenn B<vlock> als root (uid 0) ausgeführt wird, sperrt Vlock den Bildschirm als dieser Benutzer anstelle von root. Die Sitzung kann immer noch mit dem root-Passwort entsperrt werden, außer wenn dies beim Kompilieren deaktiviert wurde.

source: If this variable is set and all consoles are locked its contents will be used as the locking message instead of the default message.
de: Falls diese Variable gesetzt ist und alle Konsolen gesperrt sind, wird ihr Inhalt als Sperrmeldung statt der Vorgabemeldung verwandt.

source: If this variable is set and only the current consoles is locked its contents will be used as the locking message instead of the default message.
de: Falls diese Variable gesetzt ist und die aktuelle Konsole gesperrt ist, wird ihr Inhalt als Sperrmeldung statt der Vorgabemeldung verwandt.

source: If this variable is set its contents will be used as the locking message instead of the default. This overrides the former two variables.
de: Falls diese Variable gesetzt ist, wird ihr Inhalt als Sperrmeldung statt der Vorgabemeldung verwandt. Dies setzt die vorherigen zwei Variablen außer Kraft.

source: If this variable is set it is interpreted as a space separated list of plugins that will be loaded when vlock starts additionally to the ones listed on the command line.
de: Falls diese Variable gesetzt ist, wird sie als als eine durch Leerraum getrennte Liste von Erweiterungen interpretiert, die beim Start von Vlock zusätzlich zu den auf der Befehlszeile angegebenen Erweiterungen geladen werden.

source: Set this variable to specify the timeout (in seconds) after which the screen saver plugins (if any) will be invoked. If this variable is unset or set to an invalid value or 0 no timeout is used. See vlock-plugins(5) for more information about plugins.
de: Setzen Sie diese Variable, um die Zeitüberschreitung (in Sekunden) festzulegen, nach der die Erweiterungen für den Bildschirmschoner (falls vorhanden) aufgerufen werden. Falls diese Variable nicht oder auf einen ungültigen Wert oder 0 gesetzt ist, wird keine Zeitüberschreitung verwandt. Siehe B<vlock-plugins>(5) für weitere Informationen über Erweiterungen.

source: Set this variable to specify the amount of time (in seconds) you will have to enter your password at the password prompt. If this variable is unset or set to an invalid value or 0 no timeout is used. B<Warning>: If this value is too low, you may not be able to unlock your session.
de: Setzen Sie diese Variable, um die Zeitdauer (in Sekunden) festzulegen, die Sie für die Eingabe Ihres Passworts an der Aufforderung dazu haben. Falls diese Variable nicht oder auf einen ungültigen Wert oder 0 gesetzt ist, wird keine Zeitüberschreitung verwandt. B<Warnung>: Falls dieser Wert zu klein ist, könnte es sein, dass Sie Ihre Sitzung nicht entsperren können.

source: FILES
de: DATEIEN

source: This file is read by B<vlock> on startup if it exists. All the variables mentioned above can be set here.
de: Falls diese Datei existiert, wird sie beim Start von B<vlock> gelesen. Alle der vorstehend genannten Variablen können hier gesetzt werden.

source: SECURITY
de: SICHERHEIT

source: See the SECURITY file in the B<vlock> distribution for more information.
de: Siehe die Datei SECURITY in der B<vlock>-Distribution für weitere Informationen.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN
