Repository: sebras/manpages-l10n
Catalog: po/*/man1/whereis.1.po
Languages: pl, uk

source: User Commands
pl: Polecenia użytkownika
uk: Команди користувача

source: NAME
pl: NAZWA
uk: НАЗВА

source: whereis - locate the binary, source, and manual page files for a command
pl: whereis - znajdź pliki binarne, źródłowe i strony podręcznika dla danego polecenia
uk: wheris — визначення місця виконуваних файлів, коду та сторінки підручника програми

source: SYNOPSIS
pl: SKŁADNIA
uk: КОРОТКИЙ ОПИС

source: B<whereis> [options] [B<-BMS> I<directory>... B<-f>] I<name>...
pl: B<whereis> [I<opcje>] [B<-BMS> I<katalog>... B<-f>] I<nazwa_pliku>...
uk: B<whereis> [параметри] [B<-BMS> I<каталог>... B<-f>] I<назва>...

source: DESCRIPTION
pl: OPIS
uk: ОПИС

source: B<whereis> locates the binary, source and manual files for the specified command names. The supplied names are first stripped of leading pathname components. Prefixes of B<s.> resulting from use of source code control are also dealt with. B<whereis> then attempts to locate the desired program in the standard Linux places, and in the places specified by B<$PATH> and B<$MANPATH>.
pl: B<whereis> lokalizuje pliki binarne, źródłowe i podręczniki systemowe dla zadanych nazw poleceń. Z podanych nazw wstępnie usuwana jest początkowa składowa określająca ścieżkę. Przedrostki B<s.> wynikające z użycia kontroli kodu źródłowego są również obsługiwane. Następnie B<whereis> usiłuje zlokalizować położenie żądanego programu, posługując się listą standardowych miejsc linuksowych oraz w miejscach określonych zmiennymi B<$PATH> i B<$MANPATH>.
uk: B<whereis> визначає місце зберігання виконуваних файлів, файлів із початковим кодом та файлів підручника для вказаних назв програм. З наданих назв буде спершу буде вилучено початкові компоненти шляху. Також буде оброблено префікси B<s.>, які є наслідком використання керування початковим кодом. Потім B<whereis> спробує знайти бажану програму у стандартних каталогах Linux та каталогах, які вказано за допомогою змінних середовища B<$PATH> і B<$MANPATH>.

source: The search restrictions (options B<-b>, B<-m> and B<-s>) are cumulative and apply to the subsequent I<name> patterns on the command line. Any new search restriction resets the search mask. For example,
pl: Ograniczenia wyszukiwania (opcje B<-b>, B<-m> i B<-s>) łączą się i są stosowane do kolejnych wzorów I<nazw> w wierszu poleceń. Każde nowe ograniczenie wyszukiwania resetuje maskę szukania, np.
uk: Обмеження пошуку (параметри B<-b>, B<-m> і B<-s>) є накопичувальними і застосовуються до наступних взірців I<назва> у командному рядку. Кожне нове обмеження пошуку скидає маску пошуку. Наприклад,

source: searches for "ls" and "tr" binaries and man pages, and for "gcc" man pages only.
pl: wyszukuje stron podręcznika i plików binarnych do "ls" i "tr", a do "gcc" jedynie stron podręcznika systemowego.
uk: виконує пошук виконуваних файлів та сторінок підручника «ls» і «tr» і лише сторінок підручника «gcc».

source: The options B<-B>, B<-M> and B<-S> reset search paths for the subsequent I<name> patterns. For example,
pl: Opcje B<-B>, B<-M> i B<-S> resetują ścieżki szukania dla kolejnych wzorców I<nazw>, np.
uk: Параметри B<-B>, B<-M> і B<-S> скидають шляхи пошуку для наступних взірців I<назва>. Наприклад,

source: searches for "B<ls>" man pages in all default paths, but for "cal" in the I</usr/share/man/man1> directory only.
pl: szuka podręczników systemowych do "B<ls>" we wszystkich domyślnych ścieżkach, a do "cal" jedynie w katalogu I</usr/share/man/man1>.
uk: шукає сторінки підручника для «B<ls>» в усіх типових каталогах, але для «cal» лише у каталозі I</usr/share/man/man1>.

source: OPTIONS
pl: OPCJE
uk: ПАРАМЕТРИ

source: Search for binaries.
pl: Szuka plików binarnych.
uk: Шукати виконувані файли.

source: Search for manuals.
pl: Szuka podręczników systemowych.
uk: Шукати підручники.

source: Search for sources.
pl: Szuka źródeł.
uk: Шукати початковий код.

source: Only show the command names that have unusual entries. A command is said to be unusual if it does not have just one entry of each explicitly requested type. Thus \(aqB<whereis -m -u *>\(aq asks for those files in the current directory which have no documentation file, or more than one.
pl: Pokazuje jedynie nazwy poleceń z nietypowymi wpisami, tzn. te, które nie mają jednej pozycji dla każdego zadanego typu. Zatem "B<whereis -m -u *>" wyszukuje pliki w bieżącym katalogu, które nie mają dokumentacji lub mają więcej niż jedną.
uk: Показувати назви команд лише для незвичайних записів. Команду називають незвичайною, якщо у неї не один запис для кожного явним чином заданого типу. Таким чином, \(aqB<whereis -m -u *>\(aq наказує вивести ті файли у поточному каталозі, у яких немає файла документації або є декілька файлів документації.

source: B<-B> I<list>
pl: B<-B> I<lista>
uk: B<-B> I<список>

source: Limit the places where B<whereis> searches for binaries, by a whitespace-separated list of directories.
pl: Ogranicza miejsca, gdzie B<whereis> szuka plików binarnych do oddzielonej spacjami listy katalogów.
uk: Обмежити місця, де B<whereis> шукатиме виконувані файли, списком каталогів, які відокремлено пробілами.

source: B<-M> I<list>
pl: B<-M> I<lista>
uk: B<-M> I<список>

source: Limit the places where B<whereis> searches for manuals and documentation in Info format, by a whitespace-separated list of directories.
pl: Ogranicza miejsca, gdzie B<whereis> szuka podręczników systemowych i dokumentacji w formacie Info do oddzielonej spacjami listy katalogów.
uk: Обмежити місця, де B<whereis> шукатиме підручники та документацію у форматі info, списком каталогів, які відокремлено пробілами.

source: B<-S> I<list>
pl: B<-S> I<lista>
uk: B<-S> I<список>

source: Limit the places where B<whereis> searches for sources, by a whitespace-separated list of directories.
pl: Ogranicza miejsca, gdzie B<whereis> szuka źródeł do oddzielonej spacjami listy katalogów.
uk: Обмежити місця, де B<whereis> шукатиме файли з початковим кодом, списком каталогів, які відокремлено пробілами.

source: Terminates the directory list and signals the start of filenames. It I<must> be used when any of the B<-B>, B<-M>, or B<-S> options is used.
pl: Kończy listę katalogów i sygnalizuje początek nazw plików. I<Musi> być użyte, jeśli zastosowano jedną z opcji B<-B>, B<-M> lub B<-S>.
uk: Завершує список каталогів і вказує, що розпочато список назв файлів. I<Має> бути використано, якщо використано будь-який з параметрів B<-B>, B<-M> або B<-S>.

source: Output the list of effective lookup paths that B<whereis> is using. When none of B<-B>, B<-M>, or B<-S> is specified, the option will output the hard-coded paths that the command was able to find on the system.
pl: Wypisuje listę efektywnie przeszukiwanych ścieżek, której używa B<whereis>. Gdy nie poda się żadnej z opcji B<-B>, B<-M> ani B<-S>, wypisane zostaną ustalone na sztywno ścieżki, które polecenie było w stanie znaleźć w tym systemie.
uk: Вивести список чинних шляхів пошуку, якими користується B<whereis>. Якщо не вказано жодного з параметрів B<-B>, B<-M> або B<-S>, використання цього параметра призведе до виведення вбудованих до системи шляхів, які команда зможе знайти.

source: Display help text and exit.
pl: Wyświetla ten tekst i kończy pracę.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: FILE SEARCH PATHS
pl: ŚCIEŻKI PRZESZUKIWANIA PLIKÓW
uk: ШЛЯХИ ДЛЯ ПОШУКУ ФАЙЛІВ

source: By default B<whereis> tries to find files from hard-coded paths, which are defined with glob patterns. The command attempts to use the contents of B<$PATH> and B<$MANPATH> environment variables as default search path. The easiest way to know what paths are in use is to add the B<-l> listing option. Effects of the B<-B>, B<-M>, and B<-S> are displayed with B<-l>.
pl: Domyślnie B<whereis> próbuje znajdować pliki w zakodowanych na sztywno ścieżkach, które są zdefiniowane za pomocą masek. Polecenie próbuje skorzystać z zawartości zmiennych środowiskowych B<$PATH> i B<$MANPATH> jako domyślnych ścieżek wyszukiwania. Najprostszą metodą poznania tych ścieżek jest skorzystanie z opcji B<-l>. Działanie opcji B<-B>, B<-M> i B<-S> jest odzwierciedlone przez B<-l>.
uk: Типово, B<whereis> намагається знайти файли у вбудованих до системи каталогах, які визначено за допомогою взірців із символами-замінниками. Команда спробує скористатися вмістом змінних середовища B<$PATH> і B<$MANPATH>, як типовими каталогами для пошуку. Найпростішим способом визначити шляхи, які буде використано, є додавання параметра B<-l>. Результат застосування B<-B>, B<-M> і B<-S> буде показано, якщо скористатися B<-l>.

source: ENVIRONMENT
pl: ŚRODOWISKO
uk: СЕРЕДОВИЩЕ

source: enables debug output.
pl: włącza wyjście debugowania.
uk: вмикає показ діагностичних повідомлень.

source: EXAMPLES
pl: PRZYKŁADY
uk: ПРИКЛАДИ

source: To find all files in I</usr/bin> which are not documented in I</usr/man/man1> or have no source in I</usr/src>:
pl: Aby znaleźć wszystkie pliki w I</usr/bin>, które nie mają dokumentacji w I</usr/share/man/man1> ani źródła w I</usr/src>:
uk: Щоб знайти усі файли у I</usr/bin>, які не документовано у I</usr/man/man1> або які не мають початкових кодів у I</usr/src>, віддайте таку команду:

source: REPORTING BUGS
pl: ZGŁASZANIE BŁĘDÓW
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
pl: Raporty o błędach proszę zgłaszać pod adresem
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
pl: DOSTĘPNOŚĆ
uk: ДОСТУПНІСТЬ

source: The B<whereis> command is part of the util-linux package which can be downloaded from
pl: Polecenie B<whereis> jest częścią pakietu util-linux i można je pobrać ze strony
uk: B<whereis> є частиною пакунка util-linux, який можна отримати з

source: October 2014
pl: październik 2014
uk: Жовтень 2014 року

source: B<whereis> locates the binary, source and manual files for the specified command names. The supplied names are first stripped of leading pathname components and any (single) trailing extension of the form B<.>I<ext> (for example: B<.c>) Prefixes of B<s.> resulting from use of source code control are also dealt with. B<whereis> then attempts to locate the desired program in the standard Linux places, and in the places specified by B<$PATH> and B<$MANPATH>.
pl: B<whereis> lokalizuje pliki binarne, źródłowe i podręczniki systemowe dla zadanych nazw poleceń. Z podanych nazw wstępnie usuwana jest początkowa składowa określająca ścieżkę oraz ewentualne (pojedyncze) kończące rozszerzenie postaci B<.>I<ext>, np. B<.c>. Przedrostki B<s.> wynikające z użycia kontroli kodu źródłowego są również obsługiwane. Następnie B<whereis> usiłuje zlokalizować położenie żądanego programu, posługując się listą standardowych miejsc linuksowych oraz w miejscach określonych zmiennymi B<$PATH> i B<$MANPATH>.
uk: B<whereis> визначає місце зберігання виконуваних файлів, файлів із початковим кодом та файлів підручника для вказаних назв програм. З наданих назв буде спершу буде вилучено початкові компоненти шляху і будь-який (один) кінцевий суфікс у формі B<.>I<суфікс> (приклад: B<.c>). Також буде оброблено префікси B<s.>, які є наслідком використання керування початковим кодом. Потім B<whereis> спробує знайти бажану програму у стандартних каталогах Linux та каталогах, які вказано за допомогою змінних середовища B<$PATH> і B<$MANPATH>.

source: The search restrictions (options B<-b>, B<-m> and B<-s>) are cumulative and apply to the subsequent I<name> patterns on the command line. Any new search restriction resets the search mask. For example,
pl: Ograniczenia wyszukiwania (opcje B<-b>, B<-m> i B<-s>) łączą się i są stosowane do kolejnych wzorów I<nazw> w wierszu poleceń. Każde nowe ograniczenie wyszukiwania resetuje maskę szukania, np.
uk: Обмеження пошуку (параметри B<-b>, B<-m> і B<-s>) є накопичувальними і застосовуються до наступних взірців I<назва> у командному рядку. Кожне нове обмеження пошуку скидає маску пошуку. Наприклад,

source: The options B<-B>, B<-M> and B<-S> reset search paths for the subsequent I<name> patterns. For example,
pl: Opcje B<-B>, B<-M> i B<-S> resetują ścieżki szukania dla kolejnych wzorców I<nazw>, np.
uk: Параметри B<-B>, B<-M> і B<-S> скидають шляхи пошуку для наступних взірців I<назва>. Наприклад,

source: searches for "ls" man pages in all default paths, but for "cal" in the /usr/share/man/man1 directory only.
pl: szuka podręczników systemowych do "ls" we wszystkich domyślnych ścieżkach, a do "cal" jedynie w katalogu /usr/share/man/man1.
uk: шукає сторінки підручника для «ls» в усіх типових каталогах, але для «cal» лише у каталозі /usr/share/man/man1.

source: Only show the command names that have unusual entries. A command is said to be unusual if it does not have just one entry of each explicitly requested type. Thus 'B<whereis -m -u *>' asks for those files in the current directory which have no documentation file, or more than one.
pl: Pokazuje jedynie nazwy poleceń z nietypowymi wpisami, tzn. te, które nie mają jednej pozycji dla każdego zadanego typu. Zatem "B<whereis -m -u *>" wyszukuje pliki w bieżącym katalogu, które nie mają dokumentacji lub mają więcej niż jedną.
uk: Показувати назви команд лише для незвичайних записів. Команду називають незвичайною, якщо у неї не один запис для кожного явним чином заданого типу. Таким чином, B<whereis -m -u *> наказує вивести ті файли у поточному каталозі, у яких немає файла документації або є декілька файлів документації.

source: B<-B >I<list>
pl: B<-B >I<lista>
uk: B<-B >I<список>

source: B<-M >I<list>
pl: B<-M >I<lista>
uk: B<-M >I<список>

source: B<-S >I<list>
pl: B<-S >I<lista>
uk: B<-S >I<списо>

source: Terminates the directory list and signals the start of filenames. It I<must> be used when any of the B<-B>, B<-M>, or B<-S> options is used.
pl: Kończy listę katalogów i sygnalizuje początek nazw plików. I<Musi> być użyte, jeśli zastosowano jedną z opcji B<-B>, B<-M> lub B<-S>.
uk: Завершує список каталогів і вказує, що розпочато список назв файлів. I<Має> бути використано, якщо використано будь-який з параметрів B<-B>, B<-M> або B<-S>.

source: Output the list of effective lookup paths that B<whereis> is using. When none of B<-B>, B<-M>, or B<-S> is specified, the option will output the hard-coded paths that the command was able to find on the system.
pl: Wypisuje listę efektywnie przeszukiwanych ścieżek, której używa B<whereis>. Gdy nie poda się żadnej z opcji B<-B>, B<-M> ani B<-S>, wypisane zostaną ustalone na sztywno ścieżki, które polecenie było w stanie znaleźć w tym systemie.
uk: Вивести список чинних шляхів пошуку, якими користується B<whereis>. Якщо не вказано жодного з параметрів B<-B>, B<-M> або B<-S>, використання цього параметра призведе до виведення вбудованих до системи шляхів, які команда зможе знайти.

source: Display version information and exit.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: By default B<whereis> tries to find files from hard-coded paths, which are defined with glob patterns. The command attempts to use the contents of B<$PATH> and B<$MANPATH> environment variables as default search path. The easiest way to know what paths are in use is to add the B<-l> listing option. Effects of the B<-B>, B<-M>, and B<-S> are displayed with B<-l>.
pl: Domyślnie B<whereis> próbuje znajdować pliki w zakodowanych na sztywno ścieżkach, które są zdefiniowane za pomocą masek. Polecenie próbuje skorzystać z zawartości zmiennych środowiskowych B<$PATH> i B<$MANPATH> jako domyślnych ścieżek wyszukiwania. Najprostszą metodą poznania tych ścieżek jest skorzystanie z opcji B<-l>. Działanie opcji B<-B>, B<-M> i B<-S> jest odzwierciedlone przez B<-l>.
uk: Типово, B<whereis> намагається знайти файли у вбудованих до системи каталогах, які визначено за допомогою взірців із символами-замінниками. Команда спробує скористатися вмістом змінних середовища B<$PATH> і B<$MANPATH>, як типовими каталогами для пошуку. Найпростішим способом визначити шляхи, які буде використано, є додавання параметра B<-l>. Результат застосування B<-B>, B<-M> і B<-S> буде показано, якщо скористатися B<-l>.

source: To find all files in I</usr/\:bin> which are not documented in I</usr/\:man/\:man1> or have no source in I</usr/\:src>:
pl: Aby znaleźć wszystkie pliki w I</usr/\:bin>, które nie mają dokumentacji w I</usr/share/man/\:man1> ani źródła w I</usr/\:src>:
uk: Щоб знайти усі файли у I</usr/\:bin>, які не документовано у I</usr/\:man/\:man1> або які не мають початкових кодів у I</usr/\:src>, віддайте таку команду:

source: B<whereis -u -ms -M /usr/man/man1 -S /usr/src -f *>
pl: B<whereis -u -ms -M /usr/share/man/man1 -S /usr/src -f *>

source: The whereis command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
pl: Polecenie whereis jest częścią pakietu util-linux i jest dostępne z E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Archiwum jądra Linux E<.UE .>
uk: Програма whereis є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>
