Repository: sebras/manpages-l10n
Catalog: po/*/man1/x86_64-linux-gnu-ranlib.1.po
Languages: pl

source: GNU Development Tools
pl: Narzędzia programistyczne GNU

source: NAME
pl: NAZWA

source: ranlib - generate index to archive.
pl: ranlib - generuje indeks archiwum

source: SYNOPSIS
pl: SKŁADNIA

source: ranlib [B<--plugin> I<name>] [B<-DhHvVt>] I<archive>
pl: ranlib [B<--plugin> I<nazwa>] [B<-DhHvVt>] I<archiwum>

source: DESCRIPTION
pl: OPIS

source: \&B<ranlib> generates an index to the contents of an archive and stores it in the archive. The index lists each symbol defined by a member of an archive that is a relocatable object file.
pl: \&B<ranlib> generuje indeks do zawartości archiwum i zachowuje go w archiwum. Indeks wymienia każdy symbol, zdefiniowany przez członków archiwum, którzy są relokowalnymi plikami obiektowymi.

source: You may use B<nm -s> or B<nm --print-armap> to list this index.
pl: Można użyć B<nm -s> lub B<nm --print-armap> w celu wyświetlenia tego indeksu.

source: An archive with such an index speeds up linking to the library and allows routines in the library to call each other without regard to their placement in the archive.
pl: Archiwum z takim indeksem szybciej się linkuje i zezwala procedurom z biblioteki na wzajemne wywoływanie się, bez uwagi na to, w jakiej są kolejności.

source: The \s-1GNU \s0B<ranlib> program is another form of \s-1GNU \s0B<ar>; running \&B<ranlib> is completely equivalent to executing B<ar -s>.
pl: Program \s-1GNU \s0B<ranlib> jest inną postacią \s-1GNU \s0B<ar>; uruchomienie \&B<ranlib> jest zupełnie równoważne B<ar -s>.

source: OPTIONS
pl: OPCJE

source: Show usage information for B<ranlib>.
pl: Wyświetla informacje o składni programu B<ranlib>.

source: Show the version number of B<ranlib>.
pl: Wypisuje numer wersji programu B<ranlib>.

source: Operate in I<deterministic> mode. The symbol map archive member's header will show zero for the \s-1UID, GID,\s0 and timestamp. When this option is used, multiple runs will produce identical output files.
pl: Działa w trybie I<deterministycznym>. Nagłówek mapy symboli będzie zawierać zero w polach \s-1UID, GID\s0 oraz w znaczniku czasowym. Użycie tej opcji powoduje że wielokrotne uruchomienia będą tworzyć identyczne pliki.

source: If I<binutils> was configured with \&B<--enable-deterministic-archives>, then this mode is on by default. It can be disabled with the B<-U> option, described below.
pl: Jeśli I<binutils> zostało skonfigurowane z opcją \&B<--enable-deterministic-archives>, to jest to zachowanie domyślne. Można je wyłączyć za pomocą poniżej opisanej opcji B<-U>.

source: Update the timestamp of the symbol map of an archive.
pl: Aktualizuje znacznik czasowy mapy symboli archiwum.

source: Do I<not> operate in I<deterministic> mode. This is the inverse of the B<-D> option, above: the archive index will get actual \s-1UID, GID,\s0 timestamp, and file mode values.
pl: B<Nie> działa w trybie I<deterministycznym>. Jest to odwrotność opcji B<-D> opisanej powyżej: indeks archiwum będzie zawierał właściwe wartości pól \s-1UID, GID\s0, znacznika czasowego i praw dostępu do pliku.

source: If I<binutils> was configured I<without> \&B<--enable-deterministic-archives>, then this mode is on by default.
pl: Jeśli I<binutils> zostało skonfigurowane I<bez> opcji \&B<--enable-deterministic-archives>, to jest to zachowanie domyślne.

source: B<@>I<file>
pl: B<@>I<plik>

source: Read command-line options from I<file>. The options read are inserted in place of the original @I<file> option. If I<file> does not exist, or cannot be read, then the option will be treated literally, and not removed.
pl: Czyta opcje linii poleceń z podanego I<pliku>. Przeczytane opcje są wstawiane w miejsce oryginalnej opcji @plik. Jeśli I<plik> nie istnieje lub nie może być odczytany ta opcja jest traktowana dosłownie i nie jest usuwana.

source: Options in I<file> are separated by whitespace. A whitespace character may be included in an option by surrounding the entire option in either single or double quotes. Any character (including a backslash) may be included by prefixing the character to be included with a backslash. The I<file> may itself contain additional @I<file> options; any such options will be processed recursively.
pl: Opcje w I<pliku> są rozdzielane białymi znakami. Biały znak może wystąpić w opcji, jeśli cała opcja zostanie ujęta w pojedyncze albo podwójne cudzysłowy. Można dodać dowolny znak (włączając w to znak odwrotnego ukośnika), poprzedzając go znakiem odwrotnego ukośnika. I<Plik> może również zawierać dodatkowe opcje @I<plik> - w takim przypadku każda z takich opcji będzie przetwarzana rekurencyjnie.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: \&I<ar>\|(1), I<nm>\|(1), and the Info entries for I<binutils>.
pl: \&I<ar>\|(1), I<nm>\|(1) oraz wpisy info I<binutils>.

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: Permission is granted to copy, distribute and/or modify this document under the terms of the \s-1GNU\s0 Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, with no Front-Cover Texts, and with no Back-Cover Texts. A copy of the license is included in the section entitled \*(L"\s-1GNU\s0 Free Documentation License\*(R".
pl: Zezwala się na kopiowanie, rozpowszechnianie i/lub modyfikowanie tego dokumentu na warunkach Licencji Wolnej Dokumentacji \s-1GNU\s0 (\s-1GNU\s0 Free Documentation License) w wersji 1.3 lub jakiejkolwiek nowszej wersji opublikowanej przez Fundację Wolnego Oprogramowania, przy czym Sekcjami niezmiennymi są "GNU General Public License" i "GNU Free Documentation License", bez treści przedniej lub tylnej strony okładki. Egzemplarz licencji zamieszczono w sekcji zatytułowanej "GNU Free Documentation License".
