Repository: sebras/manpages-l10n
Catalog: po/*/man1/xzless.1.po
Languages: da

source: NAME
da: NAVN

source: xzless, lzless - view xz or lzma compressed (text) files
da: xzless, lzless - vis xz- eller lzma-komprimerede (tekst) filer

source: B<xzless> [I<file>...]
da: B<xzless> [I<fil>...]

source: B<lzless> [I<file>...]
da: B<lzless> [I<fil>...]

source: DESCRIPTION
da: BESKRIVELSE

source: B<xzless> is a filter that displays text from compressed files to a terminal. It works on files compressed with B<xz>(1) or B<lzma>(1). If no I<files> are given, B<xzless> reads from standard input.
da: B<xzless> er et filter, der viser tekst fra komprimerede filer i en terminal. Filteret fungerer på filer komprimeret med B<xz>(1) eller B<lzma>(1). Hvis ingen I<filer> er angivet, læser B<xzless> fra standardind.

source: B<xzless> uses B<less>(1) to present its output. Unlike B<xzmore>, its choice of pager cannot be altered by setting an environment variable. Commands are based on both B<more>(1) and B<vi>(1) and allow back and forth movement and searching. See the B<less>(1) manual for more information.
da: B<xzless> bruger B<less>(1) til at forhindre dets resultat. Til forskel fra B<xzmore> kan dets valg af tekstsøger ikke ændres ved at angive en miljøvariabel. Kommandoer er baseret på både B<more>(1) og B<vi>(1) og tillader tilbage og fremad bevægelse og søgning. Se B<less>(1)-manualen for yderligere information.

source: The command named B<lzless> is provided for backward compatibility with LZMA Utils.
da: Kommandoen B<lzless> tilbydes for baglæns kompatibilitet med LZMA Utils.

source: ENVIRONMENT
da: MILJØ

source: A list of characters special to the shell. Set by B<xzless> unless it is already set in the environment.
da: En liste af tegn specielle for skallen. Angives af B<xzless> med mindre det allerede er angivet i miljøet.

source: Set to a command line to invoke the B<xz>(1) decompressor for preprocessing the input files to B<less>(1).
da: Angiv i kommandolinjen for at igangsætte B<xz>(1)-dekompressoren for forhåndsbehandling af inddatafilerne til B<less>(1).

source: SEE ALSO
da: SE OGSÅ
