Repository: sebras/manpages-l10n
Catalog: po/*/man1/xzmore.1.po
Languages: da

source: NAME
da: NAVN

source: xzmore, lzmore - view xz or lzma compressed (text) files
da: xzmore, lzmore - vis xz- eller lzma-komprimerede (tekst) filer

source: B<xzmore> [I<file...>]
da: B<xzmore> [I<fil...>]

source: B<lzmore> [I<file...>]
da: B<lzmore> [I<fil...>]

source: DESCRIPTION
da: BESKRIVELSE

source: B<xzmore> is a filter which allows examination of B<xz>(1) or B<lzma>(1) compressed text files one screenful at a time on a soft-copy terminal.
da: B<xzmore> er et filter, der gør det muligt at undersøge B<xz>(1)- eller B<lzma>(1)-komprimerede tekstfiler en skærm ad gangen på en soft-copy-terminal.

source: To use a pager other than the default B<more,> set environment variable B<PAGER> to the name of the desired program. The name B<lzmore> is provided for backward compatibility with LZMA Utils.
da: For at bruge en anden tekstsøger den standarden B<more,> angives miljøvariablen B<PAGER> til navnet på det ønskede program. Navnet B<lzmore> tilbydes på grund af baglæns kompatibilitet med LZMA Utils.

source: B<e> or B<q>
da: B<e> eller B<q>

source: When the prompt --More--(Next file: I<file>) is printed, this command causes B<xzmore> to exit.
da: Når prompten --More--(Næste file: I<fil>) udskrives, så får denne kommando B<xzmore> til af afslutte.

source: When the prompt --More--(Next file: I<file>) is printed, this command causes B<xzmore> to skip the next file and continue.
da: Når prompten --More--(Næste fil: I<fil>) udskrives, så får denne kommando B<xzmore> til at udelade den næste fil og fortsætte.

source: For list of keyboard commands supported while actually viewing the content of a file, refer to manual of the pager you use, usually B<more>(1).
da: For en liste over understøttede tastaturkommandoer, når indholdet af en fil vises, så se manualen for tekstsøgeren du bruger, normalt B<more>(1).

source: SEE ALSO
da: SE OGSÅ
