Repository: sebras/manpages-l10n
Catalog: po/*/man1/zdiff.1.po
Languages: da

source: NAME
da: NAVN

source: zcmp, zdiff - compare compressed files
da: zcmp, zdiff - sammenlign komprimerede filer

source: B<zcmp> [ cmp_options ] file1 [ file2 ]
da: B<zcmp> [ cmp-tilvalg ] fil1 [ fil2 ]

source: B<zdiff> [ diff_options ] file1 [ file2 ]
da: B<zdiff> [ diff-tilvalg ] fil1 [ fil2 ]

source: DESCRIPTION
da: BESKRIVELSE

source: The B<zcmp> and B<zdiff> commands are used to invoke the B<cmp> or the B<diff> program on files compressed via B<gzip>. All options specified are passed directly to B<cmp> or B<diff>. If only I<file1> is specified, it is compared to the uncompressed contents of I<file1>B<.gz>I<.> If two files are specified, their contents (uncompressed if necessary) are fed to B<cmp> or B<diff>. The input files are not modified. The exit status from B<cmp> or B<diff> is preserved.
da: Kommandoerne B<zcmp> og B<zdiff> bruges til at starte programmet B<cmp> eller B<diff> på filer komprimeret via B<gzip>. Alle tilvalg specificeret sendes direkte til B<cmp> eller B<diff>. Hvis kun I<fil1> er specificeret, sammenlignes den med indholdet uden kompression for I<fil1>B<.gz>I<.> Hvis to filer er specificeret, sendes deres indhold (om nødvendig uden kompression) til B<cmp> eller B<diff>. Inddatafilerne ændres ikke. Afslutningsstatus fra B<cmp> eller B<diff> bevares.

source: SEE ALSO
da: SE OGSÅ

source: BUGS
da: FEJL

source: Messages from the B<cmp> or B<diff> programs may refer to file names such as "-" instead of to the file names specified.
da: Beskeder fra programmerne B<cmp> eller B<diff> kan referere til filnavne såsom »-« i stedet for til de specificerede filnavne.

source: I<Zcmp> and I<zdiff> are used to invoke the I<cmp> or the I<diff> program on files compressed via I<gzip>. All options specified are passed directly to I<cmp> or I<diff>. If only I<file1> is specified, it is compared to the uncompressed contents of I<file1>.gz. If two files are specified, their contents (uncompressed if necessary) are fed to I<cmp> or I<diff>. The input files are not modified. The exit status from I<cmp> or I<diff> is preserved.
da: I<Zcmp> og I<zdiff> bruges til at starte programmet I<cmp> eller I<diff> på filer komprimeret via I<gzip>. Alle tilvalg specificeret sendes direkte til I<cmp> eller I<diff>. Hvis kun I<fil1> er specificeret, så sammenlignes den med indholdet uden kompression for I<fil1>.gz. Hvis to filer er specificeret, så sendes deres indhold (om nødvendig uden kompression) til I<cmp> eller I<diff>. Inddatafilerne ændres ikke. Afslutningsstatus fra I<cmp> eller I<diff> bevares.

source: Messages from the I<cmp> or I<diff> programs may refer to file names such as "-" instead of to the file names specified.
da: Beskeder fra programmerne I<cmp> eller I<diff> kan referere til filnavne såsom »-« i stedet for til de specificerede filnavne.
