Repository: sebras/manpages-l10n
Catalog: po/*/man1/znew.1.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: znew - recompress .Z files to .gz files
de: znew - .Z-Dateien als .gz-Dateien neu komprimieren

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<Znew> command recompresses files from .Z (compress) format to .gz (gzip) format. If you want to recompress a file already in gzip format, rename the file to force a .Z extension then apply znew.
de: Der Befehl B<znew> überführt mit B<compress> komprimierte Dateien im .Z-Format in das von B<gzip> gelieferte .gz-Format. Wenn Sie eine Datei neu komprimieren wollen, die bereits im .gz-Format vorliegt, versehen Sie sie zunächst mit der Endung .Z und führen dann B<znew> aus.

source: OPTIONS
de: OPTIONEN

source: Force recompression from .Z to .gz format even if a .gz file already exists.
de: erzwingt die Kompression aus dem .Z- in das .gz-Format, selbst wenn eine entsprechende .gz-Datei bereits existiert.

source: Tests the new files before deleting originals.
de: prüft die neuen Dateien, bevor die Originale gelöscht werden.

source: Verbose. Display the name and percentage reduction for each file compressed.
de: aktiviert den ausführlichen Modus. Für jede der komprimierten Dateien werden der Name und die prozentuale Verringerung der Größe angezeigt.

source: Use the slowest compression method (optimal compression).
de: verwendet das rechenintensivste und langsamste Verfahren und erzielt optimale Kompression.

source: Use pipes for the conversion to reduce disk space usage.
de: belegt bei der Ausführung weniger Speicherplatz, indem Daten per Pipe weitergereicht werden.

source: Keep a .Z file when it is smaller than the .gz file; implies B<-t>.
de: erhält die .Z-Datei, wenn diese kleiner als die sich ergebende .gz-Datei ist. Die Option B<-t> wird mitausgeführt.

source: SEE ALSO
de: SIEHE AUCH

source: BUGS
de: FEHLER

source: If the B<-P> option is used, B<znew> does not maintain the timestamp if B<touch>(1) does not support the B<-r> option, and does not maintain permissions if B<chmod>(1) does not support the B<--reference> option.
de: Falls die Option B<-P> verwendet wird, behält B<znew> den Zeitstempel nicht, falls B<touch>(1) nicht die Option B<-r> unterstützt und behält die Rechte nicht, falls B<chmod>(1) nicht die Option B<--reference> unterstützt.

source: I<Znew> recompresses files from .Z (compress) format to .gz (gzip) format. If you want to recompress a file already in gzip format, rename the file to force a .Z extension then apply znew.
de: B<Znew> überführt mit B<compress> komprimierte Dateien im .Z-Format in das von B<gzip> gelieferte .gz-Format. Wenn Sie eine Datei neu komprimieren wollen, die bereits im .gz-Format vorliegt, versehen Sie sie zunächst mit der Endung .Z und führen dann B<znew> aus.

source: gzip(1), zmore(1), zdiff(1), zgrep(1), zforce(1), gzexe(1), compress(1)
de: B<gzip>(1), B<zmore>(1), B<zdiff>(1), B<zgrep>(1), B<zforce>(1), B<gzexe>(1), B<compress>(1)

source: If the B<-P> option is used, I<znew> does not maintain the timestamp if I<touch>(1) does not support the B<-r> option, and does not maintain permissions if I<chmod>(1) does not support the B<--reference> option.
de: Falls die Option B<-P> verwandt wird, behält I<znew> den Zeitstempel nicht, falls I<touch>(1) nicht die Option B<-r> unterstützt und behält die Rechte nicht, falls I<chmod>(1) nicht die Option B<--reference> unterstützt.
