Repository: sebras/manpages-l10n
Catalog: po/*/man1/zstdless.1.po
Languages: uk

source: January 2022
uk: Січень 2022

source: User Commands
uk: Користувацькі команди

source: NAME
uk: НАЗВА

source: B<zstdless> - view zstandard-compressed files
uk: B<zstdless> - перегляд стиснених файлів zstandard

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<zstdless> [I<flags>] [I<file> ...]
uk: B<zstdless> [I<прапорці>] [I<файл> ...]

source: DESCRIPTION
uk: ОПИС

source: B<zstdless> runs B<less (1)> on files or stdin, if no files argument is given, after decompressing them with B<zstdcat (1)>.
uk: B<zstdless> виконує B<less (1)> над файлами або stdin, якщо не вказано арґумент файлів, після видобування їх із B<zstdcat (1)>.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: December 2020
uk: Грудень 2020

source: May 2021
uk: Травень 2021
