Repository: sebras/manpages-l10n
Catalog: po/*/man8/*.tftpd.8.po
Languages: in

source: July 29, 2000
in: 29 giuglio 2000

source: NAME
in: NOME

source: E<.Tn DARPA> Trivial File Transfer Protocol server
in: E<.Tn DARPA> Server Trivial File Transfer Protocol

source: SYNOPSIS
in: SINTASSI

source: DESCRIPTION
in: DESCRIZIONE

source: E<.Nm Tftpd> is a server which supports the E<.Tn DARPA> Trivial File Transfer Protocol. The E<.Tn TFTP> server operates at the port indicated in the E<.Ql tftp> service description; see E<.Xr services 5>. The server is normally started by E<.Xr inetd 8>.
in: E<.Nm Tftpd> è un server che supporta E<.Tn DARPA> Trivial File Transfer Protocol. Il server E<.Tn TFTP> operano alla porta indicata nella descrizione del servizio E<.Ql tftp>; vedere E<.Xr services 5>. Il server normalmente è avviato da E<.Xr inetd 8>.

source: The use of E<.Xr tftp 1> does not require an account or password on the remote system. Due to the lack of authentication information, E<.Nm tftpd> will allow only publicly readable files to be accessed. Files may be written only if they already exist and are publicly writable. Note that this extends the concept of E<.Dq public> to include all users on all hosts that can be reached through the network; this may not be appropriate on all systems, and its implications should be considered before enabling tftp service. The server should have the user ID with the lowest possible privilege.
in: L'uso di E<.Xr tftp 1> non richiede un account o password sul sistema remoto. A causa della mancanza di informazioni di autenticazione, E<.Nm tftpd> consentirà solo l'accesso a file leggibili pubblicamente. I file devono essere scritti solo se essi esistono già e sono pubblicamente scrivibili. Notare che questo estende il concetto di E<.Dq pubblico> per includere tutti gli utenti su tutti gli host che possono essere raggiunti attraverso la rete; ciò potrebbe non essere appropriato su tutti i sistemi, e le sue implicazioni dovrebbero essere considerate prima di abilitare il servizio tftp. Il server dovrebbe avere l'ID dell'utente con il più basso pribilegio possibile.

source: Access to files may be controlled by invoking E<.Nm tftpd> with a list of directories by including pathnames as server program arguments in E<.Pa /etc/inetd.conf>. In this case access is restricted to files whose names are prefixed by the one of the given directories. If no directories are supplied the default is E<.Pa /tftpboot>. To give out access to the whole filesystem, should this be desired for some reason, supply E<.Pa / > as an argument.
in: L'accesso ai file può essere controllato invocando E<.Nm tftpd> con un elenco di directory che includa percorsi come argomenti del programma server in E<.Pa /etc/inetd.conf>. In questo caso l'accesso è ristretto ai file i cui nomi hanno per prefisso una delle directory date. Se non viene specificata una directory quella predefinita è E<.Pa /tftpboot>. Per dare accesso all'intero filesystem, ove per quache motivo si rendesse necessario, si deve specificare E<.Pa / > come argomento.

source: The options are:
in: Le opzioni sono:

source: Suppresses negative acknowledgement of requests for nonexistent relative filenames.
in: Sopprime il riconoscimento negativo delle richieste di nomi di file relativi inesistenti.

source: All absolute filenames are treated as if they were preceded by the first directory argument, or E<.Pa /tftpboot> if there is none.
in: Tutti i nomi di file assoluti sono trattati come se fossero preceduti dal primo argomento directory o, in mancanza, da E<.Pa /tftpboot>.

source: SEE ALSO
in: VEDERE ANCHE

source: HISTORY
in: STORIA

source: The E<.Nm> command appeared in E<.Bx 4.2>.
in: Il comando E<.Nm> è aparso nella E<.Bx 4.2>.
