Repository: sebras/manpages-l10n
Catalog: po/*/man8/anacron.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: anacron - runs commands periodically
de: anacron - Befehle periodisch ausführen

source: SYNOPSIS
de: ÜBERSICHT

source: B<anacron >[B<-s>] [B<-f>] [B<-n>] [B<-d>] [B<-q>] [B<-t anacrontab>] [B<-S spooldir>] [I<job>]
de: B<anacron >[B<-s>] [B<-f>] [B<-n>] [B<-d>] [B<-q>] [B<-t Anacrontab>] [B<-S Spool-Verzeichnis>] [I<Auftrag>]

source: B<anacron >[B<-S spooldir>] -u [B<-t anacrontab>] [I<job>]
de: B<anacron >[B<-S Spool-Verzeichnis>] -u [B<-t Anacrontab>] [I<Auftrag>]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<Anacron> is used to execute commands periodically, with a frequency specified in days. Unlike B<cron(8)>, it does not assume that the machine is running continuously. Hence, it can be used on machines that are not running 24 hours a day to control regular jobs as daily, weekly, and monthly jobs.
de: B<Anacron> wird zum periodischen Ausführen von Befehlen verwendet, wobei die Häufigkeit in Tagen angegeben wird. Im Gegensatz zu B<cron>(8) wird nicht angenommen, dass der Rechner ununterbrochen in Betrieb ist. Daher kann es auch auf Rechnern, die nicht 24 Stunden täglich laufen, zum Steuern regelmäßig täglich, wöchentlich oder monatlich auszuführender Aufträge verwendet werden.

source: Anacron reads a list of jobs from the I</etc/anacrontab> configuration file (see B<anacrontab>(5)). This file contains the list of jobs that Anacron controls. Each job entry specifies a period in days, a delay in minutes, a unique job identifier, and a shell command.
de: Anacron liest eine Liste der Aufträge aus der Konfigurationsdatei I</etc/anacrontab> (siehe B<anacrontab>(5)). Diese Datei enthält die Liste der Aufträge, die Anacron steuert. Jeder Auftrag gibt eine Periode in Tagen, eine Verzögerung in Minuten, einen eindeutigen Auftragsbezeichner und einen Shell-Befehl an.

source: For each job, Anacron checks whether this job has been executed in the last B<n> days, where B<n> is the time period specified for that job. If a job has not been executed in B<n> days or more, Anacron runs the job's shell command, after waiting for the number of minutes specified as the delay parameter.
de: Bei jedem Auftrag prüft Anacron, ob dieser Auftrag in den letzten B<n> Tagen ausgeführt wurde, wobei B<n> die für diesen Auftrag angegebene Zeitperiode ist. Falls ein Auftrag nicht in den B<n> Tagen oder schon länger nicht mehr ausgeführt wurde, führt Anacron nach der in Minuten angegebenen Verzögerung den Shell-Befehl dieses Auftrags aus.

source: After the command exits, Anacron records the date (excludes the hour) in a special timestamp file for that job, so it knows when to execute that job again.
de: Nachdem die Befehlsausführung beendet ist, zeichnet Anacron das Datum (ohne die Stunde) in einer speziellen Zeitstempeldatei für diesen Auftrag auf, so dass es weiß, wann dieser Auftrag wieder ausgeführt werden muss.

source: When there are no more jobs to be run, Anacron exits.
de: Wenn keine Aufträge mehr auszuführen sind, wird Anacron beendet.

source: Anacron only considers jobs whose identifier, as specified in B<anacrontab>(5), matches any of the I<job> command-line arguments. The I<job> command-line arguments can be represented by shell wildcard patterns (be sure to protect them from your shell with adequate quoting). Specifying no I<job> command-line arguments is equivalent to specifying "*" (that is, all jobs are considered by Anacron).
de: Anacron berücksichtigt nur Aufträge, deren Bezeichner, der in B<anacrontab>(5) angegeben ist, auf irgendein Befehlszeilenargument des I<Auftrags> passt. Die Befehlszeilenargumente des I<Auftrags> können durch Shell-Platzhaltermuster angegeben werden, wobei Sie sicherstellen müssen, dass diese durch entsprechende Maskierung vor der Interpretation durch die Shell selbst geschützt werden. Wenn keine Befehlszeilenargumente für den I<Auftrag> angegeben werden, ist dies gleichbedeutend mit der Angabe von * (was bewirkt, dass Anacron alle Auftrge berücksichtigt).

source: Unless Anacron is run with the B<-d> option (specified below), it forks to the background when it starts, and any parent processes exit immediately.
de: Außer wenn Anacron mit der Option B<-d> aufgerufen wird (Beschreibung siehe unten), wird es beim Start per Fork in den Hintergrund verschoben und alle Elternprozesse werden unmittelbar beendet.

source: Unless Anacron is run with the B<-s> or B<-n> options, it starts jobs immediately when their delay is over. The execution of different jobs is completely independent.
de: Außer wenn Anacron mit den Optionen B<-d> oder B<-n> aufgerufen wird, startet es die Auftärge unmittelbar nachdem deren Verzögerungszeit verstrichen ist. Verschiedene Aufträge werden völlig unabhängig voneinander ausgeführt.

source: If an executed job generates any output to standard output or to standard error, the output is mailed to the user under whom Anacron is running (usually root), or to the address specified in the B<MAILTO> environment variable in the I</etc/anacrontab> file, if such exists. If the B<LOGNAME> environment variable is set, it is used in the From: field of the mail.
de: Falls ein ausgeführter Auftrag etwas in die Standardausgabe oder Standardfehlerausgabe schreibt, werden diese Ausgaben per E-Mail an den Benutzer, unter dessen Benutzerkonto Anacron ausgeführt wird (üblicherweise root), gesendet. Falls die Datei I</etc/anacrontab> und in dieser die Umgebungsvariable B<MAILTO> gesetzt ist, werden die Ausgaben stattdessen an die dort angegebene Adresse gesendet. Falls die Umgebungsvariable B<LOGNAME> gesetzt ist, wird deren Inhalt zum Ausfüllen des From:-Feldes in der E-Mail verwendet.

source: Any informative messages generated by Anacron are sent to B<syslogd>(8) or B<rsyslogd>(8) under with facility set to B<cron> and priority set to B<notice>. Any error messages are sent with the priority B<error>.
de: Alle durch Anacron erzeugten informativen Meldungen werden an B<syslogd>(8) oder B<rsyslogd>(8) gesendet, wobei die Einrichtung auf B<cron> und die Priorität auf B<notice> gesetzt wird. Alle Fehlermeldungen werden mit der Priorität B<error> versendet.

source: "Active" jobs (i.e., jobs that Anacron already decided to run and are now waiting for their delay to pass, and jobs that are currently being executed by Anacron), are "locked", so that other copies of Anacron cannot run them at the same time.
de: Aktive Aufträge (solche, über deren Ausführung Anacron bereits entschieden hat und die nun auf das Verstreichen der Verzögerungszeit warten, sowie Aufträge, die bereits von Anacron ausgeführt werden), sind gesperrt, so dass weitere Instanzen von Anacron diese nicht zur gleichen Zeit ausführen knnen.

source: OPTIONS
de: OPTIONEN

source: Forces execution of all jobs, ignoring any timestamps.
de: erzwingt die Ausführung aller Aufträge, wobei die Zeitstempel ignoriert werden.

source: Updates the timestamps of all jobs to the current date, but does not run any.
de: aktualisiert die Zeitstempel aller Aufträge auf das aktuelle Datum, aber führt keine Aufträge aus.

source: Serializes execution of jobs. Anacron does not start a new job before the previous one finished.
de: serialisiert die Ausführung von Aufträgen. Anacron startet erst einen neuen Auftrag, wenn der vorherige Auftrag beendet ist.

source: Runs jobs immediately and ignores the specified delays in the I</etc/anacrontab> file. This options implies B<-s>.
de: führt Aufträge sofort aus, wobei die in der Datei I</etc/anacrontab> angegebenen Verzögerungen ignoriert werden. Diese Option impliziert B<-s>.

source: Does not fork Anacron to the background. In this mode, Anacron will output informational messages to standard error, as well as to syslog. The output of any job is mailed by Anacron.
de: verschiebt Anacron nicht per Fork in den Hintergrund. In diesem Modus schreibt Anacron informative Meldungen in die Standardfehlerausgabe und in das Systemprotokoll. Die Ausgabe jedes Auftrags wird durch Anacron per E-Mail versendet.

source: Suppresses any messages to standard error. Only applicable with B<-d>.
de: unterdrückt alle Meldungen, die in die Standardausgabe geschrieben werden würden. Diese Option ist nur zusammen mit B<-d> anwendbar.

source: B<-t some_anacrontab>
de: B<-t eine_Anacrontab>

source: Uses the specified anacrontab, rather than the I</etc/anacrontab> default one.
de: verwendet die angegebene Anacrontab anstelle der standardmäßigen I</etc/anacrontab>.

source: Anacrontab testing. Tests the I</etc/anacrontab> configuration file for validity. If there is an error in the file, it is shown on the standard output and Anacron returns the value of 1. Valid anacrontabs return the value of 0.
de: dient zum Prüfen der Datei I</etc/anacrontab> auf Gültigkeit. Falls die Datei einen Fehler enthält, wird dieser in der Standardausgabe angezeigt und Anacron gibt den Wert 1 zurück. Gültige Anacrontabs geben den Wert 0 zurück.

source: B<-S spooldir>
de: B<-S Spool-Verzeichnis>

source: Uses the specified spooldir to store timestamps in. This option is required for users who wish to run anacron themselves.
de: verwendet das angegebene Spool-Verzeichnis zum Speichern von Zeitstempeln. Diese Option ist für Benutzer erforderlich, die Anacron selbst ausführen wollen.

source: Prints version information, and exits.
de: gibt Versionsinformationen aus und beendet das Programm.

source: Prints short usage message, and exits.
de: gibt eine kurze Hilfemeldung aus und beendet das Programm.

source: SIGNALS
de: SIGNALE

source: After receiving a B<SIGUSR1> signal, Anacron waits for any running jobs to finish and then exits. This can be used to stop Anacron cleanly.
de: Nachdem ein B<SIGUSR1>-Signal empfangen wurde, wartet Anacron auf den Abschluss eventuell noch laufender Aufträge und beendet sich dann. Dies kann dazu verwendet werden, um Anacron korrekt zu beenden.

source: NOTES
de: ANMERKUNGEN

source: Make sure your time-zone is set correctly before Anacron is started since the time-zone affects the date. This is usually accomplished by setting the TZ environment variable, or by installing a I</usr/lib/zoneinfo/localtime> file. See B<tzset>(3) for more information.
de: Stellen Sie vor der Ausführung von Anacron sicher, dass die Einstellung der Zeitzone korrekt ist, da diese sich auf das Datum auswirkt. Dies erreichen Sie üblicherweise durch Setzen der Umgebungsvariable B<TZ> oder durch Installation einer Datei I</usr/lib/zoneinfo/localtime>. In B<tzset>(3) finden Sie weitere Informationen.

source: Timestamp files are created in the spool directory for each job specified in an anacrontab. These files are never removed automatically by Anacron, and should be removed by hand if a job is no longer being scheduled.
de: Zeitstempeldateien werden für jeden in der Anacrontab aufgeführten Auftrag im Spool-Verzeichnis angelegt. Diese Dateien werden von Anacron niemals automatisch entfernt und sollten manuell gelöscht werden, sobald ein Auftrag nicht mehr planmäßig ausgeführt werden soll.

source: FILES
de: DATEIEN

source: Contains specifications of jobs. See B<anacrontab>(5) for a complete description.
de: Enthält die Auftragsspezifikationen. In B<anacrontab>(5) finden Sie eine vollständige Beschreibung.

source: This directory is used by Anacron for storing timestamp files.
de: Dieses Verzeichnis wird von Anacron zum Speichern von Zeitstempeldateien verwendet.

source: SEE ALSO
de: SIEHE AUCH

source: The Anacron I<README> file.
de: Die I<README>-Datei zu Anacron.

source: BUGS
de: FEHLER

source: Anacron never removes timestamp files. Remove unused files manually.
de: Anacron entfernt niemals Zeitstempeldateien. Entfernen Sie ungenutzte Dateien manuell.

source: Anacron uses up to two file descriptors for each active job. It may run out of descriptors if there are lots of active jobs. See B<echo $(($(ulimit -n) / 2))> for information how many concurent jobs anacron may run.
de: Anacron verwendet bis zu zwei Dateideskriptoren für jeden aktiven Auftrag. Bei zu vielen aktiven Aufträgen können die Dateideskriptoren ausgeschöpft werden. Die Ausgabe von B<echo $(($(ulimit -n) / 2))> liefert Informationen darüber, wie viele Aufträge Anacron parallel ausführen kann.

source: Mail comments, suggestions and bug reports to E<.MT shaleh@\:(debian.\:org|\:valinux.\:com)> Sean 'Shaleh' Perry E<.ME .>
de: Senden Sie Kommentare, Vorschläge und Fehlermeldungen (auf Englisch) an E<.MT shaleh@\:(debian.\:org|\:valinux.\:com)> Sean Shaleh Perry E<.ME .>

source: AUTHOR
de: AUTOR

source: Anacron was originally conceived and implemented by E<.MT schwarz@\:monet.\:m.\:isar.\:de> Christian Schwarz E<.ME .>
de: Anacron wurde ursprünglich von E<.MT schwarz@\:monet.\:m.\:isar.\:de> Christian Schwarz E<.ME> konzipiert und implementiert.

source: The current implementation is a complete rewrite by E<.MT itzur@\:actcom.\:co.\:il> Itai Tzur E<.ME .>
de: Die derzeitige Implementierung wurde von E<.MT itzur@\:actcom.\:co.\:il> Itai Tzur E<.ME> vollständig neu geschrieben.

source: The code base was maintained by E<.MT shaleh@\:(debian.\:org|\:valinux.\:com)> Sean 'Shaleh' Perry E<.ME .>
de: Die Code-Basis wurde von E<.MT shaleh@\:(debian.\:org|\:valinux.\:com)> Sean Shaleh Perry E<.ME> betreut.

source: Since 2004, it is maintained by E<.MT pasc@\:(debian.\:org|\:redellipse.\:net)> Pascal Hakim E<.ME .>
de: Seit 2004 wird sie durch E<.MT pasc@\:(debian.\:org|\:redellipse.\:net)> Pascal Hakim E<.ME> betreut.

source: For Fedora, Anacron is maintained by E<.MT mmaslano@redhat.\:com> Marcela Mašláňová E<.ME .>
de: Für Fedora wird Anacron von E<.MT mmaslano@redhat.\:com> Marcela Mašláňová E<.ME> betreut.

source: the Debian Project
de: das Debian-Projekt

source: Anacron Users' Manual
de: Anacron-Benutzerhandbuch

source: B<anacron >[B<-s>] [B<-f>] [B<-n>] [B<-d>] [B<-q>] [B<-t anacrontab>] [B<-S spooldir>] [I<job>] ...
de: B<anacron >[B<-s>] [B<-f>] [B<-n>] [B<-d>] [B<-q>] [B<-t Anacrontab>] [B<-S Spool-Verzeichnis>] [I<Auftrag>]

source: B<anacron [-S spooldir>] -u [B<-t anacrontab>] [I<job>] ...
de: B<anacron [-S Spool-Verzeichnis>] -u [B<-t Anacrontab>] [I<Auftrag>]

source: Anacron can be used to execute commands periodically, with a frequency specified in days. Unlike B<cron(8)>, it does not assume that the machine is running continuously. Hence, it can be used on machines that aren't running 24 hours a day, to control daily, weekly, and monthly jobs that are usually controlled by B<cron>.
de: Anacron kann zum periodischen Ausführen von Befehlen verwendet, wobei die Häufigkeit in Tagen angegeben wird. Im Gegensatz zu B<cron>(8) wird nicht angenommen, dass der Rechner ununterbrochen in Betrieb ist. Daher kann es auch auf Rechnern, die nicht 24 Stunden täglich laufen, für regelmäßig täglich, wöchentlich oder monatlich auszuführende Aufträge verwendet werden, die normalerweise B<cron> steuert.

source: When executed, Anacron reads a list of jobs from a configuration file, normally I</etc/anacrontab> (see B<anacrontab(5)>). This file contains the list of jobs that Anacron controls. Each job entry specifies a period in days, a delay in minutes, a unique job identifier, and a shell command.
de: Bei der Ausführung liest Anacron eine Liste der Aufträge aus der Konfigurationsdatei, normalerweise I</etc/anacrontab> (siehe B<anacrontab>(5)). Diese Datei enthält die Liste der Aufträge, die Anacron steuert. Jeder Auftrag gibt eine Periode in Tagen, eine Verzögerung in Minuten, einen eindeutigen Auftragsbezeichner und einen Shell-Befehl an.

source: For each job, Anacron checks whether this job has been executed in the last n days, where n is the period specified for that job. If not, Anacron runs the job's shell command, after waiting for the number of minutes specified as the delay parameter.
de: Bei jedem Auftrag prüft Anacron, ob dieser Auftrag in den letzten B<n> Tagen ausgeführt wurde, wobei B<n> die für diesen Auftrag angegebene Zeitperiode ist. Falls nicht, führt Anacron nach der in Minuten angegebenen Verzögerung den Shell-Befehl dieses Auftrags aus.

source: After the command exits, Anacron records the date in a special timestamp file for that job, so it can know when to execute it again. Only the date is used for the time calculations. The hour is not used.
de: Nachdem die Befehlsausführung beendet ist, zeichnet Anacron das Datum (ohne die Stunde) in einer speziellen Zeitstempeldatei für diesen Auftrag auf, so dass es weiß, wann dieser Auftrag wieder ausgeführt werden muss. Für die Zeitberechnung wird nur das Datum, aber nicht die Stunde verwendet.

source: Anacron only considers jobs whose identifier, as specified in the I<anacrontab> matches any of the I<job> command-line arguments. The I<job> arguments can be shell wildcard patterns (be sure to protect them from your shell with adequate quoting). Specifying no I<job> arguments, is equivalent to specifying "*" (That is, all jobs will be considered).
de: Anacron berücksichtigt nur Aufträge, deren Bezeichner, der in I<Anacrontab> angegeben ist, auf irgendein Befehlszeilenargument des I<Auftrags> passt. Die Befehlszeilenargumente des I<Auftrags> können durch Shell-Platzhaltermuster angegeben werden, wobei Sie sicherstellen müssen, dass diese durch entsprechende Maskierung vor der Interpretation durch die Shell selbst geschützt werden. Wenn keine Befehlszeilenargumente für den I<Auftrag> angegeben werden, ist dies gleichbedeutend mit der Angabe von * (was bewirkt, dass Anacron alle Aufträge berücksichtigt).

source: Unless the B<-d> option is given (see below), Anacron forks to the background when it starts, and the parent process exits immediately.
de: Außer wenn Anacron mit der Option B<-d> aufgerufen wird (Beschreibung siehe unten), wird es beim Start per Fork in den Hintergrund verschoben und der Elternprozess wird unmittelbar beendet.

source: Unless the B<-s> or B<-n> options are given, Anacron starts jobs immediately when their delay is over. The execution of different jobs is completely independent.
de: Außer wenn Anacron mit den Optionen B<-d> oder B<-n> aufgerufen wird, startet es die Aufträge unmittelbar nachdem deren Verzögerungszeit verstrichen ist. Die verschiedenen Aufträge werden völlig unabhängig voneinander ausgeführt.

source: If a job generates any output on its standard output or standard error, the output is mailed to the user running Anacron (usually root), or to the address contained by the MAILTO environment variable in the crontab, if such exists.
de: Falls ein ausgeführter Auftrag etwas in die Standardausgabe oder Standardfehlerausgabe schreibt, werden diese Ausgaben per E-Mail an den Benutzer, unter dessen Benutzerkonto Anacron ausgeführt wird (üblicherweise root), gesendet. Falls in der Crontab die Umgebungsvariable B<MAILTO> gesetzt ist, werden die Ausgaben stattdessen an die dort angegebene Adresse gesendet.

source: Informative messages about what Anacron is doing are sent to B<syslogd(8)> under facility B<cron>, priority B<notice>. Error messages are sent at priority B<error>.
de: Alle durch Anacron erzeugten informativen Meldungen werden an B<syslogd>(8) gesendet, wobei die Einrichtung auf B<cron> und die Priorität auf B<notice> gesetzt wird. Alle Fehlermeldungen werden mit der Priorität B<error> versendet.

source: "Active" jobs (i.e. jobs that Anacron already decided to run and now wait for their delay to pass, and jobs that are currently being executed by Anacron), are "locked", so that other copies of Anacron won't run them at the same time.
de: Aktive Aufträge (solche, über deren Ausführung Anacron bereits entschieden hat und die nun auf das Verstreichen der Verzögerungszeit warten, sowie Aufträge, die bereits von Anacron ausgeführt werden), sind gesperrt, so dass weitere Instanzen von Anacron diese nicht zur gleichen Zeit ausführen knnen.

source: Force execution of the jobs, ignoring the timestamps.
de: erzwingt die Ausführung der Aufträge, wobei die Zeitstempel ignoriert werden.

source: Only update the timestamps of the jobs, to the current date, but don't run anything.
de: aktualisiert nur die Zeitstempel aller Aufträge auf das aktuelle Datum, aber führt keine Aufträge aus.

source: Serialize execution of jobs. Anacron will not start a new job before the previous one finished.
de: serialisiert die Ausführung von Aufträgen. Anacron startet keinen neuen Auftrag, bevor der vorherige Auftrag nicht beendet ist.

source: Run jobs now. Ignore the delay specifications in the I</etc/anacrontab> file. This options implies B<-s>.
de: führt Aufträge sofort aus, wobei die in der Datei I</etc/anacrontab> angegebene Verzögerung ignoriert wird. Diese Option impliziert B<-s>.

source: Don't fork to the background. In this mode, Anacron will output informational messages to standard error, as well as to syslog. The output of jobs is mailed as usual.
de: verschiebt Anacron nicht per Fork in den Hintergrund. In diesem Modus schreibt Anacron informative Meldungen in die Standardfehlerausgabe und in das Systemprotokoll. Die Ausgabe jedes Auftrags wird durch Anacron wie gewöhnlich per E-Mail versendet.

source: Suppress messages to standard error. Only applicable with B<-d>.
de: unterdrückt alle Meldungen, die in die Standardausgabe geschrieben werden würden. Diese Option ist nur zusammen mit B<-d> anwendbar.

source: Use specified anacrontab, rather than the default
de: verwendet die angegebene Anacrontab anstelle der standardmäßigen Datei.

source: Anacrontab testing. The configuration file will be tested for validity. If there is an error in the file, an error will be shown and anacron will return 1. Valid anacrontabs will return 0.
de: dient zum Prüfen der Anacron-Konfigurationsdatei auf Gültigkeit. Falls die Datei einen Fehler enthält, wird eine Fehlermeldung angezeigt und Anacron gibt den Wert 1 zurück. Gültige Anacrontabs geben den Wert 0 zurück.

source: Use the specified spooldir to store timestamps in. This option is required for users who wish to run anacron themselves.
de: verwendet das angegebene Spool-Verzeichnis zum Speichern von Zeitstempeln. Diese Option ist für Benutzer erforderlich, die Anacron selbst ausführen wollen.

source: Print version information, and exit.
de: gibt Versionsinformationen aus und beendet das Programm.

source: Print short usage message, and exit.
de: zeigt kurze Informationen zur Verwendung an und beendet das Programm.

source: After receiving a B<SIGUSR1> signal, Anacron waits for running jobs, if any, to finish and then exits. This can be used to stop Anacron cleanly.
de: Nachdem ein B<SIGUSR1>-Signal empfangen wurde, wartet Anacron auf den Abschluss eventuell noch laufender Aufträge und beendet sich dann. Dies kann dazu verwendet werden, um Anacron korrekt zu beenden.

source: Make sure that the time-zone is set correctly before Anacron is started. (The time-zone affects the date). This is usually accomplished by setting the TZ environment variable, or by installing a I</usr/lib/zoneinfo/localtime> file. See B<tzset(3)> for more information.
de: Stellen Sie vor der Ausführung von Anacron sicher, dass die Einstellung der Zeitzone korrekt ist, da diese sich auf das Datum auswirkt. Dies erreichen Sie üblicherweise durch Setzen der Umgebungsvariable B<TZ> oder durch Installation einer Datei I</usr/lib/zoneinfo/localtime>. In B<tzset>(3) finden Sie weitere Informationen.

source: Timestamp files are created in the spool directory for each job in anacrontab. These are never removed automatically by anacron, and should be removed by hand if a job is no longer being scheduled.
de: Zeitstempeldateien werden für jeden in der Anacrontab aufgeführten Auftrag im Spool-Verzeichnis angelegt. Diese Dateien werden von Anacron niemals automatisch entfernt und sollten manuell gelöscht werden, sobald ein Auftrag nicht mehr planmäßig ausgeführt werden soll.

source: DEBIAN-SPECIFIC CONFIGURATION
de: DEBIAN-SPEZIFISCHE KONFIGURATION
