Repository: sebras/manpages-l10n
Catalog: po/*/man8/anacron.8.po
Languages: de

source: On Debian-based systems, anacron will be activated hourly every day from 07:30 local time to 23:30 local time through cron job (on non-systemd systems where cron is installed and enabled) or systemd timer (on systemd-based systems). On activation, anacron will check if it missed some jobs. If yes, it will start those jobs after a short period of time.
de: Auf Debian-basierten Systemen wird Anacron jeden Tag stündlich zwischen 7.30 Uhr und 23.30 Uhr lokaler Zeit aktiviert. Das geschieht auf Systemen ohne Systemd über einen Cron-Auftrag und auf Systemen mit Systemd über einen Systemd-Timer. Bei der Aktivierung prüft Anacron, ob eventuell Aufträge übergangen worden sind. In solchen Fällen werden diese Aufträge nach einer kurzen Zeitspanne gestartet.

source: By default, The hourly activation of anacron will not take place when the system is using battery and no AC power is connected to the computer. It is meant to reduce power usage and extend battery life, but such design might lead to unwanted results.
de: Standardmäßig wird Anacron nicht stündlich aktiviert, wenn das System über Akkus mit Strom versorgt wird und keine Netzspannung angeschlossen ist. Dadurch soll der Energieverbrauch verringert und damit die Akkulaufzeit verlängert werden, was aber zu unerwünschten Ergebnissen führen knnte.

source: Users may disable this feature and let anacron run regardless of power supply. Please read Debian-specific documentation in I</usr/share/doc/anacron/README.Debian> file for detailed instruction in now to change such behaviour.
de: Benutzer können diese Funktion deaktivieren und Anacron von der Art der Stromversorgung unabhängig ausführen lassen. In der Debian-spezifischen Dokumentation in I</usr/share/doc/anacron/README.Debian> finden Sie detaillierte Anweisungen, wie Sie dieses Verhalten ändern knnen.

source: Contains specifications of jobs. See B<anacrontab(5)> for a complete description.
de: Enthält die Auftragsspezifikationen. In B<anacrontab>(5) finden Sie eine vollständige Beschreibung.

source: This file provides systemd service for anacron.
de: Diese Datei stellt den Systemd-Dienst für Anacron bereit.

source: This file provides systemd timer for anacron. Currently the service is triggered hourly through systemd timer.
de: Diese Datei stellt Systemd-Timer für Anacron bereit. Gegenwärtig wird der Dienst stündlich durch einen Systemd-Timer ausgelöst.

source: B<anacrontab(5), cron(8), tzset(3)>
de: B<anacrontab>(5), B<cron>(8), B<tzset>(3)

source: For Debian-specific modifications, please read I</usr/share/doc/anacron/README.Debian> file for detailed information.
de: Detaillierte Informationen zu den Debian-spezifischen Änderungen finden Sie in der Datei I</usr/share/doc/anacron/README.Debian>.

source: Anacron uses up to two file descriptors for each active job. It may run out of descriptors if there are more than about 125 active jobs (on normal kernels).
de: Anacron verwendet bis zu zwei Dateideskriptoren für jeden aktiven Auftrag. Bei mehr als 125 aktiven Aufträgen können die Dateideskriptoren ausgeschöpft werden (bei normalen Kerneln).

source: Mail comments, suggestions and bug reports to Sean 'Shaleh' Perry E<lt>shaleh@(debian.org|valinux.com)E<gt>.
de: Senden Sie Kommentare, Vorschläge und Fehlermeldungen (auf Englisch) an Sean Shaleh Perry E<lt>shaleh@(debian.org|valinux.com)E<gt>.

source: Anacron was originally conceived and implemented by Christian Schwarz E<lt>schwarz@monet.m.isar.deE<gt>. The current implementation is a complete rewrite by Itai Tzur E<lt>itzur@actcom.co.ilE<gt>.
de: Anacron wurde ursprünglich von Christian Schwarz E<lt>schwarz@monet.m.isar.deE<gt> konzipiert und implementiert. Die derzeitige Implementierung wurde von Itai Tzur E<lt>itzur@actcom.co.ilE<gt> vollständig neu geschrieben.

source: The code base was maintained by Sean 'Shaleh' Perry E<lt>shaleh@(debian.org|valinux.com)E<gt>. During 2004-2006, it was maintained by Pascal Hakim E<lt>pasc@(debian.org|redellipse.net)E<gt>. During 2009-2014, it was maintained by Peter Eisentraut E<lt>petere@debian.orgE<gt>.
de: Die Code-Basis wurde von Sean Shaleh Perry E<lt>shaleh@(debian.org|valinux.com)E<gt> betreut. In den Jahren von 2004 bis 2006 wurde Anacron von Pascal Hakim E<lt>pasc@(debian.org|redellipse.net)E<gt> und von 2009 bis 2014 von Peter Eisentraut E<lt>petere@debian.orgE<gt> betreut.

source: Nowadays anacron in Debian is co-maintained by various developers from Debian Project.
de: Das heutige Anacron in Debian wird von verschiedenen Entwicklern aus dem Debian-Projekt gemeinsam betreut.
