Repository: sebras/manpages-l10n
Catalog: po/*/man8/atd.8.po
Languages: fr

source: NAME
fr: NOM

source: atd - run jobs queued for later execution
fr: atd – Exécuter des tâches enregistrées pour un lancement ultérieur

source: B<atd> [B<-l> I<load_avg>] [B<-b> I<batch_interval>] [B<-d>] [B<-f>] [B<-s>]
fr: B<atd> [B<-l> I<charge_moyenne>] [B<-b> I<intervalle_batch>] [B<-d>] [B<-f>] [B<-s>]

source: B<atd> runs jobs queued by B<at>(1)B<.>
fr: B<atd> exécute les travaux mis en file d'attente par B<at(1)>.

source: Specifies a limiting load factor, over which batch jobs should not be run, instead of the compile-time choice of 0.8. For an SMP system with I<n> CPUs, you will probably want to set this higher than I<n-1.>
fr: Indiquer le facteur limite de charge, au delà duquel les travaux ne devraient pas être lancés, à la place du choix de B<0,8> précompilé. Pour un système SMP (multiprocesseur) avec I<n> CPU, vous voudrez probablement le mettre plus grand que I<n-1>.

source: Specify the minimum interval in seconds between the start of two batch jobs (60 default).
fr: Indiquer l'intervalle minimal en secondes entre le départ de deux traitements par lots (60 par défaut)

source: Debug; print error messages to standard error instead of using B<syslog>(3)B<.> This option also implies B<-f>.
fr: Débogage. Afficher les messages d'erreurs sur la sortie standard au lieu d'utiliser B<syslog>(3). Cette option implique également l'option B<-f>.

source: Run B<atd> in the foreground.
fr: Exécuter B<atd> en tâche de fond.

source: Process the at/batch queue only once. This is primarily of use for compatibility with old versions of B<at>; B<atd -s> is equivalent to the old B<atrun> command.
fr: Traiter la file d'attente I<at/batch> une seule fois. Cette commande est utile surtout pour une compatibilité avec les anciennes versions de B<at>\ ; B<atd\ -s> est équivalent à l'ancienne commande B<atrun>.

source: WARNING
fr: AVERTISSEMENT

source: B<atd> won't work if its spool directory is mounted via NFS even if I<no_root_squash> is set.
fr: B<atd> ne fonctionnera pas si le répertoire de stockage est monté à travers NFS, même si I<no_root_squash> est indiqué.

source: FILES
fr: FICHIERS

source: I</var/spool/atd> The directory for storing jobs; this should be mode 700, owner daemon.
fr: I</var/spool/atd>, répertoire pour stocker les travaux\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: I</var/spool/atd> The directory for storing output; this should be mode 700, owner daemon.
fr: I</var/spool/atd>, répertoire pour stocker le résultat\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: I</etc/at.allow>, I</etc/at.deny> determine who can use the B<at> system.
fr: I</etc/at.allow>, I</etc/at.deny> déterminent qui peut utiliser le mécanisme B<at>.

source: SEE ALSO
fr: VOIR AUSSI

source: BUGS
fr: BOGUES

source: The functionality of B<atd> should be merged into B<cron>(8)B<.>
fr: Les fonctionnalités de B<atd> devraient être regroupées dans B<cron>(8).

source: Specifies a limiting load factor, over which batch jobs should not be run, instead of the compile-time choice of 1.5. For an SMP system with I<n> CPUs, you will probably want to set this higher than I<n-1.>
fr: Indiquer le facteur limite de charge, au delà duquel les travaux ne devraient pas être lancés, à la place du choix de B<1,5> précompilé. Pour un système SMP (multiprocesseur) avec I<n> CPU, vous voudrez probablement le mettre plus grand que I<n-1>.

source: I</var/spool/cron/atjobs> The directory for storing jobs; this should be mode 700, owner daemon.
fr: I</var/spool/cron/atjobs>, répertoire pour stocker les travaux\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: I</var/spool/cron/atspool> The directory for storing output; this should be mode 700, owner daemon.
fr: I</var/spool/cron/atspool>, répertoire pour stocker le résultat\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: B<atd> [B<-l> I<load_avg>] [B<-b> I<batch_interval>] [B<-d>] [B<-f>] [B<-n>] [B<-s>]
fr: B<atd> [B<-l> I<charge_moyenne>] [B<-b> I<intervalle_batch>] [B<-d>] [B<-f>] [B<-n>] [B<-s>]

source: Process the at/batch queue only once. This is primarily of use for compatibility with old versions of B<at>; B<-n> Append the hostname of the system to the subject of the e-mails sent by B<atd>.
fr: Traiter la file d'attente I<at/batch> une seule fois. Cette commande est utile surtout pour une compatibilité avec les anciennes versions de B<at>\ ; B<-n>, ajout du nom d’hôte du système au sujet du courriel envoyé par B<atd>.

source: is equivalent to the old B<atrun> command.
fr: est équivalent à l’ancienne commande B<atrun>.

source: I</var/spool/at> The directory for storing jobs; this should be mode 700, owner root.
fr: I</var/spool/at>, répertoire pour stocker les travaux\ ; les droits d'accès devraient être 700, le propriétaire root.

source: I</var/spool/at/spool> The directory for storing output; this should be mode 700, owner root.
fr: I</var/spool/at/spool>, répertoire pour stocker le résultat\ ; les droits d'accès devraient être 700, le propriétaire root.

source: I</var/spool/at> The directory for storing jobs; this should be mode 700, owner daemon.
fr: I</var/spool/at>, répertoire pour stocker les travaux\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: I</var/spool/at/spool> The directory for storing output; this should be mode 700, owner daemon.
fr: I</var/spool/at/spool>, répertoire pour stocker le résultat\ ; les droits d'accès devraient être 700, le propriétaire daemon.

source: B<atd> runs jobs queued by B<at(1)>.
fr: B<atd> exécute les travaux mis en file d'attente par B<at>(1).

source: Specifies a limiting load factor, over which batch jobs should not be run, instead of the compile-time choice of 0.8. This number is multiplied by the amount of CPUs when comparing to /proc/loadavg, because loadavg is a sum over all processors on Linux.
fr: Indiquer le facteur limite de charge, au delà duquel les travaux ne devraient pas être lancés, à la place du choix de B<0,8> précompilé. Le nombre est multiplié par le nombre des processeurs lors de la comparaison avec I</proc/loadavg>, car I<charge_moyenne> (I<loadavg>) est une quantité concernant tous les processeurs sur Linux.

source: Debug; print error messages to standard error instead of using B<syslog(3)>. This option also implies B<-f>.
fr: Débogage. Afficher les messages d'erreurs sur la sortie standard au lieu d'utiliser B<syslog>(3). Cette option implique également l'option B<-f>.

source: I</var/spool/atjobs> The directory for storing jobs; this should be mode 700, owner at.
fr: I</var/spool/atjobs>, répertoire pour stocker les travaux\ ; les droits d'accès devraient être 700, le propriétaire at.

source: I</var/spool/atspool> The directory for storing output; this should be mode 700, owner at.
fr: I</var/spool/atspool>, répertoire pour stocker le résultat\ ; les droits d'accès devraient être 700, le propriétaire at.
