Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkdiscard.8.po
Languages: uk

source: System Administration
uk: Керування системою

source: NAME
uk: НАЗВА

source: blkdiscard - discard sectors on a device
uk: blkdiscard — відкидання секторів на пристрої

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<blkdiscard> [options] [B<-o> I<offset>] [B<-l> I<length>] I<device>
uk: B<blkdiscard> [параметри] [B<-o> I<відступ>] [B<-l> I<довжина>] I<пристрій>

source: DESCRIPTION
uk: ОПИС

source: B<blkdiscard> is used to discard device sectors. This is useful for solid-state drivers (SSDs) and thinly-provisioned storage. Unlike B<fstrim>(8), this command is used directly on the block device.
uk: B<blkdiscard> використовують для відкидання секторів на пристрої. Це корисно для твердотільних накопичувачів даних (SSD) та сховищ даних із тонким передбаченням. На відміну від B<fstrim>(8), цю команду застосовують безпосередньо до блокового пристрою.

source: By default, B<blkdiscard> will discard all blocks on the device. Options may be used to modify this behavior based on range or size, as explained below.
uk: Типово, B<blkdiscard> відкине усі блоки на пристрої. Для внесення змін до цієї поведінки на основі даних щодо діапазону або розміру, як це описано нижче, можна скористатися параметрами.

source: The I<device> argument is the pathname of the block device.
uk: Аргумент I<пристрій> визначає шлях до блокового пристрою.

source: B<WARNING: All data in the discarded region on the device will be lost!>
uk: B<УВАГА! Усі дані на відкинутій ділянці на пристрої буде втрачено!>

source: OPTIONS
uk: ПАРАМЕТРИ

source: The I<offset> and I<length> arguments may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB") or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB.
uk: Після аргументів I<відступ> і I<довжина> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB.

source: Disable all checking. Since v2.36 the block device is open in exclusive mode (B<O_EXCL>) by default to avoid collision with mounted filesystem or another kernel subsystem. The B<--force> option disables the exclusive access mode.
uk: Вимкнути усі перевірки. Починаючи з версії 2.36, типово, блоковий пристрій буде відкрито у виключному режимі (B<O_EXCL>) для запобігання конфліктам зі змонтованими файловими системами або іншими підсистемами ядра. Параметр B<--force> вимикає виключний режим доступу.

source: B<-o>, B<--offset> I<offset>
uk: B<-o>, B<--offset> I<відступ>

source: Byte offset into the device from which to start discarding. The provided value must be aligned to the device sector size. The default value is zero.
uk: Відступ у байтах на пристрої, з якого слід починати відкидання. Надане значення має бути вирівняно за розміром сектора на пристрої. Типовим значенням є нульове.

source: B<-l>, B<--length> I<length>
uk: B<-l>, B<--length> I<довжина>

source: The number of bytes to discard (counting from the starting point). The provided value must be aligned to the device sector size. If the specified value extends past the end of the device, B<blkdiscard> will stop at the device size boundary. The default value extends to the end of the device.
uk: Кількість байтів для відкидання (з відліком з початкової позиції). Надане значення має бути вирівняно за розміром сектора на пристрої. Якщо вказане значення виходить за межі пристрою, B<blkdiscard> зупиниться на межі розміру пристрою. Типовим є значення, яке поширює ділянку до кінця пристрою.

source: B<-p>, B<--step> I<length>
uk: B<-p>, B<--step> I<довжина>

source: The number of bytes to discard within one iteration. The default is to discard all by one ioctl call.
uk: Кількість байтів, які слід відкидати протягом однієї ітерації. Типово, усі байти буде відкинуто одним викликом керування введенням-виведенням.

source: Perform a secure discard. A secure discard is the same as a regular discard except that all copies of the discarded blocks that were possibly created by garbage collection must also be erased. This requires support from the device.
uk: Виконати безпечне відкидання. Безпечним є відкидання, коли програма виконує звичайне відкидання, але усі копії відкинутих блоків, які може бути створено збиральників сміття, також має бути витерто. Підтримку цієї дії має бути реалізовано на рівні пристрою.

source: Zero-fill rather than discard.
uk: Заповнити нулями замість відкидання.

source: Display the aligned values of I<offset> and I<length>. If the B<--step> option is specified, it prints the discard progress every second.
uk: Виводити вирівняні значення I<відступу> та I<довжини>. Якщо вказано параметр B<--step>, програма виводитиме поступ відкидання кожної секунди.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: AUTHORS
uk: АВТОРИ

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<blkdiscard> command is part of the util-linux package which can be downloaded from
uk: B<blkdiscard> є частиною пакунка util-linux, який можна отримати з

source: July 2014
uk: липень 2014 року

source: B<blkdiscard> is used to discard device sectors. This is useful for solid-state drivers (SSDs) and thinly-provisioned storage. Unlike B<fstrim>(8), this command is used directly on the block device.
uk: B<blkdiscard> використовують для відкидання секторів на пристрої. Це корисно для твердотільних накопичувачів даних (SSD) та сховищ даних із тонким передбаченням. На відміну від B<fstrim>(8), цю команду застосовують безпосередньо до блокового пристрою.

source: By default, B<blkdiscard> will discard all blocks on the device. Options may be used to modify this behavior based on range or size, as explained below.
uk: Типово, B<blkdiscard> відкине усі блоки на пристрої. Для внесення змін до цієї поведінки на основі даних щодо діапазону або розміру, як це описано нижче, можна скористатися параметрами.

source: Disable all checking. Since v2.36 the block device is open in exclusive mode (O_EXCL) by default to avoid collision with mounted filesystem or another kernel subsystem. The force option disables the exclusive access mode.
uk: Вимкнути усі перевірки. Починаючи з версії 2.36, типово, блоковий пристрій буде відкрито у виключному режимі (B<O_EXCL>) для запобігання конфліктам зі змонтованими файловими системами або іншими підсистемами ядра. Параметр B<--force> вимикає виключний режим доступу.

source: B<-o>,B< --offset >I<offset>
uk: B<-o>, B<--offset> I<відступ>

source: Byte offset into the device from which to start discarding. The provided value must be aligned to the device sector size. The default value is zero.
uk: Відступ у байтах на пристрої, з якого слід починати відкидання. Надане значення має бути вирівняно за розміром сектора на пристрої. Типовим значенням є нульове.

source: B<-l>,B< --length >I<length>
uk: B<-l>, B<--length> I<довжина>

source: The number of bytes to discard (counting from the starting point). The provided value must be aligned to the device sector size. If the specified value extends past the end of the device, B<blkdiscard> will stop at the device size boundary. The default value extends to the end of the device.
uk: Кількість байтів для відкидання (з відліком з початкової позиції). Надане значення має бути вирівняно за розміром сектора на пристрої. Якщо вказане значення виходить за межі пристрою, B<blkdiscard> зупиниться на межі розміру пристрою. Типовим є значення, яке поширює ділянку до кінця пристрою.

source: B<-p>,B< --step >I<length>
uk: B<-p>, B<--step> I<довжина>

source: Perform a secure discard. A secure discard is the same as a regular discard except that all copies of the discarded blocks that were possibly created by garbage collection must also be erased. This requires support from the device.
uk: Виконати безпечне відкидання. Безпечним є відкидання, коли програма виконує звичайне відкидання, але усі копії відкинутих блоків, які може бути створено збиральників сміття, також має бути витерто. Підтримку цієї дії має бути реалізовано на рівні пристрою.

source: Display the aligned values of I<offset> and I<length>. If the B<--step> option is specified, it prints the discard progress every second.
uk: Виводити вирівняні значення I<відступу> та I<довжини>. Якщо вказано параметр B<--step>, програма виводитиме поступ відкидання кожної секунди.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: The blkdiscard command is part of the util-linux package and is available E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма blkdiscard є частиною пакунка util-linux і доступна з E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: Disable all checking. Since v2.36 the block device is open in exclusive mode (O_EXCL) by default to avoid collision with mounted filesystem or another kernel subsystem. The B<--force> option disables the exclusive access mode.
uk: Вимкнути усі перевірки. Починаючи з версії 2.36, типово, блоковий пристрій буде відкрито у виключному режимі (B<O_EXCL>) для запобігання конфліктам зі змонтованими файловими системами або іншими підсистемами ядра. Параметр B<--force> вимикає виключний режим доступу.
