Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkid.8.po
Languages: de, fr, uk

source: B<-n>, B<--match-types> I<list>
de: B<-n>, B<--match-types> I<Liste>
fr: B<-n>, B<--match-types> I<liste>
uk: B<-n>, B<--match-types> I<список>

source: Restrict the probing functions to the specified (comma-separated) I<list> of superblock types (names). The list items may be prefixed with "no" to specify the types which should be ignored. For example:
de: beschränkt die Prüffunktionen auf die (durch Kommata getrennten) angegebene I<Liste> der Superblocktypen (Namen). Den Listeneinträgen kann »no« vorangestellt werden, um die Typen festzulegen, die ignoriert werden sollen. Beispielsweise prüft
fr: Restreindre les fonctions de détection à la I<liste>, séparée par des virgules, de types (noms) de superblocs. Les types peuvent être préfixés dans la liste par B<no> pour signifier qu'ils doivent être ignorés. Par exemple :
uk: Обмежити функції зондування вказаним I<списком> типів (назв) суперблоків (відокремлених комами). До пунктів списку можна додавати префікс «no» для визначення типів, які має бути проігноровано. Приклад:

source: probes for vfat, ext3 and ext4 filesystems, and
de: auf Vfat, Ext3- und Ext4-Dateisysteme und
fr: détecte les systèmes de fichiers VFAT, ext3 et ext4, et
uk: виконує зондування файлових систем vfat, ext3 і ext4, і

source: probes for all supported formats except minix filesystems. This option is only useful together with B<--probe>.
de: prüft auf alle unterstützten Formate außer Minix-Dateisysteme. Diese Option ist nur mit B<--probe> zusammen sinnvoll.
fr: détecte tous les formats gérés sauf les systèmes de fichiers MINIX. Cette option n'est utile qu'avec l'option B<--probe>.
uk: зондує щодо усіх підтримуваних форматів, окрім файлових систем minix. Цей параметр є корисним лише разом із B<--probe>.

source: B<-o>, B<--output> I<format>
uk: B<-o>, B<--output> I<формат>

source: Use the specified output format. Note that the order of variables and devices is not fixed. See also option B<-s>. The I<format> parameter may be:
de: verwendet das angegebene Ausgabeformat. Beachten Sie, dass die Reihenfolge der Variablen und Geräte nicht festgelegt ist. Siehe auch die Option B<-s>. Folgende Werte kann der Parameter I<Format> annehmen:
fr: Utiliser le format de sortie indiqué. Remarquez que l’ordre des variables et des périphériques n’est pas fixé. Consultez également l’option B<-s>. Le paramètre I<format> peut prendre une des valeurs suivantes :
uk: Скористатися вказаним форматом виведення. Зауважте, що порядок змінних і пристроїв не є фіксованим. Див. також параметр B<-s>. Значенням параметра I<формат> може бути таким:

source: print all tags (the default)
de: alle Markierungen ausgeben (Vorgabe)
fr: Afficher tous les indicateurs (option par défaut).
uk: вивести усі мітки (типовий режим)

source: print the value of the tags
de: den Wert der Markierungen ausgeben
fr: Afficher la valeur des indicateurs.
uk: вивести значення міток

source: print the devices in a user-friendly format; this output format is unsupported for low-level probing (B<--probe> or B<--info>).
de: gibt die Geräte in einem benutzerfreundlichen Format aus; dieses Ausgabeformat wird bei systemnaher Untersuchung (B<--probe> oder B<--info>) nicht unterstützt.
fr: Afficher les périphériques dans un format agréable. Ce format d'affichage n'est pas pris en charge pour la détection bas niveau (B<--probe> ou B<--info>).
uk: вивести записи пристроїв у зручному для читання форматі; цей формат виведення є непідтримуваним для низькорівневого зондування (B<--probe> або B<--info>).

source: This output format is B<DEPRECATED> in favour of the B<lsblk>(8) command.
de: Dieses Ausgabeformat ist zugunsten des Befehls B<lsblk>(8) B<VERALTET>.
fr: Ce format d’affichage est B<obsolète>, remplacé par la commande B<lsblk>(8).
uk: Цей формат виведення вважається B<ЗАСТАРІЛИМ>, його замінила команда B<lsblk>(8).

source: print the device name only; this output format is always enabled for the B<--label> and B<--uuid> options
de: gibt nur die Gerätenamen aus; dieses Ausgabeformat wird für die Optionen B<--label> und B<--uuid> immer aktiviert.
fr: Afficher seulement le nom de périphérique. Ce format d'affichage est toujours activé pour les options B<--label> et B<--uuid>.
uk: вивести лише назви пристроїв; цей формат виведення завжди увімкнено для параметрів B<--label> і B<--uuid>

source: print key="value" pairs for easy import into the udev environment; the keys are prefixed by ID_FS_ or ID_PART_ prefixes. The value may be modified to be safe for udev environment; allowed is plain ASCII, hex-escaping and valid UTF-8, everything else (including whitespaces) is replaced with \(aq_\(aq. The keys with I<_ENC> postfix use hex-escaping for unsafe chars.
de: gibt key="Wert"-Paare für den leichten Import in die Udev-Umgebung aus; den Schlüsseln wird ID_FS_ oder ID_PART_ vorangestellt. Der Wert kann angepasst werden, um sicher für die Udev-Umgebung zu sein. Erlaubt ist reines ASCII, hex-maskiertes und gültiges UTF-8; alles sonst (einschließlich Leerzeichen) wird durch »_« ersetzt. Die Schlüssel mit der Endung I<_ENC> verwenden hex-Maskierung für unsichere Zeichen.
fr: Afficher les paires I<clé>B<=>I<valeur> pour une importation aisée dans l’environnement udev. Les clés sont préfixées avec B<ID_FS_> ou B<ID_PART_>. La valeur peut être modifiée pour être sûre dans l’environnement udev. Sont permises l’ASCII pur, la protection par valeur hexadécimale et l’UTF-8 valable. Toutes les autres valeurs (y compris les espaces blancs) sont remplacées par « _ ». Les clés avec le suffixe I<_ENC> utilisent la protection hexadécimale pour les caractères non sûrs.
uk: вивести пари ключ="значення" для полегшення імпортування до середовища udev; до ключів буде додано префікс ID_FS_ або ID_PART_. Значення може бути змінено для убезпечення середовища udev; можна використовувати звичайні символи ASCII, екрановані шістнадцяткові послідовності та чинні символи UTF-8. Усі інші символи (зокрема пробіли) буде замінено символом «{underscore}». У ключах із постфіксом I<_ENC> для небезпечних символів буде використано шістнадцяткове екранування.

source: The udev output returns the ID_FS_AMBIVALENT tag if more superblocks are detected, and ID_PART_ENTRY_* tags are always returned for all partitions including empty partitions.
de: Die Udev-Ausgabe liefert die ID_FS_AMBIVALENT-Markierung, falls weitere Superblöcke erkannt wurden. Außerdem werden für alle, auch leere Partitionen, ID_PART_ENTRY_*-Markierungen zurückgeliefert.
fr: La sortie B<udev> renvoie l'indicateur B<ID_FS_AMBIVALENT> si plusieurs superblocs sont détectés et des indicateurs B<ID_PART_ENTRY_>I<*> sont toujours renvoyés pour toutes les partitions, y compris les partitions vides.
uk: Виведення udev повертає мітку ID_FS_AMBIVALENT, якщо буде виявлено більше суперблоків, а мітки ID_PART_ENTRY_* буде повернуто завжди для усіх розділів, включно із порожніми.

source: This output format is B<DEPRECATED>.
de: Dieses Ausgabeformat ist B<VERALTET>.
fr: Ce format d’affichage est B<obsolète>.
uk: Цей формат виведення є B<ЗАСТАРІЛИМ>.

source: print key=value pairs for easy import into the environment; this output format is automatically enabled when I/O Limits (B<--info> option) are requested.
de: gibt Schlüssel=Wert-Paare zum leichten Import in die Umgebung aus; dieses Ausgabeformat wird immer aktiviert, wenn E/A-Begrenzungen (Option B<--info>) angefordert werden.
fr: Afficher les couples de I<clé>B<=>I<valeur> pour les importer facilement dans l'environnement. Ce format de sortie est automatiquement activé quand des limites d'E/S (option B<--info>) sont demandées.
uk: вивести пари ключ=значення для полегшення імпортування до середовища; цей формат виведення буде автоматично увімкнено, якщо встановлено обмеження введення-виведення (параметр B<--info>).

source: The non-printing characters are encoded by ^ and M- notation and all potentially unsafe characters are escaped.
de: Die nichtdruckbaren Zeichen werden mit der Notation ^ und M- kodiert und alle möglicherweise unsicheren Zeichen werden maskiert.
fr: Les caractères non imprimables sont encodés par les notations B<^> et B<M-> et tous les caractères potentiellement non sûrs sont protégés.
uk: Непридатні до друку символи буде закодовано за допомогою позначень символами ^ і M-, а усі потенційно небезпечні символи буде екрановано.

source: B<-O>, B<--offset> I<offset>
de: B<-O>, B<--offset> I<Versatz>
fr: B<-O>, B<--offset> I<position>
uk: B<-O>, B<--offset> I<відступ>

source: Probe at the given I<offset> (only useful with B<--probe>). This option can be used together with the B<--info> option.
de: untersucht an dem übergebenen I<Versatz> (nur nützlich mit B<--probe>). Diese Option kann mit der Option B<--info> zusammen verwandt werden.
fr: Détecter à la I<position> donnée (seulement utile avec B<--probe>). Cette option peut être utilisée avec l'option B<--info>.
uk: Зондувати за вказаним I<відступом> (корисний лише з B<--probe>). Цей параметр може бути використано разом із параметром B<--info>.

source: Switch to low-level superblock probing mode (bypassing the cache).
de: schaltet auf systemnahe Superblockuntersuchung um (unter Umgehung des Zwischenspeichers).
fr: Passer en mode de détection bas niveau de superbloc (en contournant le cache).
uk: Перемкнутися на режим низькорівневого зондування суперблоку (в обхід кешу).

source: Note that low-level probing also returns information about partition table type (PTTYPE tag) and partitions (PART_ENTRY_* tags). The tag names produced by low-level probing are based on names used internally by libblkid and it may be different than when executed without B<--probe> (for example PART_ENTRY_UUID= vs PARTUUID=). See also B<--no-part-details>.
de: Beachten Sie, dass systemnahe Untersuchungen auch Informationen über Partitionstabellen (PART_ENTRY_*-Markierung) zurückliefern. Die Markierungsnamen, die von systemnaher Untersuchung zurückgeliefert werden, basieren auf den intern von libblkid benutzten Namen und können sich von dem unterscheiden, was beim Aufruf mit B<--probe> gemeldet wird (zum Beispiel PART_ENTRY_UUID= vs PARTUUID=). Siehe auch B<--no-part-details>.
fr: Remarquez que la détection bas niveau renvoie aussi des informations sur le type de table de partitions (indicateur B<PTTYPE>) et sur les partitions (indicateurs B<PART_ENTRY_>I<*>). Les noms d’indicateurs produits par la détection bas niveau sont basés sur les noms utilisés en interne par libblkid et peuvent être différents lorsqu’elle est exécutée sans B<--probe> (par exemple, B<PART_ENTRY_UUID=> vs B<PARTUUID=>). Consultez aussi B<--no-part-details>.
uk: Зауважте, що за використання низькорівневого зондування буде також повернуто відомості щодо типу таблиці розділів (мітку PTTYPE) та розділів (мітки PART_ENTRY_*). Назви міток, які буде створено низькорівневим зондуванням, буде засновано на назвах, які використовують на внутрішньому рівні у libblkid, і можуть відрізнятися від тих, які буде отримано без B<--probe> (наприклад, PART_ENTRY_UUID= або PARTUUID=). Див. також B<--no-part-details>.

source: B<-s>, B<--match-tag> I<tag>
de: B<-s>, B<--match-tag> I<Markierung>
fr: B<-s>, B<--match-tag> I<indicateur>
uk: B<-s>, B<--match-tag> I<мітка>

source: For each (specified) device, show only the tags that match I<tag>. It is possible to specify multiple B<--match-tag> options. If no tag is specified, then all tokens are shown for all (specified) devices. In order to just refresh the cache without showing any tokens, use B<--match-tag none> with no other options.
de: zeigt für jedes (angegebene) Gerät nur die Markierungen, die auf I<Markierung> passen, an. Es ist möglich, mehrere Optionen B<--match-tag> anzugeben. Falls keine Markierung angegeben ist, dann werden alle Merkmale für alle (angegebenen) Geräte angezeigt. Um nur den Zwischenspeicher zu aktualisieren, ohne Merkmale anzuzeigen, verwenden Sie B<--match-tag none> ohne weitere Optionen.
fr: Pour chaque périphérique indiqué, n'afficher que les indicateurs qui correspondent à I<indicateur>. L'option B<--match-tag> peut être indiquée plusieurs fois. Si aucun indicateur n'est indiqué, tous les jetons sont affichés pour tous les périphériques indiqués. Pour ne faire que rafraîchir le cache sans afficher de jeton, utilisez B<--match-tag\ none> sans aucune autre option.
uk: Для кожного (вказаного) пристрою показати лише мітки, які відповідають I<мітці>. Можна вказати в одній команді декілька параметрів B<--match-tag>. Якщо жодної мітки не вказано, буде показано усіх жетони для усіх (вказаних) пристроїв. Щоб просто освіжити кеш, без показу будь-яких жетонів, скористайтеся B<--match-tag none> без будь-яких інших параметрів.

source: B<-S>, B<--size> I<size>
de: B<-S>, B<--size> I<Größe>
fr: B<-S>, B<--size> I<taille>
uk: B<-S>, B<--size> I<розмір>

source: Override the size of device/file (only useful with B<--probe>).
de: setzt die Größe des Geräts/der Datei außer Kraft (nur mit B<--probe> nützlich).
fr: Remplacer la taille du périphérique ou du fichier (seulement utile avec B<--probe>).
uk: Перевизначити розмір пристрою/файла (корисний лише з B<--probe>).

source: B<-t>, B<--match-token> I<NAME=value>
de: B<-t>, B<--match-token> I<NAME=Wert>
fr: B<-t>, B<--match-token> I<NOM>B<=>I<valeur>
uk: B<-t>, B<--match-token> I<НАЗВА=значення>

source: Search for block devices with tokens named I<NAME> that have the value I<value>, and display any devices which are found. Common values for I<NAME> include B<TYPE>, B<LABEL>, and B<UUID>. If there are no devices specified on the command line, all block devices will be searched; otherwise only the specified devices are searched.
de: sucht nach Blockgeräten mit Merkmalen namens I<NAME>, die den Wert I<Wert> haben und zeigt alle gefundenen Geräte an. Typische Werte für I<NAME> sind u.A. B<TYPE>, B<LABEL> und B<UUID>. Falls keine Geräte auf der Befehlszeile festgelegt sind werden alle Blockgeräte durchsucht; andernfalls werden nur die angegeben Geräte durchsucht.
fr: Rechercher les périphériques bloc qui possèdent des jetons nommés I<NOM> et qui ont pour valeur I<valeur>, puis afficher les périphériques trouvés. Les valeurs usuelles de I<NOM> sont B<TYPE>, B<LABEL> et B<UUID>. S'il n'y a pas de périphérique précisé sur la ligne de commande, tous les périphériques bloc seront analysés ; sinon, seuls les périphériques indiqués par l'utilisateur seront étudiés.
uk: Шукати блокові пристрої із жетонами із назвами I<НАЗВА>, які мають значення I<значення>, і вивести усі значені пристрої. Типовими значеннями для аргументу I<НАЗВА> є B<TYPE>, B<LABEL> і B<UUID>. Якщо у рядку команди не буде вказано жодного пристрою, буде виконано пошук серед усіх блокових пристроїв; якщо ж пристрої буде вказано, пошук відбуватиметься лише на них.

source: B<-u>, B<--usages> I<list>
de: B<-u>, B<--usages> I<Liste>
fr: B<-u>, B<--usages> I<liste>
uk: B<-u>, B<--usages> I<список>

source: Restrict the probing functions to the specified (comma-separated) I<list> of "usage" types. Supported usage types are: filesystem, raid, crypto and other. The list items may be prefixed with "no" to specify the usage types which should be ignored. For example:
de: beschränkt die Untersuchungsfunktion auf die angegebene (Komma-getrennte) I<Liste> der »Benutzungsarten«. Unterstützte Benutzungsarten sind: filesystem, raid, crypto und other. Den Listeneinträgen kann »no« vorangestellt werden, um die zu ignorierenden Benutzungsarten festzulegen. Beispielsweise untersucht
fr: Restreindre les fonctions de détection à la I<liste>, séparée par des virgules, de types d'« utilisation ». Les types d'utilisation gérés sont : B<filesystem> (système de fichiers), B<raid> (RAID), B<crypto> (chiffré) et B<other> (autre). Les types d'utilisation peuvent être préfixés dans la liste par B<no> pour signifier qu'ils doivent être ignorés. Par exemple :
uk: Обмежити функції зондування вказаним I<списком> типів використання. Підтримувані типи використання: filesystem, raid, crypto та other. До пунктів списку можна додавати префікс «no» для визначення типів використання, які має бути проігноровано. Приклад:

source: probes for all filesystem and other (e.g., swap) formats, and
de: auf alle Dateisysteme und andere (z.B. Auslagerungs-)Formate und
fr: détecte tous les formats de systèmes de fichiers et autres (par exemple, les espaces d'échange) et
uk: зондує щодо усіх форматів файлової системи або іншого (наприклад резервної пам'яті) і

source: probes for all supported formats except RAIDs. This option is only useful together with B<--probe>.
de: untersucht auf alle unterstützten Formate außer RAID. Diese Option ist nur im Zusammenspiel mit B<--probe> nützlich.
fr: détecte tous les formats gérés sauf les RAID. Cette option n'est utile qu'avec l'option B<--probe>.
uk: зондує щодо усіх підтримуваних форматів, окрім RAID. Цей параметр є корисним лише разом із B<--probe>.

source: Look up the device that uses this filesystem I<uuid>. For more details see the B<--label> option.
de: schaut nach Geräten, die diese Dateisystem-I<UUID> verwenden. Für weitere Details siehe die Option B<--label>.
fr: Chercher le périphérique qui utilise cet I<UUID> de système de fichiers. Pour plus de précisions, consultez l'option B<--label>.
uk: Шукати на пристрої, на якому використано цей I<uuid> файлової системи. Докладніший опис наведено у розділі щодо параметра B<--label>.

source: Display help text and exit.
fr: Afficher l’aide-mémoire puis quitter.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
fr: Afficher la version puis quitter.
uk: Вивести дані щодо версії і завершити роботу.

source: EXIT STATUS
fr: CODE DE RETOUR
uk: СТАН ВИХОДУ

source: If the specified device or device addressed by specified token (option B<--match-token>) was found and it\(cqs possible to gather any information about the device, an exit status 0 is returned. Note the option B<--match-tag> filters output tags, but it does not affect exit status.
de: Falls das angegebene Gerät oder das durch das festgelegte Merkmal adressierte Gerät (Option B<--match-token>) gefunden wurde und es möglich war, Informationen über das Gerät zu sammeln, wird ein Exit-Status 0 zurückgegeben. Beachten Sie, dass die Option B<--match-tag> die Ausgabemarkierungen filtert, aber nicht den Exit-Status beeinflusst.
fr: Si le périphérique indiqué ou celui adressé par l’indicateur précisé (option B<--match-token>) a été trouvé et qu’il est possible de réunir quelques informations à son propos, un code de retour B<0> est renvoyé. Remarquez que l’option B<--match-tag> filtre les indicateurs de sortie, mais qu’elle n’affecte pas le code de retour.
uk: Якщо буде знайдено вказаний пристрій або пристрій, на який посилається вказаний жетон (параметр B<--match-token>), і можна зібрати якісь відомості щодо пристрою, буде повернуто стан виходу 0. Зауважте, що використання параметра B<--match-tag> фільтрує мітки виведення, але не впливає на стан виходу.

source: If the specified token was not found, or no (specified) devices could be identified, or it is impossible to gather any information about the device identifiers or device content an exit status of 2 is returned.
de: Falls das festgelegte Merkmal nicht gefunden wurde oder kein (festgelegtes) Gerät identifiziert wurde oder es nicht möglich war, Informationen zu den Gerätebezeichnern oder Geräteinhalten zu ermitteln, wird ein Exit-Status 2 zurückgeliefert.
fr: Si le jeton indiqué n'a pas été trouvé, ou si aucun périphérique (indiqué) n'a pu être identifié, ou qu’il est impossible d’obtenir une information sur les identificateurs ou le contenu de périphérique, un code de retour B<2> est renvoyé.
uk: Якщо вказаний жетон не було знайдено, або не вдалося ідентифікувати жоден (вказаний) пристрій, або неможливо зібрати будь-які відомості щодо ідентифікаторів пристрою або вмісту пристрою, буде повернуто стан виходу 2.

source: For usage or other errors, an exit status of 4 is returned.
de: Bei Benutzungs- oder anderen Fehlern wird ein Exit-Status von 4 zurückgeliefert.
fr: Pour les erreurs d'utilisation et autres, un code de retour B<4> est renvoyé.
uk: Для помилок використання та інших помилок буде повернуто стан виходу 4.

source: If an ambivalent probing result was detected by low-level probing mode (B<-p>), an exit status of 8 is returned.
de: Wenn ein unklares Untersuchungsergebnis durch einen systemnahen Untersuchungsmodus erkannt wurde (B<-p>), wird 8 als Exit-Status zurückgeliefert.
fr: Si un résultat de détection bas niveau ambivalent a été détecté (B<-p>), un code de retour B<8> est renvoyé.
uk: Якщо буде виявлено неоднозначний результат зондування у режимі низькорівневого зондування (B<-p>), буде повернуто стан виходу 8.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI
fr: FICHIER DE CONFIGURATION
uk: ФАЙЛ НАЛАШТУВАНЬ

source: The standard location of the I</etc/blkid.conf> config file can be overridden by the environment variable B<BLKID_CONF>. The following options control the libblkid library:
de: Der Standardort der Konfigurationsdatei I</etc/blkid.conf> kann mit der Umgebungsvariablen B<BLKID_CONF> außer Kraft gesetzt werden. Die folgenden Optionen steuern die Bibliothek libblkid:
fr: L'emplacement standard du fichier de configuration I</etc/blkid.conf> peut être remplacé par la variable d'environnement B<BLKID_CONF>. Les options suivantes contrôlent la bibliothèque libblkid.
uk: Стандартне розташування файла налаштувань I</etc/blkid.conf> можна перевизначити змінною середовища B<BLKID_CONF>. вказані нижче параметри керують роботою бібліотеки libblkid:

source: Sends uevent when I</dev/disk/by-{label,uuid,partuuid,partlabel}/> symlink does not match with LABEL, UUID, PARTUUID or PARTLABEL on the device. Default is "yes".
de: Sendet Uevent, wenn der Symlink I</dev/disk/by-{label,uuid,partuuid,partlabel}/> nicht auf LABEL, UUID, PARTUUID oder PARTLABEL auf dem Gerät passt. Vorgabe ist »yes«.
fr: Envoyer « uevent » lorsque le lien symbolique I</dev/disk/by-{label,uuid,partuuid,partlabel}/> ne correspond pas au LABEL, UUID, PARTUUID ou PARTLABEL du périphérique. I<yes> par défaut.
uk: Надсилає uevent, якщо символічне посилання I</dev/disk/by-{label,uuid,partuuid,partlabel}/> не відповідає LABEL, UUID, PARTUUID або PARTLABEL на пристрої. Типовим значенням є "yes".

source: I<CACHE_FILE=E<lt>pathE<gt>>
de: I<CACHE_FILE=E<lt>PfadE<gt>>
fr: B<CACHE_FILE=>I<chemin>
uk: I<CACHE_FILE=E<lt>шляхE<gt>>

source: Overrides the standard location of the cache file. This setting can be overridden by the environment variable B<BLKID_FILE>. Default is I</run/blkid/blkid.tab>, or I</etc/blkid.tab> on systems without a I</run> directory.
de: Setzt den Standardort der Zwischenspeicherdatei außer Kraft. Diese Einstellung kann durch die Umgebungsvariable B<BLKID_FILE> außer Kraft gesetzt werden. Vorgabe ist I</run/blkid/blkid.tab> oder I</etc/blkid.tab> auf Systemen ohne I</run>-Verzeichnis.
fr: Remplacer l'emplacement standard du fichier de cache. Cette option peut être remplacée par la variable d'environnement B<BLKID_FILE>. I</run/blkid/blkid.tab> par défaut ou I</etc/blkid.tab> sur les systèmes sans répertoire I</run>.
uk: Перевизначає стандартне розташування файла кешу. Цей параметр може бути перевизначено змінною середовища B<BLKID_FILE>. Типовим значенням є I</run/blkid/blkid.tab> або I</etc/blkid.tab> у системах без каталогу I</run>.

source: I<EVALUATE=E<lt>methodsE<gt>>
de: I<EVALUATE=E<lt>MethodenE<gt>>
fr: B<EVALUATE=>I<méthodes>
uk: I<EVALUATE=E<lt>способиE<gt>>
