Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkid.8.po
Languages: de, fr, uk

source: Defines LABEL and UUID evaluation method(s). Currently, the libblkid library supports the "udev" and "scan" methods. More than one method may be specified in a comma-separated list. Default is "udev,scan". The "udev" method uses udev I</dev/disk/by-*> symlinks and the "scan" method scans all block devices from the I</proc/partitions> file.
de: Definiert die Evaluationsmethoden LABEL und UUID. Derzeit unterstützt Libblkid die Methoden »udev« und »scan«. In einer Kommata-getrennten Liste dürfen mehr als eine Methode angegeben werden. Vorgabe ist »udev,scan«. Die Methode »udev« verwendet I</dev/disk/by-*>-Symlinks von Udev und die Methode »scan« prüft alle Belockgeräte aus der Datei I</proc/partitions>.
fr: Définir la ou les I<méthodes> d'évaluation des LABEL et UUID. Actuellement, libblkid gère les méthodes « B<udev> » et « B<scan> ». Plus d'une méthode peut être indiquée dans une liste séparée par des virgules. La valeur par défaut est « B<udev,scan> ». La méthode « B<udev> » utilise les liens symboliques I</dev/disk/by-*> d’B<udev> et la méthode « B<scan> » analyse tous les périphériques bloc du fichier I</proc/partitions>.
uk: Визначає способи визначення LABEL і UUID. У поточній версії у бібліотеці libblkid передбачено підтримку способів «udev» і «scan». Можна вказувати декілька значень у форматі списку відокремлених комами значень. Типовим значенням є «udev,scan». У способі «udev» використано символічні посилання I</dev/disk/by-*>, а у способі «scan» — сканування усіх блокових пристроїв з файла I</proc/partitions>.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
fr: ENVIRONNEMENT
uk: СЕРЕДОВИЩЕ

source: Setting I<LIBBLKID_DEBUG=all> enables debug output.
de: Setzen von I<LIBBLKID_DEBUG=all> aktiviert die Fehlersuchausgabe.
fr: La configuration B<LIBBLKID_DEBUG=all> active la sortie de débogage.
uk: Встановлення I<LIBBLKID_DEBUG=all> вмикає виведення діагностичних даних.

source: AUTHORS
de: AUTOREN
fr: AUTEURS
uk: АВТОРИ

source: B<blkid> was written by Andreas Dilger for libblkid and improved by Theodore Ts\(cqo and Karel Zak.
de: B<blkid> wurde von Andreas Dilger für libblkid geschrieben und von Theodore Ts'o und Karel Zak verbessert.
fr: B<blkid> a été écrit par Andreas Dilger pour libblkid et amélioré par Theodore Ts\(cqo et Karel Zak.
uk: B<blkid> було створено Andreas Dilger для libblkid і удосконалено Theodore Ts'o і Karel Zak.

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
fr: SIGNALER DES BOGUES
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
fr: Pour envoyer un rapport de bogue, utilisez le système de gestion des problèmes à l'adresse
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
fr: DISPONIBILITÉ
uk: ДОСТУПНІСТЬ

source: The B<blkid> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<blkid> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
fr: La commande B<blkid> fait partie du paquet util-linux, qui peut être téléchargé de
uk: B<blkid> є частиною пакунка util-linux, який можна отримати з

source: March 2013
de: März 2013
fr: mars 2013
uk: Березень 2013 року

source: B<--label>I< label> | B<--uuid>I< uuid>
de: B<--label>I< Bezeichner> | B<--uuid>I< UUID>
fr: B<--label> I<étiquette> | B<--uuid> I<UUID>
uk: B<blkid> B<--label> I<мітка> | B<--uuid> I<uuid>

source: [B<--no-encoding> B<--garbage-collect --list-one --cache-file> I<file>] [B<--output> I<format>] [B<--match-tag> I<tag>] [B<--match-token> I<NAME=value>] [I<device> ...]
de: [B<--no-encoding> B<--garbage-collect --list-one --cache-file> I<Datei>] [B<--output> I<Format>] [B<--match-tag> I<Markierung>] [B<--match-token> I<NAME=Wert>] [I<Gerät> …]
fr: [B<--no-encoding> B<--garbage-collect --list-one --cache-file> I<fichier>] [B<--output> I<format>] [B<--match-tag> I<indicateur>] [B<--match-token> I<NOM>B<=>I<valeur>] [I<périphérique> ...]
uk: [B<--no-encoding> B<--garbage-collect --list-one --cache-file> I<файл>] [B<--output> I<формат>] [B<--match-tag> I<мітка>] [B<--match-token> I<НАЗВА=значення>] [I<пристрій> ...]

source: B<--probe> [B<--offset> I<offset>] [B<--output> I<format>] [B<--size> I<size>] [B<--match-tag> I<tag>] [B<--match-types> I<list>] [B<--usages> I<list>] [B<--no-part-details>] I<device> ...
de: B<--probe> [B<--offset> I<Versatz>] [B<--output> I<Format>] [B<--size> I<Größe>] [B<--match-tag> I<Markierung>] [B<--match-types> I<Liste>] [B<--usages> I<Liste>] [B<--no-part-details>] I<Gerät> …
fr: B<--probe> [B<--offset> I<position>] [B<--output> I<format>] [B<--size> I<taille>] [B<--match-tag> I<indicateur>] [B<--match-types> I<liste>] [B<--usages> I<liste>] [B<--no-part-details>] I<périphérique> ...
uk: B<--probe> [B<--offset> I<відступ>] [B<--output> I<формат>] [B<--size> I<розмір>] [B<--match-tag> I<мітка>] [B<--match-types> I<список>] [B<--usages> I<список>] [B<--no-part-details>] I<пристрій>...

source: B<--info> [B<--output> I<format>] [B<--match-tag> I<tag>] I<device> ...
de: B<--info> [B<--output> I<Format>] [B<--match-tag> I<Markierung>] I<Gerät> …
fr: B<--info> [B<--output> I<format>] [B<--match-tag> I<indicateur>] I<périphérique> ...
uk: B<--info> [B<--output> I<формат>] [B<--match-tag> I<мітка>] I<пристрій> ...

source: The B<blkid> program is the command-line interface to working with the B<libblkid>(3) library. It can determine the type of content (e.g., filesystem or swap) that a block device holds, and also the attributes (tokens, NAME=value pairs) from the content metadata (e.g., LABEL or UUID fields).
de: Das Programm B<blkid> ist eine Befehlszeilenschnittstelle zur Arbeit mit der Bibliothek B<libblkid>(3). Es kann die Art des Inhalts (z.B. Dateisystem oder Auslagerung) bestimmen, den ein Blockgerät enthält und auch die Attribute (Merkmale, NAME=Wert-Paare) aus den Metadaten des Inhalts (z.B. die Felder LABEL oder UUID).
fr: Le programme B<blkid> est une interface en ligne de commande pour la bibliothèque B<libblkid>(3). Il peut déterminer le type de contenu (par exemple, un système de fichiers ou une partition d'échange) associé à un périphérique bloc et aussi les attributs (sous la forme de jetons I<NOM>B<=>I<valeur>) des métadonnées (par exemple, l'étiquette B<LABEL> ou l'B<UUID>).
uk: Програма B<blkid> є інтерфейсом командного рядка для роботи з бібліотекою B<libblkid>(3). Вона може визначати тип вмісту (наприклад, файлова система чи резервна пам'ять), який зберігається на блоковому пристрої, а також атрибути (жетони, пари НАЗВА=значення) на основі метаданих вмісту (наприклад полів LABEL та UUID).

source: B<It is recommended to use> B<lsblk>(8) B<command to get information about block devices, or lsblk --fs to get an overview of filesystems, or> B<findmnt>(8) B<to search in already mounted filesystems.>
de: B<Es wird empfohlen, den Befehl> B<lsblk>(8) B<oder »lsblk --fs« zu verwenden, um einen Überblick über Dateisysteme oder> B<findmnt>(8) B<, um in einem bereits eingehängten Dateisystem zu suchen, zu verwenden.>
fr: B<Il est recommandé d’utiliser la commande lsblk(8) pour obtenir des informations à propos des périphériques bloc, ou lsblk --fs pour obtenir une vue d’ensemble des systèmes de fichiers, ou findmnt(8) pour effectuer une recherche dans les systèmes de fichiers déjà montés.>
uk: B<Рекомендуємо користуватися командою> B<lsblk>(8) B<для отримання відомостей щодо блокових пристроїв або lsblk --fs для отримання огляду файлових систем або> B<findmnt>(8) B<для пошуку вже змонтованих файлових систем.>

source: B<lsblk>(8) provides more information, better control on output formatting, easy to use in scripts and it does not require root permissions to get actual information. B<blkid> reads information directly from devices and for non-root users it returns cached unverified information. B<blkid> is mostly designed for system services and to test libblkid functionality.
de: B<lsblk>(8) stellt mehr Informationen, bessere Steuerung der Ausgabeformatierung, eine einfachere Verwendung in Skripten bereit und benötigt keine Root-Rechte, um die eigentlichen Informationen zu erhalten. B<blkid> liest Informationen direkt aus Geräten und für von Root verschiedene Benutzer liefert es zwischengespeicherte, nicht geprüfte Informationen zurück. B<blkid> ist hauptsächlich für Systemdienste und zum Testen der Funktionalität von libblkid gedacht.
fr: B<lsblk>(8) fournit plus d’informations, un meilleur contrôle sur le formatage de la sortie, une utilisation plus aisée dans les scripts et ne nécessite pas les permissions de superutilisateur pour obtenir les informations concrètes. B<blkid> lit les informations directement des périphériques, et pour les utilisateurs normaux il renvoie les informations mises en cache et non vérifiées. B<blkid> est principalement conçu pour les services de système et pour tester les fonctionnalités de libblkid.
uk: B<lsblk>(8) надає більше інформації, кращі можливості керування форматуванням виведення, прості у користуванні скрипти і не потребує прав доступу root для отримання самих відомостей. B<blkid> читає відомості безпосередньо з пристроїв, а для користувачів, які не є користувачем root, повертає кешовані неперевірені відомості. B<blkid>, здебільшого, призначено для системних служб і перевірки функціональних можливостей B<libblkid>(3).

source: When I<device> is specified, tokens from only this device are displayed. It is possible to specify multiple I<device> arguments on the command line. If none is given, all partitions or unpartitioned devices which appear in I</proc/partitions> are shown, if they are recognized.
de: Falls I<Gerät> angegeben ist, werden nur die Merkmale dieses Geräts angezeigt. Es ist möglich, auf der Befehlszeile mehrere Argumente I<Gerät> anzugeben. Falls keines angegeben ist, werden alle partitionierten oder unpartitionierten Geräte, die in I</proc/partitions> auftauchen, angezeigt, falls sie erkannt werden.
fr: Quand un I<périphérique> est indiqué, seuls les jetons pour ce I<périphérique> sont affichés. Plusieurs arguments I<périphérique> peuvent être indiqués sur la ligne de commande. Si aucun n'est donné, tous les partitions et périphériques non partitionnés apparaissant dans I</proc/partitions> seront affichés, s'ils sont reconnus.
uk: Якщо вказано I<пристрій>, буде показано лише жетони з цього пристрою. У рядку команди можна вказати декілька аргументів I<пристрій>. Якщо не вказано жодного аргументу, буде виведено дані для усіх розділів або нерозподілених пристроїв у I</proc/partitions>, якщо їх було розпізнано.

source: For security reasons B<blkid> silently ignores all devices where the probing result is ambivalent (multiple colliding filesystems are detected). The low-level probing mode (B<-p>) provides more information and extra exit status in this case. It's recommended to use B<wipefs>(8) to get a detailed overview and to erase obsolete stuff (magic strings) from the device.
de: Aus Sicherheitsgründen ignoriert B<blkid> ohne Rückmeldungen alle Geräte, bei denen das Untersuchungsergebnis nicht eindeutig ist (mehrere, kollidierende Dateisysteme wurden erkannt). Der systemnahe Untersuchungsmodus (B<-p>) stellt in diesem Fall weitere Informationen und zusätzliche Exit-Status bereit. Es wird empfohlen, B<wipefs>(8) zu verwenden, um einen detaillierteren Überblick zu erhalten und veraltetes Zeug (magische Zeichenketten) von dem Gerät zu löschen.
fr: Pour des raisons de sécurité, B<blkid> ignore silencieusement tous les périphériques quand le résultat des détections est ambivalent (plusieurs périphériques en conflit sont détectés). Le mode bas niveau (B<-p>) fournit plus d’informations et un code de retour supplémentaire. Il est recommandé d’utiliser B<wipefs>(8) pour une vue d’ensemble détaillée et pour supprimer toutes les choses obsolètes (chaînes magiques) sur le périphérique.
uk: З міркувань безпеки B<blkid> без повідомлення ігнорує усі пристрої, де результат зондування є неоднозначним (виявлено декілька конфліктних файлових систем). У режимі низькорівневого зондування (B<-p>) програма надає більше інформації та додатковий стан виходу. Рекомендуємо користуватися B<wipefs>(8) для отримання докладного огляду або витирання застарілих даних (контрольних рядків) з пристрою.

source: Read from I<cachefile> instead of reading from the default cache file (see the CONFIGURATION FILE section for more details). If you want to start with a clean cache (i.e., don't report devices previously scanned but not necessarily available at this time), specify I</dev/null>.
de: liest aus I<Zwischenspeicherdatei> statt aus der Standardzwischenspeicherdatei (siehe den Abschnitt KONFIGURATIONSDATEI für weitere Details). Falls Sie mit einem sauberen Zwischenspeicher beginnen möchten (d.h. keine Geräte berichtet werden sollen, die früher eingelesen wurden aber nicht notwendigerweise derzeit verfügbar sind), geben Sie I</dev/null> an.
fr: Lire dans le I<fichier_cache> plutôt que dans le fichier de cache par défaut (consultez la section B<FICHIER DE CONFIGURATION> pour plus de précisions). Si vous souhaitez utiliser un cache vide (c'est-à-dire ne pas afficher les périphériques examinés auparavant, mais qui ne seraient plus disponibles), utilisez I</dev/null>.
uk: Читати дані з файла I<файл-кешу>, а не з типового файла кешу (див. розділ B<ФАЙЛ НАЛАШТУВАНЬ>, щоб дізнатися більше). Якщо ви хочете розпочати з порожнього кешу (тобто не бачити даних раніше сканованих, але не обов'язково доступних на поточний момент пристроїв), вкажіть I</dev/null>.

source: Don't encode non-printing characters. The non-printing characters are encoded by ^ and M- notation by default. Note that the B<--output udev> output format uses a different encoding which cannot be disabled.
de: kodiert nicht druckbare Zeichen nicht. Standardmäßig werden die nicht druckbaren Zeichen durch die Notation ^ und M- kodiert. Beachten Sie, dass das Ausgabeformat B<--output udev> eine andere Kodierung verwendet, die nicht deaktiviert werden kann.
fr: Ne pas encoder les caractères non imprimables. Les caractères non imprimables sont encodés par les notations B<^> et B<M-> par défaut. Remarquez que le format de sortie B<--output\ udev> utilise un encodage différent qui ne peut pas être désactivé.
uk: Не кодувати непридатні до друку символи. Типово, непридатні до друку символи буде закодовано з використанням позначень ^ і M-. Зауважте, що формат виведення B<--output udev> використовує різне кодування, яке не можна вимкнути.

source: Don't print information (PART_ENTRY_* tags) from partition table in low-level probing mode.
de: gibt im systemnahen Untersuchungsmodus keine Informationen (PART_ENTRY_*-Markierungen) aus der Partitionstabelle aus.
fr: Ne pas afficher d’information (indicateurs B<PART_ENTRY_>I<*>) de la table de partitions dans le mode de détection bas niveau.
uk: Не виводити відомості (мітки PART_ENTRY_*) з таблиці розділів у режимі низькорівневого зондування.

source: Display a usage message and exit.
de: zeigt einen Benutzungshinweis an und beendet das Programm.
fr: Afficher l'aide sur l'utilisation, puis quitter.
uk: Вивести текст довідки і завершити роботу.

source: Display information about I/O Limits (aka I/O topology). The 'export' output format is automatically enabled. This option can be used together with the B<--probe> option.
de: zeigt Informationen über E/A-Begrenzungen an (d.h. die E/A-Topologie). Das Ausgabeformat »export« wird automatisch aktiviert. Diese Option kann zusammen mit der Option B<--probe> verwandt werden.
fr: Afficher les renseignements de limites (topologie) d'E/S. Le format de sortie B<export> est automatiquement activé. Cette option peut être utilisée avec l'option B<-probe>.
uk: Вивести дані щодо обмеження введення-виведення (тобто топології введення-виведення). Автоматично буде увімкнено формат виведення «export». Цей параметр може бути використано разом із параметром B<--probe>.

source: Look up only one device that matches the search parameter specified with the B<--match-token> option. If there are multiple devices that match the specified search parameter, then the device with the highest priority is returned, and/or the first device found at a given priority (but see below note about udev). Device types in order of decreasing priority are: Device Mapper, EVMS, LVM, MD, and finally regular block devices. If this option is not specified, B<blkid> will print all of the devices that match the search parameter.
de: sucht nur nach Geräten, die auf das mit der Option B<--match-token> angegebene Suchmuster passen. Falls mehrere Geräte auf den Suchparameter passen, wird das Gerät mit der höchsten Priorität zurückgeliefert oder das erste Gerät mit der angegebenen Priorität (beachten Sie jedoch die Anmerkungen zu Udev unten). Gerätetypen, in Reihenfolge absteigender Priorität: Device Mapper, EVMS, LVM, MD und schließlich reguläre Blockgeräte. Falls diese Option nicht angegeben ist, wird B<blkid> alle Geräte, die auf das angegebene Suchmuster passen, ausgeben.
fr: Ne rechercher qu’un périphérique correspondant au paramètre demandé indiqué avec l'option B<-match-token>. Si plusieurs périphériques correspondent, le périphérique de priorité la plus haute sera affiché ou le premier périphérique avec la priorité voulue (mais consultez ci-dessous la remarque sur udev). Voici les types de périphériques par priorité décroissante : Device Mapper, EVMS, LVM, MD, puis les périphériques bloc classiques. Si cette option n'est pas utilisée, B<blkid> affichera tous les périphériques qui correspondent à la recherche.
uk: Шукати лише один пристрій, який відповідає параметру пошуку, вказаному за допомогою параметра B<--match-token>. Якщо вказаному параметру пошуку відповідають декілька пристроїв, буде повернуто пристрій із найвищою пріоритетністю, і/або перший знайдений пристрій із заданою пріоритетністю (але див. зауваження щодо udev нижче). Типами пристроїв за спаданням пріоритетності є такі: Device Mapper, EVMS, LVM, MD і, нарешті. звичайні блокові пристрої. Якщо цей параметр не вказано, B<blkid> виведе усі пристрої, які відповідають параметру пошуку.

source: This option forces B<blkid> to use udev when used for LABEL or UUID tokens in B<--match-token>. The goal is to provide output consistent with other utils (like mount, etc.) on systems where the same tag is used for multiple devices.
de: Diese Option zwingt B<blkid>, Udev zu nutzen, wenn es in B<--match-token> für BEZEICHNER- oder UUID-Merkmale verwendet wird. Die Absicht ist, dass die Ausgabe auf Systemen, welche die gleiche Markierung für mehrere Geräte verwenden, konsistent zu den Ausgaben anderer Dienstprogramme (wie beispielsweise B<mount> usw.) ist.
fr: Cette option oblige B<blkid> à utiliser les jetons LABEL ou UUID dans B<--match-token>. Le but est de fournir une sortie cohérente avec celle d’autres outils (tel mount, etc.) sur les systèmes où le même indicateur est utilisé pour plusieurs périphériques.
uk: Використання цього параметра наказує B<blkid> використовувати udev, якщо його використано для жетонів LABEL і UUID у B<--match-token>. Метою є надання виведених даних, які сумісні із іншими допоміжними програмами (подібними до B<mount>(8) тощо) у системах, де ту саму мітку використано для декількох пристроїв.

source: Look up the device that uses this filesystem I<label>; this is equal to B<--list-one --output device --match-token LABEL=>I<label>. This lookup method is able to reliably use /dev/disk/by-label udev symlinks (dependent on a setting in /etc/blkid.conf). Avoid using the symlinks directly; it is not reliable to use the symlinks without verification. The B<--label> option works on systems with and without udev.
de: schlägt das Gerät nach, das diesen Dateisystem-I<Bezeichner> verwendet. Dies ist mit B<--list-one --output device --match-token LABEL=>I<Bezeichner> identisch. Die Nachschlagemethode kann /dev/disk/by-label-udev-Symlinks zuverlässig verwenden (abhängig von einer Einstellung in /etc/blkid.conf). Vermeiden Sie die direkte Verwendung der Symlinks. Es ist nicht zuverlässig, die Symlinks ohne Prüfung zu verwenden. Die Option B<--label> funktioniert auf Systemen mit und ohne Udev.
fr: Rechercher le périphérique qui utilise cette I<étiquette> de système de fichiers ; c’est équivalent à : B<-l\ -o device\ -t\ LABEL=>I<étiquette>. Cette méthode de recherche est capable d'utiliser de manière fiable les liens symboliques udev du type I</dev/disk/by-label> (suivant une configuration définie dans I</etc/blkid.conf>). Évitez d'utiliser directement les liens symboliques, car leur utilisation n’est pas sûre sans vérification. L'option B<-label> fonctionne sur des systèmes avec ou sans udev.
uk: Шукати пристрій, який використовує цю I<мітку> файлової системи; цей параметр еквівалентний до набору B<--list-one --output device --match-token LABEL=>I<_мітка_> Цей спосіб пошуку може надійно використовувати символічні посилання udev /dev/disk/by-label (залежно від параметра в I</etc/blkid.conf>). Намагайтеся не використовувати символічні посилання безпосередньо; використання символічних посилань без перевірки не є надійним. Параметр B<--label> працює як у системах із udev, так і без нього.

source: Unfortunately, the original B<blkid>(8) from e2fsprogs uses the B<-L> option as a synonym for B<-o list>. For better portability, use B<-l -o device -t LABEL=>I<label> and B<-o list> in your scripts rather than the B<-L> option.
de: Unglücklicherweise verwendet das ursprüngliche B<blkid>(8) aus den E2fsprogs die Option B<-L> als Synonym für B<-o list>. Zur besseren Portabilität verwenden Sie B<-l -o device -t LABEL=>I<Bezeichner> und B<-o list> statt der Option B<-L> in Ihren Skripten.
fr: Malheureusement, le B<blkid>(8) d'origine d'e2fsprogs utilise l'option B<-L> comme synonyme de B<-o list>. Pour assurer la portabilité, l'utilisation de B<-l\ -o\ device\ -t\ LABEL=>I<étiquette> et B<-o\ list> est à préférer à l'option B<-L> dans les scripts.
uk: На жаль, початкова версія B<blkid>(8) з e2fsprogs використовує параметр B<-L> як синонім B<-o list>. Для забезпечення ширшої застосовності використовуйте у своїх скриптах B<-l -o device -t LABEL=>I<мітка> та B<-o list> замість параметра B<-L>.

source: Restrict the probing functions to the specified (comma-separated) I<list> of superblock types (names). The list items may be prefixed with "no" to specify the types which should be ignored. For example:
de: beschränkt die Prüffunktionen auf die (durch Kommata getrennten) angegebene I<Liste> der Superblocktypen (Namen). Den Listeneinträgen kann »no« vorangestellt werden, um die Typen festzulegen, die ignoriert werden sollen. Beispielsweise prüft
fr: Restreindre les fonctions de détection à la I<liste>, séparée par des virgules, de types (noms) de superblocs. Les types peuvent être préfixés dans la liste par B<no> pour signifier qu'ils doivent être ignorés. Par exemple :
uk: Обмежити функції зондування вказаним I<списком> типів (назв) суперблоків (відокремлених комами). До пунктів списку можна додавати префікс «no» для визначення типів, які має бути проігноровано. Приклад:

source: probes for all supported formats except minix filesystems. This option is only useful together with B<--probe>.
de: prüft auf alle unterstützten Formate außer Minix-Dateisysteme. Diese Option ist nur mit B<--probe> zusammen sinnvoll.
fr: détecte tous les formats gérés sauf les systèmes de fichiers MINIX. Cette option n'est utile qu'avec l'option B<--probe>.
uk: зондує щодо усіх підтримуваних форматів, окрім файлових систем minix. Цей параметр є корисним лише разом із B<--probe>.
