Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkid.8.po
Languages: de, fr, uk

source: Use the specified output format. Note that the order of variables and devices is not fixed. See also option B<-s>. The I<format> parameter may be:
de: verwendet das angegebene Ausgabeformat. Beachten Sie, dass die Reihenfolge der Variablen und Geräte nicht festgelegt ist. Siehe auch die Option B<-s>. Folgende Werte kann der Parameter I<Format> annehmen:
fr: Utiliser le format de sortie indiqué. Remarquez que l’ordre des variables et des périphériques n’est pas fixé. Consultez également l’option B<-s>. Le paramètre I<format> peut prendre une des valeurs suivantes :
uk: Скористатися вказаним форматом виведення. Зауважте, що порядок змінних і пристроїв не є фіксованим. Див. також параметр B<-s>. Значенням параметра I<формат> може бути таким:

source: This output format is B<DEPRECATED> in favour of the B<lsblk>(8) command.
de: Dieses Ausgabeformat ist zugunsten des Befehls B<lsblk>(8) B<VERALTET>.
fr: Ce format d’affichage est B<obsolète> et remplacé par la commande B<lsblk>(8).
uk: Цей формат виведення вважається B<ЗАСТАРІЛИМ>, його замінила команда B<lsblk>(8).

source: print key="value" pairs for easy import into the udev environment; the keys are prefixed by ID_FS_ or ID_PART_ prefixes. The value may be modified to be safe for udev environment; allowed is plain ASCII, hex-escaping and valid UTF-8, everything else (including whitespaces) is replaced with '_'. The keys with _ENC postfix use hex-escaping for unsafe chars.
de: gibt key="Wert"-Paare für den leichten Import in die Udev-Umgebung aus; den Schlüsseln wird ID_FS_ oder ID_PART_ vorangestellt. Der Wert kann angepasst werden, um sicher für die Udev-Umgebung zu sein. Erlaubt ist reines ASCII, hex-maskiertes und gültiges UTF-8; alles sonst (einschließlich Leerzeichen) wird durch »_« ersetzt. Die Schlüssel mit der Endung _ENC verwenden hex-Maskierung für unsichere Zeichen.
fr: Afficher les paires I<clé>B<=>I<valeur> pour une importation aisée dans l’environnement udev. Les clés sont préfixées avec B<ID_FS_> ou B<ID_PART_>. La valeur peut être modifiée pour être sûre dans l’environnement udev. Sont permises l’ASCII pur, la protection par valeur hexadécimale et l’UTF-8 valable. Toutes les autres valeurs (y compris les espaces blancs) sont remplacées par « _ ». Les clés avec le suffixe B<_ENC> utilisent la protection hexadécimale pour les caractères non sûrs.
uk: вивести пари ключ="значення" для полегшення імпортування до середовища udev; до ключів буде додано префікс IDI<FS_ або ID_PART>. Значення може бути змінено для убезпечення середовища udev; можна використовувати звичайні символи ASCII, екрановані шістнадцяткові послідовності та чинні символи UTF-8. Усі інші символи (зокрема пробіли) буде замінено символом «{underscore}». У ключах із постфіксом _ENC для небезпечних символів буде використано шістнадцяткове екранування.

source: Probe at the given I<offset> (only useful with B<--probe>). This option can be used together with the B<--info> option.
de: untersucht an dem übergebenen I<Versatz> (nur nützlich mit B<--probe>). Diese Option kann mit der Option B<--info> zusammen verwandt werden.
fr: Détecter à la I<position> donnée (seulement utile avec B<--probe>). Cette option peut être utilisée avec l'option B<--info>.
uk: Зондувати за вказаним I<відступом> (корисний лише з B<--probe>). Цей параметр може бути використано разом із параметром B<--info>.

source: For each (specified) device, show only the tags that match I<tag>. It is possible to specify multiple B<--match-tag> options. If no tag is specified, then all tokens are shown for all (specified) devices. In order to just refresh the cache without showing any tokens, use B<--match-tag none> with no other options.
de: zeigt für jedes (angegebene) Gerät nur die Markierungen, die auf I<Markierung> passen, an. Es ist möglich, mehrere Optionen B<--match-tag> anzugeben. Falls keine Markierung angegeben ist, dann werden alle Merkmale für alle (angegebenen) Geräte angezeigt. Um nur den Zwischenspeicher zu aktualisieren, ohne Merkmale anzuzeigen, verwenden Sie B<--match-tag none> ohne weitere Optionen.
fr: Pour chaque périphérique indiqué, n'afficher que les indicateurs qui correspondent à I<indicateur>. L'option B<--match-tag> peut être indiquée plusieurs fois. Si aucun indicateur n'est indiqué, tous les jetons sont affichés pour tous les périphériques indiqués. Pour ne faire que rafraîchir le cache sans afficher de jeton, utilisez B<--match-tag\ none> sans aucune autre option.
uk: Для кожного (вказаного) пристрою показати лише мітки, які відповідають I<мітці>. Можна вказати в одній команді декілька параметрів B<--match-tag>. Якщо жодної мітки не вказано, буде показано усіх жетони для усіх (вказаних) пристроїв. Щоб просто освіжити кеш, без показу будь-яких жетонів, скористайтеся B<--match-tag none> без будь-яких інших параметрів.

source: Search for block devices with tokens named I<NAME> that have the value I<value>, and display any devices which are found. Common values for I<NAME> include B<TYPE>, B<LABEL>, and B<UUID>. If there are no devices specified on the command line, all block devices will be searched; otherwise only the specified devices are searched.
de: sucht nach Blockgeräten mit Merkmalen namens I<NAME>, die den Wert I<Wert> haben und zeigt alle gefundenen Geräte an. Typische Werte für I<NAME> sind u.A. B<TYPE>, B<LABEL> und B<UUID>. Falls keine Geräte auf der Befehlszeile festgelegt sind werden alle Blockgeräte durchsucht; andernfalls werden nur die angegeben Geräte durchsucht.
fr: Rechercher les périphériques bloc qui possèdent des jetons nommés I<NOM> et qui ont pour valeur I<valeur>, puis afficher les périphériques trouvés. Les valeurs usuelles de I<NOM> sont B<TYPE>, B<LABEL> et B<UUID>. S'il n'y a pas de périphérique précisé sur la ligne de commande, tous les périphériques bloc seront analysés ; sinon, seuls les périphériques indiqués par l'utilisateur seront étudiés.
uk: Шукати блокові пристрої із жетонами із назвами I<НАЗВА>, які мають значення I<значення>, і вивести усі значені пристрої. Типовими значеннями для аргументу I<НАЗВА> є B<TYPE>, B<LABEL> і B<UUID>. Якщо у рядку команди не буде вказано жодного пристрою, буде виконано пошук серед усіх блокових пристроїв; якщо ж пристрої буде вказано, пошук відбуватиметься лише на них.

source: Restrict the probing functions to the specified (comma-separated) I<list> of "usage" types. Supported usage types are: filesystem, raid, crypto and other. The list items may be prefixed with "no" to specify the usage types which should be ignored. For example:
de: beschränkt die Untersuchungsfunktion auf die angegebene (Komma-getrennte) I<Liste> der »Benutzungsarten«. Unterstützte Benutzungsarten sind: filesystem, raid, crypto und other. Den Listeneinträgen kann »no« vorangestellt werden, um die zu ignorierenden Benutzungsarten festzulegen. Beispielsweise untersucht
fr: Restreindre les fonctions de détection à la I<liste>, séparée par des virgules, de types d'« utilisation ». Les types d'utilisation gérés sont : B<filesystem> (système de fichiers), B<raid> (RAID), B<crypto> (chiffré) et B<other> (autre). Les types d'utilisation peuvent être préfixés dans la liste par B<no> pour signifier qu'ils doivent être ignorés. Par exemple :
uk: Обмежити функції зондування вказаним I<списком> типів використання. Підтримувані типи використання: filesystem, raid, crypto та other. До пунктів списку можна додавати префікс «no» для визначення типів використання, які має бути проігноровано. Приклад:

source: probes for all supported formats except RAIDs. This option is only useful together with B<--probe>.
de: untersucht auf alle unterstützten Formate außer RAID. Diese Option ist nur im Zusammenspiel mit B<--probe> nützlich.
fr: détecte tous les formats gérés sauf les RAID. Cette option n'est utile qu'avec l'option B<--probe>.
uk: зондує щодо усіх підтримуваних форматів, окрім RAID. Цей параметр є корисним лише разом із B<--probe>.

source: Look up the device that uses this filesystem I<uuid>. For more details see the B<--label> option.
de: schaut nach Geräten, die diese Dateisystem-I<UUID> verwenden. Für weitere Details siehe die Option B<--label>.
fr: Chercher le périphérique qui utilise cet I<UUID> de système de fichiers. Pour plus de précisions, consultez l'option B<--label>.
uk: Шукати на пристрої, на якому використано цей I<uuid> файлової системи. Докладніший опис наведено у розділі щодо параметра B<--label>.

source: Display version number and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
fr: Afficher le numéro de version, puis quitter.
uk: Показати дані щодо версії і завершити роботу.

source: If the specified device or device addressed by specified token (option B<--match-token>) was found and it's possible to gather any information about the device, an exit status 0 is returned. Note the option B<--match-tag> filters output tags, but it does not affect exit status.
de: Falls das angegebene Gerät oder das durch das festgelegte Merkmal adressierte Gerät (Option B<--match-token>) gefunden wurde und es möglich war, Informationen über das Gerät zu sammeln, wird ein Exit-Status 0 zurückgegeben. Beachten Sie, dass die Option B<--match-tag> die Ausgabemarkierungen filtert, aber nicht den Exit-Status beeinflusst.
fr: Si le périphérique indiqué ou celui adressé par l’indicateur précisé (option B<--match-token>) a été trouvé et qu’il est possible de réunir quelques informations à son propos, un code de retour B<0> est renvoyé. Remarquez que l’option B<--match-tag> filtre les indicateurs de sortie, mais qu’elle n’affecte pas le code de retour.
uk: Якщо буде знайдено вказаний пристрій або пристрій, на який посилається вказаний жетон (параметр B<--match-token>), і можна зібрати якісь відомості щодо пристрою, буде повернуто стан виходу 0. Зауважте, що використання параметра B<--match-tag> фільтрує мітки виведення, але не впливає на стан виходу.

source: The standard location of the I</etc/blkid.conf> config file can be overridden by the environment variable BLKID_CONF. The following options control the libblkid library:
de: Der Standardort der Konfigurationsdatei I</etc/blkid.conf> kann mit der Umgebungsvariablen BLKID_CONF außer Kraft gesetzt werden. Die folgenden Optionen steuern die Bibliothek libblkid:
fr: L'emplacement standard du fichier de configuration I</etc/blkid.conf> peut être remplacé par la variable d'environnement B<BLKID_CONF>. Les options suivantes contrôlent la bibliothèque libblkid.
uk: Стандартне розташування файла налаштувань I</etc/blkid.conf> можна перевизначити змінною середовища B<BLKID_CONF>. вказані нижче параметри керують роботою бібліотеки libblkid:

source: Sends uevent when I</dev/disk/by-{label,uuid,partuuid,partlabel}/> symlink does not match with LABEL, UUID, PARTUUID or PARTLABEL on the device. Default is "yes".
de: Sende Uevent wenn der Symlink I</dev/disk/by-{label,uuid,partuuid,partlabel}/> nicht auf LABEL, UUID, PARTUUID oder PARTLABEL auf dem Gerät passt. Vorgabe ist »yes«.
fr: Envoyer « uevent » lorsque le lien symbolique I</dev/disk/by-{label,uuid,partuuid,partlabel}/> ne correspond pas au LABEL, UUID, PARTUUID ou PARTLABEL du périphérique. I<yes> par défaut.
uk: Надсилає uevent, якщо символічне посилання I</dev/disk/by-{label,uuid,partuuid,partlabel}/> не відповідає LABEL, UUID, PARTUUID або PARTLABEL на пристрої. Типовим значенням є "yes".

source: Overrides the standard location of the cache file. This setting can be overridden by the environment variable BLKID_FILE. Default is I</run/blkid/blkid.tab>, or I</etc/blkid.tab> on systems without a /run directory.
de: Setzt den Standardort der Zwischenspeicherdatei außer Kraft. Diese Einstellung kann durch die Umgebungsvariable BLKID_FILE außer Kraft gesetzt werden. Vorgabe ist I</run/blkid/blkid.tab> oder I</etc/blkid.tab> auf Systemen ohne /run-Verzeichnis.
fr: Remplacer l'emplacement standard du fichier de cache. Cette option peut être remplacée par la variable d'environnement B<BLKID_FILE>. I</run/blkid/blkid.tab> par défaut ou I</etc/blkid.tab> sur les systèmes sans répertoire I</run>.
uk: Перевизначає стандартне розташування файла кешу Цей параметр може бути перевизначено змінною середовища BLKID_FILE. Типовим значенням є I</run/blkid/blkid.tab> або I</etc/blkid.tab> у системах без каталогу /run.

source: Defines LABEL and UUID evaluation method(s). Currently, the libblkid library supports the "udev" and "scan" methods. More than one method may be specified in a comma-separated list. Default is "udev,scan". The "udev" method uses udev I</dev/disk/by-*> symlinks and the "scan" method scans all block devices from the I</proc/partitions> file.
de: Definiert die Evaluationsmethoden LABEL und UUID. Derzeit unterstützt Libblkid die Methoden »udev« und »scan«. In einer Kommata-getrennten Liste dürfen mehr als eine Methode angegeben werden. Vorgabe ist »udev,scan«. Die Methode »udev« verwendet I</dev/disk/by-*>-Symlinks von Udev und die Methode »scan« prüft alle Belockgeräte aus der Datei I</proc/partitions>.
fr: Définir la ou les I<méthodes> d'évaluation des LABEL et UUID. Actuellement, libblkid gère les méthodes « B<udev> » et « B<scan> ». Plus d'une méthode peut être indiquée dans une liste séparée par des virgules. La valeur par défaut est « B<udev,scan> ». La méthode « B<udev> » utilise les liens symboliques I</dev/disk/by-*> d’B<udev> et la méthode « B<scan> » analyse tous les périphériques bloc du fichier I</proc/partitions>.
uk: Визначає способи визначення LABEL і UUID. У поточній версії у бібліотеці libblkid передбачено підтримку способів «udev» і «scan». Можна вказувати декілька значень у форматі списку відокремлених комами значень. Типовим значенням є «udev,scan». У способі «udev» використано символічні посилання I</dev/disk/by-*>, а у способі «scan» — сканування усіх блокових пристроїв з файла I</proc/partitions>.

source: Setting LIBBLKID_DEBUG=all enables debug output.
de: Setzen von LIBBLKID_DEBUG=all aktiviert die Fehlersuchausgabe.
fr: La configuration B<LIBBLKID_DEBUG=all> active la sortie de débogage.
uk: Встановлення I<LIBBLKID_DEBUG=all> вмикає виведення діагностичних даних.

source: B<blkid> was written by Andreas Dilger for libblkid and improved by Theodore Ts'o and Karel Zak.
de: B<blkid> wurde von Andreas Dilger für libblkid geschrieben und von Theodore Ts'o und Karel Zak verbessert.
fr: B<blkid> a été écrit par Andreas Dilger pour libblkid et amélioré par Theodore Ts'o et Karel Zak.
uk: B<blkid> було створено Andreas Dilger для libblkid і удосконалено Theodore Ts'o і Karel Zak.

source: The blkid command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl blkid ist Teil des Pakets util-linux und kann von https://www.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
fr: La commande B<blkid> fait partie du paquet util-linux, elle est disponible sur E<lt>I<https://www.kernel.org/pub/linux/utils/util-linux>E<gt>.
uk: Програма blkid є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Read from I<cachefile> instead of reading from the default cache file (see the CONFIGURATION FILE section for more details). If you want to start with a clean cache (i.e., don\(cqt report devices previously scanned but not necessarily available at this time), specify I</dev/null>.
de: liest aus I<Zwischenspeicherdatei> statt aus der Standardzwischenspeicherdatei (siehe den Abschnitt KONFIGURATIONSDATEI für weitere Details). Falls Sie mit einem sauberen Zwischenspeicher beginnen möchten (d.h. keine Geräte berichtet werden sollen, die früher eingelesen wurden aber nicht notwendigerweise derzeit verfügbar sind), geben Sie I</dev/null> an.
fr: Lire dans le I<fichier_cache> plutôt que dans le fichier de cache par défaut (consultez la section B<FICHIER DE CONFIGURATION> pour plus de précisions). Si vous souhaitez utiliser un cache vide (c'est-à-dire ne pas afficher les périphériques examinés auparavant, mais qui ne seraient plus disponibles), utilisez I</dev/null>.
uk: Читати дані з файла I<файл-кешу>, а не з типового файла кешу (див. розділ B<ФАЙЛ НАЛАШТУВАНЬ>, щоб дізнатися більше). Якщо ви хочете розпочати з порожнього кешу (тобто не бачити даних раніше сканованих, але не обов'язково доступних на поточний момент пристроїв), вкажіть I</dev/null>.

source: Set probing hint. The hints are optional way how to force probing functions to check for example another location. The currently supported is "session_offset=I<number>" to set session offset on multi-session UDF.
de: setzt einen Prüfvorschlag. Die Vorschläge sind eine optional Möglichkeit, die Prüffunktionen dazu zu zwingen, beispielsweise einen anderen Ort zu überprüfen. Derzeit wird »session_offset=I<Nummer>« unterstützt, um den Sitzungsversatz bei UDF mit mehreren Sitzungen zu setzen.
fr: Régler les indications de détection. Les indications sont une manière optionnelle pour obliger les fonctions de détection à vérifier par exemple un autre emplacement. L'indication actuellement prise en charge est « session_offset=I<nombre> » pour définir la position d'une session d'un système de fichiers UDF multi-session.
uk: Встановити підказку зондування. Підказки є необов'язковим способом наказати функціями зондування перевіряти, наприклад, інше місце. У поточній версії передбачено підтримку «session_offset=I<число>» для встановлення зсув сеансу для багатосеансових UDF.

source: The standard location of the I</etc/blkid.conf> config file can be overridden by the environment variable BLKID_CONF. The following options control the libblkid library:
de: Der Standardort der Konfigurationsdatei I</etc/blkid.conf> kann mit der Umgebungsvariablen BLKID_CONF außer Kraft gesetzt werden. Die folgenden Optionen steuern die Bibliothek libblkid:
fr: L'emplacement standard du fichier de configuration I</etc/blkid.conf> peut être remplacé par la variable d'environnement B<BLKID_CONF>. Les options suivantes contrôlent la bibliothèque libblkid.
uk: Стандартне розташування файла налаштувань I</etc/blkid.conf> можна перевизначити змінною середовища B<BLKID_CONF>. вказані нижче параметри керують роботою бібліотеки libblkid:

source: I<SEND_UEVENT=E<lt>yes|notE<gt>>
fr: B<SEND_UEVENT=>I<yes>|I<not>
