Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkid.8.po
Languages: de, fr, uk

source: System Administration
fr: Administration Système
uk: Керування системою

source: NAME
de: BEZEICHNUNG
fr: NOM
uk: НАЗВА

source: blkid - locate/print block device attributes
de: blkid - Blockgeräteattribute ermitteln/ausgeben
fr: blkid – Trouver ou afficher les attributs de périphérique en mode bloc
uk: blkid — виявлення і виведення атрибутів блокового пристрою

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<blkid> B<--label> I<label> | B<--uuid> I<uuid>
de: B<blkid> B<--label> I<Bezeichner> | B<--uuid> I<UUID>
fr: B<blkid> B<--label> I<étiquette> | B<--uuid> I<UUID>
uk: B<blkid> B<--label> I<мітка> | B<--uuid> I<uuid>

source: B<blkid> [B<--no-encoding> B<--garbage-collect> B<--list-one> B<--cache-file> I<file>] [B<--output> I<format>] [B<--match-tag> I<tag>] [B<--match-token> I<NAME=value>] [I<device>...]
de: B<blkid> [B<--no-encoding> B<--garbage-collect> B<--list-one> B<--cache-file> I<Datei>] [B<--output> I<Format>] [B<--match-tag> I<Markierung>] [B<--match-token> I<NAME=Wert>] [I<Gerät> …]
fr: B<blkid> [B<--no-encoding> B<--garbage-collect> B<--list-one> B<--cache-file> I<fichier>] [B<--output> I<format>] [B<--match-tag> I<indicateur>] [B<--match-token> I<NOM>B<=>I<valeur>] [I<périphérique> ...]
uk: B<blkid> [B<--no-encoding> B<--garbage-collect> B<--list-one> B<--cache-file> I<файл>] [B<--output> I<формат>] [B<--match-tag> I<мітка>] [B<--match-token> I<НАЗВА=значення>] [I<пристрій>...]

source: B<blkid> B<--probe> [B<--offset> I<offset>] [B<--output> I<format>] [B<--size> I<size>] [B<--match-tag> I<tag>] [B<--match-types> I<list>] [B<--usages> I<list>] [B<--no-part-details>] I<device>...
de: B<blkid> B<--probe> [B<--offset> I<Versatz>] [B<--output> I<Format>] [B<--size> I<Größe>] [B<--match-tag> I<Markierung>] [B<--match-types> I<Liste>] [B<--usages> I<Liste>] [B<--no-part-details>] I<Gerät> …
fr: B<blkid> B<--probe> [B<--offset> I<position>] [B<--output> I<format>] [B<--size> I<taille>] [B<--match-tag> I<indicateur>] [B<--match-types> I<liste>] [B<--usages> I<liste>] [B<--no-part-details>] I<périphérique> ...
uk: B<blkid> B<--probe> [B<--offset> I<відступ>] [B<--output> I<формат>] [B<--size> I<розмір>] [B<--match-tag> I<мітка>] [B<--match-types> I<список>] [B<--usages> I<список>] [B<--no-part-details>] I<пристрій>...

source: B<blkid> B<--info> [B<--output format>] [B<--match-tag> I<tag>] I<device>...
de: B<blkid> B<--info> [B<--output> I<Format>] [B<--match-tag> I<Markierung>] I<Gerät> …
fr: B<blkid> B<--info> [B<--output format>] [B<--match-tag> I<indicateur>] I<périphérique> ...
uk: B<blkid> B<--info> [B<--output формат>] [B<--match-tag> I<мітка>] I<пристрій>...

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: The B<blkid> program is the command-line interface to working with the B<libblkid>(3) library. It can determine the type of content (e.g., filesystem or swap) that a block device holds, and also the attributes (tokens, NAME=value pairs) from the content metadata (e.g., LABEL or UUID fields).
de: Das Programm B<blkid> ist eine Befehlszeilenschnittstelle zur Arbeit mit der Bibliothek B<libblkid>(3). Es kann die Art des Inhalts (z.B. Dateisystem oder Auslagerung) bestimmen, den ein Blockgerät enthält und auch die Attribute (Merkmale, NAME=Wert-Paare) aus den Metadaten des Inhalts (z.B. die Felder LABEL oder UUID).
fr: Le programme B<blkid> est une interface en ligne de commande pour la bibliothèque B<libblkid>(3). Il peut déterminer le type de contenu (par exemple, un système de fichiers ou une partition d'échange) associé à un périphérique bloc et aussi les attributs (sous la forme de jetons I<NOM>B<=>I<valeur>) des métadonnées (par exemple, l'étiquette B<LABEL> ou l'B<UUID>).
uk: Програма B<blkid> є інтерфейсом командного рядка для роботи з бібліотекою B<libblkid>(3). Вона може визначати тип вмісту (наприклад, файлова система чи резервна пам'ять), який зберігається на блоковому пристрої, а також атрибути (жетони, пари НАЗВА=значення) на основі метаданих вмісту (наприклад полів LABEL та UUID).

source: B<It is recommended to use> B<lsblk>(8) B<command to get information about block devices, or lsblk --fs to get an overview of filesystems, or> B<findmnt>(8) B<to search in already mounted filesystems.>
de: B<Es wird empfohlen, den Befehl> B<lsblk>(8) B<oder »lsblk --fs« zu verwenden, um einen Überblick über Dateisysteme oder> B<findmnt>(8) B<, um in einem bereits eingehängten Dateisystem zu suchen, zu verwenden.>
fr: B<Il est recommandé d’utiliser la commande lsblk(8) pour obtenir des informations à propos des périphériques bloc, ou lsblk --fs pour obtenir une vue d’ensemble des systèmes de fichiers, ou findmnt(8) pour effectuer une recherche dans les systèmes de fichiers déjà montés.>
uk: B<Рекомендуємо користуватися командою> B<lsblk>(8) B<для отримання відомостей щодо блокових пристроїв або lsblk --fs для отримання огляду файлових систем або> B<findmnt>(8) B<для пошуку вже змонтованих файлових систем.>

source: B<lsblk>(8) provides more information, better control on output formatting, easy to use in scripts and it does not require root permissions to get actual information. B<blkid> reads information directly from devices and for non-root users it returns cached unverified information. B<blkid> is mostly designed for system services and to test B<libblkid>(3) functionality.
de: B<lsblk>(8) stellt mehr Informationen, bessere Steuerung der Ausgabeformatierung, eine einfachere Verwendung in Skripten bereit und benötigt keine Root-Rechte, um die eigentlichen Informationen zu erhalten. B<blkid> liest Informationen direkt aus Geräten und für von Root verschiedene Benutzer liefert es zwischengespeicherte, nicht geprüfte Informationen zurück. B<blkid> ist hauptsächlich für Systemdienste und zum Testen der Funktionalität von B<libblkid>(3) gedacht.
fr: B<lsblk>(8) fournit plus d’informations, un meilleur contrôle sur le formatage de la sortie, une utilisation plus aisée dans les scripts et ne nécessite pas les permissions de superutilisateur pour obtenir les informations concrètes. B<blkid> lit les informations directement des périphériques et pour les utilisateurs normaux, il renvoie les informations mises en cache et non vérifiées. B<blkid> est principalement conçu pour les services de système et pour tester les fonctionnalités de B<libblkid>(3).
uk: B<lsblk>(8) надає більше інформації, кращі можливості керування форматуванням виведення, прості у користуванні скрипти і не потребує прав доступу root для отримання самих відомостей. B<blkid> читає відомості безпосередньо з пристроїв, а для користувачів, які не є користувачем root, повертає кешовані неперевірені відомості. B<blkid>, здебільшого, призначено для системних служб і перевірки функціональних можливостей B<libblkid>(3).

source: When I<device> is specified, tokens from only this device are displayed. It is possible to specify multiple I<device> arguments on the command line. If none is given, all partitions or unpartitioned devices which appear in I</proc/partitions> are shown, if they are recognized.
de: Falls I<Gerät> angegeben ist, werden nur die Merkmale dieses Geräts angezeigt. Es ist möglich, auf der Befehlszeile mehrere Argumente I<Gerät> anzugeben. Falls keines angegeben ist, werden alle partitionierten oder unpartitionierten Geräte, die in I</proc/partitions> auftauchen, angezeigt, falls sie erkannt werden.
fr: Quand un I<périphérique> est indiqué, seuls les jetons pour ce I<périphérique> sont affichés. Plusieurs arguments I<périphérique> peuvent être indiqués sur la ligne de commande. Si aucun n'est donné, tous les partitions et périphériques non partitionnés apparaissant dans I</proc/partitions> seront affichés, s'ils sont reconnus.
uk: Якщо вказано I<пристрій>, буде показано лише жетони з цього пристрою. У рядку команди можна вказати декілька аргументів I<пристрій>. Якщо не вказано жодного аргументу, буде виведено дані для усіх розділів або нерозподілених пристроїв у I</proc/partitions>, якщо їх було розпізнано.

source: B<blkid> has two main forms of operation: either searching for a device with a specific NAME=value pair, or displaying NAME=value pairs for one or more specified devices.
de: B<blkid> hat zwei Hauptbetriebsarten: Suche nach einem Gerät mit einem bestimmten NAME=Wert-Paar oder Anzeige von NAME=Wert-Paaren für ein oder mehrere Geräte.
fr: B<blkid> a deux modes de fonctionnement : soit il recherche un périphérique avec un couple I<NOM>B<=>I<valeur> donné, soit il affiche les couples I<NOM>B<=>I<valeur> pour un ou plusieurs I<périphérique>s indiqués.
uk: Для B<blkid> передбачено дві основні форми роботи: пошук пристрою за допомогою вказаної пари НАЗВА=значення та показ пар НАЗВА=значення для одного або декількох вказаних пристроїв.

source: For security reasons B<blkid> silently ignores all devices where the probing result is ambivalent (multiple colliding filesystems are detected). The low-level probing mode (B<-p>) provides more information and extra exit status in this case. It\(cqs recommended to use B<wipefs>(8) to get a detailed overview and to erase obsolete stuff (magic strings) from the device.
de: Aus Sicherheitsgründen ignoriert B<blkid> ohne Rückmeldungen alle Geräte, bei denen das Untersuchungsergebnis nicht eindeutig ist (mehrere, kollidierende Dateisysteme wurden erkannt). Der systemnahe Untersuchungsmodus (B<-p>) stellt in diesem Fall weitere Informationen und zusätzliche Exit-Status bereit. Es wird empfohlen, B<wipefs>(8) zu verwenden, um einen detaillierteren Überblick zu erhalten und veraltetes Zeug (magische Zeichenketten) von dem Gerät zu löschen.
fr: Pour des raisons de sécurité, B<blkid> ignore silencieusement tous les périphériques quand le résultat des détections est ambivalent (plusieurs périphériques en conflit sont détectés). Le mode bas niveau (B<-p>) fournit plus d’informations et un code de retour supplémentaire. Il est recommandé d’utiliser B<wipefs>(8) pour une vue d’ensemble détaillée et pour supprimer toutes les choses obsolètes (chaînes magiques) sur le périphérique.
uk: З міркувань безпеки B<blkid> без повідомлення ігнорує усі пристрої, де результат зондування є неоднозначним (виявлено декілька конфліктних файлових систем). У режимі низькорівневого зондування (B<-p>) програма надає більше інформації та додатковий стан виходу. Рекомендуємо користуватися B<wipefs>(8) для отримання докладного огляду або витирання застарілих даних (контрольних рядків) з пристрою.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: The I<size> and I<offset> arguments may be followed by the multiplicative suffixes like KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB"), or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB.
de: Die Argumente I<Größe> und I<Versatz> können von multiplikativen Endungen wie KiB (=1024), MiB (=1024*1024) und so weiter für GiB, TiB, PiB, EiB, ZiB und YiB (das »iB« ist optional, z.B. hat »K« die gleiche Bedeutung wie »KiB«) oder den Endungen KB (=1000), MB (=1000*1000) und so weiter für GB, TB, PB, EB, ZB und YB gefolgt werden.
fr: Les arguments I<taille> et I<position> peuvent être suivis de suffixes multiplicatifs comme KiB=1024, MiB=1024*1024, etc., pour GiB, TiB, PiB, EiB, ZiB et YiB (la partie « iB » est facultative, par exemple « K » est identique à « KiB ») ou des suffixes KB=1000, MB=1000*1000, etc., pour GB, TB, PB, EB, ZB et YB.
uk: Після аргументів I<розмір> і I<відступ> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB.

source: B<-c>, B<--cache-file> I<cachefile>
de: B<-c>, B<--cache-file> I<Zwischenspeicherdatei>
fr: B<-c>, B<--cache-file> I<fichier_cache>
uk: B<-c>, B<--cache-file> I<файл-кешу>

source: Read from I<cachefile> instead of reading from the default cache file (see the B<CONFIGURATION FILE> section for more details). If you want to start with a clean cache (i.e., don\(cqt report devices previously scanned but not necessarily available at this time), specify I</dev/null>.
de: liest aus I<Zwischenspeicherdatei> statt aus der Standardzwischenspeicherdatei (siehe den Abschnitt B<KONFIGURATIONSDATEI> für weitere Details). Falls Sie mit einem sauberen Zwischenspeicher beginnen möchten (d.h. keine Geräte berichtet werden sollen, die früher eingelesen wurden aber nicht notwendigerweise derzeit verfügbar sind), geben Sie I</dev/null> an.
fr: Lire dans le I<fichier_cache> plutôt que dans le fichier de cache par défaut (consultez la section B<FICHIER DE CONFIGURATION> pour plus de précisions). Si vous souhaitez utiliser un cache vide (c'est-à-dire ne pas afficher les périphériques examinés auparavant, mais qui ne seraient plus disponibles), utilisez I</dev/null>.
uk: Читати дані з файла I<файл-кешу>, а не з типового файла кешу (див. розділ B<ФАЙЛ НАЛАШТУВАНЬ>, щоб дізнатися більше). Якщо ви хочете розпочати з порожнього кешу (тобто не бачити даних раніше сканованих, але не обов'язково доступних на поточний момент пристроїв), вкажіть I</dev/null>.

source: Don\(cqt encode non-printing characters. The non-printing characters are encoded by ^ and M- notation by default. Note that the B<--output udev> output format uses a different encoding which cannot be disabled.
de: kodiert nicht druckbare Zeichen nicht. Standardmäßig werden die nicht druckbaren Zeichen durch die Notation ^ und M- kodiert. Beachten Sie, dass das Ausgabeformat B<--output udev> eine andere Kodierung verwendet, die nicht deaktiviert werden kann.
fr: Ne pas encoder les caractères non imprimables. Les caractères non imprimables sont encodés par les notations B<^> et B<M-> par défaut. Remarquez que le format de sortie B<--output\ udev> utilise un encodage différent qui ne peut pas être désactivé.
uk: Не кодувати непридатні до друку символи. Типово, непридатні до друку символи буде закодовано з використанням позначень ^ і M-. Зауважте, що формат виведення B<--output udev> використовує різне кодування, яке не можна вимкнути.

source: Don\(cqt print information (PART_ENTRY_* tags) from partition table in low-level probing mode.
de: gibt im systemnahen Untersuchungsmodus keine Informationen (PART_ENTRY_*-Markierungen) aus der Partitionstabelle aus.
fr: Ne pas afficher d’information (indicateurs B<PART_ENTRY_>I<*>) de la table de partitions dans le mode de détection bas niveau.
uk: Не виводити відомості (мітки PART_ENTRY_*) з таблиці розділів у режимі низькорівневого зондування.

source: Perform a garbage collection pass on the blkid cache to remove devices which no longer exist.
de: führt einen Durchlauf der automatischen Speicherbereinigung (Garbage Collection) durch und entfernt Geräte, die nicht mehr existieren.
fr: Lancer le ramasse-miettes sur le cache de B<blkid> pour supprimer les périphériques qui n'existent plus.
uk: Виконати прохід збирання сміття у кеші blkid для вилучення пристроїв, яких уже не існує.

source: B<-H>, B<--hint> I<setting>
de: B<-H>, B<--hint> I<Einstellung>
fr: B<-H>, B<--hint> I<réglage>
uk: B<-H>, B<--hint> I<параметр>

source: Set probing hint. The hints are an optional way to force probing functions to check, for example, another location. The currently supported is "session_offset=I<number>" to set session offset on multi-session UDF.
de: setzt einen Prüfvorschlag. Die Vorschläge sind eine optionale Möglichkeit, die Prüffunktionen dazu zu zwingen, beispielsweise einen anderen Ort zu überprüfen. Derzeit wird »session_offset=I<Nummer>« unterstützt, um den Sitzungsversatz bei UDF mit mehreren Sitzungen zu setzen.
fr: Régler les indications de détection. Les indications sont une manière optionnelle pour obliger les fonctions de détection à vérifier par exemple un autre emplacement. L'indication actuellement prise en charge est « session_offset=I<nombre> » pour définir la position d'une session d'un système de fichiers UDF multi-session.
uk: Встановити підказку зондування. Підказки є необов'язковим способом наказати функціями зондування перевіряти, наприклад, інше місце. У поточній версії передбачено підтримку «session_offset=I<число>» для встановлення зсуву сеансу для багатосеансових UDF.

source: Display information about I/O Limits (aka I/O topology). The \(aqexport\(aq output format is automatically enabled. This option can be used together with the B<--probe> option.
de: zeigt Informationen über E/A-Begrenzungen an (d.h. die E/A-Topologie). Das Ausgabeformat »export« wird automatisch aktiviert. Diese Option kann zusammen mit der Option B<--probe> verwandt werden.
fr: Afficher les renseignements de limites (topologie) d'E/S. Le format de sortie B<export> est automatiquement activé. Cette option peut être utilisée avec l'option B<-probe>.
uk: Вивести дані щодо обмеження введення-виведення (тобто топології введення-виведення). Автоматично буде увімкнено формат виведення «export». Цей параметр може бути використано разом із параметром B<--probe>.

source: List all known filesystems and RAIDs and exit.
de: listet alle bekannten Dateisysteme und RAIDs auf und beendet das Programm.
fr: Afficher tous les systèmes de fichiers et RAID connus et quitter.
uk: Вивести список усіх відомих файлових систем і RAID і завершити роботу.

source: Look up only one device that matches the search parameter specified with the B<--match-token> option. If there are multiple devices that match the specified search parameter, then the device with the highest priority is returned, and/or the first device found at a given priority (but see below note about udev). Device types in order of decreasing priority are: Device Mapper, EVMS, LVM, MD, and finally regular block devices. If this option is not specified, B<blkid> will print all of the devices that match the search parameter.
de: sucht nur nach Geräten, die auf das mit der Option B<--match-token> angegebene Suchmuster passen. Falls mehrere Geräte auf den Suchparameter passen, wird das Gerät mit der höchsten Priorität zurückgeliefert oder das erste Gerät mit der angegebenen Priorität (beachten Sie jedoch die Anmerkungen zu Udev unten). Gerätetypen, in Reihenfolge absteigender Priorität: Device Mapper, EVMS, LVM, MD und schließlich reguläre Blockgeräte. Falls diese Option nicht angegeben ist, wird B<blkid> alle Geräte, die auf das angegebene Suchmuster passen, ausgeben.
fr: Ne rechercher qu’un périphérique correspondant au paramètre demandé indiqué avec l'option B<-match-token>. Si plusieurs périphériques correspondent, le périphérique de priorité la plus haute sera affiché ou le premier périphérique avec la priorité voulue (mais consultez ci-dessous la remarque sur udev). Voici les types de périphériques par priorité décroissante : Device Mapper, EVMS, LVM, MD, puis les périphériques bloc classiques. Si cette option n'est pas utilisée, B<blkid> affichera tous les périphériques qui correspondent à la recherche.
uk: Шукати лише один пристрій, який відповідає параметру пошуку, вказаному за допомогою параметра B<--match-token>. Якщо вказаному параметру пошуку відповідають декілька пристроїв, буде повернуто пристрій із найвищою пріоритетністю, і/або перший знайдений пристрій із заданою пріоритетністю (але див. зауваження щодо udev нижче). Типами пристроїв за спаданням пріоритетності є такі: Device Mapper, EVMS, LVM, MD і, нарешті. звичайні блокові пристрої. Якщо цей параметр не вказано, B<blkid> виведе усі пристрої, які відповідають параметру пошуку.

source: This option forces B<blkid> to use udev when used for LABEL or UUID tokens in B<--match-token>. The goal is to provide output consistent with other utils (like B<mount>(8), etc.) on systems where the same tag is used for multiple devices.
de: Diese Option zwingt B<blkid>, Udev zu nutzen, wenn es in B<--match-token> für BEZEICHNER- oder UUID-Merkmale verwendet wird. Die Absicht ist, dass die Ausgabe auf Systemen, welche die gleiche Markierung für mehrere Geräte verwenden, konsistent zu den Ausgaben anderer Dienstprogramme (wie beispielsweise B<mount>(8) usw.) ist.
fr: Cette option oblige B<blkid> à utiliser les jetons LABEL ou UUID dans B<--match-token>. Le but est de fournir une sortie cohérente avec celle d’autres outils (tel B<mount>(8), etc.) sur les systèmes où le même indicateur est utilisé pour plusieurs périphériques.
uk: Використання цього параметра наказує B<blkid> використовувати udev, якщо його використано для жетонів LABEL і UUID у B<--match-token>. Метою є надання виведених даних, які сумісні із іншими допоміжними програмами (подібними до B<mount>(8) тощо) у системах, де ту саму мітку використано для декількох пристроїв.

source: B<-L>, B<--label> I<label>
de: B<-L>, B<--label> I<Bezeichnung>
fr: B<-L>, B<--label> I<étiquette>
uk: B<-L>, B<--label> I<мітка>

source: Look up the device that uses this filesystem I<label>; this is equal to B<--list-one --output device --match-token LABEL=>I<label>. This lookup method is able to reliably use /dev/disk/by-label udev symlinks (dependent on a setting in I</etc/blkid.conf>). Avoid using the symlinks directly; it is not reliable to use the symlinks without verification. The B<--label> option works on systems with and without udev.
de: schlägt das Gerät nach, das diesen Dateisystem-I<Bezeichner> verwendet. Dies ist mit B<--list-one --output device --match-token LABEL=>I<Bezeichner> identisch. Die Nachschlagemethode kann /dev/disk/by-label-udev-Symlinks zuverlässig verwenden (abhängig von einer Einstellung in I</etc/blkid.conf>). Vermeiden Sie die direkte Verwendung der Symlinks. Es ist nicht zuverlässig, die Symlinks ohne Prüfung zu verwenden. Die Option B<--label> funktioniert auf Systemen mit und ohne Udev.
fr: Rechercher le périphérique qui utilise cette I<étiquette> de système de fichiers ; c’est équivalent à B<--list-one --output device --match-token LABEL=>I<étiquette>. Cette méthode de recherche est capable d'utiliser de manière fiable les liens symboliques udev du type I</dev/disk/by-label> (suivant une configuration définie dans I</etc/blkid.conf>). Évitez d'utiliser directement les liens symboliques, car leur utilisation n’est pas sûre sans vérification. L'option B<--label> fonctionne sur des systèmes avec ou sans udev.
uk: Шукати пристрій, який використовує цю I<мітку> файлової системи; цей параметр еквівалентний до набору B<--list-one --output device --match-token LABEL=>I<_мітка_>. Цей спосіб пошуку може надійно використовувати символічні посилання udev /dev/disk/by-label (залежно від параметра в I</etc/blkid.conf>). Намагайтеся не використовувати символічні посилання безпосередньо; використання символічних посилань без перевірки не є надійним. Параметр B<--label> працює як у системах із udev, так і без нього.

source: Unfortunately, the original B<blkid>(8) from e2fsprogs uses the B<-L> option as a synonym for B<-o list>. For better portability, use B<-l -o device -t LABEL=>I<label> and B<-o list> in your scripts rather than the B<-L> option.
de: Unglücklicherweise verwendet das ursprüngliche B<blkid>(8) aus den E2fsprogs die Option B<-L> als Synonym für B<-o list>. Zur besseren Portabilität verwenden Sie B<-l -o device -t LABEL=>I<Bezeichner> und B<-o list> statt der Option B<-L> in Ihren Skripten.
fr: Malheureusement, le B<blkid>(8) d'origine d'e2fsprogs utilise l'option B<-L> comme synonyme de B<-o list>. Pour assurer la portabilité, l'utilisation de B<-l\ -o\ device\ -t\ LABEL=>I<étiquette> et B<-o\ list> est à préférer à l'option B<-L> dans les scripts.
uk: На жаль, початкова версія B<blkid>(8) з e2fsprogs використовує параметр B<-L> як синонім B<-o list>. Для забезпечення ширшої застосовності використовуйте у своїх скриптах B<-l -o device -t LABEL=>I<мітка> та B<-o list> замість параметра B<-L>.
