Repository: sebras/manpages-l10n
Catalog: po/*/man8/blkzone.8.po
Languages: de, uk

source: System Administration
uk: Керування системою

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: blkzone - run zone command on a device
de: blkzone - Zonenbefehle auf einem Gerät ausführen
uk: blkzone — запуск команди зони на пристрої

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<blkzone> I<command> [options] I<device>
de: B<blkzone> I<Befehl> [Optionen] I<Gerät>
uk: B<blkzone> I<команда> [параметри] I<пристрій>

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: B<blkzone> is used to run zone command on device that support the Zoned Block Commands (ZBC) or Zoned-device ATA Commands (ZAC). The zones to operate on can be specified using the offset, count and length options.
de: B<blkzone> wird zum Ausführen von Zone-Befehlen auf Geräten verwendet, die »Zoned Block Commands« (ZBC) oder »Zoned-device ATA Commands« (ZAC) unterstützen. Die Zonen, auf denen es agieren soll, werden durch Optionen angegeben, die den Versatz, die Anzahl oder die Länge bezeichnen.
uk: B<blkzone> використовують для запуску команд обробки зон на пристрої, де передбачено підтримку Zoned Block Commands (ZBC) або Zoned-device ATA Commands (ZAC). Зони, з якими слід працювати, може бути вказано за допомогою параметрів відступу, кількості та довжину.

source: The I<device> argument is the pathname of the block device.
de: Das Argument I<Gerät> ist der Pfadname zu dem blockorientierten Gerät.
uk: Аргумент I<пристрій> визначає шлях до блокового пристрою.

source: COMMANDS
de: BEFEHLE
uk: КОМАНДИ

source: The command B<blkzone report> is used to report device zone information.
de: Der Befehl B<blkzone report> wird zum Melden von Informationen zu Gerätezonen verwendet.
uk: Команду B<blkzone report> використовують для створення звітів щодо зон пристрою.

source: By default, the command will report all zones from the start of the block device. Options may be used to modify this behavior, changing the starting zone or the size of the report, as explained below.
de: Standardmäßig meldet der Befehl alle Zonen ab dem Beginn des blockorientierten Geräts. Zum Anpassen dieses Verhaltens können Optionen angegeben werden, welche die Startzone oder die Größe der Meldung beeinflussen, wie nachfolgend beschrieben.
uk: Типово, команда повідомить про усі зони від початку блокового пристрою. Параметрами можна скористатися для внесення змін до цієї поведінки, зміни початкової зони або розмір звіту, як це описано нижче.

source: Report output:
de: Berichtsausgabe:
uk: Виведення звіту:

source: Zone start sector
de: Zonen-Startsektor
uk: Початковий сектор зони

source: Zone length in number of sectors
de: Zonenlänge in Anzahl der Sektoren
uk: Довжина зони у секторах

source: Zone capacity in number of sectors
de: Zonenkapazität in Anzahl der Sektoren
uk: Місткість зони у кількості секторів

source: Zone write pointer position
de: Schreibzeigerposition in der Zone
uk: Позиція вказівника запису зони

source: Reset write pointer recommended
de: Zurücksetzen des Schreibzeigers empfohlen
uk: Рекомендоване скидання вказівника запису

source: Non-sequential write resources active
de: Nicht-sequenzielle Schreibressourcen sind aktiv
uk: Активними є ресурси непослідовного запису

source: Zone condition
de: Zonenbedingung
uk: Стан зони

source: Zone type
de: Zonentyp
uk: Тип зони

source: Zone conditions:
de: Zonenbedingungen:
uk: Стани зони:

source: Closed
de: Geschlossen
uk: Закрита

source: Not write pointer
de: Kein Schreibzeiger
uk: Не є вказівником запису

source: Empty
de: Leer
uk: Порожня

source: Full
de: Voll
uk: Повна

source: Explicitly opened
de: Explizit geöffnet
uk: Явно відкрита

source: Implicitly opened
de: Implizit geöffnet
uk: Неявно відкрита

source: Offline
uk: Не працює

source: Read only
de: Schreibgeschützt
uk: Лише читання

source: Reserved conditions (should not be reported)
de: Reservierte Bedingungen (sollte nicht berichtet werden)
uk: Зарезервовані стани (не має повідомлятися)

source: The command B<blkzone capacity> is used to report device capacity information.
de: Der Befehl B<blkzone capacity> wird zum Melden von Informationen zu Gerätekapazitäten verwendet.
uk: Команду B<blkzone capacity> використовують для створення звітів щодо місткості.

source: By default, the command will report the sum, in number of sectors, of all zone capacities on the device. Options may be used to modify this behavior, changing the starting zone or the size of the report, as explained below.
de: Standardmäßig meldet der Befehl die Summe in Anzahl der Sektoren aller Zonenkapazitäten auf diesem Gerät. Mittels Optionen können Sie dieses Verhalten anpassen, die Startzone oder den Umfang des Berichts ändern, wie nachfolgend beschrieben.
uk: Типово, команда повідомляє про суму, у кількості секторів, усіх можливостей зон на пристрої. Параметрами можна скористатися для внесення змін до цієї поведінки, зміни початкової зони або розмір звіту, як це описано нижче.

source: The command B<blkzone reset> is used to reset one or more zones. Unlike B<sg_reset_wp>(8), this command operates from the block layer and can reset a range of zones.
de: Mit dem Befehl B<blkzone reset> können Sie eine oder mehrere Zonen zurücksetzen. Im Gegensatz zu B<sg_reset_wp>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen zurücksetzen.
uk: Команду B<blkzone reset> використовують для скидання однієї або декількох зон. На відміну від B<sg_reset_wp>(8), ця команда працює з шару блоків та може скидати діапазон зон.

source: The command B<blkzone open> is used to explicitly open one or more zones. Unlike B<sg_zone>(8), open action, this command operates from the block layer and can open a range of zones.
de: Mit dem Befehl B<blkzone open> können Sie eine oder mehrere Zonen explizit öffnen. Im Gegensatz zur Öffnen-Aktion von B<sg_zone>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen öffnen.
uk: Команду B<blkzone open> використовують для явного відкриття однієї або декількох зон. На відміну від B<sg_zone>(), дії з відкриття, ця команда працює з шару блоків та може відкривати діапазон зон.

source: The command B<blkzone close> is used to close one or more zones. Unlike B<sg_zone>(8), close action, this command operates from the block layer and can close a range of zones.
de: Mit dem Befehl B<blkzone close> können Sie eine oder mehrere Zonen schließen. Im Gegensatz zur Schließen-Aktion von B<sg_zone>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen schließen.
uk: Команду B<blkzone close> використовують для закриття однієї або декількох зон. На відміну від B<sg_zone>(), дії з закриття, ця команда працює з шару блоків та може закривати діапазон зон.

source: The command B<blkzone finish> is used to finish (transition to full condition) one or more zones. Unlike B<sg_zone>(8), finish action, this command operates from the block layer and can finish a range of zones.
de: Mit dem Befehl B<blkzone finish> können Sie eine oder mehrere Zonen finalisieren (Übergang in den Voll-Zustand). Im Gegensatz zur Finish-Aktion B<sg_zone>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen finalisieren.
uk: Команду B<blkzone finish> використовують для завершення (переведення до умови повноти) однієї або декількох зон. На відміну від B<sg_zone>(), дії з завершення, ця команда працює з шару блоків та може завершувати діапазон зон.

source: By default, the B<reset>, B<open>, B<close> and B<finish> commands will operate from the zone at device sector 0 and operate on all zones. Options may be used to modify this behavior as explained below.
de: Standardmäßig agieren die Befehle B<reset>, B<open>, B<close> und B<finish> ab der Zone im Gerätesektor 0 und auf allen Zonen. Mittels Optionen können Sie dieses Verhalten anpassen, wie nachfolgend beschrieben.
uk: Типово, команди B<reset>, B<open>, B<close> і B<finish> працюватимуть з зони на секторі 0 пристрою і з усіма зонами. Параметрами можна скористатися для внесення змін до цієї поведінки, як це пояснено нижче.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: The I<offset> and I<length> option arguments may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB") or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB. Additionally, the 0x prefix can be used to specify I<offset> and I<length> in hex.
de: Den Optionsargumente I<Versatz> und I<Länge> können die multiplikative Suffixe KiB (=1024), MiB (=1024*1024) und so weiter für GiB, TiB, PiB, EiB, ZiB und YiB (das »iB« ist optional, z.B. ist »K« gleichbedeutend mit »KiB«) oder die Suffixe KB (=1000), MB (=1000*1000), und so weiter für GB, TB, PB, EB, ZB und YB folgen. Außerdem können Sie mit dem Präfix 0x den I<Versatz> und die I<Länge> in hexadezimaler Notation angeben.
uk: Після аргументів I<відступ> і I<довжина> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB. Крім того, префіксом 0x можна скористатися для визначення I<відступу> і I<довжини> у форматі шістнадцяткових чисел.

source: B<-o>, B<--offset> I<sector>
de: B<-o>, B<--offset> I<Sektor>
uk: B<-o>, B<--offset> I<сектор>

source: The starting zone specified as a sector offset. The provided offset in sector units (512 bytes) should match the start of a zone. The default value is zero.
de: gibt die Startzone als Sektorenversatz an. Der angegebene Versatz in Sektoreinheiten (512 Byte) sollte dem Beginn der Zone entsprechen. Der Standardwert ist 0.
uk: Початкова зона, яку вказано як відступ у секторах. Заданий відступ в одиницях секторів (512 байтів) має відповідати початку зони. Типовим є нульове значення.

source: B<-l>, B<--length> I<sectors>
de: B<-l>, B<--length> I<Sektoren>
uk: B<-l>, B<--length> I<сектори>

source: The maximum number of sectors the command should operate on. The default value is the number of sectors remaining after I<offset>. This option cannot be used together with the option B<--count>.
de: gibt die maximale Anzahl der Sektoren an, auf denen der Befehl agieren soll. Der Standardwert ist die Anzahl der Sektoren, die nach dem angegebenen I<Versatz> verbleiben. Diese Option kann nicht zusammen mit der Option B<--count> verwendet werden.
uk: Максимальна кількість секторів, з якими має працювати команда. Типовим є значення кількості секторів, які лишаються після I<відступу>. Цим параметром не можна користуватися у поєднанні із параметром B<--count>.

source: B<-c>, B<--count> I<count>
de: B<-c>, B<--count> I<Anzahl>
uk: B<-c>, B<--count> I<кількість>

source: The maximum number of zones the command should operate on. The default value is the number of zones starting from I<offset>. This option cannot be used together with the option B<--length>.
de: gibt die maximale Anzahl der Zonen an, auf denen der Befehl agieren soll. Der Standardwert ist die Anzahl der Zonen beginnend bei dem angegebenen I<Versatz>. Diese Option kann nicht zusammen mit der Option B<--length> verwendet werden.
uk: Максимальна кількість зон, з якими має працювати команда. Типовим є значення кількості зон, починаючи зі значення I<відступу>. Цим параметром не можна користуватися у поєднанні із параметром B<--length>.

source: Enforce commands to change zone status on block devices used by the system.
de: erzwingt Befehle zum Ändern des Zonenstatus auf von diesem System verwendeten blockorientierten Geräten.
uk: Наказати командам змінювати стан зон на блокових пристроях, які використано системою.

source: Display the number of zones returned in the report or the range of sectors reset.
de: zeigt die Anzahl der im Bericht zurückgemeldeten Zonen oder den Bereich der zurückgesetzten Sektoren an.
uk: Вивести кількість зон, які повернуто у звіті, або діапазон скинутих секторів.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: AUTHORS
de: AUTOREN
uk: АВТОРИ

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: The B<blkzone> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<blkzone> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<blkzone> є частиною пакунка util-linux, який можна отримати з

source: February 2017
de: Februar 2017
uk: Лютий 2017 року

source: B<Report output>
de: B<Berichtsausgabe>
uk: B<Виведення звіту>

source: B<Zone conditions>
de: B<Zonenebedingungen>
uk: B<Стани зони>

source: The command B<blkzone open> is used to explicitly open one or more zones. Unlike B<sg_zone>(8), open action, this command operates from the block layer and can open a range of zones.
de: Mit dem Befehl B<blkzone open> können Sie eine oder mehrere Zonen explizit öffnen. Im Gegensatz zur Öffnen-Aktion von B<sg_zone>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen öffnen.
uk: Команду B<blkzone open> використовують для явного відкриття однієї або декількох зон. На відміну від B<sg_zone>(), дії з відкриття, ця команда працює з шару блоків та може відкривати діапазон зон.

source: The command B<blkzone finish> is used to finish (transition to full condition) one or more zones. Unlike B<sg_zone>(8), finish action, this command operates from the block layer and can finish a range of zones.
de: Mit dem Befehl B<blkzone finish> können Sie eine oder mehrere Zonen finalisieren (Übergang in den Voll-Zustand). Im Gegensatz zur Finish-Aktion B<sg_zone>(8) agiert dieser Befehl auf Blockebene und kann einen Bereich von Zonen finalisieren.
uk: Команду B<blkzone finish> використовують для завершення (переведення до умови повноти) однієї або декількох зон. На відміну від B<sg_zone>(), дії з завершення, ця команда працює з шару блоків та може завершувати діапазон зон.

source: By default, the reset, open, close and finish commands will operate from the zone at device sector 0 and operate on all zones. Options may be used to modify this behavior as explained below.
de: Standardmäßig agieren die Befehle reset, open, close und finish ab der Zone im Gerätesektor 0 und auf allen Zonen. Mittels Optionen können Sie dieses Verhalten anpassen, wie nachfolgend beschrieben.
uk: Типово, команди B<reset>, B<open>, B<close> і B<finish> працюватимуть з зони на секторі 0 пристрою і з усіма зонами. Параметрами можна скористатися для внесення змін до цієї поведінки, як це пояснено нижче.

source: The I<offset> and I<length> option arguments may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB") or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB. Additionally, the 0x prefix can be used to specify I<offset> and I<length> in hex.
de: Den Optionsargumente I<Versatz> und I<Länge> können die multiplikative Suffixe KiB (=1024), MiB (=1024*1024) und so weiter für GiB, TiB, PiB, EiB, ZiB und YiB (das »iB« ist optional, z.B. ist »K« gleichbedeutend mit »KiB«) oder die Suffixe KB (=1000), MB (=1000*1000), und so weiter für GB, TB, PB, EB, ZB und YB folgen. Außerdem können Sie mit dem Präfix 0x den I<Versatz> und die I<Länge> in hexadezimaler Notation angeben.
uk: Після аргументів I<відступ> і I<довжина> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB. Крім того, префіксом 0x можна скористатися для визначення I<відступу> і I<довжини> у форматі шістнадцяткових чисел.

source: B<-o>,B< --offset >I<sector>
de: B<-o>,B< --offset >I<Sektor>
uk: B<-o>, B<--offset> I<сектор>

source: B<-l>,B< --length >I<sectors>
de: B<-l>,B< --length >I<Sektoren>
uk: B<-l>, B<--length> I<сектори>

source: B<-c>,B< --count >I<count>
de: B<-c>,B< --count >I<Anzahl>
uk: B<-c>, B<--count> I<кількість>

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: The blkzone command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
de: Der Befehl »blkzone« ist Teil des Pakets util-linux, welches aus dem E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel-Archiv E<.UE > heruntergeladen werden kann.
uk: Програма blkzone є частиною пакунка util-linux і доступна з E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>
