Repository: sebras/manpages-l10n
Catalog: po/*/man8/chat.8.po
Languages: pl

source: The special reply string of I<EOT> indicates that the chat program should send an EOT character to the remote. This is normally the End-of-file character sequence. A return character is not sent following the EOT. The EOT sequence may be embedded into the send string using the sequence I<^D>.
pl: Specjalny napis odpowiedzi, I<EOT>, wskazuje, że program chat powinien wysłać znak EOT na drugi koniec. Normalnie jest to sekwencja End-of-file (koniec pliku). Nie przesyłany jest po niej znak return. EOT można umieścić w wysyłanym łańcuchu za pomocą sekwencji I<^D>.

source: GENERATING BREAK
pl: GENEROWANIE PRZERWANIA (BREAK)

source: The special reply string of I<BREAK> will cause a break condition to be sent. The break is a special signal on the transmitter. The normal processing on the receiver is to change the transmission rate. It may be used to cycle through the available transmission rates on the remote until you are able to receive a valid login prompt. The break sequence may be embedded into the send string using the I<\eK> sequence.
pl: Specjalny łańcuch odpowiedzi, I<BREAK>, spowoduje wysłanie warunku przerwania. Sygnał ten jest specjalnym sygnałem. Normalną akcją u odbierającego go jest zmiana szybkości transmisji. Może być używany do przeskakiwania przez dostępne szybkości transmisji, aż będzie można odebrać prawidłowy znak zachęty logowania. Przerwanie można umieścić w wysyłanym łańcuchu za pomocą sekwencji I<\eK>.

source: ESCAPE SEQUENCES
pl: SEKWENCJE UCIECZKI

source: The expect and reply strings may contain escape sequences. All of the sequences are legal in the reply string. Many are legal in the expect. Those which are not valid in the expect sequence are so indicated.
pl: Łańcuchy oczekiwania i odpowiedzi mogą zawierać sekwencje ucieczki. Wszystkie sekwencje są poprawne w łańcuchu odpowiedzi. Wiele jest prawidłowe w napisie oczekiwania. Te, które nie są poprawne w sekwencji oczekiwania, są zaznaczone.

source: Expects or sends a null string. If you send a null string then it will still send the return character. This sequence may either be a pair of apostrophe or quote characters.
pl: Oczekuje lub wysyła łańcuch zerowy. W takim przypadku wysyłany jest znak return. Sekwencja ta może być zarówno parą apostrofów, jak i cudzysłowów.

source: represents a backspace character.
pl: reprezentuje znak backspace.

source: Suppresses the newline at the end of the reply string. This is the only method to send a string without a trailing return character. It must be at the end of the send string. For example, the sequence hello\ec will simply send the characters h, e, l, l, o. I<(not valid in expect.)>
pl: Powstrzymuje generowanie nowego wiersza na końcu łańcucha odpowiedzi. Jest to jedyna metoda wysyłania napisu bez kończącego go znaku return. Musi być wysyłana na końcu napisu. Na przykład sekwencja hello\ec prześle po prostu znaki h, e, l, l, o. I<(nieprawidłowe w łańcuchu oczekiwania)>.

source: Delay for one second. The program uses sleep(1) which will delay to a maximum of one second. I<(not valid in expect.)>
pl: Zatrzymuje się na sekundę. Program używa sleep(1), który zatrzyma się maksymalnie na sekundę. I<(nieprawidłowe w łańcuchu oczekiwania)>

source: Insert a BREAK I<(not valid in expect.)>
pl: Wstawia BREAK I<(nieprawidłowe w łańcuchu oczekiwania)>

source: Send a newline or linefeed character.
pl: Przesyła znak nowego wiersza lub powrotu wysuwu wiersza.

source: Send a null character. The same sequence may be represented by \e0. I<(not valid in expect.)>
pl: Przesyła znak null. Ta sama sekwencja może być reprezentowana przez \e0. I<(nieprawidłowe w łańcuchu oczekiwania)>

source: Pause for a fraction of a second. The delay is 1/10th of a second. I<(not valid in expect.)>
pl: Pauzuje na część sekundy. Opóźnienie wynosi 1/10 sekundy. I<(nieprawidłowe w łańuchu oczekiwania)>

source: Suppress writing the string to the SYSLOG file. The string ?????? is written to the log in its place. I<(not valid in expect.)>
pl: Zabrania zapisywania napisu do pliku SYSLOG. Do dziennika w jego miejscu wpisywany jest napis ???????. I<(nieprawidłowe w łańuchu oczekiwania)>

source: Send or expect a carriage return.
pl: Wysyła lub oczekuje znak powrotu karetki.

source: Represents a space character in the string. This may be used when it is not desirable to quote the strings which contains spaces. The sequence 'HI TIM' and HI\esTIM are the same.
pl: Reprezentuje znak spacji w łańuchu. Może to być używane, gdy nie jest pożądanym cytowanie łańcuchów zawierających spacje. Sekwencje 'HI TIM' i HI\esTIM są identyczne.

source: Send or expect a tab character.
pl: Wysyła lub oczekuje znaku tabulacji.

source: Send the phone number string as specified with the I<-T> option I<(not valid in expect.)>
pl: Wysyła łańcuch numeru telefonu podany opcją B<-T>. I<(nieprawidłowe w łańuchu oczekiwania)>

source: Send the phone number 2 string as specified with the I<-U> option I<(not valid in expect.)>
pl: Wysyła łańcuch numeru telefonu 2 podany opcją B<-U>. I<(nieprawidłowe w łańuchu oczekiwania)>

source: Send or expect a backslash character.
pl: Wysyła lub oczekuje znak odwrotnego ukośnika.

source: Collapse the octal digits (ddd) into a single ASCII character and send that character. I<(some characters are not valid in expect.)>
pl: Przekształca ósemkowe cyfry (ddd) w pojedynczy znak ASCII i wysyła ten znak. I<(niektóre znaki nie są używane w sekwencji oczekiwania)>

source: Substitute the sequence with the control character represented by C. For example, the character DC1 (17) is shown as \^^Q. I<(some characters are not valid in expect.)>
pl: Podmienia sekwencję znakiem sterującym (z Ctrl) reprezentowanym przez C. Na przykład znak DC1 (17) jest pokazywany jako \^^Q. I<(niektóre znaki nie są używane w sekwencji oczekiwania)>

source: ENVIRONMENT VARIABLES
pl: ZMIENNE ŚRODOWISKOWE

source: Environment variables are available within chat scripts, if the I<-E> option was specified in the command line. The metacharacter I<$> is used to introduce the name of the environment variable to substitute. If the substitution fails, because the requested environment variable is not set, I<nothing> is replaced for the variable.
pl: Zmienne środowiskowe są dostępne w skryptach chat, jeśli w wierszu polecenia podano opcję B<-E>. Metaznak I<$> jest używany do wprowadzenia nazwy zmiennej środowiskowej do podmiany. Jeśli zamiana zawiedzie, ponieważ taka zmienna nie jest ustawiona, I<nic> nie jest zamieniane zmienną.

source: TERMINATION CODES
pl: KODY ZAKOŃCZENIA

source: The I<chat> program will terminate with the following completion codes.
pl: Program B<chat> kończy swoje działanie z następującymi kodami wyjścia.

source: The normal termination of the program. This indicates that the script was executed without error to the normal conclusion.
pl: Normalne zakończenie programu. Znaczy to, że skrypt został wykonany bez błędów.

source: One or more of the parameters are invalid or an expect string was too large for the internal buffers. This indicates that the program as not properly executed.
pl: Jeden, lub więcej parametrów było nieprawidłowych, lub napis oczekiwania był zbyt duży dla buforów wewnętrznych. Wskazuje to, że program nie był prawidłowo uruchomiony.

source: An error occurred during the execution of the program. This may be due to a read or write operation failing for some reason or chat receiving a signal such as SIGINT.
pl: Pojawił się błąd podczas uruchomiania programu. Może to być spowodowane błędem operacji odczytu lub zapisu, lub odebraniem przez program sygnału takiego, jak SIGINT.

source: A timeout event occurred when there was an I<expect> string without having a "-subsend" string. This may mean that you did not program the script correctly for the condition or that some unexpected event has occurred and the expected string could not be found.
pl: Nastąpiło minięcie czasu oczekiwania dla napisu oczekiwania, który nie miał napisu "pod-wysłania". Może to oznaczać, że nie zaprogramowano właściwie skryptu na ten warunek, lub że pojawiło się jakieś nieoczekiwane zdarzenie i oczekiwany napis nie mógł zostać znaleziony.

source: The first string marked as an I<ABORT> condition occurred.
pl: Pojawił się pierwszy łańcuch oznaczony jako warunek I<ABORT>.

source: The second string marked as an I<ABORT> condition occurred.
pl: Pojawił się drugi łańcuch oznaczony jako warunek I<ABORT>.

source: The third string marked as an I<ABORT> condition occurred.
pl: Pojawił się trzeci łańcuch oznaczony jako warunek I<ABORT>.

source: The fourth string marked as an I<ABORT> condition occurred.
pl: Pojawił się czwarty łańcuch oznaczony jako warunek I<ABORT>.

source: The other termination codes are also strings marked as an I<ABORT> condition.
pl: Inne kody wyjścia są również łańcuchami oznaczonymi jako I<ABORT>.

source: Using the termination code, it is possible to determine which event terminated the script. It is possible to decide if the string "BUSY" was received from the modem as opposed to "NO DIAL TONE". While the first event may be retried, the second will probably have little chance of succeeding during a retry.
pl: Używając kodu wyjścia, możliwym jest określenie, które zdarzenie zakończyło skrypt. Jest możliwym określenie czy modem otrzymał np. napis "BUSY" czy "NO DIAL TONE". Podczas gdy pierwsze zdarzenie wymaga drugiej próby, drugie w ten sposób może mieć mniejsze szanse.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: Additional information about I<chat> scripts may be found with UUCP documentation. The I<chat> script was taken from the ideas proposed by the scripts used by the I<uucico> program.
pl: Dodatkowe informacje o skryptach B<chat> można znaleźć w dokumentacji UUCP. Skrypty programu B<chat> powstały z idei zaproponowanych przy skrypt programu B<uucico>.

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: The I<chat> program is in public domain. This is not the GNU public license. If it breaks then you get to keep both pieces.
pl: Program B<chat> jest znajduje się w domenie publicznej. Nie jest to publiczna licencja GNU. Autorzy nie udzielają żadnej gwarancji.

source: Set the timeout for the expected string to be received. If the string is not received within the time limit then the reply string is not sent. An alternate reply may be sent or the script will fail if there is no alternate reply string. A failed script will cause the I<chat> program to terminate with a non-zero error code. You can also use the TIMEOUT string in order to specify the timeout.
pl: Ustawia czas oczekiwania dla odbioru oczekiwanego łańcucha. Jeśli łańcuch nie zostanie odebrany w limicie czasowym, to łańcuch odpowiedzi nie jest wysyłany. Może być natomiast wysłana alternatywna odpowiedź, lub skrypt może zostać przerwany w wypadku braku takiej alternatywy. Program B<chat> zakończy wtedy działanie, zwracając niezerowy kod błędu. Można również podać łańcuch I<czas-oczekiwania>, aby go określić.

source: The initial timeout value is 45 seconds. This may be changed using the B<-t> parameter. You can also specify "TIMEOUT 0".
pl: Początkowa wartość czasu oczekiwania to 45 sekund. Może to być zmienione przy użyciu parametru B<-t>. Można również podać "TIMEOUT 0".
