Repository: sebras/manpages-l10n
Catalog: po/*/man8/chat.8.po
Languages: pl

source: 22 May 1999
pl: 22 maja 1999

source: Chat Version 1.22
pl: Chat Wersja 1.22

source: NAME
pl: NAZWA

source: chat - Automated conversational script with a modem
pl: chat - zautomatyzowany skrypt dialogu z modemem

source: SYNOPSIS
pl: SKŁADNIA

source: B<chat> [ I<options> ] I<script>
pl: B<chat> [ I<opcje> ] I<skrypt>

source: DESCRIPTION
pl: OPIS

source: The I<chat> program defines a conversational exchange between the computer and the modem. Its primary purpose is to establish the connection between the Point-to-Point Protocol Daemon (I<pppd>) and the remote's I<pppd> process.
pl: Program B<chat> definiuje wymianę rozmów między komputerem a modemem. Jego głównym celem jest zestawianie połączeń pomiędzy demonem Point-To-Point (B<pppd>), a procesem B<pppd> drugiego końca.

source: OPTIONS
pl: OPCJE

source: B<-f >I<E<lt>chat fileE<gt>>
pl: B<-f> I<plik>

source: Read the chat script from the chat I<file>. The use of this option is mutually exclusive with the chat script parameters. The user must have read access to the file. Multiple lines are permitted in the file. Space or horizontal tab characters should be used to separate the strings.
pl: Odczytuje skrypt rozmowy z pliku I<plik>. Używanie tej opcji wyklucza parametry skryptowe rozmowy. Użytkownik musi mieć prawa do odczytu tego pliku. Dozwolonych jest wiele wierszy w pliku. Do oddzielania napisów powinny być używana spacja lub tabulacja.

source: B<-t >I<E<lt>timeoutE<gt>>
pl: B<-t> I<czas-oczekiwania>

source: B<-r >I<E<lt>report fileE<gt>>
pl: B<-r> I<plik-raportu>

source: Set the file for output of the report strings. If you use the keyword I<REPORT>, the resulting strings are written to this file. If this option is not used and you still use I<REPORT> keywords, the I<stderr> file is used for the report strings.
pl: Ustaw plik dla wyjścia napisów raportujących. Jeżeli używa się słowa kluczowego B<REPORT>, napisy wynikowe są zapisywane do tego pliku. Jeśli opcja ta nie jest używana, można i tak używać słów B<REPORT>, które użyją pliku I<stderr>.

source: Start with the echo option turned on. Echoing may also be turned on or off at specific points in the chat script by using the I<ECHO> keyword. When echoing is enabled, all output from the modem is echoed to I<stderr>.
pl: Zaczyna z włączoną opcją echo. Można ją również włączyć lub wyłączyć w danym miejscu skryptu chat za pomocą słowa kluczowego I<ECHO>. Przy włączeniu opcji echo, całe wyjście z modemu jest przekierowane na standardowe wyjście błędów.

source: Enables environment variable substitution within chat scripts using the standard I<$xxx> syntax.
pl: Włącza podmianę zmiennych środowiskowych w skryptach chat za pomocą standardowej składni B<$>I<xxx>

source: Request that the I<chat> script be executed in a verbose mode. The I<chat> program will then log the execution state of the chat script as well as all text received from the modem and the output strings sent to the modem. The default is to log through the SYSLOG; the logging method may be altered with the -S and -s flags.
pl: Żąda uruchomienia skryptu B<chat> w trybie szczegółowym. Program B<chat> będzie wtedy logował wszystkie teksty uzyskane od modemu, a także te, które sam wysyła. Domyślnie logi wysyłane są do SYSLOG, metodę logowania można zmienić opcjami B<-S> lub B<-s>.

source: Request that the I<chat> script be executed in a stderr verbose mode. The I<chat> program will then log all text received from the modem and the output strings sent to the modem to the stderr device. This device is usually the local console at the station running the chat or pppd program.
pl: Żąda uruchomienia skryptu B<chat> w trybie szczegółowym, ale na standardowe wyjście błędów. Program będzie wówczas logował wszelki tekst otrzymany z modemu i łańcuchy wyjściowe wysyłane do modemu do urządzenia stderr. Urządzenie to jest zwykle lokalną konsolą stacji uruchamiającej program chat lub pppd.

source: Use stderr. All log messages from '-v' and all error messages will be sent to stderr.
pl: Używa standardowego wyjścia błędów. Wszystkie komunikaty loga z B<-v> wraz z komunikatami o błędach będą wysyłane na stderr.

source: Do not use the SYSLOG. By default, error messages are sent to the SYSLOG. The use of -S will prevent both log messages from '-v' and error messages from being sent to the SYSLOG.
pl: Nie używa SYSLOG. Domyślnie, komunikaty o błędach są wysyłane do SYSLOG-a. Opcja B<-S> powoduje, że komunikaty z opcji B<-v> i wiadomości o błędach nie będą tam wysyłane.

source: B<-T >I<E<lt>phone numberE<gt>>
pl: B<-T> I<numer telefonu>

source: Pass in an arbitrary string, usually a phone number, that will be substituted for the \eT substitution metacharacter in a send string.
pl: Przekazuje dowolny łańcuch, zwykle numer telefonu, który zostanie wstawiony w miejsce metaznaku \eT w wysyłanym łańcuchu.

source: B<-U >I<E<lt>phone number 2E<gt>>
pl: B<-U> I<numer telefonu 2>

source: Pass in a second string, usually a phone number, that will be substituted for the \eU substitution metacharacter in a send string. This is useful when dialing an ISDN terminal adapter that requires two numbers.
pl: Przekazuje drugi łańcuch, zwykle numer telefonu, który zostanie wstawiony w miejsce metaznaku \eU w wysyłanym łańcuchu. Jest to przydatne przy wybieraniu adaptera terminala ISDN wymagającego dwóch numerów.

source: If the script is not specified in a file with the I<-f> option then the script is included as parameters to the I<chat> program.
pl: Jeśli skrypt nie jest podany opcją I<-f> w pliku, to skrypt script jest włączany jako parametry programu B<chat>.

source: CHAT SCRIPT
pl: SKRYPT ROZMOWY

source: The I<chat> script defines the communications.
pl: Skrypt rozmowy definiuje komunikację.

source: A script consists of one or more "expect-send" pairs of strings, separated by spaces, with an optional "subexpect-subsend" string pair, separated by a dash as in the following example:
pl: Skrypt składa się z jednej lub większej ilości par napisów "oczekuj-wysyłaj", oddzielonych spacjami z ewentualnymi dodatkowymi parami "podoczekuj-podwysyłaj", oddzielonymi kreską, jak w przykładzie:

source: This line indicates that the I<chat> program should expect the string "ogin:". If it fails to receive a login prompt within the time interval allotted, it is to send a break sequence to the remote and then expect the string "ogin:". If the first "ogin:" is received then the break sequence is not generated.
pl: Znaczy to, że B<chat> powinien oczekiwać napisu "ogin:". Jeśli to zawiedzie (minie czas oczekiwania), to wysyła na drugi koniec sekwencję przerwania (break) i oczekuje napisu "ogin:". Jeśli jednak pierwszy "ogin:" zostanie odebrany, sekwencja przerwania nie jest wysyłana.

source: Once it received the login prompt the I<chat> program will send the string ppp and then expect the prompt "ssword:". When it receives the prompt for the password, it will send the password hello2u2.
pl: Gdy już uzyskaliśmy znak zachęty logowania, I<chat> spróbuje wysłać napis ppp i oczekiwać na "ssword:". Gdy go odczyta, to wyśle hasło hello2u2.

source: A carriage return is normally sent following the reply string. It is not expected in the "expect" string unless it is specifically requested by using the \er character sequence.
pl: Na zakończenie łańcucha odpowiedzi zwykle wysyłany jest znak powrotu karetki. Nie jest on oczekiwany w napisie "oczekiwania", chyba że jest specyficznie wskazany, przez użycie sekwencji \er.

source: The expect sequence should contain only what is needed to identify the string. Since it is normally stored on a disk file, it should not contain variable information. It is generally not acceptable to look for time strings, network identification strings, or other variable pieces of data as an expect string.
pl: Sekwencja oczekiwania powinna zawierać tylko to, co potrzebne do zidentyfikowania łańcucha. Ponieważ normalnie jest przechowywana na dysku, nie powinna zawierać informacji zmiennych. Generalnie nie jest akceptowane podglądanie łańcuchów czasu, identyfikacji sieci, lub innych zmiennych jako sekwencji oczekiwanej.

source: To help correct for characters which may be corrupted during the initial sequence, look for the string "ogin:" rather than "login:". It is possible that the leading "l" character may be received in error and you may never find the string even though it was sent by the system. For this reason, scripts look for "ogin:" rather than "login:" and "ssword:" rather than "password:".
pl: Aby pomóc poprawić znaki, które mogą być zmienione w sekwencji początkowej, oczekuj raczej napisu "ogin:" niż "login:". Jest możliwe, że początkowy znak będzie odebrany z błędem, a wtedy można nigdy nie znaleźć oczekiwanego napisu, chociaż został on wysłany przez system. Z tego powodu, skrypty oczekują "ogin:" zamiast "login:" i "ssword:" zamiast "password".

source: A very simple script might look like this:
pl: Bardzo prosty skrypt może wyglądać następująco:

source: In other words, expect ....ogin:, send ppp, expect ...ssword:, send hello2u2.
pl: Innymi słowy, oczekuj ....ogin:, wyślij ppp, oczekuj ...ssword:, wyślij hello2u2.

source: In actual practice, simple scripts are rare. At the vary least, you should include sub-expect sequences should the original string not be received. For example, consider the following script:
pl: W rzeczywistości proste skrypty są raczej rzadkie. Powinno się przynajmniej załączyć sekwencje "pod-oczekiwania". Proszę na przykład rozważyć następujący skrypt:

source: This would be a better script than the simple one used earlier. This would look for the same login: prompt, however, if one was not received, a single return sequence is sent and then it will look for login: again. Should line noise obscure the first login prompt then sending the empty line will usually generate a login prompt again.
pl: Byłby to lepszy skrypt niż poprzedni. Oczekiwałby na ten sam znak zachęty login:, lecz gdyby go nie odebrał, wysłałby sekwencję powrotu i oczekiwał dalej. Gdyby więc szum linii zniekształcił pierwszy znak zachęty, to późniejsze przesłanie pustej linii zazwyczaj wygeneruje nowe.

source: COMMENTS
pl: KOMENTARZE

source: Comments can be embedded in the chat script. A comment is a line which starts with the B<#> (hash) character in column 1. Such comment lines are just ignored by the chat program. If a '#' character is to be expected as the first character of the expect sequence, you should quote the expect string. If you want to wait for a prompt that starts with a # (hash) character, you would have to write something like this:
pl: Komentarze można osadzić w skrypcie programu chat. Komentarz to wiersz zaczynający się znakiem B<#> (kratką) w kolumnie 1. Są ignorowane przez program chat. Jeśli znak "#" ma znaleźć się jako pierwszy znak oczekiwanej sekwencji, oczekiwany łańcuch należy ująć w cudzysłów. Aby czekać na zachętę rozpoczynającą się # (kratką) można użyć składni podobnej do poniższej:

source: # Now wait for the prompt and send logout string
pl: # Teraz czekaj na zachętę i wyślij łańcuch wylogowania

source: SENDING DATA FROM A FILE
pl: WYSYŁANIE DANYCH Z PLIKU

source: If the string to send starts with an at sign (@), the rest of the string is taken to be the name of a file to read to get the string to send. If the last character of the data read is a newline, it is removed. The file can be a named pipe (or fifo) instead of a regular file. This provides a way for B<chat> to communicate with another program, for example, a program to prompt the user and receive a password typed in.
pl: Jeśli łańcuch przeznaczony do wysłania zaczyna się małpą (@), to reszta łańcucha jest traktowana jako nazwa pliku do odczytania, z którego wzięty jest łańcuch do wysłania. Jeśli ostatnim znakiem odczytanych danych jest znak nowego wiersza, to jest on usuwany. Plik może być nazwanym potokiem (lub fifo), a nie tylko zwykłym plikiem. W ten sposób B<chat> może komunikować się z innym programem np. z programem pytającym użytkownika o hasło i otrzymującym wpisane hasło.

source: ABORT STRINGS
pl: ŁAŃCUCHY PRZERWANIA (ABORT)

source: Many modems will report the status of the call as a string. These strings may be B<CONNECTED> or B<NO CARRIER> or B<BUSY>. It is often desirable to terminate the script should the modem fail to connect to the remote. The difficulty is that a script would not know exactly which modem string it may receive. On one attempt, it may receive B<BUSY> while the next time it may receive B<NO CARRIER>.
pl: Wiele modemów raportuje status połączenia jako łańcuch. Łańcuchy te to np. B<CONNECTED>, B<NO CARRIER>, lub B<BUSY>. Często jest właściwym wyłączenie skryptu, jeśli modem nie połączy się z drugim końcem. Przy jednej próbie może odebrać B<BUSY>, podczas gdy następnym razem zdarzyć się może B<NO CARRIER>.

source: These "abort" strings may be specified in the script using the I<ABORT> sequence. It is written in the script as in the following example:
pl: Te łańcuchy "przerywania" mogą być podane w skrypcie przy użyciu sekwencji I<ABORT>. Jest to zapisane w poniższym przykładzie:

source: This sequence will expect nothing; and then send the string ATZ. The expected response to this is the string I<OK>. When it receives I<OK>, the string ATDT5551212 to dial the telephone. The expected string is I<CONNECT>. If the string I<CONNECT> is received the remainder of the script is executed. However, should the modem find a busy telephone, it will send the string I<BUSY>. This will cause the string to match the abort character sequence. The script will then fail because it found a match to the abort string. If it received the string I<NO CARRIER>, it will abort for the same reason. Either string may be received. Either string will terminate the I<chat> script.
pl: Sekwencja ta nie będzie niczego oczekiwać; później wyśle ATZ. Oczekiwaną odpowiedzią jest I<OK>. Po odebraniu I<OK>, wysyłany jest łańcuch ATDT5551212, wykręcający numer telefonu. Oczekiwanym napisem jest I<CONNECT>. Jeśli odebrany zostanie łańcuch I<CONNECT>, to reszta skryptu jest wykonywana. Jednak jeśli modem spotka się z zajętą linią, to wyśle napis I<BUSY>. Łańcuch ten będzie odpowiadał sekwencji przerwania. Skrypt wtedy zakończy działanie, ponieważ uzyskał rozkaz przerwania. Podobnie będzie, gdy skrypt uzyska łańcuch I<NO CARRIER>.

source: CLR_ABORT STRINGS
pl: ŁAŃCUCHY CLR_ABORT

source: This sequence allows for clearing previously set B<ABORT> strings. B<ABORT> strings are kept in an array of a pre-determined size (at compilation time); B<CLR_ABORT> will reclaim the space for cleared entries so that new strings can use that space.
pl: Sekwencja ta pozwala cofnąć wcześniej ustawiony łańcuch B<ABORT>. Łańcuchy B<ABORT> są przechowywane w tablicy o z góry zdefiniowanym rozmiarze (w trakcie kompilacji), B<CLR_ABORT> odzyskają przestrzeń usuniętych wpisów, dzięki czemu nowe łańcuchy będą mogły jej użyć.

source: SAY STRINGS
pl: ŁAŃCUCHY "POWIEDZ" (SAY)

source: The B<SAY> directive allows the script to send strings to the user at the terminal via standard error. If B<chat> is being run by pppd, and pppd is running as a daemon (detached from its controlling terminal), standard error will normally be redirected to the file /etc/ppp/connect-errors.
pl: Dyrektywa B<SAY> pozwala skryptowi na wysłanie łańcucha do użytkownika i na terminal przez standardowe wyjście błędów. Jeśli B<chat> został uruchomiony przez pppd działającego jako demona (odłączonego od kontrolującego go terminala), to standardowe wyjście błędów jest zwykle przekierowywane do pliku I</etc/ppp/connect-errors>.

source: B<SAY> strings must be enclosed in single or double quotes. If carriage return and line feed are needed in the string to be output, you must explicitly add them to your string.
pl: Łańcuchy B<SAY> muszą być ujęte w pojedynczy lub podwójny cudzysłów. Jeśli w łańcuchu ma pojawić się wyświetlany powrót karetki i wysuw wiersza, to trzeba dodać je jawnie do łańcucha.

source: The SAY strings could be used to give progress messages in sections of the script where you want to have 'ECHO OFF' but still let the user know what is happening. An example is:
pl: Łańcuchy SAY można wykorzystać do przekazania wiadomości o postępie w sekcjach skryptu z włączoną opcją "ECHO OFF", lecz gdzie wciąż istotne jest powiadomienie użytkownika o tym co się dzieje. Oto przykład:

source: SAY "Dialling your ISP...\en"
pl: SAY "Wybieranie numeru dostawcy...\en"

source: SAY "Waiting up to 2 minutes for connection ... "
pl: SAY "Czekanie do 2 minut na połączenie... "

source: SAY "Connected, now logging in ...\en"
pl: SAY "Połączono, teraz nastąpi zalogowanie...\en"

source: SAY "Logged in OK ...\en" I<etc ...>
pl: SAY "OK. Zalogowano...\en" I<etc ...>

source: This sequence will only present the SAY strings to the user and all the details of the script will remain hidden. For example, if the above script works, the user will see:
pl: Ta sekwencja wypisze użytkownikowi same łańcuchy SAY, a wszystkie detale skryptu pozostaną ukryte. W powyższym przykładzie użytkownik zobaczy:

source: Dialling your ISP...
pl: Wybieranie numeru dostawcy...

source: Waiting up to 2 minutes for connection ... Connected, now logging in ...
pl: Czekanie do 2 minut na połączenie... Połączono, teraz nastąpi zalogowanie...

source: Logged in OK ...
pl: OK. Zalogowano...

source: REPORT STRINGS
pl: ŁAŃCUCHY RAPORTOWE

source: A B<report> string is similar to the ABORT string. The difference is that the strings, and all characters to the next control character such as a carriage return, are written to the report file.
pl: Napis raportowy jest bardzo podobny do napisu przerywania. Różnica polega na tym, że łańcuchy i wszystkie znaki do następującego znaku sterującego, takiego jak CR, są wypisywane w pliku raportu.

source: The report strings may be used to isolate the transmission rate of the modem's connect string and return the value to the chat user. The analysis of the report string logic occurs in conjunction with the other string processing such as looking for the expect string. The use of the same string for a report and abort sequence is probably not very useful, however, it is possible.
pl: Łańcuchy raportu mogą być używane do izolowania ze napisu połączenia ciągu określającego szybkość transmisji i zwracania wartości użytkownikowi. Analiza logiki napisu raportowego występuje w połączeniu z innym przetwarzaniem napisu, takim jak podglądanie napisu oczekiwanego. Użycie tego samego napisu jako przerywający i raportowy, prawdopodobnie nie jest zbyt użyteczne, jednak jest możliwe.

source: The report strings to no change the completion code of the program.
pl: Łańcuchy raportowe nie wpływają na kod zakończenia programu.

source: These "report" strings may be specified in the script using the I<REPORT> sequence. It is written in the script as in the following example:
pl: Napisy raportowe mogą być podawane w skrypcie przy użyciu sekwencji I<REPORT>. Jest to zapisywane w skrypcie jak w następującym przykładzie.

source: This sequence will expect nothing; and then send the string ATDT5551212 to dial the telephone. The expected string is I<CONNECT>. If the string I<CONNECT> is received the remainder of the script is executed. In addition the program will write to the expect-file the string "CONNECT" plus any characters which follow it such as the connection rate.
pl: Sekwencja ta nie będzie oczekiwać niczego; a potem wyśle napis ATDT5551212, wykręcający numer telefonu. Oczekiwanym napisem jest I<CONNECT>. Jeśli łańcuch ten jest odebrany, wykonywana jest reszta skryptu. Dodatkowo, program wydrukuje do oczekującego pliku napis I<CONNECT> plus dodatkowo znaki, które za nim podążały, takie jak szybkość połączenia.

source: CLR_REPORT STRINGS
pl: ŁAŃCUCHY CLR_REPORT

source: This sequence allows for clearing previously set B<REPORT> strings. B<REPORT> strings are kept in an array of a pre-determined size (at compilation time); B<CLR_REPORT> will reclaim the space for cleared entries so that new strings can use that space.
pl: Sekwencja ta pozwala cofnąć wcześniej ustawiony łańcuch B<REPORT>. Łańcuchy B<REPORT> są przechowywane w tablicy o z góry zdefiniowanym rozmiarze (w trakcie kompilacji), B<CLR_REPORT> odzyskają przestrzeń usuniętych wpisów, dzięki czemu nowe łańcuchy będą mogły jej użyć.

source: The echo options controls whether the output from the modem is echoed to I<stderr>. This option may be set with the I<-e> option, but it can also be controlled by the I<ECHO> keyword. The "expect-send" pair I<ECHO> I<ON> enables echoing, and I<ECHO> I<OFF> disables it. With this keyword you can select which parts of the conversation should be visible. For instance, with the following script:
pl: Opcje echo kontrolują czy wyjście z modemu jest przekierowywane na standardowe wyjście błędów. Opcje tę można ustawić za pomocą B<-e>, lecz można ją kontrolować również słowem kluczowych B<ECHO>. Para "oczekuj-wysyłaj" B<ECHO ON> włącza ją, a B<ECHO OFF> - wyłącza. Słowo kluczowe pozwala wybranie części konwersacji która ma być widoczna. Przykładowo w poniższym skrypcie:

source: all output resulting from modem configuration and dialing is not visible, but starting with the I<CONNECT> (or I<BUSY>) message, everything will be echoed.
pl: niewidoczne są komunikaty wynikające z konfiguracji modemu i wybierania numeru, lecz poczynając od wiadomości B<CONNECT> (lub B<BUSY>) wszystko jest widoczne.

source: The HANGUP options control whether a modem hangup should be considered as an error or not. This option is useful in scripts for dialling systems which will hang up and call your system back. The HANGUP options can be B<ON> or B<OFF>.
pl: Opcja HANGUP kontroluje, czy rozłączenie modemu ma być traktowane jako błąd, czy też nie. Przydatne w skryptach do systemów telefonicznych, które rozłączają się i później oddzwaniają. Opcja HANGUP może być włączona (B<ON>) lub wyłączona (B<OFF>).

source: When HANGUP is set OFF and the modem hangs up (e.g., after the first stage of logging in to a callback system), B<chat> will continue running the script (e.g., waiting for the incoming call and second stage login prompt). As soon as the incoming call is connected, you should use the B<HANGUP ON> directive to reinstall normal hang up signal behavior. Here is an (simple) example script:
pl: Gdy HANGUP jest ustawione na OFF i modem rozłącza się (np. po pierwszej fazie logowania do systemu oddzwaniającego) B<chat> kontynuuje wykonywanie skryptu (np. oczekując na połączenie przychodzące i drugą fazę logowania). Zaraz po zawiązaniu połączenia przychodzącego powinno się użyć dyrektywy B<HANGUP ON> w celu ponownego przywrócenia zwykłego zachowania. Oto (prosty) przykładowy skrypt:

source: TIMEOUT
pl: CZAS OCZEKIWANIA

source: To change the timeout value for the next expect string, the following example may be used:
pl: Aby zmienić wartość czasu oczekiwania dla następnego z oczekiwanych napisów, można użyć następującego przykładu:

source: This will change the timeout to 10 seconds when it expects the login: prompt. The timeout is then changed to 5 seconds when it looks for the password prompt.
pl: Zmieni to czas oczekiwania na 10 sekund podczas oczekiwania zachęty login:. Następnie czas oczekiwania jest zmieniany na 5 sekund, podczas oczekiwania na czas oczekiwania password.

source: The timeout, once changed, remains in effect until it is changed again.
pl: Zmieniony czas oczekiwania pozostaje efektywny aż do następnej zmiany.

source: SENDING EOT
pl: WYSYŁANIE EOT
