Repository: sebras/manpages-l10n
Catalog: po/*/man8/checkupdates.8.po
Languages: pt_br

source: Pacman-contrib Manual
pt_br: Manual do pacman-contrib

source: NAME
pt_br: NOME

source: checkupdates - safely print a list of pending updates
pt_br: checkupdates - exibe de forma segura uma lista de atualizações pendentes

source: SYNOPSIS
pt_br: SINOPSE

source: I<checkupdates> [options]
pt_br: I<checkupdates> [opções]

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: Checks for pending updates using a separate Pacman database located in B<TMPDIR> if B<CHECKUPDATES_DB> is not set and outputs a list of updates with the old and new version\&.
pt_br: Verifica se há atualizações pendentes usando uma base de dados do pacman separada localizada em B<TMPDIR> se B<CHECKUPDATES_DB> não estiver definido e gera uma lista de atualizações com a versão antiga e a nova\&.

source: OPTIONS
pt_br: OPÇÕES

source: Download any pending updates to the pacman cache\&.
pt_br: Baixa quaisquer atualizações pendentes para o cache do pacman\&.

source: Do not sync the temporary database, works best when the temporary database is updated regularly through some other means such as a cronjob or systemd timer\&.
pt_br: Não sincroniza a base de dados temporária, funciona melhor quando a base de dados temporária é atualizada regularmente por outros meios, como cronjob ou timer do sistema\&.

source: Display syntax and command line options\&.
pt_br: Exibe a sintaxe e opções de linha de comando\&.

source: ENVIRONMENT
pt_br: AMBIENTE

source: Override the default update db location\&.
pt_br: Sobrescreve o local padrão da base de dados de atualização\&.

source: Overrides the default I</tmp> temporary directory\&.
pt_br: Sobrescreve o diretório temporário padrão I</tmp>\&.

source: ERRORS
pt_br: ERROS

source: On exit, checkupdates will return one of the following error codes\&.
pt_br: Ao sair, checkupdates vai retornar um dos seguintes códigos de erro\&.

source: Normal exit condition\&.
pt_br: Condição de saída normal\&.

source: Unknown cause of failure\&.
pt_br: Causa desconhecida de falha\&.

source: No updates are available\&.
pt_br: Nenhuma atualização está disponível\&.

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: Bugs? You must be kidding; there are no bugs in this software\&. But if we happen to be wrong, file an issue with as much detail as possible at https://gitlab\&.archlinux\&.org/pacman/pacman-contrib/-/issues/new\&.
pt_br: Bugs? Você deve estar brincando; não há erros neste software\&. Mas se por acaso estivermos errados, envie um relatório de erro com o máximo de detalhes possível para https://gitlab\&.archlinux\&.org/pacman/pacman-contrib/-/issues/new\&.

source: AUTHORS
pt_br: AUTORES

source: Current maintainers:
pt_br: Atuais mantenedores:

source: For additional contributors, use git shortlog -s on the pacman-contrib\&.git repository\&.
pt_br: Para contribuidores adicionais, use git shortlog -s no repositório do pacman-contrib\&.git\&.
