Repository: sebras/manpages-l10n
Catalog: po/*/man8/cron.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: crond - daemon to execute scheduled commands
de: crond - Daemon zur geplanten Ausführung von Befehlen

source: SYNOPSIS
de: ÜBERSICHT

source: B<crond> [B<-c> | B<-h> | B<-i> | B<-n> | B<-p> | B<-P> | B<-s> | B<-m>I<E<lt>mail>B<commandE<gt>>]
de: B<crond> [B<-c> | B<-h> | B<-i> | B<-n> | B<-p> | B<-P> | B<-s> | B<-m>I<E<lt>E-Mail-BefehlE<gt>>]

source: DESCRIPTION
de: BESCHREIBUNG

source: I<Cron> is started from I</etc/rc.d/init.d> or I</etc/init.d> when classical sysvinit scripts are used. In case systemd is enabled, then unit file is installed into I</lib/systemd/system/crond.service> and daemon is started by I<systemctl start crond.service> command. It returns immediately, thus, there is no need to need to start it with the '&' parameter.
de: Wenn klassische Sysvinit-Skripte verwendet werden, wird I<cron> über I</etc/rc.d/init.d> oder I</etc/init.d> gestartet. Bei aktiviertem Systemd wird die Unit-Datei in I</lib/systemd/system/crond.service> installiert und der Daemon über den Befehl I<systemctl start crond.service> gestartet. Der Befehl kehrt sofort zurück, daher besteht keine Notwendigkeit, ihn mit dem Parameter B<&> zu starten.

source: I<Cron> searches I</var/spool/cron> for crontab files which are named after accounts in I</etc/passwd;> The found crontabs are loaded into the memory. I<Cron> also searches for I</etc/anacrontab> and any files in the I</etc/cron.d> directory, which have a different format (see B<crontab>(5)). I<Cron> examines all stored crontabs and checks each job to see if it needs to be run in the current minute. When executing commands, any output is mailed to the owner of the crontab (or to the user specified in the I<MAILTO> environment variable in the crontab, if such exists). Any job output can also be sent to syslog by using the B<-s> option.
de: I<Cron> sucht in I</var/spool/cron> nach Crontab-Dateien (»Cron-Tabellen«), die nach den Benutzerkonten in I</etc/passwd> benannt sind. Die gefundenen Crontabs werden in den Speicher geladen. I<Cron> sucht auch nach I</etc/anacrontab> und allen Dateien im Verzeichnis I</etc/cron.d>, die ein anderes Format haben (siehe B<crontab>(5)). I<Cron> untersucht alle gespeicherten Crontabs und überprüft jeden Auftrag, um zu sehen, ob er in der aktuellen Minute ausgeführt werden muss. Beim Ausführen von Befehlen werden alle Ausgaben per lokaler E-Mail an den Besitzer der Crontab gesendet (oder an den in der Umgebungsvariable I<MAILTO> in der Crontab angegebenen Benutzer, sofern diese Variable existiert). Mit der Option B<-s> kann die Ausgabe jedes Auftrags auch an das Systemprotokoll gesendet werden.

source: There are two ways how changes in crontables are checked. The first method is checking the modtime of a file. The second method is using the inotify support. Using of inotify is logged in the I</var/log/cron> log after the daemon is started. The inotify support checks for changes in all crontables and accesses the hard disk only when a change is detected.
de: Es gibt zwei Möglichkeiten zur Überprüfung auf Änderungen in Crontabs. Die erste Methode überprüft die Änderungszeit einer Datei. Die zweite Methode basiert auf der Inotify-Unterstützung. Die Benutzung von Inotify wird in das Protokoll in I</var/log/cron> geschrieben, nachdem der Daemon gestartet wurde. Die Inotify-Unterstützung prüft auf Änderungen in allen Crontabs und greift nur auf die Festplatte zu, wenn eine Änderung erkannt wird.

source: When using the modtime option, I<Cron> checks its crontables' modtimes every minute to check for any changes and reloads the crontables which have changed. There is no need to restart I<Cron> after some of the crontables were modified. The modtime option is also used when inotify can not be initialized.
de: Wenn Sie die auf der Änderungszeit basierende Option verwenden, prüft I<cron> die Änderungszeitstempel der Crontabs jede Minute auf Änderungen und lädt die Crontabs neu, die sich geändert haben. Es besteht keine Notwendigkeit, I<cron> neu zu starten, nachdem einige der Crontabs geändert wurden. Die auf der Änderungszeit basierende Methode wird auch dann angewendet, wenn Inotify nicht initialisiert werden konnte.

source: I<Cron> checks these files and directories:
de: I<Cron> prüft folgende Dateien und Verzeichnisse:

source: system crontab. Nowadays the file is empty by default. Originally it was usually used to run daily, weekly, monthly jobs. By default these jobs are now run through anacron which reads I</etc/anacrontab> configuration file. See B<anacrontab>(5) for more details.
de: Die Crontab des Systems. Heutzutage ist diese Datei standardmäßig leer. Ursprünglich war sie zur täglichen, wöchentlichen oder monatlichen Ausführung von Aufträgen gedacht. Standardmäßig werden diese Aufträge nun durch B<anacron> ausgeführt, welches die Konfigurationsdatei I</etc/anacrontab> liest. In B<anacrontab>(5) finden Sie weitere Details.

source: directory that contains system cronjobs stored for different users.
de: Verzeichnis, das für verschiedene Benutzer gespeicherte System-Cron-Aufträge enthält.

source: directory that contains user crontables created by the I<crontab> command.
de: Verzeichnis, das mit dem Befehl I<crontab> von Benutzern erstellte Crontabs enthält.

source: Note that the B<crontab>(1) command updates the modtime of the spool directory whenever it changes a crontab.
de: Beachten Sie, dass der Befehl B<crontab>(1) die Änderungszeit des Spool-Verzeichnisses immer aktualisiert, wenn es eine Crontab ändert.

source: Daylight Saving Time and other time changes
de: Sommer-/Winterzeitumstellung und andere Zeitänderungen

source: Local time changes of less than three hours, such as those caused by the Daylight Saving Time changes, are handled in a special way. This only applies to jobs that run at a specific time and jobs that run with a granularity greater than one hour. Jobs that run more frequently are scheduled normally.
de: Änderungen der lokalen Zeit von weniger als drei Stunden, wie jene, die durch Sommer-/Winterzeitumstellung hervorgerufen werden, werden auf besondere Weise behandelt. Dies bezieht sich nur auf Aufträge, die zu einem bestimmten Zeitpunkt ausgeführt werden sollen, sowie auf solche mit einer Granularität von mehr als einer Stunde. Aufträge, die häufiger ausgeführt werden, werden normal behandelt.

source: If time was adjusted one hour forward, those jobs that would have run in the interval that has been skipped will be run immediately. Conversely, if time was adjusted backward, running the same job twice is avoided.
de: Wenn die Zeit um eine Stunde vorgestellt wurde, werden die Aufträge, die im übersprungenen Zeitraum ausgeführt werden würden, sofort ausgeführt. Umgekehrt wird beim Zurückstellen der Zeit verhindert, dass der gleiche Auftrag zweimal ausgeführt wird.

source: Time changes of more than 3 hours are considered to be corrections to the clock or the timezone, and the new time is used immediately.
de: Änderungen der Zeit von mehr als drei Stunden werden als Korrekturen der Uhrzeit oder der Zeitzone betrachtet und die neue Zeit sofort angewendet.

source: It is possible to use different time zones for crontables. See B<crontab>(5) for more information.
de: Es ist möglich, für Crontabs verschiedene Zeitzonen zu verwenden. In B<crontab>(5) finden Sie weitere Informationen hierzu.

source: PAM Access Control
de: PAM-Zugriffssteuerung

source: I<Cron> supports access control with PAM if the system has PAM installed. For more information, see B<pam>(8). A PAM configuration file for I<crond> is installed in I</etc/pam.d/crond>. The daemon loads the PAM environment from the pam_env module. This can be overridden by defining specific settings in the appropriate crontab file.
de: I<Cron> unterstützt die Zugriffssteuerung über PAM, sofern auf dem System PAM installiert ist. Weitere Informationen finden Sie in B<pam>(8). Eine PAM-Konfigurationsdatei für I<crond> ist in I</etc/pam.d/crond> installiert. Der Daemon lädt die PAM-Umgebung aus dem Modul B<pam_env>. Dies kann durch Definieren spezifischer Einstellungen in der entsprechenden Crontab-Datei außer Kraft gesetzt werden.

source: OPTIONS
de: OPTIONEN

source: Prints a help message and exits.
de: gibt eine Hilfemeldung aus und beendet das Programm.

source: Disables inotify support.
de: deaktiviert die Inotify-Unterstützung.

source: This option allows you to specify a shell command to use for sending I<Cron> mail output instead of using B<sendmail>(8) This command must accept a fully formatted mail message (with headers) on standard input and send it as a mail message to the recipients specified in the mail headers. Specifying the string I<off> (i.e., crond -m off) will disable the sending of mail.
de: ermöglicht die Angabe des Shell-Befehls, der zum Senden von I<Cron>-E-Mails anstelle von B<sendmail>(8) verwendet werden soll. Dieser Befehl muss eine vollständig formatierte E-Mail-Nachricht (einschließlich Kopfzeilen) über die Standardeingabe akzeptieren und diese als E-Mail-Nachricht an die in den Kopfzeilen der E-Mail angegebenen Empfänger versenden. Die Angabe der Zeichenkette I<off> (das heißt, B<crond -m off>) deaktiviert das Versenden von E-Mails.

source: Tells the daemon to run in the foreground. This can be useful when starting it out of init. With this option is needed to change pam setting. I</etc/pam.d/crond> must not enable I<pam_loginuid.so> module.
de: weist den Daemon an, im Vordergrund zu bleiben. Dies kann nützlich sein, wenn Sie ihn außerhalb von »init« starten. Mit dieser Option ist die Anpassung der PAM-Einstellung notwendig. I</etc/pam.d/crond> darf das Modul I<pam_loginuid.so> nicht aktivieren.

source: the same as -n, consistent with other crond implementations.
de: ist gleichbedeutend mit B<-n>, konsistent mit anderen Implementierungen von B<crond>.

source: Allows I<Cron> to accept any user set crontables.
de: erlaubt I<cron>, alle durch Benutzer angelegte Crontabs zu akzeptieren.

source: Don't set PATH. PATH is instead inherited from the environment.
de: setzt die Umgebungsvariable B<PATH> nicht. Diese wird stattdessen von der Umgebung ererbt.

source: This option enables clustering support, as described below.
de: aktiviert Clustering-Unterstützung, wie nachfolgend beschrieben.

source: This option will direct I<Cron> to send the job output to the system log using B<syslog>(3). This is useful if your system does not have B<sendmail>(8), installed or if mail is disabled.
de: weist I<cron> an, die Ausgabe des Auftrags mittels B<syslog>(3) an das Systemprotokoll zu senden. Dies ist nützlich, wenn Ihr System nicht über ein installiertes B<sendmail>(8) verfügt oder das Versenden von E-Mails deaktiviert ist.

source: This option allows you to set debug flags.
de: erlaubt das Setzen von Debug-Schaltern.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.

source: SIGNALS
de: SIGNALE

source: When the I<SIGHUP> is received, the I<Cron> daemon will close and reopen its log file. This proves to be useful in scripts which rotate and age log files. Naturally, this is not relevant if I<Cron> was built to use I<syslog>(3).
de: Wenn I<SIGHUP> empfangen wird, schließt der I<cron>-Daemon seine Protokolldatei und öffnet diese dann neu. Dies erweist sich in Skripten als nützlich, die Dateien rotieren und altern. Natürlich ist das irrelevant, wenn I<cron> zur Nutzung mit I<syslog>(3) erstellt wurde.

source: CLUSTERING SUPPORT
de: UNTERSTÜTZUNG FÜR CLUSTERING

source: In this version of I<Cron> it is possible to use a network-mounted shared I</var/spool/cron> across a cluster of hosts and specify that only one of the hosts should run the crontab jobs in this directory at any one time. This is done by starting I<Cron> with the B<-c> option, and have the I</var/spool/cron/.cron.hostname> file contain just one line, which represents the hostname of whichever host in the cluster should run the jobs. If this file does not exist, or the hostname in it does not match that returned by B<gethostname>(2), then all crontab files in this directory are ignored. This has no effect on cron jobs specified in the I</etc/crontab> file or on files in the I</etc/cron.d> directory. These files are always run and considered host-specific.
de: In dieser Version von B<cron> ist es möglich, ein über das Netzwerk eingehängtes I</var/spool/cron> über einen Rechner-Cluster zu verwenden und anzugeben, dass niemals mehrere Rechner gleichzeitig die Crontab-Aufträge in diesem Verzeichnis ausführen sollen. Dazu starten Sie B<cron> mit der Option B<-c>, wobei die Datei I</var/spool/cron/.cron.hostname> nur eine einzige Zeile enthält, in der der Name eines ausgewählten Rechners im Cluster angegeben ist, der die Aufträge ausführen soll. Falls diese Datei nicht existiert oder der darin angegebene Rechnername nicht dem entspricht, was B<gethostname>(2) zurückliefert, dann werden alle Crontab-Dateien in diesem Verzeichnis ignoriert. Dies ist bei den in der Datei I</etc/crontab> oder in den im Verzeichnis I</etc/cron.d> angegebenen Dateien wirkungslos. Diese Dateien werden immer ausgeführt und als rechnerspezifisch aufgefasst.

source: Rather than editing I</var/spool/cron/.cron.hostname> directly, use the B<-n> option of B<crontab>(1) to specify the host.
de: Anstatt I</var/spool/cron/.cron.hostname> direkt zu bearbeiten, verwenden Sie die Option B<-n> von B<crontab>(1), um den Rechner anzugeben.

source: You should ensure that all hosts in a cluster, and the file server from which they mount the shared crontab directory, have closely synchronised clocks, e.g., using B<ntpd>(8), otherwise the results will be very unpredictable.
de: Sie sollten sicherstellen, dass die Uhren aller Rechner in einem Cluster und die des Dateiservers, von welchem das gemeinsame Crontab-Verzeichnis eingehängt wird, möglichst exakt synchronisiert sind, zum Beispiel mittels B<ntpd>(8). Anderenfalls werden die Ergebnisse kaum vorhersagbar sein.

source: Using cluster sharing automatically disables inotify support, because inotify cannot be relied on with network-mounted shared file systems.
de: Durch die Nutzung der Cluster-Freigabe wird die Unterstützung für Inotify automatisch deaktiviert, da Inotify mit über das Netzwerk bereitgestellten gemeinsam genutzten Dateisystemen nicht umgehen kann.

source: CAVEATS
de: EINSCHRÄNKUNGEN

source: All B<crontab> files have to be regular files or symlinks to regular files, they must not be executable or writable for anyone else but the owner. This requirement can be overridden by using the B<-p> option on the crond command line. If inotify support is in use, changes in the symlinked crontabs are not automatically noticed by the cron daemon. The cron daemon must receive a SIGHUP signal to reload the crontabs. This is a limitation of the inotify API.
de: Alle B<crontab>-Dateien müssen reguläre Dateien oder Symlinks sein, die auf reguläre Dateien zeigen. Sie dürfen nur vom Eigentümer ausführ- oder schreibbar sein. Diese Voraussetzung kann durch die Option B<-p> in der Befehlszeile von B<crond> überschrieben werden. Falls die Inotify-Unterstützung verwendet wird, wird der Cron-Daemon nicht automatisch über Änderungen in den per Symlink eingebundenen Crontabs benachrichtigt. Der Cron-Daemon muss ein B<SIGHUP>-Signal empfangen, um die Crontabs neu zu laden. Dies ist eine Einschränkung der Inotify-API.

source: The syslog output will be used instead of mail, when sendmail is not installed.
de: Wenn Sendmail nicht installiert ist, werden keine E-Mails versendet, sondern die Ausgabe in das Systemprotokoll geschrieben.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: cron - daemon to execute scheduled commands (Vixie Cron)
de: crond - Daemon zur geplanten Ausführung von Befehlen (Vixie Cron)

source: cron [B<-f>] [B<-l>] [B<-L> I<loglevel>]
de: cron [B<-f>] [B<-l>] [B<-L> I<Protokollierstufe>]

source: I<cron> is started automatically from /etc/init.d on entering multi-user runlevels.
de: I<cron> wird automatisch aus I</etc/init.d> gestartet, sobald Mehrbenutzer-Runlevel erreicht sind.

source: Stay in foreground mode, don't daemonize.
de: bleibt im Vordergrundmodus und wird nicht daemonisiert.

source: Enable LSB compliant names for /etc/cron.d files. This setting, however, does not affect the parsing of files under /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly or /etc/cron.monthly.
de: aktiviert LSB-kompatible Namen für die Dateien in I</etc/cron.d>. Diese Einstellung wirkt sich jedoch nicht auf die Auswertung von Dateien unter I</etc/cron.hourly>, I</etc/cron.daily>, I</etc/cron.weekly> oder I</etc/cron.monthly> aus.

source: Include the FQDN in the subject when sending mails. By default, cron will abbreviate the hostname.
de: bezieht den FQDN (den vollständigen Rechnernamen) beim Versenden von E-Mails im Betreff ein. Standardmäßig kürzt B<cron> den Rechnernamen ab.

source: B<-L loglevel>
de: B<-L> I<Protokollierstufe>

source: Tell cron what to log about B<jobs> (errors are logged regardless of this value) as the sum of the following values:
de: teilt B<cron> mit, was über B<Aufträge> als Summe der folgenden Werte protokolliert werden soll (Fehler werden unabhängig von diesem Wert protokolliert):

source: will log the start of all cron jobs
de: protokolliert den Start aller Cron-Aufträge.

source: will log the end of all cron jobs
de: protokolliert das Ende aller Cron-Aufträge.

source: will log all failed jobs (exit status != 0)
de: protokolliert alle fehlgeschlagenen Aufträge (Exit-Status != 0).

source: will log the process number of all cron jobs
de: protokolliert die Prozessnummer aller Cron-Aufträge.

source: The default is to log the start of all jobs (1). Logging will be disabled if I<levels> is set to zero (0). A value of fifteen (15) will select all options.
de: Die Vorgabe ist die Protokollierung des Starts aller Aufträge (1). Die Protokollierung wird deaktiviert, wenn die I<Protokollierstufe> auf Null (0) gesetzt ist. Ein Wert von 15 wählt alle Optionen aus.

source: NOTES
de: ANMERKUNGEN

source: I<cron> searches its spool area (/var/spool/cron/crontabs) for crontab files (which are named after accounts in /etc/passwd); crontabs found are loaded into memory. Note that crontabs in this directory should not be accessed directly - the I<crontab> command should be used to access and update them.
de: I<cron> durchsucht seinen Spool-Bereich (I</var/spool/cron/crontabs>) nach Crontab-Dateien (die nach den Benutzerkonten in I</etc/passwd> benannt sind). Die gefundenen Crontabs werden in den Speicher geladen. Beachten Sie, dass auf Crontabs in diesem Verzeichnis nicht direkt zugegriffen werden sollte - zum Zugriff und zur Aktualisierung sollte der Befehl I<crontab> verwendet werden.

source: I<cron> also reads /etc/crontab, which is in a slightly different format (see I<crontab>(5)). In Debian, the content of /etc/crontab is predefined to run programs under /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly and /etc/cron.monthly. This configuration is specific to Debian, see the note under B<DEBIAN SPECIFIC> below.
de: I<cron> liest auch die Datei /etc/crontab, die ein etwas anderes Format hat (siehe I<crontab>(5)). Unter Debian ist der Inhalt der Datei /etc/crontab so vordefiniert, dass Programme unter /etc/cron.hourly, /etc/ron.daily, /etc/cron.weekly und /etc/cron.monthly ausgeführt werden. Diese Konfiguration ist Debian-spezifisch; lesen Sie dazu den nachfolgenden Hinweis B<DEBIAN-SPEZIFISCH>.

source: Additionally, in Debian, I<cron> reads the files in the /etc/cron.d directory. I<cron> treats the files in /etc/cron.d as in the same way as the /etc/crontab file (they follow the special format of that file, i.e.\& they include the I<user> field). However, they are independent of /etc/crontab: they do not, for example, inherit environment variable settings from it. This change is specific to Debian see the note under B<DEBIAN SPECIFIC> below.
de: Unter Debian liest I<cron> zusätzlich die Dateien im Verzeichnis /etc/cron.d. I<cron> behandelt die Dateien in /etc/cron.d auf die gleiche Weise wie die Datei /etc/crontab (sie folgen dem besonderen Format dieser Datei, das heißt, sie enthalten das Feld I<user>). Allerdings sind sie von /etc/crontab unabhängig: Sie erben beispielsweise nicht die Werte der Umgebungsvariablen. Diese Abweichung ist Debian-spezifisch; lesen Sie dazu den Hinweis B<DEBIAN-SPEZIFISCH> unten.

source: Like /etc/crontab, the files in the /etc/cron.d directory are monitored for changes. In general, the system administrator should not use /etc/cron.d/, but use the standard system crontab /etc/crontab.
de: Wie /etc/crontab werden die Dateien im Verzeichnis /etc/cron.d auf Änderungen überwacht. Im Allgemeinen sollte der Systemverwalter nicht /etc/cron.d/, sondern die Standarddatei des Systems /etc/crontab verwenden.

source: /etc/crontab and the files in /etc/cron.d must be owned by root, and must not be group- or other-writable. In contrast to the spool area, the files under /etc/cron.d or the files under /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly and /etc/cron.monthly may also be symlinks, provided that both the symlink and the file it points to are owned by root. The files under /etc/cron.d do not need to be executable, while the files under /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly and /etc/cron.monthly do, as they are run by I<run-parts> (see I<run-parts>(8) for more information).
de: Die Datei /etc/crontab und die Dateien in /etc/cron.d müssen Root gehören und dürfen nicht für die Gruppe oder für Andere schreibbar sein. Im Gegensatz zum Spool-Bereich dürfen die Dateien unter /etc/cron.d, /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly und /etc/cron.monthly auch Symlinks sein. Das setzt allerdings voraus, dass sowohl der Symlink als auch die Datei, auf die er zeigt, Root gehören. Die Dateien unter /etc/cron.d müssen nicht ausführbar sein, während die Dateien unter /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly und /etc/cron.monthly ausführbar sein dürfen, weil sie von I<run-parts> ausgeführt werden (siehe I<run-parts>(8) für weitere Informationen).

source: I<cron> then wakes up every minute, examining all stored crontabs, checking each command to see if it should be run in the current minute. When executing commands, any output is mailed to the owner of the crontab (or to the user named in the MAILTO environment variable in the crontab, if such exists) from the owner of the crontab (or from the email address given in the MAILFROM environment variable in the crontab, if such exists). The children copies of cron running these processes have their name coerced to uppercase, as will be seen in the syslog and ps output.
de: I<cron> wacht dann jede Minute auf, untersucht alle gespeicherten Crontabs und prüft jeden Befehl, um zu sehen, ob er in der aktuellen Minute ausgeführt werden sollte. Beim Ausführen von Befehlen werden alle Ausgaben per E-Mail an den Eigentümer der Crontab-Datei (oder an den Benutzer, der in der Umgebungsvariable B<MAILTO>, falls diese existiert, genannt ist) vom Eigentümer der Crontab (oder von der E-Mail-Adresse, die in der Crontab aufgeführten Umgebungsvariable MAILFROM genannt ist, falls diese existiert) versendet. Bei den Kind-Kopien von B<cron>, unter denen diese Prozesse ausgeführt werden, wird der Name in Großbuchstaben umgewandelt, wie in den Ausgaben von B<syslog> und B<ps> zu sehen ist.
