Repository: sebras/manpages-l10n
Catalog: po/*/man8/cron.8.po
Languages: de

source: Additionally, I<cron> checks each minute to see if its spool directory's modtime (or the modtime on the I</etc/crontab> file) has changed, and if it has, I<cron> will then examine the modtime on all crontabs and reload those which have changed. Thus I<cron> need not be restarted whenever a crontab file is modified. Note that the I<crontab>(1) command updates the modtime of the spool directory whenever it changes a crontab.
de: Zusätzlich prüft I<cron> jede Minute, ob sich die Änderungszeit des Spool-Verzeichnisses (oder die Änderungszeit der Datei I</etc/crontab>) geändert hat. Falls dem so ist, untersucht B<cron> dann die Änderungszeit aller Crontabs und lädt jene neu, die sich geändert haben. Daher muss I<cron> nicht immer neu gestartet werden, wenn sich eine Crontab-Datei geändert hat. Beachten Sie, dass der Befehl I<crontab>(1) immer dann die Änderungszeit des Spool-Verzeichnisses aktualisiert, wenn es eine Crontab-Datei ändert.

source: Special considerations exist when the clock is changed by less than 3 hours, for example at the beginning and end of daylight savings time. If the time has moved forwards, those jobs which would have run in the time that was skipped will be run soon after the change. Conversely, if the time has moved backwards by less than 3 hours, those jobs that fall into the repeated time will not be re-run.
de: Änderungen der Uhrzeit um weniger als drei Stunden müssen besonders berücksichtigt werden, zum Beispiel am Beginn oder Ende der Sommerzeit. Wenn die Uhr vorgestellt wurde, werden die Aufträge, die in der übersprungenen Zeit ausgeführt werden würden, baldmöglichst nach der Änderung ausgeführt. Umgekehrt werden bei einer Zurückstellung um weniger als drei Stunden die Aufträge, die in die wiederholte Zeitspanne fallen, nicht erneut ausgeführt.

source: Only jobs that run at a particular time (not specified as @hourly, nor with '*' in the hour or minute specifier) are affected. Jobs which are specified with wildcards are run based on the new time immediately.
de: Nur Aufträge, die zu einer bestimmten Zeit ausgeführt werden (die weder als @hourly noch als »*« in der Stunden- oder Minutenangabe angegeben sind), sind davon betroffen. Aufträge, die mit Platzhaltern angegeben sind, werden basierend auf der neuen Zeit unmittelbar ausgeführt.

source: Clock changes of more than 3 hours are considered to be corrections to the clock, and the new time is used immediately.
de: Änderungen der Zeit von mehr als drei Stunden werden als Korrekturen der Uhrzeit betrachtet und die neue Zeit sofort angewendet.

source: I<cron> logs its action to the syslog facility 'cron', and logging may be controlled using the standard I<syslogd>(8) facility.
de: I<cron> speichert seine Aktionen in der Systemprotokolleinrichtung »cron«. Die Protokollierung kann mit dem Standardwerkzeug I<syslogd>(8) gesteuert werden.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If configured in I</etc/default/cron> in Debian systems, the I<cron> daemon localisation settings environment can be managed through the use of I</etc/environment> or through the use of I</etc/default/locale> with values from the latter overriding values from the former. These files are read and they will be used to setup the LANG, LC_ALL, and LC_CTYPE environment variables. These variables are then used to set the charset of mails, which defaults to 'C'.
de: Falls auf Debian-Systemen in der Datei I</etc/default/cron> konfiguriert, können die Locale-Einstellungen für den I<cron>-Daemon mittels I</etc/environment> oder I</etc/default/locale> verwaltet werden, wobei die Werte des Letzteren Vorrang haben. Diese Dateien werden gelesen und zum Setzen der Umgebungsvariablen B<LANG>, B<LC_ALL> und B<LC_CTYPE> verwendet. Diese Variablen dienen dann zum Festlegen des Zeichensatzes für E-Mails, der standardmäßig auf »C« gesetzt ist.

source: This does B<NOT> affect the environment of tasks running under cron. For more information on how to modify the environment of tasks, consult I<crontab>(5).
de: Dies beeinflusst B<NICHT> die Umgebung von Aufgaben, die unter I<cron> ausgeführt werden. Weitere Informationen, wie Sie die Umgebung von Aufgaben anpassen können, finden Sie in B<crontab>(5).

source: The daemon will use, if present, the definition from I</etc/timezone> for the timezone.
de: Der Daemon verwendet (falls vorhanden) die Definition aus I</etc/timezone> für die Zeitzone.

source: The environment can be redefined in user's crontab definitions but I<cron> will only handle tasks in a single timezone.
de: Die Umgebung kann in den Crontab-Definitionen der Benutzer neu eingerichtet werden, aber I<cron> führt Aufgaben nur in einer einzelnen Zeitzone aus.

source: DEBIAN SPECIFIC
de: DEBIAN-SPEZIFISCH

source: Debian introduces some changes to I<cron> that were not originally available upstream. The most significant changes introduced are:
de: Debian führt einige Änderungen an I<cron> ein, die bei den Originalautoren ursprünglich nicht verfügbar waren. Die wichtigsten Änderungen sind:

source: Support for /etc/cron.{hourly,daily,weekly,monthly} via /etc/crontab,
de: Unterstützung für /etc/cron.{hourly,daily,weekly,monthly} mittels /etc/crontab,

source: Support for /etc/cron.d (drop-in dir for package crontabs),
de: Unterstützung für /etc/cron.d (Ergänzungsverzeichnis für Crontabs von Paketen),

source: PAM support,
de: PAM-Unterstützung,

source: SELinux support,
de: SELinux-Unterstützung,

source: auditlog support,
de: Auditprotokoll-Unterstützung,

source: DST and other time-related changes/fixes,
de: Sommer-/Winterzeitumstellung und weitere zeitbezogene Änderungen und Korrekturen,

source: SGID crontab(1) instead of SUID root,
de: SGID crontab(1) anstelle von SUID root,

source: Debian-specific file locations and commands,
de: Debian-spezifische Dateispeicherorte und Befehle,

source: Debian-specific configuration (/etc/default/cron),
de: Debian-spezifische Konfiguration (/etc/default/cron),

source: numerous other smaller features and fixes.
de: sowie einige weitere kleinere Funktionalitäten und Korrekturen.

source: Support for /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly and /etc/cron.monthly is provided in Debian through the default setting of the /etc/crontab file (see the system-wide example in I<crontab>(5)). The default system-wide crontab contains four tasks: run every hour, every day, every week and every month. Each of these tasks will execute B<run-parts> providing each one of the directories as an argument. These tasks are disabled if B<anacron> is installed (except for the hourly task) to prevent conflicts between both daemons.
de: Unterstützung für /etc/cron.hourly, /etc/cron.daily, /etc/cron.weekly und /etc/cron.monthly wird unter Debian über die Standardeinstellung der Datei /etc/crontab bereitgestellt (siehe das systemweite Beispiel in I<crontab>(5)). Die standardmäßige systemweite Crontab enthält vier Aufgaben: Ausführung jede Stunde, jeden Tag, jede Woche und jeden Monat. Jede dieser Aufgaben führt B<run-parts> aus, wobei jedes der Verzeichnisse als Argument übergeben wird. Diese Aufgaben sind deaktiviert, falls B<anacron> installiert ist (außer für die stündlich auszuführenden Aufgaben), um Konflikte zwischen beiden Daemons zu vermeiden.

source: As described above, the files under these directories have to pass some sanity checks including the following: be executable, be owned by root, not be writable by group or other and, if symlinks, point to files owned by root. Additionally, the file names must conform to the filename requirements of B<run-parts>: they must be entirely made up of letters, digits and can only contain the special signs underscores ('_') and hyphens ('-'). Any file that does not conform to these requirements will not be executed by B<run-parts>. For example, any file containing dots will be ignored. This is done to prevent cron from running any of the files that are left by the Debian package management system when handling files in /etc/cron.d/ as configuration files (i.e.\& files ending in \&.dpkg-dist, \&.dpkg-orig, \&.dpkg-old, and \&.dpkg-new).
de: Wie oben beschrieben, müssen die Dateien in diesen Verzeichnissen einige Plausibilitätsprüfungen durchlaufen, wie folgende: Sie müssen ausführbar sein, sie müssen Root gehören, sie dürfen von der Gruppe oder anderen nicht schreibbar sein und, falls es Symlinks sind, auf Dateien zeigen, die Root gehören. Zusätzlich müssen die Dateinamen den Erfordernissen von B<run-parts> genügen: Sie dürfen nur aus Buchstaben, Ziffern und den speziellen Zeichen Unterstrich (»_«) und Bindestrich (»-«) bestehen. Jede Datei, die diese Voraussetzungen nicht erfüllt, wird von B<run-parts> nicht ausgeführt. Beispielsweise werden alle Dateien ignoriert, deren Namen Punkte enthalten. Dadurch wird B<cron> daran gehindert, Dateien auszuführen, welche die Debian-Paketverwaltung bei der Verarbeitung von Dateien in /etc/cron.d/ als Konfigurationsdateien hinterlassen hat (das heißt, Dateien mit den Endungen \&.dpkg-dist, \&.dpkg-orig und \&.dpkg-new).

source: This feature can be used by system administrators and packages to include tasks that will be run at defined intervals. Files created by packages in these directories should be named after the package that supplies them.
de: Diese Funktionalität kann von Systemverwaltern und Paketen verwendet werden, um Aufgaben einzubeziehen, die in definierten Abständen ausgeführt werden sollen. Dateien, die von Paketen in diesen Verzeichnissen erstellt wurden, sollten nach dem Paket benannt werden, das sie dort erstellt hat.

source: Support for /etc/cron.d is included in the I<cron> daemon itself, which handles this location as the system-wide crontab spool. This directory can contain any file defining tasks following the format used in /etc/crontab, i.e.\& unlike the user cron spool, these files must provide the username to run the task as in the task definition.
de: Unterstützung für /etc/cron.d ist im I<cron>-Daemon selbst enthalten, der diesen Ort als systemweiter Crontab-Spool behandelt. Dieses Verzeichnis kann beliebige Dateien enthalten, welche Aufgaben definieren, die dem in der Datei /etc/crontab verwendeten Format folgen. Das heißt, dass diese Dateien - im Gegensatz zum Benutzer-Spool von I<cron> - den Benutzernamen in der Aufgabendefinition bereitstellen müssen, unter dem die Aufgaben ausgeführt werden sollen.

source: Files in this directory have to be owned by root, do not need to be executable (they are configuration files, just like /etc/crontab) and must conform to the same naming convention as used by I<run-parts>(8) : they must consist solely of upper- and lower-case letters, digits, underscores, and hyphens. This means that they B<cannot> contain any dots. If the B<-l> option is specified to I<cron> (this option can be setup through /etc/default/cron, see below), then they must conform to the LSB namespace specification, exactly as in the B<--lsbsysinit> option in I<run-parts>.
de: Dateien in diesem Verzeichnis müssen Root gehören, müssen nicht ausführbar sein (es sind Konfigurationsdateien, genau wie /etc/crontab) und müssen zur Benennungskonvention von I<run-parts>(8) konform sein: Sie dürfen nur aus Groß- und Kleinbuchstaben, Ziffern, Unterstrichen und Bindestrichen bestehen. Das bedeutet, dass sie B<keine Punkte> enthalten dürfen. Falls die Option B<-l> an B<cron> übergeben wird (die Sie in /etc/default/cron einrichten können, siehe unten), dann müssen sie der LSB-Namensraumspezifikation entsprechen, genau wie bei der Option B<--lsbsysinit> von I<run-parts>.

source: The intended purpose of this feature is to allow packages that require finer control of their scheduling than the /etc/cron.{hourly,daily,weekly,monthly} directories to add a crontab file to /etc/cron.d. Such files should be named after the package that supplies them.
de: Pakete, die eine feinere Kontrolle über ihre Planung benötigen, als es in den Verzeichnissen /etc/cron.{hourly,daily,weekly,monthly} möglich ist, soll mit dieser Funktionalität ermöglicht werden, eine Crontab-Datei zu /etc/cron.d hinzuzufügen. Solche Dateien sollten nach dem Paket benannt werden, das sie dort bereitgestellt hat.

source: Also, the default configuration of I<cron> is controlled by I</etc/default/cron> which is read by the init.d script that launches the I<cron> daemon. This file determines whether I<cron> will read the system's environment variables and makes it possible to add additional options to the I<cron> program before it is executed, either to configure its logging or to define how it will treat the files under /etc/cron.d.
de: Die Standardkonfiguration von I<cron> wird auch durch die Datei I</etc/default/cron> beeinflusst, welche vom init.d-Skript gelesen wird, das den I<cron>-Daemon startet. Diese Datei bestimmt, ob I<cron> die Umgebungsvariablen des Systems liest und es ermöglicht, vor der Ausführung von I<cron> zusätzliche Optionen hinzuzufügen, entweder zum Einrichten von dessen Protokollierung oder um festzulegen, wie die Dateien in /etc/cron.d behandelt werden sollen.

source: crontab(1), crontab(5), run-parts(8)
de: B<crontab>(1), B<crontab>(5), B<run-parts>(8)

source: Paul Vixie E<lt>paul@vix.comE<gt> is the author of I<cron> and original creator of this manual page. This page has also been modified for Debian by Steve Greenland, Javier Fernandez-Sanguino and Christian Kastner.
de: Paul Vixie E<lt>paul@vix.comE<gt> ist der Autor von I<cron> und der ursprüngliche Verfasser dieser Handbuchseite. Diese Handbuchseite wurde für Debian von Steve Greenland, Javier Fernandez-Sanguino und Christian Kastner angepasst.

source: I<Cron> searches I</var/spool/cron> for crontab files which are named after accounts in I</etc/passwd;> The found crontabs are loaded into the memory. I<Cron> also searches for I</etc/crontab> and any files in the I</etc/cron.d> directory, which have a different format (see B<crontab>(5)). I<Cron> examines all stored crontabs and checks each job to see if it needs to be run in the current minute. When executing commands, any output is mailed to the owner of the crontab (or to the user specified in the I<MAILTO> environment variable in the crontab, if such exists). Any job output can also be sent to syslog by using the B<-s> option.
de: I<Cron> sucht in I</var/spool/cron> nach Crontab-Dateien (»Cron-Tabellen«), die nach den Benutzerkonten in I</etc/passwd> benannt sind. Die gefundenen Crontabs werden in den Speicher geladen. I<Cron> sucht auch nach I</etc/crontab> und allen Dateien im Verzeichnis I</etc/cron.d>, die ein anderes Format haben (siehe B<crontab>(5)). I<Cron> untersucht alle gespeicherten Crontabs und überprüft jeden Auftrag, um zu sehen, ob er in der aktuellen Minute ausgeführt werden muss. Beim Ausführen von Befehlen werden alle Ausgaben per lokaler E-Mail an den Besitzer der Crontab gesendet (oder an den in der Umgebungsvariable I<MAILTO> in der Crontab angegebenen Benutzer, sofern diese Variable existiert). Mit der Option B<-s> kann die Ausgabe jedes Auftrags auch an das Systemprotokoll gesendet werden.
