Repository: sebras/manpages-l10n
Catalog: po/*/man8/dnf-reposync.8.po
Languages: de

source: Mar 14, 2022
de: 14. März 2022

source: NAME
de: BEZEICHNUNG

source: dnf-reposync - DNF reposync Plugin
de: reposync - Reposync-Plugin von DNF

source: Synchronize packages of a remote DNF repository to a local directory.
de: Pakete einer fernen DNF-Paketquelle mit einem lokalen Verzeichnis abgleichen.

source: SYNOPSIS
de: ÜBERSICHT

source: B<dnf reposync [options]>
de: B<dnf reposync [Optionen]>

source: DESCRIPTION
de: BESCHREIBUNG

source: I<reposync> makes local copies of remote repositories. Packages that are already present in the local directory are not downloaded again.
de: I<reposync> erstellt lokale Kopien einer fernen Paketquelle. Pakete, die bereits im lokalen Verzeichnis vorhanden sind, werden nicht erneut heruntergeladen.

source: OPTIONS
de: OPTIONEN

source: All general DNF options are accepted. Namely, the B<--repoid> option can be used to specify the repositories to synchronize. See I<Options> in B<dnf(8)> for details.
de: Alle allgemeinen DNF-Optionen werden akzeptiert. Insbesondere kann die Option B<--repoid> zur Angabe der abzugleichenden Paketquellen verwendet werden. Siehe I<Optionen> in B<dnf>(8) für Details.

source: B<-a E<lt>architectureE<gt>, --arch=E<lt>architectureE<gt>>
de: B<-a E<lt>ArchitekturE<gt>, --arch=E<lt>ArchitekturE<gt>>

source: Download only packages of given architectures (default is all architectures). Can be used multiple times.
de: lädt nur Pakete der angegebenen Architekturen herunter (standardmäßig alle Architekturen). Dies kann mehrmals angegeben werden.

source: Delete local packages no longer present in repository.
de: löscht lokale Pakete, die in der Paketquelle nicht mehr vorhanden sind.

source: Download all repository metadata. Downloaded copy is instantly usable as a repository, no need to run createrepo_c on it.
de: lädt alle Paketquellen-Metadaten herunter. Die heruntergeladene Kopie ist sofort als Paketquelle verwendbar, ohne dass B<createrepo_c> ausgeführt werden muss.

source: Remove packages that fail GPG signature checking after downloading. Exit code is B<1> if at least one package was removed. Note that for repositories with B<gpgcheck=0> set in their configuration the GPG signature is not checked even with this option used.
de: entfernt Pakete, die nach dem Herunterladen die Überprüfung der GPG-Signatur nicht bestanden haben. Der Exit-Code ist B<1>, falls mindestens ein Paket entfernt wurde. Beachten Sie, dass für Paketquellen, für die B<gpgcheck=0> in deren Konfiguration gesetzt ist, auch bei Verwendung dieser Option die GPG-Signatur nicht überprüft wird.

source: Also download and uncompress comps.xml. Consider using B<--download-metadata> option which will download all available repository metadata.
de: lädt auch die Datei comps.xml herunter und entpackt sie. Ziehen Sie stattdessen die Option B<--download-metadata> in Betracht, mit der sämtliche verfügbaren Metadaten heruntergeladen werden.

source: Root path under which the downloaded metadata are stored. It defaults to B<--download-path> value if not given.
de: gibt den Wurzelpfad an, unter dem die heruntergeladenen Metadaten gespeichert werden. Standardmäßig B<--download-path>, falls nicht angegeben.

source: Download only newest packages per-repo.
de: lädt nur die neuesten Pakete herunter (auf die Paketquelle bezogen).

source: Don\(aqt add the reponame to the download path. Can only be used when syncing a single repository (default is to add the reponame).
de: fügt den Namen der Paketquelle nicht zum Downloadpfad hinzu. Dies kann nur verwendet werden, wenn eine einzelne Paketquelle abgeglichen wird (standardmäßig wird der Name der Paketquelle hinzugefügt).

source: B<-p E<lt>download-pathE<gt>, --download-path=E<lt>download-pathE<gt>>
de: B<-p E<lt>DownloadpfadE<gt>, --download-path=E<lt>DownloadpfadE<gt>>

source: Root path under which the downloaded repositories are stored, relative to the current working directory. Defaults to the current working directory. Every downloaded repository has a subdirectory named after its ID under this path.
de: gibt den Wurzelpfad an, unter dem die heruntergeladenen Paketquellen gespeichert sind, relativ zum aktuellen Arbeitsverzeichnis. Standardmäßig ist dies das aktuelle Arbeitsverzeichnis. Jede heruntergeladene Paketquelle hat ein Unterverzeichnis in diesem Pfad, das nach der Kennung der Paketquelle benannt ist.

source: Try to set the timestamps of the downloaded files to those on the remote side.
de: versucht, die Zeitstempel der heruntergeladenen Dateien auf die Zeitstempel der fernen Dateien zu setzen.

source: Download only source packages.
de: lädt nur Quellpakete herunter.

source: Just print urls of what would be downloaded, don\(aqt download.
de: listet die Adressen dessen auf, was heruntergeladen werden würde, lädt aber tatsächlich nichts herunter.

source: EXAMPLES
de: BEISPIELE

source: B<dnf reposync --repoid=the_repo>
de: B<dnf reposync --repoid=das_Repo>

source: Synchronize all packages from the repository with id "the_repo". The synchronized copy is saved in "the_repo" subdirectory of the current working directory.
de: gleicht alle Pakete aus der Paketquelle mit der Kennung »das_Repo« ab. Die abgeglichene Kopie wird im Unterverzeichnis »das_Repo« des aktuellen Arbeitsverzeichnisses gespeichert.

source: B<dnf reposync -p /my/repos/path --repoid=the_repo>
de: B<dnf reposync -p /Pfad/zu/meinen/Repos --repoid=das_Repo>

source: Synchronize all packages from the repository with id "the_repo". In this case files are saved in "/my/repos/path/the_repo" directory.
de: gleicht alle Pakete aus der Paketquelle »das_Repo« ab. In diesem Fall werden Dateien im Verzeichnis »/Pfad/zu/meinen/Paketquellen/das_Repo« gespeichert.

source: B<dnf reposync --repoid=the_repo --download-metadata>
de: B<dnf reposync --repoid=das_Repo --download-metadata>

source: Synchronize all packages and metadata from "the_repo" repository.
de: gleicht alle Pakete und Metadaten aus der Paketquelle »das_Repo« ab.

source: Repository synchronized with B<--download-metadata> option can be directly used in DNF for example by using B<--repofrompath> option:
de: Mit der Option B<--download-metadata> abgeglichene Paketquellen können in DNF direkt verwendet werden, beispielsweise mit der Option B<--repofrompath>:

source: B<dnf --repofrompath=syncedrepo,the_repo --repoid=syncedrepo list --available>
de: B<dnf --repofrompath=abgeglichenes_Repo,das_Repo --repoid=abgeglichenes_Repo list --available>

source: SEE ALSO
de: SIEHE AUCH

source: B<dnf(8)>, DNF Command Reference
de: B<dnf>(8), DNF-Befehlsreferenz

source: AUTHOR
de: AUTOR

source: See AUTHORS in your Core DNF Plugins distribution
de: Siehe AUTHORS im Paket der Core DNF Plugins.

source: 2022, Red Hat, Licensed under GPLv2+
de: 2022, Red Hat, lizenziert unter GPLv2+

source: May 27, 2022
de: 27. Mai 2022

source: Jun 01, 2022
de: 1. Juni 2022

source: 2014, Red Hat, Licensed under GPLv2+
de: 2014, Red Hat, lizenziert unter GPLv2+

source: Nov 03, 2021
de: 3. November 2021

source: 2021, Red Hat, Licensed under GPLv2+
de: 2021, Red Hat, lizenziert unter GPLv2+

source: Mar 27, 2022
de: 27. März 2022
