Repository: sebras/manpages-l10n
Catalog: po/*/man8/dnf-needs-restarting.8.po
Languages: de

source: Mar 15, 2021
de: 15. März 2021

source: NAME
de: BEZEICHNUNG

source: dnf-needs-restarting - DNF needs_restarting Plugin
de: dnf-needs-restarting - needs_restarting-Plugin von DNF

source: Check for running processes that should be restarted.
de: Prüft auf laufende Prozesse, die neu gestartet werden sollten.

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: I<needs-restarting> looks through running processes and tries to detect those that use files from packages that have been updated after the given process started. Such processes are reported by this tool.
de: I<needs-restarting> durchsucht laufende Prozesse und versucht diejenigen zu erkennen, die Dateien aus Paketen verwenden, die nach dem Start des angegebenen Prozesses aktualisiert wurden. Solche Prozesse werden von diesem Werkzeug gemeldet.

source: Note that in most cases a process should survive update of its binary and libraries it is using without requiring to be restarted for proper operation. There are however specific cases when this does not apply. Separately, processes often need to be restarted to reflect security updates.
de: Beachten Sie, dass ein Prozess in den meisten Fällen eine Aktualisierung seiner Programmdatei und der von ihm genutzten Bibliotheken überleben sollte und weiter korrekt läuft, ohne dass er neu gestartet werden müsste. Es gibt allerdings besondere Fälle, in denen dies nicht zutrifft. Außerdem müssen Prozesse oft neu gestartet werden, damit Sicherheitsaktualisierungen wirksam werden können.

source: OPTIONS
de: OPTIONEN

source: All general DNF options are accepted, see I<Options> in B<dnf(8)> for details.
de: Alle allgemeinen DNF-Optionen werden akzeptiert, siehe I<Optionen> in B<dnf>(8) für Details.

source: Only consider processes belonging to the running user.
de: berücksichtigt nur Prozesse des ausführenden Benutzers.

source: Only report whether a reboot is required (exit code 1) or not (exit code 0).
de: meldet nur, ob ein Neustart des Systems erforderlich ist (Exit-Code 1) oder nicht (Exit-Code 0).

source: Only list the affected systemd services.
de: listet nur die betroffenen Systemd-Dienste auf.

source: AUTHOR
de: AUTOR

source: See AUTHORS in your Core DNF Plugins distribution
de: Siehe AUTHORS im Paket der Core DNF Plugins.

source: 2014, Red Hat, Licensed under GPLv2+
de: 2014, Red Hat, lizenziert unter GPLv2+
