Repository: sebras/manpages-l10n
Catalog: po/*/man8/dnf-config-manager.8.po
Languages: de

source: Mar 14, 2022
de: 14. März 2022

source: NAME
de: BEZEICHNUNG

source: dnf-config-manager - DNF config-manager Plugin
de: dnf-config-manager - Config-Manager-Plugin von DNF

source: Manage main and repository DNF configuration options, toggle which repositories are enabled or disabled, and add new repositories.
de: Kann die Optionen der DNF-Konfiguration verwalten, Paketquellen aktivieren oder deaktivieren und neue Paketquellen hinzufügen.

source: SYNOPSIS
de: ÜBERSICHT

source: B<dnf config-manager [options] E<lt>sectionE<gt>...>
de: B<dnf config-manager [Optionen] E<lt>AbschnittE<gt> …>

source: ARGUMENTS
de: ARGUMENTE

source: B<E<lt>sectionE<gt>>
de: B<E<lt>AbschnittE<gt>>

source: This argument can be used to explicitly select the configuration sections to manage. A section can either be B<main> or a repoid. If not specified, the program will select the B<main> section and each repoid used within any B<--setopt> options. A repoid can be specified using globs.
de: Dieses Argument kann zur expliziten Auswahl der zu verwaltenden Konfigurationsabschnitte verwendet werden. Ein Abschnitt kann entweder als B<main> oder als Paketquellen-ID angegeben werden. Falls nichts angegeben ist, wählt das Programm den Abschnitt B<main> und jede der innerhalb der Option B<--setopt> verwendete Paketquellen-ID. Eine Paketquellen-ID kann mittels Platzhaltern angegeben werden.

source: OPTIONS
de: OPTIONEN

source: All general DNF options are accepted, see I<Options> in B<dnf(8)> for details.
de: Alle allgemeinen DNF-Optionen werden akzeptiert, siehe I<Optionen> in B<dnf>(8) für Details.

source: Show this help.
de: zeigt die Hilfe an.

source: Add (and enable) the repo from the specified file or url. If it has to be added into installroot, combine it with B<--setopt=reposdir=/E<lt>installrootE<gt>/etc/yum.repos.d> command-line option.
de: fügt die Paketquelle aus der angegebenen Datei oder URL hinzu und aktiviert sie. Falls Sie zur Installationswurzel hinzugefügt werden muss, kombinieren Sie sie mit der Befehlszeilenoption B<--setopt=reposdir=/E<lt>installrootE<gt>/etc/yum.repos.d>.

source: Print dump of current configuration values to stdout.
de: schreibt die aktuellen Konfigurationswerte in die Standardausgabe.

source: Disable the specified repos (implies B<--save>).
de: deaktiviert die angegebenen Paketquellen (impliziert B<--save>).

source: Enable the specified repos (implies B<--save>).
de: aktiviert die angegebenen Paketquellen (impliziert B<--save>).

source: Save the current options (useful with B<--setopt>).
de: speichert die aktuellen Optionen (nützlich mit B<--setopt>).

source: B<--setopt=E<lt>optionE<gt>=E<lt>valueE<gt>>
de: B<--setopt=E<lt>OptionE<gt>=E<lt>WertE<gt>>

source: Set a configuration option. To set configuration options for repositories, use B<repoid.option> for the B<E<lt>optionE<gt>>\&. Globs are supported in repoid.
de: setzt eine Konfigurationsoption. Um Konfigurationsoptionen für Paketquellen zu setzen, verwenden Sie B<Paketquellen-ID.Option> für die B<E<lt>OptionE<gt>>\&. In der Paketquellen-ID werden Platzhalter akzeptiert.

source: EXAMPLES
de: BEISPIELE

source: B<dnf config-manager --add-repo http://example.com/some/additional.repo>
de: B<dnf config-manager --add-repo http://example.com/eine/zusätzliche/Paketquelle.repo>

source: Download additional.repo and store it in repodir.
de: lädt Paketquelle.repo herunter und speichert sie im Paketquellenverzeichnis.

source: B<dnf config-manager --add-repo http://example.com/different/repo>
de: B<dnf config-manager --add-repo http://example.com/andere/Paketquelle>

source: Create new repo file with I<\%http://example.com/different/repo> as baseurl and enable it.
de: erstellt eine neue Paketquellendatei mit I<\%http://example.com/andere/Paketquelle> als Basis-URL und aktiviert sie.

source: Display main DNF configuration.
de: zeigt die DNF-Hauptkonfiguration an.

source: B<dnf config-manager --dump E<lt>sectionE<gt>>
de: B<dnf config-manager --dump E<lt>AbschnittE<gt>>

source: Display configuration of a repository identified by E<lt>sectionE<gt>.
de: zeigt die Konfiguration der als E<lt>AbschnittE<gt> angegebenen Paketquelle an.

source: B<dnf config-manager --set-enabled E<lt>repoidE<gt>>
de: B<dnf config-manager --set-enabled E<lt>Paketquellen-IDE<gt>>

source: Enable repository identified by E<lt>repoidE<gt> and make the change permanent.
de: aktiviert die als E<lt>Paketquellen-IDE<gt> angegebene Paketquelle und speichert diese Änderung dauerhaft.

source: B<dnf config-manager --set-disabled E<lt>repoid1E<gt> E<lt>repoid2E<gt>>
de: B<dnf config-manager --set-disabled E<lt>Paketquellen-ID1E<gt> E<lt>Paketquellen-ID2E<gt>>

source: Disable repositories identified by E<lt>repoid1E<gt> and E<lt>repoid2E<gt>
de: deaktiviert die als E<lt>Paketquellen-ID1E<gt> und E<lt>Paketquellen-ID2E<gt> angegebenen Paketquellen.

source: B<dnf config-manager --set-disabled E<lt>repoid1E<gt>,E<lt>repoid2E<gt>>
de: B<dnf config-manager --set-disabled E<lt>Paketquellen-ID1E<gt>,E<lt>Paketquellen-ID2E<gt>>

source: B<dnf config-manager --save --setopt=*.proxy=http://proxy.example.com:3128/ E<lt>repo1E<gt> E<lt>repo2E<gt>>
de: B<dnf config-manager --save --setopt=*.proxy=http://proxy.example.com:3128/ E<lt>Paketquelle1E<gt> E<lt>Paketquelle2E<gt>>

source: Update proxy setting in repositories with repoid E<lt>repo1E<gt> and E<lt>repo2E<gt> and make the change permanent.
de: aktualisiert die Proxy-Einstellung in den als E<lt>Paketquelle1E<gt> E<lt>Paketquelle2E<gt> angegebenen Paketquellen und speichert die Änderung dauerhaft.

source: Update gpgcheck setting in all repositories whose id ends with -debuginfo and make the change permanent.
de: aktualisiert die Einstellung zur GPG-Überprüfung (gpgcheck) in allen Paketquellen, die auf -debuginfo enden und speichert die Änderung dauerhaft.

source: AUTHOR
de: AUTOR

source: See AUTHORS in your Core DNF Plugins distribution
de: Siehe AUTHORS im Paket der Core DNF Plugins.

source: 2022, Red Hat, Licensed under GPLv2+
de: 2022, Red Hat, lizenziert unter GPLv2+

source: Mar 18, 2022
de: 18. März 2022

source: 2014, Red Hat, Licensed under GPLv2+
de: 2014, Red Hat, lizenziert unter GPLv2+

source: Nov 03, 2021
de: 3. November 2021

source: 2021, Red Hat, Licensed under GPLv2+
de: 2021, Red Hat, lizenziert unter GPLv2+

source: Mar 27, 2022
de: 27. März 2022
