Repository: sebras/manpages-l10n
Catalog: po/*/man8/drpmsync.8.po
Languages: de

source: Jun 2005
de: Juni 2005

source: NAME
de: BEZEICHNUNG

source: drpmsync - sync a file tree with deltarpms
de: drpmsync - einen Dateibaum mit Delta-RPMs synchronisieren

source: SYNOPSIS
de: ÜBERSICHT

source: B<drpmsync> [B<-c> I<config>] [I<source>] I<dir>
de: B<drpmsync> [B<-c> I<Konfiguration>] [I<Quelle>] I<Verzeichnis>

source: B<drpmsync> [B<-s>|B<-S>] I<serverconfig>
de: B<drpmsync> [B<-s>|B<-S>] I<Serverkonfiguration>

source: DESCRIPTION
de: BESCHREIBUNG

source: Drpmsync keeps a local file system tree in sync with a remote one. Its intended use is to work with rpm trees; the deltarpm technology can only save bandwidth if rpms get transmitted. Please use the rsync program for normal file trees.
de: B<rpmsync> gleicht einen lokalen mit einem entfernten Dateisystembaum ab. Es ist auf den Abgleich von RPM-Dateibäumen ausgelegt; die B<deltarpm> zugrunde liegende Technik kann nur bei der Übertragung von RPM-Paketen Bandbreite sparen. Für normale Dateibäume verwenden Sie bitte das Programm B<rsync>.

source: Drpmsync can run in two modes: as a client it connects to a server, receives a file list and brings the tree up to date, as a server it answers incoming requests and transmits files and rpms.
de: B<drpmsync> kann in zwei Modi ausgeführt werden: als Client verbindet es sich mit einem Server, empfängt eine Dateiliste und aktualisiert den Baum; als Server beantwortet es eingehende Anfragen und überträgt Dateien und RPM-Pakete.

source: CLIENT MODE
de: CLIENT-MODUS

source: In this mode drpmsync updates the tree in I<dir>. It opens the configuration file I<dir>B</drpmsync/config> to get information about which server to use and other settings. You can specify a different configuration file with the B<-c> option. The following settings are understood (the default for the boolean settings is false):
de: In diesem Modus aktualisiert B<drpmsync> den Baum im angegebenen I<Verzeichnis>. Es öffnet die Konfigurationsdatei I<Verzeichnis>B</drpmsync/config>, um Informationen darüber zu erhalten, welche Server zu verwenden sind, sowie weitere Einstellungen. Mit der Option B<-c> können Sie eine andere Konfigurationsdatei angeben. Die folgenden Einstellungen werden verstanden (die Voreinstellung für die booleschen Einstellungen ist »false«):

source: This is a list of servers to connect to. Drpmsync advances through this list until a working server is found. If a source is specified on the command line it is used instead of the one from the configuration. The syntax for the server entries is "I<host>[B<:>I<port>]/I<tree>".
de: Dies ist eine Liste der Server, zu denen verbunden werden soll. B<drpmsync> arbeitet diese Liste ab, bis ein funktionierender Server gefunden wird. Wenn eine Quelle in der Befehlszeile angegeben wird, dann wird diese anstelle der in der Konfiguration angegebenen Quelle verwendet. Die Syntax für Servereinträge lautet »I<Rechner>[B<:>I<Port>]/I<Baum>«.

source: B<log:> I<logfile>
de: B<log:> I<Protokolldatei>

source: Specifies the name of a logfile. If the name does not start with a slash, I<dir>B</drpmsync/> is prepended to it.
de: gibt den Namen der Protokolldatei an. Falls der Name nicht mit einem Schrägstrich beginnt, wird I<Verzeichnis>B</drpmsync/> dem Namen vorangestellt.

source: Controls whether drpmsync generates a delta if it receives a new version of a rpm and the server doesn't provide a delta. This is only useful if the local tree is also exported to other clients via a local drpmsync server.
de: legt fest, ob B<drpmsync> eine Differenzdatei erstellt, wenn es eine neue Version eines RPM-Pakets empfängt und der Server keine solche Differenzdatei bereitstellt. Dies ist nur dann nützlich, wenn der lokale Baum über den lokalen B<drpmsync>-Server auch an andere Clients exportiert wird.

source: B<generate_delta_compression:> I<comp>
de: B<generate_delta_compression:> I<Kompression>

source: This parameter is forwarded to the makedeltarpm program when creating deltas. An example would be B<gzip,gzip>.
de: wird beim Erzeugen von Deltas an das Programm B<makedeltarpm> weitergeleitet. Ein Beispiel wäre B<gzip,gzip>.

source: Tell drpmsync to save received or freshly created deltas to the I<dir>B</drpmsync/delta> directory. Automatically true if B<generate_deltas> or B<keep_uncombined> is set to true.
de: weist B<drpmsync> an, empfangene oder neu erzeugte Differenzdateien in I<Verzeichnis>B</drpmsync/delta> zu speichern. Dies ist automatisch »true«, wenn B<generate_deltas> oder B<keep_uncombined> auf »true« gesetzt ist.

source: This tells drpmsync to request uncombined deltas from the server instead of a precombined single delta. This makes sense if you re-export the tree and want to maximize the number of versions your clients can update from.
de: weist B<drpmsync> an, unverkettete Differenzdateien anstelle einer vorverketteten einzigen Differenzdatei beim Server anzufordern. Dies ergibt Sinn, wenn Sie den Baum re-exportieren und die Anzahl der Versionen, aus denen die Clients aktualisiert werden können, maximieren wollen.

source: Configures whether drpmsync should request that the full rpm is always sent along with the delta. Only makes sense if you have a fast network connection so that applydeltarpm takes longer than transmitting the ful rpm.
de: legt fest, ob B<drpmsync> anfordern soll, das vollständige RPM-Paket immer zusammen mit der Differenzdatei zu senden. Dies ergibt nur Sinn, wenn Sie über eine schnelle Netzwerkverbindung verfügen, so dass B<applydeltarpm> mehr Zeit benötigt als für die Übertragung des vollständigen RPM-Pakets benötigt werden würde.

source: B<deltarpmpath:> I<path>
de: B<deltarpmpath:> I<Pfad>

source: Sets the directory where drpmsync searches for the deltarpm programs. The default is to search the B<$PATH> variable.
de: legt das Verzeichnis fest, in dem B<drpmsync> nach den B<deltarpm>-Programmen sucht. Standardmäßig ist dies auf die Variable B<$PATH> gesetzt.

source: SERVER MODE
de: SERVER-MODUS

source: Drpmsync can wither work as CGI script or as a standalone server. CGI script mode is automatically selected if the B<REQUEST_METHOD> environment variable is set. In this mode drpmsync expects the B<DRPMSYNC_CONFIG> environment variable to contain the path to a server config file. For apache you can set this with the B<SetEnv> directive.
de: B<drpmsync> kann entweder als CGI-Skript oder als eigenständiger Server arbeiten. Der CGI-Skript-Modus wird automatisch ausgewählt, wenn die Umgebungsvariable B<REQUEST_METHOD> gesetzt ist. In diesem Modus erwartet B<drpmsync>, dass die Umgebungsvariable B<DRPMSYNC_CONFIG> den Pfad zu einer Server-Konfigurationsdatei enthält. Für Apache können Sie diese mit der Anweisung B<SetEnv> setzen.

source: Standalone mode is selected with the B<-s> or B<-S> option. In this mode the server configuration must be specified as an argument to the drpmsync program. The B<-s> option makes the drpmsync program background itself and exit right away, while B<-S> keeps the server in the foreground.
de: Der eigenständige Modus wird mit der Option B<-s> oder B<-S> ausgewählt. In diesem Modus muss die Serverkonfiguration als Argument beim Aufruf von B<drpmsync> übergeben werden. Die Option B<-s> weist B<drpmsync> an, sich selbst in den Hintergrund zu verschieben und sich direkt zu beenden, während die Option B<-S> den Server im Vordergrund hält.

source: The server configuration can contain the following settings:
de: Die Serverkonfiguration kann die folgenden Einstellungen enthalten:

source: B<allow:> I<pattern1> I<pattern2>...
de: B<allow:> I<Muster1> I<Muster2> …

source: B<deny:> I<pattern1> I<pattern2>...
de: B<deny:> I<Muster1> I<Muster2> …

source: This provides the access control for the server. I<pattern> can either be a simple glob pattern (only B<*> is supported) or it can be a full regular expression if it is written as B</RE/>. The regular expression is automatically anchored at the start and the end. Examples are B<10.10.*> or B</10\e.10\e..*/> If either the numerical ip address or the domain name of the client matches any entry of the deny list, access is forbidden. Otherwise the allow list is searched for a match. If none is found, access is also denied. The default setting for both lists is empty, so you have to provide an allow list to allow access for the clients.
de: stellt die Zugriffskontrolle für den Server bereit. Das I<Muster> kann entweder ein einfaches Glob-Muster sein (wobei nur B<*> unterstützt wird) oder ein vollständiger regulärer Ausdruck, sofern dieser als B</RA/> geschrieben ist. Der reguläre Ausdruck wird automatisch am Beginn und Ende verankert. Beispiele sind B<10.10.*> oder B</10\e.10\e..*/>. Falls entweder die numerische IP-Adresse oder der Domainname des Clients irgendeinem Eintrag in der Abweisungsliste entspricht, wird der Zugriff verweigert. Anderenfalls wird die Liste der erlaubten Clients nach einem passenden Eintrag durchsucht. Falls keiner gefunden wird, dann wird der Zugriff ebenfalls verweigert. Die Standardeinstellung für beide Listen ist leer, daher müssen Sie eine Liste der erlaubten Clients bereitstellen, um diesen Clients den Zugriff zu gewähren.

source: Specifies the path of a logfile.
de: gibt den Pfad einer Protokolldatei an.

source: If this setting is true the server does not combine deltarpms. This increases to amount of data that has to be transferred but reduces the processor load on the server.
de: weist mit dem Wert »true« den Server an, Differenzdateien nicht zu verketten. Dies erhöht die zu übertragende Datenmenge, aber reduziert die Prozessorlast auf dem Server.

source: B<tree:> I<external_path> I<internal_path>
de: B<tree:> I<externer_Pfad> I<interner_Pfad>

source: This statements exports the tree located at I<internal_path> to the clients as directory I<external_path>. All of the above settings are saved as settings of this particular tree, so different trees can use different configurations. This also means that the configuration directives of a tree must be above the B<tree> statement.
de: exportiert den im I<internen_Pfad> befindlichen Baum an die Clients als Verzeichnis I<externer_Pfad>. Alle obigen Einstellungen werden als Einstellungen dieses bestimmten Baums gespeichert, so dass unterschiedliche Bäume unterschiedliche Einstellungen beinhalten können. Das bedeutet auch, dass sich die Konfigurationsanweisungen eines Baums oberhalb der B<tree>-Anweisung befinden müssen.

source: The following settings are global and only needed for standalone mode:
de: Die folgenden Einstellungen sind global und nur für den eigenständigen Modus erforderlich:

source: B<serverlog:> I<logfile>
de: B<serverlog:> I<Protokolldatei>

source: Specifies the path of a logfile used for logging server events.
de: gibt den Pfad einer Protokolldatei an, die für die Protokollierung von Serverereignissen verwendet werden soll.

source: B<servername:> I<hostname>[:I<port>]
de: B<servername:> I<Rechnername>[:I<Port>]

source: The name of the server. If I<hostname> is empty, the fully qualified domain name is used instead. The port defaults to port 80.
de: gibt den Namen des Servers an. Falls I<Rechnername> leer ist, wird stattdessen der vollständig ausgeschriebene Domainname verwendet. Die Vorgabe für die Portnummer ist 80.

source: B<serveraddr:> I<addr>
de: B<serveraddr:> I<Adresse>

source: This address is used for binding the server's socket. If not specified, connections can come from any interface.
de: gibt die Serveradresse an, die zum Binden des Server-Sockets verwendet werden soll. Falls nicht angegeben, können Verbindungen aus jeder Schnittstelle kommen.

source: B<serveruser:> I<user>
de: B<serveruser:> I<Benutzer>

source: B<servergroup:> I<group>
de: B<servergroup:> I<Gruppe>

source: Configures the user and group the servers swicthes to after binding the socket to the desired port. Examples are B<nobody> or B<wwwrun>.
de: konfiguriert Benutzer und Gruppe, zu denen der Server wechseln soll, sobald der Socket an den gewünschten Port gebunden wurde. Beispiele sind B<nobody> oder B<wwwrun>.

source: B<maxclients:> I<num>
de: B<maxclients:> I<Anzahl>

source: This settings limits the maximum number of concurrent connections to I<num>. The default value is 10 connections.
de: begrenzt die maximale Anzahl gleichzeitiger Verbindungen auf die angegebene I<Anzahl>. Der Standardwert ist 10 Verbindungen.

source: FILES
de: DATEIEN

source: I<dir>/drpmsync/deltas
de: I<Verzeichnis>/drpmsync/deltas

source: directory used to store the deltas
de: Verzeichnis zum Speichern der Deltas

source: I<dir>/drpmsync/lock
de: I<Verzeichnis>/drpmsync/lock

source: lock used to serialize syncrpm calls
de: Sperrdatei zum Serialisieren von B<syncrpm>-Aufrufen

source: I<dir>/drpmsync/wip
de: I<Verzeichnis>/drpmsync/wip

source: temporary storing space for the transmitted objects
de: Temporärer Speicherort für die übertragenen Objekte

source: I<dir>/drpmsync/cache
de: I<Verzeichnis>/drpmsync/cache

source: md5sum cache to speed up the calculation of the tree state
de: md5sum-Zwischenspeicher, der die Berechnung des Baumstatus beschleunigt

source: I<dir>/drpmsync/timstamp
de: I<Verzeichnis>/drpmsync/timstamp

source: contains the time of the last finished sync and the last time the remote tree state was requested.
de: enthält den Zeitpunkt des letzten abgeschlossenen Abgleichs und den Zeitpunkt, zu dem zuletzt der Status des fernen Dateibaums abgefragt wurde.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR
