Repository: sebras/manpages-l10n
Catalog: po/*/man8/dumpe2fs.8.po
Languages: pl

source: December 2021
pl: grudzień 2021

source: E2fsprogs version 1.46.5
pl: E2fsprogs wersja 1.46.5

source: NAME
pl: NAZWA

source: dumpe2fs - dump ext2/ext3/ext4 file system information
pl: dumpe2fs - zrzuca dane o systemie plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<dumpe2fs> [ B<-bfghixV> ] [ B<-o superblock=>I<superblock> ] [ B<-o blocksize=>I<blocksize> ] I<device>
pl: B<dumpe2fs> [ B<-bfghixV> ] [ B<-o superblock=>I<superblok> ] [ B<-o blocksize=>I<rozmiar-bloku> ] I<urządzenie>

source: DESCRIPTION
pl: OPIS

source: B<dumpe2fs> prints the super block and blocks group information for the file system present on I<device.>
pl: B<dumpe2fs> wypisuje superblok i informacje grupy bloków systemu plików znajdującego się na urządzeniu I<urządzenie>.

source: B<Note:> When used with a mounted file system, the printed information may be old or inconsistent.
pl: B<Uwaga:> Gdy program jest używany na zamontowanym systemie plików, to wypisane informacje mogą być nieaktualne lub niespójne.

source: OPTIONS
pl: OPCJE

source: print the blocks which are reserved as bad in the file system.
pl: Wypisuje bloki, które są zaznaczone jako uszkodzone.

source: B<-o superblock=>I<superblock>
pl: B<-o superblock=>I<superblok>

source: use the block I<superblock> when examining the file system. This option is not usually needed except by a file system wizard who is examining the remains of a very badly corrupted file system.
pl: Używa bloku I<superblok> podczas badania systemu plików. Ta opcja zwykle nie jest potrzebna z wyjątkiem eksperta systemu plików, który bada resztki po mocno zniszczonym systemie plików.

source: B<-o blocksize=>I<blocksize>
pl: B<-o bloksize=>I< rozmiar-bloku>

source: use blocks of I<blocksize> bytes when examining the file system. This option is not usually needed except by a file system wizard who is examining the remains of a very badly corrupted file system.
pl: Używa bloków o rozmiarze I<blocksize> bajtów podczas badania systemu plików. Ta opcja zwykle nie jest potrzebna z wyjątkiem eksperta systemu plików, który bada resztki po mocno zniszczonym systemie plików.

source: force dumpe2fs to display a file system even though it may have some file system feature flags which dumpe2fs may not understand (and which can cause some of dumpe2fs's display to be suspect).
pl: Zmusza dumpe2fs aby wyświetlał system plików nawet wtedy, gdy może on mieć ustawione flagi, których dumpe2fs nie rozumie (i które mogą powodować to, że dumpe2fs nie chce ich wyświetlać).

source: only display the superblock information and not any of the block group descriptor detail information.
pl: Wyświetla tylko informacje na temat superbloku bez szczegółów o deskryptorach grup bloków.

source: display the file system data from an image file created by B<e2image>, using I<device> as the pathname to the image file.
pl: Wyświetla dane systemu plików z obrazu znajdującego się w pliku, utworzonego przez B<e2image>, używając I<urządzenie> jako ścieżkę do pliku z obrazem.

source: print the detailed group information block numbers in hexadecimal format
pl: Wyświetla szczegółowe informacje na temat grupy bloków w formie szesnastkowej.

source: print the version number of B<dumpe2fs> and exit.
pl: Wypisuje numer wersji B<dumpe2fs> i kończy działanie.

source: EXIT CODE
pl: KOD ZAKOŃCZENIA

source: BUGS
pl: BŁĘDY

source: AUTHOR
pl: AUTOR

source: B<dumpe2fs> was written by Remy Card E<lt>Remy.Card@linux.orgE<gt>. It is currently being maintained by Theodore Ts'o E<lt>tytso@alum.mit.eduE<gt>.
pl: B<dumpe2fs> został napisany przez Remy'ego Carda E<lt>Remy.Card@linux.orgE<gt>. Obecnie opiekuje się nim Theodore Ts'o E<lt>tytso@alum.mit.eduE<gt>.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: B<dumpe2fs> is part of the e2fsprogs package and is available from http://e2fsprogs.sourceforge.net.
pl: B<dumpe2fs> jest częścią pakietu e2fsprogs i jest dostępny na stronie http://e2fsprogs.sourceforge.net.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: September 2022
pl: wrzesień 2022

source: August 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4
