Repository: sebras/manpages-l10n
Catalog: po/*/man8/e2fsck.8.po
Languages: pl

source: Before overwriting a file system block, write the old contents of the block to an undo file. This undo file can be used with e2undo(8) to restore the old contents of the file system should something go wrong. If the empty string is passed as the undo_file argument, the undo file will be written to a file named e2fsck-I<device>.e2undo in the directory specified via the I<E2FSPROGS_UNDO_DIR> environment variable.
pl: Przed nadpisaniem bloku w systemie plików, zapisuje jego starą zawartość do pliku zapasowego. Później można użyć programu e2undo(8) do przywrócenia starej zawartości systemu plików z pliku zapasowego, jeśli coś pójdzie nie tak. Jeśli jako I<plik-zapasowy> poda się pusty łańcuch, przyjmie on wartość domyślną: e2fsck-I<urządzenie>.e2undo w katalogu określonym zmienną środowiskową I<E2FSPROGS_UNDO_DIR>.

source: WARNING: The undo file cannot be used to recover from a power or system crash.
pl: OSTRZEŻENIE: Plik zapasowy nie pomoże w przypadku utraty zasilania lub zawieszenia systemu.

source: EXIT CODE
pl: KOD ZAKOŃCZENIA

source: The exit code returned by B<e2fsck> is the sum of the following conditions:
pl: Kod zakończenia zwracany przez B<e2fsck> jest sumą następujących warunków:

source: \ 0\ -\ No errors
pl: 0 - Bez błędów

source: \ 1\ -\ File system errors corrected
pl: 1 - Błędy systemu plików są poprawione

source: \ 2\ -\ File system errors corrected, system should
pl: 2 - Błędy systemu plików są poprawione, system powinien

source: \ \ \ \ be rebooted
pl: zostać uruchomiony ponownie

source: \ 4\ -\ File system errors left uncorrected
pl: 4 - Błędy systemu plików nie zostały poprawione

source: \ 8\ -\ Operational error
pl: 8 - Błąd operacyjny

source: \ 16\ -\ Usage or syntax error
pl: 16 - Błąd w składni lub użyciu

source: \ 32\ -\ E2fsck canceled by user request
pl: 32 - Działanie e2fsck przerwane przez użytkownika

source: \ 128\ -\ Shared library error
pl: 128 - Błąd biblioteki dzielonej

source: SIGNALS
pl: SYGNAŁY

source: The following signals have the following effect when sent to B<e2fsck>.
pl: Następujące sygnały mają podany niżej efekt, gdy zostaną wysłane do B<e2fsck>.

source: This signal causes B<e2fsck> to start displaying a completion bar or emitting progress information. (See discussion of the B<-C> option.)
pl: Ten sygnał powoduje, że B<e2fsck> wyświetli pasek postępu. (Zobacz opis opcji B<-C>).

source: This signal causes B<e2fsck> to stop displaying a completion bar or emitting progress information.
pl: Ten sygnał powoduje, że B<e2fsck> przestanie wyświetlać pasek postępu.

source: REPORTING BUGS
pl: ZGŁASZANIE BŁĘDÓW

source: Almost any piece of software will have bugs. If you manage to find a file system which causes B<e2fsck> to crash, or which B<e2fsck> is unable to repair, please report it to the author.
pl: Prawie każdy program ma błędy. W przypadku znalezienia systemu plików, powodującego pad programu B<e2fsck> lub takiego, którego B<e2fsck> nie potrafi naprawić, proszę zgłosić to autorowi.

source: Please include as much information as possible in your bug report. Ideally, include a complete transcript of the B<e2fsck> run, so I can see exactly what error messages are displayed. (Make sure the messages printed by B<e2fsck> are in English; if your system has been configured so that B<e2fsck>'s messages have been translated into another language, please set the the B<LC_ALL> environment variable to B<C> so that the transcript of e2fsck's output will be useful to me.) If you have a writable file system where the transcript can be stored, the B<script>(1) program is a handy way to save the output of B<e2fsck> to a file.
pl: Proszę załączyć tyle informacji, ile da się załączyć w swoim zgłoszeniu błędu. Najlepiej dołączyć kompletną transkrypcję uruchomienia B<e2fsck>, tak by autor mógł dokładnie widzieć, co się działo. Proszę upewnić się, że komunikaty programu są wyświetlane po angielsku; jeśli system został skonfigurowany do używania tłumaczeń, proszę ustawić zmienną środowiskową B<LC_ALL> na wartość B<C>, dzięki czemu transkrypcja działania programu będzie przydatna dla autora. Jeśli jest zapisywalny system plików, gdzie można tę transkrypcję zapisać, program B<script>(1) umożliwia łatwe zapisanie wyjścia B<e2fsck> do pliku.

source: It is also useful to send the output of B<dumpe2fs>(8). If a specific inode or inodes seems to be giving B<e2fsck> trouble, try running the B<debugfs>(8) command and send the output of the B<stat>(1u) command run on the relevant inode(s). If the inode is a directory, the B<debugfs> I<dump> command will allow you to extract the contents of the directory inode, which can sent to me after being first run through B<uuencode>(1). The most useful data you can send to help reproduce the bug is a compressed raw image dump of the file system, generated using B<e2image>(8). See the B<e2image>(8) man page for more details.
pl: Użyteczne może być też przesłanie wyjścia z B<dumpe2fs>(8). Jeśli określony i-węzeł lub ich grupa wydaje się sprawiać e2fsck kłopoty, proszę spróbować uruchomić komendę B<debugfs>(8) i wysłać wyjście komendy B<stat>(1u) na dotkniętych i-węzłach. Jeśli i-węzeł jest katalogiem, komenda I<debugfs> o nazwie I<dump> umożliwi ekstrakcję zawartości i-węzła katalogu, którą można przesłać po zakodowaniu jej programem B<uuencode>(1). Najbardziej przydatną rzeczą, jaką można wysłać w celu umożliwienia odtworzenia błędu przez autora, jest surowy, skompresowany zrzut obrazu systemu plików, utworzony za pomocą B<e2image>(8) (proszę zapoznać się z jego stroną podręcznika).

source: Always include the full version string which B<e2fsck> displays when it is run, so I know which version you are running.
pl: Proszę również zawsze załączać pełny tekst wersji, wyświetlany przez B<e2fsck> podczas pracy.

source: ENVIRONMENT
pl: ŚRODOWISKO

source: Determines the location of the configuration file (see B<e2fsck.conf>(5)).
pl: Określa położenie pliku konfiguracyjnego (patrz B<e2fsck.conf>(5)).

source: AUTHOR
pl: AUTOR

source: This version of B<e2fsck> was written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
pl: Ta wersja B<e2fsck> została napisana przez Theodore'a Ts'o E<lt>tytso@mit.eduE<gt>.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: September 2022
pl: wrzesień 2022

source: August 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4
