Repository: sebras/manpages-l10n
Catalog: po/*/man8/e2fsck.8.po
Languages: pl

source: December 2021
pl: grudzień 2021

source: E2fsprogs version 1.46.5
pl: E2fsprogs wersja 1.46.5

source: NAME
pl: NAZWA

source: e2fsck - check a Linux ext2/ext3/ext4 file system
pl: e2fsck - sprawdza linuksowy system plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<e2fsck> [ B<-pacnyrdfkvtDFV> ] [ B<-b> I<superblock> ] [ B<-B> I<blocksize> ] [ B<-l>|B<-L> I<bad_blocks_file> ] [ B<-C> I<fd> ] [ B<-j> I<external-journal> ] [ B<-E> I<extended_options> ] [ B<-z> I<undo_file> ] I<device>
pl: B<e2fsck> [ B<-pacnyrdfkvtDFV> ] [ B<-b> I<superblok> ] [ B<-B> I<rozmiar-bloku> ] [ B<-l>|B<-L> I<plik-złych-bloków> ] [ B<-C> I<fd> ] [ B<-j> I<zewnętrzny-dziennik> ] [ B<-E> I<opcje-rozszerzone> ] [ B<-z> I<plik_zapasowy> ] I<urządzenie>

source: DESCRIPTION
pl: OPIS

source: B<e2fsck> is used to check the ext2/ext3/ext4 family of file systems. For ext3 and ext4 file systems that use a journal, if the system has been shut down uncleanly without any errors, normally, after replaying the committed transactions in the journal, the file system should be marked as clean. Hence, for file systems that use journaling, B<e2fsck> will normally replay the journal and exit, unless its superblock indicates that further checking is required.
pl: B<e2fsck> jest używany do sprawdzania rodziny systemów plików ext2/ext3/ext4. W przypadku systemów plików ext3 i ext4 używających dziennika, jeśli system zostanie nieprawidłowo zamknięty bez wystąpienia błędów, po odtworzeniu transakcji wprowadzonych do dziennika, system plików powinien zostać zwykle oznaczony jako czysty. Z tego powodu, w systemach plików używających dziennika, B<e2fsck> zwykle odtworzy go i wyjdzie, chyba że superblok danego systemu plików wskazuje, że konieczne są dalsze sprawdzenia.

source: I<device> is a block device (e.g., I</dev/sdc1>) or file containing the file system.
pl: I<Urządzenie> jest urządzeniem blokowym (np. I</dev/sdc1>) lub plikiem zawierającym system plików.

source: Note that in general it is not safe to run B<e2fsck> on mounted file systems. The only exception is if the B<-n> option is specified, and B<-c>, B<-l>, or B<-L> options are I<not> specified. However, even if it is safe to do so, the results printed by B<e2fsck> are not valid if the file system is mounted. If B<e2fsck> asks whether or not you should check a file system which is mounted, the only correct answer is ``no''. Only experts who really know what they are doing should consider answering this question in any other way.
pl: Proszę zauważyć, że uruchamianie B<e2fsck> na zamontowanym systemie plików generalnie nie jest bezpieczne. Jedynym wyjątkiem jest sytuacja, gdy podano opcję B<-n>, ale I<nie> użyto B<-c>, B<-l> ani B<-L>. Jednak nawet gdy takie działanie jest bezpieczne, wyniki wypisane przez B<e2fsck> nie są prawidłowe, jeśli system plików jest zamontowany. Jeśli B<e2fsck> pyta czy należy sprawdzić zamontowany system plików, jedyną poprawną odpowiedzią jest "nie". Jedynie eksperci, którzy rzeczywiście wiedzą co robią, mogą zastanowić się nad inną odpowiedzią w takim wypadku.

source: If B<e2fsck> is run in interactive mode (meaning that none of B<-y>, B<-n>, or B<-p> are specified), the program will ask the user to fix each problem found in the file system. A response of 'y' will fix the error; 'n' will leave the error unfixed; and 'a' will fix the problem and all subsequent problems; pressing Enter will proceed with the default response, which is printed before the question mark. Pressing Control-C terminates e2fsck immediately.
pl: Jeśli If B<e2fsck> uruchomiono w trybie interaktywnym (tzn. nie podano opcji B<-y>, B<-n> ani B<-p>), to program będzie pytał użytkownika przy naprawianiu każdego napotkanego w systemie plików problemu. Odpowiedź B<y> naprawi błąd, B<n> pozostawi problem bez naprawy, a B<a> naprawi wskazany błąd i wszystkie kolejne. Klawisz Enter zatwierdzi domyślną odpowiedź, wyświetloną przed znakiem zapytania. Kombinacja Control-C natychmiast przerwie działanie programu.

source: OPTIONS
pl: OPCJE

source: This option does the same thing as the B<-p> option. It is provided for backwards compatibility only; it is suggested that people use B<-p> option whenever possible.
pl: Ta opcja robi to samo co opcja B<-p>. Jest udostępniana jedynie ze względu na kompatybilność wstecz; zaleca się używanie B<-p> wszędzie tam, gdzie to możliwe.

source: B<-b>I< superblock>
pl: B<-b>I< superblok>

source: Instead of using the normal superblock, use an alternative superblock specified by I<superblock>. This option is normally used when the primary superblock has been corrupted. The location of backup superblocks is dependent on the file system's blocksize, the number of blocks per group, and features such as B<sparse_super>.
pl: Zamiast używać normalnego superbloku, używa innego, podanego jako I<superblok>. Ta opcja używana jest, gdy podstawowy superblok został uszkodzony. Położenie kopii zapasowej superbloku zależne jest od rozmiaru bloku w danym systemie plików, liczby bloków na grupę i funkcji takich jak B<sparse_super>.

source: Additional backup superblocks can be determined by using the B<mke2fs> program using the B<-n> option to print out where the superblocks exist, supposing B<mke2fs> is supplied with arguments that are consistent with the file system's layout (e.g. blocksize, blocks per group, B<sparse_super>, etc.).
pl: Położenie dodatkowej kopii zapasowej superbloku może być określone poprzez użycie programu B<mke2fs> z opcją B<-n> wypisującą położenia superbloków, przy założeniu, że programowi B<mke2fs> podano argumenty spójne z charakterystyką danego systemu plików (np. rozmiarem bloku, liczbą bloków na grupę, B<sparse_super> itd.)

source: If an alternative superblock is specified and the file system is not opened read-only, e2fsck will make sure that the primary superblock is updated appropriately upon completion of the file system check.
pl: Jeżeli podany jest alternatywny superblok, a system plików nie jest otwarty w trybie tylko do odczytu, e2fsck sprawdzi, czy podstawowy superblok jest uaktualniony.

source: B<-B>I< blocksize>
pl: B<-B>I< rozmiar-bloku>

source: Normally, B<e2fsck> will search for the superblock at various different block sizes in an attempt to find the appropriate block size. This search can be fooled in some cases. This option forces B<e2fsck> to only try locating the superblock at a particular blocksize. If the superblock is not found, B<e2fsck> will terminate with a fatal error.
pl: Normalnie, e2fsck szuka superbloku w zmienianych rozmiarach bloku i próbuje znaleźć rozmiar odpowiedni. Ta technika czasem daje się ogłupić. Dlatego opcja ta wymusza na e2fsck wyszukiwanie superbloków o określonej wielkości bloku. Jeśli superblok nie zostanie znaleziony, e2fsck zakończy działanie z błędem krytycznym.

source: This option causes B<e2fsck> to use B<badblocks>(8) program to do a read-only scan of the device in order to find any bad blocks. If any bad blocks are found, they are added to the bad block inode to prevent them from being allocated to a file or directory. If this option is specified twice, then the bad block scan will be done using a non-destructive read-write test.
pl: Opcja ta powoduje, że B<e2fsck> uruchamia program B<badblocks>(8) w celu znalezienie uszkodzonych bloków systemu plików przy użyciu skanowania odczytu. Bloki takie są następnie zaznaczane poprzez dodawanie ich do i-węzła uszkodzonych bloków. Jeżeli opcja ta podana jest dwa razy, wtedy uszkodzone bloki będą poszukiwane przy użyciu niedestruktywnego testu odczytu i zapisu.

source: This option causes B<e2fsck> to write completion information to the specified file descriptor so that the progress of the file system check can be monitored. This option is typically used by programs which are running B<e2fsck>. If the file descriptor number is negative, then absolute value of the file descriptor will be used, and the progress information will be suppressed initially. It can later be enabled by sending the B<e2fsck> process a SIGUSR1 signal. If the file descriptor specified is 0, B<e2fsck> will print a completion bar as it goes about its business. This requires that e2fsck is running on a video console or terminal.
pl: Ta opcja powoduje, że B<e2fsck> wypisze kompletną informację do podanego deskryptoru pliku. Dzięki temu postęp sprawdzania systemu plików może być kontrolowany. Ta opcja jest używana przede wszystkim przez programy uruchamiające B<e2fsck>. Jeśli liczba deskryptora pliku jest ujemna, to używana jest wartość bezwzględna z deskryptora pliku, a wyjście jest początkowo wyłączone. Można je później włączyć, wysyłając procesowi B<e2fsck> sygnał SIGUSR1. Jeżeli jako deskryptor pliku podane jest 0, B<e2fsck> wypisze pasek postępu w swoim stylu. To wymaga, aby e2fsck uruchomiony był na konsoli lub na terminalu.

source: Print debugging output (useless unless you are debugging B<e2fsck>).
pl: Wypisuje wyjście debugowania (bezużyteczne, chyba że używane przy debugowaniu B<e2fsck>).

source: Optimize directories in file system. This option causes e2fsck to try to optimize all directories, either by re-indexing them if the file system supports directory indexing, or by sorting and compressing directories for smaller directories, or for file systems using traditional linear directories.
pl: Optymalizuje katalogi w systemie plików. Ta opcja powoduje, że e2fsck próbuje zoptymalizować wszystkie katalogi albo ponownie je indeksując (jeśli system plików obsługuje indeksowanie katalogów), albo sortując i kompresując katalogi (przy mniejszych katalogach, lub w systemach plików używających tradycyjnych, liniowych katalogów).

source: Even without the B<-D> option, B<e2fsck> may sometimes optimize a few directories --- for example, if directory indexing is enabled and a directory is not indexed and would benefit from being indexed, or if the index structures are corrupted and need to be rebuilt. The B<-D> option forces all directories in the file system to be optimized. This can sometimes make them a little smaller and slightly faster to search, but in practice, you should rarely need to use this option.
pl: Nawet bez opcji B<-D>, B<e2fsck> może niekiedy optymalizować część katalogów - np. jeśli indeksowanie katalogów jest włączone, a katalogi nie zostały zindeksowane i mogą odnieść korzyści z tej operacji, albo jeśli struktury indeksowania są uszkodzone i muszą zostać odbudowane. Opcja B<-D> wymusza zoptymalizowanie wszystkich katalogów w systemie plików. Niekiedy może to sprawić, że będą nieco mniejsze i trochę szybsze w przeszukiwaniu, ale w praktyce, rzadko kiedy jest sens stosować tę opcję.

source: The B<-D> option will detect directory entries with duplicate names in a single directory, which e2fsck normally does not enforce for performance reasons.
pl: Opcja B<-D> wykryje wpisy katalogowe ze zduplikowanymi nazwami w pojedynczym katalogu, czego e2fsck normalnie nie wymusza ze względów wydajnościowych.

source: B<-E>I< extended_options>
pl: B<-E>I< opcje-rozszerzone>

source: Set e2fsck extended options. Extended options are comma separated, and may take an argument using the equals ('=') sign. The following options are supported:
pl: Ustawia rozszerzone opcje e2fsck. Opcje rozszerzone są oddzielone przecinkami i mogą przyjmować argument za pomocą znaku równości ("="). Obsługiwane są następujące opcje:

source: B<ea_ver=>I<extended_attribute_version>
pl: B<ea_ver=>I<wersja-atrybutów-rozszerzonych>

source: Set the version of the extended attribute blocks which B<e2fsck> will require while checking the file system. The version number may be 1 or 2. The default extended attribute version format is 2.
pl: Ustawia wersję rozszerzonych atrybutów bloków, które B<e2fsck> wymaga do sprawdzania systemu plików. Numerem wersji może być 1 lub 2. Domyślnym formatem rozszerzonych atrybutów jest 2.

source: Only replay the journal if required, but do not perform any further checks or repairs.
pl: Jeśli to wymagane, odtwarza wyłącznie dziennik, ale nie przeprowadza żadnych dalszych sprawdzeń lub napraw.

source: During pass 1, print a detailed report of any discontiguous blocks for files in the file system.
pl: Podczas pierwszego przebiegu, wypisuje szczegółowe sprawozdanie o wszystkich nieciągłych blokach plików, znalezionych w systemie plików.

source: Attempt to discard free blocks and unused inode blocks after the full file system check (discarding blocks is useful on solid state devices and sparse / thin-provisioned storage). Note that discard is done in pass 5 AFTER the file system has been fully checked and only if it does not contain recognizable errors. However there might be cases where B<e2fsck> does not fully recognize a problem and hence in this case this option may prevent you from further manual data recovery.
pl: Próbuje wyczyścić wolne bloki i nieużywane i-węzły po pełnym sprawdzeniu systemu plików (użyteczne na dyskach SSD i urządzeniach zapisujących "z dziurami" (sparse) lub alokujących dane elastycznie (thin-provisioned)). Proszę zauważyć, że ta operacja jest przeprowadzana w przebiegu piątym, PO pełnym sprawdzeniu systemu plików i tylko, jeśli nie zawiera on rozpoznawalnych błędów. Może się jednak zdarzyć, że B<e2fsck> nie rozpozna problemu w pełni i wówczas użycie tej opcji może uniemożliwić późniejsze, ręczne odzyskiwanie danych.

source: Do not attempt to discard free blocks and unused inode blocks. This option is exactly the opposite of discard option. This is set as default.
pl: Nie próbuje wyczyścić wolnych bloków i nieużywanych bloków i-węzłów. Ta opcja jest dokładnym przeciwieństwem opcji discard. Jest ustawiona jako domyślna.

source: Do not offer to optimize the extent tree by eliminating unnecessary width or depth. This can also be enabled in the options section of B</etc/e2fsck.conf>.
pl: Nie oferuje optymalizacji drzewa ekstentów poprzez jego spłycenie lub zawężenie w możliwym zakresie. Można to również włączyć w sekcji opcji pliku I</etc/e2fsck.conf>.

source: Offer to optimize the extent tree by eliminating unnecessary width or depth. This is the default unless otherwise specified in B</etc/e2fsck.conf>.
pl: Oferuje optymalizację drzewa ekstentów poprzez jego spłycenie lub zawężenie w możliwym zakresie. Jest to zachowanie domyślne, chyba że ustawiono inaczej w pliku I</etc/e2fsck.conf>.

source: Trade off using memory for speed when checking a file system with a large number of hard-linked files. The amount of memory required is proportional to the number of inodes in the file system. For large file systems, this can be gigabytes of memory. (For example, a 40TB file system with 2.8 billion inodes will consume an additional 5.7 GB memory if this optimization is enabled.) This optimization can also be enabled in the options section of B</etc/e2fsck.conf>.
pl: Zwiększa szybkość przy sprawdzaniu systemu plików z dużą liczbą plików z dowiązaniami twardymi kosztem zwiększonego użycia pamięci. Ilość wymaganej pamięci jest proporcjonalna do liczby i-węzłów w systemie plików. W przypadku dużych systemów plików, mogą być to gigabajty (np. system plików o wielkości 40TB, z 2,8 miliardami i-węzłów, po włączeniu tej optymalizacji pochłonie dodatkowo 5,7 GB pamięci). Tę optymalizację można również włączyć w sekcji opcji pliku I</etc/e2fsck.conf>.

source: Disable the B<inode_count_fullmap> optimization. This is the default unless otherwise specified in B</etc/e2fsck.conf>.
pl: Wyłącza optymalizację B<inode_count_fullmap>. Jest to zachowanie domyślne, chyba że ustawiono inaczej w pliku I</etc/e2fsck.conf>.

source: Use this many KiB of memory to pre-fetch metadata in the hopes of reducing e2fsck runtime. By default, this is set to the size of two block groups' inode tables (typically 4MiB on a regular ext4 file system); if this amount is more than 1/50th of total physical memory, readahead is disabled. Set this to zero to disable readahead entirely.
pl: Używa podanej wielkości pamięci w KiB, do wstępnego pobrania metadanych, co powinno skrócić czas działania programu e2fsck. Domyślną wielkością jest rozmiar dwóch grup bloków tablic i-węzłów (zwykle 4MiB w typowym systemie plików ext4); jeśli ta wielkość wynosi więcej niż 1/50 całkowitego rozmiaru pamięci fizycznej, readahead jest wyłączane. Wartość zerowa całkowicie wyłączy readahead.

source: Convert block-mapped files to extent-mapped files.
pl: Przekształca pliki z plików opisywanych blokami na pliki opisywane ekstentami.

source: Only fix damaged metadata; do not optimize htree directories or compress extent trees. This option is incompatible with the -D and -E bmap2extent options.
pl: Naprawia wyłącznie uszkodzone metadane, nie optymalizuje katalogów h-drzewa ani nie kompresuje drzew ekstentów. Opcja ta jest niekompatybilna z opcjami -D i -E bmap2extent.

source: Force verification of encoded filenames in case-insensitive directories. This is the default mode if the file system has the strict flag enabled.
pl: Wymusza weryfikację nazw plików w katalogach niewrażliwych na wielkość liter. Jest do zachowanie domyślne, jeśli dany system plików ma włączoną flagę strict.

source: If the file system has shared blocks, with the shared blocks read-only feature enabled, then this will unshare all shared blocks and unset the read-only feature bit. If there is not enough free space then the operation will fail. If the file system does not have the read-only feature bit, but has shared blocks anyway, then this option will have no effect. Note when using this option, if there is no free space to clone blocks, there is no prompt to delete files and instead the operation will fail.
pl: Jeśli system plików ma współdzielone bloki, z włączoną funkcją bloków współdzielonych tylko do odczytu, dojdzie do cofnięcia współdzielenia wszystkich takich bloków i usunięcia flagi tylko do odczytu. Jeśli na urządzeniu jest zbyt mało miejsca, operacja ta nie powiedzie się. Jeśli system plików nie ma ustawionej flagi tylko do odczytu, ale posiada bloki współdzielone, opcja ta nie da żadnego rezultatu. Proszę zauważyć, że jeśli nie będzie wolnego miejsca do sklonowania bloków, program nie poprosi o usunięcie żadnych plików - po prostu działanie to nie powiedzie się.

source: Note that unshare_blocks implies the "-f" option to ensure that all passes are run. Additionally, if "-n" is also specified, e2fsck will simulate trying to allocate enough space to deduplicate. If this fails, the exit code will be non-zero.
pl: Proszę zauważyć, że unshare_blocks implikuje opcję "-f", aby wymusić przejście przez wszystkie przebiegi. Dodatkowo, jeśli poda się również "-n", e2fsck dokona symulacji, próbując przydzielić wystarczającą ilość miejsca do przeprowadzenia deduplikacji. Jeśli jej zabraknie, kod zakończenia będzie niezerowy.

source: Force checking even if the file system seems clean.
pl: Wymusza sprawdzanie, nawet jeśli system wydaje się być czysty.

source: Flush the file system device's buffer caches before beginning. Only really useful for doing B<e2fsck> time trials.
pl: Wypróżnia bufory systemu plików przed uruchomieniem programu. Przydatne właściwie tylko w czasowych próbach B<e2fsck>.

source: B<-j>I< external-journal>
pl: B<-j>I< zewnętrzny_dziennik>

source: Set the pathname where the external-journal for this file system can be found.
pl: Ustawia ścieżkę dostępu do zewnętrznego dziennika dla tego systemu plików.

source: When combined with the B<-c> option, any existing bad blocks in the bad blocks list are preserved, and any new bad blocks found by running B<badblocks>(8) will be added to the existing bad blocks list.
pl: W połączeniu z opcją B<-c>, zachowywane są wszystkie uszkodzone bloki na liście złych bloków, a nowe uszkodzone bloki znalezione przez B<badblocks>(8) będą dodane do istniejącej listy złych bloków.

source: B<-l>I< filename>
pl: B<-l>I< plik>

source: Add the block numbers listed in the file specified by I<filename> to the list of bad blocks. The format of this file is the same as the one generated by the B<badblocks>(8) program. Note that the block numbers are based on the blocksize of the file system. Hence, B<badblocks>(8) must be given the blocksize of the file system in order to obtain correct results. As a result, it is much simpler and safer to use the B<-c> option to B<e2fsck>, since it will assure that the correct parameters are passed to the B<badblocks> program.
pl: Dodaje podane przez I<plik> bloki do listy bloków uszkodzonych. Format pliku jest taki sam jak ten utworzony przez program B<badblocks>(8). Proszę zauważyć, że numery bloków bazują na rozmiarze bloku systemu plików. Dlatego B<badblocks>(8) musi otrzymać rozmiar bloku systemu plików. Jednak dużo łatwiejsze i bezpieczniejsze jest użycie opcji B<-c> programu B<e2fsck>, ponieważ zapewnia to przekazanie właściwych parametrów do programu B<badblocks.>

source: B<-L>I< filename>
pl: B<-L>I< plik>

source: Set the bad blocks list to be the list of blocks specified by I<filename>. (This option is the same as the B<-l> option, except the bad blocks list is cleared before the blocks listed in the file are added to the bad blocks list.)
pl: Ustawia listę uszkodzonych bloków na listę bloków określoną przez I<plik>. (Opcja ta jest identyczna z B<-l>, poza tym, że przed dodaniem listy bloków z pliku, stara lista uszkodzonych bloków jest czyszczona).

source: Open the file system read-only, and assume an answer of `no' to all questions. Allows B<e2fsck> to be used non-interactively. This option may not be specified at the same time as the B<-p> or B<-y> options.
pl: Otwiera system plików w trybie tylko do odczytu i zakłada odpowiedź "nie" na wszystkie pytania. Umożliwia to użycie B<e2fsck> w trybie nieinteraktywnym. Ta opcja nie może być podana razem z opcjami B<-p> lub B<-y>.

source: Automatically repair ("preen") the file system. This option will cause B<e2fsck> to automatically fix any file system problems that can be safely fixed without human intervention. If B<e2fsck> discovers a problem which may require the system administrator to take additional corrective action, B<e2fsck> will print a description of the problem and then exit with the value 4 logically or'ed into the exit code. (See the B<EXIT CODE> section.) This option is normally used by the system's boot scripts. It may not be specified at the same time as the B<-n> or B<-y> options.
pl: Automatycznie naprawia ("preen") system plików. Ta opcja powoduje automatyczne naprawianie przez B<e2fsck> wszystkich problemów systemu plików, które mogą zostać bezpiecznie naprawione bez udziału człowieka. Jeśli B<e2fsck> wykryje problem, który może wymagać obecności administratora w celu wykonania dodatkowych działań, B<e2fsck> wypisze opis problemu i wyjdzie z wartością 4 dodaną (logiczne OR) do kodu zakończenia. (patrz rozdział B<KOD WYJŚCIA>). Ta opcja jest zwykle używana w systemowych skryptach rozruchowych. Nie może być użyta razem z opcjami B<-n> lub B<-y>.

source: This option does nothing at all; it is provided only for backwards compatibility.
pl: Ta opcja nie robi nic; jest udostępniona dla kompatybilności wstecznej.

source: Print timing statistics for B<e2fsck>. If this option is used twice, additional timing statistics are printed on a pass by pass basis.
pl: Wypisuje statystyki czasowe dla B<e2fsck>. Jeśli opcja ta jest użyta dwukrotnie, to wyświetlane są dodatkowe statystyki czasowe.

source: Verbose mode.
pl: Tryb szczegółowy (verbose).

source: Print version information and exit.
pl: Wypisuje informację o wersji i wychodzi.

source: Assume an answer of `yes' to all questions; allows B<e2fsck> to be used non-interactively. This option may not be specified at the same time as the B<-n> or B<-p> options.
pl: Zakłada odpowiedź "tak" na wszystkie pytania; umożliwia użycie B<e2fsck> w trybie nieinteraktywnym. Opcja nie może być podana razem z opcjami B<-n> lub B<-p>.

source: B<-z>I< undo_file>
pl: B<-z> I<plik-zapasowy>
