Repository: sebras/manpages-l10n
Catalog: po/*/man8/e2label.8.po
Languages: de

source: December 2021
de: Dezember 2021

source: NAME
de: BEZEICHNUNG

source: e2label - Change the label on an ext2/ext3/ext4 file system
de: e2label - Die Bezeichnung eines Ext2/Ext3/Ext4-Dateisystems ändern

source: SYNOPSIS
de: ÜBERSICHT

source: B<e2label> I<device> [ I<volume-label> ]
de: B<e2label> I<Gerät> [ I<Datenträgerbezeichnung> ]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<e2label> will display or change the volume label on the ext2, ext3, or ext4 file system located on I<device.>
de: B<e2label> zeigt oder ändert die Datenträgerbezeichnung eines auf I<Gerät> befindlichen Ext2-, Ext3- oder Ext4-Dateisystems an.

source: If the optional argument I<volume-label> is not present, B<e2label> will simply display the current volume label.
de: Falls das optionale Argument I<Datenträgerbezeichnung> nicht vorhanden ist, wird B<e2label> einfach die aktuelle Datenträgerbezeichnung anzeigen.

source: If the optional argument I<volume-label> is present, then B<e2label> will set the volume label to be I<volume-label>. Ext2 volume labels can be at most 16 characters long; if I<volume-label> is longer than 16 characters, B<e2label> will truncate it and print a warning message.
de: Falls das optionale Argument I<Datenträgerbezeichnung> vorhanden ist, wird B<e2label> die Datenträgerbezeichnung auf I<Datenträgerbezeichnung> ändern. Ext2-Datenträgerbezeichnungen dürfen maximal 16 Zeichen lang sein; falls I<Datenträgerbezeichnung> länger als 16 Zeichen ist, dann wird B<e2label> sie abschneiden und eine Warnmeldung ausgeben.

source: It is also possible to set the volume label using the B<-L> option of B<tune2fs>(8).
de: Es ist auch möglich, die Datenträgerbezeichnung mittels der Option B<-L> von B<tune2fs>(8) zu setzen.

source: AUTHOR
de: AUTOR

source: B<e2label> was written by Theodore Ts'o (tytso@mit.edu).
de: B<e2label> wurde von Theodore Ts'o (tytso@mit.edu) geschrieben.

source: AVAILABILITY
de: VERFÜGBARKEIT

source: B<e2label> is part of the e2fsprogs package and is available from http://e2fsprogs.sourceforge.net.
de: B<e2label> ist Teil des Pakets »e2fsprogs« und ist von http://e2fsprogs.sourceforge.net verfügbar.

source: SEE ALSO
de: SIEHE AUCH
