Repository: sebras/manpages-l10n
Catalog: po/*/man8/e4defrag.8.po
Languages: de, pl

source: May 2009
de: Mai 2009
pl: maj 2009

source: e4defrag version 2.0
pl: e4defrag wersja 2.0

source: NAME
de: BEZEICHNUNG
pl: NAZWA

source: e4defrag - online defragmenter for ext4 file system
de: e4defrag - Online-Defragmentierprogramm für Ext4-Dateisysteme
pl: e4defrag - defragmentuje system plików ext4 w trybie online

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA

source: B<e4defrag> [ B<-c> ] [ B<-v> ] I<target> \&...
de: B<e4defrag> [ B<-c> ] [ B<-v> ] I<Ziel> …
pl: B<e4defrag> [ B<-c> ] [ B<-v> ] I<cel> \&...

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS

source: B<e4defrag> reduces fragmentation of extent based file. The file targeted by B<e4defrag> is created on ext4 file system made with "-O extent" option (see B<mke2fs>(8)). The targeted file gets more contiguous blocks and improves the file access speed.
de: B<e4defrag> reduziert die Fragmentierung einer extent-basiserten Datei. Die Datei, auf die B<e4defrag> zielt, wird auf einem mit der Option »-O extent« generierten Dateisystem erstellt (siehe B<mke2fs>(8)). Diese Datei erhält mehr fortlaufende Blöcke und die Dateizugriffszeit wird verbessert.
pl: Program B<e4defrag> redukuje fragmentację plików korzystających z ekstentów. Pliki przetwarzane przez B<e4defrag> powstają na systemie plików ext4 z opcją "-O extent" (zob. B<mke2fs>(8)). Finalnie zyskują większą ciągłość bloków i zwiększoną szybkość odczytu.

source: I<target> is a regular file, a directory, or a device that is mounted as ext4 file system. If I<target> is a directory, B<e4defrag> reduces fragmentation of all files in it. If I<target> is a device, B<e4defrag> gets the mount point of it and reduces fragmentation of all files in this mount point.
de: I<Ziel> ist eine reguläre Datei, ein Verzeichnis oder ein Gerät, das als Ext4-Dateisystem eingehängt ist. Falls I<Ziel> ein Verzeichnis ist, reduziert B<e4defrag> die Fragmentierung aller Dateien darin. Falls I<Ziel> ein Gerät ist, ermittelt B<e4defrag> den Einhängepunkt davon und reduziert die Fragmentierung aller Dateien in diesem Einhängepunkt.
pl: I<Cel> jest zwykłym plikiem, katalogiem lub urządzeniem zamontowanym jako system plików ext4. Jeśli I<cel> jest katalogiem, B<e4defrag> redukuje fragmentację wszystkich znajdujących się w nim plików. Jeśli natomiast I<cel> jest urządzeniem, to B<e4defrag> sprawdza jego punkt montowania i redukuje fragmentację wszystkich plików w danym punkcie montowania.

source: OPTIONS
de: OPTIONEN
pl: OPCJE

source: Get a current fragmentation count and an ideal fragmentation count, and calculate fragmentation score based on them. By seeing this score, we can determine whether we should execute B<e4defrag> to I<target>. When used with B<-v> option, the current fragmentation count and the ideal fragmentation count are printed for each file.
de: Erlangt eine aktuelle Fragmentierungsanzahl und eine ideale Fragmentierungsanzahl und berechnet eine darauf basierende Fragmentierungsbewertung. Aus dieser Bewertung kann abgeleitet werden, ob B<e4defrag> auf I<Ziel> angewandt werden sollte. Wird die Option B<-v> angewandt, werden die aktuelle Fragmentierungsanzahl und die ideale Fragmentierungsanzahl für jede Datei ausgegeben.
pl: Sprawdza bieżącą fragmentację oraz fragmentację idealną i w oparciu o te dane oblicza wynik fragmentacji. W ten sposób można określić czy I<cel> powinien zostać zdefragmentowany. Jeśli użyje się tej opcji razem z B<-v>, to bieżąca fragmentacja oraz wskaźnik fragmentacji idealnej jest wypisywany dla każdego pliku.

source: Also this option outputs the average data size in one extent. If you see it, you'll find the file has ideal extents or not. Note that the maximum extent size is 131072KB in ext4 file system (if block size is 4KB).
de: Diese Option gibt auch die durchschnittliche Datengröße in einem Extent aus. Daraus können Sie ablesen, ob die Datei ideale Extents hat oder nicht. Beachten Sie, dass die maximale Extentgröße in einem Ext4-Dateisystem 131072 kB (bei der Blockgröße 4 kB) ist.
pl: Opcja wypisuje również średni rozmiar danych w jednym ekstencie. Można wówczas określić, czy plik ma idealne ekstenty czy też nie. Proszę zauważyć, że maksymalny rozmiar ekstentu w systemie plików ext4 wynosi 131 072 KB (jeśli rozmiar bloku wynosi 4 KB)

source: If this option is specified, I<target> is never defragmented.
de: Falls diese Option angegeben ist, wird I<Ziel> niemals defragmentiert.
pl: Przy podaniu tej opcji I<cel> nigdy nie jest defragmentowany.

source: Print error messages and the fragmentation count before and after defrag for each file.
de: Gibt für jede Datei Fehlermeldungen und die Fragmentierungsanzahl vor und nach dem Defragmentieren aus.
pl: Wypisuje komunikaty o błędach oraz wskaźnik fragmentacji przed i po wykonaniu defragmentacji dla każdego pliku.

source: NOTES
de: ANMERKUNGEN
pl: UWAGI

source: B<e4defrag> does not support swap file, files in lost+found directory, and files allocated in indirect blocks. When I<target> is a device or a mount point, B<e4defrag> doesn't defragment files in mount point of other device.
de: B<e4defrag> unterstützt keine Auslagerungsdateien, Dateien im Verzeichnis lost+found und Dateien, die indirekte Blöcke reserviert haben. Wenn I<Ziel> ein Gerät oder ein Einhängepunkt ist, dann defragmentiert B<e4defrag> keine Dateien in Einhängepunkten anderer Geräte.
pl: Program B<e4defrag> nie obsługuje pliku wymiany, plików w katalogu I<lost+found> ani plików alokowanych w blokach pośrednich. Gdy I<cel> jest urządzeniem lub punktem montowania, B<e4defrag> nie defragmentuje plików w punkcie montowania innego urządzenia.

source: It is safe to run e4defrag on a file while it is actively in use by another application. Since the contents of file blocks are copied using the page cache, this can result in a performance slowdown to both e4defrag and the application due to contention over the system's memory and disk bandwidth.
de: Die Anwendung von B<e4defrag> auf Dateien, die aktiv benutzt werden, ist sicher. Da der Inhalt von Dateiblöcken mittels des Seitenzwischenspeichers kopiert wird, kann dies zu einem Leistungsabfall von sowohl B<e4defrag> als auch der Anwendung aufgrund von Konkurrenz über den Systemhauptspeicher und der Plattenbandbreite kommen.
pl: Można bezpiecznie uruchomić e4defrag na pliku, który jest aktywnie używany przez inny program. Zawartość bloków pliku jest kopiowana podczas buforowania strony, dlatego może to spowodować spowolnienie zarówno e4defrag jak i danego programu, ze względu na narzut na pamięć systemową i przepustowość dysku.

source: If the file system's free space is fragmented, or if there is insufficient free space available, e4defrag may not be able to improve the file's fragmentation.
de: Falls der freie Bereich des Dateisystems fragmentiert ist oder falls nicht ausreichend freier Platz zur Verfügung steht, könnte B<e4defrag> nicht in der Lage sein, die Fragmentierung der Datei zu verbessern.
pl: Jeśli wolna przestrzeń systemu plików jest pofragmentowana lub gdy jest jej zbyt mało, e4defrag może nie być w stanie poprawić fragmentacji plików.

source: Non-privileged users can execute B<e4defrag> to their own file, but the score is not printed if B<-c> option is specified. Therefore, it is desirable to be executed by root user.
de: Nicht privilegierte Benutzer können B<e4defrag> auf ihre eigene Datei ausführen, aber die Bewertungszahl wird bei der Angabe der Option B<-c> nicht angezeigt. Daher wird empfohlen, das Programm als Benutzer root auszuführen.
pl: Użytkownicy nieuprzywilejowani mogą wykonać B<e4defrag> na swoim pliku, lecz gdy poda się opcję B<-c> wynik i tak nie jest wypisywany. Z tego powodu zaleca się aby program był uruchamiany przez roota.

source: AUTHOR
de: AUTOR
pl: AUTOR

source: Written by Akira Fujita E<lt>a-fujita@rs.jp.nec.comE<gt> and Takashi Sato E<lt>t-sato@yk.jp.nec.comE<gt>.
de: Geschrieben von Akira Fujita E<lt>a-fujita@rs.jp.nec.comE<gt> und Takashi Sato E<lt>t-sato@yk.jp.nec.comE<gt>.
pl: Autorami są Akira Fujita E<lt>a-fujita@rs.jp.nec.comE<gt> i Takashi Sato E<lt>t-sato@yk.jp.nec.comE<gt>.

source: SEE ALSO
de: SIEHE AUCH
pl: ZOBACZ TAKŻE
