Repository: sebras/manpages-l10n
Catalog: po/*/man8/exportfs.8.po
Languages: de, fr

source: NAME
de: BEZEICHNUNG
fr: NOM

source: exportfs - maintain table of exported NFS file systems
de: exportfs - die Tabelle der exportierten NFS-Dateisysteme verwalten
fr: exportfs – Gestion de la table des systèmes de fichiers partagés par NFS

source: SYNOPSIS
de: ÜBERSICHT

source: B</usr/sbin/exportfs [-avi] [-o >I<options,..>B<] [>I<client:/path>B< ..]>
de: B</usr/sbin/exportfs [-avi] [-o >I<Optionen, … >B<] [>I<Client:/Pfad>B< … ]>
fr: B</usr/sbin/exportfs> [B<-avi>] [B<-o> I<options>,...] [I<client:/chemin> ...]

source: B</usr/sbin/exportfs [-av] -u [>I<client:/path>B< ..]>
de: B</usr/sbin/exportfs [-av] -u [>I<Client:/Pfad>B< … ]>
fr: B</usr/sbin/exportfs> [B<-av>] B<-u> [I<client:/chemin> ...]

source: DESCRIPTION
de: BESCHREIBUNG

source: An NFS server maintains a table of local physical file systems that are accessible to NFS clients. Each file system in this table is referred to as an I<exported file system>, or I<export>, for short.
de: Ein NFS-Server verwaltet eine Tabelle lokaler physischer Dateisysteme, auf die NFS-Clients zugreifen können. Jedes Dateisystem in dieser Tabelle ist ein I<exportiertes Dateisystem> oder kurz ein I<Export>.
fr: Un serveur NFS tient à jour une table des systèmes de fichiers physiques locaux accessibles aux clients NFS. Chaque système de fichiers de cette table est appelé I<système de fichiers partagé>, ou alors I<partage> en plus court.

source: The B<exportfs> command maintains the current table of exports for the NFS server. The master export table is kept in a file named I</var/lib/nfs/etab>. This file is read by B<rpc.mountd> when a client sends an NFS MOUNT request.
de: Der Befehl B<exportfs> verwaltet die aktuelle Tabelle der Exporte für den NFS-Server. Die Hauptexporttabelle befindet sich in einer Datei namens I</var/lib/nfs/etab>. Diese Datei wird von B<rpc.mountd> gelesen, wenn ein Client eine NFS-MOUNT-Anfrage sendet.
fr: La commande B<exportfs> est utilisée pour la gestion de la table actuelle de systèmes de fichiers partagés du serveur NFS. Cette table est enregistrée dans un fichier nommé I</var/lib/nfs/etab>. Ce fichier sera lu par B<rpc.mountd> dès qu'un client distant enverra une requête NFS MOUNT.

source: Normally the master export table is initialized with the contents of I</etc/exports> and files under I</etc/exports.d> by invoking B<exportfs -a>. However, a system administrator can choose to add or delete exports without modifying I</etc/exports> or files under I</etc/exports.d> by using the B<exportfs> command.
de: Normalerweise wird die Hauptexporttabelle mit dem Inhalt von I</etc/exports> und den Dateien unter I</etc/exports.d> durch Aufruf von B<exportfs -a> initialisiert. Jedoch kann ein Systemadministrator mit dem Befehl B<exportfs> Exporte hinzufügen oder entfernen, ohne I</etc/exports> oder die Dateien unter I</etc/exports.d> zu bearbeiten.
fr: Dans le cas général, la table principale des partages est initialisée à partir du contenu du fichier I</etc/exports> et des fichiers présents dans I</etc/exports.d/> à l'aide de la commande B<exportfs -a>. Cependant, un administrateur système peut ajouter ou supprimer des partages sans modifier I</etc/exports> ou les fichiers sous I</etc/exports.d/> à l'aide de la commande B<exportfs>.

source: B<exportfs> and its partner program B<rpc.mountd> work in one of two modes: a legacy mode which applies to 2.4 and earlier versions of the Linux kernel, and a new mode which applies to 2.6 and later versions, providing the B<nfsd> virtual filesystem has been mounted at I</proc/fs/nfsd> or I</proc/fs/nfs>. On 2.6 kernels, if this filesystem is not mounted, the legacy mode is used.
de: B<exportfs> und dessen Partnerprogramm B<rpc.mountd> arbeiten in einem von zwei Modi: einem klassischen Modus für Kernelversionen bis 2.4 und einem neuen Modus für 2.6 und neuere Versionen, vorausgesetzt, das virtuelle B<nfsd>-Dateisystem wurde unter I</proc/fs/nfsd> oder I</proc/fs/nfs> eingehängt. Wenn in Kerneln der Version 2.6 das Dateisystem nicht eingehängt ist, wird der klassische Modus verwendet.
fr: B<exportfs> et son programme associé B<rpc.mountd> fonctionnent sous l'un des deux modes suivants : le mode traditionnel, qui s'applique aux versions 2.4 et précédentes du noyau Linux, et un mode plus récent pour les noyaux 2.6 et suivants, à condition que le système de fichiers virtuel B<nfsd> soit bien monté sous I</proc/fs/nfsd> ou I</proc/fs/nfs>. Pour les noyaux 2.6, si ce système de fichiers n'est pas monté, c'est le mode traditionnel qui sera utilisé.

source: In the new mode, B<exportfs> does not give any information to the kernel, but provides it only to B<rpc.mountd> through the I</var/lib/nfs/etab> file. B<rpc.mountd> then manages kernel requests for information about exports, as needed.
de: Im neuen Modus sendet B<exportfs> keine Informationen an den Kernel, sondern stellt diese in der Datei I</var/lib/nfs/etab> für B<rpc.mountd> bereit. B<rpc.mountd> verwaltet dann die Kernelanfragen nach Informationen zu Exporten, falls nötig.
fr: Dans le mode plus récent, B<exportfs> ne donne aucune information au noyau, il n'en fournit qu'à B<rpc.mountd> par l'intermédiaire du fichier I</var/lib/nfs/etab>. B<rpc.mountd> gère alors les requêtes du noyau pour obtenir les renseignements nécessaires à propos des partages.

source: In the legacy mode, exports which identify a specific host, rather than a subnet or netgroup, are entered directly into the kernel's export table, as well as being written to I</var/lib/nfs/etab>. Further, exports listed in I</var/lib/nfs/rmtab> which match a non host-specific export request will cause an appropriate export entry for the host given in I<rmtab> to be added to the kernel's export table.
de: Im klassischen Modus werden Exporte, die einen bestimmten Rechner und kein Subnetz oder eine Netzgruppe identifizieren, sowohl direkt in die Kernel-Exporttabelle eingegeben als auch in die Datei I</var/lib/nfs/etab> geschrieben. Weiterhin erhalten die in I</var/lib/nfs/rmtab> aufgeführten Exporte, die einem nicht-rechnerspezifischen Export entsprechen, einen entsprechenden Exporteintrag für den in I<rmtab> angegebenen Rechner in der Kernel-Exporttabelle.
fr: Dans le mode traditionnel, les partages qui indiquent un hôte spécifique, plutôt qu'un sous-réseau ou un groupe de machines, sont directement inscrits dans la table des partages du noyau ainsi que dans le fichier I</var/lib/nfs/etab>. De plus, tous les partages définis dans I</var/lib/nfs/rmtab>, correspondant à une demande de partage non spécifique à un hôte, entraîneront l'ajout dans la table des partages du noyau d'une entrée appropriée pour l'hôte indiqué dans I<rmtab>.

source: OPTIONS
de: OPTIONEN

source: B<-d kind or --debug kind>
de: B<-d Art oder --debug Art>
fr: B<-d>, B<--debug> I<catégorie>

source: Turn on debugging. Valid kinds are: all, auth, call, general and parse. Debugging can also be turned on by setting B<debug=> in the B<[exportfs]> section of I</etc/nfs.conf>.
de: aktiviert Debugging. Gültige Arten sind: all, auth, call, general und parse. Debugging kann auch mit der Einstellung B<debug=> im Abschnitt B<[exportfs]> der Datei I</etc/nfs.conf> aktiviert werden.
fr: Activer le mode débogage. Les catégories possibles sont : B<all>, B<auth>, B<call>, B<general> et B<parse>. Le débogage peut être aussi activé en réglant B<debug=> dans la section B<[exportfs]> de I</etc/nfs.conf>.

source: Export or unexport all directories.
de: exportiert alle Verzeichnisse oder macht deren Export rückgängig (deexportiert sie).
fr: Activer ou interrompre le partage de tous les répertoires.

source: B<-o >I<options,...>
de: B<-o >I<Optionen, …>

source: Specify a list of export options in the same manner as in B<exports>(5).
de: gibt eine Liste der Exportoptionen auf die gleiche Weise wie in B<exports>(5) an.
fr: Indiquer une liste d'options de partage, à la manière de B<exports>(5).

source: Ignore the I</etc/exports> file and files under I</etc/exports.d> directory. Only default options and options given on the command line are used.
de: ignoriert die Datei I</etc/exports> und die Dateien im Verzeichnis I</etc/exports.d>. Es werden nur Standardoptionen und die in der Befehlszeile übergebenen Optionen verwendet.
fr: Ne pas tenir compte du fichier I</etc/exports> ni des fichiers dans le répertoire I</etc/exports.d/>. Seules les options par défaut ou celles données sur la ligne de commande sont utilisées.

source: Reexport all directories, synchronizing I</var/lib/nfs/etab> with I</etc/exports> and files under I</etc/exports.d>. This option removes entries in I</var/lib/nfs/etab> which have been deleted from I</etc/exports> or files under I</etc/exports.d>, and removes any entries from the kernel export table which are no longer valid.
de: reexportiert alle Verzeichnisse, wobei I</var/lib/nfs/etab> mit I</etc/exports> und den Dateien unter I</etc/exports.d> synchronisiert wird. Diese Option entfernt Einträge in I</var/lib/nfs/etab>, die in I</etc/exports> oder den Dateien unter I</etc/exports.d> gelöscht wurden und entfernt Einträge aus der Kernel-Exporttabelle, die nicht mehr gültig sind.
fr: Relancer le partage de tous les répertoires. I</var/lib/nfs/etab> est synchronisé avec I</etc/exports> et les fichiers dans I</etc/exports.d>. Avec cette option, les entrées qui ont disparu de I</etc/exports> ou des fichiers dans I</etc/exports.d> seront supprimées de I</var/lib/nfs/etab>. Dans la table des partages du noyau, les entrées qui ne sont plus valables seront également enlevées.

source: Unexport one or more directories.
de: macht den Export eines oder mehrerer Verzeichnisse rückgängig (deexportiert sie).
fr: Interrompre le partage d'un ou plusieurs répertoires.

source: If I</proc/fs/nfsd> or I</proc/fs/nfs> is mounted, flush everything out of the kernel's export table. Fresh entries for active clients are added to the kernel's export table by B<rpc.mountd> when they make their next NFS mount request.
de: bewirkt, dass alles aus der Kernel-Exporttabelle gelöscht wird, falls I</proc/fs/nfsd> oder I</proc/fs/nfs> eingehängt ist. Neue Einträge für aktive Clients werden durch B<rpc.mountd> zur Kernel-Exporttabelle hinzugefügt, wenn sie ihre nächste NFS-Einhängeanfrage stellen.
fr: Si I</proc/fs/nfsd> ou I</proc/fs/nfs> sont montés, éliminer tout de la table des partages du noyau. Les nouvelles entrées pour des clients actifs sont ajoutées à la liste des partages du noyau par B<rpc.mountd> lors de leur prochaine requête de montage NFS.

source: Be verbose. When exporting or unexporting, show what's going on. When displaying the current export list, also display the list of export options.
de: aktiviert den ausführlichen Modus. Beim Exportieren oder Deexportieren wird angezeigt, was passiert. In der aktuellen Exportliste werden auch die Exportoptionen angezeigt.
fr: Mode détaillé. Lors d'un partage ou de l'arrêt d'un partage, afficher ce qui se passe. Lors de l'affichage de la liste actuelle des partages, afficher aussi la liste des options de partage.

source: Display the current export list suitable for /etc/exports.
de: zeigt die aktuelle für /etc/exports geeignete Exportliste an.
fr: Afficher la liste actuelle de partages, applicable pour I</etc/exports>.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI
fr: FICHIER DE CONFIGURATION

source: The B<[exportfs]> section of the I</etc/nfs.conf> configuration file can contain a B<debug> value, which can be one or more from the list B<general>, B<call>, B<auth>, B<parse>, B<all>. When a list is given, the members should be comma-separated.
de: Der Abschnitt B<[exportfs]> der Konfigurationsdatei I</etc/nfs.conf> kann einen oder mehrere B<debug>-Werte enthalten, der B<general>, B<call>, B<auth>, B<parse>, B<all> sein kann. Wenn eine Liste mehrere dieser Werte angegeben ist, sollten die einzelnen Werte durch Kommata getrennt werden.
fr: La section B<[exportfs]> du fichier de configuration I</etc/nfs.conf> peut contenir une valeur B<debug>, qui peut être un élément ou plus de la liste B<general>, B<call>, B<auth>, B<parse>, B<all>. Si une liste est fournie, les éléments doivent être séparés par des virgules.

source: B<exportfs> will also recognize the B<state-directory-path> value from both the B<[mountd]> section and the B<[exportd]> section
de: B<exportfs> berücksichtigt auch den Wert B<state-directory-path> aus den Abschnitten B<[mountd]> und B<[exportd]>.
fr: B<exportfs> admet aussi la valeur B<state-directory-path> à la fois de la section B<[mountd]> et de la section B<[exportd]>.

source: DISCUSSION
de: BESPRECHUNG

source: Exporting Directories
de: Verzeichnisse exportieren
fr: Partage de répertoires

source: The first synopsis shows how to invoke B<exportfs> when adding new entries to the export table. When using B<exportfs -a>, all exports listed in I</etc/exports> and files under I</etc/exports.d> are added to I</var/lib/nfs/etab>. The kernel's export table is also updated as needed.
de: Die oben stehende erste Übersicht zeigt, wie B<exportfs> aufgerufen wird, um neue Einträge zur Exporttabelle hinzuzufügen. Wenn Sie B<exportfs -a> aufrufen, werden alle in I</etc/exports> und den Dateien unter I</etc/exports.d> zu den in I</var/lib/nfs/etab> aufgeführten Exporten hinzugefügt. Die Kernel-Exporttabelle wird ebenfalls aktualisiert, falls nötig.
fr: Le premier synopsis montre comment utiliser la commande B<exportfs> pour ajouter de nouvelles entrées à la table des partages. Quand on lance B<exportfs -a>, tous les partages listés dans I</etc/exports> et les fichiers dans I</etc/exports.d> sont ajoutés à I</var/lib/nfs/etab>. La table des partages du noyau est également mise à jour au besoin.

source: The I<host:/path> argument specifies a local directory to export, along with the client or clients who are permitted to access it. See B<exports(5)> for a description of supported options and access list formats.
de: Das Argument I<Rechner:/Pfad> gibt ein lokales zu exportierendes Verzeichnis an; zusammen mit dem Client oder den Clients, denen der Zugriff darauf gestattet ist. In B<exports>(5) finden Sie eine Beschreibung der unterstützten Optionen und Formaten der Zugriffslisten.
fr: L'argument I<hôte:/chemin> définit un répertoire local à partager ainsi que le ou les clients qui ont le droit d'y accéder. Consultez B<exports>(5) pour obtenir une description des options prises en charge ainsi que les formats de liste d'accès.

source: IPv6 presentation addresses contain colons, which are already used to separate the "host" and "path" command line arguments. When specifying a client using a raw IPv6 address, enclose the address in square brackets. For IPv6 network addresses, place the prefix just after the closing bracket.
de: Die Darstellung von IPv6-Adressen enthält Doppelpunkte, die bereits zum Trennen der Befehlszeilenargumente »Rechner« und »Pfad« verwendet werden. Wenn Sie einen Client in Form einer rohen IPv6-Adresse angeben, schließen Sie die Adresse in eckige Klammern ein. Bei IPv6-Netzwerkadressen setzen Sie das Präfix direkt hinter die schließende Klammer.
fr: Les adresses de forme IPv6 contiennent des deux-points qui sont déjà utilisés pour séparer les arguments « hôte » et « chemin » de la ligne de commande. Lors de l’indication avec une adresse IPv6 brute, l’adresse doit être mise entre crochets. Pour les adresses réseau IPv6, le préfixe doit être placé après le crochet fermant.

source: To export a directory to the world, simply specify I<:/path>.
de: Um ein Verzeichnis in die Welt hinaus zu exportieren, geben Sie einfach I<:/Pfad> an.
fr: Pour partager un répertoire avec tout le monde, indiquez tout simplement I<:/chemin>.

source: The export options for a particular host/directory pair derive from several sources. The default export options are B<sync,ro,root_squash,wdelay>. These can be overridden by entries in I</etc/exports> or files under I</etc/exports.d>.
de: Die Exportoptionen für ein bestimmtes Rechner/Verzeichnis-Paar werden aus verschiedenen Quellen abgeleitet. Die vorgegebenen Exportoptionen sind B<sync,ro,root_squash,wdelay>. Diese können durch die Einträge in I</etc/exports> oder den Dateien unter I</etc/exports.d> außer Kraft gesetzt werden.
fr: Les options de partage pour une paire hôte/répertoire donnée proviennent de plusieurs sources. Les options de partage par défaut sont B<sync,ro,root_squash,wdelay>. Elles peuvent être surchargées par les entrées du fichier I</etc/exports> ou dans les fichiers de I</etc/exports.d>.

source: A system administrator may override options from these sources using the B<-o> command-line option on B<exportfs>. This option takes a comma-separated list of options in the same fashion as one would specify them in I</etc/exports>. In this way B<exportfs> can be used to modify the export options of an already exported directory.
de: Ein Systemadministrator kann die Optionen aus diesen Quellen außer Kraft setzen, indem er B<exportfs> mit der Befehlszeilenoption B<-o> verwendet. Diese Option akzeptiert eine durch Kommata getrennte Liste von Optionen in der gleichen Form, wie sie in I</etc/exports> angegeben wird. Auf diese Weise kann B<exportfs> zum Ändern der Exportoptionen eines bereits exportierten Verzeichnisses verwendet werden.
fr: Un administrateur système peut surcharger les options de ces sources à l'aide de l'option B<-o> d'B<exportfs>. Cette option utilise une liste d'options séparées par des virgules de manière similaire à ce qui serait fait si ces options étaient écrites dans le fichier I</etc/exports>. Ainsi, B<exportfs> peut être utilisé pour modifier les options de partage d'un répertoire déjà partagé.

source: Unexporting Directories
de: Deexportieren von Verzeichnissen
fr: Arrêt du partage de répertoires

source: The third synopsis shows how to unexport a currently exported directory. When using B<exportfs -ua>, all entries listed in I</var/lib/nfs/etab> are removed from the kernel export tables, and the file is cleared. This effectively shuts down all NFS activity.
de: Die dritte Übersicht zeigt, wie ein aktuell exportiertes Verzeichnis deexportiert werden kann. Wenn Sie B<exportfs -ua> aufrufen, werden alle in I</var/lib/nfs/etab> aufgeführten Einträge aus der Kernel-Exporttabelle entfernt und die Datei aufgeräumt. Dadurch werden effektiv alle NFS-Aktivitäten heruntergefahren.
fr: Le troisième synopsis montre comment arrêter le partage d'un répertoire actuellement offert. Quand on lance B<exportfs -ua>, toutes les entrées présentes dans I</var/lib/nfs/etab> sont retirées de la table des partages du noyau, puis le fichier est effacé. Cela stoppe efficacement toute activité NFS.

source: To remove an export, specify a I<host:/path> pair. This deletes the specified entry from I</var/lib/nfs/etab> and removes the corresponding kernel entry (if any).
de: Um einen Export zu entfernen, geben Sie ein I<Rechner:/Pfad>-Paar an. Dadurch wird der angegebene Eintrag in I</var/lib/nfs/etab> gelöscht und der zugehörige Kerneleintrag entfernt (falls vorhanden).
fr: Pour supprimer une entrée de partage, vous pouvez indiquer un couple I<hôte:/chemin>. L'entrée indiquée sera supprimée de I</var/lib/nfs/etab>, ainsi que celle correspondante dans le noyau (si elle existe).

source: Dumping the Export Table
de: Die Exporttabelle ausgeben
fr: Affichage du contenu de la table des partages

source: Invoking B<exportfs> without options shows the current list of exported file systems. Adding the B<-v> option causes B<exportfs> to display the export options for each export.
de: Der Aufruf von B<exportfs> ohne Optionen zeigt die aktuelle Liste der exportierten Dateisysteme an. Mit der Option B<-v> zeigt B<exportfs> die Exportlisten für jeden Export an.
fr: L'utilisation de B<exportfs> sans option affiche la liste actuelle des systèmes de fichiers partagés. Avec l'option B<-v>, B<exportfs> affiche les options spécifiques à chaque partage.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: The following adds all directories listed in I</etc/exports> and files under I</etc/exports.d> to I</var/lib/nfs/etab> and pushes the resulting export entries into the kernel:
de: Im folgenden Beispiel werden alle in I</etc/exports> und den Dateien unter I</etc/exports.d> aufgeführten Verzeichnisse zu I</var/lib/nfs/etab> hinzugefügt und die sich ergebenden Exporteinträge an den Kernel gemeldet:
fr: L'exemple suivant ajoute tous les répertoires indiqués dans I</etc/exports> et les fichiers dans I</etc/exports.d> à I</var/lib/nfs/etab>, puis les entrées de partages résultantes sont inscrites dans le noyau :

source: To export the I</usr/tmp> directory to host B<django>, allowing insecure file locking requests from clients:
de: Exportieren des Verzeichnisses I</usr/tmp> zum Rechner B<django> und unsichere Dateisperranfragen von Clients zulassen:
fr: Pour offrir le répertoire I</usr/tmp> à l'hôte B<django>, en permettant les requêtes non sécurisées de verrouillage de fichier des clients :

source: To unexport the I</usr/tmp> directory:
de: Deexportieren des Verzeichnisses I</usr/tmp>:
fr: Pour cesser de partager le répertoire I</usr/tmp> :

source: To unexport all exports listed in I</etc/exports> and files under I</etc/exports.d>:
de: Deexportieren aller in I</etc/exports> und den Dateien unter I</etc/exports.d> aufgeführten Exporte:
fr: Pour cesser de partager tous les partages indiqués dans I</etc/exports> et les fichiers dans I</etc/exports.d> :

source: To export the I</usr/tmp> directory to IPv6 link-local clients:
de: Exportieren des Verzeichnisses I</usr/tmp> an link-lokale IPv6-Clients:
fr: Pour partager le répertoire I</usr/tmp> avec des clients IPv6 locaux :

source: USAGE NOTES
de: HINWEISE ZUR BENUTZUNG
fr: NOTES D'UTILISATION

source: Exporting to IP networks or DNS and NIS domains does not enable clients from these groups to access NFS immediately. Rather, these sorts of exports are hints to B<rpc.mountd>(8) to grant any mount requests from these clients. This is usually not a problem, because any existing mounts are preserved in I<rmtab> across reboots.
de: Das Exportieren zu IP-Netzwerken oder DNS- und NIS-Domains erlaubt den Clients nicht, von diesen Gruppen auf NFS unmittelbar zuzugreifen. Stattdessen sind diese Arten von Exporten Hinweise an B<rpc.mountd>(8) zum Erlauben jeglicher Einhängeanfragen dieser Clients. Dies ist normalerweise kein Problem, da alle existierenden Einhängungen in I<rmtab> auch nach einem Neustart noch vorhanden sind.
fr: Le partage à destination de réseaux IP ou de domaines DNS et NIS ne permet pas l'accès NFS immédiat aux clients NFS de ces groupes. En fait, ce type de partage est une indication pour B<rpc.mountd(8)> d'honorer toute requête de montage provenant de ces clients. Ce n'est normalement pas un gros problème, puisque tout montage existant est préservé dans I<rmtab> de redémarrage en redémarrage.

source: When unexporting a network or domain entry, any current exports to members of this group will be checked against the remaining valid exports and if they themselves are no longer valid they will be removed.
de: Beim Deexportieren eines Netzwerk- oder Domain-Eintrags werden alle aktuellen Exporte an Mitglieder dieser Gruppe gegen die verbleibenden gültigen Exporte geprüft. Falls diese Exporte nicht mehr gültig sind, werden sie entfernt.
fr: Lors de l'arrêt d'un partage à destination de domaines ou de réseaux, tout partage en cours pour les membres de ce groupe sera vérifié par rapport à la liste des partages autorisés restants. Dans le cas où ce partage n'est alors plus autorisé, il est supprimé.

source: FILES
de: DATEIEN
fr: FICHIERS

source: input file listing exports, export options, and access control lists
de: Eingabedatei, welche die Exporte, die Exportoptionen und die Zugriffssteuerlisten aufführt
fr: Fichier d'entrées contenant la liste des partages, leurs options et la liste des contrôles d'accès.
