Repository: sebras/manpages-l10n
Catalog: po/*/man8/exportfs.8.po
Languages: de, fr

source: directory where extra input files are stored. B<Note:> only files that end with I<.exports> are used.
de: Verzeichnis, in dem zusätzliche Eingabedateien gespeichert werden. B<Hinweis>: Es werden nur Dateien mit der Endung I<.exports> verwendet.
fr: Répertoire où les fichiers d'entrée supplémentaires sont stockés. B<Note :> uniquement les fichiers se terminant par I<.exports> sont utilisés.

source: master table of exports
de: Haupttabelle der Exporte
fr: Liste principale des partages.

source: table of clients accessing server's exports
de: Tabelle der Clients, die auf die Exporte des Servers zugreifen
fr: Liste des clients se connectant aux partages du serveur.

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: AUTHORS
de: AUTOREN
fr: AUTEURS

source: Turn on debugging. Valid kinds are: all, auth, call, general and parse.
de: aktiviert Debugging. Gültige Arten sind: all, auth, call, general und parse.
fr: Activer le mode de débogage. Les catégories possibles sont : B<all>, B<auth>, B<call>, B<general> et B<parse>.

source: 30 September 2013
fr: 30 septembre 2013

source: B</usr/sbin/exportfs -r [-v]>
fr: B</usr/sbin/exportfs -r> [B<-v>]

source: B</usr/sbin/exportfs [-v]>
fr: B</usr/sbin/exportfs> [B<-v>]
