Repository: sebras/manpages-l10n
Catalog: po/*/man8/fatlabel.8.po
Languages: de, fr

source: NAME
de: BEZEICHNUNG
fr: NOM

source: fatlabel - set or get MS-DOS filesystem label or volume ID
de: fatlabel - MS-DOS-Dateisystembezeichnung oder Datenträgerkennung festlegen oder abfragen
fr: fatlabel – Définir ou obtenir l’étiquette ou le nom de volume d'un système de fichiers MS-DOS

source: SYNOPSIS
de: ÜBERSICHT

source: B<fatlabel> [I<OPTIONS>] I<DEVICE> [I<NEW>]
de: B<fatlabel> [I<OPTIONEN>] I<GERÄT> [I<NEU>]
fr: B<fatlabel> [I<OPTIONS>] I<PÉRIPHÉRIQUE> [I<NEW>]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<fatlabel> will display or change the volume label or volume ID on the MS-DOS filesystem located on I<DEVICE>. By default it works in label mode. It can be switched to volume ID mode with the option B<-i> or B<--volume-id>.
de: B<fatlabel> zeigt oder ändert die Datenträgerbezeichnung oder -kennung des auf dem angegebenen I<GERÄT> befindlichen MS-DOS-Dateisystems. Standardmäßig zeigt es die Bezeichnung an oder ändert diese. Aus diesem Bezeichnungs-Modus können Sie mit der Option B<-i> oder B<--volume-id> in den Datenträgerkennungs-Modus wechseln.
fr: B<fatlabel> affiche ou modifie l’étiquette ou l’ID de volume du système de fichiers MS-DOS situé dans I<PÉRIPHÉRIQUE>. Par défaut, il fonctionne dans le mode étiquette (LABEL). Cela peut être en mode ID de volume avec les options B<-i> ou B<--volume-id>.

source: If I<NEW> is omitted, then the existing label or volume ID is written to the standard output. A label can't be longer than 11 bytes and should be in all upper case for best compatibility. An empty string or a label consisting only of white space is not allowed. A volume ID must be given as a hexadecimal number (no leading "0x" or similar) and must fit into 32 bits.
de: Falls I<NEU> nicht angegeben ist, dann wird die vorhandene Datenträgerbezeichnung oder -kennung in die Standardausgabe geschrieben. Eine Bezeichnung darf nicht länger als 11 Byte sein und sollte zwecks bestmöglicher Kompatibilität in Großbuchstaben geschrieben werden. Eine leere Zeichenkette, die nur aus Leerraum besteht, ist nicht zulässig. Eine Datenträgerkennung muss als Hexadezimalzahl angegeben werden (kein vorangestelltes »0x« oder Ähnliches) und darf nicht größer als 32 Bit sein.
fr: Si I<NEW> est omis, alors l’étiquette existante ou l’ID de volume est écrit sur la sortie standard. Une étiquette ne peut être plus longue que 11 octets et devrait être en capitales pour une meilleure compatibilité. Une chaîne vide ou une étiquette comprenant seulement des espaces blancs ne sont pas autorisées. Un ID de volume doit être donné sous forme hexadécimale (pas de « 0x » ou similaire au début) et doit pouvoir s'écrire sur au plus 32 bits.

source: OPTIONS
de: OPTIONEN

source: Switch to volume ID mode.
de: wechselt in den Datenträgerkennung-Modus.
fr: Basculer en mode ID de volume.

source: Remove label in label mode or generate new ID in volume ID mode.
de: enfernt im Bezeichnungs-Modus die Bezeichnung oder erzeugt im Datenträgerkennungs-Modus eine neue Kennung.
fr: Supprimer l’étiquette dans le mode étiquette ou générer un nouvel ID de volume dans le mode ID de volume.

source: B<-c> I<PAGE>, B<--codepage>=I<PAGE>
de: B<-c> I<TABELLE>, B<--codepage>=I<TABELLE>

source: Use DOS codepage I<PAGE> to encode/decode label. By default codepage 850 is used.
de: verwendet die angegebene DOS-Zeichensatz-I<TABELLE> zum Kodieren/Dekodieren der Bezeichnung. Standardmäßig wird die Zeichensatztabelle 850 verwendet.
fr: Utiliser la page de code DOS I<PAGE> pour décoder ou encoder l’étiquette. Par défaut, la page de code 850 est utilisée.

source: Display a help message and terminate.
de: zeigt eine Hilfemeldung an und beendet das Programm.
fr: Afficher un message d'aide puis quitter.

source: Show version number and terminate.
de: gibt die Versionsnummer aus und beendet das Programm.
fr: Afficher le nom et la version du logiciel et quitter.

source: COMPATIBILITY and BUGS
de: KOMPATIBILITÄT UND FEHLER
fr: COMPATIBILITÉ et BOGUES

source: For historic reasons FAT label is stored in two different locations: in the boot sector and as a special volume label entry in the root directory. MS-DOS 5.00, MS-DOS 6.22, MS-DOS 7.10, Windows 98, Windows XP and also Windows 10 read FAT label only from the root directory. Absence of the volume label in the root directory is interpreted as empty or none label, even if boot sector contains some valid label.
de: Aus historischen Gründen ist die FAT-Datenträgerbezeichnung an zwei Stellen gespeichert: im Bootsektor und als spezieller Datenträgerbezeichnungseintrag im Wurzelverzeichnis. MS-DOS 5.00, MS-DOS 6.22, MS-DOS 7.10, Windows 98, Windows XP und auch Windows 10 lesen die FAT-Datenträgerbezeichnung nur aus dem Wurzelverzeichnis. Ist im Wurzelverzeichnis keine Datenträgerbezeichnung vorhanden, wird dies als leere oder keine Bezeichnung interpretiert, selbst dann, wenn der Bootsektor eine gültige Bezeichnung enthält.
fr: Pour des raisons historiques l’étiquette FAT est stockée dans deux endroits différents : dans le secteur d’amorçage et dans une entrée spéciale d’étiquette de volume dans le répertoire racine. MS-DOS 5.00, MS-DOS 6.22, MS-DOS 7.10, Windows 98, Windows XP et aussi Windows 10 lisent l’étiquette FAT seulement dans le répertoire racine. Une absence d’étiquette de volume dans le répertoire racine est interprétée comme une étiquette vide ou comme son absence, même si le secteur d’amorçage contient une étiquette valable.

source: When Windows XP or Windows 10 system changes a FAT label it stores it only in the root directory \(em letting boot sector unchanged. Which leads to problems when a label is removed on Windows. Old label is still stored in the boot sector but is removed from the root directory.
de: Wenn Windows XP oder Windows 10 eine FAT-Datenträgerbezeichnung ändert, wird diese nur im Wurzelverzeichnis gespeichert – der Bootsektor bleibt unverändert. Dies führt zu Problemen beim Entfernen einer Datenträgerbezeichnung unter Windows. Die alte Bezeichnung ist noch im Bootsektor gespeichert, während sie im Wurzelverzeichnis nicht mehr vorhanden ist.
fr: Quand les systèmes Windows XP ou Windows 10 modifient l’étiquette FAT, ils la stockent uniquement dans le répertoire racine \(em en laissant le secteur d’amorçage inchangé. Cela crée des problèmes quand une étiquette est supprimée sur Windows. L’ancienne étiquette est toujours stockée dans le secteur d’amorçage, mais est supprimée dans le répertoire racine.

source: B<dosfslabel> prior to the version 3.0.7 operated only with FAT labels stored in the boot sector, completely ignoring a volume label in the root directory.
de: Versionen von B<dosfslabel> vor 3.0.7 agierten nur auf den im Bootsektor gespeicherten FAT-Datenträgerbezeichnungen und ignorierten eine Datenträgerbezeichung im Wurzelverzeichnis völlig.
fr: B<dosfslabel> avant sa version 3.0.7 opérait avec les étiquettes FAT stockées dans le secteur d’amorçage, ignorant complètement une étiquette de volume dans le répertoire racine.

source: B<dosfslabel> in versions 3.0.7\(en3.0.15 reads FAT labels from the root directory and in case of absence, it fallbacks to a label stored in the boot sector. Change operation resulted in updating a label in the boot sector and I<sometimes> also in the root directory due to the bug. That bug was fixed in B<dosfslabel> version 3.0.16 and since this version B<dosfslabel> updates label in both location.
de: Versionen von B<dosfslabel> von 3.0.7 bis 3.0.15 lesen die Datenträgerbezeichnungen aus dem Wurzelverzeichnis und weichen gegebenenfalls auf den Bootsektor aus. Dies führt dazu, dass eine Datenträgerbezeichnung aufgrund dieses Fehlers immer im Bootsektor, jedoch nur I<manchmal> im Wurzelverzeichnis geändert wird. Dieser Fehler wurde in der B<dosfslabel>-Version 3.0.16 korrigiert; seither werden die Datenträgerbezeichnungen durch B<dosfslabel> an beiden Orten aktualisiert.
fr: B<dosfslabel> dans les versions 3.0.7\(en3.0.15 lit les étiquettes FAT dans le répertoire racine et, en leur absence, se replie sur l’étiquette stockée dans le secteur d’amorçage. L’opération de change aboutit à mettre à jour une étiquette dans le secteur d’amorçage et I<parfois> aussi dans le répertoire racine à cause du bogue. Celui-ci a été corrigé dans B<dosfslabel> version 3.0.16 et depuis cette version, B<dosfslabel> met à jour l’étiquette dans les deux endroits.

source: Since version 4.2, B<fatlabel> reads a FAT label only from the root directory (like MS-DOS and Windows systems), but changes a FAT label in both locations. In version 4.2 was fixed handling of empty labels and labels which starts with a byte 0xE5. Also in this version was added support for non-ASCII labels according to the specified DOS codepage and were added checks if a new label is valid.
de: Seit Version 4.2 liest B<fatlabel> eine FAT-Datenträgerbezeichnung aus dem Wurzelverzeichnis (so wie auch MS-DOS- und Windows-Systeme), ändert aber eine FAT-Datenträgerbezeichnung an beiden Orten. In Version 4.2 wurde der Umgang mit leeren sowie jenen Bezeichnungen korrigiert, die mit einem Byte 0xE5 beginnen. Außerdem unterstützt diese Version nun auch Nicht-ASCII-Bezeichnungen entsprechend der angegebenen DOS-Zeichensatztabelle; weiterhin wurden Prüfungen hinzugefügt, die die Gültigkeit einer neuen Bezeichnung feststellen.
fr: Depuis la version 4.2, B<fatlabel> lit une étiquette FAT seulement dans le répertoire racine (depuis les systèmes MS-DOS et Windows), mais modifie une étiquette FAT dans les deux emplacements. Dans la version 4.2 la gestion des étiquettes vides et des étiquettes commençant par un octet 0xE5 a été corrigée. A été aussi ajoutée dans cette version la prise en charge des étiquettes non ASCII en accord avec le code de page DOS spécifié et ont été ajoutées des vérifications de validité pour une nouvelle étiquette.

source: It is strongly suggested to not use B<dosfslabel> prior to version 3.0.16.
de: Wir empfehlen ausdrücklich, B<dosfslabel>-Versionen vor 3.0.16 nicht zu verwenden.
fr: Il est fortement suggéré de ne pas utiliser B<dosfslabel> avant sa version 3.0.16.

source: DOS CODEPAGES
de: DOS-ZEICHENSATZTABELLEN
fr: CODES DE PAGE DOS

source: MS-DOS and Windows systems use DOS (OEM) codepage for encoding and decoding FAT label. In Windows systems DOS codepage is global for all running applications and cannot be configured explicitly. It is set implicitly by option I<Language for non-Unicode programs> available in I<Regional and Language Options> via I<Control Panel>. Default DOS codepage for fatlabel is 850. See following mapping table between DOS codepage and Language for non-Unicode programs:
de: MS-DOS- und Windows-Systeme verwenden eine DOS-(OEM-)-Zeichensatztabelle für die Kodierung und Dekodierung der FAT-Datenträgerbezeichnung. In Windows-Systemen ist die DOS-Zeichensatztabelle global für alle laufenden Anwendungen gültig und kann nicht explizit konfiguriert werden. Sie wird implizit durch die Option I<Sprache für Unicode-inkompatible Programme> eingestellt, die in I<Zeit und Sprache> in den I<Einstellungen> verfügbar ist. Die vorgegebene DOS-Zeichensatztabelle für B<fatlabel> ist 850. In der folgenden Tabelle finden Sie die Zuordnung zwischen DOS-Zeichensatztabelle und Sprache für Unicode-inkompatible Programme:
fr: Les systèmes MS-DOS et Windows utilisent le code de page DOS (OEM) pour l’encodage et le décodage d’étiquette FAT. Dans les systèmes Windows le code de page DOS est global pour toutes les applications en cours d’exécution et ne peut pas être configuré de manière explicite. Il est configuré de manière implicite par l’option I<Langue pour les programmes non Unicode> disponible dans I<Options de région et de langue> à l’aide du I<Panneau de contrôle>. La page de code DOS pour B<fatlabel> est 850. Consultez la table suivante de correspondance pour le code de page et la langue pour les programmes non Unicode :

source: B<Codepage>
de: B<Zeichensatztabelle>
fr: B<Page de code>

source: B<Language>
de: B<Sprache>
fr: B<Langue>

source: English (India), English (Malaysia), English (Republic of the Philippines), English (Singapore), English (South Africa), English (United States), English (Zimbabwe), Filipino, Hausa, Igbo, Inuktitut, Kinyarwanda, Kiswahili, Yoruba
de: Englisch (Indien), Englisch (Malaysia), Englisch (Republik Philippinen), Englisch (Singapur), Englisch (Südafrika), Englisch (USA), Englisch (Simbabwe), Filipino, Hausa, Igbo, Inuktitut, Kinyarwanda, Kiswahili, Yoruba
fr: anglais (Inde), anglais (Malaisie), anglais (République des Philippines), anglais (Singapour), anglais (Afrique du sud), anglais (États-Unis), anglais (Zimbabwe), Philippines, hausa, igbo, inuktitut, kinyarwanda, kiswahili, yoruba

source: Arabic, Dari, Persian, Urdu, Uyghur
de: Arabisch, Dari, Persisch, Urdu, Uigurisch
fr: arabe, dari, perse, urdu, ouïghour

source: Greek
de: Griechisch
fr: grec

source: Estonian, Latvian, Lithuanian
de: Estnisch, Lettisch, Litauisch
fr: estonien, letton, lituanien

source: Afrikaans, Alsatian, Basque, Breton, Catalan, Corsican, Danish, Dutch, English (Australia), English (Belize), English (Canada), English (Caribbean), English (Ireland), English (Jamaica), English (New Zealand), English (Trinidad and Tobago), English (United Kingdom), Faroese, Finnish, French, Frisian, Galician, German, Greenlandic, Icelandic, Indonesian, Irish, isiXhosa, isiZulu, Italian, K'iche, Lower Sorbian, Luxembourgish, Malay, Mapudungun, Mohawk, Norwegian, Occitan, Portuguese, Quechua, Romansh, Sami, Scottish Gaelic, Sesotho sa Leboa, Setswana, Spanish, Swedish, Tamazight, Upper Sorbian, Welsh, Wolof
de: Afrikaans, Elsässisch, Baskisch, Bretonisch, Katalanisch, Korsisch, Dänisch, Niederländisch, Englisch (Australien), Englisch (Belize), Englisch (Kanada), Englisch (Karibik), Englisch (Irland), Englisch (Jamaika), Englisch (Neuseeland), Englisch (Trinidad und Tobago), Englisch (Großbritannien), Faröisch, Finnisch, Französisch, Friesisch, Galizisch, Deutsch, Grönländisch, Isländisch, Indonesisch, Irisch, isiXhosa, isiZulu, Italienisch, K'iche, Niedersorbisch, Luxemburgisch, Malaiisch, Mapudungun, Mohawk, Norwegisch, Okzitanisch, Portugiesisch, Quechua, Rätoromanisch, Sami, Schottisches Gälisch, Sesotho sa Leboa, Setswana, Spanisch, Schwedisch, Tamazight, Obersorbisch, Walisisch, Wolof
fr: afrikaans, alsacien, basque, breton, catalan, corse, danois, néerlandais, anglais (Australie), anglais (Belize), anglais (Canada), anglais (Caraïbes), anglais (Irlande), anglais (Jamaïque), anglais (Nouvelle-Zélande), anglais (Trinité-et-Tobago), anglais (Royaume-Uni), féroïen, finnois, français, frison, galicien, allemand, groenlandais, islandais, indonésien, irlandais, xhosa, zoulou, italien, k'iche, bas sorabe, luxembourgeois, malais, mapudungun, mohawk, norvégien, occitan, portugais, quechua, romanche, same, gaélique écossais, bantou, tswana, espagnol, suédois, berbère, haut sorabe, gallois, wolof

source: Albanian, Bosnian (Latin), Croatian, Czech, Hungarian, Polish, Romanian, Serbian (Latin), Slovak, Slovenian, Turkmen
de: Albanisch, Bosnisch (Lateinische Schrift), Kroatisch, Tschechisch, Ungarisch, Polnisch, Rumänisch, Serbisch (Lateinische Schrift), Slowakisch, Slowenisch, Turkmenisch
fr: albanais, bosnien (latin), croate, tchèque, hongrois, polonais, roumain, serbe (latin), slovaque, slovène, turkmène

source: Bosnian (Cyrillic), Serbian (Cyrillic)
de: Bosnisch (Kyrillische Schrift), Serbisch (Kyrillische Schrift)
fr: bosnien (cyrillique), serbe (cyrillique)

source: Azeri (Latin), Turkish, Uzbek (Latin)
de: Aserbaidschanisch (Lateinische Schrift), Usbekisch (Lateinische Schrift)
fr: azéri (latin), turc, ouzbek (latin)

source: Hebrew
de: Hebräisch
fr: hébreu

source: Azeri (Cyrillic), Bashkir, Belarusian, Bulgarian, Kyrgyz, Macedonian, Mongolian, Russian, Tajik, Tatar, Ukrainian, Uzbek (Cyrillic), Yakut
de: Aserbaidschanisch (Kyrillische Schrift), Baschkirisch, Weißrussisch, Bulgarisch, Kirgisisch, Mazedonisch, Mongolisch, Russisch, Tadschikisch, Tatarisch, Ukrainisch, Usbekisch (Kyrillisch), Jakutisch
fr: azéri (cyrillique), bashkir, biélorusse, bulgare, kyrgyze, macédonien, mongole, russe, tadjik, Tatar, ukrainien, ouzbek (cyrillique), iakoute

source: Japanese
de: Japanisch
fr: japonais

source: Chinese (Simplified)
de: Chinesisch (vereinfacht)
fr: chinois (simplifié)

source: Korean
de: Koreanisch
fr: coréen

source: Chinese (Traditional)
de: Chinesisch (traditionell)
fr: chinois (traditionnel)

source: Vietnamese
de: Vietnamesisch
fr: vietnamien

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: The home for the B<dosfstools> project is its E<.UR https://github.com/dosfstools/dosfstools> GitHub project page E<.UE .>
de: Die Heimat des Projekts B<dosfstools> ist seine E<.UR https://github.com/dosfstools/dosfstools> GitHub-Projektseite E<.UE .>
fr: La page d’accueil du projet B<dosfstools> est sa E<.UR https://github.com/dosfstools/dosfstools> page de projet GitHub E<.UE .>

source: AUTHORS
de: AUTOREN
fr: AUTEURS

source: B<dosfstools> were written by E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de> Roman Hodek E<.ME ,> and others. Current maintainers are E<.MT aeb@\:debian.org> Andreas Bombe E<.ME> and E<.MT pali.rohar@\:gmail.com> Pali Rohár E<.ME .>
de: B<dosfstools> wurde von E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de>, Roman Hodek und anderen geschrieben. Die aktuellen Betreuer sind E<.MT aeb@\:debian.org> Andreas Bombe E<.ME> und E<.MT pali.rohar@\:gmail.com> Pali Rohár E<.ME .>
fr: B<dosfstools> a été écrit par E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de> Roman Hodek E<.ME > et d’autres. Les responsables actuels sont E<.MT aeb@\:debian.org> Andreas Bombe E<.ME> et E<.MT pali.rohar@\:gmail.com> Pali Rohár E<.ME .>

source: B<fatlabel> - set or get MS-DOS filesystem label
de: B<fatlabel> - MS-DOS-Dateisystembezeichnung festlegen oder abfragen
fr: fatlabel - Définir ou obtenir le nom de volume d'un système de fichiers MS-DOS

source: B<fatlabel> I<DEVICE> [I<LABEL>]
de: B<fatlabel> I<GERÄT> [I<BEZEICHNUNG>]
fr: B<fatlabel> I<périphérique> [I<étiquette>]

source: B<fatlabel> set or gets a MS-DOS filesystem label from a given device.
de: B<fatlabel> legt die MS-DOS-Dateisystembezeichnung eines angegebenen Gerätes fest oder fragt diese ab.
fr: B<fatlabel> définit ou récupère le nom de volume d'un système de fichiers MS-DOS d'un I<périphérique> donné.

source: If I<LABEL> is omitted, then the label name of the specified device is written on the standard output. A label can't be longer than 11 bytes.
de: Falls keine I<BEZEICHNUNG> angegeben wird, dann wird die Bezeichnung des angegebenen Gerätes in die Standardausgabe geschrieben. Eine Bezeichnung darf nicht länger als 11 Bytes sein.
fr: Si I<nom_volume> n'est pas précisé, le nom de volume du périphérique indiqué est affiché sur la sortie standard. Un volume ne peut pas faire plus de 11 octets.

source: Displays a help message.
de: zeigt eine Hilfemeldung an.
fr: Afficher un message d'aide

source: Shows version.
de: zeigt die Versionsnummer an.
fr: Afficher la version.

source: B<dosfstools> were written by E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de> Roman Hodek E<.ME ,> and others. The current maintainer is E<.MT aeb@\:debian.org> Andreas Bombe E<.ME .>
de: B<dosfstools> wurde von E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de>, Roman Hodek und anderen geschrieben. Der aktuelle Betreuer ist E<.MT aeb@\:debian.org> Andreas Bombe E<.ME .>
fr: B<dosfstools> a été écrit par E<.MT werner.almesberger@\:lrc.di.epfl.ch> Werner Almesberger E<.ME ,> E<.MT Roman.Hodek@\:informatik.\:uni-erlangen.de> Roman Hodek E<.ME > et d’autres. Le responsable actuel est E<.MT aeb@\:debian.org> Andreas Bombe E<.ME .>

source: Thai
fr: thaï

source: HOMEPAGE
fr: PAGE D'ACCUEIL
