Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: If the size is prefixed by '+' then it is interpreted as relative to the partition first sector. If the size is prefixed by '-' then it is interpreted as relative to the high limit (last available sector for the partition).
de: Wird der Größenangabe ein »+« vorangestellt, so wird diese als Anzahl der Bytes relativ zum ersten Sektor der Partition interpretiert. Falls der Größenangabe ein »-« vorangestellt wird, dann wird sie als relativ zu der Größenbegrenzung (dem letzten verfügbaren Sektor für die Partition) interpretiert.
pl: Jeśli rozmiar poprzedzi się plusem "+", to jest on interpretowany jako liczony w odniesieniu do pierwszego sektora partycji. Jeśli przedrostkiem będzie minus "-", to jest on interpretowany w odniesieniu do ostatniego dostępnego sektora partycji.
uk: Якщо до розміру дописано префікс «+», його буде оброблено як визначник значення, яке є відносним щодо першого сектора розділу. Якщо до розміру додано префікс «-», значення буде оброблено, як відносне до верхнього обмеження (останнього доступного сектора для розділу).

source: The relative sizes are always aligned according to device I/O limits. The +/-E<lt>sizeE<gt>{K,B,M,G,...} notation is recommended.
de: Die relativen Größenangaben sind stets auf die E/A-Grenzen des Gerätes ausgerichtet. Die Notation +/-E<lt>GrößeE<gt>{K,B,M,G,…} wird daher empfohlen.
pl: Rozmiary relatywne są zawsze wyrównywane zgodnie z limitami wejścia/wyjścia danego urządzenia. Zaleca się stosowanie notacji B<+>/B<->I<rozmiar>{K,B,M,G,...}.
uk: Відносні розміри завжди вирівняно відповідно до обмежень на введення-виведення для пристрою. Рекомендовано користуватися позначенням +/-E<lt>розмірE<gt>{K,B,M,G,...}.

source: For backward compatibility fdisk also accepts the suffixes KB=1000, MB=1000*1000, and so on for GB, TB, PB, EB, ZB and YB. These 10^N suffixes are deprecated.
de: Aus Gründen der Abwärtskompatibilität akzeptiert B<fdisk> auch die Suffixe KB=1000, MB=1000*1000 usw. für GB, TB, PB, EB, ZB und YB. Diese Dezimalsuffixe gelten jedoch als veraltet und sollten nicht mehr verwendet werden.
pl: W celu kompatybilności wstecznej fdisk przyjmuje również przyrostki KB=1000, MB=1000*1000 itd. dla GB, TB, PB, EB, ZB i YB. Te przyrostki utworzone w oparciu o notację 10^N są przestarzałe.
uk: Для забезпечення зворотної сумісності у fdisk також можна використовувати суфікси KB=1000, MB=1000*1000, і так само для GB, TB, PB, EB, ZB і YB. Ці суфікси для 10^N вважаються застарілими.

source: B<fdisk> allows reading (by 'I' command) sfdisk compatible script files. The script is applied to in-memory partition table, and then it is possible to modify the partition table before you write it to the device.
de: B<fdisk> kann (mit dem Befehl »I«) B<sfdisk>-kompatible Skriptdateien verarbeiten. Das Skript wird auf die im Speicher vorgehaltene Partitionstabelle angewendet, wodurch es möglich ist, die Partitionstabelle vor dem eigentlichen Speichern auf dem Laufwerk zu verändern.
pl: B<fdisk> pozwala na odczytanie (poleceniem "I") skryptów kompatybilnych z sfdisk. Skrypt jest następnie stosowany do tablicy partycji przechowywanej w pamięci, a później istnieje możliwość modyfikacji jej przed ostatecznym zapisaniem na dysk.
uk: B<fdisk> уможливлює читання (за допомогою команди «I») сумісних із sfdisk файлів скриптів. Скрипт буде застосовано до таблиці розділів у пам'яті, а отже, можна змінити таблицю розділів до запису її на пристрій.

source: And vice-versa it is possible to write the current in-memory disk layout to the script file by command 'O'.
de: Umgekehrt können Sie mit dem Befehl »O« die im Speicher vorgehaltene Partitionsaufteilung in eine Skriptdatei schreiben.
pl: Działa to również w drugą stronę, ponieważ poleceniem "O" można zapisać aktualny schemat dysku przechowywany w pamięci do skryptu.
uk: І навпаки, можна записувати поточне компонування диска у пам'яті до файла скрипту за допомогою команди «O».

source: The script files are compatible between cfdisk, sfdisk, fdisk and other libfdisk applications. For more details see B<sfdisk>(8).
de: Die Skriptdateien sind zu B<cfdisk>, B<sfdisk>, B<fdisk> und weiteren B<libfdisk>-Anwendungen kompatibel. Weitere Details finden Sie in B<sfdisk>(8).
pl: Pliki skryptów są kompatybilne pomiędzy cfdisk, sfdisk, fdisk i pozostałymi programami libfdisk. Więcej szczegółów w podręczniku B<sfdisk>(8).
uk: Файли скриптів є сумісними одразу з cfdisk, sfdisk, fdisk та іншими програмами libfdisk. Докладніші відомості можна знайти у підручнику з B<sfdisk>(8).

source: GPT is modern standard for the layout of the partition table. GPT uses 64-bit logical block addresses, checksums, UUIDs and names for partitions and an unlimited number of partitions (although the number of partitions is usually restricted to 128 in many partitioning tools).
de: GPT ist ein moderner Standard für das Layout der Partitionstabelle. GPT verwendet logische 64-Bit-Blockadressen, Prüfsummen, UUIDs und Namen für Partitionen sowie eine unbegrenzte Anzahl der Partitionen (wobei diese Anzahl in vielen Partitionierungswerkzeugen auf 128 begrenzt ist).
pl: GPT to nowoczesny standard opisujący schemat tablicy partycji. GTP używa 64-bitowe logicznych adresów bloków, sum kontrolnych, UUID-ów i nazw dla partycji. Nie ma ograniczeń w liczbie partycji (choć narzędzia partycjonujące zwykle ograniczają tę liczbę do 128).
uk: GPT — сучасний стандарт для компонування таблиці розділів. GPT використовує 64-бітові адреси логічних блоків, контрольні суми, UUID та назви для розділів та уможливлює необмежену кількість розділів (хоча кількість розділів, зазвичай, обмежується 128 у багатьох інструментах для роботи з розділами).

source: Note that the first sector is still reserved for a B<protective MBR> in the GPT specification. It prevents MBR-only partitioning tools from mis-recognizing and overwriting GPT disks.
de: Beachten Sie, dass der erste Sektor gemäß der GPT-Spezifikation stets für einen B<geschützten MBR> reserviert ist. Dies verhindert, dass Partitionierungswerkzeuge, die nur auf den MBR zugreifen, GPT-Festplatten falsch erkennen und überschreiben.
pl: Proszę zauważyć, że w specyfikacji GPT pierwszy sektor jest wciąż przeznaczony na B<ochronne MBR>. Unika się w ten sposób błędne rozpoznanie i zamazanie dysków GPT przez narzędzia partycjonujące znające tylko MBR.
uk: Зауважте, що перший сектор у специфікації GPT усе ще зарезервовано для B<захисного MBR>. Він запобігає помилковому розпізнаванню і перезапису дисків GPT інструментами для роботи з розділами, які розуміють лише MBR.

source: A DOS-type partition table can describe an unlimited number of partitions. In sector 0 there is room for the description of 4 partitions (called `primary'). One of these may be an extended partition; this is a box holding logical partitions, with descriptors found in a linked list of sectors, each preceding the corresponding logical partitions. The four primary partitions, present or not, get numbers 1-4. Logical partitions are numbered starting from 5.
de: Eine DOS-Partitionstabelle kann eine unbegrenzte Anzahl von Partitionen enthalten. In Sektor 0 gibt es Raum für die Beschreibung von 4 Partitionen (die als »primäre« bezeichnet werden). Eine von ihnen kann logische Partitionen enthalten und wird erweiterte Partition genannt. Jeder logischen Partition geht eine verkettete Liste von Sektoren voraus. Für die vier primären Partitionen sind unabhängig von deren Existenz die Nummern 1 bis 4 reserviert, die Nummerierung der logischen Partitionen beginnt bei 5.
pl: Tablica partycji typu DOS może opisać nieograniczoną liczbę partycji. W sektorze 0 jest miejsce na opis 4 partycji (zwanych podstawowymi \(em `primary'). Jedna z nich może być partycją rozszerzoną; jest ona jakby pudełkiem zawierającym partycje logiczne, których deskryptory można znaleźć w wiązanej liście sektorów, z których każdy poprzedza odpowiadającą partycję logiczną. Cztery podstawowe partycje, niezależnie od tego czy są obecne, czy nie, otrzymują numery od 1 do 4. Numery partycji logicznych zaczynają się od 5.
uk: Таблиця розділів DOS-типу може описувати необмежену кількість розділів У секторі 0 є місце для опису 4 розділів (які називають «основними»). Одним з цих розділів може бути розширеним розділом. Розширений розділ може містити логічні розділи за допомогою дескрипторів, які розміщують у пов'язаному списку секторів, кожен з яких передує відповідним логічним розділам. Чотири основні розділи, є вони на диску чи ні, мають номери 1-4. Номери логічних розділів починаються з 5.

source: In a DOS-type partition table the starting offset and the size of each partition is stored in two ways: as an absolute number of sectors (given in 32 bits), and as a B<Cylinders/Heads/Sectors> triple (given in 10+8+6 bits). The former is OK -- with 512-byte sectors this will work up to 2 TB. The latter has two problems. First, these C/H/S fields can be filled only when the number of heads and the number of sectors per track are known. And second, even if we know what these numbers should be, the 24 bits that are available do not suffice. DOS uses C/H/S only, Windows uses both, Linux never uses C/H/S. The B<C/H/S addressing is deprecated> and may be unsupported in some later fdisk version.
de: In einer DOS-Partitionstabelle wird der Startversatz (starting offset) und die Größe der einzelnen Partitionen auf zwei Arten gespeichert: als absolute Anzahl der Sektoren (angegeben in 32 Bit) und als B<Zylinder/Köpfe/Sektoren>-Tripel (CHS, angegeben in 10/8/6 Bit). Ersteres ist in Ordnung - mit 512-Byte-Sektoren funktioniert das bis zu 2 TB. Letzteres hat zwei Probleme. Erstens können die C/H/S-Felder nur dann ausgefüllt werden, wenn die Anzahl der Köpfe und die Anzahl der Sektoren pro Spur bekannt sind. Und zweitens, selbst wenn diese Zahlen bekannt sind, reichen die 24 verfügbaren Bit nicht aus. DOS verwendet C/H/S, Windows beides, Linux verwendet C/H/S nie. Die B<C/H/S-Adressierung ist veraltet>, daher ist es möglich, dass diese in zukünftigen Versionen von B<fdisk> nicht mehr unterstützt wird.
pl: W tablicy partycji typu DOS początkowe przesunięcie ("offset") i rozmiar każdej partycji przechowywany jest na dwa sposoby: jako bezwzględna liczba sektorów (zapisywana na 32 bitach) i jako trójka Cylindry/Głowice/Sektory (B<C>ylinders/B<H>eads/B<S>ectors) (zapisywana na 10+8+6 bitach). Pierwszy zapis jest w porządku - przy 512-bajtowych sektorach będzie działał aż do 2 TB. W przypadku drugiego zapisu występują dwa małe problemy. Przede wszystkim pola C/H/S mogą być wypełnione tylko wtedy, gdy znana jest liczba głowic oraz liczba sektorów na ścieżce. Po drugie, nawet jeżeli te liczby są znane, to te 24 bity, które są dostępne, nie wystarczają. DOS używa tylko C/H/S, Windows \(em obu, a Linux nigdy nie używa C/H/S. B<Adresowanie C/H/S jest przestarzałe> i może w przyszłości nie być obsługiwane przez którąś z wersji fdisk.
uk: У таблиці розділів DOS-типу початкове зміщення та розмір кожного з розділів зберігається у два способи: як абсолютна кількість секторів (задана у 32 біти) і як трійка B<циліндри/голівки/сектори> (задана у 10+8+6 бітів). З першим варіантом усе гаразд — з 512-байтовими секторами це працює до 2 ТБ. З другим варіантом є дві проблеми. Перша полягає у тому, що ці поля Ц/Г/С може бути заповнено, лише якщо відома кількість голівок та секторів на доріжку. А друга — у тому, що навіть якщо нам відомі значення цих параметрів, 24 доступних бітів недостатньо для їхнього запису. У DOS використано лише Ц/Г/С, у Windows — обидва варіанти, Linux ніколи не використовує Ц/Г/С. Адресування B<Ц/Г/С вважається застарілим>, його підтримку може бути вилучено у якійсь з майбутніх версій fdisk.

source: A BSD/Sun disklabel can describe 8 partitions, the third of which should be a `whole disk' partition. Do not start a partition that actually uses its first sector (like a swap partition) at cylinder 0, since that will destroy the disklabel. Note that a B<BSD label> is usually nested within a DOS partition.
de: Ein BSD/SUN-Disklabel kann acht Partitionen beschreiben. Die dritte Partition sollte eine Partition beschreiben, die für eine »ganze Platte« steht. Partitionen, die (wie eine Auslagerungspartition) ihren ersten Sektor auf Zylinder 0 nutzen, sollten nicht benutzt werden, weil dadurch das Disklabel beschädigt wird. Beachten Sie, dass ein B<BSD-Label> üblicherweise innerhalb einer DOS-Partition verschachtelt ist.
pl: Etykieta dysku typu BSD/Sun może opisywać 8 partycji, z których trzecia powinna być specjalną partycją oznaczającą cały dysk. Partycji, która używa swojego pierwszego sektora (jak na przykład partycja wymiany) nie należy umieszczać w cylindrze 0, ponieważ zniszczy to etykietę dysku. Proszę zauważyć, że B<etykieta BSD> jest zwykle zagnieżdżona w partycji DOS.
uk: Мітка диска BSD/Sun може описувати 8 розділів, третім з яких має бути розділ «усього диска». Не розпочинайте розділ, який використовує його перший сектор (подібний до розділу резервної пам'яті на диску) на циліндрі 0, оскільки це знищить мітку диска. Зауважте, що B<мітку BSD>, зазвичай, вкладено у розділ DOS.

source: An IRIX/SGI disklabel can describe 16 partitions, the eleventh of which should be an entire `volume' partition, while the ninth should be labeled `volume header'. The volume header will also cover the partition table, i.e., it starts at block zero and extends by default over five cylinders. The remaining space in the volume header may be used by header directory entries. No partitions may overlap with the volume header. Also do not change its type or make some filesystem on it, since you will lose the partition table. Use this type of label only when working with Linux on IRIX/SGI machines or IRIX/SGI disks under Linux.
de: Ein IRIX/SGI-Disklabel kann 16 Partitionen beschreiben; die elfte sollte eine vollständige »volume«-Partition sein, während die neunte als »volume header« gekennzeichnet werden sollte. Der Volume Header wird auch die Partitionstabelle umfassen, d. h. er beginnt bei Block Null und erstreckt sich standardmäßig über fünf Zylinder. Der verbleibende Platz im Volume Header kann durch Header-Verzeichniseinträge belegt werden. Es dürfen keine Partitionen mit dem Volume Header überlappen. Legen Sie dort kein Dateisystem an und verändern Sie nicht seinen Typ, weil Sie dadurch die Partitionstabelle verlieren. Verwenden Sie dieses Label nur, wenn Sie mit Linux auf IRIX-/SGI-Maschinen arbeiten oder auf IRIX-/SGI-Festplatten zugreifen.
pl: Etykieta dysku IRIX/SGI może opisywać 16 partycji, z których jedenasta powinna być partycją całego "woluminu", natomiast dziewiąta powinna być tzw. "nagłówkiem woluminu". Nagłówek woluminu także pokrywa całą tablicę partycji, tzn. zaczyna się w bloku zerowym i domyślnie ciągnie się przez pięć cylindrów. Pozostałe miejsce w nagłówku woluminu może być użyte przez wpisy głównych katalogów. Żadna partycja nie może nachodzić na nagłówek woluminu. Także, nie należy zmieniać typu nagłówka woluminu, ani tworzyć na nim systemu plików, ponieważ spowoduje to utratę tablicy partycji. Proszę używać tego typu etykiety dysku tylko podczas pracy z Linuksem na komputerach IRIX/SGI lub podczas pracy z dyskami IRIX/SGI pod Linuksem.
uk: Мітка диска IRIX/SGI може описувати 16 розділів, одинадцятим з яких має бути розділ усього «тому», а дев'ятий має бути позначено як «заголовок тому» Заголовок тому також покриває таблицю розділів, тобто він починається на нульовому блоці і, типово, займає п'ять циліндрів. Решту місця у заголовку тому може бути використано для записів каталогів заголовка. Жоден з розділів не може перекривати заголовок тому. Також не можна змінювати тип заголовка та створювати на ньому файлову систему, оскільки при цьому буде втрачено таблицю розділів. Користуйтеся цим типом міток, лише якщо ви працюєте з Linux на машинах IRIX/SGI або працюєте з дисками IRIX/SGI у Linux.

source: A sync() and an ioctl(BLKRRPART) (rereading the partition table from disk) are performed before exiting when the partition table has been updated.
de: Die Aufrufe B<sync()> und B<ioctl(BLKRRPART)> werden nach der Aktualisierung der Partitionstabelle ausgeführt (wobei die Partitionstabelle auf der Platte neu eingelesen wird), bevor das Programm beendet wird.
pl: Gdy zaktualizowano tablicę partycji, to przed wyjściem wykonywane jest sync() i ioctl(BLKRRPART) (ponowne odczytanie tablicy partycji z dysku).
uk: Якщо таблицю розділів було оновлено, перед виходом з програми буде виконано sync() та ioctl(BLKRRPART) (повторне читання таблиці розділів з диска).

source: DOS mode and DOS 6.x WARNING
de: WARNUNG ZUM DOS-MODUS UND DOS-6.x-
pl: OSTRZEŻENIE trybu DOS i DOS 6.x
uk: РЕЖИМ DOS І ПОПЕРЕДЖЕННЯ ЩОДО DOS 6.X

source: B<Note that all this is deprecated. You don't have to care about things like> B<geometry and cylinders on modern operating systems. If you really want> B<DOS-compatible partitioning then you have to enable DOS mode and cylinder> B<units by using the '-c=dos -u=cylinders' fdisk command-line options.>
de: B<Beachten Sie, dass all dies veraltet ist. Sie müssen sich eigentlich auf modernen Betriebssystemen nicht mit Dingen wie Geometrie und Zylindern befassen. Wenn Sie wirklich DOS-kompatible Partitionierung benötigen, dann müssen Sie den DOS-Modus und Zylinder-Einheiten mit den Befehlszeilenoptionen »-c=dos -u=cylinders« für fdisk aktivieren.>
pl: B<Cały ten rozdział jest nieaktualny. W żadnym ze współczesnych systemów> B<operacyjnych nie ma potrzeby martwić się takimi rzeczami jak geometria czy> B<cylindry. Jeśli naprawdę konieczne jest stosowanie partycjonowanie> B<kompatybilnego z DOS-em konieczne jest włączenie trybu DOS i cylindrów jako> B<jednostek za pomocą opcji wiersza poleceń "-c=dos -u=cylinders".>
uk: B<Зауважте, що усе описане нижче вважається застарілим. Вам не варто перейматися речима, подібними до> B<геометрії та циліндрів у сучасних операційних системах. Якщо вам дуже потрібний> B<поділ на розділи із сумісністю з DOS, вам слід увімкнути режим DOS і одиниці-циліндри> B<за допомогою параметрів командного рядка fdisk «-c=dos -u=cylinders».>

source: The DOS 6.x FORMAT command looks for some information in the first sector of the data area of the partition, and treats this information as more reliable than the information in the partition table. DOS FORMAT expects DOS FDISK to clear the first 512 bytes of the data area of a partition whenever a size change occurs. DOS FORMAT will look at this extra information even if the /U flag is given -- we consider this a bug in DOS FORMAT and DOS FDISK.
de: Der FORMAT-Befehl von DOS 6.x sucht im ersten Sektor des Datenbereichs der Partition nach ein paar Informationen und behandelt diese Informationen als zuverlässiger als die Informationen in der Partitionstabelle. Der DOS-FORMAT-Befehl erwartet vom DOS-FDISK-Befehl, dass die ersten 512 Byte des Datenbereichs einer Partition bei jeder Größenänderung gelöscht werden. DOS FORMAT wird dieser zusätzlichen Informationen suchen, auch wenn der /U-Schalter gesetzt ist - die Programmautoren betrachten dies als einen Fehler in DOS FORMAT und DOS FDISK.
pl: Komenda FORMAT z DOS 6.x szuka informacji w pierwszym sektorze obszaru danych partycji i traktuje je jako godniejsze zaufania niż informacje z tablicy partycji. Dosowy FORMAT oczekuje od dosowego FDISK-a, że ten wyczyści pierwsze 512 bajtów obszarów danych przy każdej zmianie rozmiarów. Dosowy FORMAT zajrzy do tych dodatkowych danych nawet z flagą /U -- uważamy to za błąd tych programów.
uk: Команда FORMAT для DOS 6.x шукає певні дані у першому секторі області даних розділу і обробляє ці дані як надійніші за відомості з таблиці розділів. FORMAT для DOS очікує від FDISK для DOS очищення перших 512 байтів області даних розділу під час кожної зміни розмірів. FORMAT для DOS шукатиме ці додаткові відомості, навіть якщо вказано параметр /U — ми вважаємо це вадою у FORMAT для DOS та FDISK для DOS.

source: The bottom line is that if you use B<fdisk> or B<cfdisk> to change the size of a DOS partition table entry, then you must also use B<dd>(1) to B<zero the first 512 bytes> of that partition before using DOS FORMAT to format the partition. For example, if you were using B<fdisk> to make a DOS partition table entry for /dev/sda1, then (after exiting B<fdisk> and rebooting Linux so that the partition table information is valid) you would use the command "dd if=/dev/zero of=/dev/sda1 bs=512 count=1" to zero the first 512 bytes of the partition.
de: Die Quintessenz ist: Wenn Sie mit B<fdisk> oder B<cfdisk> die Größe eines Eintrags in der DOS-Partitionstabelle ändern, dann müssen Sie auch mit B<dd> die ersten 512 Byte der Partition auf Null setzen, bevor Sie mit dem DOS-FORMAT-Befehl die Partition formatieren. Wenn Sie beispielsweise mit B<fdisk> auf einer DOS-Partitionstabelle einen Eintrag für /dev/sda1 erstellt haben, dann würden Sie (nach dem Verlassen von B<fdisk> und dem Neustart von Linux, damit die Informationen in der Partitionstabelle gültig sind) mit dem Befehl »dd if=/dev/zero of=/dev/sda1 bs=512 count=1« die ersten 512 Byte der Partition auf Null setzen.
pl: Tak więc używając programu B<cfdisk> lub B<fdisk> do zmiany rozmiaru partycji dosowej, należy też użyć B<dd>(1) do B<wyzerowania pierwszych 512 bajtów> tej partycji przed użyciem dosowego FORMAT. Na przykład, po utworzeniu dosowej partycji /dev/sda1 programem B<fdisk> (po wyjściu z B<fdisk> i przeładowaniu Linuksa, dzięki czemu informacje o tablicy partycji będą poprawne), powinno się wykonać polecenie "dd if=/dev/zero of=/dev/hda1 bs=512 count=1", które zeruje pierwszych 512 bajtów partycji.
uk: У підсумку, якщо ви користуєтеся B<fdisk> або B<cfdisk> для зміни розмірів запису у таблиці розділів DOS, вам слід також скористатися B<dd>(1) для B<занулення перших 512 байтів> цього розділу до використання FORMAT для DOS для форматування розділу. Наприклад, якщо ви скористалися B<fdisk> для створення запису DOS у таблиці розділів для /dev/sda1, далі, (після виходу з B<fdisk> і перезавантаження Linux, щоб освіжити дані таблиці розділів) вам слід скористатися командою «dd if=/dev/zero of=/dev/sda1 bs=512 count=1» для занулення перших 512 байтів розділу.

source: B<fdisk> usually obtains the disk geometry automatically. This is not necessarily the physical disk geometry (indeed, modern disks do not really have anything like a physical geometry, certainly not something that can be described in the simplistic Cylinders/Heads/Sectors form), but it is the disk geometry that MS-DOS uses for the partition table.
de: Wenn möglich, wird B<fdisk> die Festplattengeometrie automatisch ermitteln. Dies ist nicht unbedingt die physische Geometrie des Datenträgers. Tatsächlich haben moderne Festplatten nicht wirklich so etwas wie eine physische Geometrie; sicherlich kann sie nicht in der vereinfachenden CHS-Form beschrieben werden. Aber diese Geometrie wird halt für die MS-DOS-Partitionstabelle verwendet.
pl: B<fdisk> zwykle automatycznie uzyska informacje o geometrii dysku. Niekoniecznie musi to być fizyczna geometria dysku (co więcej, nowoczesne dyski w rzeczywistości nie mają czegoś takiego jak fizyczna geometria, a w każdym razie nie mają niczego, co mogłoby być opisane w prostej postaci cylindry/głowice/sektory), lecz geometria, której używa MS-DOS dla tablicy partycji.
uk: Зазвичай, B<fdisk> отримує дані щодо геометрії диска автоматично. Це не обов'язково фізична геометрія диска (насправді, у сучасних дисків насправді немає ніякої фізичної геометрії, точно немає того, що описано у спрощеній формі циліндри/голівки/сектори), але це геометрія диска, яку MS-DOS використовує для таблиці розділів.
