Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: NAME
de: BEZEICHNUNG
pl: NAZWA
uk: НАЗВА

source: fdisk - manipulate disk partition table
de: fdisk - manipuliert die Festplatten-Partitionstabelle
pl: fdisk - obsługa dyskowej tablicy partycji
uk: fdisk — керування таблицею розділів диска

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA
uk: КОРОТКИЙ ОПИС

source: B<fdisk> [options] I<device>
de: B<fdisk> [Optionen] I<Gerät>
pl: B<fdisk> [opcje] I<urządzenie>
uk: B<fdisk> [параметри] I<пристрій>

source: B<fdisk> B<-l> [I<device>...]
de: B<fdisk> B<-l> [I<Gerät> …]
pl: B<fdisk> B<-l> [I<urządzenie>...]
uk: B<fdisk> B<-l> [I<пристрій>...]

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS
uk: ОПИС

source: B<fdisk> is a dialog-driven program for creation and manipulation of partition tables. It understands GPT, MBR, Sun, SGI and BSD partition tables.
de: B<fdisk> ist ein menügesteuertes Programm für die Erzeugung und Manipulation von Partitionstabellen. Es kann DOS-Partitionstabellen in den Formaten GPT, MBR, Sun, SGI und BSD verarbeiten.
pl: B<fdisk> to obsługiwany z pomocą okien dialogowych program do tworzenia i zmieniania tablicy partycji dysku twardego. Obsługuje tablice partycji typu GPT, MBR, Sun, SGI i BSD.
uk: B<fdisk> — програма для створення і роботи з таблицями розділів, якою керують за допомогою діалогів. У ній передбачено підтримку таблиць розділів GPT, MBR, Sun, SGI і BSD.

source: Block devices can be divided into one or more logical disks called I<partitions>. This division is recorded in the I<partition table>, usually found in sector 0 of the disk. (In the BSD world one talks about `disk slices\(aq and a `disklabel\(aq.)
de: Blockorientierte Geräte können in eine oder mehrere logische Platten (I<Partitionen>) unterteilt werden. Diese Unterteilung wird in der I<Partitionstabelle> notiert, die sich auf dem Sektor 0 der Platte befindet. (In der BSD-Welt spricht man von »disk slices« und einem »disklabel«.)
pl: Urządzenia blokowe mogą być podzielone na jeden lub więcej logicznych dysków zwanych I<partycjami>. Podział ten jest zapisany w I<tablicy partycji> znajdującej się zwykle w sektorze 0 dysku (w świecie BSD mówi się o tzw. plastrach dyskowych "disk slice" i etykietach dysku "disklabel").
uk: Блокові пристрої можна поділити на один або декілька логічних дисків, які називаються I<розділами>. Цей поділ записують до I<таблиці розділів>, яка, зазвичай, починається у секторі 0 диска. (У світі BSD це називається «зрізи диска» або «мітка диска».)

source: All partitioning is driven by device I/O limits (the topology) by default. B<fdisk> is able to optimize the disk layout for a 4K-sector size and use an alignment offset on modern devices for MBR and GPT. It is always a good idea to follow B<fdisk>\(aqs defaults as the default values (e.g., first and last partition sectors) and partition sizes specified by the +/-E<lt>sizeE<gt>{M,G,...} notation are always aligned according to the device properties.
de: In der Voreinstellung werden jegliche Partitionierungsvorgänge durch die E/A-Grenzen (die Topologie) des Gerätes bestimmt. B<fdisk> ist in der Lage, das Platten-Layout für eine 4K-Sektorengröße zu optimieren und den Ausrichtungsversatz auf modernen Geräten für MBR und GPT zu nutzen. Es ist immer eine gute Wahl, den Voreinstellungen von B<fdisk> zum Beispiel im Hinblick auf den jeweils ersten und letzten Sektor einer Partition zu folgen, und die durch die +/-E<lt>GrößeE<gt>{M,G,…}-Notation angegebenen Partitionen werden stets entsprechend den Gegebenheiten des Gerätes ausgerichtet sein.
pl: Partycjonowanie przestrzega domyślnie limitów wejścia/wyjścia urządzenia (topologii). B<fdisk> jest w stanie zoptymalizować schemat dysku do 4-kilobajtowego rozmiaru sektora oraz używa wyrównania przesunięcia na współczesnych dyskach korzystających z MBR i GPT. Zawsze powinno się korzystać z ustawień domyślnych B<fdisk>a, ponieważ domyślne wartości (np. początkowego i końcowego sektora partycji) i rozmiary partycji podane w notacji B<+>/B<->I<rozmiar>{B<M>,B<G>,...} są zawsze wyrównywane zgodnie z właściwościami urządzenia.
uk: Типово, поділ на розділи є керованим обмеженнями введення-виведення пристрою (топологією). B<fdisk> може оптимізувати компонування диска для розміру сектора у 4 кБ і використовувати зсув вирівнювання на сучасних пристроях для MBR і GPT. Завжди варто використовувати типові значення B<fdisk> (наприклад, перший і останній сектори розділу), а розміри розділів, які вказано у позначеннях +/-E<lt>sizeE<gt>{M,G,...}, завжди вирівнюються відповідно до властивостей пристрою.

source: CHS (Cylinder-Head-Sector) addressing is deprecated and not used by default. Please, do not follow old articles and recommendations with B<fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>> advices for SSD or 4K-sector devices.
de: Die CHS-Adressierung (»Cylinder-Head-Sector«, Zylinder-Kopf-Sektor) gilt als veraltet und wird standardmäßig nicht verwendet. Bitte folgen Sie keinen veralteten Artikeln und Empfehlungen wie B<fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>> für SSD-Geräte oder solche mit 4k-Sektoren.
pl: Adresowanie cylinder-głowica-sektor (ang. Cylinder-Head-Sector - CHS) jest przestarzałe i nie jest domyślnie stosowane. Nie należy korzystać ze starych artykułów i rekomendacji z poleceniem B<fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>> do napędów SSD lub urządzeń z sektorami 4K.
uk: Адресування CHS (Cylinder-Head-Sector або циліндр-голівка-сектор) вважається застарілим і типово не використовуються. Будь ласка, не користуйтеся застарілими статтями і рекомендаціями, де радять B<fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>> для SSD або пристроями із секторами з розміром 4 кБ.

source: Note that B<partx>(8) provides a rich interface for scripts to print disk layouts, B<fdisk> is mostly designed for humans. Backward compatibility in the output of B<fdisk> is not guaranteed. The input (the commands) should always be backward compatible.
de: Beachten Sie, dass B<partx>(8) eine leistungsfähige Schnittstelle für Skripte zum Ausgeben von Platten-Layouts bietet, während B<fdisk> eher für Normalbenutzer entworfen wurde. Abwärtskompatibilität in der Ausgabe von B<fdisk> kann nicht garantiert werden. Die Eingabe (die Befehle) dagegen sollten immer abwärtskompatibel sein.
pl: Bogaty interfejs do wyświetlania schematów dysków dla skryptów zapewnia B<partx>(8), B<fdisk> jest przeznaczony raczej dla ludzi. Kompatybilność wsteczna w wyjściu B<fdisk> nie jest gwarantowana. Wejście (polecenia) powinny pozostać wstecznie kompatybilne.
uk: Зауважте, що у B<partx>(8) передбачено чудовий інтерфейс для виведення компонувань дисків за допомогою скриптів, B<fdisk>, здебільшого, дуже зручний у користуванні. Зворотну сумісність у виведених B<fdisk> даних не гарантовано. Вхідні дані (команди) завжди мають бути сумісними із попередніми версіями.

source: OPTIONS
de: OPTIONEN
pl: OPCJE
uk: ПАРАМЕТРИ

source: B<-b>, B<--sector-size> I<sectorsize>
de: B<-b>, B<--sector-size> I<Sektorgröße>
pl: B<-b>, B<--sector-size> I<rozmiar-sektora>
uk: B<-b>, B<--sector-size> I<розмір_сектора>

source: Specify the sector size of the disk. Valid values are 512, 1024, 2048, and 4096. (Recent kernels know the sector size. Use this option only on old kernels or to override the kernel\(cqs ideas.) Since util-linux-2.17, B<fdisk> differentiates between logical and physical sector size. This option changes both sector sizes to I<sectorsize>.
de: gibt die Sektorgröße der Festplatte an. Gültige Werte sind 512, 1024, 2048 oder 4096. (Neuere Kernel kennen die Sektorgröße. Verwenden Sie diese Option nur mit alten Kerneln oder um die Sicht des Kernels außer Kraft zu setzen.) Seit util-linux-2.17 unterscheidet B<fdisk> zwischen logischer und physischer Sektorgröße. Diese Option ändert beide Sektorgrößen auf I<Sektorgröße>.
pl: Określa rozmiar sektora dysku. Możliwe wartości są następujące: 512, 1024, 2048 i 4096. (Ostatnie jądra znają rozmiar sektora. Proszę używać tej opcji tylko dla starych jąder lub w celu nadpisania wartości podanej przez jądro). Od util-linux-2.17 B<fdisk> rozróżnia logiczny i fizyczny rozmiar sektora. Ta opcja zmienia obie wartości rozmiarów sektora na I<rozmiar-sektora>.
uk: Вказати розмір сектора на диску. Коректними є значення 512, 1024, 2048 і 4096. (Нові ядра самі визначають розмір сектора. Користуйтеся цим параметром лише для застарілих ядер або для зміни автоматично визначеного значення.) З випуску util-linux-2.17 B<fdisk> розрізняє розміри логічного і фізичного секторів. За допомогою цього параметра можна змінити обидва розміри на I<розмір_сектора>.

source: Don\(cqt erase the beginning of the first disk sector when creating a new disk label. This feature is supported for GPT and MBR.
de: verhindert das Löschen des ersten Sektors des Geräts, wenn eine neue Festplattenbezeichnung erzeugt wird. Dieses Funktionsmerkmal wird für GPT und MBR unterstützt.
pl: Nie zamazuje początku pierwszego sektora dysku przy tworzeniu nowej etykiety dysku. Ta funkcja jest obsługiwana w przypadku GPT i MBR.
uk: Не витирати початок першого сектора диска при створенні мітки диска. Підтримку цієї можливості передбачено для GPT і MBR.

source: B<-c>, B<--compatibility>[=I<mode>]
de: B<-c>, B<--compatibility>[=I<Modus>]
pl: B<-c>, B<--compatibility>[B<=>I<tryb>]
uk: B<-c>, B<--compatibility>[=I<режим>]

source: Specify the compatibility mode, \(aqdos\(aq or \(aqnondos\(aq. The default is non-DOS mode. For backward compatibility, it is possible to use the option without the I<mode> argument \(em then the default is used. Note that the optional I<mode> argument cannot be separated from the B<-c> option by a space, the correct form is for example B<-c>=I<dos>.
de: legt den Kompatibilitätsmodus (»dos« oder »nondos«) fest. Der Standardwert ist »nondos«. Um Abwärtskompatibilität zu gewährleisten, kann die Option ohne I<Modus>-Argument verwendet werden. In diesem Fall wird der Standardwert verwendet. Beachten Sie, dass das optionale I<Modus>-Argument nicht durch ein Leerzeichen von der B<-c>-Option getrennt werden darf, die korrekte Form ist beispielsweise B<-c>=I<dos>.
pl: Określa tryb kompatybilności, B<dos> lub B<nondos>. Domyślnym trybem jest niedosowy. Aby zachować kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu I<tryb> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument I<tryb> nie może być oddzielony od opcji B<-c> spacją, poprawną formą jest np. B<-c>=I<dos>.
uk: Вказати режим сумісності, «dos» або «nondos». Типовим є режим не-DOS. Для зворотної сумісності можна скористатися параметром без аргументу I<режим> \(em буде використано типове значення. Зауважте, що необов'язковий аргумент I<режим> не може бути відокремлено від параметра B<-c> пробілом. Правильною формою, наприклад, є така: B<-c>=I<dos>.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
pl: Wyświetla ten tekst i kończy pracę.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: B<-L>, B<--color>[=I<when>]
de: B<-L>, B<--color>[=I<WANN>]
pl: B<-L>, B<--color>[=I<kiedy>]
uk: B<-L>, B<--color>[=I<варіант>]

source: Colorize the output. The optional argument I<when> can be B<auto>, B<never> or B<always>. If the I<when> argument is omitted, it defaults to B<auto>. The colors can be disabled; for the current built-in default see the B<--help> output. See also the B<COLORS> section.
de: stellt die Ausgabe farbig dar. Das optionale Argument I<wann> kann B<auto>, B<never> oder B<always> sein. Falls I<wann> nicht angegeben ist, ist B<auto> die Voreinstellung. Die Farben können deaktiviert werden. Die jeweilige einkompilierte Voreinstellung zeigt Ihnen die Option B<--help> an. Siehe auch den Abschnitt B<FARBEN>.
pl: Koloryzuje wynik. Opcjonalnym argumentem I<kiedy> może być B<auto>, B<never> (nigdy) lub B<always> (zawsze). Gdy nie poda się argumentu I<kiedy>, domyślnym ustawieniem jest B<auto>. Kolory mogą być wyłączone, aktualne wbudowane ustawienie domyślne pokaże opcja B<--help>. Zob. również rozdział B<KOLORY>.
uk: Розфарбувати виведені дані. Значенням додаткового аргументу I<варіант> може бути *auto*, *never* або *always*. Якщо аргумент I<варіант> пропущено, типовим значенням вважається *auto*. Розфарбовування можна вимкнути. Із поточним вбудованим типовим значенням можна ознайомитися за допомогою виведення команди з параметром *--help*. Див. також розділ КОЛЬОРИ.

source: List the partition tables for the specified devices and then exit.
de: gibt Partitionstabellen für die angegebenen Geräte aus und beendet das Programm.
pl: Wypisuje tablice partycji dla podanych urządzeń i kończy działanie.
uk: Вивести список таблиць розділів для вказаних пристроїв і завершити роботу.

source: If no devices are given, the devices mentioned in I</proc/partitions> (if this file exists) are used. Devices are always listed in the order in which they are specified on the command-line, or by the kernel listed in I</proc/partitions>.
de: Wurden keine Geräte angegeben, werden bei Existenz von I</proc/partitions> die dort erwähnten Geräte verwendet. Die Geräte werden stets in der Reihenfolge aufgelistet, wie sie in der Befehlszeile angegeben werden, oder wie sie der Kernel in I</proc/partitions> auflistet.
pl: Jeżeli nie podano żadnych urządzeń, to używane są urządzenia wymienione w pliku I</proc/partitions> (o ile taki plik istnieje). Urządzenia są zawsze wypisywane w kolejności w jakiej podano je w wierszu poleceń lub w kolejności jądra z pliku I</proc/partitions>.
uk: Якщо пристроїв не задано, буде використано пристрої, які згадано у I</proc/partitions> (якщо цей файл існує). Пристрої у списку завжди буде упорядковано так, як їх упорядковано у рядку команди або упорядковано ядром за списком у I</proc/partitions>.

source: Like B<--list>, but provides more details.
de: erzeugt eine Ausgabe wie mit B<--list>, aber detailreicher.
pl: Jak B<--list>, ale bardziej szczegółowo.
uk: Подібний до B<--list>, але надає більше подробиць.

source: B<--lock>[=I<mode>]
de: B<--lock>[=I<Modus>]
pl: B<--lock>[=I<tryb>]
uk: B<--lock>[=I<режим>]

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<yes>. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it\(cqs recommended to avoid collisions with B<systemd-udevd>(8) or other tools.
de: verwendet eine exklusive BSD-Sperre für das Gerät oder die Datei, auf dem/der es agiert. Das optionale Argument I<Modus> kann B<yes>, B<no> (oder 1 und 0) oder B<nonblock> sein. Falls das Argument I<Modus> weggelassen wird, wird standardmäßig B<yes> angenommen. Diese Option setzt die Umgebungsvariable B<$LOCK_BLOCK_DEVICE> außer Kraft. Standardmäßig wird überhaupt keine Sperre gesetzt, dies wird aber empfohlen, um Kollisionen mit B<systemd-udevd>(8) oder anderen Werkzeugen zu vermeiden.
pl: Używa blokady na wyłączność BSD do urządzeń i plików na których działa. Opcjonalnym argumentem I<tryb> może być B<yes>, B<no> (albo B<1> lub B<0>) lub też B<nonblock>. Jeśli nie poda się I<trybu>, domyślną wartością jest B<yes>. Opcja ta przesłania zmienną środowiskową B<$LOCK_BLOCK_DEVICE>. Choć domyślnie nie jest używana żadna blokada, zaleca się jej użycie aby uniknąć kolizji z B<systemd-udevd>(8) i innymi narzędziami.
uk: Скористатися виключним блокуванням BSD для пристрою або файла, який ним керує. Значенням додаткового аргументу I<режим> може бути B<yes>, B<no> (або 1 і 0) чи B<nonblock>. Якщо пропустити аргумент I<режим>, типовим значенням буде B<"yes">. Цей параметр переписує змінну середовища B<$LOCK_BLOCK_DEVICE>. Типовим станом є невикористання блокування, але рекомендуємо уникати конфліктів із B<systemd-udevd>(8) або іншими програмами.

source: Don\(cqt automatically create a default partition table on empty device. The partition table has to be explicitly created by user (by command like \(aqo\(aq, \(aqg\(aq, etc.).
de: erstellt auf einem leeren Gerät nicht automatisch eine neue Standard-Partitionstabelle. Die Partitionstabelle muss explizit vom Benutzer erstellt werden (mit einem Befehl wie »o«, »g« usw.).
pl: Nie tworzy automatycznie domyślnej tablicy partycji na pustym urządzeniu. Tablica partycji musi być utworzona wprost przez użytkownika (poleceniami takimi jak "o", "g" itp.).
uk: Не створювати типової таблиці розділів на порожньому пристрої автоматично. Таблицю розділів має бути створено явним чином користувачем (за допомогою команд, подібних до «o», «g» тощо).

source: B<-o>, B<--output> I<list>
de: B<-o>, B<--output> I<Liste>
pl: B<-o>, B<--output> I<lista>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns.
de: gibt die anzuzeigenden Spalten an. Mit B<--help> erhalten Sie eine Liste aller unterstützten Spalten.
pl: Określa wypisywane kolumny. Ich listę można poznać podając opcję B<--help>.
uk: Визначити, які стовпчики слід використовувати для виведення. Скористайтеся параметром B<--help>, щоб переглянути список підтримуваних стовпчиків.

source: The default list of columns may be extended if I<list> is specified in the format I<+list> (e.g., B<-o +UUID>).
de: Die voreingestellte Liste der Spalten kann erweitert werden, indem Sie die I<Liste> im Format I<+Liste> angeben (beispielsweise B<-o +UUID>).
pl: Domyślna listę kolumn można rozszerzyć, jeśli I<listę> poda się w formacie B<+>I<lista> (np. B<-o +UUID>).
uk: Типовий список стовпчиків може бути розширено, якщо I<список> вказано у форматі I<+список> (наприклад, B<-o +UUID>).

source: Print the size in 512-byte sectors of each given block device. This option is DEPRECATED in favour of B<blockdev>(8).
de: gibt die Größe jedes der angegebenen blockorientierten Geräte in 512-Byte-Sektoren aus. Diese Option ist veraltet, verwenden Sie stattdessen B<blockdev>(8).
pl: Wyświetla rozmiar jako 512-bajtowe sektory każdego podanego urządzenia blokowego. Ta opcja jest PRZESTARZAŁA na korzyść B<blockdev>(8).
uk: Вивести розмір у 512-байтових секторах кожного заданого блокового пристрою. Цей параметр вважається ЗАСТАРІЛИМ. Користуйтеся B<blockdev>(8).

source: B<-t>, B<--type> I<type>
de: B<-t>, B<--type> I<Typ>
pl: B<-t>, B<--type> I<typ>
uk: B<-t>, B<--type> I<тип>

source: Enable support only for disklabels of the specified I<type>, and disable support for all other types.
de: aktiviert die Unterstützung für Plattenbezeichnungen des angegebenen I<Typs> und deaktiviert die Unterstützung für alle anderen Typen.
pl: Włącza obsługę etykiet dysku wyłącznie podanego I<typu>, wyłączając obsługę pozostałych typów.
uk: Увімкнути підтримку лише міток диску вказаного I<типу> і вимкнути підтримку усіх інших типів.

source: B<-u>, B<--units>[=I<unit>]
de: B<-u>, B<--units>[=I<Einheit>]
pl: B<-u>, B<--units>[B<=>I<jednostka>]
uk: B<-u>, B<--units>[=I<одиниця>]

source: When listing partition tables, show sizes in \(aqsectors\(aq or in \(aqcylinders\(aq. The default is to show sizes in sectors. For backward compatibility, it is possible to use the option without the I<unit> argument \(em then the default is used. Note that the optional I<unit> argument cannot be separated from the B<-u> option by a space, the correct form is for example \(aqB<-u=>I<cylinders>\(aq.
de: legt fest, ob bei der Ausgabe von Partitionstabellen die Größe in »Sektoren« oder »Zylindern« angegeben wird. Standardmäßig wird die Größe in Sektoren angezeigt. Um Abwärtskompatibilität zu gewährleisten, kann die Option ohne das I<Einheit>-Argument verwendet werden. In diesem Fall wird der Standardwert verwendet. Beachten Sie, dass das optionale I<Einheit>-Argument nicht von der B<-u>-Option durch ein Leerzeichen getrennt werden kann, die korrekte Form ist beispielsweise »B<-u=>I<cylinders>«.
pl: Podczas wypisywania tablic partycji pokazuje rozmiary w B<sectors> (sektorach) lub w B<cylinders> (cylindrach). Domyślnie używane są sektory. Ze względu na kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu I<jednostki> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument I<jednostka> nie może być oddzielony od opcji B<-u> spacją, poprawną formą jest np. "B<-u=>I<cylinders>".
uk: При виведенні таблиць розділів показувати розміри у секторах («sectors») або у циліндрах («cylinders»). Типовим є показ розмірів у секторах. Для зворотної сумісності можна скористатися параметром без аргументу I<одиниця> — буде використано типовий варіант. Зауважте, що необов'язковий аргумент I<одиниця> не можна відокремлювати від параметра B<-u> пробілом. Правильною формою, наприклад, є «B<-u=>I<cylinders>».

source: B<-C>, B<--cylinders> I<number>
de: B<-C>, B<--cylinders> I<Zahl>
pl: B<-C>, B<--cylinders> I<liczba>
uk: B<-C>, B<--cylinders> I<число>

source: Specify the I<number> of cylinders of the disk. I have no idea why anybody would want to do so.
de: gibt die Zylinderzahl der Platte an. Und wozu soll das jemand verwenden wollen?
pl: Określa I<liczbę> cylindrów dysku. Prawdopodobnie nie ma osoby, która miałaby powód aby używać tej opcji.
uk: Вказати I<кількість> циліндрів на диску. Невідомо, чи комусь взагалі це потрібно.

source: B<-H>, B<--heads> I<number>
de: B<-H>, B<--heads> I<Zahl>
pl: B<-H>, B<--heads> I<liczba>
uk: B<-H>, B<--heads> I<число>

source: Specify the number of heads of the disk. (Not the physical number, of course, but the number used for partition tables.) Reasonable values are 255 and 16.
de: legt die Anzahl der Köpfe der Festplatte fest. (Natürlich nicht die physikalische Anzahl, sondern die für Partitionstabellen verwendete). Vernünftige Werte sind 255 und 16.
pl: Określa liczbę głowic dysku (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądnymi wartościami są 255 i 16.
uk: Вказати кількість голівок на диску. (Звичайно ж, не фізичну кількість, а кількість, яку використано для таблиць розділів.) Прийнятними значеннями є 255 та 16.

source: B<-S>, B<--sectors> I<number>
de: B<-S>, B<--sectors> I<Zahl>
pl: B<-S>, B<--sectors> I<liczba>
uk: B<-S>, B<--sectors> I<число>

source: Specify the number of sectors per track of the disk. (Not the physical number, of course, but the number used for partition tables.) A reasonable value is 63.
de: legt fest, wie viele Sektoren sich auf einer Spur der Platte befinden, allerdings nicht die physikalische Anzahl, sondern die für Partitionstabellen verwendete. Ein sinnvoller Wert ist 63.
pl: Określa liczbę sektorów dysku na ścieżkę (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądną wartością jest 63.
uk: Вказати кількість секторів на доріжку на диску. (Звичайно ж, не фізичну кількість, а кількість, яку використано для таблиць розділів.) Прийнятним значенням є 63.

source: B<-w>, B<--wipe> I<when>
de: B<-w>, B<--wipe> I<WANN>
pl: B<-w>, B<--wipe> I<kiedy>
uk: B<-w>, B<--wipe> I<варіант>
