Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: Usually all goes well by default, and there are no problems if Linux is the only system on the disk. However, if the disk has to be shared with other operating systems, it is often a good idea to let an fdisk from another operating system make at least one partition. When Linux boots it looks at the partition table, and tries to deduce what (fake) geometry is required for good cooperation with other systems.
de: In der Regel geht standardmäßig alles gut. Es gibt keine Probleme, wenn Linux das einzige System auf der Festplatte ist. Wenn allerdings der Datenträger mit anderen Betriebssystemen gemeinsam genutzt wird, ist es oft ratsam, ein fdisk eines anderen Betriebssystems mindestens eine Partition anlegen zu lassen. Beim Start liest Linux die Partitionstabelle aus und versucht abzuleiten, welche (fingierte) Geometrie für eine gute Zusammenarbeit mit anderen Systemen erforderlich ist.
pl: Zazwyczaj wszystko idzie dobrze i nie ma żadnych problemów, jeżeli Linux jest jedynym systemem na dysku. Jednakże, jeśli dysk będzie dzielony z innymi systemami operacyjnymi, to dobrym pomysłem jest utworzenie co najmniej jednej partycji fdiskiem pochodzącym z innego systemu operacyjnego. Linux, podczas uruchamiania, przegląda tablicę partycji i stara się wywnioskować, jaka (fałszywa) geometria dysku jest wymagana, żeby mógł dobrze współpracować z innymi systemami.
uk: Зазвичай, усе має бути типово добре, і не повинно бути проблем, якщо Linux є єдиною системою на диску. Втім, якщо диск спільно використовується іншими операційними системами, часто варто надати змогу fdisk з іншої операційної системи створити принаймні один розділ. При завантаженні Linux система аналізує таблицю розділів і намагається визначити, яка (фіктивна) геометрія потрібна для належної сумісності з іншими операційними системами.

source: Whenever a partition table is printed out in DOS mode, a consistency check is performed on the partition table entries. This check verifies that the physical and logical start and end points are identical, and that each partition starts and ends on a cylinder boundary (except for the first partition).
de: Jedesmal, wenn im DOS-Modus eine Partitionstabelle ausgegeben wird, werden die Einträge in der Partitionstabelle auf Konsistenz geprüft. Es wird geprüft, ob die physikalischen und logischen Start- und Endpunkte übereinstimmen und ob jede Partition (mit Ausnahme der ersten) an einer Zylindergrenze startet und endet.
pl: Gdy wypisywana jest tablica partycji, w trybie DOS dokonywane jest sprawdzenie spójności wpisów tablicy. Sprawdzane jest, czy fizyczne i logiczne punkty startowe i końcowe są takie same, oraz czy partycja rozpoczyna się i kończy w granicach cylindrów (poza pierwszą partycją).
uk: Кожного разу, коли виводиться таблиця розділів у режимі DOS, буде виконано перевірку записів таблиці розділів. Під час перевірки буде встановлено, чи є ідентичними фізичні і логічні початкова і кінцева точки, і чи кожен розділ починається і завершується на межі циліндра (окрім першого розділу).

source: Some versions of MS-DOS create a first partition which does not begin on a cylinder boundary, but on sector 2 of the first cylinder. Partitions beginning in cylinder 1 cannot begin on a cylinder boundary, but this is unlikely to cause difficulty unless you have OS/2 on your machine.
de: Einige Versionen von MS-DOS erstellen eine erste Partition, die nicht auf einer Zylindergrenze beginnt, sondern auf Sektor 2 des ersten Zylinders. Partitionen, die auf Zylinder 1 anfangen, können nicht auf einer Zylindergrenze beginnen. Wenn Sie nicht auch OS/2 auf Ihrer Maschine installiert haben, werden Sie wahrscheinlich trotzdem keine Schwierigkeiten bekommen.
pl: Niektóre wersje MS-DOS tworzą pierwszą partycję, która nie rozpoczyna się na granicy cylindra, lecz na 2 sektorze pierwszego cylindra. Partycje rozpoczynające się na cylindrze 1 nie mogą rozpoczynać się na granicy cylindra, lecz raczej nie powinno to sprawiać problemów, chyba że używany jest OS/2.
uk: Деякі версії MS-DOS створюють перший розділ, який починається не на початку межі циліндра, а на секторі 2 першого циліндра. Розділи, що починаються на циліндрі 1, не можуть починатися на межі циліндра, але це навряд чи спричинить труднощі, якщо на вашому комп'ютері немає OS/2.

source: For best results, you should always use an OS-specific partition table program. For example, you should make DOS partitions with the DOS FDISK program and Linux partitions with the Linux fdisk or Linux cfdisk programs.
de: Um die besten Ergebnisse zur erzielen, sollten Sie ein betriebssystemspezifisches Partitionierungsprogramm einsetzen. Beispielsweise sollten Sie DOS-Partitionen mit dem DOS-FDISK erzeugen und Linux-Partitionen mit den Linux-Programmen B<fdisk> oder B<cfdisk>.
pl: Dla najlepszych wyników, zawsze powinno się używać fdiska specyficznego dla danego systemowi operacyjnemu. Na przykład, partycje dosowe powinno się tworzyć dosowym FDISK-iem, a linuksowe \(em linuksowym fdiskiem lub cfdiskiem.
uk: Для покращення результатів вам слід завжди користуватися специфічною для операційної системи програмою для роботи з таблицею розділів. Наприклад, вам слід створювати розділи DOS за допомогою програми FDISK для DOS, а розділи Linux за допомогою програм fdisk та Linux cfdisk для Linux.

source: Implicit coloring can be disabled by an empty file I</etc/terminal-colors.d/fdisk.disable>.
de: Implizites Einfärben können Sie deaktivieren, indem Sie eine leere Datei I</etc/terminal-colors.d/fdisk.disable> anlegen.
pl: Jawne kolorowanie można wyłączyć za pomocą pustego pliku I</etc/terminal-colors.d/fdisk.disable>.
uk: Неявне розфарбування можна вимкнути створенням порожнього файла I</etc/terminal-colors.d/cfdisk.disable>.

source: See B<terminal-colors.d>(5) for more details about colorization configuration. The logical color names supported by B<fdisk> are:
de: In B<terminal-colors.d>(5) finden Sie weitere Details zur Konfiguration der Farbdarstellung. Folgende logische Farbnamen werden von B<fdisk> unterstützt:
pl: Więcej informacji o konfiguracji kolorów zawiera podręcznik B<terminal-colors.d>(5). Logiczne nazwy kolorów obsługiwane przez B<fdisk> to:
uk: Див. B<terminal-colors.d>(5), щоб дізнатися більше про налаштовування розфарбування. Логічними назвами кольорів, підтримку яких передбачено у B<fdisk>, є такі:

source: use visible padding characters. Requires enabled LIBSMARTCOLS_DEBUG.
de: verwendet sichtbare Auffüllzeichen. Dafür muss LIBSMARTCOLS_DEBUG aktiviert sein.
pl: używa widocznych znaków wypełniających. Wymaga włączenia LIBSMARTCOLS_DEBUG.
uk: використати символи візуального доповнення. Потребує вмикання B<LIBSMARTCOLS_DEBUG>.

source: LOCK_BLOCK_DEVICE=E<lt>modeE<gt>
de: LOCK_BLOCK_DEVICE=E<lt>ModusE<gt>
pl: LOCK_BLOCK_DEVICE=E<lt>trybE<gt>
uk: LOCK_BLOCK_DEVICE=E<lt>режимE<gt>

source: use exclusive BSD lock. The mode is "1" or "0". See B<--lock> for more details.
de: verwendet eine exklusive BSD-Sperre. Der Modus ist »1« oder »0«. Siehe B<--lock> für weitere Details.
pl: używa blokowania na wyłączność BSD. Tryb to "1" lub "0". Więcej informacji w opisie opcji B<--lock>.
uk: використати виключне блокування BSD. Режимом може бути «1» або «0». Див. B<--lock>, щоб дізнатися більше.

source: The fdisk command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl B<fdisk> ist Teil des Pakets util-linux und unter https://www.kernel.org/pub/linux/utils/util-linux/ verfügbar.
pl: Polecenie fdisk jest częścią pakietu util-linux i jest dostępne pod adresem https://www.kernel.org/pub/linux/utils/util-linux/.
uk: Програма fdisk є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<"yes">. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it\(cqs recommended to avoid collisions with udevd or other tools.
de: verwendet eine exklusive BSD-Sperre für das Gerät oder die Datei, auf dem/der es agiert. Das optionale Argument I<Modus> kann B<yes>, B<no> (oder 1 und 0) oder B<nonblock> sein. Falls das Argument I<Modus> weggelassen wird, wird standardmäßig B<yes> angenommen. Diese Option setzt die Umgebungsvariable B<$LOCK_BLOCK_DEVICE> außer Kraft. Standardmäßig wird überhaupt keine Sperre gesetzt, dies wird aber empfohlen, um Kollisionen mit Udevd zu vermeiden.
pl: Używa blokady na wyłączność BSD do urządzeń i plików na których działa. Opcjonalnym argumentem I<tryb> może być B<yes>, B<no> (albo B<1> lub B<0>) lub też B<nonblock>. Jeśli nie poda się I<trybu>, domyślną wartością jest B<yes>. Opcja ta przesłania zmienną środowiskową B<$LOCK_BLOCK_DEVICE>. Choć domyślnie nie jest używana żadna blokada, zaleca się jej użycie aby uniknąć kolizji z udevd i innymi narzędziami.
uk: Скористатися виключним блокуванням BSD для пристрою або файла, який ним керує. Значенням додаткового аргументу I<режим> може бути B<yes>, B<no> (або 1 і 0) чи B<nonblock>. Якщо пропустити аргумент I<режим>, типовим значенням буде B<"yes">. Цей параметр переписує змінну середовища B<$LOCK_BLOCK_DEVICE>. Типовим станом є невикористання блокування, але рекомендуємо уникати конфліктів із udevd або іншими програмами.

source: See B<terminal-colors.d>(5) for more details about colorization configuration. The logical color names supported by B<fdisk> are:
de: In B<terminal-colors.d>(5) finden Sie weitere Details zur Konfiguration der Farbdarstellung. Folgende logische Farbnamen werden von B<fdisk> unterstützt:
pl: Więcej informacji o konfiguracji kolorów zawiera podręcznik B<terminal-colors.d>(5). Logiczne nazwy kolorów obsługiwane przez B<fdisk> to:
uk: Див. B<terminal-colors.d>(5), щоб дізнатися більше про налаштовування розфарбування. Логічними назвами кольорів, підтримку яких передбачено у B<fdisk>, є такі:

source: When listing partition tables, show sizes in \(aqsectors\(aq or in \(aqcylinders\(aq. The default is to show sizes in sectors. For backward compatibility, it is possible to use the option without the I<unit> argument \(em then the default is used. Note that the optional I<unit> argument cannot be separated from the B<-u> option by a space, the correct form is for example \(aq*-u=*I<cylinders>\(aq.
de: legt fest, ob bei der Ausgabe von Partitionstabellen die Größe in »Sektoren« oder »Zylindern« angegeben wird. Standardmäßig wird die Größe in Sektoren angezeigt. Um Abwärtskompatibilität zu gewährleisten, kann die Option ohne das I<Einheit>-Argument verwendet werden. In diesem Fall wird der Standardwert verwendet. Beachten Sie, dass das optionale I<Einheit>-Argument nicht von der B<-u>-Option durch ein Leerzeichen getrennt werden kann, die korrekte Form ist beispielsweise »-u=I<cylinders>«.
pl: Podczas wypisywania tablic partycji pokazuje rozmiary w B<sectors> (sektorach) lub w B<cylinders> (cylindrach). Domyślnie używane są sektory. Ze względu na kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu I<jednostki> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument I<jednostka> nie może być oddzielony od opcji B<-u> spacją, poprawną formą jest np. "-u=cylinders".
uk: При виведенні таблиць розділів показувати розміри у секторах («sectors») або у циліндрах («cylinders»). Типовим є показ розмірів у секторах. Для зворотної сумісності можна скористатися параметром без аргументу I<одиниця> — буде використано типовий варіант. Зауважте, що необов'язковий аргумент I<одиниця> не можна відокремлювати від параметра B<-u> пробілом. Правильною формою, наприклад, є «*-u=*I<cylinders>».

source: Specify the number of cylinders of the disk. I have no idea why anybody would want to do so.
de: gibt die Zylinderzahl der Platte an. Und wozu soll das jemand verwenden wollen?
pl: Określa liczbę cylindrów dysku. Prawdopodobnie nie ma osoby, która miałaby powód aby używać tej opcji.
uk: Вказати кількість циліндрів на диску. Невідомо, чи комусь взагалі це потрібно.

source: A sync() and an ioctl(BLKRRPART) (rereading the partition table from disk) are performed before exiting when the partition table has been updated.
de: Die Aufrufe B<sync()> und B<ioctl(BLKRRPART)> werden nach der Aktualisierung der Partitionstabelle ausgeführt (wobei die Partitionstabelle auf der Platte neu eingelesen wird), bevor das Programm beendet wird.
pl: Gdy zaktualizowano tablicę partycji, to przed wyjściem wykonywane jest sync() i ioctl(BLKRRPART) (ponowne odczytanie tablicy partycji z dysku).
uk: Якщо таблицю розділів було оновлено, перед виходом з програми буде виконано sync() та ioctl(BLKRRPART) (повторне читання таблиці розділів з диска).

source: The bottom line is that if you use B<fdisk> or B<cfdisk> to change the size of a DOS partition table entry, then you must also use B<dd>(1) to B<zero the first 512 bytes> of that partition before using DOS FORMAT to format the partition. For example, if you were using B<fdisk> to make a DOS partition table entry for I</dev/sda1>, then (after exiting B<fdisk> and rebooting Linux so that the partition table information is valid) you would use the command B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> to zero the first 512 bytes of the partition.
de: Die Quintessenz ist: Wenn Sie mit B<fdisk> oder B<cfdisk> die Größe eines Eintrags in der DOS-Partitionstabelle ändern, dann müssen Sie auch mit B<dd> die ersten 512 Byte der Partition auf Null setzen, bevor Sie mit dem DOS-FORMAT-Befehl die Partition formatieren. Wenn Sie beispielsweise mit B<fdisk> auf einer DOS-Partitionstabelle einen Eintrag für I</dev/sda1> erstellt haben, dann würden Sie (nach dem Verlassen von B<fdisk> und dem Neustart von Linux, damit die Informationen in der Partitionstabelle gültig sind) mit dem Befehl B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> die ersten 512 Byte der Partition auf Null setzen.
pl: Tak więc używając programu B<cfdisk> lub B<fdisk> do zmiany rozmiaru partycji dosowej, należy też użyć B<dd>(1) do B<wyzerowania pierwszych 512 bajtów> tej partycji przed użyciem dosowego FORMAT. Na przykład, po utworzeniu dosowej partycji I</dev/sda1> programem B<fdisk> (po wyjściu z B<fdisk> i przeładowaniu Linuksa, dzięki czemu informacje o tablicy partycji będą poprawne), powinno się wykonać polecenie B<dd if=/dev/zero of=/dev/hda1 bs=512 count=1>, które zeruje pierwszych 512 bajtów partycji.
uk: У підсумку, якщо ви користуєтеся B<fdisk> або B<cfdisk> для зміни розмірів запису у таблиці розділів DOS, вам слід також скористатися B<dd>(1) для B<занулення перших 512 байтів> цього розділу до використання FORMAT для DOS для форматування розділу. Наприклад, якщо ви скористалися B<fdisk> для створення запису DOS у таблиці розділів для I</dev/sda1>, далі, (після виходу з B<fdisk> і перезавантаження Linux, щоб освіжити дані таблиці розділів) вам слід скористатися командою B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> для занулення перших 512 байтів розділу.

source: System Administration
pl: Administracja systemem
uk: Керування системою
