Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: Wipe filesystem, RAID and partition-table signatures from the device, in order to avoid possible collisions. The argument I<when> can be B<auto>, B<never> or B<always>. When this option is not given, the default is B<auto>, in which case signatures are wiped only when in interactive mode. In all cases detected signatures are reported by warning messages before a new partition table is created. See also B<wipefs>(8) command.
de: entfernt Dateisystem, RAID und Partitionstabellensignaturen von dem Gerät, um mögliche Kollisionen zu vermeiden. Das Argument I<WANN> kann B<auto>, B<never> oder B<always> lauten. Wenn diese Option nicht angegeben ist, ist die Vorgabe B<auto>. In diesem Fall werden die Signaturen nur im interaktiven Modus entfernt. In allen Fällen werden erkannte Signaturen durch Warnmeldungen berichtet, bevor eine neue Partitionstabelle erstellt wird. Siehe auch den Befehl B<wipefs>(8).
pl: Usuwa sygnatury systemu plików, tablicy partycji i RAID aby zapobiec ewentualnym kolizjom. Argument I<kiedy> może przyjąć wartość B<auto>, B<never> lub B<always>. Gdy nie poda się tej opcji, domyślnie stosowane jest ustawienie B<auto>, które usuwa sygnatury tylko w trybie interaktywnym. W każdym przypadku wykryte sygnatury skutkują wypisaniem ostrzeżenia przed utworzeniem nowej tablicy partycji. Zob. też polecenie B<wipefs>(8).
uk: Витерти файлову систему, RAID та підписи таблиці розділів з пристрою для того, щоб уникнути можливих конфліктів. Значенням аргументу I<варіант> може бути B<auto>, B<never> або B<always>. Якщо не вказано цей параметр, типовим варіантом є B<auto>, коли підписи буде витерто, лише якщо програма працює в інтерактивному режимі. В усіх випадках програма повідомлятиме про виявлені підписи шляхом видання попереджень перед створенням таблиці розділів. Див. команду B<wipefs>(8).

source: B<-W>, B<--wipe-partitions> I<when>
de: B<-W>, B<--wipe-partitions> I<WANN>
pl: B<-W>, B<--wipe-partitions> I<kiedy>
uk: B<-W>, B<--wipe-partitions> I<варіант>

source: Wipe filesystem, RAID and partition-table signatures from a newly created partitions, in order to avoid possible collisions. The argument I<when> can be B<auto>, B<never> or B<always>. When this option is not given, the default is B<auto>, in which case signatures are wiped only when in interactive mode and after confirmation by user. In all cases detected signatures are reported by warning messages before a new partition is created. See also B<wipefs>(8) command.
de: Löscht Dateisystem-, RAID- und Partitionstabellensignaturen von einer new erstellten Partition, um mögliche Kollisionen zu vermeiden. Das Argument I<WANN> kann B<auto>, B<never> oder B<always> lauten. Wenn diese Option nicht angegeben ist, ist die Vorgabe B<auto>. In diesem Fall werden die Signaturen nur im interaktiven Modus und nach Bestätigung durch den Benutzer gelöscht. In allen Fällen werden die erkannten Signaturen durch Warnmeldungen berichtet, bevor eine neue Partition erstellt wird. Siehe auch den Befehl B<wipefs>(8).
pl: Usuwa sygnatury systemu plików, tablicy partycji i RAID z nowo tworzonych partycji, aby zapobiec ewentualnym kolizjom. Argument I<kiedy> może przyjąć wartość B<auto>, B<never> lub B<always>. Gdy nie poda się tej opcji, domyślnie stosowane jest ustawienie B<auto>, które usuwa sygnatury tylko w trybie interaktywnym i po potwierdzeniu przez użytkownika. W każdym przypadku wykryte sygnatury skutkują wypisaniem ostrzeżenia przed utworzeniem nowej tablicy partycji. Zob. też polecenie B<wipefs>(8).
uk: Витерти файлову систему, RAID та підписи таблиці розділів з новостворених розділів для того, щоб уникнути можливих конфліктів. Значенням аргументу I<варіант> може бути B<auto>, B<never> або B<always>. Якщо не вказано цей параметр, типовим варіантом є B<auto>, коли підписи буде витерто, лише якщо програма працює в інтерактивному режимі і після підтвердження з боку користувачів. В усіх випадках програма повідомлятиме про виявлені підписи шляхом видання попереджень перед створенням розділу. Див. команду B<wipefs>(8).

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: DEVICES
de: GERÄTE
pl: URZĄDZENIA
uk: ПРИСТРОЇ

source: The I<device> is usually I</dev/sda>, I</dev/sdb> or so. A device name refers to the entire disk. Old systems without libata (a library used inside the Linux kernel to support ATA host controllers and devices) make a difference between IDE and SCSI disks. In such cases the device name will be I</dev/hd*> (IDE) or I</dev/sd*> (SCSI).
de: Das I<Gerät> ist normalerweise I</dev/sda>, I</dev/sdb> oder so. Ein Gerätename gilt für die ganze Platte. Alte Systeme ohne libata (eine im Linux-Kernel verwendete Bibliothek für ATA-Controller und -Geräte) unterscheiden zwischen IDE- und SCSI-Platten. Dort ist der Gerätename I</dev/hd*> (IDE) oder I</dev/sd*> (SCSI).
pl: I<Urządzenie> jest to z reguły I</dev/sda>, I</dev/sdb> itp. Nazwy urządzeń odnoszą się do całego dysku. Stare systemy bez libata (biblioteki używanej wewnątrz jądra Linux do obsługi kontrolerów i urządzeń ATA) rozróżniają dyski IDE i SCSI. W takich przypadkach nazwami urządzeń będą I</dev/hd*> (IDE) lub I</dev/sd*> (SCSI).
uk: Аргументом I<пристрій>, зазвичай, є I</dev/sda>, I</dev/sdb> або щось подібне. Назва пристрою вказує на цілий диск. У старих системах без libata (бібліотеки, яку використано у ядрі Linux для підтримки контролерів і пристроїв ATA основної системи) є різниця між дисками IDE і SCSI. У таких випадках назвою пристрою буде I</dev/hd*> (IDE) або I</dev/sd*> (SCSI).

source: The I<partition> is a device name followed by a partition number. For example, I</dev/sda1> is the first partition on the first hard disk in the system. See also Linux kernel documentation (the I<Documentation/admin-guide/devices.txt> file).
de: Die I<Partition> besteht aus einem Gerätenamen und einer folgenden Partitionsnummer. Beispielsweise ist I</dev/sda1> die erste Partition auf der ersten Festplatte des Systems (siehe auch in der Dokumentation des Linux-Kernels die Datei I<Documentation/admin-guide/devices.txt>).
pl: I<Partycja> to nazwa urządzenia, za którą następuje numer partycji. Na przykład, I</dev/sda1> jest pierwszą partycją pierwszego dysku twardego w systemie. Proszę również zapoznać się z dokumentacją jądra Linux (plik I<Documentation/admin-guide/devices.txt>).
uk: Аргументом I<розділ> є назва пристрою, за якою має бути вказано номер розділу. Наприклад, I</dev/sda1> є першим розділом на першому жорсткому диску у системі. Див. також документацію з ядра Linux (файл I<Documentation/admin-guide/devices.txt>).

source: SIZES
de: GRÖSSEN
pl: ROZMIARY
uk: РОЗМІРИ

source: The "last sector" dialog accepts partition size specified by number of sectors or by +/-E<lt>sizeE<gt>{K,B,M,G,...} notation.
de: Im »Letzter Sektor«-Dialog können Partitionsgrößen als Anzahl der Sektoren oder in der Notation +/-E<lt>GrößeE<gt>{K,B,M,G,…} angegeben werden.
pl: Okno "ostatni sektor" ("last sector") akceptuje podanie rozmiaru partycji za pomocą liczby sektorów albo w notacji B<+>/B<->I<rozmiar>{K,B,M,G,...}.
uk: У діалозі «останній сектор» приймається розмір розділу, який вказано за кількістю секторів або за позначенням +/-E<lt>розмірE<gt>{K,B,M,G,...}.

source: If the size is prefixed by \(aq+\(aq then it is interpreted as relative to the partition first sector. If the size is prefixed by \(aq-\(aq then it is interpreted as relative to the high limit (last available sector for the partition).
de: Wird der Größenangabe ein »+« vorangestellt, so wird diese als Anzahl der Bytes relativ zum ersten Sektor der Partition interpretiert. Falls der Größenangabe ein »-« vorangestellt wird, dann wird sie als relativ zu der Größenbegrenzung (dem letzten verfügbaren Sektor für die Partition) interpretiert.
pl: Jeśli rozmiar poprzedzi się plusem "+", to jest on interpretowany jako liczony w odniesieniu do pierwszego sektora partycji. Jeśli przedrostkiem będzie minus "-", to jest on interpretowany w odniesieniu do ostatniego dostępnego sektora partycji.
uk: Якщо до розміру дописано префікс «+», його буде оброблено як визначник значення, яке є відносним щодо першого сектора розділу. Якщо до розміру додано префікс «-», значення буде оброблено, як відносне до верхнього обмеження (останнього доступного сектора для розділу).

source: In the case the size is specified in bytes than the number may be followed by the multiplicative suffixes KiB=1024, MiB=1024*1024, and so on for GiB, TiB, PiB, EiB, ZiB and YiB. The "iB" is optional, e.g., "K" has the same meaning as "KiB".
de: Falls die Größe in Byte angegeben ist, dann kann eines der multiplikativen Suffixe KiB=1024, MiB=1024*1024 usw. für GiB, TiB, PiB, EiB, ZiB und YiB folgen. Dabei ist »iB« optional, beispielsweise ist »K« gleichbedeutend mit »KiB«.
pl: Gdy poda się rozmiar w bajtach; po liczbie tej mogą występować przyrostki oznaczające wielokrotność: KiB=1024, MiB=1024*1024 itd. dla GiB, TiB, PiB, EiB, ZiB i YiB. Cząstka "iB" jest opcjonalna, tzn. "K" ma to samo znaczenie co "KiB".
uk: У випадку, якщо розмір вказано у байтах, за числом можна вказати одиницю виміру: KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад «K» є тим самим, що і «KiB»).

source: The relative sizes are always aligned according to device I/O limits. The +/-E<lt>sizeE<gt>{K,B,M,G,...} notation is recommended.
de: Die relativen Größenangaben sind stets auf die E/A-Grenzen des Gerätes ausgerichtet. Die Notation +/-E<lt>GrößeE<gt>{K,B,M,G,…} wird daher empfohlen.
pl: Rozmiary relatywne są zawsze wyrównywane zgodnie z limitami wejścia/wyjścia danego urządzenia. Zaleca się stosowanie notacji B<+>/B<->I<rozmiar>{K,B,M,G,...}.
uk: Відносні розміри завжди вирівняно відповідно до обмежень на введення-виведення для пристрою. Рекомендовано користуватися позначенням +/-E<lt>розмірE<gt>{K,B,M,G,...}.

source: For backward compatibility B<fdisk> also accepts the suffixes KB=1000, MB=1000*1000, and so on for GB, TB, PB, EB, ZB and YB. These 10^N suffixes are deprecated.
de: Aus Gründen der Abwärtskompatibilität akzeptiert B<fdisk> auch die Suffixe KB=1000, MB=1000*1000 usw. für GB, TB, PB, EB, ZB und YB. Diese Dezimalsuffixe gelten jedoch als veraltet und sollten nicht mehr verwendet werden.
pl: W celu kompatybilności wstecznej B<fdisk> przyjmuje również przyrostki KB=1000, MB=1000*1000 itd. dla GB, TB, PB, EB, ZB i YB. Te przyrostki utworzone w oparciu o notację 10^N są przestarzałe.
uk: Для забезпечення зворотної сумісності у B<fdisk> також можна використовувати суфікси KB=1000, MB=1000*1000, і так само для GB, TB, PB, EB, ZB і YB. Ці суфікси для 10^N вважаються застарілими.

source: SCRIPT FILES
de: SKRIPTDATEIEN
pl: PLIKI SKRYPTÓW
uk: ФАЙЛИ СКРИПТІВ

source: B<fdisk> allows reading (by \(aqI\(aq command) B<sfdisk>(8) compatible script files. The script is applied to in-memory partition table, and then it is possible to modify the partition table before you write it to the device.
de: B<fdisk> kann (mit dem Befehl »I«) B<sfdisk>(8)-kompatible Skriptdateien verarbeiten. Das Skript wird auf die im Speicher vorgehaltene Partitionstabelle angewendet, wodurch es möglich ist, die Partitionstabelle vor dem eigentlichen Speichern auf dem Laufwerk zu verändern.
pl: B<fdisk> pozwala na odczytanie (poleceniem "I") skryptów kompatybilnych z B<sfdisk>(8). Skrypt jest następnie stosowany do tablicy partycji przechowywanej w pamięci, a później istnieje możliwość modyfikacji jej przed ostatecznym zapisaniem na dysk.
uk: B<fdisk> уможливлює читання (за допомогою команди «I») сумісних із B<sfdisk>(8) файлів скриптів. Скрипт буде застосовано до таблиці розділів у пам'яті, а отже, можна змінити таблицю розділів до запису її на пристрій.

source: And vice-versa it is possible to write the current in-memory disk layout to the script file by command \(aqO\(aq.
de: Umgekehrt können Sie mit dem Befehl »O« die im Speicher vorgehaltene Partitionsaufteilung in eine Skriptdatei schreiben.
pl: Działa to również w drugą stronę, ponieważ poleceniem "O" można zapisać aktualny schemat dysku przechowywany w pamięci do skryptu.
uk: І навпаки, можна записувати поточне компонування диска у пам'яті до файла скрипту за допомогою команди «O».

source: The script files are compatible between B<cfdisk>(8), B<sfdisk>(8), B<fdisk> and other libfdisk applications. For more details see B<sfdisk>(8).
de: Die Skriptdateien sind zu B<cfdisk>(8), B<sfdisk>(8), B<fdisk> und weiteren B<libfdisk>-Anwendungen kompatibel. Weitere Details finden Sie in B<sfdisk>(8).
pl: Pliki skryptów są kompatybilne pomiędzy B<cfdisk>(8), B<sfdisk>(8), B<fdisk> i pozostałymi programami libfdisk. Więcej szczegółów w podręczniku B<sfdisk>(8).
uk: Файли скриптів є сумісними одразу з B<cfdisk>(8), B<sfdisk>(8), B<fdisk> та іншими програмами libfdisk. Докладніші відомості можна знайти у підручнику з B<sfdisk>(8).

source: DISK LABELS
de: DISKLABEL
pl: ETYKIETY DYSKU
uk: МІТКИ ДИСКІВ

source: B<GPT (GUID Partition Table)>
de: B<GPT (GUID-Partitionstabelle)>

source: GPT is modern standard for the layout of the partition table. GPT uses 64-bit logical block addresses, checksums, UUIDs and names for partitions and an unlimited number of partitions (although the number of partitions is usually restricted to 128 in many partitioning tools).
de: GPT ist ein moderner Standard für das Layout der Partitionstabelle. GPT verwendet logische 64-Bit-Blockadressen, Prüfsummen, UUIDs und Namen für Partitionen sowie eine unbegrenzte Anzahl der Partitionen (wobei diese Anzahl in vielen Partitionierungswerkzeugen auf 128 begrenzt ist).
pl: GPT to nowoczesny standard opisujący schemat tablicy partycji. GTP używa 64-bitowe logicznych adresów bloków, sum kontrolnych, UUID-ów i nazw dla partycji. Nie ma ograniczeń w liczbie partycji (choć narzędzia partycjonujące zwykle ograniczają tę liczbę do 128).
uk: GPT — сучасний стандарт для компонування таблиці розділів. GPT використовує 64-бітові адреси логічних блоків, контрольні суми, UUID та назви для розділів та уможливлює необмежену кількість розділів (хоча кількість розділів, зазвичай, обмежується 128 у багатьох інструментах для роботи з розділами).

source: Note that the first sector is still reserved for a B<protective MBR> in the GPT specification. It prevents MBR-only partitioning tools from mis-recognizing and overwriting GPT disks.
de: Beachten Sie, dass der erste Sektor gemäß der GPT-Spezifikation stets für einen B<geschützten MBR> reserviert ist. Dies verhindert, dass Partitionierungswerkzeuge, die nur auf den MBR zugreifen, GPT-Festplatten falsch erkennen und überschreiben.
pl: Proszę zauważyć, że w specyfikacji GPT pierwszy sektor jest wciąż przeznaczony na B<ochronne MBR>. Unika się w ten sposób błędne rozpoznanie i zamazanie dysków GPT przez narzędzia partycjonujące znające tylko MBR.
uk: Зауважте, що перший сектор у специфікації GPT усе ще зарезервовано для B<захисного MBR>. Він запобігає помилковому розпізнаванню і перезапису дисків GPT інструментами для роботи з розділами, які розуміють лише MBR.

source: GPT is always a better choice than MBR, especially on modern hardware with a UEFI boot loader.
de: GPT ist stets vor MBR zu bevorzugen, insbesondere auf moderner Hardware mit einem UEFI-Bootloader.
pl: GPT jest zawsze lepszym wyborem niż MBR, szczególnie na nowoczesnym sprzęcie korzystającym z UEFI.
uk: GPT є завжди кращим вибором за MBR, особливо на сучасному обладнанні із завантажувачем UEFI.

source: B<DOS-type (MBR)>
de: B<DOS-Typ (MBR)>
pl: B<Typu DOS-owego (MBR)>

source: A DOS-type partition table can describe an unlimited number of partitions. In sector 0 there is room for the description of 4 partitions (called `primary\(aq). One of these may be an extended partition; this is a box holding logical partitions, with descriptors found in a linked list of sectors, each preceding the corresponding logical partitions. The four primary partitions, present or not, get numbers 1-4. Logical partitions are numbered starting from 5.
de: Eine DOS-Partitionstabelle kann eine unbegrenzte Anzahl von Partitionen enthalten. In Sektor 0 gibt es Raum für die Beschreibung von 4 Partitionen (die als »primäre« bezeichnet werden). Eine von ihnen kann logische Partitionen enthalten und wird erweiterte Partition genannt. Jeder logischen Partition geht eine verkettete Liste von Sektoren voraus. Für die vier primären Partitionen sind unabhängig von deren Existenz die Nummern 1 bis 4 reserviert, die Nummerierung der logischen Partitionen beginnt bei 5.
pl: Tablica partycji typu DOS może opisać nieograniczoną liczbę partycji. W sektorze 0 jest miejsce na opis 4 partycji (zwanych podstawowymi \(em `primary'). Jedna z nich może być partycją rozszerzoną; jest ona jakby pudełkiem zawierającym partycje logiczne, których deskryptory można znaleźć w wiązanej liście sektorów, z których każdy poprzedza odpowiadającą partycję logiczną. Cztery podstawowe partycje, niezależnie od tego czy są obecne, czy nie, otrzymują numery od 1 do 4. Numery partycji logicznych zaczynają się od 5.
uk: Таблиця розділів DOS-типу може описувати необмежену кількість розділів. У секторі 0 є місце для опису 4 розділів (які називають «основними»). Одним з цих розділів може бути розширеним розділом. Розширений розділ може містити логічні розділи за допомогою дескрипторів, які розміщують у пов'язаному списку секторів, кожен з яких передує відповідним логічним розділам. Чотири основні розділи, є вони на диску чи ні, мають номери 1-4. Номери логічних розділів починаються з 5.

source: In a DOS-type partition table the starting offset and the size of each partition is stored in two ways: as an absolute number of sectors (given in 32 bits), and as a B<Cylinders/Heads/Sectors> triple (given in 10+8+6 bits). The former is OK \(em with 512-byte sectors this will work up to 2 TB. The latter has two problems. First, these C/H/S fields can be filled only when the number of heads and the number of sectors per track are known. And second, even if we know what these numbers should be, the 24 bits that are available do not suffice. DOS uses C/H/S only, Windows uses both, Linux never uses C/H/S. The B<C/H/S addressing is deprecated> and may be unsupported in some later B<fdisk> version.
de: In einer DOS-Partitionstabelle wird der Startversatz (starting offset) und die Größe der einzelnen Partitionen auf zwei Arten gespeichert: als absolute Anzahl der Sektoren (angegeben in 32 Bit) und als B<Zylinder/Köpfe/Sektoren>-Tripel (CHS, angegeben in 10/8/6 Bit). Ersteres ist in Ordnung - mit 512-Byte-Sektoren funktioniert das bis zu 2 TB. Letzteres hat zwei Probleme. Erstens können die C/H/S-Felder nur dann ausgefüllt werden, wenn die Anzahl der Köpfe und die Anzahl der Sektoren pro Spur bekannt sind. Und zweitens, selbst wenn diese Zahlen bekannt sind, reichen die 24 verfügbaren Bit nicht aus. DOS verwendet C/H/S, Windows beides, Linux verwendet C/H/S nie. Die B<C/H/S-Adressierung ist veraltet>, daher ist es möglich, dass diese in zukünftigen Versionen von B<fdisk> nicht mehr unterstützt wird.
pl: W tablicy partycji typu DOS początkowe przesunięcie ("offset") i rozmiar każdej partycji przechowywany jest na dwa sposoby: jako bezwzględna liczba sektorów (zapisywana na 32 bitach) i jako trójka Cylindry/Głowice/Sektory (B<C>ylinders/B<H>eads/B<S>ectors) (zapisywana na 10+8+6 bitach). Pierwszy zapis jest w porządku - przy 512-bajtowych sektorach będzie działał aż do 2 TB. W przypadku drugiego zapisu występują dwa małe problemy. Przede wszystkim pola C/H/S mogą być wypełnione tylko wtedy, gdy znana jest liczba głowic oraz liczba sektorów na ścieżce. Po drugie, nawet jeżeli te liczby są znane, to te 24 bity, które są dostępne, nie wystarczają. DOS używa tylko C/H/S, Windows \(em obu, a Linux nigdy nie używa C/H/S. B<Adresowanie C/H/S jest przestarzałe> i może w przyszłości nie być obsługiwane przez którąś z wersji B<fdisk>.
uk: У таблиці розділів DOS-типу початкове зміщення та розмір кожного з розділів зберігається у два способи: як абсолютна кількість секторів (задана у 32 біти) і як трійка B<циліндри/голівки/сектори> (задана у 10+8+6 бітів). З першим варіантом усе гаразд \(em з 512-байтовими секторами це працює до 2 ТБ. З другим варіантом є дві проблеми. Перша полягає у тому, що ці поля Ц/Г/С може бути заповнено, лише якщо відома кількість голівок та секторів на доріжку. А друга — у тому, що навіть якщо нам відомі значення цих параметрів, 24 доступних бітів недостатньо для їхнього запису. У DOS використано лише Ц/Г/С, у Windows — обидва варіанти, Linux ніколи не використовує Ц/Г/С. Адресування B<Ц/Г/С вважається застарілим>, його підтримку може бути вилучено у якійсь з майбутніх версій B<fdisk>.

source: B<Please, read the DOS-mode section if you want DOS-compatible partitions.> B<fdisk> does not care about cylinder boundaries by default.
de: B<Bitte lesen Sie den Abschnitt zum DOS-Modus, wenn Sie DOS-kompatible Partitionen benötigen.> B<fdisk> beachtet in der Voreinstellung keine Zylindergrenzen.
pl: B<Proszę zapoznać się z rozdziałem o trybie DOS-owym, aby utworzyć partycje kompatybilne z DOS-em.> Domyślnie, B<fdisk> nie troszczy się o granice cylindrów.
uk: B<Будь ласка, ознайомтеся із розділом щодо режиму DOS, якщо вам потрібні сумісні із DOS розділи.> Типово, B<fdisk> не переймається вирівнюванням на межу циліндра.

source: B<BSD/Sun-type>
de: B<BSD/Sun-Typ>
pl: B<Typu BSD/Sun>

source: A BSD/Sun disklabel can describe 8 partitions, the third of which should be a `whole disk\(aq partition. Do not start a partition that actually uses its first sector (like a swap partition) at cylinder 0, since that will destroy the disklabel. Note that a B<BSD label> is usually nested within a DOS partition.
de: Ein BSD/SUN-Disklabel kann acht Partitionen beschreiben. Die dritte Partition sollte eine Partition beschreiben, die für eine »ganze Platte« steht. Partitionen, die (wie eine Auslagerungspartition) ihren ersten Sektor auf Zylinder 0 nutzen, sollten nicht benutzt werden, weil dadurch das Disklabel beschädigt wird. Beachten Sie, dass ein B<BSD-Label> üblicherweise innerhalb einer DOS-Partition verschachtelt ist.
pl: Etykieta dysku typu BSD/Sun może opisywać 8 partycji, z których trzecia powinna być specjalną partycją oznaczającą cały dysk. Partycji, która używa swojego pierwszego sektora (jak na przykład partycja wymiany) nie należy umieszczać w cylindrze 0, ponieważ zniszczy to etykietę dysku. Proszę zauważyć, że B<etykieta BSD> jest zwykle zagnieżdżona w partycji DOS.
uk: Мітка диска BSD/Sun може описувати 8 розділів, третім з яких має бути розділ «усього диска». Не розпочинайте розділ, який використовує його перший сектор (подібний до розділу резервної пам'яті на диску) на циліндрі 0, оскільки це знищить мітку диска. Зауважте, що B<мітку BSD>, зазвичай, вкладено у розділ DOS.

source: B<IRIX/SGI-type>
de: B<IRIX/SGI-Typ>
pl: B<Typu IRIX/SGI>
