Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: All partitioning is driven by device I/O limits (the topology) by default. B<fdisk> is able to optimize the disk layout for a 4K-sector size and use an alignment offset on modern devices for MBR and GPT. It is always a good idea to follow B<fdisk>'s defaults as the default values (e.g., first and last partition sectors) and partition sizes specified by the +/-E<lt>sizeE<gt>{M,G,...} notation are always aligned according to the device properties.
de: In der Voreinstellung werden jegliche Partitionierungsvorgänge durch die E/A-Grenzen (die Topologie) des Gerätes bestimmt. B<fdisk> ist in der Lage, das Platten-Layout für eine 4K-Sektorengröße zu optimieren und den Ausrichtungsversatz auf modernen Geräten für MBR und GPT zu nutzen. Es ist immer eine gute Wahl, den Voreinstellungen von B<fdisk> zum Beispiel im Hinblick auf den jeweils ersten und letzten Sektor einer Partition zu folgen, und die durch die +/-E<lt>GrößeE<gt>{M,G,…}-Notation angegebenen Partitionen werden stets entsprechend den Gegebenheiten des Gerätes ausgerichtet sein.
pl: Partycjonowanie przestrzega domyślnie limitów wejścia/wyjścia urządzenia (topologii). B<fdisk> jest w stanie zoptymalizować schemat dysku do 4-kilobajtowego rozmiaru sektora oraz używa wyrównania przesunięcia na współczesnych dyskach korzystających z MBR i GPT. Zawsze powinno się korzystać z ustawień domyślnych B<fdisk>a, ponieważ domyślne wartości (np. początkowego i końcowego sektora partycji) i rozmiary partycji podane w notacji B<+>/B<->I<rozmiar>{M,G,...} są zawsze wyrównywane zgodnie z właściwościami urządzenia.
uk: Типово, поділ на розділи є керованим обмеженнями введення-виведення пристрою (топологією). B<fdisk> може оптимізувати компонування диска для розміру сектора у 4 кБ і використовувати зсув вирівнювання на сучасних пристроях для MBR і GPT. Завжди варто використовувати типові значення B<fdisk> (наприклад, перший і останній сектори розділу), а розміри розділів, які вказано у позначеннях +/-E<lt>розмірE<gt>{M,G,...}, завжди вирівнюються відповідно до властивостей пристрою.

source: CHS (Cylinder-Head-Sector) addressing is deprecated and not used by default. Please, do not follow old articles and recommendations with "fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>" advices for SSD or 4K-sector devices.
de: Die CHS-Adressierung (»Cylinder-Head-Sector«, Zylinder-Kopf-Sektor) gilt als veraltet und wird standardmäßig nicht verwendet. Bitte folgen Sie keinen veralteten Artikeln und Empfehlungen wie »fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>« für SSD-Geräte oder solche mit 4k-Sektoren.
pl: Adresowanie cylinder-głowica-sektor (ang. Cylinder-Head-Sector - CHS) jest przestarzałe i nie jest domyślnie stosowane. Nie należy korzystać ze starych artykułów i rekomendacji z poleceniem "fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>" do napędów SSD lub urządzeń z sektorami 4K.
uk: Адресування CHS (Cylinder-Head-Sector або циліндр-голівка-сектор) вважається застарілим і типово не використовуються. Будь ласка, не користуйтеся застарілими статтями і рекомендаціями, де радять «fdisk -S E<lt>nE<gt> -H E<lt>nE<gt>» для SSD або пристроями із секторами з розміром 4 кБ.

source: Note that B<partx>(8) provides a rich interface for scripts to print disk layouts, B<fdisk> is mostly designed for humans. Backward compatibility in the output of B<fdisk> is not guaranteed. The input (the commands) should always be backward compatible.
de: Beachten Sie, dass B<partx>(8) eine leistungsfähige Schnittstelle für Skripte zum Ausgeben von Platten-Layouts bietet, während B<fdisk> eher für Normalbenutzer entworfen wurde. Abwärtskompatibilität in der Ausgabe von B<fdisk> kann nicht garantiert werden. Die Eingabe (die Befehle) dagegen sollten immer abwärtskompatibel sein.
pl: Bogaty interfejs do wyświetlania schematów dysków dla skryptów zapewnia B<partx>(8), B<fdisk> jest przeznaczony raczej dla ludzi. Kompatybilność wsteczna w wyjściu B<fdisk> nie jest gwarantowana. Wejście (polecenia) powinny pozostać wstecznie kompatybilne.
uk: Зауважте, що у B<partx>(8) передбачено чудовий інтерфейс для виведення компонувань дисків за допомогою скриптів, B<fdisk>, здебільшого, дуже зручний у користуванні. Зворотну сумісність у виведених B<fdisk> даних не гарантовано. Вхідні дані (команди) завжди мають бути сумісними із попередніми версіями.

source: Specify the sector size of the disk. Valid values are 512, 1024, 2048, and 4096. (Recent kernels know the sector size. Use this option only on old kernels or to override the kernel's ideas.) Since util-linux-2.17, B<fdisk> differentiates between logical and physical sector size. This option changes both sector sizes to I<sectorsize>B<.>
de: gibt die Sektorgröße der Festplatte an. Gültige Werte sind 512, 1024, 2048 oder 4096. (Neuere Kernel kennen die Sektorgröße. Verwenden Sie diese Option nur mit alten Kerneln oder um die Sicht des Kernels außer Kraft zu setzen.) Seit util-linux-2.17 unterscheidet B<fdisk> zwischen logischer und physischer Sektorgröße. Diese Option ändert beide Sektorgrößen auf I<Sektorgröße>B<.>
pl: Określa rozmiar sektora dysku. Możliwe wartości są następujące: 512, 1024, 2048 i 4096. (Ostatnie jądra znają rozmiar sektora. Proszę używać tej opcji tylko dla starych jąder lub w celu nadpisania wartości podanej przez jądro). Od util-linux-2.17 B<fdisk> rozróżnia logiczny i fizyczny rozmiar sektora. Ta opcja zmienia obie wartości rozmiarów sektora na I<rozmiar-sektora>.
uk: Вказати розмір сектора на диску. Коректними є значення 512, 1024, 2048 і 4096. (Нові ядра самі визначають розмір сектора. Користуйтеся цим параметром лише для застарілих ядер або для зміни автоматично визначеного значення.) З випуску util-linux-2.17 B<fdisk> розрізняє розміри логічного і фізичного секторів. За допомогою цього параметра можна змінити обидва розміри на I<розмір_сектора>B<.>

source: Don't erase the beginning of the first disk sector when creating a new disk label. This feature is supported for GPT and MBR.
de: verhindert das Löschen des ersten Sektors des Geräts, wenn eine neue Festplattenbezeichnung erzeugt wird. Dieses Funktionsmerkmal wird für GPT und MBR unterstützt.
pl: Nie zamazuje początku pierwszego sektora dysku przy tworzeniu nowej etykiety dysku. Ta funkcja jest obsługiwana w przypadku GPT i MBR.
uk: Не витирати початок першого сектора диска при створенні мітки диска. Підтримку цієї можливості передбачено для GPT і MBR.

source: Specify the compatibility mode, 'dos' or 'nondos'. The default is non-DOS mode. For backward compatibility, it is possible to use the option without the I<mode> argument -- then the default is used. Note that the optional I<mode> argument cannot be separated from the B<-c> option by a space, the correct form is for example '-c=dos'.
de: legt den Kompatibilitätsmodus (»dos« oder »nondos«) fest. Der Standardwert ist »nondos«. Um Abwärtskompatibilität zu gewährleisten, kann die Option ohne I<Modus>-Argument verwendet werden. In diesem Fall wird der Standardwert verwendet. Beachten Sie, dass das optionale I<Modus>-Argument nicht von der B<-c>-Option durch ein Leerzeichen getrennt werden darf, die korrekte Form ist beispielsweise »-c=dos«.
pl: Określa tryb kompatybilności, B<dos> lub B<nondos>. Domyślnym trybem jest niedosowy. Aby zachować kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu I<tryb> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument I<tryb> nie może być oddzielony od opcji B<-c> spacją, poprawną formą jest np. "-c=dos".
uk: Вказати режим сумісності, «dos» або «nondos» Типовим є режим не-DOS Для зворотної сумісності можна скористатися параметром без аргументу I<режим> \(em буде використано типове значення. Зауважте, що необов'язковий аргумент I<режим> не може бути відокремлено від параметра B пробілом. Правильною формою, наприклад, є така: «-c=dos».

source: Display a help text and exit.
de: zeigt eine Hilfe an und beendet das Programm.
pl: Wyświetla pomoc i kończy pracę
uk: Вивести текст довідки і завершити роботу.

source: Colorize the output. The optional argument I<when> can be B<auto>, B<never> or B<always>. If the I<when> argument is omitted, it defaults to B<auto>. The colors can be disabled; for the current built-in default see the B<--help> output. See also the B<COLORS> section.
de: stellt die Ausgabe farbig dar. Das optionale Argument I<WANN> kann B<auto>, B<never> oder B<always> sein. Falls I<WANN> nicht angegeben ist, ist B<auto> die Voreinstellung. Die Farben können deaktiviert werden. Die jeweilige einkompilierte Voreinstellung zeigt Ihnen die Option B<--help> an. Siehe auch den Abschnitt B<FARBEN>.
pl: Koloryzuje wynik. Opcjonalnym argumentem I<kiedy> może być B<auto>, B<never> (nigdy) lub B<always> (zawsze). Gdy nie poda się argumentu I<kiedy>, domyślnym ustawieniem jest B<auto>. Kolory mogą być wyłączone, aktualne wbudowane ustawienie domyślne pokaże opcja B<--help>. Zob. również rozdział B<KOLORY>.
uk: Розфарбувати виведені дані. Значенням додаткового аргументу I<варіант> може бути *auto*, *never* або *always*. Якщо аргумент I<варіант> пропущено, типовим значенням вважається *auto*. Розфарбовування можна вимкнути. Із поточним вбудованим типовим значенням можна ознайомитися за допомогою виведення команди з параметром *--help*. Див. також розділ КОЛЬОРИ.

source: List the partition tables for the specified devices and then exit. If no devices are given, those mentioned in I</proc/partitions> (if that file exists) are used.
de: gibt Partitionstabellen für die angegebenen Geräte aus und beendet das Programm. Wurden keine Geräte angegeben, werden bei Existenz von I</proc/partitions> die dort erwähnten Geräte verwendet.
pl: Wypisuje tablice partycji dla podanych urządzeń i kończy działanie. Jeżeli nie podano żadnych urządzeń, to używane są urządzenia wymienione w pliku I</proc/partitions> (o ile taki plik istnieje).
uk: Вивести список таблиць розділів для вказаних пристроїв і завершити роботу. Якщо пристроїв не вказано, буде використано ті, записи яких є у I</proc/partitions> (якщо цей файл існує).

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<"yes">. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it's recommended to avoid collisions with udevd or other tools.
de: verwendet eine exklusive BSD-Sperre für das Gerät oder die Datei, auf dem/der es agiert. Das optionale Argument I<Modus> kann B<yes>, B<no> (oder 1 und 0) oder B<nonblock> sein. Falls das Argument I<Modus> weggelassen wird, wird standardmäßig B<yes> angenommen. Diese Option setzt die Umgebungsvariable B<$LOCK_BLOCK_DEVICE> außer Kraft. Standardmäßig wird überhaupt keine Sperre gesetzt, dies wird aber empfohlen, um Kollisionen mit Udevd zu vermeiden.
pl: Używa blokady na wyłączność BSD do urządzeń i plików na których działa. Opcjonalnym argumentem I<tryb> może być B<yes>, B<no> (albo B<1> lub B<0>) lub też B<nonblock>. Jeśli nie poda się I<trybu>, domyślną wartością jest B<yes>. Opcja ta przesłania zmienną środowiskową B<$LOCK_BLOCK_DEVICE>. Choć domyślnie nie jest używana żadna blokada, zaleca się jej użycie aby uniknąć kolizji z udevd i innymi narzędziami.
uk: Скористатися виключним блокуванням BSD для пристрою або файла, який ним керує. Значенням додаткового аргументу I<режим> може бути B<yes>, B<no> (або 1 і 0) чи B<nonblock>. Якщо пропустити аргумент I<режим>, типовим значенням буде B<"yes">. Цей параметр переписує змінну середовища B<$LOCK_BLOCK_DEVICE>. Типовим станом є невикористання блокування, але рекомендуємо уникати конфліктів із udevd або іншими програмами.

source: Don't automatically create a default partition table on empty device. The partition table has to be explicitly created by user (by command like 'o', 'g', etc.).
de: erstellt auf einem leeren Gerät nicht automatisch eine neue Standard-Partitionstabelle. Die Partitionstabelle muss explizit vom Benutzer erstellt werden (mit einem Befehl wie »o«, »g« usw.).
pl: Nie tworzy automatycznie domyślnej tablicy partycji na pustym urządzeniu. Tablica partycji musi być utworzona wprost przez użytkownika (poleceniami takimi jak "o", "g" itp.).
uk: Не створювати типової таблиці розділів на порожньому пристрої автоматично. Таблицю розділів має бути створено явним чином користувачем (за допомогою команд, подібних до «o», «g» тощо).

source: B<-o>,B< --output >I<list>
de: B<-o>,B< --output >I<Liste>
pl: B<-o>,B< --output >I<lista>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns.
de: gibt die anzuzeigenden Spalten an. Mit B<--help> erhalten Sie eine Liste aller unterstützten Spalten.
pl: Określa wypisywane kolumny. Ich listę można poznać podając opcję B<--help>.
uk: Визначити, які стовпчики слід використовувати для виведення. Скористайтеся параметром B<--help>, щоб переглянути список підтримуваних стовпчиків.

source: Print the size in 512-byte sectors of each given block device. This option is DEPRECATED in favour of B<blockdev>(8).
de: gibt die Größe jedes der angegebenen blockorientierten Geräte in 512-Byte-Sektoren aus. Diese Option ist veraltet, verwenden Sie stattdessen B<blockdev>(8).
pl: Wyświetla rozmiar jako 512-bajtowe sektory każdego podanego urządzenia blokowego. Ta opcja jest PRZESTARZAŁA na korzyść B<blockdev>(8).
uk: Вивести розмір у 512-байтових секторах кожного заданого блокового пристрою. Цей параметр вважається ЗАСТАРІЛИМ. Користуйтеся B<blockdev>(8).

source: When listing partition tables, show sizes in 'sectors' or in 'cylinders'. The default is to show sizes in sectors. For backward compatibility, it is possible to use the option without the I<unit> argument -- then the default is used. Note that the optional I<unit> argument cannot be separated from the B<-u> option by a space, the correct form is for example '-u=cylinders'.
de: legt fest, ob bei der Ausgabe von Partitionstabellen die Größe in »Sektoren« oder Zylindern angegeben wird. Standardmäßig wird die Größe in Sektoren angezeigt. Um Abwärtskompatibilität zu gewährleisten, kann die Option ohne das I<Einheit>-Argument verwendet werden. In diesem Fall wird der Standardwert verwendet. Beachten Sie, dass das optionale I<Einheit>-Argument nicht von der B<-u>-Option durch ein Leerzeichen getrennt werden kann, die korrekte Form ist beispielsweise »-u=cylinders«.
pl: Podczas wypisywania tablic partycji pokazuje rozmiary w B<sectors> (sektorach) lub w B<cylinders> (cylindrach). Domyślnie używane są sektory. Ze względu na kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu I<jednostki> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument I<jednostka> nie może być oddzielony od opcji B<-u> spacją, poprawną formą jest np. "-u=cylinders".
uk: При виведенні таблиць розділів показувати розміри у секторах («sectors») або у циліндрах («cylinders») Типовим є показ розмірів у секторах Для зворотної сумісності можна скористатися параметром без аргументу I<одиниця> — буде використано типовий варіант. Зауважте, що необов'язковий аргумент I<одиниця> не можна відокремлювати від параметра B<-u> пробілом. Правильною формою, наприклад, є «-u=cylinders».

source: Specify the number of cylinders of the disk. I have no idea why anybody would want to do so.
de: gibt die Zylinderzahl der Platte an. Und wozu soll das jemand verwenden wollen?
pl: Określa liczbę cylindrów dysku. Prawdopodobnie nie ma osoby, która miałaby powód aby używać tej opcji.
uk: Вказати кількість циліндрів на диску. Невідомо, чи комусь взагалі це потрібно.

source: Specify the number of heads of the disk. (Not the physical number, of course, but the number used for partition tables.) Reasonable values are 255 and 16.
de: legt die Anzahl der Köpfe der Festplatte fest. (Natürlich nicht die physikalische Anzahl, sondern die für Partitionstabellen verwendete). Vernünftige Werte sind 255 und 16.
pl: Określa liczbę głowic dysku (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądnymi wartościami są 255 i 16.
uk: Вказати кількість голівок на диску. (Звичайно ж, не фізичну кількість, а кількість, яку використано для таблиць розділів.) Прийнятними значеннями є 255 та 16.

source: Specify the number of sectors per track of the disk. (Not the physical number, of course, but the number used for partition tables.) A reasonable value is 63.
de: legt fest, wie viele Sektoren sich auf einer Spur der Platte befinden, allerdings nicht die physikalische Anzahl, sondern die für Partitionstabellen verwendete. Ein sinnvoller Wert ist 63.
pl: Określa liczbę sektorów dysku na ścieżkę (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądną wartością jest 63.
uk: Вказати кількість секторів на доріжку на диску. (Звичайно ж, не фізичну кількість, а кількість, яку використано для таблиць розділів.) Прийнятним значенням є 63.

source: Wipe filesystem, RAID and partition-table signatures from the device, in order to avoid possible collisions. The argument I<when> can be B<auto>, B<never> or B<always>. When this option is not given, the default is B<auto>, in which case signatures are wiped only when in interactive mode. In all cases detected signatures are reported by warning messages before a new partition table is created. See also B<wipefs>(8) command.
de: entfernt Dateisystem, RAID und Partitionstabellensignaturen von dem Gerät, um mögliche Kollisionen zu vermeiden. Das Argument I<WANN> kann B<auto>, B<never> oder B<always> lauten. Wenn diese Option nicht angegeben ist, ist die Vorgabe B<auto>. In diesem Fall werden die Signaturen nur im interaktiven Modus entfernt. In allen Fällen werden erkannte Signaturen durch Warnmeldungen berichtet, bevor eine neue Partitionstabelle erstellt wird. Siehe auch den Befehl B<wipefs>(8).
pl: Usuwa sygnatury systemu plików, tablicy partycji i RAID aby zapobiec ewentualnym kolizjom. Argument I<kiedy> może przyjąć wartość B<auto>, B<never> lub B<always>. Gdy nie poda się tej opcji, domyślnie stosowane jest ustawienie B<auto>, które usuwa sygnatury tylko w trybie interaktywnym. W każdym przypadku wykryte sygnatury skutkują wypisaniem ostrzeżenia przed utworzeniem nowej tablicy partycji. Zob. też polecenie B<wipefs>(8).
uk: Витерти файлову систему, RAID та підписи таблиці розділів з пристрою для того, щоб уникнути можливих конфліктів. Значенням аргументу I<варіант> може бути B<auto>, B<never> або B<always>. Якщо не вказано цей параметр, типовим варіантом є B<auto>, коли підписи буде витерто, лише якщо програма працює в інтерактивному режимі. В усіх випадках програма повідомлятиме про виявлені підписи шляхом видання попереджень перед створенням таблиці розділів. Див. команду B<wipefs>(8).

source: Wipe filesystem, RAID and partition-table signatures from a newly created partitions, in order to avoid possible collisions. The argument I<when> can be B<auto>, B<never> or B<always>. When this option is not given, the default is B<auto>, in which case signatures are wiped only when in interactive mode and after confirmation by user. In all cases detected signatures are reported by warning messages before a new partition is created. See also B<wipefs>(8) command.
de: Löscht Dateisystem-, RAID- und Partitionstabellensignaturen von einer new erstellten Partition, um mögliche Kollisionen zu vermeiden. Das Argument I<WANN> kann B<auto>, B<never> oder B<always> lauten. Wenn diese Option nicht angegeben ist, ist die Vorgabe B<auto>. In diesem Fall werden die Signaturen nur im interaktiven Modus und nach Bestätigung durch den Benutzer gelöscht. In allen Fällen werden die erkannten Signaturen durch Warnmeldungen berichtet, bevor eine neue Partition erstellt wird. Siehe auch den Befehl B<wipefs>(8).
pl: Usuwa sygnatury systemu plików, tablicy partycji i RAID z nowo tworzonych partycji, aby zapobiec ewentualnym kolizjom. Argument I<kiedy> może przyjąć wartość B<auto>, B<never> lub B<always>. Gdy nie poda się tej opcji, domyślnie stosowane jest ustawienie B<auto>, które usuwa sygnatury tylko w trybie interaktywnym i po potwierdzeniu przez użytkownika. W każdym przypadku wykryte sygnatury skutkują wypisaniem ostrzeżenia przed utworzeniem nowej tablicy partycji. Zob. też polecenie B<wipefs>(8).
uk: Витерти файлову систему, RAID та підписи таблиці розділів з новостворених розділів для того, щоб уникнути можливих конфліктів. Значенням аргументу I<варіант> може бути B<auto>, B<never> або B<always>. Якщо не вказано цей параметр, типовим варіантом є B<auto>, коли підписи буде витерто, лише якщо програма працює в інтерактивному режимі і після підтвердження з боку користувачів. В усіх випадках програма повідомлятиме про виявлені підписи шляхом видання попереджень перед створенням розділу. Див. команду B<wipefs>(8).

source: The I<device> is usually /dev/sda, /dev/sdb or so. A device name refers to the entire disk. Old systems without libata (a library used inside the Linux kernel to support ATA host controllers and devices) make a difference between IDE and SCSI disks. In such cases the device name will be /dev/hd* (IDE) or /dev/sd* (SCSI).
de: Das I<Gerät> ist normalerweise /dev/sda, /dev/sdb oder so. Ein Gerätename gilt für die ganze Platte. Alte Systeme ohne libata (eine im Linux-Kernel verwendete Bibliothek für ATA-Controller und -Geräte) unterscheiden zwischen IDE- und SCSI-Platten. Dort ist der Gerätename /dev/hd* (IDE) oder /dev/sd* (SCSI).
pl: I<Urządzenie> jest to z reguły /dev/sda, /dev/sdb itp. Nazwy urządzeń odnoszą się do całego dysku. Stare systemy bez libata (biblioteki używanej wewnątrz jądra Linux do obsługi kontrolerów i urządzeń ATA) rozróżniają dyski IDE i SCSI. W takich przypadkach nazwami urządzeń będą /dev/hd* (IDE) lub /dev/sd* (SCSI).
uk: Аргументом I<пристрій>, зазвичай, є /dev/sda, /dev/sdb або щось подібне. Назва пристрою вказує на цілий диск. У старих системах без libata (бібліотеки, яку використано у ядрі Linux для підтримки контролерів і пристроїв ATA основної системи) є різниця між дисками IDE і SCSI. У таких випадках назвою пристрою буде /dev/hd* (IDE) або /dev/sd* (SCSI).

source: The I<partition> is a device name followed by a partition number. For example, /dev/sda1 is the first partition on the first hard disk in the system. See also Linux kernel documentation (the Documentation/admin-guide/devices.txt file).
de: Die I<Partition> besteht aus einem Gerätenamen und einer folgenden Partitionsnummer. Beispielsweise ist /dev/sda1 die erste Partition auf der ersten Festplatte des Systems (siehe auch in der Dokumentation des Linux-Kernels die Datei Documentation/admin-guide/devices.txt).
pl: I<Partycja> to nazwa urządzenia, za którą następuje numer partycji. Na przykład, /dev/sda1 jest pierwszą partycją pierwszego dysku twardego w systemie. Proszę również zapoznać się z dokumentacją jądra Linux (plik Documentation/admin-guide/devices.txt).
uk: Аргументом I<розділ> є назва пристрою, за якою має бути вказано номер розділу Наприклад, /dev/sda1 є першим розділом на першому жорсткому диску у системі. Див. також документацію з ядра Linux (файл Documentation/admin-guide/devices.txt).
