Repository: sebras/manpages-l10n
Catalog: po/*/man8/fdisk.8.po
Languages: de, pl, uk

source: An IRIX/SGI disklabel can describe 16 partitions, the eleventh of which should be an entire `volume\(aq partition, while the ninth should be labeled `volume header\(aq. The volume header will also cover the partition table, i.e., it starts at block zero and extends by default over five cylinders. The remaining space in the volume header may be used by header directory entries. No partitions may overlap with the volume header. Also do not change its type or make some filesystem on it, since you will lose the partition table. Use this type of label only when working with Linux on IRIX/SGI machines or IRIX/SGI disks under Linux.
de: Ein IRIX/SGI-Disklabel kann 16 Partitionen beschreiben; die elfte sollte eine vollständige »volume«-Partition sein, während die neunte als »volume header« gekennzeichnet werden sollte. Der Volume Header wird auch die Partitionstabelle umfassen, d. h. er beginnt bei Block Null und erstreckt sich standardmäßig über fünf Zylinder. Der verbleibende Platz im Volume Header kann durch Header-Verzeichniseinträge belegt werden. Es dürfen keine Partitionen mit dem Volume Header überlappen. Legen Sie dort kein Dateisystem an und verändern Sie nicht seinen Typ, weil Sie dadurch die Partitionstabelle verlieren. Verwenden Sie dieses Label nur, wenn Sie mit Linux auf IRIX-/SGI-Maschinen arbeiten oder auf IRIX-/SGI-Festplatten zugreifen.
pl: Etykieta dysku IRIX/SGI może opisywać 16 partycji, z których jedenasta powinna być partycją całego "woluminu", natomiast dziewiąta powinna być tzw. "nagłówkiem woluminu". Nagłówek woluminu także pokrywa całą tablicę partycji, tzn. zaczyna się w bloku zerowym i domyślnie ciągnie się przez pięć cylindrów. Pozostałe miejsce w nagłówku woluminu może być użyte przez wpisy głównych katalogów. Żadna partycja nie może nachodzić na nagłówek woluminu. Także, nie należy zmieniać typu nagłówka woluminu, ani tworzyć na nim systemu plików, ponieważ spowoduje to utratę tablicy partycji. Proszę używać tego typu etykiety dysku tylko podczas pracy z Linuksem na komputerach IRIX/SGI lub podczas pracy z dyskami IRIX/SGI pod Linuksem.
uk: Мітка диска IRIX/SGI може описувати 16 розділів, одинадцятим з яких має бути розділ усього «тому», а дев'ятий має бути позначено як «заголовок тому». Заголовок тому також покриває таблицю розділів, тобто він починається на нульовому блоці і, типово, займає п'ять циліндрів. Решту місця у заголовку тому може бути використано для записів каталогів заголовка. Жоден з розділів не може перекривати заголовок тому. Також не можна змінювати тип заголовка та створювати на ньому файлову систему, оскільки при цьому буде втрачено таблицю розділів. Користуйтеся цим типом міток, лише якщо ви працюєте з Linux на машинах IRIX/SGI або працюєте з дисками IRIX/SGI у Linux.

source: A B<sync>(2) and an ioctl(BLKRRPART) (rereading the partition table from disk) are performed before exiting when the partition table has been updated.
de: Die Aufrufe B<sync>(2) und B<ioctl(BLKRRPART)> werden nach der Aktualisierung der Partitionstabelle ausgeführt (wobei die Partitionstabelle auf der Platte neu eingelesen wird), bevor das Programm beendet wird.
pl: Gdy zaktualizowano tablicę partycji, to przed wyjściem wykonywane jest B<sync>(2) i ioctl(BLKRRPART) (ponowne odczytanie tablicy partycji z dysku).
uk: Якщо таблицю розділів було оновлено, перед виходом з програми буде виконано B<sync>(2) та ioctl(BLKRRPART) (повторне читання таблиці розділів з диска).

source: DOS MODE AND DOS 6.X WARNING
de: WARNUNG ZUM DOS-MODUS UND DOS 6.x
pl: OSTRZEŻENIE TRYBU DOS i DOS 6.x
uk: РЕЖИМ DOS І ПОПЕРЕДЖЕННЯ ЩОДО DOS 6.X

source: B<Note that all this is deprecated. You don\(cqt have to care about things like> B<geometry and cylinders on modern operating systems. If you really want> B<DOS-compatible partitioning then you have to enable DOS mode and cylinder> B<units by using the \(aq-c=dos -u=cylinders\(aq fdisk command-line options.>
de: B<Beachten Sie, dass all dies veraltet ist. Sie müssen sich eigentlich auf modernen Betriebssystemen nicht mit Dingen wie Geometrie und Zylindern befassen. Wenn Sie wirklich DOS-kompatible Partitionierung benötigen, dann müssen Sie den DOS-Modus und Zylinder-Einheiten mit den Befehlszeilenoptionen »-c=dos -u=cylinders« für fdisk aktivieren.>
pl: B<Cały ten rozdział jest nieaktualny. W żadnym ze współczesnych systemów> B<operacyjnych nie ma potrzeby martwić się takimi rzeczami jak geometria czy> B<cylindry. Jeśli naprawdę konieczne jest stosowanie partycjonowanie> B<kompatybilnego z DOS-em konieczne jest włączenie trybu DOS i cylindrów jako> B<jednostek za pomocą opcji wiersza poleceń "-c=dos -u=cylinders".>
uk: B<Зауважте, що усе описане нижче вважається застарілим. Вам не варто перейматися речима, подібними до> B<геометрії та циліндрів у сучасних операційних системах. Якщо вам дуже потрібний> B<поділ на розділи із сумісністю з DOS, вам слід увімкнути режим DOS і одиниці-циліндри> B<за допомогою параметрів командного рядка fdisk «-c=dos -u=cylinders».>

source: The DOS 6.x FORMAT command looks for some information in the first sector of the data area of the partition, and treats this information as more reliable than the information in the partition table. DOS FORMAT expects DOS FDISK to clear the first 512 bytes of the data area of a partition whenever a size change occurs. DOS FORMAT will look at this extra information even if the /U flag is given \(em we consider this a bug in DOS FORMAT and DOS FDISK.
de: Der FORMAT-Befehl von DOS 6.x sucht im ersten Sektor des Datenbereichs der Partition nach ein paar Informationen und behandelt diese Informationen als zuverlässiger als die Informationen in der Partitionstabelle. Der DOS-FORMAT-Befehl erwartet vom DOS-FDISK-Befehl, dass die ersten 512 Byte des Datenbereichs einer Partition bei jeder Größenänderung gelöscht werden. DOS FORMAT wird dieser zusätzlichen Informationen suchen, auch wenn der /U-Schalter gesetzt ist - die Programmautoren betrachten dies als einen Fehler in DOS FORMAT und DOS FDISK.
pl: Komenda FORMAT z DOS 6.x szuka informacji w pierwszym sektorze obszaru danych partycji i traktuje je jako godniejsze zaufania niż informacje z tablicy partycji. Dosowy FORMAT oczekuje od dosowego FDISK-a, że ten wyczyści pierwsze 512 bajtów obszarów danych przy każdej zmianie rozmiarów. Dosowy FORMAT zajrzy do tych dodatkowych danych nawet z flagą /U -- uważamy to za błąd tych programów.
uk: Команда FORMAT для DOS 6.x шукає певні дані у першому секторі області даних розділу і обробляє ці дані як надійніші за відомості з таблиці розділів. FORMAT для DOS очікує від FDISK для DOS очищення перших 512 байтів області даних розділу під час кожної зміни розмірів. FORMAT для DOS шукатиме ці додаткові відомості, навіть якщо вказано параметр /U \(em ми вважаємо це вадою у FORMAT для DOS та FDISK для DOS.

source: The bottom line is that if you use B<fdisk> or B<cfdisk>(8) to change the size of a DOS partition table entry, then you must also use B<dd>(1) to B<zero the first 512 bytes> of that partition before using DOS FORMAT to format the partition. For example, if you were using B<fdisk> to make a DOS partition table entry for I</dev/sda1>, then (after exiting B<fdisk> and rebooting Linux so that the partition table information is valid) you would use the command B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> to zero the first 512 bytes of the partition.
de: Die Quintessenz ist: Wenn Sie mit B<fdisk> oder B<cfdisk>(8) die Größe eines Eintrags in der DOS-Partitionstabelle ändern, dann müssen Sie auch mit B<dd> die ersten 512 Byte der Partition auf Null setzen, bevor Sie mit dem DOS-FORMAT-Befehl die Partition formatieren. Wenn Sie beispielsweise mit B<fdisk> auf einer DOS-Partitionstabelle einen Eintrag für I</dev/sda1> erstellt haben, dann würden Sie (nach dem Verlassen von B<fdisk> und dem Neustart von Linux, damit die Informationen in der Partitionstabelle gültig sind) mit dem Befehl B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> die ersten 512 Byte der Partition auf Null setzen.
pl: Tak więc używając programu B<cfdisk>(8) lub B<fdisk> do zmiany rozmiaru partycji dosowej, należy też użyć B<dd>(1) do B<wyzerowania pierwszych 512 bajtów> tej partycji przed użyciem dosowego FORMAT. Na przykład, po utworzeniu dosowej partycji I</dev/sda1> programem B<fdisk> (po wyjściu z B<fdisk> i przeładowaniu Linuksa, dzięki czemu informacje o tablicy partycji będą poprawne), powinno się wykonać polecenie B<dd if=/dev/zero of=/dev/hda1 bs=512 count=1>, które zeruje pierwszych 512 bajtów partycji.
uk: У підсумку, якщо ви користуєтеся B<fdisk> або B<cfdisk>(8) для зміни розмірів запису у таблиці розділів DOS, вам слід також скористатися B<dd>(1) для B<занулення перших 512 байтів> цього розділу до використання FORMAT для DOS для форматування розділу. Наприклад, якщо ви скористалися B<fdisk> для створення запису DOS у таблиці розділів для I</dev/sda1>, далі, (після виходу з B<fdisk> і перезавантаження Linux, щоб освіжити дані таблиці розділів) вам слід скористатися командою B<dd if=/dev/zero of=/dev/sda1 bs=512 count=1> для занулення перших 512 байтів розділу.

source: B<fdisk> usually obtains the disk geometry automatically. This is not necessarily the physical disk geometry (indeed, modern disks do not really have anything like a physical geometry, certainly not something that can be described in the simplistic Cylinders/Heads/Sectors form), but it is the disk geometry that MS-DOS uses for the partition table.
de: Wenn möglich, wird B<fdisk> die Festplattengeometrie automatisch ermitteln. Dies ist nicht unbedingt die physische Geometrie des Datenträgers. Tatsächlich haben moderne Festplatten nicht wirklich so etwas wie eine physische Geometrie; sicherlich kann sie nicht in der vereinfachenden CHS-Form beschrieben werden. Aber diese Geometrie wird halt für die MS-DOS-Partitionstabelle verwendet.
pl: B<fdisk> zwykle automatycznie uzyska informacje o geometrii dysku. Niekoniecznie musi to być fizyczna geometria dysku (co więcej, nowoczesne dyski w rzeczywistości nie mają czegoś takiego jak fizyczna geometria, a w każdym razie nie mają niczego, co mogłoby być opisane w prostej postaci cylindry/głowice/sektory), lecz geometria, której używa MS-DOS dla tablicy partycji.
uk: Зазвичай, B<fdisk> отримує дані щодо геометрії диска автоматично. Це не обов'язково фізична геометрія диска (насправді, у сучасних дисків насправді немає ніякої фізичної геометрії, точно немає того, що описано у спрощеній формі циліндри/голівки/сектори), але це геометрія диска, яку MS-DOS використовує для таблиці розділів.

source: Usually all goes well by default, and there are no problems if Linux is the only system on the disk. However, if the disk has to be shared with other operating systems, it is often a good idea to let an B<fdisk> from another operating system make at least one partition. When Linux boots it looks at the partition table, and tries to deduce what (fake) geometry is required for good cooperation with other systems.
de: In der Regel geht standardmäßig alles gut. Es gibt keine Probleme, wenn Linux das einzige System auf der Festplatte ist. Wenn allerdings der Datenträger mit anderen Betriebssystemen gemeinsam genutzt wird, ist es oft ratsam, ein B<fdisk> eines anderen Betriebssystems mindestens eine Partition anlegen zu lassen. Beim Start liest Linux die Partitionstabelle aus und versucht abzuleiten, welche (fingierte) Geometrie für eine gute Zusammenarbeit mit anderen Systemen erforderlich ist.
pl: Zazwyczaj wszystko idzie dobrze i nie ma żadnych problemów, jeżeli Linux jest jedynym systemem na dysku. Jednakże, jeśli dysk będzie dzielony z innymi systemami operacyjnymi, to dobrym pomysłem jest utworzenie co najmniej jednej partycji B<fdisk>iem pochodzącym z innego systemu operacyjnego. Linux, podczas uruchamiania, przegląda tablicę partycji i stara się wywnioskować, jaka (fałszywa) geometria dysku jest wymagana, żeby mógł dobrze współpracować z innymi systemami.
uk: Зазвичай, усе має бути типово добре, і не повинно бути проблем, якщо Linux є єдиною системою на диску. Втім, якщо диск спільно використовується іншими операційними системами, часто варто надати змогу B<fdisk> з іншої операційної системи створити принаймні один розділ. При завантаженні Linux система аналізує таблицю розділів і намагається визначити, яка (фіктивна) геометрія потрібна для належної сумісності з іншими операційними системами.

source: Whenever a partition table is printed out in DOS mode, a consistency check is performed on the partition table entries. This check verifies that the physical and logical start and end points are identical, and that each partition starts and ends on a cylinder boundary (except for the first partition).
de: Jedesmal, wenn im DOS-Modus eine Partitionstabelle ausgegeben wird, werden die Einträge in der Partitionstabelle auf Konsistenz geprüft. Es wird geprüft, ob die physikalischen und logischen Start- und Endpunkte übereinstimmen und ob jede Partition (mit Ausnahme der ersten) an einer Zylindergrenze startet und endet.
pl: Gdy wypisywana jest tablica partycji, w trybie DOS dokonywane jest sprawdzenie spójności wpisów tablicy. Sprawdzane jest, czy fizyczne i logiczne punkty startowe i końcowe są takie same, oraz czy partycja rozpoczyna się i kończy w granicach cylindrów (poza pierwszą partycją).
uk: Кожного разу, коли виводиться таблиця розділів у режимі DOS, буде виконано перевірку записів таблиці розділів. Під час перевірки буде встановлено, чи є ідентичними фізичні і логічні початкова і кінцева точки, і чи кожен розділ починається і завершується на межі циліндра (окрім першого розділу).

source: Some versions of MS-DOS create a first partition which does not begin on a cylinder boundary, but on sector 2 of the first cylinder. Partitions beginning in cylinder 1 cannot begin on a cylinder boundary, but this is unlikely to cause difficulty unless you have OS/2 on your machine.
de: Einige Versionen von MS-DOS erstellen eine erste Partition, die nicht auf einer Zylindergrenze beginnt, sondern auf Sektor 2 des ersten Zylinders. Partitionen, die auf Zylinder 1 anfangen, können nicht auf einer Zylindergrenze beginnen. Wenn Sie nicht auch OS/2 auf Ihrer Maschine installiert haben, werden Sie wahrscheinlich trotzdem keine Schwierigkeiten bekommen.
pl: Niektóre wersje MS-DOS tworzą pierwszą partycję, która nie rozpoczyna się na granicy cylindra, lecz na 2 sektorze pierwszego cylindra. Partycje rozpoczynające się na cylindrze 1 nie mogą rozpoczynać się na granicy cylindra, lecz raczej nie powinno to sprawiać problemów, chyba że używany jest OS/2.
uk: Деякі версії MS-DOS створюють перший розділ, який починається не на початку межі циліндра, а на секторі 2 першого циліндра. Розділи, що починаються на циліндрі 1, не можуть починатися на межі циліндра, але це навряд чи спричинить труднощі, якщо на вашому комп'ютері немає OS/2.

source: For best results, you should always use an OS-specific partition table program. For example, you should make DOS partitions with the DOS FDISK program and Linux partitions with the Linux B<fdisk> or Linux B<cfdisk>(8) programs.
de: Um die besten Ergebnisse zur erzielen, sollten Sie ein betriebssystemspezifisches Partitionierungsprogramm einsetzen. Beispielsweise sollten Sie DOS-Partitionen mit dem DOS-FDISK erzeugen und Linux-Partitionen mit den Linux-Programmen B<fdisk> oder B<cfdisk>(8).
pl: Dla najlepszych wyników, zawsze powinno się używać fdiska specyficznego dla danego systemowi operacyjnemu. Na przykład, partycje dosowe powinno się tworzyć dosowym FDISK-iem, a linuksowe \(em linuksowym B<fdisk>iem lub B<cfdisk>(8)iem.
uk: Для покращення результатів вам слід завжди користуватися специфічною для операційної системи програмою для роботи з таблицею розділів. Наприклад, вам слід створювати розділи DOS за допомогою програми FDISK для DOS, а розділи Linux за допомогою програм B<fdisk> та Linux B<cfdisk>(8) для Linux.

source: COLORS
de: FARBEN
pl: KOLORY
uk: КОЛЬОРИ

source: The output colorization is implemented by B<terminal-colors.d>(5) functionality. Implicit coloring can be disabled by an empty file
de: Die farbige Darstellung der Ausgabe wird über die Funktionen in B<terminal-colors.d>(5) gesteuert. Die implizierte Einfärbung kann deaktiviert werden, indem Sie folgende (leere) Datei anlegen:
uk: Розфарбовування виведених даних реалізовано у можливості B<terminal-colors.d>(5). Неявне розфарбовування може бути вимкнено спорожненням файла

source: for the B<fdisk> command or for all tools by
de: Dies gilt für den Befehl B<fdisk>. Die farbige Darstellung bei allen Werkzeugen erreichen Sie mit
uk: для команди B<fdisk> або для усіх інструментів

source: The user-specific I<$XDG_CONFIG_HOME/terminal-colors.d> or I<$HOME/.config/terminal-colors.d> overrides the global setting.
de: Die benutzerspezifischen I<$XDG_CONFIG_HOME/terminal-colors.d> oder I<$HOME/.config/terminal-colors.d> setzen die globale Einstellung außer Kraft.
uk: Специфічні для користувача I<$XDG_CONFIG_HOME/terminal-colors.d> та I<$HOME/.config/terminal-colors.d> мають пріоритет над загальними параметрами.

source: Note that the output colorization may be enabled by default, and in this case I<terminal-colors.d> directories do not have to exist yet.
de: Beachten Sie, dass die Einfärbung der Ausgabe standardmäßig aktiviert sein könnte und in diesem Fall die I<terminal-colors.d>-Verzeichnisse noch nicht zwangsläufig vorhanden sein müssen.
uk: Зауважте, що можна типово увімкнути розфарбовування виведених даних і у цьому випадку каталоги I<terminal-colors.d> не повинні існувати.

source: The logical color names supported by B<fdisk> are:
de: Folgende logische Farbnamen werden von B<fdisk> unterstützt:
uk: Логічними назвами кольорів, підтримку яких передбачено у B<fdisk>, є такі:

source: The header of the output tables.
de: Die Kopfzeilen der ausgegebenen Tabellen.
pl: Nagłówek wyjściowych tablic/tabel.
uk: Заголовок виведених таблиць.

source: The help section titles.
de: Die Titel des Hilfebereichs.
pl: Tytuły sekcji pomocy.
uk: Заголовки розділів довідки.

source: The warning messages.
de: Die Warnmeldungen.
pl: Ostrzeżenia.
uk: Повідомлення попереджень.

source: The welcome message.
de: Die Begrüßungsnachricht.
pl: Powitania.
uk: Повідомлення вітання.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
pl: ŚRODOWISKO
uk: СЕРЕДОВИЩЕ

source: enables fdisk debug output.
de: aktiviert die Debug-Ausgabe für B<fdisk>.
pl: włącza wyjście debugowania fdisk.
uk: вмикає діагностичне виведення fdisk.

source: enables libfdisk debug output.
de: aktiviert die Debug-Ausgabe für libfdisk.
pl: włącza wyjście debugowania libfdisk.
uk: вмикає показ діагностичних повідомлень libfdisk.

source: enables libblkid debug output.
de: aktiviert die Debug-Ausgabe für libblkid.
pl: włącza wyjście debugowania libblkid.
uk: вмикає показ діагностичних повідомлень libblkid.

source: enables libsmartcols debug output.
de: aktiviert die Debug-Ausgabe für libsmartcols.
pl: włącza wyjście debugowania libsmartcols.
uk: вмикає показ діагностичних повідомлень libsmartcols.

source: use visible padding characters.
de: verwendet sichtbare Auffüllzeichen.
pl: używa widocznych znaków wypełniających.
uk: використати символи візуального доповнення.

source: B<LOCK_BLOCK_DEVICE>=E<lt>modeE<gt>
de: B<LOCK_BLOCK_DEVICE>=E<lt>ModusE<gt>
pl: B<LOCK_BLOCK_DEVICE>=E<lt>trybE<gt>
uk: B<LOCK_BLOCK_DEVICE>=E<lt>режимE<gt>

source: use exclusive BSD lock. The mode is "1" or "0". See B<--lock> for more details.
de: verwendet eine exklusive BSD-Sperre. Der Modus ist »1« oder »0«. Siehe B<--lock> für weitere Details.
pl: używa blokowania na wyłączność BSD. Tryb to "1" lub "0". Więcej informacji w opisie opcji B<--lock>.
uk: використати виключне блокування BSD. Режимом може бути «1» або «0». Див. B<--lock>, щоб дізнатися більше.

source: AUTHORS
de: AUTOREN
pl: AUTORZY
uk: АВТОРИ

source: The original version was written by Andries E. Brouwer, A. V. Le Blanc and others.
de: Die Originalversion wurde von Andries E. Brouwer, A. V. Le Blanc und anderen geschrieben.
pl: Oryginalną wersję napisali Andries E. Brouwer, A. V. Le Blanc i inni.
uk: Початкову версію було написано Andries E. Brouwer, A. V. Le Blanc та іншими авторами.

source: SEE ALSO
de: SIEHE AUCH
pl: ZOBACZ TAKŻE
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
pl: ZGŁASZANIE BŁĘDÓW
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
pl: Raporty o błędach proszę zgłaszać pod adresem
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
pl: DOSTĘPNOŚĆ
uk: ДОСТУПНІСТЬ

source: The B<fdisk> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<fdisk> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
pl: Polecenie B<fdisk> jest częścią pakietu util-linux i można je pobrać ze strony
uk: B<fdisk> є частиною пакунка util-linux, який можна отримати з

source: February 2016
de: Februar 2016
pl: luty 2016
uk: Лютий 2016 року

source: B<fdisk -l> [I<device>...]
de: B<fdisk -l> [I<Gerät> …]
pl: B<fdisk -l> [I<urządzenie>...]
uk: B<fdisk -l> [I<пристрій>...]

source: B<fdisk> is a dialog-driven program for creation and manipulation of partition tables. It understands GPT, MBR, Sun, SGI and BSD partition tables.
de: B<fdisk> ist ein menügesteuertes Programm für die Erzeugung und Manipulation von Partitionstabellen. Es kann DOS-Partitionstabellen in den Formaten GPT, MBR, Sun, SGI und BSD verarbeiten.
pl: B<fdisk> to obsługiwany z pomocą okien dialogowych program do tworzenia i zmieniania tablicy partycji dysku twardego. Obsługuje tablice partycji typu GPT, MBR, Sun, SGI i BSD.
uk: B<fdisk> програма для створення і роботи з таблицями розділів, якою керують за допомогою діалогів. У ній передбачено підтримку таблиць розділів GPT, MBR, Sun, SGI і BSD.

source: Block devices can be divided into one or more logical disks called I<partitions>. This division is recorded in the I<partition table>, usually found in sector 0 of the disk. (In the BSD world one talks about `disk slices' and a `disklabel'.)
de: Blockorientierte Geräte können in eine oder mehrere logische Platten (I<Partitionen>) unterteilt werden. Diese Unterteilung wird in der I<Partitionstabelle> notiert, die sich auf dem Sektor 0 der Platte befindet. (In der BSD-Welt spricht man von »disk slices« und einem »disklabel«.)
pl: Urządzenia blokowe mogą być podzielone na jeden lub więcej logicznych dysków zwanych I<partycjami>. Podział ten jest zapisany w I<tablicy partycji> znajdującej się zwykle w sektorze 0 dysku (w świecie BSD mówi się o tzw. plastrach dyskowych "disk slice" i etykietach dysku "disklabel").
uk: Блокові пристрої можна поділити на один або декілька логічних дисків, які називаються I<розділами>. Цей поділ записують до I<таблиці розділів>, яка, зазвичай, починається у секторі 0 диска. (У світі BSD це називається «зрізи диска» або «мітка диска»'.)
