Repository: sebras/manpages-l10n
Catalog: po/*/man8/filefrag.8.po
Languages: pl

source: December 2021
pl: grudzień 2021

source: E2fsprogs version 1.46.5
pl: E2fsprogs wersja 1.46.5

source: NAME
pl: NAZWA

source: filefrag - report on file fragmentation
pl: filefrag - informuje o fragmentacji pliku

source: SYNOPSIS
pl: SKŁADNIA

source: B<filefrag> [ B<-b>I<blocksize> ] [ B<-BeEkPsvVxX> ] [ I<files...> ]
pl: B<filefrag> [ B<-b> I<rozmiar-bloku> ] [ B<-BeEkPsvVxX> ] [ I<pliki...> ]

source: DESCRIPTION
pl: OPIS

source: B<filefrag> reports on how badly fragmented a particular file might be. It makes allowances for indirect blocks for ext2 and ext3 file systems, but can be used on files for any file system.
pl: Program B<filefrag> informuje o poziomie fragmentacji danego pliku. Bierze poprawkę na bloki pośrednie w systemach plików ext2 i ext3, lecz można go stosować w każdym systemie plików.

source: The B<filefrag> program initially attempts to get the extent information using FIEMAP ioctl which is more efficient and faster. If FIEMAP is not supported then filefrag will fall back to using FIBMAP.
pl: Program B<filefrag> najpierw stara się pozyskać informację o ekstencie za pomocą ioctl FIEMAP, które jest znacznie wydajniejsze i szybsze. Jeśli FIEMAP jest niedostępne, korzysta z FIBMAP.

source: OPTIONS
pl: OPCJE

source: Force the use of the older FIBMAP ioctl instead of the FIEMAP ioctl for testing purposes.
pl: Wymusza użycie starszego ioctl FIBMAP zamiast ioctl FIEMAP w celach testowych.

source: B<-b>I<blocksize>
pl: B<-b>I<rozmiar-bloku>

source: Use I<blocksize> in bytes, or with [KMG] suffix, up to 1GB for output instead of the file system blocksize. For compatibility with earlier versions of B<filefrag>, if I<blocksize> is unspecified it defaults to 1024 bytes. Since I<blocksize> is an optional argument, it must be added without any space after B<-b>.
pl: Używa I<rozmiaru-bloku> w bajtach lub z przyrostkiem [KMG], do 1GB, do wypisywania wyniku zamiast rozmiaru bloków systemu plików. Z powodu zgodności ze starszymi wersjami B<filefrag>, jeśli nie poda się wartości I<rozmiar-bloku> ustawiana jest wartość domyślna 1024 bajtów. Argument I<rozmiar-bloku> jest opcjonalny, dlatego konieczne jest podanie go bez spacji po B<-b>.

source: Print output in extent format, even for block-mapped files.
pl: Wypisuje wynik w formacie ekstentów, nawet w przypadku plików przydzielonych do bloków.

source: Display the contents of ext4's extent status cache. This feature is not supported on all kernels, and is only supported on ext4 file systems.
pl: Wyświetla zawartość pamięci podręcznej statusów ekstentów ext4. Funkcja ta nie jest obsługiwana przez wszystkie jądra i działa tylko w systemie plików ext4.

source: Use 1024-byte blocksize for output (identical to '-b1024').
pl: Używa 1024-bajtowego rozmiaru bloku do wypisywania wyniku (identyczne do "-b1024").

source: Pre-load the ext4 extent status cache for the file. This is not supported on all kernels, and is only supported on ext4 file systems.
pl: Ładuje wstępnie pamięć podręczną statusów ekstentów ext4 dla pliku. Funkcja ta nie jest obsługiwana przez wszystkie jądra i działa tylko w systemie plików ext4.

source: Sync the file before requesting the mapping.
pl: Wykonuje synchronizację pliku przed żądaniem mapowania.

source: Be verbose when checking for file fragmentation.
pl: Wypisuje więcej informacji przy sprawdzaniu fragmentacji pliku.

source: Print version number of program and library. If given twice, also print the FIEMAP flags that are understood by the current version.
pl: Wypisuje wersję programu i biblioteki. Podany podwójnie, wyświetla również flagi FIEMAP, rozumiane przez bieżącą wersję.

source: Display mapping of extended attributes.
pl: Wyświetla mapowanie atrybutów rozszerzonych.

source: Display extent block numbers in hexadecimal format.
pl: Wyświetla numer bloków ekstentów w formacie szesnastkowym.

source: AUTHOR
pl: AUTOR

source: B<filefrag> was written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
pl: B<filefrag> zostało napisane przez Theodore'a Ts'o E<lt>tytso@mit.eduE<gt>.

source: September 2022
pl: wrzesień 2022

source: E2fsprogs version 1.46.6-rc1
pl: E2fsprogs wersja 1.46.6-rc1

source: August 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4
