Repository: sebras/manpages-l10n
Catalog: po/*/man8/findmnt.8.po
Languages: de, uk

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: findmnt - find a filesystem
de: findmnt - Ein Dateisystem finden
uk: findmnt — пошук файлової системи

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<findmnt> [options]
de: B<findmnt> [Optionen]
uk: B<findmnt> [параметри]

source: B<findmnt> [options] I<device>|I<mountpoint>
de: B<findmnt> [Optionen] I<Gerät>|I<Einhängepunkt>
uk: B<findmnt> [параметри] I<пристрій>|I<точка_монтування>

source: B<findmnt> [options] [B<--source>] I<device> [B<--target> I<path>|B<--mountpoint> I<mountpoint>]
de: B<findmnt> [Optionen] [B<--source>] I<Gerät> [B<--target> I<Pfad>|B<--mountpoint>] I<Einhängepunkt>
uk: B<findmnt> [параметри] [B<--source>] I<пристрій> [B<--target> I<шлях>|B<--mountpoint> I<точка монтування>]

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: B<findmnt> will list all mounted filesystems or search for a filesystem. The B<findmnt> command is able to search in I</etc/fstab>, I</etc/mtab> or I</proc/self/mountinfo>. If I<device> or I<mountpoint> is not given, all filesystems are shown.
de: B<findmnt> listet alle eingehängten Dateisysteme auf oder sucht nach einem Dateisystem. Der Befehl B<findmnt> kann in I</etc/fstab>, I</etc/mtab> oder I</proc/self/mountinfo> suchen. Falls kein I<Gerät> oder I<Einhängepunkt> angegeben wird, werden alle Dateisysteme angezeigt.
uk: B<findmnt> виводить список усіх змонтованих файлових систем або шукає файлову систему. Команда B<findmnt> може шукати в I</etc/fstab>, I</etc/mtab> або I</proc/self/mountinfo>. Якщо не вказано I<пристрій> або I<точку-монтування>, буде показано усі файлові системи.

source: The device may be specified by device name, major:minor numbers, filesystem label or UUID, or partition label or UUID. Note that B<findmnt> follows B<mount>(8) behavior where a device name may be interpreted as a mountpoint (and vice versa) if the B<--target>, B<--mountpoint> or B<--source> options are not specified.
de: Das Gerät kann anhand des Gerätenamens, der Major:Minor-Nummern, der Dateisystembezeichnung oder -UUID oder der Partitionsbezeichnung oder -UUID angegeben werden. Beachten Sie, dass B<findmnt> dem Verhalten von B<mount>(8) folgt, bei dem ein Gerätename als Einhängepunkt interpretiert werden kann (und umgekehrt ein Einhängepunkt als Gerätename), wenn die Optionen B<--target>, B<--mountpoint> oder B<--source> nicht angegeben sind.
uk: Пристрій можна задати за назвою, числами основний:другорядний, міткою або UUID файлової системи чи міткою або UUID розділу. Зауважте, що у B<findmnt> використано правила поведінки B<mount>(8), за якими назву пристрою може бути оброблено як точку монтування (і навпаки), якщо не вказано параметр B<--target>, B<--mountpoint> або B<--source>.

source: The command-line option B<--target> accepts any file or directory and then B<findmnt> displays the filesystem for the given path.
de: Die Befehlszeilenoption B<--target> akzeptiert jede Datei oder jedes Verzeichnis und B<findmnt> zeigt das Dateisystem für den angegebenen Pfad an.
uk: Параметр командного рядка B<--target> приймає будь-який файл або каталог, а потім B<findmnt> показує файлову систему для заданого шляху.

source: The command prints all mounted filesystems in the tree-like format by default.
de: Standardmäßig gibt der Befehl alle eingehängten Dateisysteme in einer Baumansicht aus.
uk: Команда типово виводить усі змонтовані файлові системи в ієрархічному форматі.

source: The relationship between block devices and filesystems is not always one-to-one. The filesystem may use more block devices. This is why B<findmnt> provides SOURCE and SOURCES (pl.) columns. The column SOURCES displays all devices where it is possible to find the same filesystem UUID (or another tag specified in I<fstab> when executed with B<--fstab> and B<--evaluate>).
de: Die Beziehung zwischen blockorientierten Geräten und Dateisystemen ist nicht immer 1:1. Das Dateisystem kann mehrere blockorientierte Geräte verwenden. Deshalb stellt B<findmnt> die Spalten SOURCE und SOURCES (Plural) bereit. Die Spalte SOURCES zeigt alle Geräte mit der gleichen Dateisystem-UUID (oder bei der Ausführung mit B<--fstab> und B<--evaluate> mit einer anderweitigen in der I<fstab>-Datei definierten Markierung) an.
uk: Взаємозв'язок між блоковими пристроями та файловими системами не завжди є однозначним. Файлові системи можуть використовувати одразу декілька блокових пристроїв. Ось чому у B<findmnt> передбачено стовпчики SOURCE and SOURCES (pl.). У стовпчику SOURCE буде показано усі пристрої, де можна знайти той самий UUID файлової системи (або іншу мітку, яку вказано у I<fstab> при виконанні з параметрами B<--fstab> і B<--evaluate>).

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: Disable all built-in filters and print all filesystems.
de: deaktiviert alle eingebauten Filter und gibt alle Dateisysteme aus.
uk: Вимкнути усі вбудовані фільтри і вивести дані щодо усіх файлових систем.

source: Use ascii characters for tree formatting.
de: verwendet ASCII-Zeichen für die Formatierung der Baumansicht.
uk: Використати символи ASCII для форматування ієрархії.

source: Print the sizes in bytes rather than in a human-readable format.
de: gibt die Größen in Byte anstelle eines menschenlesbaren Formats aus.
uk: Вивести розмір у байтах, а не у зручному для читання форматі.

source: By default, the unit, sizes are expressed in, is byte, and unit prefixes are in power of 2^10 (1024). Abbreviations of symbols are exhibited truncated in order to reach a better readability, by exhibiting alone the first letter of them; examples: "1 KiB" and "1 MiB" are respectively exhibited as "1 K" and "1 M", then omitting on purpose the mention "iB", which is part of these abbreviations.
de: Standardmäßig werden die Größen in Byte ausgedrückt und die Präfixe sind Potenzen der Form 2^10 (1024). Die Abkürzungen der Symbole werden zur besseren Lesbarkeit abgeschnitten, indem jeweils nur der erste Buchstabe dargestellt wird. Beispiele: »1 KiB« und »1 MiB« werden als »1 K« bzw. »1 M« dargestellt. Die Erwähnung des »iB«-Anteils, der Teil der Abkürzung ist, entfällt absichtlich.
uk: Типово, одиницею, у якій показано розміри, є байт, а префікси одиниць є степенями 2^10 (1024). Для забезпечення зручності читання відбувається скорочення позначень до першої літери запису; приклади: «1 КіБ» та «1 МіБ» буде показано як «1 K» та «1 M», із вилученням «іБ», яке є частиною цих скорочень.

source: Do not canonicalize paths at all. This option affects the comparing of paths and the evaluation of tags (LABEL, UUID, etc.).
de: kanonisiert die Pfade nicht. Diese Option beeinflusst den Vergleich von Pfaden und die Auswertung von Markierungen (LABEL, UUID, usw.).
uk: Не перетворювати шляхи до канонічної форми взагалі. Цей параметр стосується порівняння шляхів і визначення міток (LABEL, UUID тощо).

source: Canonicalize all printed paths.
de: kanonisiert alle ausgegebenen Pfade.
uk: Виконувати перетворення до канонічної форми для усіх виведених шляхів.

source: Print filesystems where target (mountpoint) is marked as deleted by kernel.
de: gibt Dateisysteme aus, deren Ziel (Einhängepunkt) vom Kernel als gelöscht markiert wurde.
uk: Вивести файлові системи, де ціль (точка монтування) позначено ядром як вилучену.

source: Imitate the output of B<df>(1). This option is equivalent to B<-o SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET> but excludes all pseudo filesystems. Use B<--all> to print all filesystems.
de: imitiert die Ausgabe von B<df>(1). Diese Option ist gleichbedeutend mit B<-o SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET>, schließt aber alle Pseudo-Dateisysteme aus. Verwenden Sie B<--all>, um alle Dateisysteme anzuzeigen.
uk: Імітувати виведення B<df>(1). Цей параметр є еквівалентним до B<-o SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET>, але його використання призводить до виключення усіх фіктивних файлових систем. Скористайтеся параметром B<--all> для виведення даних усіх файлових систем.

source: B<-d>, B<--direction> I<word>
de: B<-d>, B<--direction> I<Wort>
uk: B<-d>, B<--direction> I<слово>

source: The search direction, either B<forward> or B<backward>.
de: gibt die Suchrichtung an, entweder B<forward> (vorwärts) oder B<backward> (rückwärts).
uk: Напрямок пошуку, B<forward> (вперед) або B<backward> (назад).

source: Convert all tags (LABEL, UUID, PARTUUID, or PARTLABEL) to the corresponding device names for the SOURCE column. It\(cqs an unusual situation, but the same tag may be duplicated (used for more devices). For this purpose, there is SOURCES (pl.) column. This column displays by multi-line cell all devices where the tag is detected by libblkid. This option makes sense for I<fstab> only.
de: wandelt alle Markierungen (LABEL, UUID, PARTUUID oder PARTLABEL) in die korrespondierenden Gerätenamen für die SOURCE-Spalte um. Das ist zwar ein unüblicher Fall, aber damit kann eine Markierung dupliziert werden (um sie für weitere Geräte zu verwenden). Diesem Zweck dient die Spalte SOURCEB<S>. Diese Spalte zeigt in mehrzeiligen Zellen alle Geräte an, deren Markierung von Libblkid erkannt wurde. Diese Option ist nur für I<fstab> sinnvoll.
uk: Перетворити усі мітки (LABEL, UUID, PARTUUID або PARTLABEL) на відповідні назви пристрої для стовпчика SOURCE. Це незвична ситуація, але можуть бути дублікати міток (використання міток для декількох пристроїв). Для цього призначено стовпчик SOURCES (pl.). У цьому стовпчику буде показано багаторядкову комірку усіх пристроїв, де було виявлено мітку за допомогою libblkid. Цей параметр має сенс лише для I<fstab>.

source: B<-F>, B<--tab-file> I<path>
de: B<-F>, B<--tab-file> I<Pfad>
uk: B<-F>, B<--tab-file> I<шлях>

source: Search in an alternative file. If used with B<--fstab>, B<--mtab> or B<--kernel>, then it overrides the default paths. If specified more than once, then tree-like output is disabled (see the B<--list> option).
de: sucht in einer alternativen Datei. Wenn diese Option mit B<--fstab>, B<--mtab> oder B<--kernel> verwendet wird, werden die Standardpfade außer Kraft gesetzt. Wenn dies mehrmals angegeben wird, ist die Baumansicht deaktiviert (siehe die Option B<--list>).
uk: Шукати в альтернативному файлі. Якщо використано з B<--fstab>, B<--mtab> або B<--kernel>, перевизначає типові шляхи. Якщо вказано декілька разів, деревоподібне виведення буде вимкнено (див. параметр B<--list>).

source: Print the first matching filesystem only.
de: gibt nur das erste passende Dateisystem aus.
uk: Вивести лише першу відповідну файлову систему.

source: Invert the sense of matching.
de: kehrt die Suchlogik um.
uk: Інвертувати критерії відповідності.

source: Use JSON output format.
de: verwendet das JSON-Ausgabeformat.
uk: Bикористати формат виведення JSON.

source: Search in I</proc/self/mountinfo>. The output is in the tree-like format. This is the default. The output contains only mount options maintained by kernel (see also B<--mtab>).
de: sucht in I</proc/self/mountinfo>. Die Ausgabe erfolgt in einer Baumansicht. Dies ist die Vorgabe. Die Ausgabe enthält nur Einhängeoptionen, die vom Kernel verwaltet werden (siehe auch B<--mtab>).
uk: Шукати у I</proc/self/mountinfo>. Дані буде виведено у деревоподібному форматі. Це типовий формат. У виведених даних міститимуться лише параметри монтування, підтримку яких передбачено у ядрі (див. також B<--mtab>).

source: Use the list output format. This output format is automatically enabled if the output is restricted by the B<-t>, B<-O>, B<-S> or B<-T> option and the option B<--submounts> is not used or if more that one source file (the option B<-F>) is specified.
de: formatiert die Ausgabe als Liste. Dieses Ausgabeformat ist automatisch aktiviert, wenn die Ausgabe durch die Optionen B<-t>, B<-O>, B<-S> oder B<-T> eingeschränkt ist und die Option B<--submounts> nicht verwendet wird oder mehr als eine Quelldatei (mit der Option B<-F>) angegeben wird.
uk: Використати формат виведення списком. Цей формат виведення буде автоматично увімкнено, якщо виведення обмежено параметром B<-t>, B<-O>, B<-S> або B<-T>, і не використано параметр B<--submounts>, або якщо вказано декілька початкових файлів (параметр B<-F>).

source: B<-M>, B<--mountpoint> I<path>
de: B<-M>, B<--mountpoint> I<Pfad>
uk: B<-M>, B<--mountpoint> I<шлях>

source: Explicitly define the mountpoint file or directory. See also B<--target>.
de: definiert explizit die Einhängepunkt-Datei oder das Einhängepunkt-Verzeichnis. Siehe auch B<--target>.
uk: Явним чином визначити файл або каталог точки монтування. Див. також B<--target>.

source: Search in I</etc/mtab>. The output is in the list format by default (see B<--tree>). The output may include user space mount options.
de: sucht in I</etc/mtab>. Die Ausgabe wird standardmäßig als Liste formatiert (siehe B<--tree>). Die Ausgabe kann weitere Einhängeoptionen auf Anwendungsebene enthalten.
uk: Шукати в I</etc/mtab>. Типово, буде виведено дані у форматі списку (див. B<--tree>). Виведені дані можуть включати параметри монтування простору користувача.

source: B<-N>, B<--task> I<tid>
de: B<-N>, B<--task> I<Threadkennung>

source: Use alternative namespace I</proc/E<lt>tidE<gt>/mountinfo> rather than the default I</proc/self/mountinfo>. If the option is specified more than once, then tree-like output is disabled (see the B<--list> option). See also the B<unshare>(1) command.
de: verwendet anstelle des vorgegebenen I</proc/self/mountinfo> den alternativen Namensraum I</proc/E<lt>ThreadkennungE<gt>/mountinfo>. Wenn diese Option mehr als einmal angegeben wird, dann wird die Baumansicht deaktiviert (siehe die Option B<--list>). Siehe auch den Befehl B<unshare>(1).
uk: Використовувати альтернативний простір назв I</proc/E<lt>tidE<gt>/mountinfo>, а не типовий I</proc/self/mountinfo>. Якщо параметр вказано декілька разів, деревоподібний формат виведення буде вимкнено (див. параметр B<--list>). Див. також команду B<unshare>(1).

source: Do not print a header line.
de: unterdrückt die Ausgabe einer Kopfzeile.
uk: Не виводити рядок заголовка.

source: B<-O>, B<--options> I<list>
de: B<-O>, B<--options> I<Liste>
uk: B<-O>, B<--options> I<список>

source: Limit the set of printed filesystems. More than one option may be specified in a comma-separated list. The B<-t> and B<-O> options are cumulative in effect. It is different from B<-t> in that each option is matched exactly; a leading I<no> at the beginning does not have global meaning. The "no" can used for individual items in the list. The "no" prefix interpretation can be disabled by "+" prefix.
de: begrenzt die Gruppe der ausgegebenen Dateisysteme. Mehrere Optionen können in einer durch Kommata getrennten Liste angegeben werden. Die Optionen B<-t> und B<-O> wirken kumulativ. Im Gegensatz zu B<-t> wird jede Option für sich ausgewertet; ein vorangestelltes I<no> wirkt sich nicht global aus. Das I<no> kann für individuelle Listeneinträge verwendet werden; dessen Interpretation kann mit dem Präfix »+« deaktiviert werden.
uk: Обмежити набір виведених файлових систем. Можна вказувати декілька параметрів у форматі списку значень, які відокремлено комами. Параметри B<-t> і B<-O> є накопичувальними за наслідками. Цим вони відрізняються від параметра B<-t> тим, що відповідність встановлюється точно; початкове I<no> не має загального значення. «no» може використовуватися для окремих пунктів у списку. Інтерпретацію префікса «no» можна вимкнути префіксом «+».

source: B<-o>, B<--output> I<list>
de: B<-o>, B<--output> I<Liste>
uk: B<-o>, B<--output> I<список>

source: Define output columns. See the B<--help> output to get a list of the currently supported columns. The B<TARGET> column contains tree formatting if the B<--list> or B<--raw> options are not specified.
de: legt die Ausgabespalten fest. In der Ausgabe von B<--help> wird eine Liste der verfügbaren Spalten angezeigt. Die Spalte B<TARGET> wird als Baum formatiert, falls die Optionen B<--list> oder B<--raw> nicht angegeben werden.
uk: Визначити стовпчики виведення. Див. виведення B<--help>, щоб отримати список поточний підтримуваних стовпчиків. Стовпчик B<TARGET> міститиме ієрархічні дані, якщо не вказано параметр B<--list> або B<--raw>.

source: The default list of columns may be extended if I<list> is specified in the format I<+list> (e.g., B<findmnt -o +PROPAGATION>).
de: Die Standardliste der Spalten kann erweitert werden, wenn die I<Liste> im Format I<+Liste> (z.B. B<findmnt -o +PROPAGATION>) vorliegt.
uk: Типовий список стовпчиків може бути розширено, якщо I<список> вказано у форматі I<+список> (наприклад, B<findmnt -o +PROPAGATION>).

source: Output almost all available columns. The columns that require B<--poll> are not included.
de: gibt fast alle verfügbaren Spalten aus. Die Spalten, welche B<--poll> erfordern, werden nicht angezeigt.
uk: Вивести майже усі доступні стовпчики. Стовпчики, які потребують B<--poll>, не буде включено.

source: Produce output in the form of key="value" pairs. All potentially unsafe value characters are hex-escaped (\(rsxE<lt>codeE<gt>). See also option B<--shell>.
de: gibt die Daten in Form von Schlüssel="Wert"-Paaren aus. Alle potenziell unsicheren Zeichen werden hexadezimal maskiert (\(rsxE<lt>codeE<gt>). Siehe auch die Option B<--shell>.
uk: Вивести дані у формі пар ключ="значення". Усі потенційно небезпечні символи значень буде екрановано (\(rsxE<lt>кодE<gt>). Див. також параметр B<--shell>.

source: B<-p>, B<--poll>[I<=list>]
de: B<-p>, B<--poll>[I<=Liste>]
uk: B<-p>, B<--poll>[I<=список>]

source: Monitor changes in the I</proc/self/mountinfo> file. Supported actions are: mount, umount, remount and move. More than one action may be specified in a comma-separated list. All actions are monitored by default.
de: überwacht Änderungen in der Datei I</proc/self/mountinfo>. Dabei werden die Aktionen »mount«, »umount«, »remount« und »move« unterstützt. Mehrere Aktionen können in Form einer durch Kommata getrennten Liste angegeben werden. Standardmäßig werden alle Aktionen überwacht.
uk: Стежити за змінами у файлі I</proc/self/mountinfo>. Підтримуваними діями є монтування (mount), демонтування (umount), повторне монтування (remount) та пересування (move). Можна вказати декілька дій у форматі списку значень, які відокремлено комами. Типово, стеження ведеться за усіма діями.

source: The time for which B<--poll> will block can be restricted with the B<--timeout> or B<--first-only> options.
de: Die mit B<--poll> angegebene Sperrzeit kann mit den Optionen B<--timeout> oder B<--first-only> eingeschränkt werden.
uk: Час, на який блокує B<--poll>, може бути обмежено за допомогою параметрів B<--timeout> і B<--first-only>.

source: The standard columns always use the new version of the information from the mountinfo file, except the umount action which is based on the original information cached by B<findmnt>. The poll mode allows using extra columns:
de: Die Standardspalten verwenden stets die neue Version der Information aus der »mountinfo«-Datei, außer die »umount«-Aktion, die auf der von B<findmnt> zwischengespeicherten Originalinformation basiert. Der Poll-Modus ermöglicht die Verwendung zusätzlicher Spalten:
uk: Для стандартних стовпчиків завжди використовують нову версію відомостей з файла mountinfo, окрім дії umount, роботу якої засновано на початкових даних з кешу B<findmnt>. У режимі опитування можливе використання додаткових стовпчиків:

source: mount, umount, move or remount action name; this column is enabled by default
de: gibt einen der Aktionsnamen »mount«, »umount«, »move« oder »remount« an. Diese Spalte ist standardmäßig aktiviert.
uk: Назва дії mount, umount, move або remount; цей стовпчик типово увімкнено

source: available for umount and move actions
de: ist für die Aktionen »umount« und »move« verfügbar.
uk: доступний для дій umount і move

source: available for umount and remount actions
de: ist für die Aktionen »umount« und »remount« verfügbar.
uk: доступні для дій з демонтування та повторного монтування

source: Print only pseudo filesystems.
de: gibt nur Pseudo-Dateisysteme aus.
uk: Вивести лише фіктивні файлові системи.

source: Print only filesystems over-mounted by another filesystem.
de: gibt nur Dateisysteme aus, die Übereinhängungen anderer Dateisysteme sind.
uk: Вивести лише файлові системи, які перемонтовано іншою файловою системою.

source: Print recursively all submounts for the selected filesystems. The restrictions defined by options B<-t>, B<-O>, B<-S>, B<-T> and B<--direction> are not applied to submounts. All submounts are always printed in tree-like order. The option enables the tree-like output format by default. This option has no effect for B<--mtab> or B<--fstab>.
de: gibt rekursiv alle Untereinhängungen für die ausgewählten Dateisysteme aus. Die durch die Optionen B<-t>, B<-O>, B<-S>, B<-T> und B<--direction> definierten Einschränkungen werden nicht auf die Untereinhängungen angewendet. Alle Untereinhängungen werden immer in einer Baumstruktur ausgegeben. Die Option aktiviert standardmäßig die Ausgabe in einer Baumstruktur. Diese Option ist mit B<--mtab> oder B<--fstab> wirkungslos.
uk: Вивести рекурсивно усі підлеглі монтування для вибраних файлових систем. Обмеження, що визначаються параметрами B<-t>, B<-O>, B<-S>, B<-T> і B<--direction> не буде застосовано до підлеглих монтувань. Усі підлеглі монтування завжди буде виведено у деревоподібному порядку. Використання параметр вмикає типове деревоподібне виведення. Цей параметр не впливає на роботу команди з параметрами B<--mtab> і B<--fstab>.

source: Use raw output format. All potentially unsafe characters are hex-escaped (\(rsxE<lt>codeE<gt>).
de: verwendet das Rohformat für die Ausgabe. Alle potenziell unsicheren Zeichen werden hexadezimal maskiert (\(rsxE<lt>CodeE<gt>).
uk: Скористатися форматом виведення без обробки. Усі потенційно небезпечні символи буде екрановано як шістнадцяткові числа (\(rsxE<lt>кодE<gt>).

source: Print only real filesystems.
de: gibt nur reale Dateisysteme aus.
uk: Виводити лише справжні файлові системи.

source: B<-S>, B<--source> I<spec>
de: B<-S>, B<--source> I<Quelle>
uk: B<-S>, B<--source> I<специфікація>

source: Explicitly define the mount source. Supported specifications are I<device>, I<maj>B<:>I<min>, B<LABEL=>I<label>, B<UUID=>I<uuid>, B<PARTLABEL=>I<label> and B<PARTUUID=>I<uuid>.
de: definiert explizit die Quelle der Einhängung. Dabei werden die Angaben I<Gerät>, I<maj>B<:>I<min>, B<LABEL=>I<Bezeichnung>, B<UUID=>I<UUID>, B<PARTLABEL=>I<Bezeichnung> und B<PARTUUID=>I<UUID> unterstützt.
uk: Явним чином визначити джерело монтування. Підтримуваними специфікаціями є I<пристрій>, I<основний>B<:>I<вторинний>, B<LABEL=>I<мітка>, B<UUID=>I<uuid>, B<PARTLABEL=>I<мітка> і B<PARTUUID=>I<uuid>.

source: Search in I</etc/fstab>. The output is in the list format (see B<--list>).
de: sucht in I</etc/fstab>. Die Ausgabe wird als Liste formatiert (siehe B<--list>).
uk: Шукати у I</etc/fstab>. Виведення відбуватиметься у форматі списку (див. B<--list>).

source: B<-T>, B<--target> I<path>
de: B<-T>, B<--target> I<Pfad>
uk: B<-T>, B<--target> I<шлях>
