Repository: sebras/manpages-l10n
Catalog: po/*/man8/findmnt.8.po
Languages: de, uk

source: Define the mount target. If I<path> is not a mountpoint file or directory, then B<findmnt> checks the I<path> elements in reverse order to get the mountpoint (this feature is supported only when searching in kernel files and unsupported for B<--fstab>). It\(cqs recommended to use the option B<--mountpoint> when checks of I<path> elements are unwanted and I<path> is a strictly specified mountpoint.
de: definiert das Ziel der Einhängung. Falls der I<Pfad> keine Einhängepunktdatei oder -verzeichnis ist, dann wertet B<findmnt> die I<Pfad>-Elemente in umgekehrter Reihenfolge aus, um den Einhängepunkt zu ermitteln (diese Funktion wird nur beim Suchen in Kernel-Dateien unterstützt, nicht jedoch für B<--fstab>). Es wird empfohlen, die Option B<--mountpoint> zu verwenden, wenn die I<Pfad>-Elemente nicht ausgewertet werden sollen und I<Pfad> ein strikt angegebener Einhängepunkt ist.
uk: Визначити ціль монтування. Якщо I<шлях> не є файлом або каталогом точки монтування, B<findmnt> перевіряє елементи I<шлях> у зворотному порядку для отримання точки монтування (підтримку цієї можливості передбачено лише при пошуку у файлах ядра і вимкнено для B<--fstab>). Рекомендуємо користуватися параметром B<--mountpoint> при перевірці того, чи є елементи I<шляху> небажаними і чи є I<шлях> строго заданою точкою монтування.

source: B<-t>, B<--types> I<list>
de: B<-t>, B<--types> I<Liste>
uk: B<-t>, B<--types> I<список>

source: Limit the set of printed filesystems. More than one type may be specified in a comma-separated list. The list of filesystem types can be prefixed with B<no> to specify the filesystem types on which no action should be taken. For more details see B<mount>(8).
de: begrenzt die Gruppe der ausgegebenen Dateisysteme. Sie können mehrere Typen in einer durch Kommata getrennten Liste angeben. Der Liste der Dateisystemtypen kann ein B<no> vorangestellt werden, um die Dateisysteme zu bezeichnen, für die keine Aktion ausgeführt werden soll. Für weitere Details siehe B<mount>(8).
uk: Обмежити набір виведених записів файлових систем. У списку відокремлених комами значень можна вказувати декілька типів. До списку типів файлових систем можна додати префікс B<no>, щоб визначити типи файлових систем, до яких не слід застосовувати дії. Щоб дізнатися більше, див. B<mount>(8).

source: Enable tree-like output if possible. The options is silently ignored for tables where is missing child-parent relation (e.g., I<fstab>).
de: aktiviert die Baumansicht, falls möglich. Diese Option wird bei Tabellen stillschweigend ignoriert, in denen die Eltern-Kind-Relation fehlt (beispielsweise I<fstab>).
uk: Увімкнути, якщо це можливо, деревоподібне виведення. Параметри буде без попередження проігноровано для таблиць, де немає зв'язків дочірній-батьківський (приклад: I<fstab>).

source: Ignore filesystems with duplicate mount targets, thus effectively skipping over-mounted mount points.
de: ignoriert Dateisysteme mit doppelten Einhängezielen, daher werden übereingehängte (overmounted) Einhängepunkte wirkungsvoll übergangen.
uk: Ігнорувати файлові системи із дублюванням цілей монтування, отже, пропускати перемонтовані точки монтування.

source: Do not truncate text in columns. The default is to not truncate the B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID>, B<PARTLABEL> columns. This option disables text truncation also in all other columns.
de: kürzt den Text in den Spalten nicht. Standardmäßig werden die Spalten B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID> und B<PARTLABEL> nicht gekürzt. Diese Option deaktiviert die Textkürzung auch in allen anderen Spalten.
uk: Не обрізати текст у стовпчиках. Типово, програма не обрізає текст у стовпчиках B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID>, B<PARTLABEL>. За допомогою цього параметра можна вимкнути обрізання в усіх інших стовпчиках.

source: Do not print a [/dir] in the SOURCE column for bind mounts or btrfs subvolumes.
de: gibt kein [/Verzeichnis] in der Spalte SOURCE für Bind-Einhängungen oder Btrfs-Teildatenträger aus.
uk: Не виводити [/каталог] у стовпчику ДЖЕРЕЛО для монтувань з прив'язкою або підтомів btrfs.

source: B<-w>, B<--timeout> I<milliseconds>
de: B<-w>, B<--timeout> I<Millisekunden>
uk: B<-w>, B<--timeout> I<мілісекунди>

source: Specify an upper limit on the time for which B<--poll> will block, in milliseconds.
de: gibt eine obere Grenze der Zeitspanne in Millisekunden an, für die B<--poll> blockiert.
uk: Вказати верхню межу часу, протягом якого здійснюватиме блокування B<--poll>, у мілісекундах.

source: Check mount table content. The default is to verify I</etc/fstab> parsability and usability. It\(cqs possible to use this option also with B<--tab-file>. It\(cqs possible to specify source (device) or target (mountpoint) to filter mount table. The option B<--verbose> forces B<findmnt> to print more details.
de: überprüft den Inhalt der Einhängetabelle. Standardmäßig wird die Auswertbarkeit und Verwendbarkeit der Datei I</etc/fstab> überprüft. Sie können diese Option auch mit B<--tab-file> verwenden. Außerdem können Sie eine Quelle (Gerät) oder ein Ziel (Einhängepunkt) angeben, um die Einhängetabelle zu filtern. Die Option B<--verbose> bewirkt, dass die Ausgaben von B<findmnt> ausführlicher werden.
uk: Перевірити вміст таблиці монтування. Типово, програма перевіряє придатність до обробки та використання I</etc/fstab>. Цей параметр можна використовувати разом із B<--tab-file>. Можна вказувати джерело (пристрій) або ціль (точку монтування) для фільтрування таблиці монтувань. Використання параметра B<--verbose> примушуватиме B<findmnt> до виведення докладніших відомостей.

source: Force B<findmnt> to print more information (B<--verify> only for now).
de: bewirkt, dass B<findmnt> mehr Informationen ausgibt (derzeit nur B<--verify>).
uk: Наказати B<findmnt> вивести докладніші відомості (у поточній версії лише для B<--verify>).

source: When used with B<VFS-OPTIONS> column, print all VFS (fs-independent) flags. This option is designed for auditing purposes to list also default VFS kernel mount options which are normally not listed.
de: gibt alle VFS- (dateisystemunabhängigen) Schalter aus, wenn dies mit der Spalte B<VFS-OPTIONS> verwendet wird. Diese Option dient Prüfzwecken, damit auch standardmäßige VFS-Kernel-Einhängeoptionen aufgelistet werden, die normalerweise nicht aufgelistet werden würden.
uk: Якщо використано разом зі стовпчиком B<VFS-OPTIONS>, вивести усі прапорці VFS (незалежно від файлової системи). Цей параметр створено для ревізування списку типових параметрів монтування віртуальних файлових систем у ядрі, які, зазвичай, не потрапляють до списку.

source: The column name will be modified to contain only characters allowed for shell variable identifiers. This is usable, for example, with B<--pairs>. Note that this feature has been automatically enabled for B<--pairs> in version 2.37, but due to compatibility issues, now it\(cqs necessary to request this behavior by B<--shell>.
de: Der Spaltenname wird so geändert, dass er nur Zeichen enthält, die als Shell-Variablenbezeichner genutzt werden können. Dies ist beispielsweise nützlich mit B<--pairs>. Beachten Sie, dass diese Funktion für B<--pairs> in Version 2.37 automatisch aktiviert wurde, dass es nun aber aus Kompatibilitätsgründen erforderlich ist, dieses Verhalten durch B<--shell> anzufordern.
uk: Назву стовпчика буде змінено так, щоб вона містила лише символи, які є дозволеними для ідентифікаторів змінних командної оболонки Це корисно, зокрема, з B<--pairs>. Зауважте, що цю можливість було автоматично увімкнено для B<--pairs> у версії 2.37, але через проблеми із сумісністю у нових версіях потрібно викликати таку поведінку за допомогою параметра B<--shell>.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: The exit value is 0 if there is something to display, or 1 on any error (for example if no filesystem is found based on the user\(cqs filter specification, or the device path or mountpoint does not exist).
de: Der Rückgabewert ist 0, wenn irgendetwas angezeigt werden kann, oder 1 bei einem Fehler (zum Beispiel falls anhand der vom Benutzer angegebenen Filter kein Dateisystem gefunden werden konnte oder der Gerätepfad oder der Einhängepunkt nicht existiert.
uk: Значенням виходу буде 0, якщо програмі є що вивести, або 1, якщо станеться будь-яка помилка (наприклад, якщо за специфікацією фільтрування, заданою користувачем, не буде знайдено жодної файлової системи або шляху на пристрої чи точки монтування не існуватиме).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
uk: СЕРЕДОВИЩЕ

source: B<LIBMOUNT_FSTAB>=E<lt>pathE<gt>
de: B<LIBMOUNT_FSTAB>=E<lt>PfadE<gt>
uk: B<LIBMOUNT_FSTAB>=E<lt>шляхE<gt>

source: overrides the default location of the I<fstab> file
de: setzt den standardmäßigen Ort der Datei I<fstab> außer Kraft.
uk: замінює типове розташування файлу I<fstab>

source: B<LIBMOUNT_MTAB>=E<lt>pathE<gt>
de: B<LIBMOUNT_MTAB>=E<lt>PfadE<gt>
uk: B<LIBMOUNT_MTAB>=E<lt>шляхE<gt>

source: overrides the default location of the I<mtab> file
de: setzt den standardmäßigen Ort der Datei I<mtab> außer Kraft.
uk: замінює типове розташування файлу I<mtab>

source: enables libmount debug output
de: aktiviert die Fehlersuch-Ausgabe von Libmount.
uk: вмикає показ діагностичних повідомлень libmount

source: enables libsmartcols debug output
de: aktiviert die Fehlerdiagnose-Ausgabe für Libsmartcols.
uk: вмикає показ діагностичних повідомлень libsmartcols

source: use visible padding characters.
de: verwendet sichtbare Auffüllzeichen.
uk: використати символи візуального доповнення.

source: EXAMPLES
de: BEISPIELE
uk: ПРИКЛАДИ

source: Prints all NFS filesystems defined in I</etc/fstab>.
de: gibt alle in I</etc/fstab> definierten NFS-Dateisysteme aus.
uk: Виводити усі файлові системи NFS, які визначено в I</etc/fstab>.

source: Prints all I</etc/fstab> filesystems where the mountpoint directory is I</mnt/foo>. It also prints bind mounts where I</mnt/foo> is a source.
de: gibt alle in der Datei I</etc/fstab> aufgeführten Dateisysteme aus, deren Einhängepunktverzeichnis I</mnt/foo> ist. Außerdem werden Bind-Einhängungen ausgegeben, deren Quelle I</mnt/foo> ist.
uk: Виводить усі файлові системи I</etc/fstab>, де каталогом точки монтування є I</mnt/foo>. Також виводить точки монтування прив'язки, де джерелом є I</mnt/foo>.

source: Prints all I</etc/fstab> filesystems where the mountpoint directory is I</mnt/foo>.
de: gibt alle in der Datei I</etc/fstab> aufgeführten Dateisysteme aus, deren Einhängepunktverzeichnis I</mnt/foo> ist.
uk: Виводить усі файлові системи I</etc/fstab>, де каталогом точки монтування є I</mnt/foo>.

source: Prints all I</etc/fstab> filesystems and converts LABEL= and UUID= tags to the real device names.
de: gibt alle in der Datei I</etc/fstab> aufgeführten Dateisysteme aus und wandelt die Markierungen LABEL= und UUID= in die echten Gerätenamen um.
uk: Виводить усі файлові системи з I</etc/fstab> і перетворює мітки LABEL= і UUID= на справжні назви пристроїв.

source: Prints only the mountpoint where the filesystem with label "/boot" is mounted.
de: gibt nur den Einhängepunkt aus, in dem das Dateisystem mit der Bezeichnung »/boot« eingehängt ist.
uk: Виводить лише точку монтування, до якої змонтовано файлову систему із міткою "/boot".

source: Monitors mount, unmount, remount and move on I</mnt/foo>.
de: überwacht Einhängungen, Aushängungen, erneute Einhängungen und Verschiebungen von I</mnt/foo>.
uk: Стежить за mount, unmount, remount і move для I</mnt/foo>.

source: Waits for I</mnt/foo> unmount.
de: wartet auf das Aushängen von I</mnt/foo>.
uk: Очікує на демонтування I</mnt/foo>.

source: Monitors remounts to read-only mode on all ext3 filesystems.
de: überwacht erneutes Einhängen im schreibgeschützten Modus aller Ext3-Dateisysteme.
uk: Стежить за повторними монтуваннями у режимі лише читання для усіх файлових систем ext3.

source: AUTHORS
de: AUTOREN
uk: АВТОРИ

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: The B<findmnt> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<findmnt> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<findmnt> є частиною пакунка util-linux, який можна отримати з

source: May 2018
de: Mai 2018
uk: травень 2018 року

source: B<findmnt> [options] [B<--source>] I<device> [B<--target>|B<--mountpoint>] I<mountpoint>
de: B<findmnt> [Optionen] [B<--source>] I<Gerät> [B<--target>|B<--mountpoint>] I<Einhängepunkt>
uk: B<findmnt> [параметри] [B<--source>] I<пристрій> [B<--target>|B<--mountpoint>] I<точка-монтування>

source: B<findmnt> will list all mounted filesystems or search for a filesystem. The B<\%findmnt> command is able to search in I</etc/fstab>, I</etc/mtab> or I</proc/self/mountinfo>. If I<device> or I<mountpoint> is not given, all filesystems are shown.
de: B<findmnt> listet alle eingehängten Dateisysteme auf oder sucht nach einem Dateisystem. Der Befehl B<\%findmnt> kann in I</etc/fstab>, I</etc/mtab> oder I</proc/self/mountinfo> suchen. Falls kein I<Gerät> oder I<Einhängepunkt> angegeben wird, werden alle Dateisysteme angezeigt.
uk: B<findmnt> виводить список усіх змонтованих файлових систем або шукає файлову систему. Команда B<findmnt> може шукати в I</etc/fstab>, I</etc/mtab> або I</proc/self/mountinfo>. Якщо не вказано I<пристрій> або I<точку-монтування>, буде показано усі файлові системи.

source: The device may be specified by device name, major:minor numbers, filesystem label or UUID, or partition label or UUID. Note that B<\%findmnt> follows B<mount>(8) behavior where a device name may be interpreted as a mountpoint (and vice versa) if the B<--target>, B<--mountpoint> or B<--source> options are not specified.
de: Das Gerät kann anhand des Gerätenamens, der Major:Minor-Nummern, der Dateisystembezeichnung oder -UUID oder der Partitionsbezeichnung oder -UUID angegeben werden. Beachten Sie, dass B<\%findmnt> dem Verhalten von B<mount>(8) folgt, bei dem ein Gerätename als Einhängepunkt interpretiert werden kann (und umgekehrt ein Einhängepunkt als Gerätename), wenn die Optionen B<--target>, B<--mountpoint> oder B<--source> nicht angegeben sind.
uk: Пристрій можна задати за назвою, числами основний:другорядний, міткою або UUID файлової системи чи міткою або UUID розділу. Зауважте, що у B<findmnt> використано правила поведінки B<mount>(8), за якими назву пристрою може бути оброблено як точку монтування (і навпаки), якщо не вказано параметр B<--target>, B<--mountpoint> або B<--source>.

source: Print the SIZE, USED and AVAIL columns in bytes rather than in a human-readable format.
de: gibt die Spalten »SIZE«, »USED« und »AVAIL« in Byte anstelle eines menschenlesbaren Formats aus.
uk: Вивести дані стовпчиків SIZE, USED і AVAIL у байтах, а не у зручному для читання форматі.

source: Do not canonicalize paths at all. This option affects the comparing of paths and the evaluation of tags (LABEL, UUID, etc.).
de: kanonisiert die Pfade nicht. Diese Option beeinflusst den Vergleich von Pfaden und die Auswertung von Markierungen (LABEL, UUID, usw.).
uk: Не перетворювати шляхи до канонічної форми взагалі. Цей параметр стосується порівняння шляхів і визначення міток (LABEL, UUID тощо).

source: Imitate the output of B<df>(1). This option is equivalent to B<-o\ SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET> but excludes all pseudo filesystems. Use B<--all> to print all filesystems.
de: imitiert die Ausgabe von B<df>(1). Diese Option ist gleichbedeutend mit B<-o\ SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET>, schließt aber alle Pseudo-Dateisysteme aus. Verwenden Sie B<--all>, um alle Dateisysteme anzuzeigen.
uk: Імітувати виведення B<df>(1). Цей параметр є еквівалентним до B<-o\ SOURCE,FSTYPE,SIZE,USED,AVAIL,USE%,TARGET>, але його використання призводить до виключення усіх фіктивних файлових систем. Скористайтеся параметром B<--all> для виведення даних усіх файлових систем.

source: B<-d>,B< --direction >I<word>
de: B<-d>,B< --direction >I<Wort>
uk: B<-d>, B<--direction> I<слово>

source: Convert all tags (LABEL, UUID, PARTUUID or PARTLABEL) to the corresponding device names.
de: wandelt alle Markierungen (LABEL, UUID, PARTUUID oder PARTLABEL) in die entsprechenden Gerätenamen um.
uk: Перетворити усі мітки (LABEL, UUID, PARTUUID та PARTLABEL) на назви відповідних пристроїв.

source: B<-F>,B< --tab-file >I<path>
de: B<-F>,B< --tab-file >I<Pfad>
uk: B<-F>, B<--tab-file> I<шлях>

source: Search in an alternative file. If used with B<--fstab>, B<--mtab> or B<--kernel>, then it overrides the default paths. If specified more than once, then tree-like output is disabled (see the B<--list> option).
de: sucht in einer alternativen Datei. Wenn diese Option mit B<--fstab>, B<--mtab> oder B<--kernel> verwendet wird, werden die Standardpfade außer Kraft gesetzt. Wenn dies mehrmals angegeben wird, ist die Baumansicht deaktiviert (siehe die Option B<--list>).
uk: Шукати в альтернативному файлі. Якщо використано з B<--fstab>, B<--mtab> або B<--kernel>, перевизначає типові шляхи. Якщо вказано декілька разів, деревоподібне виведення буде вимкнено (див. параметр B<--list>).

source: Search in I</proc/self/mountinfo>. The output is in the tree-like format. This is the default. The output contains only mount options maintained by kernel (see also B<--mtab)>.
de: sucht in I</proc/self/mountinfo>. Die Ausgabe erfolgt in einer Baumansicht. Dies ist die Vorgabe. Die Ausgabe enthält nur Einhängeoptionen, die vom Kernel verwaltet werden (siehe auch B<--mtab)>.
uk: Шукати у I</proc/self/mountinfo>. Дані буде виведено у деревоподібному форматі. Це типовий формат. У виведених даних міститимуться лише параметри монтування, підтримку яких передбачено у ядрі (див. також B<--mtab>).

source: Use the list output format. This output format is automatically enabled if the output is restricted by the B<-t>, B<-O>, B<-S> or B<-T> option and the option B<--submounts> is not used or if more that one source file (the option B<-F>) is specified.
de: formatiert die Ausgabe als Liste. Dieses Ausgabeformat ist automatisch aktiviert, wenn die Ausgabe durch die Optionen B<-t>, B<-O>, B<-S> oder B<-T> eingeschränkt ist und die Option B<--submounts> nicht verwendet wird oder mehr als eine Quelldatei (mit der Option B<-F>) angegeben wird.
uk: Використати формат виведення списком. Цей формат виведення буде автоматично увімкнено, якщо виведення обмежено параметром B<-t>, B<-O>, B<-S> або B<-T>, і не використано параметр B<--submounts>, або якщо вказано декілька початкових файлів (параметр B<-F>).

source: B<-M>,B< --mountpoint >I<path>
de: B<-M>,B< --mountpoint >I<Pfad>
uk: B<-M>, B<--mountpoint> I<шлях>

source: Explicitly define the mountpoint file or directory. See also B<--target>.
de: definiert explizit die Einhängepunkt-Datei oder das Einhängepunkt-Verzeichnis. Siehe auch B<--target>.
uk: Явним чином визначити файл або каталог точки монтування. Див. також B<--target>.

source: Search in I</etc/mtab>. The output is in the list format by default (see B<--tree>). The output may include user space mount options.
de: sucht in I</etc/mtab>. Die Ausgabe wird standardmäßig als Liste formatiert (siehe B<--tree>). Die Ausgabe kann weitere Einhängeoptionen auf Anwendungsebene enthalten.
uk: Шукати в I</etc/mtab>. Типово, буде виведено дані у форматі списку (див. B<--tree>). Виведені дані можуть включати параметри монтування простору користувача.

source: B<-N>,B< --task >I<tid>
de: B<-N>,B< --task >I<Threadkennung>

source: Use alternative namespace /proc/E<lt>tidE<gt>/mountinfo rather than the default /proc/self/mountinfo. If the option is specified more than once, then tree-like output is disabled (see the B<--list> option). See also the B<unshare>(1) command.
de: verwendet anstelle des vorgegebenen /proc/self/mountinfo den alternativen Namensraum /proc/E<lt>ThreadkennungE<gt>/mountinfo. Wenn diese Option mehr als einmal angegeben wird, dann wird die Baumansicht deaktiviert (siehe die Option B<--list>). Siehe auch den Befehl B<unshare>(1).
uk: Використовувати альтернативний простір назв /proc/E<lt>tidE<gt>/mountinfo, а не типовий /proc/self/mountinfo. Якщо параметр вказано декілька разів, деревоподібний формат виведення буде вимкнено (див. параметр B<--list>). Див. також команду B<unshare>(1).

source: B<-O>,B< --options >I<list>
de: B<-O>,B< --options >I<Liste>
uk: B<-O>, B<--options> I<список>

source: Limit the set of printed filesystems. More than one option may be specified in a comma-separated list. The B<-t> and B<-O> options are cumulative in effect. It is different from B<-t> in that each option is matched exactly; a leading I<no> at the beginning does not have global meaning. The "no" can used for individual items in the list. The "no" prefix interpretation can be disabled by "+" prefix.
de: begrenzt die Gruppe der ausgegebenen Dateisysteme. Mehrere Optionen können in einer durch Kommata getrennten Liste angegeben werden. Die Optionen B<-t> und B<-O> wirken kumulativ. Im Gegensatz zu B<-t> wird jede Option für sich ausgewertet; ein vorangestelltes I<no> wirkt sich nicht global aus. Das I<no> kann für individuelle Listeneinträge verwendet werden; dessen Interpretation kann mit dem Präfix »+« deaktiviert werden.
uk: Обмежити набір виведених файлових систем. Можна вказувати декілька параметрів у форматі списку значень, які відокремлено комами. Параметри B<-t> і B<-O> є накопичувальними за наслідками. Цим вони відрізняються від параметра B<-t> тим, що відповідність встановлюється точно; початкове I<no> не має загального значення. «no» може використовуватися для окремих пунктів у списку. Інтерпретацію префікса «no» можна вимкнути префіксом «+».

source: B<-o>,B< --output >I<list>
de: B<-o>,B< --output >I<Liste>
uk: B<-o>, B<--output> I<список>

source: Define output columns. See the B<--help> output to get a list of the currently supported columns. The B<TARGET> column contains tree formatting if the B<--list> or B<--raw> options are not specified.
de: legt die Ausgabespalten fest. In der Ausgabe von B<--help> wird eine Liste der verfügbaren Spalten angezeigt. Die Spalte B<TARGET> wird als Baum formatiert, falls die Optionen B<--list> oder B<--raw> nicht angegeben werden.
uk: Визначити стовпчики виведення. Див. виведення B<--help>, щоб отримати список поточний підтримуваних стовпчиків. Стовпчик B<TARGET> міститиме ієрархічні дані, якщо не вказано параметр B<--list> або B<--raw>.

source: Output almost all available columns. The columns that require B<--poll> are not included.
de: gibt fast alle verfügbaren Spalten aus. Die Spalten, welche B<--poll> erfordern, werden nicht angezeigt.
uk: Вивести майже усі доступні стовпчики. Стовпчики, які потребують B<--poll>, не буде включено.

source: Use key="value" output format. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>).
de: formatiert die Ausgabe als »Schlüssel="Wert"«-Paare. Alle potenziell unsicheren Zeichen werden hexadezimal maskiert (\exE<lt>CodeE<gt>).
uk: Скористатися форматом виведення ключ="значення". Усі потенційно небезпечні символи буде екрановано як шістнадцяткові числа (\exE<lt>кодE<gt>).

source: B<-p>,B< --poll>[I<=list>]
de: B<-p>,B< --poll>[I<=Liste>]
uk: B<-p>, B<--poll>[I<=список>]
