Repository: sebras/manpages-l10n
Catalog: po/*/man8/findmnt.8.po
Languages: de, uk

source: Monitor changes in the /proc/self/mountinfo file. Supported actions are: mount, umount, remount and move. More than one action may be specified in a comma-separated list. All actions are monitored by default.
de: überwacht Änderungen in der Datei /proc/self/mountinfo. Dabei werden die Aktionen »mount«, »umount«, »remount« und »move« unterstützt. Mehrere Aktionen können in Form einer durch Kommata getrennten Liste angegeben werden. Standardmäßig werden alle Aktionen überwacht.
uk: Стежити за змінами у файлі I</proc/self/mountinfo>. Підтримуваними діями є монтування (mount), демонтування (umount), повторне монтування (remount) та пересування (move). Можна вказати декілька дій у форматі списку значень, які відокремлено комами. Типово, стеження ведеться за усіма діями.

source: The standard columns always use the new version of the information from the mountinfo file, except the umount action which is based on the original information cached by B<findmnt>(8). The poll mode allows using extra columns:
de: Die Standardspalten verwenden stets die neue Version der Information aus der »mountinfo«-Datei, außer die »umount«-Aktion, die auf der von B<findmnt>(8) zwischengespeicherten Originalinformation basiert. Der Poll-Modus ermöglicht die Verwendung zusätzlicher Spalten:
uk: Для стандартних стовпчиків завжди використовують нову версію відомостей з файла mountinfo, окрім дії umount, роботу якої засновано на початкових даних з кешу B<findmnt>(8). У режимі опитування можливе використання додаткових стовпчиків:

source: Print recursively all submounts for the selected filesystems. The restrictions defined by options B<-t>, B<-O>, B<-S>, B<-T> and B<\%--direction> are not applied to submounts. All submounts are always printed in tree-like order. The option enables the tree-like output format by default. This option has no effect for B<--mtab> or B<--fstab>.
de: gibt rekursiv alle Untereinhängungen für die ausgewählten Dateisysteme aus. Die durch die Optionen B<-t>, B<-O>, B<-S>, B<-T> und B<\%--direction> definierten Einschränkungen werden nicht auf die Untereinhängungen angewendet. Alle Untereinhängungen werden immer in einer Baumstruktur ausgegeben. Die Option aktiviert standardmäßig die Ausgabe in einer Baumstruktur. Diese Option ist mit B<--mtab> oder B<--fstab> wirkungslos.
uk: Вивести рекурсивно усі підлеглі монтування для вибраних файлових систем. Обмеження, що визначаються параметрами B<-t>, B<-O>, B<-S>, B<-T> і B<--direction> не буде застосовано до підлеглих монтувань. Усі підлеглі монтування завжди буде виведено у деревоподібному порядку. Використання параметр вмикає типове деревоподібне виведення. Цей параметр не впливає на роботу команди з параметрами B<--mtab> і B<--fstab>.

source: Use raw output format. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>).
de: verwendet das Rohformat für die Ausgabe. Alle potenziell unsicheren Zeichen werden hexadezimal maskiert (\exE<lt>CodeE<gt>).
uk: Скористатися форматом виведення без обробки. Усі потенційно небезпечні символи буде екрановано як шістнадцяткові числа (\exE<lt>кодE<gt>).

source: B<-S>,B< --source >I<spec>
de: B<-S>,B< --source >I<Quelle>
uk: B<-S>, B<--source> I<специфікація>

source: Explicitly define the mount source. Supported specifications are I<device>, I<maj>B<:>I<min>, B<LABEL=>I<label>, B<UUID=>I<uuid>, B<PARTLABEL=>I<label> and B<PARTUUID=>I<uuid>.
de: definiert explizit die Quelle der Einhängung. Dabei werden die Angaben I<Gerät>, I<maj>B<:>I<min>, B<LABEL=>I<Bezeichnung>, B<UUID=>I<UUID>, B<PARTLABEL=>I<Bezeichnung> und B<PARTUUID=>I<UUID> unterstützt.
uk: Явним чином визначити джерело монтування. Підтримуваними специфікаціями є I<пристрій>, I<основний>B<:>I<вторинний>, B<LABEL=>I<мітка>, B<UUID=>I<uuid>, B<PARTLABEL=>I<мітка> і B<PARTUUID=>I<uuid>.

source: Search in I</etc/fstab>. The output is in the list format (see B<--list>).
de: sucht in I</etc/fstab>. Die Ausgabe wird als Liste formatiert (siehe B<--list>).
uk: Шукати у I</etc/fstab>. Виведення відбуватиметься у форматі списку (див. B<--list>).

source: B<-T>,B< --target >I<path>
de: B<-T>,B< --target >I<Pfad>
uk: B<-T>, B<--target> I<шлях>

source: Define the mount target. If I<path> is not a mountpoint file or directory, then B<findmnt> checks the I<path> elements in reverse order to get the mountpoint (this feature is supported only when searching in kernel files and unsupported for B<--fstab>). It's recommended to use the option B<--mountpoint> when checks of I<path> elements are unwanted and I<path> is a strictly specified mountpoint.
de: definiert das Ziel der Einhängung. Falls der I<Pfad> keine Einhängepunktdatei oder -verzeichnis ist, dann wertet B<findmnt> die I<Pfad>-Elemente in umgekehrter Reihenfolge aus, um den Einhängepunkt zu ermitteln (diese Funktion wird nur beim Suchen in Kernel-Dateien unterstützt, nicht jedoch für B<--fstab>). Es wird empfohlen, die Option B<--mountpoint> zu verwenden, wenn die I<Pfad>-Elemente nicht ausgewertet werden sollen und I<Pfad> ein strikt angegebener Einhängepunkt ist.
uk: Визначити ціль монтування. Якщо I<шлях> не є файлом або каталогом точки монтування, B<findmnt> перевіряє елементи I<шлях> у зворотному порядку для отримання точки монтування (підтримку цієї можливості передбачено лише при пошуку у файлах ядра і вимкнено для B<--fstab>). Рекомендуємо користуватися параметром B<--mountpoint> при перевірці того, чи є елементи I<шляху> небажаними і чи є I<шлях> строго заданою точкою монтування.

source: B<-t>,B< --types >I<list>
de: B<-t>,B< --types >I<Liste>
uk: B<-t>, B<--types> I<список>

source: Limit the set of printed filesystems. More than one type may be specified in a comma-separated list. The list of filesystem types can be prefixed with B<no> to specify the filesystem types on which no action should be taken. For more details see B<mount>(8).
de: begrenzt die Gruppe der ausgegebenen Dateisysteme. Sie können mehrere Typen in einer durch Kommata getrennten Liste angeben. Der Liste der Dateisystemtypen kann ein B<no> vorangestellt werden, um die Dateisysteme zu bezeichnen, für die keine Aktion ausgeführt werden soll. Für weitere Details siehe B<mount>(8).
uk: Обмежити набір виведених записів файлових систем. У списку відокремлених комами значень можна вказувати декілька типів. До списку типів файлових систем можна додати префікс B<no>, щоб визначити типи файлових систем, до яких не слід застосовувати дії. Щоб дізнатися більше, див. B<mount>(8).

source: Enable tree-like output if possible. The options is silently ignored for tables where is missing child-parent relation (e.g., fstab).
de: aktiviert die Baumansicht, falls möglich. Diese Option wird bei Tabellen stillschweigend ignoriert, in denen die Eltern-Kind-Relation fehlt (beispielsweise fstab).
uk: Увімкнути, якщо це можливо, деревоподібне виведення. Параметри буде без попередження проігноровано для таблиць, де немає зв'язків дочірній-батьківський (приклад: I<fstab>).

source: Do not truncate text in columns. The default is to not truncate the B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID>, B<PARTLABEL> columns. This option disables text truncation also in all other columns.
de: kürzt den Text in den Spalten nicht. Standardmäßig werden die Spalten B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID> und B<PARTLABEL> nicht gekürzt. Diese Option deaktiviert die Textkürzung auch in allen anderen Spalten.
uk: Не обрізати текст у стовпчиках. Типово, програма не обрізає текст у стовпчиках B<TARGET>, B<SOURCE>, B<UUID>, B<LABEL>, B<PARTUUID>, B<PARTLABEL>. За допомогою цього параметра можна вимкнути обрізання в усіх інших стовпчиках.

source: B<-w>,B< --timeout >I<milliseconds>
de: B<-w>,B< --timeout >I<Millisekunden>
uk: B<-w>, B<--timeout> I<мілісекунди>

source: Check mount table content. The default is to verify I</etc/fstab> parsability and usability. It's possible to use this option also with B<--tab-file>. It's possible to specify source (device) or target (mountpoint) to filter mount table. The option B<--verbose> forces findmnt to print more details.
de: überprüft den Inhalt der Einhängetabelle. Standardmäßig wird die Auswertbarkeit und Verwendbarkeit der Datei I</etc/fstab> überprüft. Sie können diese Option auch mit B<--tab-file> verwenden. Außerdem können Sie eine Quelle (Gerät) oder ein Ziel (Einhängepunkt) angeben, um die Einhängetabelle zu filtern. Die Option B<--verbose> bewirkt, dass die Ausgaben von Findmnt ausführlicher werden.
uk: Перевірити вміст таблиці монтування. Типово, програма перевіряє придатність до обробки та використання I</etc/fstab>. Цей параметр можна використовувати разом із B<--tab-file>. Можна вказувати джерело (пристрій) або ціль (точку монтування) для фільтрування таблиці монтувань. Використання параметра B<--verbose> примушуватиме B<findmnt> до виведення докладніших відомостей.

source: Force findmnt to print more information (B<--verify> only for now).
de: bewirkt, dass Findmnt mehr Informationen ausgibt (derzeit nur B<--verify>).
uk: Наказати B<findmnt> вивести докладніші відомості (у поточній версії лише для B<--verify>).

source: LIBMOUNT_FSTAB=E<lt>pathE<gt>
de: LIBMOUNT_FSTAB=E<lt>PfadE<gt>
uk: LIBMOUNT_FSTAB=E<lt>шляхE<gt>

source: overrides the default location of the fstab file
de: setzt den standardmäßigen Ort der Datei »fstab« außer Kraft.
uk: замінює типове розташування файлу I<fstab>

source: LIBMOUNT_MTAB=E<lt>pathE<gt>
de: LIBMOUNT_MTAB=E<lt>PfadE<gt>
uk: LIBMOUNT_MTAB=E<lt>шляхE<gt>

source: overrides the default location of the mtab file
de: setzt den standardmäßigen Ort der Datei »mtab« außer Kraft.
uk: замінює типове розташування файлу I<mtab>

source: use visible padding characters. Requires enabled LIBSMARTCOLS_DEBUG.
de: verwendet sichtbare Auffüllzeichen. Dafür muss LIBSMARTCOLS_DEBUG aktiviert sein.
uk: використати символи візуального доповнення. Потребує вмикання B<LIBSMARTCOLS_DEBUG>.

source: EXAMPLE
de: BEISPIEL
uk: ПРИКЛАДИ

source: Prints all I</etc/fstab> filesystems where the mountpoint directory is /mnt/foo. It also prints bind mounts where /mnt/foo is a source.
de: gibt alle in der Datei I</etc/fstab> aufgeführten Dateisysteme aus, deren Einhängepunktverzeichnis /mnt/foo ist. Außerdem werden Bind-Einhängungen ausgegeben, deren Quelle /mnt/foo ist.
uk: Виводить усі файлові системи I</etc/fstab>, де каталогом точки монтування є I</mnt/foo>. Також виводить точки монтування прив'язки, де джерелом є I</mnt/foo>.

source: Prints all I</etc/fstab> filesystems where the mountpoint directory is /mnt/foo.
de: gibt alle in der Datei I</etc/fstab> aufgeführten Dateisysteme aus, deren Einhängepunktverzeichnis /mnt/foo ist.
uk: Виводить усі файлові системи I</etc/fstab>, де каталогом точки монтування є I</mnt/foo>.

source: Monitors mount, unmount, remount and move on /mnt/foo.
de: überwacht Einhängungen, Aushängungen, erneute Einhängungen und Verschiebungen von /mnt/foo.
uk: Стежить за mount, unmount, remount і move для I</mnt/foo>.

source: Waits for /mnt/foo unmount.
de: wartet auf das Aushängen von /mnt/foo.
uk: Очікує на демонтування I</mnt/foo>.

source: The findmnt command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl findmnt ist Teil des Pakets util-linux, welches auf https://www.kernel.org/pub/linux/utils/util-linux/ verfügbar ist.
uk: Програма findmnt є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Search in I</proc/self/mountinfo>. The output is in the tree-like format. This is the default. The output contains only mount options maintained by kernel (see also B<--mtab)>.
de: sucht in I</proc/self/mountinfo>. Die Ausgabe erfolgt in einer Baumansicht. Dies ist die Vorgabe. Die Ausgabe enthält nur Einhängeoptionen, die vom Kernel verwaltet werden (siehe auch B<--mtab)>.
uk: Шукати у I</proc/self/mountinfo>. Дані буде виведено у деревоподібному форматі. Це типовий формат. У виведених даних міститимуться лише параметри монтування, підтримку яких передбачено у ядрі (див. також B<--mtab>).

source: Produce output in the form of key="value" pairs. All potentially unsafe value characters are hex-escaped (\(rsxE<lt>codeE<gt>). The key (variable name) will be modified to contain only characters allowed for a shell variable identifiers, for example, FS_OPTIONS and USE_PCT instead of FS-OPTIONS and USE%.
de: erzeugt Ausgaben in der Form von Schlüssel="Wert"-Paaren. Alle potenziell unsicheren Zeichen werden hexadezimal maskiert (\(rsxE<lt>CodeE<gt>). Der Schlüssel (der Variablenname) wird so verändert, dass er nur Zeichen enthält, die für Shell-Variablenbezeichner erlaubt sind, zum Beispiel FS_OPTIONS und USE_PCT anstelle von FS-OPTIONS und USE%.
uk: Вивести дані у формі пар ключ="значення". Усі потенційно небезпечні символи значень буде екрановано (\(rsxE<lt>кодE<gt>). Ключ (назву змінної) буде змінено так, щоб у ній містилися лише символи, які дозволено до використання у ідентифікаторах змінних оболонки. Приклад: FS_OPTIONS і USE_PCT замість FS-OPTIONS і USE%.

source: Enable tree-like output if possible. The options is silently ignored for tables where is missing child-parent relation (e.g., fstab).
de: aktiviert die Baumansicht, falls möglich. Diese Option wird bei Tabellen stillschweigend ignoriert, in denen die Eltern-Kind-Relation fehlt (beispielsweise fstab).
uk: Увімкнути, якщо це можливо, деревоподібне виведення. Параметри буде без попередження проігноровано для таблиць, де немає зв'язків дочірній-батьківський (приклад: I<fstab>).

source: Check mount table content. The default is to verify I</etc/fstab> parsability and usability. It\(cqs possible to use this option also with B<--tab-file>. It\(cqs possible to specify source (device) or target (mountpoint) to filter mount table. The option B<--verbose> forces findmnt to print more details.
de: überprüft den Inhalt der Einhängetabelle. Standardmäßig wird die Auswertbarkeit und Verwendbarkeit der Datei I</etc/fstab> überprüft. Sie können diese Option auch mit B<--tab-file> verwenden. Außerdem können Sie eine Quelle (Gerät) oder ein Ziel (Einhängepunkt) angeben, um die Einhängetabelle zu filtern. Die Option B<--verbose> bewirkt, dass die Ausgaben von Findmnt ausführlicher werden.
uk: Перевірити вміст таблиці монтування. Типово, програма перевіряє придатність до обробки та використання I</etc/fstab>. Цей параметр можна використовувати разом із B<--tab-file>. Можна вказувати джерело (пристрій) або ціль (точку монтування) для фільтрування таблиці монтувань. Використання параметра B<--verbose> примушуватиме B<findmnt> до виведення докладніших відомостей.

source: System Administration
uk: Керування системою

source: EXIT STATUS
uk: СТАН ВИХОДУ
