Repository: sebras/manpages-l10n
Catalog: po/*/man8/fstrim.8.po
Languages: de, fr, uk

source: The command B<fstrim --all> returns 0 (all succeeded), 32 (all failed) or 64 (some failed, some succeeded).
de: Der Befehl B<fstrim --all> gibt 0 zurück (alle erfolgreich), 32 (alle fehlgeschlagen) oder 64 (einige fehlgeschlagen, einige erfolgreich).
fr: La commande B<fstrim --all> renvoie B<0> (tous ont réussi), B<32> (tous ont échoué) ou B<64> (certains ont réussi, d’autres ont échoué).
uk: Команда B<fstrim --all> повертає 0 (усі успішно), 32 (усі невдало) або 64 (деякі невдало, деякі успішно).

source: AUTHORS
de: AUTOREN
fr: AUTEURS
uk: АВТОРИ

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
fr: SIGNALER DES BOGUES
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
fr: Pour envoyer un rapport de bogue, utilisez le système de gestion des problèmes à l'adresse
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
fr: DISPONIBILITÉ
uk: ДОСТУПНІСТЬ

source: The B<fstrim> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<fstrim> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
fr: La commande B<fstrim> fait partie du paquet util-linux, qui peut être téléchargé de
uk: B<fstrim> є частиною пакунка util-linux, який можна отримати з

source: May 2019
de: Mai 2019
fr: mai 2019
uk: Травень 2019 року

source: B<fstrim> [B<-Aa>] [B<-o> I<offset>] [B<-l> I<length>] [B<-m> I<minimum-size>] [B<-v>] I<mountpoint>
de: B<fstrim> [B<-Aa>] [B<-o> I<Versatz>] [B<-l> I<Länge>] [B<-m> I<minimale-Größe>] [B<-v>] I<Einhängepunkt>
fr: B<fstrim> [B<-Aa>] [B<-o> I<position>] [B<-l> I<taille>] [B<-m> I<taille_mini>] [B<-v>] I<point_montage>
uk: B<fstrim> [B<-Aa>] [B<-o> I<відступ>] [B<-l> I<довжина>] [B<-m> I<мінімальний-розмір>] [B<-v>] I<точка-монтування>

source: B<fstrim> is used on a mounted filesystem to discard (or "trim") blocks which are not in use by the filesystem. This is useful for solid-state drives (SSDs) and thinly-provisioned storage.
de: B<fstrim> wird in eingehängten Dateisystemen verwendet, um in diesem Dateisystem nicht genutzte Blöcke zu verwerfen (zu »trimmen«). Dies ist nützlich bei Solid State Drives (SSDs) und Medien mit knappem Speicherplatz.
fr: B<fstrim> est utilisé sur un système de fichiers monté pour abandonner (ou « rogner ») les blocs qui ne sont pas utilisés par le système de fichiers. C'est pratique pour les SSD (« solid-state drive ») et l'allocation fine et dynamique (« thinly-provisioned storage »).
uk: B<fstrim> використовують на змонтованій файловій системі для відкидання (або «обрізання») блоків, які не використовуються у файловій системі. Це корисно для твердотільних дисків (SSD) та сховищ даних із тонким передбаченням.

source: By default, B<fstrim> will discard all unused blocks in the filesystem. Options may be used to modify this behavior based on range or size, as explained below.
de: Per Vorgabe verwirft B<fstrim> alle ungenutzten Blöcke im Dateisystem. Zum Anpassen des Verhaltens sind Optionen verfügbar, die auf Bereichen oder Größenangaben basieren, wie nachfolgend erläutert.
fr: Par défaut, B<fstrim> abandonnera tous les blocs non utilisés du système de fichiers. Les options permettent de modifier ce comportement en fonction d'intervalle ou de taille, conformément aux explications suivantes.
uk: Типово, B<fstrim> відкине усі невикористані блоки у файловій системі. Для внесення змін до цієї поведінки на основі даних щодо діапазону або розміру, як це описано нижче, можна скористатися параметрами.

source: Running B<fstrim> frequently, or even using B<mount -o discard>, might negatively affect the lifetime of poor-quality SSD devices. For most desktop and server systems a sufficient trimming frequency is once a week. Note that not all devices support a queued trim, so each trim command incurs a performance penalty on whatever else might be trying to use the disk at the time.
de: Die häufige Ausführung von B<fstrim> oder auch B<mount -o discard> kann die Lebensdauer qualitativ minderwertiger SSD-Geräte negativ beeinflussen. Eine für die meisten Arbeitsplatzrechner und Server sinnvolle Zeitspanne ist einmal pro Woche. Beachten Sie, dass nicht alle Geräte eine Verwerfungs-Warteschlange unterstützen, daher verursacht jeder Verwerfungsbefehl Leistungseinbußen bei allem, was zu dieser Zeit auf die Platte zugreift.
fr: Exécuter B<fstrim> fréquemment, ou même utiliser B<mount -o discard>, pourrait affecter négativement la durée de vie des périphériques SSD de mauvaise qualité. Pour la plupart des systèmes de bureau ou de serveur, la fréquence d’abandon suffisante est une fois par semaine. Remarquez que tous les périphériques ne permettent pas de mettre en attente les abandons, donc chaque commande d’abandon pénalise les performances de tout ce qui pourrait être en train d’essayer d’utiliser le disque en même temps.
uk: Частий запуск B<fstrim> або навіть використання B<mount -o discard> може негативно вплинути на строк експлуатації низькоякісних пристроїв SSD. Для більшості систем робочих станцій та серверів достатньою частотою обрізання є одне обрізання на тиждень. Зауважте, що підтримку обрізання за чергою передбачено не для усіх пристроїв, тому кожна команда обрізання передбачає штраф на швидкодію будь-яких інших спроб одночасного використання диска.

source: Trim all mounted filesystems mentioned in I</etc/fstab> on devices that support the discard operation. The root filesystem is determined from kernel command line if missing in the file. The other supplied options, like B<--offset>, B<--length> and B<--minimum>, are applied to all these devices. Errors from filesystems that do not support the discard operation, read-only devices and read-only filesystems are silently ignored.
de: »trimmt« alle in I</etc/fstab> erwähnten eingehängten Dateisysteme auf Geräten, die den Verwerfungsvorgang unterstützen. Das Wurzeldateisystem wird aus der Kernel-Befehlszeile ermittelt, falls diese Information in der Datei fehlt. Weiter übergebene Optionen, wie B<--offset>, B<--length> und B<--minimum>, werden auf alle diese Geräte angewendet. Fehlermeldungen von Dateisystemen, die den Verwerfungsvorgang nicht unterstützen, werden stillschweigend ignoriert.
fr: Rogner tous les systèmes de fichiers mentionnés dans I</etc/fstab> montés sur les périphériques qui permettent l’opération d’abandon. Le système de fichiers racine est déterminé à partir de la ligne de commande du noyau s’il n’est pas indiqué dans le fichier. Les autres options fournies, comme B<--offset>, B<--length> et B<--minimum> sont appliquées à tous ces périphériques. Les erreurs des systèmes de fichiers qui ne permettent pas l’opération d’abandon sont ignorées silencieusement.
uk: Обрізати усі змонтовані файлові системи в I</etc/fstab> на пристроях, де передбачено підтримку операції відкидання. Кореневу файлову систему буде визначено з командного рядка ядра, якщо її запису немає у файлі. До усіх цих пристроїв буде застосовано інші надані параметри, зокрема B<--offset>, B<--length> і B<--minimum>. Помилки від файлових систем, де не передбачено підтримки дії з відкидання, пристроїв, які призначено лише для читання, та файлових систем, які призначено лише для читання, буде без повідомлень проігноровано.

source: Trim all mounted filesystems on devices that support the discard operation. The other supplied options, like B<--offset>, B<--length> and B<--minimum>, are applied to all these devices. Errors from filesystems that do not support the discard operation, read-only devices and read-only filesystems are silently ignored.
de: »trimmt« alle eingehängten Dateisysteme auf Geräten, die den Verwerfungsvorgang unterstützen. weiter übergebene Optionen, wie B<--offset>, B<--length> und B<--minimum>, werden auf alle diese Geräte angewendet. Fehlermeldungen von Dateisystemen, die den Verwerfungsvorgang nicht unterstützen, sowie von schreibgeschützten Geräten und Dateisystemen werden stillschweigend ignoriert.
fr: Rogner tous les systèmes de fichiers montés sur les périphériques qui permettent l’opération d’abandon. Les autres options fournies, comme B<--offset>, B<--length> et B<--minimum> sont appliquées à tous ces périphériques. Les erreurs des systèmes de fichiers qui ne permettent pas l’opération d’abandon, les périphériques en lecture seule et les systèmes de fichiers en lecture seule sont ignorées silencieusement.
uk: Обрізати усі змонтовані файлові системи на пристроях, де передбачено підтримку операції відкидання. До усіх цих пристроїв буде застосовано інші надані параметри, зокрема B<--offset>, B<--length> і B<--minimum>. Помилки від файлових систем, де не передбачено підтримки дії з відкидання, пристроїв, які призначено лише для читання, та файлових систем, які призначено лише для читання, буде без повідомлень проігноровано.

source: This option does everything apart from actually call FITRIM ioctl.
de: Diese Option macht alles außer dem eigentlichen Aufruf des FITRIM-Ioctl.
fr: Cette option permet de tout faire, sauf d’appeler réellement l’ioctl FITRIM.
uk: Використання цього параметра призводить до виконання програмою усіх дій, окрім самого виклику керування введенням-виведенням B<FITRIM>.

source: Byte offset in the filesystem from which to begin searching for free blocks to discard. The default value is zero, starting at the beginning of the filesystem.
de: gibt den Byte-Versatz im Dateisystem an, an dem nach zu verwerfenden freien Blöcken gesucht werden soll. Vorgabewert ist 0, beginnend am Anfang des Dateisystems.
fr: La I<position> en octet dans le système de fichiers à partir de laquelle commencer à chercher les blocs libres à abandonner. La valeur par défaut est zéro, désignant le début du système de fichiers.
uk: Відступ у байтах у файловій системі, з якого слід починати пошук вільних блоків для відкидання. Типовим є нульове значення, тобто початок файлової системи.

source: The number of bytes (after the starting point) to search for free blocks to discard. If the specified value extends past the end of the filesystem, B<fstrim> will stop at the filesystem size boundary. The default value extends to the end of the filesystem.
de: gibt die Anzahl der Bytes nach der Startposition für die Suche nach zu verwerfenden freien Blöcken an. Falls der angegebene Wert hinter dem Ende des Dateisystems liegt, stoppt B<fstrim> an den Dateisystemgrenzen. Der Vorgabewert nimmt das Ende des Dateisystems an.
fr: Le nombre d'octets (après le point de départ) où chercher des blocs libres à abandonner. Si la valeur indiquée va au-delà de la fin du système de fichiers, B<fstrim> s'arrêtera à la frontière de taille du système de fichiers. La valeur par défaut prolonge la recherche jusqu'à la fin du système de fichiers.
uk: Кількість байтів (після початкової точки) для пошуку вільних блоків для відкидання. Якщо вказане значення потрапить за кінець файлової системи, B<fstrim> зупиниться на межі файлової системи. Типовим значенням аргументу є кінець файлової системи.

source: Specifies a colon-separated list of files in fstab or kernel mountinfo format. All missing or empty files are silently ignored. The evaluation of the I<list> stops after first non-empty file. For example: B<--listed-in /etc/fstab:/proc/self/mountinfo>.
de: gibt eine durch Doppelpunkte getrennte Liste im Fstab-Format oder im Mountinfo-Format des Kernels an. Alle fehlenden oder leeren Dateien werden stillschweigend ignoriert. Die Erweiterung der I<Liste> endet mit dem Erscheinen der ersten nicht-leeren Datei. Zum Beispiel: B<--listed-in /etc/fstab:/proc/self/mountinfo>.
fr: Indiquer une liste de fichiers séparés par des deux-points dans le format mountinfo du noyau ou de fstab. Tous les fichiers manquants ou vides sont ignorés silencieusement. L’évaluation de la I<liste> s’arrête après le premier fichier non vide. Par exemple, B<--listed-in /etc/fstab:/proc/self/mountinfo>.
uk: Визначає список відокремлених двокрапками назв файлів у форматі fstab або mountinfo ядра. Усі файли, яких не буде знайдено, або порожні файли буде без повідомлень проігноровано. Обробку I<списку> буде зупинено після виявлення першого непорожнього файла. Приклад: B<--listed-in /etc/fstab:/proc/self/mountinfo>.

source: Minimum contiguous free range to discard, in bytes. (This value is internally rounded up to a multiple of the filesystem block size.) Free ranges smaller than this will be ignored and fstrim will adjust the minimum if it's smaller than the device's minimum, and report that (fstrim_range.minlen) back to userspace. By increasing this value, the fstrim operation will complete more quickly for filesystems with badly fragmented freespace, although not all blocks will be discarded. The default value is zero, discarding every free block.
de: gibt den minimalen freien zu verwerfenden Bereich in Bytes an. Dieser Wert wird intern auf ein Vielfaches der Blockgröße des Dateisystems gerundet. Kleinere freie Bereiche werden ignoriert und B<fstrim> wird das Minimum anpassen, falls es kleiner als das Minimum des Gerätes ist und dies (fstrim_range.minlen) zur Anwendungsebene zurückmelden. Durch Erhöhen dieses Wertes wird die B<fstrim>-Operation auf Dateisystemen mit stark fragmentierten freien Bereichen schneller vonstatten gehen, andererseits werden nicht alle Blöcke verworfen. Der Vorgabewert ist 0, wodurch alle freien Blöcke verworfen werden.
fr: L'intervalle libre contigu minimal à abandonner, en octet (cette valeur est arrondie en interne à un multiple de la taille de bloc du système de fichiers). Les intervalles libres plus petits que cela seront ignorés et B<fstrim> ajustera la valeur minimale si elle est plus petite que le minimum du périphérique et le rapportera (fstrim_range.minlen) dans l’espace utilisateur. En augmentant cette valeur, l'opération B<fstrim> se terminera plus rapidement pour les systèmes de fichiers avec des espaces libres mal fragmentés, même si tous les blocs libres ne sont pas abandonnés. La valeur par défaut est zéro, pour abandonner tous les blocs libres.
uk: Мінімальний неперервний вільний діапазон, який можна відкинути, у байтах. (Це значення на внутрішньому рівні буде округлено до кратного до розміру блоку файлової системи.) Менші за розміром вільні діапазони буде проігноровано, а B<fstrim> скоригує мінімальне значення, якщо воно менше за мінімальне значення для пристрою, і повідомить це значення (fstrim_range.minlen) у простір користувача. Якщо збільшити це значення, завершення роботи B<fstrim> буде швидшим у файлових системах і дуже фрагментованим вільним простором, хоча при цьому не усі блоки буде відкинуто. Типовим є нульове значення, за якого буде відкинуто усі вільні блоки.

source: Verbose execution. With this option B<fstrim> will output the number of bytes passed from the filesystem down the block stack to the device for potential discard. This number is a maximum discard amount from the storage device's perspective, because I<FITRIM> ioctl called repeated will keep sending the same sectors for discard repeatedly.
de: gibt ausführliche Meldungen aus. Falls angegeben, gibt B<fstrim> die Anzahl der Bytes aus, die vom Dateisystem als potenzielle Blöcke zum Verwerfen gemeldet werden. Diese Anzahl ist die maximal zu verwerfende Menge aus der Sicht des Speichergerätes, da I<FITRIM> ioctl wiederholt aufgerufen wird und dadurch die gleichen zu verwerfenden Sektoren mehrfach ausgegeben werden.
fr: Exécution détaillée. Avec cette option, B<fstrim> affichera le nombre d'octets transmis du système de fichiers par la pile de bloc vers le périphérique pour abandon éventuel. Ce nombre est un montant maximal d'abandon d'un point de vue du périphérique de stockage, parce que l'ioctl I<FITRIM> appelé plusieurs fois continuera à répéter l'envoi des mêmes secteurs pour abandon.
uk: Режим докладних повідомлень. Якщо вказано цей параметр, B<fstrim> виводитиме дані щодо кількості переданих зі стосу блоків файлової системи байтів до пристрою для потенційного відкидання. Це число буде максимальною величиною відкидання з точки зору пристрою для зберігання даних, оскільки повторний виклик керування введенням-виведенням I<FITRIM> продовжуватиме повторно надсилати ті самі сектори для відкидання.

source: B<fstrim> will report the same potential discard bytes each time, but only sectors which had been written to between the discards would actually be discarded by the storage device. Further, the kernel block layer reserves the right to adjust the discard ranges to fit raid stripe geometry, non-trim capable devices in a LVM setup, etc. These reductions would not be reflected in fstrim_range.len (the B<--length> option).
de: B<fstrim> meldet jedes Mal die gleichen potenziell zu verwerfenden Bytes, aber es werden nur Sektoren des Speichergerätes tatsächlich verworfen, die zwischenzeitlich beschrieben worden sind. Weiterhin behält sich die Block-Ebene des Kernels vor, die zu verwerfenden Bereiche anzupassen, damit sie in die Stripe-Geometrie des Raids passen und nicht-trimmfähigen Geräten in einer LVM-Umgebung gerecht zu werden. Diese Beschränkungen werden in fstrim_range.len (der Option B<--length>) nicht reflektiert.
fr: B<fstrim> signalera à chaque fois les mêmes octets à abandonner, mais seuls les secteurs sur lesquels une écriture a eu lieu entre les abandons seront vraiment abandonnés par le périphérique de stockage. De plus, la couche bloc du noyau se réserve le droit d'ajuster les intervalles d'abandon pour s'ajuster à la géométrie des bandes RAID, aux périphériques ne pouvant pas être rognés dans une configuration LVM, etc. Ces réductions ne seront pas reflétées par fstrim_range.len (l'option B<--length>).
uk: B<fstrim> повідомлятиме про ті самі потенційно відкинуті байти кожного разу, але насправді пристроєм для зберігання даних буде відкинуто лише ті сектори, до яких між викликами команди відкидання було записано дані. Крім того, шар блоків ядра резервуватиме право скоригувати діапазони відкидання так, щоб вони відповідали геометрії смуги RAID, пристроям у конфігурації LVM, для яких не передбачено обрізання, тощо. Ці спрощення не буде відтворено у fstrim_range.len (параметр B<--length>).

source: Suppress error messages if trim operation (ioctl) is unsupported. This option is meant to be used in systemd service file or in cron scripts to hide warnings that are result of known problems, such as NTFS driver reporting I<Bad file descriptor> when device is mounted read-only, or lack of file system support for ioctl FITRIM call.
de: unterdrückt Fehlermeldungen, falls der Trimm-Vorgang (Ioctl) nicht unterstützt wird. Diese Option ist für die Verwendung in Systemd-Dienstedateien oder Cron-Skripten gedacht, um dort Warnungen zu unterdrücken, die auf bekannten Problemen beruhen, wie beispielsweise die Meldung I<Bad file descriptor> des NFS-Treibers, wenn ein Gerät schreibgeschützt eingehängt ist, oder die fehlende Dateisystemunterstützung beim FITRIM-Ioctl-Aufruf.
fr: Supprimer les messages d’erreur si l’opération de rognage (ioctl) n’est pas gérée. Cette option est destinée à une utilisation dans un fichier de service systemd ou dans des scripts cron pour cacher les avertissements qui sont le résultat de problèmes connus, tels que le pilote NTFS signalant I<Mauvais descripteur de fichier> lorsque le périphérique est monté en lecture seule ou l’absence de prise en charge du système de fichiers de l’appel de l’ioctl FITRIM.
uk: Придушити повідомлення про помилки, якщо підтримки дії з обрізання (ioctl) не передбачено. Цей параметр слід використовувати у файлі служби B<systemd> або у скриптах B<cron>(8) для приховування попереджень, які є результатом відомих проблем, зокрема того, що драйвер NTFS надсилає повідомлення I<Помилковий дескриптор файла>, якщо пристрій змонтовано у режимі «лише читання», або того, що у файловій системі не передбачено підтримки виклику керування введенням-виведенням I<FITRIM>.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
fr: Afficher les informations de version et quitter.
uk: Вивести дані щодо версії і завершити роботу.

source: The fstrim command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl fstrim ist Teil des Pakets util-linux und kann von https://www.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
fr: La commande B<fstrim> fait partie du paquet util-linux, elle est disponible sur E<lt>I<https://www.kernel.org/pub/linux/utils/util-linux/>E<gt>.
uk: Програма fstrim є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Trim all mounted filesystems mentioned in I</etc/fstab> on devices that support the discard operation. The root filesystem is determined from kernel command line if missing in the file. The other supplied options, like B<--offset>, B<--length> and B<--minimum>, are applied to all these devices. Errors from filesystems that do not support the discard operation, read-only devices and read-only filesystems are silently ignored.
de: »trimmt« alle in I</etc/fstab> erwähnten eingehängten Dateisysteme auf Geräten, die den Verwerfungsvorgang unterstützen. Das Wurzeldateisystem wird aus der Kernel-Befehlszeile ermittelt, falls diese Information in der Datei fehlt. Weiter übergebene Optionen, wie B<--offset>, B<--length> und B<--minimum>, werden auf alle diese Geräte angewendet. Fehlermeldungen von Dateisystemen, die den Verwerfungsvorgang nicht unterstützen, werden stillschweigend ignoriert.
fr: Rogner tous les systèmes de fichiers mentionnés dans I</etc/fstab> montés sur les périphériques qui permettent l’opération d’abandon. Le système de fichiers racine est déterminé à partir de la ligne de commande du noyau s’il n’est pas indiqué dans le fichier. Les autres options fournies, comme B<--offset>, B<--length> et B<--minimum> sont appliquées à tous ces périphériques. Les erreurs des systèmes de fichiers qui ne permettent pas l’opération d’abandon sont ignorées silencieusement.
uk: Обрізати усі змонтовані файлові системи в I</etc/fstab> на пристроях, де передбачено підтримку операції відкидання. Кореневу файлову систему буде визначено з командного рядка ядра, якщо її запису немає у файлі. До усіх цих пристроїв буде застосовано інші надані параметри, зокрема B<--offset>, B<--length> і B<--minimum>. Помилки від файлових систем, де не передбачено підтримки дії з відкидання, пристроїв, які призначено лише для читання, та файлових систем, які призначено лише для читання, буде без повідомлень проігноровано.
