Repository: sebras/manpages-l10n
Catalog: po/*/man8/fstrim.8.po
Languages: de, fr, uk

source: Minimum contiguous free range to discard, in bytes. (This value is internally rounded up to a multiple of the filesystem block size.) Free ranges smaller than this will be ignored and fstrim will adjust the minimum if it\(cqs smaller than the device\(cqs minimum, and report that (fstrim_range.minlen) back to userspace. By increasing this value, the fstrim operation will complete more quickly for filesystems with badly fragmented freespace, although not all blocks will be discarded. The default value is zero, discarding every free block.
de: gibt den minimalen freien zu verwerfenden Bereich in Bytes an. Dieser Wert wird intern auf ein Vielfaches der Blockgröße des Dateisystems gerundet. Kleinere freie Bereiche werden ignoriert und B<fstrim> wird das Minimum anpassen, falls es kleiner als das Minimum des Gerätes ist und dies (fstrim_range.minlen) zur Anwendungsebene zurückmelden. Durch Erhöhen dieses Wertes wird die B<fstrim>-Operation auf Dateisystemen mit stark fragmentierten freien Bereichen schneller vonstatten gehen, andererseits werden nicht alle Blöcke verworfen. Der Vorgabewert ist 0, wodurch alle freien Blöcke verworfen werden.
fr: L'intervalle libre contigu minimal à abandonner, en octet (cette valeur est arrondie en interne à un multiple de la taille de bloc du système de fichiers). Les intervalles libres plus petits que cela seront ignorés et B<fstrim> ajustera la valeur minimale si elle est plus petite que le minimum du périphérique et le rapportera (fstrim_range.minlen) dans l’espace utilisateur. En augmentant cette valeur, l'opération B<fstrim> se terminera plus rapidement pour les systèmes de fichiers avec des espaces libres mal fragmentés, même si tous les blocs libres ne sont pas abandonnés. La valeur par défaut est zéro, pour abandonner tous les blocs libres.
uk: Мінімальний неперервний вільний діапазон, який можна відкинути, у байтах. (Це значення на внутрішньому рівні буде округлено до кратного до розміру блоку файлової системи.) Менші за розміром вільні діапазони буде проігноровано, а B<fstrim> скоригує мінімальне значення, якщо воно менше за мінімальне значення для пристрою, і повідомить це значення (fstrim_range.minlen) у простір користувача. Якщо збільшити це значення, завершення роботи B<fstrim> буде швидшим у файлових системах і дуже фрагментованим вільним простором, хоча при цьому не усі блоки буде відкинуто. Типовим є нульове значення, за якого буде відкинуто усі вільні блоки.

source: Suppress error messages if trim operation (ioctl) is unsupported. This option is meant to be used in systemd service file or in cron scripts to hide warnings that are result of known problems, such as NTFS driver reporting I<Bad file descriptor> when device is mounted read-only, or lack of file system support for ioctl FITRIM call. This option also cleans exit status when unsupported filesystem specified on fstrim command line.
de: unterdrückt Fehlermeldungen, falls der Trimm-Vorgang (Ioctl) nicht unterstützt wird. Diese Option ist für die Verwendung in Systemd-Dienstedateien oder Cron-Skripten gedacht, um dort Warnungen zu unterdrücken, die auf bekannten Problemen beruhen, wie beispielsweise die Meldung I<Bad file descriptor> des NFS-Treibers, wenn ein Gerät schreibgeschützt eingehängt ist, oder die fehlende Dateisystemunterstützung beim FITRIM-Ioctl-Aufruf. Diese Option leert den Exit-Status, wenn in der Befehlszeile von B<fstrim> ein nicht unterstütztes Dateisystem übergeben wird.
fr: Supprimer les messages d’erreur si l’opération de rognage (ioctl) n’est pas gérée. Cette option est destinée à une utilisation dans un fichier de service systemd ou dans des scripts cron pour cacher les avertissements qui sont le résultat de problèmes connus, tels que le pilote NTFS signalant I<Mauvais descripteur de fichier> lorsque le périphérique est monté en lecture seule ou l’absence de prise en charge du système de fichiers de l’appel de l’ioctl FITRIM. Cette option nettoie aussi le code de retour quand un système de fichiers non pris en charge est spécifié sur la ligne de commande de B<fstrim>.
uk: Придушити повідомлення про помилки, якщо підтримки дії з обрізання (ioctl) не передбачено. Цей параметр слід використовувати у файлі служби B<systemd> або у скриптах B<cron>(8) для приховування попереджень, які є результатом відомих проблем, зокрема того, що драйвер NTFS надсилає повідомлення I<Помилковий дескриптор файла>, якщо пристрій змонтовано у режимі «лише читання», або того, що у файловій системі не передбачено підтримки виклику керування введенням-виведенням I<FITRIM>. Використання цього параметра також знімає ненульовий стан виходу, якщо у рядку команди B<fstrim> вказано непідтримувану файлову систему.

source: B<-A, --fstab>
fr: B<-A>, B<--fstab>

source: B<-v, --verbose>
fr: B<-v>, B<--verbose>

source: Lukas Czerner E<lt>lczerner@redhat.comE<gt> Karel Zak E<lt>kzak@redhat.comE<gt>
fr: Lukas Czerner E<lt>I<lczerner@redhat.com>E<gt> Karel Zak E<lt>I<kzak@redhat.com>E<gt>
