Repository: sebras/manpages-l10n
Catalog: po/*/man8/fstrim.8.po
Languages: de, fr, uk

source: System Administration
fr: Administration Système
uk: Керування системою

source: NAME
de: BEZEICHNUNG
fr: NOM
uk: НАЗВА

source: fstrim - discard unused blocks on a mounted filesystem
de: fstrim - ungenutzte Blöcke in einem eingehängten Dateisystem verwerfen
fr: fstrim – Abandonner les blocs non utilisés d'un système de fichiers monté
uk: fstrim — відкидання невикористаних блоків на змонтованій файловій системі

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<fstrim> [B<-Aa>] [B<-o> I<offset>] [B<-l> I<length>] [B<-m> I<minimum-size>] [B<-v> I<mountpoint>]
de: B<fstrim> [B<-Aa>] [B<-o> I<Versatz>] [B<-l> I<Länge>] [B<-m> I<minimale-Größe>] [B<-v> I<Einhängepunkt>]
fr: B<fstrim> [B<-Aa>] [B<-o> I<position>] [B<-l> I<taille>] [B<-m> I<taille_mini> [B<-v>] I<point_montage>]
uk: B<fstrim> [B<-Aa>] [B<-o> I<відступ>] [B<-l> I<довжина>] [B<-m> I<мінімальний-розмір>] [B<-v> I<точка-монтування>]

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: B<fstrim> is used on a mounted filesystem to discard (or "trim") blocks which are not in use by the filesystem. This is useful for solid-state drives (SSDs) and thinly-provisioned storage.
de: B<fstrim> wird in eingehängten Dateisystemen verwendet, um in diesem Dateisystem nicht genutzte Blöcke zu verwerfen (zu »trimmen«). Dies ist nützlich bei Solid State Drives (SSDs) und Medien mit knappem Speicherplatz.
fr: B<fstrim> est utilisé sur un système de fichiers monté pour abandonner (ou « rogner ») les blocs qui ne sont pas utilisés par le système de fichiers. C'est pratique pour les SSD (« solid-state drive ») et l'allocation fine et dynamique (« thinly-provisioned storage »).
uk: B<fstrim> використовують на змонтованій файловій системі для відкидання (або «обрізання») блоків, які не використовуються у файловій системі. Це корисно для твердотільних дисків (SSD) та сховищ даних із тонким передбаченням.

source: By default, B<fstrim> will discard all unused blocks in the filesystem. Options may be used to modify this behavior based on range or size, as explained below.
de: Per Vorgabe verwirft B<fstrim> alle ungenutzten Blöcke im Dateisystem. Zum Anpassen des Verhaltens sind Optionen verfügbar, die auf Bereichen oder Größenangaben basieren, wie nachfolgend erläutert.
fr: Par défaut, B<fstrim> abandonnera tous les blocs non utilisés du système de fichiers. Les options permettent de modifier ce comportement en fonction d'intervalle ou de taille, conformément aux explications suivantes.
uk: Типово, B<fstrim> відкине усі невикористані блоки у файловій системі. Для внесення змін до цієї поведінки на основі даних щодо діапазону або розміру, як це описано нижче, можна скористатися параметрами.

source: The I<mountpoint> argument is the pathname of the directory where the filesystem is mounted.
de: Das Argument I<Einhängepunkt> bezeichnet den Pfadnamen des Verzeichnisses, in dem das Dateisystem eingehängt ist.
fr: Le paramètre I<point_montage> est le chemin du répertoire où le système de fichiers est monté.
uk: Значенням аргументу I<точка-монтування> має бути шлях до каталогу, куди змонтовано файлову систему.

source: Running B<fstrim> frequently, or even using B<mount -o discard>, might negatively affect the lifetime of poor-quality SSD devices. For most desktop and server systems a sufficient trimming frequency is once a week. Note that not all devices support a queued trim, so each trim command incurs a performance penalty on whatever else might be trying to use the disk at the time.
de: Die häufige Ausführung von B<fstrim> oder auch B<mount -o discard> kann die Lebensdauer qualitativ minderwertiger SSD-Geräte negativ beeinflussen. Eine für die meisten Arbeitsplatzrechner und Server sinnvolle Zeitspanne ist einmal pro Woche. Beachten Sie, dass nicht alle Geräte eine Verwerfungs-Warteschlange unterstützen, daher verursacht jeder Verwerfungsbefehl Leistungseinbußen bei allem, was zu dieser Zeit auf die Platte zugreift.
fr: Exécuter B<fstrim> fréquemment, ou même utiliser B<mount -o discard>, pourrait affecter négativement la durée de vie des périphériques SSD de mauvaise qualité. Pour la plupart des systèmes de bureau ou de serveur, la fréquence d’abandon suffisante est une fois par semaine. Remarquez que tous les périphériques ne permettent pas de mettre en attente les abandons, donc chaque commande d’abandon pénalise les performances de tout ce qui pourrait être en train d’essayer d’utiliser le disque en même temps.
uk: Частий запуск B<fstrim> або навіть використання B<mount -o discard> може негативно вплинути на строк експлуатації низькоякісних пристроїв SSD. Для більшості систем робочих станцій та серверів достатньою частотою обрізання є одне обрізання на тиждень. Зауважте, що підтримку обрізання за чергою передбачено не для усіх пристроїв, тому кожна команда обрізання передбачає штраф на швидкодію будь-яких інших спроб одночасного використання диска.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: The I<offset>, I<length>, and I<minimum-size> arguments may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB") or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB.
de: Auf die Argumente I<Versatz>, I<Länge> und I<minimaler-freier-Bereich> können die Binärsuffixe (2^N) KiB (=1024), MiB (=1024*1024) und so weiter für GiB, TiB, PiB, EiB, ZiB und YiB folgen (das »iB« ist optional, so dass zum Beispiel »K« gleichbedeutend mit »KiB« ist) oder die Dezimalsuffixe KB (=1000), MB (=1000*1000) und so weiter für GB, TB, PB, EB, ZB und YB.
fr: Les arguments I<position>, I<taille> et I<taille_mini> peuvent être suivis des suffixes multiplicatifs KiB=1024, MiB=1024*1024, etc., pour GiB, TiB, PiB, EiB, ZiB et YiB (la partie « iB » est facultative, par exemple « K » est identique à « KiB ») ou des suffixes KB=1000, MB=1000*1000, etc., pour GB, TB, PB, EB, ZB et YB.
uk: Після аргументів I<відступ>, I<довжина_ і _мнімальний-розмір> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB.

source: Trim all mounted filesystems mentioned in I</etc/fstab> on devices that support the discard operation. The root filesystem is determined from kernel command line if missing in the file. The other supplied options, like B<--offset>, B<--length> and B<--minimum>, are applied to all these devices. Errors from filesystems that do not support the discard operation, read-only devices, autofs and read-only filesystems are silently ignored. Filesystems with "X-fstrim.notrim" mount option are skipped.
de: »trimmt« alle in I</etc/fstab> erwähnten eingehängten Dateisysteme auf Geräten, die den Verwerfungsvorgang unterstützen. Das Wurzeldateisystem wird aus der Kernel-Befehlszeile ermittelt, falls diese Information in der Datei fehlt. Weitere übergebene Optionen, wie B<--offset>, B<--length> und B<--minimum>, werden auf alle diese Geräte angewendet. Fehlermeldungen von Dateisystemen, die den Verwerfungsvorgang nicht unterstützen, von schreibgeschützten Geräten, autofs und schreibgeschützten Dateisystemen werden stillschweigend ignoriert. Dateisysteme mit der Einhängeoption »X-fstrim.notrim« werden übersprungen.
fr: Rogner tous les systèmes de fichiers mentionnés dans I</etc/fstab> montés sur les périphériques qui permettent l’opération d’abandon. Le système de fichiers racine est déterminé à partir de la ligne de commande du noyau s’il n’est pas indiqué dans le fichier. Les autres options fournies, comme B<--offset>, B<--length> et B<--minimum> sont appliquées à tous ces périphériques. Les erreurs des systèmes de fichiers qui ne permettent pas l’opération d’abandon sont ignorées silencieusement. Les systèmes de fichiers avec l'option de montage « X-fstrim.notrim » sont sautés.
uk: Обрізати усі змонтовані файлові системи в I</etc/fstab> на пристроях, де передбачено підтримку операції відкидання. Кореневу файлову систему буде визначено з командного рядка ядра, якщо її запису немає у файлі. До усіх цих пристроїв буде застосовано інші надані параметри, зокрема B<--offset>, B<--length> і B<--minimum>. Помилки від файлових систем, де не передбачено підтримки дії з відкидання, пристроїв, які призначено лише для читання, autofs та файлових систем, які призначено лише для читання, буде без повідомлень проігноровано. Файлові системи з параметром монтування «X-fstrim.notrim», буде пропущено.

source: B<-a, --all>
uk: B<-a>, B<--all>

source: Trim all mounted filesystems on devices that support the discard operation. The other supplied options, like B<--offset>, B<--length> and B<--minimum>, are applied to all these devices. Errors from filesystems that do not support the discard operation, read-only devices and read-only filesystems are silently ignored.
de: »trimmt« alle eingehängten Dateisysteme auf Geräten, die den Verwerfungsvorgang unterstützen. weiter übergebene Optionen, wie B<--offset>, B<--length> und B<--minimum>, werden auf alle diese Geräte angewendet. Fehlermeldungen von Dateisystemen, die den Verwerfungsvorgang nicht unterstützen, sowie von schreibgeschützten Geräten und Dateisystemen werden stillschweigend ignoriert.
fr: Rogner tous les systèmes de fichiers montés sur les périphériques qui permettent l’opération d’abandon. Les autres options fournies, comme B<--offset>, B<--length> et B<--minimum> sont appliquées à tous ces périphériques. Les erreurs des systèmes de fichiers qui ne permettent pas l’opération d’abandon, les périphériques en lecture seule et les systèmes de fichiers en lecture seule sont ignorées silencieusement.
uk: Обрізати усі змонтовані файлові системи на пристроях, де передбачено підтримку операції відкидання. До усіх цих пристроїв буде застосовано інші надані параметри, зокрема B<--offset>, B<--length> і B<--minimum>. Помилки від файлових систем, де не передбачено підтримки дії з відкидання, пристроїв, які призначено лише для читання, та файлових систем, які призначено лише для читання, буде без повідомлень проігноровано.

source: B<-n, --dry-run>
fr: B<-n>, B<--dry-run>
uk: B<-n>, B<--dry-run>

source: This option does everything apart from actually call B<FITRIM> ioctl.
de: Diese Option macht alles außer dem eigentlichen Aufruf des B<FITRIM>-Ioctl.
fr: Cette option permet de tout faire, sauf d’appeler réellement l’ioctl B<FITRIM>.
uk: Використання цього параметра призводить до виконання програмою усіх дій, окрім самого виклику керування введенням-виведенням B<FITRIM>.

source: B<-o, --offset> I<offset>
de: B<-o, --offset> I<Versatz>
fr: B<-o>, B<--offset> I<position>
uk: B<-o>, B<--offset> I<відступ>

source: Byte offset in the filesystem from which to begin searching for free blocks to discard. The default value is zero, starting at the beginning of the filesystem.
de: gibt den Byte-Versatz im Dateisystem an, an dem nach zu verwerfenden freien Blöcken gesucht werden soll. Vorgabewert ist 0, beginnend am Anfang des Dateisystems.
fr: La I<position> en octet dans le système de fichiers à partir de laquelle commencer à chercher les blocs libres à abandonner. La valeur par défaut est zéro, désignant le début du système de fichiers.
uk: Відступ у байтах у файловій системі, з якого слід починати пошук вільних блоків для відкидання. Типовим є нульове значення, тобто початок файлової системи.

source: B<-l, --length> I<length>
de: B<-l, --length> I<Länge>
fr: B<-l>, B<--length> I<taille>
uk: B<-l>, B<--length> I<довжина>

source: The number of bytes (after the starting point) to search for free blocks to discard. If the specified value extends past the end of the filesystem, B<fstrim> will stop at the filesystem size boundary. The default value extends to the end of the filesystem.
de: gibt die Anzahl der Bytes nach der Startposition für die Suche nach zu verwerfenden freien Blöcken an. Falls der angegebene Wert hinter dem Ende des Dateisystems liegt, stoppt B<fstrim> an den Dateisystemgrenzen. Der Vorgabewert nimmt das Ende des Dateisystems an.
fr: Le nombre d'octets (après le point de départ) où chercher des blocs libres à abandonner. Si la valeur indiquée va au-delà de la fin du système de fichiers, B<fstrim> s'arrêtera à la frontière de taille du système de fichiers. La valeur par défaut prolonge la recherche jusqu'à la fin du système de fichiers.
uk: Кількість байтів (після початкової точки) для пошуку вільних блоків для відкидання. Якщо вказане значення потрапить за кінець файлової системи, B<fstrim> зупиниться на межі файлової системи. Типовим значенням аргументу є кінець файлової системи.

source: B<-I, --listed-in> I<list>
de: B<-I, --listed-in> I<Liste>
fr: B<-I>, B<--listed-in> I<liste>
uk: B<-I, --listed-in> I<список>

source: Specifies a colon-separated list of files in fstab or kernel mountinfo format. All missing or empty files are silently ignored. The evaluation of the I<list> stops after first non-empty file. For example:
de: gibt eine durch Doppelpunkte getrennte Liste im Fstab-Format oder im Mountinfo-Format des Kernels an. Alle fehlenden oder leeren Dateien werden stillschweigend ignoriert. Die Erweiterung der I<Liste> endet mit dem Erscheinen der ersten nicht-leeren Datei. Zum Beispiel:
fr: Indiquer une liste de fichiers séparés par des deux-points dans le format mountinfo du noyau ou de fstab. Tous les fichiers manquants ou vides sont ignorés silencieusement. L’évaluation de la I<liste> s’arrête après le premier fichier non vide. Par exemple :
uk: Визначає список відокремлених двокрапками назв файлів у форматі fstab або mountinfo ядра. Усі файли, яких не буде знайдено, або порожні файли буде без повідомлень проігноровано. Обробку I<списку> буде зупинено після виявлення першого непорожнього файла. Приклад:

source: Filesystems with "X-fstrim.notrim" mount option in fstab are skipped.
de: Dateisysteme mit der Einhängeoption »X-fstrim.notrim« in der I<fstab> werden übersprungen.
fr: Les systèmes de fichiers avec l'option de montage « X-fstrim.notrim » sont sautés.
uk: Файлові системі із параметром монтування «X-fstrim.notrim» у fstab буде пропущено.

source: B<-m, --minimum> I<minimum-size>
de: B<-m, --minimum> I<minimale-Größe>
fr: B<-m>, B<--minimum> I<taille_mini>
uk: B<-m, --minimum> I<мінімальний-розмір>

source: Minimum contiguous free range to discard, in bytes. (This value is internally rounded up to a multiple of the filesystem block size.) Free ranges smaller than this will be ignored and B<fstrim> will adjust the minimum if it\(cqs smaller than the device\(cqs minimum, and report that (fstrim_range.minlen) back to userspace. By increasing this value, the B<fstrim> operation will complete more quickly for filesystems with badly fragmented freespace, although not all blocks will be discarded. The default value is zero, discarding every free block.
de: gibt den minimalen freien zu verwerfenden Bereich in Bytes an. Dieser Wert wird intern auf ein Vielfaches der Blockgröße des Dateisystems gerundet. Kleinere freie Bereiche werden ignoriert und B<fstrim> wird das Minimum anpassen, falls es kleiner als das Minimum des Gerätes ist und dies (fstrim_range.minlen) zur Anwendungsebene zurückmelden. Durch Erhöhen dieses Wertes wird die B<fstrim>-Operation auf Dateisystemen mit stark fragmentierten freien Bereichen schneller vonstatten gehen, andererseits werden nicht alle Blöcke verworfen. Der Vorgabewert ist 0, wodurch alle freien Blöcke verworfen werden.
fr: L'intervalle libre contigu minimal à abandonner, en octet (cette valeur est arrondie en interne à un multiple de la taille de bloc du système de fichiers). Les intervalles libres plus petits que cela seront ignorés et B<fstrim> ajustera la valeur minimale si elle est plus petite que le minimum du périphérique et le rapportera (fstrim_range.minlen) dans l’espace utilisateur. En augmentant cette valeur, l'opération B<fstrim> se terminera plus rapidement pour les systèmes de fichiers avec des espaces libres mal fragmentés, même si tous les blocs libres ne sont pas abandonnés. La valeur par défaut est zéro, pour abandonner tous les blocs libres.
uk: Мінімальний неперервний вільний діапазон, який можна відкинути, у байтах. (Це значення на внутрішньому рівні буде округлено до кратного до розміру блоку файлової системи.) Менші за розміром вільні діапазони буде проігноровано, а B<fstrim> скоригує мінімальне значення, якщо воно менше за мінімальне значення для пристрою, і повідомить це значення (fstrim_range.minlen) у простір користувача. Якщо збільшити це значення, завершення роботи B<fstrim> буде швидшим у файлових системах і дуже фрагментованим вільним простором, хоча при цьому не усі блоки буде відкинуто. Типовим є нульове значення, за якого буде відкинуто усі вільні блоки.

source: Verbose execution. With this option B<fstrim> will output the number of bytes passed from the filesystem down the block stack to the device for potential discard. This number is a maximum discard amount from the storage device\(cqs perspective, because I<FITRIM> ioctl called repeated will keep sending the same sectors for discard repeatedly.
de: gibt ausführliche Meldungen aus. Falls angegeben, gibt B<fstrim> die Anzahl der Bytes aus, die vom Dateisystem als potenzielle Blöcke zum Verwerfen gemeldet werden. Diese Anzahl ist die maximal zu verwerfende Menge aus der Sicht des Speichergerätes, da I<FITRIM> ioctl wiederholt aufgerufen wird und dadurch die gleichen zu verwerfenden Sektoren mehrfach ausgegeben werden.
fr: Exécution détaillée. Avec cette option, B<fstrim> affichera le nombre d'octets transmis du système de fichiers par la pile de bloc vers le périphérique pour abandon éventuel. Ce nombre est un montant maximal d'abandon d'un point de vue du périphérique de stockage, parce que l'ioctl I<FITRIM> appelé plusieurs fois continuera à répéter l'envoi des mêmes secteurs pour abandon.
uk: Режим докладних повідомлень. Якщо вказано цей параметр, B<fstrim> виводитиме дані щодо кількості переданих зі стосу блоків файлової системи байтів до пристрою для потенційного відкидання. Це число буде максимальною величиною відкидання з точки зору пристрою для зберігання даних, оскільки повторний виклик керування введенням-виведенням I<FITRIM> продовжуватиме повторно надсилати ті самі сектори для відкидання.

source: B<fstrim> will report the same potential discard bytes each time, but only sectors which had been written to between the discards would actually be discarded by the storage device. Further, the kernel block layer reserves the right to adjust the discard ranges to fit raid stripe geometry, non-trim capable devices in a LVM setup, etc. These reductions would not be reflected in fstrim_range.len (the B<--length> option).
de: B<fstrim> meldet jedes Mal die gleichen potenziell zu verwerfenden Bytes, aber es werden nur Sektoren des Speichergerätes tatsächlich verworfen, die zwischenzeitlich beschrieben worden sind. Weiterhin behält sich die Block-Ebene des Kernels vor, die zu verwerfenden Bereiche anzupassen, damit sie in die Stripe-Geometrie des Raids passen und nicht-trimmfähigen Geräten in einer LVM-Umgebung gerecht zu werden. Diese Beschränkungen werden in fstrim_range.len (der Option B<--length>) nicht reflektiert.
fr: B<fstrim> signalera à chaque fois les mêmes octets à abandonner, mais seuls les secteurs sur lesquels une écriture a eu lieu entre les abandons seront vraiment abandonnés par le périphérique de stockage. De plus, la couche bloc du noyau se réserve le droit d'ajuster les intervalles d'abandon pour s'ajuster à la géométrie des bandes RAID, aux périphériques ne pouvant pas être rognés dans une configuration LVM, etc. Ces réductions ne seront pas reflétées par fstrim_range.len (l'option B<--length>).
uk: B<fstrim> повідомлятиме про ті самі потенційно відкинуті байти кожного разу, але насправді пристроєм для зберігання даних буде відкинуто лише ті сектори, до яких між викликами команди відкидання було записано дані. Крім того, шар блоків ядра резервуватиме право скоригувати діапазони відкидання так, щоб вони відповідали геометрії смуги RAID, пристроям у конфігурації LVM, для яких не передбачено обрізання, тощо. Ці спрощення не буде відтворено у fstrim_range.len (параметр B<--length>).

source: Suppress error messages if trim operation (ioctl) is unsupported. This option is meant to be used in B<systemd> service file or in B<cron>(8) scripts to hide warnings that are result of known problems, such as NTFS driver reporting I<Bad file descriptor> when device is mounted read-only, or lack of file system support for ioctl I<FITRIM> call. This option also cleans exit status when unsupported filesystem specified on B<fstrim> command line.
de: unterdrückt Fehlermeldungen, falls der Trimm-Vorgang (Ioctl) nicht unterstützt wird. Diese Option ist für die Verwendung in B<systemd>-Dienstedateien oder B<cron>(8)-Skripten gedacht, um dort Warnungen zu unterdrücken, die auf bekannten Problemen beruhen, wie beispielsweise die Meldung I<Bad file descriptor> des NFS-Treibers, wenn ein Gerät schreibgeschützt eingehängt ist, oder die fehlende Dateisystemunterstützung beim I<FITRIM>-Ioctl-Aufruf. Diese Option leert den Exit-Status, wenn in der Befehlszeile von B<fstrim> ein nicht unterstütztes Dateisystem übergeben wird.
fr: Supprimer les messages d’erreur si l’opération de rognage (ioctl) n’est pas gérée. Cette option est destinée à une utilisation dans un fichier de service systemd ou dans des scripts cron pour cacher les avertissements qui sont le résultat de problèmes connus, tels que le pilote NTFS signalant I<Mauvais descripteur de fichier> lorsque le périphérique est monté en lecture seule ou l’absence de prise en charge du système de fichiers de l’appel de l’ioctl FITRIM. Cette option nettoie aussi le code de retour quand un système de fichiers non pris en charge est spécifié sur la ligne de commande de B<fstrim>.
uk: Придушити повідомлення про помилки, якщо підтримки дії з обрізання (ioctl) не передбачено. Цей параметр слід використовувати у файлі служби B<systemd> або у скриптах B<cron>(8) для приховування попереджень, які є результатом відомих проблем, зокрема того, що драйвер NTFS надсилає повідомлення I<Помилковий дескриптор файла>, якщо пристрій змонтовано у режимі «лише читання», або того, що у файловій системі не передбачено підтримки виклику керування введенням-виведенням I<FITRIM>. Використання цього параметра також знімає ненульовий стан виходу, якщо у рядку команди B<fstrim> вказано непідтримувану файлову систему.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
fr: Afficher l’aide-mémoire puis quitter.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: Version anzeigen und beenden.
fr: Afficher la version puis quitter.
uk: Вивести дані щодо версії і завершити роботу.

source: EXIT STATUS
fr: CODE DE RETOUR
uk: СТАН ВИХОДУ

source: success
de: Erfolg
fr: Succès.
uk: успіх

source: failure
de: Fehlschlag
fr: Échec.
uk: невдача

source: all failed
de: alle fehlgeschlagen
fr: Tout a échoué.
uk: помилки для усіх

source: some filesystem discards have succeeded, some failed
de: einige Verwerfungsvorgänge in Dateisystemen waren erfolgreich, einige sind fehlgeschlagen
fr: Certains abandons sur le système de fichiers ont réussi, d’autres ont échoués.
uk: для деяких файлових системі відкидання було успішним, а для деяких — ні
