Repository: sebras/manpages-l10n
Catalog: po/*/man8/grub2-set-password.8.po
Languages: de

source: Thu Jun 25 2015
de: Donnerstag, 24. Juni 2015

source: NAME
de: BEZEICHNUNG

source: B<grub-set-password> \(em Generate the user.cfg file containing the hashed grub bootloader password.
de: B<grub-set-password> \(em die Datei user.cfg anlegen, welche das gehashte Passwort des GRUB-Bootloaders enthält

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<grub-set-password> outputs the user.cfg file which contains the hashed GRUB bootloader password. This utility only supports configurations where there is a single root user.
de: B<grub-set-password> gibt die Datei user.cfg aus, welche das gehashte Passwort des GRUB-Bootloaders enthält. Dieses Dienstprogramm unterstützt nur Konfigurationen, in denen es einen einzelnen Root-Benutzer gibt.

source: The file has the format: GRUB2_PASSWORD=E<lt>I<hashed password>E<gt>.
de: Die Datei hat folgendes Format: GRUB2_PASSWORD=E<lt>I<gehashtes Passwort>E<gt>.

source: OPTIONS
de: OPTIONEN

source: Display program usage and exit.
de: Zeigt Hinweise zum Programmaufruf an und beendet das Programm.

source: Display the current version.
de: zeigt die aktuelle Version an.

source: -o, --output=E<lt>I<DIRECTORY>E<gt>
de: -o, --output=E<lt>I<VERZEICHNIS>E<gt>

source: Choose the file path to which user.cfg will be written.
de: wählt den Verzeichnispfad, in welchen die Datei user.cfg geschrieben wird.

source: SEE ALSO
de: SIEHE AUCH

source: May 2022
de: Mai 2022

source: The grub bootloader password may only be set by root.
de: Das Passwort für den Bootloader GRUB darf nur durch Root gesetzt werden.

source: System Administration Utilities
de: Systemverwaltungswerkzeuge

source: grub-set-password - generate the user.cfg file containing the hashed grub bootloader password
de: grub-set-password - die Datei user.cfg anlegen, welche das gehashte Passwort des GRUB-Bootloaders enthält

source: \&./grub-set-password prompts the user to set a password on the grub bootloader. The password is written to a file named user.cfg which lives in the GRUB directory located by default at I<\,/boot/grub2\/>.
de: B<grub-set-password> erbittet vom Benutzer das Setzen eines Passworts für den Bootloader GRUB. Das Passwort wird in eine Datei namens I<user.cfg> im GRUB-Verzeichnis geschrieben, welches standardmäßig I<\,/boot/grub2\/> ist.

source: print this message and exit
de: gibt eine Hilfemeldung aus und beendet das Programm.

source: print the version information and exit
de: gibt die Versionsinformation aus und beendet das Programm.

source: B<-o>, B<--output_path> E<lt>DIRECTORYE<gt>
de: B<-o>, B<--output_path> E<lt>VERZEICHNISE<gt>

source: put user.cfg in a user-selected directory
de: setzt I<user.cfg> in ein benutzerdefiniertes Verzeichnis.

source: REPORTING BUGS
de: FEHLER MELDEN

source: Report bugs at https://bugzilla.redhat.com.
de: Melden Sie Fehler (auf Englisch) auf E<.UR https://bugzilla.redhat.com>E<.UE .>

source: Usage: ./grub-set-password [OPTION] \&./grub-set-password prompts the user to set a password on the grub bootloader. The password is written to a file named user.cfg which lives in the GRUB directory located by default at I<\,/boot/grub2\/>.
de: Aufruf: B<grub-set-password> [OPTION]; B<grub-set-password> erbittet vom Benutzer das Setzen eines Passworts für den Bootloader GRUB. Das Passwort wird in eine Datei namens I<user.cfg> im GRUB-Verzeichnis geschrieben, welches standardmäßig I<\,/boot/grub2\/> ist.

source: The full documentation for B<grub-set-password> is maintained as a Texinfo manual. If the B<info> and B<grub-set-password> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<grub-set-password> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info>(1) und B<grub-set-password> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.

source: June 2022
de: Juni 2022
