Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: There are two separate databases in the zoneinfo system, posix and \(aqright\(aq. \(aqRight\(aq (now named zoneinfo-leaps) includes leap seconds and posix does not. To use the \(aqright\(aq database the System Clock must be set to (UTC + leap seconds), which is equivalent to (TAI - 10). This allows calculating the exact number of seconds between two dates that cross a leap second epoch. The System Clock is then converted to the correct civil time, including UTC, by using the \(aqright\(aq timezone files which subtract the leap seconds. Note: this configuration is considered experimental and is known to have issues.
de: Es gibt zwei getrennte Datenbanken in dem Zoneinfo-System, POSIX und »korrekt«. »Korrekt« (jetzt Zoneinfo-leaps genannt) enthält Schaltsekunden, POSIX nicht. Um die »korrekte« Datenbank zu verwenden, muss die Systemuhr auf (UTC + Schaltsekunden) gesetzt sein, was zu (TAI - 10) äquivalent ist. Dies ermöglicht es, die genaue Anzahl von Sekunden zwischen zwei Daten zu berechnen, wenn dabei ein Schaltesekundenzeitraum durchlaufen wird. Die Systemuhr wird dann in die korrekte zivile Zeit, einschließlich UTC, umgewandelt, indem die »korrekten« Zeitzonendateien verwandt werden, die die Schaltsekunden abziehen. Hinweis: Diese Konfiguration wird als experimentell bezeichnet und hat bekanntermaßen Probleme.

source: To configure a system to use a particular database all of the files located in its directory must be copied to the root of I</usr/share/zoneinfo>. Files are never used directly from the posix or \(aqright\(aq subdirectories, e.g., TZ=\(aqI<right/Europe/Dublin>\(aq. This habit was becoming so common that the upstream zoneinfo project restructured the system\(cqs file tree by moving the posix and \(aqright\(aq subdirectories out of the zoneinfo directory and into sibling directories:
de: Um ein System zur Verwendung einer bestimmten Datenbank zu konfigurieren, müssen alle in seinem Verzeichnis befindliche Dateien in die Wurzel von I</usr/share/zoneinfo> kopiert werden. Dateien werden nie vom POSIX- oder »korrekten« Unterverzeichnis benutzt, z.B. TZ='I<right/Europe/Dublin>'. Diese Gepflogenheit wurde so üblich, dass die Originalentwickler des Zoneinfo-Projekts den Systemdateibaum restrukturierten, indem sie die POSIX- und »korrekten« Unterverzeichnisse aus dem Zoeninfo-Verzeichnis und in benachbarte Verzeichnisse verschoben:

source: Unfortunately, some Linux distributions are changing it back to the old tree structure in their packages. So the problem of system administrators reaching into the \(aqright\(aq subdirectory persists. This causes the system timezone to be configured to include leap seconds while the zoneinfo database is still configured to exclude them. Then when an application such as a World Clock needs the South_Pole timezone file; or an email MTA, or B<hwclock> needs the UTC timezone file; they fetch it from the root of I</usr/share/zoneinfo> , because that is what they are supposed to do. Those files exclude leap seconds, but the System Clock now includes them, causing an incorrect time conversion.
de: Unglücklicherweise ändern einige Linux-Distributionen dies in ihren Paketen wieder auf die alte Struktur zurück. Daher besteht das Problem der Systemadministratoren, die in das »korrekte« Unterverzeichnis hineingreifen, weiter fort. Dies führt dazu, dass die Systemzeitzone konfiguriert wird, Schaltsekunden zu beachten, während die Zoneinfo-Datenbank weiterhin so konfiguriert ist, sie auszuschließen. Wenn dann eine Anwendung wie die »World Clock« die Zeitzonendatei South_Pole benötigt oder ein E-Mail-MTA oder B<hwclock> die UTC-Zeitzonen-Datei benötigen, holen sie sie von der Wurzel von I</usr/share/zoneinfo>, da das so von ihnen erwartet wird. Diese Dateien schließen Schaltsekunden aus, aber die Systemuhr berücksichtigt sie, wodurch eine falsche Umwandlung hervorgerufen wird.

source: Attempting to mix and match files from these separate databases will not work, because they each require the System Clock to use a different timescale. The zoneinfo database must be configured to use either posix or \(aqright\(aq, as described above, or by assigning a database path to the I<TZDIR> environment variable.
de: Der Versuch, Dateien aus diesen getrennten Datenbanken vermischt zu benutzen, wird nicht funktionieren, da sie von der Systemuhr verlangen, eine andere Zeitskala zu verwenden. Die Zoneinfo-Datenbank muss wie oben beschrieben konfiguriert werden, entweder die POSIX oder »korrekte« zu benutzen, oder indem der Umgebungsvariablen I<TZDIR> ein Datenbankpfad zugewiesen wird.

source: One of the following exit values will be returned:
de: Eine der folgenden Rückgabewerte wird zurückgeliefert:

source: B<EXIT_SUCCESS> (\(aq0\(aq on POSIX systems)
de: B<EXIT_SUCCESS> (»0« auf POSIX-Systemen)

source: Successful program execution.
de: Erfolgreiche Programmausführung.

source: B<EXIT_FAILURE> (\(aq1\(aq on POSIX systems)
de: B<EXIT_FAILURE> (»1« auf POSIX-Systemen)

source: The operation failed or the command syntax was not valid.
de: Die Aktion ist fehlgeschlagen oder die Befehlssyntax war ungültig.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If this variable is set its value takes precedence over the system configured timezone.
de: Falls diese Variable gesetzt ist, hat ihr Wert gegenüber der im System konfigurierten Zeitzone Vorrang.

source: If this variable is set its value takes precedence over the system configured timezone database directory path.
de: Falls diese Variable gesetzt ist, hat ihr Wert gegenüber dem im System konfigurierten Zeitzonendatenbankverzeichnispfad Vorrang.

source: FILES
de: DATEIEN

source: The configuration and state file for B<hwclock>. See also B<adjtime_config>(5).
de: Die Konfiguration und die Zustandsdateien für B<hwclock>. Siehe auch B<adjtime_config>(5).

source: The system timezone file.
de: Die Systemzeitzonendatei

source: The system timezone database directory.
de: Das System-Zeitzonen-Datenbankverzeichnis

source: Device files B<hwclock> may try for Hardware Clock access: I</dev/rtc0> I</dev/rtc> I</dev/misc/rtc> I</dev/efirtc> I</dev/misc/efirtc>
de: Gerätedateien, die B<hwclock> für den Zugriff auf die Hardware-Uhr versuchen darf: I</dev/rtc0> I</dev/rtc> I</dev/misc/rtc> I</dev/efirtc> I</dev/misc/efirtc>

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: Written by
de: Geschrieben von

source: September 1996, based on work done on the B<clock>(8) program by Charles Hedrick, Rob Hooft, and Harald Koenig. See the source code for complete history and credits.
de: September 1996, basierend auf dem Programm B<clock>(8) von Charles Hedrick, Rob Hooft und Harald Koenig. Im Quellcode finden Sie die vollständige Geschichte einschließlich der Danksagungen.

source: REPORTING BUGS
de: FEHLER MELDEN

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The B<hwclock> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<hwclock> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:

source: July 2017
de: Juli 2017

source: B<hwclock> is an administration tool for the time clocks. It can: display the Hardware Clock time; set the Hardware Clock to a specified time; set the Hardware Clock from the System Clock; set the System Clock from the Hardware Clock; compensate for Hardware Clock drift; correct the System Clock timescale; set the kernel's timezone, NTP timescale, and epoch (Alpha only); and predict future Hardware Clock values based on its drift rate.
de: B<hwclock> ist ein Administrationswerkzeug für die verschiedenen Uhren. Es kann die aktuelle Hardware-Uhrzeit anzeigen, die Hardware-Uhr auf eine angegebene Zeit stellen, die Hardware-Uhr nach der Systemzeit stellen oder umgekehrt, eine Hardware-Uhr-Abweichung ausgleichen, die Zeitskala der Systemuhr korrigieren, die Zeitzone des Kernels, die NTP-Zeitskala und die Epoche (nur Alpha) setzen und zukünftige Hardware-Uhrwerte, basierend auf der Abweichungsrate, vorhersagen.

source: Since v2.26 important changes were made to the B<--hctosys> function and the B<--directisa> option, and a new option B<--update-drift> was added. See their respective descriptions below.
de: Seit v2.26 gibt es wichtige Änderungen an der Funktion B<--hctosys>, der Option B<--directisa> und eine neue Option B<--update-drift> wurde hinzugefügt. Lesen Sie die entsprechenden Beschreibungen unten.

source: The following functions are mutually exclusive, only one can be given at a time. If none is given, the default is B<--show>.
de: Die folgenden Funktionen schließen sich gegenseitig aus, nur eine kann ausgewählt werden. Die Vorgabe ist B<--show>, falls keine angegeben wurde.

source: Add or subtract time from the Hardware Clock to account for systematic drift since the last time the clock was set or adjusted. See the discussion below, under B<The Adjust Function>.
de: fügt Zeit zur Hardware-Uhr hinzu oder zieht diese ab, um eine systematische Abweichung seit dem letzten Setzen oder Anpassen der Hardware-Uhr auszugleichen. Siehe die nachfolgende Erklärungen unter B<Die Adjust-Funktion>.

source: They are used to read and set the kernel's Hardware Clock epoch value. Epoch is the number of years into AD to which a zero year value in the Hardware Clock refers. For example, if the machine's BIOS sets the year counter in the Hardware Clock to contain the number of full years since 1952, then the kernel's Hardware Clock epoch value must be 1952.
de: Sie werden verwandt, um den Kernel-Wert der Hardware-Uhr-Epoche zu lesen und zu setzen. Epoche ist das Jahr, auf dass sich der Nullwert der Hardware-Uhr bezieht. Wenn das BIOS der Maschine zum Beispiel die Konvention verwenden, dass die Jahreszählung in der Hardware-Uhr die Anzahl der vollen Jahre seit 1952 enthält, dann muss der Epochenwert der Hardware-Uhr des Kernels auf 1952 gesetzt werden.

source: The B<\%--setepoch> function requires using the B<\%--epoch> option to specify the year. For example:
de: Die Funktion B<\%--setepoch> benötigt die Option B<\%--epoch>, um das Jahr festzulegen. Beispiel:

source: This epoch value is used whenever B<\%hwclock> reads or sets the Hardware Clock on an Alpha machine. For ISA machines the kernel uses the fixed Hardware Clock epoch of 1900.
de: Dieser Epochenwert wird verwendet, wenn B<\%hwclock> die Hardware-Uhr auf einer Alpha-Maschine ausliest oder stellt. Für ISA-Maschinen verwendet der Kernel die feste Hardware-Uhr-Epoche 1900.

source: Predict what the Hardware Clock will read in the future based upon the time given by the B<--date> option and the information in I</etc/adjtime>. This is useful, for example, to account for drift when setting a Hardware Clock wakeup (aka alarm). See B<\%rtcwake>(8).
de: sagt basierend auf der mit der Option B<--date> angegebene Zeit und der Information in I</etc/adjtime> vorher, was die Hardware-Uhr in der Zukunft anzeigen wird. Dies ist zum Beispiel nützlich, um Abweichungen zu berücksichtigen, wenn das Hardware-Uhr-Aufwachen (d.h. ein Alarm) eingerichtet wird. Siehe B<\%rtcwake>(8).

source: Do not use this function if the Hardware Clock is being modified by anything other than the current operating system's B<\%hwclock> command, such as \%'11\ minute\ mode' or from dual-booting another OS.
de: Verwenden Sie diese Funktion nicht, falls die Hardware-Uhr durch irgendetwas anderes als den Befehl B<\%hwclock> des aktuellen Betriebssystems verändert wird, wie dem »11-Minuten-Modus« oder durch das Starten eines anderen Betriebssystems.

source: Read the Hardware Clock and print its time to standard output in the B<ISO 8601> format. The time shown is always in local time, even if you keep your Hardware Clock in UTC. See the B<\%--localtime> option.
de: liest die Hardware-Uhr und schreibt ihre Zeit in die Standardausgabe im B<ISO 8601>-Format. Die angezeigte Zeit ist stets die lokale Zeit, selbst wenn Sie die Hardware-Uhr auf die Weltzeit (UTC) eingestellt haben, siehe die Option B<\%--localtime>.

source: The B<--get> function also applies drift correction to the time read, based upon the information in I</etc/adjtime>. Do not use this function if the Hardware Clock is being modified by anything other than the current operating system's B<\%hwclock> command, such as \%'11\ minute\ mode' or from dual-booting another OS.
de: Die Funktion B<--get> wendet auch Korrekturen für die Abweichung auf die eingelesene Zeit an, basierend auf Informationen aus I</etc/adjtime>. Verwenden Sie diese Funktion nicht, falls die Hardware-Uhr von irgendetwas anderem außer dem Befehl B<\%hwclock> des aktuellen Betriebssystems verändert wird, wie dem \%»11\-Minute\-Modus« oder vom Dualstarten eines anderen Betriebssystems.

source: Set the System Clock from the Hardware Clock. The time read from the Hardware Clock is compensated to account for systematic drift before using it to set the System Clock. See the discussion below, under B<The Adjust Function>.
de: stellt die Systemuhr aus der Hardware-Uhr. Die aus der Hardware-Uhr eingelesene Zeit wird bezüglich der systematischen Abweichung ausgeglichen, bevor die Systemuhr gestellt wird. Lesen Sie die Diskussion weiter unten, unter B<Die Adjust-Funktion>.

source: The System Clock must be kept in the UTC timescale for date-time applications to work correctly in conjunction with the timezone configured for the system. If the Hardware Clock is kept in local time then the time read from it must be shifted to the UTC timescale before using it to set the System Clock. The B<\%--hctosys> function does this based upon the information in the I</etc/adjtime> file or the command line arguments B<\%--localtime> and B<--utc>. Note: no daylight saving adjustment is made. See the discussion below, under B<LOCAL vs UTC>.
de: Die Systemzeit muss in der UTC-Zeitskala gehalten werden, damit Anwendungen im Zusammenhang mit der für das System konfigurierten Zeitzone arbeiten. Falls die Hardware-Uhr in der lokalen Zeit gehalten wird, dann muss die daraus gelesene Zeit in die UTC-Zeitskala verschoben werden, bevor sie zum Setzen der Systemuhr verwandt wird. Die Funktion B<\%--hctosys> erledigt dies basierend auf den Informationen in der Datei I</etc/adjtime> oder aus den Befehlszeilenargumenten B<\%--localtime> und B<--utc>. Hinweis: Es wird keine Sommerzeitanpassung durchgeführt. Siehe die Diskussion weiter unten unter B<LOKAL vs. UTC>.

source: The kernel also keeps a timezone value, the B<\%--hctosys> function sets it to the timezone configured for the system. The system timezone is configured by the TZ environment variable or the I<\%/etc/localtime> file, as B<\%tzset>(3) would interpret them. The obsolete tz_dsttime field of the kernel's timezone value is set to zero. (For details on what this field used to mean, see B<\%settimeofday>(2).)
de: Der Kernel hält auch einen Zeitzonenwert, die Funktion B<\%--hctosys> setzt ihn auf den für das System konfigurierten Wert. Die Systemzeitzone wird durch die TZ-Umgebungsvariable oder die Datei I<\%/etc/localtime> konfiguriert, wie B<\%tzset>(3) sie interpretieren würde. Das veraltete Feld »tz_dsttime« des Kernel-Zeitzonenwerts wird auf Null gesetzt. Details zur ehemaligen Bedeutung dieses Feldes finden Sie in B<\%settimeofday>(2).

source: When used in a startup script, making the B<\%--hctosys> function the first caller of B<\%settimeofday>(2) from boot, it will set the NTP \%'11\ minute\ mode' timescale via the I<\%persistent_clock_is_local> kernel variable. If the Hardware Clock's timescale configuration is changed then a reboot is required to inform the kernel. See the discussion below, under B<Automatic Hardware Clock Synchronization by the Kernel>.
de: Wird die Funktion B<\%--hctosys> durch Verwendung in einem Systemstartskript der erste Aufrufer von B<\%settimeofday>(2), dann wird über die Kernelvariable I<\%persistent_clock_is_local> der NTP-\%»11\-Minuten\-Modus« gesetzt. Falls die Hardware-Uhr-Zeitskalenkonfiguration geändert wird, ist ein Systemneustart notwendig, um den Kernel zu informieren. Lesen Sie die Diskussion weiter unten unter B<Automatischer Abgleich der Hardware-Uhr durch den Kernel>.

source: This function should never be used on a running system. Jumping system time will cause problems, such as corrupted filesystem timestamps. Also, if something has changed the Hardware Clock, like NTP's \%'11\ minute\ mode', then B<\%--hctosys> will set the time incorrectly by including drift compensation.
de: Diese Funktion sollte niemals auf einem laufenden System verwandt werden. Springende Systemzeit führt zu Problemen, wie fehlerhaften Dateisystemzeitstempeln. Falls auch etwas die Hardware-Uhr geändert hat, wie NTPs \%»11\-Minuten\-Modus«, dann wird B<\%--hctosys> die Zeit durch Berücksichtigung der Abweichungsausgleichung inkorrekt einstellen.

source: Drift compensation can be inhibited by setting the drift factor in I</etc/adjtime> to zero. This setting will be persistent as long as the B<\%--update-drift> option is not used with B<\%--systohc> at shutdown (or anywhere else). Another way to inhibit this is by using the B<\%--noadjfile> option when calling the B<\%--hctosys> function. A third method is to delete the I</etc/adjtime> file. B<Hwclock> will then default to using the UTC timescale for the Hardware Clock. If the Hardware Clock is ticking local time it will need to be defined in the file. This can be done by calling B<hwclock\ --localtime\ --adjust>; when the file is not present this command will not actually adjust the Clock, but it will create the file with local time configured, and a drift factor of zero.
de: Die Abweichungsausgleichung kann durch Setzen des Abweichungsfaktors in I</etc/adjtime> auf Null unterdrückt werden. Diese Einstellung ist dauerhaft, solange wie die Option B<\%--update-drift> nicht zusammen mit B<\%--systohc> beim Herunterfahren des Systems (oder irgendwann sonst) verwandt wird. Eine andere Möglichkeit, dies zu unterdrücken besteht durch die Option B<\%--noadjfile> beim Einsatz der Funktion B<\%--hctosys>. Eine dritte Methode besteht im Löschen der Datei I</etc/adjtime>. B<Hwclock> wird dann standardmäßig die UTC-Zeitskala für die Hardware-Uhr verwenden. Falls die Hardware-Uhr in lokaler Zeit läuft, muss das in dieser Datei definiert werden. Dies kann durch Aufruf von B<hwclock\ --localtime\ --adjust> erfolgen. Wenn die Datei nicht vorhanden ist, wird dieser Befehl nicht wirklich die Uhr anpassen sondern wird die Datei mit der konfigurierten lokalen Zeit und einem Abweichungsfaktor von Null anlegen.

source: A condition under which inhibiting B<hwclock>'s drift correction may be desired is when dual-booting multiple operating systems. If while this instance of Linux is stopped, another OS changes the Hardware Clock's value, then when this instance is started again the drift correction applied will be incorrect.
de: Eine Bedingung, unter der die Abweichungskorrektur von B<hwclock> verhindert werden sollte, könnte beim Dualstart von mehreren Betriebssystemen vorliegen. Falls, während diese Instanz von Linux angehalten ist, ein anderes Betriebssystem die Hardware-Uhr stellt, dann wird die Abweichungskorrektur nach dem Start dieser Instanz bei der Anwendung inkorrekt sein.

source: For B<hwclock>'s drift correction to work properly it is imperative that nothing changes the Hardware Clock while its Linux instance is not running.
de: Damit die Abweichungskorrektur von B<hwclock> korrekt funktioniert, ist es zwingend, dass nichts die Hardware-Uhr ändert, während die Linux-Instanz nicht läuft.

source: Set the Hardware Clock to the time given by the B<--date> option, and update the timestamps in I</etc/adjtime>. With the B<\%--update-drift> option also (re)calculate the drift factor. Try it without the option if B<\%--set> fails. See B<\%--update-drift> below.
de: setzt die Hardware-Uhr auf die durch die Option B<--date> angegebene Zeit und aktualisiert die Zeitstempel in I</etc/adjtime>. Mit der Option B<\%--update-drift> wird der Abweichungsfaktor (neu) berechnet. Versuchen Sie, die Option wegzulassen, falls B<\%--set> fehlschlägt. Siehe B<\%--update-drift> unten.

source: This is an alternate to the B<\%--hctosys> function that does not read the Hardware Clock nor set the System Clock; consequently there is not any drift correction. It is intended to be used in a startup script on systems with kernels above version 2.6 where you know the System Clock has been set from the Hardware Clock by the kernel during boot.
de: Dies ist eine Alternative zu der Funktion B<\%--hctosys>, die nicht die Hardware-Uhr liest und nicht die Systemzeit setzt. Entsprechend gibt es auch keine Korrektur der Abweichung. Sie ist für Hochfahrskripte auf Systemen mit Kerneln höher als 2.6 gedacht, bei denen Sie wissen, dass die Systemuhr bereits vom Kernel während des Systemstarts aus der Hardware-Uhr gesetzt wurde.

source: It does the following things that are detailed above in the B<\%--hctosys> function:
de: Dies führt die folgenden Dinge aus, die weiter oben in der Funktion B<\%--hctosys> beschrieben sind:

source: Corrects the System Clock timescale to UTC as needed. Only instead of accomplishing this by setting the System Clock, B<hwclock> simply informs the kernel and it handles the change.
de: Korrigiert die Systemuhrzeitskala auf UTC wie benötigt. Anstatt aber dies durch Setzen der Systemuhr zu erreichen, informiert B<hwclock> einfach den Kernel und der kümmert sich um die Änderung.

source: Sets the kernel's NTP \%'11\ minute\ mode' timescale.
de: Setzt die NTP \%»11\-Minuten\-Modus«-Zeitskala des Kernels

source: Sets the kernel's timezone.
de: Setzt die Zeitzone des Kernels

source: The first two are only available on the first call of B<\%settimeofday>(2) after boot. Consequently this option only makes sense when used in a startup script. If the Hardware Clocks timescale configuration is changed then a reboot would be required to inform the kernel.
de: Die ersten zwei sind nur beim ersten Aufruf von B<\%settimeofday>(2) nach dem Systemstart verfügbar. Konsequenterweise ergeben diese Optionen nur bei der Verwendung in Systemstartskripten Sinn. Falls die Hardware-Uhr-Zeitskalenkonfiguration geändert wird, ist ein Systemneustart notwendig, um den Kernel zu informieren.

source: Set the Hardware Clock from the System Clock, and update the timestamps in I</etc/adjtime>. With the B<\%--update-drift> option also (re)calculate the drift factor. Try it without the option if B<\%--systohc> fails. See B<\%--update-drift> below.
de: setzt die Hardware-Uhr aus der Systemuhr und aktualisiert die Zeitstempel in I</etc/adjtime>. Mit der Option B<--update-drift> wird auch der Abweichungsfaktor (neu) berechnet. Versuchen Sie es ohne die Option, falls B<\%--systohc> fehlschlägt. Siehe B<\%--update-drift> weiter unten.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: B<\%--date=>I<date_string>
de: B<\%--date=>I<Datumszeichenkette>

source: This option must be used with the B<--set> or B<\%--predict> functions, otherwise it is ignored.
de: Diese Option muss zusammen mit den Funktionen B<--set> oder B<\%--predict> verwandt werden, andernfalls wird sie ignoriert.
