Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: The argument must be in local time, even if you keep your Hardware Clock in UTC. See the B<\%--localtime> option. Therefore, the argument should not include any timezone information. It also should not be a relative time like "+5 minutes", because B<\%hwclock>'s precision depends upon correlation between the argument's value and when the enter key is pressed. Fractional seconds are silently dropped. This option is capable of understanding many time and date formats, but the previous parameters should be observed.
de: Das Argument muss in lokaler Zeit sein, selbst wenn Sie Ihre Hardware-Uhr in UTC halten. Siehe die Option B<\%--localtime>. Daher sollte das Argument keine Zeitzoneninformationen enthalten. Es sollte auch keine relative Zeit wie »+5 minutes« sein, da B<\%hwclock>s Genauigkeit von dem Zusammenhang zwischen dem Wert des Arguments und dem Zeitpunkt, zu dem die Eingabetaste gedrückt wird, abhängt. Sekundenbruchteile werden ohne Rückmeldung abgeschnitten. Diese Option kann viele Zeit- und Datumsformate erkennen, aber die vorhergehenden Parameter sollten beachtet werden.

source: B<\%--delay=>I<seconds>
de: B<\%--delay=>I<Sekunden>

source: The 500ms default is based on commonly used MC146818A-compatible (x86) hardware clock. This Hardware Clock can only be set to any integer time plus one half second. The integer time is required because there is no interface to set or get a fractional second. The additional half second delay is because the Hardware Clock updates to the following second precisely 500 ms after setting the new time. Unfortunately, this behavior is hardware specific and in same cases another delay is required.
de: Die Standardverzögerung von 500 ms basiert auf der häufig verwandten, MC146818A-kompatiblen (X86-)Hardwareuhr. Die Hardwareuhr kann nur auf ganzzahlige Zeiten plus eine halbe Sekunde gesetzt werden. Die Ganzzahlzeit ist notwendig, da es keine Schnittstelle gibt, um Sekundenbruchteile zu setzen oder abzufragen. Die zusätzliche halbe Sekunde Verzögerung erfolgt, da die Hardwareuhr sich auf die folgende Sekunde genau 500 ms nach dem Setzen der neuen Zeit aktualisiert. Unglücklicherweise ist dieses Verhalten hardwareabhängig und in einigen Fällen wird eine andere Verzögerung benötigt.

source: Use\ B<--verbose>. The\ B<\%--debug\ >option has been deprecated and may be repurposed or removed in a future release.
de: Verwenden Sie B<--verbose>. Die Option B<\%--debug> ist veraltet und kann in einer zukünftigen Veröffentlichung einer neuen Verwendung zugeführt oder entfernt werden.

source: This option is meaningful for ISA compatible machines in the x86 and x86_64 family. For other machines, it has no effect. This option tells B<\%hwclock> to use explicit I/O instructions to access the Hardware Clock. Without this option, B<\%hwclock> will use the rtc device file, which it assumes to be driven by the Linux RTC device driver. As of v2.26 it will no longer automatically use directisa when the rtc driver is unavailable; this was causing an unsafe condition that could allow two processes to access the Hardware Clock at the same time. Direct hardware access from userspace should only be used for testing, troubleshooting, and as a last resort when all other methods fail. See the B<--rtc> option.
de: Diese Option ist auf ISA-kompatiblen Maschinen (einschließlich X86 und X86_64 von Bedeutung. Auf anderen Maschinen hat sie keine Auswirkungen. Diese Option weist B<\%hwclock> explizit an, E/A-Anweisungen für den Zugriff auf die Hardware-Uhr vorzunehmen. Ohne diese Option versucht B<\%hwclock>, die RTC-Gerätdatei zu verwenden, wobei angenommen wird, dass diese mit dem Linux-RTC-Gerätetreiber läuft. Seit v2.26 wird er nicht mehr automatisch directisa verwenden, wenn der RTC-Treiber nicht verfügbar ist. Dies führte zu unsicheren Bedingungen, die es erlaubten, dass zwei Prozesse auf die Hardware-Uhr gleichzeitig zugreifen konnten. Direkter Hardware-Zugriff aus dem Benutzerraum sollte nur zum Testen, zur Fehlersuche und als letzte Rettung, wenn alle anderen Methoden fehlschlagen, verwandt werden. Siehe die Option B<--rtc>.

source: This option is required when using the B<\%--setepoch>\ function. The minimum I<year> value is 1900. The maximum is system dependent (B<ULONG_MAX\ -\ 1>).
de: Diese Option ist notwendig, wenn die Funktion B<\%--setepoch> verwandt wird. Das minimale I<Jahr> ist 1900. Das maximale ist systemabhängig (B<ULONG_MAX\ -\ 1>).

source: B<-f>,B<\ --rtc=>I<filename>
de: B<-f>,B<\ --rtc=>I<Dateiname>

source: Override B<\%hwclock>'s default rtc device file name. Otherwise it will use the first one found in this order:
de: Setzt den Vorgabe-RTC-Dateinamen von B<\%hwclock> außer Kraft. Andernfalls wird der erste aus der folgenden Liste (in dieser Reihenfolge) verwandt:

source: For B<IA-64:>
de: Für B<IA-64:>

source: The Hardware Clock may be configured to use either the UTC or the local timescale, but nothing in the clock itself says which alternative is being used. The B<\%--localtime> or B<--utc> options give this information to the B<\%hwclock> command. If you specify the wrong one (or specify neither and take a wrong default), both setting and reading the Hardware Clock will be incorrect.
de: Die Hardware-Uhr kann konfiguriert sein, entweder UTC oder die lokale Zeitskala zu verwenden, allerdings gibt es nichts in der Uhr, das angibt, welche der Varianten gewählt wurde. Die Optionen B<\%--localtime> und B<--utc> übergeben diese Information an den Befehl B<\%hwclock>. Falls Sie das Falsche angeben (oder keines angeben und die falsche Voreinstellung nehmen), werden sowohl das Setzen als auch das Lesen der Hardware-Uhr inkorrekt sein.

source: If you specify neither B<--utc> nor B<\%--localtime> then the one last given with a set function (B<--set>, B<\%--systohc>, or B<\%--adjust>), as recorded in I</etc/adjtime>, will be used. If the adjtime file doesn't exist, the default is UTC.
de: Falls Sie weder B<--utc> noch B<\%--localtime> angeben, dann wird die zuletzt mit der Setzen-Funktion (B<--set>, B<\%--systohc> oder B<\%--adjust>) verwendete benutzt, wie dies in I</etc/adjtime> aufgezeichnet ist. Falls die adjtime-Datei nicht existiert, wird UTC als Vorgabe verwendet.

source: Note: daylight saving time changes may be inconsistent when the Hardware Clock is kept in local time. See the discussion below, under B<LOCAL vs UTC>.
de: Hinweis: Zeitübergangs-Änderungen können inkonsistent sein, falls die Hardware-Uhr in lokaler Zeit betrieben wird. Lesen Sie die Diskussion weiter unten unter B<LOKAL vs. UTC>.

source: Disable the facilities provided by I</etc/adjtime>. B<\%hwclock> will not read nor write to that file with this option. Either B<--utc> or B<\%--localtime> must be specified when using this option.
de: deaktiviert die von I</etc/adjtime> bereitgestellten Leistungen. B<\%hwclock> liest oder schreibt nicht in diese Datei, wenn diese Option angegeben ist. Entweder B<--utc> oder B<\%--localtime> müssen mit dieser Option angegeben werden.

source: Do not actually change anything on the system, that is, the Clocks or I</etc/adjtime> (B<\%--verbose> is implicit with this option).
de: ändert tatsächlich nichts am System, d.h. die Uhren oder I</etc/adjtime> (diese Option impliziert B<\%--verbose>).

source: Update the Hardware Clock's drift factor in I</etc/adjtime>. It can only be used with B<--set> or B<\%--systohc>,
de: aktualisiert den Abweichungsfaktor der Hardware-Uhr in I</etc/adjtime>. Sie kann nur zusammen mit B<--set> oder B<\%--systohc> verwandt werden.

source: A minimum four hour period between settings is required. This is to avoid invalid calculations. The longer the period, the more precise the resulting drift factor will be.
de: Zwischen Einstellungen ist minimal ein Abstand von vier Stunden notwendig. Damit werden ungültige Berechnungen vermieden. Je länger die Periode, desto präziser wird der sich ergebende Abweichungsfaktor sein.

source: This option was added in v2.26, because it is typical for systems to call B<\%hwclock\ --systohc> at shutdown; with the old behaviour this would automatically (re)calculate the drift factor which caused several problems:
de: Diese Option wurde in v2.26 hinzugefügt, da typischerweise auf Systemen beim Herunterfahren B<\%hwclock\ --systohc> aufgerufen wird. Mit dem alten Verhalten würde dabei automatisch der Abweichungsfaktor (neu) berechnet werden, wodurch mehrere Probleme entstanden:

source: When using NTP with an \%'11\ minute\ mode' kernel the drift factor would be clobbered to near zero.
de: Wird NTP mit einem \%»11\-Minuten\-Modus«-Kernel verwandt, würde der Abweichungsfaktor auf fast Null verfremdet.

source: It would not allow the use of 'cold' drift correction. With most configurations using 'cold' drift will yield favorable results. Cold, means when the machine is turned off which can have a significant impact on the drift factor.
de: Es würde nicht die Verwendung von »kalter«-Abweichungskorrektur erlauben. Bei den meisten Konfigurationen führt die »kalte« Abweichungskorrektur zu besseren Ergebnissen. Kalt bedeutet, wenn die Maschine ausgeschaltet ist, was eine wesentliche Auswirkung auf den Abweichungsfaktor haben kann.

source: (Re)calculating drift factor on every shutdown delivers suboptimal results. For example, if ephemeral conditions cause the machine to be abnormally hot the drift factor calculation would be out of range.
de: (Neu-)Berechnung des Abweichungsfaktors bei jedem Herunterfahren führt zu suboptimalen Ergebnissen. Führen beispielsweise kurzzeitige Bedingungen dazu, dass die Maschine ungewöhnlich heiß wird, wäre die Abweichungsfaktorberechnung außerhalb des Gültigkeitsbereichs.

source: Significantly increased system shutdown times (as of v2.31 when not using B<\%--update-drift> the RTC is not read).
de: Signifikant erhöhte System-Runterfahrzeiten (bei v2.31 wird die RTC nicht gelesen, wenn B<\%--update-drift> nicht verwandt wird).

source: Having B<\%hwclock> calculate the drift factor is a good starting point, but for optimal results it will likely need to be adjusted by directly editing the I</etc/adjtime> file. For most configurations once a machine's optimal drift factor is crafted it should not need to be changed. Therefore, the old behavior to automatically (re)calculate drift was changed and now requires this option to be used. See the discussion below, under B<The Adjust Function>.
de: Die Berechnung des Abweichungsfaktors durch B<\%hwclock> ist ein guter Start, aber für optimale Ergebnisse wird wahrscheinlich die Datei I</etc/adjtime> direkt bearbeitet werden müssen. Bei den meisten Konfigurationen braucht die Abweichung nicht mehr verändert zu werden, sobald der optimale Abweichungsfaktor erstellt wurde. Daher wurde das alte Verhalten, die Abweichung automatisch (neu) zu berechnen, geändert und benötigt nun dafür eine Option. Lesen Sie die Diskussion weiter unten unter B<Die Adjust-Funktion>.

source: This option requires reading the Hardware Clock before setting it. If it cannot be read, then this option will cause the set functions to fail. This can happen, for example, if the Hardware Clock is corrupted by a power failure. In that case, the clock must first be set without this option. Despite it not working, the resulting drift correction factor would be invalid anyway.
de: Diese Option benötigt die Hardwareuhr vor ihrem Setzen. Falls sie nicht gelesen werden kann, wird diese Option zum Fehlschlag der Setzen-Funktion führen. Dies kann beispielsweise passieren, falls die Hardwareuhr durch einen Stromausfall beschädigt ist. In diesem Fall muss die Uhr zuerst ohne diese Option gesetzt werden. Abgesehen davon, dass sie nicht funktioniert, wäre der daraus resultierende Abweichungsfaktor sowieso ungültig.

source: Display more details about what B<\%hwclock> is doing internally.
de: zeigt mehr Details über die internen Vorgänge von B<\%hwclock> an.

source: On an ISA compatible system, this clock is specified as part of the ISA standard. A control program can read or set this clock only to a whole second, but it can also detect the edges of the 1 second clock ticks, so the clock actually has virtually infinite precision.
de: Auf einem ISA-kompatiblen System wird diese Uhr als Teil des ISA-Standards spezifiziert. Ein Steuerprogramm kann diese Uhr nur in ganzen Sekunden stellen oder auslesen, aber es kann auch die Signalübergänge der Ein-Sekunden-Impulse erkennen, so dass die Uhr über virtuell unendliche Präzision verfügt.

source: This clock is commonly called the hardware clock, the real time clock, the RTC, the BIOS clock, and the CMOS clock. Hardware Clock, in its capitalized form, was coined for use by B<\%hwclock>. The Linux kernel also refers to it as the persistent clock.
de: Diese Uhr wird allgemein die Hardware-Uhr, die Echtzeituhr, die RTC, die BIOS-Uhr oder die CMOS-Uhr genannt. Der Begriff Hardware-Uhr wurde für B<\%hwclock> gewählt. Der Linux-Kernel bezeichnet sie auch als beständige Uhr.

source: Some non-ISA systems have a few real time clocks with only one of them having its own power domain. A very low power external I2C or SPI clock chip might be used with a backup battery as the hardware clock to initialize a more functional integrated real-time clock which is used for most other purposes.
de: Einige Nicht-ISA-Systeme haben ein paar Echtzeituhren, wobei nur eine davon ihre eigene Energieversorgung hat. Ein sehr energiesparender externer I²C- oder SPI-Uhrchip könnte mit einer Stützbatterie als Hardware-Uhr fungieren, um eine funktionellere integrierte Echtzeituhr zu initialisieren, die für die meisten anderen Zwecke verwendet wird.

source: B<The System Clock:> This clock is part of the Linux kernel and is driven by a timer interrupt. (On an ISA machine, the timer interrupt is part of the ISA standard.) It has meaning only while Linux is running on the machine. The System Time is the number of seconds since 00:00:00 January 1, 1970 UTC (or more succinctly, the number of seconds since 1969 UTC). The System Time is not an integer, though. It has virtually infinite precision.
de: B<Die Systemuhr>: Diese Uhr ist Teil des Linux-Kernels und wird durch einen Timer-Interrupt gesteuert (auf einer ISA-Maschine ist der Timer-Interrupt Teil des ISA-Standards). Sie ist nur von Bedeutung, solange Linux auf der Maschine läuft. Die Systemzeit wird als die Anzahl der Sekunden seit dem 1. Januar 1970 um 00:00:00 Uhr Weltzeit ausgedrückt, oder anders formuliert, die Anzahl der seit 1969 UTC vergangenen Sekunden. Die Systemzeit ist dennoch keine Ganzzahl. Sie hat virtuell unbegrenzte Präzision.

source: The System Time is the time that matters. The Hardware Clock's basic purpose is to keep time when Linux is not running so that the System Clock can be initialized from it at boot. Note that in DOS, for which ISA was designed, the Hardware Clock is the only real time clock.
de: Die Systemzeit ist die Zeit, auf die es ankommt. Der grundlegende Zweck der Hardware-Uhr in einem Linux-System ist die Erhaltung der Zeit, wenn Linux nicht läuft, so dass die Systemzeit beim Systemstart daraus initialisiert werden kann. Beachten Sie, dass in DOS, wofür der ISA-Standard entworfen wurde, die Hardware-Uhr die einzig verfügbare Echtzeituhr ist.

source: It is important that the System Time not have any discontinuities such as would happen if you used the B<\%date>(1) program to set it while the system is running. You can, however, do whatever you want to the Hardware Clock while the system is running, and the next time Linux starts up, it will do so with the adjusted time from the Hardware Clock. Note: currently this is not possible on most systems because B<\%hwclock\ --systohc> is called at shutdown.
de: Es ist wichtig, dass die Zählung der Systemzeit nicht unterbrochen wird, zum Beispiel wenn Sie mit dem Befehl B<\%date>(1) die Systemzeit setzen, während das System läuft. Sie können dennoch im laufenden Betrieb mit der Hardware-Uhr tun, was Sie wollen, und beim nächsten Linux-Start wird die Zeit der Hardware-Uhr entsprechend angepasst. Hinweis: Derzeit ist dies auf den meisten Systemen nicht möglich, da beim Herunterfahren B<\%hwclock\ --systohc> aufgerufen wird.

source: The Linux kernel's timezone is set by B<hwclock>. But don't be misled -- almost nobody cares what timezone the kernel thinks it is in. Instead, programs that care about the timezone (perhaps because they want to display a local time for you) almost always use a more traditional method of determining the timezone: They use the TZ environment variable or the I<\%/etc/localtime> file, as explained in the man page for B<\%tzset>(3). However, some programs and fringe parts of the Linux kernel such as filesystems use the kernel's timezone value. An example is the vfat filesystem. If the kernel timezone value is wrong, the vfat filesystem will report and set the wrong timestamps on files. Another example is the kernel's NTP \%'11\ minute\ mode'. If the kernel's timezone value and/or the I<\%persistent_clock_is_local> variable are wrong, then the Hardware Clock will be set incorrectly by \%'11\ minute\ mode'. See the discussion below, under B<Automatic Hardware Clock Synchronization by the Kernel>.
de: Die Zeitzone des Linux-Kernels wird durch B<hwclock> gesetzt. Aber lassen Sie sich nicht in die Irre führen – beinahe niemand interessiert sich dafür, was der Kernel meint, in welcher Zeitzone er sich befindet. Stattdessen müssen Programme, für die die Zeitzone wichtig ist (um Ihnen beispielsweise die lokale Zeit anzuzeigen), fast immer einen etwas traditionelleren Weg wählen, um die Zeitzone zu ermitteln: Sie benutzen die TZ-Umgebungsvariable oder die Datei I<\%/etc/localtime>, wie in der Handbuchseite zu B<\%tzset>(3) erklärt. Jedoch nutzen einige Programme und Teile des Linux-Kernels dessen Zeitzonenwert, zum Beispiel Dateisysteme. Ein Beispiel hierfür ist das vfat-Dateisystem. Ist der Zeitzonenwert im Kernel falsch gesetzt, werden vom vfat-Dateisystem falsche Zeitstempel gemeldet und gesetzt. Ein weiteres Beispiel ist der NTP-11-Minuten-Modus-Modus des Kernels. Falls der Zeitzonenwert des Kernels und/oder die Variable I<\%persistent_clock_is_local> falsch ist, dann wird die Hardware durch den 11-Minuten-Modus-Modus falsch gesetzt. Lesen Sie hierzu die Diskussion weiter unten, unter B<Automatischer Abgleich der Hardware-Uhr durch den Kernel>.

source: B<\%hwclock> sets the kernel's timezone to the value indicated by TZ or I<\%/etc/localtime> with the B<\%--hctosys> or B<\%--systz> functions.
de: B<\%hwclock> setzt den Kernel-Zeitzonenwert auf den durch die Umgebungsvariable TZ oder aus I<\%/etc/localtime> mit den Funktionen B<\%--hctosys> oder B<\%--systz> angegebenen Wert.

source: The kernel's timezone value actually consists of two parts: 1) a field tz_minuteswest indicating how many minutes local time (not adjusted for DST) lags behind UTC, and 2) a field tz_dsttime indicating the type of Daylight Savings Time (DST) convention that is in effect in the locality at the present time. This second field is not used under Linux and is always zero. See also B<\%settimeofday>(2).
de: Der Zeitzonenwert des Kernels besteht aus zwei Teilen: erstens dem Feld »tz_minuteswest«, das die Anzahl der Minuten angibt, die die lokale Zeit (nicht an Sommer-/Winterzeit angepasst) gegenüber der Weltzeit zurückbleibt, und zweitens dem Feld »tz_dsttime«, welches angibt, ob am entsprechenden Ort gerade Sommer- oder Winterzeit herrscht. Dieses zweite Feld wird unter Linux nicht genutzt und wird stets auf 0 gesetzt. Siehe auch B<\%settimeofday>(2).

source: B<\%hwclock> uses many different ways to get and set Hardware Clock values. The most normal way is to do I/O to the rtc device special file, which is presumed to be driven by the rtc device driver. Also, Linux systems using the rtc framework with udev, are capable of supporting multiple Hardware Clocks. This may bring about the need to override the default rtc device by specifying one with the B<--rtc> option.
de: B<\%hwclock> verwendet viele verschiedene Arten, die Hardware-Uhr-Werte zu ermitteln und zu setzen. Der normale Weg besteht in E/A zu der besondere Datei des RTC-Geräts. Dabei wird angenommen, dass diese vom RTC-Treiber betrieben wird. Auch sind Linux-Systeme, die das RTC-Konzept mit Udev verwenden, in der Lage, mehrere Hardware-Uhren zu unterstützen. Damit könnte die Notwendigkeit entstehen, das Vorgabe-RTC-Gerät mit der Option B<--rtc> außer Kraft zu setzen.

source: However, this method is not always available as older systems do not have an rtc driver. On these systems, the method of accessing the Hardware Clock depends on the system hardware.
de: Allerdings ist diese Methode nicht immer verfügbar, da ältere Systeme über keinen RTC-Treiber verfügen. Auf diesen Systemen hängt die Art des Zugriffs auf die Hardware-Uhr von der Art der Systemhardware ab.

source: On an ISA compatible system, B<\%hwclock> can directly access the "CMOS memory" registers that constitute the clock, by doing I/O to Ports 0x70 and 0x71. It does this with actual I/O instructions and consequently can only do it if running with superuser effective userid. This method may be used by specifying the B<\%--directisa> option.
de: Auf einem ISA-kompatiblen System kann B<\%hwclock> direkt über Ein- und Ausgaben der Ports 0x70 und 0x71 auf die CMOS-Speicherregister zugreifen, welche die Uhr darstellen. Es werden E/A-Anweisungen verwendet, was konsequenterweise nur funktionieren kann, wenn diese mit der effektiven Benutzerkennung des Superusers aufgerufen werden. Diese Methode kann durch Angabe der Option B<\%--directisa> festgelegt werden.

source: This is a really poor method of accessing the clock, for all the reasons that userspace programs are generally not supposed to do direct I/O and disable interrupts. B<\%hwclock> provides it for testing, troubleshooting, and because it may be the only method available on ISA systems which do not have a working rtc device driver.
de: Dies ist eine recht armselige Methode, auf die Uhr zuzugreifen, vor allem deshalb, weil Programme auf Anwenderebene generell nicht dafür bestimmt sind, direkte E/A-Vorgänge auszuführen und Interrupts zu deaktivieren. B<\%hwclock> bietet dies zum Testen, Fehlersuchen und da es auf ISA-kompatiblen Systemen, die über keinen funktionierenden RTC-Gerätetreiber verfügen, die einzige verfügbare Methode sein könnte.

source: The Hardware Clock is usually not very accurate. However, much of its inaccuracy is completely predictable - it gains or loses the same amount of time every day. This is called systematic drift. B<\%hwclock>'s B<\%--adjust> function lets you apply systematic drift corrections to the Hardware Clock.
de: Die Hardware-Uhr ist üblicherweise nicht sehr genau. Jedoch lässt sich die Genauigkeit recht gut vorhersagen – sie geht jeden Tag die gleiche Zeit vor oder nach. Dies nennt man die Systemabweichung. Mit der Funktion B<\%--adjust> von B<hwclock> können Sie die Systemabweichung der Hardware-Uhr korrigieren.

source: It works like this: B<\%hwclock> keeps a file, I</etc/adjtime>, that keeps some historical information. This is called the adjtime file.
de: Es funktioniert folgendermaßen: B<\%hwclock> verwaltet die Datei I</etc/adjtime>, in der einige historische Informationen gespeichert sind. Diese Datei wird adjtime-Datei genannt.
