Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: Suppose you start with no adjtime file. You issue a B<\%hwclock\ --set> command to set the Hardware Clock to the true current time. B<\%hwclock> creates the adjtime file and records in it the current time as the last time the clock was calibrated. Five days later, the clock has gained 10 seconds, so you issue a B<\%hwclock\ --set\ --update-drift> command to set it back 10 seconds. B<\%hwclock> updates the adjtime file to show the current time as the last time the clock was calibrated, and records 2 seconds per day as the systematic drift rate. 24 hours go by, and then you issue a B<\%hwclock\ --adjust> command. B<\%hwclock> consults the adjtime file and sees that the clock gains 2 seconds per day when left alone and that it has been left alone for exactly one day. So it subtracts 2 seconds from the Hardware Clock. It then records the current time as the last time the clock was adjusted. Another 24 hours go by and you issue another B<\%hwclock\ --adjust>. B<\%hwclock> does the same thing: subtracts 2 seconds and updates the adjtime file with the current time as the last time the clock was adjusted.
de: Nehmen wir an, Sie beginnen ohne adjtime-Datei. Sie rufen den Befehl B<\%hwclock\ --set> auf, um die Hardware-Uhr auf die tatsächliche aktuelle Zeit zu stellen. B<\%hwclock> legt die adjtime-Datei an und zeichnet darin die Zeit als jene der letzten Kalibrierung der Uhr auf. Fünf Tage später geht die Uhr 10 Sekunden vor, und Sie rufen B<\%hwclock\ --set\ --update-drift> auf, um die Uhr 10 Sekunden zurückzustellen. B<\%hwclock> aktualisiert die adjtime-Datei, zeichnet wiederum die aktuelle Zeit als den Zeitpunkt der letzten Kalibrierung auf, wobei diesmal 2 Sekunden pro Tag als systematische Abweichung protokolliert werden. 24 Stunden später rufen Sie den Befehl B<\%hwclock\ --adjust> auf. B<\%hwclock> befragt die adjtime-Datei und stellt fest, dass die Uhr, wenn sie nicht korrigiert wird, 2 Sekunden pro Tag vorgeht. So zieht es die 2 Sekunden von der Zeit der Hardware-Uhr ab, da die Uhr genau 24 Stunden nicht korrigiert wurde. Die aktuelle Zeit wird auch wieder als die Zeit der letzten Kalibrierung aufgezeichnet. Noch einmal 24 Stunden später funktioniert der Befehl B<\%hwclock\ --adjust> wieder auf die gleiche Weise: B<\%hwclock> zieht 2 Sekunden ab und aktualisiert die adjtime-Datei mit der aktuellen Zeit als letztem Kalibrierungszeitpunkt der Uhr.

source: When you use the B<\%--update-drift> option with B<--set> or B<\%--systohc>, the systematic drift rate is (re)calculated by comparing the fully drift corrected current Hardware Clock time with the new set time, from that it derives the 24 hour drift rate based on the last calibrated timestamp from the adjtime file. This updated drift factor is then saved in I</etc/adjtime>.
de: Wenn Sie die Option B<\%--update-drift> mit B<--set> oder B<\%--systohc> verwenden, wird die automatische Abweichungsrate durch Vergleich der vollabweichungskorrigerten Hardware-Uhr mit der jetzt gesetzten Zeit (neu) berechnet. Daraus wird die 24-Stunden-Abweichungsrate basierend auf dem letzten kalibrierten Zeitstempel aus der Adjtime-Datei abgeleitet. Dieser aktualisierte Abweichungsfaktor wird dann in I</etc/adjtime> gespeichert.

source: A small amount of error creeps in when the Hardware Clock is set, so B<\%--adjust> refrains from making any adjustment that is less than 1 second. Later on, when you request an adjustment again, the accumulated drift will be more than 1 second and B<\%--adjust> will make the adjustment including any fractional amount.
de: Kleinere Fehler schleichen sich beim Stellen der Hardware-Uhr ein, daher unterlässt B<\%--adjust> Korrekturen von weniger als einer Sekunde. Wenn Sie zu einem späteren Zeitpunkt erneut die Uhr stellen wollen, wird die aufgesammelte Abweichung nun mehr als eine Sekunde betragen und B<\%--adjust> führt die Korrektur einschließlich eines Bruchanteils aus.

source: B<\%hwclock\ --hctosys> also uses the adjtime file data to compensate the value read from the Hardware Clock before using it to set the System Clock. It does not share the 1 second limitation of B<\%--adjust>, and will correct sub-second drift values immediately. It does not change the Hardware Clock time nor the adjtime file. This may eliminate the need to use B<\%--adjust>, unless something else on the system needs the Hardware Clock to be compensated.
de: B<\%hwclock\ --hctosys> verwendet auch die Adjtime-Dateidaten, um den Wert aus der Hardware-Uhr auszugleichen, bevor es die Systemuhr stellt. Es teilt nicht die 1-Sekunden-Begrenzung von B<\%--adjust> und wird Teilsekundenabweichungen sofort korrigieren. Es ändert weder die Hardware-Uhr noch die Adjtime-Datei. Dies könnte die Notwendigkeit von B<\%--adjust> beseitigen, außer etwas anderes auf dem System benötigt die Ausgleichung der Hardware-Uhr.

source: Line 1: Three numbers, separated by blanks: 1) the systematic drift rate in seconds per day, floating point decimal; 2) the resulting number of seconds since 1969 UTC of most recent adjustment or calibration, decimal integer; 3) zero (for compatibility with B<\%clock>(8)) as a floating point decimal.
de: Zeile 1: drei Zahlen, durch Leerzeichen getrennt: 1) die systematische Abweichung in Sekunden pro Tag als dezimale Fließkommazahl; 2) die sich ergebende Anzahl der Sekunden seit 1969 Weltzeit gemäß der letzten Anpassung oder Kalibrierung als dezimale Ganzzahl; 3) Null (zwecks Kompatibilität zu B<\%clock>(8)) als dezimale Gleitkommazahl.

source: Line 2: One number: the resulting number of seconds since 1969 UTC of most recent calibration. Zero if there has been no calibration yet or it is known that any previous calibration is moot (for example, because the Hardware Clock has been found, since that calibration, not to contain a valid time). This is a decimal integer.
de: Zeile 2: eine Zahl: die sich ergebende Anzahl der Sekunden seit 1969 Weltzeit gemäß der letzten Kalibrierung. Dies ist Null, falls noch keine Kalibrierung ausgeführt wurde oder eine frühere Kalibrierung fehlschlug (zum Beispiel wurde die Hardware-Uhr seit der Kalibrierung zwar gefunden, enthielt aber keine gültige Zeit). Dies ist eine dezimale Ganzzahl.

source: Line 3: "UTC" or "LOCAL". Tells whether the Hardware Clock is set to Coordinated Universal Time or local time. You can always override this value with options on the B<\%hwclock> command line.
de: Zeile 3: »UTC« oder »LOCAL«. Dies gibt an, ob die Hardware-Uhr auf lokale Zeit oder Weltzeit eingestellt ist. Sie können diesen Wert stets mit den Befehlszeilenoptionen zu B<\%hwclock> außer Kraft setzen.

source: You can use an adjtime file that was previously used with the B<\%clock>(8) program with B<\%hwclock>.
de: Sie können eine adjtime-Datei, die früher bereits mit dem Programm B<\%clock>(8) genutzt wurde, auch mit B<\%hwclock> verwenden.

source: You should be aware of another way that the Hardware Clock is kept synchronized in some systems. The Linux kernel has a mode wherein it copies the System Time to the Hardware Clock every 11 minutes. This mode is a compile time option, so not all kernels will have this capability. This is a good mode to use when you are using something sophisticated like NTP to keep your System Clock synchronized. (NTP is a way to keep your System Time synchronized either to a time server somewhere on the network or to a radio clock hooked up to your system. See RFC 1305.)
de: Es gibt auf einigen Systemen einen weiteren Weg, die Hardware-Uhr synchron zu halten. Der Linux-Kernel verfügt über einen Modus, in dem in Abständen von 11 Minuten die Systemzeit in die Hardware-Uhr kopiert wird. Dieser Modus wird beim Kompilieren ausgewählt, daher werden nicht alle Kernel über diese Fähigkeit verfügen. Dieser Modus ist sinnvoll, wenn Sie etwas Fortschrittliches wie NTP verwenden, um die Systemuhr synchron zu halten. (NTP bezeichnet die Synchronisation der Systemzeit entweder über einen Zeitserver im Netzwerk oder über eine an Ihrem System angeschlossene Funkuhr, siehe RFC 1305.)

source: If the kernel is compiled with the \%'11\ minute\ mode' option it will be active when the kernel's clock discipline is in a synchronized state. When in this state, bit 6 (the bit that is set in the mask 0x0040) of the kernel's I<\%time_status> variable is unset. This value is output as the 'status' line of the B<\%adjtimex\ --print> or B<\%ntptime> commands.
de: Falls der Kernel mit der Option \%»11\-Minuten\-Modus« übersetzt ist, wird er aktiv sein, wenn sich die Uhrdisziplin des Kernels in einem synchronisierten Zustand befindet. In diesem Zustand ist das Bit 6 (das Bit, das mit der Maske 0x0040 gesetzt wird) der Kernelvariablen I<\%time_status> nicht gesetzt. Der Wert wird als »Status«-Zeile der Befehle B<\%adjtimex\ --print> oder B<\%ntptime> ausgegeben.

source: It takes an outside influence, like the NTP daemon to put the kernel's clock discipline into a synchronized state, and therefore turn on \%'11\ minute\ mode'. It can be turned off by running anything that sets the System Clock the old fashioned way, including B<\%hwclock\ --hctosys>. However, if the NTP daemon is still running, it will turn \%'11\ minute\ mode' back on again the next time it synchronizes the System Clock.
de: Es bedarf eines Einflusses von außen, wie des NTP-Daemons, um die Uhrdisziplin des Kernels in einen synchronisierten Status zu bringen und damit den \%» 11\-Minuten\-Modus« zu aktivieren. Dieser kann durch die Ausführung von allem, die die Systemuhr auf die althergekommene Art setzt, wie B<\%hwclock\ --hctosys>, wieder ausgeschaltet werden. Falls der NTP-Daemon allerdings noch läuft, wird er den \%» 11\-Minuten\-Modus« beim nächsten Synchronisieren der Systemuhr wieder einschalten.

source: If your system runs with \%'11\ minute\ mode' on, it may need to use either B<\%--hctosys> or B<\%--systz> in a startup script, especially if the Hardware Clock is configured to use the local timescale. Unless the kernel is informed of what timescale the Hardware Clock is using, it may clobber it with the wrong one. The kernel uses UTC by default.
de: Falls Ihr System mit aktiviertem \%»11\-Minuten\-Modus« läuft, könnte die Verwendung von entweder B<\%--hctosys> oder B<\%--systz> in den Systemstartskripten notwendig sein, insbesondere falls die Hardware-Uhr auf die lokale Zeitskala konfiguriert ist. Falls der Kernel nicht informiert ist, unter welcher Zeitskala die Hardware-Uhr läuft, könnte er sie mit der falschen verfremden. Der Kernel verwendet standardmäßig UTC.

source: The first userspace command to set the System Clock informs the kernel what timescale the Hardware Clock is using. This happens via the I<\%persistent_clock_is_local> kernel variable. If B<\%--hctosys> or B<\%--systz> is the first, it will set this variable according to the adjtime file or the appropriate command-line argument. Note that when using this capability and the Hardware Clock timescale configuration is changed, then a reboot is required to notify the kernel.
de: Der erste Benutzerraumbefehl, der die Systemuhr setzt, informiert den Kernel, welche Zeitskala die Hardware-Uhr verwendet. Dies passiert über die Kernelvariable I<\%persistent_clock_is_local>. Falls B<\%--hctosys> oder B<\%--systz> der Erste ist, wird es diese Variable entsprechend der Adjtime-Datei oder dem geeigneten Befehlszeilenargument setzen. Beachten Sie, dass der Einsatz dieser Fähigkeit erfordert, dass bei Änderung der Hardware-Uhr-Zeitskalenkonfiguration ein Systemneustart zur Information des Kernels benötigt wird.

source: B<\%hwclock\ --adjust> should not be used with NTP \%'11\ minute\ mode'.
de: B<\%hwclock\ --adjust> sollte nicht zusammen mit NTPs \%»11-Minute-Modus« verwandt werden.

source: There is some sort of standard that defines CMOS memory Byte 50 on an ISA machine as an indicator of what century it is. B<\%hwclock> does not use or set that byte because there are some machines that don't define the byte that way, and it really isn't necessary anyway, since the year-of-century does a good job of implying which century it is.
de: Es gibt eine Art von Standard, der das CMOS-Speicherbyte 50 auf einer ISA-Maschine als Anzeiger für das aktuelle Jahrhundert verwendet. B<\%hwclock> nutzt oder setzt dieses Byte nicht, da es einige Maschinen gibt, die das Byte nicht auf diese Weise definieren und es sowieso unnötig ist. Das year-of-century leistet gute Arbeit beim Ermitteln des aktuellen Jahrhunderts.

source: If you have a bona fide use for a CMOS century byte, contact the B<\%hwclock> maintainer; an option may be appropriate.
de: Falls Sie einen echten Anwendungsfall für das CMOS-Century-Byte haben, kontaktieren Sie den Betreuer von B<\%hwclock>, eine Option könnte hier zweckdienlich sein.

source: Note that this section is only relevant when you are using the "direct ISA" method of accessing the Hardware Clock. ACPI provides a standard way to access century values, when they are supported by the hardware.
de: Beachten Sie, dass dieser Abschnitt nur relevant ist, wenn Sie die »Direct ISA«-Methode für den Zugriff auf die Hardware-Uhr verwenden. ACPI bietet eine standardisierte Zugriffsmöglichkeit auf die Jahrhundertwerte an, sofern diese von der Hardware unterstützt werden.

source: The system timezone is configured for the correct local time. See below, under B<POSIX vs 'RIGHT'>.
de: Die Systemzeitzone ist für die korrekte lokale Zeit konfiguriert. Siehe unten unter B<POSIX kontra »KORREKT«>.

source: Early during startup the following are called, in this order:
de: Früh während des Systemstarts wird folgendes in dieser Reihenfolge aufgerufen:

source: B<\%adjtimex\ --tick>I<\ value\ >B<--frequency>I<\ value>
de: B<\%adjtimex\ --tick>I<\ Wert\ >B<--frequency>I<\ Wert>

source: During shutdown the following is called:
de: Während des Herunterfahrens wird folgendes aufgerufen:

source: B<*> Systems without B<adjtimex> may use B<ntptime>.
de: B<*> Systeme ohne B<adjtimex> können B<ntptime> verwenden.

source: The first step in making that happen is having a clear understanding of the big picture. There are two completely separate hardware devices running at their own speed and drifting away from the 'correct' time at their own rates. The methods and software for drift correction are different for each of them. However, most systems are configured to exchange values between these two clocks at startup and shutdown. Now the individual device's time keeping errors are transferred back and forth between each other. Attempt to configure drift correction for only one of them, and the other's drift will be overlaid upon it.
de: Im ersten Schritt dafür muss ein klares Verständnis des Gesamtbildes erreicht werden. Es gibt zwei komplett getrennte Hardwaregeräte, die alleine in ihrer eigenen Geschwindigkeit laufen und von der »korrekten« Zeit mit ihrer eigenen Rate abweichen. Die Methoden und Software für die Abweichungskorrektur unterscheiden sich für beide. Allerdings sind die meisten Systeme so konfiguriert, dass die beiden Uhren beim Systemstart und -herunterfahren die Werte austauschen. Dadurch werden die Fehlerkorrekturwerte der einzelnen Geräte zwischen beiden hin und her übertragen. Wird versucht, nur bei einem von ihnen eine Abweichungskorrektur vorzunehmen, wird die Abweichung des anderen Geräts darübergelegt.

source: This problem can be avoided when configuring drift correction for the System Clock by simply not shutting down the machine. This, plus the fact that all of B<\%hwclock>'s precision (including calculating drift factors) depends upon the System Clock's rate being correct, means that configuration of the System Clock should be done first.
de: Dieses Problem kann bei Konfiguration der Abweichung der Systemuhr vermieden werden, indem die Maschine nicht heruntergefahren wird. Dies und der Tatsache, dass die gesamte Präzision von B<\%hwclock> (einschließlich der Berechnung des Abweichungsfaktors) von der Korrektheit der Systemuhrrate abhängt, bedeutet, dass die Konfiguration der Systemuhr zuerst erfolgen sollte.

source: The System Clock drift is corrected with the B<\%adjtimex>(8) command's B<--tick> and B<\%--frequency> options. These two work together: tick is the coarse adjustment and frequency is the fine adjustment. (For systems that do not have an B<\%adjtimex> package, B<\%ntptime\ -f\ >I<ppm> may be used instead.)
de: Die Abweichung der Systemuhr wird mit den Optionen B<--tick> und B<\%--frequency> des Befehls B<\%adjtimex>(8) korrigiert. Diese zwei Optionen arbeiten zusammen: »tick« ist die grobe und »frequency« die feine Anpassung. (Für Systeme, die kein Paket B<\%adjtimex> haben, kann eventuell stattdessen B<\%ntptime\ -f\ >I<ppm> verwandt werden.)

source: Some Linux distributions attempt to automatically calculate the System Clock drift with B<\%adjtimex>'s compare operation. Trying to correct one drifting clock by using another drifting clock as a reference is akin to a dog trying to catch its own tail. Success may happen eventually, but great effort and frustration will likely precede it. This automation may yield an improvement over no configuration, but expecting optimum results would be in error. A better choice for manual configuration would be B<\%adjtimex>'sB< --log >options.
de: Einige Linux-Distributionen versuchen, die Abweichung der Systemuhr mit der Vergleichsaktion von B<\%adjtimex> automatisch zu berechnen. Der Versuch, eine abweichende Uhr mittels einer anderen abweichenden Uhr als Referenz zu korrigieren, gleicht dem Versuch eines Hundes, seinen eigenen Schwanz zu fangen. Es mag irgendwann von Erfolg gekrönt sein, aber vorher ist großer Aufwand und viel Frust involviert. Diese Automatisierung mag eine Verbesserung gegenüber keiner Konfiguration sein, aber optimale Ergebnisse zu erwarten, wäre fehlerhaft. Eine bessere Wahl für eine manuelle Konfiguration wäre die Option B<--log> von B<\%adjtimex>.

source: It may be more effective to simply track the System Clock drift with B<\%sntp>, or B<\%date\ -Ins> and a precision timepiece, and then calculate the correction manually.
de: Es mag effizienter sein, einfach die Abweichung der Systemuhr mit B<\%sntp> oder B<\%date\ -Ins> und einem genauen Zeitstück nachzuverfolgen und dann die Abweichung manuell zu berechnen.

source: After setting the tick and frequency values, continue to test and refine the adjustments until the System Clock keeps good time. See B<\%adjtimex>(2) for more information and the example demonstrating manual drift calculations.
de: Nach dem Setzen der Tick- und Frequenzwerte fahren Sie mit dem Prüfen und Verfeinern der Anpassungen fort, bis die Systemuhr eine gute Zeit hält. Siehe B<\%adjtimex>(2) für weitere Informationen und ein Beispiel, das die manuelle Abweichungskorrektur zeigt.

source: As a rule, cold drift will work best for most use cases. This should be true even for 24/7 machines whose normal downtime consists of a reboot. In that case the drift factor value makes little difference. But on the rare occasion that the machine is shut down for an extended period, then cold drift should yield better results.
de: In der Regel funktioniert die kalte Abweichung in den meisten Fällen am besten. Dies sollte sogar auf Maschinen zutreffen, die 24/7 laufen und deren normale Auszeit aus einem Systemneustart besteht. In diesen Fällen stellt der Abweichungsfaktor kaum einen Unterschied dar. Aber in den seltenen Fällen, in denen die Maschine für eine längere Zeit ausgeschaltet wird, sollte die kalte Abweichung zu besseren Ergebnissen führen.

source: TheI< System Clock >time must be correct at shutdown!
de: Beim Herunterfahren muss die Zeit der I<Systemuhr> korrekt sein!

source: Immediately use B<hwclock> to set the correct time, adding the B<\%--update-drift> option.
de: Verwenden Sie sofort B<hwclock>, um die korrekte Zeit zu setzen, fügen Sie dabei die Option B<\%--update-drift> hinzu.

source: Note: if step 6 uses B<\%--systohc>, then the System Clock must be set correctly (step 6a) just before doing so.
de: Hinweis: Falls in Schritt 6 B<\%--systohc> verwandt wird, muss davor die Systemuhr korrekt gesetzt werden (Schritt 6a).

source: Having B<hwclock> calculate the drift factor is a good starting point, but for optimal results it will likely need to be adjusted by directly editing the I</etc/adjtime> file. Continue to test and refine the drift factor until the Hardware Clock is corrected properly at startup. To check this, first make sure that the System Time is correct before shutdown and then use B<\%sntp>, or B<\%date\ -Ins> and a precision timepiece, immediately after startup.
de: Die Berechnung des Abweichungsfaktors mit B<hwclock> ist ein guter Startpunkt, aber für optimale Ergebnisse wird es wahrscheinlich notwendig sein, dies durch direkte Bearbeitung der Datei I</etc/adjtime> anzupassen. Fahren Sie fort, den Abweichungsfaktor zu testen und verfeinern, bis die Hardware-Uhr beim Systemstart korrekt eingestellt ist. Um dies zu überprüfen, stellen Sie erst sicher, dass die Systemzeit vor dem Herunterfahren korrekt ist und dann verwenden Sie direkt nach dem Starten B<\%sntp> oder B<\%date\ -Ins> und eine Präzisionsuhr.

source: The Hardware Clock on an ISA compatible system keeps only a date and time, it has no concept of timezone nor daylight saving. Therefore, when B<hwclock> is told that it is in local time, it assumes it is in the 'correct' local time and makes no adjustments to the time read from it.
de: Die Hardware-Uhr auf einem ISA-kompatiblen System hält nur ein Datum und eine Zeit. Sie kennt weder das Konzept der Zeitzone noch der Sommer-/Winterzeit. Daher nimmt B<hwclock>, wenn ihm mitgeteilt wird, dass es in lokaler Zeit läuft, an, dass es sich in der »korrekten« lokalen Zeit befindet und führt keine Anpassungen für die aus ihr gelesene Zeit durch.

source: Linux handles daylight saving time changes transparently only when the Hardware Clock is kept in the UTC timescale. Doing so is made easy for system administrators as B<\%hwclock> uses local time for its output and as the argument to the B<\%--date> option.
de: Linux führt den Sommer-/Winterzeitwechsel nur korrekt durch, wenn die Hardware-Uhr in der UTC-Zeitskala läuft. Dies wird Systemadministratoren erleichtert, da B<\%hwclock> die lokale Zeit für seine Ausgabe und als Argument für die Option B<\%--date> verwendet.

source: POSIX systems, like Linux, are designed to have the System Clock operate in the UTC timescale. The Hardware Clock's purpose is to initialize the System Clock, so also keeping it in UTC makes sense.
de: POSIX-Systeme sind wie Linux so entwickelt, dass die Systemuhr in der UTC-Zeitskala läuft. Der Zweck der Hardware-Uhr liegt darin, die Systemuhr zu initialisieren, daher ergibt ein Betrieb in UTC Sinn.

source: POSIX vs 'RIGHT'
de: POSIX kontra »KORREKT«

source: A discussion on date-time configuration would be incomplete without addressing timezones, this is mostly well covered by B<tzset>(3). One area that seems to have no documentation is the 'right' directory of the Time Zone Database, sometimes called tz or zoneinfo.
de: Eine Diskussion der Datum/Zeit-Konfiguration wäre allerdings unvollständig, ohne Zeitzonen zu behandeln. Dies wird gut in B<tzset>(3) abgedeckt. Ein Punkt, für den es keine Dokumentation gibt, ist das »korrekte« Verzeichnis der Zeitzonendatenbank, manchmal auch tz oder Zoneinfo genannt.
