Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: There are two separate databases in the zoneinfo system, posix and 'right'. 'Right' (now named zoneinfo-leaps) includes leap seconds and posix does not. To use the 'right' database the System Clock must be set to \%(UTC\ +\ leap seconds), which is equivalent to \%(TAI\ -\ 10). This allows calculating the exact number of seconds between two dates that cross a leap second epoch. The System Clock is then converted to the correct civil time, including UTC, by using the 'right' timezone files which subtract the leap seconds. Note: this configuration is considered experimental and is known to have issues.
de: Es gibt zwei getrennte Datenbanken in dem Zoneinfo-System, POSIX und »korrekt«. »Korrekt« (jetzt Zoneinfo-leaps genannt) enthält Schaltsekunden, POSIX nicht. Um die »korrekte« Datenbank zu verwenden, muss die Systemuhr auf \%(UTC\ +\ Schaltsekunden) gesetzt sein, was zu \%(TAI\ -\ 10) äquivalent ist. Dies ermöglicht es, die genaue Anzahl von Sekunden zwischen zwei Daten zu berechnen, wenn dabei ein Schaltesekundenzeitraum durchlaufen wird. Die Systemuhr wird dann in die korrekte zivile Zeit, einschließlich UTC, umgewandelt, indem die »korrekten« Zeitzonendateien verwandt werden, die die Schaltsekunden abziehen. Hinweis: Diese Konfiguration wird als experimentell bezeichnet und hat bekanntermaßen Probleme.

source: To configure a system to use a particular database all of the files located in its directory must be copied to the root of I<\%/usr/share/zoneinfo>. Files are never used directly from the posix or 'right' subdirectories, e.g., \%TZ='I<right/Europe/Dublin>'. This habit was becoming so common that the upstream zoneinfo project restructured the system's file tree by moving the posix and 'right' subdirectories out of the zoneinfo directory and into sibling directories:
de: Um ein System zur Verwendung einer bestimmten Datenbank zu konfigurieren, müssen alle in seinem Verzeichnis befindliche Dateien in die Wurzel von I<\%/usr/share/zoneinfo> kopiert werden. Dateien werden nie vom POSIX- oder »korrekten« Unterverzeichnis benutzt, z.B. \%TZ='I<right/Europe/Dublin>'. Diese Gepflogenheit wurde so üblich, dass die Originalentwickler des Zoneinfo-Projekts den Systemdateibaum restrukturierten, indem sie die POSIX- und »korrekten« Unterverzeichnisse aus dem Zoeninfo-Verzeichnis und in benachbarte Verzeichnisse verschoben:

source: Unfortunately, some Linux distributions are changing it back to the old tree structure in their packages. So the problem of system administrators reaching into the 'right' subdirectory persists. This causes the system timezone to be configured to include leap seconds while the zoneinfo database is still configured to exclude them. Then when an application such as a World Clock needs the South_Pole timezone file; or an email MTA, or B<hwclock> needs the UTC timezone file; they fetch it from the root of I<\%/usr/share/zoneinfo> , because that is what they are supposed to do. Those files exclude leap seconds, but the System Clock now includes them, causing an incorrect time conversion.
de: Unglücklicherweise ändern einige Linux-Distributionen dies in ihren Paketen wieder auf die alte Struktur zurück. Daher besteht das Problem der Systemadministratoren, die in das »korrekte« Unterverzeichnis hineingreifen, weiter fort. Dies führt dazu, dass die Systemzeitzone konfiguriert wird, Schaltsekunden zu beachten, während die Zoneinfo-Datenbank weiterhin so konfiguriert ist, sie auszuschließen. Wenn dann eine Anwendung wie die »World Clock« die Zeitzonendatei South_Pole benötigt oder ein E-Mail-MTA oder B<hwclock> die UTC-Zeitzonen-Datei benötigen, holen sie sie von der Wurzel von I<\%/usr/share/zoneinfo>, da das so von ihnen erwartet wird. Diese Dateien schließen Schaltsekunden aus, aber die Systemuhr berücksichtigt sie, wodurch eine falsche Umwandlung hervorgerufen wird.

source: Attempting to mix and match files from these separate databases will not work, because they each require the System Clock to use a different timescale. The zoneinfo database must be configured to use either posix or 'right', as described above, or by assigning a database path to the
de: Der Versuch, Dateien aus diesen getrennten Datenbanken vermischt zu benutzen, wird nicht funktionieren, da sie von der Systemuhr verlangen, eine andere Zeitskala zu verwenden. Die Zoneinfo-Datenbank muss wie oben beschrieben konfiguriert werden, entweder die POSIX oder »korrekte« zu benutzen, oder indem der Umgebungsvariablen

source: environment variable.
de: ein Datenbankpfad zugewiesen wird.

source: B<EXIT_SUCCESS> ('0' on POSIX systems)
de: B<EXIT_SUCCESS> (»0« auf POSIX-Systemen)

source: B<EXIT_FAILURE> ('1' on POSIX systems)
de: B<EXIT_FAILURE> (»1« auf POSIX-Systemen)

source: The configuration and state file for hwclock.
de: Die Konfiguration und die Zustandsdateien für Hwclock.

source: Device files B<hwclock> may try for Hardware Clock access:
de: Gerätedateien, die B<hwclock> für den Zugriff auf die Hardware-Uhr versuchen darf:

source: Written by Bryan Henderson, September 1996 (bryanh@giraffe-data.com), based on work done on the B<\%clock>(8) program by Charles Hedrick, Rob Hooft, and Harald Koenig. See the source code for complete history and credits.
de: Geschrieben von Bryan Henderson, September 1996 (bryanh@giraffe-data.com), basierend auf dem Programm B<\%clock>(8) von Charles Hedrick, Rob Hooft und Harald Koenig. Im Quellcode finden Sie die vollständige Geschichte einschließlich der Danksagungen.

source: The hwclock command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl hwclock ist Teil des Pakets util-linux und kann von https://www.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.

source: The kernel also keeps a timezone value, the B<--hctosys> function sets it to the timezone configured for the system. The system timezone is configured by the TZ environment variable or the I</etc/localtime> file, as B<tzset>(3) would interpret them. The obsolete I<tz_dsttime> field of the kernel\(cqs timezone value is set to zero. (For details on what this field used to mean, see B<settimeofday>(2).)
de: Der Kernel hält auch einen Zeitzonenwert, die Funktion B<--hctosys> setzt ihn auf den für das System konfigurierten Wert. Die Systemzeitzone wird durch die TZ-Umgebungsvariable oder die Datei I</etc/localtime> konfiguriert, wie B<tzset>(3) sie interpretieren würde. Das veraltete Feld I<tz_dsttime> des Kernel-Zeitzonenwerts wird auf Null gesetzt. Details zur ehemaligen Bedeutung dieses Feldes finden Sie in B<settimeofday>(2).
