Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: Override B<hwclock>\(aqs default rtc device file name. Otherwise it will use the first one found in this order: I</dev/rtc0>, I</dev/rtc>, I</dev/misc/rtc>. For B<IA-64:> I</dev/efirtc> I</dev/misc/efirtc>
de: Setzt den Vorgabe-RTC-Dateinamen von B<hwclock> außer Kraft. Andernfalls wird der erste aus der folgenden Liste (in dieser Reihenfolge) verwendet: I</dev/rtc0>, I</dev/rtc>, I</dev/misc/rtc>. Für B<IA-64:> I</dev/efirtc> I</dev/misc/efirtc>

source: Indicate which timescale the Hardware Clock is set to.
de: zeigt an, auf welche Zeitskala die Hardware-Uhr gesetzt ist.

source: The Hardware Clock may be configured to use either the UTC or the local timescale, but nothing in the clock itself says which alternative is being used. The B<--localtime> or B<--utc> options give this information to the B<hwclock> command. If you specify the wrong one (or specify neither and take a wrong default), both setting and reading the Hardware Clock will be incorrect.
de: Die Hardware-Uhr kann konfiguriert sein, entweder UTC oder die lokale Zeitskala zu verwenden, allerdings gibt es nichts in der Uhr, das angibt, welche der Varianten gewählt wurde. Die Optionen B<--localtime> und B<--utc> übergeben diese Information an den Befehl B<hwclock>. Falls Sie das Falsche angeben (oder keines angeben und die falsche Voreinstellung nehmen), werden sowohl das Setzen als auch das Lesen der Hardware-Uhr inkorrekt sein.

source: If you specify neither B<--utc> nor B<--localtime> then the one last given with a set function (B<--set>, B<--systohc>, or B<--adjust>), as recorded in I</etc/adjtime>, will be used. If the adjtime file doesn\(cqt exist, the default is UTC.
de: Falls Sie weder B<--utc> noch B<--localtime> angeben, dann wird die zuletzt mit der Setzen-Funktion (B<--set>, B<--systohc> oder B<\%--adjust>) verwendete benutzt, wie dies in I</etc/adjtime> aufgezeichnet ist. Falls die adjtime-Datei nicht existiert, wird UTC als Vorgabe verwendet.

source: Note: daylight saving time changes may be inconsistent when the Hardware Clock is kept in local time. See the discussion below, under B<LOCAL vs UTC>.
de: Hinweis: Zeitübergangs-Änderungen können inkonsistent sein, falls die Hardware-Uhr in lokaler Zeit betrieben wird. Lesen Sie die Diskussion weiter unten unter B<LOKAL vs. UTC>.

source: Disable the facilities provided by I</etc/adjtime>. B<hwclock> will not read nor write to that file with this option. Either B<--utc> or B<--localtime> must be specified when using this option.
de: deaktiviert die von I</etc/adjtime> bereitgestellten Leistungen. B<hwclock> liest oder schreibt nicht in diese Datei, wenn diese Option angegeben ist. Entweder B<--utc> oder B<\%--localtime> müssen mit dieser Option angegeben werden.

source: Do not actually change anything on the system, that is, the Clocks or I</etc/adjtime> (B<--verbose> is implicit with this option).
de: ändert tatsächlich nichts am System, d.h. die Uhren oder I</etc/adjtime> (diese Option impliziert B<--verbose>).

source: Update the Hardware Clock\(cqs drift factor in I</etc/adjtime>. It can only be used with B<--set> or B<--systohc>.
de: aktualisiert den Abweichungsfaktor der Hardware-Uhr in I</etc/adjtime>. Sie kann nur zusammen mit B<--set> oder B<--systohc> verwendet werden.

source: A minimum four hour period between settings is required. This is to avoid invalid calculations. The longer the period, the more precise the resulting drift factor will be.
de: Zwischen Einstellungen ist minimal ein Abstand von vier Stunden notwendig. Damit werden ungültige Berechnungen vermieden. Je länger die Periode, desto präziser wird der sich ergebende Abweichungsfaktor sein.

source: This option was added in v2.26, because it is typical for systems to call B<hwclock --systohc> at shutdown; with the old behavior this would automatically (re)calculate the drift factor which caused several problems:
de: Diese Option wurde in v2.26 hinzugefügt, da typischerweise auf Systemen beim Herunterfahren B<hwclock --systohc> aufgerufen wird. Mit dem alten Verhalten würde dabei automatisch der Abweichungsfaktor (neu) berechnet werden, wodurch mehrere Probleme entstanden:

source: When using NTP with an \(aq11 minute mode\(aq kernel the drift factor would be clobbered to near zero.
de: Wird NTP mit einem »11-Minuten-Modus«-Kernel verwandt, würde der Abweichungsfaktor auf fast Null verfremdet.

source: It would not allow the use of \(aqcold\(aq drift correction. With most configurations using \(aqcold\(aq drift will yield favorable results. Cold, means when the machine is turned off which can have a significant impact on the drift factor.
de: Es würde nicht die Verwendung von »kalter«-Abweichungskorrektur erlauben. Bei den meisten Konfigurationen führt die »kalte« Abweichungskorrektur zu besseren Ergebnissen. Kalt bedeutet, wenn die Maschine ausgeschaltet ist, was eine wesentliche Auswirkung auf den Abweichungsfaktor haben kann.

source: (Re)calculating drift factor on every shutdown delivers suboptimal results. For example, if ephemeral conditions cause the machine to be abnormally hot the drift factor calculation would be out of range.
de: (Neu-)Berechnung des Abweichungsfaktors bei jedem Herunterfahren führt zu suboptimalen Ergebnissen. Führen beispielsweise kurzzeitige Bedingungen dazu, dass die Maschine ungewöhnlich heiß wird, wäre die Abweichungsfaktorberechnung außerhalb des Gültigkeitsbereichs.

source: Significantly increased system shutdown times (as of v2.31 when not using B<--update-drift> the RTC is not read).
de: Signifikant erhöhte System-Runterfahrzeiten (bei v2.31 wird die RTC nicht gelesen, wenn B<--update-drift> nicht verwendet wird).

source: Having B<hwclock> calculate the drift factor is a good starting point, but for optimal results it will likely need to be adjusted by directly editing the I</etc/adjtime> file. For most configurations once a machine\(cqs optimal drift factor is crafted it should not need to be changed. Therefore, the old behavior to automatically (re)calculate drift was changed and now requires this option to be used. See the discussion below, under B<The Adjust Function>.
de: Die Berechnung des Abweichungsfaktors durch B<hwclock> ist ein guter Start, aber für optimale Ergebnisse wird wahrscheinlich die Datei I</etc/adjtime> direkt bearbeitet werden müssen. Bei den meisten Konfigurationen braucht die Abweichung nicht mehr verändert zu werden, sobald der optimale Abweichungsfaktor erstellt wurde. Daher wurde das alte Verhalten, die Abweichung automatisch (neu) zu berechnen, geändert und benötigt nun dafür eine Option. Lesen Sie die Diskussion weiter unten unter B<Die Adjust-Funktion>.

source: This option requires reading the Hardware Clock before setting it. If it cannot be read, then this option will cause the set functions to fail. This can happen, for example, if the Hardware Clock is corrupted by a power failure. In that case, the clock must first be set without this option. Despite it not working, the resulting drift correction factor would be invalid anyway.
de: Diese Option benötigt die Hardwareuhr vor ihrem Setzen. Falls sie nicht gelesen werden kann, wird diese Option zum Fehlschlag der Setzen-Funktion führen. Dies kann beispielsweise passieren, falls die Hardwareuhr durch einen Stromausfall beschädigt ist. In diesem Fall muss die Uhr zuerst ohne diese Option gesetzt werden. Abgesehen davon, dass sie nicht funktioniert, wäre der daraus resultierende Abweichungsfaktor sowieso ungültig.

source: Display more details about what B<hwclock> is doing internally.
de: zeigt mehr Details über die internen Vorgänge von B<hwclock> an.

source: NOTES
de: ANMERKUNGEN

source: Clocks in a Linux System
de: Uhren in einem Linux-System

source: There are two types of date-time clocks:
de: Es gibt zwei Arten von Datum-Zeit-Uhren:

source: B<The Hardware Clock:> This clock is an independent hardware device, with its own power domain (battery, capacitor, etc), that operates when the machine is powered off, or even unplugged.
de: B<Die Hardware-Uhr>: Diese Uhr ist ein unabhängiges Hardware-Gerät, mit seinem eigenen Energiebereich (Batterie, Kondensatoren, usw.), das läuft, wenn die Maschine ausgeschaltet oder sogar vom Netz getrennt ist.

source: On an ISA compatible system, this clock is specified as part of the ISA standard. A control program can read or set this clock only to a whole second, but it can also detect the edges of the 1 second clock ticks, so the clock actually has virtually infinite precision.
de: Auf einem ISA-kompatiblen System wird diese Uhr als Teil des ISA-Standards spezifiziert. Ein Steuerprogramm kann diese Uhr nur in ganzen Sekunden stellen oder auslesen, aber es kann auch die Signalübergänge der Ein-Sekunden-Impulse erkennen, so dass die Uhr über virtuell unendliche Präzision verfügt.

source: This clock is commonly called the hardware clock, the real time clock, the RTC, the BIOS clock, and the CMOS clock. Hardware Clock, in its capitalized form, was coined for use by B<hwclock>. The Linux kernel also refers to it as the persistent clock.
de: Diese Uhr wird allgemein die Hardware-Uhr, die Echtzeituhr, die RTC, die BIOS-Uhr oder die CMOS-Uhr genannt. Der Begriff Hardware-Uhr wurde für B<hwclock> gewählt. Der Linux-Kernel bezeichnet sie auch als beständige Uhr.

source: Some non-ISA systems have a few real time clocks with only one of them having its own power domain. A very low power external I2C or SPI clock chip might be used with a backup battery as the hardware clock to initialize a more functional integrated real-time clock which is used for most other purposes.
de: Einige Nicht-ISA-Systeme haben ein paar Echtzeituhren, wobei nur eine davon ihre eigene Energieversorgung hat. Ein sehr energiesparender externer I²C- oder SPI-Uhrchip könnte mit einer Stützbatterie als Hardware-Uhr fungieren, um eine funktionellere integrierte Echtzeituhr zu initialisieren, die für die meisten anderen Zwecke verwendet wird.

source: B<The System Clock:> This clock is part of the Linux kernel and is driven by a timer interrupt. (On an ISA machine, the timer interrupt is part of the ISA standard.) It has meaning only while Linux is running on the machine. The System Time is the number of seconds since 00:00:00 January 1, 1970 UTC (or more succinctly, the number of seconds since 1969 UTC). The System Time is not an integer, though. It has virtually infinite precision.
de: B<Die Systemuhr>: Diese Uhr ist Teil des Linux-Kernels und wird durch einen Timer-Interrupt gesteuert (auf einer ISA-Maschine ist der Timer-Interrupt Teil des ISA-Standards). Sie ist nur von Bedeutung, solange Linux auf der Maschine läuft. Die Systemzeit wird als die Anzahl der Sekunden seit dem 1. Januar 1970 um 00:00:00 Uhr Weltzeit ausgedrückt, oder anders formuliert, die Anzahl der seit 1969 UTC vergangenen Sekunden. Die Systemzeit ist dennoch keine Ganzzahl. Sie hat virtuell unbegrenzte Präzision.

source: The System Time is the time that matters. The Hardware Clock\(cqs basic purpose is to keep time when Linux is not running so that the System Clock can be initialized from it at boot. Note that in DOS, for which ISA was designed, the Hardware Clock is the only real time clock.
de: Die Systemzeit ist die Zeit, auf die es ankommt. Der grundlegende Zweck der Hardware-Uhr in einem Linux-System ist die Erhaltung der Zeit, wenn Linux nicht läuft, so dass die Systemzeit beim Systemstart daraus initialisiert werden kann. Beachten Sie, dass in DOS, wofür der ISA-Standard entworfen wurde, die Hardware-Uhr die einzig verfügbare Echtzeituhr ist.

source: It is important that the System Time not have any discontinuities such as would happen if you used the B<date>(1) program to set it while the system is running. You can, however, do whatever you want to the Hardware Clock while the system is running, and the next time Linux starts up, it will do so with the adjusted time from the Hardware Clock. Note: currently this is not possible on most systems because B<hwclock --systohc> is called at shutdown.
de: Es ist wichtig, dass die Zählung der Systemzeit nicht unterbrochen wird, zum Beispiel wenn Sie mit dem Befehl B<date>(1) die Systemzeit setzen, während das System läuft. Sie können dennoch im laufenden Betrieb mit der Hardware-Uhr tun, was Sie wollen, und beim nächsten Linux-Start wird die Zeit der Hardware-Uhr entsprechend angepasst. Hinweis: Derzeit ist dies auf den meisten Systemen nicht möglich, da beim Herunterfahren B<hwclock --systohc> aufgerufen wird.

source: The Linux kernel\(cqs timezone is set by B<hwclock>. But don\(cqt be misled \(em almost nobody cares what timezone the kernel thinks it is in. Instead, programs that care about the timezone (perhaps because they want to display a local time for you) almost always use a more traditional method of determining the timezone: They use the B<TZ> environment variable or the I</etc/localtime> file, as explained in the man page for B<tzset>(3). However, some programs and fringe parts of the Linux kernel such as filesystems use the kernel\(cqs timezone value. An example is the vfat filesystem. If the kernel timezone value is wrong, the vfat filesystem will report and set the wrong timestamps on files. Another example is the kernel\(cqs NTP \(aq11 minute mode\(aq. If the kernel\(cqs timezone value and/or the I<persistent_clock_is_local> variable are wrong, then the Hardware Clock will be set incorrectly by \(aq11 minute mode\(aq. See the discussion below, under B<Automatic Hardware Clock Synchronization by the Kernel>.
de: Die Zeitzone des Linux-Kernels wird durch B<hwclock> gesetzt. Aber lassen Sie sich nicht in die Irre führen – beinahe niemand interessiert sich dafür, was der Kernel meint, in welcher Zeitzone er sich befindet. Stattdessen müssen Programme, für die die Zeitzone wichtig ist (um Ihnen beispielsweise die lokale Zeit anzuzeigen), fast immer einen etwas traditionelleren Weg wählen, um die Zeitzone zu ermitteln: Sie benutzen die B<TZ>-Umgebungsvariable oder die Datei I</etc/localtime>, wie in der Handbuchseite zu B<tzset>(3) erklärt. Jedoch nutzen einige Programme und Teile des Linux-Kernels dessen Zeitzonenwert, zum Beispiel Dateisysteme. Ein Beispiel hierfür ist das vfat-Dateisystem. Ist der Zeitzonenwert im Kernel falsch gesetzt, werden vom vfat-Dateisystem falsche Zeitstempel gemeldet und gesetzt. Ein weiteres Beispiel ist der NTP-11-Minuten-Modus-Modus des Kernels. Falls der Zeitzonenwert des Kernels und/oder die Variable I<persistent_clock_is_local> falsch ist, dann wird die Hardware durch den 11-Minuten-Modus-Modus falsch gesetzt. Lesen Sie hierzu die Diskussion weiter unten, unter B<Automatischer Abgleich der Hardware-Uhr durch den Kernel>.

source: B<hwclock> sets the kernel\(cqs timezone to the value indicated by B<TZ> or I</etc/localtime> with the B<--hctosys> or B<--systz> functions.
de: B<hwclock> setzt den Kernel-Zeitzonenwert auf den durch die Umgebungsvariable B<TZ> oder aus I</etc/localtime> mit den Funktionen B<--hctosys> oder B<--systz> angegebenen Wert.

source: The kernel\(cqs timezone value actually consists of two parts: 1) a field tz_minuteswest indicating how many minutes local time (not adjusted for DST) lags behind UTC, and 2) a field tz_dsttime indicating the type of Daylight Savings Time (DST) convention that is in effect in the locality at the present time. This second field is not used under Linux and is always zero. See also B<settimeofday>(2).
de: Der Zeitzonenwert des Kernels besteht aus zwei Teilen: erstens dem Feld »tz_minuteswest«, das die Anzahl der Minuten angibt, die die lokale Zeit (nicht an Sommer-/Winterzeit angepasst) gegenüber der Weltzeit zurückbleibt, und zweitens dem Feld »tz_dsttime«, welches angibt, ob am entsprechenden Ort gerade Sommer- oder Winterzeit herrscht. Dieses zweite Feld wird unter Linux nicht genutzt und wird stets auf 0 gesetzt. Siehe auch B<settimeofday>(2).

source: Hardware Clock Access Methods
de: Zugriffsmethoden auf Hardware-Uhren

source: B<hwclock> uses many different ways to get and set Hardware Clock values. The most normal way is to do I/O to the rtc device special file, which is presumed to be driven by the rtc device driver. Also, Linux systems using the rtc framework with udev, are capable of supporting multiple Hardware Clocks. This may bring about the need to override the default rtc device by specifying one with the B<--rtc> option.
de: B<hwclock> verwendet viele verschiedene Arten, die Hardware-Uhr-Werte zu ermitteln und zu setzen. Der normale Weg besteht in E/A zu der besondere Datei des RTC-Geräts. Dabei wird angenommen, dass diese vom RTC-Treiber betrieben wird. Auch sind Linux-Systeme, die das RTC-Konzept mit Udev verwenden, in der Lage, mehrere Hardware-Uhren zu unterstützen. Damit könnte die Notwendigkeit entstehen, das Vorgabe-RTC-Gerät mit der Option B<--rtc> außer Kraft zu setzen.

source: However, this method is not always available as older systems do not have an rtc driver. On these systems, the method of accessing the Hardware Clock depends on the system hardware.
de: Allerdings ist diese Methode nicht immer verfügbar, da ältere Systeme über keinen RTC-Treiber verfügen. Auf diesen Systemen hängt die Art des Zugriffs auf die Hardware-Uhr von der Art der Systemhardware ab.

source: On an ISA compatible system, B<hwclock> can directly access the "CMOS memory" registers that constitute the clock, by doing I/O to Ports 0x70 and 0x71. It does this with actual I/O instructions and consequently can only do it if running with superuser effective userid. This method may be used by specifying the B<--directisa> option.
de: Auf einem ISA-kompatiblen System kann B<hwclock> direkt über Ein- und Ausgaben der Ports 0x70 und 0x71 auf die CMOS-Speicherregister zugreifen, welche die Uhr darstellen. Es werden E/A-Anweisungen verwendet, was konsequenterweise nur funktionieren kann, wenn diese mit der effektiven Benutzerkennung des Superusers aufgerufen werden. Diese Methode kann durch Angabe der Option B<--directisa> festgelegt werden.

source: This is a really poor method of accessing the clock, for all the reasons that userspace programs are generally not supposed to do direct I/O and disable interrupts. B<hwclock> provides it for testing, troubleshooting, and because it may be the only method available on ISA systems which do not have a working rtc device driver.
de: Dies ist eine recht armselige Methode, auf die Uhr zuzugreifen, vor allem deshalb, weil Programme auf Anwenderebene generell nicht dafür bestimmt sind, direkte E/A-Vorgänge auszuführen und Interrupts zu deaktivieren. B<hwclock> bietet dies zum Testen, Fehlersuchen und da es auf ISA-kompatiblen Systemen, die über keinen funktionierenden RTC-Gerätetreiber verfügen, die einzige verfügbare Methode sein könnte.

source: The Adjust Function
de: Die Adjust-Funktion

source: The Hardware Clock is usually not very accurate. However, much of its inaccuracy is completely predictable - it gains or loses the same amount of time every day. This is called systematic drift. B<hwclock>\(aqs B<--adjust> function lets you apply systematic drift corrections to the Hardware Clock.
de: Die Hardware-Uhr ist üblicherweise nicht sehr genau. Jedoch lässt sich die Genauigkeit recht gut vorhersagen – sie geht jeden Tag die gleiche Zeit vor oder nach. Dies nennt man die Systemabweichung. Mit der Funktion B<--adjust> von B<hwclock> können Sie die Systemabweichung der Hardware-Uhr korrigieren.

source: It works like this: B<hwclock> keeps a file, I</etc/adjtime>, that keeps some historical information. This is called the adjtime file.
de: Es funktioniert folgendermaßen: B<hwclock> verwaltet die Datei I</etc/adjtime>, in der einige historische Informationen gespeichert sind. Diese Datei wird adjtime-Datei genannt.

source: Suppose you start with no adjtime file. You issue a B<hwclock --set> command to set the Hardware Clock to the true current time. B<hwclock> creates the adjtime file and records in it the current time as the last time the clock was calibrated. Five days later, the clock has gained 10 seconds, so you issue a B<hwclock --set --update-drift> command to set it back 10 seconds. B<hwclock> updates the adjtime file to show the current time as the last time the clock was calibrated, and records 2 seconds per day as the systematic drift rate. 24 hours go by, and then you issue a B<hwclock --adjust> command. B<hwclock> consults the adjtime file and sees that the clock gains 2 seconds per day when left alone and that it has been left alone for exactly one day. So it subtracts 2 seconds from the Hardware Clock. It then records the current time as the last time the clock was adjusted. Another 24 hours go by and you issue another B<hwclock --adjust>. B<hwclock> does the same thing: subtracts 2 seconds and updates the adjtime file with the current time as the last time the clock was adjusted.
de: Nehmen wir an, Sie beginnen ohne adjtime-Datei. Sie rufen den Befehl B<hwclock\ --set> auf, um die Hardware-Uhr auf die tatsächliche aktuelle Zeit zu stellen. B<hwclock> legt die adjtime-Datei an und zeichnet darin die Zeit als jene der letzten Kalibrierung der Uhr auf. Fünf Tage später geht die Uhr 10 Sekunden vor, und Sie rufen B<hwclock --set --update-drift> auf, um die Uhr 10 Sekunden zurückzustellen. B<hwclock> aktualisiert die adjtime-Datei, zeichnet wiederum die aktuelle Zeit als den Zeitpunkt der letzten Kalibrierung auf, wobei diesmal 2 Sekunden pro Tag als systematische Abweichung protokolliert werden. 24 Stunden später rufen Sie den Befehl B<hwclock --adjust> auf. B<hwclock> befragt die adjtime-Datei und stellt fest, dass die Uhr, wenn sie nicht korrigiert wird, 2 Sekunden pro Tag vorgeht. So zieht es die 2 Sekunden von der Zeit der Hardware-Uhr ab, da die Uhr genau 24 Stunden nicht korrigiert wurde. Die aktuelle Zeit wird auch wieder als die Zeit der letzten Kalibrierung aufgezeichnet. Noch einmal 24 Stunden später funktioniert der Befehl B<hwclock --adjust> wieder auf die gleiche Weise: B<hwclock> zieht 2 Sekunden ab und aktualisiert die adjtime-Datei mit der aktuellen Zeit als letztem Kalibrierungszeitpunkt der Uhr.

source: When you use the B<--update-drift> option with B<--set> or B<--systohc>, the systematic drift rate is (re)calculated by comparing the fully drift corrected current Hardware Clock time with the new set time, from that it derives the 24 hour drift rate based on the last calibrated timestamp from the adjtime file. This updated drift factor is then saved in I</etc/adjtime>.
de: Wenn Sie die Option B<--update-drift> mit B<--set> oder B<--systohc> verwenden, wird die automatische Abweichungsrate durch Vergleich der vollabweichungskorrigerten Hardware-Uhr mit der jetzt gesetzten Zeit (neu) berechnet. Daraus wird die 24-Stunden-Abweichungsrate basierend auf dem letzten kalibrierten Zeitstempel aus der Adjtime-Datei abgeleitet. Dieser aktualisierte Abweichungsfaktor wird dann in I</etc/adjtime> gespeichert.

source: A small amount of error creeps in when the Hardware Clock is set, so B<--adjust> refrains from making any adjustment that is less than 1 second. Later on, when you request an adjustment again, the accumulated drift will be more than 1 second and B<--adjust> will make the adjustment including any fractional amount.
de: Kleinere Fehler schleichen sich beim Stellen der Hardware-Uhr ein, daher unterlässt B<--adjust> Korrekturen von weniger als einer Sekunde. Wenn Sie zu einem späteren Zeitpunkt erneut die Uhr stellen wollen, wird die aufgesammelte Abweichung nun mehr als eine Sekunde betragen und B<--adjust> führt die Korrektur einschließlich eines Bruchanteils aus.
