Repository: sebras/manpages-l10n
Catalog: po/*/man8/hwclock.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: hwclock - time clocks utility
de: hwclock - Zeituhren-Hilfswerkzeug

source: SYNOPSIS
de: ÜBERSICHT

source: B<hwclock> [I<function>] [I<option>...]
de: B<hwclock> [I<Funktion>] [I<Option> …]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<hwclock> is an administration tool for the time clocks. It can: display the Hardware Clock time; set the Hardware Clock to a specified time; set the Hardware Clock from the System Clock; set the System Clock from the Hardware Clock; compensate for Hardware Clock drift; correct the System Clock timescale; set the kernel\(cqs timezone, NTP timescale, and epoch (Alpha only); and predict future Hardware Clock values based on its drift rate.
de: B<hwclock> ist ein Administrationswerkzeug für die verschiedenen Uhren. Es kann die aktuelle Hardware-Uhrzeit anzeigen, die Hardware-Uhr auf eine angegebene Zeit stellen, die Hardware-Uhr nach der Systemzeit stellen oder umgekehrt, eine Hardware-Uhr-Abweichung ausgleichen, die Zeitskala der Systemuhr korrigieren, die Zeitzone des Kernels, die NTP-Zeitskala und die Epoche (nur Alpha) setzen und zukünftige Hardware-Uhrwerte, basierend auf der Abweichungsrate, vorhersagen.

source: Since v2.26 important changes were made to the B<--hctosys> function and the B<--directisa> option, and a new option B<--update-drift> was added. See their respective descriptions below.
de: Seit v2.26 gibt es wichtige Änderungen an der Funktion B<--hctosys>, der Option B<--directisa> und eine neue Option B<--update-drift> wurde hinzugefügt. Lesen Sie die entsprechenden Beschreibungen unten.

source: FUNCTIONS
de: FUNKTIONEN

source: The following functions are mutually exclusive, only one can be given at a time. If none is given, the default is B<--show>.
de: Die folgenden Funktionen schließen sich gegenseitig aus, nur eine kann ausgewählt werden. Die Vorgabe ist B<--show>, falls keine angegeben wurde.

source: Add or subtract time from the Hardware Clock to account for systematic drift since the last time the clock was set or adjusted. See the discussion below, under B<The Adjust Function>.
de: fügt Zeit zur Hardware-Uhr hinzu oder zieht diese ab, um eine systematische Abweichung seit dem letzten Setzen oder Anpassen der Hardware-Uhr auszugleichen. Siehe die nachfolgende Erklärungen unter B<Die Adjust-Funktion>.

source: These functions are for Alpha machines only, and are only available through the Linux kernel RTC driver.
de: Diese Funktionen sind nur für Alpha-Maschinen. Sie sind nur durch den Linux-Kernel-RTC-Treiber verfügbar.

source: They are used to read and set the kernel\(cqs Hardware Clock epoch value. Epoch is the number of years into AD to which a zero year value in the Hardware Clock refers. For example, if the machine\(cqs BIOS sets the year counter in the Hardware Clock to contain the number of full years since 1952, then the kernel\(cqs Hardware Clock epoch value must be 1952.
de: Sie werden verwendet, um den Kernel-Wert der Hardware-Uhr-Epoche zu lesen und zu setzen. Epoche ist das Jahr, auf dass sich der Nullwert der Hardware-Uhr bezieht. Wenn das BIOS der Maschine zum Beispiel die Konvention verwenden, dass die Jahreszählung in der Hardware-Uhr die Anzahl der vollen Jahre seit 1952 enthält, dann muss der Epochenwert der Hardware-Uhr des Kernels auf 1952 gesetzt werden.

source: The B<--setepoch> function requires using the B<--epoch> option to specify the year. For example:
de: Die Funktion B<--setepoch> benötigt die Option B<--epoch>, um das Jahr festzulegen. Beispiel:

source: The RTC driver attempts to guess the correct epoch value, so setting it may not be required.
de: Der RTC-Treiber versucht, den korrekten Wert der Epoche zu raten, daher kann es nicht notwendig sein, ihn anzugeben.

source: This epoch value is used whenever B<hwclock> reads or sets the Hardware Clock on an Alpha machine. For ISA machines the kernel uses the fixed Hardware Clock epoch of 1900.
de: Dieser Epochenwert wird verwendet, wenn B<hwclock> die Hardware-Uhr auf einer Alpha-Maschine ausliest oder stellt. Für ISA-Maschinen verwendet der Kernel die feste Hardware-Uhr-Epoche 1900.

source: B<--param-get=>I<parameter>; B<--param-set=>I<parameter>=I<value>
de: B<--param-get=>I<Parameter>; B<--param-set=>I<Parameter>=I<Wert>

source: Read and set the RTC\(cqs parameter. This is useful, for example, to retrieve the RTC\(cqs feature or set the RTC\(cqs Backup Switchover Mode.
de: liest und setzt die Parameter der Echtzeituhr (RTC). Dies dient beispielsweise der Ermittlung der verfügbaren Funktionen der Echtzeituhr oder dem Setzen des »Backup Switchover Mode«.

source: I<parameter> is either a numeric RTC parameter value (see the Kernel\(cqs I<include/uapi/linux/rtc.h>) or an alias. See B<--help> for a list of valid aliases. I<parameter> and I<value>, if prefixed with 0x, are interpreted as hexadecimal, otherwise decimal values.
de: Der I<Parameter> ist entweder ein numerischer RTC-Parameterwert (siehe die Kernel-Datei I<include/uapi/linux/rtc.h>) oder ein Alias. Mit B<--help> erhalten Sie eine Liste gültiger Aliase. Wenn dem I<Parameter> und dem I<Wert> 0x vorangestellt ist, werden diese als hexadezimal interpretiert, ansonsten als dezimal.

source: Predict what the Hardware Clock will read in the future based upon the time given by the B<--date> option and the information in I</etc/adjtime>. This is useful, for example, to account for drift when setting a Hardware Clock wakeup (aka alarm). See B<rtcwake>(8).
de: sagt basierend auf der mit der Option B<--date> angegebene Zeit und der Information in I</etc/adjtime> vorher, was die Hardware-Uhr in der Zukunft anzeigen wird. Dies ist zum Beispiel nützlich, um Abweichungen zu berücksichtigen, wenn das Hardware-Uhr-Aufwachen (d.h. ein Alarm) eingerichtet wird. Siehe B<rtcwake>(8).

source: Do not use this function if the Hardware Clock is being modified by anything other than the current operating system\(cqs B<hwclock> command, such as \(aq11 minute mode\(aq or from dual-booting another OS.
de: Verwenden Sie diese Funktion nicht, falls die Hardware-Uhr durch irgendetwas anderes als den Befehl B<hwclock> des aktuellen Betriebssystems verändert wird, wie dem »11-Minuten-Modus« oder durch das Starten eines anderen Betriebssystems.

source: Read the Hardware Clock and print its time to standard output in the B<ISO 8601> format. The time shown is always in local time, even if you keep your Hardware Clock in UTC. See the B<--localtime> option.
de: liest die Hardware-Uhr und schreibt ihre Zeit in die Standardausgabe im B<ISO 8601>-Format. Die angezeigte Zeit ist stets die lokale Zeit, selbst wenn Sie die Hardware-Uhr auf die Weltzeit (UTC) eingestellt haben, siehe die Option B<--localtime>.

source: Showing the Hardware Clock time is the default when no function is specified.
de: Die Anzeige der Hardware-Uhrzeit ist die Vorgabe, falls keine Funktion angegeben ist.

source: The B<--get> function also applies drift correction to the time read, based upon the information in I</etc/adjtime>. Do not use this function if the Hardware Clock is being modified by anything other than the current operating system\(cqs B<hwclock> command, such as \(aq11 minute mode\(aq or from dual-booting another OS.
de: Die Funktion B<--get> wendet auch Korrekturen für die Abweichung auf die eingelesene Zeit an, basierend auf Informationen aus I</etc/adjtime>. Verwenden Sie diese Funktion nicht, falls die Hardware-Uhr von irgendetwas anderem außer dem Befehl B<hwclock> des aktuellen Betriebssystems verändert wird, wie dem »11-Minuten-Modus« oder vom Dualstarten eines anderen Betriebssystems.

source: Set the System Clock from the Hardware Clock. The time read from the Hardware Clock is compensated to account for systematic drift before using it to set the System Clock. See the discussion below, under B<The Adjust Function>.
de: stellt die Systemuhr aus der Hardware-Uhr. Die aus der Hardware-Uhr eingelesene Zeit wird bezüglich der systematischen Abweichung ausgeglichen, bevor die Systemuhr gestellt wird. Lesen Sie die Diskussion weiter unten, unter B<Die Adjust-Funktion>.

source: The System Clock must be kept in the UTC timescale for date-time applications to work correctly in conjunction with the timezone configured for the system. If the Hardware Clock is kept in local time then the time read from it must be shifted to the UTC timescale before using it to set the System Clock. The B<--hctosys> function does this based upon the information in the I</etc/adjtime> file or the command line arguments B<--localtime> and B<--utc>. Note: no daylight saving adjustment is made. See the discussion below, under B<LOCAL vs UTC>.
de: Die Systemzeit muss in der UTC-Zeitskala gehalten werden, damit Anwendungen im Zusammenhang mit der für das System konfigurierten Zeitzone arbeiten. Falls die Hardware-Uhr in der lokalen Zeit gehalten wird, dann muss die daraus gelesene Zeit in die UTC-Zeitskala verschoben werden, bevor sie zum Setzen der Systemuhr verwandt wird. Die Funktion B<--hctosys> erledigt dies basierend auf den Informationen in der Datei I</etc/adjtime> oder aus den Befehlszeilenargumenten B<--localtime> und B<--utc>. Hinweis: Es wird keine Sommerzeitanpassung durchgeführt. Siehe die Diskussion weiter unten unter B<LOKAL vs. UTC>.

source: The kernel also keeps a timezone value, the B<--hctosys> function sets it to the timezone configured for the system. The system timezone is configured by the B<TZ> environment variable or the I</etc/localtime> file, as B<tzset>(3) would interpret them. The obsolete I<tz_dsttime> field of the kernel\(cqs timezone value is set to zero. (For details on what this field used to mean, see B<settimeofday>(2).)
de: Der Kernel hält auch einen Zeitzonenwert, die Funktion B<--hctosys> setzt ihn auf den für das System konfigurierten Wert. Die Systemzeitzone wird durch die B<TZ>-Umgebungsvariable oder die Datei I</etc/localtime> konfiguriert, wie B<tzset>(3) sie interpretieren würde. Das veraltete Feld I<tz_dsttime> des Kernel-Zeitzonenwerts wird auf Null gesetzt. Details zur ehemaligen Bedeutung dieses Feldes finden Sie in B<settimeofday>(2).

source: When used in a startup script, making the B<--hctosys> function the first caller of B<settimeofday>(2) from boot, it will set the NTP \(aq11 minute mode\(aq timescale via the I<persistent_clock_is_local> kernel variable. If the Hardware Clock\(cqs timescale configuration is changed then a reboot is required to inform the kernel. See the discussion below, under B<Automatic Hardware Clock Synchronization by the Kernel>.
de: Wird die Funktion B<--hctosys> durch Verwendung in einem Systemstartskript der erste Aufrufer von B<settimeofday>(2), dann wird über die Kernelvariable I<persistent_clock_is_local> der NTP-»11-Minuten-Modus« gesetzt. Falls die Hardware-Uhr-Zeitskalenkonfiguration geändert wird, ist ein Systemneustart notwendig, um den Kernel zu informieren. Lesen Sie die Diskussion weiter unten unter B<Automatischer Abgleich der Hardware-Uhr durch den Kernel>.

source: This is a good function to use in one of the system startup scripts before the file systems are mounted read/write.
de: Dies ist eine gute Funktion für die Ausführung in einem der Startskripte des Systems bevor die Dateisysteme im Lese-/Schreibmodus eingehängt werden.

source: This function should never be used on a running system. Jumping system time will cause problems, such as corrupted filesystem timestamps. Also, if something has changed the Hardware Clock, like NTP\(cqs \(aq11 minute mode\(aq, then B<--hctosys> will set the time incorrectly by including drift compensation.
de: Diese Funktion sollte niemals auf einem laufenden System verwandt werden. Springende Systemzeit führt zu Problemen, wie fehlerhaften Dateisystemzeitstempeln. Falls auch etwas die Hardware-Uhr geändert hat, wie NTPs »11-Minuten-Modus«, dann wird B<--hctosys> die Zeit durch Berücksichtigung der Abweichungsausgleichung inkorrekt einstellen.

source: Drift compensation can be inhibited by setting the drift factor in I</etc/adjtime> to zero. This setting will be persistent as long as the B<--update-drift> option is not used with B<--systohc> at shutdown (or anywhere else). Another way to inhibit this is by using the B<--noadjfile> option when calling the B<--hctosys> function. A third method is to delete the I</etc/adjtime> file. B<Hwclock> will then default to using the UTC timescale for the Hardware Clock. If the Hardware Clock is ticking local time it will need to be defined in the file. This can be done by calling B<hwclock --localtime --adjust>; when the file is not present this command will not actually adjust the Clock, but it will create the file with local time configured, and a drift factor of zero.
de: Die Abweichungsausgleichung kann durch Setzen des Abweichungsfaktors in I</etc/adjtime> auf Null unterdrückt werden. Diese Einstellung ist dauerhaft, solange wie die Option B<--update-drift> nicht zusammen mit B<--systohc> beim Herunterfahren des Systems (oder irgendwann sonst) verwandt wird. Eine andere Möglichkeit, dies zu unterdrücken besteht durch die Option B<--noadjfile> beim Einsatz der Funktion B<--hctosys>. Eine dritte Methode besteht im Löschen der Datei I</etc/adjtime>. B<Hwclock> wird dann standardmäßig die UTC-Zeitskala für die Hardware-Uhr verwenden. Falls die Hardware-Uhr in lokaler Zeit läuft, muss das in dieser Datei definiert werden. Dies kann durch Aufruf von B<hwclock --localtime --adjust> erfolgen. Wenn die Datei nicht vorhanden ist, wird dieser Befehl nicht wirklich die Uhr anpassen sondern wird die Datei mit der konfigurierten lokalen Zeit und einem Abweichungsfaktor von Null anlegen.

source: A condition under which inhibiting B<hwclock>\(aqs drift correction may be desired is when dual-booting multiple operating systems. If while this instance of Linux is stopped, another OS changes the Hardware Clock\(cqs value, then when this instance is started again the drift correction applied will be incorrect.
de: Eine Bedingung, unter der die Abweichungskorrektur von B<hwclock> verhindert werden sollte, könnte beim Dualstart von mehreren Betriebssystemen vorliegen. Falls, während diese Instanz von Linux angehalten ist, ein anderes Betriebssystem die Hardware-Uhr stellt, dann wird die Abweichungskorrektur nach dem Start dieser Instanz bei der Anwendung inkorrekt sein.

source: For B<hwclock>\(aqs drift correction to work properly it is imperative that nothing changes the Hardware Clock while its Linux instance is not running.
de: Damit die Abweichungskorrektur von B<hwclock> korrekt funktioniert, ist es zwingend, dass nichts die Hardware-Uhr ändert, während die Linux-Instanz nicht läuft.

source: Set the Hardware Clock to the time given by the B<--date> option, and update the timestamps in I</etc/adjtime>. With the B<--update-drift> option also (re)calculate the drift factor. Try it without the option if B<--set> fails. See B<--update-drift> below.
de: setzt die Hardware-Uhr auf die durch die Option B<--date> angegebene Zeit und aktualisiert die Zeitstempel in I</etc/adjtime>. Mit der Option B<--update-drift> wird der Abweichungsfaktor (neu) berechnet. Versuchen Sie, die Option wegzulassen, falls B<--set> fehlschlägt. Siehe B<--update-drift> unten.

source: This is an alternate to the B<--hctosys> function that does not read the Hardware Clock nor set the System Clock; consequently there is not any drift correction. It is intended to be used in a startup script on systems with kernels above version 2.6 where you know the System Clock has been set from the Hardware Clock by the kernel during boot.
de: Dies ist eine Alternative zu der Funktion B<--hctosys>, die nicht die Hardware-Uhr liest und nicht die Systemzeit setzt. Entsprechend gibt es auch keine Korrektur der Abweichung. Sie ist für Hochfahrskripte auf Systemen mit Kerneln höher als 2.6 gedacht, bei denen Sie wissen, dass die Systemuhr bereits vom Kernel während des Systemstarts aus der Hardware-Uhr gesetzt wurde.

source: It does the following things that are detailed above in the B<--hctosys> function:
de: Dies führt die folgenden Dinge aus, die weiter oben in der Funktion B<--hctosys> beschrieben sind:

source: Corrects the System Clock timescale to UTC as needed. Only instead of accomplishing this by setting the System Clock, B<hwclock> simply informs the kernel and it handles the change.
de: Korrigiert die Systemuhrzeitskala auf UTC wie benötigt. Anstatt aber dies durch Setzen der Systemuhr zu erreichen, informiert B<hwclock> einfach den Kernel und der kümmert sich um die Änderung.

source: Sets the kernel\(cqs NTP \(aq11 minute mode\(aq timescale.
de: Setzt die NTP »11-Minuten-Modus«-Zeitskala des Kernels.

source: Sets the kernel\(cqs timezone.
de: Setzt die Zeitzone des Kernels

source: The first two are only available on the first call of B<settimeofday>(2) after boot. Consequently this option only makes sense when used in a startup script. If the Hardware Clocks timescale configuration is changed then a reboot would be required to inform the kernel.
de: Die ersten zwei sind nur beim ersten Aufruf von B<settimeofday>(2) nach dem Systemstart verfügbar. Konsequenterweise ergeben diese Optionen nur bei der Verwendung in Systemstartskripten Sinn. Falls die Hardware-Uhr-Zeitskalenkonfiguration geändert wird, ist ein Systemneustart notwendig, um den Kernel zu informieren.

source: Set the Hardware Clock from the System Clock, and update the timestamps in I</etc/adjtime>. With the B<--update-drift> option also (re)calculate the drift factor. Try it without the option if B<--systohc> fails. See B<--update-drift> below.
de: setzt die Hardware-Uhr aus der Systemuhr und aktualisiert die Zeitstempel in I</etc/adjtime>. Mit der Option B<--update-drift> wird auch der Abweichungsfaktor (neu) berechnet. Versuchen Sie es ohne die Option, falls B<--systohc> fehlschlägt. Siehe B<--update-drift> weiter unten.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.

source: OPTIONS
de: OPTIONEN

source: B<--adjfile=>I<filename>
de: B<--adjfile=>I<Dateiname>

source: Override the default I</etc/adjtime> file path.
de: setzt den vorgegebenen Dateipfad I</etc/adjtime> außer Kraft.

source: B<--date=>I<date_string>
de: B<--date=>I<Datumszeichenkette>

source: This option must be used with the B<--set> or B<--predict> functions, otherwise it is ignored.
de: Diese Option muss zusammen mit den Funktionen B<--set> oder B<--predict> verwandt werden, andernfalls wird sie ignoriert.

source: The argument must be in local time, even if you keep your Hardware Clock in UTC. See the B<--localtime> option. Therefore, the argument should not include any timezone information. It also should not be a relative time like "+5 minutes", because B<hwclock>\(aqs precision depends upon correlation between the argument\(cqs value and when the enter key is pressed. Fractional seconds are silently dropped. This option is capable of understanding many time and date formats, but the previous parameters should be observed.
de: Das Argument muss in lokaler Zeit sein, selbst wenn Sie Ihre Hardware-Uhr in UTC halten. Siehe die Option B<--localtime>. Daher sollte das Argument keine Zeitzoneninformationen enthalten. Es sollte auch keine relative Zeit wie »+5 minutes« sein, da B<hwclock>s Genauigkeit von dem Zusammenhang zwischen dem Wert des Arguments und dem Zeitpunkt, zu dem die Eingabetaste gedrückt wird, abhängt. Sekundenbruchteile werden ohne Rückmeldung abgeschnitten. Diese Option kann viele Zeit- und Datumsformate erkennen, aber die vorhergehenden Parameter sollten beachtet werden.

source: B<--delay=>I<seconds>
de: B<--delay=>I<Sekunden>

source: This option can be used to overwrite the internally used delay when setting the clock time. The default is 0.5 (500ms) for rtc_cmos, for another RTC types the delay is 0. If RTC type is impossible to determine (from sysfs) then it defaults also to 0.5 to be backwardly compatible.
de: Diese Option erlaubt es, die intern verwandte Verzögerung beim Setzen der Uhrzeit zu ändern. Die Vorgabe ist 0.5 (500 ms) für rtc_cmos, für andere RTC-Typen ist die Verzögerung 0. Falls der RTC-Typ nicht (aus Sysfs) bestimmt werden kann, dann ist die Vorgabe aufgrund der Rückwärtskompatibilität auch 0.5.

source: The 500ms default is based on commonly used MC146818A-compatible (x86) hardware clock. This Hardware Clock can only be set to any integer time plus one half second. The integer time is required because there is no interface to set or get a fractional second. The additional half second delay is because the Hardware Clock updates to the following second precisely 500 ms after setting the new time. Unfortunately, this behavior is hardware specific and in same cases another delay is required.
de: Die Standardverzögerung von 500 ms basiert auf der häufig verwandten, MC146818A-kompatiblen (X86-)Hardwareuhr. Die Hardwareuhr kann nur auf ganzzahlige Zeiten plus eine halbe Sekunde gesetzt werden. Die Ganzzahlzeit ist notwendig, da es keine Schnittstelle gibt, um Sekundenbruchteile zu setzen oder abzufragen. Die zusätzliche halbe Sekunde Verzögerung erfolgt, da die Hardwareuhr sich auf die folgende Sekunde genau 500 ms nach dem Setzen der neuen Zeit aktualisiert. Unglücklicherweise ist dieses Verhalten hardwareabhängig und in einigen Fällen wird eine andere Verzögerung benötigt.

source: Use B<--verbose>. The B<--debug> option has been deprecated and may be repurposed or removed in a future release.
de: Verwenden Sie B<--verbose>. Die Option B<--debug> ist veraltet und kann in einer zukünftigen Veröffentlichung einer neuen Verwendung zugeführt oder entfernt werden.

source: This option is meaningful for ISA compatible machines in the x86 and x86_64 family. For other machines, it has no effect. This option tells B<hwclock> to use explicit I/O instructions to access the Hardware Clock. Without this option, B<hwclock> will use the rtc device file, which it assumes to be driven by the Linux RTC device driver. As of v2.26 it will no longer automatically use directisa when the rtc driver is unavailable; this was causing an unsafe condition that could allow two processes to access the Hardware Clock at the same time. Direct hardware access from userspace should only be used for testing, troubleshooting, and as a last resort when all other methods fail. See the B<--rtc> option.
de: Diese Option ist auf ISA-kompatiblen Maschinen (einschließlich X86 und X86_64 von Bedeutung. Auf anderen Maschinen hat sie keine Auswirkungen. Diese Option weist B<hwclock> explizit an, E/A-Anweisungen für den Zugriff auf die Hardware-Uhr vorzunehmen. Ohne diese Option versucht B<hwclock>, die RTC-Gerätdatei zu verwenden, wobei angenommen wird, dass diese mit dem Linux-RTC-Gerätetreiber läuft. Seit v2.26 wird er nicht mehr automatisch directisa verwenden, wenn der RTC-Treiber nicht verfügbar ist. Dies führte zu unsicheren Bedingungen, die es erlaubten, dass zwei Prozesse auf die Hardware-Uhr gleichzeitig zugreifen konnten. Direkter Hardware-Zugriff aus dem Benutzerraum sollte nur zum Testen, zur Fehlersuche und als letzte Rettung, wenn alle anderen Methoden fehlschlagen, verwandt werden. Siehe die Option B<--rtc>.

source: B<--epoch=>I<year>
de: B<--epoch=>I<Jahr>

source: This option is required when using the B<--setepoch> function. The minimum I<year> value is 1900. The maximum is system dependent (B<ULONG_MAX - 1>).
de: Diese Option ist notwendig, wenn die Funktion B<--setepoch> verwandt wird. Das minimale I<Jahr> ist 1900. Das maximale ist systemabhängig (B<ULONG_MAX - 1>).

source: B<-f>, B<--rtc=>I<filename>
de: B<-f>, B<--rtc=>I<Dateiname>
