Repository: sebras/manpages-l10n
Catalog: po/*/man8/idmapd.8.po
Languages: fr

source: February 3, 2003
fr: 3 février 2003

source: NAME
fr: NOM

source: NFSv4 ID E<lt>-E<gt> Name Mapper
fr: mappage identifiant NFSv4 E<lt>-E<gt> nom

source: E<.Nm rpc.idmapd> E<.Op Fl h> E<.Op Fl f> E<.Op Fl v> E<.Op Fl C> E<.Op Fl S> E<.Op Fl p Ar path> E<.Op Fl c Ar path>
fr: E<.Nm rpc.idmapd> E<.Op Fl h> E<.Op Fl f> E<.Op Fl v> E<.Op Fl C> E<.Op Fl S> E<.Op Fl p Ar chemin> E<.Op Fl c Ar chemin>

source: E<.Nm> is the NFSv4 ID E<lt>-E<gt> name mapping daemon. It provides functionality to the NFSv4 kernel client and server, to which it communicates via upcalls, by translating user and group IDs to names, and vice versa.
fr: E<.Nm> est le démon pour le mappage nom E<lt>-E<gt> ID NFSv4. Il fournit cette fonctionnalité au client et au serveur du noyau NFSv4, avec lesquels il communique par des appels, en traduisant les identifiants d'utilisateur et de groupe en noms et vice versa.

source: When the domain is not specified in /etc/idmapd.conf the local DNS server will be queried for the E<.Sy _nfsv4idmapdomain > text record. If the record exists that will be used as the domain. When the record does not exist, the domain part of the DNS domain will used.
fr: Quand le domaine n’est pas précisé dans E<.Pa /etc/idmapd.conf>, le serveur DNS local sera interrogé pour l’enregistrement textuel de E<.Sy _nfsv4idmapdomain >. Si l’enregistrement existe, il sera utilisé comme domaine. S’il n’existe pas, la partie domaine du domaine DNS sera utilisée.

source: Note that on more recent kernels only the NFSv4 server uses E<.Nm>. The NFSv4 client instead uses E<.Xr nfsidmap 8>, and only falls back to E<.Nm > if there was a problem running the E<.Xr nfsidmap 8> program.
fr: Remarquez que sur les plus récents noyaux, seul le serveur NFSv4 utilise E<.Nm>. Le client NFSv4 utilise plutôt E<.Xr nfsidmap 8> et revient seulement à E<.Nm > s’il existe un problème lors de l’exécution du programme E<.Xr nfsidmap 8>.

source: The options are as follows:
fr: Les options sont les suivantes :

source: Display usage message.
fr: Afficher un message d'aide.

source: Increases the verbosity level (can be specified multiple times).
fr: Augmenter le niveau de verbosité de la sortie (peut être demandée plusieurs fois).

source: Runs E<.Nm> in the foreground and prints all output to the terminal.
fr: Lancer E<.Nm> en tâche de premier plan et afficher les sorties sur le terminal.

source: Fl p Ar path
fr: Fl p Ar chemin

source: Specifies the location of the RPC pipefs to be E<.Ar path>. The default value is \&"/var/lib/nfs/rpc_pipefs\&".
fr: Indiquer que le système de fichiers RPC pipefs est situé à E<.Ar chemin>. Par défaut, il s'agit de « /var/lib/nfs/rpc_pipefs ».

source: Fl c Ar path
fr: Fl c Ar chemin

source: Use configuration file E<.Ar path>. This option is deprecated.
fr: Utiliser le fichier de configuration E<.Ar chemin>. Cette option est obsolète.

source: Client-only: perform no idmapping for any NFS server, even if one is detected.
fr: Pour les clients uniquement : n'exécuter de mappage pour aucun serveur NFS, même si un est détecté.

source: Server-only: perform no idmapping for any NFS client, even if one is detected.
fr: Pour les serveurs uniquement : n'exécuter de mappage pour aucun client NFS, même si un est détecté.

source: CONFIGURATION FILES
fr: FICHIERS DE CONFIGURATION

source: E<.Nm> recognizes the following value from the E<.Sy [general]> section of the E<.Pa /etc/nfs.conf> configuration file:
fr: E<.Nm> reconnait les valeurs suivantes de la section E<.Sy [general]> du fichier de configuration E<.Pa /etc/nfs.conf> :

source: Equivalent to E<.Sy -p>.
fr: Équivalent à E<.Sy -p>.

source: All other settings related to id mapping are found in the E<.Pa /etc/idmapd.conf> configuration file.
fr: Tous les autres réglages relatifs au mappage d’Id sont trouvés dans le fichier de configuration E<.Pa /etc/idmapd.conf>.

source: EXAMPLES
fr: EXEMPLES

source: Runs E<.Nm> printing all messages to console, and with a verbosity level of 3.
fr: Lancer E<.Nm> en affichant tous les messages sur la console avec un niveau de détails de\ B<3>.

source: FILES
fr: FICHIERS

source: SEE ALSO
fr: VOIR AUSSI

source: E<.Xr idmapd.conf 5>, E<.Xr nfs.conf 5>, E<.Xr nfsidmap 8>
fr: B<idmapd.conf>(5), B<nfs.conf>(5), B<nfsidmap>(8)

source: AUTHORS
fr: AUTEURS

source: The E<.Nm> software has been developed by Marius Aamodt Eriksen E<.Aq marius@citi.umich.edu>.
fr: Le programme E<.Nm> a été développé par Marius Aamodt Eriksen E<.Aq marius@citi.umich.edu>.

source: Use configuration file E<.Ar path>.
fr: Utiliser le fichier de configuration E<.Ar chemin>.

source: The system derives the I<user> part of the string by performing a password or group lookup. The lookup mechanism is configured in E<.Pa /etc/idmapd.conf>
fr: Le système obtient la partie I<utilisateur> de la chaîne en effectuant une recherche de mot de passe ou de groupe. Le mécanisme de recherche est configuré dans E<.Pa /etc/idmapd.conf>

source: By default, the I<domain> part of the string is the system's DNS domain name. It can also be specified in E<.Pa /etc/idmapd.conf> if the system is multi-homed, or if the system's DNS domain name does not match the name of the system's Kerberos realm.
fr: Par défaut, la partie I<domaine> de la chaîne est le nom de domaine DNS du système. Elle peut être aussi indiquée dans E<.Pa /etc/idmapd.conf> si le système possède plusieurs fournisseurs d’accès (multihoming) ou si le nom de domaine DNS du système ne correspond pas au nom de domaine Kerberos du système.
