Repository: sebras/manpages-l10n
Catalog: po/*/man8/ifconfig.8.po
Languages: pl

source: Linux System Administrator's Manual
pl: Podręcznik administratora systemu Linux

source: NAME
pl: NAZWA

source: ifconfig - configure a network interface
pl: ifconfig - konfiguruje interfejs sieciowy

source: SYNOPSIS
pl: SKŁADNIA

source: B<ifconfig [-v] [-a] [-s] [interface]>
pl: B<ifconfig> [B<-v>] [B<-a>] [B<-s>] [I<interfejs>]

source: B<ifconfig [-v] interface [aftype] options | address ...>
pl: B<ifconfig> [B<-v>] I<interfejs> [I<typ-rodz-adr>] I<opcje> | I<adres> ...

source: DESCRIPTION
pl: OPIS

source: B<Ifconfig> is used to configure the kernel-resident network interfaces. It is used at boot time to set up interfaces as necessary. After that, it is usually only needed when debugging or when system tuning is needed.
pl: B<Ifconfig> jest używany do konfigurowania rezydujących w jądrze interfejsów sieciowych. Jest używany podczas rozruchu, do skonfigurowania większości z nich do stanu pracy. Później jest zwykle potrzebny tylko przy debugowaniu lub tuningowaniu systemu.

source: If no arguments are given, B<ifconfig> displays the status of the currently active interfaces. If a single B<interface> argument is given, it displays the status of the given interface only; if a single B<-a> argument is given, it displays the status of all interfaces, even those that are down. Otherwise, it configures an interface.
pl: Jeśli nie poda się argumentów, B<ifconfig> po prostu wyświetli status aktywnych interfejsów. Jeśli podany jest pojedynczy argument I<interfejs>, to wyświetla on status podanego interfejsu. Jeżeli użyto pojedynczego argumentu B<-a>, to wyświetlony zostanie status wszystkich interfejsów, nawet tych, które są nieaktywne. W przeciwnym wypadku zakłada, że trzeba coś skonfigurować.

source: Address Families
pl: Rodziny adresów

source: OPTIONS
pl: OPCJE

source: display all interfaces which are currently available, even if down
pl: wyświetla wszystkie aktualnie dostępne interfejsy, nawet jeśli nie są aktywne

source: display a short list (like netstat -i)
pl: wyświetla krótką listę (jak netstat -i)

source: be more verbose for some error conditions
pl: więcej szczegółów w przypadku niektórych błędów

source: B<interface>
pl: I<interfejs>

source: This flag causes the driver for this interface to be shut down.
pl: Flaga ta powoduje wyłączenie sterownika tego interfejsu.

source: B<[-]arp>
pl: [B<->]B<arp>

source: Enable or disable the use of the ARP protocol on this interface.
pl: Włącza lub wyłącza używanie protokołu ARP na tym interfejsie.

source: B<[-]promisc>
pl: [B<->]B<promisc>

source: Enable or disable the B<promiscuous> mode of the interface. If selected, all packets on the network will be received by the interface.
pl: Włącza lub wyłącza tryb B<promiscous> na tym interfejsie. Jeżeli włączony, to wszystkie pakiety w sieci będą przechwytywane przez ten interfejs.

source: B<[-]allmulti>
pl: [B<->]B<allmulti>

source: Enable or disable B<all-multicast> mode. If selected, all multicast packets on the network will be received by the interface.
pl: Włącza lub wyłącza tryb B<all-multicast>. Jeżeli włączony, to wszystkie pakiety multicast w sieci będą odbierane przez interfejs.

source: B<mtu N>
pl: B<mtu> I<N>

source: This parameter sets the Maximum Transfer Unit (MTU) of an interface.
pl: Parametr ten ustawia maksymalną jednostkę transferu (Maximum Transfer Unit) interfejsu.

source: B<dstaddr addr>
pl: B<dstaddr> I<adres>

source: Set the remote IP address for a point-to-point link (such as PPP). This keyword is now obsolete; use the B<pointopoint> keyword instead.
pl: Ustawia adres IP "drugiego końca" w przypadku połączenia point-to-point (takiego jak PPP). Słowo to jest przedawnione, gdyż istnieje nowe słowo, B<pointopoint>

source: B<netmask addr>
pl: B<netmask> I<adres>

source: Set the IP network mask for this interface. This value defaults to the usual class A, B or C network mask (as derived from the interface IP address), but it can be set to any value.
pl: Ustawia maskę sieciową IP dla tego interfejsu. Wartość domyślnie przybiera wartość zwykłej maski sieciowej klasy A, B lub C (jak to wynika z adresu IP interfejsu), lecz może być ustawiona na dowolną wartość.

source: B<add addr/prefixlen>
pl: B<add> I<adres>/I<dł.prefiksu>

source: Add an IPv6 address to an interface.
pl: Dodaje adres IPv6 do interfejsu.

source: B<del addr/prefixlen>
pl: B<del> I<adres>/I<dł.prefiksu>

source: Remove an IPv6 address from an interface.
pl: Usuwa adres IPv6 z interfejsu.

source: Create a new SIT (IPv6-in-IPv4) device, tunnelling to the given destination.
pl: Tworzy nowe urządzenie SIT (IPv6-in-IPv4), tworząc tunel do podanego adresu docelowego.

source: B<irq addr>
pl: B<irq> I<adres>

source: Set the interrupt line used by this device. Not all devices can dynamically change their IRQ setting.
pl: Ustawia linię przerwań używaną przez to urządzenie. Nie wszystkie urządzenia obsługują dynamiczne ustawianie IRQ.

source: B<io_addr addr>
pl: B<io_addr> I<adres>

source: Set the start address in I/O space for this device.
pl: Ustawia początkowy adres w przestrzeni adresowej I/O używany przez to urządzenie.

source: B<mem_start addr>
pl: B<mem_start> I<adres>

source: Set the start address for shared memory used by this device. Only a few devices need this.
pl: Ustawia początkowy adres pamięci dzielonej używany przez to urządzenie. Tylko kilka urządzeń potrzebuje tej opcji.

source: B<media type>
pl: B<media> I<typ>

source: Set the physical port or medium type to be used by the device. Not all devices can change this setting, and those that can vary in what values they support. Typical values for B<type> are B<10base2> (thin Ethernet), B<10baseT> (twisted-pair 10Mbps Ethernet), B<AUI> (external transceiver) and so on. The special medium type of B<auto> can be used to tell the driver to auto-sense the media. Again, not all drivers can do this.
pl: Ustawia fizyczny port lub typ nośnika, który ma być używany przez urządzenie. Nie wszystkie urządzenia mogą zmienić to ustawianie, a te które mogą, różnią się wartościami, które obsługują. Typowe wartości parametru I<typ> są następujące: B<10base2> (cienki Ethernet), B<10baseT> (oparty na skrętce 10Mbps Ethernet), B<AUI> (external transceiver) i tak dalej. Specjalny typ B<auto> może być użyty do automatycznego ustawienia nośnika. Jednakże nie wszystkie urządzenia to potrafią.

source: B<[-]broadcast [addr]>
pl: [B<->]B<broadcast> [I<adres>]

source: If the address argument is given, set the protocol broadcast address for this interface. Otherwise, set (or clear) the B<IFF_BROADCAST> flag for the interface.
pl: Jeśli podano także argument adresu, ustawia adres rozgłoszeniowy protokołu na ten interfejs. W przeciwnym wypadku ustawia to tylko flagę B<IFF_BROADCAST> na interfejsie.

source: B<[-]pointopoint [addr]>
pl: [B<->]B<pointopoint> [I<adres>]

source: This keyword enables the B<point-to-point> mode of an interface, meaning that it is a direct link between two machines with nobody else listening on it.
pl: To słowo kluczowe włącza tryb B<point-to-point> interfejsu, który oznacza, że jest to bezpośrednie połączenie między dwoma maszynami, których nikt inny nie podsłuchuje.

source: If the address argument is also given, set the protocol address of the other side of the link, just like the obsolete B<dstaddr> keyword does. Otherwise, set or clear the B<IFF_POINTOPOINT> flag for the interface.
pl: Jeśli podano także argument adresu, ustaw adres protokołowy drugiej strony połączenia, tak jak w przedawnionym B<dstaddr>. W przeciwnym wypadku ustawia lub usuwa to tylko flagę B<IFF_POINTOPOINT> interfejsu.

source: B<hw class address>
pl: B<hw> I<klasa adres>

source: Set the hardware address of this interface, if the device driver supports this operation. The keyword must be followed by the name of the hardware class and the printable ASCII equivalent of the hardware address. Hardware classes currently supported include B<ether> (Ethernet), B<ax25> (AMPR AX.25), B<ARCnet> and B<netrom> (AMPR NET/ROM).
pl: Ustawia adres sprzętowy interfejsu, jeśli sterownik obsługuję taką operację. Za słowem tym musi występować nazwa klasy sprzętowej i odczytywalnym w ASCII ekwiwalentem adresu sprzętowego. Obsługiwane obecnie klasy sprzętowe to B<ether> (Ethernet), B<ax25> (AMPR AX.25), B<ARCnet> i B<netrom> (AMPR NET/ROM).przypisania

source: Set the multicast flag on the interface. This should not normally be needed as the drivers set the flag correctly themselves.
pl: Włącza flagę multicast na interfejsie. Normalnie nie powinno być to potrzebne, gdyż sterowniki ustawiają tę flagę same.

source: B<address>
pl: I<adres>

source: The IP address to be assigned to this interface.
pl: Adres IP przypisany do interfejsu.

source: B<txqueuelen length>
pl: B<txqueuelen> I<długość>

source: Set the length of the transmit queue of the device. It is useful to set this to small values for slower devices with a high latency (modem links, ISDN) to prevent fast bulk transfers from disturbing interactive traffic like telnet too much.
pl: Ustawia długość kolejki transmisji dla danego urządzenia. Użyteczne jest ustawienie tego parametru na małą wartość dla wolniejszych urządzeń o dużych opóźnieniach (połączenia modemowe, ISDN), aby zapobiec szybkim masowym transferom generowanym przez na przykład telnet.

source: NOTES
pl: UWAGI

source: Since net-tools 1.60-4 ifconfig is printing byte counters and human readable counters with IEC 60027-2 units. So 1 KiB are 2^10 byte. Note, the numbers are truncated to one decimal (which can by quite a large error if you consider 0.1 PiB is 112.589.990.684.262 bytes :)
pl: Od net-tools 1.60-4 ifconfig wypisuje liczbę bajtów i jednostki czytelne dla człowieka w jednostkach IEC 60027-2. Tak więc 1 KiB to 2^10 bajtów. Proszę zauważyć, że liczby są zaokrąglone do jednego miejsca po przecinku (co może okazać się znacznym błędem, jeśli weźmie się pod uwagę, że 0.1 PiB to 112.589.990.684.262 bajtów :).

source: Interrupt problems with Ethernet device drivers fail with EAGAIN I<(SIOCSIIFLAGS: Resource temporarily unavailable)> it is most likely a interrupt conflict. See I<http://www.scyld.com/expert/irq-conflict.html> for more information.
pl: Problemy przerwań sterowników urządzeń Ethernet objawiające się błędem EAGAIN I<(SIOCSIIFLAGS: Resource temporarily unavailable)> wynikają najprawdopodobniej z konfliktów przerwań. Więcej informacji można znaleźć na stronie I<http://www.scyld.com/expert/irq-conflict.html>.

source: FILES
pl: PLIKI

source: BUGS
pl: BŁĘDY

source: While appletalk DDP and IPX addresses will be displayed they cannot be altered by this command.
pl: Podczas wyświetlania adresów appletalk DDP i IPX, nie można ich poprawiać tą komendą.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: http://physics.nist.gov/cuu/Units/binary.html - Prefixes for binary multiples
pl: http://physics.nist.gov/cuu/Units/binary.html - przedrostki binarne

source: AUTHORS
pl: AUTORZY

source: The name of the interface. This is usually a driver name followed by a unit number, for example B<eth0> for the first Ethernet interface. If your kernel supports alias interfaces, you can specify them with B<eth0:0> for the first alias of eth0. You can use them to assign a second address. To delete an alias interface use B<ifconfig eth0:0 down>. Note: for every scope (i.e. same net with address/netmask combination) all aliases are deleted, if you delete the first (primary).
pl: Nazwa interfejsu sieciowego. Jest to zwykle nazwa sterownika, za którą następuje numer jednostki, na przykład B<eth0> oznacza pierwszy interfejs ethernetowy. Jeśli jądro obsługuje również aliasy interfejsów, to można podać B<eth0:0>, w celu określenia pierwszego aliasu eth0. Można użyć ich do przypisania drugiego adresu. Aby usunąć alias interfejsu należy użyć B<ifconfig eth0:0 down>. Uwaga: w każdym przypadku (tzn. ta sama sieć z połączeniem adresu/maski sieciowej) usuwane są wszystkie aliasy, jeśli usunie się pierwszy (główny).

source: This flag causes the interface to be activated. It is implicitly specified if an address is assigned to the interface.
pl: Flaga ta powoduje aktywację interfejsu. Jest pośrednio włączana, gdy interfejsowi nadano nowy adres.
