Repository: sebras/manpages-l10n
Catalog: po/*/man8/iptraf-ng.8.po
Languages: pl

source: IPTraf-ng Help Page
pl: Strona pomocy programu IPTraf-ng

source: NAME
pl: NAZWA

source: iptraf - Interactive Colorful IP LAN Monitor
pl: iptraf - interaktywny (kolorowy) monitor IP LAN

source: SYNOPSIS
pl: SKŁADNIA

source: B<iptraf-ng> { [ B<-f> ] [ { B<-i> I<iface> | B<-g> | B<-d> I<iface> | B<-s> I<iface> | B<-z> I<iface> | B<-l> I<iface> } [ B<-t> I<timeout> ] [ B<-B> [ B<-L> I<logfile> ] ] ] | [ B<-h> ] }
pl: B<iptraf-ng> { [ B<-f> ] [ { B<-i> I<interfejs> | B<-g> | B<-d> I<interfejs> | B<-s> I<interfejs> | B<-z> I<interfejs> | B<-l> I<interfejs> } [ B<-t> I<timeout> ] [ B<-B> [ B<-L> I<plik_logu> ] ] ] | [ B<-h> ] }

source: DESCRIPTION
pl: OPIS

source: B<iptraf-ng> is an ncurses-based IP LAN monitor that generates various network statistics including TCP info, UDP counts, ICMP and OSPF information, Ethernet load info, node stats, IP checksum errors, and others.
pl: B<iptraf-ng> jest bazującym na bibliotece ncurses monitorem pakietów IP w sieci lokalnej generującym różnorodne statystyki sieciowe zawierające: informacje o pakietach TCP, zliczenia UDP, ICMP i OSPF, informacje o wykorzystaniu Ethetnetu, stany węzłów, błędy sum kontrolnych IP i inne.

source: If the B<iptraf-ng> command is issued without any command-line options, the program comes up in interactive mode, with the various facilities accessed through the main menu.
pl: Jeżeli B<iptraf-ng> jest uruchomiony bez opcji, przechodzi do trybu interaktywnego z menu głównym.

source: OPTIONS
pl: OPCJE

source: These options can also be supplied to the command:
pl: Poniższe opcje mogą być dodane w linii komend:

source: B<-i >I<iface>
pl: B<-i >I<interfejs>

source: immediately start the IP traffic monitor on the specified interface, or all interfaces if "-i all" is specified
pl: uruchamia monitor ruchu IP na podanym interfejsie sieciowym lub na wszystkich interfejsach, jeśli użyto "-i all".

source: immediately start the general interface statistics
pl: uruchamia się bezpośrednio jako monitor statystyk interfejsów sieciowych (general interface statistics)

source: B<-d >I<iface>
pl: B<-d >I<interfejs>

source: allows you to immediately start the detailed on the indicated interface (iface)
pl: uruchamia się bezpośrednio jako szczegółowy monitor dla konkretnego I<interfejs>-u

source: B<-s >I<iface>
pl: B<-s >I<interfejs>

source: allows you to immediately monitor TCP and UDP traffic on the specified interface (iface)
pl: uruchamia się bezpośrednio jako monitor pakietów TCP i UDP dla konkretnego I<interfejs>-u

source: B<-z >I<iface>
pl: B<-z >I<interfejs>

source: shows packet counts by size on the specified interface
pl: pokazuje licznik pakietów względem ich rozmiarów na podanym interfejsie

source: B<-l >I<iface>
pl: B<-l >I<interfejs>

source: start the LAN station monitor on the specified interface, or all LAN interfaces if "-l all" is specified
pl: uruchamia monitor stacji LAN na podanym interfejsie sieciowym lub na wszystkich interfejsach LAN, jeśli użyto "-l all".

source: tells IPTraf-ng to run the specified facility for only I<timeout> minutes. This option is used only with one of the above parameters.
pl: ustawia I<timeout> dla danej usługi (konkretnego monitora) w minutach. (Ta opcja jest używana tylko z opcjami znajdującymi się powyżej).

source: redirect standard output to /dev/null, closes standard input, and forks the program into the background. Can be used only with one of the facility invocation parameters above. Send the backgrounded process a USR2 signal to terminate.
pl: przekierowuje standardowe wyjście do /dev/null, zamyka standardowe wejście i uruchamia się w tle. Może być używane tylko z jednym z opisanych powyżej parametrów. Aby zakończyć uruchomiony w tle proces, należy mu wysłać sygnał USR2.

source: B<-L logfile>
pl: B<-L> I<plik_logu>

source: allows you to specify an alternate log file name. The default log file name is based on either the interface selected (detailed interface statistics, TCP/UDP service statistics, packet size breakdown), or the instance of the facility (IP traffic monitor, LAN station monitor). If a path is not specified, the log file is placed in B</var/log/iptraf-ng>
pl: pozwala na podanie alternatywnej nazwy pliku dziennika. Domyślna nazwa pliku dziennika jest oparta albo na wybranym interfejsie (szczegółowe statystyki interfejsu, statystyki usług TCP/UDP, rozmiary pakietów) albo na instancji wybranej funkcji (monitor ruchu IP, monitor stacji LAN). Jeśli ścieżka nie jest podana, to plik dziennika jest umieszczany w B</var/log/iptraf-ng>.

source: clears all locks and counters, causing this instance of IPTraf-ng to think it's the first one running. This should only be used to recover from an abnormal termination or system crash.
pl: czyści wszystkie blokady i liczniki, powodując, że instancja IPTraf-ng myśli, że jest pierwszą działającą. Opcja powinna być używana po nienormalnym zakończeniu programu lub załamaniu się systemu.

source: shows a command summary
pl: pokazuje skrócony opis opcji

source: SIGNALS
pl: SYGNAŁY

source: SIGUSR1 - rotates log files while program is running SIGUSR2 - terminates an IPTraf-ng process running in the background.
pl: SIGUSR1 - wymusza rotację plików dziennika podczas działania programu. SIGUSR2 - kończy proces IPTraf-ng działający w tle.

source: FILES
pl: PLIKI

source: /var/log/iptraf-ng/*.log - log file /var/lib/iptraf-ng/* - important IPTraf-ng data files
pl: /var/log/iptraf-ng/*.log - plik dziennika /var/lib/iptraf-ng/* - ważne pliki danych programu IPTraf-ng

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: Documentation/* - complete documentation written by the author
pl: Documentation/* - pełna dokumentacja napisana przez autora

source: AUTHOR
pl: AUTOR

source: MANUAL AUTHOR
pl: AUTOR PODRĘCZNIKA

source: Frederic Peters (fpeters@debian.org), using iptraf-ng -h General manual page modifications by Gerard Paul Java (riker@mozcom.com), Phil Cameron (pcameron@redhat.com)
pl: Frederic Peters (fpeters@debian.org), używając komenedy iptraf-ng -h. Ogólne modyfikacje w tym dokumencie wykonał Gerard Paul Java (riker@mozcom.com), Phil Cameron (pcameron@redhat.com).
