Repository: sebras/manpages-l10n
Catalog: po/*/man8/iwspy.8.po
Languages: it

source: 31 October 1996
it: 31 ottobre 1996

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux

source: NAME
it: NOME

source: iwspy - Get wireless statistics from specific nodes
it: iwspy - Raccoglie statistiche wirreless da specifici nodi

source: SYNOPSIS
it: SINTASSI

source: B<iwspy [>I<interface>B<]>
it: B<iwspy [>I<interfaccia>B<]>

source: B<iwspy >I<interface>B< [+] >I<DNSNAME>B< | >I<IPADDR>B< | >I<HWADDR>B< [...]>
it: B<iwspy >I<interfaccia>B< [+] >I<DNSNAME>B< | >I<IPADDR>B< | >II<HWADDR>B< [...]>

source: B<iwspy >I<interface>B< off>
it: B<iwspy >I<interfaccia>B< off>

source: B<iwspy >I<interface>B< setthr >I<low high>
it: B<iwspy >I<interfaccia>B< setthr >I<low high>

source: B<iwspy >I<interface>B< getthr>
it: B<iwspy >I<interfaccia>B< getthr>

source: DESCRIPTION
it: DESCRIZIONE

source: B<Iwspy> is used to set a list of addresses to monitor in a wireless network interface and to read back quality of link information for each of those. This information is the same as the one available in I</proc/net/wireless> : quality of the link, signal strength and noise level.
it: B<Iwspy> viene utilizzato per creare una lista di indirizzi in una interfaccia di rete wireless e fornire informazioni sulla qualità del collegamneto per ognuno di essi. Queste sono le stesse informazioni che sono disponibili in .I</proc/net/wireless>: qualità del segnale, potenza del segnale e livello di rumore.

source: This information is updated each time a new packet is received, so each address of the list adds some overhead in the driver.
it: Questa informazione viene aggiornata ogni volta che un nuovo pacchetto viene ricevuto, cosicché ogni indirizzo della lista aggiunga un sovraccarico nel driver.

source: Note that this functionality works only for nodes part of the current wireless cell, you can not monitor Access Points you are not associated with (you can use Scanning for that) and nodes in other cells. In Managed mode, in most case packets are relayed by the Access Point, in this case you will get the signal strength of the Access Point. For those reasons this functionality is mostly useful in Ad-Hoc and Master mode.
it: Si noti che questa funzionalità funziona solo su nodi che fanno parte della cella wireless corrente; non si possono monitorare Access Point con cui non si è associati (per questo si usi Scanning) e nodi di altre celle. In modalità Managed, in molti casi i pacchetti sono trasmessi dall'Access Point; in questo caso si otterrà la potenza del segnale dell'Access Point. Per queste ragioni questa funzionalità è maggiormente utile nelle modalità Ad-Hoc and Master.

source: PARAMETERS
it: PARAMETRI

source: You may set any number of addresses up to 8.
it: È possibile impostare un massimo di 8 indirizzi.

source: Set an IP address, or in some cases a DNS name (using the name resolver). As the hardware works with hardware addresses, B<iwspy> will translate this IP address through I<ARP>. In some case, this address might not be in the ARP cache and B<iwspy> will fail. In those case, I<ping>(8) this name/address and retry.
it: Imposta un indirizzo, o in alcuni casi un nome DNS (utilizzando il name resolver). Siccome l'hardware funziona con gli indirizzi fisici, B<iwspy> tradurrà questo indirizzo IP tramite I<ARP>. In alcuni casi, questo indirizzo potrebbe non essere nella cache ARP e B<iwspy> fallirà. In questi casi, fare un I<ping>(8) sul nome/indirizzo e riprovare.

source: Set a hardware (MAC) address (this address is not translated & checked like the IP one). The address must contain a colon (B<:>) to be recognised as a hardware address.
it: Imposta un indirizzo hardware (MAC) (questo indirizzo non è tradotto e controllato come quello IP). L'indirizzo deve contenere i due punti (B<:>) per essere riconosciuto come un indirizzo hardware.

source: Add the new set of addresses at the end of the current list instead of replacing it. The address list is unique for each device, so each user should use this option to avoid conflicts.
it: Aggiunge un insieme di indirizzi alla fine della lista attuale invece di sostituirla. La lista degli indirizzi è univoca per ogni dispositivo, così ogni utente dovrebbe utilizzare questa opzione per evitare conflitti.

source: Remove the current list of addresses and disable the spy functionality
it: Svuota la lista degli indirizzi e disabilita la funzionalità spy

source: Set the I<low> and I<high> signal strength threshold for the iwspy event (for drivers that support it).
it: Imposta la soglia di potenza del segnale I<low> (minima) e I<high> (massima) per gli eventi di iwspy (per driver che lo supportano).

source: Every time the signal strength for any of the address monitored with iwspy goes lower than the low threshold or goes higher than the high threshold, a Wireless Event will be generated.
it: Ogni volta che la potenza del segnale per ognuno degli indirizzi controllati con iwspy risulta inferiore alla soglia minima o risulta superiore alla soglia massima, verrà generato un Wireless Event.

source: This can be used to monitor link outages without having to run iwspy periodically.
it: Questo può essere utilizzato per controllare la stabilità del collegamento senza eseguire periodicamente iwspy.

source: Retrieve the current I<low> and I<high> signal strength threshold for the iwspy event.
it: Recupera le soglie di potenza del segnale I<low> (minime) e I<high> (massime) per gli eventi generati da iwspy.

source: FILES
it: FILE

source: SEE ALSO
it: VEDERE ANCHE
