Repository: sebras/manpages-l10n
Catalog: po/*/man8/kbdrate.8.po
Languages: pl

source: 22 June 1994
pl: 22 czerwca 1994

source: NAME
pl: NAZWA

source: kbdrate - reset the keyboard repeat rate and delay time
pl: kbdrate - ustawia częstość samopowtarzania i opóźnienia klawiatury

source: SYNOPSIS
pl: SKŁADNIA

source: B<kbdrate> [I<\,options\/>...]
pl: B<kbdrate> [I<\,opcje\/>...]

source: DESCRIPTION
pl: OPIS

source: B<kbdrate> is used to change the keyboard repeat rate and delay time. The delay is the amount of time that a key must be depressed before it will start to repeat.
pl: B<kbdrate> służy do zmiany częstotliwości samopowtarzania i opóźnienia klawiatury. Opóźnienie jest ilością czasu, przez który klawisz musi być wciśnięty zanim zacznie się automatycznie powtarzać.

source: Using B<kbdrate> without any options will reset the repeat rate to 10.9 characters per second (cps) and the delay to 250 milliseconds (ms) for Intel- and M68K-based systems. These are the IBM defaults. On SPARC-based systems it will reset the repeat rate to 5 cps and the delay to 200 ms.
pl: Użycie B<kbdrate> bez opcji ustawi częstotliwość samopowtarzania na 10,9 znaków na sekundę (cps), a opóźnienie na 250 milisekund (ms) dla systemów opartych na procesorach Intela i M68K. Są to wartości domyślne IBM. Dla systemów SPARC-owych częstotliwość samopowtarzania zostanie ustawiona na 5 cps, a opóźnienie na 200 ms.

source: OPTIONS
pl: OPCJE

source: B<-r>, B<--rate>=I<\,NUMBER\/>
pl: B<-r>, B<--rate>=I<\,LICZBA\/>

source: Change the keyboard repeat rate to I<NUMBER> cps. For Intel-based systems, the allowable range is from 2.0 to 30.0 cps. Only certain, specific values are possible, and the program will select the nearest possible value to the one specified. The possible values are given, in characters per second, as follows: 2.0, 2.1, 2.3, 2.5, 2.7, 3.0, 3.3, 3.7, 4.0, 4.3, 4.6, 5.0, 5.5, 6.0, 6.7, 7.5, 8.0, 8.6, 9.2, 10.0, 10.9, 12.0, 13.3, 15.0, 16.0, 17.1, 18.5, 20.0, 21.8, 24.0, 26.7, 30.0. For SPARC-based systems, the allowable range is from 0 (no repeat) to 50 cps.
pl: Zmienia częstość samopowtarzania na I<LICZBĘ> znaków na sekundę (cps). Dla systemów Intel-owskich dopuszczalny zakres mieści się w zakresie od 2.0 do 30.0 cps. Możliwe są tylko niektóre wartości, a program sam wybierze wartość najbliższą podanej. Możliwe wartości, w znakach na sekundę to: 2.0, 2.1, 2.3, 2.5, 2.7, 3.0, 3.3, 3.7, 4.0, 4.3, 4.6, 5.0, 5.5, 6.0, 6.7, 7.5, 8.0, 8.6, 9.2, 10.0, 10.9, 12.0, 13.3, 15.0, 16.0, 17.1, 18.5, 20.0, 21.8, 24.0, 26.7, 30.0. Dla systemów SPARC-owych dozwolone są wartości od 0 (brak powtarzania) do 50 cps.

source: B<-d>, B<--delay>=I<\,NUMBER\/>
pl: B<-d>, B<--delay>=I<\,LICZBA\/>

source: Change the delay to I<NUMBER> milliseconds. For Intel-based systems, the allowable range is from 250 to 1000 ms, in 250 ms steps. For SPARC systems, possible values are between 10 ms and 1440 ms, in 10 ms steps.
pl: Zmienia opóźnienie na I<LICZBĘ> milisekund. Dla systemów Intelowskich dopuszczalny jest zakres od 250 do 1000 ms ze skokiem co 250ms. Dla systemów SPARC-owych możliwe są wartości pomiędzy 10 ms a 1440 ms, z 10 ms skokiem.

source: Silent. No messages are printed.
pl: Cicho. Nie wypisuje żadnych komunikatów.

source: Display a help text.
pl: Wyświetla pomoc.

source: Display a version number and exit.
pl: Wypisuje numer wersji i kończy pracę.

source: BUGS
pl: BŁĘDY

source: Not all keyboards support all rates.
pl: Nie wszystkie klawiatury obsługują wszystkie częstości.

source: Not all keyboards have the rates mapped in the same way.
pl: Nie wszystkie klawiatury mają takie samo odwzorowanie częstości.

source: Setting the repeat rate on the Gateway AnyKey keyboard does not work. If someone with a Gateway figures out how to program the keyboard, please send mail to util-linux@math.uio.no.
pl: Ustawianie częstości powtarzania nie działa na klawiaturze Gateway AnyKey. Jeśli ktoś z tą klawiaturą wie, jak ją programować, to prosimy o wysłanie wiadomoścido util-linux@math.uio.no.

source: All this is very architecture dependent. Nowadays B<kbdrate> first tries the KDKBDREP and KIOCSRATE ioctls. (The former usually works on an m68k/i386 machine, the latter for SPARC.) When these ioctls fail an ioport interface.
pl: Wszystko bardzo silnie zależy od architektury. Obecnie B<kbdrate> najpierw próbuje użyć ioctl-i KDKBDREP i KIOCSRATE. (Pierwszy zazwyczaj działa na maszynach m68k/i386, a drugi na SPARC-owych). Gdy użycie tych ioctl-i się nie powiedzie, zakłada, że klawiatura korzysta z interfejsu opartego na portach I/O.

source: FILES
pl: PLIKI

source: Using B<kbdrate> without any options will reset the repeat rate to 10.9 characters per second (cps) and the delay to 250 milliseconds (ms) for Intel- and M68K-based systems. These are the IBM defaults. On SPARC-based systems it will reset the repeat rate to 20 cps and the delay to 200 ms.
pl: Użycie B<kbdrate> bez opcji ustawi częstotliwość samopowtarzania na 10,9 znaków na sekundę (cps), a opóźnienie na 250 milisekund (ms) dla systemów opartych na procesorach Intela i M68K. Są to wartości domyślne IBM. Dla systemów SPARC-owych częstotliwość samopowtarzania zostanie ustawiona na 20 cps, a opóźnienie na 200 ms.

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: B<kbdrate [ -s ] [ -r> rate B<] [ -d> delay B<]>
pl: B<kbdrate [ -s ] [ -r> częstość B<] [ -d> opóźnienie B<]>

source: B<kbdrate> is used to change the keyboard repeat rate and delay time. The delay is the amount of time that a key must be depressed before it will start to repeat.
pl: B<kbdrate> służy do zmiany częstotliwości samopowtarzania i opóźnienia klawiatury. Opóźnienie jest ilością czasu, przez który klawisz musi być wciśnięty zanim zacznie się automatycznie powtarzać.

source: Silent. No messages are printed.
pl: Cicho. Nie wypisuje żadnych komunikatów.

source: B<-r>I< rate>
pl: B<-r>I< częstość>

source: Change the keyboard repeat rate to I<rate> cps. For Intel-based systems, the allowable range is from 2.0 to 30.0 cps. Only certain, specific values are possible, and the program will select the nearest possible value to the one specified. The possible values are given, in characters per second, as follows: 2.0, 2.1, 2.3, 2.5, 2.7, 3.0, 3.3, 3.7, 4.0, 4.3, 4.6, 5.0, 5.5, 6.0, 6.7, 7.5, 8.0, 8.6, 9.2, 10.0, 10.9, 12.0, 13.3, 15.0, 16.0, 17.1, 18.5, 20.0, 21.8, 24.0, 26.7, 30.0. For SPARC-based systems, the allowable range is from 0 (no repeat) to 50 cps.
pl: Zmienia częstość samopowtarzania na I<częstość> cps. Dla systemów Intel-owskich dopuszczalny zakres mieści się w zakresie od 2.0 do 30.0 cps. Możliwe są tylko niektóre wartości, a program sam wybierze wartość najbliższą podanej. Możliwe wartości, w znakach na sekundę to: 2.0, 2.1, 2.3, 2.5, 2.7, 3.0, 3.3, 3.7, 4.0, 4.3, 4.6, 5.0, 5.5, 6.0, 6.7, 7.5, 8.0, 8.6, 9.2, 10.0, 10.9, 12.0, 13.3, 15.0, 16.0, 17.1, 18.5, 20.0, 21.8, 24.0, 26.7, 30.0. Dla systemów SPARC-owych dozwolone są wartości od 0 (brak powtarzania) do 50 cps.

source: B<-d>I< delay>
pl: B<-d>I< opóźnienie>

source: Change the delay to I<delay> milliseconds. For Intel-based systems, the allowable range is from 250 to 1000 ms, in 250 ms steps. For SPARC systems, possible values are between 10 ms and 1440 ms, in 10 ms steps.
pl: Zmienia opóźnienie na I<opóźnienie> milisekund. Dla systemów Intel-owskich dopuszczalny jest zakres od 250 do 1000 ms ze skokiem co 250ms. Dla systemów SPARC-owych możliwe są wartości pomiędzy 10 ms a 1440 ms, z 10 ms skokiem.

source: All this is very architecture dependent. Nowadays B<kbdrate> first tries the KDKBDREP and KIOCSRATE ioctls. (The former usually works on an m68k machine, the latter for SPARC.) When these ioctls fail an ioport interface as on i386 is assumed.
pl: Wszystko bardzo silnie zależy od architektury. Obecnie B<kbdrate> najpierw próbuje użyć ioctl-i KDKBDREP i KIOCSRATE. (Pierwszy zazwyczaj działa na maszynach m68k, a drugi na SPARC-owych). Gdy użycie tych ioctl-i się nie powiedzie, zakłada, że klawiatura korzysta z interfejsu opartego na portach I/O jak w i386.
