Repository: sebras/manpages-l10n
Catalog: po/*/man8/kernel-install.8.po
Languages: de

source: Configuration options for B<kernel-install>, as a series of I<KEY=>I<VALUE> assignments, compatible with shell syntax, following the same rules as described in B<os-release>(5)\&. /etc/kernel/install\&.conf will be read if present, and /usr/lib/kernel/install\&.conf otherwise\&. This file is optional\&. I<$KERNEL_INSTALL_CONF_ROOT> may be used to override the path\&.
de: Konfigurationsoptionen für B<kernel-install>, als eine Reihe von I<SCHLÜSSEL=>I<WERT>-Zuweisungen, kompatibel mit der Shell-Syntax und den in B<os-release>(5) beschriebenen Regeln folgend\&. Falls vorhanden, wird /etc/kernel/install\&.conf gelesen und /usr/lib/kernel/install\&.conf andernfalls\&. Diese Datei ist optional\&. I<$KERNEL_INSTALL_CONF_ROOT> kann zum Außerkraftsetzen des Pfades verwandt werden\&.

source: Currently, the following keys are supported: I<MACHINE_ID=>, I<BOOT_ROOT=>, I<layout=>, I<initrd_generator=>\&. See the Environment variables section above for details\&.
de: Derzeit werden die folgenden Schlüssel unterstützt: I<MACHINE_ID=>, I<BOOT_ROOT=>, I<layout=>, I<initrd_generator=>\&. Siehe obigen Abschnitt Umgebungsvariablen für Details\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<machine-id>(5), B<os-release>(5), B<depmod>(8), B<systemd-boot>(7), \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[2]\d\s+2
de: B<machine-id>(5), B<os-release>(5), B<depmod>(8), B<systemd-boot>(7), \m[blue]B<Systemstartladeprogrammspezifikation>\m[]\&\s-2\u[2]\d\s+2

source: NOTES
de: ANMERKUNGEN

source: Nowadays actually CPIO archives used as an "initramfs", rather than "initrd". See B<bootup>(7) for an explanation.
de: Heutzutage werden tatsächlich CPIO-Archive als »initramfs« statt einer »initrd« verwandt\&. Siehe B<bootup>(7) für eine Erläuterung.

source: Boot Loader Specification
de: Systemladerspezifikation

source: kernel-install - Add and remove kernel and initramfs images to and from /boot
de: kernel-install - Fügt Kernel und Initramfs-Images zu /boot hinzu und entfernt sie von dort

source: B<kernel-install> COMMAND [OPTIONS...] I<KERNEL-VERSION> I<KERNEL-IMAGE> [I<INITRD-FILE>...]
de: B<kernel-install> BEFEHL [OPTIONEN…] I<KERNEL-VERSION> I<KERNEL-ABBILD> [I<INITRD-DATEI>…]

source: B<kernel-install> is used to install and remove kernel and initramfs images to and from the boot loader partition, referred to as I<$BOOT> here\&. It will usually be one of /boot/, /efi/, or /boot/efi/, see below\&.
de: B<kernel-install> wird dazu verwandt, Kernel und Initramfs-Images in die Bootloader-Partition zu installieren und sie von dort wieder zu entfernen\&. Dies wird hier mit I<$BOOT> referenziert\&. Normalerweise ist es entweder /boot/, /efi/ oder /boot/efi/, siehe unten\&.

source: This command expects a kernel version string and a path to a kernel image file as arguments\&. Optionally, one or more initial RAM disk images may be specified as well (note that plugins might generate additional ones)\&. B<kernel-install> calls the executable files from /usr/lib/kernel/install\&.d/*\&.install and /etc/kernel/install\&.d/*\&.install (i\&.e\&. the plugins) with the following arguments:
de: Dieser Befehl erwartet eine Kernelversionszeichenkette und einen Pfad zu einer Kernel-Abbild-Datei als Argument\&. Optional können auch eine oder mehrere RAM-Disk-Abbilder festgelegt werden (beachten Sie, dass Erweiterungen zusätzliche erstellen könnten)\&. B<kernel-install> führt die ausführbaren Dateien aus /usr/lib/kernel/install\&.d/*\&.install und /etc/kernel/install\&.d/*\&.install (d\&.h\&. die Erweiterungen) mit folgenden Argumenten aus:

source: The third argument directly refers to the path where to place kernel images, initial RAM disk images and other resources for \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 Type #1 entries (the "entry directory")\&. If other boot loader schemes are used the parameter may be ignored\&. The I<ENTRY-TOKEN> string is typically the machine ID and is supposed to identify the local installation on the system\&. For details see below\&.
de: Das dritte Argument bezieht sich direkt auf den Pfad, unter dem Kernelabbilder, anfängliche RAM-Plattenabbilder und andere Ressourcen für \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2 Typ-#1-Zugänge abgelegt werden (das »Zugangsverzeichnis«)\&. Falls andere Systemstartprogramm-Schemata verwandt werden, könnte dieser Parameter ignoriert werden\&. Die Zeichenkette I<ZUGANGSMERKMAL> ist typischerweise die Maschinenkennung und soll die lokale Installation auf dem System identifizieren\&. Details sind nachfolgend beschrieben\&.

source: 90-loaderentry\&.install copies I<KERNEL-IMAGE> to $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/linux\&. If I<INITRD-FILE>s are provided, it also copies them to $BOOT/I<ENTRY-TOKEN>/I<KERNEL_VERSION>/I<INITRD-FILE>\&. It also creates a boot loader entry according to the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 (Type #1) in $BOOT/loader/entries/I<ENTRY-TOKEN>-I<KERNEL-VERSION>\&.conf\&. The title of the entry is the I<PRETTY_NAME> parameter specified in /etc/os-release or /usr/lib/os-release (if the former is missing), or "Linux I<KERNEL-VERSION>", if unset\&.
de: 90-loaderentry\&.install kopiert I<KERNEL-ABBILD> nach $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/linux\&. Falls I<INITRD-DATEI>en zur Verfügung gestellt werden, kopiert sie die Erweiterung auch nach $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/I<INITRD-DATEI>\&. Sie erstellt auch laut der \m[blue]B<Systemstartladeprogramm-(Bootloader)-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 (Typ #1) einen Systemstartladeprogrammeintrag in $BOOT/loader/entries/I<ZUGANGSMERKMAL>-I<KERNEL-VERSION>\&.conf\&. Der Titel des Eintrags ist der in /etc/os-release oder /usr/lib/os-release (falls erstere nicht existiert) im Parameter I<PRETTY_NAME> festgelegte Name oder »Linux I<KERNEL-VERSION>«, falls dieser nicht gesetzt ist.

source: The partition where the kernels and \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 snippets are located is called I<$BOOT>\&. B<kernel-install> determines the location of this partition by checking /efi/, /boot/, and /boot/efi/ in turn\&. The first location where $BOOT/loader/entries/ or $BOOT/I<ENTRY-TOKEN>/ exists is used\&.
de: Die Partition, in der die Kernel und die Schnipsel der \m[blue]B<Bootloader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 liegen, wird I<$BOOT> genannt\&. B<kernel-install> bestimmt den Ort dieser Partition durch Überprüfung von nacheinander /efi/, /boot/ und /boot/efi/\&. Der erste Ort, an dem $BOOT/loader/entries/ oder $BOOT/B<ZUGANGSMERKMAL>/ existiert, wird verwandt\&.

source: If B<--verbose> is used, I<$KERNEL_INSTALL_VERBOSE=1> will be set for the plugins\&. They may output additional logs in this case\&.
de: Es wird I<$KERNEL_INSTALL_VERBOSE=1> für die Erweiterungen gesetzt, falls B<--verbose> verwandt wird\&. Sie können in diesem Fall zusätzliche Protokollmeldungen ausgeben\&.

source: If I<$MACHINE_ID> is set and not empty when B<kernel-install> is invoked, it will be used as I<MACHINE-ID>, overriding any automatic detection attempts\&. The value must be a valid machine ID (32 hexadecimal characters)\&.
de: Falls beim Aufruf von B<kernel-install> I<MACHINE_ID> gesetzt und nicht leer ist, wird sie als I<MASCHINENKENNUNG> verwandt und damit werden alle automatischen Erkennungsversuche außer Kraft gesetzt\&. Der Wert muss eine gültige Maschinenkennung sein (32 hexadezimale Zeichen)\&.

source: I<$KERNEL_INSTALL_MACHINE_ID> is set for the plugins to the desired I<MACHINE-ID> to use\&. It\*(Aqs always a 128bit ID, and typically the ID from /etc/machine-id or the one passed in via I<$MACHINE_ID>\&. (If no machine ID was specified via these methods it might be generated randomly by B<kernel-install>, in which case it only applies to this invocation\&.)
de: I<$KERNEL_INSTALL_MACHINE_ID> wird für die Erweiterungen auf die gewünschte zu verwendende I<MASCHINENKENNUNG> gesetzt\&. Es ist immer eine 128-bit-Kennung und typischerweise die Kennung aus /etc/machine-id oder eine, die mittels I<$MACHINE_ID> übergeben wurde\&. (Falls über diese Methoden keine Maschinenkennung festgelegt wurde, dann kann sie von B<kernel-install> zufällig erstellt werden, sie gilt dann nur für diesen Aufruf\&.)

source: I<$KERNEL_INSTALL_ENTRY_TOKEN> is set for the plugins to the desired entry "token" to use\&. It\*(Aqs an identifier that shall be used to identify the local installation, and is often the machine ID, i\&.e\&. same as I<$KERNEL_INSTALL_MACHINE_ID>, but might also be a different type of identifier, for example a fixed string or the I<ID=>, I<IMAGE_ID=> values from /etc/os-release\&. The string passed here will be used to name Boot Loader Specification entries, or the directories the kernel image and initial RAM disk images are placed into\&. Note that while oftentimes I<$KERNEL_INSTALL_ENTRY_TOKEN> and I<$KERNEL_INSTALL_MACHINE_ID> are set to the same value, the latter is guaranteed to be a valid 32 character ID in lowercase hexadecimals while the former can be any short string\&. The entry token to use is read from /etc/kernel/entry-token, if it exists\&. Otherwise a few possible candidates below the I<$BOOT> are searched for Boot Loader Specification Type 1 entry directories, and if found the entry token is derived from that\&. If that is not successful the machine ID is used as fallback\&.
de: I<$KERNEL_INSTALL_ENTRY_TOKEN> wird für Erweiterungen auf das gewünschte, zu verwendene Zugangs-»Merkmal« gesetzt\&. Es ist ein Kennzeichner, der zur Identifizierung der lokalen Installation verwandt wird und oft die Maschinenkennung ist, d\&h\&. identisch zu I<$KERNEL_INSTALL_MACHINE_ID>\&. Es kann aber auch eine andere Art von Kennzeichner sein, beispielsweise eine feste Zeichenkette oder die Werte I<ID=>, I<IMAGE_ID=> aus /etc/os-release\&. Die hier übergebene Zeichenkette wird dazu verwandt, die Systemlader-Spezifikationseinträge zu benennen oder die Verzeichnisse, in die das Kernelabbild und die anfänglichen RAM-Plattenabbilder abgelegt werden\&. Beachten Sie, dass oft I<$KERNEL_INSTALL_ENTRY_TOKEN> und I<$KERNEL_INSTALL_MACHINE_ID> auf die gleichen Werte gesetzt werden, aber der erste Wert eine beliebige kurze Zeichenkette sein kann, während letzterer garantiert eine gültige 32-Zeichen-Kennung in kleingeschriebener hexadezimaler Form ist\&. Das zu verwendende Zugangsmerkmal wird aus /etc/kernel/entry-token gelesen, falls diese existiert\&. Andernfalls werden einige mögliche Kandidaten unterhalb von I<$BOOT> nach Systemlader-Spezifikation-Typ-1-Zugangsverzeichnissen durchsucht und, falls diese gefunden werden, wird daraus das Zugangsmerkmal abgeleitet\&. Falls das nicht erfolgreich ist, wird die Maschinenkennung als Rückfalloption verwandt\&.

source: I<$KERNEL_INSTALL_BOOT_ROOT> is set for the plugins to the absolute path of the root directory (mount point, usually) of the hierarchy where boot loader entries, kernel images, and associated resources should be placed\&. This usually is the path where the XBOOTLDR partition or the ESP (EFI System Partition) are mounted, and also conceptually referred to as I<$BOOT>\&. Can be overridden by setting I<$BOOT_ROOT>\&.
de: I<KERNEL_INSTALL_BOOT_ROOT=> wird für die Erweiterungen auf den absoluten Pfad des Wurzelverzeichnisses (normalerweise den Einhängepunkt) der Hierarchie gesetzt, in der Systemstartprogramm-Einträge, Kernel-Abbilder und zugehörige Ressourcen abgelegt werden sollen\&. Dies ist normalerweise der Pfad, auf dem die XBOOTLDR-Partition oder die ESP (EFI-Systempartition) eingehängt sind. Dieser kann konzeptionell auch mittels I<$BOOT> referenziert werden\&. Kann mit I<BOOT_ROOT> außer Kraft gesetzt werden\&.

source: Standard \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 Type #1 layout, compatible with B<systemd-boot>(7): entries in $BOOT/loader/entries/I<ENTRY-TOKEN>-I<KERNEL-VERSION>[+I<TRIES>]\&.conf, kernel and initrds under $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/
de: Standard \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[1]\d\s+2-Typ-#1-Layout, kompatibel mit B<systemd-boot>(7): Einträge in $BOOT/loader/entries/I<ZUGANGSMERKMAL>-I<KERNELVERSION>[+I<VERSUCHEN>]\&.conf, Kernel und Initrds unter $BOOT/I<ZUGANGSMERKMAL>/I<KERNELVERSION>/

source: I<$KERNEL_INSTALL_INITRD_GENERATOR> is set for plugins to select the initrd generator\&. This may be configured as I<initrd_generator=> in install\&.conf\&. See below\&.
de: I<$KERNEL_INSTALL_INITRD_GENERATOR> ist für Erweiterungen gesetzt, um den Initrd-Generator auszuwählen\&. Dies kann über I<initrd_generator=> in install\&.conf\& konfiguriert werden\&. Siehe unten\&.

source: Read by 90-loaderentry\&.install\&. The content of the file /etc/kernel/cmdline specifies the kernel command line to use\&. If that file does not exist, /usr/lib/kernel/cmdline is used\&. If that also does not exist, /proc/cmdline is used\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Der Inhalt der Datei /etc/kernel/cmdline legt die zu verwendende Kernelbefehlszeile fest\&. Falls die Datei nicht existiert, wird /usr/lib/kernel/cmdline verwandt\&. Falls auch diese Datei nicht existiert, wird /proc/cmdline verwandt\&.

source: Read by 90-loaderentry\&.install\&. If this file exists a numeric value is read from it and the naming of the generated entry file is slightly altered to include it as $BOOT/loader/entries/I<MACHINE-ID>-I<KERNEL-VERSION>+I<TRIES>\&.conf\&. This is useful for boot loaders such as B<systemd-boot>(7) which implement boot attempt counting with a counter embedded in the entry file name\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Falls diese Datei existiert, wird aus ihr ein numerischer Wert gelesen und die Benennung der erstellten Eintragsdatei wird leicht geändert, um ihn als $BOOT/loader/entries/I<MASCHINENKENNUNG>-I<KERNEL-VERSION>+I<VERSUCHE>\&.conf aufzunehmen\&. Dies ist für Systemstartprogramme wie B<systemd-boot>(7) nützlich, die Systemstartversuchezähler implementieren, bei der der Zähler in den Eintragsdateinamen eingebettet ist\&.

source: If this file exists it is read and used as "entry token" for this system, i\&.e\&. is used for naming Boot Loader Specification entries, see I<$KERNEL_INSTALL_ENTRY_TOKEN> above for details\&.
de: Falls diese Datei existiert, wird sie gelesen und als »Zugangsmerkmal« für dieses System verwandt, d\&.h\&. sie wird für die Benennung von Systemlader-Spezifikationseinträge verwandt, siehe vorstehenden I<$KERNEL_INSTALL_ENTRY_TOKEN> für Details\&.

source: Configuration options for B<kernel-install>, as a series of I<KEY=>I<VALUE> assignments, compatible with shell syntax\&. This currently supports two keys: I<layout=> and I<initrd_generator=>, for details see the Environment variables section above\&.
de: Konfigurationsoptionen für B<kernel-install> als Serie von I<SCHLÜSSEL>=I<WERT>-Zuweisungen, kompatibel zur Shell-Syntax\&. Derzeit unterstützt dies zwei Schlüssel: I<layout=> und I<initrd_generator=>\&. Details hierzu finden Sie in vorstehendem Abschnitt Umgebungsvariablen\&.

source: B<machine-id>(5), B<os-release>(5), B<depmod>(8), B<systemd-boot>(7), \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2
de: B<machine-id>(5), B<os-release>(5), B<depmod>(8), B<systemd-boot>(7), \m[blue]B<Systemstartladeprogrammspezifikation>\m[]\&\s-2\u[1]\d\s+2

source: B<kernel-install> will execute the files located in the directory /usr/lib/kernel/install\&.d/ and the local administration directory /etc/kernel/install\&.d/\&. All files are collectively sorted and executed in lexical order, regardless of the directory in which they live\&. However, files with identical filenames replace each other\&. Files in /etc/kernel/install\&.d/ take precedence over files with the same name in /usr/lib/kernel/install\&.d/\&. This can be used to override a system-supplied executables with a local file if needed; a symbolic link in /etc/kernel/install\&.d/ with the same name as an executable in /usr/lib/kernel/install\&.d/, pointing to /dev/null, disables the executable entirely\&. Executables must have the extension "\&.install"; other extensions are ignored\&.
de: B<kernel-install> führt die im Verzeichnis /usr/lib/kernel/install\&.d/ und dem lokalen Administratorverzeichnis /etc/kernel/install\&.d/ befindlichen Dateien aus\&. Alle Dateien werden gemeinsam sortiert und in lexikalischer Reihenfolge ausgeführt, unabhängig davon, in welchem Verzeichnis sie sich befinden\&. Allerdings ersetzen Dateien mit gleichem Dateinamen einander\&. Dateien in /etc/kernel/install\&.d/ haben gegenüber Dateien mit dem gleichen Namen in /usr/lib/kernel/install\&.d/ Vorrang\&. Dies kann dazu benutzt werden, um bei Bedarf vom System bereitgestellte Programme mit einer lokalen Datei außer Kraft zu setzen\&. Ein symbolischer Link in /etc/kernel/install\&.d/ auf /dev/null mit dem gleichen Namen wie das Programm in /usr/lib/kernel/install\&.d/ deaktiviert das Programm komplett\&. Programme müssen die Erweiterung »\&.install« tragen, andere Erweiterungen werden ignoriert\&.

source: An executable should return B<0> on success\&. It may also return B<77> to cause the whole operation to terminate (executables later in lexical order will be skipped)\&.
de: Ein Programm sollte im Erfolgsfall B<0> zurückliefern\&. Es darf auch B<77> zurückliefern, womit die gesamte Aktion beendet wird (Programme später in der lexikalischen Reihenfolge werden übersprungen)\&.

source: This command expects a kernel version string and a path to a kernel image file as arguments\&. B<kernel-install> calls the executables from /usr/lib/kernel/install\&.d/*\&.install and /etc/kernel/install\&.d/*\&.install with the following arguments:
de: Dieser Befehl erwartet eine Kernelversionszeichenkette und einen Pfad zu einer Kernel-Abbild-Datei als Argument\&. B<kernel-install> führt die Programme aus /usr/lib/kernel/install\&.d/*\&.install und /etc/kernel/install\&.d/*\&.install mit folgenden Argumenten aus:

source: add I<KERNEL-VERSION> $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/ I<KERNEL-IMAGE> [I<INITRD-FILE> \&.\&.\&.]
de: add I<KERNEL-VERSION> $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/ I<KERNEL-ABBILD> [I<INITRD-DATEI> …]

source: Three default plugins execute the following operations in this case:
de: Die drei Vorgabeerweiterungen führen in diesem Fall die folgenden Aktionen aus:

source: 00-entry-directory\&.install creates the directory $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/ if $BOOT/I<MACHINE-ID>/ already exists\&.
de: 00-entry-directory\&.install erstellt das Verzeichnis $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/, falls $BOOT/I<MASCHINENKENNUNG>/ bereits existiert\&.

source: 90-loaderentry\&.install copies I<KERNEL-IMAGE> to $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/linux\&. If an I<INITRD-FILE> is provided, it also copies I<INITRD-FILE> to $BOOT/I<MACHINE-ID>/I<KERNEL_VERSION>/I<INITRD-FILE>\&. It also creates a boot loader entry according to the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 in $BOOT/loader/entries/I<MACHINE-ID>-I<KERNEL-VERSION>\&.conf\&. The title of the entry is the I<PRETTY_NAME> parameter specified in /etc/os-release or /usr/lib/os-release (if the former is missing), or "Linux I<KERNEL-VERSION>", if unset\&.
de: 90-loaderentry\&.install kopiert I<KERNEL-IMAGE> nach $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/linux\&. Falls eine I<INITRD-DATEI> zur Verfügung gestellt wird, kopiert die Erweiterung auch die I<INITRD-DATEI> nach $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/I<INITRD-DATEI>\&. Sie erstellt auch laut der \m[blue]B<Systemstartladeprogramm-(Bootloader)-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 einen Systemstartladeprogrammeintrag in $BOOT/loader/entries/I<MASCHINENKENNUNG>-I<KERNEL-VERSION>\&.conf\&. Der Titel des Eintrags ist der in /etc/os-release oder /usr/lib/os-release (falls erstere nicht existiert) im Parameter I<PRETTY_NAME> festgelegte Name oder »Linux I<KERNEL-VERSION>«, falls dieser nicht gesetzt ist.

source: If the entry directory $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/ does not exist, this plugin does nothing\&.
de: Falls das Eintragsverzeichnis $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/ nicht existiert, macht diese Erweiterung nichts\&.

source: remove I<KERNEL-VERSION> $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/
de: remove I<KERNEL-VERSION> $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/

source: Afterwards, B<kernel-install> removes the directory $BOOT/I<MACHINE-ID>/I<KERNEL-VERSION>/ and its contents\&.
de: Anschließend entfernt B<kernel-install> das Verzeichnis $BOOT/I<MASCHINENKENNUNG>/I<KERNEL-VERSION>/ und seine Inhalte\&.

source: 90-loaderentry\&.install removes the file $BOOT/loader/entries/I<MACHINE-ID>-I<KERNEL-VERSION>\&.conf\&.
de: 90-loaderentry\&.install entfernt die Datei $BOOT/loader/entries/I<MASCHINENKENNUNG>-I<KERNEL-VERSION>\&.conf\&.

source: The partition where the kernels and \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 snippets are located is called I<$BOOT>\&. B<kernel-install> determines the location of this partition by checking /efi/, /boot/, and /boot/efi/ in turn\&. The first location where $BOOT/loader/entries/ or $BOOT/$MACHINE_ID/ exists is used\&.
de: Die Partition, in der die Kernel und die Schnipsel der \m[blue]B<Bootloader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 liegen, wird I<$BOOT> genannt\&. B<kernel-install> bestimmt den Ort dieser Partition durch Überprüfung von nacheinander /efi/, /boot/ und /boot/efi/\&. Der erste Ort, an dem $BOOT/loader/entries/ oder $BOOT/$MACHINE_ID/ existiert, wird verwandt\&.

source: Read by 90-loaderentry\&.install\&. The content of the file /etc/kernel/cmdline specifies the kernel command line to use\&. If that file does not exist, /proc/cmdline is used\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Der Inhalt der Datei /etc/kernel/cmdline legt die zu verwendende Kernelbefehlszeile fest\&. Falls die Datei nicht existiert, wird /proc/cmdline verwandt\&.

source: The content of this file specifies the machine identification I<MACHINE-ID>\&. If it cannot read /etc/machine-id, kernel-install will use "Linux" as the machine ID instead\&.
de: Der Inhalt dieser Datei legt die Maschinenidentifizierung I<MASCHINENKENNUNG> fest\&. Falls /etc/machine-id nicht gelesen werden kann, wird Kernel-install stattdessen »Linux« als Maschinenkennung verwenden\&.

source: The content of the file specifies the operating system title I<PRETTY_NAME>\&.
de: Der Inhalt dieser Datei legt den Betriebssystemtitel I<PRETTY_NAME> fest\&.
