Repository: sebras/manpages-l10n
Catalog: po/*/man8/kernel-install.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: kernel-install - Add and remove kernel and initrd images to and from /boot
de: kernel-install - Fügt Kernel und Initrd-Images zu /boot hinzu und entfernt sie von dort

source: SYNOPSIS
de: ÜBERSICHT

source: B<kernel-install> [OPTIONS...] COMMAND I<KERNEL-VERSION> I<KERNEL-IMAGE> [I<INITRD-FILE>...]
de: B<kernel-install> [OPTIONEN…] BEFEHL I<KERNEL-VERSION> I<KERNEL-ABBILD> [I<INITRD-DATEI>…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<kernel-install> is used to install and remove kernel and initrd images \&\s-2\u[1]\d\s+2 to and from the boot loader partition, referred to as I<$BOOT> here\&. It will usually be one of /boot/, /efi/, or /boot/efi/, see below\&.
de: B<kernel-install> wird dazu verwandt, Kernel und Initrd-Images \&\s-2\u[1]\d\s+2 in die Bootloader-Partition zu installieren und sie von dort wieder zu entfernen\&. Dies wird hier mit I<$BOOT> referenziert\&. Normalerweise ist es entweder /boot/, /efi/ oder /boot/efi/, siehe unten\&.

source: B<kernel-install> will run the executable files ("plugins") located in the directory /usr/lib/kernel/install\&.d/ and the local administration directory /etc/kernel/install\&.d/\&. All files are collectively sorted and executed in lexical order, regardless of the directory in which they live\&. However, files with identical filenames replace each other\&. Files in /etc/kernel/install\&.d/ take precedence over files with the same name in /usr/lib/kernel/install\&.d/\&. This can be used to override a system-supplied executables with a local file if needed; a symbolic link in /etc/kernel/install\&.d/ with the same name as an executable in /usr/lib/kernel/install\&.d/, pointing to /dev/null, disables the executable entirely\&. Executables must have the extension "\&.install"; other extensions are ignored\&.
de: B<kernel-install> führt die im Verzeichnis /usr/lib/kernel/install\&.d/ und dem lokalen Administratorverzeichnis /etc/kernel/install\&.d/ befindlichen ausführbaren Dateien (»Erweiterungen«) aus\&. Alle Dateien werden gemeinsam sortiert und in lexikalischer Reihenfolge ausgeführt, unabhängig davon, in welchem Verzeichnis sie sich befinden\&. Allerdings ersetzen Dateien mit gleichem Dateinamen einander\&. Dateien in /etc/kernel/install\&.d/ haben gegenüber Dateien mit dem gleichen Namen in /usr/lib/kernel/install\&.d/ Vorrang\&. Dies kann dazu benutzt werden, um bei Bedarf vom System bereitgestellte Programme mit einer lokalen Datei außer Kraft zu setzen\&. Ein symbolischer Link in /etc/kernel/install\&.d/ auf /dev/null mit dem gleichen Namen wie das Programm in /usr/lib/kernel/install\&.d/ deaktiviert das Programm komplett\&. Programme müssen die Erweiterung »\&.install« tragen, andere Erweiterungen werden ignoriert\&.

source: An executable placed in these directories should return B<0> on success\&. It may also return B<77> to cause the whole operation to terminate (executables later in lexical order will be skipped)\&.
de: Ein in diesen Verzeichnissen abgelegtes Programm sollte im Erfolgsfall B<0> zurückliefern\&. Es darf auch B<77> zurückliefern, womit die gesamte Aktion beendet wird (Programme später in der lexikalischen Reihenfolge werden übersprungen)\&.

source: COMMANDS
de: BEFEHLE

source: The following commands are understood:
de: Die folgenden Befehle werden verstanden:

source: B<add >I<KERNEL-VERSION>B< >I<KERNEL-IMAGE>B< [>I<INITRD-FILE>B< \&.\&.\&.]>
de: B<add >I<KERNEL-VERSION>B< >I<KERNEL-ABBILD>B< [>I<INITRD-DATEI>B< …]>

source: This command expects a kernel version string and a path to a kernel image file as arguments\&. Optionally, one or more initrd images may be specified as well (note that plugins might generate additional ones)\&. B<kernel-install> calls the executable files from /usr/lib/kernel/install\&.d/*\&.install and /etc/kernel/install\&.d/*\&.install (i\&.e\&. the plugins) with the following arguments:
de: Dieser Befehl erwartet eine Kernelversionszeichenkette und einen Pfad zu einer Kernel-Abbild-Datei als Argument\&. Optional können auch eine oder mehrere Initrd-Abbilder festgelegt werden (beachten Sie, dass Erweiterungen zusätzliche erstellen könnten)\&. B<kernel-install> führt die ausführbaren Dateien aus /usr/lib/kernel/install\&.d/*\&.install und /etc/kernel/install\&.d/*\&.install (d\&.h\&. die Erweiterungen) mit folgenden Argumenten aus:

source: add I<KERNEL-VERSION> $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/ I<KERNEL-IMAGE> [I<INITRD-FILE> \&.\&.\&.]
de: add I<KERNEL-VERSION> $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/ I<KERNEL-ABBILD> [I<INITRD-DATEI> …]

source: The third argument directly refers to the path where to place kernel images, initrd images and other resources for \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[2]\d\s+2 Type #1 entries (the "entry directory")\&. If other boot loader schemes are used the parameter may be ignored\&. The I<ENTRY-TOKEN> string is typically the machine ID and is supposed to identify the local installation on the system\&. For details see below\&.
de: Das dritte Argument bezieht sich direkt auf den Pfad, unter dem Kernelabbilder, Initrd-Abbilder und andere Ressourcen für \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[2]\d\s+2 Typ-#1-Zugänge abgelegt werden (das »Zugangsverzeichnis«)\&. Falls andere Systemstartprogramm-Schemata verwandt werden, könnte dieser Parameter ignoriert werden\&. Die Zeichenkette I<ZUGANGSMERKMAL> ist typischerweise die Maschinenkennung und soll die lokale Installation auf dem System identifizieren\&. Details sind nachfolgend beschrieben\&.

source: Two default plugins execute the following operations in this case:
de: Die Vorgabeerweiterungen führen in diesem Fall die folgenden Aktionen aus:

source: B<kernel-install> creates $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>, if enabled (see I<$KERNEL_INSTALL_LAYOUT>)\&.
de: B<kernel-install> erstellt $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>, falls aktiviert (siehe I<$KERNEL_INSTALL_LAYOUT>)\&.

source: 50-depmod\&.install runs B<depmod>(8) for the I<KERNEL-VERSION>\&.
de: 50-depmod\&.install führt B<depmod>(8) für die I<KERNEL-VERSION> aus\&.

source: 90-loaderentry\&.install copies I<KERNEL-IMAGE> to $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/linux\&. If I<INITRD-FILE>s are provided, it also copies them to $BOOT/I<ENTRY-TOKEN>/I<KERNEL_VERSION>/I<INITRD-FILE>\&. It also creates a boot loader entry according to the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[2]\d\s+2 (Type #1) in $BOOT/loader/entries/I<ENTRY-TOKEN>-I<KERNEL-VERSION>\&.conf\&. The title of the entry is the I<PRETTY_NAME> parameter specified in /etc/os-release or /usr/lib/os-release (if the former is missing), or "Linux I<KERNEL-VERSION>", if unset\&.
de: 90-loaderentry\&.install kopiert I<KERNEL-ABBILD> nach $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/linux\&. Falls I<INITRD-DATEI>en zur Verfügung gestellt werden, kopiert sie die Erweiterung auch nach $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/I<INITRD-DATEI>\&. Sie erstellt auch laut der \m[blue]B<Systemstartladeprogramm-(Bootloader)-Spezifikation>\m[]\&\s-2\u[2]\d\s+2 (Typ #1) einen Systemstartladeprogrammeintrag in $BOOT/loader/entries/I<ZUGANGSMERKMAL>-I<KERNEL-VERSION>\&.conf\&. Der Titel des Eintrags ist der in /etc/os-release oder /usr/lib/os-release (falls erstere nicht existiert) im Parameter I<PRETTY_NAME> festgelegte Name oder »Linux I<KERNEL-VERSION>«, falls dieser nicht gesetzt ist.

source: If I<$KERNEL_INSTALL_LAYOUT> is not "bls", this plugin does nothing\&.
de: Falls I<$KERNEL_INSTALL_LAYOUT> nicht »bls« ist, macht diese Erweiterung nichts\&.

source: This command expects a kernel version string as single argument\&. This calls executables from /usr/lib/kernel/install\&.d/*\&.install and /etc/kernel/install\&.d/*\&.install with the following arguments:
de: Dieser Befehl erwartet eine Kernelversionszeichenkette als einzelnes Argument\&. Er ruft Programme aus /usr/lib/kernel/install\&.d/*\&.install und /etc/kernel/install\&.d/*\&.install mit den folgenden Argumenten auf:

source: remove I<KERNEL-VERSION> $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/
de: remove I<KERNEL-VERSION> $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/

source: Afterwards, B<kernel-install> removes the entry directory $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/ and its contents, if it exists\&.
de: Anschließend entfernt B<kernel-install> das Zugangsverzeichnis $BOOT/I<ZUGANGSMERKMAL>/I<KERNEL-VERSION>/ und seine Inhalte, falls es existiert\&.

source: 50-depmod\&.install removes the files generated by B<depmod> for this kernel again\&.
de: 50-depmod\&.install entfernt die durch B<depmod> für diesen Kernel erstellten Dateien wieder\&.

source: 90-loaderentry\&.install removes the file $BOOT/loader/entries/I<ENTRY-TOKEN>-I<KERNEL-VERSION>\&.conf\&.
de: 90-loaderentry\&.install entfernt die Datei $BOOT/loader/entries/I<ZUGANGSMERKMAL>-I<KERNEL-VERSION>\&.conf\&.

source: Shows the various paths and parameters configured or auto-detected\&. In particular shows the values of the various I<$KERNEL_INSTALL_*> environment variables listed below\&.
de: Zeigt die verschiedenen konfigurierten oder automatisch erkannten Pfade\&. Insbesondere zeigt dies die Werte der verschiedenen, nachfolgend aufgeführten Umgebungsvariablen I<$KERNEL_INSTALL_*>\&.

source: THE \FI$BOOT\FR PARTITION
de: DIE PARTITION »$BOOT«

source: The partition where the kernels and \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[2]\d\s+2 snippets are located is called I<$BOOT>\&. B<kernel-install> determines the location of this partition by checking /efi/, /boot/, and /boot/efi/ in turn\&. The first location where $BOOT/loader/entries/ or $BOOT/I<ENTRY-TOKEN>/ exists is used\&.
de: Die Partition, in der die Kernel und die Schnipsel der \m[blue]B<Bootloader-Spezifikation>\m[]\&\s-2\u[2]\d\s+2 liegen, wird I<$BOOT> genannt\&. B<kernel-install> bestimmt den Ort dieser Partition durch Überprüfung von nacheinander /efi/, /boot/ und /boot/efi/\&. Der erste Ort, an dem $BOOT/loader/entries/ oder $BOOT/B<ZUGANGSMERKMAL>/ existiert, wird verwandt\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Output additional information about operations being performed\&.
de: gibt zusätzliche Informationen über durchgeführte Aktionen aus\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: ENVIRONMENT VARIABLES
de: UMGEBUNGSVARIABLEN

source: Environment variables exported for plugins
de: Für Erweiterungen exportierte Umgebungsvariablen

source: If B<--verbose> is used, I<$KERNEL_INSTALL_VERBOSE=1> will be exported for plugins\&. They may output additional logs in this case\&.
de: Es wird I<$KERNEL_INSTALL_VERBOSE=1> für Erweiterungen exportiert, falls B<--verbose> verwandt wird\&. Sie können in diesem Fall zusätzliche Protokollmeldungen ausgeben\&.

source: I<$KERNEL_INSTALL_MACHINE_ID> is set for the plugins to the desired machine-id to use\&. It\*(Aqs always a 128-bit ID\&. Normally it\*(Aqs read from /etc/machine-id, but it can also be overridden via I<$MACHINE_ID> (see below)\&. If not specified via these methods a fallback value will generated by B<kernel-install>, and used only for a single invocation\&.
de: I<$KERNEL_INSTALL_MACHINE_ID> wird für die Erweiterungen auf die gewünschte zu verwendende Maschinenkennung gesetzt\&. Es ist immer eine 128-bit-Kennung\&. Normalerweise wird sie aus /etc/machine-id ausgelesen, aber das kann auch mittels I<$MACHINE_ID> außer Kraft gesetzt werden (siehe unten)\&. Falls nicht angegeben wird der Rückfallwert dieser Methoden durch B<kernel-install> erstellt und nur für einen einzelnen Aufruf verwandt werden\&.

source: I<$KERNEL_INSTALL_ENTRY_TOKEN> is set for the plugins to the desired entry "token" to use\&. It\*(Aqs an identifier that shall be used to identify the local installation, and is often the machine ID, i\&.e\&. same as I<$KERNEL_INSTALL_MACHINE_ID>, but might also be a different type of identifier, for example a fixed string or the I<ID=>, I<IMAGE_ID=> values from /etc/os-release\&. The string passed here will be used to name Boot Loader Specification entries, or the directories the kernel image and initial RAM disk images are placed into\&.
de: I<$KERNEL_INSTALL_ENTRY_TOKEN> wird für Erweiterungen auf das gewünschte, zu verwendene Zugangs-»Merkmal« gesetzt\&. Es ist ein Kennzeichner, der zur Identifizierung der lokalen Installation verwandt wird und oft die Maschinenkennung ist, d\&h\&. identisch zu I<$KERNEL_INSTALL_MACHINE_ID>\&. Es kann aber auch eine andere Art von Kennzeichner sein, beispielsweise eine feste Zeichenkette oder die Werte I<ID=>, I<IMAGE_ID=> aus /etc/os-release\&. Die hier übergebene Zeichenkette wird dazu verwandt, die Systemlader-Spezifikationseinträge zu benennen oder die Verzeichnisse, in die das Kernelabbild und die anfänglichen RAM-Plattenabbilder abgelegt werden\&.

source: Note that while I<$KERNEL_INSTALL_ENTRY_TOKEN> and I<$KERNEL_INSTALL_MACHINE_ID> are often set to the same value, the latter is guaranteed to be a valid 32 character ID in lowercase hexadecimals while the former can be any short string\&. The entry token to use is read from /etc/kernel/entry-token, if it exists\&. Otherwise a few possible candidates below I<$BOOT> are checked for Boot Loader Specification Type 1 entry directories, and if found the entry token is derived from that\&. If that is not successful, I<$KERNEL_INSTALL_MACHINE_ID> is used as fallback\&.
de: Beachten Sie, dass oft I<$KERNEL_INSTALL_ENTRY_TOKEN> und I<$KERNEL_INSTALL_MACHINE_ID> auf die gleichen Werte gesetzt werden, aber der erste Wert eine beliebige kurze Zeichenkette sein kann, während letzterer garantiert eine gültige 32-Zeichen-Kennung in kleingeschriebener hexadezimaler Form ist\&. Das zu verwendende Zugangsmerkmal wird aus /etc/kernel/entry-token gelesen, falls diese existiert\&. Andernfalls werden einige mögliche Kandidaten unterhalb von I<$BOOT> auf Systemlader-Spezifikation-Typ-1-Zugangsverzeichnisse überprüft und, falls diese gefunden werden, daraus das Zugangsmerkmal abgeleitet wird\&. Falls das nicht erfolgreich ist, wird I<$KERNEL_INSTALL_MACHINE_ID> als Rückfalloption verwandt\&.

source: I<$KERNEL_INSTALL_BOOT_ROOT> is set for the plugins to the absolute path of the root directory (mount point, usually) of the hierarchy where boot loader entries, kernel images, and associated resources should be placed\&. This usually is the path where the XBOOTLDR partition or the ESP (EFI System Partition) are mounted, and also conceptually referred to as I<$BOOT>\&. Can be overridden by setting I<$BOOT_ROOT> (see below)\&.
de: I<KERNEL_INSTALL_BOOT_ROOT=> wird für die Erweiterungen auf den absoluten Pfad des Wurzelverzeichnisses (normalerweise den Einhängepunkt) der Hierarchie gesetzt, in der Systemstartprogramm-Einträge, Kernel-Abbilder und zugehörige Ressourcen abgelegt werden sollen\&. Dies ist normalerweise der Pfad, auf dem die XBOOTLDR-Partition oder die ESP (EFI-Systempartition) eingehängt sind. Dieser kann konzeptionell auch mittels I<$BOOT> referenziert werden\&. Kann mit I<BOOT_ROOT> außer Kraft gesetzt werden (siehe unten)\&.

source: I<$KERNEL_INSTALL_LAYOUT=bls|other|\&.\&.\&.> is set for the plugins to specify the installation layout\&. Defaults to B<bls> if $BOOT/I<ENTRY-TOKEN> exists, or B<other> otherwise\&. Additional layout names may be defined by convention\&. If a plugin uses a special layout, it\*(Aqs encouraged to declare its own layout name and configure I<layout=> in install\&.conf upon initial installation\&. The following values are currently understood:
de: I<KERNEL_INSTALL_LAYOUT=bls|other|…> wird für die Erweiterungen zur Angabe des Installationslayouts festgelegt\&. Standardmäßig B<bls>, falls $BOOT/I<ZUGANGSMERKMAL> existiert oder ansonsten B<other>\&. Per Konvention können zusätzliche Layoutnamen definiert sein\&. Falls eine Erweiterung ein bestimmtes Layout verwendet, wird empfohlen, dass ein eigener Layoutname erklärt und I<layout=> während der Installation in install\&.conf konfiguriert wird\&. Die folgenden Werte werden derzeit verstanden:

source: Standard \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[2]\d\s+2 Type #1 layout, compatible with B<systemd-boot>(7): entries in $BOOT/loader/entries/I<ENTRY-TOKEN>-I<KERNEL-VERSION>[+I<TRIES>]\&.conf, kernel and initrds under $BOOT/I<ENTRY-TOKEN>/I<KERNEL-VERSION>/
de: Standard \m[blue]B<Systemladerspezifikation>\m[]\&\s-2\u[2]\d\s+2-Typ-#1-Layout, kompatibel mit B<systemd-boot>(7): Einträge in $BOOT/loader/entries/I<ZUGANGSMERKMAL>-I<KERNELVERSION>[+I<VERSUCHEN>]\&.conf, Kernel und Initrds unter $BOOT/I<ZUGANGSMERKMAL>/I<KERNELVERSION>/

source: Implemented by 90-loaderentry\&.install\&.
de: Implementiert durch 90-loaderentry\&.install\&.

source: Some other layout not understood natively by B<kernel-install>\&.
de: Anderes, von B<kernel-install> nicht nativ verstandenes Layout\&.

source: I<$KERNEL_INSTALL_INITRD_GENERATOR> is set for plugins to select the initrd generator\&. This may be configured as I<initrd_generator=> in install\&.conf, see below\&.
de: I<$KERNEL_INSTALL_INITRD_GENERATOR> ist für Erweiterungen gesetzt, um den Initrd-Generator auszuwählen\&. Dies kann über I<initrd_generator=> in install\&.conf\& konfiguriert werden, siehe unten\&.

source: I<$KERNEL_INSTALL_STAGING_AREA> is set for plugins to a path to a directory\&. Plugins may drop files in that directory, and they will be installed as part of the loader entry, based on the file name and extension\&.
de: I<$KERNEL_INSTALL_STAGING_AREA> ist für Erweiterungen auf einen Pfad zu einem Verzeichnis gesetzt\&. Erweiterungen können Ergänzungsdateien in diesem Verzeichnis sein und sie werden als Teil des Lader-Zugangs installiert, basierend auf dem Dateinamen und der Erweiterung\&.

source: Environment variables understood by kernel-install
de: Von Kernel-install verstandene Umgebungsvariablen

source: I<$KERNEL_INSTALL_CONF_ROOT> can be set to override the location of the configuration files read by B<kernel-install>\&. When set, install\&.conf, entry-token, and other files will be read from this directory\&.
de: I<$KERNEL_INSTALL_CONF_ROOT> kann gesetzt werden, um den Ort der von B<kernel-install> gelesenen Konfigurationsdateien außer Kraft zu setzen\&. Wenn gesetzt, werden install\&.conf, entry-token und andere Dateien aus diesem Verzeichnis gelesen\&.

source: I<$KERNEL_INSTALL_PLUGINS> can be set to override the list of plugins executed by B<kernel-install>\&. The argument is a whitespace-separated list of paths\&. "KERNEL_INSTALL_PLUGINS=:" may be used to prevent any plugins from running\&.
de: I<$KERNEL_INSTALL_PLUGINS> kann gesetzt werden, um die Liste der von B<kernel-install> ausgeführten Erweiterungen außer Kraft zu setzen\&. Das Argument ist eine Lerraum-getrennte Liste von Pfaden\&. Mit »KERNEL_INSTALL_PLUGINS=:« kann erreicht werden, dass keine Erweiterung ausgeführt wird\&.

source: I<$MACHINE_ID> can be set for B<kernel-install> to override I<$KERNEL_INSTALL_MACHINE_ID>, the machine ID\&.
de: I<$MACHINE_ID> kann gesetzt werden, damit B<kernel-install> I<$KERNEL_INSTALL_MACHINE_ID>, die Maschinenkennung, außer Kraft setzt\&.

source: I<$BOOT_ROOT> can be set for B<kernel-install> to override I<$KERNEL_INSTALL_BOOT_ROOT>, the installation location for boot entries\&.
de: I<$BOOT_ROOT> kann gesetzt werden, damit B<kernel-install> I<$KERNEL_INSTALL_BOOT_ROOT>, der Installationsort für Systemstarteinträge, außer Kraft setzt\&.

source: The last two variables may also be set in install\&.conf\&. Variables set in the environment take precedence over the values specified in the config file\&.
de: Die letzten zwei Variablen können auch in install\&.conf gesetzt werden\&. In der Umgebung gesetzte Variablen haben Vorrang vor in Konfigurationsdateien gesetzten Werten\&.

source: If every executable returns 0 or 77, 0 is returned, and a non-zero failure code otherwise\&.
de: Falls alle Programme 0 oder 77 zurückliefern, wird 0 zurückgeliefert, andernfalls ein von Null verschiedener Fehlercode\&.

source: FILES
de: DATEIEN

source: Drop-in files which are executed by kernel-install\&.
de: Ergänzungsdateien, die durch kernel-install ausgeführt werden\&.

source: Read by 90-loaderentry\&.install\&. The content of the file /etc/kernel/cmdline specifies the kernel command line to use\&. If that file does not exist, /usr/lib/kernel/cmdline is used\&. If that also does not exist, /proc/cmdline is used\&. I<$KERNEL_INSTALL_CONF_ROOT> may be used to override the path\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Der Inhalt der Datei /etc/kernel/cmdline legt die zu verwendende Kernelbefehlszeile fest\&. Falls die Datei nicht existiert, wird /usr/lib/kernel/cmdline verwandt\&. Falls auch diese Datei nicht existiert, wird /proc/cmdline verwandt\&. Mit I<$KERNEL_INSTALL_CONF_ROOT> kann der Pfad außer Kraft gesetzt werden\&.

source: Read by 90-loaderentry\&.install\&. If this file exists a numeric value is read from it and the naming of the generated entry file is slightly altered to include it as $BOOT/loader/entries/I<MACHINE-ID>-I<KERNEL-VERSION>+I<TRIES>\&.conf\&. This is useful for boot loaders such as B<systemd-boot>(7) which implement boot attempt counting with a counter embedded in the entry file name\&. I<$KERNEL_INSTALL_CONF_ROOT> may be used to override the path\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Falls diese Datei existiert, wird aus ihr ein numerischer Wert gelesen und die Benennung der erstellten Eintragsdatei wird leicht geändert, um ihn als $BOOT/loader/entries/I<MASCHINENKENNUNG>-I<KERNEL-VERSION>+I<VERSUCHE>\&.conf aufzunehmen\&. Dies ist für Systemstartprogramme wie B<systemd-boot>(7) nützlich, die Systemstartversuchezähler implementieren, bei der der Zähler in den Eintragsdateinamen eingebettet ist\&. Mit I<$KERNEL_INSTALL_CONF_ROOT> kann der Pfad außer Kraft gesetzt werden\&.

source: If this file exists it is read and used as "entry token" for this system, i\&.e\&. is used for naming Boot Loader Specification entries, see I<$KERNEL_INSTALL_ENTRY_TOKEN> above for details\&. I<$KERNEL_INSTALL_CONF_ROOT> may be used to override the path\&.
de: Falls diese Datei existiert, wird sie gelesen und als »Zugangsmerkmal« für dieses System verwandt, d\&.h\&. sie wird für die Benennung von Systemlader-Spezifikationseinträge verwandt, siehe vorstehenden I<$KERNEL_INSTALL_ENTRY_TOKEN> für Details\&. Mit I<$KERNEL_INSTALL_CONF_ROOT> kann dieser Pfad außer Kraft gesetzt werden\&.

source: The content of this file specifies the machine identification I<MACHINE-ID>\&.
de: Der Inhalt dieser Datei legt die Maschinenkennung I<MASCHINENKENNUNG> fest\&.

source: Read by 90-loaderentry\&.install\&. If available, I<PRETTY_NAME=> is read from these files and used as the title of the boot menu entry\&. Otherwise, "Linux I<KERNEL-VERSION>" will be used\&.
de: Wird von 90-loaderentry\&.install gelesen\&. Falls verfügbar, wird I<PRETTY_NAME=> aus diesen Dateien gelesen und als den Titel für den Systemstarteintrag verwandt\&. Andernfalls wird »Linux I<KERNELVERSION>« verwandt\&.
