Repository: sebras/manpages-l10n
Catalog: po/*/man8/ld.so.8.po
Languages: es, fr

source: Each shared object can inform the dynamic linker of the minimum kernel ABI version that it requires. (This requirement is encoded in an ELF note section that is viewable via I<readelf\ -n> as a section labeled B<NT_GNU_ABI_TAG>.) At run time, the dynamic linker determines the ABI version of the running kernel and will reject loading shared objects that specify minimum ABI versions that exceed that ABI version.
es: Cada objeto compartido puede informar al enlazador dinámico de la versión mínima de ABI del núcleo que requiere. (Este requisito está codificado en una sección de notas ELF que se puede ver ejecutando I<readelf \ -n> como una sección marcada como B<NT_GNU_ABI_TAG>). Durante la ejecución, el enlazador dinámico determina la versión ABI del núcleo que se está ejecutando y rechazará cargar objetos compartidos que necesiten una versión superior.
fr: Tout objet partagé peut informer l'éditeur de liens dynamiques de la version minimale requise de l'ABI du noyau. (Cette exigence est enregistrée dans une section de note ELF, qui peut être lue avec I<readelf\ -n> sous le nom B<NT_GNU_ABI_TAG>.) Lors de l'exécution, l'éditeur de liens dynamiques détermine la version d'ABI du noyau exécutée et rejettera le chargement de tout objet partagé qui spécifie une version minimale d'ABI supérieure.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The program B<ld.so> handles a.out binaries, a format used long ago; B<ld-linux.so*> (I</lib/ld-linux.so.1> for libc5, I</lib/ld-linux.so.2> for glibc2) handles ELF, which everybody has been using for years now. Otherwise, both have the same behavior, and use the same support files and programs as B<ldd>(1), B<ldconfig>(8), and I</etc/ld.so.conf>.
es: El programa B<ld.so> maneja ficheros binarios con el formato a.out, un formato ya antiguo. El programa B<ld-linux.so*> maneja el formato ELF (B</lib/ld-linux.so.1> para libc5, B</lib/ld-linux.so.2> para glibc2), más moderno. Por lo demás, ambos tienen el mismo comportamiento y usan los mismos ficheros de configuración y programas (B<ldd>(1), B<ldconfig>(8) y I</etc/ld.so.conf>).

source: Rpath token expansion
es: Expansión de token Rpath
fr: Développement des mots-clés rpath

source: The dynamic linker understands certain token strings in an rpath specification (DT_RPATH or DT_RUNPATH). Those strings are substituted as follows:
es: El enlazador puede interpretar algunos token de una especificación rpath (DT_RPATH o DT_RUNPATH). Estas cadenas se sustituyen del siguiente modo:
fr: L’éditeur de liens dynamiques interprète certaines chaînes de mots-clés dans une spécification rpath (DT_RPATH ou DT_RUNPATH). Ces chaines sont substituées ainsi :

source: Ignore RPATH and RUNPATH information in object names in I<list>. This option is ignored when running in secure-execution mode (see below).
es: Ignora la información de RPATH y RUNPATH en los nombres de objeto en I<list>. Esta opción no se aplica si la ejecución se realiza en modo seguro (vea más adelante).

source: Use objects named in I<list> as auditors.
es: Utilice los objetos nombrados en I<lista> como auditores.

source: For security reasons, the effects of some environment variables are voided or modified if the dynamic linker determines that the binary should be run in secure-execution mode. (For details, see the discussion of individual environment variables below.) A binary is executed in secure-execution mode if the B<AT_SECURE> entry in the auxiliary vector (see B<getauxval>(3)) has a nonzero value. This entry may have a nonzero value for various reasons, including:
es: Por razones de seguridad, se anula o modifica el comportamiento de algunas variables de entorno si el enlazador determina que el binario debe ejecutarse en modo seguro, consulte más adelante la información sobre variables de entorno. Un binario se ejecuta en mod seguro si el campo B<AT_SECURE> en el vector auxiliar contiene un valor distinto de cero (consulte B<getauxval>(3)). Existen diversas razones por las cuales este campo puede contener un valor distinto de cero:

source: A list of directories in which to search for ELF libraries at execution time. The items in the list are separated by either colons or semicolons, and there is no support for escaping either separator.
es: Una lista de directorios para buscar librerías ELF durante la ejecución. Estarán separados entre si por dos puntos o por punto y coma.
fr: Une liste de répertoires de recherche pour les bibliothèques ELF au moment de l'exécution. Les éléments de la liste sont séparés par des deux-points ou des points-virgules et aussi il n’existe aucune protection des séparateurs.

source: Within the pathnames specified in B<LD_LIBRARY_PATH>, the dynamic linker expands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. Thus, for example, the following would cause a library to be searched for in either the I<lib> or I<lib64> subdirectory below the directory containing the program to be executed:
es: Dentro de los nombres de ruta especificados en B<LD_LIBRARY_PATH>, el enlazador dinámico expande los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o las versiones con llaves alrededor de los nombres) como se describió antes en I<Expansión del token Rpath>. Así, por ejemplo, lo siguiente haría que se buscara una biblioteca en el subdirectorio I<lib> o I<lib64> debajo del directorio que contiene el programa a ejecutar:
fr: À l’intérieur des noms de chemin indiqués dans B<LD_LIBRARY_PATH>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Développement des mots-clés rpath>. Par conséquent, par exemple, ce qui suit provoquera la recherche d’une bibliothèque dans les sous-répertoires I<lib> ou I<lib64> en dessous du répertoire contenant le programme à exécuter :

source: A list of additional, user-specified, ELF shared objects to be loaded before all others. The items of the list can be separated by spaces or colons, and there is no support for escaping either separator. This can be used to selectively override functions in other shared objects. The objects are searched for using the rules given under DESCRIPTION.
es: Una lista con una serie adicional, especificados por el usuario, de objetos compartidos ELF para ser cargados antes que todos los demás. Los componentes de esta lista puede separarse entre si mediante espacios o punto y comas, no siendo posible utilizar caracteres de escape para ellos. Esto puede usarse para anular en casos concretos algunas funciones en otros objetos compartidos. Se buscan dichos objectos empleando las reglas dadas en DESCRIPCIÓN.

source: Within the names specified in the B<LD_PRELOAD> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
es: Dentro de los nombres especificados en la lista B<LD_PRELOAD>, el enlazador dinámico interpreta los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o el equivalente con llaves alrededor de los nombres) como se ha descrito anteriormente en I<Rpath token expansion>. (Véase también la explicación sobre entrecomillado en el apartado B<LD_LIBRARY_PATH>)
fr: À l’intérieur des noms indiqués dans B<LD_PRELOAD>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Développement des mots-clés rpath>. (Voir aussi le point sur la mise entre parenthèses dans la description de B<LD_LIBRARY_PATH>).

source: A colon-separated list of user-specified, ELF shared objects to be loaded before all others in a separate linker namespace (i.e., one that does not intrude upon the normal symbol bindings that would occur in the process) and there is no support for escaping the separator. These objects can be used to audit the operation of the dynamic linker.
es: Una lista de objetos compartidos ELF, separados entre si con punto y coma, especificados por el usuario que se cargarán antes que todos los demás en un espacio de nombres de enlazador separado (es decir, uno que no interfiera en el enlazado de símbolos del proceso) Estos objetos se pueden usar para auditar la operación del enlazador dinámico.

source: Within the names specified in the B<LD_AUDIT> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
es: Dentro de los nombres especificados en la lista B<LD_AUDIT>, el enlazador dinámico interpreta los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o sus equivalente con llaves alrededor de los nombres) como se ha descrito anteriormente en I<Rpath token expansion>. (Véase también la explicación sobre entrecomillado en el apartado B<LD_LIBRARY_PATH>)
fr: À l’intérieur des noms indiqués dans B<LD_AUDIT>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Développement des mots-clés rpath>. (Voir aussi le point sur la mise entre parenthèses dans la description de B<LD_LIBRARY_PATH>.)

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: $ B<LD_ASSUME_KERNEL=2.2.5 ./myprog>
fr: $ B<LD_ASSUME_KERNEL=2.2.5 ./monprogamme>
