Repository: sebras/manpages-l10n
Catalog: po/*/man8/ld.so.8.po
Languages: es, fr

source: Linux man-pages 6.01
es: Páginas de manual de Linux 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
es: NOMBRE
fr: NOM

source: ld.so, ld-linux.so - dynamic linker/loader
es: ld.so, ld-linux.so - enlazador/cargador dinámico
fr: ld.so, ld-linux.so – Chargeur et éditeur de liens dynamiques

source: SYNOPSIS
es: SINOPSIS

source: The dynamic linker can be run either indirectly by running some dynamically linked program or shared object (in which case no command-line options to the dynamic linker can be passed and, in the ELF case, the dynamic linker which is stored in the B<.interp> section of the program is executed) or directly by running:
es: El enlazador dinámico puede ejecutarse bien indirectamente, al ejecutar un programa o biblioteca enlazado dinámicamente (en cuyo caso no pueden pasarse opciones en la línea de órdenes al enlazador dinámico y, en el caso del formato ELF, se ejecuta el enlazador dinámico que se encuentra almacenado en la sección B<.interp> del programa), bien directamente ejecutando:
fr: L'éditeur de liens dynamiques peut être lancé indirectement en démarrant un programme lié dynamiquement ou un objet partagé (dans ce cas, aucune option en ligne de commande ne peut être transmise, et avec ELF, l'éditeur indiqué dans la section B<.interp> du programme est exécuté), ou directement en lançant\ :

source: I</lib/ld-linux.so.*> [OPTIONS] [PROGRAM [ARGUMENTS]]
es: I</lib/ld-linux.so.*> [OPCIONES] [PROGRAMA [ARGUMENTOS]]
fr: B</lib/ld-linux.so.*> [OPTIONS] [PROGRAMME [ARGUMENTS]]

source: DESCRIPTION
es: DESCRIPCIÓN

source: The programs B<ld.so> and B<ld-linux.so*> find and load the shared objects (shared libraries) needed by a program, prepare the program to run, and then run it.
es: Los programas B<ld.so> y B<ld-linux.so*> encuentran y cargan las bibliotecas compartidas requeridas por un programa, preparan al programa para ejecutarse y lo ejecutan.
fr: Les programmes B<ld.so> et B<ld-linux.so*> trouvent et chargent les objets partagés (bibliothèques partagées) nécessaires pour un programme, préparent son démarrage et le lancent.

source: Linux binaries require dynamic linking (linking at run time) unless the B<-static> option was given to B<ld>(1) during compilation.
es: Los ficheros binarios en Linux requieren enlace dinámico (enlace en tiempo de ejecución) a menos que se dé la opción B<- static> a B<ld>(1) durante la compilación.
fr: Les binaires Linux nécessitent une édition de liens dynamiques (au démarrage) sauf si l'option B<-static> a été indiquée sur la ligne de commande de B<ld>(1) durant la compilation.

source: The program B<ld.so> handles a.out binaries, a binary format used long ago. The program B<ld-linux.so*> (I</lib/ld-linux.so.1> for libc5, I</lib/ld-linux.so.2> for glibc2) handles binaries that are in the more modern ELF format. Both programs have the same behavior, and use the same support files and programs (B<ldd>(1), B<ldconfig>(8), and I</etc/ld.so.conf>).
es: El programa B<ld.so> maneja ficheros binarios con el formato a.out, un formato usado hace tiempo. El programa B<ld-linux.so*> maneja el formato ELF (B</lib/ld-linux.so.1> para libc5, B</lib/ld-linux.so.2> para glibc2), más moderno. Por lo demás, ambos tienen el mismo comportamiento y usan los mismos ficheros de configuración y programas (B<ldd>(1), B<ldconfig>(8) y I</etc/ld.so.conf>).
fr: Le programme B<ld.so> traite les binaires a.out, un format utilisé il y a bien longtemps. Le programme B<ld-linux.so*> (I</lib/ld-linux.so.1> pour libc5, I</lib/ld-linux.so.2> pour glibc2) traite les binaires qui sont au format ELF plus moderne. Les deux programmes ont le même comportement et utilisent les mêmes fichiers d’aide et mêmes programmes (B<ldd>(1), B<ldconfig>(8) et I</etc/ld.so.conf>).

source: When resolving shared object dependencies, the dynamic linker first inspects each dependency string to see if it contains a slash (this can occur if a shared object pathname containing slashes was specified at link time). If a slash is found, then the dependency string is interpreted as a (relative or absolute) pathname, and the shared object is loaded using that pathname.
es: Cuando se resuelven las dependencias de objetos compartidos, el enlazador dinámico empieza por comprobar cada dependencia para ver si contiene alguna barra (lo cual puede ocurrir si, al enlazar, definimos una ruta que contenía alguna). Si se encuentra una barra, la cadena se interpreta como un nombre de ruta (puede ser absoluto o relativo) y se cargará el objeto compartido con dicha ruta.
fr: Lors de la résolution des dépendances d’objets partagés, l'éditeur de liens dynamiques inspecte d'abord chaque chaîne de dépendance à la recherche d'une barre oblique (cela peut arriver si un chemin d’objet partagé contenant des barres obliques a été indiqué au moment de la liaison). Si une barre oblique est trouvée, alors la chaîne de dépendance est interprétée comme un chemin (relatif ou absolu) et l’objet partagé est chargé en utilisant ce chemin.

source: If a shared object dependency does not contain a slash, then it is searched for in the following order:
es: Si la dependencia del objeto compartido no contiene ninguna barra, ésta se buscara en este orden:
fr: Si une dépendance d’objet partagé ne contient pas de barre oblique, alors elle est recherchée dans l'ordre suivant :

source: Using the directories specified in the DT_RPATH dynamic section attribute of the binary if present and DT_RUNPATH attribute does not exist. Use of DT_RPATH is deprecated.
es: Usando el atributo dinámico de sección DT_RPATH del binario si está presente y el atributo DT_RUNPATH no existe. No se aconseja el uso de DT_RPATH.
fr: En utilisant les répertoires indiqués dans l'attribut de la section dynamique DT_RPATH du fichier binaire s'il est présent et si l'attribut DT_RUNPATH n'existe pas. L'utilisation de DT_RPATH est déconseillée.

source: Using the environment variable B<LD_LIBRARY_PATH>, unless the executable is being run in secure-execution mode (see below), in which case this variable is ignored.
es: Usando la variable de entorno B<LD_LIBRARY_PATH>, salvo cuando se ejecute en modo seguro, en cuyo caso la variable será ignorada.
fr: En utilisant la variable d'environnement B<LD_LIBRARY_PATH>, sauf si l’exécutable est utilisé dans le mode d’exécution sécurisée (consulter ci-dessous), auquel cas elle est ignorée.

source: Using the directories specified in the DT_RUNPATH dynamic section attribute of the binary if present. Such directories are searched only to find those objects required by DT_NEEDED (direct dependencies) entries and do not apply to those objects' children, which must themselves have their own DT_RUNPATH entries. This is unlike DT_RPATH, which is applied to searches for all children in the dependency tree.
es: Mediante los directorios definidos en el atributo de la sección dinámica de DT_RUNPATH del binario, si existe. Solo se buscará en estos directorios los objetos requeridos en las entradas de DT_NEEDED (dependencias directas) pero no en los descendientes de estos objetos. Éstos últimos deben tener su propia entrada DT_RUNPATH. Esto es distinto de DT_RPATH, que se usa para buscar a todos los descendientes en el árbol de dependencias.
fr: En utilisant les répertoires indiqués dans l’attribut de la section dynamique DT_RUNPATH du binaire s’il est présent. De tels répertoires sont recherchés uniquement pour trouver ces objets requis par les entrées DT_NEEDED (dépendances directes) et ne s’appliquent pas aux enfants des objets qui doivent eux-mêmes avoir leurs propres entrées DT_RUNPATH. Cela est différent de DT_RPATH, qui est appliqué aux recherches pour tous les enfants dans l’arbre de dépendances.

source: From the cache file I</etc/ld.so.cache>, which contains a compiled list of candidate shared objects previously found in the augmented library path. If, however, the binary was linked with the B<-z nodeflib> linker option, shared objects in the default paths are skipped. Shared objects installed in hardware capability directories (see below) are preferred to other shared objects.
es: A partir del fichero de caché I</etc/ld.so.cache>, que contiene una lista compilada de bibliotecas candidatas encontradas previamente en la ruta de bibliotecas ampliada. Sin embargo, si el binario fue enlazado con la opción B<-z nodeflib>, las bibliotecas que se encuentran en las rutas predeterminadas son omitidas. Se prefieren los objetos compartidos instalados en directorios de capacidades de hardware (vea más adelante) antes que los otros.
fr: Depuis le fichier cache I</etc/ld.so.cache>, qui contient une liste compilée des objets partagés candidats précédemment trouvés dans le chemin élargi de bibliothèque. Si toutefois le fichier binaire a été lié avec l'option B<-z nodeflib> de l'éditeur de liens, les objets partagés dans les chemins par défaut sont ignorés. Les objets partagés installés dans les répertoires de capacité matérielle (consulter ci-dessous) sont préférés aux autres objets partagés.

source: In the default path I</lib>, and then I</usr/lib>. (On some 64-bit architectures, the default paths for 64-bit shared objects are I</lib64>, and then I</usr/lib64>.) If the binary was linked with the B<-z nodeflib> linker option, this step is skipped.
es: En las rutas por defecto: I</lib> y I</usr/lib> (en algunas arquitecturas de 64 bits, las rutas por defecto para estos objetos compartidos son I</lib64> y I</usr/lib64>. Si el binario fue enlazado con la opción B<-z nodeflib>, se omite este paso.
fr: Dans le chemin par défaut I</lib>, puis I</usr/lib> (Sur certaines architectures 64 bits, les chemins par défaut pour les objets partagés 64 bits sont I</lib64> et puis I</usr/lib64>.) Si le binaire a été lié avec l'option B<-z\ nodeflib> de l'éditeur de liens, cette étape est sautée.

source: Dynamic string tokens
es: Token de cadena dinámica
fr: Mots-clés de chaîne dynamiques

source: In several places, the dynamic linker expands dynamic string tokens:
es: En varios lugares, el enlazador expandirá los tokens de cadena dinámica:
fr: Dans plusieurs emplacements, l’éditeur de liens dynamiques développe les mots-clés de chaîne dynamiques

source: In the environment variables B<LD_LIBRARY_PATH>, B<LD_PRELOAD>, and B<LD_AUDIT>,
es: En las variables de entorno B<LD_LIBRARY_PATH>, B<LD_PRELOAD> y B<LD_AUDIT>,
fr: dans les variables d’environnement B<LD_LIBRARY_PATH>, B<LD_PRELOAD> et B<LD_AUDIT> ;

source: inside the values of the dynamic section tags B<DT_NEEDED>, B<DT_RPATH>, B<DT_RUNPATH>, B<DT_AUDIT>, and B<DT_DEPAUDIT> of ELF binaries,
es: en los valores de las etiquetas de sección dinámica B<DT_NEEDED>, B<DT_RPATH>, B<DT_RUNPATH>, B<DT_AUDIT> y B<DT_DEPAUDIT>, también binarios ELF,
fr: dans les valeurs des mots-clés de la section dynamique B<DT_NEEDED>, B<DT_RPATH>, B<DT_RUNPATH>, B<DT_AUDIT> et B<DT_DEPAUDIT> des binaires ELF ;

source: in the arguments to the B<ld.so> command line options B<--audit>, B<--library-path>, and B<--preload> (see below), and
es: en varios argumentos de la orden B<ld.so>: B<--audit>, B<--library-path> y B<--preload>, por último
fr: dans les arguments des options de B<ld.so> dans la ligne de commande B<--audit>, B<--library-path> et B<--preload> (consulter ci-dessous) ;

source: in the filename arguments to the B<dlopen>(3) and B<dlmopen>(3) functions.
es: en el argumento del nombre de archivo de las funciones B<dlopen>(3) y B<dlmopen>(3).
fr: dans les arguments de nom de fichier pour les fonctions B<dlopen>(3) et B<dlmopen>(3).

source: The substituted tokens are as follows:
es: Los tokens sustituidos con como sigue:
fr: Les mots-clés substitués sont comme suit :

source: I<$ORIGIN> (or equivalently I<${ORIGIN}>)
es: I<$ORIGIN> (o el equivalente I<${ORIGIN}>)
fr: I<$ORIGIN> (ou de manière équivalente I<${ORIGIN}>)

source: This expands to the directory containing the program or shared object. Thus, an application located in I<somedir/app> could be compiled with
es: Esto se expandirá con el directorio que contiene el programa o los objetos compartidos. Por lo tanto, una aplicación que se encuentre en I</dir/app> se podría compilar con
fr: Cela développe le répertoire contenant le programme ou l’objet partagé. Ainsi, une application située dans I<un_répertoire/app> peut être compilée avec

source: so that it finds an associated shared object in I<somedir/lib> no matter where I<somedir> is located in the directory hierarchy. This facilitates the creation of "turn-key" applications that do not need to be installed into special directories, but can instead be unpacked into any directory and still find their own shared objects.
es: para que encuentre el objeto compartido en I<dir/lib> pudiendo el directorio I</dir> estar localizado en cualquier punto del árbol de directorios. Esto evita que las aplicaciones deban instalarse en un directorios concreto sino que podrán acceder a sus objetos compartidos desde cualquier directorio.
fr: de sorte qu'elle trouvera un objet partagé associé dans I<un_répertoire/lib> où que soit situé I<un_répertoire> dans la hiérarchie de répertoires. Cela facilite la création d'applications «\ prêtes à l'emploi\ » qui n'ont pas besoin d'être installées dans un répertoire particulier mais peuvent au contraire être installées dans n'importe quel répertoire et toujours trouver leurs propres objets partagés.

source: I<$LIB> (or equivalently I<${LIB}>)
es: I<$LIB> (o su equivalente I<${LIB}>)
fr: I<$LIB> (ou de manière équivalente I<${LIB}>)

source: This expands to I<lib> or I<lib64> depending on the architecture (e.g., on x86-64, it expands to I<lib64> and on x86-32, it expands to I<lib>).
es: Esto se interpretaría como I<lib> o I<lib64> según la arquitectura (lógicamente si es x86-64 lo hará a I<lib64> y si es x86-32 lo hará a I<lib>).
fr: Cela se développe en I<lib> ou I<lib64> en fonction de l'architecture (par exemple I<lib64> pour x86-64 ou I<lib> pour x86-32).

source: I<$PLATFORM> (or equivalently I<${PLATFORM}>)
es: I<$PLATFORM> (o su equivalente I<${PLATFORM}>)
fr: I<$PLATFORM> (ou de manière équivalente I<${PLATFORM}>)

source: This expands to a string corresponding to the processor type of the host system (e.g., "x86_64"). On some architectures, the Linux kernel doesn't provide a platform string to the dynamic linker. The value of this string is taken from the B<AT_PLATFORM> value in the auxiliary vector (see B<getauxval>(3)).
es: Esto se expandirá en una cadena de texto correspondiente al tipo de procesador del sistema (por ejemplo, "x86_64"). En algunas arquitecturas, el núcleo de Linux no proporciona una cadena de plataforma al enlazador dinámico. El valor de esta cadena se extrae de B<AT_PLATFORM> en el vector auxiliar (consulte B<getauxval> (3)).
fr: Cela se développe en une chaîne correspondant au type de processeur du système hôte (par exemple « x86_64 »). Pour certaines architectures, le noyau Linux ne fournit pas de chaîne de plateforme à l'éditeur de liens dynamiques. La valeur de cette chaîne est issue de la valeur B<AT_PLATFORM> du vecteur auxiliaire (consulter B<getauxval>(3)).

source: Note that the dynamic string tokens have to be quoted properly when set from a shell, to prevent their expansion as shell or environment variables.
es: Observe que los tokens de cadena dinámicas tienen que entrecomillarse correctamente cuando se definen a través de una shell para evitar que se interpreten como variables de entorno o de la propia shell.
fr: Remarquez que les mots-clés de chaîne dynamiques doivent être mis entre parenthèses correctement lorsqu’ils sont définis à partir de l’interpréteur de commandes pour prévenir de leur développement en tant que variables de l’interpréteur ou d’environnement.

source: OPTIONS
es: OPCIONES

source: B<--argv0> I<string> (since glibc 2.33)
es: B<--preload> I<list> (a partir de glibc 2.33)

source: Set I<argv[0]> to the value I<string> before running the program.
es: Define el valor I<string> para I<argv[0]> antes de ejecutar la aplicación.

source: B<--audit>I< list>
es: B<--audit>I< lista>
fr: B<--audit> I<liste>

source: Use objects named in I<list> as auditors. The objects in I<list> are delimited by colons.
es: Utilice los objetos nombrados en I<lista> como auditores. Los objetos en I<list> ese delimitan entre si por dos puntos.
fr: Utiliser les objets nommés dans I<liste> comme vérificateurs. Les objets sont délimités par des deux-points.

source: Do not use I</etc/ld.so.cache>.
es: No emplee I</etc/ld.so.cache>.
fr: Ne pas utiliser I</etc/ld.so.cache>.

source: B<--library-path>I< path>
es: B<--library-path>I< ruta>
fr: B<--library-path> I<chemin>

source: Use I<path> instead of B<LD_LIBRARY_PATH> environment variable setting (see below). The names I<ORIGIN>, I<LIB>, and I<PLATFORM> are interpreted as for the B<LD_LIBRARY_PATH> environment variable.
es: Emplee I<path> en lugar de la configuración de la variable de entorno B<LD_LIBRARY_PATH> (vea más adelante). Los nombres I<ORIGIN>, I<LIB> y I<PLATFORM> se entienden dirigidos a la variable B<LD_LIBRARY_PATH>.
fr: Utiliser I<chemin> au lieu du réglage de la variable d’environnement B<LD_LIBRARY_PATH> (consulter ci-dessous). Les noms I<ORIGIN>, I<LIB> et I<PLATFORM> sont interprétés comme pour la variable d’environnement B<LD_LIBRARY_PATH>.

source: B<--inhibit-rpath>I< list>
es: B<--inhibit-rpath>I< lista>
fr: B<--inhibit-rpath> I<liste>

source: Ignore RPATH and RUNPATH information in object names in I<list>. This option is ignored when running in secure-execution mode (see below). The objects in I<list> are delimited by colons or spaces.
es: Ignora la información de RPATH y RUNPATH en los nombres de objeto en I<list>. Esta opción se ignora si la ejecución se realiza en modo seguro (vea más adelante). Los objetos de la lista se separan mediante espacio o con dos puntos.
fr: Ignorer les informations de RPATH et RUNPATH dans les noms d’objet dans I<liste>. Cette option est ignorée dans le mode d’exécution sécurisée (voir ci-dessous). Les objets dans I<liste> sont séparés par des deux-points ou des espaces.

source: List all dependencies and how they are resolved.
es: Lista todas las dependencias y cómo se resuelven.
fr: Lister les dépendances et la manière de les résoudre.

source: B<--list-tunables> (since 2.33)
es: B<--list-tunables> (a para partir dee 2.33)

source: Print the names and values of all tunables, along with the minimum and maximum allowed values.
es: Muestra los nombres y los valores de todos los ajustables junto con el intervalo de valores permitidos.

source: B<--preload> I<list> (since glibc 2.30)
es: B<--preload> I<list> (a partir de glibc 2.30)
fr: B<--preload> I<liste> (depuis la glibc 2.30)

source: Preload the objects specified in I<list>. The objects in I<list> are delimited by colons or spaces. The objects are preloaded as explained in the description of the B<LD_PRELOAD> environment variable below.
es: Carga previamente los objetos especificados en I<list>, separados entre si por dos puntos o por espacios. Estos objetos se cargarán previamente tal como se explica más adelante en la descripción de la variable B<LD_PRELOAD>.
fr: Précharger les objets indiqués dans I<liste>. Ces objets sont délimités par des deux-points ou des espaces. Les objets sont préchargés comme c’est expliqué dans la description de la variable d’environnement B<LD_PRELOAD> ci-dessous.

source: By contrast with B<LD_PRELOAD>, the B<--preload> option provides a way to perform preloading for a single executable without affecting preloading performed in any child process that executes a new program.
es: Contrariamente al use de B<LD_PRELOAD>, la opción B<--preload> permite realizar una carga previa para un solo ejecutable sin afectar a las cargas de otras procesos hijos de éste que ejecuten un nuevo programa.
fr: Au contraire avec B<LD_PRELOAD>, l’option B<--preload> fournit une façon de réaliser le préchargement pour un exécutable unique sans affecter le préchargement réalisé par un processus enfant qui exécute un nouveau programme.

source: Verify that program is dynamically linked and this dynamic linker can handle it.
es: Comprueba que el programa está enlazado dinámicamente y que el enlazador dinámico puede tratarlo.
fr: Vérifier que le programme est lié dynamiquement et que l'éditeur de liens peut le traiter.

source: ENVIRONMENT
es: ENTORNO
fr: ENVIRONNEMENT

source: Various environment variables influence the operation of the dynamic linker.
es: Diversas variables de entorno influyen en el funcionamiento del enlazador.
fr: Diverses variables d’environnement influencent les opérations de l’éditeur de liens dynamiques.

source: Secure-execution mode
es: Modo de ejecución seguro
fr: Mode d’exécution sécurisée

source: For security reasons, if the dynamic linker determines that a binary should be run in secure-execution mode, the effects of some environment variables are voided or modified, and furthermore those environment variables are stripped from the environment, so that the program does not even see the definitions. Some of these environment variables affect the operation of the dynamic linker itself, and are described below. Other environment variables treated in this way include: B<GCONV_PATH>, B<GETCONF_DIR>, B<HOSTALIASES>, B<LOCALDOMAIN>, B<LOCPATH>, B<MALLOC_TRACE>, B<NIS_PATH>, B<NLSPATH>, B<RESOLV_HOST_CONF>, B<RES_OPTIONS>, B<TMPDIR>, and B<TZDIR>.
es: Por razones de seguridad, cuando el enlazador determina que un binario tiene que ejecutarse en modo seguro se modificará o anulará el efecto de algunas variables de entorno. Es más, estas variables se eliminan del entorno así que el programa ni siquiera las verá. A continuación, se describen algunas de estas variables que afectan a las operaciones del propio enlazador. Otras variables de entorno gestionadas de este modo incluyen: B<GCONV_PATH>, B<GETCONF_DIR>, B<HOSTALIASES>, B<LOCALDOMAIN>, B<LOCPATH>, B<MALLOC_TRACE>, B<NIS_PATH>, B<NLSPATH>, B<RESOLV_HOST_CONF>, B<RES_OPTIONS>, B<TMPDIR> y B<TZDIR>.
fr: Pour des raisons de sécurité, si l’éditeur de liens dynamiques détermine qu’un binaire devrait être exécuté dans un mode d’exécution sécurisée, les effets de quelques variables d’environnement sont annulés ou modifiés, et en outre ces variables d’environnement sont enlevées de l’environnement de telle façon que le programme ne puisse même pas voir les définitions. Certaines de ces variables d’environnement affectent les opérations de l’éditeur de liens dynamiques lui-même et sont décrites ci-dessous. Les autres variables d’environnement traitées de cette manière incluent B<GCONV_PATH>, B<GETCONF_DIR>, B<HOSTALIASES>, B<LOCALDOMAIN>, B<LOCPATH>, B<MALLOC_TRACE>, B<NIS_PATH>, B<NLSPATH>, B<RESOLV_HOST_CONF>, B<RES_OPTIONS>, B<TMPDIR> et B<TZDIR>.

source: A binary is executed in secure-execution mode if the B<AT_SECURE> entry in the auxiliary vector (see B<getauxval>(3)) has a nonzero value. This entry may have a nonzero value for various reasons, including:
es: Un binario se ejecuta en modo seguro si la entrada B<AT_SECURE> en el vector auxiliar (consulte B<getauxval> (3)) tiene un valor distinto de cero. Esta entrada puede tener un valor distinto de cero por varias razones:
fr: Un binaire est exécuté dans le mode d’exécution sécurisée si l’entrée B<AT_SECURE> dans le vecteur auxiliaire (consulter B<getauxval>(3)) à une valeur différente de zéro. Cette entrée peut avoir une valeur différente de zéro pour différentes raisons, dont :
