Repository: sebras/manpages-l10n
Catalog: po/*/man8/ld.so.8.po
Languages: es, fr

source: Since glibc 2.3.4, B<LD_DEBUG> is ignored in secure-execution mode, unless the file I</etc/suid-debug> exists (the content of the file is irrelevant).
es: Desde glibc 2.3.4, B<LD_DEBUG> se ignora en el modo de ejecución segura, salvo que exista el archivo I</etc/suid-debug> (el contenido del archivo es irrelevante).
fr: Depuis la glibc 2.3.4, B<LD_DEBUG> est ignorée dans le mode d’exécution sécurisée à moins que le fichier I</etc/suid-debug> existe (le contenu du fichier est non pertinent).

source: B<LD_DEBUG_OUTPUT> (since glibc 2.1)
es: B<LD_DEBUG_OUTPUT> (desde glibc 2.1)
fr: B<LD_DEBUG_OUTPUT> (depuis la glibc 2.1)

source: By default, B<LD_DEBUG> output is written to standard error. If B<LD_DEBUG_OUTPUT> is defined, then output is written to the pathname specified by its value, with the suffix "." (dot) followed by the process ID appended to the pathname.
es: Por defecto, la salida B<LD_DEBUG> se escribe a error estándar. Si se define B<LD_DEBUG_OUTPUT>, la salida se escribe en el nombre de ruta especificado por su valor, con el sufijo "." (punto) seguido del ID de proceso adjunto al nombre de la ruta.
fr: Par défaut, la sortie de B<LD_DEBUG> est écrite sur la sortie d’erreur standard. Si B<LD_DEBUG_OUTPUT> est définie, alors la sortie est écrite selon le chemin défini dans sa valeur avec le suffixe « . » (point) suivi par l’ID du processus ajouté au chemin.

source: B<LD_DEBUG_OUTPUT> is ignored in secure-execution mode.
es: B<LD_DEBUG_OUTPUT> se ignora en el modo de ejecución seguro.
fr: B<LD_DEBUG_OUTPUT> est ignorée dans le mode d’exécution sécurisée.

source: B<LD_DYNAMIC_WEAK> (since glibc 2.1.91)
es: B<LD_DYNAMIC_WEAK> (desde glibc 2.1.91)
fr: B<LD_DYNAMIC_WEAK> (depuis la glibc 2.1.91)

source: By default, when searching shared libraries to resolve a symbol reference, the dynamic linker will resolve to the first definition it finds.
es: Por defecto, cuando el enlazador busque una biblioteca compartida para encontrar algún símbolo, tomará la primera definición que encuentre.
fr: Par défaut, lors de la recherche de bibliothèques partagées pour résoudre une référence de symbole, l’éditeur de liens dynamiques résoudra la première définition qu’il trouvera.

source: Old glibc versions (before 2.2), provided a different behavior: if the linker found a symbol that was weak, it would remember that symbol and keep searching in the remaining shared libraries. If it subsequently found a strong definition of the same symbol, then it would instead use that definition. (If no further symbol was found, then the dynamic linker would use the weak symbol that it initially found.)
es: Las versiones de glibc anteriores a 2.2, lo hacían de otro modo: si el enlazador encontraba un símbolo débil, seguiría buscando hasta encontrar uno más fuerte en el resto de bibliotecas compartidas. Si encontrase uno más fuerte, lo usaría.En caso de no encontrar otro más fuerte, usaría la definición del débil.
fr: Les anciennes versions de la glibc (avant la version 2.2) procuraient un comportement différent. Si l’éditeur de liens trouvait un symbole faible, il se souvenait de ce symbole et continuait à chercher parmi les bibliothèques partagées restantes. S’il trouvait une définition forte du même symbole, il utilisait plutôt cette définition. (Si aucune n’était trouvée, alors l’éditeur de liens dynamiques utilisait le symbole faible précédemment trouvé.)

source: The old glibc behavior was nonstandard. (Standard practice is that the distinction between weak and strong symbols should have effect only at static link time.) In glibc 2.2, the dynamic linker was modified to provide the current behavior (which was the behavior that was provided by most other implementations at that time).
es: El antiguo comportamiento de glibc no era el estándar. (La práctica estandarizada es que la distinción entre símbolos débiles y fuertes debería tener efecto solo durante del enlazado estático). En glibc 2.2, el enlazador dinámico se modificó para tener el comportamiento actual, que era el comportamiento que ya proporcionaban la mayoría de las otras implementaciones.
fr: L’ancien comportement de la glibc n’était pas normalisé. (La pratique normalisée consiste à ce que la distinction entre les symboles faibles et forts intervient seulement au moment de la liaison statique.) Dans la glibc 2.2, l’éditeur de liens dynamiques a été modifié pour fournir le comportement actuel (qui était le comportement fourni par la plupart des autres implémentations à ce moment là).

source: Defining the B<LD_DYNAMIC_WEAK> environment variable (with any value) provides the old (nonstandard) glibc behavior, whereby a weak symbol in one shared library may be overridden by a strong symbol subsequently discovered in another shared library. (Note that even when this variable is set, a strong symbol in a shared library will not override a weak definition of the same symbol in the main program.)
es: Si se define la variable de entorno B<LD_DYNAMIC_WEAK> (con cualquier valor) se tendrá el antiguo comportamiento glibc (no estándar), mediante el cual un símbolo débil en una biblioteca compartida puede ser anulado por un símbolo fuerte posteriormente descubierto en otra biblioteca compartida. (Observe que incluso cuando se establece esta variable, un símbolo fuerte en una biblioteca compartida no anulará una definición débil del mismo símbolo en el programa principal).
fr: Définir la variable d’environnement B<LD_DYNAMIC_WEAK> (à n’importe quelle valeur) conduit à l’ancien comportement de la glibc non normalisé, selon lequel un symbole faible dans une bibliothèque partagée peut être écrasé par un symbole fort trouvé ultérieurement dans une autre bibliothèque partagée. Remarquez que même si cette variable est définie, un symbole fort dans une bibliothèque partagée n’écrasera pas une définition faible du même symbole dans le programme principal.)

source: Since glibc 2.3.4, B<LD_DYNAMIC_WEAK> is ignored in secure-execution mode.
es: A partir de glibc 2.3.4, B<LD_DYNAMIC_WEAK> se ignora en el modo de ejecución seguro.
fr: Depuis la glibc 2.3.4, B<LD_DYNAMIC_WEAK> est ignorée dans le mode d’exécution sécurisée.

source: B<LD_HWCAP_MASK> (since glibc 2.1)
es: B<LD_HWCAP_MASK> (desde glibc 2.1)
fr: B<LD_HWCAP_MASK> (depuis la glibc 2.1)

source: Mask for hardware capabilities.
es: Máscara para las capacidades hardware.
fr: Masque des capacités matérielles.

source: B<LD_ORIGIN_PATH> (since glibc 2.1)
es: B<LD_ORIGIN_PATH> (desde glibc 2.1)
fr: B<LD_ORIGIN_PATH> (depuis la glibc 2.1)

source: Path where the binary is found.
es: Ruta donde se encuentra el binario.
fr: Chemin où le binaire est trouvé.

source: Since glibc 2.4, B<LD_ORIGIN_PATH> is ignored in secure-execution mode.
es: A partir de glibc 2.4, B<LD_ORIGIN_PATH> se ignora en el modo de ejecución seguro.
fr: Depuis la glibc 2.4, B<LD_ORIGIN_PATH> est ignorée dans le mode d’exécution sécurisée.

source: B<LD_POINTER_GUARD> (glibc from 2.4 to 2.22)
es: B<LD_POINTER_GUARD> (glibc desde la versión 2.4 hasta la 2.22)
fr: B<LD_POINTER_GUARD> (dans la glibc depuis 2.4 jusqu’à 2.22)

source: Set to 0 to disable pointer guarding. Any other value enables pointer guarding, which is also the default. Pointer guarding is a security mechanism whereby some pointers to code stored in writable program memory (return addresses saved by B<setjmp>(3) or function pointers used by various glibc internals) are mangled semi-randomly to make it more difficult for an attacker to hijack the pointers for use in the event of a buffer overrun or stack-smashing attack. Since glibc 2.23, B<LD_POINTER_GUARD> can no longer be used to disable pointer guarding, which is now always enabled.
es: Definir a 0 para deshabilitar la protección del puntero. Cualquier otro valor habilita la protección del puntero (lo hará por defecto). La protección de punteros es un mecanismo de seguridad mediante el cual se alteran de forma semi-aleatoria el código almacenado en la memoria del programa grabable (devuelven direcciones guardads por B<setjmp>(3) o punteros de función utilizados por varios componentes internos de glibc) para dificultar que un atacante puede usarlos si se produce un desbordamiento de búfer o un ataque a la pila. Desde la versión 2.23 de glibc, B<LD_POINTER_GUARD> ya no se puede deshabilitar la protección de punteros.
fr: Mettre à zéro pour supprimer la protection sur les pointeurs. Toute autre valeur active cette protection, ce qui est le comportement par défaut. La protection sur les pointeurs est un mécanisme de sécurité où certains pointeurs vers du code stocké dans la zone mémoire accessible en écriture (comme les adresses de retour conservées par B<setjmp>(3), ou des pointeurs de fonctions utilisés par diverses fonctions internes de glibc) sont modifiés semi-aléatoirement pour rendre plus difficile une utilisation malveillante par un intrus, qui utiliserait par exemple un dépassement de tampon ou de la pile. Depuis la glibc 2.23, B<LD_POINTER_GUARD> ne peut plus être utilisée pour désactiver cette protection, qui est toujours activée.

source: B<LD_PROFILE> (since glibc 2.1)
es: B<LD_PROFILE> (a partir de glibc 2.1)
fr: B<LD_PROFILE> (depuis la glibc 2.1)

source: The name of a (single) shared object to be profiled, specified either as a pathname or a soname. Profiling output is appended to the file whose name is: "I<$LD_PROFILE_OUTPUT>/I<$LD_PROFILE>.profile".
es: El nombre de un objeto compartido (único) que se va a perfilar, especificado como nombre de ruta o como soname. La salida del perfilado se agrega al archivo cuyo nombre es: "I<$ LD_PROFILE_OUTPUT> / I<$ LD_PROFILE> .profile".
fr: Le nom d'un (seul) objet partagé à profiler, spécifié par un chemin ou par un I<soname>. Le résultat du profilage est écrit dans un fichier dont le nom est « I<$LD_PROFILE_OUTPUT>/I<$LD_PROFILE>.profile ».

source: Since glibc 2.2.5, B<LD_PROFILE> is ignored in secure-execution mode.
es: A partir de glibc 2.2.5, B<LD_PROFILE> se ignora en el modo de ejecución seguro.
fr: Depuis la glibc 2.2.5, B<LD_PROFILE> est ignorée dans le mode d’exécution sécurisée.

source: B<LD_PROFILE_OUTPUT> (since glibc 2.1)
es: B<LD_PROFILE_OUTPUT> (desde glibc 2.1)
fr: B<LD_PROFILE_OUTPUT> (depuis la glibc 2.1)

source: Directory where B<LD_PROFILE> output should be written. If this variable is not defined, or is defined as an empty string, then the default is I</var/tmp>.
es: Directorio donde se debe escribir la salida de B<LD_PROFILE>. Si esta variable no está definida, o está definida como una cadena vacía, se toma por defecto I</var/tmp>.
fr: Répertoire où sera écrit le résultat de B<LD_PROFILE>. Si cette variable n'est pas définie, ou si elle est définie à une valeur vide, le défaut est I</var/tmp>.

source: B<LD_PROFILE_OUTPUT> is ignored in secure-execution mode; instead I</var/profile> is always used. (This detail is relevant only before glibc 2.2.5, since in later glibc versions, B<LD_PROFILE> is also ignored in secure-execution mode.)
es: B<LD_PROFILE_OUTPUT> se ignora en el modo de ejecución segura; en su lugar, siempre se usa I</var/profile>. (Este detalle es relevante solo en versiones anteriores de glibc 2.2.5, en las posteriores, B<LD_PROFILE> también se ignora en el modo de ejecución segura).
fr: B<LD_PROFILE_OUTPUT> est ignorée dans le mode d’exécution sécurisée. À la place I</var/profile> est toujours utilisé. (Ce détail est pertinent seulement depuis la glibc 2.2.5, puisque dans les versions postérieures , B<LD_PROFILE> est aussi ignorée dans le mode d’exécution sécurisée.)

source: B<LD_SHOW_AUXV> (since glibc 2.1)
es: B<LD_SHOW_AUXV> (desde glibc 2.1)
fr: B<LD_SHOW_AUXV> (depuis la glibc 2.1)

source: If this environment variable is defined (with any value), show the auxiliary array passed up from the kernel (see also B<getauxval>(3)).
es: Si esta variable de entorno está definida (con cualquier valor), muestra la matriz auxiliar enviada desde el núcleo (vea también B<getauxval> (3)).
fr: Si cette variable d’environnement est définie (à n’importe quelle valeur), afficher le tableau auxiliaire transmis à partir du noyau (consulter aussi B<getauxval>(3)).

source: Since glibc 2.3.4, B<LD_SHOW_AUXV> is ignored in secure-execution mode.
es: A partir de glibc 2.3.4, B<LD_SHOW_AUXV> se ignora en el modo de ejecución seguro.
fr: Depuis la glibc 2.3.4, B<LD_SHOW_AUXV> est ignorée dans le mode d’exécution sécurisée.

source: B<LD_TRACE_PRELINKING> (since glibc 2.4)
es: B<LD_TRACE_PRELINKING> (desde glibc 2.4)
fr: B<LD_TRACE_PRELINKING> (depuis la glibc 2.4)

source: If this environment variable is defined, trace prelinking of the object whose name is assigned to this environment variable. (Use B<ldd>(1) to get a list of the objects that might be traced.) If the object name is not recognized, then all prelinking activity is traced.
es: Si se define esta variable de entorno, se hará un seguimiento de la vinculación previa del objeto cuyo nombre está asignado a esta variable de entorno. (Utilice B<ldd> (1) para ver los objetos que se pueden rastrear.) Si no se reconoce el nombre del objeto, se rastrea toda la actividad de preenlace.
fr: Si cette variable d’environnement est définie, tracer la pré-liaison de l’objet dont le nom est assigné à cette variable d’environnement. (Utiliser B<ldd>(1) pour obtenir une liste des objets pouvant être tracés.) Si le nom d’objet n’est pas reconnu, alors l’activité de pré-liaison est tracée.

source: B<LD_USE_LOAD_BIAS> (since glibc 2.3.3)
es: B<LD_USE_LOAD_BIAS> (a partir de glibc 2.3.3)
fr: B<LD_USE_LOAD_BIAS> (depuis la glibc 2.3.3)

source: By default (i.e., if this variable is not defined), executables and prelinked shared objects will honor base addresses of their dependent shared objects and (nonprelinked) position-independent executables (PIEs) and other shared objects will not honor them. If B<LD_USE_LOAD_BIAS> is defined with the value 1, both executables and PIEs will honor the base addresses. If B<LD_USE_LOAD_BIAS> is defined with the value 0, neither executables nor PIEs will honor the base addresses.
es: De forma predeterminada (es decir, si esta variable no está definida), los ejecutables y los objetos compartidos preenlazados respetarán las direcciones base de sus objetos compartidos dependientes, pero los ejecutables independientes de la posición (PIE) (no vinculados previamente) y otros objetos compartidos no los respetarán. Si B<LD_USE_LOAD_BIAS> se define con el valor 1, tanto los ejecutables como los PIE respetarán las direcciones base. Si B<LD_USE_LOAD_BIAS> se define con el valor 0, ni los ejecutables ni los PIE respetarán las direcciones base.
fr: Par défaut, c'est-à-dire si cette variable n'est pas définie, les exécutables et les objets partagés pré-liés (I<prelink>) respectent les adresses de base des objets partagés dont ils dépendent, alors que les exécutables PIE (I<position-independent executables>) non pré-liés et les autres objets partagés ne les respectent pas. Si B<LD_USE_LOAD_BIAS> est définie à la valeur B<1>, les exécutables et les PIE vont respecter les adresses de base. Si B<LD_USE_LOAD_BIAS> est définie à B<0>, ni les exécutables, ni les PIE ne respecteront les adresses de base.

source: Since glibc 2.3.3, this variable is ignored in secure-execution mode.
es: A partir de glibc 2.3.3 se ignora esta variable en el modo de ejecución seguro.
fr: Depuis la glibc 2.3.3, cette variable est ignorée dans le mode d’exécution sécurisée.

source: B<LD_VERBOSE> (since glibc 2.1)
es: B<LD_VERBOSE> (a partir de glibc 2.1)
fr: B<LD_VERBOSE> (depuis la glibc 2.1)

source: If set to a nonempty string, output symbol versioning information about the program if the B<LD_TRACE_LOADED_OBJECTS> environment variable has been set.
es: Si se le asigna un valor de una cadena no vacía y si se ha establecido la variable de entorno B<LD_TRACE_LOADED_OBJECTS>, se generará información sobre la versión del símbolo sobre el programa.
fr: S'il s'agit d'une chaîne non vide, afficher les informations sur la version des symboles du programme si la variable d'environnement B<LD_TRACE_LOADED_OBJECTS> a été définie.

source: B<LD_WARN> (since glibc 2.1.3)
es: B<LD_WARN> (desde glibc 2.1.3)
fr: B<LD_WARN> (depuis la glibc 2.1.3)

source: If set to a nonempty string, warn about unresolved symbols.
es: Si se le asigna como valor una cadena no nula, avisará si detecta símbolos no resueltos.
fr: Si la chaîne est non vide, avertir si un symbole n'est pas résolu.

source: B<LD_PREFER_MAP_32BIT_EXEC> (x86-64 only; since glibc 2.23)
es: B<LD_PREFER_MAP_32BIT_EXEC> (solo en x86-64 y desde glibc 2.23)
fr: B<LD_PREFER_MAP_32BIT_EXEC> (x86-64 seulement ; depuis la glibc 2.23)

source: According to the Intel Silvermont software optimization guide, for 64-bit applications, branch prediction performance can be negatively impacted when the target of a branch is more than 4\ GB away from the branch. If this environment variable is set (to any value), the dynamic linker will first try to map executable pages using the B<mmap>(2) B<MAP_32BIT> flag, and fall back to mapping without that flag if that attempt fails. NB: MAP_32BIT will map to the low 2\ GB (not 4\ GB) of the address space.
es: Según la guía de optimización del software Intel Silvermont, para las aplicaciones de 64 bits, el rendimiento de la predicción de ramas puede verse afectado negativamente cuando el objetivo de una rama está a más de 4 GB de distancia de ella. Si esta variable de entorno está configurada (con cualquier valor), el enlazador dinámico primero intentará mapear páginas ejecutables usando B<mmap> (2) B<MAP_32BIT> y volverá a mapear si ese intento falla. NB: MAP_32BIT se asignará a los 2 GB (no 4 GB) del espacio de direcciones.
fr: Selon le guide d’optimisation logicielle de Silvermont d’Intel, pour les applications 64 bits, les performances de prédiction de branchement peuvent être détériorées quand la cible d’un branchement est située à plus de 4\ GB du branchement. Si cette variable d’environnement est définie (à n’importe quelle valeur), l’éditeur de liens dynamiques essaie de mapper les pages d’exécutables en utilisant l’indicateur B<MAP_32BIT> de B<mmap>(2) et de revenir à un mappage sans cet indicateur si cet essai échoue. NB : MAP_32BIT mappera avec les 2\ GB bas (pas 4\ GB) de l’espace d’adressage.

source: Because B<MAP_32BIT> reduces the address range available for address space layout randomization (ASLR), B<LD_PREFER_MAP_32BIT_EXEC> is always disabled in secure-execution mode.
es: Debido a que B<MAP_32BIT> reduce el rango de direcciones disponible para que el diseño del espacio de direcciones sea aleatorio (ASLR), B<LD_PREFER_MAP_32BIT_EXEC> siempre está deshabilitado en el modo de ejecución segura.
fr: Parce que B<MAP_32BIT> réduit l’éventail d’adressage pour la distribution aléatoire de l’espace d’adressage (ASLR), B<LD_PREFER_MAP_32BIT_EXEC> est toujours désactivée dans le mode d’exécution sécurisée.

source: FILES
es: ARCHIVOS
fr: FICHIERS

source: a.out dynamic linker/loader
es: enlazador/cargador dinmico
fr: Le chargeur et éditeur de liens dynamiques a.out.

source: ELF dynamic linker/loader
es: Enlazador/cargador dinámico ELF
fr: Le chargeur et éditeur de liens dynamiques ELF.

source: File containing a compiled list of directories in which to search for shared objects and an ordered list of candidate shared objects. See B<ldconfig>(8).
es: Archivo que contiene una lista de directorios donde encontrar objetos compartidos y una lista ordenada de los candidatos. Consulte B<ldconfig>(8).
fr: Fichier contenant la liste compilée des répertoires dans lesquels rechercher les objets partagés et une liste d’objets partagés candidats. Consulter B<ldconfig>(8).

source: File containing a whitespace-separated list of ELF shared objects to be loaded before the program. See the discussion of B<LD_PRELOAD> above. If both B<LD_PRELOAD> and I</etc/ld.so.preload> are employed, the libraries specified by B<LD_PRELOAD> are preloaded first. I</etc/ld.so.preload> has a system-wide effect, causing the specified libraries to be preloaded for all programs that are executed on the system. (This is usually undesirable, and is typically employed only as an emergency remedy, for example, as a temporary workaround to a library misconfiguration issue.)
es: Archivo que contiene una lista de objetos compartidos ELF separados entre si por espacios en blanco que se cargarán antes del programa. Vea el apartado anterior B<LD_PRELOAD>. Si se emplean tanto B<LD_PRELOAD> como I</etc/ld.so.preload>, las bibliotecas especificadas por B<LD_PRELOAD> se precargan primero. I</etc/ld.so.preload> tiene efecto en todo el sistema, lo que hace que las bibliotecas especificadas se carguen previamente para todos los programas que se ejecutan en el sistema. (En general, no suele ser una opción ideal y por lo tanto, solo se emplea como una solución de emergencia, por ejemplo, como una solución temporal para un problema de configuración incorrecta de la biblioteca).
fr: Fichier contenant une liste d’objets partagés ELF, séparés par des virgules, à charger avant le programme. Consultez le point à propos de B<LD_PRELOAD> ci-dessus. Si B<LD_PRELOAD> et I</etc/ld.so.preload> sont employés, la bibliothèque indiquée par B<LD_PRELOAD> est préchargée en premier. I</etc/ld.so.preload> a un effet sur tout le système, faisant que les bibliothèques indiquées sont préchargées pour tous les programmes exécutés sur le système. (Cela est habituellement indésirable et employé uniquement comme remède d’urgence, par exemple, comme contournement temporaire d’un problème de mauvaise configuration de bibliothèque.)

source: shared objects
es: objetos compartidos
fr: Objets partagés.

source: NOTES
es: NOTAS

source: Hardware capabilities
es: Capacidades de hardware
fr: Capacités matérielles

source: Some shared objects are compiled using hardware-specific instructions which do not exist on every CPU. Such objects should be installed in directories whose names define the required hardware capabilities, such as I</usr/lib/sse2/>. The dynamic linker checks these directories against the hardware of the machine and selects the most suitable version of a given shared object. Hardware capability directories can be cascaded to combine CPU features. The list of supported hardware capability names depends on the CPU. The following names are currently recognized:
es: Algunos objetos compartidos se compilan utilizando instrucciones específicas de hardware que no existen en todas las CPU. Estos objetos deben instalarse en directorios cuyos nombres definan las capacidades de hardware necesarias, como I</usr /lib/sse2/>. El enlazador dinámico compara estos directorios con el hardware de la máquina y selecciona la versión más adecuada de un objeto compartido dado. Los directorios de capacidad de hardware se pueden conectar en cascada para combinar funciones de CPU. La lista de nombres de capacidad de hardware admitidos depende de la CPU. Actualmente se reconocen los siguientes:
fr: Certains objets partagés sont compilés en utilisant des instructions spécifiques au matériel qui n'existent pas sur tous les processeurs. Ces objets devraient être installés dans des répertoires dont les noms définissent les capacités matérielles nécessaires, comme I</usr/lib/sse2/>. L'éditeur de liens dynamiques compare ces répertoires au matériel de la machine et sélectionne la version la mieux adaptée pour un objet partagé donné. Les répertoires de capacité matérielle peuvent être imbriqués pour combiner les caractéristiques du microprocesseur. La liste des noms de capacité matérielle pris en charge dépend du microprocesseur. Les noms suivants sont reconnus pour le moment.

source: B<x86 (32-bit only)>
es: B<x86 (solo 32-bit)>
fr: B<x86 (32 bits seulement)>

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI

source: Linux Programmer's Manual
es: Manual del Programador de Linux
fr: Manuel du programmeur Linux
