Repository: sebras/manpages-l10n
Catalog: po/*/man8/ld.so.8.po
Languages: es, fr

source: The process's real and effective user IDs differ, or the real and effective group IDs differ. This typically occurs as a result of executing a set-user-ID or set-group-ID program.
es: Si difieren las ID de usuario reales y efectivas del proceso o las ID de grupo reales y efectivas. Esto suele ocurrir como resultado de la ejecución de una apliación con los bits activados de set-user-ID or set-group-ID.
fr: Les ID utilisateur réels et effectifs du processus diffèrent ou les ID de groupe réels et effectifs diffèrent. Cela se produit classiquement lors de l’exécution d’un programme set-user-ID ou set-group-ID ;

source: A process with a non-root user ID executed a binary that conferred capabilities to the process.
es: Un proceso ejecutado por un usuario distinto al administrador ejecuta un binario que confiere alguna capacidad al mismo.
fr: Un processus avec un ID utilisateur non superutilisateur a exécuté un binaire qui conférait des capacités au processus ;

source: A nonzero value may have been set by a Linux Security Module.
es: Es posible que un módulo de seguridad de Linux haya definido un valor distinto de cero.
fr: Une valeur différente de zéro pouvait avoir été réglée par un module de sécurité de Linux.

source: Environment variables
es: Variables de entorno
fr: Variables d'environnement

source: Among the more important environment variables are the following:
es: Las variables de entorno más relevantes son las siguientes:
fr: Parmi les variables d'environnement importantes, on trouve :

source: B<LD_ASSUME_KERNEL> (since glibc 2.2.3)
es: B<LD_ASSUME_KERNEL> (a partir de glibc 2.2.3)
fr: B<LD_ASSUME_KERNEL> (depuis la glibc 2.2.3)

source: Each shared object can inform the dynamic linker of the minimum kernel ABI version that it requires. (This requirement is encoded in an ELF note section that is viewable via I<readelf\~-n> as a section labeled B<NT_GNU_ABI_TAG>.) At run time, the dynamic linker determines the ABI version of the running kernel and will reject loading shared objects that specify minimum ABI versions that exceed that ABI version.
es: Cada objeto compartido puede informar al enlazador dinámico de la versión mínima de ABI del núcleo requierida. (Este requisito está codificado en una sección de notas ELF que se puede ver ejecutando I<readelf \ -n> marcado como B<NT_GNU_ABI_TAG>). Durante la ejecución, el enlazador dinámico determina la versión ABI del núcleo que se está ejecutando y rechazará cargar objetos compartidos que necesiten una versión de ABI superior.

source: B<LD_ASSUME_KERNEL> can be used to cause the dynamic linker to assume that it is running on a system with a different kernel ABI version. For example, the following command line causes the dynamic linker to assume it is running on Linux 2.2.5 when loading the shared objects required by I<myprog>:
es: B<LD_ASSUME_KERNEL> puede usarse para hacer que el enlazador dinámico asuma que se está ejecutando en un sistema con una versión de ABI de núcleo diferente. Por ejemplo, la siguiente orden hace que el enlazador dinámico asuma que se está ejecutando en Linux 2.2.5 al cargar los objetos compartidos requeridos por I<myprog>:
fr: B<LD_ASSUME_KERNEL> peut être utilisé afin que l'éditeur de liens dynamiques considère qu'il est exécuté sur un système disposant d'une version différente de l'ABI du noyau. Par exemple, la commande suivante permet de considérer la version 2.2.5 du noyau Linux lors du chargement des objets partagés utilisés par I<monprogamme>:

source: On systems that provide multiple versions of a shared object (in different directories in the search path) that have different minimum kernel ABI version requirements, B<LD_ASSUME_KERNEL> can be used to select the version of the object that is used (dependent on the directory search order).
es: En sistemas que proporcionan múltiples versiones de un objeto compartido (en diferentes directorios en la ruta de búsqueda) que tienen diferentes requisitos mínimos de versión de ABI del kernel, se puede usar B<LD_ASSUME_KERNEL> para seleccionar la versión del objeto que se usa (dependiendo del orden de búsqueda del directorio).
fr: Lorsque plusieurs versions d’un même objet partagé (dans des répertoires différents du chemin de recherche) spécifient des versions minimales d'ABI du noyau différentes, B<LD_ASSUME_KERNEL> permet de sélectionner la version de l’objet à utiliser (ce qui dépend de l'ordre de recherche des répertoires).

source: Historically, the most common use of the B<LD_ASSUME_KERNEL> feature was to manually select the older LinuxThreads POSIX threads implementation on systems that provided both LinuxThreads and NPTL (which latter was typically the default on such systems); see B<pthreads>(7).
es: Históricamente, el uso más común de la función B<LD_ASSUME_KERNEL> era seleccionar manualmente los antiguos subprocesos POSIX de LinuxThreads en sistemas que proporcionaban tanto LinuxThreads como NPTL (que normalmente era el predeterminado); consulte B<pthreads> (7).
fr: Historiquement, B<LD_ASSUME_KERNEL> était surtout utilisée pour sélectionner l'ancienne mise en œuvre des threads POSIX par LinuxThreads sur les systèmes fournissant LinuxThreads et NPTL (ce dernier étant généralement activé par défaut) ; consulter B<pthreads>(7).

source: B<LD_BIND_NOW> (since glibc 2.1.1)
es: B<LD_BIND_NOW> (desde glibc 2.1.1)
fr: B<LD_BIND_NOW> (depuis la glibc 2.1.1)

source: If set to a nonempty string, causes the dynamic linker to resolve all symbols at program startup instead of deferring function call resolution to the point when they are first referenced. This is useful when using a debugger.
es: Si su valor es distinto de cero, hará que el enlazador dinámico resuelva todos los símbolos al iniciarse el programa en lugar de hacerlo la primera vez que se hace referencia a ellos. Esto es especialmente útil cuando estamos usando un depurador.
fr: Si la chaîne est non vide, l'éditeur de liens résoudra tous les symboles au démarrage du programme plutôt que repousser la résolution des noms de fonctions au moment où elles sont référencées en premier. Cela est utile dans un débogueur.

source: A list of directories in which to search for ELF libraries at execution time. The items in the list are separated by either colons or semicolons, and there is no support for escaping either separator. A zero-length directory name indicates the current working directory.
es: Lista de directorios donde encontrar librerías ELF durante la ejecución. Los componentes de la lista estarán separados entre si o bien por punto y coma o bien por dos puntos no siendo posible usar una secuencia de escape para ninguno de ellos. Si la longitud del nombre del directorio es cero, se entenderá el directorio actual.
fr: Une liste de répertoires dans lesquels chercher les bibliothèques ELF au moment de l’exécution. Les éléments de la liste sont séparés par des deux-points ou des points-virgules et il n’existe aussi aucune protection des séparateurs. Un nom de répertoire de longueur nulle indique le répertoire de travail en cours.

source: This variable is ignored in secure-execution mode.
es: Esta variable se ignora en el modo de ejecución seguro.
fr: Cette variable est ignorée dans le mode d’exécution sécurisée.

source: Within the pathnames specified in B<LD_LIBRARY_PATH>, the dynamic linker expands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Dynamic string tokens>. Thus, for example, the following would cause a library to be searched for in either the I<lib> or I<lib64> subdirectory below the directory containing the program to be executed:
es: Dentro de los nombres de ruta especificados en B<LD_LIBRARY_PATH>, el enlazador dinámico expande los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o las versiones que usan llaves alrededor de los nombres) como se ha descrito anteriormente en I<Tokens de cadena dinámica>. Por ejemplo, para buscar una biblioteca en el subdirectorio I<lib> o I<lib64> dentro del directorio que contiene el programa a ejecutar:
fr: À l’intérieur des noms de chemin indiqués dans B<LD_LIBRARY_PATH>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Mots-clés de chaine dynamiques>. Par conséquent, par exemple, ce qui suit provoquera la recherche d’une bibliothèque dans les sous-répertoires I<lib> ou I<lib64> en dessous du répertoire contenant le programme à exécuter :

source: (Note the use of single quotes, which prevent expansion of I<$ORIGIN> and I<$LIB> as shell variables!)
es: (Observe el uso de comillas simples para evitar que la shell interprete I<$ORIGIN> y I<$LIB> como variables)
fr: Remarquez l’utilisation de guillemets simples empêchant le développement de I<$ORIGIN> et I<$LIB> en tant que variables d’interpréteur.

source: A list of additional, user-specified, ELF shared objects to be loaded before all others. This feature can be used to selectively override functions in other shared objects.
es: Una lista con una serie adicional, especificados por el usuario, de objetos compartidos ELF para ser cargados antes que todos los demás. Esto puede usarse para anular en casos concretos algunas funciones en otros objetos compartidos.
fr: Une liste complémentaire, spécifiée par l’utilisateur, d’objets partagés ELF à charger avant tous les autres objets. Cela permet de surcharger sélectivement les fonctions dans les autres objets partagés.

source: The items of the list can be separated by spaces or colons, and there is no support for escaping either separator. The objects are searched for using the rules given under DESCRIPTION. Objects are searched for and added to the link map in the left-to-right order specified in the list.
es: Los componentes de esta lista puede separarse entre si mediante dos puntos o mediante punto y coma. No existe una secuencia de escape para estos dos caracteres. Se buscan los objetos empleando la regla definida en DESCRIPTION, se van añadiendo al mapa de enlaces de izquierda a derecha según se especifica en la lista.
fr: Les éléments de la liste peuvent être séparés par des deux-points ou des espaces et il n’existe aussi aucune protection des séparateurs. Les objets sont recherchés en utilisant les règles précisées dans DESCRIPTION et sont ajoutés dans le mappage de liens dans l’ordre de droite à gauche indiqué dans la liste.

source: In secure-execution mode, preload pathnames containing slashes are ignored. Furthermore, shared objects are preloaded only from the standard search directories and only if they have set-user-ID mode bit enabled (which is not typical).
es: En el modo de ejecución seguro, se ignoran los nombres de ruta de precarga si contienen barras. Además, los objetos compartidos se precargan solo desde los directorios de búsqueda estándar y solo si tienen habilitado el bit set-user-ID (lo cual no es habitual).
fr: Dans le mode d’exécution sécurisée, le préchargement de noms de chemin contenant des barres obliques est ignoré. Par ailleurs, les objets partagés sont préchargés seulement à partir des répertoires de recherche standard et seulement si le bit de mode set-user-ID est activé (ce qui n’est pas habituel).

source: Within the names specified in the B<LD_PRELOAD> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Dynamic string tokens>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
es: Dentro de los nombres especificados en la lista B<LD_PRELOAD>, el enlazador dinámico interpreta los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o los equivalente con llaves alrededor de los nombres) como se ha descrito anteriormente en I<tokens de cadena dinámica>. (Véase también la explicación sobre el entrecomillado en el apartado B<LD_LIBRARY_PATH>.)
fr: À l’intérieur des noms indiqués dans B<LD_PRELOAD>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Mots-clés de chaine dynamiques>. (Voir aussi le point sur la mise entre parenthèses dans la description de B<LD_LIBRARY_PATH>.)

source: There are various methods of specifying libraries to be preloaded, and these are handled in the following order:
es: Existen varias formas de indicar las bibliotecas que se deben precargar, siguiendo este orden:
fr: Il existe diverses méthodes pour préciser les bibliothèques à précharger, et celles-ci sont gérées dans l’ordre suivant :

source: The B<LD_PRELOAD> environment variable.
es: La variable de entorno B<LD_PRELOAD>.
fr: La variable d’environnement B<LD_PRELOAD>.

source: The B<--preload> command-line option when invoking the dynamic linker directly.
es: Indicar en la línea de órdenes la opción B<--preload> cuando se ejecute directamente el enlazador dinámico.
fr: L’option B<--preload> de ligne de commande lors de l’invocation directe de l’éditeur de liens dynamiques.

source: The I</etc/ld.so.preload> file (described below).
es: Desde el archivo I</etc/ld.so.preload> (explicado más adelante).
fr: Le fichier I</etc/ld.so.preload> (décrit ci-dessous).

source: If set (to any value), causes the program to list its dynamic dependencies, as if run by B<ldd>(1), instead of running normally.
es: Si está definido (cualquiera que sea su valor) hará que el programa liste sus dependencias como si fuese ejecutado por B<ldd>(1) en lugar de directamente.
fr: Si la chaîne est non vide, le programme liste ses dépendances dynamiques comme s'il était lancé par B<ldd>(1), au lieu du lancement normal.

source: Then there are lots of more or less obscure variables, many obsolete or only for internal use.
es: Hay muchas más variables más o menos crípticas, muchas de ellas anticuadas o para uso interno.
fr: Il existe de nombreuses autres variables plus ou moins obscures, certaines obsolètes ou réservées pour un usage interne.

source: B<LD_AUDIT> (since glibc 2.4)
es: B<LD_AUDIT> (desde glibc 2.4)
fr: B<LD_AUDIT> (depuis la glibc 2.4)

source: A list of user-specified, ELF shared objects to be loaded before all others in a separate linker namespace (i.e., one that does not intrude upon the normal symbol bindings that would occur in the process) These objects can be used to audit the operation of the dynamic linker. The items in the list are colon-separated, and there is no support for escaping the separator.
es: Una lista de objetos compartidos ELF especificados por el usuario que se cargarán antes que todos los demás en un espacio de nombres de enlazador separado (es decir, uno que no interfiera en el enlazado de símbolos del proceso) Estos objetos se pueden usar para auditar la operación del enlazador dinámico. Los elementos de la lista están separados entre si por dos puntos y no existe ninguna secuencia de escape para este separador.
fr: Une liste d'objets partagés ELF spécifiés par l'utilisateur à charger avant tous les autres à l'intérieur d'un espace distinct de nommage de l'éditeur de liens (c'est-à-dire qu'il n'y aura pas d'interférence avec les liaisons sur les symboles normaux qui auront lieu pendant le processus). Ces objets peuvent être utilisés pour contrôler les opérations effectuées par l'éditeur de liens dynamiques. Les éléments de la liste sont séparés par des deux-points et il n’existe aucune protection des séparateurs.

source: B<LD_AUDIT> is ignored in secure-execution mode.
es: Se ignora B<LD_AUDIT> en el modo de ejecución seguro.
fr: B<LD_AUDIT> est ignorée dans le mode d’exécution sécurisée.

source: The dynamic linker will notify the audit shared objects at so-called auditing checkpoints\(emfor example, loading a new shared object, resolving a symbol, or calling a symbol from another shared object\(emby calling an appropriate function within the audit shared object. For details, see B<rtld-audit>(7). The auditing interface is largely compatible with that provided on Solaris, as described in its I<Linker and Libraries Guide>, in the chapter I<Runtime Linker Auditing Interface>.
es: El enlazador dinámico notificará a los objetos compartidos de auditoría en los llamados puntos de control de auditoría, por ejemplo, cargando un nuevo objeto compartido, resolviendo un símbolo o llamando a un símbolo de otro objeto compartido (llamando a una función apropiada dentro del objeto compartido de auditoría). Para obtener más información, consulte B<rtld-audit> (7) La interfaz de auditoría es en gran medida compatible con la proporcionada en Solaris, como se describe en su I<Linker and Libraries Guide>, en el capítulo I<Runtime Linker Auditing Interface>.
fr: L'éditeur de liens dynamiques notifiera les objets partagés de contrôle aux endroits précis de contrôle (par exemple au chargement d'un nouvel objet partagé, à la résolution d'un symbole, à l'appel d'un symbole depuis un autre objet partagé \(em en appelant la fonction adéquate dans l’objet partagé de contrôle. Pour des informations plus détaillées, consultez B<rtld-audit>(7). L'interface de contrôle est largement compatible avec celle disponible sur Solaris, décrite dans le I<Linker and Libraries Guide>, au chapitre I<Runtime Linker Auditing Interface>.

source: Within the names specified in the B<LD_AUDIT> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Dynamic string tokens>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
es: Dentro de los nombres especificados en la lista B<LD_AUDIT>, el enlazador dinámico interpreta los tokens I<$ ORIGIN>, I<$ LIB> e I<$ PLATFORM> (o los equivalentes con llaves alrededor de los nombres) como se ha descrito anteriormente en I<tokens de cadena dinámica>. (Véase también la explicación del entrecomillado en el apartado B<LD_LIBRARY_PATH>.)
fr: À l’intérieur des noms indiqués dans B<LD_AUDIT>, l’éditeur de liens dynamiques développe les mots-clés I<$ORIGIN>, I<$LIB> et I<$PLATFORM> (ou les versions utilisant des accolades autour des noms) comme cela est décrit ci-dessus dans I<Mots-clés de chaine dynamiques>. (Voir aussi le point sur la mise entre parenthèses dans la description de B<LD_LIBRARY_PATH>.)

source: Since glibc 2.13, in secure-execution mode, names in the audit list that contain slashes are ignored, and only shared objects in the standard search directories that have the set-user-ID mode bit enabled are loaded.
es: A partir de la versión 2.13 de glibc, en el modo de ejecución segura, los nombres de la lista de auditoría que contienen barras se ignoran y solo se cargan los objetos compartidos en los directorios de búsqueda estándar que tienen habilitado el bit set-user-ID.
fr: Depuis la glibc 2.13, dans le mode d’exécution sécurisée, les noms dans la liste de contrôle contenant des barres obliques sont ignorés et seulement les objets partagés des répertoires de recherche standard ayant le bit de mode set-user-ID activé sont chargés.

source: B<LD_BIND_NOT> (since glibc 2.1.95)
es: B<LD_BIND_NOT> (a partir de glibc 2.1.95)
fr: B<LD_BIND_NOT> (depuis la glibc 2.1.95)

source: If this environment variable is set to a nonempty string, do not update the GOT (global offset table) and PLT (procedure linkage table) after resolving a function symbol. By combining the use of this variable with B<LD_DEBUG> (with the categories I<bindings> and I<symbols>), one can observe all run-time function bindings.
es: Si esta variable de entorno se establece en una cadena no vacía, no actualiza GOT (tabla de compensación global) y PLT (tabla de vinculación de procedimientos) después de resolver un símbolo de función. Si con el uso de esta variable, añadimos B<LD_DEBUG> (con las categorías I<bindings> y I<symbols>), se pueden observar todos los enlaces de funciones en tiempo de ejecución.
fr: Si cette variable d’environnement est réglée à une valeur non vide, ne pas mettre à jour les tables GOT (global offset table) et PLT (procedure linkage table) après la résolution d’un symbole de fonction. En combinant l’utilisation de cette variable avec B<LD_DEBUG> (avec les catégories I<bindings> et I<symbols>), les liaisons de fonctions d’exécution peuvent être observées.

source: B<LD_DEBUG> (since glibc 2.1)
es: B<LD_DEBUG> (desde glibc 2.1)
fr: B<LD_DEBUG> (depuis la glibc 2.1)

source: Output verbose debugging information about operation of the dynamic linker. The content of this variable is one of more of the following categories, separated by colons, commas, or (if the value is quoted) spaces:
es: Muestra información detallada de depuración sobre el funcionamiento del enlazador dinámico. El contenido de esta variable es una o más de las siguientes categorías, separadas por dos puntos, comas o (si se entrecomilla el valor) espacios:
fr: Produire une information détaillée de débogage dans l’éditeur de liens dynamiques. Le contenu de cette variable est composée d’une ou de plusieurs des catégories suivantes, séparées par des deux-points, des virgules ou (si la valeur est entre guillemets) par des espaces :

source: Specifying I<help> in the value of this variable does not run the specified program, and displays a help message about which categories can be specified in this environment variable.
es: Si asignamos el valor I<help> a esta variable, no se ejecutará el programa y se mostrará un mensaje de ayuda informando acerca de las categorías que se pueden definir en esta variable de entorno.
fr: Indiquer I<help> dans la valeur de cette variable fait que le programme n’est pas exécuté et qu’un message est affiché sur les catégories pouvant être indiquées dans cette variable d’environnement.

source: Print all debugging information (except I<statistics> and I<unused>; see below).
es: Imprime información para la depuración (salvo I<statistics> ni I<unused>; vea a continuación.
fr: Afficher toutes les informations de débogage (exceptées I<statistics> et I<unused> ; consulter ci-dessous).

source: Display information about which definition each symbol is bound to.
es: Muestra información sobre la definición a la que está vinculado cada símbolo.
fr: Afficher des informations sur la définition à laquelle chaque symbole est lié.

source: Display progress for input file.
es: Muestra el progreso del archivo de entrada.
fr: Afficher l’avancement pour le fichier d’entrée.

source: Display library search paths.
es: Muestra las rutas de búsqueda de las librerias.
fr: Afficher les chemins de recherche de bibliothèque.

source: Display relocation processing.
es: Muestra el procesamiento de reubicación.
fr: Afficher le traitement de relocalisation

source: Display scope information.
es: Muestra información del alcance.
fr: Afficher des informations de portée.

source: Display relocation statistics.
es: Muestra estadísticas de reubicación.
fr: Afficher des statistiques de relocalisation.

source: Display search paths for each symbol look-up.
es: Muestra las rutas de búsqueda para cada búsqueda de símbolo.
fr: Afficher les chemins de recherche pour chaque consultation de symbole.

source: Determine unused DSOs.
es: Determina los DSO's sin usar.
fr: Identifier les objets partagés dynamiques non utilisés.

source: Display version dependencies.
es: Muestra las dependencias de esa versión.
fr: Afficher les dépendances de version.
