Repository: sebras/manpages-l10n
Catalog: po/*/man8/logrotate.8.po
Languages: es

source: B<endscript> The I<script> is executed once before all log files that match the wildcarded pattern are rotated, before the prerotate script is run and only if at least one log will actually be rotated. These directives may only appear inside a log file definition. The whole pattern is passed to the script as its first argument. If the script exits with an error, no further processing is done. See also B<lastaction> and the B<SCRIPTS> section.
es: B<endscript>. El I<script> se ejecuta después de rotar todos los archivos de registro que coinciden con el patrón aportado, antes de ejecutar el script prerotate y únicamente si al menos un archivo ha sido rotado. Esta directiva solo se emplea dentro de una definición de archivo de registro. Se pasa el patrón completo como primer argumento del script. Si finaliza con un error, no se sigue procesando nada. Consulte las secciones de B<lastaction> y B<SCRIPTS>.

source: B<endscript> The I<script> is executed once after all log files that match the wildcarded pattern are rotated, after the postrotate script is run and only if at least one log is rotated. These directives may only appear inside a log file definition. The whole pattern is passed to the script as its first argument. If the script exits with an error, just an error message is shown (as this is the last action). See also B<firstaction> and the B<SCRIPTS> section.
es: B<endscript>. El I<script> se ejecuta después de rotar todos los archivos de registro que coinciden con el patrón aportado, después de ejecutar el script postrotate y únicamente si al menos un archivo ha sido rotado. Esta directiva solo se emplea dentro de una definición de archivo de registro. Se pasa el patrón completo como primer argumento del script. Si finaliza con un error, no se sigue procesando nada. Consulte las secciones de B<firstaction> y B<SCRIPTS>.

source: B<endscript> The I<script> is executed before the log file is rotated and only if the log will actually be rotated. These directives may only appear inside a log file definition. Normally, the absolute path to the log file is passed as the first argument to the script. If B<sharedscripts> is specified, the whole pattern is passed to the script. See also B<postrotate> and the B<SCRIPTS> section. See B<sharedscripts> and B<nosharedscripts> for error handling.
es: B<endscript>. El I<script> se ejecuta antes de rotar el archivo de registro y únicamente si va a ser rotado. Estas directivas solo se utilizan en la definición de un archivo de registro. En general, se pasa la ruta absoluta del archivo de registro como primer argumento del script. Si se utiliza la directiva B<sharedscripts>, se pasa el patrón completo al script. Consulte las secciones B<postrotate> y B<SCRIPTS>, consulte también B<sharedscripts> y B<nosharedscripts> sobre la gestión de errores.

source: B<endscript> The I<script> is executed after the log file is rotated. These directives may only appear inside a log file definition. Normally, the absolute path to the log file is passed as the first argument to the script and the absolute path to the final rotated log file is passed as the second argument to the script. If B<sharedscripts> is specified, the whole pattern is passed as the first argument to the script, and the second argument is omitted. See also B<prerotate> and the B<SCRIPTS> section. See B<sharedscripts> and B<nosharedscripts> for error handling.
es: B<endscript>. El I<script> se ejecuta después de rotar el archivo de registro. Estas directivas solo se utilizan en la definición de un archivo de registro. En general, se pasa la ruta absoluta del archivo de registro como primer argumento del script y la ruta al archivo rotado se pasa como segundo argumento al script. Si se utiliza la directiva B<sharedscripts>, se pasa el patrón completo como primer argumento del script mientras se omite el segundo. Consulte las secciones B<prerotate> y B<SCRIPTS>, consulte también B<sharedscripts> y B<nosharedscripts> sobre la gestión de errores.

source: B<endscript> The I<script> is executed once just before removal of a log file. B<logrotate> will pass the name of file which is soon to be removed as the first argument to the script. See also B<firstaction> and the B<SCRIPTS> section.
es: B<endscript>. El I<script> una sola vez justo antes de eliminar el archivo de registro. B<logrotate> indica el nombre del archivo a eliminar en el primer argumento del script. Consulte las secciones B<firstaction> y B<SCRIPTS>.

source: SCRIPTS
es: SCRIPTS (GUIONES)

source: The lines between the starting keyword (e.g. B<prerotate>) and B<endscript> (both of which must appear on lines by themselves) are executed (using B</bin/sh>). The script inherits some traits from the B<logrotate> process, including stderr, stdout, the current directory, the environment, and the umask. Scripts are run as the invoking user and group, irrespective of any B<su> directive. If the B<--log> flag was specified, file descriptor 3 is the log file. The current working directory is unspecified.
es: Las líneas situadas entre la directiva inicial, por ejemplo B<prerotate> y B<endscript> (Ambas deben aparecer en líneas dedicadas) se ejecutan con B</bin/sh>. El script hereda algunos rasgos del proceso B<logrotate> como por ejemplo stderr, stdout, el directorio actual, el entorno y el valor de umask. Los script se ejecutan con el usuario/grupo con el que son invocados independientemente de la directiva B<su>. Si se añade la opción B<--log>, el archivo de registro será el descriptor de archivo 3. No se define el directorio de trabajo actual.

source: USER AND GROUP
es: USUARIO Y GRUPO

source: User and group identifiers are resolved first by trying the textual representation and, in case it fails, afterwards by the numeric value.
es: Los grupos y usuarios se intentan leer por su representación textual y sino por su representación numérica.

source: FILES
es: ARCHIVOS

source: Default state file.
es: Archivo de estado por defecto.

source: Configuration options.
es: Opciones de configuración.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: AUTHORS
es: AUTORES

source: If no command line arguments are given, B<logrotate> will print version and copyright information, along with a short usage summary. If any errors occur while rotating logs, B<logrotate> will exit with non-zero status.
es: Si no se aporta ninguna opción, la ejecución de B<logrotate> mostrará la versión, la licencia y unas breves instrucciones de uso. Cuando ocurra algún error durante la rotación de los archivos de registro, B<logrotate> terminará con un estado distinto de cero.

source: Tells B<logrotate> to use an alternate state file. This is useful if B<logrotate> is being run as a different user for various sets of log files. To prevent parallel execution B<logrotate> by default acquires a lock on the state file, if it cannot be acquired B<logrotate> will exit with value 3. The default state file is I</var/lib/logrotate/status>. If I</dev/null> is given as the state file, then B<logrotate> will not try to lock or write the state file.
es: Indica a B<logrotate> que debe usar un archivo de estado diferente al predeterminado. Esto es útil cuando B<logrotate> se ejecuta con un usuario diferente para algunos archivos de registro. Para evitar su ejecución en paralelo, bloqueará su archivo de estado terminando su ejecución con un valor de salida 3 si no es capaz de bloquearlo. Por defecto, el archivo de estado es I</var/lib/logrotate/status>. Si se indica I</dev/null> como archivo de estado, B<logrotate> no intentará escribir en él.

source: Log files are rotated every hour. Note that usually B<logrotate> is configured to be run by cron daily. You have to change this configuration and run B<logrotate> hourly to be able to really rotate logs hourly.
es: Rota los archivos de registro cada hora. Tenga en cuenta que en ciertos casos, B<logrotate> suele ser ejecutado por una tarea diaria de cron. En este caso deberá antes hacer que B<logrotate> se ejecute cada hora para poder cumplir con esa configuración.

source: Log files are rotated only if they grow bigger than I<size> bytes. If I<size> is followed by I<k>, the size is assumed to be in kilobytes. If the I<M> is used, the size is in megabytes, and if I<G> is used, the size is in gigabytes. So I<size 100>, I<size 100k>, I<size 100M> and I<size 100G> are all valid. This option is mutually exclusive with the time interval options, and it causes log files to be rotated without regard for the last rotation time, if specified after the time criteria (the last specified option takes the precedence).
es: Rota los archivos de registro solo si su tamaño es mayo de I<tamaño>. Si I<tamaño> va seguido de I<k> se entiende dicho tamaño expresado en kilobytes, mientras que si es una I<M> o una I<G> se interprete an megas o gigas respectivamente. Por ejemplo: I<tamaño 100>, I<tamaño 100k>, I<tamaño 100M> o I<tamaño 100G> sería expresiones válidas para indicar dicha información. Esta opción es mutuamente excluyente de la del intervalo de tiempo ya que si indica ambas a la vez, se rotan los archivos independientemente del tiempo transcurrido desde la última vez siempre que se indique después de la del intervalo temporal. La última opción prevalece siempre sobre las anteriores.

source: Make a copy of the log file, but don't change the original at all. This option can be used, for instance, to make a snapshot of the current log file, or when some other utility needs to truncate or parse the file. When this option is used, the B<create> option will have no effect, as the old log file stays in place.
es: Crea una copia del archivo de registro sin modificar el original. Esta opción puede ser útil en caso de querer obtener una captura del archivo en un determinado instante o cuando alguna aplicación necesita partir o filtrar el archivo. Cuando se usa esta opción, queda sin efecto B<create> ya que no se modifica nada del archivo original.

source: Truncate the original log file to zero size in place after creating a copy, instead of moving the old log file and optionally creating a new one. It can be used when some program cannot be told to close its logfile and thus might continue writing (appending) to the previous log file forever. Note that there is a very small time slice between copying the file and truncating it, so some logging data might be lost. When this option is used, the B<create> option will have no effect, as the old log file stays in place.
es: Trunca el archivo de registro original en el lugar en el que se encuentre tras crear una copia, en vez de mover el archivo antiguo y , opcionalmente, crear otro nuevo. Se puede usar cuando a alguna aplicación no se le puede ordenar que cierre su archivo de registro y por lo tanto podría seguir escribiendo (añadiendo) continuamente en el archivo de registro anterior. Nótese que transcurre una fracción de tiempo muy pequeña entre el copiado del archivo y su truncado, por lo que se podrían perder algunos datos. Cuando se usa esta opción, no tendrá efecto la opción B<create>, dado que el archivo antiguo permanecerá en su lugar.

source: Log file is renamed to temporary filename in the same directory by adding ".tmp" extension to it. After that, B<postrotate> script is run and log file is copied from temporary filename to final filename. This allows storing rotated log files on the different devices using B<olddir> directive. In the end, temporary filename is removed.
es: Se renombra el archivo de registro temporalmente y dentro del mismo directorio añadiéndole la extensión ".tmp". A continuación se ejecuta el script B<postrotate> que pone el nombre definitivo al archivo. Este permite almacenar archivos de registro ya rotados en dispositivos diferentes mediante la directiva B<olddir>. Al final se borran los archivos temporales.

source: The lines between the starting keyword (e.g. B<prerotate>) and B<endscript> (both of which must appear on lines by themselves) are executed (using B</bin/sh>). The script inherits some traits from the B<logrotate> process, including stderr, stdout, the current directory, the environment, and the umask. Scripts are run as the invoking user and group, irrespective of any B<su> directive. If the B<--log> flag was specified, file descriptor 3 is the log file.
es: Las líneas situadas entre la directiva inicial, por ejemplo B<prerotate> y B<endscript> (Ambas deben aparecer en líneas dedicadas) se ejecutan con B</bin/sh>. El script hereda algunos rasgos del proceso B<logrotate> como por ejemplo stderr, stdout, el directorio actual, el entorno y el valor de umask. Los script se ejecutan con el usuario/grupo con el que son invocados independientemente de la directiva B<su>. Si se añade la opción B<--log>, el archivo de registro será el descriptor de archivo 3.

source: Tells B<logrotate> to use an alternate state file. This is useful if B<logrotate> is being run as a different user for various sets of log files. To prevent parallel execution B<logrotate> by default acquires a lock on the state file, if it cannot be acquired B<logrotate> will exit with value 3. The default state file is I</var/lib/logrotate/logrotate.status>. If I</dev/null> is given as the state file, then B<logrotate> will not try to lock or write the state file.
es: Indica a B<logrotate> que debe usar un archivo de estado diferente al predeterminado. Esto es útil cuando B<logrotate> se ejecuta con un usuario diferente para algunos archivos de registro. Para evitar su ejecución en paralelo, bloqueará su archivo de estado terminando su ejecución con un valor de salida 3 si no es capaz de bloquearlo. Por defecto, el archivo de estado es I</var/lib/logrotate.status>. Si se indica I</dev/null> como archivo de estado, B<logrotate> no intentará bloquearlo ni escribir en él.

source: The command must then read a message on standard input and mail it to the recipient. The default mail command is I</bin/mail>.
es: La orden debe leer el mensaje desde la entrada estándar y enviárselo por correo electrónico al destinatario. Por defecto, se utiliza la orden I</bin/mail>.

source: If B<logrotate> is called via B<systemd>(1), following order of parsed config files is defined in the I<logrotate.service> file:
es: Si se ejecuta B<logrotate> a través de B<systemd>(1), el orden de lectura de los archivos de configuración se define en el archivo I<logrotate.service>:

source: Default configuration file defined by the vendor.
es: Archivo de configuración por defecto definido en la distribución.

source: Directory for additional configuration files defined by the vendor.
es: Directorio para archivos de configuración adicionales aportados por la distribución.

source: Default configuration file defined by the administrator. (optional)
es: Archivo de configuración por defecto definido por el administrador (opcional).

source: Directory for additional configuration files defined by the administrator. (optional)
es: Directorio para archivos de configuración adicionales definidos por el admninistrador (opcional).

source: Tells B<logrotate> to use an alternate state file. This is useful if B<logrotate> is being run as a different user for various sets of log files. To prevent parallel execution B<logrotate> by default acquires a lock on the state file, if it cannot be acquired B<logrotate> will exit with value 3. The default state file is I</var/lib/misc/logrotate.status>. If I</dev/null> is given as the state file, then B<logrotate> will not try to lock or write the state file.
es: Indica a B<logrotate> que debe usar un archivo de estado alternativo. Esto es útil cuando B<logrotate> se ejecuta con un usuario diferente para algunos archivos de registro. Para evitar su ejecución en paralelo, B<logrotate> bloqueará su archivo de estado terminando su ejecución con un valor de salida 3 si no es capaz de bloquearlo. Por defecto, el archivo de estado es I</var/lib/misc/logrotate.status>. Si se indica I</dev/null> como archivo de estado, B<logrotate> no intentará escribir en él.

source: Configuration options defined by the vendor.
es: Opciones de configuración definidas en la distribución.

source: Configuration options defined by the administrator.
es: Opciones de configuración definidas por el administrador.
