Repository: sebras/manpages-l10n
Catalog: po/*/man8/logrotate.8.po
Languages: es

source: Log files are rotated when they grow bigger than I<size> bytes even before the additionally specified time interval (B<daily>, B<weekly>, B<monthly>, or B<yearly>). The related B<size> option is similar except that it is mutually exclusive with the time interval options, and it causes log files to be rotated without regard for the last rotation time, if specified after the time criteria (the last specified option takes the precedence). When B<maxsize> is used, both the size and timestamp of a log file are considered.
es: Los archivos de registro se rotan cada vez que su tamaño sobrepasa I<tamaño> incluso antes de que transcurra el intervalo de tiempo especificado (B<daily>, B<weekly>, B<monthly>, or B<yearly>). La opción B<size> es similar salvo que es mutuamente excluyente con el intervalo de tiempo haciendo que se haga la rotación sin tener en cuenta el momento en que se hizo la vez anterior si se define a continuación de la opción del intervalo temporal (la última opción prevalece sobre las anteriores). Cuando se usa B<maxsize>, se tiene en cuenta tanto el tiempo transcurrido desde la última rotación como el tamaño del archivo.

source: B<tabooext> [+] I<list>
es: B<tabooext> [+] I<lista>

source: The current taboo extension list is changed (see the B<include> directive for information on the taboo extensions). If a + precedes the list of extensions, the current taboo extension list is augmented, otherwise it is replaced. At startup, the taboo extension list I<,v>, I<.cfsaved>, I<.disabled>, I<.dpkg-bak>, I<.dpkg-del>, I<.dpkg-dist>, I<.dpkg-new>, I<.dpkg-old>, I<.rhn-cfg-tmp-*>, I<.rpmnew>, I<.rpmorig>, I<.rpmsave>, I<.swp>, I<.ucf-dist>, I<.ucf-new>, I<.ucf-old>, I<~>
es: Se cambia la lista actual de extensiones tabú (véase la directiva B<include> si se desea información sobre las extensiones tabú). Si un + precede a la lista de extensiones, la lista actual de extensiones tabú se aumenta, de otro modo se reemplaza. Al comienzo, la lista de extensiones tabú contiene .rpmorig, .rpmsave, ,v y ~

source: B<taboopat> [+] I<list>
es: B<taboopat> [+] I<lista>

source: The current taboo glob pattern list is changed (see the B<include> directive for information on the taboo extensions and patterns). If a + precedes the list of patterns, the current taboo pattern list is augmented, otherwise it is replaced. At startup, the taboo pattern list is empty.
es: Se cambia la lista actual de extensiones tabú (consulte la directiva B<include> si desea información sobre las extensiones tabú). Si un + precede a la lista de extensiones, la lista actual de extensiones tabú se aumenta, de otro modo se reemplaza. Al comienzo, la lista de extensiones tabú está vacía.

source: Files and Folders
es: Archivos y carpetas

source: B<create >I<mode> I<owner> I<group>, B<create >I<owner> I<group>
es: B<create >I<permisos> I<propietario> I<grupo>, B<create >I<propietario> I<grupo>

source: Immediately after rotation (before the B<postrotate> script is run) the log file is created (with the same name as the log file just rotated). I<mode> specifies the mode for the log file in octal (the same as B<chmod>(2)), I<owner> specifies the user who will own the log file, and I<group> specifies the group the log file will belong to (see the section B<USER AND GROUP> for details). Any of the log file attributes may be omitted, in which case those attributes for the new file will use the same values as the original log file for the omitted attributes. This option can be disabled using the B<nocreate> option.
es: Justo después de la rotación y antes de que se ejecute el script B<postrotate>, se crea el nuevo archivo de registro con el mismo nombre que el recién rotado. I<permisos> define el modo para dicho archivo en formato octal (igual que en B<chmod>(2)), I<propietario> define el propietario de dicho archivo y I<grupo> indica el grupo al que pertenece (consulte la sección B<GRUPOS Y USUARIOS>). No es necesario definir ninguno de estos atributos, para los que no se definan se usarán los mismos que tenía el archivo rotado . Esta opción puede anularse con la opción B<nocreate>.

source: New log files are not created (this overrides the B<create> option).
es: No se crean archivos de registro nuevos (esto anula la opción B<create>).

source: B<createolddir >I<mode> I<owner> I<group>
es: B<createolddir >I<modo> I<propietario> I<grupo>

source: If the directory specified by B<olddir> directive does not exist, it is created. I<mode> specifies the mode for the B<olddir> directory in octal (the same as B<chmod>(2)), I<owner> specifies the user who will own the B<olddir> directory, and I<group> specifies the group the B<olddir> directory will belong to (see the section B<USER AND GROUP >for details). This option can be disabled using the B<nocreateolddir> option.
es: Se crea, si no existe ya, el directorio indicado en la directiva B<olddir>. I<mode> define los permisos para el directorio B<olddir> en formato octal (igual que B<chmod>(2)), I<propietario> define el usuario que lo va a poseer y I<group> define el grupo al que pertenecerá (consulte la sección B<GRUPOS Y USUARIOS> para más información). Esta opción puede anularse mediante el uso de B<nocreateolddir>.

source: B<olddir> directory is not created by B<logrotate> when it does not exist.
es: B<logrotate> no crea el directorio B<olddir> si no existe.

source: Make a copy of the log file, but don't change the original at all. This option can be used, for instance, to make a snapshot of the current log file, or when some other utility needs to truncate or parse the file. When this option is used, the B<create> option will have no effect, as the old log file stays in place. The B<copy> option allows storing rotated log files on the different devices using B<olddir> directive.
es: Crea una copia del archivo de registro sin modificar el original. Esta opción puede ser útil en caso de querer obtener una captura del archivo en un determinado instante o cuando alguna aplicación necesita partir o filtrar el archivo. Cuando se usa esta opción, queda sin efecto B<create> ya que no se modifica nada del archivo original. La opción B<copy> permite guardar archivos rotados en un dispositivo diferente mediante la directiva B<olddir>.

source: Do not copy the original log file and leave it in place. (this overrides the B<copy> option).
es: No copia el archivo orignal y lo deja en su lugar. (Esto anula la opción B<copy>).

source: Truncate the original log file to zero size in place after creating a copy, instead of moving the old log file and optionally creating a new one. It can be used when some program cannot be told to close its logfile and thus might continue writing (appending) to the previous log file forever. Note that there is a very small time slice between copying the file and truncating it, so some logging data might be lost. When this option is used, the B<create> option will have no effect, as the old log file stays in place. The B<copytruncate> option allows storing rotated log files on the different devices using B<olddir> directive. The B<copytruncate> option implies B<norenamecopy>.
es: Trunca el archivo de registro original en el lugar en el que se encuentre tras crear una copia, en vez de mover el archivo antiguo y , opcionalmente, crear otro nuevo. Se puede usar cuando a alguna aplicación no se le puede ordenar que cierre su archivo de registro y por lo tanto podría seguir escribiendo (añadiendo) continuamente en el archivo de registro anterior. Nótese que transcurre una fracción de tiempo muy pequeña entre el copiado del archivo y su truncado, por lo que se podrían perder algunos datos. Cuando se usa esta opción, no tendrá efecto la opción B<create>, dado que el archivo antiguo permanecerá en su lugar. La opción B<copytruncate> permite almacenar archivos rotados en dispositivos diferentes mediante la directiva B<olddir>. La opción B<copytruncate> implica B<norenamecopy>.

source: Do not truncate the original log file in place after creating a copy (this overrides the B<copytruncate> option).
es: No trunca el archivo de registro original en el lugar en el que se encuentre tras crear una copia. (Esto anula la opción B<copytruncate>).

source: Log file is renamed to temporary filename in the same directory by adding ".tmp" extension to it. After that, B<postrotate> script is run and log file is copied from temporary filename to final filename. In the end, temporary filename is removed. The B<renamecopy> option allows storing rotated log files on the different devices using B<olddir> directive. The B<renamecopy> option implies B<nocopytruncate>.
es: Se renombra el archivo de registro temporalmente y dentro del mismo directorio añadiéndole la extensión ".tmp". A continuación se ejecuta el script B<postrotate> que pone el nombre definitivo al archivo. Este permite almacenar archivos de registro ya rotados en dispositivos diferentes mediante la directiva B<olddir>. Al final se borran los archivos temporales. La opción B<renamecopy> permite almacenar archivos rotados en dispositivos diferentes empleando la directiva B<olddir>. La opción B<renamecopy> implica B<nocopytruncate>.

source: Do not rename and copy the original log file (this overrides the B<renamecopy> option).
es: No copia el archivo original y lo deja en su lugar. (Esto anula la opción B<renamecopy>).

source: Delete log files using B<shred> -u instead of unlink(). This should ensure that logs are not readable after their scheduled deletion; this is off by default. See also B<noshred>.
es: Borra los archivos de registro mediante B<shred> -u en lugar de usar unlink(), imposibilitando su lectura posterior. Por defecto está desactivado.

source: Do not use B<shred> when deleting old log files. See also B<shred>.
es: No emplea B<shred> al borrar antiguos archivos de registro. Consulte B<shred>.

source: Asks GNU B<shred>(1) to overwrite log files B<count> times before deletion. Without this option, B<shred>'s default will be used.
es: Indica a GNU B<shred>(1) que sobreescriba los archivos B<count> veces antes de borrarlos. Si no se define esta opción, se usará la configuración por defecto de B<shred>.

source: Rotate files with multiple hard links; this is off by default. The target file might get emptied, e.g. with B<shred> or B<copytruncate>. Use with caution, especially when the log files are rotated as root.
es: Rota archivos con varios enlaces duros. Desactivado por defecto. Puede provocar que se vacíen los archivos de destino, p.ej. con B<shred> o B<copytruncate>. Utilícelo con cautela espacialmente cuando se roten archivos como administrador.

source: Do not rotate files with multiple hard links. See also B<allowhardlink>.
es: No se rotan archivos con varios enlaces duros. Consulte B<allowhardlinks>.

source: Compression
es: Compresión

source: Old versions of log files are compressed with B<gzip>(1) by default. See also B<nocompress>.
es: Las versiones antiguas de los archivos de registro se comprimen con B<gzip>(1). Consulte B<nocompress>.

source: Old versions of log files are not compressed. See also B<compress>.
es: Las versiones antiguas de los archivos de registro no se comprimen. Véase también B<compress>.

source: Specifies which command to use to compress log files. The default is B<gzip>(1). See also B<compress>.
es: Define le aplicación que se usará para comprimir los archivos de registro. Por defecto, se usará B<gzip>(1). Consulte B<compress>.

source: Specifies which command to use to uncompress log files. The default is B<gunzip>(1).
es: Define la aplicación que se usará para descomprimir archivos. Por defecto se usa B<gunzip>(1).

source: Specifies which extension to use on compressed logfiles, if compression is enabled. The default follows that of the configured compression command.
es: Define la extensión que se añade a los archivos comprimidos cuando esté activa la compresión de los mismos. Por defecto se dejará la de la aplicación que los comprimió.

source: Command line options may be passed to the compression program, if one is in use. The default, for B<gzip>(1), is "-6" (biased towards high compression at the expense of speed). If you use a different compression command, you may need to change the B<compressoptions> to match.
es: Existe la posibilidad de pasarle opciones al programa de compresión. Por defecto, para B<gzip>(1), será "-6" (lo que representa un alto nivel de compresión a expensas de una mayor lentitud). Si utiliza otra aplicación para comprimir, seguramente sea necesario varias esta opción.

source: Postpone compression of the previous log file to the next rotation cycle. This only has effect when used in combination with B<compress>. It can be used when some program cannot be told to close its logfile and thus might continue writing to the previous log file for some time.
es: Pospone la compresión del archivo de registro anterior hasta el siguiente ciclo de rotación. Solo tiene efecto cuando se usa en combinación con B<compress>. Se puede usar cuando no se puede ordenar a un programa que cierre su archivo de registro y podría continuar escribiendo en él durante algún tiempo.

source: Do not postpone compression of the previous log file to the next rotation cycle (this overrides the B<delaycompress> option).
es: No pospone la compresión del archivo de registro anterior hasta el próximo ciclo de cambio (esto anula la opción B<delaycompress>).

source: Filenames
es: Nombres de archivo

source: Log files with I<ext> extension can keep it after the rotation. If compression is used, the compression extension (normally I<.gz>) appears after I<ext>. For example you have a logfile named mylog.foo and want to rotate it to mylog.1.foo.gz instead of mylog.foo.1.gz.
es: Si tiene un archivo con la extensión I<ext> puede optar por mantenerla también en los archivos rotados. Si se comprimen, la extensión (normalmente I<.gz> se pone a continuación de I<ext>. Suponga, por ejemplo, que tiene un archivo de registro llamad mireg.foo y desea que el originado en la rotación se llame mireg.1.foo.gz en lugar de mireg.foo.1.gz como lo haría por defecto.

source: Log files are given the final extension I<ext> after rotation. If the original file already ends with I<ext>, the extension is not duplicated, but merely moved to the end, that is both B<filename> and B<filename>I<ext> would get rotated to filename.1I<ext>. If compression is used, the compression extension (normally B<.gz>) appears after I<ext>.
es: La extensión I<ext> del los archivos de registro se añade después de la rotación. Si el archivo original tiene una extensión I<ext>, ésta no se duplica sino que se desplaza al final, es decir que tanto B<nombre_archivo> como B<nombre_archivo>.I<ext> se convierten en nombre_archivo.1I<ext>. Si se utiliza compresión, su extensión (normalmente B<.gz>) suele añadirse después de I<ext>.

source: B<start >I<count>
es: B<start >I<número>

source: This is the number to use as the base for rotation. For example, if you specify 0, the logs will be created with a .0 extension as they are rotated from the original log files. If you specify 9, log files will be created with a .9, skipping 0\(en8. Files will still be rotated the number of times specified with the B<rotate> directive.
es: Es la cifra que se usará como base para las rotaciones. Por ejemplo, si los define como 0, los archivos rotados se crearán con la extensión .0. Si lo define como 9, se crearán como .9 saltándose 0\(en8. El número de rotación a conservar sigue estando definido en la directiva B<rotate>.

source: Archive old versions of log files adding a date extension like YYYYMMDD instead of simply adding a number. The extension may be configured using the B<dateformat> and B<dateyesterday> options.
es: Guarda las distintas versiones de los archivos de registro añadiendo una extensión del tipo AÑOMESDIA en lugar de añadir un simple número. Esta extensión puede configurarse mediante las opciones B<dateformat> y B<dateyesterday>.

source: Do not archive old versions of log files with date extension (this overrides the B<dateext> option).
es: No añade una extensión con la fecha a los archivos de registro que guarda (este sobresee la opción B<dateext>).

source: Specify the extension for B<dateext> using the notation similar to B<strftime>(3) function. Only %Y %m %d %H %M %S %V and %s specifiers are allowed. The default value is -%Y%m%d except hourly, which uses -%Y%m%d%H as default value. Note that also the character separating log name from the extension is part of the dateformat string. The system clock must be set past Sep 9th 2001 for %s to work correctly. Note that the datestamps generated by this format must be lexically sortable (that is first the year, then the month then the day. For example 2001/12/01 is ok, but 01/12/2001 is not, since 01/11/2002 would sort lower while it is later). This is because when using the B<rotate> option, B<logrotate> sorts all rotated filenames to find out which logfiles are older and should be removed.
es: Define la extensión para B<dateext> empleando una notación similar a la función B<strftime>(3). Solo es posible utilizar las variables %Y %m %d %H %M %S %V y %s. El valor por defecto es -%Y%m%d salvo en el caso de que la rotación sea horaria que sería -%Y%m%d%H. Observe que el carácter que separa el nombre del archivo de su extensión es parte de la fecha. La fecha del sistema debe ser posterior al 9 de septiembre de 2001 para que la variable %s se sustituya correctamente. Tenga en cuenta también que las fechas y horas creadas con ese formato deben ser ordenables según el número, esto es primero el año, luego el mes y finalmente el día, es decir 2001/12/01 sería correcto mientras que 01/12/2001 no lo sería (sale antes al ordenarlo porque empieza por 0 y no por 2). Esto es debido a que al ejecutar la función B<rotate>, B<logrotate> ordena todos los nombres de archivo para ver cual es el más antiguo y,si procede, borrarlo.

source: Use yesterday's instead of today's date to create the B<dateext> extension, so that the rotated log file has a date in its name that is the same as the timestamps within it.
es: Emplea la fecha del día anterior para crear la extensión B<dateext>, así el nombre del archivo rotado contiene una fecha que coincide con su marca de tiempo.

source: Use hour ago instead of current date to create the B<dateext> extension, so that the rotated log file has a hour in its name that is the same as the timestamps within it. Useful with rotate B<hourly>.
es: Emplea la hora anterior para crear la extensión B<dateext>, así el nombre del archivo rotado contiene una hora que coincide con su marca de tiempo. Útil cuando se planifican rotaciones con B<hourly>.

source: Mail
es: Correo Electrónico

source: B<mail >I<address>
es: B<mail >I<dirección>

source: When a log is rotated out of existence, it is mailed to I<address>. If no mail should be generated by a particular log, the B<nomail> directive may be used.
es: Cuando un archivo rotado va a ser borrado, se envía por mail a I<dirección>. Si se quiere que no se envíe ningún correo electrónico, se debe usar la directiva B<nomail>.

source: Do not mail old log files to any address.
es: No envían los archivos de registro antiguos a ninguna dirección de correo.

source: When using the B<mail> command, mail the just-rotated file, instead of the about-to-expire file.
es: Cuando se usa la orden B<mail>, se envía el archivo recién rotado en lugar de enviar el que se va a borrar.

source: When using the B<mail> command, mail the about-to-expire file, instead of the just-rotated file (this is the default).
es: Cuando se usa la orden B<mail>, se envía el archivo rotado que va a ser borrado en lugar de hacerlo con el recién rotado. Este es el comportamiento por defecto.

source: Additional config files
es: Archivos de Configuración Adicionales

source: Reads the file given as an argument as if it was included inline where the B<include> directive appears. If a directory is given, most of the files in that directory are read in alphabetic order before processing of the including file continues. The only files which are ignored are files which are not regular files (such as directories and named pipes) and files whose names end with one of the taboo extensions or patterns, as specified by the B<tabooext> or B<taboopat> directives, respectively. The given path may start with B<~/> to make it relative to the home directory of the executing user. For security reasons configuration files must not be group-writable nor world-writable.
es: Lee el archivo dado como argumento como si se incluyese donde aparece la directiva B<include>. Si se da un directorio, la mayoría de los archivos se leen por orden alfabético antes de que continúe el procesamiento del archivo en el que se incluyen. Los únicos archivos que se ignoran son archivos no habituales (tales como directorios y tuberías con nombre) y aquellos archivos cuyos nombres terminan con una de las extensiones tabú según se especifica en la directiva B<tabooext> o B<taboopat>. La ruta que se indique puede comezar con B<~/> para que sea relativa al directorio home del usuario que lo ejecuta. Por razones de seguridad, solo se permite que los permisos de los archivos de configuración incluyan derechos de escritura para su propietario.

source: Scripts
es: Scripts (guiones)

source: Normally, B<prerotate> and B<postrotate> scripts are run for each log which is rotated and the absolute path to the log file is passed as first argument to the script. That means a single script may be run multiple times for log file entries which match multiple files (such as the I</var/log/news/*> example). If B<sharedscripts> is specified, the scripts are only run once, no matter how many logs match the wildcarded pattern, and whole pattern is passed to them. However, if none of the logs in the pattern require rotating, the scripts will not be run at all. If the scripts exit with error (or any log fails to rotate), the remaining actions will not be executed for any logs. This option overrides the B<nosharedscripts> option.
es: En general, los script B<prerotate> y B<postrotate> se ejecutan para cada archivo de registro que precisa ser rotado y la ruta absoluta se proporciona como primer argumento de dichos script. Esto significa que un mismo script se ejecuta tantas veces como archivos de registro coincidan con el patrón dado, por ejemplo I</var/log/news/*> coinciden con todos los archivos dentro de la carpeta news. Si se define la opción B<sharedscripts>, los script reciben el patrón a procesar y solo se ejecutan una vez sin importar los archivos que coincidan. Sin embargo, si ninguno de los archivos necesita ser rotado, el script no se ejecuta. Si el el script finaliza con un error (o no es posible rotar algún archivo), no se ejecutará ninguna de las otras acciones planificadas en ningún archivo. Esta opción sobresee B<nosharedscript>.

source: Run B<prerotate> and B<postrotate> scripts for every log file which is rotated (this is the default, and overrides the B<sharedscripts> option). The absolute path to the log file is passed as first argument to the script. The absolute path to the final rotated log file is passed as the second argument to the B<postrotate> script. If the scripts exit with error, the remaining actions will not be executed for the affected log only.
es: Ejecuta los script B<prerotate>y B<postrotate> para cada archivo de registro a rotar siendo éste el comportamiento por defecto (sobresee la opción B<sharedscript>). La ruta absoluta del archivo de registro se proporciona en el primer argumento del script. La ruta absoluta del último archivo rotado se pasa como segundo argumento de script B<postrotate>. Si el script termina con un error, no se ejecutarán el resto de acciones planificadas pero solo para ese archivo concreto.
