Repository: sebras/manpages-l10n
Catalog: po/*/man8/logrotate.8.po
Languages: es

source: System Administrator's Manual
es: Manual del Administrador del Sistema Linux

source: NAME
es: NOMBRE

source: logrotate \(hy rotates, compresses, and mails system logs
es: logrotate \(hy rota, comprime y envía por correo electrónico archivos de registro del sistema

source: SYNOPSIS
es: SINOPSIS

source: B<logrotate> [B<--force>] [B<--debug>] [B<--state> I<file>] [B<--skip-state-lock>] [B<--verbose>] [B<--log> I<file>] [B<--mail> I<command>] I<config_file> [I<config_file2 ...>]
es: B<logrotate> [B<--force>] [B<--debug>] [B<--state> I<archivo>] [B<--skip-state-lock>] [B<--verbose>] [B<--log> I<archivo>] [B<--mail> I<orden>] I<archivo_de_configuración> [I<archivo_de_configuración2 ...>]

source: DESCRIPTION
es: DESCRIPCIÓN

source: B<logrotate> is designed to ease administration of systems that generate large numbers of log files. It allows automatic rotation, compression, removal, and mailing of log files. Each log file may be handled daily, weekly, monthly, or when it grows too large.
es: B<Logrotate> ha sido diseñado para facilitar la administración de sistemas que generan gran cantidad de archivos de registro (logs). El programa permite la rotación, compresión, eliminación y envío por correo electrónico de los archivos de registro. Puede planificarse la rotación de cada archivo de forma diaria, semanal, mensual o cuando alcance un determinado tamaño.

source: Normally, B<logrotate> is run as a daily cron job. It will not modify a log more than once in one day unless the criterion for that log is based on the log's size and B<logrotate> is being run more than once each day, or unless the B<-f> or B<--force> option is used.
es: En general, B<logrotate> se ejecuta diariamente mediante cron. No se modificará un archivo de registro varias veces al día excepto que se haya definido una regla según su tamaño y que B<logrotate> se ejecute más de una vez al día. También puede ocurrir si se usa la opción B<-f> o B<--force>.

source: Any number of config files may be given on the command line. Later config files may override the options given in earlier files, so the order in which the B<logrotate> config files are listed is important. Normally, a single config file which includes any other config files which are needed should be used. See below for more information on how to use the B<include> directive to accomplish this. If a directory is given on the command line, every file in that directory is used as a config file.
es: En la línea de órdenes pueden indicarse un número ilimitado de archivos de configuración. Estos archivos de configuración podrán invalidar las opciones dadas en archivos anteriores. Esto hace que el orden en que se listan los archivos de configuración de B<logrotate> sea muy importante. Lo habitual es usar un solo archivo de configuración que incluya tantos otros archivos de configuración como sean necesarios. Vea a continuación el uso de la directiva I<include> para conseguirlo. Si se proporciona un nombre de directorio en la línea de órdenes, cada uno de los archivos que se encuentren en ese directorio se usará como archivo de configuración.

source: If no command line arguments are given, B<logrotate> will print version and copyright information, along with a short usage summary. If any errors occur while rotating logs, B<logrotate> will exit with non-zero status, although the state file will be updated.
es: Si no se aporta ninguna opción, la ejecución de B<logrotate> mostrará la versión, la licencia y unas breves instrucciones de uso. Cuando ocurra algún error durante la rotación de los archivos de registro, B<logrotate> terminará con un estado distinto de cero, aunque el archivo se actualizara.

source: OPTIONS
es: OPCIONES

source: Tells B<logrotate> to force the rotation, even if it doesn't think this is necessary. Sometimes this is useful after adding new entries to a B<logrotate> config file, or if old log files have been removed by hand, as the new files will be created, and logging will continue correctly.
es: Hará que B<logrotate> rote el/los archivo(s) aunque no sea necesario. Esta opción puede ser útil para probar cambios en el archivo de configuración de B<logrotate>, o cuando se borraron archivos de registro antiguos manualmente y sea necesario recrearlos de nuevo para proseguir con el registro correctamente.

source: Turn on debug mode, which means that no changes are made to the logs and the B<logrotate> state file is not updated. Only debug messages are printed.
es: Activa el modo de depuración, no se efectuará ningún cambio en los archivos de registro ni al archivo de estado de B<logrotate>. Solo se muestran mensajes relativos a la depuración.

source: B<-s>, B<--state> I<statefile>
es: B<-s>, B<--state> I<archivo_de_estado>

source: Tells B<logrotate> to use an alternate state file. This is useful if B<logrotate> is being run as a different user for various sets of log files. To prevent parallel execution B<logrotate> by default acquires a lock on the state file, if it cannot be acquired B<logrotate> will exit with value 3. The default state file is I</var/lib/logrotate.status>. If I</dev/null> is given as the state file, then B<logrotate> will not try to lock or write the state file.
es: Indica a B<logrotate> que debe usar un archivo de estado diferente al predeterminado. Esto es útil cuando B<logrotate> se ejecuta con un usuario diferente para algunos archivos de registro. Para evitar su ejecución en paralelo, bloqueará su archivo de estado terminando su ejecución con un valor de salida 3 si no es capaz de bloquearlo. Por defecto, el archivo de estado es I</var/lib/logrotate.status>. Si se indica I</dev/null> como archivo de estado, B<logrotate> no intentará bloquearlo ni escribir en él.

source: Do not lock the state file, for example if locking is unsupported or prohibited.
es: No bloquea el archivo de estado. Útil en caso de que el sistema lo prohiba o no tenga soporte para ello.

source: Turns on verbose mode, for example to display messages during rotation.
es: Activa el modo prolijo.Útil para mostrar mensajes durante las rotaciones.

source: B<-l>, B<--log> I<file>
es: B<-l>, B<--log> I<archivo>

source: Tells B<logrotate> to log verbose output into the log_file. The verbose output logged to that file is the same as when running B<logrotate> with B<-v> switch. The log file is overwritten on every B<logrotate> execution.
es: Hace que B<logrotate> registre su prolija salida en el archivo que se indique. Dicha salida es la misma que se produciría al ejecutar B<logrotate> con la opción B<-v>. Este archivo se sobreescribe con cada ejecución de B<logrotate>.

source: B<-m>, B<--mail> I<command>
es: B<-m>, B<--mail> I<orden>

source: Tells B<logrotate> which command to use when mailing logs. This command should accept the following arguments:
es: Indica a B<logrotate> qué orden utilizar cuando envíe archivos de registro por correo electrónico. Dicha orden debería aceptar estas opciones:

source: 1) the subject of the message given with '-s subject'
es: 1) El asunto del mensaje mediante '-s asunto'

source: 2) the recipient.
es: 2) el destinatario.

source: The command must then read a message on standard input and mail it to the recipient. The default mail command is I</usr/bin/mail>.
es: La orden empleada deberá leer el mensaje desde la entrada estándar y enviárselo al destinatario. Por defecto, se usará I</usr/bin/mail>.

source: Prints a short usage message.
es: Muestra una breve explicación de su uso.

source: Prints help message.
es: Muestra un mensaje de ayuda.

source: Display version information.
es: Mostrar información de versión.

source: CONFIGURATION FILE
es: ARCHIVO DE CONFIGURACIÓN

source: B<logrotate> reads everything about the log files it should be handling from the series of configuration files specified on the command line. Each configuration file can set global options (local definitions override global ones, and later definitions override earlier ones) and specify logfiles to rotate. Global options do not affect preceding include directives. A simple configuration file looks like this:
es: B<logrotate> lee toda la información necesaria sobre los archivos de registro que debe manejar de la serie de archivos de configuración que se especifiquen en la línea de órdenes. Cada archivo de configuración puede establecer opciones globales (las definiciones locales anulan a las globales, y aquellas definiciones efectuadas en último lugar anulan siempre a las anteriores) y especificar el archivo de registro que se ha de cambiar. Un archivo de configuración simple sería el siguiente:

source: # sample logrotate configuration file compress
es: # Ejemplo de archivo de configuración de Logrotate errors sysadmin@my.org compress

source: The first few lines set global options; in the example, logs are compressed after they are rotated. Note that comments may appear anywhere in the config file as long as the first non-whitespace character on the line is a B<#>.
es: Las primeras líneas definen opciones globales. En el presente ejemplo, los archivos de registro se comprimen después de ser rotados. Observe que puede escribir comentarios en cualquier parte del archivo de configuración siempre y cuando el primer carácter (distinto de un espacio en blanco) sea B<#>.

source: Values are separated from directives by whitespace and/or an optional =. Numbers must be specified in a format understood by B<strtoul>(3).
es: Se usa un espacio en blanco y/o, opcionalmente, un signo igual para separar las directivas y su correspondiente valor. Los números deberán definirse en un formato legible por B<strtoul>(3).

source: The next section of the config file defines how to handle the log file I</var/log/messages>. The log will go through five weekly rotations before being removed. After the log file has been rotated (but before the old version of the log has been compressed), the command I</usr/bin/killall -HUP syslogd> will be executed.
es: La siguiente sección del archivo de configuración define la acción a realizar sobre el archivo de registro I</var/log/messages>. El archivo sufrirá una rotación semanal durante cinco semanas antes de ser eliminado. Después de rotar el archivo (pero antes de haberse comprimido la versión anterior) se ejecutará la orden I</sbin/killall -HUP syslogd>.

source: The next section defines the parameters for both I</var/log/httpd/access.log> and I</var/log/httpd/error.log>. Each is rotated whenever it grows over 100\ kilobytes in size, and the old logs files are mailed (uncompressed) to recipient@\:example.org after going through 5 rotations, rather than being removed. The B<sharedscripts> means that the B<postrotate> script will only be run once (after the old logs have been compressed), not once for each log which is rotated. Note that log file names may be enclosed in quotes (and that quotes are required if the name contains spaces). Normal shell quoting rules apply, with B<'>, B<">, and B<\e> characters supported.
es: La siguiente sección define los parámetros de I</var/log/http/access.log>. Éste se cambia siempre y cuando excede los 100k de tamaño, y los archivos de registro antiguos se envían (sin comprimir) a www@my.org después de haber sufrido cinco cambios, en vez de ser eliminados. Del mismo modo, cualquier error que pueda ocurrir durante el procesamiento del archivo de registro se envía a www@my.org (anulando así la directiva global I<errors>).

source: The next section defines the parameters for all of the files in I</var/log/news>. Each file is rotated on a monthly basis.
es: La siguiente sección define los parámetros para todos los archivos contenidos en I</var/log/news>. Todos los archivos son rotados mensualmente.

source: The last section uses tilde expansion to rotate log files in the home directory of the current user. This is only available, if your glob library supports tilde expansion. GNU glob does support this.
es: La última sección emplea el carácter especial "~" para hacer la rotación en el directorio $HOME del usuario actual. Esto solo está disponible si la biblioteca glob del sistema incluye soporte para dicho carácter especial (como sí lo tiene GNU glob por ejemplo).

source: Please use wildcards with caution. If you specify *, B<logrotate> will rotate all files, including previously rotated ones. A way around this is to use the B<olddir> directive or a more exact wildcard (such as *.log).
es: Utilice los asteriscos con precaución. Si indica "*", B<logrotate> rotará todos los archivos incluidos los que creados en anteriores rotaciones. Una manera de evitar esto sería mediante el uso de la directiva B<olddir> o usando los asteriscos con mayor precisión (por ejemplo *.log).

source: Please note, by default when using B<systemd>(1), the option I<ProtectSystem=full> is set in the I<logrotate.service> file. This prevents B<logrotate> from modifying logs in I</etc> and I</usr>.
es: Observe que, por defecto al usar B<systemd>(1), la opción I<ProtectSystem=full> se define en el archivo I<logrotate.service>. Esto evitará que B<logrotate> modifique archivos de registro en I</etc> o en I</usr>.

source: Here is more information on the directives which may be included in a B<logrotate> configuration file:
es: A continuación se proporciona más información sobre las directivas que se pueden incluir en un archivo de configuración de B<logrotate>:

source: CONFIGURATION FILE DIRECTIVES
es: DIRECTIVAS DEL ARCHIVO DE CONFIGURACIÓN

source: These directives may be included in a B<logrotate> configuration file:
es: A continuación se proporciona más información sobre las directivas que se pueden incluir en un archivo de configuración de B<logrotate>:

source: Rotation
es: Rotación

source: B<rotate >I<count>
es: B<rotate >I<veces>

source: Log files are rotated I<count> times before being removed or mailed to the address specified in a B<mail> directive. If I<count> is 0, old versions are removed rather than rotated. If I<count> is -1, old logs are not removed at all, except they are affected by B<maxage> (use with caution, may waste performance and disk space). Default is 0.
es: Los archivos de registro se cambian I<veces> antes de ser eliminados o enviados a la dirección especificada en una directiva B<mail>. Si I<veces> es 0, las versiones antiguas se eliminarán en vez de ser rotadas.

source: B<olddir >I<directory>
es: B<olddir >I<directorio>

source: Logs are moved into I<directory> for rotation. The I<directory> must be on the same physical device as the log file being rotated, unless B<copy>, B<copytruncate> or B<renamecopy> option is used. The I<directory> is assumed to be relative to the directory holding the log file unless an absolute path name is specified. When this option is used all old versions of the log end up in I<directory>. This option may be overridden by the B<noolddir> option.
es: Los archivos de registro se mueven a I<directorio> para su rotación. El I<directorio> debe encontrarse en el mismo dispositivo físico que el archivo de registro que se va a cambiar. Cuando se usa esta opción, todas las versiones antiguas del archivo de registro van a parar a I<directorio>. Esta opción puede anularse por medio de la opción B<noolddir>.

source: Logs are rotated in the directory they normally reside in (this overrides the B<olddir> option).
es: Los archivos se cambian en el mismo directorio en el que el archivo reside normalmente (esto anula la opción B<olddir>).

source: B<su >I<user> I<group>
es: B<su >I<usuario> I<grupo>

source: Rotate log files set under this user and group instead of using default user/group (usually root). I<user> specifies the user used for rotation and I<group> specifies the group used for rotation (see the section B<USER AND GROUP> for details). If the user/group you specify here does not have sufficient privilege to make files with the ownership you've specified in a B<create> directive, it will cause an error. If B<logrotate> runs with root privileges, it is recommended to use the B<su> directive to rotate files in directories that are directly or indirectly in control of non-privileged users.
es: Rota los archivos de registro que pertenecen a un determinado usuario y grupo en lugar de utilizar el asignado por defecto (generalmente el administrador o "root"). I<usuario> define el nombre del usuario y I<grupo> el grupo (consulte la sección B<GRUPOS Y USUARIOS> para más detalles). Si el usuario/grupo que se define no tiene permisos suficientes para realizar la tarea que se defina, se emitirá un mensaje de error. Si se ejecuta B<logrotate> como root, se recomiendo emplear B<su> para rotar los archivos en los directorios que estén bajo control de usuarios normales.

source: Frequency
es: Frecuencia

source: Log files are rotated every hour. Note that usually B<logrotate> is configured to be run by cron daily (or by I<logrotate.timer> when using B<systemd>(1)). You have to change this configuration and run B<logrotate> hourly to be able to really rotate logs hourly.
es: Rota los archivos de registro cada hora. Tenga en cuenta que en ciertos casos, B<logrotate> suele ser ejecutado por una tarea diaria de cron (o mediante I<logrotate.timer> si se usa B<systemd>(1)). En este caso deberá modificar la configuración para que B<logrotate> se ejecute cada hora para poder realmente rotar los archivos cada hora.

source: Log files are rotated every day.
es: Los archivos de registro se cambian diariamente.

source: B<weekly> [I<weekday>]
es: B<weekly> [I<dia_de_semana>]

source: Log files are rotated once each I<weekday>, or if the date is advanced by at least 7 days since the last rotation (while ignoring the exact time). The I<weekday> interpretation is following: 0 means Sunday, 1 means Monday, \&.\|.\|.\|\&, 6 means Saturday; the special value 7 means each 7 days, irrespectively of weekday. Defaults to 0 if the I<weekday> argument is omitted.
es: Rota los archivos de registro cada I<dia_de_semana>, o cada vez que la fecha de rotación tenga lugar siete o más días después de la anterior, independientemente de la hora exacta. La forma en que se interpreta I<día_de_semana> es la siguiente: 0 representa al domingo, 1 representa al lunes, mientras que \&.\|.\|.\|\&, 6 denota el sábado. El valor 7 es un valor especial que significa "cada 7 días" independientemente del día que coincida. Si no se indica ningún número, se sobreentiende 0 por defecto.

source: Log files are rotated the first time B<logrotate> is run in a month (this is normally on the first day of the month).
es: Los archivos de registro se cambian la primera vez que se ejecuta B<logrotate> en un mes (normalmente el primer día del mes).

source: Log files are rotated if the current year is not the same as the last rotation.
es: Hace que se roten los archivos de registro siempre y cuando el año actual sea distinto del de la anterior rotación.

source: B<size >I<size>
es: B<size >I<tamaño>

source: Log files are rotated only if they grow bigger than I<size> bytes. If I<size> is followed by I<k>, the size is assumed to be in kilobytes. If I<M> is used, the size is in megabytes, and if I<G> is used, the size is in gigabytes. So I<size 100>, I<size 100k>, I<size 100M> and I<size 100G> are all valid. This option is mutually exclusive with the time interval options, and it causes log files to be rotated without regard for the last rotation time, if specified after the time criteria (the last specified option takes the precedence).
es: Rota los archivos de registro solo si su tamaño es mayo de I<tamaño>. Si I<tamaño> va seguido de I<k> se entiende dicho tamaño expresado en kilobytes, mientras que si es una I<M> o una I<G> se interprete an megas o gigas respectivamente. Por ejemplo: I<tamaño 100>, I<tamaño 100k>, I<tamaño 100M> o I<tamaño 100G> sería expresiones válidas para indicar dicha información. Esta opción es mutuamente excluyente de la del intervalo de tiempo ya que si indica ambas a la vez, se rotan los archivos independientemente del tiempo transcurrido desde la última vez siempre que se indique después de la del intervalo temporal. La última opción prevalece siempre sobre las anteriores.

source: File selection
es: Selección de archivos

source: If the log file is missing, go on to the next one without issuing an error message. See also B<nomissingok>.
es: Si no existe el archivo de registro, continúa la ejecución sin emitir ningún mensaje de error. Consulte B<nomissingok>.

source: If a log file does not exist, issue an error. This is the default.
es: Si un archivo de registro no existe, emite un mensaje de error. Este es el comportamiento por defecto.

source: Rotate the log file even if it is empty, overriding the B<notifempty> option (B<ifempty> is the default).
es: Rota el archivo de registro incluso si está vacío, anulando la opción B<notifempty>. Este es el comportamiento por defecto.

source: Do not rotate the log if it is empty (this overrides the B<ifempty> option).
es: No rota el archivo de registro si está vacío (esto anula la opción B<ifempty>).

source: B<minage> I<count>
es: B<minage> I<veces>

source: Do not rotate logs which are less than E<lt>countE<gt> days old.
es: No rota los archivos de registro si tienen menos de E<lt>vecesE<gt> días.

source: B<maxage> I<count>
es: B<maxage> I<días>

source: Remove rotated logs older than E<lt>countE<gt> days. The age is only checked if the logfile is to be rotated. B<rotate -1> does not hinder removal. The files are mailed to the configured address if B<maillast> and B<mail> are configured.
es: Elimina los archivos de registro rotados con una antigüedad superior a E<lt>díasE<gt>. La antigüedad solo se comprueba si se va a rotar el archivo. B<rotate -1> no evita el borrado. Los archivos se envían por correo electrónico a la dirección configurada en B<maillast> y B<mail>.

source: B<minsize> I<size>
es: B<minsize> I<tamaño>

source: Log files are rotated when they grow bigger than I<size> bytes, but not before the additionally specified time interval (B<daily>, B<weekly>, B<monthly>, or B<yearly>). The related B<size> option is similar except that it is mutually exclusive with the time interval options, and it causes log files to be rotated without regard for the last rotation time, if specified after the time criteria (the last specified option takes the precedence). When B<minsize> is used, both the size and timestamp of a log file are considered.
es: Rota los archivos de registro cuando su tamaño sobrepasa I<tamaño> bytes, pero nunca antes del intervalo de tiempo configurado (B<daily>, B<weekly>, B<monthly>, o B<yearly>). La opción B<size> es similar salvo que, en ese caso, era mutuamente excluyente con las opciones de intervalo temporal y los archivos se rotaba sin tener en cuenta el tiempo transcurrido desde la última rotación si se definía esta opcion después de definir el criterio temporal (recuerde que prevalece la última opción que se ponga). Si se emplea B<minsize> se consideran tanto el tamaño como el tiempo transcurrido desde la última rotación.

source: B<maxsize> I<size>
es: B<maxsize> I<tamaño>
