Repository: sebras/manpages-l10n
Catalog: po/*/man8/lspci.8.po
Languages: pl

source: The behavior of the library is controlled by several named parameters. This option allows to set the value of any of the parameters. Use B<-O help> for a list of known parameters and their default values.
pl: Zachowanie biblioteki jest kontrolowane przez kilka nazwanych parametrów. Opcja pozwala ustawić wartość dowolnych z nich. Aby poznać rozpoznawane parametry i ich domyślne wartości proszę użyć opcji B<-O help>.

source: Kernel module reporting that it is capable of handling the device (optional, Linux only).
pl: Moduł jądra, który wskazuje że jest zdolny obsłużyć to urządzenie (opcjonalny, tylko Linux).

source: A list of all known PCI ID's (vendors, devices, classes and subclasses). Maintained at http://pciids.sourceforge.net/, use the B<update-pciids> utility to download the most recent version.
pl: Lista wszystkich znanych identyfikatorów PCI (dostawcy, urządzenia, klasy i podklasy). Zarządzana na stronie http://pciids.sourceforge.net/, proszę użyć narzędzia B<update-pciids> aby pobrać najnowszą wersję.
