Repository: sebras/manpages-l10n
Catalog: po/*/man8/lspci.8.po
Languages: pl

source: The PCI Utilities
pl: Narzędzia PCI

source: NAME
pl: NAZWA

source: lspci - list all PCI devices
pl: lspci - wypisuje wszystkie urządzenia PCI

source: SYNOPSIS
pl: SKŁADNIA

source: B<lspci> [B<options>]
pl: B<lspci> [opcje]

source: DESCRIPTION
pl: OPIS

source: B<lspci> is a utility for displaying information about PCI buses in the system and devices connected to them.
pl: B<lspci> jest narzędziem do wyświetlania informacji o wszystkich szynach PCI systemu i podłączonych do nich urządzeniach.

source: By default, it shows a brief list of devices. Use the options described below to request either a more verbose output or output intended for parsing by other programs.
pl: Domyślnie, pokazuje zwięzłą listę urządzeń. Używając opcji opisanych poniżej, można uzyskać bardziej szczegółowy wynik lub wyjście odpowiednie do przetworzenia przez inne programy.

source: If you are going to report bugs in PCI device drivers or in I<lspci> itself, please include output of "lspci -vvx" or even better "lspci -vvxxx" (however, see below for possible caveats).
pl: Aby zgłaszać błędy w sterownikach PCI lub w samym B<lspci>, proszę dołączyć wynik wywołania "lspci -vvx", a jeszcze lepiej "lspci -vvxxx" (uwzględniając poniższe, ewentualne zastrzeżenia).

source: Some parts of the output, especially in the highly verbose modes, are probably intelligible only to experienced PCI hackers. For exact definitions of the fields, please consult either the PCI specifications or the B<header.h> and B</usr/include/linux/pci.h> include files.
pl: Niektóre części wyniku, szczególnie w bardzo szczegółowych trybach, są zrozumiałe prawdopodobnie jedynie dla doświadczonych hakerów PCI. Aby poznać dokładne definicje pól, proszę zapoznać się ze specyfikacjami PCI lub plikami I<header.h> i I</usr/include/linux/pci.h>.

source: Access to some parts of the PCI configuration space is restricted to root on many operating systems, so the features of I<lspci> available to normal users are limited. However, I<lspci> tries its best to display as much as available and mark all other information with I<E<lt>access deniedE<gt>> text.
pl: Dostęp do niektórych części przestrzeni konfiguracyjnej PCI, w wielu systemach operacyjnych jest ograniczony do roota, zatem funkcje I<lspci> dostępne zwykłym użytkownikom są ograniczone. Program stara się jednak wyświetlić tak dużo informacji, jak tylko jest to możliwe oraz oznaczyć pozostałe informacje tekstem I<E<lt>access deniedE<gt>> (dostęp zastrzeżony).

source: OPTIONS
pl: OPCJE

source: Basic display modes
pl: Podstawowe tryby wyświetlania

source: Dump PCI device data in a backward-compatible machine readable form. See below for details.
pl: Zrzuca dane urządzenia PCI w kompatybilnej wstecznie postaci czytelnej maszynowo. Patrz niżej.

source: Dump PCI device data in a machine readable form for easy parsing by scripts. See below for details.
pl: Zrzuca dane urządzenia PCI w postaci czytelnej maszynowo, do łatwego przetwarzania przez skrypty. Patrz niżej.

source: Show a tree-like diagram containing all buses, bridges, devices and connections between them.
pl: Pokazuje drzewiasty diagram zawierający wszystkie szyny, mosty, urządzenia i połączenia między nimi.

source: Display options
pl: Opcje wyświetlania

source: Be verbose and display detailed information about all devices.
pl: Wyświetla szczegółowe informacje o wszystkich urządzeniach.

source: Be very verbose and display more details. This level includes everything deemed useful.
pl: Wyświetla jeszcze więcej szczegółów. Ten poziom obejmuje wszystko co może okazać się przydatne.

source: Be even more verbose and display everything we are able to parse, even if it doesn't look interesting at all (e.g., undefined memory regions).
pl: Poziom najbardziej szczegółowy - wyświetlane jest wszystko co program jest w stanie przetworzyć, nawet jeśli wygląda na to całkowicie nieprzydatne (np. niezdefiniowane obszary pamięci).

source: Show kernel drivers handling each device and also kernel modules capable of handling it. Turned on by default when B<-v> is given in the normal mode of output. (Currently works only on Linux with kernel 2.6 or newer.)
pl: Pokazuje sterowniki jądra obsługujące każde z urządzeń oraz moduły jądra zdolne je obsłużyć. Włączone domyślnie, gdy podana jest opcja B<-v> w normalnym trybie wyniku (obecnie działa wyłącznie z jądrem Linux 2.6 i nowszym).

source: Show hexadecimal dump of the standard part of the configuration space (the first 64 bytes or 128 bytes for CardBus bridges).
pl: Pokazuje szesnastkowy zrzut standardowej części standardowej przestrzeni konfiguracyjnej (pierwsze 64 bajty lub 128 bajtów w przypadku mostków CardBus).

source: Show hexadecimal dump of the whole PCI configuration space. It is available only to root as several PCI devices B<crash> when you try to read some parts of the config space (this behavior probably doesn't violate the PCI standard, but it's at least very stupid). However, such devices are rare, so you needn't worry much.
pl: Pokazuje szesnastkowy zrzut całej przestrzeni konfiguracyjnej PCI. Dostępne tylko dla roota, gdyż część urządzeń PCI B<załamuje się> gdy próbuje się odczytać niezdefiniowane obszary przestrzeni konfiguracyjnej (zachowanie to prawdopodobnie nie narusza standardu PCI, lecz jest co najmniej bardzo głupie). Ponieważ jednak takie urządzenia są rzadkością, nie należy się tym zbytnio przejmować.

source: Show hexadecimal dump of the extended (4096-byte) PCI configuration space available on PCI-X 2.0 and PCI Express buses.
pl: Pokazuje szesnastkowy zrzut rozszerzonej (4096-bajtowej) przestrzeni konfiguracyjnej PCI dostępnej w szynach PCI-X 2.0 i PCI Express.

source: Bus-centric view. Show all IRQ numbers and addresses as seen by the cards on the PCI bus instead of as seen by the kernel.
pl: Widok szynocentryczny. Pokazuje wszystkie numery IRQ i adresy widziane przez karty na szynie PCI, zamiast punktu widzenia jądra.

source: Always show PCI domain numbers. By default, lspci suppresses them on machines which have only domain 0.
pl: Zawsze wyświetla liczby domen PCI. Domyślnie, lspci nie czyni tego w przypadku komputerów posiadających wyłącznie domenę 0.

source: Identify PCI devices by path through each bridge, instead of by bus number.
pl: Identyfikuje urządzenia PCI przez ścieżkę każdego mostu, zamiast za pomocą numeru szyny.

source: Identify PCI devices by path through each bridge, showing the bus number as well as the device number.
pl: Identyfikuje urządzenia PCI przez ścieżkę każdego mostu, pokazując zarówno numer szyny jak i numer urządzenia.

source: Options to control resolving ID's to names
pl: Opcje do kontroli przetwarzania identyfikatorów na nazwy

source: Show PCI vendor and device codes as numbers instead of looking them up in the PCI ID list.
pl: Pokazuje dystrybutora PCI oraz kody urządzenia jako numery, bez rozwijania ich w bazie danych ID PCI.

source: Show PCI vendor and device codes as both numbers and names.
pl: Pokazuje dystrybutora PCI oraz kody urządzenia jako numery oraz nazwy.

source: Use DNS to query the central PCI ID database if a device is not found in the local B<pci.ids> file. If the DNS query succeeds, the result is cached in B<~/.pciids-cache> and it is recognized in subsequent runs even if B<-q> is not given any more. Please use this switch inside automated scripts only with caution to avoid overloading the database servers.
pl: Używa DNS do odpytania głównej bazy identyfikatorów PCI, jeśli urządzenie nie zostanie znalezione w lokalnym pliku I<pci.ids>. Jeśli się to powiedzie, wynik jest buforowany w I<~/.pciids-cache> i jest rozpoznawany w kolejnych uruchomieniach programu nawet, jeśli nie poda się opcji B<-q> ponownie. Proszę rozważnie używać tego przełącznika w automatycznych skryptach, aby zapobiec przeciążeniu serwerów z bazą danych.

source: Same as B<-q>, but the local cache is reset.
pl: To samo co B<-q>, ale lokalny bufor podręczny jest resetowany.

source: Query the central database even for entries which are recognized locally. Use this if you suspect that the displayed entry is wrong.
pl: Odpytuje centralną bazę danych nawet, jeśli wpisy są rozpoznawane lokalnie. Proszę użyć tej opcji, w przypadku podejrzenia, że wyświetlany wpis jest nieprawidłowy.

source: Options for selection of devices
pl: Opcje do wybierania urządzeń

source: B<-s [[[[E<lt>domainE<gt>]:]E<lt>busE<gt>]:][E<lt>deviceE<gt>][.[E<lt>funcE<gt>]]>
pl: B<-s >[[[[I<E<lt>domenaE<gt>>]B<:>]I<E<lt>szynaE<gt>>]B<:>][I<E<lt>urządzenieE<gt>>][B<.>[I<E<lt>funkcjaE<gt>>]]

source: Show only devices in the specified domain (in case your machine has several host bridges, they can either share a common bus number space or each of them can address a PCI domain of its own; domains are numbered from 0 to ffff), bus (0 to ff), device (0 to 1f) and function (0 to 7). Each component of the device address can be omitted or set to "*", both meaning "any value". All numbers are hexadecimal. E.g., "0:" means all devices on bus 0, "0" means all functions of device 0 on any bus, "0.3" selects third function of device 0 on all buses and ".4" shows only the fourth function of each device.
pl: Pokazuje urządzenia tylko w określonej: domenie (w przypadku jeśli ten komputer posiada kilka mostków głównych, mogą one albo współdzielić wspólną przestrzeń numerów szyn, albo każdy z nich może adresować swoją domenę PCI; domeny są numerowane od 0 do ffff), szynie (0 do ff), urządzeniu (0 do 1f) i funkcji (0 do 7). Każdy komponent adresu urządzenia można pominąć lub oznaczyć gwiazdką, co oznacza dowolną wartość. Wszystkie numery są szesnastkowe. Np. "0:" oznacza wszystkie urządzenia na szynie 0, "0" oznacza wszystkie funkcje urządzenia 0 na dowolnej szynie, "0.3" wybiera trzecią funkcję urządzenia 0 na wszystkich szynach, a ".4" pokazuje czwartą funkcję każdego urządzenia.

source: Other options
pl: Inne opcje

source: B<-i E<lt>fileE<gt>>
pl: B<-i> I<E<lt>plikE<gt>>

source: Use B<E<lt>fileE<gt>> as the PCI ID list instead of /usr/share/hwdata/pci.ids.
pl: Używa I<E<lt>plikuE<gt>> jako listy identyfikatorów PCI, zamiast pliku /usr/share/hwdata/pci.ids.

source: B<-p E<lt>fileE<gt>>
pl: B<-p> I<E<lt>plikE<gt>>

source: Use B<E<lt>fileE<gt>> as the map of PCI ID's handled by kernel modules. By default, lspci uses /lib/modules/I<kernel_version>/modules.pcimap. Applies only to Linux systems with recent enough module tools.
pl: Używa I<E<lt>plikuE<gt>> jako mapy identyfikatorów PCI obsługiwanych przez moduły jądra. Domyślnie, lspci używa /lib/modules/I<wersja_jądra>/modules.pcimap. Dotyczy tylko systemów Linux z odpowiednio nowymi narzędziami modułów.

source: Shows I<lspci> version. This option should be used stand-alone.
pl: Wyświetla wersję B<lspci>. Opcja ta powinna być używana samodzielnie.

source: PCI access options
pl: Opcje dostępu do PCI

source: The PCI utilities use the PCI library to talk to PCI devices (see B<pcilib>(7) for details). You can use the following options to influence its behavior:
pl: Narzędzia PCI używają biblioteki PCI do porozumiewania się z urządzeniami PCI (patrz B<pcilib>(7), aby dowiedzieć się więcej). Aby wpłynąć na jej zachowanie można użyć następujących opcji:

source: B<-A E<lt>methodE<gt>>
pl: B<-A> I<E<lt>metodaE<gt>>

source: The library supports a variety of methods to access the PCI hardware. By default, it uses the first access method available, but you can use this option to override this decision. See B<-A help> for a list of available methods and their descriptions.
pl: Biblioteka obsługuje wiele metod dostępu do sprzętu PCI. Domyślnie używa pierwszej dostępnej metody, ale można użyć tej opcji, aby przesłonić tę decyzję. Dostępne metody wraz z ich opisami można uzyskać za pomocą opcji B<-A help>.

source: B<-O E<lt>paramE<gt>=E<lt>valueE<gt>>
pl: B<-O> I<E<lt>parametrE<gt>>B<=>I<E<lt>wartośćE<gt>>

source: The behavior of the library is controlled by several named parameters. This option allows one to set the value of any of the parameters. Use B<-O help> for a list of known parameters and their default values.
pl: Zachowanie biblioteki jest kontrolowane przez kilka nazwanych parametrów. Opcja pozwala ustawić wartość dowolnych z nich. Aby poznać rozpoznawane parametry i ich domyślne wartości proszę użyć opcji B<-O help>.

source: Use direct hardware access via Intel configuration mechanism 1. (This is a shorthand for B<-A intel-conf1>.)
pl: Używa bezpośredniego dostępu do sprzętu poprzez mechanizm 1 konfiguracji Intela (jest to skrócona postać B<-A intel-conf1>).

source: Use direct hardware access via Intel configuration mechanism 2. (This is a shorthand for B<-A intel-conf2>.)
pl: Używa bezpośredniego dostępu do sprzętu poprzez mechanizm 2 konfiguracji Intela (jest to skrócona postać B<-A intel-conf2>).

source: B<-F E<lt>fileE<gt>>
pl: B<-F> I<E<lt>plikE<gt>>

source: Instead of accessing real hardware, read the list of devices and values of their configuration registers from the given file produced by an earlier run of lspci -x. This is very useful for analysis of user-supplied bug reports, because you can display the hardware configuration in any way you want without disturbing the user with requests for more dumps.
pl: Zamiast uzyskiwać dostęp do rzeczywistego sprzętu, odczytuje listę urządzeń i wartości ich rejestrów konfiguracyjnych z podanego pliku, uzyskanego wcześniej poleceniem lspci -x. Jest to przydatne do analizowania przekazanych przez użytkowników raportów o błędach, gdyż można wyświetlić konfigurację sprzętową w dowolnym stylu bez męczenia użytkownika o nowe zrzuty.

source: Increase debug level of the library.
pl: Zwiększa poziom debugowania w bibliotece.

source: MACHINE READABLE OUTPUT
pl: WYNIK ODCZYTYWALNY MASZYNOWO

source: If you intend to process the output of lspci automatically, please use one of the machine-readable output formats (B<-m>, B<-vm>, B<-vmm>) described in this section. All other formats are likely to change between versions of lspci.
pl: Jeśli zamiarem użytkownika jest automatyczne przetworzenie wyjścia lspci, należy użyć jednego z formatów wyniku odczytywalnego maszynowo (B<-m>, B<-vm>, B<-vmm>) opisanego w tym rozdziale. Wszystkie inne formaty mogą się zmienić pomiędzy wersjami lspci.

source: All numbers are always printed in hexadecimal. If you want to process numeric ID's instead of names, please add the B<-n> switch.
pl: Wszystkie liczby są wyświetlane zawsze w postaci szesnastkowej. Aby przetworzyć identyfikatory numeryczne zamiast nazw, proszę dodać przełącznik B<-n>.

source: Simple format (-m)
pl: Format prosty (-m)

source: In the simple format, each device is described on a single line, which is formatted as parameters suitable for passing to a shell script, i.e., values separated by whitespaces, quoted and escaped if necessary. Some of the arguments are positional: slot, class, vendor name, device name, subsystem vendor name and subsystem name (the last two are empty if the device has no subsystem); the remaining arguments are option-like:
pl: W formacie prostym, każde urządzenie jest opisane w pojedynczym wierszu, który jest sformatowany jako parametry odpowiednie do podania do skryptu powłoki tzn. wartości są oddzielone białymi znakami, jeśli to konieczne zastosowane jest cytowanie. Część argumentów jest pozycyjna: slot, klasa, nazwa dostawcy, nazwa urządzenia, nazwa dostawcy podsystemu i nazwa podsystemu (dwie ostatnie są puste, jeśli urządzenie nie ma podsystemu); pozostałe argumenty wyglądają jak opcje:

source: B<-r>I<rev>
pl: B<-r>I<rew>

source: Revision number.
pl: Numer rewizji.

source: B<-p>I<progif>
pl: B<-p>I<intprog>

source: Programming interface.
pl: Interfejs programistyczny.

source: The relative order of positional arguments and options is undefined. New options can be added in future versions, but they will always have a single argument not separated from the option by any spaces, so they can be easily ignored if not recognized.
pl: Względna kolejność argumentów pozycyjnych i opcji jest niezdefiniowana. W przyszłych wersjach mogą zostać dodane nowe opcje, ale będą one zawsze posiadały pojedynczy argument, nieoddzielony od opcji spacjami - dzięki czemu mogą być łatwo zignorowane, jeśli nie zostaną rozpoznane.

source: Verbose format (-vmm)
pl: Format szczegółowy (-vmm)

source: The verbose output is a sequence of records separated by blank lines. Each record describes a single device by a sequence of lines, each line containing a single `I<tag>: I<value>' pair. The I<tag> and the I<value> are separated by a single tab character. Neither the records nor the lines within a record are in any particular order. Tags are case-sensitive.
pl: Format szczegółowy jest sekwencją rekordów oddzielonych pustymi wierszami. Każdy rekord opisuje pojedyncze urządzenie za pomocą sekwencji wierszy, a każdy wiersz zawiera pojedynczą parę "I<znacznik>: I<wartość>". I<Znacznik> i I<wartość> są oddzielone pojedynczym znakiem tabulacji. Rekordy ani wiersze wewnątrz rekordów nie posiadają określonej kolejności. W znacznikach istotna jest wielkość liter.

source: The following tags are defined:
pl: Zdefiniowano następujące znaczniki:

source: The name of the slot where the device resides ([I<domain>:]I<bus>:I<device>.I<function>). This tag is always the first in a record.
pl: Nazwa slotu, w którym istnieje urządzenie ([I<domena>:]I<szyna>:I<urządzenie>.I<funkcja>). Ten znacznik jest zawsze pierwszy w rekordzie.

source: Name of the class.
pl: Nazwa klasy.

source: Name of the vendor.
pl: Nazwa dostawcy.

source: Name of the device.
pl: Nazwa urządzenia.

source: Name of the subsystem vendor (optional).
pl: Nazwa dostawcy podsystemu (opcjonalna).

source: Name of the subsystem (optional).
pl: Nazwa podsystemu (opcjonalna).

source: The physical slot where the device resides (optional, Linux only).
pl: Fizyczne gniazdo, w którym znajduje się urządzenie (opcjonalne, tylko Linux).

source: Revision number (optional).
pl: Numer rewizji (opcjonalny).

source: Programming interface (optional).
pl: Interfejs programistyczny (opcjonalny).

source: Kernel driver currently handling the device (optional, Linux only).
pl: Sterownik jądra, który aktualnie obsługuje urządzenie (opcjonalny, tylko Linux).

source: Kernel module reporting that it is capable of handling the device (optional, Linux only). Multiple lines with this tag can occur.
pl: Moduł jądra, który wskazuje że jest zdolny obsłużyć to urządzenie (opcjonalny, tylko Linux). Może się pojawić wiele wierszy z tym znacznikiem.

source: NUMA node this device is connected to (optional, Linux only).
pl: Węzeł NUMA, z którym połączone jest urządzenie (opcjonalne, tylko Linux).

source: IOMMU group that this device is part of (optional, Linux only).
pl: Grupa IOMMU, której częścią jest urządzenie (opcjonalne, tylko Linux).

source: New tags can be added in future versions, so you should silently ignore any tags you don't recognize.
pl: W kolejnych wersjach mogą zostać dodane nowe znaczniki, dlatego należy po cichu ignorować te, które nie zostaną rozpoznane.

source: Backward-compatible verbose format (-vm)
pl: Wstecznie kompatybilny format szczegółowy (-vm)

source: In this mode, lspci tries to be perfectly compatible with its old versions. It's almost the same as the regular verbose format, but the B<Device> tag is used for both the slot and the device name, so it occurs twice in a single record. Please avoid using this format in any new code.
pl: W tym trybie, lspci stara się być dokładnie kompatybilnym ze starszymi wersjami programu. Jest to prawie ten sam format co zwykły format szczegółowy, jednak znacznik B<Device> jest używany zarówno jako nazwa slotu, jak i nazwa urządzenia, tak więc pojawia się dwukrotnie w pojedynczym rekordzie. Proszę nie używać tego formatu w nowo tworzonym kodzie.

source: FILES
pl: PLIKI

source: B</usr/share/hwdata/pci.ids>
pl: I</usr/share/hwdata/pci.ids>

source: A list of all known PCI ID's (vendors, devices, classes and subclasses). Maintained at https://pci-ids.ucw.cz/, use the B<update-pciids> utility to download the most recent version.
pl: Lista wszystkich znanych identyfikatorów PCI (dostawcy, urządzenia, klasy i podklasy). Zarządzana na stronie https://pci-ids.ucw.cz/, proszę użyć narzędzia B<update-pciids> aby pobrać najnowszą wersję.

source: B</usr/share/hwdata/pci.ids.gz>
pl: I</usr/share/hwdata/pci.ids.gz>

source: If lspci is compiled with support for compression, this file is tried before pci.ids.
pl: Jeśli lspci jest skompilowane z obsługą kompresji, to ten plik jest wypróbowywany przed pci.ids.

source: B<~/.pciids-cache>
pl: I<~/.pciids-cache>

source: All ID's found in the DNS query mode are cached in this file.
pl: Wszystkie identyfikatory znalezione w trybie odpytywania DNS są przechowywane w tym pliku.

source: BUGS
pl: BŁĘDY

source: Sometimes, lspci is not able to decode the configuration registers completely. This usually happens when not enough documentation was available to the authors. In such cases, it at least prints the B<E<lt>?E<gt>> mark to signal that there is potentially something more to say. If you know the details, patches will be of course welcome.
pl: Czasami lspci nie jest w stanie całkowicie zdekodować rejestrów konfiguracyjnych. Zdarza się to zwykle gdy autorzy nie posiadali wystarczającej dokumentacji. W takich przypadkach wyświetlane jest przynajmniej B<E<lt>?E<gt>>, aby zasygnalizować, że być może da się wydobyć więcej informacji. Autorzy chętnie przyjmą łatki, jeśli ktoś zechce uzupełnić te braki.

source: Access to the extended configuration space is currently supported only by the B<linux_sysfs> back-end.
pl: Dostęp do rozszerzonej przestrzeni konfiguracyjnej jest obecnie obsługiwany wyłącznie przez backend B<linux-sysfs>.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR

source: The PCI Utilities are maintained by Martin Mares E<lt>mj@ucw.czE<gt>.
pl: Narzędziami PCI opiekuje się Martin Mares E<lt>mj@ucw.czE<gt>.

source: 31 May 2020
pl: 31 maja 2020

source: B<-d [E<lt>vendorE<gt>]:[E<lt>deviceE<gt>][:E<lt>classE<gt>]>
pl: B<-d >[I<E<lt>dostawcaE<gt>>]B<:>[I<E<lt>urządzenieE<gt>>][B<:>I<E<lt>klasaE<gt>>]

source: Show only devices with specified vendor, device and class ID. The ID's are given in hexadecimal and may be omitted or given as "*", both meaning "any value".
pl: Pokazuje tylko urządzenia o określonym ID dystrubutora, urządzenia i klasy. Obydwa identyfikatory są podawane szesnastkowo i mogą być pominięte lub określone jako "*" (w obu przypadkach oznacza to "dowolne").

source: Use B<E<lt>fileE<gt>> as the PCI ID list instead of /usr/share/misc/pci.ids.
pl: Używa I<E<lt>plikuE<gt>> jako listy identyfikatorów PCI, zamiast pliku /usr/share/misc/pci.ids.

source: Invoke bus mapping mode which performs a thorough scan of all PCI devices, including those behind misconfigured bridges, etc. This option gives meaningful results only with a direct hardware access mode, which usually requires root privileges. Please note that the bus mapper only scans PCI domain 0.
pl: Przywołuje tryb mapowania szyny, który przeprowadza dokładne skanowanie wszystkich urządzeń PCI, w tym źle skonfigurowanych mostków itp. Ta opcja daje przydatne rezultaty wyłącznie w trybie bezpośredniego dostępu do sprzętu, który zazwyczaj wymaga uprawnień roota. Proszę zauważyć, że skanowana jest tylko domena 0 PCI.

source: B</usr/share/misc/pci.ids>
pl: I</usr/share/misc/pci.ids>

source: B</usr/share/misc/pci.ids.gz>
pl: I</usr/share/misc/pci.ids.gz>

source: Use B<E<lt>fileE<gt>> as the PCI ID list instead of /usr/share/pci.ids.
pl: Używa I<E<lt>plikuE<gt>> jako listy identyfikatorów PCI, zamiast pliku /usr/share/pci.ids.

source: B</usr/share/pci.ids>
pl: I</usr/share/pci.ids>

source: B</usr/share/pci.ids.gz>
pl: I</usr/share/pci.ids.gz>

source: 17 November 2017
pl: 17 listopada 2017
