Repository: sebras/manpages-l10n
Catalog: po/*/man8/lsusb.8.po
Languages: de, fr, pl

source: Linux USB Utilities
de: Linux USB-Dienstprogramme
fr: Utilitaires USB Linux
pl: Linuksowe narzędzia USB

source: NAME
de: BEZEICHNUNG
fr: NOM
pl: NAZWA

source: lsusb - list USB devices
de: lsusb - USB-Geräte auflisten
fr: lsusb - Lister les périphériques USB
pl: lsusb - wypisuje urządzenia USB

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA

source: B<lsusb> [ I<options> ]
de: B<lsusb> [ I<Optionen> ]
pl: B<lsusb> [ I<opcje> ]

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS

source: B<lsusb> is a utility for displaying information about USB buses in the system and the devices connected to them.
pl: B<lsusb> jest narzędziem do wyświetlania informacji o systemowych szynach USB i podłączonych do nich urządzeniach.

source: OPTIONS
de: OPTIONEN
pl: OPCJE

source: B<-v, --verbose>
pl: B<-v>, B<--verbose>

source: B<-s> [[I<bus>]B<:>][I<devnum>]
de: B<-s> [[I<Bus>]B<:>][I<Gerätenummer>]
fr: B<-s> [[I<bus>]B<:>][I<num_périphérique>]
pl: B<-s> [[I<szyna>]B<:>][I<numer-urządzenia>]

source: Show only devices in specified I<bus> and/or I<devnum.> Both ID's are given in decimal and may be omitted.
pl: Pokazuje jedynie urządzenia z określonej I<szyny> lub o podanym I<numerze-urządzenia>. Oba identyfikatory są liczbami dziesiętnymi i można je pominąć.

source: B<-d> [I<vendor>]B<:>[I<product>]
de: B<-d> [I<Anbieter>]B<:>[I<Produkt>]
fr: B<-d> [I<vendeur>]B<:>[I<produit>]
pl: B<-d> [I<dostawca>]B<:>[I<produkt>]

source: Show only devices with the specified vendor and product ID. Both ID's are given in hexadecimal.
de: zeigt nur die Geräte mit der angegebenen Anbieter- und Produktkennung an. Beide Kennungen werden in hexadezimaler Notation angegeben.
fr: N'afficher que les périphériques avec le fabricant et l'ID du produit spécifiés. Les deux ID sont donnés en hexadécimal.
pl: Pokazuje jedynie urządzenia o określonym identyfikatorze I<dostawcy> i I<produktu>. Obie wartości są liczbami szesnastkowymi.

source: B<-D >I<device>
de: B<-D >I<Gerät>
fr: B<-D >I<périphérique>
pl: B<-D >I<urządzenie>

source: Do not scan the /dev/bus/usb directory, instead display only information about the device whose device file is given. The device file should be something like /dev/bus/usb/001/001. This option displays detailed information like the B<v> option; you must be root to do this.
de: liest das Verzeichnis /dev/bus/usb nicht ein, sondern zeigt nur Informationen zu dem Gerät an, dessen Gerätedatei angegeben ist. Die Gerätedatei sollte dem Schema /dev/bus/usb/001/001 folgen. Diese Option zeigt detaillierte Informationen wie mit der Option B<v> an; um dies tun zu können, müssen Sie über Root-Rechte verfügen.
fr: Ne pas scanner le répertoire /dev/bus/usb, mais afficher seulement les informations à propos du périphérique dont le fichier de périphérique est donné. Le périphérique devrait ressembler à quelque chose comme /dev/bus/usb/001/001. Cette option affiche des informations détaillées comme l'option B<v> ; mais vous devez avoir les droits superutilisateur pour l'utiliser.
pl: Nie przeszukuje katalogu /dev/bus/usb, lecz wyświetla informacje o urządzeniu jedynie z podanego pliku urządzenia. Plik urządzenia powinien być czymś w rodzaju /dev/bus/usb/001/001. Ta opcja wyświetla szczegółowe informacje, podobnie jak B<-v> i z tego powodu wymaga uprawnień administracyjnych.

source: B<-V, --version>
pl: B<-V>, B<--version>

source: Print version information on standard output, then exit successfully.
de: schreibt die Versionsnummer in die Standardausgabe und beendet das Programm erfolgreich.
fr: Afficher la version sur la sortie standard, puis quitter.
pl: Wypisuje informacje o wersji na standardowe wyjście i kończy się z powodzeniem.

source: RETURN VALUE
de: RÜCKGABEWERT
fr: VALEUR RENVOYÉE
pl: WARTOŚĆ ZWRACANA

source: If the specified device is not found, a non-zero exit code is returned.
de: Falls das angegebene Gerät nicht gefunden wird, dann wird ein von Null verschiedener Exit-Code zurückgegeben.
fr: Si le périphérique indiqué n'est pas trouvé, un code de retour différent de zéro est renvoyé.
pl: Jeśli nie odnaleziono podanego urządzenia, zwracana jest wartość niezerowa.

source: FILES
pl: PLIKI

source: A list of all known USB ID's (vendors, products, classes, subclasses and protocols).
pl: Lista wszystkich znanych identyfikatorów USB (dostawcy, produkty, klasy, podklasy i protokoły).

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
pl: ZOBACZ TAKŻE

source: AUTHOR
de: AUTOR
fr: AUTEUR
pl: AUTOR

source: 6 May 2009
pl: 6 maja 2009

source: Tells I<lsusb> to be verbose and display detailed information about the devices shown. This includes configuration descriptors for the device's current speed. Class descriptors will be shown, when available, for USB device classes including hub, audio, HID, communications, and chipcard.
pl: Powoduje, że program wypisuje szczegółowe informacje o pokazywanych urządzeniach. Są to m.in. opisy konfiguracji do aktualnej szybkości urządzenia. W przypadku urządzeń USB takich jak koncentratory, urządzeń: audio, peryferyjnych, komunikacyjnych i kart elektronicznych, zostaną pokazane również opisy klas, o ile będą dostępne.

source: Tells I<lsusb> to dump the physical USB device hierarchy as a tree. This overrides the B<v> option.
pl: Nakazuje programowi B<lsusb> zrzucić fizyczną hierarchię urządzenia USB jako drzewo. Przesłania opcję B<-v>.

source: 11 February 2019
de: 11. Februar 2019
fr: 11 février 2019

source: B<lsusb> is a utility for displaying information about USB buses in the system and the devices connected to them. It uses udev's hardware database to associate a full human-readable name to the vendor ID and the product ID.
de: B<lsusb> ist ein Dienstprogramm zum Anzeigen von Informationen zu USB-Bussen im System und den Geräten, die mit ihnen verbunden sind. Es verwendet die Hardware-Datenbank von Udev, um der Anbieter- und Produktkennung einen menschenlesbaren Namen zuzuordnen.
fr: B<lsusb> est un utilitaire pour afficher des informations sur les bus USB et les périphériques qui y sont connectés. Il utilise la base de données udev du matériel pour associer un nom lisible-pour-l'humain à l'identifiant du fabricant et l'identifiant du produit.

source: Tells I<lsusb> to be verbose and display detailed information about the devices shown. This includes configuration descriptors for the device's current speed. Class descriptors will be shown, when available, for USB device classes including hub, audio, HID, communications, and chipcard. Can be used with the B<t> option.
de: weist I<lsusb> an, ausführliche und detaillierte Informationen zu den aufgeführten Geräten anzuzeigen. Dies schließt Konfigurationsdeskriptoren für die aktuelle Geschwindigkeit des Gerätes ein. Klassendeskriptoren werden, sofern verfügbar, für USB-Geräteklassen wie Hub, Audio, HID, Kommunikation und Chipkarte angezeigt. Dies kann zusammen mit der Option B<t> verwendet werden.
fr: Dire à B<lsusb> d'être verbeux et d'afficher des informations détaillées sur les périphériques montrés. Cela comprend des descripteurs de configuration pour la vitesse actuelle du périphérique. Les descripteurs de classe seront montrés, si disponibles, pour les classes USB comprenant hub, audio, HD, communications et cartes à puce. Peut être utilisé avec l'option B<t>.

source: Show only devices in specified I<bus> and/or I<devnum>. Both IDs are given in decimal and may be omitted.
de: zeigt nur die in I<Bus> und/oder I<Gerätenummer> angegebenen Geräte an. Beide Kennungen werden dezimal angegeben und können auch weggelassen werden.
fr: N'afficher que les périphériques spécifiés dans I<bus> et/ou I<numéro_périphérique>. Les deux identifiants sont donnés en décimal et peuvent être omis.

source: Show only devices with the specified vendor and product ID. Both IDs are given in hexadecimal.
de: zeigt nur die Geräte mit der angegebenen Anbieter- und Produktkennung an. Beide Kennungen werden in hexadezimaler Notation angegeben.
fr: N'afficher que les périphériques correspondants au fabricant et à l'ID du produit spécifiés. Les deux ID sont donnés en hexadécimal.

source: Tells I<lsusb> to dump the physical USB device hierarchy as a tree. Verbosity can be increased twice with the B<v> option.
de: weist I<lsusb> an, die Hierarchie der physischen USB-Geräte in einer Baumansicht auszugeben. Die Ausführlichkeitsstufe kann durch zweimaliges Angeben der Option B<v> erhöht werden.
fr: Dire à B<lsusb> d'extraire la hiérarchie des périphériques USB sous forme d'un arbre. La verbosité peut être doublée avec l'option B<v>.

source: Show only devices in specified I<bus> and/or I<devnum>. Both ID's are given in decimal and may be omitted.
de: zeigt nur die in I<Bus> und/oder I<Gerätenummer> angegebenen Geräte an. Beide Kennungen werden dezimal angegeben und können auch weggelassen werden.
fr: N'afficher que les périphériques associés aux I<bus> et/ou I<num_périph> spécifiés. Les deux ID sont donnés en décimal et peuvent être omis.

source: Tells I<lsusb> to dump the physical USB device hierarchy as a tree. Verbosity can be increased twice with B<v> option.
de: weist I<lsusb> an, die Hierarchie der physischen USB-Geräte in einer Baumansicht auszugeben. Die Ausführlichkeitsstufe kann durch zweimaliges Angeben der Option B<v> erhöht werden.
fr: Dire à B<lsusb> d'extraire la hiérarchie des périphériques USB physiques sous la forme d'un arbre. La verbosité peut être doublée avec l'option B<v>.
