Repository: sebras/manpages-l10n
Catalog: po/*/man8/mke2fs.8.po
Languages: pl

source: December 2021
pl: grudzień 2021

source: E2fsprogs version 1.46.5
pl: E2fsprogs wersja 1.46.5

source: NAME
pl: NAZWA

source: mke2fs - create an ext2/ext3/ext4 file system
pl: mke2fs - tworzy linuksowy system plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<mke2fs -O journal_dev> [ B<-b> I<block-size> ] [ B<-L> I<volume-label> ] [ B<-n> ] [ B<-q> ] [ B<-v> ] I<external-journal> [ I<fs-size> ]
pl: B<mke2fs -O journal_dev> [ B<-b> I<rozmiar-bloku> ] [ B<-L> I<etykieta-woluminu> ] [ B<-n> ] [ B<-q> ] [ B<-v> ] I<zewnętrzny-dziennik> [ I<rozmiar-systemu-plików> ]

source: DESCRIPTION
pl: OPIS

source: B<mke2fs> is used to create an ext2, ext3, or ext4 file system, usually in a disk partition (or file) named by I<device>.
pl: B<mke2fs> jest używany do tworzenia systemów plików ext2, ext3 lub ext4 zwykle w partycji dyskowej (lub pliku) określonym przez I<urządzenie>.

source: The file system size is specified by I<fs-size>. If I<fs-size> does not have a suffix, it is interpreted as power-of-two kilobytes, unless the B<-b> I<blocksize> option is specified, in which case I<fs-size> is interpreted as the number of I<blocksize> blocks. If the fs-size is suffixed by 'k', 'm', 'g', 't' (either upper-case or lower-case), then it is interpreted in power-of-two kilobytes, megabytes, gigabytes, terabytes, etc. If I<fs-size> is omitted, B<mke2fs> will create the file system based on the device size.
pl: Rozmiar systemu plików należy podać jako I<rozmiar-systemu-plików>. Jeśli nie ma on przyrostka, jest interpretowany jako kilobajty będące potęgą dwójki, chyba że podano opcję B<-b> I<rozmiar-bloku>, gdy I<rozmiar-systemu-plików> jest interpretowany jako liczba bloków o I<rozmiarze-bloku>. Jeśli natomiast podano przyrostki "k", "m", "g", "t" (wielkimi lub małymi literami) to dana liczba jest interpretowana jako podana w będących potęgą dwójki kilobajtach, megabajtach, gigabajtach, terabajtach itd. Jeśli nie poda się I<rozmiaru-systemu-plików> to B<mke2fs> utworzy system plików na podstawie rozmiaru urządzenia.

source: If B<mke2fs> is run as B<mkfs.XXX> (i.e., B<mkfs.ext2>, B<mkfs.ext3>, or B<mkfs.ext4>) the option B<-t> I<XXX> is implied; so B<mkfs.ext3> will create a file system for use with ext3, B<mkfs.ext4> will create a file system for use with ext4, and so on.
pl: Jeśli uruchomi się B<mke2fs> jako B<mkfs.>I<XXX> (np. B<mkfs.ext2>, B<mkfs.ext3> lub B<mkfs.ext4.>) zastępuję to opcję B<-t> I<XXX>, tak więc B<mkfs.ext3> utworzy system plików ext3, B<mkfs.ext4> utworzy system plików ext4 itd.

source: The defaults of the parameters for the newly created file system, if not overridden by the options listed below, are controlled by the B</etc/mke2fs.conf> configuration file. See the B<mke2fs.conf>(5) manual page for more details.
pl: Domyślne parametry do nowo tworzonych systemów plików, jeśli nie są przesłonięte przez poniższe opcje, są kontrolowane przez plik konfiguracyjny B</etc/mke2fs.conf>. Strona podręcznika B<mke2fs.conf>(5) zawiera więcej szczegółów na ten temat.

source: OPTIONS
pl: OPCJE

source: B<-b>I< block-size>
pl: B<-b>I< rozmiar-bloku>

source: Check the device for bad blocks before creating the file system. If this option is specified twice, then a slower read-write test is used instead of a fast read-only test.
pl: Powoduje, że przed utworzeniem systemu plików, urządzenie zostanie sprawdzone w poszukiwaniu uszkodzonych bloków. Gdy opcja ta zostanie podana dwa razy, wykonany będzie wolniejszy test w trybie odczyt-zapis, zamiast szybkiego testu w trybie tylko-do-odczytu.

source: Specify the size of cluster in bytes for file systems using the bigalloc feature. Valid cluster-size values are from 2048 to 256M bytes per cluster. This can only be specified if the bigalloc feature is enabled. (See the B<ext4 (5)> man page for more details about bigalloc.) The default cluster size if bigalloc is enabled is 16 times the block size.
pl: Określa rozmiar klastra w bajtach w przypadku systemów plików używających funkcji bigalloc. Poprawnymi wartościami rozmiaru klastra są od 2048 do 256M bajtów na klaster. Opcji można użyć tylko gdy włączono funkcję bigalloc (więcej informacji o tej funkcji można uzyskać zapoznając się z B<ext4>(5)). Domyślnie rozmiar klastra wynosi szesnastokrotność wielkości bloku.

source: Use direct I/O when writing to the disk. This avoids mke2fs dirtying a lot of buffer cache memory, which may impact other applications running on a busy server. This option will cause mke2fs to run much more slowly, however, so there is a tradeoff to using direct I/O.
pl: Używa bezpośredniego wejścia/wyjścia podczas zapisu na dysk. Zapobiega to zajmowaniu przez mke2fs wielu buforów podręcznych, które mogą wpłynąć na inne aplikacje, podczas działania na obciążonym serwerze. Opcja ta spowoduje znaczne spowolnienie działania mke2fs, więc jest to pójście na kompromis.

source: B<-e>I< error-behavior>
pl: B<-e>I< zachowanie-w-razie-błędu>

source: Change the behavior of the kernel code when errors are detected. In all cases, a file system error will cause B<e2fsck>(8) to check the file system on the next boot. I<error-behavior> can be one of the following:
pl: Zmienia zachowanie jądra, gdy wykryty zostanie błąd. We wszystkich przypadkach błąd systemu plików powoduje uruchomienie B<e2fsck>(8) podczas następnego restartu w celu sprawdzenia systemu plików. I<zachowanie-w-razie-błędu> może przyjmować następujące wartości:

source: Continue normal execution.
pl: Kontynuuje normalną pracę.

source: Remount file system read-only.
pl: Powoduje przejście systemu plików w tryb tylko do odczytu.

source: Cause a kernel panic.
pl: Wywołuje panikę jądra.

source: B<-E>I< extended-options>
pl: B<-E>I< opcje rozszerzone>

source: Set extended options for the file system. Extended options are comma separated, and may take an argument using the equals ('=') sign. The B<-E> option used to be B<-R> in earlier versions of B<mke2fs>. The B<-R> option is still accepted for backwards compatibility, but is deprecated. The following extended options are supported:
pl: Ustawia rozszerzone opcje systemu plików. Opcje rozszerzone są oddzielone przecinkami i mogą zawierać argument podany po znaku równości ("="). Opcja B<-E> była nazwana B<-R> we wcześniejszych wersjach B<mke2fs> i jest wciąż akceptowana w celu zachowania kompatybilności wstecznej, lecz jest przestarzała. Obsługiwane są następujące opcje:

source: B<encoding=>I<encoding-name>
pl: B<encoding=>I<nazwa-kodowania>

source: B<encoding_flags=>I<encoding-flags>
pl: B<encoding_flags=>I<flagi-kodowania>

source: The only flag that can be set right now is I<strict> which means that invalid strings should be rejected by the file system. In the default configuration, the I<strict> flag is disabled.
pl: Obecnie jedyną flagą jaką można ustawić, to I<strict> oznaczająca, że nieprawidłowe łańcuchy znaków powinny być odrzucane przez system plików. W domyślnej konfiguracji flaga I<strict> jest wyłączona.

source: B<mmp_update_interval=>I<interval>
pl: B<mmp_update_interval=>I<interwał>

source: Adjust the initial MMP update interval to I<interval> seconds. Specifying an I<interval> of 0 means to use the default interval. The specified interval must be less than 300 seconds. Requires that the B<mmp> feature be enabled.
pl: Dostosowuje pierwotny interwał aktualizacji MMP do I<interwał> sekund. Podanie wartości 0 spowoduje użycia domyślnego interwału. Podany interwał musi być mniejszy niż 300 sekund. Wymaga włączonej funkcji B<mmp>.

source: B<stride=>I<stride-size>
pl: B<stride=>I<rozmiar-części>

source: Configure the file system for a RAID array with I<stride-size> file system blocks. This is the number of blocks read or written to disk before moving to the next disk, which is sometimes referred to as the I<chunk size.> This mostly affects placement of file system metadata like bitmaps at B<mke2fs> time to avoid placing them on a single disk, which can hurt performance. It may also be used by the block allocator.
pl: Konfiguruje system plików do macierzy RAID z I<rozmiarem-części> (ang. stride size lub chunk size) bloków systemu plików. Jest to liczba bloków odczytywanych lub zapisywanych na dysk przed przejściem na następny dysk. To ustawienie wpływa głównie na położenie metadanych systemu plików, takich jak mapy bitów podczas wykonywania B<mke2fs>, aby zapobiec umieszczeniu ich na jednym dysku, co mogłoby negatywnie wpłynąć na wydajność. Może być również użyte przez alokator bloków.

source: B<stripe_width=>I<stripe-width>
pl: B<stripe_width=>I<szerokość-paska>

source: Configure the file system for a RAID array with I<stripe-width> file system blocks per stripe. This is typically stride-size * N, where N is the number of data-bearing disks in the RAID (e.g. for RAID 5 there is one parity disk, so N will be the number of disks in the array minus 1). This allows the block allocator to prevent read-modify-write of the parity in a RAID stripe if possible when the data is written.
pl: Konfiguruje system plików do macierzy for RAID z I<rozmiarem-paska> (ang. stripe width) bloków systemu plików na pasek. Zazwyczaj jest to rozmiar-części * N, gdzie N jest liczbą dysków z danymi w macierzy RAID (np. przy RAID 5, gdzie jest jeden dysk parzystości, M jest liczbą dysków w macierzy minus jeden). Pozwala to alokatorowi bloków na przeciwdziałanie cyklowi odczytu-modyfikacji-zapisu w pasku RAID, jeśli to możliwe, przy zapisie danych.

source: B<offset=>I<offset>
pl: B<offset=>I<przesunięcie>

source: Create the file system at an offset from the beginning of the device or file. This can be useful when creating disk images for virtual machines.
pl: Tworzy system plików z przesunięciem od początku urządzenia lub pliku. Może się to przydać przy tworzeniu obrazów dysków dla maszyn wirtualnych.

source: B<resize=>I<max-online-resize>
pl: B<resize=>I<maksymalna-zmiana-online>

source: Reserve enough space so that the block group descriptor table can grow to support a file system that has I<max-online-resize> blocks.
pl: Rezerwuje przestrzeń, dzięki której tablica deskryptora grupy bloków może się powiększyć, aby obsłużyć system plików z I<maksymalną-zmianą-online> bloków.

source: B<lazy_itable_init>[B<= >I<E<lt>0 to disable, 1 to enableE<gt>>]
pl: B<lazy_itable_init>[B<= >I<E<lt>0 aby wyłączyć, 1 aby włączyćE<gt>>]

source: If enabled and the uninit_bg feature is enabled, the inode table will not be fully initialized by B<mke2fs>. This speeds up file system initialization noticeably, but it requires the kernel to finish initializing the file system in the background when the file system is first mounted. If the option value is omitted, it defaults to 1 to enable lazy inode table zeroing.
pl: Jeśli jest włączone oraz włączona jest funkcja uninit_bg, to tabela i-węzłów nie będzie w pełni inicjowana przez B<mke2fs>. Przyspiesza to znacznie inicjalizację systemu plików, lecz wymaga zakończenia inicjowania systemu plików w tle, przez jądro, podczas gdy system plików jest wcześniej zamontowany. Jeśli pominie się wartość opcji, jest używana domyślnie 1, aby włączyć zerowanie leniwej tabeli i-węzłów.

source: B<lazy_journal_init>[B<= >I<E<lt>0 to disable, 1 to enableE<gt>>]
pl: B<lazy_journal_init>[B<= >I<E<lt>0 aby wyłączyć, 1 aby włączyćE<gt>>]

source: If enabled, the journal inode will not be fully zeroed out by B<mke2fs>. This speeds up file system initialization noticeably, but carries some small risk if the system crashes before the journal has been overwritten entirely one time. If the option value is omitted, it defaults to 1 to enable lazy journal inode zeroing.
pl: Jeśli jest włączone, to i-węzeł dziennika nie będzie w pełni zerowany przez B<mke2fs>. Znacznie przyspiesza to inicjowanie systemu, ale niesie niewielkie ryzyko, jeśli system załamie się przed pełnym, jednokrotnym nadpisaniem dziennika. Jeśli opcja zostanie pominięta, przyjmuje domyślną wartość 1, włączając leniwe zerowanie i-węzła dziennika.

source: B<num_backup_sb=>I<E<lt>0|1|2E<gt>>
pl: B<num_backup_sb=>B<0>|B<1>|B<2>

source: If the B<sparse_super2> file system feature is enabled this option controls whether there will be 0, 1, or 2 backup superblocks created in the file system.
pl: Jeśli włączona jest funkcja B<sparse_super2> systemu plików, to ta opcja kontroluje liczbę zapasowych superbloków utworzonych w systemie plików. Może być ich 0, 1 lub 2.

source: B<packed_meta_blocks>[B<= >I<E<lt>0 to disable, 1 to enableE<gt>>]
pl: B<packed_meta_block>[B<= >I<E<lt>0 aby wyłączyć, 1 aby włączyćE<gt>>]

source: Place the allocation bitmaps and the inode table at the beginning of the disk. This option requires that the flex_bg file system feature to be enabled in order for it to have effect, and will also create the journal at the beginning of the file system. This option is useful for flash devices that use SLC flash at the beginning of the disk. It also maximizes the range of contiguous data blocks, which can be useful for certain specialized use cases, such as supported Shingled Drives.
pl: Umieszcza mapy bitowe alokacji i tabelę i-węzłów na początku dysku. Do zadziałania opcja ta wymaga włączonej funkcji flex_bg systemu plików, utworzy ona również dziennik na początku systemu plików. Jest przydatna w przypadku urządzeń z pamięcią flash, które na początku dysku używają pamięci SLC. Maksymalizuje również zasięg ciągłych bloków danych, co jest korzystne w określonych wyspecjalizowanych przypadkach użycia, takich jak obsługiwane Shingled Drives.

source: B<root_owner>I<[=uid:gid]>
pl: B<root_owner>[B<=>I<uid>B<:>I<gid>]

source: Specify the numeric user and group ID of the root directory. If no UID:GID is specified, use the user and group ID of the user running B<mke2fs>. In B<mke2fs> 1.42 and earlier the UID and GID of the root directory were set by default to the UID and GID of the user running the mke2fs command. The B<root_owner=> option allows explicitly specifying these values, and avoid side-effects for users that do not expect the contents of the file system to change based on the user running B<mke2fs>.
pl: Określa numeryczny identyfikator użytkownika (UID) i grupy (GID) w katalogu głównym. Jeśli nie poda się I<UID>B<:>I<GID>, używa identyfikatora użytkownika i grupy użytkownika uruchamiającego B<mke2fs>. W B<mke2fs> 1.42 i wcześniejszych, UID i GID katalogu głównego były ustawiane domyślnie na UID i GID użytkownika uruchamiającego polecenie mke2fs. Opcja B<root_owner=> pozwala na jawne podanie tych wartości i zapobiega efektom ubocznym dla użytkowników, którzy nie spodziewają się domyślnego zachowania programu B<mke2fs>.

source: Set a flag in the file system superblock indicating that it may be mounted using experimental kernel code, such as the ext4dev file system.
pl: Ustawia flagę superbloku systemu plików, oznaczającą, że może być on montowany przy użyciu eksperymentalnego kodu jądra, np. kodu systemu plików ext4dev.

source: Attempt to discard blocks at mkfs time (discarding blocks initially is useful on solid state devices and sparse / thin-provisioned storage). When the device advertises that discard also zeroes data (any subsequent read after the discard and before write returns zero), then mark all not-yet-zeroed inode tables as zeroed. This significantly speeds up file system initialization. This is set as default.
pl: Próbuje wykonać operację discard na blokach w czasie tworzenia systemu (jest to przydatne na SSD albo tzw. rzadkich dyskach lub dyskach dynamicznie alokowanych). Gdy urządzenie informuje że operacja discard również zeruje dane (każde kolejne odczytanie po tej operacji, a przed zapisem, zwraca zero), to wszystkie jeszcze niewyzerowane tabele i-węzłów są oznaczane jako wyzerowane. Znacznie przyspiesza to inicjowanie systemu. Tak jest domyślnie.

source: Do not attempt to discard blocks at mkfs time.
pl: Nie próbuje wykonać operacji discard na blokach w czasie tworzenia systemu plików.

source: Force B<mke2fs> to create a file system, even if the specified device is not a partition on a block special device, or if other parameters do not make sense. In order to force B<mke2fs> to create a file system even if the file system appears to be in use or is mounted (a truly dangerous thing to do), this option must be specified twice.
pl: Wymusza na B<mke2fs> utworzenie systemu plików, nawet jeśli podane urządzenie nie jest partycją na specjalnym urządzeniu blokowym lub inne parametry nie mają sensu. Aby wymusić na B<mke2fs> utworzenie systemu plików, nawet jeśli wygląda na to, że system plików jest w użyciu lub jest zamontowany (jest to niezwykle niebezpieczne), to opcja musi zostać podana dwukrotnie.

source: B<-g>I< blocks-per-group>
pl: B<g>I< bloki-na-grupę>

source: Specify the number of blocks in a block group. There is generally no reason for the user to ever set this parameter, as the default is optimal for the file system. (For administrators who are creating file systems on RAID arrays, it is preferable to use the I<stride> RAID parameter as part of the B<-E> option rather than manipulating the number of blocks per group.) This option is generally used by developers who are developing test cases.
pl: Określa liczbę bloków w grupie bloków. Ogólnie rzecz biorąc, nie ma powodu, aby użytkownik musiał kiedykolwiek ustawiać ten parametr, ponieważ wartość domyślna jest optymalna dla systemu plików (administratorzy, którzy tworzą systemy plików na macierzach RAID, powinny używać parametru RAID I<stride> jako część opcji B<-E>, zamiast zmieniać liczbą bloków na grupę). Opcja jest przeznaczona dla deweloperów, którzy używają jej w sytuacjach testowych.

source: If the bigalloc feature is enabled, the B<-g> option will specify the number of clusters in a block group.
pl: Jeśli włączona jest funkcja bigalloc, to opcja B<-g> określa liczbę klastrów w grupie bloków.

source: B<-G>I< number-of-groups>
pl: B<-G>I< liczba-grup>

source: Specify the number of block groups that will be packed together to create a larger virtual block group (or "flex_bg group") in an ext4 file system. This improves meta-data locality and performance on meta-data heavy workloads. The number of groups must be a power of 2 and may only be specified if the B<flex_bg> file system feature is enabled.
pl: Określa liczbę grup bloków, która będzie spakowana razem, tworząc większą, wirtualną grupę bloków (lub "flex_bg group") w systemie plików ext4. Usprawnia to lokowanie metadanych i wydajność metadanych przy dużym obciążeniu. Liczba grup musi być potęgą dwójki i może być podana jedynie gdy włączona jest funkcja systemu plików B<flex_bg>.

source: B<-i>I< bytes-per-inode>
pl: B<-i>I< bajty-na-i-węzeł>

source: Specify the bytes/inode ratio. B<mke2fs> creates an inode for every I<bytes-per-inode> bytes of space on the disk. The larger the I<bytes-per-inode> ratio, the fewer inodes will be created. This value generally shouldn't be smaller than the blocksize of the file system, since in that case more inodes would be made than can ever be used. Be warned that it is not possible to change this ratio on a file system after it is created, so be careful deciding the correct value for this parameter. Note that resizing a file system changes the number of inodes to maintain this ratio.
pl: Określa współczynnik bajty/i-węzeł. B<mke2fs> tworzy i-węzeł co każde I<bajty-na-i-węzeł> bajtów dysku. Im większy współczynnik I<bajty-na-i-węzeł>, tym więcej i-węzłów. Generalnie, wartość ta nie powinna być mniejsza od rozmiaru bloku w systemie plików, gdyż wtedy byłoby utworzonych zbyt dużo i-węzłów. Ostrzeżenie: wartość ta nie może być już zmieniona po utworzeniu systemu plików, więc należy ostrożnie dobrać wartość tego parametru. Proszę zauważyć, że zmiana rozmiaru systemu plików zmienia liczbę i-węzłów która wpływa na ten współczynnik.

source: B<-I>I< inode-size>
pl: B<-I>I< rozmiar-i-węzła>

source: Specify the size of each inode in bytes. The I<inode-size> value must be a power of 2 larger or equal to 128. The larger the I<inode-size> the more space the inode table will consume, and this reduces the usable space in the file system and can also negatively impact performance. It is not possible to change this value after the file system is created.
pl: Określa rozmiar każdego i-węzła w bajtach. Wartość I<rozmiaru-i-węzła> musi być potęgą dwójki, większą lub równą 128. Większy rozmiar I<rozmiaru-i-węzła> powoduje zwiększenie powierzchni zajmowanej przez tabelę i-węzłów i zredukowanie użytecznej powierzchni systemu plików, a może również negatywnie wpłynąć na wydajność. Nie da się zmienić tej wartości po utworzeniu systemu plików.

source: File systems with an inode size of 128 bytes do not support timestamps beyond January 19, 2038. Inodes which are 256 bytes or larger will support extended timestamps, project id's, and the ability to store some extended attributes in the inode table for improved performance.
pl: Systemy plików z i-węzłami o rozmiarze 128 bajtów nie obsługują znaczników czasu późniejszych niż 19 stycznia 2038. I-węzły o rozmiarze 256 bajtów lub większym obsługują rozszerzone znaczniki czasu, identyfikatory projektów oraz możliwość przechowywania pewnych dodatkowych atrybutów w tabeli i-węzłów, które wpływają na zwiększoną wydajność.

source: The default inode size is controlled by the B<mke2fs.conf>(5) file. In the B<mke2fs.conf> file shipped with e2fsprogs, the default inode size is 256 bytes for most file systems, except for small file systems where the inode size will be 128 bytes.
pl: Domyślny rozmiar i-węzła zależy od pliku B<mke2fs.conf>(5). W pliku B<mke2fs.conf> rozpowadzanym razem z e2fsprogs domyślny rozmiar i-węzła wynosi z reguły 256 bajtów z wyjątkiem małych systemów plików, w których wartość ta ma 128 bajtów.

source: Create the file system with an ext3 journal. If the B<-J> option is not specified, the default journal parameters will be used to create an appropriately sized journal (given the size of the file system) stored within the file system. Note that you must be using a kernel which has ext3 support in order to actually make use of the journal.
pl: Powoduje utworzenie system plików z księgowaniem ext3. Gdy nie podano opcji B<-J>, przy tworzeniu dziennika zostaną użyte domyślne parametry oraz dobrany będzie właściwy rozmiar tego dziennika (na podstawie wielkości systemu plików) przechowywanego we wnętrzu systemu plików. Proszę zauważyć, że trzeba korzystać z jądra posiadającego wsparcie dla ext3, aby móc używać dziennika.

source: B<-J>I< journal-options>
pl: B<-J>I< opcje-dziennika>

source: Create the ext3 journal using options specified on the command-line. Journal options are comma separated, and may take an argument using the equals ('=') sign. The following journal options are supported:
pl: Tworzy dziennik ext3 używając opcji podanych z linii poleceń. Opcje te są oddzielone przecinkami i mogą posiadać argument, podawany po znaku równości ('='). Obsługiwane są następujące opcje:

source: B<size=>I<journal-size>
pl: B<size=>I<rozmiar-dziennika>

source: Create an internal journal (i.e., stored inside the file system) of size I<journal-size> megabytes. The size of the journal must be at least 1024 file system blocks (i.e., 1MB if using 1k blocks, 4MB if using 4k blocks, etc.) and may be no more than 10,240,000 file system blocks or half the total file system size (whichever is smaller)
pl: Tworzy wewnętrzny dziennik (np. przechowywany wewnątrz systemu plików) o rozmiarze I<rozmiar-dziennika> megabajtów. Rozmiar dziennika musi wynosić co najmniej 1024 bloki systemu plików (np. 1MB przy korzystaniu z bloków 1k, 4MB przy blokach 4k, itd.) i nie może być większy niż 10 240 000 bloków systemu plików lub połowę całkowitego rozmiaru systemu plików (mniejsza z tych dwóch wartości).

source: B<fast_commit_size=>I<fast-commit-size>
pl: B<fast_commit_size=>I<rozmiar-szybkiego-zatwierdzania>
