Repository: sebras/manpages-l10n
Catalog: po/*/man8/mke2fs.8.po
Languages: pl

source: Create an additional fast commit journal area of size I<fast-commit-size> kilobytes. This option is only valid if B<fast_commit> feature is enabled on the file system. If this option is not specified and if B<fast_commit> feature is turned on, fast commit area size defaults to I<journal-size> / 64 megabytes. The total size of the journal with B<fast_commit> feature set is I<journal-size> + ( I<fast-commit-size> * 1024) megabytes. The total journal size may be no more than 10,240,000 file system blocks or half the total file system size (whichever is smaller).
pl: Tworzy dodatkowy obszar szybkiego zatwierdzania dziennika o rozmiarze I<rozmiar-szybkiego-zatwierdzania> w kilobajtach. Opcja jest prawidłowa wyłącznie jeśli włączono funkcję B<fast_commit> w danym systemie plików. Jeśli nie podano tej opcji, a funkcja B<fast_commit> jest włączona, domyślnym rozmiarem tego obszaru będzie I<journal-size> / 64 megabajtów. Całkowity rozmiar dziennika z ustawioną funkcją B<fast_commit> wynosi I<journal-size> + ( I<fast-commit-size> * 1024) megabajtów. Całkowity rozmiar dziennika nie może być większy niż 10.240.000 bloków systemu plików lub połowy całkowitego rozmiaru systemu plików (mniejszą z tych wartości).

source: B<location>I<=journal-location>
pl: B<location>I<=położenie-dziennika>

source: Specify the location of the journal. The argument I<journal-location> can either be specified as a block number, or if the number has a units suffix (e.g., 'M', 'G', etc.) interpret it as the offset from the beginning of the file system.
pl: Określa położenie dziennika. Argument I<położenie dziennika> można podać jako numer bloku lub, jeśli liczba ma przyrostek określający jednostkę ("M", "G" itp.), liczbę interpretowaną jako przesunięcie od początku systemu plików.

source: B<device=>I<external-journal>
pl: B<device=>I<zewnętrzny-dziennik>

source: Attach the file system to the journal block device located on I<external-journal>. The external journal must already have been created using the command
pl: Przyłącza dziennik system plików do urządzenia blokowego znajdującego się na I<zewnętrzny-dziennik>. Zewnętrzny dziennik musi być utworzony za pomocą polecenia

source: B<mke2fs -O journal_dev> I<external-journal>
pl: B<mke2fs -O journal_dev> I<zewnętrzny-dziennik>

source: Note that I<external-journal> must have been created with the same block size as the new file system. In addition, while there is support for attaching multiple file systems to a single external journal, the Linux kernel and B<e2fsck>(8) do not currently support shared external journals yet.
pl: Proszę zauważyć, że I<zewnętrzny-dziennik> musi zostać utworzony z tą samą wielkością bloku jak nowy system plików. Dodatkowo, o ile obsługa dołączania wielu systemów plików do pojedynczego dziennika zewnętrznego jest obecna, jądro Linux i B<e2fsck>(8) nie obsługuje na razie dzielonych dzienników zewnętrznych.

source: Instead of specifying a device name directly, I<external-journal> can also be specified by either B<LABEL=>I<label> or B<UUID=>I<UUID> to locate the external journal by either the volume label or UUID stored in the ext2 superblock at the start of the journal. Use B<dumpe2fs>(8) to display a journal device's volume label and UUID. See also the B<-L> option of B<tune2fs>(8).
pl: Zamiast podawać nazwę urządzenia bezpośrednio, I<zewnętrzny-dziennik> może być określony przez B<LABEL=>I<etykieta> lub B<UUID=>I<UUID>, aby znaleźć zewnętrzny dziennik na podstawie etykiety woluminu lub UUID przechowywanego w superbloku ext2 na początku dziennika. Do wypisania etykiety i UUID urządzenia z dziennikiem można posłużyć się B<dumpe2fs>(8). Zobacz także opis opcji B<-L> programu B<tune2fs>(8).

source: Only one of the B<size> or B<device> options can be given for a file system.
pl: Dla danego systemu plików można podać tylko jedną z opcji B<size> lub B<device>.

source: B<-l>I< filename>
pl: B<-l>I< plik>

source: Read the bad blocks list from I<filename>. Note that the block numbers in the bad block list must be generated using the same block size as used by B<mke2fs>. As a result, the B<-c> option to B<mke2fs> is a much simpler and less error-prone method of checking a disk for bad blocks before formatting it, as B<mke2fs> will automatically pass the correct parameters to the B<badblocks> program.
pl: Powoduje odczytanie listy uszkodzonych bloków z I<nazwy-pliku>. Proszę zauważyć, że numery bloków na liście zepsutych bloków muszą być wygenerowane przy użyciu takiego samego rozmiaru bloków jaki użyty był w mke2fs. W rezultacie opcja B<-c> do B<mke2fs> jest prostszą i mniej podatną na błędy metodą sprawdzenia dysku pod kątem zepsutych bloków przed formatowaniem go, gdyż B<mke2fs> automatycznie podaje odpowiednie parametry do programu B<badblocks>.

source: B<-L>I< new-volume-label>
pl: B<-L>I< nowa-etykieta-woluminu>

source: Set the volume label for the file system to I<new-volume-label>. The maximum length of the volume label is 16 bytes.
pl: Ustawia etykietę woluminu systemu plików na I<nową-etykietę-woluminu>. Maksymalna długość etykiety woluminu to 16 bajtów.

source: B<-m>I< reserved-blocks-percentage>
pl: B<-m>I< procent-zarezerwowanych-bloków>

source: Specify the percentage of the file system blocks reserved for the super-user. This avoids fragmentation, and allows root-owned daemons, such as B<syslogd>(8), to continue to function correctly after non-privileged processes are prevented from writing to the file system. The default percentage is 5%.
pl: Określa procent bloków systemu plików, zarezerwowanych dla superużytkownika. Zapobiega to fragmentacji i pozwala demonom działających z uprawnieniami roota, takim jak B<syslogd>(8), na poprawne kontynuowanie działania po tym, gdy procesy nieuprzywilejowane nie będą już mogły zapisywać do systemu plików. Domyślna wartość to 5%.

source: B<-M>I< last-mounted-directory>
pl: B<-M>I< ostatnio-montowany-katalog>

source: Set the last mounted directory for the file system. This might be useful for the sake of utilities that key off of the last mounted directory to determine where the file system should be mounted.
pl: Ustawia katalog ostatniego montowania systemu plików. Opcja ta może być użyteczna ze względu na aplikacje, dla których katalog ostatniego montowania wskazuje, gdzie należy zamontować dany system plików.

source: Causes B<mke2fs> to not actually create a file system, but display what it would do if it were to create a file system. This can be used to determine the location of the backup superblocks for a particular file system, so long as the B<mke2fs> parameters that were passed when the file system was originally created are used again. (With the B<-n> option added, of course!)
pl: Powoduje, że B<mke2fs> nie tworzy systemu plików, lecz wyświetla co zrobiłby, gdyby miał go utworzyć. Można wykorzystać tę opcję do określenia położenia zapasowych superbloków danego systemu plików tak długo, jak parametry B<mke2fs>, które były podane podczas pierwotnego tworzenia systemu plików, są ponownie użyte (oczywiście z dodaną opcją B<-n>).

source: B<-N>I< number-of-inodes>
pl: B<-N>I< liczba-i-węzłów>

source: Overrides the default calculation of the number of inodes that should be reserved for the file system (which is based on the number of blocks and the I<bytes-per-inode> ratio). This allows the user to specify the number of desired inodes directly.
pl: Zmienia domyślnie wyliczoną liczbę i-węzłów, które powinny być zarezerwowane dla systemu plików (a która bazuje na liczbie bloków i współczynniku I<bajty-na-i-węzeł>). To pozwala użytkownikowi podać bezpośrednio liczbę żądanych i-węzłów.

source: B<-o>I< creator-os>
pl: B<-o>I< tworzący-os>

source: Overrides the default value of the "creator operating system" field of the file system. The creator field is set by default to the name of the OS the B<mke2fs> executable was compiled for.
pl: Służy do ręcznej zmiany domyślnej wartości pola "creator operating system" (tworzący system operacyjny) systemu plików. Normalnie pole to jest ustawiane na nazwę systemu operacyjnego, do którego skompilowano plik wykonywalny B<mke2fs>.

source: B<-O >[^]I<feature>[,...]
pl: B<-O >[B<^>]I<funkcja>[,...]

source: Create a file system with the given features (file system options), overriding the default file system options. The features that are enabled by default are specified by the I<base_features> relation, either in the I<[defaults]> section in the B</etc/mke2fs.conf> configuration file, or in the I<[fs_types]> subsections for the usage types as specified by the B<-T> option, further modified by the I<features> relation found in the I<[fs_types]> subsections for the file system and usage types. See the B<mke2fs.conf>(5) manual page for more details. The file system type-specific configuration setting found in the I<[fs_types]> section will override the global default found in I<[defaults]>.
pl: Tworzy system plików z podanymi właściwościami (opcjami systemu plików), przesłaniając domyślne opcje systemu plików. Właściwości, które są włączane domyślnie, są podane w relacji I<base_features>, albo w sekcji I<[defaults]> pliku B</etc/mke2fs.conf> , albo w podsekcji I<[fs_types]> w przypadku typów użycia, zgodnie z opcją B<-T>, zmodyfikowane później przez relację I<features> z podsekcji I<[fs_types>] w przypadku systemu plików i typów użycia. Strona podręcznika B<mke2fs.conf>(5) zawiera więcej szczegółów. Konfiguracja charakterystyczna dla danego system plików mieszcząca się w sekcji I<[fs_types]> przesłoni domyślne opcje globalne z sekcji I<[defaults]>.

source: The file system feature set will be further edited using either the feature set specified by this option, or if this option is not given, by the I<default_features> relation for the file system type being created, or in the I<[defaults]> section of the configuration file.
pl: Właściwość systemu plików będzie edytowana później albo przez zestaw właściwości podanych przez tę opcję lub, jeśli nie użyto tej opcji, przez relację I<default_features> do tworzonych typów systemów plików, lub w sekcji I<[defaults]> pliku konfiguracyjnego.

source: The file system feature set is comprised of a list of features, separated by commas, that are to be enabled. To disable a feature, simply prefix the feature name with a caret ('^') character. Features with dependencies will not be removed successfully. The pseudo-file system feature "none" will clear all file system features.
pl: Zestaw właściwości systemu plików składa się z listy właściwości, oddzielonych przecinkami, które mają być włączone. Aby wyłączyć którąś funkcję, należy poprzedzić nazwę właściwości znakiem karetki ("^"). Funkcje z zależnościami nie będą poprawnie usuwane. Pseudo-właściwość "none" wyłączy wszystkie właściwości systemu plików.

source: For more information about the features which can be set, please see
pl: Więcej informacji o funkcjach które można ustawić znajduje się w

source: the manual page B<ext4>(5).
pl: podręczniku B<ext4>(5).

source: Quiet execution. Useful if B<mke2fs> is run in a script.
pl: Ciche wywołanie. Przydatne gdy B<mke2fs> jest uruchamiany ze skryptu.

source: B<-r>I< revision>
pl: B<-r>I< rewizja>

source: Set the file system revision for the new file system. Note that 1.2 kernels only support revision 0 file systems. The default is to create revision 1 file systems.
pl: Ustawia rewizję (wersję) systemu plików dla nowego systemu plików. Proszę zauważyć, że jądra 1.2 wspierają jedynie systemy plików o rewizji 0. Domyślnie tworzone są systemy plików o rewizji 1.

source: B<-t>I< fs-type>
pl: B<-T>I< typ-systemu-plików>

source: Specify the file system type (i.e., ext2, ext3, ext4, etc.) that is to be created. If this option is not specified, B<mke2fs> will pick a default either via how the command was run (for example, using a name of the form mkfs.ext2, mkfs.ext3, etc.) or via a default as defined by the B</etc/mke2fs.conf> file. This option controls which file system options are used by default, based on the B<fstypes> configuration stanza in B</etc/mke2fs.conf>.
pl: Określa typ systemu plików (np. ext2, ext3, ext4 itp.) do utworzenia. Jeśli nie poda się tej opcji, B<mke2fs> wybierze domyślny na podstawie polecenia, które go uruchomiło (np. mkfs.ext2, mkfs.ext3 itd.) lub na podstawie domyślnego systemu plików, zdefiniowanego plikiem B</etc/mke2fs.conf>. Opcja kontroluje, który system plików jest używany jako domyślny, na podstawie wpisu konfiguracyjnego B<fstypes> w B</etc/mke2fs.conf>.

source: If the B<-O> option is used to explicitly add or remove file system options that should be set in the newly created file system, the resulting file system may not be supported by the requested I<fs-type>. (e.g., "B<mke2fs -t ext3 -O extent /dev/sdXX>" will create a file system that is not supported by the ext3 implementation as found in the Linux kernel; and "B<mke2fs -t ext3 -O ^has_journal /dev/hdXX>" will create a file system that does not have a journal and hence will not be supported by the ext3 file system code in the Linux kernel.)
pl: Jeśli opcja B<-O> jest użyta do jawnego dodania lub usunięcia opcji systemu plików, które powinny być ustawiane w nowo tworzonych systemach plików, to wynikowy system plików może nie być obsługiwany przez żądany I<typ-systemu-plików>. (np. "B<mke2fs -t ext3 -O extent /dev/sdXX>" utworzy system plików, który nie jest obsługiwany przez implementację ext3 w jądrze Linux, a "B<mke2fs -t ext3 -O ^has_journal /dev/hdXX>" utworzy system plików nieposiadający dziennika i, w związku z tym, nieobsługiwany przez kod systemu plików ext3 w jądrze Linux).

source: B<-T>I< usage-type[,...]>
pl: B<-T>I< typ-użycia>[B<,>I<...>]

source: Specify how the file system is going to be used, so that B<mke2fs> can choose optimal file system parameters for that use. The usage types that are supported are defined in the configuration file B</etc/mke2fs.conf>. The user may specify one or more usage types using a comma separated list.
pl: Określa, w jaki sposób dany system plików będzie wykorzystywany. Dzięki temu B<mke2fs> może wybrać optymalne parametry dla systemu plików. Obsługiwane typy użycia są zdefiniowane w pliku konfiguracyjnym B</etc/mke2fs.conf>. Użytkownik może podać jeden lub więcej typów użycia, za pomocą listy, oddzielając poszczególne pozycje przecinkiem.

source: Set the universally unique identifier (UUID) of the file system to I<UUID>. The format of the UUID is a series of hex digits separated by hyphens, like this: "c1b9d5a2-f162-11cf-9ece-0020afc76f16". The I<UUID> parameter may also be one of the following:
pl: Ustawia uniwersalny, unikatowy identyfikator (universally unique identifier - UUID) systemu plików na I<UUID>. UUID składa się z serii cyfr w systemie szesnastkowym oddzielonych myślnikami, jak np.: "c1b9d5a2-f162-11cf-9ece-0020afc76f16". Parametr I<UUID> może przyjmować też następujące wartości:

source: clear the file system UUID
pl: usuwa UUID systemu plików

source: generate a new randomly-generated UUID
pl: generuje nowy, przypadkowy UUID

source: generate a new time-based UUID
pl: generuje nowy UUID, oparty na czasie

source: Verbose execution.
pl: Wypisuje szczegółowe informacje.

source: Print the version number of B<mke2fs> and exit.
pl: Wypisuje numer wersji B<mke2fs> i wychodzi.

source: B<-z>I< undo_file>
pl: B<-z> I<plik-zapasowy>

source: WARNING: The undo file cannot be used to recover from a power or system crash.
pl: OSTRZEŻENIE: Plik zapasowy nie pomoże w przypadku utraty zasilania lub zawieszenia systemu.

source: ENVIRONMENT
pl: ŚRODOWISKO

source: If set to non-zero integer value, its value is used to determine how often B<sync>(2) is called during inode table initialization.
pl: Jeśli jest ustawiona na niezerową wartość całkowitą, to jej wartość jest używana do określenia częstości wywoływania B<sync>(2) podczas inicjowania tabeli i-węzłów.

source: Determines the location of the configuration file (see B<mke2fs.conf>(5)).
pl: Określa położenie pliku konfiguracyjnego (patrz B<mke2fs.conf>(5)).

source: If set to non-zero integer value, its value is used to determine first meta block group. This is mostly for debugging purposes.
pl: Jeśli jest ustawiona na niezerową wartość całkowitą, to jej wartość jest używana do określenia pierwszej grupy metabloków. Przeznaczona jest głównie do debugowania.

source: If set to non-zero integer value, its value is used to determine physical sector size of the I<device>.
pl: Jeśli jest ustawiona na niezerową wartość całkowitą, to jej wartość jest używana do określenia fizycznego rozmiaru sektora I<urządzenia>.

source: If set, do not show the message of file system automatic check caused by mount count or check interval.
pl: Jeśli jest ustawiona, nie są pokazywane wiadomości automatycznego sprawdzania systemu plików, spowodowane liczbą montowań lub interwałem sprawdzania.

source: AUTHOR
pl: AUTOR

source: This version of B<mke2fs> has been written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
pl: Ta wersja B<mke2fs> została napisana przez Theodora Ts'o E<lt>tytso@mit.eduE<gt>.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: B<mke2fs> is part of the e2fsprogs package and is available from http://e2fsprogs.sourceforge.net.
pl: B<mke2fs> jest częścią pakietu e2fsprogs i jest dostępne na stronie http://e2fsprogs.sourceforge.net.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: August 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4
