Repository: sebras/manpages-l10n
Catalog: po/*/man8/mkfs.minix.8.po
Languages: pl

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: mkfs.minix - make a Minix filesystem
pl: mkfs - tworzy system plików Minix

source: SYNOPSIS
pl: SKŁADNIA

source: B<mkfs.minix> [options] I<device> [I<size-in-blocks>]
pl: B<mkfs.minix> [I<opcje>] I<urządzenie> [I<rozmiar-w-blokach>]

source: DESCRIPTION
pl: OPIS

source: B<mkfs.minix> creates a Linux MINIX filesystem on a device (usually a disk partition).
pl: B<mkfs.minix> tworzy linuksowy system plików MINIX na zadanym urządzeniu (zwykle partycji dysku).

source: The I<device> is usually of the following form:
pl: I<urządzenie> występuje zwykle w następującej postaci:

source: /dev/hda[1-8] (IDE disk 1) /dev/hdb[1-8] (IDE disk 2) /dev/sda[1-8] (SCSI disk 1) /dev/sdb[1-8] (SCSI disk 2)
pl: /dev/hda[1-8] (1. dysk IDE) /dev/hdb[1-8] (2. dysk IDE) /dev/sda[1-8] (1. dysk SCSI) /dev/sdb[1-8] (2. dysk SCSI)

source: The device may be a block device or an image file of one, but this is not enforced. Expect not much fun on a character device :-).
pl: Urządzenie może być urządzeniem blokowym lub plikiem obrazu takowego, lecz nie jest to wymuszone. Urządzenie znakowe nie zapewni wiele rozrywki :-).

source: The I<size-in-blocks> parameter is the desired size of the file system, in blocks. It is present only for backwards compatibility. If omitted the size will be determined automatically. Only block counts strictly greater than 10 and strictly less than 65536 are allowed.
pl: Parametr I<rozmiar-w-blokach> jest pożądanym rozmiarem systemu plików, wyrażonym jako liczba bloków. Jest obecny tylko w celu kompatybilności wstecznej. Jeśli pominięto rozmiar, to zostanie on określony automatycznie. Dozwolone są wyłącznie liczby bloków większe od 10 i mniejsze od 65536.

source: OPTIONS
pl: OPCJE

source: Check the device for bad blocks before creating the filesystem. If any are found, the count is printed.
pl: Przed utworzeniem systemu plików sprawdza uszkodzone bloki urządzenia. Jeżeli zostaną znalezione jakieś błędne bloki, to wyświetlana jest ich liczba.

source: B<-n>, B<--namelength> I<length>
pl: B<-n>, B<--namelength> I<długość>

source: Specify the maximum length of filenames. Currently, the only allowable values are 14 and 30 for file system versions 1 and 2. Version 3 allows only value 60. The default is 30.
pl: Określa maksymalną długość nazw plików. Obecnie dozwolone są wyłącznie wartości 14 i 30 w przypadku wersji 1 i 2 systemu plików. Wersja 3 pozwala wyłącznie na wartość 30. Domyślnie jest to 30.

source: B<--lock>[=I<mode>]
pl: B<--lock>[=I<tryb>]

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<yes>. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it\(cqs recommended to avoid collisions with B<systemd-udevd>(8) or other tools.
pl: Używa blokady na wyłączność BSD do urządzeń i plików na których działa. Opcjonalnym argumentem I<tryb> może być B<yes>, B<no> (albo B<1> lub B<0>) lub też B<nonblock>. Jeśli nie poda się I<trybu>, domyślną wartością jest B<yes>. Opcja ta przesłania zmienną środowiskową B<$LOCK_BLOCK_DEVICE>. Choć domyślnie nie jest używana żadna blokada, zaleca się jej użycie aby uniknąć kolizji z B<systemd-udevd>(8) i innymi narzędziami.

source: B<-i>, B<--inodes> I<number>
pl: B<-i>, B<--inodes> I<liczba>

source: Specify the number of inodes for the filesystem.
pl: Określa liczbę i-węzłów systemu plików.

source: B<-l>, B<--badblocks> I<filename>
pl: B<-l>, B<--badblocks> I<nazwa-pliku>

source: Read the list of bad blocks from I<filename>. The file has one bad-block number per line. The count of bad blocks read is printed.
pl: Odczytuje listę uszkodzonych bloków z pliku o nazwie I<nazwa-pliku>. Plik zawiera po jednym numerze błędnego bloku w każdym wierszu. Wyświetlana jest liczba odczytanych błędnych bloków.

source: Make a Minix version 1 filesystem. This is the default.
pl: Tworzy system plików Minix w wersji 1. Tak jest domyślnie.

source: Make a Minix version 2 filesystem.
pl: Tworzy system plików Minix w wersji 2.

source: Make a Minix version 3 filesystem.
pl: Tworzy system plików Minix w wersji 3.

source: Display help text and exit.
pl: Wyświetla ten tekst i kończy pracę.

source: ENVIRONMENT
pl: ŚRODOWISKO

source: LOCK_BLOCK_DEVICE=E<lt>modeE<gt>
pl: LOCK_BLOCK_DEVICE=E<lt>trybE<gt>

source: use exclusive BSD lock. The mode is "1" or "0". See B<--lock> for more details.
pl: używa blokowania na wyłączność BSD. Tryb to "1" lub "0". Więcej informacji w opisie opcji B<--lock>.

source: EXIT STATUS
pl: KOD ZAKOŃCZENIA

source: No errors
pl: Brak błędów

source: Operational error
pl: Błąd działania

source: Usage or syntax error
pl: Błąd użycia (składni)

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: REPORTING BUGS
pl: ZGŁASZANIE BŁĘDÓW

source: For bug reports, use the issue tracker at
pl: Raporty o błędach proszę zgłaszać pod adresem

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: June 2015
pl: czerwiec 2015

source: /dev/hda[1\(en8] (IDE disk 1) /dev/hdb[1\(en8] (IDE disk 2) /dev/sda[1\(en8] (SCSI disk 1) /dev/sdb[1\(en8] (SCSI disk 2)
pl: /dev/hda[1\(en8] (1. dysk IDE) /dev/hdb[1\(en8] (2. dysk IDE) /dev/sda[1\(en8] (1. dysk SCSI) /dev/sdb[1\(en8] (2. dysk SCSI)

source: The device may be a block device or an image file of one, but this is not enforced. Expect not much fun on a character device :-).
pl: Urządzenie może być urządzeniem blokowym lub plikiem obrazu takowego, lecz nie jest to wymuszone. Urządzenie znakowe nie zapewni wiele rozrywki :-).

source: The I<size-in-blocks> parameter is the desired size of the file system, in blocks. It is present only for backwards compatibility. If omitted the size will be determined automatically. Only block counts strictly greater than 10 and strictly less than 65536 are allowed.
pl: Parametr I<rozmiar-w-blokach> jest pożądanym rozmiarem systemu plików, wyrażonym jako liczba bloków. Jest obecny tylko w celu kompatybilności wstecznej. Jeśli pominięto rozmiar, to zostanie on określony automatycznie. Dozwolone są wyłącznie liczby bloków większe od 10 i mniejsze od 65536.

source: Check the device for bad blocks before creating the filesystem. If any are found, the count is printed.
pl: Przed utworzeniem systemu plików sprawdza uszkodzone bloki urządzenia. Jeżeli zostaną znalezione jakieś błędne bloki, to wyświetlana jest ich liczba.

source: Specify the maximum length of filenames. Currently, the only allowable values are 14 and 30 for file system versions 1 and 2. Version 3 allows only value 60. The default is 30.
pl: Określa maksymalną długość nazw plików. Obecnie dozwolone są wyłącznie wartości 14 i 30 w przypadku wersji 1 i 2 systemu plików. Wersja 3 pozwala wyłącznie na wartość 30. Domyślnie jest to 30.

source: Read the list of bad blocks from I<filename>. The file has one bad-block number per line. The count of bad blocks read is printed.
pl: Odczytuje listę uszkodzonych bloków z pliku o nazwie I<nazwa-pliku>. Plik zawiera po jednym numerze błędnego bloku w każdym wierszu. Wyświetlana jest liczba odczytanych błędnych bloków.

source: Make a Minix version 1 filesystem. This is the default.
pl: Tworzy system plików Minix w wersji 1. Tak jest domyślnie.

source: Display version information and exit. The long option cannot be combined with other options.
pl: Wypisuje informację o wersji programu i wychodzi. Długiej opcji nie można łączyć z innymi opcjami.

source: The mkfs.minix command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
pl: Polecenie mkfs.minix jest częścią pakietu util-linux i jest dostępne pod adresem https://www.kernel.org/pub/linux/utils/util-linux/.

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<"yes">. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it\(cqs recommended to avoid collisions with udevd or other tools.
pl: Używa blokady na wyłączność BSD do urządzeń i plików na których działa. Opcjonalnym argumentem I<tryb> może być B<yes>, B<no> (albo B<1> lub B<0>) lub też B<nonblock>. Jeśli nie poda się I<trybu>, domyślną wartością jest B<yes>. Opcja ta przesłania zmienną środowiskową B<$LOCK_BLOCK_DEVICE>. Choć domyślnie nie jest używana żadna blokada, zaleca się jej użycie aby uniknąć kolizji z udevd i innymi narzędziami.

source: Display version information and exit. The long option cannot be combined with other options.
pl: Wypisuje informację o wersji programu i wychodzi. Długiej opcji nie można łączyć z innymi opcjami.
