Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Hardware block device ID as generated by udevd. This identifier is usually based on WWN (unique storage identifier) and assigned by the hardware manufacturer. See B<ls /dev/disk/by-id> for more details, this directory and running udevd is required. This identifier is not recommended for generic use as the identifier is not strictly defined and it depends on udev, udev rules and hardware.
de: Hardware-Blockgerätekennung, wie sie von Udevd erzeugt wird. Dieser Kennzeichner basiert normalerweise auf WWN (eindeutiger Speicherkennzeichner) und wird vom Hersteller der Hardware zugewiesen. Siehe B<ls /dev/disk/by-id> für weitere Details; dieses Verzeichnis und ein laufender Udevd wird benötigt. Für den gewöhnlichen Einsatz wird dieser Kennzeichner nicht empfohlen, da er nicht streng definiert ist und von Udev, den Udev-Regeln und der Hardware abhängt.
fr: ID du périphérique bloc matériel tel que créé par IB<udevd>. Cet identificateur est habituellement basé sur WWN (world wide name – identificateur unique de stockage) et affecté par le fabricant du matériel. Consultez B<ls\ /dev/disk/by-id> pour plus de détails ; ce répertoire et l’exécution d’B<udevd> sont nécessaires. Cet identificateur n’est pas recommandé pour un usage général car il n’est pas défini strictement et dépend d’B<udev>, des règles d’B<udev> et du matériel.
pl: Identyfikator sprzętowego urządzenia blokowego taki jak generowany przez udevd. Zwykle opiera się na WWN (unikalnym identyfikatorze pamięci) i jest nadawany przez producenta sprzętu. Więcej informacji da wykonanie polecenia B<ls /dev/disk/by-id>; przy czym wymagane jest istnienie tego katalogu oraz działający udevd. Identyfikator ten nie jest zalecany do ogólnego zastosowania, jako że nie jest ściśle zdefiniowany oraz jest zależny od udev, reguł udev oraz sprzętu.
uk: Ідентифікатор апаратного блоку, згенерований udevd. Цей ідентифікатор зазвичай базується на WWN (унікальний ідентифікатор сховища) і призначає його виробник обладнання. Додаткову інформацію див. у B<ls /dev/disk/by-id>, цей каталог і запуск udevd необхідні. Цей ідентифікатор не рекомендується для загального використання, оскільки не є строго визначеним і залежить від udev, правил udev та обладнання.

source: The command B<lsblk --fs> provides an overview of filesystems, LABELs and UUIDs on available block devices. The command B<blkid -p E<lt>deviceE<gt>> provides details about a filesystem on the specified device.
de: Der Befehl B<lsblk --fs> bietet einen Überblick über Dateisysteme, BEZEICHNUNGEN und UUIDs auf verfügbaren blockorientierten Geräten. Der Befehl B<blkid -p E<lt>GerätE<gt>> zeigt Details zu einem Dateisystem auf dem angegebenen Gerät an.
fr: La commande B<lsblk --fs> fournit un récapitulatif des systèmes de fichiers, des LABEL et des UUID des périphériques blocs disponibles. La commande B<blkid -p E<lt>périphériqueE<gt>> fournit des détails sur le système de fichiers du périphérique indiqué.
pl: Polecenie B<lsblk --fs> udostępni przegląd systemów plików, etykiet (LABEL) oraz UUID-ów dla dostępnych urządzeń blokowych. Polecenie B<blkid -p E<lt>urządzenieE<gt>> wypisze szczegóły o systemie plików na podanym urządzeniu.
uk: Команда B<lsblk --fs> надає огляд файлових систем, міток та UUID на доступних блокових пристроях. Команда B<blkid -p E<lt>пристрійE<gt>> надає детальну інформацію про файлову систему на вказаному пристрої.

source: Don\(cqt forget that there is no guarantee that UUIDs and labels are really unique, especially if you move, share or copy the device. Use B<lsblk -o +UUID,PARTUUID> to verify that the UUIDs are really unique in your system.
de: Vergessen Sie nicht, dass es keine Garantie dafür gibt, dass UUIDs und Bezeichnungen wirklich eindeutig sind, insbesondere wenn Sie ein Gerät verschieben, freigeben oder kopieren. Mit B<lsblk -o +UUID,PARTITIONS-UUID> können Sie sicherstellen, dass die UUIDs in Ihrem System wirklich eindeutig sind.
fr: N’oubliez pas que les UUID et étiquettes ne sont pas garantis uniques, en particulier si vous déplacez, partagez ou copiez le périphérique. Utilisez B<lsblk -o +UUID,PARTUUID> pour vérifier que les UUID sont vraiment uniques sur le système.
pl: Proszę nie zapomnieć o tym, że nie ma gwarancji, że etykiety i UUID-y są faktycznie unikalne, szczególnie jeśli kopiuje się, współdzieli lub przenosi urządzenie. Polecenie B<lsblk -o +UUID,PARTUUID> pozwoli na zweryfikowanie unikalności UUID-ów w bieżącym systemie.
uk: Пам'ятайте, що унікальні UUID та міток не гарантована, особливо якщо ви переміщуєте, надаєте спільний доступ або копіюєте пристрій. Щоб переконатися, що UUID у вашій системі дійсно унікальні, скористайтесь B<lsblk -o +UUID,PARTUUID>.

source: The recommended setup is to use tags (e.g. B<UUID>=I<uuid>) rather than I</dev/disk/by-{label,uuid,id,partuuid,partlabel}> udev symlinks in the I</etc/fstab> file. Tags are more readable, robust and portable. The B<mount>(8) command internally uses udev symlinks, so the use of symlinks in I</etc/fstab> has no advantage over tags. For more details see B<libblkid>(3).
de: Wir empfehlen die Verwendung von Markierungen (z.B. B<UUID=>I<UUID>) anstelle Udev-Symlinks der Form I</dev/disk/by-{Bezeichnung,UUID,Partitions-UUID,Partitionsbezeichnung}> in der Datei I</etc/fstab>. Markierungen sind besser lesbar, robuster und besser portierbar. Der Befehl B<mount>(8) verwendet intern Udev-Symlinks, daher hat die Verwendung von Symlinks in der Datei I</etc/fstab> keinerlei Vorteile gegenüber Markierungen. Für weitere Details siehe B<libblkid>(3).
fr: La configuration conseillée est d'utiliser des mots-clés (par exemple, B<UUID=>I<uuid>) plutôt que les liens symboliques I</dev/disk/par->{I<label>,I<uuid>,I<partuuid>,I<partlabel>} d'B<udev> dans le fichier I</etc/fstab>. Les mots-clés sont plus facilement lisibles, explicites et portables. La commande B<mount>(8) utilise les liens symboliques d'B<udev> en interne, donc les utiliser directement dans I</etc/fstab> n'apporte aucun avantage par rapport aux mots-clés. Pour plus de précisions, consultez B<libblkid>(3).
pl: Zalecaną metodą jest używanie znaczników (np. B<LABEL>=I<etykieta>) zamiast dowiązań symbolicznych I</dev/disk/by->{I<label>,I<uuid>,I<id>,I<partuuid>,I<partlabel>} udev w pliku I</etc/fstab>. Znaczniki są bardziej czytelne, solidne i przenośne. Polecenie B<mount>(8) używa wewnętrznie dowiązań symbolicznych udev, tak więc ich używanie w I</etc/fstab> nie daje żadnej przewagi nad znacznikami. Aby dowiedzieć się więcej, proszę zapoznać się z B<libblkid>(3).
uk: Рекомендований підхід — вжити теги (наприклад B<UUID>=I<uuid>), а не символічні посилання udev I</dev/disk/by-{label,uuid,id,partuuid,partlabel}> у файлі I</etc/fstab>. Теги легше читати, є стійкими та переносними. Команда B<mount>(8) внутрішньо використовує символічні посилання udev, тож використання символічних посилань в I</etc/fstab> не має переваг над тегами. Детальніше можна почитати в B<libblkid>(3).

source: The I<proc> filesystem is not associated with a special device, and when mounting it, an arbitrary keyword - for example, I<proc> - can be used instead of a device specification. (The customary choice I<none> is less fortunate: the error message \(aqnone already mounted\(aq from B<mount> can be confusing.)
de: Das Dateisystem I<proc> ist keinem speziellen Gerät zugeordnet. Wenn Sie es einhängen, kann ein willkürlich gewähltes Schlüsselwort wie beispielsweise I<proc> anstelle der Angabe eines Gerätes verwendet werden. Die gebräuchliche Wahl I<none> ist weniger sinnvoll: Die Fehlermeldung von B<mount> »none ist bereits eingehängt« kann verwirrend sein.
fr: Le système de fichiers I<proc> n'est associé à aucun périphérique spécial, et pour le monter, un mot-clé quelconque, par exemple I<proc>, peut être utilisé à la place de l'indication de périphérique. Le choix courant B<none> (aucun) n'est pas très heureux, car le message d'erreur « none déjà monté » de B<mount> peut être mal interprété.
pl: System plików I<proc> nie jest związany z żadnym urządzeniem specjalnym i podczas jego montowania zamiast nazwy urządzenia można użyć dowolnego słowa kluczowego, np. I<proc> (zwyczajowy wybór I<none> jest mniej udany: komunikat błędu `none already mounted' (nic już zamontowane) od B<umount> może być mylący).
uk: Файлова система I<proc> не асоційована зі спецпристроєм, і коли її монтуємо, можна вжити довільне ключове слово - наприклад, I<proc> - замість специфікації пристрою. (Звичайний вибір I<none> є менш вдалим: повідомлення помилки \(aqжодного ще не змонтовано\(aq від B<mount> може спантеличувати).

source: The files /etc/fstab, /etc/mtab and /proc/mounts
de: Die Dateien /etc/fstab, /etc/mtab und /proc/mounts
fr: Les fichiers /etc/fstab, /etc/mtab et /proc/mounts
pl: Pliki /etc/fstab, /etc/mtab i /proc/mounts
uk: Файл /etc/fstab, /etc/mtab та /proc/mounts

source: The file I</etc/fstab> (see B<fstab>(5)), may contain lines describing what devices are usually mounted where, using which options. The default location of the B<fstab>(5) file can be overridden with the B<--fstab> I<path> command-line option (see below for more details).
de: Die Datei I</etc/fstab> (siehe B<fstab>(5)) kann Zeilen enthalten, die beschreiben, welche Geräte üblicherweise wo und mit welchen Optionen eingehängt werden. Der Standardort der Datei B<fstab>(5) kann mit der Befehlszeilenoption B<--fstab> I<Pfad> außer Kraft gesetzt werden (siehe unten für weitere Details).
fr: Le fichier I</etc/fstab> (consultez B<fstab>(5)) contient des lignes décrivant les périphériques habituellement montés, leur point de montage et leurs options. L’emplacement par défaut du fichier B<fstab>(5) peut être remplacé par l’option B<--fstab> I<chemin> en ligne de commande (voir ci-dessous pour plus de précisions).
pl: Plik I</etc/fstab> (zobacz B<fstab>(5)), może zawierać wiersze opisujące, jakie urządzenia gdzie są zazwyczaj montowane i przy użyciu jakich opcji. Domyślne położenie pliku B<fstab>(5) można przesłonić opcją wiersza poleceń B<--fstab> I<ścieżka> (więcej szczegółów poniżej).
uk: Файл I</etc/fstab> (див. B<fstab>(5)), може містити рядки, що описують, які пристрої переважно тут монтуються, за допомогою яких параметрів. Типове розташування файлу B<fstab>(5) можна змінити параметром командного рядка B<--fstab> I<path> (див. нижче про подробиці).

source: The command
de: Der Befehl
fr: La commande
pl: Polecenie
uk: Команда

source: B<mount -a> [B<-t> I<type>] [B<-O> I<optlist>]
de: B<mount -a> [B<-t> I<Typ>] [B<-O> I<Optionsliste>]
fr: B<mount -a> [B<-t> I<type>] [B<-O> I<liste_options>]
pl: B<mount -a> [B<-t> I<typ>] [B<-O> I<lista-opcji>]
uk: B<mount -a> [B<-t> I<тип>] [B<-O> I<список_параметрів>]

source: (usually given in a bootscript) causes all filesystems mentioned in I<fstab> (of the proper type and/or having or not having the proper options) to be mounted as indicated, except for those whose line contains the B<noauto> keyword. Adding the B<-F> option will make B<mount> fork, so that the filesystems are mounted in parallel.
de: (üblicherweise in einem Systemstartskript übergeben) führt dazu, dass alle in I<fstab> aufgeführten Dateisysteme (des korrekten Typs und/oder mit oder ohne korrekte Optionen) wie angegeben eingehängt werden, außer jene, deren Zeile das Schlüsselwort B<noauto> enthält. Mit der Option B<-F> wird B<mount> geforkt, so dass die Dateisysteme parallel eingehängt werden.
fr: (généralement exécutée dans un script de démarrage) monte tous les systèmes de fichiers indiqués dans I<fstab> (uniquement ceux du I<type> indiqué et possédant ou non les bonnes options), sauf ceux dont la ligne contient le mot-clé B<noauto>. En ajoutant l'option B<-F>, B<fork>(2) sera invoqué par B<mount> pour que tous les systèmes de fichiers soient montés en parallèle.
pl: (zwykle podawane w skryptach startowych) powoduje zamontowanie wszystkich systemów plików (danego typu) wymienionych w I<fstab>, poza tymi, których wpisy zawierają słowo kluczowe B<noauto>. Podanie opcji B<-F> spowoduje, że B<mount> się rozdzieli na kilka procesów, tak że systemy plików będą montowane równocześnie.
uk: (зазвичай, задають у скрипті завантаження) спричиняє монтування усіх згаданих файлових систем в I<fstab> (належного типу і/або таких, що мають або не мають належні параметри) так, як вказано, окрім тих, у рядку яких міститься ключове слово B<noauto>. Додавання параметра B<-F> призведе до розгалуження B<mount> для паралельного монтування файлових систем.

source: When mounting a filesystem mentioned in I<fstab> or I<mtab>, it suffices to specify on the command line only the device, or only the mount point.
de: Beim Einhängen eines in I<fstab> oder I<mtab> aufgelisteten Dateisystems genügt es, in der Befehlszeile nur das Gerät oder auch nur den Einhängepunkt anzugeben.
fr: Lors du montage d’un système de fichiers mentionné dans I<fstab> ou I<mtab>, il suffit d’indiquer soit le point de montage, soit le périphérique en ligne de commande.
pl: Podczas montowania systemu plików wymienionego w I<fstab> lub I<mtab>, wystarczy podać w wierszu poleceń tylko nazwę urządzenia lub tylko punkt montowania.
uk: Коли файлову систему для монтування згадують в I<fstab> або I<mtab>, в командному рядку достатньо вказати лише пристрій або лише точку монтування.

source: The programs B<mount> and B<umount>(8) traditionally maintained a list of currently mounted filesystems in the file I</etc/mtab>. The support for regular classic I</etc/mtab> is completely disabled at compile time by default, because on current Linux systems it is better to make I</etc/mtab> a symlink to I</proc/mounts> instead. The regular I<mtab> file maintained in userspace cannot reliably work with namespaces, containers and other advanced Linux features. If the regular I<mtab> support is enabled, then it\(cqs possible to use the file as well as the symlink.
de: Die Programme B<mount> und B<umount>(8) haben traditionell eine Liste der aktuell eingehängten Dateisysteme in der Datei I</etc/mtab> verwaltet. Die Unterstützung für die reguläre klassische Datei I</etc/mtab> ist bei der Kompilierung standardmäßig deaktiviert, da es auf aktuellen Linux-Systemen besser ist, stattdessen einen Symlink auf I</proc/mounts> zu legen. Die reguläre, auf Anwendungsebene verwaltete I<mtab>-Datei kann nicht zuverlässig mit Namensräumen, Containern und weiteren anspruchsvollen Linux-Funktionen umgehen. Falls die reguläre I<mtab>-Unterstützung aktiviert ist, dann ist es möglich, die Datei auch als Symlink zu verwenden.
fr: Les programmes B<mount> et B<umount>(8) entretiennent normalement une liste des systèmes de fichiers actuellement montés dans le fichier I</etc/mtab>. La prise en charge du fichier classique habituel I</etc/mtab> est par défaut complètement désactivée au moment de la compilation, parce que sur les systèmes Linux actuels, il est plutôt préférable de faire de I</etc/mtab/> un lien symbolique vers I</proc/mounts>. Le fichier I<mtab> habituel entretenu en espace utilisateur ne peut pas fonctionner de façon fiable avec les espaces de noms, les conteneurs et autres fonctionnalités avancées de Linux. Si la prise en charge du I<mtab> habituel est activée, alors il est possible d’utiliser le fichier comme le lien symbolique.
pl: Programy B<mount> i B<umount>(8) tradycyjnie opiekowały się listą obecnie zamontowanych systemów plików w pliku I</etc/mtab>. Obsługa klasycznego pliku I</etc/mtab> domyślnie jest całkowicie wyłączona przy kompilacji, ponieważ na aktualnych systemach linuksowych lepiej uczynić I</etc/mtab> dowiązaniem symbolicznym do I</proc/mounts>. Zwykły plik I<mtab> funkcjonujący w przestrzeni użytkownika nie działa stabilnie z przestrzeniami nazw, kontenerami i innymi zaawansowanymi funkcjami systemu Linux. Jeśli obsługa klasycznego pliku I<mtab> jest włączona, możliwe jest korzystanie z niego lub z dowiązania symbolicznego.
uk: Програми B<mount> і B<umount>(8) традиційно підтримували список поточних змонтованих файлових систем у файлі I</etc/mtab>. Підтримку звичайного класичного I</etc/mtab> типово повністю вимкнено під час компіляції, тому що в поточних системах Linux краще зробити I</etc/mtab> символьним посиланням на I</proc/mounts>. Звичайний файл I<mtab>, який зберігається в просторі користувача, не може надійно працювати з просторами назв, контейнерами та іншими розширеними функціями Linux. Якщо ввімкнено звичайну підтримку I<mtab>, то можна використовувати як файл, так і символьне посилання.

source: If no arguments are given to B<mount>, the list of mounted filesystems is printed.
de: Wenn an B<mount> keine Argumente übergeben werden, wird die Liste der eingehängten Dateisysteme ausgegeben.
fr: Si B<mount> est invoqué sans paramètre, la liste des systèmes de fichiers montés est affichée.
pl: Jeśli nie poda się argumentów do B<mount>, wypisywana jest lista zamontowanych systemów plików.
uk: Якщо аргументів B<mount> не надати, то друкується список змонтованих файлових систем.

source: If you want to override mount options from I</etc/fstab>, you have to use the B<-o> option:
de: Falls Sie Einhängeoptionen aus der Datei I</etc/fstab> außer Kraft setzen wollen, müssen Sie die Option B<-o> verwenden:
fr: Pour écraser les options de montage de I</etc/fstab>, l’option B<-o> doit être utilisée :
pl: Aby przesłonić opcje montowania z I</etc/fstab> konieczne jest użycie opcji B<-o>:
uk: Якщо ви хочете змінити параметри монтування з I</etc/fstab>, потрібно використати параметр B<-o>:

source: B<mount> I<device>|I<dir> B<-o> I<options>
de: B<mount> I<Gerät>|I<Verzeichnis> B<-o> I<Optionen>
fr: B<mount> I<périphérique>|I<répertoire> B<-o> I<options>

source: and then the mount options from the command line will be appended to the list of options from I</etc/fstab>. This default behaviour can be changed using the B<--options-mode> command-line option. The usual behavior is that the last option wins if there are conflicting ones.
de: Dann werden die Einhängeoptionen aus der Befehlszeile an die Liste der Optionen aus I</etc/fstab> angehängt. Dieses Standardverhalten können Sie mit der Befehlszeilenoption B<--options-mode> ändern. Standardmäßig wird die zuletzt angegebene Option gewählt, falls es Konflikte innerhalb der Optionen gibt.
fr: et ensuite les options de montage de la ligne de commande seront ajoutées à la liste des options de I</etc/fstab>. Ce comportement par défaut peut être modifié avec l’option de ligne de commande, B<--options-mode>. Le comportement normal est que la dernière option est prioritaire en cas de conflit.
pl: po czym opcje montowania z wiersza poleceń zostaną dodane do listy opcji z I</etc/fstab>. To domyślne zachowanie można zmienić opcją wiersza poleceń B<--options-mode>. Zwykłym zachowaniem jest działanie ostatniej opcji, jeśli występują sprzeczne.
uk: а потім параметри монтування з командного рядка буде додано до списку параметрів із I</etc/fstab>. Цю типову поведінку можна змінити за допомогою параметра командного рядка B<--options-mode>. Звичайна поведінка полягає в тому, що останній варіант перемагає, якщо є суперечливі.

source: The B<mount> program does not read the I</etc/fstab> file if both I<device> (or LABEL, UUID, ID, PARTUUID or PARTLABEL) and I<dir> are specified. For example, to mount device B<foo> at B</dir>:
de: Das Programm B<mount> liest die Datei I</etc/fstab> nicht, wenn sowohl das I<Gerät> (oder LABEL, UUID, ID, PARTUUID oder PARTLABEL) als auch das I<Verzeichnis> angegeben sind. Zum Beispiel können Sie das Gerät B<foo> in das B</Verzeichnis> folgendermaßen einhängen:
fr: Le programme B<mount> ne lit pas le fichier I</etc/fstab> si le I<périphérique> (ou LABEL, UUID, PARTUUID ou PARTLABEL) et le I<répertoire> sont indiqués tous les deux. Par exemple, pour monter le périphérique I<toto> dans I</répertoire> :
pl: Program B<mount> nie odczytuje pliku I</etc/fstab> jeśli podano I<urządzenie> (lub LABEL, UUID, ID, PARTUUID lub PARTLABEL) oraz I<katalog>. Na przykład, aby zamontować urządzenie B<foo> w B</katalogu>:
uk: Програма B<mount> не читає файлу I</etc/fstab>, якщо вказано разом I<пристрій> (або LABEL, UUID, ID, PARTUUID або PARTLABEL) і I<каталог>. Наприклад, щоб встановити пристрій B<foo> на B</dir>:

source: B<mount /dev/foo /dir>
de: B<mount /dev/foo /Verzeichnis>
fr: B<mount /dev/>I<toto /répertoire>
pl: B<mount /dev/foo /katalog>
uk: B<mount /dev/foo /каталог>

source: This default behaviour can be changed by using the B<--options-source-force> command-line option to always read configuration from I<fstab>. For non-root users B<mount> always reads the I<fstab> configuration.
de: Dieses Standardverhalten können Sie mit der Befehlszeilenoption B<--options-source-force> ändern, so das die Konfiguration immer aus der Fstab-Datei gelesen wird. Für Benutzer ohne Root-Rechte liest B<mount> immer die I<fstab>-Konfiguration.
fr: Ce comportement par défaut est modifiable avec l’option de ligne de commande, B<--options-source-force>, pour toujours lire la configuration à partir de I<fstab>. Pour les utilisateurs ordinaires, B<mount> lit toujours la configuration dans I<fstab>.
pl: To domyślne zachowanie można zmienić opcją wiersza poleceń B<--options-source-force>, aby zawsze odczytywać konfigurację z I<fstab>. W przypadku zwykłych użytkowników, B<mount> zawsze odczytuje konfigurację I<fstab>.
uk: За допомогою параметра командного рядка B<--options-source-force> цю типову поведінку можна змінити, щоб завжди читати конфігурацію з I<fstab>. Для користувачів, які не мають права root, B<mount> завжди читає конфігурацію I<fstab>.

source: Non-superuser mounts
de: Einhängungen als normaler Benutzer
fr: Les montages pour les utilisateurs ordinaires
pl: Montowanie przez zwykłych użytkowników
uk: Монтування без прав суперкористувача

source: Normally, only the superuser can mount filesystems. However, when I<fstab> contains the B<user> option on a line, anybody can mount the corresponding filesystem.
de: Normalerweise kann nur der Systemverwalter Dateisysteme einhängen. Dennoch kann das jeder tun, wenn in der Datei I<fstab> die entsprechende Zeile des Dateisystems die Option B<user> enthält.
fr: Normalement, seul le superutilisateur peut monter des systèmes de fichiers. Néanmoins, si une ligne dans I<fstab> contient l'option B<user>, n'importe quel utilisateur peut monter le système de fichiers correspondant.
pl: Tradycyjnie, tylko superużytkownik może montować systemy plików. Jednak jeśli I<fstab> w danym wierszu zawiera opcję B<user>, to każdy może zamontować odpowiadający temu wpisowi system plików.
uk: Зазвичай тільки суперкористувач може монтувати файлові системи. Однак, коли I<fstab> містить у рядку параметр B<user>, будь-хто може змонтувати відповідну файлову систему.

source: Thus, given a line
de: Dadurch kann aufgrund der Zeile
fr: Ainsi, avec la ligne suivante :
pl: Tak więc, jeśli mamy wiersz
uk: Тому, якщо задано рядок

source: any user can mount the iso9660 filesystem found on an inserted CDROM using the command:
de: jeder Benutzer das auf einer eingelegten CD-ROM befindliche ISO9660-Dateisystem mit folgendem Befehl einhängen:
fr: n'importe quel utilisateur peut monter le système de fichiers ISO 9660 d’un CD inséré en utilisant la commande :
pl: to dowolny użytkownik może zamontować system plików iso9660 umieszczony na włożonym CD-ROM-ie, posługując się poleceniem
uk: будь-який користувач зможе монтувати знайдені на вставленому компакт-диску файлові системи iso9660 за допомогою такої команди:

source: B<mount /cd>
fr: B<mount> I</cd>
