Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Note that B<mount> is very strict about non-root users and all paths specified on command line are verified before I<fstab> is parsed or a helper program is executed. It\(cqs strongly recommended to use a valid mountpoint to specify filesystem, otherwise B<mount> may fail. For example it\(cqs a bad idea to use NFS or CIFS source on command line.
de: Beachten Sie, dass B<mount> sehr strikt gegenüber normalen Benutzern ist und alle in der Befehlszeile angegebenen Pfade überprüft werden, bevor die Datei I<fstab> ausgewertet oder ein Hilfsprogramm ausgeführt wird. Es wird ausdrücklich empfohlen, einen gültigen Einhängepunkt für das Dateisystem anzugeben, anderenfalls könnte B<mount> fehlschlagen. Es ist beispielsweise eine schlechte Idee, NFS- oder CIFS-Quellen in der Befehlszeile zu verwenden.
fr: Remarquez que B<mount> est très strict au sujet des utilisateurs ordinaires et tous les chemins indiqués sur la ligne de commande sont vérifiés avant que I<fstab> soit analysé ou qu’un programme d’assistance soit exécuté. Il est fortement recommandé d’utiliser un point de montage autorisé pour indiquer un système de fichiers, sinon B<mount> échouera. Par exemple, c’est une mauvaise idée d’utiliser une source NFS ou CIFS dans la ligne de commande.
pl: Proszę zauważyć, że B<mount> jest bardzo restrykcyjny w przypadku zwykłych użytkowników; wszystkie ścieżki podane w wierszu poleceń są weryfikowane, przed przetworzeniem I<fstab> lub wykonaniem programu pomocniczego. Usilnie zaleca się używanie prawidłowego punktu montowania przy podawaniu systemu plików, w innym przypadku B<mount> może zwrócić błąd. Złym pomysłem jest na przykład użycie źródła CIFS lub NFS w wierszu poleceń.
uk: Зауважте, що B<mount> дуже суворо ставиться до користувачів, які не мають права root, і всі шляхи, зазначені в командному рядку, перевіряються перед аналізом I<fstab> або виконанням допоміжної програми. Дуже бажано використовувати для визначення файлової системи дійсну точку монтування, інакше B<mount> може вийти з ладу. Наприклад, поганою ідеєю є використовувати джерело NFS або CIFS у командному рядку.

source: Since util-linux 2.35, B<mount> does not exit when user permissions are inadequate according to libmount\(cqs internal security rules. Instead, it drops suid permissions and continues as regular non-root user. This behavior supports use-cases where root permissions are not necessary (e.g., fuse filesystems, user namespaces, etc).
de: Seit der Version 2.35 von Util-linux beendet sich B<mount> nicht, wenn die Benutzerberechtigungen aufgrund der Libmount-Sicherheitsregeln nicht ausreichend sind. Stattdessen gibt es die Suid-Berechtigungen ab und fährt als normaler (nicht root) Benutzer fort. Damit werden Anwendungsfälle ermöglicht, bei denen Root-Berechtigungen nicht notwendig sind (z.B. Fuse-Dateisysteme, Benutzernamensräume usw.).
fr: Depuis la version 2.35, la commande B<mount> ne termine pas lorsque les permissions de l’utilisateur sont insuffisantes selon les règles de sécurité internes de B<libmount>. Il baisse les permissions suid et continue comme un utilisateur habituel simple. Il permet la prise en charge de cas d’utilisation où les droits de superutilisateur ne sont pas nécessaires (par exemple, des systèmes de fichiers FUSE, les espaces de noms d’utilisateur, etc).
pl: Od util-linux 2.35, B<mount> nie wychodzi, w przypadku gdy uprawnienia użytkownika są niewystarczające zgodnie z wewnętrznymi regułami bezpieczeństwa libmount. Program porzuca wówczas uprawnienia suid i kontynuuje jako zwykły użytkownik. To zachowanie pozwala na obsługę przypadków, gdy uprawnienia roota nie są wymagane (np. systemy plików w przestrzeni użytkownika, przestrzeń nazw użytkownika itp).
uk: Починаючи від util-linux 2.35, B<mount> не завершує роботу, якщо дозволи користувача є недостатніми відповідно до внутрішніх правил безпеки libmount. Натомість, програма скидає дозволи suid і продовжує роботу від імені звичайного користувача без прав root. Цю поведінку реалізовано для випадків, коли права root не потрібні (наприклад, об'єднання файлових систем, просторів назв користувача тощо).

source: For more details, see B<fstab>(5). Only the user that mounted a filesystem can unmount it again. If any user should be able to unmount it, then use B<users> instead of B<user> in the I<fstab> line. The B<owner> option is similar to the B<user> option, with the restriction that the user must be the owner of the special file. This may be useful e.g. for I</dev/fd> if a login script makes the console user owner of this device. The B<group> option is similar, with the restriction that the user must be a member of the group of the special file.
de: Weitere Details finden Sie in B<fstab>(5). Nur der Benutzer, der ein Dateisystem eingehängt hat, kann es auch wieder aushängen. Wenn jeder Benutzer in der Lage sein soll, es auszuhängen, schreiben Sie B<users> statt B<user> in die I<fstab>-Zeile. Die Option B<owner> ähnelt B<user>, allerdings mit der Einschränkung, dass der Benutzer Eigentümer der speziellen Datei sein muss. Dies kann zum Beispiel für I</dev/fd> nützlich sein, wenn ein Anmeldeskript den Konsolenbenutzer zum Eigentümer dieses Gerätes macht. Die Option B<group> ist ähnlich, wobei der Benutzer Mitglied der Gruppe der speziellen Datei sein muss.
fr: Pour plus de précisions, consultez B<fstab>(5). Seul l'utilisateur qui a monté un système de fichiers peut le démonter. Si tous les utilisateurs doivent pouvoir faire le démontage, alors utilisez B<users> à la place de B<user> dans la ligne de I<fstab>. L'option B<owner> est similaire à B<user> avec la contrainte que l'utilisateur doit être le propriétaire du fichier spécial. Cela peut servir par exemple pour I</dev/fd> si un script de connexion rend l'utilisateur de la console propriétaire de ce fichier spécial. L'option B<group> est similaire avec la contrainte que l'utilisateur doit appartenir au groupe de ce fichier spécial.
pl: Szczegóły opisuje B<fstab>(5). Tylko użytkownik, który zamontował system plików może ponownie go odmontować. Jeżeli zachodzi potrzeba, by odmontowywać mógł każdy, w odpowiednim wierszu I<fstab> należy zamiast B<user> wpisać B<users>. Opcja B<owner> przypomina opcję B<user>, poza tym, że dany użytkownik musi być właścicielem odpowiedniego pliku specjalnego. Jest przydatna np. w przypadku I</dev/fd> jeśli skrypt zgłoszeniowy (login script) czyni danego użytkownika korzystającego z konsoli właścicielem tego urządzenia. Opcja B<group> jest podobna, z tym ograniczeniem, że użytkownik musi być członkiem grupy pliku specjalnego.
uk: Докладніше див. у B<fstab>(5). Тільки користувач, який змонтував файлову систему, може знову її демонтувати. Щоб це міг зробити будь-який користувач, замість B<user> у рядку I<fstab> скористайтесь B<users>. Параметр B<owner> подібний до варіанту B<user>, з тим обмеженням, що користувач має бути власником спеціального файлу. Це може бути корисно, наприклад, для I</dev/fd>, якщо скрипт входу робить користувача консолі власником цього пристрою. Варіант B<group> подібний, з обмеженням: користувач має бути членом групи спеціального файлу.

source: Bind mount operation
de: Bind-Einhängevorgang
fr: Les opérations de montage « bind »
pl: Operacja montowania przez podpięcie (ang. bind mount)
uk: Дія з монтування з прив'язуванням

source: Remount part of the file hierarchy somewhere else. The call is:
de: Hängt Teile der Dateihierarchie an einer anderen Stelle erneut ein. Der Aufruf lautet:
fr: Remontage d’une partie de la hiérarchie de fichiers autre part. L’appel est :
pl: Możliwe jest ponowne zamontowanie części systemu plików w innym miejscu. Służy do tego wywołanie:
uk: Перемонтування частини файлової ієрархії у якесь інше місце. Виклик:

source: B<mount --bind> I<olddir newdir>
de: B<mount --bind> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount --bind> I<ancien_répertoire nouveau_répertoire>
pl: B<mount --bind> I<stary-katalog nowy-katalog>
uk: B<mount --bind> I<старий_каталог новий_каталог>

source: or by using this I<fstab> entry:
de: oder mit diesem I<fstab>-Eintrag:
fr: ou en utilisant cette entrée de I<fstab> :
pl: lub za pomocą tego wpisu I<fstab>:
uk: або за допомогою цього запису I<fstab>:

source: B</>I<olddir> B</>I<newdir> B<none bind>
de: B</>I<Altes_Verzeichnis> B</>I<Neues_Verzeichnis> B<none bind>
fr: B</>I<ancien_répertoire> B</>I<nouveau_répertoire> B<none bind>
pl: B</>I<stary-katalog> B</>I<nowy-katalog> B<none bind>
uk: B</>I<старий_каталог> B</>I<новий_каталог> B<none bind>

source: After this call the same contents are accessible in two places.
de: Nach diesem Aufruf ist der gleiche Inhalt an zwei Stellen verfügbar.
fr: Après cet appel, les mêmes contenus sont accessibles dans deux endroits.
pl: Po tym wywołaniu ta sama zawartość jest dostępna w dwóch miejscach.
uk: Після цього виклику ті самі дані будуть доступними у двох місцях.

source: It is important to understand that "bind" does not create any second-class or special node in the kernel VFS. The "bind" is just another operation to attach a filesystem. There is nowhere stored information that the filesystem has been attached by a "bind" operation. The I<olddir> and I<newdir> are independent and the I<olddir> may be unmounted.
de: Es ist wichtig zu verstehen, dass Bind keinerlei zweitklassige oder Spezial-Knoten im Kernel-VFS erstellt. Das »Binden« ist lediglich eine andere Aktion zum Einbinden eines Dateisystems. Darüber, dass das Dateisystem durch eine »Bind«-Aktion eingehängt wurde, werden nirgends Informationen gespeichert. Das und das I<neue_Verzeichnis> sind unabhängig und das I<alte_Verzeichnis> könnte ausgehängt sein.
fr: Il est aussi important de comprendre que « bind » ne crée aucun nœud de seconde classe ou spécial dans le VFS du noyau. « bind » est seulement une autre opération pour attacher un système de fichiers. Il n’existe pas d’information enregistrée indiquant que le système de fichiers a été attaché par une opération « bind ». L’I<ancien_répertoire> et le I<nouveau_répertoire> sont indépendants et l’I<ancien_répertoire> peut être non monté.
pl: Ważne jest zrozumienie, że w wirtualnym systemie plików jądra (VFS) operacja ta nie tworzy żadnego węzła gorszego sortu, czy specjalnego typu. Jest to jedynie inny sposób na dołączenie systemu plików. Informacja o tym, że system plików został podpięty za pomocą "bind" nie jest nigdzie przechowywana. I<Stary-katalog> i I<nowy-katalog> są niezależne od siebie, a I<stary-katalog> może być odmontowany.
uk: Варто зауважити, що «bind» не створює жодних другорядних або спеціальних вузлів у VFS ядра. «bind» є просто ще однією дією для приєднання файлових систем. Не зберігається жодної інформації про те, що саме "bind" приєднав файлову систему. I<olddir> та I<newdir> є незалежними та I<olddir> можна демонтувати.

source: One can also remount a single file (on a single file). It\(cqs also possible to use a bind mount to create a mountpoint from a regular directory, for example:
de: Sie können auch eine einzelne Datei (in einer einzelnen Datei) einhängen. Es ist auch möglich, eine Bind-Einhängung zu verwenden, um einen Einhängepunkt aus einem regulären Verzeichnis zu erzeugen, zum Beispiel:
fr: Un fichier unique peut également être remonté (sur un fichier unique). Il est aussi possible d’utiliser le montage avec « bind » pour créer un point de montage à partir d'un répertoire normal, par exemple :
pl: Można również zamontować ponownie pojedynczy plik (na pojedynczym pliku). Jest także możliwe użycie montowania "bind" do utworzenia punktu montowania ze zwykłego katalogu, na przykład:
uk: Можна також перемонтувати окремий файл (до окремого файла). Також можна використати монтування прив'язки, щоб створити точку монтування зі звичайного каталогу, наприклад:

source: B<mount --bind foo foo>
fr: B<mount --bind> I<toto toto>

source: The bind mount call attaches only (part of) a single filesystem, not possible submounts. The entire file hierarchy including submounts can be attached a second place by using:
de: Der Bind-Einhängeaufruf hängt nur (Teile eines) einzelnen Dateisystems an, nicht eventuelle Untereinhängungen. Die gesamte Dateihierarchie einschließlich Untereinhängungen kann folgendermaßen an einem zweiten Ort eingehängt werden:
fr: L'appel de montage avec « bind » n'attache qu'un unique système de fichiers (ou une partie), et pas les éventuels sous-montages. La hiérarchie complète, y compris les sous-montages, peut être attachée dans un second endroit avec :
pl: Wywołanie montowania przez podpięcie dołącza tylko (część) pojedynczego systemu plików, bez możliwych montowań znajdujących się poniżej. Cała hierarchia plików, uwzględniając takie montowania może być dołączana w drugie miejsce za pomocą:
uk: Виклик монтування з прив'язкою долучає до ієрархії файлової системи лише (частину) окремої файлової системи, а не можливі підлеглі її монтування. Усю ієрархію, разом із підлеглими монтуваннями, може бути долучено на другому кроці за допомогою такої команди:

source: B<mount --rbind> I<olddir newdir>
de: B<mount --rbind> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount --rbind> I<ancien_répertoire nouveau_répertoire>
pl: B<mount --rbind> I<stary-katalog nowy-katalog>
uk: B<mount --rbind> I<старий_каталог новий_каталог>

source: Note that the filesystem mount options maintained by the kernel will remain the same as those on the original mount point. The userspace mount options (e.g., _netdev) will not be copied by B<mount> and it\(cqs necessary to explicitly specify the options on the B<mount> command line.
de: Beachten Sie, dass die vom Kernel verwalteten Einhängeoptionen des Dateisystems die gleichen wie im ursprünglichen Einhängepunkt sind. Die Einhängeoptionen auf Anwendungsebene (z.B. _netdev) werden von B<mount>(8) nicht kopiert, daher ist es nötig, die Optionen explizit in der Befehlszeile an B<mount> zu übergeben.
fr: Remarquez que les options de montage du système de fichiers entretenues par le noyau resteront les mêmes que celles du point de montage d'origine. Les options de montage en espace utilisateur (par exemple, B<_netdev>) ne pourront pas être copiées par B<mount>(8) et il est nécessaire de préciser les options sur la ligne de commande de B<mount>.
pl: Proszę zauważyć, że opcje montowania systemu plików zarządzane przez jądro pozostaną takie same jak te pierwotnego punktu montowania. Opcje montowania w przestrzeni użytkownika (np. _netdev) nie zostaną skopiowane przez B<mount> i trzeba je jawnie podać w wierszu polecenia B<mount>.
uk: Зауважте, що параметри монтування файлової системи, супровід яких здійснює ядро системи, лишаться тими самими, що і у початкової точки монтування. Параметри монтування простору користувача (наприклад _netdev) не буде скопійовано B<mount> — їх слід явним чином вказати у параметрах рядка команди B<mount>.

source: Since util-linux 2.27 B<mount> permits changing the mount options by passing the relevant options along with B<--bind>. For example:
de: Seit Version 2.27 von Util-linux erlaubt B<mount> die Änderung der Einhängeoptionen durch Übergeben der relevanten Optionen mit B<--bind>. Zum Beispiel:
fr: B<mount> depuis la version 2.27 permet de modifier les options de montage en passant les options adéquates avec B<--bind>. Par exemple :
pl: Od util-linux 2.27 B<mount> pozwala zmieniać opcje montowania przez przekazanie ich razem z B<--bind> np.:
uk: Починаючи з версії util-linux 2.27, B<mount> надає змогу змінювати параметри монтування передаванням відповідних параметрів разом із B<--bind>. Приклад:

source: B<mount -o bind,ro foo foo>
fr: B<mount -o bind,ro> I<toto toto>

source: This feature is not supported by the Linux kernel; it is implemented in userspace by an additional B<mount>(2) remounting system call. This solution is not atomic.
de: Diese Funktion wird vom Linux-Kernel nicht unterstützt. Sie ist auf Anwendungsebene durch einen zusätzlichen B<mount>(2)-Systemaufruf zum erneuten Einhängen implementiert. Diese Lösung ist nicht atomar.
fr: Cette fonctionnalité n’est pas gérée par le noyau Linux. Elle est mise en œuvre dans l’espace utilisateur par un appel système supplémentaire de remontage B<mount>(2). Cette solution n’est pas atomique.
pl: Opcja ta nie jest obsługiwana przez jądro Linux, jest zaimplementowana w przestrzeni użytkownika przez dodatkowe przemontowanie za pomocą wywołania systemowego B<mount>(2). To rozwiązanie nie jest nierozdzielne (atomowe).
uk: Ця функція не підтримується ядром Linux; її виконано у просторі користувача за допомогою додаткових системних викликів B<mount>(2). Це рішення не є атомарним.

source: The alternative (classic) way to create a read-only bind mount is to use the remount operation, for example:
de: Der alternative (klassische) Weg zur Erzeugung einer schreibgeschützten Bind-Einhängung ist eine Aktion zum erneuten Einhängen, zum Beispiel:
fr: L’autre manière (classique) de créer un montage avec « bind » en lecture seule est d’utiliser une opération de remontage, par exemple :
pl: Alternatywnym (klasycznym) sposobem utworzenia montowania przez podpięcie, tylko do odczytu, jest operacja przemontowania np.:
uk: Альтернативним (класичним) способом створення призначеного лише для читання монтування з прив'язкою є використання дії з перемонтування. Приклад:

source: B<mount -o remount,bind,ro> I<olddir newdir>
de: B<mount -o remount,bind,ro> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount -o remount,bind,ro> I<ancien_répertoire nouveau_répertoire>
pl: B<mount -o remount,bind,ro> I<stary-katalog nowy-katalog>
uk: B<mount -o remount,bind,ro> I<старий_каталог новий_каталог>

source: Note that a read-only bind will create a read-only mountpoint (VFS entry), but the original filesystem superblock will still be writable, meaning that the I<olddir> will be writable, but the I<newdir> will be read-only.
de: Beachten Sie, dass eine schreibgeschützte Bind-Einhängung zwar einen schreibgeschützten Einhängepunkt erzeugt, der Superblock des Originaldateisystems aber schreibbar bleibt, was bedeutet, dass in das I<alte_Verzeichnis> weiterhin geschrieben werden kann, in das I<neue_Verzeichnis> dagegen nicht.
fr: Remarquez que le montage « bind » créera un point de montage en lecture seule (entrée VFS) mais que le superbloc du système de fichiers d’origine sera toujours accessible en écriture. Cela signifie que l’I<ancien_répertoire> sera accessible en écriture mais que le I<nouveau_répertoire> sera en lecture seule.
pl: Proszę zauważyć, że tego typu montowanie utworzy punkt montowania tylko do odczytu (wpis VFS), ale oryginalny superblok systemu plików wciąż będzie zapisywalny, tzn. I<stary-katalog> będzie zapisywalny, a I<nowy-katalog> tylko do odczytu.
uk: Зауважте, що придатна лише для читання прив'язка створить придатну лише до читання точку монтування (запис VFS), але суперблок початкової файлової системи залишиться придатним до запису, що означає, що I<старий_каталог> буде придатним до запису, але I<новий_каталог> буде придатним лише до читання.

source: It\(cqs also possible to change nosuid, nodev, noexec, noatime, nodiratime, relatime and nosymfollow VFS entry flags via a "remount,bind" operation. The other flags (for example filesystem-specific flags) are silently ignored. It\(cqs impossible to change mount options recursively (for example with B<-o rbind,ro>).
de: Es ist ebenfalls möglich, die Schalter »nosuid«, »nodev«, »noexec«, »noatime«, »nodiratime«, »relatime« und »nosymfollow« des VFS-Eintrags durch die Aktion »remount,bind« zu ändern. Die anderen (zum Beispiel die dateisystemspezifischen Schalter) werden stillschweigend ignoriert. Dagegen ist es nicht möglich, Einhängeoptionen rekursiv zu ändern (zum Beispiel mit B<-o rbind,ro>).
fr: Il est aussi possible de remplacer les drapeaux d’entrées VFS B<nosuid>, B<nodev>, B<noexec>, B<noatime>, B<nodiratime>, B<relatime> et B<nosymfollow> par l’opération B<remount,bind>. Les autres (par exemple, les drapeaux spécifiques à des systèmes de fichiers) sont ignorés silencieusement. Il est impossible de modifier les options de montage de manière récursive (par exemple, avec B<-o rbind,ro>).
uk: Можна також змінити прапорці запису VFS nosuid, nodev, noexec, noatime, nodiratime, relatime та nosymfollow за допомогою дії «remount,bind». Інші прапорці (наприклад прапорці, специфічні для файлової системи) буде без повідомлень проігноровано. Не можна змінювати параметри монтування рекурсивно (наприклад за допомогою B<-o rbind,ro>).

source: Since util-linux 2.31, B<mount> ignores the B<bind> flag from I</etc/fstab> on a B<remount> operation (if B<-o remount> is specified on command line). This is necessary to fully control mount options on remount by command line. In previous versions the bind flag has been always applied and it was impossible to re-define mount options without interaction with the bind semantic. This B<mount> behavior does not affect situations when "remount,bind" is specified in the I</etc/fstab> file.
de: B<mount>(8) ignoriert seit Version 2.31 von Util-linux den B<bind>-Schalter in der Datei I</etc/fstab> bei der B<remount>-Aktion (falls B<-o remount> in der Befehlszeile angegeben wird). Dies ist notwendig, um die Einhängeoptionen beim erneuten Einhängen in der Befehlszeile vollständig steuern zu können. In früheren Versionen wurde der Bind-Schalter immer angewendet, wodurch ohne Interaktion mit der Bind-Semantik keine Einhängeoptionen neu definiert werden konnten. Dieses Verhalten von B<mount> beeinflusst nicht die Fälle, in denen »remount,bind« in der Datei I</etc/fstab> angegeben ist.
fr: B<mount>(8) depuis util-linux 2.31 ignore le drapeau B<bind> dans I</etc/fstab> lors de B<remount> I<opération> (si B<-o remount> est indiqué sur la ligne de commande). Cela est nécessaire pour contrôler complètement les options de B<mount> lors du remontage par la ligne de commande. Dans les précédentes versions, le drapeau B<bind> était toujours appliqué et il était impossible de redéfinir les options de montage sans interaction avec la sémantique de « bind ». Ce comportement de B<mount>(8) n’affecte pas les situations où B<remount,bind> est indiqué dans le fichier I</etc/fstab>.
uk: Починаючи з util-linux 2.31, B<mount> ігнорує прапорець B<bind> з I</etc/fstab> при виконанні дії B<remount> (якщо у рядку команди вказано B<-o remount>). Це необхідно для повного контролю над параметрами монтування при перемонтуванні за допомогою командного рядка. У попередніх версіях завжди застосовувався прапорець прив'язування, і не можна було перевизначити параметри монтування без взаємодії із семантикою прив'язування. Ця поведінка B<mount> не впливає на випадки, коли «remount,bind» вказано у файлі I</etc/fstab>.

source: The move operation
de: Die Verschiebe-Aktion
fr: Les opérations de déplacement
pl: Operacja przenoszenia
uk: Дія з пересування

source: Move a B<mounted tree> to another place (atomically). The call is:
de: Verschiebt einen B<eingehängten Baum> (atomar) an einen anderen Ort. Der Aufruf lautet:
fr: Déplacer de façon atomique une B<arborescence montée> à un autre endroit. L'appel est :
pl: Przenosi nierozdzielne (atomowo) B<zamontowane drzewo> w inne miejsce. Wywołaniem jest:
uk: Пересунути B<змонтовану ієрархію> до іншого місця (атомарно). Виклик:

source: B<mount --move> I<olddir newdir>
de: B<mount --move> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount --move> I<ancien_répertoire nouveau_répertoire>
pl: B<mount --move> I<stary-katalog nowy-katalog>
uk: B<mount --move> I<старий_каталог новий_каталог>
