Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: It is possible that the files I</etc/mtab> and I</proc/mounts> don't match on systems with a regular I<mtab> file. The first file is based only on the mount command options, but the content of the second file also depends on the kernel and others settings (e.g.\& on a remote NFS server -- in certain cases the mount command may report unreliable information about an NFS mount point and the I</proc/mount> file usually contains more reliable information.) This is another reason to replace the I<mtab> file with a symlink to the I</proc/mounts> file.
de: Es ist möglich, dass die Dateien I</etc/mtab> und I</proc/mounts> auf Systemen mit einer regulären I<mtab>-Datei nicht übereinstimmen. Die erste Datei basiert lediglich auf den Befehlszeilenoptionen von mount, während der Inhalt der zweiten Datei auch vom Kernel und weiteren Einstellungen abhängt (zum Beispiel auf einem fernen NFS-Server – in bestimmten Fällen könnte der Mount-Befehl unzuverlässige Informationen zu einem NFS-Einhängepunkt liefern, während die Datei I</proc/mounts> üblicherweise zuverlässigere Informationen enthält). Dies ist ein weiterer Grund, die I<mtab>-Datei durch einen Symlink auf die Datei I</proc/mounts> zu ersetzen.
fr: Les fichiers I</etc/mtab> et I</proc/mounts> pourraient ne pas correspondre sur les systèmes avec un ficher I<mtab> normal. Le premier est seulement basé sur les options de la commande B<mount>, mais le second tient compte de la configuration du noyau et d'autres paramètres (par exemple, pour un serveur NFS distant : dans certains cas, la commande B<mount> peut renvoyer des informations incorrectes à propos des points de montage NFS et en général I</proc/mounts> contient des informations plus sûres). C’est une autre raison de remplacer le fichier I<mtab> par un lien symbolique vers le fichier I</proc/mounts>.
pl: Zdarza się, że pliki I</etc/mtab> i I</proc/mounts> nie odpowiadają sobie, na systemach ze zwykłym plikiem I<mtab>. Pierwszy plik opiera się wyłącznie na opcjach poleceń mount, a zawartość drugiego zależy również od jądra i innych ustawień (np. na zdalnym serwerze NFS – w szczególnych przypadkach, polecenie mount może dawać niepewne informacje o punkcie montowania NFS; plik I</proc/mounts> zawiera z reguły pewniejsze informacje). Jest to kolejny powód do zastąpienia pliku I<mtab> dowiązaniem symbolicznym do pliku I</proc/mounts>.
uk: Можливо, файли I</etc/mtab> та I</proc/mounts> не збігаються в системах зі звичайним файлом I<mtab>. Перший файл заснований лише на параметрах команди B<mount>, але вміст другого файлу також залежить від ядра та інших налаштувань (наприклад, на віддаленому сервері NFS — у деяких випадках команда B<mount> може повідомляти ненадійну інформацію про точку монтування NFS, а файл I</proc/mount> зазвичай містить більш надійну інформацію.) Це ще одна причина замінити файл I<mtab> символьним посиланням на файл I</proc/mounts>.

source: Checking files on NFS filesystems referenced by file descriptors (i.e.\& the B<fcntl> and B<ioctl> families of functions) may lead to inconsistent results due to the lack of a consistency check in the kernel even if the B<noac> mount option is used.
de: Die auf Dateideskriptoren basierende Überprüfung von Dateien auf NFS-Dateisystemen (d.h.\& die Funktionsfamilien B<fcntl> und B<ioctl>) könnte zu inkonsistenten Ergebnissen führen, weil im Kernel eine Konsistenzprüfung selbst dann fehlt, wenn die Einhängeoption B<noac> verwendet wird.
fr: Vérifier les fichiers d'un système de fichiers NFS avec des descripteurs de fichiers (c'est-à-dire, les fonctions de la famille B<fcntl> et B<ioctl>) peuvent renvoyer de mauvais résultats à cause de la faible vérification des événements dans le noyau si l'option B<noac> de montage est utilisée.
uk: Перевірка у файлових системах NFS файлів, на які посилаються дескриптори файлів (тобто сімейства функцій B<fcntl> і B<ioctl>), може призвести до невідповідних результатів через відсутність перевірки узгодженості в ядрі, навіть якщо використовується параметр монтування B<noac>.

source: The B<loop> option with the B<offset> or B<sizelimit> options used may fail when using older kernels if the B<mount> command can't confirm that the size of the block device has been configured as requested. This situation can be worked around by using the B<losetup> command manually before calling B<mount> with the configured loop device.
de: Die Option B<loop> könnte mit den Optionen B<offset> oder B<sizelimit> mit älteren Kerneln fehlschlagen, wenn der Befehl B<mount> nicht sicherstellen kann, dass die Größe des blockorientierten Geräts nicht wie angefordert eingerichtet wurde. Diese Situation kann umgangen werden, indem Sie den Befehl B<losetup> manuell aufrufen, bevor Sie B<mount> mit dem konfigurierten Loop-Gerät aufrufen.
fr: L’option B<loop> utilisée avec les options B<offset> ou B<sizelimit> pourrait échouer sur les noyaux plus anciens si la commande B<mount> ne peut pas confirmer que la taille du périphérique bloc a été configurée comme demandé. Cette situation peut être contournée en utilisant la commande B<losetup> vous-même avant d’appeler B<mount> avec le périphérique boucle configuré.
pl: Opcja B<loop> używana razem z opcjami B<offset> lub B<sizelimit> może nie powieść się, gdy używa się starszych jąder, a polecenie B<mount> nie może potwierdzić, że rozmiar urządzenia blokowego został skonfigurowany zgodnie z żądaniem. Można to obejść wywołując ręcznie polecenie B<losetup> przed wywołaniem polecenia B<mount> już ze skonfigurowanym urządzeniem blokowym.
uk: Параметр B<loop> із використаними параметрами B<offset> або B<sizelimit> може спричинити помилку за використання старих ядер, якщо команда B<mount> не може підтвердити, що розмір блокового пристрою налаштовано відповідно до запиту. Цю ситуацію можна обійти за допомогою ручного введення команди B<losetup> перед викликом B<mount> для налаштованого петльового пристрою.

source: The mount command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl »mount« ist Teil des Pakets util-linux, welches auf https://www.kernel.org/pub/linux/utils/util-linux/ verfügbar ist.
fr: La commande B<mount> fait partie du paquet util-linux, elle est disponible sur E<lt>I<https://www.kernel.org/pub/linux/utils/util-linux/>E<gt>.
pl: Polecenie mount jest częścią pakietu util-linux i jest dostępne pod adresem https://www.kernel.org/pub/linux/utils/util-linux/.
uk: Програма mount є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: B<mount> B<--make>-[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<mountpoint>
de: B<mount> B<--make->[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<Einhängepunkt>
fr: B<mount> B<--make>-{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<point_montage>
pl: B<mount> B<--make>-[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<punkt-montowania>
uk: B<mount> B<--make>-[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<точка_монтування>

source: Human readable partition identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations It\(cqs supported for example for GUID Partition Tables (GPT).
de: Menschenlesbare Partitionsbezeichnung. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs*>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identificateur compréhensible de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations mkfs ou mkswap. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
pl: Identyfikator partycji czytelny dla człowieka. Identyfikator ten jest niezależny od systemu plików i nie zmienia się po wykonaniu mkfs lub mkswap. Jest obsługiwany np. przez tablicę partycji GUID (ang. GUID Partition Table - GPT).
uk: Зручний для читання ідентифікатор розділу Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: Partition universally unique identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations It\(cqs supported for example for GUID Partition Tables (GPT).
de: »Universally unique identifier« (universeller eindeutiger Bezeichner) der Partition. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs*>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identifiant unique universel de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations mkfs ou mkswap. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
pl: Uniwersalny, unikatowy identyfikator partycji. Identyfikator ten jest niezależny od systemu plików i nie zmienia się po wykonaniu mkfs lub mkswap. Jest obsługiwany np. przez tablicę partycji GUID (GPT).
uk: Універсальний унікальний ідентифікатор розділу Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: B<mount> I<device>*B<*>|I<dir> B<-o> I<options>
de: B<mount> I<Gerät>|I<Verzeichnis> B<-o> I<Optionen>
fr: B<mount> I<périphérique>*B<*>|I<répertoire> B<-o> I<options>
pl: B<mount> I<urządzenie>B<*>|I<katalog> B<-o> I<opcje>
uk: B<mount> I<пристрій>*B<*>|I<каталог> B<-o> I<параметри>

source: Blacklisted file systems
de: Liste der nichtzugelassenen Dateisysteme
fr: Systèmes de fichiers mis en liste noire
uk: «Чорний» список файлових систем

source: In the Linux kernel, file system types are implemented as kernel modules. While many of these file systems are well maintained, some of the older and less frequently used ones are not. This poses a security risk, because maliciously crafted file system images might open security holes when mounted either automatically or by an inadvertent user. The B<mount> command prints "unsupported file system type 'somefs'" in this case, because it can't distinguish between a really unsupported file system (kernel module non-existent) and a blacklisted file system.
de: Unter dem Linux-Kernel sind Dateisystemtypen als Kernelmodule implementiert. Viele dieser Dateisysteme werden gut betreut, allerdings gilt dies für einige der älteren und weniger häufig verwandten nicht. Dies stellt ein Sicherheitsrisiko dar, da heimtückisch erstellte Dateisystemabbilder Sicherheitslöcher öffnen könnten, wenn sie entweder automatisch oder durch einen unachtsamen Benutzer eingehängt werden. Der Befehl B<mount> gibt in diesem Fall »nicht unterstützter Dateisystemtyp 'einDS'" aus, da er nicht zwischen einem wirklich nicht unterstützten Dateisystem (Kernelmodul existiert nicht) und einem nichtzugelassenen Dateisystem unterscheiden kann.
fr: Dans le noyau Linux, les types de système de fichiers sont implémentés sous forme de modules du noyau. Bien que beaucoup de ces systèmes de fichiers soient entretenus, certains des plus anciens et moins fréquents systèmes de fichiers ne le sont pas. Cela pose un risque de sécurité parce que des images de système de fichiers contrefaites pourraient ouvrir des trous de sécurité si elles sont montées soit automatiquement ou par un utilisateur négligent. La commande B<mount> affiche « unsupported file system type 'somefs' » dans ce cas, car elle ne peut pas faire la distinction entre un système de fichiers non pris en charge (module du noyau inexistant) et un système de fichiers mis en liste noire.
uk: У ядрі Linux типи файлових систем реалізовано як модулі ядра. Хоча багато з цих файлових систем мають якісний супровід, супровід деяких давніх і рідкісних систем лишає бажати кращого. Це призводить до проблем із захистом системи, оскільки створені зловмисниками образи файлових систем можуть відкрити «дірки» у захисті системи, якщо ці образи буде відкрито автоматично або якимось недосвідченим користувачем. У таких випадках програма B<mount> виводить повідомлення «непідтримуваний тип файлової системи "якась_файлова_система"», оскільки програма не може визначити, є ця файлова система справді непідтримуваною (немає відповідного модуля ядра), чи її просто додано до «чорного» списку файлових систем.

source: Users who need the blacklisted file systems and therefore want to override the blacklisting can either load the blacklisted module directly:
de: Benutzer, die ein nichtzugelassenes Dateisystem benötigen und daher die Nichtzulassung außer Kraft setzen möchten, können entweder das nichtzugelassene Modul direkt laden:
fr: Les utilisateurs ayant besoin de systèmes de fichiers mis en liste noire, et par conséquent voulant contourner cette mise en liste noire, peuvent soit charger le module mis en liste noire directement :
uk: Користувачі, яким потрібні файлові системи з «чорного» списку, і отже, які хочуть перевизначити «чорний» список, можуть або завантажити модуль з «чорного» списку безпосередньо:

source: or override the blacklist configuration by editing files under the I</etc/modprobe.d> directory.
de: oder sie können die Konfiguration der nichtzugelassenen Dateisysteme unter dem Verzeichnis I</etc/modprobe.d> bearbeiten.
fr: ou outrepasser la configuration de liste noire en éditant les fichiers dans le répertoire I</etc/modprobe.d>.
uk: або можуть перевизначити налаштування «чорного» списку редагування файлів у каталозі I</etc/modprobe.d>.

source: B<mount --bind> I<olddir newdir> B<mount -o remount,bind,ro> I<olddir newdir>
de: B<mount --bind> I<Altes_Verzeichnis Neues_Verzeichnis> B<mount -o remount,bind,ro> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount --bind> I<ancien_répertoire nouveau_répertoire> B<mount -o remount,bind,ro> I<ancien_répertoire nouveau_répertoire>
pl: B<mount --bind> I<stary-katalog nowy-katalog> B<mount -o remount,bind,ro> I<stary-katalog nowy-katalog>
uk: B<mount --bind> I<старий_каталог новий_каталог> B<mount -o remount,bind,ro> I<старий_каталог новий_каталог>

source: It\(cqs also possible to change nosuid, nodev, noexec, noatime, nodiratime and relatime VFS entry flags via a "remount,bind" operation. The other flags (for example filesystem-specific flags) are silently ignored. It\(cqs impossible to change mount options recursively (for example with B<-o rbind,ro>).
de: Es ist ebenfalls möglich, die Schalter »nosuid«, »nodev«, »noexec«, »noatime«, »nodiratime« und »relatime« des VFS-Eintrags durch die Aktion »remount,bind« zu ändern. Die anderen (zum Beispiel die dateisystemspezifischen Schalter) werden stillschweigend ignoriert. Dagegen ist es nicht möglich, Einhängeoptionen rekursiv zu ändern (zum Beispiel mit B<-o rbind,ro>).
fr: Il est aussi possible de remplacer les drapeaux d’entrées VFS B<nosuid>, B<nodev>, B<noexec>, B<noatime>, B<nodiratime> et B<relatime> par l’opération B<remount,bind>. Les autres (par exemple, les drapeaux spécifiques à des systèmes de fichiers) sont ignorés silencieusement. Il est impossible de modifier les options de montage de manière récursive (par exemple, avec B<-o rbind,ro>).
pl: Można również zmienić flagi wejściowe wirtualnego systemu plików nosuid, nodev, noexec, noatime, nodiratime i relatime operacją "remount,bind". Inne flagi (np. zależne od systemu plików) są po cichu ignorowane. Nie da się zmienić opcji montowania rekurencyjnie (np. za pomocą B<-o rbind,ro>).
uk: Можна також змінити прапорці запису VFS nosuid, nodev, noexec, noatime, nodiratime та relatime за допомогою дії «remount,bind». Інші прапорці (наприклад прапорці, специфічні для файлової системи) буде без повідомлень проігноровано. Не можна змінювати параметри монтування рекурсивно (наприклад за допомогою B<-o rbind,ro>).

source: Since util-linux 2.31, B<mount> ignores the B<bind> flag from I</etc/fstab> on a B<remount> operation (if "-o remount" is specified on command line). This is necessary to fully control mount options on remount by command line. In previous versions the bind flag has been always applied and it was impossible to re-define mount options without interaction with the bind semantic. This B<mount> behavior does not affect situations when "remount,bind" is specified in the I</etc/fstab> file.
de: B<mount>(8) ignoriert seit Version 2.31 von Util-linux den B<bind>-Schalter in der Datei I</etc/fstab> bei der B<remount>-Aktion (falls »-o remount« in der Befehlszeile angegeben wird). Dies ist notwendig, um die Einhängeoptionen beim erneuten Einhängen in der Befehlszeile vollständig steuern zu können. In früheren Versionen wurde der Bind-Schalter immer angewendet, wodurch ohne Interaktion mit der Bind-Semantik keine Einhängeoptionen neu definiert werden konnten. Dieses Verhalten von B<mount> beeinflusst nicht die Fälle, in denen »remount,bind« in der Datei I</etc/fstab> angegeben ist.
fr: B<mount>(8) depuis util-linux 2.31 ignore le drapeau B<bind> dans I</etc/fstab> lors de B<remount> I<opération> (si B<-o remount> est indiqué sur la ligne de commande). Cela est nécessaire pour contrôler complètement les options de B<mount> lors du remontage par la ligne de commande. Dans les précédentes versions, le drapeau B<bind> était toujours appliqué et il était impossible de redéfinir les options de montage sans interaction avec la sémantique de « bind ». Ce comportement de B<mount> n’affecte pas les situations où « remount,bind » est indiqué dans le fichier I</etc/fstab>.
pl: Od util-linux 2.31, B<mount> ignoruje flagę B<bind> z I</etc/fstab> podczas operacji B<remount> (jeśli podano "-o remount" w wierszu polecenia). Jest to konieczne do uzyskania pełnej kontroli nad opcjami montowania przy przemontowywaniu za pomocą wiersza poleceń. W poprzednich wersjach flaga bind była zawsze stosowana i nie dało się zmienić opcji montowania bez interakcji z semantyką bind. To zachowanie B<mount> nie wpływa na sytuację, gdy "remount,bind" podano w pliku I</etc/fstab>.
uk: Починаючи з util-linux 2.31, B<mount> ігнорує прапорець B<bind> з I</etc/fstab> при виконанні дії B<remount> (якщо у рядку команди вказано «-o remount»). Це необхідно для повного контролю над параметрами монтування при перемонтуванні за допомогою командного рядка. У попередніх версіях завжди застосовувався прапорець прив'язування, і не можна було перевизначити параметри монтування без взаємодії із семантикою прив'язування. Ця поведінка B<mount> не впливає на випадки, коли «remount,bind» вказано у файлі I</etc/fstab>.

source: B<mount>(8) B<does not read> B<fstab>(5) when a B<--make->* operation is requested. All necessary information has to be specified on the command line.
de: B<mount>(8) B<liest nicht die Datei> B<fstab>(5), wenn eine B<--make->*-Aktion angefordert wird. Alle notwendigen Informationen müssen in der Befehlszeile angegeben werden.
fr: B<mount>(8) B<ne lit pas> B<fstab>(5) quand une opération B<--make->I<*> est demandée. Tous les renseignements nécessaires doivent être indiqués sur la ligne de commande.
pl: B<mount>(8) B<nie odczytuje> B<fstab>(5) gdy żądana jest operacja B<--make->*. Wszystkie potrzebne informacje trzeba podać w wierszu polecenia.
uk: B<mount>(8) B<не читає> B<fstab>(5), якщо надіслано запит на дію B<--make->*. Усі необхідні дані має бути вказано у рядку команди.

source: The B<mount> command does not pass all command-line options to the B</sbin/mount.>I<suffix> mount helpers. The interface between B<mount> and the mount helpers is described below in the section B<EXTERNAL HELPERS>.
de: Der Befehl B<mount> übergibt nicht alle Befehlszeilenoptionen an die Einhänge-Hilfsprogramme B</sbin/mount.>I<suffix>. Die Schnittstelle zwischen B<mount> und den Hilfsprogrammen ist unten im Abschnitt B<EXTERNE HILFSPROGRAMME> beschrieben.
fr: La commande B<mount> ne passe pas toutes les options de la ligne de commande aux programmes auxiliaires de montage B</sbin/mount.>I<suffixe>. L’interface entre B<mount> et les programmes auxiliaires de montage est décrite plus bas dans la section B<AUXILIAIRES EXTERNES>.
pl: Polecenie B<mount> nie przekazuje wszystkich opcji wiersza poleceń do programów pomocniczych B</sbin/mount.>I<przyrostek>. Interfejs pomiędzy B<mount> i programami pomocniczymi opisano poniżej, w rozdziale B<ZEWNĘTRZNE PROGRAMY POMOCNICZE>.
uk: Команда B<mount> не передає усі параметри рядка команди допоміжним засобам монтування B</sbin/mount.>I<суфікс>. Інтерфейс між B<mount> і допоміжними засобами монтування описано нижче у розділі B<ЗОВНІШНІ ДОПОМІЖНІ ЗАСОБИ>.

source: B<mount> switches to the mount namespace when it reads I</etc/fstab>, writes I</etc/mtab: (or writes to _/run/mount>) and calls the B<mount>(2) system call, otherwise it runs in the original mount namespace. This means that the target namespace does not have to contain any libraries or other requirements necessary to execute the B<mount>(2) call.
de: B<mount> wechselt in den Einhängenamensraum, wenn es die Datei I</etc/fstab> liest, in die Datei I</etc/mtab> (oder I</run/mount>) schreibt und ruft den Systemaufruf B<mount>(2) auf, anderenfalls läuft es im ursprünglichen Einhängenamensraum. Das bedeutet, dass der Ziel-Namensraum keine Bibliotheken oder anderes enthalten muss, um B<mount>(2) aufzurufen.
fr: B<mount> bascule vers l’espace de noms de montage lorsqu’il lit I</etc/fstab>, écrit sur I</etc/mtab> (ou écrit sur I</run/mount>) et exécute l’appel système B<mount>(2). Sinon il s’exécute dans l’espace de noms de montage original. Cela signifie que l’espace de noms cible n’a pas à contenir toute bibliothèque ou autre exigence nécessaire pour exécuter la commande B<mount>(2).
pl: B<mount> przełącza się na przestrzeń nazw gdy odczytuje I</etc/fstab>, zapisuje I</etc/mtab> (lub pisze do I</run/mount>) i wywołuje wywołanie systemowe B<mount>(2), w innych przypadkach działa w oryginalnej przestrzeni nazw. Oznacza to, że docelowa przestrzeń nazw nie musi zawierać żadnych bibliotek lub innych wymaganych składników do wykonania wywołania B<mount>(2).
uk: B<mount>перемикає до простору назв монтування, коли читає I</etc/fstab>, запису I</etc/mtab> (або записує I<_/run/mount>) і викликає B<mount>(2), інакше воно працює в початковому просторі назв монтування. Це означає, що простір назв призначення не мусить містити будь-яких бібліотек або інших вимог, потрібних для виконання системного виклику B<mount>(2).

source: Source of default options. I<source> is a comma-separated list of B<fstab>, B<mtab> and B<disable>. B<disable> disables B<fstab> and B<mtab> and disables B<--options-source-force>. The default value is B<fstab,mtab>.
de: bezeichnet die Quelle der Standardoptionen. Die I<Quelle> ist eine durch Kommata getrennte Liste aus B<fstab>, B<mtab> und B<disable>. Mit B<disable> deaktivieren Sie B<fstab> und B<mtab> und aktivieren B<--options-source-force>. Die Vorgabe ist B<fstab,mtab>.
fr: Source des options par défaut. I<source> est une liste séparée par des virgules de I<fstab>, I<mtab> et B<disable>. B<disable> désactive I<fstab> et I<mtab> et désactive B<--options-source-force>. La valeur par défaut est I<fstab,mtab>.
pl: Źródło opcji domyślnych. I<Źródło> to lista, w której można uwzględnić: B<fstab>, B<mtab> i B<disable>, rozdzielana przecinkiem. Wpis B<disable> wyłącza B<fstab>, B<mtab> oraz B<--options-source-force>. Domyślną wartością jest: B<fstab,mtab>.
uk: Джерело типових параметрів. Аргументом I<джерело> є список відокремлених комами значень B<fstab>, B<mtab> і B<disable>. Значення B<disable> вимикає B<fstab> і B<mtab> і вимикає B<--options-source-force>. Типовим є значення B<fstab,mtab>.
