Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Set the file permission on the filesystem. The umask value is given in octal. By default, the files are owned by root and not readable by somebody else.
de: legt die Dateizugriffsrechte des Dateisystems fest. Der Umask-Wert wird in oktaler Notation angegeben. Standardmäßig gehören Dateien dem Benutzer Root und können von anderen nicht gelesen werden.
fr: Définir les permissions des fichiers sur le système de fichiers. La valeur d'umask est fournie en octal. Par défaut, les fichiers appartiennent au superutilisateur et ne sont lisibles par personne d'autre.
pl: Ustawia prawa plików dla danego systemu. Wartość umask powinna być podana ósemkowo. Domyślnie właścicielem plików jest root i nikt inny nie może ich czytać.
uk: Встановити дозвіл на файл у файловій системі. Значення umask подається у вісімковій системі. Типово файли належать користувачу root і не доступні для читання кимось іншим.

source: An overlay filesystem combines two filesystems - an B<upper> filesystem and a B<lower> filesystem. When a name exists in both filesystems, the object in the upper filesystem is visible while the object in the lower filesystem is either hidden or, in the case of directories, merged with the upper object.
de: Ein Überlagerungs-Dateisystem kombiniert zwei Dateisysteme - ein B<oberes> und ein B<unteres> Dateisystem. Wenn ein Name in beiden Dateisystemen existiert, ist das Objekt im oberen Dateisystem sichtbar, während das Objekt im unteren Dateisystem entweder verborgen ist oder (bei Verzeichnissen) mit dem oberen Objekt zusammengeführt wird.
fr: Un système de fichiers de superposition combine deux systèmes de fichiers — un système de fichiers B<supérieur> et un système de fichiers B<inférieur>. Lorsqu’un nom est présent sur les deux systèmes de fichiers, l’objet dans le système de fichiers supérieur est visible tandis que l’objet dans le système de fichiers inférieur est soit caché, soit, dans le cas de répertoire, fusionné avec l’objet supérieur.
pl: Overlay łączy dwa systemy plików – B<górny> i B<dolny>. Gdy jakaś nazwa istnieje w obu systemach plików, widoczny jest obiekt z górnego, a obiekt z dolnego jest albo ukryty, albo, w przypadku katalogów, łączony z górnym obiektem.
uk: Накладна файлова система поєднує дві файлові системи - файлову систему B<верхню> і файлову систему B<нижню>. Якщо назва існує в обох файлових системах, об'єкт у верхній файловій системі буде видимим, а об'єкт у нижній файловій системі або прихованим, або, у випадку каталогів, об'єднаним із верхнім об'єктом.

source: The lower filesystem can be any filesystem supported by Linux and does not need to be writable. The lower filesystem can even be another overlayfs. The upper filesystem will normally be writable and if it is it must support the creation of trusted.* extended attributes, and must provide a valid d_type in readdir responses, so NFS is not suitable.
de: Das untere Dateisystem kann jedes von Linux unterstützte Dateisystem sein; es muss nicht schreibbar sein. Das untere Dateisystem kann sogar ein weiteres Überlagerungs-Dateisystem sein. Das obere Dateisystem wird normalerweise schreibbar sein, und falls das so ist, muss es die Erzeugung von erweiterten Attributen der Form »trusted.*« unterstützen und einen gültigen d_type in readdir-Antworten bereitstellen, daher ist NFS nicht geeignet.
fr: Le système de fichiers inférieur peut être n’importe quel système de fichiers pris en charge par Linux et n’a nul besoin d’être modifiable. Il peut même être un autre système de fichiers overlay. Le système de fichiers supérieur sera normalement modifiable et si c'est le cas, doit gérer la création d’attributs étendus I<trusted.*> et fournir un I<d_type> autorisé dans les réponses de B<readdir>, aussi NFS n’est pas adapté.
pl: Dolnym system plików może być dowolny, obsługiwany przez Linuksa system plików. Nie musi być on zapisywalny. Dolny system plików może być nawet kolejnym systemem typu overlay. Górny system plików zwykle jest zapisywalny i jeśli tak jest, musi obsługiwać tworzenie rozszerzonych atrybytów trusted.* oraz zapewniać prawidłowe d_type w odpowiedziach readdir; z tego powodu NFS jest nieodpowiedni.
uk: Нижньою файловою системою може бути будь-яка файлова система, яку підтримує Linux, можливо, недоступна для запису. Нижня файлова система може бути навіть іншою накладною файловою системою. Верхня файлова система зазвичай доступна для запису, і, якщо так, вона має підтримувати створення розширених атрибутів trusted.* і надавати дійсний тип d_type у відповідях readdir, тому NFS для цього не підходить.

source: A read-only overlay of two read-only filesystems may use any filesystem type. The options B<lowerdir> and B<upperdir> are combined into a merged directory by using:
de: Eine schreibgeschützte Überlagerung zweier schreibgeschützter Dateisysteme kann jeden Dateisystemtyp verwenden. Die Optionen B<lowerdir> und B<upperdir> werden folgendermaßen in einem zusammengeführten Verzeichnis kombiniert:
fr: Un système de fichiers overlay en lecture seule de deux systèmes de fichiers peut utiliser n’importe quel type de système de fichiers. Les options B<lowerdir> et B<upperdir> sont combinées dans un répertoire de fusion en utilisant :
pl: Overlay tylko o odczytu z dwóch systemów plików będących tylko do odczytu może korzystać z dowolnego typu systemu plików. Opcje B<lowerdir> i B<upperdir> są łączone do połączone katalogu za pomocą:
uk: Накласти лише для читання можна дві файлові системи, доступні лише для читання, будь-якого типу. Параметри B<lowerdir> і B<upperdir> об'єднуються в спільний каталог за допомогою:

source: Instructs version 3.6 reiserfs software to mount a version 3.5 filesystem, using the 3.6 format for newly created objects. This filesystem will no longer be compatible with reiserfs 3.5 tools.
de: weist die Version 3.6 der Reiserfs-Software an, ein Dateisystem der Version 3.5 mit dem Format 3.6 für neu erstellte Objekte einzuhängen. Dieses Dateisystem ist dann nicht mehr zu den Reiserfs-Werkzeugen der Version 3.5 kompatibel.
fr: Indiquer à la version 3.6 de ReiserFS de monter un système de fichiers de la version 3.5 et d'utiliser le format 3.6 pour les nouveaux objets. Ce système de fichiers ne sera plus compatible avec les outils ReiserFS 3.5.
pl: Mówi wersji 3.6 oprogramowania reiserfs, aby zamontowała wersję 3.5 systemu plików, używając formatu 3.6 dla nowo utworzonych plików. Ten system plików nie będzie już zgodny z wersją 3.5 narzędzi reiserfs.
uk: Наказує версії 3.6 програмного забезпечення reiserfs змонтувати файлову систему 3.5 з використанням формату 3.6 для новостворених об'єктів. Ця файлова система стане несумісною із інструментами reiserfs 3.5.

source: A hash invented by Yury Yu.\& Rupasov. It is fast and preserves locality, mapping lexicographically close file names to close hash values. This option should not be used, as it causes a high probability of hash collisions.
de: ist ein von Yury Yu.\& Rupasov entwickelter Hash. Er ist schnell und erhält Lokalität, wobei lexikographisch nahe Dateinamen zu nahen Hash-Werten zugeordnet werden. Diese Option sollte nicht verwendet werden, da sie die Wahrscheinlichkeit von Hash-Kollisionen erhöht.
fr: Une fonction de hachage inventée par Yuri Yu.\& Rupasov, rapide et préservant la localité, mappant les noms de fichiers proches lexicographiquement vers des valeurs de hachage proches. Ne devrait pas être utilisée à cause de probabilités élevées de collisions de hachage.
pl: Funkcja haszująca autorstwa Yury Yu.\& Rupasova. Jest szybka i zachowuje lokalizację, mapując nazwy plików bliskie w porządku leksykograficznym na bliskie sobie wartości funkcji. Z powodu wysokiego prawdopodobieństwa kolizji w haszowaniu, ta opcja nie powinna być używana.
uk: Хеш, який винайдено Юрієм Ю. Рупасовим. Він є швидким і зберігає локальність, відображаючи лексикографічно близькі назви файлів у близькі значення хеш-сум. Не слід користуватися цим параметром, оскільки він спричиняє високу ймовірність збігів хеш-збігів.

source: A Davis-Meyer function implemented by Jeremy Fitzhardinge. It uses hash permuting bits in the name. It gets high randomness and, therefore, low probability of hash collisions at some CPU cost. This may be used if EHASHCOLLISION errors are experienced with the r5 hash.
de: ist eine von Jeremy Fitzhardinge implementierte Davis-Meyer-Funktion. Sie verwendet Hash-permutierende Bits im Namen. Sie erhält hohe Zufälligkeit und daher eine geringe Wahrscheinlichkeit von Hash-Kollisionen, was aber auf Kosten der Prozessorlast geht. Dies kann verwendet werden, wenn mit dem r5-Hash EHASHCOLLISION-Fehler auftreten.
fr: Une fonction de Davis-Meyer implémentée par Jeremy Fitzhardinge. Elle utilise des permutations de bits de hachage dans les noms. Elle procure un grand caractère aléatoire et donc de faibles probabilités de collision de hachage, au prix d'un certain coût processeur. Elle peut être utilisée si des erreurs EHASHCOLLISION se produisent avec la fonction de hachage r5.
pl: Funkcja Davis-Meyera zaimplementowana przez Jeremy'ego Fitzhardinge'a. Używa mieszania permutującego bity w nazwie pliku. Wykazuje dużą losowość wyników i teoretycznie małe prawdopodobieństwo kolizji. Może być używana, jeżeli funkcja r5 powoduje błędy EHASHCOLLISION.
uk: Функція Девіса-Меєра, яку реалізовано Джеремі Фітцгардінгом. У ній використано біти, які змінюють хеш-суму у назві. Має високий рівень псевдовипадковості, а отже, низьку ймовірність збігів хеш-сум за рахунок певного навантаження на процесор. Може бути використано, якщо виникають помилки EHASHCOLLISION у хеш-сумах r5.

source: A modified version of the rupasov hash. It is used by default and is the best choice unless the filesystem has huge directories and unusual file-name patterns.
de: ist eine angepasste Version des Rupasov-Hashs. Sie wird standardmäßig verwendet und ist die beste Wahl, es sei denn, das Dateisystem hat riesige Verzeichnisse und ungewöhnliche Dateinamensmuster.
fr: Une version modifiée de la fonction hachage de rupasov. Elle est utilisée par défaut et semble être le meilleur choix sauf si le système de fichiers a d'énormes répertoires et des motifs de nom de fichier non habituels.
pl: Zmodyfikowana wersja funkcji rupasov. Używana domyślnie i jest najlepszym wyborem, jeżeli system plików nie zawiera dużych katalogów i niezwykłych nazw plików.
uk: Змінена версія хеш-сум Рупасова. Є типовою і є найкращим вибором, якщо у системі немає величезних каталогів і незвичних шаблонів назв файлів.

source: Instructs I<mount> to detect which hash function is in use by examining the filesystem being mounted, and to write this information into the reiserfs superblock. This is only useful on the first mount of an old format filesystem.
de: weist I<mount> an, durch Untersuchung des einzuhängenden Dateisystems zu erkennen, welche Hash-Funktion verwendet wird und diese Information in den Reiserfs-Superblock zu schreiben. Dies ist nur beim ersten Einhängen eines Dateisystems des alten Formats nützlich.
fr: Demander à B<mount> de rechercher la fonction de hachage à utiliser en examinant le système de fichiers à monter, et d'écrire cette information dans le superbloc ReiserFS. Cela ne sert qu'au premier montage d'un système de fichiers d'un ancien format.
pl: Powoduje, że I<mount> wykryje, która funkcja mieszająca jest używana, sprawdzając właśnie montowany system plików, i zapisze tę informację w superbloku systemu reiserfs. Ta opcja jest użyteczna przy pierwszym montowaniu systemu plików o starym formacie.
uk: Наказує mount виявити хеш-функцію, яку використано, шляхом інспектування файлової системи, монтування якої виконується, і записати ці дані до суперблоку reiserfs. Корисний лише під час першого монтування файлової системи у застарілому форматі.

source: Tunes the block allocator. This may provide performance improvements in some situations.
de: stellt den Block-Zuweiser ein. Dies kann in einigen Situationen die Performance verbessern.
fr: Ajuster l'allocation de blocs. Peut améliorer les performances dans certaines situations.
pl: Stroi mechanizm przydzielania bloków. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.
uk: Коригує поведінку засобу розміщення блоків. Може збільшити швидкодію у певних випадках.

source: Disable the border allocator algorithm invented by Yury Yu.\& Rupasov. This may provide performance improvements in some situations.
de: deaktiviert den von Yuri Yu.\& Rupasov entwickelten Begrenzungszuweiser-Algorithmus. Dies kann in einigen Situationen die Performance verbessern.
fr: Désactiver l'algorithme d'allocation « border » de Yury Yu.\& Rupasov. Cela peut améliorer les performances dans certaines situations.
pl: Wyłącza algorytm przydzielania granicznego wymyślony przez Yury'ego Yu.\& Rupasova. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.
uk: Вимкнути алгоритм розміщення на межі, який винайдено Юрієм Ю. Рупасовим. Може у певних ситуаціях підвищити швидкодію.

source: Disable journaling. This will provide slight performance improvements in some situations at the cost of losing reiserfs's fast recovery from crashes. Even with this option turned on, reiserfs still performs all journaling operations, save for actual writes into its journaling area. Implementation of I<nolog> is a work in progress.
de: deaktiviert das Journaling. Dadurch werden in einigen Situationen geringfügige Verbesserungen der Performance erreicht, wobei aber die Fähigkeit von Reiserfs zur schnellen Wiederherstellung nach Abstürzen verloren geht. Selbst wenn diese Option aktiviert ist, führt Reiserfs alle Journaling-Aktionen aus außer dem tatsächlichen Schreiben in seinem Journaling-Bereich. An der Implementation von I<nolog> wird noch gearbeitet.
fr: Désactiver la journalisation. Améliore légèrement les performances dans certains cas en perdant la possibilité de récupération rapide après un plantage. Même avec cette option, ReiserFS effectue encore toutes les opérations de journalisation sauf l'écriture effective dans la zone journal. L'implémentation de B<nolog> est en cours.
pl: Wyłącza dziennik. Może w pewnych sytuacjach spowodować nieznaczne podniesienie wydajności systemu kosztem utracenia szybkiego odzyskiwania danych po krachu systemu. Nawet jeśli ta opcja jest włączona, reiserfs wciąż przeprowadza wszystkie operacje związane z dziennikiem, ale go nie zapisuje. Prace przy implementacji opcji I<nolog> wciąż trwają.
uk: Вимкнути журналювання. Це дещо підвищить швидкодію у певних ситуаціях ціною втрати можливості reiserfs щодо швидкого відновлення після аварій. Навіть якщо цей параметр буде увімкнено, reiserfs все одно виконуватиме усі дії з журналювання, окрім самого запису до своєї області журналювання. Реалізація I<nolog> усе ще триває.

source: By default, reiserfs stores small files and `file tails' directly into its tree. This confuses some utilities such as B<LILO>(8). This option is used to disable packing of files into the tree.
de: deaktiviert das Packen von Dateien im Dateibaum. Standardmäßig speichert Reiserfs kleine Dateien und Dateienden direkt in seinem Baum. Das verwirrt einige Dienstprogramme wie B<LILO>(8).
fr: Par défaut, ReiserFS stocke les petits fichiers et les queues de fichiers (« files tails ») directement dans son arborescence. Cela perturbe certains utilitaires comme B<lilo>(8). Cette option désactive le groupement de fichiers dans l'arborescence.
pl: Domyślnie reiserfs przechowuje małe pliki i `końcówki plików' bezpośrednio w swoim drzewie. Jest to zachowanie mylące dla niektórych narzędzi użytkowych takich jak B<LILO>(8). Ta opcja wyłącza pakowanie plików do drzewa.
uk: Типово, reiserfs зберігає малі файли і «хвостики файлів» безпосередньо у своїй ієрархії. Це призводить до помилок у деяких допоміжних програмах, зокрема B<LILO>(8). За допомогою цього параметра можна вимкнути пакування файлів до ієрархії.

source: Replay the transactions which are in the journal, but do not actually mount the filesystem. Mainly used by I<reiserfsck>.
de: wiederholt die im Journal befindlichen Transaktionen, aber hängt das Dateisystem nicht wirklich ein. Dies wird hauptsächlich von I<reiserfsck> verwendet.
fr: Rejouer les transactions du journal, sans monter le système de fichiers. Principalement utilisé par B<reiserfsck>.
pl: Powtarza transakcje zapisane w dzienniku, ale nie montuje systemu plików. Głównie używane przez I<reiserfsck>.
uk: Відтворити операції, які записано до журналу, але не монтувати саму файлову систему. В основному, для використання у I<reiserfsck>.

source: A remount option which permits online expansion of reiserfs partitions. Instructs reiserfs to assume that the device has I<number> blocks. This option is designed for use with devices which are under logical volume management (LVM). There is a special I<resizer> utility which can be obtained from I<ftp://ftp.namesys.com/pub/reiserfsprogs>.
de: erlaubt beim Wiedereinhängen die Online-Erweiterung von Reiserfs-Partitionen. Reiserfs wird angewiesen, dass es davon ausgehen soll, dass das Gerät die angegebene I<Anzahl> Blöcke hat. Diese Option ist für Geräte gedacht, die Teil einer logischen Datenträgerverwaltung sind (unter »Logical Volume Management« stehen). Es gibt ein spezielles I<resizer>-Dienstprogramm, das auf I<ftp://ftp.namesys.com/pub/reiserfsprogs> verfügbar ist.
fr: Option de remontage permettant l'extension, en cours d'utilisation, d'une partition ReiserFS. Demande à ReiserFS de supposer que le périphérique a le I<nombre> de blocs indiqué. À utiliser avec des périphériques sous gestion par volumes logiques (LVM). Un utilitaire spécial B<resizer> est disponible sur I<ftp://ftp.namesys.com/pub/reiserfsprogs>.
pl: Opcje remontowania, która pozwala na rozszerzenie partycji reiserfs. Z tą opcją reiserfs przyjmuje, że na urządzeniu jest I<liczba> bloków. Opcja jest używana z urządzeniami zarządzanymi przez menedżera logicznych woluminów (LVM). Istnieje specjalne narzędzie I<resizer>, które można pobrać z I<ftp://ftp.namesys.com/pub/reiserfsprogs>.
uk: Параметр повторного монтування, який уможливлює інтерактивне розширення розділів reiserfs. Наказує reiserfs припускати, що у пристрої I<число> блоків. Цей параметр розроблено для пристроїв, які перебувають під керуванням логічними томами (LVM). Передбачено спеціальну допоміжну програму I<resizer>, яку можна отримати з I<ftp://ftp.namesys.com/pub/reiserfsprogs>.

source: Enable Extended User Attributes. See the B<attr>(1) manual page.
de: aktiviert die erweiterten Benutzerattribute (»Extended User Attributes«). Siehe die Handbuchseite B<attr>(1).
fr: Activer les attributs étendus. Consultez la page de manuel B<attr>(1).
pl: Włącza rozszerzone atrybuty użytkownika (Extended User Attributes). Patrz strona podręcznika B<attr>(1).
uk: Увімкнути розширені атрибути користувача. Див. сторінку підручника B<attr>(1).

source: Enable POSIX Access Control Lists. See the B<acl>(5) manual page.
de: aktiviert die POSIX-Zugriffssteuerlisten. Siehe die Handbuchseite B<acl>(5).
fr: Activer les listes de contrôle d'accès (ACL). Consultez la page de manuel B<acl>(5).
pl: Włącza listy kontroli dostępu (Acces Control Lists) POSIX. Patrz strona podręcznika B<acl>(5).
uk: Увімкнути списки керування доступом (ACL) POSIX. Див. сторінку підручника B<acl>(5).

source: This disables / enables the use of write barriers in the journaling code. barrier=none disables, barrier=flush enables (default). This also requires an IO stack which can support barriers, and if reiserfs gets an error on a barrier write, it will disable barriers again with a warning. Write barriers enforce proper on-disk ordering of journal commits, making volatile disk write caches safe to use, at some performance penalty. If your disks are battery-backed in one way or another, disabling barriers may safely improve performance.
de: deaktiviert oder aktiviert die Verwendung von Schreibgrenzen im Journaling-Code, wobei »barrier=none« deaktiviert und »barrier=flush« aktiviert (Standard). Dies erfordert auch einen Ein-/Ausgabe-Stack, der Grenzen unterstützt, und falls Reiserfs einen Fehler an einer Schreibgrenze erkennt, deaktiviert es die Grenzen wieder und gibt eine Warnung aus. Schreibgrenzen bewirken saubere datenträgerbezogene Journal-Schreibvorgänge, wodurch flüchtige Platten-Schreibzwischenspeicher sicher benutzbar werden, allerdings auf Kosten der Performance. Falls Ihre Platten auf die eine oder andere Weise batteriegestützt sind, kann die Deaktivierung dieser Grenzen sicher die Performance verbessern.
fr: Désactiver (B<barrier=none>) ou activer (B<barrier=flush>, par défaut) l'utilisation des barrières d'écriture dans le code de journalisation. Cela nécessite aussi une pile d'entrées et sorties qui peut gérer les barrières, et si ReiserFS rencontre une erreur sur une barrière d'écriture, elle désactivera de nouveau les barrières avec un avertissement. Les barrières d'écriture renforcent l'ordre correct des inscriptions au journal sur le disque, permettant d'utiliser en sécurité les caches d'écriture volatils du disque, au prix de quelques pertes en performance. Si les disques sont alimentés sans interruption d'une façon ou d'une autre, désactiver les barrières permet d'augmenter sans danger les performances.
pl: Wyłącza/włącza wykorzystanie barier zapisu w kodzie dziennikowania. barrier=none wyłącza, a barrier=flush włącza (domyślnie). Opcja wymaga stosu wejścia/wyjścia zdolnego obsłużyć bariery; jeśli reiserfs otrzyma błąd przy zapisie barier wyłączy bariery ponownie, wypisując ostrzeżenie. Bariery zapisu wymuszają poprawną kolejność wpisów dziennika na dysku, czyniąc ulotne bufory zapisu dysku bezpieczne w użyciu, z pewnym obniżeniem wydajności. Jeśli dyski mają w jakiś sposób zabezpieczone zasilanie, to wyłączenie barier może w bezpieczny sposób poprawić wydajność.
uk: Вимикає або вмикає використання бар'єрів для запису у коді ведення журналу. barrier=none вимикає, barrier=flush вмикає (типовий варіант). Реалізація можливості потребує також підтримки бар'єрів у стосі введення-виведення. Якщо у reiserfs станеться помилка під час бар'єрного запису, файлова система знову вимкне бар'єри з повідомленням-попередженням. Бар'єри запису примусово встановлюють належне упорядкування внесків до журналу на диску, що робить безпечним кешування запису на тимчасові диски за рахунок певної втрати швидкості. Якщо ваші диски у певний спосіб забезпечено живленням від акумуляторів, вимикання бар'єрів може без втрати убезпечення зберігання даних дещо підвищити швидкодію.

source: UBIFS is a flash filesystem which works on top of UBI volumes. Note that B<atime> is not supported and is always turned off.
de: UBIFS ist ein Dateisystem für Flash-Speicher, das auf UBI-Datenträgern arbeitet. Beachten Sie, dass B<atime> nicht unterstützt wird und immer abgeschaltet ist.
fr: UBIFS est un système de fichiers pour mémoire flash qui fonctionne au-dessus des volumes UBI. Remarquez qu’B<atime> n'est pas pris en charge et donc toujours désactivé.
pl: UBIFS jest systemem plików flash, którzy działa na woluminach UBI. Proszę zauważyć, że B<atime> nie jest obsługiwane i jest zawsze wyłączone.
uk: UBIFS — файлова система для флеш-носіїв, які працюють на базі томів UBI. Зауважте, що підтримки B<atime> не передбачено, і цей параметр завжди вимкнено.

source: B<ubiX_Y> UBI device number B<X>, volume number B<Y>
de: B<ubiX_Y> UBI-Gerätenummer B<X>, Datenträgernummer B<Y>
fr: B<ubi>I<X>B<_>I<Y> numéro de périphérique UBI I<X>, numéro de volume I<Y> ;
pl: B<ubiX_Y> numer urządzenia UBI B<X>, numer woluminu B<Y>
uk: B<ubiX_Y> — номер пристрою UBI B<X>, номер тому B<Y>
