Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The B<auto> type may be useful for user-mounted floppies. Creating a file I</etc/filesystems> can be useful to change the probe order (e.g., to try vfat before msdos or ext3 before ext2) or if you use a kernel module autoloader.
de: Der Typ B<auto> kann für Disketten nützlich sein, die vom Benutzer eingehängt werden. Die Erstellung einer Datei I</etc/filesystems> ist sinnvoll, um die Reihenfolge der Versuche anzupassen (zum Beispiel wenn VFAT vor MSDOS oder Ext3 vor Ext2 versucht werden soll) oder wenn Sie Kernelmodule automatisch laden.
fr: Le type B<auto> peut être utile pour des disquettes montées par l'utilisateur. Créer un fichier I</etc/filesystems> permet de changer l'ordre d'essai (par exemple I<vfat> avant I<msdos>, ou I<ext3> avant I<ext2>) ou d'utiliser un autochargeur de modules pour le noyau.
pl: Typ B<auto> może być przydatny do montowanych przez użytkownika dyskietek. Utworzenie pliku I</etc/filesystems> przydaje się do zmiany kolejności rozpoznawania (np. do próbowania vfat przed msdos lub ext3 przez ext2) lub w przypadku stosowania modułu autoloadera.
uk: Тип B<auto> може бути корисним для змонтованих користувачем дискет. Створення файла I</etc/filesystems> може бути корисним для зміни порядку зондування (наприклад, щоб спробу скористатися vfat було виконано перед спробою скористатися msdos або ext3 мала вищий пріоритет, ніж ext2), або якщо ви користуєтеся автоматичним завантаженням модулів ядра.

source: More than one type may be specified in a comma-separated list, for the B<-t> option as well as in an I</etc/fstab> entry. The list of filesystem types for the B<-t> option can be prefixed with B<no> to specify the filesystem types on which no action should be taken. The prefix B<no> has no effect when specified in an I</etc/fstab> entry.
de: Für die Option B<-t> und bei Einträgen in der Datei I</etc/fstab> können mehrere Typen in einer durch Kommata getrennten Liste angegeben werden. Der Liste der Dateisystemtypen für die Option B<-t> kann ein B<no> vorangestellt werden, um die Dateisystemtypen zu kennzeichnen, für die keine Aktion ausgeführt werden soll. Das Präfix B<no> ist wirkungslos, wenn es in einem Eintrag der Datei I</etc/fstab> angegeben wird.
fr: Plusieurs types peuvent être indiqués, séparés par des virgules, pour l’option B<-t> comme dans une entrée I</etc/fstab>. La liste des types de systèmes de fichiers pour l’option B<-t> peut également être préfixée par B<no> pour indiquer les types à ignorer. Le préfixe B<no> est sans effet dans une entrée I</etc/fstab>.
pl: Można podać więcej niż jeden typ, w postaci listy rozdzielonej przecinkami do opcji B<-t> jak również jako wpis I</etc/fstab>. Lista typów systemów plików do opcji B<-t> może być poprzedzona słowem B<no> aby określić systemy plików, na których żadna akcja nie powinna być wykonywana. Przedrostek B<no> nie działa przy wpisach w I</etc/fstab>.
uk: Для параметра B<-t>, а також для запису в I</etc/fstab> декілька типів можна вказати у форматі списку значень, які відокремлено комами. До списку типів файлових систем параметра B<-t> можна дописати префікс B<no>, щоб вказати типи файлових систем, для яких не слід виконувати дій. Префікс B<no> не діятиме, що його вказати для запису в I</etc/fstab>.

source: The prefix B<no> can be meaningful with the B<-a> option. For example, the command
de: Das Präfix B<no> kann mit der Option B<-a> von Bedeutung sein. Zum Beispiel hängt der Befehl
fr: Le préfixe B<no> peut avoir du sens avec l’option B<-a>. Par exemple, la commande
pl: Przedrostek B<no> może być przydatny przy opcji B<-a>. Na przykład polecenie
uk: З параметром B<no> можна скористатися префіксом B<no>. Наприклад, команда

source: For most types all the B<mount> program has to do is issue a simple B<mount>(2) system call, and no detailed knowledge of the filesystem type is required. For a few types however (like nfs, nfs4, cifs, smbfs, ncpfs) an ad hoc code is necessary. The nfs, nfs4, cifs, smbfs, and ncpfs filesystems have a separate mount program. In order to make it possible to treat all types in a uniform way, B<mount> will execute the program B</sbin/mount.>I<type> (if that exists) when called with type I<type>. Since different versions of the B<smbmount> program have different calling conventions, B</sbin/mount.smbfs> may have to be a shell script that sets up the desired call.
de: Für die meisten Typen ist alles, was das Programm B<mount> zu tun hat, ein einfacher B<mount>(2)-Systemaufruf, wofür keine detaillierten Kenntnisse des Dateisystemtyps nötig ist. Jedoch wird für einige Typen (wie nfs, nfs4, cifs, smbfs oder ncpfs) ein Ad-Hoc-Code benötigt. Die Dateisysteme nfs, nfs4, cifs, smbfs und ncpfs haben ein separates Mount-Programm. Um zu ermöglichen, dass alle Typen in gleicher Weise behandelt werden, führt B<mount> das Program B</sbin/mount.>I<Typ> aus (sofern es existiert), wenn es mit dem entsprechenden I<Typ> aufgerufen wird. Das verschiedene Versionen des Programms B<smbmount> auch verschiedene Aufrufkonventionen haben, muss B</sbin/mount.smbfs> möglicherweise ein Shell-Skript sein, das den gewünschten Aufruf erstellt.
fr: Pour la plupart des types, B<mount> n’effectue qu’un appel système B<mount>(2) et aucune connaissance détaillée du système de fichiers n'est nécessaire. Pour certains types toutefois (comme I<nfs>, I<nfs4>, I<cifs>, I<smbfs> et I<ncpfs>), du code supplémentaire est indispensable. Les systèmes de fichiers I<nfs>, I<nfs4>, I<cifs>, I<smbfs> et I<ncpfs> ont un programme de montage indépendant. Afin de rendre uniforme le traitement de tous les types, B<mount> exécutera le programme B</sbin/mount.>I<type> (s'il existe) lorsqu'il est invoqué avec le type I<type>. Comme différentes versions de B<smbmount> ont des conventions d'appels diverses, B</sbin/mount.smbfs> peut être un script shell qui réalise l'appel voulu.
pl: Dla większości typów, jedyne, co robi program B<mount>, to po prostu wywołuje funkcję systemową B<mount>(2), i nie jest tu wymagana żadna szczegółowa wiedza o danym systemie plików. Jednakże dla kilku typów (jak np. nfs, nfs4, cifs, smbfs, ncpfs) konieczny jest niezaplanowany kod. Systemy plików nfs, nfs4, cifs, smbfs i ncpfs mają osobny program montujący. Żeby umożliwić jednolite traktowanie wszystkich typów, B<mount> wywołany z typem I<typ> uruchamia program B</sbin/mount.>I<typ> (jeśli takowy istnieje). Ponieważ rozmaite wersje programu B<smbmount> mają różne konwencje wywołań, być może B</sbin/mount.smb> będzie musiał być skryptem powłoki, który dobierze właściwe wywołanie.
uk: Для більшості типів програмі B<mount> достатньо видати простий системний виклик B<mount>(2) — ніякого докладного знання типу файлової системи не потрібно. Втім, для декількох типів (зокрема nfs, nfs4, cifs, smbfs, ncpfs) потрібен контекстний код. Для файлових систем nfs, nfs4, cifs, smbfs і ncpfs передбачено окрему програму для монтування. Щоб усі типи можна було обробляти в універсальний спосіб, B<mount> виконуватиме програму B</sbin/mount.>I<тип> (якщо така існує), коли програмі буде вказано тип I<тип>. Оскільки різні версії програми B<smbmount> використовують різні способи виклику, B</sbin/mount.smbfs> може бути скриптом оболонки, який налаштовує бажаний виклик.

source: Mount the filesystem read/write. Read-write is the kernel default and the B<mount> default is to try read-only if the previous mount syscall with read-write flags on write-protected devices of filesystems failed.
de: hängt das Dateisystem les- und schreibbar ein. Lesen und Schreiben ist die Voreinstellung des Kernels; die Voreinstellung von B<mount> ist es, zu versuchen, nur lesbar einzuhängen, falls der vorherige B<mount>(2)-Systemaufruf zum Einhängen mit den Lese-/Schreib-Schaltern auf schreibgeschützten Geräten oder Dateisystemen fehlgeschlagen ist.
fr: Monter le système de fichiers en écriture et lecture. C'est le réglage par défaut du noyau, et le comportement par défaut de B<mount> est d’essayer la lecture seule si le précédent appel système de montage avec des drapeaux pour la lecture et l’écriture sur des périphériques protégés contre l’écriture échouait.
uk: Змонтувати файлову систему у режимі читання-запису. Режим читання-запису є типовим для ядра, а типовою поведінкою B<mount> є спроба змонтувати у режимі лише читання, якщо попередній системний виклик B<mount>() із прапорцями читання-запису на захищених від запису пристроях файлових систем зазнав невдачі.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
fr: Afficher les informations de version et quitter.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: Some of these options could be enabled or disabled by default in the system kernel. To check the current setting see the options in I</proc/mounts>. Note that filesystems also have per-filesystem specific default mount options (see for example B<tune2fs -l> output for extN filesystems).
de: Einige dieser Optionen könnten im Systemkernel standardmäßig aktiviert oder deaktiviert sein. Die aktuelle Einstellung finden Sie in I</proc/mounts>. Beachten Sie, dass Dateisysteme auch dateisystemspezifische Standard-Einhängeoptionen haben (siehe zum Beispiel die Ausgabe von B<tune2fs -l> für ExtN-Dateisysteme).
fr: Certaines de ces options peuvent être activées ou désactivées par défaut dans l'environnement du noyau. Pour vérifier la configuration actuelle, consultez les options dans I</proc/mounts>. Remarquez que les systèmes de fichiers ont aussi des options de montage par défaut spécifiques au système de fichiers (consultez par exemple la sortie de B<tune2fs -l> pour les systèmes de fichiers extN).
pl: Część tych opcji może zostać domyślnie włączona lub wyłączona przez jądro systemu. Aby sprawdzić bieżące ustawienia, proszę sprawdzić opcje w I</proc/mounts>. Proszę zauważyć, że istnieją również domyślne opcje montowania charakterystyczne dla poszczególnych systemów plików (zob. np. wynik B<tune2fs -l> dla systemów plików extN).
uk: Деякі з цих параметрів можна типово увімкнути або вимкнути у ядрі системи. Щоб перевірити поточне значення параметра, ознайомтеся із параметрами у I</proc/mounts>. Зауважте, що файлові системи також мають власні типові параметри монтування (див., наприклад, виведені командою B<tune2fs -l> дані для файлових систем extN).

source: The following options apply to any filesystem that is being mounted (but not every filesystem actually honors them \(en e.g.\&, the B<sync> option today has an effect only for ext2, ext3, ext4, fat, vfat, ufs and xfs):
de: Die folgenden Optionen gelten für jedes eingehängte Dateisystem (aber nicht jedes Dateisystem erkennt sie an, zum Beispiel ist die Option B<sync> gegenwärtig nur bei den Dateisystemen Ext2, Ext3, Ext4, FAT, VFAT, UFS und XFS wirksam):
fr: Les options suivantes s'appliquent à tous les systèmes de fichiers montés (mais tous les systèmes de fichiers ne les honorent pas, par exemple B<sync> n'est effective que pour I<ext2>, I<ext3>, I<ext4>, I<fat>, I<vfat>, I<ufs> et I<xfs>) :
pl: Poniższe opcje dotyczą dowolnego montowanego systemu plików (choć nie każdy z systemów plików faktycznie je honoruje, np. opcja B<sync> obecnie wpływa tylko na ext2, ext3, ext4, fat, vfat, ufs i xfs):
uk: Наведені нижче параметри стосуються будь-якої файлової системи, яку монтує програма (але не для кожної файлової системи їх буде взято до уваги, — наприклад, параметр B<sync> у поточній версії стосується лише файлових систем ext2, ext3, ext4, fat, vfat, ufs і xfs):

source: All I/O to the filesystem should be done asynchronously. (See also the B<sync> option.)
de: bewirkt, dass alle Ein- und Ausgaben vom und zum Dateisystem asynchron ausgeführt werden sollen (siehe auch die Option B<sync>).
fr: Toutes les entrées et sorties sur le système de fichiers seront asynchrones (consultez aussi l'option B<sync>).
pl: Wszelkie operacje wejścia/wyjścia dla tego systemu plików powinny być wykonywane asynchronicznie (patrz również opcja B<sync>).
uk: Усе введення-виведення файлової системи має бути виконано асинхронно. (Див. також параметр B<sync>.)

source: Do not use the B<noatime> feature, so the inode access time is controlled by kernel defaults. See also the descriptions of the B<\%relatime> and B<strictatime> mount options.
de: verwendet die B<noatime>-Funktionalität nicht, so dass der Inode-Zugriff von den Voreinstellungen des Kernels bestimmt wird. Siehe auch die Beschreibungen der Einhängeoptionen B<\%relatime> und B<strictatime>.
fr: Ne pas utiliser la fonctionnalité B<noatime>, ainsi la date d'accès à l'inœud est contrôlée par les options par défaut du noyau. Consultez aussi les descriptions des options de montage B<strictatime> et B<\%relatime>.
pl: Nie używa funkcji B<noatime>, w związku z czym czas dostępu i-węzła jest kontrolowany przez wartość domyślną jądra. Patrz również opis opcji montowania B<relatime> i B<strictatime>.
uk: Не використовувати можливість B<noatime>, використавши для керування часом доступу до inode типові параметри ядра системи. Див. також описи параметрів монтування B<\%relatime> і B<strictatime>.

source: Do not update inode access times on this filesystem (e.g.\& for faster access on the news spool to speed up news servers). This works for all inode types (directories too), so it implies B<\%nodiratime>.
de: aktualisiert die Inode-Zugriffszeiten auf diesem Dateisystem nicht (zum Beispiel für schnelleren Zugriff auf die Nachrichtenwarteschlange zum Beschleunigen von News-Servern). Dies funktioniert für alle Inode-Typen (auch Verzeichnisse), es impliziert also B<\%nodiratime>.
fr: Ne pas mettre à jour les horodatages d'accès aux inœuds sur ce système de fichiers (par exemple, pour un accès plus rapide pour des serveurs de nouvelles). Cela fonctionne pour tous les types d’inœuds (ainsi que pour les répertoires), donc cela implique B<\%nodiratime>.
pl: Nie wykonuje aktualizacji czasu dostępu w i-węźle położonym na tym systemie plików (np. w celu uzyskania szybszego dostępu do bufora wiadomości, co przyspiesza działanie serwerów grup dyskusyjnych). Działa to dla wszystkich typów i-węzłów (również katalogów), co implikuje B<\%nodiratime>.
uk: Не поновлювати час доступу до inode цієї файлової системи (наприклад, для прискорення серверів новин і швидшого доступу до повідомлень). Це працює для усіх типів inode (і для каталогів), тому неявним чином встановлюється B<nodiratime>.

source: B<context=>I<context>, B<fscontext=>I<context>, B<defcontext=>I<context>, and B<\%rootcontext=>I<context>
de: B<context=>I<Kontext>, B<fscontext=>I<Kontext>, B<defcontext=>I<Kontext> und B<\%rootcontext=>I<Kontext>
fr: B<context=>I<contexte>, B<fscontext=>I<contexte>, B<defcontext=>I<contexte> et B<\%rootcontext=>I<contexte>
pl: B<context=>I<kontekst>, B<fscontext=>I<kontekst>, B<defcontext=>I<kontekst> i B<\%rootcontext=>I<kontekst>
uk: B<context=>I<контекст>, B<fscontext=>I<контекст>, B<defcontext=>I<контекст> і B<\%rootcontext=>I<контекст>

source: The B<context=> option is useful when mounting filesystems that do not support extended attributes, such as a floppy or hard disk formatted with VFAT, or systems that are not normally running under SELinux, such as an ext3 or ext4 formatted disk from a non-SELinux workstation. You can also use B<context=> on filesystems you do not trust, such as a floppy. It also helps in compatibility with xattr-supporting filesystems on earlier 2.4.E<lt>xE<gt> kernel versions. Even where xattrs are supported, you can save time not having to label every file by assigning the entire disk one security context.
de: Die Option B<context=> ist beim Einhängen von Dateisystemen nützlich, die keine erweiterten Attribute unterstützen, wie beispielsweise Disketten oder mit VFAT formatierte Festplatten, oder Systeme, die normalerweise nicht unter SELinux laufen, wie eine mit Ext3 oder Ext4 formatierte Festplatte eines Arbeitsplatzrechners ohne SELinux. Sie können B<context=> auch bei nicht vertrauenswürdigen Dateisystemen verwenden, zum Beispiel einer Diskette. Es hilft auch bei der Kompatibilität zu Dateisystemen, die Xattr unterstützen, in früheren 2.4.E<lt>xE<gt>-Kernelversionen. Selbst wenn Xattrs unterstützt wird, können Sie dadurch Zeit sparen, weil Sie nicht jede Datei mit einem Label kennzeichnen müssen, indem Sie die gesamte Platte einem Sicherheitskontext zuordnen.
fr: L’option B<context=> est utile lors du montage de systèmes de fichiers qui ne gèrent pas les attributs étendus, tels que les lecteurs de disquette ou les disques durs formatés en VFAT, ou les systèmes qui ne fonctionnent pas sous SELinux, tels que les disques formatés en ext3 ou ext4 d’une station de travail SELinux. B<context=> peut être utilisé sur les systèmes de fichiers douteux tels les disquettes. Elle assure aussi la compatibilité avec les systèmes de fichiers prenant en charge B<xattr> avec les versions antérieures au noyau 2.4. Même si B<xattr> est pris en charge, vous pouvez sauver les horodatages sans devoir étiqueter tous les fichiers en affectant un contexte de sécurité pour le disque entier.
pl: Opcja B<context=> jest przydatna podczas montowania systemów plików, które nie obsługują atrybutów rozszerzonych, takich jak dyskietki lub dyski twarde sformatowane w VFAT lub systemy które zwykle nie działają pod SELinuksem, takie jak dyski sformatowane w ext3 lub ext4 ze stacji roboczej nie używającej SELinuksa. Można również użyć opcji B<context=> na systemach plików, którym się nie ufa, takich jak dyskietki. Pomaga również w kompatybilności z systemami plików obsługującymi xattr na wcześniejszych wersjach jądra 2.4.E<lt>xE<gt>. Nawet gdy xattr są obsługiwane, można zawsze oszczędzić czas nie etykietując każdego pliku, a przypisując całemu dyskowi jeden kontekst bezpieczeństwa.
uk: Параметр B<context=> є корисним для монтування файлових систем, у яких не передбачено підтримки розширених атрибутів, зокрема дискет та дисків, які форматовано з використанням VFAT, або систем, які, зазвичай, не працюють із SELinux, зокрема форматованих у ext3 або ext4 з робочої станції без SELinux. Ви можете скористатися B<context=> для файлових систем, яким ви не довіряєте, зокрема дискет. Цей параметр також корисний для забезпечення сумісності із файловими системами, у яких передбачено підтримку xattr, у ядрах до 2.4.E<lt>xE<gt>. Навіть якщо підтримку xattr передбачено, ви можете заощадити час на встановлення міток для кожного файла, призначивши усьому диску один контекст захисту.

source: A commonly used option for removable media is B<\%context="system_u:object_r:removable_t">.
de: Eine häufig für Wechselmedien verwendete Option ist B<\%context="system_u:object_r:removable_t">.
fr: L'option B<\%context="system_u:object_r:removable_t"> est couramment utilisée pour les supports amovibles.
pl: Często używaną opcją w przypadku nośników wymiennych jest B<context="system_u:object_r:removable_t">.
uk: Поширеним параметром для портативних носіїв даних є B<\%context="system_u:object_r:removable_t">.

source: Two other options are B<fscontext=> and B<defcontext=>, both of which are mutually exclusive of the B<context=> option. This means you can use fscontext and defcontext with each other, but neither can be used with context.
de: Zwei weitere Optionen sind B<fscontext=> und B<defcontext=>; sie schließen die B<context>-Option aus. Das bedeutet, dass Sie zwar »fscontext« und »defcontext« zusammen verwenden können, aber niemals mit »context«.
fr: Deux autres options sont B<fscontext=> et B<defcontext=>, elles sont toutes les deux mutuellement exclusives avec l'option B<context=>. Cela signifie que vous pouvez utiliser B<fscontext=> et B<defcontext=> ensemble, mais aucune ne peut être utilisée avec l'option B<context=>.
pl: Dwiema innymi opcjami są B<fscontext> i B<defcontext=>, przy czym wykluczają one opcję B<context=>. Oznacza to, że można użyć razem fscontext i defcontext, ale żadnej nie można użyć z context.
uk: Двома іншими параметрами є B<fscontext=> і B<defcontext=>. Обидва є взаємно виключними із параметром B<context=>. Це означає, що ви можете використовувати fscontext і defcontext разом, але жоден з цих параметрів не можна використовувати разом із context.

source: The B<fscontext=> option works for all filesystems, regardless of their xattr support. The fscontext option sets the overarching filesystem label to a specific security context. This filesystem label is separate from the individual labels on the files. It represents the entire filesystem for certain kinds of permission checks, such as during mount or file creation. Individual file labels are still obtained from the xattrs on the files themselves. The context option actually sets the aggregate context that fscontext provides, in addition to supplying the same label for individual files.
de: Die Option B<fscontext=> funktioniert mit allen Dateisystemen, ganz gleich, ob diese Xattr unterstützen oder nicht. Die Option »fscontext« setzt den übergreifenden Dateisystem-Label auf einen spezifischen Sicherheitskontext. Dieser Dateisystem-Label ist von den individuellen Labeln der Dateien getrennt. Er repräsentiert das gesamte Dateisystem für bestimmte Arten von Sicherheitsüberprüfungen, zum Beispiel während des Einhängens oder Anlegens von Dateien. Individuelle Datei-Label werden aus den Xattrs der Dateien selbst bezogen. Die Option »context« setzt tatsächlich den Gesamtkontext, den »fscontext« bereitstellt, zusätzlich zur Bereitstellung des gleichen Labels für individuelle Dateien.
fr: L'option B<fscontext=> fonctionne pour tous les systèmes de fichiers, qu'ils prennent en charge B<xattr> ou non. L'option B<fscontext=> change l'étiquette du système de fichiers en un contexte de sécurité spécifique. L'étiquette du système de fichiers est distincte des étiquettes individuelles des fichiers. Elle représente le système de fichiers entier pour certains types de vérification de permission, comme une période de montage ou une création de fichier. Les étiquettes individuelles de fichiers sont toujours obtenues à partir des paramètres B<xattr> des fichiers eux-mêmes. L'option de contexte définit réellement le contexte global que B<fscontext=> fournit, en plus de fournir la même étiquette pour tous les fichiers individuels.
pl: Opcja B<fscontext=> działa ze wszystkimi systemami plików, niezależnie od ich obsługi xattr. Opcja fscontext ustawia nadrzędną etykietę systemu plików na określony kontekst bezpieczeństwa. Etykieta systemu plików jest oddzielona od poszczególnych etykiet plików. Reprezentuje cały system plików w celu określonego typu sprawdzeń uprawnień, takich jak podczas montowania lub tworzenia pliku. Poszczególne etykiety pliku są wciąż pobierane z xattrs z samych plików. Opcja context w rzeczywistości ustawia zsumowany kontekst udostępniany przez fscontext, poza podawaniem samej etykiety poszczególnych plików.
uk: Параметр B<fscontext=> працює для всіх файлових систем, незалежно від підтримки ними xattr. Параметр fscontext встановлює для загальної мітки файлової системи особливий контекст безпеки. Ця мітка файлової системи є окремою від міток на файлах. Вона представляє всю файлову систему для певних видів перевірок дозволів, наприклад, під час монтування або створення файлу. Окремі мітки файлів також можна отримати зі xattr на самих файлах. Параметр контексту фактично встановлює агрегований контекст, який надає fscontext, на додаток до надання однакової мітки для окремих файлів.
