Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Enable bulk-read. VFS read-ahead is disabled because it slows down the filesystem. Bulk-Read is an internal optimization. Some flashes may read faster if the data are read at one go, rather than at several read requests. For example, OneNAND can do "read-while-load" if it reads more than one NAND page.
de: aktiviert Lesen in einem Zug. Vorauslesen im VFS ist deaktiviert, weil es das Dateisystem ausbremst. Lesen in einem Zug ist eine interne Optimierung. Einige Flash-Speicher könnten schneller lesen, wenn die Daten in einem Zug anstatt in mehreren Vorgängen gelesen werden. Zum Beispiel kann OneNAND »Lesen-beim-Laden« ausführen, wenn es mehr als eine NAND-Seite liest.
fr: Activer la lecture en masse. La lecture en avance (« readahead ») de système de fichiers virtuel est désactivée car elle ralentit le système de fichiers. La lecture en masse est une optimisation interne. Certaines mémoires flash peuvent être plus rapides en lecture si les données sont lues en une fois, plutôt que lors de requêtes successives. Par exemple, OneNAND permet la lecture en charge (« read-while-load ») si plus d'une page NAND est lue.
pl: Włącza bulk-read. Odczyt z wyprzedzeniem VFS jest wyłączony, ponieważ zwalnia on system plików. Bulk-Read jest wewnętrzną optymalizacją. Część pamięci flash może czytać szybciej, jeśli dane są odczytywane za jednym razem, zamiast przy użyciu kilku żądań odczytu. Na przykład OneNAND może wykonać "read-while-load" gdy czyta więcej niż jedną stronę NAND.
uk: Увімкнути пакетне читання. Випереджальне читання VFS вимкнено, оскільки воно уповільнює роботу файлової системи. Пакетне читання є внутрішньою оптимізацією. Читання з деяких флеш-накопичувачів може бути швидшим, якщо дані буде прочитано у один прохід, а не з використанням декількох запитів щодо читання. Наприклад, OneNAND може виконувати дію «читання під час завантаження», якщо читає декілька сторінок NAND одразу.

source: Do not bulk-read. This is the default.
de: deaktiviert Lesen in einem Zug. Dies ist der Standard.
fr: Pas de lecture en masse. C'est le comportement par défaut.
pl: Nie wykonuje bulk-read. Tak jest domyślne.
uk: Не виконувати пакетного читання. Це типова поведінка.

source: Check data CRC-32 checksums. This is the default.
de: überprüft die CRC-32-Prüfsummen der Daten. Dies ist die Voreinstellung.
fr: Vérifier les sommes de contrôle CRC-32 des données. C'est le comportement par défaut.
pl: Sprawdza sumy kontrolne CRC-32 danych. Tak jest domyślnie.
uk: Перевірити контрольні суми CRC-32 даних. Це типова поведінка.

source: Do not check data CRC-32 checksums. With this option, the filesystem does not check CRC-32 checksum for data, but it does check it for the internal indexing information. This option only affects reading, not writing. CRC-32 is always calculated when writing the data.
de: überprüft keine CRC-32-Prüfsummen der Daten. Mit dieser Option prüft das Dateisystem zwar die CRC-Prüfsummen der Daten nicht, aber es überprüft sie für die internen Indizierungsinformationen dennoch. Diese Option wirkt sich nur auf das Lesen aus, jedoch nicht auf das Schreiben. CRC-32-Prüfsummen werden beim Schreiben der Daten immer errechnet.
fr: Ne pas vérifier les sommes de contrôle CRC-32 des données. Avec cette option, le système de fichiers ne vérifie pas de somme de contrôle pour les données, mais il la vérifie pour les renseignements d'indexation internes. Cette option ne concerne que la lecture, pas l'écriture. CRC-32 est toujours calculé lors de l'écriture de données.
pl: Nie sprawdza sum kontrolnych CRC-32 danych. Z tą opcją system plików nie sprawdza sum kontrolnych CRC-32 danych, lecz sprawdza je w celu wewnętrznej informacji indeksowania. Opcja wpływa jedynie na odczyt, nie na zapis. Sumy CRC-32 są obliczane zawsze podczas zapisu danych.
uk: Не перевіряти контрольні суми CRC-32 даних. Із цим параметром файлова система не перевірятиме контрольні суми CRC-32 даних, але виконуватиме перевірку на внутрішні дані індексування. Цей параметр стосується лише читання, а не записування. Під час записування даних обчислення CRC-32 відбуватиметься завжди.

source: Select the default compressor which is used when new files are written. It is still possible to read compressed files if mounted with the B<none> option.
de: wählt den Standardkompressor, der beim Schreiben neuer Dateien verwendet wird. Es ist immer noch möglich, komprimierte Dateien zu lesen, wenn diese mit der Option B<none> eingehängt sind.
fr: Sélectionner le type de compression à utiliser lorsque les nouveaux fichiers sont écrits. La lecture de fichiers compressés est toujours possible lors d'un montage avec l'option B<none>.
pl: Wybiera domyślny tryb kompresji używany podczas zapisywania nowych plików. Nadal da się odczytać skompresowane pliki, jeśli montowanie będzie wykonane z opcją B<none>.
uk: Вибрати типовий засіб стискання, який буде використано при записуванні нових файлів. Стиснуті файли все ще можна буде прочитати, якщо змонтувати файлову систему із параметром B<none>.

source: UDF is the "Universal Disk Format" filesystem defined by OSTA, the Optical Storage Technology Association, and is often used for DVD-ROM, frequently in the form of a hybrid UDF/ISO-9660 filesystem. It is, however, perfectly usable by itself on disk drives, flash drives and other block devices. See also I<iso9660>.
de: UDF ist ein von OSTA, der »Optical Storage Technology Association« definiertes »Universal Disk Format«-Dateisystem. Es wird oft für DVD-ROMs verwendet, häufig in der Form eines hybriden UDF/ISO-9660-Dateisystems. Es ist jedoch auch für sich allein perfekt auf Plattenlaufwerken, Flash-Speichern und anderen blockorientierten Geräten nutzbar. Siehe auch I<iso9660>.
fr: UDF est le système de fichiers « Universal Disk Format », défini par l'Optical Storage Technology Association, et est souvent utilisé pour les DVD-ROM, fréquemment sous la forme d’un système de fichiers hybride UDF/ISO-9660. Il est, cependant, parfaitement utilisable tout seul sur des périphériques de disque, des périphériques flash et d’autres périphériques blocs. Consultez aussi I<iso9660>.
uk: UDF — скорочення від «Universal Disk Format» (універсальний формат дисків). Цю файлову систему стандартизовано OSTA, Optical Storage Technology Association (Асоціацією технології оптичного зберігання даних). Файлову систему часто використовують для DVD-ROM у формі гібриду із файловою системою UDF/ISO-9660. Втім, файловою системою цілком можна користуватися для дискових носіїв даних, флеш-носіїв та інших блокових пристроїв. Див. також I<iso9660>.

source: Make all files in the filesystem belong to the given user. uid=forget can be specified independently of (or usually in addition to) uid=E<lt>userE<gt> and results in UDF not storing uids to the media. In fact the recorded uid is the 32-bit overflow uid -1 as defined by the UDF standard. The value is given as either E<lt>userE<gt> which is a valid user name or the corresponding decimal user id, or the special string "forget".
de: ordnet alle Dateien im Dateisystem dem angegebenen Benutzer zu. Sie können »uid=forget« unabhängig von (oder üblicherweise zusätzlich zu) uid=E<lt>BenutzerE<gt> angeben, wodurch UDF keine UIDs auf dem Medium speichert. Faktisch ist die aufgezeichnete UID die 32-Bit-Überlauf-UID -1, wie sie im UDF-Standard definiert ist. Der Wert wird entweder als E<lt>BenutzerE<gt> angegeben, welches ein gültiger Benutzername sein muss oder die korrespondierende dezimale Benutzerkennung oder die spezielle Zeichenkette »forget«.
fr: Faire que tous les fichiers du système de fichiers appartiennent à l’utilisateur indiqué. B<uid=>I<forget> peut être indiqué indépendamment (ou habituellement en plus) de B<uid=>E<lt>I<utilisateur>E<gt>, et aboutit à ce qu’UDF n’enregistre pas les UID sur le média. En fait, l’UID enregistré est l’excédent 32 bits I<uid -1> comme défini dans la norme UDF. La valeur est donnée soit par E<lt>I<utilisateur>E<gt> qui est un nom d’utilisateur autorisé, soit l’identifiant décimal d’utilisateur correspondant ou la chaîne spéciale « I<forget> ».
uk: Зробити власником усіх файлів у файловій системі вказаного користувача. Окремо від (а, зазвичай, на додачу до) uid=E<lt>користувачE<gt>, можна вказати uid=forget. У результаті UDF не зберігатиме uid на носії даних. Фактично, записаний uid є 32-бітовим переповненням uid -1, як його визначено у стандарті UDF. Значення можна вказувати або як E<lt>користувачE<gt>, де слід використати чинну назву облікового запису користувача, або у формі відповідного десяткового ідентифікатора користувача, або у формі спеціального рядка «forget».

source: Make all files in the filesystem belong to the given group. gid=forget can be specified independently of (or usually in addition to) gid=E<lt>groupE<gt> and results in UDF not storing gids to the media. In fact the recorded gid is the 32-bit overflow gid -1 as defined by the UDF standard. The value is given as either E<lt>groupE<gt> which is a valid group name or the corresponding decimal group id, or the special string "forget".
de: ordnet alle Dateien im Dateisystem der angegebenen Gruppe zu. Sie können »gid=forget« unabhängig von (oder üblicherweise zusätzlich zu) uid=E<lt>GruppeE<gt> angeben, wodurch UDF keine GIDs auf dem Medium speichert. Faktisch ist die aufgezeichnete GID die 32-Bit-Überlauf-GID -1, wie sie im UDF-Standard definiert ist. Der Wert wird entweder als E<lt>GruppeE<gt> angegeben, welches ein gültiger Gruppenname sein muss oder die korrespondierende dezimale Gruppenkennung oder die spezielle Zeichenkette »forget«.
fr: Faire que tous les fichiers du système de fichiers appartiennent au groupe indiqué. B<gid=>I<forget> peut être indiqué indépendamment (ou habituellement en plus) de B<uid=>E<lt>I<groupe>E<gt>, et aboutit à ce qu’UDF n’enregistre pas les GID sur le média. En fait, le GID enregistré est l’excédent 32 bits I<gid -1> comme défini dans la norme UDF. La valeur est donnée soit par E<lt>I<groupe>E<gt> qui est un nom de groupe autorisé, soit l’identifiant décimal de groupe correspondant ou la chaîne spéciale « I<forget> ».
uk: Зробити власницею усіх файлів у файловій системі вказану групу. Окремо від (а, зазвичай, на додачу до) gid=E<lt>групаE<gt>, можна вказати gid=forget. У результаті UDF не зберігатиме gid на носії даних. Фактично, записаний gid є 32-бітовим переповненням gid -1, як його визначено у стандарті UDF. Значення можна вказувати або як E<lt>групаE<gt>, де слід використати чинну назву групи, або у формі відповідного десяткового ідентифікатора групи, або у формі спеціального рядка «forget».

source: Mask out the given permissions from all inodes read from the filesystem. The value is given in octal.
de: maskiert die aus dem Dateisystem gelesenen Zugriffsrechte aller Inodes. Der Wert wird in oktaler Notation angegeben.
fr: Masquer les permissions indiquées de tous les inœuds lus du système de fichiers. La valeur est fournie sous forme octale.
uk: Замаскувати вказані права доступу для усіх inode, які прочитано з файлової системи. Значення слід вказувати у вісімковому форматі.

source: If mode= is set the permissions of all non-directory inodes read from the filesystem will be set to the given mode. The value is given in octal.
de: setzt die aus dem Dateisystem gelesenen Zugriffsrechte aller Nicht-Verzeichnis-Inodes auf den angegebenen Modus. Der Wert wird in oktaler Notation angegeben.
fr: Si B<mode=> est défini, les permissions indiquées de tous les inœuds, non relatifs à un répertoire, lus du système de fichiers seront réglées au mode indiqué. La valeur est fournie sous forme octale.
uk: Якщо встановлено mode=, права доступу до усіх inode, які не є inode каталогів, які прочитано з файлової системи, буде встановлено для заданого mode. Значення слід вказувати у вісімковому форматі.

source: If dmode= is set the permissions of all directory inodes read from the filesystem will be set to the given dmode. The value is given in octal.
de: setzt die aus dem Dateisystem gelesenen Zugriffsrechte aller Verzeichnis-Inodes auf den angegebenen »dmode«. Der Wert wird in oktaler Notation angegeben.
fr: Si B<dmode=> est défini, les permissions indiquées de tous les inœuds de répertoire, lus du système de fichiers seront réglées au mode indiqué. La valeur est fournie sous forme octale.
uk: Якщо встановлено dmode=, права доступу до усіх inode каталогів, які прочитано з файлової системи, буде встановлено для заданого dmode. Значення слід вказувати у вісімковому форматі.

source: For other details see the B<mkudffs>(8) 2.0+ manpage, sections B<COMPATIBILITY> and B<BLOCK SIZE>.
de: Für weitere Details siehe die Handbuchseite zu B<mkudffs>(8) 2.0+, Abschnitte B<COMPATIBILITY> und B<BLOCK SIZE>.
fr: Pour plus de détails, consultez le manuel de B<mkudffs>(8), version 2.0+, sections B<COMPATIBILITY> et B<BLOCK SIZE>.
uk: Щоб ознайомитися із іншими подробицями, прочитайте сторінку підручника B<mkudffs>(8) 2.0+, розділи B<СУМІСНІСТЬ> і B<РОЗМІР БЛОКУ>.

source: Don't embed data in the inode.
de: bettet keine Daten im Inode ein.
fr: Ne pas intégrer de données dans l’inœud.
uk: Не вбудовувати дані до inode.

source: Set the NLS character set. This requires kernel compiled with CONFIG_UDF_NLS option.
de: legt den NLS-Zeichensatz fest. Dafür ist es notwendig, dass der Kernel mit der Option CONFIG_UDF_NLS kompiliert wurde.
fr: Définir le jeu de caractères NLS. Cela nécessite que le noyau soit compilé avec l’option CONFIG_UDF_NLS.
uk: Встановити набір символів NLS. Це потребує збирання ядра з параметром CONFIG_UDF_NLS.

source: UFS is a filesystem widely used in different operating systems. The problem are differences among implementations. Features of some implementations are undocumented, so its hard to recognize the type of ufs automatically. That's why the user must specify the type of ufs by mount option. Possible values are:
de: UFS ist ein Dateisystem, das in verschiedenen Betriebssystemen weit verbreitet ist. Das Problem sind die Unterschiede in den diversen Implementierungen. Die Funktionalitäten einiger Implementierungen sind nicht dokumentiert, darum ist es schwer, den UFS-Typ automatisch zu erkennen. Daher muss der Benutzer den UFS-Typ als Einhängeoption angeben. Zulässige Werte sind:
fr: UFS est un système de fichiers largement utilisé sur différents systèmes d'exploitation. Malgré tout, des différences existent suivant les implémentations. Certaines fonctionnalités de certaines implémentations sont mal documentées, et il est donc difficile de reconnaître automatiquement le type d'UFS. C'est pourquoi l'utilisateur doit indiquer le type d'UFS au montage. Les valeurs possibles sont :
pl: UFS jest systemem plików szeroko wykorzystywanym w różnych systemach operacyjnych. Problem stanowią różnice pomiędzy implementacjami. Cechy niektórych z nich są nieudokumentowane, tak więc trudno rozpoznać automatycznie typ ufs. Z tego powodu użytkownik musi określić typ ufs za pomocą opcji montowania. Możliwe wartości to:
uk: UFS є файловою системою, яку широко використовують у різних операційних системах. Проблемою є різниця у реалізаціях. Можливості деяких реалізацій не документовано, тому важко розпізнати тип ufs автоматично. Ось чому користувачеві слід вказати тип ufs параметром монтування. Можливими значеннями є такі:

source: Old format of ufs, this is the default, read only. (Don't forget to give the -r option.)
de: bezeichnet das alte Format von UFS, dies ist die Vorgabe, nur lesbar (vergessen Sie nicht, die Option -r anzugeben).
fr: Ancien format d'UFS, utilisé par défaut, en lecture seule (ne pas oublier l'option B<-r>).
pl: Stary format ufs, jest to typ domyślny, tylko do odczytu (proszę nie zapomnieć podać opcji -r).
uk: Старий формат ufs, є типовим, лише читання (Не забудьте вказати параметр -r.)

source: For filesystems created by OpenStep (currently read only). The same filesystem type is also used by Mac OS X.
de: für die von OpenStep erzeugten Dateisysteme (gegenwärtig nur lesbar). Der gleiche Dateisystemtyp wird auch von Mac OS X verwendet.
fr: Pour les systèmes de fichiers créés par OpenStep (lecture seule actuellement). Le même système de fichiers est aussi utilisé par Mac OS X.
pl: Do systemów plików utworzonych przez OpenStep (obecnie tylko do odczytu). Ten sam typ systemów plików jest również używany przez Mac OS X.
uk: Для файлових систем, які створено OpenStep (у поточній версії лише читання). Той самий тим файлової системи також використовує Mac OS X.

source: These mount options don't do anything at present; when an error is encountered only a console message is printed.
de: ist momentan unwirksam; beim Auftreten eines Fehlers wird lediglich eine Konsolenmeldung ausgegeben.
fr: Ces options ne font rien pour le moment ; seul un message est affiché sur la console en cas d'erreur.
pl: Te opcje montowania teraz nic nie robią: po napotkaniu błędu wypisują tylko komunikat na konsoli.
uk: У поточній версії ці параметри не виконують ніяких функцій. Якщо буде виявлено помилку, програма лише виведе повідомлення до консолі.

source: See mount options for msdos. The B<dotsOK> option is explicitly killed by I<umsdos>.
de: Siehe die Einhängeoptionen für MSDOS. Die Option B<dotsOK> wird durch I<umsdos> explizit unwirksam.
fr: Consultez les options de montage pour I<msdos>. L'option B<dotsOK> est explicitement supprimée par I<umsdos>.
pl: Zobacz opcje do msdos. Opcja B<dotsOK> jest jawnie ubijana przez I<umsdos>.
uk: Див. параметри монтування для msdos. Параметр B<dotsOK> явним чином знищується I<umsdos>.

source: First of all, the mount options for I<fat> are recognized. The B<dotsOK> option is explicitly killed by I<vfat>. Furthermore, there are
de: Zuerst werden die Einhängeoptionen für I<fat> berücksichtigt. Die Option B<dotsOK> wird bei I<vfat> explizit unwirksam. Weiterhin gibt es
fr: Tout d'abord les options de montage pour I<fat> sont reconnues. L'option B<dotsOK> est explicitement supprimée par I<vfat>. De plus, il existe :
pl: Przede wszystkim, rozpoznawane są wszystkie opcje do I<fat>. Opcja B<dotsOK> jest jawnie ubijana przez I<vfat>. Ponadto istnieją
uk: Перш за все, буде розпізнано параметри монтування для I<fat>. Параметр B<dotsOK> буде явним чином прибрано вибором I<vfat>. Далі, є

source: Translate unhandled Unicode characters to special escaped sequences. This lets you backup and restore filenames that are created with any Unicode characters. Without this option, a '?' is used when no translation is possible. The escape character is ':' because it is otherwise invalid on the vfat filesystem. The escape sequence that gets used, where u is the Unicode character, is: ':', (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
de: übersetzt unbehandelte Unicode-Zeichen in spezielle Escape-Sequenzen. Dadurch können Sie Dateinamen sichern und wiederherstellen, die aus beliebigen Unicode-Zeichen erzeugt wurden. Ohne diese Option wird ein »?« verwendet, wenn keine Übersetzung möglich ist. Das Maskierungszeichen ist »:«, weil es ansonsten im VFAT-Dateisystem unzulässig ist. Die verwendete Escape-Sequenz ist »:«, (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12), wobei »u« das Unicode-Zeichen ist.
fr: Conversion des caractères Unicode non gérés en séquences d'échappement spéciales. Cela permet de sauver et de restaurer des fichiers dont le nom contient n'importe quel caractère Unicode. Sans cette option, un « ? » est utilisé à la place des caractères dont la conversion est impossible. Le caractère d'échappement est « : » puisqu'il est de toute manière incorrect dans les noms de fichiers I<vfat>. La séquence d'échappement utilisée pour remplacer le caractère Unicode u est : « : », (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
pl: Tłumaczy nieobsługiwane znaki Unikodu na specjalne sekwencje unikowe. To umożliwia wykonywanie kopii zapasowych i odtwarzanie plików o nazwach, utworzonych ze znakami Unikodu. Bez tej opcji, w wypadku braku możliwości konwersji używane jest '?'. Znakiem unikowym jest ':', ponieważ na systemie vfat jest w innych wypadkach nieprawidłowy. Sekwencja specjalna, która byłaby użyta dla znaku u, gdzie u jest znakiem Unikodu to: ':', (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
uk: Перетворити непридатні до обробки символи Unicode на спеціальні екрановані послідовності символів. Це надасть вам змогу створювати резервні копії і відновлювати з них назви файлів, які створено із будь-якими символами Unicode. Без цього параметра, якщо перетворення неможливе, для символів буде використано «?». Символом екранування є «:», оскільки інші символи у файловій системі vfat будуть некоректними. Екрановані послідовності, які буде використано, з позначенням символу Unicode літерою u: «:», (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).

source: Allow two files with names that only differ in case. This option is obsolete.
de: ermöglicht das Vorhandensein zweier Dateien, deren Namen sich nur hinsichtlich Groß-/Kleinschreibung unterscheiden. Diese Option ist veraltet.
fr: Autoriser l'existence de deux fichiers dont les noms ne diffèrent que par une distinction majuscule/minuscule. Cette option est obsolète.
pl: Pozwala, by dwa pliki miały nazwy różniące się tylko wielkością liter. Ta opcja jest przestarzała.
uk: Дозволити два файли із назвами, які відрізняються лише регістром символів. Цей параметр є застарілим.

source: First try to make a short name without sequence number, before trying I<name\s+3~\s0num.ext>.
de: versucht zuerst, einen Kurznamen ohne Sequenznummer zu erzeugen, bevor I<Name\s+3~\s0Num.Erw> versucht wird.
fr: Essayer d'abord de créer un nom court sans numéro de séquence avant d'essayer I<nom\s+3~\s0num.ext>.
pl: Zanim zacznie próbować I<nazwa~nr.roz> najpierw próbuje zrobić krótką nazwę bez numeru kolejnego.
uk: Спочатку спробувати створити коротку назву без номера у послідовності, перш ніж спробувати I<назва\s+3~\s0номер.суфікс>.

source: UTF8 is the filesystem safe 8-bit encoding of Unicode that is used by the console. It can be enabled for the filesystem with this option or disabled with utf8=0, utf8=no or utf8=false. If `uni_xlate' gets set, UTF8 gets disabled.
de: UTF8 ist die dateisystemsichere 8-Bit-Kodierung von Unicode, die in der Konsole verwendet wird. Sie kann mit dieser Option für das Dateisystem aktiviert oder mit »utf8=0«, »utf8=no« oder »utf8=false« deaktiviert werden. Wenn »uni_xlate« gesetzt wird, dann wird UTF8 deaktiviert.
fr: UTF-8 est l'encodage 8-bits sûr de l'Unicode du système de fichiers utilisé par la console. Il peut être activé pour le système de fichiers avec cette option ou désactivé avec B<utf8=0>, B<utf8=no> ou B<utf8=false>. Si B<uni_xlate> est activé, UTF-8 est désactivé.
pl: UTF8 jest systemem plików bezpiecznego 8-bitowego kodowania Unikodu, który jest wykorzystywany przez konsolę. Tą opcją można go włączyć dla danego systemu plików lub wyłączyć za pomocą utf8=0, utf8=no lub utf8=false. Jeśli zostanie ustawione `uni_xlate', UTF8 jest wyłączane.
uk: UTF8 — безпечне щодо файлових системи 8-бітове кодування Unicode, яке використовує консоль. Його можна увімкнути для файлової системи за допомогою цього параметра або вимкнути за допомогою utf8=0, utf8=no або utf8=false. Якщо встановлено «uni_xlate», UTF8 буде вимкнено.
