Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: System Administration
fr: Administration Système
pl: Administracja systemem
uk: Керування системою

source: NAME
de: BEZEICHNUNG
fr: NOM
pl: NAZWA
uk: НАЗВА

source: mount - mount a filesystem
de: mount - ein Dateisystem einhängen
fr: mount - Monter un système de fichiers
pl: mount - montuje system plików
uk: mount — змонтувати файлову систему

source: B<mount> [B<-l>] [B<-t> I<fstype>]
de: B<mount> [B<-l>] [B<-t> I<Dateisystemtyp>]
fr: B<mount> [B<-l>] [B<-t> I<type_sf>]
pl: B<mount> [B<-l>] [B<-t> I<typ_systemu>]
uk: B<mount> [B<-l>] [B<-t> I<тип_файлової_системи>]

source: B<mount> B<-a> [B<-fFnrsvw>] [B<-t> I<fstype>] [B<-O> I<optlist>]
de: B<mount> B<-a> [B<-fFnrsvw>] [B<-t> I<Dateisystemtyp>] [B<-O> I<Optionsliste>]
fr: B<mount> B<-a> [B<-fFnrsvw>] [B<-t> I<type_sf>] [B<-O> I<liste_options>]
pl: B<mount> B<-a> [B<-fFnrsvw>] [B<-t> I<typ-systemu>] [B<-O> I<lista-opcji>]
uk: B<mount> B<-a> [B<-fFnrsvw>] [B<-t> I<тип_файлової_системи>] [B<-O> I<список_параметрів>]

source: B<mount> [B<-fnrsvw>] [B<-o> I<options>] I<device>|I<mountpoint>
de: B<mount> [B<-fnrsvw>] [B<-o> I<Optionen>] I<Gerät>|I<Einhängepunkt>
fr: B<mount> [B<-fnrsvw>] [B<-o> I<options>] I<périphérique>|I<point_montage>
pl: B<mount> [B<-fnrsvw>] [B<-o> I<opcje>] I<urządzenie>|I<punkt-montowania>
uk: B<mount> [B<-fnrsvw>] [B<-o> I<параметри>] I<пристрій>|I<точка_монтування>

source: B<mount> [B<-fnrsvw>] [B<-t> I<fstype>] [B<-o> I<options>] I<device mountpoint>
de: B<mount> [B<-fnrsvw>] [B<-t> I<Dateisystemtyp>] [B<-o> I<Optionen>] I<Gerät Einhängepunkt>
fr: B<mount> [B<-fnrsvw>] [B<-t> I<type_sf>] [B<-o> I<options>] I<périphérique point_montage>
pl: B<mount> [B<-fnrsvw>] [B<-t> I<typ-systemu>] [B<-o> I<opcje>] I<urządzenie punkt-montowania>
uk: B<mount> [B<-fnrsvw>] [B<-t> I<тип_файлової_системи>] [B<-o> I<параметри>] I<пристрій точка_монтування>

source: B<mount> B<--bind>|B<--rbind>|B<--move> I<olddir newdir>
de: B<mount> B<--bind>|B<--rbind>|B<--move> I<Altes_Verzeichnis Neues_Verzeichnis>
fr: B<mount> B<--bind>|B<--rbind>|B<--move> I<ancien_répertoire nouveau_répertoire>
pl: B<mount> B<--bind>|B<--rbind>|B<--move> I<stary-katalog nowy-katalog>
uk: B<mount> B<--bind>|B<--rbind>|B<--move> I<старий_каталог новий_каталог>

source: B<mount> B<--make->[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<mountpoint>
de: B<mount> B<--make->[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<Einhängepunkt>
fr: B<mount> B<--make->[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<point_montage>
uk: B<mount> B<--make->[B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>] I<точка_монтування>

source: All files accessible in a Unix system are arranged in one big tree, the file hierarchy, rooted at I</>. These files can be spread out over several devices. The B<mount> command serves to attach the filesystem found on some device to the big file tree. Conversely, the B<umount>(8) command will detach it again. The filesystem is used to control how data is stored on the device or provided in a virtual way by network or other services.
de: Alle in einem Unix-System erreichbaren Dateien sind in einem einzigen großen Baum organisiert, der Dateihierarchie, deren Wurzel I</> ist. Diese Dateien können über verschiedene Geräte verteilt sein. Der Befehl B<mount> dient dazu, das auf einem Gerät befindliche Dateisystem in den großen Dateibaum einzuhängen. Umgekehrt hängt der Befehl B<umount>(8) das Dateisystem wieder aus. Das Dateisystem steuert, wie Daten auf dem Gerät gespeichert oder auf virtuelle Weise über das Netzwerk oder andere Dienste bereitgestellt werden.
fr: Tous les fichiers accessibles par un système UNIX sont insérés dans une grande arborescence, la hiérarchie des fichiers, commençant à la racine « I</> ». Ces fichiers peuvent être répartis sur différents périphériques. La commande B<mount> permet d'attacher un système de fichiers trouvé sur un périphérique quelconque à la grande arborescence de fichiers. À l'inverse, B<umount>(8) le détachera à nouveau. Le système de fichiers est utilisé pour contrôler comment les données sont stockées sur un périphérique ou fournies de façon virtuelle par le réseau ou d’autres services.
pl: Wszystkie pliki dostępne w systemie Unix są zorganizowane w jednym wielkim drzewie, hierarchii plików, zakorzenionej w I</>. Pliki te mogą być położone na wielu urządzeniach. Polecenie B<mount> umożliwia przyłączenie systemu plików znajdującego się na danym urządzeniu do wielkiego drzewa plików. Odwrotnie, polecenie B<umount>(8) powoduje odłączenie go. System plików służy do kontroli sposobu przechowywania danych na urządzeniu albo udostępnienia ich w wirtualnej postaci przez sieć lub inne usługi.
uk: Всі файли, доступні в системі Unix, зібрані в одне велике дерево, ієрархію файлів, з коренем в I</>. Ці файли можуть розташовуватися на різних пристроях. Команда B<mount> служить для приєднання файлової системи, знайденої на деяких пристроях, у велике дерево файлів. І навпаки, команда B<umount>(8) знову їх від'єднує. Файлова система використовується, щоб контролювати, як дані зберігаються на пристрої або наданому у віртуальний спосіб через мережу або інші служби.

source: The standard form of the B<mount> command is:
de: Die Standardform des Befehls B<mount> lautet wie folgt:
fr: La forme standard de la commande B<mount> est :
pl: Standardowa postać polecenia B<mount> to:
uk: Стандартна форма команди B<mount> є:

source: B<mount -t> I<type device dir>
de: B<mount-t> I<Typ Gerät Verzeichnis>
fr: B<mount -t> I<type périphérique répertoire>
pl: B<mount -t> I<typ urządzenie katalog>
uk: B<mount -t> I<тип пристрій каталог>

source: This tells the kernel to attach the filesystem found on I<device> (which is of type I<type>) at the directory I<dir>. The option B<-t> I<type> is optional. The B<mount> command is usually able to detect a filesystem. The root permissions are necessary to mount a filesystem by default. See section "Non-superuser mounts" below for more details. The previous contents (if any) and owner and mode of I<dir> become invisible, and as long as this filesystem remains mounted, the pathname I<dir> refers to the root of the filesystem on I<device>.
de: weist den Kernel an, das auf dem I<Gerät> gefundene Dateisystem (des angegebenen I<Typs>) im angegebenen I<Verzeichnis> einzuhängen. Die Option B<-t >I<Typ> ist nicht zwingend notwendig. Der Befehl B<mount> ist üblicherweise in der Lage, ein Dateisystem zu erkennen. Root-Rechte sind erforderlich, um ein Dateisystem standardmäßig einzuhängen. Siehe den nachfolgenden Abschnitt »Einhängungen als normaler Benutzer« für weitere Details. Die vorherigen Inhalte (falls vorhanden) sowie der Eigentümer und der Modus des I<Verzeichnisses> werden unsichtbar. Solange dieses Dateisystem eingehängt bleibt, verweist der Pfadname I<Verzeichnis> auf die Wurzel des Dateisystems auf dem angegebenen I<Gerät>.
fr: Cela indique au noyau d'attacher le système de fichiers se trouvant sur le I<périphérique> mentionné (dont le type est I<type>) dans le répertoire I<répertoire> indiqué. L’option B<-t> I<type> est facultative. La commande B<mount> est généralement capable de détecter un système de fichiers. Par défaut, les droits de superutilisateur sont nécessaires pour monter un système de fichiers. Consultez la section « montages pour les utilisateurs ordinaires » ci-dessous pour plus de détails. Les contenus (s’ils existent), le propriétaire et le mode d'accès précédents du I<répertoire> deviennent invisibles et, tant que le nouveau système de fichiers reste monté, le chemin I<répertoire> se réfère à la racine du système de fichiers du I<périphérique>.
pl: Nakazuje jądru, by przyłączyło system plików znaleziony na danym I<urządzeniu> (które jest typu I<typ>) w zadanym I<katalogu>. Opcja B<-t> I<typ> jest opcjonalna. Polecenie B<mount> potrafi zwykle rozpoznać system plików. Domyślnie, do zamontowania systemu plików wymagane są uprawnienia roota. Więcej informacji znajduje się poniżej, w rozdziale "Montowanie przez zwykłych użytkowników". Poprzednia zawartość (jeśli istniała) i właściciel oraz prawa katalogu I<katalog> stają się niewidzialne na czas przyłączenia (zamontowania) nowego systemu plików. W tym czasie ścieżka I<katalog> odnosi się do korzenia systemu plików na podanym I<urządzeniu>.
uk: Наказує ядру приєднати файлову систему, знайдену на I<пристрій> (що має тип I<тип>) в каталозі I<каталог>. Параметр B<-t> I<тип> є необов'язковим. Команда B<mount> переважно сама може визначити файлову систему. Дозволи root типово необхідні, щоб змонтувати файлову систему. Див. розділ "Монтування для несуперкористувача" нижче щодо подальшої інформації. Попередній вміст (якщо він був) а також власник та режим доступу I<каталог> стають невидимі, і поки система примонтована, шлях I<каталог> вказує на кореневу файлову систему на I<пристрій>.

source: If only the directory or the device is given, for example:
de: In dem Fall, in dem nur das Verzeichnis oder das Gerät angegeben ist, beispielsweise:
fr: Si seul le répertoire ou le périphérique est donné, par exemple :
pl: Jeśli podano jedynie urządzenie lub katalog, na przykład:
uk: Якщо надано лише каталог або пристрій, наприклад:

source: B<mount> I</dir>
de: B<mount> I</Verzeichnis>
fr: B<mount> I</répertoire>
uk: B<mount> I</каталог>

source: then B<mount> looks for a mountpoint (and if not found then for a device) in the I</etc/fstab> file. It\(cqs possible to use the B<--target> or B<--source> options to avoid ambiguous interpretation of the given argument. For example:
de: schaut B<mount> nach einem Einhängepunkt (und falls keiner gefunden wird, nach einem Gerät) in der Datei I</etc/fstab>. Mit den Optionen B<--target> oder B<--source> können Sie eine mehrdeutige Interpretation des angegebenen Arguments vermeiden. Zum Beispiel:
fr: alors B<mount> recherche un point de montage (et s’il n’en trouve pas, un périphérique) dans le fichier I</etc/fstab>. Utiliser les options B<--target> ou B<--source> permet d’éviter une interprétation ambivalente de l’argument donné. Par exemple :
pl: to B<mount> szuka punktu montowania (i jeśli go nie znajdzie – urządzenia) w pliku I</etc/fstab>. Można użyć opcji B<--target> lub B<--source>, aby uniknąć niejednoznacznej interpretacji podanego argumentu np.:
uk: тоді B<mount> шукає на точку монтування (і якщо не знайдено, тоді на пристрій) у файлі I</etc/fstab>. Можна використовувати параметри B<--target> або B<--source>, щоб уникнути неоднозначних інтерпретацій для наданих аргументів. Наприклад:

source: B<mount --target> I</mountpoint>
de: B<mount --target> I</Einhängepunkt>
fr: B<mount --target> I</point_montage>
uk: B<mount --target> I</точка_монтування>

source: The same filesystem may be mounted more than once, and in some cases (e.g., network filesystems) the same filesystem may be mounted on the same mountpoint multiple times. The B<mount> command does not implement any policy to control this behavior. All behavior is controlled by the kernel and it is usually specific to the filesystem driver. The exception is B<--all>, in this case already mounted filesystems are ignored (see B<--all> below for more details).
de: Ein Dateisystem kann mehrfach eingehängt werden, in einigen Fällen (zum Beispiel Netzwerkdateisysteme) sogar mehrfach im gleichen Einhängepunkt. Der B<mount>-Befehl implementiert keinerlei Regeln, die dieses Verhalten steuern. Sämtliches Verhalten wird durch den Kernel gesteuert und ist üblicherweise vom Dateisystemtreiber abhängig. Eine Ausnahme bildet B<--all>, wodurch bereits eingehängte Dateisysteme ignoriert werden (siehe B<--all> unten für weitere Details).
fr: Le même système de fichiers peut être monté plus d’une fois, et dans certains cas (par exemple, les systèmes de fichiers de réseau) le même système de fichiers peut être monté sur le même point de montage plus d’une fois. La commande de montage ne met en œuvre aucune politique pour contrôler ce comportement. Tous les comportements sont contrôlés par le noyau et sont généralement spécifiques au pilote du système de fichiers. L’exception étant B<--all> pour laquelle les systèmes de fichiers déjà montés sont ignorés (consulter B<--all> ci-dessous pour plus de détails).
pl: Ten sam system plików można zamontować kilka razy, a w niektórych przypadkach (np. sieciowe systemy plików) może być zamontowany wielokrotnie nawet w tym samym punkcie montowania. Polecenie B<mount> nie implementuje żadnych zasad kontrolujących to zachowanie. Jest to zadanie jądra i zwykle zależy od danego sterownika systemu plików. Wyjątkiem jest B<--all> - w tym przypadku wszystkie już zamontowane systemy plików zostaną zignorowane (więcej informacji w opisie tej opcji).
uk: Одну й ту ж файлову систему можна змонтувати кілька разів, а в деяких випадках (наприклад, мережеві файлові системи) одну й ту ж файлову систему можна кілька разів змонтувати до однієї точки монтування. Команда B<mount> не реалізує жодної політики для керування цією поведінкою. Уся поведінка керується ядром і зазвичай залежить від драйвера файлової системи. Винятком є B<--all>: у цьому випадку вже змонтовані файлові системи нехтуються (докладніше див. B<--all> нижче).

source: Listing the mounts
de: Auflistung der Einhängungen
fr: Liste des montages
pl: Wypisywanie montowań
uk: Отримання списку змонтованого

source: The listing mode is maintained for backward compatibility only.
de: Der Listenmodus wird nur noch zwecks Abwärtskompatibilität gepflegt.
fr: Le mode liste n’est maintenu que pour la compatibilité ascendante.
pl: Tryby wypisywania są utrzymywane tylko dla wstecznej kompatybilności.
uk: Списковий режим підтримується лише для сумісності з попередніми версіями.

source: For more robust and customizable output use B<findmnt>(8), B<especially in your scripts>. Note that control characters in the mountpoint name are replaced with \(aq?\(aq.
de: Für eine robustere und besser anpassbare Ausgabe verwenden Sie B<findmnt>(8), B<speziell in Ihren Skripten>. Beachten Sie, dass Steuerzeichen im Namen des Einhängepunkts durch »?« ersetzt werden.
fr: Pour une sortie plus explicite et paramétrable utilisez B<findmnt>(8), B<en particulier dans les scripts>. Remarquez que les caractères de contrôle dans le nom de point de montage sont remplacés par des « ? ».
pl: Aby uzyskać spójniejsze i dające się konfigurować wyjście, proszę korzystać z B<findmnt>(8), B<w szczególności w swoich skryptach>. Proszę zauważyć, że znaki kontrolne w nazwach punktów montowania są zastępowane znakiem "?".
uk: Для докладнішого та налаштовуваного виведення, B<особливо у власних скриптах>, використовуйте B<findmnt>(8). Зверніть увагу, що символи керування в назві точки монтування замінюються на \(aq?\(aq.

source: The following command lists all mounted filesystems (of type I<type>):
de: Der folgende Befehl listet alle eingehängten Dateisysteme (des angegebenen I<Typs>) auf:
fr: La commande suivante affiche tous les systèmes de fichiers montés (de type I<type>) :
pl: Poniższe polecenie wypisze wszystkie zamontowane systemy plików (typu I<typ>):
uk: Така команда виведе перелік усіх змонтованих файлових систем (типу I<тип>):

source: The option B<-l> adds labels to this listing. See below.
de: Die Option B<-l> fügt Bezeichnungen zu dieser Auflistung hinzu. Siehe unten.
fr: L'option B<-l> ajoute des étiquettes à la liste. Voir plus bas.
pl: Opcja B<-l> ujmuje w zestawieniu również etykiety. Patrz niżej.
uk: Параметр B<-l> додає до цього списку мітки. Див. нижче.

source: Indicating the device and filesystem
de: Bezeichnung des Gerätes und Dateisystems
fr: Nommage des périphériques et systèmes de fichiers
pl: Wskazywanie urządzenia i systemu plików
uk: Вказує пристрій і файлову систему

source: Most devices are indicated by a filename (of a block special device), like I</dev/sda1>, but there are other possibilities. For example, in the case of an NFS mount, I<device> may look like I<knuth.cwi.nl:/dir>.
de: Die meisten Geräte werden durch einen Dateinamen (eines blockorientierten Spezialgerätes) bezeichnet, beispielsweise I</dev/sda1>, aber es gibt noch weitere Möglichkeiten. Zum Beispiel kann das I<Gerät> im Fall einer NFS-Einhängung aussehen wie I<knuth.cwi.nl:/dir>.
fr: La plupart des périphériques sont indiqués sous forme de nom de fichier (d'un périphérique bloc spécial), comme I</dev/sda1>, mais d'autres possibilités existent. Par exemple, pour un montage NFS, I<périphérique> peut ressembler à I<knuth.cwi.nl:/dir>.
pl: Większość urządzeń jest wskazywanych przez nazwę pliku (specjalnego urządzenia blokowego), jak np. I</dev/sda1>, lecz istnieją inne możliwości. Na przykład w wypadku montowania NFS, I<urządzenie> może wyglądać tak: I<knuth.cwi.nl:/katalog>.
uk: Більшість пристроїв позначаються назвою файлу (блокового спеціального пристрою), як і I</dev/sda1>, але можливе й інше. Наприклад, у випадку монтування NFS, I<device> може мати вигляд I<knuth.cwi.nl:/dir>.

source: The device names of disk partitions are unstable; hardware reconfiguration, and adding or removing a device can cause changes in names. This is the reason why it\(cqs strongly recommended to use filesystem or partition identifiers like UUID or LABEL. Currently supported identifiers (tags):
de: Der Gerätename der Plattenpartitionen ist instabil; der Name kann sich durch die Hardwarekonfiguration oder Hinzufügen bzw. Entfernen eines Gerätes ändern. Aus diesem Grund wird nachdrücklich empfohlen, Dateisystem- oder Partitionsbezeichnungen wie UUID oder BEZEICHNUNG zu verwenden. Folgende Bezeichner (Markierungen) werden derzeit unterstützt:
fr: Les noms de périphérique de partitions de disque ne sont pas immuables. Une reconfiguration matérielle, l’ajout ou le retrait d’un périphérique peuvent provoquer des modifications de noms. C’est pour cela qu’il est fortement recommandé d’utiliser des identificateurs de système de fichiers ou de partition tels que des UUID ou LABEL. Actuellement les identificateurs (mots-clés) gérés sont :
pl: Nazwy urządzeń partycji dysku są niestabilne i mogą ulec zmianie na skutek zmiany konfiguracji sprzętu albo dodaniu lub usunięciu urządzenia. Z tego względu usilnie zaleca się używanie UUID lub LABEL (etykieta) do identyfikowania systemów plików i partycji. Obecnie obsługiwane są następujące znaczniki:
uk: Назви пристроїв розділів диска нестабільні; зміна конфігурації обладнання, а також додавання чи видалення пристрою може призвести до зміни назв. Тому дуже бажано використовувати ідентифікатори файлових систем або розділів, такі як UUID або LABEL. Наразі підтримуються такі ідентифікатори (теги):

source: LABEL=I<label>
de: LABEL=I<Bezeichner>
fr: LABEL=I<étiquette>
pl: LABEL=I<etykieta>
uk: LABEL=I<мітка>

source: Human readable filesystem identifier. See also B<-L>.
de: Menschenlesbarer Dateisystembezeichner. Siehe auch B<-L>.
fr: Identificateur compréhensible de système de fichiers. Consultez aussi B<-L>.
pl: Identyfikator systemu plików czytelny dla człowieka. Zob. również B<-L>.
uk: Ідентифікатор файлової системи, зрозумілий людині. Див. також B<-L>.

source: Filesystem universally unique identifier. The format of the UUID is usually a series of hex digits separated by hyphens. See also B<-U>.
de: »Universally unique identifier« (universeller eindeutiger Bezeichner) des Dateisystems. Das UUID-Format ist üblicherweise eine Reihe von Hexadezimalziffern, die durch Bindestriche getrennt werden. Siehe auch B<-U>.
fr: Identifiant unique universel (UUID). Le format de l’UUID est ordinairement une série de chiffres hexadécimaux séparés par des traits d’union. Consultez aussi B<-U>.
pl: Uniwersalny, unikatowy identyfikator systemu plików. UUID składa się zwykle z liczb szesnastkowych oddzielonych minusem. Zob. też B<-U>.
uk: Універсальний унікальний ідентифікатор файлової системи. UUID зазвичай записують як серію шістнадцяткових цифр, розділених дефісами. Див. також B<-U>.

source: Note that B<mount> uses UUIDs as strings. The UUIDs from the command line or from B<fstab>(5) are not converted to internal binary representation. The string representation of the UUID should be based on lower case characters.
de: Beachten Sie, dass B<mount> UUIDs als Zeichenketten verwendet. Die UUIDs aus der Befehlszeile oder von B<fstab>(5) werden nicht in die interne Binärdarstellung umgewandelt. Die Zeichenkettendarstellung der UUID sollte Kleinbuchstaben verwenden.
fr: Remarquez que B<mount> utilise les UUID comme des chaînes. Les UUID de la ligne de commande ou dans B<fstab>(5) ne sont pas convertis en représentation binaire interne. La chaîne représentant l'UUID devrait être composée de caractères en minuscules.
pl: Proszę zauważyć, że B<mount> używa UUID-ów jako łańcuchów tekstowych. UUID-y z wiersza poleceń lub B<fstab>(5) nie są konwertowane do wewnętrznej reprezentacji binarnej. Litery w reprezentacji łańcucha UUID powinny być małymi literami.
uk: Зверніть увагу, що B<mount> використовує UUID як рядки. UUID з командного рядка або з B<fstab>(5) не перетворюються у внутрішнє двійкове подання. В рядковому поданні UUID слід використовувати символи нижнього регістру.

source: PARTLABEL=I<label>
de: PARTLABEL=I<Bezeichner>
fr: PARTLABEL=I<étiquette>
pl: PARTLABEL=I<etykieta>
uk: PARTLABEL=I<мітка>

source: Human readable partition identifier. This identifier is independent on filesystem and does not change by B<mkfs> or B<mkswap> operations. It\(cqs supported for example for GUID Partition Tables (GPT).
de: Menschenlesbare Partitionsbezeichnung. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identificateur compréhensible de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations B<mkfs> ou B<mkswap>. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
uk: Ідентифікатор розділу, зрозумілий людині. Цей ідентифікатор не залежить від файлової системи і не змінюється операціями B<mkfs> чи B<mkswap>. Його підтримують, наприклад, таблиці розділів GUID (GPT).

source: Partition universally unique identifier. This identifier is independent on filesystem and does not change by B<mkfs> or B<mkswap> operations. It\(cqs supported for example for GUID Partition Tables (GPT).
de: »Universally unique identifier« (universeller eindeutiger Bezeichner) der Partition. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identifiant unique universel de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations B<mkfs> ou B<mkswap>. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
uk: Універсальний унікальний ідентифікатор розділу. Цей ідентифікатор не залежить від файлової системи і не змінюється операціями B<mkfs> чи B<mkswap>. Підтримується, наприклад, для таблиць розділів GUID (GPT).
