Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Note that the Linux kernel does not allow changing multiple propagation flags with a single B<mount>(2) system call, and the flags cannot be mixed with other mount options and operations.
de: Beachten Sie, dass der Linux-Kernel keine Änderungen mehrerer Ausbreitungs-Schalter mit einem einzelnen B<mount>(2)-Systemaufruf erlaubt und die Schalter nicht mit anderen Einhängeoptionen und Aktionen kombiniert werden können.
fr: Remarquez que le noyau Linux ne permet pas de modifier plusieurs attributs de propagation avec un seul appel système B<mount>(2) et que les attributs ne peuvent pas être mélangés avec d’autres options et opérations de montage.
uk: Зауважте, що ядро Linux не дозволяє зміни декількох прапорців поширення одним системним викликом B<mount>(2), і прапорці не можна змішувати із іншими параметрами і діями з монтування.

source: Since util-linux 2.23 the B<mount> command can be used to do more propagation (topology) changes by one mount(8) call and do it also together with other mount operations. This feature is EXPERIMENTAL. The propagation flags are applied by additional B<mount>(2) system calls when the preceding mount operations were successful. Note that this use case is not atomic. It is possible to specify the propagation flags in B<fstab>(5) as mount options (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
de: Seit der Version 2.23 von Util-linux ermöglicht der Befehl B<mount> weitere Ausbreitungs-(topologische) Änderungen mit einem mount(8)-Aufruf und erledigt das auch zusammen mit anderen Einhängeaktionen. Diese Funktion ist EXPERIMENTELL. Die Ausbreitungs-Schalter werden durch zusätzliche B<mount>(2)-Systemaufrufe angewendet, wenn die vorangehenden Einhängeaktionen erfolgreich waren. Beachten Sie, dass dieser Anwendungsfall nicht atomar ist. Es ist möglich, Ausbreitungs-Schalter in der Datei B<fstab>(5) als Einhängeoptionen anzugeben (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
fr: Depuis util-linux 2.23, la commande B<mount> peut être utilisée pour réaliser plus de modifications de propagation (topologie) avec un seul appel B<mount>(8) et de façon simultanée avec d’autres opérations de montage. Cette fonctionnalité est B<expérimentale>. Les attributs de propagation sont appliqués par des appels système B<mount>(2) supplémentaires lorsque les opérations précédentes de montage ont réussi. Remarquez que ce cas d’utilisation n’est pas atomique. Les attributs de propagation peuvent être indiqués dans B<fstab>(5) comme des options de montage (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
uk: Починаючи з util-linux 2.23, командою B можна скористатися для внесення додаткових змін із поширенням (топологією) шляхом одного виклику mount(8), а також виконання цієї дії разом із іншими діями з монтування. Ця можливість є експериментальною. Прапорці поширення застосовуються додатковими викликами B<mount>(2), якщо попередні дії з монтування були успішними. Зауважте, що таке користування програмою не є атомарним. Вказувати прапорці поширення можна у B<fstab>(5) як параметри монтування (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).

source: B<mount --make-private --make-unbindable /dev/sda1 /foo>
fr: B<mount --make-private --make-unbindable /dev/sda1 /toto>

source: B<mount /dev/sda1 /foo> B<mount --make-private /foo> B<mount --make-unbindable /foo>
fr: B<mount /dev/sda1 /toto> B<mount --make-private /toto> B<mount --make-unbindable /toto>

source: The B<mount> command does not pass all command-line options to the B</sbin/mount.>I<suffix> mount helpers. The interface between B<mount> and the mount helpers is described below in the section B<EXTERNAL HELPERS>.
de: Der Befehl B<mount> übergibt nicht alle Befehlszeilenoptionen an die Einhänge-Hilfsprogramme B</sbin/mount.>I<suffix>. Die Schnittstelle zwischen B<mount> und den Hilfsprogrammen ist unten im Abschnitt B<EXTERNE HILFSPROGRAMME> beschrieben.
fr: La commande B<mount> ne passe pas toutes les options de la ligne de commande aux programmes auxiliaires de montage B</sbin/mount.>I<suffixe>. L’interface entre B<mount> et les programmes auxiliaires de montage est décrite plus bas dans la section B<AUXILIAIRES EXTERNES>.
pl: Polecenie B<mount> nie przekazuje wszystkich opcji wiersza poleceń do programów pomocniczych B</sbin/mount.>I<przyrostek>. Interfejs pomiędzy B<mount> i programami pomocniczymi opisano poniżej, w rozdziale B<ZEWNĘTRZNE PROGRAMY POMOCNICZE>.
uk: Команда B<mount> не передає усі параметри рядка команди допоміжним засобам монтування B</sbin/mount.>I<суфікс>. Інтерфейс між B<mount> і допоміжними засобами монтування описано нижче у розділі B<ЗОВНІШНІ ДОПОМІЖНІ ЗАСОБИ>.

source: Mount all filesystems (of the given types) mentioned in I<fstab> (except for those whose line contains the B<noauto> keyword). The filesystems are mounted following their order in I<fstab>. The B<mount> command compares filesystem source, target (and fs root for bind mount or btrfs) to detect already mounted filesystems. The kernel table with already mounted filesystems is cached during B<mount --all>. This means that all duplicated I<fstab> entries will be mounted.
de: hängt alle Dateisysteme (der angegebenen Typen) ein, die in der Datei I<fstab> aufgeführt sind (außer jene, deren Eintrag das Schlüsselwort B<noauto> enthält). Die Dateisysteme werden nach deren Reihenfolge in I<fstab> eingehängt. Der B<mount>-Befehl vergleicht die Dateisystemquelle, das Ziel und die Dateisystemwurzel (letztere für Bind-Einhängungen oder Btrfs), um bereits eingehängte Dateisysteme zu erkennen. Die Kernel-Tabelle mit bereits eingehängten Dateisystemen wird während der Ausführung von B<mount --all> zwischengespeichert. Das bedeutet, dass alle mehrfach vorhandenen I<fstab>-Einträge ausgeführt werden.
fr: Monter tous les systèmes de fichiers (des types donnés) mentionnés dans I<fstab> (à part ceux dont la ligne contient le mot-clé B<noauto>). Les systèmes de fichiers sont montés dans l’ordre de I<fstab>. La commande de montage compare la source et la cible du système de fichiers (et la racine du système de fichiers pour les montages « bind » et Btrfs) pour détecter les systèmes de fichiers déjà montés. La table du noyau avec les systèmes de fichiers déjà montés est mise en cache lors de B<mount --all>. Cela signifie que toutes les entrées en double seront montées.
uk: Змонтувати усі файлові системи (вказаних типів), які згадано у I<fstab> (окрім тих, у рядках яких міститься ключове слово B<noauto>). Файлові системи буде змонтовано за порядком, у якому їх вказано у I<fstab>. Команда B<mount> порівняє джерело і призначення файлової системи (а також корінь файлової системи для монтувань із прив'язкою або btrfs) для виявлення вже змонтованих файлових систем. Під час виконання B<mount --all> буде кешовано таблицю ядра із вже змонтованими файловими системами. Це означає, що буде змонтовано усі дубльовані у I<fstab> записи.

source: Since version 2.35 is possible to use the command line option B<-o> to alter mount options from I<fstab> (see also B<--options-mode>).
de: Seit Version 2.35 können Sie die Befehlszeilenoption B<-o> zum Anpassen der Einhängeoptionen aus der I<fstab> verwenden (siehe auch B<--options-mode>).
fr: Depuis la version 2.35, il est possible d’utiliser l’option B<-o> de la ligne de commande pour modifier les options de montage de I<fstab> (consulter aussi B<--options-mode>).
pl: Od wersji 2.35, opcji wiersza poleceń B<-o> można użyć do modyfikacji parametrów montowania z I<fstab> (zob. też B<--options-mode>).
uk: З версії 2.35 можна використовувати параметр командного рядка B<-o>, щоб змінити параметр з I<fstab> (див. також B<--options-mode>).

source: Remount a subtree somewhere else (so that its contents are available in both places). See above, under B<Bind mounts>.
de: hängt einen Unterbaum erneut an einem anderen Ort ein (so dass dessen Inhalt an beiden Orten erscheint). Siehe oben im Abschnitt B<Bind-Einhängungen>.
fr: Remonter une sous-arborescence ailleurs (le contenu sera disponible en deux points différents). Voir plus haut « Les opérations de remontage ».
pl: Montuje ponownie poddrzewo w innym miejscu (tak, że jego zawartość jest dostępna w obu miejscach). Patrz wyżej w rozdziale B<Montowanie z podpięciem (bind)>.
uk: Повторно змонтувати піддерево кудись в інше місце (щоб його дані були доступними в обох місцях). Див. вище, розділ B<Монтування з пов'язуванням>.

source: Don't canonicalize paths. The B<mount> command canonicalizes all paths (from the command line or I<fstab>) by default. This option can be used together with the B<-f> flag for already canonicalized absolute paths. The option is designed for mount helpers which call B<mount -i>. It is strongly recommended to not use this command-line option for normal mount operations.
de: kanonisiert keine Pfade. Der B<mount>-Befehl kanonisiert standardmäßig alle Pfade (aus der Befehlszeile oder I<fstab>). Diese Option kann zusammen mit B<-f> für bereits kanonisierte absolute Pfade verwendet werden. Die Option ist für Einhänge-Hilfsprogramme gedacht, die B<mount -i> verwenden. Wir raten dringend davon ab, diese Befehlszeilenoption für normale Einhängeaktionen zu verwenden.
fr: Ne pas rendre les chemins canoniques. La commande B<mount> rend tous les chemins canoniques (depuis la ligne de commande ou I<fstab>) par défaut. Cette option peut être utilisée avec l’attribut B<-f> pour les chemins absolus déjà canoniques. L’option est conçue pour les auxiliaires de montage qui appellent B<mount -i>. L’utilisation de cette option en ligne de commande est fortement déconseillée pour les opérations normales de montage.
pl: Nie normalizuje ścieżek. Polecenie montowania domyślnie normalizuje wszystkie ścieżki (z wiersza poleceń lub B<fstab>). Opcja może być użyta razem z B<-f> do już znormalizowanych ścieżek absolutnych. Opcja jest przeznaczona dla programów pomocniczych wywołujących B<mount -i>. Zdecydowanie nie zaleca się korzystania z tej opcji przy normalnych operacjach montowania.
uk: Не перетворювати шляхи до канонічної форми. Команда B<mount> типово перетворює всі шляхи до канонічної форми (з командного рядка або I<fstab>). Цей параметр можна вжити разом з прапорцем B<-f>, для вже канонізованих абсолютних шляхів. Цей параметр призначається для помічників монтування, які викликають B<mount -i>. Настійливо рекомендується не вживати цей параметр командного рядка для нормальних дій монтування.

source: Note that B<mount>(8) does not pass this option to the B</sbin/mount.>I<type> helpers.
de: Beachten Sie, dass B<mount>(8) diese Option nicht an die Hilfsprogramme B</sbin/mount.>I<Typ> übergibt.
fr: Remarquez que B<mount>(8) ne passe pas cette option aux auxiliaires B</sbin/mount.>I<type>.
pl: Proszę zauważyć, że B<mount>(8) nie przekazuje tej operacji do programów pomocniczych B</sbin/mount.>I<typ>.
uk: Зауважте, що B<mount>(8) не передає цей параметр допоміжним засобам B</sbin/mount.>I<тип>.

source: (Used in conjunction with B<-a>.) Fork off a new incarnation of B<mount> for each device. This will do the mounts on different devices or different NFS servers in parallel. This has the advantage that it is faster; also NFS timeouts proceed in parallel. A disadvantage is that the order of the mount operations is undefined. Thus, you cannot use this option if you want to mount both I</usr> and I</usr/spool>.
de: (Wird in Kombination mit B<-a> verwendet) – erzeugt eine neue Instanz von B<mount> für jedes Gerät. Damit können die Einhängungen auf verschiedenen Geräten oder verschiedenen NFS-Servern parallel ausgeführt werden. Der Vorteil liegt in der höheren Geschwindigkeit; auch NFS-Zeitüberschreitungen werden parallelisiert. Ein Nachteil ist, dass die Einhängungen in undefinierter Reihenfolge ausgeführt werden. Daher können Sie diese Option nicht verwenden, wenn Sie sowohl I</usr> als auch I</usr/spool> einhängen wollen.
fr: (Utilisée conjointement avec B<-a>) lancer un nouveau processus B<mount> pour chaque périphérique. Cela effectuera le montage en parallèle sur divers périphériques ou serveurs NFS. L'avantage est la rapidité ; de plus les délais maximaux de NFS agissent en parallèle. Un désavantage est que l’ordre des opérations de montage est indéfini. Il ne faut donc pas utiliser cette option pour monter à la fois I</usr> et I</usr/spool>.
uk: (Використовують у поєднанні з B<-a>.) Відгалужувати новий екземпляр B<mount> для кожного пристрою. Таким чином, монтування на різних пристроях або різних серверах NFS виконуватимуться паралельно. Це пришвидшує обробку. Крім того, відлік часу очікування на дані NFS виконуватиметься паралельно. Недолік полягає у тому, що порядок дій з монтування буде невизначеним. Отже, ви не зможете користуватися цим параметром, якщо хочете змонтувати одразу I</usr> і I</usr/spool>.

source: Causes everything to be done except for the actual system call; if it's not obvious, this ``fakes'' mounting the filesystem. This option is useful in conjunction with the B<-v> flag to determine what the B<mount> command is trying to do. It can also be used to add entries for devices that were mounted earlier with the B<-n> option. The B<-f> option checks for an existing record in I</etc/mtab> and fails when the record already exists (with a regular non-fake mount, this check is done by the kernel).
de: führt alles aus, außer den tatsächlichen Systemaufruf; falls nicht offensichtlich, die Einhängung des Dateisystems wird »vorgetäuscht«. Diese Option ist in Verbindung mit B<-v> nützlich, um zu ermitteln, was der Befehl B<mount> zu tun versucht. Sie können die Option auch zum Hinzufügen von Einträgen für Geräte verwenden, die zuvor mit der Option B<-n> eingehängt wurden. Die Option B<-f> prüft, ob in I</etc/mtab> ein entsprechender Datensatz vorhanden ist und schlägt fehl, wenn der Datensatz bereits existiert (mit einer regulären, nicht vorgetäuschten Einhängung, diese Überprüfung wird vom Kernel ausgeführt).
fr: Fonctionnement normal sauf pour l'appel système effectif qui n'est pas exécuté. Cela simule le montage du système de fichiers. Cette option, en conjonction avec l’attribut B<-v>, permet de déterminer ce que la commande B<mount> essaye de faire. Cela peut aussi servir à ajouter des entrées pour les périphériques montés précédemment avec l'option B<-n>. L'option B<-f> vérifie l'existence d'une entrée dans I</etc/mtab> et échoue si l'entrée existe déjà (avec un montage standard non simulé, cette vérification est faite par le noyau).
pl: Powoduje wykonywanie wszystkiego poza faktycznym wywołaniem funkcji systemowej. Jeśli nie jest to oczywiste: "udaje" to montowanie systemu plików. W połączeniu z flagą B<-v> przydaje się do ustalenia, co usiłuje zrobić polecenie B<mount>. Może być też używana do dodawania wpisów dla urządzeń, które zamontowano wcześniej z opcją B<-n>. Opcja B<-f> sprawdza istnienie rekordu w I</etc/mtab> i zawodzi, jeśli rekord już istnieje (w przypadku zwykłych, nieudawanych montowań, to sprawdzenie jest wykonywane przez jądro).
uk: Наказує програмі виконати усі дії, окрім самого системного виклику; якщо це ще не очевидно, просто «підробляє» монтування файлової системи. Цей параметр корисний у поєднанні із прапорцем B<-v> для визначення, що саме програма B<mount> намагатиметься зробити. Ним можна також скористатися для додавання записів для пристроїв, які було змонтовано раніше за допомогою параметра B<-n>. Додавання параметра B<-f> призводить до перевірки наявності запису у I</etc/mtab>. Програма видає помилку, якщо запис вже існує (створений звичайним, не фіктивним монтуванням, перевірку буде виконано ядром системи).

source: Don't call the B</sbin/mount.>I<filesystem> helper even if it exists.
de: ruft das Hilfsprogramm B</sbin/mount.>I<Dateisystem> nicht auf, selbst wenn es existiert.
fr: Ne pas appeler l'auxiliaire B</sbin/mount.>I<système_de_fichiers>, même s'il existe.
pl: Nie wywołuje programu pomocniczego B</sbin/mount.>I<system-plików>, nawet jeśli istnieje.
uk: Не викликати допоміжний засіб B</sbin/mount.>I<файлова_система>, навіть якщо він існує.

source: B<-L>,B< --label >I<label>
de: B<-L>,B< --label >I<Bezeichnung>
fr: B<-L>, B<--label> I<étiquette>
pl: B<-L>,B< --label >I<etykieta>
uk: B<-L>,B< --label >I<мітка>

source: Add the labels in the mount output. B<mount> must have permission to read the disk device (e.g.\& be set-user-ID root) for this to work. One can set such a label for ext2, ext3 or ext4 using the B<e2label>(8) utility, or for XFS using B<xfs_admin>(8), or for reiserfs using B<reiserfstune>(8).
de: fügt die Bezeichnungen in der Ausgabe von Mount hinzu. Damit dies funktioniert, muss B<mount> die Zugriffsrechte zum Lesen des Plattengerätes haben (z.B.\& »set-user-ID« root sein). Sie können eine solche Bezeichnung für Ext2, Ext3 oder Ext4 mit dem Dienstprogramm B<e2label>(8) festlegen, für XFS mit B<xfs_admin>(8) oder für Reiserfs mit B<reiserfstune>(8).
fr: Ajouter les étiquettes à la sortie de B<mount>. B<mount> doit avoir le droit de lire le périphérique du disque (par exemple en étant exécuté en tant que superutilisateur, set-user-ID root). Une étiquette pour les systèmes I<ext2>, I<ext3> ou I<ext4> peut être écrite avec l'utilitaire B<e2label>(8), pour XFS avec l'utilitaire B<xfs_admin>(8) et pour ReiserFS avec l'utilitaire B<reiserfstune>(8).
pl: Dokłada etykiety do wyjścia wypisywanego przez mount. Żeby opcja ta mogła działać, B<mount> musi mieć prawo odczytu urządzania dyskowego (np. suid root). Można ustawić taką etykietę dla ext2, ext3 lub ext4 za pomocą narzędzia B<e2label>(8), zaś dla XFS - stosując B<xfs_admin>(8) lub dla reiserfs używając B<reiserfstune>(8).
uk: Додати мітки у виведені під час монтування дані. Щоб це спрацювало, у B<mount> мають бути права доступу на читання дискового пристрою (наприклад права доступу користувача root). Таку мітку можна встановити для ext2, ext3 або ext4 за допомогою допоміжної програми B<e2label>(8), для XFS за допомогою B<xfs_admin>(8), а для reiserfs за допомогою B<reiserfstune>(8).

source: Move a subtree to some other place. See above, the subsection B<The move operation>.
de: verschiebt einen Unterbaum an einen anderen Ort. Siehe oben im Abschnitt B<Die Verschiebe-Aktion>.
fr: Déplacer une sous-arborescence ailleurs. Voir plus haut « Les opérations de déplacement ».
pl: Przenosi poddrzewo w inne miejsce. Patrz powyżej w podrozdziale B<Operacja przenoszenia>.
uk: Пересунути піддерево в інше місце. Див. вище, підрозділ B<Дія з пересування>.

source: Mount without writing in I</etc/mtab>. This is necessary for example when I</etc> is on a read-only filesystem.
de: hängt ein, ohne einen Eintrag in I</etc/mtab> zu schreiben. Dies ist beispielsweise nötig, wenn sich I</etc> in einem schreibgeschützten Dateisystem befindet.
fr: Monter sans écriture dans I</etc/mtab>. C'est nécessaire si I</etc> réside sur un système de fichiers en lecture seule.
pl: Montuje bez zapisywania w I</etc/mtab>. Jest to niezbędne na przykład gdy I</etc> znajduje się na systemie plików tylko do odczytu.
uk: Монтувати без запису в I</etc/mtab>. Це потрібно, наприклад, коли I</etc> є на файловій системі лише для читання.

source: B<-N>,B< --namespace >I<ns>
de: B<-N>,B< --namespace >I<Namensraum>
fr: B<-N>, B<--namespace> I<espace_de_noms>
pl: B<-N>,B< --namespace >I<pn>
uk: B<-N>,B< --namespace >I<простір_назв>

source: Perform the mount operation in the mount namespace specified by I<ns>. I<ns> is either PID of process running in that namespace or special file representing that namespace.
de: führt die Einhängung in dem angegebenen I<Namensraum> aus. Der I<Namensraum> ist entweder die Kennung (PID) des in diesem Namensraum laufenden Prozesses oder eine spezielle Datei, die diesen Namensraum repräsentiert.
fr: Réaliser l’opération de montage dans l’espace de noms de montage indiqué par I<espace_de_noms>. Celui-ci est soit un PID de processus en cours d’exécution dans cet espace, soit un fichier spécial représentant cet espace de noms.
uk: Виконати дію монтування у просторі назв монтування, вказаному I<ns>. I<ns> є або PID процесу, що працює в тому просторі назв або спеціальний файл, що представляє той простір.

source: B<mount>(8) switches to the mount namespace when it reads I</etc/fstab>, writes I</etc/mtab> (or writes to I</run/mount>) and calls the B<mount>(2) system call, otherwise it runs in the original mount namespace. This means that the target namespace does not have to contain any libraries or other requirements necessary to execute the B<mount>(2) call.
de: B<mount>(8) wechselt in den Einhängenamensraum, wenn es die Datei I</etc/fstab> liest, in die Datei I</etc/mtab> (oder I</run/mount>) schreibt und ruft den Systemaufruf B<mount>(2) auf, anderenfalls läuft es im ursprünglichen Einhängenamensraum. Das bedeutet, dass der Ziel-Namensraum keine Bibliotheken oder anderes enthalten muss, um B<mount>(2) aufzurufen.
fr: B<mount>(8) bascule vers l’espace de noms de montage lorsqu’il lit I</etc/fstab>, écrit sur I</etc/mtab> (ou écrit sur I</run/mount>) et exécute l’appel système B<mount>(2). Sinon il s’exécute dans l’espace de noms de montage original. Cela signifie que l’espace de noms cible n’a pas à contenir toute bibliothèque ou autre exigence nécessaire pour exécuter la commande B<mount>(2).
uk: B<mount>(8) перемикає до простору назв монтування, коли читає I</etc/fstab>, записує I</etc/mtab> (або записує I</run/mount>) і викликає B<mount>(2), інакше воно працює в початковому просторі назв монтування. Це означає, що простір назв призначення не мусить містити будь-яких бібліотек або інших вимог, потрібних для виконання системного виклику B<mount>(2).

source: B<-O>,B< --test-opts >I<opts>
de: B<-O>,B< --test-opts >I<Optionen>
fr: B<-O>, B<--test-opts> I<options>
pl: B<-O>,B< --test-opts >I<opcje>
uk: B<-O>,B< --test-opts >I<параметри>

source: Limit the set of filesystems to which the B<-a> option applies. In this regard it is like the B<-t> option except that B<-O> is useless without B<-a>. For example, the command:
de: begrenzt die Gruppe der Dateisysteme, auf welche die Option B<-a> angewendet werden soll. In dieser Hinsicht verhält sie sich wie die Option B<-t>, jedoch ist B<-O> ohne B<-a> wirkungslos. Zum Beispiel hängt der Befehl
fr: Limiter l'ensemble des systèmes de fichiers auxquels l’option B<-a> s'applique. De ce point de vue, c’est comme l’option B<-t> sauf que B<-O> est inutile sans B<-a>. Par exemple, la commande :
pl: Ogranicza grupę systemów plików do której stosowana jest opcja B<-a>. Podobnie jak B<-t>, z tym wyjątkiem, że B<-O> jest bezużyteczna bez opcji B<-a>. Na przykład polecenie:
uk: Обмежити набір файлових систем, для яких застосовуємо параметр B<-a>. У цьому відношення це як параметр B<-t>, окрім того, що B<-O> є марним без B<-a>. Наприклад, команда

source: mounts all filesystems except those which have the option I<_netdev> specified in the options field in the I</etc/fstab> file.
de: alle Dateisysteme ein, außer jene, für die im Optionsfeld der Datei I</etc/fstab> die Option I<_netdev> angegeben ist.
fr: monte tous les systèmes de fichiers sauf ceux qui ont l'option B<_netdev> indiquée dans le champ option du fichier I</etc/fstab>.
pl: montuje wszystkie systemy plików z wyjątkiem posiadających podaną opcją I<_netdev> w polu opcji pliku I</etc/fstab>.
uk: монтує всі файлові системи, крім тих, що мають параметр I<_netdev>, вказаний у полі параметрів у файлі I</etc/fstab>.

source: B<-o>,B< --options >I<opts>
de: B<-o>,B< --options >I<Optionen>
fr: B<-o>, B<--options> I<options>
pl: B<-o>,B< --options >I<opcje>
uk: B<-o>,B< --options >I<параметри>
