Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Mount the filesystem read/write. Read-write is the kernel default and the B<mount> default is to try read-only if the previous mount syscall with read-write flags on write-protected devices of filesystems failed.
de: hängt das Dateisystem les- und schreibbar ein. Lesen und Schreiben ist die Voreinstellung des Kernels; die Voreinstellung von B<mount> ist es, zu versuchen, nur lesbar einzuhängen, falls der vorherige B<mount>(2)-Systemaufruf zum Einhängen mit den Lese-/Schreib-Schaltern auf schreibgeschützten Geräten oder Dateisystemen fehlgeschlagen ist.
fr: Monter le système de fichiers en écriture et lecture. C'est le réglage par défaut du noyau, et le comportement par défaut de B<mount> est d’essayer la lecture seule si le précédent appel système de montage avec des drapeaux pour la lecture et l’écriture sur des périphériques protégés contre l’écriture échouait.
pl: Montuje system plików do odczytu i zapisu. Jest to domyślne ustawienie jądra, a B<mount> domyślnie montuje system plików w trybie tylko do odczytu w przypadku, gdy poprzednie wywołanie systemowe mount z flagą read-write zawiodło, ponieważ wykonano je na nośniku zabezpieczonym przed zapisem.
uk: Змонтувати файлову систему у режимі читання-запису. Режим читання-запису є типовим для ядра, а типовою поведінкою B<mount> є спроба змонтувати у режимі лише читання, якщо попередній системний виклик B<mount>() із прапорцями читання-запису на захищених від запису пристроях файлових систем зазнав невдачі.

source: Some of these options could be enabled or disabled by default in the system kernel. To check the current setting see the options in I</proc/mounts>. Note that filesystems also have per-filesystem specific default mount options (see for example B<tune2fs -l> output for ext_N_ filesystems).
de: Einige dieser Optionen könnten im Systemkernel standardmäßig aktiviert oder deaktiviert sein. Die aktuelle Einstellung finden Sie in I</proc/mounts>. Beachten Sie, dass Dateisysteme auch dateisystemspezifische Standard-Einhängeoptionen haben (siehe zum Beispiel die Ausgabe von B<tune2fs -l> für ExtI<N>-Dateisysteme).
fr: Certaines de ces options peuvent être activées ou désactivées par défaut dans l'environnement du noyau. Pour vérifier la configuration actuelle, consultez les options dans I</proc/mounts>. Remarquez que les systèmes de fichiers ont aussi des options de montage par défaut spécifiques au système de fichiers (consultez par exemple la sortie de B<tune2fs -l> pour les systèmes de fichiers ext_N_).
pl: Część tych opcji może zostać domyślnie włączona lub wyłączona przez jądro systemu. Aby sprawdzić bieżące ustawienia, proszę sprawdzić opcje w I</proc/mounts>. Proszę zauważyć, że istnieją również domyślne opcje montowania charakterystyczne dla poszczególnych systemów plików (zob. np. wynik B<tune2fs -l> dla systemów plików extI<N>).
uk: Деякі з цих параметрів можна типово увімкнути або вимкнути у ядрі системи. Щоб перевірити поточне значення параметра, ознайомтеся із параметрами у I</proc/mounts>. Зауважте, що файлові системи також мають власні типові параметри монтування (див., наприклад, виведені командою B<tune2fs -l> дані для файлових систем ext_N_).

source: Allow mandatory locks on this filesystem. See B<fcntl>(2).
de: erlaubt zwingende Sperren auf diesem Dateisystem. Siehe B<fcntl>(2).
fr: Permettre les verrouillages obligatoires sur ce système de fichiers. Consultez B<fcntl>(2).
pl: Pozwala na ściśle egzekwowane blokady w systemie plików. Patrz B<fcntl>(2).
uk: Дозволити обов'язкові блокування на цій файловій системі. Див. B<fcntl>(2).

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem. In addition, SELinux domain transitions require permission nosuid_transition, which in turn needs also policy capability nnp_nosuid_transition.
de: respektiert die Bits oder Datei-Capabilities »set-user-ID« und »set-group-ID« bei der Ausführung von Programmen von diesem Dateisystem nicht. Zusätzlich benötigen SELinux-Domänenübergänge die Erlaubnis nosuid_transition, die wiederum auch die Richtlinien-Capability nnp_nosuid_transition benötigt.
fr: Ne pas tenir compte des bits Set-UID et Set-GID ou des capacités de fichier lors de l'exécution de programmes de ce système de fichiers. En complément, les transitions de domaine SELinux exigent la permission I<nosuid_transition>, qui à son tour nécessite la capacité de politique I<nnp_nosuid_transition>.
pl: Nie honoruje bitów lub właściwości plików set-user-ID i set-group-ID przy wykonywaniu programów z tego systemu plików. Dodatkowo, zmiana domeny SELinux wymaga uprawnienia nosuid_transition, które z kolei wymaga również funkcji polityki nnp_nosuid_transition.
uk: Не брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконанні програм з цієї файлової системи Крім того, переходи домену SELinux потребують прав доступу nosuid_transition, що потребує можливості правил nnp_nosuid_transition.

source: After this call all old mount options are replaced and arbitrary stuff from I<fstab> (or I<mtab>) is ignored, except the loop= option which is internally generated and maintained by the mount command.
de: Nach diesem Aufruf werden alle alten Einhängeoptionen ersetzt und jegliche Angaben aus I<fstab> oder I<m>tab ignoriert, außer die Option B<loop=>, die intern erzeugt und vom Befehl B<mount> verwaltet wird.
fr: Après cet appel, toutes les anciennes options de montage sont remplacées et les options arbitraires du fichier I<fstab> (ou I<mtab>) sont ignorées, à part l’option B<loop=> qui est générée en interne et maintenue par la commande B<mount>.
pl: Po tym wywołaniu wszystkie stare opcje montowania są zastępowane, a arbitralne rzeczy z I<fstab> (lub I<mtab>) są ignorowane, z wyjątkiem opcji loop=, która jest tworzona i zarządzana wewnętrznie przez polecenie mount.
uk: Після цього виклику усі старі параметри монтування буде замінено, а довільні дані з I<fstab> (або I<mtab>) буде проігноровано, окрім параметра loop=, який буде створено на внутрішньому рівні і який буде супроводжуватися програмою mount.

source: After this call, mount reads I<fstab> and merges these options with the options from the command line (B<-o>). If no mountpoint is found in I<fstab>, then a remount with unspecified source is allowed.
de: Nach diesem Aufruf liest B<mount> die I<fstab>-Datei und führt diese Optionen mit den Befehlszeilenoptionen zusammen (B<-o>). Wenn in der I<fstab> kein Einhängepunkt gefunden wird, dann ist erneutes Einhängen ohne angegebene Quelle erlaubt.
fr: Après cet appel, B<mount> lit I<fstab> et fusionne ces options avec les options de la ligne de commande (B<-o>). Si aucun point de montage n’est trouvé dans I<fstab>, alors le remontage sans source indiquée est permis.
pl: Po tym wywołaniu mount odczytuje I<fstab> i łączy te opcje z opcjami podanymi w wierszu poleceń (B<-o>). Jeśli we I<fstab> nie będzie podanego punktu montowania, to dopuszczalne jest przemontowanie z niezdefiniowanego źródła.
uk: Після цього виклику mount читає I<fstab> і об'єднує ці параметри з параметрами з рядка команди (B<-o>). Якщо в I<fstab> не буде знайдено точки монтування, буде дозволено повторне монтування без визначення джерела.

source: remounts all already mounted vfat filesystems in read-only mode. Each of the filesystems is remounted by B<mount -o remount,ro /dir> semantic. This means the B<mount> command reads I<fstab> or I<mtab> and merges these options with the options from the command line.
de: hängt alle bereits eingehängten VFAT-Dateisysteme im schreibgeschützten Modus erneut ein. Jedes der Dateisysteme wird mit der Semantik B<mount -o remount,ro /dir> erneut eingehängt. Das bedeutet, dass der Befehl B<mount> die I<fstab>- oder I<mtab>-Datei liest und die dort gefundenen Optionen mit den Optionen der Befehlszeile zusammenführt.
fr: remonte tous les systèmes de fichiers I<vfat> déjà montés en mode écriture seule. Chaque système de fichiers est remonté par la sémantique I<mount -o remount,ro /dir>. Cela signifie que la commande B<mount> lit I<fstab> ou I<mtab> et fusionne leurs options avec celles de la ligne de commande.
pl: przemontuje wszystkie już zamontowane systemy plików vfat w tryb tylko do odczytu. Każdy z systemów plików jest przemontowywany zgodnie z semantyką B<mount -o remount,ro /dir>. Oznacza to, że polecenie B<mount> odczyta I<fstab> lub I<mtab> i połączy te opcje, z opcjami podanymi w wierszu polecenia.
uk: повторно монтує усі вже змонтовані файлові системи vfat у режимі лише читання. Кожну файлову системі буде повторно змонтовано із семантикою B<mount -o remount,ro /каталог>. Це означає, що програма B<mount> прочитає I<fstab> або I<mtab> і об'єднає ці параметри з параметрами з рядка команди.

source: Allow to make a target directory (mountpoint) if it does not exit yet. The optional argument I<mode> specifies the filesystem access mode used for B<mkdir>(2) in octal notation. The default mode is 0755. This functionality is supported only for root users or when mount executed without suid permissions. The option is also supported as x-mount.mkdir, this notation is deprecated since v2.30.
de: ermöglicht das Anlegen eines Zielverzeichnisses (Einhängepunktes), falls es noch nicht existiert. Das optionale Argument I<Modus> gibt für B<mkdir>(2) den Zugriffsmodus des Dateisystems in oktaler Notation an. Der Standardmodus ist 0755. Diese Funktionalität wird nur für Root-Benutzer unterstützt oder wenn B<mount> ohne SUID-Zugriffsrechte ausgeführt wird. Die Option wird auch in der Form x-mount.mkdir unterstützt, diese Notation ist seit Version 2.30 veraltet.
fr: Permettre de créer un répertoire cible (point de montage) s’il n’existe pas encore. L’argument facultatif I<mode> indique le mode d’accès au système de fichiers utilisé pour B<mkdir>(2) en notation octale. Le mode par défaut est 0755. Cette fonctionnalité n’est prise en charge que pour le superutilisateur ou quand B<mount> est exécuté sans les droits setuid. Cette option est aussi prise en charge sous forme B<x-mount.mkdir>, cette notation est obsolète depuis la version 2.30.
pl: Pozwala na utworzenie docelowego katalogu (punktu montowania), o ile jeszcze nie istnieje. Opcjonalny argument I<tryb> określa tryb dostępu systemu plików dla B<mkdir>(2) w zapisie ósemkowym. Domyślnym trybem jest 0755. Funkcja ta jest obsługiwana tylko dla roota lub gdy montowanie jest wykonywane bez uprawnień suid. Opcja ta jest obsługiwana również jako x-mount.mkdir, przy czym ten format jest przestarzały od wersji 2.30.
uk: Дозволити створення каталогу призначення (точки монтування), якщо його ще не існує Додатковий аргумент I<режим> визначає режим доступу до файлової системи, який буде використано у B<mkdir>(2), у вісімковій формі запису. Типовим режимом є 0755. Підтримку цієї функціональної можливості передбачено лише для користувача root або запуску B без прав доступу suid. Підтримку цього параметра також передбачено у формі x-mount.mkdir, але ця форма вважається застарілою з версії 2.30.

source: Forces the driver to use the CVF (Compressed Volume File) module cvf__module_ instead of auto-detection. If the kernel supports kmod, the cvf_format=xxx option also controls on-demand CVF module loading. This option is obsolete.
de: bewirkt, dass der Treiber das CVF-Modul (Compressed Volume File) cvf_I<Modul> verwendet, anstatt dass es automatisch erkannt wird. Wenn der Kernel Kmod unterstützt, steuert die Option cvf_format=xxx auch das bedarfsabhängige Laden von CVF-Modulen. Diese Option ist veraltet.
fr: Obliger le pilote à utiliser le module CVF (Compressed Volume File) cvf__module_ plutôt que l'autodétection. Si le noyau gère kmod, l'option B<cvf_format=>I<module> commande aussi le chargement du module CVF à la demande. Cette option est obsolète.
pl: Wymusza na sterowniku stosowanie modułu CVF (Compressed Volume File) cvf__module_ zamiast automatycznego wykrywania. Jeżeli jądro obsługuje kmod, to opcja cvf_format=xxx steruje także ładowaniem na żądanie modułu CVF. Ta opcja jest przestarzała.
uk: Наказує драйверу використовувати модуль CVF (Compressed Volume File, файл стиснутого тому) cvf__модуль_ замість автоматичного виявлення. Якщо у ядрі передбачено підтримку kmod, параметр cvf_format=xxx також керує завантаженням модуля CVF на вимогу. Цей параметр є застарілим.

source: Just like I<nfs>, the I<ncpfs> implementation expects a binary argument (a I<struct ncp_mount_data>) to the mount system call. This argument is constructed by B<ncpmount>(8) and the current version of B<mount> (2.12) does not know anything about ncpfs.
de: Wie bei I<nfs> erwartet die I<ncpfs>-Implementation ein binäres Argument (ein I<struct ncp_mount_data>) zum Systemaufruf »mount«. Dieses Argument wird von B<ncpmount>(8) konstruiert, aber die aktuelle Version von B<mount> (2.12) weiß nichts über Ncpfs.
fr: Tout comme I<nfs>, l'implémentation de I<ncpfs> nécessite un paramètre binaire (une structure I<ncp_mount_data>) lors de l'appel système. Cet argument est construit par B<ncpmount>(8) et la version actuelle de B<mount> (2.12) ne connaît rien en ce qui concerne I<ncpfs>.
pl: Tak jak przy I<nfs>, implementacja I<ncpfs> oczekuje binarnego argumentu (I<struct ncp_mount_data>) funkcji systemowej mount. Argument ten jest konstruowany przez B<ncpmount>(8), a bieżąca wersja B<mount> (2.12) nic nie wie o ncpfs.
uk: Як і I<nfs>, реалізація I<ncpfs> очікує двійкового аргументу (I<struct ncp_mount_data>) для системного виклику mount. Цей аргумент створено B<ncpmount>(8), а поточна версія B<mount> (2.12) нічого не знає про ncpfs.

source: This encoding format is identical to the encoding format file handles that are stored in extended attribute "{B<trusted>|B<user>}.overlay.origin". When decoding an overlay file handle, the following steps are followed
de: Dieses Kodierungsformat ist identisch zu dem Kodierungsformat von Datei-Handles, die im erweiterten Attribut »{B<trusted>|B<user>}.overlay.origin« gespeichert sind. Beim Dekodieren eines Überlagerungs-Datei-Handles werden die folgenden Schritte durchlaufen:
fr: Le format d'encodage est identique à celui des descripteurs de fichier qui sont stockés dans l'attribut étendu « {B<trusted>|B<user>}.overlay.origin ». Lors du décodage d'un descripteur de fichier overlay, les étapes suivantes doivent être franchies :
uk: Цей формат кодування є ідентичним до засобів обробки формату кодування, які збережено у розширеному атрибуті «{B<trusted>|B<user>}.overlay.origin». При декодуванні засобу обробки файла-накладки буде виконано наступні кроки

source: If a whiteout is found in index, return ESTALE. This represents an overlay object that was deleted after its file handle was encoded.
de: Falls ein Whiteout im Index gefunden wird, ESTALE zurückliefern. Dies stellt ein Überlagerungsobjekt dar, das gelöscht wurde, nachdem der Datei-Handle kodiert wurde.
fr: Si un whiteout est trouvé dans un index, renvoyer ESTALE. Cela représente un objet overlay qui a été supprimé après que son descripteur de fichier a été encodé.
uk: Якщо у покажчику буде виявлено білий привид (whiteout), повернути ESTALE. Білий привид — об'єкт накладки, який було вилучено після того, як його дескриптор файла було закодовано.

source: For filesystems created by OpenStep (currently read only). The same filesystem type is also used by Mac OS X.
de: für die von OpenStep erzeugten Dateisysteme (gegenwärtig nur lesbar). Der gleiche Dateisystemtyp wird auch von Mac OS X verwendet.
fr: Pour les systèmes de fichiers créés par OpenStep (lecture seule actuellement). Le même système de fichiers est aussi utilisé par Mac OS X.
pl: Do systemów plików utworzonych przez OpenStep (obecnie tylko do odczytu). Ten sam typ systemów plików jest również używany przez Mac OS X.
uk: Для файлових систем, які створено OpenStep (у поточній версії лише читання). Той самий тим файлової системи також використовує Mac OS X.

source: DM-VERITY SUPPORT (EXPERIMENTAL)
de: DM-VERITY-UNTERSTÜTZUNG (EXPERIMENTELL)
fr: GESTION DE DM-VERITY (EXPERIMENTAL)
uk: ПІДТРИМКА DM-VERITY (експериментальна)

source: The device-mapper verity target provides read-only transparent integrity checking of block devices using kernel crypto API. The B<mount> command can open the dm-verity device and do the integrity verification before on the device filesystem is mounted. Requires libcryptsetup with in libmount (optionally via B<dlopen>(3)). If libcryptsetup supports extracting the root hash of an already mounted device, existing devices will be automatically reused in case of a match. Mount options for dm-verity:
de: Das Verity-Ziel von Device-Mapper stellt eine nur lesbare, transparente Integritätsprüfung von Blockgeräten mittels des Kernel-Krypto-APIs bereit. Der Befehl B<mount> kann das dm-verity-Gerät öffnen und die Integritätsüberprüfung durchführen, bevor das Dateisystem auf dem Gerät geöffnet wird. Benötigt libcryptsetup innerhalb von libmount (optional über B<dlopen>(3)). Falls libcryptsetup das Auslesen des Wurzel-Hashes von bereits eingehängten Geräten unterstützt, werden bestehende Geräte automatisch erneut verwandt, falls ein Treffer erfolgt. Einhängeoptionen für dm-verity sind:
fr: La cible de la carte de périphérique I<verity> (device-mapper verity) fournit une vérification transparente d’intégrité en lecture seule de périphériques par blocs en utilisant l’API de chiffrement du noyau. La commande de montage peut ouvrir le périphérique dm-verity et réaliser la vérification d’intégrité avant que le système de fichiers du périphérique ne soit monté. B<libcryptsetup> avec B<libmount> est requis (de manière facultative à l’aide de B<dlopen>). Si B<libcryptsetup> gère l’extraction du hachage de la racine d’un périphérique déjà monté, les périphériques existants seront automatiquement réutilisés en cas de correspondance. Les options de montage pour dm-verity sont les suivantes.
uk: Ціль device-mapper verity надає доступ до читання із прозорою перевіркою цілісності даних блокових пристроїв з використанням шифрувального програмного інтерфейсу ядра системи. Програма B<mount> здатна відкривати пристрої dm-verity і виконувати перевірку цілісності даних до монтування файлової системи пристрою. Потребує libcryptsetup у libmount (можна з використанням B<dlopen>(3)). Якщо у libcryptsetup передбачено підтримку видобування хеш-суми кореня вже змонтованого пристрою, наявні пристрої, якщо вони є відповідними, буде використано автоматично. Параметри монтування dm-verity:

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA
uk: КОРОТКИЙ ОПИС

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS
uk: ОПИС

source: B<mount> [B<-l>] [B<-t> I<type>]
de: B<mount> [B<-l>] [B<-t> I<Typ>]
pl: B<mount> [B<-l>] [B<-t> I<typ>]
uk: B<mount> [B<-l>] [B<-t> I<тип>]

source: ID=I<id>
de: ID=I<Kennung>
uk: ID=I<ідентифікатор>

source: B<--options-mode> I<mode>
de: B<--options-mode> I<Modus>
pl: B<--options-mode> I<tryb>
uk: B<--options-mode> I<режим>

source: B<--options-source> I<source>
de: B<--options-source> I<Quelle>
pl: B<--options-source> I<źródło>
uk: B<--options-source> I<джерело>

source: B<X-mount.mkdir>[=I<mode>]
de: B<X-mount.mkdir>[=I<Modus>]
pl: B<X-mount.mkdir>[=I<tryb>]
uk: B<X-mount.mkdir>[=I<режим>]

source: B<conv=>I<mode>
de: B<conv=>I<Modus>
pl: B<conv=>I<tryb>
uk: B<conv=>I<режим>

source: B<cvf_format=>I<module>
de: B<cvf_format=>I<Modul>
pl: B<cvf_format=>I<moduł>
uk: B<cvf_format=>I<модуль>

source: B<cvf_option=>I<option>
pl: B<cvf_option=>I<opcja>
uk: B<cvf_option=>I<параметр>

source: B<time_offset=>I<minutes>
de: B<time_offset=>I<Minuten>
pl: B<time_offset=>I<minuty>
uk: B<time_offset=>I<хвилини>

source: In order to avoid a giving a false sense of safety, the syncfs (and fsync) semantics of volatile mounts are slightly different than that of the rest of VFS. If any writeback error occurs on the upperdir’s filesystem after a volatile mount takes place, all sync functions will return an error. Once this condition is reached, the filesystem will not recover, and every subsequent sync call will return an error, even if the upperdir has not experience a new error since the last sync call.
de: Um kein falsches Sicherheitsgefühl zu geben, unterscheidet sich die syncfs- (und fsync-) Semantik flüchtiger Einhängungen geringfügig von der des restlichen VFS. Wenn ein Rückschreibefehler im Dateisystem des oberen Verzeichnisses auftritt, nachdem eine flüchtige Einhängung stattgefunden hat, geben alle Sync-Funktionen einen Fehler zurück. Sobald diese Bedingung erreicht ist, wird das Dateisystem nicht wiederhergestellt, und jeder nachfolgende Sync-Aufruf wird einen Fehler zurückgeben, selbst wenn das obere Verzeichnis seit dem letzten Sync-Aufruf keinen neuen Fehler verursacht hat.
uk: Щоб уникнути фальшивого відчуття безпеки, семантика syncfs (і fsync) тимчасових монтувань є дещо відмінною від використаної у решті VFS. Якщо у вищій файловій системі станеться будь-яка помилка зворотного запису після тимчасового монтування, усі функції синхронізації повернуть помилку. Щойно буде досягнуто цього стану, файлова система не відновиться, а будь-який наступний виклик синхронізації поверне помилку, навіть якщо вищий каталог не матиме нових помилок з часу останнього виклику синхронізації.

source: B<shortname=>I<mode>
de: B<shortname=>I<Modus>
pl: B<shortname=>I<tryb>
uk: B<shortname=>I<режим>

source: B<verity.roothash=>I<hex>
uk: B<verity.roothash=>I<шістнадцяткове_число>

source: B<mount >[B<-l>] [B<-t >I<type\/>]
de: B<mount >[B<-l>] [B<-t >I<Typ\/>]
pl: B<mount >[B<-l>] [B<-t >I<typ\/>]
uk: B<mount >[B<-l>] [B<-t >I<тип\/>]

source: B<--options-mode >I<mode>
de: B<--options-mode >I<Modus>
pl: B<--options-mode >I<tryb>
uk: B<--options-mode >I<режим>

source: B<--options-source >I<source>
de: B<--options-source >I<Quelle>
uk: B<--options-source >I<джерело>

source: B<verity.roothash=>\,I<hex>
uk: B<verity.roothash=>\,I<шістнадцяткове_число>

source: Human readable partition identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations. It\(cqs supported for example for GUID Partition Tables (GPT).
uk: Зручний для читання ідентифікатор розділу. Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: Partition universally unique identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations. It\(cqs supported for example for GUID Partition Tables (GPT).
uk: Універсальний унікальний ідентифікатор розділу. Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: Allow to make a target directory (mountpoint) if it does not exist yet. The optional argument I<mode> specifies the filesystem access mode used for B<mkdir>(2) in octal notation. The default mode is 0755. This functionality is supported only for root users or when mount executed without suid permissions. The option is also supported as x-mount.mkdir, but this notation is deprecated since v2.30. See also B<--mkdir> command line option.
uk: Дозволити створення каталогу призначення (точки монтування), якщо його ще не існує. Додатковий аргумент I<режим> визначає режим доступу до файлової системи, який буде використано у B<mkdir>(2), у вісімковій формі запису. Типовим режимом є 0755. Підтримку цієї функціональної можливості передбачено лише для користувача root або запуску mount без прав доступу suid. Підтримку цього параметра також передбачено у формі x-mount.mkdir, але ця форма вважається застарілою з версії 2.30. Див. також параметр рядка команди B<--mkdir>.

source: B<modprobe -v>I< somefs>
de: B<modprobe -v>I< einDS>
uk: B<modprobe -v>I< якась_файлова_система>
