Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Defines the behavior for creation and display of filenames which fit into 8.3 characters. If a long name for a file exists, it will always be the preferred one for display. There are four I<mode>s:
de: definiert das Verhalten beim Erzeugen und Anzeigen von Dateinamen im 8.3-Schema. Falls ein Langname für eine Datei existiert, wird dieser für die Anzeige stets bevorzugt. Es gibt vier I<Modi>:
fr: Définir le comportement pour la création et l'affichage des noms de fichiers qui tiennent dans I<8.3> (1 à 8 caractères, un point et 0 à 3 caractères). Le nom long du fichier sera toujours le préféré pour l’affichage s'il existe. Il y a quatre I<mode>s.
pl: Definiuje zachowanie w przypadku tworzenia i wyświetlania nazw plików mieszczących się w schemacie 8.3 znaków. Jeśli istnieje długa nazwa pliku, będzie zawsze preferowanym sposobem wyświetlania. Istnieją cztery I<tryb>y:
uk: Визначає поведінку при створенні і показу назв файлів, які відповідають критерію «8.3 символів». Якщо існує довга назва файла, перевагу при показі буде завжди віддано цій назві. Передбачено чотири I<режим>и:

source: Display the short name as is; store a long name when the short name is not all upper case. This mode is the default since Linux 2.6.32.
de: zeigt den Kurznamen an, so wie er ist; speichert einen Langnamen, wenn der Kurzname nicht komplett in Großbuchstaben geschrieben ist. Dieser Modus ist das Standardverhalten seit Linux 2.6.32.
fr: Afficher le nom court tel qu'il est ; enregistrer un nom long quand le nom court n'est pas entièrement en majuscules. C'est le mode par défaut depuis Linux 2.6.32.
pl: Wyświetla krótką nazwę bez zmian; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie. Ten tryb jest domyślny od Linuksa 2.6.32.
uk: Показувати коротку назву без змін; зберігати довгу назву, якщо не усі символи короткої назви є літерами верхнього регістру. Цей режим є типовим, починаючи з Linux 2.6.32.

source: B<devuid=>\,I<uid> and B<devgid=>\,I<gid> and B<devmode=>\,I<mode>
de: B<devuid=>\,I<UID> und B<devgid=>\,I<GID> und B<devmode=>\,I<Modus>
fr: B<devuid=>\,I<uid>, B<devgid=>\,I<gid> et B<devmode=>\,I<mode>.
pl: B<devuid=>\,I<uid> i B<devgid=>\,I<gid> i B<devmode=>\,I<tryb>
uk: B<devuid=>\,I<uid> і B<devgid=>\,I<gid>, і B<devmode=>\,I<режим>

source: Set the owner and group and mode of the device files in the usbfs filesystem (default: uid=gid=0, mode=0644). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der Gerätedateien im Usbfs-Dateisystem (Standard: UID=GID=0, Modus=0644). Der Modus wird in oktaler Notation angegeben.
fr: Définir le propriétaire, le groupe et le mode des fichiers de périphérique dans le système de fichiers usbfs (valeurs par défaut : B<uid=gid=0>, B<mode=0644>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb plików w plikach urządzeń systemu plików usbfs (domyślnie: uid=gid=0, mode=0644). Tryb jest podany ósemkowo.
uk: Встановити власника і групу файлів пристроїв у файловій системі usbfs (типові значення: uid=gid=0, mode=0644). Режим слід вказувати у вісімковій формі.

source: B<busuid=>\,I<uid> and B<busgid=>\,I<gid> and B<busmode=>\,I<mode>
de: B<busuid=>\,I<UID> und B<busgid=>\,I<GID> und B<busmode=>\,I<Modus>
fr: B<busuid=>\,I<uid>, B<busgid=>\,I<gid> et B<busmode=>\,I<mode>
pl: B<busuid=>\,I<uid> i B<busgid=>\,I<gid> i B<busmode=>\,I<tryb>
uk: B<busuid=>\,I<uid> і B<busgid=>\,I<gid>, і B<busmode=>\,I<режим>

source: Set the owner and group and mode of the bus directories in the usbfs filesystem (default: uid=gid=0, mode=0555). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der Bus-Verzeichnisse im Usbfs-Dateisystem (Standard: UID=GID=0, Modus=0555). Der Modus wird in oktaler Notation angegeben.
fr: Définir le propriétaire, le groupe et le mode des répertoires des bus dans le système de fichiers usbfs (valeurs par défaut : B<uid=gid=0>, B<mode=0555>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb plików w katalogach szyny (bus) systemu plików usbfs (domyślnie: uid=gid=0, mode=0555). Tryb podany jest ósemkowo.
uk: Встановити власника і групу каталогів шин у файловій системі usbfs (типові значення: uid=gid=0, mode=0555). Режим слід вказувати у вісімковій формі.

source: B<listuid=>\,I<uid> and B<listgid=>\,I<gid> and B<listmode=>\,I<mode>
de: B<listuid=>\,I<UID> und B<listgid=>\,I<GID> und B<listmode=>\,I<Modus>
fr: B<listuid=>\,I<uid>, B<listgid=>\,I<gid> et B<listmode=>\,I<mode>.
pl: B<listuid=>\,I<uid> i B<listgid=>\,I<gid> i B<listmode=>\,I<tryb>
uk: B<listuid=>\,I<uid> і B<listgid=>\,I<gid>, і B<listmode=>\,I<режим>

source: Set the owner and group and mode of the file I<devices> (default: uid=gid=0, mode=0444). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der I<Gerät>-Dateien (Standard: UID=GID=0, Modus=0444). Der Modus wird in oktaler Notation angegeben.
fr: Configurer le propriétaire, le groupe et le mode du fichier I<devices> (valeurs par défaut : B<uid=gid=0>, B<mode=0444>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb pliku I<devices> (domyślnie: uid=gid=0, mode=0444). Tryb jest podany ósemkowo.
uk: Встановити власника і групу, а також режим файлових I<пристроїв> (типові значення: uid=gid=0, mode=0444). Режим слід вказувати у вісімковій формі.

source: DM-VERITY SUPPORT (experimental)
de: DM-VERITY-UNTERSTÜTZUNG (experimentell)
fr: GESTION DE DM-VERITY (expérimental)
uk: ПІДТРИМКА DM-VERITY (експериментальна)

source: The device-mapper verity target provides read-only transparent integrity checking of block devices using kernel crypto API. The B<mount> command can open the dm-verity device and do the integrity verification before on the device filesystem is mounted. Requires libcryptsetup with in libmount (optionally via dlopen). If libcryptsetup supports extracting the root hash of an already mounted device, existing devices will be automatically reused in case of a match. Mount options for dm-verity:
de: Das Verity-Ziel von Device-Mapper stellt eine nur lesbare, transparente Integritätsprüfung von Blockgeräten mittels des Kernel-Krypto-APIs bereit. Der Befehl B<mount> kann das dm-verity-Gerät öffnen und die Integritätsüberprüfung durchführen, bevor das Dateisystem auf dem Gerät geöffnet wird. Benötigt libcryptsetup innerhalb von libmount (optional über B<dlopen>(3)). Falls libcryptsetup das Auslesen des Wurzel-Hashes von bereits eingehängten Geräten unterstützt, werden bestehende Geräte automatisch erneut verwandt, falls ein Treffer erfolgt. Einhängeoptionen für dm-verity sind:
fr: La cible de la carte de périphérique I<verity> (device-mapper verity) fournit une vérification transparente d’intégrité en lecture seule de périphériques par blocs en utilisant l’API de chiffrement du noyau. La commande de montage peut ouvrir le périphérique dm-verity et réaliser la vérification d’intégrité avant que le système de fichiers du périphérique ne soit monté. B<libcryptsetup> avec B<libmount> est requis (de manière facultative à l’aide de dlopen). Si B<libcryptsetup> gère l’extraction du hachage de la racine d’un périphérique déjà monté, les périphériques existants seront automatiquement réutilisés en cas de correspondance. Les options de montage pour dm-verity sont les suivantes.
uk: Ціль device-mapper verity надає доступ до читання із прозорою перевіркою цілісності даних блокових пристроїв з використанням шифрувального програмного інтерфейсу ядра системи. Програма B<mount> здатна відкривати пристрої dm-verity і виконувати перевірку цілісності даних до монтування файлової системи пристрою. Потребує libcryptsetup у libmount (можна з використанням dlopen). Якщо у libcryptsetup передбачено підтримку видобування хеш-суми кореня вже змонтованого пристрою, наявні пристрої, якщо вони є відповідними, буде використано автоматично. Параметри монтування dm-verity:

source: B<verity.hashdevice=>\,I<path>
de: B<verity.hashdevice=>\,I<Pfad>
fr: B<verity.hashdevice=>\,I<chemin>
pl: B<verity.hashdevice=>\,I<ścieżka>
uk: B<verity.hashdevice=>\,I<шлях>

source: Hex-encoded hash of the root of I<verity.hashdevice> Mutually exclusive with I<verity.roothashfile.>
de: Hexadezimal kodierter Hash der Wurzel von I<verity.hashdevice>. Schließt sich gegenseitig mit I<verity.roothashfile> aus.
fr: Hachage encodé en hexadécimal de la racine de I<verity.hashdevice>, mutuellement exclusif avec I<verity.roothashfile>.
uk: Хеш кореня I<verityhashdevice> у шістнадцятковому кодуванні. Є взаємно виключним із I<verity.roothashfile.>

source: B<verity.roothashfile=>\,I<path>
de: B<verity.roothashfile=>\,I<Pfad>
fr: B<verity.roothashfile=>\,I<chemin>
pl: B<verity.roothashfile=>\,I<ścieżka>
uk: B<verity.roothashfile=>\,I<шлях>

source: B<verity.hashoffset=>\,I<offset>
de: B<verity.hashoffset=>\,I<Versatz>
fr: B<verity.hashoffset=>\,I<décalage>
pl: B<verity.hashoffset=>\,I<ofset>
uk: B<verity.hashoffset=>\,I<відступ>

source: B<verity.fecdevice=>\,I<path>
de: B<verity.fecdevice=>\,I<Pfad>
fr: B<verity.fecdevice=>\,I<chemin>
pl: B<verity.fecdevice=>\,I<ścieżka>
uk: B<verity.fecdevice=>\,I<шлях>

source: Path to the Forward Error Correction (FEC) device associated with the source volume to pass to dm-verity. Optional. Requires kernel built with CONFIG_DM_VERITY_FEC.
de: Pfad zum Vorwärtsfehlerkorrektur (FEC)-Gerät, das dem Quelldatenträger zugeordnet ist und an dm-verity übergeben werden soll. Optional. Benötigt einen mit CONFIG_DM_VERITY_FEC gebauten Kernel.
fr: I<chemin> vers le périphérique FEC (Forward Error Correction) associé avec le volume source à indiquer à dm-verity. Facultatif et nécessite que le noyau soit construit avec CONFIG_DM_VERITY_FEC.
uk: Шлях до пристрою Forward Error Correction (FEC), який пов'язано із початковим томом, який слід передати dm-verity. Не обов'язковий. Потребує ядра, яке зібрано з CONFIG_DM_VERITY_FEC.

source: B<verity.fecoffset=>\,I<offset>
de: B<verity.fecoffset=>\,I<Versatz>
fr: B<verity.fecoffset=>\,I<décalage>
pl: B<verity.fecoffset=>\,I<ofset>
uk: B<verity.fecoffset=>\,I<відступ>

source: B<verity.fecroots=>\,I<value>
de: B<verity.fecroots=>\,I<Wert>
fr: B<verity.fecroots=>\,I<valeur>
pl: B<verity.fecroots=>\,I<wartość>
uk: B<verity.fecroots=>\,I<значення>

source: B<verity.roothashsig=>\,I<path>
de: B<verity.roothashsig=>\,I<Pfad>
fr: B<verity.roothashsig=>\,I<chemin>
pl: B<verity.roothashsig=>\,I<ścieżka>
uk: B<verity.roothashsig=>\,I<шлях>

source: Path to pkcs7 signature of root hash hex string. Requires crypt_activate_by_signed_key() from cryptsetup and kernel built with CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG. For device reuse, signatures have to be either used by all mounts of a device or by none. Optional.
de: Pfad zur PKCS7-Signatur der Wurzel-Hash-Zeichenkette (hexadezimal). Benötigt crypt_activate_by_signed_key() von Cryptsetup und einen mit CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG gebauten Kernel. Zur Wiederverwendung von Geräten müssen Signaturen entweder von allen Einhängungen oder keiner verwendet werden. Dies ist optional.
fr: Chemin pour la signature pkcs7 de la chaîne hexadécimale du hachage de la racine. Cela nécessite B<crypt_activate_by_signed_key>() de B<cryptsetup> et le noyau construit avec B<CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG>. Pour une réutilisation du périphérique, les signatures doivent être, soit utilisées par tous les montages d’un périphérique, soit par aucun. Facultatif.
uk: Шлях до підпису pkcs7 шістнадцяткового рядка хеш-суми кореня файлової системи Потребує crypt_activate_by_signed_key() з cryptsetup і ядра, яке зібрано із CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG. Для повторного використання пристрою підписи має бути або використано усіма монтуваннями пристрою, або не використано жодним. Необов'язковий.

source: create squashfs image from /etc directory, verity hash device and mount verified filesystem image to /mnt. The kernel will verify that the root hash is signed by a key from the kernel keyring if roothashsig is used.
de: ein Squashfs-Abbild aus dem Verzeichnis /etc, überprüfen die Integrität des Hash-Gerätes und hängen das überprüfte Dateisystem-Abbild in /mnt ein. Falls »roothashsig« verwendet wird, dann wird der Kernel überprüfen, ob der Root-Hash mit einem Schlüssel aus dem Kernel-Schlüsselbund signiert ist.
fr: créent une image squashfs du répertoire I</etc>, valident (verity) le périphérique I<hash> et montent l’image vérifiée du système de fichiers sur I</mnt>. Le noyau vérifiera que le hachage de la racine est signé par une clé du trousseau de clés du noyau si roothashsig est utilisé.
uk: створять образ squashfs з каталогу /etc, пристрій хешів істинності та змонтують перевірений образ файлової системи до /mnt. Ядро перевірить, чи кореневий хеш підписано ключем зі сховища ключів ядра, якщо використано roothashsig.

source: One further possible type is a mount via the loop device. For example, the command
de: Ein weiterer Typ ist das Einhängen per Loop-Gerät. Zum Beispiel richtet der Befehl
fr: Il est possible de faire un montage au travers du périphérique boucle (« loop »). Par exemple, la commande :
pl: Kolejnym możliwym typem jest montowanie poprzez urządzenie loop. Na przykład, polecenie
uk: Одним із подальших можливих типів є монтування через петльовий пристрій. Наприклад, команда

source: If no explicit loop device is mentioned (but just an option `B<-o loop>' is given), then B<mount> will try to find some unused loop device and use that, for example
de: Wenn kein Loop-Gerät explizit angegeben ist (sondern nur eine Option B<-o loop>), dann wird B<mount> versuchen, ungenutzte Loop-Geräte zu finden und diese zu verwenden, zum Beispiel
fr: Si aucun périphérique boucle n'est explicitement mentionné (mais qu'une simple option « B<-o loop> » est donnée), alors B<mount> essayera de trouver des périphériques boucle non utilisés et les utilisera, par exemple :
pl: Jeśli nie podano jawnie urządzenia loop (tylko opcję B<-o loop>), to B<mount> spróbuje znaleźć jakieś nieużywane urządzenie loop i użyć je, na przykład
uk: Якщо петльовий пристрій не вказано явним чином (а задано лише параметр «B<-o loop>), B<mount> спробує знайти невикористаний петльовий пристрій і скористатися ним. Приклад

source: This type of mount knows about three options, namely B<loop>, B<offset> and B<sizelimit>, that are really options to B<\%losetup>(8). (These options can be used in addition to those specific to the filesystem type.)
de: Dieser Einhängetyp kennt drei Optionen, B<loop>, B<offset> und B<sizelimit>, welche tatsächliche Optionen für B<\%losetup>(8) sind (diese Optionen können zusätzlich zu den dateisystemspezifischen Optionen verwendet werden).
fr: Ce type de montage dispose de trois options, nommées B<loop>, B<offset> et B<sizelimit>, qui sont en réalité des options pour B<\%losetup>(8) (ces options peuvent être utilisées en plus de celles spécifiques au type de système de fichiers).
pl: Ten typ montowań zna trzy opcje, B<loop>, B<offset> i B<sizelimit>, które są tak naprawdę opcjami do B<\%losetup>(8) (opcje te mogą być używane oprócz opcji specyficznych dla danego systemu plików).
uk: Для цього типу монтування передбачено три параметри, а саме, B<loop>, B<offset> і B<sizelimit>, які насправді є параметрами B<\%losetup>(8). (Ці параметри можна використати для доповнення специфічних для типу файлової системи параметрів.)

source: You can also free a loop device by hand, using B<losetup -d >orB< umount -d>.
de: Sie können ein Loop-Gerät auch manuell mittels B<losetup -d >oderB< umount -d> freigeben.
fr: Vous pouvez aussi libérer un périphérique boucle manuellement avec B<losetup -d> ou B<umount -d>.
pl: Można również zwolnić urządzenie loop ręcznie, przy użyciu B<losetup -d> lub B<umount -d>.
uk: Петльовий пристрій також можна вивільнити вручну, скориставшись B<losetup -d >абоB< umount -d>.

source: problems writing or locking /etc/mtab
de: Probleme beim Schreiben oder Sperren der Datei /etc/mtab
fr: problèmes d'écriture ou de verrouillage de I</etc/mtab>
pl: problemy podczas zapisu lub blokowania /etc/mtab
uk: проблеми із записуванням або блокуванням /etc/mtab

source: where the I<suffix> is the filesystem type and the B<-sfnvoN> options have the same meaning as the normal mount options. The B<-t> option is used for filesystems with subtypes support (for example B</sbin/mount.fuse -t fuse.sshfs>).
de: wobei I<Suffix> den Dateisystemtyp bezeichnet und die Optionen B<-sfnvoN> die gleiche Bedeutung wie bei normalen Einhängeoptionen haben. Die Option B<-t> wird für Dateisysteme verwendet, die Subtypen unterstützen (zum Beispiel B</sbin/mount.fuse -t fuse.sshfs>).
fr: où le I<suffixe> est le type de système de fichiers et les options B<-sfnvoN> ont la même signification que les options de montage normales. L'option B<-t> est utilisée pour les systèmes de fichiers avec prise en charge des sous-types (par exemple I</sbin/mount.fuse -t fuse.sshfs>).
pl: gdzie I<typ> jest typem systemu plików, a opcje B<-sfnvoN> mają to samo znaczenie, co standardowe opcje mount. Opcja B<-t> jest używana do systemów plików z obsługa podtypów (np. B</sbin/mount.fuse -t fuse.sshfs>).
uk: де I<суфікс> - це тип файлової системи, а параметри B<-sfnvoN> мають таке ж значення, що й звичайні параметри монтування. Параметр B<-t> використовується для файлових систем із підтримкою підтипів (наприклад, B</sbin/mount.fuse -t fuse.sshfs>).

source: The command B<mount> does not pass the mount options B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x-*>, B<loop>, B<offset> and B<sizelimit> to the mount.E<lt>suffixE<gt> helpers. All other options are used in a comma-separated list as an argument to the B<-o> option.
de: Der Befehl B<mount> übergibt die Einhängeoptionen B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x-*>, B<loop>, B<offset> und B<sizelimit> nicht an die Hilfsprogramme mount.E<lt>suffixE<gt>. Alle anderen Optionen werden in einer durch Kommata getrennten Liste als Argument der Option B<-o> verwendet.
fr: La commande B<mount> ne passe pas les options de montage B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->I<*>, B<loop>, B<offset> ni B<sizelimit> aux auxiliaires B<mount.>I<suffixe>. Toutes les autres options sont utilisées dans une liste séparée par des virgules comme argument de l’option B<-o>.
pl: Polecenie B<mount> nie przekazuje opcji montowania B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x-*>, B<loop>, B<offset>, ani B<sizelimit> do programów pomocniczych mount.E<lt>przyrostekE<gt>. Wszystkie inne opcje są w postaci listy (rozdzielonej przecinkami) przekazanej jako argument do opcji B<-o>.
uk: Команда B<mount> не передає параметрів монтування B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->*, B<loop>, B<offset> і B<sizelimit> допоміжним засобам mount.E<lt>суфіксE<gt>. Усі інші параметри використовуються в списку, розділеному комами, як аргумент для параметра B<-o>.

source: LIBMOUNT_FSTAB=E<lt>pathE<gt>
de: LIBMOUNT_FSTAB=E<lt>PfadE<gt>
fr: B<LIBMOUNT_FSTAB=>I<chemin>
pl: LIBMOUNT_FSTAB=E<lt>ścieżkaE<gt>
uk: LIBMOUNT_FSTAB=E<lt>шляхE<gt>

source: LIBMOUNT_MTAB=E<lt>pathE<gt>
de: LIBMOUNT_MTAB=E<lt>PfadE<gt>
fr: B<LIBMOUNT_MTAB=>I<chemin>
pl: LIBMOUNT_MTAB=E<lt>ścieżkaE<gt>
uk: LIBMOUNT_MTAB=E<lt>шляхE<gt>

source: LIBMOUNT_DEBUG=all
fr: B<LIBMOUNT_DEBUG=>I<all>

source: Some Linux filesystems don't support B<-o sync >andB< -o dirsync> (the ext2, ext3, ext4, fat and vfat filesystems I<do> support synchronous updates (a la BSD) when mounted with the B<sync> option).
de: Einige Linux-Dateisysteme unterstützen weder B<-o sync >nochB< -o dirsync> (die Dateisysteme Ext2, Ext3, FAT und VFAT I<unterstützen> synchrone Aktualisierungen - wie BSD - wenn sie mit der Option B<sync> eingehängt werden).
fr: Sous Linux, certains systèmes de fichiers ne gèrent pas B<-o sync> et B<-o dirsync> (les systèmes de fichiers I<ext2>, I<ext3>, I<ext4>, I<fat> et I<vfat> I<gèrent> les mises à jour synchrones, à la manière BSD, lorsqu'ils sont montés avec l'option B<sync>).
uk: Деякі файлові системи Linux не підтримують B<-o sync >іB< -o dirsync> (файлові системи ext2, ext3, ext4, fat і vfat I<підтримують> синхронні оновлення (як у BSD), якщо їх змонтовано з параметром B<sync>).

source: The B<-o remount> may not be able to change mount parameters (all I<ext2fs>-specific parameters, except B<sb>, are changeable with a remount, for example, but you can't change B<gid> or B<umask> for the I<fatfs>).
de: Die Option B<-o remount> könnte nicht in der Lage sein, Einhängeparameter zu ändern (alle I<ext2fs>-spezifischen Parameter außer B<sb> können durch erneutes Einhängen geändert werden, beispielsweise können Sie B<gid> oder B<umask> für I<fatfs> nicht ändern).
fr: L'option B<-o remount> peut s'avérer incapable de modifier les paramètres de montage (tous ceux de I<ext2fs>, sauf B<sb>, sont modifiables lors d'un remontage, mais vous ne pouvez pas modifier le B<gid> ou l'B<umask> pour un système de fichiers I<fatfs>).
pl: Opcja B<-o remount> może nie być w stanie zmienić parametrów montowania (np. wszystkie parametry I<ext2fs>, poza B<sb>, dają się zmieniać przy ponownym montowaniu, lecz nie można zmienić B<gid> czy B<umask> dla I<fatfs>).
uk: B<-o remount> може бути не в змозі змінити параметри монтування (всі специфічні для I<ext2fs> параметри, крім B<sb>, можна змінити за допомогою перемонтування, наприклад, але не можна змінити B<gid> або B<umask> для I<fatfs>).
