Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: This sets the owner or the group of newly created pseudo terminals to the specified values. When nothing is specified, they will be set to the UID and GID of the creating process. For example, if there is a tty group with GID 5, then B<gid=5> will cause newly created pseudo terminals to belong to the tty group.
de: setzt den Eigentümer oder die Gruppe neu erstellter Pseudo-Terminals auf die angegebenen Werte. Wenn nichts angegeben ist, werden die Werte auf die UID und GID des erstellenden Prozesses gesetzt. Wenn es beispielsweise eine TTY-Gruppe mit der GID 5 gibt, dann sorgt B<gid=5> dafür, dass neu erstellte Pseudo-Terminals zu der TTY-Gruppe gehören.
fr: Définir le propriétaire et le groupe des pseudoterminaux nouvellement créés. Lorsque rien n'est indiqué, ils seront fixés avec l'UID et le GID du processus créateur. Par exemple, si un groupe tty de GID 5 est présent, alors B<gid=5> fera appartenir les pseudoterminaux nouvellement créés au groupe tty.
pl: Ustawia właściciela lub grupę nowotworzonych PTY według zadanych wartości. Jeśli nie podano żadnych, to zostaną nadane UID i GID procesu tworzącego. Na przykład, jeśli mamy grupę tty o GID=5, to B<gid=5> spowoduje, że nowo tworzone PTY będą należeć do grupy tty.
uk: Встановлює власника або групу створених псевдотерміналів у вказані значення. Якщо значень не вказано, для власника і групи буде використано значення UID і GID процесу, який створив псевдотермінал. Наприклад, якщо є група tty з GID 5, B<gid=5> призведе до того, що створені псевдотермінали належатимуть цій групі tty.

source: Set the mode of newly created pseudo terminals to the specified value. The default is 0600. A value of B<mode=620> and B<gid=5> makes "mesg y" the default on newly created pseudo terminals.
de: setzt den Modus neu erstellter Pseudo-Terminals auf den angegebenen Wert. Die Vorgabe ist 0600. Ein Wert von B<mode=620> und B<gid=5> macht »mesg y« zur Vorgabe auf neu erstellten Pseudo-Terminals.
fr: Définir le mode des pseudoterminaux nouvellement créés. La valeur par défaut est 0600. Une valeur B<mode=620> et B<gid=5> correspond à un « mesg y » pour tous les pseudoterminaux nouvellement créés.
pl: Nadaje trybowi nowo tworzonych PTY zadaną wartość. Domyślnie jest to 0600. Wartość B<mode=620> i B<gid=5> powoduje, że dla nowo utworzonych PTY będzie domyślnie "mesg y".
uk: Встановити для режиму доступу до створених псевдотерміналів вказане значення. Типовим є значення 0600. Значення B<mode=620> і B<gid=5> зробить «mesg y» типовим для нових псевдотерміналів.

source: All mounts of devpts without this B<newinstance> option share the same set of pseudo terminal indices (i.e., legacy mode). Each mount of devpts with the B<newinstance> option has a private set of pseudo terminal indices.
de: Allen Devpts-Einhängungen ohne diese B<newinstance>-Option sind die gleichen Pseudo-Terminal-Indizes gemein (d.h. alter Modus). Jede Einhängung von Devpts mit der Option B<newinstance> hat eine private Gruppe von Pseudo-Terminal-Indizes.
fr: Tous les montages de devpts sans l'option B<newinstance> partagent le même ensemble d'index de pseudoterminaux (mode legacy). Chaque montage de devpts avec l'option B<newinstance> utilise un ensemble privé d'index de pseudoterminaux.
pl: Wszystkie montowania devpts bez opcji B<newinstance> współdzielą ten sam zestaw wskaźników pty (np. tryb legacy). Każde zamontowanie devpts z opcją B<newinstance> tworzy prywatny zestaw wskaźników pty.
uk: Усі монтування devpts без цього параметра B<newinstance> матимуть спільний набір індексів псевдотерміналів (тобто працюватимуть у застарілому режимі). Кожне монтування devpts з параметром B<newinstance> матиме власний набір індексів псевдотерміналів.

source: This option is mainly used to support containers in the Linux kernel. It is implemented in Linux kernel versions starting with 2.6.29. Further, this mount option is valid only if CONFIG_DEVPTS_MULTIPLE_INSTANCES is enabled in the kernel configuration.
de: Diese Option wird hauptsächlich zur Unterstützung von Containern im Linux-Kernel genutzt. Sie ist in Kernelversionen ab 2.6.29 implementiert. Weiterhin ist diese Einhängeoption nur dann zulässig, wenn CONFIG_DEVPTS_MULTIPLE_INSTANCES in der Kernel-Konfiguration aktiviert ist.
fr: Cette option est principalement utilisée pour gérer les conteneurs dans le noyau Linux. Elle est implémentée dans le noyau Linux depuis la version 2.6.29. De plus, cette option de montage n'est valable que si l'option CONFIG_DEVPTS_MULTIPLE_INSTANCES est activée dans la configuration du noyau.
pl: Opcja jest używana głównie do obsługi kontenerów, w jądrze Linux, od wersji 2.6.29. Co więcej, ta opcja jest poprawna jedynie, jeśli w konfiguracji jądra włączono CONFIG_DEVPTS_MULTIPLE_INSTANCES.
uk: Цей параметр, в основному, призначено для забезпечення підтримки контейнерів у ядрі Linux. Його реалізовано у ядрах Linux, починаючи з версії 2.6.29. Крім того, цей параметр монтування є чинним, лише якщо у налаштуваннях ядра увімкнено CONFIG_DEVPTS_MULTIPLE_INSTANCES.

source: To use this option effectively, I</dev/ptmx> must be a symbolic link to I<pts/ptmx>. See I<Documentation/filesystems/devpts.txt> in the Linux kernel source tree for details.
de: Um diese Option effektiv zu nutzen, muss I</dev/ptmx> ein symbolischer Link auf I<pts/ptmx> sein. Siehe I<Documentation/filesystems/devpts.txt> im Kernel-Quellbaum für Details.
fr: Pour utiliser cette option efficacement, I</dev/ptmx> doit être un lien symbolique vers I<pts/ptmx>. Consultez I<Documentation/filesystems/devpts.txt> dans les sources du noyau Linux pour plus de précisions.
pl: Aby użyć tej opcji w sposób efektywny, I</dev/ptmx> musi być dowiązaniem symbolicznym do I<pts/ptmx>. Proszę zapoznać się z plikiem I<Documentation/filesystems/devpts.txt> w kodzie źródłowym jądra Linux, aby dowiedzieć się więcej.
uk: Щоб ефективно скористатися цим параметром, I</dev/ptmx> має бути символічним посиланням на I<pts/ptmx>. Див. I<Documentation/filesystems/devpts.txt> у ієрархії початкового коду ядра Linux, щоб дізнатися більше.

source: For compatibility with older versions of the kernel, the default mode of the new I<ptmx> node is 0000. B<ptmxmode=>I<value> specifies a more useful mode for the I<ptmx> node and is highly recommended when the B<newinstance> option is specified.
de: Für die Kompatibilität zu älteren Kernelversionen ist 0000 der Standardmodus des neuen I<ptmx>-Knotens. B<ptmxmode=>I<Wert> gibt einen sinnvolleren Modus für den I<ptmx>-Knoten an und wird ausdrücklich empfohlen, wenn die Option B<newinstance> angegeben wird.
fr: Pour être compatible avec les anciennes versions du noyau, le mode par défaut des nouveaux nœuds I<ptmx> est 0000. B<ptmxmode=>I<valeur> indique un mode plus pratique pour le nœud I<ptmx> et est recommandé lorsque l'option B<newinstance> est indiquée.
pl: W celu uzyskania kompatybilności ze starszymi wersjami jądra, domyślnym trybem nowego węzła I<ptmx> jest 0000. B<ptmxmode=>I<wartość> określa bardziej przydatny tryb dla nowego węzła I<ptmx> i jest wysoce zalecany, gdy podana jest opcja B<newinstance>.
uk: Для сумісності із застарілими версіями ядра системи типовим режимом доступу до нового вузла I<ptmx> є 0000. B<ptmxmode=>I<значення> визначає корисніший режим доступу до вузла I<ptmx>. Наполегливо рекомендуємо, якщо вказано параметр B<newinstance>.

source: This option is only implemented in Linux kernel versions starting with 2.6.29. Further, this option is valid only if CONFIG_DEVPTS_MULTIPLE_INSTANCES is enabled in the kernel configuration.
de: Diese Option ist im Linux-Kernel erst ab Version ab 2.6.29 implementiert. Außerdem ist sie nur gültig, wenn CONFIG_DEVPTS_MULTIPLE_INSTANCES in der Kernel-Konfiguration aktiviert ist.
fr: Cette option est implémentée dans le noyau Linux depuis la version 2.6.29. De plus, cette option n'est valable que si l'option CONFIG_DEVPTS_MULTIPLE_INSTANCES est activée dans la configuration du noyau.
pl: Opcja została zaimplementowana jedynie w wersjach jądra Linux poczynając od 2.6.29. Co więcej, opcja ta jest poprawna jedynie, jeśli w konfiguracji jądra włączono CONFIG_DEVPTS_MULTIPLE_INSTANCES.
uk: Цей параметр реалізовано лише у ядрах Linux, починаючи з версії 2.6.29. Крім того, цей параметр є чинним, лише якщо у налаштуваннях ядра увімкнено CONFIG_DEVPTS_MULTIPLE_INSTANCES.

source: Set blocksize (default 512). This option is obsolete.
de: legt die Blockgröße fest (standardmäßig 512). Diese Option ist veraltet.
fr: Définir la taille des blocs (par défaut 512). Cette option est obsolète.
pl: Ustawia rozmiar bloku (domyślnie 512). Opcja jest przestarzała.
uk: Встановити розмір блоку (типове значення — 512). Цей параметр є застарілим.

source: Set the owner and group of all files. (Default: the UID and GID of the current process.)
de: legt den Eigentümer und die Gruppe aller Dateien fest (standardmäßig die UID und GID des aktuellen Prozesses).
fr: Définir le propriétaire et le groupe de tous les fichiers (les valeurs par défaut sont l'UID et le GID du processus actuel).
pl: Ustawia właściciela i grupę wszystkich plików (domyślnie: UID i GID bieżącego procesu).
uk: Встановити власника і групу усіх файлів. (Типове значення: UID і GID поточного процесу.)

source: Set the umask (the bitmask of the permissions that are B<not> present). The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest (die Bitmaske der Zugriffsrechte, die B<nicht> vorhanden sind). Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask (c'est-à-dire le masque de bits des permissions qui ne sont B<pas> fournies). Par défaut, il s'agit de l'umask du processus actuel. La valeur est donnée en octal.
pl: Ustawia umask (maskę bitową praw, które B<nie> występują). Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask (бітову маску прав доступу, яких B<немає>). Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: Set the umask applied to directories only. The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest, die nur für Verzeichnisse gültig ist. Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask appliqué aux répertoires seulement. Par défaut, c'est l'umask du processus appelant. La valeur est donnée en octal.
pl: Ustawia umask ustawiany wyłącznie do katalogów. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask, який буде застосовано лише до каталогів. Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: Set the umask applied to regular files only. The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest, die nur für reguläre Dateien gültig ist. Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask appliqué aux fichiers normaux seulement. Par défaut, c'est l'umask du processus appelant. La valeur est donnée en octal.
pl: Ustawia umask ustawiany wyłącznie do zwykłych plików. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask, який буде застосовано лише до звичайних файлів. Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: If current process is in group of file's group ID, you can change timestamp.
de: legt fest, dass Sie den Zeitstempel ändern können, wenn der aktuelle Prozess Element der Gruppe mit der Gruppenkennung der Datei ist.
fr: Si le processus actuel appartient au GID du fichier, l'horodatage peut être modifié.
pl: Jeśli bieżący proces jest w grupie identyfikatora grupy pliku, można zmienić pieczątkę czasową.
uk: Якщо поточний процес належить групі ідентифікатора групи файла, ви можете змінити часову позначку.

source: The default is set from `dmask' option. (If the directory is writable, B<utime>(2) is also allowed. I.e.\& \s+3~\s0dmask & 022)
de: Die Standardeinstellung wird aus der Option »dmask« entnommen (falls das Verzeichnis nicht schreibgeschützt ist, dann ist auch B<utime>(2) erlaubt, d.h. \s+3~\s0dmask & 022).
fr: La valeur par défaut est définie depuis l'option B<dmask> (s'il est possible d'écrire dans le répertoire, B<utime>(2) est autorisé, c'est-à-dire « \s+3~\s0dmask & 022 »).
pl: Wartość domyślna jest ustawiana z opcji "dmask" (jeśli katalog jest zapisywalny, to dozwolone jest również B<utime>(2) np.\& \s+3~\s0dmask & 022)
uk: Типове значення буде встановлено на основі параметра «dmask». (Якщо каталог є придатним до запису, також можна скористатися B<utime>(2). Приклад: \s+3~\s0dmask & 022)

source: Normally B<utime>(2) checks that the current process is owner of the file, or that it has the B<CAP_FOWNER> capability. But FAT filesystems don't have UID/GID on disk, so the normal check is too inflexible. With this option you can relax it.
de: Normalerweise prüft B<utime>(2), ob der aktuelle Prozess Eigentümer der Datei ist oder über die Capability B<CAP_FOWNER> verfügt. Allerdings haben FAT-Dateisysteme keine UID/GID auf der Platte, so dass eine gewöhnliche Überprüfung zu unflexibel ist. Mit dieser Option können Sie sie lockern.
fr: Normalement, B<utime>(2) vérifie que le processus actuel est le propriétaire du fichier ou qu'il a la propriété B<CAP_FOWNER>. Cependant, les systèmes de fichiers FAT n’ont pas d'UID ou de GID sur le disque, donc une vérification normale est trop inflexible. Avec cette option, vous pouvez l'assouplir.
pl: Zwykle B<utime(2)> sprawdza czy bieżący proces jest właścicielem pliku lub czy posiada właściwość B<CAP_FOWNER>. Jednak systemy plików FAT nie posiadają na dysku UID ani GID, więc zwykłe sprawdzenie jest zbyt mało elastyczne. Opcja jest remedium na tę sytuację.
uk: Зазвичай, B<utime>(2) перевіряє, чи є поточний процес власником файла, і чи має він можливість B<CAP_FOWNER>. Втім, файлові системи FAT не мають UID/GID на диску, тому звичайна перевірка є надто негнучкою. За допомогою цього параметра ви можете оптимізувати її.

source: Upper and lower case are accepted and equivalent, long name parts are truncated (e.g.\& I<verylongname.foobar> becomes I<verylong.foo>), leading and embedded spaces are accepted in each name part (name and extension).
de: Es wird sowohl Groß- als auch Kleinschreibung akzeptiert, lange Namensbestandteile werden gekürzt (zum Beispiel wird I<sehrlangername.foobar> zu I<sehrlang.foo>), vorangestellte und eingebettete Leerzeichen werden in jedem Namensbestandteil akzeptiert (Name und Erweiterung).
fr: Les majuscules et minuscules sont acceptées et équivalentes. La partie excédentaire des noms longs est supprimée (par exemple I<nombeaucouptroplong.toto> devient I<nombeauc.tot>). Les espaces en tête et dans les noms sont acceptés, tant dans le nom que dans l'extension.
pl: Akceptowane i równoważne sobie są zarówno wielkie, jak i małe litery. Części długich nazw są obcinane (np. I<verylongname.foobar> staje się I<verylong.foo>), początkowe i wtrącone spacje są akceptowane jako każda część nazwy (nazwy i rozszerzenia).
uk: Прийнятними є літери верхнього і нижнього регістру, вони є еквівалентними. Довгі частини назв буде обрізано (наприклад, I<дужедовганазва.щосьтам> стане I<дужедовга.щось>), можна використовувати початкові і вбудовані пробіли в усіх частинах (назві і суфіксі назви).

source: Like "relaxed", but many special characters (*, ?, E<lt>, spaces, etc.) are rejected. This is the default.
de: verhält sich wie »relaxed«, aber viele spezielle Zeichen (*, ?, E<lt>, Leerzeichen, usw.) werden abgewiesen. Dies ist die Voreinstellung.
fr: Comme B<relaxed>, mais de nombreux caractères spéciaux (*, ?, E<lt>, espaces, etc.) sont refusés. C'est le comportement par défaut.
pl: Podobnie jak "relaxed", lecz wiele znaków specjalnych (jak *, ?, E<lt>, spacje, itp.) jest odrzucanych. Tak jest domyślnie.
uk: Подібний до «relaxed», але не можна використовувати багато спеціальних символів (*, ?, E<lt>, пробіли тощо). Це типовий варіант.

source: Sets the codepage for converting to shortname characters on FAT and VFAT filesystems. By default, codepage 437 is used.
de: legt die Zeichensatztabelle (Codepage) für die Übersetzung in Kurznamenzeichen auf FAT- und VFAT-Dateisystemen fest. Standardmäßig wird die Zeichensatztabelle 437 verwendet.
fr: Définir la page de code pour convertir les caractères des noms courts des systèmes de fichiers FAT et VFAT. Par défaut, la page 437 est utilisée.
pl: Ustawia stronę kodową do konwersji znaków krótkiej nazwy w systemach plików FAT i VFAT. Domyślnie stosowana jest strona kodowa 437.
uk: Встановлює кодову сторінку для перетворення символів коротких назв у файлових системах FAT і VFAT. Типово, буде використано кодову сторінку 437.

source: Forces the driver to use the CVF (Compressed Volume File) module cvf_I<module> instead of auto-detection. If the kernel supports kmod, the cvf_format=xxx option also controls on-demand CVF module loading. This option is obsolete.
de: bewirkt, dass der Treiber das CVF-Modul (Compressed Volume File) cvf_I<Modul> verwendet, anstatt dass es automatisch erkannt wird. Wenn der Kernel Kmod unterstützt, steuert die Option cvf_format=xxx auch das bedarfsabhängige Laden von CVF-Modulen. Diese Option ist veraltet.
fr: Obliger le pilote à utiliser le module CVF (Compressed Volume File) B<cvf_>I<module> plutôt que l'autodétection. Si le noyau gère kmod, l'option B<cvf_format=>I<module> commande aussi le chargement du module CVF à la demande. Cette option est obsolète.
pl: Wymusza na sterowniku stosowanie modułu CVF (Compressed Volume File) cvf_I<moduł> zamiast automatycznego wykrywania. Jeżeli jądro obsługuje kmod, to opcja cvf_format=xxx steruje także ładowaniem na żądanie modułu CVF. Ta opcja jest przestarzała.
uk: Наказує драйверу використовувати модуль CVF (Compressed Volume File, файл стиснутого тому) cvf_I<_модуль> замість автоматичного виявлення. Якщо у ядрі передбачено підтримку kmod, параметр cvf_format=xxx також керує завантаженням модуля CVF на вимогу. Цей параметр є застарілим.

source: Option passed to the CVF module. This option is obsolete.
de: wird an das CVF-Modul übergeben. Diese Option ist veraltet.
fr: Option passée au module CVF. Cette option est obsolète.
pl: Opcja przekazywana do modułu CVF. Ta opcja jest przestarzała.
uk: Параметр, який буде передано до модуля CVF. Цей параметр є застарілим.

source: Turn on the I<debug> flag. A version string and a list of filesystem parameters will be printed (these data are also printed if the parameters appear to be inconsistent).
de: aktiviert den Schalter I<debug>. Eine Versionszeichenkette und eine Liste der Dateisystemparameter werden ausgegeben (diese Daten werden auch dann ausgegeben, wenn die Parameter inkonsistent zu sein scheinen).
fr: Activer l'attribut B<debug>. Un numéro de version et une liste des paramètres du système de fichiers seront affichés (ces données seront également affichées si les paramètres semblent incohérents).
pl: Włącza flagę I<debug>. Wypisana zostanie wersja i lista parametrów systemu plików (te dane wypisywane są też jeśli parametry są niespójne).
uk: Увімкнути прапорець I<debug>. Буде виведено рядок версії та список параметрів файлової системи (ці дані також буде виведено, якщо буде виявлено несумісність параметрів).

source: If set, causes discard/TRIM commands to be issued to the block device when blocks are freed. This is useful for SSD devices and sparse/thinly-provisioned LUNs.
de: bewirkt, dass Verwerfungs- oder TRIM-Befehle an das blockorientierte Gerät gesendet werden, wenn Blöcke freigegeben werden. Dies ist für SSD-Geräte und bei schlanker Speicherzuweisung bei LUNs nützlich.
fr: Si elles sont activées, des commandes discard et TRIM seront envoyées au périphérique bloc quand les blocs sont libérés. C'est utile pour les périphériques SSD et l'allocation fine et dynamique (« thinly-provisioned LUN »).
pl: Jeśli ustawione, powoduje wydawanie poleceń discard/TRIM na urządzeniu blokowym, gdy bloki są zwalniane. Jest to przydatne w przypadku urządzeń SSD i alokowania elastycznego/"rzadkiego" w jednostkach LUN.
uk: Якщо встановлено, наказує відкинути/виконати TRIM для команд, які буде видано блоковому пристрою, при вивільненні блоків. Це корисно для пристроїв SSD і розріджених/thinly-provisioned LUN.

source: If set, use a fallback default BIOS Parameter Block configuration, determined by backing device size. These static parameters match defaults assumed by DOS 1.x for 160 kiB, 180 kiB, 320 kiB, and 360 kiB floppies and floppy images.
de: verwendet eine Ausweichkonfiguration der standardmäßigen Block-BIOS-Parameter, die durch das zugrunde liegende Gerät bestimmt wird. Diese statischen Parameter entsprechen den von DOS 1.x für Disketten der Größen 160 kiB, 180 kiB, 320 kiB und 360 kiB sowie Diskettenabbilder angenommenen Werten.
fr: Si définie, utiliser une configuration de repli par défaut de paramètre bloc du BIOS, déterminée par la taille du périphérique sous-jacent. Ces paramètres statiques correspondent aux valeurs par défaut supposées par DOS 1.x pour les disquettes et images de disquettes de 160 kio, 180 kio, 320 kio et 360 kio.
pl: Jeśli ustawione, używa domyślnej, zapasowej konfiguracji BIOS Parameter Block, w zależności od rozmiaru danego urządzenia. Te statyczne parametry przyjmują domyślne wartości DOS-a 1.x dla dyskietek i obrazów dyskietek 160 kiB, 180 kiB, 320 kiB i 360 kiB.
uk: Якщо встановлено, використовувати резервні типові налаштування блоку параметрів BIOS, які визначено за розміром резервного пристрою. Ці статичні параметри відповідають типовим параметрам, які передбачено у DOS 1.x для дискет 160 КіБ, 180 КіБ, 320 КіБ і 360 КіБ та образів дискет.

source: Specify a 12, 16 or 32 bit fat. This overrides the automatic FAT type detection routine. Use with caution!
de: legt ein FAT des Typs 12, 16 oder 32 Bit fest. Dadurch wird die Routine der automatischen FAT-Erkennung außer Kraft gesetzt. Sie sollten dies mit Vorsicht verwenden!
fr: Préciser s'il s'agit d'une FAT 12, 16 ou 32 bits. Cela a priorité sur la détection automatique du type de FAT. À utiliser avec précaution !
pl: Określa fat 12-, 16- lub 32-bitowy. To przesłania procedurę automatycznego wykrywania typu FAT. Używaj ostrożnie!
uk: Вказати 12-, 16- або 32-бітовий FAT. Має вищий пріоритет за типову автоматичну процедуру виявлення типу FAT. Будьте обережні!

source: Character set to use for converting between 8 bit characters and 16 bit Unicode characters. The default is iso8859-1. Long filenames are stored on disk in Unicode format.
de: gibt den für die Umwandlung von 8-Bit- und 16-Bit-Unicode-Zeichen zu verwendenden Zeichensatz an. Die Standardeinstellung ist iso8859-1. Lange Dateinamen werden auf der Platte im Unicode-Format gespeichert.
fr: Jeu de caractères pour les conversions entre les caractères 8 bits et les caractères 16 bits Unicode. Par défaut c'est ISO 8859-1. Les noms de fichiers longs sont conservés sur le disque au format Unicode.
pl: Zestaw znaków używany do konwersji między znakami 8-bitowymi a 16-bitowymi znakami Unikodu. Domyślnym jest iso8859-1. Długie nazwy plików są przechowywane na dysku w formacie Unicode.
uk: Набір символів, яким слід скористатися при перетворенні між 8-бітовими символами і 16-бітовими символами Unicode. Типовим є iso8859-1. Довгі назви файлів зберігатимуться на диску у форматі Unicode.
