Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Rock Ridge is an extension to iso9660 that provides all of these UNIX-like features. Basically there are extensions to each directory record that supply all of the additional information, and when Rock Ridge is in use, the filesystem is indistinguishable from a normal UNIX filesystem (except that it is read-only, of course).
de: Rock Ridge ist eine Erweiterung für iso9660, die alle diese UNIX-typischen Funktionsmerkmale bereitstellt. Im Wesentlichen gibt es Erweiterungen für jeden Verzeichniseintrag, die alle zusätzlichen Informationen bereitstellen. Wenn Rock Ridge verwendet wird, ist das Dateisystem nicht mehr von einem normalen UNIX-Dateisystem zu unterscheiden (außer natürlich, dass es schreibgeschützt ist).
fr: Rock Ridge est une extension du format ISO 9660 qui permet d'offrir ces fonctionnalités UNIX. En gros, des données sont ajoutées pour chaque entrée de chaque répertoire afin de fournir les informations désirées. Lorsque Rock Ridge est utilisée, le système de fichiers est complètement semblable à un système de fichiers UNIX normal (sauf qu'il est en lecture seule évidemment).
pl: Rozszerzeniem iso9660 jest Rock Ridge, który udostępnia wszystkie te uniksopodobne właściwości. Najprościej mówiąc, dla każdego wpisu katalogowego istnieją w nim rozszerzenia, które uzupełniają wszystkie informacje. Gdy używane jest Rock Ridge, system plików jest nieodróżnialny od normalnego uniksowego systemu plików (poza tym, że jest tylko do odczytu, oczywiście).
uk: Rock Ridge — це розширення для iso9660, яке надає всі ці функції, подібні до UNIX. Загалом, для кожного запису каталогу є розширення, які надають всю додаткову інформацію, і за використання Rock Ridge файлова система не відрізняється від звичайної файлової системи UNIX (звичайно, за винятком того, що вона доступна лише для читання).

source: Disable the use of Rock Ridge extensions, even if available. Cf.\& B<map>.
de: deaktiviert die Verwendung der Rock-Ridge-Erweiterungen, selbst wenn diese verfügbar sind. Siehe B<map>.
fr: Ne pas utiliser les extensions Rock Ridge, même si elles sont disponibles. Consultez B<map>.
pl: Wyłącza korzystanie z rozszerzeń Rock Ridge, nawet jeśli są dostępne. Zob.\& B<map>.
uk: Вимкнути використання розширення Rock Ridge, навіть якщо воно є доступним. Порівняйте з B<map>.

source: Disable the use of Microsoft Joliet extensions, even if available. Cf.\& B<map>.
de: deaktiviert die Verwendung der Microsoft-Joliet-Erweiterungen, selbst wenn diese verfügbar sind. Siehe B<map>.
fr: Désactiver les extensions Microsoft Joliet, même si elles sont disponibles. Consultez B<map>.
pl: Wyłącza korzystanie z rozszerzeń Joliet firmy Microsoft, nawet jeśli są dostępne. Zob.\& B<map>.
uk: Вимкнути використання розширення Microsoft Joliet, навіть якщо воно є доступним. Порівняйте з B<map>.

source: With B<check=relaxed>, a filename is first converted to lower case before doing the lookup. This is probably only meaningful together with B<norock> and B<map=normal>. (Default: B<check=strict>.)
de: Mit B<check=relaxed> wird ein Dateiname zuerst in Kleinschreibung umgewandelt, bevor das Nachschlagen erfolgt. Dies ist wahrscheinlich nur zusammen mit B<norock> und B<map=normal> sinnvoll (Standard: B<check=strict>).
fr: Avec B<check=relaxed>, les noms de fichier sont convertis en minuscules avant de lancer la recherche. Cela n'a probablement d'intérêt qu'avec les options B<norock> et B<map=normal>. (Par défaut : B<check=strict>.)
pl: Z B<check=relaxed>, nazwa pliku przed dokonywaniem podglądu jest najpierw przekształcana na małe litery. Prawdopodobnie ma to znaczenie tylko razem z B<norock> i B<map=normal>. (Domyślnie: B<check=strict>.)
uk: За допомогою B<check=relaxed> перед початком пошуку назва файлу перетворюється в нижній регістр. Це, ймовірно, має значення лише разом із B<norock> і B<map=normal>. (Типово: B<check=strict>.)

source: Give all files in the filesystem the indicated user or group id, possibly overriding the information found in the Rock Ridge extensions. (Default: B<uid=0,gid=0>.)
de: gibt allen Dateien im Dateisystem die angegebene Benutzer- oder Gruppenkennung, wobei unter Umständen die in den Rock-Ridge-Erweiterungen gefundene Information außer Kraft gesetzt wird (Standard: B<uid=0,gid=0>).
fr: Définir le propriétaire et le groupe de tous les fichiers en écrasant éventuellement les informations trouvées dans les extensions Rock Ridge (par défaut : B<uid=0,gid=0>).
pl: Nadaje wszystkim plikom systemu plików wskazany identyfikator użytkownika i grupy, być może przesłaniając informacje znalezione w rozszerzeniach Rock Ridge. (Domyślnie: B<uid=0,gid=0>.)
uk: Надати всім файлам у файловій системі вказаний ідентифікатор користувача або групи, можливо, замінивши інформацію, знайдену в розширеннях Rock Ridge. (Типово: B<uid=0,gid=0>.)

source: For non-Rock Ridge volumes, normal name translation maps upper to lower case ASCII, drops a trailing `;1', and converts `;' to `.'. With B<map=off> no name translation is done. See B<norock>. (Default: B<map=normal>.) B<map=acorn> is like B<map=normal> but also apply Acorn extensions if present.
de: Bei Datenträgern ohne Rock-Ridge-Erweiterungen wandelt die normale Namensübersetzung Kleinschreibung in ASCII-Großschreibung um, entfernt ein angehängtes »;1« und wandelt »;« in ».« um. Mit B<map=off> wird keine Namensübersetzung ausgeführt. Siehe B<norock> (Standard: B<map=normal>). B<map=acorn> verhält sich wie B<map=normal>, wobei zusätzlich auch Acorn-Erweiterungen angewendet werden, sofern vorhanden.
fr: Pour les volumes sans extension Rock Ridge, la conversion des noms de fichiers change les majuscules en minuscules, supprime l'éventuel « ;1 » final, et transforme « ; » en « . ». Avec B<map=off> il n'y a pas de conversion. Consultez B<norock> (B<map=normal> par défaut). B<map=acorn> est comme B<map=normal>, mais applique aussi les extensions Acorn si elles sont présentes.
pl: Dla wolumenów typu innego niż Rock Ridge, normalna translacja nazwy odwzorowuje wielkie litery ASCII na małe, porzuca kończące `;1' i zamienia `;' na `.'. Z B<map=off> nie jest dokonywana konwersja nazw. Zobacz B<norock>. (Domyślnie: B<map=normal>.) B<map=acorn> jest podobne do B<map=normal>, ale stosuje także rozszerzenia Acorn, jeśli występują.
uk: Для томів, які не належать до Rock Ridge, звичайне перетворення назв відображає ASCII з верхнього в нижній регістр, відкидає кінцевий «;1» і перетворює «;» на «.». Якщо B<map=off>, то назва не перетворюється. Див. B<norock>. (Типово: B<map=normal>.) B<map=acorn> схоже на B<map=normal>, але також застосовує, за наявності, розширення Acorn.

source: For non-Rock Ridge volumes, give all files the indicated mode. (Default: read and execute permission for everybody.) Octal mode values require a leading 0.
de: Bei Datenträgern ohne Rock-Ridge-Erweiterungen erhalten alle Dateien den angegebenen Modus (Standard: Lese- und Ausführungsrechte für alle). Bei Angabe des Wertes in oktaler Notation ist eine vorangestellte 0 erforderlich.
fr: Pour les volumes non Rock Ridge, donner le mode indiqué à tous les fichiers (par défaut : lecture et exécution autorisées pour tous). Les valeurs de mode octal nécessitent B<0> en tête).
uk: Для томів, які не належать до Rock Ridge, надайте всім файлам зазначений режим. (Типово: дозвіл на читання та виконання для всіх.) Для вісімкових значень режиму потрібен початковий 0.

source: Also show hidden and associated files. (If the ordinary files and the associated or hidden files have the same filenames, this may make the ordinary files inaccessible.)
de: zeigt auch verborgene und zugehörige Dateien an (wenn die normalen und die zugehörigen oder verborgenen Dateien gleiche Namen haben, wird der Zugriff auf die normalen Dateien dadurch verhindert).
fr: Montrer également les fichiers cachés et les fichiers d'extensions (si les fichiers ordinaires et les fichiers d'extensions ou cachés ont les mêmes noms, cela peut rendre inaccessibles les fichiers ordinaires).
pl: Pokazuje również pliki ukryte i powiązane (jeśli zwykłe pliki i pliki powiązane lub ukryte mają te same nazwy plików, może to uczynić zwykłe pliki niedostępnymi).
uk: Також показувати приховані та пов'язані файли. (Якщо звичайні файли та пов'язані чи приховані файли мають однакові назви, це може зробити звичайні файли недоступними.)

source: Set the block size to the indicated value. (Default: B<block=1024>.)
de: setzt die Blockgröße auf den angegebenen Wert (standardmäßig B<block=1024>).
fr: Définir la taille de bloc (B<block=1024> par défaut).
pl: Ustawia rozmiar bloku we wskazanym wolumenie. (Domyślnie: B<block=1024>.)
uk: Встановити вказане значення розміру блока. (Типово: B<block=1024>.)

source: If the high byte of the file length contains other garbage, set this mount option to ignore the high order bits of the file length. This implies that a file cannot be larger than 16\ MB.
de: ignoriert die Bits hoher Ordnung der Dateilänge, falls das hohe Byte der Dateilänge weiteren Müll enthält. Dies impliziert, dass eine Datei nicht größer als 16\ MB sein darf.
fr: Si l'octet de poids fort de la taille d'un fichier contient n'importe quoi, utilisez cette option de montage pour ignorer les octets de poids fort de taille de fichier. Cela force la longueur maximale d'un fichier à 16 Mo.
pl: Jeśli starszy bajt długości pliku zawiera inne śmieci, warto ustawić tę opcję montowania, aby był ignorowany. Powoduje to, że maksymalny rozmiar pliku nie może być większy niż 16\ MB.
uk: Якщо старший байт довжини файлу містить сміття, встановіть цей параметр монтування, щоб нехтувати старші біти довжини файлу. Це означає, що розмір файлу не може перевищувати 16\ МБ.

source: Select number of session on multisession CD.
de: wählt die Nummer der Sitzung auf einer Mehrfachsitzung-(Multisession-)CD.
fr: Indiquer le numéro de session sur un CD multisessions.
pl: Wybiera numer sesji na CD wielosesyjnych.
uk: Вибрати номер сеансу для багатосеансового компакт-диска.

source: The following options are the same as for vfat and specifying them only makes sense when using discs encoded using Microsoft's Joliet extensions.
de: Die folgenden Optionen sind die gleichen wie für VFAT. Deren Angabe ergibt nur bei Platten Sinn, die mit den Joliet-Erweiterungen vom Microsoft kodiert sind.
fr: Les options suivantes sont les mêmes que pour I<vfat> et les indiquer n'a de sens que dans le cas de disques utilisant les extensions Joliet de Microsoft.
pl: Poniższe opcje są takie same jak do vfat i podawanie ich ma sens tylko przy używaniu płyt zakodowanych przy użyciu rozszerzeń Joliet firmy Microsoft.
uk: Подальші параметри такі ж, як і для vfat, і вказувати їх має сенс лише за використання дисків, закодованих за допомогою розширень Joliet від Microsoft).

source: Character set to use for converting 16 bit Unicode characters on CD to 8 bit characters. The default is iso8859-1.
de: gibt den für die Umwandlung von 16-Bit-Unicode-Zeichen auf der CD in 8-Bit-Zeichen zu verwendenden Zeichensatz an. Die Standardeinstellung ist iso8859-1.
fr: Jeu de caractères à utiliser pour la conversion des caractères Unicode 16 bits du CD en caractères 8 bits. Le jeu par défaut est ISO 8859-1.
pl: Zestaw znaków używany do konwersji z 16-bitowych znaków Unikodu na CD do 8-bitowych znaków. Domyślnie jest to iso8859-1.
uk: Набір символів для перетворення 16-бітових символів Unicode на компакт-диску у 8-бітові символи. Типово встановлено iso8859-1.

source: Character set to use for converting from Unicode to ASCII. The default is to do no conversion. Use B<iocharset=utf8> for UTF8 translations. This requires CONFIG_NLS_UTF8 to be set in the kernel I<.config> file.
de: gibt den für die Umwandlung von Unicode in ASCII zu verwendenden Zeichensatz an. Standardmäßig wird keine Umwandlung ausgeführt. Verwenden Sie B<iocharset=utf8> für Übersetzungen in UTF-8. Dies erfordert das Setzen von CONFIG_NLS_UTF8 in der Kernelkonfiguration I<.config>.
fr: Jeu de caractères à utiliser pour la conversion de l'Unicode en ASCII. Le comportement par défaut est de ne pas faire de conversion. Utiliser B<iocharset=utf8> pour les traductions UTF-8. Cela nécessite que CONFIG_NLS_UTF8 soit positionné dans le fichier I<.config> du noyau.
pl: Zestaw znaków, używany do konwersji z Unikodu do ASCII. Domyślnie konwersja nie jest przeprowadzana. Proszę użyć B<iocharset=utf8> w celu tłumaczeń UTF-8. Opcja wymaga ustawienia CONFIG_NLS_UTF8 w pliku jądra I<.config>.
uk: Набір символів для перетворення з Unicode в ASCII. Типовим є не виконувати перетворення. Для перетворення в UTF8 використовуйте B<iocharset=utf8>. Для цього у файлі I<.config> ядра потрібно встановити CONFIG_NLS_UTF8.

source: Resize the volume to I<value> blocks. JFS only supports growing a volume, not shrinking it. This option is only valid during a remount, when the volume is mounted read-write. The B<resize> keyword with no value will grow the volume to the full size of the partition.
de: verändert die Größe des Datenträgers auf die angegebene Anzahl I<Blöcke>. JFS unterstützt nur die Vergrößerung von Datenträgern, nicht das Verkleinern. Diese Option ist nur beim erneuten Einhängen zulässig, wenn der Datenträger les- und schreibbar eingehängt ist. Das Schlüsselwort B<resize> ohne Wert vergrößert den Datenträger auf die Gesamtgröße der Partition.
fr: Redimensionner le volume à I<valeur> blocs. JFS ne prend en charge que l'agrandissement d'un volume, pas sa réduction. Cette option n'est valable que lors d'un remontage, lorsque le volume est monté en lecture et écriture. Le mot clef B<resize> sans valeur associée fera que le volume sera agrandi à toute la taille de la partition.
pl: Zmienia wielkość woluminu do I<wartość> bloków. JFS obsługuje jedynie powiększanie woluminu, nie zmniejszanie go. Opcja jest prawidłowa tylko podczas ponownego montowania, gdy wolumin jest zamontowany do odczytu i zapisu. Słowo kluczowe B<resize> bez wartości, powiększy wolumin do pełnego rozmiaru partycji.
uk: Змінити обсягу до I<значення> блоків. JFS підтримує лише збільшення обсягу, а не його скорочення. Цей параметр діє лише під час перемонтування, коли том підключено для читання-запису. Ключове слово B<resize> без значення збільшить обсяг до повного розміру розділу.

source: Do not write to the journal. The primary use of this option is to allow for higher performance when restoring a volume from backup media. The integrity of the volume is not guaranteed if the system abnormally ends.
de: schreibt nicht ins Journal. Der primäre Zweck dieser Option ist es, die Performance beim Wiederherstellen eines Datenträgers von einem Sicherungsmedium zu verbessern. Die Integrität des Datenträgers kann nicht gewährleistet werden, wenn das System unerwartet endet.
fr: Ne pas écrire dans le journal. La première utilisation de cette option est de permettre une meilleure performance lors de la restauration d'un volume à partir d'un média de sauvegarde. L'intégrité du volume n'est pas garantie si le système s'est arrêté de manière anormale.
pl: Nie zapisuje do dziennika. Głównym użyciem tej opcji jest możliwość uzyskania wyższej wydajności przy przywracaniu woluminu z kopii zapasowej. Integralność woluminu nie jest gwarantowana, jeśli system zostanie nieprawidłowo zamknięty.
uk: Не записувати в журнал. Цей параметр переважно використовують для підвищення продуктивності під час відновлення тому з резервного носія. Якщо система ненормально завершує роботу, то цілісність тому не гарантується.

source: Default. Commit metadata changes to the journal. Use this option to remount a volume where the B<nointegrity> option was previously specified in order to restore normal behavior.
de: schreibt Änderungen der Metadaten in das Journal (Standard). Verwenden Sie diese Option, um einen Datenträger erneut einzuhängen, wenn dieser zuvor mit der Option B<nointegrity> eingehängt wurde, um damit das normale Verhalten wiederherzustellen.
fr: C'est le comportement par défaut. Soumettre les modifications des méta-données dans le journal. Utilisez cette option pour remonter un volume lorsque l'option B<nointegrity> a été précédemment utilisée afin de retrouver un comportement normal.
pl: Domyślne. Zapisuje zmiany metadanych do dziennika. Można użyć tej opcji do ponownego zamontowania woluminu, gdy wcześniej użyto opcji B<nointegrity>, w celu przywrócenia normalnego zachowania.
uk: Типове. Занести зміни метаданих у журнал. Використовуйте цей параметр, щоб перемонтувати том, де раніше було вказано параметр B<nointegrity>, для відновлення звичайної поведінки.

source: Define the behavior when an error is encountered. (Either ignore errors and just mark the filesystem erroneous and continue, or remount the filesystem read-only, or panic and halt the system.)
de: legt das Verhalten fest, wenn ein Fehler aufgetreten ist (entweder werden Fehler ignoriert und das Dateisystem als fehlerhaft markiert und der Vorgang fortgesetzt oder das Dateisystem schreibgeschützt neu eingehängt oder ein »panic« ausgelöst und das System angehalten).
fr: Définir le comportement lorsqu'une erreur survient. (Soit ignorer les erreurs et simplement marquer le système de fichiers comme erroné et continuer, soit remonter le système de fichiers en lecture seule, soit déclencher une panique du noyau et arrêter le système).
pl: Definiuje zachowanie przy napotkaniu błędu (albo ignoruje błędy, zaznaczając tylko system plików jako błędny i kontynuując, albo ponownie montuje system plików na tylko do odczytu, albo panikuje i zatrzymuje system).
uk: Визначає поведінку при виникненні помилки. (Або нехтувати помилки та просто позначити файлову систему як помилкову та продовжити, або перемонтувати файлову систему лише для читання, або панічно зупинити систему.)

source: See mount options for fat. If the I<msdos> filesystem detects an inconsistency, it reports an error and sets the file system read-only. The filesystem can be made writable again by remounting it.
de: Siehe die Einhängeoptionen für FAT. Wenn das I<msdos>-Dateisystem eine Inkonsistenz erkennt, meldet es einen Fehler und setzt das Dateisystem auf schreibgeschützt. Das Dateisystem kann wieder schreibbar gemacht werden, indem es erneut eingehängt wird.
fr: Consultez les options de montage pour I<fat>. Si le système de fichiers I<msdos> détecte des incohérences, une erreur sera indiquée et le système de fichiers passera en lecture seule. L'écriture peut être réactivée en remontant le système de fichiers.
pl: Zobacz opcje do fat. Jeśli system plików I<msdos> wykryje niespójność, zgłasza błąd i ustawia system plików na tylko do odczytu. System plików może być znowu dostępny do zapisu przez ponowne zamontowanie.
uk: Див. параметри монтування для FAT. Якщо файлова система I<msdos> виявляє неузгодженість, вона повідомляє про помилку та встановлює для файлової системи режим лише для читання. Файлову систему можна знову зробити придатною для запису, перемонтувавши її.

source: Just like I<nfs>, the I<ncpfs> implementation expects a binary argument (a I<struct ncp_mount_data>) to the mount system call. This argument is constructed by B<ncpmount>(8) and the current version of B<mount> (2.12) does not know anything about ncpfs.
de: Wie bei I<nfs> erwartet die I<ncpfs>-Implementation ein binäres Argument (ein I<struct ncp_mount_data>) zum Systemaufruf »mount«. Dieses Argument wird von B<ncpmount>(8) konstruiert, aber die aktuelle Version von B<mount> (2.12) weiß nichts über Ncpfs.
fr: Tout comme I<nfs>, l'implémentation de I<ncpfs> nécessite un paramètre binaire (une structure I<ncp_mount_data>) lors de l'appel système. Cet argument est construit par B<ncpmount>(8) et la version actuelle de B<mount> (2.12) ne connaît rien en ce qui concerne I<ncpfs>.
pl: Tak jak przy I<nfs>, implementacja I<ncpfs> oczekuje binarnego argumentu (I<struct ncp_mount_data>) funkcji systemowej mount. Argument ten jest konstruowany przez B<ncpmount>(8), a bieżąca wersja B<mount> (2.12) nic nie wie o ncpfs.
uk: Як і I<nfs>, реалізація I<ncpfs> очікує двійкового аргументу (I<struct ncp_mount_data>) для системного виклику mount. Цей аргумент створено B<ncpmount>(8), а поточна версія B<mount> (2.12) нічого не знає про ncpfs.

source: Character set to use when returning file names. Unlike VFAT, NTFS suppresses names that contain nonconvertible characters. Deprecated.
de: gibt den Zeichensatz an, der für zurückgegebene Dateinamen verwendet wird. Im Gegensatz zu VFAT unterdrückt NTFS Namen, die nicht konvertierbare Zeichen enthalten. Missbilligt.
fr: Jeu de caractères à utiliser pour renvoyer les noms de fichiers. Contrairement à VFAT, NTFS supprime les noms qui contiennent des caractères non convertibles. Obsolète.
pl: Zestaw znaków stosowany przy zwracaniu nazw plików. W przeciwieństwie do VFAT, NTFS eliminuje nazwy zawierające znaki nie dające się przekształcić. Przestarzałe.
uk: Набір символів для використання під час повернення назв файлів. На відміну від VFAT, NTFS пригнічує назви, які містять символи, що не конвертуються. Застаріле.

source: For 0 (or `no' or `false'), do not use escape sequences for unknown Unicode characters. For 1 (or `yes' or `true') or 2, use vfat-style 4-byte escape sequences starting with ":". Here 2 give a little-endian encoding and 1 a byteswapped bigendian encoding.
de: Für 0 (oder »no« oder »false«) werden keine Escape-Sequenzen für unbekannte Unicode-Zeichen verwendet. Für 1 (oder »yes« oder »true«) oder 2 werden mit »:« beginnende 4-Byte-Escape-Sequenzen im VFAT-Stil verwendet: Hier ergibt 2 eine Little-Endian-Kodierung und 1 eine Big-Endian-Kodierung mit vertauschten Bytes.
fr: Si B<0> (ou B<no>, ou B<false>), ne pas utiliser de séquences d'échappements pour les caractères Unicode inconnus. Si B<1> (ou B<yes>, ou B<true>) ou B<2>, utiliser les séquences d'échappement sur quatre octets de style I<vfat> en commençant par « : ». Avec B<2>, un codage petit boutiste (« little-endian ») est utilisé et avec B<1> un codage grand boutiste (« big-endian »).
pl: Dla 0 (lub "no" albo "false") nie używa specjalnych kodowań nieznanych znaków Unikodu. Dla 1 (lub "yes" albo "true") lub 2 używa 4-bajtowych sekwencji specjalnych w stylu vfat zaczynających się od ":". Liczba 2 oznacza kodowanie little-endian, a 1 - kodowanie big-endian, z odwróconymi bajtami.
uk: 0 (або «no» чи «false») - не використовувати escape-послідовностей для невідомих символів Unicode. 1 (або «yes» чи «true») або 2 - використовувати 4-байтові escape-послідовності у стилі vfat, які починаються з ":". 2 означає кодування з першим молодшим байтом, а 1 - кодування з першим старшим байтом.

source: If enabled (posix=1), the filesystem distinguishes between upper and lower case. The 8.3 alias names are presented as hard links instead of being suppressed. This option is obsolete.
de: Falls dies aktiviert ist (posix=1), unterscheidet das Dateisystem zwischen Groß- und Kleinschreibung. Die 8.3-Aliasnamen werden als harte Links dargestellt, statt unterdrückt zu werden. Diese Option ist veraltet.
fr: Si actif (B<posix=1>), le système de fichiers distingue les majuscules des minuscules. Les noms d'alias I<8.3> sont présentés sous forme de liens physiques plutôt que d'être supprimés. Cette option est obsolète.
pl: Jeśli jest włączone (posix=1), to system plików rozróżnia wielkie i małe litery. Nazwy zastępcze 8.3 są przedstawiane jako dowiązania twarde, a nie pomijane. Ta opcja jest przestarzała.
uk: Якщо ввімкнено (posix=1), файлова система розрізняє верхній і нижній регістр. Псевдоніми 8.3 представлено як жорсткі посилання, а не приховані. Цей варіант застарів.

source: B<uid=>\,I<value>, B<gid=>\,I<value> and B<umask=>\,I<value>
de: B<uid=>\,I<Wert>, B<gid=>\,I<Wert> und B<umask=>\,I<Wert>
fr: B<uid=>\,I<valeur>, B<gid=>\,I<valeur> et B<umask=>\,I<valeur>
pl: B<uid=>\,I<wartość>, B<gid=>\,I<wartość> i B<umask=>\,I<wartość>
uk: B<uid=>\,I<значення>, B<gid=>\,I<значення> і B<umask=>\,I<значення>
