Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Allows to explicitly request full atime updates. This makes it possible for the kernel to default to B<relatime> or B<noatime> but still allow userspace to override it. For more details about the default system mount options see I</proc/mounts>.
de: ermöglicht die explizite Anforderung vollständiger Atime-Aktualisierungen. Dadurch wird es für den Kernel möglich, standardmäßig B<relatime> oder B<noatime> zu verwenden, dies aber dennoch benutzerseitig außer Kraft setzen zu lassen. Für weitere Details zu den standardmäßigen Einhängeoptionen des Systems siehe I</proc/mounts>.
fr: Demander explicitement une mise à jour complète des horodatages d'accès. Cela permet au noyau d'utiliser B<relatime> ou B<noatime> par défaut, mais il est toujours possible de changer cela depuis l'espace utilisateur. Pour plus de précisions sur les options de montage par défaut, consultez I</proc/mounts>.
pl: Pozwala na jawne żądanie pełnych aktualizacji atime. Umożliwia jądru na domyślne używanie B<relatime> lub B<noatime>, ale wciąż pozwala warstwie użytkownika na przesłonięcie tych opcji. Aby dowiedzieć się więcej o domyślnych, systemowych opcjach montowania należy zapoznać się z I</proc/mounts>.
uk: Дозволяє явним чином надіслати запит щодо повних оновлень atime. Це робить можливим для ядра типово використовувати B<relatime> або B<noatime>, але попри це надавати змогу перевизначати це у просторі користувача. Щоб дізнатися про типові параметри монтування файлової системи, див. I</proc/mounts>.

source: Use the kernel\(cqs default behavior for inode access time updates.
de: verwendet das Standardverhalten des Kernels zum Aktualisieren der Inode-Zugriffszeiten.
fr: Utiliser le comportement par défaut du noyau pour la mise à jour des horodatages d'accès aux inœuds.
pl: Używa domyślnego zachowania jądra dotyczącego aktualizowania czasów dostępu i-węzłów.
uk: Використовувати типову поведінку ядра для оновлень часу доступу до inode.

source: Only update times (atime, mtime, ctime) on the in-memory version of the file inode.
de: aktualisiert nur die Zeiten (atime, mtime, ctime) der speicherinternen Version des Datei-Inodes.
fr: Ne mettre à jour les dates (B<atime>, B<mtime> et B<ctime>) que dans la version en mémoire de l’inœud du fichier.
pl: Aktualizuje czasy (atime, mtime, ctime) wyłącznie w wersji i-węzła pliku przechowywanej w pamięci.
uk: Оновлювати часи (atime, mtime, ctime) лише у версії inode в оперативній пам'яті.

source: This mount option significantly reduces writes to the inode table for workloads that perform frequent random writes to preallocated files.
de: Diese Einhängeoption kann Schreibvorgänge zur Inode-Tabelle für jene Einsatzszenarien deutlich reduzieren, die häufig nichtlinear in vorreservierte Dateien schreiben.
fr: Cette option de montage réduit significativement les écritures sur la table des inœuds pour les charges de travail qui réalisent des écritures aléatoires fréquentes sur les fichiers préalloués.
pl: Opcja ta zdecydowanie ogranicza zapisy do tablicy i-węzłów, jeśli czynione są częste, losowe zapisy do wstępnie zaalokowanych plików.
uk: Використання цього параметра монтування суттєво зменшує кількість записів до таблиці inode у робочих процесах, які виконують часті випадкові записи до попередньо розміщених у пам'яті файлів.

source: The on-disk timestamps are updated only when:
de: Die Zeitstempel auf der Platte werden nur aktualisiert, wenn:
fr: Les horodatages sur disque ne sont mis à jour que quand :
pl: Znaczniki czasu przechowywane na dysku są aktualizowane tylko wtedy, gdy:
uk: Часові позначки на диску буде оновлено, лише за таких умов:

source: the inode needs to be updated for some change unrelated to file timestamps
de: der Inode wegen einer Änderung ohne Bezug zu Datei-Zeitstempeln aktualisiert werden muss
fr: l’inœud doit être mis à jour pour des modifications indépendantes des horodatages du fichier ;
pl: i-węzeł musi być zaktualizowany w związku ze zmianą niezwiązaną ze znacznikami czasu
uk: inode потребує оновлення через деякі зміни, які не пов'язано із часовими позначками файла

source: the application employs B<fsync>(2), B<syncfs>(2), or B<sync>(2)
de: die Anwendung B<fsync>(2), B<syncfs>(2) oder B<sync>(2) einsetzt
fr: l’application utilise B<fsync>(2), B<syncfs>(2) ou B<sync>(2) ;
pl: aplikacja wykorzystuje B<fsync>(2), B<syncfs>(2) lub B<sync>(2)
uk: програма використовує B<fsync>(2), B<syncfs>(2) або B<sync>(2)

source: an undeleted inode is evicted from memory
de: ein wiederhergestellter Inode aus dem Speicher entfernt wurde
fr: un inœud non supprimé est expulsé de la mémoire ;
pl: przywrócony (po usunięciu) i-węzeł jest wyrzucany z pamięci
uk: невилучений inode буде викинуто з оперативної пам'яті

source: more than 24 hours have passed since the inode was written to disk.
de: mehr als 24 Stunden vergangen sind, seitdem der Inode auf Platte geschrieben wurde.
fr: plus de 24 heures se sont écoulées depuis que l’inœud a été écrit sur le disque.
pl: minęło ponad 24 godziny od czasu zapisania i-węzła na dysk.
uk: минуло понад 24 годин з часу, коли inode було записано на диск.

source: Do not use the lazytime feature.
de: verwendet die Lazytime-Funktion nicht.
fr: Ne pas utiliser la fonctionnalité B<lazytime>.
pl: Nie używa funkcji lazytime.
uk: Не використовувати можливість lazytime.

source: Honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem.
de: respektiert die Bits oder Datei-Capabilities »set-user-ID« und »set-group-ID« bei der Ausführung von Programmen von diesem Dateisystem.
fr: Se conformer aux bits set-user-ID et set-group-ID ou aux capacités des fichiers lors de l’exécution de programmes de ce système de fichiers.
pl: Honoruje bity lub właściwości plików set-user-ID i set-group-ID przy wykonywaniu programów z tego systemu plików.
uk: Брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконання програм з цієї файлової системи.

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem. In addition, SELinux domain transitions require permission I<nosuid_transition>, which in turn needs also policy capability I<nnp_nosuid_transition>.
de: respektiert die Bits oder Datei-Capabilities »set-user-ID« und »set-group-ID« bei der Ausführung von Programmen von diesem Dateisystem nicht. Zusätzlich benötigen SELinux-Domänenübergänge die Erlaubnis I<nosuid_transition>, die wiederum auch die Richtlinien-Capability I<nnp_nosuid_transition> benötigt.
fr: Ne pas tenir compte des bits Set-UID et Set-GID ou des capacités de fichier lors de l'exécution de programmes de ce système de fichiers. En complément, les transitions de domaine SELinux exigent la permission I<nosuid_transition>, qui à son tour nécessite la capacité de politique I<nnp_nosuid_transition>.
uk: Не брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконанні програм з цієї файлової системи. Крім того, переходи домену SELinux потребують прав доступу I<nosuid_transition>, що потребує можливості правил I<nnp_nosuid_transition>.

source: Turn on the silent flag.
de: aktiviert den Silent-Schalter.
fr: Activer le mode silencieux.
pl: Włącza flagę "cicho".
uk: Увімкнути прапорець обробки без повідомлень (silent).

source: Turn off the silent flag.
de: deaktiviert den Silent-Schalter.
fr: Désactiver le mode silencieux.
pl: Wyłącza flagę "cicho".
uk: Вимкнути прапорець обробки без повідомлень (silent).

source: Allow an ordinary user to mount the filesystem if that user is the owner of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<owner,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen eines Dateisystems, falls dieser Eigentümer des Gerätes ist. Diese Option impliziert die Optionen B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<owner,dev,suid>).
fr: Autoriser un utilisateur ordinaire à monter le système de fichiers si cet utilisateur est propriétaire du périphérique. Cette option implique les options B<nosuid> et B<nodev> (à moins qu'elles ne soient annulées par d'autres options comme dans la ligne d'options B<owner,dev,suid>).
pl: Pozwala każdemu zwykłemu użytkownikowi na zamontowanie i odmontowanie systemu plików, jeśli jest on właścicielem urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<owner,dev,suid>).
uk: Дозволити звичайному користувачеві монтувати файлову систему, якщо цей користувач є власником пристрою. Цей параметр неявним чином встановлює параметри B<nosuid> і B<nodev> (якщо їх не перевизначено наступними параметрами, як у рядку параметрів B<owner,dev,suid>).

source: Attempt to remount an already-mounted filesystem. This is commonly used to change the mount flags for a filesystem, especially to make a readonly filesystem writable. It does not change device or mount point.
de: versucht, ein bereits eingehängtes Dateisystem erneut einzuhängen. Dies wird üblicherweise dazu verwendet, die Einhänge-Schalter eines Dateisystems zu ändern, insbesondere um ein schreibgeschütztes Dateisystem les- und schreibbar zu machen. Das Gerät oder der Einhängepunkt werden dadurch nicht verändert.
fr: Tenter de remonter un système de fichiers déjà monté. C'est utilisé pour changer les attributs de montage d'un système de fichiers, principalement pour autoriser l'écriture sur un système de fichiers en lecture seule. Cela ne change ni le périphérique ni le point de montage.
pl: Usiłuje ponownie zamontować (przemontować) już zamontowany system plików. Często używane do zmiany flag montowania systemu, szczególnie aby umożliwić zapis na systemach tylko do odczytu. Nie zmienia urządzenia ani punktu montowania.
uk: Спробувати повторно змонтувати вже змонтовану файлову систему. Цим, зазвичай, користуються для зміни прапорців монтування файлової системи, особливо для того, щоб зробити призначену лише для читання файлову систему придатною до запису. Не змінює пристрою чи точки монтування.

source: The remount operation together with the B<bind> flag has special semantics. See above, the subsection B<Bind mounts>.
de: Die Remount-Aktion in Kombination mit dem B<bind>-Schalter folgt einer speziellen Semantik. Siehe oben im Unterabschnitt B<Bind-Einhängungen>.
fr: L’opération de remontage de concert avec le drapeau B<bind> possède des sémantiques spéciales. Consultez la sous-section « Les opérations de remontage » ci-dessus.
pl: Operacja przemontowywania razem z flagą B<bind> ma specjalną semantykę. Patrz powyżej w podrozdziale B<Operacja montowania przez podpięcie (ang. bind mount)>.
uk: Дія з повторного монтування разом із прапорцем B<bind> має спеціальну семантику. Див. вище, розділ B<Монтування з пов'язуванням>.

source: The remount functionality follows the standard way the B<mount> command works with options from I<fstab>. This means that B<mount> does not read I<fstab> (or I<mtab>) only when both I<device> and I<dir> are specified.
de: Die Remount-Funktionalität folgt dem Standardweg, wie der Befehl B<mount> mit den Optionen aus der I<fstab>-Datei umgeht. Das bedeutet, dass B<mount> die I<fstab>- oder I<mtab>-Datei nicht liest, wenn sowohl I<Gerät> als auch I<Verzeichnis> angegeben sind.
fr: La fonctionnalité de remontage suit la façon habituelle dont la commande B<mount> fonctionne avec les options de I<fstab>. Cela signifie que la commande B<mount> ne lit pas I<fstab> (ou I<mtab>), seulement si I<périphérique> et I<répertoire> sont tous deux indiqués.
pl: Funkcja ponownego montowania przestrzega standardowego sposobu, w jaki polecenie B<mount> działa z opcjami z I<fstab>. Oznacza to, że polecenie B<mount> nie odczytuje I<fstab> (lub I<mtab>) wyłącznie wtedy, jeśli podano zarówno I<urządzenie> jak I<katalog>.
uk: У функціональній можливості повторного монтування реалізовано стандартний спосіб роботи команди B<mount> із параметрами з I<fstab>. Це означає, що B<mount> не читатиме I<fstab> (або I<mtab>), лише якщо одразу вказано I<пристрій> і I<каталог>.

source: B<mount -o remount,rw /dev/foo /dir>
de: B<mount -o remount,rw /dev/foo /Verzeichnis>
fr: B<mount -o remount,rw /dev/toto /répertoire>
pl: B<mount -o remount,rw /dev/foo /katalog>

source: After this call all old mount options are replaced and arbitrary stuff from I<fstab> (or I<mtab>) is ignored, except the B<loop=> option which is internally generated and maintained by the B<mount> command.
de: Nach diesem Aufruf werden alle alten Einhängeoptionen ersetzt und jegliche Angaben aus I<fstab> oder I<m>tab ignoriert, außer die Option B<loop=>, die intern erzeugt und vom Befehl B<mount> verwaltet wird.
fr: Après cet appel, toutes les anciennes options de montage sont remplacées et les options arbitraires du fichier I<fstab> (ou I<mtab>) sont ignorées, à part l’option B<loop=> qui est générée en interne et maintenue par la commande B<mount>.
uk: Після цього виклику усі старі параметри монтування буде замінено, а довільні дані з I<fstab> (або I<mtab>) буде проігноровано, окрім параметра B<loop=>, який буде створено на внутрішньому рівні і який буде супроводжуватися програмою B<mount>.

source: B<mount -o remount,rw /dir>
de: B<mount -o remount,rw /Verzeichnis>
fr: B<mount -o remount,rw /répertoire>
pl: B<mount -o remount,rw /katalog>

source: After this call, B<mount> reads I<fstab> and merges these options with the options from the command line (B<-o>). If no mountpoint is found in I<fstab>, then a remount with unspecified source is allowed.
de: Nach diesem Aufruf liest B<mount> die I<fstab>-Datei und führt diese Optionen mit den Befehlszeilenoptionen zusammen (B<-o>). Wenn in der I<fstab> kein Einhängepunkt gefunden wird, dann ist erneutes Einhängen ohne angegebene Quelle erlaubt.
fr: Après cet appel, B<mount> lit I<fstab> et fusionne ces options avec les options de la ligne de commande (B<-o>). Si aucun point de montage n’est trouvé dans I<fstab>, alors le remontage sans source indiquée est permis.
uk: Після цього виклику B<mount> читає I<fstab> і об'єднує ці параметри з параметрами з рядка команди (B<-o>). Якщо в I<fstab> не буде знайдено точки монтування, буде дозволено повторне монтування без визначення джерела.

source: B<mount> allows the use of B<--all> to remount all already mounted filesystems which match a specified filter (B<-O> and B<-t>). For example:
de: Den Befehl B<mount> können Sie mit B<--all> zum erneuten Einhängen bereits eingehängter Dateisysteme verwenden, die einem angegebenen Filter entsprechen (B<-O> und B<-t>). Beispiel:
fr: B<mount>(8) permet d’utiliser B<--all> pour remonter tous les systèmes de fichiers déjà montés qui correspondent avec un filtre indiqué (B<-O> et B<-t>). Par exemple :
pl: B<mount> zezwala na użycie opcji B<--all> do ponownego zamontowania już zamontowanych systemów plików, które pasują do podanego filtra (B<-O> i B<-t>). Przykładowo:
uk: B<mount> уможливлює використання B<--all> для повторного монтування усіх вже змонтованих файлових систем, які відповідають вказаному фільтру (B<-O> і B<-t>). Приклад:

source: remounts all already mounted vfat filesystems in read-only mode. Each of the filesystems is remounted by B<mount -o remount,ro> I</dir> semantic. This means the B<mount> command reads I<fstab> or I<mtab> and merges these options with the options from the command line.
de: hängt alle bereits eingehängten VFAT-Dateisysteme im schreibgeschützten Modus erneut ein. Jedes der Dateisysteme wird mit der Semantik B<mount -o remount,ro> I</Verzeichnis> erneut eingehängt. Das bedeutet, dass der Befehl B<mount> die I<fstab>- oder I<mtab>-Datei liest und die dort gefundenen Optionen mit den Optionen der Befehlszeile zusammenführt.
fr: remonte tous les systèmes de fichiers I<vfat> déjà montés en mode écriture seule. Chaque système de fichiers est remonté par la sémantique B<mount -o remount,ro> I</dir>. Cela signifie que la commande B<mount> lit I<fstab> ou I<mtab> et fusionne leurs options avec celles de la ligne de commande.
uk: повторно монтує усі вже змонтовані файлові системи vfat у режимі лише читання. Кожну файлову системі буде повторно змонтовано із семантикою B<mount -o remount,ro> I</каталог>. Це означає, що програма B<mount> прочитає I<fstab> або I<mtab> і об'єднає ці параметри з параметрами з рядка команди.

source: Mount the filesystem read-only.
de: hängt das Dateisystem schreibgeschützt ein.
fr: Monter le système de fichiers en lecture seule.
pl: Montuje system plików w trybie tylko do odczytu.
uk: Монтувати файлову систему у режимі тільки читання.

source: Mount the filesystem read-write.
de: hängt das Dateisystem les- und schreibbar ein.
fr: Monter le système de fichiers en lecture/écriture.
pl: Montuje system plików w trybie odczytu i zapisu.
uk: Змонтувати файлову систему у режимі читання-запису.

source: All I/O to the filesystem should be done synchronously. In the case of media with a limited number of write cycles (e.g. some flash drives), B<sync> may cause life-cycle shortening.
de: bewirkt, dass alle Ein- und Ausgaben des Dateisystems synchron ausgeführt werden. Bei Medien mit einer begrenzten Anzahl von Schreibzyklen (zum Beispiel einigen Flash-Speichermedien) kann B<sync> zu einer Verkürzung der Lebensdauer führen.
fr: Toutes les entrées et sorties du système de fichiers doivent être réalisées de façon synchrone. Dans le cas d'un support avec un nombre limité de cycles d'écriture (par exemple des mémoires flash), B<sync> peut réduire la durée de vie de celui-ci.
pl: Wszystkie operacje wejścia/wyjścia systemu plików powinny być wykonywane synchroniczne. W przypadku nośników z ograniczoną liczbą cykli zapisu (np. niektórych napędów flash) B<sync> może spowodować skrócenie trwałości nośnika.
uk: Всі операції вводу/виводу файлової системи повинні виконуватися синхронно. У цьому випадку для носіїв із обмеженою кількістю циклів запису (наприклад, деяких флеш-накопичувачів) B<sync> може спричинити скорочення строку роботи.

source: Allow an ordinary user to mount the filesystem. The name of the mounting user is written to the I<mtab> file (or to the private libmount file in I</run/mount> on systems without a regular I<mtab>) so that this same user can unmount the filesystem again. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<user,exec,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen des Dateisystems. Der Name des einhängenden Benutzers wird in die I<mtab>-Datei geschrieben (oder auf Systemen, die keine reguläre I<mtab> haben, in die private Libmount-Datei in I</run/mount>), so dass der gleiche Benutzer das Dateisystem wieder aushängen kann. Diese Option impliziert die Optionen B<noexec>, B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<user,exec,dev,suid>).
fr: Autoriser les utilisateurs ordinaires à monter le système de fichiers. Le nom de l’utilisateur qui a monté le système de fichiers est noté dans le fichier I<mtab> (ou dans le fichier privé I<libmount> de I</run/mount> sur les systèmes sans fichier I<mtab> traditionnel) pour que cet utilisateur puisse le démonter ensuite. Cela entraîne l'utilisation des options B<noexec>, B<nosuid> et B<nodev> (à moins qu'elles ne soient explicitement surchargées, comme dans la ligne d’options B<user,exec,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika. Nazwa montującego użytkownika jest zapisywana do pliku I<mtab> (lub prywatnego pliku libmount w I</run/mount> w systemach bez zwykłego I<mtab>), więc może on ponownie odmontować system plików. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).
uk: Дозволити монтувати файлову систему звичайному користувачеві. Ім'я користувача, який монтує систему, буде записано до файла I<mtab> (або до приватного файла libmount у I</run/mount> у системах без звичайного I<mtab>) так, щоб саме цей користувача міг знову демонтувати файлову систему. Цей параметр неявним чином встановлює параметри B<noexec>, B<nosuid> і B<nodev> (якщо їх не буде перевизначено наступними параметрами, як у рядку параметрів B<user,exec,dev,suid>).

source: Forbid an ordinary user to mount the filesystem. This is the default; it does not imply any other options.
de: verbietet einem gewöhnlichen Benutzer das Einhängen des Dateisystems. Dies ist die Vorgabe, die keine anderen Optionen impliziert.
fr: Ne pas autoriser d'utilisateur ordinaire à monter le système de fichiers. C’est le comportement par défaut ; il n’implique aucune autre option.
pl: Zabrania zwykłemu użytkownikowi montowania systemu plików. Tak jest domyślnie, przy czym nie implikuje to żadnych innych opcji.
uk: Заборонити звичайному користувачеві монтувати файлову систему. Це типова поведінка, яка не встановлює неявним чином ніяких додаткових параметрів.

source: Allow any user to mount and to unmount the filesystem, even when some other ordinary user mounted it. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<users,exec,dev,suid>).
de: erlaubt jedem Benutzer das Ein- und Aushängen des Dateisystems, selbst wenn es bereits ein anderer gewöhnlicher Benutzer eingehängt hat. Diese Option impliziert die Optionen B<noexec>, B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<users,exec,dev,suid>).
fr: Autoriser tous les utilisateurs à monter et démonter le système de fichiers, même quand un autre utilisateur ordinaire l’a monté. Cette option implique les options B<noexec>, B<nosuid> et B<nodev> (sauf s'il y a une surcharge par une option ultérieure, comme dans la ligne d’options B<users,exec,dev,suid>).
pl: Pozwala każdemu użytkownikowi na zamontowanie i odmontowanie tego systemu plików, nawet gdy zamontował go inny, zwykły użytkownik. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).
uk: Дозволити будь-якому користувачеві монтувати і демонтувати файлову систему, навіть якщо її було змонтовано якимось іншим звичайним користувачем. Цей параметр неявним чином встановлює параметри B<noexec>, B<nosuid> і B<nodev> (якщо його не перевизначено наступними параметрами, як у рядку параметрів B<users,exec,dev,suid>).

source: B<X->*
fr: B<X->I<*>
