Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: For more robust and customizable output use B<findmnt>(8), B<especially in your scripts>. Note that control characters in the mountpoint name are replaced with '?'.
de: Für eine robustere und besser anpassbare Ausgabe verwenden Sie B<findmnt>(8), B<speziell in Ihren Skripten>. Beachten Sie, dass Steuerzeichen im Namen des Einhängepunkts durch »?« ersetzt werden.
fr: Pour une sortie plus explicite et paramétrable utilisez B<findmnt>(8), B<en particulier dans les scripts>. Remarquez que les caractères de contrôle dans le nom de point de montage sont remplacés par des « ? ».
pl: Aby uzyskać spójniejsze i dające się konfigurować wyjście, proszę korzystać z B<findmnt>(8), B<w szczególności w swoich skryptach>. Proszę zauważyć, że znaki kontrolne w nazwach punktów montowania są zastępowane znakiem "?".
uk: Для докладнішого та налаштовуваного виведення, B<особливо у власних скриптах>, використовуйте B<findmnt>(8). Зверніть увагу, що символи керування в назві точки монтування замінюються на «?».

source: The option B<-l> adds labels to this listing. See below.
de: Die Option B<-l> fügt Bezeichnungen zu dieser Auflistung hinzu. Siehe unten.
fr: L'option B<-l> ajoute des étiquettes à la liste. Voir plus bas.
pl: Opcja B<-l> ujmuje w zestawieniu również etykiety. Patrz niżej.
uk: Параметр B<-l> додає до цього списку мітки. Див. нижче.

source: Most devices are indicated by a filename (of a block special device), like I</dev/sda1>, but there are other possibilities. For example, in the case of an NFS mount, I<device> may look like I<knuth.cwi.nl:/dir>.
de: Die meisten Geräte werden durch einen Dateinamen (eines blockorientierten Spezialgerätes) bezeichnet, beispielsweise I</dev/sda1>, aber es gibt noch weitere Möglichkeiten. Zum Beispiel kann das I<Gerät> im Fall einer NFS-Einhängung aussehen wie I<knuth.cwi.nl:/dir>.
fr: La plupart des périphériques sont indiqués sous forme de nom de fichier (d'un périphérique bloc spécial), comme I</dev/sda1>, mais d'autres possibilités existent. Par exemple, pour un montage NFS, I<périphérique> peut ressembler à I<knuth.cwi.nl:/dir>.
pl: Większość urządzeń jest wskazywanych przez nazwę pliku (specjalnego urządzenia blokowego), jak np. I</dev/sda1>, lecz istnieją inne możliwości. Na przykład w wypadku montowania NFS, I<urządzenie> może wyglądać tak: I<knuth.cwi.nl:/katalog>.
uk: Більшість пристроїв позначаються назвою файлу (блокового спеціального пристрою), як і I</dev/sda1>, але можливе й інше. Наприклад, у випадку монтування NFS, I<device> може мати вигляд I<knuth.cwi.nl:/dir>.

source: The device names of disk partitions are unstable; hardware reconfiguration, and adding or removing a device can cause changes in names. This is the reason why it's strongly recommended to use filesystem or partition identifiers like UUID or LABEL. Currently supported identifiers (tags):
de: Der Gerätename der Plattenpartitionen ist instabil; der Name kann sich durch die Hardwarekonfiguration oder Hinzufügen bzw. Entfernen eines Gerätes ändern. Aus diesem Grund wird nachdrücklich empfohlen, Dateisystem- oder Partitionsbezeichnungen wie UUID oder BEZEICHNUNG zu verwenden. Folgende Bezeichner (Markierungen) werden derzeit unterstützt:
fr: Les noms de périphérique de partitions de disque ne sont pas immuables. Une reconfiguration matérielle, l’ajout ou le retrait d’un périphérique peuvent provoquer des modifications de noms. C’est pour cela qu’il est fortement recommandé d’utiliser des identificateurs de système de fichiers ou de partition tels que des UUID ou LABEL. Actuellement les identificateurs (mots-clés) gérés sont :
uk: Назви пристроїв розділів диска нестабільні; зміна конфігурації обладнання, а також додавання чи видалення пристрою може призвести до зміни назв. Тому дуже бажано використовувати ідентифікатори файлових систем або розділів, такі як UUID або LABEL. Наразі підтримуються такі ідентифікатори (теги):

source: Note that B<mount>(8) uses UUIDs as strings. The UUIDs from the command line or from B<fstab>(5) are not converted to internal binary representation. The string representation of the UUID should be based on lower case characters.
de: Beachten Sie, dass B<mount>(8) UUIDs als Zeichenketten verwendet. Die UUIDs aus der Befehlszeile oder von B<fstab>(5) werden nicht in die interne Binärdarstellung umgewandelt. Die Zeichenkettendarstellung der UUID sollte Kleinbuchstaben verwenden.
fr: Remarquez que B<mount>(8) utilise les UUID comme des chaînes. Les UUID de la ligne de commande ou dans B<fstab>(5) ne sont pas convertis en représentation binaire interne. La chaîne représentant l'UUID devrait être composée de caractères en minuscules.
pl: Proszę zauważyć, że B<mount>(8) używa UUID-ów jako łańcuchów. UUID-y z wiersza poleceń lub B<fstab>(5) nie są konwertowane do wewnętrznej reprezentacji binarnej. Litery w reprezentacji łańcucha UUID powinny być małymi literami.
uk: Зверніть увагу, що B<mount>(8) використовує UUID як рядки. UUID з рядка команди або з B<fstab>(5) не буде перетворено до внутрішнього двійкового представлення. Представлення рядків UUID повинне базуватися на символах нижнього регістру.

source: Human readable partition identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations It's supported for example for GUID Partition Tables (GPT).
de: Menschenlesbare Partitionsbezeichnung. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs*>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identificateur compréhensible de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations mkfs ou mkswap. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
uk: Зручний для читання ідентифікатор розділу. Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: Partition universally unique identifier. This identifier is independent on filesystem and does not change by mkfs or mkswap operations It's supported for example for GUID Partition Tables (GPT).
de: »Universally unique identifier« (universeller eindeutiger Bezeichner) der Partition. Diese Bezeichnung ist vom Dateisystem unabhängig und wird nicht von B<mkfs*>- oder B<mkswap>-Aktionen geändert. Sie wird beispielsweise für GUID-Partitionstabellen unterstützt (GPT).
fr: Identifiant unique universel de partition. Cet identificateur est indépendant du système de fichiers et n’est pas modifié par des opérations mkfs ou mkswap. Il est géré par exemple pour les tables de partitionnement GUID (GPT).
uk: Універсальний унікальний ідентифікатор розділу. Цей ідентифікатор є незалежним від файлової системи і його не змінюють дії mkfs і mkswap. Його підтримку передбачено, наприклад, для GUID Partition Tables (GPT).

source: Hardware block device ID as generated by udevd. This identifier is usually based on WWN (unique storage identifier) and assigned by the hardware manufacturer. See B<ls /dev/disk/by-id> for more details, this directory and running udevd is required. This identifier is not recommended for generic use as the identifier is not strictly defined and it depends on udev, udev rules and hardware.
de: Hardware-Blockgerätekennung, wie sie von Udevd erzeugt wird. Dieser Kennzeichner basiert normalerweise auf WWN (eindeutiger Speicherkennzeichner) und wird vom Hersteller der Hardware zugewiesen. Siehe B<ls /dev/disk/by-id> für weitere Details; dieses Verzeichnis und ein laufender Udevd wird benötigt. Für den gewöhnlichen Einsatz wird dieser Kennzeichner nicht empfohlen, da er nicht streng definiert ist und von Udev, den Udev-Regeln und der Hardware abhängt.
fr: ID du périphérique bloc matériel tel que créé par IB<udevd>. Cet identificateur est habituellement basé sur WWN (world wide name – identificateur unique de stockage) et affecté par le fabricant du matériel. Consultez B<ls\ /dev/disk/by-id> pour plus de détails ; ce répertoire et l’exécution d’B<udevd> sont nécessaires. Cet identificateur n’est pas recommandé pour un usage général car il n’est pas défini strictement et dépend d’B<udev>, des règles d’B<udev> et du matériel.
uk: Ідентифікатор апаратного блоку, згенерований udevd. Цей ідентифікатор зазвичай базується на WWN (унікальний ідентифікатор сховища) і призначає його виробник обладнання. Додаткову інформацію див. у B<ls /dev/disk/by-id>, цей каталог і запуск udevd необхідні. Цей ідентифікатор не рекомендується для загального використання, оскільки не є строго визначеним і залежить від udev, правил udev та обладнання.

source: The command B<lsblk --fs> provides an overview of filesystems, LABELs and UUIDs on available block devices. The command B<blkid -p E<lt>deviceE<gt>> provides details about a filesystem on the specified device.
de: Der Befehl B<lsblk --fs> bietet einen Überblick über Dateisysteme, BEZEICHNUNGEN und UUIDs auf verfügbaren blockorientierten Geräten. Der Befehl B<blkid -p E<lt>GerätE<gt>> zeigt Details zu einem Dateisystem auf dem angegebenen Gerät an.
fr: La commande B<lsblk --fs> fournit un récapitulatif des systèmes de fichiers, des LABEL et des UUID des périphériques blocs disponibles. La commande B<blkid -p E<lt>périphériqueE<gt>> fournit des détails sur le système de fichiers du périphérique indiqué.
uk: Команда B<lsblk --fs> надає огляд файлових систем, міток та UUID на доступних блокових пристроях. Команда B<blkid -p E<lt>пристрійE<gt>> надає детальну інформацію про файлову систему на вказаному пристрої.

source: Don't forget that there is no guarantee that UUIDs and labels are really unique, especially if you move, share or copy the device. Use B<lsblk -o +UUID,PARTUUID> to verify that the UUIDs are really unique in your system.
de: Vergessen Sie nicht, dass es keine Garantie dafür gibt, dass UUIDs und Bezeichnungen wirklich eindeutig sind, insbesondere wenn Sie ein Gerät verschieben, freigeben oder kopieren. Mit B<lsblk -o +UUID,PARTITIONS-UUID> können Sie sicherstellen, dass die UUIDs in Ihrem System wirklich eindeutig sind.
fr: N’oubliez pas que les UUID et étiquettes ne sont pas garantis uniques, en particulier si vous déplacez, partagez ou copiez le périphérique. Utilisez B<lsblk -o +UUID,PARTUUID> pour vérifier que les UUID sont vraiment uniques sur le système.
pl: Proszę nie zapomnieć o tym, że nie ma gwarancji, że etykiety i UUID-y są faktycznie unikalne, szczególnie jeśli kopiuje się, współdzieli lub przenosi urządzenie. Polecenie B<lsblk -o +UUID,PARTUUID> pozwoli na zweryfikowanie unikalności UUID-ów w bieżącym systemie.
uk: Пам'ятайте, що унікальні UUID та міток не гарантована, особливо якщо ви переміщуєте, надаєте спільний доступ або копіюєте пристрій. Щоб переконатися, що UUID у вашій системі дійсно унікальні, скористайтесь B<lsblk -o +UUID,PARTUUID>.

source: The recommended setup is to use tags (e.g.\& B<UUID=>I<uuid>) rather than I</dev/disk/by-{label,uuid,id,partuuid,partlabel}> udev symlinks in the I</etc/fstab> file. Tags are more readable, robust and portable. The B<mount>(8) command internally uses udev symlinks, so the use of symlinks in I</etc/fstab> has no advantage over tags. For more details see B<libblkid>(3).
de: Wir empfehlen die Verwendung von Markierungen (z.\&B.\& B<UUID=>I<UUID>) anstelle Udev-Symlinks der Form I</dev/disk/by-{Bezeichnung,UUID,Partitions-UUID,Partitionsbezeichnung}> in der Datei I</etc/fstab>. Markierungen sind besser lesbar, robuster und besser portierbar. Der Befehl B<mount>(8) verwendet intern Udev-Symlinks, daher hat die Verwendung von Symlinks in der Datei I</etc/fstab> keinerlei Vorteile gegenüber Markierungen. Für weitere Details siehe B<libblkid>(3).
fr: La configuration conseillée est d'utiliser des mots-clés (par exemple, B<UUID=>I<uuid>) plutôt que les liens symboliques I</dev/disk/par->{I<label>,I<uuid>,I<partuuid>,I<partlabel>} d'B<udev> dans le fichier I</etc/fstab>. Les mots-clés sont plus facilement lisibles, explicites et portables. La commande B<mount>(8) utilise les liens symboliques d'B<udev> en interne, donc les utiliser directement dans I</etc/fstab> n'apporte aucun avantage par rapport aux mots-clés. Pour plus de précisions, consultez B<libblkid>(3).
uk: Рекомендовано використовувати у файлі I</etc/fstab> теги (наприклад,\& B<UUID=>I<uuid>), а не символьні посилання I</dev/disk/by-{label,uuid,id,partuuid,partlabel}> udev. Теги зручніші для читання, надійніші та портативніші. Команда B<mount>(8) внутрішньо використовує символьні посилання udev, тому використання символьних посилань у I</etc/fstab> не має переваг перед тегами. Детальніше див. B<libblkid>(3).

source: The I<proc> filesystem is not associated with a special device, and when mounting it, an arbitrary keyword\(emfor example, I<proc>\(emcan be used instead of a device specification. (The customary choice I<none> is less fortunate: the error message `none already mounted' from B<mount> can be confusing.)
de: Das Dateisystem I<proc> ist keinem speziellen Gerät zugeordnet. Wenn Sie es einhängen, kann ein willkürlich gewähltes Schlüsselwort wie beispielsweise I<proc> anstelle der Angabe eines Gerätes verwendet werden. Die gebräuchliche Wahl I<none> ist weniger sinnvoll: Die Fehlermeldung von B<mount> »none ist bereits eingehängt« kann verwirrend sein.
fr: Le système de fichiers I<proc> n'est associé à aucun périphérique spécial, et pour le monter, un mot-clé quelconque, par exemple I<proc>, peut être utilisé à la place de l'indication de périphérique. Le choix courant B<none> (aucun) n'est pas très heureux, car le message d'erreur « none déjà monté » de B<mount> peut être mal interprété.
uk: Файлова система I<proc> не пов'язана зі спеціальним пристроєм, і під час її монтування замість специфікації пристрою може використовуватися довільне ключове слово, наприклад, I<proc>. (Звичний вибір I<none> не дуже вдалий: повідомлення B<mount> про помилку `none вже змонтовано' може збити з пантелику.)

source: The file I</etc/fstab> (see B<fstab>(5)), may contain lines describing what devices are usually mounted where, using which options. The default location of the B<fstab>(5) file can be overridden with the B<--fstab>I< path> command-line option (see below for more details).
de: Die Datei I</etc/fstab> (siehe B<fstab>(5)) kann Zeilen enthalten, die beschreiben, welche Geräte üblicherweise wo und mit welchen Optionen eingehängt werden. Der Standardort der Datei B<fstab>(5) kann mit der Befehlszeilenoption B<--fstab>I< Pfad> außer Kraft gesetzt werden (siehe unten für weitere Details).
fr: Le fichier I</etc/fstab> (consultez B<fstab>(5)) contient des lignes décrivant les périphériques habituellement montés, leur point de montage et leurs options. L’emplacement par défaut du fichier B<fstab>(5) peut être remplacé par l’option B<--fstab> I<chemin> en ligne de commande (voir ci-dessous pour plus de précisions).
pl: Plik I</etc/fstab> (zobacz B<fstab>(5)), może zawierać wiersze opisujące, jakie urządzenia gdzie są zazwyczaj montowane i przy użyciu jakich opcji. Domyślne położenie pliku B<fstab>(5) można przesłonić opcją wiersza poleceń B<--fstab> I<ścieżka> (więcej szczegółów poniżej).
uk: Файл I</etc/fstab> (див. B<fstab>(5)), може містити рядки, що описують, які пристрої переважно тут монтуються, за допомогою яких параметрів. Типове розташування файлу B<fstab>(5) можна змінити параметром командного рядка B<--fstab> I<шлях> (див. нижче про подробиці).

source: (usually given in a bootscript) causes all filesystems mentioned in I<fstab> (of the proper type and/or having or not having the proper options) to be mounted as indicated, except for those whose line contains the B<noauto> keyword. Adding the B<-F> option will make B<mount> fork, so that the filesystems are mounted in parallel.
de: (üblicherweise in einem Systemstartskript übergeben) führt dazu, dass alle in I<fstab> aufgeführten Dateisysteme (des korrekten Typs und/oder mit oder ohne korrekte Optionen) wie angegeben eingehängt werden, außer jene, deren Zeile das Schlüsselwort B<noauto> enthält. Mit der Option B<-F> wird B<mount> geforkt, so dass die Dateisysteme parallel eingehängt werden.
fr: (généralement exécutée dans un script de démarrage) monte tous les systèmes de fichiers indiqués dans I<fstab> (uniquement ceux du I<type> indiqué et possédant ou non les bonnes options), sauf ceux dont la ligne contient le mot-clé B<noauto>. En ajoutant l'option B<-F>, B<fork>(2) sera invoqué par B<mount> pour que tous les systèmes de fichiers soient montés en parallèle.
pl: (zwykle podawane w skryptach startowych) powoduje zamontowanie wszystkich systemów plików (danego typu) wymienionych w I<fstab>, poza tymi, których wpisy zawierają słowo kluczowe B<noauto>. Podanie opcji B<-F> spowoduje, że B<mount> się rozdzieli na kilka procesów, tak że systemy plików będą montowane równocześnie.
uk: (зазвичай, задають у скрипті завантаження) спричиняє монтування усіх згаданих файлових систем в I<fstab> (належного типу і/або таких, що мають або не мають належні параметри) так, як вказано, окрім тих, у рядку яких міститься ключове слово B<noauto>. Додавання параметра B<-F> призведе до розгалуження B<mount> для паралельного монтування файлових систем.

source: The programs B<mount> and B<umount> traditionally maintained a list of currently mounted filesystems in the file I</etc/mtab>. The support for regular classic I</etc/mtab> is completely disabled at compile time by default, because on current Linux systems it is better to make I</etc/mtab> a symlink to I</proc/mounts> instead. The regular I<mtab> file maintained in userspace cannot reliably work with namespaces, containers and other advanced Linux features. If the regular I<mtab> support is enabled, then it's possible to use the file as well as the symlink.
de: Die Programme B<mount> und B<umount> haben traditionell eine Liste der aktuell eingehängten Dateisysteme in der Datei I</etc/mtab> verwaltet. Die Unterstützung für die reguläre klassische Datei I</etc/mtab> ist bei der Kompilierung standardmäßig deaktiviert, da es auf aktuellen Linux-Systemen besser ist, stattdessen einen Symlink auf I</proc/mounts> zu legen. Die reguläre, auf Anwendungsebene verwaltete I<mtab>-Datei kann nicht zuverlässig mit Namensräumen, Containern und weiteren anspruchsvollen Linux-Funktionen umgehen. Falls die reguläre I<mtab>-Unterstützung aktiviert ist, dann ist es möglich, die Datei auch als Symlink zu verwenden.
fr: Les programmes B<mount> et B<umount> entretiennent normalement une liste des systèmes de fichiers actuellement montés dans le fichier I</etc/mtab>. La prise en charge du fichier classique habituel I</etc/mtab> est par défaut complètement désactivée au moment de la compilation, parce que sur les systèmes Linux actuels, il est plutôt préférable de faire de I</etc/mtab/> un lien symbolique vers I</proc/mounts>. Le fichier I<mtab> habituel entretenu en espace utilisateur ne peut pas fonctionner de façon fiable avec les espaces de noms, les conteneurs et autres fonctionnalités avancées de Linux. Si la prise en charge du I<mtab> habituel est activée, alors il est possible d’utiliser le fichier comme le lien symbolique.
uk: Програми B<mount> і B<umount> традиційно підтримували список поточних змонтованих файлових систем у файлі I</etc/mtab>. Підтримку звичайного класичного I</etc/mtab> типово повністю вимкнено під час компіляції, тому що в поточних системах Linux краще зробити I</etc/mtab> символьним посиланням на I</proc/mounts>. Звичайний файл I<mtab>, який зберігається в просторі користувача, не може надійно працювати з просторами назв, контейнерами та іншими розширеними функціями Linux. Якщо ввімкнено звичайну підтримку I<mtab>, то можна використовувати як файл, так і символьне посилання.

source: B<mount>I< device>|I<dir >B<-o>I< options>
de: B<mount>I< Gerät>|I<Verzeichnis >B<-o>I< Optionen>
fr: B<mount> I<périphérique>|I<répertoire> B<-o> I<options>
pl: B<mount>I< urządzenie>|I<katalog >B<-o>I< opcje>
uk: B<mount>I< пристрій>|I<каталог >B<-o>I< параметри>

source: and then the mount options from the command line will be appended to the list of options from I</etc/fstab>. This default behaviour can be changed using the B<--options-mode> command-line option. The usual behavior is that the last option wins if there are conflicting ones.
de: Dann werden die Einhängeoptionen aus der Befehlszeile an die Liste der Optionen aus I</etc/fstab> angehängt. Dieses Standardverhalten können Sie mit der Befehlszeilenoption B<--options-mode> ändern. Standardmäßig wird die zuletzt angegebene Option gewählt, falls es Konflikte innerhalb der Optionen gibt.
fr: et ensuite les options de montage de la ligne de commande seront ajoutées à la liste des options de I</etc/fstab>. Ce comportement par défaut peut être modifié avec l’option de ligne de commande, B<--options-mode>. Le comportement normal est que la dernière option est prioritaire en cas de conflit.
uk: а потім параметри монтування з командного рядка буде додано до списку параметрів із I</etc/fstab>. Цю типову поведінку можна змінити за допомогою параметра командного рядка B<--options-mode>. Звичайна поведінка полягає в тому, що останній варіант перемагає, якщо є суперечливі.

source: The B<mount> program does not read the I</etc/fstab> file if both I<device> (or LABEL, UUID, ID, PARTUUID or PARTLABEL) and I<dir> are specified. For example, to mount device B<foo> at B</dir>:
de: Das Programm B<mount> liest die Datei I</etc/fstab> nicht, wenn sowohl das I<Gerät> (oder LABEL, UUID, ID, PARTUUID oder PARTLABEL) als auch das I<Verzeichnis> angegeben sind. Zum Beispiel können Sie das Gerät B<foo> in das B</Verzeichnis> folgendermaßen einhängen:
fr: Le programme B<mount> ne lit pas le fichier I</etc/fstab> si le I<périphérique> (ou LABEL, UUID, PARTUUID ou PARTLABEL) et le I<répertoire> sont indiqués tous les deux. Par exemple, pour monter le périphérique I<toto> dans I</répertoire> :
pl: Program B<mount> nie odczytuje pliku I</etc/fstab> jeśli podano I<urządzenie> (lub LABEL, UUID, ID, PARTUUID lub PARTLABEL) oraz I<katalog>. Na przykład, aby zamontować urządzenie B<foo> w B</katalogu>:
uk: Програма B<mount> не читає файлу I</etc/fstab>, якщо вказано разом I<пристрій> (або LABEL, UUID, ID, PARTUUID або PARTLABEL) і I<каталог>. Наприклад, щоб встановити пристрій B<foo> на B</dir>:

source: This default behaviour can be changed by using the B<--options-source-force> command-line option to always read configuration from I<fstab>. For non-root users B<mount> always reads the I<fstab> configuration.
de: Dieses Standardverhalten können Sie mit der Befehlszeilenoption B<--options-source-force> ändern, so das die Konfiguration immer aus der Fstab-Datei gelesen wird. Für Benutzer ohne Root-Rechte liest B<mount> immer die I<fstab>-Konfiguration.
fr: Ce comportement par défaut est modifiable avec l’option de ligne de commande, B<--options-source-force>, pour toujours lire la configuration à partir de I<fstab>. Pour les utilisateurs ordinaires, B<mount> lit toujours la configuration dans I<fstab>.
uk: За допомогою параметра командного рядка B<--options-source-force> цю типову поведінку можна змінити, щоб завжди читати конфігурацію з I<fstab>. Для користувачів, які не мають права root, B<mount> завжди читає конфігурацію I<fstab>.
