Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The "xino" feature composes a unique object identifier from the real object st_ino and an underlying fsid index. The "xino" feature uses the high inode number bits for fsid, because the underlying filesystems rarely use the high inode number bits. In case the underlying inode number does overflow into the high xino bits, overlay filesystem will fall back to the non xino behavior for that inode.
de: Die Funktionalität »xino« setzt einen eindeutigen Objektkennzeichner aus dem echten Objekt st_ino und einem zugrundeliegenden fsid-Index zusammen. Die Funktionalität »xino« verwendet die hohen Inode-Nummern-Bits für fsid, da das zugrundeliegende Dateisystem selten die hohen Inode-Nummer-Bits verwendet. In den Fällen, in denen die zugrundeliegende Inode-Nummer in die hohen Xino-Bits überläuft, wird das Überlagerungsdateisystem auf das Verhalten ohne xino für diese Inode zurückfallen.
fr: La fonctionnalité « xino » compose un identifiant d'objet unique à partir de l'objet réel st_ino et de l'index fsid sous-jacent. Cette fonctionnalité utilise les bits de numéro d'inœud élevé pour fsid, parce que les systèmes de fichiers sous-jacents utilisent rarement les bits de numéro d'inœud élevé. Au cas où le numéro d'inœud élevé sous-jacent déborde dans les bits élevés de xino, le système de fichiers overlay retournera au comportement sans xino pour cet inœud.
uk: Можливість «xino» створює унікальний ідентифікатор об'єкта зі st_ino справжнього об'єкта та базового індексу fsid. У можливості «xino» використано вищі біти числа inode для fsid, оскільки у базових файлових системах не часто використовують вищі біти числа inode. У випадку базове число inode переповнює до вищих бітів xino, накладена файлова система повернеться до резервної поведінки без xino для цього inode.

source: For a detailed description of the effect of this option please refer to
de: Für eine detaillierte Beschreibung des Effekts dieser Option, siehe
fr: Pour une description détaillée des effets de cette option, veuillez vous référer à
uk: Докладний опис наслідків використання цього параметра наведено у

source: When metadata only copy up feature is enabled, overlayfs will only copy up metadata (as opposed to whole file), when a metadata specific operation like chown/chmod is performed. Full file will be copied up later when file is opened for WRITE operation.
de: Wenn die Funktion zum alleinigen Hochkopieren von Metadaten aktiviert ist, kopiert das Überlagerungs-Dateisystem nur die Metadaten (und nicht die ganze Datei), wenn eine Metadaten-spezifische Aktion wie »chown« oder »chmod« ausgeführt wird. Die vollständige Datei wird später hochkopiert, sobald die Datei für eine WRITE-Aktion geöffnet ist.
fr: Quand la fonctionnalité de copie des métadonnées uniquement est activée, le système de fichiers overlay ne copiera que les métadonnées (à l'opposé de la copie du fichier entier) quand une opération spécifique aux métadonnées telle que chown/chmod est réalisée. Le fichier complet sera copié plus tard lorsque le fichier est ouvert pour une opération B<WRITE>.
uk: Якщо увімкнено можливість надкопіювання лише метаданих, overlayfs надкопіюватиме лише метадані (а не увесь файл), коли буде виконано специфічну для метаданих дію, наприклад зміну власника чи режиму доступу. Увесь файл буде надкопійовано пізніше, коли файл буде відкрито для дії WRITE.

source: In other words, this is delayed data copy up operation and data is copied up when there is a need to actually modify data.
de: Mit anderen Worten ist dies eine verzögerte Datenkopieroperation, und Daten werden erst hochkopiert, wenn tatsächlich Daten geändert werden müssen.
fr: En d'autres termes, c'est une opération de copie de données différée et les données sont copiées quand il est nécessaire de vraiment les modifier.
uk: Іншими словами, це відкладена дія з надкопіювання даних і дані буде надкопійовано, якщо виникне потреба у справжньому внесенні змін до даних.

source: Volatile mounts are not guaranteed to survive a crash. It is strongly recommended that volatile mounts are only used if data written to the overlay can be recreated without significant effort.
de: Für flüchtige Einhängungen kann nicht garantiert werden, dass sie einen Absturz überstehen. Es wird dringend empfohlen, flüchtige Einhängungen nur dann zu verwenden, wenn die in die Überlagerung geschriebenen Daten ohne nennenswerten Aufwand wiederhergestellt werden können.
fr: Il n'est pas garanti que les montages volatils survivent à un plantage. Il est fortement recommandé de n'utiliser les montages volatils que si les données écrites sur l'overlay peuvent être recréées sans effort significatif.
uk: Тимчасові монтування можуть не пережити аварійного завершення роботи системи. Наполегливо рекомендуємо користуватися тимчасовими монтуванням, лише якщо дані, які записано до накладки, може бути відтворено без значних зусиль.

source: The advantage of mounting with the "volatile" option is that all forms of sync calls to the upper filesystem are omitted.
de: Der Vorteil des Einhängens mit der »volatile«-Option ist, dass alle Arten von Sync-Aufrufen zum oberen Dateisystem weggelassen werden.
fr: L'avantage d'un montage avec l'option « volatile » est que toutes les formes d'appel de synchronisation vers le système de fichiers supérieur sont omises.
uk: Перевагою монтування із параметром «volatile» є те, що усі форми викликів синхронізації до вищої файлової системи буде пропущено.

source: When overlay is mounted with "volatile" option, the directory "$workdir/work/incompat/volatile" is created. During next mount, overlay checks for this directory and refuses to mount if present. This is a strong indicator that user should throw away upper and work directories and create fresh one. In very limited cases where the user knows that the system has not crashed and contents of upperdir are intact, The "volatile" directory can be removed.
de: Wenn die Überlagerung mit der »volatile«-Option eingehängt wird, dann wird das Verzeichnis »$workdir/work/incompat/volatile« erstellt. Während der nächsten Einhängung prüft die Überlagerung, ob dieses Verzeichnis vorhanden ist und verweigert das Einhängen, falls es existiert. Dies ist ein untrügliches Zeichen, dass der Benutzer das obere und das Arbeitsverzeichnis verwerfen und ein neues erstellen sollte. In sehr seltenen Fällen, in denen der Benutzer weiß, dass das System nicht abgestürzt war und der Inhalt des oberen Verzeichnisses intakt ist, kann das »volatile«-Verzeichnis entfernt werden.
fr: Quand un overlay est monté avec l'option B<volatile>, le répertoire « $workdir/work/incompat/volatile » est créé. Lors du montage suivant, l'overlay vérifie l'existence de ce répertoire et refuse le montage s'il est présent. C'est un indicateur fort que l'utilisateur devrait supprimer les répertoires supérieur et de travail et en créer de nouveaux. Dans les cas très rares où l'utilisateur sait que le système n'a pas planté et que le contenu du répertoire supérieur est intact, le répertoire « volatile » peut être supprimé.
uk: Якщо накладку змонтовано з параметром «volatile», буде створено каталог «$workdir/work/incompat/volatile». Під час наступного монтування накладка шукатиме цей каталог і відмовиться монтуватися, якщо його буде знайдено. Це потужний індикатор, що користувачеві слід відкинути старий вищий і робочий каталоги і створити нові. У дуже обмеженій кількості випадків, коли користувач знає, що роботу системи не було завершено аварійно і вміст вищого каталогу не зазнав змін, каталог «volatile» можна вилучити.

source: Mount options for reiserfs
de: Einhängeoptionen für Reiserfs
fr: Options de montage pour reiserfs
pl: Opcje montowania do reiserfs
uk: Параметри монтування reiserfs

source: Reiserfs is a journaling filesystem.
de: Reiserfs ist ein Journaling-Dateisystem.
fr: Reseirfs est un système de fichiers journalisé.
pl: Reiserfs jest systemem plików z dziennikiem.
uk: Reiserfs є журнальованою файловою системою.

source: Instructs version 3.6 reiserfs software to mount a version 3.5 filesystem, using the 3.6 format for newly created objects. This filesystem will no longer be compatible with reiserfs 3.5 tools.
de: weist die Version 3.6 der Reiserfs-Software an, ein Dateisystem der Version 3.5 mit dem Format 3.6 für neu erstellte Objekte einzuhängen. Dieses Dateisystem ist dann nicht mehr zu den Reiserfs-Werkzeugen der Version 3.5 kompatibel.
fr: Indiquer à la version 3.6 de ReiserFS de monter un système de fichiers de la version 3.5 et d'utiliser le format 3.6 pour les nouveaux objets. Ce système de fichiers ne sera plus compatible avec les outils ReiserFS 3.5.
pl: Mówi wersji 3.6 oprogramowania reiserfs, aby zamontowała wersję 3.5 systemu plików, używając formatu 3.6 dla nowo utworzonych plików. Ten system plików nie będzie już zgodny z wersją 3.5 narzędzi reiserfs.
uk: Наказує версії 3.6 програмного забезпечення reiserfs змонтувати файлову систему 3.5 з використанням формату 3.6 для новостворених об'єктів. Ця файлова система стане несумісною із інструментами reiserfs 3.5.

source: Choose which hash function reiserfs will use to find files within directories.
de: bestimmt, welche Hash-Funktion von Reiserfs verwendet wird, um Dateien in Verzeichnissen zu finden.
fr: Choisir la fonction de hachage dont reiserfs usera pour retrouver les fichiers dans les répertoires.
pl: Wybiera funkcję mieszającą (haszującą) do znajdowania plików w katalogach.
uk: Вибрати функцію обчислення хеш-сум, якою reiserfs користуватиметься для пошуку файлів у каталогах.

source: A hash invented by Yury Yu. Rupasov. It is fast and preserves locality, mapping lexicographically close file names to close hash values. This option should not be used, as it causes a high probability of hash collisions.
de: ist ein von Yury Yu. Rupasov entwickelter Hash. Er ist schnell und erhält Lokalität, wobei lexikographisch nahe Dateinamen zu nahen Hash-Werten zugeordnet werden. Diese Option sollte nicht verwendet werden, da sie die Wahrscheinlichkeit von Hash-Kollisionen erhöht.
fr: Une fonction de hachage inventée par Yuri Yu. Rupasov, rapide et préservant la localité, mappant les noms de fichiers proches lexicographiquement vers des valeurs de hachage proches. Ne devrait pas être utilisée à cause de probabilités élevées de collisions de hachage.
pl: Funkcja haszująca autorstwa Yury Yu. Rupasova. Jest szybka i zachowuje lokalizację, mapując nazwy plików bliskie w porządku leksykograficznym na bliskie sobie wartości funkcji. Z powodu wysokiego prawdopodobieństwa kolizji w haszowaniu, ta opcja nie powinna być używana.
uk: Хеш, який винайдено Юрієм Ю. Рупасовим. Він є швидким і зберігає локальність, відображаючи лексикографічно близькі назви файлів у близькі значення хеш-сум. Не слід користуватися цим параметром, оскільки він спричиняє високу ймовірність збігів хеш-збігів.

source: A Davis-Meyer function implemented by Jeremy Fitzhardinge. It uses hash permuting bits in the name. It gets high randomness and, therefore, low probability of hash collisions at some CPU cost. This may be used if B<EHASHCOLLISION> errors are experienced with the r5 hash.
de: ist eine von Jeremy Fitzhardinge implementierte Davis-Meyer-Funktion. Sie verwendet Hash-permutierende Bits im Namen. Sie erhält hohe Zufälligkeit und daher eine geringe Wahrscheinlichkeit von Hash-Kollisionen, was aber auf Kosten der Prozessorlast geht. Dies kann verwendet werden, wenn mit dem r5-Hash B<EHASHCOLLISION>-Fehler auftreten.
fr: Une fonction de Davis-Meyer implémentée par Jeremy Fitzhardinge. Elle utilise des permutations de bits de hachage dans les noms. Elle procure un grand caractère aléatoire et donc de faibles probabilités de collision de hachage, au prix d'un certain coût processeur. Elle peut être utilisée si des erreurs B<EHASHCOLLISION> se produisent avec la fonction de hachage r5.
pl: Funkcja Davis-Meyera zaimplementowana przez Jeremy'ego Fitzhardinge'a. Używa mieszania permutującego bity w nazwie pliku. Wykazuje dużą losowość wyników i teoretycznie małe prawdopodobieństwo kolizji. Może być używana, jeżeli funkcja r5 powoduje błędy B<EHASHCOLLISION>.
uk: Функція Девіса-Меєра, яку реалізовано Джеремі Фітцгардінгом. У ній використано біти, які змінюють хеш-суму у назві. Має високий рівень псевдовипадковості, а отже, низьку ймовірність збігів хеш-сум за рахунок певного навантаження на процесор. Може бути використано, якщо виникають помилки B<EHASHCOLLISION> у хеш-сумах r5.

source: A modified version of the rupasov hash. It is used by default and is the best choice unless the filesystem has huge directories and unusual file-name patterns.
de: ist eine angepasste Version des Rupasov-Hashs. Sie wird standardmäßig verwendet und ist die beste Wahl, es sei denn, das Dateisystem hat riesige Verzeichnisse und ungewöhnliche Dateinamensmuster.
fr: Une version modifiée de la fonction hachage de rupasov. Elle est utilisée par défaut et semble être le meilleur choix sauf si le système de fichiers a d'énormes répertoires et des motifs de nom de fichier non habituels.
pl: Zmodyfikowana wersja funkcji rupasov. Używana domyślnie i jest najlepszym wyborem, jeżeli system plików nie zawiera dużych katalogów i niezwykłych nazw plików.
uk: Змінена версія хеш-сум Рупасова. Є типовою і є найкращим вибором, якщо у системі немає величезних каталогів і незвичних шаблонів назв файлів.

source: Instructs B<mount> to detect which hash function is in use by examining the filesystem being mounted, and to write this information into the reiserfs superblock. This is only useful on the first mount of an old format filesystem.
de: weist I<mount> an, durch Untersuchung des einzuhängenden Dateisystems zu erkennen, welche Hash-Funktion verwendet wird und diese Information in den Reiserfs-Superblock zu schreiben. Dies ist nur beim ersten Einhängen eines Dateisystems des alten Formats nützlich.
fr: Demander à B<mount> de rechercher la fonction de hachage à utiliser en examinant le système de fichiers à monter, et d'écrire cette information dans le superbloc ReiserFS. Cela ne sert qu'au premier montage d'un système de fichiers d'un ancien format.
pl: Powoduje, że B<mount> wykryje, która funkcja mieszająca jest używana, sprawdzając właśnie montowany system plików, i zapisze tę informację w superbloku systemu reiserfs. Ta opcja jest użyteczna przy pierwszym montowaniu systemu plików o starym formacie.
uk: Наказує B<mount> виявити хеш-функцію, яку використано, шляхом інспектування файлової системи, монтування якої виконується, і записати ці дані до суперблоку reiserfs. Корисний лише під час першого монтування файлової системи у застарілому форматі.

source: Tunes the block allocator. This may provide performance improvements in some situations.
de: stellt den Block-Zuweiser ein. Dies kann in einigen Situationen die Performance verbessern.
fr: Ajuster l'allocation de blocs. Peut améliorer les performances dans certaines situations.
pl: Stroi mechanizm przydzielania bloków. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.
uk: Коригує поведінку засобу розміщення блоків. Може збільшити швидкодію у певних випадках.

source: Disable the border allocator algorithm invented by Yury Yu. Rupasov. This may provide performance improvements in some situations.
de: deaktiviert den von Yuri Yu. Rupasov entwickelten Begrenzungszuweiser-Algorithmus. Dies kann in einigen Situationen die Performance verbessern.
fr: Désactiver l'algorithme d'allocation « border » de Yury Yu. Rupasov. Cela peut améliorer les performances dans certaines situations.
pl: Wyłącza algorytm przydzielania granicznego wymyślony przez Yury'ego Yu. Rupasova. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.
uk: Вимкнути алгоритм розміщення на межі, який винайдено Юрієм Ю. Рупасовим. Може у певних ситуаціях підвищити швидкодію.

source: Disable journaling. This will provide slight performance improvements in some situations at the cost of losing reiserfs\(cqs fast recovery from crashes. Even with this option turned on, reiserfs still performs all journaling operations, save for actual writes into its journaling area. Implementation of I<nolog> is a work in progress.
de: deaktiviert das Journaling. Dadurch werden in einigen Situationen geringfügige Verbesserungen der Performance erreicht, wobei aber die Fähigkeit von Reiserfs zur schnellen Wiederherstellung nach Abstürzen verloren geht. Selbst wenn diese Option aktiviert ist, führt Reiserfs alle Journaling-Aktionen aus außer dem tatsächlichen Schreiben in seinem Journaling-Bereich. An der Implementation von I<nolog> wird noch gearbeitet.
fr: Désactiver la journalisation. Améliore légèrement les performances dans certains cas en perdant la possibilité de récupération rapide après un plantage. Même avec cette option, ReiserFS effectue encore toutes les opérations de journalisation sauf l'écriture effective dans la zone journal. L'implémentation de B<nolog> est en cours.
pl: Wyłącza dziennik. Może w pewnych sytuacjach spowodować nieznaczne podniesienie wydajności systemu kosztem utracenia szybkiego odzyskiwania danych po krachu systemu. Nawet jeśli ta opcja jest włączona, reiserfs wciąż przeprowadza wszystkie operacje związane z dziennikiem, ale go nie zapisuje. Prace przy implementacji opcji I<nolog> wciąż trwają.
uk: Вимкнути журналювання. Це дещо підвищить швидкодію у певних ситуаціях ціною втрати можливості reiserfs щодо швидкого відновлення після аварій. Навіть якщо цей параметр буде увімкнено, reiserfs все одно виконуватиме усі дії з журналювання, окрім самого запису до своєї області журналювання. Реалізація I<nolog> усе ще триває.

source: By default, reiserfs stores small files and \(aqfile tails\(aq directly into its tree. This confuses some utilities such as B<lilo>(8). This option is used to disable packing of files into the tree.
de: deaktiviert das Packen von Dateien im Dateibaum. Standardmäßig speichert Reiserfs kleine Dateien und Dateienden direkt in seinem Baum. Das verwirrt einige Dienstprogramme wie B<lilo>(8).
fr: Par défaut, ReiserFS stocke les petits fichiers et les queues de fichiers (« files tails ») directement dans son arborescence. Cela perturbe certains utilitaires comme B<lilo>(8). Cette option désactive le groupement de fichiers dans l'arborescence.
uk: Типово, reiserfs зберігає малі файли і «хвостики файлів» безпосередньо у своїй ієрархії. Це призводить до помилок у деяких допоміжних програмах, зокрема B<lilo>(8). За допомогою цього параметра можна вимкнути пакування файлів до ієрархії.

source: Replay the transactions which are in the journal, but do not actually mount the filesystem. Mainly used by I<reiserfsck>.
de: wiederholt die im Journal befindlichen Transaktionen, aber hängt das Dateisystem nicht wirklich ein. Dies wird hauptsächlich von I<reiserfsck> verwendet.
fr: Rejouer les transactions du journal, sans monter le système de fichiers. Principalement utilisé par B<reiserfsck>.
pl: Powtarza transakcje zapisane w dzienniku, ale nie montuje systemu plików. Głównie używane przez I<reiserfsck>.
uk: Відтворити операції, які записано до журналу, але не монтувати саму файлову систему. В основному, для використання у I<reiserfsck>.

source: B<resize=>I<number>
de: B<resize=>I<Anzahl>
fr: B<resize=>I<nombre>
pl: B<resize=>I<liczba>
uk: B<resize=>I<число>

source: A remount option which permits online expansion of reiserfs partitions. Instructs reiserfs to assume that the device has I<number> blocks. This option is designed for use with devices which are under logical volume management (LVM). There is a special I<resizer> utility which can be obtained from
de: erlaubt beim Wiedereinhängen die Online-Erweiterung von Reiserfs-Partitionen. Reiserfs wird angewiesen, dass es davon ausgehen soll, dass das Gerät die angegebene I<Anzahl> Blöcke hat. Diese Option ist für Geräte gedacht, die Teil einer logischen Datenträgerverwaltung sind (unter »Logical Volume Management« stehen). Es gibt ein spezielles I<resizer>-Dienstprogramm, das verfügbar ist auf
fr: Option de remontage permettant l'extension, en cours d'utilisation, d'une partition ReiserFS. Demande à ReiserFS de supposer que le périphérique a le I<nombre> de blocs indiqué. À utiliser avec des périphériques sous gestion par volumes logiques (LVM). Un utilitaire spécial B<resizer> est disponible sur
pl: Opcje remontowania, która pozwala na rozszerzenie partycji reiserfs. Z tą opcją reiserfs przyjmuje, że na urządzeniu jest I<liczba> bloków. Opcja jest używana z urządzeniami zarządzanymi przez menedżera logicznych woluminów (LVM). Istnieje specjalne narzędzie I<resizer>, które można pobrać z
uk: Параметр повторного монтування, який уможливлює інтерактивне розширення розділів reiserfs. Наказує reiserfs припускати, що у пристрої I<число> блоків. Цей параметр розроблено для пристроїв, які перебувають під керуванням логічними томами (LVM). Передбачено спеціальну допоміжну програму I<resizer>, яку можна отримати з

source: I<Enable Extended User Attributes. See the >B<attr>I<(1) manual page.>
de: I<aktiviert die erweiterten Benutzerattribute (»Extended User Attributes«). Siehe die Handbuchseite> B<attr>(1).
fr: I<Activer les attributs étendus. Consultez la page de manuel> B<attr>(1).
pl: I<Włącza rozszerzone atrybuty użytkownika (Extended User Attributes). Patrz strona podręcznika> B<attr>(1).
uk: I<Увімкнути розширені атрибути користувача. Див. сторінку підручника >B<attr>I<(1).>

source: I<Enable POSIX Access Control Lists. See the >B<acl>I<(5) manual page.>
de: I<aktiviert die POSIX-Zugriffssteuerlisten. Siehe die Handbuchseite> B<acl>(5).
fr: I<Activer les listes de contrôle d'accès (ACL). Consultez la page de manuel> B<acl>(5).
pl: I<Włącza listy kontroli dostępu (Access Control Lists) POSIX. Patrz strona podręcznika> B<acl>(5).
uk: I<Увімкнути списки керування доступом (ACL) POSIX. Див. сторінку підручника >B<acl>I<(5).>
