Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: This will cause the contents which previously appeared under I<olddir> to now be accessible under I<newdir>. The physical location of the files is not changed. Note that I<olddir> has to be a mountpoint.
de: Dadurch wird der Inhalt, der vorher unter I<Altes_Verzeichnis> erschien, unter I<Neues_Verzeichnis> sichtbar. Der physische Ort der Dateien ändert sich dadurch nicht. Beachten Sie, dass I<Altes_Verzeichnis> ein Einhängepunkt sein muss.
fr: Cela rendra le contenu de ce qui apparaissait jusqu'à présent sous l'I<ancien_répertoire> maintenant accessible sous le I<nouveau_répertoire>. L'emplacement physique des fichiers n'est pas modifié. Remarquez que l'I<ancien_répertoire> doit être un point de montage.
pl: Spowoduje to pojawienie się zawartości, która wcześniej znajdowała się w I<starym-katalogu>, w I<nowym-katalogu>. Fizyczne położenie plików nie zmienia się. Istotne jest, że I<stary-katalog> musi być punktem montowania.
uk: Результатом буде те, що дані, які раніше можна було прочитати зі I<старого_каталогу>, будуть доступними з I<нового_каталогу>. Фізичне розташування файлів змінено не буде. Зауважте, що I<старий_каталог> має бути точкою монтування.

source: Note also that moving a mount residing under a shared mount is invalid and unsupported. Use B<findmnt -o TARGET,PROPAGATION> to see the current propagation flags.
de: Beachten Sie auch, dass die Verschiebung einer Einhängung unter einer Mehrfacheinhängung unzulässig ist und nicht unterstützt wird. Mit B<findmnt -o ZIEL,AUSBREITUNG> können Sie die aktuellen Ausbreitungs-Schalter anzeigen lassen.
fr: Remarquez aussi que le déplacement d’un montage résidant dans un montage partagé n’est ni possible, ni pris en charge. Utiliser B<findmnt -o TARGET,PROPAGATION> pour afficher les attributs de propagation actuels.
pl: Proszę zauważyć, że przeniesienie punktu montowania leżącego pod współdzielonym punktem montowania jest nieprawidłowe i niewspierane. Proszę użyć B<findmnt -o TARGET,PROPAGATION> aby sprawdzić bieżące flagi propagacji.
uk: Зауважте також, що пересування змонтованого каталогу, що перебуває у змонтованому каталозі спільного користування, є некоректним — підтримки такої дії не передбачено. Скористайтеся командою B<findmnt -o TARGET,PROPAGATION>, щоб переглянути поточні прапорці поширення.

source: Shared subtree operations
de: Aktionen mit Mehrfacheinhängungen
fr: Les opérations de partage de sous-arborescence
pl: Współdzielone operacje na poddrzewach
uk: Дії зі спільним піддеревом

source: Since Linux 2.6.15 it is possible to mark a mount and its submounts as shared, private, slave or unbindable. A shared mount provides the ability to create mirrors of that mount such that mounts and unmounts within any of the mirrors propagate to the other mirror. A slave mount receives propagation from its master, but not vice versa. A private mount carries no propagation abilities. An unbindable mount is a private mount which cannot be cloned through a bind operation. The detailed semantics are documented in I<Documentation/filesystems/sharedsubtree.txt> file in the kernel source tree; see also B<mount_namespaces>(7).
de: Seit Linux 2.6.15 ist es möglich, eine Einhängung und deren Untereinhängungen als »shared«, »private«, »slave« oder »unbindable« zu markieren. Eine Mehrfacheinhängung ermöglicht es, »Spiegeleinhängungen« zu erstellen, bei denen Änderungen, wie Einhängungen und Aushängungen innerhalb einer der »Spiegel« (d.h. einer der Einhängungen) auch in der anderen Einhängung automatisch vorgenommen werden. Bei einer Slave-Einhängung breitet sich die Änderung vom Master aus, aber nicht umgekehrt. Bei einer privaten Einhängung erfolgt keine Ausbreitung. Eine »Unbindable«-Einhängung ist eine private Einhängung, die nicht mit einer Bind-Aktion geklont werden kann. Die Semantik ist in der Datei I<Documentation/filesystems/sharedsubtree.txt> im Quellbaum des Kernels detailliert dokumentiert; siehe auch B<mount_namespaces>(7).
fr: Depuis Linux 2.6.15, il est possible de marquer un montage et ses sous-montages comme partagés, privés, esclaves ou non remontables (B<bind>). Un montage partagé permet de créer des miroirs de ce montage, ainsi les montages et les démontages dans n'importe quel miroir seront propagés aux autres miroirs. Un montage esclave se propage seulement depuis le montage maître. Un montage privé ne peut pas se propager. Un montage non remontable est un montage privé qui ne peut pas être cloné lors d'une opération de remontage. La sémantique précise de ces options est documentée dans le fichier I<Documentation/filesystems/sharedsubtree.txt> des sources du noyau.Consultez aussi B<mount_namespaces>(7).
pl: Od Linuksa 2.6.15 możliwe jest oznaczenie montowania i jego podmontowań jako współdzielone (shared), prywatne (private), podrzędne (slave) i niepodpinalne (unbindable). Montowania współdzielone udostępniają możliwość tworzenia kopii takich montowań tak, że montowania i odmontowania którejkolwiek z kopii dotyczy ich wszystkich. Montowania podrzędne otrzymują montowania i odmontowywania z montowania nadrzędnego, ale nie działa to w drugą stronę. Montowania prywatne nie posiadają powyższych właściwości. Montowanie niepodpinalne jest montowaniem prywatnym, które nie może zostać sklonowane za pomocą operacji podpięcia (bind). Szczegółowe wyjaśnienia można znaleźć w pliku dokumentacji w I<Documentation/filesystems/sharedsubtree.txt> w drzewie źródeł jądra; zob. też B<mount_namespaces>(7).
uk: Починаючи з Linux 2.6.15, можна позначити монтування та його підлеглі монтування як спільні, приватні, підлеглі або не призначені для прив'язування. Для спільного монтування передбачено можливість створення дзеркал монтування так, щоб монтування і демонтування у будь-якому з дзеркал поширювалися на інші дзеркала. Підлегле монтування отримує поширення від основного, але не навпаки. Приватне монтування не має можливостей поширення. Не призначене для прив'язування монтування є приватним монтуванням, яке не можна клонувати за допомогою дії з прив'язування. Докладну семантику документовано у файлі I<Documentation/filesystems/sharedsubtree.txt> початкових кодів ядра; див. також B<mount_namespaces>(7).

source: Supported operations are:
de: Die folgenden Aktionen werden unterstützt:
fr: Les opérations prises en charge sont :
pl: Obsługiwane są następujące operacje:
uk: Підтримувані дії:

source: mount --make-shared mountpoint mount --make-slave mountpoint mount --make-private mountpoint mount --make-unbindable mountpoint
de: mount --make-shared Einhängepunkt mount --make-slave Einhängepunkt mount --make-private Einhängepunkt mount --make-unbindable Einhängepunkt
fr: mount --make-shared I<point_de_montage> mount --make-slave I<point_de_montage> mount --make-private I<point_de_montage> mount --make-unbindable I<point_de_montage>
pl: mount --make-shared punkt-montowania mount --make-slave punkt-montowania mount --make-private punkt-montowania mount --make-unbindable punkt-montowania
uk: mount --make-shared точка_монтування mount --make-slave точка_монтування mount --make-private точка_монтування mount --make-unbindable точка_монтування

source: The following commands allow one to recursively change the type of all the mounts under a given mountpoint.
de: Die folgenden Befehle erlauben Ihnen, den Typ aller Einhängungen unter einem angegebenen Einhängepunkt rekursiv zu ändern.
fr: Les commandes suivantes permettent de changer récursivement le type de tous les montages dans un point de montage donné.
pl: Następujące polecenia pozwalają na rekursywną zmianę typu wszystkich montowań pod danym punktem montowania.
uk: Наведені нижче команди надають змогу рекурсивно змінювати тип усіх монтування у вказаній точці монтування.

source: mount --make-rshared mountpoint mount --make-rslave mountpoint mount --make-rprivate mountpoint mount --make-runbindable mountpoint
de: mount --make-rshared Einhängepunkt mount --make-rslave Einhängepunkt mount --make-rprivate Einhängepunkt mount --make-runbindable Einhängepunkt
fr: mount --make-rshared point_de_montage mount --make-rslave point_de_montage mount --make-rprivate point_de_montage mount --make-runbindable point_de_montage
pl: mount --make-rshared punkt-montowania mount --make-rslave punkt-montowania mount --make-rprivate punkt-montowania mount --make-runbindable punkt-montowania
uk: mount --make-rshared точка_монтування mount --make-rslave точка_монтування mount --make-rprivate точка_монтування mount --make-runbindable точка_монтування

source: B<mount> B<does not read> B<fstab>(5) when a B<--make->* operation is requested. All necessary information has to be specified on the command line.
de: B<mount> B<liest nicht die Datei> B<fstab>(5), wenn eine B<--make->*-Aktion angefordert wird. Alle notwendigen Informationen müssen in der Befehlszeile angegeben werden.
fr: B<mount> B<ne lit pas> B<fstab>(5) quand une opération B<--make->I<*> est demandée. Tous les renseignements nécessaires doivent être indiqués sur la ligne de commande.
uk: B<mount> B<не читає> B<fstab>(5), якщо надіслано запит на дію B<--make->*. Усі необхідні дані має бути вказано у рядку команди.

source: Note that the Linux kernel does not allow changing multiple propagation flags with a single B<mount>(2) system call, and the flags cannot be mixed with other mount options and operations.
de: Beachten Sie, dass der Linux-Kernel keine Änderungen mehrerer Ausbreitungs-Schalter mit einem einzelnen B<mount>(2)-Systemaufruf erlaubt und die Schalter nicht mit anderen Einhängeoptionen und Aktionen kombiniert werden können.
fr: Remarquez que le noyau Linux ne permet pas de modifier plusieurs attributs de propagation avec un seul appel système B<mount>(2) et que les attributs ne peuvent pas être mélangés avec d’autres options et opérations de montage.
pl: Proszę zauważyć, że jądro Linux nie pozwala zmieniać wielu flag propagacji pojedynczym wywołaniem systemowym B<mount>(2), flag tych nie można również łączyć z innymi opcjami i operacjami montowania.
uk: Зауважте, що ядро Linux не дозволяє зміни декількох прапорців поширення одним системним викликом B<mount>(2), і прапорці не можна змішувати із іншими параметрами і діями з монтування.

source: Since util-linux 2.23 the B<mount> command can be used to do more propagation (topology) changes by one B<mount>(8) call and do it also together with other mount operations. The propagation flags are applied by additional B<mount>(2) system calls when the preceding mount operations were successful. Note that this use case is not atomic. It is possible to specify the propagation flags in B<fstab>(5) as mount options (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
de: Seit der Version 2.23 von Util-linux ermöglicht der Befehl B<mount> weitere Ausbreitungs-(topologische) Änderungen mit einem B<mount>(8)-Aufruf und erledigt das auch zusammen mit anderen Einhängeaktionen. Die Ausbreitungs-Schalter werden durch zusätzliche B<mount>(2)-Systemaufrufe angewendet, wenn die vorangehenden Einhängeaktionen erfolgreich waren. Beachten Sie, dass dieser Anwendungsfall nicht atomar ist. Es ist möglich, Ausbreitungs-Schalter in der Datei B<fstab>(5) als Einhängeoptionen anzugeben (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
fr: Depuis util-linux 2.23, la commande B<mount> peut être utilisée pour réaliser plus de modifications de propagation (topologie) avec un seul appel B<mount>(8) et de façon simultanée avec d’autres opérations de montage. Les attributs de propagation sont appliqués par des appels système B<mount>(2) supplémentaires lorsque les opérations précédentes de montage ont réussi. Remarquez que ce cas d’utilisation n’est pas atomique. Les attributs de propagation peuvent être indiqués dans B<fstab>(5) comme des options de montage (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
pl: Od util-linux 2.23 polecenie B<mount> można użyć do wykonania wielu zmian propagacji (topologii) jednocześnie jednym wywołaniem B<mount>(8) oraz łączenia ich również z innymi operacjami montowania. Flagi propagacji korzystają z dodatkowych wywołań systemowych B<mount>(2), wykonywanych po pomyślnym zakończeniu wcześniejszych poleceń montowania. Proszę zauważyć, że w tym wypadku polecenie nie jest nierozdzielne (atomowe). Flagi propagacji można podać w B<fstab>(5) jako opcje montowania (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).
uk: Починаючи з util-linux 2.23, командою B<mount> можна скористатися для внесення додаткових змін із поширенням (топологією) шляхом одного виклику B<mount>(8), а також виконання цієї дії разом із іншими діями з монтування. Прапорці поширення застосовуються додатковими викликами B<mount>(2), якщо попередні дії з монтування були успішними. Зауважте, що таке користування програмою не є атомарним. Вказувати прапорці поширення можна у B<fstab>(5) як параметри монтування (B<private>, B<slave>, B<shared>, B<unbindable>, B<rprivate>, B<rslave>, B<rshared>, B<runbindable>).

source: For example:
de: Beispiel:
fr: Par exemple :
pl: Na przykład:
uk: Приклад:

source: mount --make-private --make-unbindable /dev/sda1 /foo
fr: mount --make-private --make-unbindable /dev/sda1 /toto

source: is the same as:
de: gleichbedeutend mit:
fr: est la même chose que :
pl: jest tym samym co:
uk: те саме, що і

source: mount /dev/sda1 /foo mount --make-private /foo mount --make-unbindable /foo
fr: mount /dev/sda1 /toto mount --make-private /toto mount --make-unbindable /toto

source: COMMAND-LINE OPTIONS
de: BEFEHLSZEILEN-OPTIONEN
fr: OPTIONS EN LIGNE DE COMMANDE
pl: OPCJE WIERSZA POLECEŃ
uk: ПАРАМЕТРИ КОМАНДНОГО РЯДКА

source: The full set of mount options used by an invocation of B<mount> is determined by first extracting the mount options for the filesystem from the I<fstab> table, then applying any options specified by the B<-o> argument, and finally applying a B<-r> or B<-w> option, when present.
de: Die vollständige Gruppe der bei einem Aufruf von B<mount> verwendeten Befehlszeilenoptionen wird zuerst anhand der Einhängeoptionen für das Dateisystem in der I<fstab>-Tabelle ermittelt, danach durch Übergabe der im Argument B<-o> angegebenen Optionen und zum Schluss durch Anwendung der Optionen B<-r> oder B<-w>, sofern vorhanden.
fr: L'ensemble exact des options utilisées lors d'une invocation de B<mount> est déterminé d'abord en lisant les options de la table I<fstab> pour ce système de fichiers, puis en appliquant les options de l'argument B<-o> et finalement en appliquant les options B<-r> ou B<-w> si elles sont présentes.
pl: Pełny zestaw opcji używanych przy wywoływaniu B<mount> jest ustalany przez pobranie opcji dla danego systemu plików z I<fstab>, a następnie zastosowanie wszelkich opcji podanych argumentem B<-o>, a na koniec opcji B<-r> lub B<-w>, o ile istnieją.
uk: Повний набір параметрів монтування, які використовуються викликом B<mount>, визначається спочатку видобуванням параметрів монтування для файлової системи з таблиці I<fstab>, потім застосуванням будь-яких параметрів, які вказано аргументом B<-o>, і нарешті, застосуванням параметра B<-r> або B<-w>, якщо такий вказано.

source: The B<mount> command does not pass all command-line options to the B</sbin/mount.>I<suffix> mount helpers. The interface between B<mount> and the mount helpers is described below in the B<EXTERNAL HELPERS> section.
de: Der Befehl B<mount> übergibt nicht alle Befehlszeilenoptionen an die Einhänge-Hilfsprogramme B</sbin/mount.>I<suffix>. Die Schnittstelle zwischen B<mount> und den Hilfsprogrammen ist unten im Abschnitt B<EXTERNE HILFSPROGRAMME> beschrieben.
fr: La commande B<mount> ne passe pas toutes les options de la ligne de commande aux programmes auxiliaires de montage B</sbin/mount.>I<suffixe>. L’interface entre B<mount> et les programmes auxiliaires de montage est décrite plus bas dans la section B<AUXILIAIRES EXTERNES>.
uk: Команда B<mount> не передає усі параметри рядка команди допоміжним засобам монтування B</sbin/mount.>I<суфікс>. Інтерфейс між B<mount> і допоміжними засобами монтування описано нижче у розділі B<ЗОВНІШНІ ДОПОМІЖНІ ЗАСОБИ>.

source: Command-line options available for the B<mount> command are:
de: Die folgenden Befehlszeilenoptionen sind für den Befehl B<mount> verfügbar:
fr: Les options en ligne de commande disponibles pour B<mount> sont les suivantes.
pl: Opcje wiersza poleceń, dostępne do polecenia B<mount> to:
uk: Доступні параметри рядка команди B<mount> є такими:

source: Mount all filesystems (of the given types) mentioned in I<fstab> (except for those whose line contains the B<noauto> keyword). The filesystems are mounted following their order in I<fstab>. The B<mount> command compares filesystem source, target (and fs root for bind mount or btrfs) to detect already mounted filesystems. The kernel table with already mounted filesystems is cached during B<mount --all>. This means that all duplicated I<fstab> entries will be mounted.
de: hängt alle Dateisysteme (der angegebenen Typen) ein, die in der Datei I<fstab> aufgeführt sind (außer jene, deren Eintrag das Schlüsselwort B<noauto> enthält). Die Dateisysteme werden nach deren Reihenfolge in I<fstab> eingehängt. Der B<mount>-Befehl vergleicht die Dateisystemquelle, das Ziel und die Dateisystemwurzel (letztere für Bind-Einhängungen oder Btrfs), um bereits eingehängte Dateisysteme zu erkennen. Die Kernel-Tabelle mit bereits eingehängten Dateisystemen wird während der Ausführung von B<mount --all> zwischengespeichert. Das bedeutet, dass alle mehrfach vorhandenen I<fstab>-Einträge ausgeführt werden.
fr: Monter tous les systèmes de fichiers (des types donnés) mentionnés dans I<fstab> (à part ceux dont la ligne contient le mot-clé B<noauto>). Les systèmes de fichiers sont montés dans l’ordre de I<fstab>. La commande de montage compare la source et la cible du système de fichiers (et la racine du système de fichiers pour les montages « bind » et Btrfs) pour détecter les systèmes de fichiers déjà montés. La table du noyau avec les systèmes de fichiers déjà montés est mise en cache lors de B<mount --all>. Cela signifie que toutes les entrées en double seront montées.
pl: Montuje wszystkie systemy plików (podanego typu) zawarte w I<fstab> (z wyłączeniem wierszy zawierających słowo kluczowe B<noauto>). Systemy plików są montowane w kolejności, w jakiej występują w I<fstab>. Polecenie B<mount> porównuje źródło i cel systemu plików (i korzeń systemu plików w przypadku montowań bind lub systemu plików btrfs), aby wykryć już zamontowane. Tablica jądra z już zamontowanymi systemami plików jest buforowana podczas B<mount --all>. Oznacza to, że wszystkie zduplikowane wpisy I<fstab> zostaną zamontowane.
uk: Змонтувати усі файлові системи (вказаних типів), які згадано у I<fstab> (окрім тих, у рядках яких міститься ключове слово B<noauto>). Файлові системи буде змонтовано за порядком, у якому їх вказано у I<fstab>. Команда B<mount> порівняє джерело і призначення файлової системи (а також корінь файлової системи для монтувань із прив'язкою або btrfs) для виявлення вже змонтованих файлових систем. Під час виконання B<mount --all> буде кешовано таблицю ядра із вже змонтованими файловими системами. Це означає, що буде змонтовано усі дубльовані у I<fstab> записи.

source: The correct functionality depends on I</proc> (to detect already mounted filesystems) and on I</sys> (to evaluate filesystem tags like UUID= or LABEL=). It\(cqs strongly recommended to mount I</proc> and I</sys> filesystems before B<mount -a> is executed, or keep /proc and /sys at the beginning of I<fstab>.
de: Die korrekte Funktionalität basiert auf I</proc> (zur Erkennung bereits eingehängter Dateisysteme) und auf I</sys> (zur Ermittlung von Dateisystemmarkierungen wie UUID= oder LABEL=). Es wird dringend empfohlen, die I</proc>- und I</sys>-Dateisysteme einzuhängen, bevor B<mount -a> ausgeführt wird oder I</proc> und I</sys> an den Anfang der I<fstab> zu setzen.
fr: La fonctionnalité correcte dépend de I</proc> (pour détecter les systèmes de fichier déjà montés) et de I<sys> (pour évaluer les mots-clés du système de fichiers tels que UUID= ou LABEL=). Il est fortement recommandé de monter les systèmes de fichiers I</proc> et I</sys> avant l'exécution de B<mount -a> ou de garder /proc et /sys au début du fichier I<fstab>.
uk: Виконання належних функціональних можливостей залежить від I</proc> (для виявлення вже змонтованих файлових систем) та від I</sys> (для обробки міток файлової системи, зокрема UUID= або LABEL=). Наполегливо рекомендуємо змонтувати файлові системи I</proc> і I</sys> перед виконанням B<mount -a> або вказувати /proc і /sys на початку I<fstab>.

source: The option B<--all> is possible to use for remount operation too. In this case all filters (B<-t> and B<-O>) are applied to the table of already mounted filesystems.
de: Die Option B<--all> lässt sich auch für erneute Einhängungen verwenden. In diesem Fall werden alle Filter (B<-t> und B<-O>) auf die Tabelle der bereits eingehängten Dateisysteme angewendet.
fr: L’option B<--all> est aussi possible pour une opération de remontage. Dans ce cas, tous les filtres (B<-t> et B<-O>) sont appliqués à la table des systèmes de fichiers déjà montés.
pl: Opcję B<--all> można użyć również do operacji ponownego montowania (przemontowania). W takim przypadku wszystkie filtry (B<-t> i B<-O>) są stosowane do tablicy już zamontowanych systemów plików.
uk: Параметр B<--all> можна вживати для дії перемонтування також. В цьому випадку всі фільтри (B<-t> та B<-O>) застосовуються до таблиці вже змонтованих систем.

source: Since version 2.35 it is possible to use the command line option B<-o> to alter mount options from I<fstab> (see also B<--options-mode>).
de: Seit Version 2.35 können Sie die Befehlszeilenoption B<-o> zum Anpassen der Einhängeoptionen aus der I<fstab> verwenden (siehe auch B<--options-mode>).
fr: Depuis la version 2.35, il est possible d’utiliser l’option B<-o> de la ligne de commande pour modifier les options de montage de I<fstab> (consulter aussi B<--options-mode>).
uk: З версії 2.35 можна використовувати параметр командного рядка B<-o>, щоб змінити параметр з I<fstab> (див. також B<--options-mode>).

source: Note that it is a bad practice to use B<mount -a> for I<fstab> checking. The recommended solution is B<findmnt --verify>.
de: Beachten Sie, dass es eine schlechte Idee ist, B<mount -a> zur Überprüfung der Datei I<fstab> zu verwenden. Wir empfehlen stattdessen B<findmnt --verify>.
fr: Remarquez que ce n’est pas une bonne pratique d’utiliser B<mount -a> pour la vérification de I<fstab>. La solution préconisée est B<findmnt --verify>.
pl: Proszę zauważyć, że złą praktyką jest używanie B<mount -a> do sprawdzenia I<fstab>. Zalecane jest korzystanie w zamian z B<findmnt --verify>.
uk: Зауважте, що не варто використовувати B<mount -a> для перевірки I<fstab>. Рекомендованим рішенням є B<findmnt --verify>.

source: Remount a subtree somewhere else (so that its contents are available in both places). See above, under B<Bind mounts>.
de: hängt einen Unterbaum erneut an einem anderen Ort ein (so dass dessen Inhalt an beiden Orten erscheint). Siehe oben im Abschnitt B<Bind-Einhängungen>.
fr: Remonter une sous-arborescence ailleurs (le contenu sera disponible en deux points différents). Voir plus haut « Les opérations de remontage ».
pl: Montuje ponownie poddrzewo w innym miejscu (tak, że jego zawartość jest dostępna w obu miejscach). Patrz wyżej w rozdziale B<Operacja montowania przez podpięcie (ang. bind mount)>.
uk: Повторно змонтувати піддерево кудись в інше місце (щоб його дані були доступними в обох місцях). Див. вище, розділ B<Монтування з пов'язуванням>.
