Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The device-mapper verity target provides read-only transparent integrity checking of block devices using kernel crypto API. The B<mount> command can open the dm-verity device and do the integrity verification before the device filesystem is mounted. Requires libcryptsetup with in libmount (optionally via B<dlopen>(3)). If libcryptsetup supports extracting the root hash of an already mounted device, existing devices will be automatically reused in case of a match. Mount options for dm-verity:
de: Das Verity-Ziel von Device-Mapper stellt eine nur lesbare, transparente Integritätsprüfung von Blockgeräten mittels des Kernel-Krypto-APIs bereit. Der Befehl B<mount> kann das dm-verity-Gerät öffnen und die Integritätsüberprüfung durchführen, bevor das Dateisystem auf dem Gerät geöffnet wird. Benötigt libcryptsetup innerhalb von libmount (optional über B<dlopen>(3)). Falls libcryptsetup das Auslesen des Wurzel-Hashes von bereits eingehängten Geräten unterstützt, werden bestehende Geräte automatisch erneut verwandt, falls ein Treffer erfolgt. Einhängeoptionen für dm-verity sind:
fr: La cible de la carte de périphérique I<verity> (device-mapper verity) fournit une vérification transparente d’intégrité en lecture seule de périphériques par blocs en utilisant l’API de chiffrement du noyau. La commande de montage peut ouvrir le périphérique dm-verity et réaliser la vérification d’intégrité avant que le système de fichiers du périphérique ne soit monté. B<libcryptsetup> avec B<libmount> est requis (de manière facultative à l’aide de B<dlopen>(3)). Si B<libcryptsetup> gère l’extraction du hachage de la racine d’un périphérique déjà monté, les périphériques existants seront automatiquement réutilisés en cas de correspondance. Les options de montage pour dm-verity sont les suivantes :
uk: Ціль device-mapper verity надає доступ до читання із прозорою перевіркою цілісності даних блокових пристроїв з використанням шифрувального програмного інтерфейсу ядра системи. Програма B<mount> здатна відкривати пристрої dm-verity і виконувати перевірку цілісності даних до монтування файлової системи пристрою. Потребує libcryptsetup у libmount (можна з використанням B<dlopen>(3)). Якщо у libcryptsetup передбачено підтримку видобування хеш-суми кореня вже змонтованого пристрою, наявні пристрої, якщо вони є відповідними, буде використано автоматично. Параметри монтування dm-verity:

source: B<verity.hashdevice=>I<path>
de: B<verity.hashdevice=>I<Pfad>
fr: B<verity.hashdevice=>I<chemin>
pl: B<verity.hashdevice=>I<ścieżka>
uk: B<verity.hashdevice=>I<шлях>

source: Path to the hash tree device associated with the source volume to pass to dm-verity.
de: Pfad zu dem Hash-Baum-Gerät, das dem Quelldatenträger zugeordnet ist und an dm-verity übergeben werden soll.
fr: I<chemin> du périphérique de l’arbre de hachage associé avec le volume source à indiquer à dm-verity.
uk: Шлях до пристрою ієрархії хеш-сум, який пов'язано із початковим томом, який слід передати dm-verity.

source: Hex-encoded hash of the root of I<verity.hashdevice>. Mutually exclusive with I<verity.roothashfile.>
de: Hexadezimal kodierter Hash der Wurzel von I<verity.hashdevice>. Schließt sich gegenseitig mit I<verity.roothashfile> aus.
fr: Hachage encodé en hexadécimal de la racine de I<verity.hashdevice>. Mutuellement exclusif avec I<verity.roothashfile>.
uk: Хеш кореня I<verity.hashdevice> у шістнадцятковому кодуванні. Є взаємно виключним із I<verity.roothashfile.>

source: B<verity.roothashfile=>I<path>
de: B<verity.roothashfile=>I<Pfad>
fr: B<verity.roothashfile=>I<chemin>
pl: B<verity.roothashfile=>I<ścieżka>
uk: B<verity.roothashfile=>I<шлях>

source: Path to file containing the hex-encoded hash of the root of I<verity.hashdevice.> Mutually exclusive with I<verity.roothash.>
de: Pfad zu der Datei, die den hexadezimal kodierten Hash der Wurzel von I<verity.hashdevice> enthält. Schließt sich gegenseitig mit I<verity.roothash> aus.
fr: I<chemin> vers le fichier contenant le hachage encodé en hexadécimal de la racine I<verity.hashdevice>, mutuellement exclusif avec I<verity.roothash>.
uk: Шлях до файла, який містить хеш-суму кореня I<verityhashdevice> у шістнадцятковому кодуванні. Є взаємно виключним із I<verity.roothash.>

source: B<verity.hashoffset=>I<offset>
de: B<verity.hashoffset=>I<Versatz>
fr: B<verity.hashoffset=>I<décalage>
pl: B<verity.hashoffset=>I<ofset>
uk: B<verity.hashoffset=>I<відступ>

source: If the hash tree device is embedded in the source volume, I<offset> (default: 0) is used by dm-verity to get to the tree.
de: Falls das Hash-Baum-Gerät in das Quelllaufwerk eingebettet ist, wird I<Versatz> (Vorgabe: 0) durch Dm-verity verwandt, um den Baum zu erhalten.
fr: Si le périphérique de l’arbre de hachages est incorporé dans le volume source, I<décalage> (par défaut B<0>) est utilisé par dm-verity pour parvenir à l’arbre.
uk: Якщо пристрій дерева хеш-сум вбудовано до початкового тому, для отримання dm-verity ієрархії буде використано I<відступ> (типове значення: 0).

source: B<verity.fecdevice=>I<path>
de: B<verity.fecdevice=>I<Pfad>
fr: B<verity.fecdevice=>I<chemin>
pl: B<verity.fecdevice=>I<ścieżka>
uk: B<verity.fecdevice=>I<шлях>

source: Path to the Forward Error Correction (FEC) device associated with the source volume to pass to dm-verity. Optional. Requires kernel built with B<CONFIG_DM_VERITY_FEC>.
de: Pfad zum Vorwärtsfehlerkorrektur (FEC)-Gerät, das dem Quelldatenträger zugeordnet ist und an dm-verity übergeben werden soll. Optional. Benötigt einen mit B<CONFIG_DM_VERITY_FEC> gebauten Kernel.
fr: I<chemin> vers le périphérique FEC (Forward Error Correction) associé avec le volume source à indiquer à dm-verity. Facultatif et nécessite que le noyau soit construit avec B<CONFIG_DM_VERITY_FEC>.
uk: Шлях до пристрою Forward Error Correction (FEC), який пов'язано із початковим томом, який слід передати dm-verity. Не обов'язковий. Потребує ядра, яке зібрано з B<CONFIG_DM_VERITY_FEC>.

source: B<verity.fecoffset=>I<offset>
de: B<verity.fecoffset=>I<Versatz>
fr: B<verity.fecoffset=>I<décalage>
pl: B<verity.fecoffset=>I<ofset>
uk: B<verity.fecoffset=>I<відступ>

source: If the FEC device is embedded in the source volume, I<offset> (default: 0) is used by dm-verity to get to the FEC area. Optional.
de: Falls das FEC in das Quelllaufwerk eingebettet ist, wird I<Versatz> (Vorgabe: 0) durch Dm-verity verwandt, um den FEC-Bereich zu erhalten. Optional.
fr: Si le périphérique FEC est incorporé dans le volume source, I<décalage> (par défaut B<0>) est utilisé par dm-verity pour parvenir à l’emplacement FEC. Facultatif.
uk: Якщо пристрій FEC вбудовано до початкового тому, для отримання dm-verity області FEC буде використано I<відступ> (типове значення: 0). Необов'язковий.

source: B<verity.fecroots=>I<value>
de: B<verity.fecroots=>I<Wert>
fr: B<verity.fecroots=>I<valeur>
pl: B<verity.fecroots=>I<wartość>
uk: B<verity.fecroots=>I<значення>

source: Parity bytes for FEC (default: 2). Optional.
de: Paritäts-Bytes für FEC (Standard: 2). Optional.
fr: Octets de parité pour FEC (par défaut B<2>). Facultatif.
uk: Байти парності для FEC (типове значення: 2). Необов'язковий.

source: B<verity.roothashsig=>I<path>
de: B<verity.roothashsig=>I<Pfad>
fr: B<verity.roothashsig=>I<chemin>
pl: B<verity.roothashsig=>I<ścieżka>
uk: B<verity.roothashsig=>I<шлях>

source: Path to B<pkcs7>(1ssl) signature of root hash hex string. Requires crypt_activate_by_signed_key() from cryptsetup and kernel built with B<CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG>. For device reuse, signatures have to be either used by all mounts of a device or by none. Optional.
de: Pfad zur B<pkcs7>(1ssl)-Signatur der Wurzel-Hash-Zeichenkette (hexadezimal). Benötigt crypt_activate_by_signed_key() von Cryptsetup und einen mit B<CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG> gebauten Kernel. Zur Wiederverwendung von Geräten müssen Signaturen entweder von allen Einhängungen oder keiner verwendet werden. Dies ist optional.
fr: Chemin pour la signature B<pkcs7>(1ssl) de la chaîne hexadécimale du hachage de la racine. Cela nécessite B<crypt_activate_by_signed_key>() de B<cryptsetup> et le noyau construit avec B<CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG>. Pour une réutilisation du périphérique, les signatures doivent être, soit utilisées par tous les montages d’un périphérique, soit par aucun. Facultatif.
uk: Шлях до підпису B<pkcs7>(1ssl) шістнадцяткового рядка хеш-суми кореня файлової системи. Потребує crypt_activate_by_signed_key() з cryptsetup і ядра, яке зібрано із B<CONFIG_DM_VERITY_VERIFY_ROOTHASH_SIG>. Для повторного використання пристрою підписи має бути або використано усіма монтуваннями пристрою, або не використано жодним. Необов'язковий.

source: Instruct the kernel to ignore, reboot or panic when corruption is detected. By default the I/O operation simply fails. Requires Linux 4.1 or newer, and libcrypsetup 2.3.4 or newer. Optional.
de: Weist den Kernel an, »ignore«, »reboot« oder »panic« auszulösen, wenn eine Beschädigung entdeckt wird. In der Voreinstellung schlägt der E/A-Vorgang einfach fehl. Dafür ist Linux 4.1 oder neuer und libcryptsetup 2.3.4 oder neuer erforderlich. Dies ist optional.
fr: Demander au noyau d'ignorer, de redémarrer ou de déclencher une panique lorsqu'une corruption est détectée. Par défaut, l'opération d'E/S échoue simplement. Cela requiert Linux 4.1 ou plus récent et libcrypsetup 2.3.4 ou plus récent. Facultatif.
uk: Наказати ядру ігнорувати, перезавантажувати систему або панікувати, якщо буде виявлено пошкодження даних. Типово, дія з введення-виведення даних просто зазнає невдачі. Потребує ядра Linux 4.1 або новішого та libcrypsetup 2.3.4 або новішої. Необов'язковий.

source: Supported since util-linux v2.35.
de: Wird seit Util-linux v2.35 unterstützt.
fr: Pris en charge depuis util-linux version 2.35.
uk: Передбачено підтримку з util-linux v2.35.

source: For example commands:
de: Zum Beispiel erstellen die Befehle
fr: Par exemple les commandes :
uk: Наприклад, такі команди:

source: create squashfs image from I</etc> directory, verity hash device and mount verified filesystem image to I</mnt>. The kernel will verify that the root hash is signed by a key from the kernel keyring if roothashsig is used.
de: ein Squashfs-Abbild aus dem Verzeichnis I</etc>, überprüfen die Integrität des Hash-Gerätes und hängen das überprüfte Dateisystem-Abbild in I</mnt> ein. Falls »roothashsig« verwendet wird, dann wird der Kernel überprüfen, ob der Root-Hash mit einem Schlüssel aus dem Kernel-Schlüsselbund signiert ist.
fr: créent une image squashfs du répertoire I</etc>, valident (verity) le périphérique I<hash> et montent l’image vérifiée du système de fichiers sur I</mnt>. Le noyau vérifiera que le hachage de la racine est signé par une clé du trousseau de clés du noyau si roothashsig est utilisé.
uk: створять образ squashfs з каталогу I</etc>, пристрій хешів істинності та змонтують перевірений образ файлової системи до I</mnt>. Ядро перевірить, чи кореневий хеш підписано ключем зі сховища ключів ядра, якщо використано roothashsig.

source: LOOP-DEVICE SUPPORT
de: UNTERSTÜTZUNG FÜR LOOP-GERÄTE
fr: GESTION DE PÉRIPHÉRIQUE BOUCLE
uk: ПІДТРИМКА ПЕТЛЬОВИХ ПРИСТРОЇВ

source: One further possible type is a mount via the loop device. For example, the command
de: Ein weiterer Typ ist das Einhängen per Loop-Gerät. Zum Beispiel richtet der Befehl
fr: Il est possible de faire un montage au travers du périphérique boucle (« loop »). Par exemple, la commande :
pl: Kolejnym możliwym typem jest montowanie poprzez urządzenie loop. Na przykład, polecenie
uk: Одним із подальших можливих типів є монтування через петльовий пристрій. Наприклад, команда

source: B<mount /tmp/disk.img /mnt -t vfat -o loop=/dev/loop3>
fr: B<mount /tmp/disque.img /mnt -t vfat -o loop=/dev/loop3>

source: will set up the loop device I</dev/loop3> to correspond to the file I</tmp/disk.img>, and then mount this device on I</mnt>.
de: das Loop-Gerät I</dev/loop3> korrespondierend zur Datei I</tmp/disk.img> ein und hängt dieses Gerät dann in I</mnt> ein.
fr: va faire correspondre le périphérique boucle I</dev/loop> au fichier I</tmp/disque.img>, puis monter ce périphérique sur I</mnt>.
pl: ustawi urządzenie loop I</dev/loop3> tak, aby odpowiadał plikowi I</tmp/disk.img>, a następnie zamontuje to urządzenie w I</mnt>.
uk: налаштує петльовий пристрій I</dev/loop3>, який відповідає файлу I</tmp/disk.img>, а потім змонтує цей пристрій до I</mnt>.

source: If no explicit loop device is mentioned (but just an option \(aqB<-o loop>\(aq is given), then B<mount> will try to find some unused loop device and use that, for example
de: Wenn kein Loop-Gerät explizit angegeben ist (sondern nur eine Option B<-o loop>), dann wird B<mount> versuchen, ungenutzte Loop-Geräte zu finden und diese zu verwenden, zum Beispiel
fr: Si aucun périphérique boucle n'est explicitement mentionné (mais qu'une simple option « B<-o loop> » est donnée), alors B<mount> essayera de trouver des périphériques boucle non utilisés et les utilisera, par exemple :
pl: Jeśli nie podano jawnie urządzenia loop (tylko opcję B<-o loop>), to B<mount> spróbuje znaleźć jakieś nieużywane urządzenie loop i użyć je, na przykład
uk: Якщо петльовий пристрій не вказано явним чином (а задано лише параметр \(aqB<-o loop>\(aq), B<mount> спробує знайти невикористаний петльовий пристрій і скористатися ним. Приклад

source: B<mount /tmp/disk.img /mnt -o loop>
fr: B<mount /tmp/disque.img /mnt -o loop>

source: The B<mount> command B<automatically> creates a loop device from a regular file if a filesystem type is not specified or the filesystem is known for libblkid, for example:
de: Der B<mount>-Befehl erzeugt B<automatisch> ein Loop-Gerät aus einer regulären Datei, wenn kein Dateisystemtyp angegeben wird oder wenn Libblkid das Dateisystem kennt, zum Beispiel:
fr: La commande de montage crée B<automatiquement> un périphérique boucle à partir d'un fichier normal si aucun type de système de fichiers n'est indiqué, ou s'il s'agit d'un système de fichiers libblkid, par exemple :
pl: Polecenie B<mount> B<automatycznie> tworzy urządzenie loop ze zwykłego pliku, jeśli nie podano systemu plików lub system plików jest znany libblkid, na przykład:
uk: Команда B<mount> B<автоматично> створює петльовий пристрій зі звичайного файла, якщо не вказано тип файлової системи або файлова система є відомою libblkid. Приклад:

source: B<mount /tmp/disk.img /mnt>
fr: B<mount /tmp/disque.img /mnt>

source: This type of mount knows about three options, namely B<loop>, B<offset> and B<sizelimit>, that are really options to B<losetup>(8). (These options can be used in addition to those specific to the filesystem type.)
de: Dieser Einhängetyp kennt drei Optionen, B<loop>, B<offset> und B<sizelimit>, welche tatsächliche Optionen für B<losetup>(8) sind (diese Optionen können zusätzlich zu den dateisystemspezifischen Optionen verwendet werden).
fr: Ce type de montage dispose de trois options, nommées B<loop>, B<offset> et B<sizelimit>, qui sont en réalité des options pour B<losetup>(8) (ces options peuvent être utilisées en plus de celles spécifiques au type de système de fichiers).
pl: Ten typ montowań zna trzy opcje, B<loop>, B<offset> i B<sizelimit>, które są tak naprawdę opcjami do B<losetup>(8) (opcje te mogą być używane oprócz opcji specyficznych dla danego systemu plików).
uk: Для цього типу монтування передбачено три параметри, а саме, B<loop>, B<offset> і B<sizelimit>, які насправді є параметрами B<losetup>(8). (Ці параметри можна використати для доповнення специфічних для типу файлової системи параметрів.)

source: Since Linux 2.6.25 auto-destruction of loop devices is supported, meaning that any loop device allocated by B<mount> will be freed by B<umount> independently of I</etc/mtab>.
de: Seit Linux 2.6.25 wird die automatische Zerstörung von Loop-Geräten unterstützt, was bedeutet, dass jedes von B<mount> zugewiesene Loop-Gerät unabhängig von der Datei I</etc/mtab> von B<umount> freigegeben wird.
fr: Depuis Linux 2.6.25, l'autodestruction des périphériques boucle est gérée. Cela signifie que tous les périphériques boucle alloués par B<mount> seront libérés par B<umount> indépendamment de I</etc/mtab>.
pl: Od Linuksa 2.6.25 obsługiwane jest samozniszczenie urządzeń loop, co oznacza, że każde urządzenie loop przydzielone przez B<mount> zostanie zwolnione przez B<umount> niezależnie od I</etc/mtab>.
uk: Починаючи від Linux 2.6.25 підтримується автоматичне знищення петльових пристроїв, тобто, будь-який петльовий пристрій, виділений за допомогою B<mount>, буде вивільнено за допомогою B<umount> незалежно від I</etc/mtab>.

source: You can also free a loop device by hand, using B<losetup -d> or B<umount -d>.
de: Sie können ein Loop-Gerät auch manuell mittels B<losetup -d> oder B<umount -d> freigeben.
fr: Vous pouvez aussi libérer un périphérique boucle manuellement avec B<losetup -d> ou B<umount -d>.
pl: Można również zwolnić urządzenie loop ręcznie, przy użyciu B<losetup -d> lub B<umount -d>.
uk: Петльовий пристрій також можна вивільнити вручну, скориставшись B<losetup -d> або B<umount -d>.

source: Since util-linux v2.29, B<mount> re-uses the loop device rather than initializing a new device if the same backing file is already used for some loop device with the same offset and sizelimit. This is necessary to avoid a filesystem corruption.
de: Seit Util-linux 2.29 wird das Loop-Gerät von B<mount> wiederverwendet, anstatt ein neues Gerät zu initialisieren, sofern die gleiche zugrundeliegende Datei bereits mit dem gleichen Versatz und der gleichen Größenbeschränkung für ein Loop-Gerät verwendet wird. Dies ist notwendig, um eine Beschädigung des Dateisystems zu vermeiden.
fr: Depuis util-linux version 2.29 la commande B<mount> réutilise le périphérique boucle plutôt que d’initialiser un nouveau périphérique si le fichier de support est déjà utilisé pour des périphériques boucles avec le même décalage et la même taille maximale. C’est nécessaire pour éviter une corruption du système de fichiers.
uk: Починаючи від util-linux версії 2.29, B<mount> повторно використовує петльовий пристрій, а не ініціалізує новий пристрій, якщо для певного петльового пристрою вже використовується той самий резервний файл з таким самим зміщенням і обмеженням розміру. Це необхідно, щоб уникнути пошкодження файлової системи.

source: EXIT STATUS
fr: CODE DE RETOUR
pl: KOD ZAKOŃCZENIA
uk: СТАН ВИХОДУ

source: B<mount> has the following exit status values (the bits can be ORed):
de: B<mount> hat die folgenden Exit-Status-Werte (die Bits können mit ODER verknüpft werden):
fr: B<mount> peut renvoyer les codes de retour suivants (les bits peuvent subir une opération OU bit à bit) :
uk: Для B<mount> передбачено такі значення стану виходу (біти станів може бути поєднано логічним АБО):

source: success
de: Erfolg
fr: Succès.
pl: sukces
uk: успіх

source: incorrect invocation or permissions
de: Inkorrekter Aufruf oder Zugriffsrechte
fr: invocation ou permissions incorrectes
pl: nieprawidłowe wywołanie lub uprawnienia
uk: некоректний виклик або права доступу

source: system error (out of memory, cannot fork, no more loop devices)
de: Systemfehler (Speicherüberlauf, Forken nicht möglich, keine Loop-Geräte mehr)
fr: erreur système (plus de mémoire, échec de B<fork>(), plus de périphérique boucle disponible)
pl: błąd systemu (brak pamięci, niemożność wykonania fork, nie ma więcej urządzeń loop)
uk: помилка системи (не вистачає пам'яті, не вдалося створити відгалуження, не лишилося петльових пристроїв)

source: internal B<mount> bug
de: Interner Fehler in B<mount>
fr: bogue interne à B<mount>
pl: wewnętrzny błąd B<mount>
uk: внутрішня вада B<mount>

source: user interrupt
de: Abbruch durch Benutzer
fr: interruption par l'utilisateur
pl: przerwanie przez użytkownika
uk: перервано користувачем

source: problems writing or locking I</etc/mtab>
de: Probleme beim Schreiben oder Sperren der Datei I</etc/mtab>
fr: problème d'écriture ou de verrouillage de I</etc/mtab>
pl: problemy podczas zapisu lub blokowania I</etc/mtab>
uk: проблеми із записуванням або блокуванням I</etc/mtab>

source: mount failure
de: Einhängefehler
fr: échec de montage
pl: niepowodzenie montowania
uk: спроба монтування завершилася невдало

source: some mount succeeded
de: Einige Einhängungen waren erfolgreich
fr: réussite de certains montages
pl: cześć montowań powiodła się
uk: успіх деяких монтувань

source: The command B<mount -a> returns 0 (all succeeded), 32 (all failed), or 64 (some failed, some succeeded).
de: Der Befehl B<mount -a> gibt 0 (alles erfolgreich), 32 (alles fehlgeschlagen) oder 64 (teils fehlgeschlagen, teils erfolgreich) zurück.
fr: La commande B<mount -a> renvoie B<0> (tous ont réussi), B<32> (tous ont échoué) ou B<64> (certains ont réussi, d’autres ont échoué).
pl: Polecenie B<mount -a> zwraca 0 (wszystkie się powiodły), 32 (wszystkie nie powiodły się) lub 64 (część się powiodła, a część nie).
uk: Команда B<mount -a> повертає 0 (усі успішно), 32 (усі невдало) або 64 (деякі невдало, деякі успішно).

source: EXTERNAL HELPERS
de: EXTERNE HILFSPROGRAMME
fr: AUXILIAIRES EXTERNES
pl: ZEWNĘTRZNE PROGRAMY POMOCNICZE
uk: ЗОВНІШНІ ДОПОМІЖНІ ЗАСОБИ

source: The syntax of external mount helpers is:
de: Die Syntax der externen Einhänge-Hilfsprogramme ist:
fr: La syntaxe des programmes de montage externes est :
pl: Składnia zewnętrznych programów pomocniczych mount jest następująca:
uk: Синтаксис зовнішніх допоміжних засобів монтування такий:

source: B</sbin/mount.>I<suffix> I<spec dir> [B<-sfnv>] [B<-N> I<namespace>] [B<-o> I<options>] [B<-t> I<type>B<.>I<subtype>]
de: B</sbin/mount.>I<Suffix> I<Spez-Verzeichnis> [B<-sfnv>] [B<-N> I<Namensraum>] [B<-o> I<Optionen>] [B<-t> I<Typ>B<.>I<Subtyp>]
fr: B</sbin/mount.>I<suffixe> I<spec rép> [B<-sfnv>] [B<-N> I<nom_espace>] [B<-o> I<options>] [B<-t> I<type>B<.>I<soustype>]
uk: B</sbin/mount.>I<суфікс> I<spec dir> [B<-sfnv>] [B<-N> I<простір_назв>] [B<-o> I<параметри>] [B<-t> I<тип>B<.>I<підтип>]

source: where the I<suffix> is the filesystem type and the B<-sfnvoN> options have the same meaning as the normal mount options. The B<-t> option is used for filesystems with subtypes support (for example B</sbin/mount.fuse -t fuse.sshfs>).
de: wobei I<Suffix> den Dateisystemtyp bezeichnet und die Optionen B<-sfnvoN> die gleiche Bedeutung wie bei normalen Einhängeoptionen haben. Die Option B<-t> wird für Dateisysteme verwendet, die Subtypen unterstützen (zum Beispiel B</sbin/mount.fuse -t fuse.sshfs>).
fr: où le I<suffixe> est le type de système de fichiers et les options B<-sfnvoN> ont la même signification que les options de montage normales. L'option B<-t> est utilisée pour les systèmes de fichiers avec prise en charge des sous-types (par exemple I</sbin/mount.fuse -t fuse.sshfs>).
pl: gdzie I<typ> jest typem systemu plików, a opcje B<-sfnvoN> mają to samo znaczenie, co standardowe opcje mount. Opcja B<-t> jest używana do systemów plików z obsługa podtypów (np. B</sbin/mount.fuse -t fuse.sshfs>).
uk: де I<суфікс> - це тип файлової системи, а параметри B<-sfnvoN> мають таке ж значення, що й звичайні параметри монтування. Параметр B<-t> використовується для файлових систем із підтримкою підтипів (наприклад, B</sbin/mount.fuse -t fuse.sshfs>).
