Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Source of default options. I<source> is a comma-separated list of B<fstab>, B<mtab> and B<disable>. B<disable> disables B<fstab> and B<mtab> and enables B<--options-source-force>. The default value is B<fstab,mtab>.
de: bezeichnet die Quelle der Standardoptionen. Die I<Quelle> ist eine durch Kommata getrennte Liste aus B<fstab>, B<mtab> und B<disable>. Mit B<disable> deaktivieren Sie B<fstab> und B<mtab> und aktivieren B<--options-source-force>. Die Vorgabe ist B<fstab,mtab>.
fr: Source des options par défaut. I<source> est une liste séparée par des virgules de I<fstab>, I<mtab> et B<disable>. B<disable> désactive I<fstab> et I<mtab> et active B<--options-source-force>. La valeur par défaut est I<fstab,mtab>.
uk: Джерело типових параметрів. Аргументом I<джерело> є список відокремлених комами значень B<fstab>, B<mtab> і B<disable>. Значення B<disable> вимикає B<fstab> і B<mtab> і вмикає B<--options-source-force>. Типовим є значення B<fstab,mtab>.

source: Use options from I<fstab>/I<mtab> even if both I<device> and I<dir> are specified.
de: verwendet die Optionen aus I<fstab>/I<mtab> selbst dann, wenn sowohl I<Gerät> als auch I<Verzeichnis> angegeben sind.
fr: Utiliser les options de I<fstab> et I<mtab> si le I<périphérique> et le I<répertoire> sont spécifiés.
pl: Używa opcji z I<fstab>/I<mtab> nawet gdy podano zarówno I<urządzenie> jak i I<katalog>.
uk: Використовувати параметри з I<fstab>/I<mtab>, навіть якщо не задано ні I<пристрій>, ні I<каталог>.

source: Remount a subtree and all possible submounts somewhere else (so that its contents are available in both places). See above, the subsection B<Bind mounts>.
de: hängt einen Unterbaum und alle möglichen Untereinhängungen an einem anderen Ort ein (so dass dessen Inhalt an beiden Orten verfügbar ist). Siehe oben im Unterabschnitt B<Bind-Einhängungen>.
fr: Remonter une sous-arborescence et tous les sous-montages possibles ailleurs (le contenu sera disponible en deux points différents). Voir plus haut « Les opérations de remontage ».
pl: Montuje ponownie poddrzewo wraz ze wszystkimi ewentualnymi montowaniami znajdującymi się poniżej, w innym miejscu (tak, że jego zawartość jest dostępna w obu miejscach). Patrz wyżej w podrozdziale B<Operacja montowania przez podpięcie (ang. bind mount)>.
uk: Повторно змонтувати піддерево і усі можливі підмонтування кудись в інше місце (щоб його дані були доступними в обох місцях). Див. вище, підрозділ B<Монтування з пов'язуванням>.

source: Mount the filesystem read-only. A synonym is B<-o ro>.
de: hängt das Dateisystem schreibgeschützt ein. Ein Synonym ist B<-o ro>.
fr: Monter le système de fichiers en lecture seule. Un synonyme est B<-o ro>.
pl: Montuje system plików w trybie tylko do odczytu. Synonimem jest B<-o ro>.
uk: Монтувати файлову систему у режимі тільки читання. Те саме, що і B<-o ro>.

source: Note that, depending on the filesystem type, state and kernel behavior, the system may still write to the device. For example, ext3 and ext4 will replay the journal if the filesystem is dirty. To prevent this kind of write access, you may want to mount an ext3 or ext4 filesystem with the B<ro,noload> mount options or set the block device itself to read-only mode, see the B<blockdev>(8) command.
de: Beachten Sie, dass abhängig vom Dateisystemtyp, dessen Status und dem Verhalten des Kernels das System noch immer auf das Gerät schreiben könnte. Zum Beispiel erneuern Ext3 und Ext4 das Journal, falls das Dateisystem verändert wurde. Um Schreibzugriffe dieser Art zu verhindern, könnten Sie ein Ext3- oder Ext4-Dateisystem mit den Optionen B<ro,noload> einhängen oder das blockorientierte Gerät selbst in den schreibgeschützten Modus versetzen, siehe den Befehl B<blockdev>(8).
fr: Remarquez que selon le type et l'état du système de fichiers et le comportement du noyau, le système peut continuer à écrire sur le périphérique. Par exemple, I<ext3> et I<ext4> rejoueront leurs journaux si le système de fichiers est « dirty ». Pour prévenir ce type d'accès en écriture, vous devriez monter les systèmes de fichiers I<ext3> ou I<ext4> avec les options de montage B<ro,noload> ou définir le périphérique bloc lui-même en mode lecture seule, consultez B<blockdev>(8).
pl: Proszę zauważyć że, w zależności od systemu plików, stanu i zachowania jądra, system może wciąż zapisywać na urządzenie. Na przykład ext3 lub ext4 będzie odświeżał swój dziennik, jeśli system plików jest zaśmiecony. Aby zapobiec takiemu typowi dostępu do zapisu, można zamontować system plików ext3 lub ext4 z opcją montowania B<ro,noload> lub ustawić urządzenie blokowe w trybie tylko do odczytu, patrz polecenie B<blockdev>(8).
uk: Зауважте, що, залежно від типу файлової системи, стану і поведінки ядра, система може продовжити запис на пристрій. Наприклад, ext3 і ext4 відтворять журнал, якщо якусь дію з файлової системи не завершено. Щоб запобігти цьому типу доступу до запису, ви можете змонтувати файлову систему ext3 або ext4 з використанням параметрів монтування B<ro,noload> або встановити для блокового пристрою режим лише запису, див. команду B<blockdev>(8).

source: Tolerate sloppy mount options rather than failing. This will ignore mount options not supported by a filesystem type. Not all filesystems support this option. Currently it\(cqs supported by the B<mount.nfs> mount helper only.
de: toleriert lockere Einhängeoptionen, anstatt fehlzuschlagen. Dadurch werden Einhängeoptionen ignoriert, die vom Dateisystemtyp nicht unterstützt werden. Nicht alle Dateisysteme unterstützen diese Option. Gegenwärtig wird sie nur vom Einhänge-Hilfsprogramm B<mount.nfs> unterstützt.
fr: Tolérer les options non valables plutôt qu'échouer. Cela permet d'ignorer les options non prises en charge par un type de système de fichiers. Tous les systèmes de fichiers ne prennent pas en charge cette option. Actuellement, elle n’est prise en charge que par l’auxiliaire de montage B<mount.nfs>.
pl: Toleruje nieodpowiednie opcje montowania, zamiast kończyć pracę niepowodzeniem. Powoduje to ignorowanie opcji montowania, które nie są obsługiwane przez dany system plików. Nie wszystkie systemy plików rozpoznają tę opcję. Obecnie jest ona rozpoznawana jedynie przez program pomocniczy B<mount.nfs>.
uk: Не зважати на некоректні параметри монтування, замість аварійного завершення роботи. У результаті параметри монтування, підтримку яких не передбачено у типі файлової системи, буде проігноровано. Підтримку цього параметра передбачено не для усіх файлових систем. У поточній версії підтримку передбачено лише для допоміжного засобу монтування B<mount.nfs>.

source: B<--source> I<device>
de: B<--source> I<Gerät>
fr: B<--source> I<périphérique>
pl: B<--source> I<urządzenie>
uk: B<--source> I<пристрій>

source: If only one argument for the B<mount> command is given, then the argument might be interpreted as the target (mountpoint) or source (device). This option allows you to explicitly define that the argument is the mount source.
de: erlaubt die explizite Angabe, dass das Argument die Einhängequelle ist. Falls nur ein Argument für den B<mount>-Befehl angegeben ist, dann könnte das Argument als Ziel (Einhängepunkt) oder Quelle (Gerät) interpretiert werden.
fr: Si un seul argument est donné pour la commande B<mount>, alors cet argument pourrait être interprété comme une cible (point de montage) ou une source (périphérique). Cette option permet de définir explicitement que l’argument est la source du montage.
pl: Jeśli podano tylko jeden argument dla polecenia montowania, to może on zostać zinterpretowany jako cel (punkt montowania) lub źródło (urządzenie). Ta opcja pozwala jawnie zdefiniować, że argument jest źródłem montowania.
uk: Якщо задано лише один аргумент команди B<mount>, аргумент може бути оброблено як ціль (точку монтування) або джерело (пристрій). За допомогою цього параметра можна явним чином, що аргумент є джерелом монтування.

source: B<--target> I<directory>
de: B<--target> I<Verzeichnis>
fr: B<--target> I<répertoire>
pl: B<--target> I<katalog>
uk: B<--target> I<каталог>

source: If only one argument for the mount command is given, then the argument might be interpreted as the target (mountpoint) or source (device). This option allows you to explicitly define that the argument is the mount target.
de: erlaubt die explizite Angabe, dass das Argument das Einhängeziel ist. Falls nur ein Argument für den Mount-Befehl angegeben ist, dann könnte das Argument als Ziel (Einhängepunkt) oder Quelle (Gerät) interpretiert werden.
fr: Si un seul argument est donné pour la commande de montage, alors cet argument pourrait être interprété comme une cible (point de montage) ou une source (périphérique). Cette option permet de définir explicitement que l’argument est la cible du montage.
pl: Jeśli podano tylko jeden argument dla polecenia montowania, to może on zostać zinterpretowany jako cel (punkt montowania) lub źródło (urządzenie). Ta opcja pozwala jawnie zdefiniować, że argument jest celem montowania.
uk: Якщо задано лише один аргумент команди mount, аргумент може бути оброблено як ціль (точку монтування) або джерело (пристрій). За допомогою цього параметра можна явним чином, що аргумент є ціллю монтування.

source: B<--target-prefix> I<directory>
de: B<--target-prefix> I<Verzeichnis>
fr: B<--target-prefix> I<répertoire>
pl: B<--target-prefix> I<katalog>
uk: B<--target-prefix> I<каталог>

source: Prepend the specified directory to all mount targets. This option can be used to follow I<fstab>, but mount operations are done in another place, for example:
de: stellt das angegebene Verzeichnis allen Einhängezielen voran. Mit dieser Option ist es möglich, der I<fstab> zu folgen, aber dennoch Einhängevorgänge an einem anderen Ort vorzunehmen, zum Beispiel:
fr: Préfixer avec le répertoire indiqué toutes les cibles de montage. Cette option peut être utilisée pour suivre I<fstab>, mais les opérations de montage sont réalisées ailleurs, par exemple :
pl: Dodaje podany katalog na początku wszystkich celów montowań. Przydatne do honorowania zapisów I<fstab>, lecz z punktami montowania w innym miejscu, np.
uk: Дописати вказаний каталог перед усіма цілями монтування. Цим параметром можна скористатися для відповідності I<fstab>, але дії з монтування буде виконано в іншому місці. Приклад:

source: mounts all from system I<fstab> to I</chroot>, all missing mountpoint are created (due to X-mount.mkdir). See also B<--fstab> to use an alternative I<fstab>.
de: hängt alles aus der systemweiten I<fstab> in I</chroot> ein, wobei alle fehlenden Einhängepunkte angelegt werden (aufgrund von X-mount.mkdir). Siehe auch B<--fstab> zum Verwenden einer alternativen I<fstab>.
fr: monte tout à partir du I<fstab> du système sur I</chroot>, tous les points de montage manquants sont créés (dû à B<X-mount.mkdir>). Consultez aussi B<--fstab> pour l’emploi d’un I<fstab> alternatif.
pl: montuje wszystkie systemy plików z I<fstab> do katalogu I</chroot>, przy czym wszystkie brakujące punkty montowań są tworzone (ze względu na opcję X-mount.mkdir). Patrz też opcja B<--fstab>, pozwalającą na użycie alternatywnego pliku I<fstab>.
uk: монтує усе з загальносистемного I<fstab> до I</chroot>, буде створено усі пропущені точки монтування (через X-mount.mkdir). Див. також B<--fstab> для використання альтернативного I<fstab>.

source: B<-T>, B<--fstab> I<path>
de: B<-T>, B<--fstab> I<Pfad>
fr: B<-T>, B<--fstab> I<chemin>
pl: B<-T>, B<--fstab> I<ścieżka>
uk: B<-T>, B<--fstab> I<шлях>

source: Specifies an alternative I<fstab> file. If I<path> is a directory, then the files in the directory are sorted by B<strverscmp>(3); files that start with "." or without an I<.fstab> extension are ignored. The option can be specified more than once. This option is mostly designed for initramfs or chroot scripts where additional configuration is specified beyond standard system configuration.
de: gibt eine alternative I<fstab>-Datei an. Falls der I<Pfad> ein Verzeichnis ist, dann werden die darin enthaltenen Dateien von B<strverscmp>(3) sortiert; Dateien, die mit ».« beginnen oder keine I<.fstab>-Endung haben, werden ignoriert. Diese Option kann mehr als einmal angegeben werden. Sie ist hauptsächlich für Initramfs- oder Chroot-Skripte gedacht, in denen zusätzliche Konfiguration angegeben wird, die über die Standardsystemkonfiguration hinausgeht.
fr: Indiquer un fichier I<fstab> alternatif. Si I<chemin> est un répertoire, alors les fichiers de ce répertoire sont triés par B<strverscmp>(3) ; les fichiers qui commencent par « B<.> » ou sans extension I<.fstab> sont ignorés. L’option peut être indiquée plus d’une fois. Cette option est surtout conçue pour les scripts d’initramfs ou de chroot où une configuration supplémentaire est indiquée au-delà de la configuration standard du système.
pl: Określa alternatywny plik I<fstab>. Jeśli I<ścieżka> jest katalogiem, to pliki w katalogu są sortowane za pomocą B<strverscmp>(3); pliki zaczynające się od "." lub nieposiadające rozszerzenia I<.fstab> są ignorowane. Można podać tę opcję więcej niż jeden raz. Jest ona właściwie przeznaczona dla skryptów chroot i initramfs, gdy podawana jest dodatkowa konfiguracja poza standardową konfiguracją systemu.
uk: Вказує альтернативний файл I<fstab>. Якщо I<шлях> є каталогом, файли у каталозі буде упорядковано B<strverscmp>(3); файли, назви яких починаються з «.» або не мають суфікса I<.fstab>, буде проігноровано. Параметр можна вказати декілька разів. Цей параметр, здебільшого, було створено для скриптів initramfs або chroot, де вказано додаткові налаштування поза стандартними налаштуваннями системи.

source: Note that B<mount> does not pass the option B<--fstab> to the B</sbin/mount.>I<type> helpers, meaning that the alternative I<fstab> files will be invisible for the helpers. This is no problem for normal mounts, but user (non-root) mounts always require I<fstab> to verify the user\(cqs rights.
de: Beachten Sie, dass B<mount> die Option B<--fstab> nicht an die B</sbin/mount.>I<Typ>-Hilfsprogramme übergibt, was zur Folge hat, dass alternative I<fstab>-Dateien für die Hilfsprogramme nicht sichtbar sind. Für normale Einhängungen ist das kein Problem, aber Einhängungen durch Benutzer (nicht als »root«) benötigen stets die I<fstab>, um die Rechte des Benutzers zu überprüfen.
fr: Remarquez que B<mount> ne passe pas l’option B<--fstab> à l’auxiliaire B</sbin/mount.>I<type>, ce qui signifie que les fichiers I<fstab> alternatifs seront invisibles aux auxiliaires. Ce n’est pas un problème pour les montages normaux, mais les montages d’utilisateurs ordinaires nécessitent toujours I<fstab> pour vérifier les droits de l’utilisateur.
pl: Proszę zauważyć, że B<mount> nie przekazuje opcji B<--fstab> programom pomocniczym B</sbin/mount.>I<typ>, co oznacza, że alternatywne pliki I<fstab> będą dla nich niewidoczne. Nie jest to problemem przy normalnych montowaniach, ale montowania wykonywane przez użytkownika (nie roota) zawsze wymagają I<fstab> w celu weryfikacji jego uprawnień.
uk: Зауважте, що B<mount> не передає параметр B<--fstab> допоміжним засобам B</sbin/mount.>I<тип>, що означає, що альтернативні файли I<fstab> будуть невидимими для допоміжних засобів. Це не проблема для звичайних монтувань, але користувацькі (не від імені root) монтування завжди потребують I<fstab> для перевірки прав доступу користувача.

source: B<-t>, B<--types> I<fstype>
de: B<-t>, B<--types> I<Typ>
fr: B<-t>, B<--types> I<type_sf>
pl: B<-t>, B<--types> I<typ_systemu_plików>
uk: B<-t>, B<--types> I<тип_файлової_системи>

source: The argument following the B<-t> is used to indicate the filesystem type. The filesystem types which are currently supported depend on the running kernel. See I</proc/filesystems> and I</lib/modules/$(uname -r)/kernel/fs> for a complete list of the filesystems. The most common are ext2, ext3, ext4, xfs, btrfs, vfat, sysfs, proc, nfs and cifs.
de: bezeichnet durch das auf B<-t> folgende Argument den Typ des Dateisystems. Die aktuell unterstützten Dateisysteme sind vom laufenden Kernel abhängig. Siehe I</proc/filesystems> und I</lib/modules/$(uname -r)/kernel/fs> für eine vollständige Liste der Dateisysteme. Die gebräuchlichsten sind ext2, ext3, ext4, xfs, btrfs, vfat, sysfs, proc, nfs und cifs.
fr: L’argument suivant le B<-t> est utilisé pour indiquer le type de système de fichiers. Les types de systèmes de fichiers actuellement pris en charge dépendent du noyau utilisé. Consultez I</proc/filesystems> et I</lib/modules/$(uname -r)/kernel/fs> pour une liste complète de systèmes de fichiers. Les plus communs sont I<ext2>, I<ext3>, I<ext4>, I<xfs>, I<btrfs>, I<vfat>, I<sysfs>, I<proc>, I<nfs> et I<cifs>.
pl: Argument opcji B<-t> określa typ systemu plików. To, jakie typy systemów plików są obecnie obsługiwane, zależy od jądra. Pełną listę można uzyskać sprawdzając pliki I</proc/filesystems> i I</lib/modules/$(uname -r)/kernel/fs>. Najpopularniejsze typy to: ext2, ext3, ext4, xfs, btrfs, vfat, sysfs, proc, nfs i cifs.
uk: Аргумент після B<-t> буде використано для того, щоб вказати тип файлової системи. Перелік підтримуваних у поточній версії файлових систем залежить від запущеного ядра. Див. I</proc/filesystems> та I</lib/modules/$(uname -r)/kernel/fs>, які надають повний список файлових систем. Найпоширенішими є ext2, ext3, ext4, xfs, btrfs, vfat, sysfs, proc, nfs та cifs.

source: The programs B<mount> and B<umount>(8) support filesystem subtypes. The subtype is defined by a \(aq.subtype\(aq suffix. For example \(aqfuse.sshfs\(aq. It\(cqs recommended to use subtype notation rather than add any prefix to the mount source (for example \(aqsshfs#example.com\(aq is deprecated).
de: Die Programme B<mount> und B<umount>(8) unterstützen Untertypen der Dateisysteme. Der Untertyp wird duch die Endung der Form ».Untertyp« definiert, zum Beispiel »fuse.sshfs«. Es wird empfohlen, diese Untertyp-Notation zu verwenden, anstatt den untertyp der Einhängequelle voranzustellen (zum Beispiel ist »sshfs#example.com« veraltet).
fr: Les programmes B<mount> et B<umount>(8) gèrent les I<sous-types> de systèmes de fichiers. Le sous-type est défini par un suffixe « B<.>I<sous-type> ». Par exemple, « fuse.sshfs ». Vous devriez plutôt utiliser la notation de sous-type que d'ajouter un préfixe à la source de montage (par exemple « sshfs#example.com » est obsolète).
pl: Programy B<mount> i B<umount>(8) obsługują podtypy systemów plików. Podtypy są definiowane przyrostkiem ".podtyp". Przykładowo "fuse.sshfs". Zalecane jest używanie notacji podtypów zamiast dodawać jakieś przedrostki do źródła montowania (np. "sshfs#example.com" jest przestarzałe).
uk: У програмах B<mount> і B<umount> передбачено підтримку підтипів файлових систем. Підтип визначається суфіксом «subtype». Наприклад, «fusesshfs». Рекомендується використовувати підтипи, ніж додавати префікс до джерела монтування (наприклад, «sshfs#example.com» є застарілим).

source: If no B<-t> option is given, or if the B<auto> type is specified, B<mount> will try to guess the desired type. B<mount> uses the B<libblkid>(3) library for guessing the filesystem type; if that does not turn up anything that looks familiar, B<mount> will try to read the file I</etc/filesystems>, or, if that does not exist, I</proc/filesystems>. All of the filesystem types listed there will be tried, except for those that are labeled "nodev" (e.g. I<devpts>, I<proc> and I<nfs>). If I</etc/filesystems> ends in a line with a single *, mount will read I</proc/filesystems> afterwards. While trying, all filesystem types will be mounted with the mount option B<silent>.
de: Falls die Option B<-t> nicht oder der Typ als B<auto> angegeben ist, versucht B<mount>, den gewünschten Typ zu erraten. B<mount> verwendet die B<libblkid>(3)-Bibliothek zur Ermittlung des Dateisystemtyps; falls dies nichts Brauchbares ergibt, wird versucht, die Datei I</etc/filesystems> zu lesen. Sollte diese nicht existieren, dann I</proc/filesystems>. Alle der dort aufgelisteten Dateisystemtypen werden versucht, außer jene, die mit »nodev« bezeichnet sind (zum Beispiel I<devpts>, I<proc> und I<nfs>). Falls I</etc/filesystems> mit einer Zeile mit einem einzelnen »*« endet, liest Mount danach die Datei I</proc/filesystems>. Während der Versuche werden alle Dateisystemtypen mit der Option B<silent> eingehängt.
fr: Si aucune option B<-t> n'est mentionnée, ou si le type B<auto> est précisé, B<mount> essayera de deviner le type désiré. B<mount> utilise la bibliothèque B<libblkid>(3) pour deviner le type de système de fichiers. S'il ne trouve rien qui lui soit familier, B<mount> essaiera de lire le fichier I</etc/filesystems> ou, s'il n'existe pas, I</proc/filesystems>. Tous les types de systèmes de fichiers indiqués seront essayés, sauf ceux marqués « nodev » (par exemple I<devpts>, I<proc> et I<nfs>). Si I</etc/filesystems> se termine par une ligne contenant un seul I<*>, B<mount> lira ensuite I</proc/filesystems>. Durant l'essai, tous les types de systèmes de fichiers seront montés avec l’option de montage B<silent>.
pl: Bez podania opcji B<-t> lub gdy podany jest typ B<auto>, B<mount> postara się odgadnąć właściwy typ. B<mount> używa biblioteki B<libblkid>(3) do tego celu; jeśli nie zwróci to niczego, co wygląda znajomo, B<mount> postara się odczytać plik I</etc/filesystems> lub, jeśli on nie istnieje I</proc/filesystems>. Wszystkie wypisane tam typy zostaną wypróbowane, z wyjątkiem tych oznaczonych jako "nodev" (np. I<devpts>, I<proc> i I<nfs>). Jeśli I</etc/filesystems> kończy się wierszem z pojedynczą *, mount odczyta później plik I</proc/filesystems>. Podczas tych prób, wszystkie typy systemów plików będą montowane z opcją montowania B<silent>.
uk: Якщо параметр B<-t> не задано або якщо вказано тип B<auto>, B<mount> спробує вгадати бажаний тип. Для визначення типу файлової системи B<mount> використовує бібліотеку B<libblkid>(3); якщо бібліотеці не вдасться знайти щось знайоме, B<mount> спробує прочитати файл I</etc/filesystems> або, якщо файла не існує, I</proc/filesystems>. Буде виконано спробу скористатися усіма типами файлових системи зі списку, окрім тих, які позначено міткою «nodev» (наприклад, I<devpts>, I<proc> і I<nfs>). Якщо I</etc/filesystems> завершується рядком із одинарним *, після цього mount прочитає I</proc/filesystems>. Під час виконання спроб усі типи файлових систем буде змонтовано з параметром монтування B<silent>.

source: The B<auto> type may be useful for user-mounted floppies. Creating a file I</etc/filesystems> can be useful to change the probe order (e.g., to try vfat before msdos or ext3 before ext2) or if you use a kernel module autoloader.
de: Der Typ B<auto> kann für Disketten nützlich sein, die vom Benutzer eingehängt werden. Die Erstellung einer Datei I</etc/filesystems> ist sinnvoll, um die Reihenfolge der Versuche anzupassen (zum Beispiel wenn VFAT vor MSDOS oder Ext3 vor Ext2 versucht werden soll) oder wenn Sie Kernelmodule automatisch laden.
fr: Le type B<auto> peut être utile pour des disquettes montées par l'utilisateur. Créer un fichier I</etc/filesystems> permet de changer l'ordre d'essai (par exemple I<vfat> avant I<msdos>, ou I<ext3> avant I<ext2>) ou d'utiliser un autochargeur de modules pour le noyau.
pl: Typ B<auto> może być przydatny do montowanych przez użytkownika dyskietek. Utworzenie pliku I</etc/filesystems> przydaje się do zmiany kolejności rozpoznawania (np. do próbowania vfat przed msdos lub ext3 przez ext2) lub w przypadku stosowania modułu autoloadera.
uk: Тип B<auto> може бути корисним для змонтованих користувачем дискет. Створення файла I</etc/filesystems> може бути корисним для зміни порядку зондування (наприклад, щоб спробу скористатися vfat було виконано перед спробою скористатися msdos або ext3 мала вищий пріоритет, ніж ext2), або якщо ви користуєтеся автоматичним завантаженням модулів ядра.
