Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: With the “nfs_export” feature, on copy_up of any lower object, an index entry is created under the index directory. The index entry name is the hexadecimal representation of the copy up origin file handle. For a non-directory object, the index entry is a hard link to the upper inode. For a directory object, the index entry has an extended attribute "{B<trusted>|B<user>}.overlay.upper" with an encoded file handle of the upper directory inode.
de: bei der Kopie eines niedrigen Objektes wird bei der Funktionalität »nfs_export« ein Indexverzeichnis erstellt. Der Indexeintragsname ist die hexadezimale Darstellung des hochkopierten Ursprungs-Datei-Handles. Für ein Objekt, das kein Verzeichnis ist, ist der Indexeintrag ein harter Link auf die obere Inode. Für ein Verzeichnisobjekt verfügt der Indexeintrag über das erweiterte Attribut »{B<trusted>|B<user>}.overlay.upper« mit einem einkodierten Datei-Handle der oberen Verzeichnis-Inode.
uk: Якщо доступною є можливість «nfs_export» виконання copy_up над будь-яким нижчим об'єктом призведе до створення запису покажчика у каталозі покажчика. Назва запису покажчика є шістнадцятковим представленням скопійованого початкового дескриптора файла. Для об'єкта, який не є каталогом, запис покажчика є жорстким посиланням на вищий inode. Для об'єкта каталогу запис покажчика має розширений атрибут «{B<trusted>|B<user>}.overlay.upper» із закодованим дескриптором файла inode вищого каталогу.

source: B<mount LABEL=mydisk -o noatime,nodev,nosuid>
pl: B<mount LABEL=moj_dysk -o noatime,nodev,nosuid>

source: mount -t overlay overlay \(rs -olowerdir=/lower,upperdir=/upper,workdir=/work /merged
pl: mount -t overlay overlay \(rs -olowerdir=/dolny,upperdir=/gorny,workdir=/katal-rob /poloczone

source: B<mount -t overlay overlay \e> B<-olowerdir=/lower,upperdir=/upper,workdir=/work /merged>
pl: B<mount -t overlay overlay \e> B<-olowerdir=/dolny,upperdir=/gorny,workdir=/katal-rob /poloczone>
