Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: You can set the default security context for unlabeled files using B<defcontext=> option. This overrides the value set for unlabeled files in the policy and requires a filesystem that supports xattr labeling.
de: Sie können den standardmäßigen Sicherheitskontext für nicht mit Labeln gekennzeichnete Dateien mit der Option B<defcontext=> setzen. Dies setzt den für nicht mit Labeln gekennzeichnete Dateien in der Richtlinie gesetzten Wert außer Kraft und erfordert ein Dateisystem, das Xattr-Label unterstützt.
fr: Vous pouvez définir le contexte de sécurité par défaut pour les fichiers non étiquetés avec l'option B<defcontext=>. Cela surcharge la valeur par défaut définie pour les fichiers non étiquetés de la stratégie de sécurité et nécessite un système de fichiers qui gère l'étiquetage B<xattr>.
pl: Można ustawić domyślny kontekst bezpieczeństwa do plików bez etykiety, przy użyciu opcji B<defcontext=>. Przesłania ona wartość ustawioną przez zasady (politykę) do plików bez etykiety i wymaga systemu plików obsługującego etykietowanie xattr.
uk: Типовий контекст безпеки для файлів без міток можна встановити за допомогою параметра B<defcontext=>. Це замінить значення, встановлене для файлів без міток у політиці, і вимагає файлової системи, яка підтримує мітки xattr.

source: The B<rootcontext=> option allows you to explicitly label the root inode of a FS being mounted before that FS or inode becomes visible to userspace. This was found to be useful for things like stateless Linux.
de: Die Option B<rootcontext=> ermöglicht die explizite Kennzeichnung des Wurzel-Inodes eines einzuhängenden Dateisystems mit Labeln, bevor das Dateisystem oder Inode für den Benutzer sichtbar wird. Nützlich ist dies zum Beispiel für ein zustandsloses Linux.
fr: L'option B<rootcontext=> permet d'étiqueter explicitement l'inœud racine d'un système de fichiers avant que l'inœud ou le système de fichiers en cours de montage ne devienne visible depuis l'espace utilisateur. Cela s'est avéré utile pour des noyaux Linux « stateless ».
pl: Opcja B<rootcontext=> pozwala na jawne podanie etykiety głównego i-węzła systemu plików przez tym, zanim ten system plików lub i-węzeł stanie się widoczny dla przestrzeni użytkownika. Może być to przydatne przy wykorzystaniu bezdyskowego Linuksa.
uk: Параметр B<rootcontext=> дозволяє явно позначити кореневий індекс монтованої файлової системи до того, як ця файлова система або inode стануть видимими в просторі користувача. Це виявилося корисним для таких речей, як Stateless Linux.

source: B<Warning: the >I<context>B< value might contain commas>, in which case the value has to be properly quoted, otherwise B<mount>(8) will interpret the comma as a separator between mount options. Don't forget that the shell strips off quotes and thus B<double quoting is required>. For example:
de: B<Warnung: Der Wert von >I<context>B< könnte Kommata enthalten>. In einem solchen Fall muss der Wert sauber in Anführungszeichen gesetzt werden, anderenfalls interpretiert B<mount>(8) das Komma als Trenner zwischen Einhängeoptionen. Denken Sie daran, dass die Shell einfache Anführungszeichen entfernt und daher B<doppelte erforderlich sind>. Zum Beispiel:
fr: B<Avertissement> : la valeur I<contexte> pourrait contenir des virgules, auquel cas, la valeur doit être protégée correctement sinon B<mount>(8) interprétera la virgule comme un séparateur entre options de montage. N’oubliez pas que l’interpréteur de commandes supprime les guillemets simples et que B<des guillemets doubles sont donc nécessaires>. Par exemple :
pl: B<Uwaga: wartość >I<context>B< może zawierać przecinki>, ale musi być wówczas odpowiednio cytowana, ponieważ w przeciwnym wypadku B<mount>(8) zinterpretuje przecinki jako separatory pomiędzy punktami montowań. Proszę nie zapomnieć, że powłoka usunie cytowanie, dlatego B<konieczne jest podwójne cytowanie> np.:
uk: B<Попередження: значення> I<контекст> B<може містити коми>. У цьому випадку значення має бути належним чином екрановано (взято у лапки), інакше, B<mount>(8) вважатиме кому роздільником між параметрами монтування. Не забувайте, що командна оболонка прибирає екранування, а тому B<потрібне подвійне екранування>. Приклад:

source: Note that the real set of all default mount options depends on the kernel and filesystem type. See the beginning of this section for more details.
de: Beachten Sie, dass der reale Satz aller vorgegebenen Einhängeoptionen vom Kernel und Dateisystemtyp abhängt. Am Anfang dieses Abschnitts finden Sie weitere Details.
fr: Remarquez que le véritable ensemble de toutes les options de montage par défaut dépend du noyau et du type de système de fichiers. Consultez le début de cette section pour plus de précisions.
pl: Proszę zauważyć, że rzeczywisty zestaw domyślnych opcji montowania zależy od jądra i typu systemu plików. Więcej szczegółów na początku tego rozdziału.
uk: Зауважте, що справжній набір усіх типових параметрів монтування залежить від ядра системи та типу файлової системи. Див. початок цього розділу, щоб дізнатися більше.

source: Update directory inode access times on this filesystem. This is the default. (This option is ignored when B<noatime> is set.)
de: aktualisiert die Inode-Zugriffszeiten für Verzeichnisse auf diesem Dateisystem. Dies ist die Standardeinstellung. Diese Option wird ignoriert, wenn B<noatime> gesetzt ist.
fr: Mettre à jour les horodatages d'accès d'inœuds sur ce système de fichiers. Option par défaut (ignorée quand B<noatime> est défini).
pl: Aktualizuje czas dostępu katalogu zapisany w i-węźle w danym systemie plików. Tak jest domyślnie. (Ta opcja jest ignorowana, gdy ustawiono B<noatime>).
uk: Оновлювати часи доступу до inode каталогів у цій файловій системі. Це типова поведінка. (Цей параметр буде проігноровано, якщо встановлено B<noatime>.)

source: Do not update directory inode access times on this filesystem. (This option is implied when B<noatime> is set.)
de: aktualisiert die Inode-Zugriffszeiten für Verzeichnisse auf diesem Dateisystem nicht. Diese Option ist impliziert, wenn B<noatime> gesetzt ist.
fr: Ne pas mettre à jour les horodatages d'accès d'inœuds sur ce système de fichiers. Cette option est implicite quand B<noatime> est défini.
pl: Aktualizuje czas dostępu katalogu zapisany w i-węźle w danym systemie plików (ta opcja jest dorozumiana, gdy ustawiono B<noatime>).
uk: Не оновлювати часи доступу до inode каталогів у цій файловій системі. (Цей параметр буде встановлено неявним чином, якщо встановлено B<noatime>.)

source: All directory updates within the filesystem should be done synchronously. This affects the following system calls: creat, link, unlink, symlink, mkdir, rmdir, mknod and rename.
de: Alle Verzeichnisaktualisierungen innerhalb des Dateisystems sollten synchron geschehen. Dies betrifft die folgenden Systemaufrufe: creat, link, unlink, symlink, mkdir, rmdir, mknod und rename.
fr: Toutes les mises à jour de répertoires du système de fichiers devraient être réalisées de façon synchrone. Cela concerne les appels système suivants : B<creat>, B<link>, B<unlink>, B<symlink>, B<mkdir>, B<rmdir>, B<mknod> et B<rename>.
pl: Aktualizacja wszystkich katalogów w systemie plików powinna być wykonywana synchronicznie. Dotyka to następujących wywołań systemowych: creat, link, unlink, symlink, mkdir, rmdir, mknod i rename.
uk: Усі оновлення каталогів у файловій системі має бути виконано синхронно. Це стосується таких системних викликів: creat, link, unlink, symlink, mkdir, rmdir, mknod і rename.

source: Permit execution of binaries.
de: erlaubt die Ausführung von Programmen.
fr: Permettre l'exécution de fichiers binaires.
pl: Zezwala na uruchamianie plików binarnych.
uk: Дозволити виконання двійкових файлів.

source: Allow an ordinary user to mount the filesystem if one of that user's groups matches the group of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<group,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen eines Dateisystems, falls eine der Gruppen des Benutzers der Gruppe des Gerätes entspricht. Diese Option impliziert die Optionen B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<group,dev,suid>).
fr: Autoriser un utilisateur ordinaire à monter le système de fichiers si l’un des groupes de cet utilisateur correspond au groupe du périphérique. Cette option implique les options B<nosuid> et B<nodev> (à moins qu'elles ne soient annulées par d'autres options comme dans la ligne d'options B<group,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika, jeśli jedna z grup tego użytkownika pasuje do grup urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<group,dev,suid>).
uk: Дозволити звичайному користувачеві монтувати файлову систему, якщо одна із груп користувача збігається із групою пристрою. Цей параметр неявним чином встановлює параметри B<nosuid> і B<nodev> (якщо їх не перевизначено наступними параметрами, як у рядку параметрів B<group,dev,suid>).

source: Allow mandatory locks on this filesystem. See B<fcntl>(2).
de: erlaubt zwingende Sperren auf diesem Dateisystem. Siehe B<fcntl>(2).
fr: Permettre les verrouillages obligatoires sur ce système de fichiers. Consultez B<fcntl>(2).
pl: Pozwala na ściśle egzekwowane blokady w systemie plików. Patrz B<fcntl>(2).
uk: Дозволити обов'язкові блокування на цій файловій системі. Див. B<fcntl>(2).

source: Update inode access times relative to modify or change time. Access time is only updated if the previous access time was earlier than the current modify or change time. (Similar to B<\%noatime>, but it doesn't break B<mutt> or other applications that need to know if a file has been read since the last time it was modified.)
de: aktualisiert die Inode-Zugriffszeiten relativ zur Daten- oder Statusänderungszeit. Die Zugriffszeit wird nur aktualisiert, wenn die vorige Zugriffszeit tatsächlich vor der aktuellen Änderungszeit liegt. Dies ist ähnlich zu B<\%noatime>, aber behindert B<mutt> oder ähnliche Anwendungen nicht, die darüber informiert sein müssen, ob eine Datei seit dem letzten Änderungszeitpunkt gelesen wurde.
fr: Mettre à jour les horodatages d'accès à l’inœud par rapport à l’horodatage de modification. L’horodatage d'accès est mis à jour seulement si le précédent horodatage d'accès est antérieur à l’horodatage de modification (c'est équivalent à l'option B<\%noatime>, mais permet aux applications, comme B<mutt>, de savoir si un fichier a été lu depuis sa dernière modification).
pl: Aktualizuje czas dostępu i-węzła relatywnie do czasu modyfikacji lub zmiany. Czas dostępu jest aktualizowany tylko wówczas, jeśli poprzedni czas dostępu był wcześniejszy od bieżącego czasu modyfikacji lub zmiany (podobne do B<\%noatime>, ale nie psuje aplikacji B<mutt> i innych, które potrzebują informacji o tym, czy plik zostać przeczytany od czasu jego ostatniej modyfikacji).
uk: Оновлювати часи доступу до inode відносно часу внесення змін. Час доступу буде оновлено, лише якщо час попереднього доступу передував поточному часу внесення змін. (Подібний до B<\%noatime>, але не порушує роботу B<mutt> або інших програм, які потребують даних щодо того, чи виконувалося читання файла з моменту, коли до файла востаннє було внесено зміни.)

source: Since Linux 2.6.30, the kernel defaults to the behavior provided by this option (unless B<\%noatime> was specified), and the B<\%strictatime> option is required to obtain traditional semantics. In addition, since Linux 2.6.30, the file's last access time is always updated if it is more than 1 day old.
de: Seit Linux 2.6.30 verhält sich der Kernel standardmäßig nach den Angaben dieser Option (außer wenn B<\%noatime> angegeben wurde) und erfordert die Option B<\%strictatime> für die traditionelle Semantik. Außerdem wird seit Linux 2.6.30 die letzte Zugriffszeit immer aktualisiert, wenn diese länger als einen Tag zurückliegt.
fr: Depuis Linux 2.6.30, le comportement par défaut du noyau est celui fourni par cette option (sauf si B<\%noatime> a été indiquée), et l'option B<\%strictatime> est nécessaire pour obtenir les sémantiques traditionnelles. De plus, depuis Linux 2.6.30, la date de dernier accès au fichier est toujours mise à jour si elle est vieille de plus d'un jour.
pl: Od Linuksa w wersji 2.6.30, jądro używa domyślnie zachowania udostępnianego przez tę opcję (chyba że podano B<noatime>), a opcja B<strictatime> jest wymagana, aby uzyskać tradycyjny sposób działania. Dodatkowo, od tej wersji Linuksa, czas ostatniego dostępu pliku jest aktualizowany zawsze, jeśli wynosi więcej niż 1 dzień.
uk: Починаючи Linux 2.6.30, типову поведінку ядра змінено на поведінку із цим увімкненим параметром (якщо не вказано B<\%noatime>). Для отримання традиційної семантики слід вказати параметр B<\%strictatime>. Крім того, починаючи з Linux 2.6.30, час останнього доступу до файла завжди оновлюється, якщо з моменту попереднього оновлення минула 1 доба.

source: Do not use the B<relatime> feature. See also the B<strictatime> mount option.
de: verwendet die Funktion B<relatime> nicht. Siehe auch die Einhängeoption B<strictatime>.
fr: Ne pas utiliser la fonctionnalité B<relatime>. Consultez aussi l'option de montage B<strictatime>.
pl: Nie używa funkcji B<relatime>. Patrz również opcja montowania B<strictatime>.
uk: Не використовувати можливість B<relatime>. Див. також параметр монтування B<strictatime>.

source: Allows to explicitly request full atime updates. This makes it possible for the kernel to default to B<\%relatime> or B<\%noatime> but still allow userspace to override it. For more details about the default system mount options see I</proc/mounts>.
de: ermöglicht die explizite Anforderung vollständiger Atime-Aktualisierungen. Dadurch wird es für den Kernel möglich, standardmäßig B<\%relatime> oder B<\%noatime> zu verwenden, dies aber dennoch benutzerseitig außer Kraft setzen zu lassen. Für weitere Details zu den standardmäßigen Einhängeoptionen des Systems siehe I</proc/mounts>.
fr: Demander explicitement une mise à jour complète des horodatages d'accès. Cela permet au noyau d'utiliser B<\%relatime> ou B<\%noatime> par défaut, mais il est toujours possible de changer cela depuis l'espace utilisateur. Pour plus de précisions sur les options de montage par défaut, consultez I</proc/mounts>.
pl: Pozwala na jawne żądanie pełnych aktualizacji atime. Umożliwia jądru na domyślne używanie B<relatime> lub B<noatime>, ale wciąż pozwala warstwie użytkownika na przesłonięcie tych opcji. Aby dowiedzieć się więcej o domyślnych, systemowych opcjach montowania należy zapoznać się z I</proc/mount>.
uk: Дозволяє явним чином надіслати запит щодо повних оновлень atime. Це робить можливим для ядра типово використовувати B<\%relatime> або B<\%noatime>, але попри це надавати змогу перевизначати це у просторі користувача. Щоб дізнатися про типові параметри монтування файлової системи, див. I</proc/mounts>.

source: Use the kernel's default behavior for inode access time updates.
de: verwendet das Standardverhalten des Kernels zum Aktualisieren der Inode-Zugriffszeiten.
fr: Utiliser le comportement par défaut du noyau pour la mise à jour des horodatages d'accès aux inœuds.
pl: Używa domyślnego zachowania jądra dotyczącego aktualizowania czasów dostępu i-węzłów.
uk: Використовувати типову поведінку ядра для оновлень часу доступу до inode.

source: more than 24 hours have passed since the i-node was written to disk.
de: mehr als 24 Stunden vergangen sind, seit der Inode auf die Platte geschrieben wurde.
fr: plus de 24 heures se sont écoulées depuis que l’inœud a été écrit sur le disque.
pl: minęło ponad 24 godziny od czasu zapisania i-węzła na dysk.
uk: минуло понад 24 годин з часу, коли inode було записано на диск.

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem.
de: respektiert die Bits oder Datei-Capabilities »set-user-ID« und »set-group-ID« bei der Ausführung von Programmen von diesem Dateisystem nicht.
fr: Ne pas tenir compte des bits Set-UID et Set-GID ou des capacités de fichier lors de l'exécution de programmes de ce système de fichiers.
uk: Не брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконання програм з цієї файлової системи.

source: Allow an ordinary user to mount the filesystem if that user is the owner of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<owner,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen eines Dateisystems, falls dieser Eigentümer des Gerätes ist. Diese Option impliziert die Optionen B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<owner,dev,suid>).
fr: Autoriser un utilisateur ordinaire à monter le système de fichiers si cet utilisateur est propriétaire du périphérique. Cette option implique les options B<nosuid> et B<nodev> (à moins qu'elles ne soient annulées par d'autres options comme dans la ligne d'options B<owner,dev,suid>).
pl: Pozwala każdemu zwykłemu użytkownikowi na zamontowanie i odmontowanie systemu plików, jeśli jest on właścicielem urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<owner,dev,suid>).
uk: Дозволити звичайному користувачеві монтувати файлову систему, якщо цей користувач є власником пристрою. Цей параметр неявним чином встановлює параметри B<nosuid> і B<nodev> (якщо їх не перевизначено наступними параметрами, як у рядку параметрів B<owner,dev,suid>).

source: Attempt to remount an already-mounted filesystem. This is commonly used to change the mount flags for a filesystem, especially to make a readonly filesystem writable. It does not change device or mount point.
de: versucht, ein bereits eingehängtes Dateisystem erneut einzuhängen. Dies wird üblicherweise dazu verwendet, die Einhänge-Schalter eines Dateisystems zu ändern, insbesondere um ein schreibgeschütztes Dateisystem les- und schreibbar zu machen. Das Gerät oder der Einhängepunkt werden dadurch nicht verändert.
fr: Tenter de remonter un système de fichiers déjà monté. C'est utilisé pour changer les attributs de montage d'un système de fichiers, principalement pour autoriser l'écriture sur un système de fichiers en lecture seule. Cela ne change ni le périphérique ni le point de montage.
pl: Usiłuje ponownie zamontować już zamontowany system plików. Często używane do zmiany flag montowania systemu, szczególnie aby umożliwić zapis na systemach tylko do odczytu. Nie zmienia urządzenia ani punktu montowania.
uk: Спробувати повторно змонтувати вже змонтовану файлову систему. Цим, зазвичай, користуються для зміни прапорців монтування файлової системи, особливо для того, щоб зробити призначену лише для читання файлову систему придатною до запису. Не змінює пристрою чи точки монтування.

source: The remount functionality follows the standard way the B<mount> command works with options from I<fstab>. This means that B<mount> does not read I<fstab> (or I<mtab>) only when both I<device> and I<dir> are specified.
de: Die Remount-Funktionalität folgt dem Standardweg, wie der Befehl B<mount> mit den Optionen aus der I<fstab>-Datei umgeht. Das bedeutet, dass B<mount> die I<fstab>- oder I<mtab>-Datei nicht liest, wenn sowohl I<Gerät> als auch I<Verzeichnis> angegeben sind.
fr: La fonctionnalité de remontage suit la façon habituelle dont la commande B<mount> fonctionne avec les options de I<fstab>. Cela signifie que la commande B<mount> ne lit pas I<fstab> (ou I<mtab>), seulement si I<périphérique> et I<répertoire> sont tous deux indiqués.
pl: Funkcja ponownego montowania przestrzega standardowego sposobu, w jaki polecenie B<mount> działa z opcjami z I<fstab>. Oznacza to, że polecenie B<mount> nie odczytuje I<fstab> (lub I<mtab>) wyłącznie wtedy, jeśli podano zarówno I<urządzenie> jak I<katalog>.
uk: У функціональній можливості повторного монтування реалізовано стандартний спосіб роботи команди B<mount> із параметрами з I<fstab>. Це означає, що B<mount> не читатиме I<fstab> (або I<mtab>), лише якщо одразу вказано I<пристрій> і I<каталог>.

source: After this call all old mount options are replaced and arbitrary stuff from I<fstab> (or I<mtab>) is ignored, except the loop= option which is internally generated and maintained by the mount command.
de: Nach diesem Aufruf werden alle alten Einhängeoptionen ersetzt und jegliche Angaben aus I<fstab> oder I<m>tab ignoriert, außer die Option B<loop=>, die intern erzeugt und vom Befehl B<mount> verwaltet wird.
fr: Après cet appel, toutes les anciennes options de montage sont remplacées et les options arbitraires du fichier I<fstab> (ou I<mtab>) sont ignorées, à part l’option B<loop=> qui est générée en interne et maintenue par la commande B<mount>.
pl: Po tym wywołaniu wszystkie stare opcje montowania są zastępowane, a arbitralne rzeczy z I<fstab> (lub I<mtab>) są ignorowane, z wyjątkiem opcji loop=, która jest tworzona i zarządzana wewnętrznie przez polecenie mount.
uk: Після цього виклику усі старі параметри монтування буде замінено, а довільні дані з I<fstab> (або I<mtab>) буде проігноровано, окрім параметра loop=, який буде створено на внутрішньому рівні і який буде супроводжуватися програмою mount.

source: After this call, mount reads I<fstab> and merges these options with the options from the command line (B<-o>). If no mountpoint is found in I<fstab>, then a remount with unspecified source is allowed.
de: Nach diesem Aufruf liest B<mount> die I<fstab>-Datei und führt diese Optionen mit den Befehlszeilenoptionen zusammen (B<-o>). Wenn in der I<fstab> kein Einhängepunkt gefunden wird, dann ist erneutes Einhängen ohne angegebene Quelle erlaubt.
fr: Après cet appel, B<mount> lit I<fstab> et fusionne ces options avec les options de la ligne de commande (B<-o>). Si aucun point de montage n’est trouvé dans I<fstab>, alors le remontage sans source indiquée est permis.
pl: Po tym wywołaniu mount odczytuje I<fstab> i łączy te opcje z opcjami podanymi w wierszu poleceń (B<-o>). Jeśli we I<fstab> nie będzie podanego punktu montowania, to dopuszczalne jest przemontowanie z niezdefiniowanego źródła.
uk: Після цього виклику mount читає I<fstab> і об'єднує ці параметри з параметрами з рядка команди (B<-o>). Якщо в I<fstab> не буде знайдено точки монтування, буде дозволено повторне монтування без визначення джерела.

source: B<mount> allows the use of B<--all> to remount all already mounted filesystems which match a specified filter (B<-O> and B<-t>). For example:
de: Den Befehl B<mount> können Sie mit B<--all> zum erneuten Einhängen bereits eingehängter Dateisysteme verwenden, die einem angegebenen Filter entsprechen (B<-O> und B<-t>). Beispiel:
fr: B<mount>(8) permet d’utiliser B<--all> pour remonter tous les systèmes de fichiers déjà montés qui correspondent avec un filtre indiqué (B<-O> et B<-t>). Par exemple :
uk: B<mount> уможливлює використання B<--all> для повторного монтування усіх вже змонтованих файлових систем, які відповідають вказаному фільтру (B<-O> і B<-t>). Приклад:
