Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Normally, only the superuser can mount filesystems. However, when I<fstab> contains the B<user> option on a line, anybody can mount the corresponding filesystem.
de: Normalerweise kann nur der Systemverwalter Dateisysteme einhängen. Dennoch kann das jeder tun, wenn in der Datei I<fstab> die entsprechende Zeile des Dateisystems die Option B<user> enthält.
fr: Normalement, seul le superutilisateur peut monter des systèmes de fichiers. Néanmoins, si une ligne dans I<fstab> contient l'option B<user>, n'importe quel utilisateur peut monter le système de fichiers correspondant.
pl: Tradycyjnie, tylko superużytkownik może montować systemy plików. Jednak jeśli I<fstab> w danym wierszu zawiera opcję B<user>, to każdy może zamontować odpowiadający temu wpisowi system plików.
uk: Зазвичай тільки суперкористувач може монтувати файлові системи. Однак, коли I<fstab> містить у рядку параметр B<user>, будь-хто може змонтувати відповідну файлову систему.

source: Note that B<mount> is very strict about non-root users and all paths specified on command line are verified before I<fstab> is parsed or a helper program is executed. It's strongly recommended to use a valid mountpoint to specify filesystem, otherwise B<mount> may fail. For example it's a bad idea to use NFS or CIFS source on command line.
de: Beachten Sie, dass B<mount> sehr strikt gegenüber normalen Benutzern ist und alle in der Befehlszeile angegebenen Pfade überprüft werden, bevor die Datei I<fstab> ausgewertet oder ein Hilfsprogramm ausgeführt wird. Es wird ausdrücklich empfohlen, einen gültigen Einhängepunkt für das Dateisystem anzugeben, anderenfalls könnte B<mount> fehlschlagen. Es ist beispielsweise eine schlechte Idee, NFS- oder CIFS-Quellen in der Befehlszeile zu verwenden.
fr: Remarquez que B<mount> est très strict au sujet des utilisateurs ordinaires et tous les chemins indiqués sur la ligne de commande sont vérifiés avant que I<fstab> soit analysé ou qu’un programme d’assistance soit exécuté. Il est fortement recommandé d’utiliser un point de montage autorisé pour indiquer un système de fichiers, sinon B<mount> échouera. Par exemple, c’est une mauvaise idée d’utiliser une source NFS ou CIFS dans la ligne de commande.
uk: Зауважте, що B<mount> дуже суворо ставиться до користувачів, які не мають права root, і всі шляхи, зазначені в командному рядку, перевіряються перед аналізом I<fstab> або виконанням допоміжної програми. Дуже бажано використовувати для визначення файлової системи дійсну точку монтування, інакше B<mount> може вийти з ладу. Наприклад, поганою ідеєю є використовувати джерело NFS або CIFS у командному рядку.

source: Since util-linux 2.35, B<mount> does not exit when user permissions are inadequate according to libmount's internal security rules. Instead, it drops suid permissions and continues as regular non-root user. This behavior supports use-cases where root permissions are not necessary (e.g., fuse filesystems, user namespaces, etc).
de: Seit der Version 2.35 von Util-linux beendet sich B<mount> nicht, wenn die Benutzerberechtigungen aufgrund der Libmount-Sicherheitsregeln nicht ausreichend sind. Stattdessen gibt es die Suid-Berechtigungen ab und fährt als normaler (nicht root) Benutzer fort. Damit werden Anwendungsfälle ermöglicht, bei denen Root-Berechtigungen nicht notwendig sind (z.B. Fuse-Dateisysteme, Benutzernamensräume usw.).
fr: Depuis la version 2.35, la commande B<mount> ne termine pas lorsque les permissions de l’utilisateur sont insuffisantes selon les règles de sécurité internes de B<libmount>. Il baisse les permissions suid et continue comme un utilisateur habituel simple. Il permet la prise en charge de cas d’utilisation où les droits de superutilisateur ne sont pas nécessaires (par exemple, des systèmes de fichiers FUSE, les espaces de noms d’utilisateur, etc).
uk: Починаючи від util-linux 2.35, B<mount> не закривається, якщо дозволи користувача є недостатніми відповідно до правил внутрішніх правил безпеки libmount. Натомість скидаються дозволи suid і продовжується робота як звичайного користувача без права root. Ця поведінка підтримує використання, коли права root не потрібні (наприклад, об'єднання файлових систем, просторів назв користувача тощо).

source: For more details, see B<fstab>(5). Only the user that mounted a filesystem can unmount it again. If any user should be able to unmount it, then use B<users> instead of B<user> in the I<fstab> line. The B<owner> option is similar to the B<user> option, with the restriction that the user must be the owner of the special file. This may be useful e.g.\& for I</dev/fd> if a login script makes the console user owner of this device. The B<group> option is similar, with the restriction that the user must be a member of the group of the special file.
de: Weitere Details finden Sie in B<fstab>(5). Nur der Benutzer, der ein Dateisystem eingehängt hat, kann es auch wieder aushängen. Wenn jeder Benutzer in der Lage sein soll, es auszuhängen, schreiben Sie B<users> statt B<user> in die I<fstab>-Zeile. Die Option B<owner> ähnelt B<user>, allerdings mit der Einschränkung, dass der Benutzer Eigentümer der speziellen Datei sein muss. Dies kann zum Beispiel für I</dev/fd> nützlich sein, wenn ein Anmeldeskript den Konsolenbenutzer zum Eigentümer dieses Gerätes macht. Die Option B<group> ist ähnlich, wobei der Benutzer Mitglied der Gruppe der speziellen Datei sein muss.
fr: Pour plus de précisions, consultez B<fstab>(5). Seul l'utilisateur qui a monté un système de fichiers peut le démonter. Si tous les utilisateurs doivent pouvoir faire le démontage, alors utilisez B<users> à la place de B<user> dans la ligne de I<fstab>. L'option B<owner> est similaire à B<user> avec la contrainte que l'utilisateur doit être le propriétaire du fichier spécial. Cela peut servir par exemple pour I</dev/fd> si un script de connexion rend l'utilisateur de la console propriétaire de ce fichier spécial. L'option B<group> est similaire avec la contrainte que l'utilisateur doit appartenir au groupe de ce fichier spécial.
pl: Szczegóły opisuje B<fstab>(5). Tylko użytkownik, który zamontował system plików może ponownie go odmontować. Jeżeli zachodzi potrzeba, by odmontowywać mógł każdy, w odpowiednim wierszu I<fstab> należy zamiast B<user> wpisać B<users>. Opcja B<owner> przypomina opcję B<user>, poza tym, że dany użytkownik musi być właścicielem odpowiedniego pliku specjalnego. Jest przydatna np. w przypadku I</dev/fd> jeśli skrypt zgłoszeniowy (login script) czyni danego użytkownika korzystającego z konsoli właścicielem tego urządzenia. Opcja B<group> jest podobna, z tym ograniczeniem, że użytkownik musi być członkiem grupy pliku specjalnego.
uk: Докладніше див. у B<fstab>(5). Тільки користувач, який змонтував файлову систему, може знову її демонтувати. Щоб це міг зробити будь-який користувач, замість B<user> у рядку I<fstab> скористайтесь B<users>. Параметр B<owner> подібний до варіанту B<user>, з тим обмеженням, що користувач має бути власником спеціального файлу. Це може бути корисно, наприклад, для I</dev/fd>, якщо скрипт входу робить користувача консолі власником цього пристрою. Варіант B<group> подібний, з обмеженням: користувач має бути членом групи спеціального файлу.

source: Remount part of the file hierarchy somewhere else. The call is:
de: Hängt Teile der Dateihierarchie an einer anderen Stelle erneut ein. Der Aufruf lautet:
fr: Remontage d’une partie de la hiérarchie de fichiers autre part. L’appel est :
uk: Перемонтування частини файлової ієрархії у якесь інше місце. Виклик:

source: One can also remount a single file (on a single file). It's also possible to use a bind mount to create a mountpoint from a regular directory, for example:
de: Sie können auch eine einzelne Datei (in einer einzelnen Datei) einhängen. Es ist auch möglich, eine Bind-Einhängung zu verwenden, um einen Einhängepunkt aus einem regulären Verzeichnis zu erzeugen, zum Beispiel:
fr: Un fichier unique peut également être remonté (sur un fichier unique). Il est aussi possible d’utiliser le montage avec « bind » pour créer un point de montage à partir d'un répertoire normal, par exemple :
uk: Можна також перемонтувати окремий файл (до окремого файла). Також можна використати монтування прив'язки, щоб створити точку монтування зі звичайного каталогу, наприклад:

source: The bind mount call attaches only (part of) a single filesystem, not possible submounts. The entire file hierarchy including submounts can be attached a second place by using:
de: Der Bind-Einhängeaufruf hängt nur (Teile eines) einzelnen Dateisystems an, nicht eventuelle Untereinhängungen. Die gesamte Dateihierarchie einschließlich Untereinhängungen kann folgendermaßen an einem zweiten Ort eingehängt werden:
fr: L'appel de montage avec « bind » n'attache qu'un unique système de fichiers (ou une partie), et pas les éventuels sous-montages. La hiérarchie complète, y compris les sous-montages, peut être attachée dans un second endroit avec :
uk: Виклик монтування з прив'язкою долучає до ієрархії файлової системи лише (частину) окремої файлової системи, а не можливі підлеглі її монтування. Усю ієрархію, разом із підлеглими монтуваннями, може бути долучено на другому кроці за допомогою такої команди:

source: Note that the filesystem mount options maintained by the kernel will remain the same as those on the original mount point. The userspace mount options (e.g., _netdev) will not be copied by B<mount> and it's necessary to explicitly specify the options on the B<mount> command line.
de: Beachten Sie, dass die vom Kernel verwalteten Einhängeoptionen des Dateisystems die gleichen wie im ursprünglichen Einhängepunkt sind. Die Einhängeoptionen auf Anwendungsebene (z.B. _netdev) werden von B<mount>(8) nicht kopiert, daher ist es nötig, die Optionen explizit in der Befehlszeile an B<mount> zu übergeben.
fr: Remarquez que les options de montage du système de fichiers entretenues par le noyau resteront les mêmes que celles du point de montage d'origine. Les options de montage en espace utilisateur (par exemple, B<_netdev>) ne pourront pas être copiées par B<mount>(8) et il est nécessaire de préciser les options sur la ligne de commande de B<mount>.
uk: Зауважте, що параметри монтування файлової системи, супровід яких здійснює ядро системи, лишаться тими самими, що і у початкової точки монтування. Параметри монтування простору користувача (наприклад _netdev) не буде скопійовано B<mount> — їх слід явним чином вказати у параметрах рядка команди B<mount>.

source: Since util-linux 2.27 B<mount>(8) permits changing the mount options by passing the relevant options along with B<--bind>. For example:
de: Seit Version 2.27 von Util-linux erlaubt B<mount>(8) die Änderung der Einhängeoptionen durch Übergeben der relevanten Optionen mit B<--bind>. Zum Beispiel:
fr: B<mount>(8) depuis la version 2.27 permet de modifier les options de montage en passant les options adéquates avec B<--bind>. Par exemple :
uk: Починаючи з версії util-linux 2.27, B<mount>(8) надає змогу змінювати параметри монтування передаванням відповідних параметрів разом із B<--bind>. Приклад:

source: This feature is not supported by the Linux kernel; it is implemented in userspace by an additional B<mount>(2) remounting system call. This solution is not atomic.
de: Diese Funktion wird vom Linux-Kernel nicht unterstützt. Sie ist auf Anwendungsebene durch einen zusätzlichen B<mount>(2)-Systemaufruf zum erneuten Einhängen implementiert. Diese Lösung ist nicht atomar.
fr: Cette fonctionnalité n’est pas gérée par le noyau Linux. Elle est mise en œuvre dans l’espace utilisateur par un appel système supplémentaire de remontage B<mount>(2). Cette solution n’est pas atomique.
pl: Opcja ta nie jest obsługiwana przez jądro Linux, jest zaimplementowana w przestrzeni użytkownika przez dodatkowe przemontowanie za pomocą wywołania systemowego B<mount>(2). To rozwiązanie nie jest nierozdzielne (atomowe).
uk: Ця функція не підтримується ядром Linux; її виконано у просторі користувача за допомогою додаткових системних викликів B<mount>(2). Це рішення не є атомарним.

source: It's also possible to change nosuid, nodev, noexec, noatime, nodiratime and relatime VFS entry flags via a "remount,bind" operation. The other flags (for example filesystem-specific flags) are silently ignored. It's impossible to change mount options recursively (for example with B<-o rbind,ro>).
de: Es ist ebenfalls möglich, die Schalter »nosuid«, »nodev«, »noexec«, »noatime«, »nodiratime« und »relatime« des VFS-Eintrags durch die Aktion »remount,bind« zu ändern. Die anderen (zum Beispiel die dateisystemspezifischen Schalter) werden stillschweigend ignoriert. Dagegen ist es nicht möglich, Einhängeoptionen rekursiv zu ändern (zum Beispiel mit B<-o rbind,ro>).
fr: Il est aussi possible de remplacer les drapeaux d’entrées VFS B<nosuid>, B<nodev>, B<noexec>, B<noatime>, B<nodiratime> et B<relatime> par l’opération B<remount,bind>. Les autres (par exemple, les drapeaux spécifiques à des systèmes de fichiers) sont ignorés silencieusement. Il est impossible de modifier les options de montage de manière récursive (par exemple, avec B<-o rbind,ro>).
uk: Можна також змінити прапорці запису VFS nosuid, nodev, noexec, noatime, nodiratime та relatime за допомогою дії «remount,bind». Інші прапорці (наприклад прапорці, специфічні для файлової системи) буде без повідомлень проігноровано. Не можна змінювати параметри монтування рекурсивно (наприклад за допомогою B<-o rbind,ro>).

source: Since util-linux 2.31, B<mount> ignores the B<bind> flag from I</etc/fstab> on a B<remount> operation (if "-o remount" is specified on command line). This is necessary to fully control mount options on remount by command line. In previous versions the bind flag has been always applied and it was impossible to re-define mount options without interaction with the bind semantic. This B<mount>(8) behavior does not affect situations when "remount,bind" is specified in the I</etc/fstab> file.
de: B<mount>(8) ignoriert seit Version 2.31 von Util-linux den B<bind>-Schalter in der Datei I</etc/fstab> bei der B<remount>-Aktion (falls »-o remount« in der Befehlszeile angegeben wird). Dies ist notwendig, um die Einhängeoptionen beim erneuten Einhängen in der Befehlszeile vollständig steuern zu können. In früheren Versionen wurde der Bind-Schalter immer angewendet, wodurch ohne Interaktion mit der Bind-Semantik keine Einhängeoptionen neu definiert werden konnten. Dieses Verhalten von B<mount>(8) beeinflusst nicht die Fälle, in denen »remount,bind« in der Datei I</etc/fstab> angegeben ist.
fr: B<mount>(8) depuis util-linux 2.31 ignore le drapeau B<bind> dans I</etc/fstab> lors de B<remount> I<opération> (si B<-o remount> est indiqué sur la ligne de commande). Cela est nécessaire pour contrôler complètement les options de B<mount> lors du remontage par la ligne de commande. Dans les précédentes versions, le drapeau B<bind> était toujours appliqué et il était impossible de redéfinir les options de montage sans interaction avec la sémantique de « bind ». Ce comportement de B<mount>(8) n’affecte pas les situations où B<remount,bind> est indiqué dans le fichier I</etc/fstab>.
uk: Починаючи з util-linux 2.31, B<mount> ігнорує прапорець B<bind> з I</etc/fstab> при виконанні дії B<remount> (якщо у рядку команди вказано «-o remount»). Це необхідно для повного контролю над параметрами монтування при перемонтуванні за допомогою командного рядка. У попередніх версіях завжди застосовувався прапорець прив'язування, і не можна було перевизначити параметри монтування без взаємодії із семантикою прив'язування. Ця поведінка B<mount>)8) не впливає на випадки, коли «remount,bind» вказано у файлі I</etc/fstab>.

source: Move a B<mounted tree> to another place (atomically). The call is:
de: Verschiebt einen B<eingehängten Baum> (atomar) an einen anderen Ort. Der Aufruf lautet:
fr: Déplacer de façon atomique une B<arborescence montée> à un autre endroit. L'appel est :
uk: Пересунути B<змонтовану ієрархію> до іншого місця (атомарно). Виклик:

source: This will cause the contents which previously appeared under I<olddir> to now be accessible under I<newdir>. The physical location of the files is not changed. Note that I<olddir> has to be a mountpoint.
de: Dadurch wird der Inhalt, der vorher unter I<Altes_Verzeichnis> erschien, unter I<Neues_Verzeichnis> sichtbar. Der physische Ort der Dateien ändert sich dadurch nicht. Beachten Sie, dass I<Altes_Verzeichnis> ein Einhängepunkt sein muss.
fr: Cela rendra le contenu de ce qui apparaissait jusqu'à présent sous l'I<ancien_répertoire> maintenant accessible sous le I<nouveau_répertoire>. L'emplacement physique des fichiers n'est pas modifié. Remarquez que l'I<ancien_répertoire> doit être un point de montage.
pl: Spowoduje to pojawienie się zawartości, która wcześniej znajdowała się w I<starym-katalogu>, dostępnej w I<nowym-katalogu>. Fizyczne położenie plików nie zmienia się. Proszę zauważyć, że I<stary-katalog> musi być punktem montowania.
uk: Результатом буде те, що дані, які раніше можна було прочитати зі I<старого_каталогу>, будуть доступними з I<нового_каталогу>. Фізичне розташування файлів змінено не буде. Зауважте, що I<старий_каталог> має бути точкою монтування.

source: Note also that moving a mount residing under a shared mount is invalid and unsupported. Use B<findmnt -o TARGET,PROPAGATION> to see the current propagation flags.
de: Beachten Sie auch, dass die Verschiebung einer Einhängung unter einer Mehrfacheinhängung unzulässig ist und nicht unterstützt wird. Mit B<findmnt -o ZIEL,AUSBREITUNG> können Sie die aktuellen Ausbreitungs-Schalter anzeigen lassen.
fr: Remarquez aussi que le déplacement d’un montage résidant dans un montage partagé n’est ni possible, ni pris en charge. Utiliser B<findmnt -o TARGET,PROPAGATION> pour afficher les attributs de propagation actuels.
pl: Proszę zauważyć, że przeniesienie punktu montowania leżącego pod współdzielonym punktem montowania jest nieprawidłowe i niewspierane. Proszę użyć B<findmnt -o TARGET,PROPAGATION> aby sprawdzić bieżące flagi propagacji.
uk: Зауважте також, що пересування змонтованого каталогу, що перебуває у змонтованому каталозі спільного користування, є некоректним — підтримки такої дії не передбачено. Скористайтеся командою B<findmnt -o TARGET,PROPAGATION>, щоб переглянути поточні прапорці поширення.

source: Since Linux 2.6.15 it is possible to mark a mount and its submounts as shared, private, slave or unbindable. A shared mount provides the ability to create mirrors of that mount such that mounts and unmounts within any of the mirrors propagate to the other mirror. A slave mount receives propagation from its master, but not vice versa. A private mount carries no propagation abilities. An unbindable mount is a private mount which cannot be cloned through a bind operation. The detailed semantics are documented in I<Documentation/filesystems/sharedsubtree.txt> file in the kernel source tree; see also B<mount_namespaces>(7).
de: Seit Linux 2.6.15 ist es möglich, eine Einhängung und deren Untereinhängungen als »shared«, »private«, »slave« oder »unbindable« zu markieren. Eine Mehrfacheinhängung ermöglicht es, »Spiegeleinhängungen« zu erstellen, bei denen Änderungen, wie Einhängungen und Aushängungen innerhalb einer der »Spiegel« (d.h. einer der Einhängungen) auch in der anderen Einhängung automatisch vorgenommen werden. Bei einer Slave-Einhängung breitet sich die Änderung vom Master aus, aber nicht umgekehrt. Bei einer privaten Einhängung erfolgt keine Ausbreitung. Eine »Unbindable«-Einhängung ist eine private Einhängung, die nicht mit einer Bind-Aktion geklont werden kann. Die Semantik ist in der Datei I<Documentation/filesystems/sharedsubtree.txt> im Quellbaum des Kernels detailliert dokumentiert; siehe auch B<mount_namespaces>(7).
fr: Depuis Linux 2.6.15, il est possible de marquer un montage et ses sous-montages comme partagés, privés, esclaves ou non remontables (B<bind>). Un montage partagé permet de créer des miroirs de ce montage, ainsi les montages et les démontages dans n'importe quel miroir seront propagés aux autres miroirs. Un montage esclave se propage seulement depuis le montage maître. Un montage privé ne peut pas se propager. Un montage non remontable est un montage privé qui ne peut pas être cloné lors d'une opération de remontage. La sémantique précise de ces options est documentée dans le fichier I<Documentation/filesystems/sharedsubtree.txt> des sources du noyau.Consultez aussi B<mount_namespaces>(7).
uk: Починаючи з Linux 2.6.15, можна позначити монтування та його підлеглі монтування як спільні, приватні, підлеглі або не призначені для прив'язування. Для спільного монтування передбачено можливість створення дзеркал монтування так, щоб монтування і демонтування у будь-якому з дзеркал поширювалися на інші дзеркала. Підлегле монтування отримує поширення від основного, але не навпаки. Приватне монтування не має можливостей поширення. Не призначене для прив'язування монтування є приватним монтуванням, яке не можна клонувати за допомогою дії з прив'язування. Докладну семантику документовано у файлі I<Documentation/filesystems/sharedsubtree.txt> початкових кодів ядра; див. також B<mount_namespaces>(7).

source: B<mount --make-shared >I<mountpoint> B<mount --make-slave >I<mountpoint> B<mount --make-private >I<mountpoint> B<mount --make-unbindable >I<mountpoint>
de: B<mount --make-shared >I<Einhängepunkt> B<mount --make-slave >I<Einhängepunkt> B<mount --make-private >I<Einhängepunkt> B<mount --make-unbindable >I<Einhängepunkt>
fr: B<mount --make-shared> I<point_de_montage> B<mount --make-slave> I<point_de_montage> B<mount --make-private> I<point_de_montage> B<mount --make-unbindable> I<point_de_montage>
pl: B<mount --make-shared >I<punkt-montowania> B<mount --make-slave >I<punkt-montowania> B<mount --make-private >I<punkt-montowania> B<mount --make-unbindable >I<punkt-montowania>
uk: B<mount --make-shared >I<точка_монтування> B<mount --make-slave >I<точка_монтування> B<mount --make-private >I<точка_монтування> B<mount --make-unbindable >I<точка_монтування>

source: B<mount --make-rshared >I<mountpoint> B<mount --make-rslave >I<mountpoint> B<mount --make-rprivate >I<mountpoint> B<mount --make-runbindable >I<mountpoint>
de: B<mount --make-rshared >I<Einhängepunkt> B<mount --make-rslave >I<Einhängepunkt> B<mount --make-rprivate >I<Einhängepunkt> B<mount --make-runbindable >I<Einhängepunkt>
fr: B<mount --make-rshared> I<point_de_montage> B<mount --make-rslave> I<point_de_montage> B<mount --make-rprivate> I<point_de_montage> B<mount --make-runbindable> I<point_de_montage>
pl: B<mount --make-rshared >I<punkt-montowania> B<mount --make-rslave >I<punkt-montowania> B<mount --make-rprivate >I<punkt-montowania> B<mount --make-runbindable >I<punkt-montowania>
uk: B<mount --make-rshared >I<точка_монтування> B<mount --make-rslave >I<точка_монтування> B<mount --make-rprivate >I<точка_монтування> B<mount --make-runbindable >I<точка_монтування>

source: B<mount>(8) B<does not read> B<fstab>(5) when a B<--make->* operation is requested. All necessary information has to be specified on the command line.
de: B<mount>(8) B<liest nicht die Datei> B<fstab>(5), wenn eine B<--make->*-Aktion angefordert wird. Alle notwendigen Informationen müssen in der Befehlszeile angegeben werden.
fr: B<mount>(8) B<ne lit pas> B<fstab>(5) quand une opération B<--make->I<*> est demandée. Tous les renseignements nécessaires doivent être indiqués sur la ligne de commande.
pl: B<mount>(8) B<nie odczytuje> B<fstab>(5) gdy żądana jest operacja B<--make->*. Wszystkie potrzebne informacje trzeba podać w wierszu polecenia.
uk: B<mount>(8) B<не читає> B<fstab>(5), якщо надіслано запит на дію B<--make->*. Усі необхідні дані має бути вказано у рядку команди.
