Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Don\(cqt canonicalize paths. The B<mount> command canonicalizes all paths (from the command line or I<fstab>) by default. This option can be used together with the B<-f> flag for already canonicalized absolute paths. The option is designed for mount helpers which call B<mount -i>. It is strongly recommended to not use this command-line option for normal mount operations.
de: kanonisiert keine Pfade. Der B<mount>-Befehl kanonisiert standardmäßig alle Pfade (aus der Befehlszeile oder I<fstab>). Diese Option kann zusammen mit B<-f> für bereits kanonisierte absolute Pfade verwendet werden. Die Option ist für Einhänge-Hilfsprogramme gedacht, die B<mount -i> verwenden. Wir raten dringend davon ab, diese Befehlszeilenoption für normale Einhängeaktionen zu verwenden.
fr: Ne pas rendre les chemins canoniques. La commande B<mount> rend tous les chemins canoniques (depuis la ligne de commande ou I<fstab>) par défaut. Cette option peut être utilisée avec l’attribut B<-f> pour les chemins absolus déjà canoniques. L’option est conçue pour les auxiliaires de montage qui appellent B<mount -i>. L’utilisation de cette option en ligne de commande est fortement déconseillée pour les opérations normales de montage.
pl: Nie normalizuje ścieżek. Polecenie montowania domyślnie normalizuje wszystkie ścieżki (z wiersza poleceń lub I<fstab>). Opcja może być użyta razem z B<-f> do już znormalizowanych ścieżek absolutnych. Opcja jest przeznaczona dla programów pomocniczych wywołujących B<mount -i>. Zdecydowanie nie zaleca się korzystania z tej opcji przy normalnych operacjach montowania.
uk: Не перетворювати шляхи до канонічної форми. Команда B<mount> типово перетворює всі шляхи до канонічної форми (з командного рядка або I<fstab>). Цей параметр можна вжити разом з прапорцем B<-f>, для вже канонізованих абсолютних шляхів. Цей параметр призначається для помічників монтування, які викликають B<mount -i>. Настійливо рекомендується не вживати цей параметр командного рядка для нормальних дій монтування.

source: Note that B<mount> does not pass this option to the B</sbin/mount.>I<type> helpers.
de: Beachten Sie, dass B<mount> diese Option nicht an die Hilfsprogramme B</sbin/mount.>I<Typ> übergibt.
fr: Remarquez que B<mount> ne passe pas cette option aux auxiliaires B</sbin/mount.>I<type>.
pl: Proszę zauważyć, że B<mount> nie przekazuje tej opcji do programów pomocniczych B</sbin/mount.>I<typ>.
uk: Зауважте, що B<mount> не передає цей параметр допоміжним засобам B</sbin/mount.>I<тип>.

source: (Used in conjunction with B<-a>.) Fork off a new incarnation of B<mount> for each device. This will do the mounts on different devices or different NFS servers in parallel. This has the advantage that it is faster; also NFS timeouts proceed in parallel. A disadvantage is that the order of the mount operations is undefined. Thus, you cannot use this option if you want to mount both I</usr> and I</usr/spool>.
de: (Wird in Kombination mit B<-a> verwendet) – erzeugt eine neue Instanz von B<mount> für jedes Gerät. Damit können die Einhängungen auf verschiedenen Geräten oder verschiedenen NFS-Servern parallel ausgeführt werden. Der Vorteil liegt in der höheren Geschwindigkeit; auch NFS-Zeitüberschreitungen werden parallelisiert. Ein Nachteil ist, dass die Einhängungen in undefinierter Reihenfolge ausgeführt werden. Daher können Sie diese Option nicht verwenden, wenn Sie sowohl I</usr> als auch I</usr/spool> einhängen wollen.
fr: (Utilisée conjointement avec B<-a>) lancer un nouveau processus B<mount> pour chaque périphérique. Cela effectuera le montage en parallèle sur divers périphériques ou serveurs NFS. L'avantage est la rapidité ; de plus les délais maximaux de NFS agissent en parallèle. Un désavantage est que l’ordre des opérations de montage est indéfini. Il ne faut donc pas utiliser cette option pour monter à la fois I</usr> et I</usr/spool>.
pl: (Użyte w połączeniu z B<-a>.) Dla każdego urządzenia tworzy nowy proces równoległy B<mount>. Powoduje to równoległy przebieg montowania różnych urządzeń lub różnych serwerów NFS. Zaletą jest większa szybkość: także przekroczenia czasu dla NFS będą wyznaczane równolegle. Wadą jest to, że kolejność montowania jest niezdefiniowana. Nie można zatem zastosować tej opcji do równoczesnego montowania I</usr> i I</usr/spool>.
uk: (Використовують у поєднанні з B<-a>.) Відгалужувати новий екземпляр B<mount> для кожного пристрою. Таким чином, монтування на різних пристроях або різних серверах NFS виконуватимуться паралельно. Це пришвидшує обробку. Крім того, відлік часу очікування на дані NFS виконуватиметься паралельно. Недолік полягає у тому, що порядок дій з монтування буде невизначеним. Отже, ви не зможете користуватися цим параметром, якщо хочете змонтувати одразу I</usr> і I</usr/spool>.

source: B<-f, --fake>
fr: B<-f>, B<--fake>
pl: B<-f>, B<--fake>

source: Causes everything to be done except for the actual system call; if it\(cqs not obvious, this "fakes" mounting the filesystem. This option is useful in conjunction with the B<-v> flag to determine what the B<mount> command is trying to do. It can also be used to add entries for devices that were mounted earlier with the B<-n> option. The B<-f> option checks for an existing record in I</etc/mtab> and fails when the record already exists (with a regular non-fake mount, this check is done by the kernel).
de: führt alles aus, außer den tatsächlichen Systemaufruf; falls nicht offensichtlich, die Einhängung des Dateisystems wird »vorgetäuscht«. Diese Option ist in Verbindung mit B<-v> nützlich, um zu ermitteln, was der Befehl B<mount> zu tun versucht. Sie können die Option auch zum Hinzufügen von Einträgen für Geräte verwenden, die zuvor mit der Option B<-n> eingehängt wurden. Die Option B<-f> prüft, ob in I</etc/mtab> ein entsprechender Datensatz vorhanden ist und schlägt fehl, wenn der Datensatz bereits existiert (mit einer regulären, nicht vorgetäuschten Einhängung, diese Überprüfung wird vom Kernel ausgeführt).
fr: Fonctionnement normal sauf pour l'appel système effectif qui n'est pas exécuté. Cela simule le montage du système de fichiers. Cette option, en conjonction avec l’attribut B<-v>, permet de déterminer ce que la commande B<mount> essaye de faire. Cela peut aussi servir à ajouter des entrées pour les périphériques montés précédemment avec l'option B<-n>. L'option B<-f> vérifie l'existence d'une entrée dans I</etc/mtab> et échoue si l'entrée existe déjà (avec un montage standard non simulé, cette vérification est faite par le noyau).
pl: Powoduje wykonywanie wszystkiego poza faktycznym wywołaniem funkcji systemowej. Jeśli nie jest to oczywiste: "udaje" montowanie systemu plików. W połączeniu z flagą B<-v> przydaje się do ustalenia, co usiłuje zrobić polecenie B<mount>. Może być też używana do dodawania wpisów dla urządzeń, które zamontowano wcześniej z opcją B<-n>. Opcja B<-f> sprawdza istnienie rekordu w I</etc/mtab> i zawodzi, jeśli rekord już istnieje (w przypadku zwykłych, nieudawanych montowań, to sprawdzenie jest wykonywane przez jądro).
uk: Наказує програмі виконати усі дії, окрім самого системного виклику; якщо це ще не очевидно, просто «підробляє» монтування файлової системи. Цей параметр корисний у поєднанні із прапорцем B<-v> для визначення, що саме програма B<mount> намагатиметься зробити. Ним можна також скористатися для додавання записів для пристроїв, які було змонтовано раніше за допомогою параметра B<-n>. Додавання параметра B<-f> призводить до перевірки наявності запису у I</etc/mtab>. Програма видає помилку, якщо запис вже існує (створений звичайним, не фіктивним монтуванням, перевірку буде виконано ядром системи).

source: B<-i, --internal-only>
fr: B<-i>, B<--internal-only>

source: Don\(cqt call the B</sbin/mount.>I<filesystem> helper even if it exists.
de: ruft das Hilfsprogramm B</sbin/mount.>I<Dateisystem> nicht auf, selbst wenn es existiert.
fr: Ne pas appeler l'auxiliaire B</sbin/mount.>I<système_de_fichiers>, même s'il existe.
pl: Nie wywołuje programu pomocniczego B</sbin/mount.>I<system-plików>, nawet jeśli istnieje.
uk: Не викликати допоміжний засіб B</sbin/mount.>I<файлова_система>, навіть якщо він існує.

source: B<-L>, B<--label> I<label>
de: B<-L>, B<--label> I<Bezeichnung>
fr: B<-L>, B<--label> I<étiquette>
pl: B<-L>, B<--label> I<etykieta>
uk: B<-L>, B<--label> I<мітка>

source: Mount the partition that has the specified I<label>.
de: hängt die Partition mit der angegebenen I<Bezeichnung> ein.
fr: Monter la partition d’I<étiquette> indiquée.
pl: Montuje partycję posiadającą podaną I<etykietę>.
uk: Змонтувати розділ, який має вказаний I<мітка>.

source: Add the labels in the mount output. B<mount> must have permission to read the disk device (e.g. be set-user-ID root) for this to work. One can set such a label for ext2, ext3 or ext4 using the B<e2label>(8) utility, or for XFS using B<xfs_admin>(8), or for reiserfs using B<reiserfstune>(8).
de: fügt die Bezeichnungen in der Ausgabe von Mount hinzu. Damit dies funktioniert, muss B<mount> die Zugriffsrechte zum Lesen des Plattengerätes haben (z.B. »set-user-ID« root sein). Sie können eine solche Bezeichnung für Ext2, Ext3 oder Ext4 mit dem Dienstprogramm B<e2label>(8) festlegen, für XFS mit B<xfs_admin>(8) oder für Reiserfs mit B<reiserfstune>(8).
fr: Ajouter les étiquettes à la sortie de B<mount>. B<mount> doit avoir le droit de lire le périphérique du disque (par exemple en étant exécuté en tant que superutilisateur, set-user-ID root). Une étiquette pour les systèmes I<ext2>, I<ext3> ou I<ext4> peut être écrite avec l'utilitaire B<e2label>(8), pour XFS avec l'utilitaire B<xfs_admin>(8) et pour ReiserFS avec l'utilitaire B<reiserfstune>(8).
pl: Dokłada etykiety do wyjścia wypisywanego przez mount. Żeby opcja ta mogła działać, B<mount> musi mieć prawo odczytu urządzania dyskowego (np. suid root). Można ustawić taką etykietę dla ext2, ext3 lub ext4 za pomocą narzędzia B<e2label>(8), zaś dla XFS - stosując B<xfs_admin>(8) lub dla reiserfs używając B<reiserfstune>(8).
uk: Додати мітки у виведені під час монтування дані. Щоб це спрацювало, у B<mount> мають бути права доступу на читання дискового пристрою (наприклад права доступу користувача root). Таку мітку можна встановити для ext2, ext3 або ext4 за допомогою допоміжної програми B<e2label>(8), для XFS за допомогою B<xfs_admin>(8), а для reiserfs за допомогою B<reiserfstune>(8).

source: Move a subtree to some other place. See above, the subsection B<The move operation>.
de: verschiebt einen Unterbaum an einen anderen Ort. Siehe oben im Abschnitt B<Die Verschiebe-Aktion>.
fr: Déplacer une sous-arborescence ailleurs. Voir plus haut « Les opérations de déplacement ».
pl: Przenosi poddrzewo w inne miejsce. Patrz powyżej w podrozdziale B<Operacja przenoszenia>.
uk: Пересунути піддерево в інше місце. Див. вище, підрозділ B<Дія з пересування>.

source: B<-m>, B<--mkdir>[=I<mode>]
de: B<-m>, B<--mkdir>[=I<Modus>]
fr: B<-m>, B<--mkdir>[B<=>I<mode>]
uk: B<-m>, B<--mkdir>[=I<режим>]

source: Allow to make a target directory (mountpoint) if it does not exist yet. Alias to "-o X-mount.mkdir[=mode]", the default mode is 0755. For more details see B<X-mount.mkdir> below.
de: ermöglicht das Anlegen eines Zielverzeichnisses (Einhängepunktes), falls es noch nicht existiert Alias für »-o X-mount.mkdir[=modus]«; der Standardmodus ist 0755. Für weitere Details, siehe nachfolgend B<X-mount.mkdir>.
fr: Permettre de créer un répertoire cible (point de montage) s'il n'existe pas encore. C'est un alias de « -o X-mount.mkdir[=mode] », le mode par défaut est 0755. Pour plus de détails voir plus loin B<X-mount.mkdir>.
uk: Дозволити створювати каталог призначення (точку монтування), якщо він ще не існує. Альтернатива для «-o X-mount.mkdir[=режим]», типовий режим - 0755. Щодо подробиць див. B<X-mount.mkdir> нижче.

source: Mount without writing in I</etc/mtab>. This is necessary for example when I</etc> is on a read-only filesystem.
de: hängt ein, ohne einen Eintrag in I</etc/mtab> zu schreiben. Dies ist beispielsweise nötig, wenn sich I</etc> in einem schreibgeschützten Dateisystem befindet.
fr: Monter sans écriture dans I</etc/mtab>. C'est nécessaire si I</etc> réside sur un système de fichiers en lecture seule.
pl: Montuje bez zapisywania w I</etc/mtab>. Jest to niezbędne na przykład gdy I</etc> znajduje się na systemie plików tylko do odczytu.
uk: Монтувати без запису в I</etc/mtab>. Це потрібно, наприклад, коли I</etc> є на файловій системі лише для читання.

source: B<-N>, B<--namespace> I<ns>
de: B<-N>, B<--namespace> I<Namensraum>
fr: B<-N>, B<--namespace> I<espace_de_noms>
pl: B<-N>, B<--namespace> I<pn>
uk: B<-N>, B<--namespace> I<простір_назв>

source: Perform the mount operation in the mount namespace specified by I<ns>. I<ns> is either PID of process running in that namespace or special file representing that namespace.
de: führt die Einhängung in dem angegebenen I<Namensraum> aus. Der I<Namensraum> ist entweder die Kennung (PID) des in diesem Namensraum laufenden Prozesses oder eine spezielle Datei, die diesen Namensraum repräsentiert.
fr: Réaliser l’opération de montage dans l’espace de noms de montage indiqué par I<espace_de_noms>. Celui-ci est soit un PID de processus en cours d’exécution dans cet espace, soit un fichier spécial représentant cet espace de noms.
pl: Przeprowadza operację montowania w przestrzeni nazw montowań zdefiniowanej w I<przestrzeń-nazw>. I<Przestrzeń-nazw> to albo PID procesu działającego w tej przestrzeni nazw albo plik specjalny reprezentujący tę przestrzeń.
uk: Виконати дію монтування у просторі назв монтування, вказаному I<ns>. I<ns> є або PID процесу, що працює в тому просторі назв або спеціальний файл, що представляє той простір.

source: B<mount> switches to the mount namespace when it reads I</etc/fstab>, writes I</etc/mtab: (or writes to _/run/mount>) and calls B<mount>(2), otherwise it runs in the original mount namespace. This means that the target namespace does not have to contain any libraries or other requirements necessary to execute the B<mount>(2) call.
de: B<mount> wechselt in den Einhängenamensraum, wenn es die Datei I</etc/fstab> liest, in die Datei I</etc/mtab> (oder I</run/mount>) schreibt und ruft B<mount>(2) auf, anderenfalls läuft es im ursprünglichen Einhängenamensraum. Das bedeutet, dass der Ziel-Namensraum keine Bibliotheken oder anderes enthalten muss, um B<mount>(2) aufzurufen.
fr: B<mount> bascule vers l’espace de noms de montage lorsqu’il lit I</etc/fstab>, écrit sur I</etc/mtab> (ou écrit sur I</run/mount>) et exécute l’appel système B<mount>(2). Sinon il s’exécute dans l’espace de noms de montage original. Cela signifie que l’espace de noms cible n’a pas à contenir toute bibliothèque ou autre exigence nécessaire pour exécuter la commande B<mount>(2).
uk: B<mount> перемикає до простору назв монтування, коли читає I</etc/fstab>, записує I</etc/mtab: (or writes to _/run/mount>) і викликає B<mount>(2), інакше воно працює в початковому просторі назв монтування. Це означає, що простір назв призначення не мусить містити будь-яких бібліотек або інших вимог, потрібних для виконання виклику B<mount>(2).

source: See B<mount_namespaces>(7) for more information.
de: Siehe B<mount_namespaces>(7) für weitere Informationen.
fr: Consultez B<mount_namespaces>(7) pour plus d’informations.
pl: Więcej informacji można znaleźć w podręczniku B<mount_namespaces>(7).
uk: Щоб дізнатися більше, див. B<mount_namespaces>(7).

source: B<-O>, B<--test-opts> I<opts>
de: B<-O>, B<--test-opts> I<Optionen>
fr: B<-O>, B<--test-opts> I<options>
pl: B<-O>, B<--test-opts> I<opcje>
uk: B<-O>, B<--test-opts> I<параметри>

source: Limit the set of filesystems to which the B<-a> option applies. In this regard it is like the B<-t> option except that B<-O> is useless without B<-a>. For example, the command
de: begrenzt die Gruppe der Dateisysteme, auf welche die Option B<-a> angewendet werden soll. In dieser Hinsicht verhält sie sich wie die Option B<-t>, jedoch ist B<-O> ohne B<-a> wirkungslos. Zum Beispiel hängt der Befehl
fr: Limiter l'ensemble des systèmes de fichiers auxquels l’option B<-a> s'applique. De ce point de vue, c’est comme l’option B<-t> sauf que B<-O> est inutile sans B<-a>. Par exemple, la commande :
pl: Ogranicza grupę systemów plików do której stosowana jest opcja B<-a>. Podobnie jak B<-t>, z tym wyjątkiem, że B<-O> jest bezużyteczna bez opcji B<-a>. Na przykład polecenie
uk: Обмежити набір файлових систем, для яких застосовуємо параметр B<-a>. У цьому відношення це як параметр B<-t>, окрім того, що B<-O> є марним без B<-a>. Наприклад, команда

source: mounts all filesystems except those which have the option I<netdev> specified in the options field in the I</etc/fstab> file.
de: alle Dateisysteme ein, außer jene, für die im Optionsfeld der Datei I</etc/fstab> die Option I<_netdev> angegeben ist.
fr: monte tous les systèmes de fichiers sauf ceux qui ont l'option B<_netdev> indiquée dans le champ option du fichier I</etc/fstab>.
pl: montuje wszystkie systemy plików z wyjątkiem posiadających podaną opcją I<netdev> w polu opcji pliku I</etc/fstab>.
uk: монтує всі файлові системи, крім тих, що мають параметр I<netdev>, вказаний у полі параметрів у файлі I</etc/fstab>.

source: It is different from B<-t> in that each option is matched exactly; a leading B<no> at the beginning of one option does not negate the rest.
de: Dies unterscheidet sich von B<-t> darin, dass jede Option exakt übereinstimmen muss; ein B<no> am Anfang einer Option führt nicht zur Negierung der anderen Optionen.
fr: C'est différent de B<-t> car chaque option est vérifiée exactement ; un B<no> au début d'une option ne nie pas le reste.
pl: Różni się od B<-t> tym, że każda opcja jest dopasowywana dokładnie; a podanie B<no> na początku jednej opcji, nie neguje pozostałych.
uk: Відрізняється від B<-t> в тому, що кожний параметр має збігатися точно; переднє B<no> на початку одного параметра не заперечує решту.

source: The B<-t> and B<-O> options are cumulative in effect; that is, the command
de: Die Optionen B<-t> und B<-O> wirken kumulativ, das heißt, der Befehl
fr: Les options B<-t> et B<-O> se cumulent dans les faits. La commande :
pl: Opcje B<-t> i B<-O> łączą swe działanie; to jest polecenie
uk: Параметри B<-t> та B<-O> мають кумулятивний ефект; тобто команда

source: mounts all ext2 filesystems with the _netdev option, not all filesystems that are either ext2 or have the _netdev option specified.
de: hängt alle Ext2-Dateisysteme mit der Option »_netdev« ein, jedoch nicht alle Dateisysteme, die nur entweder Ext2 sind oder für die nur die Option »_netdev« angegeben ist.
fr: monte tous les systèmes de fichiers I<ext2> avec l'option B<_netdev>, et pas les systèmes de fichiers qui sont seulement I<ext2> ou qui ont seulement l'option B<_netdev>.
pl: montuje wszystkie systemy plików ext2 z opcją _netdev, a nie wszystkie systemy które są albo typu ext2, albo mają podaną opcją _netdev.
uk: монтує всі файлові системи ext2 з параметром _netdev, а не всі файлові системи, що є або ext2 або мають вказаний параметр _netdev.

source: B<-o>, B<--options> I<opts>
de: B<-o>, B<--options> I<Optionen>
fr: B<-o>, B<--options> I<options>
pl: B<-o>, B<--options> I<opcje>
uk: B<-o>, B<--options> I<параметри>

source: Use the specified mount options. The I<opts> argument is a comma-separated list. For example:
de: verwendet die angegebenen Einhängeoptionen. Das Argument I<Optionen> ist eine durch Kommata getrennte Liste. Zum Beispiel:
fr: Utiliser les options de montage indiquées. L’argument I<options> est une liste séparée par des virgules. Par exemple :
pl: Używa podanej opcji montowania. Argument I<opcje> jest listą rozdzieloną przecinkami. Na przykład:
uk: Використати вказані параметри монтування. Аргумент I<параметри> є список відокремлених комами параметрів. Приклад:

source: For more details, see the B<FILESYSTEM-INDEPENDENT MOUNT OPTIONS> and B<FILESYSTEM-SPECIFIC MOUNT OPTIONS> sections.
de: Weitere Details finden Sie in den Abschnitten B<VOM DATEISYSTEM UNABHÄNGIGE EINHÄNGEOPTIONEN> und B<DATEISYSTEMSPEZIFISCHE EINHÄNGEOPTIONEN>.
fr: Pour plus de précisions, consultez les sections B<OPTIONS DE MONTAGE INDÉPENDANTES> et B<OPTIONS DE MONTAGE SPÉCIFIQUES>.
pl: Aby dowiedzieć się więcej, proszę zapoznać się z rozdziałami B<OPCJE MONTOWANIA NIEZALEŻNE OD SYSTEMU PLIKÓW> i B<OPCJE MONTOWANIA SPECYFICZNE DLA RÓŻNYCH SYSTEMÓW PLIKÓW>.
uk: Щоб дізнатися більше, див. розділи B<НЕЗАЛЕЖНІ ВІД ФАЙЛОВОЇ СИСТЕМИ ПАРАМЕТРИ МОНТУВАННЯ> та B<СПЕЦИФІЧНІ ДЛЯ ФАЙЛОВИХ СИСТЕМ ПАРАМЕТРИ МОНТУВАННЯ>.

source: Controls how to combine options from I<fstab>/I<mtab> with options from the command line. I<mode> can be one of B<ignore>, B<append>, B<prepend> or B<replace>. For example, B<append> means that options from I<fstab> are appended to options from the command line. The default value is B<prepend> \(em it means command line options are evaluated after I<fstab> options. Note that the last option wins if there are conflicting ones.
de: steuert, wie die Optionen aus I<fstab>/I<mtab> mit den Optionen aus der Befehlszeile kombiniert werden. Der I<Modus> kann B<ignore>, B<append>, B<prepend> oder B<replace> sein. Beispielsweise bedeutet B<append>, dass Optionen aus der I<fstab> an die Optionen aus der Befehlszeile angehängt werden. Standard ist B<prepend>, was bedeutet, dass Befehlszeilenoptionen nach den I<fstab>-Optionen ausgewertet werden. Beachten Sie, dass die letzte Option Vorrang hat, wenn es Konflikte gibt.
fr: Contrôler la façon de combiner les options de I<fstab> et I<mtab> avec les options de la ligne de commande. I<mode> peut être soit B<ignore>, B<append>, B<prepend> ou B<replace>. Par exemple, B<append> signifie que les options de I<fstab> sont ajoutées aux options de la ligne de commande. La valeur par défaut est B<prepend>, signifiant que les options de la ligne de commande sont évaluées après les options de I<fstab>. Remarquez que c’est la dernière option qui prévaut en cas de conflit.
pl: Kontroluje sposób łączenia opcji z I<fstab>/I<mtab> z opcjami z wiersza poleceń. I<Tryb> może być jednym z następujących: B<ignore> (ignoruj), B<append> (dołącz za), B<prepend> (dołącz przed) lub B<replace> (zastąp). Tryb B<append> oznacza na przykład, że opcje I<fstab> są dołączane po opcjach z wiersza poleceń. Domyślną wartością jest B<prepend>, co oznacza że opcje wiersza poleceń są przetwarzane po opcjach I<fstab>. Proszę zauważyć, że w przypadku konfliktu, wygrywa opcja znajdująca się na końcu.
uk: Керує тим, як поєднуються параметри з I<fstab>/I<mtab> з параметрами з рядка команди. Значенням I<режим> може бути B<ignore> (ігнорувати), B<append> (дописати після), B<prepend> (дописати перед) або B<replace> (замінити). Наприклад, B<append> означає, що параметри з I<fstab> буде дописано до параметрів з рядка команди. Типовим значенням є B<prepend> — воно означає, що параметри командного рядка буде застосовано після параметрів I<fstab>. Зауважте, що останній вказаний параметр має пріоритет у випадках конфліктів.
