Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The command B<mount> does not pass the mount options B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->*, B<loop>, B<offset> and B<sizelimit> to the mount.E<lt>suffixE<gt> helpers. All other options are used in a comma-separated list as an argument to the B<-o> option.
de: Der Befehl B<mount> übergibt die Einhängeoptionen B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->*, B<loop>, B<offset> und B<sizelimit> nicht an die Hilfsprogramme mount.E<lt>suffixE<gt>. Alle anderen Optionen werden in einer durch Kommata getrennten Liste als Argument der Option B<-o> verwendet.
fr: La commande B<mount> ne passe pas les options de montage B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->I<*>, B<loop>, B<offset> ni B<sizelimit> aux auxiliaires B<mount.>I<suffixe>. Toutes les autres options sont utilisées dans une liste séparée par des virgules comme argument de l’option B<-o>.
pl: Polecenie B<mount> nie przekazuje opcji montowania B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->*, B<loop>, B<offset>, ani B<sizelimit> do programów pomocniczych mount.E<lt>przyrostekE<gt>. Wszystkie inne opcje są w postaci listy (rozdzielonej przecinkami) przekazanej jako argument do opcji B<-o>.
uk: Команда B<mount> не передає параметрів монтування B<unbindable>, B<runbindable>, B<private>, B<rprivate>, B<slave>, B<rslave>, B<shared>, B<rshared>, B<auto>, B<noauto>, B<comment>, B<x->*, B<loop>, B<offset> і B<sizelimit> допоміжним засобам mount.E<lt>суфіксE<gt>. Усі інші параметри використовуються в списку, розділеному комами, як аргумент для параметра B<-o>.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
fr: ENVIRONNEMENT
pl: ŚRODOWISKO
uk: СЕРЕДОВИЩЕ

source: B<LIBMOUNT_FSTAB>=E<lt>pathE<gt>
de: B<LIBMOUNT_FSTAB>=E<lt>PfadE<gt>
fr: B<LIBMOUNT_FSTAB=>I<chemin>
pl: B<LIBMOUNT_FSTAB>=E<lt>ścieżkaE<gt>
uk: B<LIBMOUNT_FSTAB>=E<lt>шляхE<gt>

source: overrides the default location of the I<fstab> file (ignored for suid)
de: setzt den standardmäßigen Ort der I<fstab>-Datei außer Kraft (wird für Suid ignoriert).
fr: Remplacer l’emplacement par défaut du fichier I<fstab> (ignoré pour B<suid>).
pl: przesłania domyślne położenie pliku I<fstab> (ignorowane dla suid)
uk: замінює типове розташування файлу I<fstab> (нехтується для suid)

source: B<LIBMOUNT_MTAB>=E<lt>pathE<gt>
de: B<LIBMOUNT_MTAB>=E<lt>PfadE<gt>
fr: B<LIBMOUNT_MTAB=>I<chemin>
pl: B<LIBMOUNT_MTAB>=E<lt>ścieżkaE<gt>
uk: B<LIBMOUNT_MTAB>=E<lt>шляхE<gt>

source: overrides the default location of the I<mtab> file (ignored for suid)
de: setzt den standardmäßigen Ort der I<mtab>-Datei außer Kraft (wird für Suid ignoriert).
fr: Remplacer l’emplacement par défaut du fichier I<mtab> (ignoré pour B<suid>).
pl: przesłania domyślne położenie pliku I<mtab> (ignorowane dla suid)
uk: замінює типове розташування файлу I<mtab> (нехтується для suid)

source: B<LIBMOUNT_DEBUG>=all
fr: B<LIBMOUNT_DEBUG>=I<all>

source: enables libmount debug output
de: aktiviert die Fehlersuch-Ausgabe von Libmount.
fr: Activer la sortie de débogage de libmount.
pl: włącza komunikaty debugowania biblioteki libmount
uk: вмикає показ діагностичних повідомлень libmount

source: B<LIBBLKID_DEBUG>=all
fr: B<LIBBLKID_DEBUG>=I<all>

source: enables libblkid debug output
de: aktiviert die Fehlersuch-Ausgabe von Libblkid.
fr: Activer la sortie de débogage de libblkid.
pl: włącza wyjście debugowania libblkid
uk: вмикає показ діагностичних повідомлень libblkid

source: B<LOOPDEV_DEBUG>=all
fr: B<LOOPDEV_DEBUG>=I<all>

source: enables loop device setup debug output
de: aktiviert die Fehlersuch-Ausgabe für die Einrichtung von Loop-Geräten.
fr: Activer la sortie de débogage de configuration de périphérique boucle.
pl: włącza wyjście debugowania konfiguracji urządzenia loop
uk: вмикає показ діагностичних повідомлень налаштування петльового пристрою

source: FILES
de: DATEIEN
fr: FICHIERS
pl: PLIKI
uk: ФАЙЛИ

source: See also "B<The files /etc/fstab, /etc/mtab and /proc/mounts>" section above.
de: Siehe auch den Abschnitt »B<Die Dateien /etc/fstab, /etc/mtab und /proc/mounts>« oben.
fr: Consultez aussi la section I<Les fichiers /etc/fstab, /etc/mtab et /proc/mounts> ci-dessus.
uk: Див. також вище розділ "B<Файли /etc/fstab, /etc/mtab і /proc/mounts>".

source: filesystem table
de: Dateisystemtabelle
fr: table des systèmes de fichiers
pl: tabela systemów plików
uk: таблиця файлових систем

source: libmount private runtime directory
de: Privates Laufzeitverzeichnis von Libmount
fr: répertoire d’exécution privé de libmount
uk: приватний каталог libmount на час виконання

source: table of mounted filesystems or symlink to I</proc/mounts>
de: Tabelle der eingehängten Dateisysteme oder Symlink auf I</proc/mounts>
fr: table des systèmes de fichiers montés ou lien symbolique vers I</proc/mounts>
uk: таблиця змонтованих файлових систем або символьне посилання на I</proc/mounts>

source: lock file (unused on systems with I<mtab> symlink)
de: Sperrdatei (wird auf Systemen mit I<mtab>-Symlink nicht verwendet)
fr: fichier de verrou (inutilisé sur les systèmes avec lien symbolique vers I<mtab>)
uk: файл блокування (не використовується в системах із символьним посиланням I<mtab>)

source: temporary file (unused on systems with I<mtab> symlink)
de: Temporäre Datei (wird auf Systemen mit I<mtab>-Symlink nicht verwendet)
fr: fichier temporaire (inutilisé sur les systèmes avec lien symbolique vers I<mtab>)
uk: тимчасовий файл (не використовується в системах із символьним посиланням I<mtab>)

source: a list of filesystem types to try
de: Eine Liste zu versuchender Dateisystemtypen
fr: liste de systèmes de fichiers à essayer
pl: lista systemów plików do wypróbowania
uk: список типів файлових систем, якими можна скористатися

source: HISTORY
de: GESCHICHTE
fr: HISTORIQUE
pl: HISTORIA
uk: ЖУРНАЛ

source: A B<mount> command existed in Version 5 AT&T UNIX.
de: Ein B<mount> existierte in Version 5 von AT&T UNIX.
fr: Une commande B<mount> existait dans UNIX AT&T Version 5.
pl: Polecenie B<mount> pojawiło się w wersji 5 AT&T UNIX.
uk: Команда B<mount> існувала у AT&T UNIX версії 5.

source: BUGS
de: FEHLER
fr: BOGUES
pl: BŁĘDY
uk: ВАДИ

source: It is possible for a corrupted filesystem to cause a crash.
de: Ein beschädigtes Dateisystem könnte einen Absturz verursachen.
fr: Un système de fichiers corrompu peut déclencher un plantage.
pl: Jest możliwe, że uszkodzony system plików spowoduje załamanie systemu.
uk: Пошкоджена файлова система може призвести до збою.

source: Some Linux filesystems don\(cqt support B<-o sync> and B<-o dirsync> (the ext2, ext3, ext4, fat and vfat filesystems I<do> support synchronous updates (a la BSD) when mounted with the B<sync> option).
de: Einige Linux-Dateisysteme unterstützen weder B<-o sync> noch B<-o dirsync> (die Dateisysteme Ext2, Ext3, FAT und VFAT I<unterstützen> synchrone Aktualisierungen - wie BSD - wenn sie mit der Option B<sync> eingehängt werden).
fr: Sous Linux, certains systèmes de fichiers ne gèrent pas B<-o sync> et B<-o dirsync> (les systèmes de fichiers I<ext2>, I<ext3>, I<ext4>, I<fat> et I<vfat> I<gèrent> les mises à jour synchrones, à la manière BSD, lorsqu'ils sont montés avec l'option B<sync>).
uk: Деякі файлові системи Linux не підтримують B<-o sync> і B<-o dirsync> (файлові системи ext2, ext3, ext4, fat і vfat I<підтримують> синхронні оновлення (як у BSD), якщо їх змонтовано з параметром B<sync>).

source: The B<-o remount> may not be able to change mount parameters (all I<ext2fs>-specific parameters, except B<sb>, are changeable with a remount, for example, but you can\(cqt change B<gid> or B<umask> for the I<fatfs>).
de: Die Option B<-o remount> könnte nicht in der Lage sein, Einhängeparameter zu ändern (alle I<ext2fs>-spezifischen Parameter außer B<sb> können durch erneutes Einhängen geändert werden, beispielsweise können Sie B<gid> oder B<umask> für I<fatfs> nicht ändern).
fr: L'option B<-o remount> peut s'avérer incapable de modifier les paramètres de montage (tous ceux de I<ext2fs>, sauf B<sb>, sont modifiables lors d'un remontage, mais vous ne pouvez pas modifier le B<gid> ou l'B<umask> pour un système de fichiers I<fatfs>).
pl: Opcja B<-o remount> może nie być w stanie zmienić parametrów montowania (np. wszystkie parametry I<ext2fs>, poza B<sb>, dają się zmieniać przy ponownym montowaniu, lecz nie można zmienić B<gid> czy B<umask> dla I<fatfs>).
uk: B<-o remount> може бути не в змозі змінити параметри монтування (всі специфічні для I<ext2fs> параметри, крім B<sb>, можна змінити за допомогою перемонтування, наприклад, але не можна змінити B<gid> або B<umask> для I<fatfs>).

source: It is possible that the files I</etc/mtab> and I</proc/mounts> don\(cqt match on systems with a regular I<mtab> file. The first file is based only on the B<mount> command options, but the content of the second file also depends on the kernel and others settings (e.g. on a remote NFS server \(em in certain cases the B<mount> command may report unreliable information about an NFS mount point and the I</proc/mount> file usually contains more reliable information.) This is another reason to replace the I<mtab> file with a symlink to the I</proc/mounts> file.
de: Es ist möglich, dass die Dateien I</etc/mtab> und I</proc/mounts> auf Systemen mit einer regulären I<mtab>-Datei nicht übereinstimmen. Die erste Datei basiert lediglich auf den Befehlszeilenoptionen von B<mount>, während der Inhalt der zweiten Datei auch vom Kernel und weiteren Einstellungen abhängt (zum Beispiel auf einem fernen NFS-Server – in bestimmten Fällen könnte der B<mount>-Befehl unzuverlässige Informationen zu einem NFS-Einhängepunkt liefern, während die Datei I</proc/mounts> üblicherweise zuverlässigere Informationen enthält). Dies ist ein weiterer Grund, die I<mtab>-Datei durch einen Symlink auf die Datei I</proc/mounts> zu ersetzen.
fr: Les fichiers I</etc/mtab> et I</proc/mounts> pourraient ne pas correspondre sur les systèmes avec un ficher I<mtab> normal. Le premier est seulement basé sur les options de la commande B<mount>, mais le second tient compte de la configuration du noyau et d'autres paramètres (par exemple, pour un serveur NFS distant : dans certains cas, la commande B<mount> peut renvoyer des informations incorrectes à propos des points de montage NFS et en général I</proc/mounts> contient des informations plus sûres). C’est une autre raison de remplacer le fichier I<mtab> par un lien symbolique vers le fichier I</proc/mounts>.
uk: Можливо, файли I</etc/mtab> та I</proc/mounts> не збігаються в системах зі звичайним файлом I<mtab>. Перший файл заснований лише на параметрах команди B<mount>, але вміст другого файлу також залежить від ядра та інших налаштувань (наприклад, на віддаленому сервері NFS \(em у деяких випадках команда B<mount> може повідомляти ненадійну інформацію про точку монтування NFS, а файл I</proc/mount> зазвичай містить більш надійну інформацію.) Це ще одна причина замінити файл I<mtab> символьним посиланням на файл I</proc/mounts>.

source: Checking files on NFS filesystems referenced by file descriptors (i.e. the B<fcntl> and B<ioctl> families of functions) may lead to inconsistent results due to the lack of a consistency check in the kernel even if the B<noac> mount option is used.
de: Die auf Dateideskriptoren basierende Überprüfung von Dateien auf NFS-Dateisystemen (d.h. die Funktionsfamilien B<fcntl> und B<ioctl>) könnte zu inkonsistenten Ergebnissen führen, weil im Kernel eine Konsistenzprüfung selbst dann fehlt, wenn die Einhängeoption B<noac> verwendet wird.
fr: Vérifier les fichiers d'un système de fichiers NFS avec des descripteurs de fichiers (c'est-à-dire, les fonctions de la famille B<fcntl> et B<ioctl>) peuvent renvoyer de mauvais résultats à cause de la faible vérification des événements dans le noyau si l'option B<noac> de montage est utilisée.
uk: Перевірка у файлових системах NFS файлів, на які посилаються дескриптори файлів (тобто сімейства функцій B<fcntl> і B<ioctl>), може призвести до невідповідних результатів через відсутність перевірки узгодженості в ядрі, навіть якщо використовується параметр монтування B<noac>.

source: The B<loop> option with the B<offset> or B<sizelimit> options used may fail when using older kernels if the B<mount> command can\(cqt confirm that the size of the block device has been configured as requested. This situation can be worked around by using the B<losetup>(8) command manually before calling B<mount> with the configured loop device.
de: Die Option B<loop> könnte mit den Optionen B<offset> oder B<sizelimit> mit älteren Kerneln fehlschlagen, wenn der Befehl B<mount> nicht sicherstellen kann, dass die Größe des blockorientierten Geräts nicht wie angefordert eingerichtet wurde. Diese Situation kann umgangen werden, indem Sie den Befehl B<losetup>(8) manuell aufrufen, bevor Sie B<mount> mit dem konfigurierten Loop-Gerät aufrufen.
fr: L’option B<loop> utilisée avec les options B<offset> ou B<sizelimit> pourrait échouer sur les noyaux plus anciens si la commande B<mount> ne peut pas confirmer que la taille du périphérique bloc a été configurée comme demandé. Cette situation peut être contournée en utilisant la commande B<losetup>(8) vous-même avant d’appeler B<mount> avec le périphérique boucle configuré.
pl: Opcja B<loop> używana razem z opcjami B<offset> lub B<sizelimit> może nie powieść się, gdy używa się starszych jąder, a polecenie B<mount> nie może potwierdzić, że rozmiar urządzenia blokowego został skonfigurowany zgodnie z żądaniem. Można to obejść wywołując ręcznie polecenie B<losetup>(8) przed wywołaniem polecenia B<mount> już ze skonfigurowanym urządzeniem blokowym.
uk: Параметр B<loop> із використаними параметрами B<offset> або B<sizelimit> може спричинити помилку за використання старих ядер, якщо команда B<mount> не може підтвердити, що розмір блокового пристрою налаштовано відповідно до запиту. Цю ситуацію можна обійти за допомогою ручного введення команди B<losetup>(8) перед викликом B<mount> для налаштованого петльового пристрою.

source: AUTHORS
de: AUTOREN
fr: AUTEURS
pl: AUTORZY
uk: АВТОРИ

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
pl: ZOBACZ TAKŻE
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
fr: SIGNALER DES BOGUES
pl: ZGŁASZANIE BŁĘDÓW
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
fr: Pour envoyer un rapport de bogue, utilisez le système de gestion des problèmes à l'adresse
pl: Raporty o błędach proszę zgłaszać pod adresem
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
fr: DISPONIBILITÉ
pl: DOSTĘPNOŚĆ
uk: ДОСТУПНІСТЬ

source: The B<mount> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<mount> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
fr: La commande B<mount> fait partie du paquet util-linux, qui peut être téléchargé de
uk: B<mount> є частиною пакунка util-linux, який можна отримати з

source: August 2015
fr: Août 2015
pl: sierpień 2015
uk: Серпень 2015 року

source: B<mount -a> [B<-fFnrsvw>] [B<-t> I<fstype>] [B<-O> I<optlist>]
de: B<mount -a> [B<-fFnrsvw>] [B<-t> I<Dateisystemtyp>] [B<-O> I<Optionsliste>]
fr: B<mount -a> [B<-fFnrsvw>] [B<-t> I<type_sf>] [B<-O> I<liste_options>]
pl: B<mount -a> [B<-fFnrsvw>] [B<-t> I<typ-systemu>] [B<-O> I<lista-opcji>]
uk: B<mount -a> [B<-fFnrsvw>] [B<-t> I<тип_фс>] [B<-O> I<список_параметрів>]

source: B<mount> [B<-fnrsvw>] [B<-t> I<fstype>B<]> [B<-o> I<options>] I<device mountpoint>
de: B<mount> [B<-fnrsvw>] [B<-t> I<Dateisystemtyp>B<]> [B<-o> I<Optionen>] I<Gerät Einhängepunkt>
fr: B<mount> [B<-fnrsvw>] [B<-t> I<type_sf>] [B<-o> I<options>] I<périphérique point_montage>
pl: B<mount> [B<-fnrsvw>] [B<-t> I<typ-systemu>B<]> [B<-o> I<opcje>] I<urz◈dzenie punkt-montowania>
uk: B<mount> [B<-fnrsvw>] [B<-t> I<тип_фс>B<]> [B<-o> I<параметри>] I<точка_монтування_пристрою>

source: B<mount> B<--make->{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<mountpoint>
de: B<mount> B<--make->{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<Einhängepunkt>
fr: B<mount> B<--make->{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<point_montage>
pl: B<mount> B<--make->{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<punkt-montowania>
uk: B<mount> B<--make->{B<shared>|B<slave>|B<private>|B<unbindable>|B<rshared>|B<rslave>|B<rprivate>|B<runbindable>} I<точка монтування>

source: All files accessible in a Unix system are arranged in one big tree, the file hierarchy, rooted at I</>. These files can be spread out over several devices. The B<mount> command serves to attach the filesystem found on some device to the big file tree. Conversely, the B<umount>(8) command will detach it again. The filesystem is used to control how data is stored on the device or provided in a virtual way by network or other services.
de: Alle in einem Unix-System erreichbaren Dateien sind in einem einzigen großen Baum organisiert, der Dateihierarchie, deren Wurzel I</> ist. Diese Dateien können über verschiedene Geräte verteilt sein. Der Befehl B<mount> dient dazu, das auf einem Gerät befindliche Dateisystem in den großen Dateibaum einzuhängen. Umgekehrt hängt der Befehl B<umount>(8) das Dateisystem wieder aus. Das Dateisystem steuert, wie Daten auf dem Gerät gespeichert oder auf virtuelle Weise über das Netzwerk oder andere Dienste bereitgestellt werden.
fr: Tous les fichiers accessibles par un système UNIX sont insérés dans une grande arborescence, la hiérarchie des fichiers, commençant à la racine I</>. Ces fichiers peuvent être répartis sur différents périphériques. La commande B<mount> permet d'attacher un système de fichiers trouvé sur un périphérique quelconque à la grande arborescence de fichiers. À l'inverse, B<umount>(8) le détachera à nouveau. Le système de fichiers est utilisé pour contrôler comment les données sont stockées sur un périphérique ou fournies de façon virtuelle par le réseau ou d’autres services.
uk: Всі файли, доступні в системі Unix, зібрані в одне велике дерево, ієрархію файлів, з коренем в I</>. Ці файли можуть розташовуватися на різних пристроях. Команда B<mount> служить для приєднання файлової системи, знайденої на деяких пристроях, у велике дерево файлів. І навпаки, команда B<umount>(8) знову їх від'єднує. Файлова система використовується, щоб контролювати, як дані зберігаються на пристрої або наданому у віртуальний спосіб через мережу або інші служби.

source: B<mount -t>I< type device dir>
de: B<mount -t>I< Typ Gerät Verzeichnis>
fr: B<mount -t> I<type périphérique répertoire>
pl: B<mount -t>I< typ urządzenie katalog>
uk: B<mount -t>I< тип пристрій каталог>

source: This tells the kernel to attach the filesystem found on I<device> (which is of type I<type>) at the directory I<dir>. The option B<-t >I<type> is optional. The B<mount> command is usually able to detect a filesystem. The root permissions are necessary to mount a filesystem by default. See section "Non-superuser mounts" below for more details. The previous contents (if any) and owner and mode of I<dir> become invisible, and as long as this filesystem remains mounted, the pathname I<dir> refers to the root of the filesystem on I<device>.
de: weist den Kernel an, das auf dem I<Gerät> gefundene Dateisystem (des angegebenen I<Typs>) im angegebenen I<Verzeichnis> einzuhängen. Die Option B<-t >I<Typ> ist nicht zwingend notwendig. Der Befehl B<mount> ist üblicherweise in der Lage, ein Dateisystem zu erkennen. Root-Rechte sind erforderlich, um ein Dateisystem standardmäßig einzuhängen. Siehe den nachfolgenden Abschnitt »Einhängungen als normaler Benutzer« für weitere Details. Die vorherigen Inhalte (falls vorhanden) sowie der Eigentümer und der Modus des I<Verzeichnisses> werden unsichtbar. Solange dieses Dateisystem eingehängt bleibt, verweist der Pfadname I<Verzeichnis> auf die Wurzel des Dateisystems auf dem angegebenen I<Gerät>.
fr: Cela indique au noyau d'attacher le système de fichiers se trouvant sur le I<périphérique> mentionné (dont le type est I<type>) dans le répertoire I<répertoire> indiqué. L’option B<-t> I<type> est facultative. La commande B<mount> est généralement capable de détecter un système de fichiers. Par défaut, les droits de superutilisateur sont nécessaires pour monter un système de fichiers. Consultez la section « montages pour les utilisateurs ordinaires » ci-dessous pour plus de détails. Les contenus (s’ils existent), le propriétaire et le mode d'accès précédents de I<répertoire> deviennent invisibles et, tant que le nouveau système de fichiers reste monté, le chemin I<répertoire> se réfère à la racine du système de fichiers de I<périphérique>.
uk: Наказує ядру приєднати файлову систему, знайдену на I<пристрій> (що має тип I<тип>) в каталозі I<каталог>. Параметр B<-t> I<тип> є необов'язковим. Команда B<mount> переважно сама може визначити файлову систему. Дозволи root типово необхідні, щоб змонтувати файлову систему. Див. розділ "Монтування для несуперкористувача" нижче щодо подальшої інформації. Попередній вміст (якщо він був) а також власник та режим доступу I<каталог> стають невидимі, і поки система примонтована, шлях I<каталог> вказує на кореневу файлову систему на I<пристрій>.

source: B<mount /dir>
de: B<mount /Verzeichnis>
fr: B<mount /répertoire>
pl: B<mount /katalog>
uk: B<mount /каталог>

source: then B<mount> looks for a mountpoint (and if not found then for a device) in the I</etc/fstab> file. It's possible to use the B<--target> or B<--source> options to avoid ambiguous interpretation of the given argument. For example:
de: schaut B<mount> nach einem Einhängepunkt (und falls keiner gefunden wird, nach einem Gerät) in der Datei I</etc/fstab>. Mit den Optionen B<--target> oder B<--source> können Sie eine mehrdeutige Interpretation des angegebenen Arguments vermeiden. Zum Beispiel:
fr: alors B<mount> recherche un point de montage (et s’il n’en trouve pas, un périphérique) dans le fichier I</etc/fstab>. Utiliser les options B<--target> ou B<--source> permet d’éviter une interprétation ambivalente de l’argument donné. Par exemple :
uk: тоді B<mount> шукає точку монтування (а якщо її не знайдено, то пристрій) у файлі I</etc/fstab>. Можна використовувати параметри B<--target> або B<--source>, щоб уникнути неоднозначної інтерпретації цього аргументу. Наприклад:

source: B<mount --target /mountpoint>
de: B<mount --target /Einhängepunkt>
fr: B<mount --target> I</point_montage>
pl: B<mount --target /punkt_montowania>
uk: B<mount --target /точка_монтування>
