Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: remounts all already mounted vfat filesystems in read-only mode. Each of the filesystems is remounted by "mount -o remount,ro /dir" semantic. This means the B<mount> command reads I<fstab> or I<mtab> and merges these options with the options from the command line.
de: hängt alle bereits eingehängten VFAT-Dateisysteme im schreibgeschützten Modus erneut ein. Jedes der Dateisysteme wird mit der Semantik B<mount -o remount,ro >I</dir> erneut eingehängt. Das bedeutet, dass der Befehl B<mount> die I<fstab>- oder I<mtab>-Datei liest und die dort gefundenen Optionen mit den Optionen der Befehlszeile zusammenführt.
fr: remonte tous les systèmes de fichiers I<vfat> déjà montés en mode écriture seule. Chaque système de fichiers est remonté par la sémantique I<mount -o remount,ro /dir>. Cela signifie que la commande de montage lit I<fstab> ou I<mtab> et fusionne leurs options avec celles de la ligne de commande.
uk: повторно монтує усі вже змонтовані файлові системи vfat у режимі лише читання. Кожну файлову системі буде повторно змонтовано із семантикою «mount -o remount,ro /каталог». Це означає, що програма B<mount> прочитає I<fstab> або I<mtab> і об'єднає ці параметри з параметрами з рядка команди.

source: All I/O to the filesystem should be done synchronously. In the case of media with a limited number of write cycles (e.g.\& some flash drives), B<sync> may cause life-cycle shortening.
de: bewirkt, dass alle Ein- und Ausgaben des Dateisystems synchron ausgeführt werden. Bei Medien mit einer begrenzten Anzahl von Schreibzyklen (zum Beispiel einigen Flash-Speichermedien) kann B<sync> zu einer Verkürzung der Lebensdauer führen.
fr: Toutes les entrées et sorties du système de fichiers doivent être réalisées de façon synchrone. Dans le cas d'un support avec un nombre limité de cycles d'écriture (par exemple des mémoires flash), B<sync> peut réduire la durée de vie de celui-ci.
pl: Wszystkie operacje wejścia/wyjścia systemu plików powinny być wykonywane synchroniczne. W przypadku nośników z ograniczoną liczbą cykli zapisu (np. niektórych napędów flash) B<"sync> może spowodować skrócenie trwałości nośnika.
uk: Всі операції вводу/виводу файлової системи повинні виконуватися синхронно. У цьому випадку для носіїв із обмеженою кількістю циклів запису (наприклад, деяких флеш-накопичувачів) B<sync> може спричинити скорочення строку роботи.

source: Allow an ordinary user to mount the filesystem. The name of the mounting user is written to the I<mtab> file (or to the private libmount file in I</run/mount> on systems without a regular I<mtab>) so that this same user can unmount the filesystem again. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<user,exec,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen des Dateisystems. Der Name des einhängenden Benutzers wird in die I<mtab>-Datei geschrieben (oder auf Systemen, die keine reguläre I<mtab> haben, in die private Libmount-Datei in I</run/mount>), so dass der gleiche Benutzer das Dateisystem wieder aushängen kann. Diese Option impliziert die Optionen B<noexec>, B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<user,exec,dev,suid>).
fr: Autoriser les utilisateurs ordinaires à monter le système de fichiers. Le nom de l’utilisateur qui a monté le système de fichiers est noté dans le fichier I<mtab> (ou dans le fichier privé I<libmount> de I</run/mount> sur les systèmes sans fichier I<mtab> traditionnel) pour que cet utilisateur puisse le démonter ensuite. Cela entraîne l'utilisation des options B<noexec>, B<nosuid> et B<nodev> (à moins qu'elles ne soient explicitement surchargées, comme dans la ligne d’options B<user,exec,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika. Nazwa montującego użytkownika jest zapisywana do pliku I<mtab> (lub prywatnego pliku libmount w I</run/mount> w systemach bez zwykłego I<mtab>), więc może on ponownie odmontować system plików. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).
uk: Дозволити монтувати файлову систему звичайному користувачеві. Ім'я користувача, який монтує систему, буде записано до файла I<mtab> (або до приватного файла libmount у I</run/mount> у системах без звичайного I<mtab>) так, щоб саме цей користувача міг знову демонтувати файлову систему. Цей параметр неявним чином встановлює параметри B<noexec>, B<nosuid> і B<nodev> (якщо їх не буде перевизначено наступними параметрами, як у рядку параметрів B<user,exec,dev,suid>).

source: Forbid an ordinary user to mount the filesystem. This is the default; it does not imply any other options.
de: verbietet einem gewöhnlichen Benutzer das Einhängen des Dateisystems. Dies ist die Vorgabe, die keine anderen Optionen impliziert.
fr: Ne pas autoriser d'utilisateur ordinaire à monter le système de fichiers. C’est le comportement par défaut ; il n’implique aucune autre option.
pl: Zabrania zwykłemu użytkownikowi montowania systemu plików. Tak jest domyślnie, przy czym nie implikuje to żadnych innych opcji.
uk: Заборонити звичайному користувачеві монтувати файлову систему. Це типова поведінка, яка не встановлює неявним чином ніяких додаткових параметрів.

source: Allow any user to mount and to unmount the filesystem, even when some other ordinary user mounted it. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<users,exec,dev,suid>).
de: erlaubt jedem Benutzer das Ein- und Aushängen des Dateisystems, selbst wenn es bereits ein anderer gewöhnlicher Benutzer eingehängt hat. Diese Option impliziert die Optionen B<noexec>, B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<users,exec,dev,suid>).
fr: Autoriser tous les utilisateurs à monter et démonter le système de fichiers, même quand un autre utilisateur ordinaire l’a monté. Cette option implique les options B<noexec>, B<nosuid> et B<nodev> (sauf s'il y a une surcharge par une option ultérieure, comme dans la ligne d’options B<users,exec,dev,suid>).
pl: Pozwala każdemu użytkownikowi na zamontowanie i odmontowanie tego systemu plików, nawet gdy zamontował go inny, zwykły użytkownik. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).
uk: Дозволити будь-якому користувачеві монтувати і демонтувати файлову систему, навіть якщо її було змонтовано якимось іншим звичайним користувачем. Цей параметр неявним чином встановлює параметри B<noexec>, B<nosuid> і B<nodev> (якщо його не перевизначено наступними параметрами, як у рядку параметрів B<users,exec,dev,suid>).

source: B<X-*>
fr: B<X->I<*>

source: All options prefixed with "X-" are interpreted as comments or as userspace application-specific options. These options are not stored in user space (e.g., I<mtab> file), nor sent to the mount.I<type> helpers nor to the B<mount>(2) system call. The suggested format is B<X->I<appname>.I<option>.
de: Alle Optionen, denen ein »X-« vorangestellt ist, werden als Kommentare oder als anwendungsspezifische Optionen interpretiert. Diese Optionen werden weder auf Anwendungsebene gespeichert (zum Beispiel in der I<mtab>-Datei) noch an die mount.I<Typ>-Hilfsprogramme oder an den B<mount>(2)-Systemaufruf übergeben. Das empfohlene Format ist B<X->I<Anwendungsname>.I<Option>.
fr: Toutes les options précédées de B<X-> sont interprétées comme des commentaires ou des options spécifiques aux applications d’espace utilisateur. Ces options ne sont pas gardées dans l’espace utilisateur (par exemple, le fichier I<mtab>) et ne sont pas transmises aux auxiliaires B<mount.>I<type> ni aux appels système B<mount>(2). Le format suggéré est B<X->I<nom_application>B<.>I<option>.
uk: Усі параметри із префіксом «X-» вважатимуться коментарями або специфічними для програми параметрами простору користувача. Ці параметри не зберігаються у просторі користувача (наприклад, файлі I<mtab>), не надсилатиметься до допоміжних засобів mount.I<тип> і не передаватимуться системному виклику B<mount>(2). Рекомендованим форматом є B<X->I<назва_програми>.I<параметр>.

source: B<x-*>
fr: B<x->I<*>

source: The same as B<X-*> options, but stored permanently in user space. This means the options are also available for B<umount> or other operations. Note that maintaining mount options in user space is tricky, because it's necessary use libmount-based tools and there is no guarantee that the options will be always available (for example after a move mount operation or in unshared namespace).
de: ist ähnlich den B<X-*>-Optionen, bewirkt aber eine dauerhafte Speicherung auf Anwendungsebene. Das bedeutet, dass diese Optionen auch für B<umount> und andere Aktionen zur Verfügung stehen. Beachten Sie, dass die Verwaltung der Einhängeoptionen auf Anwendungsebene etwas verzwickt sein kann, da es notwendig ist, Libmount-basierte Werkzeuge zu verwenden und nicht immer sichergestellt werden kann, dass die Optionen verfügbar sind (zum Beispiel nach dem Verschieben einer Einhängung oder in einem nicht gemeinsam genutzten Namensraum).
fr: La même chose qu’avec les options B<X->I<*>, mais avec un enregistrement permanent dans l’espace utilisateur. Cela signifie que les options sont aussi disponibles pour des démontages ou d’autres utilisations. Remarquez que conserver les options de montage en espace utilisateur est délicat, car il est nécessaire d’utiliser des outils basés sur B<libmount> et qu’il n’existe aucune garantie que les options seront toujours disponibles (par exemple, après une opération de déplacement de montage ou dans un espace utilisateur non partagé).
uk: Те саме, що і параметри B<X-*>, але із постійним збереженням у просторі користувача. Це означає, що параметри також доступні для B<umount> або інших програм. Зауважте, що супровід параметрів монтування у просторі користувача є непростим завданням, оскільки потрібно користуватися заснованими на libmount інструментами, і немає гарантії, що параметри будуть завжди доступними (наприклад, після дії з пересування монтування або у просторі назв без спільного користування даними).

source: B<X-mount.mkdir>[B<=>I<mode>B<]>
de: B<X-mount.mkdir>[B<=>I<Modus>B<]>
fr: B<X-mount.mkdir>[B<=>I<mode>]
pl: B<X-mount.mkdir>[B<=>I<tryb>B<]>
uk: B<X-mount.mkdir>[B<=>I<режим>B<]>

source: Allow to make a target directory (mountpoint) if it does not exit yet. The optional argument I<mode> specifies the filesystem access mode used for B<mkdir>(2) in octal notation. The default mode is 0755. This functionality is supported only for root users or when mount executed without suid permissions. The option is also supported as x-mount.mkdir, this notation is deprecated since v2.30.
de: ermöglicht das Anlegen eines Zielverzeichnisses (Einhängepunktes), falls es noch nicht existiert. Das optionale Argument I<Modus> gibt für B<mkdir>(2) den Zugriffsmodus des Dateisystems in oktaler Notation an. Der Standardmodus ist 0755. Diese Funktionalität wird nur für Root-Benutzer unterstützt oder wenn B<mount> ohne SUID-Zugriffsrechte ausgeführt wird. Die Option wird auch in der Form x-mount.mkdir unterstützt, diese Notation ist seit Version 2.30 veraltet.
fr: Permettre de créer un répertoire cible (point de montage) s’il n’existe pas encore. L’argument facultatif I<mode> indique le mode d’accès au système de fichiers utilisé pour B<mkdir>(2) en notation octale. Le mode par défaut est 0755. Cette fonctionnalité n’est prise en charge que pour le superutilisateur ou quand B<mount> est exécuté sans les droits setuid. Cette option est aussi prise en charge sous forme B<x-mount.mkdir>, cette notation est obsolète depuis la version 2.30.
uk: Дозволити створення каталогу призначення (точки монтування), якщо його ще не існує Додатковий аргумент I<режим> визначає режим доступу до файлової системи, який буде використано у B<mkdir>(2), у вісімковій формі запису. Типовим режимом є 0755. Підтримку цієї функціональної можливості передбачено лише для користувача root або запуску B без прав доступу suid. Підтримку цього параметра також передбачено у формі x-mount.mkdir, але ця форма вважається застарілою з версії 2.30.

source: Do not follow symlinks when resolving paths. Symlinks can still be created, and B<readlink>(1), B<readlink>(2), B<realpath>(1) and B<realpath>(3) all still work properly.
de: folgt beim Auflösen von Pfaden keinen Symlinks. Symlinks können noch angelegt werden und B<readlink>(1), B<readlink>(2), B<realpath>(1) und B<realpath>(3) werden noch korrekt funktionieren.
fr: Ne pas suivre les liens symboliques lors de la résolution des chemins. Les liens symboliques peuvent toujours être créés et B<readlink>(1), B<readlink>(2), B<realpath>(1) et B<realpath>(3) fonctionnent toujours de manière appropriée.
uk: Не переходити за символічними посиланням при визначенні шляхів. Попри це, символічні посилання можна буде створювати, а B<readlink>(1), B<readlink>(2), B<realpath>(1) і B<realpath>(3) працюватимуть належним чином.

source: This section lists options that are specific to particular filesystems. Where possible, you should first consult filesystem-specific manual pages for details. Some of those pages are listed in the following table.
de: Dieser Abschnitt listet Optionen auf, die für bestimmte Dateisysteme spezifisch sind. Wo immer möglich, sollten Sie für Details zuerst die dateisystemspezifische Handbuchseite konsultieren. Einige dieser Handbuchseiten sind in der folgenden Tabelle aufgelistet.
fr: Cette section liste les options particulières à des systèmes de fichiers. Quand cela est possible, vous devriez consulter la page de manuel spécifique au système de fichiers pour plus de détails. Certaines pages sont listées dans le tableau suivant.
uk: У цьому розділі наведено список параметрів, які є специфічними для певних файлових систем. Де це можливо, вам слід спочатку ознайомитися із специфічними для файлової системи сторінками підручників, щоб мати повнішу картину. Деякі є частиною списку з наведеної нижче таблиці.

source: Filesystem(s)
de: Dateisystem(e)
fr: Système(s) de fichiers
uk: Файлові системи

source: Manual page
de: Handbuchseite
fr: Page de manuel
uk: Сторінка підручника

source: The following options apply only to certain filesystems. We sort them by filesystem. All options follow the B<-o> flag.
de: Die folgenden Optionen sind nur auf bestimmte Dateisysteme anwendbar. Sie sind nach Dateisystem sortiert und folgen alle dem Schalter B<-o>.
fr: Les options suivantes ne s'appliquent qu'à certains systèmes de fichiers. Elles sont triées par type de système de fichiers. Elles s'utilisent toutes à la suite de l’attribut B<-o>.
uk: Вказані нижче параметри є застосовними лише для деяких файлових систем. Ми впорядкували ці параметри за файловими системами. Усі параметри слід вказувати після прапорця B<-o>.

source: What options are supported depends a bit on the running kernel. Further information may be available in filesystem-specific files in the kernel source subdirectory I<Documentation/filesystems>.
de: Welche Optionen unterstützt werden, hängt auch vom laufenden Kernel ab. Weitere Informationen finden Sie in den dateisystemspezifischen Dateien der Kernel-Quellen unter I<Documentation/filesystems>.
fr: Les options prises en charge dépendent du noyau en cours d'utilisation. Vous trouverez plus d'informations dans le sous-répertoire I<Documentation/filesystems> des sources du noyau.
uk: Перелік підтримуваних параметрів залежить певним чином від використаного ядра системи. Докладніші відомості можна отримати зі специфічних для файлової системи файлів у каталозі початкових кодів ядра I<Documentation/filesystems>.

source: B<uid=>\,I<value> and B<gid=>\,I<value>
de: B<uid=>\,I<Wert> und B<gid=>\,I<Wert>
fr: B<uid=>\,I<valeur> et B<gid=>\,I<valeur>
pl: B<uid=>\,I<wartość> i B<gid=>\,I<wartość>
uk: B<uid=>\,I<значення> і B<gid=>\,I<значення>

source: B<ownmask=>\,I<value> and B<othmask=>\,I<value>
de: B<ownmask=>\,I<Wert> und B<othmask=>\,I<Wert>
fr: B<ownmask=>\,I<valeur> et B<othmask=>\,I<valeur>
pl: B<ownmask=>\,I<wartość> i B<othmask=>\,I<wartość>
uk: B<ownmask=>\,I<значення> і B<othmask=>\,I<значення>

source: Set the permission mask for ADFS 'owner' permissions and 'other' permissions, respectively (default: 0700 and 0077, respectively). See also I</usr/src/linux/Documentation/filesystems/adfs.rst>.
de: setzt die ADFS-Zugriffsrechte-Maske für »owner« bzw. »other« (Standard: 0700 bzw. 0077). Siehe auch I</usr/src/linux/Documentation/filesystems/adfs.rst>.
fr: Définir le masque de permissions pour le propriétaire ADFS et les permissions des « autres » respectivement (défaut : 0700 et 0077, respectivement). Consultez aussi I</usr/src/linux/Documentation/filesystems/adfs.rst>.
pl: Ustawia maskę praw dla, odpowiednio, uprawnień 'właściciela' i uprawnień 'innych' ADFS (domyślnie, odpowiednio: 0700 i 0077). Zobacz także I</usr/src/linux/Documentation/filesystems/adfs.rst>.
uk: Встановити маску прав доступу для прав доступу «власника» і «інших» ADFS, відповідно (типові значення: 0700 і 0077, відповідно). Див. також I</usr/src/linux/Documentation/filesystems/adfs.rst>.

source: B<setuid=>\,I<value> and B<setgid=>\,I<value>
de: B<setuid=>\,I<Wert> und B<setgid=>\,I<Wert>
fr: B<setuid=>\,I<valeur> et B<setgid=>\,I<valeur>
pl: B<setuid=>\,I<wartość> i B<setgid=>\,I<wartość>
uk: B<setuid=>\,I<значення> and B<setgid=>\,I<значення>

source: Set the mode of all files to I<value> & 0777 disregarding the original permissions. Add search permission to directories that have read permission. The value is given in octal.
de: setzt den Modus aller Dateien auf I<Wert> & 0777, ungeachtet der ursprünglichen Zugriffsrechte, und fügt Such-Zugriffsrechte zu Verzeichnissen hinzu, für die bereits Leserechte bestehen. Der Wert wird in oktaler Notation angegeben.
fr: Définir le mode d'accès à tous les fichiers au mode I<valeur> & 0777 sans s'occuper de leurs permissions d'origine. Cela ajoute également l'autorisation de parcours dans les répertoires qui permettent la lecture. La I<valeur> doit être mentionnée en octal.
pl: Ustawia prawa wszystkich plików na I<wartość> & 0777, nie zważając na oryginalne prawa. Dodaje prawa przeszukiwania dla katalogów, które mają prawo odczytu. Wartość jest podawana ósemkowo.
uk: Встановити режим для усіх файлів I<значення> & 0777, незалежно від початкових прав доступу. Додати права доступу для пошуку у каталогах, на які є право читання. Значення слід вказувати у вісімковій формі.

source: Set UID and GID of the root of the filesystem to the UID and GID of the mount point upon the first sync or umount, and then clear this option. Strange...
de: setzt UID und GID der Wurzel des Dateisystems auf die UID und GID des Einhängepunkts beim ersten Synchronisieren oder Aushängen und löscht dann diese Option. Seltsam …
fr: Définir l'UID et le GID de la racine du système de fichiers à l'UID et au GID du point de montage jusqu'au premier B<sync> ou B<umount>, puis ignorer cette option. Bizarre…
pl: Ustawia UID i GID korzenia systemu plików na UID i GID punktu montowania, aż do pierwszego sync lub umount, a potem kasuje tę opcję. Dziwne...
uk: Встановити для UID і GID кореня файлової системи значення UID і GID точки монтування при першій синхронізації або демонтуванні, а потім спорожнити значення цього параметра. Дивно…

source: Prefix (of length at most 30) used before '/' when following a symbolic link.
de: gibt das (maximal 30 Zeichen lange) Präfix an, das vor »/« verwendet wird, wenn einem symbolischen Link gefolgt wird.
fr: Préfixe (30 caractères au plus) à utiliser avant « / » lorsqu'un lien symbolique est suivi.
pl: Przedrostek (długości najwyżej 30), używany przed '/' przy podążaniu za dowiązaniem symbolicznym.
uk: Префікс (не більше 30 у довжину), який буде використано перед «/» при переході за символічним посиланням.

source: Give blocksize. Allowed values are 512, 1024, 2048, 4096.
de: gibt die Blockgröße an. Zulässige Werte sind 512, 1024, 2048 und 4096.
fr: Fournir la taille de bloc. Les valeurs autorisées sont 512, 1024, 2048 et 4096.
pl: Podaje rozmiar bloku. Dozwolone wartości to 512, 1024, 2048, 4096.
uk: Задати розмір блоку. Дозволені значення: 512, 1024, 2048, 4096.

source: These options are accepted but ignored. (However, quota utilities may react to such strings in I</etc/fstab>.)
de: Diese Optionen werden zwar akzeptiert, aber ignoriert (dennoch können Dienstprogramme, die Speicherplatzkontingente bearbeiten, solche Zeichenketten in I</etc/fstab> auswerten).
fr: Ces options sont acceptées mais sans effet (les utilitaires de quota peuvent toutefois réagir à de telles chaînes dans I</etc/fstab>).
pl: Opcje te są przyjmowane, lecz są ignorowane (jednakże narzędzia limitów dyskowych (quota) mogą reagować na takie łańcuchy w I</etc/fstab>).
uk: Ці параметри буде прийнято, але буде проігноровано. (Втім, інструменти обробки квот можуть реагувати на такі рядки у I</etc/fstab>.)

source: The debugfs filesystem is a pseudo filesystem, traditionally mounted on I</sys/kernel/debug>. As of kernel version 3.4, debugfs has the following options:
de: Das Debugfs-Dateisystem ist ein Pseudo-Dateisystem, das traditionell in I</sys/kernel/debug> eingehängt wird. Ab der Kernelversion 3.4 hat Debugfs folgende Optionen:
fr: Le système de fichiers debugfs est un pseudosystème de fichiers, traditionnellement monté sous I</sys/kernel/debug>. Avec la version 3.4 du noyau, debugfs a les options de montage suivantes.
pl: System plików debugfs jest pseudosystemem, montowanym tradycyjnie w I</sys/kernel/debug>. Z jądrem w wersji 3.4 debugfs ma następujące opcje:
uk: Файлова система debugfs є фіктивною файловою системою, яку традиційно монтують до I</sys/kernel/debug>. На момент виходу ядра версії 3.4 debugfs використовує такі параметри:

source: The devpts filesystem is a pseudo filesystem, traditionally mounted on I</dev/pts>. In order to acquire a pseudo terminal, a process opens I</dev/ptmx>; the number of the pseudo terminal is then made available to the process and the pseudo terminal slave can be accessed as I</dev/pts/>E<lt>numberE<gt>.
de: Das Devpts-Dateisystem ist ein Pseudo-Dateisystem, das traditionell in I</sys/dev/pts> eingehängt wird. Um an ein Pseudo-Terminal zu gelangen, öffnet ein Prozess I</dev/ptmx>; die Nummer des Pseudo-Terminals steht dann dem Prozess zur Verfügung und auf den Pseudo-Terminal-Slave kann über I</dev/pts/>E<lt>NummerE<gt> zugegriffen werden.
fr: Le système de fichiers devpts est un pseudosystème de fichiers, traditionnellement monté sous I</dev/pts>. Pour acquérir un pseudoterminal, un processus ouvre I</dev/ptmx> ; le numéro du pseudoterminal est rendu disponible au processus, et le pseudoterminal esclave est accessible en tant que I</dev/pts/>E<lt>numéroE<gt>.
pl: devpts jest pseudosystemem plików, tradycyjnie montowanym w I</dev/pts>. W celu uzyskania pseudoterminala, proces otwiera I</dev/ptmx>. Jest mu wówczas udostępniany numer pseudoterminala; podporządkowany pseudoterminal jest dostępny jako I</dev/pts/>E<lt>numerE<gt>.
uk: Файлова система devpts є фіктивною файловою системою, яку традиційно буде змонтовано до I</dev/pts>. Для отримання псевдотермінала процес відкриває I</dev/ptmx>; після цього номер псевдотермінала стане доступним процесу. Доступ до підлеглого засобу псевдотермінала можна здійснювати за адресою I</dev/pts/>E<lt>номерE<gt>.
