Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Normally B<utime>(2) checks that the current process is owner of the file, or that it has the B<CAP_FOWNER> capability. But FAT filesystems don\(cqt have UID/GID on disk, so the normal check is too inflexible. With this option you can relax it.
de: Normalerweise prüft B<utime>(2), ob der aktuelle Prozess Eigentümer der Datei ist oder über die Capability B<CAP_FOWNER> verfügt. Allerdings haben FAT-Dateisysteme keine UID/GID auf der Platte, so dass eine gewöhnliche Überprüfung zu unflexibel ist. Mit dieser Option können Sie sie lockern.
fr: Normalement, B<utime>(2) vérifie que le processus actuel est le propriétaire du fichier ou qu'il a la propriété B<CAP_FOWNER>. Cependant, les systèmes de fichiers FAT n’ont pas d'UID ou de GID sur le disque, donc une vérification normale est trop inflexible. Avec cette option, vous pouvez l'assouplir.
pl: Zwykle B<utime(2)> sprawdza czy bieżący proces jest właścicielem pliku lub czy posiada właściwość B<CAP_FOWNER>. Jednak systemy plików FAT nie posiadają na dysku UID ani GID, więc zwykłe sprawdzenie jest zbyt mało elastyczne. Opcja jest remedium na tę sytuację.
uk: Зазвичай, B<utime>(2) перевіряє, чи є поточний процес власником файла, і чи має він можливість B<CAP_FOWNER>. Втім, файлові системи FAT не мають UID/GID на диску, тому звичайна перевірка є надто негнучкою. За допомогою цього параметра ви можете оптимізувати її.

source: B<check=>I<value>
de: B<check=>I<Wert>
fr: B<check=>I<valeur>
pl: B<check=>I<wartość>
uk: B<check=>I<значення>

source: Three different levels of pickiness can be chosen:
de: Drei verschiedene Pingeligkeitsstufen können gewählt werden:
fr: Les trois niveaux suivants de vérification de noms de fichiers sont disponibles.
pl: Można wybrać trzy stopnie ścisłości:
uk: Можна вибрати один з трьох рівнів:

source: Upper and lower case are accepted and equivalent, long name parts are truncated (e.g. I<verylongname.foobar> becomes I<verylong.foo>), leading and embedded spaces are accepted in each name part (name and extension).
de: Es wird sowohl Groß- als auch Kleinschreibung akzeptiert, lange Namensbestandteile werden gekürzt (zum Beispiel wird I<sehrlangername.foobar> zu I<sehrlang.foo>), vorangestellte und eingebettete Leerzeichen werden in jedem Namensbestandteil akzeptiert (Name und Erweiterung).
fr: Les majuscules et minuscules sont acceptées et équivalentes. La partie excédentaire des noms longs est supprimée (par exemple I<nombeaucouptroplong.toto> devient I<nombeauc.tot>). Les espaces en tête et dans les noms sont acceptés, tant dans le nom que dans l'extension.
pl: Akceptowane i równoważne sobie są zarówno wielkie, jak i małe litery. Części długich nazw są obcinane (np. I<verylongname.foobar> staje się I<verylong.foo>), początkowe i wtrącone spacje są akceptowane jako każda część nazwy (nazwy i rozszerzenia).
uk: Прийнятними є літери верхнього і нижнього регістру, вони є еквівалентними. Довгі частини назв буде обрізано (наприклад, I<дужедовганазва.щосьтам> стане I<дужедовга.щось>), можна використовувати початкові і вбудовані пробіли в усіх частинах (назві і суфіксі назви).

source: Like "relaxed", but many special characters (*, ?, E<lt>, spaces, etc.) are rejected. This is the default.
de: verhält sich wie »relaxed«, aber viele spezielle Zeichen (*, ?, E<lt>, Leerzeichen, usw.) werden abgewiesen. Dies ist die Voreinstellung.
fr: Comme B<relaxed>, mais de nombreux caractères spéciaux (*, ?, E<lt>, espaces, etc.) sont refusés. C'est le comportement par défaut.
pl: Podobnie jak "relaxed", lecz wiele znaków specjalnych (jak *, ?, E<lt>, spacje, itp.) jest odrzucanych. Tak jest domyślnie.
uk: Подібний до «relaxed», але не можна використовувати багато спеціальних символів (*, ?, E<lt>, пробіли тощо). Це типовий варіант.

source: Like "normal", but names that contain long parts or special characters that are sometimes used on Linux but are not accepted by MS-DOS (+, =, etc.) are rejected.
de: verhält sich wie »normal«, aber Namen, die lange Teile oder spezielle Zeichen enthalten, die manchmal unter Linux verwendet werden, die aber von MS-DOS nicht akzeptiert werden (+, =, usw.), werden abgewiesen.
fr: Comme B<normal>, mais les noms qui contiennent une partie longue ou des caractères spéciaux qui sont parfois utilisés sous Linux, mais pas acceptés par MS-DOS (+, =, etc.) sont rejetés.
pl: Jak "normal", lecz nazwy które zawierają długie części i znaki specjalne, które czasem są używane pod Linuksem, lecz nie są akceptowane przez MS-DOS (+, = itp.) są odrzucane.
uk: Подібний до «normal», але не можна використовувати назви, які містять довгі частин або спеціальні символи, які інколи використовують у Linux, але які є неприйнятними у MS-DOS (+, = тощо).

source: B<codepage=>I<value>
de: B<codepage=>I<Wert>
fr: B<codepage=>I<valeur>
pl: B<codepage=>I<wartość>
uk: B<codepage=>I<значення>

source: Sets the codepage for converting to shortname characters on FAT and VFAT filesystems. By default, codepage 437 is used.
de: legt die Zeichensatztabelle (Codepage) für die Übersetzung in Kurznamenzeichen auf FAT- und VFAT-Dateisystemen fest. Standardmäßig wird die Zeichensatztabelle 437 verwendet.
fr: Définir la page de code pour convertir les caractères des noms courts des systèmes de fichiers FAT et VFAT. Par défaut, la page 437 est utilisée.
pl: Ustawia stronę kodową do konwersji znaków krótkiej nazwy w systemach plików FAT i VFAT. Domyślnie stosowana jest strona kodowa 437.
uk: Встановлює кодову сторінку для перетворення символів коротких назв у файлових системах FAT і VFAT. Типово, буде використано кодову сторінку 437.

source: This option is obsolete and may fail or be ignored.
de: Diese Option ist veraltet und könnte fehlschlagen oder ignoriert werden.
fr: Cette option est obsolète et peut échouer ou être ignorée.
pl: Przestarzała opcja, może zwrócić błąd lub zostać zignorowana.
uk: Цей параметр є застарілим і може призвести до помилки, або цей параметр буде проігноровано.

source: Forces the driver to use the CVF (Compressed Volume File) module cvfI<_module> instead of auto-detection. If the kernel supports B<kmod>, the B<cvf_format=>I<xxx> option also controls on-demand CVF module loading. This option is obsolete.
de: bewirkt, dass der Treiber das CVF-Modul (Compressed Volume File) cvfI<_Modul> verwendet, anstatt dass es automatisch erkannt wird. Wenn der Kernel B<kmod> unterstützt, steuert die Option B<cvf_format=>I<xxx> auch das bedarfsabhängige Laden von CVF-Modulen. Diese Option ist veraltet.
fr: Obliger le pilote à utiliser le module CVF (Compressed Volume File) B<cvf>I<_module> plutôt que l'autodétection. Si le noyau gère B<kmod>, l'option B<cvf_format=>I<module> commande aussi le chargement du module CVF à la demande. Cette option est obsolète.
uk: Наказує драйверу використовувати модуль CVF (Compressed Volume File, файл стиснутого тому) cvfI<_модуль> замість автоматичного виявлення. Якщо у ядрі передбачено підтримку B<kmod>, параметр B<cvf_format=>I<xxx> також керує завантаженням модуля CVF на вимогу. Цей параметр є застарілим.

source: Option passed to the CVF module. This option is obsolete.
de: wird an das CVF-Modul übergeben. Diese Option ist veraltet.
fr: Option passée au module CVF. Cette option est obsolète.
pl: Opcja przekazywana do modułu CVF. Ta opcja jest przestarzała.
uk: Параметр, який буде передано до модуля CVF. Цей параметр є застарілим.

source: Turn on the I<debug> flag. A version string and a list of filesystem parameters will be printed (these data are also printed if the parameters appear to be inconsistent).
de: aktiviert den Schalter I<debug>. Eine Versionszeichenkette und eine Liste der Dateisystemparameter werden ausgegeben (diese Daten werden auch dann ausgegeben, wenn die Parameter inkonsistent zu sein scheinen).
fr: Activer l'attribut B<debug>. Un numéro de version et une liste des paramètres du système de fichiers seront affichés (ces données seront également affichées si les paramètres semblent incohérents).
pl: Włącza flagę I<debug>. Wypisana zostanie wersja i lista parametrów systemu plików (te dane wypisywane są też jeśli parametry są niespójne).
uk: Увімкнути прапорець I<debug>. Буде виведено рядок версії та список параметрів файлової системи (ці дані також буде виведено, якщо буде виявлено несумісність параметрів).

source: If set, causes discard/TRIM commands to be issued to the block device when blocks are freed. This is useful for SSD devices and sparse/thinly-provisioned LUNs.
de: bewirkt, dass Verwerfungs- oder TRIM-Befehle an das blockorientierte Gerät gesendet werden, wenn Blöcke freigegeben werden. Dies ist für SSD-Geräte und bei schlanker Speicherzuweisung bei LUNs nützlich.
fr: Si elles sont activées, des commandes discard et TRIM seront envoyées au périphérique bloc quand les blocs sont libérés. C'est utile pour les périphériques SSD et l'allocation fine et dynamique (« thinly-provisioned LUN »).
pl: Jeśli ustawione, powoduje wydawanie poleceń discard/TRIM na urządzeniu blokowym, gdy bloki są zwalniane. Jest to przydatne w przypadku urządzeń SSD i alokowania elastycznego/"rzadkiego" w jednostkach LUN.
uk: Якщо встановлено, наказує відкинути/виконати TRIM для команд, які буде видано блоковому пристрою, при вивільненні блоків. Це корисно для пристроїв SSD і розріджених/thinly-provisioned LUN.

source: If set, use a fallback default BIOS Parameter Block configuration, determined by backing device size. These static parameters match defaults assumed by DOS 1.x for 160 kiB, 180 kiB, 320 kiB, and 360 kiB floppies and floppy images.
de: verwendet eine Ausweichkonfiguration der standardmäßigen Block-BIOS-Parameter, die durch das zugrunde liegende Gerät bestimmt wird. Diese statischen Parameter entsprechen den von DOS 1.x für Disketten der Größen 160 kiB, 180 kiB, 320 kiB und 360 kiB sowie Diskettenabbilder angenommenen Werten.
fr: Si définie, utiliser une configuration de repli par défaut de paramètre bloc du BIOS, déterminée par la taille du périphérique sous-jacent. Ces paramètres statiques correspondent aux valeurs par défaut supposées par DOS 1.x pour les disquettes et images de disquettes de 160 kio, 180 kio, 320 kio et 360 kio.
pl: Jeśli ustawione, używa domyślnej, zapasowej konfiguracji BIOS Parameter Block, w zależności od rozmiaru danego urządzenia. Te statyczne parametry przyjmują domyślne wartości DOS-a 1.x dla dyskietek i obrazów dyskietek 160 kiB, 180 kiB, 320 kiB i 360 kiB.
uk: Якщо встановлено, використовувати резервні типові налаштування блоку параметрів BIOS, які визначено за розміром резервного пристрою. Ці статичні параметри відповідають типовим параметрам, які передбачено у DOS 1.x для дискет 160 КіБ, 180 КіБ, 320 КіБ і 360 КіБ та образів дискет.

source: Specify FAT behavior on critical errors: panic, continue without doing anything, or remount the partition in read-only mode (default behavior).
de: legt das FAT-Verhalten bei kritischen Fehlern fest: »panic«, fortsetzen ohne weiteren Eingriff oder erneutes Einhängen der Partition im schreibgeschützten Modus (Standardverhalten).
fr: Indiquer le comportement FAT en cas d’erreur critique : B<panic>, continuer sans rien faire ou remonter la partition en mode lecture seule (comportement par défaut).
pl: Określa zachowanie FAT przy błędach krytycznych: panika, kontynuacja bez żadnej akcji, lub przemontowanie w tryb tylko do odczytu (tak jest domyślnie).
uk: Вказати поведінку FAT у відповідь на критичні помилки: паніка, продовжити без реакції або перемонтувати розділ у режимі лише читання (типова поведінка).

source: Specify a 12, 16 or 32 bit fat. This overrides the automatic FAT type detection routine. Use with caution!
de: legt ein FAT des Typs 12, 16 oder 32 Bit fest. Dadurch wird die Routine der automatischen FAT-Erkennung außer Kraft gesetzt. Sie sollten dies mit Vorsicht verwenden!
fr: Préciser s'il s'agit d'une FAT 12, 16 ou 32 bits. Cela a priorité sur la détection automatique du type de FAT. À utiliser avec précaution !
pl: Określa fat 12-, 16- lub 32-bitowy. To przesłania procedurę automatycznego wykrywania typu FAT. Używaj ostrożnie!
uk: Вказати 12-, 16- або 32-бітовий FAT. Має вищий пріоритет за типову автоматичну процедуру виявлення типу FAT. Будьте обережні!

source: B<iocharset=>I<value>
de: B<iocharset=>I<Wert>
fr: B<iocharset=>I<valeur>
pl: B<iocharset=>I<wartość>
uk: B<iocharset=>I<значення>

source: Character set to use for converting between 8 bit characters and 16 bit Unicode characters. The default is iso8859-1. Long filenames are stored on disk in Unicode format.
de: gibt den für die Umwandlung von 8-Bit- und 16-Bit-Unicode-Zeichen zu verwendenden Zeichensatz an. Die Standardeinstellung ist iso8859-1. Lange Dateinamen werden auf der Platte im Unicode-Format gespeichert.
fr: Jeu de caractères pour les conversions entre les caractères 8 bits et les caractères 16 bits Unicode. Par défaut c'est ISO 8859-1. Les noms de fichiers longs sont conservés sur le disque au format Unicode.
pl: Zestaw znaków używany do konwersji między znakami 8-bitowymi a 16-bitowymi znakami Unikodu. Domyślnym jest iso8859-1. Długie nazwy plików są przechowywane na dysku w formacie Unicode.
uk: Набір символів, яким слід скористатися при перетворенні між 8-бітовими символами і 16-бітовими символами Unicode. Типовим є iso8859-1. Довгі назви файлів зберігатимуться на диску у форматі Unicode.

source: Enable this only if you want to export the FAT filesystem over NFS.
de: Aktivieren Sie dies nur, wenn Sie das FAT-Dateisystem über NFS exportieren wollen.
fr: N’activer cela que si vous voulez exporter le système de fichiers FAT par NFS.
pl: Tę opcję należy włączyć przy eksporcie systemu plików FAT przez NFS.
uk: Вмикайте, лише якщо ви хочете експортувати файлову систему FAT на основі NFS.

source: B<stale_rw>: This option maintains an index (cache) of directory inodes which is used by the nfs-related code to improve look-ups. Full file operations (read/write) over NFS are supported but with cache eviction at NFS server, this could result in spurious B<ESTALE> errors.
de: B<stale_rw>: Diese Option verwaltet einen Index (Zwischenspeicher) von Verzeichnis-Inodes, der von NFS-bezogenem Code zur Verbesserung von Abfragevorgängen verwendet wird. Vollständige Dateioperationen (schreiben/lesen) über NFS werden unterstützt, aber mit Zwischenspeicher-Leerung auf dem NFS-Server, was fälschliche B<ESTALE>-Fehler verursachen könnte.
fr: B<stale_rw> : cette option maintient un index (cache) des inœuds de répertoire qui est utilisé par le code relatif à NFS pour améliorer les recherches. Les opérations complètes de fichier (lecture ou écriture) par NFS sont prises en charge mais avec expulsion du cache vers le serveur NFS, cela pourrait avoir pour conséquence des erreurs B<ESTALE> infondées.
pl: B<stale_rw>: Opcja ta zarządza indeksem (buforem) i-węzłów katalogów używanych przez kod związany z nfs do usprawnienia wyszukiwań. Operacja pełnoplikowe (odczyt/zapis) przez NFS są obsługiwane, ale przy usuwaniu bufora na serwerze NFS może to powodować fałszywe błędy B<ESTALE>.
uk: B<stale_rw>: використання цього параметра призводить до підтримання покажчика (кешу) inode каталогів, який буде використано пов'язаним із NFS кодом для удосконалення пошуку. Передбачено підтримку повного набору дій з файлами (читання/запис), але із заміщенням кешу на сервері NFS, це може призвести до паразитних помилок B<ESTALE>.

source: B<nostale_ro>: This option bases the inode number and file handle on the on-disk location of a file in the FAT directory entry. This ensures that B<ESTALE> will not be returned after a file is evicted from the inode cache. However, it means that operations such as rename, create and unlink could cause file handles that previously pointed at one file to point at a different file, potentially causing data corruption. For this reason, this option also mounts the filesystem readonly.
de: B<nostale_ro>: Bei dieser Option basiert die Inode-Nummer und der Datei-Handler auf dem Ort auf der Platte im FAT-Verzeichniseintrag. Dies stellt sicher, dass B<ESTALE> nicht zurückgegeben wird, nachdem eine Datei aus dem Inode-Zwischenspeicher entfernt wurde. Jedoch bedeutet das, dass Aktionen wie Umbenennen, Anlegen und Löschen mit »Unlink« Datei-Handles zur Folge haben könnten, die vorher auf eine Datei, und anschließend auf eine andere Datei zeigen, was potenziell Datenverlust verursachen könnte. Aus diesem Grund hängt die Option das Dateisystem schreibgeschützt ein.
fr: B<nostale_ro> : cette option base le numéro d’inœud et le descripteur de fichier sur l’emplacement d’un fichier sur le disque dans l’entrée de répertoire FAT. Cela assure que B<ESTALE> ne sera pas renvoyé après l'expulsion d’un fichier du cache d’inœuds. Cependant, cela signifie que les opérations comme le renommage, la création et la destruction pourraient forcer les gestionnaires de fichiers qui pointaient auparavant vers un fichier à pointer vers un autre fichier, avec une éventuelle corruption de données. Pour cette raison, cette option monte aussi le système de fichiers en lecture seule.
pl: B<nostale_ro>: Ta opcja bazuje na numerze i-węzła i uchwycie pliku w położeniu pliku na dysku we wpisie katalogu FAT. Zapewnia to, że nie zostanie zwrócone B<ESTALE> po usunięciu pliku z bufora i-węzła. Jednak skutkuje to również tym, że operacja takie jak zmiana nazwy, utworzenie i usunięcie (unlink) może spowodować, że uchwyty plików wskazujące na jakiś plik zaczną wskazywać na inny, powodując potencjalnie uszkodzenie danych. Z tego powodu, opcja ta montuje jednocześnie system plików jako tylko do odczytu.
uk: B<nostale_ro>: використання цього варіанта призводить до того, що номер inode та дескриптор файла буде засновано на розташування файла на диску у записі каталогу FAT. Це забезпечить те, що B<ESTALE> не буде повернуто, після того, як файл буде заміщено з кешу inode. Втім, це означає, що дії, подібні до перейменування, створення та скасування символічних посилань, можуть спричинити те, що дескриптори файлів, які раніше вказували на один файл, вказуватимуть на інший, що може призвести до пошкодження даних. З цієї причини використання цього варіанта також призводить до монтування файлової системи у режимі лише читання.

source: To maintain backward compatibility, B<-o nfs> is also accepted, defaulting to B<stale_rw>.
de: Zwecks Abwärtskompatibilität wird auch B<-o nfs> unterstützt, standardmäßig B<stale_rw>.
fr: Pour la compatibilité ascendante, B<-o nfs> est aussi acceptée, signifiant par défaut B<stale_rw>.
pl: Aby zachować kompatybilność wsteczną, akceptowana jest również opcja B<-o nfs>, która daje B<stale_rw>.
uk: Для підтримання зворотної сумісності також є прийнятним B<-o nfs>. Типовий варіантом є B<stale_rw>.

source: This option disables the conversion of timestamps between local time (as used by Windows on FAT) and UTC (which Linux uses internally). This is particularly useful when mounting devices (like digital cameras) that are set to UTC in order to avoid the pitfalls of local time.
de: deaktiviert die Umwandlung der Zeitstempel zwischen lokaler Zeit (wie von Windows FAT verwendet) und UTC (Weltzeit, wie von Linux intern verwendet). Dies ist insbesondere nützlich, wenn Geräte eingehängt werden, die auf UTC gesetzt sind (wie zum Beispiel Digitalkameras), um die Fallstricke der lokalen Zeit zu umgehen.
fr: Cette option désactive la conversion des horodatages entre le temps local (comme utilisé par Windows avec FAT) et le temps universel (que Linux utilise en interne). C'est particulièrement utile lors du montage de périphériques (comme des appareils photo numériques) qui utilisent l'heure universelle afin de s'affranchir des différentes heures locales.
pl: Opcja wyłącza konwersję pieczątek czasowych pomiędzy czasem lokalnym (używanym przez Windows na FAT) i UTC (używanym wewnętrznie przez Linuksa). Jest to przydatne szczególnie podczas montowania urządzeń (np. aparatów cyfrowych), które są ustawione na UTC, aby uniknąć pułapki związanej z czasem lokalnym.
uk: Цей параметр вимикає перетворення часових позначок між місцевим часом (який використовує Windows для FAT) та UTC (який на внутрішньому рівні використовує Linux). Це, зокрема, корисно при монтуванні пристроїв (наприклад, цифрових фотоапаратів), які працюють з UTC, щоб уникнути проблем із визначенням місцевого часу.

source: Set offset for conversion of timestamps from local time used by FAT to UTC. I.e., I<minutes> will be subtracted from each timestamp to convert it to UTC used internally by Linux. This is useful when the time zone set in the kernel via B<settimeofday>(2) is not the time zone used by the filesystem. Note that this option still does not provide correct time stamps in all cases in presence of DST - time stamps in a different DST setting will be off by one hour.
de: legt den Versatz für die Umwandlung von Zeitstempeln von der von FAT verwendeten lokalen Zeit in Weltzeit (UTC) um. Das heißt, die I<Minuten> werden von jedem Zeitstempel abgezogen, um ihn in die von Linux intern verwendete UTC umzuwandeln. dies ist nützlich, wenn die im Kernel mittels B<settimeofday>(2) gesetzte Zeitzone nicht die vom Dateisystem verwendete Zeitzone ist. Beachten Sie, dass diese Option immer noch nicht in allen Fällen von Sommerzeit-Winterzeit-Regelung (DST) korrekte Zeitstempel bereitstellt - Zeitstempel in einer Zone mit anderer Sommrzeit werden um eine Stunde versetzt sein.
fr: Définir le décalage pour la conversion des horodatages de l’heure locale utilisée par FAT en UTC. C’est-à-dire que des I<minutes> seront soustraites de chaque horodatage pour le convertir en UTC, tel qu’utilisé en interne par Linux. C’est utile quand le fuseau horaire défini dans le noyau par B<settimeofday>(1) n’est pas le fuseau horaire utilisé par le système de fichiers. Remarquez que cette option ne fournit cependant pas d’horodatage correct dans tous les cas en présence d’heure d’été — les horodatages en cas de configuration d’heure d’été différente seront décalés d’une heure.
pl: Ustawia przesunięcie do przeliczania pieczątek czasowych pomiędzy czasem lokalnym z FAT na UTC, tj. liczba I<minut> zostanie odjęta od każdej pieczątki czasowej, aby przeliczyć ją do czasu UTC używanego wewnętrznie przez Linuksa. Jest to przydatne, gdy strefa czasowa ustawiana przez jądro za pomocą B<settimeofday>(2) nie pokrywa się ze strefą czasową systemu plików. Proszę zauważyć, że ta opcja wciąż nie da prawidłowych pieczątek czasowych w przypadkach korzystania z czasu letniego – w innym ustawieniu czasu letniego wystąpi godzina różnicy.
uk: Встановити зсув для перетворення часових позначок з місцевого часу, який використано у FAT, до UTC. Тобто, значення I<хвилини> буде віднято від усіх часових позначок, щоб перетворити його на час UTC, який використовують на внутрішньому рівні у Linux. Це корисно, якщо часовий пояс, який встановлено у ядрі за допомогою B<settimeofday>(2), не збігається із часовим поясом, який використано у файловій системі. Зауважте, що цей параметр все одно не дає належних часових позначок в усіх випадках, якщо використано літній час — часові позначки за різних параметрів літнього часу можуть відрізнятися на годину.

source: Turn on the I<quiet> flag. Attempts to chown or chmod files do not return errors, although they fail. Use with caution!
de: aktiviert den Schalter I<quiet>. Versuche, »chown« oder »chmod« auf die Dateien anzuwenden, geben keine Fehler zurück, auch bei Fehlschlägen. Sie sollten dies mit Vorsicht verwenden!
fr: Activer l'attribut B<quiet>. Les tentatives de modification du propriétaire ou du mode d'accès aux fichiers ne renverront pas d'erreurs, bien qu'elles échouent. À utiliser avec précaution !
pl: Włącza flagę I<quiet> (cicho). Próby chown lub chmod nie zwracają błędów, chociaż się nie udają. Używaj ostrożnie!
uk: Увімкнути прапорець I<мовчазного> режиму. Спроби зміни власника або режиму доступу до файлів не повертатимуть повідомлень про помилки, хоча і будуть невдалими. Будьте обережні!
