Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Select number of session on a multisession CD.
de: wählt die Nummer der Sitzung auf einer Mehrfachsitzung-(Multisession-)CD.
fr: Indiquer le numéro de session sur un CD multisessions.
pl: Wybiera numer sesji na CD wielosesyjnych.
uk: Вибрати номер сеансу для багатосеансового компакт-диска.

source: Session begins from sector xxx.
de: gibt an, dass die Sitzung mit dem Sektor xxx beginnt.
fr: La session commence au secteur I<xxx>.
pl: Sesja zaczyna się od sektora xxx.
uk: Сеанс починається з сектора xxx.

source: The following options are the same as for vfat and specifying them only makes sense when using discs encoded using Microsoft\(cqs Joliet extensions.
de: Die folgenden Optionen sind die gleichen wie für VFAT. Deren Angabe ergibt nur bei Platten Sinn, die mit den Joliet-Erweiterungen vom Microsoft kodiert sind.
fr: Les options suivantes sont les mêmes que pour I<vfat> et les indiquer n'a de sens que dans le cas de disques utilisant les extensions Joliet de Microsoft.
pl: Poniższe opcje są takie same jak do vfat i podawanie ich ma sens tylko przy używaniu płyt zakodowanych przy użyciu rozszerzeń Joliet firmy Microsoft.
uk: Подальші параметри такі ж, як і для vfat, і вказувати їх має сенс лише за використання дисків, закодованих за допомогою розширень Joliet від Microsoft).

source: Character set to use for converting 16 bit Unicode characters on CD to 8 bit characters. The default is iso8859-1.
de: gibt den für die Umwandlung von 16-Bit-Unicode-Zeichen auf der CD in 8-Bit-Zeichen zu verwendenden Zeichensatz an. Die Standardeinstellung ist iso8859-1.
fr: Jeu de caractères à utiliser pour la conversion des caractères Unicode 16 bits du CD en caractères 8 bits. Le jeu par défaut est ISO 8859-1.
pl: Zestaw znaków używany do konwersji z 16-bitowych znaków Unikodu na CD do 8-bitowych znaków. Domyślnie jest to iso8859-1.
uk: Набір символів для перетворення 16-бітових символів Unicode на компакт-диску у 8-бітові символи. Типово встановлено iso8859-1.

source: Convert 16 bit Unicode characters on CD to UTF-8.
de: wandelt 16-Bit-Unicode-Zeichen auf der CD in UTF-8 um.
fr: Convertir les caractères Unicode 16 bits du CD en UTF-8.
pl: Konwertuje 16-bitowe znaki Unikodu na CD do UTF-8.
uk: Перетворити 16-бітові символи Unicode на компакт-диску в UTF-8.

source: Mount options for jfs
de: Einhängeoptionen für JFS
fr: Options de montage pour jfs
pl: Opcje montowania do jfs
uk: Параметри монтування jfs

source: B<iocharset=>I<name>
fr: B<iocharset=>I<nom>
pl: B<iocharset=>I<nazwa>
uk: B<iocharset=>I<назва>

source: Character set to use for converting from Unicode to ASCII. The default is to do no conversion. Use B<iocharset=utf8> for UTF8 translations. This requires B<CONFIG_NLS_UTF8> to be set in the kernel I<.config> file.
de: gibt den für die Umwandlung von Unicode in ASCII zu verwendenden Zeichensatz an. Standardmäßig wird keine Umwandlung ausgeführt. Verwenden Sie B<iocharset=utf8> für Übersetzungen in UTF-8. Dies erfordert das Setzen von B<CONFIG_NLS_UTF8> in der Kernelkonfiguration I<.config>.
fr: Jeu de caractères à utiliser pour la conversion de l'Unicode en ASCII. Le comportement par défaut est de ne pas faire de conversion. Utiliser B<iocharset=utf8> pour les traductions UTF-8. Cela nécessite que B<CONFIG_NLS_UTF8> soit positionné dans le fichier I<.config> du noyau.
pl: Zestaw znaków, używany do konwersji z Unikodu do ASCII. Domyślnie konwersja nie jest przeprowadzana. Proszę użyć B<iocharset=utf8> w celu tłumaczeń UTF-8. Opcja wymaga ustawienia B<CONFIG_NLS_UTF8> w pliku jądra I<.config>.
uk: Набір символів для перетворення з Unicode в ASCII. Типовим є не виконувати перетворення. Для перетворення в UTF8 використовуйте B<iocharset=utf8>. Для цього у файлі I<.config> ядра потрібно встановити B<CONFIG_NLS_UTF8>.

source: B<resize=>I<value>
de: B<resize=>I<Blöcke>
fr: B<resize=>I<valeur>
pl: B<resize=>I<wartość>
uk: B<resize=>I<значення>

source: Resize the volume to I<value> blocks. JFS only supports growing a volume, not shrinking it. This option is only valid during a remount, when the volume is mounted read-write. The B<resize> keyword with no value will grow the volume to the full size of the partition.
de: verändert die Größe des Datenträgers auf die angegebene Anzahl I<Blöcke>. JFS unterstützt nur die Vergrößerung von Datenträgern, nicht das Verkleinern. Diese Option ist nur beim erneuten Einhängen zulässig, wenn der Datenträger les- und schreibbar eingehängt ist. Das Schlüsselwort B<resize> ohne Wert vergrößert den Datenträger auf die Gesamtgröße der Partition.
fr: Redimensionner le volume à I<valeur> blocs. JFS ne prend en charge que l'agrandissement d'un volume, pas sa réduction. Cette option n'est valable que lors d'un remontage, lorsque le volume est monté en lecture et écriture. Le mot clef B<resize> sans valeur associée fera que le volume sera agrandi à toute la taille de la partition.
pl: Zmienia wielkość woluminu do I<wartość> bloków. JFS obsługuje jedynie powiększanie woluminu, nie zmniejszanie go. Opcja jest prawidłowa tylko podczas ponownego montowania, gdy wolumin jest zamontowany do odczytu i zapisu. Słowo kluczowe B<resize> bez wartości, powiększy wolumin do pełnego rozmiaru partycji.
uk: Змінити обсягу до I<значення> блоків. JFS підтримує лише збільшення обсягу, а не його скорочення. Цей параметр діє лише під час перемонтування, коли том підключено для читання-запису. Ключове слово B<resize> без значення збільшить обсяг до повного розміру розділу.

source: Do not write to the journal. The primary use of this option is to allow for higher performance when restoring a volume from backup media. The integrity of the volume is not guaranteed if the system abnormally ends.
de: schreibt nicht ins Journal. Der primäre Zweck dieser Option ist es, die Performance beim Wiederherstellen eines Datenträgers von einem Sicherungsmedium zu verbessern. Die Integrität des Datenträgers kann nicht gewährleistet werden, wenn das System unerwartet endet.
fr: Ne pas écrire dans le journal. La première utilisation de cette option est de permettre une meilleure performance lors de la restauration d'un volume à partir d'un média de sauvegarde. L'intégrité du volume n'est pas garantie si le système s'est arrêté de manière anormale.
pl: Nie zapisuje do dziennika. Głównym użyciem tej opcji jest możliwość uzyskania wyższej wydajności przy przywracaniu woluminu z kopii zapasowej. Integralność woluminu nie jest gwarantowana, jeśli system zostanie nieprawidłowo zamknięty.
uk: Не записувати в журнал. Цей параметр переважно використовують для підвищення продуктивності під час відновлення тому з резервного носія. Якщо система ненормально завершує роботу, то цілісність тому не гарантується.

source: Default. Commit metadata changes to the journal. Use this option to remount a volume where the B<nointegrity> option was previously specified in order to restore normal behavior.
de: schreibt Änderungen der Metadaten in das Journal (Standard). Verwenden Sie diese Option, um einen Datenträger erneut einzuhängen, wenn dieser zuvor mit der Option B<nointegrity> eingehängt wurde, um damit das normale Verhalten wiederherzustellen.
fr: C'est le comportement par défaut. Soumettre les modifications des méta-données dans le journal. Utilisez cette option pour remonter un volume lorsque l'option B<nointegrity> a été précédemment utilisée afin de retrouver un comportement normal.
pl: Domyślne. Zapisuje zmiany metadanych do dziennika. Można użyć tej opcji do ponownego zamontowania woluminu, gdy wcześniej użyto opcji B<nointegrity>, w celu przywrócenia normalnego zachowania.
uk: Типове. Занести зміни метаданих у журнал. Використовуйте цей параметр, щоб перемонтувати том, де раніше було вказано параметр B<nointegrity>, для відновлення звичайної поведінки.

source: Define the behavior when an error is encountered. (Either ignore errors and just mark the filesystem erroneous and continue, or remount the filesystem read-only, or panic and halt the system.)
de: legt das Verhalten fest, wenn ein Fehler aufgetreten ist (entweder werden Fehler ignoriert und das Dateisystem als fehlerhaft markiert und der Vorgang fortgesetzt oder das Dateisystem schreibgeschützt neu eingehängt oder ein »panic« ausgelöst und das System angehalten).
fr: Définir le comportement lorsqu'une erreur survient. (Soit ignorer les erreurs et simplement marquer le système de fichiers comme erroné et continuer, soit remonter le système de fichiers en lecture seule, soit déclencher une panique du noyau et arrêter le système).
pl: Definiuje zachowanie przy napotkaniu błędu (albo ignoruje błędy, zaznaczając tylko system plików jako błędny i kontynuując, albo ponownie montuje system plików na tylko do odczytu, albo panikuje i zatrzymuje system).
uk: Визначає поведінку при виникненні помилки. (Або нехтувати помилки та просто позначити файлову систему як помилкову та продовжити, або перемонтувати файлову систему лише для читання, або панічно зупинити систему.)

source: These options are accepted but ignored.
de: Diese Optionen werden akzeptiert, aber ignoriert.
fr: Ces options sont acceptées mais ignorées.
pl: Opcje te są przyjmowane, lecz ignorowane.
uk: Ці параметри буде прийнято, але проігноровано.

source: Mount options for msdos
de: Einhängeoptionen für MSDOS
fr: Options de montage pour msdos
pl: Opcje montowania do msdos
uk: Параметри монтування msdos

source: See mount options for fat. If the I<msdos> filesystem detects an inconsistency, it reports an error and sets the file system read-only. The filesystem can be made writable again by remounting it.
de: Siehe die Einhängeoptionen für FAT. Wenn das I<msdos>-Dateisystem eine Inkonsistenz erkennt, meldet es einen Fehler und setzt das Dateisystem auf schreibgeschützt. Das Dateisystem kann wieder schreibbar gemacht werden, indem es erneut eingehängt wird.
fr: Consultez les options de montage pour I<fat>. Si le système de fichiers I<msdos> détecte des incohérences, une erreur sera indiquée et le système de fichiers passera en lecture seule. L'écriture peut être réactivée en remontant le système de fichiers.
pl: Zobacz opcje do fat. Jeśli system plików I<msdos> wykryje niespójność, zgłasza błąd i ustawia system plików na tylko do odczytu. System plików może być znowu dostępny do zapisu przez ponowne zamontowanie.
uk: Див. параметри монтування для FAT. Якщо файлова система I<msdos> виявляє неузгодженість, вона повідомляє про помилку та встановлює для файлової системи режим лише для читання. Файлову систему можна знову зробити придатною для запису, перемонтувавши її.

source: Mount options for ncpfs
de: Einhängeoptionen für Ncpfs
fr: Options de montage pour ncpfs
pl: Opcje montowania do ncpfs
uk: Параметри монтування ncpfs

source: Just like I<nfs>, the I<ncpfs> implementation expects a binary argument (a I<struct ncp_mount_data>) to the B<mount>(2) system call. This argument is constructed by B<ncpmount>(8) and the current version of B<mount> (2.12) does not know anything about ncpfs.
de: Wie bei I<nfs> erwartet die I<ncpfs>-Implementation ein binäres Argument (ein I<struct ncp_mount_data>) zum Systemaufruf B<mount>(2). Dieses Argument wird von B<ncpmount>(8) konstruiert, aber die aktuelle Version von B<mount> (2.12) weiß nichts über Ncpfs.
fr: Tout comme I<nfs>, l'implémentation de I<ncpfs> nécessite un paramètre binaire (une structure I<ncp_mount_data>) lors de l'appel système B<mount>(2). Cet argument est construit par B<ncpmount>(8) et la version actuelle de B<mount> (2.12) ne connaît rien en ce qui concerne I<ncpfs>.
uk: Як і I<nfs>, реалізація I<ncpfs> очікує двійкового аргументу (I<struct ncp_mount_data>) для системного виклику B<mount>(2). Цей аргумент створено B<ncpmount>(8), а поточна версія B<mount> (2.12) нічого не знає про ncpfs.

source: Mount options for ntfs
de: Einhängeoptionen für NTFS
fr: Options de montage pour ntfs
pl: Opcje montowania do ntfs
uk: Параметри монтування ntfs

source: Character set to use when returning file names. Unlike VFAT, NTFS suppresses names that contain nonconvertible characters. Deprecated.
de: gibt den Zeichensatz an, der für zurückgegebene Dateinamen verwendet wird. Im Gegensatz zu VFAT unterdrückt NTFS Namen, die nicht konvertierbare Zeichen enthalten. Missbilligt.
fr: Jeu de caractères à utiliser pour renvoyer les noms de fichiers. Contrairement à VFAT, NTFS supprime les noms qui contiennent des caractères non convertibles. Obsolète.
pl: Zestaw znaków stosowany przy zwracaniu nazw plików. W przeciwieństwie do VFAT, NTFS eliminuje nazwy zawierające znaki nie dające się przekształcić. Przestarzałe.
uk: Набір символів для використання під час повернення назв файлів. На відміну від VFAT, NTFS пригнічує назви, які містять символи, що не конвертуються. Застаріле.

source: B<nls=>I<name>
fr: B<nls=>I<nom>
pl: B<nls=>I<nazwa>
uk: B<nls=>I<назва>

source: New name for the option earlier called I<iocharset>.
de: ist ein neuer Name für die frühere Option I<iocharset>.
fr: Nouveau nom pour l'option précédemment nommée B<iocharset>.
pl: Nowa nazwa dla opcji zwanej wcześniej I<iocharset>.
uk: Нова назва параметра, який раніше мав назву I<iocharset>.

source: Use UTF-8 for converting file names.
de: verwendet UTF-8 zur Umwandlung von Dateinamen.
fr: Utiliser UTF-8 pour convertir les noms de fichiers.
pl: Do konwersji nazw plików stosuje UTF-8.
uk: Скористатися UTF-8 для перетворення назв файлів.

source: For 0 (or \(aqno\(aq or \(aqfalse\(aq), do not use escape sequences for unknown Unicode characters. For 1 (or \(aqyes\(aq or \(aqtrue\(aq) or 2, use vfat-style 4-byte escape sequences starting with ":". Here 2 gives a little-endian encoding and 1 a byteswapped bigendian encoding.
de: Für 0 (oder »no« oder »false«) werden keine Escape-Sequenzen für unbekannte Unicode-Zeichen verwendet. Für 1 (oder »yes« oder »true«) oder 2 werden mit »:« beginnende 4-Byte-Escape-Sequenzen im VFAT-Stil verwendet: Hier ergibt 2 eine Little-Endian-Kodierung und 1 eine Big-Endian-Kodierung mit vertauschten Bytes.
fr: Si B<0> (ou B<no>, ou B<false>), ne pas utiliser de séquences d'échappements pour les caractères Unicode inconnus. Si B<1> (ou B<yes>, ou B<true>) ou B<2>, utiliser les séquences d'échappement sur quatre octets de style I<vfat> en commençant par « : ». Avec B<2>, un codage petit boutiste (« little-endian ») est utilisé et avec B<1> un codage grand boutiste (« big-endian »).
pl: Dla 0 (lub "no" albo "false") nie używa specjalnych kodowań nieznanych znaków Unikodu. Dla 1 (lub "yes" albo "true") lub 2 używa 4-bajtowych sekwencji specjalnych w stylu vfat zaczynających się od ":". Liczba 2 oznacza kodowanie little-endian, a 1 - kodowanie big-endian, z odwróconymi bajtami.
uk: 0 (або \(aqno\(aq або \(aqfalse\(aq)) - не використовувати escape-послідовностей для невідомих символів Unicode. 1 (або \(aqyes\(aq або \(aqtrue\(aq) або 2 - використовувати 4-байтові escape-послідовності у стилі vfat, які починаються з ":". 2 означає кодування з першим молодшим байтом, а 1 - кодування з першим старшим байтом.

source: B<posix=[0|1]>
fr: B<posix=>[B<0>|B<1>]

source: If enabled (posix=1), the filesystem distinguishes between upper and lower case. The 8.3 alias names are presented as hard links instead of being suppressed. This option is obsolete.
de: Falls dies aktiviert ist (posix=1), unterscheidet das Dateisystem zwischen Groß- und Kleinschreibung. Die 8.3-Aliasnamen werden als harte Links dargestellt, statt unterdrückt zu werden. Diese Option ist veraltet.
fr: Si actif (B<posix=1>), le système de fichiers distingue les majuscules des minuscules. Les noms d'alias I<8.3> sont présentés sous forme de liens physiques plutôt que d'être supprimés. Cette option est obsolète.
pl: Jeśli jest włączone (posix=1), to system plików rozróżnia wielkie i małe litery. Nazwy zastępcze 8.3 są przedstawiane jako dowiązania twarde, a nie pomijane. Ta opcja jest przestarzała.
uk: Якщо ввімкнено (posix=1), файлова система розрізняє верхній і нижній регістр. Псевдоніми 8.3 представлено як жорсткі посилання, а не приховані. Цей варіант застарів.

source: B<uid=>I<value>, B<gid=>I<value> and B<umask=>I<value>
de: B<uid=>I<Wert>, B<gid=>I<Wert> und B<umask=>I<Wert>
fr: B<uid=>,I<valeur>, B<gid=>,I<valeur> et B<umask=>,I<valeur>
pl: B<uid=>I<wartość>, B<gid=>I<wartość> i B<umask=>I<wartość>
uk: B<uid=>I<значення>, B<gid=>I<значення> і B<umask=>I<значення>

source: Set the file permission on the filesystem. The umask value is given in octal. By default, the files are owned by root and not readable by somebody else.
de: legt die Dateizugriffsrechte des Dateisystems fest. Der Umask-Wert wird in oktaler Notation angegeben. Standardmäßig gehören Dateien dem Benutzer Root und können von anderen nicht gelesen werden.
fr: Définir les permissions des fichiers sur le système de fichiers. La valeur d'umask est fournie en octal. Par défaut, les fichiers appartiennent au superutilisateur et ne sont lisibles par personne d'autre.
pl: Ustawia prawa plików dla danego systemu. Wartość umask powinna być podana ósemkowo. Domyślnie właścicielem plików jest root i nikt inny nie może ich czytać.
uk: Встановити дозвіл на файл у файловій системі. Значення umask подається у вісімковій системі. Типово файли належать користувачу root і не доступні для читання кимось іншим.

source: Mount options for overlay
de: Einhängeoptionen für overlay
fr: Options de montage pour la superposition (overlay)
pl: Opcje montowania do overlay
uk: Параметри монтування overlay

source: Since Linux 3.18 the overlay pseudo filesystem implements a union mount for other filesystems.
de: Seit Linux 3.18 implementiert das Überlagerungs-Pseudo-Dateisystem eine vereinigte Einhängung für andere Dateisysteme.
fr: Depuis Linux 3.18, le pseudo système de fichiers overlay met en œuvre un montage en union (union mount) pour d’autres système de fichiers.
pl: Od Linuksa 3.18 pseudosystem plików overlay implementuje łączone montowanie dla innych systemów plików.
uk: Починаючи від Linux 3.18, накладна псевдофайлова система реалізує об'єднане монтування для інших файлових систем.

source: An overlay filesystem combines two filesystems - an B<upper> filesystem and a B<lower> filesystem. When a name exists in both filesystems, the object in the upper filesystem is visible while the object in the lower filesystem is either hidden or, in the case of directories, merged with the upper object.
de: Ein Überlagerungs-Dateisystem kombiniert zwei Dateisysteme - ein B<oberes> und ein B<unteres> Dateisystem. Wenn ein Name in beiden Dateisystemen existiert, ist das Objekt im oberen Dateisystem sichtbar, während das Objekt im unteren Dateisystem entweder verborgen ist oder (bei Verzeichnissen) mit dem oberen Objekt zusammengeführt wird.
fr: Un système de fichiers de superposition combine deux systèmes de fichiers — un système de fichiers B<supérieur> et un système de fichiers B<inférieur>. Lorsqu’un nom est présent sur les deux systèmes de fichiers, l’objet dans le système de fichiers supérieur est visible tandis que l’objet dans le système de fichiers inférieur est soit caché, soit, dans le cas de répertoire, fusionné avec l’objet supérieur.
pl: Overlay łączy dwa systemy plików – B<górny> i B<dolny>. Gdy jakaś nazwa istnieje w obu systemach plików, widoczny jest obiekt z górnego, a obiekt z dolnego jest albo ukryty, albo, w przypadku katalogów, łączony z górnym obiektem.
uk: Накладна файлова система поєднує дві файлові системи - файлову систему B<верхню> і файлову систему B<нижню>. Якщо назва існує в обох файлових системах, об'єкт у верхній файловій системі буде видимим, а об'єкт у нижній файловій системі або прихованим, або, у випадку каталогів, об'єднаним із верхнім об'єктом.

source: The lower filesystem can be any filesystem supported by Linux and does not need to be writable. The lower filesystem can even be another overlayfs. The upper filesystem will normally be writable and if it is it must support the creation of trusted.* extended attributes, and must provide a valid d_type in readdir responses, so NFS is not suitable.
de: Das untere Dateisystem kann jedes von Linux unterstützte Dateisystem sein; es muss nicht schreibbar sein. Das untere Dateisystem kann sogar ein weiteres Überlagerungs-Dateisystem sein. Das obere Dateisystem wird normalerweise schreibbar sein, und falls das so ist, muss es die Erzeugung von erweiterten Attributen der Form »trusted.*« unterstützen und einen gültigen d_type in readdir-Antworten bereitstellen, daher ist NFS nicht geeignet.
fr: Le système de fichiers inférieur peut être n’importe quel système de fichiers pris en charge par Linux et n’a nul besoin d’être modifiable. Il peut même être un autre système de fichiers overlay. Le système de fichiers supérieur sera normalement modifiable et si c'est le cas, doit gérer la création d’attributs étendus I<trusted.*> et fournir un I<d_type> autorisé dans les réponses de B<readdir>, aussi NFS n’est pas adapté.
pl: Dolnym system plików może być dowolny, obsługiwany przez Linuksa system plików. Nie musi być on zapisywalny. Dolny system plików może być nawet kolejnym systemem typu overlay. Górny system plików zwykle jest zapisywalny i jeśli tak jest, musi obsługiwać tworzenie rozszerzonych atrybytów trusted.* oraz zapewniać prawidłowe d_type w odpowiedziach readdir; z tego powodu NFS jest nieodpowiedni.
uk: Нижньою файловою системою може бути будь-яка файлова система, яку підтримує Linux, можливо, недоступна для запису. Нижня файлова система може бути навіть іншою накладною файловою системою. Верхня файлова система зазвичай доступна для запису, і, якщо так, вона має підтримувати створення розширених атрибутів trusted.* і надавати дійсний тип d_type у відповідях readdir, тому NFS для цього не підходить.

source: A read-only overlay of two read-only filesystems may use any filesystem type. The options B<lowerdir> and B<upperdir> are combined into a merged directory by using:
de: Eine schreibgeschützte Überlagerung zweier schreibgeschützter Dateisysteme kann jeden Dateisystemtyp verwenden. Die Optionen B<lowerdir> und B<upperdir> werden folgendermaßen in einem zusammengeführten Verzeichnis kombiniert:
fr: Un système de fichiers overlay en lecture seule de deux systèmes de fichiers peut utiliser n’importe quel type de système de fichiers. Les options B<lowerdir> et B<upperdir> sont combinées dans un répertoire de fusion en utilisant :
pl: Overlay tylko o odczytu z dwóch systemów plików będących tylko do odczytu może korzystać z dowolnego typu systemu plików. Opcje B<lowerdir> i B<upperdir> są łączone do połączone katalogu za pomocą:
uk: Накласти лише для читання можна дві файлові системи, доступні лише для читання, будь-якого типу. Параметри B<lowerdir> і B<upperdir> об'єднуються в спільний каталог за допомогою:

source: B<lowerdir=>I<directory>
de: B<lowerdir=>I<Verzeichnis>
fr: B<lowerdir=>I<répertoire>
pl: B<lowerdir=>I<katalog>
uk: B<lowerdir=>I<каталог>

source: Any filesystem, does not need to be on a writable filesystem.
de: Jedes Dateisystem, muss kein schreibbares Dateisystem sein.
fr: N’importe quel système de fichiers, sans nécessité d’être sur un système de fichiers modifiable.
pl: Dowolny system plików, nie musi być zapisywalny.
uk: Будь-яка файлова система, не обов'язково доступна для запису.

source: B<upperdir=>I<directory>
de: B<upperdir=>I<Verzeichnis>
fr: B<upperdir=>I<répertoire>
pl: B<upperdir=>I<katalog>
uk: B<upperdir=>I<каталог>

source: The upperdir is normally on a writable filesystem.
de: Das obere Verzeichnis liegt normalerweise auf einem schreibbaren Dateisystem.
fr: Le I<répertoire> est normalement un système de fichiers modifiable.
pl: Katalog górny jest zwykle na zapisywalnym systemie plików.
uk: Верхній каталог, зазвичай міститься у файловій системі, доступній для запису.

source: B<workdir=>I<directory>
de: B<workdir=>I<Verzeichnis>
fr: B<workdir=>I<répertoire>
pl: B<workdir=>I<katalog>
uk: B<workdir=>I<каталог>
