Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: FAT has the B<ATTR_RO> (read-only) attribute. On Windows, the B<ATTR_RO> of the directory will just be ignored, and is used only by applications as a flag (e.g. it\(cqs set for the customized folder).
de: FAT hat das Attribut B<ATTR_RO> (schreibgeschützt). Unter Windows wird das B<ATT_RO>-Attribut des Verzeichnisses einfach ignoriert und nur von Anwendungen als Markierung verwendet (z.B. wird es für den benutzerdefinierten Ordner gesetzt).
fr: FAT a l’attribut B<ATTR_RO> (lecture seule). Sous Windows, l’B<ATTR_RO> du répertoire sera simplement ignoré et il n’est utilisé que par les applications comme un attribut (par exemple, il est défini pour le répertoire personnalisé).
pl: FAT ma atrybut B<ATTR_RO> (tylko do odczytu). W systemie Windows atrybut ten w przypadku katalogu zostanie zignorowany i jest używany tylko przez aplikacje, w dodatku jako flaga (np. jest ustawiany dla folderów skonfigurowanych przez użytkownika).
uk: У FAT є атрибут B<ATTR_RO> (лише читання). У Windows B<ATTR_RO> для каталогу буде просто проігноровано. Цей атрибут використовують лише програми як прапорець (наприклад, його встановлюють для нетипово налаштованої теки).

source: If you want to use B<ATTR_RO> as read-only flag even for the directory, set this option.
de: Wenn Sie das B<ATTR_RO>-Attribut als Schreibschutzmarkierung für das Verzeichnis verwenden wollen, setzen Sie diese Option.
fr: Pour utiliser B<ATTR_RO> comme un attribut de lecture seule même pour le répertoire, activez cette option.
pl: Jeśli atrybut B<ATTR_RO> ma służyć jako flaga "tylko do odczytu" nawet dla katalogów, proszę ustawić tę opcję.
uk: Якщо вам потрібен атрибут B<ATTR_RO> як прапорець лише читання навіть для каталогів, встановіть цей параметр.

source: If set, the execute permission bits of the file will be allowed only if the extension part of the name is .EXE, .COM, or .BAT. Not set by default.
de: Falls gesetzt, sind die Ausführbarkeits-Bits der Datei nur zulässig, wenn die Dateiendung .EXE, .COM oder .BAT lautet. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, les bits de permission d'exécution du fichier seront autorisés seulement si l'extension du nom de fichier est EXE, BAT ou COM. Désactivée par défaut.
pl: Jeśli ustawiona, bit wykonywalności pliku jest dozwolony tylko, jeśli część rozszerzenia nazwy jest jedną z .EXE, .COM lub .BAT. Domyślnie nie ustawiona.
uk: Якщо встановлено, біти прав доступу на виконання файлів можна буде використовувати, лише якщо суфіксом назви файла є .EXE, .COM або .BAT. Типово, не встановлено.

source: If set, B<ATTR_SYS> attribute on FAT is handled as B<IMMUTABLE> flag on Linux. Not set by default.
de: bewirkt, dass das B<ATTR_SYS>-Attribut auf FAT-Systemen wie der Schalter B<IMMUTABLE> unter Linux behandelt wird. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, l'attribut B<FAT ATTR_SYS> est géré comme un attribut immuable sous Linux. Désactivée par défaut.
pl: Jeśli ustawiona, atrybut B<ATTR_SYS> w FAT jest obsługiwany jak flaga B<IMMUTABLE> w Linuksie. Domyślnie nie ustawiona.
uk: Якщо встановлено, атрибут B<ATTR_SYS> у FAT буде оброблено як прапорець B<IMMUTABLE> у Linux. Типово, не встановлено.

source: If set, the filesystem will try to flush to disk more early than normal. Not set by default.
de: bewirkt, dass das Dateisystem früher als normal auf die Platte zu schreiben versucht. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, le système de fichiers essayera de vider vers le disque plus tôt que la normale. Désactivée par défaut.
pl: Jeśli ustawiona, system plików będzie starał się opróżnić bufory na dysk wcześniej niż zwykle. Domyślnie nie ustawione.
uk: Якщо встановлено, файлова система намагатиметься скидати дані на диск раніше, ніж звичайно. Типово, не встановлено.

source: Use the "free clusters" value stored on B<FSINFO>. It\(cqll be used to determine number of free clusters without scanning disk. But it\(cqs not used by default, because recent Windows don\(cqt update it correctly in some case. If you are sure the "free clusters" on B<FSINFO> is correct, by this option you can avoid scanning disk.
de: verwendet den in B<FSINFO> gespeicherten »free clusters«-Wert. Damit wird die Anzahl der freien Cluster ermittelt, ohne die Platte zu durchsuchen. Aber es wird standardmäßig nicht verwendet, da aktuelle Windows-Systeme es in einigen Fällen nicht korrekt aktualisieren. Wenn Sie sicher sind, dass »free clusters« in B<FSINFO> korrekt ist, können Sie mit dieser Option vermeiden, dass die Platte durchsucht wird.
fr: Utiliser la valeur de secteurs libres (« free clusters ») disponible dans B<FSINFO>. Elle sera utilisée pour déterminer le nombre de secteurs libres sans analyser le disque. Elle n'est pas utilisée par défaut, car les versions récentes de Windows ne la mettent pas à jour correctement dans certains cas. Si vous êtes sûr que le nombre de secteurs libres sur B<FSINFO> est correct, vous pouvez éviter l'analyse du disque grâce à cette option.
pl: Używa wartości "wolnych klastrów" ("free clusters"), przechowywanej w B<FSINFO>. Jest ona używana do pozyskania liczby wolnych klastrów bez skanowania dysku. Nie jest ona jednak domyślnie używana, ponieważ ostatnie wersje Windows niekiedy nie aktualizują jej poprawnie. W przypadku przekonania, że wartość owych "wolnych klastrów" w B<FSINFO> jest poprawna, używając tej opcji można zapobiec skanowaniu dysku.
uk: Використати значення «вільні кластери», що зберігається у B<FSINFO>. Воно використовуватиметься для визначення кількості вільних кластерів без сканування диска. Але типово воно не використовується, оскільки останнім часом у деяких випадках Windows не оновлює його правильно. Якщо ви впевнені, що значення «вільні кластери» у B<FSINFO> правильне, за допомогою цього параметра можна уникнути сканування диска.

source: Various misguided attempts to force Unix or DOS conventions onto a FAT filesystem.
de: Verschiedene irrtümliche Versuche, Unix- oder DOS-Konventionen auf einem FAT-Dateisystem zu erzwingen.
fr: Diverses tentatives risquées pour forcer un comportement UNIX ou DOS dans un système de fichiers FAT.
pl: Różne bezmyślne próby wymuszenia konwencji Uniksa lub DOS-u na systemie plików FAT.
uk: Різні помилкові спроби нав'язати домовленості Unix або DOS до файлової системи FAT.

source: Mount options for hfs
de: Einhängeoptionen für HFS
fr: Options de montage pour hfs
pl: Opcje montowania do hpfs
uk: Параметри монтування hfs

source: Set the creator/type values as shown by the MacOS finder used for creating new files. Default values: \(aq????\(aq.
de: setzt die Werte für Ersteller und Typ für die Anzeige im Finder von MacOS zum Anlegen neuer Dateien. Standardwerte: »????«.
fr: Positionner les valeurs « creator » et « type » telles que les montre le « Finder MacOS » lors de la création de nouveaux fichiers. Valeurs par défaut « ???? ».
pl: Ustawia wartości creator/type pokazywane przez MacOS-owy Finder, używane do tworzenia nowych plików. Domyślne wartości: "????".
uk: Встановити значення creator/type, як показано у пошуку MacOS, що використовуються для створення нових файлів. Типові значення: \(aq????\(aq.

source: Set the umask used for all directories, all regular files, or all files and directories. Defaults to the umask of the current process.
de: setzt die Umask für alle Verzeichnisse, alle regulären Dateien oder alle Dateien und Verzeichnisse. Standardmäßig die Umask des aktuellen Prozesses.
fr: Établir l'umask utilisé pour tous les répertoires, tous les fichiers normaux ou tous les fichiers et répertoires. La valeur par défaut est l'umask du processus actuel.
pl: Ustawia umask, używany do wszystkich katalogów, wszystkich zwykłych plików lub wszystkich plików i katalogów. Domyślnie jest to umask bieżącego procesu).
uk: Встановити umask для всіх каталогів, усіх звичайних файлів або всіх файлів і каталогів. Типово, використовується umask поточного процесу.

source: Select the CDROM session to mount. Defaults to leaving that decision to the CDROM driver. This option will fail with anything but a CDROM as underlying device.
de: wählt die einzuhängende Sitzung der CD-ROM. Standardmäßig wird die Auswahl dem CD-ROM-Treiber überlassen. Diese Option wird fehlschlagen, wenn das zugrundeliegende Gerät keine CD-ROM ist.
fr: Choisir la session de CD-ROM à monter. La valeur par défaut est de laisser cette décision au lecteur de CD-ROM. Cette option ne fonctionne que pour les CD-ROM.
pl: Ustawia sesję CD-ROM-u do zamontowania. Domyślnie, decyzja jest pozostawiana sterownikowi CD-ROM-u. Opcja nie powiedzie się, jeśli urządzeniem będzie coś innego niż CD-ROM.
uk: Вибрати сеанс CDROM для монтування. Типово, це рішення покладається за драйвер CDROM. Цей параметр не спрацює з будь-яким іншим базовим пристроєм, крім CDROM.

source: Select partition number n from the device. Only makes sense for CDROMs. Defaults to not parsing the partition table at all.
de: wählt die Partitionsnummer n auf dem Gerät aus. Dies ergibt nur für CDROMs Sinn. Standardmäßig wird die Partitionstabelle überhaupt nicht ausgewertet.
fr: Choisir la partition numéro B<n> du périphérique. Cela n'a de sens que pour les CD-ROM. Le comportement par défaut est de ne pas analyser la table de partitions.
pl: Wybiera numer partycji n z urządzenia. Ma sens tylko w przypadku CD-ROM-ów. Domyślnie, tablica partycji nie jest w ogóle przetwarzana.
uk: Вибрати номер розділу n на пристрої. Має сенс лише для CDROM. Типово таблиця розділів взагалі не аналізується.

source: Don\(cqt complain about invalid mount options.
de: beschwert sich nicht über unzulässige Einhängeoptionen.
fr: Ne pas se plaindre dans le cas d'options de montage non valables.
pl: Nie informuje o nieprawidłowych opcjach montowania.
uk: Не скаржитися на некоректні параметри монтування.

source: Mount options for hpfs
de: Einhängeoptionen für Hpfs
fr: Options de montage pour hpfs
pl: Opcje montowania do hpfs
uk: Параметри монтування hpfs

source: Convert all files names to lower case, or leave them. (Default: B<case=lower>.)
de: wandelt alle Dateinamen in Kleinbuchstaben um oder lässt sie unverändert (Voreinstellung B<case=lower>).
fr: Convertir les noms de fichiers en minuscules (B<lower>) ou les laisser tels quels (B<asis>). Par défaut : B<case=lower>.
pl: Konwertuje wszystkie nazwy plików na małe litery lub pozostawia bez zmian (domyślnie: B<case=lower>).
uk: Перетворити всі назви файлів у нижній регістр або залишити їх. (Типово: B<case=lower>.)

source: This option is obsolete and may fail or being ignored.
de: Diese Option ist veraltet und könnte fehlschlagen oder ignoriert werden.
fr: Cette option est obsolète et peut échouer ou être ignorée.
pl: Przestarzała opcja, może zwrócić błąd lub zostać zignorowana.
uk: Цей параметр застарілий може призвести до помилки, або буде знехтуваний.

source: Do not abort mounting when certain consistency checks fail.
de: bricht die Einhängung nicht ab, wenn bestimmte Konsistenzprüfungen fehlschlagen.
fr: Ne pas interrompre le montage si un test de cohérence échoue.
pl: Nie przerywa montowania gdy zawiodą pewne kontrole spójności.
uk: Не переривати монтування, якщо не вдасться пройти певні перевірки узгодженості.

source: Mount options for iso9660
de: Einhängeoptionen für ISO9660
fr: Options de montage pour ISO 9660
pl: Opcje montowania do iso9660
uk: Параметри монтування iso9660

source: ISO 9660 is a standard describing a filesystem structure to be used on CD-ROMs. (This filesystem type is also seen on some DVDs. See also the I<udf> filesystem.)
de: ISO 9660 ist eine Norm, die eine Dateisystemstruktur beschreibt, die auf CD-ROMs verwendet wird (dieser Dateisystemtyp findet sich auch auf einigen DVDs, siehe auch das Dateisystem I<udf>).
fr: ISO 9660 est une norme décrivant la structure du système de fichiers pour les CD-ROM (ce type de système de fichiers apparaît aussi sur certains DVD ; consultez également le système de fichiers I<udf>).
pl: ISO 9660 jest standardem opisującym strukturę systemu plików na CD-ROM-ach (system ten jest również wykorzystywany na niektórych płytach DVD; patrz również system plików I<udf>).
uk: ISO 9660 — це стандарт, що описує структуру файлової системи, яка буде використовуватися на компакт-дисках. (Цей тип файлової системи також можна побачити на деяких DVD-дисках. Див. також файлову систему I<udf>.)

source: Normal I<iso9660> filenames appear in an 8.3 format (i.e., DOS-like restrictions on filename length), and in addition all characters are in upper case. Also there is no field for file ownership, protection, number of links, provision for block/character devices, etc.
de: Normale I<iso9660>-Dateinamen erscheinen im Format 8.3 (d.h. DOS-typische Einschränkungen bei der Länge der Dateinamen) und zusätzlich sind alle Zeichen groß geschrieben. Außerdem gibt es kein Feld für Dateieigentümer, Schutz, Anzahl der Links, Vorkehrung für blockorientierte/zeichenorientierte Geräte usw.
fr: Les noms de fichiers I<iso9660> normaux se présentent au format I<8.3> (limite de longueur des noms comme sous DOS). Tous les caractères sont en majuscules. De plus, rien n'est prévu pour stocker le propriétaire du fichier, le mode d'accès, le nombre de liens, les périphériques bloc ou caractère, etc.
pl: Normalne nazwy plików I<iso9660> pojawiają się w formacie 8.3 (tzn. występują DOS-owe ograniczenia długości nazw plików), a w dodatku wszystkie znaki pisane są wielkimi literami. Poza tym nie ma pola właściciela, ochrony, liczby dowiązań, zastrzeżeń dla urządzeń znakowych/blokowych, itd.
uk: Звичайні назви файлів I<iso9660> мають формат 8.3 (тобто обмеження довжини назви файлу нагадують DOS), і, крім того, всі символи пишуться у верхньому регістрі. Також немає полів для власника файлу, захисту, кількості посилань, надання блокових/символьних пристроїв тощо.

source: Rock Ridge is an extension to iso9660 that provides all of these UNIX-like features. Basically there are extensions to each directory record that supply all of the additional information, and when Rock Ridge is in use, the filesystem is indistinguishable from a normal UNIX filesystem (except that it is read-only, of course).
de: Rock Ridge ist eine Erweiterung für iso9660, die alle diese UNIX-typischen Funktionsmerkmale bereitstellt. Im Wesentlichen gibt es Erweiterungen für jeden Verzeichniseintrag, die alle zusätzlichen Informationen bereitstellen. Wenn Rock Ridge verwendet wird, ist das Dateisystem nicht mehr von einem normalen UNIX-Dateisystem zu unterscheiden (außer natürlich, dass es schreibgeschützt ist).
fr: Rock Ridge est une extension du format ISO 9660 qui permet d'offrir ces fonctionnalités UNIX. En gros, des données sont ajoutées pour chaque entrée de chaque répertoire afin de fournir les informations désirées. Lorsque Rock Ridge est utilisée, le système de fichiers est complètement semblable à un système de fichiers UNIX normal (sauf qu'il est en lecture seule évidemment).
pl: Rozszerzeniem iso9660 jest Rock Ridge, który udostępnia wszystkie te uniksopodobne właściwości. Najprościej mówiąc, dla każdego wpisu katalogowego istnieją w nim rozszerzenia, które uzupełniają wszystkie informacje. Gdy używane jest Rock Ridge, system plików jest nieodróżnialny od normalnego uniksowego systemu plików (poza tym, że jest tylko do odczytu, oczywiście).
uk: Rock Ridge — це розширення для iso9660, яке надає всі ці функції, подібні до UNIX. Загалом, для кожного запису каталогу є розширення, які надають всю додаткову інформацію, і за використання Rock Ridge файлова система не відрізняється від звичайної файлової системи UNIX (звичайно, за винятком того, що вона доступна лише для читання).

source: Disable the use of Rock Ridge extensions, even if available. Cf. B<map>.
de: deaktiviert die Verwendung der Rock-Ridge-Erweiterungen, selbst wenn diese verfügbar sind. Siehe B<map>.
fr: Ne pas utiliser les extensions Rock Ridge, même si elles sont disponibles. Consultez B<map>.
pl: Wyłącza korzystanie z rozszerzeń Rock Ridge, nawet jeśli są dostępne. Zob. B<map>.
uk: Вимкнути використання розширення Rock Ridge, навіть якщо воно є доступним. Порівняйте з B<map>.

source: Disable the use of Microsoft Joliet extensions, even if available. Cf. B<map>.
de: deaktiviert die Verwendung der Microsoft-Joliet-Erweiterungen, selbst wenn diese verfügbar sind. Siehe B<map>.
fr: Désactiver les extensions Microsoft Joliet, même si elles sont disponibles. Consultez B<map>.
pl: Wyłącza korzystanie z rozszerzeń Joliet firmy Microsoft, nawet jeśli są dostępne. Zob. B<map>.
uk: Вимкнути використання розширення Microsoft Joliet, навіть якщо воно є доступним. Порівняйте з B<map>.

source: With B<check=relaxed>, a filename is first converted to lower case before doing the lookup. This is probably only meaningful together with B<norock> and B<map=normal>. (Default: B<check=strict>.)
de: Mit B<check=relaxed> wird ein Dateiname zuerst in Kleinschreibung umgewandelt, bevor das Nachschlagen erfolgt. Dies ist wahrscheinlich nur zusammen mit B<norock> und B<map=normal> sinnvoll (Standard: B<check=strict>).
fr: Avec B<check=relaxed>, les noms de fichier sont convertis en minuscules avant de lancer la recherche. Cela n'a probablement d'intérêt qu'avec les options B<norock> et B<map=normal>. (Par défaut : B<check=strict>.)
pl: Z B<check=relaxed>, nazwa pliku przed dokonywaniem podglądu jest najpierw przekształcana na małe litery. Prawdopodobnie ma to znaczenie tylko razem z B<norock> i B<map=normal>. (Domyślnie: B<check=strict>.)
uk: За допомогою B<check=relaxed> перед початком пошуку назва файлу перетворюється в нижній регістр. Це, ймовірно, має значення лише разом із B<norock> і B<map=normal>. (Типово: B<check=strict>.)

source: Give all files in the filesystem the indicated user or group id, possibly overriding the information found in the Rock Ridge extensions. (Default: B<uid=0,gid=0>.)
de: gibt allen Dateien im Dateisystem die angegebene Benutzer- oder Gruppenkennung, wobei unter Umständen die in den Rock-Ridge-Erweiterungen gefundene Information außer Kraft gesetzt wird (Standard: B<uid=0,gid=0>).
fr: Définir le propriétaire et le groupe de tous les fichiers en écrasant éventuellement les informations trouvées dans les extensions Rock Ridge (par défaut : B<uid=0,gid=0>).
pl: Nadaje wszystkim plikom systemu plików wskazany identyfikator użytkownika i grupy, być może przesłaniając informacje znalezione w rozszerzeniach Rock Ridge. (Domyślnie: B<uid=0,gid=0>.)
uk: Надати всім файлам у файловій системі вказаний ідентифікатор користувача або групи, можливо, замінивши інформацію, знайдену в розширеннях Rock Ridge. (Типово: B<uid=0,gid=0>.)

source: For non-Rock Ridge volumes, normal name translation maps upper to lower case ASCII, drops a trailing \(aq;1\(aq, and converts \(aq;\(aq to \(aq.\(aq. With B<map=off> no name translation is done. See B<norock>. (Default: B<map=normal>.) B<map=acorn> is like B<map=normal> but also apply Acorn extensions if present.
de: Bei Datenträgern ohne Rock-Ridge-Erweiterungen wandelt die normale Namensübersetzung Kleinschreibung in ASCII-Großschreibung um, entfernt ein angehängtes »;1« und wandelt »;« in ».« um. Mit B<map=off> wird keine Namensübersetzung ausgeführt. Siehe B<norock> (Standard: B<map=normal>). B<map=acorn> verhält sich wie B<map=normal>, wobei zusätzlich auch Acorn-Erweiterungen angewendet werden, sofern vorhanden.
fr: Pour les volumes sans extension Rock Ridge, la conversion des noms de fichiers change les majuscules en minuscules, supprime l'éventuel « ;1 » final, et transforme « ; » en « . ». Avec B<map=off> il n'y a pas de conversion. Consultez B<norock> (B<map=normal> par défaut). B<map=acorn> est comme B<map=normal>, mais applique aussi les extensions Acorn si elles sont présentes.
pl: Dla wolumenów typu innego niż Rock Ridge, normalna translacja nazwy odwzorowuje wielkie litery ASCII na małe, porzuca kończące `;1' i zamienia `;' na `.'. Z B<map=off> nie jest dokonywana konwersja nazw. Zobacz B<norock>. (Domyślnie: B<map=normal>.) B<map=acorn> jest podobne do B<map=normal>, ale stosuje także rozszerzenia Acorn, jeśli występują.
uk: Для томів, які не належать до Rock Ridge, звичайне перетворення назв відображає ASCII з верхнього в нижній регістр, відкидає кінцевий \(aq;1\(aq і перетворює \(aq;\(aq в \(aq.\(aq. Якщо B<) map=off>, то назва не перетворюється. Див. B<norock>. (Типово: B<map=normal>.) B<map=acorn> схоже на B<map=normal>, але також застосовує, за наявності, розширення Acorn.

source: For non-Rock Ridge volumes, give all files the indicated mode. (Default: read and execute permission for everybody.) Octal mode values require a leading 0.
de: Bei Datenträgern ohne Rock-Ridge-Erweiterungen erhalten alle Dateien den angegebenen Modus (Standard: Lese- und Ausführungsrechte für alle). Bei Angabe des Wertes in oktaler Notation ist eine vorangestellte 0 erforderlich.
fr: Pour les volumes non Rock Ridge, donner le mode indiqué à tous les fichiers (par défaut : lecture et exécution autorisées pour tous). Les valeurs de mode octal nécessitent B<0> en tête).
pl: Dla wolumenów typu innego niż Rock Ridge, nadaje wszystkim plikom wskazane prawa. (Domyślnie: prawa do odczytu i wykonania dla wszystkich.) Wartości w trybie ósemkowym wymagają 0 na początku.
uk: Для томів, які не належать до Rock Ridge, надайте всім файлам зазначений режим. (Типово: дозвіл на читання та виконання для всіх.) Для вісімкових значень режиму потрібен початковий 0.

source: Also show hidden and associated files. (If the ordinary files and the associated or hidden files have the same filenames, this may make the ordinary files inaccessible.)
de: zeigt auch verborgene und zugehörige Dateien an (wenn die normalen und die zugehörigen oder verborgenen Dateien gleiche Namen haben, wird der Zugriff auf die normalen Dateien dadurch verhindert).
fr: Montrer également les fichiers cachés et les fichiers d'extensions (si les fichiers ordinaires et les fichiers d'extensions ou cachés ont les mêmes noms, cela peut rendre inaccessibles les fichiers ordinaires).
pl: Pokazuje również pliki ukryte i powiązane (jeśli zwykłe pliki i pliki powiązane lub ukryte mają te same nazwy plików, może to uczynić zwykłe pliki niedostępnymi).
uk: Також показувати приховані та пов'язані файли. (Якщо звичайні файли та пов'язані чи приховані файли мають однакові назви, це може зробити звичайні файли недоступними.)

source: Set the block size to the indicated value. (Default: B<block=1024>.)
de: setzt die Blockgröße auf den angegebenen Wert (standardmäßig B<block=1024>).
fr: Définir la taille de bloc (B<block=1024> par défaut).
pl: Ustawia rozmiar bloku we wskazanym wolumenie. (Domyślnie: B<block=1024>.)
uk: Встановити вказане значення розміру блока. (Типово: B<block=1024>.)

source: If the high byte of the file length contains other garbage, set this mount option to ignore the high order bits of the file length. This implies that a file cannot be larger than 16 MB.
de: ignoriert die Bits hoher Ordnung der Dateilänge, falls das hohe Byte der Dateilänge weiteren Müll enthält. Dies impliziert, dass eine Datei nicht größer als 16 MB sein darf.
fr: Si l'octet de poids fort de la taille d'un fichier contient n'importe quoi, utilisez cette option de montage pour ignorer les octets de poids fort de taille de fichier. Cela force la longueur maximale d'un fichier à 16 Mo.
pl: Jeśli starszy bajt długości pliku zawiera inne śmieci, warto ustawić tę opcję montowania, aby był ignorowany. Powoduje to, że maksymalny rozmiar pliku nie może być większy niż 16 MB.
uk: Якщо старший байт довжини файлу містить сміття, встановіть цей параметр монтування, щоб нехтувати старші біти довжини файлу. Це означає, що розмір файлу не може перевищувати 16 МБ.
