Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: (Default: 2.) Number of unused blocks at the start of the device.
de: bezeichnet die Anzahl der ungenutzten Blöcke am Anfang des Gerätes (Standard: 2).
fr: Nombre de blocs inutilisés au début du périphérique (2 par défaut).
pl: (Domyślnie: 2.) Liczba nieużytkowanych bloków na początku urządzenia.
uk: (Типове значення: 2.) Кількість невикористаних блоків на початку пристрою.

source: B<root=>I<value>
de: B<root=>I<Wert>
fr: B<root=>I<valeur>
pl: B<root=>I<wartość>
uk: B<root=>I<значення>

source: Give explicitly the location of the root block.
de: gibt explizit den Ort des Wurzel-Blocks an.
fr: Fournir explicitement l'emplacement du bloc racine.
pl: Podaje jawnie lokalizację bloku korzenia (root block).
uk: Задати явним чином розташування кореневого блоку.

source: B<bs=>I<value>
de: B<bs=>I<Wert>
fr: B<bs=>I<valeur>
pl: B<bs=>I<wartość>
uk: B<bs=>I<значення>

source: Give blocksize. Allowed values are 512, 1024, 2048, 4096.
de: gibt die Blockgröße an. Zulässige Werte sind 512, 1024, 2048 und 4096.
fr: Fournir la taille de bloc. Les valeurs autorisées sont 512, 1024, 2048 et 4096.
pl: Podaje rozmiar bloku. Dozwolone wartości to 512, 1024, 2048, 4096.
uk: Задати розмір блоку. Дозволені значення: 512, 1024, 2048, 4096.

source: These options are accepted but ignored. (However, quota utilities may react to such strings in I</etc/fstab>.)
de: Diese Optionen werden zwar akzeptiert, aber ignoriert (dennoch können Dienstprogramme, die Speicherplatzkontingente bearbeiten, solche Zeichenketten in I</etc/fstab> auswerten).
fr: Ces options sont acceptées mais sans effet (les utilitaires de quota peuvent toutefois réagir à de telles chaînes dans I</etc/fstab>).
pl: Opcje te są przyjmowane, lecz są ignorowane (jednakże narzędzia limitów dyskowych (quota) mogą reagować na takie łańcuchy w I</etc/fstab>).
uk: Ці параметри буде прийнято, але буде проігноровано. (Втім, інструменти обробки квот можуть реагувати на такі рядки у I</etc/fstab>.)

source: Mount options for debugfs
de: Einhängeoptionen für Debugfs
fr: Options de montage pour debugfs
pl: Opcje montowania do debugfs
uk: Параметри монтування debugfs

source: The debugfs filesystem is a pseudo filesystem, traditionally mounted on I</sys/kernel/debug>. As of kernel version 3.4, debugfs has the following options:
de: Das Debugfs-Dateisystem ist ein Pseudo-Dateisystem, das traditionell in I</sys/kernel/debug> eingehängt wird. Ab der Kernelversion 3.4 hat Debugfs folgende Optionen:
fr: Le système de fichiers debugfs est un pseudosystème de fichiers, traditionnellement monté sous I</sys/kernel/debug>. Avec la version 3.4 du noyau, debugfs a les options de montage suivantes.
pl: System plików debugfs jest pseudosystemem, montowanym tradycyjnie w I</sys/kernel/debug>. Z jądrem w wersji 3.4 debugfs ma następujące opcje:
uk: Файлова система debugfs є фіктивною файловою системою, яку традиційно монтують до I</sys/kernel/debug>. На момент виходу ядра версії 3.4 debugfs використовує такі параметри:

source: Set the owner and group of the mountpoint.
de: legt den Eigentümer und die Gruppe des Einhängepunkts fest.
fr: Définir le propriétaire et le groupe du point de montage.
pl: Ustawia właściciela i grupę wszystkich punktów montowania.
uk: Встановити власника і групу точки монтування.

source: Sets the mode of the mountpoint.
de: legt den Modus des Einhängepunkts fest.
fr: Définir le mode du point de montage.
pl: Ustawia tryb punktu montowania.
uk: Встановити режим доступу до точки монтування.

source: Mount options for devpts
de: Einhängeoptionen für Devpts
fr: Options de montage pour devpts
pl: Opcje montowania do devpts
uk: Параметри монтування devpts

source: The devpts filesystem is a pseudo filesystem, traditionally mounted on I</dev/pts>. In order to acquire a pseudo terminal, a process opens I</dev/ptmx>; the number of the pseudo terminal is then made available to the process and the pseudo terminal slave can be accessed as I</dev/pts/>E<lt>numberE<gt>.
de: Das Devpts-Dateisystem ist ein Pseudo-Dateisystem, das traditionell in I</sys/dev/pts> eingehängt wird. Um an ein Pseudo-Terminal zu gelangen, öffnet ein Prozess I</dev/ptmx>; die Nummer des Pseudo-Terminals steht dann dem Prozess zur Verfügung und auf den Pseudo-Terminal-Slave kann über I</dev/pts/>E<lt>NummerE<gt> zugegriffen werden.
fr: Le système de fichiers devpts est un pseudosystème de fichiers, traditionnellement monté sous I</dev/pts>. Pour acquérir un pseudoterminal, un processus ouvre I</dev/ptmx> ; le numéro du pseudoterminal est rendu disponible au processus, et le pseudoterminal esclave est accessible en tant que I</dev/pts/>E<lt>numéroE<gt>.
pl: devpts jest pseudosystemem plików, tradycyjnie montowanym w I</dev/pts>. W celu uzyskania pseudoterminala, proces otwiera I</dev/ptmx>. Jest mu wówczas udostępniany numer pseudoterminala; podporządkowany pseudoterminal jest dostępny jako I</dev/pts/>E<lt>numerE<gt>.
uk: Файлова система devpts є фіктивною файловою системою, яку традиційно буде змонтовано до I</dev/pts>. Для отримання псевдотермінала процес відкриває I</dev/ptmx>; після цього номер псевдотермінала стане доступним процесу. Доступ до підлеглого засобу псевдотермінала можна здійснювати за адресою I</dev/pts/>E<lt>номерE<gt>.

source: This sets the owner or the group of newly created pseudo terminals to the specified values. When nothing is specified, they will be set to the UID and GID of the creating process. For example, if there is a tty group with GID 5, then B<gid=5> will cause newly created pseudo terminals to belong to the tty group.
de: setzt den Eigentümer oder die Gruppe neu erstellter Pseudo-Terminals auf die angegebenen Werte. Wenn nichts angegeben ist, werden die Werte auf die UID und GID des erstellenden Prozesses gesetzt. Wenn es beispielsweise eine TTY-Gruppe mit der GID 5 gibt, dann sorgt B<gid=5> dafür, dass neu erstellte Pseudo-Terminals zu der TTY-Gruppe gehören.
fr: Définir le propriétaire et le groupe des pseudoterminaux nouvellement créés. Lorsque rien n'est indiqué, ils seront fixés avec l'UID et le GID du processus créateur. Par exemple, si un groupe tty de GID 5 est présent, alors B<gid=5> fera appartenir les pseudoterminaux nouvellement créés au groupe tty.
pl: Ustawia właściciela lub grupę nowotworzonych PTY według zadanych wartości. Jeśli nie podano żadnych, to zostaną nadane UID i GID procesu tworzącego. Na przykład, jeśli mamy grupę tty o GID=5, to B<gid=5> spowoduje, że nowo tworzone PTY będą należeć do grupy tty.
uk: Встановлює власника або групу створених псевдотерміналів у вказані значення. Якщо значень не вказано, для власника і групи буде використано значення UID і GID процесу, який створив псевдотермінал. Наприклад, якщо є група tty з GID 5, B<gid=5> призведе до того, що створені псевдотермінали належатимуть цій групі tty.

source: Set the mode of newly created pseudo terminals to the specified value. The default is 0600. A value of B<mode=620> and B<gid=5> makes "mesg y" the default on newly created pseudo terminals.
de: setzt den Modus neu erstellter Pseudo-Terminals auf den angegebenen Wert. Die Vorgabe ist 0600. Ein Wert von B<mode=620> und B<gid=5> macht »mesg y« zur Vorgabe auf neu erstellten Pseudo-Terminals.
fr: Définir le mode des pseudoterminaux nouvellement créés. La valeur par défaut est 0600. Une valeur B<mode=620> et B<gid=5> correspond à un « mesg y » pour tous les pseudoterminaux nouvellement créés.
pl: Nadaje trybowi nowo tworzonych PTY zadaną wartość. Domyślnie jest to 0600. Wartość B<mode=620> i B<gid=5> powoduje, że dla nowo utworzonych PTY będzie domyślnie "mesg y".
uk: Встановити для режиму доступу до створених псевдотерміналів вказане значення. Типовим є значення 0600. Значення B<mode=620> і B<gid=5> зробить «mesg y» типовим для нових псевдотерміналів.

source: Create a private instance of the devpts filesystem, such that indices of pseudo terminals allocated in this new instance are independent of indices created in other instances of devpts.
de: erzeugt eine private Instanz des Devpts-Dateisystems, so dass Indizes der in dieser neuen Instanz zugewiesenen Pseudo-Terminals von den in anderen Instanzen von Devpts erzeugten Indizes unabhängig sind.
fr: Créer une instance privée du système de fichiers devpts, les index des pseudoterminaux alloués dans cette nouvelle instance seront indépendants des index créés dans les autres instances devpts.
pl: Tworzy prywatną instancję systemu plików devpts tak, że wskaźniki pty zaalokowane w tej nowej kopii są niezależne od wskaźników utworzonych w innych instancjach devpts.
uk: Створити конфіденційний екземпляр файлової системи devpts, такий, що індекси псевдотерміналів, які буде отримано у цьому новому екземплярі, будуть незалежними від індексів, які створено в інших екземплярах devpts.

source: All mounts of devpts without this B<newinstance> option share the same set of pseudo terminal indices (i.e., legacy mode). Each mount of devpts with the B<newinstance> option has a private set of pseudo terminal indices.
de: Allen Devpts-Einhängungen ohne diese B<newinstance>-Option sind die gleichen Pseudo-Terminal-Indizes gemein (d.h. alter Modus). Jede Einhängung von Devpts mit der Option B<newinstance> hat eine private Gruppe von Pseudo-Terminal-Indizes.
fr: Tous les montages de devpts sans l'option B<newinstance> partagent le même ensemble d'index de pseudoterminaux (mode legacy). Chaque montage de devpts avec l'option B<newinstance> utilise un ensemble privé d'index de pseudoterminaux.
pl: Wszystkie montowania devpts bez opcji B<newinstance> współdzielą ten sam zestaw wskaźników pty (np. tryb legacy). Każde zamontowanie devpts z opcją B<newinstance> tworzy prywatny zestaw wskaźników pty.
uk: Усі монтування devpts без цього параметра B<newinstance> матимуть спільний набір індексів псевдотерміналів (тобто працюватимуть у застарілому режимі). Кожне монтування devpts з параметром B<newinstance> матиме власний набір індексів псевдотерміналів.

source: This option is mainly used to support containers in the Linux kernel. It is implemented in Linux kernel versions starting with 2.6.29. Further, this mount option is valid only if B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> is enabled in the kernel configuration.
de: Diese Option wird hauptsächlich zur Unterstützung von Containern im Linux-Kernel genutzt. Sie ist in Kernelversionen ab 2.6.29 implementiert. Weiterhin ist diese Einhängeoption nur dann zulässig, wenn B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> in der Kernel-Konfiguration aktiviert ist.
fr: Cette option est principalement utilisée pour gérer les conteneurs dans le noyau Linux. Elle est implémentée dans le noyau Linux depuis la version 2.6.29. De plus, cette option de montage n'est valable que si l'option B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> est activée dans la configuration du noyau.
pl: Opcja jest używana głównie do obsługi kontenerów, w jądrze Linux, od wersji 2.6.29. Co więcej, ta opcja jest poprawna jedynie, jeśli w konfiguracji jądra włączono B<CONFIG_DEVPTS_MULTIPLE_INSTANCES>.
uk: Цей параметр, в основному, призначено для забезпечення підтримки контейнерів у ядрі Linux. Його реалізовано у ядрах Linux, починаючи з версії 2.6.29. Крім того, цей параметр монтування є чинним, лише якщо у налаштуваннях ядра увімкнено B<CONFIG_DEVPTS_MULTIPLE_INSTANCES>.

source: To use this option effectively, I</dev/ptmx> must be a symbolic link to I<pts/ptmx>. See I<Documentation/filesystems/devpts.txt> in the Linux kernel source tree for details.
de: Um diese Option effektiv zu nutzen, muss I</dev/ptmx> ein symbolischer Link auf I<pts/ptmx> sein. Siehe I<Documentation/filesystems/devpts.txt> im Kernel-Quellbaum für Details.
fr: Pour utiliser cette option efficacement, I</dev/ptmx> doit être un lien symbolique vers I<pts/ptmx>. Consultez I<Documentation/filesystems/devpts.txt> dans les sources du noyau Linux pour plus de précisions.
pl: Aby użyć tej opcji w sposób efektywny, I</dev/ptmx> musi być dowiązaniem symbolicznym do I<pts/ptmx>. Proszę zapoznać się z plikiem I<Documentation/filesystems/devpts.txt> w kodzie źródłowym jądra Linux, aby dowiedzieć się więcej.
uk: Щоб ефективно скористатися цим параметром, I</dev/ptmx> має бути символічним посиланням на I<pts/ptmx>. Див. I<Documentation/filesystems/devpts.txt> у ієрархії початкового коду ядра Linux, щоб дізнатися більше.

source: B<ptmxmode=>I<value>
de: B<ptmxmode=>I<Wert>
fr: B<ptmxmode=>I<valeur>
pl: B<ptmxmode=>I<wartość>
uk: B<ptmxmode=>I<значення>

source: Set the mode for the new I<ptmx> device node in the devpts filesystem.
de: legt den Modus für den neuen I<ptmx>-Geräteknoten im Devpts-Dateisystem fest.
fr: Définir le mode du nouveau nœud de périphérique I<ptmx> dans le système de fichiers devpts.
pl: Ustawia tryb nowego węzła urządzenia I<ptmx> w systemie plików devpts.
uk: Встановити режим доступу для нових вузлів пристроїв I<ptmx> у файловій системі devpts.

source: With the support for multiple instances of devpts (see B<newinstance> option above), each instance has a private I<ptmx> node in the root of the devpts filesystem (typically I</dev/pts/ptmx>).
de: Mit der Unterstützung für mehrere Instanzen von Devpts (siehe die Option B<newinstance> oben) hat jede Instanz einen privaten I<ptmx>-Knoten in der Wurzel des Devpts-Dateisystems (typischerweise I</dev/pts/ptmx>).
fr: Avec la gestion des instances multiples de devpts (consultez l'option B<newinstance> ci-dessus), chaque instance possède un nœud privé I<ptmx> dans la racine du système de fichiers (typiquement I</dev/pts/ptmx>).
pl: Z obsługą wielu instancji devpts (patrz powyżej: opcja B<newinstance>), każda kopia posiada prywatny węzeł I<ptmx> w katalogu głównym systemu plików devpts (z reguły I<dev/pts/ptmx>).
uk: Якщо реалізовано підтримку декількох екземплярів devpts (див. параметр B<newinstance> вище), кожен екземпляр має конфіденційний вузол I<ptmx> у корені файлової системи devpts (типово, I</dev/pts/ptmx>).

source: For compatibility with older versions of the kernel, the default mode of the new I<ptmx> node is 0000. B<ptmxmode=>I<value> specifies a more useful mode for the I<ptmx> node and is highly recommended when the B<newinstance> option is specified.
de: Für die Kompatibilität zu älteren Kernelversionen ist 0000 der Standardmodus des neuen I<ptmx>-Knotens. B<ptmxmode=>I<Wert> gibt einen sinnvolleren Modus für den I<ptmx>-Knoten an und wird ausdrücklich empfohlen, wenn die Option B<newinstance> angegeben wird.
fr: Pour être compatible avec les anciennes versions du noyau, le mode par défaut des nouveaux nœuds I<ptmx> est 0000. B<ptmxmode=>I<valeur> indique un mode plus pratique pour le nœud I<ptmx> et est recommandé lorsque l'option B<newinstance> est indiquée.
pl: W celu uzyskania kompatybilności ze starszymi wersjami jądra, domyślnym trybem nowego węzła I<ptmx> jest 0000. B<ptmxmode=>I<wartość> określa bardziej przydatny tryb dla nowego węzła I<ptmx> i jest wysoce zalecany, gdy podana jest opcja B<newinstance>.
uk: Для сумісності із застарілими версіями ядра системи типовим режимом доступу до нового вузла I<ptmx> є 0000. B<ptmxmode=>I<значення> визначає корисніший режим доступу до вузла I<ptmx>. Наполегливо рекомендуємо, якщо вказано параметр B<newinstance>.

source: This option is only implemented in Linux kernel versions starting with 2.6.29. Further, this option is valid only if B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> is enabled in the kernel configuration.
de: Diese Option ist im Linux-Kernel erst ab Version ab 2.6.29 implementiert. Außerdem ist sie nur gültig, wenn B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> in der Kernel-Konfiguration aktiviert ist.
fr: Cette option est implémentée dans le noyau Linux depuis la version 2.6.29. De plus, cette option n'est valable que si l'option B<CONFIG_DEVPTS_MULTIPLE_INSTANCES> est activée dans la configuration du noyau.
pl: Opcja została zaimplementowana jedynie w wersjach jądra Linux poczynając od 2.6.29. Co więcej, opcja ta jest poprawna jedynie, jeśli w konfiguracji jądra włączono B<CONFIG_DEVPTS_MULTIPLE_INSTANCES>.
uk: Цей параметр реалізовано лише у ядрах Linux, починаючи з версії 2.6.29. Крім того, цей параметр є чинним, лише якщо у налаштуваннях ядра увімкнено B<CONFIG_DEVPTS_MULTIPLE_INSTANCES>.

source: Mount options for fat
de: Einhängeoptionen für FAT
fr: Options de montage pour fat
pl: Opcje montowania do fat
uk: Параметри монтування fat

source: (Note: I<fat> is not a separate filesystem, but a common part of the I<msdos>, I<umsdos> and I<vfat> filesystems.)
de: (Hinweis: I<fat> ist kein separates Dateisystem, sondern ein gemeinsamer Teil der Dateisysteme I<msdos>, I<umsdos> und I<vfat>.)
fr: (Note : I<fat> n'est pas un système de fichiers séparé mais une portion commune des systèmes de fichiers I<msdos>, I<umsdos> et I<vfat>).
pl: (Uwaga: I<fat> nie jest odrębnym rodzajem systemu plików, ale wspólną częścią systemów plików I<msdos>, I<umsdos> i I<vfat>.)
uk: (Зауваження: I<fat> не є окремою файловою системою, а лише частиною файлових систем I<msdos>, I<umsdos> і I<vfat>.)

source: Set blocksize (default 512). This option is obsolete.
de: legt die Blockgröße fest (standardmäßig 512). Diese Option ist veraltet.
fr: Définir la taille des blocs (par défaut 512). Cette option est obsolète.
pl: Ustawia rozmiar bloku (domyślnie 512). Opcja jest przestarzała.
uk: Встановити розмір блоку (типове значення — 512). Цей параметр є застарілим.

source: Set the owner and group of all files. (Default: the UID and GID of the current process.)
de: legt den Eigentümer und die Gruppe aller Dateien fest (standardmäßig die UID und GID des aktuellen Prozesses).
fr: Définir le propriétaire et le groupe de tous les fichiers (les valeurs par défaut sont l'UID et le GID du processus actuel).
pl: Ustawia właściciela i grupę wszystkich plików (domyślnie: UID i GID bieżącego procesu).
uk: Встановити власника і групу усіх файлів. (Типове значення: UID і GID поточного процесу.)

source: B<umask=>I<value>
de: B<umask=>I<Wert>
fr: B<umask=>I<valeur>
pl: B<umask=>I<wartość>
uk: B<umask=>I<значення>

source: Set the umask (the bitmask of the permissions that are B<not> present). The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest (die Bitmaske der Zugriffsrechte, die B<nicht> vorhanden sind). Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask (c'est-à-dire le masque de bits des permissions qui ne sont B<pas> fournies). Par défaut, il s'agit de l'umask du processus actuel. La valeur est donnée en octal.
pl: Ustawia umask (maskę bitową praw, które B<nie> występują). Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask (бітову маску прав доступу, яких B<немає>). Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: B<dmask=>I<value>
de: B<dmask=>I<Wert>
fr: B<dmask=>I<valeur>
pl: B<dmask=>I<wartość>
uk: B<dmask=>I<значення>

source: Set the umask applied to directories only. The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest, die nur für Verzeichnisse gültig ist. Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask appliqué aux répertoires seulement. Par défaut, c'est l'umask du processus appelant. La valeur est donnée en octal.
pl: Ustawia umask ustawiany wyłącznie do katalogów. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask, який буде застосовано лише до каталогів. Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: B<fmask=>I<value>
de: B<fmask=>I<Wert>
fr: B<fmask=>I<valeur>
pl: B<fmask=>I<wartość>
uk: B<fmask=>I<значення>

source: Set the umask applied to regular files only. The default is the umask of the current process. The value is given in octal.
de: legt die Umask fest, die nur für reguläre Dateien gültig ist. Die Vorgabe ist die Umask des aktuellen Prozesses. Der Wert wird in oktaler Notation angegeben.
fr: Définir l'umask appliqué aux fichiers normaux seulement. Par défaut, c'est l'umask du processus appelant. La valeur est donnée en octal.
pl: Ustawia umask ustawiany wyłącznie do zwykłych plików. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.
uk: Встановити umask, який буде застосовано лише до звичайних файлів. Типовим значенням є umask поточного процесу. Значення слід задавати у вісімковій формі.

source: B<allow_utime=>I<value>
de: B<allow_utime=>I<Wert>
fr: B<allow_utime=>I<valeur>
pl: B<allow_utime=>I<wartość>
uk: B<allow_utime=>I<значення>

source: This option controls the permission check of mtime/atime.
de: steuert die Überprüfung der Zugriffsrechte von mtime/atime.
fr: Cette option contrôle la vérification des permissions de B<mtime> ou B<atime>.
pl: Opcja kontroluje sprawdzanie uprawnień mtime/atime
uk: Цей параметр керує перевіркою прав доступу mtime/atime.

source: If current process is in group of file\(cqs group ID, you can change timestamp.
de: legt fest, dass Sie den Zeitstempel ändern können, wenn der aktuelle Prozess Element der Gruppe mit der Gruppenkennung der Datei ist.
fr: Si le processus actuel appartient au GID du fichier, l'horodatage peut être modifié.
pl: Jeśli bieżący proces jest w grupie identyfikatora grupy pliku, można zmienić pieczątkę czasową.
uk: Якщо поточний процес належить групі ідентифікатора групи файла, ви можете змінити часову позначку.

source: Other users can change timestamp.
de: legt fest, dass andere Benutzer den Zeitstempel ändern können.
fr: Les autres utilisateurs peuvent changer les horodatages.
pl: Inny użytkownicy mogą zmieniać pieczątkę czasową.
uk: Часову позначку можуть змінювати інші користувачі.

source: The default is set from \(aqdmask\(aq option. (If the directory is writable, B<utime>(2) is also allowed. I.e. ~dmask & 022)
de: Die Standardeinstellung wird aus der Option »dmask« entnommen (falls das Verzeichnis nicht schreibgeschützt ist, dann ist auch B<utime>(2) erlaubt, d.h. ~dmask & 022).
fr: La valeur par défaut est définie depuis l'option B<dmask> (s'il est possible d'écrire dans le répertoire, B<utime>(2) est autorisé, c'est-à-dire « dmask & 022 »).
pl: Wartość domyślna jest ustawiana z opcji "dmask" (jeśli katalog jest zapisywalny, to dozwolone jest również B<utime>(2) np.~dmask & 022)
uk: Типове значення буде встановлено на основі параметра «dmask». (Якщо каталог є придатним до запису, також можна скористатися B<utime>(2). Приклад: ~dmask & 022)
