Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The workdir needs to be an empty directory on the same filesystem as upperdir.
de: Das Arbeitsverzeichnis muss ein leeres Verzeichnis auf dem gleichen Dateisystem wie das obere Verzeichnis sein.
fr: Le I<répertoire> doit être un répertoire vide sur le même système de fichiers que le répertoire supérieur.
pl: Katalog roboczy musi być pustym katalogiem na tym samym systemie plików, co katalog górny.
uk: Робочий каталог, має бути порожнім каталогом у тій самій файловій системі, що й upperdir.

source: Use the "B<user.overlay.>" xattr namespace instead of "B<trusted.overlay.>". This is useful for unprivileged mounting of overlayfs.
de: verwendet den xattr-Namensraum »B<user.overlay.>« anstelle von »B<trusted.overlay.>«. Dies ist für unprivilegiertes Einhängen eines Überlagerungs-Dateisystems nützlich.
fr: Utiliser l'espace de noms B<xattr> « B<user.overlay.> » à la place de « B<trusted.overlay.> ». C'est utile pour un montage non privilégié de système de fichiers overlay.
uk: Використати простір назв xattr "B<user.overlay.>" замість "B<trusted.overlay.>". Це корисно для непривілейованого монтування накладних файлових систем.

source: If the I<redirect_dir> feature is enabled, then the directory will be copied up (but not the contents). Then the "{B<trusted>|B<user>}.overlay.redirect" extended attribute is set to the path of the original location from the root of the overlay. Finally the directory is moved to the new location.
de: Falls die Funktion I<redirect_dir> aktiviert ist, dann wird das Verzeichnis (aber nicht dessen Inhalt) hinaufkopiert. Dann wird das erweiterte Attribut »{B<trusted>|B<user>}.overlay.redirect« von der Überlagerung auf den Pfad des ursprünglichen Ortes der Wurzel gesetzt. Zum Schluss wird das Verzeichnis an den neuen Ort verschoben.
fr: Si la fonctionnalité I<redirect_dir> est activée, alors le répertoire sera copié (mais pas les contenus). Alors, l'attribut étendu « {B<trusted>|B<user>}.overlay.redirect » est défini pour le chemin de l'emplacement initial à partir de la racine de l'overlay. Enfin, le répertoire est déplacé vers le nouvel emplacement.
uk: Якщо функцію I<redirect_dir> увімкнено, то каталог буде скопійовано (але не вміст). Потім розширений атрибут "{B<trusted>|B<user>}.overlay.redirect" встановлюється на шлях початкового розташування від кореня накладки. Нарешті каталог переміщується в нове місце.

source: Redirects are enabled.
de: Umleitungen sind aktiviert.
fr: Les redirections sont activées.
pl: Przekierowania są włączone.
uk: Увімкнено переспрямовування.

source: Redirects are not created and only followed if "redirect_always_follow" feature is enabled in the kernel/module config.
de: Umleitungen werden nicht erstellt und ihnen wird nur dann gefolgt, wenn die Funktion »redirect_always_follow« in der Kernel-/Modulkonfiguration aktiviert ist.
fr: Les redirections ne sont pas créées et suivies seulement si la fonctionnalité « redirect_always_follow » est activée dans la configuration du noyau ou du module.
pl: Przekierowania nie są tworzone, a są honorowane tylko jeśli włączono funkcję "redirect_always_follow" w konfiguracji jądra/modułu.
uk: Переспрямування не створюються і використовуються лише, якщо увімкнено функцію "redirect_always_follow" у налаштуваннях ядра/модуля.

source: Redirects are not created, but followed.
de: Umleitungen werden nicht erstellt, aber ihnen wird gefolgt.
fr: Les redirections ne sont pas créées mais suivies.
pl: Przekierowania nie są tworzone, ale są honorowane.
uk: Переспрямування не створюються, але переходи виконуються.

source: Redirects are not created and not followed (equivalent to "redirect_dir=off" if "redirect_always_follow" feature is not enabled).
de: Umleitungen werden nicht erstellt und ihnen wird nicht gefolgt (gleichbedeutend mit »redirect_dir=off«, falls die Funktion »redirect_always_follow« nicht aktiviert ist).
fr: Les redirections ne sont ni créées ni suivies (équivalent à « redirect_dir=off ») si la fonctionnalité « redirect_always_follow » n'estpas activée.
pl: Przekierowania nie są tworzone, ani honorowane (równoważne "redirect_dir=off" jeśli nie włączono funkcji "redirect_always_follow").
uk: Переспрямування не створюються і не використовуються (еквівалентно "redirect_dir=off", якщо функцію "redirect_always_follow" не ввімкнено).

source: Inode index. If this feature is disabled and a file with multiple hard links is copied up, then this will "break" the link. Changes will not be propagated to other names referring to the same inode.
de: Inode-Index. Falls diese Funktion deaktiviert ist und eine Datei mit mehreren harten Links hinaufkopiert wird, dann wird dies den Link unbrauchbar machen. Änderungen werden nicht zu anderen Namen ausgebreitet, die sich auf den selben Inode beziehen.
fr: Index d'inœuds. Si cette fonctionnalité est désactivée et qu'un fichier avec de nombreux liens physiques est copié, cela « cassera » le lien. Les modifications ne seront pas propagées à d'autres noms faisant référence au même inœud.
pl: Indeks i-węzłów. Jeśli wyłączono tę funkcję, a skopiowany zostanie plik z wieloma dowiązaniami stałymi, to takie ustawienie zepsuje dowiązania. Zmiany nie będą uwzględniane dla innych nazw odnoszących się do tego samego i-węzła.
uk: Індексувати inode. Якщо цю можливість вимкнено, і буде скопійовано файл із декількома жорсткими посиланнями, посилання буде «розірвано». Зміни не буде поширено на інші назви, які посилаються на той самий inode.

source: Can be used to replace UUID of the underlying filesystem in file handles with null, and effectively disable UUID checks. This can be useful in case the underlying disk is copied and the UUID of this copy is changed. This is only applicable if all lower/upper/work directories are on the same filesystem, otherwise it will fallback to normal behaviour.
de: kann zum Ersetzen der UUID des zugrundeliegenden Dateisystems in Datei-Handles mit Null verwendet werden und deaktiviert damit effektiv UUID-Überprüfungen. Dies kann in Fällen nützlich sein, bei denen die zugrundeliegende Platte kopiert und die UUID dieser Kopie geändert wird. Dies gilt nur, falls alle niedrigen/höheren/Arbeitsverzeichnisse auf dem gleichen Dateisystem sind, andernfalls fällt diese auf das normale Verhalten zurück.
fr: Cette fonctionnalité peut être utilisée pour remplacer l'UUID du système de fichiers dans les gestionnaires de fichier par NULL et désactiver effectivement les vérifications d'UUID. Cela peut être utile au cas où le disque sous-jacent est copié et que l'UUID de la copie est modifié. Ce n'est applicable que si tous les répertoires inférieur, supérieur et de travail sont sur le même système de fichiers, autrement il revient au comportement normal.
uk: Можна скористатися для заміни UUID базової файлової системи у порожніх дескрипторах файлів і, фактично, вимкнути перевірки UUID. Корисно, якщо базовий диск скопійовано, а UUID копії змінено. Працює, лише якщо усі верхні/нижні/робочі каталоги перебувають в одній файловій системі. Якщо це не так, резервною буде звичайна поведінка.

source: When the underlying filesystems supports NFS export and the "nfs_export" feature is enabled, an overlay filesystem may be exported to NFS.
de: Wenn das zugrundeliegende Dateisystem NFS-Exporte unterstützt und die Funktion »nfs_export« aktiviert ist, darf ein Überlagerungs-Dateisystem zu NFS exportiert werden.
fr: Quand les systèmes de fichiers sous-jacents gèrent l'export NFS et la fonctionnalité « nfs_export » est activée, un système de fichiers overlaysous-jacent peut être exporté sur NFS.
uk: Якщо у базових файлових системах передбачено підтримку експортування NFS, і увімкнено можливість «nfs_export», файлову систему-накладку може бути експортовано до NFS.

source: With the "nfs_export" feature, on copy_up of any lower object, an index entry is created under the index directory. The index entry name is the hexadecimal representation of the copy up origin file handle. For a non-directory object, the index entry is a hard link to the upper inode. For a directory object, the index entry has an extended attribute "{B<trusted>|B<user>}.overlay.upper" with an encoded file handle of the upper directory inode.
de: bei der Kopie eines niedrigen Objektes wird bei der Funktionalität »nfs_export« ein Indexverzeichnis erstellt. Der Indexeintragsname ist die hexadezimale Darstellung des hochkopierten Ursprungs-Datei-Handles. Für ein Objekt, das kein Verzeichnis ist, ist der Indexeintrag ein harter Link auf die obere Inode. Für ein Verzeichnisobjekt verfügt der Indexeintrag über das erweiterte Attribut »{B<trusted>|B<user>}.overlay.upper« mit einem einkodierten Datei-Handle der oberen Verzeichnis-Inode.
fr: Avec la fonctionnalité « nfs_export », lors d'une « copy_up » d'un objet inférieur quelconque, une entrée d'index est créée dans le répertoire d'index. Le nom de l'entrée d'index est la représentation hexadécimale du descripteur du fichier d'origine de la copie vers le haut. Pour un objet qui n'est pas un répertoire, l'entrée d'index est un lien physique vers l'inœud supérieur. Pour un objet répertoire, l'entrée d'index a un attribut étendu « {B<trusted>|B<user>}.overlay.upper » avec un descripteur de fichier encodé de l'inœud du répertoire supérieur.
uk: Якщо доступною є можливість «nfs_export» виконання copy_up над будь-яким нижчим об'єктом призведе до створення запису покажчика у каталозі покажчика. Назва запису покажчика є шістнадцятковим представленням скопійованого початкового дескриптора файла. Для об'єкта, який не є каталогом, запис покажчика є жорстким посиланням на вищий inode. Для об'єкта каталогу запис покажчика має розширений атрибут «{B<trusted>|B<user>}.overlay.upper» із закодованим дескриптором файла inode вищого каталогу.

source: When encoding a file handle from an overlay filesystem object, the following rules apply
de: Beim Kodieren eines Datei-Handles von einem Überlagerungs-Dateisystemobjekt gelten die folgenden Regeln:
fr: Lors de l'encodage d'un descripteur de fichier à partir d'un objet de système de fichiers overlay, les règles suivantes s'appliquent :
uk: При кодуванні дескриптора файла з накладеного об'єкта файлової системи виконуються такі правила

source: For a non-upper object, encode a lower file handle from lower inode
de: Für ein Objekt, das nicht oben ist, wird ein niedrigerer Datei-Handle von einer niedrigeren Inode kodiert.
fr: Pour un objet qui n'est pas supérieur, encoder un descripteur de fichier inférieur à partir d'un inœud inférieur.
uk: Для об'єкта, який не є вищим, виконується кодування нижчого дескриптора файла з нижчого inode

source: For an indexed object, encode a lower file handle from copy_up origin
de: Für in indiziertes Objekt wird ein niedriger Datei-Handle vom copy_up-Ursprung kodiert.
fr: Pour un objet indexé, encoder un descripteur de fichier inférieur à partir de l'origine du « copy_up ».
uk: Для індексованого об'єкта закодувати дескриптор нижнього файла з початку copy_up

source: For a pure-upper object and for an existing non-indexed upper object, encode an upper file handle from upper inode
de: Für ein reines oberes Objekt und für ein existierendes, nicht indiziertes oberes Objekt wird ein oberer Datei-Handle von einem oberen Inode kodiert.
fr: Pour un objet purement supérieur et pour un objet supérieur non indexé existant, encoder un descripteur de fichier supérieur à partir d'un inœud supérieur.
uk: Для суто вищого об'єкта і для наявного неіндексованого вищого об'єкта закодувати дескриптор вищого файла з вищого inode

source: The encoded overlay file handle includes
de: Das kodierte Überlagerungs-Datei-Handle enthält:
fr: Le descripteur de fichier overlay encodé comprend :
uk: Дескриптор закодованого файла-накладки включає

source: Header including path type information (e.g. lower/upper)
de: Kopfzeilen, einschließlich Pfadtypinformationen (z.B. oberer/unterer)
fr: un en-tête incluant l'information sur le type de chemin (par exemple inférieur/supérieur) ;
uk: Заголовок із даними щодо типу шляху (наприклад, нижній/вищий)

source: UUID of the underlying filesystem
de: UUID des zugrundeliegenden Dateisystems
fr: l'UUID du système de fichiers sous-jacent ;
pl: UUID podrzędnego systemu plików
uk: UUID базової файлової системи

source: Underlying filesystem encoding of underlying inode
de: Zugrundeliegende Dateisystemkodierung der zugrundeliegenden Inode
fr: l'encodage du système de fichiers sous-jacent de l'inœud sous-jacent.
uk: Базове кодування файлової системи базового inode

source: This encoding format is identical to the encoding format of file handles that are stored in extended attribute "{B<trusted>|B<user>}.overlay.origin". When decoding an overlay file handle, the following steps are followed
de: Dieses Kodierungsformat ist identisch zu dem Kodierungsformat von Datei-Handles, die im erweiterten Attribut »{B<trusted>|B<user>}.overlay.origin« gespeichert sind. Beim Dekodieren eines Überlagerungs-Datei-Handles werden die folgenden Schritte durchlaufen:
fr: Le format d'encodage est identique à celui des descripteurs de fichier qui sont stockés dans l'attribut étendu « {B<trusted>|B<user>}.overlay.origin ». Lors du décodage d'un descripteur de fichier overlay, les étapes suivantes doivent être franchies :
uk: Цей формат кодування є ідентичним до засобів обробки формату кодування, які збережено у розширеному атрибуті «{B<trusted>|B<user>}.overlay.origin». При декодуванні засобу обробки файла-накладки буде виконано наступні кроки

source: Find underlying layer by UUID and path type information.
de: Die zugrundeliegende Ebene durch UUID- und Pfadinformationen ermitteln.
fr: Trouver la couche sous-jacente par UUID et information de type de chemin ;
uk: Знайти базовий рівень за UUID і даними щодо типу шляху.

source: Decode the underlying filesystem file handle to underlying dentry.
de: Das zugrundeligende Dateisystem-Handle auf den zugrundeliegenden Dentry dekodieren.
fr: Décoder le descripteur de fichier du système de fichiers sous-jacent vers le I<dentry> sous-jacent ;
uk: Декодувати дескриптор файла у базовій файловій системі до базового dentry.

source: For a lower file handle, lookup the handle in index directory by name.
de: Für einen unteren Datei-Handle den Handle im Indexverzeichnis durch den Namen nachschlagen.
fr: Pour un descripteur de fichier inférieur, rechercher le descripteur dans le répertoire d'index par nom ;
uk: Для дескриптора нижнього файла знайти дескриптор у каталозі покажчика за назвою.

source: If a whiteout is found in index, return B<ESTALE>. This represents an overlay object that was deleted after its file handle was encoded.
de: Falls ein Whiteout im Index gefunden wird, B<ESTALE> zurückliefern. Dies stellt ein Überlagerungsobjekt dar, das gelöscht wurde, nachdem der Datei-Handle kodiert wurde.
fr: Si un whiteout est trouvé dans un index, renvoyer B<ESTALE>. Cela représente un objet overlay qui a été supprimé après que son descripteur de fichier a été encodé.
uk: Якщо у покажчику буде виявлено білий привид (whiteout), повернути B<ESTALE>. Білий привид — об'єкт накладки, який було вилучено після того, як його дескриптор файла було закодовано.

source: For a non-directory, instantiate a disconnected overlay dentry from the decoded underlying dentry, the path type and index inode, if found.
de: Falls es sich nicht um ein Verzeichnis handelt, wird ein unverbundener Überlagerungs-Dentry von dem zugrundeliegenden dekodierten Dentry, dem Pfadtyp und dem Index-Inode istantiiert, falls diese gefunden werden.
fr: Pour un objet non répertoire, instancier un dentry overlay déconnecté à partir du dentry sous-jacent décodé, du type de chemin et de l'inœud d'index, s'ils sont trouvés.
uk: Для записів, які не є каталогами, створити екземпляр від'єднаного dentry накладки з декодованого базового dentry, типу шляху і inode покажчика, якщо такий знайдено.

source: For a directory, use the connected underlying decoded dentry, path type and index, to lookup a connected overlay dentry.
de: Für ein Verzeichnis wird der verbundene zugrundeliegende dekodierte Dentry, Pfadtyp und Index verwendet, um einen verbundenen Überlagerugns-Dentry nachzuschlagen.
fr: Pour un répertoire, utiliser le dentry sous-jacent décodé connecté, le type de chemin et l'index, pour rechercher un dentry overlay connecté.
uk: Для каталогу скористатися з'єднаним базовим декодованим dentry, типом шляху та покажчиком для пошуку з'єднаного накладеного dentry.

source: Decoding a non-directory file handle may return a disconnected dentry. copy_up of that disconnected dentry will create an upper index entry with no upper alias.
de: Dekodieren eines Datei-Handles kann ein nicht verbundenen Dentry zurückliefern, falls der Handle nicht zu einem Verzeichnis gehört. copy_up dieses nicht verbundenen Dentries wird einen oberen Indexeintrag ohne oberen Alias erstellen.
fr: Le décodage d'un descripteur de fichier qui n'est pas un répertoire peut renvoyer un dentry déconnecté. Le « copy_up » de ce dentry déconnecté créera une entrée d'index supérieure sans alias supérieur.
uk: Декодування дескриптора файла, який не є каталогом, може повернути від'єднаний dentry. copy_up цього від'єднаного dentry створить верхній запис покажчика без верхньої альтернативи.

source: When overlay filesystem has multiple lower layers, a middle layer directory may have a "redirect" to lower directory. Because middle layer "redirects" are not indexed, a lower file handle that was encoded from the "redirect" origin directory, cannot be used to find the middle or upper layer directory. Similarly, a lower file handle that was encoded from a descendant of the "redirect" origin directory, cannot be used to reconstruct a connected overlay path. To mitigate the cases of directories that cannot be decoded from a lower file handle, these directories are copied up on encode and encoded as an upper file handle. On an overlay filesystem with no upper layer this mitigation cannot be used NFS export in this setup requires turning off redirect follow (e.g. "I<redirect_dir=nofollow>").
de: Wenn ein Überlagerungsdateisystem mehrere untere Ebenen hat, kann ein Verzeichnis in einer mittleren Ebene eine »Umleitung« zu einer niedrigeren Ebene haben. Da die »Umleitungen« der mittleren Ebenen nicht indiziert sind, kann ein unterer Datei-Handle, der von dem umgeleiteten »Umleitungs«-Verzeichnis kodiert wurde, nicht zum Auffinden des Verzeichnisses in der mittleren oder obereren Ebene verwendet werden. Entsprechend kann ein unterer Datei-Handle, der von einem Abkömmling des »umgeleiteten« Ursprungsverzeichnisses kodiert wurde, nicht zur Rekonstruktion eines verbundenen Überlagerungspfades verwendet werden. Um die Fälle von Verzeichnissen, die nicht von einem unteren Datei-Handle dekodiert werden können, abzumildern, werden diese Verzeichnisse beim Kodieren hochkopiert und als oberere Datei-Handle kodiert. Bei einem Überlagerungsdateisystem ohne obere Ebene kann diese Abmilderung nicht verwendet werden. Bei NFS-Exporten in dieser Konfiguration muss das Folgen von Umleitungen abgeschaltet werden (z.B. »I<redirect_dir=nofollow>«).
fr: Quand un système de fichier overlay possède plusieurs niveaux inférieurs, un répertoire de niveau moyen peut avoir une « redirection » vers un répertoire inférieur. Comme les « redirections » de niveau moyen ne sont pas indexées, un descripteur de fichier inférieur qui a été encodé à partir du répertoire d'origine de « redirection » ne peut pas être utilisé pour trouver le répertoire de niveau moyen ou supérieur. De la même manière, un descripteur de fichier inférieur qui a été encodé à partir d'un descendant du répertoire d'origine de « redirection » ne peut pas être utilisé pour reconstruire un chemin overlay connecté. Pour pallier les cas des répertoires qui ne peuvent pas être décodés à partir d'un descripteur de fichier inférieur, ces répertoires sont copiés pendant l'encodage et encodés comme descripteur de fichier supérieur. Sur un système de fichiers overlay, sans niveau supérieur, cette méthode ne peut être employée et l'export NFS dans cette configuration nécessite de désactiver « redirect follow » (par exemple avec « I<redirect_dir=nofollow> »).
uk: Якщо у накладеній файловій системі є декілька нижніх шарів, каталог середнього шару може мати «переспрямування» на нижчий каталог. Оскільки «переспрямування» середнього шару не буде індексовано, дескриптором нижнього файла, який було закодовано з початкового каталогу «переспрямування», не можна скористатися для пошуку каталогу середнього або вищого шару. Так само, дескриптором нижнього файла, який було закодовано з нащадка початкового каталогу «переспрямування», не можна скористатися для відтворення шляху до з'єднаної накладки. Щоб усунути проблеми із каталогами, які не може бути декодовано з дескриптора нижнього файла, ці каталоги буде скопійовано на закодоване і закодовано як дескриптор верхнього файла. На накладеній файловій системі без верхнього шару це рішення не може бути використано. Експортування NFS при цих налаштуваннях потребує вимикання переходу за переспрямуваннями (наприклад, «I<redirect_dir=nofollow>»).

source: The overlay filesystem does not support non-directory connectable file handles, so exporting with the I<subtree_check> exportfs configuration will cause failures to lookup files over NFS.
de: Das Überlagerungsdateisystem unterstützt keine verbindbaren Datei-Handles, die keine Verzeichnisse sind, daher führt das Exportieren mit der Exportfs-Konfiguration I<subtree_check> zu Fehlschlägen beim Nachschlagen von Dateien über NFS.
fr: Les systèmes de fichiers overlay ne gèrent pas les descripteurs de fichiers connectables qui ne sont pas des répertoires, aussi l'exportation avec la configuration I<subtree_check> d'exportfs provoquera l'échec de la recherche de fichier avec NFS.
uk: У накладеній файловій системі не передбачено підтримки дескрипторів придатних до з'єднання файлів, які не є каталогами, тому експортування за допомогою налаштування exportfs I<subtree_check> призводитиме до помилок під час спроби пошуку файлів у NFS.

source: When the NFS export feature is enabled, all directory index entries are verified on mount time to check that upper file handles are not stale. This verification may cause significant overhead in some cases.
de: Wenn die NFS-Exportfunktionalität aktiviert ist, werden alle Verzeichnisindexeinträge zum Einhängezeitpunkt verifiziert, um zu prüfen, dass die oberen Datei-Handles nicht verwaist sind. Diese Überprüfung kann in einigen Fällen zu einem signifikanten Zusatzaufwand führen.
fr: Quand la fonction export NFS est activée, toutes les entrées d'index de répertoires sont vérifiées au moment du montage pour s'assurer que les descripteurs de fichiers supérieurs ne sont pas non valables (« stale »). Cette vérification peut provoquer une surcharge significative dans certains cas.
uk: Якщо увімкнено можливість експортування NFS, усі записи покажчика каталогу буде перевірено під час монтування, що переконатися, що дескриптори вищих файлів не є застарілими. Така перевірка може у деяких випадках призводити до значних затримок обробки.

source: Note: the mount options I<index=off,nfs_export=on> are conflicting for a read-write mount and will result in an error.
de: Achtung: Die Einhängeoptionen I<index=off,nfs_export=on> stehen im Konflikt zu einer les- und schreibbaren Einhängung und werden einen Fehler hervorrufen.
fr: Note : les options de montage I<index=off,nfs_export=on> sont en conflit pour un montage en lecture et écriture et provoqueront une erreur.
uk: Зауваження: параметри монтування I<index=off,nfs_export=on> конфліктують між собою у режимі монтування для читання-запису і призводять до помилки.
