Repository: sebras/manpages-l10n
Catalog: po/*/man8/mountstats.8.po
Languages: fr

source: 12 Dec 2014
fr: 12 décembre 2014

source: NAME
fr: NOM

source: mountstats - Displays various NFS client per-mount statistics
fr: mountstats – Afficher des statistiques diverses de client NFS selon le montage

source: B<mountstats> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<infile>] [B<-S>|B<--since> I<sincefile>] [ [B<-n>|B<--nfs>] | [B<-r>|B<--rpc>] | [B<-R>|B<--raw>] | [B<-x>|B<--xprt>] ] [I<mountpoint>]I<...>
fr: B<mountstats> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<fichier_entrée>] [B<-S>|B<--since> I<fichier_depuis>] [ [B<-n>|B<--nfs>] | [B<-r>|B<--rpc>] | [B<-R>|B<--raw>] | [B<-x>|B<--xprt>] ] [I<point_montage>]I<...>

source: B<mountstats iostat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<infile>] [B<-S>|B<--since> I<sincefile>] [I<interval>] [I<count>] [I<mountpoint>]I<...>
fr: B<mountstats iostat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<fichier_entrée>] [B<-S>|B<--since> I<fichier_depuis>] [I<intervale>] [I<compte>] [I<point_montage>]I<...>

source: B<mountstats nfsstat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<infile>] [B<-S>|B<--since> I<sincefile>] [B<-3>] [B<-4>] [I<mountpoint>]I<...>
fr: B<mountstats nfsstat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<fichier_entrée>] [B<-S>|B<--since> I<fichier_depuis>] [B<-3>] [B<-4>] [I<point_montage>]I<...>

source: The B<mountstats> command displays various NFS client statisitics for each given I<mountpoint>.
fr: La commande B<mountstats> affiche diverses statistiques du client NFS pour chaque I<point_montage> donné.

source: If no I<mountpoint> is given, statistics will be displayed for all NFS mountpoints on the client.
fr: Si aucun I<point_montage> n’est indiqué, les statistiques affichées porteront sur tous les points de montage NFS du client.

source: Sub-commands
fr: Commandes subsidiaires

source: Valid B<mountstats>(8) subcommands are:
fr: Les commandes subsidiaires permises pour B<mountstats>(8) sont les suivantes :

source: Display a combination of per-op RPC statistics, NFS event counts, and NFS byte counts. This is the default sub-command that will be executed if no sub-command is given.
fr: Afficher une combinaison de statistiques RPC par opération, de compte d’évènements NFS et un compte d’octets pour NFS. C’est la commande subsidiaire qui sera exécutée si aucune n’est précisée.

source: Display iostat-like statistics.
fr: Afficher des statistiques de type iostat.

source: Display nfsstat-like statistics.
fr: Afficher des statistiques de type nfsstat.

source: Options valid for all sub-commands
fr: Options autorisées pour toutes les commandes subsidiaires

source: B<-h, --help>
fr: B<-h>, B<--help>

source: show the help message and exit
fr: Afficher un message d'aide et terminer.

source: B<-v, --version>
fr: B<-v>, B<--version>

source: show program's version number and exit
fr: Afficher la version du programme et terminer.

source: B<-f >I<infile>, B<--file >I<infile>
fr: B<-f> I<fichier_entrée>, B<--file >I<fichier_entrée>

source: Read stats from I<infile> instead of I</proc/self/mountstats>. I<infile> must be in the same format as I</proc/self/mountstats>. This may be used with the B<-S>|B<--since> options to display the delta between two different points in time. This may not be used with the I<interval> or I<count> options of the B<iostat> sub-command.
fr: Lire les statistiques depuis I<fichier_entrée> au lieu de I</proc/self/mountstats>. I<fichier_entrée> doit être du même format que I</proc/self/mountstats>. Cela peut être utilisé avec les options B<-S>|B<--since> pour afficher la différence entre deux instants. Cela ne peut être utilisé avec les options I<intervalle> ou I<compte> de la commande subsidiaire B<iostat>.

source: B<-S >I<sincefile>, B<--since >I<sincefile>
fr: B<-S >I<fichier_depuis>, B<--since >I<fichier_depuis>

source: Show difference between current stats and those in I<sincefile>. I<sincefile> must be in the same format as I</proc/self/mountstats>. This may be used with the B<-f>|B<--file> options to display the delta between two different points in time. This may not be used with the I<interval> or I<count> options of the B<iostat> sub-command.
fr: Afficher la différence entre les statistiques du moment et celles dans I<fichier_depuis>. I<fichier_depuis> doit être du même format que I</proc/self/mountstats>. Cela peut être utilisé avec les options B<-f>|B<--file> pour afficher la différence entre deux instants. Cela ne peut être utilisé avec les options I<intervalle> ou I<compte> de la commande subsidiaire B<iostat>.

source: Options specific to the mountstats sub-command
fr: Options particulières aux commandes subsidiaires de mountstats

source: B<-n, --nfs> Display only the NFS statistics
fr: B<-n>, B<--nfs> Afficher seulement les statistiques sur NFS.

source: B<-r, --rpc>
fr: B<-r>, B<--rpc>

source: Display only the RPC statistics
fr: Afficher seulement les statistiques sur les RPC.

source: B<-R, --raw>
fr: B<-R>, B<--raw>

source: Display only the raw statistics. This is intended for use with the B<-f>|B<--file> and B<-S>|B<--since> options.
fr: Afficher les statistiques brutes. Cela est prévu pour une utilisation avec les options B<-f>|B<--file> et B<-S>|B<--since>.

source: B<-x, --xprt>
fr: B<-x>, B<--xprt>

source: Display only the transport statistics
fr: Afficher seulement les statistiques sur le transport

source: Options specific to the iostat sub-command
fr: Options particulières à la commande subsidiaire iostat

source: I<interval>
fr: I<intervalle>

source: Specifies the amount of time in seconds between each report. The first report contains statistics for the time since each file system was mounted. Each subsequent report contains statistics collected during the interval since the previous report. This may not be used with the B<-f>|B<--file> or B<-S>|B<--since> options.
fr: Indiquer le délai en seconde entre deux rapports. Le premier rapport contient les statistiques calculées sur le temps passé depuis le montage de tous les systèmes de fichiers. Tous les rapports suivants contiennent les statistiques collectées durant l’intervalle depuis le rapport précédent. Cela ne peut être utilisé avec les options B<-f>|B<--file> ou B<-S>|B<--since>.

source: I<count>
fr: I<compte>

source: Determines the number of reports generated at I<interval> seconds apart. If the I<interval> parameter is specified without the I<count> parameter, the command generates reports continuously. This may not be used with the B<-f>|B<--file> or B<-S>|B<--since> options.
fr: Détermination du nombre de rapports séparés générés tous les I<intervalle> secondes. Si le paramètre I<intervalle> est fourni sans le paramètre I<compte>, la commande affiche des rapports en continu. Cela ne peut être utilisé avec les options B<-f>|B<--file> ou B<-S>|B<--since>.

source: Options specific to the nfsstat sub-command
fr: Options particulières à la commande subsidiaire nfsstat

source: Show only NFS version 3 statistics. The default is to show both version 3 and version 4 statistics.
fr: Afficher seulement les statistiques pour la version 3 de NFS. Le comportement par défaut est d’afficher des statistiques pour les versions 3 et 4.

source: Show only NFS version 4 statistics. The default is to show both version 3 and version 4 statistics.
fr: Afficher seulement les statistiques pour la version 4 de NFS. Le comportement par défaut est d’afficher des statistiques pour les versions 3 et 4.

source: FILES
fr: FICHIERS

source: SEE ALSO
fr: VOIR AUSSI

source: AUTHOR
fr: AUTEUR

source: B<mountstats> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<infile>] [B<-S>|B<--since> I<sincefile>] [ [B<-n>|B<--nfs>] | [B<-r>|B<--rpc>] | [B<-R>|B<--raw>] ] [I<mountpoint>]I<...>
fr: B<mountstats> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<hier_entrée> I<ficier_depuis>] [ [B<-n>|B<--nfs>] | [B<-r>|B<--rpc>] | [B<-R>|B<--raw>] ] [I<point_montage>]I<...>

source: B<mounstats nfsstat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<infile>] [B<-S>|B<--since> I<sincefile>] [B<-3>] [B<-4>] [I<mountpoint>]I<...>
fr: B<mounstats nfsstat> [B<-h>|B<--help>] [B<-v>|B<--version>] [B<-f>|B<--file> I<fichier_entrée>] [B<-S>|B<--since> I<fichier_depuis>] [B<-3>] [B<-4>] [I<point_montage>]I<...>
