Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: B<stale_rw>: This option maintains an index (cache) of directory inodes which is used by the nfs-related code to improve look-ups. Full file operations (read/write) over NFS are supported but with cache eviction at NFS server, this could result in spurious B<ESTALE> errors.
de: B<stale_rw>: Diese Option verwaltet einen Index (Zwischenspeicher) von Verzeichnis-Inodes, der von NFS-bezogenem Code zur Verbesserung von Abfragevorgängen verwendet wird. Vollständige Dateioperationen (schreiben/lesen) über NFS werden unterstützt, aber mit Zwischenspeicher-Leerung auf dem NFS-Server, was fälschliche B<ESTALE>-Fehler verursachen könnte.
fr: B<stale_rw> : cette option maintient un index (cache) des inœuds de répertoire qui est utilisé par le code relatif à NFS pour améliorer les recherches. Les opérations complètes de fichier (lecture ou écriture) par NFS sont prises en charge mais avec expulsion du cache vers le serveur NFS, cela pourrait avoir pour conséquence des erreurs B<ESTALE> infondées.
pl: B<stale_rw>: Opcja ta zarządza indeksem (buforem) i-węzłów katalogów używanych przez kod związany z nfs do usprawnienia wyszukiwań. Operacja pełnoplikowe (odczyt/zapis) przez NFS są obsługiwane, ale przy usuwaniu bufora na serwerze NFS może to powodować fałszywe błędy B<ESTALE>.
uk: B<stale_rw>: використання цього параметра призводить до підтримання покажчика (кешу) inode каталогів, який буде використано пов'язаним із NFS кодом для удосконалення пошуку. Передбачено підтримку повного набору дій з файлами (читання/запис), але із заміщенням кешу на сервері NFS, це може призвести до паразитних помилок B<ESTALE>.

source: B<nostale_ro>: This option bases the inode number and file handle on the on-disk location of a file in the FAT directory entry. This ensures that B<ESTALE> will not be returned after a file is evicted from the inode cache. However, it means that operations such as rename, create and unlink could cause file handles that previously pointed at one file to point at a different file, potentially causing data corruption. For this reason, this option also mounts the filesystem readonly.
de: B<nostale_ro>: Bei dieser Option basiert die Inode-Nummer und der Datei-Handler auf dem Ort auf der Platte im FAT-Verzeichniseintrag. Dies stellt sicher, dass B<ESTALE> nicht zurückgegeben wird, nachdem eine Datei aus dem Inode-Zwischenspeicher entfernt wurde. Jedoch bedeutet das, dass Aktionen wie Umbenennen, Anlegen und Löschen mit »Unlink« Datei-Handles zur Folge haben könnten, die vorher auf eine Datei, und anschließend auf eine andere Datei zeigen, was potenziell Datenverlust verursachen könnte. Aus diesem Grund hängt die Option das Dateisystem schreibgeschützt ein.
fr: B<nostale_ro> : cette option base le numéro d’inœud et le descripteur de fichiers sur l’emplacement d’un fichier sur le disque dans l’entrée de répertoire FAT. Cela assure que B<ESTALE> ne sera pas renvoyé après l'expulsion d’un fichier du cache d’inœuds. Cependant, cela signifie que les opérations comme le renommage, la création et la destruction pourraient forcer les gestionnaires de fichiers qui pointaient auparavant vers un fichier à pointer vers un autre fichier, avec une éventuelle corruption de données. Pour cette raison, cette option monte aussi le système de fichiers en lecture seule.
pl: B<nostale_ro>: Ta opcja bazuje na numerze i-węzła i uchwycie pliku w położeniu pliku na dysku we wpisie katalogu FAT. Zapewnia to, że nie zostanie zwrócone B<ESTALE> po usunięciu pliku z bufora i-węzła. Jednak skutkuje to również tym, że operacja takie jak zmiana nazwy, utworzenie i usunięcie (unlink) może spowodować, że uchwyty plików wskazujące na jakiś plik zaczną wskazywać na inny, powodując potencjalnie uszkodzenie danych. Z tego powodu, opcja ta montuje jednocześnie system plików jako tylko do odczytu.
uk: B<nostale_ro>: використання цього варіанта призводить до того, що номер inode та дескриптор файла буде засновано на розташування файла на диску у записі каталогу FAT. Це забезпечить те, що B<ESTALE> не буде повернуто, після того, як файл буде заміщено з кешу inode. Втім, це означає, що дії, подібні до перейменування, створення та скасування символічних посилань, можуть спричинити те, що дескриптори файлів, які раніше вказували на один файл, вказуватимуть на інший, що може призвести до пошкодження даних. З цієї причини використання цього варіанта також призводить до монтування файлової системи у режимі лише читання.

source: To maintain backward compatibility, '-o nfs' is also accepted, defaulting to B<stale_rw>.
de: Zwecks Abwärtskompatibilität wird auch »-o nfs« unterstützt, standardmäßig B<stale_rw>.
fr: Pour la compatibilité ascendante, B<-o nfs> est aussi acceptée, signifiant par défaut B<stale_rw>.
pl: Aby zachować kompatybilność wsteczną, akceptowana jest również opcja "-o nfs", która daje B<stale_rw>.
uk: Для підтримання зворотної сумісності також є прийнятним «-o nfs». Типовий варіантом є B<stale_rw>.

source: This option disables the conversion of timestamps between local time (as used by Windows on FAT) and UTC (which Linux uses internally). This is particularly useful when mounting devices (like digital cameras) that are set to UTC in order to avoid the pitfalls of local time.
de: deaktiviert die Umwandlung der Zeitstempel zwischen lokaler Zeit (wie von Windows FAT verwendet) und UTC (Weltzeit, wie von Linux intern verwendet). Dies ist insbesondere nützlich, wenn Geräte eingehängt werden, die auf UTC gesetzt sind (wie zum Beispiel Digitalkameras), um die Fallstricke der lokalen Zeit zu umgehen.
fr: Cette option désactive la conversion des horodatages entre le temps local (comme utilisé par Windows avec FAT) et le temps universel (que Linux utilise en interne). C'est particulièrement utile lors du montage de périphériques (comme des appareils photo numériques) qui utilisent l'heure universelle afin de s'affranchir des différentes heures locales.
pl: Opcja wyłącza konwersję pieczątek czasowych pomiędzy czasem lokalnym (używanym przez Windows na FAT) i UTC (używanym wewnętrznie przez Linuksa). Jest to przydatne szczególnie podczas montowania urządzeń (np. aparatów cyfrowych), które są ustawione na UTC, aby uniknąć pułapki związanej z czasem lokalnym.
uk: Цей параметр вимикає перетворення часових позначок між місцевим часом (який використовує Windows для FAT) та UTC (який на внутрішньому рівні використовує Linux). Це, зокрема, корисно при монтуванні пристроїв (наприклад, цифрових фотоапаратів), які працюють з UTC, щоб уникнути проблем із визначенням місцевого часу.

source: Set offset for conversion of timestamps from local time used by FAT to UTC. I.e., I<minutes> will be subtracted from each timestamp to convert it to UTC used internally by Linux. This is useful when the time zone set in the kernel via B<settimeofday>(2) is not the time zone used by the filesystem. Note that this option still does not provide correct time stamps in all cases in presence of DST - time stamps in a different DST setting will be off by one hour.
de: legt den Versatz für die Umwandlung von Zeitstempeln von der von FAT verwendeten lokalen Zeit in Weltzeit (UTC) um. Das heißt, die I<Minuten> werden von jedem Zeitstempel abgezogen, um ihn in die von Linux intern verwendete UTC umzuwandeln. dies ist nützlich, wenn die im Kernel mittels B<settimeofday>(2) gesetzte Zeitzone nicht die vom Dateisystem verwendete Zeitzone ist. Beachten Sie, dass diese Option immer noch nicht in allen Fällen von Sommerzeit-Winterzeit-Regelung (DST) korrekte Zeitstempel bereitstellt - Zeitstempel in einer Zone mit anderer Sommrzeit werden um eine Stunde versetzt sein.
fr: Définir le décalage pour la conversion des horodatages de l’heure locale utilisée par FAT en UTC. C’est-à-dire que des I<minutes> seront soustraites de chaque horodatage pour le convertir en UTC, tel qu’utilisé en interne par Linux. C’est utile quand le fuseau horaire défini dans le noyau par B<settimeofday>(1) n’est pas le fuseau horaire utilisé par le système de fichiers. Remarquez que cette option ne fournit cependant pas d’horodatage correct dans tous les cas en présence d’heure d’été — les horodatages en cas de configuration d’heure d’été différente seront décalés d’une heure.
pl: Ustawia przesunięcie do przeliczania pieczątek czasowych pomiędzy czasem lokalnym z FAT na UTC, tj. liczba I<minut> zostanie odjęta od każdej pieczątki czasowej, aby przeliczyć ją do czasu UTC używanego wewnętrznie przez Linuksa. Jest to przydatne, gdy strefa czasowa ustawiana przez jądro za pomocą B<settimeofday>(2) nie pokrywa się ze strefą czasową systemu plików. Proszę zauważyć, że ta opcja wciąż nie da prawidłowych pieczątek czasowych w przypadkach korzystania z czasu letniego – w innym ustawieniu czasu letniego wystąpi godzina różnicy.
uk: Встановити зсув для перетворення часових позначок з місцевого часу, який використано у FAT, до UTC. Тобто, значення I<хвилини> буде віднято від усіх часових позначок, щоб перетворити його на час UTC, який використовують на внутрішньому рівні у Linux. Це корисно, якщо часовий пояс, який встановлено у ядрі за допомогою B<settimeofday>(2), не збігається із часовим поясом, який використано у файловій системі. Зауважте, що цей параметр все одно не дає належних часових позначок в усіх випадках, якщо використано літній час — часові позначки за різних параметрів літнього часу можуть відрізнятися на годину.

source: Turn on the I<quiet> flag. Attempts to chown or chmod files do not return errors, although they fail. Use with caution!
de: aktiviert den Schalter I<quiet>. Versuche, »chown« oder »chmod« auf die Dateien anzuwenden, geben keine Fehler zurück, auch bei Fehlschlägen. Sie sollten dies mit Vorsicht verwenden!
fr: Activer l'attribut B<quiet>. Les tentatives de modification du propriétaire ou du mode d'accès aux fichiers ne renverront pas d'erreurs, bien qu'elles échouent. À utiliser avec précaution !
pl: Włącza flagę I<quiet> (cicho). Próby chown lub chmod nie zwracają błędów, chociaż się nie udają. Używaj ostrożnie!
uk: Увімкнути прапорець I<мовчазного> режиму. Спроби зміни власника або режиму доступу до файлів не повертатимуть повідомлень про помилки, хоча і будуть невдалими. Будьте обережні!

source: FAT has the ATTR_RO (read-only) attribute. On Windows, the ATTR_RO of the directory will just be ignored, and is used only by applications as a flag (e.g.\& it's set for the customized folder).
de: FAT hat das Attribut ATTR_RO (schreibgeschützt). Unter Windows wird das ATT_RO-Attribut des Verzeichnisses einfach ignoriert und nur von Anwendungen als Markierung verwendet (z.B.\& wird es für den benutzerdefinierten Ordner gesetzt).
fr: FAT a l’attribut ATTR_RO (lecture seule). Sous Windows, l’ATTR_RO du répertoire sera simplement ignoré et il n’est utilisé que par les applications comme un attribut (par exemple, il est défini pour le répertoire personnalisé).
pl: FAT ma atrybut ATTR_RO (tylko do odczytu). W systemie Windows atrybut ten w przypadku katalogu zostanie zignorowany i jest używany tylko przez aplikacje, w dodatku jako flaga (np. jest ustawiany dla folderów skonfigurowanych przez użytkownika).
uk: У FAT є атрибут ATTR_RO (лише читання). У Windows ATTR_RO для каталогу буде просто проігноровано. Цей атрибут використовують лише програми як прапорець (наприклад, його встановлюють для нетипово налаштованої теки).

source: If you want to use ATTR_RO as read-only flag even for the directory, set this option.
de: Wenn Sie das ATTR_RO-Attribut als Schreibschutzmarkierung für das Verzeichnis verwenden wollen, setzen Sie diese Option.
fr: Pour utiliser ATTR_RO comme un attribut de lecture seule même pour le répertoire, activez cette option.
pl: Jeśli atrybut ATTR_RO ma służyć jako flaga "tylko do odczytu" nawet dla katalogów, proszę ustawić tę opcję.
uk: Якщо вам потрібен атрибут ATTR_RO як прапорець лише читання навіть для каталогів, встановіть цей параметр.

source: If set, the execute permission bits of the file will be allowed only if the extension part of the name is \&.EXE, \&.COM, or \&.BAT. Not set by default.
de: Falls gesetzt, sind die Ausführbarkeits-Bits der Datei nur zulässig, wenn die Dateiendung \&.EXE, \&.COM oder \&.BAT lautet. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, les bits de permission d'exécution du fichier seront autorisés seulement si l'extension du nom de fichier est EXE, BAT ou COM. Désactivée par défaut.
pl: Jeśli ustawiona, bit wykonywalności pliku jest dozwolony tylko, jeśli część rozszerzenia nazwy jest jedną z .EXE, .COM lub .BAT. Domyślnie nie ustawiona.
uk: Якщо встановлено, біти прав доступу на виконання файлів можна буде використовувати, лише якщо суфіксом назви файла є \&.EXE, \&.COM або \&.BAT. Типово, не встановлено.

source: If set, ATTR_SYS attribute on FAT is handled as IMMUTABLE flag on Linux. Not set by default.
de: bewirkt, dass das ATTR_SYS-Attribut auf FAT-Systemen wie der Schalter IMMUTABLE unter Linux behandelt wird. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, l'attribut FAT ATTR_SYS est géré comme un attribut immuable sous Linux. Désactivée par défaut.
pl: Jeśli ustawiona, atrybut ATTR_SYS w FAT jest obsługiwany jak flaga IMMUTABLE w Linuksie. Domyślnie nie ustawiona.
uk: Якщо встановлено, атрибут ATTR_SYS у FAT буде оброблено як прапорець IMMUTABLE у Linux. Типово, не встановлено.

source: If set, the filesystem will try to flush to disk more early than normal. Not set by default.
de: bewirkt, dass das Dateisystem früher als normal auf die Platte zu schreiben versucht. Dies ist standardmäßig nicht gesetzt.
fr: Si activée, le système de fichiers essayera de vider vers le disque plus tôt que la normale. Désactivée par défaut.
pl: Jeśli ustawiona, system plików będzie starał się opróżnić bufory na dysk wcześniej niż zwykle. Domyślnie nie ustawione.
uk: Якщо встановлено, файлова система намагатиметься скидати дані на диск раніше, ніж звичайно. Типово, не встановлено.

source: Use the "free clusters" value stored on FSINFO. It'll be used to determine number of free clusters without scanning disk. But it's not used by default, because recent Windows don't update it correctly in some case. If you are sure the "free clusters" on FSINFO is correct, by this option you can avoid scanning disk.
de: verwendet den in FSINFO gespeicherten »free clusters«-Wert. Damit wird die Anzahl der freien Cluster ermittelt, ohne die Platte zu durchsuchen. Aber es wird standardmäßig nicht verwendet, da aktuelle Windows-Systeme es in einigen Fällen nicht korrekt aktualisieren. Wenn Sie sicher sind, dass »free clusters« in FSINFO korrekt ist, können Sie mit dieser Option vermeiden, dass die Platte durchsucht wird.
fr: Utiliser la valeur de secteurs libres (« free clusters ») disponible dans FSINFO. Elle sera utilisée pour déterminer le nombre de secteurs libres sans analyser le disque. Elle n'est pas utilisée par défaut car les versions récentes de Windows ne la mettent pas à jour correctement dans certains cas. Si vous êtes sûr que la valeur de secteurs libres sur FSINFO est correcte, vous pouvez éviter l'analyse du disque grâce à cette option.
pl: Używa wartości "wolnych klastrów" ("free clusters"), przechowywanej w FSINFO. Jest ona używana do pozyskania liczby wolnych klastrów bez skanowania dysku. Nie jest ona jednak domyślnie używana, ponieważ ostatnie wersje Windows niekiedy nie aktualizują jej poprawnie. W przypadku przekonania, że wartość owych "wolnych klastrów" w FSINFO jest poprawna, używając tej opcji można zapobiec skanowaniu dysku.
uk: Використати значення «вільні кластери», що зберігається у FSINFO. Воно використовуватиметься для визначення кількості вільних кластерів без сканування диска. Але типово воно не використовується, оскільки останнім часом у деяких випадках Windows не оновлює його правильно. Якщо ви впевнені, що значення «вільні кластери» у FSINFO правильне, за допомогою цього параметра можна уникнути сканування диска.

source: Set the creator/type values as shown by the MacOS finder used for creating new files. Default values: '????'.
de: setzt die Werte für Ersteller und Typ für die Anzeige im Finder von MacOS zum Anlegen neuer Dateien. Standardwerte: »????«.
fr: Positionner les valeurs « creator » et « type » telles que les montre le « Finder MacOS » lors de la création de nouveaux fichiers. Valeurs par défaut « ???? ».
pl: Ustawia wartości creator/type pokazywane przez MacOS-owy Finder, używane do tworzenia nowych plików. Domyślne wartości: "????".
uk: Встановити значення creator/type, як показано у пошуку MacOS, що використовуються для створення нових файлів. Типові значення: «????».

source: Set the umask used for all directories, all regular files, or all files and directories. Defaults to the umask of the current process.
de: setzt die Umask für alle Verzeichnisse, alle regulären Dateien oder alle Dateien und Verzeichnisse. Standardmäßig die Umask des aktuellen Prozesses.
fr: Établir l'umask utilisé pour tous les répertoires, tous les fichiers normaux ou tous les fichiers et répertoires. La valeur par défaut est l'umask du processus actuel.
pl: Ustawia umask, używany do wszystkich katalogów, wszystkich zwykłych plików lub wszystkich plików i katalogów. Domyślnie jest to umask bieżącego procesu).
uk: Встановити umask для всіх каталогів, усіх звичайних файлів або всіх файлів і каталогів. Типово, використовується umask поточного процесу.

source: Select the CDROM session to mount. Defaults to leaving that decision to the CDROM driver. This option will fail with anything but a CDROM as underlying device.
de: wählt die einzuhängende Sitzung der CD-ROM. Standardmäßig wird die Auswahl dem CD-ROM-Treiber überlassen. Diese Option wird fehlschlagen, wenn das zugrundeliegende Gerät keine CD-ROM ist.
fr: Choisir la session de CD-ROM à monter. La valeur par défaut est de laisser cette décision au lecteur de CD-ROM. Cette option ne fonctionne que pour les CD-ROM.
pl: Ustawia sesję CD-ROM-u do zamontowania. Domyślnie, decyzja jest pozostawiana sterownikowi CD-ROM-u. Opcja nie powiedzie się, jeśli urządzeniem będzie coś innego niż CD-ROM.
uk: Вибрати сеанс CDROM для монтування. Типово, це рішення покладається за драйвер CDROM. Цей параметр не спрацює з будь-яким іншим базовим пристроєм, крім CDROM.

source: Select partition number n from the device. Only makes sense for CDROMs. Defaults to not parsing the partition table at all.
de: wählt die Partitionsnummer n auf dem Gerät aus. Dies ergibt nur für CDROMs Sinn. Standardmäßig wird die Partitionstabelle überhaupt nicht ausgewertet.
fr: Choisir la partition numéro B<n> du périphérique. Cela n'a de sens que pour les CD-ROM. Le comportement par défaut est de ne pas analyser la table de partitions.
pl: Wybiera numer partycji n z urządzenia. Ma sens tylko w przypadku CD-ROM-ów. Domyślnie, tablica partycji nie jest w ogóle przetwarzana.
uk: Вибрати номер розділу n на пристрої. Має сенс лише для CDROM. Типово таблиця розділів взагалі не аналізується.

source: Don't complain about invalid mount options.
de: beschwert sich nicht über unzulässige Einhängeoptionen.
fr: Ne pas se plaindre dans le cas d'options de montage non valables.
pl: Nie informuje o nieprawidłowych opcjach montowania.
uk: Не скаржитися на некоректні параметри монтування.

source: Convert all files names to lower case, or leave them. (Default: B<case=lower>.)
de: wandelt alle Dateinamen in Kleinbuchstaben um oder lässt sie unverändert (Voreinstellung B<case=lower>).
fr: Convertir les noms de fichiers en minuscules (B<lower>) ou les laisser tels quels (B<asis>). Par défaut : B<case=lower>.
pl: Konwertuje wszystkie nazwy plików na małe litery lub pozostawia bez zmian (domyślnie: B<case=lower>).
uk: Перетворити всі назви файлів у нижній регістр або залишити їх. (Типово: B<case=lower>.)

source: ISO 9660 is a standard describing a filesystem structure to be used on CD-ROMs. (This filesystem type is also seen on some DVDs. See also the I<udf> filesystem.)
de: ISO 9660 ist eine Norm, die eine Dateisystemstruktur beschreibt, die auf CD-ROMs verwendet wird (dieser Dateisystemtyp findet sich auch auf einigen DVDs, siehe auch das Dateisystem I<udf>).
fr: ISO 9660 est une norme décrivant la structure du système de fichiers pour les CD-ROM (ce type de système de fichiers apparaît aussi sur certains DVD ; consultez également le système de fichiers I<udf>).
pl: ISO 9660 jest standardem opisującym strukturę systemu plików na CD-ROM-ach (system ten jest również wykorzystywany na niektórych płytach DVD; patrz również system plików I<udf>).
uk: ISO 9660 — це стандарт, що описує структуру файлової системи, яка буде використовуватися на компакт-дисках. (Цей тип файлової системи також можна побачити на деяких DVD-дисках. Див. також файлову систему I<udf>.)

source: Normal I<iso9660> filenames appear in an 8.3 format (i.e., DOS-like restrictions on filename length), and in addition all characters are in upper case. Also there is no field for file ownership, protection, number of links, provision for block/character devices, etc.
de: Normale I<iso9660>-Dateinamen erscheinen im Format 8.3 (d.h. DOS-typische Einschränkungen bei der Länge der Dateinamen) und zusätzlich sind alle Zeichen groß geschrieben. Außerdem gibt es kein Feld für Dateieigentümer, Schutz, Anzahl der Links, Vorkehrung für blockorientierte/zeichenorientierte Geräte usw.
fr: Les noms de fichiers I<iso9660> normaux se présentent au format I<8.3> (limite de longueur des noms comme sous DOS). Tous les caractères sont en majuscules. De plus, rien n'est prévu pour stocker le propriétaire du fichier, le mode d'accès, le nombre de liens, les périphériques bloc ou caractère, etc.
pl: Normalne nazwy plików I<iso9660> pojawiają się w formacie 8.3 (tzn. występują DOS-owe ograniczenia długości nazw plików), a w dodatku wszystkie znaki pisane są wielkimi literami. Poza tym nie ma pola właściciela, ochrony, liczby dowiązań, zastrzeżeń dla urządzeń znakowych/blokowych, itd.
uk: Звичайні назви файлів I<iso9660> мають формат 8.3 (тобто обмеження довжини назви файлу нагадують DOS), і, крім того, всі символи пишуться у верхньому регістрі. Також немає полів для власника файлу, захисту, кількості посилань, надання блокових/символьних пристроїв тощо.
