Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: Set the last block of the filesystem.
de: setzt den letzten Block des Dateisystems.
fr: Définir le dernier bloc du système de fichiers.
pl: Ustawia ostatni blok systemu plików.
uk: Встановити останній блок файлової системи.

source: Unused historical mount options that may be encountered and should be removed
de: Nicht mehr genutzte frühere Einhängeoptionen, die Sie entdecken könnten und entfernt werden sollten
fr: Options de montage historiques pouvant être rencontrées et qui devraient être supprimées
uk: Невикористовувані застарілі параметри монтування, які можна ще зустріти, їх має бути вилучено

source: Ignored, use uid=E<lt>userE<gt> instead.
de: wird ignoriert, verwenden Sie stattdessen uid=E<lt>BenutzerE<gt>.
fr: Ignorée, utiliser B<uid=>E<lt>I<utilisateur>E<gt> à la place.
uk: Буде проігноровано, користуйтеся uid=E<lt>користувачE<gt>.

source: Ignored, use gid=E<lt>groupE<gt> instead.
de: wird ignoriert, verwenden Sie stattdessen gid=E<lt>GruppeE<gt>.
fr: Ignorée, utiliser B<gid=>E<lt>I<groupe>E<gt> à la place.
uk: Буде проігноровано, користуйтеся gid=E<lt>групаE<gt>.

source: Unimplemented and ignored.
de: ist nicht implementiert und wird ignoriert.
fr: Non implémentée et ignorée.
uk: Не реалізовано, буде проігноровано.

source: Mount options for ufs
de: Einhängeoptionen für UFS
fr: Options de montage pour ufs
pl: Opcje montowania do ufs
uk: Параметри монтування ufs

source: B<ufstype=>I<value>
de: B<ufstype=>I<Wert>
fr: B<ufstype=>I<valeur>
pl: B<ufstype=>I<wartość>
uk: B<ufstype=>I<значення>

source: UFS is a filesystem widely used in different operating systems. The problem are differences among implementations. Features of some implementations are undocumented, so its hard to recognize the type of ufs automatically. That\(cqs why the user must specify the type of ufs by mount option. Possible values are:
de: UFS ist ein Dateisystem, das in verschiedenen Betriebssystemen weit verbreitet ist. Das Problem sind die Unterschiede in den diversen Implementierungen. Die Funktionalitäten einiger Implementierungen sind nicht dokumentiert, darum ist es schwer, den UFS-Typ automatisch zu erkennen. Daher muss der Benutzer den UFS-Typ als Einhängeoption angeben. Zulässige Werte sind:
fr: UFS est un système de fichiers largement utilisé sur différents systèmes d'exploitation. Malgré tout, des différences existent suivant les implémentations. Certaines fonctionnalités de certaines implémentations sont mal documentées, et il est donc difficile de reconnaître automatiquement le type d'UFS. C'est pourquoi l'utilisateur doit indiquer le type d'UFS au montage. Les valeurs possibles sont :
pl: UFS jest systemem plików szeroko wykorzystywanym w różnych systemach operacyjnych. Problem stanowią różnice pomiędzy implementacjami. Cechy niektórych z nich są nieudokumentowane, tak więc trudno rozpoznać automatycznie typ ufs. Z tego powodu użytkownik musi określić typ ufs za pomocą opcji montowania. Możliwe wartości to:
uk: UFS є файловою системою, яку широко використовують у різних операційних системах. Проблемою є різниця у реалізаціях. Можливості деяких реалізацій не документовано, тому важко розпізнати тип ufs автоматично. Ось чому користувачеві слід вказати тип ufs параметром монтування. Можливими значеннями є такі:

source: Old format of ufs, this is the default, read only. (Don\(cqt forget to give the B<-r> option.)
de: bezeichnet das alte Format von UFS, dies ist die Vorgabe, nur lesbar (vergessen Sie nicht, die Option B<-r> anzugeben).
fr: Ancien format d'UFS, utilisé par défaut, en lecture seule (ne pas oublier l'option B<-r>).
pl: Stary format ufs, jest to typ domyślny, tylko do odczytu (proszę nie zapomnieć podać opcji B<-r>).
uk: Старий формат ufs, є типовим, лише читання (Не забудьте вказати параметр B<-r>.)

source: For filesystems created by a BSD-like system (NetBSD, FreeBSD, OpenBSD).
de: für die von Systemen der BSD-Familie erzeugten Dateisysteme (NetBSD, FreeBSD, OpenBSD).
fr: Pour les systèmes de fichiers créés par BSD (NetBSD, FreeBSD, OpenBSD).
pl: Dla systemów plików utworzonych przez system typu BSD (NetBSD, FreeBSD, OpenBSD).
uk: Для файлових систем, які створено BSD-подібною системою (NetBSD, FreeBSD, OpenBSD).

source: Used in FreeBSD 5.x supported as read-write.
de: Wird in FreeBSD 5.x als les- und schreibbar unterstützt.
fr: Utilisé par FreeBSD 5.x, pris en charge en lecture/écriture.
pl: Używane w FreeBSD 5.x obsługiwanego jako do odczytu i zapisu.
uk: Використовується у підтримуваних FreeBSD 5.x для читання-запису.

source: Synonym for ufs2.
de: ist ein Synonym für ufs2.
fr: Synonyme d'B<ufs2>.
pl: Synonim do ufs2.
uk: Синонім до ufs2.

source: For filesystems created by SunOS or Solaris on Sparc.
de: für die von SunOS oder Solaris auf Sparc-Architekturen erzeugten Dateisysteme.
fr: Pour les systèmes de fichiers créés par SunOS ou Solaris sur Sparc.
pl: Do systemów plików utworzonych przez SunOS lub Solaris na komputerze Sparc.
uk: Для файлових систем, які створено SunOS або Solaris у Sparc.

source: For filesystems created by Solaris on x86.
de: für die von Solaris auf x86-Architekturen erzeugten Dateisysteme.
fr: Pour les systèmes de fichiers créés par Solaris sur x86.
pl: Do systemów plików utworzonych przez Solaris na x86.
uk: Для файлових систем, які створено Solaris у x86.

source: For filesystems created by HP-UX, read-only.
de: für die von HP-UX erzeugten Dateisysteme, nur lesbar.
fr: Pour les systèmes de fichiers créés par HP-UX, lecture seule.
pl: Do systemów plików utworzonych przez HP-UX, tylko do odczytu.
uk: Для файлових систем, які створено HP-UX, лише читання.

source: For filesystems created by NeXTStep (on NeXT station) (currently read only).
de: für die von NeXTStep erzeugten Dateisysteme (auf der NeXTstation, gegenwärtig nur lesbar).
fr: Pour les systèmes de fichiers créés par NeXTStep (station NeXT) (lecture seule actuellement).
pl: Do systemów plików utworzonych przez NeXTStep (na stacji roboczej NeXT) (obecnie tylko do odczytu).
uk: Для файлових систем, які створено NeXTStep (на станції NeXT) (у поточній версії лише читання).

source: For NextStep CDROMs (block_size == 2048), read-only.
de: für NextStep-CDROMs (Blockgröße == 2048), nur lesbar.
fr: Pour les CD-ROM NeXTStep (block_size == 2048) (lecture seule).
pl: Do CD-ROM-ów NextStep (block_size == 2048), tylko do odczytu.
uk: Для CDROM-ів NextStep (block_size == 2048), лише читання.

source: For filesystems created by OpenStep (currently read only). The same filesystem type is also used by macOS.
de: für die von OpenStep erzeugten Dateisysteme (gegenwärtig nur lesbar). Der gleiche Dateisystemtyp wird auch von macOS verwendet.
fr: Pour les systèmes de fichiers créés par OpenStep (lecture seule actuellement). Le même système de fichiers est aussi utilisé par macOS.
uk: Для файлових систем, які створено OpenStep (у поточній версії лише читання). Той самий тим файлової системи також використовує macOS.

source: B<onerror=>I<value>
de: B<onerror=>I<Wert>
fr: B<onerror=>I<valeur>
pl: B<onerror=>I<wartość>
uk: B<onerror=>I<значення>

source: Set behavior on error:
de: legt das Verhalten bei Fehlern fest:
fr: Définir le comportement en cas d'erreur :
pl: Ustala zachowanie w przypadku błędu:
uk: Встановити поведінку у відповідь на помилку:

source: If an error is encountered, cause a kernel panic.
de: löst ein »kernel panic« aus, wenn ein Fehler auftritt.
fr: Déclencher une panique du noyau en cas d'erreur.
pl: Jeśli napotkano błąd, powoduje panikę jądra.
uk: Якщо трапилася помилка, ініціювати паніку ядра системи.

source: These mount options don\(cqt do anything at present; when an error is encountered only a console message is printed.
de: ist momentan unwirksam; beim Auftreten eines Fehlers wird lediglich eine Konsolenmeldung ausgegeben.
fr: Ces options ne font rien pour le moment ; seul un message est affiché sur la console en cas d'erreur.
pl: Te opcje montowania teraz nic nie robią: po napotkaniu błędu wypisują tylko komunikat na konsoli.
uk: У поточній версії ці параметри не виконують ніяких функцій. Якщо буде виявлено помилку, програма лише виведе повідомлення до консолі.

source: Mount options for umsdos
de: Einhängeoptionen für UMSDOS
fr: Options de montage pour umsdos
pl: Opcje montowania do umsdos
uk: Параметри монтування umsdos

source: See mount options for msdos. The B<dotsOK> option is explicitly killed by I<umsdos>.
de: Siehe die Einhängeoptionen für MSDOS. Die Option B<dotsOK> wird durch I<umsdos> explizit unwirksam.
fr: Consultez les options de montage pour I<msdos>. L'option B<dotsOK> est explicitement supprimée par I<umsdos>.
pl: Zobacz opcje do msdos. Opcja B<dotsOK> jest jawnie ubijana przez I<umsdos>.
uk: Див. параметри монтування для msdos. Параметр B<dotsOK> явним чином знищується I<umsdos>.

source: Mount options for vfat
de: Einhängeoptionen für VFAT
fr: Options de montage pour vfat
pl: Opcje montowania do vfat
uk: Параметри монтування vfat

source: First of all, the mount options for I<fat> are recognized. The B<dotsOK> option is explicitly killed by I<vfat>. Furthermore, there are
de: Zuerst werden die Einhängeoptionen für I<fat> berücksichtigt. Die Option B<dotsOK> wird bei I<vfat> explizit unwirksam. Weiterhin gibt es
fr: Tout d'abord les options de montage pour I<fat> sont reconnues. L'option B<dotsOK> est explicitement supprimée par I<vfat>. De plus, il existe :
pl: Przede wszystkim, rozpoznawane są wszystkie opcje do I<fat>. Opcja B<dotsOK> jest jawnie ubijana przez I<vfat>. Ponadto istnieją
uk: Перш за все, буде розпізнано параметри монтування для I<fat>. Параметр B<dotsOK> буде явним чином прибрано вибором I<vfat>. Далі, є

source: Translate unhandled Unicode characters to special escaped sequences. This lets you backup and restore filenames that are created with any Unicode characters. Without this option, a \(aq?\(aq is used when no translation is possible. The escape character is \(aq:\(aq because it is otherwise invalid on the vfat filesystem. The escape sequence that gets used, where u is the Unicode character, is: \(aq:\(aq, (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
de: übersetzt unbehandelte Unicode-Zeichen in spezielle Escape-Sequenzen. Dadurch können Sie Dateinamen sichern und wiederherstellen, die aus beliebigen Unicode-Zeichen erzeugt wurden. Ohne diese Option wird ein »?« verwendet, wenn keine Übersetzung möglich ist. Das Maskierungszeichen ist »:«, weil es ansonsten im VFAT-Dateisystem unzulässig ist. Die verwendete Escape-Sequenz ist »:«, (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12), wobei »u« das Unicode-Zeichen ist.
fr: Conversion des caractères Unicode non gérés en séquences d'échappement spéciales. Cela permet de sauver et de restaurer des fichiers dont le nom contient n'importe quel caractère Unicode. Sans cette option, un « ? » est utilisé à la place des caractères dont la conversion est impossible. Le caractère d'échappement est « : » puisqu'il est de toute manière incorrect dans les noms de fichiers I<vfat>. La séquence d'échappement utilisée pour remplacer le caractère Unicode u est : « : », (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
pl: Tłumaczy nieobsługiwane znaki Unikodu na specjalne sekwencje unikowe. To umożliwia wykonywanie kopii zapasowych i odtwarzanie plików o nazwach, utworzonych ze znakami Unikodu. Bez tej opcji, w wypadku braku możliwości konwersji używane jest '?'. Znakiem unikowym jest ':', ponieważ na systemie vfat jest w innych wypadkach nieprawidłowy. Sekwencja specjalna, która byłaby użyta dla znaku u, gdzie u jest znakiem Unikodu to: ':', (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
uk: Перетворити непридатні до обробки символи Unicode на спеціальні екрановані послідовності символів. Це надасть вам змогу створювати резервні копії і відновлювати з них назви файлів, які створено із будь-якими символами Unicode. Без цього параметра, якщо перетворення неможливе, для символів буде використано «?». Символом екранування є «:», оскільки інші символи у файловій системі vfat будуть некоректними. Екрановані послідовності, які буде використано, з позначенням символу Unicode літерою u: «:», (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).

source: Allow two files with names that only differ in case. This option is obsolete.
de: ermöglicht das Vorhandensein zweier Dateien, deren Namen sich nur hinsichtlich Groß-/Kleinschreibung unterscheiden. Diese Option ist veraltet.
fr: Autoriser l'existence de deux fichiers dont les noms ne diffèrent que par une distinction majuscule/minuscule. Cette option est obsolète.
pl: Pozwala, by dwa pliki miały nazwy różniące się tylko wielkością liter. Ta opcja jest przestarzała.
uk: Дозволити два файли із назвами, які відрізняються лише регістром символів. Цей параметр є застарілим.

source: First try to make a short name without sequence number, before trying I<name~num.ext>.
de: versucht zuerst, einen Kurznamen ohne Sequenznummer zu erzeugen, bevor I<Name~Num.Erw> versucht wird.
fr: Essayer d'abord de créer un nom court sans numéro de séquence avant d'essayer I<nom~num.ext>.
pl: Zanim zacznie próbować I<nazwa~nr.roz> najpierw próbuje zrobić krótką nazwę bez numeru kolejnego.
uk: Спочатку спробувати створити коротку назву без номера у послідовності, перш ніж спробувати I<назва~номер.суфікс>.

source: UTF8 is the filesystem safe 8-bit encoding of Unicode that is used by the console. It can be enabled for the filesystem with this option or disabled with utf8=0, utf8=no or utf8=false. If I<uni_xlate> gets set, UTF8 gets disabled.
de: UTF8 ist die dateisystemsichere 8-Bit-Kodierung von Unicode, die in der Konsole verwendet wird. Sie kann mit dieser Option für das Dateisystem aktiviert oder mit »utf8=0«, »utf8=no« oder »utf8=false« deaktiviert werden. Wenn »uni_xlate« gesetzt wird, dann wird UTF8 deaktiviert.
fr: UTF-8 est l'encodage 8-bits sûr de l'Unicode du système de fichiers utilisé par la console. Il peut être activé pour le système de fichiers avec cette option ou désactivé avec B<utf8=0>, B<utf8=no> ou B<utf8=false>. Si B<uni_xlate> est activé, UTF-8 est désactivé.
pl: UTF8 jest systemem plików bezpiecznego 8-bitowego kodowania Unikodu, który jest wykorzystywany przez konsolę. Tą opcją można go włączyć dla danego systemu plików lub wyłączyć za pomocą utf8=0, utf8=no lub utf8=false. Jeśli zostanie ustawione I<uni_xlate>, UTF8 jest wyłączane.
uk: UTF8 — безпечне щодо файлових системи 8-бітове кодування Unicode, яке використовує консоль. Його можна увімкнути для файлової системи за допомогою цього параметра або вимкнути за допомогою utf8=0, utf8=no або utf8=false. Якщо встановлено I<uni_xlate>, UTF8 буде вимкнено.

source: Defines the behavior for creation and display of filenames which fit into 8.3 characters. If a long name for a file exists, it will always be the preferred one for display. There are four I<mode>s:
de: definiert das Verhalten beim Erzeugen und Anzeigen von Dateinamen im 8.3-Schema. Falls ein Langname für eine Datei existiert, wird dieser für die Anzeige stets bevorzugt. Es gibt vier I<Modi>:
fr: Définir le comportement pour la création et l'affichage des noms de fichiers qui tiennent dans I<8.3> (1 à 8 caractères, un point et 0 à 3 caractères). Le nom long du fichier sera toujours le préféré pour l’affichage s'il existe. Il y a quatre I<mode>s.
pl: Definiuje zachowanie w przypadku tworzenia i wyświetlania nazw plików mieszczących się w schemacie 8.3 znaków. Jeśli istnieje długa nazwa pliku, będzie zawsze preferowanym sposobem wyświetlania. Istnieją cztery I<tryb>y:
uk: Визначає поведінку при створенні і показу назв файлів, які відповідають критерію «8.3 символів». Якщо існує довга назва файла, перевагу при показі буде завжди віддано цій назві. Передбачено чотири I<режим>и:

source: Force the short name to lower case upon display; store a long name when the short name is not all upper case.
de: erzwingt die Kleinschreibung des Kurznamens in der Anzeige; speichert einen Langnamen, wenn der Kurzname nicht komplett in Großbuchstaben geschrieben ist.
fr: Afficher le nom court en minuscules ; enregistrer un nom long quand le nom court n'est pas entièrement en majuscules.
pl: Wymusza na krótkiej nazwie wyświetlanie jej za pomocą małych liter; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie.
uk: Примусово перетворювати літери короткої назви на малі при показі; зберігати довгу назву, якщо не усі символи короткої назви є літерами верхнього регістру.

source: Force the short name to upper case upon display; store a long name when the short name is not all upper case.
de: erzwingt die Großschreibung des Kurznamens in der Anzeige; speichert einen Langnamen, wenn der Kurzname nicht komplett in Großbuchstaben geschrieben ist.
fr: Afficher le nom court en majuscules ; enregistrer un nom long quand le nom court n'est pas entièrement en majuscules.
pl: Wymusza na krótkiej nazwie wyświetlanie jej za pomocą wielkich liter; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie.
uk: Примусово перетворювати літери короткої назви на великі при показі; зберігати довгу назву, якщо не усі символи короткої назви є літерами верхнього регістру.

source: Display the short name as is; store a long name when the short name is not all lower case or all upper case.
de: zeigt den Kurznamen an, so wie er ist; speichert einen Langnamen, wenn der Kurzname nicht komplett in Kleinbuchstaben geschrieben oder wenn er komplett in Großbuchstaben geschrieben ist.
fr: Afficher le nom court tel quel ; enregistrer un nom long quand le nom court n'est pas entièrement en majuscules ou entièrement en minuscules.
pl: Wyświetla krótką nazwę bez zmian; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie lub nie wszystkie są małe.
uk: Показувати коротку назву без змін; зберігати довгу назву, якщо не усі символи короткої назви є літерами нижнього або верхнього регістру.

source: Display the short name as is; store a long name when the short name is not all upper case. This mode is the default since Linux 2.6.32.
de: zeigt den Kurznamen an, so wie er ist; speichert einen Langnamen, wenn der Kurzname nicht komplett in Großbuchstaben geschrieben ist. Dieser Modus ist das Standardverhalten seit Linux 2.6.32.
fr: Afficher le nom court tel qu'il est ; enregistrer un nom long quand le nom court n'est pas entièrement en majuscules. C'est le mode par défaut depuis Linux 2.6.32.
pl: Wyświetla krótką nazwę bez zmian; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie. Ten tryb jest domyślny od Linuksa 2.6.32.
uk: Показувати коротку назву без змін; зберігати довгу назву, якщо не усі символи короткої назви є літерами верхнього регістру. Цей режим є типовим, починаючи з Linux 2.6.32.

source: Mount options for usbfs
de: Einhängeoptionen für Usbfs
fr: Options de montage pour usbfs
pl: Opcje montowania do usbfs
uk: Параметри монтування usbfs

source: B<devuid=>I<uid> and B<devgid=>I<gid> and B<devmode=>I<mode>
de: B<devuid=>I<UID> und B<devgid=>I<GID> und B<devmode=>I<Modus>
fr: B<devuid=>I<uid>, B<devgid=>I<gid> et B<devmode=>I<mode>
pl: B<devuid=>I<uid> i B<devgid=>I<gid> i B<devmode=>I<tryb>
uk: B<devuid=>I<uid> і B<devgid=>I<gid>, і B<devmode=>I<режим>

source: Set the owner and group and mode of the device files in the usbfs filesystem (default: uid=gid=0, mode=0644). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der Gerätedateien im Usbfs-Dateisystem (Standard: UID=GID=0, Modus=0644). Der Modus wird in oktaler Notation angegeben.
fr: Définir le propriétaire, le groupe et le mode des fichiers de périphérique dans le système de fichiers usbfs (valeurs par défaut : B<uid=gid=0>, B<mode=0644>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb plików w plikach urządzeń systemu plików usbfs (domyślnie: uid=gid=0, mode=0644). Tryb jest podany ósemkowo.
uk: Встановити власника і групу файлів пристроїв у файловій системі usbfs (типові значення: uid=gid=0, mode=0644). Режим слід вказувати у вісімковій формі.

source: B<busuid=>I<uid> and B<busgid=>I<gid> and B<busmode=>I<mode>
de: B<busuid=>I<UID> und B<busgid=>I<GID> und B<busmode=>I<Modus>
fr: B<busuid=>I<uid>, B<busgid=>I<gid> et B<busmode=>I<mode>
pl: B<busuid=>I<uid> i B<busgid=>I<gid> i B<busmode=>I<tryb>
uk: B<busuid=>I<uid> і B<busgid=>I<gid>, і B<busmode=>I<режим>

source: Set the owner and group and mode of the bus directories in the usbfs filesystem (default: uid=gid=0, mode=0555). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der Bus-Verzeichnisse im Usbfs-Dateisystem (Standard: UID=GID=0, Modus=0555). Der Modus wird in oktaler Notation angegeben.
fr: Définir le propriétaire, le groupe et le mode des répertoires des bus dans le système de fichiers usbfs (valeurs par défaut : B<uid=gid=0>, B<mode=0555>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb plików w katalogach szyny (bus) systemu plików usbfs (domyślnie: uid=gid=0, mode=0555). Tryb podany jest ósemkowo.
uk: Встановити власника і групу каталогів шин у файловій системі usbfs (типові значення: uid=gid=0, mode=0555). Режим слід вказувати у вісімковій формі.

source: B<listuid=>I<uid> and B<listgid=>I<gid> and B<listmode=>I<mode>
de: B<listuid=>I<UID> und B<listgid=>I<GID> und B<listmode=>I<Modus>
fr: B<listuid=>I<uid>, B<listgid=>I<gid> et B<listmode=>I<mode>.
pl: B<listuid=>I<uid> i B<listgid=>I<gid> i B<listmode=>I<tryb>
uk: B<listuid=>I<uid> і B<listgid=>I<gid>, і B<listmode=>I<режим>

source: Set the owner and group and mode of the file I<devices> (default: uid=gid=0, mode=0444). The mode is given in octal.
de: setzt Benutzer (UID) und Gruppe (GID) sowie den Modus der I<Gerät>-Dateien (Standard: UID=GID=0, Modus=0444). Der Modus wird in oktaler Notation angegeben.
fr: Configurer le propriétaire, le groupe et le mode du fichier I<devices> (valeurs par défaut : B<uid=gid=0>, B<mode=0444>). Le mode est fourni en octal.
pl: Ustawia właściciela i grupę i tryb pliku I<devices> (domyślnie: uid=gid=0, mode=0444). Tryb jest podany ósemkowo.
uk: Встановити власника і групу, а також режим файлових I<пристроїв> (типові значення: uid=gid=0, mode=0444). Режим слід вказувати у вісімковій формі.

source: DM-VERITY SUPPORT
de: DM-VERITY-UNTERSTÜTZUNG
fr: GESTION DE DM-VERITY
uk: ПІДТРИМКА DM-VERITY
