Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: I<This disables / enables the use of write barriers in the journaling code. >B<barrier=none>I< disables, >B<barrier=flush>I< enables (default). This also requires an IO stack which can support barriers, and if reiserfs gets an error on a barrier write, it will disable barriers again with a warning. Write barriers enforce proper on-disk ordering of journal commits, making volatile disk write caches safe to use, at some performance penalty. If your disks are battery-backed in one way or another, disabling barriers may safely improve performance.>
de: I<deaktiviert oder aktiviert die Verwendung von Schreibgrenzen im Journaling-Code, wobei »barrier=none« deaktiviert und »barrier=flush« aktiviert (Standard). Dies erfordert auch einen Ein-/Ausgabe-Stack, der Grenzen unterstützt, und falls Reiserfs einen Fehler an einer Schreibgrenze erkennt, deaktiviert es die Grenzen wieder und gibt eine Warnung aus. Schreibgrenzen bewirken saubere datenträgerbezogene Journal-Schreibvorgänge, wodurch flüchtige Platten-Schreibzwischenspeicher sicher benutzbar werden, allerdings auf Kosten der Performance. Falls Ihre Platten auf die eine oder andere Weise batteriegestützt sind, kann die Deaktivierung dieser Grenzen sicher die Performance verbessern.>
fr: I<Désactiver> (B<barrier=none>) I<ou activer> (B<barrier=flush>, I<par défaut) l'utilisation des barrières d'écriture dans le code de journalisation. Cela nécessite aussi une pile d'entrées et sorties qui peut gérer les barrières, et si ReiserFS rencontre une erreur sur une barrière d'écriture, elle désactivera de nouveau les barrières avec un avertissement. Les barrières d'écriture renforcent l'ordre correct des inscriptions au journal sur le disque, permettant d'utiliser en sécurité les caches d'écriture volatils du disque, au prix de quelques pertes en performance. Si les disques sont alimentés sans interruption d'une façon ou d'une autre, désactiver les barrières permet d'augmenter sans danger les performances.>
uk: I<Вимикає або вмикає використання бар'єрів для запису у коді ведення журналу. >B<barrier=none>I< вимикає, >B<barrier=flush>I< вмикає (типовий варіант). Реалізація можливості потребує також підтримки бар'єрів у стосі введення-виведення. Якщо у reiserfs станеться помилка під час бар'єрного запису, файлова система знову вимкне бар'єри з повідомленням-попередженням. Бар'єри запису примусово встановлюють належне упорядкування внесків до журналу на диску, що робить безпечним кешування запису на тимчасові диски за рахунок певної втрати швидкості. Якщо ваші диски у певний спосіб забезпечено живленням від акумуляторів, вимикання бар'єрів може без втрати убезпечення зберігання даних дещо підвищити швидкодію.>

source: Mount options for ubifs
de: Einhängeoptionen für Ubifs
fr: Options de montage pour ubifs
pl: Opcje montowania do ubifs
uk: Параметри монтування ubifs

source: UBIFS is a flash filesystem which works on top of UBI volumes. Note that B<atime> is not supported and is always turned off.
de: UBIFS ist ein Dateisystem für Flash-Speicher, das auf UBI-Datenträgern arbeitet. Beachten Sie, dass B<atime> nicht unterstützt wird und immer abgeschaltet ist.
fr: UBIFS est un système de fichiers pour mémoire flash qui fonctionne au-dessus des volumes UBI. Remarquez qu’B<atime> n'est pas pris en charge et donc toujours désactivé.
pl: UBIFS jest systemem plików flash, którzy działa na woluminach UBI. Proszę zauważyć, że B<atime> nie jest obsługiwane i jest zawsze wyłączone.
uk: UBIFS — файлова система для флеш-носіїв, які працюють на базі томів UBI. Зауважте, що підтримки B<atime> не передбачено, і цей параметр завжди вимкнено.

source: The device name may be specified as
de: Der Gerätename kann folgendermaßen angegeben werden:
fr: Le nom de périphérique peut être indiqué comme :
pl: Nazwa urządzenia może zostać podana jako
uk: Назву пристрою можна вказати як

source: B<ubiX_Y>
fr: B<ubiX>I<Y>

source: UBI device number B<X>, volume number B<Y>
de: UBI-Gerätenummer B<X>, Datenträgernummer B<Y>
fr: numéro de périphérique UBI B<X>, numéro de volume I<Y> ;
pl: numer urządzenia UBI B<X>, numer woluminu B<Y>
uk: Номер пристрою UBI B<X>, номер тому B<Y>

source: B<ubiY>
fr: B<ubi>I<Y>

source: UBI device number B<0>, volume number B<Y>
de: UBI-Gerätenummer B<0>, Datenträgernummer B<Y>
fr: numéro de périphérique UBI B<0>, numéro de volume I<Y> ;
pl: numer urządzenia UBI B<0>, numer woluminu B<Y>
uk: Номер пристрою UBI B<0>, номер тому B<Y>

source: B<ubiX:NAME>
fr: B<ubi>I<X>B<:>I<NOM>
pl: B<ubiX:NAZWA>
uk: B<ubiX:НАЗВА>

source: UBI device number B<X>, volume with name B<NAME>
de: UBI-Gerätenummer B<X>, Datenträger mit dem Namen B<NAME>
fr: numéro de périphérique UBI I<X>, nom de volume I<NOM> ;
pl: numer urządzenia UBI B<X>, wolumin o nazwie B<NAZWA>
uk: Номер пристрою UBI B<X>, том із назвою B<НАЗВА>

source: B<ubi:NAME>
fr: B<ubi:>I<NOM>
pl: B<ubi:NAZWA>
uk: B<ubi:НАЗВА>

source: UBI device number B<0>, volume with name B<NAME>
de: UBI-Gerätenummer B<0>, Datenträger mit dem Namen B<NAME>
fr: numéro de périphérique UBI B<0>, nom de volume I<NOM>.
pl: numer urządzenia UBI B<0>, wolumin o nazwie B<NAZWA>
uk: Номер пристрою UBI B<0>, том із назвою B<НАЗВА>

source: Alternative B<!> separator may be used instead of B<:>.
de: Alternativ kann B<!> als Trenner anstelle von B<:> angegeben werden.
fr: Un séparateur B<!> peut être utilisé à la place de B<:>.
pl: Zamiast B<:> można użyć separatora B<!>.
uk: Можна використовувати альтернативний роздільник B<!> замість B<:>.

source: The following mount options are available:
de: Die folgenden Einhängeoptionen sind verfügbar:
fr: Les options de montages suivantes sont disponibles :
pl: Dostępne są następujące opcje montowania:
uk: Можна скористатися одним з таких параметрів монтування:

source: Enable bulk-read. VFS read-ahead is disabled because it slows down the filesystem. Bulk-Read is an internal optimization. Some flashes may read faster if the data are read at one go, rather than at several read requests. For example, OneNAND can do "read-while-load" if it reads more than one NAND page.
de: aktiviert Lesen in einem Zug. Vorauslesen im VFS ist deaktiviert, weil es das Dateisystem ausbremst. Lesen in einem Zug ist eine interne Optimierung. Einige Flash-Speicher könnten schneller lesen, wenn die Daten in einem Zug anstatt in mehreren Vorgängen gelesen werden. Zum Beispiel kann OneNAND »Lesen-beim-Laden« ausführen, wenn es mehr als eine NAND-Seite liest.
fr: Activer la lecture en masse. La lecture en avance (« readahead ») de système de fichiers virtuel est désactivée car elle ralentit le système de fichiers. La lecture en masse est une optimisation interne. Certaines mémoires flash peuvent être plus rapides en lecture si les données sont lues en une fois, plutôt que lors de requêtes successives. Par exemple, OneNAND permet la lecture en charge (« read-while-load ») si plus d'une page NAND est lue.
pl: Włącza bulk-read. Odczyt z wyprzedzeniem VFS jest wyłączony, ponieważ zwalnia on system plików. Bulk-Read jest wewnętrzną optymalizacją. Część pamięci flash może czytać szybciej, jeśli dane są odczytywane za jednym razem, zamiast przy użyciu kilku żądań odczytu. Na przykład OneNAND może wykonać "read-while-load" gdy czyta więcej niż jedną stronę NAND.
uk: Увімкнути пакетне читання. Випереджальне читання VFS вимкнено, оскільки воно уповільнює роботу файлової системи. Пакетне читання є внутрішньою оптимізацією. Читання з деяких флеш-накопичувачів може бути швидшим, якщо дані буде прочитано у один прохід, а не з використанням декількох запитів щодо читання. Наприклад, OneNAND може виконувати дію «читання під час завантаження», якщо читає декілька сторінок NAND одразу.

source: Do not bulk-read. This is the default.
de: deaktiviert Lesen in einem Zug. Dies ist der Standard.
fr: Pas de lecture en masse. C'est le comportement par défaut.
pl: Nie wykonuje bulk-read. Tak jest domyślne.
uk: Не виконувати пакетного читання. Це типова поведінка.

source: Check data CRC-32 checksums. This is the default.
de: überprüft die CRC-32-Prüfsummen der Daten. Dies ist die Voreinstellung.
fr: Vérifier les sommes de contrôle CRC-32 des données. C'est le comportement par défaut.
pl: Sprawdza sumy kontrolne CRC-32 danych. Tak jest domyślnie.
uk: Перевірити контрольні суми CRC-32 даних. Це типова поведінка.

source: Do not check data CRC-32 checksums. With this option, the filesystem does not check CRC-32 checksum for data, but it does check it for the internal indexing information. This option only affects reading, not writing. CRC-32 is always calculated when writing the data.
de: überprüft keine CRC-32-Prüfsummen der Daten. Mit dieser Option prüft das Dateisystem zwar die CRC-Prüfsummen der Daten nicht, aber es überprüft sie für die internen Indizierungsinformationen dennoch. Diese Option wirkt sich nur auf das Lesen aus, jedoch nicht auf das Schreiben. CRC-32-Prüfsummen werden beim Schreiben der Daten immer errechnet.
fr: Ne pas vérifier les sommes de contrôle CRC-32 des données. Avec cette option, le système de fichiers ne vérifie pas de somme de contrôle pour les données, mais il la vérifie pour les renseignements d'indexation internes. Cette option ne concerne que la lecture, pas l'écriture. CRC-32 est toujours calculé lors de l'écriture de données.
pl: Nie sprawdza sum kontrolnych CRC-32 danych. Z tą opcją system plików nie sprawdza sum kontrolnych CRC-32 danych, lecz sprawdza je w celu wewnętrznej informacji indeksowania. Opcja wpływa jedynie na odczyt, nie na zapis. Sumy CRC-32 są obliczane zawsze podczas zapisu danych.
uk: Не перевіряти контрольні суми CRC-32 даних. Із цим параметром файлова система не перевірятиме контрольні суми CRC-32 даних, але виконуватиме перевірку на внутрішні дані індексування. Цей параметр стосується лише читання, а не записування. Під час записування даних обчислення CRC-32 відбуватиметься завжди.

source: Select the default compressor which is used when new files are written. It is still possible to read compressed files if mounted with the B<none> option.
de: wählt den Standardkompressor, der beim Schreiben neuer Dateien verwendet wird. Es ist immer noch möglich, komprimierte Dateien zu lesen, wenn diese mit der Option B<none> eingehängt sind.
fr: Sélectionner le type de compression à utiliser lorsque les nouveaux fichiers sont écrits. La lecture de fichiers compressés est toujours possible lors d'un montage avec l'option B<none>.
pl: Wybiera domyślny tryb kompresji używany podczas zapisywania nowych plików. Nadal da się odczytać skompresowane pliki, jeśli montowanie będzie wykonane z opcją B<none>.
uk: Вибрати типовий засіб стискання, який буде використано при записуванні нових файлів. Стиснуті файли все ще можна буде прочитати, якщо змонтувати файлову систему із параметром B<none>.

source: Mount options for udf
de: Einhängeoptionen für UDF
fr: Options de montage pour udf
pl: Opcje montowania do udf
uk: Параметри монтування udf

source: UDF is the "Universal Disk Format" filesystem defined by OSTA, the Optical Storage Technology Association, and is often used for DVD-ROM, frequently in the form of a hybrid UDF/ISO-9660 filesystem. It is, however, perfectly usable by itself on disk drives, flash drives and other block devices. See also I<iso9660>.
de: UDF ist ein von OSTA, der »Optical Storage Technology Association« definiertes »Universal Disk Format«-Dateisystem. Es wird oft für DVD-ROMs verwendet, häufig in der Form eines hybriden UDF/ISO-9660-Dateisystems. Es ist jedoch auch für sich allein perfekt auf Plattenlaufwerken, Flash-Speichern und anderen blockorientierten Geräten nutzbar. Siehe auch I<iso9660>.
fr: UDF est le système de fichiers « Universal Disk Format », défini par l'Optical Storage Technology Association, et est souvent utilisé pour les DVD-ROM, fréquemment sous la forme d’un système de fichiers hybride UDF/ISO-9660. Il est, cependant, parfaitement utilisable tout seul sur des périphériques de disque, des périphériques flash et d’autres périphériques blocs. Consultez aussi I<iso9660>.
uk: UDF — скорочення від «Universal Disk Format» (універсальний формат дисків). Цю файлову систему стандартизовано OSTA, Optical Storage Technology Association (Асоціацією технології оптичного зберігання даних). Файлову систему часто використовують для DVD-ROM у формі гібриду із файловою системою UDF/ISO-9660. Втім, файловою системою цілком можна користуватися для дискових носіїв даних, флеш-носіїв та інших блокових пристроїв. Див. також I<iso9660>.

source: Make all files in the filesystem belong to the given user. uid=forget can be specified independently of (or usually in addition to) uid=E<lt>userE<gt> and results in UDF not storing uids to the media. In fact the recorded uid is the 32-bit overflow uid -1 as defined by the UDF standard. The value is given as either E<lt>userE<gt> which is a valid user name or the corresponding decimal user id, or the special string "forget".
de: ordnet alle Dateien im Dateisystem dem angegebenen Benutzer zu. Sie können »uid=forget« unabhängig von (oder üblicherweise zusätzlich zu) uid=E<lt>BenutzerE<gt> angeben, wodurch UDF keine UIDs auf dem Medium speichert. Faktisch ist die aufgezeichnete UID die 32-Bit-Überlauf-UID -1, wie sie im UDF-Standard definiert ist. Der Wert wird entweder als E<lt>BenutzerE<gt> angegeben, welches ein gültiger Benutzername sein muss oder die korrespondierende dezimale Benutzerkennung oder die spezielle Zeichenkette »forget«.
fr: Faire que tous les fichiers du système de fichiers appartiennent à l’utilisateur indiqué. B<uid=>I<forget> peut être indiqué indépendamment (ou habituellement en plus) de B<uid=>E<lt>I<utilisateur>E<gt>, et aboutit à ce qu’UDF n’enregistre pas les UID sur le média. En fait, l’UID enregistré est l’excédent 32 bits I<uid -1> comme défini dans la norme UDF. La valeur est donnée soit par E<lt>I<utilisateur>E<gt> qui est un nom d’utilisateur autorisé, soit l’identifiant décimal d’utilisateur correspondant ou la chaîne spéciale « I<forget> ».
uk: Зробити власником усіх файлів у файловій системі вказаного користувача. Окремо від (а, зазвичай, на додачу до) uid=E<lt>користувачE<gt>, можна вказати uid=forget. У результаті UDF не зберігатиме uid на носії даних. Фактично, записаний uid є 32-бітовим переповненням uid -1, як його визначено у стандарті UDF. Значення можна вказувати або як E<lt>користувачE<gt>, де слід використати чинну назву облікового запису користувача, або у формі відповідного десяткового ідентифікатора користувача, або у формі спеціального рядка «forget».

source: Make all files in the filesystem belong to the given group. gid=forget can be specified independently of (or usually in addition to) gid=E<lt>groupE<gt> and results in UDF not storing gids to the media. In fact the recorded gid is the 32-bit overflow gid -1 as defined by the UDF standard. The value is given as either E<lt>groupE<gt> which is a valid group name or the corresponding decimal group id, or the special string "forget".
de: ordnet alle Dateien im Dateisystem der angegebenen Gruppe zu. Sie können »gid=forget« unabhängig von (oder üblicherweise zusätzlich zu) uid=E<lt>GruppeE<gt> angeben, wodurch UDF keine GID auf dem Medium speichert. Faktisch ist die aufgezeichnete GID die 32-Bit-Überlauf-GID -1, wie sie im UDF-Standard definiert ist. Der Wert wird entweder als E<lt>GruppeE<gt> angegeben, welches ein gültiger Gruppenname sein muss oder die korrespondierende dezimale Gruppenkennung oder die spezielle Zeichenkette »forget«.
fr: Faire que tous les fichiers du système de fichiers appartiennent au groupe indiqué. B<gid=>I<forget> peut être indiqué indépendamment (ou habituellement en plus) de B<uid=>E<lt>I<groupe>E<gt>, et aboutit à ce qu’UDF n’enregistre pas les GID sur le média. En fait, le GID enregistré est l’excédent 32 bits I<gid -1> comme défini dans la norme UDF. La valeur est donnée soit par E<lt>I<groupe>E<gt> qui est un nom de groupe autorisé, soit l’identifiant décimal de groupe correspondant ou la chaîne spéciale « I<forget> ».
uk: Зробити власницею усіх файлів у файловій системі вказану групу. Окремо від (а, зазвичай, на додачу до) gid=E<lt>групаE<gt>, можна вказати gid=forget. У результаті UDF не зберігатиме gid на носії даних. Фактично, записаний gid є 32-бітовим переповненням gid -1, як його визначено у стандарті UDF. Значення можна вказувати або як E<lt>групаE<gt>, де слід використати чинну назву групи, або у формі відповідного десяткового ідентифікатора групи, або у формі спеціального рядка «forget».

source: Mask out the given permissions from all inodes read from the filesystem. The value is given in octal.
de: maskiert die aus dem Dateisystem gelesenen Zugriffsrechte aller Inodes. Der Wert wird in oktaler Notation angegeben.
fr: Masquer les permissions indiquées de tous les inœuds lus du système de fichiers. La valeur est fournie sous forme octale.
uk: Замаскувати вказані права доступу для усіх inode, які прочитано з файлової системи. Значення слід вказувати у вісімковому форматі.

source: If B<mode=> is set the permissions of all non-directory inodes read from the filesystem will be set to the given mode. The value is given in octal.
de: setzt die aus dem Dateisystem gelesenen Zugriffsrechte aller Nicht-Verzeichnis-Inodes auf den angegebenen Modus, falls B<mode=> gesetzt ist. Der Wert wird in oktaler Notation angegeben.
fr: Si B<mode=> est défini, les permissions indiquées de tous les inœuds, non relatifs à un répertoire, lus du système de fichiers seront réglées au mode indiqué. La valeur est fournie sous forme octale.
uk: Якщо встановлено B<mode=>, права доступу до усіх inode, які не є inode каталогів, які прочитано з файлової системи, буде встановлено для заданого mode. Значення слід вказувати у вісімковому форматі.

source: If B<dmode=> is set the permissions of all directory inodes read from the filesystem will be set to the given dmode. The value is given in octal.
de: setzt die aus dem Dateisystem gelesenen Zugriffsrechte aller Verzeichnis-Inodes auf den angegebenen B<dmode=>. Der Wert wird in oktaler Notation angegeben.
fr: Si B<dmode=> est défini, les permissions indiquées de tous les inœuds de répertoire, lus du système de fichiers seront réglées au mode indiqué. La valeur est fournie sous forme octale.
uk: Якщо встановлено B<dmode=>, права доступу до усіх inode каталогів, які прочитано з файлової системи, буде встановлено для заданого dmode. Значення слід вказувати у вісімковому форматі.

source: Set the block size. Default value prior to kernel version 2.6.30 was 2048. Since 2.6.30 and prior to 4.11 it was logical device block size with fallback to 2048. Since 4.11 it is logical block size with fallback to any valid block size between logical device block size and 4096.
de: legt die Blockgröße fest. Der Standardwert war 2048 in Kernel-Versionen vor 2.6.30. Zwischen 2.6.30 und vor 4.11 war es die Blockgröße des logischen Gerätes mit Ausweichmöglichkeit auf 2048. Seit 4.11 ist es die Blockgröße des logischen Gerätes mit Ausweichmöglichkeit auf jede zulässige Blockgröße zwischen der Blockgröße des logischen Gerätes und 4096.
fr: Définir la taille de bloc. La valeur par défaut pour les versions antérieures à la version 2.6.30 du noyau était 2048. Depuis la version 2.6.30 et avant la version 4.11, c’était la taille de bloc logique de périphérique avec un repli à 2048. Depuis la version 4.11, c’est une taille de bloc logique avec un repli à n’importe taille de bloc autorisée entre la taille de bloc logique du périphérique et 4096.
uk: Встановити розмір блоку. Типовим значенням до версії ядра 2.6.30 було 2048. Починаючи з версії 2.6.30 і до версії 4.11, це був розмір блоку логічного пристрою із резервним значенням 2048. Починаючи з версії 4.11, це розмір логічного блоку із резервним значенням, яке дорівнює будь-якому розміру блоку від розміру блоку логічного пристрою до 4096.

source: For other details see the B<mkudffs>(8) 2.0+ manpage, see the B<COMPATIBILITY> and B<BLOCK SIZE> sections.
de: Für weitere Details siehe die Handbuchseite zu B<mkudffs>(8) 2.0+, Abschnitte B<COMPATIBILITY> und B<BLOCK SIZE>.
fr: Pour plus de détails, consultez le manuel de B<mkudffs>(8), version 2.0+, sections B<COMPATIBILITY> et B<BLOCK SIZE>.
uk: Щоб ознайомитися із іншими подробицями, прочитайте сторінку підручника B<mkudffs>(8) 2.0+, див. розділи B<СУМІСНІСТЬ> і B<РОЗМІР БЛОКУ>.

source: Show otherwise hidden files.
de: zeigt ansonsten verborgene Dateien an.
fr: Montrer les fichiers normalement cachés.
pl: Pokazuje pliki, które inaczej byłyby ukryte.
uk: Показувати приховані за інших умов файли.

source: Show deleted files in lists.
de: zeigt gelöschte Dateien in Listen an.
fr: Montrer les fichiers effacés.
pl: Pokazuje usunięte pliki na na listach.
uk: Показувати вилучені файли у списках.

source: Embed data in the inode. (default)
de: bettet Daten im Inode ein (Standard).
fr: Intégrer des données dans l’inœud (comportement par défaut).
uk: Вбудовувати дані до inode. (типова поведінка)

source: Don\(cqt embed data in the inode.
de: bettet keine Daten im Inode ein.
fr: Ne pas intégrer de données dans l’inœud.
uk: Не вбудовувати дані до inode.

source: Use short UDF address descriptors.
de: verwendet kurze UDF-Adressdeskriptoren.
fr: Utiliser des descripteurs d’adresse UDF courts.
uk: Скористатися скороченими дескрипторами адрес UDF.

source: Use long UDF address descriptors. (default)
de: verwendet lange UDF-Adressdeskriptoren (Standard).
fr: Utiliser des descripteurs d’adresse UDF longs (comportement par défaut).
uk: Використовувати довгі дескриптори адрес UDF. (типова поведінка)

source: Unset strict conformance.
de: setzt die strikte Konformität zurück.
fr: Ne pas utiliser une conformité stricte.
pl: Wyłącza ustawianie ścisłej zgodności.
uk: Скасувати строгу узгодженість.

source: Set the NLS character set. This requires kernel compiled with B<CONFIG_UDF_NLS> option.
de: legt den NLS-Zeichensatz fest. Dafür ist es notwendig, dass der Kernel mit der Option B<CONFIG_UDF_NLS> kompiliert wurde.
fr: Définir le jeu de caractères NLS. Cela nécessite que le noyau soit compilé avec l’option B<CONFIG_UDF_NLS>.
uk: Встановити набір символів NLS. Це потребує збирання ядра з параметром B<CONFIG_UDF_NLS>.

source: Set the UTF-8 character set.
de: legt den UTF-8-Zeichensatz fest.
fr: Définir le jeu de caractères à UTF-8.
pl: Ustawia zestaw znaków UTF-8.
uk: Встановити кодування UTF-8.

source: Mount options for debugging and disaster recovery
de: Einhängeoptionen für Fehlersuche (Debugging) und Notfallwiederherstellung
fr: Options de montage pour le débogage et la récupération après plantage
uk: Параметри монтування для діагностики і відновлення після аварій

source: Ignore the Volume Recognition Sequence and attempt to mount anyway.
de: ignoriert die »Volume Recognition Sequence« und versucht, trotzdem einzuhängen.
fr: Ignorer la séquence de reconnaissance de volume et monter malgré tout.
uk: Ігнорувати послідовність розпізнавання томів (VRS) і спробувати виконати монтування попри все.

source: Select the session number for multi-session recorded optical media. (default= last session)
de: wählt die Sitzungsnummer auf optischen Medien, die in Mehrfachsitzung aufgenommen sind (Standard: die letzte Sitzung).
fr: Choisir le numéro de session pour un média optique multi-session enregistré (par défaut, la dernière session).
uk: Вибрати номер сеансу для багатосеансового оптичного носія даних. (типове значення=номер останнього сеансу)

source: Override standard anchor location. (default= 256)
de: setzt den Standardort des Ankers außer Kraft (Standard: 256).
fr: Modifier l'emplacement des ancres standard (par défaut : 256).
pl: Przesłania położenie standardowego zakotwiczenia (anchor). (Domyślnie: 256)
uk: Перевизначити стандартне місце прив'язки. (типове значення= 256)
