Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: All options prefixed with "X-" are interpreted as comments or as userspace application-specific options. These options are not stored in user space (e.g., I<mtab> file), nor sent to the mount.I<type> helpers nor to the B<mount>(2) system call. The suggested format is B<X->I<appname>.I<option>.
de: Alle Optionen, denen ein »X-« vorangestellt ist, werden als Kommentare oder als anwendungsspezifische Optionen interpretiert. Diese Optionen werden weder auf Anwendungsebene gespeichert (zum Beispiel in der I<mtab>-Datei) noch an die mount.I<Typ>-Hilfsprogramme oder an den B<mount>(2)-Systemaufruf übergeben. Das empfohlene Format ist B<X->I<Anwendungsname>.I<Option>.
fr: Toutes les options précédées de B<X-> sont interprétées comme des commentaires ou des options spécifiques aux applications d’espace utilisateur. Ces options ne sont pas gardées dans l’espace utilisateur (par exemple, le fichier I<mtab>) et ne sont pas transmises aux auxiliaires B<mount.>I<type> ni aux appels système B<mount>(2). Le format suggéré est B<X->I<nom_application>B<.>I<option>.
pl: Wszystkie opcje poprzedzone "X-" są interpretowane jako komentarze lub opcje aplikacji działających w przestrzeni użytkownika. Opcje te nie są przechowywane w przestrzeni użytkownika (np. pliku I<mtab>), ani przekazywane do programów pomocniczych mount.I<typ>, ani też do wywołania systemowego B<mount>(2). Sugerowany format to B<x->I<nazwa-aplikacji>.I<opcja>.
uk: Усі параметри із префіксом «X-» вважатимуться коментарями або специфічними для програми параметрами простору користувача. Ці параметри не зберігаються у просторі користувача (наприклад, файлі I<mtab>), не надсилатиметься до допоміжних засобів mount.I<тип> і не передаватимуться системному виклику B<mount>(2). Рекомендованим форматом є B<X->I<назва_програми>.I<параметр>.

source: B<x->*
fr: B<x->I<*>

source: The same as B<X->* options, but stored permanently in user space. This means the options are also available for B<umount>(8) or other operations. Note that maintaining mount options in user space is tricky, because it\(cqs necessary use libmount-based tools and there is no guarantee that the options will be always available (for example after a move mount operation or in unshared namespace).
de: ist ähnlich den B<X->*-Optionen, bewirkt aber eine dauerhafte Speicherung auf Anwendungsebene. Das bedeutet, dass diese Optionen auch für B<umount>(8) und andere Aktionen zur Verfügung stehen. Beachten Sie, dass die Verwaltung der Einhängeoptionen auf Anwendungsebene etwas verzwickt sein kann, da es notwendig ist, Libmount-basierte Werkzeuge zu verwenden und nicht immer sichergestellt werden kann, dass die Optionen verfügbar sind (zum Beispiel nach dem Verschieben einer Einhängung oder in einem nicht gemeinsam genutzten Namensraum).
fr: La même chose qu’avec les options B<X->I<*>, mais avec un enregistrement permanent dans l’espace utilisateur. Cela signifie que les options sont aussi disponibles pour B<umount>(8) ou d’autres utilisations. Remarquez que conserver les options de montage en espace utilisateur est délicat, car il est nécessaire d’utiliser des outils basés sur B<libmount> et qu’il n’existe aucune garantie que les options seront toujours disponibles (par exemple, après une opération de déplacement de montage ou dans un espace utilisateur non partagé).
pl: Podobnie jak opcje B<X->*, lecz są przechowywane na stałe w przestrzeni użytkownika. Oznacza to, że opcje te są dostępne również dla B<umount>(8) lub do innych działań. Proszę zauważyć, że przechowywanie opcji montowania w przestrzeni użytkownika jest skomplikowane, ponieważ konieczne jest używanie narządzi korzystających z biblioteki libmount; nie ma też gwarancji, że te opcje będą zawsze dostępne (np. po operacji przeniesienia montowania lub w przestrzeni nazw, która nie jest współdzielona).
uk: Те саме, що і параметри B<X->*, але із постійним збереженням у просторі користувача. Це означає, що параметри також доступні для B<umount>(8) або інших програм. Зауважте, що супровід параметрів монтування у просторі користувача є непростим завданням, оскільки потрібно користуватися заснованими на libmount інструментами, і немає гарантії, що параметри будуть завжди доступними (наприклад, після дії з пересування монтування або у просторі назв без спільного користування даними).

source: Note that before util-linux v2.30 the x-* options have not been maintained by libmount and stored in user space (functionality was the same as for X-* now), but due to the growing number of use-cases (in initrd, systemd etc.) the functionality has been extended to keep existing I<fstab> configurations usable without a change.
de: Beachten Sie, dass vor der Version 2.30 von Util-linux die »x-*«-Optionen nicht von Libmount verwaltet und auf Anwendungsebene gespeichert wurden (die Funktionalität war die gleiche wie die von X-* jetzt), aber durch die wachsende Zahl an Anwendungsfällen (in Initrd, Systemd usw.) wurde die Funktionalität erweitert, um vorhandene I<fstab>-Konfigurationen ohne Änderung benutzbar zu halten.
fr: Remarquez qu’avant la version 2.30 d’B<util-linux> les options B<x->I<*> n’étaient pas conservées par B<libmount> et enregistrées en espace utilisateur (la fonctionnalité était la même que pour B<X->I<*> maintenant), mais à cause du nombre grandissant de cas d’utilisation (dans B<initrd>, B<systemd>, etc.), la fonctionnalité a été étendue pour conserver les configurations I<fstab> utilisables sans aucune modification.
pl: Proszę zauważyć, że przed util-linux v2.30 opcje x-* nie były utrzymywane przez libmount, ani przechowywane w przestrzeni użytkownika (czyli odpowiadały aktualnej opcji X-*), jednak ze względu na rosnącą liczbę zastosowań (w initrd, systemd itp.) funkcjonalność ta została rozszerzona, utrzymując działanie istniejących konfiguracji I<fstab> bez konieczności dokonywania zmian.
uk: Зауважте, що до util-linux версії 2.30 параметри x-* не супроводжуються libmount і зберігаються у просторі користувача (функціональні можливості у поточній версії ті самі, що і для X-*), але через зростання кількості випадків (у initrd, systemd тощо) функціональні можливості було розширено для підтримання придатності наявних налаштувань I<fstab> без змін.

source: Allow to make a target directory (mountpoint) if it does not exist yet. The optional argument I<mode> specifies the filesystem access mode used for B<mkdir>(2) in octal notation. The default mode is 0755. This functionality is supported only for root users or when B<mount> is executed without suid permissions. The option is also supported as B<x-mount.mkdir>, but this notation is deprecated since v2.30. See also B<--mkdir> command line option.
de: ermöglicht das Anlegen eines Zielverzeichnisses (Einhängepunktes), falls es noch nicht existiert. Das optionale Argument I<Modus> gibt für B<mkdir>(2) den Zugriffsmodus des Dateisystems in oktaler Notation an. Der Standardmodus ist 0755. Diese Funktionalität wird nur für Root-Benutzer unterstützt oder wenn B<mount> ohne SUID-Zugriffsrechte ausgeführt wird. Die Option wird auch in der Form B<x-mount.mkdir> unterstützt, diese Notation ist seit Version 2.30 veraltet. Siehe auch die Befehlszeilenoption B<--mkdir>.
fr: Permettre de créer un répertoire cible (point de montage) s’il n’existe pas encore. L’argument facultatif I<mode> indique le mode d’accès au système de fichiers utilisé pour B<mkdir>(2) en notation octale. Le mode par défaut est 0755. Cette fonctionnalité n’est prise en charge que pour le superutilisateur ou quand B<mount> est exécuté sans les droits setuid. Cette option est aussi prise en charge sous forme B<x-mount.mkdir>, mais cette notation est obsolète depuis la version 2.30.
uk: Дозволити створення каталогу призначення (точки монтування), якщо його ще не існує. Додатковий аргумент I<режим> визначає режим доступу до файлової системи, який буде використано у B<mkdir>(2), у вісімковій формі запису. Типовим режимом є 0755. Підтримку цієї функціональної можливості передбачено лише для користувача root або запуску B<mount> без прав доступу suid. Підтримку цього параметра також передбачено у формі B<x-mount.mkdir>, але ця форма вважається застарілою з версії 2.30. Див. також параметр рядка команди B<--mkdir>.

source: B<X-mount.subdir=>I<directory>
de: B<X-mount.subdir=>I<Verzeichnis>
fr: B<X-mount.subdir=>I<répertoire>
uk: B<X-mount.subdir=>I<каталог>

source: Allow mounting sub-directory from a filesystem instead of the root directory. For now, this feature is implemented by temporary filesystem root directory mount in unshared namespace and then bind the sub-directory to the final mount point and umount the root of the filesystem. The sub-directory mount shows up atomically for the rest of the system although it is implemented by multiple B<mount>(2) syscalls. This feature is EXPERIMENTAL.
de: erlaubt das Einhängen eines Unterverzeichnisses aus einem Dateisystem anstelle des Wurzelverzeichnisses. Derzeit ist diese Funktion durch das Einhängen eines temporären Wurzelverzeichnis-Dateisystems im »Unshared«-Namensraum, gefolgt durch das Bind-Einhängen des Unterverzeichnisses in den finalen Einhängepunkt und Aushängen der Dateisystemwurzel implementiert. Die Unterverzeichnis-Einhängung stellt sich für das umgebende System atomisch dar, obwohl es durch mehrere B<mount>(2)-Systemaufrufe implementiert ist. Diese Funktion ist als EXPERIMENTELL anzusehen.
fr: Permettre le montage d'un sous-répertoire à partir d'un système de fichiers plutôt qu'à partir du répertoire racine. Pour l'instant, cette fonctionnalité est implémentée par le montage temporaire du répertoire racine du système de fichiers dans un espace de noms non partagé, puis par le lien du sous-répertoire au point de montage final et par le démontage du répertoire racine du système de fichiers. Le montage du sous-répertoire est visible de façon atomique pour le reste du système bien qu'il soit implémenté par plusieurs appels système de B<mount>(2). Cette fonctionnalité est EXPÉRIMENTALE.
uk: Дозволити монтування підкаталогу з файлової системи, а не з кореневого каталогу. У поточній версії цю можливість реалізовано шляхом монтування тимчасової файлової системи кореневого каталогу у просторі назв без спільного користування з наступною прив'язкою підкаталогу до остаточної точки монтування і демонтування кореня файлової системи. Монтування підкаталогу буде показано для решти системи атомарно, хоча його реалізовано декількома системними викликами B<mount>(2). Ця можливість є ЕКСПЕРИМЕНТАЛЬНОЮ.

source: Do not follow symlinks when resolving paths. Symlinks can still be created, and B<readlink>(1), B<readlink>(2), B<realpath>(1), and B<realpath>(3) all still work properly.
de: folgt beim Auflösen von Pfaden keinen Symlinks. Symlinks können noch angelegt werden und B<readlink>(1), B<readlink>(2), B<realpath>(1) und B<realpath>(3) werden noch korrekt funktionieren.
fr: Ne pas suivre les liens symboliques lors de la résolution des chemins. Les liens symboliques peuvent toujours être créés et B<readlink>(1), B<readlink>(2), B<realpath>(1) et B<realpath>(3) fonctionnent toujours de manière appropriée.
pl: Nie podąża za dowiązaniami symbolicznymi, przy przetwarzaniu ścieżek. Wciąż można tworzyć dowiązania symboliczne, a polecenia B<readlink>(1), B<readlink>(2), B<realpath>(1) i B<realpath>(3) będą działać poprawnie.
uk: Не переходити за символічними посиланням при визначенні шляхів. Попри це, символічні посилання можна буде створювати, а B<readlink>(1), B<readlink>(2), B<realpath>(1) і B<realpath>(3) працюватимуть належним чином.

source: FILESYSTEM-SPECIFIC MOUNT OPTIONS
de: DATEISYSTEMSPEZIFISCHE EINHÄNGEOPTIONEN
fr: OPTIONS DE MONTAGE SPÉCIFIQUES
pl: OPCJE MONTOWANIA SPECYFICZNE DLA RÓŻNYCH SYSTEMÓW PLIKÓW
uk: СПЕЦИФІЧНІ ДЛЯ ФАЙЛОВИХ СИСТЕМ ПАРАМЕТРИ МОНТУВАННЯ

source: This section lists options that are specific to particular filesystems. Where possible, you should first consult filesystem-specific manual pages for details. Some of those pages are listed in the following table.
de: Dieser Abschnitt listet Optionen auf, die für bestimmte Dateisysteme spezifisch sind. Wo immer möglich, sollten Sie für Details zuerst die dateisystemspezifische Handbuchseite konsultieren. Einige dieser Handbuchseiten sind in der folgenden Tabelle aufgelistet.
fr: Cette section liste les options particulières à des systèmes de fichiers. Quand cela est possible, vous devriez consulter la page de manuel spécifique au système de fichiers pour plus de détails. Certaines pages sont listées dans le tableau suivant.
pl: Niniejszy rozdział opisuje opcje charakterystyczne dla niektórych systemów plików. Tam gdzie to możliwe, należy zapoznać się z podręcznikiem systemowym dotyczącym danego systemu plików. Kilka z nich wymieniono w poniższej tabeli.
uk: У цьому розділі наведено список параметрів, які є специфічними для певних файлових систем. Де це можливо, вам слід спочатку ознайомитися із специфічними для файлової системи сторінками підручників, щоб мати повнішу картину. Деякі є частиною списку з наведеної нижче таблиці.

source: B<Filesystem(s)>
de: B<Dateisystem(e)>
fr: B<Système(s) de fichiers>
pl: B<System(y) plików>
uk: B<Файлові системи>

source: B<Manual page>
de: B<Handbuchseite>
fr: B<Page de manuel>
pl: B<Podręcznik systemowy>
uk: B<Сторінка підручника>

source: Note that some of the pages listed above might be available only after you install the respective userland tools.
de: Beachten Sie, dass einige der oben aufgeführten Handbuchseiten erst dann verfügbar sein könnten, nachdem Sie die entsprechenden Dienstprogramme installiert haben.
fr: Remarquez que certaines pages listées ci-dessus pourraient être disponibles uniquement après avoir installé leurs outils respectifs en espace utilisateur.
pl: Proszę zauważyć, że niektóre z powyższych podręczników mogą być dostępne dopiero po zainstalowaniu odpowiednich narzędzi.
uk: Зауважте, що деякі зі сторінок з наведеного вище списку можуть бути доступним, лише після встановлення відповідних інструментів.

source: The following options apply only to certain filesystems. We sort them by filesystem. All options follow the B<-o> flag.
de: Die folgenden Optionen sind nur auf bestimmte Dateisysteme anwendbar. Sie sind nach Dateisystem sortiert und folgen alle dem Schalter B<-o>.
fr: Les options suivantes ne s'appliquent qu'à certains systèmes de fichiers. Elles sont triées par type de système de fichiers. Elles s'utilisent toutes à la suite de l’attribut B<-o>.
pl: Następujące opcje stosuje się tylko do określonych systemów plików. Są uporządkowane według systemu plików. Wszystkie występują po fladze B<-o>.
uk: Вказані нижче параметри є застосовними лише для деяких файлових систем. Ми впорядкували ці параметри за файловими системами. Усі параметри слід вказувати після прапорця B<-o>.

source: What options are supported depends a bit on the running kernel. Further information may be available in filesystem-specific files in the kernel source subdirectory I<Documentation/filesystems>.
de: Welche Optionen unterstützt werden, hängt auch vom laufenden Kernel ab. Weitere Informationen finden Sie in den dateisystemspezifischen Dateien der Kernel-Quellen unter I<Documentation/filesystems>.
fr: Les options prises en charge dépendent du noyau en cours d'utilisation. Vous trouverez plus d'informations dans le sous-répertoire I<Documentation/filesystems> des sources du noyau.
pl: To, czy opcje są obsługiwane, zależy w pewnej mierze od działającego jądra. Więcej informacji można uzyskać w plikach dotyczących odpowiedniego systemu plików w podkatalogu źródeł jądra I<Documentation/filesystems>.
uk: Перелік підтримуваних параметрів залежить певним чином від використаного ядра системи. Докладніші відомості можна отримати зі специфічних для файлової системи файлів у каталозі початкових кодів ядра I<Documentation/filesystems>.

source: Mount options for adfs
de: Einhängeoptionen für Adfs
fr: Options de montage pour adfs
pl: Opcje montowania do adfs
uk: Параметри монтування adfs

source: B<uid=>I<value> and B<gid=>I<value>
de: B<uid=>I<Wert> und B<gid=>I<Wert>
fr: B<uid=>I<valeur> et B<gid=>I<valeur>
pl: B<uid=>I<wartość> i B<gid=>I<wartość>
uk: B<uid=>I<значення> і B<gid=>I<значення>

source: Set the owner and group of the files in the filesystem (default: uid=gid=0).
de: legt den Eigentümer und die Gruppenzugehörigkeit der Dateien im Dateisystem fest (Standard: uid=gid=0).
fr: Définir le propriétaire et le groupe des fichiers du système de fichiers (par défaut : uid=gid=0).
pl: Ustawia właściciela i grupę plików w danym systemie plików (domyślnie: uid=gid=0).
uk: Встановити власника і групу файлів у файловій системі (типові значення: uid=gid=0).

source: B<ownmask=>I<value> and B<othmask=>I<value>
de: B<ownmask=>I<Wert> und B<othmask=>I<Wert>
fr: B<ownmask=>I<valeur> et B<othmask=>I<valeur>
pl: B<ownmask=>I<wartość> i B<othmask=>I<wartość>
uk: B<ownmask=>I<значення> і B<othmask=>I<значення>

source: Set the permission mask for ADFS \(aqowner\(aq permissions and \(aqother\(aq permissions, respectively (default: 0700 and 0077, respectively). See also I</usr/src/linux/Documentation/filesystems/adfs.rst>.
de: setzt die ADFS-Zugriffsrechte-Maske für »owner« bzw. »other« (Standard: 0700 bzw. 0077). Siehe auch I</usr/src/linux/Documentation/filesystems/adfs.rst>.
fr: Définir le masque de permissions pour le propriétaire ADFS et les permissions des « autres » respectivement (défaut : 0700 et 0077, respectivement). Consultez aussi I</usr/src/linux/Documentation/filesystems/adfs.rst>.
pl: Ustawia maskę praw dla, odpowiednio, uprawnień 'właściciela' i uprawnień 'innych' ADFS (domyślnie, odpowiednio: 0700 i 0077). Zobacz także I</usr/src/linux/Documentation/filesystems/adfs.rst>.
uk: Встановити маску прав доступу для прав доступу «власника» і «інших» ADFS, відповідно (типові значення: 0700 і 0077, відповідно). Див. також I</usr/src/linux/Documentation/filesystems/adfs.rst>.

source: Mount options for affs
de: Einhängeoptionen für Affs
fr: Options de montage pour affs
pl: Opcje montowania do affs
uk: Параметри монтування affs

source: Set the owner and group of the root of the filesystem (default: uid=gid=0, but with option B<uid> or B<gid> without specified value, the UID and GID of the current process are taken).
de: legt den Eigentümer und die Gruppenzugehörigkeit der Wurzel des Dateisystems fest (Standard: UID=GID=0, aber mit den Optionen B<UID> oder B<GID> ohne Wertangabe werden UID und GID des aktuellen Prozesses übernommen).
fr: Définir le propriétaire et le groupe de la racine du système de fichiers (par défaut : uid=gid=0, mais avec l'option B<uid> ou B<gid> sans valeur indiquée, l'UID et le GID du processus appelant seront utilisés).
pl: Ustawia właściciela i grupę korzenia systemu plików (domyślnie: uid=gid=0, lecz opcje B<uid> lub B<gid> bez podanej wartości pobierają UID i GID bieżącego procesu).
uk: Встановити власника і групу кореня файлової системи (типові значення: uid=gid=0, але з параметром B<uid> або B<gid> без вказаного значення буде використано UID і GID поточного процесу).

source: B<setuid=>I<value> and B<setgid=>I<value>
de: B<setuid=>I<Wert> und B<setgid=>I<Wert>
fr: B<setuid=>I<valeur> et B<setgid=>I<valeur>
pl: B<setuid=>I<wartość> i B<setgid=>I<wartość>
uk: B<setuid=>I<значення> і B<setgid=>I<значення>

source: Set the owner and group of all files.
de: legt den Eigentümer und die Gruppe aller Dateien fest.
fr: Définir le propriétaire et le groupe de tous les fichiers.
pl: Ustawia właściciela i grupę wszystkich plików.
uk: Встановити власника і групу усіх файлів.

source: B<mode=>I<value>
de: B<mode=>I<Wert>
fr: B<mode=>I<valeur>
pl: B<mode=>I<wartość>
uk: B<mode=>I<значення>

source: Set the mode of all files to I<value> & 0777 disregarding the original permissions. Add search permission to directories that have read permission. The value is given in octal.
de: setzt den Modus aller Dateien auf I<Wert> & 0777, ungeachtet der ursprünglichen Zugriffsrechte, und fügt Such-Zugriffsrechte zu Verzeichnissen hinzu, für die bereits Leserechte bestehen. Der Wert wird in oktaler Notation angegeben.
fr: Définir le mode d'accès à tous les fichiers au mode I<valeur> & 0777 sans s'occuper de leurs permissions d'origine. Cela ajoute également l'autorisation de parcours dans les répertoires qui permettent la lecture. La I<valeur> doit être mentionnée en octal.
pl: Ustawia prawa wszystkich plików na I<wartość> & 0777, nie zważając na oryginalne prawa. Dodaje prawa przeszukiwania dla katalogów, które mają prawo odczytu. Wartość jest podawana ósemkowo.
uk: Встановити режим для усіх файлів I<значення> & 0777, незалежно від початкових прав доступу. Додати права доступу для пошуку у каталогах, на які є право читання. Значення слід вказувати у вісімковій формі.

source: Do not allow any changes to the protection bits on the filesystem.
de: erlaubt keine Änderungen an den Schutz-Bits des Dateisystems.
fr: N'autoriser aucune modification des bits de protection du système de fichiers.
pl: Nie dopuszcza do zmian w bitach ochrony systemu plików.
uk: Не дозволяти вносити зміни до бітів захисту у файловій системі.

source: Set UID and GID of the root of the filesystem to the UID and GID of the mount point upon the first sync or umount, and then clear this option. Strange...
de: setzt UID und GID der Wurzel des Dateisystems auf die UID und GID des Einhängepunkts beim ersten Synchronisieren oder Aushängen und löscht dann diese Option. Seltsam …
fr: Définir l'UID et le GID de la racine du système de fichiers à l'UID et au GID du point de montage jusqu'au premier B<sync> ou B<umount>, puis ignorer cette option. Bizarre…
pl: Ustawia UID i GID korzenia systemu plików na UID i GID punktu montowania, aż do pierwszego sync lub umount, a potem kasuje tę opcję. Dziwne...
uk: Встановити для UID і GID кореня файлової системи значення UID і GID точки монтування при першій синхронізації або демонтуванні, а потім спорожнити значення цього параметра. Дивно…

source: Print an informational message for each successful mount.
de: gibt eine informative Meldung zu jedem erfolgreichen Einhängevorgang aus.
fr: Afficher des informations supplémentaires pour chaque montage réussi.
pl: Wypisuje informację o każdym pomyślnym montowaniu.
uk: Виводити інформаційне повідомлення для кожного успішного монтування.

source: B<prefix=>I<string>
de: B<prefix=>I<Zeichenkette>
fr: B<prefix=>I<chaîne>
pl: B<prefix=>I<napis>
uk: B<prefix=>I<рядок>

source: Prefix used before volume name, when following a link.
de: gibt das Präfix vor dem Datenträgernamen an, wenn einem Link gefolgt wird.
fr: Préfixe à utiliser avant le nom de volume lorsqu'un lien est suivi.
pl: Przedrostek używany przed nazwą wolumenu, przy podążaniu za dowiązaniem.
uk: Префікс, який буде використано перед назвою тому, при переході за посиланням.

source: B<volume=>I<string>
de: B<volume=>I<Zeichenkette>
fr: B<volume=>I<chaîne>
pl: B<volume=>I<napis>
uk: B<volume=>I<рядок>

source: Prefix (of length at most 30) used before \(aq/\(aq when following a symbolic link.
de: gibt das (maximal 30 Zeichen lange) Präfix an, das vor »/« verwendet wird, wenn einem symbolischen Link gefolgt wird.
fr: Préfixe (30 caractères au plus) à utiliser avant « / » lorsqu'un lien symbolique est suivi.
pl: Przedrostek (długości najwyżej 30), używany przed '/' przy podążaniu za dowiązaniem symbolicznym.
uk: Префікс (не більше 30 у довжину), який буде використано перед \(aq/\(aq при переході за символічним посиланням.

source: B<reserved=>I<value>
de: B<reserved=>I<Wert>
fr: B<reserved=>I<valeur>
pl: B<reserved=>I<wartość>
uk: B<reserved=>I<значення>
