Repository: sebras/manpages-l10n
Catalog: po/*/man8/mount.8.po
Languages: de, fr, pl, uk

source: The B<fscontext=> option works for all filesystems, regardless of their xattr support. The fscontext option sets the overarching filesystem label to a specific security context. This filesystem label is separate from the individual labels on the files. It represents the entire filesystem for certain kinds of permission checks, such as during mount or file creation. Individual file labels are still obtained from the xattrs on the files themselves. The context option actually sets the aggregate context that fscontext provides, in addition to supplying the same label for individual files.
de: Die Option B<fscontext=> funktioniert mit allen Dateisystemen, ganz gleich, ob diese Xattr unterstützen oder nicht. Die Option »fscontext« setzt den übergreifenden Dateisystem-Label auf einen spezifischen Sicherheitskontext. Dieser Dateisystem-Label ist von den individuellen Labeln der Dateien getrennt. Er repräsentiert das gesamte Dateisystem für bestimmte Arten von Sicherheitsüberprüfungen, zum Beispiel während des Einhängens oder Anlegens von Dateien. Individuelle Datei-Label werden aus den Xattrs der Dateien selbst bezogen. Die Option »context« setzt tatsächlich den Gesamtkontext, den »fscontext« bereitstellt, zusätzlich zur Bereitstellung des gleichen Labels für individuelle Dateien.
fr: L'option B<fscontext=> fonctionne pour tous les systèmes de fichiers, qu'ils prennent en charge B<xattr> ou non. L'option B<fscontext=> change l'étiquette du système de fichiers en un contexte de sécurité spécifique. L'étiquette du système de fichiers est distincte des étiquettes individuelles des fichiers. Elle représente le système de fichiers entier pour certains types de vérification de permission, comme une période de montage ou une création de fichier. Les étiquettes individuelles de fichiers sont toujours obtenues à partir des paramètres B<xattr> des fichiers eux-mêmes. L'option de contexte définit réellement le contexte global que B<fscontext=> fournit, en plus de fournir la même étiquette pour tous les fichiers individuels.
pl: Opcja B<fscontext=> działa ze wszystkimi systemami plików, niezależnie od ich obsługi xattr. Opcja fscontext ustawia nadrzędną etykietę systemu plików na określony kontekst bezpieczeństwa. Etykieta systemu plików jest oddzielona od poszczególnych etykiet plików. Reprezentuje cały system plików w celu określonego typu sprawdzeń uprawnień, takich jak podczas montowania lub tworzenia pliku. Poszczególne etykiety pliku są wciąż pobierane z xattrs z samych plików. Opcja context w rzeczywistości ustawia zsumowany kontekst udostępniany przez fscontext, poza podawaniem samej etykiety poszczególnych plików.
uk: Параметр B<fscontext=> працює для всіх файлових систем, незалежно від підтримки ними xattr. Параметр fscontext встановлює для загальної мітки файлової системи особливий контекст безпеки. Ця мітка файлової системи є окремою від міток на файлах. Вона представляє всю файлову систему для певних видів перевірок дозволів, наприклад, під час монтування або створення файлу. Окремі мітки файлів також можна отримати зі xattr на самих файлах. Параметр контексту фактично встановлює агрегований контекст, який надає fscontext, на додаток до надання однакової мітки для окремих файлів.

source: You can set the default security context for unlabeled files using B<defcontext=> option. This overrides the value set for unlabeled files in the policy and requires a filesystem that supports xattr labeling.
de: Sie können den standardmäßigen Sicherheitskontext für nicht mit Labeln gekennzeichnete Dateien mit der Option B<defcontext=> setzen. Dies setzt den für nicht mit Labeln gekennzeichnete Dateien in der Richtlinie gesetzten Wert außer Kraft und erfordert ein Dateisystem, das Xattr-Label unterstützt.
fr: Vous pouvez définir le contexte de sécurité par défaut pour les fichiers non étiquetés avec l'option B<defcontext=>. Cela surcharge la valeur par défaut définie pour les fichiers non étiquetés de la stratégie de sécurité et nécessite un système de fichiers qui gère l'étiquetage B<xattr>.
pl: Można ustawić domyślny kontekst bezpieczeństwa do plików bez etykiety, przy użyciu opcji B<defcontext=>. Przesłania ona wartość ustawioną przez zasady (politykę) do plików bez etykiety i wymaga systemu plików obsługującego etykietowanie xattr.
uk: Типовий контекст безпеки для файлів без міток можна встановити за допомогою параметра B<defcontext=>. Це замінить значення, встановлене для файлів без міток у політиці, і вимагає файлової системи, яка підтримує мітки xattr.

source: The B<rootcontext=> option allows you to explicitly label the root inode of a FS being mounted before that FS or inode becomes visible to userspace. This was found to be useful for things like stateless Linux.
de: Die Option B<rootcontext=> ermöglicht die explizite Kennzeichnung des Wurzel-Inodes eines einzuhängenden Dateisystems mit Labeln, bevor das Dateisystem oder Inode für den Benutzer sichtbar wird. Nützlich ist dies zum Beispiel für ein zustandsloses Linux.
fr: L'option B<rootcontext=> permet d'étiqueter explicitement l'inœud racine d'un système de fichiers avant que l'inœud ou le système de fichiers en cours de montage ne devienne visible depuis l'espace utilisateur. Cela s'est avéré utile pour des noyaux Linux « stateless ».
pl: Opcja B<rootcontext=> pozwala na jawne podanie etykiety głównego i-węzła systemu plików przez tym, zanim ten system plików lub i-węzeł stanie się widoczny dla przestrzeni użytkownika. Może być to przydatne przy wykorzystaniu bezdyskowego Linuksa.
uk: Параметр B<rootcontext=> дозволяє явно позначити кореневий індекс монтованої файлової системи до того, як ця файлова система або inode стануть видимими в просторі користувача. Це виявилося корисним для таких речей, як Stateless Linux.

source: Note that the kernel rejects any remount request that includes the context option, B<even> when unchanged from the current context.
de: Beachten Sie, dass der Kernel jegliche Anfragen zum Wiedereinhängen abweist, die eine »context«-Option enthalten, B<sogar> wenn sich diese vom aktuellen Kontext nicht unterscheidet.
fr: Remarquez que le noyau rejette toutes les demandes de remontage qui contiennent l'option I<contexte>, B<même> quand elles ne modifient pas le contexte actuel.
pl: Proszę zauważyć, że jądro odrzuca żądania przemontowania, które zawierają opcję context, B<nawet> gdy nie różni się ona od bieżącego kontekstu.
uk: Зауважте, що ядро ​​відхиляє будь-який запит на перемонтування, який містить параметр контексту, B<навіть> якщо він не змінюється з поточного контексту.

source: B<Warning: the> I<context> B<value might contain commas>, in which case the value has to be properly quoted, otherwise B<mount> will interpret the comma as a separator between mount options. Don\(cqt forget that the shell strips off quotes and thus B<double quoting is required>. For example:
de: B<Warnung: Der Wert von> I<context> B<könnte Kommata enthalten>. In einem solchen Fall muss der Wert sauber in Anführungszeichen gesetzt werden, anderenfalls interpretiert B<mount> das Komma als Trenner zwischen Einhängeoptionen. Denken Sie daran, dass die Shell einfache Anführungszeichen entfernt und daher B<doppelte erforderlich sind>. Zum Beispiel:
fr: B<Avertissement> : la valeur I<contexte> pourrait contenir des virgules, auquel cas, la valeur doit être protégée correctement sinon B<mount> interprétera la virgule comme un séparateur entre options de montage. N’oubliez pas que l’interpréteur de commandes supprime les guillemets simples et que B<des guillemets doubles sont donc nécessaires>. Par exemple :
pl: B<Uwaga: wartość> I<context> B<może zawierać przecinki>, ale musi być wówczas odpowiednio cytowana, ponieważ w przeciwnym wypadku B<mount> zinterpretuje przecinki jako separatory pomiędzy punktami montowań. Proszę nie zapomnieć, że powłoka usunie cytowanie, dlatego B<konieczne jest podwójne cytowanie> np.:
uk: B<Попередження: значення> I<контекст> B<може містити коми>. У цьому випадку значення має бути належним чином екрановано (взято у лапки), інакше, B<mount> вважатиме кому роздільником між параметрами монтування. Не забувайте, що командна оболонка прибирає екранування, а тому B<потрібне подвійне екранування>. Приклад:

source: For more details, see B<selinux>(8).
de: Weitere Details finden Sie in B<selinux>(8).
fr: Pour plus de précisions, consultez B<selinux>(8).
pl: Aby dowiedzieć się więcej, proszę zapoznać się z B<selinux>(8).
uk: Щоб дізнатися більше, див. B<selinux>(8).

source: Use the default options: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser>, and B<async>.
de: verwendet die Standardoptionen: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser> und B<async>.
fr: Utiliser les options par défaut : B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser> et B<async>.
pl: Używa opcji domyślnych: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser> i B<async>.
uk: Використовувати типові параметри: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser> та B<async>.

source: Note that the real set of all default mount options depends on the kernel and filesystem type. See the beginning of this section for more details.
de: Beachten Sie, dass der reale Satz aller vorgegebenen Einhängeoptionen vom Kernel und Dateisystemtyp abhängt. Am Anfang dieses Abschnitts finden Sie weitere Details.
fr: Remarquez que le véritable ensemble de toutes les options de montage par défaut dépend du noyau et du type de système de fichiers. Consultez le début de cette section pour plus de précisions.
pl: Proszę zauważyć, że rzeczywisty zestaw domyślnych opcji montowania zależy od jądra i typu systemu plików. Więcej szczegółów na początku tego rozdziału.
uk: Зауважте, що справжній набір усіх типових параметрів монтування залежить від ядра системи та типу файлової системи. Див. початок цього розділу, щоб дізнатися більше.

source: Interpret character or block special devices on the filesystem.
de: interpretiert zeichenorientierte oder blockorientierte Geräte im Dateisystem.
fr: Interpréter les périphériques spéciaux de type caractère ou bloc présents sur le système de fichiers.
pl: Interpretuje specjalne urządzenia blokowe i znakowe na danym systemie plików.
uk: Інтерпретувати символ або блокувати спеціальні пристрої у файловій системі.

source: Do not interpret character or block special devices on the filesystem.
de: interpretiert keine zeichenorientierten oder blockorientierten Geräte im Dateisystem.
fr: Ne pas interpréter les périphériques spéciaux de type caractère ou bloc présents sur le système de fichiers.
pl: Nie interpretuje specjalnych urządzeń blokowych ani znakowych na systemie plików.
uk: Не інтерпретувати символ або блокувати спеціальні пристрої у файловій системі.

source: Update directory inode access times on this filesystem. This is the default. (This option is ignored when B<noatime> is set.)
de: aktualisiert die Inode-Zugriffszeiten für Verzeichnisse auf diesem Dateisystem. Dies ist die Standardeinstellung. Diese Option wird ignoriert, wenn B<noatime> gesetzt ist.
fr: Mettre à jour les horodatages d'accès d'inœuds sur ce système de fichiers. Option par défaut (ignorée quand B<noatime> est défini).
pl: Aktualizuje czas dostępu katalogu zapisany w i-węźle w danym systemie plików. Tak jest domyślnie. (Ta opcja jest ignorowana, gdy ustawiono B<noatime>).
uk: Оновлювати часи доступу до inode каталогів у цій файловій системі. Це типова поведінка. (Цей параметр буде проігноровано, якщо встановлено B<noatime>.)

source: Do not update directory inode access times on this filesystem. (This option is implied when B<noatime> is set.)
de: aktualisiert die Inode-Zugriffszeiten für Verzeichnisse auf diesem Dateisystem nicht. Diese Option ist impliziert, wenn B<noatime> gesetzt ist.
fr: Ne pas mettre à jour les horodatages d'accès d'inœuds sur ce système de fichiers. Cette option est implicite quand B<noatime> est défini.
pl: Aktualizuje czas dostępu katalogu zapisany w i-węźle w danym systemie plików (ta opcja jest dorozumiana, gdy ustawiono B<noatime>).
uk: Не оновлювати часи доступу до inode каталогів у цій файловій системі. (Цей параметр буде встановлено неявним чином, якщо встановлено B<noatime>.)

source: All directory updates within the filesystem should be done synchronously. This affects the following system calls: B<creat>(2), B<link>(2), B<unlink>(2), B<symlink>(2), B<mkdir>(2), B<rmdir>(2), B<mknod>(2) and B<rename>(2).
de: Alle Verzeichnisaktualisierungen innerhalb des Dateisystems sollten synchron geschehen. Dies betrifft die folgenden Systemaufrufe: B<creat>(2), B<link>(2), B<unlink>(2), B<symlink>(2), B<mkdir>(2), B<rmdir>(2), B<mknod>(2) und B<rename>(2).
fr: Toutes les mises à jour de répertoires du système de fichiers devraient être réalisées de façon synchrone. Cela concerne les appels système suivants : B<creat>(2), B<link>(2), B<unlink>(2), B<symlink>(2), B<mkdir>(2), B<rmdir>(2), B<mknod>(2) et B<rename>(2).
pl: Aktualizacja wszystkich katalogów w systemie plików powinna być wykonywana synchronicznie. Dotyka to następujących wywołań systemowych: B<creat>(2), B<link>(2), B<unlink>(2), B<symlink>(2), B<mkdir>(2), B<rmdir>(2), B<mknod>(2) i B<rename>(2).
uk: Усі оновлення каталогів у файловій системі має бути виконано синхронно. Це стосується таких системних викликів: B<creat>(2), B<link>(2), B<unlink>(2), B<symlink>(2), B<mkdir>(2), B<rmdir>(2), B<mknod>(2) і B<rename>(2).

source: Permit execution of binaries and other executable files.
de: erlaubt die Ausführung von Programmen und anderen ausführbaren Dateien.
fr: Permettre l'exécution de fichiers binaires et d'autres fichiers exécutables.
uk: Дозволити виконання двійковий та інших виконуваних файлів.

source: Do not permit direct execution of any binaries on the mounted filesystem.
de: verbietet die direkte Ausführung von Programmen auf dem eingehängten Dateisystem.
fr: Ne pas autoriser l’exécution directe de fichiers binaires du système de fichiers monté.
pl: Nie zezwala na bezpośrednie wywołanie plików binarnych w zamontowanym systemie plików.
uk: Не дозволяти безпосереднє виконання будь-яких двійкових файлів на змонтованій файловій системі.

source: Allow an ordinary user to mount the filesystem if one of that user\(cqs groups matches the group of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<group,dev,suid>).
de: erlaubt einem gewöhnlichen Benutzer das Einhängen eines Dateisystems, falls eine der Gruppen des Benutzers der Gruppe des Gerätes entspricht. Diese Option impliziert die Optionen B<nosuid> und B<nodev> (es sei denn, sie werden durch nachfolgende Optionen außer Kraft gesetzt, wie in der Optionszeile B<group,dev,suid>).
fr: Autoriser un utilisateur ordinaire à monter le système de fichiers si l’un des groupes de cet utilisateur correspond au groupe du périphérique. Cette option implique les options B<nosuid> et B<nodev> (à moins qu'elles ne soient annulées par d'autres options comme dans la ligne d'options B<group,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika, jeśli jedna z grup tego użytkownika pasuje do grup urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<group,dev,suid>).
uk: Дозволити звичайному користувачеві монтувати файлову систему, якщо одна із груп користувача збігається із групою пристрою. Цей параметр неявним чином встановлює параметри B<nosuid> і B<nodev> (якщо їх не перевизначено наступними параметрами, як у рядку параметрів B<group,dev,suid>).

source: Every time the inode is modified, the i_version field will be incremented.
de: zählt das Feld »i_version« jedes Mal hoch, wenn der Inode geändert wird.
fr: Incrémenter le champ I<i_version> d'un inœud à chaque modification de celui-ci.
pl: Przy każdej modyfikacji i-węzła zwiększane jest pole i_version.
uk: У відповідь на кожну зміну inode буде збільшено значення поля i_version.

source: Do not increment the i_version inode field.
de: zählt das Feld »i_version« nicht hoch.
fr: Ne pas incrémenter le champ I<i_version> de l'inœud.
pl: Nie zwiększa pola i-węzła i_version.
uk: Не збільшувати поле inode i_version.

source: Allow mandatory locks on this filesystem. See B<fcntl>(2). This option was deprecated in Linux 5.15.
de: erlaubt zwingende Sperren auf diesem Dateisystem. Siehe B<fcntl>(2). Diese Option wurde in Linux 5.15 als veraltet markiert.
fr: Permettre les verrouillages obligatoires sur ce système de fichiers. Consultez B<fcntl>(2). Cette option est obsolète depuis Linux 5.15.
uk: Дозволити обов'язкові блокування у цій файловій системі. Див. B<fcntl>(2). Цей параметр вважається застарілим, починаючи з версії Linux 5.15.

source: Do not allow mandatory locks on this filesystem.
de: erlaubt keine obligatorischen Sperrungen auf diesem Dateisystem.
fr: Ne pas permettre les verrouillages obligatoires sur ce système de fichiers.
pl: Nie pozwala na ściśle egzekwowane blokady w systemie plików.
uk: Не дозволяти обов'язкові блокування на цій файловій системі.

source: The filesystem resides on a device that requires network access (used to prevent the system from attempting to mount these filesystems until the network has been enabled on the system).
de: gibt an, dass sich das Dateisystem auf einem Gerät befindet, das Netzwerkzugriff erfordert (wird dazu verwendet, das System an Versuchen zum Einhängen des Dateisystems zu hindern, bevor das Netzwerk auf dem System aktiviert wurde).
fr: Le système de fichiers réside sur un périphérique nécessitant des accès réseau (utilisé pour éviter que le système essaye de monter ces systèmes de fichiers avant d'avoir activé le réseau).
pl: System plików znajduje się na urządzeniu wymagającym połączenia sieciowego (używane aby zapobiec montowania przez system takich systemów plików, dopóki sieć nie zostanie włączona w systemie).
uk: Файлова система зберігається на пристрої, для роботи якого потрібен доступ до мережі (використовують для запобігання спробам системи змонтувати ці файлові системи, доки у системі не буде увімкнено мережу).

source: Do not report errors for this device if it does not exist.
de: meldet keine Fehler für dieses Gerät, wenn es nicht existiert.
fr: Ne pas renvoyer d'erreur pour ce périphérique s'il n'existe pas.
pl: Nie informuje o błędach urządzenia, jeśli ono nie istnieje.
uk: Не звітувати про помилки для цього пристрою, якщо він не існує.

source: Update inode access times relative to modify or change time. Access time is only updated if the previous access time was earlier than the current modify or change time. (Similar to B<noatime>, but it doesn\(cqt break B<mutt>(1) or other applications that need to know if a file has been read since the last time it was modified.)
de: aktualisiert die Inode-Zugriffszeiten relativ zur Daten- oder Statusänderungszeit. Die Zugriffszeit wird nur aktualisiert, wenn die vorige Zugriffszeit tatsächlich vor der aktuellen Änderungszeit liegt. Dies ist ähnlich zu B<noatime>, aber behindert B<mutt>(1) oder ähnliche Anwendungen nicht, die darüber informiert sein müssen, ob eine Datei seit dem letzten Änderungszeitpunkt gelesen wurde.
fr: Mettre à jour les horodatages d'accès à l’inœud par rapport à l’horodatage de modification. L’horodatage d'accès est mis à jour seulement si le précédent horodatage d'accès est antérieur à l’horodatage de modification (c'est équivalent à l'option B<noatime>, mais ne casse pas les applications, comme B<mutt>(1), qui ont besoin de savoir si un fichier a été lu depuis sa dernière modification).
pl: Aktualizuje czas dostępu i-węzła relatywnie do czasu modyfikacji lub zmiany. Czas dostępu jest aktualizowany tylko wówczas, jeśli poprzedni czas dostępu był wcześniejszy od bieżącego czasu modyfikacji lub zmiany (podobne do B<noatime>, ale nie psuje aplikacji B<mutt>(1) i innych, które potrzebują informacji o tym, czy plik zostać przeczytany od czasu jego ostatniej modyfikacji).
uk: Оновлювати часи доступу до inode відносно часу внесення змін. Час доступу буде оновлено, лише якщо час попереднього доступу передував поточному часу внесення змін. (Подібний до B<noatime>, але не порушує роботу B<mutt>(1) або інших програм, які потребують даних щодо того, чи виконувалося читання файла з моменту, коли до файла востаннє було внесено зміни.)

source: Since Linux 2.6.30, the kernel defaults to the behavior provided by this option (unless B<noatime> was specified), and the B<strictatime> option is required to obtain traditional semantics. In addition, since Linux 2.6.30, the file\(cqs last access time is always updated if it is more than 1 day old.
de: Seit Linux 2.6.30 verhält sich der Kernel standardmäßig nach den Angaben dieser Option (außer wenn B<noatime> angegeben wurde) und erfordert die Option B<strictatime> für die traditionelle Semantik. Außerdem wird seit Linux 2.6.30 die letzte Zugriffszeit immer aktualisiert, wenn diese länger als einen Tag zurückliegt.
fr: Depuis Linux 2.6.30, le comportement par défaut du noyau est celui fourni par cette option (sauf si B<noatime> a été indiquée), et l'option B<strictatime> est nécessaire pour obtenir les sémantiques traditionnelles. De plus, depuis Linux 2.6.30, la date de dernier accès au fichier est toujours mise à jour si elle est vieille de plus d'un jour.
pl: Od Linuksa w wersji 2.6.30, jądro używa domyślnie zachowania udostępnianego przez tę opcję (chyba że podano B<noatime>), a opcja B<strictatime> jest wymagana, aby uzyskać tradycyjny sposób działania. Dodatkowo, od tej wersji Linuksa, czas ostatniego dostępu pliku jest aktualizowany zawsze, jeśli wynosi więcej niż 1 dzień.
uk: Починаючи Linux 2.6.30, типову поведінку ядра змінено на поведінку із цим увімкненим параметром (якщо не вказано B<noatime>). Для отримання традиційної семантики слід вказати параметр B<strictatime>. Крім того, починаючи з Linux 2.6.30, час останнього доступу до файла завжди оновлюється, якщо з моменту попереднього оновлення минула 1 доба.

source: Do not use the B<relatime> feature. See also the B<strictatime> mount option.
de: verwendet die Funktion B<relatime> nicht. Siehe auch die Einhängeoption B<strictatime>.
fr: Ne pas utiliser la fonctionnalité B<relatime>. Consultez aussi l'option de montage B<strictatime>.
pl: Nie używa funkcji B<relatime>. Patrz również opcja montowania B<strictatime>.
uk: Не використовувати можливість B<relatime>. Див. також параметр монтування B<strictatime>.
