Repository: sebras/manpages-l10n
Catalog: po/*/man8/nfsd.8.po
Languages: fr

source: 20 Feb 2014
fr: 20 février 2014

source: NAME
fr: NOM

source: rpc.nfsd - NFS server process
fr: rpc.nfsd - Processus serveur NFS

source: B</usr/sbin/rpc.nfsd [>I<options>B<]>I< >B<nproc>
fr: B</usr/sbin/rpc.nfsd> [I<options>] I<nombre_processus>

source: The B<rpc.nfsd> program implements the user level part of the NFS service. The main functionality is handled by the B<nfsd> kernel module. The user space program merely specifies what sort of sockets the kernel service should listen on, what NFS versions it should support, and how many kernel threads it should use.
fr: Le programme B<rpc.nfsd> implémente la partie utilisateur du service NFS. Les principales actions sont prises en charge par le module noyau B<nfsd>. La partie utilisateur se contente de préciser quels sont les sockets que le service noyau doit écouter, quelles versions de NFS il doit prendre en charge et combien de processus légers (threads) il doit lancer.

source: The B<rpc.mountd> server provides an ancillary service needed to satisfy mount requests by NFS clients.
fr: Le démon B<rpc.mountd> fournit un service auxiliaire nécessaire pour le traitement des requêtes de montage ou démontage des clients NFS.

source: B<-d or --debug>
fr: B<-d>, B<--debug>

source: enable logging of debugging messages
fr: Activer la journalisation des messages utiles au débogage.

source: B<-H or --host hostname>
fr: B<-H>, B<--host> I<nom_hôte>

source: specify a particular hostname (or address) that NFS requests will be accepted on. By default, B<rpc.nfsd> will accept NFS requests on all known network addresses. Note that B<lockd> (which performs file locking services for NFS) may still accept request on all known network addresses. This may change in future releases of the Linux Kernel. This option can be used multiple time to listen to more than one interface.
fr: Indiquer un nom d'hôte spécifique (ou son adresse) où les requêtes NFS seront acceptées. Par défaut, B<rpc.nfsd> accepte les requêtes NFS sur toutes les adresses réseau connues. Il faut noter que B<lockd> (qui effectue le verrouillage des fichiers pour NFS) peut continuer à accepter les requêtes NFS sur toutes les adresses réseau connues. Cela peut changer dans de futures versions du noyau Linux. Cette option peut être utilisée plusieurs fois pour écouter plus d’une interface.

source: B<-p or --port port>
fr: B<-p>, B<--port> I<port>

source: specify a different port to listen on for NFS requests. By default, B<rpc.nfsd> will listen on port 2049.
fr: Indiquer un port d'écoute spécifique pour les requêtes NFS. Par défaut, B<rpc.nfsd> écoute le port 2049.

source: B<-r or --rdma>
fr: B<-d>, B<--rdma>

source: specify that NFS requests on the standard RDMA port ("nfsrdma", port 20049) should be honored.
fr: Indiquer que les requêtes NFS sur le port standard RDMA (« nfsrdma », port 20049) seront honorées.

source: Listen for RDMA requests on an alternate port - may be a number or a name listed in B</etc/services>.
fr: Écouter les requêtes RDMA sur un port alternatif, pouvant être un nombre ou un nom listé dans I</etc/services>.

source: B<-N or --no-nfs-version vers>
fr: B<-N>, B<--no-nfs-version> I<version>

source: B<-s or --syslog>
fr: B<-s>, B<--syslog>

source: By default, B<rpc.nfsd> logs error messages (and debug messages, if enabled) to stderr. This option makes B<rpc.nfsd> log these messages to syslog instead. Note that errors encountered during option processing will still be logged to stderr regardless of this option.
fr: Par défaut, B<rpc.nfsd> envoie les messages d'erreur (et de débogage si l'option adéquate est activée) vers la sortie d'erreur standard. Cette option ordonne à B<rpc.nfsd> d'enregistrer ces messages dans le journal système (syslog). Notez que les erreurs rencontrées pendant le traitement des options seront quand même envoyées vers la sortie d'erreur standard.

source: B<-t or --tcp>
fr: B<-t>, B<--tcp>

source: Instruct the kernel nfs server to open and listen on a TCP socket. This is the default.
fr: Indiquer au serveur NFS du noyau d’ouvrir et d’écouter sur un socket TCP. C’est le comportement par défaut.

source: B<-T or --no-tcp>
fr: B<-T>, B<--no-tcp>

source: Instruct the kernel nfs server not to open and listen on a TCP socket.
fr: Indiquer au serveur NFS du noyau de ne pas ouvrir et écouter sur un socket TCP.

source: B<-u or --udp>
fr: B<-u>, B<--udp>

source: Instruct the kernel nfs server to open and listen on a UDP socket.
fr: Indiquer au serveur NFS du noyau d’ouvrir et d’écouter sur un socket UDP.

source: B<-U or --no-udp>
fr: B<-U>, B<--no-udp>

source: Instruct the kernel nfs server not to open and listen on a UDP socket. This is the default.
fr: Indiquer au serveur NFS du noyau de ne pas ouvrir et écouter sur un socket UDP. C’est le comportement par défaut.

source: B<-V or --nfs-version vers>
fr: B<-V>, B<--nfs-version> I<version>

source: B<-L or --lease-time seconds>
fr: B<-L>, B<--lease-time> I<secondes>

source: Set the lease-time used for NFSv4. This corresponds to how often clients need to confirm their state with the server. Valid range is from 10 to 3600 seconds.
fr: Régler la durée de contrat (lease-time) utilisée pour NFSv4. Cela correspond à quelle fréquence les clients doivent confirmer leur état par rapport au serveur. L’intervalle autorisé est de 10 à 3600 secondes.

source: B<-G or --grace-time seconds>
fr: B<-G>, B<--grace-time> I<secondes>

source: Set the grace-time used for NFSv4 and NLM (for NFSv2 and NFSv3). New file open requests (NFSv4) and new file locks (NLM) will not be allowed until after this time has passed to allow clients to recover state.
fr: Régler le délai de grâce utilisé pour NFSv4 et NLM (pour NFSv2 et NFSv3). Les requêtes d’ouverture de nouveau fichier (NFSv4) et les verrous de nouveau fichier (NLM) ne seront autorisés qu’après l’expiration du délai pour permettre aux clients de récupérer leur état.

source: I<nproc>
fr: I<nombre_processus>

source: specify the number of NFS server threads. By default, eight threads are started. However, for optimum performance several threads should be used. The actual figure depends on the number of and the work load created by the NFS clients, but a useful starting point is eight threads. Effects of modifying that number can be checked using the B<nfsstat>(8) program.
fr: Préciser le nombre de processus légers (« threads ») du serveur NFS. Par défaut, huit processus sont lancés. Toutefois, pour atteindre des performances optimales, plusieurs processus devraient être utilisés. Le chiffre réel dépend du nombre de clients et de la charge de travail engendrée par les clients NFS. Un bon point de départ est 8 processus. Le programme B<nfsstat>(8) permet d'observer les effets d'une modification de ce chiffre.

source: Note that if the NFS server is already running, then the options for specifying host, port, and protocol will be ignored. The number of processes given will be the only option considered, and the number of active B<nfsd> processes will be increased or decreased to match this number. In particular B<rpc.nfsd 0> will stop all threads and thus close any open connections.
fr: Notez bien que si le serveur NFS est déjà lancé, les options qui définissent l'hôte, le port et le protocole seront ignorées. La seule option prise en compte sera le nombre de processus indiqué et le nombre total de processus B<nfsd> actifs sera augmenté ou diminué afin de s'aligner sur ce nombre. En particulier, B<rpc.nfsd 0> arrêtera tous les processus légers et fermera donc toutes les connexions actives.

source: CONFIGURATION FILE
fr: FICHIER DE CONFIGURATION

source: Many of the options that can be set on the command line can also be controlled through values set in the B<[nfsd]> section of the I</etc/nfs.conf> configuration file. Values recognized include:
fr: La plupart des options pouvant être définies sur la ligne de commande peuvent l’être par des valeurs dans la section B<[nfsd]> du fichier de configuration I</etc/nfs.conf>. Les valeurs reconnues comprennent :

source: The number of threads to start.
fr: Le nombre de processus légers à démarrer.

source: A host name, or comma separated list of host names, that I<rpc.nfsd> will listen on. Use of the B<--host> option replaces all host names listed here.
fr: Un nom d’hôte ou une liste de noms d’hôte séparés par des virgules que I<rpc.nfsd> écoutera. L’utilisation de l’option B<--host> remplace tous les noms d’hôte listés dans celle-ci.

source: The grace time, for both NFSv4 and NLM, in seconds.
fr: Le délai de grâce pour NFSv4 et NLM en secondes.

source: The lease time for NFSv4, in seconds.
fr: La durée de contrat pour NFSv4 en secondes.

source: Set the port for TCP/UDP to bind to.
fr: Réglage du port pour la connexion TCP/UDP.

source: Enable RDMA port (with "on" or "yes" etc) on the standard port ("nfsrdma", port 20049).
fr: Activer le port RDMA (avec « on » ou « yes », etc.) pour le port standard (« nfsrdma », port 20049).

source: Set an alternate RDMA port.
fr: Définir un port RDMA alternatif.

source: Enable (with "on" or "yes" etc) or disable ("off", "no") UDP support.
fr: Activer (avec « on » ou « yes », etc.) ou désactiver (« off », « no ») la prise en charge d’UDP.

source: Enable or disable TCP support.
fr: Activer ou désactiver la prise en charge de TCP.

source: Enable or disable a major NFS version. 3 and 4 are normally enabled by default.
fr: Activer ou désactiver une version majeure de NFS. Les version 3 et 4 sont normalement activées par défaut.

source: Setting these to "off" or similar will disable the selected minor versions. Setting to "on" will enable them. The default values are determined by the kernel, and usually minor versions default to being enabled once the implementation is sufficiently complete.
fr: Régler celles-ci à « off » ou une autre valeur similaire désactivera les versions intermédiaires choisies. Régler à « on » les activera. Les valeurs par défaut sont déterminées par le noyau et, habituellement, les versions intermédiaires sont par défaut activées une fois que l’implémentation est suffisamment achevée.

source: If the program is built with TI-RPC support, it will enable any protocol and address family combinations that are marked visible in the B<netconfig> database.
fr: Si le programme a été construit avec la prise en charge de TI-RPC, il activera toutes les combinaisons de protocole et famille d'adresses qui sont marquées comme visibles dans la base de données de B<netconfig>.

source: SEE ALSO
fr: VOIR AUSSI

source: AUTHOR
fr: AUTEUR

source: Olaf Kirch, Bill Hawes, H. J. Lu, G. Allan Morris III, and a host of others.
fr: Olaf Kirch, Bill Hawes, H. J. Lu, G. Allan Morris III, et un paquet d'autres.

source: This option can be used to request that B<rpc.nfsd> does not offer certain versions of NFS. The current version of B<rpc.nfsd> can support NFS versions 2,3,4 and the newer version 4.1.
fr: Cette option peut être utilisée pour demander à B<rpc.nfsd> de ne pas prendre en charge certaines versions de NFS. La version actuelle de B<rpc.nfsd> gère les versions 2, 3, 4 et 4.1 de NFS.

source: Disable B<rpc.nfsd> from accepting TCP connections from clients.
fr: Refuser les connexions TCP des clients.

source: Disable B<rpc.nfsd> from accepting UDP connections from clients.
fr: Refuser les connexions UDP des clients.

source: This option can be used to request that B<rpc.nfsd> offer certain versions of NFS. The current version of B<rpc.nfsd> can support NFS versions 2,3,4 and the newer version 4.1.
fr: Cette option peut être utilisée pour demander à B<rpc.nfsd> de prendre en charge certaines versions de NFS. La version actuelle de B<rpc.nfsd> gère les versions 2, 3, 4 et 4.1 de NFS.

source: specify the number of NFS server threads. By default, just one thread is started. However, for optimum performance several threads should be used. The actual figure depends on the number of and the work load created by the NFS clients, but a useful starting point is 8 threads. Effects of modifying that number can be checked using the B<nfsstat>(8) program.
fr: Préciser le nombre de processus légers (« threads ») du serveur NFS. Par défaut, un seul processus est lancé. Toutefois, pour atteindre des performances optimales, plusieurs processus peuvent être lancés. Le chiffre réel dépend du nombre de clients et de la charge de travail engendrée par les connexions NFS. Un bon point de départ est 8 processus. Le programme B<nfsstat>(8) permet d'observer les effets d'une modification de cette valeur.
