Repository: sebras/manpages-l10n
Catalog: po/*/man8/pacsort.8.po
Languages: pt_br

source: Pacman-contrib Manual
pt_br: Manual do pacman-contrib

source: NAME
pt_br: NOME

source: pacsort - sort utility implementing alpm_pkg_vercmp
pt_br: pacsort - utilitário de ordenação implementando alpm_pkg_vercmp

source: SYNOPSIS
pt_br: SINOPSE

source: I<pacsort> [options] [files\&...]
pt_br: I<pacsort> [opções] [arquivos\&...]

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: I<pacsort> concatenates the given files, sorts them, and writes them to standard output\&. Default order is oldest to newest\&.
pt_br: I<pacsort> concatena os arquivos fornecidos, ordena-os e grava-os na saída padrão\&. A ordem padrão é do mais antigo para o mais novo\&.

source: Standard input is read when no files are given\&.
pt_br: A entrada padrão é lida quando nenhum arquivo é fornecido\&.

source: By default the lines are treated as lists of plain version strings\&.
pt_br: Por padrão, as linhas são tratadas como listas de strings de versão simples\&.

source: OPTIONS
pt_br: OPÇÕES

source: If the input lists are in the format I<*->B<\&.pkg\&.tar>, sort lines by pkgname and pkgver\&.
pt_br: Se as listas de entrada estiverem no formato I<*->B<\&.pkg\&.tar>, ordena as linhas por pkgname e pkgver\&.

source: Display syntax and command line options\&.
pt_br: Exibe a sintaxe e opções de linha de comando\&.

source: B<-k, --key E<lt>indexE<gt>>
pt_br: B<-k, --key E<lt>índiceE<gt>>

source: Sort the input starting on the specified column\&.
pt_br: Ordena a entrada começando na coluna especificada\&.

source: Sort in reverse order\&.
pt_br: Ordena na ordem inversa\&.

source: Field separator\&. Default separator is space\&.
pt_br: Separador de campo\&. O separador padrão é espaço\&.

source: B<-v, --version>: Display the version\&.
pt_br: B<-v, --version>: Exibe a versão\&.

source: Lines end with null bytes rather than newlines\&.
pt_br: As linhas terminam com bytes nulos em vez de novas linhas\&.

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: Bugs? You must be kidding; there are no bugs in this software\&. But if we happen to be wrong, send us an email with as much detail as possible to pacman-contrib@lists\&.archlinux\&.org\&.
pt_br: Bugs? Você deve estar brincando; não há erros neste software\&. Mas se por acaso estivermos errados, envie um relatório de erro com o máximo de detalhes possível para pacman-contrib@lists\&.archlinux\&.org\&.

source: AUTHORS
pt_br: AUTORES

source: Current maintainers:
pt_br: Atuais mantenedores:

source: For additional contributors, use git shortlog -s on the pacman-contrib\&.git repository\&.
pt_br: Para contribuidores adicionais, use git shortlog -s no repositório do pacman-contrib\&.git\&.
