Repository: sebras/manpages-l10n
Catalog: po/*/man8/quotacheck.8.po
Languages: pl

source: Fri Jul 20 2001
pl: 20 lipca 2001

source: NAME
pl: NAZWA

source: quotacheck - scan a filesystem for disk usage, create, check and repair quota files
pl: quotacheck - przeszukuje system plików w celu określenia wykorzystania dysku oraz tworzy, sprawdza i naprawia pliki kwot

source: SYNOPSIS
pl: SKŁADNIA

source: B<quotacheck> [ B<-gubcfinvdMmR> ] [ B<-F> I<quota-format> ] B<-a> | I<filesystem>
pl: B<quotacheck> [ B<-gubcfinvdMmR> ] [ B<-F> I<nazwa-formatu> ] B<-a> | I<system-plików>

source: DESCRIPTION
pl: OPIS

source: B<quotacheck> examines each filesystem, builds a table of current disk usage, and compares this table against that recorded in the disk quota file for the filesystem (this step is omitted if option B<-c> is specified). If any inconsistencies are detected, both the quota file and the current system copy of the incorrect quotas are updated (the latter only occurs if an active filesystem is checked which is not advised). By default, only user quotas are checked. B<quotacheck> expects each filesystem to be checked to have quota files named I<[a]quota.user> and I<[a]quota.group> located at the root of the associated filesystem. If a file is not present, B<quotacheck> will create it.
pl: B<quotacheck> bada każdy z systemów plików, tworzy tablicę zajętości dysku i porównuje ją z tablicą zapisaną w pliku kwot dyskowych systemu plików (krok ten jest pomijany w przypadku podania opcji B<-c>). Jeśli stwierdzone zostaną rozbieżności, to aktualizowane są zarówno plik kwot, jak i aktualna systemowa kopia nieprawidłowych kwot (to ostatnie ma miejsce jedynie podczas sprawdzania aktywnego systemu plików, co nie jest zalecane). Domyślnym zachowaniem jest sprawdzanie jedynie kwot dyskowych użytkowników. B<quotacheck> oczekuje, że każdy ze sprawdzanych systemów plików zawiera pliki kwot o nazwach I<[a]quota.user> i I<[a]quota.group>, umieszczone w głównym katalogu danego systemu plików. Jeśli plik nie istnieje, to B<quotacheck> go utworzy.

source: If the quota file is corrupted, B<quotacheck> tries to save as much data as possible. Rescuing data may need user intervention. With no additional options B<quotacheck> will simply exit in such a situation. When in interactive mode (option B<-i>) , the user is asked for advice. Advice can also be provided from command line (see option B<-n>) , which is useful when B<quotacheck> is run automatically (ie. from script) and failure is unacceptable.
pl: Jeśli plik kwot jest uszkodzony, to B<quotacheck> spróbuje zachować tyle danych, ile będzie możliwe. Odzyskiwanie danych może wymagać interwencji użytkownika. Bez dodatkowych opcji, B<quotacheck> w takiej sytuacji po prostu zakończy pracę. W trybie interakcyjnym (opcja B<-i>), użytkownik jest proszony o poradę. Porady można udzielić z linii poleceń (patrz opcja B<-n>), co jest przydatne podczas automatycznego uruchamiania B<quotacheck> (np. ze skryptu) i niepowodzenie jest nie do przyjęcia.

source: B<quotacheck> should be run each time the system boots and mounts non-valid filesystems. This is most likely to happen after a system crash.
pl: B<quotacheck> powinno być uruchamiane każdorazowo gdy system startuje i montuje niepoprawne systemy plików. Najczęściej zdarza się to po awarii systemu.

source: It is strongly recommended to run B<quotacheck> with quotas turned off for the filesystem. Otherwise, possible damage or loss to data in the quota files can result. It is also unwise to run B<quotacheck> on a live filesystem as actual usage may change during the scan. To prevent this, B<quotacheck> tries to remount the filesystem read-only before starting the scan. After the scan is done it remounts the filesystem read-write. You can disable this with option B<-m>. You can also make B<quotacheck> ignore the failure to remount the filesystem read-only with option B<-M>.
pl: Jest wysoce zalecane, aby uruchamiać B<quotacheck> przy wyłączonych dla danego systemu plików kwotach. W przeciwnym razie, mogą wystąpić uszkodzenia lub utrata danych w plikach kwot. Nie jest również rozsądnym uruchamianie B<quotacheck> na aktywnym systemie plików, gdyż aktualne zużycie zasobów może ulec zmianie podczas przeszukiwania. Aby temu zapobiec, B<quotacheck> próbuje przełączyć system plików w tryb "tylko do odczytu", zanim rozpocznie przeszukiwanie. Po zakończeniu przeszukiwania system plików jest przełączany w tryb "do odczytu i zapisu". Można to wyłączyć za pomocą opcji B<-m>. Można również za pomocą opcji B<-M> spowodować, aby B<quotacheck> ignorował niepomyślne przełączenie systemu plików w tryb "tylko do odczytu".

source: OPTIONS
pl: OPCJE

source: B<-b, --backup>
pl: B<-b>

source: Forces B<quotacheck> to make backups of the quota file before writing the new data.
pl: Wymusza tworzenie przez B<quotacheck> kopii zapasowych pliku kwot przed zapisaniem nowych danych.

source: B<quotacheck> reports its operation as it progresses. Normally it operates silently. If the option is specified twice, also the current directory is printed (note that printing can slow down the scan measurably).
pl: Sygnalizuje przez B<quotacheck> postęp operacji. Normalnie, działa on po cichu. Jeśli poda się tę opcję dwukrotnie, wypisywany jest również bieżący katalog (proszę zauważyć, że może to spowolnić przeszukiwanie, w dający się odczuć sposób).

source: Enable debugging mode. It will result in a lot of information which can be used in debugging the program. The output is very verbose and the scan will be slow.
pl: Tryb odpluskwiania. Podaje mnóstwo informacji, które mogą posłużyć do wyszukiwania błędów w programie. Wynik jest bardzo szczegółowy a przeszukiwanie - powolne.

source: B<-u, --user>
pl: B<-u>, B<--user>

source: Only user quotas listed in I</etc/mtab> or on the filesystems specified are to be checked. This is the default action.
pl: Sprawdza jedynie kwoty dyskowe użytkowników na systemach plików wymienionych w I</etc/mtab> lub podanych w linii poleceń. Jest to zachowanie domyślne.

source: B<-g, --group>
pl: B<-g>, B<--group>

source: Only group quotas listed in I</etc/mtab> or on the filesystems specified are to be checked.
pl: Sprawdza jedynie kwoty dyskowe grup na systemach plików wymienionych w I</etc/mtab> lub podanych w wierszu linii polecenia.

source: Don't read existing quota files. Just perform a new scan and save it to disk. B<quotacheck> also skips scanning of old quota files when they are not found.
pl: Nie czyta istniejących plików kwot. Po prostu wykonuje przeszukanie i zapisuje jego wyniki na dysku. B<quotacheck> pominie również poszukiwanie starych plików kwot, gdy ich nie znajdzie.

source: Forces checking and writing of new quota files on filesystems with quotas enabled. This is not recommended as the created quota files may be out of sync.
pl: Wymusza sprawdzanie systemu plików przy włączonych kwotach. Jest to niezalecane, gdyż utworzone pliki kwot mogą być nieaktualne.

source: This flag forces checking of filesystem in read-write mode if a remount fails. Do this only when you are sure no process will write to a filesystem while scanning.
pl: Opcja ta wymusza sprawdzanie systemu plików w trybie "do odczytu i zapisu", gdy przełączenie w tryb "tylko do odczytu" się nie powiedzie. Należy to robić, gdy ma się pewność, że żaden proces nie zapisuje na przeszukiwanym systemie plików.

source: Don't try to remount filesystem read-only. See comment with option B<-M>.
pl: Omija próby przełączenia systemu plików w tryb "tylko do odczytu". Patrz komentarz do opcji B<-M>.

source: Interactive mode. By default B<quotacheck> exits when it finds an error. In interactive mode user is asked for input instead. See option B<-n>.
pl: Tryb interaktywny. Domyślnie, B<quotacheck> kończy pracę po wykryciu błędu. W trybie interaktywnym użytkownik jest pytany o decyzję. Patrz opcja B<-n>.

source: If the quota files become corrupted, it is possible for duplicate entries for a single user or group ID to exist. Normally in this case, B<quotacheck> exits or asks user for input. When this option is set, the first entry found is always used (this option works in interactive mode too).
pl: Jeśli plik kwot jest uszkodzony, mogą pojawić się podwójne wpisy dla poszczególnych identyfikatorów użytkowników lub grup. Normalnie, w takiej sytuacji B<quotacheck> kończy pracę lub pyta użytkownika o decyzję. Przy włączeniu tej opcji, używany jest zawsze pierwszy wpis (działa ona również w trybie interakcyjnym).

source: B<-F, --format=>I<format-name>
pl: B<-F>, B<--format=>I<nazwa-formatu>

source: Check and fix quota files of specified format (ie. don't perform format auto-detection). This is recommended as detection might not work well on corrupted quota files. Possible format names are: B<vfsold> Original quota format with 16-bit UIDs / GIDs, B<vfsv0> Quota format with 32-bit UIDs / GIDs, 64-bit space usage, 32-bit inode usage and limits, B<vfsv1> Quota format with 64-bit quota limits and usage, B<rpc> (quota over NFS), B<xfs> (quota on XFS filesystem)
pl: Sprawdza kwoty według podanego formatu (tzn. nie jest wykonywane automatyczne wykrywanie formatu). Jest to zalecane, gdyż detekcja może nie działać poprawnie w przypadku uszkodzonych plików kwot. Dozwolone są następujące nazwy formatów: B<vfsold> - pierwotny format udziałów z 16-bitowymi UID-ami/GID-ami, B<vfsv0> - format udziałów z 32-bitowymi UID-ami/GID-ami, 64-bitowe użycie przestrzeni, 32-bitowe użycie i-węzłów oraz limity, B<vfsv1> - format udziałów z 64-bitowymi limitami i użyciem, B<rpc> - udziały poprzez NFS, B<xfs> - udziały w systemie plików XFS.

source: B<-a, --all>
pl: B<-a>, B<--all>

source: Check all mounted non-NFS filesystems in B</etc/mtab>
pl: Sprawdza wszystkie zamontowane, różne od NFS systemy plików wymienione w B</etc/mtab>

source: When used together with the B<-a> option, all filesystems except for the root filesystem are checked for quotas.
pl: Używane w połączeniu z opcją B<-a> powoduje sprawdzenie kwot na wszystkich systemach plików, oprócz głównego.

source: NOTE
pl: UWAGA

source: B<quotacheck> should only be run by super-user. Non-privileged users are presumably not allowed to read all the directories on the given filesystem.
pl: B<quotacheck> powinno być uruchamiane tylko przez superużytkownika. Użytkownicy nieuprzywilejowani przypuszczalnie nie mają praw do odczytu wszystkich katalogów danego systemu plików.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: FILES
pl: PLIKI

source: B<aquota.user or aquota.group>
pl: B<aquota.user> lub B<aquota.group>

source: located at filesystem root with quotas (version 2 quota, non-XFS filesystems)
pl: pliki kwot umieszczone w głównym katalogu systemu plików (wersja 2 kwot, systemy plików inne niż XFS)

source: B<quota.user or quota.group>
pl: B<quota.user> lub B<quota.group>

source: located at filesystem root with quotas (version 1 quota, non-XFS filesystems)
pl: pliki kwot umieszczone w głównym katalogu systemu plików (wersja 1 kwot, systemy plików inne niż XFS)

source: names and locations of mounted filesystems
pl: nazwy i lokalizacja zamontowanych systemów plików

source: AUTHOR
pl: AUTOR

source: Based on old B<quotacheck> by:
pl: W oparciu o starą wersję B<quotacheck> autorstwa:

source: Edvard Tuinder \E<lt>ed@elm.net\E<gt>
pl: Edvarda Tuindera \E<lt>ed@elm.net\E<gt>

source: Marco van Wieringen \E<lt>mvw@planets.elm.net\E<gt>
pl: Marco van Wieringena \E<lt>mvw@planets.elm.net\E<gt>
