Repository: sebras/manpages-l10n
Catalog: po/*/man8/repquota.8.po
Languages: pl

source: NAME
pl: NAZWA

source: repquota - summarize quotas for a filesystem
pl: repquota - podsumowanie kwot dyskowych dla systemu plików

source: SYNOPSIS
pl: SKŁADNIA

source: B</usr/sbin/repquota> [ B<-vspiugP> ] [ B<-c> | B<-C> ] [ B<-t> | B<-n> ] [ B<-F> I<format-name> ] I<filesystem>.\|.\|.
pl: B</usr/sbin/repquota> [ B<-vspiugP> ] [ B<-c> | B<-C> ] [ B<-t> | B<-n> ] [ B<-F> I<nazwa-formatu> ] I<system-plików>.\|.\|.

source: B</usr/sbin/repquota> [ B<-avtpsiugP> ] [ B<-c> | B<-C> ] [ B<-t> | B<-n> ] [ B<-F> I<format-name> ]
pl: B</usr/sbin/repquota> [ B<-avtpsiugP> ] [ B<-c> | B<-C> ] [ B<-t> | B<-n> ] [ B<-F> I<nazwa-formatu> ]

source: DESCRIPTION
pl: OPIS

source: repquota command
pl: polecenie repquota

source: \fLrepquota\fR \(em summarize quotas
pl: repquota - podsumowanie kwot dyskowych

source: B<repquota> prints a summary of the disc usage and quotas for the specified file systems. For each user the current number of files and amount of space (in kilobytes) is printed, along with any quota limits set with B<edquota>(8) or B<setquota>(8). In the second column repquota prints two characters marking which limits are exceeded. If user is over his space softlimit or reaches his space hardlimit in case softlimit is unset, the first character is '+'. Otherwise the character printed is '-'. The second character denotes the state of inode usage analogously.
pl: B<repquota> wypisuje podsumowanie użycia dysku i limity kwot dla podanych systemów plików. Dla każdego użytkownika wyświetlana jest liczba jego plików oraz przestrzeń dyskowa (w kilobajtach) razem z ograniczeniami kwot ustawionymi przez B<edquota>(8) lub B<setquota>(8). W drugiej kolumnie B<repquota> wypisuje dwa znaki określające, które ograniczenia zostały przekroczone. Jeśli użytkownik przekroczył miękki limit przestrzeni dyskowej lub osiągnął ograniczenie twarde, a ograniczenie miękkie nie jest ustawione, to pierwszym znakiem jest "+". W przeciwnym wypadku wypisywany jest "-". Drugi znak w podobny sposób określa stan użycia i-węzłów.

source: B<repquota> has to translate ids of all users/groups/projects to names (unless option B<-n> was specified) so it may take a while to print all the information. To make translating as fast as possible B<repquota> tries to detect (by reading B</etc/nsswitch.conf>) whether entries are stored in standard plain text file or in a database and either translates chunks of 1024 names or each name individually. You can override this autodetection by B<-c> or B<-C> options.
pl: B<repquota> musi przetłumaczyć identyfikatory wszystkich użytkowników/grup/projektów na ich nazwy (chyba że użyto opcji B<-n>), tak więc wypisanie wszystkich informacji może zająć trochę czasu. Aby przyspieszyć to tłumaczenie B<repquota> próbuje określić (czytając plik B</etc/nsswitch.conf>), czy wpisy użytkowników/grup są przechowywane w standardowych plikach tekstowych, czy w bazie danych i albo tłumaczy pakiety 1024 nazw od razu, albo tłumaczy każdą nazwę z osobną. Można nadpisać tę autodetekcję za pomocą opcji B<-c> i B<-C>.

source: OPTIONS
pl: OPCJE

source: B<-a, --all>
pl: B<-a>, B<--all>

source: Report on all filesystems indicated in B</etc/mtab> to be read-write with quotas.
pl: Pokazanie raportu kwoty ze wszystkich systemów plików wymienionych w B</etc/mtab> jako do odczytu i zapisu.

source: Report all quotas, even if there is no usage. Be also more verbose about quotafile information.
pl: Pokazanie wszystkich kwot, nawet jeśli nie ma zużycia zasobów. Bardziej "gadatliwy" sposób wypisywania informacji z pliku kwot.

source: Cache entries to report and translate uids/gids to names in big chunks by scanning all users (default). This is good (fast) behaviour when using /etc/passwd file.
pl: Buforuje wpisy do zaraportowania i tłumaczy identyfikatory użytkowników i grup na nazwy przez skanowanie wszystkich użytkowników (zachowanie domyślne). Jest to dobre (szybkie) zachowanie, kiedy używa się pliku /etc/passwd.

source: Translate individual entries. This is faster when you have users stored in database.
pl: Tłumaczy poszczególne wpisy. Jest to szybsze, gdy użytkownicy są przechowywani w bazie danych.

source: Truncate user/group names longer than 9 characters. This results in nicer output when there are such names.
pl: Skracanie nazw użytkowników i grup dłuższych niż 9 znaków. Wynik jest bardziej czytelny niż normalny, gdy takie nazwy występują.

source: Don't resolve UIDs/GIDs to names. This can speedup printing a lot.
pl: Niezamienianie identyfikatorów użytkowników i grup na nazwy. Może to znacznie przyspieszyć wypisywanie informacji.

source: B<-s, --human-readable[=>I<units>]
pl: B<-s, --human-readable>[B<=>I<jednostki>]

source: Try to report used space, number of used inodes and limits in more appropriate units than the default ones. Units can be also specified explicitely by an optional argument in format [ B<kgt> ],[ B<kgt> ] where the first character specifies space units and the second character specifies inode units.
pl: Próbuje wypisać użyte miejsce, liczbę użytych i-węzłów i limity w czytelniejszych jednostkach niż domyślne. Jednostki można także narzucić opcjonalnym argumentem w postaci [ B<kgt> ],[ B<kgt> ] gdzie pierwszy znak określa jednostkę użytego miejsca, a drugi jednostkę i-węzłów.

source: When user is in grace period, report time in seconds since epoch when his grace time runs out (or has run out). Field is '0' when no grace time is in effect. This is especially useful when parsing output by a script.
pl: Jeśli użytkownik jest w okresie ulgi (grace period), to wyświetla czas w sekundach od początku epoki, kiedy ten okres się zakończy (lub zakończył). Pole jest równe "0", jeśli nie ma okresu ulgi. Jest to użyteczne podczas przetwarzania wyjścia za pomocą jakiegoś skryptu.

source: Ignore mountpoints mounted by automounter.
pl: Ignoruje punkty montowania ustanowione przez program automatycznego montowania (automounter).

source: B<-F, --format=>I<format-name>
pl: B<-F>, B<--format=>I<nazwa-formatu>

source: Report quota for specified format (ie. don't perform format autodetection). Possible format names are: B<vfsold> Original quota format with 16-bit UIDs / GIDs, B<vfsv0> Quota format with 32-bit UIDs / GIDs, 64-bit space usage, 32-bit inode usage and limits, B<vfsv1> Quota format with 64-bit quota limits and usage, B<xfs> (quota on XFS filesystem)
pl: Podawanie kwot według podanego formatu (tzn. nie jest wykonywana autodetekcja formatu). Dozwolone są następujące nazwy formatów: B<vfsold> - oryginalny format kwot z 16-bitowymi identyfikatorami użytkowników i grup, B<vfsv0> - format kwoty z 32-bitowymi identyfikatorami użytkowników i grup, 64-bitową przestrzenią użycia i 32-bitowymi użyciem i-węzłów i ograniczeniami, B<vfsv1> - format kwoty z 64-bitowymi ograniczeniami kwot i użycia, B<xfs> - kwoty na systemie plików XFS.

source: B<-g, --group>
pl: B<-g>, B<--group>

source: Report quotas for groups.
pl: Pokazanie kwot grup.

source: Report quotas for projects.
pl: Pokazanie kwot projektów.

source: B<-u, --user>
pl: B<-u>, B<--user>

source: Report quotas for users. This is the default.
pl: Pokazanie kwot użytkowników. Jest to zachowanie domyślne.

source: B<-O, --output=>I<format-name>
pl: B<-O, --output=>I<nazwa-formatu>

source: Output quota report in the specified format. Possible format names are: B<default> The default format, optimized for console viewing B<csv> Comma-separated values, a text file with the columns delimited by commas B<xml> Output is XML encoded, useful for processing with XSLT
pl: Wypisuje podsumowanie kwot w podanym formacie. Dopuszczalne wartości formatu to: B<default> Format domyślny, zoptymalizowany do wyświetlania w terminalu; B<csv> Plik tekstowy z wartościami rozdzielonymi przecinkami (CSV); B<xml> Wynik w formacie XML, użyteczne do przetwarzania za pomocą XSLT.

source: Only the super-user may view quotas which are not their own.
pl: Tylko superużytkownik może przeglądać cudze kwoty.

source: FILES
pl: PLIKI

source: B<aquota.user> or B<aquota.group>
pl: B<aquota.user> lub B<aquota.group>

source: quota file at the filesystem root (version 2 quota, non-XFS filesystems)
pl: pliki kwot dyskowych umieszczone w głównym katalogu systemu plików (wersja 2 kwot, systemy plików inne niż XFS)

source: B<quota.user> or B<quota.group>
pl: B<quota.user> lub B<quota.group>

source: quota file at the filesystem root (version 1 quota, non-XFS filesystems)
pl: pliki kwot dyskowych umieszczone w głównym katalogu systemu plików (wersja 1 kwot, systemy plików inne niż XFS)

source: default filesystems
pl: domyślne systemy plików

source: default set of users
pl: domyślny zbiór użytkowników

source: default set of groups
pl: domyślny zbiór grup

source: SEE ALSO
pl: ZOBACZ TAKŻE
