Repository: sebras/manpages-l10n
Catalog: po/*/man8/resize2fs.8.po
Languages: fr, pl

source: August 2021
fr: Août 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4

source: NAME
fr: NOM
pl: NAZWA

source: resize2fs - ext2/ext3/ext4 file system resizer
fr: resize2fs - Redimensionner un système de fichiers ext2/ext3/ext4
pl: resize2fs - zmienia rozmiar systemu plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<resize2fs> [ B<-fFpPMbs> ] [ B<-d> I<debug-flags> ] [ B<-S> I<RAID-stride> ] [ B<-z> I<undo_file> ] I<device> [ I<size> ]
fr: B<resize2fs> [ B<-fFpPMbs> ] [ B<-d> I<drapeaux_débogage> ] [ B<-S> I<bande_RAID> ] [ B<-z> I<fichier_récupération> ] I<périphérique> [ I<taille> ]
pl: B<resize2fs> [ B<-fFpPMbs> ] [ B<-d> I<flagi-debugowania> ] [ B<-S> I<rozmiar-części-RAID> ] [ B<-z> I<plik-cofnięcia> ] I<urządzenie> [ I<rozmiar> ]

source: DESCRIPTION
pl: OPIS

source: The B<resize2fs> program will resize ext2, ext3, or ext4 file systems. It can be used to enlarge or shrink an unmounted file system located on I<device>. If the file system is mounted, it can be used to expand the size of the mounted file system, assuming the kernel and the file system supports on-line resizing. (Modern Linux 2.6 kernels will support on-line resize for file systems mounted using ext3 and ext4; ext3 file systems will require the use of file systems with the resize_inode feature enabled.)
fr: Le programme B<resize2fs> change la taille de systèmes de fichiers ext2, ext3 ou ext4. Il peut être utilisé pour augmenter ou réduire la taille d'un système de fichiers non monté indiqué par I<périphérique>. Si le système de fichiers est monté, il peut augmenter la taille du système de fichiers en supposant que le noyau et le système de fichiers gèrent le changement de taille à chaud (les noyaux Linux 2.6 modernes permettent de ne changer la taille à chaud que pour les systèmes de fichiers ext3 et ext4. Les systèmes de fichiers ext3 nécessiteront l'activation de la fonctionnalité resize_inode).
pl: Program B<resize2fs> zmienia rozmiar systemów plików ext2, ext3 i ext4. Można go użyć do zwiększania lub zmniejszenia rozmiaru odmontowanego systemu plików znajdującego się na I<urządzeniu>. Jeśli system plików jest zamontowany, można go zwiększyć, jeśli tylko jądro i system plików obsługuje zmianę rozmiaru on-line. Aktualne jądra Linux 2.6 będą obsługiwały zmianę rozmiaru online w systemach plików zamontowanych jako ext3 i ext4, system plików ext3 wymaga przy tym włączonej funkcji resize_inode.

source: The I<size> parameter specifies the requested new size of the file system. If no units are specified, the units of the I<size> parameter shall be the file system blocksize of the file system. Optionally, the I<size> parameter may be suffixed by one of the following units designators: 'K', 'M', 'G', 'T' (either upper-case or lower-case) or 's' for power-of-two kilobytes, megabytes, gigabytes, terabytes or 512 byte sectors respectively. The I<size> of the file system may never be larger than the size of the partition. If I<size> parameter is not specified, it will default to the size of the partition.
fr: Le paramètre I<taille> indique la taille demandée du système de fichiers. Si aucune unité n'est précisée, l'unité du paramètre I<taille> est la taille de bloc du système de fichiers. En option, le paramètre I<taille> peut être suffixé d'un indicateur d'unité : « K », « M », « G » ou « T » (casse indifférenciée) ou « s » pour respectivement des kilooctets, mégaoctets, gigaoctets ou téraoctets (puissance de deux) ou des secteurs de 512 octets. La I<taille> du système de fichiers ne devrait jamais être supérieure à la taille de la partition. Si le paramètre I<taille> n'est pas utilisé, la taille par défaut est la taille de la partition.
pl: Parametr I<rozmiar> określa żądany nowy rozmiar systemu plików. Jeśli nie poda się jednostki, parametr ten określa rozmiar liczony w blokach systemu plików. Opcjonalnie I<rozmiar> może przyjąć jeden z przyrostków oznaczających jednostkę: B<s> (sektor), B<K> (kilobajt), B<M> (megabajt), B<G> (gigabajt) lub B<T> (terabajt); przy czym poza przyrostkiem B<s>, pozostałe mogą być zapisane wielką lub małą literą. I<Rozmiar> nie może być nigdy większy od rozmiaru partycji. Jeśli nie poda się tego parametru, domyślnie zostanie przyjęty rozmiar partycji.

source: The B<resize2fs> program does not manipulate the size of partitions. If you wish to enlarge a file system, you must make sure you can expand the size of the underlying partition first. This can be done using B<fdisk>(8) by deleting the partition and recreating it with a larger size or using B<lvextend>(8), if you're using the logical volume manager B<lvm>(8). When recreating the partition, make sure you create it with the same starting disk cylinder as before! Otherwise, the resize operation will certainly not work, and you may lose your entire file system. After running B<fdisk>(8), run resize2fs to resize the ext2 file system to use all of the space in the newly enlarged partition.
fr: Le programme B<resize2fs> ne modifie pas la taille des partitions. Si vous voulez augmenter la taille d'un système de fichiers, vous devez dans un premier temps augmenter la taille de sa partition, ce qui peut être fait à l'aide de B<fdisk>(8) en détruisant la partition et en en recréant une plus large ou en utilisant B<lvextend>(8), si vous utilisez le gestionnaire de volumes logiques B<lvm>(8). Quand vous recréez la partition, assurez-vous que vous la créez avec le même cylindre de début qu'avant ! Autrement, le redimensionnement ne fonctionnera probablement pas et vous pourriez perdre complètement le système de fichiers. Après avoir lancé B<fdisk>(8), exécutez B<resize2fs> pour changer la taille du système de fichiers ext2 pour utiliser toute la taille disponible sur la partition.
pl: Program B<resize2fs> nie zmienia rozmiaru partycji. Aby zwiększyć rozmiar systemu plików należy najpierw zwiększyć rozmiar partycji, na której się on znajduje. Można to uczynić programem B<fdisk>(8) usuwając ją i tworząc na nowo większą lub za pomocą B<lvextend>(8) jeśli używa się menedżera woluminów logicznych B<lvm>(8). Pierwsza metoda wymaga upewnienia się, że tworzy się nową partycję z tym samym cylindrem początkowym co poprzednio. W przeciwnym wypadku operacja zmiany rozmiaru nie powiedzie się i można utracić cały system plików. Po uruchomieniu B<fdisk>(8), należy użyć programu B<resize2fs> do zmiany rozmiaru systemu plików ext2 tak, aby skorzystał on z całej dostępnej przestrzeni świeżo powiększonej partycji.

source: If you wish to shrink an ext2 partition, first use B<resize2fs> to shrink the size of file system. Then you may use B<fdisk>(8) to shrink the size of the partition. When shrinking the size of the partition, make sure you do not make it smaller than the new size of the ext2 file system!
fr: Si vous souhaitez réduire une partition ext2, utilisez d'abord B<resize2fs> pour réduire la taille du système de fichiers. Vous pouvez ensuite utiliser B<fdisk>(8) pour réduire la taille de la partition, en vous assurant de ne pas la rendre plus petite que la nouvelle taille du système de fichiers ext2 !
pl: Aby zmniejszyć partycję ext2 należy najpierw skorzystać z programu B<resize2fs> do zmniejszenia systemu plików. Następnie można użyć B<fdisk>(8) do zmniejszenia rozmiaru partycji. Przy tej ostatniej czynności należy się upewnić, że partycja nie będzie mniejsza niż nowy rozmiar systemu plików ext2!

source: OPTIONS
pl: OPCJE

source: B<-d >I<debug-flags>
fr: B<-d> I<drapeaux_débogage>
pl: B<-d >I<flagi-debugowania>

source: Turns on various resize2fs debugging features, if they have been compiled into the binary. I<debug-flags> should be computed by adding the numbers of the desired features from the following list:
fr: Activer différentes fonctionnalités de débogage de B<resize2fs>, si elles ont été activées lors de la compilation du programme. I<drapeaux_débogage> doit être calculé en ajoutant les nombres associés à chacune des fonctionnalités voulues dans la liste suivante :
pl: Włącza różne funkcje debugowania resize2fs, jeśli zostały wkompilowane w plik binarny programu. I<Flagi-debugowania> można obliczyć dodając liczby przypisane żądanym funkcjom z poniższej listy.

source: 2 -\ Debug block relocations
fr: 2 -\ Déboguer le déplacement des blocs
pl: 2 -\ Debuguje relokację bloków

source: 4 -\ Debug inode relocations
fr: 4 -\ Déboguer le déplacement des inœuds
pl: 4 -\ Debuguje relokację i-węzłów

source: 8 -\ Debug moving the inode table
fr: 8 -\ Déboguer le déplacement des tables d'inœuds
pl: 8 -\ Debuguje przeniesienie tabeli i-węzłów

source: 16 -\ Print timing information
fr: 16 -\ Afficher les informations d'horodatage
pl: 16 -\ Wypisuje informacje związane z czasem

source: 32 -\ Debug minimum file system size (-M) calculation
fr: 32 -\ Déboguer le calcul de la taille minimale du système de fichiers (-M)
pl: 32 -\ Debuguje obliczenia minimalnego rozmiaru systemu plików (-M)

source: Forces resize2fs to proceed with the file system resize operation, overriding some safety checks which resize2fs normally enforces.
fr: Forcer B<resize2fs> à poursuivre le changement de taille du système de fichiers en ignorant les vérifications de sécurité que B<resize2fs> effectue normalement.
pl: Wymusza wykonanie operacji zmiany rozmiaru przez resize2fs, pomijając pewne zabezpieczenia które zwykle sprawdza resize2fs.

source: Flush the file system device's buffer caches before beginning. Only really useful for doing B<resize2fs> time trials.
fr: Purger les caches de tampon du périphérique hébergeant le système de fichiers avant de commencer. Ce n'est vraiment utile que pour mesurer la vitesse de B<resize2fs>.
pl: Wypróżnia bufory systemu plików przed uruchomieniem programu. Przydatne właściwie tylko w czasowych próbach B<resize2fs>.

source: B<-S >I<RAID-stride>
fr: B<-S> I<bande_RAID>
pl: B<-S >I<rozmiar-części-RAID>

source: The B<resize2fs> program will heuristically determine the RAID stride that was specified when the file system was created. This option allows the user to explicitly specify a RAID stride setting to be used by resize2fs instead.
fr: Le programme B<resize2fs> déterminera par des heuristiques la bande RAID qui a été indiquée lors de la création du système de fichiers. Cette option permet à l'utilisateur d'indiquer explicitement la bande RAID que B<resize2fs> doit utiliser.
pl: Program B<resize2fs> określa rozmiar części RAID (ang. RAID stride) podany przy tworzeniu systemu plików za pomocą heurystyki. Ta opcja pozwala bezpośrednio wskazać go użytkownikowi.

source: B<-z>I< undo_file>
fr: B<-z> I<fichier_annulations>
pl: B<-z> I<plik-zapasowy>

source: WARNING: The undo file cannot be used to recover from a power or system crash.
fr: AVERTISSEMENT : le fichier d’annulations ne peut pas être utilisé pour se remettre d'une coupure d'alimentation ou d'un plantage du système.
pl: OSTRZEŻENIE: Plik zapasowy nie pomoże w przypadku utraty zasilania lub zawieszenia systemu.

source: KNOWN BUGS
fr: BOGUES CONNUS
pl: ZNANE PROBLEMY

source: The minimum size of the file system as estimated by resize2fs may be incorrect, especially for file systems with 1k and 2k blocksizes.
fr: La taille minimale du système de fichiers estimée par B<resize2fs> peut ne pas être correcte, particulièrement pour les systèmes de fichiers avec une taille de bloc de 1 ko ou 2 ko.
pl: Minimalny rozmiar systemu plików oszacowany przez resize2fs może być nieprawidłowy, szczególnie dla systemów plików o rozmiarach bloków 1k i 2k.

source: AUTHOR
fr: AUTEUR
pl: AUTOR

source: B<resize2fs> was written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
fr: B<resize2fs> a été écrit par Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
pl: B<resize2fs> zostało napisane przez Theodore Ts'o E<lt>tytso@mit.eduE<gt>.

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: Resize2fs is Copyright 1998 by Theodore Ts'o and PowerQuest, Inc. All rights reserved. As of April, 2000 B<Resize2fs> may be redistributed under the terms of the GPL.
fr: Le copyright (1998) de B<resize2fs> appartient à Theodore Ts'o et PowerQuest, Inc. Tous droits réservés. Depuis avril 2000, B<resize2fs> peut être redistribué sous les conditions de la GPL.
pl: Resize2fs - prawa autorskie zastrzeżone w 1998 przez Theodore Ts'o i PowerQuest, Inc. Wszystkie prawa zastrzeżone. Według stanu na kwiecień 2000 B<resize2fs> może być rozpowszechniany na warunkach GPL.

source: SEE ALSO
fr: VOIR AUSSI
pl: ZOBACZ TAKŻE

source: February 2021
pl: luty 2021

source: E2fsprogs version 1.46.2
pl: E2fsprogs wersja 1.46.2

source: The B<resize2fs> program will resize ext2, ext3, or ext4 file systems. It can be used to enlarge or shrink an unmounted file system located on I<device>. If the filesystem is mounted, it can be used to expand the size of the mounted filesystem, assuming the kernel and the file system supports on-line resizing. (Modern Linux 2.6 kernels will support on-line resize for file systems mounted using ext3 and ext4; ext3 file systems will require the use of file systems with the resize_inode feature enabled.)
pl: Program B<resize2fs> zmienia rozmiar systemów plików ext2, ext3 i ext4. Można go użyć do zwiększania lub zmniejszenia rozmiaru odmontowanego systemu plików znajdującego się na I<urządzeniu>. Jeśli system plików jest zamontowany, można go zwiększyć, jeśli tylko jądro i system plików obsługuje zmianę rozmiaru on-line. Aktualne jądra Linux 2.6 będą obsługiwały zmianę rozmiaru online w systemach plików zamontowanych jako ext3 i ext4, system plików ext3 wymaga przy tym włączonej funkcji resize_inode.

source: The I<size> parameter specifies the requested new size of the filesystem. If no units are specified, the units of the I<size> parameter shall be the filesystem blocksize of the filesystem. Optionally, the I<size> parameter may be suffixed by one of the following units designators: 'K', 'M', 'G', 'T' (either upper-case or lower-case) or 's' for power-of-two kilobytes, megabytes, gigabytes, terabytes or 512 byte sectors respectively. The I<size> of the filesystem may never be larger than the size of the partition. If I<size> parameter is not specified, it will default to the size of the partition.
pl: Parametr I<rozmiar> określa żądany nowy rozmiar systemu plików. Jeśli nie poda się jednostki, parametr ten określa rozmiar liczony w blokach systemu plików. Opcjonalnie I<rozmiar> może przyjąć jeden z przyrostków oznaczających jednostkę: B<s> (sektor), B<K> (kilobajt), B<M> (megabajt), B<G> (gigabajt) lub B<T> (terabajt); przy czym poza przyrostkiem B<s>, pozostałe mogą być zapisane wielką lub małą literą. I<Rozmiar> nie może być nigdy większy od rozmiaru partycji. Jeśli nie poda się tego parametru, domyślnie zostanie przyjęty rozmiar partycji.

source: The B<resize2fs> program does not manipulate the size of partitions. If you wish to enlarge a filesystem, you must make sure you can expand the size of the underlying partition first. This can be done using B<fdisk>(8) by deleting the partition and recreating it with a larger size or using B<lvextend>(8), if you're using the logical volume manager B<lvm>(8). When recreating the partition, make sure you create it with the same starting disk cylinder as before! Otherwise, the resize operation will certainly not work, and you may lose your entire filesystem. After running B<fdisk>(8), run resize2fs to resize the ext2 filesystem to use all of the space in the newly enlarged partition.
pl: Program B<resize2fs> nie zmienia rozmiaru partycji. Aby zwiększyć rozmiar systemu plików należy najpierw zwiększyć rozmiar partycji, na której się on znajduje. Można to uczynić programem B<fdisk>(8) usuwając ją i tworząc na nowo większą lub za pomocą B<lvextend>(8) jeśli używa się menedżera woluminów logicznych B<lvm>(8). Pierwsza metoda wymaga upewnienia się, że tworzy się nową partycję z tym samym cylindrem początkowym co poprzednio. W przeciwnym wypadku operacja zmiany rozmiaru nie powiedzie się i można utracić cały system plików. Po uruchomieniu B<fdisk>(8), należy użyć programu B<resize2fs> do zmiany rozmiaru systemu plików ext2 tak, aby skorzystał on z całej dostępnej przestrzeni świeżo powiększonej partycji.

source: If you wish to shrink an ext2 partition, first use B<resize2fs> to shrink the size of filesystem. Then you may use B<fdisk>(8) to shrink the size of the partition. When shrinking the size of the partition, make sure you do not make it smaller than the new size of the ext2 filesystem!
pl: Aby zmniejszyć partycję ext2 należy najpierw skorzystać z programu B<resize2fs> do zmniejszenia systemu plików. Następnie można użyć B<fdisk>(8) do zmniejszenia rozmiaru partycji. Przy tej ostatniej czynności należy się upewnić, że partycja nie będzie mniejsza niż nowy rozmiar systemu plików ext2!

source: 32 -\ Debug minimum filesystem size (-M) calculation
pl: 32 -\ Debuguje obliczenia minimalnego rozmiaru systemu plików (-M)

source: Forces resize2fs to proceed with the filesystem resize operation, overriding some safety checks which resize2fs normally enforces.
pl: Wymusza wykonanie operacji zmiany rozmiaru przez resize2fs, pomijając pewne zabezpieczenia które zwykle sprawdza resize2fs.

source: Flush the filesystem device's buffer caches before beginning. Only really useful for doing B<resize2fs> time trials.
pl: Wypróżnia bufory systemu plików przed uruchomieniem programu. Przydatne właściwie tylko w czasowych próbach B<resize2fs>.

source: Prints out a percentage completion bars for each B<resize2fs> operation during an offline resize, so that the user can keep track of what the program is doing.
pl: Wypisuje procentowy pasek postępu do każdej operacji B<resize2fs> przy zmianie rozmiaru offline, dzięki czemu użytkownik może śledzić co robi program.

source: The B<resize2fs> program will heuristically determine the RAID stride that was specified when the filesystem was created. This option allows the user to explicitly specify a RAID stride setting to be used by resize2fs instead.
pl: Program B<resize2fs> określa rozmiar części RAID (ang. RAID stride) podany przy tworzeniu systemu plików za pomocą heurystyki. Ta opcja pozwala bezpośrednio wskazać go użytkownikowi.

source: The minimum size of the filesystem as estimated by resize2fs may be incorrect, especially for filesystems with 1k and 2k blocksizes.
pl: Minimalny rozmiar systemu plików oszacowany przez resize2fs może być nieprawidłowy, szczególnie dla systemów plików o rozmiarach bloków 1k i 2k.

source: December 2021
fr: Décembre 2021

source: The B<-b> and B<-s> options enable and disable the 64bit feature, respectively. The resize2fs program will, of course, take care of resizing the block group descriptors and moving other data blocks out of the way, as needed. It is not possible to resize the file system concurrent with changing the 64bit status.
fr: Les options B<-b> et B<-s> respectivement activent ou désactivent la fonctionnalité 64 bits. Le programme B<resize2fs> fera bien évidemment attention à redimensionner les descripteurs de groupe de blocs et de déplacer les autres blocs de données ailleurs comme nécessaire. Il n’est pas possible de redimensionner le système de fichiers et de changer simultanément l’état 64 bits.

source: Turns on the 64bit feature, resizes the group descriptors as necessary, and moves other metadata out of the way.
fr: Activer la fonctionnalité 64 bits, redimensionner les descripteurs comme il faut et déplacer les autres métadonnées ailleurs.

source: Shrink the file system to minimize its size as much as possible, given the files stored in the file system.
fr: Réduire le système de fichiers pour minimiser sa taille autant que possible en tenant compte des fichiers enregistrés dans le système de fichiers.

source: Print out percentage completion bars for each B<resize2fs> phase during an offline (non-trivial) resize operation, so that the user can keep track of what the program is doing. (For very fast resize operations, no progress bars may be displayed.)
fr: Afficher une barre de progression pour chaque phase de B<resize2fs> lors d'un redimensionnement à froid (non négligeable) pour que l'utilisateur puisse suivre ce que le programme fait. (Pour des oprétations très rapide, il est possible qu'aucune barre de progression ne s'affiche.)

source: Print an estimate of the number of file system blocks in the file system if it is shrunk using B<resize2fs>'s B<-M> option and then exit.
fr: Afficher une estimation du nombre de blocs de système de fichiers dans le système de fichiers si celui-ci est réduit en utilisant l’option B<-M> de B<resize2fs> et quitter.

source: Turns off the 64bit feature and frees blocks that are no longer in use.
fr: Activer la fonctionnalité 64 bits et libérer les blocs qui ne sont plus utilisés.

source: Before overwriting a file system block, write the old contents of the block to an undo file. This undo file can be used with e2undo(8) to restore the old contents of the file system should something go wrong. If the empty string is passed as the undo_file argument, the undo file will be written to a file named resize2fs-I<device>.e2undo in the directory specified via the I<E2FSPROGS_UNDO_DIR> environment variable.
fr: Avant d’écraser un bloc de système de fichiers, écrire le contenu du bloc dans un fichier de récupération. Ce fichier peut être utilisé par B<e2undo>(8) pour restaurer l’ancien contenu du système de fichiers si quelque chose se déroule mal. Si une chaîne vide est fournie comme argument pour I<fichier_récupération>, le fichier de récupération sera écrit sous le nom resize2fs-I<périphérique>.e2undo dans le répertoire indiqué par la variable d’environnement I<E2FSPROGS_UNDO_DIR>.
