Repository: sebras/manpages-l10n
Catalog: po/*/man8/resizecons.8.po
Languages: es

source: 17 Jan 1995
es: 17 de Enero de 1995

source: NAME
es: NOMBRE

source: resizecons - change kernel idea of the console size
es: resizecons - cambia la idea que tiene el núcleo del tamaño de la consola

source: SYNOPSIS
es: SINOPSIS

source: B<resizecons >I<COLSxROWS>
es: B<resizecons >I<COLUMNASxFILAS>

source: B<resizecons -lines >I<ROWS>
es: B<resizecons -lines >I<FILAS>

source: DESCRIPTION
es: DESCRIPCIÓN

source: The I<resizecons> command tries to change the videomode of the console. There are several aspects to this: (a) the kernel must know about it, (b) the hardware must know about it, (c) user programs must know about it, (d) the console font may have to be adapted.
es: La orden I<resizecons> intenta cambiar el modo de vídeo de la consola. Esto tiene varios aspectos: (a) el núcleo debe saber acerca de esto, (b) el equipo también debe saber de esto, (c) los programas de usuario también, y (d) el tipo de consola puede tener que ser adaptado.

source: (a) The kernel is told about the change using the ioctl VT_RESIZE. This causes the kernel to reallocate console screen memory for all virtual consoles, and might fail if there is not enough memory. (In that case, try to disallocate some virtual consoles first.) If this ioctl succeeds, but a later step fails (e.g., because you do not have root permissions), you may be left with a very messy screen.
es: (a) Se le informa al núcleo del cambio mediante la llamada a ioctl VT_RESIZE. Esto hace que el núcleo reasigne memoria de pantalla de consola para todas las consolas virtuales, y puede fallar si no hay bastante memoria. (En este caso, intente primero desasignar algunas consolas virtuales en desuso.) Si esta llamada a ioctl() tiene éxito, pero hay un fallo en un paso posterior (p.ej., porque Ud. no tenga permisos de root), su pantalla puede quedar en un estado muy confuso.

source: The most difficult part of this is (b), since it requires detailed knowledge of the video card hardware, and the setting of numerous registers. Only changing the number of rows is slightly easier, and I<resizecons> will try to do that itself, when given the I<-lines> option. (Probably, root permission will be required.) The command I<resizecons COLSxROWS> will execute I<restoretextmode -r COLSxROWS> (and hence requires that you have svgalib installed). Here COLSxROWS is a file that was created earlier by I<restoretextmode -w COLSxROWS.> Again, either root permissions are required, or I<restoretextmode> has to be suid root.
es: La parte más difícil de todo esto es (b), puesto que requiere un conocimiento detallado de la cacharrería de la tarjeta de vídeo, y el establecimiento de numerosos registros. Solo el cambio en el número de filas es algo más fácil, y I<resizecons> intentará hacerlo solo cuando se le da la opción I<-lines>. (Probablemente se requieran permisos de root.) La orden I<resizecons COLUMNASxFILAS> ejecutará I<restoretextmode -r COLUMNASxFILAS> (y por consiguiente requiere que uno tenga instalada svgalib). Aquí COLUMNASxFILAS es un fichero que fue creado anteriormente por I<restoretextmode -w COLUMNASxFILAS>. De nuevo, o harán falta permisos de root o I<restoretextmode> tiene que estar suid root.

source: In order to deal with (c), I<resizecons> does a `stty rows ROWS cols COLS' for each active console (in the range tty0..tty15), and sends a SIGWINCH signal to I<selection> if it finds the file /tmp/selection.pid.
es: Para tratar con (c), I<resizecons> hace un `stty rows FILAS cols COLUMNAS' para cada consola activa (en el rango tty0..tty15), y envía una señal SIGWINCH a I<selection> si encuentra el fichero /tmp/selection.pid.

source: Finally, (d) is dealt with by executing a I<setfont> command. Most likely, the wrong font is loaded, and you may want to do another I<setfont> yourself afterwards.
es: Finalmente, se trata con (d) ejecutando una orden I<setfont>. Muy probablemente, se carga el tipo equivocado, y uno puede querer dar uno mismo otra orden I<setfont> después de todo.

source: BUGS
es: ERRORES

source: I<resizecons> does not work on all hardware. This command used to be called I<resize,> but was renamed to avoid conflict with another command with the same name.
es: I<resizecons> no funciona en todos los equipos. Esta orden se llamaba antes I<resize,> pero se renombró para evitar conflictos con otra orden con el mismo nombre.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: This command used to be called I<resize,> but was renamed to avoid conflict with another command with the same name.
es: Esta orden se llamaba antes I<resize,> pero se renombró para evitar conflictos con otra orden con el mismo nombre.
