Repository: sebras/manpages-l10n
Catalog: po/*/man8/rfkill.8.po
Languages: de, uk

source: System Administration
uk: Керування системою

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: rfkill - tool for enabling and disabling wireless devices
de: rfkill - Werkzeug zum Aktivieren und Deaktivieren von Drahtlosgeräten
uk: rfkill — інструмент для вмикання або вимикання бездротових пристроїв

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<rfkill> [options] [I<command>] [I<ID>|I<type> ...]
de: B<rfkill> [Optionen] [I<Befehl>] [I<Kennung>|I<Typ> …]
uk: B<rfkill> [параметри] [I<команда>] [I<ідентифікатор>|I<тип> ...]

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: B<rfkill> lists, enabling and disabling wireless devices.
de: B<rfkill> listet Drahtlosgeräte auf und aktiviert oder deaktiviert sie.
uk: B<rfkill> виводить список бездротових пристроїв, вмикає та вимикає такі пристрої.

source: The command "list" output format is deprecated and maintained for backward compatibility only. The new output format is the default when no command is specified or when the option B<--output> is used.
de: Das Listenausgabeformat des Befehls ist veraltet und wird nur zwecks Abwärtskompatibilität behalten. Das neue Ausgabeformat ist der Standard, wenn kein Befehl angegeben oder die Option B<--output> verwendet wird.
uk: Формат виведення команди «list» вважається застарілим, його супровід здійснюється лише для зворотної сумісності. Новий формат виведення є типовим, якщо не вказано жодної команди або якщо використано параметр B<--output>.

source: The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using the B<--output> option together with a columns list in environments where a stable output is required.
de: Die standardmäßige Ausgabe kann sich ändern. Daher sollten Sie vermeiden, standardmäßige Ausgaben in Ihren Skripten zu verwenden, wo immer es möglich ist. Definieren Sie in Umgebungen, wo eine stabile Ausgabe erforderlich ist, stets die erwarteten Spalten, indem Sie die Option B<--output> zusammen mit einer Spaltenliste angeben.
uk: Типовий формат виведення може бути змінено авторами програми. Тому, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> разом зі списком стовпчиків у середовищах, де потрібне виведення стабільного набору даних.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: Use JSON output format.
de: verwendet das JSON-Ausgabeformat.
uk: Bикористати формат виведення JSON.

source: Do not print a header line.
de: unterdrückt die Ausgabe einer Kopfzeile.
uk: Не виводити рядок заголовка.

source: Specify which output columns to print. Use B<--help> to get a list of available columns.
de: gibt an, welche Spalten ausgegeben werden sollen Mit B<--help> erhalten Sie eine Liste aller verfügbaren Spalten.
uk: Вказати, які стовпчики слід вивести. Скористайтеся параметром B<--help>, щоб ознайомитися зі списком доступних стовпчиків.

source: Output all available columns.
de: gibt alle verfügbaren Spalten aus.
uk: Вивести список усіх доступних стовпчиків.

source: Use the raw output format.
de: verwendet das Rohformat für die Ausgabe.
uk: Використовувати формат виведення без обробки.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: COMMANDS
de: BEFEHLE
uk: КОМАНДИ

source: Listen for rfkill events and display them on stdout.
de: wartet auf rfkill-Ereignisse und schreibt sie in die Standardausgabe.
uk: Очікувати на події rfkill і виводити дані щодо них до стандартного виведення (stdout).

source: B<list> [I<id>|I<type> ...]
de: B<list> [I<Kennung>|I<Typ> …]
uk: B<list> [I<ідентифікатор>|I<тип> ...]

source: List the current state of all available devices. The command output format is deprecated, see the B<DESCRIPTION> section. It is a good idea to check with B<list> command I<id> or I<type> scope is appropriate before setting B<block> or B<unblock>. Special I<all> type string will match everything. Use of multiple I<ID> or I<type> arguments is supported.
de: listet den aktuellen Status aller verfügbaren Geräte auf. Das Befehlsausgabeformat ist veraltet, siehe den Abschnitt B<BESCHREIBUNG>. Es ist empfehlenswert, mit B<list> zu prüfen, ob I<Kennung> oder I<Typ> anwendbar sind, bevor Sie B<block> oder B<unblock> setzen. Die spezielle Typzeichenkette I<all> berücksichtigt alles. Die Verwendung mehrerer I<Kennung>- oder I<Typ>-Argumente wird ebenfalls unterstützt.
uk: Вивести список поточного стану усіх доступних пристроїв. Формат виведення команди вважається застарілим, див. розділ B<ОПИС>. Завжди варто перевірити за допомогою команди B<list>, чи є область значень I<ідентифікатор> або I<тип> відповідною, до встановлення B<block> або B<unblock>. Особливий рядок типу I<all> вказує, що слід використати усі варіанти. Передбачено підтримку визначення декількох аргументів I<ідентифікатор> або I<тип>.

source: B<block> I<id>|I<type> [...]
de: B<block> I<Kennung>|I<Typ> […]
uk: B<block> I<ідентифікатор>|I<тип> [...]

source: Disable the corresponding device.
de: deaktiviert das entsprechende Gerät.
uk: Вимкнути відповідний пристрій.

source: B<unblock> I<id>|I<type> [...]
de: B<unblock> I<Kennung>|I<Typ> […]
uk: B<unblock> I<ідентифікатор>|I<тип> [...]

source: Enable the corresponding device. If the device is hard-blocked, for example via a hardware switch, it will remain unavailable though it is now soft-unblocked.
de: aktiviert das entsprechende Gerät. Wenn das Gerät hart blockiert ist, zum Beispiel durch einen Hardwareschalter, ist es weiterhin nicht verfügbar, obwohl es nun auf Softwareebene nicht mehr blockiert ist.
uk: Увімкнути відповідний пристрій. Якщо пристрій апаратно заблоковано, наприклад, за допомогою апаратного перемикача, він лишатиметься недоступним, хоча програмно його буде розблоковано.

source: B<toggle> I<id>|I<type> [...]
de: B<toggle> I<Kennung>|I<Typ> […]
uk: B<toggle> I<ідентифікатор>|I<тип> [...]

source: Enable or disable the corresponding device.
de: aktiviert oder deaktiviert das entsprechende Gerät.
uk: Увімкнути або вимкнути відповідний пристрій.

source: EXAMPLE
de: BEISPIEL
uk: ПРИКЛАДИ

source: AUTHORS
de: AUTOREN
uk: АВТОРИ

source: B<rfkill> was originally written by
de: B<rfkill> wurde ursprünglich geschrieben von
uk: Першу версію B<rfkill> було написано

source: and
de: und
uk: і

source: The code has been later modified by
de: Der Code wurde später von
uk: Пізніше до коду було внесено зміни

source: for the util-linux project.
de: für das Util-linux-Projekt angepasst.
uk: для проєкту util-linux.

source: This manual page was written by
de: Diese Handbuchseite wurde von
uk: Цю сторінку підручника написано

source: for the Debian project (and may be used by others).
de: für das Debian-Projekt geschrieben (darf aber auch von anderen verwendet werden).
uk: для проекту Debian (її можна використовувати і у інших проектах).

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: The B<rfkill> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<rfkill> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<rfkill> є частиною пакунка util-linux, який можна отримати з

source: B<rfkill> [I<options>] [I<command>] [I<id|type>\ ...]
de: B<rfkill> [I<Optionen>] [I<Befehl>] [I<Kennung|Typ>\ …]
uk: B<rfkill> [I<параметри>] [I<команда>] [I<ідентифікатор|тип>\ ...]

source: The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using the B<--output> option together with a columns list in environments where a stable output is required.
de: Die standardmäßige Ausgabe kann sich ändern. Daher sollten Sie vermeiden, standardmäßige Ausgaben in Ihren Skripten zu verwenden, wo immer es möglich ist. Definieren Sie in Umgebungen, wo eine stabile Ausgabe erforderlich ist, stets die erwarteten Spalten, indem Sie die Option B<--output> zusammen mit einer Spaltenliste angeben.
uk: Типовий формат виведення може бути змінено авторами програми. Тому, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> разом зі списком стовпчиків у середовищах, де потрібне виведення стабільного набору даних.

source: Specify which output columns to print. Use --help to get a list of available columns.
de: gibt an, welche Spalten ausgegeben werden sollen. Mit --help erhalten Sie eine Liste aller verfügbaren Spalten.
uk: Вказати, які стовпчики слід вивести. Скористайтеся параметром --help, щоб ознайомитися зі списком доступних стовпчиків.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: B<list >[I<id>|I<type> ...]
de: B<list >[I<Kennung>|I<Typ> …]
uk: B<list >[I<ідентифікатор>|I<тип> ...]

source: List the current state of all available devices. The command output format is deprecated, see the section DESCRIPTION. It is a good idea to check with B<list> command I<id> or I<type> scope is appropriate before setting B<block> or B<unblock>. Special I<all> type string will match everything. Use of multiple I<id> or I<type> arguments is supported.
de: listet den aktuellen Status aller verfügbaren Geräte auf. Das Befehlsausgabeformat ist veraltet, siehe den Abschnitt BESCHREIBUNG. Es ist empfehlenswert, mit B<list> zu prüfen, ob I<Kennung> oder I<Typ> anwendbar sind, bevor Sie B<block> oder B<unblock> setzen. Die spezielle Typzeichenkette I<all> berücksichtigt alles. Die Verwendung mehrerer I<Kennung>- oder I<Typ>-Argumente wird ebenfalls unterstützt.
uk: Вивести список поточного стану усіх доступних пристроїв. Формат виведення команди вважається застарілим, див. розділ «ОПИС». Завжди варто перевірити за допомогою команди B<list>, чи є область значень I<ідентифікатор> або I<тип> відповідною, до встановлення B<block> або B<unblock>. Особливий рядок типу I<all> вказує, що слід використати усі варіанти. Передбачено підтримку визначення декількох аргументів I<ідентифікатор> або I<тип>.

source: B<block id>|B<type> [...]
de: B<block Kennung>|B<Typ> […]
uk: B<block ідентифікатор>|B<тип> [...]

source: B<unblock id>|B<type> [...]
de: B<unblock Kennung>|B<Typ> […]
uk: B<unblock ідентиякатор>|B<тип> [...]

source: Enable the corresponding device. If the device is hard-blocked, for example via a hardware switch, it will remain unavailable though it is now soft-unblocked.
de: aktiviert das entsprechende Gerät. Wenn das Gerät hart blockiert ist, zum Beispiel durch einen Hardwareschalter, ist es weiterhin nicht verfügbar, obwohl es nun auf Softwareebene nicht mehr blockiert ist.
uk: Увімкнути відповідний пристрій. Якщо пристрій апаратно заблоковано, наприклад, за допомогою апаратного перемикача, він лишатиметься недоступним, хоча програмно його буде розблоковано.

source: B<rfkill> was originally written by E<.MT johannes@\:sipsolutions.\:net> Johannes Berg E<.ME> and E<.MT marcel@\:holtmann.\:org> Marcel Holtmann E<.ME .> The code has been later modified by E<.MT kerolasa@\:iki.\:fi> Sami Kerola E<.ME> and E<.MT kzak@\:redhat.\:com> Karel Zak E<.ME> for util-linux project.
de: B<rfkill> wurde ursprünglich von E<.MT johannes@\:sipsolutions.\:net> Johannes Berg E<.ME> und E<.MT marcel@\:holtmann.\:org> Marcel Holtmann E<.ME> geschrieben. Der Code wurde später von E<.MT kerolasa@\:iki.\:fi> Sami Kerola E<.ME> und E<.MT kzak@\:redhat.\:com> Karel Zak E<.ME> fü das Projekt util-linux angepasst.
uk: Першу версію B<rfkill> було написано E<.MT johannes@\:sipsolutions.\:net> Johannes Berg E<.ME> та E<.MT marcel@\:holtmann.\:org> Marcel Holtmann E<.ME .>. Пізніше до коду було внесено зміни E<.MT kerolasa@\:iki.\:fi> Sami Kerola E<.ME> та E<.MT kzak@\:redhat.\:com> Karel Zak E<.ME> для проєкту util-linux.

source: This manual page was written by E<.MT linux@\:youmustbejoking.\:demon.\:co.uk> Darren Salt E<.ME ,> for the Debian project (and may be used by others).
de: Diese Handbuchseite wurde von E<.MT linux@\:youmustbejoking.\:demon.\:co.uk> Darren Salt E<.ME> für das Debian-Projekt geschrieben (darf aber auch von anderen verwendet werden).
uk: Цю сторінку підручника створено E<.MT linux@\:youmustbejoking.\:demon.\:co.uk> Darren Salt E<.ME ,> для проекту Debian (її можна використовувати і у інших проектах).

source: B<powertop>(8), B<systemd-rfkill>(8), E<.UR https://\:git.\:kernel.\:org/\:pub/\:scm/\:linux/\:kernel/\:git/\:torvalds/\:linux.git/\:tree/\:Documentation/\:driver-api/\:rfkill.rst> Linux kernel documentation E<.UE>
de: B<powertop>(8), B<systemd-rfkill>(8), E<.UR https://\:git.\:kernel.\:org/\:pub/\:scm/\:linux/\:kernel/\:git/\:torvalds/\:linux.git/\:tree/\:Documentation/\:driver-api/\:rfkill.rst> Linux-Kernel-Dokumentation E<.UE>
uk: B<powertop>(8), B<systemd-rfkill>(8), E<.UR https://\:git.\:kernel.\:org/\:pub/\:scm/\:linux/\:kernel/\:git/\:torvalds/\:linux.git/\:tree/\:Documentation/\:driver-api/\:rfkill.rst> документація до ядра Linux E<.UE>

source: The rfkill command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
de: Der Befehl »rfkill« ist Teil des Pakets util-linux, welches aus dem E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel-Archiv E<.UE> heruntergeladen werden kann.
uk: Програма rfkill є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: B<toggle id>|B<type> [...]
de: B<toggle Kennung>|B<Typ> […]
uk: B<toggle ідентифікатор>|B<тип> [...]

source: List the current state of all available devices. The command output format is deprecated, see the section DESCRIPTION. It is a good idea to check with B<list> command I<id> or I<type> scope is appropriate before setting B<block> or B<unblock>. Special I<all> type string will match everything. Use of multiple I<ID> or I<type> arguments is supported.
de: listet den aktuellen Status aller verfügbaren Geräte auf. Das Befehlsausgabeformat ist veraltet, siehe den Abschnitt BESCHREIBUNG. Es ist empfehlenswert, mit B<list> zu prüfen, ob I<Kennung> oder I<Typ> anwendbar sind, bevor Sie B<block> oder B<unblock> setzen. Die spezielle Typzeichenkette I<all> berücksichtigt alles. Die Verwendung mehrerer I<Kennung>- oder I<Typ>-Argumente wird ebenfalls unterstützt.
uk: Вивести список поточного стану усіх доступних пристроїв. Формат виведення команди вважається застарілим, див. розділ «ОПИС». Завжди варто перевірити за допомогою команди B<list>, чи є область значень I<ідентифікатор> або I<тип> відповідною, до встановлення B<block> або B<unblock>. Особливий рядок типу I<all> вказує, що слід використати усі варіанти. Передбачено підтримку визначення декількох аргументів I<ідентифікатор> або I<тип>.
