Repository: sebras/manpages-l10n
Catalog: po/*/man8/route.8.po
Languages: es

source: Linux System Administrator's Manual
es: Manual del Administrador del Sistema Linux

source: NAME
es: NOMBRE

source: route - show / manipulate the IP routing table
es: route - muestra y/o manipula la tabla de enrutamiento IP

source: SYNOPSIS
es: SINOPSIS

source: B<route> [B<-CFvnNee>] [B<-A> family |B<-4>|B<-6>]
es: B<route> [B<-CFvnNee>] [B<-A> familia |B<-4>|B<-6>]

source: [B<-v>] [B<-A> family |B<-4>|B<-6>] B<add> [B<-net>|B<-host>] I<target> [B<netmask> I<Nm>] [B<gw> I<Gw>] [B<metric> I<N>] [B<mss> I<M>] [B<window> I<W>] [B<irtt> I<I>] [B<reject>] [B<mod>] [B<dyn>] [B<reinstate>] [[B<dev>] I<If>]
es: [B<-v>] [B<-A> family |B<-4>|B<-6>] B<add> [B<-net>|B<-host>] I<destino> [B<netmask> I<Nm>] [B<gw> I<Gw>] [B<metric> I<N>] [B<mss> I<M>] [B<window> I<W>] [B<irtt> I<I>] [B<reject>] [B<mod>] [B<dyn>] [B<reinstate>] [[B<dev>] I<If>]

source: [B<-v>] [B<-A> I<family> |B<-4>|B<-6>] B<del> [B<-net>|B<-host>] I<target> [B<gw> I<Gw>] [B<netmask> I<Nm>] [B<metric> I<M>] [[B<dev>] I<If>]
es: [B<-v>] [B<-A> I<familia> |B<-4>|B<-6>] B<del> [B<-net>|B<-host>] I<destino> [B<gw> I<Gw>] [B<netmask> I<Nm>] [B<metric> I<M>] [[B<dev>] I<If>]

source: DESCRIPTION
es: DESCRIPCIÓN

source: B<Route> manipulates the kernel's IP routing tables. Its primary use is to set up static routes to specific hosts or networks via an interface after it has been configured with the B<ifconfig>(8) program.
es: B<Route> manipula la tabla de enrutamiento IP del kernel. Su principal uso consiste en establecer rutas estáticas hacia equipos o redes específicos vía interfaces previamente configuradas con el programa B<ifconfig>(8).

source: When the B<add> or B<del> options are used, B<route> modifies the routing tables. Without these options, B<route> displays the current contents of the routing tables.
es: Cuando se emplean las opciones B<add> p B<del>, B<route> modificará las tablas de enrutamiento. Si no se usa ninguna de ellas, se mostrará el contenido de dichas tablas.

source: OPTIONS
es: OPCIONES

source: B<-A >I<family>
es: B<-A >I<familia>

source: use the specified address family (eg `inet'). Use B<route --help> for a full list. You can use B<-6> as an alias for B<--inet6> and B<-4> as an alias for B<-A inet>
es: Usa la familia de direcciones especificada (por ejemplo 'inet'). Puede ver la lista completa ejecutando B<route --help>. La opción B<-6> equivale a B<--inet6> y B<-4> equivale a B<-A inet>

source: operate on the kernel's FIB (Forwarding Information Base) routing table. This is the default.
es: trabaja sobre la tabla de enrutamiento FIB del núcleo. Este será el comportamiento por defecto.

source: operate on the kernel's routing cache.
es: Muestra la caché de rutas del núcleo.

source: select verbose operation.
es: Selecciona el modo de información detallada.

source: show numerical addresses instead of trying to determine symbolic host names. This is useful if you are trying to determine why the route to your nameserver has vanished.
es: Muestra direcciones numéricas en vez de tratar de determinar nombres simbólicos de equipos. Resulta útil si pretende averiguar por qué la ruta a su servidor de nombres se ha evaporado.

source: use B<netstat>(8)-format for displaying the routing table. B<-ee> will generate a very long line with all parameters from the routing table.
es: Use el formato de B<netstat>(8) para mostrar la tabla de enrutamiento. B<-ee> generará una línea muy larga con todos los parámetros de dicha tabla.

source: delete a route.
es: Borra una ruta.

source: add a new route.
es: Añade una nueva ruta.

source: I<target>
es: I<destino>

source: the destination network or host. You can provide an addresses or symbolic network or host name. Optionally you can use B</>I<prefixlen> notation instead of using the B<netmask> option.
es: red o equipo destino. Puede dar una dirección, una red simbólica o un nombre de equipo. También puede emplear la notación B</>I<prefixlen> en lugar de emplear B<netmask>.

source: the I<target> is a network.
es: El I<destino> es una red.

source: the I<target> is a host.
es: El I<destino> es un equipo.

source: when adding a network route, the netmask to be used.
es: Este modificador especifica la máscara de red de la ruta que se va a añadir.

source: route packets via a gateway.
es: Cualquier paquete IP para la red o equipo de destino se enrutará a través del gateway especificado.

source: B<NOTE:> The specified gateway must be reachable first. This usually means that you have to set up a static route to the gateway beforehand. If you specify the address of one of your local interfaces, it will be used to decide about the interface to which the packets should be routed to. This is a BSDism compatibility hack.
es: B<NOTA:> el gateway especificado debe habilitarse en primer lugar. Normalmente esto significa que se ha de establecer una ruta estática hacia ese gateway previamente. Si se especifica la dirección de uno de los interfaces locales, éste se usará para decidir a qué interfaz se enrutarán los paquetes. Este es un truco de compatibilidad con BSD.

source: set the metric field in the routing table (used by routing daemons) to I<M>. If this option is not specified the metric for inet6 (IPv6) address family defaults to '1', for inet (IPv4) it defaults to '0'. You should always specify an explicit metric value to not rely on those defaults - they also differ from iproute2.
es: define como I<M> la métrica en la tabla de enrutamiento (usada por las aplicaciones de enrutamiento). Si no se define esta métrica, la familia de direcciones para inet6 (IPv6) se predefine a '1' y para inet (IPv4) a '0'. Siempre debería definirse expresamente un valor para la métrica evitando las opciones por defecto - también difieren de iproute2.

source: sets MTU (Maximum Transmission Unit) of the route to I<M> bytes. Note that the current implementation of the route command does not allow the option to set the Maximum Segment Size (MSS).
es: Define la Unidad Máxima de Transmisión (MTU de las siglas en inglés) de la ruta a I<M> bytes. Observe que la implementación actual de la orden route no permite definir el Tamaño Máximo de Segmento (MSS por sus siglas en inglés).

source: set the TCP window size for connections over this route to I<W> bytes. This is typically only used on AX.25 networks and with drivers unable to handle back to back frames.
es: Establece el tamaño de la ventana TCP para conexiones por esta ruta con un valor de I<W> bytes. Normalmente solo se usa en redes AX.25 con manejadores incapaces de manejar tramas una detrás de otra.

source: set the initial round trip time (irtt) for TCP connections over this route to I<I> milliseconds (1-12000). This is typically only used on AX.25 networks. If omitted the RFC 1122 default of 300ms is used.
es: Establece el tiempo inicial de recorrido total (irtt) para una conexión por esta ruta con un valor de I<I> milisegundos (1-12000). Normalmente solo se usa en redes AX.25. Si se omite este valor, se usará el valor por defecto RFC 1122 de 300ms.

source: install a blocking route, which will force a route lookup to fail. This is for example used to mask out networks before using the default route. This is NOT for firewalling.
es: Instala una ruta de bloqueo, que hará que fracase un proceso de búsqueda de ruta. Se usa, por ejemplo, para aislar redes mediante una máscara antes de usar la ruta por defecto. Esto NO debe usarse para hacer cortafuegos.

source: install a dynamic or modified route. These flags are for diagnostic purposes, and are generally only set by routing daemons.
es: Instala una ruta dinámica o modificada. Ambas opciones son normalmente activadas por un demonio de ruta. Solo para propósitos de diagnóstico.

source: force the route to be associated with the specified device, as the kernel will otherwise try to determine the device on its own (by checking already existing routes and device specifications, and where the route is added to). In most normal networks you won't need this.
es: Fuerza la asociación de la ruta con el dispositivo que se especifica, dado que, de otro modo, el núcleo tratará de determinar el dispositivo por sí mismo (mediante la comprobación de las rutas y especificaciones de dispositivo existentes y a dónde se añade la ruta). En la mayoría de los casos esta opción no será necesaria.

source: If B<dev >I<If> is the last option on the command line, the word B<dev> may be omitted, as it's the default. Otherwise the order of the route modifiers (B<metric netmask gw dev>) doesn't matter.
es: Si B<dev >I<If> es la última opción de la línea de órdenes, la palabra B<dev> se puede omitir porque es el valor por defecto. De otro modo, el orden de los modificadores de ruta (B<metric - netmask - gw - dev>) no tiene importancia.

source: EXAMPLES
es: EJEMPLOS

source: adds the normal loopback entry, using netmask 255.0.0.0 and associated with the "lo" device (assuming this device was previously set up correctly with B<ifconfig>(8)).
es: añade la típica entrada de tipo loopback, usando una máscara de red 255.0.0.0 asociada con el dispositivo "lo" (asumiendo que dicho dispositivo se ha configurado previamente con B<ifconfig>(8)).

source: adds a route to the local network 192.56.76.x via "eth0". The word "dev" can be omitted here.
es: añade una ruta a la red local 192.56.76.x a través de "eth0".Se puede omitir la palabra "dev".

source: deletes the current default route, which is labeled "default" or 0.0.0.0 in the destination field of the current routing table.
es: borra la ruta por defecto actual, definida como "default" o 0.0.0.0 e el campo de destino de la tabla de enrutamiento.

source: deletes the route. Since the Linux routing kernel uses classless addressing, you pretty much always have to specify the netmask that is same as as seen in 'route -n' listing.
es: borra la ruta. Como el núcleo de Linux emplea direccionamiento sin clases, casi siempre será necesario definir la máscara de red que es la misma que la mostrada ejecutando 'route -n'.

source: adds a default route (which will be used if no other route matches). All packets using this route will be gatewayed through the address of a node named "mango". The device which will actually be used for that route depends on how we can reach "mango" - "mango" must be on directly reachable route.
es: añade una ruta por defecto (que será usada en caso de no poder usar ninguna otra). Todos los paquetes que sigan esta ruta serán enrutados a un gateway por medio de un nodo llamado "mango". El dispositivo utilizado para esta ruta dependerá de cómo pueda alcanzarse "mango". Este nodo debe estar en una ruta accesible directamente.

source: Adds the route to the host named "mango" via the SLIP interface (assuming that "mango" is the SLIP host).
es: Añade la ruta al eqipo "mango" a través del interfaz SLIP (asumiendo que "mango" es el anfitrión SLIP).

source: This command adds the net "192.57.66.x" to be gatewayed through the former route to the SLIP interface.
es: Esta orden añade la red "192.57.66.x" que ha de ser enrutada vía gateway a través de la dirección anterior hacia el interfaz SLIP.

source: This is an obscure one documented so people know how to do it. This sets all of the class D (multicast) IP routes to go via "eth0". This is the correct normal configuration line with a multicasting kernel.
es: Este es un caso complicado que se documenta para que la gente sepa cómo utilizarlo. Hace que todas las rutas IP clase D (multicast) vayan vía "eth0". Esta es normalmente la línea de configuración correcta para un núcleo multicasting.

source: This installs a rejecting route for the private network "10.x.x.x."
es: Instala una ruta de rechazo para la red privada "10.x.x.x."

source: This adds a IPv6 route with the specified metric to be directly reachable via eth0.
es: Añadirá una ruta IPv6 con la métrica definida directamente accesible a través de eth0.

source: OUTPUT
es: SALIDA

source: The output of the kernel routing table is organized in the following columns
es: La salida de la tabla de enrutamiento del núcleo se organiza en las columnas siguientes:

source: The destination network or destination host.
es: La red o equipo anfitrión de destino.

source: The gateway address or '*' if none set.
es: La dirección del gateway o "*" si no hay ninguno configurado.

source: The netmask for the destination net; '255.255.255.255' for a host destination and '0.0.0.0' for the B<default> route.
es: La máscara de red para la dirección de destino; '255.255.255.255' si el destino es un ordenador y '0.0.0.0' para la ruta B<por defecto>.

source: Possible flags include
es: Las posibles flags son:

source: B<U> (route is B<up>)
es: B<U> (la ruta está activada (B<up>))

source: B<H> (target is a B<host>)
es: B<H> (el destino es un equipo anfitrión (B<host>))

source: B<G> (use B<gateway>)
es: B<G> (usa un B<gateway>)

source: B<R> (B<reinstate> route for dynamic routing)
es: B<R> (B<restablece> una ruta para enrutamiento dinámico)

source: B<D> (B<dynamically> installed by daemon or redirect)
es: B<D> (instalada B<dinámicamente> por un demonio o redirección)

source: B<M> (B<modified> from routing daemon or redirect)
es: B<M> (B<modificada> a partir del demonio de ruta o redirección)

source: B<A> (installed by B<addrconf>)
es: B<A> (instalado por B<addrconf>)

source: B<C> (B<cache> entry)
es: B<C> (entrada de B<cache>)

source: B<!> (B<reject> route)
es: B<!> (ruta de B<rechazo>)

source: The 'distance' to the target (usually counted in hops).
es: La 'distancia' al destino (normalmente se cuenta en saltos).

source: Number of references to this route. (Not used in the Linux kernel.)
es: Número de referencias a este ruta. (No se usa en el núcleo Linux)

source: Count of lookups for the route. Depending on the use of -F and -C this will be either route cache misses (-F) or hits (-C).
es: Cuenta el número de búsquedas para esta ruta. Dependiendo del uso de -F y -C, se referirá bien a los errores de caché de ruta (-F) o a los aciertos (-C).

source: Interface to which packets for this route will be sent.
es: Interfaz a través de la cual se enviarán los paquetes para esta ruta.

source: Default maximum segment size for TCP connections over this route.
es: Tamaño máximo de segmento por defecto de las conexiones TCP por esta ruta.

source: Default window size for TCP connections over this route.
es: Tamaño de ventana por defecto para conexiones TCP por esta ruta.

source: Initial RTT (Round Trip Time). The kernel uses this to guess about the best TCP protocol parameters without waiting on (possibly slow) answers.
es: Valor RTT inicial (tiempo del viaje de ida y vuelta). El kernel usa este valor para averiguar los parámetros del protocolo TCP óptimos sin tener que esperar respuestas (posiblemente lentas).

source: B<HH (cached only)>
es: B<HH (sólamente con caché)>

source: The number of ARP entries and cached routes that refer to the hardware header cache for the cached route. This will be -1 if a hardware address is not needed for the interface of the cached route (e.g. lo).
es: El número de entradas ARP y de rutas en caché que se refieren a las cabecerás hardware que hay en caché para la ruta en caché. Será -1 si no se necesita una dirección hardware para la interfaz de la ruta en caché (por ejemplo, lo).

source: B<Arp (cached only)>
es: B<Arp (sólamente con caché)>

source: Whether or not the hardware address for the cached route is up to date.
es: Indica si la dirección de hardware para la ruta en caché está, o no, actualizada.

source: FILES
es: ARCHIVOS

source: SEE ALSO
es: VÉASE TAMBIÉN

source: HISTORY
es: HISTORIAL

source: B<Route> for Linux was originally written by Fred N. van Kempen, E<lt>waltje@uwalt.nl.mugnet.orgE<gt> and then modified by Johannes Stille and Linus Torvalds for pl15. Alan Cox added the mss and window options for Linux 1.1.22. irtt support and merged with netstat from Bernd Eckenfels.
es: B<Route> para Linux fue escrito inicialmente por Fred N. van Kempen, E<lt>waltje@uwalt.nl.mugnet.orgE<gt> y modificado por Johannes Stille y Linus Torvalds para pl15. Alan Cox añadió el mss y las opciones de ventanas para Linux 1.1.22, soporte irtt y su fusión con netstat de Bernd Eckenfels.

source: AUTHOR
es: AUTOR

source: Currently maintained by Phil Blundell E<lt>Philip.Blundell@pobox.comE<gt> and Bernd Eckenfels E<lt>net-tools@lina.inka.deE<gt>.
es: Actualmente lo mantienen Phil Blundell E<lt>Philip.Blundell@pobox.comE<gt> y Bernd Eckenfels E<lt>net-tools@lina.inka.deE<gt>.

source: NOTE
es: NOTA

source: This program is obsolete. For replacement check B<ip route>.
es: Este programa está obsoleto. Utilice B<ip route> en su lugar.
