Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpm-plugin-systemd-inhibit.8.po
Languages: de

source: 14 Apr 2016
de: 14. April 2016

source: NAME
de: BEZEICHNUNG

source: rpm-plugin-systemd-inhibit - Plugin for the RPM Package Manager
de: rpm-plugin-systemd-inhibit - Plugin für die RPM-Paketverwaltung

source: Description
de: Beschreibung

source: This plugin for RPM prevents the system to enter shutdown, sleep or idle mode while there is a rpm transaction running to prevent system corruption that can occur if the transaction is interrupted by a reboot.
de: Dieses Plugin für RPM verhindert, dass das System heruntergefahren oder in den Schlafzustand oder Leerlauf versetzt wird, während eine RPM-Transaktion läuft. Dadurch werden Beschädigungen des Systems vermieden, die beim Unterbrechen einer Transaktion durch einen Neustart auftreten würden.

source: This is achieved by using the inhibit DBUS interface of systemd. The call is roughly equivalent to executing
de: Dies wird mit Hilfe der DBus-Unterdrückungssperrschnittstelle von Systemd erreicht. Der Aufruf ist im Wesentlichen gleichbedeutend mit der Ausführung von

source: See B<systemd-inhibit(1)> for the details of this mechanism.
de: Siehe B<systemd-inhibit>(1) für die Details dieses Mechanismus.

source: It is strongly advised to have the plugin installed on all systemd based systems.
de: Es wird unbedingt empfohlen, das Plugin auf allen Systemd-basierten Systemen zu installieren.

source: Prerequisites
de: Voraussetzungen

source: For the plugin to work systemd has to be used as init system and though the DBUS system bus must be available. If the plugin cannot access the interface it gives a warning but does not stop the transaction.
de: Damit das Plugin funktioniert, muss Systemd als Init-System verwendet werden; weiterhin muss das DBus-System verfügbar sein. Falls das Plugin nicht auf die Schnittstelle zugreifen kann, wird eine Warnung ausgegeben, aber die Transaktion nicht gestoppt.

source: Configuration
de: Konfiguration

source: The plugin currently does not have any configuration option other than turning it on and off. It can be disabled by commenting out the I<%__transaction_systemd_inhibit> macro in main macros file (typically located at I</usr/lib/rpm/macros>) or otherwise change the value of the macro.
de: Das Plugin verfügt derzeit über keinerlei Konfigurationsoptionen. Es kann lediglich aktiviert oder deaktiviert werden. Die Deaktivierung geschieht durch Auskommentieren des Makros I<%__transaction_systemd_inhibit> in der Haupt-Makrodatei (typischerweise in I</usr/lib/rpm/macros>) oder anderenfalls durch Ändern des Werts des Makros.

source: Another option is to remove the plugin from the system if it is packaged in its own sub package.
de: Eine weitere Option ist die Entfernung des Plugins aus dem System, wenn es sich einem eigenen Unterpaket befindet.

source: See B<systemd-inhibit>(1) for the details of this mechanism.
de: Siehe B<systemd-inhibit>(1) für die Details dieses Mechanismus.

source: There are currently no options for this plugin in particular. See B<rpm-plugins>(8) on how to control plugins in general.
de: Es gibt derzeit keine besonderen Optionen für dieses Plugin. Siehe B<rpm-plugins>(8) über allgemeine Informationen zum Steuern von Plugins.

source: SEE ALSO
de: SIEHE AUCH
