Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpm.8.po
Languages: de

source: B<rpm> allows the following options to be used with ftp URLs:
de: B<rpm> akzeptiert bei der Verwendung von FTP-URLs die folgenden Optionen:

source: B<rpm> allows the following options to be used with
de: B<rpm> akzeptiert die folgenden Optionen bei der Verwendung mit

source: B<http> and B<ftp> URLs:
de: B<http>- und B<ftp>-URLs:

source: B<--httpproxy >I<HOST>
de: B<--httpproxy >I<RECHNER>

source: The host I<HOST> will be used as a proxy server for all B<http> and B<ftp> transfers. This option may also be specified by configuring the macro B<%_httpproxy>.
de: Der angegebene I<RECHNER> wird als Proxy-Server für alle B<http>- und B<ftp>-Übertragungen verwendet. Diese Option kann auch bei der Konfiguration des Makros B<%_httpproxy> angegeben werden.

source: The TCP I<PORT> number to use for the B<http> connection on the proxy http server instead of the default port. This option may also be specified by configuring the macro B<%_httpport>.
de: gibt die TCP-I<PORT>-Nummer an, die für die HTTP-Verbindung auf dem Proxy-Server anstelle des standardmäßigen Ports verwendet werden soll. Diese Option kann auch durch Konfiguration des Makros B<%_httpport> angegeben werden.

source: LEGACY ISSUES
de: PROBLEME AUS ALTEN ZEITEN

source: Executing rpmbuild
de: Ausführung von Rpmbuild

source: The build modes of rpm are now resident in the I</usr/bin/rpmbuild> executable. Install the package containing B<rpmbuild> (usually B<rpm-build>) and see B<rpmbuild>(8) for documentation of all the B<rpm> build modes.
de: Die Erstellungsmodi von B<rpm> sind nun im ausführbaren Programm I</usr/bin/rpmbuild>. Installieren Sie das Paket, welches B<rpmbuild> enthält (üblicherweise B<rpm-build>) und lesen Sie die Dokumentation in B<rpmbuild>(8) zu allen Erstellungsmodi von B<rpm>.

source: FILES
de: DATEIEN

source: rpmrc Configuration
de: Rpmrc-Konfiguration

source: I</usr/lib/rpm/rpmrc> I</usr/lib/rpm/E<lt>vendorE<gt>/rpmrc> I</etc/rpmrc> I<~/.rpmrc>
de: I</usr/lib/rpm/rpmrc> I</usr/lib/rpm/E<lt>AnbieterE<gt>/rpmrc> I</etc/rpmrc> I<~/.rpmrc>

source: Macro Configuration
de: Makro-Konfiguration

source: I</usr/lib/rpm/macros> I</usr/lib/rpm/E<lt>vendorE<gt>/macros> I</etc/rpm/macros> I<~/.rpmmacros>
de: I</usr/lib/rpm/macros> I</usr/lib/rpm/E<lt>AnbieterE<gt>/macros> I</etc/rpm/macros> I<~/.rpmmacros>

source: Database
de: Datenbank

source: Temporary
de: Temporär

source: SEE ALSO
de: SIEHE AUCH

source: B<rpm-misc(8), popt>(3), B<rpm2cpio>(8), B<rpmbuild>(8), B<rpmdb>(8), B<rpmkeys>(8), B<rpmsign>(8), B<rpmspec>(8),
de: B<rpm-misc>(8), B<popt>(3), B<rpm2cpio>(8), B<rpmbuild>(8), B<rpmdb>(8), B<rpmkeys>(8), B<rpmsign>(8), B<rpmspec>(8)

source: B<rpm --help> - as rpm supports customizing the options via popt aliases it's impossible to guarantee that what's described in the manual matches what's available.
de: B<rpm --help> - da B<rpm> benutzerdefinierte Optionen über Popt-Aliase unterstützt, kann unmöglich garantiert werden, dass die Beschreibungen in diesem Handbuch exakt dem entsprechen, was verfügbar ist.

source: AUTHORS
de: AUTOREN

source: [I<PACKAGE_NAME>] [B<-a,--all>] [B<-f,--file >I<FILE>] [B<-g,--group >I<GROUP>] {B<-p,--package >I<PACKAGE_FILE>] [B<--hdrid >I<SHA1>] [B<--pkgid >I<MD5>] [B<--tid >I<TID>] [B<--querybynumber >I<HDRNUM>] [B<--triggeredby >I<PACKAGE_NAME>] [B<--whatprovides >I<CAPABILITY>] [B<--whatrequires >I<CAPABILITY>] [B<--whatrecommends >I<CAPABILITY>] [B<--whatsuggests >I<CAPABILITY>] [B<--whatsupplements >I<CAPABILITY>] [B<--whatenhances >I<CAPABILITY>]
de: [I<PAKETNAME>] [B<-a,--all>] [B<-f,--file >I<DATEI>] [B<-g,--group >I<GRUPPE>] {B<-p,--package >I<PAKETDATEI>] [B<--hdrid >I<SHA1>] [B<--pkgid >I<MD5>] [B<--tid >I<TID>] [B<--querybynumber >I<HDR-NUMMER>] [B<--triggeredby >I<PAKETNAME>] [B<--whatprovides >I<FÄHIGKEIT>] [B<--whatrequires >I<FÄHIGKEIT>] [B<--whatrecommends >I<FÄHIGKEIT>] [B<--whatsuggests >I<FÄHIGKEIT>] [B<--whatsupplements >I<FÄHIGKEIT>] [B<--whatenhances >I<FÄHIGKEIT>]

source: Files: [B<-c,--configfiles>] [B<-d,--docfiles>] [B<--dump>] [B<--fileclass>] [B<--filecolor>] [B<--fileprovide>][B<--filerequire>] [B<--filecaps>] [B<--filesbypkg>] [B<-l,--list>] [B<-s,--state>] [B<--noartifact>] [B<--noghost>] [B<--noconfig>
de: Dateien: [B<-c,--configfiles>] [B<-d,--docfiles>] [B<--dump>] [B<--fileclass>] [B<--filecolor>] [B<--fileprovide>][B<--filerequire>] [B<--filecaps>] [B<--filesbypkg>] [B<-l,--list>] [B<-s,--state>] [B<--noartifact>] [B<--noghost>] [B<--noconfig>

source: [B<--allfiles>] [B<--badreloc>] [B<--excludepath >I<OLDPATH>] [B<--excludedocs>] [B<--force>] [B<-h,--hash>] [B<--ignoresize>] [B<--ignorearch>] [B<--ignoreos>] [B<--includedocs>] [B<--justdb>] [B<--nodeps>] [B<--nodigest>] [B<--noplugins>] [B<--nocaps>] [B<--noorder>] [B<--nosignature>] [B<--noscripts>] [B<--notriggers>] [B<--oldpackage>] [B<--percent>] [B<--prefix >I<NEWPATH>] [B<--relocate >I<OLDPATH>B<=>I<NEWPATH>] [B<--replacefiles>] [B<--replacepkgs>] [B<--test>]
de: [B<--allfiles>] [B<--badreloc>] [B<--excludepath >I<ALTER_PFAD>] [B<--excludedocs>] [B<--force>] [B<-h,--hash>] [B<--ignoresize>] [B<--ignorearch>] [B<--ignoreos>] [B<--includedocs>] [B<--justdb>] [B<--nodeps>] [B<--nodigest>] [B<--noplugins>] [B<--nocaps>] [B<--noorder>] [B<--nosignature>] [B<--noscripts>] [B<--notriggers>] [B<--oldpackage>] [B<--percent>] [B<--prefix >I<NEUER_PFAD>] [B<--relocate >I<ALTER_PFAD>B<=>I<NEUER_PFAD>] [B<--replacefiles>] [B<--replacepkgs>] [B<--test>]

source: In these options, I<PACKAGE_FILE> can be either B<rpm> binary file or ASCII package manifest (see B<PACKAGE SELECTION OPTIONS>), and may be specified as an B<ftp> or B<http> URL, in which case the package will be downloaded before being installed. See B<FTP/HTTP OPTIONS> for information on B<rpm>'s internal B<ftp> and B<http> client support.
de: In diesen Optionen kann die I<PAKETDATEI> eine B<rpm>-Binärdatei oder eine ASCII-Paket-Liste sein (siehe B<PAKETAUSWAHLOPTIONEN>) und kann als B<ftp>- oder B<http>-URL angegeben werden. In letzterem Fall wird das Paket heruntergeladen, bevor es installiert wird. Siehe B<FTP/HTTP-OPTIONEN> für Informationen dazu, welche B<ftp>- und B<http>-Client-Optionen B<rpm> unterstützt.

source: There are two subsets of options for querying: package selection, and information selection.
de: Es gibt zwei Teilmengen an Abfrageoptionen: Paketauswahl und Informationsauswahl.

source: Query an (uninstalled) package I<PACKAGE_FILE>. The I<PACKAGE_FILE> may be specified as an B<ftp> or B<http> style URL, in which case the package header will be downloaded and queried. See B<FTP/HTTP OPTIONS> for information on B<rpm>'s internal B<ftp> and B<http> client support. The I<PACKAGE_FILE> argument(s), if not a binary package, will be interpreted as an ASCII package manifest unless B<--nomanifest> option is used. In manifests, comments are permitted, starting with a '#', and each line of a package manifest file may include white space separated glob expressions, including URL's, that will be expanded to paths that are substituted in place of the package manifest as additional I<PACKAGE_FILE> arguments to the query.
de: fragt eine (nicht installierte) I<PAKETDATEI> ab. Die I<PAKETDATEI> kann als URL im B<ftp>- oder B<http>-Stil angegeben werden, wobei dann der Paket-Header heruntergeladen und abgefragt wird. Siehe B<FTP/HTTP-OPTIONEN> für Informationen dazu, welche B<ftp>- und B<http>-Client-Optionen B<rpm> unterstützt. Das oder die Argument(e) der I<PAKETDATEI>, sofern diese kein Binärpaket ist, werden als eine ASCII-Paketliste interpretiert, außer wenn die Option B<--nomanifest> verwendet wird. In den Listen sind Kommentare erlaubt, die mit einem I<#> beginnen; außerdem darf jede Zeile der Paketliste durch Leerraum getrennte Glob-Ausdrücke enthalten, einschließlich URLs, die zu Pfaden expandiert werden, die anstelle der Paketliste als zusätzliche I<PAKETDATEI>-Argumente zur Abfrage hinzugefügt werden.

source: Note that this does not return what requires a given package. A package usually provides multiple capabilities and file-names on which other packages may depend. To see the complete dependencies for a package, use B<-e --test >I<PACKAGE_NAME>
de: Beachten Sie, dass dies nicht die Abhängigkeiten eines angegebenen Pakets zurückliefert. Ein Paket stellt üblicherweise mehrere Fähigkeiten und Dateinamen bereit, von denen andere Pakete abhängen können. Um die vollständigen Abhängigkeiten eines Pakets anzuzeigen, verwenden Sie B<-e --test >I<PAKETNAME>.

source: List only artifact files (implies B<-l>).
de: listet nur Artefakt-Dateien auf (impliziert B<-l>).

source: List only configuration files (implies B<-l>).
de: listet nur Konfigurationsdateien auf (impliziert B<-l>).

source: List only documentation files (implies B<-l>).
de: listet nur Dokumentationsdateien auf (impliziert B<-l>).

source: List only license files (implies B<-l>).
de: listet nur Lizenzdateien auf (impliziert B<-l>).

source: Display the trigger scripts, if any, which are contained in the package.
de: zeigt die Triggerskripte an, die (falls überhaupt) im Paket enthalten sind.

source: Don't display artifact files. B<--noghost> Don't display ghost files. Useful in combination with option --list.
de: zeigt keine Artefakt-Dateien an. B<--noghost> zeigt keine Ghost-Dateien an. Nützlich in Verbindung mit der Option B<--list>.

source: Don't display config files.
de: zeigt keine Konfigurationsdateien an.

source: Format package headers as XML.
de: formatiert Paket-Header als XML.

source: The package selection options are the same as for package querying (including package manifest files as arguments). Other options unique to verify mode are:
de: Die Paketauswahloptionen sind die gleichen wie für die Abfrage von Paketen (einschließlich der Paketlistendateien als Argumente). Weitere Optionen nur für den Überprüfungsmodus sind:

source: Don't verify ghost files.
de: überprüft keine Ghost-Dateien.

source: Don't verify config files.
de: überprüft keine Konfigurationsdateien.

source: sets permissions of files in the given package.
de: legt die Zugriffsrechte der Dateien des angegebenen Pakets fest.

source: sets user/group ownership of files in the given package. This command can change permissions of files in that package. It is caused by calling command B<chmod> that can clear SUID and SGID bits in some situations. So it is safer to call also B<--setperms> after calling B<--setugids>.
de: legt die Eigentumsverhältnisse bezüglich Benutzer und Gruppe des angegebenen Pakets fest. Dieser Befehl kann Zugriffsrechte und Fähigkeiten der Dateien in diesem Paket ändern. Dies geschieht durch den Aufruf von B<chmod>, wodurch in bestimmten Situationen SUID- und SGID-Bits gelöscht werden können. Daher ist es besser, B<--setperms> nach B<--setugids> aufzurufen.

source: Options B<--setperms> and B<--setugids> are mutually exclusive.
de: Die Optionen B<--setperms> und B<--setugids> schließen sich gegenseitig aus.

source: ftp://USER:PASSWORD@HOST:PORT/path/to/package.rpm
de: ftp://BENUTZER:PASSWORT@RECHNER:PORT/Pfad/zum/Paket.rpm

source: If the B<:PASSWORD> portion is omitted, the password will be prompted for (once per user/hostname pair). If both the user and password are omitted, anonymous B<ftp> is used. In all cases, passive (PASV) B<ftp> transfers are performed.
de: Falls der B<:PASSWORD>-Teil weggelassen wird, dann wird nach dem Passwort gefragt (einmal pro Benutzer/Rechnername-Paar). Falls sowohl Benutzername als auch Passwort weggelassen werden, wird anonymes B<ftp> verwendet. In allen Fällen werden passive B<ftp>-Übertragungen (PASV) ausgeführt.

source: B<--ftpproxy >I<HOST>
de: B<--ftpproxy >I<RECHNER>

source: The host I<HOST> will be used as a proxy server for all ftp transfers, which allows users to ftp through firewall machines which use proxy systems. This option may also be specified by configuring the macro B<%_ftpproxy>.
de: verwendet den angegebenen I<Rechner> als Proxy-Server für alle FTP-Übertragungen, was Benutzern ermöglicht, FTP über Firewall-Rechner laufen zu lassen, die Proxy-Systeme verwenden. Diese Option kann auch durch Konfiguration des Makros B<%_ftpproxy> angegeben werden.

source: The TCP I<PORT> number to use for the ftp connection on the proxy ftp server instead of the default port. This option may also be specified by configuring the macro B<%_ftpport>.
de: gibt die TCP-I<PORT>-Nummer an, die für die FTP-Verbindung auf dem Proxy-Server anstelle des standardmäßigen Ports verwendet werden soll. Diese Option kann auch durch Konfiguration des Makros B<%_ftpport> angegeben werden.

source: B<rpm> allows the following options to be used with B<http> URLs:
de: B<rpm> akzeptiert für die Verwendung mit B<http>-URLs die folgenden Optionen:

source: The host I<HOST> will be used as a proxy server for all B<http> transfers. This option may also be specified by configuring the macro B<%_httpproxy>.
de: verwendet den angegebenen I<RECHNER> als Proxy-Server für alle B<http>-Übertragungen. Diese Option kann auch durch Konfiguration des Makros B<%_httpproxy> angegeben werden.
