Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpm.8.po
Languages: de

source: 09 June 2002
de: 9. Juni 2002

source: NAME
de: BEZEICHNUNG

source: rpm - RPM Package Manager
de: rpm - RPM-Paketverwaltung

source: SYNOPSIS
de: ÜBERSICHT

source: QUERYING AND VERIFYING PACKAGES:
de: PAKETE ABFRAGEN UND ÜBERPRÜFEN:

source: B<rpm> {B<-q|--query>} [B<select-options>] [B<query-options>]
de: B<rpm> {B<-q|--query>} [B<Auswahloptionen>] [B<Abfrageoptionen>]

source: B<rpm> {B<-V|--verify>} [B<select-options>] [B<verify-options>]
de: B<rpm> {B<-V|--verify>} [B<Auswahloptionen>] [B<Überprüfungsoptionen>]

source: INSTALLING, UPGRADING, AND REMOVING PACKAGES:
de: INSTALLIEREN, AKTUALISIEREN UND ENTFERNEN VON PAKETEN:

source: B<rpm> {B<-i|--install>} [B<install-options>] I<PACKAGE_FILE>I< ...>
de: B<rpm> {B<-i|--install>} [B<Installationsoptionen>] I<PAKETDATEI>I< …>

source: B<rpm> {B<-U|--upgrade>} [B<install-options>] I<PACKAGE_FILE>I< ...>
de: B<rpm> {B<-U|--upgrade>} [B<Installationsoptionen>] I<PAKETDATEI>I< …>

source: B<rpm> {B<-F|--freshen>} [B<install-options>] I<PACKAGE_FILE>I< ...>
de: B<rpm> {B<-F|--freshen>} [B<Installationsoptionen>] I<PAKETDATEI>I< …>

source: B<rpm> {B<--reinstall>} [B<install-options>] I<PACKAGE_FILE>I< ...>
de: B<rpm> {B<--reinstall>} [B<Installationsoptionen>] I<PAKETDATEI>I< …>

source: B<rpm> {B<-e|--erase>} [B<--allmatches>] [B<--justdb] [--nodeps>] [B<--noscripts>] [B<--notriggers>] [B<--test>] I<PACKAGE_NAME>I<\ ...>
de: B<rpm> {B<-e|--erase>} [B<--allmatches>] [B<--justdb] [--nodeps>] [B<--noscripts>] [B<--notriggers>] [B<--test>] I<PAKETNAME>I<\ …>

source: MISCELLANEOUS:
de: SONSTIGES:

source: B<rpm> B<--setperms> I<PACKAGE_NAME>I< ...>
de: B<rpm> B<--setperms> I<PAKETNAME>I< …>

source: B<rpm> B<--setugids> I<PACKAGE_NAME>I< ...>
de: B<rpm> B<--setugids> I<PAKETNAME>I< …>

source: B<rpm> B<--setcaps> I<PACKAGE_NAME>I< ...>
de: B<rpm> B<--setcaps> I<PAKETNAME>I< …>

source: B<rpm> B<--restore> I<PACKAGE_NAME>I< ...>
de: B<rpm> B<--restore> I<PAKETNAME>I< …>

source: select-options
de: Auswahloptionen

source: [I<PACKAGE_NAME>] [B<-a,--all [>I<SELECTOR>]] [B<-f,--file >I<FILE>] [B<-g,--group >I<GROUP>] [B<-p,--package >I<PACKAGE_FILE>] [B<--hdrid >I<SHA1>] [B<--pkgid >I<MD5>] [B<--tid >I<TID>] [B<--querybynumber >I<HDRNUM>] [B<--triggeredby >I<PACKAGE_NAME>] [B<--whatprovides >I<CAPABILITY>] [B<--whatrequires >I<CAPABILITY>] [B<--whatrecommends >I<CAPABILITY>] [B<--whatsuggests >I<CAPABILITY>] [B<--whatsupplements >I<CAPABILITY>] [B<--whatenhances >I<CAPABILITY>] [B<--whatobsoletes >I<CAPABILITY>] [B<--whatconflicts >I<CAPABILITY>]
de: [I<PAKETNAME>] [B<-a,--all [>I<AUSWÄHLER>]] [B<-f,--file >I<DATEI>] [B<-g,--group >I<GRUPPE>] [B<-p,--package >I<PAKETDATEI>] [B<--hdrid >I<SHA1>] [B<--pkgid >I<MD5>] [B<--tid >I<TID>] [B<--querybynumber >I<HDR-NUMMER>] [B<--triggeredby >I<PAKETNAME>] [B<--whatprovides >I<FÄHIGKEIT>] [B<--whatrequires >I<FÄHIGKEIT>] [B<--whatrecommends >I<FÄHIGKEIT>] [B<--whatsuggests >I<FÄHIGKEIT>] [B<--whatsupplements >I<FÄHIGKEIT>] [B<--whatenhances >I<FÄHIGKEIT>] [B<--whatobsoletes >I<FÄHIGKEIT>] [B<--whatconflicts >I<FÄHIGKEIT>]

source: query-options
de: Abfrageoptionen

source: General: [B<--changelog>] [B<--changes>] [B<--dupes>] [B<-i,--info>] [B<--last>] [B<--qf,--queryformat >I<QUERYFMT>] [B<--xml>]
de: Allgemein: [B<--changelog>] [B<--changes>] [B<--dupes>] [B<-i,--info>] [B<--last>] [B<--qf,--queryformat >I<ABFRAGEFORMAT>] [B<--xml>]

source: Dependencies: [B<--conflicts>] [B<--enhances>] [B<--obsoletes>] [B<--provides>] [B<--recommends>] [B<-R,--requires>] [B<--suggests>] [B<--supplements>]
de: Abhängigkeiten: [B<--conflicts>] [B<--enhances>] [B<--obsoletes>] [B<--provides>] [B<--recommends>] [B<-R,--requires>] [B<--suggests>] [B<--supplements>]

source: Files: [B<-c,--configfiles>] [B<-d,--docfiles>] [B<--dump>] [B<--fileclass>] [B<--filecolor>] [B<--fileprovide>][B<--filerequire>] [B<--filecaps>] [B<--filesbypkg>] [B<-l,--list>] [B<-s,--state>] [B<--noartifact>] [B<--noghost>] [B<--noconfig>]
de: Dateien: [B<-c,--configfiles>] [B<-d,--docfiles>] [B<--dump>] [B<--fileclass>] [B<--filecolor>] [B<--fileprovide>][B<--filerequire>] [B<--filecaps>] [B<--filesbypkg>] [B<-l,--list>] [B<-s,--state>] [B<--noartifact>] [B<--noghost>] [B<--noconfig>]

source: Scripts and triggers: [B<--filetriggers>] [B<--scripts>] [B<--triggers,--triggerscripts>]
de: Skripte und Trigger: [B<--filetriggers>] [B<--scripts>] [B<--triggers,--triggerscripts>]

source: verify-options
de: Überprüfungsoptionen

source: install-options
de: Installationsoptionen

source: [B<--allfiles>] [B<--badreloc>] [B<--excludepath >I<OLDPATH>] [B<--excludedocs>] [B<--force>] [B<-h,--hash>] [B<--ignoresize>] [B<--ignorearch>] [B<--ignoreos>] [B<--includedocs>] [B<--justdb>] [B<--nodeps>] [B<--nodigest>] [B<--noplugins>] [B<--nocaps>] [B<--noorder>] [B<--noverify>] [B<--nosignature>] [B<--noscripts>] [B<--notriggers>] [B<--oldpackage>] [B<--percent>] [B<--prefix >I<NEWPATH>] [B<--relocate >I<OLDPATH>B<=>I<NEWPATH>] [B<--replacefiles>] [B<--replacepkgs>] [B<--test>]
de: [B<--allfiles>] [B<--badreloc>] [B<--excludepath >I<ALTER_PFAD>] [B<--excludedocs>] [B<--force>] [B<-h,--hash>] [B<--ignoresize>] [B<--ignorearch>] [B<--ignoreos>] [B<--includedocs>] [B<--justdb>] [B<--nodeps>] [B<--nodigest>] [B<--noplugins>] [B<--nocaps>] [B<--noorder>] [B<--noverify>] [B<--nosignature>] [B<--noscripts>] [B<--notriggers>] [B<--oldpackage>] [B<--percent>] [B<--prefix >I<NEUER_PFAD>] [B<--relocate >I<ALTER_PFAD>B<=>I<NEUER_PFAD>] [B<--replacefiles>] [B<--replacepkgs>] [B<--test>]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<rpm> is a powerful B<Package Manager>, which can be used to build, install, query, verify, update, and erase individual software packages. A B<package> consists of an archive of files and meta-data used to install and erase the archive files. The meta-data includes helper scripts, file attributes, and descriptive information about the package. B<Packages> come in two varieties: binary packages, used to encapsulate software to be installed, and source packages, containing the source code and recipe necessary to produce binary packages.
de: B<rpm> ist eine leistungsfähige B<Paketverwaltung>, die zum Erstellen, Installieren, Abfragen, Überprüfen, Aktualisieren und Löschen individueller Softwarepakete verwendet werden kann. Ein B<Paket> besteht aus einem Dateiarchiv und Metadaten, die zum Installieren und Löschen der im Paket enthaltenen Dateien verwendet werden. Die Metadaten umfassen Hilfsskripte, Dateiattribute und beschreibende Informationen zum Paket. B<Pakete> gibt es in zwei Varianten: Binärpakete, welche die zu installierende Software enthalten, und Quellpakete, die den Quellcode zusammen mit Anweisungen enthalten, die zum Erstellen von Binärpaketen erforderlich sind.

source: One of the following basic modes must be selected: B<Query>, B<Verify>, B<Install/Upgrade/Freshen/Reinstall>, B<Uninstall>, B<Set Owners/Groups>, B<Show Querytags>, and B<Show Configuration>.
de: Einer der folgenden grundlegenden Modi muss ausgewählt werden: B<Abfragen>, B<Überprüfen>, B<Installieren/Aktualisieren/Auffrischen/Reinstallieren>, B<Deinstallieren>, B<Eigentümer/Gruppen festlegen>, B<Abfrageschalter anzeigen> und B<Konfiguration anzeigen>.

source: GENERAL OPTIONS
de: ALLGEMEINE OPTIONEN

source: These options can be used in all the different modes.
de: Diese Optionen können in allen der verschiedenen Modi verwendet werden.

source: Print a longer usage message then normal.
de: gibt eine längere Hilfemeldung als sonst aus.

source: Print a single line containing the version number of B<rpm> being used.
de: gibt eine einzelne Zeile aus, welche die Versionsummer von B<rpm> angibt.

source: Print as little as possible - normally only error messages will be displayed.
de: gibt so wenig wie möglich aus – es werden normalerweise nur Fehlermeldungen angezeigt.

source: Print verbose information - normally routine progress messages will be displayed.
de: gibt ausführliche Informationen aus - normale Routine-Fortschrittsmeldungen werden angezeigt.

source: Print lots of ugly debugging information.
de: gibt umfangreiche Debugging-Informationen aus.

source: B<--rcfile >I<FILELIST>
de: B<--rcfile >I<DATEILISTE>

source: Replace the list of configuration files to be read. Each of the files in the colon separated I<FILELIST> is read sequentially by B<rpm> for configuration information. Only the first file in the list must exist, and tildes will be expanded to the value of B<$HOME>. The default I<FILELIST> is I</usr/\:lib/\:rpm/\:rpmrc>:\:I</usr/\:lib/\:rpm/\:redhat/\:rpmrc>:\:I</etc/\:rpmrc>:\:I<~/.rpmrc>.
de: ersetzt die Liste der zu lesenden Konfigurationsdateien. Jede der Dateien in der durch Doppelpunkte getrennten I<DATEILISTE> wird sequenziell von B<rpm> gelesen, um Konfigurationsinformationen zu ermitteln. Nur die erste Datei in der Liste muss existieren und Tilden werden zum Wert der Variable B<$HOME> expandiert. Die vorgegebene I<DATEILISTE> ist I</usr/\:lib/\:rpm/\:rpmrc>:\:I</usr/\:lib/\:rpm/\:redhat/\:rpmrc>:\:I</etc/\:rpmrc>:\:I<~/.rpmrc>.

source: B<--load >I<FILE>
de: B<--load >I<DATEI>

source: Load an individual macro file.
de: lädt eine individuelle Makro-Datei.

source: B<--macros >I<FILELIST>
de: B<--macros >I<DATEILISTE>

source: Replace the list of macro files to be loaded. Each of the files in the colon separated I<FILELIST> is read sequentially by B<rpm> for macro definitions. Only the first file in the list must exist, and tildes will be expanded to the value of B<$HOME>. The default I<FILELIST> is I</usr/\:lib/\:rpm/\:macros>:\:I</usr/\:lib/\:rpm/\:macros.d/\:macros.*>:\:I</usr/\:lib/\:rpm/\:platform/\:%{_target}/\:macros>:\:I</usr/\:lib/\:rpm/\:fileattrs/\:*.attr>:\:I</usr/\:lib/\:rpm/\:redhat/\:macros>:\:I</etc/\:rpm/\:macros.*>:\:I</etc/\:rpm/\:macros>:\:I</etc/\:rpm/\:%{_target}/\:macros>:\:I<~/.rpmmacros>
de: ersetzt die Liste der zu ladenden Makro-Dateien. Jede der Dateien in der durch Doppelpunkte getrennten I<DATEILISTE> wird sequenziell von B<rpm> gelesen, um Makro-Definitionen zu ermitteln Nur die erste Datei in der Liste muss existieren und Tilden werden zum Wert der Variable B<$HOME> expandiert. Die vorgegebene I<DATEILISTE> ist I</usr/\:lib/\:rpm/\:macros>:\:I</usr/\:lib/\:rpm/\:macros.d/\:macros.*>:\:I</usr/\:lib/\:rpm/\:platform/\:%{_target}/\:macros>:\:I</usr/\:lib/\:rpm/\:fileattrs/\:*.attr>:\:I</usr/\:lib/\:rpm/\:redhat/\:macros>:\:I</etc/\:rpm/\:macros.*>:\:I</etc/\:rpm/\:macros>:\:I</etc/\:rpm/\:%{_target}/\:macros>:\:I<~/.rpmmacros>.

source: B<--pipe >I<CMD>
de: B<--pipe >I<BEFEHL>

source: Pipes the output of B<rpm> to the command I<CMD>.
de: leitet die Ausgabe des Befehls B<rpm> an den angegebenen I<BEFEHL> weiter.

source: B<--dbpath >I<DIRECTORY>
de: B<--dbpath >I<VERZEICHNIS>

source: Use the database in I<DIRECTORY> rather than the default path I</var/lib/rpm>
de: verwendet die im I<VERZEICHNIS> angegebene Datenbank anstelle des vorgegebenen Pfads I</var/lib/rpm>.

source: B<--root >I<DIRECTORY>
de: B<--root >I<VERZEICHNIS>

source: Use the file system tree rooted at I<DIRECTORY> for all operations. Note that this means the database within I<DIRECTORY> will be used for dependency checks and any scriptlet(s) (e.g. B<%post> if installing, or B<%prep> if building, a package) will be run after a chroot(2) to I<DIRECTORY>.
de: verwendet das Dateisystem in der durch das I<VERZEICHNIS> angegebenen Wurzel für alle Aktionen. Beachten Sie, dass dies bedeutet, dass die Datenbank in diesem I<VERZEICHNIS> für Abhängigkeitsüberprüfungen verwendet wird und Scriptlets (zum Beispiel B<%post> zum Installieren oder B<%prep> zum Erstellen eines Pakets) nach einem Wechsel in das angegebene I<VERZEICHNIS> mit B<chroot>(2) ausgeführt werden.

source: B<-D, --define='>I<MACRO EXPR>B<'>
de: B<-D, --define='>I<MAKRO AUSDRUCK>B<'>

source: Defines I<MACRO> with value I<EXPR>.
de: definiert ein I<MAKRO> mit dem angegebenen I<AUSDRUCK>.

source: B<--undefine='>I<MACRO>B<'>
de: B<--undefine='>I<MAKRO>B<'>

source: Undefines I<MACRO>.
de: setzt die Definition des angegebenen I<MAKROs> zurück.

source: B<-E, --eval='>I<EXPR>B<'>
de: B<-E, --eval='>I<AUSDRUCK>B<'>

source: Prints macro expansion of I<EXPR>.
de: gibt aus, wie der angegebene I<AUSDRUCK> expandiert wird.

source: More - less often needed - options can be found on the B<rpm-misc(8)> man page.
de: Weitere, seltener benötigte Optionen finden Sie in der Handbuchseite B<rpm-misc>(8).

source: INSTALL AND UPGRADE OPTIONS
de: INSTALLATIONS- UND AKTUALISIERUNGSOPTIONEN

source: In these options, I<PACKAGE_FILE> can be either B<rpm> binary file or ASCII package manifest (see B<PACKAGE SELECTION OPTIONS>), and may be specified as an B<ftp> or B<http> URL, in which case the package will be downloaded before being installed. See B<FTP/HTTP OPTIONS> for information on B<rpm>'s B<ftp> and B<http> client support.
de: In diesen Optionen kann I<PAKETDATEI> entweder eine B<rpm>-Binärdatei oder eine ASCII-Paketliste sein (siehe B<PAKETAUSWAHLOPTIONEN>) und kann als B<ftp>- oder B<http>-URL angegeben werden, wobei das Paket vor der Installation heruntergeladen wird. Siehe B<FTP/HTTP-OPTIONEN> für Informationen dazu, welche B<ftp>- und B<http>-Client-Optionen B<rpm> unterstützt.

source: The general form of an rpm install command is
de: Die allgemeine Form eines Installationsbefehls für B<rpm> lautet:

source: This installs a new package.
de: Dadurch wird ein neues Paket installiert.

source: The general form of an rpm upgrade command is
de: Die allgemeine Form eines Aktualisierungsbefehls für B<rpm> lautet:

source: This upgrades or installs the package currently installed to a newer version. This is the same as install, except all other version(s) of the package are removed after the new package is installed.
de: Dadurch wird ein Paket installiert oder ein aktuell installiertes Paket auf eine neuere Version aktualisiert. Dies ist das Gleiche wie eine Installation, außer dass alle anderen Versionen des Pakets nach der Installation des neuen Pakets entfernt werden.

source: This will upgrade packages, but only ones for which an earlier version is installed.
de: Dadurch werden Pakete aktualisiert, aber nur jene, für die eine ältere Version installiert ist.

source: The general form of an rpm reinstall command is
de: Die allgemeine Form eines B<rpm>-Reinstallationsbefehls ist

source: This reinstalls a previously installed package.
de: Dadurch wird ein bereits installiertes Paket erneut installiert.

source: Installs or upgrades all the missingok files in the package, regardless if they exist.
de: installiert oder aktualisiert alle missingok-Dateien im Paket, ganz gleich, ob sie existieren oder nicht.

source: Used with B<--relocate>, permit relocations on all file paths, not just those I<OLDPATH>'s included in the binary package relocation hint(s).
de: wird zusammen mit B<--relocate> verwendet und erlaubt Verschiebungen aller Dateipfade, nicht nur jener, die als I<ALTER_PFAD> in den Festlegungen zu Verschiebungen im Binärpaket enthalten sind.

source: B<--excludepath >I<OLDPATH>
de: B<--excludepath >I<ALTER_PFAD>

source: Don't install files whose name begins with I<OLDPATH>.
de: installiert keine Dateien, deren Namen mit I<ALTER_PFAD> beginnen.

source: Don't install any files which are marked as artifacts, such as build-id links.
de: installiert keine Dateien, die als Artefakte markiert sind, zum Beispiel »build-id«-Links.

source: Don't install any files which are marked as documentation (which includes man pages and texinfo documents).
de: installiert keine Dateien, die als Dokumentation markiert sind (zum Beispiel Handbuchseiten und Texinfo-Dokumente).

source: Same as using B<--replacepkgs>, B<--replacefiles>, and B<--oldpackage>.
de: ist gleichbedeutend mit B<--replacepkgs>, B<--replacefiles> und B<--oldpackage>.

source: Print 50 hash marks as the package archive is unpacked. Use with B<-v|--verbose> for a nicer display.
de: gibt 50 Rautezeichen aus, wenn das Paketarchiv entpackt wird. Verwenden Sie dies zusammen mit B<-v|--verbose>, um eine schönere Ausgabe zu erhalten.

source: Don't check mount file systems for sufficient disk space before installing this package.
de: überprüft vor der Installation des Pakets auf den eingehängten Dateisystemen nicht, ob genügend Speicherplatz vorhanden ist.

source: Allow installation or upgrading even if the architectures of the binary package and host don't match.
de: erlaubt die Installation oder Aktualisierung selbst dann, wenn die Architekturen des Binärpakets und des Rechners nicht übereinstimmen.

source: Allow installation or upgrading even if the operating systems of the binary package and host don't match.
de: erlaubt die Installation oder Aktualisierung selbst dann, wenn die Betriebssysteme des Binärpakets und des Rechners nicht übereinstimmen.

source: Install documentation files. This is the default behavior.
de: installiert Dokumentationsdateien. Dies ist das Standardverhalten.

source: Update only the database, not the filesystem.
de: aktualisiert nur die Datenbank, jedoch nicht das Dateisystem.

source: Don't verify package or header digests when reading.
de: überprüft beim Lesen keine Paket- oder Header-Prüfsummen.

source: Don't process non-package files as manifests.
de: verarbeitet Nicht-Paketdateien nicht als Paketlisten.

source: Don't verify package or header signatures when reading.
de: überprüft beim Lesen keine Paket- oder Header-Signaturen.

source: Don't do a dependency check before installing or upgrading a package.
de: führt vor der Installation oder Aktualisierung keine Abhängigkeitsüberprüfung aus.

source: Don't set file capabilities.
de: setzt keine Dateifähigkeiten.

source: Don't reorder the packages for an install. The list of packages would normally be reordered to satisfy dependencies.
de: ordnet die Pakete für die Installation nicht neu. Die Paketliste würde normalerweise neu geordnet, um Abhängigkeiten zu erfüllen.

source: Don't perform verify package files prior to installation.
de: führt vor der Installation keine Paketüberprüfung aus.

source: Do not load and execute plugins.
de: lädt keine Plugins und führt keine aus.

source: Don't execute the scriptlet of the same name. The B<--noscripts> option is equivalent to
de: führt das Scriptlet des angegebenen Namens nicht aus. Die Option B<--noscripts> ist gleichbedeutend mit

source: and turns off the execution of the corresponding B<%pre>, B<%post>, B<%preun>, B<%postun> B<%pretrans>, and B<%posttrans> scriptlet(s).
de: und deaktiviert die Ausführung der zugehörigen Scriptlets B<%pre>, B<%post>, B<%preun>, B<%postun> B<%pretrans> und B<%posttrans>.

source: Don't execute any trigger scriptlet of the named type. The B<--notriggers> option is equivalent to
de: führt kein Trigger-Scriptlet des genannten Typs aus. Die Option B<--notriggers> ist gleichbedeutend mit

source: and turns off execution of the corresponding B<%triggerprein>, B<%triggerin>, B<%triggerun>, and B<%triggerpostun> scriptlet(s).
de: und deaktiviert die Ausführung der zugehörigen Scriptlets B<%triggerprein>, B<%triggerin>, B<%triggerun> und B<%triggerpostun>.

source: Allow an upgrade to replace a newer package with an older one.
de: ermöglicht eine Aktualisierung, bei der ein neueres Paket durch ein älteres ersetzt wird.

source: Print percentages as files are unpacked from the package archive. This is intended to make B<rpm> easy to run from other tools.
de: gibt Prozentsätze beim Entpacken von Dateien aus dem Paketarchiv aus. Dadurch soll B<rpm> leichter durch andere Werkzeuge nutzbar sein.

source: B<--prefix >I<NEWPATH>
de: B<--prefix >I<NEUER_PFAD>

source: For relocatable binary packages, translate all file paths that start with the installation prefix in the package relocation hint(s) to I<NEWPATH>.
de: übersetzt für verschiebbare Binärpakete alle Dateipfade, die mit dem Installationspräfix in den Festlegungen zur Verschiebung beginnen, in I<NEUER_PFAD>.

source: B<--relocate >I<OLDPATH>B<=>I<NEWPATH>
de: B<--relocate >I<ALTER_PFAD>B<=>I<NEUER_PFAD>

source: For relocatable binary packages, translate all file paths that start with I<OLDPATH> in the package relocation hint(s) to I<NEWPATH>. This option can be used repeatedly if several I<OLDPATH>'s in the package are to be relocated.
de: übersetzt für verschiebbare Binärpakete sämtliche Dateipfade, die mit I<ALTER_PFAD> beginnen, in die Paketverschiebeanweisungen nach I<NEUER_PFAD>. Diese Option kann wiederholt verwendet werden, falls verschiedene I<ALTE_PFADE> im Paket verschoben werden sollen.

source: Install the packages even if they replace files from other, already installed, packages.
de: installiert die Pakete selbst dann, wenn sie Dateien aus anderen, bereits installierten Paketen überschreiben.

source: Install the packages even if some of them are already installed on this system.
de: installiert die Pakete selbst dann, wenn einige davon bereits auf diesem System installiert sind.

source: Do not install the package, simply check for and report potential conflicts.
de: installiert das Paket nicht, sondern prüft nur auf potenzielle Konflikte und meldet diese.

source: ERASE OPTIONS
de: OPTIONEN ZUM LÖSCHEN

source: The general form of an rpm erase command is
de: Die allgemeine Form eines B<rpm>-Löschbefehls ist

source: B<rpm> {B<-e|--erase>} [B<--allmatches>] [B<--justdb] [--nodeps>] [B<--noscripts>] [B<--notriggers>] [B<--test>] I<PACKAGE_NAME>I< ...>
de: B<rpm> {B<-e|--erase>} [B<--allmatches>] [B<--justdb] [--nodeps>] [B<--noscripts>] [B<--notriggers>] [B<--test>] I<PAKETNAME>I< …>

source: The following options may also be used:
de: Die folgenden Optionen können außerdem verwendet werden:

source: Remove all versions of the package which match I<PACKAGE_NAME>. Normally an error is issued if I<PACKAGE_NAME> matches multiple packages.
de: entfernt alle Versionen eines Pakets, die dem I<PAKETNAMEN> entsprechen. Normalerweise würde ein Fehler ausgegeben, wenn der I<PAKETNAME> auf mehrere Pakete passt.

source: Don't check dependencies before uninstalling the packages.
de: überprüft vor dem Deinstallieren der Pakete keine Abhängigkeiten.

source: Don't execute the scriptlet of the same name. The B<--noscripts> option during package erase is equivalent to
de: führt das Scriptlet des angegebenen Namens nicht aus. Die Option B<--noscripts> während der Löschung eines Pakets ist gleichbedeutend mit

source: and turns off the execution of the corresponding B<%preun>, and B<%postun> scriptlet(s).
de: und deaktiviert die Ausführung der entsprechenden B<%preun>- und B<%postun>-Scriptlets.

source: and turns off execution of the corresponding B<%triggerun>, and B<%triggerpostun> scriptlet(s).
de: und deaktiviert die Ausführung der entsprechenden B<%triggerun>- und B<%triggerpostun>-Scriptlets.

source: Don't really uninstall anything, just go through the motions. Useful in conjunction with the B<-vv> option for debugging.
de: deinstalliert nichts wirklich, sondern arbeitet nur die Schritte ab. Dies ist in Verbindung mit der Option B<-vv> für Debugging-Zwecke nützlich.

source: QUERY OPTIONS
de: ABFRAGEOPTIONEN

source: The general form of an rpm query command is
de: Die allgemeine Form eines B<rpm>-Abfragebefehls ist

source: You may specify the format that package information should be printed in. To do this, you use the
de: Sie können das Format angeben, in dem die Paketinformation ausgegeben werden soll. Dafür verwenden Sie die Option

source: B<--qf|--queryformat> I<QUERYFMT>
de: B<--qf|--queryformat> I<ABFRAGEFORMAT>
