Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpm.8.po
Languages: de

source: option, followed by the I<QUERYFMT> format string. Query formats are modified versions of the standard B<printf(3)> formatting. The format is made up of static strings (which may include standard C character escapes for newlines, tabs, and other special characters) and B<printf(3)> type formatters. As B<rpm> already knows the type to print, the type specifier must be omitted however, and replaced by the name of the header tag to be printed, enclosed by B<{}> characters. Tag names are case insensitive, and the leading B<RPMTAG_> portion of the tag name may be omitted as well.
de: gefolgt von der Formatzeichenkette I<ABFRAGEFORMAT>. Die Abfrageformate sind modifizierte Versionen der Standardformatierung gemäß B<printf>(3). Das Format wird aus statischen Zeichenketten (die Standard-C-Ersetzungscodes für Zeilenvorschübe, Tabulatoren und andere spezielle Zeichen enthalten dürfen) und Formatierern des B<printf>(3)-Typs gebildet. Da B<rpm> den auszugebenden Typ bereits kennt, muss die Typangabe allerdings weggelassen und durch den in geschweifte Klammern (B<{}>) eingeschlossenen Namen des auszugebenden Header-Tags ersetzt werden. Für die Tag-Namen wird Groß-/Kleinschreibung nicht beachtet und der vorangestellte B<RPMTAG_>-Teil des Tag-Namens kann ebenfalls weggelassen werden.

source: Alternate output formats may be requested by following the tag with B<:>I<typetag>. Currently, the following types are supported:
de: Alternative Ausgabeformate können Sie anfordern, indem Sie dem Tag B<:>I<Typ-Tag> anhängen. Derzeit werden die folgenden Typen unterstützt:

source: Wrap a public key in ASCII armor.
de: kapselt einen öffentlichen Schlüssel in ASCII-Panzerung.

source: Display number of elements in array tags.
de: zeigt die Anzahl der Elemente in Feld-Tags an.

source: Encode binary data using base64.
de: kodiert Binärdaten mittels base64.

source: Use strftime(3) "%c" format.
de: verwendet das B<strftime>(3)-Format »%c«.

source: Use strftime(3) "%a %b %d %Y" format.
de: verwendet das B<strftime>(3)-Format »%a %b %d %Y«.

source: Format dependency comparison operator.
de: formatiert den Operator für Abhängigkeitsvergleiche.

source: Format dependency type.
de: formatiert den Abhängigkeitstyp.

source: Perform macro expansion.
de: führt eine Makro-Expansion aus.

source: Format file flags.
de: formatiert Dateiparameter.

source: Format file state.
de: formatiert den Dateistatus.

source: Format file verify status.
de: formatiert den Dateiüberprüfungsstatus.

source: Format in hexadecimal.
de: formatiert hexadezimal.

source: Format in octal.
de: formatiert oktal.

source: Human readable number (in IEC 80000). The suffix K = 1024, M = 1048576, ...
de: erzeugt eine menschenlesbare Zahl (im Format gemäß IEC 80000). Die Endung K = 1024, M = 1048576, …

source: Human readable number (in SI). The suffix K = 1000, M = 1000000, ...
de: erzeugt eine menschenlesbare Zahl (im Format gemäß SI). Die Endung K = 1000, M = 1000000, …

source: Format file permissions.
de: formatiert Dateizugriffsrechte.

source: Display signature fingerprint and time.
de: zeigt Fingerabdruck und Zeitstempel der Signatur an.

source: Escape single quotes for use in a script.
de: maskiert einzelne Anführungszeichen zur Verwendung in einem Skript.

source: Display string format. (default)
de: zeigt im Zeichenkettenformat an (Vorgabe).

source: Display trigger suffix.
de: zeigt die Trigger-Endung an.

source: File verification flags.
de: Dateiüberprüfungsparameter.

source: Wrap data in simple xml markup.
de: bettet die Daten in einfaches XML-Markup ein.

source: For example, to print only the names of the packages queried, you could use B<%{NAME}> as the format string. To print the packages name and distribution information in two columns, you could use B<%-30{NAME}%{DISTRIBUTION}>. B<rpm> will print a list of all of the tags it knows about when it is invoked with the B<--querytags> argument.
de: Um beispielsweise nur die Namen der abgefragten Pakete auszugeben, könnten Sie B<%{NAME}> als Formatzeichenkette angeben. Um die Namen der Pakete und die Distributionsinformationen in zwei Spalten auszugeben, könnten Sie B<%-30{NAME}%{DISTRIBUTION}> verwenden. B<rpm> gibt eine Liste aller bekannten Tags aus, wenn es mit dem Argument B<--querytags> aufgerufen wird.

source: There are three subsets of options for querying: package selection, file selection and information selection.
de: Es gibt drei Options-Untermengen zur Abfrage: Paketauswahl, Dateiauswahl und Informationsauswahl.

source: PACKAGE SELECTION OPTIONS:
de: PAKETAUSWAHLOPTIONEN:

source: I<PACKAGE_NAME>
de: I<PAKETNAME>

source: Query installed package named I<PACKAGE_NAME>. To specify the package more precisely the package name may be followed by the version or version and release both separated by a dash or an architecture name separated by a dot. See the output of B<rpm -qa> or B<rpm -qp >I<PACKAGE_FILE> as an example.
de: fragt das installierte Paket mit dem angegebenen I<PAKETNAMEN> ab. Um ein Paket genauer anzugeben, darf auf den Paketnamen die Version oder die Version und Veröffentlichung (beide durch einen Bindestrich getrennt) oder ein Architekturname (durch einen Punkt getrennt) folgen. Siehe die Ausgabe von B<rpm -qa> oder B<rpm -qp >I<PAKETDATEI> als Beispiel.

source: B<-a, --all [>I<SELECTOR>]
de: B<-a, --all [>I<AUSWÄHLER>]

source: Query all installed packages.
de: fragt alle installierten Pakete ab.

source: An optional I<SELECTOR> in the form of tag=pattern can be provided to narrow the selection, for example name="b*" to query packages whose name starts with "b".
de: Ein optionaler I<AUSWÄHLER> in der Form Tag=Muster kann bereitgestellt werden, um die Auswahl einzugrenzen, zum Beispiel name="b*", um Pakete abzufragen, deren Name mit »b« beginnt.

source: List duplicated packages.
de: listet Paketduplikate auf.

source: B<-f, --file >I<FILE>
de: B<-f, --file >I<DATEI>

source: Query package owning I<FILE>.
de: sucht Pakete, zu denen die I<DATEI> gehört.

source: List file names with POSIX1.e capabilities.
de: listet Dateinamen mit POSIX1.e-Fähigkeiten auf.

source: List file names with their classes (libmagic classification).
de: listet Dateinamen mit deren Klassen auf (Libmagic-Klassifizierung).

source: List file names with their colors (0 for noarch, 1 for 32bit, 2 for 64 bit).
de: listet Dateinamen mit deren »Farben« auf (0 für architekturunabhängig, 1 für 32 Bit, 2 für 64 Bit).

source: List file names with their provides.
de: listet Dateinamen mit deren Bereitstellungen auf.

source: List file names with their requires.
de: listet Dateinamen mit deren Erfordernissen auf.

source: B<-g, --group >I<GROUP>
de: B<-g, --group >I<GRUPPE>

source: Query packages with the group of I<GROUP>.
de: fragt Pakete ab, die zur angegebenen I<GRUPPE> gehören.

source: Query package that contains a given header identifier, i.e. the I<SHA1> digest of the immutable header region.
de: fragt ein Paket ab, das einen angegebenen Header-Bezeichner enthält, das heißt, die I<SHA1>-Prüfsumme des unveränderlichen Header-Teils.

source: B<-p, --package >I<PACKAGE_FILE>
de: B<-p, --package >I<PAKETDATEI>

source: Query an (uninstalled) package I<PACKAGE_FILE>. The I<PACKAGE_FILE> may be specified as an B<ftp> or B<http> style URL, in which case the package header will be downloaded and queried. See B<FTP/HTTP OPTIONS> for information on B<rpm>'s B<ftp> and B<http> client support. The I<PACKAGE_FILE> argument(s), if not a binary package, will be interpreted as an ASCII package manifest unless B<--nomanifest> option is used. In manifests, comments are permitted, starting with a '#', and each line of a package manifest file may include white space separated glob expressions, including URL's, that will be expanded to paths that are substituted in place of the package manifest as additional I<PACKAGE_FILE> arguments to the query.
de: fragt eine (nicht installierte) I<PAKETDATEI> ab. Die I<PAKETDATEI> kann als URL im B<ftp>- oder B<http>-Stil angegeben werden, wobei dann der Paket-Header heruntergeladen und abgefragt wird. Siehe B<FTP/HTTP-OPTIONEN> für Informationen dazu, welche B<ftp>- und B<http>-Client-Optionen B<rpm> unterstützt. Das oder die Argument(e) der I<PAKETDATEI>, sofern diese kein Binärpaket ist, werden als eine ASCII-Paketliste interpretiert, außer wenn die Option B<--nomanifest> verwendet wird. In den Listen sind Kommentare erlaubt, die mit einem I<#> beginnen; außerdem darf jede Zeile der Paketliste durch Leerraum getrennte Glob-Ausdrücke enthalten, einschließlich URLs, die zu Pfaden expandiert werden, die anstelle der Paketliste als zusätzliche I<PAKETDATEI>-Argumente zur Abfrage hinzugefügt werden.

source: Query package that contains a given package identifier, i.e. the I<MD5> digest of the combined header and payload contents.
de: fragt ein Paket ab, das einen angegebenen Paketbezeichner enthält, das heißt, die I<MD5>-Prüfsumme der kombinierten Header- und Nutzdateninhalte.

source: B<--querybynumber >I<HDRNUM>
de: B<--querybynumber >I<HDR-NUMMER>

source: Query the I<HDRNUM>th database entry directly; this is useful only for debugging.
de: fragt den Datenbankeintrag mit der angegebenen I<HDR-NUMMER> direkt ab; dies ist nur für Debugging-Zwecke nützlich.

source: B<--specfile >I<SPECFILE>
de: B<--specfile >I<SPEC-DATEI>

source: Parse and query I<SPECFILE> as if it were a package. Although not all the information (e.g. file lists) is available, this type of query permits rpm to be used to extract information from spec files without having to write a specfile parser.
de: wertet die I<SPEC-Datei> so aus und fragt sie ab, als wäre sie ein Paket. Obwohl nicht alle Informationen verfügbar sind (zum Beispiel Dateilisten), erlaubt dieser Abfragetyp B<rpm>, Informationen aus Spec-Dateien zu holen, ohne dass ein Spec-Datei-Auswertprogramm geschrieben werden muss.

source: B<--tid >I<TID>
de: B<--tid >I<Transaktionskennung>

source: Query package(s) that have a given I<TID> transaction identifier. A unix time stamp is currently used as a transaction identifier. All package(s) installed or erased within a single transaction have a common identifier.
de: fragt Pakete mit der angegebenen I<Transaktionskennung> ab. Als Transaktionskennung wird derzeit ein UNIX-Zeitstempel verwendet. Alle Pakete, die in einer einzelnen Transaktion installiert oder gelöscht wurden, haben eine gemeinsame Kennung.

source: B<--triggeredby >I<PACKAGE_NAME>
de: B<--triggeredby >I<PAKETNAME>

source: Query packages that are triggered by package(s) I<PACKAGE_NAME>.
de: fragt alle Pakete ab, die vom Paket oder den Paketen I<PAKETNAME> getriggert werden.

source: B<--whatobsoletes >I<CAPABILITY>
de: B<--whatobsoletes >I<FÄHIGKEIT>

source: Query all packages that obsolete I<CAPABILITY> for proper functioning.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> als veraltet markieren, um korrekt funktionieren zu können.

source: B<--whatprovides >I<CAPABILITY>
de: B<--whatprovides >I<FÄHIGKEIT>

source: Query all packages that provide the I<CAPABILITY> capability.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> bereitstellen.

source: B<--whatrequires >I<CAPABILITY>
de: B<--whatrequires >I<FÄHIGKEIT>

source: Query all packages that require I<CAPABILITY> for proper functioning.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> zum korrekten Funktionieren benötigen.

source: B<--whatconflicts >I<CAPABILITY>
de: B<--whatconflicts >I<FÄHIGKEIT>

source: Query all packages that conflict with I<CAPABILITY>.
de: fragt alle Pakete ab, die mit der angegebenen I<FÄHIGKEIT> im Konflikt stehen.

source: B<--whatrecommends >I<CAPABILITY>
de: B<--whatrecommends >I<FÄHIGKEIT>

source: Query all packages that recommend I<CAPABILITY>.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> empfehlen.

source: B<--whatsuggests >I<CAPABILITY>
de: B<--whatsuggests >I<FÄHIGKEIT>

source: Query all packages that suggest I<CAPABILITY>.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> vorschlagen.

source: B<--whatsupplements >I<CAPABILITY>
de: B<--whatsupplements >I<FÄHIGKEIT>

source: Query all packages that supplement I<CAPABILITY>.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> ergänzen.

source: B<--whatenhances >I<CAPABILITY>
de: B<--whatenhances >I<FÄHIGKEIT>

source: Query all packages that enhance I<CAPABILITY>.
de: fragt alle Pakete ab, die die angegebene I<FÄHIGKEIT> verbessern.

source: PACKAGE QUERY OPTIONS:
de: OPTIONEN ZUR PAKETABFRAGE:

source: Display change information for the package.
de: zeigt Änderungsinformationen des Pakets an.

source: Display change information for the package with full time stamps.
de: zeigt Änderungsinformationen mit vollständigen Zeitstempeln für das Paket an.

source: List capabilities this package conflicts with.
de: listet die Fähigkeiten auf, zu denen dieses Paket im Konflikt steht.

source: Dump file information as follows (implies B<-l>):
de: gibt Dateiinformationen wie folgt aus (impliziert B<-l>):

source: path size mtime digest mode owner group isconfig isdoc rdev symlink
de: Pfad Größe Änderungszeit Prüfsumme Modus Eigentümer Gruppe istKonfiguration istDokumentation Rdev Symlink

source: List capabilities enhanced by package(s)
de: listet die Fähigkeiten auf, die dieses Paket verbessert.

source: List all the files in each selected package.
de: listet alle Dateien in jedem ausgewählten Paket auf.

source: List filetrigger scriptlets from package(s).
de: listet Dateitrigger-Scriptlets aus dem oder den angegebenen Paket(en) auf.

source: Display package information, including name, version, and description. This uses the B<--queryformat> if one was specified.
de: zeigt Paketinformationen wie Name, Version und Beschreibung an. Dies verwendet B<--queryformat>, falls angegeben.

source: Orders the package listing by install time such that the latest packages are at the top.
de: ordnet die Paketauflistung nach Installationszeitpunkt, so dass die neuesten Pakete zuerst angezeigt werden.

source: List files in package.
de: listet die Dateien im Paket auf.

source: List packages this package obsoletes.
de: listet Pakete auf, die durch dieses Paket als veraltet markiert werden.

source: List capabilities this package provides.
de: listet die Fähigkeiten auf, die dieses Paket bereitstellt.

source: List capabilities recommended by package(s)
de: listet die Fähigkeiten auf, die dieses Paket empfiehlt.

source: List capabilities on which this package depends.
de: listet die Fähigkeiten auf, von denen dieses Paket abhängt.

source: List capabilities suggested by package(s)
de: listet die Fähigkeiten auf, die von Paket(en) vorgeschlagen werden.

source: List capabilities supplemented by package(s)
de: listet die Fähigkeiten auf, die von Paket(en) ergänzt werden.

source: List the package specific scriptlet(s) that are used as part of the installation and uninstallation processes.
de: listet das oder die paketspezifischen Scriptlet(s) auf, die als Teil des Installations- und Deinstallationsprozesses verwendet werden.

source: Display the I<states> of files in the package (implies B<-l>). The state of each file is one of I<normal>, I<not installed>, or I<replaced>.
de: zeigt die I<Status> der Dateien im Paket an (impliziert B<-l>). Der Status jeder der Dateien ist I<normal>, I<nicht installiert> oder I<ersetzt>.

source: Display the trigger scripts, if any, which are contained in the package. B<--xml> Format package headers as XML.
de: zeigt die Triggerskripte an, sofern vorhanden, die in einem Paket enthalten sind. B<--xml> Formatiert Paket-Header als XML.

source: FILE SELECTION OPTIONS:
de: OPTIONEN ZUR DATEIAUSWAHL:

source: Only include artifact files (implies B<-l>).
de: schließt nur Artefakt-Dateien ein (impliziert B<-l>).

source: Only include configuration files (implies B<-l>).
de: schließt nur Konfigurationsdateien ein (impliziert B<-l>).

source: Only include documentation files (implies B<-l>).
de: schließt nur Dokumentationsdateien ein (impliziert B<-l>).

source: Only include license files (implies B<-l>).
de: schließt nur Lizenzdateien ein (impliziert B<-l>).

source: Exclude artifact files.
de: schließt Artefakt-Dateien aus.

source: Exclude config files.
de: schließt Konfigurationsdateien aus.

source: Exclude ghost files.
de: schließt Ghost-Dateien aus.

source: VERIFY OPTIONS
de: ÜBERPRÜFUNGSOPTIONEN

source: The general form of an rpm verify command is
de: Die allgemeine Form eines B<rpm>-Überprüfungsbefehls ist

source: Verifying a package compares information about the installed files in the package with information about the files taken from the package metadata stored in the rpm database. Among other things, verifying compares the size, digest, permissions, type, owner and group of each file. Any discrepancies are displayed. Files that were not installed from the package, for example, documentation files excluded on installation using the "B<--excludedocs>" option, will be silently ignored.
de: Bei der Überprüfung von Paketen werden Informationen zu den vom Paket installierten Dateien mit den Informationen zu den Dateien, die aus den aus der B<rpm>-Datenbank Paket-Metadaten bezogen werden, verglichen. Unter anderem werden Größe, Prüfsumme, Zugriffsrechte, Typ, Eigentümer und Gruppe jeder Datei verglichen. Alle Unstimmigkeiten werden angezeigt. Dateien aus dem Paket, die nicht installiert wurden, beispielsweise wenn mit der Option B<--excludedocs> Dokumentationsdateien von der Installation ausgeschlossen wurden, werden stillschweigend ignoriert.

source: The package and file selection options are the same as for package querying (including package manifest files as arguments). Other options unique to verify mode are:
de: Die Paket- und Dateiauswahloptionen sind die gleichen wie für die Abfrage von Paketen (einschließlich der Paketlistendateien als Argumente). Weitere Optionen nur für den Überprüfungsmodus sind:

source: Don't verify dependencies of packages.
de: überprüft die Abhängigkeiten von Paketen nicht.

source: Don't verify any attributes of package files.
de: überprüft keine Attribute von Paketdateien.

source: Don't execute the B<%verifyscript> scriptlet (if any).
de: führt das B<%verifyscript>-Scriptlet nicht aus (falls vorhanden).

source: B<--nofiledigest> (formerly B<--nomd5>)
de: B<--nofiledigest> (früher B<--nomd5>)

source: Don't verify the corresponding file attribute.
de: überprüft das zugehörige Dateiattribut nicht.

source: Don't verify file capabilities.
de: überprüft keine Dateifähigkeiten.

source: The format of the output is a string of 9 characters, a possible attribute marker:
de: Das Format der Ausgabe ist eine aus neun Zeichen bestehende Zeichenkette und eventuell einer Attributmarkierung:

source: B<c> B<%config> configuration file. B<d> B<%doc> documentation file. B<g> B<%ghost> file (i.e. the file contents are not included in the package payload). B<l> B<%license> license file. B<r> B<%readme> readme file.
de: B<c> B<%config> Konfigurationsdatei. B<d> B<%doc> Dokumentationsdatei. B<g> B<%ghost> Ghost-Datei (d.h. der Inhalt der Datei gehört nicht zu den Nutzdaten des Pakets). B<l> B<%license> Lizenzdatei. B<r> B<%readme> README-Datei.

source: from the package header, followed by the file name. Each of the 9 characters denotes the result of a comparison of attribute(s) of the file to the value of those attribute(s) recorded in the database. A single "B<.>" (period) means the test passed, while a single "B<?>" (question mark) indicates the test could not be performed (e.g. file permissions prevent reading). Otherwise, the (mnemonically emB<B>oldened) character denotes failure of the corresponding B<--verify> test:
de: aus dem Paket-Header, gefolgt vom Dateinamen. Jedes der 9 Zeichen steht für das Ergebnis eines Vergleichs des Attributs oder der Attribute, die in der Datenbank enthalten sind. Ein einzelner Punkt (»B<.>«) bedeutet, dass der Test erfolgreich war, während ein Fragezeichen (»B<?>«) bedeutet, dass der Test nicht ausgeführt werden konnte (zum Beispiel weil Dateizugriffsrechte den Lesezugriff verhindert haben). Anderenfalls bezeichnet ein B<fett> hervorgehobenes Zeichen den Fehlschlag des korrespondierenden Tests mit B<--verify>:

source: B<S> file B<S>ize differs B<M> B<M>ode differs (includes permissions and file type) B<5> digest (formerly MDB<5> sum) differs B<D> B<D>evice major/minor number mismatch B<L> readB<L>ink(2) path mismatch B<U> B<U>ser ownership differs B<G> B<G>roup ownership differs B<T> mB<T>ime differs B<P> caB<P>abilities differ
de: B<S> Dateigröße ist unterschiedlich B<M> Modus ist unterschiedlich (Zugriffsrechte und Dateityp) B<5> Prüfsumme (früher MD5-Summe) ist unterschiedlich B<D> Major/Minor-Nummer der Geräte sind unterschiedlich B<L> Pfad zu B<readlink>(2) passt nicht B<U> Benutzer (Eigentümer) ist unterschiedlich B<G> Gruppe ist unterschiedlich B<T> Zeit ist unterschiedlich B<P> Fähigkeiten sind unterschiedlich

source: MISCELLANEOUS COMMANDS
de: VERSCHIEDENE BEFEHLE

source: shows the values B<rpm> will use for all of the options are currently set in I<rpmrc> and I<macros> configuration file(s).
de: zeigt die Werte an, die B<rpm> für alle Optionen verwendet, die gegenwärtig in den I<rpmrc>- und I<macros>-Konfigurationsdateien gesetzt sind.

source: B<rpm> B<--setperms> I<PACKAGE_NAME>
de: B<rpm> B<--setperms> I<PAKETNAME>

source: sets permissions of files in the given package. Consider using B<--restore> instead.
de: legt die Zugriffsrechte der Dateien des angegebenen Pakets fest. Sie sollten stattdessen B<--restore> verwenden.

source: B<rpm> B<--setugids> I<PACKAGE_NAME>
de: B<rpm> B<--setugids> I<PAKETNAME>

source: sets user/group ownership of files in the given package. This command can change permissions and capabilities of files in that package. In most cases it is better to use B<--restore> instead.
de: legt die Eigentumsverhältnisse bezüglich Benutzer und Gruppe des angegebenen Pakets fest. Dieser Befehl kann Zugriffsrechte und Fähigkeiten der Dateien in diesem Paket ändern. In den meisten Fällen ist es besser, B<--restore> zu verwenden.

source: B<rpm> B<--setcaps> I<PACKAGE_NAME>
de: B<rpm> B<--setcaps> I<PAKETNAME>

source: sets capabilities of files in the given package. Consider using B<--restore> instead.
de: legt die Fähigkeiten der Dateien im angegebenen Paket fest. Sie sollten stattdessen B<--restore> verwenden.

source: B<rpm> B<--restore> I<PACKAGE_NAME>
de: B<rpm> B<--restore> I<PAKETNAME>

source: The option restores owner, group, permissions and capabilities of files in the given package.
de: stellt den Eigentümer, die Gruppe, die Dateizugriffsrechte und die Fähigkeiten von Dateien in dem angegebenen Paket wieder her.

source: Options B<--setperms>, B<--setugids>, B<--setcaps> and
de: Die Optionen B<--setperms>, B<--setugids>, B<--setcaps> und

source: B<--restore> are mutually exclusive.
de: B<--restore> schließen sich gegenseitig aus.

source: FTP/HTTP OPTIONS
de: FTP/HTTP-OPTIONEN

source: B<rpm> can act as an FTP and/or HTTP client so that packages can be queried or installed from the internet. Package files for install, upgrade, and query operations may be specified as an B<ftp> or B<http> style URL:
de: B<rpm> kann als FTP- und/oder HTTP-Client agieren, so dass Pakete aus dem Internet abgefragt oder installiert werden können. Paketdateien zum Installieren, Aktualisieren oder Abfragen können als URL im B<ftp>- oder B<http>-Stil angegeben werden:

source: http://HOST[:PORT]/path/to/package.rpm
de: http://HOST[:PORT]/Pfad/zum/Paket.rpm

source: ftp://[USER:PASSWORD]@HOST[:PORT]/path/to/package.rpm
de: ftp://[BENUTZER:PASSWORT]@RECHNER[:PORT]/Pfad/zum/Paket.rpm

source: If both the user and password are omitted, anonymous B<ftp> is used.
de: Falls sowohl Benutzer als auch Passwort weggelassen werden, dann erfolgt der B<ftp>-Zugriff anonym.
