Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpmbuild.8.po
Languages: de

source: 09 June 2002
de: 9. Juni 2002

source: NAME
de: BEZEICHNUNG

source: rpmbuild - Build RPM Package(s)
de: rpmbuild - RPM-Paket(e) bauen

source: SYNOPSIS
de: ÜBERSICHT

source: BUILDING PACKAGES:
de: PAKETE BAUEN:

source: B<rpmbuild> {B<-ba|-bb|-bp|-bc|-bi|-bl|-bs|-br>} [B<rpmbuild-options>] I<SPECFILE>I< ...>
de: B<rpmbuild> {B<-ba|-bb|-bp|-bc|-bi|-bl|-bs|-br>} [B<Rpmbuild-Optionen>] I<SPEC-DATEI>I< …>

source: B<rpmbuild> {B<-ra|-rb|-rp|-rc|-ri|-rl|-rs|-rr>} [B<rpmbuild-options>] I<SOURCEPACKAGE>I< ...>
de: B<rpmbuild> {B<-ra|-rb|-rp|-rc|-ri|-rl|-rs|-rr>} [B<Rpmbuild-Optionen>] I<QUELLPAKET>I< …>

source: B<rpmbuild> {B<-ta|-tb|-tp|-tc|-ti|-tl|-ts|-tr>} [B<rpmbuild-options>] I<TARBALL>I< ...>
de: B<rpmbuild> {B<-ta|-tb|-tp|-tc|-ti|-tl|-ts|-tr>} [B<Rpmbuild-Optionen>] I<TARBALL>I< …>

source: B<rpmbuild> {B<--rebuild|--recompile>} I<SOURCEPKG>I< ...>
de: B<rpmbuild> {B<--rebuild|--recompile>} I<QUELLPAKET>I< …>

source: MISCELLANEOUS:
de: SONSTIGES:

source: rpmbuild-options
de: Rpmbuild-Optionen

source: [B<--buildroot >I<DIRECTORY>] [B<--clean>] [B<--nobuild>] [B<--rmsource>] [B<--rmspec>] [B<--short-circuit>] [B<--build-in-place>] [B<--noprep>] [B<--noclean>] [B<--nocheck>] [B<--rpmfcdebug>] [B<--target >I<PLATFORM>] [B<--with >I<OPTION>] [B<--without >I<OPTION>]
de: [B<--buildroot >I<VERZEICHNIS>] [B<--clean>] [B<--nobuild>] [B<--rmsource>] [B<--rmspec>] [B<--short-circuit>] [B<--build-in-place>] [B<--noprep>] [B<--noclean>] [B<--nocheck>] [B<--rpmfcdebug>] [B<--target >I<PLATTFORM>] [B<--with >I<OPTION>] [B<--without >I<OPTION>]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<rpmbuild> is used to build both binary and source software packages. A B<package> consists of an archive of files and meta-data used to install and erase the archive files. The meta-data includes helper scripts, file attributes, and descriptive information about the package. B<Packages> come in two varieties: binary packages, used to encapsulate software to be installed, and source packages, containing the source code and recipe necessary to produce binary packages.
de: B<rpmbuild> wird zum Bau von sowohl Binär- als auch Quell-Softwarepaketen verwendet. Ein B<Paket> besteht aus einem Dateiarchiv sowie Metadaten, die zum Installieren und Löschen der Archivdateien verwendet werden. Die Metadaten enthalten Hilfsskripte, Dateiattribute und beschreibende Informationen zum Paket. Die B<Pakete> gibt es in zwei Varianten: Binärpakete, welche die zu installierende Software enthalten, und Quellpakete, welche den Quellcode und die Anweisungen zum Bauen von Binärpaketen enthalten.

source: One of the following basic modes must be selected: B<Build Package>, B<Build Package from Tarball>, B<Recompile Package>, B<Show Configuration>.
de: Einer der folgenden grundlegenden Modi muss ausgewählt werden: B<Paket bauen>, B<Paket aus einem Tarball bauen>, B<Paket erneut kompilieren>, B<Konfiguration anzeigen>.

source: GENERAL OPTIONS
de: ALLGEMEINE OPTIONEN

source: These options can be used in all the different modes.
de: Diese Optionen können in allen der verschiedenen Modi verwendet werden.

source: Print a longer usage message then normal.
de: gibt eine längere Hilfemeldung als sonst aus.

source: Print a single line containing the version number of B<rpm> being used.
de: gibt eine einzelne Zeile aus, welche die Versionsummer von B<rpm> angibt.

source: Print as little as possible - normally only error messages will be displayed.
de: gibt so wenig wie möglich aus – es werden normalerweise nur Fehlermeldungen angezeigt.

source: Print verbose information - normally routine progress messages will be displayed.
de: gibt ausführliche Informationen aus - normale Routine-Fortschrittsmeldungen werden angezeigt.

source: Print lots of ugly debugging information.
de: gibt umfangreiche Debugging-Informationen aus.

source: Enables to debug dependencies generation.
de: aktiviert das Debugging der Erzeugung der Abhängigkeiten.

source: B<--rcfile >I<FILELIST>
de: B<--rcfile >I<DATEILISTE>

source: Each of the files in the colon separated I<FILELIST> is read sequentially by B<rpm> for configuration information. Only the first file in the list must exist, and tildes will be expanded to the value of B<$HOME>. The default I<FILELIST> is I</usr/lib/rpm/rpmrc>:I</usr/lib/rpm/E<lt>vendorE<gt>/rpmrc>:I</etc/rpmrc>:I<~/.rpmrc>.
de: lässt B<rpm> die Dateien in der durch Doppelpunkte getrennten I<DATEILISTE> nacheinander einlesen, um Konfigurationsinformationen zu erhalten. Nur die erste Datei in der Liste muss existieren; die Tilde wird dabei zum Wert der Umgebungsvariable B<$HOME> expandiert. Die vorgegebene I<DATEILISTE> ist I</usr/lib/rpm/rpmrc>:I</usr/lib/rpm/E<lt>AnbieterE<gt>/rpmrc>:I</etc/rpmrc>:I<~/.rpmrc>.

source: B<--pipe >I<CMD>
de: B<--pipe >I<BEFEHL>

source: Pipes the output of B<rpm> to the command I<CMD>.
de: leitet die Ausgabe des Befehls B<rpm> an den angegebenen I<BEFEHL> weiter.

source: B<--dbpath >I<DIRECTORY>
de: B<--dbpath >I<VERZEICHNIS>

source: Use the database in I<DIRECTORY> rather than the default path I</var/lib/rpm>
de: verwendet die im I<VERZEICHNIS> angegebene Datenbank anstelle des vorgegebenen Pfads I</var/lib/rpm>.

source: B<--root >I<DIRECTORY>
de: B<--root >I<VERZEICHNIS>

source: Use the file system tree rooted at I<DIRECTORY> for all operations. Note that this means the database within I<DIRECTORY> will be used for dependency checks and any scriptlet(s) (e.g. B<%post> if installing, or B<%prep> if building, a package) will be run after a chroot(2) to I<DIRECTORY>.
de: verwendet das Dateisystem in der durch das I<VERZEICHNIS> angegebenen Wurzel für alle Aktionen. Beachten Sie, dass dies bedeutet, dass die Datenbank in diesem I<VERZEICHNIS> für Abhängigkeitsüberprüfungen verwendet wird und Scriptlets (zum Beispiel B<%post> zum Installieren oder B<%prep> zum Erstellen eines Pakets) nach einem Wechsel in das angegebene I<VERZEICHNIS> mit B<chroot>(2) ausgeführt werden.

source: B<-D, --define='>I<MACRO EXPR>B<'>
de: B<-D, --define='>I<MAKRO AUSDRUCK>B<'>

source: Defines I<MACRO> with value I<EXPR>.
de: definiert ein I<MAKRO> mit dem angegebenen I<AUSDRUCK>.

source: Select the I<SCM> to use with %autosetup, if one is not set in the spec file. Note that not all values for I<SCM>, e.g., B<patch> (the default) and B<gendiff>, B<git>, or B<quilt> work interchangeably with all other patches and options stated in the %autosetup line, especially option B<-p>I<N>.
de: wählt das angegebene I<SCM> zur Verwendung mit B<%autosetup>, falls keines in der Spec-Datei angegeben ist. Beachten Sie, dass nicht alle Werte für I<SCM>, zum Beispiel B<patch> (die Vorgabe) sowie B<gendiff>, B<git> oder B<quilt> mit allen in der B<%autosetup>-Zeile angegebenen Patches und Optionen funktionieren, insbesondere mit der Option B<-p>I<N>.

source: BUILD OPTIONS
de: BAUOPTIONEN

source: The general form of an rpm build command is
de: Die allgemeine Form eines Baubefehls für B<rpm> lautet:

source: B<rpmbuild> {B<-b>I<STAGE>B<|-r>I<STAGE>B<|-t>I<STAGE>} [B<rpmbuild-options>] I<FILE>I< ...>
de: B<rpmbuild> {B<-b>I<PHASE>B<|-r>I<PHASE>B<|-t>I<PHASE>} [B<Rpmbuild-Optionen>] I<DATEI>I< …>

source: The argument used is B<-b> if a spec file is being used to build the package, B<-r> if a source package is to be rebuilt and B<-t> if B<rpmbuild> should look inside of a (possibly compressed) tar file for the spec file to use.
de: Das verwendete Argument ist B<-b>, falls eine Spec-Datei zum Bau des Pakets eingesetzt wird, B<-r>, wenn ein Quellpaket erneut gebaut werden soll und B<-t>, falls B<rpmbuild> in einer (gegebenenfalls komprimierten) Tar-Datei nach der zu verwendenden Spec-Datei suchen soll.

source: Packages are built in a number of stages. The first six correspond to the following sections in a spec file: B<%prep>, B<%generate_buildrequires>, B<%build>, B<%install>, B<%check> and B<%clean>. Finally, binary and source packages are created in an assembly stage.
de: Pakete werden in einer Reihe von Phasen gebaut. Die ersten sechs entsprechen den folgenden Abschnitten in einer Spec-Datei: B<%prep>, B<%generate_buildrequires>, B<%build>, B<%install>, B<%check> und B<%clean>. Zuletzt werden Binär- und Quellpakete in der Zusammenbauphase gebaut.

source: The I<STAGE> character specifies the stage to finish with (after doing all the stages preceding it), and is one of:
de: Das I<PHASE>-Zeichen gibt die Phase an, mit der der Vorgang beendet werden soll (nachdem alle ihr vorausgehenden Phasen durchlaufen wurden). Es ist eines aus den folgenden Zeichen:

source: Perform a full build - executes up to and including the assembly stage. In most cases, this is the option to choose.
de: führt einen vollständigen Bauvorgang aus – bis einschließlich der Zusammenbauphase. In den meisten Fällen ist dies die zu wählende Option.

source: Build just the binary packages - executes up to and including the assembly stage, but without creating the source package.
de: baut nur die Binärpakete – die Ausführung läuft bis einschließlich der Zusammenbauphase durch, ohne aber das Quellpaket zu bauen.

source: Unpack the sources and apply any patches - executes the %prep stage only.
de: entpackt die Quellen und wendet eventuelle Patches an – nur die B<%prep>-Phase wird durchlaufen.

source: Compile the sources - executes up to and including the %build stage. This generally involves the equivalent of a "make".
de: kompiliert die Quellen – führt alles bis einschließlich der B<%prep>-Phase aus. Dies beinhaltet im Allgemeinen einen Aufruf von B<make> oder etwas Gleichbedeutendem.

source: Install the binaries into the build root - executes up to and including the %check stage. This generally involves the equivalent of a "make install" and "make check".
de: installiert die Binärdateien in BuildRoot – führt alles bis einschließlich der B<%check>-Phase aus. Dies beinhaltet im Allgemeinen einen Aufruf von B<make install> und B<make check> oder etwas Gleichbedeutendem.

source: Do a "list check" - the %files section from the spec file is macro expanded, and checks are made to verify that each file exists.
de: führt eine Listenüberprüfung aus. Der B<%files>-Abschnitt in der Spec-Datei wird Makro-expandiert und es wird überprüft, ob jede der angegebenen Dateien existiert.

source: Build just the source package - skips straight to the assembly stage, without executing any of the preceding stages or creating binary packages.
de: baut nur das Quellpaket – springt direkt zur Zusammenbauphase, ohne eine der vorausgehenden Phasen zu durchlaufen oder Binärpakete zu bauen.

source: Build just the source package, but also parse and include dynamic build dependencies - executes up to and including the %generate_buildrequires stage and then skips straight to the assembly stage, without creating binary packages. This command can be used to fully resolve dynamic build dependencies. See the DYNAMIC BUILD DEPENDENCIES section for details.
de: baut nur das Quellpaket, wertet aber auch dynamische Bauabhängigkeiten aus und bezieht diese ein – führt alles bis einschließlich der B<%generate_buildrequires>-Phase aus und springt dann direkt zur Zusammenbauphase, ohne Binärpakete zu bauen. Dieser Befehl kann dazu verwendet werden, dynamische Bauabhängigkeiten vollständig aufzulösen. Im Abschnitt B<DYNAMISCHE BAUABHÄNGIGKEITEN> finden Sie weitere Details hierzu.

source: The following options may also be used:
de: Die folgenden Optionen können außerdem verwendet werden:

source: B<--buildroot >I<DIRECTORY>
de: B<--buildroot >I<VERZEICHNIS>

source: When building a package, override the BuildRoot tag with directory I<DIRECTORY>.
de: ersetzt B<BuildRoot> beim Bau eines Pakets durch das angegebene I<VERZEICHNIS>.

source: Remove the build tree after the packages are made.
de: entfernt den Bau-Dateibaum, nachdem die Pakete gebaut wurden.

source: Do not execute any build stages. Useful for testing out spec files.
de: führt keine Bauphasen aus. Dies ist zum Testen von Spec-Dateien nützlich.

source: Do not execute %prep build stage even if present in spec.
de: führt die B<%prep>-Phase nicht aus, selbst wenn diese in der Spec-Datei vorhanden ist.

source: Do not execute %clean build stage even if present in spec.
de: führt die Bauphase B<%clean> nicht aus, selbst wenn diese in der Spec-Datei vorhanden ist.

source: Do not execute %check build stage even if present in spec.
de: führt die Bauphase B<%check> nicht aus, selbst wenn diese in der Spec-Datei vorhanden ist.

source: Do not generate debuginfo packages.
de: baut keine Debuginfo-Pakete.

source: Do not verify build dependencies.
de: überprüft keine Bauabhängigkeiten.

source: Remove the sources after the build (may also be used standalone, e.g. "B<rpmbuild> B<--rmsource foo.spec>").
de: entfernt die Quellen nach dem Bau (kann auch für sich allein verwendet werden, zum Beispiel »B<rpmbuild> B<--rmsource foo.spec>«).

source: Remove the spec file after the build (may also be used standalone, eg. "B<rpmbuild> B<--rmspec foo.spec>").
de: entfernt die Spec-Datei nach dem Bau (dies kann auch für sich allein verwendet werden, zum Beispiel »B<rpmbuild> B<--rmspec foo.spec>«).

source: Skip straight to specified stage (i.e., skip all stages leading up to the specified stage). Only valid with B<-bc>, B<-bi>, and B<-bb>. Useful for local testing only. Packages built this way will be marked with an unsatisfiable dependency to prevent their accidental use.
de: springt direkt zu der angegebenen Phase (das heißt, überspringt alle Phasen, die zu der angegebenen Phase führen). Dies ist nur mit B<-bc>, B<-bi> und B<-bb> zulässig. Dies ist nur für lokale Testzwecke nützlich. Auf diese Weise gebaute Pakete werden mit einer nicht auflösbaren Abhängigkeit versehen, um deren versehentliche Verwendung zu verhindern.

source: Build from locally checked out sources. Sets _builddir to current working directory. Skips handling of -n and untar in the %setup and the deletion of the buildSubdir.
de: baut aus lokal ausgecheckten Quellen. Dabei wird B<_builddir> auf das aktuelle Arbeitsverzeichnis gesetzt. Die Auswertung von B<-n> und B<untar> in der B<%setup>-Phase und das Löschen von B<buildSubdir> wird übersprungen.

source: B<--target >I<PLATFORM>
de: B<--target >I<PLATTFORM>

source: When building the package, interpret I<PLATFORM> as B<arch-vendor-os> and set the macros B<%_target>, B<%_target_cpu>, and B<%_target_os> accordingly.
de: interpretiert beim Bauen eines Pakets die I<PLATTFORM> als B<arch-vendor-os> und setzt die Makros B<%_target>, B<%_target_cpu> und B<%_target_os> entsprechend.

source: Enable configure I<OPTION> for build.
de: aktiviert die Konfigurationsoption I<OPTION> für den Bau.

source: Disable configure I<OPTION> for build.
de: deaktiviert die Konfigurationsoption I<OPTION> für den Bau.

source: REBUILD AND RECOMPILE OPTIONS
de: OPTIONEN ZUM NEU BAUEN UND NEU KOMPILIEREN

source: There are two other ways to invoke building with rpm:
de: Es gibt zwei weitere Möglichkeiten, den Bauvorgang mit B<rpm> anzustoßen:

source: B<rpmbuild> B<--rebuild|--recompile> I<SOURCEPKG>I< ...>
de: B<rpmbuild> B<--rebuild|--recompile> I<QUELLPAKET>I< …>

source: When invoked this way, B<rpmbuild> installs the named source package, and does a prep, compile and install. In addition, B<--rebuild> builds a new binary package. When the build has completed, the build directory is removed (as in B<--clean>) and the the sources and spec file for the package are removed.
de: Wenn es auf diese Weise aufgerufen wird, installiert B<rpmbuild> das benannte Quellpaket und führt die B<%prep>-Phase (die Vorbereitung), die Kompilierung und die Installation aus. Zusätzlich baut die Option B<--rebuild> ein neues Binärpaket. Wenn der Bau abgeschlossen ist, werden das Bauverzeichnis (wie in B<--clean>) und die Quell- sowie Spec-Dateien gelöscht.

source: These options are now superseded by the B<-r*> options which allow much more fine control over what stages of the build to run.
de: Diese Optionen wurden nun durch die B<-r*>-Optionen ersetzt, die eine weitaus genauere Steuerung ermöglichen, welche Bauphasen ausgeführt werden sollen.

source: DYNAMIC BUILD DEPENDENCIES
de: DYNAMISCHE BAUABHÄNGIGKEITEN

source: When the %generate_buildrequires stage runs and some of the newly generated BuildRequires are not satisfied, B<rpmbuild> creates an intermediate source package ending in I<buildreqs.nosrc.rpm>, which has the new BuildRequires, and exits with code 11. This package can then be used in place of the original source package to resolve and install the missing build dependencies in the usual way, such as with B<dnf-builddep(8)>.
de: Wenn die B<%generate_buildrequires>-Phase läuft und einige der neu erzeugten Bauabhängigkeiten nicht erfüllt werden konnten, baut B<rpmbuild> ein vorläufiges Quellpaket, das die neuen Bauabhängigkeiten enthält und mit I<buildreqs.nosrc.rpm> endet, und beendet sich mit dem Code 11. Dieses Paket kann dann anstelle des originalen Quellpakets verwendet werden, um die fehlenden Bauabhängigkeiten auf die übliche Weise aufzulösen und zu installieren, beispielsweise mit B<dnf-builddep>(8).

source: Multiple layers of dynamic build dependencies may exist in a spec file; the presence of specific BuildRequires on the system may yield new BuildRequires next time a build is performed with the same source package. The easiest way to ensure that all dynamic build dependencies are satisfied is to run the B<-br> command, install the new dependencies of the I<buildreqs.nosrc.rpm> package and repeat the whole procedure until B<rpmbuild> no longer exits with code 11.
de: In einer Spec-Datei kann es mehrere Schichten dynamischer Bauabhängigkeiten geben; das Vorhandensein einer spezifischen Bauabhängigkeit im System kann beim nächsten Bau aus dem gleichen Quellpaket neue Bauabhängigkeiten hervorbringen. Um sicherzustellen, dass alle zum Ausführen von B<rpmbuild> mit der Option B<-br> erforderlichen Bauabhängigkeiten erfüllt sind, ist es der einfachste Weg, die neuen Abhängigkeiten des I<buildreqs.nosrc.rpm>-Pakets zu installieren und die gesamte Prozedur so oft zu wiederholen, bis B<rpmbuild> nicht mehr mit dem Code 11 beendet wird.

source: If the B<-br> command is coupled with B<--nodeps>, exit code 11 is always returned and a I<buildreqs.nosrc.rpm> package is always created.
de: Falls die Option B<-br> mit B<--nodeps> gekoppelt wird, wird stets der Exit-Code 11 zurückgegeben und ein I<buildreqs.nosrc.rpm>-Paket gebaut.

source: The command
de: Der Befehl

source: shows the values B<rpmbuild> will use for all of the options are currently set in I<rpmrc> and I<macros> configuration file(s).
de: zeigt die Werte an, die B<rpmbuild> für alle Optionen anwenden wird, die gegenwärtig in den Konfigurationsdateien I<rpmrc> und I<macros> gesetzt sind.

source: FILES
de: DATEIEN

source: rpmrc Configuration
de: Rpmrc-Konfiguration

source: I</usr/lib/rpm/rpmrc> I</usr/lib/rpm/E<lt>vendorE<gt>/rpmrc> I</etc/rpmrc> I<~/.rpmrc>
de: I</usr/lib/rpm/rpmrc> I</usr/lib/rpm/E<lt>AnbieterE<gt>/rpmrc> I</etc/rpmrc> I<~/.rpmrc>

source: Macro Configuration
de: Makro-Konfiguration

source: I</usr/lib/rpm/macros> I</usr/lib/rpm/E<lt>vendorE<gt>/macros> I</etc/rpm/macros> I<~/.rpmmacros>
de: I</usr/lib/rpm/macros> I</usr/lib/rpm/E<lt>AnbieterE<gt>/macros> I</etc/rpm/macros> I<~/.rpmmacros>

source: Temporary
de: Temporär

source: SEE ALSO
de: SIEHE AUCH

source: B<rpmbuild --help> - as rpm supports customizing the options via popt aliases it's impossible to guarantee that what's described in the manual matches what's available.
de: B<rpmbuild --help> - da B<rpm> benutzerdefinierte Optionen über Popt-Aliase unterstützt, können wir unmöglich garantieren, dass die Beschreibungen in diesem Handbuch exakt dem entsprechen, was verfügbar ist.

source: AUTHORS
de: AUTOREN

source: B<rpmbuild> {B<-ba|-bb|-bp|-bc|-bi|-bl|-bs>} [B<rpmbuild-options>] I<SPECFILE>I< ...>
de: B<rpmbuild> {B<-ba|-bb|-bp|-bc|-bi|-bl|-bs>} [B<Rpmbuild-Optionen>] I<SPEC-DATEI>I< …>

source: B<rpmbuild> {B<-ra|-rb|-rp|-rc|-ri|-rl|-rs>} [B<rpmbuild-options>] I<SOURCEPACKAGE>I< ...>
de: B<rpmbuild> {B<-ra|-rb|-rp|-rc|-ri|-rl|-rs>} [B<Rpmbuild-Optionen>] I<QUELLPAKET>I< …>

source: B<rpmbuild> {B<-ta|-tb|-tp|-tc|-ti|-tl|-ts>} [B<rpmbuild-options>] I<TARBALL>I< ...>
de: B<rpmbuild> {B<-ta|-tb|-tp|-tc|-ti|-tl|-ts>} [B<Rpmbuild-Optionen>] I<TARBALL>I< …>

source: Each of the files in the colon separated I<FILELIST> is read sequentially by B<rpm> for configuration information. Only the first file in the list must exist, and tildes will be expanded to the value of B<$HOME>. The default I<FILELIST> is I</usr/lib/rpm/rpmrc>:I</usr/lib/rpm/redhat/rpmrc>:I</etc/rpmrc>:I<~/.rpmrc>.
de: lässt B<rpm> die Dateien in der durch Doppelpunkte getrennten I<DATEILISTE> nacheinander einlesen, um Konfigurationsinformationen zu erhalten. Nur die erste Datei in der Liste muss existieren; die Tilde wird dabei zum Wert der Umgebungsvariable B<$HOME> expandiert. Die vorgegebene I<DATEILISTE> ist I</usr/lib/rpm/rpmrc>:I</usr/lib/rpm/redhat/rpmrc>:I</etc/rpmrc>:I<~/.rpmrc>.

source: B<rpmbuild> B<-b>I<STAGE>B<|-r>I<STAGE>B<|-t>I<STAGE> [ B< rpmbuild-options >] I<FILE>I< ...>
de: B<rpmbuild> B<-b>I<PHASE>B<|-r>I<PHASE>B<|-t>I<PHASE> [ B< Rpmbuild-Optionen >] I<DATEI>I< …>

source: The argument used is B<-b> if a spec file is being used to build the package, B<-r> if a source package is to be rebuild and B<-t> if B<rpmbuild> should look inside of a (possibly compressed) tar file for the spec file to use. After the first argument, the next character (I<STAGE>) specifies the stages of building and packaging to be done and is one of:
de: Das verwendete Argument ist B<-b>, falls eine Spec-Datei zum Bauen des Pakets eingesetzt wird, B<-r>, wenn ein Quellpaket erneut gebaut werden soll und B<-t>, falls B<rpmbuild> in einer (gegebenenfalls komprimierten) Tar-Datei nach der zu verwendenden Spec-Datei suchen soll. Nach dem ersten Argument gibt das nächste Zeichen (I<PHASE>) die auszuführenden Phasen des Baus und der Paketierung an. Folgende Phasen sind möglich:

source: Build binary and source packages (after doing the %prep, %build, and %install stages).
de: baut sowohl Binär- als auch Quellpakete (nachdem die Phasen B<%prep>, B<%build> und B<%install> ausgeführt wurden).

source: Build a binary package (after doing the %prep, %build, and %install stages).
de: baut ein Binärpaket (nachdem die Phasen B<%prep>, B<%build> und B<%install> ausgeführt wurden).

source: Executes the "%prep" stage from the spec file. Normally this involves unpacking the sources and applying any patches.
de: führt die Phase B<%prep> aus der angegebenen Spec-Datei aus. Normalerweise beinhaltet diese das Entpacken der Quellen und das Anwenden aller Patches, sofern vorhanden.

source: Do the "%build" stage from the spec file (after doing the %prep stage). This generally involves the equivalent of a "make".
de: führt die B<%build>-Phase in der Spec-Datei aus (nach dem Ausführen der B<%prep>-Phase). Dies beinhaltet im Allgemeinen einen Aufruf von B<make> oder etwas Gleichbedeutendem.

source: Do the "%install" stage from the spec file (after doing the %prep and %build stages). This generally involves the equivalent of a "make install".
de: führt die B<%install>-Phase in der Spec-Datei aus (nach dem Ausführen der B<%prep>- und B<%build>-Phasen). Dies beinhaltet im Allgemeinen einen Aufruf von B<make install> oder etwas Gleichbedeutendem.

source: Do a "list check". The "%files" section from the spec file is macro expanded, and checks are made to verify that each file exists.
de: führt eine Listenüberprüfung aus. Der B<%files>-Abschnitt in der Spec-Datei wird Makro-expandiert und es wird überprüft, ob jede der angegebenen Dateien existiert.

source: Build just the source package.
de: baut nur das Quellpaket.

source: Do not generate debuginfo packages..
de: baut keine Debuginfo-Pakete.
