Repository: sebras/manpages-l10n
Catalog: po/*/man8/rpmkeys.8.po
Languages: de

source: 29 October 2010
de: 29. Oktober 2010

source: NAME
de: BEZEICHNUNG

source: rpmkeys - RPM Keyring
de: rpmkeys - RPM-Schlüsselbund

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: The general forms of rpm digital signature commands are
de: Die allgemeine Form der Digitalsignatur-Befehle für B<rpm> ist

source: B<rpmkeys> B<--import> I<PUBKEY>I< ...>
de: B<rpmkeys> B<--import> I<ÖFFENTLICHER_SCHLÜSSEL>I< …>

source: B<rpmkeys> {B<-K|--checksig>} I<PACKAGE_FILE>I< ...>
de: B<rpmkeys> {B<-K|--checksig>} I<PAKETDATEI>I< …>

source: The B<--checksig> option checks all the digests and signatures contained in I<PACKAGE_FILE> to ensure the integrity and origin of the package. Note that signatures are now verified whenever a package is read, and B<--checksig> is useful to verify all of the digests and signatures associated with a package.
de: Die Option B<--checksig> überprüft alle Prüfsummen und Signaturen in der angegebenen I<PAKETDATEI>, um die Integrität und die Herkunft des Pakets sicherzustellen. Beachten Sie, dass Signaturen nun immer dann überprüft werden, wenn ein Paket gelesen wird. B<--checksig> ist zum Überprüfen aller einem Paket zugeordneten Prüfsummen und Signaturen nützlich.

source: Digital signatures cannot be verified without a public key. An ASCII armored public key can be added to the B<rpm> database using B<--import>. An imported public key is carried in a header, and key ring management is performed exactly like package management. For example, all currently imported public keys can be displayed by:
de: Digitale Signaturen können ohne öffentlichen Schlüssel nicht überprüft werden. Ein öffentlicher, gepanzerter ASCII-Schlüssel kann mit der Option B<--import> zur Datenbank von B<rpm> hinzugefügt werden. Ein importierter öffentlicher Schlüssel wird in Kopfzeilen gespeichert; die Schlüsselbundverwaltung funktioniert exakt genauso wie die Paketverwaltung. Zum Beispiel können Sie alle gegenwärtig importierten öffentlichen Schlüssel folgendermaßen anzeigen:

source: Details about a specific public key, when imported, can be displayed by querying. Here's information about the Red Hat GPG/DSA key:
de: Details zu einem bestimmten öffentlichen Schlüssel, der importiert wurde, können durch eine Abfrage angezeigt werden. Hier werden die Informationen zum GPG/DSA-Schlüssel von Red Hat angezeigt:

source: Finally, public keys can be erased after importing just like packages. Here's how to remove the Red Hat GPG/DSA key
de: Schließlich können öffentliche Schlüssel nach dem Importieren genau wie Pakete gelöscht werden. So entfernen Sie den GPG/DSA-Schlüssel von Red Hat:

source: SEE ALSO
de: SIEHE AUCH

source: B<rpmkeys --help> - as rpm supports customizing the options via popt aliases it's impossible to guarantee that what's described in the manual matches what's available.
de: B<rpmkeys --help> - da B<rpm> benutzerdefinierte Optionen über Popt-Aliase unterstützt, können wir unmöglich garantieren, dass die Beschreibungen in diesem Handbuch exakt dem entsprechen, was verfügbar ist.

source: AUTHORS
de: AUTOREN
