Repository: sebras/manpages-l10n
Catalog: po/*/man8/rtcwake.8.po
Languages: uk

source: System Administration
uk: Керування системою

source: NAME
uk: НАЗВА

source: rtcwake - enter a system sleep state until specified wakeup time
uk: rtcwake — перевести систему до стану присипляння до вказаного часу пробудження.

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<rtcwake> [options] [B<-d> I<device>] [B<-m> I<standby_mode>] {B<-s> I<seconds>|B<-t> I<time_t>}
uk: B<rtcwake> [параметр] [B<-d> I<пристрій>] [B<-m> I<режим_резервування>] {B<-s> I<секунди>|B<-t> I<час_t>}

source: DESCRIPTION
uk: ОПИС

source: This program is used to enter a system sleep state and to automatically wake from it at a specified time.
uk: Цією програмою користуються для введення системи до стану сну і автоматичного пробудження зі стану сну у вказаним момент часу.

source: This uses cross-platform Linux interfaces to enter a system sleep state, and leave it no later than a specified time. It uses any RTC framework driver that supports standard driver model wakeup flags.
uk: Ця програма використовує багатоплатформові інтерфейси Linux для введення системи у стан сну і полишення цього стану не пізніше вказаного часу. Вона використовує якийсь драйвер комплексу годинника реального часу, у якому передбачено підтримку прапорців моделі пробудження стандартного драйвера.

source: This is normally used like the old B<apmsleep> utility, to wake from a suspend state like ACPI S1 (standby) or S3 (suspend-to-RAM). Most platforms can implement those without analogues of BIOS, APM, or ACPI.
uk: Цю програму, зазвичай, використовують як застарілу програму B<apmsleep> для пробудження зі стану присипляння, подібного до ACPI S1 (очікування) або S3 (присипляння до оперативної пам'яті). Більшість платформ можуть реалізувати ці стани без аналогів BIOS, APM або ACPI.

source: On some systems, this can also be used like B<nvram-wakeup>, waking from states like ACPI S4 (suspend to disk). Not all systems have persistent media that are appropriate for such suspend modes.
uk: У деяких системах програмою також можна скористатися подібно до B<nvram-wakeup>, пробуджуючи зі станів, подібних до ACPI S4 (присипляння на диск). Постійні носії даних для таких режимів присипляння є не в усіх системах.

source: Note that alarm functionality depends on hardware; not every RTC is able to setup an alarm up to 24 hours in the future.
uk: Зауважте, що функціональні можливості нагадування залежать від обладнання; не кожен годинник реального часу зданий налаштувати нагадування на більше ніж 24 години у майбутньому.

source: The suspend setup may be interrupted by active hardware; for example wireless USB input devices that continue to send events for some fraction of a second after the return key is pressed. B<rtcwake> tries to avoid this problem and it waits to the terminal to settle down before entering a system sleep.
uk: Налаштування присипляння може бути скасовано активним обладнанням. Наприклад, бездротові пристрої вхідних даних USB, які продовжують надсилати повідомлення про події протягом часток секунди після натискання клавіші Enter. B<rtcwake> намагається уникнути цієї проблеми і очікує на завершення дій у терміналі, перш ніж перевести систему у стан сну.

source: OPTIONS
uk: ПАРАМЕТРИ

source: B<-A>, B<--adjfile> I<file>
uk: B<-A>, B<--adjfile> I<файл>

source: Specify an alternative path to the adjust file.
uk: Вказати альтернативний шлях до файла коригувань.

source: Read the clock mode (whether the hardware clock is set to UTC or local time) from the I<adjtime> file, where B<hwclock>(8) stores that information. This is the default.
uk: Прочитати режим годинника (те, для апаратного годинника встановлено всесвітній час чи місцевий час) з файла I<adjtime>, де B<hwclock>(8) зберігає ці дані. Це типова поведінка.

source: B<--date> I<timestamp>
uk: B<--date> I<часова-позначка>

source: Set the wakeup time to the value of the timestamp. Format of the timestamp can be any of the following:
uk: Встановити для часу пробудження значення часової позначки. Формат часової позначки може бути будь-яким з таких:

source: YYYYMMDDhhmmss
uk: РРРРММДДггххсс

source: YYYY-MM-DD hh:mm:ss
uk: РРРР-ММ-ДД гг:хх:сс

source: YYYY-MM-DD hh:mm
uk: РРРР-ММ-ДД гг:хх

source: (seconds will be set to 00)
uk: (для секунд буде встановлено 00)

source: YYYY-MM-DD
uk: РРРР-ММ-ДД

source: (time will be set to 00:00:00)
uk: (для часу буде використано 00:00:00)

source: hh:mm:ss
uk: гг:хх:сс

source: (date will be set to today)
uk: (для дати буде використано сьогоднішню)

source: hh:mm
uk: гг:хх

source: (date will be set to today, seconds to 00)
uk: (для дати буде використано сьогоднішню, а для секунд 00)

source: (time is set to 00:00:00)
uk: (для часу буде використано 00:00:00)

source: B<-d>, B<--device> I<device>
uk: B<-d>, B<--device> I<пристрій>

source: Use the specified I<device> instead of B<rtc0> as realtime clock. This option is only relevant if your system has more than one RTC. You may specify B<rtc1>, B<rtc2>, ... here.
uk: Використати вказаний I<пристрій> замість B<rtc0>, як годинник реального часу. Цей параметр має значення, якщо у вашій системі є декілька годинників реального часу. Ви можете вказати в аргументі B<rtc1>, B<rtc2>...

source: Assume that the hardware clock is set to local time, regardless of the contents of the I<adjtime> file.
uk: Припустімо, що для апаратного годинника встановлено місцевий час, незалежно від вмісту файла I<adjtime>.

source: List available B<--mode> option arguments.
uk: Вивести список доступних аргументів параметра B<--mode>.

source: B<-m>, B<--mode> I<mode>
uk: B<-m>, B<--mode> I<режим>

source: Go into the given standby state. Valid values for I<mode> are:
uk: Перейти у вказаний стан очікування. Коректними значенням аргументу I<режим> є такі:

source: ACPI state S1. This state offers minimal, though real, power savings, while providing a very low-latency transition back to a working system. This is the default mode.
uk: Стан S1 ACPI. Цей стан реалізує мінімальне, хоча і реальне, заощадження електроенергії, забезпечуючи перехід до працездатної системи із дуже малим часом очікування. Це типовий режим.

source: The processes are frozen, all the devices are suspended and all the processors idled. This state is a general state that does not need any platform-specific support, but it saves less power than Suspend-to-RAM, because the system is still in a running state. (Available since Linux 3.9.)
uk: Процеси буде заморожено, усі пристрої буде приспано, а усі процесори переведено у стан бездіяльності. Цей стан є загальним станом, який не потребує будь-якої підтримки з боку платформи, але заощаджує менше електроенергії, ніж режим присипляння до оперативної пам'яті, оскільки система залишається у стані роботи. (Доступний з Linux 3.9.)

source: ACPI state S3 (Suspend-to-RAM). This state offers significant power savings as everything in the system is put into a low-power state, except for memory, which is placed in self-refresh mode to retain its contents.
uk: Стан S3 ACPI (присипляння до оперативної пам'яті). У цьому стані заощадження електроенергії є значним, оскільки усе у системі, окрім пам'яті, яку буде переведено у режим самооновлення для зберігання свого вмісту, буде переведено у режим низького споживання енергії.

source: ACPI state S4 (Suspend-to-disk). This state offers the greatest power savings, and can be used even in the absence of low-level platform support for power management. This state operates similarly to Suspend-to-RAM, but includes a final step of writing memory contents to disk.
uk: Стан S4 ACPI (присипляння на диск). У цьому стані заощадження електроенергії є найбільшим, ним можна скористатися, навіть якщо немає низькорівневої підтримки керування живленням. Цей стан працює подібно до присипляння до оперативної пам'яті, але включає останній крок із запису вмісту пам'яті на диск.

source: ACPI state S5 (Poweroff). This is done by calling \(aq/sbin/shutdown\(aq. Not officially supported by ACPI, but it usually works.
uk: Стан S5 ACPI (вимикання). Виконання відбувається шляхом виклику «/sbin/shutdown». Офіційної підтримки з боку ACPI не передбачено, але, зазвичай, працює.

source: Don\(cqt suspend, only set the RTC wakeup time.
uk: Не присипляти, лише встановити час пробудження за годинником реального часу.

source: Don\(cqt suspend, but read the RTC device until an alarm time appears. This mode is useful for debugging.
uk: Не присипляти, але виконувати читання з пристрою годинника реального часу, аж доки не настане момент нагадування. Цей режим корисний для діагностики.

source: Disable a previously set alarm.
uk: Вимкнути раніше встановлене нагадування.

source: Print alarm information in format: "alarm: off|on E<lt>timeE<gt>". The time is in ctime() output format, e.g., "alarm: on Tue Nov 16 04:48:45 2010".
uk: Вивести дані нагадування у такому форматі: «alarm: off|on E<lt>часE<gt>». Час буде виведено у форматі ctime(). Приклад: «alarm: on Tue Nov 16 04:48:45 2010».

source: This option does everything apart from actually setting up the alarm, suspending the system, or waiting for the alarm.
uk: Використання цього параметра призводить до виконання програмою усіх дій, окрім самого встановлення нагадування, присипляння системи або очікування на нагадування.

source: B<-s>, B<--seconds> I<seconds>
uk: B<-s>, B<--seconds> I<секунди>

source: Set the wakeup time to I<seconds> in the future from now.
uk: Встановити час пробудження у I<секундах> у майбутньому, починаючи з поточного моменту.

source: B<-t>, B<--time> I<time_t>
uk: B<-t>, B<--time> I<час_t>

source: Set the wakeup time to the absolute time I<time_t>. I<time_t> is the time in seconds since 1970-01-01, 00:00 UTC. Use the B<date>(1) tool to convert between human-readable time and I<time_t>.
uk: Встановити час пробудження у форматі абсолютного часу I<час_t>. I<час_t> є часом у секундах з моменту 1970-01-01, 00:00 UTC. Скористайтеся програмою B<date>(1) для перетворення між зручним для читання часом та I<час_t>.

source: Assume that the hardware clock is set to UTC (Universal Time Coordinated), regardless of the contents of the I<adjtime> file.
uk: Припустімо, що для апаратного годинника встановлено UTC (універсальний координований час), незалежно від вмісту файла I<adjtime>.

source: Be verbose.
uk: Режим докладних повідомлень.

source: Display help text and exit.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: NOTES
uk: ПРИМІТКИ

source: Some PC systems can\(cqt currently exit sleep states such as B<mem> using only the kernel code accessed by this driver. They need help from userspace code to make the framebuffer work again.
uk: На сьогодні, деякі системи персональних комп'ютерів не можуть вийти зі станів сну, зокрема B<mem>, використовуючи лише код ядра, доступ до якого отримує цей драйвер. Їм потрібна допомога з боку коду простору користувача, щоб уможливити подальшу роботу буфера кадрів.

source: FILES
uk: ФАЙЛИ

source: HISTORY
uk: ЖУРНАЛ

source: The program was posted several times on LKML and other lists before appearing in kernel commit message for Linux 2.6 in the GIT commit 87ac84f42a7a580d0dd72ae31d6a5eb4bfe04c6d.
uk: Допис із цією програмою було декілька разів розміщено у LKML та інших списках листування, перш ніж вона з'явилася у ядрі Linux 2.6 шляхом запровадження внеску GIT 87ac84f42a7a580d0dd72ae31d6a5eb4bfe04c6d.

source: AUTHORS
uk: АВТОРИ

source: The program was written by
uk: Програму було створено

source: and improved by
uk: та удосконалено

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: This is free software. You may redistribute copies of it under the terms of the
uk: Це вільне програмне забезпечення. Ви можете поширювати його копії за умов дотримання

source: There is NO WARRANTY, to the extent permitted by law.
uk: Не надається НІЯКИХ ГАРАНТІЙ у межах, передбачених законом.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
uk: ДОСТУПНІСТЬ

source: The B<rtcwake> command is part of the util-linux package which can be downloaded from
uk: B<rtcwake> є частиною пакунка util-linux, який можна отримати з

source: June 2015
uk: Червень 2015 року

source: B<rtcwake> [options] [B<-d> I<device>] [B<-m> I<standby_mode>] {B<-s >I<seconds>|B<-t >I<time_t>}
uk: B<rtcwake> [параметр] [B<-d> I<пристрій>] [B<-m> I<режим_резервування>] {B<-s> I<секунди>|B<-t> I<час_t>}

source: This uses cross-platform Linux interfaces to enter a system sleep state, and leave it no later than a specified time. It uses any RTC framework driver that supports standard driver model wakeup flags.
uk: Ця програма використовує багатоплатформові інтерфейси Linux для введення системи у стан сну і полишення цього стану не пізніше вказаного часу. Вона використовує якийсь драйвер комплексу годинника реального часу, у якому передбачено підтримку прапорців моделі пробудження стандартного драйвера.

source: This is normally used like the old B<apmsleep> utility, to wake from a suspend state like ACPI S1 (standby) or S3 (suspend-to-RAM). Most platforms can implement those without analogues of BIOS, APM, or ACPI.
uk: Цю програму, зазвичай, використовують як застарілу програму B<apmsleep> для пробудження зі стану присипляння, подібного до ACPI S1 (очікування) або S3 (присипляння до оперативної пам'яті). Більшість платформ можуть реалізувати ці стани без аналогів BIOS, APM або ACPI.

source: On some systems, this can also be used like B<nvram-wakeup>, waking from states like ACPI S4 (suspend to disk). Not all systems have persistent media that are appropriate for such suspend modes.
uk: У деяких системах програмою також можна скористатися подібно до B<nvram-wakeup>, пробуджуючи зі станів, подібних до ACPI S4 (присипляння на диск). Постійні носії даних для таких режимів присипляння є не в усіх системах.

source: The suspend setup may be interrupted by active hardware; for example wireless USB input devices that continue to send events for some fraction of a second after the return key is pressed. B<rtcwake> tries to avoid this problem and it waits to terminal to settle down before entering a system sleep.
uk: Налаштування присипляння може бути скасовано активним обладнанням. Наприклад, бездротові пристрої вхідних даних USB, які продовжують надсилати повідомлення про події протягом часток секунди після натискання клавіші Enter. B<rtcwake> намагається уникнути цієї проблеми і очікує на завершення дій у терміналі, перш ніж перевести систему у стан сну.

source: B<-A>,B< --adjfile >I<file>
uk: B<-A>, B<--adjfile> I<файл>

source: Read the clock mode (whether the hardware clock is set to UTC or local time) from the I<adjtime> file, where B<hwclock>(8) stores that information. This is the default.
uk: Прочитати режим годинника (те, для апаратного годинника встановлено всесвітній час чи місцевий час) з файла I<adjtime>, де B<hwclock>(8) зберігає ці дані. Це типова поведінка.

source: Set the wakeup time to the value of the timestamp. Format of the timestamp can be any of the following:
uk: Встановити для часу пробудження значення часової позначки. Формат часової позначки може бути будь-яким з таких:

source: B<-d>,B< --device >I<device>
uk: B<-d>, B<--device> I<пристрій>

source: Use the specified I<device> instead of B<rtc0> as realtime clock. This option is only relevant if your system has more than one RTC. You may specify B<rtc1>, B<rtc2>, ... here.
uk: Використати вказаний I<пристрій> замість B<rtc0>, як годинник реального часу. Цей параметр має значення, якщо у вашій системі є декілька годинників реального часу. Ви можете вказати в аргументі B<rtc1>, B<rtc2>...

source: List available --mode option arguments.
uk: Вивести список доступних аргументів параметра B<--mode>.

source: B<-m>,B< --mode >I<mode>
uk: B<-m>, B<--mode> I<режим>

source: Go into the given standby state. Valid values for I<mode> are:
uk: Перейти у вказаний стан очікування. Коректними значенням аргументу I<режим> є такі:

source: ACPI state S1. This state offers minimal, though real, power savings, while providing a very low-latency transition back to a working system. This is the default mode.
uk: Стан S1 ACPI. Цей стан реалізує мінімальне, хоча і реальне, заощадження електроенергії, забезпечуючи перехід до працездатної системи із дуже малим часом очікування. Це типовий режим.

source: The processes are frozen, all the devices are suspended and all the processors idled. This state is a general state that does not need any platform-specific support, but it saves less power than Suspend-to-RAM, because the system is still in a running state. (Available since Linux 3.9.)
uk: Процеси буде заморожено, усі пристрої буде приспано, а усі процесори переведено у стан бездіяльності. Цей стан є загальним станом, який не потребує будь-якої підтримки з боку платформи, але заощаджує менше електроенергії, ніж режим присипляння до оперативної пам'яті, оскільки система залишається у стані роботи. (Доступний з Linux 3.9.)

source: ACPI state S3 (Suspend-to-RAM). This state offers significant power savings as everything in the system is put into a low-power state, except for memory, which is placed in self-refresh mode to retain its contents.
uk: Стан S3 ACPI (присипляння до оперативної пам'яті). У цьому стані заощадження електроенергії є значним, оскільки усе у системі, окрім пам'яті, яку буде переведено у режим самооновлення для зберігання свого вмісту, буде переведено у режим низького споживання енергії.

source: ACPI state S4 (Suspend-to-disk). This state offers the greatest power savings, and can be used even in the absence of low-level platform support for power management. This state operates similarly to Suspend-to-RAM, but includes a final step of writing memory contents to disk.
uk: Стан S4 ACPI (присипляння на диск). У цьому стані заощадження електроенергії є найбільшим, ним можна скористатися, навіть якщо немає низькорівневої підтримки керування живленням. Цей стан працює подібно до присипляння до оперативної пам'яті, але включає останній крок із запису вмісту пам'яті на диск.

source: ACPI state S5 (Poweroff). This is done by calling '/sbin/shutdown'. Not officially supported by ACPI, but it usually works.
uk: Стан S5 ACPI (вимикання). Виконання відбувається шляхом виклику «/sbin/shutdown». Офіційної підтримки з боку ACPI не передбачено, але, зазвичай, працює.

source: Don't suspend, only set the RTC wakeup time.
uk: Не присипляти, лише встановити час пробудження за годинником реального часу.

source: Don't suspend, but read the RTC device until an alarm time appears. This mode is useful for debugging.
uk: Не присипляти, але виконувати читання з пристрою годинника реального часу, аж доки не настане момент нагадування. Цей режим корисний для діагностики.

source: Print alarm information in format: "alarm: off|on E<lt>timeE<gt>". The time is in ctime() output format, e.g., "alarm: on Tue Nov 16 04:48:45 2010".
uk: Вивести дані нагадування у такому форматі: «alarm: off|on E<lt>часE<gt>». Час буде виведено у форматі ctime(). Приклад: «alarm: on Tue Nov 16 04:48:45 2010».

source: B<-s>,B< --seconds >I<seconds>
uk: B<-s>, B<--seconds> I<секунди>

source: B<-t>,B< --time >I<time_t>
uk: B<-t>, B<--time> I<час_t>

source: Set the wakeup time to the absolute time I<time_t>. I<time_t> is the time in seconds since 1970-01-01, 00:00 UTC. Use the B<date>(1) tool to convert between human-readable time and I<time_t>.
uk: Встановити час пробудження у форматі абсолютного часу I<час_t>. I<час_t> є часом у секундах з моменту 1970-01-01, 00:00 UTC. Скористайтеся програмою B<date>(1) для перетворення між зручним для читання часом та I<час_t>.

source: Display version information and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: Some PC systems can't currently exit sleep states such as B<mem> using only the kernel code accessed by this driver. They need help from userspace code to make the framebuffer work again.
uk: На сьогодні, деякі системи персональних комп'ютерів не можуть вийти зі станів сну, зокрема B<mem>, використовуючи лише код ядра, доступ до якого отримує цей драйвер. Їм потрібна допомога з боку коду простору користувача, щоб уможливити подальшу роботу буфера кадрів.

source: The program was written by David Brownell E<lt>dbrownell@users.sourceforge.netE<gt> and improved by Bernhard Walle E<lt>bwalle@suse.deE<gt>.
uk: Програму було написано David Brownell E<lt>dbrownell@users.sourceforge.netE<gt> і удосконалено Bernhard Walle E<lt>bwalle@suse.deE<gt>.

source: This is free software. You may redistribute copies of it under the terms of the GNU General Public License E<lt>http://www.gnu.org/licenses/gpl.htmlE<gt>. There is NO WARRANTY, to the extent permitted by law.
uk: Це вільне програмне забезпечення. Ви можете поширювати його копії за умов дотримання Загальної громадської ліцензії GNU E<lt>http://www.gnu.org/licenses/gpl.htmlE<gt>. Щодо користування ним не надається ЖОДНИХ ГАРАНТІЙ, окрім передбачених законодавством.

source: The rtcwake command is part of the util-linux package and is available from the E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
uk: Програма rtcwake є частиною пакунка util-linux і доступна з E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>

source: The suspend setup may be interrupted by active hardware; for example wireless USB input devices that continue to send events for some fraction of a second after the return key is pressed. B<rtcwake> tries to avoid this problem and it waits to terminal to settle down before entering a system sleep.
uk: Налаштування присипляння може бути скасовано активним обладнанням. Наприклад, бездротові пристрої вхідних даних USB, які продовжують надсилати повідомлення про події протягом часток секунди після натискання клавіші Enter. B<rtcwake> намагається уникнути цієї проблеми і очікує на завершення дій у терміналі, перш ніж перевести систему у стан сну.
