Repository: sebras/manpages-l10n
Catalog: po/*/man8/saned.8.po
Languages: de

source: The B<-d> flag sets the level of B<saned> debug output. When compiled with debugging enabled, this flag may be followed by a number to request more or less debug info. The larger the number, the more verbose the debug output. E.g., B<-d128> will request output of all debug info. A level of 0 produces no output at all. The default value is 2.
de: Der Schalter B<-d> setzt die Debug-Ausgabe-Stufe von B<saned>. Erfolgte die Kompilierung mit aktiviertem Debugging, dann kann diesem Schalter eine Zahl folgen, die mehr oder weniger Debug-Informationen anfordert. Je größer die Zahl, desto ausführlicher die Debug-Ausgabe. Z.B. wird B<-d128> sämtliche Debug-Informationen erbitten. Die Stufe 0 erzeugt überhaupt keine Ausgabe. Der Vorgabewert ist 2.

source: The B<-e> flag will divert B<saned> debug output to stderr instead of the syslog default.
de: Der Schalter B<-e> leitet die Debug-Ausgabe von B<saned> in die Standardfehlerausgabe, statt in die Vorgabe Syslog.

source: The B<-o> flag requests that B<saned> exits after the first client disconnects. This is useful for debugging.
de: Der Schalter B<-o> fordert, dass B<saned> sich beendet, nachdem der erste Client sich beendet. Dies ist für das Debugging hilfreich.

source: The B<-h> flag displays a short help message.
de: Der Schalter B<-h> zeigt eine kurze Hilfemeldung.

source: If B<saned> is run from other programs such as inetd, xinetd and systemd, check that program's documentation on how to pass command-line options.
de: Falls B<saned> von anderen Programmen wie Inetd, Xinetd und Systemd ausgeführt wird, dann lesen Sie bitte die Dokumentation der jeweiligen Programme, wie Befehlszeilenoptionen übergeben werden.

source: Specify the time in milliseconds that saned will wait for a data connection. Without this option, if the data connection is not done before the scanner reaches the end of scan, the scanner will continue to scan past the end and may damage it depending on the backend. Specify zero to have the old behavior. The default is 4000ms.
de: gibt die Zeit in Millisekunden an, die Saned auf eine Datenverbindung warten wird. Ohne diese Option wird der Scanner über das Ende hinaus scannen und könnte, abhängig vom Backend, den Scanner beschädigen, falls die Datenverbindung noch nicht aufgebaut ist, bevor der Scanner das Ende des Scans erreicht hat. Geben Sie Null an, um das alte Verhalten zu erreichen. Die Vorgabe ist 4000ms.

source: For B<saned> to work properly in its default mode of operation, it is also necessary to add the appropriate configuration for I<(x)inetd or systemd.> (see below). Note that your inetd must support IPv6 if you want to connect to saned over IPv6 ; xinetd, openbsd-inetd and systemd are known to support IPv6, check the documentation for your inetd daemon.
de: Damit B<saned> in seinem Standardbetriebsmodus korrekt funktioniert, ist es auch notwendig, die geeignete Konfiguration zu B<(x)inetd> oder B<systemd> hinzuzufügen (siehe unten). Beachten Sie, dass Ihr Inetd IPv6 unterstützen muss, falls Sie Saned über IPv6 anbinden wollen. Xinetd, Openbsd-inetd und Systemd unterstützen bekanntermaßen IPv6, prüfen Sie die Dokumentation Ihres Inetd-Daemons.

source: In the sections below the configuration for I<inetd, xinetd> and I<systemd> are described in more detail.
de: In den nachfolgenden Abschnitten wird die Konfiguration für B<inetd>, B<xinetd> und B<systemd> detaillierter beschrieben.

source: It is required to add a single line to the inetd configuration file I<(/etc/inetd.conf)>
de: Es ist notwendig, eine einzige Zeile zu der Konfigurationsdatei des Inetd I<(/etc/inetd.conf)> hinzuzufügen.

source: However, if your system uses B<tcpd>(8) for additional security screening, you may want to disable saned access control by putting ``+'' in I<saned.conf> and use a line of the following form in I</etc/inetd.conf> instead:
de: Falls Ihr System allerdings B<tcpd>(8) für zusätzliche Sicherheitsüberwachung verwendet, können Sie die Zugriffssteuerung von Saned deaktivieren, indem Sie ein »+« in I<saned.conf> packen und stattdessen eine Zeile der folgenden Form in I</etc/inetd.conf> verwenden:

source: If xinetd is installed on your system instead of inetd the following example for I</etc/xinetd.conf> may be helpful:
de: Falls Xined statt Inetd auf Ihrem System installiert ist, könnte das folgende Beispiel für I</etc/xinetd.conf> hilfreich sein:

source: \f(CR# default: off # description: The sane server accepts requests # for network access to a local scanner via the # network. service sane-port { port = 6566 socket_type = stream wait = no user = saned group = saned server = /usr/sbin/saned }\fR
de: \f(CR# default: off # description: Der Sane-Server akzeptiert Anfragen # auf Netzwerkzugriff auf einen lokalen Scanner mittels des # Netzwerks. service sane-port { port = 6566 socket_type = stream wait = no user = saned group = saned server = /usr/sbin/saned }\fR

source: Saned can be compiled with explicit systemd support. This will allow logging debugging information to be forwarded to the systemd journal. The systemd support requires compilation with the systemd-devel package installed on the system. this is the preferred option.
de: B<saned> kann mit expliziter Unterstützung für B<systemd>(1) kompiliert werden. Dies ermöglicht die Protokollierung von Debugging-Informationen und deren Speicherung im Journal von Systemd. Die Systemd-Unterstützung erfordert die Kompilierung mit dem I<systemd-devel>-Paket, das auf dem System installiert ist. Dies ist die bevorzugte Option.

source: Saned can be used with systemd without the systemd integration compiled in, but then logging of debug information is not supported.
de: Saned kann mit Systemd verwendet werden, ohne dass die Systemd-Unterstützung einkompiliert ist, allerdings wird dann die Protokollierung von Debug-Informationen nicht unterstützt.

source: The systemd configuration is different for the 2 options, so both are described below.
de: Die Systemd-Konfiguration ist für die beiden Optionen verschieden, daher werden beide nachfolgend beschrieben.

source: for the systemd configuration we need to add 2 configuration files in I</etc/systemd/system.>
de: Für die Systemd-Konfiguration müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: You need to set an environment variable for B<SANE_CONFIG_DIR> pointing to the directory where saned can find its configuration files. you will have to remove the # on the last line and set the variables for the desired debugging information if required. Multiple variables can be set by separating the assignments by spaces as shown in the example above.
de: Sie müssen eine Umgebungsvariable für B<SANE_CONFIG_DIR> setzen, die auf das Verzeichnis zeigt, in dem Saned seine Konfigurationsdateien finden kann. Sie werden das »#« auf der letzten Zeile entfernen müssen und die Variablen für die gewünschten Debugging-Informationen setzen müssen, falls benötigt. Sie können mehrere Variablen setzen, indem Sie die Zuweisungen durch Leerzeichen trennen, wie das im obigen Beispiel gezeigt ist.

source: Unlike I<(x)inetd> , systemd allows debugging output from backends set using B<SANE_DEBUG_XXX> to be captured. See the man-page for your backend to see what options are supported. With the service unit as described above, the debugging output is forwarded to the system log.
de: Anders als bei I<(x)inetd> erlaubt Systemd das Mitschneiden der Fehlersuchausgabe von Backends, die mittels B<SANE_DEBUG_XXX> gesetzt wurde. Lesen Sie die Handbuchseite für Ihr Backend, um zu sehen, welche Optionen unterstützt werden. Mit der oben dargestellten Dienste-Unit wird die Debugging-Ausgabe an das Systemprotokoll weitergeleitet.

source: This configuration will also work when Saned is compiled WITH systemd integration support, but it does not allow debugging information to be logged.
de: Diese Konfigurationsdatei funktioniert auch, wenn Saned MIT Systemd-Integrationsunterstützung kompiliert wurde, aber sie erlaubt nicht das Protokollieren der Debugging-Informationen.

source: for systemd configuration for saned, we need to add 2 configuration files in I</etc/systemd/system.>
de: Für die Systemd-Konfiguration für Saned müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: The first file we need to add here is called I<saned.socket.> It is identical to the version for systemd with the support compiled in. It shall have the following contents:
de: Die erste Datei, die hier hinzugefügt werden muss, heißt I<saned.socket>. Sie ist identisch zu der Version für Systemd mit einkompilierter Unterstützung. Sie muss den folgenden Inhalt haben:

source: The second file to be added is I<saned@.service> This one differes from the sersion with systemd integration compiled in:
de: Die zweite Datei, die hinzugefügt werden muss, ist I<saned@.service>. Diese unterscheidet sich von der Version mit einkompilierter Systemd-Unterstützung.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: B<sane>(7), B<scanimage>(1), B<xscanimage>(1), B<xcam>(1), B<sane-dll>(5), B<sane-net>(5), B<sane-"backendname">(5)
de: B<sane>(7), B<scanimage>(1), B<xscanimage>(1), B<xcam>(1), B<sane-dll>(5), B<sane-net>(5), B<sane->I<backendname>(5)

source: The B<-l> flag requests that B<saned> run in standalone daemon mode. In this mode, B<saned> will listen for incoming client connections; B<inetd>(8) is not required for B<saned> operations in this mode. The B<-b> flag tells B<saned> to bind to the I<address> given. The B<-p> flags tells B<saned> to listen on the port given. A value of 0 tells B<saned> to pick an unused port. The default is the B<sane-port (6566).> The B<-u> flag requests that B<saned> drop root privileges and run as the user (and group) associated with I<username> after binding. The B<-D> flag will request B<saned> to detach from the console and run in the background. The flag B<-a> is equivalent to the combination of B<-l -B -u> I<username> options.
de: Der Schalter B<-l> fordert, dass B<saned> im Einzelbetrieb-Daemon-Modus läuft. In diesem Modus wird B<saned> auf eingehende Verbindungen warten; B<inetd>(8) ist für B<saned>-Aktionen in diesem Modus nicht notwendig. Der Schalter B<-b> weist B<saned> an, sich an die angegebene I<Adresse> zu binden. Der Schalter B<-p> weist B<saned> an, auf dem übergebenen Port auf Anfragen zu warten. Ein Wert von 0 weist B<saned> an, einen unbenutzten Port auszuwählen. Die Vorgabe ist B<sane-port (6566)>. Der Schalter B<-u> fordert, dass B<saned> die Root-Privilegien abgibt und nach dem Anbinden als der normaler Benutzer (und Gruppe) läuft, die I<Benutzername> zugeordnet ist. Der Schalter B<-D> fordert, dass B<saned> von der Konsole abkoppelt und im Hintergrund läuft. Der Schalter B<-a> ist äquivalent zu der Kombination der Optionen B<-l -B -u> I<Benutzername>.

source: B<saned> can be compiled with explicit B<systemd>(1)B<support.>This will allow logging debugging information to be forwarded to the B<systemd>(1) journal. The B<systemd>(1) support requires compilation with the systemd-devel package installed on the system. this is the preferred option.
de: B<saned> kann mit expliziter Unterstützung für B<systemd>(1) kompiliert werden. Dies ermöglicht die Protokollierung von Debugging-Informationen und deren Speicherung im Journal von B<systemd>(1). Die B<systemd>(1)-Unterstützung erfordert die Kompilierung mit auf dem System installiertem I<systemd-devel>-Paket. Dies ist die bevorzugte Option.

source: For B<systemd>(1) configuration we need to add 2 configuration files in I</etc/systemd/system.>
de: Für die B<systemd>(1)-Konfiguration müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: You need to set an environment variable for B<SANE_CONFIG_DIR> pointing to the directory where B<saned> can find its configuration files. you will have to remove the # on the last line and set the variables for the desired debugging information if required. Multiple variables can be set by separating the assignments by spaces as shown in the example above.
de: Sie müssen eine Umgebungsvariable für B<SANE_CONFIG_DIR> setzen, die auf das Verzeichnis zeigt, in dem B<saned> seine Konfigurationsdateien finden kann. Sie werden das »#« auf der letzten Zeile entfernen müssen und die Variablen für die gewünschten Debugging-Informationen setzen müssen, falls benötigt. Sie können mehrere Variablen setzen, indem Sie die Zuweisungen durch Leerzeichen trennen, wie das im obigen Beispiel gezeigt ist.

source: This configuration will also work when B<saned> is compiled WITH B<systemd>(1)B<integration>support,B<but>itB<does>notB<allow>debugging information to be logged.
de: Diese Konfigurationsdatei funktioniert auch, wenn B<saned> MIT B<systemd>(1)-Integrationsunterstützung kompiliert wurde, aber sie erlaubt nicht das Protokollieren der Debugging-Informationen.

source: For B<systemd>(1) configuration for B<saned>, we need to add 2 configuration files in I</etc/systemd/system.>
de: Für die B<systemd>(1)-Konfiguration für B<saned> müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: The second file to be added is I<saned@.service> This one differs from the version with B<systemd>(1) integration compiled in:
de: Die zweite Datei, die hinzugefügt werden muss, ist I<saned@.service>. Diese unterscheidet sich von der Version mit einkompilierter B<systemd>(1)-Unterstützung.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).
