Repository: sebras/manpages-l10n
Catalog: po/*/man8/saned.8.po
Languages: de

source: 29 Sep 2017
de: 29. September 2017

source: NAME
de: BEZEICHNUNG

source: saned - SANE network daemon
de: saned - SANE-Netzwerkdaemon

source: SYNOPSIS
de: ÜBERSICHT

source: B<saned> B<[ -a> I<[ username ]> B<]> B<[ -u> I<username> B<]> B<[ -b> I<address> B<]> B<[ -p> I<port> B<]> B<[ -l ]> B<[ -D ]> B<[ -o ]> B<[ -d> I<n> B<]> B<[ -e ]> B<[ -h ]>
de: B<saned> B<[ -a> I<[ Benutzername ]> B<]> B<[ -u> I<Benutzername> B<]> B<[ -b> I<Adresse> B<]> B<[ -p> I<Port> B<]> B<[ -l ]> B<[ -D ]> B<[ -o ]> B<[ -d> I<n> B<]> B<[ -e ]> B<[ -h ]>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<saned> is the SANE (Scanner Access Now Easy) daemon that allows remote clients to access image acquisition devices available on the local host.
de: B<saned> ist der SANE- (Scanner Access Now Easy) Daemon, der fernen Clients den Zugriff auf die auf dem lokalen Rechner verfügbaren bildgebenden Geräte ermöglicht.

source: OPTIONS
de: OPTIONEN

source: B<saned> recognises the following options:
de: B<saned> akzeptiert die folgenden Optionen:

source: B<-a>I< [username]>, B<--alone>[=I<username]>
de: B<-a>I< [Benutzername]>, B<--alone>[=I<Benutzername]>

source: is equivalent to the combination of B<-l -D -u> I<username> options. However, I<username> is optional and running user will only be set when specified.
de: ist gleichbedeutend mit der Kombination der Optionen B<-l -D -u> I<Benutzername>. Jedoch ist der I<Benutzername> optional und der ausführende Benutzer wird nur gesetzt, wenn dieser angegeben ist.

source: B<-u>I< username>, B<--user>=I<username>
de: B<-u>I< Benutzer>, B<--user>=I<Benutzer>

source: requests that B<saned> drop root privileges and run as the user (and group) associated with I<username> after binding.
de: bewirkt, dass B<saned> die Root-Rechte abgibt und als der angegebene Benutzer (und dessen Gruppe) ausgeführt wird.

source: B<-b>I< address>, B<--bind>=I<address>
de: B<-b>I< Adresse>, B<--bind>=I<Adresse>

source: tells B<saned> to bind to the I<address> given.
de: weist B<saned> an, an die angegebene I<Adresse> zu binden.

source: tells B<saned> to listen on the I<port> given. A value of 0 tells B<saned> to pick an unused port. The default is the B<sane-port (6566).>
de: weist B<saned> an, an dem angegebenen I<Port> zu warten. Bei einem Wert von 0 wählt B<saned> einen ansonsten unbenutzten Port. Die Vorgabe ist B<sane-port> (6566).

source: requests that B<saned> run in standalone daemon mode. In this mode, B<saned> will listen for incoming client connections; B<inetd>(8) is not required for B<saned> operations in this mode.
de: führt B<saned> in einem eigenständigen Daemon-Modus aus. In diesem Modus wartet B<saned> auf eingehende Client-Verbindungen. Für Vorgänge in diesem Modus ist B<inetd>(8) nicht erforderlich.

source: will request B<saned> to detach from the console and run in the background.
de: koppelt B<saned> von der Konsole ab und führt es im Hintergrund aus.

source: requests that B<saned> exits after the first client disconnects. This is useful for debugging.
de: fordert, dass B<saned> sich beendet, nachdem der erste Client sich beendet. Dies ist für das Debugging hilfreich.

source: sets the level of B<saned> debug output to I<n>. When compiled with debugging enabled, this flag may be followed by a number to request more or less debug info. The larger the number, the more verbose the debug output. E.g., B<-d128> will request output of all debug info. A level of 0 produces no output at all. The default value is 2.
de: setzt die Debug-Ausgabe-Stufe von B<saned> auf I<n>. Erfolgte die Kompilierung mit aktiviertem Debugging, dann kann diesem Schalter eine Zahl folgen, die mehr oder weniger Debug-Informationen anfordert. Je größer die Zahl, desto ausführlicher die Debug-Ausgabe. Z.B. wird B<-d128> sämtliche Debug-Informationen erbitten. Die Stufe 0 erzeugt überhaupt keine Ausgabe. Der Vorgabewert ist 2.

source: will divert B<saned> debug output to stderr instead of the syslog default.
de: leitet die Debug-Ausgabe von B<saned> in die Standardfehlerausgabe, statt in die Vorgabe Syslog.

source: displays a short help message.
de: zeigt eine kurze Hilfemeldung.

source: If B<saned> is run from other programs such as B<inetd>(8), B<xinetd>(8) and B<systemd>(1), check that program's documentation on how to pass command-line options.
de: Falls B<saned> von anderen Programmen wie B<inetd>(8), B<xinetd>(8) und B<systemd>(1) ausgeführt wird, dann lesen Sie bitte die Dokumentation der jeweiligen Programme, wie Befehlszeilenoptionen übergeben werden.

source: CONFIGURATION
de: KONFIGURATION

source: First and foremost: B<saned> is not intended to be exposed to the internet or other non-trusted networks. Make sure that access is limited by tcpwrappers and/or a firewall setup. Don't depend only on B<saned>'s own authentication. Don't run B<saned> as root if it's not necessary. And do B<not> install B<saned> as setuid root.
de: Als aller erstes: B<saned> ist nicht dazu gedacht, ans Internet oder andere, nicht vertrauenswürdige Netzwerke angebunden zu werden. Stellen Sie sicher, dass der Zugriff durch tcpwrappers und/oder eine installierte Firewall begrenzt ist. Verlassen Sie sich nicht auf die Authentifizierung von B<saned> selbst. Führen Sie B<saned> nicht als root aus, außer es ist unbedingt notwendig. Und installieren Sie B<saned> B<nicht> setuid root.

source: The I<saned.conf> configuration file contains both options for the daemon and the access list.
de: Die Konfigurationsdatei I<saned.conf> enthält sowohl Optionen für den Daemon als auch die Zugriffsliste.

source: Specify the port range to use for the data connection. Pick a port range between 1024 and 65535; don't pick a too large port range, as it may have performance issues. Use this option if your B<saned> server is sitting behind a firewall. If that firewall is a Linux machine, we strongly recommend using the Netfilter I<nf_conntrack_sane> module instead.
de: gibt den für die Daten-Verbindung zu verwendenden Port-Bereich an. Wählen Sie einen Port-Bereich zwischen 1024 und 65535. Wählen Sie keinen zu großen Port-Bereich, da das zu Performance-Problemen führen kann. Verwenden Sie diese Option, falls Ihr B<saned>-Server hinter einer Firewall steht. Falls diese Firewall eine Linux-Maschine ist, empfehlen wir nachdrücklich stattdessen das Netfilter-Modul I<nf_conntrack_sane>.

source: B<data_connect_timeout> = I<timeout>
de: B<data_connect_timeout> = I<Zeitüberschreitung>

source: Specify the time in milliseconds that B<saned> will wait for a data connection. Without this option, if the data connection is not done before the scanner reaches the end of scan, the scanner will continue to scan past the end and may damage it depending on the backend. Specify zero to have the old behavior. The default is 4000ms.
de: gibt die Zeit in Millisekunden an, die B<saned> auf eine Datenverbindung warten wird. Ohne diese Option wird der Scanner über das Ende hinaus scannen und könnte, abhängig vom Backend, den Scanner beschädigen, falls die Datenverbindung noch nicht aufgebaut ist, bevor der Scanner das Ende des Scans erreicht hat. Geben Sie Null an, um das alte Verhalten zu erreichen. Die Vorgabe ist 4000ms.

source: The access list is a list of host names, IP addresses or IP subnets (CIDR notation) that are permitted to use local SANE devices. IPv6 addresses must be enclosed in brackets, and should always be specified in their compressed form. Connections from localhost are always permitted. Empty lines and lines starting with a hash mark (#) are ignored. A line containing the single character ``+'' is interpreted to match any hostname. This allows any remote machine to use your scanner and may present a security risk, so this shouldn't be used unless you know what you're doing.
de: Die Zugriffsliste besteht aus Rechnernamen, IP-Adressen oder IP-Subnetzen (CIDR-Notation), denen erlaubt wird, lokale SANE-Geräte zu verwenden. IPv6-Adressen müssen in Klammern eingeschlossen und sollten immer in ihrer komprimierten Form angegeben werden. Verbindungen von localhost sind immer erlaubt. Leere Zeilen und Zeilen, die mit einer Raute (»#«) beginnen, werden ignoriert. Eine Zeile, die als einziges Zeichen ein »+« enthält, wird so interpretiert, dass sie auf jeden Rechnernamen passt. Dies erlaubt es jeder fernen Maschine, Ihren Scanner zu benutzen und kann ein Sicherheitsrisiko darstellen. Daher sollten Sie das nicht verwenden, außer Sie wissen, was Sie tun.

source: A sample configuration file is shown below:
de: Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: # Daemon options
de: # Daemon-Optionen

source: # Access list
de: # Zugriffsliste

source: # this is a comment
de: # Dies ist ein Kommentar

source: The case of the host names does not matter, so AHost.COM is considered identical to ahost.com.
de: Die Groß- oder Kleinschreibung spielt bei Rechnernamen keine Rolle, daher ist EinRechner.com identisch zu einrechner.com.

source: SERVER DAEMON CONFIGURATION
de: KONFIGURATION DES SERVER-DAEMONS

source: For B<saned> to work properly in its default mode of operation, it is also necessary to add the appropriate configuration for B<xinetd>(8), B<inetd>(8) or B<systemd>(1) (see below). Note that your B<inetd>(8) must support IPv6 if you want to connect to B<saned> over IPv6; B<xinetd>(8), B<openbsd-inetd>(8) and B<systemd>(1) are known to support IPv6, check the documentation for your B<inetd>(8) daemon.
de: Damit B<saned> in seinem Standardbetriebsmodus korrekt funktioniert, ist es auch notwendig, die geeignete Konfiguration zu B<xinetd>(8), B<inetd>(8) oder B<systemd>(1) hinzuzufügen (siehe unten). Beachten Sie, dass Ihr B<inetd>(8) IPv6 unterstützen muss, falls Sie B<saned> über IPv6 anbinden wollen. B<xinetd>(8), B<openbsd-inetd>(8) und B<systemd>(1) unterstützen bekanntermaßen IPv6, prüfen Sie die Dokumentation Ihres B<inetd>(8)-Daemons.

source: In the sections below the configuration for B<inetd>(8), B<xinetd>(8) and B<systemd>(1) are described in more detail.
de: In den nachfolgenden Abschnitten wird die Konfiguration für B<inetd>(8), B<xinetd>(8) und B<systemd>(1) detaillierter beschrieben.

source: For the configurations below it is necessary to add a line of the following form to I</etc/services>:
de: Für die nachfolgenden Konfigurationen ist es nötig, eine Zeile der folgenden Form zu I</etc/services> hinzuzufügen:

source: sane-port 6566/tcp # SANE network scanner daemon
de: sane-port 6566/tcp # SANE-Netzwerkscanner-Daemon

source: The official IANA short name for port 6566 is "sane-port". The older name "sane" is now deprecated.
de: Der offizielle IANA-Kurzname für Port 6566 ist »sane-port«. Der ältere Name »sane« gilt als veraltet.

source: INETD CONFIGURATION
de: INETD-KONFIGURATION

source: It is required to add a single line to the B<inetd>(8) configuration file I<(/etc/inetd.conf)>
de: Es ist notwendig, eine einzelne Zeile zu der Konfigurationsdatei I<(/etc/inetd.conf)> von B<inetd>(8) hinzuzufügen.

source: The configuration line normally looks like this:
de: Die Konfigurationszeile sieht normalerweise folgendermaßen aus:

source: However, if your system uses B<tcpd>(8) for additional security screening, you may want to disable B<saned> access control by putting ``+'' in I<saned.conf> and use a line of the following form in I</etc/inetd.conf> instead:
de: Falls Ihr System allerdings B<tcpd>(8) für zusätzliche Sicherheitsüberwachung verwendet, können Sie die Zugriffssteuerung von B<saned> deaktivieren, indem Sie ein »+« in I<saned.conf> packen und stattdessen eine Zeile der folgenden Form in I</etc/inetd.conf> verwenden:

source: Note that both examples assume that there is a B<saned> group and a B<saned> user. If you follow this example, please make sure that the access permissions on the special device are set such that B<saned> can access the scanner (the program generally needs read and write access to scanner devices).
de: Beachten Sie, dass beide Beispiele davon ausgehen, dass es sowohl eine Gruppe als auch einen Benutzer namens B<saned> gibt. Wenn Sie diesem Beispiel folgen, stellen Sie bitte sicher, dass die Zugriffsrechte auf das Spezialgerät so gesetzt sind, dass B<saned> auf den Scanner zugreifen kann (das Programm benötigt generell lesenden und schreibenden Zugriff auf Scanner-Geräte).

source: XINETD CONFIGURATION
de: XINETD-KONFIGURATION

source: If B<xinetd>(8) is installed on your system instead of B<inetd>(8) the following example for I</etc/xinetd.conf> may be helpful:
de: Falls B<xinetd>(8) statt B<inetd>(8) auf Ihrem System installiert ist, kann das nachfolgende Beispiel für I</etc/xinetd.conf> hilfreich sein:

source: \f(CR# default: off # description: The sane server accepts requests # for network access to a local scanner via the # network. service sane-port { port = 6566 socket_type = stream wait = no user = saned group = saned server = /usr/bin/saned }\fR
de: \f(CR# default: off # description: Der Sane-Server akzeptiert Anfragen # auf Netzwerkzugriff auf einen lokalen Scanner mittels des # Netzwerks. service sane-port { port = 6566 socket_type = stream wait = no user = saned group = saned server = /usr/bin/saned }\fR

source: SYSTEMD CONFIGURATION
de: SYSTEMD-KONFIGURATION

source: B<saned> can be compiled with explicit B<systemd>(1) support. This will allow logging debugging information to be forwarded to the B<systemd>(1) journal. The B<systemd>(1) support requires compilation with the systemd-devel package installed on the system. This is the preferred option.
de: B<saned> kann mit expliziter Unterstützung für B<systemd>(1) kompiliert werden. Dies ermöglicht die Protokollierung von Debugging-Informationen und deren Speicherung im Journal von B<systemd>(1). Die B<systemd>(1)-Unterstützung erfordert die Kompilierung mit auf dem System installiertem I<systemd-devel>-Paket. Dies ist die bevorzugte Option.

source: B<saned> can be used with B<systemd>(1) without the B<systemd>(1) integration compiled in, but then logging of debug information is not supported.
de: B<saned> kann mit B<systemd>(1) verwendet werden, ohne dass die B<systemd>(1)-Unterstützung einkompiliert ist, allerdings wird dann die Protokollierung von Debug-Informationen nicht unterstützt.

source: The B<systemd>(1) configuration is different for the 2 options, so both are described below.
de: Die B<systemd>(1)-Konfiguration ist für die beiden Optionen verschieden, daher werden beide nachfolgend beschrieben.

source: Systemd configuration for saned with systemd support compiled in
de: Systemd-Konfiguration für B<saned> mit einkompiliertem Systemd

source: For B<systemd>(1) configuration we need to add 2 configuration files in I</etc/systemd/system>.
de: Für die B<systemd>(1)-Konfiguration müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: The first file we need to add here is called I<saned.socket.> It shall have the following contents:
de: Die erste Datei, die wir hier hinzufügen müssen, heißt I<saned.socket>. Sie muss den folgenden Inhalt haben:

source: \f(CR[Unit] Description=saned incoming socket\fR
de: \f(CR[Unit] Description=Saned eingehendes Socket\fR

source: The second file to be added is I<saned@.service> with the following contents:
de: Die zweite Datei, die hier hinzugefügt werden muss, ist I<saned@.service> mit den folgenden Inhalten:

source: \f(CR[Service] ExecStart=/usr/sbin/saned User=saned Group=saned StandardInput=null StandardOutput=syslog StandardError=syslog Environment=SANE_CONFIG_DIR=/etc/sane.d # If you need to debug your configuration uncomment the next line and # change it as appropriate to set the desired debug options # Environment=SANE_DEBUG_DLL=255 SANE_DEBUG_BJNP=5\fR
de: \f(CR[Service] ExecStart=/usr/sbin/saned User=saned Group=saned StandardInput=null StandardOutput=syslog StandardError=syslog Environment=SANE_CONFIG_DIR=/etc/sane.d # Falls Sie in Ihrer Konfiguration nach Fehlern suchen müssen, entfernen # Sie das Kommentarzeichen vor der nächsten Zeile und passen Sie sie mit # den gewünschten Debug-Optionen an # Environment=SANE_DEBUG_DLL=255 SANE_DEBUG_BJNP=5\fR

source: You need to set an environment variable for B<SANE_CONFIG_DIR> pointing to the directory where B<saned> can find its configuration files. You will have to remove the # on the last line and set the variables for the desired debugging information if required. Multiple variables can be set by separating the assignments by spaces as shown in the example above.
de: Sie müssen eine Umgebungsvariable für B<SANE_CONFIG_DIR> setzen, die auf das Verzeichnis zeigt, in dem B<saned> seine Konfigurationsdateien finden kann. Sie werden das »#« auf der letzten Zeile entfernen müssen und die Variablen für die gewünschten Debugging-Informationen setzen müssen, falls benötigt. Sie können mehrere Variablen setzen, indem Sie die Zuweisungen durch Leerzeichen trennen, wie das im obigen Beispiel gezeigt ist.

source: Unlike B<xinetd>(8) and B<inetd>(8), B<systemd>(1) allows debugging output from backends set using B<SANE_DEBUG_XXX> to be captured. See the man-page for your backend to see what options are supported. With the service unit as described above, the debugging output is forwarded to the system log.
de: Anders als bei B<xinetd>(8) und B<inetd>(8) erlaubt B<systemd>(1) das Mitschneiden der Fehlersuchausgabe von Backends, die mittels B<SANE_DEBUG_XXX> gesetzt wurde. Lesen Sie die Handbuchseite für Ihr Backend, um zu sehen, welche Optionen unterstützt werden. Mit der oben dargestellten Dienste-Unit wird die Debugging-Ausgabe an das Systemprotokoll weitergeleitet.

source: Systemd configuration when saned is compiled without systemd support
de: Systemd-Konfiguration, wenn saned ohne Unterstützung für Systemd kompiliert wurde

source: This configuration will also work when B<saned> is compiled WITH B<systemd>(1) integration support, but it does not allow debugging information to be logged.
de: Diese Konfigurationsdatei funktioniert auch, wenn B<saned> MIT B<systemd>(1)-Integrationsunterstützung kompiliert wurde, aber sie erlaubt nicht das Protokollieren der Debugging-Informationen.

source: For B<systemd>(1) configuration for B<saned>, we need to add 2 configuration files in I</etc/systemd/system>.
de: Für die B<systemd>(1)-Konfiguration für B<saned> müssen zwei Konfigurationsdateien in I</etc/systemd/system> hinzugefügt werden.

source: The first file we need to add here is called I<saned.socket.> It is identical to the version for B<systemd>(1) with the support compiled in. It shall have the following contents:
de: Die erste Datei, die hier hinzugefügt werden muss, heißt I<saned.socket>. Sie ist identisch zu der Version für B<systemd>(1) mit einkompilierter Unterstützung. Sie muss den folgenden Inhalt haben:

source: The second file to be added is I<saned@.service>. This one differs from the version with B<systemd>(1) integration compiled in:
de: Die zweite Datei, die hinzugefügt werden muss, ist I<saned@.service>. Diese unterscheidet sich von der Version mit einkompilierter B<systemd>(1)-Unterstützung.

source: FILES
de: DATEIEN

source: The hosts listed in this file are permitted to access all local SANE devices. Caveat: this file imposes serious security risks and its use is not recommended.
de: Den in dieser Datei aufgeführten Rechnern wird der Zugriff auf alle lokalen SANE-Geräte erlaubt. Warnung: Diese Datei führt zu erheblichen Sicherheitsrisiken und ihr Einsatz wird nicht empfohlen.

source: Contains a list of hosts permitted to access local SANE devices (see also description of B<SANE_CONFIG_DIR> below).
de: Enthält eine Liste von Rechnern, denen der Zugriff auf lokale SANE-Geräte erlaubt wird (siehe auch die obige Beschreibung von B<SANE_CONFIG_DIR>).

source: If this file contains lines of the form
de: Falls diese Datei Zeilen der Form

source: user:password:backend
de: Benutzer:Passwort:Backend

source: access to the listed backends is restricted. A backend may be listed multiple times for different user/password combinations. The server uses MD5 hashing if supported by the client.
de: enthält, ist der Zugriff auf die aufgelisteten Backends eingeschränkt. Ein Backend kann mit verschiedenen Benutzer/Passwort-Kombinationen mehrfach aufgelistet werden. Der Server verwendet MD5-Hashes, sofern dies vom Client unterstützt wird.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: B<saned> B<[ -a> I<[ username ]> B<]> B<[ -u> I<username> B<]> B<[ -b> I<address> B<]> B<[ -l ]> B<[ -D ]> B<[ -o ]> B<[ -d> I<n> B<]> B<[ -e ]> B<[ -h ]>
de: B<saned> B<[ -a> I<[ Benutzername ]> B<]> B<[ -u> I<Benutzername> B<]> B<[ -b> I<Adresse> B<]> B<[ -l ]> B<[ -D ]> B<[ -o ]> B<[ -d> I<n> B<]> B<[ -e ]> B<[ -h ]>

source: The B<-l> flag requests that B<saned> run in standalone daemon mode. In this mode, B<saned> will listen for incoming client connections; B<inetd> is not required for B<saned> operations in this mode. The B<-b> flag tells B<saned> to bind to the I<address> given. The B<-u> flag requests that B<saned> drop root privileges and run as the user (and group) associated with I<username> after binding. The B<-D> flag will request B<saned> to detach from the console and run in the background. The flag B<-a> is equivalent to the combination of B<-l -B -u> I<username> options.
de: Der Schalter B<-l> fordert, dass B<saned> im Einzelbetrieb-Daemon-Modus läuft. In diesem Modus wird B<saned> auf eingehende Verbindungen warten; B<inetd> ist für B<saned>-Aktionen in diesem Modus nicht notwendig. Der Schalter B<-b> weist B<saned> an, sich an die angegebene I<Adresse> zu binden. Der Schalter B<-u> fordert, dass B<saned> die Root-Privilegien abgibt und nach dem Anbinden als der normaler Benutzer (und dessen Gruppe) läuft, die I<Benutzername> zugeordnet ist. Der Schalter B<-D> fordert, dass B<saned> von der Konsole abkoppelt und im Hintergrund läuft. Der Schalter B<-a> ist äquivalent zu der Kombination der Optionen B<-l -B -u> I<Benutzername>.
