Repository: sebras/manpages-l10n
Catalog: po/*/man8/sendmail.sendmail.8.po
Languages: pl

source: Save statistics in the named file.
pl: Zachowuje statystyki do podanego pliku.

source: Timeout.queuereturn=I<time>
pl: Timeout.queuereturn=I<czas>

source: Set the timeout on undelivered messages in the queue to the specified time. After delivery has failed (e.g., because of a host being down) for this amount of time, failed messages will be returned to the sender. The default is five days.
pl: Ustawia timeout dla niedostarczonych wiadomości z kolejki na określony czas. Po tym, jak dostarczenie nie powiedzie się przez podany czas, wiadomość zostanie zwrócona do nadawcy. Domyślną wartością jest 5 dni.

source: UserDatabaseSpec=I<userdatabase>
pl: UserDatabaseSpec=I<baza_danych_użytkowników>

source: If set, a user database is consulted to get forwarding information. You can consider this an adjunct to the aliasing mechanism, except that the database is intended to be distributed; aliases are local to a particular host. This may not be available if your sendmail does not have the USERDB option compiled in.
pl: Jeśli jest to ustawione, to baza użytkowników jest używana podczas przekazywania wiadomości. Można uważać to za rozszerzenie mechanizmu aliasowania, poza tym, że ta baza może być rozproszona, a aliasy są lokalne na danym komputerze. Może to nie być dostępne, jeśli sendmail nie ma wkompilowanej opcji USERDB.

source: Fork each job during queue runs. May be convenient on memory-poor machines.
pl: Forkuje każde zadanie podczas wykonywania kolejki. Może być przydatne dla maszyn z małą ilością pamięci.

source: Strip incoming messages to seven bits.
pl: Przekształca [przez usunięcie bitu ósmego - przyp. tłum.] przychodzące wiadomości do 7 bitów.

source: EightBitMode=I<mode>
pl: EightBitMode=I<tryb>

source: Set the handling of eight bit input to seven bit destinations to I<mode>: m (mimefy) will convert to seven-bit MIME format, p (pass) will pass it as eight bits (but violates protocols), and s (strict) will bounce the message.
pl: Ustawia traktowanie ósmego bitu wejściowego dla siedmiobitowych celów na podany I<tryb>: "m" (mimefy) konwertuje na siedmiobitowy format MIME, "p" (pass) przekaże wiadomość jako ośmiobitową (naruszając protokoły), a "s" (strict) odbije wiadomość.

source: Sets how long a job must ferment in the queue between attempts to send it.
pl: Ustawia, jak długo zadanie musi przebywać w kolejce, zanim nastąpi próba jego wysłania.

source: DefaultCharSet=I<charset>
pl: DefaultCharSet=I<zestaw_znaków>

source: Sets the default character set used to label 8-bit data that is not otherwise labelled.
pl: Ustawia domyślny zestaw znaków używany do oznaczania danych 8-bitowych, które nie są w inny sposób oznaczone.

source: DialDelay=I<sleeptime>
pl: DialDelay=I<czas_spania>

source: If opening a connection fails, sleep for I<sleeptime> seconds and try again. Useful on dial-on-demand sites.
pl: Jeśli otwarcie połączenia się nie powiedzie, zasypia na I<czas_spania> sekund i próbuje ponownie. Przydatne w sieciach typu "dzwoń na żądanie".

source: NoRecipientAction=I<action>
pl: NoRecipientAction=I<akcja>

source: Set the behaviour when there are no recipient headers (To:, Cc: or Bcc:) in the message to I<action>: none leaves the message unchanged, add-to adds a To: header with the envelope recipients, add-apparently-to adds an Apparently-To: header with the envelope recipients, add-bcc adds an empty Bcc: header, and add-to-undisclosed adds a header reading `To: undisclosed-recipients:;'.
pl: Ustawia zachowanie, gdy nie ma nagłówków odbiorców (To:, Cc: lub Bcc:) w wiadomości na podaną I<akcję>: "none" pozostawia wiadomość bez zmian, "add-to" dodaje nagłówek To: z odbiorcami koperty, "add-apparently-to" dodaje nagłówek Apparently-To: z odbiorcami koperty, "add-bcc" dodaje pusty nagłówek Bcc: i "add-to-undisclosed" dodaje nagłówek "To: undisclosed-recipients:;".

source: Sets the maximum number of connections per second to the SMTP port to I<N>.
pl: Ustawia na I<N> maksymalną liczbę połączeń na sekundę na porcie SMTP.

source: In aliases, the first character of a name may be a vertical bar to cause interpretation of the rest of the name as a command to pipe the mail to. It may be necessary to quote the name to keep B<sendmail> from suppressing the blanks from between arguments. For example, a common alias is:
pl: W aliasach pierwszy znak nazwy może być pionową kreską, powodując interpretację reszty nazwy jako polecenie, do którego należy przesłać list przez potok. Może być niezbędne zacytowanie tej nazwy, by B<sendmail> nie wyciął spacji między argumentami. Na przykład częstym aliasem jest:

source: Aliases may also have the syntax ``:include:I<filename>'' to ask B<sendmail> to read the named file for a list of recipients. For example, an alias such as:
pl: Aliasy mogą mieć też składnię ":include:I<nazwa_pliku>", prosząca B<sendmaila> o odczytanie podanego pliku z listą odbiorców. Na przykład, alias taki jak:

source: would read I</usr/local/lib/poets.list> for the list of addresses making up the group.
pl: odczyta I</usr/local/lib/poets.list> dla uzyskania listy adresów tworzących grupę.

source: B<Sendmail> returns an exit status describing what it did. The codes are defined in E<lt>I<sysexits.h>E<gt>:
pl: B<Sendmail> zwraca status wyjścia opisujący, co zrobił. Kody są zdefiniowane w E<lt>I<sysexits.h>E<gt>:

source: Successful completion on all addresses.
pl: Szczęśliwe zakończenie dla wszystkich adresów.

source: User name not recognized.
pl: Nierozpoznana nazwa użytkownika.

source: Catchall meaning necessary resources were not available.
pl: Potrzebne zasoby nie były dostępne.

source: Syntax error in address.
pl: Błąd składni w adresie.

source: Internal software error, including bad arguments.
pl: Wewnętrzny błąd oprogramowania, włączający nieprawidłowe argumenty.

source: Temporary operating system error, such as ``cannot fork''.
pl: Tymczasowy błąd systemu operacyjnego, taki jak "nie można wykonać fork()".

source: Host name not recognized.
pl: Nazwa hosta nierozpoznana.

source: Message could not be sent immediately, but was queued.
pl: Wiadomość nie mogła być dostarczona, lecz jest skolejkowana.

source: If invoked as B<newaliases>, B<sendmail> will rebuild the alias database. If invoked as B<mailq>, B<sendmail> will print the contents of the mail queue. If invoked as B<hoststat>, B<sendmail> will print the persistent host status database. If invoked as B<purgestat>, B<sendmail> will purge expired entries from the persistent host status database. If invoked as B<smtpd>, B<sendmail> will act as a daemon, as if the B<-bd> option were specified.
pl: B<Sendmail> uruchomiony jako B<newaliases> przebuduje bazę aliasów. Uruchomiony jako B<mailq> wypisze zawartość kolejki wiadomości. Uruchomiony jako B<hoststat> wypisze bazę danych stanów komputerów. Uruchomiony jako B<purgestat> usunie przeterminowane wpisy z bazy danych stanów komputerów. Uruchomiony jako B<smtpd> przejdzie w tryb demona, tak jakby podano opcję B<-bd>.

source: NOTES
pl: UWAGI

source: B<sendmail> often gets blamed for many problems that are actually the result of other problems, such as overly permissive modes on directories. For this reason, B<sendmail> checks the modes on system directories and files to determine if they can be trusted. Although these checks can be turned off and your system security reduced by setting the B<DontBlameSendmail> option, the permission problems should be fixed. For more information, see:
pl: B<Sendmail> często jest obwiniany o wiele problemów, które zasadniczo wynikają z innych problemów, takich jak pozwalające na zbyt wiele prawa dostępu do katalogów. Z tego powodu B<sendmail> sprawdza prawa dostępu do katalogów i plików systemowych, określając, czy można ufać ich zawartości. Chociaż można wyłączyć te sprawdzenia, obniżając przy okazji bezpieczeństwo systemu, za pomocą opcji B<DontBlameSendmail>, to jednak te uprawienia powinny zostać poprawione. Więcej informacji można uzyskać pod adresem:

source: FILES
pl: PLIKI

source: Except for the file I</etc/mail/sendmail.cf> itself the following pathnames are all specified in I</etc/mail/sendmail.cf>. Thus, these values are only approximations.
pl: Z wyjątkiem pliku I</etc/mail/sendmail.cf> wszystkie wymienione poniżej ścieżki są określane w pliku I</etc/mail/sendmail.cf>. Dlatego lokalizacje podane poniżej są tylko przybliżeniami.

source: raw data for alias names
pl: czyste dane dla nazw aliasowych

source: data base of alias names
pl: baza danych nazw aliasowych

source: configuration file
pl: plik konfiguracyjny

source: help file
pl: plik pomocy

source: collected statistics
pl: zebrane statystyki

source: temp files
pl: pliki tymczasowe

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: HISTORY
pl: HISTORIA

source: The B<sendmail> command appeared in 4.2BSD.
pl: Polecenie B<sendmail> pojawiło się w 4.2BSD.
