Repository: sebras/manpages-l10n
Catalog: po/*/man8/sendmail.sendmail.8.po
Languages: pl

source: NAME
pl: NAZWA

source: sendmail - an electronic mail transport agent
pl: sendmail - agent transportu poczty elektronicznej

source: SYNOPSIS
pl: SKŁADNIA

source: B<sendmail> [I<flags>] [I<address ...>]
pl: B<sendmail> [I<flagi>] [I<adres ...>]

source: DESCRIPTION
pl: OPIS

source: B<Sendmail> sends a message to one or more I<recipients,> routing the message over whatever networks are necessary. B<Sendmail> does internetwork forwarding as necessary to deliver the message to the correct place.
pl: B<Sendmail> wysyła wiadomość do jednego lub więcej I<odbiorców>, przerzucając ją przez wszelkie niezbędne sieci. B<Sendmail> może dokonywać przekazywania między sieciami, aby dostarczyć wiadomość do właściwego miejsca.

source: B<Sendmail> is not intended as a user interface routine; other programs provide user-friendly front ends; B<sendmail> is used only to deliver pre-formatted messages.
pl: B<Sendmail> nie jest komendą interfejsu użytkownika; do tego służą inne programy; B<sendmail> używany jest jedynie do dostarczania preformatowanych wiadomości.

source: With no flags, B<sendmail> reads its standard input up to an end-of-file or a line consisting only of a single dot and sends a copy of the message found there to all of the addresses listed. It determines the network(s) to use based on the syntax and contents of the addresses.
pl: Bez podanych flag, B<sendmail> czyta standardowe wejście, aż do napotkania znaku końca pliku lub linii zawierającej pojedynczą kropkę i wysyła kopię tej wiadomości do wszystkich wymienionych adresów. Określa używane sieci na podstawie składni i zawartości adresów.

source: Local addresses are looked up in a file and aliased appropriately. Aliasing can be prevented by preceding the address with a backslash. Beginning with 8.10, the sender is included in any alias expansions, e.g., if `john' sends to `group', and `group' includes `john' in the expansion, then the letter will also be delivered to `john'.
pl: Adresy lokalne są wyszukiwane w pliku i odpowiednio aliasowane. Aliasowanie można wyłączyć, poprzedzając adres odwrotnym ukośnikiem. Od wersji 8.10 w rozszerzeniach aliasowych jest włączony nadawca, np. jeśli "jan" wysyła do "grupy", a "grupa" zawiera "jana", to wiadomość będzie także dostarczana "janowi".

source: Parameters
pl: Parametry

source: Use submit.cf even if the operation mode does not indicate an initial mail submission.
pl: Używa submit.cf nawet jeśli sposób wywołania nie wskazuje na to, że sendmail został uruchomiony w trybie wysyłania wiadomości [tj. został uruchomiony jako demon nasłuchujący na porcie SMTP - przyp. tłum.].

source: Use sendmail.cf even if the operation mode indicates an initial mail submission.
pl: Używa sendmail.cf nawet jeśli sposób wywołania wskazuje, że sendmail został uruchomiony [np. przez program mailx lub mutt - przyp. tłum.] w trybie wysyłania wiadomości.

source: B<-B>I<type>
pl: B<-B>I<typ>

source: Set the body type to I<type>. Current legal values are 7BIT or 8BITMIME.
pl: Ustawia rodzaj ciała listu na I<typ>. Obecnie dozwolone wartości to 7BIT i 8BITMIME.

source: Go into ARPANET mode. All input lines must end with a CR-LF, and all messages will be generated with a CR-LF at the end. Also, the ``From:'' and ``Sender:'' fields are examined for the name of the sender.
pl: Wchodzi w tryb ARPANET. Wszystkie linie wejściowe muszą kończyć się CR-LF i wszystkie generowane wiadomości będą miały na końcu CR-LF. Poza tym, pola "From:" i "Sender:" są przeszukiwane w celu znalezienia nazwy nadawcy.

source: Run as a daemon. B<Sendmail> will fork and run in background listening on socket 25 for incoming SMTP connections. This is normally run from /etc/rc.
pl: Działa jako demon. B<Sendmail> się rozdzieli (patrz fork(2)) i uruchomi w tle, oczekując na gnieździe 25 na nadchodzące połączenia SMTP. Jest to zwyczajowy sposób uruchamiania z /etc/rc.

source: Same as B<-bd> except runs in foreground.
pl: To samo, co B<-bd>, lecz powoduje uruchomienie się sendmaila jako procesu pierwszoplanowego (nie wywołuje fork()).

source: Print the persistent host status database.
pl: Drukuje trwałą bazę danych stanów komputerów.

source: Purge expired entries from the persistent host status database.
pl: Usuwa przeterminowane wpisy z trwałej bazy danych stanów komputerów.

source: Initialize the alias database.
pl: Inicjuje bazę aliasów.

source: Deliver mail in the usual way (default).
pl: Dostarcza pocztę w normalny sposób (domyślne).

source: Print a listing of the queue(s).
pl: Wyświetla zawartość kolejki (kolejek).

source: Print number of entries in the queue(s); only available with shared memory support.
pl: Wyświetla liczbę wpisów w kolejce (kolejkach); dostępne tylko, gdy włączone jest wsparcie dla pamięci dzielonej.

source: Use the SMTP protocol as described in RFC821 on standard input and output. This flag implies all the operations of the B<-ba> flag that are compatible with SMTP.
pl: Używa na standardowym wejściu i wyjściu protokołu SMTP opisanego w RFC\ 821. Flaga ta powoduje włączenie wszystkich operacji flagi B<-ba> kompatybilnych z SMTP.

source: Run in address test mode. This mode reads addresses and shows the steps in parsing; it is used for debugging configuration tables.
pl: Działa w trybie testowania adresu. Tryb ten odczytuje adresy i pokazuje etapy ich obróbki; może to być używane do testowania tablic konfiguracji.

source: Verify names only - do not try to collect or deliver a message. Verify mode is normally used for validating users or mailing lists.
pl: Tylko weryfikuje nazwy \(em nie próbuje zebrać lub dostarczyć wiadomości. Tryb ten jest używany zwykle do sprawdzania poprawności nazw użytkowników lub list dyskusyjnych.

source: B<-C>I<file>
pl: B<-C>I<plik>

source: Use alternate configuration file. B<Sendmail> gives up any enhanced (set-user-ID or set-group-ID) privileges if an alternate configuration file is specified.
pl: Używa alternatywnego pliku konfiguracyjnego. B<Sendmail> pozbywa się dodatkowych uprawnień (set-user-ID lub set-group-ID), jeśli zostanie podany alternatywny plik konfiguracyjny.

source: B<-D >I<logfile>
pl: B<-D >I<plik_dziennika>

source: Send debugging output to the indicated log file instead of stdout.
pl: Zapisuje komunikaty debugowania do podanego pliku zamiast na standardowe wyjście.

source: B<-d>I<category>B<.>I<level...>
pl: B<-d>I<kategoria>B<.>I<poziom...>

source: Set the debugging flag for I<category> to I<level>. I<Category> is either an integer or a name specifying the topic, and I<level> an integer specifying the level of debugging output desired. Higher levels generally mean more output. More than one flag can be specified by separating them with commas. A list of numeric debugging categories can be found in the TRACEFLAGS file in the sendmail source distribution.
pl: Ustawia znacznik debugowania dla I<kategorii> na I<poziom>. I<Kategoria> jest albo liczbą całkowitą, albo nazwą określającą dany temat, a I<poziom> jest liczbą całkowitą określającą żądany poziom komunikatów debugowania. Wyższe poziomy oznaczają więcej komunikatów. Można podać więcej niż jeden znacznik, rozdzielając je przecinkami. Listę numerów kategorii debugowania można znaleźć w pliku TRACEFLAGS w kodach źródłowych sendmaila.

source: The option B<-d0.1> prints the version of B<sendmail> and the options it was compiled with.
pl: Opcja B<-d0.1> wyświetla wersję programu B<sendmail> i opcje, z którymi został skompilowany.

source: Most other categories are only useful with, and documented in, B<sendmail>'s source code.
pl: Większość innych kategorii jest użyteczna tylko podczas pracy z kodem źródłowym B<sendmaila> i tam jest udokumentowana.

source: B<-F>I<fullname>
pl: B<-F>I<pełna_nazwa>

source: Set the full name of the sender.
pl: Ustawia pełną nazwę nadawcy.

source: B<-f>I<name>
pl: B<-f>I<nazwa>

source: Sets the name of the ``from'' person (i.e., the envelope sender of the mail). This address may also be used in the From: header if that header is missing during initial submission. The envelope sender address is used as the recipient for delivery status notifications and may also appear in a Return-Path: header. B<-f> should only be used by ``trusted'' users (normally I<root>, I<daemon>, and I<network>) or if the person you are trying to become is the same as the person you are. Otherwise, an X-Authentication-Warning header will be added to the message.
pl: Ustawia nazwę osoby wymienionej w polu "from" (tj. nazwę nadawcy umieszczonego na kopercie maila). Adres ten może być także użyty w nagłówku "From:", jeżeli nagłówek ten nie występuje podczas pierwotnego wysyłania wiadomości. Adres nadawcy z koperty używany jako adresat notyfikacji o stanie dostarczenia wiadomości, a także może pojawiać się w nagłówku "Return-Path:". Opcja B<-f> może być używana tylko i wyłącznie przez zaufanych ("trusted") użytkowników (zazwyczaj I<root>, I<daemon> oraz I<network>) lub przez użytkowników, którzy podadzą jako jej wartość swój adres e-mail. W przeciwnym wypadku do wiadomości dodany zostanie nagłówek "X-Authentication-Warning:".

source: Relay (gateway) submission of a message, e.g., when B<rmail> calls B<sendmail .>
pl: Przekaźnik (brama) wiadomości, na przykład gdy B<rmail> wywoła B<sendmaila>.

source: Set the hop count to I<N>. The hop count is incremented every time the mail is processed. When it reaches a limit, the mail is returned with an error message, the victim of an aliasing loop. If not specified, ``Received:'' lines in the message are counted.
pl: Ustawia licznik hopów na I<N>. Licznik ten jest zwiększany za każdym przetworzeniem listu. Gdy sięgnie limitu, list zwracany jest z komunikatem o błędzie, jako ofiara pętli aliasowej. Jeśli opcja ta nie jest podana, linie "Received:" nie są zliczane.

source: B<-L >I<tag>
pl: B<-L >I<etykieta>

source: Set the identifier used in syslog messages to the supplied I<tag>.
pl: Ustawia identyfikator używany w komunikatach sysloga na podaną I<etykietę>.

source: Set delivery status notification conditions to I<dsn>, which can be `never' for no notifications or a comma separated list of the values `failure' to be notified if delivery failed, `delay' to be notified if delivery is delayed, and `success' to be notified when the message is successfully delivered.
pl: Ustawia powiadamianie o statusie dostarczenia na wartość I<dsn>, która albo może być równa "never" dla braku powiadomień, albo może być oddzieloną przecinkami listą wartości: "failure", aby być powiadamianym po niepowiedzeniu się dostarczenia, "delay", aby być powiadamianym po opóźnieniu dostarczenia, oraz "success", aby być powiadamianym o poprawnym dostarczeniu wiadomości.

source: Don't do aliasing.
pl: Nie robi aliasowania.

source: B<-O> I<option>=I<value>
pl: B<-O> I<opcja>=I<wartość>

source: Set option I<option> to the specified I<value>. This form uses long names. See below for more details.
pl: Ustawia opcję I<opcja> na wartość I<wartość>. Postać ta używa długich nazw. Szczegóły można znaleźć poniżej.

source: B<-o>I<x value>
pl: B<-o>I<x wartość>

source: Set option I<x> to the specified I<value>. This form uses single character names only. The short names are not described in this manual page; see the I<Sendmail Installation and Operation Guide> for details.
pl: Ustawia opcję I<x> na określoną I<wartość>. Ta postać używa nazw jednoznakowych. Krótkie nazwy nie są opisane w tym podręczniku; szczegóły można znaleźć w I<Sendmail Installation and Operation Guide>.

source: B<-p>I<protocol>
pl: B<-p>I<protokół>

source: Set the name of the protocol used to receive the message. This can be a simple protocol name such as ``UUCP'' or a protocol and hostname, such as ``UUCP:ucbvax''.
pl: Ustawia nazwę protokołu używanego do odbierania wiadomości. Może to być prosta nazwa protokołu, taka jak "UUCP", lub protokół i nazwa komputera, np. "UUCP:ucbvax".

source: B<-q>[I<time>]
pl: B<-q>[I<czas>]

source: Process saved messages in the queue at given intervals. If I<time> is omitted, process the queue once. I<Time> is given as a tagged number, with `s' being seconds, `m' being minutes (default), `h' being hours, `d' being days, and `w' being weeks. For example, `-q1h30m' or `-q90m' would both set the timeout to one hour thirty minutes. By default, B<sendmail> will run in the background. This option can be used safely with B<-bd>.
pl: Przetwarza w podanych interwałach wiadomości zachowane w kolejce. Jeśli I<czas> jest pominięty, przetwarza kolejkę tylko raz. I<Czas> jest podawany jako liczba zawierająca jednostki, którymi mogą być: "s" oznaczające sekundy, "m" \(em minuty, "h" \(em godziny, "d" \(em dni i "w" \(em tygodnie. Na przykład "-q1h30m" oraz "-q90m" ustawiają timeout na półtorej godziny. Domyślnie B<sendmail> będzie działał w tle. Opcja ta może być bezpiecznie używana z B<-bd>.

source: B<-qp>[I<time>]
pl: B<-qp>[I<czas>]

source: Similar to B<-q>I<time>, except that instead of periodically forking a child to process the queue, sendmail forks a single persistent child for each queue that alternates between processing the queue and sleeping. The sleep time is given as the argument; it defaults to 1 second. The process will always sleep at least 5 seconds if the queue was empty in the previous queue run.
pl: Podobna do B<-q>I<czas>, z tym wyjątkiem, że zamiast okresowego tworzenia nowych dzieci do przetwarzania kolejki, B<sendmail> tworzy dla każdej kolejki po jednym dziecku, które albo będzie przetwarzać kolejkę, albo będzie uśpione. Czas uśpienia jest podany jako argument, domyślnie wynosi 1 sekundę. Proces zawsze będzie spał co najmniej przez 5 sekund, jeśli kolejka była pusta podczas jej wcześniejszego przetwarzania.

source: Process saved messages in the queue once and do not fork(), but run in the foreground.
pl: Przetwarza zachowane wiadomości w kolejce tylko raz. Działa jako proces pierwszoplanowy (nie wywołuje fork()).

source: B<-q>GI<name>
pl: B<-q>GI<nazwa>

source: Process jobs in queue group called I<name> only.
pl: Przetwarza zadania z grupy kolejek o podanej I<nazwie>.

source: B<-q>[I<!>]II<substr>
pl: B<-q>[I<!>]II<podciąg>

source: Limit processed jobs to those containing I<substr> as a substring of the queue id or not when I<!> is specified.
pl: Ogranicza przetwarzane zadania do zawierających I<podciąg> lub \(em jeśli podano I<!> \(em go niezawierających w identyfikatorze kolejki.

source: B<-q>[I<!>]QI<substr>
pl: B<-q>[I<!>]QI<podciąg>

source: Limit processed jobs to quarantined jobs containing I<substr> as a substring of the quarantine reason or not when I<!> is specified.
pl: Ogranicza przetwarzane zadania do będących w kwarantannie i zawierających I<podciąg> lub \(em jeśli podano I<!> \(em go niezawierających w przyczynie kwarantanny.

source: B<-q>[I<!>]RI<substr>
pl: B<-q>[I<!>]RI<podciąg>

source: Limit processed jobs to those containing I<substr> as a substring of one of the recipients or not when I<!> is specified.
pl: Ogranicza przetwarzane zadania do zawierających I<podciąg> lub \(em jeśli podano I<!> \(em go niezawierających w nazwie jednego z odbiorców.

source: B<-q>[I<!>]SI<substr>
pl: B<-q>[I<!>]SI<podciąg>

source: Limit processed jobs to those containing I<substr> as a substring of the sender or not when I<!> is specified.
pl: Ogranicza przetwarzane zadania do tych, zawierających I<podciąg> lub \(em jeśli podano I<!> \(em go niezawierających w nazwie nadawcy.

source: B<-Q>[reason]
pl: B<-Q>[powód]

source: Quarantine a normal queue items with the given reason or unquarantine quarantined queue items if no reason is given. This should only be used with some sort of item matching using as described above.
pl: Umieszcza elementy zwykłej kolejki w kwarantannie, jeśli podano jej powód jako argument tej opcji. Jeśli nie podano powodu, to kończy kwarantannę elementów, które w niej były. Należy używać tego z pewnym rodzajem dopasowań elementów spośród rodzajów opisanych powyżej.

source: Set the amount of the message to be returned if the message bounces. The I<return> parameter can be `full' to return the entire message or `hdrs' to return only the headers. In the latter case also local bounces return only the headers.
pl: Ustawia liczbę wiadomości zwracanych przy odbijaniu listu. Parametr I<return> może mieć wartość "full", aby zwracać całą wiadomość, lub "hdrs", aby zwracać jedynie nagłówki. W tym drugim przypadku także odbicia lokalnych wiadomości zawierają tylko nagłówki.

source: B<-r>I<name>
pl: B<-r>I<nazwa>

source: An alternate and obsolete form of the B<-f> flag.
pl: Alternatywna i przedawniona postać flagi B<-f>.

source: Read message for recipients. To:, Cc:, and Bcc: lines will be scanned for recipient addresses. The Bcc: line will be deleted before transmission.
pl: Szuka odbiorców w wiadomości. W poszukiwaniu odbiorców, B<sendmail> poszuka w wiadomości linii To:, Cc: oraz Bcc:. Nagłówek Bcc: zostanie usunięty przed dalszą transmisją wiadomości.

source: Set the original envelope id. This is propagated across SMTP to servers that support DSNs and is returned in DSN-compliant error messages.
pl: Ustawia oryginalny identyfikator koperty. Jest to rozprzestrzeniane przez SMTP do serwerów obsługujących powiadomienia DSN i zwracane w wiadomościach o błędach, zgodnych z DSN.

source: Go into verbose mode. Alias expansions will be announced, etc.
pl: Wchodzi w tryb gadatliwy. Rozwijanie aliasów będzie ogłaszane, itp.

source: B<-X >I<logfile>
pl: B<-X >I<plik_dziennika>

source: Log all traffic in and out of mailers in the indicated log file. This should only be used as a last resort for debugging mailer bugs. It will log a lot of data very quickly.
pl: Loguje cały przepływ do wskazanych plików dziennika. Powinno być używane tylko jako ostatni sposób debugowania błędów mailera. Będzie bardzo szybko logować duże ilości danych.

source: Stop processing command flags and use the rest of the arguments as addresses.
pl: Kończy przetwarzanie parametrów i używa pozostałych argumentów linii poleceń jako adresów.

source: Options
pl: Opcje

source: There are also a number of processing options that may be set. Normally these will only be used by a system administrator. Options may be set either on the command line using the B<-o> flag (for short names), the B<-O> flag (for long names), or in the configuration file. This is a partial list limited to those options that are likely to be useful on the command line and only shows the long names; for a complete list (and details), consult the I<Sendmail Installation and Operation Guide>. The options are:
pl: Istnieje również spora liczba opcji przetwarzania, które można ustawić. Zazwyczaj są używane tylko przez administratora systemu. Opcje mogą być ustawiane albo z linii komend, przy użyciu flagi B<-o> (dla nazw krótkich) lub B<-O> (dla nazw długich), albo w pliku konfiguracyjnym. Oto częściowa lista, ograniczona do tych opcji, które mogą być przydatne w linii poleceń i pokazuje tylko długie nazwy; kompletna lista (i szczegóły) znajduje się w "I<Sendmail Installation and Operation Guide>". Opcje to:

source: AliasFile=I<file>
pl: AliasFile=I<plik>

source: Use alternate alias file.
pl: Używa alternatywnego pliku z aliasami.

source: On mailers that are considered ``expensive'' to connect to, don't initiate immediate connection. This requires queueing.
pl: Na mailerach, z którymi połączenie jest kosztowne, nie inicjuje natychmiastowych połączeń. Wymaga to kolejkowania.

source: Checkpoint the queue file after every I<N> successful deliveries (default 10). This avoids excessive duplicate deliveries when sending to long mailing lists interrupted by system crashes.
pl: Sprawdza plik kolejki po każdych I<N> pomyślnych dostarczeniach (domyślnie 10). Zapobiega to kosztownym dostarczaniom duplikatów, kiedy wysyłanie na duże listy dyskusyjne zostanie przerwane padem systemu.

source: Set the delivery mode to I<x>. Delivery modes are `i' for interactive (synchronous) delivery, `b' for background (asynchronous) delivery, `q' for queue only - i.e., actual delivery is done the next time the queue is run, and `d' for deferred - the same as `q' except that database lookups for maps which have set the -D option (default for the host map) are avoided.
pl: Ustawia tryb dostarczania na I<x>. Tryby dostarczania to: "i" dla interaktywnego dostarczania (synchronicznego), "b" dla dostarczania w tle (asynchronicznego), "q" dla kolejkowania \- np. właściwe dostarczenie będzie dokonane w następnym uruchomieniu kolejki, "d" dla dostarczania odłożonego, które jest tym samym, co "q", lecz unikane sa podglądy baz danych mających ustawioną opcję -D (mapa komputerów ma ją domyślnie ustawioną).

source: Set error processing to mode I<x>. Valid modes are `m' to mail back the error message, `w' to ``write'' back the error message (or mail it back if the sender is not logged in), `p' to print the errors on the terminal (default), `q' to throw away error messages (only exit status is returned), and `e' to do special processing for the BerkNet. If the text of the message is not mailed back by modes `m' or `w' and if the sender is local to this machine, a copy of the message is appended to the file I<dead.letter> in the sender's home directory.
pl: Ustawia przetwarzanie błędów na tryb I<x>. Poprawne tryby to: "m" do odsyłania pocztą komunikatu o błędzie, "w" do wypisania komunikatu o błędzie (lub odesłania go z powrotem, jeśli nadawca nie jest zalogowany), "p" do wypisania błędów na terminal (domyślnie), "q" do zignorowania komunikatów o błędach (zwracany jest tylko status wyjścia),i "e" do robienia specjalnego przetwarzania dla BerkNet. Jeśli tekst wiadomości nie jest odsyłany przez tryby "m" lub "w" i jeśli nadawca jest lokalny, to kopia wiadomości jest doklejana do pliku I<dead.letter> w katalogu domowym nadawcy.

source: Save UNIX-style From lines at the front of messages.
pl: Zachowuje będące w stylu Uniksa linie From z początku wiadomości.

source: The maximum number of times a message is allowed to ``hop'' before we decide it is in a loop.
pl: Maksymalna liczba razy, kiedy wiadomość może przeżyć "hop", zanim B<sendmail> zdecyduje, że jest zapętlona.

source: Do not take dots on a line by themselves as a message terminator.
pl: Nie uważa kropek w pustych liniach za terminatory wiadomości.

source: Send error messages in MIME format. If not set, the DSN (Delivery Status Notification) SMTP extension is disabled.
pl: Wysyła komunikaty o błędach w formacie MIME. Jeśli nie jest ustawione, rozszerzenie DSN (Delivery Status Notification \(em Powiadomienie o stanie dostarczenia) SMTP jest wyłączane.

source: Set connection cache timeout.
pl: Ustawia timeout cache połączenia.

source: Set connection cache size.
pl: Ustawia rozmiar cache połączenia.

source: The log level.
pl: Ustawia poziom logowania.

source: Don't send to ``me'' (the sender) if I am in an alias expansion.
pl: Nie wysyła wiadomości do "mnie" (nadawcy), jeśli znajduję się w rozwinięciu aliasowym.

source: Validate the right hand side of aliases during a newaliases(1) command.
pl: Sprawdza poprawność prawej strony (wartości) aliasów podczas polecenia newaliases(1).

source: If set, this message may have old style headers. If not set, this message is guaranteed to have new style headers (i.e., commas instead of spaces between addresses). If set, an adaptive algorithm is used that will correctly determine the header format in most cases.
pl: Jeśli jest to ustawione, wiadomości mogą mieć starodawne nagłówki. Jeśli nie, wiadomość musi mieć nowe nagłówki (np. przecinki zamiast spacji między adresami). Jeśli jest ustawione, używany jest adaptacyjny algorytm, który rozpoznaje prawidłowo te nagłówki.

source: QueueDirectory=I<queuedir>
pl: QueueDirectory=I<katalog_kolejki>

source: Select the directory in which to queue messages.
pl: Wybiera katalog kolejkowania wiadomości.

source: StatusFile=I<file>
pl: StatusFile=I<plik>
