Repository: sebras/manpages-l10n
Catalog: po/*/man8/setfont.8.po
Languages: pl

source: 11 Feb 2001
pl: 11 lutego 2001

source: NAME
pl: NAZWA

source: setfont - load EGA/VGA console screen font
pl: setfont - ładuje czcionkę konsolową ekranu dla EGA/VGA

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: The B<setfont> command reads a font from the file I<font.new> and loads it into the EGA/VGA character generator, and optionally outputs the previous font. It can also load various mapping tables and output the previous versions.
pl: Polecenie I<setfont> wczytuje czcionkę z pliku I<font.new> i ładuje ją do generatora znaków EGA/VGA oraz opcjonalnie wypisuje poprzednią czcionkę. Może również wczytać różne tablice odwzorowań i wypisać zawartość poprzednich.

source: If no args are given (or only the option -I<N> for some number I<N>), then a default (8xI<N>) font is loaded (see below). One may give several small fonts, all containing a Unicode table, and B<setfont> will combine them and load the union. Typical use:
pl: Jeżeli nie podano żadnych argumentów (lub tylko opcję -I<N> dla jakiejś liczby I<N>), wtedy ładowana jest domyślna czcionka (8xI<N>) (zobacz poniżej). Można podać wiele małych czcionek, zawierających tablice unikodowe, a B<setfont> połączy je i wczyta całość. Typowe użycie:

source: Load a default font.
pl: Wczytuje domyślną czcionkę.

source: Load a given font (here the 448-glyph drdos font).
pl: Wczytuje podaną czcionkę (tutaj 448-glifowa [448-glyph] czcionka drdos).

source: Load a given font that does not have a Unicode map and provide one explicitly.
pl: Wczytuje podaną czcionkę, który nie ma mapy unikodowej, oraz podaną mapę.

source: Load a given font (here a 512-glyph font combining several character sets) and indicate that one's local character set is ISO 8859-2.
pl: Wczytuje podaną czcionkę (tutaj 512-glifowa czcionka łącząca różne zestawy znaków) i określa, że lokalnym zestawem znaków jest ISO 8859-2.

source: Note: if a font has more than 256 glyphs, only 8 out of 16 colors can be used simultaneously. It can make console perception worse (loss of intensity and even some colors).
pl: Uwaga: jeśli czcionka ma więcej niż 256 glifów, to tylko 8 z 16 kolorów będzie można użyć jednocześnie. Może to pogorszyć postrzeganie konsoli (utrata intensywności albo i nawet niektórych kolorów).

source: FONT FORMATS
pl: FORMATY CZCIONEK

source: The standard Linux font format is the PSF font. It has a header describing font properties like character size, followed by the glyph bitmaps, optionally followed by a Unicode mapping table giving the Unicode value for each glyph. Several other (obsolete) font formats are recognized. If the input file has code page format (probably with suffix .cp), containing three fonts with sizes e.g. 8x8, 8x14 and 8x16, then one of the options -8 or -14 or -16 must be used to select one. Raw font files are binary files of size 256*I<N> bytes, containing bit images for each of 256 characters, one byte per scan line, and I<N> bytes per character (0 E<lt> I<N> E<lt>= 32). Most fonts have a width of 8 bits, but with the framebuffer device (fb) other widths can be used.
pl: Standardowym formatem czcionek w Linuksie jest PSF. Zawiera on nagłówek opisujący własności czcionki, takie jak rozmiar znaku, po którym występuje mapa bitowa glifów, po której opcjonalnie występować może tablica odwzorowań unikodowych, dająca wartość unikodową dla każdego glifu. Rozpoznawanych jest również wiele innych (przestarzałych) formatów. Gdy plik wejściowy ma format strony kodowej (prawdopodobnie z rozszerzeniem .cp), zawierającej trzy czcionki o rozmiarach np. 8x8, 8x14 i 8x16, wtedy jedna z opcji -8 lub -14 lub -16 musi być podana, by wybrać jeden z nich. Surowe pliki z czcionkami są plikami binarnymi o rozmiarze 256*I<N> bajtów, zawierającymi obrazy bitowe każdego z 256 znaków, po jednym bajcie na każdą skanowaną linię i po I<N> bajtów na znak (0 E<lt> I<N> E<lt>= 32). Większość czcionek ma szerokość 8 bitów, lecz z urządzeniem bufora ramki (fb) użyte mogą być inne szerokości.

source: FONT HEIGHT
pl: WYSOKOŚĆ CZCIONKI

source: The program B<setfont> has no built-in knowledge of VGA video modes, but just asks the kernel to load the character ROM of the video card with certain bitmaps. However, since Linux 1.3.1 the kernel knows enough about EGA/VGA video modes to select a different line distance. The default character height will be the number I<N> inferred from the font or specified by option. However, the user can specify a different character height I<H> using the I<-h> option.
pl: Program B<setfont> nie zawiera wbudowanych informacji na temat trybów graficznych VGA, ale po prostu prosi jądro o wczytanie pewnej mapy bitowej do pamięci znakowej ROM karty graficznej. Jednak od Linuksa 1.3.1 jądro wie wystarczająco o trybach graficznych EGA/VGA, aby wybrać inną odległość linii (line distance). Domyślną wysokością znaku będzie liczba I<N> wyciągnięta z czcionki lub podana jako opcja. Użytkownik jednak może podać inną wysokość I<H> znaku, używając opcji I<-h>.

source: CONSOLE MAPS
pl: MAPY KONSOLI

source: Several mappings are involved in the path from user program output to console display. If the console is in utf8 mode (see B<unicode_start>(1)) then the kernel expects that user program output is coded as UTF-8 (see B<utf-8>(7)), and converts that to Unicode (ucs2). Otherwise, a translation table is used from the 8-bit program output to 16-bit Unicode values. Such a translation table is called a I<Unicode console map>. There are four of them: three built into the kernel, the fourth settable using the I<-m> option of B<setfont>. An escape sequence chooses between these four tables; after loading a I<cmap>, B<setfont> will output the escape sequence Esc ( K that makes it the active translation.
pl: W drodze od wyjścia programu użytkownika do wyświetlenia na konsoli zaangażowanych jest kilka odwzorowań. Gdy konsola jest w trybie utf8 (zobacz B<unicode_start>(1)), to wtedy jądro oczekuje, że wyjście programu użytkownika jest kodowane jako UTF-8 (zobacz B<utf-8>(7)) i konwertuje je do Unikodu (ucs2). W przeciwnym razie, 8-bitowe wyjście programu jest zamieniane na 16-bitowe wartości unikodowe za pomocą tablicy translacji. Taka tablica nazywana jest I<unikodową mapą konsoli> (Unicode console map). Są cztery takie tablice: trzy wbudowane w jądro i czwarta, która może być ustawiona, dzięki opcji I<-m> programu B<setfont>. Między tymi tablicami wybiera sekwencja sterująca; po wczytaniu I<cmap>, B<setfont> wyrzuci na wyjściu sekwencję sterującą "Esc ( K", co sprawia, że jest to aktywna translacja.

source: Suitable arguments for the I<-m> option are for example I<8859-1>, I<8859-2>, ..., I<8859-15>, I<cp437>, ..., I<cp1250>.
pl: Przykładami argumentów dla opcji I<-m> są I<8859-1>, I<8859-2>, ..., I<8859-15>, I<cp437>, ..., I<cp1250>.

source: Given the Unicode value of the symbol to be displayed, the kernel finds the right glyph in the font using the Unicode mapping info of the font and displays it.
pl: Jądro znajduje prawidłowy glif dla podanej wartości unikodowej symbolu, który ma być wyświetlony, używając informacji o odwzorowaniu unikodowym czcionki i wyświetla go.

source: Old fonts do not have Unicode mapping info, and in order to handle them there are direct-to-font maps (also loaded using I<-m>) that give a correspondence between user bytes and font positions. The most common correspondence is the one given in the file I<trivial> (where user byte values are used directly as font positions). Other correspondences are sometimes preferable since the PC video hardware expects line drawing characters in certain font positions.
pl: Stare czcionki nie zawierają informacji o odwzorowaniu unikodowym i dlatego istnieją mapy bezpośrednio-do-czcionki (direct-to-font maps) (wczytywane także dzięki opcji I<-m>), które dają zgodność (correspondence) pomiędzy bajtami użytkownika, a pozycjami czcionek. Najbardziej powszechną zgodnością jest ta podana w pliku I<trivial> (gdzie wartości bajtów użytkownika są używane bezpośrednio jako pozycje czcionek). Czasami preferowane są inne zgodności, gdyż sprzęt PC video oczekuje, że znaki rysowane będą na pewnych pozycjach czcionek.

source: Giving a I<-m none> argument inhibits the loading and activation of a mapping table. The previous console map can be saved to a file using the I<-om file> option. These options of setfont render B<mapscrn>(8) obsolete. (However, it may be useful to read that man page.)
pl: Gdy podany zostanie argument I<-m none> wczytanie i aktywacja tablicy odwzorowań zostaną powstrzymane. Poprzednia mapa konsoli może być zachowana dzięki opcji I<-om plik>. Te opcje sprawiają, że B<mapscrn>(8) jest przestarzały. (Jednak może być użyteczny przy czytaniu tego podręcznika).

source: UNICODE FONT MAPS
pl: UNIKODOWE MAPY CZCIONEK

source: The correspondence between the glyphs in the font and Unicode values is described by a Unicode mapping table. Many fonts have a Unicode mapping table included in the font file, and an explicit table can be indicated using the I<-u> option. The program B<setfont> will load such a Unicode mapping table, unless a I<-u none> argument is given. The previous Unicode mapping table will be saved as part of the saved font file when the -O option is used. It can be saved to a separate file using the I<-ou file> option. These options of setfont render B<loadunimap>(8) obsolete.
pl: Zgodność między glifami w czcionce a wartościami unikodowymi jest opisana przez unikodową tablicę odwzorowań. W wielu plikach z czcionkami zawarte są unikodowe tablice odwzorowań, które mogą być wskazane przez opcję I<-u>. Program B<setfont> wczyta taką unikodową tablicę odwzorowań, chyba że podana została opcja I<-ou none>. Poprzednia unikodowa tablica odwzorowań będzie zachowana jako część zapisanego pliku z czcionką, gdy użyta będzie opcja -O. Tablica ta może być także zapisana w oddzielnym pliku dzięki opcji I<-ou plik>. Te opcje sprawiają, że B<loadunimap>(8) jest przestarzały.

source: The Unicode mapping table should assign some glyph to the `missing character' value U+fffd, otherwise missing characters are not translated, giving a usually very confusing result.
pl: Unikodowa tablica odwzorowań powinna przydzielić kilka glifów do \'brakującego znaku' (missing character) o wartości U+fffd. W przeciwnym razie brakujące znaki nie są tłumaczone, dając pogmatwane rezultaty.

source: Usually no mapping table is needed, and a Unicode mapping table is already contained in the font (sometimes this is indicated by the .psfu extension), so that most users need not worry about the precise meaning and functioning of these mapping tables.
pl: Zazwyczaj nie jest potrzebna tablica odwzorowań, a unikodowa tablica odwzorowań jest już zawarta w foncie (czasami wskazyje na to rozszerzenie .psfu), więc większość użytkowników nie musi się martwić dokładnym znaczeniem i funkcjonalnością tych tablic.

source: One may add a Unicode mapping table to a psf font using B<psfaddtable>(1).
pl: Każdy może dodać unikodową tablicę odwzorowań do czcionki psf używając B<psfaddtable>(1).

source: OPTIONS
pl: OPCJE

source: Override font height.
pl: Zmień wysokość czcionki.

source: B<-m >I<file>
pl: B<-m >I<plik>

source: Load console map or Unicode console map from I<file>.
pl: Wczytuje mapę konsoli lub unikodową mapę konsoli z I<pliku>.

source: B<-o >I<file>
pl: B<-o >I<plik>

source: Save previous font in I<file>.
pl: Zapisuje poprzednią czcionkę do I<pliku>.

source: B<-O >I<file>
pl: B<-O >I<plik>

source: Save previous font and Unicode map in I<file>.
pl: Zapisuje poprzednią czcionkę i mapę unikodową do I<pliku>.

source: B<-om >I<file>
pl: B<-om >I<plik>

source: Store console map in I<file>.
pl: Zapisuje mapę konsoli do I<pliku>.

source: B<-ou >I<file>
pl: B<-ou >I<plik>

source: Save previous Unicode map in I<file>.
pl: Zapisuje poprzednią mapę unikodową do I<pliku>.

source: B<-u >I<file>
pl: B<-u >I<plik>

source: Load Unicode table describing the font from I<file>.
pl: Wczytuje tablicę unikodową opisującą czcionkę z I<pliku>.

source: Set the font for the indicated console. (May require root permissions.)
pl: Ustawia czcionkę dla wskazanej konsoli. (Może wymagać uprawnień administratora).

source: Be verbose.
pl: Więcej szczegółów.

source: Print version and exit.
pl: Wyświetla informacje o wersji i kończy działanie.

source: NOTE
pl: UWAGA

source: PC video hardware allows one to use the "intensity" bit either to indicate brightness, or to address 512 (instead of 256) glyphs in the font. So, if the font has more than 256 glyphs, the console will be reduced to 8 (instead of 16) colors.
pl: Sprzęt video PC pozwala na użycie bitu "intensywności" albo w celu oznaczenia jasności, albo aby pozwolić na 512 (zamiast 256) glifów w czcionce. Tak więc, jeśli czcionka ma więcej niż 256 glifów, to konsola będzie zredukowana do 8 (zamiast 16) kolorów.

source: FILES
pl: PLIKI

source: SEE ALSO
pl: ZOBACZ TAKŻE
