Repository: sebras/manpages-l10n
Catalog: po/*/man8/showmount.8.po
Languages: de

source: 6 October 1993
de: 6. Oktober 1993

source: NAME
de: BEZEICHNUNG

source: showmount - show mount information for an NFS server
de: showmount - Einhängeinformationen für einen NFS-Server anzeigen

source: SYNOPSIS
de: ÜBERSICHT

source: B<showmount> B<[\ -adehv\ ]> B<[\ --all\ ]> B<[\ --directories\ ]> B<[\ --exports\ ]> B<[\ --help\ ]> B<[\ --version\ ]> B<[\ host\ ]>
de: B<showmount> B<[\ -adehv\ ]> B<[\ --all\ ]> B<[\ --directories\ ]> B<[\ --exports\ ]> B<[\ --help\ ]> B<[\ --version\ ]> B<[\ Rechner\ ]>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<showmount> queries the mount daemon on a remote host for information about the state of the NFS server on that machine. With no options B<showmount> lists the set of clients who are mounting from that host. The output from B<showmount> is designed to appear as though it were processed through ``sort -u''.
de: B<showmount> erfragt beim Einhänge-Daemon eines fernen Rechners Informationen zum Status des NFS-Servers auf diesem Rechner. Ohne Angabe von Optionen listet B<showmount> die Clients auf, die etwas von diesem Rechner eingehängt haben. Die Ausgabe von B<showmount> ist so gestaltet, als wäre sie mit B<sort -u> verarbeitet worden.

source: OPTIONS
de: OPTIONEN

source: B<-a> or B<--all>
de: B<-a> oder B<--all>

source: List both the client hostname or IP address and mounted directory in host:dir format. This info should not be considered reliable. See the notes on rmtab in B<rpc.mountd>(8).
de: listet sowohl Rechnername oder IP-Adresse des Clients als auch das eingehängte Verzeichnis im Format »Rechner:Verzeichnis« auf. Diese Informationen sollten nicht als zuverlässig angesehen werden. Siehe die Anmerkungen zur »rmtab«-Datei in B<rpc.mountd>(8).

source: B<-d> or B<--directories>
de: B<-d> oder B<--directories>

source: List only the directories mounted by some client.
de: liste nur die Verzeichnisse auf, die auf einem Client eingehängt sind.

source: B<-e> or B<--exports>
de: B<-e> oder B<--exports>

source: Show the NFS server's export list.
de: zeigt die Exportliste des NFS-Servers an.

source: B<-h> or B<--help>
de: B<-h> oder B<--help>

source: Provide a short help summary.
de: gibt eine kurze Hilfe aus.

source: B<-v> or B<--version>
de: B<-v> oder B<--version>

source: Report the current version number of the program.
de: zeigt die aktuelle Versionsnummer des Programms an.

source: Suppress the descriptive headings from the output.
de: unterdrückt die beschreibenden Überschriften in der Ausgabe.

source: SEE ALSO
de: SIEHE AUCH

source: BUGS
de: FEHLER

source: The completeness and accuracy of the information that B<showmount> displays varies according to the NFS server's implementation.
de: Die Vollständigkeit und Genauigkeit der von B<showmount> angezeigten Informationen ist von der Implementierung des NFS-Servers abhängig.

source: Because B<showmount> sorts and uniqs the output, it is impossible to determine from the output whether a client is mounting the same directory more than once.
de: Da B<showmount> die Ausgabe sortiert und Duplikate entfernt, kann anhand der Ausgabe unmöglich festgestellt werden, ob ein Client das gleiche Verzeichnis mehrfach eingehängt hat.

source: B<showmount> works by contacting the server's MNT service directly. NFSv4-only servers have no need to advertise their exported root filehandles via this method, and may not expose their MNT service to clients.
de: B<showmount> kontaktiert den MNT-Dienst des Servers direkt. Nur-NFSv4-Server müssen ihre exportierten Root-Datei-Handles nicht über diese Methode veröffentlichen und könnten den MNT-Dienst möglicherweise nicht für Clients zur Verfügung stellen.

source: AUTHOR
de: AUTOR
