Repository: sebras/manpages-l10n
Catalog: po/*/man8/shutdown.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: shutdown - Halt, power-off or reboot the machine
de: shutdown - Die Maschine anhalten, ausschalten oder neustarten

source: SYNOPSIS
de: ÜBERSICHT

source: B<shutdown> [OPTIONS...] [TIME] [WALL...]
de: B<shutdown> [OPTIONEN…] [ZEIT] [WALL…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<shutdown> may be used to halt, power-off or reboot the machine\&.
de: B<shutdown> kann zum Anhalten, Herunterfahren oder Neustarten der Maschine verwandt werden\&.

source: The first argument may be a time string (which is usually "now")\&. Optionally, this may be followed by a wall message to be sent to all logged-in users before going down\&.
de: Das erste Argument kann eine Zeitzeichenkette sein (normalerweise »now«)\&. Optional kann diese eine Wall-Nachricht sein, die vor dem Herunterfahren an alle angemeldeten Benutzer versandt wird\&.

source: The time string may either be in the format "hh:mm" for hour/minutes specifying the time to execute the shutdown at, specified in 24h clock format\&. Alternatively it may be in the syntax "+m" referring to the specified number of minutes m from now\&. "now" is an alias for "+0", i\&.e\&. for triggering an immediate shutdown\&. If no time argument is specified, "+1" is implied\&.
de: Die Zeitzeichenkette kann entweder im Format »hh:mm« für Stunden/Minuten sein, die die Zeit (im 24-Stunden-Format) der Ausführung des Herunterfahrens festlegt\&. Alternativ kann sie in der Syntax »+m« vorliegen, die sich auf die festgelegte Anzahl »m« an Minuten von jetzt an bezieht\&. »now« ist ein Alias für »+0«, d\&.h\. für das Auslösen eines sofortigen Herunterfahrens\&. Falls kein Zeitargument festgelegt ist, wird »+1« angenommen\&.

source: Note that to specify a wall message you must specify a time argument, too\&.
de: Beachten Sie, dass Sie für die Angabe einer Wall-Nachricht auch ein Zeitargument angeben müssen\&.

source: If the time argument is used, 5 minutes before the system goes down the /run/nologin file is created to ensure that further logins shall not be allowed\&.
de: Falls ein Zeitargument verwandt wird, wird 5 Minuten bevor das System heruntergefahren wird, die Datei /run/nologin erstellt, um sicherzustellen, dass weitere Anmeldungen nicht erlaubt werden\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Halt the machine\&.
de: Die Maschine anhalten\&.

source: Power-off the machine (the default)\&.
de: Die Maschine ausschalten (die Vorgabe)\&.

source: Reboot the machine\&.
de: Die Maschine neustarten\&.

source: Equivalent to B<--poweroff>, unless B<--halt> is specified\&.
de: Äquivalent zu B<--poweroff>, außer B<--halt> is angegeben\&.

source: Do not halt, power-off, reboot, just write wall message\&.
de: Nicht anhalten, ausschalten oder neustarten, nur die Wall-Nachricht schreiben\&.

source: Do not send wall message before halt, power-off, reboot\&.
de: Keine Wall-Nachrichten vor dem Anhalten, Herunterfahren oder Neustarten senden\&.

source: Cancel a pending shutdown\&. This may be used to cancel the effect of an invocation of B<shutdown> with a time argument that is not "+0" or "now"\&.
de: Anhängende Herunterfahraktionen abbrechen\&. Dies kann dazu verwandt werden, die Wirkung eines Aufrufs von B<shutdown> mit einem Zeitargument, das nicht »+0« oder »now« ist, aufzuheben\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: SEE ALSO
de: SIEHE AUCH

source: November 12, 2003
de: 12. November 2003

source: Linux System Administrator's Manual
de: Linux-Systemverwaltungshandbuch

source: shutdown - bring the system down
de: shutdown - fährt das System herunter

source: B</sbin/shutdown> [B<-akrhPHfFnc>] [B<-t> I<sec>] I<time> [I<warning message>]
de: B</sbin/shutdown> [B<-akrhPHfFnc>] [B<-t> I<Sek>] I<Zeit> [I<Warnmeldung>]

source: B<shutdown> brings the system down in a secure way. All logged-in users are notified that the system is going down, and B<login>(1) is blocked. It is possible to shut the system down immediately or after a specified delay. All processes are first notified that the system is going down by the signal \s-2SIGTERM\s0. This gives programs like B<vi>(1) the time to save the file being edited, mail and news processing programs a chance to exit cleanly, etc. B<shutdown> does its job by signalling the B<init> process, asking it to change the runlevel. Runlevel B<0> is used to halt the system, runlevel B<6> is used to reboot the system, and runlevel B<1> is used to put to system into a state where administrative tasks can be performed; this is the default if neither the I<-h> or I<-r> flag is given to B<shutdown>. To see which actions are taken on halt or reboot see the appropriate entries for these runlevels in the file I</etc/inittab>.
de: B<Shutdown> fährt das System auf sichere Weise herunter. Alle angemeldeten Benutzer werden benachrichtigt, dass das System heruntergefahren wird und B<login>(1) wird blockiert (Anmeldungen unterbunden). Sie können das System sofort oder nach einer festgelegten Verzögerung herunterfahren. Allen Prozessen wird zunächst mit dem Signal \s-2SIGTERM\s0 mitgeteilt, dass das System herunterfährt. So bekommen Programme wie B<vi>(1) die Zeit, um die bearbeitete Datei zu speichern, Mail- und News-Verarbeitungsprogramme können sauber verlassen werden usw. B<Shutdown> erledigt seine Arbeit, indem es dem B<init>(8)-Prozess signalisiert, das Runlevel zu ändern. Runlevel B<0> wird verwendet, um das System anzuhalten, Runlevel B<6> bewirkt einen Neustart des Systems und Runlevel B<1> wird verwendet, um das System in einen Zustand zu versetzen, in dem administrative Aufgaben durchgeführt werden können. Runlevel B<1> ist die Standardeinstellung, wenn keiner der Schalter B<-h> oder B<-r> an B<shutdown> übergeben wird. Um zu erfahren, welche Aktionen bei Herunterfahren oder Neustart durchgeführt werden, sehen Sie sich die entsprechenden Einträge für diese Runlevel in der Datei I</etc/inittab> an.

source: Use B</etc/shutdown.allow>.
de: verwendet I</etc/shutdown.allow>

source: Don't really shutdown; only send the warning messages to everybody.
de: nicht tatsächlich herunterfahren; nur die Warnmeldungen an alle Benutzer versenden

source: Reboot after shutdown.
de: nach dem Herunterfahren neu starten

source: Halt or power off after shutdown. Usually used with the -P or -H flags, depending on whether we want to poweroff or simply stop the operating system.
de: nach dem Herunterfahren anhalten oder ausschalten. Normalerweise mit den Schaltern B<-P> or B<-H> verwandt, abhängig davon, ob ausgeschaltet oder einfach das Betriebssystem angehalten werden soll.

source: Modifier to the -h flag. Halt action is to turn off the power. Must be used with the -h flag.
de: Dieser Schalter muss mit dem Schalter B<-h> aufgerufen werden und ändert dessen Verhalten. Anhalteaktion besteht aus dem Ausschalten.

source: Modifier to the -h flag. Halt action is to halt or drop into boot monitor on systems that support it. Must be used with the -h flag. Halting is often used to run through the shutdown process and leave output on the screen for debugging purposes. Or when the user wants the OS to stop, but leave the power on. To power off at the end of the shutdown sequence use the -P modifier instead.
de: Dieser Schalter muss mit dem Schalter B<-h> aufgerufen werden und ändert dessen Verhalten. Auf Systemen mit Unterstützung für ein Boot-Überwachungsprogramm (»boot monitor«) wird dieses aufgerufen. Anhalten wird oft dazu verwandt, den Herunterfahrprozess zu durchlaufen und die Ausgabe auf dem Bildschirm für Fehlersuchzwecke zu belassen. Oder wenn der Benutzer möchte, dass das Betriebssystem stoppt, aber das System am Strom bleiben soll. Um am Ende der Herunterfahrsequenz das System auszuschalten, verwenden Sie stattdessen den Schalter B<-P>.

source: Skip fsck on reboot.
de: Beim Systemneustart wird B<fsck>(8) übersprungen.

source: Force fsck on reboot.
de: Beim Systemneustart wird B<fsck>(8) erzwungen.

source: [DEPRECATED] Don't call B<init>(8) to do the shutdown but do it ourself. The use of this option is discouraged, and its results are not always what you'd expect.
de: [MISSBILLIGT] Nicht B<init>(8) aufrufen, um das System herunterzufahren, sondern es selber tun. Von der Verwendung dieser Option wird abgeraten. Deren Ergebnisse sind nicht immer das, was Sie erwarten würden.

source: Cancel a waiting shutdown. ("shutdown now" is no longer waiting.) With this option it is of course not possible to give the time argument, but you can enter explanatory message arguments on the command line that will be sent to all users.
de: Bricht ein anstehendes Herunterfahren ab (»shutdown now« steht nicht mehr an). Mit dieser Option können Sie natürlich kein Zeit-Argument übergeben, aber Sie können auf der Befehlszeile eine erklärende Meldung eingeben, die an alle Nutzer gesendet wird.

source: Reduce the number of warnings shutdown displays. Usually shutdown displays warnings every 15 minutes and then every minute in the last 10 minutes of the countdown until I<time> is reached. When -q is specified shutdown only warns at 60 minute intervals, at the 10 minute mark, at the 5 minue mark, and when the shutdown process actually happens.
de: Reduziert die Anzahl der Warnungen, die Shutdown anzeigt. Normalerweise zeigt Shutdown alle 15 Minuten eine Warnung und dann in den letzten 10 Minuten jede Minute, bis die I<Zeit> erreicht ist. Wenn »-q« angegeben ist, wird Shutdown nur in 60-Minuten-Intervallen, bei der 10-Minuten-Marke, bei der 5-Minuten-Marke und wenn der Herunterfahrprozess tatsächlich stattfindet, gewarnt.

source: Silence warnings prior to shutting down. Usually shutdown displays warnings every 15 minutes and then every minute in the last 10 minutes of the countdown until I<time> is reached. When -Q is specified shutdown only warns when the shutdown process actually happens. All other warning intervals are suppressed.
de: Warnmeldungen vor dem Herunterfahren stark reduzieren. Normalerweise zeigt Shutdown alle 15 Minuten eine Warnung an und dann in den letzten 10 Minuten jede Minute, bis die I<Zeit> erreicht ist. Wenn B<-Q> angegeben ist, wird Shutdown nur warnen, wenn der Herunterfahrprozess tatsächlich stattfindet. Alle anderen Warnintervalle werden unterdrückt.

source: B<-t> I<sec>
de: B<-t> I<Sek>

source: Tell B<init>(8) to wait I<sec> seconds between sending all processes the warning (SIGTERM) and the kill signal (SIGKILL), before changing to another runlevel. The default time, if no value is specified, between these two signals is three seconds. Warning: when shutdown calls init to perform the shutdown (the default behaviour), init checks to see if all processes have terminated and will stop waiting early once its children have all terminated. When shutdown is called with the -n flag, it waits the full time specified (or three seconds) even if all other processes have terminated.
de: Informiert B<init>(8), I<Sek> Sekunden zwischen dem Senden des Warnsignals (SIGTERM) und des Tötungssignals (SIGKILL) an alle Prozesse zu warten, bevor in einen anderen Runlevel gewechselt wird. Die Vorgabezeit zwischen diesen zwei Signalen, falls kein Wert angegeben ist, ist drei Sekunden. Warnung: Wenn Shutdown Init aufruft, um das Herunterfahren durchzuführen (das Vorgabeverhalten), prüft Init, ob alle Prozesse beendet wurden und wird frühzeitig mit dem Warten aufhören, sobald alle Kindprozesse sich beendet haben. Wenn Shutdown mit dem Schalter B<-n> aufgerufen wird, wartet es die komplette angegebene Zeit (oder drei Sekunden), selbst falls alle anderen Prozesse sich beendet haben.

source: I<time>
de: I<Zeit>

source: When to shutdown.
de: Zeitpunkt des Herunterfahrens

source: I<warning message>
de: I<Warnmeldung>

source: Message to send to all users.
de: Diese Nachricht wird an alle Benutzer gesendet.

source: The I<time> argument can have different formats. First, it can be an absolute time in the format I<hh:mm>, in which I<hh> is the hour (1 or 2 digits) and I<mm> is the minute of the hour (in two digits). Second, it can be in the format B<+>I<m>, in which I<m> is the number of minutes to wait. The word B<now> is an alias for B<+0>.
de: Für das Argument I<Zeit> gibt es verschiedene Formate. Das erste ist eine absolute Zeit im Format I<hh:mm>, wobei die ein oder zwei Ziffern I<hh> die Stunden und die zwei Ziffern I<mm> die Minuten angeben. Das zweite Format B<+>I<m> gibt die Wartezeit in Minuten an. Schließlich ist B<now> ein Synonym für B<+0>.

source: If shutdown is called with a delay, it will create the advisory file I</run/nologin> which causes programs such as I<login(1)> to not allow new user logins. This file is created five minutes before the shutdown sequence starts. Shutdown removes this file if it is stopped before it can signal init (i.e. it is cancelled or something goes wrong). It also removes it before calling init to change the runlevel.
de: Wenn B<Shutdown> mit einer Verzögerung herunterfahren soll, erzeugt es die Hinweisdatei I</run/nologin> für Programme wie B<login>(1), die dann die Anmeldung neuer Benutzer unterbinden. Diese Datei wird fünf Minuten vor dem Beginn der Herunterfahrsequenz erzeugt. B<Shutdown> entfernt diese Datei, wenn das Herunterfahren angehalten wird oder ein Fehler auftritt, bevor es an B<init>(8) ein Signal senden kann. Die Datei wird auch vor einem Aufruf von B<init>(8) zum Wechsel des Runlevels aufgerufen.

source: The B<-f> flag means `reboot fast'. This only creates an advisory file I</fastboot> which can be tested by the system when it comes up again. The boot rc file can test if this file is present, and decide not to run B<fsck>(1) since the system has been shut down in the proper way. After that, the boot process should remove I</fastboot>.
de: Der Schalter B<-f> bedeutet »schnell wieder hochfahren« (»reboot fast«). Es wird lediglich eine Hinweisdatei I</fastboot> erzeugt, die vom System beim Neustart ausgewertet werden kann. Das für den Start zuständige rc-Skript kann, wenn die Datei vorhanden ist, entscheiden, wegen dem ordnungsgemäßen Herunterfahren den Aufruf von B<fsck>(8) zu unterlassen. Danach sollte der Startvorgang I</fastboot> entfernen.

source: The B<-F> flag means `force fsck'. This only creates an advisory file I</forcefsck> which can be tested by the system when it comes up again. The boot rc file can test if this file is present, and decide to run B<fsck>(1) with a special `force' flag so that even properly unmounted file systems get checked. After that, the boot process should remove I</forcefsck>.
de: Der Schalter B<-F> bedeutet »Dateisysteme auf jeden Fall prüfen« (»force fsck«). Es wird lediglich die Hinweisdatei I</forcefsck> erzeugt. Das für den Start zuständige rc-Skript kann, wenn die Datei vorhanden ist, entscheiden, B<fsck>(8) mit dem Schalter B<--force> aufzurufen, so dass auch ordnungsgemäß ausgehängte Dateisysteme überprüft werden. Danach sollte der Startvorgang I</forcefsck> entfernen.

source: The B<-n> flag causes B<shutdown> not to call B<init>, but to kill all running processes itself. B<shutdown> will then turn off quota, accounting, and swapping and unmount all file systems.
de: Mit dem Schalter B<-n> wird B<shutdown> nicht B<init>(8) aufrufen, sondern alle laufenden Prozesse selbst beenden. Danach deaktiviert B<shutdown> die Ressourcenüberwachung (quota), die Prozessabrechnung (accounting) und die Speicherauslagerung (swapping) und hängt alle Dateisysteme aus.

source: ACCESS CONTROL
de: ZUGRIFFSSTEUERUNG

source: B<shutdown> can be called from B<init>(8) when the magic keys B<CTRL-ALT-DEL> are pressed, by creating an appropriate entry in I</etc/inittab>. This means that everyone who has physical access to the console keyboard can shut the system down. To prevent this, B<shutdown> can check to see if an authorized user is logged in on one of the virtual consoles. If B<shutdown> is called with the B<-a> argument (add this to the invocation of shutdown in /etc/inittab), it checks to see if the file I</etc/shutdown.allow> is present. It then compares the login names in that file with the list of people that are logged in on a virtual console (from I</var/run/utmp>). Only if one of those authorized users B<or root> is logged in, it will proceed. Otherwise it will write the message
de: B<Shutdown> kann von B<init>(8) als Reaktion auf die Tastenkombination B<STRG-ALT-ENTF> aufgerufen werden, indem ein entsprechender Eintrag in I</etc/inittab> hinzugefügt wird. Damit kann jeder, der physischen Zugriff auf die Konsolen-Tastatur hat, das System herunterfahren. Um dies zu verhindern, kann B<shutdown> überprüfen, ob ein berechtigter Benutzer auf einer der virtuellen Konsolen angemeldet ist. Wenn B<shutdown> mit dem Schalter B<-a> aufgerufen wird (fügen Sie dies dem Aufruf von B<shutdown> in I</etc/inittab> hinzu), überprüft es, ob die Datei I</etc/shutdown.allow> vorhanden ist. Es vergleicht dann die Anmeldenamen in der Datei mit der Liste der Personen, die an einer virtuellen Konsole angemeldet sind (die Daten stammen aus I</var/run/utmp>). Nur wenn einer dieser autorisierten Benutzer B<oder root> eingeloggt ist, macht es weiter. Sonst wird es die Nachricht

source: to the (physical) system console. The format of I</etc/shutdown.allow> is one user name per line. Empty lines and comment lines (prefixed by a B<#>) are allowed. Currently there is a limit of 32 users in this file.
de: auf die (physischen) System-Konsole ausgeben. Das Format von I</etc/shutdown.allow> ist ein Benutzername pro Zeile. Leere und Kommentarzeilen (beginnen mit einem B<#>) sind möglich. Derzeit ist die Datei auf 32 Benutzer beschränkt.

source: Note that if I</etc/shutdown.allow> is not present, the B<-a> argument is ignored.
de: Beachten Sie: Wenn I</etc/shutdown.allow> nicht vorhanden ist, wird der Schalter B<-a> ignoriert.

source: HALT OR POWEROFF
de: ANHALTEN ODER AUSSCHALTEN

source: The B<-H> option just sets the I<init> environment variable I<INIT_HALT> to I<HALT>, and the B<-P> option just sets that variable to I<POWEROFF>. The script (usually /etc/init.d/halt) that calls the B<halt>(8) program as the last thing in the shutting down sequence should check this environment variable and call the B<halt>(8) program with the right options for these options to actually have any effect.
de: Der Option B<-H> setzt nur die Umgebungsvariable I<INIT_HALT> von I<init> auf I<HALT> und die Option B<-P> weist dieser Variablen den Wert I<POWEROFF> zu. Das Skript (normalerweise /etc/init.d/halt), das das Programm B<halt>(8) als letzten Teil der Herunterfahrsequenz aufruft, sollte diese Umgebungsvariable überprüfen und das Programm B<halt>(8) mit den korrekten Optionen aufrufen, damit diese Optionen tatsächlich wirken.

source: FILES
de: DATEIEN

source: NOTES
de: ANMERKUNGEN

source: A lot of users forget to give the I<time> argument and are then puzzled by the error message B<shutdown> produces. The I<time> argument is mandatory; in 90 percent of all cases this argument will be the word B<now>.
de: Viele Benutzer vergessen es, das I<Zeit>-Argument anzugeben und werden dann durch die Fehlermeldung von B<Shutdown> verwirrt. Das I<Zeit>-Argument ist obligatorisch; in 90 Prozent aller Fälle wird es das Wort B<now> sein.

source: Init can only capture CTRL-ALT-DEL and start shutdown in console mode. If the system is running the X window System, the X server processes all key strokes. Some X11 environments make it possible to capture CTRL-ALT-DEL, but what exactly is done with that event depends on that environment.
de: B<Init> kann STRG-ALT-ENTF nur im Konsolen-Modus abfangen und das Herunterfahren einleiten. Wenn auf dem Rechner das X Window System läuft, verarbeitet dieses alle Tastatureingaben. Manche X11-Umgebungen ermöglichen das Abfangen von STRG-ALT-ENTF, aber in diesem Fall ist der genaue Ablauf von der Umgebung abhängig.

source: Shutdown wasn't designed to be run setuid. /etc/shutdown.allow is not used to find out who is executing shutdown, it ONLY checks who is currently logged in on (one of the) console(s).
de: B<Shutdown> wurde nicht dafür entworfen, mit einer anderen Benutzerkennung (setuid) zu laufen. Mit I</etc/shutdown> wird nicht festgestellt, wer das Programm aufgerufen hat. Es wird nur geprüft, wer aktuell auf (einer) der Konsole(n) angemeldet ist.

source: AUTHOR
de: AUTOR

source: B<fsck>(8), B<init>(8), B<halt>(8), B<poweroff>(8), B<reboot>(8)
de: B<fsck>(8), B<halt>(8), B<init>(8), B<poweroff>(8), B<reboot>(8)

source: B<shutdown> brings the system down in a secure way. All logged-in users are notified that the system is going down, and I<login>(1) is blocked. It is possible to shut the system down immediately or after a specified delay. All processes are first notified that the system is going down by the signal \s-2SIGTERM\s0. This gives programs like I<vi>(1) the time to save the file being edited, mail and news processing programs a chance to exit cleanly, etc. B<shutdown> does its job by signalling the B<init> process, asking it to change the runlevel. Runlevel B<0> is used to halt the system, runlevel B<6> is used to reboot the system, and runlevel B<1> is used to put to system into a state where administrative tasks can be performed; this is the default if neither the I<-h> or I<-r> flag is given to B<shutdown>. To see which actions are taken on halt or reboot see the appropriate entries for these runlevels in the file I</etc/inittab>.
de: B<Shutdown> fährt das System auf sichere Weise herunter. Alle angemeldeten Benutzer werden benachrichtigt, dass das System heruntergefahren wird und I<login>(1) wird blockiert (Anmeldungen unterbunden). Sie können das System sofort oder nach einer festgelegten Verzögerung herunterfahren. Allen Prozessen wird zunächst mit dem Signal \s-2SIGTERM\s0 mitgeteilt, dass das System herunterfährt. So bekommen Programme wie I<vi>(1) die Zeit, um die bearbeitete Datei zu speichern, Mail- und News-Verarbeitungsprogramme können sauber verlassen werden usw. B<Shutdown> erledigt seine Arbeit, indem es dem B<init>(8)-Prozess signalisiert, das Runlevel zu ändern. Runlevel B<0> wird verwendet, um das System anzuhalten, Runlevel B<6> bewirkt einen Neustart des Systems und Runlevel B<1> wird verwendet, um das System in einen Zustand zu versetzen, in dem administrative Aufgaben durchgeführt werden können. Runlevel B<1> ist die Standardeinstellung, wenn keiner der Schalter B<-h> oder B<-r> an B<shutdown> übergeben wird. Um zu erfahren, welche Aktionen bei Herunterfahren oder Neustart durchgeführt werden, sehen Sie sich die entsprechenden Einträge für diese Runlevel in der Datei I</etc/inittab> an.

source: Halt or power off after shutdown. Usually used with the I<-P> or I<-H> flags, depending on whether we want to poweroff or simply stop the operating system.
de: nach dem Herunterfahren anhalten oder ausschalten. Normalerweise mit den Schaltern I<-P> or I<-H> verwandt, abhängig davon, ob ausgeschaltet oder einfach das Betriebssystem angehalten werden soll.

source: Modifier to the I<-h> flag. Halt action is to turn off the power. Must be used with the I<-h> flag.
de: Dieser Schalter muss mit dem Schalter I<-h> aufgerufen werden und ändert dessen Verhalten. Anhalteaktion besteht aus dem Ausschalten.
