Repository: sebras/manpages-l10n
Catalog: po/*/man8/shutdown.8.po
Languages: de

source: Modifier to the I<-h> flag. Halt action is to halt or drop into boot monitor on systems that support it. Must be used with the I<-h> flag. Halting is often used to run through the shutdown process and leave output on the screen for debugging purposes. Or when the user wants the OS to stop, but leave the power on. To power off at the end of the shutdown sequence use the I<-P> modifier instead.
de: Dieser Schalter muss mit dem Schalter I<-h> aufgerufen werden und ändert dessen Verhalten. Auf Systemen mit Unterstützung für ein Boot-Überwachungsprogramm (»boot monitor«) wird dieses aufgerufen. Anhalten wird oft dazu verwandt, den Herunterfahrprozess zu durchlaufen und die Ausgabe auf dem Bildschirm für Fehlersuchzwecke zu belassen. Oder wenn der Benutzer möchte, dass das Betriebssystem stoppt, aber das System am Strom bleiben soll. Um am Ende der Herunterfahrsequenz das System auszuschalten, verwenden Sie stattdessen den Schalter I<-P>.

source: Skip I<fsck> on reboot.
de: Beim Systemneustart wird I<fsck>(8) übersprungen.

source: Force I<fsck> on reboot.
de: Beim Systemneustart wird I<fsck>(8) erzwungen.

source: Silence warnings prior to shutting down. Usually shutdown displays warnings every 15 minutes and then every minute in the last 10 minutes of the countdown until I<time> is reached. When I<-Q> is specified shutdown only warns when the shutdown process actually happens. All other warning intervals are suppressed.
de: Warnmeldungen vor dem Herunterfahren stark reduzieren. Normalerweise zeigt Shutdown alle 15 Minuten eine Warnung an und dann in den letzten 10 Minuten jede Minute, bis die I<Zeit> erreicht ist. Wenn I<-Q> angegeben ist, wird Shutdown nur warnen, wenn der Herunterfahrprozess tatsächlich stattfindet. Alle anderen Warnintervalle werden unterdrückt.

source: Tell B<init>(8) to wait I<sec> seconds between sending all processes the warning (SIGTERM) and the kill signal (SIGKILL), before changing to another runlevel. The default time, if no value is specified, between these two signals is three seconds. Warning: when shutdown calls init to perform the shutdown (the default behaviour), init checks to see if all processes have terminated and will stop waiting early once its children have all terminated. When shutdown is called with the I<-n> flag, it waits the full time specified (or three seconds) even if all other processes have terminated.
de: Informiert B<init>(8), I<Sek> Sekunden zwischen dem Senden des Warnsignals (SIGTERM) und des Tötungssignals (SIGKILL) an alle Prozesse zu warten, bevor in einen anderen Runlevel gewechselt wird. Die Vorgabezeit zwischen diesen zwei Signalen, falls kein Wert angegeben ist, ist drei Sekunden. Warnung: Wenn Shutdown Init aufruft, um das Herunterfahren durchzuführen (das Vorgabeverhalten), prüft Init, ob alle Prozesse beendet wurden und wird frühzeitig mit dem Warten aufhören, sobald alle Kindprozesse sich beendet haben. Wenn Shutdown mit dem Schalter I<-n> aufgerufen wird, wartet es die komplette angegebene Zeit (oder drei Sekunden), selbst falls alle anderen Prozesse sich beendet haben.

source: Note that if I</etc/shutdown.allow> is not present, the I<-a> argument is ignored.
de: Beachten Sie: Wenn I</etc/shutdown.allow> nicht vorhanden ist, wird der Schalter I<-a> ignoriert.
