Repository: sebras/manpages-l10n
Catalog: po/*/man8/sshd.8.po
Languages: de

source: Alternately, hostnames may be stored in a hashed form which hides host names and addresses should the file's contents be disclosed. Hashed hostnames start with a E<.Ql |> character. Only one hashed hostname may appear on a single line and none of the above negation or wildcard operators may be applied.
de: Alternativ können Rechnernamen in einer gehashten Form gespeichert werden. Diese versteckt die Rechnernamen und -adressen, sollte der Inhalt der Datei offengelegt werden. Gehashte Rechnernamen beginnen mit dem Zeichen E<.Ql |>. Auf einer Zeile darf nur ein einzelner gehashter Rechername auftauchen und die oben beschriebenen Verneinungs- und Platzhalteroperatoren dürfen nicht angewandt werden.

source: The keytype and base64-encoded key are taken directly from the host key; they can be obtained, for example, from E<.Pa /etc/ssh/ssh_host_rsa_key.pub>. The optional comment field continues to the end of the line, and is not used.
de: Der Schlüsseltyp und der Base64-kodierte Schlüssel werden direkt aus dem Rechnerschlüssel entnommen; sie können beispielsweise aus E<.Pa /etc/ssh/ssh_host_rsa_key.pub> erhalten werden. Das optionale Kommentarfeld geht bis zum Zeilenende und wird nicht verwandt.

source: Lines starting with E<.Ql #> and empty lines are ignored as comments.
de: Leere Zeilen und Zeilen, die mit E<.Ql #> beginnen, werden als Kommentare ignoriert.

source: When performing host authentication, authentication is accepted if any matching line has the proper key; either one that matches exactly or, if the server has presented a certificate for authentication, the key of the certification authority that signed the certificate. For a key to be trusted as a certification authority, it must use the E<.Dq @cert-authority> marker described above.
de: Bei der Durchführung von Rechner-Authentifizierung wird die Authentifizierung akzeptiert, falls auf einer Zeile der geeignete Schlüssel steht; entweder einer, der genau passt oder, falls der Server ein Zertifikat für die Authentifizierung präsentiert hat, der Schlüssel der Zertifizierungsstelle, die das Zertifikat signierte. Damit einem Schlüssel von einer Zertifizierungsstelle vertraut wird, muss er die oben beschriebene Markierung E<.Dq @cert-authority> verwenden.

source: The known hosts file also provides a facility to mark keys as revoked, for example when it is known that the associated private key has been stolen. Revoked keys are specified by including the E<.Dq @revoked> marker at the beginning of the key line, and are never accepted for authentication or as certification authorities, but instead will produce a warning from E<.Xr ssh 1> when they are encountered.
de: Die Datei der bekannten Rechner bietet auch die Möglichkeit, Schlüssel als widerrufen zu markieren, wenn beispielsweise bekannt ist, dass der zugehörige private Schlüssel gestohlen wurde. Widerrufene Schlüssel werden gekennzeichnet, indem die Markierung E<.Dq @revoked> am Anfang der Schlüsselzeile aufgenommen wird und diese werden für die Autorisierung oder als Zertifizierungsstelle niemals akzeptiert sondern führen zu einer Warnung durch E<.Xr ssh 1>, wenn sie angetroffen werden.

source: It is permissible (but not recommended) to have several lines or different host keys for the same names. This will inevitably happen when short forms of host names from different domains are put in the file. It is possible that the files contain conflicting information; authentication is accepted if valid information can be found from either file.
de: Es ist erlaubt (wird aber nicht empfohlen), mehrere Zeilen oder verschiedene Rechnerschlüssel für den gleichen Namen zu haben. Dies wird zwangsläufig passieren, wenn Kurzformen von Rechnernamen von verschiedenen Domains in der Datei abgelegt werden. Es ist möglich, dass die Dateien widersprüchliche Informationen enthalten; Authentifizierung wird akzeptiert, falls gültige Informationen in einer der Dateien gefunden werden können.

source: Note that the lines in these files are typically hundreds of characters long, and you definitely don't want to type in the host keys by hand. Rather, generate them by a script, E<.Xr ssh-keyscan 1> or by taking, for example, E<.Pa /etc/ssh/ssh_host_rsa_key.pub> and adding the host names at the front. E<.Xr ssh-keygen 1> also offers some basic automated editing for E<.Pa ~/.ssh/known_hosts> including removing hosts matching a host name and converting all host names to their hashed representations.
de: Beachten Sie, dass die Zeilen in diesen Dateien normalerweise Hunderte von Zeichen lang sind und sie garantiert nicht die Rechnerschlüssel händisch eingeben wollen. Erstellen Sie sie eher durch ein Skript, E<.Xr ssh-keyscan 1>, oder indem Sie beispielsweise E<.Pa /etc/ssh/ssh_host_rsa_key.pub> verwenden und vorne Rechnernamen hinzufügen. E<.Xr ssh-keygen 1> bietet auch grundlegende automatische Bearbeitung von E<.Pa ~/.ssh/known_hosts> an, einschließlich dem Entfernen von Rechnern, die auf einen Rechnernamen passen und die Umwandlung aller Rechnernamen in ihre gehashte Darstellung.

source: An example ssh_known_hosts file:
de: Beispiel für eine ssh_known_hosts-Datei:

source: # Comments allowed at start of line cvs.example.net,192.0.2.10 ssh-rsa AAAA1234.....= # A hashed hostname |1|JfKTdBh7rNbXkVAQCRp4OQoPfmI=|USECr3SWf1JUPsms5AqfD5QfxkM= ssh-rsa AAAA1234.....= # A revoked key @revoked * ssh-rsa AAAAB5W... # A CA key, accepted for any host in *.mydomain.com or *.mydomain.org @cert-authority *.mydomain.org,*.mydomain.com ssh-rsa AAAAB5W...
de: # Kommentare am Zeilenanfang erlaubt cvs.example.net,192.0.2.10 ssh-rsa AAAA1234……= # Ein gehashter Rechnername |1|JfKTdBh7rNbXkVAQCRp4OQoPfmI=|USECr3SWf1JUPsms5AqfD5QfxkM= ssh-rsa AAAA1234……= # Ein widerrufener Schlüssel @revoked * ssh-rsa AAAAB5W… # Ein CA-Schlüssel, akzeptiert für jeden Rechner in *.mydomain.com oder *.mydomain.org @cert-authority *.mydomain.org,*.mydomain.com ssh-rsa AAAAB5W…

source: FILES
de: DATEIEN

source: This file is used to suppress printing the last login time and E<.Pa /etc/motd>, if E<.Cm PrintLastLog> and E<.Cm PrintMotd>, respectively, are enabled. It does not suppress printing of the banner specified by E<.Cm Banner>.
de: Diese Datei wird zum Unterdrücken der Ausgabe der letzten Anmeldezeit und von E<.Pa /etc/motd>, falls E<.Cm PrintLastLog> bzw. E<.Cm PrintMotd> aktiviert wurden, verwandt. Es unterdrückt nicht die Ausgabe des durch E<.Cm Banner> festgelegten Spruchtextes.

source: This file is used for host-based authentication (see E<.Xr ssh 1> for more information). On some machines this file may need to be world-readable if the user's home directory is on an NFS partition, because E<.Nm> reads it as root. Additionally, this file must be owned by the user, and must not have write permissions for anyone else. The recommended permission for most machines is read/write for the user, and not accessible by others.
de: Diese Datei wird für Rechner-basierte Authentifizierung verwandt (siehe E<.Xr ssh 1> für weitere Informationen). Auf einigen Maschinen muss diese Datei für alle lesbar sein, falls sich das Home-Verzeichnis des Benutzers auf einer NFS-Partition befindet, da E<.Nm> es als Root liest. Zusätzlich muss diese Datei dem Benutzer gehören und darf für keinen anderen eine Schreibberechtigung enthalten. Die empfohlenen Berechtigungen für die meisten Maschinen ist lesen/schreiben für den Benutzer und keinen Zugriff für alle anderen.

source: This file is used in exactly the same way as E<.Pa .rhosts>, but allows host-based authentication without permitting login with rlogin/rsh.
de: Die Datei wird genau auf die gleiche Art wie E<.Pa .rhosts> verwandt, erlaubt aber Rechner-basierte Authentifizierung, ohne Anmeldungen mittels Rlogin/Rsh zu ermöglichen.

source: This directory is the default location for all user-specific configuration and authentication information. There is no general requirement to keep the entire contents of this directory secret, but the recommended permissions are read/write/execute for the user, and not accessible by others.
de: Das Verzeichnis ist der Standardort für alle benutzerspezifischen Konfigurations- und Authentifizierungsinformationen. Es gibt keine allgemeine Anforderung, sämtliche Informationen in diesem Verzeichnis geheim zu halten, aber die empfohlenen Berechtigungen sind Lesen/Schreiben/Ausführen für den Benutzer und kein Zugriff für andere.

source: Lists the public keys (DSA, ECDSA, Ed25519, RSA) that can be used for logging in as this user. The format of this file is described above. The content of the file is not highly sensitive, but the recommended permissions are read/write for the user, and not accessible by others.
de: Listet die öffentlichen Schlüssel (DSA, ECDSA, Ed25519, RSA) auf, die für die Anmeldung dieses Benutzers verwandt werden können. Das Format dieser Datei ist oben beschrieben. Der Inhalt der Datei ist nicht groß sensitiv, aber die empfohlenen Berechtigungen sind lesen/schreiben für den Benutzer und kein Zugriff für alle anderen.

source: If this file, the E<.Pa ~/.ssh> directory, or the user's home directory are writable by other users, then the file could be modified or replaced by unauthorized users. In this case, E<.Nm> will not allow it to be used unless the E<.Cm StrictModes> option has been set to E<.Dq no>.
de: Falls diese Datei, das Verzeichnis E<.Pa ~/.ssh> oder das Home-Verzeichnis des Benutzer für andere Benutzer schreibbar sind, dann könnte diese Datei durch nicht berechtigte Benutzer verändert oder ausgetauscht werden. In diesem Fall wird E<.Nm> die Verwendung nicht erlauben, außer die Option E<.Cm StrictModes> wurde auf E<.Dq no> gesetzt.

source: This file is read into the environment at login (if it exists). It can only contain empty lines, comment lines (that start with E<.Ql #>), and assignment lines of the form name=value. The file should be writable only by the user; it need not be readable by anyone else. Environment processing is disabled by default and is controlled via the E<.Cm PermitUserEnvironment> option.
de: Diese Datei wird (falls sie existiert) bei der Anmeldung in die Umgebung gelesen. Sie darf nur leere Zeilen, Kommentarzeilen (die mit E<.Ql #> beginnen) und Zuweisungszeilen der Form Name=Wert enthalten. Die Datei sollte nur für den Benutzer schreibbar sein; kein anderer Benutzer muss sie lesen können. Standardmäßig ist die Verarbeitung der Umgebung deaktiviert und dies wird über die Option E<.Cm PermitUserEnvironment> gesteuert.

source: Contains a list of host keys for all hosts the user has logged into that are not already in the systemwide list of known host keys. The format of this file is described above. This file should be writable only by root/the owner and can, but need not be, world-readable.
de: Enthält eine Liste von Rechnerschlüsseln für alle Rechner, bei denen sich der Benutzer angemeldet hat und die nicht bereits in der systemweiten Liste der bekannten Rechner enthalten sind. Das Format dieser Datei ist oben beschrieben. Diese Datei sollte nur für den Benutzer/root les-/schreibbar sein und muss nicht für alle lesbar sein.

source: Contains initialization routines to be run before the user's home directory becomes accessible. This file should be writable only by the user, and need not be readable by anyone else.
de: Enthält Initialisierungsroutinen, die ausgeführt werden sollen, bevor das Home-Verzeichnis des Benutzers zugreifbar wird. In diese Datei sollte nur der Benutzer schreiben können und sie muss nicht für andere lesbar sein.

source: This file is for host-based authentication (see E<.Xr ssh 1>). It should only be writable by root.
de: Diese Datei ist für Rechner-basierte Authentifizierung (siehe E<.Xr ssh 1>). Sie sollte nur für Root beschreibbar sein.

source: Contains Diffie-Hellman groups used for the "Diffie-Hellman Group Exchange" key exchange method. The file format is described in E<.Xr moduli 5>. If no usable groups are found in this file then fixed internal groups will be used.
de: Enthält Diffie-Hellman-Gruppen, die für die »Diffie-Hellman Group Exchange«-Schlüsselaustauschmethode verwandt werden. Das Dateiformat ist in E<.Xr moduli 5> beschrieben. Falls keine benutzbaren Gruppen in dieser Datei gefunden werden, dann werden interne Gruppen verwandt.

source: See E<.Xr motd 5>.
de: Siehe E<.Xr motd 5>.

source: If this file exists, E<.Nm> refuses to let anyone except root log in. The contents of the file are displayed to anyone trying to log in, and non-root connections are refused. The file should be world-readable.
de: Falls diese Datei existiert, wird E<.Nm> die Anmeldung aller Benutzer außer Root ablehnen. Der Inhalt der Datei wird allen angezeigt, die eine Anmeldung versuchen und alle Anmeldungen außer Root werden abgelehnt. Die Datei sollte für jeden Benutzer lesbar sein.

source: This file is used in exactly the same way as E<.Pa hosts.equiv>, but allows host-based authentication without permitting login with rlogin/rsh.
de: Die Datei wird genau auf die gleiche Art wie E<.Pa hosts.equiv> verwandt, erlaubt aber Rechner-basierte Authentifizierung, ohne Anmeldungen mittels Rlogin/Rsh zu ermöglichen.

source: These files contain the private parts of the host keys. These files should only be owned by root, readable only by root, and not accessible to others. Note that E<.Nm> does not start if these files are group/world-accessible.
de: Diese Dateien enthalten die privaten Anteile der Rechnerschlüssel. Diese Dateien sollten nur Root gehören, nur von Root lesbar sein und andere sollten keinen Zugriff darauf haben. Beachten Sie, dass E<.Nm> nicht startet, wenn auf diese Dateien von Gruppen oder anderen Benutzern zugegriffen werden kann.

source: These files contain the public parts of the host keys. These files should be world-readable but writable only by root. Their contents should match the respective private parts. These files are not really used for anything; they are provided for the convenience of the user so their contents can be copied to known hosts files. These files are created using E<.Xr ssh-keygen 1>.
de: Diese Dateien enthalten die öffentlichen Anteile der Rechnerschlüssel. Diese Dateien sollten von jedem gelesen werden können, aber nur für Root schreibbar sein. Ihre Inhalte sollten auf die entsprechenden privaten Teile passen. Diese Dateien werden nicht wirklich für etwas verwandt, sie sind zum Nutzen der Benutzer bereitgestellt, so dass ihr Inhalt in die Datei bekannter Rechner kopiert werden kann. Diese Dateien werden mittels E<.Xr ssh-keygen 1> erstellt.

source: Systemwide list of known host keys. This file should be prepared by the system administrator to contain the public host keys of all machines in the organization. The format of this file is described above. This file should be writable only by root/the owner and should be world-readable.
de: Systemweite Liste der Schlüssel der bekannten Rechner. Diese Datei sollte durch den Systemadministrator zusammengestellt werden, um die Rechner-Schlüssel aller Maschinen in der Organisation zu enthalten. Das Format der Datei wird oben beschrieben. Diese Datei sollte nur von Root/dem Eigentümer beschreibbar sein und von jedem gelesen werden können.

source: Contains configuration data for E<.Nm sshd>. The file format and configuration options are described in E<.Xr sshd_config 5>.
de: Enthält Konfigurationsdaten für E<.Nm sshd>. Das Dateiformat und die Konfigurationsoptionen sind in E<.Xr sshd_config 5> beschrieben.

source: Similar to E<.Pa ~/.ssh/rc>, it can be used to specify machine-specific login-time initializations globally. This file should be writable only by root, and should be world-readable.
de: Ähnlich wie E<.Pa ~/.ssh/rc> kann sie global zur Angabe maschinen-spezifischer Initialisierung zum Anmeldezeitpunkt verwandt werden. Diese Datei sollte nur durch Root beschreibbar und von jedem lesbar sein.

source: E<.Xr chroot 2> directory used by E<.Nm> during privilege separation in the pre-authentication phase. The directory should not contain any files and must be owned by root and not group or world-writable.
de: Das von E<.Nm> während der Privilegientrennung in der Vor-Authentifizierungsphase verwandte E<.Xr chroot 2>-Verzeichnis. Das Verzeichnis sollte keine Dateien enthalten und muss Root gehören und nicht für Gruppen oder alle anderen beschreibbar sein.

source: Contains the process ID of the E<.Nm> listening for connections (if there are several daemons running concurrently for different ports, this contains the process ID of the one started last). The content of this file is not sensitive; it can be world-readable.
de: Enthält die Prozesskennung des E<.Nm>, das auf Verbindungen wartet (falls es mehrere Daemons gibt, die gleichzeitig auf verschiedenen Ports laufen, enthält dies die Prozesskennung des zuletzt gestarteten). Der Inhalt dieser Datei ist nicht sensitiv; sie kann für alle lesbar sein.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: OpenSSH is a derivative of the original and free ssh 1.2.12 release by Tatu Ylonen. Aaron Campbell, Bob Beck, Markus Friedl, Niels Provos, Theo de Raadt and Dug Song removed many bugs, re-added newer features and created OpenSSH. Markus Friedl contributed the support for SSH protocol versions 1.5 and 2.0. Niels Provos and Markus Friedl contributed support for privilege separation.
de: OpenSSH ist eine Ableitung der ursprünglichen und freien SSH-1.2.12-Veröffentlichung durch E<.An Tatu Ylonen>. E<.An Aaron Campbell, Bob Beck, Markus Friedl, Niels Provos, Theo de Raadt> und E<.An Dug Song> entfernten viele Fehler, fügten neue Funktionalitäten wieder hinzu und erstellten OpenSSH. E<.An Markus Friedl> steuerte die Unterstützung für SSH-Protokollversion 1.5 und 2.0 bei. E<.An Niels Provos> und E<.An Markus Friedl> steuerten die Unterstützung für die Privilegientrennung bei.

source: $Mdocdate: August 27 2020 $
de: $Mdocdate: 27. August 2020 $

source: E<.Nm> (OpenSSH Daemon) is the daemon program for E<.Xr ssh 1>. Together these programs replace rlogin and rsh, and provide secure encrypted communications between two untrusted hosts over an insecure network.
de: E<.Nm> (OpenSSH Daemon) ist das Daemon-Programm für E<.Xr ssh 1>. Zusammen ersetzen diese Programme rlogin und rsh und stellen eine sichere verschlüsselte Kommunikation zwischen zwei nicht vertrauenswürdigen Rechnern über ein unsicheres Netzwerk bereit.

source: E<.Nm> listens for connections from clients. It is normally started at boot from E<.Pa /etc/init.d/ssh>. It forks a new daemon for each incoming connection. The forked daemons handle key exchange, encryption, authentication, command execution, and data exchange.
de: E<.Nm> wartet auf Anfragen von Clients. Es wird normalerweise beim Systemstart mittels E<.Pa /etc/init.d/ssh> gestartet. Es erstellt mit Fork einen neuen Deamon für jede Verbindung. Der mit Fork erstellte Daemon handhabt den Schlüsselaustausch, die Verschlüsselung, Authentifizierung, die Befehlsausführung und den Datenaustausch.

source: Specify the connection parameters to use for the E<.Fl T> extended test mode. If provided, any E<.Cm Match> directives in the configuration file that would apply are applied before the configuration is written to standard output. The connection parameters are supplied as keyword=value pairs and may be supplied in any order, either with multiple E<.Fl C> options or as a comma-separated list. The keywords are E<.Dq addr,> E<.Dq user>, E<.Dq host>, E<.Dq laddr>, E<.Dq lport>, and E<.Dq rdomain> and correspond to source address, user, resolved source host name, local address, local port number and routing domain respectively.
de: Legt die Verbindungsparameter fest, die für den erweiterten Testmodus E<.Fl T> verwandt werden sollen. Falls bereitgestellt, werden alle Direktiven E<.Cm Match> in der Konfigurationsdatei, die angewandt würden, angewandt, bevor die Konfigurationsdatei auf die Standardausgabe geschrieben wird. Die Verbindungsparameter werden als Schlüsselwort=Wert-Paare bereitgestellt und können in beliebiger Reihenfolge angegeben werden, entweder mit mehreren E<.Fl C>-Optionen oder als Kommata-getrennte Liste. Die Schlüsselwörter sind »addr«, »user«, »host«, »laddr«, »lport« und »rdomain« und entsprechen der Quelladresse, dem Benutzer, dem aufgelösten Quellrechnernamen, der lokalen Adresse, der lokalen Port-Nummer bzw. der Routing-Domain.

source: Debug mode. The server sends verbose debug output to standard error, and does not put itself in the background. The server also will not fork and will only process one connection. This option is only intended for debugging for the server. Multiple E<.Fl d> options increase the debugging level. Maximum is 3.
de: Fehlersuchmodus. Der Server schickt ausführliche Fehlersuchausgaben auf die Standardfehlerausgabe und legt sich selbst nicht in den Hintergrund. Der Server wird auch kein Fork durchführen und nur eine Verbindung verarbeiten. Diese Option ist nur zur Fehlersuche im Server gedacht. Mehrere Optionen E<.Fl d> erhöhen die Fehlersuchstufe. Maximum ist 3.

source: This option is used to specify the size of the field in the E<.Li utmp> structure that holds the remote host name. If the resolved host name is longer than E<.Ar len>, the dotted decimal value will be used instead. This allows hosts with very long host names that overflow this field to still be uniquely identified. Specifying E<.Fl u0> indicates that only dotted decimal addresses should be put into the E<.Pa utmp> file. E<.Fl u0> may also be used to prevent E<.Nm> from making DNS requests unless the authentication mechanism or configuration requires it. Authentication mechanisms that may require DNS include E<.Cm HostbasedAuthentication> and using a E<.Cm from="pattern-list"> option in a key file. Configuration options that require DNS include using a USER@HOST pattern in E<.Cm AllowUsers> or E<.Cm DenyUsers>.
de: Diese Option wird dazu verwandt, die Größe des Feldes in der Struktur E<.Li utmp> festzulegen, die den Namen des fernen Rechners enthält. Falls der aufgelöste Rechnername die angegebene E<.Ar Länge> überschreitet, wird stattdessen der gepunktete Dezimalwert verwandt. Dies erlaubt es, Rechner mit sehr langen Rechnernamen, bei denen dieser Wert überläuft, weiterhin eindeutig zu identifizieren. Die Festlegung von E<.Fl u0> zeigt an, dass nur gepunktete Dezimaladressen in die Datei E<.Pa utmp> abgelegt werden sollen. E<.Fl u0> kann auch dazu verwandt werden, E<.Nm> an der Durchführung von DNS-Anfragen zu hindern, außer der Authentifizierungsmechanismus oder die Konfiguration verlangt dies. E<.Cm HostbasedAuthentication> und die Verwendung der Option E<.Cm from="Musterliste"> gehören zu den Authentifizierungsmechanismen, die DNS benötigen. Die Verwendung eines BENUTZER@RECHNER-Musters in E<.Cm AllowUsers> oder E<.Cm DenyUsers> gehört zu den Konfigurationsoptionen, die DNS benötigen.

source: After this, the client either requests a shell or execution of a command. The sides then enter session mode. In this mode, either side may send data at any time, and such data is forwarded to/from the shell or command on the server side, and the user terminal in the client side.
de: Danach fordert der Client entweder eine Shell oder die Ausführung eines Befehls. Beide Seiten treten dann in den Sitzungsmodus ein. In diesem Modus kann jede Seite zu jeder Zeit Daten senden, und diese Daten werden dann an die Shell oder den Befehl auf der Server-Seite und dem Terminal auf der Client-Seite weitergeleitet (oder kommen von dort).
