Repository: sebras/manpages-l10n
Catalog: po/*/man8/sshd.8.po
Languages: de

source: $Mdocdate: September 11 2022 $
de: $Mdocdate: 11. September 2022 $

source: NAME
de: BEZEICHNUNG

source: SYNOPSIS
de: ÜBERSICHT

source: E<.Nm sshd> E<.Bk -words> E<.Op Fl 46DdeiqTt> E<.Op Fl C Ar connection_spec> E<.Op Fl c Ar host_certificate_file> E<.Op Fl E Ar log_file> E<.Op Fl f Ar config_file> E<.Op Fl g Ar login_grace_time> E<.Op Fl h Ar host_key_file> E<.Op Fl o Ar option> E<.Op Fl p Ar port> E<.Op Fl u Ar len> E<.Ek>
de: E<.Nm sshd> E<.Bk -words> E<.Op Fl 46DdeiqTt> E<.Op Fl C Ar Verbindungsfestlegung> E<.Op Fl c Ar Rechnerzertifikatsdatei> E<.Op Fl E Ar Protokolldatei> E<.Op Fl f Ar Konfigurationsdatei> E<.Op Fl g Ar Anmeldeaufschubzeit> E<.Op Fl h Ar Rechnerschlüsseldatei> E<.Op Fl o Ar Option> E<.Op Fl p Ar Port> E<.Op Fl u Ar Länge> E<.Ek>

source: DESCRIPTION
de: BESCHREIBUNG

source: E<.Nm> (OpenSSH Daemon) is the daemon program for E<.Xr ssh 1>. It provides secure encrypted communications between two untrusted hosts over an insecure network.
de: E<.Nm> (OpenSSH Daemon) ist das Daemon-Programm für E<.Xr ssh 1>. Es stellt eine sichere verschlüsselte Kommunikation zwischen zwei nicht vertrauenswürdigen Rechnern über ein unsicheres Netzwerk bereit.

source: E<.Nm> listens for connections from clients. It is normally started at boot from E<.Pa /etc/rc>. It forks a new daemon for each incoming connection. The forked daemons handle key exchange, encryption, authentication, command execution, and data exchange.
de: E<.Nm> wartet auf Anfragen von Clients. Es wird normalerweise beim Systemstart mittels E<.Pa /etc/rc> gestartet. Es erstellt mit Fork einen neuen Deamon für jede Verbindung. Der mit Fork erstellte Daemon handhabt den Schlüsselaustausch, die Verschlüsselung, Authentifizierung, die Befehlsausführung und den Datenaustausch.

source: E<.Nm> can be configured using command-line options or a configuration file (by default E<.Xr sshd_config 5>); command-line options override values specified in the configuration file. E<.Nm> rereads its configuration file when it receives a hangup signal, E<.Dv SIGHUP>, by executing itself with the name and options it was started with, e.g.\& E<.Pa /usr/sbin/sshd>.
de: E<.Nm> kann mittels Befehlszeilenoptionen oder einer Konfigurationsdatei (standardmäßig E<.Xr sshd_config 5>) konfiguriert werden; Befehlszeilenoptionen setzen die in der Konfigurationsdatei gesetzten Werte außer Kraft. E<.Nm> liest seine Konfigurationsdatei neu, wenn er ein Auflegen-Signal, E<.Dv SIGHUP>, erhält, indem er sich selbst mit dem Namen und den Optionen ausführt, mit denen er gestartet wurde, z.B.\& E<.Pa /usr/sbin/sshd>.

source: The options are as follows:
de: Folgende Optionen stehen zur Verfügung:

source: Forces E<.Nm> to use IPv4 addresses only.
de: Erzwingt, dass E<.Nm> nur IPv4-Adressen verwendet.

source: Forces E<.Nm> to use IPv6 addresses only.
de: Erzwingt, dass E<.Nm> nur IPv6-Adressen verwendet.

source: Fl C Ar connection_spec
de: Fl C Ar Verbindungsfestlegung

source: Specify the connection parameters to use for the E<.Fl T> extended test mode. If provided, any E<.Cm Match> directives in the configuration file that would apply are applied before the configuration is written to standard output. The connection parameters are supplied as keyword=value pairs and may be supplied in any order, either with multiple E<.Fl C> options or as a comma-separated list. The keywords are E<.Dq addr>, E<.Dq user>, E<.Dq host>, E<.Dq laddr>, E<.Dq lport>, and E<.Dq rdomain> and correspond to source address, user, resolved source host name, local address, local port number and routing domain respectively.
de: Legt die Verbindungsparameter fest, die für den erweiterten Testmodus E<.Fl T> verwandt werden sollen. Falls bereitgestellt, werden alle Direktiven E<.Cm Match> in der Konfigurationsdatei, die angewandt würden, angewandt, bevor die Konfigurationsdatei auf die Standardausgabe geschrieben wird. Die Verbindungsparameter werden als Schlüsselwort=Wert-Paare bereitgestellt und können in beliebiger Reihenfolge angegeben werden, entweder mit mehreren E<.Fl C>-Optionen oder als Kommata-getrennte Liste. Die Schlüsselwörter sind »addr«, »user«, »host«, »laddr«, »lport« und »rdomain« und entsprechen der Quelladresse, dem Benutzer, dem aufgelösten Quellrechnernamen, der lokalen Adresse, der lokalen Port-Nummer bzw. der Routing-Domain.

source: Fl c Ar host_certificate_file
de: Fl c Ar Rechnerzertifikatsdatei

source: Specifies a path to a certificate file to identify E<.Nm> during key exchange. The certificate file must match a host key file specified using the E<.Fl h> option or the E<.Cm HostKey> configuration directive.
de: Legt den Pfad zu einer Zertifikatsdatei fest, um E<.Nm> während des Schlüsselaustausches zu identifizieren. Die Zertifikatsdatei muss auf eine Rechnerschlüsseldatei passen, die mit der Option E<.Fl h> oder der Konfigurationsdirektive E<.Cm HostKey> festgelegt wird.

source: When this option is specified, E<.Nm> will not detach and does not become a daemon. This allows easy monitoring of E<.Nm sshd>.
de: Wenn diese Option angegeben ist, wird sich E<.Nm> nicht abtrennen und kein Daemon werden. Dies erlaubt das einfache Überwachen von E<.Nm sshd>.

source: Debug mode. The server sends verbose debug output to standard error, and does not put itself in the background. The server also will not E<.Xr fork 2> and will only process one connection. This option is only intended for debugging for the server. Multiple E<.Fl d> options increase the debugging level. Maximum is 3.
de: Fehlersuchmodus. Der Server schickt ausführliche Fehlersuchausgaben auf die Standardfehlerausgabe und legt sich selbst nicht in den Hintergrund. Der Server wird auch kein E<.Xr fork 2> durchführen und nur eine Verbindung verarbeiten. Diese Option ist nur zur Fehlersuche im Server gedacht. Mehrere Optionen E<.Fl d> erhöhen die Fehlersuchstufe. Maximum ist 3.

source: Fl E Ar log_file
de: Fl E Ar Protokolldatei

source: Append debug logs to E<.Ar log_file> instead of the system log.
de: Hängt Fehlersuchprotokolle an E<.Ar Protokolldatei> statt an das Systemprotokoll an.

source: Write debug logs to standard error instead of the system log.
de: Schreibt Fehlersuchprotokolle in die Standardfehlerausgabe statt in das Systemprotokoll.

source: Fl f Ar config_file
de: Fl f Ar Konfigurationsdatei

source: Specifies the name of the configuration file. The default is E<.Pa /etc/ssh/sshd_config>. E<.Nm> refuses to start if there is no configuration file.
de: Gibt den Namen der Konfigurationsdatei an. Die Vorgabe ist E<.Pa /etc/ssh/sshd_config>. E<.Nm> verweigert den Start, falls es keine Konfigurationsdatei gibt.

source: Fl g Ar login_grace_time
de: Fl g Ar Anmeldeaufschubzeit

source: Gives the grace time for clients to authenticate themselves (default 120 seconds). If the client fails to authenticate the user within this many seconds, the server disconnects and exits. A value of zero indicates no limit.
de: Gibt die Aufschubzeit an, die Clients für die Authentifizierung haben (standardmäßig 120 Sekunden). Falls es dem Client nicht gelingt, sich innerhalb der angegebenen Sekunden zu authentifizieren, löst der Server die Verbindung und beendet sich. Ein Wert von 0 zeigt an, dass es keine Begrenzung geben soll.

source: Fl h Ar host_key_file
de: Fl h Ar Rechnerschlüsseldatei

source: Specifies a file from which a host key is read. This option must be given if E<.Nm> is not run as root (as the normal host key files are normally not readable by anyone but root). The default is E<.Pa /etc/ssh/ssh_host_ecdsa_key>, E<.Pa /etc/ssh/ssh_host_ed25519_key> and E<.Pa /etc/ssh/ssh_host_rsa_key>. It is possible to have multiple host key files for the different host key algorithms.
de: Gibt eine Datei an, aus der der Rechnerschlüssel gelesen wird. Diese Option muss angegeben werden, falls E<.Nm> nicht als root ausgeführt wird (da die normalen Rechnerschlüsseldateien normalerweise nur von root lesbar sind). Die Vorgabe ist E<.Pa /etc/ssh/ssh_host_ecdsa_key>, E<.Pa /etc/ssh/ssh_host_ed25519_key> und E<.Pa /etc/ssh/ssh_host_rsa_key>. Es ist möglich, für die einzelnen Rechnerschlüsselalgorithmen jeweils mehrere Rechnerschlüsseldateien zu haben.

source: Specifies that E<.Nm> is being run from E<.Xr inetd 8>.
de: Gibt an, dass E<.Nm> von E<.Xr inetd 8> ausgeführt wird.

source: Can be used to give options in the format used in the configuration file. This is useful for specifying options for which there is no separate command-line flag. For full details of the options, and their values, see E<.Xr sshd_config 5>.
de: Kann dazu verwandt werden, Optionen im Format der Konfigurationsdatei anzugeben. Dies ist für Optionen nützlich, für die es keinen separaten Befehlszeilenschalter gibt. Für die vollständigen Details dieser Optionen und ihrer Werte siehe E<.Xr sshd_config 5>.

source: Specifies the port on which the server listens for connections (default 22). Multiple port options are permitted. Ports specified in the configuration file with the E<.Cm Port> option are ignored when a command-line port is specified. Ports specified using the E<.Cm ListenAddress> option override command-line ports.
de: Legt den Port fest, auf dem der Server auf Anfragen wartet (standardmäßig 22). Mehrere Port-Optionen sind erlaubt. In der Konfiguration mittels der Option E<.Cm Port> festgelegte Ports werden ignoriert, wenn ein Port auf der Befehlszeile angegeben wird. Ports, die mit der Option E<.Cm ListenAddress> festgelegt werden, setzen auf der Befehlszeile angegebene außer Kraft.

source: Quiet mode. Nothing is sent to the system log. Normally the beginning, authentication, and termination of each connection is logged.
de: Stiller Modus. Es wird nichts an das Systemprotokoll gesandt. Normalerweise wird der Beginn, die Authentifizierung und die Beendigung jeder Verbindung protokolliert.

source: Extended test mode. Check the validity of the configuration file, output the effective configuration to stdout and then exit. Optionally, E<.Cm Match> rules may be applied by specifying the connection parameters using one or more E<.Fl C> options.
de: Erweiterter Testmodus. Prüft die Gültigkeit der Konfigurationsdatei, gibt die wirksame Konfiguration auf der Standardausgabe aus und beendet sich. Optional können die E<.Cm Match>-Regeln angewandt werden, indem die Verbindungsparameter mittels einer oder mehrere Optionen E<.Fl C> angegeben werden.

source: Test mode. Only check the validity of the configuration file and sanity of the keys. This is useful for updating E<.Nm> reliably as configuration options may change.
de: Testmodus. Prüft nur die Gültigkeit der Konfigurationsdatei und die Plausibilität der Schlüssel. Dies ist zur zuverlässigen Aktualisierung von E<.Nm> nützlich, da sich Konfigurationsoptionen ändern könnten.

source: Fl u Ar len
de: Fl u Ar Länge

source: This option is used to specify the size of the field in the E<.Vt utmp> structure that holds the remote host name. If the resolved host name is longer than E<.Ar len>, the dotted decimal value will be used instead. This allows hosts with very long host names that overflow this field to still be uniquely identified. Specifying E<.Fl u0> indicates that only dotted decimal addresses should be put into the E<.Pa utmp> file. E<.Fl u0> may also be used to prevent E<.Nm> from making DNS requests unless the authentication mechanism or configuration requires it. Authentication mechanisms that may require DNS include E<.Cm HostbasedAuthentication> and using a E<.Cm from="pattern-list"> option in a key file. Configuration options that require DNS include using a USER@HOST pattern in E<.Cm AllowUsers> or E<.Cm DenyUsers>.
de: Diese Option wird dazu verwandt, die Größe des Feldes in der Struktur E<.Vt utmp> festzulegen, die den Namen des fernen Rechners enthält. Falls der aufgelöste Rechnername die angegebene E<.Ar Länge> überschreitet, wird stattdessen der gepunktete Dezimalwert verwandt. Dies erlaubt es, Rechner mit sehr langen Rechnernamen, bei denen dieser Wert überläuft, weiterhin eindeutig zu identifizieren. Die Festlegung von E<.Fl u0> zeigt an, dass nur gepunktete Dezimaladressen in die Datei E<.Pa utmp> abgelegt werden sollen. E<.Fl u0> kann auch dazu verwandt werden, E<.Nm> an der Durchführung von DNS-Anfragen zu hindern, außer der Authentifizierungsmechanismus oder die Konfiguration verlangt dies. E<.Cm HostbasedAuthentication> und die Verwendung der Option E<.Cm from="Musterliste"> gehören zu den Authentifizierungsmechanismen, die DNS benötigen. Die Verwendung eines BENUTZER@RECHNER-Musters in E<.Cm AllowUsers> oder E<.Cm DenyUsers> gehört zu den Konfigurationsoptionen, die DNS benötigen.

source: AUTHENTICATION
de: AUTHENTIFIZIERUNG

source: The OpenSSH SSH daemon supports SSH protocol 2 only. Each host has a host-specific key, used to identify the host. Whenever a client connects, the daemon responds with its public host key. The client compares the host key against its own database to verify that it has not changed. Forward secrecy is provided through a Diffie-Hellman key agreement. This key agreement results in a shared session key. The rest of the session is encrypted using a symmetric cipher. The client selects the encryption algorithm to use from those offered by the server. Additionally, session integrity is provided through a cryptographic message authentication code (MAC).
de: Der OpenSSH-SSH-Daemon unterstützt nur SSH-Protokoll 2. Jeder Rechner verfügt über einen Rechner-spezifischen Schlüssel, der diesen Rechner identifiziert. Jedes Mal, wenn sich ein Client verbindet, antwortet der Daemon mit seinem öffentlichen Rechnerschlüssel. Der Client vergleicht den Rechnerschlüssel mit seiner eigenen Datenbank, um sicherzustellen, dass er sich nicht geändert hat. Durch eine Diffie-Hellman-Schlüsselvereinbarung wird Vorwärtssicherheit bereitgestellt. Diese Schlüsselvereinbarung führt zu einem gemeinsam benutzten Sitzungsschlüssel. Der Rest der Sitzung wird mit einer symmetrischen Chiffre verschlüsselt. Der Client wählt aus den vom Server angebotenen Chiffren den Verschlüsselungsalgorithmus aus. Zusätzlich wird die Sitzungsintegrität mittels eines kryptographischen Nachrichtenauthentifizierungscodes (MAC) bereitgestellt.

source: Finally, the server and the client enter an authentication dialog. The client tries to authenticate itself using host-based authentication, public key authentication, challenge-response authentication, or password authentication.
de: Schließlich treten der Server und der Client in einen Authentifizierungsdialog. Der Client versucht sich selbst mittels Rechner-basierter, asymmetrischer, challenge-response oder Passwort-basierter Authentifizierung zu authentifizieren.

source: Regardless of the authentication type, the account is checked to ensure that it is accessible. An account is not accessible if it is locked, listed in E<.Cm DenyUsers> or its group is listed in E<.Cm DenyGroups> \&. The definition of a locked account is system dependent. Some platforms have their own account database (eg AIX) and some modify the passwd field ( E<.Ql \&*LK\&*> on Solaris and UnixWare, E<.Ql \&*> on HP-UX, containing E<.Ql Nologin> on Tru64, a leading E<.Ql \&*LOCKED\&*> on FreeBSD and a leading E<.Ql \&!> on most Linuxes). If there is a requirement to disable password authentication for the account while allowing still public-key, then the passwd field should be set to something other than these values (eg E<.Ql NP> or E<.Ql \&*NP\&*> ).
de: Unabhängig vom Authentifizierungstyp wird das Konto geprüft, um sicherzustellen, dass es zugreifbar ist. Ein Konto ist nicht zugreifbar, falls es gesperrt, in E<.Cm DenyUsers> oder seine Gruppe in in E<.Cm DenyGroups> aufgeführt ist. Die Definition eines gesperrten Kontos ist systemabhängig. Einige Plattformen haben ihre eigene Kontendatenbank (z.B. AIX) und andere ändern das Passwd-Feld (›*LK*‹ auf Solaris und UnixWare, ›\&*‹ auf HP-UX, enthält ›NOLOGIN‹ auf Tru64, ein ›LOCKED‹ am Anfang auf FreeBSD und ein ›\&!‹ am Anfang bei den meisten Linuxen). Falls die Notwendigkeit besteht, Passwort-basierende Authentifizierung zu deaktivieren, aber weiterhin asymmetrische Authentifizierung zu erlauben, dann sollte das Passwd-Feld auf etwas anderes als diese Werte gesetzt werden (z.B. ›NP‹ oder ›\&*NP\&*‹).

source: If the client successfully authenticates itself, a dialog for preparing the session is entered. At this time the client may request things like allocating a pseudo-tty, forwarding X11 connections, forwarding TCP connections, or forwarding the authentication agent connection over the secure channel.
de: Falls sich der Client erfolgreich authentifiziert, wird ein Dialog zur Vorbereitung der Sitzung begonnen. Zu diesem Zeitpunkt kann der Client Dinge wie die Zuweisung eines Pseudo-TTY, die Weiterleitung von X11-Verbindungen, die Weiterleitung von TCP-Verbindungen oder die Weiterleitung der Verbindung des Authentifizierungsvermittlers über den sicheren Kanal erbitten.

source: After this, the client either requests an interactive shell or execution or a non-interactive command, which E<.Nm> will execute via the user's shell using its E<.Fl c> option. The sides then enter session mode. In this mode, either side may send data at any time, and such data is forwarded to/from the shell or command on the server side, and the user terminal in the client side.
de: Danach fordert der Client entweder eine interaktive Shell oder die Ausführung eines nichtinteraktiven Befehls, den E<.Nm> mittels der Shell des Benutzers über die Option E<.Fl c> ausführt. Beide Seiten treten dann in den Sitzungsmodus ein. In diesem Modus kann jede Seite zu jeder Zeit Daten senden, und diese Daten werden dann an die Shell oder den Befehl auf der Server-Seite und dem Terminal auf der Client-Seite weitergeleitet (oder kommen von dort).

source: When the user program terminates and all forwarded X11 and other connections have been closed, the server sends command exit status to the client, and both sides exit.
de: Wenn sich das Benutzerprogramm beendet und alle weitergeleiteten X11- und anderen Verbindungen geschlossen wurden, sendet der Server den Exit-Status an den Client und beide Seiten beenden sich.

source: LOGIN PROCESS
de: ANMELDEPROZESS

source: When a user successfully logs in, E<.Nm> does the following:
de: Wenn sich ein Benutzer erfolgreich anmeldet, macht E<.Nm> Folgendes:

source: If the login is on a tty, and no command has been specified, prints last login time and E<.Pa /etc/motd> (unless prevented in the configuration file or by E<.Pa ~/.hushlogin>; see the E<.Sx FILES> section).
de: Falls die Anmeldung auf einem TTY erfolgt und kein Befehl angegeben wurde, wird die letzte Anmeldezeit und E<.Pa /etc/motd> ausgegeben (außer dies wird in der Konfigurationsdatei oder durch E<.Pa ~/.hushlogin> verhindert, siehe den Abschnitt E<.Sx DATEIEN>).

source: If the login is on a tty, records login time.
de: Falls die Anmeldung auf einem TTY erfolgt, wird die Anmeldezeit aufgezeichnet.

source: Checks E<.Pa /etc/nologin>; if it exists, prints contents and quits (unless root).
de: E<.Pa /etc/nologin> wird überprüft; falls es existiert, wird der Inhalt ausgegeben und die Verbindung beendet (außer bei root).

source: Changes to run with normal user privileges.
de: Die Ausführung wird auf normale Benutzerprivilegien umgeschaltet.

source: Sets up basic environment.
de: Eine grundlegende Umgebung wird eingerichtet.

source: Reads the file E<.Pa ~/.ssh/environment>, if it exists, and users are allowed to change their environment. See the E<.Cm PermitUserEnvironment> option in E<.Xr sshd_config 5>.
de: Die Datei E<.Pa ~/.ssh/environment>, falls sie existiert, wird eingelesen und Benutzern wird das Ändern ihrer Umgebung erlaubt. Siehe die Option E<.Cm PermitUserEnvironment> in E<.Xr sshd_config 5>.

source: Changes to user's home directory.
de: Es wird in das Home-Verzeichnis des Benutzers gewechselt.

source: If E<.Pa ~/.ssh/rc> exists and the E<.Xr sshd_config 5> E<.Cm PermitUserRC> option is set, runs it; else if E<.Pa /etc/ssh/sshrc> exists, runs it; otherwise runs E<.Xr xauth 1>. The E<.Dq rc> files are given the X11 authentication protocol and cookie in standard input. See E<.Sx SSHRC>, below.
de: Falls die Datei E<.Pa ~/.ssh/rc> existiert und die Option E<.Cm PermitUserRC> in E<.Xr sshd_config 5> gesetzt ist, wird die Datei ausgeführt, ansonsten falls E<.Pa /etc/ssh/sshrc> existiert, wird diese ausgeführt, andernfalls wird E<.Xr xauth 1> ausgeführt. Den E<.Dq rc>-Dateien wird das X11-Authentifizierungsprotokoll und den Cookie auf der Standardeingabe übergeben. Siehe nachfolgenden Abschnitt E<.Sx SSHRC>.

source: Runs user's shell or command. All commands are run under the user's login shell as specified in the system password database.
de: Die Shell des Benutzers oder der Befehl wird ausgeführt. Alle Befehle werden unter der Anmelde-Shell des Benutzers ausgeführt, wie diese in der Systempasswortdatenbank festgelegt ist.

source: If the file E<.Pa ~/.ssh/rc> exists, E<.Xr sh 1> runs it after reading the environment files but before starting the user's shell or command. It must not produce any output on stdout; stderr must be used instead. If X11 forwarding is in use, it will receive the "proto cookie" pair in its standard input (and E<.Ev DISPLAY> in its environment). The script must call E<.Xr xauth 1> because E<.Nm> will not run xauth automatically to add X11 cookies.
de: Falls die Datei E<.Pa ~/.ssh/rc> existiert, führt E<.Xr sh 1> sie nach dem Einlesen der Umgebungsvariablen, aber vor dem Starten der Shell des Benutzers oder des Befehls aus. Sie darf keine Ausgabe auf der Standardausgabe erstellen, stattdessen muss Stderr verwandt werden. Falls X11-Weiterleitung in Benutzung ist, wird sie das »proto cookie«-Paar in seiner Standardeingabe (und E<.Ev DISPLAY> in seiner Umgebung) erhalten. Das Skript muss E<.Xr xauth 1> aufrufen, da E<.Nm> Xauth nicht automatisch aufrufen wird, um X11-Cookies hinzuzufügen.

source: The primary purpose of this file is to run any initialization routines which may be needed before the user's home directory becomes accessible; AFS is a particular example of such an environment.
de: Der Hauptzweck dieser Datei besteht darin, sämtliche Initialisierungsroutinen auszuführen, die benötigt werden, um auf das Home-Verzeichnis des Benutzers zuzugreifen; AFS ist ein besonderes Beispiel für solch eine Umgebung.

source: This file will probably contain some initialization code followed by something similar to:
de: Diese Datei wird wahrscheinlich einigen Initialisierungs-Code enthalten, dem etwas ähnlicher Art folgt:

source: If this file does not exist, E<.Pa /etc/ssh/sshrc> is run, and if that does not exist either, xauth is used to add the cookie.
de: Falls diese Datei nicht existiert, wird E<.Pa /etc/ssh/sshrc> ausgeführt und falls auch diese Datei nicht existiert, wird Xauth verwandt, um den Cookie hinzuzufügen.

source: AUTHORIZED_KEYS FILE FORMAT
de: AUTHORIZED_KEYS-DATEIFORMAT
