Repository: sebras/manpages-l10n
Catalog: po/*/man8/sshd.8.po
Languages: de

source: If E<.Pa ~/.ssh/rc> exists and the E<.Xr sshd_config 5> E<.Cm PermitUserRC> option is set, runs it; else if E<.Pa /etc/ssh/sshrc> exists, runs it; otherwise runs xauth. The E<.Dq rc> files are given the X11 authentication protocol and cookie in standard input. See E<.Sx SSHRC>, below.
de: Falls die Datei E<.Pa ~/.ssh/rc> existiert und die Option E<.Cm PermitUserRC> in E<.Xr sshd_config 5> gesetzt ist, wird die Datei ausgeführt, ansonsten falls E<.Pa /etc/ssh/sshrc> existiert, wird diese ausgeführt, andernfalls wird Xauth ausgeführt. Den E<.Dq rc>-Dateien wird das X11-Authentifizierungsprotokoll und den Cookie auf der Standardeingabe übergeben. Siehe nachfolgenden Abschnitt E<.Sx SSHRC>.

source: Specifies a time after which the key will not be accepted. The time may be specified as a YYYYMMDD date or a YYYYMMDDHHMM[SS] time in the system time-zone.
de: Legt eine Zeit fest, nach der der Schlüssel nicht akzeptiert wird. Die Zeit kann als Datum YYYYMMDD oder eine Zeit YYYYMMDDHHMM[SS] in der Systemzeitzone festgelegt werden.

source: Enable all restrictions, i.e. disable port, agent and X11 forwarding, as well as disabling PTY allocation and execution of E<.Pa ~/.ssh/rc>. If any future restriction capabilities are added to authorized_keys files they will be included in this set.
de: Aktiviert alle Beschränkungen, d.h. deaktiviert die Weiterleitung vom Port, Vermittler und X11, sowie deaktiviert die PTY-Zuweisung und die Ausführung von E<.Pa ~/.ssh/rc>. Falls zukünftig weitere Beschränkungsfähigkeiten zu den authorized_keys-Dateien hinzugefügt werden, werden sie in diese Menge aufgenommen.

source: # Comments allowed at start of line ssh-rsa AAAAB3Nza...LiPk== user@example.net from="*.sales.example.net,!pc.sales.example.net" ssh-rsa AAAAB2...19Q== john@example.net command="dump /home",no-pty,no-port-forwarding ssh-rsa AAAAC3...51R== example.net permitopen="192.0.2.1:80",permitopen="192.0.2.2:25" ssh-rsa AAAAB5...21S== permitlisten="localhost:8080",permitopen="localhost:22000" ssh-rsa AAAAB5...21S== tunnel="0",command="sh /etc/netstart tun0" ssh-rsa AAAA...== jane@example.net restrict,command="uptime" ssh-rsa AAAA1C8...32Tv== user@example.net restrict,pty,command="nethack" ssh-rsa AAAA1f8...IrrC5== user@example.net no-touch-required sk-ecdsa-sha2-nistp256@openssh.com AAAAInN...Ko== user@example.net
de: # Am Anfang der Zeile sind Kommentare erlaubt ssh-rsa AAAAB3Nza…LiPk== user@example.net from="*.sales.example.net,!pc.sales.example.net" ssh-rsa AAAAB2…19Q== john@example.net command="dump /home",no-pty,no-port-forwarding ssh-rsa AAAAC3…51R== example.net permitopen="192.0.2.1:80",permitopen="192.0.2.2:25" ssh-rsa AAAAB5…21S== permitlisten="localhost:8080",permitopen="localhost:22000" ssh-rsa AAAAB5…21S== tunnel="0",command="sh /etc/netstart tun0" ssh-rsa AAAA…== jane@example.net restrict,command="uptime" ssh-rsa AAAA1C8…32Tv== user@example.net restrict,pty,command="nethack" ssh-rsa AAAA1f8…IrrC5== user@example.net no-touch-required sk-ecdsa-sha2-nistp256@openssh.com AAAAInN…Ko== user@example.net

source: Each line in these files contains the following fields: markers (optional), hostnames, keytype, base64-encoded key, comment. The fields are separated by spaces.
de: Jede Zeile in diesen Dateien enthält die folgenden Felder: Markierungen (optional), Rechnername, Schlüsseltyp, Base64-kodierter Schlüssel, Kommentar. Die Felder sind durch Leerzeichen getrennt.

source: # Comments allowed at start of line closenet,...,192.0.2.53 1024 37 159...93 closenet.example.net cvs.example.net,192.0.2.10 ssh-rsa AAAA1234.....= # A hashed hostname |1|JfKTdBh7rNbXkVAQCRp4OQoPfmI=|USECr3SWf1JUPsms5AqfD5QfxkM= ssh-rsa AAAA1234.....= # A revoked key @revoked * ssh-rsa AAAAB5W... # A CA key, accepted for any host in *.mydomain.com or *.mydomain.org @cert-authority *.mydomain.org,*.mydomain.com ssh-rsa AAAAB5W...
de: # Kommentare am Zeilenanfang erlaubt closenet,…,192.0.2.53 1024 37 159…93 closenet.example.net cvs.example.net,192.0.2.10 ssh-rsa AAAA1234……= # Ein gehashter Rechnername |1|JfKTdBh7rNbXkVAQCRp4OQoPfmI=|USECr3SWf1JUPsms5AqfD5QfxkM= ssh-rsa AAAA1234……= # Ein widerrufener Schlüssel @revoked * ssh-rsa AAAAB5W… # Ein CA-Schlüssel, akzeptiert für jeden Rechner in *.mydomain.com oder *.mydomain.org @cert-authority *.mydomain.org,*.mydomain.com ssh-rsa AAAAB5W…

source: Access controls that should be enforced by tcp-wrappers are defined here. Further details are described in E<.Xr hosts_access 5>.
de: Zugriffssteuerungen, die durch tcp-wrappers erzwungen werden sollen, sind hier definiert. Weitere Details sind in E<.Xr hosts_access 5> beschrieben.

source: $Mdocdate: March 31 2022 $
de: $Mdocdate: 31. März 2022 $

source: $Mdocdate: September 10 2021 $
de: $Mdocdate: 10. September 2021 $

source: Finally, the server and the client enter an authentication dialog. The client tries to authenticate itself using host-based authentication, public key authentication, GSSAPI authentication, challenge-response authentication, or password authentication.
de: Schließlich treten der Server und Client in einen Authentifizierungsdialog ein. Der Client versucht, sich mittels Rechner-basierter Authentifizierung, asymmetrischer Authentifizierung, GSSAPI-Authentifizierung, Challenge-Response-Authentifizierung oder Passwort-Authentifizierung zu authentifizieren.

source: These files enforce GSSAPI/Kerberos authentication access control. Further details are described in E<.Xr ksu 1>. The location of the k5login file depends on the configuration option E<.Cm k5login_directory> in the E<.Xr krb5.conf 5>.
de: Diese Dateien erzwingen das GSSAPI/Kerberos-Authentifizierungsprotokoll. Weitere Details sind in E<.Xr ksu 1> beschrieben. Der Ort der k5login-Datei hängt von der Konfigurationsoption E<.Cm k5login_directory> in E<.Xr krb5.conf 5> ab.

source: IPv6 address can be used everywhere where IPv4 address. In all entries must be the IPv6 address enclosed in square brackets. Note: The square brackets are metacharacters for the shell and must be escaped in shell.
de: IPv6-Adressen können überall verwandt werden, wo dies IPv4-Adressen können. In allen Einträgen müssen IPv6-Adressen in eckige Klammern eingeschlossen werden. Hinweis: Die eckigen Klammern sind Meta-Zeichen für die Shell und müssen in der Shell maskiert werden.
