Repository: sebras/manpages-l10n
Catalog: po/*/man8/sshd.8.po
Languages: de

source: E<.Cm AuthorizedKeysFile> specifies the files containing public keys for public key authentication; if this option is not specified, the default is E<.Pa ~/.ssh/authorized_keys> and E<.Pa ~/.ssh/authorized_keys2>. Each line of the file contains one key (empty lines and lines starting with a E<.Ql #> are ignored as comments). Public keys consist of the following space-separated fields: options, keytype, base64-encoded key, comment. The options field is optional. The supported key types are:
de: E<.Cm AuthorizedKeysFile> legt die Dateien fest, die öffentliche Schlüssel für die asymmetrische Authentifizierung enthalten. Falls diese Option nicht festgelegt ist, ist die Vorgabe E<.Pa ~/.ssh/authorized_keys> und E<.Pa ~/.ssh/authorized_keys2>. Jede Zeile der Datei enthält einen Schlüssel (leere Zeilen und Zeilen, die mit einem E<.Ql #> beginnen, werden als Kommentare ignoriert). Öffentliche Schlüssel bestehen aus den folgenden, durch Leerzeichen getrennten Feldern: Optionen, Schlüsseltyp, Base64-kodierter Schlüssel, Kommentar. Das Optionenfeld ist optional. Die unterstützten Schlüsseltypen sind:

source: The comment field is not used for anything (but may be convenient for the user to identify the key).
de: Das Kommentarfeld wird für nichts verwandt (kann aber für den Benutzer zur Identifikation des Schlüssels nützlich sein).

source: Note that lines in this file can be several hundred bytes long (because of the size of the public key encoding) up to a limit of 8 kilobytes, which permits RSA keys up to 16 kilobits. You don't want to type them in; instead, copy the E<.Pa id_dsa.pub>, E<.Pa id_ecdsa.pub>, E<.Pa id_ecdsa_sk.pub>, E<.Pa id_ed25519.pub>, E<.Pa id_ed25519_sk.pub>, or the E<.Pa id_rsa.pub> file and edit it.
de: Beachten Sie, dass diese Zeilen in diesen Dateien mehrere hundert Byte lang sein können (aufgrund der Größe der Kodierung des öffentlichen Schlüssels), bis zu einer Grenze von 8 Kilobyte, wodurch RSA-Schlüssel bis zu 16 Kilobit erlaubt sind. Normalerweise geben Sie diese nicht ein, sondern kopieren die Datei E<.Pa id_dsa.pub>, E<.Pa id_ecdsa.pub>, E<.Pa id_ecdsa_sk.pub>, E<.Pa id_ed25519.pub>, E<.Pa id_ed25519_sk.pub> oder E<.Pa id_rsa.pub> und bearbeiten sie.

source: E<.Nm> enforces a minimum RSA key modulus size of 1024 bits.
de: E<.Nm> erzwingt eine minimale RSA-Schlüssel-Modulogröße von 1024 Bit.

source: The options (if present) consist of comma-separated option specifications. No spaces are permitted, except within double quotes. The following option specifications are supported (note that option keywords are case-insensitive):
de: Falls Optionen vorhanden sind, werden diese durch Kommata getrennt angegeben. Leerzeichen sind nur innerhalb doppelter englischer Anführungszeichen erlaubt. Die folgenden Optionsangaben werden unterstützt (beachten Sie, dass bei Optionsschlüsselwörtern die Groß-/Kleinschreibung egal ist):

source: Enable authentication agent forwarding previously disabled by the E<.Cm restrict> option.
de: Aktiviert den Weiterleitungsvermittler, der vorher mit der Option E<.Cm restrict> deaktiviert war.

source: Specifies that the listed key is a certification authority (CA) that is trusted to validate signed certificates for user authentication.
de: Legt fest, dass der aufgeführte Schlüssel eine Zertifizierungsstelle (CA) ist, der vertraut wird, um signierte Zertifikate zur Benutzerauthentifizierung zu validieren.

source: Certificates may encode access restrictions similar to these key options. If both certificate restrictions and key options are present, the most restrictive union of the two is applied.
de: Zertifikate können Zugangsbeschränkungen festlegen, ähnlich wie bei Schlüsseloptionen. Falls sowohl Zertifikatsbeschränkungen als auch Schlüsseloptionen vorhanden sind, wird die restriktivste Vereinigung beider angewandt.

source: Cm command="command"
de: Cm command="Befehl"

source: Specifies that the command is executed whenever this key is used for authentication. The command supplied by the user (if any) is ignored. The command is run on a pty if the client requests a pty; otherwise it is run without a tty. If an 8-bit clean channel is required, one must not request a pty or should specify E<.Cm no-pty>. A quote may be included in the command by quoting it with a backslash.
de: Legt fest, dass der Befehl immer bei der Verwendung des Schlüssels zur Authentifizierung ausgeführt wird. Der durch den Benutzer bereitgestellte Schlüssel (falls vorhanden) wird ignoriert. Der Befehl wird auf einem PTY ausgeführt, falls der Client ein PTY anfordert; andernfalls läuft er ohne ein TTY. Falls ein 8-Bit-fähiger Kanal benötigt wird, darf kein PTY angefordert werden oder es muss E<.Cm no-pty> festgelegt werden. Um ein englisches Anführungszeichen in dem Befehl aufzuführen, stellen Sie ihm einen Rückwärtsschrägstrich voran.

source: This option might be useful to restrict certain public keys to perform just a specific operation. An example might be a key that permits remote backups but nothing else. Note that the client may specify TCP and/or X11 forwarding unless they are explicitly prohibited, e.g. using the E<.Cm restrict> key option.
de: Diese Option kann zur Einschränkung bestimmter öffentlicher Schlüssel verwandt werden, damit diese nur eine bestimmte Aktion ausführen. Beispielsweise einen Schlüssel, der nur ferne Datensicherungen erlaubt, aber nichts sonst. Beachten Sie, dass der Client TCP- und/oder X11-Weiterleitung festlegen darf, außer dies wird explizit verboten, z.B. durch Verwendung der Schlüsseloption E<.Cm restrict>.

source: The command originally supplied by the client is available in the E<.Ev SSH_ORIGINAL_COMMAND> environment variable. Note that this option applies to shell, command or subsystem execution. Also note that this command may be superseded by a E<.Xr sshd_config 5> E<.Cm ForceCommand> directive.
de: Der vom Client bereitgestellte Befehl ist in der Umgebungsvariablen E<.Ev SSH_ORIGINAL_COMMAND> verfügbar. Beachten Sie, dass diese Option für eine Shell-, Befehls- oder Subsystemausführung gilt. Beachten Sie auch, dass dieser Befehl durch eine Direktive E<.Cm ForceCommand> in E<.Xr sshd_config 5> ersetzt werden kann.

source: If a command is specified and a forced-command is embedded in a certificate used for authentication, then the certificate will be accepted only if the two commands are identical.
de: Falls ein Befehl festgelegt ist und ein Erzwingungsbefehl in einem für die Authentifizierung verwandten Zertifikat eingebettet ist, dann wird dieses Zertifikat nur akzeptiert, falls die zwei Befehle identisch sind.

source: Cm environment="NAME=value"
de: Cm environment="NAME=Wert"

source: Specifies that the string is to be added to the environment when logging in using this key. Environment variables set this way override other default environment values. Multiple options of this type are permitted. Environment processing is disabled by default and is controlled via the E<.Cm PermitUserEnvironment> option.
de: Legt fest, dass die Zeichenkette zu der Umgebung beim Protokollieren hinzugefügt wird, wenn dieser Schlüssel verwandt wird. Auf diese Art gesetzte Umgebungsvariablen setzen andere Vorgabeumgebungswerte außer Kraft. Mehrere Optionen dieser Art sind erlaubt. Standardmäßig ist die Verarbeitung der Umgebung deaktiviert und wird mittels der Option E<.Cm PermitUserEnvironment> gesteuert.

source: Cm expiry-time="timespec"
de: Cm expiry-time="Zeitangabe"

source: Specifies a time after which the key will not be accepted. The time may be specified as a YYYYMMDD[Z] date or a YYYYMMDDHHMM[SS][Z] time. Dates and times will be interpreted in the system time zone unless suffixed by a Z character, in which case they will be interpreted in the UTC time zone.
de: Legt eine Zeit fest, nach der der Schlüssel nicht akzeptiert wird. Die Zeit kann als Datum YYYYMMDD[Z] oder eine Zeit YYYYMMDDHHMM[SS][Z] festgelegt werden. Daten und Zeiten werden in der Zeitzone des Systems interpretiert, außer es wird ein »Z«-Zeichen angehängt, dann werden sie in der UTC-Zeitzone interpretiert.

source: Cm from="pattern-list"
de: Cm from="Musterliste"

source: Specifies that in addition to public key authentication, either the canonical name of the remote host or its IP address must be present in the comma-separated list of patterns. See PATTERNS in E<.Xr ssh_config 5> for more information on patterns.
de: Legt fest, dass zusätzlich zur asymmetrischen Authentifizierung entweder der kanonische Name des fernen Rechners oder seine IP-Adresse in der Kommata-getrennten Liste der Muster vorhanden sein muss. Siehe MUSTER in E<.Xr ssh_config 5> für weitere Informationen über Muster.

source: In addition to the wildcard matching that may be applied to hostnames or addresses, a E<.Cm from> stanza may match IP addresses using CIDR address/masklen notation.
de: Zusätzlich zum Platzhaltervergleich, der für Rechnernamen oder Adressen angewandt werden kann, kann ein E<.Cm from>-Abschnitt auf IP-Adressen mit der CIDR address/masklen-Notation passen.

source: The purpose of this option is to optionally increase security: public key authentication by itself does not trust the network or name servers or anything (but the key); however, if somebody somehow steals the key, the key permits an intruder to log in from anywhere in the world. This additional option makes using a stolen key more difficult (name servers and/or routers would have to be compromised in addition to just the key).
de: Der Zweck dieser Option besteht darin, optional die Sicherheit zu erhöhen: asymmetrische Authentifizierung an sich vertraut dem Netzwerk oder den Name-Servern oder irgendetwas (außer dem Schlüssel) nicht. Falls allerdings jemand den Schlüssel klaut, ermöglicht er es dem Eindringling, sich von überall aus der Welt anzumelden. Diese zusätzliche Option erschwert den Einsatz eines gestohlenen Schlüssels (es müssten Name-Server und/oder Router zusätzlich kompromittiert werden, nicht nur der Schlüssel).

source: Forbids authentication agent forwarding when this key is used for authentication.
de: Verbietet die Vermittlerweiterleitung der Authentifizierung, wenn dieser Schlüssel für die Authentifizierung verwandt wird.

source: Forbids TCP forwarding when this key is used for authentication. Any port forward requests by the client will return an error. This might be used, e.g. in connection with the E<.Cm command> option.
de: Verbietet die TCP-Weiterleitung, wenn dieser Schlüssel für die Authentifizierung verwandt wird. Jede Port-Weiterleitungsanfrage durch den Client wird einen Fehler zurückliefern. Dies kann beispielsweise bei Verbindungen mit der Option E<.Cm command> verwandt werden.

source: Prevents tty allocation (a request to allocate a pty will fail).
de: Verhindert TTY-Zuweisung (eine Anfrage, ein PTY zuzuweisen, wird fehlschlagen).

source: Disables execution of E<.Pa ~/.ssh/rc>.
de: Deaktiviert die Ausführung von E<.Pa ~/.ssh/rc>.

source: Forbids X11 forwarding when this key is used for authentication. Any X11 forward requests by the client will return an error.
de: Verbietet X11-Weiterleitung, wenn dieser Schlüssel zur Authentifizierung verwandt wird. Jede X11-Weiterleitungsanfrage vom Client wird einen Fehler zurückliefern.

source: Cm permitlisten="[host:]port"
de: Cm permitlisten="[Rechner:]Port"

source: Limit remote port forwarding with the E<.Xr ssh 1> E<.Fl R> option such that it may only listen on the specified host (optional) and port. IPv6 addresses can be specified by enclosing the address in square brackets. Multiple E<.Cm permitlisten> options may be applied separated by commas. Hostnames may include wildcards as described in the PATTERNS section in E<.Xr ssh_config 5>. A port specification of E<.Cm *> matches any port. Note that the setting of E<.Cm GatewayPorts> may further restrict listen addresses. Note that E<.Xr ssh 1> will send a hostname of E<.Dq localhost> if a listen host was not specified when the forwarding was requested, and that this name is treated differently to the explicit localhost addresses E<.Dq 127.0.0.1> and E<.Dq ::1>.
de: Schränkt ferne Port-Weiterleitung mit der Option E<.Fl R> von E<.Xr ssh 1> ein, so dass es nur auf dem festgelegten Rechner (optional) und Port auf Anfragen wartet. IPv6-Adressen können durch Einschluss der Adresse in eckige Klammern festgelegt werden. Mehrere Optionen E<.Cm permitlisten> können durch Kommata getrennt angewandt werden. Rechnernamen können Platzhalter enthalten, wie dies im Abschnitt MUSTER in E<.Xr ssh_config 5> beschrieben ist. Eine Port-Festlegung E<.Cm *> passt auf jeden Port. Beachten Sie, dass die Einstellung E<.Cm GatewayPorts> die Adressen, an denen auf Anfragen gewartet wird, weiter einschränken kann. Beachten Sie, dass E<.Xr ssh 1> einen Rechnernamen E<.Dq localhost> senden wird, falls kein Rechner, an dem auf Anfragen gewartet werden soll, bei der Bitte um eine Weiterleitung angegeben wurde und dass dieser Name anders als die expliziten Localhost-Adressen E<.Dq 127.0.0.1> und E<.Dq ::1> behandelt wird.

source: Cm permitopen="host:port"
de: Cm permitopen="Rechner:Port"

source: Limit local port forwarding with the E<.Xr ssh 1> E<.Fl L> option such that it may only connect to the specified host and port. IPv6 addresses can be specified by enclosing the address in square brackets. Multiple E<.Cm permitopen> options may be applied separated by commas. No pattern matching or name lookup is performed on the specified hostnames, they must be literal host names and/or addresses. A port specification of E<.Cm *> matches any port.
de: Beschränkt Port-Weiterleitungen mit der Option E<.Fl L> von E<.Xr ssh 1>, so dass nur Verbindungen zu dem festgelegten Rechner und Port möglich sind. IPv6-Adressen können durch Einschluss der Adresse in eckige Klammern festgelegt werden. Mehrere Optionen E<.Cm permitopen> können durch Kommata getrennt angewandt werden. Es erfolgt bei den festgelegten Rechnernamen kein Mustervergleich und Namensauflösung, sie müssen wortwörtliche Rechnernamen und/oder Adressen sein. Eine Port-Festlegung E<.Cm *> passt auf jeden Port.

source: Enable port forwarding previously disabled by the E<.Cm restrict> option.
de: Aktiviert Port-Weiterleitung, die vorher mit der Option E<.Cm restrict> deaktiviert wurde.

source: Cm principals="principals"
de: Cm principals="Prinzipale"

source: On a E<.Cm cert-authority> line, specifies allowed principals for certificate authentication as a comma-separated list. At least one name from the list must appear in the certificate's list of principals for the certificate to be accepted. This option is ignored for keys that are not marked as trusted certificate signers using the E<.Cm cert-authority> option.
de: Legt auf einer E<.Cm cert-authority>-Zeile die erlaubten Prinzipale für die Zertifikatsauthentifizierung als Kommata-getrennte Liste fest. Mindestens ein Name aus der Liste muss in der Zertifikatsliste der Prinzipale erscheinen, damit das Zertifikat akzeptiert wird. Diese Option wird für Schlüssel, die nicht mit der Option E<.Cm cert-authority> als vertrauenswürdige Zertifikatsignierer markiert sind, ignoriert.

source: Permits tty allocation previously disabled by the E<.Cm restrict> option.
de: Erlaubt TTY-Zuweisung, die vorher mit der Option E<.Cm restrict> deaktiviert wurde.

source: Do not require demonstration of user presence for signatures made using this key. This option only makes sense for the FIDO authenticator algorithms E<.Cm ecdsa-sk> and E<.Cm ed25519-sk>.
de: Erfordert keinen Nachweis der Anwesenheit des Benutzers für Signaturen, die mittels dieses Schlüssels erfolgten. Diese Option ergibt nur für die FIDO-Authenticator-Algorithmen E<.Cm ecdsa-sk> und E<.Cm ed25519-sk> Sinn.

source: Require that signatures made using this key attest that they verified the user, e.g. via a PIN. This option only makes sense for the FIDO authenticator algorithms E<.Cm ecdsa-sk> and E<.Cm ed25519-sk>.
de: Verlangt, dass mit diesem Schlüssel erstellte Signaturen beglaubigen, dass sie vom Benutzer bestätigt wurden, z.B. über eine PIN. Diese Option ergibt nur für die FIDO-Authenticator-Algorithmen E<.Cm ecdsa-sk> und E<.Cm ed25519-sk> Sinn.

source: Enable all restrictions, i.e. disable port, agent and X11 forwarding, as well as disabling PTY allocation and execution of E<.Pa ~/.ssh/rc>. If any future restriction capabilities are added to authorized_keys files, they will be included in this set.
de: Aktiviert alle Beschränkungen, d.h. deaktiviert die Weiterleitung vom Port, Vermittler und X11, sowie deaktiviert die PTY-Zuweisung und die Ausführung von E<.Pa ~/.ssh/rc>. Falls zukünftig weitere Beschränkungsfähigkeiten zu den authorized_keys-Dateien hinzugefügt werden, werden sie in diese Menge aufgenommen.

source: Force a E<.Xr tun 4> device on the server. Without this option, the next available device will be used if the client requests a tunnel.
de: Erzwingt ein E<.Xr tun 4>-Gerät auf dem Server. Ohne diese Option wird das nächste verfügbare Gerät verwandt, falls der Client einen Tunnel anfordert.

source: Enables execution of E<.Pa ~/.ssh/rc> previously disabled by the E<.Cm restrict> option.
de: Aktiviert die Ausführung von E<.Pa ~/.ssh/rc>, die vorher durch die Option E<.Cm restrict> deaktiviert war.

source: Permits X11 forwarding previously disabled by the E<.Cm restrict> option.
de: Erlaubt X11-Weiterleitung, die vorher durch die Option E<.Cm restrict> deaktiviert war.

source: An example authorized_keys file:
de: Ein Beispiel für eine authorized_keys-Datei:

source: # Comments are allowed at start of line. Blank lines are allowed. # Plain key, no restrictions ssh-rsa ... # Forced command, disable PTY and all forwarding restrict,command="dump /home" ssh-rsa ... # Restriction of ssh -L forwarding destinations permitopen="192.0.2.1:80",permitopen="192.0.2.2:25" ssh-rsa ... # Restriction of ssh -R forwarding listeners permitlisten="localhost:8080",permitlisten="[::1]:22000" ssh-rsa ... # Configuration for tunnel forwarding tunnel="0",command="sh /etc/netstart tun0" ssh-rsa ... # Override of restriction to allow PTY allocation restrict,pty,command="nethack" ssh-rsa ... # Allow FIDO key without requiring touch no-touch-required sk-ecdsa-sha2-nistp256@openssh.com ... # Require user-verification (e.g. PIN or biometric) for FIDO key verify-required sk-ecdsa-sha2-nistp256@openssh.com ... # Trust CA key, allow touch-less FIDO if requested in certificate cert-authority,no-touch-required,principals="user_a" ssh-rsa ...
de: # Kommentare dürfen am Zeilenanfang anfangen. Leere Zeilen sind erlaubt. # Einfacher Schlüssel, keine Einschränkung ssh-rsa … # Befehl erzwingen, deaktiviert PTY und sämtliche Weiterleitung restrict,command="dump /home" ssh-rsa … # »ssh -L«-Weiterleitungsziele beschränken permitopen="192.0.2.1:80",permitopen="192.0.2.2:25" ssh-rsa … # Auf Anfrage wartende »ssh -R«-Weiterleitungen beschränken permitlisten="localhost:8080",permitlisten="[::1]:22000" ssh-rsa … # Konfiguration für lokale Tunnel-Weiterleitung tunnel="0",command="sh /etc/netstart tun0" ssh-rsa … # Außerkraftsetzung der Beschränkung, um PTY-Zuweisungen zu erlauben restrict,pty,command="nethack" ssh-rsa … # FIDO-Schlüssel erlauben, ohne Berührung zu erzwingen no-touch-required sk-ecdsa-sha2-nistp256@openssh.com … # Benutzer-Überprüfung (z.B. PIN oder Biometrie) für FIDO-Schlüssel verlangen verify-required sk-ecdsa-sha2-nistp256@openssh.com … # CA-Schlüssel vertrauen, berühungsloses FIDO erlauben, falls im Zertifikat erbeten cert-authority,no-touch-required,principals="user_a" ssh-rsa …

source: SSH_KNOWN_HOSTS FILE FORMAT
de: SSH_KNOWN_HOSTS-DATEIFORMAT

source: The E<.Pa /etc/ssh/ssh_known_hosts> and E<.Pa ~/.ssh/known_hosts> files contain host public keys for all known hosts. The global file should be prepared by the administrator (optional), and the per-user file is maintained automatically: whenever the user connects to an unknown host, its key is added to the per-user file.
de: Die Dateien E<.Pa /etc/ssh/ssh_known_hosts> und E<.Pa ~/.ssh/known_hosts> enthalten öffentliche Schlüssel für alle bekannten Rechner. Die globale Datei sollte durch den Administrator vorbereitet werden (optional) und die benutzerbezogene Datei wird automatisch verwaltet: immer wenn sich der Benutzer mit einem unbekannten Rechner verbindet, wird sein Schlüssel zu der benutzerbezogenen Datei hinzugefügt.

source: Each line in these files contains the following fields: marker (optional), hostnames, keytype, base64-encoded key, comment. The fields are separated by spaces.
de: Jede Zeile in diesen Dateien enthält die folgenden Felder: Markierung (optional), Rechnername, Schlüsseltyp, Base64-kodierter Schlüssel, Kommentar. Die Felder sind durch Leerzeichen getrennt.

source: The marker is optional, but if it is present then it must be one of E<.Dq @cert-authority>, to indicate that the line contains a certification authority (CA) key, or E<.Dq @revoked>, to indicate that the key contained on the line is revoked and must not ever be accepted. Only one marker should be used on a key line.
de: Die Markierung ist optional, falls sie aber vorhanden ist, muss sie entweder E<.Dq @cert-authority> sein, um anzuzeigen, dass die Zeile einen Schlüssel einer Zertifizierungsstelle (CA) ist, oder E<.Dq @revoked>, um anzuzeigen, dass der in der Zeile enthaltene Schlüssel zurückgezogen wurde und niemals akzeptiert werden darf. Auf einer Schlüsselzeile sollte nur eine Markierung verwandt werden.

source: Hostnames is a comma-separated list of patterns E<.Pf ( Ql *> and E<.Ql \&?> act as wildcards); each pattern in turn is matched against the host name. When E<.Nm sshd> is authenticating a client, such as when using E<.Cm HostbasedAuthentication>, this will be the canonical client host name. When E<.Xr ssh 1> is authenticating a server, this will be the host name given by the user, the value of the E<.Xr ssh 1> E<.Cm HostkeyAlias> if it was specified, or the canonical server hostname if the E<.Xr ssh 1> E<.Cm CanonicalizeHostname> option was used.
de: Rechnernamen sind eine durch Kommata getrennte Liste von Mustern E<.Pf ( Ql *> und E<.Ql \&?> wirken als Platzhalter); jedes Muster wiederum wird mit dem Rechnernamen verglichen. Wenn E<.Nm sshd> einen Client authentifiziert, wie beispielsweise bei der Verwendung von E<.Cm HostbasedAuthentication>, wird dies der kanonische Rechnername sein. Wenn E<.Xr ssh 1> durch einen Server authentifiziert wird, wird dies der vom Benutzer angegebene Rechnername sein, der Wert aus E<.Cm HostkeyAlias> von E<.Xr ssh 1>, falls dieser festgelegt wurde oder der kanonische Rechnername, falls die Option E<.Cm CanonicalizeHostname> von E<.Xr ssh 1> verwandt wurde.

source: A pattern may also be preceded by E<.Ql \&!> to indicate negation: if the host name matches a negated pattern, it is not accepted (by that line) even if it matched another pattern on the line. A hostname or address may optionally be enclosed within E<.Ql \&[> and E<.Ql \&]> brackets then followed by E<.Ql \&:> and a non-standard port number.
de: Einem Muster kann auch E<.Ql \&!> als Zeichen für die Verneinung vorangestellt werden: falls der Rechner auf ein verneintes Muster passt, wird er (durch diese Zeile) überhaupt nicht akzeptiert, selbst falls er auf ein anderes Muster in dieser Zeile passt. Ein Rechnername oder eine Adresse kann optional in die Klammern E<.Ql \&[> und E<.Ql \&]> eingeschlossen sein, gefolgt dann von einem E<.Ql \&:> und einer individuellen Port-Nummer.
