Repository: sebras/manpages-l10n
Catalog: po/*/man8/sulogin.8.po
Languages: pl, uk

source: System Administration
pl: Administracja systemem
uk: Керування системою

source: NAME
pl: NAZWA
uk: НАЗВА

source: sulogin - single-user login
pl: sulogin - login w trybie jednoużytkownikowym
uk: sulogin — однокористувацький вхід до системи

source: SYNOPSIS
pl: SKŁADNIA
uk: КОРОТКИЙ ОПИС

source: B<sulogin> [options] [I<tty>]
pl: B<sulogin> [I<opcje>] [I<tty>]
uk: B<sulogin> [параметри] [I<tty>]

source: DESCRIPTION
pl: OPIS
uk: ОПИС

source: B<sulogin> is invoked by B<init> when the system goes into single-user mode.
pl: B<sulogin> jest przywoływany przez B<init>, gdy system przechodzi w tryb jednoużytkownikowy.
uk: B<sulogin> викликає B<init>, коли система переходить у режим єдиного користувача.

source: The user is prompted:
pl: Wyświetlany jest następujący komunikat zachęty:
uk: Програма попросить користувача про таке:

source: Give root password for system maintenance (or type Control-D for normal startup):
pl: B<Give root password for system maintenance (or type Control-D for normal startup):> (Podaj hasło roota do konserwacji systemu lub wciśnij ^D aby kontynuować zwykły start)
uk: Надати пароль root для супроводу системи (або натиснути Ctrl-D, щоб запустити систему у звичайному режимі):

source: If the root account is locked and B<--force> is specified, no password is required.
pl: Gdy konto roota jest zablokowane i podano opcję B<--force>, hasło nie jest wymagane.
uk: Якщо обліковий запис root заблоковано, і вказано B<--force>, пароль вказувати не потрібно.

source: B<sulogin> will be connected to the current terminal, or to the optional I<tty> device that can be specified on the command line (typically I</dev/console>).
pl: B<sulogin> będzie podłączony do bieżącego terminala lub do opcjonalnego urządzenia I<tty> podanego w wierszu polecenia zwykle (I</dev/console>).
uk: B<sulogin> буде з'єднано із поточним терміналом або необов'язковим пристроєм I<tty>, який може бути вказано у рядку команди (типово I</dev/console>).

source: When the user exits from the single-user shell, or presses control-D at the prompt, the system will continue to boot.
pl: Po tym, jak użytkownik wyjdzie z trybu jednoużytkownikowego lub wciśnie control-D po wyświetleniu zachęty, system będzie kontynuował rozruch.
uk: Коли користувач виходить з оболонки єдиного користувача або натискає Ctrl-D у відповідь на запит, система продовжуватиме завантаження.

source: OPTIONS
pl: OPCJE
uk: ПАРАМЕТРИ

source: If the default method of obtaining the root password from the system via B<getpwnam>(3) fails, then examine I</etc/passwd> and I</etc/shadow> to get the password. If these files are damaged or nonexistent, or when root account is locked by \(aq!\(aq or \(aq*\(aq at the begin of the password then B<sulogin> will B<start a root shell without asking for a password>.
pl: Jeśli domyślna metoda pozyskania hasła roota z systemu za pomocą B<getpwnam>(3) nie powiedzie się, to sprawdzane są pliki I</etc/passwd> i I</etc/shadow>. Jeśli są one uszkodzone lub nie istnieją lub gdy konto roota jest zablokowane symbolem B<!> lub B<*> na początku hasła, to B<sulogin wywoła powłokę roota bez pytania o hasło>.
uk: Якщо типовий метод отримання пароля root з системи за допомогою B<getpwnam>(3) зазнає невдачі, вивчити I</etc/passwd> і I</etc/shadow> для отримання пароля. Якщо ці файли пошкоджено або їх не існує або якщо обліковий запис root заблоковано «!» або «*» на початку пароля, B<sulogin> B<запустить командну оболонку root без запиту щодо пароля>.

source: Only use the B<-e> option if you are sure the console is physically protected against unauthorized access.
pl: Opcji B<-e> należy używać tylko, gdy jest się pewnym, że konsola jest fizycznie zabezpieczona przed nieautoryzowanym dostępem.
uk: Користуйтеся параметром B<-e>, лише якщо ви впевнені, що консоль фізично захищено від неуповноваженого доступу.

source: Specifying this option causes B<sulogin> to start the shell process as a login shell.
pl: Podanie ten opcji spowoduje, że B<sulogin> uruchomi proces powłoki jako powłokę zgłoszeniową.
uk: Визначення цього параметра призведе до того, що B<sulogin> запустить процес оболонки як оболонку для входу до системи.

source: B<-t>, B<--timeout> I<seconds>
pl: B<-t>, B<--timeout> I<sekundy>
uk: B<-t>, B<--timeout> I<секунди>

source: Specify the maximum amount of time to wait for user input. By default, B<sulogin> will wait forever.
pl: Określa maksymalny czas oczekiwania na reakcję użytkownika. Domyślnie B<sulogin> będzie czekał wiecznie.
uk: Вказати максимальний час очікування вхідних даних користувача. Типово, B<sulogin> очікуватиме без обмежень.

source: Display help text and exit.
pl: Wyświetla ten tekst i kończy pracę.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: ENVIRONMENT
pl: ŚRODOWISKO
uk: СЕРЕДОВИЩЕ

source: B<sulogin> looks for the environment variable B<SUSHELL> or B<sushell> to determine what shell to start. If the environment variable is not set, it will try to execute root\(cqs shell from I</etc/passwd>. If that fails, it will fall back to I</bin/sh>.
pl: B<sulogin> szuka zmiennych środowiskowych B<SUSHELL> lub B<sushell>, aby określić którą powłokę uruchomić. Jeśli zmienna środowiskowa nie jest ustawiona, to program spróbuje wykonać powłokę roota z pliku I</etc/passwd>. Jeśli to również się nie powiedzie, to na końcu wykorzystana zostanie powłoka I</bin/sh>.
uk: B<sulogin> шукає змінну середовища B<SUSHELL> або B<sushell> для визначення оболонки, яку слід запустити. Якщо змінну середовища не встановлено, програма намагатиметься виконати командну оболонку root з I</etc/passwd>. Якщо спроба зазнає невдачі, резервним варіантом буде I</bin/sh>.

source: AUTHORS
pl: AUTORZY
uk: АВТОРИ

source: B<sulogin> was written by Miquel van Smoorenburg for sysvinit and later ported to util-linux by Dave Reisner and Karel Zak.
pl: B<sulogin> było napisane przez Miquela van Smoorenburga dla sysvinit i później przeportowane dla util-linux przez Dave'a Reisnera i Karela Zaka.
uk: B<sulogin> було написано Miquel van Smoorenburg для sysvinit і пізніше портовано на util-linux Dave Reisner та Karel Zak.

source: REPORTING BUGS
pl: ZGŁASZANIE BŁĘDÓW
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
pl: Raporty o błędach proszę zgłaszać pod adresem
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
pl: DOSTĘPNOŚĆ
uk: ДОСТУПНІСТЬ

source: The B<sulogin> command is part of the util-linux package which can be downloaded from
pl: Polecenie B<sulogin> jest częścią pakietu util-linux i można je pobrać ze strony
uk: B<sulogin> є частиною пакунка util-linux, який можна отримати з

source: July 2014
pl: lipiec 2014
uk: липень 2014 року

source: Give root password for system maintenance
pl: B<Give root password for system maintenance> (Podaj hasło roota do konserwacji systemu)
uk: Вкажіть пароль root, щоб виконати дії з підтримання працездатності системи

source: (or type Control-D for normal startup):
pl: B<(or type Control-D for normal startup)> (lub wciśnij ^D aby kontynuować zwykły start):
uk: (або натисніть Ctrl-D, щоб запустити систему у звичайному режимі):

source: If the root account is locked and --force is specified, no password is required.
pl: Gdy konto roota jest zablokowane, to powyższa zachęta nie jest wyświetlana, a B<sulogin> zachowuje się tak, jakby podano prawidłowe hasło roota.
uk: Якщо обліковий запис root заблоковано, і вказано --force, пароль вказувати не потрібно.

source: If the default method of obtaining the root password from the system via B<getpwnam>(3) fails, then examine I</etc/passwd> and I</etc/shadow> to get the password. If these files are damaged or nonexistent, or when root account is locked by '!' or '*' at the begin of the password then B<sulogin> will B<start a root shell without asking for a password>.
pl: Jeśli domyślna metoda pozyskania hasła roota z systemu za pomocą B<getpwnam>(3) nie powiedzie się, to sprawdzane są pliki I</etc/passwd> i I</etc/shadow>. Jeśli są one uszkodzone lub nie istnieją lub gdy konto roota jest zablokowane symbolem B<!> lub B<*> na początku hasła, to B<sulogin wywoła powłokę roota bez pytania o hasło>.
uk: Якщо типовий метод отримання пароля root з системи за допомогою B<getpwnam>(3) зазнає невдачі, вивчити I</etc/passwd_ і _/etc/shadow> для отримання пароля. Якщо ці файли пошкоджено або їх не існує або якщо обліковий запис root заблоковано «!» або «*» на початку пароля, B<sulogin> *запустить командну оболонку root без запиту щодо пароля*.

source: B<-t>, B<--timeout >I<seconds>
pl: B<-t>, B<--timeout >I<sekundy>
uk: B<-t>, B<--timeout >I<секунди>

source: Specify the maximum amount of time to wait for user input. By default, B<sulogin> will wait forever.
pl: Określa maksymalny czas oczekiwania na reakcję użytkownika. Domyślnie B<sulogin> będzie czekał wiecznie.
uk: Вказати максимальний час очікування вхідних даних користувача. Типово, B<sulogin> очікуватиме без обмежень.

source: Display version information and exit.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: B<sulogin> looks for the environment variable B<SUSHELL> or B<sushell> to determine what shell to start. If the environment variable is not set, it will try to execute root's shell from I</etc/passwd>. If that fails, it will fall back to I</bin/sh>.
pl: B<sulogin> szuka zmiennych środowiskowych B<SUSHELL> lub B<sushell>, aby określić którą powłokę uruchomić. Jeśli zmienna środowiskowa nie jest ustawiona, to program spróbuje wykonać powłokę roota z pliku I</etc/passwd>. Jeśli to również się nie powiedzie, to na końcu wykorzystana zostanie powłoka I</bin/sh>.
uk: B<sulogin> шукає змінну середовища B<SUSHELL> або B<sushell> для визначення оболонки, яку слід запустити. Якщо змінну середовища не встановлено, програма намагатиметься виконати командну оболонку root з I</etc/passwd>. Якщо спроба зазнає невдачі, резервним варіантом буде I</bin/sh>.

source: The sulogin command is part of the util-linux package and is available from E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
pl: Polecenie sulogin jest częścią pakietu util-linux i jest dostępne z E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Archiwum jądra Linux E<.UE .>
uk: Програма sulogin є частиною пакунка util-linux і доступна зі E<.UR https://\:www.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> архіву ядра Linux E<.UE .>
