Repository: sebras/manpages-l10n
Catalog: po/*/man8/swapon.8.po
Languages: de, pl, uk

source: System Administration
pl: Administracja systemem
uk: Керування системою

source: NAME
de: BEZEICHNUNG
pl: NAZWA
uk: НАЗВА

source: swapon, swapoff - enable/disable devices and files for paging and swapping
de: swapon, swapoff - Geräte und Dateien für Paging und Auslagerung aktivieren oder deaktivieren
pl: swapon, swapoff - włącza/wyłącza urządzenia oraz pliki stronicowania i wymiany
uk: swapon, swapoff — вимикання пристроїв і файлів для поділу на сторінки і резервування

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA
uk: КОРОТКИЙ ОПИС

source: B<swapon> [options] [I<specialfile>...]
de: B<swapon> [Optionen] [I<Spezialdatei> …]
pl: B<swapon> [opcje] [I<plik-specjalny>...]
uk: B<swapon> [параметри] [I<спеціальний-файл>...]

source: B<swapoff> [B<-va>] [I<specialfile>...]
de: B<swapoff> [B<-va>] [I<Spezialdatei> …]
pl: B<swapoff> [B<-va>] [I<plik-specjalny>...]
uk: B<swapoff> [B<-va>] [I<спеціальний-файл>...]

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS
uk: ОПИС

source: B<swapon> is used to specify devices on which paging and swapping are to take place.
de: Mit B<swapon> können Sie Geräte angeben, die für Paging und Auslagerung genutzt werden sollen.
pl: Polecenie B<swapon> jest używane do określania urządzeń do stronicowania i wymiany.
uk: B<swapon> використовують для визначення пристроїв, на яких відбуватиметься поділ на сторінки та робота із резервною пам'яттю.

source: The device or file used is given by the I<specialfile> parameter. It may be of the form B<-L> I<label> or B<-U> I<uuid> to indicate a device by label or uuid.
de: Das zu verwendende Gerät oder die zu verwendende Datei wird über das Argument I<Spezialdatei> angegeben. Es kann in der Form B<-L> I<Bezeichnung> oder B<-U> I<UUID> vorliegen, um das Gerät anhand der Bezeichnung oder UUID anzugeben.
pl: Urządzenie lub plik może być podany za pomocą parametru I<plik-specjalny>. Może mieć on postać B<-L> I<etykieta> lub B<-U> I<uuid>, aby określić urządzenie za pomocą etykiety lub uuid (unikatowego identyfikatora).
uk: Використаний пристрій або файл задає параметр I<спеціальний-файл>. Його може бути задано у формі B<-L> I<мітка> або B<-U> I<uuid> для визначення пристрою за міткою або UUID.

source: Calls to B<swapon> normally occur in the system boot scripts making all swap devices available, so that the paging and swapping activity is interleaved across several devices and files.
de: B<swapon>-Aufrufe werden normalerweise in den Startskripten des Systems ausgeführt, um alle Auslagerungsgeräte verfügbar zu machen, so dass die Paging- und Auslagerungsaktivitäten zwischen verschiedenen Geräten und Dateien untereinander verschachtelt werden.
pl: Odwołanie do B<swapon> normalnie powinno się pojawiać w systemowych skryptach uruchomieniowych, udostępniając wszystkie urządzenia wymiany, dzięki czemu stronicowanie i wymiana jest rozłożone między wiele urządzeń i plików.
uk: Виклик B<swapon>, зазвичай, відбувається зі скриптів завантаження системи, які роблять усі пристрої резервної пам'яті доступними, тому дії з поділу на сторінки і роботи із резервною пам'яттю на диску розподіляються між декількома пристроями і файлами.

source: B<swapoff> disables swapping on the specified devices and files. When the B<-a> flag is given, swapping is disabled on all known swap devices and files (as found in I</proc/swaps> or I</etc/fstab>).
de: B<swapoff> deaktiviert die Auslagerung auf den angegebenen Geräten und Dateien. Wenn der Schalter B<-a> angegeben wird, wird die Auslagerung auf allen bekannten Auslagerungsgeräten und -dateien (die in I</proc/swaps> oder I</etc/fstab> gefunden werden) deaktiviert.
pl: Polecenie B<swapoff> wyłącza wymianę na podanych urządzeniach i plikach. Jeśli użyto opcji B<-a>, to swap jest wyłączany na wszystkich znanych urządzeniach i plikach wymiany (zgodnie z plikiem I</proc/swaps> lub I</etc/fstab>).
uk: B<swapoff> вимикає резервну пам'ять на вказаних пристроях і у файлах. Якщо задано прапорець B<-a>, резервну пам'ять на диску вимкнено для усіх відомих пристроїв і файлів резервної пам'яті (які буде знайдено у I</proc/swaps> або I</etc/fstab>).

source: OPTIONS
de: OPTIONEN
pl: OPCJE
uk: ПАРАМЕТРИ

source: All devices marked as "swap" in I</etc/fstab> are made available, except for those with the "noauto" option. Devices that are already being used as swap are silently skipped.
de: Alle in der Datei I</etc/fstab> mit »swap« markierten Geräte werden verfügbar gemacht, außer jenen mit der Option »noauto«. Geräte, die bereits für die Auslaqerung in Verwendung sind, werden stillschweigend übersprungen.
pl: Udostępnia wszystkie urządzenia oznaczone jako "swap" w pliku I</etc/fstab>, z wyjątkiem plików z opcją "noauto". Urządzenia, które są już używane jako swap, są po cichu pomijane.
uk: Усі пристрої, які позначено як «swap» в I</etc/fstab>, буде зроблено доступними, окрім тих, які вказано із параметром «noauto». Пристрої, які вже використовуються для резервної пам'яті, буде без повідомлень пропущено.

source: B<-d>, B<--discard>[B<=>I<policy>]
de: B<-d>, B<--discard>[B<=>I<Regel>]
pl: B<-d>, B<--discard> [B<=>I<tryb>]
uk: B<-d>, B<--discard>[B<=>I<правила>]

source: Enable swap discards, if the swap backing device supports the discard or trim operation. This may improve performance on some Solid State Devices, but often it does not. The option allows one to select between two available swap discard policies:
de: aktiviert Auslagerungs-Verwerfungen, falls das zugrundeliegende Auslagerungsgerät die Verwerfungs- oder Kürzungsaktionen (»discard« bzw. »trim«) unterstützt. Dies könnte die Performance auf SSD-Geräten verbessern, was aber oft nicht der Fall ist. Mit der Option können Sie zwischen zwei verfügbaren Auslagerungs-Verwerfungsregeln wählen:
pl: Włącza odrzucanie (discard), jeśli urządzenie, na którym jest przestrzeń wymiany, pozwala na operacje discard lub trim. Może to pozytywnie wpłynąć na wydajność na niektórych dyskach półprzewodnikowych (SSD), ale często tak nie jest. Opcja pozwala na wybór spośród dwóch dostępnych trybów odrzucania:
uk: Увімкнути відкидання резервної пам'яті на диску, якщо підтримку дії з відкидання або обрізання передбачено для базового пристрою резервної пам'яті. Це може удосконалити швидкодію на деяких пристроях SSD, але часто цього не відбувається. За допомогою цього параметра можна вибрати між двома доступними правилами відкидання резервної пам'яті на диску:

source: to perform a single-time discard operation for the whole swap area at swapon; or
de: zum Ausführen einer einmaligen Verwerfungsaktion für den gesamten Auslagerungsbereich bei dessen Aktivierung; oder
pl: do przeprowadzania pojedynczych operacji odrzucania całej przestrzeni wymiany lub
uk: для виконання одноразової дії з відкидання для усієї області резервної пам'яті на диску при виконанні swapon; або

source: to asynchronously discard freed swap pages before they are available for reuse.
de: zum asynchronen Verwerfen freigestellter Auslagerungsseiten, bevor diese zur erneuten Nutzung verfügbar gemacht werden.
pl: do asynchronicznego odrzucania zwolnionych stron wymiany przed udostępnieniem ich do ponownego użycia.
uk: для асинхронного відкидання вивільнених сторінок резервної пам'яті на диску до того, як вони стануть доступними для повторного використання.

source: If no policy is selected, the default behavior is to enable both discard types. The I</etc/fstab> mount options B<discard>, B<discard=once>, or B<discard=pages> may also be used to enable discard flags.
de: Wenn keine Regel ausgewählt ist, werden standardmäßig beide Verwerfungstypen aktiviert. Die Einhängeoptionen B<discard>, B<discard=once> oder B<discard=pages> in der Datei I</etc/fstab> könnten ebenfalls zum Aktivieren der Verwerfungsschalter verwendet werden.
pl: Jeśli nie wybierze się żadnego z tych trybów, to domyślnym zachowaniem jest włączenie ich obu. Można również włączyć odrzucanie w I</etc/fstab> za pomocą opcji montowania B<discard>, B<discard=once> lub B<discard=pages>.
uk: Якщо не вибрано жодних правил, типовою поведінкою буде вмикання обох типів відкидання. Для вмикання прапорців відкидання можна також скористатися параметрами монтування I</etc/fstab> B<discard>, B<discard=once> або B<discard=pages>.

source: Silently skip devices that do not exist. The I</etc/fstab> mount option B<nofail> may also be used to skip non-existing device.
de: überspringt nicht vorhandene Geräte stillschweigend. Sie können auch die Einhängeoption B<nofail> in I</etc/fstab> verwenden, um nicht vorhandene Geräte zu überspringen.
pl: Pomija po cichu nieistniejące urządzenia. Opcja montowania B<nofail> w I</etc/fstab> może być również użyta do pomijania nieistniejących urządzeń.
uk: Без повідомлень пропускати пристрої, яких не існує. Також для пропускання пристроїв, яких не існує, можна скористатися параметром монтування B<nofail> в I</etc/fstab>.

source: Reinitialize (exec mkswap) the swap space if its page size does not match that of the current running kernel. B<mkswap>(8) initializes the whole device and does not check for bad blocks.
de: initialisiert den Auslagerungsbereich neu (mittels B<mkswap>), falls die Seitengröße nicht der des aktuellen Kernels entspricht. B<mkswap>(8) initialisiert das gesamte Gerät und prüft nicht auf defekte Blöcke.
pl: Ponownie inicjuje przestrzeń swap (exec mkswap), jeśli rozmiar strony nie pasuje do rozmiaru podawanego przez obecnie uruchomione jądro. Polecenie B<mkswap>(8) inicjuje całe urządzenie i nie sprawdza go pod kątem błędnych bloków.
uk: Повторно ініціалізувати (виконати mkswap) простір резервної пам'яті, якщо розмір його сторінки не відповідає розміру у поточному запущеному ядрі системи. B<mkswap>(8) ініціалізує увесь пристрій і не перевіряє пристрій на наявність помилкових блоків.

source: B<-L> I<label>
de: B<-L> I<Bezeichnung>
pl: B<-L> I<etykieta>
uk: B<-L> I<мітка>

source: Use the partition that has the specified I<label>. (For this, access to I</proc/partitions> is needed.)
de: verwendet die Partition mit der angegebenen I<Bezeichnung> (dafür ist Zugriff auf I</proc/partitions> erforderlich).
pl: Używa partycji z określoną I<etykietą> (potrzebny jest w tym celu dostęp do I</proc/partitions>).
uk: Використати розділ, який має вказану I<мітку>. (Для цього потрібен доступу до I</proc/partitions>.)

source: B<-o>, B<--options> I<opts>
de: B<-o>, B<--options> I<Optionen>
pl: B<-o>, B<--options> I<opcje>
uk: B<-o>, B<--options> I<параметри>

source: Specify swap options by an I<fstab>-compatible comma-separated string. For example:
de: gibt die Auslagerungsoptionen durch eine I<fstab>-kompatible, durch Kommata getrennte Zeichenkette an. Zum Beispiel:
pl: Podaje opcje swap jako rozdzielona przecinkami lista zgodna z formatem I<fstab>. Na przykład:
uk: Вказати параметри резервної пам'яті на диску за допомогою сумісного з I<fstab> рядка відокремлених комами значень. Приклад:

source: The I<opts> string is evaluated last and overrides all other command line options.
de: Die Zeichenkette I<Optionen> wird zuletzt ausgewertet und setzt alle Befehlszeilenoptionen außer Kraft.
pl: Łańcuch I<opts> jest przetwarzany ostatni i nadpisuje wszystkie inne opcje linii poleceń.
uk: Рядок I<параметри> буде оброблено останнім, він має вищий пріоритет над усіма іншими параметрами рядка команди.

source: B<-p>, B<--priority> I<priority>
de: B<-p>, B<--priority> I<Priorität>
pl: B<-p>, B<--priority> I<priorytet>
uk: B<-p>, B<--priority> I<пріоритетність>

source: Specify the priority of the swap device. I<priority> is a value between -1 and 32767. Higher numbers indicate higher priority. See B<swapon>(2) for a full description of swap priorities. Add B<pri=>I<value> to the option field of I</etc/fstab> for use with B<swapon -a>. When no priority is defined, it defaults to -1.
de: legt die Priorität des Auslagerungsgerätes fest. Die Priorität ist ein Wert zwischen -1 und 32767. Ein höherer Wert bedeutet eine höhere Priorität. Siehe B<swapon>(2) für eine vollständige Beschreibung der Auslagerungsprioritäten. Fügen Sie B<pri=>I<Wert> zum Optionsfeld in der Datei I</etc/fstab> hinzu, um diesen Wert mit B<swapon -a> zu verwenden. Wenn keine Priorität angegeben ist, wird standardmäßig -1 verwendet.
pl: Określa priorytet urządzenia wymiany. I<Priorytet> jest wartością z przedziału pomiędzy -1 a 32767. Wyższa liczba oznacza wyższy priorytet. Podręcznik polecenia B<swapon>(2) zawiera pełny opis priorytetów swap. Do pliku I</etc/fstab> można dodać opcję B<pri=>I<wartość>, która będzie używana ze B<swapon -a>. Jeśli nie zdefiniowano priorytetu,to wartością domyślną jest -1.
uk: Вказати пріоритетність пристрою резервної пам'яті. I<пріоритетність> є значенням від -1 до 32767. Більші значення означають вищу пріоритетність. Див. B<swapon>(2), щоб ознайомитися із усіма описами пріоритетностей резервної пам'яті на диску. Додайте B<pri=>I<значення> до поля параметрів I</etc/fstab>, щоб скористатися у поєднанні із B<swapon -a>. Якщо пріоритетності не визначено, типовим значенням буде -1.

source: Display swap usage summary by device. Equivalent to B<cat /proc/swaps>. This output format is DEPRECATED in favour of B<--show> that provides better control on output data.
de: zeigt eine Zusammenfassung der Nutzung der Auslagerung nach Gerät an. Dies ist gleichbedeutend mit B<cat /proc/swaps>. Dieses Ausgabeformat ist VERALTET. Sie sollten stattdessen B<--show> verwenden, das Ihnen eine bessere Kontrolle über die Ausgabedaten ermöglicht.
pl: Wyświetla podsumowanie użycia swapu wg urządzenia. Jest to odpowiednik B<cat /proc/swaps>. Ten format wyjścia jest PRZESTARZAŁY. Zalecany format B<--show> dostarcza większej kontroli nad danymi wyjściowymi.
uk: Вивести резюме щодо використання резервної пам'яті на диску за пристроями. Еквівалент B<cat /proc/swaps>. Цей формат виведення даних є ЗАСТАРІЛИМ, його замінено на параметр B<--show>, який забезпечує краще керування виведенням даних.

source: B<--show>[B<=>I<column>...]
de: B<--show>[B<=>I<Spalte> …]
pl: B<--show>[B<=>I<kolumna>...]
uk: B<--show>[B<=>I<стовпчик>...]

source: Display a definable table of swap areas. See the B<--help> output for a list of available columns.
de: zeigt eine definierbare Tabelle der Auslagerungsbereiche an. Siehe die Ausgabe mit B<--help> für eine Liste der verfügbaren Spalten.
pl: Wyświetla możliwą do zdefiniowania tabelę obszarów swap. Listę dostępnych kolumn można znaleźć w wyjściu opcji B<--help>.
uk: Вивести придатну до визначення таблицю областей резервної пам'яті на диску. Див. виведення команди з параметром B<--help>, щоб ознайомитися зі списком доступних стовпчиків.

source: Output all available columns.
de: gibt alle verfügbaren Spalten aus.
pl: Wypisuje wszystkie dostępne kolumny.
uk: Вивести список усіх доступних стовпчиків.

source: Do not print headings when displaying B<--show> output.
de: zeigt mit B<--show> keine Überschriften an.
pl: Nie wyświetla nagłówków w wyjściu opcji B<--show>.
uk: Не виводити заголовки при виведенні на основі B<--show>.

source: Display B<--show> output without aligning table columns.
de: führt mit B<--show> keine Ausrichtung der Tabellenspalten durch.
pl: Nie wyrównuje kolumn tabeli wyświetlanej przez B<--show>.
uk: Виводити дані B<--show> без вирівнювання стовпчиків таблиці.

source: Display swap size in bytes in B<--show> output instead of in user-friendly units.
de: zeigt in der Ausgabe von B<--show> die Auslagerungsgröße in Byte anstelle von benutzerfeundlichen Einheiten an.
pl: Opcja B<--show> wyświetla rozmiar przestrzeni wymiany w bajtach, a nie w jednostkach czytelnych dla użytkownika.
uk: Показати розмір області свопінгу (резервної пам'яті) у байтах у виведенні B<--show> замість зручних для читання одиниць.

source: Use the partition that has the specified I<uuid>.
de: verwendet die Partition mit der angegebenen I<UUID>.
pl: Używa partycji o określonym I<uuid> (unikalnym identyfikatorze).
uk: Використати розділ, який має вказаний I<uuid>.

source: Be verbose.
de: Ausführlicher Modus.
pl: Więcej szczegółów.
uk: Режим докладних повідомлень.

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
pl: Wyświetla ten tekst i kończy pracę.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
de: zeigt die Versionsnummer an und beendet das Programm.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: EXIT STATUS
pl: KOD ZAKOŃCZENIA
uk: СТАН ВИХОДУ

source: B<swapoff> has the following exit status values since v2.36:
de: Seit Version 2.36 hat B<swapoff> die folgenden Exit-Status-Werte:
pl: B<swapoff> ma następujące wartości kodów zakończenia od wersji v2.36:
uk: B<swapoff> має такі значення стану виходу, починаючи з версії 2.36:

source: success
de: Erfolg
pl: sukces
uk: успіх

source: system has insufficient memory to stop swapping (OOM)
de: Es ist nicht genügend Systemspeicher verfügbar, um die Auslagerung zu beenden (OOM).
pl: system ma zbyt mało pamięci aby zaprzestać używania przestrzeni wymiany (OOM)
uk: у системі недостатньо пам'яті, щоб припинити використання резервної пам'яті на диску (OOM)

source: B<swapoff>(2) syscall failed for another reason
de: Der Systemaufruf B<swapoff>(2) schlug aus einem anderen Grund fehl.
pl: wywołanie systemowe B<swapoff>(2) nie powiodło się z innych przyczyn
uk: системний виклик B<swapoff>(2) зазнав невдачі з іншої причини

source: non-B<swapoff>(2) syscall system error (out of memory, ...)
de: Nicht auf dem Systemaufruf B<swapoff>(2) basierender Systemfehler (Speicher ausgeschöpft, …).
uk: не пов'язана із системним викликом B<swapoff>(2) помилка (не вистачає пам'яті...)

source: usage or syntax error
de: Aufruf- oder Syntaxfehler
pl: błąd użycia lub składni
uk: помилка використання або синтаксична помилка

source: all swapoff failed on B<--all>
de: Alle B<swapoff>(2)-Systemaufrufe sind beim Aufruf mit B<--all> fehlgeschlagen.
pl: wszystkie wywołania swapoff nie powiodły się (przy użyciu opcji B<--all>)
uk: усі виклики swapoff завершилися помилками при використанні B<--all>

source: some swapoff succeeded on B<--all>
de: Einige B<swapoff>(2)-Systemaufrufe waren beim Aufruf mit B<--all> erfolgreich.
pl: część wywołań swapoff powiodła się (przy użyciu opcji B<--all>)
uk: деякі з викликів swapoff було здійснено успішно при використанні з B<--all>

source: The command B<swapoff --all> returns 0 (all succeeded), 32 (all failed), or 64 (some failed, some succeeded).
de: Der Befehl B<swapoff --all> gibt 0 zurück (alles erfolgreich), 32 (alles fehlgeschlagen) oder 64 (teilweise erfolgreich, teilweise fehlgeschlagen).
pl: Polecenie B<swapoff --all> zwraca 0 (wszystkie się powiodły), 32 (wszystkie nie powiodły się) lub 64 (część się powiodła, a część nie).
uk: Команда B<swapoff --all> повертає 0 (усі успішно), 32 (усі невдало) або 64 (деякі невдало, деякі успішно).

source: + The old versions before v2.36 has no documented exit status, 0 means success in all versions.
de: + Für die alten Versionen vor Version 2.36 war kein Exit-Status dokumentiert; 0 bedeutet Erfolg in allen Versionen.
pl: + Wersje starsze niż v2.36 nie mają udokumentowanego kodu zakończenia, natomiast 0 oznacza sukces we wszystkich wersjach.
uk: + У старих версіях до 2.36 не мали документованих стані виходу, 0 означає «успіх» в усіх версіях.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
pl: ŚRODOWISKO
uk: СЕРЕДОВИЩЕ

source: enables B<libmount> debug output.
de: aktiviert die Fehlersuchausgabe für B<libmount>.
pl: włącza wyjście debugowania B<libmount>.
uk: вмикає показ діагностичних повідомлень B<libmount>.

source: enables B<libblkid> debug output.
de: aktiviert die Debug-Ausgabe für B<libblkid>.
pl: włącza wyjście debugowania B<libblkid>.
uk: вмикає показ діагностичних повідомлень B<libblkid>.

source: FILES
de: DATEIEN
pl: PLIKI
uk: ФАЙЛИ

source: standard paging devices
de: Standard-Paging-Geräte
pl: standardowe urządzenia stronicowania
uk: стандартні пристрої поділу на сторінки

source: ascii filesystem description table
de: ASCII-Beschreibungstabelle der Dateisysteme
pl: tablica opisująca systemy plików w ascii
uk: таблиця опису файлової системи символами ASCII

source: NOTES
de: ANMERKUNGEN
pl: UWAGI
uk: ПРИМІТКИ

source: Files with holes
de: Dateien mit Löchern
pl: Pliki z dziurami
uk: Файли з дірками

source: The swap file implementation in the kernel expects to be able to write to the file directly, without the assistance of the filesystem. This is a problem on files with holes or on copy-on-write files on filesystems like Btrfs.
de: Die Implementierung der Auslagerungsdatei im Kernel erwartet, dass ohne Hilfe des Dateisystems direkt in die Datei geschrieben werden kann. Dies ist bei Dateien mit Löchern oder auf Copy-On-Write-Dateisystemen wie B<btrfs> ein Problem.
pl: Implementacja pliku wymiany w jądrze spodziewa się możliwości bezpośrednich zapisów do pliku, to jest bez pośrednictwa systemu plików. Stanowi to problem na plikach z dziurami oraz na systemach plików copy-on-write (kopiuj przy zapisie), takich jak Btrfs.
uk: Реалізація файла резервної пам'яті у ядрі передбачає можливість запису до файла безпосередньо, без допомоги з боку файлової системи. Це є проблемою для файлів із дірками або файлів із копіюванням при запису у файлових системах, які подібні до Btrfs.

source: Commands like B<cp>(1) or B<truncate>(1) create files with holes. These files will be rejected by B<swapon>.
de: Befehle wie B<cp>(1) oder B<truncate>(1) erstellen Dateien mit Löchern. Solche Dateien werden von B<swapon> abgewiesen.
pl: Polecenia takie jak B<cp>(1) lub B<truncate>(1) tworzą pliki z dziurami. Zostaną one odrzucone przez B<swapon>.
uk: Команди like B<cp>(1) і B<truncate>(1) створюють файли з дірками. Ці файли буде відкинуто B<swapon>.

source: Preallocated files created by B<fallocate>(1) may be interpreted as files with holes too depending of the filesystem. Preallocated swap files are supported on XFS since Linux 4.18.
de: Von B<fallocate>(1) erstellte vorzugewiesene Dateien könnten, abhängig vom Dateisystem, auch als Dateien mit Löchern interpretiert werden. Vorzugewiesene Auslagerungsdateien werden von XFS auf Linux seit Kernel 4.18 unterstützt.
pl: Prealokowane pliki tworzone przez B<fallocate>(1) mogą być również interpretowane jako pliki z dziurami, w zależności od systemu plików. Prealokowane pliki wymiany są obsługiwane w systemie plików XFS od jądra Linux w wersji 4.18.
uk: Попередньо розміщені файли, які створено за допомогою B<fallocate>(1), може бути також оброблено як файли із дірками, залежно від файлової системи. Підтримку попереднього розміщення файлів резервної пам'яті на диску у XFS передбачено, починаючи з Linux 4.18.

source: The most portable solution to create a swap file is to use B<dd>(1) and I</dev/zero>.
de: Die am besten portable Lösung zur Erstellung einer Auslagerungsdatei ist die Verwendung von B<dd>(1) und I</dev/zero>.
pl: Najbardziej przenośnym rozwiązaniem jest tworzenie plików wymiany za pomocą B<dd>(1) i I</dev/zero>.
uk: Найпридатнішим для портування рішенням зі створення файла резервної пам'яті є використання B<dd>(1) і I</dev/zero>.

source: Swap files on Btrfs are supported since Linux 5.0 on files with B<nocow> attribute. See the B<btrfs>(5) manual page for more details.
de: Auslagerungsdateien auf Btrfs-Dateisystemen werden für Dateien mit dem Attribut B<nocow> seit Linux 5.0 unterstützt. In der Handbuchseite zu B<btrfs>(5) finden Sie weitere Details.
uk: Підтримку файлів резервної пам'яті на Btrfs реалізовано, починаючи з Linux 5.0 для файлів із атрибутом B<nocow>. Див. сторінку підручника щодо B<btrfs>(5), щоб дізнатися більше.

source: Swap over B<NFS> may not work.
de: Auslagerung über B<NFS> funktioniert möglicherweise nicht.
pl: Swap poprzez B<NFS> może nie działać.
uk: Використання резервної пам'яті із B<NFS> може не працювати.

source: Suspend
de: Suspendierung
pl: Stan wstrzymania
uk: Призупинення
