Repository: sebras/manpages-l10n
Catalog: po/*/man8/swapon.8.po
Languages: de, pl, uk

source: B<swapon> automatically detects and rewrites a swap space signature with old software suspend data (e.g., B<S1SUSPEND>, B<S2SUSPEND>, ...). The problem is that if we don\(cqt do it, then we get data corruption the next time an attempt at unsuspending is made.
de: B<swapon> erkennt die Signatur eines Auslagerungsbereichs mit alten Suspend-Daten (zum Beispiel B<S1SUSPEND>, B<S2SUSPEND>, …) automatisch und schreibt diese neu. Das Problem ist, dass wenn dies nicht getan würde, dann würden beim nächsten Versuch des Aufwachens Daten beschädigt.
pl: Polecenie B<swapon> automatycznie wykrywa i nadpisuje podpis przestrzeni wymiany ze starymi danymi wstrzymania (np. B<S1SUSPEND>, B<S2SUSPEND>, ...). Jest to konieczne, gdyż w przeciwnym wypadku nastąpiłoby uszkodzenie danych przy kolejnej próbie wybudzenia.
uk: B<swapon> автоматично виявляє і перезаписує підпис простору резервної пам'яті із застарілими даними призупинення роботи програмного забезпечення (наприклад, B<S1SUSPEND>, B<S2SUSPEND> ...). Проблема полягає у тому, що якщо цього не робити, ми отримаємо пошкодження даних під час наступної спроби виходу зі стану призупинення.

source: HISTORY
de: GESCHICHTE
pl: HISTORIA
uk: ЖУРНАЛ

source: The B<swapon> command appeared in 4.0BSD.
de: Der Befehl B<swapon> erschien in 4.0BSD.
pl: Polecenie B<swapon> pojawiło się w 4.0BSD.
uk: Команда B<swapon> з'явилася у 4.0BSD.

source: SEE ALSO
de: SIEHE AUCH
pl: ZOBACZ TAKŻE
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
pl: ZGŁASZANIE BŁĘDÓW
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
pl: Raporty o błędach proszę zgłaszać pod adresem
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
pl: DOSTĘPNOŚĆ
uk: ДОСТУПНІСТЬ

source: The B<swapon> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<swapon> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
pl: Polecenie B<swapon> jest częścią pakietu util-linux i można je pobrać ze strony
uk: B<swapon> є частиною пакунка util-linux, який можна отримати з

source: October 2014
de: Oktober 2014
pl: październik 2014
uk: Жовтень 2014 року

source: The device or file used is given by the I<specialfile> parameter. It may be of the form B<-L>I< label> or B<-U>I< uuid> to indicate a device by label or uuid.
de: Das zu verwendende Gerät oder die zu verwendende Datei wird über das Argument I<Spezialdatei> angegeben. Es kann in der Form B<-L>I< Bezeichnung> oder B<-U>I< UUID> vorliegen, um das Gerät anhand der Bezeichnung oder UUID anzugeben.
pl: Urządzenie lub plik może być podany za pomocą parametru I<plik-specjalny>. Może mieć on postać B<-L>I< etykieta> lub B<-U>I< uuid>, aby określić urządzenie za pomocą etykiety lub uuid (unikatowego identyfikatora).
uk: Використаний пристрій або файл задає параметр I<спеціальний-файл>. Його може бути задано у формі B<-L> I<мітка> або B<-U> I<uuid> для визначення пристрою за міткою або UUID.

source: B<swapoff> disables swapping on the specified devices and files. When the B<-a> flag is given, swapping is disabled on all known swap devices and files (as found in I</proc/swaps> or I</etc/fstab>).
de: B<swapoff> deaktiviert die Auslagerung auf den angegebenen Geräten und Dateien. Wenn der Schalter B<-a> angegeben wird, wird die Auslagerung auf allen bekannten Auslagerungsgeräten und -dateien (die in I</proc/swaps> oder I</etc/fstab> gefunden werden) deaktiviert.
pl: Polecenie B<swapoff> wyłącza wymianę na podanych urządzeniach i plikach. Jeśli użyto opcji B<-a>, to swap jest wyłączany na wszystkich znanych urządzeniach i plikach wymiany (zgodnie z plikiem I</proc/swaps> lub I</etc/fstab>).
uk: B<swapoff> вимикає резервну пам'ять на вказаних пристроях і у файлах. Якщо задано прапорець B<-a>, резервну пам'ять на диску вимкнено для усіх відомих пристроїв і файлів резервної пам'яті (які буде знайдено у I</proc/swaps> або I</etc/fstab>).

source: All devices marked as ``swap'' in I</etc/fstab> are made available, except for those with the ``noauto'' option. Devices that are already being used as swap are silently skipped.
de: Alle in der Datei I</etc/fstab> mit »swap« markierten Geräte werden verfügbar gemacht, außer jenen mit der Option »noauto«. Geräte, die bereits für die Auslaqerung in Verwendung sind, werden stillschweigend übersprungen.
pl: Udostępnia wszystkie urządzenia oznaczone jako "swap" w pliku I</etc/fstab>, z wyjątkiem plików z opcją "noauto". Urządzenia, które są już używane jako swap, są po cichu pomijane.
uk: Усі пристрої, які позначено як «swap» в I</etc/fstab>, буде зроблено доступними, окрім тих, які вказано із параметром «noauto». Пристрої, які вже використовуються для резервної пам'яті, буде без повідомлень пропущено.

source: B<-d>,B< --discard>[B<=>I<policy>]
de: B<-d>,B< --discard>[B<=>I<Regel>]
pl: B<-d>,B< --discard>[B<=>I<tryb>]
uk: B<-d>, B<--discard>[B<=>I<правила>]

source: Enable swap discards, if the swap backing device supports the discard or trim operation. This may improve performance on some Solid State Devices, but often it does not. The option allows one to select between two available swap discard policies: B<--discard=once> to perform a single-time discard operation for the whole swap area at swapon; or B<--discard=pages> to asynchronously discard freed swap pages before they are available for reuse. If no policy is selected, the default behavior is to enable both discard types. The I</etc/fstab> mount options B<discard>, B<discard=once>, or B<discard=pages> may also be used to enable discard flags.
de: aktiviert Auslagerungs-Verwerfungen, falls das zugrundeliegende Auslagerungsgerät die Verwerfungs- oder Kürzungsaktionen (»discard« bzw. »trim«) unterstützt. Dies könnte die Performance auf SSD-Geräten verbessern, was aber oft nicht der Fall ist. Mit der Option können Sie zwischen zwei verfügbaren Auslagerungs-Verwerfungsregeln wählen: B<--discard=once> zum Ausführen einer einmaligen Verwerfungsaktion für den gesamten Auslagerungsbereich bei dessen Aktivierung; oder B<--discard=pages> zum asynchronen Verwerfen freigestellter Auslagerungsseiten, bevor diese zur erneuten Nutzung verfügbar gemacht werden. Wenn keine Regel ausgewählt ist, werden standardmäßig beide Verwerfungstypen aktiviert. Die Einhängeoptionen B<discard>, B<discard=once> oder B<discard=pages> in der Datei I</etc/fstab> könnten ebenfalls zum Aktivieren der Verwerfungsschalter verwendet werden.
pl: Włącza odrzucanie (discard), jeśli urządzenie, na którym jest swap, pozwala na operacje discard lub trim. Może to pozytywnie wpłynąć na wydajność na niektórych dyskach półprzewodnikowych, ale często tak nie jest. Opcja pozwala na wybór spośród dwóch dostępnych trybów odrzucania: B<--discard=once> do przeprowadzania pojedynczych operacji odrzucania całej przestrzeni wymiany lub B<--discard=pages> do asynchronicznego odrzucania zwolnionych stron wymiany przed udostępnieniem ich do ponownego użycia. Jeśli nie wybierze się żadnego z tych trybów, to domyślnym zachowaniem jest włączenie ich obu. Można również włączyć odrzucanie w I</etc/fstab> za pomocą opcji montowania B<discard>, B<discard=once> lub B<discard=pages>.
uk: Увімкнути відкидання резервної пам'яті на диску, якщо підтримку дії з відкидання або обрізання передбачено для базового пристрою резервної пам'яті. Це може удосконалити швидкодію на деяких пристроях SSD, але часто цього не відбувається. За допомогою цього параметра можна вибрати між двома доступними правилами відкидання резервної пам'яті на диску: B<--discard=once> для виконання одноразової дії з відкидання для усієї області резервної пам'яті на диску при виконанні swapon; або B<--discard=pages> для асинхронного відкидання вивільнених сторінок резервної пам'яті на диску до того, як вони стануть доступними для повторного використання. Якщо не вибрано жодних правил, типовою поведінкою буде вмикання обох типів відкидання. Для вмикання прапорців відкидання можна також скористатися параметрами монтування I</etc/fstab> B<discard>, B<discard=once> або B<discard=pages>.

source: Silently skip devices that do not exist. The I</etc/fstab> mount option B<nofail> may also be used to skip non-existing device.
de: überspringt nicht vorhandene Geräte stillschweigend. Sie können auch die Einhängeoption B<nofail> in I</etc/fstab> verwenden, um nicht vorhandene Geräte zu überspringen.
pl: Pomija po cichu nieistniejące urządzenia. Opcja montowania B<nofail> w I</etc/fstab> może być również użyta do pomijania nieistniejących urządzeń.
uk: Без повідомлень пропускати пристрої, яких не існує. Також для пропускання пристроїв, яких не існує, можна скористатися параметром монтування B<nofail> в I</etc/fstab>.

source: Reinitialize (exec mkswap) the swap space if its page size does not match that of the current running kernel. B<mkswap>(8) initializes the whole device and does not check for bad blocks.
de: initialisiert den Auslagerungsbereich neu (mittels B<mkswap>), falls die Seitengröße nicht der des aktuellen Kernels entspricht. B<mkswap>(8) initialisiert das gesamte Gerät und prüft nicht auf defekte Blöcke.
pl: Ponownie inicjuje przestrzeń swap (exec mkswap), jeśli rozmiar strony nie pasuje do rozmiaru podawanego przez obecnie uruchomione jądro. Polecenie B<mkswap>(8) inicjuje całe urządzenie i nie sprawdza go pod kątem błędnych bloków.
uk: Повторно ініціалізувати (виконати mkswap) простір резервної пам'яті, якщо розмір його сторінки не відповідає розміру у поточному запущеному ядрі системи. B<mkswap>(8) ініціалізує увесь пристрій і не перевіряє пристрій на наявність помилкових блоків.

source: B<-L>I< label>
de: B<-L>I< Bezeichnung>
pl: B<-L>I< etykieta>
uk: B<-L> I<мітка>

source: Use the partition that has the specified I<label>. (For this, access to I</proc/partitions> is needed.)
de: verwendet die Partition mit der angegebenen I<Bezeichnung> (dafür ist Zugriff auf I</proc/partitions> erforderlich).
pl: Używa partycji z określoną I<etykietą> (potrzebny jest w tym celu dostęp do I</proc/partitions>).
uk: Використати розділ, який має вказану I<мітку>. (Для цього потрібен доступу до I</proc/partitions>.)

source: B<-o>,B< --options >I<opts>
de: B<-o>,B< --options >I<Optionen>
pl: B<-o>,B< --options >I<opcje>
uk: B<-o>,B< --options >I<параметри>

source: Specify swap options by an fstab-compatible comma-separated string. For example:
de: gibt die Auslagerungsoptionen durch eine Fstab-kompatible, durch Kommata getrennte Zeichenkette an. Zum Beispiel:
pl: Podaje opcje swap jako rozdzielona przecinkami lista zgodna z formatem fstab. Na przykład:
uk: Вказати параметри резервної пам'яті на диску за допомогою сумісного з I<fstab> рядка відокремлених комами значень. Приклад:

source: B<-p>,B< --priority >I<priority>
de: B<-p>,B< --priority >I<Priorität>
pl: B<-p>,B< --priority >I<priorytet>
uk: B<-p>, B<--priority> I<пріоритетність>

source: Specify the priority of the swap device. I<priority> is a value between -1 and 32767. Higher numbers indicate higher priority. See B<swapon>(2) for a full description of swap priorities. Add B<pri=>I<value> to the option field of I</etc/fstab> for use with B<swapon -a>. When no priority is defined, it defaults to -1.
de: legt die Priorität des Auslagerungsgerätes fest. Die Priorität ist ein Wert zwischen -1 und 32767. Ein höherer Wert bedeutet eine höhere Priorität. Siehe B<swapon>(2) für eine vollständige Beschreibung der Auslagerungsprioritäten. Fügen Sie B<pri=>I<Wert> zum Optionsfeld in der Datei I</etc/fstab> hinzu, um diesen Wert mit B<swapon -a> zu verwenden. Wenn keine Priorität angegeben ist, wird standardmäßig -1 verwendet.
pl: Określa priorytet urządzenia wymiany. I<Priorytet> jest wartością z przedziału pomiędzy -1 a 32767. Wyższa liczba oznacza wyższy priorytet. Podręcznik polecenia B<swapon>(2) zawiera pełny opis priorytetów swap. Do pliku I</etc/fstab> można dodać opcję B<pri=>I<wartość>, która będzie używana ze B<swapon -a>. Jeśli nie zdefiniowano priorytetu,to wartością domyślną jest -1.
uk: Вказати пріоритетність пристрою резервної пам'яті. I<пріоритетність> є значенням від -1 до 32767. Більші значення означають вищу пріоритетність. Див. B<swapon>(2), щоб ознайомитися із усіма описами пріоритетностей резервної пам'яті на диску. Додайте B<pri=>I<значення> до поля параметрів I</etc/fstab>, щоб скористатися у поєднанні із B<swapon -a>. Якщо пріоритетності не визначено, типовим значенням буде -1.

source: Display swap usage summary by device. Equivalent to "cat /proc/swaps". This output format is DEPRECATED in favour of B<--show> that provides better control on output data.
de: zeigt eine Zusammenfassung der Nutzung der Auslagerung nach Gerät an. Dies ist gleichbedeutend mit »cat /proc/swaps«. Dieses Ausgabeformat ist VERALTET. Sie sollten stattdessen B<--show> verwenden, das Ihnen eine bessere Kontrolle über die Ausgabedaten ermöglicht.
pl: Wyświetla podsumowanie użycia swapu wg urządzenia. Jest to odpowiednik "cat /proc/swaps". Ten format wyjścia jest PRZESTARZAŁY. Zalecany format B<--show> dostarcza większej kontroli nad danymi wyjściowymi.
uk: Вивести резюме щодо використання резервної пам'яті на диску за пристроями. Еквівалент B<cat /proc/swaps>. Цей формат виведення даних є ЗАСТАРІЛИМ, його замінено на параметр B<--show>, який забезпечує краще керування виведенням даних.

source: Display a definable table of swap areas. See the B<--help> output for a list of available columns.
de: zeigt eine definierbare Tabelle der Auslagerungsbereiche an. Siehe die Ausgabe mit B<--help> für eine Liste der verfügbaren Spalten.
pl: Wyświetla możliwą do zdefiniowania tabelę obszarów swap. Lista dostępnych kolumn można znaleźć w wyjściu opcji B<--help>.
uk: Вивести придатну до визначення таблицю областей резервної пам'яті на диску. Див. виведення команди з параметром B<--help>, щоб ознайомитися зі списком доступних стовпчиків.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
pl: Wyświetla informacje o wersji i kończy działanie.
uk: Вивести дані щодо версії і завершити роботу.

source: swapoff syscall failed for another reason
de: Der Systemaufruf B<swapoff>(2) schlug aus einem anderen Grund fehl.
pl: wywołanie systemowe swapoff nie powiodło się z innych przyczyn
uk: системний виклик B<swapoff>(2) зазнав невдачі з іншої причини

source: non-swapoff syscall system error (out of memory, ...)
de: Nicht auf dem Systemaufruf B<swapoff>(2) basierender Systemfehler (Speicher ausgeschöpft, …).
pl: błąd wywołania systemowego niezwiązany z swapoff (za mało pamięci itp.)
uk: не пов'язана із системним викликом B<swapoff>(2) помилка (не вистачає пам'яті...)

source: The old versions before v2.36 has no documented exit status, 0 means success in all versions.
de: Für die alten Versionen vor Version 2.36 war kein Exit-Status dokumentiert; 0 bedeutet Erfolg in allen Versionen.
pl: Wersje starsze niż v2.36 nie mają udokumentowanego kodu zakończenia, natomiast 0 oznacza sukces we wszystkich wersjach.
uk: У старих версіях до 2.36 не мали документованих стані виходу, 0 означає «успіх» в усіх версіях.

source: enables libmount debug output.
de: aktiviert die Fehlersuchausgabe für libmount.
pl: włącza wyjście debugowania libmount.
uk: вмикає показ діагностичних повідомлень libmount.

source: enables libblkid debug output.
de: aktiviert die Debug-Ausgabe für libblkid.
pl: włącza wyjście debugowania libblkid.
uk: вмикає показ діагностичних повідомлень libblkid.

source: I</dev/sd??> standard paging devices
de: I</dev/sd??> Standard-Paging-Geräte
pl: I</dev/sd??> standardowe urządzenia stronicowania
uk: I</dev/sd??> стандартні пристрої поділу на сторінки

source: I</etc/fstab> ascii filesystem description table
de: I</etc/fstab> ASCII-Beschreibungstabelle der Dateisysteme
pl: I</etc/fstab> tablica opisująca systemy plików w ascii
uk: I</etc/fstab> таблиця опису файлової системи символами ASCII

source: The swap file implementation in the kernel expects to be able to write to the file directly, without the assistance of the filesystem. This is a problem on files with holes or on copy-on-write files on filesystems like Btrfs.
de: Die Implementierung der Auslagerungsdatei im Kernel erwartet, dass ohne Hilfe des Dateisystems direkt in die Datei geschrieben werden kann. Dies ist bei Dateien mit Löchern oder auf Copy-On-Write-Dateisystemen wie B<btrfs> ein Problem.
pl: Implementacja pliku wymiany w jądrze spodziewa się możliwości bezpośrednich zapisów do pliku, to jest bez pośrednictwa systemu plików. Stanowi to problem na plikach z dziurami oraz na systemach plików copy-on-write (kopiuj przy zapisie), takich jak Btrfs.
uk: Реалізація файла резервної пам'яті у ядрі передбачає можливість запису до файла безпосередньо, без допомоги з боку файлової системи. Це є проблемою для файлів із дірками або файлів із копіюванням при запису у файлових системах, які подібні до Btrfs.

source: Commands like B<cp>(1) or B<truncate>(1) create files with holes. These files will be rejected by swapon.
de: Befehle wie B<cp>(1) oder B<truncate>(1) erstellen Dateien mit Löchern. Solche Dateien werden von B<swapon> abgewiesen.
pl: Polecenia takie jak B<cp>(1) lub B<truncate>(1) tworzą pliki z dziurami. Zostaną one odrzucone przez swapon.
uk: Команди like B<cp>(1) і B<truncate>(1) створюють файли з дірками. Ці файли буде відкинуто B<swapon>.

source: Preallocated files created by B<fallocate>(1) may be interpreted as files with holes too depending of the filesystem. Preallocated swap files are supported on XFS since Linux 4.18.
de: Von B<fallocate>(1) erstellte vorzugewiesene Dateien könnten, abhängig vom Dateisystem, auch als Dateien mit Löchern interpretiert werden. Vorzugewiesene Auslagerungsdateien werden von XFS auf Linux seit Kernel 4.18 unterstützt.
pl: Prealokowane pliki tworzone przez B<fallocate>(1) mogą być również interpretowane jako pliki z dziurami, w zależności od systemu plików. Prealokowane pliki wymiany są obsługiwane w systemie plików XFS od jądra Linux w wersji 4.18.
uk: Попередньо розміщені файли, які створено за допомогою B<fallocate>(1), може бути також оброблено як файли із дірками, залежно від файлової системи. Підтримку попереднього розміщення файлів резервної пам'яті на диску у XFS передбачено, починаючи з Linux 4.18.

source: The most portable solution to create a swap file is to use B<dd>(1) and /dev/zero.
de: Die am besten portable Lösung zur Erstellung einer Auslagerungsdatei ist die Verwendung von B<dd>(1) und /dev/zero.
pl: Najbardziej przenośnym rozwiązaniem jest tworzenie plików wymiany za pomocą B<dd>(1) i I</dev/zero>.
uk: Найпридатнішим для портування рішенням зі створення файла резервної пам'яті є використання B<dd>(1) і I</dev/zero>.

source: Swap files on Btrfs are supported since Linux 5.0 on files with nocow attribute. See the B<btrfs>(5) manual page for more details.
de: Auslagerungsdateien auf Btrfs-Dateisystemen werden für Dateien mit dem Attribut B<nocow> seit Linux 5.0 unterstützt. In der Handbuchseite zu B<btrfs>(5) finden Sie weitere Details.
pl: Pliki wymiany w systemie plików Btrfs są obsługiwane od jądra Linux w wersji 5.0 (pliki z atrybutem nocow). Strona podręcznika systemowego B<btrfs>(5) zawiera więcej informacji na ten temat.
uk: Підтримку файлів резервної пам'яті на Btrfs реалізовано, починаючи з Linux 5.0 для файлів із атрибутом B<nocow>. Див. сторінку підручника щодо B<btrfs>(5), щоб дізнатися більше.

source: B<swapon> automatically detects and rewrites a swap space signature with old software suspend data (e.g., S1SUSPEND, S2SUSPEND, ...). The problem is that if we don't do it, then we get data corruption the next time an attempt at unsuspending is made.
de: B<swapon> erkennt die Signatur eines Auslagerungsbereichs mit alten Suspend-Daten (zum Beispiel S1SUSPEND, S2SUSPEND, …) automatisch und schreibt diese neu. Das Problem ist, dass wenn dies nicht getan würde, dann würden beim nächsten Versuch des Aufwachens Daten beschädigt.
pl: Polecenie B<swapon> automatycznie wykrywa i nadpisuje podpis przestrzeni wymiany ze starymi danymi wstrzymania (np. S1SUSPEND, S2SUSPEND, ...). Jest to konieczne, gdyż w przeciwnym wypadku nastąpiłoby uszkodzenie danych przy kolejnej próbie wybudzenia.
uk: B<swapon> автоматично виявляє і перезаписує підпис простору резервної пам'яті із застарілими даними призупинення роботи програмного забезпечення (наприклад, S1SUSPEND, S2SUSPEND...). Проблема полягає у тому, що якщо цього не робити, ми отримаємо пошкодження даних під час наступної спроби виходу зі стану призупинення.

source: The swapon command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl B<swapon> ist Teil des Pakets util-linux, welches auf https://www.kernel.org/pub/linux/utils/util-linux/ verfügbar ist.
pl: Polecenie swapon jest częścią pakietu util-linux i jest dostępne pod adresem https://www.kernel.org/pub/linux/utils/util-linux/.
uk: Програма swapon є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: Swap files on Btrfs are supported since Linux 5.0 on files with nocow attribute. See the B<btrfs>(5) manual page for more details.
de: Auslagerungsdateien auf Btrfs-Dateisystemen werden für Dateien mit dem Attribut B<nocow> seit Linux 5.0 unterstützt. In der Handbuchseite zu B<btrfs>(5) finden Sie weitere Details.
pl: Pliki wymiany w systemie plików Btrfs są obsługiwane od jądra Linux w wersji 5.0 (pliki z atrybutem nocow). Strona podręcznika systemowego B<btrfs>(5) zawiera więcej informacji na ten temat.
uk: Підтримку файлів резервної пам'яті на Btrfs реалізовано, починаючи з Linux 5.0 для файлів із атрибутом B<nocow>. Див. сторінку підручника щодо B<btrfs>(5), щоб дізнатися більше.

source: Specify swap options by an fstab-compatible comma-separated string. For example:
de: gibt die Auslagerungsoptionen durch eine Fstab-kompatible, durch Kommata getrennte Zeichenkette an. Zum Beispiel:
pl: Podaje opcje swap jako rozdzielona przecinkami lista zgodna z formatem fstab. Na przykład:
uk: Вказати параметри резервної пам'яті на диску за допомогою сумісного з I<fstab> рядка відокремлених комами значень. Приклад:

source: B<swapon> automatically detects and rewrites a swap space signature with old software suspend data (e.g., S1SUSPEND, S2SUSPEND, ...). The problem is that if we don\(cqt do it, then we get data corruption the next time an attempt at unsuspending is made.
de: B<swapon> erkennt die Signatur eines Auslagerungsbereichs mit alten Suspend-Daten (zum Beispiel S1SUSPEND, S2SUSPEND, …) automatisch und schreibt diese neu. Das Problem ist, dass wenn dies nicht getan würde, dann würden beim nächsten Versuch des Aufwachens Daten beschädigt.
pl: Polecenie B<swapon> automatycznie wykrywa i nadpisuje podpis przestrzeni wymiany ze starymi danymi wstrzymania (np. S1SUSPEND, S2SUSPEND, ...). Jest to konieczne, gdyż w przeciwnym wypadku nastąpiłoby uszkodzenie danych przy kolejnej próbie wybudzenia.
uk: B<swapon> автоматично виявляє і перезаписує підпис простору резервної пам'яті із застарілими даними призупинення роботи програмного забезпечення (наприклад, S1SUSPEND, S2SUSPEND...). Проблема полягає у тому, що якщо цього не робити, ми отримаємо пошкодження даних під час наступної спроби виходу зі стану призупинення.
