Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-networkd.service.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-networkd.service, systemd-networkd - Network manager
de: systemd-networkd.service, systemd-networkd - Netzwerkverwaltung

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-networkd> is a system service that manages networks\&. It detects and configures network devices as they appear, as well as creating virtual network devices\&.
de: B<systemd-networkd> ist ein Systemdienst, der Netzwerke verwaltet\&. Sobald Netzwerkgeräte verfügbar sind, werden diese erkannt und eingerichtet, ferner werden virtuelle Netzwerkgeräte erstellt\&.

source: To configure low-level link settings independently of networks, see B<systemd.link>(5)\&.
de: Informationen zu netzwerkunabhängigen Link-Einstellungen niederer Ebene finden Sie in B<systemd.link>(5)\&.

source: B<systemd-networkd> will create network devices based on the configuration in B<systemd.netdev>(5) files, respecting the [Match] sections in those files\&.
de: Basierend auf den Konfigurationsdateien in B<systemd.netdev>(5)-Dateien erstellt B<systemd-networkd> Netzgeräte. Dabei werden die Abschnitte [Match] in diesen Dateien beachtet\&.

source: B<systemd-networkd> will manage network addresses and routes for any link for which it finds a \&.network file with an appropriate [Match] section, see B<systemd.network>(5)\&. For those links, it will flush existing network addresses and routes when bringing up the device\&. Any links not matched by one of the \&.network files will be ignored\&. It is also possible to explicitly tell systemd-networkd to ignore a link by using I<Unmanaged=yes> option, see B<systemd.network>(5)\&.
de: B<systemd-networkd> verwaltet Netzadressen und -routen für jeden Link, für den es eine \&.network-Datei mit einem geeigneten Abschnitt [Match] findet, siehe B<systemd.network>(5)\&. Für diese Links wird es bestehende Netzadressen und -routen beim Hochbringen des Gerätes bereinigen\&. Alle Links, auf die keine der \&.network-Dateien passt, werden ignoriert\&. Es ist auch möglich, durch die Option I<Unmanaged=yes> systemd-networkd explizit mitzuteilen, einen Link zu ignorieren, siehe B<systemd.network>(5)\&.

source: When systemd-networkd exits, it generally leaves existing network devices and configuration intact\&. This makes it possible to transition from the initramfs and to restart the service without breaking connectivity\&. This also means that when configuration is updated and systemd-networkd is restarted, netdev interfaces for which configuration was removed will not be dropped, and may need to be cleaned up manually\&.
de: Wenn systemd-networkd sich beendet, lässt es im allgemeinen Netzgeräte und -Konfigurationen intakt\&. Dies ermöglicht Übergänge vom Initramfs und den Neustart des Dienstes, ohne die Verbindung zu unterbrechen\&. Das bedeutet auch, dass Netdev-Geräte, deren Konfiguration entfernt wurde, beim Neustart nicht abgewählt werden und manuell bereinigt werden müssen\&.

source: B<systemd-networkd> may be introspected and controlled at runtime using B<networkctl>(1)\&.
de: B<systemd-networkd> kann durch B<networkctl>(1) zur Laufzeit untersucht und gesteuert werden\&.

source: CONFIGURATION FILES
de: KONFIGURATIONSDATEIEN

source: The configuration files are read from the files located in the system network directory /usr/lib/systemd/network, the volatile runtime network directory /run/systemd/network and the local administration network directory /etc/systemd/network\&.
de: Die Konfigurationsdateien werden aus den Dateien im systemweiten Netzwerkverzeichnis /usr/lib/systemd/network, dem flüchtigen Laufzeit-Netzwerkverzeichnis /run/systemd/network und dem lokalen Administrations-Netzwerkverzeichnis /etc/systemd/network gelesen\&.

source: Networks are configured in \&.network files, see B<systemd.network>(5), and virtual network devices are configured in \&.netdev files, see B<systemd.netdev>(5)\&.
de: Netzwerke werden in \&.network-Dateien konfiguriert, siehe B<systemd.network>(5), und virtuelle Netzwerkgeräte werden in \&.netdev-Dateien konfiguriert, siehe B<systemd.netdev>(5)\&.

source: SEE ALSO
de: SIEHE AUCH

source: The configuration files are read from the files located in the system network directory /lib/systemd/network, the volatile runtime network directory /run/systemd/network and the local administration network directory /etc/systemd/network\&.
de: Die Konfigurationsdateien werden aus den Dateien im systemweiten Netzwerkverzeichnis /lib/systemd/network, dem flüchtigen Laufzeit-Netzwerkverzeichnis /run/systemd/network und dem lokalen Administrations-Netzwerkverzeichnis /etc/systemd/network gelesen\&.
