Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-networkd-wait-online.service.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-networkd-wait-online.service, systemd-networkd-wait-online@.service, systemd-networkd-wait-online - Wait for network to come online
de: systemd-networkd-wait-online.service, systemd-networkd-wait-online@.service, systemd-networkd-wait-online - auf den Online-Zustand des Netzwerks warten

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-networkd-wait-online> is a oneshot system service (see B<systemd.service>(5)), that waits for the network to be configured\&. By default, it will wait for all links it is aware of and which are managed by B<systemd-networkd.service>(8) to be fully configured or failed, and for at least one link to be online\&. Here, online means that the link\*(Aqs operational state is equal or higher than "degraded"\&. The threshold can be configured by B<--operational-state=> option\&.
de: B<Systemd-networkd-wait-online> ist ein einmalig ausgeführter Systemdienst (siehe B<systemd.service>(5)), der darauf wartet, dass das Netzwerk eingerichtet wird\&. In der Voreinstellung werden alle Netzwerkschnittstellen berücksichtigt, die B<Systemd-networkd.service>(8) bekannt sind und davon verwaltet werden\&. Maßgebend ist hierbei die vollständige Einrichtung der Verbindung oder deren Fehlschlag, beziehungsweise mindestens ein Link online ist\&. Hierbei bedeutet »online«, dass der Betriebsstatus gleich oder größer »degraded« ist\&. Die Schwelle kann mit der Option B<--operational-state=> konfiguriert werden\&.

source: The service systemd-networkd-wait-online\&.service invokes B<systemd-networkd-wait-online> without any options\&. Thus, it waits for all managed interfaces to be configured or failed, and for at least one to be online\&.
de: Der Dienst systemd-networkd-wait-online\&.service ruft B<systemd-networkd-wait-online> ohne Optionen auf\&. Daher wartet er, bis alle verwalteten Schnittstellen konfiguriert oder fehlgeschlagen sind und mindestens eine online ist\&.

source: The service systemd-networkd-wait-online@\&.service takes an interface name, and invokes B<systemd-networkd-wait-online> with B<-i> and the specified interface name\&. Thus, wait for the specified interface to be configured and online\&. For example, systemd-networkd-wait-online@eth0\&.service waits for eth0 to be configured by B<systemd-networkd> and online\&.
de: Der Dienst systemd-networkd-wait-online@\&.service akzeptiert einen Schnittstellennamen und ruft B<systemd-networkd-wait-online> mit B<-i> und dem angegebenen Schnittstellennamen auf\&. Daher wartet es, bis die angegebene Schnittstelle konfiguriert und online ist\&. Beispielsweise wartet systemd-networkd-wait-online@eth0\&.service darauf, dass eth0 durch B<systemd-networkd> konfiguriert wurde und online ist\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: B<-i> I<INTERFACE>[:I<MIN_OPERSTATE>[:I<MAX_OPERSTATE>]], B<--interface=>I<INTERFACE>[:I<MIN_OPERSTATE>[:I<MAX_OPERSTATE>]]
de: B<-i> I<SCHNITTSTELLE>[:I<MIN_BETRIEBSSTATUS>[:I<MAX_BETRIEBSSTATUS>]], B<--interface=>I<SCHNITTSTELLE>[:I<MIN_BETRIEBSSTATUS>[:I<MAX_BETRIEBSSTATUS>]]

source: Network interface to wait for before deciding if the system is online\&. This is useful when a system has several interfaces which will be configured, but a particular one is necessary to access some network resources\&. When used, all other interfaces are ignored\&. This option may be used more than once to wait for multiple network interfaces\&. When this option is specified multiple times, then B<systemd-networkd-wait-online> waits for all specified interfaces to be online\&. Optionally, required minimum and maximum operational states can be specified after a colon ":"\&. Please see B<networkctl>(1) for possible operational states\&. If the operational state is not specified here, then the value from I<RequiredForOnline=> in the corresponding \&.network file is used if present, and "degraded" otherwise\&.
de: Netzwerkschnittstelle, auf die gewartet werden soll, bevor entschieden wird, ob das System online ist\&. Dies ist nützlich, wenn das System mehrere konfigurierte Schnittstellen hat, aber eine bestimmte notwendig ist, um auf bestimmte Netzwerkressourcen zuzugreifen\&. Wird dies verwandt, werden alle anderen Schnittstellen ignoriert\&. Diese Option kann mehr als einmal verwandt werden, um auf mehrere Netzwerkschnittstellen zu warten\&. Wenn diese Option mehrfach angegeben wird, dann wartet B<systemd-networkd-wait-online> darauf, dass alle festgelegten Schnittstellen online sind\&. Optional kann der minimale und maximale Betriebsstatus nach einem Doppelpunkt »:« angegeben werden\&. Bitte lesen Sie B<networkctl>(1) für mögliche Betriebsstatus\&. Falls hier der Betriebsstatus nicht angegeben ist, dann wird der Wert aus I<RequiredForOnline=> in der entsprechenden »\&.network«-Datei verwandt, falls er vorhanden ist und andernfalls »degraded«\&.

source: B<--ignore=>I<INTERFACE>
de: B<--ignore=>I<SCHNITTSTELLE>

source: Network interfaces to be ignored when deciding if the system is online\&. By default, only the loopback interface is ignored\&. This option may be used more than once to ignore multiple network interfaces\&.
de: gibt Netzwerkschnittstellen an, die bei der Feststellung, dass das System online ist, ignoriert werden\&. In der Voreinstellung wird lediglich die Loopback-Schnittstelle ignoriert\&. Wenn mehrere Netzwerkschnittstellen ignoriert werden sollen, kann diese Option mehrfach angegeben werden\&.

source: B<-o> I<MIN_OPERSTATE>[:I<MAX_OPERSTATE>], B<--operational-state=>I<MIN_OPERSTATE>[:I<MAX_OPERSTATE>]
de: B<-o> I<MIN_BETRIEBSSTATUS>[:I<MAX_BETRIEBSSTATUS>], B<--operational-state=>I<MIN_BETRIEBSSTATUS>[:I<MAX_BETRIEBSSTATUS>]

source: Takes a minimum operational state and an optional maximum operational state\&. Please see B<networkctl>(1) for possible operational states\&. If set, the specified value overrides I<RequiredForOnline=> settings in \&.network files\&. But this does not override operational states specified in B<--interface=> option\&.
de: Akzeptiert einen minimalen und optional einen maximalen Betriebsstatus\&. Bitte lesen Sie B<networkctl>(1) für mögliche Betriebsstatus\&. Falls gesetzt, wird der in der Einstellung I<RequiredForOnline=> in »\&.network«-Dateien festgelegte Wert außer Kraft gesetzt\&. Dies setzt aber nicht die in der Option B<--interface=> festgelegten Betriebsstatus außer Kraft\&.

source: Waiting for an IPv4 address of each network interface to be configured\&. If this option is specified with B<--any>, then B<systemd-networkd-wait-online> exits with success when at least one interface becomes online and has an IPv4 address\&. If the required minimum operational state is below "routable", then each link (or at least one link with B<--any>) must have an IPv4 link-local or routable address\&. If the required minimum operational state is "routable", then each link must have an IPv4 routable address\&.
de: Wartet auf jeder Netzwerkschnittstelle darauf, dass ein IPv4-Adresse konfiguriert wird\&. Falls diese Option mit B<--any> festgelegt wird, dann beendet sich B<systemd-networkd-wait-online> erfolgreich, wenn mindestens eine Schnittstelle online wird und über eine IPv4-Adresse verfügt\&. Falls der benötigte minimale Betriebszustand unterhalb von »routable« ist, dann muss jeder Link (oder zumindestens ein Link mit B<--any>) eine IPv4-linklokale oder eine routebare Adresse haben\&. Falls der benötigte minimale Betriebszustand »routable« ist, dann muss jeder Link eine IPv4-routebare Adresse haben\&.

source: If neither B<--ipv4> nor B<--ipv6> is specified, then the value from I<RequiredFamilyForOnline=> in the corresponding \&.network file is used if present\&.
de: Falls weder B<--ipv4> noch B<--ipv6> festgelegt ist, dann wird der Wert aus I<RequiredFamilyForOnline=> in der entsprechenden \&.network-Datei verwandt, falls er vorhanden ist\&.

source: Waiting for an IPv6 address of each network interface to be configured\&. If this option is specified with B<--any>, then B<systemd-networkd-wait-online> exits with success when at least one interface becomes online and has an IPv6 address\&. If the required minimum operational state is below "routable", then each link (or at least one link with B<--any>) must have an IPv6 link-local or routable address\&. If the required minimum operational state is "routable", then each link must have an IPv6 routable address\&.
de: Wartet auf jeder Netzwerkschnittstelle darauf, dass ein IPv6-Adresse konfiguriert wird\&. Falls diese Option mit B<--any> festgelegt wird, dann beendet sich B<systemd-networkd-wait-online> erfolgreich, wenn mindestens eine Schnittstelle online wird und über eine IPv6-Adresse verfügt\&. Falls der benötigte minimale Betriebszustand unterhalb von »routable« ist, dann muss jeder Link (oder zumindestens ein Link mit B<--any>) eine IPv6-linklokale oder eine routebare Adresse haben\&. Falls der benötigte minimale Betriebszustand »routable« ist, dann muss jeder Link eine IPv6-routebare Adresse haben\&.

source: Even if several interfaces are in configuring state, B<systemd-networkd-wait-online> exits with success when at least one interface becomes online\&. When this option is specified with B<--interface=>, then B<systemd-networkd-wait-online> waits for one of the specified interfaces to be online\&. This option is useful when some interfaces may not have carrier on boot\&.
de: Selbst falls mehrere Schnittstellen in einem konfigurierten Status sind, wird sich B<systemd-networkd-wait-online> erfolgreich beenden, wenn mindestens eine Schnittstelle online geht\&. Wenn diese Option mit B<--interface=> angegeben wird, dann wartet B<systemd-networkd-wait-online> darauf, dass eine der angegebenen Schnittstellen online geht\&. Diese Option ist nützlich, wenn einige Schnittstellen beim Systemstart keinen Träger haben könnten\&.

source: B<--timeout=>I<SECS>
de: B<--timeout=>I<SEK>

source: Fail the service if the network is not online by the time the timeout elapses\&. A timeout of 0 disables the timeout\&. Defaults to 120 seconds\&.
de: lässt den Dienst fehlschlagen, wenn das Netzwerk nicht innerhalb der hier angegebenen Zeit online ist. Wird als Wert 0 angegeben, wird die Zeitüberschreitung dadurch deaktiviert\&. In der Voreinstellung werden 120 Sekunden angenommen\&.

source: Suppress log messages\&.
de: Protokollnachrichten unterdrücken\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: SEE ALSO
de: SIEHE AUCH

source: systemd-networkd-wait-online.service, systemd-networkd-wait-online - Wait for network to come online
de: systemd-networkd-wait-online.service, systemd-networkd-wait-online - auf den Online-Zustand des Netzwerks warten
