Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-rc-local-generator.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-rc-local-generator - Compatibility generator for starting /etc/rc\&.local during boot
de: systemd-rc-local-generator - Kompatibilitätsgenerator zum Starten von /etc/rc.local während des Systemstarts

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: systemd-rc-local-generator is a generator that checks whether /etc/rc\&.local exists and is executable, and if it is pulls the rc-local\&.service unit into the boot process\&. This unit is responsible for running this script during late boot\&. Note that the script will be run with slightly different semantics than the original System V version, which was run "last" in the boot process, which is a concept that does not translate to systemd\&. The script is run after network\&.target, but in parallel with most other regular system services\&.
de: Systemd-rc-local-generator ist ein Generator, der prüft, ob /etc/rc\&.local existiert und ausführbar ist\&. Falls dies der Fall ist, zieht es die Unit rc-local\&.service in den Systemstartprozess hinein\&. Diese Unit ist für die Ausführung dieses Skriptes während der späten Systemstartphase verantwortlich\&. Beachten Sie, dass dieses Skript mit einer leicht anderen Semantik als die ursprüngliche System-V-Version ausgeführt wird, bei der dies »zuletzt« im Systemstartprozess ausgeführt wurde\&. Dieses Konzept kann nicht in Systemd übersetzt werden\&. Dieses Skript wird nach network\&.target, aber parallel zu den meisten anderen regulären Systemdiensten ausgeführt\&.

source: Support for /etc/rc\&.local is provided for compatibility with specific System V systems only\&. However, it is strongly recommended to avoid making use of this script today, and instead provide proper unit files with appropriate dependencies for any scripts to run during the boot process\&. Note that the path to the script is set a compile time and varies between distributions\&.
de: Ausschließlich für die Kompatibilität zu bestimmten System-V-Systemen wird /etc/rc\&.local unterstützt\&. Es wird allerdings nachdrücklich empfohlen, heutzutage die Verwendung dieses Skriptes zu vermeiden und stattdessen geeignete Unit-Dateien mit angemessenen Abhängigkeiten für alle Skripte, die während der Systemstartphase ausgeführt werden sollen, bereitzustellen\&.Beachten Sie, dass der Pfad zu dem Skript zum Compilierzeitpunkt gesetzt wird und sich zwischen Distributionen unterscheidet\&.

source: systemd-rc-local-generator implements B<systemd.generator>(7)\&.
de: systemd-rc-local-generator implementiert B<systemd.generator>(7)\&.

source: SEE ALSO
de: SIEHE AUCH

source: systemd-rc-local-generator, rc-local.service - Compatibility generator and service to start /etc/rc\&.local during boot
de: systemd-rc-local-generator - Kompatibilitätsgenerator und Dienst, um /etc/rc\&.local während des Systemstarts zu starten

source: B<systemd-rc-local-generator> is a generator that checks whether /etc/rc\&.local exists and is executable, and if it is, pulls the rc-local\&.service unit into the boot process\&. This unit is responsible for running this script during late boot\&. The script is run after network\&.target, but in parallel with most other regular system services\&.
de: B<ystemd-rc-local-generator> ist ein Generator, der prüft, ob /etc/rc\&.local existiert und ausführbar ist\&. Falls dies der Fall ist, zieht es die Unit rc-local\&.service in den Systemstartprozess hinein\&. Diese Unit ist für die Ausführung dieses Skriptes während der späten Systemstartphase verantwortlich\&. Dieses Skript wird nach network\&.target, aber parallel zu den meisten anderen regulären Systemdiensten ausgeführt\&.

source: Note that rc-local\&.service runs with slightly different semantics than the original System V version, which was executed "last" in the boot process, which is a concept that does not translate to systemd\&.
de: Beachten Sie, dass rc-local\&.service mit einer leicht anderen Semantik als die ursprüngliche System-V-Version ausgeführt wird, bei der dies »zuletzt« im Systemstartprozess ausgeführt wurde\&. Dieses Konzept kann nicht in Systemd übersetzt werden\&.

source: Also note that rc-local\&.service is ordered after network\&.target, which does not mean that the network is functional, see B<systemd.special>(7)\&. If the script requires a configured network connection, it may be desirable to pull in and order it after network-online\&.target with a drop-in:
de: Beachten Sie auch, dass rc-local\&.service nach network\&.target eingeordnet ist\&. Das bedeutet, dass das Netzwerk funktioniert, siehe B<systemd.special>(7)\&. Falls das Skript eine konfigurierte Netzwerkverbindung benötigt, könnte es wünschenswert sein, network-online\&.target mit einer Erweiterung hereinzuziehen und das Skript danach anzuordnen:

source: Support for /etc/rc\&.local is provided for compatibility with specific System V systems only\&. However, it is strongly recommended to avoid making use of this script today, and instead provide proper unit files with appropriate dependencies for any scripts to run during the boot process\&. Note that the path to the script is set at compile time and varies between distributions\&.
de: Ausschließlich für die Kompatibilität zu bestimmten System-V-Systemen wird /etc/rc\&.local unterstützt\&. Es wird allerdings nachdrücklich empfohlen, heutzutage die Verwendung dieses Skriptes zu vermeiden und stattdessen geeignete Unit-Dateien mit angemessenen Abhängigkeiten für alle Skripte, die während der Systemstartphase ausgeführt werden sollen, bereitzustellen\&.Beachten Sie, dass der Pfad zu dem Skript zum Compilierzeitpunkt gesetzt wird und sich zwischen Distributionen unterscheidet\&.

source: systemd-rc-local-generator, rc-local.service - Compatibility generator and service to start /etc/rc\&.d/rc\&.local during boot
de: systemd-rc-local-generator - Kompatibilitätsgenerator und Dienst, um /etc/rc\&.d/rc\&.local während des Systemstarts zu starten

source: B<systemd-rc-local-generator> is a generator that checks whether /etc/rc\&.d/rc\&.local exists and is executable, and if it is, pulls the rc-local\&.service unit into the boot process\&. This unit is responsible for running this script during late boot\&. The script is run after network\&.target, but in parallel with most other regular system services\&.
de: B<ystemd-rc-local-generator> ist ein Generator, der prüft, ob /etc/rc\&.d/rc\&.local existiert und ausführbar ist\&. Falls dies der Fall ist, zieht es die Unit rc-local\&.service in den Systemstartprozess hinein\&. Diese Unit ist für die Ausführung dieses Skriptes während der späten Systemstartphase verantwortlich\&. Dieses Skript wird nach network\&.target, aber parallel zu den meisten anderen regulären Systemdiensten ausgeführt\&.

source: Support for /etc/rc\&.d/rc\&.local is provided for compatibility with specific System V systems only\&. However, it is strongly recommended to avoid making use of this script today, and instead provide proper unit files with appropriate dependencies for any scripts to run during the boot process\&. Note that the path to the script is set at compile time and varies between distributions\&.
de: Ausschließlich für die Kompatibilität zu bestimmten System-V-Systemen wird /etc/rc\&.d/rc\&.local unterstützt\&. Es wird allerdings nachdrücklich empfohlen, heutzutage die Verwendung dieses Skriptes zu vermeiden und stattdessen geeignete Unit-Dateien mit angemessenen Abhängigkeiten für alle Skripte, die während der Systemstartphase ausgeführt werden sollen, bereitzustellen\&. Beachten Sie, dass der Pfad zu dem Skript zum Compilierzeitpunkt gesetzt wird und sich zwischen Distributionen unterscheidet\&.

source: systemd-rc-local-generator, rc-local.service - Compatibility generator and service to start /etc/init\&.d/boot\&.local and /etc/init\&.d/halt\&.local during boot and shutdown
de: systemd-rc-local-generator - Kompatibilitätsgenerator und Dienst zum Starten von /etc/init\&.d/boot\&.local und /etc/init\&.d/halt\&.local während des Systemstarts und des Herunterfahrens

source: B<systemd-rc-local-generator> is a generator that checks whether /etc/init\&.d/boot\&.local exists and is executable, and if it is, pulls the rc-local\&.service unit into the boot process\&. This unit is responsible for running this script during late boot\&. The script is run after network\&.target, but in parallel with most other regular system services\&.
de: B<ystemd-rc-local-generator> ist ein Generator, der prüft, ob /etc/init\&.d/boot\&.local existiert und ausführbar ist\&. Falls dies der Fall ist, zieht es die Unit rc-local\&.service in den Systemstartprozess hinein\&. Diese Unit ist für die Ausführung dieses Skriptes während der späten Systemstartphase verantwortlich\&. Dieses Skript wird nach network\&.target, aber parallel zu den meisten anderen regulären Systemdiensten ausgeführt\&.

source: systemd-rc-local-generator also checks whether /etc/init\&.d/halt\&.local exists and is executable, and if it is pulls the halt-local\&.service unit into the shutdown process\&. This unit is responsible for running this script during later shutdown\&.
de: Systemd-rc-local-generator prüft auch, ob /etc/init\&.d/halt\&.local existiert und ausführbar ist\&. Falls dies der Fall ist, zieht es die Unit halt-local\&.service in den Systemherunterfahrprozess hinein\&. Diese Unit ist für die Ausführung dieses Skriptes während des späten Herunterfahrens verantwortlich\&.

source: Support for /etc/init\&.d/boot\&.local and /etc/init\&.d/halt\&.local is provided for compatibility with specific System V systems only\&. However, it is strongly recommended to avoid making use of this script today, and instead provide proper unit files with appropriate dependencies for any scripts to run during the boot process\&. Note that the path to the script is set at compile time and varies between distributions\&.
de: Ausschließlich für die Kompatibilität zu bestimmten System-V-Systemen werden /etc/init\&.d/boot\&.local und /etc/init\&.d/halt\&.local unterstützt\&. Es wird allerdings nachdrücklich empfohlen, heutzutage die Verwendung dieses Skriptes zu vermeiden und stattdessen geeignete Unit-Dateien mit angemessenen Abhängigkeiten für alle Skripte, die während der Systemstartphase ausgeführt werden sollen, bereitzustellen\&. Beachten Sie, dass der Pfad zu dem Skript zum Compilierzeitpunkt gesetzt wird und sich zwischen Distributionen unterscheidet\&.

source: Please note that the support for /etc/init\&.d/halt\&.local will be removed in the future\&. It is recommended to use the use the mechanism described in B<systemd-shutdown>(8) instead\&.
de: Bitte beachten Sie, dass die Unterstützung für I</etc/init\&.d/halt\&.local> in der Zukunft entfernt werden wird\&. Es wird empfohlen, stattdessen den in B<systemd-shutdown>(8) beschriebenen Mechanismus zu verwenden.

source: systemd-rc-local-generator, rc-local.service - Compatibility generator and service to start /etc/init\&.d/boot\&.local during boot
de: systemd-rc-local-generator - Kompatibilitätsgenerator und Dienst, um /etc/init\&.d/boot\&.local während des Systemstarts zu starten

source: Support for /etc/init\&.d/boot\&.local is provided for compatibility with specific System V systems only\&. However, it is strongly recommended to avoid making use of this script today, and instead provide proper unit files with appropriate dependencies for any scripts to run during the boot process\&. Note that the path to the script is set at compile time and varies between distributions\&.
de: Ausschließlich für die Kompatibilität zu bestimmten System-V-Systemen wird /etc/init\&.d/boot\&.local unterstützt\&. Es wird allerdings nachdrücklich empfohlen, heutzutage die Verwendung dieses Skriptes zu vermeiden und stattdessen geeignete Unit-Dateien mit angemessenen Abhängigkeiten für alle Skripte, die während der Systemstartphase ausgeführt werden sollen, bereitzustellen\&. Beachten Sie, dass der Pfad zu dem Skript zum Compilierzeitpunkt gesetzt wird und sich zwischen Distributionen unterscheidet\&.
