Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-cryptsetup-generator.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-cryptsetup-generator - Unit generator for /etc/crypttab
de: systemd-cryptsetup-generator - Unit-Generator für /etc/crypttab

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: systemd-cryptsetup-generator is a generator that translates /etc/crypttab into native systemd units early at boot and when configuration of the system manager is reloaded\&. This will create B<systemd-cryptsetup@.service>(8) units as necessary\&.
de: Systemd-cryptsetup-generator ist ein Generator, der in der frühen Phase des Systemstarts und wenn die Konfiguration des Systemverwalters neu geladen wird /etc/crypttab in native System-Units übersetzt\&. Dies erzeugt die notwendigen B<systemd-cryptsetup@.service>(8)\&.

source: systemd-cryptsetup-generator implements B<systemd.generator>(7)\&.
de: systemd-cryptsetup-generator implementiert B<systemd.generator>(7)\&.

source: KERNEL COMMAND LINE
de: KERNEL-BEFEHLSZEILE

source: systemd-cryptsetup-generator understands the following kernel command line parameters:
de: Systemd-cryptsetup-generator versteht die folgenden Kernelbefehlszeilenparameter:

source: Takes a boolean argument\&. Defaults to "yes"\&. If "no", disables the generator entirely\&. I<rd\&.luks=> is honored only by initial RAM disk (initrd) while I<luks=> is honored by both the main system and the initrd\&.
de: Akzeptiert ein logisches Argument\&. Standardmäßig »yes«\&. Falls »no« wird der Generator komplett deaktiviert\&. I<rd\&.luks=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: Takes a boolean argument\&. Defaults to "yes"\&. If "no", causes the generator to ignore any devices configured in /etc/crypttab (I<luks\&.uuid=> will still work however)\&. I<rd\&.luks\&.crypttab=> is honored only by initial RAM disk (initrd) while I<luks\&.crypttab=> is honored by both the main system and the initrd\&.
de: Akzeptiert ein logisches Argument\&. Standardmäßig »yes«\&. Falls »no« wird der Generator alle in /etc/crypttab konfigurierten Geräte ignorieren (I<luks\&.uuid=> wird aber noch funktionieren)\&. I<rd\&.luks\&.crypttab=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.crypttab=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: Takes a LUKS superblock UUID as argument\&. This will activate the specified device as part of the boot process as if it was listed in /etc/crypttab\&. This option may be specified more than once in order to set up multiple devices\&. I<rd\&.luks\&.uuid=> is honored only by initial RAM disk (initrd) while I<luks\&.uuid=> is honored by both the main system and the initrd\&.
de: Akzeptiert eine LUKS-Superblock-UUID als Argument\&. Dies wird die angegebenen Geräte als Teil des Systemstartvorgangs aktivieren, als ob sie in /etc/crypttab aufgeführt wären\&. Diese Option kann mehr als einmal angegeben werden, um mehrere Geräte einzurichten\&. I<rd\&.luks\&.uuid=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.uuid=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: If /etc/crypttab contains entries with the same UUID, then the name, keyfile and options specified there will be used\&. Otherwise, the device will have the name "luks-UUID"\&.
de: Falls /etc/crypttab Einträge mit der gleichen UUID enthält, werden der Name, die Schlüsseldatei und die dort angegebenen Optionen benutzt\&. Andernfalls wird das Gerät den Namen »luks-UUID« tragen\&.

source: If /etc/crypttab exists, only those UUIDs specified on the kernel command line will be activated in the initrd or the real root\&.
de: Falls /etc/crypttab existiert, werden nur die auf der Kernelbefehlszeile angegebenen Zeilen in der Initrd oder in der echten Wurzel aktiviert\&.

source: Takes a LUKS super block UUID followed by an "=" and a name\&. This implies I<rd\&.luks\&.uuid=> or I<luks\&.uuid=> and will additionally make the LUKS device given by the UUID appear under the provided name\&.
de: Akzeptiert eine LUKS-Superblock-UUID, gefolgt von einem »=« und einem Namen\&. Dies impliziert I<rd\&.luks\&.uuid=> oder I<luks\&.uuid=> und wird zusätzlich dafür sorgen, dass das über die UUID angegebene LUKS-Gerät auch unter dem bereitgestellten Namen erscheint\&.

source: This parameter is the analogue of the first B<crypttab>(5) field I<volume-name>\&.
de: Dieser Parameter ist das Gegenstück zu dem ersten B<crypttab>(5)-Feld I<volume-name>\&.

source: I<rd\&.luks\&.name=> is honored only by initial RAM disk (initrd) while I<luks\&.name=> is honored by both the main system and the initrd\&.
de: I<rd\&.luks\&.name=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.name=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: Takes a LUKS super block UUID followed by a "=" and a block device specification for device hosting encrypted data\&.
de: Akzeptiert eine LUKS-Superblock-UUID, gefolgt von einem »=« und einer Blockgerät-Angabe für das Gerät, das die verschlüsselten Daten enthält\&.

source: For those entries specified with I<rd\&.luks\&.uuid=> or I<luks\&.uuid=>, the data device will be set to the one specified by I<rd\&.luks\&.data=> or I<luks\&.data=> of the corresponding UUID\&.
de: Für solche Einträge, die mit I<rd\&.luks\&.uuid=> oder I<luks\&.uuid=> festgelegt werden, wird das Datengerät auf die durch I<rd\&.luks\&.data=> oder I<luks\&.data=> der entsprechenden UUID festgelegten gesetzt\&.

source: LUKS data device parameter is useful for specifying encrypted data devices with detached headers specified in I<luks\&.options> entry containing "header=" argument\&. For example, I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.options=>b40f1abf-2a53-400a-889a-2eccc27eaa40=header=/path/to/luks\&.hdr I<rd\&.luks\&.data=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/dev/sdx\&. Hence, in this case, we will attempt to unlock LUKS device assembled from data device "/dev/sdx" and LUKS header (metadata) put in "/path/to/luks\&.hdr" file\&. This syntax is for now only supported on a per-device basis, i\&.e\&. you have to specify LUKS device UUID\&.
de: Der LUKS-Datengeräteparameter ist zur Angabe von verschlüsselten Datengeräten mit abgetrennten Kopfzeilen, die in I<luks\&.options>-Einträgen, die das Argument »header=« enthalten, festgelegt sind, nützlich\&. Beispiel: I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.options=>b40f1abf-2a53-400a-889a-2eccc27eaa40=header=/Pfad/zur/luks\&.hdr I<rd\&.luks\&.data=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/dev/sdx\&. Daher wird in diesem Fall versucht, ein LUKS-Gerät zu entsperren, das aus Datengeräten »/dev/sdx« zusammengebaut ist und dessen LUKS-Kopfzeilen (Metadaten) in »Pfad/zur/luks\&.hdr«-Datei abgelegt sind\&. Diese Syntax wird derzeit nur auf einer gerätebezogenen Basis unterstützt, d\&.h\&. Sie müssen die UUID des LUKS-Geräts angeben\&.

source: This parameter is the analogue of the second B<crypttab>(5) field I<encrypted-device>\&.
de: Dieser Parameter ist das Gegenstück zu dem zweiten B<crypttab>(5)-Feld I<encrypted-device>\&.

source: I<rd\&.luks\&.data=> is honored only by initial RAM disk (initrd) while I<luks\&.data=> is honored by both the main system and the initrd\&.
de: I<rd\&.luks\&.data=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.data=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: Takes a password file name as argument or a LUKS super block UUID followed by a "=" and a password file name\&.
de: Akzeptiert einen Passwortdateinamen als Argument oder eine LUKS-Superblock-UUID, gefolgt von einem »=« und einem Passwortdateinamen\&.

source: For those entries specified with I<rd\&.luks\&.uuid=> or I<luks\&.uuid=>, the password file will be set to the one specified by I<rd\&.luks\&.key=> or I<luks\&.key=> of the corresponding UUID, or the password file that was specified without a UUID\&.
de: Für solche Einträge, die mit I<rd\&.luks\&.uuid=> oder I<luks\&.uuid=> festgelegt werden, wird die Passwortdatei auf die durch I<rd\&.luks\&.key=> oder I<luks\&.key=> der entsprechenden UUID festgelegten gesetzt oder auf die Passwortdatei, die ohne eine UUID festgelegt wurde\&.

source: It is also possible to specify an external device which should be mounted before we attempt to unlock the LUKS device\&. systemd-cryptsetup will use password file stored on that device\&. Device containing password file is specified by appending colon and a device identifier to the password file path\&. For example, I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.key=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/keyfile:LABEL=keydev\&. Hence, in this case, we will attempt to mount file system residing on the block device with label "keydev"\&. This syntax is for now only supported on a per-device basis, i\&.e\&. you have to specify LUKS device UUID\&.
de: Es ist auch möglich, ein externes Gerät festzulegen, das vor dem Entsperren des LUKS-Gerätes eingehängt werden soll\&. Systemd-cryptsetup wird auf dem Gerät gespeicherte Passwortdateien verwenden\&. Das Gerät, das die Passwortdatei enthält, wird durch Anhängen eines Doppelpunkts und einer Gerätekennung an den Passwortdateipfad festgelegt\&. Beispiel: I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.key=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/keyfile:LABEL=keydev\&. Daher wird in diesem Fall versucht, ein auf dem Blockgerät mit dem Bezeichner »keydev« liegendes Dateisystem einzuhängen\&. Diese Syntax wird derzeit nur auf einer gerätebezogenen Basis unterstützt, d\&.h\&. Sie müssen die UUID des LUKS-Geräts angeben\&.

source: This parameter is the analogue of the third B<crypttab>(5) field I<key-file>\&.
de: Dieser Parameter ist das Gegenstück zu dem dritten B<crypttab>(5)-Feld I<key-file>\&.

source: I<rd\&.luks\&.key=> is honored only by initial RAM disk (initrd) while I<luks\&.key=> is honored by both the main system and the initrd\&.
de: I<rd\&.luks\&.key=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.key=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: Takes a LUKS super block UUID followed by an "=" and a string of options separated by commas as argument\&. This will override the options for the given UUID\&.
de: Akzeptiert eine LUKS-Superblock-UUID, gefolgt von einem »=« und einer Zeichenkette mit Optionen, getrennt durch Kommata, als Argument\&. Dies wird die Optionen für die angegebene UUID außer Kraft setzen\&.

source: If only a list of options, without an UUID, is specified, they apply to any UUIDs not specified elsewhere, and without an entry in /etc/crypttab\&.
de: Falls nur eine Liste von Optionen ohne eine UUID angegeben wird, werden sie auf alle UUIDs, die nicht woanders angegeben werden und die keinen Eintrag in /etc/crypttab haben, angewandt\&.

source: This parameter is the analogue of the fourth B<crypttab>(5) field I<options>\&.
de: Dieser Parameter ist das Gegenstück zu dem vierten B<crypttab>(5)-Feld I<options>\&.

source: It is possible to specify an external device which should be mounted before we attempt to unlock the LUKS device\&. systemd-cryptsetup will assemble LUKS device by combining data device specified in I<luks\&.data> with detached LUKS header found in "header=" argument\&. For example, I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.options=>b40f1abf-2a53-400a-889a-2eccc27eaa40=header=/luks\&.hdr:LABEL=hdrdev I<rd\&.luks\&.data=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/dev/sdx\&. Hence, in this case, we will attempt to mount file system residing on the block device with label "hdrdev", and look for "luks\&.hdr" on that file system\&. Said header will be used to unlock (decrypt) encrypted data stored on /dev/sdx\&. This syntax is for now only supported on a per-device basis, i\&.e\&. you have to specify LUKS device UUID\&.
de: Es ist möglich, ein externes Gerät festzulegen, das vor dem Entsperren des LUKS-Gerätes eingehängt werden soll\&. Systemd-cryptsetup wird LUKS-Geräte durch Kombination der in I<luks\&.data> festgelegten Daten mit den in dem Argument »header=« gefundenen Kopfzeilen zusammenbauen\&. Beispiel: I<rd\&.luks\&.uuid=>b40f1abf-2a53-400a-889a-2eccc27eaa40 I<rd\&.luks\&.options=>b40f1abf-2a53-400a-889a-2eccc27eaa40=header=/luks\&.hdr:LABEL=hdrdev I<rd\&.luks\&.data=>b40f1abf-2a53-400a-889a-2eccc27eaa40=/dev/sdx\&. Daher wird in diesem Fall versucht, ein auf dem Blockgerät mit dem Bezeichner »hdrdev« liegendes Dateisystem einzuhängen und nach »luks\&.hdr« auf diesem Dateisystem zu suchen\&. Besagte Kopfzeilen werden zum Entsperren (Entschlüsseln) der auf /dev/sdx gespeicherten verschlüsselten Daten verwandt\&. Diese Syntax wird derzeit nur auf einer gerätebezogenen Basis unterstützt, d\&.h\&. Sie müssen die UUID des LUKS-Geräts angeben\&.

source: I<rd\&.luks\&.options=> is honored only by initial RAM disk (initrd) while I<luks\&.options=> is honored by both the main system and the initrd\&.
de: I<rd\&.luks\&.options=> wird nur von anfänglichen RAM-Platten (Initrd) berücksichtigt, während I<luks\&.options=> sowohl vom Hauptsystem als auch der Initrd berücksichtigt wird\&.

source: SEE ALSO
de: SIEHE AUCH
