Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-sysusers.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-sysusers, systemd-sysusers.service - Allocate system users and groups
de: systemd-sysusers, systemd-sysusers.service - Systembenutzer und -gruppen zuweisen

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-sysusers> [OPTIONS...] [I<CONFIGFILE>...]
de: B<systemd-sysusers> [OPTIONEN …] [I<KONFIGURATIONSDATEI> …]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-sysusers> creates system users and groups, based on the file format and location specified in B<sysusers.d>(5)\&.
de: B<Systemd-sysusers> legt, basierend auf dem in B<sysusers.d>(5) angegebenen Dateiformat und Speicherort, Systembenutzer und -gruppen an\&.

source: If invoked with no arguments, it applies all directives from all files found in the directories specified by B<sysusers.d>(5)\&. When invoked with positional arguments, if option B<--replace=>I<PATH> is specified, arguments specified on the command line are used instead of the configuration file I<PATH>\&. Otherwise, just the configuration specified by the command line arguments is executed\&. The string "-" may be specified instead of a filename to instruct B<systemd-sysusers> to read the configuration from standard input\&. If only the basename of a file is specified, all configuration directories are searched for a matching file and the file found that has the highest priority is executed\&.
de: Beim Aufruf ohne Argumente wendet es alle Anweisungen aus allen Dateien in den durch B<sysusers.d>(5) festgelegten Verzeichnissen an\&. Falls die Option B<--replace=>I<PFAD> angegeben wird und der Aufruf mit positionsbezogenen Argumenten erfolgt, werden die auf der Befehlszeile angegebenen Argumente statt der Konfigurationsdatei I<PFAD> verwandt\&. Andernfalls wird nur die auf der Befehlszeile angegebene Konfiguration ausgeführt\&. Die Zeichenkette »-« kann statt eines Dateinamens angegeben werden, um B<systemd-sysusers> anzuweisen, die Konfiguration aus der Standardeingabe zu lesen\&. Falls nur der Basisname einer Datei angegeben wird, werden alle Konfigurationsverzeichnisse auf passende Dateien durchsucht und die gefundene Datei mit der höchsten Priorität wird ausgeführt\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: B<--root=>I<root>
de: B<--root=>I<Wurzel>

source: Takes a directory path as an argument\&. All paths will be prefixed with the given alternate I<root> path, including config search paths\&.
de: Akzeptiert einen Verzeichnispfad als Argument\&. Allen Pfaden wird der angegebene alternative I<Wurzel>-Pfad vorangestellt, einschließlich der Suchpfade für die Konfiguration\&.

source: B<--image=>I<image>
de: B<--image=>I<Abbild>

source: Takes a path to a disk image file or block device node\&. If specified all operations are applied to file system in the indicated disk image\&. This is similar to B<--root=> but operates on file systems stored in disk images or block devices\&. The disk image should either contain just a file system or a set of file systems within a GPT partition table, following the \m[blue]B<Discoverable Partitions Specification>\m[]\&\s-2\u[1]\d\s+2\&. For further information on supported disk images, see B<systemd-nspawn>(1)\*(Aqs switch of the same name\&.
de: Akzeptiert einen Pfad zu einer Plattenabbilddatei oder einem Blockgerätenamen\&. Falls angegeben, werden alle Aktionen auf das Dateisystem in dem angegebenen Plattenabbild angewandt\&. Dies ist ähnlich zu B<--root=>, agiert aber auf Dateisystemen, die in Plattenabbildern oder Blockgeräten gespeichert sind\&. Das Plattenabbild sollte entweder nur ein Dateisystem oder eine Reihe von Dateisystemen innerhalb einer GPT-Partitionstabelle enthalten, die der \m[blue]B<Spezifikation für auffindbare Partitionen>\m[]\&\s-2\u[1]\d\s+2 folgt\&. Für weitere Informationen über unterstützte Plattenabbilder, siehe den Schalter von B<systemd-nspawn>(1) mit dem gleichen Namen\&.

source: B<--replace=>I<PATH>
de: B<--replace=>I<PFAD>

source: When this option is given, one or more positional arguments must be specified\&. All configuration files found in the directories listed in B<sysusers.d>(5) will be read, and the configuration given on the command line will be handled instead of and with the same priority as the configuration file I<PATH>\&.
de: Wird diese Option angegeben, müssen eine oder mehrere positionsbezogene Argumente festgelegt werden\&. Alle in den in B<sysusers.d>(5) aufgeführten Verzeichnissen gefundenen Konfigurationsdateien werden gelesen und die auf der Befehlszeile übergebene Konfiguration wird statt der Konfigurationsdatei I<PFAD> mit der gleichen Priorität wie diese verwandt\&.

source: This option is intended to be used when package installation scripts are running and files belonging to that package are not yet available on disk, so their contents must be given on the command line, but the admin configuration might already exist and should be given higher priority\&.
de: Wenn die Installationsskripte laufen und zum Paket gehörende Dateien noch nicht verfügbar sind, muss der Inhalt der Skripte auf der Befehlszeile übergeben werden\&. Diese Option sorgt dafür, dass die Konfigurationsskripte des Administrators eine höhere Priorität erhalten, sofern diese bereits existieren\&.

source: B<Example\ \&1.\ \&RPM installation script for radvd>
de: B<Beispiel\ \&1.\ \&RPM-Installationsskript für Radvd>

source: This will create the radvd user as if /usr/lib/sysusers\&.d/radvd\&.conf was already on disk\&. An admin might override the configuration specified on the command line by placing /etc/sysusers\&.d/radvd\&.conf or even /etc/sysusers\&.d/00-overrides\&.conf\&.
de: Dies erzeugt den Benutzer radvd, als ob /usr/lib/sysusers\&.d/radvd\&.conf bereits auf Platte wäre\&. Ein Administrator könnte die auf der Befehlszeile übergebene Konfiguration außer Kraft setzen, indem er /etc/sysusers\&.d/radvd\&.conf oder sogar /etc/sysusers\&.d/00-overrides\&.conf erzeugt\&.

source: Note that this is the expanded form, and when used in a package, this would be written using a macro with "radvd" and a file containing the configuration line as arguments\&.
de: Beachten Sie, dass dies dies die expandierte Form ist\&. Wird dies in einem Paket verwandt, würde es mit einem Makro mit »radvd« und einer Datei, die die Konfigurationszeile als Argumente enthält, geschrieben\&.

source: Process the configuration and figure out what entries would be created, but don\*(Aqt actually write anything\&.
de: Verarbeitet die Konfiguration und ermittelt, welche Einträge erstellt würden, aber schreibt nichts wirklich\&.

source: Treat each positional argument as a separate configuration line instead of a file name\&.
de: Behandelt jedes positionsabhängige Argument als separate Konfigurationszeile statt als einen Dateinamen\&.

source: Copy the contents of config files to standard output\&. Before each file, the filename is printed as a comment\&.
de: Kopiert den Inhalt der Konfigurationsdateien in die Standardausgabe\&. Vor jeder Datei wird der Dateiname als Kommentar ausgegeben\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: CREDENTIALS
de: ZUGANGSDATEN

source: B<systemd-sysusers> supports the service credentials logic as implemented by I<LoadCredential=>/I<SetCredential=> (see B<systemd.exec>(1) for details)\&. The following credentials are used when passed in:
de: B<systemd-sysusers> unterstützt die Dienste-Anmeldedatenlogik, wie sie durch I<LoadCredential=>/I<SetCredential=> implementiert wird (siehe B<systemd.exec>(1) für Details)\&. Die folgenden Anmeldedaten werden verwandt, wenn sie hereingereicht werden:

source: passwd\&.hashed-password\&.I<user>
de: passwd\&.hashed-password\&.I<Benutzer>

source: A UNIX hashed password string to use for the specified user, when creating an entry for it\&. This is particularly useful for the "root" user as it allows provisioning the default root password to use via a unit file drop-in or from a container manager passing in this credential\&. Note that setting this credential has no effect if the specified user account already exists\&. This credential is hence primarily useful in first boot scenarios or systems that are fully stateless and come up with an empty /etc/ on every boot\&.
de: Eine gehashte UNIX-Passwortzeichenkette, die für den festgelegten Benutzer verwandt werden soll, wenn für ihn ein Eintrag erstellt wird\&. Dies ist insbesondere für den Bneutzer »root« hilfreich, da er die Bereitstellung eines Vorgabe-Passworts für root über eine Unit-Dateiergänzung oder einen Container-Verwalter, der dieses Anmeldedatum weitergibt, erlaubt\&. Beachten Sie, dass das Setzen dieses Anmeldedatums keine Auswirkung hat, falls das festgelegte Benutzerkonto bereits existiert\&. Dieses Anmeldedatum ist daher hauptsächlich für Erst-Systemstart-Szenarien oder Systeme, die vollständig zustandslos sind, und bei jedem Systemstart mit einem leeren /etc/ hochkommen, nützlich\&.

source: passwd\&.plaintext-password\&.I<user>
de: passwd\&.plaintext-password\&.I<Benutzer>

source: Similar to "passwd\&.hashed-password\&.I<user>" but expect a literal, plaintext password, which is then automatically hashed before used for the user account\&. If both the hashed and the plaintext credential are specified for the same user the former takes precedence\&. It\*(Aqs generally recommended to specify the hashed version; however in test environments with weaker requirements on security it might be easier to pass passwords in plaintext instead\&.
de: Ähnlich zu »passwd\&.hashed-password\&.I<Benutzer>«, erwartet aber ein direktes Klartextpasswort, das automatisch gehasht wird, bevor es für das Benutzerkonto verwandt wird\&. Falls für den gleichen Benutzer sowohl die Klartext- als auch die gehashten Anmeldedaten festgelegt werden, haben erstere Vorrang\&. Es wird im Allgemeinen empfohlen, die gehashte Version zu verwenden; in Testumgebungen mit geringeren Sicherheitsanforderungen mag es leichter sein, stattdessen Passwörter direkt im Klartext zu übergeben\&.

source: passwd\&.shell\&.I<user>
de: passwd\&.shell\&.I<Benutzer>

source: Specifies the shell binary to use for the specified account when creating it\&.
de: Gibt das Shell-Programm an, das für das festgelegte Konto bei der Erstellung verwandt werden soll\&.

source: Note that by default the systemd-sysusers\&.service unit file is set up to inherit the "passwd\&.hashed-password\&.root", "passwd\&.plaintext-password\&.root" and "passwd\&.shell\&.root" credentials from the service manager\&. Thus, when invoking a container with an unpopulated /etc/ for the first time it is possible to configure the root user\*(Aqs password to be "systemd" like this:
de: Beachten Sie, dass standardmäßig die Unit-Datei systemd-sysusers\&.service so eingerichtet ist, dass es die Anmeldedaten »passwd\&.hashed-password\&.root«, »passwd\&.plaintext-password\&.root« und »passwd\&.shell\&.root« vom Diensteverwalter erbt\&. Wird daher ein Container mit einem leeren /etc/ das erste Mal aufgerufen, ist es möglich, das Passwort für den Benutzer root wie folgt auf »systemd« zu konfigurieren:

source: Note again that the data specified in these credentials is consulted only when creating an account for the first time, it may not be used for changing the password or shell of an account that already exists\&.
de: Beachten Sie nochmals, dass die in diesen Anmeldedaten festgelegten Daten nur herangezogen werden, wenn erstmalig ein Konto erstellt wird, sie können nicht zum Ändern des Passworts oder der Shell eines bereits existierenden Kontos verwandt werden\&.

source: Use B<mkpasswd>(1) for generating UNIX password hashes from the command line\&.
de: Verwenden Sie B<mkpasswd>(1) zur Erstellung von UNIX-Passwort-Hashes auf der Befehlszeile\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<systemd>(1), B<sysusers.d>(5), \m[blue]B<Users, Groups, UIDs and GIDs on systemd systems>\m[]\&\s-2\u[2]\d\s+2, B<systemd.exec>(1), B<mkpasswd>(1)
de: B<systemd>(1), B<sysusers.d>(5), \m[blue]B<Benutzer, Gruppen, UIDs und GIDs auf Systemd-Systemen>\m[]\&\s-2\u[2]\d\s+2, B<systemd.exec>(1), B<mkpasswd>(1)

source: NOTES
de: ANMERKUNGEN

source: Discoverable Partitions Specification
de: Spezifikation für auffindbare Partitionen

source: Users, Groups, UIDs and GIDs on systemd systems
de: Benutzer, Gruppen, UIDs und GIDs auf Systemd-Systemen

source: When this option is given, one ore more positional arguments must be specified\&. All configuration files found in the directories listed in B<sysusers.d>(5) will be read, and the configuration given on the command line will be handled instead of and with the same priority as the configuration file I<PATH>\&.
de: Wird diese Option angegeben, müssen eine oder mehrere positionsbezogene Argumente festgelegt werden\&. Alle in den in B<sysusers.d>(5) aufgeführten Verzeichnissen gefundenen Konfigurationsdateien werden gelesen und die auf der Befehlszeile übergebene Konfiguration wird statt der Konfigurationsdatei I<PFAD> mit der gleichen Priorität wie diese verwandt\&.
