Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-sysupdate.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-sysupdate, systemd-sysupdate.service, systemd-sysupdate.timer, systemd-sysupdate-reboot.service, systemd-sysupdate-reboot.timer - Automatically Update OS or Other Resources
de: systemd-sysupdate, systemd-sysupdate.service, systemd-sysupdate.timer, systemd-sysupdate-reboot.service, systemd-sysupdate-reboot.timer - Das Betriebssystem oder andere Ressourcen automatisch aktualisieren

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-sysupdate> [OPTIONS...]
de: B<systemd-sysupdate> [OPTIONEN…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-sysupdate> atomically updates the host OS, container images, portable service images or other sources, based on the transfer configuration files described in B<sysupdate.d>(5)\&.
de: B<systemd-sysupdate> aktualisiert atomar das Betriebssystem, Container-Abbilder, portable Diensteabbilder oder andere Quellen, basierend auf den in B<sysupdate.d>(5) beschriebenen Übertragungskonfigurationsdateien\&.

source: This tool implements file, directory, or partition based update schemes, supporting multiple parallel installed versions of specific resources in an A/B (or even: A/B/C, A/B/C/D/, \&...) style\&. A/B updating means that when one version of a resource is currently being used, the next version can be downloaded, unpacked, and prepared in an entirely separate location, independently of the first, and \(em once complete \(em be activated, swapping the roles so that it becomes the used one and the previously used one becomes the one that is replaced by the next update, and so on\&. The resources to update are defined in transfer files, one for each resource to be updated\&. For example, resources that may be updated with this tool could be: a root file system partition, a matching Verity partition plus one kernel image\&. The combination of the three would be considered a complete OS update\&.
de: Dieses Werkzeug implementiert datei-, verzeichnis- oder partitionsbasierte Aktualisierungsschemata, unterstützt mehrere parallel installierte Versionen bestimmter Ressourcen in einer A/B- (oder sogar A/B/C-, A/B/C/DE- …) Art\&. A/B-Aktualisierung bedeutet, dass bei der aktuellen Verwendung einer Ressource die nächste an einen komplett anderen Ort heruntergeladen, entpackt und vorbereitet werden kann, unabhängig von der ersten und \(en sobald abgeschlossen \(en diese aktiviert werden kann\&. Dabei werden die Rollen vertauscht, so dass die Neue die verwandte Ressource wird und die bisher eingesetzte diejenige wird, die bei der nächsten Aktualisierung ersetzt werden wird und so weiter\&. Die zu aktualisierenden Ressourcen werden in Übertragungsdateien definiert, eine für jede zu aktualisierende Ressource\&. Ressourcen, die mit diesem Werkzeug aktualisiert werden können, sind beispielsweise eine Wurzeldateisystempartition, eine zugehörige Verity-Partition sowie ein Kernelabbild\&. Die Kombination dieser drei kann als komplette Betriebssystemaktualisierung betrachtet werden\&.

source: The tool updates partitions, files or directory trees always in whole, and operates with at least two versions of each of these resources: the I<current> version, plus the I<next> version: the one that is being updated to, and which is initially incomplete as the downloaded data is written to it; plus optionally more versions\&. Once the download of a newer version is complete it becomes the current version, releasing the version previously considered current for deletion/replacement/updating\&.
de: Das Werkzeug aktualisiert Partitionen, Dateien oder Verzeichnisbäume immer als Ganzes und agiert mit mindestens zwei Versionen jeder Ressource: der I<aktuellen> Version sowie der I<nächsten> Version: diejenige, auf die aktualisiert wird und die anfänglich unvollständig ist, während die heruntergeladenen Daten geschrieben werden; sowie optional weiteren Versionen\&. Sobald das Herunterladen einer neueren Version abgeschlossen ist, wird diese die aktuelle Version und gibt die Version, die bisher als aktuelle Version betrachtet wurde, zum Löschen/Ersetzen/Aktualisieren frei\&.

source: When installing new versions the tool will directly download, decompress, unpack and write the new version into the destination\&. This is done in a robust fashion so that an incomplete download can be recognized on next invocation, and flushed out before a new attempt is initiated\&.
de: Beim Installieren neuer Versionen wird dieses Werkzeug die neue Version herunterladen, entkomprimieren und entpacken und direkt in das Ziel schreiben\&. Dies erfolgt auf eine robuste Art, so dass ein unvollständiges Herunterladen beim nächsten Aufruf erkannt wird und die Reste beseitigt werden, bevor ein neuer Versuch eingeleitet wird\&.

source: Note that when writing updates to a partition, the partition has to exist already, as B<systemd-sysupdate> will not automatically create new partitions\&. Use a tool such as B<systemd-repart>(8) to automatically create additional partitions to be used with B<systemd-sysupdate> on boot\&.
de: Beachten Sie, dass beim Schreiben von Aktualisierungen in eine Partition diese bereits existieren muss, da B<systemd-sysupdate> nicht automatisch Partitionen erstellen wird\&. Verwenden Sie Werkzeuge wie B<systemd-repart>(8), um automatisch zusätzliche Partitionen beim Systemstart für die Verwendung mit B<systemd-sysupdate> zu erstellen\&.

source: The tool can both be used on the running OS, to update the OS in "online" state from within itself, and on "offline" disk images, to update them from the outside based on transfer files embedded in the disk images\&. For the latter, see B<--image=> below\&. The latter is particularly interesting to update container images or portable service images\&.
de: Dieses Werkzeug kann sowohl auf dem laufenden Betriebssystem verwandt werden, um das Betriebssystem »im Betriebszustand« aus sich selbst zu aktualisieren und bei »nicht aktiven« Plattenabbildern, um diese von außerhalb, basierend auf der Übertragung von Dateien, die in diese Abbilder eingebettet sind, zu aktualisieren\&. Für Letzteres siehe die nachfolgende Beschreibung von B<--image=>\&. Letzteres ist insbesondere für die Aktualisierung von Container-Abbildern oder portierbaren Diensteabildern interessant\&.

source: The systemd-sysupdate\&.service system service will automatically update the host OS based on the installed transfer files\&. It is triggered in regular intervals via systemd-sysupdate\&.timer\&. The systemd-sysupdate-reboot\&.service will automatically reboot the system after a new version is installed\&. It is triggered via systemd-sysupdate-reboot\&.timer\&. The two services are separate from each other as it is typically advisable to download updates regularly while the system is up, but delay reboots until the appropriate time (i\&.e\&. typically at night)\&. The two sets of service/timer units may be enabled separately\&.
de: Der Systemdienst systemd-sysupdate\&.service wird das Betriebssystem automatisch basierend auf den installierten Übertragungsdateien aktualisieren\&. Er wird regelmäßig über systemd-sysupdate\&.timer ausgelöst\&. systemd-sysupdate-reboot\&.service wird das System automatisch nach der Installation einer neuen Version neu starten\&. Der Systemneustart wird mittels systemd-sysupdate-reboot\&.timer ausgelöst\&. Die zwei Dienste sind voneinander getrennt, da es typischerweise ratsam ist, Aktualisierungen regelmäßig während des Betriebs herunterzuladen, aber Neustarts bis zu einem geeigneten Zeitpunkt zu verzögern (d\&.h\&. typischerweise nachts)\&. Die zwei Dienste-/Timer-Unit-Gruppen können separat aktiviert werden\&.

source: For details about transfer files and examples see B<sysupdate.d>(5)\&.
de: Für Details über Übertragungsdateien und Beispiele siehe B<sysupdate.d>(5)\&.

source: COMMAND
de: BEFEHL

source: The following commands are understood:
de: Die folgenden Befehle werden verstanden:

source: If invoked without an argument, enumerates downloadable and installed versions, and shows a summarizing table with the discovered versions and their properties, including whether there\*(Aqs a newer candidate version to update to\&. If a version argument is specified, shows details about the specific version, including the individual files that need to be transferred to acquire the version\&.
de: Beim Aufruf ohne Argumente werden die herunterladbaren und installierbaren Versionen aufgezählt und eine zusammenfassende Tabelle mit den erkannten Versionen und ihren Eigenschaften dargestellt\&. Dazu gehört, ob es neuere Kandidatenversionen gibt, auf die aktualisiert werden kann\&. Falls ein Versionsargument angegeben ist, werden Details über die bestimmte Version angezeigt, einschließlich der einzelnen Dateien, die übertragen werden müssen, um die neue Version zu erlangen\&.

source: If no command is explicitly specified this command is implied\&.
de: Falls kein Befehl explizit angegeben ist, wird dieser Befehl impliziert\&.

source: Checks if there\*(Aqs a new version available\&. This internally enumerates downloadable and installed versions and returns exit status 0 if there\*(Aqs a new version to update to, non-zero otherwise\&. If there is a new version to update to, its version identifier is written to standard output\&.
de: Prüft, ob eine neue Version verfügbar ist\&. Dies zählt intern die herunterladbaren und installierten Versionen auf und liefert einen Exit-Status von 0, falls es eine neue Version gibt, auf die aktualisiert werden kann, und ansonsten einen von Null verschiedenen Wert\&. Falls es eine neue Version gibt, auf die aktualisiert werden kann, dann wird deren Versionskennzeichnung auf die Standardausgabe geschrieben\&.

source: Installs (updates to) the specified version, or if none is specified to the newest version available\&. If the version is already installed or no newer version available, no operation is executed\&.
de: Installiert (aktualisiert auf) die angegebene Version oder die neuste Version, falls keine Version angegeben ist\&. Falls die Version bereits installiert ist oder es keine neuere Version gibt, erfolgt keine Aktion\&.

source: If a new version to install/update to is found, old installed versions are deleted until at least one new version can be installed, as configured via I<InstanceMax=> in B<sysupdate.d>(5), or via the available partition slots of the right type\&. This implicit operation can also be invoked explicitly via the B<vacuum> command described below\&.
de: Falls eine neue zu installierende/darauf zu aktualisierende Version gefunden wird, werden alte Versionen gelöscht, bis mindestens eine neue Version installiert werden kann\&. Dies wird mittels I<InstanceMax=> in B<sysupdate.d>(5) oder über die verfügbaren Partitionsplätze vom richtigen Typ konfiguriert\&. Diese implizite Aktion kann auch explizit über den nachfolgend beschriebenen Befehl B<vacuum> aufgerufen werden\&.

source: Deletes old installed versions until the limits configured via I<InstanceMax=> in B<sysupdate.d>(5) are met again\&. Normally, it should not be necessary to invoke this command explicitly, since it is implicitly invoked whenever a new update is initiated\&.
de: Löscht alte installierte Versionen, bis die mittels I<InstanceMax=> in B<sysupdate.d>(5) konfigurierten Beschränkungen wieder eingehalten werden\&. Normalerweise sollte es nicht notwendig sein, diesen Befehl explizit aufzurufen, da er implizit aufgerufen wird, wenn eine neue Aktualisierung eingeleitet wird\&.

source: Checks whether a newer version of the OS is installed than the one currently running\&. Returns zero if so, non-zero otherwise\&. This compares the newest installed version\*(Aqs identifier with the OS image version as reported by the I<IMAGE_VERSION=> field in /etc/os-release\&. If the former is newer than the latter, an update was apparently completed but not activated (i\&.e\&. rebooted into) yet\&.
de: Prüft, ob eine neuere Version des Betriebssystems als die aktuell laufende installiert ist\&. Liefert Null zurück, falls dem so ist und ansonsten einen anderen Wert\&. Dies vergleicht die Versionskennzeichnung der neusten installierten Version mit der Version des Betriebssystemabbildes, wie es vom Feld I<IMAGE_VERSION=> in /etc/os-release berichtet wird\&. Falls erstere neuerer als letztere ist, wurde anscheinend eine Aktualisierung abgeschlossen, aber noch nicht aktiviert (d\.h\&. kein Systemneustart hinein durchgeführt)\&.

source: Similar to the B<pending> command but immediately reboots in case a newer version of the OS has been installed than the one currently running\&. This operation can be done implicitly together with the B<update> command, after a completed update via the B<--reboot> switch, see below\&. This command will execute no operation (and return success) if no update has been installed, and thus the system was not rebooted\&.
de: Ähnlich wie der Befehl B<pending>, startet aber das System sofort neu, falls eine neuere Version des Betriebssystems installiert wurde, als aktuell läuft\&. Diese Aktion kann implizit zusammen mit dem Befehl B<update> erfolgen, nach einer abgeschlossenen Aktualisierung mittels des Schalters B<--reboot>, siehe unten\&. Dieser Befehl wird keine Aktion durchführen (und Erfolg zurückliefern), falls keine Aktualisierung installiert wurde und daher das System nicht neugestartet wurde\&.

source: Lists components that can be updated\&. This enumerates the /etc/sysupdate\&.*\&.d/, /run/sysupdate\&.*\&.d/ and /usr/lib/sysupdate\&.*\&.d/ directories that contain transfer files\&. This command is useful to list possible parameters for B<--component=> (see below)\&.
de: Führt zu aktualisierende Komponenten auf\&. Dies zählt die Verzeichnisse /etc/sysupdate\&.*\&.d/, /run/sysupdate\&.*\&.d/ und /usr/lib/sysupdate\&.*\&.d/ auf, die Übertragungsdateien enthalten\&. Dieser Befehl ist zum Auflisten möglicher Parameter für B<--component=> nützlich (siehe unten)\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Selects the component to update\&. Takes a component name as argument\&. This has the effect of slightly altering the search logic for transfer files\&. If this switch is not used, the transfer files are loaded from /etc/sysupdate\&.d/*\&.conf, /run/sysupdate\&.d/*\&.conf and /usr/lib/sysupdate\&.d/*\&.conf\&. If this switch is used, the specified component name is used to alter the directories to look in to be /etc/sysupdate\&.I<component>\&.d/*\&.conf, /run/sysupdate\&.I<component>\&.d/*\&.conf and /usr/lib/sysupdate\&.I<component>\&.d/*\&.conf, each time with the I<component> string replaced with the specified component name\&.
de: Wählt die zu aktualisierenden Komponenten aus\&. Akzeptiert einen Komponentennamen als Argument\&. Damit wird die Suchlogik für Übertragungsdateien leicht verändert\&. Falls der Schalter nicht verwandt wird, werden die Übertragungsdateien aus /etc/sysupdate\&.d/*\&.conf, /run/sysupdate\&.d/*\&.conf und /usr/lib/sysupdate\&.d/*\&.conf geladen\&. Falls dieser Schalter verwandt wird, wird der angegebene Komponentenname verwandt, um die Verzeichnisse, in denen gesucht wird, auf /etc/sysupdate\&.I<Komponente>\&.d/*\&.conf, /run/sysupdate\&.I<Komponente>\&.d/*\&.conf und /usr/lib/sysupdate\&.I<Komponente>\&.d/*\&.conf zu ändern\&. Dabei wird die Zeichenkette I<Komponente> durch den angegebenen Komponentennamen ersetzt\&.

source: Use the B<components> command to list available components to update\&. This enumerates the directories matching this naming rule\&.
de: Verwenden Sie den Befehl B<components>, um alle zu aktualisierenden Komponenten aufzulisten\&. Dies zählt die Verzeichnisse auf, die auf diese Bennenungsregel passen\&.

source: Components may be used to define a separate set of transfer files for different components of the OS that shall be updated separately\&. Do not use this concept for resources that shall always be updated together in a synchronous fashion\&. Simply define multiple transfer files within the same sysupdate\&.d/ directory for these cases\&.
de: Komponenten können verwandt werden, um getrennte Gruppen von Übertragungsdateien für verschiedene Komponenten des Betriebssystems zu definieren, die getrennt aktualisiert werden sollen\&. Verwenden Sie dieses Konzept nicht für Ressourcen, die immer zusammen auf synchrone Art aktualisiert werden sollen\&. Für diese Fälle definieren Sie einfach mehrere Übertragungsdateien innerhalb des gleichen sysupdate\&.d/-Verzeichnisses\&.

source: This option may not be combined with B<--definitions=>\&.
de: Diese Option kann nicht mit B<--definitions=> kombiniert werden\&.

source: A path to a directory\&. If specified, the transfer *\&.conf files are read from this directory instead of /usr/lib/sysupdate\&.d/*\&.conf, /etc/sysupdate\&.d/*\&.conf, and /run/sysupdate\&.d/*\&.conf\&.
de: Ein Pfad zu einem Verzeichnis\&. Falls angegeben, werden die Übertragungsdateien *\&.conf aus diesem Verzeichnis statt aus /usr/lib/sysupdate\&.d/*\&.conf, /etc/sysupdate\&.d/*\&.conf und /run/sysupdate\&.d/*\&.conf gelesen\&.

source: This option may not be combined with B<--component=>\&.
de: Diese Option kann nicht mit B<--component=> kombiniert werden\&.

source: Takes a path to a directory to use as root file system when searching for sysupdate\&.d/*\&.conf files\&.
de: Akzeptiert einen Pfad zu einem für das Suchen nach Dateien sysupdate\&.d/*\&.conf als Wurzeldateisystem zu verwendenden Verzeichnis\&.

source: Takes a path to a disk image file or device to mount and use in a similar fashion to B<--root=>, see above\&. If this is used and partition resources are updated this is done inside the specified disk image\&.
de: Akzeptiert einen Pfad zu einer Abbilddatei oder zu einem einzuhängenden Gerät, das ähnlich wie B<--root=> verwandt werden soll, siehe oben\&. Falls dies verwandt wird und Partitionsressourcen aktualisiert werden, dann erfolgt dies innerhalb des angegebenen Plattenabbildes\&.

source: Takes a decimal integer greater than or equal to 2\&. Controls how many versions to keep at any time\&. This option may also be configured inside the transfer files, via the I<InstancesMax=> setting, see B<sysupdate.d>(5) for details\&.
de: Akzeptiert eine dezimale Ganzzahl größer oder gleich 2\&. Steuert, wie viele Versionen jederzeit behalten werden sollen\&. Diese Option kann auch innerhalb von Übertragungsdateien über die Einstellung I<InstancesMax=> konfiguriert werden, siehe B<sysupdate.d>(5) für Details\&.

source: Takes a boolean argument, defaults to yes\&. This may be used to specify whether the newly updated resource versions shall be synchronized to disk when appropriate (i\&.e\&. after the download is complete, before it is finalized, and again after finalization)\&. This should not be turned off, except to improve runtime performance in testing environments\&.
de: Akzeptiert ein logisches Argument, standardmäßig ja\&. Dies kann zur Festlegung verwandt werden, ob die frisch aktualisierten Ressourcenversionen bei Bedarf auf Platte synchronisiert werden sollen (d\&.h\&. nachdem das Herunterladen vollständig ist, bevor es abgeschlossen wurde und dann nach dem Abschluss)\&. Das sollte nicht ausgeschaltet werden, außer um die Laufzeitleistung in Testumgebungen zu verbessern\&.

source: Takes a boolean argument, defaults to yes\&. Controls whether to cryptographically verify downloads\&. Do not turn this off, except in testing environments\&.
de: Akzeptiert ein logisches Argument, standardmäßig ja\&. Steuert, ob heruntergeladene Inhalte kryptographisch überprüft werden sollen\&. Das sollte nicht ausgeschaltet werden, außer in Testumgebungen\&.

source: When used in combination with the B<update> command and a new version is installed, automatically reboots the system immediately afterwards\&.
de: Startet das System direkt im Anschluss neu, wenn es in Kombination mit dem Befehl B<update> verwandt wird und eine neue Version installiert wurde\&.

source: Do not pipe output into a pager\&.
de: Leitet die Ausgabe nicht an ein Textanzeigeprogramm weiter\&.

source: Do not print the legend, i\&.e\&. column headers and the footer with hints\&.
de: Gibt die Legende nicht aus, d\&.h\&. die Spaltenköpfe und die Fußzeile mit Hinweisen\&.

source: B<--json=>I<MODE>
de: B<--json=>I<MODUS>

source: Shows output formatted as JSON\&. Expects one of "short" (for the shortest possible output without any redundant whitespace or line breaks), "pretty" (for a pretty version of the same, with indentation and line breaks) or "off" (to turn off JSON output, the default)\&.
de: Zeigt die Ausgabe als JSON formatiert\&. Erwartet entweder »short« (für die kürzest mögliche Ausgabe ohne unnötigen Leerraum oder Zeilenumbrüche), »pretty« (für eine schönere Version der gleichen Ausgabe, mit Einzügen und Zeilenumbrüchen) oder »off« (um die standardmäßig aktivierte JSON-Ausgabe auszuschalten)\&.

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: SEE ALSO
de: SIEHE AUCH
