Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-journal-remote.service.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-journal-remote.service, systemd-journal-remote.socket, systemd-journal-remote - Receive journal messages over the network
de: systemd-journal-remote.service, systemd-journal-remote.socket, systemd-journal-remote - Journal-Meldungen über das Netzwerk empfangen

source: SYNOPSIS
de: ÜBERSICHT

source: B</usr/lib/systemd/systemd-journal-remote> [OPTIONS...] [-o/--output=I<DIR>|I<FILE>] [SOURCES...]
de: B</usr/lib/systemd/systemd-journal-remote> [OPTIONEN…] [-o/--output=I<VERZ>|I<DATEI>] [QUELLEN…]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-journal-remote> is a command to receive serialized journal events and store them to journal files\&. Input streams are in the \m[blue]B<Journal Export Format>\m[]\&\s-2\u[1]\d\s+2, i\&.e\&. like the output from B<journalctl --output=export>\&. For transport over the network, this serialized stream is usually carried over an HTTPS connection\&.
de: B<systemd-journal-remote> ist ein Befehl, um serialisierte Journal-Ereignisse zu empfangen und in Journal-Dateien zu speichern\&. Eingabedatenströme sind im \m[blue]B<Journal-Exportformat>\m[]\&\s-2\u[1]\d\s+2, d\&.h\&. wie die Ausgabe von B<journalctl --output=export>\&. Im Netzwerk wird dieser Datenstrom normalerweise über eine HTTPS-Verbindung transportiert\&.

source: systemd-journal-remote\&.service is a system service that uses B<systemd-journal-remote> to listen for connections\&. systemd-journal-remote\&.socket configures the network address that systemd-journal-remote\&.service listens on\&. By default this is port 19532\&. What connections are accepted and how the received data is stored can be configured through the B<journal-remote.conf>(5) configuration file\&.
de: systemd-journal-remote\&.service ist ein Systemdienst, der B<systemd-journal-remote> zum Warten auf Verbindungen verwendet\&. systemd-journal-remote\&.socket konfiguriert die Netzwerkadresse, an der systemd-journal-remote\&.service auf Anfragen wartet\&. Standardmäßig ist dies Port 19532\&. Welche Verbindungen akzeptiert werden und wie die empfangenen Daten gespeichert werden, kann mittels der Konfigurationsdatei B<journal-remote.conf>(5) konfiguriert werden\&.

source: SOURCES
de: QUELLEN

source: Sources can be either "active" (B<systemd-journal-remote> requests and pulls the data), or "passive" (B<systemd-journal-remote> waits for a connection and then receives events pushed by the other side)\&.
de: Quellen können entweder »aktiv« (B<systemd-journal-remote> fordert die Daten an und lädt sie) oder »passiv« (B<systemd-journal-remote> wartet auf eine Verbindung und empfängt von der anderen Seite übertragene Daten) sein\&.

source: B<systemd-journal-remote> can read more than one event stream at a time\&. They will be interleaved in the output file\&. In case of "active" connections, each "source" is one stream, and in case of "passive" connections, each connection can result in a separate stream\&. Sockets can be configured in "accept" mode (i\&.e\&. only one connection), or "listen" mode (i\&.e\&. multiple connections, each resulting in a stream)\&.
de: B<systemd-journal-remote> kann gleichzeitig mehrere Ereignisdatenströme lesen\&. Diese werden in der Ausgabedatei verschachtelt\&. Bei »aktiven« Verbindungen ist jede »Quelle« ein Datenstrom; bei »passiven« Verbindungen kann jede Verbindung zu einem separaten Datenstrom führen\&. Sockets können im »Akzeptanzmodus« (d\&.h\&. nur eine Verbindung) oder im »Wartemodus« (d\&.h\&. mehrere Verbindungen, jede führt zu einem Datenstrom), konfiguriert werden\&.

source: When there are no more connections, and no more can be created (there are no listening sockets), then B<systemd-journal-remote> will exit\&.
de: Wenn es keine Verbindungen mehr gibt und keine mehr erstellt werden können (es gibt keine Sockets, wo auf Anfragen gewartet werden soll), dann beendet sich B<systemd-journal-remote>\&.

source: Active sources can be specified in the following ways:
de: Aktive Quellen können auf die folgenden Arten festgelegt werden:

source: [SOURCES...]
de: [QUELLEN…]

source: When B<-> is given as a positional argument, events will be read from standard input\&. Other positional arguments will be treated as filenames to open and read from\&.
de: Wird B<-> als Positionsargument übergeben, werden die Ereignisse aus der Standardeingabe gelesen\&. Andere Positionsargumente werden als Dateinamen behandelt, die geöffnet und aus denen gelesen werden soll\&.

source: B<--url=>I<ADDRESS>
de: B<--url=>I<ADRESSE>

source: With the B<--url=>I<ADDRESS> option, events will be retrieved using HTTP from I<ADDRESS>\&. This URL should refer to the root of a remote B<systemd-journal-gatewayd>(8) instance, e\&.g\&. http://some\&.host:19531/ or https://some\&.host:19531/\&.
de: Mit der Option B<--url=>I<ADRESSE> werden die Ereignisse mittels HTTP aus der I<ADRESSE> abgerufen\&. Die URL sollte sich auf die Wurzel einer fernen B<systemd-journal-gatewayd>(8)-Instanz beziehen, z\&.B\&. http://ein\&.Rechner:19531/ oder https://ein\&.Rechner:19531/\&.

source: B<--getter=\*(Aq>I<PROG>B< >B<[OPTIONS...]>B<\*(Aq>
de: B<--getter=\*(Aq>I<PROG>B< >B<[OPTIONEN…]>B<\*(Aq>

source: Program to invoke to retrieve data\&. The journal event stream must be generated on standard output\&.
de: Programm, das zum Abruf von Daten aufgerufen werden soll\&. Der Journal-Ereignisdatenstrom muss auf die Standardausgabe erstellt werden\&.

source: Examples:
de: Beispiele:

source: --getter=\*(Aqcurl "-HAccept: application/vnd\&.fdo\&.journal" https://some\&.host:19531/\*(Aq
de: --getter=\*(Aqcurl "-HAccept: application/vnd\&.fdo\&.journal" https://ein\&.Rechner:19531/\*(Aq

source: --getter=\*(Aqwget --header="Accept: application/vnd\&.fdo\&.journal" -O- https://some\&.host:19531/\*(Aq
de: --getter=\*(Aqwget --header="Accept: application/vnd\&.fdo\&.journal" -O- https://ein\&.Rechner:19531/\*(Aq

source: Passive sources can be specified in the following ways:
de: Passive Quellen können auf die folgenden Arten festgelegt werden:

source: B<--listen-raw=>I<ADDRESS>
de: B<--listen-raw=>I<ADRESSE>

source: I<ADDRESS> must be an address suitable for B<ListenStream=> (cf\&. B<systemd.socket>(5))\&. B<systemd-journal-remote> will listen on this socket for connections\&. Each connection is expected to be a stream of journal events\&.
de: I<ADRESSE> muss eine für B<ListenStream=> geeignete Adresse sein (siehe B<systemd.socket>(5))\&. B<systemd-journal-remote> wird auf diesem Socket auf Anfragen warten\&. Es wird erwartet, dass jede Verbindung ein Datenstrom mit Journal-Ereignissen ist\&.

source: B<--listen-http=>I<ADDRESS>, B<--listen-https=>I<ADDRESS>
de: B<--listen-http=>I<ADRESSE>, B<--listen-https=>I<ADRESSE>

source: I<ADDRESS> must be either a negative integer, in which case it will be interpreted as the (negated) file descriptor number, or an address suitable for B<ListenStream=> (c\&.f\&. B<systemd.socket>(5))\&. In the first case, the server listens on port 19532 by default, and the matching file descriptor must be inherited through I<$LISTEN_FDS>/I<$LISTEN_PID>\&. In the second case, an HTTP or HTTPS server will be spawned on this port, respectively for B<--listen-http=> and B<--listen-https=>\&. Currently, only POST requests to /upload with "Content-Type: application/vnd\&.fdo\&.journal" are supported\&.
de: I<ADRESSE> muss entweder eine negative Ganzzahl (diese wird dann als die negierte Dateideskriptornummer interpretiert) oder eine für B<ListenStream=> geeignete Adresse (siehe B<systemd.socket>(5)) sein\&. Im ersten Fall wartet der Server standardmäßig auf Port 19532 und der passende Dateideskriptor muss mittels I<$LISTEN_FDS>/I<$LISTEN_PID> geerbt worden sein\&. Im zweiten Fall wird auf diesem Port bzw\&. auf B<--listen-http=> und B<--listen-https=> ein HTTP- oder HTTPS-Server erzeugt werden\&. Derzeit werden nur POST-Anfragen nach /upload mit »Content-Type: application/vnd\&.fdo\&.journal« unterstützt\&.

source: B<systemd-journal-remote> supports the I<$LISTEN_FDS>/I<$LISTEN_PID> protocol\&. Open sockets inherited through socket activation behave like those opened with B<--listen-raw=> described above, unless they are specified as an argument in B<--listen-http=->I<n> or B<--listen-https=->I<n> above\&. In the latter case, an HTTP or HTTPS server will be spawned using this descriptor and connections must be made over the HTTP protocol\&.
de: B<systemd-journal-remote> unterstützt das Protokoll I<$LISTEN_FDS>/I<$LISTEN_PID>\&. Offene Sockets, die mittels Socket-Aktivierung geerbt wurden, verhalten sich wie die oben beschriebenen mit B<--listen-raw=> geöffneten, außer sie wurden oben als ein Argument in B<--listen-http=->I<n> oder B<--listen-https=->I<n> angegeben\&. In letzterem Fall wird ein HTTP- oder HTTPS-Server unter Verwendung dieses Deskriptors erzeugt und Verbindungen müssen über das HTTP-Protokoll erfolgen\&.

source: Takes a path to a SSL secret key file in PEM format\&. Defaults to /etc/ssl/private/journal-remote\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the key read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-Geheimschlüsseldatei im PEM-Format\&. Standardmäßig /etc/ssl/private/journal-remote\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und der Schlüssel daraus gelesen\&.

source: Takes a path to a SSL certificate file in PEM format\&. Defaults to /etc/ssl/certs/journal-remote\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the certificate read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-Zertifikatsdatei im PEM-Format\&. Standardmäßig /etc/ssl/certs/journal-remote\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und das Zertifikat daraus gelesen\&.

source: Takes a path to a SSL CA certificate file in PEM format, or B<all>\&. If B<all> is set, then certificate checking will be disabled\&. Defaults to /etc/ssl/ca/trusted\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the certificate read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-CA-Zertifikatsdatei im PEM-Format oder B<all>\&. Falls B<all> gesetzt ist, dann wird die Zertifikatsprüfung deaktiviert\&. Standardmäßig /etc/ssl/ca/trusted\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und das Zertifikat daraus gelesen\&.

source: Takes a comma separated list of gnutls logging categories\&. This option can be used with B<--listen-http=> or B<--listen-https=>\&.
de: Akzeptiert eine Kommata-getrennte Liste von Gnutls-Protokollierungskategorien\&. Diese Option kann mit B<--listen-http=> oder B<--listen-https=> verwandt werden\&.

source: SINKS
de: SENKEN

source: The location of the output journal can be specified with B<-o> or B<--output=>\&.
de: Der Ort des Ausgabe-Journals kann mit B<-o> oder B<--output=> festgelegt werden\&.

source: B<--output=>I<FILE>
de: B<--output=>I<DATEI>

source: Will write to this journal file\&. The filename must end with \&.journal\&. The file will be created if it does not exist\&. If necessary (journal file full, or corrupted), the file will be renamed following normal journald rules and a new journal file will be created in its stead\&.
de: Führt zum Schreiben in diese Journal-Datei\&. Der Dateiname muss auf \&.journal enden\&. Die Datei wird erstellt, falls sie noch nicht existiert\&. Falls notwendig (Journal-Datei voll oder beschädigt), wird die Datei gemäß der normalen Journald-Regeln umbenannt und eine neue Journal-Datei wird an ihrer Stelle erstellt\&.

source: B<--output=>I<DIR>
de: B<--output=>I<VERZ>

source: Will create journal files underneath directory I<DIR>\&. The directory must exist\&. If necessary (journal files over size, or corrupted), journal files will be rotated following normal journald rules\&. Names of files underneath I<DIR> will be generated using the rules described below\&.
de: Führt zur Erstellung von Journal-Dateien unterhalb des Verzeichnisses I<VERZ>\&. Das Verzeichnis muss existieren\&. Falls notwendig (Journal-Dateien zu Groß oder beschädigt), werden die Dateien gemäß der normalen Journald-Regeln rotiert\&. Dateinamen unterhalb I<VERZ> werden gemäß der nachfolgend beschriebenen Regeln erstellt\&.

source: If B<--output=> is not used, the output directory /var/log/journal/remote/ will be used\&. In case the output file is not specified, journal files will be created underneath the selected directory\&. Files will be called remote-I<hostname>\&.journal, where the I<hostname> part is the escaped hostname of the source endpoint of the connection, or the numerical address if the hostname cannot be determined\&.
de: Das Ausgabeverzeichnis /var/log/journal/remote/ wird verwandt, falls B<--output=> nicht genutzt wird\&. Falls die Ausgabedatei nicht festgelegt ist, werden Journal-Dateien unterhalb des ausgewählten Verzeichnisses erstellt\&. Dateien werden remote-I<Rechnername>\&.journal genannt, wobei der Teil I<Rechnername> der maskierte Rechnername des Quellendpunktes der Verbindung oder die numerische Adresse ist, falls der Rechnername nicht bestimmt werden konnte\&.

source: In the case that "active" sources are given by the positional arguments or B<--getter=> option, the output file name must always be given explicitly\&.
de: Falls durch die Positionsargumente »aktive« Quellen oder die Option B<--getter=> übergeben werden, muss der Ausgabedateiname immer explizit angegeben werden\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: One of B<none> or B<host>\&. For the first, only one output journal file is used\&. For the latter, a separate output file is used, based on the hostname of the other endpoint of a connection\&.
de: Entweder B<none> oder B<host>\&. Für Erstere wird nur eine Ausgabe-Journal-Datei verwandt\&. Für Letztere wird eine separate Ausgabedatei verwandt, basierend auf dem Rechnernamen des anderen Endpunktes einer Verbindung\&.

source: In the case that "active" sources are given by the positional arguments or B<--getter=> option, the output file name must always be given explicitly and only B<none> is allowed\&.
de: Falls »aktive« Quellen als Positionsargumente oder die Option B<--getter=> übergeben werden, muss der Ausgabedateiname immer explizit angegeben werden und nur B<none> ist erlaubt\&.

source: B<--compress> [I<BOOL>]
de: B<--compress> [I<LOGISCH>]

source: If this is set to "yes" then compress the data in the journal using XZ\&. The default is "yes"\&.
de: Falls dies auf »yes« gesetzt ist, werden die Daten im Journal mittels XZ komprimiert\&. Die Vorgabe ist »yes«\&.

source: B<--seal> [I<BOOL>]
de: B<--seal> [I<LOGISCH>]

source: If this is set to "yes" then periodically sign the data in the journal using Forward Secure Sealing\&. The default is "no"\&.
de: Falls dies auf »yes« gesetzt ist, werden die Daten im Journal periodisch mittels »Forward Secure Sealing« signiert\&. Die Vorgabe ist »no«\&.

source: Print a short help text and exit\&.
de: Zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: Zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: EXAMPLES
de: BEISPIELE

source: Copy local journal events to a different journal directory:
de: Lokale Journal-Ereignisse in ein anderes Journal-Verzeichnis kopieren:

source: journalctl -o export | systemd-journal-remote -o /tmp/dir/foo\&.journal -
de: journalctl -o export | systemd-journal-remote -o /tmp/Verz/foo\&.journal -

source: Retrieve all available events from a remote B<systemd-journal-gatewayd>(8) instance and store them in /var/log/journal/remote/remote-some\&.host\&.journal:
de: Alle verfügbaren Ereignisse von einer fernen B<systemd-journal-gatewayd>(8)-Instanz abfragen und sie in /var/log/journal/remote/remote-ein\&.Rechner\&.journal speichern:

source: systemd-journal-remote --url http://some\&.host:19531/
de: systemd-journal-remote --url http://ein\&.Rechner:19531/

source: Retrieve current boot events and wait for new events from a remote B<systemd-journal-gatewayd>(8) instance, and store them in /var/log/journal/remote/remote-some\&.host\&.journal:
de: Aktuelle Systemstartereignisse abfragen und auf neue Ereignisse von einer fernen B<systemd-journal-gatewayd>(8)-Instanz warten und sie in /var/log/journal/remote/remote-ein\&.Rechner\&.journal speichern:

source: systemd-journal-remote --url http://some\&.host:19531/entries?boot&follow
de: systemd-journal-remote --url http://ein\&.Rechner:19531/entries?boot&follow

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: B</lib/systemd/systemd-journal-remote> [OPTIONS...] [-o/--output=I<DIR>|I<FILE>] [SOURCES...]
de: B</lib/systemd/systemd-journal-remote> [OPTIONEN…] [-o/--output=I<DIR>|I<FILE>] [QUELLEN…]

source: Takes a path to a SSL secret key file in PEM format\&. Defaults to /etc/pki/systemd/private/journal-remote\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the key read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-Datei für geheime Schlüssel im PEM-Format\&. Standardmäßig /etc/pki/systemd/private/journal-remote\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und der Schlüssel daraus gelesen\&.

source: Takes a path to a SSL certificate file in PEM format\&. Defaults to /etc/pki/systemd/certs/journal-remote\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the certificate read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-Zertifikatsdatei im PEM-Format\&. Standardmäßig /etc/pki/systemd/certs/journal-remote\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und das Zertifikat daraus gelesen\&.

source: Takes a path to a SSL CA certificate file in PEM format, or B<all>\&. If B<all> is set, then certificate checking will be disabled\&. Defaults to /etc/pki/systemd/ca/trusted\&.pem\&. This option can be used with B<--listen-https=>\&. If the path refers to an B<AF_UNIX> stream socket in the file system a connection is made to it and the certificate read from it\&.
de: Akzeptiert einen Pfad zu einer SSL-CA-Zertifikatsdatei im PEM-Format oder B<all>\&. Falls B<all> gesetzt ist, dann wird die Zertifikatsprüfung deaktiviert\&. Standardmäßig /etc/pki/systemd/ca/trusted\&.pem\&. Diese Option kann mit B<--listen-https=> verwandt werden\&. Falls sich der Pfad auf ein B<AF_UNIX>-Datenstromsocket in dem Dateisystem bezieht, wird zu diesem eine Verbindung eröffnet und das Zertifikat daraus gelesen\&.
