Repository: sebras/manpages-l10n
Catalog: po/*/man8/systemd-cryptsetup@.service.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-cryptsetup@.service, systemd-cryptsetup - Full disk decryption logic
de: systemd-cryptsetup@.service, systemd-cryptsetup - Logik zur vollständigen Verschlüsselung von Datenträgern

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: systemd-cryptsetup@\&.service is a service responsible for setting up encrypted block devices\&. It is instantiated for each device that requires decryption for access\&.
de: Systemd-cryptsetup@\&.service dient zur Einrichtung von verschlüsselten Blockgeräten\&. Eine Instanz des Dienstes wird für jedes Gerät aufgerufen, welches entschlüsselt werden muss, um darauf zugreifen zu können\&.

source: systemd-cryptsetup@\&.service instances are part of the system-systemd\ex2dcryptsetup\&.slice slice, which is destroyed only very late in the shutdown procedure\&. This allows the encrypted devices to remain up until filesystems have been unmounted\&.
de: systemd-cryptsetup@\&.service-Instanzen sind Teil der Scheibe system-systemd\ex2dcryptsetup\&.slice, die erst sehr spät in der Herunterfahrprozedur zerstört wird\&. Dies ermöglicht es, dass verschlüsselte Geräte verfügbar bleiben, bis die Dateisysteme ausgehängt wurden\&.

source: systemd-cryptsetup@\&.service will ask for hard disk passwords via the \m[blue]B<password agent logic>\m[]\&\s-2\u[1]\d\s+2, in order to query the user for the password using the right mechanism at boot and during runtime\&.
de: Systemd-cryptsetup@\&.service erfragt gemäß der \m[blue]B<Passwordagent-Logik>\m[]\&\s-2\u[1]\d\s+2 die Festplattenpasswörter, damit die Eingabe des Passworts durch den Benutzer während des Systemstarts und im laufenden Betrieb nach dem korrekten Mechanismus geschieht\&.

source: At early boot and when the system manager configuration is reloaded, /etc/crypttab is translated into systemd-cryptsetup@\&.service units by B<systemd-cryptsetup-generator>(8)\&.
de: In der frühen Phase des Systemstarts und beim Neuladen der Konfiguration der Systemverwaltung wird die /etc/crypttab von B<systemd-cryptsetup-generator>(8) in Systemd-cryptsetup@\&.service-Units übersetzt\&.

source: In order to unlock a volume a password or binary key is required\&. systemd-cryptsetup@\&.service tries to acquire a suitable password or binary key via the following mechanisms, tried in order:
de: Um einen Datenträger zu entsperren, wird ein Passwort oder ein binärer Schlüssel benötigt\&. systemd-cryptsetup@\&.service versucht, ein geeignetes Passowrt oder einen binären Schlüssel zu erlangen, indem in dieser Reihenfolge folgender Mechanismus durchlaufen wird:

source: If a key file is explicitly configured (via the third column in /etc/crypttab), a key read from it is used\&. If a PKCS#11 token, FIDO2 token or TPM2 device is configured (using the I<pkcs11-uri=>, I<fido2-device=>, I<tpm2-device=> options) the key is decrypted before use\&.
de: Falls (mittels der dritten Spalte in /etc/crypttab) explizit eine Schlüsseldatei konfiguriert ist, wird ein daraus eingelesener Schlüssel verwandt\&. Falls (mittels der Option I<pkcs11-uri=>, I<fido2-device=> oder I<tpm2-device=>) ein PKCS#11-Token oder TPM2-Gerät konfiguriert ist, wird der Schlüssel vor der Verwendung entschlüsselt\&.

source: If no key file is configured explicitly this way, a key file is automatically loaded from /etc/cryptsetup-keys\&.d/I<volume>\&.key and /run/cryptsetup-keys\&.d/I<volume>\&.key, if present\&. Here too, if a PKCS#11/FIDO2/TPM2 token/device is configured, any key found this way is decrypted before use\&.
de: Falls auf diese Weise keine Schlüsseldatei explizit konfiguriert ist, wird eine Schlüsseldatei automatisch aus /etc/cryptsetup-keys\&.d/I<Datenträger>\&.key und /run/cryptsetup-keys\&.d/I<Datenträger>\&.key geladen, falls diese vorhanden sind\&. Auch hier gilt, dass jeder so gefundene Schlüssel vor der Verwendung entschlüsselt wird, falls ein PKCS#11-/FIDO2-/TPM2-Token/Gerät konfiguriert ist\&.

source: If the I<try-empty-password> option is specified it is then attempted to unlock the volume with an empty password\&.
de: Falls die Option I<try-empty-password> konfiguriert ist, dann wird versucht, den Datenträger mit dem leeren Passwort zu entsperren\&.

source: The kernel keyring is then checked for a suitable cached password from previous attempts\&.
de: Dann wird der Kernel-Schlüsselbund auf ein geeignetes zwischengespeichertes Passwort aus vorherigen Versuchen übeprüft\&.

source: Finally, the user is queried for a password, possibly multiple times, unless the I<headless> option is set\&.
de: Schließlich wird der Benutzer nach einem Passwort gefragt, möglicherweise mehrfach, außer die Option I<headless> ist gesetzt\&.

source: If no suitable key may be acquired via any of the mechanisms describes above, volume activation fails\&.
de: Falls kein geeigneter Schlüssel mittels eines der oben beschriebenen Mechanismen erlangt werden kann, schlägt die Aktivierung des Datenträgers fehl\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: password agent logic
de: Passwortagent-Logik

source: If a key file is explicitly configured (via the third column in /etc/crypttab), a key read from it is used\&. If a PKCS#11 token is configured (using the I<pkcs11-uri=> option) the key is decrypted before use\&.
de: Falls (mittels der dritten Spalte in /etc/crypttab) explizit eine Schlüsseldatei konfiguriert ist, wird ein daraus eingelesener Schlüssel verwandt\&. Falls (mittels der Option I<pkcs11-uri=>) ein PKCS#11-Token konfiguriert ist, wird der Schlüssel vor der Verwendung entschlüsselt\&.

source: If no key file is configured explicitly this way, a key file is automatically loaded from /etc/cryptsetup-keys\&.d/I<volume>\&.key and /run/cryptsetup-keys\&.d/I<volume>\&.key, if present\&. Here too, if a PKCS#11 token is configured, any key found this way is decrypted before use\&.
de: Falls auf diese Weise keine Schlüsseldatei explizit konfiguriert ist, wird eine Schlüsseldatei automatisch aus /etc/cryptsetup-keys\&.d/I<Datenträger>\&.key und /run/cryptsetup-keys\&.d/I<Datenträger>\&.key geladen, falls diese vorhanden sind\&. Auch hier gilt, dass jeder so gefundene Schlüssel vor der Verwendung entschlüsselt wird, falls ein PKCS#11-Token konfiguriert ist\&.

source: Finally, the user is queried for a password, possibly multiple times\&.
de: Schließlich wird der Benutzer nach einem Passwort gefragt, möglicherweise mehrfach\&.
