Repository: sebras/manpages-l10n
Catalog: po/*/man8/traceroute.8.po
Languages: uk

source: 11 October 2006
uk: 11 жовтня 2006 року

source: Traceroute For Linux
uk: Traceroute для Linux

source: NAME
uk: НАЗВА

source: traceroute - print the route packets trace to network host
uk: traceroute — виведення трасування пакетів маршрутизації для вузла мережі

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<traceroute> [B<-46dFITUnreAV>] [B<-f first_ttl>] [B<-g gate,...>]
uk: B<traceroute> [B<-46dFITUnreAV>] [B<-f перший_ttl>] [B<-g шлюз,...>]

source: [B<-i device>] [B<-m max_ttl>] [B<-p port>] [B<-s src_addr>]
uk: [B<-i пристрій>] [B<-m макс_ttl>] [B<-p порт>] [B<-s адреса_джерела>]

source: [B<-q nqueries>] [B<-N squeries>] [B<-t tos>]
uk: [B<-q кількість_запитів>] [B<-N кількість_одночасних_запитів>] [B<-t tos>]

source: [B<-l flow_label>] [B<-w waittimes>] [B<-z sendwait>] [B<-UL>] [B<-D>]
uk: [B<-l мітка_потоку>] [B<-w час_очікування>] [B<-z очікування_надсилання>] [B<-UL>] [B<-D>]

source: [B<-P proto>] [B<--sport=port>] [B<-M method>] [B<-O mod_options>]
uk: [B<-P протокол>] [B<--sport=порт>] [B<-M метод>] [B<-O параметри_модуля>]

source: B<host> [B<packet_len>]
uk: B<host> [B<довжина_пакета>]

source: B<traceroute6> [I<options>]
uk: B<traceroute6> [I<параметри>]

source: DESCRIPTION
uk: ОПИС

source: I<traceroute> tracks the route packets taken from an IP network on their way to a given host. It utilizes the IP protocol's time to live (TTL) field and attempts to elicit an ICMP TIME_EXCEEDED response from each gateway along the path to the host.
uk: I<traceroute> створює трасування пакетів маршрутизації на основі даних IP-мережі на шляху до вказаного вузла. Програма використовує поле строку дії (TTL) IP-протоколу та намагається отримати відповідь TIME_EXCEEDED ICMP від кожного шлюзу на шляху до вузла.

source: I<traceroute6> is equivalent to I<traceroute> B<-6>
uk: I<traceroute6> є тим самим, що і I<traceroute> B<-6>

source: The only required parameter is the name or IP address of the destination B<host>\ . The optional B<packet_len>`gth is the total size of the probing packet (default 60 bytes for IPv4 and 80 for IPv6). The specified size can be ignored in some situations or increased up to a minimal value.
uk: Єдиним обов'язковим параметром є назва або IP-адреса B<вузла> призначення\ . Необов'язкова B<довжина_пакета> визначає загальний розмір зондувального пакета (типовим є 60 байтів для IPv4 і 80 для IPv6). Вказаний розмір може бути у певних випадках проігноровано або збільшено до мінімального значення.

source: This program attempts to trace the route an IP packet would follow to some internet host by launching probe packets with a small ttl (time to live) then listening for an ICMP "time exceeded" reply from a gateway. We start our probes with a ttl of one and increase by one until we get an ICMP "port unreachable" (or TCP reset), which means we got to the "host", or hit a max (which defaults to 30 hops). Three probes (by default) are sent at each ttl setting and a line is printed showing the ttl, address of the gateway and round trip time of each probe. The address can be followed by additional information when requested. If the probe answers come from different gateways, the address of each responding system will be printed. If there is no response within a certain timeout, an "*" (asterisk) is printed for that probe.
uk: Ця програма намагається простежити маршрут, яким пакет IP проходить до вказаного вузла інтернету, надсилаючи зондувальні пакет із малим ttl (строком дії), а потім отримуючи відповідь «перевищено час» ICMP від шлюзу. Програма починає зондування із одиничного значення ttl і збільшує значення на одиницю, аж доки не буде отримано відповіді «порт недосяжний» ICMP (або скидання TCP), що означатиме, що досягнуто «вузла», або перевищення обмежень (таким типовим обмеженням є 30 переходів). Для кожного значення ttl буде надіслано три сигнали зондування (типово), і програма виведення дані щодо ttl, адреси шлюзу і часу проходження маршруту для кожного зондування. Разом із адресою може бути виведено, якщо надійшов запит, додаткові відомості. Якщо відповіді на зондування надходять з різних шлюзів, буде виведено адресу для кожної системи, яка надала відповідь. Якщо протягом певного часу очікування не буде отримано відповіді, для відповідного зондування буде вказано «*» (зірочку) у списку.

source: After the trip time, some additional annotation can be printed: B<!H>, B<!N>, or B<!P> (host, network or protocol unreachable), B<!S> (source route failed), B<!F> (fragmentation needed), B<!X> (communication administratively prohibited), B<!V> (host precedence violation), B<!C> (precedence cutoff in effect), or B<!E<lt>numE<gt>> (ICMP unreachable code E<lt>numE<gt>). If almost all the probes result in some kind of unreachable, traceroute will give up and exit.
uk: Після часу проходження може бути виведено деякі додаткові анотації: B<!H>, B<!N> або B<!P> (не вдалося досягти вузла, мережі або протоколу), B<!S> (помилка маршруту до джерела), B<!F> (потрібна фрагментація), B<!X> (обмін даними адміністративно заборонено), B<!V> (порушення пріоритетності вузлів), B<!C> (задіяно обрізання за пріоритетністю) або B<!E<lt>числоE<gt>> (код недоступності ICMP E<lt>числоE<gt>). Якщо майже усі зондування призводять до певного типу недоступності, traceroute припинить спроби і завершить роботу.

source: We don't want the destination host to process the UDP probe packets, so the destination port is set to an unlikely value (you can change it with the B<-p> flag). There is no such a problem for ICMP or TCP tracerouting (for TCP we use half-open technique, which prevents our probes to be seen by applications on the destination host).
uk: Нам не потрібно, щоб вузол призначення обробляв пакети зондування UDP, тому для порту призначення буде встановлено нереалістичне значення (ви можете змінити його за допомогою прапорця B<-p>). Такої проблеми немає при трасуванні маршрутизації ICMP або TCP (для TCP використано напів відкриту методику, яка запобігає передаванню наших зондувань програмам на вузлі призначення).

source: In the modern network environment the traditional traceroute methods can not be always applicable, because of widespread use of firewalls. Such firewalls filter the "unlikely" UDP ports, or even ICMP echoes. To solve this, some additional tracerouting methods are implemented (including tcp), see B<LIST OF AVAILABLE METHODS> below. Such methods try to use particular protocol and source/destination port, in order to bypass firewalls (to be seen by firewalls just as a start of allowed type of a network session).
uk: У сучасних мережевих середовищах не завжди можна застосувати традиційні методи трасування маршрутів через поширене використання брандмауерів. Брандмауери фільтрують «малоймовірні» порти UDP або навіть луна-пакети ICMP. Щоб вирішити цю проблему, реалізовано деякі додаткові методи трасування маршрутів (зокрема tcp), див. B<СПИСОК ДОСТУПНИХ МЕТОДІВ> нижче. У таких методах використовують певний протокол і порт джерела/призначення з метою обійти фільтрування брандмауерами (брандмауери розглядають такі пакети, як початок дозволеного типу сеансу з'єднання у мережі).

source: OPTIONS
uk: ПАРАМЕТРИ

source: Print help info and exit.
uk: Вивести довідкові відомості і завершити роботу.

source: Explicitly force IPv4 or IPv6 tracerouting. By default, the program will try to resolve the name given, and choose the appropriate protocol automatically. If resolving a host name returns both IPv4 and IPv6 addresses, I<traceroute> will use IPv4.
uk: Явним чином наказати програмі використати трасування маршруту IPv4 або IPv6. Типово, програма спробує обробити вказану назву вузла і вибрати відповідний протокол автоматично. Якщо під час спроби визначення буде повернуто одразу адреси IPv4 і IPv6, I<traceroute> використає IPv4.

source: Use ICMP ECHO for probes
uk: Використовувати для зондування ECHO ICMP

source: Use TCP SYN for probes
uk: Використовувати для зондування SYN TCP

source: Enable socket level debugging (when the Linux kernel supports it)
uk: Увімкнути діагностику на рівні сокетів (якщо у ядрі Linux передбачено її підтримку)

source: Do not fragment probe packets. (For IPv4 it also sets DF bit, which tells intermediate routers not to fragment remotely as well).
uk: Не розбивати пакети зондування на фрагменти. (Для IPv4 це також встановлює біт DF, який повідомляє проміжним маршрутизаторам, що їм також не слід розбивати зондування на фрагменти).

source: Varying the size of the probing packet by the B<packet_len> command line parameter, you can manually obtain information about the MTU of individual network hops. The B<--mtu> option (see below) tries to do this automatically.
uk: Змінюючи розмір пакета зондування за допомогою параметра рядка команди B<довжина_пакета>, ви можете вручну отримати дані щодо MTU окремих переходів у мережі. Якщо скористатися параметром B<--mtu> (див. нижче), програма спробує визначити розмір автоматично.

source: Note, that non-fragmented features (like B<-F> or B<--mtu>) work properly since the Linux kernel 2.6.22 only. Before that version, IPv6 was always fragmented, IPv4 could use the once the discovered final mtu only (from the route cache), which can be less than the actual mtu of a device.
uk: Зауважте, що можливості вимикання фрагментації (подібні до B<-F> або B<--mtu>) належним чином працюють, лише починаючи з ядра Linux 2.6.22. До цієї версії IPv6 завжди був фрагментованим, IPv4 міг використовувати дефрагментацію лише у межах визначеного остаточного mtu (з кешу маршрутизації), який може бути меншим за справжній mtu пристрою.

source: B<-f>I< first_ttl>B<, --first=>I<first_ttl>
uk: B<-f>I< перший_ttl>B<, --first=>I<перший_ttl>

source: Specifies with what TTL to start. Defaults to 1.
uk: Вказує, з якого TTL слід почати. Типовим є значення 1.

source: B<-g>I< gateway>B<, --gateway=>I<gateway>
uk: B<-g>I< шлюз>B<, --gateway=>I<шлюз>

source: Tells traceroute to add an IP source routing option to the outgoing packet that tells the network to route the packet through the specified I<gateway> (most routers have disabled source routing for security reasons). In general, several I<gateway>'s is allowed (comma separated). For IPv6, the form of I<num>B<,>I<addr>B<,>I<addr...> is allowed, where I<num> is a route header type (default is type 2). Note the type 0 route header is now deprecated (rfc5095).
uk: Наказує traceroute додавати параметр маршрутизації джерела IP до вихідного пакета, який наказує мережі провести пакет через вказаний I<шлюз> (на більшості маршрутизаторів маршрутизацію джерела вимкнено з міркувань безпеки). Загалом, можна вказати декілька I<шлюзів> (з відокремленням записів комами). Для IPv6 можна скористатися формою I<число>B<,>I<адреса>B<,>I<адреса...>, де I<число> — тип заголовка маршруту (типовим типом є 2). Зауважте, що тип заголовка маршруту 0 зараз вважається застарілим (rfc5095).

source: B<-i>I< interface>B<, --interface=>I<interface>
uk: B<-i>I< інтерфейс>B<, --interface=>I<інтерфейс>

source: Specifies the interface through which I<traceroute> should send packets. By default, the interface is selected according to the routing table.
uk: Вказує інтерфейс, яким I<traceroute> має надсилати пакети. Типово, інтерфейс буде вибрано відповідно до таблиці маршрутизації.

source: B<-m>I< max_ttl>B<, --max-hops=>I<max_ttl>
uk: B<-m>I< максимальний_ttl>B<, --max-hops=>I<максимальний_ttl>

source: Specifies the maximum number of hops (max time-to-live value) I<traceroute> will probe. The default is 30.
uk: Вказує максимальну кількість переходів (максимальне значення строку дії) під час зондування I<traceroute>. Типовим значенням є 30.

source: B<-N>I< squeries>B<, --sim-queries=>I<squeries>
uk: B<-N>I< кількість_одночасних_запитів>B<, --sim-queries=>I<кількість_одночасних_запитів>

source: Specifies the number of probe packets sent out simultaneously. Sending several probes concurrently can speed up I<traceroute> considerably. The default value is 16.
uk: Вказує кількість пакетів зондування, які буде надіслано одночасно. Одночасне надсилання декількох зондувань може значно пришвидшити роботу I<traceroute>. Типовим є значення 16.

source: Note that some routers and hosts can use ICMP rate throttling. In such a situation specifying too large number can lead to loss of some responses.
uk: Зауважте, що деякі маршрутизатори і вузли можуть використовувати дроселювання частоти ICMP. У такому випадку визначення надто великого числа може призвести до втрати деяких відповідей.

source: Do not try to map IP addresses to host names when displaying them.
uk: Не намагатися пов'язати IP-адреси із назвами вузлів при показі.

source: B<-p>I< port>B<, --port=>I<port>
uk: B<-p>I< порт>B<, --port=>I<порт>

source: For UDP tracing, specifies the destination port base I<traceroute> will use (the destination port number will be incremented by each probe).
uk: Для трасування UDP визначає базовий номер порту призначення, який використовуватиме I<traceroute> (номер порту збільшуватиметься з кожним зондуванням).

source: For ICMP tracing, specifies the initial ICMP sequence value (incremented by each probe too).
uk: Для трасування ICMP вказує початкове значення послідовності ICMP (також збільшується із кожним зондуванням).

source: For TCP and others specifies just the (constant) destination port to connect.
uk: Для TCP та інших методів вказує просто (сталий) порт призначення, з яким слід встановити з'єднання.

source: For IPv4, set the Type of Service (TOS) and Precedence value. Useful values are 16 (low delay) and 8 (high throughput). Note that in order to use some TOS precedence values, you have to be super user.
uk: Для IPv4 встановити тип служби (TOS) та значення пріоритетності. Придатними значеннями є 16 (низька затримка) і 8 (висока продуктивність). Зауважте, що щоб скористатися деякими значенням пріоритетності TOS, вам знадобляться права надкористувача.

source: For IPv6, set the Traffic Control value.
uk: Для IPv6 встановити значення керування передаванням.

source: B<-l>I< flow_label>B<, --flowlabel=>I<flow_label>
uk: B<-l>I< мітка_потоку>B<, --flowlabel=>I<мітка_потоку>

source: Use specified flow_label for IPv6 packets.
uk: Скористатися вказаною міткою_потоку для пакетів IPv6.

source: B<-w>I< max>[B<,>I<here>B<,>I<near>]B<, --wait=>I<max>[B<,>I<here>B<,>I<near>]
uk: B<-w>I< максимум>[B<,>I<тут>B<,>I<близько>]B<, --wait=>I<максимум>[B<,>I<тут>B<,>I<близько>]

source: Determines how long to wait for a response to a probe.
uk: Визначає, як довго слід чекати на відповідь при зондуванні.

source: There are three (in general) float values separated by a comma (or a slash). I<Max> specifies the maximum time (in seconds, default 5.0) to wait, in any case.
uk: Передбачено три (загалом) значення з рухомою крапкою, відокремлені комами (або символом похилої риски). Значення I<максимум> визначає максимальний час (у секундах, типове значення 5.0), протягом якого слід чекати за будь-яких умов.

source: Traditional traceroute implementation always waited whole I<max> seconds for any probe. But if we already have some replies from the B<same> hop, or even from some B<next> hop, we can use the round trip time of such a reply as a hint to determine the actual reasonable amount of time to wait.
uk: Традиційна реалізація traceroute завжди очікує повні I<максимум> секунд для будь-якого зондування. Але якщо у нас вже є якісь відповіді з переходу до B<того самого> вузла або навіть від якогось переходу до B<наступного> вузла, можна скористатися часом проходження такої відповіді як орієнтиром для визначення справжнього прийнятного проміжку часу очікування.

source: The optional I<here> (default 3.0) specifies a factor to multiply the round trip time of an already received response from the B<same> hop. The resulting value is used as a timeout for the probe, instead of (but no more than) I<max>. The optional I<near> (default 10.0) specifies a similar factor for a response from some B<next> hop. (The time of the first found result is used in both cases).
uk: Необов'язкове значення I<тут> (типове значення 3.0) вказує коефіцієнт для множення часу проходження вже отриманої відповіді з переходу до B<того самого> вузла. Значення-результат буде використано як час очікування на зондування, замість (але не більше) за I<максимум>. Необов'язкове значення I<близько> (типово, 10.0) вказує подібний коефіцієнт для відповіді від якогось B<наступного> переходу. (Час для першого знайдено результату буде використано в обох випадках.)

source: First, we look for the B<same> hop (of the probe which will be printed first from now). If nothing found, then look for some B<next> hop. If nothing found, use I<max>. If I<here> and/or I<near> have zero values, the corresponding computation is skipped.
uk: Спершу, ми шукатимемо перехід до B<того самого> вузла (зондування, яке буде виведено першим). Якщо нічого не буде знайдено, шукати якийсь B<наступний> перехід. Якщо нічого не буде знайдено, скористатися I<максимумом>. Якщо значеннями I<тут> і/або I<близько> є нульовими, відповідне обчислення буде пропущено.

source: I<Here> and I<near> are always set to zero if only I<max> is specified (for compatibility with previous versions).
uk: Для I<тут> і I<близько> буде завжди використано нульові значення, якщо вказано лише I<максимум> (для сумісності із попередніми версіями).

source: B<-q>I< nqueries>B<, --queries=>I<nqueries>
uk: B<-q>I< кількість_запитів>B<, --queries=>I<кількість_запитів>

source: Sets the number of probe packets per hop. The default is 3.
uk: Встановлює кількість пакетів зондування на один стрибок. Типовим значенням є 3.

source: Bypass the normal routing tables and send directly to a host on an attached network. If the host is not on a directly-attached network, an error is returned. This option can be used to ping a local host through an interface that has no route through it.
uk: Обійти звичайні таблиці маршрутизації і надіслати дані безпосередньо до вузла в долученій мережі. Якщо вузол не перебуває у безпосередньо долученій мережі буде повернуто повідомлення про помилку. Цим параметром можна скористатися для зондування локального вузла через інтерфейс, який не має маршруту через нього.

source: B<-s>I< source_addr>B<, --source=>I<source_addr>
uk: B<-s>I< адреса_джерела>B<, --source=>I<адреса_джерела>

source: Chooses an alternative source address. Note that you must select the address of one of the interfaces. By default, the address of the outgoing interface is used.
uk: Вибирає альтернативну адресу джерела. Зауважте, що вам слід вибрати адресу одного з інтерфейсів. Типово, буде використано адресу вихідного інтерфейсу.

source: B<-z>I< sendwait>B<, --sendwait=>I<sendwait>
uk: B<-z>I< очікування_надсилання>B<, --sendwait=>I<очікування_надсилання>

source: Minimal time interval between probes (default 0). If the value is more than 10, then it specifies a number in milliseconds, else it is a number of seconds (float point values allowed too). Useful when some routers use rate-limit for ICMP messages.
uk: Мінімальний проміжок часу між зондуваннями (типовим є 0). Якщо вказано значення, що перевищує 10, його буде оброблено як мілісекунди, інакше, воно вважатиметься значенням у секундах (можна використовувати значення із рухомою крапкою). Параметр є корисним для деяких маршрутизаторів, у яких використано обмеження на частоту для повідомлень ICMP.

source: Show ICMP extensions (rfc4884). The general form is I<CLASS>B</>I<TYPE>B<:> followed by a hexadecimal dump. The MPLS (rfc4950) is shown parsed, in a form: B<MPLS:L=>I<label>B<,E=>I<exp_use>B<,S=>I<stack_bottom>B<,T=>I<TTL> (more objects separated by B</> ).
uk: Показати розширення ICMP (rfc4884). Загальна форма є такою: I<КЛАС>B</>I<ТИП>B<:> — а далі, шістнадцятковий дамп. Буде виведено оброблене значення MPLS (rfc4950) у такій формі: B<MPLS:L=>I<label>B<,E=>I<exp_use>B<,S=>I<stack_bottom>B<,T=>I<TTL> (додаткові об'єкти буде відокремлено B</> ).

source: Perform AS path lookups in routing registries and print results directly after the corresponding addresses.
uk: Виконувати пошуки шляхів AS у регістрах маршрутизації і вивести результати безпосередньо після відповідних адрес.

source: Print the version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: There are additional options intended for advanced usage (such as alternate trace methods etc.):
uk: Передбачено додаткові параметри для розширеного користування (зокрема альтернативних методів трасування тощо):

source: B<--sport>=I<port>
uk: B<--sport>=I<порт>

source: Chooses the source port to use. Implies B<-N\ 1>\ -w\ 5 . Normally source ports (if applicable) are chosen by the system.
uk: Вибирає порт джерела, яким слід скористатися. Неявним чином встановлює B<-N\ 1>\ -w\ 5 . Зазвичай, порти джерела (якщо такі використовують) вибирає операційна система.

source: B<--fwmark>=I<mark>
uk: B<--fwmark>=I<позначка>

source: Set the firewall mark for outgoing packets (since the Linux kernel 2.6.25).
uk: Встановити позначку брандмауера для вихідних пакетів (з версії ядра Linux 2.6.25).

source: B<-M>I< method>B<, --module=>I<name>
uk: B<-M>I< метод>B<, --module=>I<назва>

source: Use specified method for traceroute operations. Default traditional udp method has name I<default>, icmp (B<-I>) and tcp (B<-T>) have names I<icmp> and I<tcp> respectively.
uk: Скористатися вказаним методом для дій traceroute. Типовим є традиційний метод udp із назвою I<default>, а методи icmp (B<-I>) і tcp (B<-T>) мають назви I<icmp> і I<tcp>, відповідно.

source: Method-specific options can be passed by B<-O\ >. Most methods have their simple shortcuts, (B<-I >meansB< -M icmp>, etc).
uk: Специфічні для методу параметри можна передати за допомогою B<-O\ >. У більшості методів є прості скорочення (B<-I> означає B<-M icmp> тощо).

source: B<-O>I< option>B<, --options=>I<options>
uk: B<-O>I< параметр>B<, --options=>I<параметри>

source: Specifies some method-specific option. Several options are separated by comma (or use several B<-O> on cmdline). Each method may have its own specific options, or many not have them at all. To print information about available options, use B<-O\ help>.
uk: Вказує певний специфічний для методу параметр. Декілька параметрів буде відокремлено комами (або можна використати декілька B<-O> у рядку команди). Кожен метод може мати власні специфічні параметри, а багато методів не мають їх взагалі. Щоб вивести відомості щодо доступних параметрів, скористайтеся параметром B<-O\ help>.

source: Use UDP to particular destination port for tracerouting (instead of increasing the port per each probe). Default port is 53 (dns).
uk: Використати UDP для певного порту призначення для трасування маршруту (замість збільшення номеру порту з кожним новим зондуванням). Типовим є порт 53 (dns).

source: Use UDPLITE for tracerouting (default port is 53).
uk: Використати UDPLITE для трасування маршруту (типовим є порт 53).

source: Use DCCP Requests for probes.
uk: Використовувати для зондування запити DCCP.

source: B<-P>I< protocol>B<, --protocol=>I<protocol>
uk: B<-P>I< протокол>B<, --protocol=>I<протокол>

source: Use raw packet of specified protocol for tracerouting. Default protocol is 253 (rfc3692).
uk: Використати простий пакет вказаного протоколу для трасування маршруту. Типовим протоколом є 253 (rfc3692).

source: Discover MTU along the path being traced. Implies B<-F\ -N\ 1>. New I<mtu> is printed once in a form of B<F=>I<NUM> at the first probe of a hop which requires such I<mtu> to be reached. (Actually, the correspond "frag needed" icmp message normally is sent by the previous hop).
uk: Визначити MTU уздовж трасованого шляху. Неявно використовує B<-F\ -N\ 1>. Нове I<mtu> буде виведено один раз у формі B<F=>I<ЧИСЛО> при першому зондуванні переходу, який потребує досягнення такого I<mtu>. (Насправді, відповідне повідомлення ICMP «є потреба» буде надіслано під час попереднього переходу.)
