Repository: sebras/manpages-l10n
Catalog: po/*/man8/traceroute.8.po
Languages: uk

source: Note, that some routers might cache once the seen information on a fragmentation. Thus you can receive the final mtu from a closer hop. Try to specify an unusual I<tos> by B<-t> , this can help for one attempt (then it can be cached there as well).
uk: Зауважте, що деякі маршрутизатори можуть кешувати значення показаних відомостей щодо фрагментації. Таким чином, ви можете отримати остаточне значення mtu з ближчого переходу. Спробуйте вказати незвичне I<tos> за допомогою B<-t> — це може допомогти на одну спробу (потім дані може бути знову кешовано).

source: See B<-F> option for more info.
uk: Див. параметр B<-F>, щоб дізнатися більше.

source: Print the number of backward hops when it seems different with the forward direction. This number is guessed in assumption that remote hops send reply packets with initial ttl set to either 64, or 128 or 255 (which seems a common practice). It is printed as a negate value in a form of '-NUM' .
uk: Вивести кількість зворотних переходів, коли, здається, вона відрізняється від переходів у прямому напрямку. Це число буде визначено у припущенні, що віддалені переходи надсилають пакети відповідей із встановленим початковим ttl 64, 128 або 255 (здається, це типова ситуація). Буде виведено як від'ємне значення у форматі «-ЧИСЛО».

source: LIST OF AVAILABLE METHODS
uk: СПИСОК ДОСТУПНИХ МЕТОДІВ

source: In general, a particular traceroute method may have to be chosen by B<-M\ name>, but most of the methods have their simple cmdline switches (you can see them after the method name, if present).
uk: Загалом, певний метод трасування маршруту можна вибрати за допомогою B<-M\ назва>, але для більшості методів передбачено прості перемикачі командного рядка (ви можете побачити їх після назви методу, якщо така є).

source: The traditional, ancient method of tracerouting. Used by default.
uk: Традиційний давній метод трасування маршруту. Є типовим.

source: Probe packets are udp datagrams with so-called "unlikely" destination ports. The "unlikely" port of the first probe is 33434, then for each next probe it is incremented by one. Since the ports are expected to be unused, the destination host normally returns "icmp unreach port" as a final response. (Nobody knows what happens when some application listens for such ports, though).
uk: Пакети зондування є датаграмами udp із так званими «малоймовірними» портами призначення. «Малоймовірний» порт першого зондування — порт 33434. Далі, номер порту зростатиме на одиницю із кожним наступним зондуванням. Оскільки такі порти, зазвичай, не використовують, вузол призначення, зазвичай, повертає, як остаточну відповідь, «icmp не досягла порту». (Втім, нікому не відомо, що трапиться, якщо якась програма очікує на дані на цьому порту.)

source: This method is allowed for unprivileged users.
uk: Цей метод можуть використовувати непривілейовані користувачі.

source: Most usual method for now, which uses icmp echo packets for probes.
uk: Найпоширеніший метод у сучасних умовах. Для зондування буде використано луна-пакети icmp.

source: If you can ping(8) the destination host, icmp tracerouting is applicable as well.
uk: Якщо ви можете скористатися ping(8) для вузла призначення, можна буде користуватися і трасуванням маршруту icmp.

source: This method may be allowed for unprivileged users since the kernel 3.0 (IPv4, for IPv6 since 3.11), which supports new I<dgram icmp> (or "I<ping>") sockets. To allow such sockets, sysadmin should provide I<net/ipv4/ping_group_range> sysctl range to match any group of the user.
uk: Цим методом можна скористатися для непривілейованих користувачів з випуску ядра 3.0 (IPv4, для IPv6 з 3.11), де передбачено підтримку нових сокетів I<dgram icmp> (або «I<ping>»). Щоб уможливити використання таких сокетів, адміністратор має зробити так, щоб діапазон sysctl I<net/ipv4/ping_group_range> відповідав будь-якій з груп користувача.

source: Options:
uk: Параметри:

source: Use only raw sockets (the traditional way).
uk: Використовувати лише сокети без обробки (традиційний спосіб).

source: This way is tried first by default (for compatibility reasons), then new dgram icmp sockets as fallback.
uk: Цей спосіб буде типово використано першим (з міркувань сумісності), потім буде використано нові датаграми сокетів icmp, як резервні.

source: Use only dgram icmp sockets.
uk: Використовувати лише датаграми сокетів icmp.

source: Well-known modern method, intended to bypass firewalls.
uk: Відомий сучасний метод, призначено для обходу брандмауерів.

source: Uses the constant destination port (default is 80, http).
uk: Використовувати сталий порт призначення (типовим є 80, http).

source: If some filters are present in the network path, then most probably any "unlikely" udp ports (as for I<default> method) or even icmp echoes (as for I<icmp>) are filtered, and whole tracerouting will just stop at such a firewall. To bypass a network filter, we have to use only allowed protocol/port combinations. If we trace for some, say, mailserver, then more likely B<-T -p 25> can reach it, even when B<-I> can not.
uk: Якщо у шляху мережі є якісь фільтри, найімовірніше, буде відфільтровано усі «малоймовірні» порти (як для I<типового> методу) або навіть луна-повідомлення icmp (як для I<icmp>), і усе трасування маршруту буде зупинено на такому брандмауері. Щоб обійти фільтр мережі, нам слід використовувати лише дозволені комбінації протокол-порт. Якщо ми виконуємо трасування, скажімо, поштового сервера, ймовірно, його можна буде досягти за допомогою B<-T -p 25>, навіть якщо використання B<-I> не допомагає.

source: This method uses well-known "half-open technique", which prevents applications on the destination host from seeing our probes at all. Normally, a tcp syn is sent. For non-listened ports we receive tcp reset, and all is done. For active listening ports we receive tcp syn+ack, but answer by tcp reset (instead of expected tcp ack), this way the remote tcp session is dropped even without the application ever taking notice.
uk: У цьому методі використано добре відому «напів відкриту методику», яка заважає програма на вузлі призначення бачити наше зондування взагалі. Зазвичай, буде надіслано tcp syn. Для портів, на яких не чекають на з'єднання, ми отримаємо скидання tcp і дію буде завершено. Для активних портів ми отримаємо tcp syn+ack, але відповімо скиданням tcp (замість очікуваного tcp ack). У такий спосіб віддалений сеанс tcp буде скинуто, навіть без повідомлення про це програми, яка очікує на з'єднання.

source: There is a couple of options for I<tcp> method:
uk: Для методу I<tcp> передбачено двійко додаткових параметрів:

source: Sets specified tcp flags for probe packet, in any combination.
uk: Встановлює вказані прапорці tcp для пакета зондування, у будь-якій комбінації.

source: B<flags>=I<num>
uk: B<flags>=I<число>

source: Sets the flags field in the tcp header exactly to I<num>.
uk: Встановлює значення поля прапорців у заголовку tcp точно у значення I<число>.

source: Send syn packet with tcp flags ECE and CWR (for Explicit Congestion Notification, rfc3168).
uk: Надіслати пакет syn із прапорцями tcp ECE і CWR (для явного сповіщення про перевантаження, rfc3168).

source: Use the corresponding tcp header option in the outgoing probe packet.
uk: Використати відповідний параметр заголовка tcp у вихідному пакеті зондування.

source: Use current sysctl (I</proc/sys/net/*>) setting for the tcp header options above and B<ecn>. Always set by default, if nothing else specified.
uk: Використати поточні налаштування sysctl (I</proc/sys/net/*>) для параметрів заголовка tcp вище і B<ecn>. Завжди типово встановлено, якщо не вказано нічого іншого.

source: B<mss>=I<num>
uk: B<mss>=I<число>

source: Use value of I<num> for maxseg tcp header option (when B<syn>).
uk: Використати значення I<число> для параметра заголовка tcp maxseg (якщо B<syn>).

source: Print tcp flags of final tcp replies when the target host is reached. Allows to determine whether an application listens the port and other useful things.
uk: Вивести прапорці tcp завершальних відповідей tcp, якщо досягнуто вузла призначення. Надає змогу визначити, чи очікує на порту на дані якась програма, та отримати інші корисні дані.

source: Default options is B<syn,sysctl>.
uk: Типовими є параметри B<syn,sysctl>.

source: An initial implementation of tcp method, simple using connect(2) call, which does full tcp session opening. Not recommended for normal use, because a destination application is always affected (and can be confused).
uk: Початкова реалізація методу tcp, простий виклик connect(2), який виконує повне відкриття сеансу tcp. Не рекомендовано для звичайного користування, оскільки завжди впливає на роботу програми призначення (і може призвести до конфліктів).

source: Use udp datagram with constant destination port (default 53, dns).
uk: Використати датаграму udp зі сталим портом призначення (типовим є 53, dns).

source: Intended to bypass firewall as well.
uk: Призначено також для обходу брандмауера.

source: Note, that unlike in I<tcp> method, the correspond application on the destination host B<always> receive our probes (with random data), and most can easily be confused by them. Most cases it will not respond to our packets though, so we will never see the final hop in the trace. (Fortunately, it seems that at least dns servers replies with something angry).
uk: Зауважте, що на відміну від методу I<tcp>, відповідна програма на вузлі призначення B<завжди> отримуватиме ваші зондування (із випадковими даними), і більшість програм може бути заплутано цим. Втім, у більшості програм програма не відповість на пакети, отже, ми ніколи не побачимо завершального переходу у трасуванні. (На щастя, принаймні сервери dns відповідають чимось роздратованим.)

source: Use udplite datagram for probes (with constant destination port, default 53).
uk: Використати датаграму udplite для зондування (зі сталим портом призначення, типовим є 53).

source: B<coverage>=I<num>
uk: B<coverage>=I<число>

source: Set udplite send coverage to I<num>.
uk: Встановити для покриття надсилання udplite значення I<число>.

source: Use DCCP Request packets for probes (rfc4340).
uk: Використати для зондування пакети запитів DCCP (rfc4340).

source: This method uses the same "half-open technique" as used for TCP. The default destination port is 33434.
uk: У цьому методі використано ту саму «напів відкриту методику», яку використано для TCP. Типовим портом призначення є 33434.

source: B<service>=I<num>
uk: B<service>=I<число>

source: Set DCCP service code to I<num> (default is 1885957735).
uk: Встановити для коду служби DCCP значення I<число> (типовим є значення 1885957735).

source: raw \ \ \ \ -P proto
uk: raw \ \ \ \ -P протокол

source: Send raw packet of protocol I<proto>.
uk: Надіслати необроблений пакет протоколу I<протокол>.

source: No protocol-specific headers are used, just IP header only.
uk: Не буде використано ніяких специфічних для протоколу заголовків, лише заголовок IP.

source: Implies B<-N\ 1>\ -w\ 5 .
uk: Неявним чином встановлюється B<-N\ 1>\ -w\ 5 .

source: B<protocol>=I<proto>
uk: B<protocol>=I<протокол>

source: Use IP protocol I<proto> (default 253).
uk: Використати IP-протокол I<протокол> (типовим значенням є 253).

source: NOTES
uk: ПРИМІТКИ

source: To speed up work, normally several probes are sent simultaneously. On the other hand, it creates a "storm of packages", especially in the reply direction. Routers can throttle the rate of icmp responses, and some of replies can be lost. To avoid this, decrease the number of simultaneous probes, or even set it to 1 (like in initial traceroute implementation), i.e. B<-N 1>
uk: Щоб пришвидшити роботу, зазвичай, програма надсилає декілька сигналів зондування одночасно. З іншого боку, це створює «зливу пакетів», особливо у напрямку відповідей. Маршрутизатори можуть дроселювати частоту відповідей icmp, отже деякі з відповідей можуть загубитися. Щоб уникнути цього, знизьте кількість одночасних зондувань, або навіть встановіть значення 1 (як у початковій реалізації traceroute), тобто B<-N 1>

source: The final (target) host can drop some of the simultaneous probes, and might even answer only the latest ones. It can lead to extra "looks like expired" hops near the final hop. We use a smart algorithm to auto-detect such a situation, but if it cannot help in your case, just use B<-N 1> too.
uk: Завершальний вузол (ціль) може відкинути деякі з одночасних сигналів зондування і може навіть відповісти лише на останні з них. Це може призвести до зайвих переходів у стилі «здається прострочено» одразу перед завершальним переходом. Нами використано інтелектуальний алгоритм для автоматичного виявлення таких випадків, але якщо він не допомагає у вашому випадку, просто скористайтеся, знову ж таки, B<-N 1>.

source: For even greater stability you can slow down the program's work by B<-z> option, for example use B<-z 0.5> for half-second pause between probes.
uk: Для підвищення стабільності ви можете навіть уповільнити роботу програми за допомогою параметра B<-z>. Наприклад, можна скористатися B<-z 0.5> для встановлення паузи між зондуваннями у пів секунди.

source: To avoid an extra waiting, we use adaptive algorithm for timeouts (see B<-w> option for more info). It can lead to premature expiry (especially when response times differ at times) and printing "*" instead of a time. In such a case, switch this algorithm off, by specifying B<-w> with the desired timeout only (for example, B<-w 5>).
uk: Щоб уникнути зайвого очікування, ми скористалися адаптивним алгоритмом для часів очікування (див. параметр B<-w>, щоб дізнатися більше). Це може призвести до завчасного завершення строку дії пакета (особливо, якщо час відповіді часом відрізняється) і виведення «*» замість часу. У таких випадках вимкніть цей алгоритм за допомогою параметра B<-w> із бажаним значенням часу очікування (наприклад, B<-w 5>).

source: If some hops report nothing for every method, the last chance to obtain something is to use B<ping -R> command (IPv4, and for nearest 8 hops only).
uk: Якщо для деяких переходів жоден з методів не дає результатів, останнім варіантом отримати дані є використання команди B<ping -R> (IPv4 і лише для найближчих 8 переходів).

source: SEE ALSO
uk: ДИВ. ТАКОЖ
