Repository: sebras/manpages-l10n
Catalog: po/*/man8/tune2fs.8.po
Languages: pl

source: B<mke2fs -O journal_dev> I<external-journal>
pl: B<mke2fs -O journal_dev> I<zewnętrzny-dziennik>

source: Note that I<external-journal> must be formatted with the same block size as file systems which will be using it. In addition, while there is support for attaching multiple file systems to a single external journal, the Linux kernel and B<e2fsck>(8) do not currently support shared external journals yet.
pl: Proszę zauważyć, że I<zewnętrzny-dziennik> musi zostać sformatowany z tą samą wielkością bloku jak system plików, który będzie go używał. Dodatkowo, o ile obsługa dołączania wielu systemów plików do pojedynczego dziennika zewnętrznego jest obecna, jądro Linux i B<e2fsck>(8) nie obsługuje na razie dzielonych dzienników zewnętrznych.

source: Instead of specifying a device name directly, I<external-journal> can also be specified by either B<LABEL=>I<label> or B<UUID=>I<UUID> to locate the external journal by either the volume label or UUID stored in the ext2 superblock at the start of the journal. Use B<dumpe2fs>(8) to display a journal device's volume label and UUID. See also the B<-L> option of B<tune2fs>(8).
pl: Zamiast podawać nazwę urządzenia bezpośrednio, I<zewnętrzny-dziennik> może być określony przez B<LABEL=>I<etykieta> lub B<UUID=>I<UUID>, aby znaleźć zewnętrzny dziennik na podstawie etykiety woluminu lub UUID przechowywanego w superbloku ext2 na początku dziennika. Do wypisania etykiety i UUID urządzenia z dziennikiem można posłużyć się B<dumpe2fs>(8). Zobacz także opis opcji B<-L> programu B<tune2fs>(8).

source: Only one of the B<size> or B<device> options can be given for a file system.
pl: Dla danego systemu plików można podać tylko jedną z opcji B<size> lub B<device>.

source: List the contents of the file system superblock, including the current values of the parameters that can be set via this program.
pl: Wypisuje zawartość superbloku systemu plików, w tym aktualne wartości parametrów, które mogą zostać ustawione tym programem.

source: B<-L>I< volume-label>
pl: B<-L>I< etykieta-woluminu>

source: Set the volume label of the file system. Ext2 file system labels can be at most 16 characters long; if I<volume-label> is longer than 16 characters, B<tune2fs> will truncate it and print a warning. The volume label can be used by B<mount>(8), B<fsck>(8), and B</etc/fstab>(5) (and possibly others) by specifying B<LABEL=>I<volume-label> instead of a block special device name like B</dev/hda5>.
pl: Ustawia etykietę systemu plików. Etykiety systemu plików ext2 mogą zawierać co najwyżej 16 znaków; jeżeli I<etykieta> jest dłuższa niż 16 znaków, B<tune2fs> skróci ją i wypisze ostrzeżenie. Etykieta może być używana przez B<mount>(8), B<fsck>(8) i w B</etc/fstab>(5) (i pewnie też w innych sytuacjach) poprzez podanie B<LABEL=>I<etykieta-woluminu> zamiast nazwy urządzenia blokowego, jak np. B</dev/hda5>.

source: B<-m>I< reserved-blocks-percentage>
pl: B<-m>I< procent-zarezerwowanych-bloków>

source: Set the percentage of the file system which may only be allocated by privileged processes. Reserving some number of file system blocks for use by privileged processes is done to avoid file system fragmentation, and to allow system daemons, such as B<syslogd>(8), to continue to function correctly after non-privileged processes are prevented from writing to the file system. Normally, the default percentage of reserved blocks is 5%.
pl: Ustawia procent systemu plików, który może zostać zaalokowany jedynie przez procesy uprzywilejowane. Rezerwacja pewnej liczby bloków systemu plików do użytku przez procesy uprzywilejowane jest wykonywana w celu przeciwdziałania fragmentacji systemu plików i aby pozwolić na poprawne działanie demonom systemowym, takim jak B<syslogd>(8), w sytuacji, gdy procesy nieuprzywilejowane nie mogą zapisać na system plików. Domyślny procent zarezerwowanych bloków wynosi zwykle 5%.

source: B<-M>I< last-mounted-directory>
pl: B<-M>I< ostatnio-montowany-katalog>

source: Set the last-mounted directory for the file system.
pl: Ustawia katalog, w którym system plików był ostatnio zamontowany.

source: B<-o> [^]I<mount-option>[,...]
pl: B<-o> [B<^>]I<opcja-montowania>[B<,>...]

source: Set or clear the indicated default mount options in the file system. Default mount options can be overridden by mount options specified either in B</etc/fstab>(5) or on the command line arguments to B<mount>(8). Older kernels may not support this feature; in particular, kernels which predate 2.4.20 will almost certainly ignore the default mount options field in the superblock.
pl: Ustawia lub usuwa wskazane opcje montowania w systemie plików. Domyślne opcje montowania mogą zostać nadpisane przez opcje określone albo w B</etc/fstab>(5), albo przez argumenty linii poleceń przekazane do B<mount>(8). Starsze jądra mogą nie obsługiwać tej cechy; w szczególności jądra starsze od 2.4.20 najprawdopodobniej zignorują pole domyślnych opcji w superbloku.

source: More than one mount option can be cleared or set by separating features with commas. Mount options prefixed with a caret character ('^') will be cleared in the file system's superblock; mount options without a prefix character or prefixed with a plus character ('+') will be added to the file system.
pl: Można podać więcej niż jedną opcję montowania do usunięcia lub ustawienia rozdzielając je przecinkami. Opcje montowania poprzedzone znakiem karety ("^") będą usuwane w superbloku systemu plików; opcje bez podanego przedrostka lub poprzedzone znakiem plusa ("+") będą dodane do systemu plików.

source: The following mount options can be set or cleared using B<tune2fs>:
pl: Następujące opcje montowania mogą być ustawione lub wyczyszczone za pomocą B<tune2fs>:

source: Enable debugging code for this file system.
pl: Włącza tryb debugowania na tym systemie plików.

source: Emulate BSD behavior when creating new files: they will take the group-id of the directory in which they were created. The standard System V behavior is the default, where newly created files take on the fsgid of the current process, unless the directory has the setgid bit set, in which case it takes the gid from the parent directory, and also gets the setgid bit set if it is a directory itself.
pl: Emuluje zachowanie BSD przy tworzeniu nowych plików: będą one przyjmowały identyfikator grupy katalogu, w którym zostały utworzone. Domyślne jest standardowe zachowanie Systemu V, polegające na tym, że nowo tworzone pliki przyjmują fsgid bieżącego procesu, chyba że katalog ma ustawiony bit setgid, w którym to przypadku przyjmuje gid z katalogu nadrzędnego i także ustawia bit setgid, jeżeli nowo utworzonym plikiem jest katalog.

source: Enable user-specified extended attributes.
pl: Włącza rozszerzone atrybuty podane przez użytkownika.

source: Enable Posix Access Control Lists.
pl: Włącza listy kontroli dostępu POSIX (Posix Access Control Lists).

source: Disables 32-bit UIDs and GIDs. This is for interoperability with older kernels which only store and expect 16-bit values.
pl: Wyłącza 32-bitowe UID-y i GID-y. Umożliwia to współdziałanie ze starszymi jądrami, które zachowują wartości 16-bitowe i ich oczekują.

source: When the file system is mounted with journaling enabled, all data (not just metadata) is committed into the journal prior to being written into the main file system.
pl: Kiedy system plików jest zamontowany z włączonym dziennikiem, wszystkie dane (nie tylko metadane) są zapisywane do dziennika przed zapisaniem ich go systemu plików.

source: When the file system is mounted with journaling enabled, all data is forced directly out to the main file system prior to its metadata being committed to the journal.
pl: Kiedy system plików jest zamontowany z włączonym dziennikiem, wymuszane jest zapisywanie danych bezpośrednio do systemu plików przed zapisaniem ich metadanych do dziennika.

source: When the file system is mounted with journaling enabled, data may be written into the main file system after its metadata has been committed to the journal. This may increase throughput, however, it may allow old data to appear in files after a crash and journal recovery.
pl: Kiedy system plików jest zamontowany z włączonym dziennikiem, dane mogą być zapisane do systemu plików, po tym jak ich metadane zostały zapisane do dziennika. Może to zwiększyć przepustowość, jednakże może to spowodować, że w plikach pojawią się stare dane po załamaniu systemu i odtworzeniu dziennika.

source: The file system will be mounted with barrier operations in the journal disabled. (This option is currently only supported by the ext4 file system driver in 2.6.35+ kernels.)
pl: System plików będzie zamontowany z wyłączonymi operacjami barier w dzienniku (opcja jest obsługiwana obecnie jedynie przez sterownik systemu plików ext4 w jądrach 2.6.35 i nowszych).

source: The file system will be mounted with the block_validity option enabled, which causes extra checks to be performed after reading or writing from the file system. This prevents corrupted metadata blocks from causing file system damage by overwriting parts of the inode table or block group descriptors. This comes at the cost of increased memory and CPU overhead, so it is enabled only for debugging purposes. (This option is currently only supported by the ext4 file system driver in 2.6.35+ kernels.)
pl: System plików zostanie zamontowany z włączoną opcją block_validity, która sprawia, że po odczycie lub zapisie do systemu plików zostaną wykonane dodatkowe sprawdzenia. Zapobiega się w ten sposób uszkodzeniu systemu plików przez naruszone bloki metadanych, w wyniku nadpisania części tabeli i-węzłów lub deskryptorów grupy bloków. Kosztem jest zwiększone użycie pamięci i procesora, więc służy to tylko debugowaniu (opcja jest obsługiwana obecnie jedynie przez sterownik systemu plików ext4, w jądrach 2.6.35 i nowszych).

source: The file system will be mounted with the discard mount option. This will cause the file system driver to attempt to use the trim/discard feature of some storage devices (such as SSD's and thin-provisioned drives available in some enterprise storage arrays) to inform the storage device that blocks belonging to deleted files can be reused for other purposes. (This option is currently only supported by the ext4 file system driver in 2.6.35+ kernels.)
pl: System plików zostanie zamontowany z opcją montowania discard. W ten sposób sterownik systemu plików będzie starał się używać funkcji trim/discard niektórych urządzeń (np. SSD lub dysków dynamicznie alokowanych, obecnych w niektórych zaawansowanych macierzach dyskowych) do poinformowania urządzenia dyskowego o możliwości ponownego użycia do innych celów, bloków należących do usuniętych plików (opcja jest obsługiwana obecnie jedynie przez sterownik systemu plików ext4, w jądrach 2.6.35 i nowszych).

source: The file system will be mounted with the nodelalloc mount option. This will disable the delayed allocation feature. (This option is currently only supported by the ext4 file system driver in 2.6.35+ kernels.)
pl: System plików zostanie zamontowany z opcją nodelalloc. W ten sposób wyłączona zostanie funkcja odłożonego alokowania (opcja jest obsługiwana obecnie jedynie przez sterownik systemu plików ext4, w jądrach 2.6.35 i nowszych).

source: B<-O> [^]I<feature>[,...]
pl: B<-O> [B<^>]I<cecha>[B<,>...]

source: Set or clear the indicated file system features (options) in the file system. More than one file system feature can be cleared or set by separating features with commas. File System features prefixed with a caret character ('^') will be cleared in the file system's superblock; file system features without a prefix character or prefixed with a plus character ('+') will be added to the file system. For a detailed description of the file system features, please see the man page B<ext4>(5).
pl: Włącza lub wyłącza wskazane cechy (opcje) systemu plików. Można włączyć bądź wyłączyć wiele cech jednocześnie. Muszą one wtedy być oddzielone przecinkami. Cechy poprzedzone przedrostkiem karetki ("^") będą wyłączone w superbloku; cechy bez przedrostka lub z przedrostkiem plus ("+") zostaną dodane do systemu plików. Szczegółowy opis funkcji systemu plików znajduje się w podręczniku B<ext4>(5).

source: The following file system features can be set or cleared using B<tune2fs>:
pl: Następujące cechy mogą być zmienione przez B<tune2fs>:

source: Enable the file system to be larger than 2^32 blocks.
pl: Umożliwia utworzenie systemu plików większego niż 2^32 bloków.

source: Enable support for file system level casefolding. B<Tune2fs> currently only supports setting this file system feature.
pl: Włącza obsługę zmiany wielkości znaków na małe litery na poziomie systemu plików. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Use hashed b-trees to speed up lookups for large directories.
pl: Używa haszowanych B-drzew, aby przyspieszyć przeszukiwanie dużych katalogów.

source: Allow more than 65000 subdirectories per directory.
pl: Pozwala na więcej niż 65 tysięcy podkatalogów w katalogu.

source: Allow the value of each extended attribute to be placed in the data blocks of a separate inode if necessary, increasing the limit on the size and number of extended attributes per file. B<Tune2fs> currently only supports setting this file system feature.
pl: Pozwala na przechowywania wartości każdego z rozszerzonych atrybutów w blokach danych oddzielnego i-węzła, jeśli jest to konieczne, zwiększając rozmiar plików i liczbę rozszerzonych atrybutów na plik. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Enable support for file system level encryption. B<Tune2fs> currently only supports setting this file system feature.
pl: Włącza obsługę szyfrowania na poziomie systemu plików. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Enable the use of extent trees to store the location of data blocks in inodes. B<Tune2fs> currently only supports setting this file system feature.
pl: Włącza ekstenty drzew do przechowywania położenia bloków danych w i-węzłach. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Enable the extended inode fields used by ext4.
pl: Włącza rozszerzone pola i-węzłów używane przez ext4.

source: Store file type information in directory entries.
pl: Przechowywanie informacji na temat typu pliku we wpisach do katalogów.

source: Allow bitmaps and inode tables for a block group to be placed anywhere on the storage media. B<Tune2fs> will not reorganize the location of the inode tables and allocation bitmaps, as B<mke2fs>(8) will do when it creates a freshly formatted file system with B<flex_bg> enabled.
pl: Pozwala mapom bitów i tabelom i-węzłów na przechowywanie grup bloków w dowolnym miejscu nośnika. B<Tune2fs> nie będzie reorganizował położenia tablic i-węzłów ani map bitowych alokowania w sposób, jaki B<mke2fs>(8) zrobiłby to podczas tworzenia nowo formatowanego systemu plików z włączoną opcją B<flex_bg>.

source: Use a journal to ensure file system consistency even across unclean shutdowns. Setting the file system feature is equivalent to using the B<-j> option.
pl: Używa dziennika w celu zapewnienia spójności systemu plików nawet pomiędzy nieprawidłowymi zamknięciami systemu. Ustawienie tej funkcji systemu plików jest odpowiednikiem użycia opcji B<-j>.

source: Enable fast commit journaling feature to improve fsync latency.
pl: Włącza funkcję szybkiego zatwierdzania dziennika, poprawiającą opóźnienia fsync.

source: Increase the limit on the number of files per directory. B<Tune2fs> currently only supports setting this file system feature.
pl: Zwiększa limit liczby plików na katalog. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Support files larger than 2 terabytes in size.
pl: Obsługuje pliki o rozmiarze większym niż 2 TB.

source: File System can contain files that are greater than 2GB.
pl: System plików może zawierać pliki większe niż 2 GB.

source: Store a checksum to protect the contents in each metadata block.
pl: Przechowuje sumę kontrolną w celu zabezpieczenia zawartości w każdym bloku metadanych.

source: Allow the file system to store the metadata checksum seed in the superblock, enabling the administrator to change the UUID of a file system using the B<metadata_csum> feature while it is mounted.
pl: Pozwala systemowi plików na przechowywanie sumy kontrolnej metadanych w superbloku, umożliwiając administratorowi zmianę UUID-u systemu plików za pomocą funkcji B<metadata_csum>, gdy jest on zamontowany.

source: Enable or disable multiple mount protection (MMP) feature.
pl: Włącza lub wyłącza funkcję zabezpieczenia przed wielokrotnym montowaniem (MMP - ang. multiple mount protection).

source: Enable project ID tracking. This is used for project quota tracking.
pl: Włącza śledzenie identyfikatora projektu. Służy to śledzeniu przydziałów dyskowych projektu.

source: Enable internal file system quota inodes.
pl: Włącza i-węzły przydziałów dyskowych wewnątrz systemu plików.

source: Force the kernel to mount the file system read-only.
pl: Wymusza na jądrze zamontowanie systemu plików w trybie tylko do odczytu.

source: Reserve space so the block group descriptor table may grow in the future. B<Tune2fs> only supports clearing this file system feature.
pl: Rezerwuje przestrzeń, dzięki której tablica deskryptora grupy bloków może się powiększyć w przyszłości. B<Tune2fs> obsługuje wyłącznie usunięcie tej funkcji systemu plików.

source: Limit the number of backup superblocks to save space on large file systems. B<Tune2fs> currently only supports setting this file system feature.
pl: Ogranicza liczbę kopii bezpieczeństwa superbloków dla zaoszczędzenia miejsca w dużych systemach plików. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Prevent the file system from being shrunk or having its UUID changed, in order to allow the use of specialized encryption settings that make use of the inode numbers and UUID. B<Tune2fs> currently only supports setting this file system feature.
pl: Zabezpiecza system plików przed zmniejszeniem i zmianą UUID, aby umożliwić użycie specjalistycznych ustawień szyfrowania korzystających z numerów i-węzłów i UUID-ów. B<Tune2fs> obecnie obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: Allow the kernel to initialize bitmaps and inode tables lazily, and to keep a high watermark for the unused inodes in a file system, to reduce B<e2fsck>(8) time. The first e2fsck run after enabling this feature will take the full time, but subsequent e2fsck runs will take only a fraction of the original time, depending on how full the file system is.
pl: Pozwala jądru na opóźnioną inicjalizację map bitów i tablic i-węzłów, oraz przechowywanie najwyższej wartości nieużywanych i-węzłów systemu plików, w celu zredukowania czasu działania B<e2fsck>(8). Pierwsze uruchomienie e2fsck po włączeniu tej funkcji będzie trwało przez pełen czas, ale kolejne zajmą jedynie ułamek pierwotnego czasu trwania, w zależności od zapełnienia systemu plików.

source: Enable support for verity protected files. B<Tune2fs> currently only supports setting this file system feature.
pl: Włącza obsługę zabezpieczeń plików verity. B<Tune2fs> obsługuje wyłącznie włączenie tej funkcji systemu plików.

source: After setting or clearing B<sparse_super>, B<uninit_bg>, B<filetype>, or B<resize_inode> file system features, the file system may require being checked using B<e2fsck>(8) to return the file system to a consistent state. B<Tune2fs> will print a message requesting that the system administrator run B<e2fsck>(8) if necessary. After setting the B<dir_index> feature, B<e2fsck -D> can be run to convert existing directories to the hashed B-tree format. Enabling certain file system features may prevent the file system from being mounted by kernels which do not support those features. In particular, the B<uninit_bg> and B<flex_bg> features are only supported by the ext4 file system.
pl: Po zmianie cech B<sparse_super>, B<uninit_bg>, B<filetype> lub B<resize_inode>, może być konieczne sprawdzenie systemu plików przez B<e2fsck>(8), aby przywrócić go do porządku. Jeśli będzie to potrzebne, B<tune2fs> wypisze prośbę, aby administrator uruchomił B<e2fsck>(8). Po ustawieniu cechy B<dir_index> może zostać uruchomiony B<e2fsck -D>, aby skonwertować istniejące katalogi do formatu zhaszowanych B-drzew. Włączenie określonych funkcji systemu plików może uniemożliwić zamontowanie go przez jądro nieobsługujące takich cech. W szczególności: funkcje B<uninit_bg> i B<flex_bg> są obsługiwane tylko przez system plików ext4.

source: B<-r>I< reserved-blocks-count>
pl: B<-r>I< liczba-zarezerwowanych-bloków>

source: Set the number of reserved file system blocks.
pl: Ustawia liczbę zarezerwowanych bloków na podanym urządzeniu.

source: B<-Q>I< quota-options>
pl: B<-Q>I< opcje-udziału>

source: Sets 'quota' feature on the superblock and works on the quota files for the given quota type. Quota options could be one or more of the following:
pl: Ustawia funkcję "quota" systemu plików i działa na plikach udziałów danego typu udziałów. Opcje udziałów mogą być jedną lub kilkoma z poniższych:

source: B<[^]usrquota>
pl: [B<^>]B<usrquota>

source: Sets/clears user quota inode in the superblock.
pl: Ustawia/usuwa udziały i-węzłów użytkownika w superbloku.

source: B<[^]grpquota>
pl: [B<^>]B<grpquota>

source: Sets/clears group quota inode in the superblock.
pl: Ustawia/usuwa udziały i-węzłów grupy w superbloku.

source: B<[^]prjquota>
pl: [B<^>]B<prjquota>

source: Sets/clears project quota inode in the superblock.
pl: Ustawia/usuwa udziały i-węzłów projektu w superbloku.

source: B<-T>I< time-last-checked>
pl: B<-T>I< czas-ostatniego-sprawdzenia>

source: Set the time the file system was last checked using B<e2fsck>. The time is interpreted using the current (local) timezone. This can be useful in scripts which use a Logical Volume Manager to make a consistent snapshot of a file system, and then check the file system during off hours to make sure it hasn't been corrupted due to hardware problems, etc. If the file system was clean, then this option can be used to set the last checked time on the original file system. The format of I<time-last-checked> is the international date format, with an optional time specifier, i.e. YYYYMMDD[HH[MM[SS]]]. The keyword B<now> is also accepted, in which case the last checked time will be set to the current time.
pl: Ustawia czas kiedy system plików był ostatnio sprawdzany przez B<e2fsck>. Może to być przydatne w skryptach używających Zarządcy Woluminów Logicznych (Logical Volume Manager) do tworzenia zrzutu (snapshot) systemu plików i późniejszego jego sprawdzenia. Jeśli system plików nie był uszkodzony, ta opcja może służyć do ustawienia czasu ostatniego sprawdzenia oryginalnego systemu pików. Format I<czas-ostatniego-sprawdzania> jest zgodny z międzynarodowym formatem daty, z opcjonalnie podaną godziną, np. RRRRMMDD[GG[MM[SS]]]. Słowo kluczowe B<now> jest także akceptowane, czas ostatniego sprawdzenia będzie wówczas ustawiony na aktualny.

source: B<-u>I< user>
pl: B<-u>I< użytkownik>

source: Set the user who can use the reserved file system blocks. I<user> can be a numerical uid or a user name. If a user name is given, it is converted to a numerical uid before it is stored in the superblock.
pl: Ustawia użytkownika, który może korzystać z zarezerwowanych bloków. I<użytkownik> może być wartością numeryczną lub nazwą użytkownika. Jeżeli podana jest nazwa użytkownika, jest ona zamieniana na numeryczny uid przed zapisem do superbloku.
