Repository: sebras/manpages-l10n
Catalog: po/*/man8/tunelp.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: tunelp - set various parameters for the lp device
de: tunelp - verschiedene Parameter für das lp-Gerät setzen

source: SYNOPSIS
de: ÜBERSICHT

source: B<tunelp> [options] I<device>
de: B<tunelp> [Optionen] I<Gerät>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<tunelp> sets several parameters for the /dev/lpI<?> devices, for better performance (or for any performance at all, if your printer won\(cqt work without it...) Without parameters, it tells whether the device is using interrupts, and if so, which one. With parameters, it sets the device characteristics accordingly.
de: B<tunelp> setzt verschiedene Parameter für /dev/lpI<?>-Geräte, um bessere Performance zu erreichen (oder um überhaupt arbeiten zu können, falls etwa Ihr Drucker ohne nicht funktioniert …). Ohne Parameter ermittelt das Programm, ob das Gerät Interrupts verwendet und falls ja, welche. Mit Parametern verändert es die Gerätecharakteristiken. Folgende Parameter sind zulässig:

source: OPTIONS
de: OPTIONEN

source: specifies the IRQ to use for the parallel port in question. If this is set to something non-zero, B<-t> and B<-c> have no effect. If your port does not use interrupts, this option will make printing stop. The command B<tunelp -i 0> restores non-interrupt driven (polling) action, and your printer should work again. If your parallel port does support interrupts, interrupt-driven printing should be somewhat faster and efficient, and will probably be desirable.
de: gibt den IRQ an, den der fragliche Parallelport verwenden soll. Ist diese Option auf eine Zahl gesetzt, die nicht null ist, verlieren B<-t> und B<-c> ihre Wirkung. Falls Ihr Port keine Interrupts verwendet, blockiert diese Option das Drucken über ihn. Der Befehl B<tunelp -i 0> stellt die Nicht-Interrupt-gesteuerte Aktion (Polling) wieder her, und Ihr Drucker sollte wieder funktionieren. Sofern Ihr Parallelport Interrupts unterstützt, kann Interrupt-gesteuertes Drucken die Geschwindigkeit und Effizienz erhöhen und somit wünschenswert sein.

source: B<NOTE>: This option will have no effect with kernel 2.1.131 or later since the irq is handled by the parport driver. You can change the parport irq for example via I</proc/parport/*/irq>. Read I</usr/src/linux/Documentation/admin-guide/parport.rst> for more details on parport.
de: B<HINWEIS>: Diese Option ist mit Kernel 2.1.131 oder neuer unwirksam, da der IRQ vom Parallelport-Treiber verwaltet wird. Sie können den Parallelport-IRQ beispielsweise über I</proc/parport/*/irq> ändern. In I</usr/src/linux/Documentation/admin-guide/parport.rst> finden Sie weitere Details zum Parallelport.

source: B<-t>, B<--time> I<milliseconds>
de: B<-t>, B<--time> I<Millisekunden>

source: is the amount of time in jiffies that the driver waits if the printer doesn\(cqt take a character for the number of tries dictated by the B<-c> parameter. 10 is the default value. If you want fastest possible printing, and don\(cqt care about system load, you may set this to 0. If you don\(cqt care how fast your printer goes, or are printing text on a slow printer with a buffer, then 500 (5 seconds) should be fine, and will give you very low system load. This value generally should be lower for printing graphics than text, by a factor of approximately 10, for best performance.
de: ist die Zeitspanne in Jiffies, die der Treiber verstreichen lässt, falls der Drucker kein Zeichen entsprechend der im Parameter B<-c> vorgeschriebenen Versuche annimmt. Der Vorgabewert ist 10. Wenn Sie so schnell wie möglich drucken wollen und die höhere Systemlast für Sie nicht von Bedeutung ist, können Sie den Wert auf 0 setzen. Sollte andererseits die Druckgeschwindigkeit keine Rolle spielen, oder Sie drucken Text auf einem langsamen Drucker mit einem Puffer, dann ist ein Wert von 500 (entspricht 5 Sekunden) angemessen, und die Systemlast wird wenig beeinflusst. Der Wert sollte beim Drucken von Grafiken generell niedriger sein als bei Text, etwa um den Faktor 10, um beste Leistung zu gewährleisten.

source: B<-c>, B<--chars> I<characters>
de: B<-c>, B<--chars> I<Zeichen>

source: is the number of times to try to output a character to the printer before sleeping for B<-t> I<TIME>. It is the number of times around a loop that tries to send a character to the printer. 120 appears to be a good value for most printers in polling mode. 1000 is the default, because there are some printers that become jerky otherwise, but you I<must> set this to \(aq1\(aq to handle the maximal CPU efficiency if you are using interrupts. If you have a very fast printer, a value of 10 might make more sense even if in polling mode. If you have a I<really> old printer, you can increase this further.
de: ist die Anzahl der Versuche zur Ausgabe eines Zeichens auf dem Drucker, bevor für B<-t> I<ZEIT> gewartet wird. Ein Wert von 120 sollte für die meisten Drucker im Polling-Modus angemessen sein. Die Voreinstellung ist 1000, da einige Drucker mit anderen Einstellungen ruckeln könnten, aber wenn Sie Interrupts verwenden, I<müssen> Sie diese Option auf »1« setzen, um die CPU effizient zu nutzen. Wenn Sie einen sehr schnellen Drucker haben, könnte ein Wert von 10 selbst im Polling-Modus sinnvoller sein. Ist Ihr Drucker I<wirklich alt>, können Sie diesen Wert weiter erhöhen.

source: Setting B<-t> I<TIME> to 0 is equivalent to setting B<-c> I<CHARS> to infinity.
de: Das Setzen der B<->t I<ZEIT> auf 0 is äquivalent zum Setzen der B<-c> I<ZEICHEN> auf unendlich.

source: B<-w>, B<--wait> I<milliseconds>
de: B<-w>, B<--wait> I<Millisekunden>

source: is the number of usec we wait while playing with the strobe signal. While most printers appear to be able to deal with an extremely short strobe, some printers demand a longer one. Increasing this from the default 1 may make it possible to print with those printers. This may also make it possible to use longer cables. It\(cqs also possible to decrease this value to 0 if your printer is fast enough or your machine is slow enough.
de: ist die Wartezeit in µs, die beim Herumprobieren am Strobe-Signal jeweils abgewartet wird. Die meisten Drucker scheinen mit einem extrem kurzen Strobe umgehen zu können, andere benötigen längere Strobes. Den Wert über die Vorgabe von 1 hinaus zu erhöhen kann es möglich machen, auch auf solchen Druckern zu drucken. Außerdem könnten längere Kabel verwendet werden. Gegebenenfalls kann dieser Wert auch auf 0 gesenkt werden, wenn entweder Ihr Drucker schnell genug oder Ihr Rechner langsam genug ist.

source: This is whether to abort on printer error - the default is not to. If you are sitting at your computer, you probably want to be able to see an error and fix it, and have the printer go on printing. On the other hand, if you aren\(cqt, you might rather that your printer spooler find out that the printer isn\(cqt ready, quit trying, and send you mail about it. The choice is yours.
de: gibt an, ob bei einem Druckerfehler der Druckauftrag abgebrochen werden soll – was in der Voreinstellung nicht der Fall ist. Dadurch können Sie auf den Fehler reagieren und ihn beseitigen, sodass der Drucker den Auftrag fertig drucken kann. Sind Sie nicht persönlich vor Ort, können Sie stattdessen auch festlegen, dass der Druckspooler bei Problemen den Auftrag abbricht und Sie per E-Mail darüber informiert. Das liegt ganz bei Ihnen.

source: This option is much like B<-a>. It makes any B<open>(2) of this device check to see that the device is on-line and not reporting any out of paper or other errors. This is the correct setting for most versions of B<lpd>.
de: Diese Option ähnelt B<-a>. Die B<open>(2)-Aufrufe des Gerätes überprüfen zunächst, ob es betriebsbereit ist und keine Meldungen über Papierstau oder andere Fehler vorliegen. Dies ist die korrekte Einstellung für die meisten B<lpd>-Versionen.

source: This option adds extra ("careful") error checking. When this option is on, the printer driver will ensure that the printer is on-line and not reporting any out of paper or other errors before sending data. This is particularly useful for printers that normally appear to accept data when turned off.
de: löst eine besonders »sorgfältige« Fehlerprüfung aus. Wenn diese Option aktiviert ist, stellt der Druckertreiber vor dem Senden von Daten sicher, dass der Drucker betriebsbereit ist und keinen Papierstau oder andere Fehler meldet. Dies ist insbesondere für Drucker nützlich, die anscheinend im ausgeschalteten Zustand Daten akzeptieren.

source: B<NOTE>: This option is obsolete because it\(cqs the default in 2.1.131 kernel or later.
de: B<HINWEIS>: Diese Option ist obsolet, da sie die Voreinstellung in Kernel 2.1.131 und neuer ist.

source: This option returns the current printer status, both as a decimal number from 0..255, and as a list of active flags. When this option is specified, B<-q> off, turning off the display of the current IRQ, is implied.
de: gibt den aktuellen Druckerstatus zurück, sowohl als Dezimalzahl von 0 bis 255, als auch in Form einer Liste der aktiven Schalter. Wenn diese Option angegeben ist, bezieht das ein, dass B<-q> deaktiviert und die Anzeige des aktuellen IRQ ausgeschaltet ist.

source: This option resets the port. It requires a Linux kernel version of 1.1.80 or later.
de: Diese Option setzt den Port zurück. Dazu wird ein Kernel 1.1.80 oder neuer benötigt.

source: This option sets printing the display of the current IRQ setting.
de: Diese Option schaltet die Anzeige der aktuellen IRQ-Einstellung ein oder aus.

source: FILES
de: DATEIEN

source: NOTES
de: ANMERKUNGEN

source: B<-o>, B<-C>, and B<-s> all require a Linux kernel version of 1.1.76 or later.
de: Die Optionen B<-o>, B<-C> und B<-s> benötigen alle einen Linux-Kernel Version 1.1.76 oder neuer.

source: B<-C> requires a Linux version prior to 2.1.131.
de: B<-C> benötigt einen Linux-Kernel Version vor 2.1.131.

source: REPORTING BUGS
de: FEHLER MELDEN

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The B<tunelp> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<tunelp> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
