Repository: sebras/manpages-l10n
Catalog: po/*/man8/tune2fs.8.po
Languages: pl

source: December 2021
pl: grudzień 2021

source: E2fsprogs version 1.46.5
pl: E2fsprogs wersja 1.46.5

source: NAME
pl: NAZWA

source: tune2fs - adjust tunable file system parameters on ext2/ext3/ext4 file systems
pl: tune2fs - modyfikacja konfigurowalnych parametrów systemów plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<tune2fs> [ B<-l> ] [ B<-c> I<max-mount-counts> ] [ B<-e> I<errors-behavior> ] [ B<-f> ] [ B<-i> I<interval-between-checks> ] [ B<-I> I<new_inode_size> ] [ B<-j> ] [ B<-J> I<journal-options> ] [ B<-m> I<reserved-blocks-percentage> ] [ B<-o> [^]mount-optionsI<[,...]> ] [ B<-r> I<reserved-blocks-count> ] [ B<-u> I<user> ] [ B<-g> I<group> ] [ B<-C> I<mount-count> ] [ B<-E> I<extended-options> ] [ B<-L> I<volume-label> ] [ B<-M> I<last-mounted-directory> ] [ B<-O> [^]I<feature>[,...] ] [ B<-Q> I<quota-options> ] [ B<-T> I<time-last-checked> ] [ B<-U> I<UUID> ] [ B<-z> I<undo_file> ] device
pl: B<tune2fs> [ B<-l> ] [ B<-c> I<max-liczba-montowań> ] [ B<-e> I<zachowanie-w-razie-błędu> ] [ B<-f> ] [ B<-i> I<przerwa-między-sprawdzeniami> ] [ B<-I> I<nowy-rozmiar-i-węzła> ] [ B<-j> ] [ B<-J> I<opcje-dziennika> ] [ B<-m> I<procent-zarezerwowanych-bloków> ] [ B<-o> [B<^>]I<opcje-montowania>[B<,>...] ] [ B<-r> I<liczba-zarezerwowanych-bloków> ] [ B<-u> I<użytkownik> ] [ B<-g> I<grupa> ] [ B<-C> I<liczba-montowań> ] [ B<-E> I<opcje-rozszerzone> ] [ B<-L> I<etykieta-woluminu> ] [ B<-M> I<ostatnio-montowany-katalog> ] [ B<-O> [B<^>]I<cecha>[B<,>...] ] [ B<-Q> I<opcje-przydziałów-dyskowych> ] [ B<-T> I<czas-ostatniego-sprawdzenia> ] [ B<-U> I<UUID> ] [ B<-z> I<plik-zapasowy> ] urządzenie

source: DESCRIPTION
pl: OPIS

source: B<tune2fs> allows the system administrator to adjust various tunable file system parameters on Linux ext2, ext3, or ext4 file systems. The current values of these options can be displayed by using the B<-l> option to B<tune2fs>(8) program, or by using the B<dumpe2fs>(8) program.
pl: B<tune2fs> modyfikuje konfigurowalne parametry linuksowych systemów plików ext2, ext3 lub ext4. Bieżąca wartość tych opcji może zostać wyświetlona dzięki opcji B<-l> programu B<tune2fs>(8) lub za pomocą programu B<dumpe2fs>(8).

source: The I<device> specifier can either be a filename (i.e., /dev/sda1), or a LABEL or UUID specifier: "B<LABEL=>I<volume-label>" or "B<UUID=>I<uuid>". (i.e., LABEL=home or UUID=e40486c6-84d5-4f2f-b99c-032281799c9d).
pl: I<Urządzenie> może zostać podane według nazwy pliku (np. /dev/sda1) albo LABEL (etykiety) lub UUID: "B<LABEL=>I<etykieta-woluminu>" lub "B<UUID=>I<uuid>" (np. LABEL=home or UUID=e40486c6-84d5-4f2f-b99c-032281799c9d).

source: OPTIONS
pl: OPCJE

source: B<-c>I< max-mount-counts>
pl: B<-c>I< max-liczba-montowań>

source: Adjust the number of mounts after which the file system will be checked by B<e2fsck>(8). If I<max-mount-counts> is the string "random", tune2fs will use a random value between 20 and 40. If I<max-mount-counts> is 0 or -1, the number of times the file system is mounted will be disregarded by B<e2fsck>(8) and the kernel.
pl: Zmiana maksymalnej liczby montowań między dwoma sprawdzeniami systemu plików. Jeżeli jako I<max-liczba-montowań> poda się B<random>, tune2fs użyje losowej wartości z przedziału od 20 do 40. Jeżeli I<max-liczba-montowań> jest równa 0 lub -1, wtedy liczba montowań będzie ignorowana przez B<e2fsck>(8) i jądro.

source: Staggering the mount-counts at which file systems are forcibly checked will avoid all file systems being checked at one time when using journaled file systems.
pl: Ustawienie liczby montowań, po których system plików będzie bezwzględnie sprawdzany, przemiennie spowoduje, że systemy plików z księgowaniem nie będą sprawdzane w tym samym czasie.

source: Mount-count-dependent checking is disabled by default to avoid unanticipated long reboots while e2fsck does its work. If you are concerned about file system corruptions caused by potential hardware problems of kernel bugs, a better solution than mount-count-dependent checking is to use the B<e2scrub>(8) program. This does require placing the file system on an LVM volume, however.
pl: Domyślnie funkcja sprawdzania w zależności od liczby montowań jest wyłączona, aby zapobiec niespodziewanie długim przeładowaniom systemu, gdy wypadnie akurat kolej na sprawdzenie e2fsck. Aby zapewnić diagnostykę systemu plików pod kątem ewentualnych błędów spowodowanych przez potencjalnie problemy sprzętowe lub błędy jądra, lepszym rozwiązaniem od opisywanej funkcji jest użycie programu B<e2scrub>(8). Wymaga to jednak umieszczenia systemu plików na woluminie LVM.

source: B<-C>I< mount-count>
pl: B<-C>I< liczba-montowań>

source: Set the number of times the file system has been mounted. If set to a greater value than the max-mount-counts parameter set by the B<-c> option, B<e2fsck>(8) will check the file system at the next reboot.
pl: Ustawia licznik montowań systemu plików. Jeśli jest on ustawiony na wartość większą niż max-liczba-montowań ustawioną przez opcję B<-c>, to B<e2fsck>(8) sprawdzi system plików po następnym restarcie.

source: B<-e>I< error-behavior>
pl: B<-e>I< zachowanie-w-razie-błędu>

source: Change the behavior of the kernel code when errors are detected. In all cases, a file system error will cause B<e2fsck>(8) to check the file system on the next boot. I<error-behavior> can be one of the following:
pl: Zmienia zachowanie jądra, gdy wykryty zostanie błąd. We wszystkich przypadkach błąd systemu plików powoduje uruchomienie B<e2fsck>(8) podczas następnego restartu w celu sprawdzenia systemu plików. I<zachowanie-w-razie-błędu> może przyjmować następujące wartości:

source: Continue normal execution.
pl: Kontynuuje normalną pracę.

source: Remount file system read-only.
pl: Powoduje przejście systemu plików w tryb tylko do odczytu.

source: Cause a kernel panic.
pl: Wywołuje panikę jądra.

source: B<-E>I< extended-options>
pl: B<-E>I< opcje rozszerzone>

source: Set extended options for the file system. Extended options are comma separated, and may take an argument using the equals ('=') sign. The following extended options are supported:
pl: Ustawia rozszerzone opcje systemu plików. Opcje rozszerzone są oddzielone przecinkami i mogą zawierać argument podany po znaku równości ("="). Obsługiwane są następujące opcje:

source: Reset the MMP block (if any) back to the clean state. Use only if absolutely certain the device is not currently mounted or being fscked, or major file system corruption can result. Needs '-f'.
pl: Resetuje blok MMP (jeśli występuje) z powrotem do stanu czystego. Może być użyte tylko w przypadku absolutnej pewności, że urządzenie nie jest obecnie zamontowane lub sprawdzane za pomocą fsck, ponieważ może wówczas wystąpić poważne uszkodzenie systemu plików. Wymaga opcji "-f".

source: B<mmp_update_interval=>I<interval>
pl: B<mmp_update_interval=>I<interwał>

source: Adjust the initial MMP update interval to I<interval> seconds. Specifying an I<interval> of 0 means to use the default interval. The specified interval must be less than 300 seconds. Requires that the B<mmp> feature be enabled.
pl: Dostosowuje pierwotny interwał aktualizacji MMP do I<interwał> sekund. Podanie wartości 0 spowoduje użycia domyślnego interwału. Podany interwał musi być mniejszy niż 300 sekund. Wymaga włączonej funkcji B<mmp>.

source: B<stride=>I<stride-size>
pl: B<stride=>I<rozmiar-części>

source: Configure the file system for a RAID array with I<stride-size> file system blocks. This is the number of blocks read or written to disk before moving to next disk. This mostly affects placement of file system metadata like bitmaps at B<mke2fs>(2) time to avoid placing them on a single disk, which can hurt the performance. It may also be used by block allocator.
pl: Konfiguruje system plików do macierzy RAID z I<rozmiarem-części> (ang. stride size) bloków systemu plików. Jest to liczba bloków odczytywanych lub zapisywanych na dysk przed przejściem na następny dysk. To ustawienie wpływa głównie na położenie metadanych systemu plików, takich jak mapy bitów podczas wykonywania B<mke2fs>(2), aby zapobiec umieszczeniu ich na jednym dysku, co mogłoby negatywnie wpłynąć na wydajność. Może być również użyte przez alokator bloków.

source: B<stripe_width=>I<stripe-width>
pl: B<stripe_width=>I<szerokość-paska>

source: Configure the file system for a RAID array with I<stripe-width> file system blocks per stripe. This is typically be stride-size * N, where N is the number of data disks in the RAID (e.g. RAID 5 N+1, RAID 6 N+2). This allows the block allocator to prevent read-modify-write of the parity in a RAID stripe if possible when the data is written.
pl: Konfiguruje system plików do macierzy RAID z I<rozmiarem-paska> (ang. stripe width) bloków systemu plików na pasek. Zazwyczaj jest to rozmiar-części * N, gdzie N jest liczbą dysków z danymi w macierzy RAID (np. RAID 5 N+1, RAID 6 N+2). Pozwala to alokatorowi bloków na przeciwdziałanie cyklowi odczytu-modyfikacji-zapisu w pasku RAID, jeśli to możliwe, przy zapisie danych.

source: B<hash_alg=>I<hash-alg>
pl: B<hash_alg=>I<dopasowanie-hash>

source: Set the default hash algorithm used for file systems with hashed b-tree directories. Valid algorithms accepted are: I<legacy>, I<half_md4>, and I<tea>.
pl: Ustawia domyślny algorytm haszujący używany do systemów plików z haszowanymi katalogami b-drzew. Poprawnymi algorytmami są: I<legacy>, I<half_md4> i I<tea>.

source: B<encoding=>I<encoding-name>
pl: B<encoding=>I<nazwa-kodowania>

source: Enable the I<casefold> feature in the super block and set I<encoding-name> as the encoding to be used. If I<encoding-name> is not specified, utf8 is used. The encoding cannot be altered if casefold was previously enabled.
pl: Włącza funkcję I<casefold> w superbloku i ustawia I<nazwa-kodowania> jako używane kodowanie. Jeśli nie podano I<nazwy-kodowania>, użyte będzie kodowanie utf8. Jeśli funkcja casefold była wcześniej włączona, nie da się zmienić kodowania.

source: B<encoding_flags=>I<encoding-flags>
pl: B<encoding_flags=>I<flagi-kodowania>

source: Define parameters for file name character encoding operations. If a flag is not changed using this parameter, its default value is used. I<encoding-flags> should be a comma-separated lists of flags to be enabled. The flags cannot be altered if casefold was previously enabled.
pl: Określa parametry operacji kodowania znaków nazw plików. Jeśli nie zmienia się flagi za pomocą tej opcji, używana jest wartość domyślna. I<Flagi-kodowania> to oddzielana przecinkami lista flag do włączenia. Jeśli funkcja casefold była wcześniej włączona, nie da się zmienić flag.

source: The only flag that can be set right now is I<strict> which means that invalid strings should be rejected by the file system. In the default configuration, the I<strict> flag is disabled.
pl: Obecnie jedyną flagą jaką można ustawić, to I<strict> oznaczająca, że nieprawidłowe łańcuchy znaków powinny być odrzucane przez system plików. W domyślnej konfiguracji flaga I<strict> jest wyłączona.

source: B<mount_opts=>I<mount_option_string>
pl: B<mount_opts=>I<łańcuch-opcji-montowania>

source: Set a set of default mount options which will be used when the file system is mounted. Unlike the bitmask-based default mount options which can be specified with the B<-o> option, I<mount_option_string> is an arbitrary string with a maximum length of 63 bytes, which is stored in the superblock.
pl: Ustawia domyślne opcje montowania używane przy montowaniu systemu plików. W przeciwieństwie do domyślnych opcji montowania, bazujących na mapach bitów, które mogą być podane przy użyciu opcji B<-o>, I<łańcuch-opcji-montowania> jest dowolnym łańcuchem o maksymalnej długości 63 bajtów, który jest przechowywany w superbloku.

source: The ext4 file system driver will first apply the bitmask-based default options, and then parse the I<mount_option_string>, before parsing the mount options passed from the B<mount>(8) program.
pl: Sterownik systemu plików ext4 zastosuje najpierw domyślne opcje oparte na mapach bitów, a następnie przeanalizuje I<łańcuch-opcji-montowania>, przed przetworzeniem opcji podanych programowi B<mount>(8).

source: This superblock setting is only honored in 2.6.35+ kernels; and not at all by the ext2 and ext3 file system drivers.
pl: Ustawienia supebloku są przestrzegane wyłącznie przez jądra 2.6.35, i nowsze; są ignorowane przez sterowniki systemów plików ext2 i ext3.

source: Set a flag in the file system superblock indicating that errors have been found. This will force fsck to run at the next mount.
pl: Ustawia flagę superbloku systemu plików oznaczającą, że znaleziono błędy. Wymusi to sprawdzenie fsck przy następnym zamontowaniu.

source: Set a flag in the file system superblock indicating that it may be mounted using experimental kernel code, such as the ext4dev file system.
pl: Ustawia flagę superbloku systemu plików, oznaczającą, że może być on montowany przy użyciu eksperymentalnego kodu jądra, np. kodu systemu plików ext4dev.

source: Clear the test_fs flag, indicating the file system should only be mounted using production-level file system code.
pl: Usuwa flagę test_fs, wskazując, że system plików powinien być montowany wyłącznie przy użyciu kodu produkcyjnego systemu plików.

source: Force the tune2fs operation to complete even in the face of errors. This option is useful when removing the B<has_journal> file system feature from a file system which has an external journal (or is corrupted such that it appears to have an external journal), but that external journal is not available. If the file system appears to require journal replay, the B<-f> flag must be specified twice to proceed.
pl: Wymusza kończenie operacji tune2fs nawet w przypadku wystąpienia błędów. Ta opcja jest przydatna podczas wyłączania cechy B<has_journal> w systemie plików posiadającym zewnętrzny dziennik (lub tak uszkodzonym, że sprawia wrażenie posiadającego zewnętrzny dziennik), który nie jest dostępny. Jeśli system plików wymaga odtworzenia dziennika to aby kontynuować flagę B<-f> należy podać dwukrotnie.

source: B<WARNING:> Removing an external journal from a file system which was not cleanly unmounted without first replaying the external journal can result in severe data loss and file system corruption.
pl: B<OSTRZEŻENIE:> Usuwanie zewnętrznego dziennika z systemu plików, który nie został prawidłowo odmontowany, bez wcześniejszego zabezpieczenia tego dziennika, może prowadzić do utraty danych i poważnych uszkodzeń systemu plików.

source: B<-g>I< group>
pl: B<-g>I< grupa>

source: Set the group which can use the reserved file system blocks. The I<group> parameter can be a numerical gid or a group name. If a group name is given, it is converted to a numerical gid before it is stored in the superblock.
pl: Ustawia grupę użytkownika, który może używać zarezerwowanych bloków. Parametr I<grupa> może być numerycznym gid-em lub nazwą grupy. Jeżeli podana jest nazwa grupy, jest ona zamieniana na numeryczny gid przed zachowaniem danych w superbloku.

source: B<-i >I<interval-between-checks>[B<d>|B<m>|B<w>]
pl: B<-i> I<przerwa-między-sprawdzeniami>[B<d>|B<m>|B<w>]

source: Adjust the maximal time between two file system checks. No suffix or B<d> will interpret the number I<interval-between-checks> as days, B<m> as months, and B<w> as weeks. A value of zero will disable the time-dependent checking.
pl: Dostraja maksymalny okres czasu między dwoma sprawdzeniami systemu plików. Brak przedrostka lub B<d> oznacza dni, B<m> miesiące, a B<w> tygodnie. Zero wyłączy sprawdzanie w zależności od upływu czasu.

source: There are pros and cons to disabling these periodic checks; see the discussion under the B<-c> (mount-count-dependent check) option for details.
pl: Wyłączenie tych okresowych sprawdzeń ma swoje zalety i wady. Szerszy opis przy opcji B<-c> (sprawdzenia zależne od liczby montowań).

source: Change the inode size used by the file system. This requires rewriting the inode table, so it requires that the file system is checked for consistency first using B<e2fsck>(8). This operation can also take a while and the file system can be corrupted and data lost if it is interrupted while in the middle of converting the file system. Backing up the file system before changing inode size is recommended.
pl: Zmienia rozmiar i-węzła używany przez system plików. Wymaga to przepisania tablicy i-węzłów, dlatego konieczne jest uprzednie sprawdzenie systemu plików za pomocą B<e2fsck>(8). Operacja ta może zająć dłuższy czas, a jeśli konwersja zostanie przerwana, możliwe jest uszkodzenie systemu plików i utrata danych. Przed zmianą rozmiaru i-węzła zaleca się wykonania kopii zapasowej systemu plików.

source: File systems with an inode size of 128 bytes do not support timestamps beyond January 19, 2038. Inodes which are 256 bytes or larger will support extended timestamps, project id's, and the ability to store some extended attributes in the inode table for improved performance.
pl: Systemy plików z i-węzłami o rozmiarze 128 bajtów nie obsługują znaczników czasu późniejszych niż 19 stycznia 2038. I-węzły o rozmiarze 256 bajtów lub większym obsługują rozszerzone znaczniki czasu, identyfikatory projektów oraz możliwość przechowywania pewnych dodatkowych atrybutów w tabeli i-węzłów, które wpływają na zwiększoną wydajność.

source: Add an ext3 journal to the file system. If the B<-J> option is not specified, the default journal parameters will be used to create an appropriately sized journal (given the size of the file system) stored within the file system. Note that you must be using a kernel which has ext3 support in order to actually make use of the journal.
pl: Dodaje dziennik ext3 do systemu plików. Jeżeli opcja B<-J> nie została podana, do utworzenia dziennika o odpowiedniej wielkości (dla podanego systemu plików), przechowywanego w systemie plików, zostaną użyte domyślne parametry. Należy zauważyć, że aby móc używać księgowania, jądro musi obsługiwać ext3.

source: If this option is used to create a journal on a mounted file system, an immutable file, B<.journal>, will be created in the top-level directory of the file system, as it is the only safe way to create the journal inode while the file system is mounted. While the ext3 journal is visible, it is not safe to delete it, or modify it while the file system is mounted; for this reason the file is marked immutable. While checking unmounted file systems, B<e2fsck>(8) will automatically move B<.journal> files to the invisible, reserved journal inode. For all file systems except for the root file system, this should happen automatically and naturally during the next reboot cycle. Since the root file system is mounted read-only, B<e2fsck>(8) must be run from a rescue floppy in order to effect this transition.
pl: Jeżeli ta opcja jest użyta do utworzenia dziennika na już zamontowanym systemie plików, to w głównym katalogu tego systemu plików zostanie utworzony niemodyfikowalny plik B<.journal>, ponieważ jest to jedyna bezpieczna metoda utworzenia i-węzła dla dziennika w zamontowanym systemie plików. W czasie gdy plik dziennika ext3 jest widoczny, nie jest bezpieczne usuwanie lub modyfikowanie go; z tego powodu plik ten jest zaznaczony jako niemodyfikowalny (immutable). Podczas sprawdzania odmontowanych systemów plików B<e2fsck>(8) automatycznie przeniesie pliki B<.journal> do niewidocznego, zarezerwowanego węzła dziennika. Dla wszystkich systemów plików, poza głównym (root), powinno się to stać automatycznie podczas następnego restartu systemu. Ponieważ główny system plików jest zamontowany w trybie tylko do odczytu, w celu dokonania tej przemiany B<e2fsck>(8) musi zostać uruchomiony z dyskietki ratunkowej.

source: On some distributions, such as Debian, if an initial ramdisk is used, the initrd scripts will automatically convert an ext2 root file system to ext3 if the B</etc/fstab> file specifies the ext3 file system for the root file system in order to avoid requiring the use of a rescue floppy to add an ext3 journal to the root file system.
pl: Aby uniknąć używania dyskietki ratunkowej do dodania dziennika ext3 do głównego systemu plików, skrypty initrd niektórych dystrybucji, np. Debiana, automatycznie skonwertują główny system plików ext2 do ext3, jeżeli używany jest początkowy ramdisk oraz gdy plik B</etc/fstab> określa typ ext3 dla głównego systemu plików.

source: B<-J> journal-options
pl: B<-J> opcje-dziennika

source: Override the default ext3 journal parameters. Journal options are comma separated, and may take an argument using the equals ('=') sign. The following journal options are supported:
pl: Zmienia domyślne parametry dziennika ext3. Opcje dziennika są oddzielone przecinkami i mogą zawierać argument podany po znaku równości ("="). Obsługiwane są następujące opcje dziennika:

source: B<size=>I<journal-size>
pl: B<size=>I<rozmiar-dziennika>

source: Create a journal stored in the file system of size I<journal-size> megabytes. The size of the journal must be at least 1024 file system blocks (i.e., 1MB if using 1k blocks, 4MB if using 4k blocks, etc.) and may be no more than 10,240,000 file system blocks. There must be enough free space in the file system to create a journal of that size.
pl: Tworzy przechowywany w systemie plików dziennik, o wielkości I<rozmiar-dziennika> megabajtów. Rozmiar dziennika musi wynosić co najmniej 1024 bloki (np. 1MB jeżeli używane są bloki o rozmiarze 1k, 4MB jeżeli 4k, itd.), ale nie może przekraczać 1.024.000 bloków. System plików musi zawierać ilość wolnego miejsca wystarczającą do utworzenia dziennika.

source: B<fast_commit_size=>I<fast-commit-size>
pl: B<fast_commit_size=>I<rozmiar-szybkiego-zatwierdzania>

source: Create an additional fast commit journal area of size I<fast-commit-size> kilobytes. This option is only valid if B<fast_commit> feature is enabled on the file system. If this option is not specified and if B<fast_commit> feature is turned on, fast commit area size defaults to I<journal-size> / 64 megabytes. The total size of the journal with B<fast_commit> feature set is I<journal-size> + ( I<fast-commit-size> * 1024) megabytes. The total journal size may be no more than 10,240,000 file system blocks or half the total file system size (whichever is smaller).
pl: Tworzy dodatkowy obszar szybkiego zatwierdzania dziennika o rozmiarze I<rozmiar-szybkiego-zatwierdzania> w kilobajtach. Opcja jest prawidłowa wyłącznie jeśli włączono funkcję B<fast_commit> w danym systemie plików. Jeśli nie podano tej opcji, a funkcja B<fast_commit> jest włączona, domyślnym rozmiarem tego obszaru będzie I<journal-size> / 64 megabajtów. Całkowity rozmiar dziennika z ustawioną funkcją B<fast_commit> wynosi I<journal-size> + ( I<fast-commit-size> * 1024) megabajtów. Całkowity rozmiar dziennika nie może być większy niż 10.240.000 bloków systemu plików lub połowy całkowitego rozmiaru systemu plików (mniejszą z tych wartości).

source: B<location>I<=journal-location>
pl: B<location>I<=położenie-dziennika>

source: Specify the location of the journal. The argument I<journal-location> can either be specified as a block number, or if the number has a units suffix (e.g., 'M', 'G', etc.) interpret it as the offset from the beginning of the file system.
pl: Określa położenie dziennika. Argument I<położenie dziennika> można podać jako numer bloku lub, jeśli liczba ma przyrostek określający jednostkę ("M", "G" itp.), liczbę interpretowaną jako przesunięcie od początku systemu plików.

source: B<device=>I<external-journal>
pl: B<device=>I<zewnętrzny-dziennik>

source: Attach the file system to the journal block device located on I<external-journal>. The external journal must have been already created using the command
pl: Przyłącza system plików do urządzenia z dziennikiem (journal block device) umieszczonego na I<zewnętrzny-dziennik>. Zewnętrzny dziennik musi być utworzony przez wywołanie
