Repository: sebras/manpages-l10n
Catalog: po/*/man8/tune2fs.8.po
Languages: pl

source: Set the universally unique identifier (UUID) of the file system to I<UUID>. The format of the UUID is a series of hex digits separated by hyphens, like this: "c1b9d5a2-f162-11cf-9ece-0020afc76f16". The I<UUID> parameter may also be one of the following:
pl: Ustawia uniwersalny, unikatowy identyfikator (universally unique identifier - UUID) systemu plików na I<UUID>. UUID składa się z serii cyfr w systemie szesnastkowym oddzielonych myślnikami, jak np.: "c1b9d5a2-f162-11cf-9ece-0020afc76f16". Parametr I<UUID> może przyjmować też następujące wartości:

source: clear the file system UUID
pl: usuwa UUID systemu plików

source: generate a new randomly-generated UUID
pl: generuje nowy, przypadkowy UUID

source: generate a new time-based UUID
pl: generuje nowy UUID, oparty na czasie

source: The UUID may be used by B<mount>(8), B<fsck>(8), and B</etc/fstab>(5) (and possibly others) by specifying B<UUID=>I<uuid> instead of a block special device name like B</dev/hda1>.
pl: UUID może być używany przez B<mount>(8), B<fsck>(8) i w B</etc/fstab>(5) (i pewnie też w innych sytuacjach) poprzez podanie B<UUID=>I<uuid> zamiast nazwy urządzenia blokowego, jak np. B</dev/hda1>.

source: See B<uuidgen>(8) for more information. If the system does not have a good random number generator such as I</dev/random> or I</dev/urandom>, B<tune2fs> will automatically use a time-based UUID instead of a randomly-generated UUID.
pl: Więcej informacji można znaleźć w B<uuidgen>(8). Jeżeli system nie posiada dobrego generatora liczb losowych, takiego jak I</dev/random> lub I</dev/urandom>, B<tune2fs> automatycznie posłuży się generatorem opartym na czasie.

source: B<-z>I< undo_file>
pl: B<-z> I<plik-zapasowy>

source: Before overwriting a file system block, write the old contents of the block to an undo file. This undo file can be used with e2undo(8) to restore the old contents of the file system should something go wrong. If the empty string is passed as the undo_file argument, the undo file will be written to a file named tune2fs-I<device>.e2undo in the directory specified via the I<E2FSPROGS_UNDO_DIR> environment variable.
pl: Przed nadpisaniem bloku w systemie plików, zapisuje jego starą zawartość do pliku zapasowego. Później można użyć programu e2undo(8) do przywrócenia starej zawartości systemu plików z pliku zapasowego, jeśli coś pójdzie nie tak. Jeśli jako I<plik-zapasowy> poda się pusty łańcuch, przyjmie on wartość domyślną: tune2fs-I<urządzenie>.e2undo w katalogu określonym zmienną środowiskową I<E2FSPROGS_UNDO_DIR>.

source: WARNING: The undo file cannot be used to recover from a power or system crash.
pl: OSTRZEŻENIE: Plik zapasowy nie pomoże w przypadku utraty zasilania lub zawieszenia systemu.

source: BUGS
pl: BŁĘDY

source: We haven't found any bugs yet. That doesn't mean there aren't any...
pl: Nie znaleźliśmy jeszcze żadnych błędów, co nie oznacza, że ich tu nie ma...

source: AUTHOR
pl: AUTOR

source: B<tune2fs> was written by Remy Card E<lt>Remy.Card@linux.orgE<gt>. It is currently being maintained by Theodore Ts'o E<lt>tytso@alum.mit.eduE<gt>. B<tune2fs> uses the ext2fs library written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>. This manual page was written by Christian Kuhtz E<lt>chk@data-hh.Hanse.DEE<gt>. Time-dependent checking was added by Uwe Ohse E<lt>uwe@tirka.gun.deE<gt>.
pl: B<tune2fs> został napisany przez Remy'ego Carda E<lt>card@masi.ibp.frE<gt>. Obecnie opiekuje się nim Theodore Ts'o E<lt>tytso@alum.mit.eduE<gt>. B<tune2fs> korzysta z biblioteki ext2fs, napisanej przez Theodore'a Ts'o E<lt>tytso@mit.eduE<gt>. Ta strona podręcznika została napisana przez Christiana Kuhtza E<lt>chk@data-hh.Hanse.DEE<gt>. Sprawdzanie zależne od upływu czasu zostało dodane przez Uwe Ohse E<lt>uwe@tirka.gun.deE<gt>.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: B<tune2fs> is part of the e2fsprogs package and is available from http://e2fsprogs.sourceforge.net.
pl: B<tune2fs> jest częścią pakietu e2fsprogs i jest dostępny na stronie http://e2fsprogs.sourceforge.net.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: September 2022
pl: wrzesień 2022

source: E2fsprogs version 1.46.6-rc1
pl: E2fsprogs wersja 1.46.6-rc1

source: August 2021
pl: sierpień 2021

source: E2fsprogs version 1.46.4
pl: E2fsprogs wersja 1.46.4
