Repository: sebras/manpages-l10n
Catalog: po/*/man8/update-openssh-known-hosts.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: update-openssh-knwon-hosts - download, filter and merge known_hosts for OpenSSH
de: update-openssh-knwon-hosts - known_hosts für OpenSSH herunterladen, filtern und zusammenführen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: update-openssh-known-hosts manages downloading, filtering and mergeing of ssh_known_hosts files from anywhere into one local file for use by ssh(1).
de: update-openssh-known-hosts verwaltet das Herunterladen, Filtern und Zusammenführen von ssh_known_hosts-Dateien aus beliebigen Quellen in eine lokale Datei zur Verwendung mit B<ssh>(1).

source: OPTIONS
de: OPTIONEN

source: treat every non-zero exit from download plugin as an error, see EXIT_IGNORE below.
de: Behandelt jeden von Null verschiedenen Exit-Code von der Herunterladeerweiterung als Fehler, siehe nachfolgenden EXIT_IGNORE.

source: RETURN VALUES
de: RÜCKGABEWERTE

source: Returns zero on success and anything else on error.
de: Liefert Null im Erfolgsfall und alles andere bei Fehlern zurück.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: Configuration directory, defaults to /etc/openssh-known-hosts. Currently there is only a sources subdirectory in it.
de: Konfigurationsverzeichnis, standardmäßig I</etc/openssh-known-hosts>. Derzeit gibt es nur ein Unterverzeichnis I<sources> darin.

source: Plugin search path, defaults to /usr/local/share/openssh-known-hosts/plugins:/usr/share/openssh-known-hosts/plugins.
de: Suchpfad für Erweiterungen, standardmäßig I</usr/local/share/openssh-known-hosts/plugins:/usr/share/openssh-known-hosts/plugins>.

source: Cache directory, defaults to /var/cache/openssh-known-hosts.
de: Zwischenspeicherverzeichnis, standardmäßig I</var/cache/openssh-known-hosts>.

source: Lockfile path, defaults to /var/lock/openssh-known-hosts.
de: Sperrdateipfad, standardmäßig I</var/lock/openssh-known-hosts>.

source: Output file name, defaults to /var/lib/openssh-known-hosts/ssh_known_hosts
de: Ausgabedateiname, standardmäßig I</var/lib/openssh-known-hosts/ssh_known_hosts>

source: SOURCE DEFINITIONS
de: QUELLDEFINITIONEN

source: A source definition is shell snippet dropped into CONFDIR/sources/ with a run-parts(8) compliant name. There are two variables not specific to a download plugin:
de: Eine Quelldefinition ist ein Shell-Schnipsel, das in I<CONFDIR/sources/> mit einem Namen gemäß B<run-parts>(8) abgelegt wird. Es gibt zwei Variablen, die unabhängig von der Herunterladeerweiterung sind:

source: name of the download plugin to use, searched for in PLUGIN_PATH.
de: Name der zu verwendenden Herunterladeerweiterung; danach wird in PLUGIN_PATH gesucht.

source: optional space-seperated list of exitcodes which should be ignored. Upon such exit code the previously downloaded version is used.
de: Optionale, Leerzeichen-getrennte Liste von Exit-Codes, die ignoriert werden sollen. Beim Auftreten eines solchen Exit-Codes wird die vorher heruntergeladene Version verwandt.

source: DOWNLOAD PLUGINS
de: HERUNTERLADEERWEITERUNGEN

source: Download plugins are executables dropped into PLUGIN_PATH and referenced via the PLUGIN variable in the source definition. A plugin gets the variables set in the source definition in its environment. The working directory will be set to the source\[cq]s cache directory. Everything a plugin has to do is to create a file named \[lq]new\[rq]. \[lq]current\[rq] must not be touched but can be used as a hint to skip downloading the same file again. stdout and stderr will be connected to \[lq]log\[rq], which will be output on error. Plugins needn\[cq]t create \[lq]new\[rq] if it would be identical to \[lq]current\[rq].
de: HERUNTERLADEERWEITERUNGEN sind Programme, die im PLUGIN_PATH abgelegt und mittels der Variablen PLUGIN in der Quelldefinition referenziert werden. Eine Erweiterung erhält die in der Quelldefinition gesetzten Variablen in seiner Umgebung. Das Arbeitsverzeichnis wird auf das Zwischenspeicherverzeichnis der Quellen gesetzt. Alles, was eine Erweiterung machen muss, ist die Erstellung einer Datei namens »new«. »current« darf nicht verändert werden, kann aber als Hinweis verwandt werden, um das erneute Herunterladen der gleichen Datei zu überspringen. Stdout und Stderr werden mit »log« verbunden, das im Fehlerfall ausgegeben wird. Erweiterungen müssen »new« nicht erstellen, wenn es identisch zu »current« wäre.

source: HOSTNAME FILTERS
de: RECHNERNAME-FILTER

source: Place a file foo.filter next to your source definition foo. Each line shall contain a rule consisting of an action, a space and a pattern. The first rule with a matching pattern decides: If the action starts with a, o, p or y (for accept, admit, allow, ok, pass, permit, print, yes, \&...) the hostname will be used, otherwise it is discarded. If a key has no hostnames left it is discarded as a whole.
de: Legen Sie eine Datei »foo.filter« neben Ihrer Quelldefinitionsdatei »foo« ab. Jede Zeile muss eine Regel enthalten, die aus einer Aktion, einem Leerzeichen und einem Muster besteht. Die erste Regel mit einem passenden Muster entscheidet: Falls die Aktion mit a, o, p oder y beginnt (die Buchstaben stehen für accept (akzeptieren), admit (zulassen), allow (erlauben), ok, pass (genehmigen), permit (erlauben), print (ausgeben), yes (ja), …), wird der Rechnername benutzt, andernfalls wird er verworfen. Falls ein Schlüssel über keinen Rechnernamen mehr verfügt, dann wird er als Ganzes verworfen.

source: SEE ALSO
de: SIEHE AUCH

source: ssh(1), sshd(8), ssh_config(5), curl(1), rsync(1), psql(1), run-parts(8)
de: B<ssh>(1), B<sshd>(8), B<ssh_config>(5), B<curl>(1), B<rsync>(1), B<psql>(1), B<run-parts>(8)

source: AUTHORS
de: AUTOREN
