Repository: sebras/manpages-l10n
Catalog: po/*/man8/update-locale.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: update-locale - Modify global locale settings
de: update-locale - Globale Locale-Einstellungen verändern

source: update-locale [I<OPTIONS>] [I<var>=I<locale> | I<var>] [...]
de: update-locale [I<OPTIONEN>] [I<Var>=I<Locale> | I<Var>] […]

source: DESCRIPTION
de: BESCHREIBUNG

source: This program can be called by maintainer scripts when Debian packages are installed or removed, it updates the B</etc/default/locale> file to reflect changes in system configuration related to global locale settings. When variables have no value assigned, they are removed from the locale file. Some basic checks are performed to ensure that requested settings are valid.
de: Dieses Programm kann durch Betreuerskripte aufgerufen werden, wenn Debian-Pakete installiert oder entfernt werden. Es aktualisiert die Datei I</etc/default/locale>, um die Änderungen an der Systemkonfiguration im Hinblick zu globalen Locale-Änderungen wiederzuspiegeln. Wenn Variablen kein Wert zugewiesen wurde, werden sie aus der Locale-Datei entfernt. Es werden einige grundlegende Prüfungen durchgeführt, um sicherzustellen, dass die angeforderten Einstellungen gültig sind.

source: OPTIONS
de: OPTIONEN

source: Display an help message and exit.
de: Zeigt eine Hilfemeldung an und beendet das Programm.

source: Variables which are not set on command-line are cleared out.
de: Variablen, die auf der Befehlszeile nicht gesetzt werden, werden bereinigt.

source: B<--locale-file>I< FILE>
de: B<--locale-file>I< DATEI>

source: Define file containing locale variables. (Default: B</etc/default/locale>)
de: Definiert die Datei, die Locale-Variablen enthält. (Vorgabe: I</etc/default/locale>)

source: Do not perform sanity checks on locale variables.
de: Führt für Locale-Variablen keine Plausibilitätsprüfungen durch.

source: EXAMPLE
de: BEISPIEL

source: The command
de: Der Befehl

source: sets B<LANG> to B<en_CA.UTF-8> and removes definitions for B<LANGUAGE>.
de: setzt B<LANG> auf B<en_CA.UTF-8> und entfernt Definitionen für B<LANGUAGE>.

source: FILES
de: DATEIEN

source: File where global locale settings are stored.
de: Datei, in der die globalen Locale-Einstellungen gespeichert werden.

source: AUTHOR
de: AUTOR

source: SEE ALSO
de: SIEHE AUCH

source: locale-gen(8), locale(1)
de: B<locale-gen>(8), B<locale>(1)
