Repository: sebras/manpages-l10n
Catalog: po/*/man8/update-rc.d.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: update-rc.d - install and remove System-V style init script links
de: update-rc.d - System-V-artige Init-Skript-Links installieren und entfernen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<update-rc.d> updates the System V style init script links B</etc/rc>I<runlevel>B<\&.d/>I<NNname> whose target is the script B</etc/init.d/>I<name>\&. These links are run by B<init> when it changes runlevels; they are generally used to start and stop system services such as daemons. I<runlevel> is one of the runlevels supported by B<init>, namely, B<0123456789S>, and I<NN> is the two-digit sequence number that determines where in the sequence B<init> will run the scripts.
de: B<update-rc.d> aktualisiert die System-V-artigen Init-Skripte-Links B</etc/rc>I<Runlevel>B<\&.d/>I<NNName>, deren Ziel das Skript B</etc/init.d/>I<Name> ist\&. Diese Links werden von B<init> ausgeführt, wenn es die Runlevel ändert; sie werden im Allgemeinen zum Starten und Stoppen von Systemdiensten wie Daemons verwandt. I<Runlevel> ist einer der durch B<init> unterstützten Runlevel, konkret B<0123456789S>, und I<NN> ist die zweiziffrige Sequeznummer, die bestimmt, wo in der Sequenz B<init> das Skript ausführen wird.

source: This manpage documents only the usage and behaviour of B<update-rc.d>\&. For a discussion of the System V style init script arrangements please see B<init>(8) and the I<Debian Policy Manual>\&.
de: Diese Handbuchseite dokumentiert nur die Verwendung und das Verhalten von B<update-rc.d>\&. Für eine Besprechung des Aufbaus System-V-artiger Init-Skripte lesen Sie bitte B<init>(8) und das I<Debian Policy Manual>\&.

source: INSTALLING INIT SCRIPT LINKS
de: INIT-SKRIPT-LINKS INSTALLIEREN

source: update-rc.d requires dependency and runlevel information to be provided in the init.d script LSB comment header of all init.d scripts. See the insserv(8) manual page for details about the LSB header format.
de: update-rc.d benötigt, dass Abhängigkeiten und Runlevel-Informationen in LSB-Kommentarkopfzeilen in allen Init.d-Skripten enthalten sind. Lesen Sie die Handbuchseite B<insserv>(8) für Details über das LSB-Kopfzeilenformat.

source: When run with the B<defaults> option, B<update-rc.d> makes links named B</etc/rc>I<runlevel>B<\&.d/[SK]>I<NNname> that point to the script B</etc/init.d/>I<name>, using runlevel and dependency information from the init.d script LSB comment header.
de: Bei der Ausführung mit der Option B<defaults> erstellt B<update-rc.d> unter Verwendung der Runlevel- und Abhängigkeitsinformationen aus den Init.d-Skript-LSB-Kommentarzeilen Links mit Namen B</etc/rc>I<Runlevel>B<\&.d/[SK]>I<NNName>, die auf das Skript B</etc/init.d/>I<Name> zeigen.

source: When run with the B<defaults-disabled> option, B<update-rc.d> makes links named B</etc/rc>I<runlevel>B<\&.d/K>I<NNname> that point to the script B</etc/init.d/>I<name>, using dependency information from the init.d script LSB comment header. This means that the init.d script will be disabled (see below).
de: Bei der Ausführung mit der Option B<defaults-disabled> erstellt B<update-rc.d> unter Verwendung der Runlevel- und Abhängigkeitsinformationen aus den Init.d-Skript-LSB-Kommentarzeilen Links mit Namen B</etc/rc>I<Runlevel>B<\&.d/K>I<NNName>, die auf das Skript B</etc/init.d/>I<name> zeigen. Dies bedeutet, dass das Init.d-Skript deaktiviert wird (siehe unten).

source: If any files named B</etc/rc>I<runlevel>B<\&.d/[SK]??>I<name> already exist then B<update-rc.d> does nothing. The program was written this way so that it will never change an existing configuration, which may have been customized by the system administrator. The program will only install links if none are present, i.e., if it appears that the service has never been installed before.
de: Falls irgendeine Datei namens B</etc/rc>I<Runlevel>B<\&.d/[SK]??>I<Name> bereits existiert, macht B<update-rc.d> nichts. Das Programm wurde so geschrieben, dass es niemals eine bestehende Konfiguration, die vom Systemadministrator angepasst wurde, ändert. Das Programm wird nur Links installieren, falls keine vorhanden sind, d.h. falls es erscheint, als ob der Dienst niemals zuvor installiert wurde.

source: Older versions of B<update-rc.d> also supported B<start> and B<stop> options. These options are no longer supported, and are now equivalent to the B<defaults> option.
de: Ältere Versionen von B<update-rc.d> unterstützten auch die Optionen B<start> und B<stop>. Diese Optionen werden nicht mehr unterstützt und sind nun äquivalent zur Option B<defaults>.

source: A common system administration error is to delete the links with the thought that this will "disable" the service, i.e., that this will prevent the service from being started. However, if all links have been deleted then the next time the package is upgraded, the package\(aqs I<postinst> script will run B<update-rc.d> again and this will reinstall links at their factory default locations. The correct way to disable services is to configure the service as stopped in all runlevels in which it is started by default. In the System V init system this means renaming the service\(aqs symbolic links from B<S> to B<K>\&. \&.P The script \&.BI /etc/init.d/ name must exist before B<update-rc.d> is run to create the links.
de: Ein häufiger Systemadministrationsfehler ist es, die Links zu löschen, in der Annahme, damit den Dienst zu »deaktivieren«, d.h. den Dienst am Starten zu hindern. Falls allerdings alle Links gelöscht wurden, dann wird das Paket beim nächsten Upgrade im Skript I<postinst> bei der Ausführung von B<update-rc.d> alle Links wieder in ihren Auslieferungszustand (ihren Vorgabeorten) reinstallieren. Die korrekte Art, einen Dienst zu deaktivieren, ist es, den Dienst als in allen Runleveln, in denen er standardmäßig starten würde, als gestoppt zu konfigurieren. Im System-V-Init-System bedeutet dies, die symbolischen Links des Dienstes von B<S> nach B<K> umzubenennen\&. \&.P Der Name des Skripts \&.BI /etc/init.d/ muss existieren, bevor B<update-rc.d> ausgeführt wird, um die Links zu erstellen.

source: REMOVING SCRIPTS
de: SKRIPTE ENTFERNEN

source: When invoked with the I<remove> option, update-rc.d removes any links in the B</etc/rc>I<runlevel>B<\&.d> directories to the script B</etc/init.d/>I<name>\&. The script must have been deleted already. If the script is still present then B<update-rc.d> aborts with an error message. \&.P B<update-rc.d> is usually called from a package\(aqs post-removal script when that script is given the B<purge> argument. Any files in the B</etc/rc>I<runlevel>B<\&.d> directories that are not symbolic links to the script B</etc/init.d/>I<name> will be left untouched.
de: Beim Aufruf mit der Option I<remove> entfernt B<update-rc.d> alle Links auf das Skript B</etc/init.d/>I<Name> in den Verzeichnissen B</etc/rc>I<Runlevel>B<\&.d>\&. Das Skript muss bereits gelöscht worden sein. Falls das Skript noch vorhanden ist, bricht B<update-rc.d> mit einer Fehlermeldung ab. \&.P B<update-rc.d> wird normalerweise vom Skript »post-removal« des Pakets aufgerufen, wenn dem Skript das Argument B<purge> übergeben wird. Alle Dateien in den Verzeichnissen B</etc/rc>I<runlevel>B<\&.d>, die keine symbolischen Links auf B</etc/init.d/>I<Name> sind, werden nicht verändert.

source: DISABLING INIT SCRIPT START LINKS
de: DEAKTIVEREN VON INIT-SKRIPT-START-LINKS

source: When run with the B<disable> [ I<S|2|3|4|5> ] options, B<update-rc.d> modifies existing runlevel links for the script B</etc/init.d/>I<name> by renaming start links to stop links with a sequence number equal to the difference of 100 minus the original sequence number.
de: Bei der Ausführung mit den Optionen B<disable> [ I<S|2|3|4|5> ] verändert B<update-rc.d> bestehende Runlevel-Links für das Skript B</etc/init.d/>I<Name> durch Umbenennung von Start-Links in Stop-Links mit Sequenznummer, die identisch zur Differenz von 100 Minus der ursprünglichen Sequenznummer sind.

source: When run with the B<enable> [ I<S|2|3|4|5> ] options, B<update-rc.d> modifies existing runlevel links for the script B</etc/init.d/>I<name> by renaming stop links to start links with a sequence number equal to the positive difference of current sequence number minus 100, thus returning to the original sequence number that the script had been installed with before disabling it. \&.P Both of these options only operate on start runlevel links of S, 2, 3, 4 or 5. If no start runlevel is specified after the disable or enable keywords, the script will attempt to modify links in all start runlevels.
de: Bei der Ausführung mit den Optionen B<enable> [ I<S|2|3|4|5> ] verändert B<update-rc.d> bestehende Runlevel-Links für das Skript B</etc/init.d/>I<Name> durch Umbenennung der Stop-Links auf Start-Links mit einer Sequenznummer, die identisch zur positiven Differenz der aktuellen Sequenznummer minus 100 ist und liefert daher die ursprüngliche Sequenznummer zurück, mit der das Skript vor der Deaktivierung installiert wurde. \&.P Beide dieser Optionen agieren nur auf den Runlevel-Links S, 2, 3, 4 oder 5. Falls kein Start-Runlevel nach dem Schlüsselwort »disable« oder »enable« angegeben wurde, werden die Skripte versuchen, alle Links in allen Start-Runleveln zu verändern.

source: OPTIONS
de: OPTIONEN

source: Force removal of symlinks even if B</etc/init.d/>I<name> still exists.
de: Erzwingt die Entfernung von Symlinks, selbst falls B</etc/init.d/>I<Name> noch existiert.

source: EXAMPLES
de: BEISPIELE

source: Insert links using the defaults:
de: Links gemäß den Vorgaben einfügen:

source: The equivalent dependency header would have start and stop dependencies on $remote_fs and $syslog, and start in runlevels 2-5 and stop in runlevels 0, 1 and 6.
de: Die äquivalenten Abhängigkeitskopfzeilen hätten Start- und Stopp-Abhängigkeiten auf $remote_fs und $syslog und starten in Runleveln 2-5 und Stoppen in Runleveln 0, 1 und 6.

source: Remove all links for a script (assuming foobar has been deleted already):
de: Alle Links für ein Skript entfernen (unter der Annahme, dass foobar bereits gelöscht wurde):

source: Example of disabling a service:
de: Beispiel für das Deaktivieren eines Dienstes:

source: Example of a command for installing a system initialization-and-shutdown script:
de: Beispiel für einen Befehl zur Installation eines System-Initialisierungs-und-Herunterfahr-Skriptes:

source: Example of a command for disabling a system initialization-and-shutdown script:
de: Beispiel für einen Befehl zum Deaktivieren eines System-Initialisierungs-und-Herunterfahr-Skriptes:

source: BUGS
de: FEHLER

source: See I<\%http://bugs.debian.org/sysv-rc> and I<\%http://bugs.debian.org/init-system-helpers>\&.
de: Siehe I<\%http://bugs.debian.org/sysv-rc> und I<\%http://bugs.debian.org/init-system-helpers>\&.

source: FILES
de: DATEIEN

source: The directory containing the actual init scripts.
de: Das Verzeichnis, das die eigentlichen Init-Skripte enthält.

source: The directories containing the links used by B<init> and managed by B<update-rc.d .>
de: Die Verzeichnisse, die die von B<init> verwandten und durch B<update-rc.d> verwalteten Links enthält.

source: Model for use by writers of B<init.d> scripts.
de: Modell für die Verwendung durch Autoren von B<init.d>-Skripten.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: Licence: GNU Public Licence v2 or Later (GPLv2+)
de: Lizenz: GNU General Public License v2 oder neuer (GPLv2+)

source: License: GNU General Public License v2 or Later (GPLv2+)
de: Lizenz: GNU General Public License v2 oder neuer (GPLv2+)
