Repository: sebras/manpages-l10n
Catalog: po/*/man8/uucico.8.po
Languages: pl

source: NAME
pl: NAZWA

source: uucico - UUCP file transfer daemon
pl: uucico - demon transferów plików UUCP

source: SYNOPSIS
pl: SKŁADNIA

source: B<uucico> [ options ]
pl: B<uucico> [ opcje ]

source: DESCRIPTION
pl: OPIS

source: The I<uucico> daemon processes file transfer requests queued by I<uucp> (1) and I<uux> (1). It is started when I<uucp> or I<uux> is run (unless they are given the B<-r> option). It is also typically started periodically using entries in the I<crontab> table(s).
pl: Demon I<uucico> przetwarza żądania transferów plików skolejkowane przez polecenia I<uucp>(1) i I<uux>(1). Jest uruchamiany, gdy wywołane zostanie I<uucp> lub I<uux> (chyba że przekazana im zostanie opcja B<-r>). Jest również często uruchamiany periodycznie przy użyciu tabel I<crontab>.

source: When invoked with B<-r1,> B<--master,> B<-s,> B<--system,> or B<-S,> the daemon will place a call to a remote system, running in master mode. Otherwise the daemon will start in slave mode, accepting a call from a remote system. Typically a special login name will be set up for UUCP which automatically invokes I<uucico> when a call is made.
pl: Podczas uruchomienia z opcjami B<-r1>, B<--master>, B<-s>, B<--system> lub B<-S>, demon zapoczątkuje połączenie telefoniczne ze zdalnym systemem, pracując w trybie master. W przeciwnym wypadku, demon uruchomi się w trybie biernym, przyjmując połączenie ze zdalnego systemu. Zazwyczaj konfigurowany jest specjalny użytkownik dla UUCP, który automatycznie uruchamia I<uucico> podczas połączenia.

source: When I<uucico> terminates, it invokes the I<uuxqt> (8) daemon, unless the B<-q> or B<--nouuxqt> option is given; I<uuxqt> (8) executes any work orders created by I<uux> (1) on a remote system, and any work orders created locally which have received remote files for which they were waiting.
pl: Gdy I<uucico> kończy działanie, wywołuje demona I<uuxqt>(8), chyba że podano mu opcję B<-q> lub B<--nouuxqt>; I<uuxqt>(8) wykonuje wszelkie żądania zadań utworzone przez I<uux>(1) na zdalnym komputerze i wszelkie zadania utworzone lokalnie, które otrzymały zdalne pliki, na które oczekiwały.

source: The B<-l,> B<--prompt,> B<-e,> or B<--loop> options may be used to force I<uucico> to produce its own prompts of "login: " and "Password:". When another daemon calls in, it will see these prompts and log in as usual. The login name and password will normally be checked against a separate list kept specially for I<uucico> rather than the I</etc/passwd> file; it is possible on some systems to direct I<uucico> to use the I</etc/passwd> file. The B<-l> or B<--prompt> option will prompt once and then exit; in this mode the UUCP administrator or the superuser may use the B<-u> or B<--login> option to force a login name, in which case I<uucico> will not prompt for one. The B<-e> or B<--loop> option will prompt again after the first session is over; in this mode I<uucico> will permanently control a port.
pl: Opcji B<-l>, B<--prompt>, B<-e> lub B<--loop> można użyć do zmuszenia I<uucico> do przedstawienia swoich własnych zachęt zamiast "Login:" i "Password:". Gdy dzwoni inny demon, ujrzy on te zachęty i zaloguje się jak zwykle. Nazwa użytkownika i hasło będą sprawdzane w oddzielnej liście I<uucico> zamiast w pliku I</etc/passwd>; jest jednak możliwe na większości systemów doprowadzenie I<uucico> do korzystania z pliku I</etc/passwd>. Opcje B<-l> lub B<--prompt> przedstawią zachętę jednorazowo, a potem zakończą działanie. W tym trybie administrator UUCP lub superużytkownik może użyć opcji B<-u> lub B<--login> aby wymusić nazwę użytkownika, wówczas I<uucico> nie będzie o nią pytać. Opcja B<-e> lub B<--loop> będzie pytać gdy pierwsza sesja zostanie zakończona; w tym trybie I<uucico> będzie stale kontrolować port.

source: If I<uucico> receives a SIGQUIT, SIGTERM or SIGPIPE signal, it will cleanly abort any current conversation with a remote system and exit. If it receives a SIGHUP signal it will abort any current conversation, but will continue to place calls to (if invoked with B<-r1> or B<--master)> and accept calls from (if invoked with B<-e> or B<--loop)> other systems. If it receives a SIGINT signal it will finish the current conversation, but will not place or accept any more calls.
pl: Jeśli I<uucico> otrzyma sygnał SIGQUIT, SIGTERM lub SIGPIPE, to zakończy czysto każdą bieżącą konwersację ze zdalnym systemem i zakończy pracę. Jeśli otrzyma sygnał SIGHUP, przerwie każdą konwersację, lecz będzie wciąż dzwonić (jeśli wywołane z opcjami B<-r1> lub B<--master>) i przyjmować połączenia telefoniczne (jeśli wywołane z opcjami B<-e> lub B<--loop>) innych systemów. Jeśli otrzyma sygnał SIGINT, zakończy bieżącą konwersację, lecz nie będzie już dokonywać lub odbierać innych połączeń.

source: OPTIONS
pl: OPCJE

source: The following options may be given to I<uucico.>
pl: Programowi I<uucico> można przekazać następujące opcje:

source: B<-r1, --master>
pl: B<-r1>, B<--master>

source: Start in master mode (call out to a system); implied by B<-s,> B<--system,> or B<-S.> If no system is specified, call any system for which work is waiting to be done.
pl: Uruchamia się w trybie master (dzwoni do systemu); implikowane przez B<-s>, B<--system> lub B<-S>. Jeśli nie podano systemu, dzwoni do dowolnego systemu, dla którego oczekuje jakieś zadanie.

source: B<-r0, --slave>
pl: B<-r0>, B<--slave>

source: Start in slave mode. This is the default.
pl: Uruchamia się w trybie biernym. Tak jest domyślnie.

source: B<-s system, --system system>
pl: B<-s> I<system>, B<--system> I<system>

source: Call the named system.
pl: Łączy się z podanym systemem.

source: B<-S system>
pl: B<-S> I<system>

source: Call the named system, ignoring any required wait. This is equivalent to B<-s system -f.>
pl: Dzwoni do podanego systemu, ignorując wszelkie okresy oczekiwania. Jest to równoważne B<-s system -f>.

source: Ignore any required wait for any systems to be called.
pl: Ignoruje wszelkie wymagane oczekiwania na zadzwonienie do jakichkolwiek systemów.

source: B<-l, --prompt>
pl: B<-l>, B<--prompt>

source: Prompt for login name and password using "login: " and "Password:". This allows I<uucico> to be easily run from I<inetd> (8). The login name and password are checked against the UUCP password file, which probably has no connection to the file I</etc/passwd.> The B<--login> option may be used to force a login name, in which cause I<uucico> will only prompt for a password.
pl: Pyta o nazwę użytkownika i hasło przy użyciu "login:" i "Password:". Umożliwia uruchamianie I<uucico> z I<inetd>(8). Nazwa użytkownika i hasło są sprawdzane według pliku z hasłami, należącego do UUCP, które najprawdopodobniej nie ma żadnego związku z plikiem I</etc/passwd>. Opcja B<--login> może być używana do wymuszania nazwy użytkownika - wówczas I<uucico> zapyta tylko o hasło.

source: B<-p port, --port port>
pl: B<-p> I<port>, B<--port> I<port>

source: Specify a port to call out on or to listen to.
pl: Podaje port, do którego dzwonić lub na którym nasłuchiwać.

source: B<-e, --loop>
pl: B<-e>, B<--loop>

source: Enter endless loop of login/password prompts and slave mode daemon execution. The program will not stop by itself; you must use I<kill> (1) to shut it down.
pl: Wchodzi w nieskończoną pętlę zapytań o login/password i uruchamia się w trybie biernym. Program nie zatrzyma się sam z siebie; trzeba użyć polecenia I<kill>(1), aby go zamknąć.

source: B<-w, --wait>
pl: B<-w>, B<--wait>

source: B<-q, --nouuxqt>
pl: B<-q>, B<--nouuxqt>

source: Do not start the I<uuxqt> (8) daemon when finished.
pl: Nie uruchamia demona I<uuxqt>(8) po zakończeniu.

source: B<-c, --quiet>
pl: B<-c>, B<--quiet>

source: If no calls are permitted at this time, then don't make the call, but also do not put an error message in the log file and do not update the system status (as reported by I<uustat> (1)). This can be convenient for automated polling scripts, which may want to simply attempt to call every system rather than worry about which particular systems may be called at the moment. This option also suppresses the log message indicating that there is no work to be done.
pl: Jeśli o tej porze nie są dozwolone połączenia, nie wykonuje połączenia, lecz również nie daje informacji o błędzie do pliku dziennika i nie odnawiaj statusu systemu (zgłaszanego przez I<uustat>(1)). Może to mieć zastosowanie dla automatyzowania skryptów, które mogą po prostu próbować dzwonić do każdego systemu niż martwić się o to, do którego w danej chwili można zadzwonić. Opcja ta eliminuje również informację dziennika, wskazującą, że nie ma już zadań do wykonania.

source: B<-C, --ifwork>
pl: B<-C>, B<--ifwork>

source: Only call the system named by B<-s,> B<--system> or B<-S> if there is work for that system.
pl: zwoni do systemów podanych przez B<-s>, B<--system> lub B<-S> jedynie w wypadku, gdy są dla nich jakieś zadania.

source: B<-D, --nodetach>
pl: B<-D>, B<--nodetach>

source: Do not detach from the controlling terminal. Normally I<uucico> detaches from the terminal before each call out to another system and before invoking I<uuxqt.> This option prevents this.
pl: Nie odłącza się od kontrolującego terminala. Normalnie I<uucico> odłącza się od terminala przed jakimkolwiek wydzwonieniem do innego systemu i przed wywołaniem I<uuxqt>. Opcja ta eliminuje takie zachowanie.

source: B<-u name, --login name>
pl: B<-u> I<nazwa>, B<--login> I<nazwa>

source: Set the login name to use instead of that of the invoking user. This option may only be used by the UUCP administrator or the superuser. If used with B<--prompt,> this will cause I<uucico> to prompt only for the password, not the login name.
pl: Ustawia nazwę logującego się użytkownika. Będzie ona użyta zamiast pobranej nazwy wywołującego użytkownika. Tej opcji może użyć tylko administrator UUCP lub superużytkownik. Jeśli zastosowano ją w połączeniu z B<--prompt>, to spowoduje, że I<uucico> zapyta tylko o hasło, pomijając nazwę użytkownika.

source: B<-z, --try-next>
pl: B<-z>, B<--try-next>

source: If a call fails after the remote system is reached, try the next alternate rather than simply exiting.
pl: Jeśli połączenie się nie uda po osiągnięciu zdalnego systemu, próbuje następnej alternatywy zamiast po prostu zakończyć.

source: B<-i type, --stdin type>
pl: B<-i> I<typ>, B<--stdin> I<typ>

source: Set the type of port to use when using standard input. The only support port type is TLI, and this is only available on machines which support the TLI networking interface. Specifying B<-iTLI> causes I<uucico> to use TLI calls to perform I/O.
pl: Ustawia typ portu wykorzystywanego podczas używania standardowego wejścia. Jedynym obsługiwanym typem jest TLI i jest on dostępny tylko na maszynach obsługujących ten interfejs sieciowy. Podanie B<-iTLI> powoduje, że I<uucico> zacznie używać wywołań TLI do dokonywania wejścia/wyjścia.

source: B<-x type, -X type, --debug type>
pl: B<-x> I<typ>, B<-X> I<typ>, B<--debug> I<typ>

source: Turn on particular debugging types. The following types are recognized: abnormal, chat, handshake, uucp-proto, proto, port, config, spooldir, execute, incoming, outgoing.
pl: Włącza dany rodzaj diagnostyki. Rozpoznawane są następujące: B<abnormal>, B<chat>, B<handshake>, B<uucp-proto>, B<proto>, B<port>, B<config>, B<spooldir>, B<execute>, B<incoming>, B<outgoing>.

source: Multiple types may be given, separated by commas, and the B<--debug> option may appear multiple times. A number may also be given, which will turn on that many types from the foregoing list; for example, B<--debug 2> is equivalent to B<--debug abnormal,chat.>
pl: Można podawać wiele typów rozdzielonych przecinkami, a opcja B<--debug> może pojawić się wiele razy. Można podać także liczbę, która włączy kolejne typy powyższej listy; np, B<--debug 2> jest równoważne B<--debug abnormal,chat>.

source: The debugging output is sent to the debugging file, which may be printed using I<uulog -D.>
pl: Wyjście diagnostyczne jest wysyłane do pliku informacji diagnostycznych, który można wypisać poleceniem I<uulog -D>.

source: B<-I file, --config file>
pl: B<-I> I<plik>, B<--config> I<plik>

source: Set configuration file to use. This option may not be available, depending upon how I<uucico> was compiled.
pl: Wskazuje plik konfiguracyjny, z którego ma korzystać program. Opcja ta może nie być dostępna, zależnie od tego, jak skompilowano I<uucico>.

source: Report version information and exit.
pl: Pokazuje informację o wersji programu i kończy działanie.

source: Print a help message and exit.
pl: Wyświetla komunikat pomocy i wychodzi.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR

source: If a call fails, I<uucico> will normally refuse to retry the call until a certain (configurable) amount of time has passed. This may be overridden by the B<-f,> B<--force,> or B<-S> option.
pl: Jeśli połączenie się nie uda, I<uucico> odmówi ponowienia połączenia, dopóki nie minie określona (konfigurowalna) ilość czasu. Może to być przesłonięte opcjami B<-f>, B<--force> lub B<-S>.

source: After calling out (to a particular system when B<-s,> B<--system,> or B<-S> is specified, or to all systems which have work when just B<-r1> or B<--master> is specified), begin an endless loop as with B<--loop.>
pl: Po wydzwonieniu (do danego systemu, po otrzymaniu opcji B<-s>, B<--system> lub B<-S>, lub do wszystkich systemów, które mają zadania, gdy podano tylko B<-r1> lub B<--master>), rozpoczyna nieskończoną pętlę, jak przy B<--loop>.
