Repository: sebras/manpages-l10n
Catalog: po/*/man8/uuxqt.8.po
Languages: pl

source: NAME
pl: NAZWA

source: uuxqt - UUCP execution daemon
pl: uuxqt - demon wywołania UUCP

source: SYNOPSIS
pl: SKŁADNIA

source: B<uuxqt> [ options ]
pl: B<uuxqt> [I<opcje>]

source: DESCRIPTION
pl: OPIS

source: The I<uuxqt> daemon executes commands requested by I<uux> (1) from either the local system or from remote systems. It is started automatically by the I<uucico> (8) daemon (unless I<uucico> (8) is given the B<-q> or B<--nouuxqt> option).
pl: Demon B<uuxqt> wywołuje polecenia zażądane przez B<uux>(1) z zarówno lokalnego systemu, jak i systemów zdalnych. Jest uruchamiany automatycznie przez demona B<uucico>(8) (chyba że B<uucico>(8) zostało wywołane z opcją B<-q> lub B<--nouuxqt>).

source: There is normally no need to run this command, since it will be invoked by I<uucico> (8). However, it can be used to provide greater control over the processing of the work queue.
pl: Zazwyczaj nie ma potrzeby wywoływania tego polecenia, gdyż jest ono wywoływane przez B<uucico>(8). Jednak czasem może być używane do zyskania większej kontroli nad przetwarzaniem kolejki zadań.

source: Multiple invocations of I<uuxqt> may be run at once, as controlled by the I<max-uuxqts> configuration command.
pl: Wielokrotne wywołania B<uuxqt> mogą pracować naraz, pod kontrolą polecenia konfiguracyjnego B<max-uuxqts>.

source: OPTIONS
pl: OPCJE

source: The following options may be given to I<uuxqt.>
pl: B<uuxqt> można przekazać następujące opcje:

source: B<-c command, --command command>
pl: B<-c> I<polecenie>, B<--command> I<polecenie>

source: Only execute requests for the specified command. For example:
pl: Wykonuje tylko żądania podanego polecenia. Na przykład:

source: B<-s system, --system system>
pl: B<-s> I<system>, B<--system> I<system>

source: Only execute requests originating from the specified system.
pl: Wywołuje tylko żądania pochodzące z podanego systemu.

source: B<-x type, --debug type>
pl: B<-x> I<typ>, B<--debug> I<typ>

source: Turn on particular debugging types. The following types are recognized: abnormal, chat, handshake, uucp-proto, proto, port, config, spooldir, execute, incoming, outgoing. Only abnormal, config, spooldir and execute are meaningful for I<uuxqt.>
pl: Włącza generowanie informacji diagnostycznych zadanego rodzaju. Rozpoznawane są następujące: B<abnormal>, B<chat>, B<handshake>, B<uucp-proto>, B<proto>, B<port>, B<config>, B<spooldir>, B<execute>, B<incoming>, B<outgoing>. Dla programu znaczenie mają tylko B<abnormal>, B<config>, B<spooldir> i B<execute>.

source: Multiple types may be given, separated by commas, and the B<--debug> option may appear multiple times. A number may also be given, which will turn on that many types from the foregoing list; for example, B<--debug 2> is equivalent to B<--debug abnormal,chat.>
pl: Można podać wiele typów pooddzielanych przecinkami, a opcja B<--debug> może pojawić się wielokrotnie. Można podać również liczbę, która włączy kolejne rodzaje z powyższej listy; na przykład, B<--debug 2> jest równoważne B<--debug abnormal,chat>.

source: The debugging output is sent to the debugging file, which may be printed using I<uulog -D.>
pl: Wyjście diagnostyczne jest wysyłane do pliku informacji diagnostycznych, który można wypisać poleceniem B<uulog -D>.

source: B<-I file, --config>
pl: B<-I> I<plik>, B<--config> I<plik>

source: Set configuration file to use. This option may not be available, depending upon how I<uuxqt> was compiled.
pl: Wskazuje plik konfiguracyjny, z którego ma korzystać program. Opcja ta może być niedostępna, zależnie od tego, jak skompilowano B<uuxqt>.

source: Report version information and exit.
pl: Wypisuje wersję i kończy pracę.

source: Print a help message and exit.
pl: Wyświetla komunikat pomocy i wychodzi.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR
