Repository: sebras/manpages-l10n
Catalog: po/*/man8/wipefs.8.po
Languages: de, uk

source: System Administration
uk: Керування системою

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: wipefs - wipe a signature from a device
de: wipefs - eine Signatur von einem Gerät löschen
uk: wipefs — витирання підпису з пристрою

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: B<wipefs> [options] I<device>...
de: B<wipefs> [Optionen] I<Gerät> …
uk: B<wipefs> [параметри] I<пристрій>...

source: B<wipefs> [B<--backup>] B<-o> I<offset device>...
de: B<wipefs> [B<--backup>] B<-o> I<Versatz> I<Gerät>…
uk: B<wipefs> [B<--backup>] B<-o> I<зсув пристрій>...

source: B<wipefs> [B<--backup>] B<-a> I<device>...
de: B<wipefs> [B<--backup>] B<-a> I<Gerät>…
uk: B<wipefs> [B<--backup>] B<-a> I<пристрій>...

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: B<wipefs> can erase filesystem, raid or partition-table signatures (magic strings) from the specified I<device> to make the signatures invisible for libblkid. B<wipefs> does not erase the filesystem itself nor any other data from the device.
de: B<wipefs> kann die Signaturen von Dateisystemen, RAID oder Partitionstabellen (magische Zeichenketten) vom angegebenen I<Gerät> löschen, um diese für libblkid unsichtbar zu machen. B<wipefs> löscht nicht das Dateisystem selbst oder irgendwelche andere Daten von dem Gerät.
uk: B<wipefs> може витерти підписи файлової системи, raid або таблиці розділів (контрольні рядки) із вказаного I<пристрою>, щоб зробити підписи невидимими для libblkid. B<wipefs> не витирає саму файлову систему і не витирає будь-які інші файли з пристрою.

source: When used without any options, B<wipefs> lists all visible filesystems and the offsets of their basic signatures. The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using B<--output> I<columns-list> in environments where a stable output is required.
de: Werden keine Optionen verwandt, wird B<wipefs> alle sichtbaren Dateisysteme und deren Versatz auf der Basis grundlegender Signaturen auflisten. Die Vorgabeausgabe kann sich ändern. Daher sollten Sie wann immer möglich vermeiden, die Vorgabeausgabe in Skripten zu verwenden. Definieren Sie in Umgebungen, in denen eine stabile Ausgabe benötigt wird, immer explizit die Spalten mittels B<--output> I<Spaltenliste>.
uk: Якщо використано без будь-яких параметрів, B<wipefs> виводить список усіх видимих файлових систем і відступів їхніх базових підписів. Типовий формат виведення може бути змінено авторами програми. Тому, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> I<список-стовпчиків> у середовищах, де потрібне виведення стабільного набору даних.

source: B<wipefs> calls the B<BLKRRPART> ioctl when it has erased a partition-table signature to inform the kernel about the change. The ioctl is called as the last step and when all specified signatures from all specified devices are already erased. This feature can be used to wipe content on partitions devices as well as partition table on a disk device, for example by B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
de: B<wipefs> ruft das B<BLKRRPART>-Ioctl nach dem Löschen einer Partitionstabelle auf, um den Kernel über die Änderung zu informieren. Der Ioctl wird zuletzt aufgerufen und wenn alle angegebenen Signaturen von allen angegebenen Geräten bereits gelöscht sind. Mit dieser Funktion können sowohl Inhalte von Partitionen als auch Partitionstabellen auf Plattenlaufwerken gelöscht werden, zum Beispiel mit B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
uk: B<wipefs> викликає керування введенням-виведенням B<BLKRRPART> при витиранні підпису таблиці розділів, щоб проінформувати ядро про зміни. Керування введенням-виведенням (ioctl) буде викликано на останньому кроці, коли усі вказані підписи з усіх вказаних пристроїв вже буде витерто. Цією можливістю можна скористатися для витирання даних на усіх пристроях розділів, а також у таблиці розділів на пристрої диска, наприклад, за допомогою команди B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.

source: Note that some filesystems and some partition tables store more magic strings on the device (e.g., FAT, ZFS, GPT). The B<wipefs> command (since v2.31) lists all the offset where a magic strings have been detected.
de: Beachten Sie, dass einige Dateisysteme und einige Partitionstabellen (z.B. FAT, ZFS, GPT) mehr magische Zeichenketten auf dem Gerät speichern. Der Befehl B<wipefs> listet (seit v2.31) alle Versätze auf, an denen magische Zeichenketten erkannt wurden.
uk: Зауважте, що у деяких файлових системах та деяких таблицях розділів (наприклад, FAT, ZFS, GPT) зберігаються додаткові контрольні рядки на пристрої. Команда B<wipefs> (починаючи з версії 2.31) виводить список усіх відступів у даних, за якими було виявлено контрольні рядки.

source: When option B<-a> is used, all magic strings that are visible for B<libblkid>(3) are erased. In this case the B<wipefs> scans the device again after each modification (erase) until no magic string is found.
de: Mit der Option B<-a> werden alle für B<libblkid>(3) sichtbaren magischen Zeichenketten gelöscht. In diesem Fall durchsucht B<wipefs> das Gerät erneut nach einer Änderung (Löschen), bis keine magische Zeichenkette gefunden wird.
uk: Якщо використано параметр B<-a>, усі контрольні рядки, які є видимими для B<libblkid>(3), буде вилучено. У випадку використання цього параметра B<wipefs> виконуватиме повторне сканування пристрою після внесення кожної зміни (витирання), аж доки не закінчаться контрольні рядки.

source: Note that by default B<wipefs> does not erase nested partition tables on non-whole disk devices. For this the option B<--force> is required.
de: Beachten Sie, dass B<wipefs> keine verschachtelten Partitionstabellen auf Geräteteilen löscht. Die Option B<--force> wird dazu benötigt.
uk: Зауважте, що типово B<wipefs> не витиратиме вкладені таблиці розділів на пристроях, які не займають усього диска. Для такого витирання слід вказати параметр B<--force>.

source: OPTIONS
de: OPTIONEN
uk: ПАРАМЕТРИ

source: Erase all available signatures. The set of erased signatures can be restricted with the B<-t> option.
de: löscht alle verfügbaren Signaturen. Die zu löschenden Signaturen können mit der Option B<-t> eingegrenzt werden.
uk: Витерти усі доступні підписи. Набір витертих підписів можна обмежити за допомогою параметра B<-t>.

source: Create a signature backup to the file I<$HOME/wipefs-E<lt>devnameE<gt>-E<lt>offsetE<gt>.bak>. For more details see the B<EXAMPLE> section.
de: erstellt eine Sicherung der Signatur in der Datei I<$HOME/wipefs-E<lt>GerätenameE<gt>-E<lt>VersatzE<gt>.bak>. Weitere Details finden Sie im Abschnitt B<BEISPIELE>.
uk: Створити резервну копію підпису до файла I<$HOME/wipefs-E<lt>назва-пристроюE<gt>-E<lt>відступE<gt>.bak>. Щоб дізнатися більше, див. розділ B<ПРИКЛАД>.

source: Force erasure, even if the filesystem is mounted. This is required in order to erase a partition-table signature on a block device.
de: erzwingt das Löschen selbst dann, wenn das Dateisystem eingehängt ist. Dies ist notwendig, um die Partitionstabellensignatur eines blockorientierten Gerätes löschen zu können.
uk: Примусове витирання, навіть якщо файлову систему змонтовано. Таке витирання потрібне для витирання підпису таблиці розділів на блоковому пристрої.

source: Use JSON output format.
de: verwendet das JSON-Ausgabeformat.
uk: Bикористати формат виведення JSON.

source: B<--lock>[=I<mode>]
de: B<--lock>[=I<Modus>]
uk: B<--lock>[=I<режим>]

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<"yes">. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it\(cqs recommended to avoid collisions with udevd or other tools.
de: verwendet eine exklusive BSD-Sperre für das Gerät oder die Datei, auf dem/der es agiert. Das optionale Argument I<Modus> kann B<yes>, B<no> (oder 1 und 0) oder B<nonblock> sein. Falls das Argument I<Modus> weggelassen wird, wird standardmäßig B<yes> angenommen. Diese Option setzt die Umgebungsvariable B<$LOCK_BLOCK_DEVICE> außer Kraft. Standardmäßig wird überhaupt keine Sperre gesetzt, dies wird aber empfohlen, um Kollisionen mit Udevd zu vermeiden.
uk: Скористатися виключним блокуванням BSD для пристрою або файла, який ним керує. Значенням додаткового аргументу I<режим> може бути B<yes>, B<no> (або 1 і 0) чи B<nonblock>. Якщо пропустити аргумент I<режим>, типовим значенням буде B<"yes">. Цей параметр переписує змінну середовища B<$LOCK_BLOCK_DEVICE>. Типовим станом є невикористання блокування, але рекомендуємо уникати конфліктів із udevd або іншими програмами.

source: Do not print a header line.
de: unterdrückt die Ausgabe einer Kopfzeile.
uk: Не виводити рядок заголовка.

source: B<-O>, B<--output> I<list>
de: B<-O>, B<--output> I<Liste>
uk: B<-O>, B<--output> I<список>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns.
de: gibt die anzuzeigenden Spalten an. Mit B<--help> erhalten Sie eine Liste aller unterstützten Spalten.
uk: Визначити, які стовпчики слід використовувати для виведення. Скористайтеся параметром B<--help>, щоб переглянути список підтримуваних стовпчиків.

source: Causes everything to be done except for the B<write>(2) call.
de: sorgt dafür, dass alles erledigt wird, bis auf den endgültigen Aufruf von B<write>(2).
uk: Виконати усі дії, окрім виклику B<write>(2).

source: B<-o>, B<--offset> I<offset>
de: B<-o>, B<--offset> I<Versatz>
uk: B<-o>, B<--offset> I<відступ>

source: Specify the location (in bytes) of the signature which should be erased from the device. The I<offset> number may include a "0x" prefix; then the number will be interpreted as a hex value. It is possible to specify multiple B<-o> options.
de: gibt den Ort der Signatur (in Bytes) an, die vom Gerät gelöscht werden soll. Die Zahl für I<Versatz> kann ein Präfix »0x« enthalten, so dass die Zahl als Hexadezimalwert interpretiert iwrd. Es ist möglich, die Option B<-o> mehrmals anzugeben.
uk: Вказати місце (у байтах) підпису, який слід витерти з пристрою. Число I<відступ> може включати префікс «0x». Якщо такий префікс вказано, число вважатиметься шістнадцятковим значенням. Можна вказати декілька параметрів B<-o> в одній команді.

source: The I<offset> argument may be followed by the multiplicative suffixes KiB (=1024), MiB (=1024*1024), and so on for GiB, TiB, PiB, EiB, ZiB and YiB (the "iB" is optional, e.g., "K" has the same meaning as "KiB"), or the suffixes KB (=1000), MB (=1000*1000), and so on for GB, TB, PB, EB, ZB and YB.
de: Auf das Argument I<Versatz> können die binären (2^N) Suffixe KiB (=1024), MiB (=1024*1024) und so weiter für GiB, TiB, PiB und EiB folgen (das »iB« ist optional, so dass zum Beispiel »K« gleichbedeutend mit »KiB« ist) oder die dezimalen Suffixe KB (=1000), MB (=1000*1000) und so weiter für GB, PB und EB.
uk: Після аргументу I<відступ> можна додавати суфікси одиниць KiB (=1024), MiB (=1024*1024) тощо для GiB, TiB, PiB, EiB, ZiB та YiB (частина «iB» є необов'язковою, наприклад, «K» є тим самим, що і «KiB») або суфікси KB (=1000), MB (=1000*1000) тощо для GB, TB, PB, EB, ZB і YB.

source: Print out in parsable instead of printable format. Encode all potentially unsafe characters of a string to the corresponding hex value prefixed by \(aq\(rsx\(aq.
de: veranlasst die Ausgabe in einem auswertbaren anstatt menschenlesbaren Format. Alle potenziell unsicheren Zeichen einer Zeichenkette werden in den korrespondierenden Hexadezimalwert umgewandelt, indem das Präfix »\(rsx« vorangestellt wird.
uk: Вивести придатні для обробки дані замість придатного для перегляду формату. Закодувати потенційно небезпечні символи рядка до відповідних шістнадцяткових значень із префіксом «\(rsx».

source: Suppress any messages after a successful signature wipe.
de: unterdrückt die Ausgabe vom Meldungen nach dem erfolgreichen Löschen der Signatur.
uk: Придушити усі повідомлення після успішного витирання підпису.

source: B<-t>, B<--types> I<list>
de: B<-t>, B<--types> I<Liste>
uk: B<-t>, B<--types> I<список>

source: Limit the set of printed or erased signatures. More than one type may be specified in a comma-separated list. The list or individual types can be prefixed with \(aqno\(aq to specify the types on which no action should be taken. For more details see B<mount>(8).
de: grenzt die ausgegebenen oder zu löschenden Signaturen ein. Es können in einer durch Kommata getrennten Liste mehrere Typen angegeben werden. Der Liste oder den angegebenen Typen kann ein »no« vorangestellt werden, um die Typen anzugeben, für die keine Aktion ausgeführt werden soll. Weitere Details finden Sie in B<mount>(8).
uk: Обмежити набір виведених або витертих підписів. У списку відокремлених комами значень можна вказувати декілька типів. До списку або окремих типів можна додати префікс «no», щоб визначити типи, до яких не слід застосовувати дії. Щоб дізнатися більше, див. B<mount>(8).

source: Display help text and exit.
de: zeigt einen Hilfetext an und beendet das Programm.
uk: Вивести текст довідки і завершити роботу.

source: Print version and exit.
uk: Вивести дані щодо версії і завершити роботу.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
uk: СЕРЕДОВИЩЕ

source: enables B<libblkid>(3) debug output.
de: aktiviert die Debug-Ausgabe für B<libblkid>(3).
uk: вмикає показ діагностичних повідомлень B<libblkid>(3).

source: LOCK_BLOCK_DEVICE=E<lt>modeE<gt>
de: LOCK_BLOCK_DEVICE=E<lt>ModusE<gt>
uk: LOCK_BLOCK_DEVICE=E<lt>режимE<gt>

source: use exclusive BSD lock. The mode is "1" or "0". See B<--lock> for more details.
de: verwendet eine exklusive BSD-Sperre. Der Modus ist »1« oder »0«. Siehe B<--lock> für weitere Details.
uk: використати виключне блокування BSD. Режимом може бути «1» або «0». Див. B<--lock>, щоб дізнатися більше.

source: EXAMPLES
de: BEISPIELE
uk: ПРИКЛАДИ

source: Prints information about sda and all partitions on sda.
de: gibt Informationen über sda und alle Partitionen auf sda aus.
uk: Виводить відомості щодо sda і усіх розділів на sda.

source: Erases all signatures from the device I</dev/sdb> and creates a signature backup file I<~/wipefs-sdb-E<lt>offsetE<gt>.bak> for each signature.
de: löscht alle Signaturen vom Gerät I</dev/sdb> und erstellt eine Sicherungsdatei I<~/wipefs-sdb-E<lt>VersatzE<gt>.bak> für jede Signatur.
uk: Витирає усі підписи з пристрою I</dev/sdb> і створює файл резервної копії підпису I<~/wipefs-sdb-E<lt>відступE<gt>.bak> для кожного підпису.

source: Restores an ext2 signature from the backup file I<~/wipefs-sdb-0x00000438.bak>.
de: stellt die ext2-Signatur aus der Sicherungsdatei I<~/wipefs-sdb-0x00000438.bak> wieder her.
uk: Відновлює підпис ext2 з файла резервної копії I<~/wipefs-sdb-0x00000438.bak>.

source: AUTHORS
de: AUTOREN
uk: АВТОРИ

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: The B<wipefs> command is part of the util-linux package which can be downloaded from
de: Der Befehl B<wipefs> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<wipefs> є частиною пакунка util-linux, який можна отримати з

source: December 2014
de: Dezember 2014
uk: Грудень 2014 року

source: B<wipefs> [B<options>] I<device>...
de: B<wipefs> [B<Optionen>] I<Gerät> …
uk: B<wipefs> [B<параметри>] I<пристрій>...

source: B<wipefs> [B<--backup>] B<-o> I<offset> I<device>...
de: B<wipefs> [B<--backup>] B<-o> I<Versatz> I<Gerät>…
uk: B<wipefs> [B<--backup>] B<-o> I<відступ> I<пристрій>...

source: B<wipefs> can erase filesystem, raid or partition-table signatures (magic strings) from the specified I<device> to make the signatures invisible for libblkid. B<wipefs> does not erase the filesystem itself nor any other data from the device.
de: B<wipefs> kann die Signaturen von Dateisystemen, RAID oder Partitionstabellen (magische Zeichenketten) vom angegebenen I<Gerät> löschen, um diese für libblkid unsichtbar zu machen. B<wipefs> löscht nicht das Dateisystem selbst oder irgendwelche andere Daten von dem Gerät.
uk: B<wipefs> може витерти підписи файлової системи, raid або таблиці розділів (контрольні рядки) із вказаного I<пристрою>, щоб зробити підписи невидимими для libblkid. B<wipefs> не витирає саму файлову систему і не витирає будь-які інші файли з пристрою.

source: When used without any options, wipefs lists all visible filesystems and the offsets of their basic signatures. The default output is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using B<--output> I<columns-list> in environments where a stable output is required.
de: Werden keine Optionen verwandt, wird Wipefs alle sichtbaren Dateisysteme und deren Versatz auf der Basis grundlegender Signaturen auflisten. Die Vorgabeausgabe kann sich ändern. Daher sollten Sie wann immer möglich vermeiden, die Vorgabeausgabe in Skripten zu verwenden. Definieren Sie in Umgebungen, in denen eine stabile Ausgabe benötigt wird, immer explizit die Spalten mittels B<--output> I<Spaltenliste>.
uk: Якщо використано без будь-яких параметрів, wipefs виводить список усіх видимих файлових систем і відступів їхніх базових підписів. Типовий формат виведення може бути змінено авторами програми. Тому, коли це можливо, вам слід уникати обробки типових виведених даних у ваших скриптах. Завжди явно визначайте очікувані стовпчики за допомогою параметра B<--output> I<список-стовпчиків> у середовищах, де потрібне виведення стабільного набору даних.

source: B<wipefs> calls the BLKRRPART ioctl when it has erased a partition-table signature to inform the kernel about the change. The ioctl is called as the last step and when all specified signatures from all specified devices are already erased. This feature can be used to wipe content on partitions devices as well as partition table on a disk device, for example by B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
de: B<wipefs> ruft das BLKRRPART-Ioctl nach dem Löschen einer Partitionstabelle auf, um den Kernel über die Änderung zu informieren. Der Ioctl wird zuletzt aufgerufen und wenn alle angegebenen Signaturen von allen angegebenen Geräten bereits gelöscht sind. Mit dieser Funktion können sowohl Inhalte von Partitionen als auch Partitionstabellen auf Plattenlaufwerken gelöscht werden, zum Beispiel mit B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
uk: B<wipefs> викликає керування введенням-виведенням BLKRRPART при витиранні підпису таблиці розділів, щоб проінформувати ядро про зміни. Керування введенням-виведенням (ioctl) буде викликано на останньому кроці, коли усі вказані підписи з усіх вказаних пристроїв вже буде витерто. Цією можливістю можна скористатися для витирання даних на усіх пристроях розділів, а також у таблиці розділів на пристрої диска, наприклад, за допомогою команди B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.

source: Note that some filesystems and some partition tables store more magic strings on the device (e.g., FAT, ZFS, GPT). The B<wipefs> command (since v2.31) lists all the offset where a magic strings have been detected.
de: Beachten Sie, dass einige Dateisysteme und einige Partitionstabellen (z.B. FAT, ZFS, GPT) mehr magische Zeichenketten auf dem Gerät speichern. Der Befehl B<wipefs> listet (seit v2.31) alle Versätze auf, an denen magische Zeichenketten erkannt wurden.
uk: Зауважте, що у деяких файлових системах та деяких таблицях розділів (наприклад, FAT, ZFS, GPT) зберігаються додаткові контрольні рядки на пристрої. Команда B<wipefs> (починаючи з версії 2.31) виводить список усіх відступів у даних, за якими було виявлено контрольні рядки.

source: When option B<-a> is used, all magic strings that are visible for libblkid are erased. In this case the B<wipefs> scans the device again after each modification (erase) until no magic string is found.
de: Mit der Option B<-a> werden alle für libblkid sichtbaren magischen Zeichenketten gelöscht. In diesem Fall durchsucht B<wipefs> das Gerät erneut nach einer Änderung (Löschen), bis keine magische Zeichenkette gefunden wird.
uk: Якщо використано параметр B<-a>, усі контрольні рядки, які є видимими для B<libblkid>(3), буде вилучено. У випадку використання цього параметра B<wipefs> виконуватиме повторне сканування пристрою після внесення кожної зміни (витирання), аж доки не закінчаться контрольні рядки.

source: Note that by default B<wipefs> does not erase nested partition tables on non-whole disk devices. For this the option B<--force> is required.
de: Beachten Sie, dass B<wipefs> keine verschachtelten Partitionstabellen auf Geräteteilen löscht. Die Option B<--force> wird dazu benötigt.
uk: Зауважте, що типово B<wipefs> не витиратиме вкладені таблиці розділів на пристроях, які не займають усього диска. Для такого витирання слід вказати параметр B<--force>.

source: Erase all available signatures. The set of erased signatures can be restricted with the B<-t> option.
de: löscht alle verfügbaren Signaturen. Die zu löschenden Signaturen können mit der Option B<-t> eingegrenzt werden.
uk: Витерти усі доступні підписи. Набір витертих підписів можна обмежити за допомогою параметра B<-t>.

source: Create a signature backup to the file $HOME/wipefs-E<lt>devnameE<gt>-E<lt>offsetE<gt>.bak. For more details see the B<EXAMPLE> section.
de: erstellt eine Sicherung der Signatur in der Datei $HOME/wipefs-E<lt>GerätenameE<gt>-E<lt>VersatzE<gt>.bak. Weitere Details finden Sie im Abschnitt B<BEISPIELE>.
uk: Створити резервну копію підпису до файла $HOME/wipefs-E<lt>назва-пристроюE<gt>-E<lt>відступE<gt>.bak. Щоб дізнатися більше, див. розділ B<ПРИКЛАД>.

source: Force erasure, even if the filesystem is mounted. This is required in order to erase a partition-table signature on a block device.
de: erzwingt das Löschen selbst dann, wenn das Dateisystem eingehängt ist. Dies ist notwendig, um die Partitionstabellensignatur eines blockorientierten Gerätes löschen zu können.
uk: Примусове витирання, навіть якщо файлову систему змонтовано. Таке витирання потрібне для витирання підпису таблиці розділів на блоковому пристрої.

source: Use exclusive BSD lock for device or file it operates. The optional argument I<mode> can be B<yes>, B<no> (or 1 and 0) or B<nonblock>. If the I<mode> argument is omitted, it defaults to B<"yes">. This option overwrites environment variable B<$LOCK_BLOCK_DEVICE>. The default is not to use any lock at all, but it's recommended to avoid collisions with udevd or other tools.
de: verwendet eine exklusive BSD-Sperre für das Gerät oder die Datei, auf dem/der es agiert. Das optionale Argument I<Modus> kann B<yes>, B<no> (oder 1 und 0) oder B<nonblock> sein. Falls das Argument I<Modus> weggelassen wird, wird standardmäßig B<yes> angenommen. Diese Option setzt die Umgebungsvariable B<$LOCK_BLOCK_DEVICE> außer Kraft. Standardmäßig wird überhaupt keine Sperre gesetzt, dies wird aber empfohlen, um Kollisionen mit Udevd zu vermeiden.
uk: Скористатися виключним блокуванням BSD для пристрою або файла, який ним керує. Значенням додаткового аргументу I<режим> може бути B<yes>, B<no> (або 1 і 0) чи B<nonblock>. Якщо пропустити аргумент I<режим>, типовим значенням буде B<"yes">. Цей параметр переписує змінну середовища B<$LOCK_BLOCK_DEVICE>. Типовим станом є невикористання блокування, але рекомендуємо уникати конфліктів із udevd або іншими програмами.
