Repository: sebras/manpages-l10n
Catalog: po/*/man8/wipefs.8.po
Languages: de, uk

source: B<-O>,B< --output >I<list>
de: B<-O>,B< --output >I<Liste>
uk: B<-o>, B<--output> I<список>

source: Specify which output columns to print. Use --help to get a list of all supported columns.
de: gibt die anzuzeigenden Spalten an. Mit »--help« erhalten Sie eine Liste aller unterstützten Spalten.
uk: Визначити, які стовпчики слід використовувати для виведення. Скористайтеся параметром B<--help>, щоб переглянути список підтримуваних стовпчиків.

source: Causes everything to be done except for the write() call.
de: sorgt dafür, dass alles erledigt wird, bis auf den endgültigen Aufruf von write().
uk: Виконати усі дії, окрім виклику B<write>(2).

source: B<-o>,B< --offset >I<offset>
de: B<-o>,B< --offset >I<Versatz>
uk: B<-o>, B<--offset> I<відступ>

source: Specify the location (in bytes) of the signature which should be erased from the device. The I<offset> number may include a "0x" prefix; then the number will be interpreted as a hex value. It is possible to specify multiple B<-o> options.
de: gibt den Ort der Signatur (in Bytes) an, die vom Gerät gelöscht werden soll. Die Zahl für I<Versatz> kann ein Präfix »0x« enthalten, so dass die Zahl als Hexadezimalwert interpretiert iwrd. Es ist möglich, die Option B<-o> mehrmals anzugeben.
uk: Вказати місце (у байтах) підпису, який слід витерти з пристрою. Число I<відступ> може включати префікс «0x». Якщо такий префікс вказано, число вважатиметься шістнадцятковим значенням. Можна вказати декілька параметрів B<-o> в одній команді.

source: Print out in parsable instead of printable format. Encode all potentially unsafe characters of a string to the corresponding hex value prefixed by '\ex'.
de: veranlasst die Ausgabe in einem auswertbaren anstatt menschenlesbaren Format. Alle potenziell unsicheren Zeichen einer Zeichenkette werden in den korrespondierenden Hexadezimalwert umgewandelt, indem das Präfix »\ex« vorangestellt wird.
uk: Вивести придатні для обробки дані замість придатного для перегляду формату. Закодувати потенційно небезпечні символи рядка до відповідних шістнадцяткових значень із префіксом «\ex».

source: B<-t>,B< --types >I<list>
de: B<-t>,B< --types >I<Liste>
uk: B<-t>, B<--types> I<список>

source: Limit the set of printed or erased signatures. More than one type may be specified in a comma-separated list. The list or individual types can be prefixed with 'no' to specify the types on which no action should be taken. For more details see mount(8).
de: grenzt die ausgegebenen oder zu löschenden Signaturen ein. Es können in einer durch Kommata getrennten Liste mehrere Typen angegeben werden. Der Liste oder den angegebenen Typen kann ein »no« vorangestellt werden, um die Typen anzugeben, für die keine Aktion ausgeführt werden soll. Weitere Details finden Sie in mount(8).
uk: Обмежити набір виведених або витертих підписів. У списку відокремлених комами значень можна вказувати декілька типів. До списку або окремих типів можна додати префікс «no», щоб визначити типи, до яких не слід застосовувати дії. Щоб дізнатися більше, див. B<mount>(8).

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.
uk: Вивести дані щодо версії і завершити роботу.

source: enables libblkid debug output.
de: aktiviert die Debug-Ausgabe für libblkid.
uk: вмикає показ діагностичних повідомлень libblkid.

source: use exclusive BSD lock. The mode is "1" or "0". See B<--lock> for more details.
de: verwendet eine exklusive BSD-Sperre. Der Modus ist »1« oder »0«. Siehe B<--lock> für weitere Details.
uk: використати виключне блокування BSD. Режимом може бути «1» або «0». Див. B<--lock>, щоб дізнатися більше.

source: EXAMPLE
de: BEISPIEL
uk: ПРИКЛАДИ

source: Erases all signatures from the device /dev/sdb and creates a signature backup file ~/wipefs-sdb-E<lt>offsetE<gt>.bak for each signature.
de: löscht alle Signaturen vom Gerät /dev/sdb und erstellt eine Sicherungsdatei ~/wipefs-sdb-E<lt>VersatzE<gt>.bak für jede Signatur.
uk: Витирає усі підписи з пристрою I</dev/sdb> і створює файл резервної копії підпису ~/wipefs-sdb-E<lt>відступE<gt>.bak для кожного підпису.

source: Restores an ext2 signature from the backup file ~/wipefs-sdb-0x00000438.bak.
de: stellt die ext2-Signatur aus der Sicherungsdatei ~/wipefs-sdb-0x00000438.bak wieder her.
uk: Відновлює підпис ext2 з файла резервної копії ~/wipefs-sdb-0x00000438.bak.

source: The wipefs command is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl wipefs ist Teil des Pakets util-linux und kann von https://www.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
uk: Програма wipefs є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: B<wipefs> calls the BLKRRPART ioctl when it has erased a partition-table signature to inform the kernel about the change. The ioctl is called as the last step and when all specified signatures from all specified devices are already erased. This feature can be used to wipe content on partitions devices as well as partition table on a disk device, for example by B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
de: B<wipefs> ruft das BLKRRPART-Ioctl nach dem Löschen einer Partitionstabelle auf, um den Kernel über die Änderung zu informieren. Der Ioctl wird zuletzt aufgerufen und wenn alle angegebenen Signaturen von allen angegebenen Geräten bereits gelöscht sind. Mit dieser Funktion können sowohl Inhalte von Partitionen als auch Partitionstabellen auf Plattenlaufwerken gelöscht werden, zum Beispiel mit B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
uk: B<wipefs> викликає керування введенням-виведенням B<BLKRRPART> при витиранні підпису таблиці розділів, щоб проінформувати ядро про зміни. Керування введенням-виведенням (ioctl) буде викликано на останньому кроці, коли усі вказані підписи з усіх вказаних пристроїв вже буде витерто. Цією можливістю можна скористатися для витирання даних на усіх пристроях розділів, а також у таблиці розділів на пристрої диска, наприклад, за допомогою команди B<wipefs -a /dev/sdc1 /dev/sdc2 /dev/sdc>.
