Repository: sebras/manpages-l10n
Catalog: po/*/man4/cpuid.4.po
Languages: de, pt_br

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
pt_br: Manual do Programador do Linux

source: NAME
de: BEZEICHNUNG
pt_br: NOME

source: cpuid - x86 CPUID access device
de: cpuid - Gerät für den Zugriff auf die x86-CPUID
pt_br: cpuid - dispositivo x86 de acesso CPUID

source: DESCRIPTION
de: BESCHREIBUNG
pt_br: DESCRIÇÃO

source: CPUID provides an interface for querying information about the x86 CPU.
de: CPUID ist eine Schnittstelle zur Abfrage von Informationen über die x86-CPU.
pt_br: CPUID fornece uma interface para consultar informações sobre a CPU x86.

source: This device is accessed by B<lseek>(2) or B<pread>(2) to the appropriate CPUID level and reading in chunks of 16 bytes. A larger read size means multiple reads of consecutive levels.
de: Auf dieses Gerät greifen B<lseek>(2) oder B<pread>(2) auf die geeignete CPUID-Ebene zu und lesen 16-Byte-Blöcke ein. Werden mehr als 16 Byte gelesen, bedeutet das das Lesen mehrerer aufeinander folgender Ebenen.
pt_br: Este dispositivo é acessado por B<lseek>(2) ou B<pread>(2) ao nível de CPUID apropriado e lendo em blocos de 16 bytes. Um tamanho de leitura maior significa várias leituras de níveis consecutivos.

source: The lower 32 bits of the file position is used as the incoming I<%eax>, and the upper 32 bits of the file position as the incoming I<%ecx>, the latter is intended for "counting" I<eax> levels like I<eax=4>.
de: Die unteren 32 Bit der Dateiposition werden als das eingehende I<%eax>-Register verwendet und die oberen 32 Bit der Dateiposition für das eingehende I<%ecx>, wobei Letzteres für das »Zählen« der I<eax>-Ebenen (wie z. B. I<eax=4>) vorgesehen ist.
pt_br: Os 32 bits inferiores da posição do arquivo são usados como I<%eax> de entrada, e os 32 bits superiores da posição do arquivo como I<%ecx> de entrada, o último destina-se a "contar" os níveis I<eax> como I<eax=4>.

source: This driver uses I</dev/cpu/CPUNUM/cpuid>, where I<CPUNUM> is the minor number, and on an SMP box will direct the access to CPU I<CPUNUM> as listed in I</proc/cpuinfo>.
de: Dieser Treiber verwendet I</dev/cpu/CPUNUM/cpuid>, wobei I<CPUNUM> die Minor-Gerätenummer ist. Auf einem SMP-Rechner greift der Treiber direkt auf die in I</proc/cpuinfo> angegebene CPU I<CPUNUM> zu.
pt_br: Este driver usa I</dev/cpu/CPUNUM/cpuid>, onde I<CPUNUM> é o número menor, e em uma máquina SMP direcionará o acesso à CPU I<CPUNUM> conforme listado em I</proc/cpuinfo>.

source: This file is protected so that it can be read only by the user I<root>, or members of the group I<root>.
de: Diese Datei ist geschützt. Sie kann nur vom Benutzer I<root> oder Mitgliedern der Gruppe I<root> gelesen werden.
pt_br: Este arquivo é protegido de forma que possa ser lido apenas pelo usuário I<root>, ou membros do grupo I<root>.

source: NOTES
de: ANMERKUNGEN
pt_br: NOTAS

source: The CPUID instruction can be directly executed by a program using inline assembler. However this device allows convenient access to all CPUs without changing process affinity.
de: Die CPUID-Anweisung kann direkt durch ein Programm mittels Inline-Assembler ausgeführt werden. Doch dieses Gerät ermöglicht bequemen Zugriff auf alle CPUs ohne die Affinität des Prozesses zu ändern.
pt_br: A instrução CPUID pode ser executada diretamente por um programa usando assembler embutido. No entanto, este dispositivo permite acesso conveniente a todas as CPUs sem alterar a afinidade do processo.

source: Most of the information in I<cpuid> is reported by the kernel in cooked form either in I</proc/cpuinfo> or through subdirectories in I</sys/devices/system/cpu>. Direct CPUID access through this device should only be used in exceptional cases.
de: Die meisten Informationen in I<cpuid> stellt der Kernel in aufbereiteter Form entweder in I</proc/cpuinfo> oder durch Unterverzeichnisse in I</sys/devices/system/cpu> bereit. Direkter Zugriff auf die CPUID durch dieses Gerät sollte nur in Ausnahmefällen erfolgen.
pt_br: A maior parte das informações em I<cpuid> são relatadas pelo kernel na forma processada em I</proc/cpuinfo> ou por meio de subdiretórios em I</sys/devices/system/cpu>. O acesso direto à CPUID através deste dispositivo deve ser usado apenas em casos excepcionais.

source: The I<cpuid> driver is not auto-loaded. On modular kernels you might need to use the following command to load it explicitly before use:
de: Der I<cpuid>-Treiber wird nicht automatisch geladen. Im Fall modularer Kernel müssen Sie ihn vielleicht mit dem folgenden Befehl explizit laden:
pt_br: O driver I<cpuid> não é carregado automaticamente. Em kernels modulares, você pode precisar usar o seguinte comando para carregá-lo explicitamente antes de usar:

source: There is no support for CPUID functions that require additional input registers.
de: bevor Sie ihn verwenden können. CPUID-Funktionen, die weitere Eingabe-Register erfordern, werden nicht unterstützt.
pt_br: Não há suporte para funções CPUID que requerem registros de entrada adicionais.

source: Very old x86 CPUs don't support CPUID.
de: Sehr alte x86-CPUs unterstützen CPUID nicht.
pt_br: CPUs x86 muito antigas não suportam CPUID.

source: SEE ALSO
de: SIEHE AUCH
pt_br: VEJA TAMBÉM

source: COLOPHON
de: KOLOPHON
pt_br: COLOFÃO

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.12 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: The lower 32 bits of the file position is used as the incoming I<%eax>, and the upper 32 bits of the file position as the incoming I<%ecx>, the latter intended for "counting" I<eax> levels like I<eax=4>.
de: Die unteren 32 Bit der Dateiposition werden als das eingehende I<%eax>-Register verwendet und die oberen 32 Bit der Dateiposition für das eingehende I<%ecx>, wobei Letzteres für das »Zählen« der I<eax>-Ebenen (wie z. B. I<eax=4>) vorgesehen ist.
pt_br: Os 32 bits inferiores da posição do arquivo são usados como I<%eax> de entrada, e os 32 bits superiores da posição do arquivo como I<%ecx> de entrada, o último destina-se a "contar" os níveis I<eax> como I<eax=4>.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.04 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 4.16 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.13 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
