Repository: sebras/manpages-l10n
Catalog: po/*/man4/initrd.4.po
Languages: de, es

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: initrd - boot loader initialized RAM disk
de: initrd - vom Boot-Loader initialisierte RAM-Disk
es: initrd - disco-RAM inicializado por el gestor de arranque

source: CONFIGURATION
de: KONFIGURATION
es: CONFIGURACIÓN

source: I</dev/initrd> is a read-only block device assigned major number 1 and minor number 250. Typically I</dev/initrd> is owned by root:disk with mode 0400 (read access by root only). If the Linux system does not have I</dev/initrd> already created, it can be created with the following commands:
de: I</dev/initrd> ist ein nur lesbares Blockgerät mit der Major-Nummer 1 und der Minor-Nummer 250. Typischerweise ist der Besitzer von I</dev/initrd> root.disk; die Zugriffsrechte sind auf 0400 gesetzt (Lesezugriff nur für root). Wenn I</dev/initrd> nicht schon im Linux-System eingerichtet wurde, kann sie mit den folgenden Befehlen erstellt werden:
es: El dispositivo de bloques B</dev/initrd> es de sólo lectura, al que se le asigna como número mayor 1 y como número menor 250. En general, B</dev/initrd> es propiedad de root:disk con modo 0400 (con acceso de lectura sólo para el 'root'). Si el sistema Linux no tuviese ya creado B</dev/initrd>, puede crearse con las siguientes órdenes:

source: Also, support for both "RAM disk" and "Initial RAM disk" (e.g., B<CONFIG_BLK_DEV_RAM=y> and B<CONFIG_BLK_DEV_INITRD=y>) must be compiled directly into the Linux kernel to use I</dev/initrd>. When using I</dev/initrd>, the RAM disk driver cannot be loaded as a module.
de: Auch muss Unterstützung für sowohl »RAM-Disk« als auch »Initial RAM Disk« (z. B. B<CONFIG_BLK_DEV_RAM=y> und B<CONFIG_BLK_DEV_INITRD=y>) direkt in den Linux-Kernel kompiliert werden, um I</dev/initrd> zu verwenden. Wird I</dev/initrd> verwendet, kann der RAM-Disk-Treiber nicht als Modul geladen werden.
es: También, el soporte tanto para "disco RAM" y "disco RAM Inicial" (p.ej. B<CONFIG_BLK_DEV_RAM=y> y B<CONFIG_BLK_DEV_INITRD=y>) debe ser compilado directamente en el núcleo de Linux para utilizar B</dev/initrd>. Cuando se usa B</dev/initrd>, el controlador del disco RAM no se puede cargar como módulo.

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: The special file I</dev/initrd> is a read-only block device. This device is a RAM disk that is initialized (e.g., loaded) by the boot loader before the kernel is started. The kernel then can use I</dev/initrd>'s contents for a two-phase system boot-up.
de: Die Spezialdatei I</dev/initrd> ist ein nur lesbares Blockgerät. Dieses Gerät ist eine RAM-Disk, die vom Boot-Loader initialisiert (z.B. geladen) wird, bevor der Kernel gestartet wird. Der Kernel kann dann den Inhalt von I</dev/initrd> für einen zweiphasigen Systemstart verwenden.
es: El archivo especial B<dev/initrd> es un dispositivo de bloques de sólo lectura. El dispositivo B</dev/initrd> es un disco RAM que es inicializado (es decir, cargado) por el gestor de arranque antes de cargar e iniciar el núcleo del sistema. Así, el núcleo puede utilizar el contenido del dispositivo B</dev/initrd> para el inicio del sistema en dos fases.

source: In the first boot-up phase, the kernel starts up and mounts an initial root filesystem from the contents of I</dev/initrd> (e.g., RAM disk initialized by the boot loader). In the second phase, additional drivers or other modules are loaded from the initial root device's contents. After loading the additional modules, a new root filesystem (i.e., the normal root filesystem) is mounted from a different device.
de: In der ersten Phase startet der Kernel und bindet ein erstes Wurzeldateisystem mit Inhalten von I</dev/initrd> ein (z. B. die vom Boot-Loader initialisierte RAM-Disk). In der zweiten Phase werden zusätzliche Treiber oder andere Module aus dem Inhalt des ersten Wurzelgeräts geladen. Nach dem Laden der zusätzlichen Module wird ein neues Wurzeldateisystem (d. h. das normale Wurzeldateisystem) von einem anderen Gerät eingebunden.
es: En la primera fase del inicio, el núcleo pone en marcha y monta un sistema de ficheros raíz a partir del contenido de B</dev/initrd> (o sea, el disco-RAM inicializado por el gestor de arranque). En la segunda fase, se cargan controladores adicionales u otros módulos desde el contenido del dispositivo raíz inicial. Tras cargar los módulos adicionales, se monta un nuevo sistema de ficheros raíz (es decir, el sistema de ficheros raíz habitual) desde un dispositivo diferente.

source: Boot-up operation
de: Der Boot-Vorgang
es: Operación de Iniciado

source: When booting up with B<initrd>, the system boots as follows:
de: Beim Booten mit B<initrd> startet das System wie folgt:
es: Cuando se arranca el sistema con B<initrd>, ocurre lo siguiente:

source: The boot loader loads the kernel program and I</dev/initrd>'s contents into memory.
de: Der Boot-Loader lädt den Kernel und den Inhalt von I</dev/initrd> in den Speicher.
es: El gestor de arranque ('boot loader') carga el núcleo y el contenido de I</dev/initrd> en memoria.

source: On kernel startup, the kernel uncompresses and copies the contents of the device I</dev/initrd> onto device I</dev/ram0> and then frees the memory used by I</dev/initrd>.
de: Wenn der Kernel startet, dekomprimiert und kopiert er den Inhalt des Gerätes I</dev/initrd> auf Gerät I</dev/ram0> und gibt dann den Speicher frei, den I</dev/initrd> belegte.
es: En la puesta en marcha del núcleo, éste descomprime y copia el contenido del dispositivo I</dev/initrd> en el dispositivo I</dev/ram0> y a continuación libera la memoria utilizada por I</dev/initrd>.

source: The kernel then read-write mounts the device I</dev/ram0> as the initial root filesystem.
de: Der Kernel bindet dann das Gerät I</dev/ram0> schreib- und lesbar als anfängliches Wurzeldateisystem ein.
es: Seguidamente, el núcleo monta el dispositivo I</dev/ram0> en modo lectura/escritura como el sistema de ficheros raíz inicial.

source: If the indicated normal root filesystem is also the initial root filesystem (e.g., I</dev/ram0>) then the kernel skips to the last step for the usual boot sequence.
de: Wenn das angegebene normale Wurzeldateisystem auch das anfängliche Wurzeldateisystem ist (z.B. I</dev/ram0>), springt der Kernel zum letzten Schritt für die übliche Boot-Sequenz.
es: Si el sistema de ficheros raíz habitual indicado coincide con el sistema de ficheros raíz inicial (por ejemplo, I</dev/ram0>) entonces el núcleo salta directamente al último paso para la secuencia de arranque habitual.

source: If the executable file I</linuxrc> is present in the initial root filesystem, I</linuxrc> is executed with UID 0. (The file I</linuxrc> must have executable permission. The file I</linuxrc> can be any valid executable, including a shell script.)
de: Wenn im anfänglichen Wurzeldateisystem die ausführbare Datei I</linuxrc> vorhanden ist, wird sie mit UID 0 ausgeführt. (Die Datei I</linuxrc> muss über Ausführungsrechte verfügen. Sie kann eine beliebige gültige, ausführbare Datei sein, also auch ein Shell-Skript.)
es: Si el fichero ejecutable I</linuxrc> está presente en el sistema de ficheros raíz inicial, se ejecuta con UID (identificador de usuario) 0. (El fichero I</linuxrc> debe tener permiso de ejecución. El fichero I</linuxrc> puede ser cualquier ejecutable válido, incluyendo los guiones de cualquier procesador de órdenes -'shell scripts'.)

source: If I</linuxrc> is not executed or when I</linuxrc> terminates, the normal root filesystem is mounted. (If I</linuxrc> exits with any filesystems mounted on the initial root filesystem, then the behavior of the kernel is B<UNSPECIFIED>. See the NOTES section for the current kernel behavior.)
de: Wenn I</linuxrc> nicht ausgeführt oder wenn I</linuxrc> beendet wird, wird das normale Wurzeldateisystem eingebunden. (Wenn I</linuxrc> beendet wird, wenn noch Dateisysteme im anfänglichen Wurzeldateisystem eingehängt sind, dann ist das Verhalten des Kernels B<NICHT FESTGELEGT>; siehe den Abschnitt ANMERKUNGEN für das aktuelle Kernel-Verhalten.)
es: Si no se ejecuta I</linuxrc> o cuando I</linuxrc> termina, se monta el sistema de ficheros raíz habitual. (Si I</linuxrc> termina con algún sistema de ficheros montado en el raíz inicial, entonces el comportamiento del núcleo es B<INDETERMINADO>. (Vea la sección OBSERVACIONES para consultar el comportamiento actual del núcleo.)

source: If the normal root filesystem has a directory I</initrd>, the device I</dev/ram0> is moved from I</> to I</initrd>. Otherwise, if the directory I</initrd> does not exist, the device I</dev/ram0> is unmounted. (When moved from I</> to I</initrd>, I</dev/ram0> is not unmounted and therefore processes can remain running from I</dev/ram0>. If directory I</initrd> does not exist on the normal root filesystem and any processes remain running from I</dev/ram0> when I</linuxrc> exits, the behavior of the kernel is B<UNSPECIFIED>. See the NOTES section for the current kernel behavior.)
de: Wenn im normalen Wurzeldateisystem ein Verzeichnis I</initrd> vorhanden ist, wird das Gerät I</dev/ram0> von I</> auf I</initrd> gelegt. Wenn das Verzeichnis I</initrd> nicht vorhanden ist, wird das Gerät I</dev/ram0> ausgehängt. (Wenn I</dev/ram0> von I</> nach I</initrd> verschoben wird, wird I</dev/ram0> nicht ausgehängt und damit können Prozesse weiterhin von I</dev/ram0> ausgeführt werden. Wenn das Vorzeichnis I</initrd> nicht auf dem normalen Wurzeldateisystem existiert und noch weiterhin Prozesse von I</dev/ram0> ausgeführt werden, wenn I</linuxrc> sich beendet, ist das Verhalten des Kernels B<NICHT FESTGELEGT>; siehe den Abschnitt ANMERKUNGEN für das aktuelle Kernel-Verhalten.)
es: Si el sistema de ficheros 'habitual' contiene el directorio I</initrd>, el dispositivo I</dev/ram0> se mueve desde I</> a I</initrd>. En otro caso, si el directorio I</initrd> no existe, el dispositivo I</dev/ram0> se desmonta. (Cuando es movido desde I</> a I</initrd>, I</dev/ram0> no se desmonta, y por tanto los procesos pueden permanecer funcionando desde I</dev/ram0>. Si el directorio I</initrd> no existe en el sistema de ficheros raíz habitual y queda algún proceso en funcionamiento sobre I</dev/ram0> cuando I</linuxrc> termina, el comportamiento del núcleo es B<INDETERMINADO>. Vea la sección de OBSERVACIONES para consultar el comportamiento actual del núcleo.)

source: The usual boot sequence (e.g., invocation of I</sbin/init>) is performed on the normal root filesystem.
de: Die übliche Boot-Sequenz (z.B. Aufruf von I</sbin/init>) wird auf dem normalen Wurzeldateisystem durchgeführt.
es: La secuencia de arranque/inicio habitual (por ejemplo, la ejecución de I</sbin/init>) se realiza en el sistema de ficheros habitual.

source: Options
de: Optionen
es: Opciones

source: The following boot loader options, when used with B<initrd>, affect the kernel's boot-up operation:
de: Die folgenden Optionen des Boot-Loaders wirken sich auf das Verhalten des Kernels beim Systemstart aus, wenn sie mit B<initrd> verwendet werden:
es: Las siguientes opciones del gestor de arranque, cuando se utilizan con B<initrd>, alteran el proceso de puesta en marcha del núcleo:

source: B<initrd=>I<filename>
de: B<initrd=>I<Dateiname>
es: B<initrd=>I<nombre_de_fichero>

source: Specifies the file to load as the contents of I</dev/initrd>. For B<LOADLIN> this is a command-line option. For B<LILO> you have to use this command in the B<LILO> configuration file I</etc/lilo.config>. The filename specified with this option will typically be a gzipped filesystem image.
de: Gibt die Datei an, die als Inhalt von I</dev/initrd> geladen wird. Für B<LOADLIN> ist das eine Befehlszeilenoption. Für B<LILO> müssen Sie diesen Befehl in der B<LILO>-Konfigurationsdatei I</etc/lilo.config> verwenden. Die mit dieser Option angegebene Datei ist typischerweise ein komprimiertes Dateisystem-Abbild.
es: Especifica el fichero a cargar como el contenido de I</dev/initrd>. Para B<LOADLIN> esta es una opción de línea de órdenes. Para B<LILO> tiene que utilizar este orden en el fichero de configuración de B<LILO>, I</etc/lilo.config>. El nombre de fichero indicado con esta opción será normalmente una imagen del sistema de ficheros comprimida con GZip.

source: This boot option disables the two-phase boot-up operation. The kernel performs the usual boot sequence as if I</dev/initrd> was not initialized. With this option, any contents of I</dev/initrd> loaded into memory by the boot loader contents are preserved. This option permits the contents of I</dev/initrd> to be any data and need not be limited to a filesystem image. However, device I</dev/initrd> is read-only and can be read only one time after system startup.
de: Diese Boot-Option deaktiviert den zweiphasigen Systemstart. Der Kernel führt die übliche Boot-Sequenz aus, als ob I</dev/initrd> nicht initialisiert wurde. Mit dieser Option bleiben alle vom Boot-Loader in den Speicher geladenen Inhalte von I</dev/initrd> erhalten. Diese Option ermöglicht, dass der Inhalt von I</dev/initrd> aus beliebigen Daten bestehen kann und nicht auf Dateisystem-Abbilder beschränkt sein muss. Allerdings ist das Gerät I</dev/initrd> schreibgeschützt und kann nur einmal nach dem Systemstart gelesen werden.
es: Esta opción de arranque deshabilita la operación de arranque en dos fases. El núcleo realiza la secuencia de arranque habitual como si I</dev/initrd> no hubiera sido inicializado. Con esta opción, cualquier contenido de I</dev/initrd> cargado en la memoria por el 'boot loader' es preservado. Esta opción permite que I</dev/initrd> contenga cualquier clase de datos y no esté limitado a una imagen de sist. de ficheros. De todas formas, el dispositivo I</dev/initrd> es de sólo-lectura y puede ser leído sólo una vez tras la puesta en marcha del sistema.

source: B<root=>I<device-name>
de: B<root=>I<Gerätename>
es: B<root=>I<nombre-de-dispositivo>

source: Specifies the device to be used as the normal root filesystem. For B<LOADLIN> this is a command-line option. For B<LILO> this is a boot time option or can be used as an option line in the B<LILO> configuration file I</etc/lilo.config>. The device specified by this option must be a mountable device having a suitable root filesystem.
de: Gibt das Gerät an, das als normales Wurzeldateisystem verwendet werden soll. Für B<LOADLIN> ist dies ist eine Befehlszeilen-Option. Für B<LILO> kann diese Option beim Systemstart oder als Optionszeile in der B<LILO>-Konfigurationsdatei I</etc/lilo.config> verwendet werden. Das durch diese Option angegebene Gerät muss eingehängt werden können und ein geeignetes Wurzeldateisystem enthalten.
es: Especifica el dispositivo que será utilizado como sistema de ficheros normal (raíz). Para B<LOADLIN> esta es una opción de línea de órdenes. Para B<LILO> esta es una opción para el momento de arranque o puede utilizarse como línea de opción en el fichero de configuración de B<LILO>, I</etc/lilo.config>. El dispositivo indicado por la opción debe ser un dispositivo 'montable', y contener un sistema de ficheros raíz adecuado.

source: Changing the normal root filesystem
de: Wechsel des normalen Wurzeldateisystems
es: Modificando el sistema de archivos raiz habitual.

source: By default, the kernel's settings (e.g., set in the kernel file with B<rdev>(8) or compiled into the kernel file), or the boot loader option setting is used for the normal root filesystems. For an NFS-mounted normal root filesystem, one has to use the B<nfs_root_name> and B<nfs_root_addrs> boot options to give the NFS settings. For more information on NFS-mounted root see the kernel documentation file I<Documentation/filesystems/nfs/nfsroot.txt> (or I<Documentation/filesystems/nfsroot.txt> before Linux 2.6.33). For more information on setting the root filesystem see also the B<LILO> and B<LOADLIN> documentation.
de: Standardmäßig werden die Kernel-Einstellungen (z. B. mit B<rdev>(8) in der Kernel-Datei gesetzt oder in die Kernel-Datei kompiliert) oder die Options-Einstellungen des Boot-Loaders für das normale Wurzeldateisystem verwendet. Für ein über NFS eingebundenes normales Wurzeldateisystem müssen die Boot-Optionen B<nfs_root_name> und B<nfs_root_addrs> genutzt werden, um die NFS-Einstellungen zu übergeben. Für weitere Informationen über via NFS eingebundene Wurzeldateisysteme lesen Sie die Kernel-Dokumentation in der Datei I<Documentation/filesystems/nfs/nfsroot.txt> (oder I<Documentation/filesystems/nfsroot.txt> vor Linux 2.6.33). Weitere Informationen über das Einstellen des Wurzeldateisystems finden sich in den Dokumentationen von B<LILO> und B<LOADLIN>.
es: Por defecto, las opciones establecidas del núcleo (p. ej. establecidas en el fichero del núcleo mediante B<rdev>(8) o compiladas dentro del mismo), o el establecimiento de opciones del 'boot loader' se utiliza para los sistemas de ficheros normales. Para un sistema de archivos raíz montado como NFS, debemos utilizar las opciones de arranque B<nfs_root_name> y B<nfs_root_addrs> para proporcionar/establecer las opciones de NFS. Para más información sobre sistemas raíz montados como NFS, vea el fichero de documentación del núcleo I<Documentation/filesystems/nfs/nfsroot.txt> (o I<Documentation/filesystems/nfsroot.txt> antes de Linux 2.6.33). Para más información sobre el establecimiento del sistema de archivos raíz, vea también la documentación de B<LILO> y B<LOADLIN>.

source: It is also possible for the I</linuxrc> executable to change the normal root device. For I</linuxrc> to change the normal root device, I</proc> must be mounted. After mounting I</proc>, I</linuxrc> changes the normal root device by writing into the proc files I</proc/sys/kernel/real-root-dev>, I</proc/sys/kernel/nfs-root-name>, and I</proc/sys/kernel/nfs-root-addrs>. For a physical root device, the root device is changed by having I</linuxrc> write the new root filesystem device number into I</proc/sys/kernel/real-root-dev>. For an NFS root filesystem, the root device is changed by having I</linuxrc> write the NFS setting into files I</proc/sys/kernel/nfs-root-name> and I</proc/sys/kernel/nfs-root-addrs> and then writing 0xff (e.g., the pseudo-NFS-device number) into file I</proc/sys/kernel/real-root-dev>. For example, the following shell command line would change the normal root device to I</dev/hdb1>:
de: Die ausführbare Datei I</linuxrc> kann auch das normale Wurzelgerät ändern. Damit I</linuxrc> das normale Wurzelgerät ändern kann, muss I</proc> eingehängt sein. Nach dem Einhängen von I</proc> ändert I</linuxrc> das normale Wurzelgerät durch das Schreiben in die proc-Dateien I</proc/sys/kernel/real-root-dev>, I</proc/sys/kernel/nfs-root-name> und I</proc/sys/kernel/nfs-root-addrs>. Ein physisches Wurzelgerät wird geändert, indem I</linuxrc> die Gerätenummer des neuen Wurzeldateisystems in I</proc/sys/kernel/real-root-dev> schreibt. Für ein NFS-Wurzeldateisystem wird das Wurzelgerät geändert, indem I</linuxrc> die NFS-Einstellung in die Dateien I</proc/sys/kernel/nfs-root-name> und I</proc/sys/kernel/nfs-root-addrs> schreibt und dann 0xff (z. B. die NFS-Pseudo-Gerätenummer) in die Datei I</proc/sys/kernel/real-root-dev> schreibt. Zum Beispiel würde der folgende Shell-Befehl das normale Wurzelgerät auf I</dev/hdb1> ändern:
es: También es posible para el ejecutable de B</linuxrc> cambiar el dispositivo raíz por defecto. Para que B</linuxrc> cambie este dispositivo, B</proc> debe estar montado. Tras montar B</proc>, B</linuxrc> cambia el disp. raíz habitual escribiendo en los ficheros B</proc/sys/kernel/real-root-dev>, B</proc/sys/kernel/nfs-root-name>, y B</proc/sys/kernel/nfs-root-addrs>. Para un dispositivo raíz físico, éste se cambia haciendo que B</linuxrc> escriba el nuevo número de sistema de ficheros en B</proc/sys/kernel/real-root-dev>. Para un sistema raíz NFS, el disp. raíz se cambia haciendo que B</linuxrc> escriba la opción de NFS en los ficheros B</proc/sys/kernel/nfs-root-name> y B</proc/sys/kernel/nfs-root-addrs> y después escriba 0xff (p.ej. el número de pseudo-dispositivo-NFS) en el fichero B</proc/sys/kernel/real-root-dev>.Por ejemplo, la siguiente línea de órdenes del shell cambiaría el disp. raíz a B</dev/hdb1>:

source: For an NFS example, the following shell command lines would change the normal root device to the NFS directory I</var/nfsroot> on a local networked NFS server with IP number 193.8.232.7 for a system with IP number 193.8.232.2 and named "idefix":
de: Ein NFS-Beispiel: Die folgenden Shell-Befehlszeilen würden das normale Wurzelgerät für ein System mit der IP-Nummer 193.8.232.2 und dem Namen »idefix« auf das NFS-Verzeichnis I</var/nfsroot> auf einem NFS-Server mit der IP-Nummer 193.8.232.7 im lokalen Netzwerk ändern:
es: Como ejemplo para sistemas NFS, las siguientes líneas de órdenes cambiarían el dispositivo raíz al directorio NFS I</var/nfsroot> en un servidor NFS local con dirección IP 193.8.232.7 para un sistema con dirección 193.8.232.2 llamado 'idefix':

source: B<Note>: The use of I</proc/sys/kernel/real-root-dev> to change the root filesystem is obsolete. See the Linux kernel source file I<Documentation/admin-guide/initrd.rst> (or I<Documentation/initrd.txt> before Linux 4.10) as well as B<pivot_root>(2) and B<pivot_root>(8) for information on the modern method of changing the root filesystem.
de: B<Hinweis>: Die Verwendung von I</proc/sys/kernel/real-root-dev> für die Änderung des Wurzeldateisystems ist veraltet. Die Linux-Kernel-Quelldatei I<Documentation/admin-guide/initrd.rst> (oder I<Documentation/initrd.txt> vor Linux 4.10) sowie B<pivot_root>(2) und B<pivot_root>(8) informieren über das moderne Verfahren zur Änderung des Wurzeldateisystems.
es: B<Nota>: el empleo de I</proc/sys/kernel/real-root-dev> para modificar el sistema de archivos raiz está obsoleto. Consulte el archivo I<Documentation/admin-guide/initrd.rst> (o I<Documentation/initrd.txt> antes de Linux 4.10) asi como B<pivot_root>(2) y B<pivot_root>(8) para ver un método más reciente de hacerlo.

source: Usage
de: Verwendung
es: Modo de empleo

source: The main motivation for implementing B<initrd> was to allow for modular kernel configuration at system installation.
de: Die Hauptmotivation für die Implementierung von B<initrd> war, bei der Installation des Systems eine modulare Kernel-Konfiguration zu ermöglichen.
es: La principal motivación para implementar B<initrd> fue la de permitir una configuración modular del núcleo en el momento de la instalación.

source: A possible system installation scenario is as follows:
de: Ein mögliches Szenario für eine Systeminstallation ist das folgende:
es: Aquí se describe un posible escenario de la instalación del sistema:

source: The loader program boots from floppy or other media with a minimal kernel (e.g., support for I</dev/ram>, I</dev/initrd>, and the ext2 filesystem) and loads I</dev/initrd> with a gzipped version of the initial filesystem.
de: Das Ladeprogramm startet von einer Diskette oder einem anderen Medium mit einem minimalen Kernel (beispielsweise mit Unterstützung für I</dev/ram>, I</dev/initrd> und das ext2-Dateisystem) und lädt I</dev/initrd> mit einer komprimierten Version des anfänglichen Dateisystems.
es: El programa cargador arranca desde disquete u otro medio con un núcleo mínimo(p.ej. con soporte para I</dev/ram>, I</dev/initrd>, y el sistema de ficheros ext2) y carga I</dev/initrd> con una versión comprimida (con gzip) del sistema de ficheros inicial.
