Repository: sebras/manpages-l10n
Catalog: po/*/man4/initrd.4.po
Languages: de, es

source: The executable I</linuxrc> determines what is needed to (1) mount the normal root filesystem (i.e., device type, device drivers, filesystem) and (2) the distribution media (e.g., CD-ROM, network, tape, ...). This can be done by asking the user, by auto-probing, or by using a hybrid approach.
de: Die ausführbare Datei I</linuxrc> bestimmt, was für (1) das Einhängen des normalen Wurzeldateisystems (z.B. Gerätetyp, Gerätetreiber, Dateisystem) und (2) der Installationsmedien (z.B. CD-ROM, Netzwerk, Band, …) erforderlich ist. Dies kann durch Befragung des Benutzers, dem Selbstuchen des Gerätes oder mit einem hybriden Ansatz erfolgen.
es: El ejecutable I</linuxrc> determina lo que se necesita para montar, B<mount>(1), el sistema de ficheros raíz normal (p.ej. tipo de dispositivo, controladores, sistema de ficheros) y (2) el formato 'de distribución' (p.ej. CD-ROM, red, cinta, ...). Esto se puede hacer preguntando al usuario, tanteando/probando automáticamente, o mediante una aproximación mixta.

source: The executable I</linuxrc> loads the necessary modules from the initial root filesystem.
de: Die ausführbare Datei I</linuxrc> lädt die notwendigen Module aus dem anfänglichen Wurzeldateisystem.
es: El ejecutable I</linuxrc> carga los módulos necesarios desde el sistema de ficheros inicial.

source: The executable I</linuxrc> creates and populates the root filesystem. (At this stage the normal root filesystem does not have to be a completed system yet.)
de: Die ausführbare Datei I</linuxrc> erstellt und füllt das Wurzeldateisystem. (In diesem Stadium muss das normale Wurzeldateisystem noch kein vollständiges System sein.)
es: El ejecutable I</linuxrc> crea y 'expande' el sistema de ficheros raíz. (En esta etapa, el sistema raíz no tiene por qué ser aún un sistema completo.)

source: The executable I</linuxrc> sets I</proc/sys/kernel/real-root-dev>, unmounts I</proc>, the normal root filesystem and any other filesystems it has mounted, and then terminates.
de: Die ausführbare Datei I</linuxrc> schreibt I</proc/sys/kernel/real-root-dev>, hängt I</proc>, das normale Wurzeldateisystem und alle weiteren von ihm eingehängten Dateisysteme aus und beendet sich dann.
es: El ejecutable I</linuxrc> establece I</proc/sys/kernel/real-root-dev,> desmonta I</proc>, el sistema de ficheros raíz y cualquier otro sist. de ficheros que hubiese montado, y entonces termina.

source: The kernel then mounts the normal root filesystem.
de: Der Kernel bindet dann das normale Wurzeldateisystem ein.
es: El núcleo entonces monta el sistema de ficheros definitivo.

source: Now that the filesystem is accessible and intact, the boot loader can be installed.
de: Nachdem das System intakt ist und darauf zugegriffen werden kann, kann der Boot-Loader installiert werden.
es: Ahora que el sist. de ficheros está accesible e intacto, el gestor de arranque puede ser instalado.

source: The boot loader is configured to load into I</dev/initrd> a filesystem with the set of modules that was used to bring up the system. (e.g., device I</dev/ram0> can be modified, then unmounted, and finally, the image is written from I</dev/ram0> to a file.)
de: Der Boot-Loader ist so konfiguriert, dass er in I</dev/initrd> ein Dateisystem mit dem Satz von Modulen lädt, die beim Systemstart eingesetzt waren. (z.B. kann das Gerät I</dev/ram0> modifiziert, danach ausgehängt und schließlich sein Abbild (Image) in eine Datei geschrieben werden.)
es: El gestor de arranque está configurado para cargarse en I</dev/initrd>, un sistema de ficheros con el conjunto de módulos que fue utilizado para poner en marcha el sistema. (p.ej. El dispositivo I</dev/ram0> puede ser modificado, después desmontado, y finalmente, la imagen es escrita desde I</dev/ram0> a un fichero.)

source: The system is now bootable and additional installation tasks can be performed.
de: Das System ist nun bootfähig und zusätzliche Installationsaufgaben können durchgeführt werden.
es: El sistema es ahora capaz de arrancar, y se pueden abordar nuevas tareas de la instalación.

source: The key role of I</dev/initrd> in the above is to reuse the configuration data during normal system operation without requiring initial kernel selection, a large generic kernel or, recompiling the kernel.
de: Die Schlüsselrolle von I</dev/initrd> im Vorgehenden ist es, die Konfigurationsdaten während des normalen Betriebs weiter zu verwenden, ohne dass der ursprüngliche Kernel ausgewählt, ein großer generischer Kernel eingesetzt oder ein Kernel neu kompiliert werden muss.
es: El papel clave de I</dev/initrd> en el proceso es el de reutilizar los datos de configuración durante el funcionamiento habitual del sistema sin que se requiera una selección inicial del núcleo, o un núcleo genérico demasiado grande, o recompilarlo.

source: A second scenario is for installations where Linux runs on systems with different hardware configurations in a single administrative network. In such cases, it may be desirable to use only a small set of kernels (ideally only one) and to keep the system-specific part of configuration information as small as possible. In this case, create a common file with all needed modules. Then, only the I</linuxrc> file or a file executed by I</linuxrc> would be different.
de: Ein zweites Szenario sind Netzwerk-Installationen, in denen Linux auf Systemen mit verschiedenen Hardware-Konfigurationen läuft. In solchen Fällen kann es wünschenswert sein, nur eine kleine Gruppe von Kerneln (im Idealfall nur einen) zu verwenden und den systemspezifischen Teil der Konfigurationsinformationen so klein wie möglich zu halten. Erstellen Sie für diesen Fall eine gemeinsame Datei mit allen benötigten Modulen. Dann muss nur die Datei I</linuxrc> oder eine von I</linuxrc> ausgeführte Datei individuell angepasst werden.
es: Un segundo escenario se presenta para instalaciones en las que Linux corre en sistemas con diferentes configuraciones 'hardware' en una misma red. En estos casos, puede ser deseable utilizar sólo un pequeño conjunto de núcleos (idealmente, uno) y mantener la parte específica de la configuración de cada sistema tan pequeña como sea posible. En este caso, se crea un fichero común con todos los módulos requeridos.Entonces, sólo el fichero I</linuxrc> o un fichero ejecutado por I</linuxrc> sería diferente.

source: A third scenario is more convenient recovery disks. Because information like the location of the root filesystem partition is not needed at boot time, the system loaded from I</dev/initrd> can use a dialog and/or auto-detection followed by a possible sanity check.
de: Ein drittes Szenario sind komfortable Reparatur-CDs. Weil Informationen wie die Position der Wurzeldateisystem-Partition zur Boot-Zeit nicht erforderlich sind, kann das aus I</dev/initrd> geladene System einen Dialog und/oder eine automatische Erkennung verwenden und dem eine Plausibilitätsprüfung folgen lassen.
es: Un tercer ejemplo es más conveniente para discos 'de rescate'. Debido a que cierta información como la localización de la partición del sistema de ficheros raíz no se necesita en el momento del arranque, el sistema cargado desde I</dev/initrd> puede utilizar un diálogo y/o autodetección seguido posiblemente de un chequeo a este sistema de ficheros.

source: Last but not least, Linux distributions on CD-ROM may use B<initrd> for easy installation from the CD-ROM. The distribution can use B<LOADLIN> to directly load I</dev/initrd> from CD-ROM without the need of any floppies. The distribution could also use a B<LILO> boot floppy and then bootstrap a bigger RAM disk via I</dev/initrd> from the CD-ROM.
de: Nicht zuletzt können Linux-Distributionen auf CD-ROM B<initrd> für die einfache Installation von der CD-ROM verwenden. Die Distribution kann B<LOADLIN> verwenden, um I</dev/initrd> direkt von der CD-ROM zu laden und Disketten überflüssig zu machen. Die Distribution könnte auch eine B<LILO>-Bootdiskette verwenden und dann über I</dev/initrd> eine größere RAM-Disk von der CD-ROM laden.
es: Por último, pero no menos importante, las distribuciones de Linux en CD-ROM pueden utilizar B<initrd> para facilitar la instalación desde el CD-ROM. La distribución puede utilizar B<LOADLIN> para cargar directamente I</dev/initrd> desde el CD-ROM sin necesitar ningún disquete. La distribución podría también utilizar un disco de arranque con B<LILO> y después cargar un disco-RAM más grande a través de I</dev/initrd> desde el CD-ROM.

source: FILES
de: DATEIEN
es: ARCHIVOS

source: NOTES
de: ANMERKUNGEN
es: NOTAS

source: With the current kernel, any filesystems that remain mounted when I</dev/ram0> is moved from I</> to I</initrd> continue to be accessible. However, the I</proc/mounts> entries are not updated.
de: Beim aktuellen Kernel kann auf Dateisysteme, die während der Verschiebung von I</dev/ram0> von I</> nach I</initrd> eingehängt waren, weiterhin zugegriffen werden. Die Einträge in I</proc/mounts> werden aber nicht aktualisiert.
es: Con el núcleo actual, cualquier sistema de ficheros que permanezca montado cuando I</dev/ram0> es movido desde I</> a I</initrd> continúa siendo accesible. Sin embargo, la información en I</proc/mounts> no es actualizada.

source: With the current kernel, if directory I</initrd> does not exist, then I</dev/ram0> will B<not> be fully unmounted if I</dev/ram0> is used by any process or has any filesystem mounted on it. If I</dev/ram0> is B<not> fully unmounted, then I</dev/ram0> will remain in memory.
de: Mit dem aktuellen Kernel wird bei fehlendem I</initrd> I</dev/ram0> B<nicht> völlig ausgehängt werden, wenn es von einem Prozess verwendet wird oder in I</dev/ram0> ein Dateisystem eingehängt ist. Wenn I</dev/ram0> B<nicht> vollständig ausgehängt ist, verbleibt I</dev/ram0> im Speicher.
es: Con el núcleo actual, si el directorio B</initrd> no existe, entonces I</dev/ram0> no será completamente desmontado si I</dev/ram0> está siendo utilizado por algún proceso o mantiene algún sistema de ficheros montado en él. Si no se desmonta completamente I</dev/ram0>, entonces I</dev/ram0> permanecerá en memoria.

source: Users of I</dev/initrd> should not depend on the behavior given in the above notes. The behavior may change in future versions of the Linux kernel.
de: Anwender von I</dev/initrd> sollten sich nicht auf das in diesen Anmerkungen beschriebene Verhalten verlassen. Das Verhalten kann sich in zukünftigen Kernel-Versionen ändern.
es: Los usuarios de I</dev/initrd> no deberían depender del comportamiento indicado en las notas anteriores. Este comportamiento puede cambiar en futuras versiones del núcleo de Linux.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: I<Documentation/admin-guide/initrd.rst> (or I<Documentation/initrd.txt> before Linux 4.10) in the Linux kernel source tree, the LILO documentation, the LOADLIN documentation, the SYSLINUX documentation
de: I<Documentation/admin-guide/initrd.rst> (oder I<Documentation/initrd.txt> vor Linux 4.10) im Linux-Kernelquelltext-Verzeichnis und die Dokumentationen von LILO, LOADLIN und SYSLINUX
es: I<Documentation/admin-guide/initrd.rst> (o I<Documentation/initrd.txt> antes de Linux 4.10) en la documentación del núcleo de Linux , la documentación de LILO, de LOADLIN y de SYSLINUX.

source: COLOPHON
de: KOLOPHON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: I</dev/initrd> is a read-only block device assigned major number 1 and minor number 250. Typically I</dev/initrd> is owned by I<root.disk> with mode 0400 (read access by root only). If the Linux system does not have I</dev/initrd> already created, it can be created with the following commands:
de: I</dev/initrd> ist ein nur lesbares Blockgerät mit der Major-Nummer 1 und der Minor-Nummer 250. Typischerweise ist I<root.disk> der Besitzer von I</dev/initrd>; die Zugriffsrechte sind auf 0400 gesetzt (Lesezugriff nur für root). Wenn I</dev/initrd> nicht schon im Linux-System eingerichtet wurde, kann sie mit den folgenden Befehlen erstellt werden:
es: El dispositivo de bloques B</dev/initrd> es de sólo lectura, al que se le asigna como número mayor 1 y como número menor 250. Típicamente B</dev/initrd> es propiedad de B<root.disk> con modo 0400 (con acceso de lectura sólo para el 'root'). Si el sistema no tiene creado B</dev/initrd> todavía, puede crearse con las siguientes órdenes:

source: Specifies the device to be used as the normal root filesystem. For B<LOADLIN> this is a command-line option. For B<LILO> this is a boot time option or can be used as an option line in the B<LILO> configuration file I</etc/lilo.config>. The device specified by the this option must be a mountable device having a suitable root filesystem.
de: Gibt das Gerät an, das als normales Wurzeldateisystem verwendet werden soll. Für B<LOADLIN> ist dies ist eine Befehlszeilen-Option. Für B<LILO> kann diese Option beim Systemstart oder als Optionszeile in der B<LILO>-Konfigurationsdatei I</etc/lilo.config> verwendet werden. Das durch diese Option angegebene Gerät muss eingehängt werden können und ein geeignetes Wurzeldateisystem enthalten.
es: Especifica el dispositivo que será utilizado como sistema de ficheros normal (raíz). Para B<LOADLIN> esta es una opción de línea de órdenes. Para B<LILO> esta es una opción para el momento de arranque o puede utilizarse como línea de opción en el fichero de configuración de B<LILO>, I</etc/lilo.config>. El dispositivo indicado por la opción debe ser un dispositivo 'montable', y contener un sistema de ficheros raíz adecuado.

source: The executable I</linuxrc> sets I</proc/sys/kernel/real-root-dev>, unmount I</proc>, the normal root filesystem and any other filesystems it has mounted, and then terminates.
de: Die ausführbare Datei I</linuxrc> schreibt I</proc/sys/kernel/real-root-dev>, hängt I</proc>, das normale Wurzeldateisystem und alle weiteren von ihm eingehängten Dateisysteme aus und beendet sich dann.
es: El ejecutable I</linuxrc> establece I</proc/sys/kernel/real-root-dev,> desmonta I</proc>, el sistema de ficheros raíz y cualquier otro sist. de ficheros que hubiese montado, y entonces termina.

source: The boot loader is configured to load into I</dev/initrd> a filesystem with the set of modules that was used to bring up the system. (e.g., Device I</dev/ram0> can be modified, then unmounted, and finally, the image is written from I</dev/ram0> to a file.)
de: Der Boot-Loader ist so konfiguriert, dass er in I</dev/initrd> ein Dateisystem mit dem Satz von Modulen lädt, die beim Systemstart eingesetzt waren. (z.B. kann I</dev/ram0> modifiziert, danach ausgehängt und schließlich sein Abbild (Image) in eine Datei geschrieben werden.)
es: El gestor de arranque está configurado para cargarse en I</dev/initrd>, un sistema de ficheros con el conjunto de módulos que fue utilizado para poner en marcha el sistema. (p.ej. El dispositivo I</dev/ram0> puede ser modificado, después desmontado, y finalmente, la imagen es escrita desde I</dev/ram0> a un fichero.)

source: Users of I</dev/initrd> should not depend on the behavior give in the above notes. The behavior may change in future versions of the Linux kernel.
de: Anwender von I</dev/initrd> sollten sich nicht auf das in diesen Anmerkungen beschriebene Verhalten verlassen. Das Verhalten kann sich in zukünftigen Kernel-Versionen ändern.
es: Los usuarios de I</dev/initrd> no deberían depender del comportamiento indicado en las notas anteriores. Este comportamiento puede cambiar en futuras versiones del núcleo de Linux.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
