Repository: sebras/manpages-l10n
Catalog: po/*/man4/wavelan.4.po
Languages: de, es

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: wavelan - AT&T GIS WaveLAN ISA device driver
de: wavelan - Gerätetreiber für AT&T GIS und WaveLAN ISA
es: wavelan - controlador del dispositivo AT&T GIS WaveLAN ISA

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: I<This driver is obsolete:> it was removed from the kernel in version 2.6.35.
de: I<Dieser Treiber ist veraltet:> Er wurde in Version 2.6.35 aus dem Kernel entfernt.
es: I<Este controlador está obsoleto:> se eliminó en la versión 2.6.35 del núcleo.

source: B<wavelan> is the low-level device driver for the NCR / AT&T / Lucent B<WaveLAN ISA> and Digital (DEC) B<RoamAbout DS> wireless ethernet adapter. This driver is available as a module or might be compiled in the kernel. This driver supports multiple cards in both forms (up to 4) and allocates the next available ethernet device (eth0..eth#) for each card found, unless a device name is explicitly specified (see below). This device name will be reported in the kernel log file with the MAC address, NWID, and frequency used by the card.
de: B<wavelan> ist der hardwarenahe Gerätetreiber für den Ethernet-Funkadapter B<RoamAbout DS> von NCR / AT&T / Lucent und B<WaveLAN ISA> von Digital (DEC). Dieser Treiber ist als Modul verfügbar, könnte aber auch in den Kernel kompiliert sein. Er unterstützt mehrere Karten in beiden Varianten (bis zu 4) und ordnet jeder gefundenen Karte das nächste verfügbare Ethernet-Gerät (eth0 … eth#) zu, wenn nicht ein Gerätename explizit angegeben wurde (siehe unten). Dieser Gerätename wird mitsamt MAC-Adresse, NWID und der von der Karte verwendeten Frequenz in der Kernel-Log-Datei protokolliert.
es: B<wavelan> es el controlador de dispositivo de bajo nivel para el adaptador Ethernet inalámbrico B<WaveLAN ISA> de NCR / AT&T / Lucent y B<RoamAbout DS> de Digital (DEC). Este controlador está disponible como módulo o puede compilarse en el núcleo. Este controlador admite varias tarjetas en ambas formas (hasta 4) y asigna el siguiente controlador Ethernet disponible (eth0..eth#) para cada tarjeta que encuentra, a menos que se especifique explícitamente un nombre de dispositivo (vea más adelante). Este nombre de dispositivo será registrado en el archivo de registro del núcleo con la dirección física (MAC), NWID y frecuencia empleada por la tarjeta.

source: Parameters
de: Parameter
es: Parámetros

source: This section applies to the module form (parameters passed on the B<insmod>(8) command line). If the driver is included in the kernel, use the I<ether=IRQ,IO,NAME> syntax on the kernel command line.
de: Dieser Abschnitt beschreibt die Modul-Variante (diese Parameter werden auf der Befehlszeile von B<insmod>(8) übergeben). Wenn der Treiber in den Kernel integriert ist, verwenden Sie die Syntax I<ether=IRQ,IO,NAME> auf der Kernel-Befehlszeile.
es: Esta sección se aplica al módulo (parámetros pasados en la línea de orden de B<insmod>(8)). Si el controlador se incluye en el núcleo, emplee la sintaxis I<ether=IRQ,IO,NAME> en la línea de órdenes del núcleo.

source: Specify the list of base addresses where to search for wavelan cards (setting by dip switch on the card). If you don't specify any io address, the driver will scan 0x390 and 0x3E0 addresses, which might conflict with other hardware...
de: übergibt die Liste der Basis-Adressen (Einstellung über DIP-Schalter auf der Karte), an denen nach Wavelan-Karten gesucht werden soll. Wenn Sie keine E-/A-Adresse angeben, wird der Treiber die Adressen 0x390 und 0x3E0 überprüfen. Diese Adressen könnten möglicherweise in Konflikt mit anderer Hardware stehen …
es: Especifica la lista de direcciones de base donde buscar tarjetas Wavelan (se establece por medio de un interruptor en la tarjeta). Si no se especifica ninguna dirección io, el controlador rastreará las direcciones 0x390 y 0x3E0, que pueden entrar en conflicto con otro hardware...

source: Set the list of IRQs that each wavelan card should use (the value is saved in permanent storage for future use).
de: zählt die IRQs auf, die jede wavelan-Karte verwenden sollte. (Der Wert wird für eine spätere Verwendung in nichtflüchtigem Speicher abgelegt).
es: Establece la lista de interrupciones (IRQs) que cada tarjeta Wavelan podría utilizar (el valor se guarda en almacenamiento permanente para un uso futuro).

source: Set the list of names to be used for each wavelan card device (name used by B<ifconfig>(8)).
de: zählt die Namen auf, die für jedes der den wavelan-Karten zugeordneten Geräte verwendet werden sollten. (Dieser Name wird von B<ifconfig>(8) verwendet.)
es: Establece la lista de nombres que serán empleados para cada dispositivo tarjeta Wavelan (nombres empleados por B<ifconfig>(8)).

source: Wireless extensions
de: Funk-Erweiterungen
es: Extensiones inalámbricas

source: Use B<iwconfig>(8) to manipulate wireless extensions.
de: Verwenden Sie B<iwconfig>(8), um Funk-Erweiterungen zu manipulieren.
es: Emplee B<iwconfig>(8) para manipular extensiones inalámbricas.

source: NWID (or domain)
de: NWID (oder Domain)
es: NWID (o dominio)

source: Set the network ID [I<0> to I<FFFF>] or disable it [I<off>]. As the NWID is stored in the card Permanent Storage Area, it will be reused at any further invocation of the driver.
de: setzt die Netzwerkkennung [I<0> bis I<FFFF>] oder deaktiviert sie [I<off>]. Da die NWID im nichtflüchtigen Speicher der Karte gespeichert wird, wird sie bei jedem weiteren Aufruf des Treibers wieder verwendet.
es: Establece la ID de red [I<0> a I<FFFF>] o la inhabilita [I<off>]. Como el NWID se almacena en el Área de Almacenamiento Permanente de la tarjeta, será reutilizado en cualquier llamada posterior del controlador.

source: Frequency & channels
de: Frequenz und Kanäle
es: Frecuencia y canales

source: For the 2.4\ GHz 2.00 Hardware, you are able to set the frequency by specifying one of the 10 defined channels (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> or I<2.484>) or directly as a numeric value. The frequency is changed immediately and permanently. Frequency availability depends on the regulations...
de: Für die 2,4-GHz-2.00-Hardware können Sie die Frequenz durch die Angabe eines der zehn definierten Kanäle (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> oder I<2.484>) oder direkt durch einen numerischen Wert festlegen. Die Frequenz wird sofort und dauerhaft geändert. Die Frequenzverfügbarkeit hängt von den geltenden Vorschriften ab …
es: Para el hardware 2.00 a 2,4\ GHz, es posible establecer la frecuencia especificando uno de los 10 canales definidos (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> o I<2.484>) o directamente su valor. La frecuencia se cambia inmediata y permanentemente. La disponibilidad de la frecuencia depende de los reglamentos y regulaciones...

source: Statistics spy
de: Statistik-Spion
es: Estadísticas de espía

source: Set a list of MAC addresses in the driver (up to 8) and get the last quality of link for each of those (see B<iwspy>(8)).
de: legt eine Liste von (bis zu 8) MAC-Adressen im Treiber an und ermittelt für jede von ihnen die Qualität der letzten Verbindung (siehe B<iwspy>(8)).
es: Establece una lista de direcciones Ethernet (MAC) en el dispositivo (hasta 8) y obtiene la última calidad de enlace para cada una de ellas (vea B<iwspy>(8)).

source: I<status> is the status reported by the modem. I<Link quality> reports the quality of the modulation on the air (direct sequence spread spectrum) [max = 16]. I<Level> and I<Noise> refer to the signal level and noise level [max = 64]. The I<crypt discarded packet> and I<misc discarded packet> counters are not implemented.
de: I<status> ist der vom Modem berichtete Status. I<Link quality> meldet die Qualität der Modulation (Direct Sequence Spread Spectrum) [max = 16]. I<Level> und I<Noise> beziehen sich auf die Signalstärke und Rauschpegel [max = 64]. Die Zähler I<crypt discarded packet> und I<misc discarded packet> sind nicht implementiert.
es: I<status> es el estado según informa el módem. I<Calidad de enlace> informa de la calidad de la modulación en el aire (espectro extendido de secuencia directa) [max = 16]. I<Level> y I<Noise> se refieren al nivel de señal y nivel de ruido [max = 64 ]. Los contadores I<crypt discarded packet> y I<misc discarded packet> no están implementados.

source: Private ioctl
de: Interne Ioctl
es: Ioctl privado

source: You may use B<iwpriv>(8) to manipulate private ioctls.
de: Mit B<iwpriv>(8) können Sie interne Ioctls manpipulieren.
es: Es posible puede utilizar B<iwpriv>(8) para manipular ioctls privadas.

source: Quality and level threshold
de: Qualität und Pegelschwellwert
es: Umbral de Calidad y Nivel

source: Enables you to define the quality and level threshold used by the modem (packet below that level are discarded).
de: Ermöglicht Ihnen, die vom Modem verwendete Qualität und den verwendeten Schwellwert zu bestimmen. (Pakete unterhalb dieser Schwelle werden verworfen.)
es: Le permite definir el umbral de calidad y nivel empleado por el módem (un paquete por debajo de ese nivel es descartado).

source: Histogram
de: Histogramm
es: Histograma

source: This functionality makes it possible to set a number of signal level intervals and to count the number of packets received in each of those defined intervals. This distribution might be used to calculate the mean value and standard deviation of the signal level.
de: Mit dieser Funktion können Sie einen Satz von Signalstärke-Intervallen festlegen und die Anzahl der Pakete zählen, deren Signalstärke in einem der Intervalle lag. Diese Verteilung könnte zur Berechnung von Mittelwert und Standardabweichung der Signalstärke verwendet werden.
es: Esta funcionalidad posibilita el establecimento de un número de intervalos de nivel de señal y contar el número de paquetes recibidos en cada uno de estos intervalos definidos. Esta distribución podría emplearse para calcular el valor medio y la desviación estándar del nivel de señal.

source: Specific notes
de: Spezielle Hinweise
es: Notas específicas

source: This driver fails to detect some B<non-NCR/AT&T/Lucent> Wavelan cards. If this happens for you, you must look in the source code on how to add your card to the detection routine.
de: Dieser Treiber erkennt einige B<nicht von NCR/AT&T/Lucent produzierte> Wavelan-Karten nicht. Wenn Sie davon betroffen sind, müssen Sie den Quelltext anpassen, um Ihre Karte in der Erkennungsroutine einzufügen.
es: Este controlador fallará en la detección de algunas tarjetas Wavelan B<no de NCR/ATT&T/Lucent>. Para solucionarlo, debe mirar en el código fuente cómo añadir la tarjeta en la rutina de detección.

source: Some of the mentioned features are optional. You may enable to disable them by changing flags in the driver header and recompile.
de: Ein Teil der erwähnten Fähigkeiten ist optional. Sie können aktiviert oder deaktiviert werden, indem Sie die Schalter in der Header-Datei des Treibers ändern und den Treiber neu kompilieren.
es: Algunas de las características mencionadas son opcionales. Es posible habilitarlas o inhabilitarlas cambiando constantes en el archivo de cabecera del controlador y recompilando.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: B<wavelan> is the low-level device driver for the NCR / AT&T / Lucent B<WaveLAN ISA> and Digital (DEC) B<RoamAbout DS> wireless ethernet adapter. This driver is available as a module or might be compiled in the kernel. This driver supports multiple cards in both forms (up to 4) and allocates the next available ethernet device (eth0..eth#) for each card found, unless a device name is explicitly specified (see below). This device name will be reported in the kernel log file with the MAC address, NWID and frequency used by the card.
de: B<wavelan> ist der hardwarenahe Gerätetreiber für den Ethernet-Funkadapter B<RoamAbout DS> von NCR / AT&T / Lucent und B<WaveLAN ISA> von Digital (DEC). Dieser Treiber ist als Modul verfügbar, könnte aber auch in den Kernel kompiliert sein. Er unterstützt mehrere Karten in beiden Varianten (bis zu 4) und ordnet jeder gefundenen Karte das nächste verfügbare Ethernet-Gerät (eth0 … eth#) zu, wenn nicht ein Gerätename explizit angegeben wurde (siehe unten). Dieser Gerätename wird mitsamt MAC-Adresse, NWID und der von der Karte verwendeten Frequenz in der Kernel-Log-Datei protokolliert.
es: B<wavelan> es el controlador de dispositivo de bajo nivel para el adaptador Ethernet inalámbrico B<WaveLAN ISA> de NCR / AT&T / Lucent y B<RoamAbout DS> de Digital (DEC). Este controlador está disponible como módulo o puede compilarse en el núcleo. Este controlador admite varias tarjetas en ambas formas (hasta 4) y asigna el siguiente controlador Ethernet disponible (eth0..eth#) para cada tarjeta que encuentra, a menos que se especifique explícitamente un nombre de dispositivo (vea más abajo). Este nombre de dispositivo será registrado en el archivo de registro del núcleo con la dirección física (MAC), NWID y frecuencia empleada por la tarjeta.

source: COLOPHON
de: KOLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: I<wavelan> is the low-level device driver for the NCR / AT&T / Lucent B<WaveLAN ISA> and Digital (DEC) B<RoamAbout DS> wireless ethernet adapter. This driver is available as a module or might be compiled in the kernel. This driver supports multiple cards in both forms (up to 4) and allocates the next available ethernet device (eth0..eth#) for each card found, unless a device name is explicitly specified (see below). This device name will be reported in the kernel log file with the MAC address, NWID and frequency used by the card.
de: I<wavelan> ist der hardwarenahe Gerätetreiber für den Ethernet-Funkadapter B<RoamAbout DS> von NCR / AT&T / Lucent und B<WaveLAN ISA> von Digital (DEC). Dieser Treiber ist als Modul verfügbar, könnte aber auch in den Kernel kompiliert sein. Er unterstützt mehrere Karten in beiden Varianten (bis zu 4) und ordnet jeder gefundenen Karte das nächste verfügbare Ethernet-Gerät (eth0 … eth#) zu, wenn nicht ein Gerätename explizit angegeben wurde (siehe unten). Dieser Gerätename wird mitsamt MAC-Adresse, NWID und der von der Karte verwendeten Frequenz in der Kernel-Log-Datei protokolliert.
es: I<wavelan> es el controlador de dispositivo de bajo nivel para el adaptador Ethernet inalámbrico B<WaveLAN ISA> de NCR / AT&T / Lucent y B<RoamAbout DS> de Digital (DEC). Este controlador está disponible como módulo o puede compilarse en el núcleo. Este controlador admite varias tarjetas en ambas formas (hasta 4) y asigna el siguiente controlador Ethernet disponible (eth0..eth#) para cada tarjeta que encuentra, a menos que se especifique explícitamente un nombre de dispositivo (vea más abajo). Este nombre de dispositivo será registrado en el archivo de registro del núcleo con la dirección física (MAC), NWID y frecuencia empleada por la tarjeta.

source: This section apply to the module form (parameters passed on the B<insmod>(8) command line). If the driver is included in the kernel, use the I<ether=IRQ,IO,NAME> syntax on the kernel command line.
de: Dieser Abschnitt beschreibt die Modul-Variante (diese Parameter werden auf der Befehlszeile von B<insmod>(8) übergeben). Wenn der Treiber in den Kernel integriert ist, verwenden Sie die Syntax I<ether=IRQ,IO,NAME> auf der Kernel-Befehlszeile.
es: Esta sección se aplica al módulo (parámetros pasados en la línea de orden de B<insmod>(8)). Si el controlador se incluye en el núcleo, emplee la sintaxis I<ether=IRQ,IO,NAME> en la línea de órdenes del núcleo.

source: Specify the list of base address where to search for wavelan cards (setting by dip switch on the card). If you don't specify any io address, the driver will scan 0x390 and 0x3E0 addresses, which might conflict with other hardware...
de: übergibt die Liste der Basis-Adressen (Einstellung über DIP-Schalter auf der Karte), an denen nach Wavelan-Karten gesucht werden soll. Wenn Sie keine E-/A-Adresse angeben, wird der Treiber die Adressen 0x390 und 0x3E0 überprüfen. Diese Adressen könnten möglicherweise in Konflikt mit anderer Hardware stehen …
es: Especifica la lista de direcciones de base donde buscar tarjetas Wavelan (se establece por medio de un interruptor en la tarjeta). Si no se especifica ninguna dirección io, el controlador rastreará las direcciones 0x390 y 0x3E0, que pueden entrar en conflicto con otro hardware...

source: Set the list of irq that each wavelan card should use (the value is saved in permanent storage for future use).
de: zählt die IRQs auf, die jede wavelan-Karte verwenden sollte. (Der Wert wird für eine spätere Verwendung in nichtflüchtigem Speicher abgelegt).
es: Establece la lista de interrupciones (IRQ) que cada tarjeta Wavelan podría utilizar (el valor se guarda en almacenamiento permanente para un uso futuro).

source: Set the list of name to be used for each wavelan cards device (name used by B<ifconfig>(8)).
de: zählt die Namen auf, die für jedes der den wavelan-Karten zugeordneten Geräte verwendet werden sollten. (Dieser Name wird von B<ifconfig>(8) verwendet.)
es: Establece la lista de nombres que serán empleados para cada dispositivo tarjeta Wavelan (nombres empleados por B<ifconfig>(8)).

source: Set the network ID [I<0> to I<FFFF>] or disable it [I<off>]. As the NWID is stored in the card Permanent Storage Area, it will be reuse at any further invocation of the driver.
de: setzt die Netzwerkkennung [I<0> bis I<FFFF>] oder deaktiviert sie [I<off>]. Da die NWID im nichtflüchtigen Speicher der Karte gespeichert wird, wird sie bei jedem weiteren Aufruf des Treibers wieder verwendet.
es: Establece la ID de red [I<0> a I<FFFF>] o la inhabilita [I<off>]. Como el NWID se almacena en el Área de Almacenamiento Permanente de la tarjeta, será reutilizado en cualquier llamada posterior del controlador.

source: For the 2.4\ GHz 2.00 Hardware, you are able to set the frequency by specifying one of the 10 defined channels (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> or I<2.484>) or directly by its value. The frequency is changed immediately and permanently. Frequency availability depends on the regulations...
de: Für die 2,4-GHz-2.00-Hardware können Sie die Frequenz durch die Angabe eines der zehn definierten Kanäle (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> oder I<2.484>) oder direkt durch ihren Wert festlegen. Die Frequenz wird sofort und dauerhaft geändert. Die Frequenzverfügbarkeit hängt von den geltenden Vorschriften ab …
es: Para el hardware 2.00 a 2,4 GHz, es posible establecer la frecuencia especificando uno de los 10 canales definidos (I<2.412,> I<2.422, 2.425, 2.4305, 2.432, 2.442, 2.452, 2.460, 2.462> o I<2.484>) o directamente su valor. La frecuencia se cambia inmediata y permanentemente. La disponibilidad de la frecuencia depende de los reglamentos y regulaciones...

source: Enable you the define the quality and level threshold used by the modem (packet below that level are discarded).
de: Ermöglicht Ihnen, die vom Modem verwendete Qualität und den verwendeten Schwellwert zu bestimmen. (Pakete unterhalb dieser Schwelle werden verworfen.)
es: Le permite definir el umbral de calidad y nivel empleado por el módem (un paquete por debajo de ese nivel es descartado).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: B<name>
es: B<nombre>
