Repository: sebras/manpages-l10n
Catalog: po/*/man5/acct.5.po
Languages: de, es, pl

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG
es: NOMBRE
pl: NAZWA

source: acct - process accounting file
de: acct - Datei zur Prozessabrechnung
es: acct - Archivo para la contabilidad de procesos
pl: acct - plik ewidencji procesu

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS
pl: SKŁADNIA

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN
pl: OPIS

source: If the kernel is built with the process accounting option enabled (B<CONFIG_BSD_PROCESS_ACCT>), then calling B<acct>(2) starts process accounting, for example:
de: Wenn der Kernel mit aktivierter Prozessabrechnungsoption (B<CONFIG_BSD_PROCESS_ACCT>) gebaut wird, startet der Aufruf von B<acct>(2) die Prozessabrechnung. Ein Beispiel:
es: Si el núcleo fue compilado con la opción B<CONFIG_BSD_PROCESS_ACCT> activada, se podrá iniciar la contabilidad de procesos mediante la llamada B<acct>(2). Por ejemplo:
pl: Jeśli jądro zostało zbudowane z włączoną opcją ewidencjonowania procesów (B<CONFIG_BSD_PROCESS_ACCT>), to wywołanie funkcji systemowej B<acct>(2) włącza to ewidencjonowanie, na przykład:

source: When process accounting is enabled, the kernel writes a record to the accounting file as each process on the system terminates. This record contains information about the terminated process, and is defined in I<E<lt>sys/acct.hE<gt>> as follows:
de: Wenn die Prozessabrechnung aktiviert ist, schreibt der Kernel einen Datensatz in die Abrechnungsdatei, wenn ein Prozess im System endet. Dieser Datensatz enthält Informationen über den beendeten Prozess. Der Datensatz ist in I<E<lt>sys/acct.hE<gt>> wie folgt definiert:
es: Cuando la contabilidad está activada, el núcleo anota un registro en el archivo cada vez que un proceso termina. Dicho registro contiene información acerca del proceso y su estructura se define en I<E<lt>sys/acct.hE<gt>> del siguiente modo:
pl: Kiedy ewidencjonowanie procesów jest włączone, jądro zapisuje rekord do pliku ewidencji dla każdego zakończonego procesu w systemie. Rekord ten zawiera informacje o zakończonym procesie i jest zdefiniowany I<E<lt>sys/acct.hE<gt>> następująco:

source: struct acct { char ac_flag; /* Accounting flags */ u_int16_t ac_uid; /* Accounting user ID */ u_int16_t ac_gid; /* Accounting group ID */ u_int16_t ac_tty; /* Controlling terminal */ u_int32_t ac_btime; /* Process creation time (seconds since the Epoch) */ comp_t ac_utime; /* User CPU time */ comp_t ac_stime; /* System CPU time */ comp_t ac_etime; /* Elapsed time */ comp_t ac_mem; /* Average memory usage (kB) */ comp_t ac_io; /* Characters transferred (unused) */ comp_t ac_rw; /* Blocks read or written (unused) */ comp_t ac_minflt; /* Minor page faults */ comp_t ac_majflt; /* Major page faults */ comp_t ac_swaps; /* Number of swaps (unused) */ u_int32_t ac_exitcode; /* Process termination status (see wait(2)) */ char ac_comm[ACCT_COMM+1]; /* Command name (basename of last executed command; null-terminated) */ char ac_pad[I<X>]; /* padding bytes */ };
de: struct acct { char ac_flag; /* Schalter zur Steuerung der Abrechnung */ u_int16_t ac_uid; /* Benutzerkennung für Abrechnung */ u_int16_t ac_gid; /* Gruppenkennung für Abrechnung */ u_int16_t ac_tty; /* steuerndes Terminal */ u_int32_t ac_btime; /* Zeit der Erstellung des Prozesses (Sekunden seit dem 1.1.1970, 0:00 Uhr) */ comp_t ac_utime; /* CPU-Zeit Benutzer */ comp_t ac_stime; /* CPU-Zeit System */ comp_t ac_etime; /* verstrichene Zeit*/ comp_t ac_mem; /* durchschnittliche Speichernutzung (kB) */ comp_t ac_io; /* übertragene Zeichen (nicht verwendet) */ comp_t ac_rw; /* gelesene oder geschriebene Blöcke (nicht verwendet) */ comp_t ac_minflt; /* geringfügige Seitenausnahmebehandlung */ comp_t ac_majflt; /* wesentliche Seitenausnahmebehandlung */ comp_t ac_swaps; /* Anzahl der Seitenauslagerungen (nicht verwendet) */ u_int32_t ac_exitcode; /* Status bei Prozessende (siehe wait(2)) */ char ac_comm[ACCT_COMM+1]; /* Befehlsname (Name ohne Pfad des letzten ausgeführten Befehls; mit NULL-Byte abgeschlossen */ char ac_pad[I<X>];/* Bytes zur Auffüllung */ };
es: struct acct { char ac_flag; /* Opciones de la contabilidad */ u_int16_t ac_uid; /* ID del usuario*/ u_int16_t ac_gid; /* ID del grupo*/ u_int16_t ac_tty; /* Terminal que lo gestiona */ u_int32_t ac_btime; /* Hora de creación del proces (segundos desde el inicio) */ comp_t ac_utime; /* Tiempo de CPU usado por el usuario*/ comp_t ac_stime; /* Tiempo de CPU usado por el sistema */ comp_t ac_etime; /* Tiempo transcurrido */ comp_t ac_mem; /* Media del uso de memoria (kB) */ comp_t ac_io; /* Caracteres transferidos (no usado) */ comp_t ac_rw; /* Bloques leidos o escritos (no usado) */ comp_t ac_minflt; /* Errores leves de paginación */ comp_t ac_majflt; /* Errores graves de paginación */ comp_t ac_swaps; /* Cantidad de intercambios (no usado) */ u_int32_t ac_exitcode; /* Estado de finalización del proceso (consulte wait(2)) */ char ac_comm[ACCT_COMM+1]; /* Nombre de la orden (nombre de la última orden ejecutada; con salida cero) */ char ac_pad[I<X>]; /* bytes de relleno */ };
pl: struct acct { char ac_flag; /* Znaczniki ewidencjonowania */ u_int16_t ac_uid; /* ID użytkownika */ u_int16_t ac_gid; /* ID grupy */ u_int16_t ac_tty; /* Terminal sterujący */ u_int32_t ac_btime; /* Czas utworzenia procesu (w sekundach od początku epoki) */ comp_t ac_utime; /* Czas CPU użytkownika*/ comp_t ac_stime; /* Czas CPU systemu */ comp_t ac_etime; /* Czas działania procesu */ comp_t ac_mem; /* Średnie użycie pamięci (kB) */ comp_t ac_io; /* Przesłane znaki (nieużywane) */ comp_t ac_rw; /* Bloki odczytane lub zapisane (nieużywane) */ comp_t ac_minflt; /* Mniejsze błędy stron */ comp_t ac_majflt; /* Większe błędy stron */ comp_t ac_swaps; /* Liczba wymian (nieużywane) */ u_int32_t ac_exitcode; /* Status zakończenia procesu (patrz wait(2)) */ char ac_comm[ACCT_COMM+1]; /* Nazwa polecenia (zakończona znakiem null nazwa bazowa ostatnio wykonywanego polecenia) */ char ac_pad[I<X>]; /* bajty wyrównania */ };

source: enum { /* Bits that may be set in ac_flag field */ AFORK = 0x01, /* Has executed fork, but no exec */ ASU = 0x02, /* Used superuser privileges */ ACORE = 0x08, /* Dumped core */ AXSIG = 0x10 /* Killed by a signal */ };
de: enum { /* Bits, die im Feld ac_flag gesetzt werden können */ AFORK = 0x01, /* hat fork ausgeführt, aber nicht exec */ ASU = 0x02, /* hat Privilegien des Superusers genutzt */ ACORE = 0x08, /* hat Speicherauszug (core dump) erstellt */ AXSIG = 0x10 /* durch ein Signal abgebrochen */ };
es: enum { /* Esto puede definirse en el campo ac_flag */ AFORK = 0x01, /* Se ejecutó fork pero no exec */ ASU = 0x02, /* Empleó privilegios de administrador */ ACORE = 0x08, /* Volcadod e pila */ AXSIG = 0x10 /* Terminado por una señal */ };
pl: enum { /* Bity, które mogą być ustawione w polu ac_flag */ AFORK = 0x01, /* Wykonał fork, ale nie exec */ ASU = 0x02, /* Używał przywilejów administratora */ ACORE = 0x08, /* Wykonał zrzut pamięci (core) */ AXSIG = 0x10 /* Został zabity sygnałem */ };

source: The I<comp_t> data type is a floating-point value consisting of a 3-bit, base-8 exponent, and a 13-bit mantissa. A value, I<c>, of this type can be converted to a (long) integer as follows:
de: Der Datentyp I<comp_t> ist ein Fließkommawert, der aus einer 13-Bit-Mantisse und einem 3-Bit-Exponenten zur Basis besteht. Ein Wert I<c> dieses Datentyps kann wie folgt in einen (long) integer umgewandelt werden:
es: El tipo de datos I<comp_t> es un valor de punto flotante que consta de un exponente de base 8 de 3 bits y una mantisa de 13 bits. Un valor, I<c>, de este tipo se puede convertir en un entero (grande) del siguiente modo:
pl: Typ danych I<comp_t> jest wartością zmiennoprzecinkową składającą się z 3-bitowego wykładnika o podstawie 8 oraz 13-bitowej mantysy. Wartość I<c> tego typu można skonwertować do typu long integer w następujący sposób:

source: The I<ac_utime>, I<ac_stime>, and I<ac_etime> fields measure time in "clock ticks"; divide these values by I<sysconf(_SC_CLK_TCK)> to convert them to seconds.
de: Die Felder I<ac_utime>, I<ac_stime> und I<ac_etime> messen die Zeit in Takten (»clock ticks«); teilen Sie diese Werte durch I<sysconf(_SC_CLK_TCK)>, um die Zeit in Sekunden zu ermitteln.
es: Los campo I<ac_utime>, I<ac_stime> y I<ac_etime> miden el tiempo en "tics de reloj" dividiendo ese valor entre I<sysconf(_SC_CLK_TCK)> para convertirlo en segundos.
pl: Pola I<ac_utime>, I<ac_stime> oraz I<ac_etime> odmierzają czas w "tyknięciach zegara"; aby skonwertować go na sekundy, należy podzielić te wartości przez I<sysconf(_SC_CLK_TCK)>.

source: Version 3 accounting file format
de: Version 3 des Abrechnungsdateiformats
es: Formato de archivo para la versión 3
pl: Wersja 3 formatu pliku ewidencji

source: Since kernel 2.6.8, an optional alternative version of the accounting file can be produced if the B<CONFIG_BSD_PROCESS_ACCT_V3> option is set when building the kernel. With this option is set, the records written to the accounting file contain additional fields, and the width of I<c_uid> and I<ac_gid> fields is widened from 16 to 32 bits (in line with the increased size of UID and GIDs in Linux 2.4 and later). The records are defined as follows:
de: Seit Kernel 2.6.8 kann optional eine alternative Version der Abrechnungsdatei erzeugt werden, wenn beim Bau des Kernels die Option B<CONFIG_BSD_PROCESS_ACCT_V3> aktiv war. Ist diese Option gewählt, enthalten die in die Abrechnungsdatei geschriebenen Datensätze zusätzliche Felder; die Weite der Felder I<c_uid> und I<ac_gid> steigt (entsprechend der Vergrößerung der UIDs und GIDs seit Linux 2.4) von 16 auf 32 Bit. Die Datensätze sind wie folgt definiert:
es: A partir de la versión 2.6.8 del núcleo es posible crear una versión alternativa del archivo de contabilidad si el núcleo ha sido compilado con la opción B<CONFIG_BSD_PROCESS_ACCT_V3> activada. En este caso, el registro contiene algunos campos adicionales y el tamaño de los campos I<c_uid> and I<ac_gid> se incrementa de 16 a 32 bits (en línea con el incremento del tamaño de los UID y GIDs desde la versión 2.4. Estos registros se definen del siguiente modo:
pl: Od wersji jądra 2.6.8 może być tworzona alternatywna wersja pliku ewidencji, jeżeli podczas budowania jądra ustawiono opcję B<CONFIG_BSD_PROCESS_ACCT_V3>. Jeśli ta opcja jest ustawiona, to plik ewidencji zawiera dodatkowe pola, a szerokość pól I<c_uid> i I<ac_gid> jest zwiększona z 16 do 32 bitów (dostosowując do zwiększonego rozmiaru identyfikatorów użytkowników i grup w Linuksie 2.4 i późniejszych). Rekordy są zdefiniowane następująco:

source: struct acct_v3 { char ac_flag; /* Flags */ char ac_version; /* Always set to ACCT_VERSION (3) */ u_int16_t ac_tty; /* Controlling terminal */ u_int32_t ac_exitcode; /* Process termination status */ u_int32_t ac_uid; /* Real user ID */ u_int32_t ac_gid; /* Real group ID */ u_int32_t ac_pid; /* Process ID */ u_int32_t ac_ppid; /* Parent process ID */ u_int32_t ac_btime; /* Process creation time */ float ac_etime; /* Elapsed time */ comp_t ac_utime; /* User CPU time */ comp_t ac_stime; /* System time */ comp_t ac_mem; /* Average memory usage (kB) */ comp_t ac_io; /* Characters transferred (unused) */ comp_t ac_rw; /* Blocks read or written (unused) */ comp_t ac_minflt; /* Minor page faults */ comp_t ac_majflt; /* Major page faults */ comp_t ac_swaps; /* Number of swaps (unused) */ char ac_comm[ACCT_COMM]; /* Command name */ };
de: struct acct_v3 { char ac_flag; /* Schalter */ char ac_version; /* immer auf ACCT_VERSION (3) gesetzt u_int16_t ac_tty; /* steuerndes Terminal */ u_int32_t ac_exitcode; /* Status bei Prozessende */ u_int32_t ac_uid; /* Reale Benutzerkennung */ u_int32_t ac_gid; /* Reale Gruppenkennung */ u_int32_t ac_pid; /* Prozesskennung */ u_int32_t ac_ppid; /* Kennung des Elternprozesses */ u_int32_t ac_btime; /* Zeitpunkt der Prozesserzeugung */ float ac_etime; /* verstrichene Zeit*/ comp_t ac_utime; /* CPU-Zeit Benutzer */ comp_t ac_stime; /* CPU-Zeit System */ comp_t ac_mem; /* durchschnittliche Speichernutzung (kB) */ comp_t ac_io; /* übertragene Zeichen (nicht verwendet) */ comp_t ac_rw; /* gelesene oder geschriebene Blöcke (nicht verwendet) */ comp_t ac_minflt; /* geringfügige Seitenausnahmebehandlung */ comp_t ac_majflt; /* wesentliche Seitenausnahmebehandlung */ comp_t ac_swaps; /* Anzahl der Seitenauslagerungen (nicht verwendet) */ char ac_comm[ACCT_COMM];/* Befehlsname */ };
pl: struct acct_v3 { char ac_flag; /* Znaczniki */ char ac_version; /* Zawsze ustawione na ACCT_VERSION (3) */ u_int16_t ac_tty; /* Terminal sterujący */ u_int32_t ac_exitcode; /* Stan zakończenia procesu */ u_int32_t ac_uid; /* Rzeczywiste ID użytkownika */ u_int32_t ac_gid; /* Rzeczywiste ID grupy */ u_int32_t ac_pid; /* ID procesu */ u_int32_t ac_ppid; /* ID procesu rodzica */ u_int32_t ac_btime; /* Czas utworzenia procesu */ float ac_etime; /* Czas działania procesu */ comp_t ac_utime; /* Czas CPU użytkownika */ comp_t ac_stime; /* Czas CPU systemu */ comp_t ac_mem; /* Średnie zużycie pamięci (kB) */ comp_t ac_io; /* Transferowane znaki(nieużywane) */ comp_t ac_rw; /* Bloki przeczytane lub zapisane (nieużywane) */ comp_t ac_minflt; /* Mniejsze błędy stron */ comp_t ac_majflt; /* Większe błędy stron */ comp_t ac_swaps; /* Liczba wymian (nieużywane) */ char ac_comm[ACCT_COMM]; /* Nazwa polecenia */ };

source: VERSIONS
de: VERSIONEN
es: VERSIONES
pl: WERSJE

source: The I<acct_v3> structure is defined in glibc since version 2.6.
de: Die I<acct_v3>-Struktur ist in Glibc seit Version 2.6 definiert.
es: La estructura de I<acct_v3> está definida desde la versión 2.6 de glibc.
pl: Struktura I<acct_v3> jest definiowana w glibc począwszy od wersji 2.6.

source: Process accounting originated on BSD. Although it is present on most systems, it is not standardized, and the details vary somewhat between systems.
de: Die Prozessabrechnung entstand auf BSD. Obwohl sie auf den meisten Systemen präsent ist, ist sie nicht standardisiert. Die Einzelheiten variieren etwas zwischen den den Systemen.
es: La contabilidad de procesos se originó en BSD. Aunque está presente en muchos sistemas, su funcionamiento no está estandarizado y puede variar entre unos y otros.
pl: Ewidencjonowanie procesów ma swój początek w systemach BSD. Chociaż jest obsługiwane przez większość systemów, to nie jest ustandaryzowane, więc szczegóły implementacji mogą się różnić między systemami.

source: NOTES
de: ANMERKUNGEN
es: NOTAS
pl: UWAGI

source: Records in the accounting file are ordered by termination time of the process.
de: Die Datensätze in der Abrechnungsdatei sind nach der Endzeit der Prozesse geordnet.
es: Los registros se ordenan según la hora de finalización.
pl: Rekordy pliku ewidencji są posortowane po czasie zakończenia procesu.

source: In kernels up to and including 2.6.9, a separate accounting record is written for each thread created using the NPTL threading library; since Linux 2.6.10, a single accounting record is written for the entire process on termination of the last thread in the process.
de: In Kerneln bis einschließlich 2.6.9 wird für jeden mit der NTPL-Threading-Bibliothek erzeugten Thread ein eigener Datensatz geschrieben; seit Linux 2.6.10 wird für den gesamten Prozess ein einzelner Datensatz geschrieben, nachdem der letzte Prozess endete.
es: A partir de la versión 2.6.9 del núcleo, se guarda un registro distinto para cada hilo creado con la biblioteca NPTL. A partir de la versión 2.6.10 sólo se guarda un único registro para todo el proceso una vez que termine el último hilo del mismo.
pl: W jądrach aż do wersji 2.6.9 włącznie oddzielny rekord ewidencji jest zapisywany dla każdego wątku tworzonego przez bibliotekę NPTL. Od wersji 2.6.10 Linuksa pojedynczy rekord jest zapisywany dla całego procesu po zakończeniu ostatniego jego wątku.

source: The I</proc/sys/kernel/acct> file, described in B<proc>(5), defines settings that control the behavior of process accounting when disk space runs low.
de: Die Datei I</proc/sys/kernel/acct> definiert Parameter, die das Verhalten der Prozessabrechnung steuern, wenn der verfügbare Plattenplatz knapp wird. Diese Parameter werden in B<proc>(5) beschrieben.
es: El archivo I</proc/sys/kernel/acct>, descrito en B<proc>(5), define como funciona la contabilidad de procesos cuando existe poco espacio en el disco.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN
pl: ZOBACZ TAKŻE

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux
pl: Podręcznik programisty Linuksa

source: CONFORMING TO
de: KONFORM ZU
es: CONFORME A
pl: ZGODNE Z

source: COLOPHON
de: KOLOPHON
es: COLOFÓN
pl: O STRONIE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: STANDARDS
es: ESTÁNDARES
