Repository: sebras/manpages-l10n
Catalog: po/*/man5/adjtime_config.5.po
Languages: de, uk

source: File formats
de: Dateiformate
uk: Формати файлів

source: NAME
de: BEZEICHNUNG
uk: НАЗВА

source: adjtime_config - information about hardware clock setting and drift factor
de: adjtime_config, adjtime - Informationen zur Einstellung der Hardwareuhr und deren Abweichungsrate
uk: adjtime_config — відомості щодо параметрів апаратного годинника та коефіцієнта відхилення

source: SYNOPSIS
de: ÜBERSICHT
uk: КОРОТКИЙ ОПИС

source: DESCRIPTION
de: BESCHREIBUNG
uk: ОПИС

source: The file I</etc/adjtime> contains descriptive information about the hardware mode clock setting and clock drift factor. The file is read and write by B<hwclock>(8); and read by programs like rtcwake to get RTC time mode.
de: Die Datei I</etc/adjtime> enthält beschreibende Informationen zur Hardwaremodus-Uhreinstellung und der Abweichungsrate der Uhr. Die Datei wird durch B<hwclock>(8) gelesen und geschrieben. Außerdem wird sie von Programmen wie Rtcwake gelesen, um den Zeitmodus der Echtzeituhr zu ermitteln.
uk: Файл I</etc/adjtime> містить описові відомості щодо параметра апаратного режиму годинника і коефіцієнт відхилення годинника. Файл є придатним до читання і запису з боку B<hwclock>(8) і читання з боку програм, подібних до rtcwake, для отримання режиму часу годинника реального часу.

source: The file is usually located in I</etc>, but tools like B<hwclock>(8) or B<rtcwake>(8) can use alternative location by command line options if write access to I</etc> is unwanted. The default clock mode is "UTC" if the file is missing.
de: Die Datei befindet sich üblicherweise in I</etc>, aber Werkzeuge wie B<hwclock>(8) oder B<rtcwake>(8) können über entsprechende Befehlszeilenoptionen auch andere Orte verwenden, falls Schreibzugriff auf I</etc> nicht erwünscht sein sollte. Der Standardmodus der Uhr ist »UTC«, falls die Datei fehlt.
uk: Файл, зазвичай, розташовано в I</etc>, але інструменти, подібні до B<hwclock>(8) або B<rtcwake>(8), можуть використовувати альтернативне місце з рядка команди, якщо доступ до запису до I</etc> є небажаним. Типовим є режим годинника «UTC», якщо файла немає.

source: The Hardware Clock is usually not very accurate. However, much of its inaccuracy is completely predictable - it gains or loses the same amount of time every day. This is called systematic drift. The util B<hwclock>(8) keeps the file I</etc/adjtime>, that keeps some historical information. For more details see "B<The Adjust Function>" and "B<The Adjtime File>" sections from B<hwclock>(8) man page.
de: Die Hardwareuhr ist üblicherweise nicht besonders genau. Dennoch ist deren Ungenauigkeit größtenteils vorhersagbar - sie geht jeden Tag um den gleichen Betrag vor oder nach. Dies nennt man die systematische Abweichung. Das Dienstprogramm B<hwclock>(8) verwaltet die Datei I</etc/adjtime>, in der einige historische Informationen gespeichert werden. Weitere Details finden Sie in den Abschnitten B<Die Adjust-Funktion> und B<Die Datei Adjtime> in der Handbuchseite zu B<hwclock>(8).
uk: Апаратний годинник, зазвичай, не є дуже точним. Втім, більшу частину похибок можна повністю передбачити — годинник поспішає або запізнюється на той самий проміжок часу кожного дня. Таке відхилення називається систематичним. Програма B<hwclock>(8) зберігає певні історичні дані у файлі I</etc/adjtime>. Щоб дізнатися більше, ознайомитеся із розділами «B<Функція Adjust>» та «*The Adjtime File*» зі сторінки підручника щодо B<hwclock>(8).

source: The format of the adjtime file is, in ASCII.
de: Die adjtime-Datei ist in ASCII formatiert.
uk: У файлі I<adjtime> використано кодування ASCII.

source: First line
de: Erste Zeile
uk: До першого рядка

source: Three numbers, separated by blanks:
de: Drei Zahlen, durch Leerräume getrennt:
uk: Три числа, які відокремлено пробілами:

source: B<drift factor>
de: B<Abweichungsrate>
uk: *коефіцієнт відхилення*

source: the systematic drift rate in seconds per day (floating point decimal)
de: Systematische Abweichungsrate in Sekunden pro Tag (Fließkomma-Dezimalzahl)
uk: систематична швидкість відхилення у секундах на добу (десяткове число з рухомою крапкою)

source: B<last adjust time>
de: B<Letzte Anpassungszeit>
uk: B<останній момент коригування>

source: the resulting number of seconds since 1969 UTC of most recent adjustment or calibration (decimal integer)
de: Sich ergebende Anzahl Sekunden seit 1969 Weltzeit (UTC) der letzten Anpassung oder Kalibrierung (dezimale Ganzzahl)
uk: число секунд — результат — з 1969 UTC найсвіжішого коригування або калібрування (десяткове ціле число)

source: B<adjustment status>
de: B<Anpassungsstatus>
uk: B<стан коригування>

source: zero (for compatibility with B<clock>(8)) as a floating point decimal
de: Null (zwecks Kompatibilität zu B<clock>(8)) als dezimale Gleitkommazahl
uk: нуль (для сумісності з B<clock>(8)), як десятковий дріб із рухомою крапкою

source: Second line
de: Zweite Zeile
uk: Другий рядок

source: The resulting number of seconds since 1969 UTC of most recent calibration. Zero if there has been no calibration yet or it is known that any previous calibration is moot (for example, because the Hardware Clock has been found, since that calibration, not to contain a valid time). This is a decimal integer.
de: Die sich ergebende Anzahl der Sekunden seit 1969 UTC der letzten Kalibrierung. Null, wenn noch keine Kalibrierung ausgeführt wurde oder bekannt ist, dass eine der vorherigen Kalibrierungen strittig ist (zum Beispiel, weil nach der letzten Kalibrierung heraugefunden wurde, dass die Hardware-Uhr keine gültige Zeit enthält). Dies ist eine dezimale Ganzzahl.
uk: Число секунд — результат — з 1969 року UTC з моменту останнього калібрування. Нуль, якщо калібрування ще не виконувалося або відомо, що усі попередні калібрування були спірними (наприклад, оскільки в апаратному годиннику було виявлено, з часу калібрування, некоректне значення часу). Це десяткове ціле число.

source: Third line
de: Dritte Zeile
uk: Третій рядок

source: Supported values are B<UTC> or B<LOCAL>. Tells whether the Hardware Clock is set to Coordinated Universal Time or local time. You can always override this value with options on the B<hwclock>(8) command line.
de: Unterstützte Werte sind B<UTC> oder B<LOCAL>. Gibt an, ob die Hardwareuhr auf »Coordinated Universal Time« (Weltzeit) oder auf die lokale Zeit gestellt ist. Sie können diesen Wert immer durch die Befehlszeilenoptionen von B<hwclock>(8) außer Kraft setzen.
uk: Підтримуваними значеннями є B<UTC> і B<LOCAL>. Повідомляє, у якому режимі працює апаратний годинник, всесвітнього координованого часу чи місцевого часу. Ви можете завжди перевизначити це значення за допомогою параметрів у рядку команди B<hwclock>(8).

source: FILES
de: DATEIEN
uk: ФАЙЛИ

source: SEE ALSO
de: SIEHE AUCH
uk: ДИВ. ТАКОЖ

source: REPORTING BUGS
de: FEHLER MELDEN
uk: ЗВІТИ ПРО ВАДИ

source: For bug reports, use the issue tracker at
de: Verwenden Sie zum Melden von Fehlern das Fehlererfassungssystem auf
uk: Для звітування про вади використовуйте систему стеження помилками на

source: AVAILABILITY
de: VERFÜGBARKEIT
uk: ДОСТУПНІСТЬ

source: B<adjtime_config> is part of the util-linux package which can be downloaded from
de: B<adjtime_config> ist Teil des Pakets util-linux, welches heruntergeladen werden kann von:
uk: B<adjtime_config> є частиною пакунка util-linux, який можна завантажити з

source: File Formats
de: Dateiformate
uk: Формати файлів

source: adjtime - information about hardware clock setting and drift factor
de: adjtime - Informationen zur Einstellung der Hardwareuhr und deren Abweichungsrate
uk: adjtime — відомості щодо параметрів апаратного годинника та коефіцієнта відхилення

source: The file B</etc/adjtime> contains descriptive information about the hardware mode clock setting and clock drift factor. The file is read and write by hwclock; and read by programs like rtcwake to get RTC time mode.
de: Die Datei B</etc/adjtime> enthält beschreibende Informationen zur Hardwaremodus-Uhreinstellung und der Abweichungsrate der Uhr. Die Datei wird durch Hwclock gelesen und geschrieben. Außerdem wird sie von Programmen wie Rtcwake gelesen, um den Zeitmodus der Echtzeituhr zu ermitteln.

source: The file is usually located in /etc, but tools like B<hwclock>(8) or B<rtcwake>(8) allow to use alternative location by command line options if write access to /etc is unwanted. The default clock mode is "UTC" if the file is missing.
de: Die Datei befindet sich üblicherweise in /etc, aber Werkzeuge wie B<hwclock>(8) oder B<rtcwake>(8) können über entsprechende Befehlszeilenoptionen auch andere Orte verwenden, falls Schreibzugriff auf /etc nicht erwünscht sein sollte. Der Standardmodus der Uhr ist »UTC«, falls die Datei fehlt.

source: The Hardware Clock is usually not very accurate. However, much of its inaccuracy is completely predictable - it gains or loses the same amount of time every day. This is called systematic drift. The util hwclock keeps the file /etc/adjtime, that keeps some historical information. For more details see "B<The Adjust Function>" and "B<The Adjtime File>" sections from B<hwckock>(8) man page.
de: Die Hardwareuhr ist üblicherweise nicht besonders genau. Dennoch ist deren Ungenauigkeit größtenteils vorhersagbar - sie geht jeden Tag um den gleichen Betrag vor oder nach. Dies nennt man die systematische Abweichung. Das Dienstprogramm »hwclock« verwaltet die Datei /etc/adjtime, in der einige historische Informationen gespeichert werden. Weitere Details finden Sie in den Abschnitten B<Die Adjust-Funktion> und B<Die Datei Adjtime> in der Handbuchseite zu B<hwclock>(8).

source: zero (for compatibility with clock(8)) as a decimal integer.
de: Null (zwecks Kompatibilität zu clock(8)) als dezimale Ganzzahl

source: The resulting number of seconds since 1969 UTC of most recent calibration. Zero if there has been no calibration yet or it is known that any previous calibration is moot (for example, because the Hardware Clock has been found, since that calibration, not to contain a valid time). This is a decimal integer.
de: Die sich ergebende Anzahl der Sekunden seit 1969 UTC der letzten Kalibrierung. Null, wenn noch keine Kalibrierung ausgeführt wurde oder bekannt ist, dass eine der vorherigen Kalibrierungen strittig ist (zum Beispiel, weil nach der letzten Kalibrierung heraugefunden wurde, dass die Hardware-Uhr keine gültige Zeit enthält). Dies ist eine dezimale Ganzzahl.
uk: Число секунд — результат — з 1969 року UTC з моменту останнього калібрування. Нуль, якщо калібрування ще не виконувалося або відомо, що усі попередні калібрування були спірними (наприклад, оскільки в апаратному годиннику було виявлено, з часу калібрування, некоректне значення часу). Це десяткове ціле число.

source: Supported values are "UTC" or "LOCAL". Tells whether the Hardware Clock is set to Coordinated Universal Time or local time. You can always override this value with options on the hwclock command line.
de: Unterstützte Werte sind »UTC« oder »LOCAL«. Gibt an, ob die Hardwareuhr auf »Coordinated Universal Time« (Weltzeit) oder auf die lokale Zeit gestellt ist. Sie können diesen Wert immer durch die Befehlszeilenoptionen von Hwclock außer Kraft setzen.
uk: Підтримуваними значеннями є B<UTC> і B<LOCAL>. Повідомляє, у якому режимі працює апаратний годинник, всесвітнього координованого часу чи місцевого часу. Ви можете завжди перевизначити це значення за допомогою параметрів у рядку команди B<hwclock>(8).

source: This man page is part of the util-linux package and is available from https://www.kernel.org/pub/linux/utils/util-linux/.
de: Diese Handbuchseite ist Teil des Pakets util-linux, das von https://www.kernel.org/pub/linux/utils/util-linux/ verfügbar ist.
uk: Ця man-сторінка є частиною пакунка util-linux і доступна за адресою https://www.kernel.org/pub/linux/utils/util-linux/.

source: The file I</etc/adjtime> contains descriptive information about the hardware mode clock setting and clock drift factor. The file is read and write by hwclock; and read by programs like rtcwake to get RTC time mode.
de: Die Datei I</etc/adjtime> enthält beschreibende Informationen zur Hardwaremodus-Uhreinstellung und der Abweichungsrate der Uhr. Die Datei wird durch Hwclock gelesen und geschrieben. Außerdem wird sie von Programmen wie Rtcwake gelesen, um den Zeitmodus der Echtzeituhr zu ermitteln.
uk: Файл I</etc/adjtime> містить описові відомості щодо параметра апаратного режиму годинника і коефіцієнт відхилення годинника. Файл є придатним до читання і запису з боку B<hwclock>(8) і читання з боку програм, подібних до rtcwake, для отримання режиму часу годинника реального часу.

source: The file is usually located in /etc, but tools like B<hwclock>(8) or B<rtcwake>(8) can use alternative location by command line options if write access to /etc is unwanted. The default clock mode is "UTC" if the file is missing.
de: Die Datei befindet sich üblicherweise in /etc, aber Werkzeuge wie B<hwclock>(8) oder B<rtcwake>(8) können über entsprechende Befehlszeilenoptionen auch andere Orte verwenden, falls Schreibzugriff auf /etc nicht erwünscht sein sollte. Der Standardmodus der Uhr ist »UTC«, falls die Datei fehlt.
uk: Файл, зазвичай, розташовано в I</etc>, але інструменти, подібні до B<hwclock>(8) або B<rtcwake>(8), можуть використовувати альтернативне місце з рядка команди, якщо доступ до запису до I</etc> є небажаним. Типовим є режим годинника «UTC», якщо файла немає.

source: The Hardware Clock is usually not very accurate. However, much of its inaccuracy is completely predictable - it gains or loses the same amount of time every day. This is called systematic drift. The util hwclock keeps the file /etc/adjtime, that keeps some historical information. For more details see "B<The Adjust Function>" and "B<The Adjtime File>" sections from B<hwclock>(8) man page.
de: Die Hardwareuhr ist üblicherweise nicht besonders genau. Dennoch ist deren Ungenauigkeit größtenteils vorhersagbar - sie geht jeden Tag um den gleichen Betrag vor oder nach. Dies nennt man die systematische Abweichung. Das Dienstprogramm »hwclock« verwaltet die Datei /etc/adjtime, in der einige historische Informationen gespeichert werden. Weitere Details finden Sie in den Abschnitten B<Die Adjust-Funktion> und B<Die Datei Adjtime> in der Handbuchseite zu B<hwclock>(8).
uk: Апаратний годинник, зазвичай, не є дуже точним. Втім, більшу частину похибок можна повністю передбачити — годинник поспішає або запізнюється на той самий проміжок часу кожного дня. Таке відхилення називається систематичним. Програма B<hwclock>(8) зберігає певні історичні дані у файлі I</etc/adjtime>. Щоб дізнатися більше, ознайомитеся із розділами «B<Функція Adjust>» та «*The Adjtime File*» зі сторінки підручника щодо B<hwclock>(8).

source: zero (for compatibility with clock(8)) as a floating point decimal
de: Null (zwecks Kompatibilität zu clock(8)) als dezimale Gleitkommazahl
uk: нуль (для сумісності з B<clock>(8)), як десятковий дріб із рухомою крапкою

source: The I<adjtime> file is formatted in ASCII.
uk: У файлі I<adjtime> використано кодування ASCII.

source: B<last calibration time>
uk: B<останній момент калібрування>

source: B<clock mode>
uk: B<режим годинника>

source: August 2018
uk: Серпень 2018 року
