Repository: sebras/manpages-l10n
Catalog: po/*/man5/filesystems.5.po
Languages: de, es, it, pl

source: is an extended DOS filesystem used by Linux. It adds capability for long filenames, UID/GID, POSIX permissions, and special files (devices, named pipes, etc.) under the DOS filesystem, without sacrificing compatibility with DOS.
de: ist ein erweitertes DOS-Dateisystem für Linux. Es stellt lange Dateinamen, UID/GID, Zugriffsrechte nach POSIX und Spezialdateien (Geräte, Named Pipes usw.) zur Verfügung, ohne die Kompatibilität zu DOS aufzugeben.
es: es un sistema de ficheros DOS extendido usado por Linux. Agrega la posibilidad de usar nombres de fichero largos, UID/GID, permisos POSIX, y ficheros especiales (dispositivos, tuberías con nombre, etc) bajo el sistema de ficheros DOS, sin sacrificar la compatibilidad con DOS.
it: è una estensione del filesystem del DOS usata da Linux. Aggiunge il supporto per nomi di file lunghi, UID/GID, permessi POSIX, e file speciali (dispositivi, named pipe, ecc.) sotto il filesystem DOS, senza sacrificare la compatibilità con il DOS.
pl: to rozszerzony system plików DOS-u używany przez Linuksa. Dodaje on właściwości takie jak długie nazwy, UID/GID, uprawnienia zgodne z POSIX, oraz pliki specjalne (urządzenia, potoki nazwane itp) w systemie plików DOS-u, bez poświęcania zgodności z DOS-em.

source: is a filesystem whose contents reside in virtual memory. Since the files on such filesystems typically reside in RAM, file access is extremely fast. See B<tmpfs>(5).
de: ist ein Dateisystem, dessen Inhalt in virtuellem Speicher liegt. Da Dateien auf so einem Dateisystem typischerweise im RAM liegen ist der Zugriff extrem schnell. Siehe B<tmpfs>(5).
es: el contenido de este sistema de archivos reside en la memoria virtual. Como estos archivos suelen estar en la memoria RAM, el acceso a ellos se realiza con extrema rapidez. Consulte B<tmpfs>(5).
it: è un filesystem i cui contenuti risiedono in una memoria virtuale. Poiché i file su questo tipo di filesystem risiedono tipicamente in RAM, l'accesso ai file è estremamente veloce. Vedi B<tmpfs>(5).
pl: jest systemem plików, którego zawartość przechowywana jest w pamięci wirtualnej. Dostęp do plików jest ekstremalnie szybki, ponieważ znajdują się one zwykle w pamięci RAM. Więcej informacji w podręczniku B<tmpfs>(5).

source: is an extended FAT filesystem used by Microsoft Windows95 and Windows NT. B<vfat> adds the capability to use long filenames under the MSDOS filesystem.
de: ist ein erweitertes FAT-Dateisystem, das von Microsoft Windows95 und Windows NT verwendet wird. B<vfat> ermöglicht die Verwendung langer Dateinamen im MSDOS-Dateisystem.
es: es un sistema de ficheros FAT extendido que se usa en Microsoft Windows95 y Windows NT. B<vfat> añade la posibilidad de usar nombres largos de ficheros bajo el sistema de ficheros MSDOS.
it: è una estensione del filesystem FAT usata da Microsoft Windows95 e da Windows NT. B<vfat> aggiunge al filesystem di MSDOS il supporto per i nomi di file lunghi.
pl: to rozszerzony system plików FAT używany przez Microsoft Windows95 i Windows NT. B<vfat> dodaje możliwość używania długich nazw w systemie plików MSDOS.

source: is a journaling filesystem, developed by SGI, that was integrated into Linux in kernel 2.4.20.
de: Dieses protokollierende Dateisystem wurde von SGI entwickelt und in Version 2.4.20 in den Linux-Kernel integriert.
es: es un sistema de archivos transaccional desarrollado pr SGI. Integrado en el núcleo de Linux desde la versión 2.4.20.
it: è un filesystem con journaling, sviluppato da SGI, integrato in Linux a partire dal kernel 2.4.20.
pl: jest to system plików z dziennikiem, rozwijany przez SGI, obsługiwany przez jądro Linux od wersji 2.4.20.

source: was designed and implemented to be a stable, safe filesystem by extending the Minix filesystem code. It provides the basic most requested features without undue complexity. The B<xiafs> filesystem is no longer actively developed or maintained. It was removed from the kernel in 2.1.21.
de: wurde als stabiles und sicheres Dateisystem durch Erweiterung des Codes des Minix-Dateisystems entwickelt. Es stellt die grundlegenden, am häufigsten verlangten Möglichkeiten ohne unnötige Komplexität zur Verfügung. Das B<xiafs>-Dateisystem wird nicht mehr aktiv weiterentwickelt oder gepflegt. Es war bis Version 2.1.20 Bestandteil des Kernels.
es: fue diseñado e implementado para ser un sistema de ficheros estable y seguro. Es una extensión del código del sistema de ficheros Minix. Proporciona las características básicas más usuales de la forma más simple posible. El sistema de ficheros B<xiafs> no se desarrolla ni mantiene más. Fue eliminado del núcleo en la versión 2.1.21.
it: fu progettato e implementato per essere un filesystem stabile e sicuro estendendo il codice del filesystem Minix. Fornisce le caratteristiche basilari più richieste senza essere eccessivamente complesso. Il filesystem B<xia> attualmente non è più attivamente sviluppato o mantenuto. E' stato rimosso dal kernel a partire dalla versione 2.1.21.
pl: został zaprojektowany i zaimplementowany jako stabilny, pewny system plików poprzez rozszerzenie kodu systemu plików Minix. Dostarcza podstawowych, najczęściej wymaganych funkcjonalności bez zbędnej złożoności. System plików B<xiafs> nie jest już aktywnie rozwijany i utrzymywany. Został usunięty z jądra w 2.1.21.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN
it: VEDERE ANCHE
pl: ZOBACZ TAKŻE

source: COLOPHON
de: KOLOPHON
es: COLOFÓN
pl: O STRONIE

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: is a network filesystem that supports the NCP protocol, used by Novell NetWare. It was was removed from the kernel in 4.17.
de: Dieses Netzwerk-Dateisystem unterstützt das NCP-Protokoll. Dieses Protokoll wird von Novell NetWare eingesetzt. Es wurde vom Kernel in 4.17 entfernt.
es: es un sistema de ficheros que entiende el protocolo NCP, usado por Novell NetWare. Se eliminó su soporte en la versión 4.17 del núcleo.
it: è un filesystem di rete che supporta il protocollo NCP, usato da Novell NetWare. È stato rimosso dal kernel in 4.17.
pl: to sieciowy system plików obsługujący protokół NCP używany przez Novell NetWare. Został usunięty z jądra w wersji 4.17.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: filesystems - Linux filesystem types: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,
de: filesystems - Typen von Linux-Dateisystemen: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,
es: filesystems - Tipos de sistemas de ficheros reconocidos por Linux: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,
it: filesystem - Tipi di filesystem di Linux: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs.
pl: filesystems - typy systemów plików Linuksa: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,

source: When, as is customary, the B<proc> filesystem is mounted on I</proc>, you can find in the file I</proc/filesystems> which filesystems your kernel currently supports; see B<proc>(5) for more details. If you need a currently unsupported filesystem, insert the corresponding module or recompile the kernel.
de: Wenn, wie üblich, das B<proc>-Dateisystem auf I</proc> eingehängt ist, können Sie in der Datei I</proc/filesystems> nachlesen, welche Dateisysteme Ihr Kernel derzeit unterstützt. In B<proc>(5) finden Sie weitere Details. Falls Sie ein derzeit nicht unterstütztes Dateisystem benötigen, fügen Sie das entsprechende Modul ein oder kompilieren Sie Ihren Kernel neu.
es: Cuando, como de costumbre, el sistema de ficheros B<proc> se monta en I</proc>, se pueden encontrar en el fichero I</proc/filesystems> los nombres de los sistemas de ficheros que el núcleo reconoce actualmente. Consulte B<proc>(5) para más señas. Si necesita trabajar con algún sistema de archivo que ya no tenga soporte, deberá cargar el módulo correspondiente o recompilar el núcleo.
it: Quando, come è usuale, il filesystem B<proc> è montato su I</proc>, nel file I</proc/filesystems> si può trovare la lista dei filesystem attualmente supportati dal proprio kernel; si veda B<proc>(5) per ulteriori dettagli. Se si necessita di un filesystem attualmente non supportato, si inserisca il modulo corrispondente o si ricompili il kernel.
pl: Gdy, jak jest przyjęte, system plików B<proc> jest zamontowany w I</proc>, w pliku I</proc/filesystems> można znaleźć listę systemów plików obsługiwanych w danej chwili przez jądro (więcej informacji w podręczniku B<proc>(5)). Jeśli potrzebny jest któryś z aktualnie nieobsługiwanych systemów plików, należy załadować odpowiedni moduł lub ponownie skompilować jądro.

source: In order to use a filesystem, you have to I<mount> it; see B<mount>(8).
de: Um ein Dateisystem zu verwenden, müssen Sie es einhängen (I<mounten>; siehe B<mount>(8)).
es: Para usar un sistema de ficheros, éste se debe I<montar>, consulte B<mount>(8).
it: Per usare un filesystem bisogna I<montarlo>, si veda B<mount>(8).
pl: Aby móc korzystać z systemu plików, należy go I<zamontować>; patrz B<mount>(8).

source: Below a short description of the available or historically available filesystems in the Linux kernel. See kernel documentation for a comprehensive description of all options and limitations.
de: Nachfolgende ist eine kurze Beschreibung der verfügbaren oder ehemals verfügbaren Dateisysteme in dem Linux-Kernel bereit. Lesen Sie die Kernel-Dokumentation für eine umfangreiche Beschreibung aller Optionen und Beschränkungen.
es: A continuación se expone una lista de todos los sistemas de archivo disponibles en Linux, tanto actuales como obsoletos. En la documentación de su núcleo encontrará una excelente descripción de todas sus opciones y limitaciones.
it: Di seguito una breve descrizione di alcuni dei filesystem disponibili o storicamente disponibili nel kernel Linux. Si veda la documentazione del kernel per una esauriente descrizione di tutte le opzioni e di tutti i limiti.
pl: Poniżej przedstawiono krótki opis dostępnych lub dostępnych historycznie dla jądra Linux systemów plików. Wyczerpujący opis wszystkich opcji i ograniczeń znajduje się w dokumentacji jądra.

source: is a network filesystem that supports the NCP protocol, used by Novell NetWare.
de: Dieses Netzwerk-Dateisystem unterstützt das NCP-Protokoll. Dieses Protokoll wird von Novell NetWare eingesetzt.
es: es un sistema de ficheros que entiende el protocolo NCP, usado por Novell NetWare.
it: è un filesystem di rete che supporta il protocollo NCP, usato da Novell NetWare.
pl: to sieciowy system plików obsługujący protokół NCP używany przez Novell NetWare.

source: To use B<ncpfs>, you need special programs, which can be found at E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>
de: Um B<ncpfs> einzusetzen, benötigen Sie spezielle Programme. Sie finden diese unter E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE>.
es: Para usar B<ncpfs>, se necesitan programas especiales ubicados en E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>
it: Per usare B<ncpfs>, sono necessari speciali programmi, che possono essere trovati presso E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>
pl: By używać B<ncpfs>, potrzebne są specjalne programy, które znaleźć można pod E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>

source: replaces Microsoft Window's FAT filesystems (VFAT, FAT32). It has reliability, performance, and space-utilization enhancements plus features like ACLs, journaling, encryption, and so on.
de: ersetzt die FAT-Dateisysteme von Microsoft Windows (VFAT, FAT32). Zuverlässigkeit, Leistung und Raumausnutzung wurden verbessert und unter Anderem Fähigkeiten wie Zugangssteuerung (Access Control Lists, ACLs), Protokollierung und Verschlüsselung hinzugefügt.
es: sustituye a los sistemas de archivo FAT de Windows (VFTAT y FAT32). Microsoft mejoró varios aspectos como la fiabilidad, una mejor optimización del espacio entre otros aspectos como ACL's, transaccionado, encriptaciòn, etc...
it: sostituisce i filesystem FAT di Microsoft Window (VFAT, FAT32). È affidabile, con prestazioni e miglioramenti nell'utilizzazione dello spazio, oltre a funzionalità come ACL, journaling, encryption, e così via.
pl: zastępuje system plików FAT (VFAT, FAT32) systemu Microsof Windows. Zawiera ulepszenia związane z niezawodnością, wydajnością i użyciem przestrzeni dyskowej, ponadto obsługuje uprawnienia (ACL-e), dzienniki, szyfrowanie itp.

source: is an implementation of the SystemV/Coherent filesystem for Linux. It implements all of Xenix FS, SystemV/386 FS, and Coherent FS.
de: ist die Linux-Umsetzung des SystemV/Coherent-Dateisystems. Damit kann auf die Dateisysteme von Xenix, SystemV/386 und Coherent zugegriffen werden.
es: es una implementación del sistema de ficheros SystemV/Coherent para Linux. Implementa toda la funcionalidad de Xenix FS, SystemV/386 FS, y Coherent FS.
it: è una implementazione del filesystem SystemV/Coherent per Linux. Implementa interamente i filesystem Xenix, SystemV/386 e Coherent.
pl: jest implementacją systemów plików SystemV/Coherent dla Linux. Implementuje on wszystkie systemy plików Xenix, SystemV/386 oraz Coherent.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
