Repository: sebras/manpages-l10n
Catalog: po/*/man5/filesystems.5.po
Languages: de, es, it, pl

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux
it: Manuale del programmatore di Linux
pl: Podręcznik programisty Linuksa

source: NAME
de: BEZEICHNUNG
es: NOMBRE
it: NOME
pl: NAZWA

source: filesystems - Linux filesystem types: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs
de: filesystems - Typen von Linux-Dateisystemen: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs
es: filesystems - Tipos de sistemas de ficheros reconocidos por Linux: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs
it: filesystem - Tipi di filesystem di Linux: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs
pl: filesystems - typy systemów plików Linuksa: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN
it: DESCRIZIONE
pl: OPIS

source: When, as is customary, the B<proc> filesystem is mounted on I</proc>, you can find in the file I</proc/filesystems> which filesystems your kernel currently supports; see B<proc>(5) for more details. There is also a legacy B<sysfs>(2) system call (whose availability is controlled by the B<CONFIG_SYSFS_SYSCALL> kernel build configuration option since Linux 3.15) that enables enumeration of the currently available filesystem types regardless of I</proc> availability and/or sanity.
de: Wenn, wie üblich, das B<proc>-Dateisystem auf I</proc> eingehängt ist, können Sie in der Datei I</proc/filesystems> nachlesen, welche Dateisysteme Ihr Kernel derzeit unterstützt. In B<proc>(5) finden Sie weitere Details. Es gibt auch den veralteten Systemaufruf B<sysfs>(2) (dessen Verfügbarkeit seit Linux 3.15 über die Kernelbaukonfigurationsoption B<CONFIG_SYSFS_SYSCALL> gesteuert wird), der die Aufzählung der derzeit verfügbaren Dateisystemtypen unabhängig von der Verfügbarkeit und/oder Korrektheit von I</proc> ermöglicht.
es: Cuando, como de costumbre, el sistema de ficheros B<proc> se monta en I</proc>, se pueden encontrar en el fichero I</proc/filesystems> los nombres de los sistemas de ficheros que el núcleo reconoce actualmente. Consulte B<proc>(5) para más señas. Desde la versión 3.15 del núcleo de Linux, es posible usar la opción B<CONFIG_SYSFS_SYSCALL> al compilar el núcleo para poder utilizar la obsoleta llamada B<sysfs>(2). Dicha llamada activa el listado de todos los sistemas de archivo disponibles sin depender de I</proc>.
it: Quando, come è usuale, il filesystem B<proc> è montato su I</proc>, nel file I</proc/filesystems> si può trovare la lista dei filesystem attualmente supportati dal proprio kernel; si veda B<proc>(5) per ulteriori dettagli. C'è anche una chiamata di sistema datata B<sysfs>(2) (la cui disponibilità è controllata dall'opzione di configurazione B<CONFIG_SYSFS_SYSCALL> del kernel in fase di compilazione a partire da Linux 3.15) che abilita il conteggio dei tipi di filesystem correntemente disponibili a prescindere dalla disponibilità o integrità di I</proc>.
pl: Gdy, jak jest przyjęte, system plików B<proc> jest zamontowany w I</proc>, w pliku I</proc/filesystems> można znaleźć listę systemów plików obsługiwanych w danej chwili przez jądro (więcej informacji w podręczniku B<proc>(5)). Dostępne jest również przestarzałe wywołanie systemowe B<sysfs>(2) (którego dostępność zależy od opcji konfiguracyjnej jądra B<CONFIG_SYSFS_SYSCALL> od Linuksa 3.15), umożliwiająca wypisanie dostępnych obecnie typów systemów plików, niezależnie od dostępności i stanu I</proc>.

source: If you need a currently unsupported filesystem, insert the corresponding kernel module or recompile the kernel.
de: Wenn Ihnen ein Dateisystem fehlt, laden Sie das entsprechende Modul oder kompilieren Sie den Kernel neu.
es: Si necesita utilizar un sistema de archivos no disponible, deberá insertar el correspondiente módulo o recompilar el núcleo.
it: Se si ha bisogno di un filesystem attualmente non supportato, si inserisca il modulo del kernel corrispondente o si ricompili il kernel.
pl: Jeśli potrzebny jest któryś z aktualnie nieobsługiwanych systemów plików, należy załadować odpowiedni moduł lub ponownie skompilować jądro.

source: In order to use a filesystem, you have to I<mount> it; see B<mount>(2) and B<mount>(8).
de: Um ein Dateisystem zu verwenden, müssen Sie es einhängen (I<mounten>; siehe B<mount>(2) und B<mount>(8)).
es: Para usar un sistema de ficheros, éste se debe I<montar>, consulte B<mount>(2) y B<mount>(8).
it: Per usare un filesystem bisogna I<montarlo>, si veda B<mount>(8).
pl: Aby móc korzystać z systemu plików, należy go I<zamontować>; patrz B<mount>(2) i B<mount>(8).

source: The following list provides a short description of the available or historically available filesystems in the Linux kernel. See the kernel documentation for a comprehensive description of all options and limitations.
de: Die nachfolgende Liste stellt eine kurze Beschreibung der verfügbaren oder ehemals verfügbaren Dateisysteme in dem Linux-Kernel bereit. Lesen Sie die Kernel-Dokumentation für eine umfangreiche Beschreibung aller Optionen und Beschränkungen.
es: A continuación se expone una lista de todos los sistemas de archivo disponibles en Linux, tanto actuales como obsoletos. En la documentación de su núcleo encontrará una excelente descripción de todas sus opciones y limitaciones.
it: L'elenco che segue dà una breve descrizione di alcuni dei filesystem disponibili o storicamente disponibili nel kernel Linux. Si veda la documentazione del kernel per una esauriente descrizione di tutte le opzioni e di tutti i limiti.
pl: Poniżej przedstawiono krótki opis dostępnych lub dostępnych historycznie dla jądra Linux systemów plików. Wyczerpujący opis wszystkich opcji i ograniczeń znajduje się w dokumentacji jądra.

source: is an elaborate extension of the B<minix> filesystem. It has been completely superseded by the second version of the extended filesystem (B<ext2>) and has been removed from the kernel (in 2.1.21).
de: ist eine aufwendige Erweiterung des B<minix>-Dateisystems. Inzwischen ist es von der zweiten Version des erweiterten Dateisystems (B<ext2>) völlig ersetzt und seit Version 2.1.21 aus dem Kernel entfernt worden.
es: es una extensión elaborada del sistema de ficheros B<minix>. Ha sido sustituido completamente por la segunda versión del sistema de ficheros extendido (B<ext2>) y ha sido eliminado del núcleo (en la versión 2.1.21).
it: è un'estensione elaborata del filesystem B<minix>. È stato completamente rimpiazziato dalla seconda versione dell'extended filesystem (B<ext2>) ed è stato rimosso dal kernel (in 2.1.21).
pl: jest bardziej złożonym rozwinięciem systemu plików B<minix>. Został całkowicie zastąpiony przez drugą wersję rozszerzonego systemu plików (B<ext2>) i ostatecznie usunięty z jądra (w 2.1.21).

source: is the high performance disk filesystem used by Linux for fixed disks as well as removable media. The second extended filesystem was designed as an extension of the extended filesystem (B<ext>). See B<ext2>(5).
de: Dieses Hochleistungs-Dateisystem wird von Linux für Festplatten und auch Wechsel-Medien verwendet. Das zweite erweiterte Dateisystem wurde als Erweiterung des erweiterten Dateisystems (B<ext>) entworfen. Siehe B<ext2>(5).
es: es el sistema de ficheros de alto rendimiento usado por Linux para discos duros, así como para sistemas de almacenamiento extraíbles. El segundo sistema de ficheros extendido se diseñó como una extensión del sistema de ficheros extendido (B<ext>). Véase B<ext2>(5).
it: è un filesystem ad alte prestazioni utilizzato da Linux sia per dischi fissi che per unità rimuovibili. Il second extended filesystem fu progettato come una estensione dell'extended filesystem (B<ext>).
pl: jest dyskowym systemem plików o wysokiej wydajności używanym przez Linuksa zarówno dla dysków stałych, jak i dla nośników wymiennych. Drugi rozszerzony system plików został zaprojektowany jako rozszerzenie rozszerzonego systemu plików (B<ext>). Zob. B<ext2>(5).

source: is a journaling version of the B<ext2> filesystem. It is easy to switch back and forth between B<ext2> and B<ext3>. See B<ext3>(5).
de: ist eine protokollierende Version des B<ext2>-Dateisystems. Es ist einfach, zwischen B<ext2> und B<ext3> hin- und her zu schalten. Siehe B<ext3>(5).
es: es una versión transaccional del sistema de ficheros B<ext2>. Es fácil cambiar entre B<ext2> y B<ext3>. Véase B<ext3>(5).
it: è una versione con journaling del filesystem B<ext2>. E' facile scambiare ripetutamente B<ext2> e B<ext3>. Vedi B<ext3>(5).
pl: jest wersją systemu plików B<ext2> z dziennikiem. Przełączanie się pomiędzy systemami plików B<ext2> i B<ext3> jest niezmiernie łatwe. Zob. B<ext3>(5).

source: is a set of upgrades to B<ext3> including substantial performance and reliability enhancements, plus large increases in volume, file, and directory size limits. See B<ext4>(5).
de: ist ein in einer Reihe von Merkmalen aufgerüstetes B<ext3>. Dazu gehören eine erhebliche Steigerung von Leistung und Verlässlichkeit sowie beträchtlich verschobene Grenzen für die Größe von Dateisystemen, Dateien und Verzeichnissen. Siehe B<ext4>(5).
es: incluye varias mejoras respecto de B<ext3> en rendimiento y en fiabilidad. También se incrementaron mucho las limitaciones respecto al volumen, archivos y tamaño máximo de directorio. Consulte B<ext4>(5).
it: è una serie di aggiornamenti a B<ext3> che include prestazioni sostanziali e miglioramenti dell'affidabilità, oltre a un notevole incremento di volume, di file e dei limiti della dimensione delle directory. Vedi B<ext4>(5).
pl: jest zbiorem aktualizacji do B<ext3> znacząco poprawiającym wydajność i niezawodność, a także podnoszącym limity liczby i rozmiaru plików i katalogów. Zob. B<ext4>(5).

source: is the High Performance Filesystem, used in OS/2. This filesystem is read-only under Linux due to the lack of available documentation.
de: ist das OS/2-Hochleistungs-Dateisystem. Mangels verfügbarer Dokumentation kann es unter Linux nur gelesen werden.
es: es el sistema de ficheros de alto rendimiento (High Performance FileSystem) usado en OS/2. Este sistema de ficheros es de lectura exclusiva en Linux debido a la falta de documentación disponible.
it: è l'High Performance Filesystem, usato in OS/2. Questo filesystem è di sola lettura sotto Linux a causa della scarsa documentazione disponibile.
pl: jest to High Performance Filesystem, używany w OS/2. Ten system plików jest w Linuksie dostępny tylko do odczytu z powodu braku dokumentacji.

source: is a CD-ROM filesystem type conforming to the ISO 9660 standard.
de: ist ein CD-ROM-Dateisystem nach dem Standard ISO 9660.
es: es un sistema de ficheros para CD-ROM que se adhiere al estándar ISO 9660.
it: è un tipo di filesystem per CD-ROM, conforme allo standard ISO 9660.
pl: to system plików CD-ROM zgodny ze standardem ISO 9660.

source: Linux supports High Sierra, the precursor to the ISO 9660 standard for CD-ROM filesystems. It is automatically recognized within the B<iso9660> filesystem support under Linux.
de: Linux unterstützt High Sierra, den Vorläufer des ISO-9660-Standards für CD-ROM-Dateisysteme. High Sierra wird automatisch im Rahmen der Linux-Unterstützung für das B<iso9660>-Dateisystem erkannt.
es: Linux admite High Sierra, el precursor al estándar ISO 9660 para sistemas de ficheros en CD-ROM. El sistema de ficheros B<iso9660> de Linux lo reconoce automáticamente.
it: Linux supporta High Sierra, il precursore dello standard ISO 9660 per i filesystem per CD-ROM. È automaticamente riconosciuto sotto Linux all'interno del supporto per il filesystem B<iso9660>.
pl: Linux obsługuje High Sierra, prekursora standardu ISO 9660 dla systemów plików CD-ROM. Jest on rozpoznawany automatycznie w ramach obsługi systemu plików B<iso9660> w Linuksie.

source: Linux also supports the System Use Sharing Protocol records specified by the Rock Ridge Interchange Protocol. They are used to further describe the files in the B<iso9660> filesystem to a UNIX host, and provide information such as long filenames, UID/GID, POSIX permissions, and devices. It is automatically recognized within the B<iso9660> filesystem support under Linux.
de: Linux unterstützt auch die im Rock Ridge Interchange Protocol beschriebenen SUSP-Datensätze (System Use Sharing Protocol). Diese werden zu einer weitergehenden Beschreibung der Dateien in einem B<iso9660>-Dateisystem für einen Unix-Rechner eingesetzt und bieten lange Dateinamen, UID/GID, POSIX-Zugriffsverwaltung und Gerätedateien. Rock Ridge wird automatisch im Rahmen der Linux-Unterstützung für das B<iso9660>-Dateisystem erkannt.
es: Linux también acepta los registros del System Use Sharing Protocol, definidos por el Rock Ridge Interchange Protocol. Estos registros se utilizan para extender la descripción de los ficheros en el sistema B<iso9660> para un anfitrión UNIX, y proporciona información tal como nombres largos de fichero, UID/GID, permisos POSIX, y dispositivos. El sistema B<iso9660> de Linux lo reconoce automáticamente.
it: Linux inoltre supporta le registrazioni System Use Sharing Protocol specificate dal Rock Ridge Interchange Protocol. Si usano per descrivere ulteriormente i file nel filesystem B<iso9660> ad un host UNIX, e forniscono informazioni quali nomi di file lunghi, UID/GID, permessi POSIX, e dispositivi. È automaticamente supportato sotto Linux all'interno del supporto per il filesystem B<iso9660>.
pl: Linux obsługuje także rekordy System Use Sharing Protocol określone przez Rock Ridge Interchange Protocol. Używane są one do dokładniejszego opisania plików w systemie B<iso9660> komputerowi uniksowemu i dostarczają informacji takich jak długie nazwy, UID/GID, uprawnienia zgodne z POSIX oraz urządzenia. Jest on rozpoznawany automatycznie w ramach obsługi systemu plików B<iso9660> w Linuksie.

source: is a journaling filesystem, developed by IBM, that was integrated into Linux in kernel 2.4.24.
de: Dieses protokollierende Dateisystem wurde von IBM entwickelt und in Version 2.4.24 in den Linux-Kernel integriert.
es: es un sistema de archivos transaccional desarrollado por IBM. Integrado en el núcleo de Linux desde la versión 2.4.24.
it: è un filesystem con journaling, sviluppato da IBM, integrato in Linux a partire dal kernel 2.4.24.
pl: jest to system plików z dziennikiem, rozwijany przez IBM, obsługiwany przez jądro Linuksa od wersji 2.4.24.

source: is the filesystem used in the Minix operating system, the first to run under Linux. It has a number of shortcomings, including a 64\ MB partition size limit, short filenames, and a single timestamp. It remains useful for floppies and RAM disks.
de: Dieses Dateisystem wird vom Betriebssystem Minix verwendet. Es war das erste Format, das für Linux zur Verfügung stand. Es weist eine Reihe von Schwächen auf, darunter die maximale Partitionsgröße von 64\ MB, kurze Dateinamen und nur eine Zeitmarkierung. Es bleibt nützlich für Disketten und RAM-Disks.
es: es el sistema de ficheros utilizado en el sistema operativo Minix, el primero que funcionó en Linux. Tiene varias limitaciones: el tamaño de las particiones limitado a 64MB, nombres de ficheros cortos, un única marca horaria (time stamp), etc. Todavía es útil para disquetes y discos RAM.
it: è il filesystem utilizzato nel sistema operativo Minix, il primo a funzionare sotto Linux. Ha numerose restrizioni, tra cui la dimensione delle partizioni limitata a 64\ MB, nomi di file corti, e una sola marcatura oraria. È ancora utile per i dischetti e i dischi RAM.
pl: jest systemem plików używanym w systemie operacyjnym Minix, jest to pierwszy system plików, który działał pod Linuksem. Ma on pewną liczbę niedociągnięć, między innymi ograniczenie rozmiaru partycji do 64\ MB, krótkie nazwy plików oraz pojedyncze znaczniki czasu. Jest on nadal przydatny dla dyskietek i RAM-dysków.

source: is the filesystem used by DOS, Windows, and some OS/2 computers. B<msdos> filenames can be no longer than 8 characters, followed by an optional period and 3 character extension.
de: Dieses Dateisystem wird von DOS-, Windows- und einigen OS/2-Computern eingesetzt. B<msdos>-Dateinamen können nicht länger sein als 8 Zeichen, gefolgt von einem optionalen Punkt und einer 3 Zeichen langen Namenserweiterung.
es: es el sistema de ficheros usado por DOS, Windows, y algunas computadoras OS/2. Los nombres de fichero en B<msdos> no pueden tener más de 8 caracteres seguidos opcionalmente por un punto y una extensión de 3 caracteres.
it: è il filesystem usato da DOS, Windows, e alcuni computer con OS/2. I nomi di file in B<msdos> non possono essere più lunghi di 8 caratteri, eventualmente seguiti da un punto e da una estensione di 3 caratteri.
pl: jest systemem plików używanym przez DOS, Windows, i niektóre komputery z OS/2. Nazwy plików w B<msdos> nie mogą być dłuższe niż 8 znaków nazwy, plus opcjonalna kropka i 3 znaki rozszerzenia.

source: is a network filesystem that supports the NCP protocol, used by Novell NetWare. It was removed from the kernel in 4.17.
de: Dieses Netzwerk-Dateisystem unterstützt das NCP-Protokoll. Dieses Protokoll wird von Novell NetWare eingesetzt. Es wurde vom Kernel in 4.17 entfernt.
es: es un sistema de ficheros que entiende el protocolo NCP, usado por Novell NetWare.
it: è un filesystem di rete che supporta il protocollo NCP, usato da Novell NetWare. È stato rimosso dal kernel in 4.17.
pl: to sieciowy system plików obsługujący protokół NCP używany przez Novell NetWare. Został usunięty z jądra w wersji 4.17.

source: To use B<ncpfs>, you need special programs, which can be found at E<.UR ftp://ftp.gwdg.de\:/pub\:/linux\:/misc\:/ncpfs> E<.UE .>
de: Um B<ncpfs> einzusetzen, benötigen Sie spezielle Programme. Sie finden diese unter E<.UR ftp://ftp.gwdg.de\:/pub\:/linux\:/misc\:/ncpfs> E<.UE>.
es: Para usar B<ncpfs>, se necesitan apliacaciones concretas que puede descargarse en E<.UR ftp://ftp.gwdg.de\:/pub\:/linux\:/misc\:/ncpfs> E<.UE .>
it: Per usare B<ncpfs>, sono necessari speciali programmi, che possono essere trovati pressoE<.UR ftp://ftp.gwdg.de\:/pub\:/linux\:/misc\:/ncpfs> E<.UE .>
pl: By używać B<ncpfs>, potrzebne są specjalne programy, które znaleźć można pod adresem E<.UR ftp://ftp.gwdg.de\:/pub\:/linux\:/misc\:/ncpfs> E<.UE .>

source: is the network filesystem used to access disks located on remote computers.
de: ist das Netzwerk-Dateisystem, mit dem auf Platten nicht lokaler Rechner zugegriffen wird.
es: es el sistema de ficheros de red usado para acceder discos ubicados en computadoras remotas.
it: è il filesystem di rete utilizzato per l'accesso ai dischi installati su computer remoti.
pl: to sieciowy system plików używany do dostępu do dysków umieszczonych na odległych komputerach.

source: is the filesystem native to Microsoft Windows NT, supporting features like ACLs, journaling, encryption, and so on.
de: ist das native Dateisystem von Microsoft Windows NT, das Funktionalitäten wie ACLs, Journaling, Verschlüsselung und so weiter unterstützt.
es: es el sistema de archivos nativo de Microsoft Windows NT que incluyen soporte para ACL's, registro de transicionado (journaling), encriptación y demás.
it: è il filesystem nativo per Microsoft Windows NT, che supporta funzionalità come ACLs, journaling, encryption, e così via.
pl: jest to system plików natywny dla systemu Microsoft Windows NT, obsługujący funkcje takie jak ACL, dziennik, szyfrowanie itp.

source: is a pseudo filesystem which is used as an interface to kernel data structures rather than reading and interpreting I</dev/kmem>. In particular, its files do not take disk space. See B<proc>(5).
de: ist ein Pseudo-Dateisystem und dient als Schnittstelle zu den Kernel-Datenstrukturen. So ist es nicht nötig, I</dev/kmem> auszulesen und zu interpretieren. Insbesondere belegen die hier abgelegten Dateien keinen Plattenplatz. Siehe auch B<proc>(5).
es: es un seudo-sistema de ficheros que se utiliza como una interfaz entre las estructuras de datos del núcleo en vez de leer e interpretar I</dev/kmem>. En particular, estos ficheros no utilizan espacio en disco. Véase B<proc>(5).
it: è uno pseudo-filesystem utilizzato come interfaccia alle strutture dati del kernel, invece di dover leggere e interpretare I</dev/kmem>. In particolare, i suoi file non occupano spazio su disco. Si veda B<proc>(5).
pl: jest pseudosystemem plików używanym jako interfejs do struktur danych jądra, zamiast czytania i interpretowania I</dev/kmem>. W szczególności, jego pliki nie zajmują przestrzeni dyskowej. Zobacz B<proc>(5).

source: is a journaling filesystem, designed by Hans Reiser, that was integrated into Linux in kernel 2.4.1.
de: Dieses protokollierende Dateisystem wurde von Hans Reiser entwickelt. Seit Version 2.4.1 ist es Bestandteil des Linux-Kernels.
es: es un sistema de archivos con transicionado diseñado por Hans Reiser. Incorporado al núcleo de Linux desde la versión 2.4.1
it: è un filesystem con journaling, progettato da Hans Reiser, integrato in Linux a partire dal kernel 2.4.1.
pl: jest to system plików z dziennikiem, zaprojektowany przez Hansa Reisera, obsługiwany przez jądro Linux od wersji 2.4.1.

source: is a network filesystem that supports the SMB protocol, used by Windows for Workgroups, Windows NT, and Lan Manager. See E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>
de: Dieses Netzwerk-Dateisystem unterstützt das SMB-Protokoll. Es wird auch von Windows for Workgroups, Windows NT und Lan Manager eingesetzt. Siehe E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>
es: es el sistema de ficheros de red que entiende el protocolo SMB, usado por Windows para trabajo en Grupo, Windows NT y Lan Manager. Véase E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>
it: è un filesystem di rete che supporta il protocollo SMB, usato da Windows for Workgroups, Windows NT e Lan Manager. Si veda E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>
pl: to sieciowy system plików obsługujący protokół SMB, używany przez Windows for Workgroups, Windows NT oraz Lan Manager. Zob. E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>

source: is an implementation of the System V/Coherent filesystem for Linux. It implements all of Xenix FS, System V/386 FS, and Coherent FS.
de: ist die Linux-Umsetzung des System V/Coherent-Dateisystems. Damit kann auf die Dateisysteme von Xenix, System V/386 und Coherent zugegriffen werden.
es: es una implementación del sistema de ficheros System V/Coherent para Linux. Implementa toda la funcionalidad de Xenix FS, System V/386 FS, y Coherent FS.
it: è una implementazione del filesystem System V/Coherent per Linux. Implementa interamente i filesystem Xenix, System V/386 e Coherent.
pl: jest implementacją systemów plików System V/Coherent dla Linux. Implementuje on wszystkie systemy plików Xenix, System V/386 oraz Coherent.
