Repository: sebras/manpages-l10n
Catalog: po/*/man5/locale.5.po
Languages: pl

source: NAME
pl: NAZWA

source: locale - describes a locale definition file
pl: locale - opis pliku definicji locale

source: DESCRIPTION
pl: OPIS

source: The B<locale> definition file contains all the information that the B<localedef>(1) command needs to convert it into the binary locale database.
pl: Plik definicji B<locale> zawiera wszelkie informacje potrzebne poleceniu B<localedef>(1) do przekształcenia tych informacji w binarną bazę danych locale.

source: The definition files consist of sections which each describe a locale category in detail. See B<locale>(7) for additional details for these categories.
pl: Pliki definicji składają się z sekcji opisujących szczegółowo poszczególne kategorie locale. Więcej informacji o tych kategoriach znajduje się w podręczniku B<locale>(7).

source: Syntax
pl: Składnia

source: The locale definition file starts with a header that may consist of the following keywords:
pl: Na początku pliku definicji locale znajduje się od nagłówek, który może zawierać następujące słowa kluczowe:

source: is followed by a character that should be used as the escape-character for the rest of the file to mark characters that should be interpreted in a special way. It defaults to the backslash (\e).
pl: po którym następuje pewien znak. Znak ten powinien być używany w pozostałej części pliku jako znak cytujący, zaznaczając znaki które należy interpretować w szczególny sposób. Domyślnie jest to odwrotny ukośnik ( B<\e> ).

source: is followed by a character that will be used as the comment-character for the rest of the file. It defaults to the number sign (#).
pl: po którym następuje pewien znak. Znak ten będzie używany w pozostałej części pliku jako znak komentarza. Domyślnie jest to krzyżyk (B<#>).

source: Locale category sections
pl: Sekcje kategorii locale

source: The following category sections are defined by POSIX:
pl: Poniższe sekcje kategorii są zdefiniowane przez POSIX:

source: In addition, since version 2.2, the GNU C library supports the following nonstandard categories:
pl: Dodatkowo, od wersji 2.2 biblioteka GNU C obsługuje następujące kategorie niestandardowe:

source: See B<locale>(7) for a more detailed description of each category.
pl: Więcej informacji o każdej kategorii można przeczytać w podręczniku systemowym B<locale>(7).

source: The definition starts with the string I<LC_ADDRESS> in the first column.
pl: Definicja zaczyna się od napisu I<LC_ADDRESS> w pierwszej kolumnie.

source: The following keywords are allowed:
pl: Dozwolone są następujące słowa kluczowe:

source: I<postal_fmt>
pl: B<postal_fmt>

source: followed by a string containing field descriptors that define the format used for postal addresses in the locale. The following field descriptors are recognized:
pl: po której następuje łańcuch zawierający opis pola definiującego format używany do adresu pocztowego w locale. Rozpoznawane są następujące opisy pól:

source: Care of person, or organization.
pl: Opieka osoby lub organizacji.

source: Firm name.
pl: Nazwa firmy.

source: Department name.
pl: Nazwa departamentu.

source: Building name.
pl: Nazwa budynku.

source: Street or block (e.g., Japanese) name.
pl: Nazwa ulicy lub (w np. w Japonii) kwartału.

source: House number or designation.
pl: Numer lub oznaczenie budynku.

source: %N
pl: B<%N>

source: Insert an end-of-line if the previous descriptor's value was not an empty string; otherwise ignore.
pl: Wprowadza koniec wiersza, jeśli poprzednia wartość opisu nie była łańuchem pustym; w przeciwnym razie ignorowane.

source: Insert a space if the previous descriptor's value was not an empty string; otherwise ignore.
pl: Wprowadza spację, jeśli poprzednia wartość opisu nie była łańuchem pustym; w przeciwnym razie ignorowane.

source: %r
pl: B<%r>

source: Room number, door designation.
pl: Numer pokoju, oznaczenie drzwi.

source: %e
pl: B<%e>

source: Floor number.
pl: Numer piętra.

source: %C
pl: B<%C>

source: %z
pl: B<%z>

source: Zip number, postal code.
pl: Kod pocztowy.

source: %T
pl: B<%T>

source: Town, city.
pl: Wieś, miasto.

source: State, province, or prefecture.
pl: Stan, prowincja lub prefektura (lub województwo).

source: Country, as taken from data record.
pl: Kraj, według rekordu danych.

source: Each field descriptor may have an \(aqR\(aq after the \(aq%\(aq to specify that the information is taken from a Romanized version string of the entity.
pl: Każdy opis pola może mieć "R" po "%", aby wskazać, że informacja jest wzięta z łańcucha w wersji łacińskiej wpisu

source: I<country_name>
pl: B<country_name>

source: I<country_post>
pl: B<country_post>

source: followed by the abbreviation of the country (see CERT_MAILCODES).
pl: po którym następuje skrócona nazwa kraju (zob. CERT_MAILCODES).

source: I<country_ab2>
pl: B<country_ab2>

source: followed by the two-letter abbreviation of the country (ISO 3166).
pl: po którym następuje dwuliterowy skrót kraju (ISO 3166).

source: I<country_ab3>
pl: B<country_ab3>

source: followed by the three-letter abbreviation of the country (ISO 3166).
pl: po którym następuje trzyliterowy skrót kraju (ISO 3166).

source: I<country_num>
pl: B<country_num>

source: I<country_car>
pl: B<country_car>

source: I<country_isbn>
pl: B<country_isbn>

source: followed by the ISBN code (for books).
pl: po którym następuje kod ISBN (dla książek).

source: I<lang_name>
pl: B<lang_name>

source: followed by the language name in the language of the current document.
pl: po którym następuje nazwa języka w języku bieżącego dokumentu.

source: I<lang_ab>
pl: B<lang_ab>

source: followed by the two-letter abbreviation of the language (ISO 639).
pl: po którym następuje dwuliterowy skrót języka (ISO 639).

source: I<lang_term>
pl: B<lang_term>

source: followed by the three-letter abbreviation of the language (ISO 639-2/T).
pl: po którym następuje trzyliterowy skrót języka (ISO 639-2/T).

source: I<lang_lib>
pl: B<lang_lib>

source: followed by the three-letter abbreviation of the language for library use (ISO 639-2/B). Applications should in general prefer I<lang_term> over I<lang_lib>.
pl: po którym następuje trzyliterowy skrót języka do użycia bibliotecznego (ISO 639-2/B). Aplikacje powinny zwykle preferować B<lang_term> zamiast B<lang_lib>.

source: The B<LC_ADDRESS> definition ends with the string I<END LC_ADDRESS>.
pl: Definicję B<LC_ADDRESS> kończy napis B<END LC_ADDRESS>.

source: LC_CTYPE
pl: B<LC_CTYPE>

source: The definition starts with the string I<LC_CTYPE> in the first column.
pl: Definicja zaczyna się od napisu I<LC_CTYPE> w pierwszej kolumnie.

source: I<upper>
pl: B<upper>

source: followed by a list of uppercase letters. The letters B<A> through B<Z> are included automatically. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
pl: po którym następuje lista wielkich liter. Litery od B<A> do B<Z> są dołączane automatycznie. Znaki, które określono jednocześnie jako B<cntrl>, B<digit>, B<punct> lub B<space> są niedozwolone.

source: I<lower>
pl: B<lower>

source: followed by a list of lowercase letters. The letters B<a> through B<z> are included automatically. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
pl: po którym następuje lista małych liter. Litery od B<a> do B<z> są dołączane automatycznie. Znaki, które określono jednocześnie jako B<cntrl>, B<digit>, B<punct> lub B<space> są niedozwolone.

source: I<alpha>
pl: B<alpha>

source: followed by a list of letters. All character specified as either B<upper> or B<lower> are automatically included. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
pl: po którym następuje lista liter. Wszystkie znaki określone jako B<upper> lub B<lower> są dołączane automatycznie. Znaki, które określono jednocześnie jako B<cntrl>, B<digit>, B<punct> lub B<space> są niedozwolone.

source: I<digit>
pl: B<digit>

source: followed by the characters classified as numeric digits. Only the digits B<0> through B<9> are allowed. They are included by default in this class.
pl: po którym następuje lista znaków klasyfikowanych jako cyfry. Dozwolone są tylko cyfry od B<0> do B<9>. Są one dołączane domyślnie do tej klasy.

source: I<space>
pl: B<space>

source: followed by a list of characters defined as white-space characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<graph>, or B<xdigit> are not allowed. The characters B<E<lt>spaceE<gt>>, B<E<lt>form-feedE<gt>>, B<E<lt>newlineE<gt>>, B<E<lt>carriage-returnE<gt>>, B<E<lt>tabE<gt>>, and B<E<lt>vertical-tabE<gt>> are automatically included.
pl: po którym następuje lista znaków klasyfikowanych jako białe znaki. Znaki które określone są jednocześnie jako B<upper>, B<lower>, B<alpha>, B<digit>, B<graph> lub B<xdigit> są niedozwolone. Znaki B<E<lt>spacjaE<gt>>, B<E<lt>nowa-stronaE<gt>>, B<E<lt>nowa-liniaE<gt>>, B<E<lt>powrót-karetkiE<gt>>, B<E<lt>tabulacjaE<gt>> i B<E<lt>tabulacja-pionowaE<gt>> są dołączane domyślnie.

source: I<cntrl>
pl: B<cntrl>

source: followed by a list of control characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<punct>, B<graph>, B<print>, or B<xdigit> are not allowed.
pl: po którym następuje lista znaków sterujących. Znaki, które określono jednocześnie jako B<upper>, B<lower>, B<alpha>, B<digit>, B<punct>, B<graph>, B<print> lub B<xdigit>, są niedozwolone.

source: I<punct>
pl: B<punct>

source: followed by a list of punctuation characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<cntrl>, B<xdigit>, or the B<E<lt>spaceE<gt>> character are not allowed.
pl: po którym następuje lista znaków interpunkcyjnych. Znaki, które określono jednocześnie jako B<upper>, B<lower>, B<alpha>, B<digit>, B<cntrl>, B<xdigit> oraz znak B<E<lt>spacjaE<gt>> są niedozwolone.

source: I<graph>
pl: B<graph>

source: followed by a list of printable characters, not including the B<E<lt>spaceE<gt>> character. The characters defined as B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, and B<punct> are automatically included. Characters also specified as B<cntrl> are not allowed.
pl: po którym następuje lista znaków widocznych, z wyłączeniem znaku B<E<lt>spacjaE<gt>>. Znaki określone jako B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit> oraz B<punct> są dołączane automatycznie. Znaki, które określono jednocześnie jako B<cntrl> są niedozwolone.

source: I<print>
pl: B<print>

source: followed by a list of printable characters, including the B<E<lt>spaceE<gt>> character. The characters defined as B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, B<punct>, and the B<E<lt>spaceE<gt>> character are automatically included. Characters also specified as B<cntrl> are not allowed.
pl: po którym następuje lista znaków widocznych, łącznie ze znakiem B<E<lt>spacjaE<gt>>. Znaki określone jako B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, B<punct> oraz znak B<E<lt>spacjaE<gt>> są dołączane automatycznie. Znaki, które określono jednocześnie jako B<cntrl> są niedozwolone.

source: I<xdigit>
pl: B<xdigit>

source: followed by a list of characters classified as hexadecimal digits. The decimal digits must be included followed by one or more set of six characters in ascending order. The following characters are included by default: B<0> through B<9>, B<a> through B<f>, B<A> through B<F>.
pl: po którym następuje lista znaków klasyfikowanych jako cyfry szesnastkowe. Muszą być podane cyfry dziesiętne, po których następuje jeden lub więcej zestawów sześciu znaków, w porządku rosnącym. Domyślnie zawarte są następujące znaki: B<0> do B<9>, B<a> do B<f>, B<A> do B<F>.

source: I<blank>
pl: B<blank>

source: followed by a list of characters classified as B<blank>. The characters B<E<lt>spaceE<gt>> and B<E<lt>tabE<gt>> are automatically included.
pl: po którym następuje lista znaków klasyfikowanych jako B<puste>. Znaki B<E<lt>spacjaE<gt>> i B<E<lt>tabulacjaE<gt>> są dołączane automatycznie.

source: I<charclass>
pl: B<charclass>

source: followed by a list of locale-specific character class names which are then to be defined in the locale.
pl: po którym następuje lista charakterystycznych dla locale nazw klas znaków, które są następnie do zdefiniowana w locale.

source: I<toupper>
pl: B<toupper>

source: I<tolower>
pl: B<tolower>

source: followed by a list of mappings from uppercase to lowercase letters. If the keyword tolower is not present, the reverse of the toupper list is used.
pl: po którym następuje lista odwzorowań liter wielkich na małe. Jeśli nie występuje słowo kluczowe B<tolower>, to stosowane jest odwzorowanie odwrotne do listy B<toupper>.

source: I<map totitle>
pl: B<map totitle>

source: followed by a list of mapping pairs of characters and letters to be used in titles (headings).
pl: po którym następuję lista par powiązań znaków i liter do użycia w tytułach (nagłówkach).

source: I<class>
pl: B<class>

source: followed by a locale-specific character class definition, starting with the class name followed by the characters belonging to the class.
pl: po którym następuję charakterystyczna dla locale definicja klas znaków, poczynając od nazwy klasy, po której znajdują się znaki należące do klasy.

source: I<charconv>
pl: B<charconv>

source: followed by a list of locale-specific character mapping names which are then to be defined in the locale.
pl: po którym następuje lista charakterystycznych dla locale nazw powiązań znaków, które są następnie do zdefiniowana w locale.

source: I<outdigit>
pl: B<outdigit>

source: followed by a list of alternate output digits for the locale.
pl: po którym następuje lista alternatywnych cyfr dla locale.

source: I<map to_inpunct>
pl: B<map to_inpunct>

source: followed by a list of mapping pairs of alternate digits and separators for input digits for the locale.
pl: po którym następuje lista par powiązań alternatywnych cyfr i separatorów dla wejściowych cyfr locale.

source: I<map to_outpunct>
pl: B<map to_outpunct>

source: followed by a list of mapping pairs of alternate separators for output for the locale.
pl: po którym następuje lista par powiązań alternatywnych separatorów dla wyjścia locale

source: I<translit_start>
pl: B<translit_start>

source: marks the start of the transliteration rules section. The section can contain the I<include> keyword in the beginning followed by locale-specific rules and overrides. Any rule specified in the locale file will override any rule copied or included from other files. In case of duplicate rule definitions in the locale file, only the first rule is used.
pl: oznacza początek sekcji zasad transliteracji. Sekcja może zawierać słowo kluczowe B<include>, po którym następują charakterystyczne dla locale zasady i przesłonięcia. Każda reguła podana w pliku locale przesłoni dowolną regułę skopiowaną lub dołączone z innych plików. W przypadku zduplikowanych definicji reguł w pliku locale używana jest tylko pierwsza z nich.

source: A transliteration rule consist of a character to be transliterated followed by a list of transliteration targets separated by semicolons. The first target which can be presented in the target character set is used, if none of them can be used the I<default_missing> character will be used instead.
pl: Regułą transliteracji składa się ze znaku podlegającego transliteracji po którym następuje lista wyników transliteracji oddzielona średnikami. Używany jest pierwszy wynik który może być zaprezentowany, jeśli żaden z nich nie może być użyty, używany jest w zamian B<default_missing>.

source: I<include>
pl: B<include>

source: in the transliteration rules section includes a transliteration rule file (and optionally a repertoire map file).
pl: w sekcji reguł transliteracji obejmuje plik reguł transliteracji (i opcjonalnie pliku repertoiremap).

source: I<default_missing>
pl: B<default_missing>

source: in the transliteration rules section defines the default character to be used for transliteration where none of the targets cannot be presented in the target character set.
pl: w regułach transliteracji sekcja definiuje domyślny znak używany do transliteracji, gdy żaden ze znaków docelowych nie może być przedstawiony w docelowym zestawie znaków.

source: I<translit_end>
pl: B<translit_end>

source: marks the end of the transliteration rules.
pl: Oznacza koniec reguł transliteracji.

source: The B<LC_CTYPE> definition ends with the string I<END LC_CTYPE>.
pl: Definicję B<LC_CTYPE> kończy napis B<END LC_CTYPE>.

source: LC_COLLATE
pl: B<LC_COLLATE>

source: The definition starts with the string I<LC_COLLATE> in the first column.
pl: Definicja zaczyna się od napisu B<LC_COLLATE> w pierwszej kolumnie.

source: I<collating-element>
pl: B<collating-element>

source: followed by the definition of a collating-element symbol representing a multicharacter collating element.
pl: po którym następuje definicja symbolu sortowania elementów, reprezentującego wieloznakowy element sortujący.

source: I<collating-symbol>
pl: B<collating-symbol>

source: followed by the definition of a collating symbol that can be used in collation order statements.
pl: po którym następuje definicja symbolu sortowania, który można użyć do sortowania kolejności zdań.

source: I<order_start>
pl: B<order_start>

source: The B<LC_COLLATE> definition ends with the string I<END LC_COLLATE>.
pl: Definicję B<LC_COLLATE> kończy napis B<END LC_COLLATE>.

source: The definition starts with the string I<LC_IDENTIFICATION> in the first column.
pl: Definicja zaczyna się od napisu B<LC_IDENTIFICATION> w pierwszej kolumnie.

source: I<title>
pl: B<title>

source: followed by the title of the locale document (e.g., "Maori language locale for New Zealand").
pl: po którym następuje tytuł dokumentu locale (np. "Maori language locale for New Zealand").

source: I<source>
pl: B<source>

source: followed by the name of the organization that maintains this document.
pl: po którym następuje nazwa organizacji zarządzającej tym dokumentem.

source: I<address>
pl: B<address>

source: followed by the address of the organization that maintains this document.
pl: po którym następuje adres organizacji zarządzającej tym dokumentem.

source: I<contact>
pl: B<contact>

source: followed by the name of the contact person at the organization that maintains this document.
pl: po którym następuje imię i nazwisko osoby kontaktowwej z organizacji zarządzającej tym dokumentem.

source: I<email>
pl: B<email>

source: followed by the email address of the person or organization that maintains this document.
pl: po którym następuje adres poczty elektronicznej osoby z organizacji zarządzającej tym dokumentem.

source: I<tel>
pl: B<tel>

source: followed by the telephone number (in international format) of the organization that maintains this document. As of glibc 2.24, this keyword is deprecated in favor of other contact methods.
pl: po którym następuje numer telefonu (w formacie międzynarodowym) organizacji zarządzającym tym dokumentem. Od glibc 2.24 to słowo kluczowe jest przestarzałe, na korzyść innych metod kontaktu.

source: I<fax>
pl: B<fax>

source: followed by the fax number (in international format) of the organization that maintains this document. As of glibc 2.24, this keyword is deprecated in favor of other contact methods.
pl: po którym następuje numer faksu (w formacie międzynarodowym) organizacji zarządzającym tym dokumentem. Od glibc 2.24 to słowo kluczowe jest przestarzałe, na korzyść innych metod kontaktu.

source: I<language>
pl: B<language>

source: followed by the name of the language to which this document applies.
pl: po którym następuje nazwa języka do którego odnosi się ten dokument.

source: I<territory>
pl: B<territory>

source: followed by the name of the country/geographic extent to which this document applies.
pl: po którym następuje nazwa kraju/regionu geograficznego do którego odnosi się ten dokument.

source: I<audience>
pl: B<audience>

source: followed by a description of the audience for which this document is intended.
pl: po którym następuje opis odbiorców do których ten dokument jest skierowany.

source: I<application>
pl: B<application>

source: followed by a description of any special application for which this document is intended.
pl: po którym następują opisy specjalnych zadań, do których ten dokument jest przeznaczony

source: I<abbreviation>
pl: B<abbreviation>

source: I<revision>
pl: B<revision>

source: followed by the revision number of this document.
pl: po którym następuje numer wersji tego dokumentu.

source: I<date>
pl: B<date>

source: followed by the revision date of this document.
pl: po którym następuje data ostatniej modyfikacji tego dokumentu.

source: In addition, for each of the categories defined by the document, there should be a line starting with the keyword I<category>, followed by:
pl: Dodatkowo, dla każdej z kategorii zdefiniowanej przez dokument powinien występować wiersz ze słowem kluczowym B<category>, po którym następuje:

source: a string that identifies this locale category definition,
pl: łańcuch identyfikujący tę definicję kategorii locale,

source: a semicolon, and
pl: średnik i

source: The B<LC_IDENTIFICATION> definition ends with the string I<END LC_IDENTIFICATION>.
pl: Definicję B<LC_IDENTIFICATION> kończy napis B<END LC_IDENTIFICATION>.

source: LC_MESSAGES
pl: B<LC_MESSAGES>

source: The definition starts with the string I<LC_MESSAGES> in the first column.
pl: Definicja zaczyna się od napisu B<LC_MESSAGES> w pierwszej kolumnie.

source: I<yesexpr>
pl: B<yesexpr>

source: followed by a regular expression that describes possible yes-responses.
pl: po którym następuje wyrażenie regularne opisujące możliwe odpowiedzi na tak.

source: I<noexpr>
pl: B<noexpr>

source: followed by a regular expression that describes possible no-responses.
pl: po którym następuje wyrażenie regularne opisujące możliwe odpowiedzi na nie.

source: I<yesstr>
pl: B<yesstr>

source: followed by the output string corresponding to "yes".
pl: po którym następuje łańcuch odnoszący się do "tak".

source: I<nostr>
pl: B<nostr>

source: followed by the output string corresponding to "no".
pl: po którym następuje łańcuch odnoszący się do "nie".

source: The B<LC_MESSAGES> definition ends with the string I<END LC_MESSAGES>.
pl: Definicję B<LC_MESSAGES> kończy napis B<END LC_MESSAGES>.

source: The definition starts with the string I<LC_MEASUREMENT> in the first column.
pl: Definicja zaczyna się od napisu B<LC_MEASUREMENT> w pierwszej kolumnie.

source: I<measurement>
pl: B<measurement>

source: followed by number identifying the standard used for measurement. The following values are recognized:
pl: po którym następuje liczba identyfikująca standard używany do pomiarów. Rozpoznawane są następujące wartości:

source: Metric.
pl: Metryczny.

source: US customary measurements.
pl: Miary USA.

source: The B<LC_MEASUREMENT> definition ends with the string I<END LC_MEASUREMENT>.
pl: Definicję B<LC_MEASUREMENT> kończy napis B<END LC_MEASUREMENT>.

source: The definition starts with the string I<LC_MONETARY> in the first column.
pl: Definicja zaczyna się od napisu B<LC_MONETARY> w pierwszej kolumnie.

source: I<int_curr_symbol>
pl: B<int_curr_symbol>

source: followed by the international currency symbol. This must be a 4-character string containing the international currency symbol as defined by the ISO 4217 standard (three characters) followed by a separator.
pl: po którym następuje międzynarodowy symbol waluty. Musi to być czteroznakowy łańcuch zawierający międzynarodowy symbol waluty zdefiniowany w standardzie ISO 4217 (trzy znaki), po których następuje separator.

source: I<currency_symbol>
pl: B<currency_symbol>

source: followed by the local currency symbol.
pl: po którym następuje symbol waluty lokalnej.

source: I<mon_decimal_point>
pl: B<mon_decimal_point>

source: I<mon_thousands_sep>
pl: B<mon_thousands_sep>
