Repository: sebras/manpages-l10n
Catalog: po/*/man5/locale.5.po
Languages: pl

source: I<mon_grouping>
pl: B<mon_grouping>

source: followed by a sequence of integers separated by semicolons that describe the formatting of monetary quantities. See I<grouping> below for details.
pl: po którym następuje sekwencja liczb całkowitych oddzielonych od siebie średnikami opisująca formatowanie wielkości monetarnych. Więcej informacji znajduje się w opisie B<grouping> poniżej.

source: I<positive_sign>
pl: B<positive_sign>

source: followed by a string that is used to indicate a positive sign for monetary quantities.
pl: po którym następuje łańcuch służący jako znak dodatni dla wielkości pieniężnych.

source: I<negative_sign>
pl: B<negative_sign>

source: followed by a string that is used to indicate a negative sign for monetary quantities.
pl: po którym następuje łańcuch służący jako znak ujemny dla wielkości pieniężnych.

source: I<int_frac_digits>
pl: B<int_frac_digits>

source: followed by the number of fractional digits that should be used when formatting with the I<int_curr_symbol>.
pl: po którym następuje liczba cyfr dziesiętnych, które powinny wystąpić przy formatowaniu z B<int_curr_symbol>.

source: I<frac_digits>
pl: B<frac_digits>

source: followed by the number of fractional digits that should be used when formatting with the I<currency_symbol>.
pl: po którym następuje liczba cyfr dziesiętnych, które powinny wystąpić przy formatowaniu z B<currency_symbol>.

source: I<p_cs_precedes>
pl: B<p_cs_precedes>

source: followed by an integer that indicates the placement of I<currency_symbol> for a nonnegative formatted monetary quantity:
pl: po którym następuje liczba całkowita wskazująca położenie B<currency_symbol> w nieujemnych, formatowanych wielkościach liczbowych:

source: the symbol succeeds the value.
pl: jeśli symbol następuje po wartości

source: the symbol precedes the value.
pl: jeśli symbol poprzedza wartość.

source: I<p_sep_by_space>
pl: B<p_sep_by_space>

source: followed by an integer that indicates the separation of I<currency_symbol>, the sign string, and the value for a nonnegative formatted monetary quantity. The following values are recognized:
pl: po którym następuje liczba całkowita wskazująca oddzielenie B<currency_symbol>, łańcuch znaku i wartość dla nieujemnych, formatowanych wielkościach monetarnych. Rozpoznawane są następujące wartości:

source: No space separates the currency symbol and the value.
pl: Między symbolem waluty a wartością nie ma spacji.

source: If the currency symbol and the sign string are adjacent, a space separates them from the value; otherwise a space separates the currency symbol and the value.
pl: Jeśli symbol waluty i łańcuch znaku są połączone, spacje oddziela je od wartości, w przeciwnym razie spacja oddziela symbol waluty od wartości.

source: If the currency symbol and the sign string are adjacent, a space separates them from the value; otherwise a space separates the sign string and the value.
pl: Jeśli symbol waluty i łańcuch znaku są połączone, spacje oddziela je od wartości, w przeciwnym razie spacja oddziela łańcuch znaku od wartości.

source: I<n_cs_precedes>
pl: B<n_cs_precedes>

source: followed by an integer that indicates the placement of I<currency_symbol> for a negative formatted monetary quantity. The same values are recognized as for I<p_cs_precedes>.
pl: po którym następuje liczba całkowita wskazująca położenie B<currency_symbol> w ujemnych, formatowanych wielkościach monetarnych. Rozpoznawane są te same wartości co przy B<p_cs_precedes>.

source: I<n_sep_by_space>
pl: B<n_sep_by_space>

source: followed by an integer that indicates the separation of I<currency_symbol>, the sign string, and the value for a negative formatted monetary quantity. The same values are recognized as for I<p_sep_by_space>.
pl: po którym następuje liczba całkowita wskazująca oddzielenie B<currency_symbol>, łańcuch znaku i wartość dla ujemnych, formatowanych wielkościach monetarnych. Rozpoznawane są takie same wartości co przy B<p_sep_by_space>.

source: I<p_sign_posn>
pl: B<p_sign_posn>

source: followed by an integer that indicates where the I<positive_sign> should be placed for a nonnegative monetary quantity:
pl: po którym następuje liczba całkowita wskazująca gdzie B<positive_sign> powinien być umieszczany dla nieujemnej wartości monetarnej:

source: Parentheses enclose the quantity and the I<currency_symbol> or I<int_curr_symbol>.
pl: Wielkość i B<currency_symbol> lub B<int_curr_symbol> są ujęte w nawiasy.

source: The sign string precedes the quantity and the I<currency_symbol> or the I<int_curr_symbol>.
pl: Łańcuch określający znak poprzedza wielkość i B<currency_symbol> lub B<int_curr_symbol>.

source: The sign string succeeds the quantity and the I<currency_symbol> or the I<int_curr_symbol>.
pl: Łańcuch określający znak następuje po wielkości i B<currency_symbol> lub B<int_curr_symbol>.

source: The sign string precedes the I<currency_symbol> or the I<int_curr_symbol>.
pl: Łańcuch określający znak poprzedza B<currency_symbol> lub B<int_curr_symbol>.

source: The sign string succeeds the I<currency_symbol> or the I<int_curr_symbol>.
pl: Łańcuch określający znak następuje po B<currency_symbol> lub B<int_curr_symbol>.

source: I<n_sign_posn>
pl: B<n_sign_posn>

source: followed by an integer that indicates where the I<negative_sign> should be placed for a negative monetary quantity. The same values are recognized as for I<p_sign_posn>.
pl: po którym następuje liczba całkowita wskazujące położenie B<negative_sign> w ujemnych wielkościach monetarnych. Rozpoznawane są te same wartości co przy B<p_sign_posn>.

source: I<int_p_cs_precedes>
pl: B<int_p_cs_precedes>

source: I<int_n_cs_precedes>
pl: B<int_n_cs_precedes>

source: I<int_p_sep_by_space>
pl: B<int_p_sep_by_space>

source: I<int_n_sep_by_space>
pl: B<int_n_sep_by_space>

source: I<int_p_sign_posn>
pl: B<int_p_sign_posn>

source: followed by an integer that indicates where the I<positive_sign> should be placed for a nonnegative internationally formatted monetary quantity. The same values are recognized as for I<p_sign_posn>.
pl: po którym następuje liczba całkowita wskazująca położenie B<positive_sign> w nieujemnych, formatowanych międzynarodowo wielkościach monetarnych. Rozpoznawane są te same wartości co przy B<p_sign_posn>.

source: I<int_n_sign_posn>
pl: B<int_n_sign_posn>

source: followed by an integer that indicates where the I<negative_sign> should be placed for a negative internationally formatted monetary quantity. The same values are recognized as for I<p_sign_posn>.
pl: po którym następuje liczba całkowita wskazująca położenie B<negative_sign> w ujemnych, formatowanych międzynarodowo wielkościach monetarnych. Rozpoznawane są te same wartości co przy B<p_sign_posn>.

source: The B<LC_MONETARY> definition ends with the string I<END LC_MONETARY>.
pl: Definicję B<LC_MONETARY> kończy napis B<END LC_MONETARY>.

source: The definition starts with the string I<LC_NAME> in the first column.
pl: Definicja zaczyna się od napisu B<LC_NAME> w pierwszej kolumnie.

source: Various keywords are allowed, but only I<name_fmt> is mandatory. Other keywords are needed only if there is common convention to use the corresponding salutation in this locale. The allowed keywords are as follows:
pl: Dozwolone są różne słowa kluczowe, lecz jedynie B<name_fmt> jest obowiązkowy. Inne słowa kluczowe są potrzebne jedynie wtedy, gdy odpowiednie pozdrowienia są używane na co dzień w danym locale. Oto dozwolone słowa kluczowe:

source: I<name_fmt>
pl: B<name_fmt>

source: followed by a string containing field descriptors that define the format used for names in the locale. The following field descriptors are recognized:
pl: po którym następuje łańcuch zawierający opisy pól definiujące format używany dla nazw w tym locale. Rozpoznawane są następujące opisy pól:

source: Family name(s).
pl: Nazwisko (nazwiska).

source: Family names in uppercase.
pl: Nazwiska wielkimi literami.

source: First given name.
pl: Pierwsze imię.

source: First given initial.
pl: Inicjał imienia.

source: First given name with Latin letters.
pl: Imię zapisane literami alfabetu łacińskiego.

source: %o
pl: B<%o>

source: Other shorter name.
pl: Inne krótsze imię.

source: Additional given name(s).
pl: Kolejne imię (imiona).

source: Initials for additional given name(s).
pl: Inicjały kolejnych imion.

source: Profession.
pl: Profesja.

source: Salutation, such as "Doctor".
pl: Forma grzecznościowa, taka jak "Doctor".

source: Abbreviated salutation, such as "Mr." or "Dr.".
pl: Skrócona forma grzecznościowa, taka jak "Mr." lub "Dr."

source: Salutation, using the FDCC-sets conventions.
pl: Forma grzecznościowa, używająca konwencji zestawów FDCC.

source: If the preceding field descriptor resulted in an empty string, then the empty string, otherwise a space character.
pl: Jeśli poprzedzający opis pola tworzy łańcuch pusty, jest to łańcuch pusty, w przeciwnym razie znak spacji.

source: I<name_gen>
pl: B<name_gen>

source: followed by the general salutation for any gender.
pl: po którym następuje ogólna forma grzecznościowa bez względu na płeć.

source: I<name_mr>
pl: B<name_mr>

source: followed by the salutation for men.
pl: po którym następuje forma grzecznościowa dla mężczyzn.

source: I<name_mrs>
pl: B<name_mrs>

source: followed by the salutation for married women.
pl: po którym następuje forma grzecznościowa dla zamężnych kobiet.

source: I<name_miss>
pl: B<name_miss>

source: followed by the salutation for unmarried women.
pl: po którym następuje forma grzecznościowa dla niezamężnych kobiet.

source: I<name_ms>
pl: B<name_ms>

source: followed by the salutation valid for all women.
pl: po którym następuje forma grzecznościowa dla wszystkich kobiet.

source: The B<LC_NAME> definition ends with the string I<END LC_NAME>.
pl: Definicję B<LC_NAME> kończy napis B<END LC_NAME>.

source: The definition starts with the string I<LC_NUMERIC> in the first column.
pl: Definicja zaczyna się od napisu B<LC_NUMERIC> w pierwszej kolumnie.

source: I<decimal_point>
pl: B<decimal_point>

source: I<thousands_sep>
pl: B<thousands_sep>

source: I<grouping>
pl: B<grouping>

source: Each integer specifies the number of digits in a group. The first integer defines the size of the group immediately to the left of the decimal delimiter. Subsequent integers define succeeding groups to the left of the previous group. If the last integer is not -1, then the size of the previous group (if any) is repeatedly used for the remainder of the digits. If the last integer is -1, then no further grouping is performed.
pl: Każda liczba całkowita określa liczbę cyfr w grupie. Pierwsza liczba całkowita definiuje rozmiar grupy będącej po lewej stronie znaku oddzielającego część całkowitą od ułamkowej. Kolejne liczby całkowite definiują kolejne grupy na lewo od poprzedniej grupy. Jeśli ostatnią liczbą całkowitą nie jest -1, to rozmiar poprzedniej grupy (jeśli występuje) powtarza się dla pozostałych cyfr. Jeśli ostatnią liczbą całkowitą jest -1, następne grupowania nie są przeprowadzane.

source: The B<LC_NUMERIC> definition ends with the string I<END LC_NUMERIC>.
pl: Definicję B<LC_NUMERIC> kończy napis B<END LC_NUMERIC>.

source: The definition starts with the string I<LC_PAPER> in the first column.
pl: Definicja zaczyna się od napisu B<LC_PAPER> w pierwszej kolumnie.

source: followed by the height, in millimeters, of the standard paper format.
pl: po którym następuje wysokość, w milimetrach, standardowego formatu papieru.

source: followed by the width, in millimeters, of the standard paper format.
pl: po którym następuje szerokość, w milimetrach, standardowego formatu papieru.

source: The B<LC_PAPER> definition ends with the string I<END LC_PAPER>.
pl: Definicję B<LC_PAPER> kończy napis B<END LC_PAPER>.

source: The definition starts with the string I<LC_TELEPHONE> in the first column.
pl: Definicja zaczyna się od napisu B<LC_TELEPHONE> w pierwszej kolumnie.

source: I<tel_int_fmt>
pl: B<tel_int_fmt>

source: followed by a string that contains field descriptors that identify the format used to dial international numbers. The following field descriptors are recognized:
pl: po którym następuje łańcuch zawierający opisy pól identyfikujące format używany do wybierania numerów międzynarodowych. Rozpoznawane są następujące opisy pól:

source: Area code without nationwide prefix (the prefix is often "00").
pl: Kod obszaru bez prefiksu krajowego (prefiks ten to często "00").

source: %A
pl: B<%A>

source: Area code including nationwide prefix.
pl: Kod obszaru razem z krajowym prefiksem.

source: Local number (within area code).
pl: Numer lokalny (z kodem obszaru).

source: Extension (to local number).
pl: Rozszerzenie (do numeru lokalnego).

source: Country code.
pl: Kod kraju.

source: Alternate carrier service code used for dialing abroad.
pl: Alternatywny kod serwisowy operatora używany do dzwonienia za granicę.

source: I<tel_dom_fmt>
pl: B<tel_dom_fmt>

source: followed by a string that contains field descriptors that identify the format used to dial domestic numbers. The recognized field descriptors are the same as for I<tel_int_fmt>.
pl: po którym następuje łańcuch zawierający opisy pól identyfikujące format używany do wybierania numerów miejscowych. Rozpoznawane opisy pól są takie same jak przy B<tel_int_fmt>.

source: I<int_select>
pl: B<int_select>

source: followed by the prefix used to call international phone numbers.
pl: po którym następuje prefiks używany przy wybieraniu międzynarodowych numerów telefonów.

source: I<int_prefix>
pl: B<int_prefix>

source: followed by the prefix used from other countries to dial this country.
pl: po którym następuje prefiks używany przy telefonowaniu z innych krajów.

source: The B<LC_TELEPHONE> definition ends with the string I<END LC_TELEPHONE>.
pl: Definicję B<LC_TELEPHONE> kończy napis B<END LC_TELEPHONE>.

source: The definition starts with the string I<LC_TIME> in the first column.
pl: Definicja zaczyna się od napisu B<LC_TIME> w pierwszej kolumnie.

source: I<abday>
pl: B<abday>

source: followed by a list of abbreviated names of the days of the week. The list starts with the first day of the week as specified by I<week> (Sunday by default). See NOTES.
pl: po którym następuje lista skróconych nazw dni tygodnia. Lista zaczyna się od pierwszego dnia tygodnia, jak podano w B<week> (domyślnie niedziela). Zob. UWAGI.

source: I<day>
pl: B<day>

source: followed by a list of names of the days of the week. The list starts with the first day of the week as specified by I<week> (Sunday by default). See NOTES.
pl: po którym następuje lista nazw dni tygodnia. Lista zaczyna się od pierwszego dnia tygodnia, jak podano w B<week> (domyślnie niedziela). Zob. UWAGI.

source: I<abmon>
pl: B<abmon>

source: followed by a list of abbreviated month names.
pl: po którym następuje lista skrótów nazw miesięcy.

source: I<mon>
pl: B<mon>

source: followed by a list of month names.
pl: po którym następuje lista nazw miesięcy.

source: I<d_t_fmt>
pl: B<d_t_fmt>

source: followed by the appropriate date and time format (for syntax, see B<strftime>(3)).
pl: po którym następuje odpowiedni format daty i czasu (składnia jest opisana w B<strftime>(3)).

source: I<d_fmt>
pl: B<d_fmt>

source: followed by the appropriate date format (for syntax, see B<strftime>(3)).
pl: po którym następuje odpowiedni format daty odpowiedni (składnia jest opisana w B<strftime>(3)).

source: I<t_fmt>
pl: B<t_fmt>

source: followed by the appropriate time format (for syntax, see B<strftime>(3)).
pl: po którym następuje odpowiedni format czasu (składnia jest opisana w B<strftime>(3)).

source: I<am_pm>
pl: B<am_pm>

source: followed by the appropriate representation of the B<am> and B<pm> strings. This should be left empty for locales not using AM/PM convention.
pl: po którym następuje odpowiednia reprezentacja łańcuchów B<am> (przed południem) i B<pm> (po południu). Pole to powinno pozostać puste w przypadku locale nie korzystających z konwencji AM/PM.

source: I<t_fmt_ampm>
pl: B<t_fmt_ampm>

source: followed by the appropriate time format (for syntax, see B<strftime>(3)) when using 12h clock format. This should be left empty for locales not using AM/PM convention.
pl: po którym następuje odpowiedni format czasu (składnia jest opisana w B<strftime>(3)) przy zegarze 12h. Pole to powinno pozostać puste w przypadku locale nie korzystających z konwencji AM/PM.

source: I<era>
pl: B<era>

source: followed by semicolon-separated strings that define how years are counted and displayed for each era in the locale. Each string has the following format:
pl: po którym następują łańcuchy oddzielone średnikiem definiujące jak są liczone i wyświetlane lata dla każdej ery w locale. Każdy łańcuch ma następujący format:

source: I<direction>:I<offset>:I<start_date>:I<end_date>:I<era_name>:I<era_format>
pl: I<kierunek>:I<przesunięcie>:I<data_początkowa>:I<data_końcowa>:I<nazwa_ery>:I<format_ery>

source: The fields are to be defined as follows:
pl: Po są zdefiniowane następująco:

source: I<direction>
pl: I<kierunek>

source: I<offset>
pl: I<przesunięcie>

source: The number of the year closest to I<start_date> in the era, corresponding to the I<%Ey> descriptor (see B<strptime>(3)).
pl: Numer roku najbliższy I<dacie_początkowej> w erze, odpowiadający opisowi I<%Ey> (zob. B<strptime>(3)).

source: I<start_date>
pl: I<data_początkowa>

source: The start of the era in the form of I<yyyy/mm/dd>. Years prior AD 1 are represented as negative numbers.
pl: Początek ery w formacie I<rrrr>B</>I<mm>B</>I<dd>. Lata przed AD 1 są reprezentowane jako liczby ujemne.

source: I<end_date>
pl: I<data_końcowa>

source: The end of the era in the form of I<yyyy/mm/dd>, or one of the two special values of B<-*> or B<+*>. B<-*> means the ending date is the beginning of time. B<+*> means the ending date is the end of time.
pl: Koniec ery e formacie I<rrrr>B</>I<mm>B</>I<dd> lub jedna z dwóch wartości specjalnych: B<-*> lub B<+*>. B<-*> oznacza, że data końcowa jest początkiem czasu. B<+*> oznacza, że data końcowa jest końcem czasu.

source: I<era_name>
pl: I<nazwa_ery>

source: The name of the era corresponding to the I<%EC> descriptor (see B<strptime>(3)).
pl: Nazwa ery odpowiadająca opisowi I<%EC> (zob. B<strptime>(3)).

source: I<era_format>
pl: I<format_ery>

source: The format of the year in the era corresponding to the I<%EY> descriptor (see B<strptime>(3)).
pl: Format roku w erze odpowiadający opisowi I<%EY> (zob. B<strptime>(3)).

source: I<era_d_fmt>
pl: B<era_d_fmt>

source: followed by the format of the date in alternative era notation, corresponding to the I<%Ex> descriptor (see B<strptime>(3)).
pl: po którym następuje format daty w alternatywnej notacji ery, odpowiadający opisowi I<%Ex> (zob. B<strptime>(3)).

source: I<era_t_fmt>
pl: B<era_t_fmt>

source: followed by the format of the time in alternative era notation, corresponding to the I<%EX> descriptor (see B<strptime>(3)).
pl: po którym następuje format czasu w alternatywnej notacji ery, odpowiadający opisowi I<%EX> (zob. B<strptime>(3)).

source: I<era_d_t_fmt>
pl: B<era_d_t_fmt>

source: followed by the format of the date and time in alternative era notation, corresponding to the I<%Ec> descriptor (see B<strptime>(3)).
pl: po którym następuje format daty i czasu w alternatywnej notacji ery, odpowiadający opisowi I<%Ec> (zob. B<strptime>(3)).

source: I<alt_digits>
pl: B<alt_digits>

source: followed by the alternative digits used for date and time in the locale.
pl: po którym następują alternatywne cyfry używane do daty i czasu w locale.

source: I<week>
pl: B<week>

source: I<first_weekday> (since glibc 2.2)
pl: B<first_weekday> (od glibc 2.2)

source: I<first_workday> (since glibc 2.2)
pl: B<first_workday> (od glibc 2.2)

source: I<cal_direction>
pl: B<cal_direction>

source: Left-right from top.
pl: Od lewej do prawej, z góry.

source: Top-down from left.
pl: Od góry do dołu, z lewej.

source: Right-left from top.
pl: Z prawej do lewej, z góry.

source: I<date_fmt>
pl: B<date_fmt>

source: followed by the appropriate date representation for B<date>(1) (for syntax, see B<strftime>(3)).
pl: po którym następuje format daty odpowiedni dla B<date>(1) (składnia opisana w B<strftime>(3)).

source: The B<LC_TIME> definition ends with the string I<END LC_TIME>.
pl: Definicję B<LC_TIME> kończy napis B<END LC_TIME>.

source: FILES
pl: PLIKI

source: Usual default locale archive location.
pl: Zwykle domyślne położenie archiwum locale.

source: Usual default path for locale definition files.
pl: Domyślna (zwykle) ścieżka plików definicji locale.

source: STANDARDS
pl: STANDARDY

source: NOTES
pl: UWAGI

source: The collective GNU C library community wisdom regarding I<abday>, I<day>, I<week>, I<first_weekday>, and I<first_workday> states at https://sourceware.org/glibc/wiki/Locales the following:
pl: Wspólne pomysły społeczności biblioteki GNU C odnośnie B<abday>, B<day>, B<week>, B<first_weekday> i B<first_workday> ze strony https://sourceware.org/glibc/wiki/Locales przedstawiają się następująco.

source: The value of the second I<week> list item specifies the base of the I<abday> and I<day> lists.
pl: Wartość drugiego wpisu listy B<week> określa początek list B<abday> i B<day>.

source: I<first_weekday> specifies the offset of the first day-of-week in the I<abday> and I<day> lists.
pl: B<first_weekday> określa przesunięcie pierwszego dnia tygodnia na listach B<abday> i B<day>.

source: For compatibility reasons, all glibc locales should set the value of the second I<week> list item to B<19971130> (Sunday) and base the I<abday> and I<day> lists appropriately, and set I<first_weekday> and I<first_workday> to B<1> or B<2>, depending on whether the week and work week actually starts on Sunday or Monday for the locale.
pl: Z powodów kompatybilności, wszystkie locale glibc powinny ustawiać wartość drugiego wpisu na liście B<week> na B<19971130> (niedziela) i tak samo powinny rozpoczynać listę B<abday> oraz B<day>, natomiast to, kiedy de facto zaczyna się tydzień i dni robocze należy ustawić w B<first_weekday> i B<first_workday>: B<1> (niedziela) lub B<2> (poniedziałek).

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: Linux User Manual
pl: Podręcznik użytkownika Linuksa

source: CONFORMING TO
pl: ZGODNE Z

source: COLOPHON
pl: O STRONIE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: one of the B<LC_>I<*> identifiers.
pl: jeden z identyfikatorów B<LC_>I<*>.

source: followed by the string that will be used as the decimal delimiter when formatting monetary quantities.
pl: po którym następuje łańcuch służący do oddzielania części całkowitej od ułamkowej w zapisie dziesiętnym wielkości pieniężnych.

source: followed by the string that will be used as a group separator when formatting monetary quantities.
pl: po którym następuje łańcuch służący jako separator trzycyfrowych grup przy formatowaniu wielkości pieniężnych.
