Repository: sebras/manpages-l10n
Catalog: po/*/man5/locale.5.po
Languages: pl

source: followed by the string that will be used as the decimal delimiter when formatting numeric quantities.
pl: po którym następuje łańcuch służący przy formatowaniu wielkości liczbowych do oddzielania części całkowitej i ułamkowej liczb dziesiętnych.

source: followed by the string that will be used as a group separator when formatting numeric quantities.
pl: po którym następuje łańcuch służący przy formatowaniu wielkości liczbowych jako separator grup trzycyfrowych.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
