Repository: sebras/manpages-l10n
Catalog: po/*/man5/localtime.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: localtime - Local timezone configuration file
de: localtime - Lokale Zeitzonenkonfigurationsdatei

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: The /etc/localtime file configures the system-wide timezone of the local system that is used by applications for presentation to the user\&. It should be an absolute or relative symbolic link pointing to /usr/share/zoneinfo/, followed by a timezone identifier such as "Europe/Berlin" or "Etc/UTC"\&. The resulting link should lead to the corresponding binary B<tzfile>(5) timezone data for the configured timezone\&.
de: Die Datei /etc/localtime konfiguriert die systemweite Zeitzone des lokalen Systems, die von Anwendungen zur Darstellung an den Benutzer verwandt wird\&. Es sollte ein absoluter oder relativer symbolischer Link auf /usr/share/zoneinfo/, gefolgt von einem Zeitzonenkennzeichner wie »Europe/Berlin« oder »Etc/UTC«, sein\&. Der entstehende Link sollte zu den korrespondierenden binären B<tzfile>(5)-Zeitzonendaten für die konfigurierte Zeitzone führen\&.

source: Because the timezone identifier is extracted from the symlink target name of /etc/localtime, this file may not be a normal file or hardlink\&.
de: Da der Zeitzonenkennzeichner aus dem Symlink-Zielnamen von /etc/localtime ermittelt wird, darf diese Datei keine normale Datei oder ein Hardlink sein\&.

source: If /etc/localtime is missing, the default "UTC" timezone is used\&.
de: Falls /etc/localtime fehlt, wird die Vorgabezeitzone »UTC« verwandt\&.

source: The timezone may be overridden for individual programs by using the I<$TZ> environment variable\&. See B<environ>(7)\&.
de: Die Zeitzone kann für individuelle Programme mittels der Umgebungsvariablen I<$TZ> außer Kraft gesetzt werden\&. Siehe B<environ>(7)\&.

source: You may use B<timedatectl>(1) to change the settings of this file from the command line during runtime\&. Use B<systemd-firstboot>(1) to initialize the time zone on mounted (but not booted) system images\&.
de: Sie können B<timedatectl>(1) verwenden, um die Einstellungen dieser Datei von der Befehlszeile während der Laufzeit zu ändern\&. Verwenden Sie B<systemd-firstboot>(1), um die Zeitzonen auf eingehängten (aber nicht gestarteten) System-Images zu ändern\&.

source: SEE ALSO
de: SIEHE AUCH
