Repository: sebras/manpages-l10n
Catalog: po/*/man5/mmdf.5.po
Languages: de

source: February 18th, 2002
de: 18. Februar 2002

source: User Manuals
de: Benutzerhandbücher

source: NAME
de: BEZEICHNUNG

source: MMDF - Multi-channel Memorandum Distribution Facility mailbox format
de: MMDF - Das Mailboxformat »Multi-channel Memorandum Distribution Facility«

source: DESCRIPTION
de: BESCHREIBUNG

source: This document describes the B<MMDF> mailbox format used by some MTAs and MUAs (i.e. B<scomail>(1)) to store mail messages locally.
de: Dieses Dokument beschreibt das Mailboxformat B<MMDF>, das von einigen MTAs und MUAs (z.B. B<scomail>(1)) verwendet wird, um E-Mails lokal zu speichern.

source: An B<MMDF> mailbox is a text file containing an arbitrary number of e-mail messages. Each message consists of a postmark, followed by an e-mail message formatted according to B<RFC822> / B<RFC2822>, followed by a postmark. The file format is line-oriented. Lines are separated by line feed characters (ASCII 10). A postmark line consists of the four characters "^A^A^A^A" (Control-A; ASCII 1).
de: Eine B<MMDF>-Mailbox ist eine Textdatei, die eine beliebige Anzahl E-Mail-Nachrichten enthält. Jede Nachricht besteht aus einem Stempel, gefolgt von einer E-Mail-Nachricht entsprechend B<RFC822>/B<RFC2822>, wiederum gefolgt von einem Stempel. Das Dateiformat ist zeilenorientiert. Die Zeilen werden durch Zeilenvorschübe getrennt (ASCII 10). Eine Stempelzeile besteht aus den vier Zeichen »^A^A^A^A« (Strg-A; ASCII 1).

source: Example of a B<MMDF> mailbox holding two mails:
de: Beispiel für eine B<MMDF>-Mailbox, die zwei Nachrichten enthält:

source: E<gt>From what I learned about the MMDF-format:
de: E<gt>Was ich über das MMDF-Format gelernt habe:

source: In contrast to most other single file mailbox formats like MBOXO and MBOXRD (see B<mbox>(5)) there is no need to quote/dequote "From "-lines in B<MMDF> mailboxes as such lines have no special meaning in this format.
de: Im Gegensatz zu den meisten anderen auf einer Einzeldatei basierenden Mailboxformaten wie MBOXO und MBOXRD (siehe B<mbox>(5)) ist es in B<MMDF>-Mailboxen nicht nötig, die »From«-Zeilen in Anführungszeichen zu setzen, da solche Zeilen in diesem Format keine besondere Bedeutung haben.

source: If the modification-time (usually determined via B<stat>(2)) of a nonempty mailbox file is greater than the access-time the file has new mail. Many MUAs place a Status: header in each message to indicate which messages have already been read.
de: Wenn die (üblicherweise durch B<stat>(2) ermittelte) Änderungszeit einer nicht leeren Mailbox größer beziehungsweise neuer als die Zugriffszeit der Datei ist, dann enthält die Datei neue E-Mails. Viele MUAs setzen eine »Status:«-Kopfzeile in jede Nachricht, um zu bezeichnen, welche Nachrichten bereits gelesen wurden.

source: LOCKING
de: SPERREN

source: Since B<MMDF> files are frequently accessed by multiple programs in parallel, B<MMDF> files should generally not be accessed without locking.
de: Da auf B<MMDF>-Dateien häufig von mehreren Programmen parallel zugegriffen wird, sollte der Zugriff auf diese Dateien generell nicht ohne Sperrung erfolgen.

source: Three different locking mechanisms (and combinations thereof) are in general use:
de: Allgemein werden drei Sperrmechanismen (und Kombinationen davon) verwendet:

source: B<fcntl>(2) locking is mostly used on recent, POSIX-compliant systems. Use of this locking method is, in particular, advisable if B<MMDF> files are accessed through the Network File System (NFS), since it seems the only way to reliably invalidate NFS clients' caches.
de: Das Sperren mit B<fcntl>(2) wird zumeist auf aktuellen, POSIX-konformen Systemen verwendet. Die Nutzung dieser Sperrmethode ist insbesondere bei B<MMDF>-Dateien ratsam, auf die über das Network File System (NFS) zugegriffen wird, da es die einzige Möglichkeit zu sein scheint, die Zwischenspeicher von NFS-Clients zuverlässig für ungültig zu erklären.

source: B<flock>(2) locking is mostly used on BSD-based systems.
de: Das Sperren mit B<flock>(2) wird meist auf BSD-basierten Systemen verwendet.

source: Dotlocking is used on all kinds of systems. In order to lock an B<MMDF> file named I<folder>, an application first creates a temporary file with a unique name in the directory in which the I<folder> resides. The application then tries to use the B<link>(2) system call to create a hard link named I<folder.lock> to the temporary file. The success of the B<link>(2) system call should be additionally verified using B<stat>(2) calls. If the link has succeeded, the mail folder is considered dotlocked. The temporary file can then safely be unlinked.
de: »Dotlocking« wird auf allen Systemtypen verwendet. Um beispielsweise eine B<MMDF>-Datei namens I<Mail-Ordner> zu sperren, legt eine Anwendung zunächst eine temporäre Datei mit einem eindeutigen Namen in dem Verzeichnis an, indem sich die Datei B<Mail-Ordner> befindet. Die Anwendung versucht dann, mit dem Systemaufruf B<link>(2) einen harten Link namens I<Mail-Ordner.lock> zu erstellen, der auf die temporäre Datei zeigt. Der Erfolg des Systemaufrufs B<link>(2) sollte zusätzlich mit B<stat>(2)-Systemaufrufen verifiziert werden. Falls der Link erfolgreich erstellt wurde, wird der Mail-Ordner als »dotlocked« betrachtet. Der Link zur temporären Datei kann daraufhin sicher entfernt werden.

source: In order to release the lock, an application just unlinks the I<folder.lock> file.
de: Um die Sperre aufzuheben, entfernt eine Anwendung einfach die Datei I<Mail-Ordner.lock>.

source: If multiple methods are combined, implementors should make sure to use the non-blocking variants of the B<fcntl>(2) and B<flock>(2) system calls in order to avoid deadlocks.
de: Wenn mehrere Methoden kombiniert werden, sollte bei der Implementierung sichergestellt werden, dass die nicht blockierenden Varianten der Systemaufrufe B<fcntl>(2) und B<flock>(2) verwendet werden, um tote Verklemmungen zu vermeiden.

source: If multiple methods are combined, an B<MMDF> file must not be considered to have been successfully locked before all individual locks were obtained. When one of the individual locking methods fails, an application should release all locks it acquired successfully, and restart the entire locking procedure from the beginning, after a suitable delay.
de: Wenn mehrere Methoden kombiniert werden, darf eine B<MMDF>-Datei nicht als erfolgreich gesperrt betrachtet werden, bevor nicht alle einzelnen Sperren wirksam sind. Wenn eine der einzelnen Sperrmethoden scheitert, sollte eine Anwendung alle Sperren aufheben, die sie erfolgreich angewendet hat und mit dem gesamten Sperrvorgang nach einer angemessenen Wartezeit von vorn beginnen.

source: The locking mechanism used on a particular system is a matter of local policy, and should be consistently used by all applications installed on the system which access B<MMDF> files. Failure to do so may result in loss of e-mail data, and in corrupted B<MMDF> files.
de: Der Sperrmechanismus auf einem bestimmten System ist eine Sache der lokalen Regeln und sollte konsistent von allen auf dem System installierten Anwendungen genutzt werden, die auf B<MMDF> zugreifen. Erfolgt dies nicht, kann es zum Verlust von E-Mail-Daten und beschädigten B<MMDF>-Dateien kommen.

source: CONFORMING TO
de: KONFORM ZU

source: B<MMDF> is not part of any currently supported standard.
de: B<MMDF> ist kein Teil irgendeines gegenwärtig unterstützten Standards.

source: HISTORY
de: GESCHICHTE

source: B<MMDF> was developed at the University of Delaware by Dave Crocker.
de: B<MMDF> wurde von Dave Crocker an der University of Delaware entwickelt.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: Urs Janssen E<lt>urs@tin.orgE<gt>
de: E<.MT urs@tin.org>Urs JanssenE<.ME>
