Repository: sebras/manpages-l10n
Catalog: po/*/man5/moduli.5.po
Languages: de

source: $Mdocdate: September 26 2012 $
de: $Mdocdate: 26. September 2012 $

source: NAME
de: BEZEICHNUNG

source: Diffie-Hellman moduli
de: Diffie-Hellman-Moduln

source: DESCRIPTION
de: BESCHREIBUNG

source: The E<.Pa /etc/ssh/moduli> file contains prime numbers and generators for use by E<.Xr sshd 8> in the Diffie-Hellman Group Exchange key exchange method.
de: Die Datei E<.Pa /etc/ssh/moduli> enthält Primzahlen und Generatoren für den Einsatz durch E<.Xr sshd 8> in der Diffie-Hellman-Gruppenaustausch-Schlüsselaustauschmethode.

source: New moduli may be generated with E<.Xr ssh-keygen 1> using a two-step process. An initial E<.Em candidate generation> pass, using E<.Ic ssh-keygen -G>, calculates numbers that are likely to be useful. A second E<.Em primality testing> pass, using E<.Ic ssh-keygen -T>, provides a high degree of assurance that the numbers are prime and are safe for use in Diffie-Hellman operations by E<.Xr sshd 8>. This E<.Nm> format is used as the output from each pass.
de: Neue Moduln können mit E<.Xr ssh-keygen 1> in einem zweistufigen Prozess erstellt werden. Ein anfänglicher E<.Em Kandidaten-Ersteller>-Durchlauf unter Verwendung von E<.Ic ssh-keygen -G> berechnet Zahlen, die wahrscheinlich nützlich sind. Ein zweiter E<.Em Primfzahl-Prüf>-Durchlauf unter Verwendung von E<.Ic ssh-keygen -T> stellt ein hohes Maß an Vertrauen bereit, dass die Zahlen prim und sicher für den Einsatz durch E<.Xr sshd 8> für Diffie-Hellman-Operationen sind. Dieses E<.Nm>-Format wird als Ausgabe von jedem Durchlauf verwandt.

source: The file consists of newline-separated records, one per modulus, containing seven space-separated fields. These fields are as follows:
de: Die Datei besteht aus durch Zeilenumbrüchen getrennten Datensätzen, eines pro Modul, die sieben, durch Leerzeichen getrennte Felder enthalten. Diese Felder sind wie folgt:

source: timestamp
de: Zeitstempel

source: The time that the modulus was last processed as YYYYMMDDHHMMSS.
de: Die Zeit, zu der das Modul letztmalig bearbeitet wurde, im Format YYYYMMDDHHMMSS.

source: type
de: Typ

source: Decimal number specifying the internal structure of the prime modulus. Supported types are:
de: Dezimalzahl, die die interne Struktur des Primmoduls festlegt. Unterstützte Typen sind:

source: Unknown, not tested.
de: Unbekannt, nicht getestet.

source: "Safe" prime; (p-1)/2 is also prime.
de: »Sichere« Primzahl; (p-1)/2 ist auch eine Primzahl.

source: Sophie Germain; 2p+1 is also prime.
de: Sophie Germain; 2p+1 ist auch eine Primzahl.

source: Moduli candidates initially produced by E<.Xr ssh-keygen 1> are Sophie Germain primes (type 4). Further primality testing with E<.Xr ssh-keygen 1> produces safe prime moduli (type 2) that are ready for use in E<.Xr sshd 8>. Other types are not used by OpenSSH.
de: Anfänglich von E<.Xr ssh-keygen 1> erzeugte Modul-Kandidaten sind Sophie-Germain-Primzahlen (Typ 4). Weitere Primzahltests mit E<.Xr ssh-keygen 1> erzeugen sichere Primmoduln (Typ 2), die in E<.Xr sshd 8> eingesetzt werden können. Von OpenSSH werden keine anderen Typen verwandt.

source: Decimal number indicating the type of primality tests that the number has been subjected to represented as a bitmask of the following values:
de: Dezimalzahl, die den Typ des Primzahltests angibt, der die Zahl unterworfen wurde. Sie wird als Bitmaske mit den folgenden Werten dargestellt:

source: Not tested.
de: Nicht getestet.

source: Composite number \(en not prime.
de: Zusammengesetzte Zahl \(en keine Primzahl.

source: Sieve of Eratosthenes.
de: Sieb des Eratosthenes.

source: Probabilistic Miller-Rabin primality tests.
de: Wahrscheinlichkeitsbasierter Miller-Rabin-Primzahltest.

source: The E<.Xr ssh-keygen 1> moduli candidate generation uses the Sieve of Eratosthenes (flag 0x02). Subsequent E<.Xr ssh-keygen 1> primality tests are Miller-Rabin tests (flag 0x04).
de: Die Modul-Kandidatenerstellung von E<.Xr ssh-keygen 1> verwendet das Sieb des Eratosthenes (Schalter 0x02). Nachfolgende Primzahltests von E<.Xr ssh-keygen 1> sind Miller-Rabin-Tests (Schalter 0x04).

source: trials
de: Versuche

source: Decimal number indicating the number of primality trials that have been performed on the modulus.
de: Dezimalzahl, die die Anzahl der Primzahlversuche angibt, die auf dem Modul durchgeführt wurden.

source: size
de: Größe

source: Decimal number indicating the size of the prime in bits.
de: Dezimalzahl, die die Größe der Primzahl in Bit anzeigt.

source: The recommended generator for use with this modulus (hexadecimal).
de: Der für die Verwendung mit diesem Modul empfohlene Generator (hexadezimal).

source: modulus
de: Modul

source: The modulus itself in hexadecimal.
de: Das Modul selbst in hexadezimaler Darstellung.

source: When performing Diffie-Hellman Group Exchange, E<.Xr sshd 8> first estimates the size of the modulus required to produce enough Diffie-Hellman output to sufficiently key the selected symmetric cipher. E<.Xr sshd 8> then randomly selects a modulus from E<.Fa /etc/ssh/moduli> that best meets the size requirement.
de: Bei der Durchführung des Diffie-Hellman-Gruppenaustausches schätzt E<.Xr sshd 8> zuerst die Größe des benötigten Moduls ab, um genug Diffie-Hellman-Ausgabe als Eingabe für die symmetrische Chiffre zu erzeugen. E<.Xr sshd 8> wählt dann zufällig einen Modul aus E<.Fa /etc/ssh/moduli>, das am besten die Größenanforderungen erfüllt.

source: SEE ALSO
de: SIEHE AUCH

source: E<.Rs> E<.%A M. Friedl> E<.%A N. Provos> E<.%A W. Simpson> E<.%D March 2006> E<.%R RFC 4419> E<.%T Diffie-Hellman Group Exchange for the Secure Shell (SSH) Transport Layer Protocol> E<.%D 2006> E<.Re>
de: E<.Rs> E<.%A M. Friedl> E<.%A N. Provos> E<.%A W. Simpson> E<.%D März 2006> E<.%R RFC 4419> E<.%T Diffie-Hellman-Gruppenaustausch für das Secure-Shell-(SSH)-Protokoll auf Transportebene> E<.%D 2006> E<.Re>
