Repository: sebras/manpages-l10n
Catalog: po/*/man5/mtools.5.po
Languages: pl

source: On some architectures, such as Solaris, mtools needs root privileges to be able to use the \&CW<scsi> option. Thus mtools should be installed setuid root on Solaris if you want to access Zip/Jaz drives. Thus, if the \&CW<scsi> flag is given, \&CW<privileged> is automatically implied, unless explicitly disabled by \&CW<privileged=0>
pl: Na niektórych systemach, jak Solaris, mtools potrzebują uprawnień superużytkownika (root), by móc wykorzystać opcję \&CW<scsi>. Zatem, jeśli chce się korzystać z napędów Zip/Jaz w systemie Solaris, pakiet mtools powinien być zainstalowany z uprawnieniem setuid root. Stąd też jeśli podano flagę \&CW<scsi>, to automatycznie używana jest też \&CW<privileged>, chyba że zostanie jawnie wyłączona przez \&CW<privileged=0>.

source: Mtools uses its root privileges to open the device, and to issue the actual SCSI I/O calls. Moreover, root privileges are only used for drives described in a system-wide configuration file such as \&\&CW<\(if/etc/mtools.conf\(is>, and not for those described in \&\&CW<\(if~/.mtoolsrc\(is> or \&CW<\(if$MTOOLSRC\(is>.
pl: Mtools używają swoich uprawnień superużytkownika do otwarcia urządzenia oraz wywołania rzeczywistych funkcji wejścia/wyjścia SCSI. Co więcej, uprawnienia roota używane są wyłącznie dla napędów opisanych w pliku konfiguracyjnym o zasięgu ogólnosystemowym, jak \&\&CW<\(if/etc/mtools.conf\(is>, nie zaś dla napędów opisanych w \&\&CW<\(if~/.mtoolsrc\(is> lub w \&CW<\(if$MTOOLSRC\(is>..

source: When set to 1, this instructs mtools to use its setuid and setgid privileges for opening the given drive. This option is only valid for drives described in the system-wide configuration files (such as \&\&CW<\(if/etc/mtools.conf\(is>, not \&CW<\(if~/.mtoolsrc\(is> or \&\&CW<\(if$MTOOLSRC\(is>). Obviously, this option is also a no op if mtools is not installed setuid or setgid. This option is implied by 'scsi=1', but again only for drives defined in system-wide configuration files. Privileged may also be set explicitly to 0, in order to tell mtools not to use its privileges for a given drive even if \&CW<scsi=1> is set.
pl: Ustawiona na 1 nakazuje mtools użycie posiadanych przez nie uprawnień setuid oraz setgid przy otwieraniu danego napędu. Opcja ta jest poprawna tylko dla napędów opisanych w ogólnosystemowym pliku konfiguracyjnym (takim jak \&\&CW<\(if/etc/mtools.conf\(is>, nie zaś w \&CW<\(if~/.mtoolsrc\(is> lub \&\&CW<\(if$MTOOLSRC\(is>). Naturalnie opcja ta nie działa również, jeśli mtools nie zostały zainstalowane z ustawionym setuid lub setgid. Jest automatycznie ustawiana przez "scsi=1", ale również wyłącznie dla napędów zdefiniowanych w plikach konfiguracyjnych o zasięgu ogólnosystemowym. Flaga ta może być jawnie ustawiona na zero w celu zakazania mtools używania uprawnień do danego napędu, nawet jeśli ustawione jest "scsi=1".

source: Mtools only needs to be installed setuid if you use the \&\&CW<privileged> or \&CW<scsi> drive variables. If you do not use these options, mtools works perfectly well even when not installed setuid root.
pl: mtools potrzebują ustawienia dostępu SUID tylko wtedy, gdy planuje się wykorzystanie zmiennych B<privileged> lub B<scsi> dla któregoś z napędów. Jeżeli opcje te nie są używane, mtools działa prawidłowo nawet bez ustawiania SUID root.

source: Instructs mtools to interpret the device name as a vold identifier rather than as a filename. The vold identifier is translated into a real filename using the \&CW<media_findname()> and \&\&CW<media_oldaliases()> functions of the \&CW<volmgt> library. This flag is only available if you configured mtools with the \&\&CW<--enable-new-vold> option before compilation.
pl: Poleca mtools interpretację nazwy urządzenia jako identyfikatora "vold" [tłum.:volume daemon - demon mechanizmu zarządzania woluminami systemu Solaris], nie zaś jako nazwy pliku. Identyfikator "vold" jest tłumaczony na faktyczną nazwę pliku przy użyciu funkcji B<media_findname()> oraz B<media_oldaliases()> z biblioteki B<volmgt>. Przełącznik ten jest dostępny tylko w przypadku skonfigurowania mtools z opcją B<--enable-new-vold> przed kompilacją.

source: Consider the media as a word-swapped Atari disk.
pl: Zakłada, że dysk jest dyskiem Atari z zamienioną kolejnością słów.

source: If this is set to a non-zero value, mtools also tries to access this disk as an XDF disk. XDF is a high capacity format used by OS/2. This is off by default. See section XDF, for more details.
pl: Ustawienie na wartość niezerową powoduje, że mtools próbuje również dostępu do tej dyskietki jak do dyskietki XDF. XDF jest formatem dużej gęstości wykorzystywanym przez OS/2. Przełącznik ten jest domyślnie wyłączony. Więcej informacji znajdziesz w sekcji B<XDF> dokumentacji B<mtools(1)>.

source: Tells mtools to use the geometry for this drive only for mformatting and not for filtering.
pl: mtools powinny użyć geometrii tego napędu tylko do formatowania (mformat), ale nie do filtrowania.

source: Tells mtools to use the geometry for this drive both for mformatting and filtering.
pl: mtools użyją geometrii tego napędu zarówno do formatowania jak i do filtrowania.

source: Tells mtools to connect to floppyd (see section floppyd).
pl: nakazuje mtools podłączenie się do floppyd (patrz B<floppyd>(1)).

source: \ \ Supplying\ multiple\ descriptions\ for\ a\ drive
pl: Wielokrotne opisy napędu

source: It is possible to supply multiple descriptions for a drive. In that case, the descriptions are tried in order until one is found that fits. Descriptions may fail for several reasons:
pl: Możliwe jest podanie wielu opisów dla danego napędu. W takim przypadku, opisy są wypróbowywane po kolei, aż do znalezienia pasującego. Opisy mogą nie pasować z kilku powodów:

source: because the geometry is not appropriate,
pl: nieodpowiednia geometria,

source: because there is no disk in the drive,
pl: brak dysku w napędzie,

source: or because of other problems.
pl: inne kłopoty.

source: Multiple definitions are useful when using physical devices which are only able to support one single disk geometry. Example:
pl: Wielość opisów jest przydatna przy wykorzystywaniu urządzeń fizycznych potrafiących obsługiwać tylko jedną geometrię pojedynczego dysku. Przykład:

source: This instructs mtools to use /dev/fd0H1440 for 1.44m (high density) disks and /dev/fd0H720 for 720k (double density) disks. On Linux, this feature is not really needed, as the /dev/fd0 device is able to handle any geometry.
pl: Powyższe linie nakazują mtools użycie /dev/fd0H1440 dla dyskietek 1.44MB (dużej gęstości) oraz /dev/fd0H720 dla dyskietek 720KB (podwójnej gęstości). W Linuksie cecha ta nie jest faktycznie potrzebna, gdyż urządzenie /dev/fd0 jest w stanie obsługiwać dowolną geometrię.

source: You may also use multiple drive descriptions to access both of your physical drives through one drive letter:
pl: Można też użyć wielu opisów napędu, by korzystać z obu napędów fizycznych za pośrednictwem jednej litery napędu:

source: With this description, \&CW<mdir z:> accesses your first physical drive if it contains a disk. If the first drive doesn't contain a disk, mtools checks the second drive.
pl: Z takim opisem B<mdir z:> wykorzystuje pierwszy napęd fizyczny, jeśli zawiera on dyskietkę. Jeśli w pierwszym napędzie nie ma dyskietki, to mtools sprawdzają drugi napęd.

source: When using multiple configuration files, drive descriptions in the files parsed last override descriptions for the same drive in earlier files. In order to avoid this, use the \&CW<drive+> or \&CW<+drive> keywords instead of \&CW<drive>. The first adds a description to the end of the list (i.e. it will be tried last), and the first adds it to the start of the list.
pl: Przy użyciu wielu plików konfiguracyjnych opisy napędu występujące jako ostatnie przesłaniają uprzednie opisy dla tego samego napędu z wcześniejszych plików. Można tego uniknąć posługując się słowami kluczowymi B<drive+> lub B<+drive> zamiast B<drive>. Pierwsza składnia dodaje opis na końcu listy (tzn.będzie wypróbowany jako ostatni), zaś druga na początek listy.

source: Location\ of\ configuration\ files\ and\ parsing\ order
pl: Położenie plików konfiguracyjnych i kolejność przetwarzania

source: The configuration files are parsed in the following order:
pl: Pliki konfiguracyjne przetwarzane są w następującej kolejności:

source: compiled-in defaults
pl: wbudowane wartości domyślne

source: \&\&CW<\(if$MTOOLSRC\(is> (file pointed by the \&CW<MTOOLSRC> environmental variable)
pl: \&\&CW<\(if$MTOOLSRC\(is> (plik wskazywany przez zawartość zmiennej środowiska \&CW<MTOOLSRC>)

source: Options described in the later files override those described in the earlier files. Drives defined in earlier files persist if they are not overridden in the later files. For instance, drives A and B may be defined in \&CW<\(if/etc/mtools.conf\(is> and drives C and D may be defined in \&CW<\(if~/.mtoolsrc\(is> However, if \&CW<\(if~/.mtoolsrc\(is> also defines drive A, this new description would override the description of drive A in \&CW<\(if/etc/mtools.conf\(is> instead of adding to it. If you want to add a new description to a drive already described in an earlier file, you need to use either the \&CW<+drive> or \&CW<drive+> keyword.
pl: Opcje opisywane w późniejszych plikach unieważniają opcje opisane w plikach wcześniejszych. Napędy zdefiniowane w późniejszych plikach pozostają zdefiniowane, jeśli nie są unieważnione w plikach czytanych później. Na przykład, napędy A i B mogą być zdefiniowane w pliku \&CW<\(if/etc/mtools.conf\(is>, a napędy C i D zdefiniowane w \&CW<\(if~/.mtoolsrc\(is>. Jeżeli jednak \&CW<\(if~/.mtoolsrc\(is> definiuje również napęd A, to ta nowa definicja unieważnia poprzedni opis napędu A z \&CW<\(if/etc/mtools.conf\(is> zamiast uzupełniać go. W celu dodania nowego opisu do napędu już opisanego we wcześniejszym pliku należy posłużyć się słowem kluczowym \&CW<+drive> albo \&CW<drive+>.

source: Backwards\ compatibility\ with\ old\ configuration\ file\ syntax
pl: Wsteczna zgodność ze starą składnią plików konfiguracyjnych

source: The syntax described herein is new for version \&CW<mtools-3.0>. The old line-oriented syntax is still supported. Each line beginning with a single letter is considered to be a drive description using the old syntax. Old style and new style drive sections may be mixed within the same configuration file, in order to make upgrading easier. Support for the old syntax will be phased out eventually, and in order to discourage its use, I purposefully omit its description here.
pl: Składnia opisana w niniejszym dokumencie obowiązuje w nowej wersji \&CW<mtools-3.0>. Stara zorientowana liniowo składnia jest nadal obsługiwana. W starej składni każda linia rozpoczynająca się pojedynczą literą uważana jest za opis napędu. Sekcje napędów w starej i nowej składni mogą być mieszane w tym samym pliku konfiguracyjnym, co powinno ułatwić aktualizację do nowej wersji. Obsługa starej składni będzie z czasem zaniechane, a w celu zniechęcenia do jej używania celowo pominięto tu jej opis.

source: See also
pl: Zobacz także

source: 28Nov20
pl: 28 listopada 2020

source: The following general purpose drive variables are available. Depending to their type, these variables can be set to a string (precmd) or an integer (all others)
pl: Dostępne są poniższe ogólne zmienne napędu. W zależności od typu, zmiennym tym może być przypisany łańcuch znakowy (precmd) lub liczba całkowita (pozostałe).

source: On some variants of Solaris, it is necessary to call 'volcheck -v' before opening a floppy device, in order for the system to notice that there is indeed a disk in the drive. \&CW<precmd="volcheck -v"> in the drive clause establishes the desired behavior.
pl: W niektórych odmianach Solaris niezbędne jest wywołanie B<volcheck -v> przed otwarciem urządzenia dyskietek, co ma na celu wymuszenie na systemie zauważenia, że w napędzie rzeczywiście jest dyskietka. B<precmd="volcheck -v"> umieszczone w sekcji opisującej napęd powoduje pożądane zachowanie.

source: 10Jul21
pl: 10 lipca 2021

source: 06Aug21
pl: 6 sierpnia 2021
