Repository: sebras/manpages-l10n
Catalog: po/*/man5/mtools.5.po
Languages: pl

source: Name
pl: Nazwa

source: mtools.conf - mtools configuration files
pl: mtools.conf - pliki konfiguracyjne mtools

source: Description
pl: opis

source: This manual page describes the configuration files for mtools. They are called \&CW<\(if/etc/mtools.conf\(is> and \&CW<\(if~/.mtoolsrc\(is>. If the environmental variable \&CW<MTOOLSRC> is set, its contents is used as the filename for a third configuration file. These configuration files describe the following items:
pl: Niniejsza strona podręcznika opisuje pliki konfiguracyjne pakietu mtools. Pliki konfiguracyjne noszą nazwy \&CW<\(if/etc/mtools.conf\(is> oraz \&CW<\(if~/.mtoolsrc\(is>. Jeśli ustawiono zmienną środowiska \&CW<MTOOLSRC>, to jej wartość jest używana jako nazwa trzeciego pliku konfiguracyjnego. Pliki konfiguracyjne opisują następujące pozycje:

source: * \ Global\ configuration\ flags\ and\ variables\
pl: * Ogólne flagi i zmienne konfiguracji

source: * \ Per\ drive\ flags\ and\ variables\
pl: * Flagi i zmienne dla napędu

source: Location\ of\ the\ configuration\ files
pl: Położenie plików konfiguracyjnych

source: \&\&CW<\(if/etc/mtools.conf\(is> is the system-wide configuration file, and \&CW<\(if~/.mtoolsrc\(is> is the user's private configuration file.
pl: Ogólnym, systemowym plikiem konfiguracyjnym jest \&\&CW<\(if/etc/mtools.conf\(is>, a \&CW<\(if~/.mtoolsrc\(is> jest prywatnym plikiem konfiguracyjnym użytkownika.

source: On some systems, the system-wide configuration file is called \&\&CW<\(if/etc/default/mtools.conf\(is> instead.
pl: W niektórych systemach plikiem konfiguracyjnym o zasięgu ogólnosystemowym jest jednak \&\&CW<\(if/etc/default/mtools.conf\(is>.

source: \ \ General\ configuration\ file\ syntax
pl: Ogólna składnia pliku konfiguracyjnego

source: The configuration files is made up of sections. Each section starts with a keyword identifying the section followed by a colon. Then follow variable assignments and flags. Variable assignments take the following form:
pl: Pliki konfiguracyjne złożone są z sekcji. Każda sekcja rozpoczyna się identyfikującym ją słowem kluczowym zakończonym dwukropkiem. Po identyfikacji sekcji następują przypisania zmiennych i flag. Przypisania zmiennych mają poniższą postać:

source: I<name=value>
pl: I<nazwa=wartość>

source: Flags are lone keywords without an equal sign and value following them. A section either ends at the end of the file or where the next section begins.
pl: Flagi są pojedynczymi słowami kluczowymi bez znaku równości i przypisanej wartości. Sekcja kończy się z końcem pliku lub z rozpoczęciem kolejnej sekcji.

source: Lines starting with a hash (\&CW<#>) are comments. Newline characters are equivalent to whitespace (except where ending a comment). The configuration file is case insensitive, except for item enclosed in quotes (such as filenames).
pl: Linie rozpoczynające się od znaku krzyżyka (\&CW<#>) są komentarzami. Znaki nowej linii są równoważne białym znakom (z wyjątkiem kończących komentarz). Wielkość liter w pliku konfiguracyjnym nie ma znaczenia, z wyjątkiem pozycji ujętych w znaki cytowania (jak na przykład nazwy plików).

source: Default\ values
pl: Domyślne wartości

source: For most platforms, mtools contains reasonable compiled-in defaults for physical floppy drives. Thus, you usually don't need to bother with the configuration file, if all you want to do with mtools is to access your floppy drives. On the other hand, the configuration file is needed if you also want to use mtools to access your hard disk partitions and DOSEMU image files.
pl: Dla większości platform mtools mają wbudowane rozsądne parametry domyślne dla napędów dyskietek. Zwykle zatem nie ma potrzeby zajmowania się plikiem konfiguracyjnym, jeśli chcemy jedynie wykorzystywać mtools do uzyskania dostępu do dyskietek. Z drugiej strony jednak plik konfiguracyjny jest niezbędny przy użyciu mtools również do partycji dysku twardego i plików obrazu DOSEMU.

source: Global\ variables
pl: Zmienne globalne

source: Global flags may be set to 1 or to 0.
pl: Przełączniki (flagi) globalne mogą być ustawione na 1 lub 0.

source: The following global flags are recognized:
pl: Rozpoznawane są następujące flagi globalne:

source: If this is set to 1, mtools skips most of its sanity checks. This is needed to read some Atari disks which have been made with the earlier ROMs, and which would not be recognized otherwise.
pl: Ustawienie na 1 powoduje, że mtools pomijają większość testów kontrolnych. Potrzebne przy odczycie niektórych dyskietek Atari, zrobionych z użyciem wcześniejszych wersji ROM, które w inny sposób nie byłyby rozpoznawane.

source: If this is set to 1, mtools skips the fat size checks. Some disks have a bigger FAT than they really need to. These are rejected if this option is not set.
pl: Przy ustawieniu na 1, mtools pomijają sprawdzenie rozmiaru FAT. Niektóre dyski mają FAT większy niż faktycznie tego potrzebują. Są one odrzucane, jeśli niniejsza opcja nie jest ustawiona.

source: If this is set to 1, mtools displays all-upper-case short filenames as lowercase. This has been done to allow a behavior which is consistent with older versions of mtools which didn't know about the case bits.
pl: Ustawienie na 1 powoduje, że mtools wyświetlają małymi literami krótkie nazwy plików, w których wszystkie litery są duże. Stworzone dla uzyskania zgodności z poprzednimi wersjami mtools, które nie rozpoznawały bitu dużych/małych liter (patrz B<mtools>(1), sekcja B<Rozróżnianie dużych i małych liter w systemie VFAT>).

source: If this is set to 1, mtools won't generate VFAT entries for filenames which are mixed-case, but otherwise legal dos filenames. This is useful when working with DOS versions which can't grok VFAT long names, such as FreeDOS.
pl: Przy ustawieniu na 1 mtools nie będą tworzyć wpisów VFAT dla nazw plików o mieszanych, dużych/małych literach, które poza tym są poprawnymi nazwami plików DOS-u. Przydatne przy pracy z wersjami DOS-u nieobsługującymi długich nazw VFAT, jak np. FreeDOS.

source: In a wide directory, prints the short name with a dot instead of spaces separating the basename and the extension.
pl: Przy szerokim listowaniu katalogu, pokazuje nazwy plików z kropką zamiast odstępów oddzielających nazwę od rozszerzenia.

source: If this is set to one (default), generate numeric tails for all long names (~1). If set to zero, only generate numeric tails if otherwise a clash would have happened.
pl: Domyślnie ustawione na jeden, decyduje o tworzeniu numerycznych przyrostków we wszystkich długich nazwach plików (~1). Ustawienie na zero oznacza, że przyrostki numeryczne nie będą tworzone, chyba że spowodowałoby to kolizję nazw.

source: If 1, uses the European notation for times (twenty four hour clock), else uses the UK/US notation (am/pm)
pl: Przy ustawieniu na jeden używany jest europejski sposób zapisu czasu (zegar 24-godzinny). W przeciwnym przypadku wykorzystywana jest notacja anglosaska (am/pm).

source: Example: Inserting the following line into your configuration file instructs mtools to skip the sanity checks:
pl: Przykład: Wstawienie poniższej linii do pliku konfiguracyjnego nakazuje mtools pominięcie testów poprawności:

source: Global variables may also be set via the environment:
pl: Zmienne globalne mogą być także ustawiane za pomocą środowiska:

source: Global string variables may be set to any value:
pl: Globalne zmienne znakowe mogą mieć przypisaną dowolną wartość:

source: The format used for printing dates of files. By default, is dd-mm-yyyy.
pl: Format używany do wyświetlania dat plików. Domyślnie jest to dd-mm-yyyy.

source: Per\ drive\ flags\ and\ variables
pl: Flagi i zmienne napędów

source: \ \ General\ information
pl: Informacje ogólne

source: Per drive flags and values may be described in a drive section. A drive section starts with \&\&CW<drive> "I<driveletter>" :
pl: W sekcji napędu mogą być użyte przełączniki i wartości odnoszące się do tego napędu. Sekcja opisująca napęd rozpoczyna się od napisu: B<drive >I<litera_napędu>B<:>

source: Then follow variable-value pairs and flags.
pl: Następnie występują pary zmienna-wartość oraz flagi.

source: This is a sample drive description:
pl: A oto przykładowy opis napędu:

source: \ \ Location\ information
pl: Informacje o położeniu

source: For each drive, you need to describe where its data is physically stored (image file, physical device, partition, offset).
pl: Dla każdego napędu należy podać miejsce, w którym dane są fizycznie umieszczone (plik obrazu, urządzenie, partycja, offset).

source: The name of the file or device holding the disk image. This is mandatory. The file name should be enclosed in quotes.
pl: Nazwa pliku lub urządzenia przechowującego obraz dysku/dyskietki. Zmienna obowiązkowa. Nazwa pliku powinna być ujęta w cudzysłowy.

source: Tells mtools to treat the drive as a partitioned device, and to use the given partition. Only primary partitions are accessible using this method, and they are numbered from 1 to 4. For logical partitions, use the more general \&CW<offset> variable. The \&CW<partition> variable is intended for removable media such as Syquest disks, ZIP drives, and magneto-optical disks. Although traditional DOS sees Syquest disks and magneto-optical disks as \&CW<\(ifgiant floppy disks\(is> which are unpartitioned, OS/2 and Windows NT treat them like hard disks, i.e. partitioned devices. The \&CW<partition> flag is also useful DOSEMU hdimages. It is not recommended for hard disks for which direct access to partitions is available through mounting.
pl: Nakazuje mtools traktowanie napędu jak urządzenia spartycjonowanego i wymusza użycie zadanej partycji. Przy zastosowaniu tej metody dostępne są wyłącznie partycje główne (primary), numerowane od 1 do 4. Dla partycji logicznych należy posłużyć się ogólniejszą zmienną \&CW<offset>. Zmienna \&CW<partition> przeznaczona jest do obsługi nośników wyjmowalnych, takich jak napędy Syquest, ZIP czy dyski magnetooptyczne. Mimo że tradycyjny DOS postrzega dyski Syquest i dyski magnetooptyczne jako \&CW<\(ifogromne dyskietki\(is>, które nie są partycjonowane, to OS/2 oraz Windows NT traktują je jak dyski twarde, tj. urządzenia partycjonowane. Flaga \&CW<partition> przydaje się dla obrazów dysków twardych DOSEMU. Nie jest zalecana dla dysków twardych, do których możliwy jest bezpośredni dostęp do partycji poprzez montowanie (mount).

source: Describes where in the file the MS-DOS file system starts. This is useful for logical partitions in DOSEMU hdimages, and for ATARI ram disks. By default, this is zero, meaning that the file system starts right at the beginning of the device or file.
pl: Opisuje, gdzie w pliku rozpoczyna się system plików MS-DOS. Przydatna w obsłudze partycji logicznych wewnątrz obrazów dysków twardych (hdimages) DOSEMU oraz ram-dysków Atari. Domyślnie ustawiona na zero, co oznacza, że system plików zaczyna się na samym początku urządzenia lub pliku.

source: \ \ Disk\ Geometry\ Configuration
pl: Konfiguracja geometrii dysku

source: Geometry information describes the physical characteristics about the disk. Its has three purposes:
pl: Informacja o geometrii opisuje fizyczną charakterystykę dysku. Ma ona trojakie zastosowanie:

source: formatting\
pl: formatowanie

source: The geometry information is written into the boot sector of the newly made disk. However, you may also describe the geometry information on the command line. See section mformat, for details.
pl: Informacja o geometrii zapisywana jest w sektorze startowym (boot-sector) nowo utworzonego dysku. Można jednak opisać geometrię dysku z linii poleceń (patrz polecenie mformat).

source: filtering\
pl: filtrowanie

source: On some Unixes there are device nodes which only support one physical geometry. For instance, you might need a different node to access a disk as high density or as low density. The geometry is compared to the actual geometry stored on the boot sector to make sure that this device node is able to correctly read the disk. If the geometry doesn't match, this drive entry fails, and the next drive entry bearing the same drive letter is tried. See section multiple descriptions, for more details on supplying several descriptions for one drive letter.
pl: W niektórych Uniksach węzły urządzeń (device nodes) obsługują wyłącznie jedną geometrię fizyczną. Na przykład, można potrzebować innego węzła dla dostępu do dyskietki dużej gęstości niż do dyskietki o małej gęstości. Aby zapewnić możliwość poprawnego odczytu dysku przez węzeł, geometria porównywana jest z faktyczną geometrią zapisaną w sektorze startowym. Jeżeli nie pasują, to odpowiedni zapis charakteryzujący napęd zawodzi i testowany jest kolejny wpis z tą samą literą napędu. Sekcja "Wielokrotne opisy" wyjaśnia bliżej posługiwanie się wieloma opisami dla jednej litery napędu.

source: If no geometry information is supplied in the configuration file, all disks are accepted. On Linux (and on SPARC) there exist device nodes with configurable geometry (\&CW<\(if/dev/fd0\(is>, \&CW<\(if/dev/fd1\(is> etc), and thus filtering is not needed (and ignored) for disk drives. (Mtools still does do filtering on plain files (disk images) in Linux: this is mainly intended for test purposes, as I don't have access to a Unix which would actually need filtering).
pl: Gdy w pliku konfiguracyjnym nie podano żadnej informacji o geometrii, to akceptowane są wszystkie dyski. W Linuksie (i również w systemie SPARC) istnieją węzły urządzeń o konfigurowalnej geometrii (\&CW<\(if/dev/fd0\(is>, \&CW<\(if/dev/fd1\(is> itd.), zatem filtrowanie napędów dyskowych jest zbędne (i ignorowane). (Mtools wykonują jednak filtrowanie plików zwykłych (obrazów dysków) w Linuksie: przeznaczono to głównie do testowania, gdyż nie mam dostępu do Uniksa, który faktycznie potrzebowałby filtrowania).

source: If you do not need filtering, but want still a default geometry for mformatting, you may switch off filtering using the \&CW<mformat_only> flag.
pl: Jeśli nie potrzebujesz filtrowania, a chcesz używać domyślnej geometrii przy formatowaniu (z użyciem B<mformat>), możesz wyłączyć filtrowaniu flagą B<mformat_only>.

source: If you want filtering, you should supply the \&CW<filter> flag. If you supply a geometry, you must supply one of both flags.
pl: Jeśli chcesz filtrowania - powinieneś użyć flagi B<filter>. Podając geometrię musisz podać również jedną z tych dwu flag.

source: initial\ geometry\
pl: geometria początkowa

source: On devices that support it (usually floppy devices), the geometry information is also used to set the initial geometry. This initial geometry is applied while reading the boot sector, which contains the real geometry. If no geometry information is supplied in the configuration file, or if the \&CW<mformat_only> flag is supplied, no initial configuration is done.
pl: W urządzeniach obsługujących tę możliwość (zwykle napędy dyskietek), informacja o geometrii używana jest też do ustawienia geometrii początkowej. Geometria początkowa stosowana jest przy odczycie sektora startowego, zawierającego rzeczywistą geometrię. Początkowe konfigurowanie nie jest wykonywane, gdy w pliku konfiguracyjnym brak jest opisu geometrii lub gdy użyto flagi B<mformat_only>.

source: On Linux, initial geometry is not really needed, as the configurable devices are able to auto-detect the disk type accurately enough (for most common formats) to read the boot sector.
pl: W Linuksie geometria początkowa nie jest faktycznie potrzebna, gdyż urządzenia konfigurowalne potrafią samoczynnie wykryć dostatecznie dokładnie typ dysku (dla większości powszechnych formatów) by móc odczytać sektor startowy.

source: Wrong geometry information may lead to very bizarre errors. That's why I strongly recommend that you add the \&CW<mformat_only> flag to your drive description, unless you really need filtering or initial geometry.
pl: Zły opis geometrii może prowadzić do bardzo poważnych błędów. Dlatego też usilnie zaleca się dodanie flagi B<mformat_only> do opisu napędu, chyba iż faktycznie występuje potrzeba filtrowania czy geometrii początkowej.

source: The following geometry related variables are available:
pl: Dostępne są następujące zmienne związane z geometrią dysków:

source: The number of cylinders. (\&CW<cylinders> is the preferred form, \&\&CW<tracks> is considered obsolete)
pl: Liczba cylindrów. Forma zalecana; B<tracks> (ścieżki) jest formą przestarzałą.

source: The number of heads (sides).
pl: Liczba głowic (stron).

source: The number of sectors per track.
pl: Liczba sektorów na ścieżkę.

source: Example: the following drive section describes a 1.44M drive:
pl: Przykład: poniższa sekcja opisuje napęd 1.44MB:

source: The following shorthand geometry descriptions are available:
pl: Dostępne są następujące skrócone opisy geometrii:

source: high density 3 1/2 disk. Equivalent to: \&\&CW<fat_bits=12 cylinders=80 heads=2 sectors=18>
pl: dyskietka 3,5" wysokiej gęstości. Równoważne: fat_bits=12 cylinders=80 heads=2 sectors=18

source: high density 5 1/4 disk. Equivalent to: \&\&CW<fat_bits=12 cylinders=80 heads=2 sectors=15>
pl: dyskietka 5,25" wysokiej gęstości. Równoważne: fat_bits=12 cylinders=80 heads=2 sectors=15

source: double density 3 1/2 disk. Equivalent to: \&\&CW<fat_bits=12 cylinders=80 heads=2 sectors=9>
pl: dyskietka 3,5" podwójnej gęstości. Równoważne: fat_bits=12 cylinders=80 heads=2 sectors=9

source: double density 5 1/4 disk. Equivalent to: \&\&CW<fat_bits=12 cylinders=40 heads=2 sectors=9>
pl: dyskietka 5,25" podwójnej gęstości. Równoważne: fat_bits=12 cylinders=40 heads=2 sectors=9

source: The shorthand format descriptions may be amended. For example, \&\&CW<360k sectors=8> describes a 320k disk and is equivalent to: \&\&CW<fat_bits=12 cylinders=40 heads=2 sectors=8>
pl: Skrócone opisy formatów mogą być zmieniane, zdefiniując inny format. Na przykład, B<360k sectors=8> opisuje dyskietkę 320k i jest równoważne zapisowi: fat_bits=12 cylinders=40 heads=2 sectors=8.

source: \ \ Open\ Flags
pl: Flagi otwarcia

source: Moreover, the following flags are available:
pl: Dostępne są ponadto następujące flagi:

source: All i/o operations are done synchronously
pl: Wszystkie operacje wejścia/wyjścia wykonywane są synchronicznie.

source: The device or file is opened with the O_NDELAY flag. This is needed on some non-Linux architectures.
pl: Urządzenie lub plik jest otwierane z flagą O_NDELAY. Niezbędne przy niektórych systemach nie-Linuksowych.

source: The device or file is opened with the O_EXCL flag. On Linux, this ensures exclusive access to the floppy drive. On most other architectures, and for plain files it has no effect at all.
pl: Urządzenie lub plik jest otwierane z flagą O_EXCL. W Linuksie zapewnia to dostęp do napędu dyskietek w trybie wyłączności. W większości innych architektur oraz dla zwykłych plików nie daje żadnego efektu.

source: \ \ General\ Purpose\ Drive\ Variables
pl: Zmienne napędu ogólnego przeznaczenia

source: The number of FAT bits. This may be 12 or 16. This is very rarely needed, as it can almost always be deduced from information in the boot sector. On the contrary, describing the number of fat bits may actually be harmful if you get it wrong. You should only use it if mtools gets the auto-detected number of fat bits wrong, or if you want to mformat a disk with a weird number of fat bits.
pl: Liczba bitów tablicy alokacji plików (FAT). Może to być 12 lub 16. Rzadko potrzebna, gdyż prawie zawsze może być uzyskana z informacji w sektorze startowym. I przeciwnie, podanie liczby bitów FAT może być przyczyną kłopotów, jeśli jest ona zła. Powinna być używana wyłącznie w przypadku niewłaściwego rozpoznawania automatycznego przez mtools liczby bitów FAT. Przydatna również przy formatowaniu z wykorzystaniem polecenia mformat dyskietki z nietypową liczbą bitów FATu.

source: Describes the DOS code page used for short filenames. This is a number between 1 and 999. By default, code page 850 is used. The reason for this is because this code page contains most of the characters that are also available in ISO-Latin-1. You may also specify a global code page for all drives by using the global \&CW<default_codepage> parameter (outside of any drive description). This parameters exists starting at version 4.0.0
pl: Opisuje stronę kodową DOS używaną do krótkich nazw plików. Jest to numer pomiędzy 1 a 999. Domyślną wartością jest 850, która zawiera większość znaków występujących w ISO-Latin-1. Można także podać globalną stronę kodową, używając globalnego parametru \&CW<default_codepage> (podanego poza opisem jakiegokolwiek dysku). Ten parametr istnieje od wersji 4.0.0.

source: This parameter represents a default block size to be always used on this device. All I/O is done with multiples of this block size, independently of the sector size registered in the file system's boot sector. This is useful for character devices whose sector size is not 512, such as for example CD-ROM drives on Solaris.
pl: Parametr ten określa domyślny rozmiar bloku, jaki będzie zawsze używany dla danego urządzenia. Wszystkie operacje wejścia/wyjścia wykonywane są z wielokrotnością tego rozmiaru bloku, niezależnie od rozmiaru sektora zapisanego w sektorze startowym systemu plików. Rozwiązanie to jest przydatne do obsługi urządzeń znakowych, gdzie rozmiar sektora jest inny niż 512, jak na przykład napędy CD-ROM w systemie Solaris.

source: Only the \&CW<file> variable is mandatory. The other parameters may be left out. In that case a default value or an auto-detected value is used.
pl: Obowiązkowa jest tylko zmienna \&CW<file>. Inne parametry mogą zostać pominięte. W takim przypadku przyjmowane są wartości domyślne lub automatycznie wykrywane.

source: \ \ General\ Purpose\ Drive\ Flags
pl: Flagi napędu ogólnego przeznaczenia

source: A flag can either be set to 1 (enabled) or 0 (disabled). If the value is omitted, it is enabled. For example, \&CW<scsi> is equivalent to \&\&CW<scsi=1>
pl: Flaga może być albo ustawiona na 1 (włączone), albo na 0 (wyłączone). Jeśli pominięto wartość, to jest ona włączana. Na przykład, \&CW<scsi> jest równoważne z \&\&CW<scsi=1>

source: Instruct mtools to not use locking on this drive. This is needed on systems with buggy locking semantics. However, enabling this makes operation less safe in cases where several users may access the same drive at the same time.
pl: Poleca mtools nie używać blokady (locking) dla tego napędu. Przydatne w systemach z nie najlepszą semantyką blokowania. Włączenie tego przełącznika powoduje jednak, że operacje są mniej bezpieczne w przypadkach, gdy kilku użytkowników może korzystać z tego samego napędu w tym samym czasie.

source: When set to 1, this option tells mtools to use raw SCSI I/O instead of the standard read/write calls to access the device. Currently, this is supported on HP-UX, Solaris and SunOS. This is needed because on some architectures, such as SunOS or Solaris, PC media can't be accessed using the \&CW<read> and \&CW<write> system calls, because the OS expects them to contain a Sun specific "disk label".
pl: Ustawiona na 1 nakazuje mtools użycie przy dostępie do urządzenia surowego wejścia/wyjścia SCSI (raw SCSI I/O) zamiast standardowych funkcji read/write. Obecnie jest to obsługiwane na HP/UX, Solaris i SunOS. Przełącznik jest tam niezbędny, gdyż w niektórych architekturach, jak SunOS czy Solaris, nie można korzystać z nośników PC przy użyciu funkcji systemowych \&CW<read> i \&CW<write>, gdyż system operacyjny oczekuje, że będą one zawierać specyficzną dla Suna "etykietę dysku".

source: As raw SCSI access always uses the whole device, you need to specify the "partition" flag in addition
pl: Ponieważ surowy dostęp do SCSI zawsze posługuje się całym urządzeniem, musisz podać dodatkowo flagę "partition".
