Repository: sebras/manpages-l10n
Catalog: po/*/man5/networks.5.po
Languages: es

source: NAME
es: NOMBRE

source: networks - network name information
es: networks - información del nombre de red

source: DESCRIPTION
es: DESCRIPCIÓN

source: The file I</etc/networks> is a plain ASCII file that describes known DARPA networks and symbolic names for these networks. Each line represents a network and has the following structure:
es: I</etc/networks> es un archivo de texto ASCII plano que contiene redes DARPA conocidas y nombres simbólicos asociados a ellas. Cada línea representa una red y tiene el formato siguiente:

source: I<name number aliases ...>
es: I<nombre número alias ...>

source: where the fields are delimited by spaces or tabs. Empty lines are ignored. The hash character (B<#>) indicates the start of a comment: this character, and the remaining characters up to the end of the current line, are ignored by library functions that process the file.
es: Los distintos campos están separados entre si mediante espacios o tabulaciones. No se tienen en cuenta las líneas en blanco. La almohadilla (B<#>) denota el inicio de un comentario con lo que tanto éste como el resto de caracteres de la línea serán ignorado cuando se procese el archivo.

source: The field descriptions are:
es: La descripción de los campos es la siguiente:

source: I<name>
es: I<nombre>

source: The symbolic name for the network. Network names can contain any printable characters except white-space characters or the comment character.
es: Nombre simbólo de la red. Los nombres de red pueden incluir cualquier carácter imprimible excepto espacios en blanco o almohadillas.

source: I<number>
es: I<número>

source: The official number for this network in numbers-and-dots notation (see B<inet>(3)). The trailing ".0" (for the host component of the network address) may be omitted.
es: Numeración oficial para esta red en forma de números y puntos (consulte B<inet>(3)). El ".0" final puede omitirse (correspondería a la numeración del equipo dentro de la dirección de red).

source: Optional aliases for the network.
es: Alias opcionales de la red.

source: This file is read by the B<route>(8) and B<netstat>(8) utilities. Only Class A, B, or C networks are supported, partitioned networks (i.e., network/26 or network/28) are not supported by this file.
es: Las herramientas B<route>(8) y B<netstat>(8) leen el contenido de este archivo. Sólo es posible denotar redes de clase A, B o C. Las redes segmentadas (por ejemplo: red/26 o red/28) no pueden indicarse en este archivo.

source: FILES
es: ARCHIVOS

source: The networks definition file.
es: Archivo de definición de redes.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: Linux System Administration
es: Administración de Sistemas Linux

source: The official number for this network in numbers-and-dots notation (see B<inet>(3)). The trailing ".0" (for the host component of the network address) may be omitted.
es: Numeración oficial para esta red en forma de números y puntos (consulte B<inet>(3)). Puede omitirse la parte que denota el equipo (el ".0" al final).

source: This file is read by the B<route>(8) and B<netstat>(8) utilities. Only Class A, B or C networks are supported, partitioned networks (i.e., network/26 or network/28) are not supported by this file.
es: Las herramientas B<route>(8) y B<netstat>(8) leen el contenido de este archivo. Sólo es posible denotar redes de clase A, B o C. Las redes segmentadas (por ejemplo: red/26 o red/28) no pueden indicarse en este archivo.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This file is read by the B<route>(8) and B<netstat>(8) utilities. Only Class A, B or C networks are supported, partitioned networks (i.e., network/26 or network/28) are not supported by this facility.
es: Las herramientas B<route>(8) y B<netstat>(8) leen el contenido de este archivo. Sólo es posible denotar redes de clase A, B o C. Las redes segmentadas (por ejemplo: red/26 o red/28) no pueden indicarse aquí.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
