Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: After an NFS version 4 server reboots, each client tells the server about existing file open and lock state under its lease before operation can continue. If a client reboots, the server frees all open and lock state associated with that client's lease.
de: Nachdem ein NFS-Version-4-Server neustartet, teilt jeder Client dem Server mit, welche Dateien offen sind und welchen Sperrzustand unter seiner Ausleihe vorliegt, bevor die Arbeit fortgefahren werden kann. Falls ein Client neu startet, löst der Server alle offenen und Sperrzustände, die mit der Ausleihe des Clients verbunden sind.

source: When establishing a lease, therefore, a client must identify itself to a server. Each client presents an arbitrary string to distinguish itself from other clients. The client administrator can supplement the default identity string using the I<nfs4.nfs4_unique_id> module parameter to avoid collisions with other client identity strings.
de: Wenn eine Ausleihe etabliert wird, muss der Client sich daher beim Server identifizieren. Jeder Client zeigt eine beliebige Zeichenkette vor, um sich von anderen Clients zu unterscheiden. Der Client-Administrator kann die Vorgabe-Identitätszeichenkette mit dem Modulparameter I<nfs4.nfs4_unique_id> ergänzen, um Kollisionen mit den Identifikationszeichenketten anderer Clients zu vermeiden.

source: A client also uses a unique security flavor and principal when it establishes its lease. If two clients present the same identity string, a server can use client principals to distinguish between them, thus securely preventing one client from interfering with the other's lease.
de: Ein Client verwendet auch eine eindeutige Sicherheitsvariante und -Principal, wenn es eine Ausleihe etabliert. Falls zwei Clients die gleiche Identitätszeichenkette vorweisen, kann ein Server die Client-Principals verwenden, um zwischen beiden zu unterscheiden, und damit auf sichere Weise verhindern, dass Clients sich gegenseitig mit ihren Ausleihen in die Quere kommen.

source: The Linux NFS client establishes one lease on each NFS version 4 server. Lease management operations, such as lease renewal, are not done on behalf of a particular file, lock, user, or mount point, but on behalf of the client that owns that lease. A client uses a consistent identity string, security flavor, and principal across client reboots to ensure that the server can promptly reap expired lease state.
de: Der Linux-NFS-Client etabliert eine Ausleihe auf jeden NFS-Version-4-Server. Ausleih-Verwaltungsaktionen, wie Ausleih-Erneuerung, werden nicht im Auftrag einer bestimmten Datei, Sperre, eines bestimmten Benutzers oder Einhängepunkts durchgeführt, sondern für den Client, dem die Ausleihe gehört. Ein Client verwendet eine konsistente Identitätszeichenkette, Sicherheitsvariante und Principal auch über Systemneustarte hinweg, um sicherzustellen, dass der Server schnell ausgelaufene Ausleihstati wiedererlangt.

source: When Kerberos is configured on a Linux NFS client (i.e., there is a I</etc/krb5.keytab> on that client), the client attempts to use a Kerberos security flavor for its lease management operations. Kerberos provides secure authentication of each client. By default, the client uses the I<host/> or I<nfs/> service principal in its I</etc/krb5.keytab> for this purpose, as described in B<rpc.gssd>(8).
de: Wenn auf einem Linux-NFS-Client Kerberos konfiguriert ist (d.h. es eine I</etc/krb5.keytab> auf diesem Client gibt), versucht der Client, eine Kerberos-Sicherheitsvariante für seine Ausleih-Verwaltungsaktionen zu verwenden. Kerberos bietet sichere Authentifizierung jedes Clients an. Standardmäßig verwendet der Client für diesen Zweck die Dienst-Principials I<host/> oder I<nfs/> in seiner I</etc/krb5.keytab>, wie dies in B<rpc.gssd>(8) dargestellt ist.

source: If the client has Kerberos configured, but the server does not, or if the client does not have a keytab or the requisite service principals, the client uses I<AUTH_SYS> and UID 0 for lease management.
de: Falls der Client aber nicht der Server Kerberos konfiguriert hat oder falls der Client keine Schlüsseltabelle oder die benötigten Server-Principals hat, verwendet der Client I<AUTH_SYS> und UID 0 für die Ausleih-Verwaltung.

source: Using non-privileged source ports
de: Verwendung nichtprivilegierter Quell-Ports

source: NFS clients usually communicate with NFS servers via network sockets. Each end of a socket is assigned a port value, which is simply a number between 1 and 65535 that distinguishes socket endpoints at the same IP address. A socket is uniquely defined by a tuple that includes the transport protocol (TCP or UDP) and the port values and IP addresses of both endpoints.
de: NFS-Clients kommunizieren normalerweise über Netz-Sockets mit dem Server. Jedes Ende eines Sockets wird ein Port-Wert zugeordnet. Dieser ist einfach eine Nummer zwischen 1 und 65535, der die Socket-Endpunkte auf der gleichen IP-Adresse unterscheidet. Ein Socket ist eindeutig durch das Tupel Transportprotokoll (TCP oder UDP), dem Port-Wert und der IP-Adresse beider Endpunkte definiert.

source: The NFS client can choose any source port value for its sockets, but usually chooses a I<privileged> port. A privileged port is a port value less than 1024. Only a process with root privileges may create a socket with a privileged source port.
de: Der NFS-Client kann jeden Quell-Port-Wert für seine Sockets auswählen, nimmt aber gewöhnlich einen I<privilegierten> Port. Ein privilegierter Port-Wert ist kleiner als 1024. Nur ein Prozess mit Root-Rechten kann einen Socket mit einem privilegierten Quell-Port erstellen.

source: The exact range of privileged source ports that can be chosen is set by a pair of sysctls to avoid choosing a well-known port, such as the port used by ssh. This means the number of source ports available for the NFS client, and therefore the number of socket connections that can be used at the same time, is practically limited to only a few hundred.
de: Der genaue Bereich der auswählbaren privilegierten Quell-Ports wird durch ein Sysctl-Paar ausgewählt, um gut bekannte Ports zu vermeiden, wie den von SSH verwandten Port. Das bedeutet, dass die Anzahl der für den NFS-Client verfügbaren Quell-Ports und damit die Anzahl der Socket-Verbindungen, die gleichzeitig verwandt werden können, praktisch auf nur einige Hundert begrenzt ist.

source: As described above, the traditional default NFS authentication scheme, known as AUTH_SYS, relies on sending local UID and GID numbers to identify users making NFS requests. An NFS server assumes that if a connection comes from a privileged port, the UID and GID numbers in the NFS requests on this connection have been verified by the client's kernel or some other local authority. This is an easy system to spoof, but on a trusted physical network between trusted hosts, it is entirely adequate.
de: Wie oben beschrieben, verlässt sich das traditionelle Standard-NFS-Authentifizierungsschema, bekannt als AUTH_SYS, auf das Senden der lokalen UID und GID-Nummern, um Benutzer, die NFS-Anfragen stellen, zu identifizieren. Ein NFS-Server nimmt an, dass die UID und GID-Nummer in den NFS-Anfragen auf dieser Verbindung vom Client-Kernel oder einer anderen lokalen Autorität überprüft wurde, falls die Verbindung von einem privilegierten Port kommt. Dieses System ist leicht zu täuschen, aber in vertrauenswürdigen physischen Netzen zwischen vertrauenswürdigen Rechnern ist es vollkommen angemessen.

source: Roughly speaking, one socket is used for each NFS mount point. If a client could use non-privileged source ports as well, the number of sockets allowed, and thus the maximum number of concurrent mount points, would be much larger.
de: Grob gesprochen wird ein Socket für jeden NFS-Einhängepunkt verwandt. Falls ein Client auch nichtprivilegierte Quell-Ports verwenden könnte, wäre die Anzahl der erlaubten Sockets und damit die maximale Anzahl an gleichzeitigen Einhängepunkten viel größer.

source: Using non-privileged source ports may compromise server security somewhat, since any user on AUTH_SYS mount points can now pretend to be any other when making NFS requests. Thus NFS servers do not support this by default. They explicitly allow it usually via an export option.
de: Die Verwendung nichtprivilegierter Quell-Ports könnte die Server-Sicherheit etwas beeinträchtigen, da jeder Benutzer auf AUTH_SYS-Einhängepunkten bei NFS-Anfragen jetzt vorgeben kann, ein beliebiger anderer zu sein. Daher unterstützen NFS-Server dies standardmäßig nicht. Normalerweise erlauben sie dies über eine explizite Export-Option.

source: To retain good security while allowing as many mount points as possible, it is best to allow non-privileged client connections only if the server and client both require strong authentication, such as Kerberos.
de: Um gute Sicherheit zu wahren und gleichzeitig so viele Einhängepunkte wie möglich zu erlauben, ist es am besten, nichtprivilegierte Ports nur zu erlauben, falls der Server und der Client beide eine starke Authentifizierung wie Kerberos verlangen.

source: Mounting through a firewall
de: Einhängen durch eine Firewall

source: A firewall may reside between an NFS client and server, or the client or server may block some of its own ports via IP filter rules. It is still possible to mount an NFS server through a firewall, though some of the B<mount>(8) command's automatic service endpoint discovery mechanisms may not work; this requires you to provide specific endpoint details via NFS mount options.
de: Eine Firewall könnte zwischen einem NFS-Client und -Server liegen, oder der Client oder der Server könnte einige seiner eigenen Ports über IP-Filterregeln blockieren. Es ist weiterhin möglich, einen NFS-Server durch eine Firewall einzuhängen, allerdings könnten einige der automatischen Serverendpunktentdeckungsmechanismen des Befehls B<mount>(8) nicht funktionieren. Daher müssen Sie dann spezifische Endpunktdetails über NFS-Einhängeoptionen bereitstellen.

source: NFS servers normally run a portmapper or rpcbind daemon to advertise their service endpoints to clients. Clients use the rpcbind daemon to determine:
de: NFS-Server betreiben normalerweise einen Portmapper oder einen Rpcbind-Daemon, um ihre Diensteendpunkte den Clients bekanntzugeben. Clients verwenden den Rpcbind-Daemon, um zu ermitteln:

source: What network port each RPC-based service is using
de: Welchen Netzwerk-Port jeder RPC-basierte Dienst verwendet

source: What transport protocols each RPC-based service supports
de: Welches Transportprotokoll jeder RPC-basierte Dienst unterstützt

source: The rpcbind daemon uses a well-known port number (111) to help clients find a service endpoint. Although NFS often uses a standard port number (2049), auxiliary services such as the NLM service can choose any unused port number at random.
de: Der Rpcbind-Daemon verwendet eine gut bekannte Port-Nummer (111), damit Clients einen Diensteendpunkt finden. Obwohl NFS oft eine Standard-Port-Nummer (2049) verwendet, können Hilfsdienste wie der NLM-Dienst jede unbenutzte Port-Nummer zufällig auswählen.

source: Common firewall configurations block the well-known rpcbind port. In the absense of an rpcbind service, the server administrator fixes the port number of NFS-related services so that the firewall can allow access to specific NFS service ports. Client administrators then specify the port number for the mountd service via the B<mount>(8) command's B<mountport> option. It may also be necessary to enforce the use of TCP or UDP if the firewall blocks one of those transports.
de: Typische Firewall-Konfigurationen blockieren den gut bekannten Rpcbind-Port. Ohne den Rpcbind-Dienst kann der Administrator die Port-Nummer von Diensten mit Bezug zu NFS festlegen, so dass die Firewall Zugriff auf bestimmte NFS-Dienste-Ports erlauben kann. Client-Administratoren legen dann die Port-Nummer für den Mountd-Dienst mittels der Option B<mountport> des Befehls B<mount>(8) fest. Es kann auch notwendig sein, die Verwendung von TCP oder UDP zu erzwingen, falls die Firewall einen dieser Transporte blockiert.

source: NFS Access Control Lists
de: NFS-Zugriffssteuerlisten

source: Solaris allows NFS version 3 clients direct access to POSIX Access Control Lists stored in its local file systems. This proprietary sideband protocol, known as NFSACL, provides richer access control than mode bits. Linux implements this protocol for compatibility with the Solaris NFS implementation. The NFSACL protocol never became a standard part of the NFS version 3 specification, however.
de: Solaris erlaubt NFS-Version-3-Clients direkten Zugriff auf die auf seinen lokalen Dateisystemen gespeicherten POSIX-Zugriffsteuerlisten. Dieses proprietäre Seitenbandprotokoll namens NFSACL stellt eine umfassendere Zugriffssteuerung als die Modusbits bereit. Linux implementiert dieses Protokoll zur Kompatibilität mit der Solaris-NFS-Implementierung. Das NFSACL-Protokoll wurde allerdings niemals ein Standardteil der NFS-Version-3-Spezifikation.

source: The NFS version 4 specification mandates a new version of Access Control Lists that are semantically richer than POSIX ACLs. NFS version 4 ACLs are not fully compatible with POSIX ACLs; as such, some translation between the two is required in an environment that mixes POSIX ACLs and NFS version 4.
de: Die NFS-Version-4-Spezifikation verlangt eine neue Version der Zugriffssteuerlisten, die semantisch reicher als POSIX ACLs ist. NFS-Version-4-ACLs sind mit den POSIX ACLs nicht voll kompatibel, daher ist eine Übersetzung zwischen den beiden in Umgebungen, die POSIX ACLs und NFS Version 4 vermischen, notwendig.

source: THE REMOUNT OPTION
de: DIE OPTION REMOUNT

source: Generic mount options such as B<rw> and B<sync> can be modified on NFS mount points using the B<remount> option. See B<mount>(8) for more information on generic mount options.
de: Generische Einhängeoptionen wie B<rw> und B<sync> können bei NFS-Einhängepunkten mit der Option B<remount> geändert werden. Siehe B<mount>(8) für weitere Informationen über generische Einhängeoptionen.

source: With few exceptions, NFS-specific options are not able to be modified during a remount. The underlying transport or NFS version cannot be changed by a remount, for example.
de: Bis auf wenige Ausnahmen können NFS-spezifische Optionen nicht bei einer Neueinhängung geändert werden. Beispielsweise kann der unterliegende Transport oder die NFS-Version durch eine Neueinhängung nicht geändert werden.

source: Performing a remount on an NFS file system mounted with the B<noac> option may have unintended consequences. The B<noac> option is a combination of the generic option B<sync>, and the NFS-specific option B<actimeo=0>.
de: Das Neueinhängen auf einem NFS-Dateisystem, das mit der Option B<noac> eingehängt ist, kann unbeabsichtigte Konsequenzen haben. Die Option B<noac> stellt eine Kombination der generischen Option B<sync> und der NFS-spezifischen Option B<actimeo=0> dar.

source: Unmounting after a remount
de: Aushängen nach einem erneuten Einhängen

source: For mount points that use NFS versions 2 or 3, the NFS umount subcommand depends on knowing the original set of mount options used to perform the MNT operation. These options are stored on disk by the NFS mount subcommand, and can be erased by a remount.
de: Für Einhängepunkte, die NFS Version 2 oder 3 verwenden, hängt der NFS-Unterbefehl umount davon ab, die ursprüngliche Menge der Einhängeoptionen zu kennen, die zur Ausführung der MNT-Aktion verwandt wurden. Diese Optionen werden durch den NFS-Unterbefehl mount auf Platte gespeichert und können durch erneutes Einhängen gelöscht werden.

source: To ensure that the saved mount options are not erased during a remount, specify either the local mount directory, or the server hostname and export pathname, but not both, during a remount. For example,
de: Um sicherzustellen, dass die gespeicherten Einhängeoptionen während eines erneuten Einhängens nicht gelöscht werden, geben Sie während eines erneuten Einhängens entweder das lokale Einhängeverzeichnis oder den Rechnernamen und den Exportpfadnamen, aber nicht beide, an. Beispielsweise fügt

source: merges the mount option B<ro> with the mount options already saved on disk for the NFS server mounted at /mnt.
de: die Einhängeoption B<ro> mit den bereits auf Platte gespeicherten, für den unter /mnt eingehängten NFS-Server zusammen.

source: FILES
de: DATEIEN

source: file system table
de: Dateisystemtabelle

source: Configuration file for NFS mounts
de: Konfigurationsdatei für NFS-Einhängungen

source: NOTES
de: ANMERKUNGEN

source: Before 2.4.7, the Linux NFS client did not support NFS over TCP.
de: Vor Version 2.4.7 unterstützte der Linux-NFS-Client NFS über TCP nicht.

source: Before 2.4.20, the Linux NFS client used a heuristic to determine whether cached file data was still valid rather than using the standard close-to-open cache coherency method described above.
de: Vor Linux 2.4.20 verwendete der Linux-NFS-Client eine Heuristik, um zu bestimmen, ob zwischengespeicherte Dateidaten noch gültig waren, statt die oben beschriebene, standardisierte »close-to-open«-Zwischenspeicherkohärenzsemantik zu verwenden.

source: Starting with 2.4.22, the Linux NFS client employs a Van Jacobsen-based RTT estimator to determine retransmit timeout values when using NFS over UDP.
de: Beginnend mit 2.4.22 setzt der Linux-NFS-Client einen Van-Jacobsen-basierten RTT-Abschätzer ein, um die Neuübertragungs-Zeitüberschreitungen zu bestimmen, wenn NFS über UDP verwandt wird.

source: Before 2.6.0, the Linux NFS client did not support NFS version 4.
de: Vor Version 2.6.0 unterstützte der Linux-NFS-Client die NFS-Version 4 nicht.

source: Before 2.6.8, the Linux NFS client used only synchronous reads and writes when the B<rsize> and B<wsize> settings were smaller than the system's page size.
de: Vor 2.6.8 verwendete der Linux NFS-Client nur synchrone Lese- und Schreibzugriffe, wenn die Einstellungen für B<rsize> und B<wsize> kleiner als die Seitengröße des Systems waren.

source: The Linux client's support for protocol versions depend on whether the kernel was built with options CONFIG_NFS_V2, CONFIG_NFS_V3, CONFIG_NFS_V4, CONFIG_NFS_V4_1, and CONFIG_NFS_V4_2.
de: Die Unterstützungen für Protokollversionen des Linux-Clients hängen davon ab, ob der Kernel mit den Optionen CONFIG_NFS_V2, CONFIG_NFS_V3, CONFIG_NFS_V4, CONFIG_NFS_V4_1 und CONFIG_NFS_V4_2 gebaut wurde.

source: SEE ALSO
de: SIEHE AUCH

source: RFC 768 for the UDP specification.
de: RFC 768 für die UDP-Spezifikation

source: RFC 793 for the TCP specification.
de: RFC 793 für die TCP-Spezifikation

source: RFC 1813 for the NFS version 3 specification.
de: RFC 1813 für die NFS-Version-3-Spezifikation

source: RFC 1832 for the XDR specification.
de: RFC 1832 für die XDR-Spezifikation

source: RFC 1833 for the RPC bind specification.
de: RFC 1833 für die RPC-Bind-Spezifikation

source: RFC 2203 for the RPCSEC GSS API protocol specification.
de: RFC 2203 für die RPCSEC-GSS-API-Protokoll-Spezifikation

source: RFC 7530 for the NFS version 4.0 specification.
de: RFC 7530 für die NFS-version-4.0-Spezifikation

source: RFC 5661 for the NFS version 4.1 specification.
de: RFC 5661 für die Spezifikation der NFS-Version 4.1.

source: RFC 7862 for the NFS version 4.2 specification.
de: RFC 7862 für die NFS-Version-4.2-Spezifikation

source: NFS is an Internet Standard protocol created by Sun Microsystems in 1984. NFS was developed to allow file sharing between systems residing on a local area network. The Linux NFS client supports three versions of the NFS protocol: NFS version 2 [RFC1094], NFS version 3 [RFC1813], and NFS version 4 [RFC3530].
de: NFS ist ein von Sun Microsystems 1984 entwickeltes Internet Standardprotokoll. Es wurde zum Dateiaustausch zwischen Systemen im lokalen Netz entwickelt. Der Linux-NFS-Client unterstützt drei Versionen des NFS-Protokolls: NFS-Version 2 [RFC1094], NFS Version 3 [RFC1813] und NFS Version 4 [RFC3530].

source: The NFS protocol version number used to contact the server's NFS service. If the server does not support the requested version, the mount request fails. If this option is not specified, the client negotiates a suitable version with the server, trying version 4 first, version 3 second, and version 2 last.
de: Die NFS-Protokollnummer, die für den Kontakt zum NFS-Dienst des Servers verwandt wird. Falls der Server die angefragte Version nicht unterstützt, schlägt die Einhängeanfrage fehl. Falls diese Option nicht angegeben ist, handelt der Client eine geeignete Version mit dem Server aus, wobei er zuerst Version 4, dann Version 3 und zum Schluss Version 2 versucht.

source: Enable/Disables the cache of (read-only) data pages to the local disk using the FS-Cache facility. See cachefilesd(8) and E<lt>kernel_soruceE<gt>/Documentation/filesystems/caching for detail on how to configure the FS-Cache facility. Default value is nofsc.
de: aktiviert/deaktiviert das Zwischenspeichern von (nur lesbaren) Datenseiten auf der lokalen Platte mittels der FS-Cache-Einrichtung. Siehe cachefilesd(8) und E<lt>kernel_soruceE<gt>/Documentation/filesystems/caching für Details zur Einrichtung der FS-Cache-Einrichtung. Die Vorgabe ist nofsc.

source: The I<netid> determines the transport that is used to communicate with the NFS server. Available options are B<udp>, B<udp6>, B<tcp>, B<tcp6>, and B<rdma>. Those which end in B<6> use IPv6 addresses and are only available if support for TI-RPC is built in. Others use IPv4 addresses.
de: Die I<NetID> bestimmt den Transport, der zur Kommunikation mit dem NFS-Server verwandt wird. Verfügbare Optionen sind B<udp>, B<udp6>, B<tcp>, B<tcp6> und B<rdma>. Die in B<6> endenden verwenden IPv6-Adressen und sind nur bei eingebauter Unterstützung für TI-RPC verfügbar. Die anderen verwenden IPv4-Adressen.

source: Use these options, along with the options in the first subsection above, for NFS version 4 and newer.
de: Verwenden Sie diese Optionen zusammen mit den Optionen in dem obigen Unterabschnitt für NFS-Version 4 oder neuer.

source: The I<netid> determines the transport that is used to communicate with the NFS server. Supported options are B<tcp>, B<tcp6>, and B<rdma>. B<tcp6> use IPv6 addresses and is only available if support for TI-RPC is built in. Both others use IPv4 addresses.
de: I<netid> bestimmt den Transport, der für die Kommunikation mit dem NFS-Server verwandt wird. Unterstützte Optionen sind B<tcp>, B<tcp6> und B<rdma>. B<tcp6> verwendet IPv6-Adressen und ist nur verfügbar, falls Unterstützung für TI-RPC eingebaut ist. Die beiden anderen verwenden IPv4-Adressen.

source: Specifies a single IPv4 address (in dotted-quad form), or a non-link-local IPv6 address, that the NFS client advertises to allow servers to perform NFS version 4 callback requests against files on this mount point. If the server is unable to establish callback connections to clients, performance may degrade, or accesses to files may temporarily hang.
de: Gibt eine einzelne IPv4-Adresse (in Dreipunktschreibweise) oder eine Nicht-Link-Local-IPv6-Adresse, die der NFS-Client bekanntgibt, um Servern zu erlauben, NFS-Version-4-Rückrufanfrage für Dateien auf diesem Einhängepunkt durchzuführen, an. Falls der Server keine Rückrufverbindungen zu Clients aufbauen kann, kann sich die Leistung verringern oder Dateizugriffe können zeitweise hängen.
