Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: To mount an export using NFS version 2, use the B<nfs> file system type and specify the B<nfsvers=2> mount option. To mount using NFS version 3, use the B<nfs> file system type and specify the B<nfsvers=3> mount option. To mount using NFS version 4, use either the B<nfs> file system type, with the B<nfsvers=4> mount option, or the B<nfs4> file system type.
de: Um einen Export mit NFS-Version 2 einzuhängen, verwenden Sie den B<nfs>-Dateisystemtyp und geben Sie die Einhängeoption B<nfsvers=2> an. Um mit NFS-Version 3 einzuhängen, verwenden Sie den B<nfs>-Dateisystemtyp und geben Sie die Einhängeoption B<nfsvers=3> an. Um mit NFS-Version 4 einzuhängen, verwenden Sie entweder den B<nfs>-Dateisystemtyp mit der Einhängeoption B<nfsvers=4> oder den Dateisystemtyp B<nfs4>.

source: Here is an example from an /etc/fstab file for an NFS version 2 mount over UDP.
de: Ein Beispiel für eine Datei »/etc/fstab« für eine NFS-Version-2-Einhängung über UDP:

source: This section applies only to NFS version 2 and version 3 mounts since NFS version 4 does not use a separate protocol for mount requests.
de: Dieser Abschnitt betrifft nur NFS-Version-2- und -Version-3-Einhängungen, da NFS Version 4 kein separates Protokoll für Einhängeanfragen verwendet.

source: File timestamp maintainence
de: Dateizeitstempelverwaltung

source: The Network Lock Manager protocol is a separate sideband protocol used to manage file locks in NFS version 2 and version 3. To support lock recovery after a client or server reboot, a second sideband protocol -- known as the Network Status Manager protocol -- is also required. In NFS version 4, file locking is supported directly in the main NFS protocol, and the NLM and NSM sideband protocols are not used.
de: Das Protokoll »Network Lock Manager« ist ein separates Seitenbandprotokoll, das zur Verwaltung von Dateisperren in NFS-Version 2 und 3 verwandt wird. Um das Wiederherstellen von Sperren nach einem Systemneustart eines Clients oder Servers zu unterstützen, ist ein zweites Seitenbandprotokoll – bekannt als »Network Status Manager«-Protokoll – notwendig. In NFS Version 4 wird das Sperren direkt im Haupt-NFS-Protokoll unterstützt und die NLM- und NSM-Seitenbandprotokolle werden nicht verwandt.

source: In NFS version 4, a lease is a period of time during which a server irrevocably grants a file lock to a client. If the lease expires, the server is allowed to revoke that lock. Clients periodically renew their leases to prevent lock revocation.
de: In NFS Version 4 ist eine Ausleihe (»lease«) eine Zeitperiode, in der der Server dem Client unumkehrbar eine Dateisperre gewährt. Falls die Ausleihe ausläuft, darf der Server die Sperre zurückziehen. Clients erneuern ihre Ausleihe periodisch, um die Zurückziehung von Sperren zu vermeiden.

source: After an NFS version 4 server reboots, each client tells the server about all file open and lock state under its lease before operation can continue. If the client reboots, the server frees all open and lock state associated with that client's lease.
de: Nachdem ein NFS-Version-4-Server neustartet, teilt jeder Client dem Server mit, welche Dateien offen sind und welchen Sperrzustand unter seiner Ausleihe vorliegt, bevor die Arbeit fortgefahren werden kann. Falls der Client neu startet, löst der Server alle offenen und Sperrzustände, die mit der Ausleihe des Clients verbunden sind.

source: As part of establishing a lease, therefore, a client must identify itself to a server. A fixed string is used to distinguish that client from others, and a changeable verifier is used to indicate when the client has rebooted.
de: Während der Etablierung einer Ausleihe muss der Client sich daher gegenüber dem Server identifizieren. Um den Client von anderen zu unterscheiden, wird eine feste Zeichenkette verwandt und ein änderbarer Überprüfer zeigt an, wenn ein Client neu gestartet wurde.

source: A client uses a particular security flavor and principal when performing the operations to establish a lease. If two clients happen to present the same identity string, a server can use their principals to detect that they are different clients, and prevent one client from interfering with the other's lease.
de: Ein Client verwendet eine bestimmte Sicherheitsvariante und -Principal, wenn er Aktionen zum Aufbau der Ausleihe durchführt. Falls es passiert, dass zwei Clients die gleiche Identifizierungszeichenkette vorweisen, kann ein Server ihre Principials verwenden, um zu erkennen, dass dies verschiedene Clients sind und verhindern, dass ein Client der Ausleihe des anderen Clients in die Quere kommt.

source: The Linux NFS client establishes one lease for each server. Lease management operations, such as lease renewal, are not done on behalf of a particular file, lock, user, or mount point, but on behalf of the whole client that owns that lease. These operations must use the same security flavor and principal that was used when the lease was established, even across client reboots.
de: Der Linux-NFS-Client etabliert eine Ausleihe für jeden Server. Ausleih-Verwaltungsaktionen, wie Ausleih-Erneuerung, werden nicht im Auftrag einer bestimmten Datei, Sperre, eines bestimmten Benutzers oder Einhängepunkts durchgeführt, sondern für den gesamten Client, dem die Ausleihe gehört. Diese Aktionen müssen die gleiche Sicherheitsvariante und -Principial verwenden, die zum Aufbau der Ausleihe verwandt wurden, selbst nach Neustarts von Clients.

source: When Kerberos is configured on a Linux NFS client (i.e., there is a I</etc/krb5.keytab> on that client), the client attempts to use a Kerberos security flavor for its lease management operations. This provides strong authentication of the client to each server it contacts. By default, the client uses the I<host/> or I<nfs/> service principal in its I</etc/krb5.keytab> for this purpose.
de: Wenn auf einem Linux-NFS-Client Kerberos konfiguriert ist (d.h. es eine I</etc/krb5.keytab> auf diesem Client gibt), versucht der Client, eine Kerberos-Sicherheitsvariante für seine Ausleih-Verwaltungsaktionen zu verwenden. Dies bietet starke Authentifizierung des Clients zu jedem Server, den er kontaktiert. Standardmäßig verwendet der Client für diesen Zweck die Dienst-Principials I<host/> oder I<nfs/> in seiner I</etc/krb5.keytab>.

source: BUGS
de: FEHLER

source: The Linux NFS client does not yet support certain optional features of the NFS version 4 protocol, such as security negotiation, server referrals, and named attributes.
de: Der Linux-NFS-Client unterstützt bestimmte optionale Funktionalitäten des NFS-Version-4-Protokolls, wie Sicherheitsaushandlungen, Server-Überweisungen und benannte Attribute, noch nicht.

source: RFC 1094 for the NFS version 2 specification.
de: RFC 1094 für die NFS-Version-2-Spezifikation

source: RFC 3530 for the NFS version 4 specification.
de: RFC 3530 für die NFS-Version-4-Spezifikation
