Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: 9 October 2012
de: 9 Oktober 2012

source: NAME
de: BEZEICHNUNG

source: nfs - fstab format and options for the B<nfs> file systems
de: nfs - Format und Optionen in der fstab-Datei für das B<nfs>-Dateisystem

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: NFS is an Internet Standard protocol created by Sun Microsystems in 1984. NFS was developed to allow file sharing between systems residing on a local area network. Depending on kernel configuration, the Linux NFS client may support NFS versions 3, 4.0, 4.1, or 4.2.
de: NFS ist ein von Sun Microsystems 1984 entwickeltes Internet Standardprotokoll. Es wurde zur gemeinsamen Dateibenutzung auf Systemen im lokalen Netz entwickelt. Abhängig von der Kernelkonfiguration kann der Linux-NFS-Client die NFS-Versionen 3, 4.0, 4.1 oder 4.2 unterstützen.

source: The B<mount>(8) command attaches a file system to the system's name space hierarchy at a given mount point. The I</etc/fstab> file describes how B<mount>(8) should assemble a system's file name hierarchy from various independent file systems (including file systems exported by NFS servers). Each line in the I</etc/fstab> file describes a single file system, its mount point, and a set of default mount options for that mount point.
de: Der Befehl B<mount>(8) fügt ein Dateisystem an einem angegebenen Einhängepunkt zu der Namensraumhierarchie des Systems hinzu. Die Datei I</etc/fstab> beschreibt, wie B<mount>(8) die Dateinamenshierarchie des Systems aus verschiedenen unabhängigen Dateisystemen (darunter von NFS-Servern exportierten) zusammenbauen soll. Jede Zeile in der Datei I</etc/fstab> beschreibt ein einzelnes Dateisystem, seinen Einhängepunkt und eine Menge an Standardeinhängeoptionen für diesen Einhängepunkt.

source: For NFS file system mounts, a line in the I</etc/fstab> file specifies the server name, the path name of the exported server directory to mount, the local directory that is the mount point, the type of file system that is being mounted, and a list of mount options that control the way the filesystem is mounted and how the NFS client behaves when accessing files on this mount point. The fifth and sixth fields on each line are not used by NFS, thus conventionally each contain the digit zero. For example:
de: Für NFS-Dateisystemeinhängungen gibt eine Zeile in der Datei I</etc/fstab> folgende Informationen an: den Servernamen, den Pfadnamen des exportierten und einzuhängenden Server-Verzeichnisses, das als Einhängepunkt dienende lokale Verzeichnis und eine Liste von Einhängeoptionen, die die Art des Einhängens und die Reaktion des NFS-Clients beim Zugriff auf Dateien unterhalb dieses Einhängepunktes steuern. Das fünfte und sechste Feld auf jeder Zeile wird von NFS nicht verwandt und enthält per Konvention jeweils die Ziffer Null. Beispiel:

source: server:path /mountpoint fstype option,option,... 0 0
de: Server:Pfad /Einhängepunkt Fstype Option,Option,…t0 0

source: The server's hostname and export pathname are separated by a colon, while the mount options are separated by commas. The remaining fields are separated by blanks or tabs.
de: Der Rechnername und die exportierten Pfadnamen werden durch einen Doppelpunkt getrennt, während die Einhängeoptionen durch Kommata getrennt werden. Die verbleibenden Felder werden durch Leerzeichen oder Tabulatoren getrennt.

source: The server's hostname can be an unqualified hostname, a fully qualified domain name, a dotted quad IPv4 address, or an IPv6 address enclosed in square brackets. Link-local and site-local IPv6 addresses must be accompanied by an interface identifier. See B<ipv6>(7) for details on specifying raw IPv6 addresses.
de: Der Rechnername des Servers kann unqualifiziert, ein voll qualifizierter Domain-Name, eine mit Punkten versehene, vierteilige IPv4-Adresse oder eine in eckige Klammern eingeschlossene IPv6-Adresse sein. Link-local- und Site-local-IPv6-Adressen müssen von einem Schnittstellenidentifikator begleitet werden. Siehe B<ipv6>(7) für Details zur Angabe von rohen IPv6-Adressen.

source: The I<fstype> field contains "nfs". Use of the "nfs4" fstype in I</etc/fstab> is deprecated.
de: Das Feld I<fstype> enthält »nfs«. Die Verwendung des Dateityps »nfs4« in I</etc/fstab> wird missbilligt.

source: MOUNT OPTIONS
de: EINHÄNGEOPTIONEN

source: Refer to B<mount>(8) for a description of generic mount options available for all file systems. If you do not need to specify any mount options, use the generic option B<defaults> in I</etc/fstab>.
de: Schauen Sie in B<mount>(8) für eine Beschreibung der generischen Einhängeoptionen, die für alle Dateisysteme verfügbar sind. Falls Sie keine Einhängeoption angeben müssen, verwenden Sie die generische Option B<defaults> in I</etc/fstab>.

source: Options supported by all versions
de: Optionen, die von allen Versionen unterstützt werden

source: These options are valid to use with any NFS version.
de: Diese Optionen sind für die Verwendung mit allen NFS-Versionen gültig.

source: The NFS protocol version number used to contact the server's NFS service. If the server does not support the requested version, the mount request fails. If this option is not specified, the client tries version 4.2 first, then negotiates down until it finds a version supported by the server.
de: Die NFS-Protokollnummer, die für den Kontakt zum NFS-Dienst des Servers verwandt wird. Falls der Server die angefragte Version nicht unterstützt, schlägt die Einhängeanfrage fehl. Falls diese Option nicht angegeben ist, versucht der Client 4.2 zuerst, handelt sich dann runter, bis er eine vom Server unterstützte Version findet.

source: This option is an alternative to the B<nfsvers> option. It is included for compatibility with other operating systems
de: Diese Option ist eine Alternative zu der Option B<nfsvers>. Sie ist für die Kompatibilität zu anderen Betriebssystemen enthalten.

source: Determines the recovery behavior of the NFS client after an NFS request times out. If neither option is specified (or if the B<hard> option is specified), NFS requests are retried indefinitely. If the B<soft> option is specified, then the NFS client fails an NFS request after B<retrans> retransmissions have been sent, causing the NFS client to return an error to the calling application.
de: Bestimmt das Wiederherstellungsverhalten des NFS-Clients nachdem es zu einer Zeitüberschreitung für eine NFS-Anfrage kam. Falls keine der Optionen angegeben ist (oder falls die Option B<hard> angegeben ist), werden NFS-Anfragen unendlich oft erneut versucht. Falls die Option B<soft> angegeben ist, lässt der NFS-Client eine NFS-Anfrage nach B<retrans> Übertragungsversuchen fehlschlagen. Dadurch liefert der NFS-Client einen Fehler an die aufrufende Anwendung zurück.

source: I<NB:> A so-called "soft" timeout can cause silent data corruption in certain cases. As such, use the B<soft> option only when client responsiveness is more important than data integrity. Using NFS over TCP or increasing the value of the B<retrans> option may mitigate some of the risks of using the B<soft> option.
de: I<Nebenbemerkung>: Eine sogenannte »weiche« Zeitüberschreitung kann in bestimmten Fällen zu stiller Datenverfälschung führen. Verwenden Sie daher die Option B<soft> nur, wenn die Reaktionsfähigkeit des Clients wichtiger als die Datenintegrität ist. Die Verwendung von NFS über TCP oder die Erhöhung des Wertes der Option B<retrans> kann einige der Risiken des Einsatzes der Option B<soft> verringern.

source: In cases where the NFS server is down, it may be useful to allow the NFS client to continue to serve up paths and attributes from cache after B<retrans> attempts to revalidate that cache have timed out. This may, for instance, be helpful when trying to unmount a filesystem tree from a server that is permanently down.
de: Falls der NFS-Server nicht verfügbar ist, könnte es nützlich sein, dass NFS-Clients Pfade und Attribute weiterhin aus dem Zwischenspeicher bereitstellen, nachdem B<retrans> Versuche, den Zwischenspeicher erneut zu bestätigen, wegen Zeitüberschreitungen fehlschlugen. Dies könnte beispielsweise hilfreich sein, wenn versucht wird, einen Dateisystembaum von einem Server, der permanent nicht verfügbar ist, auszuhängen.

source: It is possible to combine B<softreval> with the B<soft> mount option, in which case operations that cannot be served up from cache will time out and return an error after B<retrans> attempts. The combination with the default B<hard> mount option implies those uncached operations will continue to retry until a response is received from the server.
de: Es ist möglich, B<softreval> mit der Einhängeoption B<soft> zu kombinieren. In diesem Fall erfolgt eine Zeitüberschreitung für Aktionen, die nicht aus dem Zwischenspeicher bedient werden können, sowie ein Fehler nach B<retrans> Versuchen. Die Kombination mit der Vorgabeeinhängeoption B<hard> impliziert, dass Aktionen, die nicht im Zwischenspeicher liegen, zu Wiederholungen führen, bis vom Server eine Antwort erhalten wird.

source: Note: the default mount option is B<nosoftreval> which disallows fallback to cache when revalidation fails, and instead follows the behavior dictated by the B<hard> or B<soft> mount option.
de: Hinweis: Die Vorgabeeinhängeoption ist B<nosoftreval>. Diese erlaubt keinen Rückgriff auf den Zwischenspeicher, wenn die Neubestätigung fehlschlägt, sondern folgt stattdessen dem durch die Einhängeoptionen B<hard> oder B<soft> vorgegebenen Verhalten.

source: This option is provided for backward compatibility. It is ignored after kernel 2.6.25.
de: Diese Aktion wird für Rückwärtskompatibilität bereitgestellt. Sie wird nach Kernel 2.6.25 ignoriert.

source: The time in deciseconds (tenths of a second) the NFS client waits for a response before it retries an NFS request.
de: Die Zeit in Zehntelsekunden, die der NFS-Client auf eine Antwort wartet, bevor er eine NFS-Anfrage erneut versucht.

source: For NFS over TCP the default B<timeo> value is 600 (60 seconds). The NFS client performs linear backoff: After each retransmission the timeout is increased by B<timeo> up to the maximum of 600 seconds.
de: Für NFS über TCP beträgt der Standardwert für B<timeo> 600 (60 Sekunden). Der NFS-Client führt einen linearen Rückschritt aus: Nach jeder Neuübertragung wird die Zeitüberschreitung um B<timeo> bis zum Maximum von 600 Sekunden erhöht.

source: However, for NFS over UDP, the client uses an adaptive algorithm to estimate an appropriate timeout value for frequently used request types (such as READ and WRITE requests), but uses the B<timeo> setting for infrequently used request types (such as FSINFO requests). If the B<timeo> option is not specified, infrequently used request types are retried after 1.1 seconds. After each retransmission, the NFS client doubles the timeout for that request, up to a maximum timeout length of 60 seconds.
de: Für NFS über UDP verwendet der Client einen adaptiven Algorithmus, um die angemessenen Werte für eine Zeitüberschreitung (Timeput) für häufig verwandte Anfragetypen (wie READ- und WRITE-Anfragen) abzuschätzen, verwendet allerdings die Einstellung B<timeo> für seltenere Anfragetypen (wie FSINFO-Anfragen). Falls die Option B<timeo> nicht angegeben ist, werden solche selten verwandten Anfragetypen nach 1,1 Sekunden erneut versucht. Nach jeder Neuübertragung verdoppelt der NFS-Client die Zeitüberschreitung für diese Anfrage bis zu einem maximalen Wert für die Zeitüberschreitung von 60 Sekunden.

source: The number of times the NFS client retries a request before it attempts further recovery action. If the B<retrans> option is not specified, the NFS client tries each UDP request three times and each TCP request twice.
de: Die Anzahl der Versuche, die der NFS-Client eine Anfrage erneut unternimmt, bevor er weitere Wiederherstellungsmaßnahmen einleitet. Falls die Option B<retrans> nicht angegeben ist, versucht der NFS-Client jede UDF-Anfrage drei Mal und jede TCP-Anfrage zweimal.

source: The NFS client generates a "server not responding" message after B<retrans> retries, then attempts further recovery (depending on whether the B<hard> mount option is in effect).
de: Der NFS-Client erzeugt »server not responding« (Server reagiert nicht) Nachrichten nach B<retrans> Versuchen. Dann versucht er weitere Wiederherstellungen (abhängig davon, ob die Einhängeoption B<hard> in Kraft ist).

source: The maximum number of bytes in each network READ request that the NFS client can receive when reading data from a file on an NFS server. The actual data payload size of each NFS READ request is equal to or smaller than the B<rsize> setting. The largest read payload supported by the Linux NFS client is 1,048,576 bytes (one megabyte).
de: Die maximale Anzahl von Bytes, die der NFS-Client beim Lesen von Daten aus einer Datei auf einem NFS-Server in jeder Netz-READ-Anfrage empfangen kann. Die tatsächliche Datenmenge jeder NFS-READ-Anfrage ist identisch zu oder kleiner als die Einstellung von B<rsize>. Die größte von dem Linux-NFS-Client unterstützte Lese-Datenmenge ist 1.048.576 Bytes (ein Megabyte).

source: The B<rsize> value is a positive integral multiple of 1024. Specified B<rsize> values lower than 1024 are replaced with 4096; values larger than 1048576 are replaced with 1048576. If a specified value is within the supported range but not a multiple of 1024, it is rounded down to the nearest multiple of 1024.
de: Der Wert von B<rsize> ist ein positives, ganzzahliges Vielfaches von 1024. Werte von B<rsize> kleiner als 1024 werden durch 4096 ersetzt; Werte größer als 1048576 durch 1048576. Falls ein angegebener Wert in den unterstützten Bereich fällt, aber kein Vielfaches von 1024 ist, wird er auf das nächste Vielfache von 1024 abgerundet.

source: If an B<rsize> value is not specified, or if the specified B<rsize> value is larger than the maximum that either client or server can support, the client and server negotiate the largest B<rsize> value that they can both support.
de: Falls der Wert B<rsize> nicht angegeben ist oder falls der angegebene Wert für B<rsize> größer als das maximale sowohl vom Server oder vom Client unterstützte ist, handeln der Client und der Server den größten Wert für B<rsize> aus, den beide unterstützen.

source: The B<rsize> mount option as specified on the B<mount>(8) command line appears in the I</etc/mtab> file. However, the effective B<rsize> value negotiated by the client and server is reported in the I</proc/mounts> file.
de: Die Einhängeoption B<rsize> taucht in der Datei I</etc/mtab> so auf, wie sie auf der B<mount>(8)-Befehlszeile angegeben wurde. Der effektive zwischen Server und Client ausgehandelte Wert von B<rsize> wird allerdings in der Datei I</proc/mounts> angezeigt.

source: The maximum number of bytes per network WRITE request that the NFS client can send when writing data to a file on an NFS server. The actual data payload size of each NFS WRITE request is equal to or smaller than the B<wsize> setting. The largest write payload supported by the Linux NFS client is 1,048,576 bytes (one megabyte).
de: Die maximale Anzahl von Bytes, die der NFS-Client beim Schreiben von Daten in eine Datei auf einem NFS-Server in jeder Netz-WRITE-Anfrage senden kann. Die tatsächliche Datenmenge jeder NFS-WRITE-Anfrage ist identisch zu oder kleiner als die Einstellung von B<wsize>. Die größte von dem Linux-NFS-Client unterstützte Schreibe-Datenmenge ist 1.048.576 Bytes (ein Megabyte).

source: Similar to B<rsize> , the B<wsize> value is a positive integral multiple of 1024. Specified B<wsize> values lower than 1024 are replaced with 4096; values larger than 1048576 are replaced with 1048576. If a specified value is within the supported range but not a multiple of 1024, it is rounded down to the nearest multiple of 1024.
de: Ähnlich wie B<rsize> ist der Wert von B<wsize> ein positives, ganzzahliges Vielfaches von 1024. Werte von B<wsize> kleiner als 1024 werden durch 4096 ersetzt; Werte größer als 1048576 durch 1048576. Falls ein angegebener Wert in den unterstützten Bereich fällt, aber kein Vielfaches von 1024 ist, wird er auf das nächste Vielfache von 1024 abgerundet.

source: If a B<wsize> value is not specified, or if the specified B<wsize> value is larger than the maximum that either client or server can support, the client and server negotiate the largest B<wsize> value that they can both support.
de: Falls ein Wert von B<wsize> nicht angegeben ist oder der angegebene Wert von B<wsize> größer als das maximal vom Client oder Server unterstützbare ist, werden der Client und Server den größten Wert von B<wsize> aushandeln, den beide unterstützen können.

source: The B<wsize> mount option as specified on the B<mount>(8) command line appears in the I</etc/mtab> file. However, the effective B<wsize> value negotiated by the client and server is reported in the I</proc/mounts> file.
de: Die Einhängeoption B<wsize> taucht in der Datei I</etc/mtab> so auf, wie sie auf der B<mount>(8)-Befehlszeile angegeben wurde. Der effektive zwischen Server und Client ausgehandelte Wert von B<wsize> wird allerdings in der Datei I</proc/mounts> angezeigt.

source: Selects whether the client may cache file attributes. If neither option is specified (or if B<ac> is specified), the client caches file attributes.
de: Wählt aus, ob der Client Dateiattribute zwischenspeichern darf. Falls keine Option angegeben ist (oder falls B<ac> angegeben ist), speichert der Client Dateiattribute zwischen.

source: To improve performance, NFS clients cache file attributes. Every few seconds, an NFS client checks the server's version of each file's attributes for updates. Changes that occur on the server in those small intervals remain undetected until the client checks the server again. The B<noac> option prevents clients from caching file attributes so that applications can more quickly detect file changes on the server.
de: Um die Leistung zu erhöhen, speichern NFS-Clients Dateiattribute zwischen. Alle paar Sekunden prüft ein NFS-Client die Version des Servers von jedem Dateiattribut auf Aktualisierungen. Änderungen, die auf dem Server innerhalb dieser kurzen Intervalle passieren, bleiben unerkannt, bis der Server durch den Client erneut geprüft wird. Die Option B<noac> verhindert, dass Clients Dateiattribute zwischenspeichern, so dass Anwendungen schneller Dateiänderungen auf dem Server erkennen können.

source: In addition to preventing the client from caching file attributes, the B<noac> option forces application writes to become synchronous so that local changes to a file become visible on the server immediately. That way, other clients can quickly detect recent writes when they check the file's attributes.
de: Zusätzlich zur Verhinderung des Zwischenspeicherns von Dateiattributen durch den Client zwingt die Option B<noac> Anwendungen dazu, Schreibvorgänge synchron durchzuführen, so dass lokale Änderungen an einer Datei auf dem Server sofort sichtbar werden. Damit können andere Clients schnell neue Schreibvorgänge erkennen, wenn sie die Dateiattribute überprüfen.

source: Using the B<noac> option provides greater cache coherence among NFS clients accessing the same files, but it extracts a significant performance penalty. As such, judicious use of file locking is encouraged instead. The DATA AND METADATA COHERENCE section contains a detailed discussion of these trade-offs.
de: Die Verwendung der Option B<noac> stellt größere Kohärenz der Zwischenspeicher unter NFS-Clients, die auf die gleiche Datei zugreifen, sicher, führt aber zu einem großen Leistungseinbruch. Stattdessen wird eine gezieltere Verwendung von Dateisperren empfohlen. Der Abschnitt DATEN- UND METADATENKOHÄRENZ enthält eine detaillierte Diskussion dieses Zielkonflikts.

source: The minimum time (in seconds) that the NFS client caches attributes of a regular file before it requests fresh attribute information from a server. If this option is not specified, the NFS client uses a 3-second minimum. See the DATA AND METADATA COHERENCE section for a full discussion of attribute caching.
de: Die minimale Zeit in Sekunden, die Attribute einer regulären Datei vom NFS-Client zwischengespeichert, bevor frische Informationen vom Server angefordert werden sollen. Falls diese Option nicht angegeben ist, verwendet der NFS-Client ein Minimum von 3 Sekunden. Siehe den Abschnitt DATEN- UND METADATENKOHÄRENZ für eine komplette Besprechung des Zwischenspeicherns von Attributen.

source: The maximum time (in seconds) that the NFS client caches attributes of a regular file before it requests fresh attribute information from a server. If this option is not specified, the NFS client uses a 60-second maximum. See the DATA AND METADATA COHERENCE section for a full discussion of attribute caching.
de: Die maximale Zeit in Sekunden, die Attribute einer regulären Datei vom NFS-Client zwischengespeichert, bevor frische Informationen vom Server angefordert werden sollen. Falls diese Option nicht angegeben ist, verwendet der NFS-Client ein Maximum von 60 Sekunden. Siehe den Abschnitt DATEN- UND METADATENKOHÄRENZ für eine komplette Besprechung des Zwischenspeicherns von Attributen.

source: The minimum time (in seconds) that the NFS client caches attributes of a directory before it requests fresh attribute information from a server. If this option is not specified, the NFS client uses a 30-second minimum. See the DATA AND METADATA COHERENCE section for a full discussion of attribute caching.
de: Die minimale Zeit in Sekunden, die Attribute eines Verzeichnisses vom NFS-Client zwischengespeichert, bevor frische Informationen vom Server angefordert werden sollen. Falls diese Option nicht angegeben ist, verwendet der NFS-Client ein Minimum von 30 Sekunden. Siehe den Abschnitt DATEN- UND METADATENKOHÄRENZ für eine komplette Besprechung des Zwischenspeicherns von Attributen.

source: The maximum time (in seconds) that the NFS client caches attributes of a directory before it requests fresh attribute information from a server. If this option is not specified, the NFS client uses a 60-second maximum. See the DATA AND METADATA COHERENCE section for a full discussion of attribute caching.
de: Die maximale Zeit in Sekunden, die Attribute eines Verzeichnisses vom NFS-Client zwischengespeichert, bevor frische Informationen vom Server angefordert werden sollen. Falls diese Option nicht angegeben ist, verwendet der NFS-Client ein Maximum von 60 Sekunden. Siehe den Abschnitt DATEN- UND METADATENKOHÄRENZ für eine komplette Besprechung des Zwischenspeicherns von Attributen.

source: Using B<actimeo> sets all of B<acregmin>, B<acregmax>, B<acdirmin>, and B<acdirmax> to the same value. If this option is not specified, the NFS client uses the defaults for each of these options listed above.
de: Die Angabe von B<actimeo> setzt die Größen B<acregmin>, B<acregmax>, B<acdirmin> und B<acdirmax> auf den gleichen Wert. Falls diese Option nicht angegeben ist verwendet der NFS-Client die oben aufgeführten Vorgaben für jede dieser Optionen.

source: Determines how the B<mount>(8) command behaves if an attempt to mount an export fails. The B<fg> option causes B<mount>(8) to exit with an error status if any part of the mount request times out or fails outright. This is called a "foreground" mount, and is the default behavior if neither the B<fg> nor B<bg> mount option is specified.
de: Bestimmt, wie sich der Befehl B<mount>(8) verhält, falls ein Versuch des Einhängens eines exportierten Verzeichnisses fehlschlägt. Die Option B<fg> führt dazu, dass B<mount>(8) sich mit einem Fehlerstatus beendet, falls irgend ein Teil der Einhängeanfrage in eine Zeitüberschreitung läuft oder fehlschlägt. Dies wird »Vordergrund«-Einhängung genannt und ist das Standardverhalten, falls weder die Einhängeoption B<fg> noch B<bg> angegeben ist.
