Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: Under normal circumstances, networks drop packets much more frequently than NFS servers drop requests. As such, an aggressive retransmit timeout setting for NFS over TCP is unnecessary. Typical timeout settings for NFS over TCP are between one and ten minutes. After the client exhausts its retransmits (the value of the B<retrans> mount option), it assumes a network partition has occurred, and attempts to reconnect to the server on a fresh socket. Since TCP itself makes network data transfer reliable, B<rsize> and B<wsize> can safely be allowed to default to the largest values supported by both client and server, independent of the network's MTU size.
de: Unter normalen Umständen verwirft das Netz viel häufiger Pakete, als dies der NFS-Server tut. Daher ist eine aggressive Zeitüberschreitung für die Wiederübertragung unnötig. Typische Einstellungen für die Zeitüberschreitung für NFS über TCP liegen zwischen einer und zehn Minuten. Nachdem ein Client seine Neuübertragungen (dem Wert der Einhängeoption B<retrans>) ausgeschöpft hat, nimmt er an, dass das Netz in Teile zerfallen ist und versucht, sich auf einem neuen Socket mit dem Server zu verbinden. Da TCP alleine für zuverlässigen Datentransfer sorgt, können B<rsize> und B<wsize> standardmäßig auf die größten Werte erlaubt werden, die vom Client und Server unterstützt werden, unabhängig von der MTU-Größe des Netzes.

source: Using the mountproto mount option
de: Verwendung der Einhängeoption »mountproto«

source: This section applies only to NFS version 3 mounts since NFS version 4 does not use a separate protocol for mount requests.
de: Dieser Abschnitt betrifft nur NFS-Version-3-Einhängungen, da NFS Version 4 kein separates Protokoll für Einhängeanfragen verwendet.

source: The Linux NFS client can use a different transport for contacting an NFS server's rpcbind service, its mountd service, its Network Lock Manager (NLM) service, and its NFS service. The exact transports employed by the Linux NFS client for each mount point depends on the settings of the transport mount options, which include B<proto>, B<mountproto>, B<udp>, and B<tcp>.
de: Der Linux-NFS-Client kann verschiedene Transporte zum Verbindungsaufbau mit einem Rpcbind-Dienst, einem Mountd-Dienst, dem »Network Lock Manager«- (NLM)-Dienst und dem NFS-Dienst des NFS-Servers verwenden. Der genaue durch den Linux-NFS-Client eingesetzte Transport hängt von den Einstellungen der Transporteinhängeoptionen ab, zu denen B<proto>, B<mountproto>, B<udp> und B<tcp> gehören.

source: The client sends Network Status Manager (NSM) notifications via UDP no matter what transport options are specified, but listens for server NSM notifications on both UDP and TCP. The NFS Access Control List (NFSACL) protocol shares the same transport as the main NFS service.
de: Der Client schickt »Network Status Manager (NSM)«-Benachrichtigungen über UDP unabhängig davon, welche Transportoptionen angegeben wurden, wartet aber auf die NSM-Benachrichtigungen des Servers sowohl auf UDP als auch TCP. Das Protokoll »NFS Access Control List (NFSACL)« nutzt den gleichen Transport wie der Haupt-NFS-Dienst.

source: If no transport options are specified, the Linux NFS client uses UDP to contact the server's mountd service, and TCP to contact its NLM and NFS services by default.
de: Falls keine Transportoptionen angegeben wurden, verwendet der Linux-NFS-Client standardmäßig UDP, um den Mountd-Dienst des Servers zu kontaktieren und TCP, um seine NLM- und NFS-Dienste zu kontaktieren.

source: If the server does not support these transports for these services, the B<mount>(8) command attempts to discover what the server supports, and then retries the mount request once using the discovered transports. If the server does not advertise any transport supported by the client or is misconfigured, the mount request fails. If the B<bg> option is in effect, the mount command backgrounds itself and continues to attempt the specified mount request.
de: Falls der Server diese Transporte für diese Dienste nicht unterstützt, versucht der Befehl B<mount>(8) herauszufinden, was der Server unterstützt und versucht dann, die Einhängeanfrage erneut mit den herausgefundenen Transporten. Falls der Server keine vom Client unterstützten Transporte bekanntgibt, schlägt die Einhängeanfrage fehl. Falls die Option B<bg> benutzt wird, bringt sich der Einhängebefehl in den Hintergrund und versucht die angegebene Einhängeanfragen weiter.

source: When the B<proto> option, the B<udp> option, or the B<tcp> option is specified but the B<mountproto> option is not, the specified transport is used to contact both the server's mountd service and for the NLM and NFS services.
de: Wenn die Option B<proto>, die Option B<udp> oder die Option B<tcp> aber nicht die Option B<mountproto> angegeben ist, wird der angegebene Transport sowohl für den Kontakt zum Mountd-Dienst des Servers als auch für die NLM- und NFS-Dienste benutzt.

source: If the B<mountproto> option is specified but none of the B<proto>, B<udp> or B<tcp> options are specified, then the specified transport is used for the initial mountd request, but the mount command attempts to discover what the server supports for the NFS protocol, preferring TCP if both transports are supported.
de: Falls die Option B<mountproto> aber keine der Optionen B<proto>, B<udp> oder B<tcp> angegeben sind, wird der angegebene Transport für die initiale Mountd-Anfrage verwandt, der Befehl mount versucht aber zu ermitteln, was der Server für das NFS-Protokoll unterstützt. Dabei bevorzugt er TCP, falls beide Transporte unterstützt werden.

source: If both the B<mountproto> and B<proto> (or B<udp> or B<tcp>) options are specified, then the transport specified by the B<mountproto> option is used for the initial mountd request, and the transport specified by the B<proto> option (or the B<udp> or B<tcp> options) is used for NFS, no matter what order these options appear. No automatic service discovery is performed if these options are specified.
de: Falls beide Option B<mountproto> und B<proto> (oder B<udp> oder B<tcp>) angegeben sind dann wird der mit der Option B<mountproto> angegebene Transport für die anfängliche Mountd-Anfrage und der mit der Option B<proto> (oder den Optionen B<udp> oder B<tcp>) angegebene Transport für NFS verwandt, unabhängig von der Reihenfolge der Optionen. Falls diese Optionen angegeben sind, erfolgt keine automatische Erkennung der Dienste.

source: If any of the B<proto>, B<udp>, B<tcp>, or B<mountproto> options are specified more than once on the same mount command line, then the value of the rightmost instance of each of these options takes effect.
de: Falls eine der Optionen B<proto>, B<udp>, B<tcp> oder B<mountproto> mehr als einmal auf der gleichen Befehlszeile angegeben werden, dann tritt der Wert, der am weitesten rechts steht, in Kraft.

source: Using NFS over UDP on high-speed links
de: Verwendung von NFS über UDP auf Hochgeschwindigkeitsverbindungen

source: Using NFS over UDP on high-speed links such as Gigabit B<can cause silent data corruption>.
de: Die Verwendung von NFS über UDP auf Hochgeschwindigkeitsverbindungen wie Gigabit B<kann ohne Rückmeldung zu Datenverfälschung führen>.

source: The problem can be triggered at high loads, and is caused by problems in IP fragment reassembly. NFS read and writes typically transmit UDP packets of 4 Kilobytes or more, which have to be broken up into several fragments in order to be sent over the Ethernet link, which limits packets to 1500 bytes by default. This process happens at the IP network layer and is called fragmentation.
de: Das Problem kann durch hohe Lasten ausgelöst werden und wird durch Probleme in dem IP-Fragment-Wiederzusammenbau verursacht. NFS-Lese- und Schreibvorgänge übertragen typischerweise UDP-Pakete von 4 Kilobyte oder mehr, die in mehrere Fragmente zerteilt werden müssen, damit sie über eine Ethernet-Verbindung übertragen werden können, da diese standardmäßig Pakete auf 1500 byte begrenzt. Dieser Prozess passiert in der IP-Netzschicht und wird Fragmentierung genannt.

source: In order to identify fragments that belong together, IP assigns a 16bit I<IP ID> value to each packet; fragments generated from the same UDP packet will have the same IP ID. The receiving system will collect these fragments and combine them to form the original UDP packet. This process is called reassembly. The default timeout for packet reassembly is 30 seconds; if the network stack does not receive all fragments of a given packet within this interval, it assumes the missing fragment(s) got lost and discards those it already received.
de: Um zusammengehörige Fragmente zu identifizieren, weist IP jedem Paket einen 16-bit-I<IP ID>-Wert zu. Fragmente, die vom gleichen UDP-Paket erstellt wurden, werden die gleiche IP-Kennung haben. Das Empfangssystem sammelt dann diese Fragmente und kombiniert sie so, dass daraus das ursprüngliche UDP-Paket entsteht. Dieser Prozess heißt Wiederzusammenbau. Die Standardzeitüberschreitung für den Paketwiederzusammenbau ist 30 Sekunden. Falls der Netzwerkstapel nicht alle Fragmente für ein bestimmtes Paket innerhalb dieses Intervalls erhält, nimmt er an, dass fehlende Fragmente verloren gegangen sind und verwirft die bereits empfangenen.

source: The problem this creates over high-speed links is that it is possible to send more than 65536 packets within 30 seconds. In fact, with heavy NFS traffic one can observe that the IP IDs repeat after about 5 seconds.
de: Dies erzeugt bei Hochgeschwindigkeitsverbindungen ein Problem, da es möglich ist, mehr als 65536 Pakete innerhalb von 30 Sekunden zu übertragen. Tatsächlich kann bei umfangreichem NFS-Verkehr beobachtet werden, dass sich die IP-Kennungen nach rund 5 Sekunden wiederholen.

source: This has serious effects on reassembly: if one fragment gets lost, another fragment I<from a different packet> but with the I<same IP ID> will arrive within the 30 second timeout, and the network stack will combine these fragments to form a new packet. Most of the time, network layers above IP will detect this mismatched reassembly - in the case of UDP, the UDP checksum, which is a 16 bit checksum over the entire packet payload, will usually not match, and UDP will discard the bad packet.
de: Das hat ernsthafte Effekte für den Wiederzusammenbau: Falls ein Fragment verloren geht und ein anderes Fragment I<von einem anderen Paket> mit der I<gleichen IP-Kennung> innerhalb der 30-Sekunden-Zeitüberschreitung eintrifft wird der Netzwerkstapel diese Fragmente zu einem neuen Paket zusammensetzen. Meistens werden Netzschichten oberhalb von IP diesen fehlerhaften Wiederzusammenbau erkennen. Im Falle von UDP wird die UDP-Prüfsumme, eine 16-Bit-Prüfsumme, normalerweise nicht korrekt sein und UDP wird das defekte Paket verwerfen.

source: However, the UDP checksum is 16 bit only, so there is a chance of 1 in 65536 that it will match even if the packet payload is completely random (which very often isn't the case). If that is the case, silent data corruption will occur.
de: Allerdings ist die UDP-Prüfsumme nur 16 Bit, so dass es eine Möglichkeit von 1 in 65536 gibt, dass die Prüfsumme passt, obwohl der Nutzinhalt vollkommen zufällig ist (was allerdings sehr oft nicht der Fall ist). Trifft dies zu, dann sind Daten ohne Rückmeldung defekt.

source: This potential should be taken seriously, at least on Gigabit Ethernet. Network speeds of 100Mbit/s should be considered less problematic, because with most traffic patterns IP ID wrap around will take much longer than 30 seconds.
de: Diese Möglichkeit sollte sehr ernst genommen werden, zumindest auf Gigabit-Ethernet. Netzgeschwindigkeiten von 100 MBit/s sollten als weniger problematisch betrachtet werden, da bei den meisten Verkehrsmustern der Umlauf der IP-Kennung sehr viel länger als 30 Sekunden betragen wird.

source: It is therefore strongly recommended to use B<NFS over TCP where possible>, since TCP does not perform fragmentation.
de: Es wird daher nachdrücklich empfohlen, B<wo möglich NFS über TCP> zu verwenden, da TCP keine Fragmentierung durchführt.

source: If you absolutely have to use NFS over UDP over Gigabit Ethernet, some steps can be taken to mitigate the problem and reduce the probability of corruption:
de: Wenn Sie unbedingt NFS über UDP über Gigabit-Ethernet verwenden müssen, können ein paar Dinge unternommen werden, um dem Problem entgegen zu wirken und die Wahrscheinlichkeit für Verfälschungen zu reduzieren:

source: Many Gigabit network cards are capable of transmitting frames bigger than the 1500 byte limit of traditional Ethernet, typically 9000 bytes. Using jumbo frames of 9000 bytes will allow you to run NFS over UDP at a page size of 8K without fragmentation. Of course, this is only feasible if all involved stations support jumbo frames.
de: Viele Gigabit-Netzkarten sind in der Lage, Frames größer als die Begrenzung des traditionellen Ethernet von 1500 byte zu übertragen, typischerweise 9000 bytes. Werden Jumbo Frames von 9000 bytes verwandt, kann NFS über UDP mit Seitengrößen von 8 K ohne Fragmentierung betrieben werden. Natürlich ist das nur möglich, falls alle beteiligten Stationen Jumbo Frames unterstützen.

source: To enable a machine to send jumbo frames on cards that support it, it is sufficient to configure the interface for a MTU value of 9000.
de: Um einer Maschine auf Karten, die das unterstützen, zu ermöglichen, Jumbo Frames zu versenden, reicht es aus, die Schnittstelle für einen MTU-Wert von 9000 zu konfigurieren.

source: I<Lower reassembly timeout:>
de: I<Niederigere Zeitüberschreitung für den Wiederzusammenbau>:

source: By lowering this timeout below the time it takes the IP ID counter to wrap around, incorrect reassembly of fragments can be prevented as well. To do so, simply write the new timeout value (in seconds) to the file B</proc/sys/net/ipv4/ipfrag_time>.
de: Durch Absenken dieser Zeitüberschreitung unter die Zeit, die für den IP-Kennungszählerumlauf benötigt wird, kann auch der fehlerhafte Wiederzusammenbau der Fragmente vermieden werden. Um dies zu erreichen, schreiben Sie den neuen Zeitüberschreitungswert (in Sekunden) in die Datei B</proc/sys/net/ipv4/ipfrag_time>.

source: A value of 2 seconds will greatly reduce the probability of IPID clashes on a single Gigabit link, while still allowing for a reasonable timeout when receiving fragmented traffic from distant peers.
de: Ein Wert von 2 Sekunden reduziert die Wahrscheinlichkeit von IP-Kennungszusammenstößen auf einer einzelnen Gigabit-Verbindung deutlich, erlaubt dabei aber auch noch eine vernünftige Zeitüberschreitung beim Empfang von fragmentiertem Verkehr von weit entfernten Teilnehmern.

source: DATA AND METADATA COHERENCE
de: DATEN- UND METADATENKOHÄRENZ

source: Some modern cluster file systems provide perfect cache coherence among their clients. Perfect cache coherence among disparate NFS clients is expensive to achieve, especially on wide area networks. As such, NFS settles for weaker cache coherence that satisfies the requirements of most file sharing types.
de: Einige moderne Cluster-Dateisysteme stellen zwischen ihren Clients eine perfekte Zwischenspeicherkohärenz bereit. Es ist sehr teuer, eine perfekte Zwischenspeicherkohärenz zwischen verteilten NFS-Clients zu erreichen, besonders auf Weitverkehrsnetzen. Daher belässt es NFS bei einer schwächeren Zwischenspeicherkohärenz, die die Anforderungen der meisten gemeinsamen Dateinutzungsarten erfüllt.

source: Close-to-open cache consistency
de: »close-to-open«-Zwischenspeicherkohärenzsemantik

source: Typically file sharing is completely sequential. First client A opens a file, writes something to it, then closes it. Then client B opens the same file, and reads the changes.
de: Typischerweise erfolgt das gemeinsame Benutzen von Dateien sequenziell. Zuerst öffnet Client A eine Datei, schreibt etwas hinein und schließt sie dann. Danach öffnet Client B die gleiche Datei und liest die Änderungen.

source: When an application opens a file stored on an NFS version 3 server, the NFS client checks that the file exists on the server and is permitted to the opener by sending a GETATTR or ACCESS request. The NFS client sends these requests regardless of the freshness of the file's cached attributes.
de: Wenn eine Anwendung eine auf einem NFS-3-Server gespeicherte Datei öffnet, überprüft der NFS-Client, ob die Datei noch auf dem Server existiert und dem Öffner erlaubt ist, indem er eine Anfrage GETATTR oder ACCESS sendet. Der NFS-Client sendet diese Anfragen unabhängig von der Frische der zwischengespeicherten Attribute der Datei.

source: When the application closes the file, the NFS client writes back any pending changes to the file so that the next opener can view the changes. This also gives the NFS client an opportunity to report write errors to the application via the return code from B<close>(2).
de: Wenn die Anwendung die Datei schließt, schreibt der NFS-Client alle anhängenden Änderungen an der Datei zurück, so dass der nächste Öffner die Änderungen sehen kann. Dieses gibt dem NFS-Client eine Möglichkeit, alle Schreibfehler mittels des Rückgabewerts von B<close>(2) mitzuteilen.

source: The behavior of checking at open time and flushing at close time is referred to as I<close-to-open cache consistency>, or I<CTO>. It can be disabled for an entire mount point using the B<nocto> mount option.
de: Das Verhalten der Prüfung zum Zeitpunkt des Öffnens und des Rückschreibens zum Zeitpunkt des Schließens wird als I<»close-to-open«-Zwischenspeicherkohärenzsemantik> oder I<CTO> bezeichnet. Sie kann für einen gesamten Einhängepunkt mit der Einhängeoption B<nocto> deaktiviert werden.

source: Weak cache consistency
de: Schwache Zwischenspeicherkohärenz

source: There are still opportunities for a client's data cache to contain stale data. The NFS version 3 protocol introduced "weak cache consistency" (also known as WCC) which provides a way of efficiently checking a file's attributes before and after a single request. This allows a client to help identify changes that could have been made by other clients.
de: Es gibt immer noch Möglichkeiten für den Zwischenspeicher des Clients, abgelaufene Daten zu enthalten. Das NFS-Version-3-Protokoll führt die »schwache Zwischenspeicherkohärenz« ein (auch als WCC bekannt), die einen Weg beschreibt, mit der die Dateiattribute vor und nach einer Anfrage effizient überprüft werden können. Dies hilft einem Client, Änderungen, die durch andere Clients vorgenommen worden sein könnten, zu identifizieren.

source: When a client is using many concurrent operations that update the same file at the same time (for example, during asynchronous write behind), it is still difficult to tell whether it was that client's updates or some other client's updates that altered the file.
de: Wenn ein Client viele parallele Aktionen einsetzt, die die gleiche Datei zur gleichen Zeit aktualisieren (beispielsweise während asynchronem verzögertem Schreiben), ist es immer noch schwierig, zu entscheiden, ob es diese Aktualisierungen des Clients oder Aktualisierungen auf einem anderen Client waren, die die Datei veränderten.

source: Attribute caching
de: Attribut-Zwischenspeicherung

source: Use the B<noac> mount option to achieve attribute cache coherence among multiple clients. Almost every file system operation checks file attribute information. The client keeps this information cached for a period of time to reduce network and server load. When B<noac> is in effect, a client's file attribute cache is disabled, so each operation that needs to check a file's attributes is forced to go back to the server. This permits a client to see changes to a file very quickly, at the cost of many extra network operations.
de: Verwenden Sie die Einhängeoption B<noac>, um die Zwischenspeicherkohärenz für Attribute zwischen mehreren Clients zu erreichen. Fast jede Dateisystemaktion prüft Dateiattributinformationen. Die Clients halten diese Informationen für eine bestimmte Zeit im Zwischenspeicher, um Netz- und Server-Last zu reduzieren. Wenn B<noac> aktiv ist, ist der Zwischenspeicher des Clients für Dateiattribute deaktiviert und daher muss jede Aktion, die die Dateiattribute prüft, zwingend zum Server gehen. Dies ermöglicht es einem Client, Änderungen sehr schnell zu erkennen, führt aber zu vielen zusätzlichen Netzaktionen.

source: Be careful not to confuse the B<noac> option with "no data caching." The B<noac> mount option prevents the client from caching file metadata, but there are still races that may result in data cache incoherence between client and server.
de: Achtung: Verwechseln Sie die Option B<noac> nicht mit »keine Daten-Zwischenspeicherung«. Die Einhängeoption B<noac> hindert den Client daran, die Dateimetadaten zwischenzuspeichern, aber es gibt immer noch Ressourcenwettläufe, die zu Daten-Zwischenspeicher-Inkohärenzen zwischen Client und Server führen können.

source: The NFS protocol is not designed to support true cluster file system cache coherence without some type of application serialization. If absolute cache coherence among clients is required, applications should use file locking. Alternatively, applications can also open their files with the O_DIRECT flag to disable data caching entirely.
de: Das NFS-Protokoll wurde nicht entwickelt, um echte Cluster-Dateisystem-Zwischenspeicherkohärenz zu unterstützen, ohne dass die Anwendungen eine Art von Serialisierung unterstützen. Falls zwischen den Clients eine absolute Zwischenspeicherkohärenz benötigt wird, sollten die Anwendungen das Sperren von Dateien einsetzen. Alternativ können Anwendungen ihre Dateien auch mit dem Schalter O_DIRECT öffnen, um das Zwischenspeichern der Daten komplett zu deaktivieren.

source: File timestamp maintenance
de: Dateizeitstempelverwaltung

source: NFS servers are responsible for managing file and directory timestamps (B<atime>, B<ctime>, and B<mtime>). When a file is accessed or updated on an NFS server, the file's timestamps are updated just like they would be on a filesystem local to an application.
de: NFS-Server sind dafür verantwortlich, die Datei- und Verzeichniszeitstempel (B<atime>, B<ctime> und B<mtime>) zu verwalten. Wenn auf eine Datei zugegriffen oder diese auf dem NFS-Server aktualisiert wird, werden die Zeitstempel der Datei so aktualisiert, als ob sie relativ zu der Anwendung auf einem lokalen Dateisystem wären.

source: NFS clients cache file attributes, including timestamps. A file's timestamps are updated on NFS clients when its attributes are retrieved from the NFS server. Thus there may be some delay before timestamp updates on an NFS server appear to applications on NFS clients.
de: NFS-Clients speichern Dateiattribute, auch Zeitstempel, zwischen. Die Zeitstempel einer Datei werden auf den NFS-Clients aktualisiert, wenn seine Attribute von dem NFS-Server abgefragt werden. Daher kann es zu Verzögerungen kommen, bevor eine Zeitstempelaktualisierung auf dem NFS-Server für Anwendungen auf NFS-Clients sichtbar wird.

source: To comply with the POSIX filesystem standard, the Linux NFS client relies on NFS servers to keep a file's B<mtime> and B<ctime> timestamps properly up to date. It does this by flushing local data changes to the server before reporting B<mtime> to applications via system calls such as B<stat>(2).
de: Um den POSIX-Dateisystemstandard zu erfüllen, verlässt sich der Linux-NFS-Client auf die NFS-Server, die Zeitstempel B<mtime> und B<ctime> der Datei korrekt aktuell zu halten. Um dies zu erreichen, schiebt er lokale Datenänderungen an den Server, bevor er B<mtime> mittels Systemaufrufen wie B<stat>(2) an Anwendungen meldet.
