Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: If the B<bg> option is specified, a timeout or failure causes the B<mount>(8) command to fork a child which continues to attempt to mount the export. The parent immediately returns with a zero exit code. This is known as a "background" mount.
de: Falls die Option B<bg> angegeben ist, wird eine Zeitüberschreitung oder ein Fehlschlag dazu führen, dass der Befehl B<mount>(8) mit Fork einen Kindprozess startet, der weiter versucht, das exportierte Dateisystem einzuhängen. Der Elternprozess kommt sofort mit einem Exit-Code von Null zurück. Dies ist als »Hintergrund«-Einhängung bekannt.

source: If the local mount point directory is missing, the B<mount>(8) command acts as if the mount request timed out. This permits nested NFS mounts specified in I</etc/fstab> to proceed in any order during system initialization, even if some NFS servers are not yet available. Alternatively these issues can be addressed using an automounter (refer to B<automount>(8) for details).
de: Falls das lokale Einhängeverzeichnis fehlt, verhält sich der Befehl B<mount>(8), als ob eine Zeitüberschreitung aufgetreten wäre. Dies erlaubt in I</etc/fstab> angegebene verschachtelte NFS-Einhängungen in beliebiger Reihenfolge während des Systemstarts fortzufahren, selbst falls einige NFS-Server noch nicht verfügbar sind. Alternativ können diese Probleme mit einem Selbsteinhängeprogramm angegangen werden (siehe B<automount>(8) für Details).

source: When using a connection oriented protocol such as TCP, it may sometimes be advantageous to set up multiple connections between the client and server. For instance, if your clients and/or servers are equipped with multiple network interface cards (NICs), using multiple connections to spread the load may improve overall performance. In such cases, the B<nconnect> option allows the user to specify the number of connections that should be established between the client and server up to a limit of 16.
de: Beim Einsatz eines verbindungsorientierten Protokolls wie TCP kann es manchmal von Vorteil sein, mehrere Verbindungen zwischen Client und Server einzurichten. Falls beispielsweise Ihre Clients und/oder Server mit mehreren Netzwerkschnittstellenkarten (NICs) ausgerüstet sind, können mehrere Verbindungen zur Lastverteilung die Gesamtleistung erhöhen. In diesen Fällen erlaubt die Option B<nconnect> dem Benutzer die Angabe der Verbindungsanzahl, die zwischen dem Client und dem Server aufgebaut werden sollen (bis zur Begrenzung von 16).

source: Note that the B<nconnect> option may also be used by some pNFS drivers to decide how many connections to set up to the data servers.
de: Beachten Sie, dass die Option B<nconnect> auch bei einigen pNFS-Laufwerken zur Angabe der Anzahl der einzurichtenden Verbindungen zu den Daten-Servern verwandt werden kann.

source: While B<nconnect> option sets a limit on the number of connections that can be established to a given server IP, B<max_connect> option allows the user to specify maximum number of connections to different server IPs that belong to the same NFSv4.1+ server (session trunkable connections) up to a limit of 16. When client discovers that it established a client ID to an already existing server, instead of dropping the newly created network transport, the client will add this new connection to the list of available transports for that RPC client.
de: Während B<nconnect> eine Begrenzung für die Anzahl der Verbindungen setzt, die mit einer angegeben Server-IP etabliert werden können, erlaubt die Option B<max_connect> dem Benutzer, die maximale Anzahl an Verbindungen an verschiedene Server-IPs, die zum gleichen NFSv4.1+-Server gehören (Sitzungs-Trunk-Verbindungen), bis zu einer Schranke von 16 festzulegen. Wenn ein Client ermittelt, dass es eine Client-Kennung zu einem bereits bestehenden Server etabliert, wird der Client diese Verbindung zu der Liste der verfügbaren Transporte für diesen RPC-Client hinzufügen, statt den neu erstellten Netzwerktransport zu verwerfen.

source: Selects whether to use NFS v3 or v4 READDIRPLUS requests. If this option is not specified, the NFS client uses READDIRPLUS requests on NFS v3 or v4 mounts to read small directories. Some applications perform better if the client uses only READDIR requests for all directories.
de: Wählt aus, ob NFS-v3- oder -v4-READDIRPLUS-Anfragen verwandt werden sollen. Falls diese Option nicht angegeben ist, verwendet der NFS-Client READDIRPLUS-Anfragen auf NFS-v3- oder -v4-Einhängungen, um kleine Verzeichnisse zu lesen. Einige Anwendungen arbeiten besser, falls der Client nur READDIR-Anfragen für alle Verzeichnisse verwendet.

source: The number of minutes that the B<mount>(8) command retries an NFS mount operation in the foreground or background before giving up. If this option is not specified, the default value for foreground mounts is 2 minutes, and the default value for background mounts is 10000 minutes (80 minutes shy of one week). If a value of zero is specified, the B<mount>(8) command exits immediately after the first failure.
de: Die Anzahl an Minuten, die der Befehl B<mount>(8) versucht, eine NFS-Einhängungsaktion im Vordergrund oder im Hintergrund durchzuführen, bevor er aufgibt. Falls diese Option nicht angegeben ist, ist der Standardwert für Vordergrundeinhängungen 2 Minuten und für Hintergrundeinhängungen 10000 Minuten (80 Minuten weniger als eine Woche). Falls ein Wert von 0 angegeben ist, wird der Befehl B<mount>(8) sich sofort nach dem ersten Fehler beenden.

source: Note that this only affects how many retries are made and doesn't affect the delay caused by each retry. For UDP each retry takes the time determined by the B<timeo> and B<retrans> options, which by default will be about 7 seconds. For TCP the default is 3 minutes, but system TCP connection timeouts will sometimes limit the timeout of each retransmission to around 2 minutes.
de: Beachten Sie, dass dies nur die Anzahl der durchgeführten Versuche beeinflusst, nicht die durch jeden Versuch hervorgerufene Verzögerung. Für UDP benötigt jeder Versuch die durch die Optionen B<timeo> und B<retrans> bestimmte Zeit, die standardmäßig 7 Sekunden ist. Für TCP ist die Vorgabe 3 Minuten, aber System-TCP-Verbindungszeitüberschreitungen begrenzen manchmal die Zeitüberschreitung für jede Neuübertragung auf rund 2 Minuten.

source: B<sec=>I<flavors>
de: B<sec=>I<Varianten>

source: A colon-separated list of one or more security flavors to use for accessing files on the mounted export. If the server does not support any of these flavors, the mount operation fails. If B<sec=> is not specified, the client attempts to find a security flavor that both the client and the server supports. Valid I<flavors> are B<none>, B<sys>, B<krb5>, B<krb5i>, and B<krb5p>. Refer to the SECURITY CONSIDERATIONS section for details.
de: Eine durch Doppelpunkt getrennte Liste von einem oder mehreren Sicherheitsvarianten, die beim Zugriff auf Dateien auf dem eingehängten Export verwandt werden sollen. Falls der Server keine dieser Varianten unterstützt, schlägt die Einhängeaktion fehl. Falls B<sec=> nicht angegeben ist, versucht der Client eine Sicherheitsvariante zu finden, die sowohl vom Client als auch vom Server unterstützt wird. Gültige I<Varianten> sind B<none>, B<sys>, B<krb5>, B<krb5i> und B<krb5p>. Der Abschnitt SICHERHEITSBETRACHTUNGEN enthält Details.

source: Determines how the client's data cache and attribute cache are shared when mounting the same export more than once concurrently. Using the same cache reduces memory requirements on the client and presents identical file contents to applications when the same remote file is accessed via different mount points.
de: Bestimmt, wie die Daten- und Attributszwischenspeicher des Clients gemeinsam benutzt werden, wenn die exportierten Verzeichnisse gleichzeitig mehr als einmal eingehängt werden. Die Verwendung des gleichen Zwischenspeichers reduziert die Speicheranforderungen auf dem Client und präsentiert Anwendungen identische Dateiinhalte, wenn auf die gleiche Datei aus der Ferne über verschiedene Einhängepunkte aus zugegriffen wird.

source: If neither option is specified, or if the B<sharecache> option is specified, then a single cache is used for all mount points that access the same export. If the B<nosharecache> option is specified, then that mount point gets a unique cache. Note that when data and attribute caches are shared, the mount options from the first mount point take effect for subsequent concurrent mounts of the same export.
de: Falls keine der Optionen oder falls die Option B<sharecache> angegeben ist, wird ein einzelner Zwischenspeicher für alle Einhängepunkte, die auf den gleichen Export zugreifen, verwandt. Falls die Option B<nosharecache> angegeben ist, dann bekommt dieser Einhängepunkt einen separaten Zwischenspeicher. Beachten Sie, dass die Einhängeoptionen von dem ersten Einhängepunkt auch für folgende gleichzeitige Einhängungen auf dem gleichen Export verwendet werden, falls die Daten- und Attributzwischenspeicher gemeinsam benutzt werden.

source: As of kernel 2.6.18, the behavior specified by B<nosharecache> is legacy caching behavior. This is considered a data risk since multiple cached copies of the same file on the same client can become out of sync following a local update of one of the copies.
de: Ab Kernel 2.6.18 ist das mit B<nosharecache> angegebene Verhalten veraltet. Es wird als Datenrisiko betrachtet, da mehrere zwischengespeicherte Kopien der gleichen Datei auf dem gleichen Client nach einer lokalen Aktualisierung einer der Kopien auseinanderlaufen können.

source: Specifies whether the NFS client should use a privileged source port when communicating with an NFS server for this mount point. If this option is not specified, or the B<resvport> option is specified, the NFS client uses a privileged source port. If the B<noresvport> option is specified, the NFS client uses a non-privileged source port. This option is supported in kernels 2.6.28 and later.
de: Gibt an, ob der NFS-Client einen privilegierten Quell-Port für die Kommunikation mit dem NFS-Server für diesen Einhängepunkt verwenden soll. Falls diese Option nicht oder die Option B<resvport> angegeben ist, verwendet der NFS-Client einen privilegierten Quell-Port. Falls die Option B<noresvport> angegeben ist, verwendet der NFS-Client einen nichtprivilegierten Port. Diese Option wird durch Kernel 2.6.28 und neuer unterstützt.

source: Using non-privileged source ports helps increase the maximum number of NFS mount points allowed on a client, but NFS servers must be configured to allow clients to connect via non-privileged source ports.
de: Die Verwendung von nichtprivilegierten Quell-Ports hilft bei der Erhöhung der auf dem Client maximal erlaubten Anzahl an NFS-Einhängepunkten. Allerdings muss der NFS-Server so konfiguriert sein, dass er Clients erlaubt, sich über nichtprivilegierte Quell-Ports zu verbinden.

source: Refer to the SECURITY CONSIDERATIONS section for important details.
de: Der Abschnitt SICHERHEITSBETRACHTUNGEN enthält wichtige Details.

source: B<lookupcache=>I<mode>
de: B<lookupcache=>I<Modus>

source: Specifies how the kernel manages its cache of directory entries for a given mount point. I<mode> can be one of B<all>, B<none>, B<pos>, or B<positive>. This option is supported in kernels 2.6.28 and later.
de: Gibt an, wie der Kernel seinen Zwischenspeicher von Verzeichniseinträgen für einen angegebenen Einhängepunkt verwaltet. I<Modus> kann entweder B<all>, B<none>, B<pos> oder B<positive> sein. Diese Option wird durch Kernel 2.6.28 und neuer unterstützt.

source: The Linux NFS client caches the result of all NFS LOOKUP requests. If the requested directory entry exists on the server, the result is referred to as I<positive>. If the requested directory entry does not exist on the server, the result is referred to as I<negative>.
de: Der Linux-NFS-Client speichert die Ergebnisse aller »NFS LOOKUP«-Anfragen zwischen. Falls der angeforderte Verzeichniseintrag auf dem Server existiert, wird auf das Ergebnis als I<positive> referenziert. Falls der angeforderte Verzeichniseintrag auf dem Server nicht existiert, wird auf das Ergebnis als I<negative> referenziert.

source: If this option is not specified, or if B<all> is specified, the client assumes both types of directory cache entries are valid until their parent directory's cached attributes expire.
de: Falls diese Option nicht oder B<all> angegeben ist, nimmt der Client an, dass beide Arten von Verzeichniseinträgen gültig sind, bis die zwischengespeicherten Attribute des Elternverzeichnisses verfallen.

source: If B<pos> or B<positive> is specified, the client assumes positive entries are valid until their parent directory's cached attributes expire, but always revalidates negative entires before an application can use them.
de: Falls B<pos> oder B<positive> angegeben ist, nimmt der Client an, dass positive Einträge gültig sind, bis die zwischengespeicherten Attribute des Elternverzeichnisses verfallen, überprüft aber immer negative Einträge, bevor eine Anwendung sie verwenden kann.

source: If B<none> is specified, the client revalidates both types of directory cache entries before an application can use them. This permits quick detection of files that were created or removed by other clients, but can impact application and server performance.
de: Falls B<none> angegeben ist, überprüft der Client beide Arten von Verzeichniszwischenspeichereinträgen, bevor eine Anwendung sie verwenden kann. Dies ermöglicht eine schnelle Erkennung von Dateien, die von anderen Clients angelegt oder entfernt wurden, kann aber Auswirkungen auf Anwendungen und die Leistung des Servers haben.

source: The DATA AND METADATA COHERENCE section contains a detailed discussion of these trade-offs.
de: Der Abschnitt DATEN- UND METADATENKOHÄRENZ enthält eine detaillierte Diskussion dieses Zielkonflikts.

source: Enable/Disables the cache of (read-only) data pages to the local disk using the FS-Cache facility. See cachefilesd(8) and E<lt>kernel_sourceE<gt>/Documentation/filesystems/caching for detail on how to configure the FS-Cache facility. Default value is nofsc.
de: aktiviert/deaktiviert das Zwischenspeichern von (nur lesbaren) Datenseiten auf der lokalen Platte mittels der FS-Cache-Einrichtung. Siehe cachefilesd(8) und E<lt>kernel_sourceE<gt>/Documentation/filesystems/caching für Details zur Einrichtung der FS-Cache-Einrichtung. Die Vorgabe ist nofsc.

source: The B<sloppy> option is an alternative to specifying B<mount.nfs> -s B<option.>
de: Die Option B<sloppy> ist eine Alternative zur Angabe der Option »-« von B<mount.nfs>.

source: Options for NFS versions 2 and 3 only
de: Optionen nur für NFS-Version 2 und 3

source: Use these options, along with the options in the above subsection, for NFS versions 2 and 3 only.
de: Verwenden Sie diese Optionen, zusammen mit den Optionen in den obigen Unterabschnitten, nur für NFS Version 2 und 3.

source: The I<netid> determines the transport that is used to communicate with the NFS server. Available options are B<udp>, B<udp6>, B<tcp>, B<tcp6>, B<rdma>, and B<rdma6>. Those which end in B<6> use IPv6 addresses and are only available if support for TI-RPC is built in. Others use IPv4 addresses.
de: Die I<NetID> bestimmt den Transport, der zur Kommunikation mit dem NFS-Server verwandt wird. Verfügbare Optionen sind B<udp>, B<udp6>, B<tcp>, B<tcp6>, B<rdma> und B<rdma6>. Die in B<6> endenden verwenden IPv6-Adressen und sind nur bei eingebauter Unterstützung für TI-RPC verfügbar. Die anderen verwenden IPv4-Adressen.

source: Each transport protocol uses different default B<retrans> and B<timeo> settings. Refer to the description of these two mount options for details.
de: Jedes Transportprotokoll verwendet andere Vorgaben für die Einstellungen von B<retrans> und B<timeo>. Lesen Sie die Beschreibungen dieser Einhängeoptionen für Details.

source: In addition to controlling how the NFS client transmits requests to the server, this mount option also controls how the B<mount>(8) command communicates with the server's rpcbind and mountd services. Specifying a netid that uses TCP forces all traffic from the B<mount>(8) command and the NFS client to use TCP. Specifying a netid that uses UDP forces all traffic types to use UDP.
de: Diese Einhängungsoption steuert, wie der NFS-Client Anfragen an den Server überträgt und zusätzlich, wie der Befehl B<mount>(8) auch mit den Diensten Rpcbind und Mountd des Servers kommuniziert. Wird eine Netid angegeben, die TCP verwendet, wird aller Verkehr von dem Befehl B<mount>(8) und dem NFS-Client dazu gezwungen, TCP zu verwenden. Wird eine Netid angegeben, die UDP verwendet, werden alle Verkehrstypen zur Verwendung von UDP gezwungen.

source: B<Before using NFS over UDP, refer to the TRANSPORT METHODS section.>
de: B<Lesen Sie den Abschnitt TRANSPORTMETHODEN unten, bevor Sie NFS über UDP verwenden.>

source: If the B<proto> mount option is not specified, the B<mount>(8) command discovers which protocols the server supports and chooses an appropriate transport for each service. Refer to the TRANSPORT METHODS section for more details.
de: Falls die Einhängeoption B<proto> nicht angegeben ist, findet der Befehl B<mount>(8) heraus, welche Protokolle der Server unterstützt und wählt für jeden Dienst ein angemessenes Protokoll. Lesen Sie den Abschnitt TRANSPORTMETHODEN für weitere Details.

source: The B<udp> option is an alternative to specifying B<proto=udp.> It is included for compatibility with other operating systems.
de: Die Option B<udp> ist eine Alternative zur Angabe von B<proto=udp>. Sie ist zur Kompatibilität mit anderen Betriebssystemen enthalten.

source: The B<tcp> option is an alternative to specifying B<proto=tcp.> It is included for compatibility with other operating systems.
de: Die Option B<tcp> ist eine Alternative zur Angabe von B<proto=tcp>. Sie ist zur Kompatibilität mit anderen Betriebssystemen enthalten.

source: The B<rdma> option is an alternative to specifying B<proto=rdma.>
de: Die Option B<rdma> ist eine Alternative zur Angabe von B<proto=rdma>.

source: The numeric value of the server's NFS service port. If the server's NFS service is not available on the specified port, the mount request fails.
de: Der numerische Wert des Dienste-Ports des NFS-Servers. Falls der NFS-Dienst des Servers nicht auf dem Port verfügbar ist, schlägt die Einhängeanfrage fehl.

source: If this option is not specified, or if the specified port value is 0, then the NFS client uses the NFS service port number advertised by the server's rpcbind service. The mount request fails if the server's rpcbind service is not available, the server's NFS service is not registered with its rpcbind service, or the server's NFS service is not available on the advertised port.
de: Falls diese Option nicht angegeben ist oder falls der angegebene Port-Wert 0 ist, wird der NFS-Client die vom Rpcbind-Dienst des Servers bekanntgemachte Server-Port-Nummer verwenden. Die Einhängeanfrage schlägt fehl, falls der Rpcbind-Dienst des Servers nicht verfügbar ist, der NFS-Dienst nicht beim Rpcbind-Dienst des Servers registriert ist oder falls der NFS-Dienst des Servers nicht auf dem bekanntgemachten Port des Servers verfügbar ist.

source: The numeric value of the server's mountd port. If the server's mountd service is not available on the specified port, the mount request fails.
de: Der numerische Wert des Mountd-Ports des Servers. Falls der Mountd-Dienst des Servers nicht auf dem Port verfügbar ist, schlägt die Einhängeanfrage fehl.

source: If this option is not specified, or if the specified port value is 0, then the B<mount>(8) command uses the mountd service port number advertised by the server's rpcbind service. The mount request fails if the server's rpcbind service is not available, the server's mountd service is not registered with its rpcbind service, or the server's mountd service is not available on the advertised port.
de: Falls diese Option nicht angegeben ist oder falls der angegebene Port-Wert 0 ist, wird der Befehl B<mount>(8) die vom Rpcbind-Dienst des Servers bekanntgemachte Mountd-Dienstenummer verwenden. Die Einhängeanfrage schlägt fehl, falls der Rpcbind-Dienst des Servers nicht verfügbar ist, der Mountd-Dienst nicht beim Rpcbind-Dienst des Servers registriert ist oder falls der Mountd-Dienst des Servers nicht auf dem bekanntgemachten Port des Servers verfügbar ist.

source: This option can be used when mounting an NFS server through a firewall that blocks the rpcbind protocol.
de: Diese Option kann bei Einhängen eines NFS-Servers durch eine Firewall, die das Rpcbind-Protokoll blockiert, verwandt werden.

source: The transport the NFS client uses to transmit requests to the NFS server's mountd service when performing this mount request, and when later unmounting this mount point.
de: Den Transport, den der NFS-Client verwendet, um Anfragen an den Mountd-Dienst des Servers zu übertragen, wenn er diese Einhängeanfrage durchführt und später, wenn der diesen Einhängepunkt aushängt.

source: I<netid> may be one of B<udp>, and B<tcp> which use IPv4 address or, if TI-RPC is built into the B<mount.nfs> command, B<udp6>, and B<tcp6> which use IPv6 addresses.
de: I<netid> kann entweder B<udp> oder B<tcp> sein, die IPv4-Adressen verwenden, oder, falls TI-RPC im Befehl B<mount.nfs> eingebaut ist, B<udp6> oder B<tcp6>, die IPv6-Adressen verwenden.

source: This option can be used when mounting an NFS server through a firewall that blocks a particular transport. When used in combination with the B<proto> option, different transports for mountd requests and NFS requests can be specified. If the server's mountd service is not available via the specified transport, the mount request fails.
de: Diese Option kann beim Einhängen eines NFS-Servers durch eine Firewall, die bestimmte Transporte blockiert, verwendet werden. Falls es in Kombination mit der Option B<proto> verwandt wird, können verschiedene Transporte für Mountd-Anfragen und für NFS-Anfragen angegeben werden. Falls der Mountd-Dienst des Server über den angegebenen Transport nicht verfügbar ist, schlägt die Einhängeanfrage fehl.

source: Refer to the TRANSPORT METHODS section for more on how the B<mountproto> mount option interacts with the B<proto> mount option.
de: Lesen Sie den Abschnitt TRANSPORTMETHODEN für Informationen, wie die Einhängeoption B<mountproto> mit der Einhängeoption B<proto> wechselwirkt.

source: The hostname of the host running mountd. If this option is not specified, the B<mount>(8) command assumes that the mountd service runs on the same host as the NFS service.
de: Der Rechnername des Rechners, der Mountd betreibt. Falls diese Option nicht angegeben ist, nimmt der Befehl B<mount>(8) an, dass der Dienst Mountd auf dem gleichen Rechner wie der NFS-Dienst läuft.

source: The RPC version number used to contact the server's mountd. If this option is not specified, the client uses a version number appropriate to the requested NFS version. This option is useful when multiple NFS services are running on the same remote server host.
de: Die für den Kontakt zum Mountd des Servers zu verwendende PRC-Versionsnummer. Falls diese Option nicht angegeben ist, verwendet der Client eine der gewünschten NFS-Version angemessene Versionsnummer. Diese Option ist nützlich, falls mehrere NFS-Dienste auf dem selben Rechner in der Ferne laufen.

source: The maximum length of a pathname component on this mount. If this option is not specified, the maximum length is negotiated with the server. In most cases, this maximum length is 255 characters.
de: Die maximale Länge der Pfadnamenkomponente bei dieser Einhängung. Falls diese Option nicht angegeben ist, wird die maximale Länge mit dem Server ausgehandelt. Meistens ist die maximale Länge 255 Zeichen.
