Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: The Linux client handles B<atime> updates more loosely, however. NFS clients maintain good performance by caching data, but that means that application reads, which normally update B<atime>, are not reflected to the server where a file's B<atime> is actually maintained.
de: Der Linux-Client handhabt allerdings Aktualisierungen der B<atime> lockerer. NFS-Clients halten eine gute Leistung, indem sie Daten zwischenspeichern, aber das bedeutet, dass Lesezugriffe von Anwendungen, die normalerweise die B<atime> aktualisierten, nicht auf dem Server gespiegelt werden, wo die B<atime> der Datei tatsächlich verwaltet wird.

source: Because of this caching behavior, the Linux NFS client does not support generic atime-related mount options. See B<mount>(8) for details on these options.
de: Aufgrund dieses Zwischenspeicherverhaltens unterstützt der Linux-NFS-Client nicht die generischen Atime-bezogenen Einhängeoptionen. Siehe B<mount>(8) für Details über diese Optionen.

source: In particular, the B<atime>/B<noatime>, B<diratime>/B<nodiratime>, B<relatime>/B<norelatime>, and B<strictatime>/B<nostrictatime> mount options have no effect on NFS mounts.
de: Insbesondere haben die Einhängeoptionen B<atime>/B<noatime>, B<diratime>/B<nodiratime>, B<relatime>/B<norelatime> und B<strictatime>/B<nostrictatime> auf NFS-Einhängungen keinen Effekt.

source: I</proc/mounts> may report that the B<relatime> mount option is set on NFS mounts, but in fact the B<atime> semantics are always as described here, and are not like B<relatime> semantics.
de: I</proc/mounts> könnte berichten, dass die Einhängeoption B<relatime> auf NFS-Einhängungen gesetzt ist, aber tatsächlich sind die B<atime>-Semantiken immer wie hier beschrieben und nicht wie die B<relatime>-Semantik.

source: Directory entry caching
de: Zwischenspeicherung von Verzeichniseinträgen

source: The Linux NFS client caches the result of all NFS LOOKUP requests. If the requested directory entry exists on the server, the result is referred to as a I<positive> lookup result. If the requested directory entry does not exist on the server (that is, the server returned ENOENT), the result is referred to as I<negative> lookup result.
de: Der Linux-NFS-Client-Zwischenspeicher ist das Ergebnis aller »NFS LOOKUP«-Anfragen. Falls die angefragten Verzeichniseinträge auf dem Server existieren, wird das Ergebnis als I<positives> Abfrageergebnis bezeichnet. Falls der angefragte Verzeichniseintrag nicht auf dem Server existiert (d.h. der Server ENOENT zurücklieferte), wird das Ergebnis als I<negatives> Abfrageergebnis bezeichnet.

source: To detect when directory entries have been added or removed on the server, the Linux NFS client watches a directory's mtime. If the client detects a change in a directory's mtime, the client drops all cached LOOKUP results for that directory. Since the directory's mtime is a cached attribute, it may take some time before a client notices it has changed. See the descriptions of the B<acdirmin>, B<acdirmax>, and B<noac> mount options for more information about how long a directory's mtime is cached.
de: Um zu erkennen, wann Verzeichniseinträge auf dem Server hinzugefügt oder dort entfernt wurden, überwacht der Linux-NFS-Client die Mtime eines Verzeichnisses. Falls der Client eine Änderung in der Mtime des Verzeichnisses erkennt, beseitigt der Client alle zwischengespeicherten LOOKUP-Ergebnisse für dieses Verzeichnis. Da die Mtime des Verzeichnisses ein zwischengespeichertes Attribut ist, kann es einige Zeit dauern, bis der Client eine Änderung bemerkt. Siehe die Beschreibung der Einhängeoptionen B<acdirmin>, B<acdirmax> und B<noac> für weitere Informationen darüber, wie lange die Mtime eines Verzeichnisses zwischengespeichert wird.

source: Caching directory entries improves the performance of applications that do not share files with applications on other clients. Using cached information about directories can interfere with applications that run concurrently on multiple clients and need to detect the creation or removal of files quickly, however. The B<lookupcache> mount option allows some tuning of directory entry caching behavior.
de: Das Zwischenspeichern von Verzeichniseinträgen verbessert die Leistung von Anwendungen, die Dateien nicht mit Anwendungen auf anderen Clients gemeinsam nutzen. Die Verwendung von zwischengespeicherten Informationen über Verzeichnisse kann allerdings Anwendungen durcheinanderbringen, die parallel auf mehreren Clients laufen und die die Erstellung und Entfernung von Dateien schnell erkennen müssen. Die Einhängeoption B<lookupcache> erlaubt teilweise das Einstellen des Verhaltens der Verzeichniseintragszwischenspeicherung.

source: Before kernel release 2.6.28, the Linux NFS client tracked only positive lookup results. This permitted applications to detect new directory entries created by other clients quickly while still providing some of the performance benefits of caching. If an application depends on the previous lookup caching behavior of the Linux NFS client, you can use B<lookupcache=positive>.
de: Vor Kernelveröffentlichung 2.6.28 verfolgte der Linux-NFS-Client nur positive Abfrageergebnisse. Dies ermöglichte Anwendungen, neue Verzeichniseinträge, die von anderen Clients erstellt wurden, schnell zu erkennen, und dabei immer noch einige der Leistungsvorteile des Zwischenspeichers zu genießen. Falls eine Anwendung von dem vorherigen Abfrageverhalten des Linux-NFS-Clients abhängt, können Sie B<lookupcache=positive> verwenden.

source: If the client ignores its cache and validates every application lookup request with the server, that client can immediately detect when a new directory entry has been either created or removed by another client. You can specify this behavior using B<lookupcache=none>. The extra NFS requests needed if the client does not cache directory entries can exact a performance penalty. Disabling lookup caching should result in less of a performance penalty than using B<noac>, and has no effect on how the NFS client caches the attributes of files.
de: Falls der Client seinen Zwischenspeicher ignoriert und jede Anwendungsnachschlageanfrage beim Server überprüft, kann der Client sofort erkennen, wenn ein neuer Verzeichniseintrag durch einen anderen Client entweder erstellt oder entfernt wurde. Sie können dieses Verhalten mittels B<lookupcache=none> festlegen. Die zusätzlichen NFS-Anfragen, die benötigt werden, falls der Client Verzeichniseinträge nicht zwischenspeichert, kann eine Leistungseinbuße zur Folge haben. Deaktivieren des Zwischenspeicherns der Nachfragen sollte zu einer geringeren Leistungseinbuße führen als die Verwendung von B<noac> und hat keinen Effekt darauf, wie der NFS-Client die Attribute von Dateien zwischenspeichert.

source: The sync mount option
de: Die Einhängeoption »sync«

source: The NFS client treats the B<sync> mount option differently than some other file systems (refer to B<mount>(8) for a description of the generic B<sync> and B<async> mount options). If neither B<sync> nor B<async> is specified (or if the B<async> option is specified), the NFS client delays sending application writes to the server until any of these events occur:
de: Der NFS-Client behandelt die Einhängeoption B<sync> anders als einige andere Dateisysteme (lesen Sie B<mount>(8) für eine Beschreibung der generischen Einhängeoptionen B<sync> und B<async>). Falls weder B<sync> noch B<async> angegeben ist (oder falls die Option B<async> angegeben wurde) verzögert der NFS-Client das Versenden von Schreibanforderungen von Anwendungen an den Server, bis eines der folgenden Ereignisse auftritt:

source: Memory pressure forces reclamation of system memory resources.
de: Speicherdruck erzwingt die Zurückgewinnung von Systemspeicherressourcen.

source: An application flushes file data explicitly with B<sync>(2), B<msync>(2), or B<fsync>(3).
de: Eine Anwendung schiebt explizit die Dateidaten mit B<sync>(2), B<msync>(2) oder B<fsync>(3) raus.

source: An application closes a file with B<close>(2).
de: Eine Anwendung schließt eine Datei mit B<close>(2).

source: The file is locked/unlocked via B<fcntl>(2).
de: Die Datei wird mittels B<fcntl>(2) gesperrt/entsperrt.

source: In other words, under normal circumstances, data written by an application may not immediately appear on the server that hosts the file.
de: Mit anderen Worten, unter normalen Bedingungen können von einer Anwendung geschriebene Daten nicht sofort auf dem Server, der die Datei beherbergt, auftauchen.

source: If the B<sync> option is specified on a mount point, any system call that writes data to files on that mount point causes that data to be flushed to the server before the system call returns control to user space. This provides greater data cache coherence among clients, but at a significant performance cost.
de: Falls die Option B<sync> am Einhängepunkt angegeben wurde, werden bei jedem Systemaufruf, der Daten in Dateien unter diesem Einhängepunkt schreibt, diese erst auf den Server geschrieben, bevor der Systemaufruf die Steuerung an den Benutzerraum zurückgibt. Damit wird größere Datenzwischenspeicherkohärenz unter den Clients erreicht, allerdings unter signifikanten Leitungseinbußen.

source: Applications can use the O_SYNC open flag to force application writes to individual files to go to the server immediately without the use of the B<sync> mount option.
de: Anwendungen können den Schalter »O_SYNC« von open verwenden, um zu erzwingen, dass Schreibanforderungen von Anwendungen für bestimmte Dateien sofort an den Server gesandt werden, ohne die Einhängeoption B<sync> zu verwenden.

source: Using file locks with NFS
de: Verwendung von Dateisperren mit NFS

source: The Network Lock Manager protocol is a separate sideband protocol used to manage file locks in NFS version 3. To support lock recovery after a client or server reboot, a second sideband protocol -- known as the Network Status Manager protocol -- is also required. In NFS version 4, file locking is supported directly in the main NFS protocol, and the NLM and NSM sideband protocols are not used.
de: Das Protokoll »Network Lock Manager« ist ein separates Seitenbandprotokoll, das zur Verwaltung von Dateisperren in NFS-Version 3 verwandt wird. Um das Wiederherstellen von Sperren nach einem Systemneustart eines Clients oder Servers zu unterstützen, ist ein zweites Seitenbandprotokoll – bekannt als »Network Status Manager«-Protokoll – notwendig. In NFS Version 4 wird das Sperren direkt im Haupt-NFS-Protokoll unterstützt und die NLM- und NSM-Seitenbandprotokolle werden nicht verwandt.

source: In most cases, NLM and NSM services are started automatically, and no extra configuration is required. Configure all NFS clients with fully-qualified domain names to ensure that NFS servers can find clients to notify them of server reboots.
de: Meistens werden die Dienste NLM und NSM automatisch gestartet und es wird keine spezielle Konfiguration benötigt. Konfigurieren Sie alle NFS-Clients mit den vollqualifizierten Rechnernamen, um sicherzustellen, dass NFS-Server die Clients finden und sie über Server-Neustarts informieren können.

source: NLM supports advisory file locks only. To lock NFS files, use B<fcntl>(2) with the F_GETLK and F_SETLK commands. The NFS client converts file locks obtained via B<flock>(2) to advisory locks.
de: NLM unterstützt nur empfohlene Sperren. Um NFS-Dateien zu sperren, verwenden Sie B<fcntl>(2) mit den Befehlen F_GETLK und F_SETLK. Der NFS-Client wandelt via B<flock>(2) erworbene Dateisperren in empfohlene Sperren um.

source: When mounting servers that do not support the NLM protocol, or when mounting an NFS server through a firewall that blocks the NLM service port, specify the B<nolock> mount option. NLM locking must be disabled with the B<nolock> option when using NFS to mount I</var> because I</var> contains files used by the NLM implementation on Linux.
de: Wenn von Servern, die nicht das NLM-Protokoll unterstützen, oder wenn von einem NFS-Server durch eine Firewall, die den NLM-Dienste-Port blockiert, eingehängt wird, dann verwenden Sie die Einhängeoption B<nolock>. NLM-Sperren müssen mit der Option B<nolock> ausgeschaltet werden, wenn I</var> mit NFS verwandt wird, da I</var> Dateien enthält, die von der NLM-Implementierung unter Linux verwandt werden.

source: Specifying the B<nolock> option may also be advised to improve the performance of a proprietary application which runs on a single client and uses file locks extensively.
de: Es wird auch empfohlen, die Option B<nolock> zu verwenden, um die Leistung von proprietären Anwendungen, die auf einem einzelnen Client laufen und extensiv Dateisperren verwenden, zu verbessern.

source: NFS version 4 caching features
de: Zwischenspeicherfunktionalitäten in NFS Version 4

source: The data and metadata caching behavior of NFS version 4 clients is similar to that of earlier versions. However, NFS version 4 adds two features that improve cache behavior: I<change attributes> and I<file delegation>.
de: Das Zwischenspeicherverhalten für Daten und Metadaten bei Clients der NFS-Version 4 ist ähnlich zu dem von älteren Versionen. Allerdings fügt NFS Version 4 zwei Funktionalitäten hinzu, die das Zwischenspeicherverhalten verbessern: I<Attributänderung> und I<Datei-Delegation>.

source: The I<change attribute> is a new part of NFS file and directory metadata which tracks data changes. It replaces the use of a file's modification and change time stamps as a way for clients to validate the content of their caches. Change attributes are independent of the time stamp resolution on either the server or client, however.
de: Die I<Attributänderung> ist ein neuer Teil der NFS-Datei- und -Verzeichnis-Metadaten, die Änderungen nachverfolgt. Sie ersetzt die Verwendung von Zeitstempeln der Dateiänderung, um Clients zu ermöglichen, die Gültigkeit der Inhalte ihrer Zwischenspeicher zu überprüfen. Attributänderungen sind allerdings unabhängig von der Zeitstempelauflösung sowohl auf dem Server als auch auf dem Client.

source: A I<file delegation> is a contract between an NFS version 4 client and server that allows the client to treat a file temporarily as if no other client is accessing it. The server promises to notify the client (via a callback request) if another client attempts to access that file. Once a file has been delegated to a client, the client can cache that file's data and metadata aggressively without contacting the server.
de: Eine I<Datei-Delegation> ist ein Vertrag zwischen einem NFS-Version-4-Client und einem Server, der es dem Client erlaubt, eine Datei temporär so zu behandeln, als ob kein anderer Client darauf zugreifen würde. Der Server verspricht dem Client, ihn zu benachrichtigen (mittels einer Rückrufanfrage), falls ein anderer Client versucht, auf die Datei zuzugreifen. Sobald eine Datei dem Client delegiert wurde, kann der Client aggressiv die Daten und Metadaten der Datei zwischenspeichern, ohne den Server zu benachrichtigen.

source: File delegations come in two flavors: I<read> and I<write>. A I<read> delegation means that the server notifies the client about any other clients that want to write to the file. A I<write> delegation means that the client gets notified about either read or write accessors.
de: Datei-Delegationen gibt es in zwei Varianten: I<read> und I<write>. Eine I<read>-Delegation bedeutet, dass der Server den Client über jeden anderen Client informiert, der in die Datei schreiben möchte. Eine I<write>-Delegation bedeutet, dass der Client sowohl über Lese- als auch Schreibzugreifende informiert wird.

source: Servers grant file delegations when a file is opened, and can recall delegations at any time when another client wants access to the file that conflicts with any delegations already granted. Delegations on directories are not supported.
de: Server gewähren Datei-Delegationen, wenn eine Datei geöffnet wird und können diese jederzeit zurückfordern, wenn ein anderer Client auf die Datei zugreifen möchte und dies im Widerspruch zu bereits gewährten Delegationen steht. Delegationen von Verzeichnissen werden nicht unterstützt.

source: In order to support delegation callback, the server checks the network return path to the client during the client's initial contact with the server. If contact with the client cannot be established, the server simply does not grant any delegations to that client.
de: Um Delegations-Rückrufe zu unterstützen, prüft der Server während des ursprünglichen Kontakts des Clients mit dem Server den Rückkehrpfad zum Client. Falls der Kontakt mit dem Client nicht aufgebaut werden kann, gewährt der Server einfach diesem Client keine Delegationen.

source: SECURITY CONSIDERATIONS
de: SICHERHEITSBETRACHTUNGEN

source: NFS servers control access to file data, but they depend on their RPC implementation to provide authentication of NFS requests. Traditional NFS access control mimics the standard mode bit access control provided in local file systems. Traditional RPC authentication uses a number to represent each user (usually the user's own uid), a number to represent the user's group (the user's gid), and a set of up to 16 auxiliary group numbers to represent other groups of which the user may be a member.
de: NFS-Server steuern den Zugriff auf Dateidaten, sie hängen aber von ihrer RPC-Implementierung ab, um die Authentifizierung von NFS-Anfragen bereitzustellen. Traditionelle NFS-Zugriffssteuerung ahmt die Standard-Modusbits-Zugriffssteuerung nach, die von lokalen Dateisystemen bereitgestellt wird. Traditionelle RPC-Authentifizierung verwendet eine Zahl, um jeden Benutzer darzustellen (gewöhnlich die UID des Benutzers), eine Zahl, um die Gruppe des Benutzers darzustellen (die GID des Benutzers) und eine Menge von bis zu 16 Hilfsgruppennummern, um weitere Gruppen darzustellen, bei denen der Benutzer ein Mitglied sein könnte.

source: Typically, file data and user ID values appear unencrypted (i.e. "in the clear") on the network. Moreover, NFS versions 2 and 3 use separate sideband protocols for mounting, locking and unlocking files, and reporting system status of clients and servers. These auxiliary protocols use no authentication.
de: Typischerweise erscheinen Dateidaten- und Benutzerkennungswerte unverschlüsselt (d.h. im Klartext) im Netz. Desweiteren verwenden NFS-Version 2 und 3 separate Seitenbandprotokolle zum Einhängen, Sperren und Entsperren von Dateien und zum Berichten des Systemstatus von Clients und Servern. Diese Hilfsprotokolle verwenden keine Authentifizierung.

source: In addition to combining these sideband protocols with the main NFS protocol, NFS version 4 introduces more advanced forms of access control, authentication, and in-transit data protection. The NFS version 4 specification mandates support for strong authentication and security flavors that provide per-RPC integrity checking and encryption. Because NFS version 4 combines the function of the sideband protocols into the main NFS protocol, the new security features apply to all NFS version 4 operations including mounting, file locking, and so on. RPCGSS authentication can also be used with NFS versions 2 and 3, but it does not protect their sideband protocols.
de: NFS-Version 4 kombiniert diese Seitenbandprotokolle mit dem Haupt-NFS-Protokoll und führt zusätzlich fortschrittlichere Formen der Zugriffssteuerung, Authentifizierung und des Übertragungsdatenschutzes ein. Die NFS-Version-4-Spezifikation verlangt starke Authentifizierung und Sicherheitsvarianten, die pro-RPC-Integritätsprüfungen und Verschlüsselung bereitstellen. Da NFS Version 4 die Funktionen der Seitenbandprotokolle in das Haupt-NFS-Protokoll integriert, gelten die neuen Sicherheitsfunktionalitäten für alle NFS-Version-4-Aktionen inklusive Einhängen, Dateisperren und so weiter. RPCGSS-Authentifizierung kann auch mit NFS-Version 2 und 3 verwandt werden, allerdings schützt es nicht ihre Seitenbandprotokolle.

source: The B<sec> mount option specifies the security flavor used for operations on behalf of users on that NFS mount point. Specifying B<sec=krb5> provides cryptographic proof of a user's identity in each RPC request. This provides strong verification of the identity of users accessing data on the server. Note that additional configuration besides adding this mount option is required in order to enable Kerberos security. Refer to the B<rpc.gssd>(8) man page for details.
de: Die Einhängeoption B<sec> legt die Sicherheitsvariante fest, die für Aktionen im Auftrag von Benutzern auf diesem NFS-Einhängepunkt gelten. Die Verwendung von B<sec=krb5> liefert einen kryptographischen Nachweis der Identität in jeder RPC-Anfrage. Dies stellt eine starke Überprüfung der Identität des Benutzers, der auf Daten auf dem Server zugreift, dar. Beachten Sie, dass neben der Hinzunahme dieser Einhängeoption weitere Konfiguration benötigt wird, um Kerberos-Sicherheit zu aktivieren. Lesen Sie die Handbuchseite B<rpc.gssd>(8) für weitere Details.

source: Two additional flavors of Kerberos security are supported: B<krb5i> and B<krb5p>. The B<krb5i> security flavor provides a cryptographically strong guarantee that the data in each RPC request has not been tampered with. The B<krb5p> security flavor encrypts every RPC request to prevent data exposure during network transit; however, expect some performance impact when using integrity checking or encryption. Similar support for other forms of cryptographic security is also available.
de: Zwei zusätzliche Varianten der Kerberos-Sicherheit werden unterstützt: B<krb5i> und B<krb5p>. Die Sicherheitsvariante B<krb5i> stellt eine kryptographisch starke Garantie dar, dass keine RPC-Anfrage verändert wurde. Die Sicherheitsvariante B<krb5p> verschlüsselt jede RPC-Anfrage, um Datenoffenlegung während der Netzübertragung zu verhindern, allerdings müssen Sie Leistungseinbußen erwarten, wenn Sie Integritätsprüfung oder Verschlüsselung verwenden. Ähnliche Unterstützung für weitere Formen der kryptographischen Sicherheit sind ebenfalls verfügbar.

source: NFS version 4 filesystem crossing
de: Dateisystemwechsel in NFS Version 4

source: The NFS version 4 protocol allows a client to renegotiate the security flavor when the client crosses into a new filesystem on the server. The newly negotiated flavor effects only accesses of the new filesystem.
de: Das NFS-Version-4-Protokoll erlaubt es einem Client, die Sicherheitsvariante neu auszuhandeln, wenn der Client in ein neues Dateisystem auf dem Server wechselt. Die neu ausgehandelte Variante betrifft nur Zugriffe auf dem neuen Dateisystem.

source: Such negotiation typically occurs when a client crosses from a server's pseudo-fs into one of the server's exported physical filesystems, which often have more restrictive security settings than the pseudo-fs.
de: Solche Aushandlungen treten typischerweise auf, wenn ein Client von einem Pseudodateisystem des Servers in eines der vom Server exportierten physischen Dateisysteme wechselt. Diese haben oft restriktivere Sicherheitseinstellungen als das Pseudodateisystem.

source: NFS version 4 Leases
de: NFS-Version-4-Ausleihe

source: In NFS version 4, a lease is a period during which a server irrevocably grants a client file locks. Once the lease expires, the server may revoke those locks. Clients periodically renew their leases to prevent lock revocation.
de: In NFS Version 4 ist eine Ausleihe (»lease«) eine Periode, in der der Server einem Client unumkehrbar Dateisperren gewährt. Sobald die Ausleihe abläuft, darf der Server diese Sperren zurückziehen. Clients erneuern ihre Ausleihe periodisch, um die Zurückziehung von Sperren zu vermeiden.
