Repository: sebras/manpages-l10n
Catalog: po/*/man5/nfs.5.po
Languages: de

source: Some early versions of NFS did not support this negotiation. Using this option ensures that B<pathconf>(3) reports the proper maximum component length to applications in such cases.
de: Einige ältere Versionen von NFS unterstützten diese Aushandlung nicht. Mittels dieser Option wird sichergestellt, dass B<pathconf>(3) in diesen Fällen die geeignete maximale Komponentenlänge an Anwendungen meldet.

source: Selects whether to use the NLM sideband protocol to lock files on the server. If neither option is specified (or if B<lock> is specified), NLM locking is used for this mount point. When using the B<nolock> option, applications can lock files, but such locks provide exclusion only against other applications running on the same client. Remote applications are not affected by these locks.
de: Wählt aus, ob das NLM-Seitenbandprotokoll zum Sperren von Dateien auf dem Server verwandt wird. Falls keine der Optionen (oder B<lock>) angegeben ist, wird NLM-Sperrung für diesen Einhängepunkt verwandt. Beim Verwenden der Option B<nolock> können Anwendungen Dateien sperren, aber diese Sperren stellen einen exklusiven Zugriff nur gegenüber anderen Anwendungen auf dem gleichen Client sicher. Anwendungen in der Ferne sind von diesen Sperren nicht betroffen.

source: NLM locking must be disabled with the B<nolock> option when using NFS to mount I</var> because I</var> contains files used by the NLM implementation on Linux. Using the B<nolock> option is also required when mounting exports on NFS servers that do not support the NLM protocol.
de: Das Sperren mit NLM muss mit der Option B<nolock> deaktiviert sein, wenn NFS zum Einhängen von I</var> verwandt wird, da I</var> Dateien enthält, die von der NLM-Implementierung von Linux verwandt werden. Die Verwendung der Option B<nolock> ist auch notwendig, wenn Exporte auf NFS-Servern eingehängt werden, die das NLM-Protokoll nicht unterstützen.

source: Selects whether to use close-to-open cache coherence semantics. If neither option is specified (or if B<cto> is specified), the client uses close-to-open cache coherence semantics. If the B<nocto> option is specified, the client uses a non-standard heuristic to determine when files on the server have changed.
de: Wählt aus, ob die »close-to-open« (Schließen-bis-Öffnen) Zwischenspeicherkohärenzsemantik verwandt wird. Falls keine Option (oder falls B<cto>) angegeben ist, verwendet der Client »close-to-open«-Zwischenspeicherkohärenzsemantik. Falls die Option B<nocto> angegeben ist, verwendet der Client eine nicht standardisierte Heuristik, um zu bestimmen, wann sich Dateien auf dem Server geändert haben.

source: Using the B<nocto> option may improve performance for read-only mounts, but should be used only if the data on the server changes only occasionally. The DATA AND METADATA COHERENCE section discusses the behavior of this option in more detail.
de: Der Einsatz der Option B<nocto> kann die Leistung für rein-lesbare Einhängungen erhöhen. Er sollte aber nur verwandt werden, wenn sich die Daten auf dem Server nur gelegentlich ändern. Der Abschnitt DATEN- UND METADATENKOHÄRENZ enthält eine detailliertere Diskussion des Verhaltens dieser Option.

source: Selects whether to use the NFSACL sideband protocol on this mount point. The NFSACL sideband protocol is a proprietary protocol implemented in Solaris that manages Access Control Lists. NFSACL was never made a standard part of the NFS protocol specification.
de: Wählt aus, ob bei diesem Einhängepunkt das NFSACL-Seitenbandprotokoll verwandt werden soll. Das NFSACL-Seitenbandprotokoll ist ein in Solaris implementiertes proprietäres Protokoll, das Zugriffssteuerlisten verwaltet. NFSACL wurde nie zu einem Standardteil der NFS-Protokollspezifikation.

source: If neither B<acl> nor B<noacl> option is specified, the NFS client negotiates with the server to see if the NFSACL protocol is supported, and uses it if the server supports it. Disabling the NFSACL sideband protocol may be necessary if the negotiation causes problems on the client or server. Refer to the SECURITY CONSIDERATIONS section for more details.
de: Falls weder die Option B<acl> noch B<noacl> angegeben ist, handelt der NFS-Client mit dem Server aus, ob das NFSACL-Protokoll unterstützt wird und verwendet es, falls der Server es unterstützt. Falls die Aushandlung zu Problemen auf dem Client oder Server führt, könnte die Deaktivierung des NFSACL-Seitenbandprotokolls notwendig sein. Der Abschnitt SICHERHEITSBETRACHTUNGEN enthält weitere Details.

source: B<local_lock=>mechanism
de: B<local_lock=>Mechanismus

source: Specifies whether to use local locking for any or both of the flock and the POSIX locking mechanisms. I<mechanism> can be one of B<all>, B<flock>, B<posix>, or B<none>. This option is supported in kernels 2.6.37 and later.
de: Gibt an, ob lokale Sperren für einen oder beide der Sperrmechanismen (Flock und POSIX) verwandt werden sollen. I<Mechanismus> kann entweder B<all>, B<flock>, B<posix> oder B<none> sein. Diese Option wird seit Kernel 2.6.37 unterstützt.

source: The Linux NFS client provides a way to make locks local. This means, the applications can lock files, but such locks provide exclusion only against other applications running on the same client. Remote applications are not affected by these locks.
de: Der Linux-NFS-Client bietet eine Möglichkeit, Sperren lokal durchzuführen. Das bedeutet, dass Anwendungen Dateien sperren können. Allerdings bieten solche Sperren nur Ausschlussrechte gegenüber anderen Anwendungen, die auf dem gleichen Client laufen. Anwendungen auf anderen Rechnern sind von diesen Sperren nicht betroffen.

source: If this option is not specified, or if B<none> is specified, the client assumes that the locks are not local.
de: Falls diese Option nicht oder falls B<none> angegeben ist, nimmt der Client an, dass die Sperren nicht lokal sind.

source: If B<all> is specified, the client assumes that both flock and POSIX locks are local.
de: Falls B<all> angegeben ist, nimmt der Client an, dass sowohl Flock- als auch POSIX-Sperren lokal sind.

source: If B<flock> is specified, the client assumes that only flock locks are local and uses NLM sideband protocol to lock files when POSIX locks are used.
de: Falls B<flock> angegeben ist, nimmt der Client an, dass nur Flock-Sperren lokal sind und verwendet das NLM-Sideband-Protokoll, wenn POSIX-Sperren verwandt werden.

source: If B<posix> is specified, the client assumes that POSIX locks are local and uses NLM sideband protocol to lock files when flock locks are used.
de: Falls B<posix> angegeben ist, nimmt der Client an, dass POSIX-Sperren lokal sind und verwendet das NLM-Sideband-Protokoll, wenn Flock-Sperren verwandt werden.

source: To support legacy flock behavior similar to that of NFS clients E<lt> 2.6.12, use 'local_lock=flock'. This option is required when exporting NFS mounts via Samba as Samba maps Windows share mode locks as flock. Since NFS clients E<gt> 2.6.12 implement flock by emulating POSIX locks, this will result in conflicting locks.
de: Um herkömmliches Flock-Verhalten zu unterstützen, das dem von NFS-Clients E<lt> 2.6.12 ähnlich ist, benutzen Sie »local_lock=flock«. Diese Option wird benötigt, wenn NFS-Einhängungen über Samba exportiert werden, da Samba Windows-Freigabemodusspeerren als Flock exportiert. Da NFS-Clients E<gt> 2.6.12 Flock durch Emulieren von POSIX-Sperren implementieren, wird dies zu im Konflikt stehenden Sperren führen.

source: NOTE: When used together, the 'local_lock' mount option will be overridden by 'nolock'/'lock' mount option.
de: Hinweis: Falls sie zusammen verwandt werden, wird die Einhängeoption »local_lock« durch die Einhängeoption »nolock«/»lock« außer Kraft gesetzt.

source: Options for NFS version 4 only
de: Optionen nur für NFS-Version 4

source: Use these options, along with the options in the first subsection above, for NFS version 4.0 and newer.
de: Verwenden Sie diese Optionen zusammen mit den Optionen in dem ersten obigen Unterabschnitt für NFS-Version 4 oder neuer.

source: The I<netid> determines the transport that is used to communicate with the NFS server. Supported options are B<tcp>, B<tcp6>, B<rdma>, and B<rdma6>. B<tcp6> use IPv6 addresses and is only available if support for TI-RPC is built in. Both others use IPv4 addresses.
de: I<netid> bestimmt den Transport, der für die Kommunikation mit dem NFS-Server verwandt wird. Unterstützte Optionen sind B<tcp>, B<tcp6>, B<rdma> und B<rdma6>. B<tcp6> verwendet IPv6-Adressen und ist nur verfügbar, falls Unterstützung für TI-RPC eingebaut ist. Die beiden anderen verwenden IPv4-Adressen.

source: All NFS version 4 servers are required to support TCP, so if this mount option is not specified, the NFS version 4 client uses the TCP protocol. Refer to the TRANSPORT METHODS section for more details.
de: Alle NFS-Version-4-Server müssen TCP unterstützen. Daher verwendet der NFS-Version-4-Client das TCP-Protokoll, falls diese Option nicht angegeben ist. Lesen Sie den Abschnitt TRANSPORTMETHODEN für weitere Details.

source: Specifies the protocol minor version number. NFSv4 introduces "minor versioning," where NFS protocol enhancements can be introduced without bumping the NFS protocol version number. Before kernel 2.6.38, the minor version is always zero, and this option is not recognized. After this kernel, specifying "minorversion=1" enables a number of advanced features, such as NFSv4 sessions.
de: Gibt die Unterversionsnummer des Protokolls an. NFSv4 führt »Unterversionen« ein, bei denen NFS-Protokollerweiterungen ohne Erhöhung der NFS-Protokollversionsnummer eingeführt werden können. Vor Kernel 2.6.38 war die Unterversionsnummer immer Null und diese Option wird nicht erkannt. Nach diesem Kernel aktiviert die Angabe von »minorversion=1« eine Reihe von fortschrittlichen Funktionalitäten, wie NFSv4-Sitzungen.

source: Recent kernels allow the minor version to be specified using the B<vers=> option. For example, specifying B<vers=4.1> is the same as specifying B<vers=4,minorversion=1>.
de: Neuere Kernel erlauben die Angabe der Unterversionsnummer mittels der Option B<vers=>. Beispielsweise ist die Angabe B<vers=4.1> identisch zur Angabe B<vers=4,minorversion=1>.

source: If this mount option is not specified, the NFS client uses the standard NFS port number of 2049 without first checking the server's rpcbind service. This allows an NFS version 4 client to contact an NFS version 4 server through a firewall that may block rpcbind requests.
de: Falls diese Einhängeoption nicht angegeben ist, verwendet der NFS-Client die Standard-Portnummer 2049, ohne erst den Rpcbind-Dienst des Servers zu prüfen. Dies erlaubt es, einem NFS-Version-4-Client, Kontakt zu einem Server aufzunehmen, der hinter einer Firewall, die Rpcbind-Anfragen blockiert, liegt.

source: If the specified port value is 0, then the NFS client uses the NFS service port number advertised by the server's rpcbind service. The mount request fails if the server's rpcbind service is not available, the server's NFS service is not registered with its rpcbind service, or the server's NFS service is not available on the advertised port.
de: Falls der angegebene Port-Wert 0 ist, verwendet der NFS-Client die vom Rpcbind-Dienst des NFS-Servers bekanntgegebene Port-Nummer. Die Einhängeanfrage schlägt fehl, falls der Rpcbind-Dienst des Servers nicht verfügbar, der NFS-Dienst nicht in dem Rpcbind-Dienst registriert oder der NFS-Dienst auf dem bekanntgegebenen Port nicht verfügbar ist.

source: Selects whether to use close-to-open cache coherence semantics for NFS directories on this mount point. If neither B<cto> nor B<nocto> is specified, the default is to use close-to-open cache coherence semantics for directories.
de: Wählt aus, ob für diesen Einhängepunkt »close-to-open«-Zwischenspeicherkohärenzsemantik für NFS-Verzeichnisse verwandt wird. Falls weder B<cto> noch B<nocto> angegeben sind, ist die Vorgabe, »close-to-open«-Zwischenspeicherkohärenzsemantik für Verzeichnisse zu verwenden.

source: File data caching behavior is not affected by this option. The DATA AND METADATA COHERENCE section discusses the behavior of this option in more detail.
de: Das Zwischenspeichern von Dateidaten wird durch diese Option nicht beeinflusst. Der Abschnitt DATEN- UND METADATENKOHÄRENZ enthält eine detailliertere Beschreibung dieser Option.

source: Specifies a single IPv4 address (in dotted-quad form), or a non-link-local IPv6 address, that the NFS client advertises to allow servers to perform NFS version 4.0 callback requests against files on this mount point. If the server is unable to establish callback connections to clients, performance may degrade, or accesses to files may temporarily hang. Can specify a value of IPv4_ANY (0.0.0.0) or equivalent IPv6 any address which will signal to the NFS server that this NFS client does not want delegations.
de: Gibt eine einzelne IPv4-Adresse (in Dreipunktschreibweise) oder eine Nicht-Link-Local-IPv6-Adresse, die der NFS-Client bekanntgibt, um Servern zu erlauben, NFS-Version-4-Rückrufanfrage für Dateien auf diesem Einhängepunkt durchzuführen, an. Falls der Server keine Rückrufverbindungen zu Clients aufbauen kann, kann sich die Leistung verringern oder Dateizugriffe können zeitweise hängen. Ein Wert von IPv4_ANY (0.0.0.0) oder äquivalente IP6-any-Adresse kann angegeben werden. Damit wird dem NFS-Server signalisiert, dass dieser NFS-Client keine Delegationen möchte.

source: If this option is not specified, the B<mount>(8) command attempts to discover an appropriate callback address automatically. The automatic discovery process is not perfect, however. In the presence of multiple client network interfaces, special routing policies, or atypical network topologies, the exact address to use for callbacks may be nontrivial to determine.
de: Falls diese Option nicht angegeben ist, versucht der Befehl B<mount>(8) die geeigneten Rückrufadressen automatisch zu ermitteln. Dieser automatische Ermittlungsprozess ist allerdings nicht perfekt. Falls mehrere Client-Netzschnittstellen, spezielle Routing-Optionen oder atypische Netztopologien vorhanden sind, ist es möglicherweise nicht trivial, die genaue Adresse für Rückrufe zu ermitteln.

source: NFS protocol versions 4.1 and 4.2 use the client-established TCP connection for callback requests, so do not require the server to connect to the client. This option is therefore only affect NFS version 4.0 mounts.
de: NFS-Protokollversionen 4.1 und 4.2 verwenden Client-etablierte TCP-Verbindungen für Rückrufanfragen und benötigen daher nicht, dass sich der Server mit dem Client verbindet. Diese Option betrifft daher nur NFS-Version-4.0-Einhängungen.

source: Selects whether the client uses an identification string that is compatible with NFSv4 Transparent State Migration (TSM). If the mounted server supports NFSv4 migration with TSM, specify the B<migration> option.
de: Wählt aus, ob der Client eine Identifizierungszeichenkette verwendet, die mit dem »NFSv4 Transparent State Migration (TSM)« kompatibel ist. Falls der eingehängte Server NFSv4-Migration mit TSM unterstützt, geben Sie die Option B<migration> an.

source: Some server features misbehave in the face of a migration-compatible identification string. The B<nomigration> option retains the use of a traditional client indentification string which is compatible with legacy NFS servers. This is also the behavior if neither option is specified. A client's open and lock state cannot be migrated transparently when it identifies itself via a traditional identification string.
de: Einige Server-Funktionalitäten funktionieren im Angesicht einer Migrations-kompatiblen Identifizierungszeichenkette nicht richtig. Die Option B<nomigration> erhält die Verwendung einer traditionellen Client-Identifizierungszeichenkette, die mit veralteten NFS-Servern kompatibel ist. Dies ist auch das Verhalten, falls keine der Optionen angegeben wurde. Die offenen und Sperrenstatus können nicht transparent migriert werden, wenn er sich selbst mit einer traditionellen Identifizierungszeichenkette identifiziert.

source: This mount option has no effect with NFSv4 minor versions newer than zero, which always use TSM-compatible client identification strings.
de: Diese Einhängeoption hat bei NFSv4-Versionen, deren Unternummer größer als Null ist, keinen Effekt. Bei diesen wird immer eine TSM-kompatible Identifizierungszeichenkette verwandt.

source: nfs4 FILE SYSTEM TYPE
de: NFS4-DATEISYSTEMTYP

source: The B<nfs4> file system type is an old syntax for specifying NFSv4 usage. It can still be used with all NFSv4-specific and common options, excepted the B<nfsvers> mount option.
de: Der Dateisystemtyp B<nfs4> ist eine alte Syntax für die Angabe der Verwendung von NFSv4. Er kann noch mit allen NFSv4-spezifischen und allgemeinen Optionen außer der B<nfsvers>-Einhängeoption verwandt werden.

source: MOUNT CONFIGURATION FILE
de: EINHÄNGEKONFIGURATIONSDATEI

source: If the mount command is configured to do so, all of the mount options described in the previous section can also be configured in the I</etc/nfsmount.conf> file. See B<nfsmount.conf(5)> for details.
de: Falls der Befehl »mount« entsprechend konfiguriert ist, können alle in den vorhergehenden Kapiteln beschriebenen Einhängeoptionen auch in der Datei I</etc/nfsmount.conf> konfiguriert werden. Siehe B<nfsmount.conf>(5) für Details.

source: EXAMPLES
de: BEISPIELE

source: mount option. To mount using NFS version 3, use the B<nfs> file system type and specify the B<nfsvers=3> mount option. To mount using NFS version 4, use either the B<nfs> file system type, with the B<nfsvers=4> mount option, or the B<nfs4> file system type.
de: Einhängeoption. Um mit NFS-Version 3 einzuhängen, verwenden Sie den B<nfs>-Dateisystemtyp und geben Sie die Einhängeoption B<nfsvers=3> an. Um mit NFS-Version 4 einzuhängen, verwenden Sie entweder den B<nfs>-Dateisystemtyp mit der Einhängeoption B<nfsvers=4> oder den Dateisystemtyp B<nfs4>.

source: The following example from an I</etc/fstab> file causes the mount command to negotiate reasonable defaults for NFS behavior.
de: Das folgende Beispiel aus der Datei I</etc/fstab> führt dazu, dass der Befehl »mount« vernünftige Vorgaben für das NFS-Verhalten aushandelt.

source: This example shows how to mount using NFS version 4 over TCP with Kerberos 5 mutual authentication.
de: Dieses Beispiel zeigt, wie NFS-Version 4 über TCP mit Kerberos 5 gegenseitiger Authentifizierung einzuhängen ist:

source: This example shows how to mount using NFS version 4 over TCP with Kerberos 5 privacy or data integrity mode.
de: Dieses Beispiel zeigt, wie NFS-Version 4 über TCP mit Kerberos 5 Datenschutz- oder Datenintegritätsmodus einzuhängen ist:

source: This example can be used to mount /usr over NFS.
de: Dieses Beispiel kann zum Einhängen von /usr über NFS verwandt werden:

source: This example shows how to mount an NFS server using a raw IPv6 link-local address.
de: Dieses Beispiel zeigt, wie ein NFS-Server mit einer rohen IPv6-link-lokalen-Adresse eingehängt wird:

source: TRANSPORT METHODS
de: TRANSPORTMETHODEN

source: NFS clients send requests to NFS servers via Remote Procedure Calls, or I<RPCs>. The RPC client discovers remote service endpoints automatically, handles per-request authentication, adjusts request parameters for different byte endianness on client and server, and retransmits requests that may have been lost by the network or server. RPC requests and replies flow over a network transport.
de: NFS-Clients senden Anfragen an NFS-Server mittels Remote Procedure Calls oder I<RPCs>. Der RPC-Client ermittelt die Diensteendpunkte automatisch, kümmert sich um die Authentifizierung pro Anfrage, passt Anfrageparameter auf verschiedene Byte-Endianess auf dem Client und Server an und überträgt Anfragen erneut, die im Netz oder auf dem Server verloren gegangen sind. RPC-Anfragen und -Antworten fließen über einen Netztransport.

source: In most cases, the B<mount>(8) command, NFS client, and NFS server can automatically negotiate proper transport and data transfer size settings for a mount point. In some cases, however, it pays to specify these settings explicitly using mount options.
de: Meistens kann der Befehl B<mount>(8), der NFS-Client und der NFS-Server die korrekten Transport- und Datentransfergrößeneinstellungen für einen Einhängepunkt automatisch aushandeln. In einigen Fällen lohnt es sich aber, diese Einstellungen explizit mit Einhängeoptionen anzugeben.

source: Traditionally, NFS clients used the UDP transport exclusively for transmitting requests to servers. Though its implementation is simple, NFS over UDP has many limitations that prevent smooth operation and good performance in some common deployment environments. Even an insignificant packet loss rate results in the loss of whole NFS requests; as such, retransmit timeouts are usually in the subsecond range to allow clients to recover quickly from dropped requests, but this can result in extraneous network traffic and server load.
de: Traditionell verwenden NFS-Clients exklusiv den UDP-Transport für die Übertragung von Anfragen an Server. Obwohl die Implementierung einfach ist, hat NFS über UDP viele Einschränkungen, die einen reibungslosen Betrieb und gute Leistung in einigen typischen Einsatzumgebungen verhindern. Selbst ein unbedeutender Paketverlust führt zu dem Verlust ganzer NFS-Anfragen. Daher sind Neuübertragungszeitüberschreitungen normalerweise im Subsekundenbereich, damit Clients sich schnell von verlorengegangenen Anfragen erholen können. Dies kann aber zu zusätzlichem Netzverkehr und Serverlast führen.

source: However, UDP can be quite effective in specialized settings where the networks MTU is large relative to NFSs data transfer size (such as network environments that enable jumbo Ethernet frames). In such environments, trimming the B<rsize> and B<wsize> settings so that each NFS read or write request fits in just a few network frames (or even in a single frame) is advised. This reduces the probability that the loss of a single MTU-sized network frame results in the loss of an entire large read or write request.
de: UDP kann jedoch in spezialisierten Einstellungen ziemlich effektiv sein, bei denen die MTU des Netzes im Vergleich zur Datentransfergröße von NFS groß ist (wie in Netzwerkumgebungen, die Jumbo-Ethernet-Frames aktivieren). In derartigen Umgebungen wird empfohlen, die Einstellungen B<rsize> und B<wsize> so einzuschränken, dass jede NFS-Lese- oder -Schreib-Anfrage in nur wenige Netz-Frames (oder sogar einem einzigen Frame) passt. Dies vermindert die Wahrscheinlichkeit, dass der Verlust eines einzelnen Netz-Frames in MTU-Größe zum Verlust einer ganzen großen Lese- oder Schreibabfrage führt.

source: TCP is the default transport protocol used for all modern NFS implementations. It performs well in almost every conceivable network environment and provides excellent guarantees against data corruption caused by network unreliability. TCP is often a requirement for mounting a server through a network firewall.
de: TCP ist das von allen modernen NFS-Implementierungen verwandte Standardprotokoll. Es liefert in fast allen denkbaren Netzumgebungen eine gute Leistung und bietet exzellente Garantien gegen durch Netzunzuverlässigkeit hervorgerufene Datenverfälschung. TCP ist oft eine Voraussetzung, um einen Server durch eine Firewall einzuhängen.
