Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailex.5.po
Languages: hu

source: NAME
hu: NÉV

source: procmailex - procmail rcfile examples
hu: procmailex - procmail konfigurációs állomány példák

source: SYNOPSIS
hu: ÖSSZEGZÉS

source: B<$HOME/.procmailrc examples>
hu: B<$HOME/.procmailrc példák>

source: DESCRIPTION
hu: LEÍRÁS

source: For a description of the rcfile format see B<procmailrc>(5).
hu: A konfigurációs állomány felépítéséről bővebben a B<procmailrc>(5). súgóban lehet olvasni.

source: The weighted scoring technique is described in detail in the B<procmailsc>(5) man page.
hu: A súlyozott értékelési módszerről részletes információ a B<procmailsc>(5) súgóban található.

source: EXAMPLES
hu: PÉLDÁK

source: Sort out all mail coming from the scuba-dive mailing list into the mailfolder scubafile (uses the locallockfile scubafile.lock).
hu: Búvárkodással foglalkozó levelező listáról érkező leveleket a buvarkodas nevű mappába irányításhoz (buvarkodas.lock záróállomány [locallockfile] használatával) a következő megoldás használható:

source: :0: * ^TOscuba scubafile
hu: :0: * ^TObuvarkodas buvarkodas

source: Forward all mail from peter about compilers to william (and keep a copy of it here in petcompil).
hu: Pétertől érkező programozásról szóló leveleket Istvánnak az alábbi módon lehet továbbítani, miközben ezekről a levelekről egy másolat a peterprog mappába kerül.

source: :0 * ^From.*peter * ^Subject:.*compilers { :0 c ! william@somewhere.edu
hu: :0 * ^From.*peter * ^Subject:.*programozas { :0 c ! istvan@gepe.hu

source: :0 petcompil }
hu: :0 peterprog }

source: An equivalent solution that accomplishes the same:
hu: Ugyanez egy kicsit másként:

source: :0 c * ^From.*peter * ^Subject:.*compilers ! william@somewhere.edu
hu: :0 c * ^From.*peter * ^Subject:.*programozas ! istvan@gepe.hu

source: :0 A petcompil
hu: :0 A peterprog

source: An equivalent, but slightly slower solution that accomplishes the same:
hu: Ugyanez, de egy kicsit lassabb módszerrel:

source: :0 * ^From.*peter * ^Subject:.*compilers petcompil
hu: :0 * ^From.*peter * ^Subject:.*programozás peterprog

source: If you are fairly new to procmail and plan to experiment a little bit it often helps to have a I<safety net> of some sort. Inserting the following two recipes above all other recipes will make sure that of all arriving mail always the last 32 messages will be preserved. In order for it to work as intended, you have to create a directory named `backup' in $MAILDIR prior to inserting these two recipes.
hu: Procmailben kevésbé járatosak és kísérletezgetőknek jól jöhet néhány I<tanács>. A következő két feltételt a szűrőfeltételek elé beszúrva az utolsó 32 levelünkről mindig készül egy biztonsági másolat. Ahhoz, hogy működjön ez a mentés, el ne felejtsük a $MAILDIR könyvtárban létrehozni egy 'mentes' könyvtárat.

source: :0 c backup
hu: :0 c mentes

source: :0 ic | cd backup && rm -f dummy `ls -t msg.* | sed -e 1,32d`
hu: :0 ic | cd mentes && rm -f dummy `ls -t msg.* | sed -e 1,32d`

source: If your system doesn't generate or generates incorrect leading `From ' lines on every mail, you can fix this by calling up procmail with the -f- option. To fix the same problem by different means, you could have inserted the following two recipes above all other recipes in your rcfile. They will filter the header of any mail through formail which will strip any leading `From ', and automatically regenerates it subsequently.
hu: A levelekben a `From ' mező nem mindig megfelelő, ezt egy procmail -f paranccsal lehet kijavítani. Az ilyen típusú hibák javításához az alábbi két feltételt érdemes beszúrni. Ezekkel az összes bejövő levél fejlécében javíthatjuk a `From ' mezőt.

source: Add the headers of all messages that didn't come from the postmaster to your private header collection (for statistics or mail debugging); and use the lockfile `headc.lock'. In order to make sure the lockfile is not removed until the pipe has finished, you have to specify option `w'; otherwise the lockfile would be removed as soon as the pipe has accepted the mail.
hu: Másik hasznos dolog lehet, ha egy saját fejlécet szúrunk be (statisztikai vagy egyéb indok miatt) az összes olyan levélbe, amely nem a postmaster-től jött (itt fejlec.lock záróállományt is használunk). Annak érdekében, hogy a záróállomány a szűrés befejezésig aktív maradjon a `w' kapcsolót is meg kell adni, különben ahogy a szűrési feltételhez ér a levél a zárolás megszűnne.

source: :0 hwc: * !^FROM_MAILER | uncompress headc.Z; cat E<gt>E<gt>headc; compress headc
hu: :0 hwc: * !^FROM_MAILER | uncompress fejlec.Z; cat E<gt>E<gt>fejlec; compress fejlec

source: Or, if you would use the more efficient gzip instead of compress:
hu: Vagy a hatékonyabb gzip-es tömörítővel az alábbi módon:

source: :0 hwc: * !^FROM_MAILER | gzip E<gt>E<gt>headc.gz
hu: :0 hwc: * !^FROM_MAILER | gzip E<gt>E<gt>fejlec.gz

source: Forward all mails shorter than 1000 bytes to my home address (no lockfile needed on this recipe).
hu: Az összes 1000 bájtnál kisebb levelek otthoni címünkre irányításához (záróállomány használata nélkül) az alábbira lehet szükségünk:

source: :0 * E<lt> 1000 ! myname@home
hu: :0 * E<lt> 1000 ! nevem@otthon

source: Split up incoming digests from the surfing mailing list into their individual messages, and store them into surfing, using surfing.lock as the locallockfile.
hu: A szörfölés levelezési listáról érkező digest (összefűzött) levelek szétdarabolásához és azok szorfoles mappába irányításához, szorfoles.lock záróállomány használatával a következő szűrőre van szükségünk.

source: :0: * ^Subject:.*surfing.*Digest | formail +1 -ds E<gt>E<gt>surfing
hu: :0: * ^Subject:.*szorfing.*Digest | formail +1 -ds E<gt>E<gt>szorfoles

source: Store everything coming from the postmaster or mailer-daemon (like bounced mail) into the file postm, using postm.lock as the locallockfile.
hu: A postmastertől vagy a mailer-daemontól érkező összes levél postm mappába gyűjtéséhez, postm.lock záróállomány használatával az alábbi szükséges:

source: A simple autoreply recipe. It makes sure that neither mail from any daemon (like bouncing mail or mail from mailing-lists), nor autoreplies coming from yourself will be autoreplied to. If this precaution would not be taken, disaster could result (`ringing' mail). In order for this recipe to autoreply to all the incoming mail, you should of course insert it before all other recipes in your rcfile. However, it is advisable to put it I<after> any recipes that process the mails from subscribed mailinglists; it generally is not a good idea to generate autoreplies to mailinglists (yes, the !^FROM_DAEMON regexp should already catch those, but if the mailinglist doesn't follow accepted conventions, this might I<not> be I<enough>).
hu: Egy egyszerű megoldás automatikus válaszadásra. A saját és a levéltovábbító programoktól érkező levelekre automatikus válaszadásnak nem szabad történnie. Ha nem figyelnénk erre, akkor galibába kerülhetünk (pl. körkörös levéltovábbküldés [`ringing' mail]). Hogy hatékonyan működjön ez a szűrő, ezért az összes többi elé célszerű beszúrni. Azonban ajánlatos lehet, a levelezőlistákról érkező levelek szűrése I<után> betenni, mivel levelezőlisták leveleire automatikus választ küldeni nem ildomos. Elméletileg a !^FROM_DAEMON feltétel kiszűri a levelezőlistákat, de I<ne kísértsük a sorsot> , ha I<mégsem> tenné azt.

source: :0 h c * !^FROM_DAEMON * !^X-Loop: your@own.mail.address | (formail -r -I"Precedence: junk" \e -A"X-Loop: your@own.mail.address" ; \e echo "Mail received.") | $SENDMAIL -t
hu: :0 h c * !^FROM_DAEMON * !^X-Loop: sajat@emilcimed | (formail -r -I"Precedence: junk" \e -A"X-Loop: sajat@emilcimed" ; \e echo "Leveled érkezett.") | $SENDMAIL -t

source: A more complicated autoreply recipe that implements the functional equivalent of the well known B<vacation>(1) program. This recipe is based on the same principles as the last one (prevent `ringing' mail). In addition to that however, it maintains a vacation database by extracting the name of the sender and inserting it in the vacation.cache file if the name was new (the vacation.cache file is maintained by formail which will make sure that it always contains the most recent names, the size of the file is limited to a maximum of approximately 8192 bytes). If the name was new, an autoreply will be sent.
hu: A B<vacation>(1) programot akár helyettesítő, összetettebb automatikus válaszadást a következő módon lehet létrehozni. Ez a szűrő az előzőekben ismertetet módszert azzal egészíti ki, hogy egy szünidő adatbázist készít a szunido.cache állományba a levelek feladóiból; ha azok ott még nem szerepeltek, akkor felveszi azokat az állományba. (A szunido.cache állományt a formail hozza létre ügyelve arra, hogy mindig a legfrissebb feladók neveit rátolja maximum 8192 bájt méretben.) Ha a feladó még nem szerepelt az adatbázisban, akkor automatikusan választ kap.

source: As you can see, the following recipe has comments B<between> the conditions. This is allowed. Do B<not> put comments on the same line as a condition though.
hu: Ahogy látható a szűrési feltételek sorában megjegyzések is B<elhelyezhetők>. B<soha se> tegyünk megjegyzést az összehasonlítást végző sorokba.

source: SHELL=/bin/sh # for other shells, this might need adjustment
hu: SHELL=/bin/sh # shelltől függően adjuk meg

source: :0 Whc: vacation.lock # Perform a quick check to see if the mail was addressed to us * $^To:.*\eE<lt>$\eLOGNAME\eE<gt> # Don't reply to daemons and mailinglists * !^FROM_DAEMON # Mail loops are evil * !^X-Loop: your@own.mail.address | formail -rD 8192 vacation.cache
hu: :0 Whc: szunido.lock # Ellenőrizzük, hogy a levél nekünk lett-e címezve * $^To:.*\eE<lt>$\eLOGNAME\eE<gt> # Levelezőlistákra és felügyelő programoknak nem küldünk választ * !^FROM_DAEMON # Körkörös levélküldés megakadályozása * !^X-Loop: sajat@emailcimed | formail -rD 8192 szunido.cache

source: :0 ehc # if the name was not in the cache | (formail -rI"Precedence: junk" \e -A"X-Loop: your@own.mail.address" ; \e echo "I received your mail,"; \e echo "but I won't be back until Monday."; \e echo "-- "; cat $HOME/.signature \e ) | $SENDMAIL -oi -t
hu: :0 ehc # ha a feladó még nem szerepelt az adatbázisban | (formail -rI"Precedence: junk" \e -A"X-Loop: sajat@emailcimed" ; \e echo "Megkaptam az üzenetedet,"; \e echo "de csak HÉTFŐN vagyok legközelebb."; \e echo "-- "; cat $HOME/.signature \e ) | $SENDMAIL -oi -t

source: Store all messages concerning TeX in separate, unique filenames, in a directory named texmail (this directory has to exist); there is no need to use lockfiles in this case, so we won't.
hu: TeX-el foglalkozó levelek texmail könyvtárban (a könyvtárat külön létre kell hozni) tárolásához egyedi állománynevekkel a következőképen oldható meg:

source: The same as above, except now we store the mails in numbered files (MH mail folder).
hu: Ugyanezt, de nem egyedi, hanem számozott névvel (MH mappa) elmentett levelekhez ezt kell használni:

source: Or you could file the mail in several directory folders at the same time. The following recipe will deliver the mail to two MH-folders and one directory folder. It is actually only one file with two extra hardlinks.
hu: Mindezek mellett egyszerre több helyre is lehet irányítani a leveleket. A következőkben két MH mappába és egy könyvtárba kerül a levél és másolatai. Ez majdnem olyan mintha egy állományba mentenénk, de a másikkal "keménykötéssel" (hardlink) összekapcsolnánk.

source: :0 * (^TO|^Subject:.*)TeX[^t] texmail/. wordprocessing dtp/.
hu: :0 * (^TO|^Subject:.*)TeX[^t] texmail/. szovegszerkesztes dtp/.

source: Store all the messages about meetings in a folder that is in a directory that changes every month. E.g. if it were January 1994, the folder would have the name `94-01/meeting' and the locallockfile would be `94-01/meeting.lock'.
hu: Az összes megbeszélésről szóló levelet egy olyan mappába irányíthatjuk, amely mondjuk havonta változik a következő megoldással. Pl. 1994. januárban a könyvtár neve 94-01 lenne, a levelek pedig a 94-01/megbeszeles mappába kerülnének, a záróállomány neve pedig `94-01/megbeszeles.lock' lenne.

source: :0: * meeting `date +%y-%m`/meeting
hu: :0: * megbeszeles `date +%y-%m`/megbeszeles

source: The same as above, but, if the `94-01' directory wouldn't have existed, it is created automatically:
hu: Mint fenn, de ha még nem létezne a `94-01' könyvtár, akkor automatikusan létre lesz hozva.

source: :0: * meeting ${MONTHFOLDER}/meeting
hu: :0: * megbeszeles ${MONTHFOLDER}/megbeszeles

source: The same as above, but now by slightly different means:
hu: Egy kicsit másként kivitelezve ugyanaz:

source: If you are subscribed to several mailinglists and people cross-post to some of them, you usually receive several duplicate mails (one from every list). The following simple recipe eliminates duplicate mails. It tells formail to keep an 8KB cache file in which it will store the Message-IDs of the most recent mails you received. Since Message-IDs are guaranteed to be unique for every new mail, they are ideally suited to weed out duplicate mails. Simply put the following recipe at the top of your rcfile, and no duplicate mail will get past it.
hu: Azok, akik több levelezőlista tagjai és ahol a tagok üzeneteiket több helyre is elküldik, sokszor szeretnének ezektől a duplikált levelektől megszabadulni automatikusan. A következő szűrővel ezeket az ismétlődő leveleket lehet kitöröltetni. A trükk, hogy egy 8 KB-os állományban tároljuk a legfrissebb levelek Message-ID-it (levélazonosítóit). Mivel a Message-ID-k egyediek , ezért ezek alapján könnyű megkeresni az ismétlődő leveleket. Hogy egyetlen ismétlődő levél se jusson át a szűrésen, érdemes a konfigurációs állomány legelejére tenni azt.

source: B<Beware> if you have delivery problems in recipes below this one and procmail tries to requeue the mail, then on the next queue run, this mail will be considered a duplicate and will be thrown away. For those not quite so confident in their own scripting capabilities, you can use the following recipe instead. It puts duplicates in a separate folder instead of throwing them away. It is up to you to periodically empty the folder of course.
hu: B<Azonban> levéltovábbítási hibák esetén ezzel a szűrővel törlődhetnek olyan levelek, amelyeket nem akartunk töröltetni, mivel a procmail újra megpróbálja továbbítani a levelet a hiba esetén, azonban a Message-ID-k alapján ekkor már duplikált leveleknek fogja tekinteni a leveleket, s törli azokat. Így azok, akik még nem biztosak magukban a következő szűrőt használják. Ez a szűrő a duplikált leveleket nem törli, hanem egy külön mappába helyezi. Természetesen ezt a mappát időnként majd üríteni szükséges.

source: :0 a: duplicates
hu: :0 a: duplikaltak

source: When delivering to emacs folders (i.e., mailfolders managed by any emacs mail package, e.g., RMAIL or VM) directly, you should use emacs-compatible lockfiles. The emacs mailers are a bit braindamaged in that respect, they get very upset if someone delivers to mailfolders which they already have in their internal buffers. The following recipe assumes that $HOME equals /home/john.
hu: Emacs mappák használata (pl. emacs-on alapuló levelezőprogramok -- RMAIL, VM, stb. -- levélmappái) esetén ügyelni kell arra, hogy emacs kompatíbilis záróállományt hozzunk létre. Az emacs-os programok érzékenyek arra, ha nem megfelelőek a záróállományok. Legyen a $HOME pl. /home/jani , ekkor a következő szűrőt érdemes használunk:

source: :0:/usr/local/lib/emacs/lock/!home!john!Mail!mailbox * ^Subject:.*whatever mailbox
hu: :0:/usr/local/lib/emacs/lock/!home!jani!Mail!mailbox * ^Subject:.*valami mailbox

source: Alternatively, you can have procmail deliver into its own set of mailboxes, which you then periodically empty and copy over to your emacs files using B<movemail>. Movemail uses mailbox.lock local lockfiles per mailbox. This actually is the preferred mode of operation in conjunction with procmail.
hu: Emellett azt is meg lehet tenni, hogy a procmail-lel egy külön levélmappába válogatjuk a leveleket és időközönként a B<movemail> programmal másoltatjuk a megfelelő emacs állományba. A movemail minden egyes levélmappán záróállományt helyez el, mint a procmail működése közben.

source: To extract certain headers from a mail and put them into environment variables you can use any of the following constructs:
hu: Levél bizonyos részeinek környezeti változóba tárolásához a következő módszert lehet használni:

source: SUBJECT=`formail -xSubject:` # regular field FROM=`formail -rt -xTo:` # special case
hu: SUBJECT=`formail -xSubject:` # általános módi FROM=`formail -rt -xTo:` # speckó eset

source: :0 h # alternate method KEYWORDS=| formail -xKeywords:
hu: :0 h # harmadik módszer KEYWORDS=| formail -xKeywords:

source: If you are using temporary files in a procmailrc file, and want to make sure that they are removed just before procmail exits, you could use something along the lines of:
hu: A konfigurációs állományban megadott ideiglenes fileoktól a procmailből való kilépés előtt az alábbi módon szabadulhatunk meg biztosan:

source: The TRAP keyword can also be used to change the exitcode of procmail. I.e. if you want procmail to return an exitcode of `1' instead of its regular exitcodes, you could use:
hu: A TRAP kulcsszóval a procmail kilépéskódját (exitcode) is meg lehet változtatni. Pl. ha azt szeretnénk, hogy a kilépéskód 1 legyen a valós kód helyett, akkor a következőre van szükségünk:

source: EXITCODE="" TRAP="exit 1;" # The trailing semi-colon is important # since exit is not a standalone program
hu: EXITCODE="" TRAP="exit 1;" # fontos a pontosvessző # mivel az exit nem egy önálló program

source: Or, if the exitcode does not need to depend on the programs run from the TRAP, you can use a mere:
hu: Vagy ha nem szükséges TRAP-on keresztül átadni a kilépéskódot, akkor használjuk egyszerűen csak ezt:

source: The following recipe prints every incoming mail that looks like a postscript file.
hu: A következő szűrővel az összes postscript formájú levelet automatikusan kinyomtathatjuk.

source: The following recipe does the same, but is a bit more selective. It only prints the postscript file if it comes from the print-server. The first condition matches only if it is found in the header. The second condition only matches at the start of the body.
hu: A következő szűrő kicsit intelligensebb, mert csak a nyomtatószerverről érkező postscript állományokat próbálja meg kinyomtatni. Az első feltétel csak a megfelelő fejléc esetén érvényesül, míg a második csak akkor, ha a levél törzse a megfelelő kódot tartalmazza.

source: Likewise:
hu: Vagy így:

source: Suppose you have two accounts, you use both accounts regularly, but they are in very distinct places (i.e., you can only read mail that arrived at either one of the accounts). You would like to forward mail arriving at account one to account two, and the other way around. The first thing that comes to mind is using .forward files at both sites; this won't work of course, since you will be creating a mail loop. This mail loop can be avoided by inserting the following recipe in front of all other recipes in the $HOME/.procmailrc files on both sites. If you make sure that you add the same X-Loop: field at both sites, mail can now safely be forwarded to the other account from either of them.
hu: Ha két különböző helyen van felhasználói azonosítód (account), és szeretnéd, ha mindkét helyen ugyanazok a leveleket olvashatnád, akkor egy egyszerű levél átirányítás (forward) nem lenne nyerő, mivel ezzel a leveleket a két cím között végtelenségig küldözgetnéd (mail loop). Ennek elkerülésére alkalmas a $HOME/.procmailrc elejére beszúrni az alábbi szűrőt. A lényeg, hogy mindkét helyen az X-Loop: -nak ugyanazt az értéket kell megadni, mert ekkor csak a szükséges levelek kerülnek továbbításra a másik címre.

source: :0 c * !^X-Loop: yourname@your.main.mail.address | formail -A "X-Loop: yourname@your.main.mail.address" | \e $SENDMAIL -oi yourname@the.other.account
hu: :0 c * !^X-Loop: neved@emailcimed | formail -A "X-Loop: neved@emailcimed" | \e $SENDMAIL -oi neved@emailcimed

source: If someone sends you a mail with the word `retrieve' in the subject, the following will automatically send back the contents of info_file to the sender. Like in all recipes where we send mail, we watch out for mail loops.
hu: A levél tárgyában elhelyezett `retrieve' (küldés) parancsra az alábbi szűrő egy kiválasztott állományt fog automatikusan visszaküldeni. Itt is ügyelni kell, hogy a szűrő csak a megfelelő esetben válaszoljon (levelezőlistáknak, saját magunknak ne válaszoljon!).

source: Now follows an example for a very simple fileserver accessible by mail. For more demanding applications, I suggest you take a look at B<SmartList> (available from the same place as the procmail distribution). As listed, this fileserver sends back at most one file per request, it ignores the body of incoming mails, the Subject: line has to look like "Subject: send file the_file_you_want" (the blanks are significant), it does not return files that have names starting with a dot, nor does it allow files to be retrieved that are outside the fileserver directory tree (if you decide to munge this example, make sure you do not inadvertently loosen this last restriction).
hu: A következőkben egy egyszerű emaillel működtethető fileszervert mutatunk be. Azonban, ha ilyen kiszolgálót szeretnénk működtetni, akkor inkább ajánljuk a B<SmartList> programot (amely ugyanonnan beszerezhető ahonnan a procmail csomag). A fileszerver maximum 1 állományt küld el a kérésnek megfelelően, a levél tartalmát nem veszi figyelembe, mivel csak az alábbi felépítésű levéltárgyát fogadja el; "Subject: send file amitszeretnenek" (a szóközök fontosak). (Mg. A magyarosított levelezőprogramok a Subject: mező helyett Tárgy: mezőt használhatnak, ez esetben a szűrőt értelemszerűen módosítani szükséges.) Rejtett állományokat és a megadott könyvtáron kívül

source: :0 * ^Subject: send file [0-9a-z] * !^X-Loop: yourname@your.main.mail.address * !^Subject:.*Re: * !^FROM_DAEMON * !^Subject: send file .*[/.]\e. { MAILDIR=$HOME/fileserver # chdir to the fileserver directory
hu: :0 * ^Subject: send file [0-9a-z] * !^X-Loop: neved@emailcimed * !^Subject:.*Re: * !^FROM_DAEMON * !^Subject: send file .*[/.]\e. { MAILDIR=$HOME/fileserver # lekérhető állományok helye

source: :0 fhw # reverse mailheader and extract name * ^Subject: send file \e/[^ ]* | formail -rA "X-Loop: yourname@your.main.mail.address"
hu: :0 fhw # válaszlevél létrehozása * ^Subject: send file \e/[^ ]* | formail -rA "X-Loop: neved@emailcimed"

source: FILE="$MATCH" # the requested filename
hu: FILE="$MATCH" # az elküldendő állomány neve

source: The following example preconverts all plain-text mail arriving in certain encoded MIME formats into a more compact 8-bit format which can be used and displayed more easily by most programs. The B<mimencode>(1) program is part of Nathaniel Borenstein's metamail package.
hu: A következő szűrővel a megadott MIME kódolású leveleket a sokkal kezelhetőbb 8-bites formátumra lehet átalakítani. A szükséges B<mimencode>(1) program Nathaniel Borenstein metamail csomagjában található.
