Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailrc.5.po
Languages: pl

source: Global semaphore file. If this file already exists, procmail will wait until it has gone before proceeding, and will create it itself (cleaning it up when ready, of course). If more than one I<lockfile> are specified, then the previous one will be removed before trying to create the new one. The use of a global lockfile is discouraged, whenever possible use locallockfiles (on a per recipe basis) instead.
pl: Globalny plik blokujący. Jeśli plik ten już istnieje, procmail będzie czekał aż zniknie i utworzy go samodzielnie (i wyczyści gdy skończy). Jeśli podano więcej niż jeden I<plik blokujący>, to poprzedni zostanie usunięty przed próbą utworzenia nowego. Używanie globalnego pliku blokującego jest złą praktyką, lepiej używać lokalnych (zależnych od reguły).

source: Default extension that is appended to a destination file to determine what local I<lockfile> to use (only if turned on, on a per-recipe basis).
pl: Domyślne rozszerzenie, które jest dodawane do plików docelowych, aby określić, którego z lokalnych I<plików blokujących> użyć (tylko jeśli używanie tych plików jest włączone dla danej reguły).

source: Number of seconds procmail will sleep before retrying on a I<lockfile> (if it already existed); if not specified, it defaults to 8 seconds.
pl: Liczba sekund, które procmail ma odespać przed każdą kolejną próbą użycia pliku blokującego (jeśli taki już istniał); jeśli liczby nie podano, to wynosi ona 8 sekund.

source: Number of seconds that have to have passed since a I<lockfile> was last modified/created before procmail decides that this must be an erroneously leftover lockfile that can be removed by force now. If zero, then no timeout will be used and procmail will wait forever until the lockfile is removed; if not specified, it defaults to 1024 seconds. This variable is useful to prevent indefinite hangups of B<sendmail>/procmail. Procmail is immune to clock skew across machines.
pl: Liczba sekund, które muszą minąć od utworzenia lub ostatniej modyfikacji I<pliku blokującego>, zanim procmail zdecyduje, że jest to plik blokujący pozostawiony w wyniku błędu i że trzeba go usunąć na siłę. Wartość zero mówi, że timeout nie jest ustawiony i że procmail ma czekać do skutku. Jeśli nie jest podany, to odpowiada 1024 sekundom. Wartość ta jest przydatna w zapobieganiu niezdefiniowanym zawieszeniom programów B<sendmail>(8) lub procmail. Procmail jest odporny na różnice w czasie lokalnym na różnych komputerach.

source: Number of seconds that have to have passed before procmail decides that some child it started must be hanging. The offending program will receive a TERMINATE signal from procmail, and processing of the rcfile will continue. If zero, then no timeout will be used and procmail will wait forever until the child has terminated; if not specified, it defaults to 960 seconds.
pl: Liczba sekund, które muszą minąć zanim procmail zdecyduje, że dziecko, które uruchomił, musiało się zawiesić. Program odbierze od procmaila sygnał I<TERMINATE>, a przetwarzanie pliku rc pójdzie dalej. Jeśli podano zero, to nie będzie tu używany czas oczekiwania i procmail będzie czekać do skutku; jeśli zmienna nie jest podana, wartość domyślna odpowiada 960 sekundom.

source: Filename prefix that is used when delivering to a directory (not used when delivering to a maildir or an MH directory).
pl: Przedrostek nazwy pliku, który jest używany w wypadku dostarczania do katalogu (nie używany w katalogach maildir lub MH).

source: If this is not the I<hostname> of the machine, processing of the current I<rcfile> will immediately cease. If other rcfiles were specified on the command line, processing will continue with the next one. If all rcfiles are exhausted, the program will terminate, but will not generate an error (i.e., to the mailer it will seem that the mail has been delivered).
pl: Jeśli nie jest to I<nazwa bieżącego komputera>, to przetwarzanie bieżącego I<pliku rc> zostaje natychmiast przerywane. Jeśli w linii komend podano inne pliki rc, to przetwarzanie będzie kontynuowane z następnym z nich. Jeśli wykorzystane zostaną wszystkie pliki rc, program zakończy pracę, lecz nie wygeneruje błędu (np. mailer będzie sądził, że wiadomość została dostarczona).

source: The name says it all (if it doesn't, then forget about this one :-). Anything assigned to UMASK is taken as an B<octal> number. If not specified, the umask defaults to 077. If the umask permits o+x, all the mailboxes procmail delivers to directly will receive an o+x mode change. This can be used to check if new mail arrived.
pl: Nazwa mówi za siebie (jeśli nie, zapomnij o tym :-). Cokolwiek zostanie przypisane do zmiennej B<UMASK> jest interpretowane jako wartość B<ósemkowa>. Jeśli nie jest podana, to domyślna wartość maski wynosi 077. Jeśli maska zezwala na ustawienie o+x, to owo o+x zostanie dodane do praw dostępu wszystkich skrzynek pocztowych, do których procmail dostarcza pocztę bezpośrednio. Może to być używane do sprawdzania, czy przybyła nowa poczta.

source: If any of the characters in SHELLMETAS appears in the line specifying a filter or program, the line will be fed to $SHELL instead of being executed directly.
pl: Jeśli jakikolwiek ze znaków wymienionych w B<SHELLMETAS> pojawi się w linii określającej filtr lub program, to linia zostanie przekazana powłoce B<$SHELL>, a nie zostanie wywołana bezpośrednio.

source: Any invocation of $SHELL will be like:
pl: Każde wywołanie powłoki B<$SHELL> będzie następujące:

source: If you're not using the I<forwarding> facility don't worry about this one. It specifies the program being called to forward any mail.
pl: Jeśli nie używa się właściwości I<forwardowania>, nie należy się tym przejmować. Określa to program wzywany do forwardowania poczty.

source: It gets invoked as: "$SENDMAIL" $SENDMAILFLAGS "$@";
pl: Jest wywoływany jako: "$SENDMAIL" $SENDMAILFLAGS "$@";

source: Number of retries that are to be made if any `B<process table full>', `B<file table full>', `B<out of memory>' or `B<out of swap space>' error should occur. If this number is negative, then procmail will retry indefinitely; if not specified, it defaults to 4 times. The retries occur with a $SUSPEND second interval. The idea behind this is that if, e.g., the I<swap> I<space> has been exhausted or the I<process> I<table> is full, usually several other programs will either detect this as well and abort or crash 8-), thereby freeing valuable I<resources> for procmail.
pl: Liczba powtórek, które mają być dokonane po wystąpieniu jednego z błędów "B<process table full>", "B<file table full>", "B<out of memory>" lub "B<out of swap space>". Jeśli liczba ta jest ujemna, procmail będzie próbował wiecznie; jeśli nie jest podana, odpowiada wartości 4. Powtórki zachodzą co każde B<$SUSPEND> sekund. Idea, która się za tym kryje, jest taka, że jeśli np. całkowicie wykorzystane zostały I<obszar> I<pamięci wymiany> lub I<tablica> I<procesów>, to wiele innych programów wykryje to także i przerwie działanie lub "padnie", zwalniając cenne I<zasoby> procmailowi.

source: Number of seconds that procmail will pause if it has to wait for something that is currently unavailable (memory, fork, etc.); if not specified, it will default to 16 seconds. See also: B<LOCKSLEEP>.
pl: Liczba sekund, podczas których procmail będzie czekał, jeśli musi, na coś, co obecnie jest niedostępne (pamięć, fork, itd.); jeśli nie podano, to wartością domyślną jest 16 sekund. Zobacz także: B<LOCKSLEEP>.

source: Length of the internal line buffers, cannot be set smaller than 128. All lines read from the I<rcfile> should not exceed $LINEBUF characters before and after expansion. If not specified, it defaults to 2048. This limit, of course, does I<not> apply to the mail itself, which can have arbitrary line lengths, or could be a binary file for that matter. See also PROCMAIL_OVERFLOW.
pl: Długość wewnętrznych buforów liniowych, nie może być mniejsza niż 128. Wszystkie linie odczytywane z I<pliku rc> nie powinny mieć więcej niż B<$LINEBUF> znaków przed i po rozszerzeniu. Jeśli wartość nie jest podana, odpowiada 2048. Limitu tego oczywiście I<nie> stosuje się do samego listu, który może mieć dowolne długości linii lub może być plikiem binarnym. Patrz także opis B<PROCMAIL_OVERFLOW>.

source: If set to `yes' procmail will pretend (to the mail agent) the mail has been delivered. If mail cannot be delivered after having met this assignment (set to `yes'), the mail will be lost (i.e., it will not bounce).
pl: Jeśli ustawione na "yes", to procmail będzie udawał przed agentem pocztowym, że poczta została dostarczona. Jeśli poczta nie mogła być dostarczona po napotkaniu tego ustawienia, zostanie utracona (tj. nie będzie zwrócona do nadawcy).

source: When procmail terminates of its own accord and not because it received a signal, it will execute the contents of this variable. A copy of the mail can be read from stdin. Any output produced by this command will be appended to $LOGFILE. Possible uses for TRAP are: removal of temporary files, logging customised abstracts, etc. See also B<EXITCODE> and B<LOGABSTRACT>.
pl: Gdy procmail będzie kończył działanie, ale nie z powodu otrzymania sygnału, to wywoła zawartość tej zmiennej. Kopia listu może być odczytana ze stdin. Wszelkie wyjście wyprodukowane przez tę komendę będzie dodane do pliku B<$LOGFILE>. Przykładowe zastosowania B<TRAP> to: usuwanie plików tymczasowych, logowanie własnych uzupełnień, itp. Zobacz także B<EXITCODE> i B<LOGABSTRACT>.

source: By default, procmail returns an exitcode of zero (success) if it successfully delivered the message or if the B<HOST> variable was misset and there were no more rcfiles on the command line; otherwise it returns failure. Before doing so, procmail examines the value of this variable. If it is set to a positive numeric value, procmail will instead use that value as its exitcode. If this variable is set but empty and B<TRAP> is set, procmail will set the exitcode to whatever the B<TRAP> program returns. If this variable is not set, procmail will set it shortly before calling up the B<TRAP> program.
pl: Domyślne procmail zwraca zerowy kod błędu (oznaczający powodzenie), jeśli udało mu się poprawnie dostarczyć list lub gdy zmienna B<HOST> nie była ustawiona na nazwę bieżącego komputera, a w linii poleceń nie podano kolejnych plików rc. W przeciwnym wypadku zwracany jest błąd. Przed zakończeniem jednakże procmail sprawdza wartość tej zmiennej. Jeśli została ustawiona na dodatnią wartość numeryczną, procmail użyje jej jako kodu wyjścia. Jeśli zmienna ta jest ustawiona, lecz pusta, procmail ustawi kod wyjścia na wartość zwracaną przez program B<TRAP>. Jeśli zmienna ta nie została ustawiona, procmail ustawi ją na krótko przed wywołaniem programu B<TRAP>.

source: This variable is assigned to by procmail whenever it is delivering to a folder or program. It always contains the name of the last file (or program) procmail delivered to. If the last delivery was to several directory folders together then $LASTFOLDER will contain the hardlinked filenames as a space separated list.
pl: Zmienna ta jest inicjowana przez procmail za każdym razem, gdy dostarcza coś jakiemuś folderowi lub programowi. Zawsze zawiera nazwę ostatniego foldera (lub programu), do którego coś dostarczano. Jeśli ostatnie dostarczenie obejmowało łącznie kilka folderów, to B<$LASTFOLDER> będzie zawierał nazwy wszystkich plików (będących de facto dowiązaniami twardymi) jako listę rozdzieloną spacjami.

source: This variable is assigned to by procmail whenever it is told to extract text from a matching regular expression. It will contain all text matching the regular expression past the `B<\e/>' token.
pl: Zmienna ta jest inicjowana przez procmail za każdym razem, gdy ma wyciągnąć tekst z wyrażenia regularnego. Będzie zawierać cały tekst odpowiadającego wyrażenia regularnego występującego po żetonie "B<\e/>".

source: Assigning a positive value to this variable has the same effect as the `shift' command in B<sh>(1). This command is most useful to extract extra arguments passed to procmail when acting as a generic mailfilter.
pl: Przypisanie dodatniej wartości tej zmiennej daje taki sam rezultat, jak komenda "shift" w B<sh>(1). Komenda ta jest najbardziej użyteczna do wyciągania dodatkowych argumentów podanych procmailowi działającemu jako filtr pocztowy.

source: Names an rcfile (relative to the current directory) which will be included here as if it were part of the current rcfile. Nesting is permitted and only limited by systems resources (memory and file descriptors). As no checking is done on the permissions or ownership of the rcfile, users of B<INCLUDERC> should make sure that only trusted users have write access to the included rcfile or the directory it is in. Command line assignments to B<INCLUDERC> have no effect.
pl: Nazywa plik rc (względny w stosunku do bieżącego katalogu), który powinien być włączony jako część bieżącego pliku rc. Dozwolone jest nieograniczone zagnieżdżanie (limitowane tylko przez zasoby systemowe takie jak pamięć czy liczba dostępnych deskryptorów plików). Ponieważ nie są są sprawdzane ani uprawnienia, ani właściciel pliku rc, użytkownicy B<INCLUDERC> powinni się upewnić, że tylko zaufani użytkownicy mają prawa do zapisu włączanego pliku rc i do katalogu, w którym się ten plik znajduje. Przypisanie zmiennej B<INCLUDERC> wartości w linii poleceń nie ma żadnego efektu.

source: Names an rcfile (relative to the current directory) to which processing will be switched. If the named rcfile doesn't exist or is not a normal file or /dev/null then an error will be logged and processing will continue in the current rcfile. Otherwise, processing of the current rcfile will be aborted and the named rcfile started. Unsetting B<SWITCHRC> aborts processing of the current rcfile as if it had ended at the assignment. As with B<INCLUDERC>, no checking is done on the permissions or ownership of the rcfile and command line assignments have no effect.
pl: Nazywa plik rc (względny w stosunku do bieżącego katalogu), na który powinno się przełączyć przetwarzanie. Jeśli podany plik rc nie istnieje, nie jest zwykłym plikiem ani plikiem I</dev/null>, to zostanie wypisany błąd i będzie kontynuowane przetwarzanie bieżącego pliku rc. W przeciwnym razie przetwarzanie bieżącego pliku rc zostanie przerwane i rozpocznie się przetwarzanie pliku podanego jako wartość tej zmiennej. Jeśli zmienna B<SWITCHRC> zostanie usunięta, to procmail przerywa przetwarzanie bieżącego pliku, tak jakby plik ten się kończył na linii usuwającej tę zmienną. Podobnie jak w przypadku B<INCLUDERC> nie są są sprawdzane ani uprawnienia, ani właściciel pliku rc, a przypisanie tej zmiennej wartości w linii poleceń nie ma żadnego efektu.

source: The version number of the running procmail binary.
pl: Numer wersji działającego procmaila.

source: This variable will be set to a non-empty value if procmail detects a buffer overflow. See the B<BUGS> section below for other details of operation when overflow occurs.
pl: Zmienna ta zostanie ustawiona na niepustą wartość, jeśli procmail wykryje przepełnienie bufora. Patrz rozdział B<BŁĘDY> poniżej po opis innych działań podejmowanych po wykryciu przepełnienia bufora.

source: B<Comsat>(8)/B<biff>(1) notification is on by default, it can be turned off by setting this variable to `no'. Alternatively the biff-service can be customised by setting it to either `service@', `@hostname', or `service@hostname'. When not specified it defaults to biff@localhost.
pl: Notyfikacja B<comsat>(8)/B<biff>(1) domyślnie jest włączona, lecz można ją wyłączyć przez ustawienie tej zmiennej na "no". Alternatywnie, usługę biff można dokonfigurować przez ustawienie zmiennej na "service@", "@hostname" lub "sevice@hostname". Wartością domyślną jest biff@localhost.

source: If set to `yes' procmail will drop all privileges it might have had (suid or sgid). This is only useful if you want to guarantee that the bottom half of the /etc/procmailrc file is executed on behalf of the recipient.
pl: Jeśli jest to ustawione na "yes", procmail porzuci wszelkie uprawnienia (suid lub sgid), jakie może mieć. Opcja ta jest użyteczna, aby zagwarantować, że dolna część pliku I</etc/procmailrc> jest wywoływana w imieniu odbiorcy.

source: Extended regular expressions
pl: Rozszerzone wyrażenia regularne

source: Start of a line.
pl: Początek linii.

source: End of a line.
pl: Koniec linii.

source: Any character except a newline.
pl: Dowolny znak poza znakiem nowej linii.

source: Any sequence of zero or more a's.
pl: Dowolna sekwencja składająca się z zera lub więcej znaków "a".

source: Any sequence of one or more a's.
pl: Dowolna sekwencja składająca się z jednego lub więcej znaków "a".

source: Either zero or one a.
pl: Ciąg pusty albo jeden znak "a".

source: Any character which is B<not> either a dash, a, b, c, d or newline.
pl: Dowolny znak, który B<nie> jest kreską, znakiem "a", "b", "c" lub "d", lub znakiem nowej linii.

source: Either the sequence `de' or `abc'.
pl: Albo sekwencja "de", albo "abc".

source: Zero or more times the sequence `abc'.
pl: Zero lub więcej sekwencji "abc".

source: Matches a single dot; use \e to quote any of the magic characters to get rid of their special meaning. See also $\e variable substitution.
pl: Dopasowuje pojedynczą kropkę; należy użyć B<\e> przed którymkolwiek ze znaków specjalnych, aby pozbyć się jego specjalnego znaczenia. Patrz także opis podstawień zmiennych I<$\enazwa> w rozdziale B<BŁĘDY>.

source: These were only samples, of course, any more complex combination is valid as well.
pl: Były to tylko przykłady, oczywiście można używać również bardziej złożonych kombinacji.

source: The following token meanings are special procmail extensions:
pl: Następujące znaczenia żetonów są rozszerzeniami procmaila:

source: B<^> or B<$>
pl: B<^> lub B<$>

source: Match a newline (for multiline matches).
pl: Pasuje do znaku nowej linii (dla trafień wieloliniowych).

source: Anchor the expression at the very start of the search area, or if encountered at the end of the expression, anchor it at the very end of the search area.
pl: Zakotwicza wyrażenie na samym początku obszaru przeszukiwania lub jeśli napotkane na końcu wyrażenia, na samym końcu obszaru przeszukiwań.

source: B<\eE<lt>> or B<\eE<gt>>
pl: B<\eE<lt>> lub B<\eE<gt>>

source: Match the character before or after a word. They are merely a shorthand for `[^a-zA-Z0-9_]', but can also match newlines. Since they match actual characters, they are only suitable to delimit words, not to delimit inter-word space.
pl: Dopasowuje znak przed słowem lub po nim. Są to ogólnie skróty dla "[^a-zA-Z0-9_]", lecz mogą także dopasowywać znaki nowej linii. Ponieważ odpowiadają rzeczywistym znakom, nadają się tylko do oddzielania słów, nie do oddzielania przestrzeni między słowami.

source: Splits the expression in two parts. Everything matching the right part will be assigned to the MATCH environment variable.
pl: Dzieli wyrażenie na dwie części. Wszystko odpowiadające prawej stronie będzie przypisane do zmiennej środowiskowej B<MATCH>.

source: EXAMPLES
pl: PRZYKŁADY

source: Look in the B<procmailex>(5) man page.
pl: Patrz strona podręcznika B<procmailex>(5).

source: CAVEATS
pl: ZASTRZEŻENIA

source: Continued lines in an action line that specifies a program always have to end in a backslash, even if the underlying shell would not need or want the backslash to indicate continuation. This is due to the two pass parsing process needed (first procmail, then the shell (or not, depending on B<SHELLMETAS>)).
pl: Kontynuowane linie w linii akcji, która określa program, muszą zawsze kończyć się odwrotnym ukośnikiem, nawet jeśli używana powłoka nie potrzebuje lub nie chce odwrotnego ukośnika do wskazania kontynuacji. Jest tak z powodu dwustopniowego procesu przetwarzania (najpierw procmail, potem powłoka (lub nie, zależnie od B<SHELLMETAS>)).

source: Don't put comments on the regular expression condition lines in a recipe, these lines are fed to the internal egrep I<literally> (except for continuation backslashes at the end of a line).
pl: Nie wstawia komentarzy w regule w liniach warunkowych wyrażeń regularnych, linie te są przekazywane wewnętrznemu egrepowi I<wprost> (z wyjątkiem odwrotnych ukośników kontynuacji znajdujących się na końcu linii).

source: Leading whitespace on continued regular expression condition lines is usually ignored (so that they can be indented), but B<not> on continued condition lines that are evaluated according to the B<sh>(1) substitution rules inside double quotes.
pl: Początkowe białe spacje w kontynuowanych wyrażeniach regularnych są zazwyczaj ignorowane (więc linie mogą być wcięte), lecz B<nie> jest tak w kontynuowanych wyrażeniach warunkowych, które są odczytywane według reguł podstawiania B<sh>(1) wewnątrz podwójnych cudzysłowów.

source: Watch out for deadlocks when doing unhealthy things like forwarding mail to your own account. Deadlocks can be broken by proper use of B<LOCKTIMEOUT>.
pl: Uwaga na deadlocki podczas wykonywania niezdrowych rzeczy jak przekazywanie poczty na swoje własne konto. Deadlocki można złamać przez właściwe użycie B<LOCKTIMEOUT>.

source: Any default values that procmail has for some environment variables will B<always> override the ones that were already defined. If you really want to override the defaults, you either have to put them in the B<rcfile> or on the command line as arguments.
pl: Wszelkie domyślne wartości, których procmail używa dla zmiennych środowiskowych B<zawsze> przeciążą te, które były wcześniej zdefiniowane. Aby naprawdę przeciążyć wartości domyślne, należy je albo wstawić do pliku rc, albo wypisać w linii poleceń jako argumenty.

source: The /etc/procmailrc file cannot change the PATH setting seen by user rcfiles as the value is reset when procmail finishes the /etc/procmailrc file. While future enhancements are expected in this area, recompiling procmail with the desired value is currently the only correct solution.
pl: Plik I</etc/procmailrc> nie może zmienić ustawienia zmiennej I<PATH> widzianej później przez pliki rc użytkowników \(em wartość tej zmiennej jest przywracana, gdy procmail kończy przetwarzanie pliku I</etc/procmailrc>. W przyszłości należy się spodziewać ulepszenia tego zachowania, jednakże obecnie jedynym rozwiązaniem jest przekompilowanie procmaila z żądaną wartością tej zmiennej.

source: Environment variables set B<inside> the shell-interpreted-`|' action part of a recipe will B<not> retain their value after the recipe has finished since they are set in a subshell of procmail. To make sure the value of an environment variable is retained you have to put the assignment to the variable before the leading `|' of a recipe, so that it can capture stdout of the program.
pl: Zmienne środowiskowe, ustawiane B<wewnątrz> interpretowanej przez powłokę części akcji reguły "|", B<nie> zachowają swoich wartości po zakończeniu reguły, gdyż są ustawiane w podpowłoce procmaila. Aby upewnić się, że wartość zostanie zachowana, należy dokonać przypisania przed początkowym znakiem "|" reguły, tak że może przechwycić stdout programu.

source: If you specify only a `h' or a `b' flag on a delivering recipe, and the recipe matches, then, unless the `c' flag is present as well, the body respectively the header of the mail will be silently lost.
pl: Jeśli w regule dostarczającej podana zostanie tylko flaga "h" lub "b" i reguła ta zostanie dopasowana, to jeżeli nie użyto flagi "c", ciało listu lub (odpowiednio) jego nagłówek zostaną utracone.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: BUGS
pl: BŁĘDY
