Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailrc.5.po
Languages: pl

source: NAME
pl: NAZWA

source: procmailrc - procmail rcfile
pl: procmailrc - plik rc procmaila

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: For a quick start, see B<NOTES> at the end of the B<procmail>(1) man page.
pl: Szybką orientację w temacie można uzyskać, czytając B<UWAGI> umieszczone na końcu strony podręcznika B<procmail>(1).

source: The rcfile can contain a mixture of environment variable assignments (some of which have special meanings to procmail), and recipes. In their most simple appearance, the recipes are simply one line regular expressions that are searched for in the header of the arriving mail. The first recipe that matches is used to determine where the mail has to go (usually a file). If processing falls off the end of the rcfile, procmail will deliver the mail to B<$DEFAULT>.
pl: Plik rc składa się z przypisań zmiennych środowiskowych (niektóre z nich mają specjalne znaczenie dla procmaila) i reguł. W najprostszej postaci, reguły są po prostu jednoliniowymi wyrażeniami regularnymi, które są poszukiwane w nagłówkach przychodzącej poczty. Pierwsza reguła, która zostanie dopasowana, jest używana do określenia, gdzie dany list ma pójść (zwykle do pliku). Jeśli przetwarzanie dojdzie do końca pliku rc, procmail dostarczy pocztę do B<$DEFAULT>.

source: There are two kinds of recipes: delivering and non-delivering recipes. If a I<delivering recipe> is found to match, procmail considers the mail (you guessed it) delivered and will I<cease processing> the rcfile after having successfully executed the action line of the recipe. If a I<non-delivering recipe> is found to match, processing of the rcfile will I<continue> after the action line of this recipe has been executed.
pl: Istnieją dwa rodzaje reguł: dostarczające i niedostarczające. Jeśli dopasowana zostanie I<reguła dostarczająca>, procmail zakłada, że poczta (jak się można domyślić) jest dostarczona i I<zakończy przetwarzanie> pliku rc po wykonaniu linii akcji reguły. Jeśli dopasowana zostanie I<reguła niedostarczająca>, to przetwarzanie pliku rc będzie I<kontynuowane> nawet po wykonaniu akcji tej reguły.

source: Delivering recipes are those that cause header and/or body of the mail to be: written into a file, absorbed by a program or forwarded to a mailaddress.
pl: Reguły dostarczające są tymi, które powodują zapis nagłówka lub ciała listu do pliku, jego zaabsorbowanie przez program lub przekazanie (forwardowanie) do innego adresu pocztowego.

source: Non-delivering recipes are: those that cause the output of a program or filter to be captured back by procmail or those that start a nesting block.
pl: Reguły niedostarczające to te, które łapią wyjście programu lub filtru z powrotem do procmaila, lub te, które rozpoczynają zagnieżdżony blok.

source: You can tell procmail to treat a I<delivering recipe> as if it were a non-delivering recipe by specifying the `c' flag on such a recipe. This will make procmail generate a I<carbon copy> of the mail by delivering it to this recipe, yet continue processing the rcfile.
pl: Można powiedzieć procmailowi, by traktował I<regułę dostarczającą> jako niedostarczającą poprzez przekazanie takiej regule flagi "c". Spowoduje to, że procmail wygeneruje kopię listu (I<carbon copy>), dostarczając go regule i kontynuując przetwarzanie pliku rc.

source: By using any number of recipes you can presort your mail extremely straightforward into several mailfolders. Bear in mind though that the mail can arrive concurrently in these mailfolders (if several procmail programs happen to run at the same time, not unlikely if a lot of mail arrives). To make sure this does not result in a mess, proper use of lockfiles is highly recommended.
pl: Używając dowolnej liczby reguł, można posortować pocztę wprost do określonych folderów pocztowych. Należy pamiętać jednak, że poczta może wpływać do tych folderów w tym samym momencie (jeśli kilka procmaili działa naraz, co nie jest nieprawdopodobne przy dużej ilości poczty). Aby upewnić się, że nie narobi to bałaganu, zalecane jest robienie właściwego użytku z plików blokujących.

source: The environment variable B<assignments> and B<recipes> can be freely intermixed in the rcfile. If any environment variable has a special meaning to procmail, it will be used appropriately the moment it is parsed (i.e., you can change the current directory whenever you want by specifying a new B<MAILDIR>, switch lockfiles by specifying a new B<LOCKFILE>, change the umask at any time, etc., the possibilities are endless :-).
pl: B<Inicjacje> zmiennych środowiskowych i B<reguły> mogą być swobodnie przeplatane w pliku rc. Jeśli zmienna środowiskowa ma dla procmaila specjalne znaczenie, zostanie użyta odpowiednio w momencie przetwarzania. (np. można zmienić katalog bieżący, kiedy tylko jest taka potrzeba, przez podanie nowego B<MAILDIR>, zamienić pliki blokujące przez podanie nowego B<LOCKFILE>, zmienić umask, itd., możliwości jest nieskończenie wiele :-).

source: The assignments and substitutions of these environment variables are handled exactly like in B<sh>(1) (that includes all possible quotes and escapes), with the added bonus that blanks around the '=' sign are ignored and that, if an environment variable appears without a trailing '=', it will be removed from the environment. Any program in backquotes started by procmail will have the entire mail at its stdin.
pl: Inicjacje i podstawienia tych zmiennych środowiskowych są obsługiwane dokładnie jak w B<sh>(1) (włączając w to wszystkie możliwe cytowania i sekwencje specjalne) i dodatkowo: spacje dookoła znaku "=" są ignorowane, a każda zmienna nie zawierająca końcowego "=" zostanie usunięta ze środowiska. Każdy program w odwrotnych apostrofach, uruchomiony przez procmail, będzie miał przekazany cały list na swoim wejściu (stdin).

source: Comments
pl: Komentarze

source: A word beginning with # and all the following characters up to a NEWLINE are ignored. This does not apply to condition lines, which cannot be commented.
pl: Słowo zaczynające się od # wraz z wszystkimi znakami występującymi po nim aż do znaku nowej linii jest ignorowane. Nie dotyczy to linii warunkowych, które nie mogą być komentowane.

source: Recipes
pl: Reguły

source: A line starting with ':' marks the beginning of a recipe. It has the following format:
pl: Linia zaczynająca się od ":" oznacza początek reguły. Ma następujący format:

source: Conditions start with a leading `*', everything after that character is passed on to the internal egrep B<literally>, except for leading and trailing whitespace. These regular expressions are B<completely> compatible to the normal B<egrep>(1) extended regular expressions. See also B<Extended regular expressions>.
pl: Warunki zaczynają się od "*" i wszystko, co następuje po tym znaku, jest przekazywane I<niezmienione> wewnętrznemu egrepowi, z wyjątkiem początkowych i końcowych białych spacji. Wyrażenia regularne są B<całkowicie> kompatybilne z normalnymi wyrażeniami regularnymi B<egrep>(1). Zobacz także B<Rozszerzone wyrażenia regularne>.

source: Conditions are anded; if there are no conditions the result will be true by default.
pl: Warunki są logicznie koniugowane; jeżeli nie ma warunków, wynik jest domyślnie prawdziwy.

source: I<Flags> can be any of the following:
pl: I<Flagi> mogą być dowolnymi z następujących:

source: Egrep the header (default).
pl: Egrepuj nagłówek (domyślnie).

source: Egrep the body.
pl: Egrepuj ciało.

source: Tell the internal egrep to distinguish between upper and lower case (contrary to the default which is to ignore case).
pl: Powiedz wewnętrznemu egrepowi, aby rozróżniał duże i małe litery (zachowaniem domyślnym jest ignorowanie wielkości liter).

source: This recipe will not be executed unless the conditions on the last preceding recipe (on the current block-nesting level) without the `A' or `a' flag matched as well. This allows you to chain actions that depend on a common condition.
pl: Ta reguła będzie zależeć od ostatniej poprzedzającej reguły (na bieżącym poziomie zagnieżdżenia) bez flagi "A" lub "a". Umożliwia to wiązanie akcji zależących od wspólnego warunku.

source: Has the same meaning as the `A' flag, with the additional condition that the immediately preceding recipe must have been I<successfully> completed before this recipe is executed.
pl: Ma takie samo znaczenie jak flaga "A" z dodatkowym warunkiem mówiącym, że bezpośrednio poprzedzająca reguła musi się I<pomyślnie> zakończyć przed uruchomieniem bieżącej reguły.

source: This recipe only executes if the immediately preceding recipe was not executed. Execution of this recipe also disables any immediately following recipes with the 'E' flag. This allows you to specify `else if' actions.
pl: Ta reguła jest wykonywana tylko, jeśli bezpośrednio poprzedzająca reguła nie była wykonana. Wykonanie tej reguły wyłącza także wszelkie bezpośrednio następujące reguły z flagą "E". Umożliwia to definiowanie akcji typu "else if".

source: This recipe only executes if the immediately preceding recipe I<failed> (i.e., the action line was attempted, but resulted in an error).
pl: Ta reguła jest wykonywana tylko, jeśli bezpośrednio poprzedzająca reguła się I<nie> powiodła (tj. podjęto próbę wykonania akcji, ale skończyła się ona błędem).

source: Feed the header to the pipe, file or mail destination (default).
pl: Przesyła nagłówek listu do potoku, pliku lub innego miejsca docelowego (domyślne).

source: Feed the body to the pipe, file or mail destination (default).
pl: Przesyła ciało listu do potoku, pliku lub innego miejsca docelowego (domyślne).

source: Consider the pipe as a filter.
pl: Zakłada, że potok jest filtrem.

source: Generate a B<carbon copy> of this mail. This only makes sense on I<delivering> recipes. The only non-delivering recipe this flag has an effect on is on a nesting block, in order to generate a carbon copy this will B<clone> the running procmail process (lockfiles will not be inherited), whereby the clone will proceed as usual and the parent will jump across the block.
pl: Generuje kopię B<carbon copy> tego listu. Ma to tylko sens dla reguł I<dostarczających>. Jedyną niedostarczającą regułą, dla której flaga ta ma jakiś skutek jest wypadek zagnieżdżonego bloku \(em w celu wygenerowania kopii proces procmaila zostanie B<sklonowany> (pliki blokujące nie zostaną odziedziczone); podczas gdy klon będzie pracować jak zwykle, rodzic przeskoczy blok.

source: Wait for the filter or program to finish and check its exitcode (normally ignored); if the filter is unsuccessful, then the text will not have been filtered.
pl: Czeka na zakończenie filtru lub programu i sprawdza kod wyjścia (normalnie ignorowany); jeśli filtr zwrócił błąd, tekst nie był filtrowany.

source: Has the same meaning as the `w' flag, but will suppress any `Program failure' message.
pl: Ma takie samo znaczenie jak flaga "w", lecz powstrzyma wszelkie informacje typu "Program failure".

source: Ignore any write errors on this recipe (i.e., usually due to an early closed pipe).
pl: Ignoruje wszelkie błędy zapisu na tej regule (np. zwykle przez wcześnie zamknięty potok).

source: Raw mode, do not try to ensure the mail ends with an empty line, write it out as is.
pl: Tryb surowy: nie próbuje zapewnić, że list kończy się pustą linią i zapisuje go takim, jakim jest.

source: There are some special conditions you can use that are not straight regular expressions. To select them, the condition must start with:
pl: Istnieją pewne warunki specjalne, których można użyć, a które nie są w pełni wyrażeniami regularnymi. Aby je wybrać, warunek musi zaczynać się od:

source: Invert the condition.
pl: Odwraca warunek.

source: Evaluate the remainder of this condition according to B<sh>(1) substitution rules inside double quotes, skip leading whitespace, then reparse it.
pl: Oszacowuje resztę warunku według reguł podstawiania B<sh>(1) wewnątrz podwójnych cudzysłowów, pomija początkowe białe spacje i ponownie przetwarza regułę.

source: Use the exitcode of the specified program.
pl: Używa kodu wyjścia podanego programu.

source: Check if the total length of the mail is shorter than the specified (in decimal) number of bytes.
pl: Sprawdza, czy całkowita długość listu jest krótsza niż podana (dziesiętnie) liczba bajtów.

source: Analogous to 'E<lt>'.
pl: Analogiczne do "E<lt>".

source: B<variablename >I<??>
pl: B<zmienna >I<??>

source: Match the remainder of this condition against the value of this environment variable (which cannot be a pseudo variable). A special case is if variablename is equal to `B', `H', `HB' or `BH'; this merely overrides the default header/body search area defined by the initial flags on this recipe.
pl: Porównuje resztę warunku z wartością tej zmiennej środowiskowej (nie może to być pseudozmienna). Specjalnymi wypadkami są zmienne "B", "H", "HB" i "BH", które zwyczajnie przeciążają domyślny obszar przeszukiwania nagłówka/ciała (header/body) zdefiniowanego na początku dla tej reguły.

source: To quote any of the above at the start of the line.
pl: Aby zacytować dowolny z powyższych znaków na początku linii.

source: Local lockfile
pl: Lokalny plik blokujący

source: If you put a second (trailing) ':' on the first recipe line, then procmail will use a I<locallockfile> (for this recipe only). You can optionally specify the locallockfile to use; if you don't however, procmail will use the destination filename (or the filename following the first 'E<gt>E<gt>') and will append $LOCKEXT to it.
pl: Jeśli umieści się drugi (kończący) ":" w pierwszej linii reguły, to procmail użyje I<lokalnego pliku blokującego> (locallockfile; tylko dla tej reguły). Opcjonalnie można podać nazwę pliku, który będzie użyty; jednak jeśli się tego nie zrobi, procmail użyje nazwy pliku celu (lub nazwy pliku następującej po pierwszym "E<gt>E<gt>") i dopisze do niej B<$LOCKEXT>.

source: Recipe action line
pl: Linia akcji reguły

source: The action line can start with the following characters:
pl: Linia akcji może zaczynać się od następujących znaków:

source: Forwards to all the specified mail addresses.
pl: Przekazuje (forwarduje) e-mail do wszystkich podanych adresów pocztowych.

source: Starts the specified program, possibly in $SHELL if any of the characters $SHELLMETAS are spotted. You can optionally prepend this pipe symbol with I<variable=>, which will cause stdout of the program to be captured in the environment I<variable> (procmail will B<not> terminate processing the rcfile at this point). If you specify just this pipe symbol, without any program, then procmail will pipe the mail to stdout.
pl: Uruchamia określony program, prawdopodobnie w B<$SHELL>-u, jeśli wykryto któryś ze znaków B<$SHELLMETAS>. Można opcjonalnie poprzedzić ten symbol potoku wyrażeniem I<zmienna=>, co spowoduje, że standardowe wyjście (stdout) programu zostanie przechwycone do zmiennej środowiskowej I<zmienna> (procmail I<nie> zakończy przetwarzania pliku rc w tym momencie). Jeśli podany zostanie tylko symbol potoku, bez żadnego programu, to procmail wypisze list na stdout.

source: Followed by at least one space, tab or newline will mark the start of a nesting block. Everything up till the next closing brace will depend on the conditions specified for this recipe. Unlimited nesting is permitted. The closing brace exists merely to delimit the block, it will I<not> cause procmail to terminate in any way. If the end of a block is reached processing will continue as usual after the block. On a nesting block, the flags `H' and `B' only affect the conditions leading up to the block, the flags `h' and `b' have no effect whatsoever.
pl: Jeśli następuje za tym przynajmniej jedna spacja, tabulacja lub nowa linia, to oznacza to początek zagnieżdżonego bloku. Wszystko, aż do następnego nawiasu zamykającego, będzie zależeć od warunków podanych dla tej reguły. Dozwolone jest nieograniczone zagnieżdżanie. Nawias zamykający istnieje zwyczajnie po to, by oddzielić blok; w żadnym wypadku I<nie> wywoła zakończenia procmaila w żaden sposób. Po dotarciu do końca bloku, przetwarzanie będzie kontynuowane, jak zwykle, po tym bloku. W bloku zagnieżdżonym flagi "H" i "B" dotyczą tylko warunków prowadzących do tego bloku, flagi "h" i "b" w ogóle nie działają.

source: Anything else will be taken as a mailbox name (either a filename or a directory, absolute or relative to the current directory (see MAILDIR)). If it is a (possibly yet nonexistent) filename, the mail will be appended to it.
pl: Wszystko inne będzie uznawane za nazwę skrzynki pocztowej (zarówno nazwę pliku lub katalogu, bezwzględną lub względną w stosunku do bieżącego katalogu (zobacz opis zmiennej B<MAILDIR>)). Jeśli jest to (możliwe że jeszcze nieistniejąca) nazwa pliku, poczta zostanie do niego doklejona.

source: If it is a directory, the mail will be delivered to a newly created, guaranteed to be unique file named $MSGPREFIX* in the specified directory. If the mailbox name ends in "/.", then this directory is presumed to be an MH folder; i.e., procmail will use the next number it finds available. If the mailbox name ends in "/", then this directory is presumed to be a maildir folder; i.e., procmail will deliver the message to a file in a subdirectory named "tmp" and rename it to be inside a subdirectory named "new". If the mailbox is specified to be an MH folder or maildir folder, procmail will create the necessary directories if they don't exist, rather than treat the mailbox as a non-existent filename. When procmail is delivering to directories, you can specify multiple directories to deliver to (procmail will do so utilising hardlinks).
pl: Jeśli jest to katalog, poczta zostanie dostarczona do nowo utworzonego, unikatowego pliku o nazwie I<$MSGPREFIX*> w podanym katalogu. Jeśli nazwa skrzynki pocztowej kończy się "/.", to katalog ten jest uznawany za folder MH, tj. procmail użyje następnego numeru, który będzie dostępny. Jeśli nazwa skrzynki pocztowej kończy się znakiem "/", to ten katalog jest uznawany za folder maildir, tj. procmail zapisze pocztę w pliku w podkatalogu o nazwie "tmp", a następnie przeniesie go do podkatalogu o nazwie "new". Jeśli skrzynka pocztowa jest podana jako folder MH lub maildir, procmail utworzy wymagane katalogi, jeśli nie istnieją, zamiast traktować skrzynkę pocztową jako nieistniejącą. Gdy procmail dostarcza do katalogów, można podać wiele katalogów, do których należy dostarczyć (procmail dostarczy pocztę, używając twardych dowiązań).

source: Environment variable defaults
pl: Domyślne wartości zmiennych środowiskowych

source: B<LOGNAME, HOME and SHELL>
pl: B<LOGNAME, HOME i SHELL>

source: Your (the recipient's) defaults
pl: Twoje (odbiorcy) wartości domyślne

source: during the processing of an /etc/procmailrc file, when it will be set to
pl: przetwarzania pliku I</etc/procmailrc>, w którego czasie zostanie ustawione na

source: (Unless B<-m> has been specified, in which case it is unset)
pl: (Chyba że podano B<-m>, wtedy opcja ta jest nieustawiona)

source: (Unless the name of the first successfully opened rcfile starts with `./' or if B<-m> has been specified, in which case it defaults to `.')
pl: (Chyba że nazwa pierwszego pomyślnie otwartego pliku rc zaczyna się od "./", w którym wypadku wartością domyślną jest ".")

source: The current hostname
pl: Nazwa bieżącego komputera

source: (If an rcfile is specified on the command line)
pl: (Jeśli plik rc jest podany w linii komend)

source: Other cleared or preset environment variables are IFS, ENV and PWD.
pl: Inne czyszczone lub preustawiane zmienne środowiskowe to IFS, ENV i PWD.

source: For security reasons, upon startup procmail will wipe out all environment variables that are suspected of modifying the behavior of the runtime linker.
pl: Z powodów bezpieczeństwa podczas startu procmail wyrzuci wszystkie zmienne środowiskowe, co do których ma podejrzenia, że mogą wpływać na działanie dynamicznego konsolidatora (B<ld.so>(8)).

source: Environment
pl: Środowisko

source: Before you get lost in the multitude of environment variables, keep in mind that all of them have reasonable defaults.
pl: Zanim zgubisz się w mętliku zmiennych środowiskowych, pamiętaj że wszystkie one mają sensowne wartości domyślne.

source: Current directory while procmail is executing (that means that all paths are relative to $MAILDIR).
pl: Bieżący katalog w momencie, gdy procmail jest uruchomiany (znaczy to, że wszystkie ścieżki są relatywne do B<$MAILDIR>).

source: Default B<mailbox> file (if not told otherwise, procmail will dump mail in this mailbox). Procmail will automatically use $DEFAULT$LOCKEXT as lockfile prior to writing to this mailbox. You do not need to set this variable, since it already points to the standard system mailbox.
pl: Domyślny plik B<mailbox> (jeśli nie powiedziano inaczej, procmail wrzuci pocztę do tego pliku). Procmail automatycznie użyje B<$DEFAULT$LOCKEXT> jako pliku blokującego przed zapisaniem czegoś do tej skrzynki pocztowej. Nie trzeba ustawiać tej zmiennej, ponieważ standardowo wskazuje ona na standardową skrzynkę pocztową systemu.

source: This file will also contain any error or diagnostic messages from procmail (normally none :-) or any other programs started by procmail. If this file is not specified, any diagnostics or error messages will be mailed back to the sender. See also B<LOGABSTRACT>.
pl: Plik ten będzie zawierał wszelkie komunikaty diagnostyczne i komunikaty o błędach od procmaila (zazwyczaj żadne) lub od innych programów uruchomionych przez procmaila. Jeśli plik ten nie jest podany, komunikaty będą przesyłane e-mailem z powrotem do nadawcy. Zobacz także B<LOGABSTRACT>.

source: You can turn on I<extended diagnostics> by setting this variable to `yes' or `on', to turn it off again set it to `no' or `off'.
pl: Ustawiając tę zmienną na "yes" lub "on", można włączyć I<rozszerzoną diagnostykę>, wyłączyć zaś można ją przez ustawienie zmiennej na "no" lub "off".

source: Just before procmail exits it logs an abstract of the delivered message in $LOGFILE showing the `From ' and `Subject:' fields of the header, what folder it finally went to and how long (in bytes) the message was. By setting this variable to `no', generation of this abstract is suppressed. If you set it to `all', procmail will log an abstract for every successful I<delivering recipe> it processes.
pl: Zanim procmail zakończy, raportuje dostarczoną wiadomość w B<$LOGFILE>, pokazując pola "From " i "Subject: " nagłówka, folder, w którym wiadomość została zapisana, oraz jej długość (w bajtach). Ustawienie tej zmiennej na "no" powstrzymuje generowanie tych informacji. Po ustawieniu jej na "all", procmail będzie logował każdą pomyślnie zakończoną I<regułę dostarczenia>, którą przetworzy.

source: Anything assigned to this variable will be appended to $LOGFILE.
pl: Wartość przypisana tej zmiennej będzie dopisana do pliku B<$LOGFILE>.

source: Usually the system mailbox (B<OR>iB<G>inal B<MAIL>box). If, for some obscure reason (like `B<filesystem full>') the mail could not be delivered, then this mailbox will be the last resort. If procmail fails to save the mail in here (deep, deep trouble :-), then the mail will bounce back to the sender.
pl: Zazwyczaj mailbox systemowy (B<OR>iB<G>inal B<MAIL>box). Jeśli z jakiegoś powodu (jak B<przepełnienie systemu plików>), list nie mógł być dostarczony do tego mailboxa, to procmail dostarczy go tutaj. Jeśli jednak nie będzie mógł nawet tego uczynić, to list zostanie odbity do nadawcy.
