Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailrc.5.po
Languages: pl

source: The only substitutions of environment variables that can be handled by procmail itself are of the type $name, ${name}, ${name:-text}, ${name:+text}, ${name-text}, ${name+text}, $\ename, $#, $n, $$, $?, $_, $- and $=; whereby $\ename will be substituted by the all-magic-regular-expression-characters-disarmed equivalent of $name, $_ by the name of the current rcfile, $- by $LASTFOLDER and $= will contain the score of the last recipe. Furthermore, the result of $\ename substitution will never be split on whitespace. When the B<-a> or B<-m> options are used, $# will expand to the number of arguments so specified and "$@" (the quotes are required) will expand to the specified arguments. However, "$@" will only be expanded when used in the argument list to a program, and then only one such occurrence will be expanded.
pl: Jedyne podstawienia zmiennych środowiskowych, które mogą być obsługiwane przez samego procmaila są typu I<$nazwa>, I<${nazwa}>, I<${nazwa:-tekst}>, I<${nazwa:+tekst}>, I<${nazwa-tekst}>, I<${nazwa+tekst}>, I<$\enazwa>, I<$#>, I<$n>, I<$$>, I<$?>, I<$_>, I<$-> i I<$=>; gdzie I<$\enazwa> zostanie zastąpione przez I<nazwa> z zacytowanymi wszystkimi znakami mającymi specjalne znaczenie w wyrażeniach regularnych; I<$_> będzie zastąpione nazwą bieżącego pliku rc, I<$-> przez B<$LASTFOLDER>, a I<$=> będzie zawierać punktację (score) ostatniej reguły. Co więcej znaki spacji nigdy nie będą rozdzielać wyniku podstawiania I<$\enazwa>. Gdy użyte są opcje B<-a> lub B<-m> to I<"$@"> (cudzysłowy są wymagane) rozwinie się do podanych argumentów. Jednakże I<"$@"> będzie rozwijany tylko wtedy, gdy jest używany na liście argumentów programu, i tylko jedno wystąpienie tej zmiennej będzie rozwijane.

source: Unquoted variable expansions performed by procmail are always split on space, tab, and newline characters; the IFS variable is not used internally.
pl: Niecytowanie ekspansje zmiennych przeprowadzane przez procmail są zawsze dzielone na spacjach, tabulatorach i znakach nowej linii; zmienna IFS nie jest wewnętrznie używana.

source: Procmail does not support the expansion of `~'.
pl: Procmail nie wspiera rozwijania "~".

source: A line buffer of length $LINEBUF is used when processing the I<rcfile>, any expansions that don't fit within this limit will be truncated and PROCMAIL_OVERFLOW will be set. If the overflowing line is a condition or an action line, then it will be considered failed and procmail will continue processing. If it is a variable assignment or recipe start line then procmail will abort the entire rcfile.
pl: Bufor linii o długości B<$LINEBUF> jest używany podczas przetwarzania I<pliku rc>; wszystkie ekspansje, które nie mieszczą się w tym limicie długości są obcinane i ustawiana jest zmienna B<PROCMAIL_OVERFLOW>. Jeśli zbyt długa linia jest linią warunku lub akcji, to reguła zawierająca taki warunek lub akcję jest uznawana za zakończoną niepowodzeniem, a procmail kontynuować będzie przetwarzanie kolejnych reguł. Jeśli linia taka występuje w przypisaniu zmiennej lub linii rozpoczynającej, to procmail przerwie przetwarzanie I<pliku rc>.

source: If the global lockfile has a I<relative> path, and the current directory is not the same as when the global lockfile was created, then the global lockfile will not be removed if procmail exits at that point (remedy: use I<absolute> paths to specify global lockfiles).
pl: Jeśli globalny plik blokujący ma ścieżkę I<relatywną>, a bieżący katalog nie jest taki sam, jak wtedy, gdy globalny plik blokujący został utworzony, to ten globalny plik blokujący nie zostanie usunięty, jeśli procmail zakończy w tym momencie działanie (tak więc: należy używać ścieżek I<absolutnych> dla globalnych plików blokujących).

source: If an rcfile has a I<relative> path and when the rcfile is first opened B<MAILDIR> contains a relative path, and if at one point procmail is instructed to clone itself and the current directory has changed since the rcfile was opened, then procmail will not be able to clone itself (remedy: use an I<absolute> path to reference the rcfile or make sure MAILDIR contains an absolute path as the rcfile is opened).
pl: Jeśli plik rc ma ścieżkę I<względną>, to kiedy ten plik jest otwierany po raz pierwszy, to B<MAILDIR> zawiera ścieżkę względną. Jeśli w którymś momencie procmail zostanie poinstruowany, żeby się sklonował, a bieżący katalog roboczy się zmienił od czasu otwarcia pliku rc, to procmail nie będzie w stanie się sklonować (lekarstwo: używanie ścieżek I<bezwzględnych> do odwołań do plików rc lub upewnienie się, że B<MAILDIR> zawiera ścieżkę bezwzględną przed otwarciem pliku rc).

source: A locallockfile on the recipe that marks the start of a non-forking nested block does not work as expected.
pl: Lokalny plik blokujący reguły, który zaznacza początek zagnieżdżonego bloku, nie działa tak, jak by się tego oczekiwało.

source: When capturing stdout from a recipe into an environment variable, exactly one trailing newline will be stripped.
pl: Gdy przechwytuje się standardowe wejście z reguły do zmiennej środowiskowej, to zostanie obcięty dokładnie jeden, kończący znak nowej linii.

source: MISCELLANEOUS
pl: RÓŻNE

source: If the regular expression contains `B<^TO_>' it will be substituted by
pl: Jeśli wyrażenie regularne zawiera "B<^TO_>", to zostanie zastąpione przez

source: `B<(^((Original-)?(Resent-)?(To\h'-\w' 'u' |Cc\h'-\w' 'u' |Bcc)\h'-\w' 'u' |(X-Envelope\h'-\w' 'u' |Apparently(-Resent)?)-To)\h'-\w' 'u' :(.*[^-a-zA-Z0-9_.])?)>', which should catch all destination specifications containing a specific I<address>.
pl: "B<(^((Original-)?(Resent-)?(To\h'-\w' 'u' |Cc\h'-\w' 'u' |Bcc)\h'-\w' 'u' |(X-Envelope\h'-\w' 'u' |Apparently(-Resent)?)-To)\h'-\w' 'u' :(.*[^-a-zA-Z0-9_.])?)>", co powinno złapać wszystkie specyfikacje celu zawierające określony I<adres>.

source: If the regular expression contains `B<^TO>' it will be substituted by
pl: Jeśli wyrażenie regularne zawiera "B<^TO>", to zostanie zastąpione przez

source: `B<(^((Original-)?(Resent-)?(To\h'-\w' 'u' |Cc\h'-\w' 'u' |Bcc)\h'-\w' 'u' |(X-Envelope\h'-\w' 'u' |Apparently(-Resent)?)-To)\h'-\w' 'u' :(.*[^a-zA-Z])?)>', which should catch all destination specifications containing a specific I<word>.
pl: "B<(^((Original-)?(Resent-)?(To\h'-\w' 'u' |Cc\h'-\w' 'u' |Bcc)\h'-\w' 'u' |(X-Envelope\h'-\w' 'u' |Apparently(-Resent)?)-To)\h'-\w' 'u' :(.*[^a-zA-Z])?)>", co powinno złapać wszystkie specyfikacje celu zawierające określone I<słowo>.

source: If the regular expression contains `B<^FROM_DAEMON>' it will be substituted by
pl: Jeśli wyrażenie regularne zawiera "B<^FROM_DAEMON>", to zostanie zastąpione przez

source: `B<(^(Mailing-List\h'-\w' 'u' :\h'-\w' 'u' |Precedence\h'-\w' 'u' :.*(junk\h'-\w' 'u' |bulk\h'-\w' 'u' |list)\h'-\w' 'u' |To\h'-\w' 'u' : Multiple recipients of |(((Resent-)?(From\h'-\w' 'u' |Sender)\h'-\w' 'u' |X-Envelope-From)\h'-\w' 'u' :\h'-\w' 'u' |E<gt>?From )([^E<gt>]*[^(.%@a-z0-9])?(Post(ma?(st(e?r)?\h'-\w' 'u' |n)\h'-\w' 'u' |office)\h'-\w' 'u' |(send)?Mail(er)?\h'-\w' 'u' |daemon\h'-\w' 'u' |m(mdf\h'-\w' 'u' |ajordomo)\h'-\w' 'u' |n?uucp\h'-\w' 'u' |LIST(SERV\h'-\w' 'u' |proc)\h'-\w' 'u' |NETSERV\h'-\w' 'u' |o(wner\h'-\w' 'u' |ps)\h'-\w' 'u' |r(e(quest\h'-\w' 'u' |sponse)\h'-\w' 'u' |oot)\h'-\w' 'u' |b(ounce\h'-\w' 'u' |bs\e.smtp)\h'-\w' 'u' |echo\h'-\w' 'u' |mirror\h'-\w' 'u' |s(erv(ices?\h'-\w' 'u' |er)\h'-\w' 'u' |mtp(error)?\h'-\w' 'u' |ystem)\h'-\w' 'u' |A(dmin(istrator)?\h'-\w' 'u' |MMGR\h'-\w' 'u' |utoanswer))(([^).!\h'-\w' 'u' :a-z0-9][-_a-z0-9]*)?[%@E<gt>\et ][^E<lt>)]*(\e(.*\e).*)?)?$([^E<gt>]\h'-\w' 'u' |$)))>', which should catch mails coming from most daemons (how's that for a regular expression :-).
pl: "B<(^(Mailing-List\h'-\w' 'u' :\h'-\w' 'u' |Precedence\h'-\w' 'u' :.*(junk\h'-\w' 'u' |bulk\h'-\w' 'u' |list)\h'-\w' 'u' |To\h'-\w' 'u' : Multiple recipients of |(((Resent-)?(From\h'-\w' 'u' |Sender)\h'-\w' 'u' |X-Envelope-From)\h'-\w' 'u' :\h'-\w' 'u' |E<gt>?From )([^E<gt>]*[^(.%@a-z0-9])?(Post(ma?(st(e?r)?\h'-\w' 'u' |n)\h'-\w' 'u' |office)\h'-\w' 'u' |(send)?Mail(er)?\h'-\w' 'u' |daemon\h'-\w' 'u' |m(mdf\h'-\w' 'u' |ajordomo)\h'-\w' 'u' |n?uucp\h'-\w' 'u' |LIST(SERV\h'-\w' 'u' |proc)\h'-\w' 'u' |NETSERV\h'-\w' 'u' |o(wner\h'-\w' 'u' |ps)\h'-\w' 'u' |r(e(quest\h'-\w' 'u' |sponse)\h'-\w' 'u' |oot)\h'-\w' 'u' |b(ounce\h'-\w' 'u' |bs\e.smtp)\h'-\w' 'u' |echo\h'-\w' 'u' |mirror\h'-\w' 'u' |s(erv(ices?\h'-\w' 'u' |er)\h'-\w' 'u' |mtp(error)?\h'-\w' 'u' |ystem)\h'-\w' 'u' |A(dmin(istrator)?\h'-\w' 'u' |MMGR\h'-\w' 'u' |utoanswer))(([^).!\h'-\w' 'u' :a-z0-9][-_a-z0-9]*)?[%@E<gt>\et ][^E<lt>)]*(\e(.*\e).*)?)?$([^E<gt>]\h'-\w' 'u' |$)))>", co powinno złapać maile pochodzące od większości demonów (jak się podoba to wyrażenie regularne? :-)

source: If the regular expression contains `B<^FROM_MAILER>' it will be substituted by
pl: Jeśli wyrażenie regularne zawiera "B<^FROM_MAILER>", to zostanie zastąpione przez

source: `B<(^(((Resent-)?(From\h'-\w' 'u' |Sender)\h'-\w' 'u' |X-Envelope-From)\h'-\w' 'u' :\h'-\w' 'u' |E<gt>?From )([^E<gt>]*[^(.%@a-z0-9])?(Post(ma(st(er)?\h'-\w' 'u' |n)\h'-\w' 'u' |office)\h'-\w' 'u' |(send)?Mail(er)?\h'-\w' 'u' |daemon\h'-\w' 'u' |mmdf\h'-\w' 'u' |n?uucp\h'-\w' 'u' |ops\h'-\w' 'u' |r(esponse\h'-\w' 'u' |oot)\h'-\w' 'u' |(bbs\e.)?smtp(error)?\h'-\w' 'u' |s(erv(ices?\h'-\w' 'u' |er)\h'-\w' 'u' |ystem)\h'-\w' 'u' |A(dmin(istrator)?\h'-\w' 'u' |MMGR))(([^).!\h'-\w' 'u' :a-z0-9][-_a-z0-9]*)?[%@E<gt>\et ][^E<lt>)]*(\e(.*\e).*)?)?$([^E<gt>]\h'-\w' 'u' |$))>' (a stripped down version of `B<^FROM_DAEMON>'), which should catch mails coming from most mailer-daemons.
pl: "B<(^(((Resent-)?(From\h'-\w' 'u' |Sender)\h'-\w' 'u' |X-Envelope-From)\h'-\w' 'u' :\h'-\w' 'u' |E<gt>?From )([^E<gt>]*[^(.%@a-z0-9])?(Post(ma(st(er)?\h'-\w' 'u' |n)\h'-\w' 'u' |office)\h'-\w' 'u' |(send)?Mail(er)?\h'-\w' 'u' |daemon\h'-\w' 'u' |mmdf\h'-\w' 'u' |n?uucp\h'-\w' 'u' |ops\h'-\w' 'u' |r(esponse\h'-\w' 'u' |oot)\h'-\w' 'u' |(bbs\e.)?smtp(error)?\h'-\w' 'u' |s(erv(ices?\h'-\w' 'u' |er)\h'-\w' 'u' |ystem)\h'-\w' 'u' |A(dmin(istrator)?\h'-\w' 'u' |MMGR))(([^).!\h'-\w' 'u' :a-z0-9][-_a-z0-9]*)?[%@E<gt>\et ][^E<lt>)]*(\e(.*\e).*)?)?$([^E<gt>]\h'-\w' 'u' |$))>" (uproszczona wersja "B<^FROM_DAEMON>"), co powinno złapać maile pochodzące od większości demonów pocztowych.

source: When assigning boolean values to variables like VERBOSE, DELIVERED or COMSAT, procmail accepts as true every string starting with: a non-zero value, `on', `y', `t' or `e'. False is every string starting with: a zero value, `off', `n', `f' or `d'.
pl: Podczas przypisywania wartości logicznych zmiennym takim jak B<VERBOSE>, B<DELIVERED> czy B<COMSAT>, procmail przyjmuje jako prawdziwy napis zaczynający się od: cyfry różnej od zera, "on", "y", "t" lub "e". Fałsz jest każdym napisem zaczynającym się od: cyfry zero, "off", "n", "f" lub "d".

source: If the action line of a recipe specifies a program, a sole backslash-newline pair in it on an otherwise empty line will be converted into a newline.
pl: Jeśli linia akcji reguły określa program, to pojedyncza para znaków odwrotny-ukośnik+nowa-linia w niej występująca zostanie przekształcona w nową linię, pod warunkiem, że linia nie zawiera innych żadnych znaków.

source: The regular expression engine built into procmail does not support named character classes.
pl: Silnik wyrażeń regularnych wbudowany w procmaila nie obsługuje nazwanych klas znaków (np. [:alnum:]).

source: NOTES
pl: UWAGI

source: Since unquoted leading whitespace is generally ignored in the rcfile you can indent everything to taste.
pl: Ponieważ niecytowane początkowe białe spacje są ogólnie ignorowane w plikach rc, można zastosować takie wcięcia linii, jakie nam odpowiadają.

source: The leading `|' on the action line to specify a program or filter is stripped before checking for $SHELLMETAS.
pl: Początkowy znak "|" w linii akcji wskazującej program lub filtr, jest obcinane przed sprawdzeniem B<$SHELLMETAS>.

source: Files included with the INCLUDERC directive containing only environment variable assignments can be shared with sh.
pl: Pliki włączane dyrektywą B<INCLUDERC> zawierające tylko przypisania wartości zmiennym środowiskowym mogą być dzielone z B<sh>(1).

source: The current behavior of assignments on the command line to B<INCLUDERC> and B<SWITCHRC> is not guaranteed, has been changed once already, and may be changed again or removed in future releases.
pl: Nie ma żadnych gwarancji, że bieżące zachowanie przypisań zmiennych B<INCLUDERC> i B<SWITCHRC> w linii poleceń nie zostanie zmienione. Zostało już raz zmienione w przeszłości i może być zmienione ponownie lub nawet usunięte w przyszłych wersjach.

source: For I<really> complicated processing you can even consider calling B<procmail> recursively.
pl: W celu I<naprawdę> skomplikowanego przetwarzania można nawet rozważyć rekurencyjne wywoływanie procmaila.

source: In the old days, the `:0' that marks the beginning of a recipe, had to be changed to `:n', whereby `n' denotes the number of conditions that follow.
pl: W bardzo starych wersjach procmaila zamiast ":0" rozpoczynającego regułę trzeba było używać ":n", gdzie n oznaczało liczbę warunków w regule.

source: AUTHORS
pl: AUTORZY

source: \&$HOME/bin\h'-\w' 'u' :/usr/local/bin\h'-\w' 'u' :/usr/bin\h'-\w' 'u' :/bin (Except
pl: \&$HOME/bin\h'-\w' 'u' :/usr/local/bin\h'-\w' 'u' :/usr/bin\h'-\w' 'u' :/bin (z wyjątkiem

source: The following tokens are known to both the procmail internal egrep and the standard B<egrep>(1) (beware that some egrep implementations include other non-standard extensions; in particular, the repetition operator B<{> is not supported by procmail's egrep):
pl: Następujące żetony rozpoznawane są zarówno przez wewnętrzny egrep procmaila, jak i przez standardowy B<egrep>(1) (proszę być świadomym tego, że niektóre implementacje egrepa zawierają niestandardowe rozszerzenia, w szczególności operator powtarzania B<{> nie jest obsługiwany przez wewnętrznego egrepa procmaila):

source: Some non-optimal and non-obvious regexps set MATCH to an incorrect value. The regexp can be made to work by removing one or more unneeded \&'*', '+', or '?' operator on the left-hand side of the \e/ token.
pl: Niektóre nieoptymalne i nieoczywiste wyrażenia regularne ustawiają niepoprawną wartość zmiennej B<MATCH>. Takie wyrażenie regularne można poprawić, usuwając jeden lub więcej niepotrzebnych operatorów \&"*", "+" lub "?" znajdujących się po lewej stronie tokena \e/.
