Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailex.5.po
Languages: hu

source: The following one is rather exotic, but it only serves to demonstrate a feature. Suppose you have a file in your HOME directory called ".urgent", and the (one) person named in that file is the sender of an incoming mail, you'd like that mail to be stored in $MAILDIR/urgent instead of in any of the normal mailfolders it would have been sorted in. Then this is what you could do (beware, the filelength of $HOME/.urgent should be well below $LINEBUF, increase LINEBUF if necessary):
hu: A következő példa a procmail egyik alkalmazhatóságát mutatja be. Ha mondjuk egy ".surgos" nevű állományban elhelyezzünk egy személynek a címét, akkor a szűrő a tőle érkező leveleket a $MAILDIR/surgos mappába irányítja át. Az ehhez szükséges szűrő így néz ki (fontos megjegyezni hogy a $LINEBUF értékét meg kell növelni, ha a $LINEBUF-nál hosszabb az .surgos állomány tartalma):

source: URGMATCH=`cat $HOME/.urgent`
hu: URGMATCH=`cat $HOME/.surgos`

source: :0: * $^From.*${URGMATCH} urgent
hu: :0: * $^From.*${URGMATCH} surgos

source: cat newtext | procmail ./mimeconvert | mail chris@where.ever
hu: cat newtext | procmail ./mimeconvert | mail kriszta@cime

source: The B<mimeconvert> rcfile could contain something like (the =0x80= and =0xff= should be substituted with the real 8-bit characters):
hu: A B<mimeconvert> konfigurációs állománya pedig valami hasonlót tartalmazhat (a =0x80= és =0xff= kell 8-bites karakterekkel helyettesíteni):

source: DEFAULT=| # pipe to stdout instead of # delivering mail as usual :0 Bfbw * [=0x80=-=0xff=] | mimencode -q
hu: DEFAULT=| # a kimenetet a hagyományos kimenetre # irányítjuk a levélküldés helyett :0 Bfbw * [=0x80=-=0xff=] | mimencode -q

source: SEE ALSO
hu: LÁSD MÉG

source: AUTHORS
hu: SZERZŐI

source: This man page shows several example recipes. For examples of complete rcfiles you can check the NOTES section in B<procmail>(1), or look at the example rcfiles part of the procmail source distribution (procmail*/examples/?procmailrc).
hu: Ebben a súgóban néhány mintapéldát lehet találni. Részletesebb konfigurációs példákat a B<procmail>(1), súgó MEGJEGYZÉS részében, vagy a procmail csomagban (procmail*/examples/?procmailrc) lehet találni.
