Repository: sebras/manpages-l10n
Catalog: po/*/man5/procmailsc.5.po
Languages: es, hu

source: NAME
es: NOMBRE
hu: NÉV

source: procmailsc - procmail weighted scoring technique
es: procmailsc - técnica puntuación de peso de procmail
hu: procmailsc - a procmail súlyozott pontozási módszere

source: SYNOPSIS
es: SINOPSIS
hu: ÖSSZEGZÉS

source: [B<*>] B<w^x condition>
es: [B<*>] B<w^x condición>
hu: [B<*>] B<w^x feltétel>

source: DESCRIPTION
es: DESCRIPCIÓN
hu: LEÍRÁS

source: In addition to the traditional true or false conditions you can specify on a recipe, you can use a weighted scoring technique to decide if a certain recipe matches or not. When weighted scoring is used in a recipe, then the final score for that recipe must be positive for it to match.
es: Además de las condiciones tradicionales verdadero o falso que puede especificar en una receta, puede usar técnicas de puntuación de peso para decidir si una cierta receta concuerda o no. Cuando se usa la puntuación de peso en una receta, la puntuación final de esa receta debe ser positiva para que concuerde.
hu: A szűrési feltételekben megadott hagyományos igaz/hamis vizsgálat mellett a súlyozott pontozási módszert is lehet használni a feltételek helyességének megállapítására. A szűrési feltételben használt pontozási módszereknél a pozitív értékek az igaz állításnak felelnek meg.

source: A certain condition can contribute to the score if you allocate it a `weight' (B<w>) and an `exponent' (B<x>). You do this by preceding the condition (on the same line) with:
es: Una cierta condición puede contribuir a la puntuación si le sitúa un `peso' (B<w>) y un `exponente' (B<x>). Esto lo hace precediendo la condición (en la misma línea) con:
hu: A feltételek az alábbi módon kapnak pontokat, `fontosság' (B<w>) és `kitevő' (B<x>). A feltétel előtt (ugyanabban a sorban) lehet megadni ezt a következőképen:

source: Weighted regular expression conditions
es: Condiciones de expresión regular sopesadas
hu: Súlyozás egyszerű feltételnél

source: The first time the regular expression is found, it will add I<w> to the score. The second time it is found, I<w*x> will be added. The third time it is found, I<w*x*x> will be added. The fourth time I<w*x*x*x> will be added. And so forth.
es: La primera vez que se encuentra la expresión regular, se añadirá I<w> a la puntuación. La segunda vez que la encuentre añadirá I<w*x> La tercera vez que la encuentre añadirá I<w*x*x> La cuarta vez añadirá I<w*x*x*x> y así sucesivamente.
hu: A feltétlenek való első megfeleléskor I<w> -vel nő a pontszám. A következő megfeleléskor már I<w*x> -el. Harmadik találat esetén I<w*x*x> -el. Negyedik megfeleléskor I<w*x*x*x> -el. És így tovább.

source: This can be described by the following concise formula:
es: Esto se puede describir con la siguiente fórmula concisa:
hu: Ezt a következő képlettel lehet kifejezni:

source: It represents the total added score for this condition if B<n> matches are found.
es: Representa la puntuación total añadida para esta condición si se encuentran B<n> concordancias.
hu: A képlet megadja a feltétel B<n> számú megfelelésekor az összpontszámot.

source: Note that the following case distinctions can be made:
es: Observe que se pueden hacer las siguientes distinciones de casos:
hu: A következő eseteket lehet B<x> -től függően megkülönböztetni:

source: Only the first match will contribute w to the score. Any subsequent matches are ignored.
es: Sólo la primera concordancia contribuirá w a la puntuación. Se ignoran cualquier concordancia posterior.
hu: Csak az első találat esetén növekszik a pontszám w-vel. Minden más találat figyelmen kívül lesz hagyva.

source: Every match will contribute the same w to the score. The score grows linearly with the number of matches found.
es: Cada concordancia contribuirá el mismo w a la puntuación. La puntuación crece linealmente con el número de concordancias encontradas.
hu: Minden egyes találat w-vel növeli a pontszámot. Az összpontszám a találatok számával egyenes arányban növekszik.

source: Every match will contribute less to the score than the previous one. The score will asymptotically approach a certain value (see the B<NOTES> section below).
es: Cada concordancia contribuye menos a la puntuación que la previa. La puntuación se aproxima asintóticamente a cierto valor (véase la sección notas B<NOTAS> abajo).
hu: Minden újabb találattal kevesebb pontot adunk az összpontszámhoz, mint előtte. Ekkor az összpontszám egyoldalról (aszimptotikusan) közelít egy határértékhez. (Lásd B<MEGJEGYZÉS> részt később).

source: Every match will contribute more to the score than the previous one. The score will grow exponentially.
es: Cada concordancia contribuirá más a la puntuación que la previa. La puntuación crece exponencialmente.
hu: Minden újabb találattal egyre több pontot adunk az összeghez, mint előtte. Az összpontszám exponenciálisan növekszik.

source: Can be utilised to favour odd or even number of matches.
es: Se puede utilizar para favorecer números pares o impares de concordancias.
hu: Segítségével megkülönböztethetjük az egész- vagy páratlan számú találatokat.

source: If the regular expression is negated (i.e., matches if it isn't found), then B<n> obviously can either be zero or one.
es: Si la expresión regular está negada (i.e. concuerda si no se encuentra), entonces B<n> obviamente puede ser cero o uno.
hu: Ha a feltételnek való megfelelést megfordítjuk [negáljuk] (pl. találat, ha nincs egyezés a feltétellel), akkor az B<n> értéke természetesen nulla vagy egy lehet.

source: Weighted program conditions
es: Condiciones de programa sopesadas
hu: Súlyozott kilépésiértékek

source: If the program returns an exitcode of EXIT_SUCCESS (=0), then the total added score will be B<w>. If it returns any other exitcode (indicating failure), the total added score will be B<x>.
es: Si el programa devuelve un código de salida EXIT_SUCCESS (=0), entonces la puntuación total añadida será B<w>. Si devuelve cualquier otro código de salida (indicando fallo), la puntuación total añadida será B<x>.
hu: Ha a program EXIT_SUCCESS (=0) -vel fejezi be működését, akkor az összpontszám B<w> lesz. Bármely más kilépési kód (hibás működés) esetén az összpontszám B<x> lesz.

source: If the exitcode of the program is negated, then, the exitcode will be considered as if it were a virtual number of matches. Calculation of the added score then proceeds as if it had been a normal regular expression with B<n=`exitcode'> matches.
es: Si el código de salida del programa está negado, el código de salida se considerará como si fuera un número virtual de concordancias. El cálculo de la puntuación añadida prosigue como si tuviera una expresión regular normal con B<n=`exitcode'> concordancias.
hu: A program kilépési kódjának megfordításakor (negálásakor) kapott pontszámot a lehetséges találatok számával ('virtual number of matches') azonosítja a program. Az összpontszám kiszámítása ugyanúgy történik, mint ahogy hagyományos kifejezéssel való egyezéskor történne, vagyis mintha B<n=`exitcode'> számú találat lett volna.

source: Weighted length conditions
es: Condiciones de longitud sopesadas
hu: Súlyozás levélméret alapján

source: If the length of the actual mail is B<M> then:
es: Si la longitud del correo actual es B<M> entonces:
hu: Ha a levél mérete B<M> akkor:

source: will generate an additional score of:
es: generará una puntuación adicional de:
hu: esetén a megfelelő pontszám a következőképen számolható:

source: And:
es: Y:
hu: És:

source: In both cases, if L=M, this will add w to the score. In the former case however, larger mails will be favoured, in the latter case, smaller mails will be favoured. Although x can be varied to fine-tune the steepness of the function, typical usage sets x=1.
es: En ambos casos, si L=M, esto añadirá w a la puntuación. En el primer caso, sin embargo, se favorecen los correos grandes, en el último se favorecen los pequeños. Aunque x se puede variar para un mejor ajuste el decrecimiento de la función, el uso típico fija x=1.
hu: Mindkét esetben, ha L=M, akkor az összpontszámhoz csupán w adódik. Az előző példa azonban hosszabb levelekre, míg az utóbbi a rövidebb levelekre használandó. Az x változtatásával a függvény pontosságát lehet 'finomhangolni', de az x=1 többnyire megfelelő.

source: MISCELLANEOUS
es: MISCELÁNEA
hu: EGYÉB

source: You can query the final score of all the conditions on a recipe from the environment variable B<$=>. This variable is set I<every> time just after procmail has parsed all conditions on a recipe (even if the recipe is not being executed).
es: Puede consultar la puntuación total de todas las condiciones de una receta de la variable de entorno B<$=>. Esta variable se fija I<cada vez> cuando procmail ha analizado todas las condiciones de una receta (incluso si la receta no está siendo ejecutada).
hu: A szűrési feltételben (recipe) szereplő összes pontszámot a B<$=> környezeti változó segítségével lehet kiolvasni. Ezt a változó I<minden> szűrés után ellenőrzésre kerül (még ha a szűrés nem is hajtódik végre).

source: EXAMPLES
es: EJEMPLOS
hu: PÉLDÁK

source: The following recipe will ditch all mails having more than 150 lines in the body. The first condition contains an empty regular expression which, because it always matches, is used to give our score a negative offset. The second condition then matches every line in the mail, and consumes up the previous negative offset we gave (one point per line). In the end, the score will only be positive if the mail contained more than 150 lines.
es: La siguiente receta separa tdos los correos que tienen más de 150 líneas en el cuerpo. La primera condición contiene una expresión regular vacía que, debido a que siempre se verifica, se usa para dar a nuestra puntuación un desplazamiento negativo. La segunda condición concuerda con cada línea del correo y consume el desplazamiento negativo previo que le dimos (un punto por línea). Al final, la puntuación será sólo positiva si el correo contiene más de 150 líneas.
hu: A következő példával minden a olyan levelet töröltethetünk, amely a törzsében 150 sornál többet tartalmaz. Az első sorban egy üres feltétel talalható, amely minden levélre igaz, ezzel a pontszámnak egy kezdeti (negatív) értéket adtunk meg. A következő feltétel segítségével minden egyes új sor esetén növeltetjük az összpontszámot (soronként egy ponttal). A feltétel pozitív pontszámmal zárul, ha a levél 150 sornál többet tartalmazott.

source: Suppose you have a priority folder which you always read first. The next recipe picks out the priority mail and files them in this special folder. The first condition is a regular one, i.e., it doesn't contribute to the score, but simply has to be satisfied. The other conditions describe things like: john and claire usually have something important to say, meetings are usually important, replies are favoured a bit, mails about Elvis (this is merely an example :-) are favoured (the more he is mentioned, the more the mail is favoured, but the maximum extra score due to Elvis will be 4000, no matter how often he is mentioned), lots of quoted lines are disliked, smileys are appreciated (the score for those will reach a maximum of 3500), those three people usually don't send interesting mails, the mails should preferably be small (e.g., 2000 bytes long mails will score -100, 4000 bytes long mails do -800). As you see, if some of the uninteresting people send mail, then the mail still has a chance of landing in the priority folder, e.g., if it is about a meeting, or if it contains at least two smileys.
es: Supongamos que tiene una carpeta prioritaria que siempre lee primero. La siguiente receta toma la prioridad del correo y lo almacena en carpetas especiales. La primera condición es regular, i.e. no contribuye a la puntuación, simplemente tiene que satisfacerse. Las otras condiciones describen cosas como: john and claire normalmente tienen cosas importantes que decir, las reuniones son normalmente importantes, las respuestas se favorecen un poco, los mail respecto a Elvis (esto es sólo un ejemplo :-\) se favorecen (cuando más se mencione, más se favorece el correo , pero la máxima puntuación extra debida a Elvis será 4000, no importa con qué frecuencia sea mencionado), muchas líneas marcadas como de respuesta no no gustan, los "smileys" son apreciados (la puntuación de ellos alcanza un máximo de 3500, esas tres personas normalmente no envían correos interesantes, lo correos serían preferentemente pequeños (v.g. mails con 2000 octetos de largos puntuarán -100, 4000 bytes de largos -800). Como puede ver, si alguien de esas personas poco interesantes envía correo, el coreo todavía tiene una oportunidad de aterrizar en la carpeta prioritaria, v.g. si es sobre una reunión (meeting), o si contiene al menos dos "smileys".
hu: Ha van egy külön levelesmappánk, amelyet mindig először olvasunk el, akkor a következő szűrési feltétellel a fontosabb leveleket átirányíthatjuk ebbe a mappába. Az első feltétel nem használ pontozást, mindössze figyeli, hogy a levelek nem tartalmazzák-e a megadott feltételeket. A következő feltételek pedig a következőt fejezik ki: józsi és kati általában hasznos dolgokról írnak; a megbeszélésekről szóló levelek fontosak a számunkra; válaszleveleket is szívesen olvasunk; Elvis-ről szóló leveleket (hátha megtudunk valami újat) mindig elolvassuk (minél többször említik a levélben Elvist, annál több pontot kap a levél, de maximum 4000 pontot); túl sok idézett sort tartalmazó levelet el szeretnénk kerülni; ha smiley-t küldenek nekünk, akkor azt szívesen megnézzük (erre maximum 3500 pontot adunk); három embertől (főnők, timi, péter) általában unalmas leveleket szoktunk kapni; és végül nem szeretjük a hosszú leveleket, jobb, ha a levél csak 2000 bájt hosszú, ha ennél hosszabb, akkor 100 pontot, ha 4000 bájtnál hosszabb akkor pedig 800 pontot vonunk le az összes pontszámából. A pontozási módszer segítségével azonban, még ha egy unalmas levelet is kapunk három emberünk valamelyikétől a levél még bekerülhet a külön mappánkba, ha pl. megbeszélésről szól, vagy tartalmaz legalább 2 darab smileyt.

source: :0 HB * !^Precedence:.*(junk|bulk) * 2000^0 ^From:.*(john@home|claire@work) * 2000^0 ^Subject:.*meeting * 300^0 ^Subject:.*Re: * 1000^.75 elvis|presley * -100^1 ^E<gt> * 350^.9 :-\e) * -500^0 ^From:.*(boss|jane|henry)@work * -100^3 E<gt> 2000 priority_folder
es: :0 HB * !^Precedence:.*(junk|bulk) * 2000^0 ^From:.*(john@home|claire@work) * 2000^0 ^Subject:.*meeting * 300^0 ^Subject:.*Re: * 1000^.75 elvis|presley * -100^1 ^E<gt> * 350^.9 :-\e) * -500^0 ^From:.*(boss|jane|henry)@work * -100^3 E<gt> 2000 carpeta_prioritaria
hu: :0 HB * !^Precedence:.*(junk|bulk) * 2000^0 ^From:.*(jozsi@otthon|kati@munkahely) * 2000^0 ^Subject:.*megbeszeles * 300^0 ^Subject:.*Re: * 1000^.75 elvis|presley * -100^1 ^E<gt> * 350^.9 :-\e) * -500^0 ^From:.*(fonok|timi|peter)@munkahely * -100^3 E<gt> 2000 kulon_mappa

source: If you are subscribed to a mailinglist, and just would like to read the quality mails, then the following recipes could do the trick. First we make sure that the mail is coming from the mailinglist. Then we check if it is from certain persons of whom we value the opinion, or about a subject we absolutely want to know everything about. If it is, file it. Otherwise, check if the ratio of quoted lines to original lines is at most 1:2. If it exceeds that, ditch the mail. Everything that survived the previous test, is filed.
es: Si está suscrito a una lista de correo y le gustaría leer los mensajes de calidad, entonces las siguientes recetas podrían realizar el truco. Primero estamos seguros que el correo proviene de la lista de correo, Entonces comprobamos si es de ciertas personas de las que valoramos su opinión, o sobre un motivo sobre el que queremos saber absolutamente todo. Si es así, lo guardamos. En otro caso verificamos si la razón de líneas citadas del original es al menos 1:2. Si lo excede separamos el correo. Todo lo que sobreviva a la verificación previa se almacena.
hu: Ha a levelezőlistákról érkező levelek közül csak a hasznos leveleket szeretnénk elolvasni, akkor a következő szűrési feltételt használhatjuk. Az első feltétel ellenőrzi, hogy a levél a megadott levelezőlistáról jött-e. Aztán a leveleket ellenőrizzük, hogy olyan személytől jött-e akinek adunk a szavára, vagy olyan témáról szól, amelyről mindent El szeretnénk olvasni. Ha ezeknek megfelel, akkor marad a levél. A többi levélnél megvizsgáljuk, hogy az idézett és az új sorok aránya eléri-e az 1:2-hözt. Ha ennél több, akkor töröljük a levelet. Minden olyan levél, amely átment az előző vizsgálaton mentésre kerül.

source: :0 ^From mailinglist-request@some.where { :0: * ^(From:.*(paula|bill)|Subject:.*skiing) mailinglist
hu: :0 ^From levelezőlista@vhol { :0: * ^(From:.*(piroska|bandi)|Subject:.*sieles) levlista

source: :0: mailinglist }
hu: :0: levlista }

source: For further examples you should look in the B<procmailex>(5) man page.
es: Para más ejemplos debería mirar en la página de manual B<procmailex>(5).
hu: További mintapéldák a B<procmailex>(5) súgóban lehet találni.

source: CAVEATS
es: ADVERTENCIAS
hu: FIGYELMEZTETÉS

source: Because this speeds up the search by an order of magnitude, the procmail internal egrep will always search for the leftmost I<shortest> match, unless it is determining what to assign to B<MATCH>, in which case it searches the leftmost I<longest> match. E.g. for the leftmost I<shortest> match, by itself, the regular expression:
es: Debido a que esto incrementa la búsqueda por un orden de magnitud, el egrep interno de procmail siempre buscará la concordancia I<más corta> por la izquierda salvo que esté determinado qué asignar a B<MATCH>, en cuyo caso busca la concordancia I<más larga> por la izquierda. V.g. la concordancia I<más corta> por la izquierda, por él mismo, la expresión regular:
hu: A procmail a gyors keresés érdekében mindig csak a balelső (leftmost) I<legrövidebb> egyezésig keres, ha csak nem a B<MATCH> -be értéket kell átadni, ebben az esetben a balelso I<leghosszabb> találatig keres. Pl. A balelső I<legrövidebb> találat a következő kifejezésre:

source: will always match a zero length string at the same spot.
es: siempre concuerda con una cadena de longitud cero en el mismo sitio.
hu: mindig nullahosszúságú találatot eredményez.

source: will always match one character (except newlines of course).
es: siempre concordará con un carácter (salvo nueva línea, por supuesto).
hu: pedig mindig csak egy karaktert (sortörést persze nem) eredményez.

source: SEE ALSO
es: VÉASE TAMBIÉN
hu: LÁSD MÉG

source: BUGS
es: ERRORES
hu: HIBÁK

source: If, in a length condition, you specify an B<x> that causes an overflow, procmail is at the mercy of the B<pow>(3) function in your mathematical library.
es: Si, en una condición de longitud especifica un B<x> que causa un desbordamiento, procmail está a la meced de la función B<pow>(3) de su librería matemática.
hu: Ha az B<x> értéke túlcsorduláshoz vezet, akkor a matematikai függvénytárban lévő B<pow>(3) függvénytől függ a végső eredmény.

source: Floating point numbers in `engineering' format (e.g., 12e5) are not accepted.
es: No se aceptan número en coma flotante en formato exponencial (v.g. 12e5).
hu: Lebegő pontos számok mérnöki formátumban (pl. 12e5) nem adhatók meg.

source: As soon as `plus infinity' (2147483647) is reached, any subsequent I<weighted> conditions will simply be skipped.
es: Tan pronto como se alcanza `mas infinito' (2147483647), cualquier condición de I<peso> simplemente se salta.
hu: A `pozitív végtelen' (2147483647) elérésekor minden I<további> súlyozás át lesz ugorva.

source: As soon as `minus infinity' (-2147483647) is reached, the condition will be considered as `no match' and the recipe will terminate early.
es: Tan pronto como se alcanza `menos infinito' (-2147483647), la condición se considerará como `sin concordancia' y la receta termina antes.
hu: A `negatív végtelen' (-2147483647) elérésekor a szűrés megfelelés hiányában befejeződik.

source: NOTES
es: NOTAS
hu: MEGJEGYZÉS

source: If in a regular expression weighted formula B<0E<lt>xE<lt>1>, the total added score for this condition will asymptotically approach:
es: Si en una expresión regular fórmula sopesada B<0E<lt>xE<lt>1>, la puntuación total añadida para esta condición se aproximará asintóticamente:
hu: B<0E<lt>xE<lt>1> esetén a hagyományos feltétel pontszáma a következő számhoz közelít egyoldalról:

source: In order to reach half the maximum value you need
es: Para alcanzar la mitad del valor máximo necesita
hu: A maximális érték felének eléréséhez

source: matches.
es: concordancias.
hu: számú találatra van szükség.

source: AUTHORS
es: AUTORES
hu: SZERZŐI

source: Whereas both B<w> and B<x> are real numbers between -2147483647.0 and 2147483647.0 inclusive.
es: Considerando que B<w> y B<x> son números reales entre -2147483647.0 y 2147483647.0.
