Repository: sebras/manpages-l10n
Catalog: po/*/man5/resolv.conf.5.po
Languages: de, pl

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
pl: NAZWA

source: resolv.conf - resolver configuration file
de: resovl.conf - Konfigurationsdatei für den Resolver
pl: resolv.conf - plik konfiguracyjny mechanizmu obsługi nazw (ang. resolver)

source: SYNOPSIS
de: ÜBERSICHT
pl: SKŁADNIA

source: DESCRIPTION
de: BESCHREIBUNG
pl: OPIS

source: The I<resolver> is a set of routines in the C library that provide access to the Internet Domain Name System (DNS). The resolver configuration file contains information that is read by the resolver routines the first time they are invoked by a process. The file is designed to be human readable and contains a list of keywords with values that provide various types of resolver information. The configuration file is considered a trusted source of DNS information; see the B<trust-ad> option below for details.
de: Der I<Resolver> ist eine Sammlung von Routinen in der C-Bibliothek, über die auf das Internet-Namenssystem (Domain Name System, DNS) zugegriffen wird. Die Konfigurationsdatei des Resolvers enthält Informationen, die beim ersten Aufruf einer Resolver-Routine durch einen Prozess eingelesen werden. Die Datei wurde menschenlesbar entworfen und enthält eine Liste von Schlüsselworten und Werten, die verschiedene Typen von Resolver-Informationen bereitstellen. Die Konfigurationsdatei wird als eine vertrauenswürdige Quelle für DNS-Informationen betrachtet; lesen Sie die nachfolgende Option B<trust-ad> für Details.
pl: Obsługa nazw (I<resolver>) jest zbiorem funkcji biblioteki C, które umożliwiają dostęp do internetowego systemu serwerów nazw (DNS). Plik konfiguracyjny zawiera informacje, odczytywane przez procedury obsługi nazw podczas ich pierwszego wywołania przez proces, i jest czytelny zarówno dla maszyny, jak i dla człowieka. Zawiera listę słów kluczowych z wartościami, które udostępniają różne informacje dotyczące obsługi nazw. Plik konfiguracyjny jest uważany za zaufane źródło informacji DNS; więcej informacji w opisie opcji B<trust-ad>.

source: If this file does not exist, only the name server on the local machine will be queried, and the search list contains the local domain name determined from the hostname.
de: Wenn diese Datei nicht vorhanden ist, wird nur der Name-Server auf dem lokalen Rechner abgefragt und die Suchliste enthält nur den aus dem Rechnernamen ermittelten lokalen Domain-Namen.
pl: Jeśli ten plik nie istnieje, to jedynym odpytywanym serwerem nazw jest wtedy ten z maszyny lokalnej, a lista przeszukiwań zawierająca nazwę lokalnej domeny jest konstruowana z nazwy komputera.

source: The different configuration options are:
de: Die verschiedenen Konfigurationsoptionen sind:
pl: Opcje konfiguracji są następujące:

source: B<nameserver> Name server IP address
de: B<nameserver> IP-Adresse des Name-Servers
pl: B<nameserver> Adres IP serwera nazw.

source: Internet address of a name server that the resolver should query, either an IPv4 address (in dot notation), or an IPv6 address in colon (and possibly dot) notation as per RFC 2373. Up to B<MAXNS> (currently 3, see I<E<lt>resolv.hE<gt>>) name servers may be listed, one per keyword. If there are multiple servers, the resolver library queries them in the order listed. If no B<nameserver> entries are present, the default is to use the name server on the local machine. (The algorithm used is to try a name server, and if the query times out, try the next, until out of name servers, then repeat trying all the name servers until a maximum number of retries are made.)
de: Die Internet-Adresse eines Name-Servers, den der Resolver abfragen soll, entweder eine IPv4-Adresse (in Punkt-Notation) oder eine IPv6-Adresse in Doppelpunkt- (und möglicherweise Punkt-)Notation gemäß RFC 2373. Es können bis zu B<MAXNS> (derzeit 3, siehe I<E<lt>resolv.hE<gt>>) Name-Server angegeben werden, einer je Schlüsselwort. Werden mehrere DNS-Server angegeben, wird sie der Resolver in der angegebenen Reihenfolge abfragen. Sind keine B<nameserver>-Einträge vorhanden, wird standardmäßig der Name-Server des lokalen Systems angesprochen. (Der Algorithmus ist der folgende: Der Resolver richtet eine Anfrage an einen Name-Server und versucht es nach einer Zeitüberschreitung beim nächsten, bis alle Einträge abgearbeitet sind. Danach wird die Liste wieder von vorne abgearbeitet, bis die maximal zulässige Anzahl von Versuchen erreicht wird.)
pl: Adres internetowy serwera nazw, który powinien być odpytywany przez funkcje obsługi nazw albo jako adres IPv4 (w notacji kropkowej) lub jako adres IPv6 w notacji dwukropkowej (i być może kropkowej) zgodnie z RFC 2373. W pliku można podać maksymalnie B<MAXNS> (obecnie 3, patrz I<E<lt>resolv.hE<gt>>) serwery nazw, po jednym przy słowie kluczowym. Jeśli jest kilka serwerów, biblioteka obsługi nazw odpytuje je w kolejności, w jakiej zostały wymienione. Jeśli nie ma żadnego wpisu B<nameserver>, domyślnym zachowaniem jest korzystanie z serwera nazw na maszynie lokalnej. (Stosowany algorytm polega na próbie odpytania serwera nazw, a jeśli przekroczy ona czas oczekiwania, następuje próba odpytania następnego, aż zabraknie serwerów nazw. Następnie występuje ściśle określona liczba ponownych odpytań wszystkich serwerów nazw).

source: B<search> Search list for host-name lookup.
de: B<search> Suchliste für Rechnernamen
pl: B<search> Lista przeszukiwania nazw komputerów.

source: By default, the search list contains one entry, the local domain name. It is determined from the local hostname returned by B<gethostname>(2); the local domain name is taken to be everything after the first \(aq.\(aq. Finally, if the hostname does not contain a \(aq.\(aq, the root domain is assumed as the local domain name.
de: Standardmäßig enthält die Suchliste nur einen Eintrag, den lokalen Domain-Namen. Er wird anhand des lokalen Rechnernamens ermittelt, der von B<gethostname>(2) geliefert wird. Es wird in diesem Fall davon ausgegangen, dass die lokale Domain der Teil des Namens ist, der rechts vom ersten \(aq.\(aq steht. Wenn der Rechnername kein \(aq.\(aq enthält, wird die Root-Domain als Wert für die lokale Domain angenommen.
pl: Domyślnie, lista przeszukiwań zawiera jeden wpis - nazwę lokalnej domeny. Jest ona określana na podstawie nazwy lokalnego komputera, zwróconej przez B<gethostname>(2) - za domenę uważa się wszystko po pierwszej ".". Ostatecznie, jeśli nazwa komputera nie zawiera "." za domenę główną przyjmowana jest nazwa lokalnej domeny.

source: This may be changed by listing the desired domain search path following the I<search> keyword with spaces or tabs separating the names. Resolver queries having fewer than I<ndots> dots (default is 1) in them will be attempted using each component of the search path in turn until a match is found. For environments with multiple subdomains please read B<options ndots:>I<n> below to avoid man-in-the-middle attacks and unnecessary traffic for the root-dns-servers. Note that this process may be slow and will generate a lot of network traffic if the servers for the listed domains are not local, and that queries will time out if no server is available for one of the domains.
de: Dieses Verhalten kann geändert werden, indem mit dem Schlüsselwort I<search> ein Suchpfad für die Domain-Auflösung angegeben wird, dessen Bestandteile durch Tabulatoren oder Leerzeichen voneinander zu trennen sind. Anfragen an den Resolver mit weniger als I<ndots> Punkten (Standardwert ist 1) werden versuchen, jeden Eintrag dieses Suchpfads abzuarbeiten, bis ein gültiger Namenseintrag gefunden wurde. Für Umgebungen mit mehreren Subdomains lesen Sie bitte B<options ndots:>I<n> weiter unten, wie Sie »Mann-in-der-Mitte«-Angriffe und unnötigen Verkehr für die Root-DNS-Server vermeiden. Beachten Sie, dass dieser Vorgang langsam sein kann und viel Netzwerkverkehr erzeugt, wenn die DNS-Server für die betreffenden Domains nicht lokal sind. Außerdem können Anfragen mit einer Zeitüberschreitung beendet werden, wenn kein Server für eine der genannten Domains erreichbar ist.
pl: Można to zmienić, przez podanie żądanej ścieżki poszukiwania domeny po słowie kluczowym I<search>, używając spacji lub tabulacji do oddzielenia nazw. Funkcje obsługi nazw dla zapytań zawierających w sobie mniej niż I<ndots> kropek (domyślnie - 1) będą próbowały kolejnych składników ścieżki poszukiwania, aż do znalezienia. Dla środowisk z wieloma poddomenami, proszę przeczytać poniżej B<options ndots:>I<n>, aby uniknąć ataków typu man-in-the-middle oraz niepotrzebnego odpytywania głównych serwerów nazw. Należy zauważyć, że proces ten może być powolny i powodować duże obciążenie sieci, jeśli serwery dla podanych domen nie są lokalne, a czas oczekiwania na odpowiedź po zapytaniu przekracza czas oczekiwania, gdy dla którejś z domen wszystkie serwery są niedostępne.

source: If there are multiple B<search> directives, only the search list from the last instance is used.
de: Falls es mehrere B<search>-Direktiven gibt, wird nur die Suchliste der letzten Instanz verwandt.
pl: Jeśli występuje wiele wpisów B<search>, użyta będzie wyłącznie lista przeszukiwań z ostatniego wpisu.

source: In glibc 2.25 and earlier, the search list is limited to six domains with a total of 256 characters. Since glibc 2.26, the search list is unlimited.
de: In Glibc 2.25 und älter ist die Suchliste auf 6 Domains und eine Gesamtlänge von 256 Zeichen beschränkt. Seit Glibc 2.26 ist die Suchliste unbegrenzt.
pl: W glibc 2.25 i wcześniejszych, lista przeszukiwania jest ograniczona do sześciu domen z maksymalną liczbą 256 znaków. Od glibc 2.26 brak limitów listy przeszukiwania.

source: The B<domain> directive is an obsolete name for the B<search> directive that handles one search list entry only.
de: Die Direktive B<domain> ist ein veralteter Name für die Direktive B<search>, die nur mit einem Suchlisteneintrag umgeht.
pl: Opcja B<domain> jest przestarzałym odpowiednikiem listy przeszukiwania B<search>, która obsługuje tylko pojedynczy wpis.

source: This option allows addresses returned by B<gethostbyname>(3) to be sorted. A sortlist is specified by IP-address-netmask pairs. The netmask is optional and defaults to the natural netmask of the net. The IP address and optional network pairs are separated by slashes. Up to 10 pairs may be specified. Here is an example:
de: Diese Option ermöglicht die Sortierung von durch B<gethostbyname>(3) ermittelten Adressen. Eine Sortierliste wird durch Kombinationen von IP-Adresse und Netzmaske angegeben. Die Netzmaske ist optional, es wird als Standardwert die native Netzmaske des Netzes angenommen. Die Kombinationen von IP-Adresse und Netzmaske werden durch Schrägstriche getrennt. Es können bis zu 10 Paare angegeben werden. Ein Beispiel:
pl: Umożliwia sortowanie adresów zwracanych przez B<gethostbyname>(3). Lista sortowania jest podawana przez pary adresów IP i masek sieci. Maska sieci jest opcjonalna i domyślnie ma wartość naturalnej maski dla danej sieci. Adres IP jest oddzielany od maski sieci ukośnikiem. W polu tym można podawać do 10 par. Przykład:

source: Options allows certain internal resolver variables to be modified. The syntax is
de: Mit dieser Option können bestimmte interne Variablen des Resolvers beeinflusst werden. Die Syntax lautet:
pl: Pole to umożliwia modyfikację pewnych wewnętrznych zmiennych funkcji obsługi nazw. Jego składnia to:

source: where I<option> is one of the following:
de: I<Option> kann dabei einen der folgenden Werte annehmen:
pl: gdzie I<opcja> jest jedną z następujących:

source: Sets B<RES_DEBUG> in I<_res.options> (effective only if glibc was built with debug support; see B<resolver>(3)).
de: setzt B<RES_DEBUG> in I<_res.options> (nur wirksam, falls Glibc mit Debug-Unterstützung gebaut wurde, siehe B<resolver>(3)).
pl: Ustawia B<RES_DEBUG> w I<_res.options> (działa tylko gdy glibc został zbudowany z obsługą debugowania; zobacz B<resolver>(3)).

source: Sets a threshold for the number of dots which must appear in a name given to B<res_query>(3) (see B<resolver>(3)) before an I<initial absolute query> will be made. The default for I<n> is 1, meaning that if there are any dots in a name, the name will be tried first as an absolute name before any I<search list> elements are appended to it. The value for this option is silently capped to 15.
de: definiert einen Schwellwert für die Anzahl der Punkte, die in einem an B<res_query>(3) übergebenen Namen enthalten sein müssen (siehe B<resolver>(3)), damit ein I<initial absolute query> ausgeführt wird. Der Standardwert für I<n> ist 1. Das hat zur Folge, dass zunächst versucht wird, den Namen als absoluten Namen aufzulösen, bevor ihm ein Eintrag aus der I<search list> angehängt wird. Der Wert für diese Option wird stillschweigend auf 15 begrenzt.
pl: Ustawia próg liczby kropek, które muszą pojawić się w nazwie podanej do B<res_query> (zobacz B<resolver>(3)) przed wykonaniem I<początkowego absolutnego zapytania>. Domyślną wartością jest "1", co oznacza, że jeśli w nazwie znajdują się jakieś kropki, to powinna być najpierw sprawdzona jako nazwa absolutna, bez dokonywania żadnych podstawień listy poszukiwania. Maksymalną wartością jest 15, większe wartości zostaną zmniejszone, bez wypisywania żadnych ostrzeżeń.

source: Sets the amount of time the resolver will wait for a response from a remote name server before retrying the query via a different name server. This may B<not> be the total time taken by any resolver API call and there is no guarantee that a single resolver API call maps to a single timeout. Measured in seconds, the default is B<RES_TIMEOUT> (currently 5, see I<E<lt>resolv.hE<gt>>). The value for this option is silently capped to 30.
de: setzt die Wartezeit auf die Antwort eines Name-Servers in der Ferne fest, nach deren Ablauf der Resolver die Anfrage an einen anderen Name-Server richtet. Dies muss B<nicht> die gesamte von dem Resolver-API-Aufruf verwandte Zeit sein und es gibt keine Garantie, dass ein einzelner Resolver-API-Aufruf auf eine einzelne Zeitüberschreitung passt. Sie wird in Sekunden gemessen, der Standardwert ist B<RES_TIMEOUT> (derzeit 5, siehe I<E<lt>resolv.hE<gt>>). Der Maximalwert für diese Option ist 30.
pl: Ustawia czas, przez który funkcja obsługi nazw będzie czekać na odpowiedź ze zdalnego serwera nazw przed wysłaniem zapytania do innego serwera nazw. Może to B<nie> być całkowity czas, jaki jaki zajmie wywołanie interfejsu obsługi nazw i brak gwarancji, że pojedyncze wywołanie odpowiada jednemu limitowi czasu. Wyrażony w sekundach, domyślnie - B<RES_TIMEOUT> (obecnie 5, patrz E<lt>resolv.hE<gt>). Maksymalną wartością jest 30, większe wartości zostaną zmniejszone, bez wypisywania żadnych ostrzeżeń.

source: Sets the number of times the resolver will send a query to its name servers before giving up and returning an error to the calling application. The default is B<RES_DFLRETRY> (currently 2, see I<E<lt>resolv.hE<gt>>). The value for this option is silently capped to 5.
de: Diese Option legt die Anzahl der Anfragen fest, die der Resolver an seine Name-Server sendet, bevor er aufgibt und dem aufrufenden Programm einen Fehler meldet. Der Standardwert ist B<RES_DFLRETRY> (derzeit 2, siehe I<E<lt>resolv.hE<gt>>); der Maximalwert 5.
pl: Ustawia liczbę prób wysyłania przez funkcję obsługi nazw zapytań do serwerów nazw przed poddaniem się i zwróceniem błędu. Domyślnie - B<RES_DFLRETRY> (obecnie 2, patrz E<lt>resolv.hE<gt>). Maksymalną wartością jest 5, większe wartości zostaną zmniejszone, bez wypisywania żadnych ostrzeżeń.

source: Sets B<RES_ROTATE> in I<_res.options>, which causes round-robin selection of name servers from among those listed. This has the effect of spreading the query load among all listed servers, rather than having all clients try the first listed server first every time.
de: Diese Option setzt B<RES_ROTATE> in I<_res.options>, was eine Reihum-Auswahl der Name-Server aus der Liste zur Folge hat. Auf diese Weise werden die Anfragen auf alle aufgeführten Server verteilt, anstatt dass alle Clients sich zunächst an den ersten aufgeführten Server wenden.
pl: Ustawia B<RES_ROTATE> w I<_res.options>, powodując wybór serwera nazw spośród wymienionych serwerów za pomocą algorytmu round-robin. Efektem tej opcji jest rozłożenie obciążenia zapytaniami wszystkich wymienionych serwerów nazw, zamiast odpytywania za każdym razem pierwszego z nich.

source: Sets B<RES_NOCHECKNAME> in I<_res.options>, which disables the modern BIND checking of incoming hostnames and mail names for invalid characters such as underscore (_), non-ASCII, or control characters.
de: Diese Option setzt B<RES_ROTATE> in I<_res.options>. Damit wird die moderne von BIND durchgeführte Prüfung eingehender Rechner- und E-Mail-Namen auf ungültige Zeichen wie Unterstrich (_), Steuerzeichen und andere Kodierungen als ASCII deaktiviert.
pl: Ustawia B<RES_NOCHECKNAME> w I<_res.options>, co wyłącza sprawdzanie przez nowoczesne serwery BIND przychodzących nazw komputerów i nazw pocztowych pod kątem niepoprawnych znaków, takich jak podkreślenie (_), znaki nie-ASCII lub znaki sterujące.

source: Sets B<RES_USE_INET6> in I<_res.options>. This has the effect of trying an AAAA query before an A query inside the B<gethostbyname>(3) function, and of mapping IPv4 responses in IPv6 "tunneled form" if no AAAA records are found but an A record set exists. Since glibc 2.25, this option is deprecated; applications should use B<getaddrinfo>(3), rather than B<gethostbyname>(3).
de: setzt B<RES_USE_INET6> in I<_res.options>. Dadurch wird innerhalb der Funktion B<gethostbyname>(3) zunächst eine AAAA-Anfrage vor einer A-Anfrage durchgeführt. Außerdem werden IPv4-Antworten in »IPv6 tunneled form« abgebildet, wenn keine AAAA-Einträge gefunden werden, aber ein Satz von A-Einträgen existiert. Seit Glibc 2.25 ist diese Option veraltet; Anwendungen sollten B<getaddrinfo>(3) statt B<gethostbyname>(3) verwenden.
pl: Ustawia B<RES_USE_INET6> w I<_res.options>. Efektem tego jest próbowanie zapytań AAAA przed zapytaniami A wewnątrz funkcji I<gethostbyname>(3) i mapowanie odpowiedzi IPv4 na "tunelowaną formę" IPv6, jeżeli znaleziono tylko rekordy A, bez rekordów AAAA. Od glibc 2.25 opcja ta jest przestarzała, aplikacje powinny korzystać z B<getaddrinfo>(3), zamiast z B<gethostbyname>(3).

source: B<ip6-bytestring> (since glibc 2.3.4 to 2.24)
de: B<ip6-bytestring> (seit Glibc 2.3.4 bis 2.24)
pl: B<ip6-bytestring> (od wersji 2.3.4 do 2.24 biblioteki glibc)

source: Sets B<RES_USEBSTRING> in I<_res.options>. This causes reverse IPv6 lookups to be made using the bit-label format described in RFC\ 2673; if this option is not set (which is the default), then nibble format is used. This option was removed in glibc 2.25, since it relied on a backward-incompatible DNS extension that was never deployed on the Internet.
de: setzt B<RES_USE_BSTRING> in I<_res.options>. Damit verwenden inverse IPv6-Suchen das in RFC\ 2673 beschriebene »bit-label«-Format. Wird die Option nicht gewählt (die Vorgabe), wird das Nibble-Format verwendet. Diese Option wurde in Glibc 2.25 entfernt, da sie auf einer rückwärts-inkompatiblen DNS-Erweiterung basiert, die im Internet niemals eingesetzt worden war.
pl: Ustawia B<RES_USE_BSTRING> w I<_res.options>. Powoduje to, że odwrotne wyszukiwania IPv6 będą używać formatu etykiet bitowych ("bit-label") opisanego w RFC\ 2673. Jeśli ta opcja nie jest ustawiona (tak jest domyślnie), to będzie używany format półbajtowy. Opcja usunięta w glibc 2.25, ponieważ korzystała z niekompatybilnego wstecznie rozszerzenia DNS, które nigdy nie zostało zaimplementowane w Internecie.

source: B<ip6-dotint>/B<no-ip6-dotint> (glibc 2.3.4 to 2.24)
de: B<ip6-dotint>/B<no-ip6-dotint> (Glibc 2.3.4 bis 2.24)
pl: B<ip6-dotint>/B<no-ip6-dotint> (od wersji 2.3.4 do 2.24 biblioteki glibc)

source: Clear/set B<RES_NOIP6DOTINT> in I<_res.options>. When this option is clear (B<ip6-dotint>), reverse IPv6 lookups are made in the (deprecated) I<ip6.int> zone; when this option is set (B<no-ip6-dotint>), reverse IPv6 lookups are made in the I<ip6.arpa> zone by default. These options are available in glibc versions up to 2.24, where B<no-ip6-dotint> is the default. Since B<ip6-dotint> support long ago ceased to be available on the Internet, these options were removed in glibc 2.25.
de: Löscht/Setzt B<RES_NOIP6DOTINT> in I<_res.options>. Wenn diese Option gelöscht ist (B<ip6-dotint>), werden inverse IPv6-Suchen in der I<ip6.int>-Zone durchgeführt, wovon abgeraten wird. Wurde die Option gewählt (B<no-ip6-dotint>), werden inverse IPv6-Suchen standardmäßig in der I<ip6.arpa>-Zone durchgeführt. Diese Optionen sind in Glibc bis Version 2.24 verfügbar, wo B<no-ip6-dotint> die Vorgabe ist. Da die Unterstützung von B<ip6-dotint> seit langer Zeit nicht mehr im Internet verfügbar ist, wurden diese Optionen in Glibc 2.25 entfernt.
pl: Czyści lub ustawia B<RES_NOIP6DOTINT> w I<_res.options>. Jeśli opcja ta jest wyczyszczona (B<ip6-dotint>), wyszukiwania odwrotne IPv6 są przeprowadzane w (niezalecanej) strefie I<ip6.int>. Gdy opcja ta jest włączona (B<no-ip6-dotint>), odwrotne wyszukiwania IPv6 są przeprowadzane w strefie I<ip6.arpa>. Opcje te są dostępne w glibc do wersji 2.24, gdzie B<no-ip6-ditint> jest domyślnie włączona. Ponieważ obsługa B<ip6-dotint> dawno temu zaniknęła w Internecie, opcje usunięto w wersji 2.25 bilioteki glibc.

source: B<edns0> (since glibc 2.6)
de: B<edns0> (seit Glibc 2.6)
pl: B<edns0> (od wersji 2.6 biblioteki glibc)

source: Sets B<RES_USE_EDNS0> in I<_res.options>. This enables support for the DNS extensions described in RFC\ 2671.
de: setzt B<RES_USE_EDNS0> in I<_res.options>. Damit wird die Unterstützung für die in RFR\ 2671 beschriebenen DNS-Erweiterungen aktiviert.
pl: Ustawia B<RES_USE_EDNS0> w I<_res.options>. Włącza to obsługę rozszerzeń DNS opisanych w RFC\ 2671.

source: B<single-request> (since glibc 2.10)
de: B<single-request> (seit Glibc 2.10)
pl: B<single-request> (od wersji 2.10 biblioteki glibc)

source: Sets B<RES_SNGLKUP> in I<_res.options>. By default, glibc performs IPv4 and IPv6 lookups in parallel since version 2.9. Some appliance DNS servers cannot handle these queries properly and make the requests time out. This option disables the behavior and makes glibc perform the IPv6 and IPv4 requests sequentially (at the cost of some slowdown of the resolving process).
de: setzt B<RES_SNGLKUP> in I<_res.options>. Standardmäßig erledigt die Glibc seit Version 2.9 das Abfragen von IPv4- und IPv6-Adressen parallel. Diese Anfragen können einige Appliance-DNS-Server nicht korrekt verarbeiten und führen zu Zeitüberschreitungen (timeouts). Diese Option deaktiviert die parallelen Anfragen und lässt Glibc die IPv6-und IPv4-Anfragen nacheinander erledigen (wodurch der Prozess etwas langsamer wird).
pl: Ustawia B<RES_SNGLKUP> w I<_res.options>. Domyślnie biblioteka glibc od wersji 2.9 równolegle odpytuje IPv4 i IPv6. Niektóre urządzenia serwerów DNS nie obsługują poprawnie takich zapytań i powodują błąd przekroczenia czasu oczekiwania na odpowiedź. Opcja ta wyłącza takie zachowanie i sprawia, że glibc odpytuje o IPv6 i IPv4 sekwencyjnie (kosztem pewnego spowolnienia procesu translacji nazw).

source: B<single-request-reopen> (since glibc 2.9)
de: B<single-request-reopen> (seit Glibc 2.9)
pl: B<single-request-reopen> (od wersji 2.9 biblioteki glibc)
