Repository: sebras/manpages-l10n
Catalog: po/*/man5/resolv.conf.5.po
Languages: de, pl

source: Sets B<RES_SNGLKUPREOP> in I<_res.options>. The resolver uses the same socket for the A and AAAA requests. Some hardware mistakenly sends back only one reply. When that happens the client system will sit and wait for the second reply. Turning this option on changes this behavior so that if two requests from the same port are not handled correctly it will close the socket and open a new one before sending the second request.
de: setzt B<RES_SNGLKUPREOP> in I<_res.options>. Der Resolver verwendet die gleichen Sockets für die A- und AAAA-Anfragen. Einige Hardware sendet fälschlicherweise nur eine Antwort zurück. Wenn das passiert, wird das Client-System auf die zweite Antwort warten. Das Einschalten dieser Option ändert das Verhalten: Wenn zwei Anfragen von dem gleichen Port nicht korrekt gehandhabt werden wird es das Socket schließen und einen neuen vor dem Versand der zweiten Anfrage öffnen.
pl: Ustawia B<RES_SNGLKUPREOP> w I<_res.options>. Mechanizm rozwiązujący używa tych samych gniazd do żądań A i AAAA. Część rozwiązań sprzętowych nieprawidłowo odsyła pojedynczą odpowiedź. Gdy tak się stanie, klient systemowy poczeka na drugą odpowiedź. Włączenie tej opcji zmienia to zachowanie, dzięki czemu jeśli dwa żądania z tego samego portu nie są poprawnie obsługiwane, to nastąpi zamknięcie oraz otworzenie nowego gniazda przed wysłaniem drugiego żądania.

source: B<no-tld-query> (since glibc 2.14)
de: B<no-tld-query> (seit Glibc 2.14)
pl: B<no-tld-query> (od wersji 2.14 biblioteki glibc)

source: Sets B<RES_NOTLDQUERY> in I<_res.options>. This option causes B<res_nsearch>() to not attempt to resolve an unqualified name as if it were a top level domain (TLD). This option can cause problems if the site has ``localhost'' as a TLD rather than having localhost on one or more elements of the search list. This option has no effect if neither RES_DEFNAMES or RES_DNSRCH is set.
de: setzt B<RES_NOTLDQUERY> in I<_res.options>. Diese Option führt dazu, dass B<res_nsearch>() nicht versucht, einen nicht qualifizierten Namen aufzulösen, als ob er ein »top level domain« (TLD) wäre. Diese Option kann zu Problemen führen, falls die Site »localhost« als TLD verwendet, statt »localhost« als ein oder mehrere Elemente auf der Suchliste zu haben. Diese Option hat keinen Effekt, falls weder RES_DEFNAMES noch RES_DNSRCH gesetzt ist.
pl: Ustawia B<RES_NOTLDQUERY> w I<_res.options>. Ta opcja powoduje, że B<res_nsearch>() nie próbuje rozwiązywać niejednoznacznej nazwy w sposób, jak gdyby była ona domeną najwyższego poziomu (ang. top level domain - TLD). Ta opcja może powodować problemy, gdy strona jako TLD ma "localhost", zamiast umieścić "localhost" jako jeden z elementów listy wyszukiwania. Opcja nie działa, jeśli nie ustawiono ani RES_DEFNAMES, ani RES_DNSRCH.

source: B<use-vc> (since glibc 2.14)
de: B<use-vc> (seit Glibc 2.14)
pl: B<use-vc> (od wersji 2.14 biblioteki glibc)

source: Sets B<RES_USEVC> in I<_res.options>. This option forces the use of TCP for DNS resolutions.
de: setzt B<RES_USEVC> in I<_res.options>. Diese Option erzwingt die Verwendung von TCP für DNS-Auflösungen.
pl: Ustawia B<RES_USEVC> w I<_res.options>. Wymusza użycie TCP do rozwiązywania nazw DNS.

source: B<no-reload> (since glibc 2.26)
de: B<no-reload> (seit Glibc 2.26)
pl: B<no-reload> (od wersji 2.26 biblioteki glibc)

source: Sets B<RES_NORELOAD> in I<_res.options>. This option disables automatic reloading of a changed configuration file.
de: setzt B<RES_NORELOAD> in I<_res.options>. Diese Option deaktiviert das automatische Neuladen einer geänderten Konfigurationsdatei.
pl: Ustawia B<RES_NORELOAD> w I<_res.options>. Opcja wyłącza automatyczne przeładowanie zmienionego pliku konfiguracyjnego.

source: B<trust-ad> (since glibc 2.31)
de: B<trust-ad> (seit Glibc 2.31)
pl: B<trust-ad> (od wersji 2.31 biblioteki glibc)

source: Sets B<RES_TRUSTAD> in I<_res.options>. This option controls the AD bit behavior of the stub resolver. If a validating resolver sets the AD bit in a response, it indicates that the data in the response was verified according to the DNSSEC protocol. In order to rely on the AD bit, the local system has to trust both the DNSSEC-validating resolver and the network path to it, which is why an explicit opt-in is required. If the B<trust-ad> option is active, the stub resolver sets the AD bit in outgoing DNS queries (to enable AD bit support), and preserves the AD bit in responses. Without this option, the AD bit is not set in queries, and it is always removed from responses before they are returned to the application. This means that applications can trust the AD bit in responses if the B<trust-ad> option has been set correctly.
de: setzt B<RES_TRUSTAD> in I<_res.options>. Diese Option steuert das Bit AD-Bit-Verhalten des Stub-Resolvers. Falls ein überprüfender Resolver das AD-Bit in einer Antwort setzt, zeigt er an, dass die Daten in der Antwort entsprechend des DNSSSEC-Protokolls überprüft wurden. Um sich auf das AD-Bit zu verlassen, muss das lokale System sowohl dem DNSSEC-überprüfenden Resolver als auch dem dahin führenden Netzwerkpfad vertrauen, weshalb eine ausdrückliche Zustimmung zur Nutzung notwendig ist. Falls die Option B<trust-ad> aktiv ist, setzt der Stub-Resolver das AD-Bit in ausgehenden DNS-Anfragen (um AD-Bit-Unterstützung zu aktivieren) und behält das AD-Bit in Antworten bei. Ohne diese Option wird das AD-Bit in Anfragen nicht gesetzt und immer in Antworten entfernt, bevor diese an die Anwendung zurückgeliefert werden. Das bedeutet, dass Anwendungen dem AD-Bit in Antworten vertrauen können, wenn die Option B<trust-ad> korrekt eingerichtet wurde.
pl: Ustawia B<RES_TRUSTAD> w I<_res.options>. Opcja kontroluje zachowanie bitu AD w minimalnym mechanizmie rozwiązującym nazwy (ang. stub resolver). Jeśli walidująca funkcja obsługi nazw ustawi bit AD w odpowiedzi, oznacza to że dane zawarte w odpowiedzi zostały zweryfikowane zgodnie z protokołem DNSSEC. Aby móc polegać na bicie AD, lokalny system musi ufać zarówno walidującej funkcji, jak i ścieżce sieciowej prowadzającej do niej - co jest powodem konieczności jawnego włączenia tego ustawienia. Jeśli opcja B<trust-ad> jest aktywna, minimalny mechanizm rozwiązujący nazwy ustawia bit AD w wychodzących zapytaniach DNS (aby włączyć obsługę bitu AD) i zachowuje go w odpowiedziach. Bez tej opcji, bit AD nie jest ustawiany w zapytaniach oraz jest zawsze usuwany z odpowiedzi, przed ich przekazaniem aplikacjom. Oznacza to, że aplikacje mogą zaufać bitowi AD w odpowiedziach, jeśli opcja B<trust-ad> została prawidłowo ustawiona.

source: In glibc version 2.30 and earlier, the AD is not set automatically in queries, and is passed through unchanged to applications in responses.
de: In Glibc bis Version 2.30 wurde AD in Abfrage nicht automatisch gesetzt und in Antworten an Anwendungen unverändert weitergegeben.
pl: W wersjach glibc 2.30 i starszych, AD nie jest ustawiany automatycznie w zapytaniach, a w odpowiedziach jest przekazywany aplikacjom bez żadnych zmian.

source: The I<search> keyword of a system's I<resolv.conf> file can be overridden on a per-process basis by setting the environment variable B<LOCALDOMAIN> to a space-separated list of search domains.
de: Das Schlüsselwort I<search> aus der I<resolv.conf> eines Systems kann von Prozessen individuell außer Kraft gesetzt werden, indem der Umgebungsvariablen B<LOCALDOMAIN> eine Liste von durch Leerzeichen getrennten Domains zugewiesen wird.
pl: Słowo kluczowe I<search> systemowego I<resolv.conf> można nadpisać dla danego procesu nadając zmiennej środowiskowej B<LOCALDOMAIN> wartość będącą rozdzieloną spacjami listą domen poszukiwania.

source: The I<options> keyword of a system's I<resolv.conf> file can be amended on a per-process basis by setting the environment variable B<RES_OPTIONS> to a space-separated list of resolver options as explained above under B<options>.
de: Das Schlüsselwort I<options> der systemweiten I<resolv.conf>-Datei kann von Prozessen individuell ergänzt werden, indem die Umgebungsvariable B<RES_OPTIONS> auf eine Liste von durch Leerzeichen getrennten Resolver-Optionen gesetzt wird, wie sie unter B<options> beschrieben wurden.
pl: Słowo kluczowe I<options> systemowego I<resolv.conf> można poprawić dla danego procesu nadając zmiennej środowiskowej B<RES_OPTIONS> wartość będącą rozdzieloną spacjami listą opcji obsługi nazw (opcje opisano powyżej, pod hasłem B<options>).

source: The keyword and value must appear on a single line, and the keyword (e.g., B<nameserver>) must start the line. The value follows the keyword, separated by white space.
de: Konfigurationsoptionen und ihre Werte müssen gemeinsam auf einer Zeile stehen. Die Zeile muss mit dem Namen der Konfigurationsoption (z.B. B<nameserver>) beginnen. Auf den Namen der Konfigurationsoption folgt der Wert, bzw. folgen die Werte. Alle Felder sind durch Leerzeichen oder Tabulator zu trennen.
pl: Słowo kluczowe i wartość muszą pojawiać się w tej samej linii oraz słowo kluczowe (np. B<nameserver>) musi rozpoczynać linię. Wartość jest elementem następującym po słowie kluczowym i jest od niego oddzielona znakiem spacji lub tabulacji.

source: Lines that contain a semicolon (;) or hash character (#) in the first column are treated as comments.
de: Zeilen, die ein Semikolon (;) oder ein Nummernzeichen (#) in der ersten Spalte enthalten, werden als Kommentare behandelt.
pl: Linie zaczynające się od znaku średnika (";") lub hasha ("#") są traktowane jako komentarze.

source: FILES
de: DATEIEN
pl: PLIKI

source: SEE ALSO
de: SIEHE AUCH
pl: ZOBACZ TAKŻE

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
pl: Podręcznik programisty Linuksa

source: Some programs behave strangely when this option is turned on.
de: Wenn diese Option gewählt wurde, verhalten sich einige Programme recht merkwürdig.
pl: Niektóre programy zachowują się dziwacznie, jeśli ta opcja jest włączona.

source: Sets B<RES_USE_EDNSO> in I<_res.options>. This enables support for the DNS extensions described in RFC\ 2671.
de: setzt B<RES_USE_EDNSO> in I<_res.options>. Damit wird die Unterstützung für die in RFR\ 2671 beschriebenen DNS-Erweiterungen aktiviert.
pl: Ustawia B<RES_USE_EDNSO> w I<_res.options>. Włącza to obsługę rozszerzeń DNS opisanych w RFC\ 2671.

source: COLOPHON
de: KOLOPHON
pl: O STRONIE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: The I<resolver> is a set of routines in the C library that provide access to the Internet Domain Name System (DNS). The resolver configuration file contains information that is read by the resolver routines the first time they are invoked by a process. The file is designed to be human readable and contains a list of keywords with values that provide various types of resolver information. The configuration file is considered a trusted source of DNS information (e.g., DNSSEC AD-bit information will be returned unmodified from this source).
de: Der I<Resolver> ist eine Sammlung von Routinen in der C-Bibliothek, über die auf das Internet-Namenssystem (Domain Name System, DNS) zugegriffen wird. Die Konfigurationsdatei des Resolvers enthält Informationen, die beim ersten Aufruf einer Resolver-Routine durch einen Prozess eingelesen werden. Die Datei wurde menschenlesbar entworfen und enthält eine Liste von Schlüsselworten und Werten, die verschiedene Typen von Resolver-Informationen bereitstellen. Die Konfigurationsdatei wird als eine vertrauenswürdige Quelle für DNS-Informationen betrachtet (z.B. werden DNSSEC-AD-bit-Informationen unverändert aus dieser Quelle zurückgeliefert).
pl: Obsługa nazw (I<resolver>) jest zbiorem funkcji biblioteki C, które umożliwiają dostęp do internetowego systemu serwerów nazw (DNS). Plik konfiguracyjny zawiera informacje, odczytywane przez procedury obsługi nazw podczas ich pierwszego wywołania przez proces, i jest czytelny zarówno dla maszyny, jak i dla człowieka. Zawiera listę słów kluczowych z wartościami, które udostępniają różne informacje dotyczące obsługi nazw. Plik konfiguracyjny jest uważany za zaufane źródło informacji DNS (np. informacje DNSSEC AD-bit z tego źródła będą zwracane w postaci niezmodyfikowanej).

source: If this file does not exist, only the name server on the local machine will be queried; the domain name is determined from the hostname and the domain search path is constructed from the domain name.
de: Wenn diese Datei nicht vorhanden ist, wird nur der Name-Server auf dem lokalen Rechner abgefragt; der Domain-Name wird aus dem Rechnernamen bestimmt und der Domain-Suchpfad wird aus dem Domain-Namen konstruiert.
pl: Jeśli ten plik nie istnieje to jedynym odpytywanym serwerem nazw jest wtedy ten z maszyny lokalnej. Nazwa domeny jest określana z nazwy komputera lokalnego, a ścieżka poszukiwania domen jest konstruowana z nazwy domeny.

source: B<domain> Local domain name.
de: B<domain> Lokaler Domain-Name.
pl: B<domain> Nazwa lokalnej domeny.

source: Most queries for names within this domain can use short names relative to the local domain. If set to \(aq.\(aq, the root domain is considered. If no B<domain> entry is present, the domain is determined from the local hostname returned by B<gethostname>(2); the domain part is taken to be everything after the first \(aq.\(aq. Finally, if the hostname does not contain a domain part, the root domain is assumed.
de: Die meisten Abfragen für Namen innerhalb der Domain können kurze Namen relativ zu der lokalen Domain verwenden. Falls auf \(aq.\(aq gesetzt, wird die Wurzel-Domain betrachtet. Falls kein B<domain>-Eintrag vorhanden ist, wird die Domain anhand des lokalen Rechnernamens ermittelt, der von B<gethostname>(2) geliefert wird. Es wird in diesem Fall davon ausgegangen, dass die Domain der Teil ist, der rechts vom ersten \(aq.\(aq steht. Wenn der Rechnername kein Domain-Anteil enthält, wird die Root-Domain angenommen.
pl: Większość zapytań o nazwy wewnątrz tej domeny może odbywać się z zastosowaniem krótkich nazw, podanych względem lokalnej domeny. Jeśli ustawione na ".", pod uwagę brana jest domena główna. Jeśli pozycja B<domain> nie jest obecna, jest ona określana na podstawie nazwy lokalnego komputera, zwróconej przez B<gethostname>(2) - za domenę uważa się wszystko po pierwszej ".". Ostatecznie, jeśli nazwa komputera nie zawiera części domenowej, przyjmowana jest domena główna.

source: The search list is normally determined from the local domain name; by default, it contains only the local domain name. This may be changed by listing the desired domain search path following the I<search> keyword with spaces or tabs separating the names. Resolver queries having fewer than I<ndots> dots (default is 1) in them will be attempted using each component of the search path in turn until a match is found. For environments with multiple subdomains please read B<options ndots:>I<n> below to avoid man-in-the-middle attacks and unnecessary traffic for the root-dns-servers. Note that this process may be slow and will generate a lot of network traffic if the servers for the listed domains are not local, and that queries will time out if no server is available for one of the domains.
de: Die Suchliste wird normalerweise aus dem lokalen Domain-Namen bestimmt; standardmäßig enthält sie nur den lokalen Domain-Namen. Dieses Verhalten kann geändert werden, indem mit dem Schlüsselwort I<search> ein Suchpfad für die Domain-Auflösung angegeben wird, dessen Bestandteile durch Tabulatoren oder Leerzeichen voneinander zu trennen sind. Anfragen an den Resolver mit weniger als I<ndots> Punkten (Standardwert ist 1) werden versuchen, jeden Eintrag dieses Suchpfads abzuarbeiten, bis ein gültiger Namenseintrag gefunden wurde. Für Umgebungen mit mehreren Subdomains lesen Sie bitte B<options ndots:>I<n> weiter unten, wie Sie »Mann-in-der-Mitte«-Angriffe und unnötigen Verkehr für die Root-DNS-Server vermeiden. Beachten Sie, dass dieser Vorgang langsam sein kann und viel Netzwerkverkehr erzeugt, wenn die DNS-Server für die betreffenden Domains nicht lokal sind. Außerdem können Anfragen mit einer Zeitüberschreitung beendet werden, wenn kein Server für eine der genannten Domains erreichbar ist.
pl: Lista ta jest zwykle określana na podstawie nazwę lokalnej domeny; domyślnie też zawiera tylko tę nazwę. Można to zmienić, przez podanie żądanej ścieżki poszukiwania domeny po słowie kluczowym I<search>, używając spacji lub tabulacji do oddzielenia nazw. Funkcje obsługi nazw dla zapytań zawierających w sobie mniej niż I<ndots> kropek (domyślnie - 1) będą próbowały kolejnych składników ścieżki poszukiwania, aż do znalezienia. Dla środowisk z wieloma poddomenami, proszę przeczytać poniżej B<options ndots:>I<n>, aby uniknąć ataków typu man-in-the-middle oraz niepotrzebnego odpytywania głównych serwerów nazw. Należy zauważyć, że proces ten może być powolny i powodować duże obciążenie sieci, jeśli serwery dla podanych domen nie są lokalne, a czas oczekiwania na odpowiedź po zapytaniu przekracza czas oczekiwania, gdy dla którejś z domen wszystkie serwery są niedostępne.

source: The search list is currently limited to six domains with a total of 256 characters.
de: Die Suchliste ist auf 6 Domains und eine Gesamtlänge von 256 Zeichen beschränkt.
pl: Lista poszukiwania jest obecnie ograniczona do sześciu domen z maksymalną liczbą 256 znaków.

source: Sets the amount of time the resolver will wait for a response from a remote name server before retrying the query via a different name server. This may B<not> be the total time taken by any resolver API call and there is no guarantee that a single resolver API call maps to a single timeout. Measured in seconds, the default is B<RES_TIMEOUT> (currently 5, see I<E<lt>resolv.hE<gt>>). The value for this option is silently capped to 30.
de: setzt die Wartezeit auf die Antwort eines Name-Servers in der Ferne fest, nach deren Ablauf der Resolver die Anfrage an einen anderen Name-Server richtet. Dies muss B<nicht> die gesamte von dem Resolver-API-Aufruf verwandte Zeit sein und es gibt keine Garantie, dass ein einzelner Resolver-API-Aufruf auf eine einzelne Zeitüberschreitung passt. Sie wird in Sekunden gemessen, der Standardwert ist B<RES_TIMEOUT> (derzeit 5, siehe I<E<lt>resolv.hE<gt>>). Der Maximalwert für diese Option ist 30.
pl: Ustawia czas, przez który funkcja obsługi nazw będzie czekać na odpowiedź ze zdalnego serwera nazw przed wysłaniem zapytania do innego serwera nazw. Może to B<nie> być całkowity czas, jaki jaki zajmie wywołanie interfejsu obsługi nazw i brak gwarancji, że pojedyncze wywołanie odpowiada jednemu limitowi czasu. Wyrażony w sekundach, domyślnie - B<RES_TIMEOUT> (obecnie 5, patrz E<lt>resolv.hE<gt>). Maksymalną wartością jest 30, większe wartości zostaną zmniejszone, bez wypisywania żadnych ostrzeżeń.

source: B<ip6-bytestring> (since glibc 2.3.4)
de: B<ip6-bytestring> (seit Glibc 2.3.4)
pl: B<ip6-bytestring> (od wersji 2.3.4 biblioteki glibc)

source: The I<domain> and I<search> keywords are mutually exclusive. If more than one instance of these keywords is present, the last instance wins.
de: Die Schlüsselwörter I<domain> und I<search> schließen sich gegenseitig aus. Falls mehr als eine Instanz dieser Schlüsselwörter vorhanden ist, gewinnt die letzte.
pl: Słowa kluczowe B<domain> i B<search> wzajemnie się wykluczają. Jeśli istnieje więcej niż jedna ich instancja, używana jest ostatnia z nich.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: B<options> I<option> I<...>
pl: B<options> I<opcja> I<...>
