Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-coolscan.5.po
Languages: de

source: 13 Jul 2008
de: 13. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-coolscan - SANE backend for Nikon film-scanners
de: sane-coolscan - SANE-Backend für Filmscanner von Nikon

source: ABOUT THIS FILE
de: ÜBER DIESE DATEI

source: This file is a short description of the coolscan backend for B<SANE>.
de: Diese Datei ist eine Kurzbeschreibung des Coolscan-Backends für B<SANE>.

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-coolscan> library implements a SANE backend that provides the interface to the following Nikon Coolscan Film scanners: Nikon LS20, LS30, LS1000, LS2000.
de: Die Bibliothek B<sane-coolscan> implementiert ein SANE-Backend, das eine Schnittstelle für die folgenden Coolscan-Filmscanner von Nikon bereitstellt: Nikon LS20, LS30, LS1000, LS2000.

source: B<Even though the backend has worked for a number of people, there are still some> problems, especially in combination with some SCSI card/drivers (AHA-1505/aha152x.o) and the autofocus command. You should consider this backend 'alpha' and be careful when using it the first time.
de: B<Obwohl das Backend schon bei einer Reihe von Leuten funktioniert hat, gibt es noch einige Probleme>, insbesondere bei einigen SCSI-Karte/Treiberkombinationen (AHA-1505/aha152x.o) und dem Befehl zum automatischen Fokussieren. Betrachten Sie dieses Backend daher als im »Alpha«-Stadium und geben Sie Acht, wenn Sie es zum ersten Mal verwenden.

source: CONFIGURATION
de: KONFIGURATION

source: The configuration file for this backend resides in I</etc/sane.d/coolscan.conf>.
de: Die Konfigurationsdatei für dieses Backend befindet sich in I</etc/sane.d/coolscan.conf>.

source: Its content is a list of device names that correspond to Nikon Coolscan scanners. Empty lines and lines starting with a hash mark (#) are ignored. A sample configuration file is shown below:
de: Sie enthält eine Liste von Gerätenamen, die Nikon-Coolscan-Scannern entsprechen. Leere Zeilen und solche, die mit einer Raute (#) beginnen, werden ignoriert. Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: The special device name must be a generic SCSI device or a symlink to such a device. To find out to which device your scanner is assigned and how you can set the permissions of that device, have a look at B<sane-scsi>(5).
de: Der Name der Geräte-Spezialdatei muss ein generisches SCSI-Gerät oder ein symbolischer Link darauf sein. Um zu ermitteln, welcher Gerätedatei Ihr Scanner zugeordnet ist und wie Sie die Zugriffsrechte für dieses Gerät festlegen können, werfen Sie einen Blick auf B<sane-scsi>(5).

source: SCSI ADAPTER TIPS
de: TIPPS FÜR SCSI-ADAPTER

source: Some SCSI-adapters and low-level SCSI drivers do not work correctly with this backend and the Coolscan scanners. These systems hang when the autofocus command is send to the Scanner. To see a list of which card/driver combinations work or don't work have a look at: I<http://andreas.rick.free.fr/sane/autofocus.html.>
de: Einige SCSI-Adapter und systemnahe SCSI-Treiber funktionieren mit diesem Backend und den Coolscan-Geräten nicht korrekt. Diese Systeme bleiben hängen, wenn der Befehl zum automatischen Fokussieren an den Scanner gesendet wird. Eine Liste der funktionierenden bzw. nicht funktionierenden Treiber/Karten-Kombinationen finden Sie unter I<http://andreas.rick.free.fr/sane/autofocus.html>.

source: FILES
de: DATEIEN

source: The backend configuration file:
de: Die Backend-Konfigurationsdatei:

source: The static library implementing this backend:
de: Die statische Bibliothek, die dieses Backend implementiert:

source: The shared library implementing this backend:
de: Die dynamische Bibliothek, die dieses Backend implementiert:

source: I</usr/lib/sane/libsane-coolscan.so> (present on systems that support dynamic loading)
de: I</usr/lib/sane/libsane-coolscan.so> (auf Systemen verfügbar, die dynamisches Laden unterstützen)

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: Examples:
de: Beispiele für SANE_DEBUG_COOLSCAN-Werte:

source: On bash:
de: Für Bash:

source: On csh:
de: Für Csh:

source: BUGS
de: FEHLER

source: The autofocus command does not work with some SCSI card/driver combinations.
de: Der Autofokus-Befehl funktioniert mit einigen SCSI-Karte/Treiber-Kombinationen nicht.

source: The gamma table is not implemented for the LS1000 yet.
de: Die Gamma-Tabelle wurde für den LS1000 bisher noch nicht implementiert.

source: The dust-removal is not working yet.
de: Die Staubentfernung funktioniert noch nicht.

source: SEE ALSO
de: SIEHE AUCH

source: The homepage of this backend.
de: Die Projektseite dieses Backends.

source: The original version of the coolscan backend by Didier.
de: Die ursprüngliche Version des Coolscan-Backends von Didier.

source: THANKS TO
de: DANK AN

source: Didier Carlier - For writing the original Coolscan backend (without it I would not have started this).
de: Didier Carlier - Für das Schreiben des ursprünglichen Coolscan-Backends (ohne das ich dies nie begonnen hätte).

source: Oliver Rauch - For adapting xsane so quickly to the infrared stuff.
de: Oliver Rauch - Für die schnelle Adaptierung von Xsane an die Infrarotfunktionen.

source: All the other people working on SANE.
de: Alle anderen Leute, die an SANE arbeiten.

source: AUTHOR
de: AUTOR

source: EMAIL-CONTACT
de: KONTAKT PER E-MAIL

source: This file is a short description of the coolscan-backend for sane!
de: Diese Datei ist eine Kurzbeschreibung des Coolscan-Backends für SANE.

source: B<Even though the backend has worked for a number of people, there are still some problems, especially in combination with some SCSI card/drivers (AHA-1505/aha152x.o) and the autofocus command. You should consider this backend 'alpha' and be careful when using it the first time.>
de: B<Obwohl das Backend schon bei einer Reihe von Leuten funktioniert hat, gibt es noch einige Probleme, insbesondere bei einigen SCSI-Karte/Treiberkombinationen (AHA-1505/aha152x.o) und dem Befehl zum automatischen Fokussieren. Betrachten Sie dieses Backend daher als im »Alpha«-Stadium und geben Sie Acht, wenn Sie es zum ersten Mal verwenden.>

source: Its contents is a list of device names that correspond to Nikon Coolscan scanners. Empty lines and lines starting with a hash mark (#) are ignored. A sample configuration file is shown below:
de: Sie enthält eine Liste von Gerätenamen, die Nikon-Coolscan-Scannern entsprechen. Leere Zeilen und solche, die mit einer Raute (#) beginnen, werden ignoriert. Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: The special device name must be a generic SCSI device or a symlink to such a device. To find out to which device your scanner is assigned and how you have to set the permissions of that device, have a look at sane-scsi.
de: Der Name der Geräte-Spezialdatei muss ein generisches SCSI-Gerät oder ein symbolischer Link darauf sein. Um zu ermitteln, welcher Gerätedatei Ihr Scanner zugeordnet ist und wie Sie die Zugriffsrechte für dieses Gerät festlegen können, werfen Sie einen Blick auf B<sane-scsi>(5).

source: Some SCSI-adapters and low-level SCSI drivers do not work correctly with this backend and the Coolscan scanners. These systems hang when the autofocus command is send to the Scanner. To see a list of which card/driver combinations work or don't work have a look at: http://andreas.rick.free.fr/sane/autofocus.html.
de: Einige SCSI-Adapter und systemnahe SCSI-Treiber funktionieren mit diesem Backend und den Coolscan-Geräten nicht korrekt. Diese Systeme bleiben hängen, wenn der Befehl zum automatischen Fokussieren an den Scanner gesendet wird. Eine Liste der funktionierenden bzw. nicht funktionierenden Treiber/Karten-Kombinationen finden Sie unter http://andreas.rick.free.fr/sane/autofocus.html.

source: I</usr/lib/x86_64-linux-gnu/sane/libsane-coolscan.so> (present on systems that support dynamic loading)
de: I</usr/lib/x86_64-linux-gnu/sane/libsane-coolscan.so> (auf Systemen verfügbar, die dynamisches Laden unterstützen)

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity: SANE_DEBUG_COOLSCAN values
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit:

source: on bash:
de: für Bash:

source: on csh:
de: für Csh:

source: The autofocus command does not work with some SCSI card/driver combinations
de: Der Autofokus-Befehl funktioniert mit einigen SCSI-Karte/Treiber-Kombinationen nicht.

source: The dust-removal is not working yet
de: Die Staubentfernung funktioniert noch nicht.

source: The homepage of this backend
de: Die Projektseite dieses Backends

source: The original version of the coolscan backend by Didier
de: Die ursprüngliche Version des Coolscan-Backends von Didier

source: sane(7), sane-scsi(5)
de: B<sane>(7), B<sane-scsi>(5)

source: Didier Carlier - For writing the original Coolscan backend (without it I would not have started this)
de: Didier Carlier - Für das Schreiben des ursprünglichen Coolscan-Backends (ohne das ich dies nie begonnen hätte)

source: I</usr/lib64/sane/libsane-coolscan.so> (present on systems that support dynamic loading)
de: I</usr/lib64/sane/libsane-coolscan.so> (auf Systemen verfügbar, die dynamisches Laden unterstützen)
