Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-teco2.5.po
Languages: de

source: 14 Jul 2008
de: 14. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-teco2 - SANE backend for TECO / RELISYS scanners
de: sane-teco2 - SANE-Backend für Scanner von TECO/RELISYS

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-teco2> library implements a SANE (Scanner Access Now Easy) backend that provides access to some TECO SCSI flatbed scanners. This backend should be considered B<beta-quality> software! TECO scanners are sold under various brands like Mustek, Relisys, Piotech, Primax, TRUST. This backend may or may not support yours.
de: Die Bibliothek B<sane-teco2> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf einige TECO-SCSI-Flachbett-Scanner. Dieses Backend sollte als B<Beta-Qualität>-Software betrachtet werden! TECO-Scanner werden unter verschiedenen Marken wie Mustek, Relisys, Piotech, Primax und TRUST verkauft. Dieses Backend könnte Ihren Scanner unterstützen oder auch nicht.

source: The scanners that should work with this backend are:
de: Die folgenden Scanner sollten mit diesem Backend funktionieren:

source: \f(CR Vendor Model TECO model status --------------------------- -------------- ----------- Mustek ScanMagic 4830S VM3575 untested Primax Jewel 4800 VM356A good Primax Profi 9600 VM6575 basic Primax Profi 19200 VM6586 good Relisys APOLLO Express 3 VM356A basic Relisys APOLLO Express 6 VM6565 good Relisys APOLLO Express 12 ? untested Relisys AVEC II S3 VM3564 good Relisys AVEC Super 3 VM3575 basic Relisys SCORPIO Pro VM6575 good Relisys SCORPIO Pro-S VM6586 untested Relisys SCORPIO Super 3 VM3575 good\fR
de: \f(CR Marke Modell TECO-Modell Status -------------------------- -------------- ----------- Mustek ScanMagic 4830S VM3575 nicht getestet Primax Jewel 4800 VM356A gut Primax Profi 9600 VM6575 grundlegend Primax Profi 19200 VM6586 gut Relisys APOLLO Express 3 VM356A grundlegend Relisys APOLLO Express 6 VM6565 gut Relisys APOLLO Express 12 ? nicht getestet Relisys AVEC II S3 VM3564 gut Relisys AVEC Super 3 VM3575 grundlegend Relisys SCORPIO Pro VM6575 gut Relisys SCORPIO Pro-S VM6586 nicht getestet Relisys SCORPIO Super 3 VM3575 gut\fR

source: For all these scanners, lineart and gray mode work well. However, most of them do not support more than a handful of resolutions in color mode. See the backend home page (under AUTHOR) for the exact status of each scanner.
de: Für alle diese Scanner funktioniert der Lineart- und Graumodus gut. Allerdings unterstützen die meisten nicht mehr als eine Handvoll Auflösungen im Farbmodus. Siehe die Homepage das Backends (unter AUTOR) für den genauen Status jedes Scanners.

source: Note that the untested scanner will not be directly supported. You should contact the author for that.
de: Beachten Sie, dass nicht getestete Scanner nicht direkt unterstützt werden. Sie sollten dafür zum Autor Kontakt aufnehmen.

source: The TECO VM number can usually be found at the back of the scanner. It is also part of the FCC ID.
de: Die TECO-Marken-Modell-Nummer kann normalerweise auf der Rückseite des Scanners gefunden werden. Sie ist auch Teil der FCC-Kennung (FCC-ID).

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xscanimage>(1), B<xsane>(1), B<quiteinsane>(1) or B<kooka>(1).
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1), B<xsane>(1), B<quiteinsane>(1) oder B<kooka>(1) gesteuert werden.

source: If you have any success with a scanner not listed here, or if you notice any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einem hier nicht aufgeführten Scanner Erfolg haben oder falls Sie merkwürdiges Verhalten beobachten, berichten Sie das bitte (auf Englisch) an den Backend-Betreuer oder an die SANE-Mailingliste.

source: OPTIONS
de: OPTIONEN

source: Valid command line options and their syntax can be listed by using:
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: B<Scan Mode>
de: B<Scanmodus>

source: selects the basic mode of operation of the scanner. The I<Lineart> mode is black and white only (1 bit). I<Gray> mode will produce 256 levels of gray (8 bits). I<Color> will produce a 24 bits color image.
de: wählt den grundlegenden Betriebsmodus des Scanners. Der Modus I<Lineart> ist nur schwarz und weiß (1 bit). Der Modus I<Gray> wird 256 Graustufen (8 bit) erzeugen. I<Color> erstellt ein 24-bit-Farbbild.

source: Selects the resolution for a scan. The scanner can do all resolutions between 1 and 600, in increments of 1, for I<Lineart> and I<Gray>. For I<Color>, a restricted set of resolutions are available.
de: wählt die Scan-Auflösung. Der Scanner beherrscht für I<Lineart> und I<Gray> alle Auflösungen zwischen 1 und 600, in Schritten von 1. Für I<Color> ist eine eingeschränkte Menge an Auflösungen verfügbar.

source: B<Note:> All values with ydpi E<gt> 300 (300 x 600) or 600 (600 x 1200) result in a wrong proportion for the scan. The proportion can be adjusted with the following B<convert>(1) command from imagemagick:
de: B<Hinweis>: Alle Werte mit ydpi E<gt> 300 (300 x 600) oder 600 (600 x 1200) führen zu falschen Proportionen im Scan. Die Proportionen können mit dem folgenden Befehl B<convert>(1) von Imagemagick angepasst werden:

source: max_xdpi is for the vm3575 constant with 300 dpi e.g. 600dpi adjust with: convert -geometry 200%x100%
de: max_xdpi ist für die vm3575-Konstante bei 300 DPI, für z.B. 600 DPI passen Sie diese wie folgt an: convert -geometry 200%x100%

source: requests a preview scan. The resolution used for that scan is 50 dpi (for VM356A and VM6575 75 dpi) and the scan area is the maximum allowed. The scan mode is user selected. The default is "no".
de: fordert einen Vorschau-Scan an. Die für diesen Scan verwendete Auflösung ist 50 DPI (für VM356A und VM6575 75 DPI) und der Scan-Bereich ist der größte erlaubte. Der Scan-Modus wird vom Anwender ausgewählt. Die Vorgabe ist »no«.

source: B<Geometry options>
de: B<Geometrieoptionen>

source: Control the scan area: B<-l> sets the top left x coordinate, B<-t> the top left y coordinate, B<-x> selects the width and B<-y> the height of the scan area. All parameters are specified in millimeters by default.
de: steuert den Scan-Bereich: B<-l> setzt die obere linke X-Koordinate, B<-t> die obere linke Y-Koordinate, B<-x> wählt die Breite und B<-y> die Höhe des Scan-Bereichs aus. Alle Parameter werden standardmäßig in Millimetern angegeben.

source: B<Enhancement options>
de: B<Verbesserungsoptionen>

source: B<--custom-gamma (no custom gamma option for the VM3564 and VM356A)>
de: B<--custom-gamma (kein Option für angepasstes Gamma für den VM3564 und VM356A)>

source: (color mode only) allows the user to specify a gamma table (see the next 3 parameters).
de: erlaubt dem Benutzer, eine Gamma-Tabelle anzugeben (nur im Farb-Modus, siehe die nächsten drei Parameter)

source: OPTIONS FOR COLOR MODE
de: OPTIONEN FÜR DEN FARBMODUS

source: These options are valid for scan mode I<Color> only.
de: Diese Optionen sind nur für den Scan-Modus I<Color> gültig.

source: Can be used to download a user defined gamma table for the red channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Rot-Kanal verwendet werden. Die Tabelle muss 256 bytes lang sein.

source: Can be used to download a user defined gamma table for the green channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Grün-Kanal verwendet werden. Die Tabelle muss 256 bytes lang sein.

source: Can be used to download a user defined gamma table for the blue channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Blau-Kanal verwendet werden. Die Tabelle muss 256 bytes lang sein.

source: OPTIONS ONLY FOR VM3564, VM356A, VM3575 and VM6575
de: OPTIONEN NUR FÜR VM3564, VM356A, VM3575 und VM6575

source: These options are only available for VM3564, VM356A, VM3575 and VM6575 models.
de: Diese Optionen sind nur für die Modelle VM3564, VM356A, VM3575 und VM6575 verfügbar.

source: Selects what red radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale 0..64 in steps of 1.
de: wählt, welche rote Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: Selects what green radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale 0..64 in steps of 1.
de: wählt, welche grüne Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: Selects what blue radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale 0..64 in steps of 1.
de: wählt, welche blaue Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/teco2.conf> supports only one item: the device name to use (eg I</dev/scanner>).
de: Die Konfigurationsdatei I</etc/sane.d/teco2.conf> unterstützt nur einen Eintrag: den Namen des zu verwendenden Geräts (zum Beispiel I</dev/scanner>).

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: Either 0 or 1. Selects the algorithm for the calibration. A value of 1 seems to give better scans on the VM356A, VM3575. Feedback on it is welcome. For VM3564, VM356A, VM3575, VM6575 default 1. For other supported types default 0.
de: Entweder 0 oder 1. Wählt den Kalibrierungsalgorithmus. Ein Wert von 1 scheint bessere Scans auf dem VM356A, VM3575 zu ergeben. Rückmeldung hierzu ist willkommen. Für VM3564, VM356A, VM3575, VM6575 ist die Vorgabe 1. Für andere unterstützte Typen ist die Vorgabe 0.

source: LIMITATIONS
de: EINSCHRÄNKUNGEN

source: The windows TWAIN driver has many more options than this SANE backend. However they are only software adjustments. This backend only implements what the scanner can support.
de: Der TWAIN-Treiber für Windows verfügt über weitaus mehr Optionen als dieses SANE-Backend. Allerdings sind diese nur softwareseitige Anpassungen. Dieses Backend implementiert nur das, was der Scanner unterstützen kann.

source: BUGS
de: FEHLER

source: Plenty. Parts of this backend are still under development.
de: Viele. Teile dieses Backends befinden sich noch in der Entwicklung.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: The package is actively maintained by Gerard Klaver.
de: Das Paket wird aktiv von Gerard Klaver betreut.

source: CREDITS
de: DANKSAGUNGEN

source: Thanks to:
de: Dank an:

source: Gerard Klaver for his relentless VM3575 testings and contributed a patch to support the VM3564 and VM356A.
de: Gerard Klaver für sein unermüdliches VM3575-Testen und er steuerte einen Patch für die Unterstützung der VM3564 und VM356A bei.

source: Mark Plowman for providing the first SCSI traces from a VM3575.
de: Mark Plowman für die Bereitstellung der ersten SCSI-Datenspuren von einem VM3575.

source: Andreas Klaedtke for providing the first SCSI traces from a VM6586 and for his testing, and to Stefan von Dombrowski for his testing.
de: Andreas Klaedtke für die Bereitstellung der ersten SCSI-Datenspuren von einem VM6586 und für sein Testen und an Stefan von Dombrowski für sein Testen.

source: Nicolas Peyresaubes for providing the first SCSI traces from a VM656A and for his testing.
de: Nicolas Peyresaubes für die Bereitstellung der ersten SCSI-Datenspuren von einem VM656A und für sein Testen.

source: Dave Parker for testing the support for the VM6575.
de: Dave Parker für das Testen der Unterstützung für den VM6575.

source: Michael Hoeller for testing the support for the VM356A.
de: Michael Hoeller für das Testen der Unterstützung für den VM356A.

source: Christoph Hoeffner for testing the support for the VM3564 (Relisys AVEC II S3 firmware 1.09).
de: Christoph Hoeffner für das Testen der Unterstützung für den VM3564 (Relisys AVEC II S3 Firmware 1.09).

source: \f(CR Vendor Model TECO model status ---------------------- -------------- ----------- Mustek ScanMagic 4830S VM3575 untested Primax Jewel 4800 VM356A good Primax Profi 9600 VM6575 basic Primax Profi 19200 VM6586 good Relisys APOLLO Express 3 VM356A basic Relisys APOLLO Express 6 VM6565 good Relisys APOLLO Express 12 ? untested Relisys AVEC II S3 VM3564 good Relisys AVEC Super 3 VM3575 basic Relisys SCORPIO Pro VM6575 good Relisys SCORPIO Pro-S VM6586 untested Relisys SCORPIO Super 3 VM3575 good\fR
de: \f(CR Marke Modell TECO-Modell Status ---------------------- -------------- ----------- Mustek ScanMagic 4830S VM3575 nicht getestet Primax Jewel 4800 VM356A gut Primax Profi 9600 VM6575 grundlegend Primax Profi 19200 VM6586 gut Relisys APOLLO Express 3 VM356A grundlegend Relisys APOLLO Express 6 VM6565 gut Relisys APOLLO Express 12 ? nicht getestet Relisys AVEC II S3 VM3564 gut Relisys AVEC Super 3 VM3575 grundlegend Relisys SCORPIO Pro VM6575 gut Relisys SCORPIO Pro-S VM6586 nicht getestet Relisys SCORPIO Super 3 VM3575 gut\fR

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in xscanimage, xsane, quiteinsane or kooka.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1), B<xsane>(1), B<quiteinsane>(1) oder B<kooka>(1) gesteuert werden.

source: If you have any success with a scanner not listed here, or if you have any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einem hier nicht aufgeführten Scanner Erfolg haben oder falls Sie merkwürdiges Verhalten beobachten, berichten Sie das bitte (auf Englisch) an den Backend-Betreuer oder an die SANE-Mailingliste.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: selects the basic mode of operation of the scanner valid choices are I<Lineart> , I<Gray> and I<Color> The Lineart mode is black and white only (1 bit). Gray mode will produce 256 levels of gray (8 bits). Color will produce a 24 bits color image.
de: wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind I<Lineart>, I<Gray> und I<Color>. Der Modus I<Lineart> ist nur schwarz und weiß (1 bit). Der Modus I<Gray> wird 256 Graustufen (8 bit) erzeugen. I<Color> erstellt ein 24-bit-Farbbild.

source: Lineart and Gray selects the resolution for a scan. The scanner can do all resolutions between 1 and 600, in increments of 1.
de: Lineart und Gray wählt die Scan-Auflösung. Der Scanner beherrscht alle Auflösungen von 1 bis 600 in Schritten von 1.

source: Color selects the resolution for a scan. The scanner can do only the resolutions listed.
de: Color wählt die Scan-Auflösung. Der Scanner beherrscht nur die aufgeführten Auflösungen.

source: All values with ydpi E<gt> 300 (300 x 600) or 600 (600 x 1200) result in a wrong proportion for the scan. The proportion can be adjusted with the following imagemagick command: convert -geometry (dpi/max_xdpi * 100%)x100% max_xdpi is for the vm3575 constant with 300 dpi e.g. 600dpi adjust with: convert -geometry 200%x100%
de: Alle Werte mit ydpi E<gt> 300 (300 x 600) oder 600 (600 x 1200) führen zu falschen Proportionen im Scan. Die Proportionen können mit dem folgenden Befehl für Imagemagick angepasst werden: convert -geometry (dpi/max_xdpi * 100%)x100% max_xdpi ist für die vm3575-Konstante bei 300 DPI, für z.B. 600 DPI passen Sie diese wie folgt an: convert -geometry 200%x100%

source: control the scan area: -l sets the top left x coordinate, -t the top left y coordinate, -x selects the width and -y the height of the scan area. All parameters are specified in millimeters by default.
de: steuern den Scan-Bereich: »-l« setzt die obere linke X-Koordinate, »-t« die obere linke Y-Koordinate, »-x« wählt die Breite und »-y« die Höhe des Scan-Bereichs. Alle Parameter werden in Millimetern angegeben.

source: (color mode only) can be used to download a user defined gamma table for the red channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Rot-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (color mode only) can be used to download a user defined gamma table for the green channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Grün-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (color mode only) can be used to download a user defined gamma table for the blue channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Blau-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (VM3564, VM356A, VM3575 and VM6575 only) Selects what red radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale 0..64 in steps of 1.
de: (nur VM3564, VM356A, VM3575 und VM6575) wählt, welche rote Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: (VM3564, VM356A, VM3575 and VM6575 only) Selects what green radiance level should be considered "white", when scanning some sheets by changing the calibration i value loaded into the scanner. Scale 0..64 in steps of 1.
de: (nur VM3564, VM356A, VM3575 und VM6575) wählt, welche grüne Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene i-Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: (VM3564, VM356A, VM3575 and VM6575 only) Selects what blue radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale 0..64 in steps of 1.
de: (nur VM3564, VM356A, VM3575 und VM6575) wählt, welche blaue Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.

source: The configuration file /etc/sane.d/teco2.conf supports only one information: the device name to use (eg /dev/scanner).
de: Die Konfigurationsdatei I</etc/sane.d/teco2.conf> unterstützt nur eine Information: den Namen des zu verwendenden Geräts (zum Beispiel I</dev/scanner>).

source: sane-scsi(5), scanimage(1), xscanimage(1), xsane(1), sane(7)
de: B<sane-scsi>(5), B<scanimage>(1), B<xscanimage>(1), B<xsane>(1), B<sane>(7)

source: Christoph.Hoeffner for testing the support for the VM3564 (Relisys AVEC II S3 firmware 1.09).
de: Christoph Hoeffner für das Testen der Unterstützung für den VM3564 (Relisys AVEC II S3 Firmware 1.09).

source: B<Note:> All values with ydpi E<gt> 300 (300 x 600) or 600 (600 x 1200) result in a wrong proportion for the scan. The proportion can be adjusted with the following imagemagick command:
de: B<Hinweis>: Alle Werte mit ydpi E<gt> 300 (300 x 600) oder 600 (600 x 1200) führen zu falschen Proportionen im Scan. Die Proportionen können mit dem folgenden Befehl für Imagemagick angepasst werden:

source: Selects what green radiance level should be considered "white", when scanning some sheets by changing the calibration i value loaded into the scanner. Scale 0..64 in steps of 1.
de: wählt, welche grüne Helligkeitsstufe als »weiß« angesehen werden soll, wenn einige Blätter eingescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist 0…64 in Stufen von 1.
