Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-plustek.5.po
Languages: de

source: 03 Nov 2017
de: 3. November 2017

source: NAME
de: BEZEICHNUNG

source: sane-plustek - SANE backend for LM983[1/2/3] based USB flatbed scanners
de: sane-plustek - SANE-Backend für LM983[1/2/3]-basierte USB-Flachbett-Scanner

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-plustek> library implements a SANE (Scanner Access Now Easy) backend that provides access to USB flatbed scanners based on National Semiconductor Merlin chipsets (LM9831, 9832 and 9833). If you're looking for parallel-port support for Plustek scanner please refer to the B<sane-plustek_pp>(5) backend.
de: Die Bibliothek B<sane-plustek> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf USB-Flachbettscanner, die auf den National Semiconductor Merlin-Chipsätzen (LM9831, 9832 und 9833) basieren. Falls Sie nach der Unterstützung von Plustek-Scannern mit Parallel-Port suchen, schauen Sie sich bitte das B<sane-plustek_pp>(5)-Backend an.

source: SUPPORTED DEVICES
de: UNTERSTÜTZTE GERÄTE

source: The Backend is able to support USB scanner based on the National Semiconductor chipsets LM9831, LM9832 and LM9833. The following tables show various devices which are currently reported to work. If your Plustek scanner has another Product ID, then the device is B<NOT> supported by this backend.
de: Das Backend ist in der Lage, USB-Scanner zu unterstützen, die auf den National Semiconductor-Chipsätzen LM9831, LM9832 und LM9833 basieren. Die nachfolgenden Tabellen zeigen verschiedene Geräte, die derzeit bekanntermaßen funktionieren. Falls Ihr Plustek-Scanner eine andere Produktkennung hat, dann wird das Gerät B<NICHT> von diesem Backend unterstützt.

source: Vendor Plustek - ID: 0x07B3
de: Lieferant Plustek - Kennung: 0x07B3

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- OpticPro U12 LM9831 600x1200dpi 42bit 512Kb 0x0010 OpticPro UT12 LM9831 600x1200dpi 42bit 512Kb 0x0013 OpticPro UT12 LM9832 600x1200dpi 42bit 512Kb 0x0017 OpticPro UT16 LM9832 600x1200dpi 42bit 512Kb 0x0017 OpticPro U24 LM9831 1200x2400dpi 42bit 2Mb 0x0011 OpticPro U24 LM9832 1200x2400dpi 42bit 2Mb 0x0015 OpticPro UT24 LM9832 1200x2400dpi 42bit 2Mb 0x0017\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- OpticPro U12 LM9831 600x1200 DPI 42 bit 512 kB 0x0010 OpticPro UT12 LM9831 600x1200 DPI 42 bit 512 kB 0x0013 OpticPro UT12 LM9832 600x1200 DPI 42 bit 512 kB 0x0017 OpticPro UT16 LM9832 600x1200 DPI 42 bit 512 kB 0x0017 OpticPro U24 LM9831 1200x2400 DPI 42 bit 2 MB 0x0011 OpticPro U24 LM9832 1200x2400 DPI 42 bit 2 MB 0x0015 OpticPro UT24 LM9832 1200x2400 DPI 42 bit 2 MB 0x0017\fR

source: Vendor KYE/Genius - ID: 0x0458
de: Lieferant KYE/Genius - Kennung: 0x0458

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- Colorpage HR6 V2 LM9832 600x1200dpi 42bit 512Kb 0x2007 Colorpage HR6 V2 LM9832 600x1200dpi 42bit 512Kb 0x2008 Colorpage HR6A LM9832 600x1200dpi 42bit 512Kb 0x2009 Colorpage HR7 LM9832 600x1200dpi 42bit 512Kb 0x2013 Colorpage HR7LE LM9832 600x1200dpi 42bit 512Kb 0x2015 Colorpage HR6X LM9832 600x1200dpi 42bit 512Kb 0x2016\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- Colorpage HR6 V2 LM9832 600x1200 DPI 42 bit 512 kB 0x2007 Colorpage HR6 V2 LM9832 600x1200 DPI 42 bit 512 kB 0x2008 Colorpage HR6A LM9832 600x1200 DPI 42 bit 512 kB 0x2009 Colorpage HR7 LM9832 600x1200 DPI 42 bit 512 kB 0x2013 Colorpage HR7LE LM9832 600x1200 DPI 42 bit 512 kB 0x2015 Colorpage HR6X LM9832 600x1200 DPI 42 bit 512 kB 0x2016\fR

source: Vendor Hewlett-Packard - ID: 0x03F0
de: Lieferant Hewlett-Packard - Kennung: 0x03F0

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- ScanJet 2100C LM9831 600x1200dpi 42bit 512Kb 0x0505 ScanJet 2200C LM9832 600x1200dpi 42bit 512Kb 0x0605\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- ScanJet 2100C LM9831 600x1200 DPI 42 bit 512 kB 0x0505 ScanJet 2200C LM9832 600x1200 DPI 42 bit 512 kB 0x0605\fR

source: Vendor Mustek - ID: 0x0400
de: Lieferant Mustek - Kennung: 0x0400

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- BearPaw 1200 LM9831 600x1200dpi 42bit 512Kb 0x1000 BearPaw 1200 LM9832 600x1200dpi 42bit 512Kb 0x1001* BearPaw 2400 LM9832 1200x2400dpi 42bit 2Mb 0x1001\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- BearPaw 1200 LM9831 600x1200 DPI 42 bit 512 kB 0x1000 BearPaw 1200 LM9832 600x1200 DPI 42 bit 512 kB 0x1001* BearPaw 2400 LM9832 1200x2400 DPI 42 bit 2 MB 0x1001\fR

source: * see also description for model override switch below!
de: * siehe auch die nachfolgende Beschreibung für den Schalter zum Außerkraftsetzen des Modells

source: Vendor UMAX - ID: 0x1606
de: Lieferant UMAX - Kennung: 0x1606

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- UMAX 3400 LM9832 600x1200dpi 42bit 512Kb 0x0050 UMAX 3400/3450 LM9832 600x1200dpi 42bit 512Kb 0x0060 UMAX 5400 LM9832 1200x2400dpi 42bit 512Kb 0x0160\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- UMAX 3400 LM9832 600x1200 DPI 42 bit 512 kB 0x0050 UMAX 3400/3450 LM9832 600x1200 DPI 42 bit 512 kB 0x0060 UMAX 5400 LM9832 1200x2400 DPI 42 bit 512 kB 0x0160\fR

source: Vendor COMPAQ - ID: 0x049F
de: Lieferant COMPAQ - Kennung: 0x049F

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- S4-100 LM9832 600x1200dpi 42bit 512Kb 0x001A\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- S4-100 LM9832 600x1200 DPI 42 bit 512 kB 0x001A\fR

source: Vendor Epson - ID: 0x04B8
de: Lieferant Epson - Kennung: 0x04B8

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- Perfection 1250 LM9832 1200x2400dpi 42bit 512Kb 0x010F Perfection 1260 LM9832 1200x2400dpi 42bit 512Kb 0x011D\fR
de: \f(CR---------------------------------------------------------- USB Model: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- Perfection 1250 LM9832 1200x2400 DPI 42 bit 512 kB 0x010F Perfection 1260 LM9832 1200x2400 DPI 42 bit 512 kB 0x011D\fR

source: Vendor CANON - ID: 0x04A9
de: Lieferant CANON - Kennung: 0x04A9

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- CanoScan N650/656U LM9832 600x1200dpi 42bit 512Kb 0x2206 CanoScan N1220U LM9832 1200x2400dpi 42bit 512Kb 0x2207 CanoScan D660U LM9832 600x1200dpi 42bit 512Kb 0x2208 CanoScan N670/676U LM9833 600x1200dpi 48bit 512Kb 0x220D CanoScan N1240U LM9833 1200x2400dpi 48bit 512Kb 0x220E CanoScan LIDE20 LM9833 600x1200dpi 48bit 512Kb 0x220D CanoScan LIDE25 LM9833 1200x2400dpi 48bit 512Kb 0x2220 CanoScan LIDE30 LM9833 1200x2400dpi 48bit 512Kb 0x220E\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- CanoScan N650/656U LM9832 600x1200 DPI 42 bit 512 kB 0x2206 CanoScan N1220U LM9832 1200x2400 DPI 42 bit 512 kB 0x2207 CanoScan D660U LM9832 600x1200 DPI 42 bit 512 kB 0x2208 CanoScan N670/676U LM9833 600x1200 DPI 48 bit 512 kB 0x220D CanoScan N1240U LM9833 1200x2400 DPI 48 bit 512 kB 0x220E CanoScan LIDE20 LM9833 600x1200 DPI 48 bit 512 kB 0x220D CanoScan LIDE25 LM9833 1200x2400 DPI 48 bit 512 kB 0x2220 CanoScan LIDE30 LM9833 1200x2400 DPI 48 bit 512 kB 0x220E\fR

source: Vendor Syscan - ID: 0x0A82
de: Lieferant Syscan - Kennung: 0x0A82

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- Travelscan 662 LM9833 600x1200dpi 48bit 512Kb 0x6620 Travelscan 464 LM9833 600x1200dpi 48bit 512Kb 0x4600\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- Travelscan 662 LM9833 600x1200 DPI 48 bit 512 kB 0x6620 Travelscan 464 LM9833 600x1200 DPI 48 bit 512 kB 0x4600\fR

source: Vendor Portable Peripheral Co., Ltd. - ID: 0x0A53
de: Lieferant Portable Peripheral Co., Ltd. - Kennung: 0x0A53

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- Q-Scan USB001 LM9832 300x600dpi 42bit 512Kb 0x1000 Q-Scan USB201 LM9832 300x600dpi 42bit 512Kb 0x2000\fR
de: \f(CR---------------------------------------------------------- USB Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- Q-Scan USB001 LM9832 300x600 DPI 42 bit 512 kB 0x1000 Q-Scan USB201 LM9832 300x600 DPI 42 bit 512 kB 0x2000\fR

source: Vendor Visioneer - ID: 0x04A7
de: Lieferant Visioneer - Kennung: 0x04A7

source: \f(CR---------------------------------------------------------- USB Model: ASIC: Properties: Prod-ID ---------------------------------------------------------- Strobe XP100 LM9833 600x1200dpi 48bit 512Kb 0x0427\fR
de: \f(CR---------------------------------------------------------- USB-Modell: ASIC: Eigenschaften: Produktkennung ---------------------------------------------------------- Strobe XP100 LM9833 600x1200 DPI 48 bit 512 kB 0x0427\fR

source: OTHER PLUSTEK SCANNERS
de: WEITERE PLUSTEK-SCANNER

source: For parallelport device support see the B<sane-plustek_pp>(5) backend.
de: Siehe das Backend B<sane-plustek_pp>(5) für die Unterstützung von Parallelport-Geräten.

source: The SCSI scanner OpticPro 19200S is a rebadged Artec AM12S scanner and is supported by the B<sane-artec>(5) backend.
de: Der SCSI-Scanner OpticPro 19200S ist ein umetikettierter Artec AM12S-Scanner und wird vom Backend B<sane-artec>(5) unterstützt.

source: Only the National Semiconductor LM983[1/2/] based devices of Plustek are supported by this backend. Older versions of the U12, the UT12, the U1212 and U1248 (GrandTech chipset) are not supported.
de: Durch dieses Backend werden nur die National Semiconductor LM983[1/2/]-basierten Geräte von Plustek unterstützt. Ältere Versionen des U12, des UT12, des U1212 und des U1248 (GrandTech-Chipsatz) werden nicht unterstützt.

source: \f(CRModel Chipset backend ------------------------------------ U1248 GrandTech gt68xx UT16B GrandTech gt68xx OpticSlim 1200 GrandTech gt68xx OpticSlim 2400 GrandTech gt68xx U12 P98003 u12 UT12 P98003 u12 1212U P98003 u12\fR
de: \f(CRModell Chipsatz Backend ------------------------------------ U1248 GrandTech gt68xx UT16B GrandTech gt68xx OpticSlim 1200 GrandTech gt68xx OpticSlim 2400 GrandTech gt68xx U12 P98003 u12 UT12 P98003 u12 1212U P98003 u12\fR

source: For a more complete and up to date list see: I<http://www.sane-project.org/sane-supported-devices.html>.
de: Für eine vollständigere und aktuellere Liste siehe I<http://www.sane-project.org/sane-supported-devices.html>.

source: CONFIGURATION
de: KONFIGURATION

source: To use your scanner with this backend, you need at least two entries in the configuration file I</etc/sane.d/plustek.conf>
de: Um Ihren Scanner mit diesem Backend zu verwenden, benötigen Sie mindestens zwei Einträge in der Konfigurationsdatei I</etc/sane.d/plustek.conf>.

source: I<[usb] vendor-id product-id>
de: I<[usb] Lieferantenkennung Produktkennung>

source: I<[usb]> tells the backend, that the following devicename (here I</dev/usbscanner>) has to be interpreted as USB scanner device. If vendor- and product-id has not been specified, the backend tries to detect this by its own. If device is set to I<auto> then the next matching device is used.
de: I<[usb]> teilt dem Scanner mit, dass der nachfolgende Gerätename (hier I</dev/usbscanner> als USB-Scanner-Gerät zu interpretieren ist. Falls die Lieferanten- und Produktkennung nicht festgelegt wurden, versucht das Backend, diese selbst zu erkennen. Falls das Gerät auf I<auto> gesetzt wurde, dann wird das nächste passende Gerät verwendet.

source: The following options can be used for a default setup of your device. Most of them are also available through the frontend.
de: Die folgenden Optionen können für eine Standardinstallation Ihres Gerätes verwendet werden. Die meisten davon sind auch über die Oberfläche verfügbar.

source: B<The Options:>
de: B<Die Optionen:>

source: I<t> specifies the warmup period in seconds, if set to -1, the automatic warmup function will be used
de: I<t> legt die Aufwärmzeit in Sekunden fest. Falls auf »-1« gesetzt, wird die automatische Aufwärmfunktion verwendet.

source: I<t> is the time in seconds for switching off the lamps in standby mode
de: I<t> ist die Zeit in Sekunden zum Ausschalten der Lampen im Bereitschaftsmodus

source: I<b> specifies the behaviour when closing the backend, 1 --E<gt> switch lamps off, 0 --E<gt> do not change lamp status
de: I<b> gibt das Verhalten an, wenn das Backend geschlossen wird, 1 → Lampen ausschalten, 0 → Lampenstatus nicht ändern

source: I<m> is the model override switch. It works only with Mustek BearPaw devices.
de: I<m> ist der Modellaußerkraftsetzungsschalter. Er funktioniert nur mit Mustek-BearPaw-Geräten.

source: \f(CRm/PID | 0x1000 | 0x1001 ------+--------------+-------------- 0 | BearPaw 1200 | BearPaw 2400 1 | no function | BearPaw 1200\fR
de: \f(CRm/PID | 0x1000 | 0x1001 ------+--------------+-------------- 0 | BearPaw 1200 | BearPaw 2400 1 | keine Funktion | BearPaw 1200\fR

source: I<b> 0 --E<gt> do not invert the picture during negative scans,
de: I<b> 0 --E<gt> invertiert das Bild während des Scans von Negativen nicht,

source: 1 --E<gt> invert picture
de: 1 --E<gt> invertiert das Bild

source: I<b> 0 --E<gt> do not save calibration results,
de: I<b> 0 --E<gt> Kalibrierergebnisse nicht speichern,

source: 1 --E<gt> save results of calibration in I<~/.sane/> directory
de: 1 --E<gt> Ergebnisse der Kalibrierung im Verzeichnis I<~/.sane/> speichern

source: I<b> 0 --E<gt> use standard calibration routines,
de: I<b> 0 --E<gt> Standard-Kalibrierungsroutinen verwenden,

source: 1 --E<gt> use alternate calibration (only non Plustek devices, standard for CIS devices)
de: 1 --E<gt> alternative Kalibrierung verwenden (nur auf Plustek-Geräten, Standard für CIS-Geräte)

source: I<b> 0 --E<gt> perform fine calibration,
de: I<b> 0 --E<gt> genaue Kalibrierung durchführen,

source: 1 --E<gt> skip fine calibration (only non Plustek devices)
de: 1 --E<gt> genaue Kalibrierung überspringen (nur auf Plustek-Geräten)

source: I<b> 0 --E<gt> perform white fine calibration,
de: I<b> 0 --E<gt> genauen Weißabgleich durchführen,

source: 1 --E<gt> skip white fine calibration (only non Plustek devices)
de: 1 --E<gt> genaue Weißkalibrierung überspringen (nur auf Plustek-Geräten)

source: I<b> 0 --E<gt> perform dark calibration, with enabled lamp using the dark calibration strip of the scanner. If the scanner does not have such a strip, the alternative way is to switch off the lamp during this step.
de: I<b> 0 --E<gt> dunkle Kalibrierung durchführen, mit aktivierter Lampe unter Verwendung des dunklen Kalibrierungsstreifens des Scanners. Falls der Scanner keinen solchen Streifen hat, wird alternativ während dieses Schritts die Lampe ausgeschaltet.

source: 1 --E<gt> always switch off the lamp for dark calibration, even a black strip is available
de: 1 --E<gt> die Lampe immer für dunkle Kalibrierung ausschalten, selbst wenn ein schwarzer Streifen verfügbar ist

source: I<b> 0 --E<gt> perform calibration,
de: I<b> 0 --E<gt> Kalibrierung durchführen,

source: 1 --E<gt> skip calibration (only non Plustek devices)
de: 1 --E<gt> Kalibrierung überspringen (nur auf Plustek-Geräten)

source: I<b> 0 --E<gt> default behaviour, specified by the internal tables,
de: I<b> 0 --E<gt> Vorgabeverhalten, festgelegt durch interne Tabellen,

source: 1 --E<gt> override internal tables and allow TPA mode (EPSON/UMAX only)
de: 1 --E<gt> interne Tabellen außer Kraft setzen und TPA-Modus erlauben (nur EPSON/UMAX)

source: I<x y> By using this settings, the user can adjust the given image positions. B<Please note, that there's no internal range checking for> B<this feature.>
de: I<x y> Durch Verwendung dieser Einstellung kann der Benutzer die angegebenen Bildpositionen anpassen. B<Beachten Sie, dass es für diese Funktionalität keine interne Bereichsüberprüfung gibt.>

source: I<p> overrides the internal shading position. The values are in steps. B<Please note, that there's no internal range checking for> B<this feature.>
de: I<p> setzt die interne Schattierungsposition außer Kraft. Die Werte sind in Schritten anzugeben. B<Beachten Sie, dass es für diese Funktionalität keine interne Bereichsüberprüfung gibt.>

source: By using these values, the internal linear gamma table (r,g,b,gr = 1.0) can be adjusted.
de: Durch Verwendung dieser Werte kann die interne lineare Gammatabelle (r,g,b,gr = 1.0) angepasst werden.

source: I<r g b ro go bo> These values can be used to set the gain and offset values of the AFE for each channel. The range is between 0 and 63. -1 means autocalibration.
de: I<r g b ro go bo> Diese Werte können zum Setzen der Verstärkungs- und Versatzwerte des AFE für jeden Kanal verwendet werden. Der Bereich ist zwischen 0 und 63. -1 bedeutet automatische Kalibrierung.

source: See the plustek.conf file for examples.
de: Siehe die Datei I<plustek.conf> für Beispiele.

source: B<Note:>
de: B<Hinweis>:

source: You have to make sure, that the USB subsystem is loaded correctly and you have access to the device-node. For more details see B<sane-usb>(5) manpage. You might use B<sane-find-scanner>(1) to check that you have access to your device.
de: Sie müssen sicherstellen, dass das USB-Subsystem korrekt geladen ist und Sie Zugriff auf den Geräteknoten haben. Für weitere Details siehe die Handbuchseite B<sane-usb>(5). Sie können B<sane-find-scanner>(1) verwenden, um zu prüfen, ob Sie Zugriff auf Ihr Gerät haben.

source: If there's no configuration file, the backend defaults to B<device auto>
de: Falls es keine Konfigurationsdatei gibt, ist die Vorgabe des Backends B<device auto>.

source: FILES
de: DATEIEN

source: The backend configuration file
de: Die Backend-Konfigurationsdatei.

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Größere Werte erhöhen die Ausführlichkeit der Ausgabe.

source: Example: export SANE_DEBUG_PLUSTEK=10
de: Beispiel: export SANE_DEBUG_PLUSTEK=10

source: SEE ALSO
de: SIEHE AUCH

source: CONTACT AND BUG-REPORTS
de: KONTAKT UND FEHLERBERICHTE

source: Please send any information and bug-reports to:
de: Bitte senden Sie Fehlerberichte und andere Informationen (auf Englisch) an:

source: B<SANE Mailing List>
de: B<SANE-Mailingliste>

source: Additional info and hints can be obtained from our
de: Zusätzliche Informationen und Hinweise gibt es in unserem

source: Mailing-List archive at:
de: Mailinglisten-Archiv unter:

source: To obtain debug messages from the backend, please set the environment-variable B<SANE_DEBUG_PLUSTEK> before calling your favorite scan-frontend (i.e. B<scanimage>(1)),B<i.e.:>
de: Um Fehlersuchnachrichten vom Backend zu erhalten, setzen Sie bitte die Umgebungsvariable B<SANE_DEBUG_PLUSTEK>, bevor Sie Ihre Lieblingsoberfläche starten (d.h. B<scanimage>(1)), B<d.h.>:

source: The value controls the verbosity of the backend. Please note, that values greater than 24 force the backend to output raw data files, which could be rather large. The ending of these files is ".raw". For problem reports it should be enough the set the verbosity to 13.
de: Der Wert steuert die Ausführlichkeit des Backends. Bitte beachten Sie, dass Werte größer als 24 das Backend zwingen, Dateien mit Rohdaten auszugeben, die sehr groß werden könnten. Die Kodierung dieser Dateien ist ».raw«. Für Problemberichte sollte es ausreichen, die Ausführlichkeit auf 13 zu setzen.

source: KNOWN BUGS & RESTRICTIONS
de: BEKANNTE FEHLER UND EINSCHRÄNKUNGEN
