Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-epjitsu.5.po
Languages: de

source: 11 Apr 2017
de: 11. April 2017

source: NAME
de: BEZEICHNUNG

source: sane-epjitsu - SANE backend for Epson-based Fujitsu USB scanners.
de: sane-epjitsu - SANE-Backend für Epson-basierte USB-Scanner von Fujitsu

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-epjitsu> library implements a SANE (Scanner Access Now Easy) backend which provides basic access the Fujitsu fi-60F/fi-65F and ScanSnap S300/S1300(i)/S1100(i) scanners.
de: Die Bibliothek B<sane-epjitsu> implementiert ein SANE-Backend (Scanner Access Now Easy), das den grundlegenden Zugriff auf Fujitsu-fi-60F/fi-65F- und ScanSnap-S300/S1300(i)/S1100(i)-Scanner ermöglicht.

source: HARDWARE SUPPORT
de: HARDWARE-UNTERSTÜTZUNG

source: These scanners are fairly limited, only supporting a couple of modes and resolutions, and always scanning full width. The backend supports missing modes (binary, grayscale) and intermediate resolutions in software, but provides only minimal scan area controls. See B<KNOWN ISSUES.>
de: Diese Scanner sind recht eingeschränkt, unterstützen nur ein paar Modi und Auflösungen und scannen immer in voller Breite. Das Backend unterstützt fehlende Modi (binär, Graustufen) und Zwischenauflösungen in Software, aber stellt nur minimale Steuerungen für den Scan-Bereich bereit. Siehe B<BEKANNTE PROBLEME>.

source: This backend may support other scanners. If physical inspection reveals an Epson chipset, please contact the author for instructions on collecting a USB trace under Windows to verify.
de: Dieses Backend könnte andere Scanner unterstützen. Falls Sie bei der Untersuchung Ihres Scanners einen Epson-Chipsatz entdecken, kontaktieren Sie bitte den Autor (auf Englisch) für Anweisungen, wie Sie unter Windows ein USB-Trace erstellen können, um dies zu bestätigen.

source: OPTIONS
de: OPTIONEN

source: A limited effort has been made to expose the standard options to the API. This allows a frontend to set resolution, color mode, and choose the ADF setting. The B<sane-epjitsu> backend supports the following basic options for most scanners:
de: Es wurde nur ein begrenzter Aufwand betrieben, die Standardoptionen dem API offenzulegen. Dies ermöglicht es einer Oberfläche, die Auflösung und den Farbmodus zu setzen sowie die ADF-Einstellung auszuwählen. Das Backend B<sane-epjitsu> unterstützt die folgenden grundlegenden Optionen für die meisten Scanner:

source: Selects the source for the scan. Options may include "Flatbed", "ADF Front", "ADF Back", "ADF Duplex".
de: wählt die Quelle für den Scan. Optionen können »Flatbed«, »ADF Front«, »ADF Back« oder »ADF Duplex« sein.

source: Selects the mode for the scan. Options may include "Lineart", "Gray", "Color".
de: wählt den Farbmodus für den Scan. Optionen können »Lineart«, »Gray«, »Color« sein.

source: Controls scan resolution. Setting B<--resolution> also sets B<--y-resolution, though this behavior is overridden by some frontends.>
de: regelt die Scan-Auflösung. Die Einstellung B<--resolution> setzt auch die B<--y-resolution, allerdings wird diese Einstellung von einigen Oberflächen außer Kraft gesetzt>.

source: Other options will be available based on the capabilities of the scanner. Use I<'scanimage --help'> to get a list. Be aware that some options may appear only when another option has been set, and that advanced options may be hidden by the frontend.
de: Basierend auf den Fähigkeiten des Scanners werden weitere Optionen verfügbar sein. Verwenden Sie »B<scanimage --help>«, um eine Liste zu erhalten. Berücksichtigen Sie, dass einige Optionen erst auftauchen könnten, wenn andere gesetzt wurden, und dass fortgeschrittene Optionen durch die Oberfläche versteckt sein könnten.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/epjitsu.conf> is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts. If the configuration file is missing, the backend will not work.
de: Aus der Konfigurationsdatei I</etc/sane.d/epjitsu.conf> ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird. Falls die Konfigurationsdatei fehlt, wird das Backend nicht funktionieren.

source: Scanners can be specified in the configuration file in two ways:
de: Scanner können auf zwei Arten in der Konfigurationsdatei festgelegt werden:

source: "usb 0x04c5 0x10c7" (or other vendor/product ids)
de: "usb 0x04c5 0x10c7" (oder andere Lieferanten-/Produktkennungen)

source: Requests backend to search all usb buses in the system for a device which uses that vendor and product id. The device will then be queried to determine if it is a supported scanner.
de: Bittet das Backend, alle USB-Busse im System nach einem Gerät abzusuchen, das diese Lieferanten- und Produktkennung verwendet. Das Gerät wird dann abgefragt, um zu bestimmen, ob es ein unterstützter Scanner ist.

source: "usb /dev/usb/scanner0" (or other device file)
de: "usb /dev/usb/scanner0" (oder eine andere Gerätedatei)

source: Some systems use a kernel driver to access usb scanners. This method is untested.
de: Einige Systeme benötigen einen Kerneltreiber zum Zugriff auf USB-Scanner. Diese Methode ist nicht getestet.

source: The only configuration option supported is "firmware /PATH/TO/FILE", allowing you to set the location of the firmware file you have extracted from the Windows driver.
de: Die einzige erlaubte Konfigurationsoption ist »firmware /PFAD/ZUR/DATEI«. Sie erlaubt es Ihnen, den Ort der Firmware-Datei zu setzen, die Sie aus dem Windows-Treiber extrahiert haben.

source: B<Note:> This firmware is a copyrighted work of Fujitsu, so cannot be provided by the backend or the author. Please do not ask.
de: B<Hinweis>: Diese Firmware unterliegt dem Urheberrecht von Fujitsu und kann daher vom Backend oder dem Autor nicht bereitgestellt werden. Bitte fragen Sie daher nicht danach.

source: B<Note:> These scanners REQUIRE a firmware file to function. See the supplied configuration file for more detail.
de: B<Hinweis>: Diese Scanner BENÖTIGEN eine Firmware-Datei, um zu funktionieren. Siehe die bereitgestellte Konfigurationsdatei für weitere Details.

source: B<Note:> This option may appear multiple times in the configuration file. It only applies to scanners discovered by 'usb' lines that follow this option.
de: B<Hinweis>: Diese Option kann mehrfach in der Konfigurationsdatei auftauchen. Sie gilt nur für Scanner, die mit »usb«-Zeilen erkannt wurden, die nach dieser Option folgen.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The backend uses a single environment variable, B<SANE_DEBUG_EPJITSU,> which enables debugging output to stderr. Valid values are:
de: Dieses Backend verwendet eine einzelne Umgebungsvariable: B<SANE_DEBUG_EPJITSU>. Diese aktiviert die Debugging-Ausgabe in die Standardfehlerausgabe. Gültige Werte sind:

source: 5 Errors
de: 5 Fehler

source: 10 Function trace
de: 10 Funktionsdatenspuren

source: 15 Function detail
de: 15 Funktionsdetails

source: 20 Option commands
de: 20 Optionsbefehle

source: 25 USB trace
de: 25 USB-Datenspuren

source: 30 USB detail
de: 30 USB-Details

source: 35 Useless noise
de: 35 Nutzloses Rauschen

source: KNOWN ISSUES
de: BEKANNTE PROBLEME

source: Only limited scan area options are exposed.
de: Nur begrenzte Scan-Bereich-Optionen werden offengelegt.

source: fi-60F and fi-65F hardware grayscale mode is not used, because the calibration code is not finished.
de: Beim fi-60F und fi-65F wird der Hardware-Graustufenmodus nicht verwendet, da der Kalibrierungscode noch nicht fertig ist.

source: CREDITS
de: DANKSAGUNGEN

source: S300 support funded by Microdea, Inc. and Archivista, GmbH.
de: S300-Unterstützung wurde durch Microdea Inc. und Archivista GmbH finanziert.

source: fi-60F support funded by TrueCheck, Inc.
de: fi-60F-Unterstützung wurde durch TrueCheck, Inc. finanziert.

source: Improved calibration code provided by Richard Goedeken.
de: Richard Goedeken stellte einen verbesserten Kalibrierungscode bereit.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: A limited effort has been made to expose the standard options to the API. This allows a frontend to set resolution, color mode, and choose the ADF setting. The epjitsu backend supports the following basic options for most scanners:
de: Es wurde nur ein begrenzter Aufwand betrieben, die Standardoptionen dem API offenzulegen. Dies ermöglicht es einer Oberfläche, die Auflösung und den Farbmodus zu setzen sowie die ADF-Einstellung auszuwählen. Das Backend Epjitsu unterstützt die folgenden grundlegenden Optionen für die meisten Scanner:

source: Controls scan resolution. Setting --resolution also sets --y-resolution, though this behavior is overridden by some frontends.
de: regelt die Scan-Auflösung. Die Einstellung B<--resolution> setzt auch die B<--y-resolution>, allerdings wird diese Einstellung von einigen Oberflächen außer Kraft gesetzt.

source: Other options will be available based on the capabilities of the scanner. Use 'scanimage --help' to get a list. Be aware that some options may appear only when another option has been set, and that advanced options may be hidden by the frontend.
de: Basierend auf den Fähigkeiten des Scanners werden weitere Optionen verfügbar sein. Verwenden Sie »I<scanimage --help>«, um eine Liste zu erhalten. Berücksichtigen Sie, dass einige Optionen erst auftauchen könnten, wenn andere gesetzt wurden, und dass fortgeschrittene Optionen durch die Oberfläche versteckt sein könnten.

source: The configuration file "/etc/sane.d/epjitsu.conf" is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts. If the configuration file is missing, the backend will not work.
de: Aus der Konfigurationsdatei I</etc/sane.d/epjitsu.conf> ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird. Falls die Konfigurationsdatei fehlt, wird das Backend nicht funktionieren.

source: The backend uses a single environment variable, SANE_DEBUG_EPJITSU, which enables debugging output to stderr. Valid values are:
de: Dieses Backend verwendet eine einzelne Umgebungsvariable: B<SANE_DEBUG_EPJITSU>. Diese aktiviert die Debugging-Ausgabe in die Standardfehlerausgabe. Gültige Werte sind:

source: sane(7), sane-usb(5)
de: B<sane>(7), B<sane-usb>(5)
