Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-artec_eplus48u.5.po
Languages: de

source: 11 Jul 2008
de: 11. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-artec_eplus48u - SANE backend for the scanner Artec E+ 48U and re-badged models
de: sane-artec_eplus48u - SANE-Backend für den Scanner Artec E+ 48U und unter anderem Namen angebotene Modelle

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-artec_eplus48u> library implements a SANE (Scanner Access Now Easy) backend that provides access to several USB flatbed scanners using the GT6816 chipset like the Artec E+ 48U. These scanners have a contact image sensor (CIS).
de: Die Bibliothek B<sane-artec_eplus48u> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf verschiedene USB-Flachbettscanner, die den GT6816-Chipsatz verwenden, wie den Artec E+ 48U. Diese Scanner haben einen Kontakt-Bildsensor (CIS).

source: A complete list of supported devices can be found on I<http://www.sane-project.org/sane-supported-devices.html>.
de: Eine vollständige Liste der unterstützten Modelle finden Sie auf I<http://www.sane-project.org/sane-supported-devices.html>.

source: This is ALPHA software. Especially if you test new or untested scanners, keep your hand at the scanner's plug and unplug it, if the head bumps at the end of the scan area.
de: Dies ist ALPHA-Software. Insbesondere dann, wenn Sie neue oder bisher noch nicht getestete Scanner testen, behalten Sie den Netzstecker des Scanners in der Hand und ziehen Sie ihn, falls der Schlitten ans Ende des Scanbereichs stößt.

source: If you own a scanner other than the ones mentioned on the list that works with this backend, please let us know this by sending the scanner's exact model name and the USB vendor and product ids (e.g. from I</proc/bus/usb/devices>, B<sane-find-scanner>(1) or syslog) to me. Even if the scanner's name is only slightly different from the models mentioned above, please let me know.
de: Falls Sie einen anderen als die genannten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie mir die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Produktkennungen (zum Beispiel aus I</proc/bus/usb/devices>, mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben genannten Modellen unterscheidet, lassen Sie es mich bitte wissen.

source: KERNEL ISSUES
de: KERNEL-PROBLEME

source: If libusb-0.1.6 or later is installed, this section can be skipped. The scanner should be found by B<sane-find-scanner>(1) without further actions. For setting permissions and general USB information look at B<sane-usb>(5).
de: Falls Sie libusb-0.1.6 oder neuer installiert haben, können Sie diesen Abschnitt überspringen. Der Scanner sollte von B<sane-find-scanner>(1) ohne weitere Aktionen gefunden werden. Für das Setzen der Zugriffsrechte sowie allgemeine USB-Informationen schauen Sie in B<sane-usb>(5).

source: When you are using the scanner module, a Linux kernel 2.4.12 or newer is required.
de: Wenn Sie das Scanner-Modul verwenden, ist der Linux-Kernel in Version 2.4.12 oder neuer erforderlich.

source: FIRMWARE FILE
de: FIRMWARE-DATEI

source: You need a firmware file for your scanner. That's a small file containing software that will be uploaded to the scanner's memory. For the scanners mentioned above, it's usually named I<Artec48.usb> or I<1200.usb>. You can find it on the installation CD that was provided by the manufacturer, normally in the directory Win98, WinMe or similar. If the Windows-driver is installed on your computer, then you can also find the firmware file under I<c:\windows\system32\drivers>.
de: Sie benötigen eine Firmware-Datei für Ihren Scanner. Diese enthält Software, die in den Speicher des Scanners übertragen wird. Für die vorstehend genannten Scanner heißt diese Datei üblicherweise I<Artec48.usb> oder I<1200.usb>. Sie finden Sie auf der Installations-CD des Herstellers, normalerweise in einem Verzeichnis namens Win98, WinMe oder ähnlich. Falls auf Ihrem Rechner der Windows-Treiber installiert ist, finden Sie die Firmware-Datei auch unter I<c:\ewindows\esystem32\edrivers>.

source: CONFIGURATION
de: KONFIGURATION

source: The contents of the I<artec_eplus48u.conf> file is a list of usb lines containing vendor and product ids that correspond to USB scanners. The file can also contain option lines. Empty lines and lines starting with a hash mark (#) are ignored. The scanners are autodetected by I<usb vendor_id product_id> statements which are already included into I<artec_eplus48u.conf .> "vendor_id" and "product_id" are hexadecimal numbers that identify the scanner.
de: In der Datei I<artec_eplus48u.conf> finden Sie eine Liste von USB-Zeilen, welche Anbieter- und Produktkennungen enthalten, die zu USB-Scannern korrespondieren. Die Datei kann auch Optionszeilen enthalten. Leere Zeilen und solche, die mit einem Rautezeichen (#) beginnen, werden ignoriert. Die Scanner werden durch I<usb Anbieterkennung Produktkennung>-Anweisungen, die bereits in I<artec_eplus48u.conf> enthalten sind, automatisch erkannt. I<Anbieterkennung> und I<Produktkennung> sind Hexadezimalzahlen, die Ihren Scanner identifizieren.

source: Every usb section can have additional options.
de: In jedem I<usb>-Abschnitt können weitere Optionen angegeben werden.

source: The path to the firmware file. This option is required.
de: Der Pfad zur Firmware-Datei. Diese Option ist obligatorisch.

source: These are the default gamma values. If you set the "Defaults" option with a frontend, then the gamma options are reset to the values specified here.
de: Dies sind die vorgegebenen Gamma-Werte. Falls Sie die Option »Defaults« mit einem Frontend gesetzt haben, werden die Gamma-Optionen auf die hier angegebenen Vorgabewerte zurückgesetzt.

source: These are the default values for offset and exposure time. You can change them (e.g. to speed up calibration) if you don't want to save the calibration data permanently.
de: Dies sind die Vorgabewerte für Versatz und Belichtungszeit. Sie können Sie ändern, um beispielsweise die Kalibrierung zu beschleunigen, wenn Sie die Kalibrierungsdaten nicht dauerhaft speichern wollen.

source: By default, the scanner is reported as "Artec E+ 48U". If you don't like this, e.g. because you have an Tevion MD 9693, then change the options accordingly.
de: Standardmäßig wird der Scanner als »Artec E+ 48U« gemeldet. Falls Sie das nicht wollen, weil Sie beispielsweise einen Tevion MD 9693 haben, dann ändern Sie die Optionen entsprechend.

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Größere Werte erhöhen die Ausführlichkeit der Ausgabe.

source: Example: export SANE_DEBUG_ARTEC_EPLUS48U=3
de: Beispiel: export SANE_DEBUG_ARTEC_EPLUS48U=3

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: This backend is based on the gt68xx test-program written by Sergey Vlasov, Andreas Nowack, and David Stevenson. Thanks to everyone who tested the backend or reported bugs.
de: Dieses Backend basiert auf dem Testprogramm gt68xx, das von Sergey Vlasov, Andreas Nowack und David Stevenson geschrieben wurde. Vielen Dank an alle, die das Backend getestet oder Fehler gemeldet haben.

source: This man page is based on man B<sane-gt68xx>(5), written by Henning Meier-Geinitz.
de: Diese Handbuchseite basiert auf B<sane-gt68xx>(5), geschrieben von Henning Meier-Geinitz.

source: BUGS
de: FEHLER

source: This backend has been tested on Linux only. If you are using it on a different platform, please contact us.
de: Dieses Backend wurde nur unter Linux getestet. Falls Sie es auf einer anderen Plattform verwenden, kontaktieren Sie uns bitte.

source: Interpolation with 1200 dpi is weak.
de: Die Interpolation mit 1200 dpi ist schwach.

source: Support for buttons is missing due to missing support in SANE.
de: Die Knöpfe sind nicht verwendbar, da diese in SANE nicht unterstützt werden.

source: Please contact us if you find a bug: I<http://www.sane-project.org/bugs.html>.
de: Bitte kontaktieren Sie uns (auf Englisch), falls Sie einen Fehler finden: I<http://www.sane-project.org/bugs.html>.

source: The B<sane-artec_eplus48u> library implements a SANE (Scanner Access Now Easy) backend that provides access to several USB flatbed scanners using the GT6816 chipset like the Artec E+ 48U. These scanners have a contact image sensor (CIS) and an USB interface.
de: Die Bibliothek B<sane-artec_eplus48u> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf verschiedene USB-Flachbettscanner, die den GT6816-Chipsatz verwenden, wie den Artec E+ 48U. Diese Scanner haben einen Kontakt-Bildsensor (CIS) und eine USB-Schnittstelle.

source: If you own a scanner other than the ones mentioned on the list that works with this backend, please let us know this by sending the scanner's exact model name and the USB vendor and product ids (e.g. from /proc/bus/usb/devices, sane-find-scanner or syslog) to me. Even if the scanner's name is only slightly different from the models mentioned above, please let me know.
de: Falls Sie einen anderen als die genannten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie mir die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Produktkennungen (zum Beispiel aus I</proc/bus/usb/devices>, mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben genannten Modellen unterscheidet, lassen Sie es mich bitte wissen.

source: If libusb-0.1.6 or later is installed, this section can be skipped. The scanner should be found by sane-find-scanner without further actions. For setting permissions and general USB information look at sane-usb(5).
de: Falls Sie libusb-0.1.6 oder neuer installiert haben, können Sie diesen Abschnitt überspringen. Der Scanner sollte von B<sane-find-scanner>(1) ohne weitere Aktionen gefunden werden. Für das Setzen der Zugriffsrechte sowie allgemeine USB-Informationen schauen Sie in B<sane-usb>(5).

source: You need a firmware file for your scanner. That's a small file containing software that will be uploaded to the scanner's memory. For the scanners mentioned above, it's usually named Artec48.usb or 1200.usb. You can find it on the installation CD that was provided by the manufacturer, normally in the directory Win98, WinMe or similar. If the Windows-driver is installed on your computer, then you can also find the firmware file under c:\ewindows\esystem32\edrivers.
de: Sie benötigen eine Firmware-Datei für Ihren Scanner. Diese enthält Software, die in den Speicher des Scanners übertragen wird. Für die vorstehend genannten Scanner heißt diese Datei üblicherweise Artec48.usb oder 1200.usb. Sie finden Sie auf der Installations-CD des Herstellers, normalerweise in einem Verzeichnis namens Win98, WinMe oder ähnlich. Falls auf Ihrem Rechner der Windows-Treiber installiert ist, finden Sie die Firmware-Datei auch unter I<c:\ewindows\esystem32\edrivers>.

source: The contents of the I<artec_eplus48u.conf> file is a list of usb lines containing vendor and product ids that correspond to USB scanners. The file can also contain option lines. Empty lines and lines starting with a hash mark (#) are ignored. The scanners are autodetected by I<usb vendor_id product_id> statements which are already included into I<artec_eplus48u.conf .> "vendor_id" and "product_id" are hexadecimal numbers that identify the B<scanner.>
de: In der Datei I<artec_eplus48u.conf> finden Sie eine Liste von USB-Zeilen, welche Anbieter- und Produktkennungen enthalten, die zu USB-Scannern korrespondieren. Die Datei kann auch Optionszeilen enthalten. Leere Zeilen und solche, die mit einem Rautezeichen (#) beginnen, werden ignoriert. Die Scanner werden durch I<usb Anbieterkennung Produktkennung>-Anweisungen, die bereits in I<artec_eplus48u.conf> enthalten sind, automatisch erkannt. I<Anbieterkennung> und I<Produktkennung> sind Hexadezimalzahlen, die Ihren Scanner identifizieren.

source: Every usb section can have additional options
de: In jedem I<usb>-Abschnitt können weitere Optionen angegeben werden.

source: These are the default values for offset and exposure time. You can e.g. change them to speed up calibration, if you don't want to save the calibration data to disk.
de: Dies sind die Vorgabewerte für Versatz und Belichtungszeit. Sie können Sie ändern, um beispielsweise die Kalibrierung zu beschleunigen, wenn Sie die Kalibrierungsdaten nicht dauerhaft speichern wollen.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /usr/local/etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/usr/local/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, welche die Konfigurationsdatei enthalten könnten. Auf *NIX-Systemen werden die Verzeichnisse mit einem Doppelpunkt (»:«) und unter OS/2 mit einem Semikolon (»;«) voneinander getrennt. Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: Zuerst im aktuellen Arbeitsverzeichnis (».«) und dann in I</usr/local/etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden nach den explizit angegebenen Verzeichnissen die Standardverzeichnisse durchsucht. Wenn Sie B<SANE_CONFIG_DIR> beispielsweise auf »/tmp/config:« setzen, werden die Verzeichnisse I<tmp/config>, I<.> und I</usr/local/etc/sane.d> durchsucht (in dieser Reihenfolge).

source: sane(7), sane-usb(5)
de: B<sane>(7), B<sane-usb>(5)

source: This man page is based on man sane-gt68xx, written by Henning Meier-Geinitz.
de: Diese Handbuchseite basiert auf B<sane-gt68xx>(5), geschrieben von Henning Meier-Geinitz.

source: You need a firmware file for your scanner. That's a small file containing software that will be uploaded to the scanner's memory. For the scanners mentioned above, it's usually named I<Artec48.usb> or I<1200.usb>. You can find it on the installation CD that was provided by the manufacturer, normally in the directory Win98, WinMe or similar. If the Windows-driver is installed on your computer, then you can also find the firmware file under c:\ewindows\esystem32\edrivers.
de: Sie benötigen eine Firmware-Datei für Ihren Scanner. Diese enthält Software, die in den Speicher des Scanners übertragen wird. Für die vorstehend genannten Scanner heißt diese Datei üblicherweise I<Artec48.usb> oder I<1200.usb>. Sie finden Sie auf der Installations-CD des Herstellers, normalerweise in einem Verzeichnis namens Win98, WinMe oder ähnlich. Falls auf Ihrem Rechner der Windows-Treiber installiert ist, finden Sie die Firmware-Datei auch unter I<c:\ewindows\esystem32\edrivers>.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen I<tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).
