Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-magicolor.5.po
Languages: de

source: 10 Jan 2011
de: 10. Januar 2011

source: NAME
de: BEZEICHNUNG

source: sane-magicolor - SANE backend for KONICA MINOLTA magicolor scanners
de: sane-magicolor - SANE-Backend für die Magicolor-Scanner von KONICA MINOLTA

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-magicolor> backend supports KONICA MINOLTA magicolor scanners connected via USB or LAN. Currently, only the magicolor 1690MF device is supported, no other devices with the same scanning protocol are known.
de: Das Backend B<sane-magicolor> unterstützt mittels USB oder LAN angebundene KONICA MINOLTA Magicolor Scanner. Derzeit wird nur das Gerät Magicolor 1690MF unterstützt, es ist kein anderes Gerät mit dem gleichen Scan-Protokoll bekannt.

source: SUPPORTED DEVICES
de: UNTERSTÜTZTE GERÄTE

source: The following scanner should work with this backend:
de: Die folgenden Scanner sollten mit diesem Backend funktionieren:

source: Device Details
de: Geräte-Details

source: Vendor: KONICA MINOLTA
de: Lieferant: KONICA MINOLTA

source: Model: magicolor 1690MF
de: Modell: magicolor 1690MF

source: CONFIGURATION
de: KONFIGURATION

source: This section describes the backend's configuration file entries. The file is located at:
de: Dieser Abschnitt beschreibt die Konfigurationsdateieinträge des Backends. Die Datei befindet sich unter:

source: For a proper setup, at least one of the following entries are needed:
de: Für eine korrekte Installation wird mindestens einer der folgenden Einträge benötigt:

source: I<net [IP ADDRESS] [DEVICE-ID]>
de: I<net [IP-ADRESSE] [GERÄTEKENNUNG]>

source: I<usb [VENDOR-ID] [DEVICE-ID]>
de: I<usb [LIEFERANTENKENNUNG] [GERÄTEKENNUNG]>

source: FILES
de: DATEIEN

source: The backend configuration file
de: Die Backend-Konfigurationsdatei.

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I</tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen I</tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Größere Werte erhöhen die Ausführlichkeit der Ausgabe.

source: Example: export SANE_DEBUG_MAGICOLOR=127
de: Beispiel: export SANE_DEBUG_MAGICOLOR=127

source: To obtain debug messages from the backend, set this environment variable before calling your favorite frontend (e.g. B<xscanimage>(1)).
de: Um Fehlersuchmeldungen von dem Backend zu erhalten, setzen Sie diese Umgebungsvariable, bevor Sie Ihre Lieblingsoberfläche (z.B. B<xscanimage>(1)) aufrufen.

source: Example: SANE_DEBUG_MAGICOLOR=65 xscanimage
de: Beispiel: SANE_DEBUG_MAGICOLOR=65 xscanimage

source: KNOWN BUGS AND RESTRICTIONS
de: BEKANNTE FEHLER UND EINSCHRÄNKUNGEN

source: Large color scans may sometimes timeout due to unknown reasons (the scanner simply stops returning data).
de: Große Farb-Scans können manchmal aus unbekannten Gründen in einer Zeitüberschreitung landen (der Scanner hört einfach auf, Daten zurückzuliefern).

source: Cancelling large scans may lock up the scanner.
de: Der Abbruch von großen Scans kann Ihren Scanner blockieren.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "/tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen I</tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).

source: To obtain debug messages from the backend, set this environment variable before calling your favorite frontend (e.g. xscanimage).
de: Um Fehlersuchmeldungen von dem Backend zu erhalten, setzen Sie diese Umgebungsvariable, bevor Sie Ihre Lieblingsoberfläche (z.B. B<xscanimage>(1)) aufrufen.

source: Large color scans may sometimes timeout due to unknown reasons (the scanner simply stops returning data)
de: Große Farb-Scans können manchmal aus unbekannten Gründen in einer Zeitüberschreitung landen (der Scanner hört einfach auf, Daten zurückzuliefern).

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I</tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen I</tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).
