Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-hp5590.5.po
Languages: de

source: 13 Jul 2008
de: 13. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-hp5590 - SANE backend for Hewlett-Packard 4500C/4570C/5500C/5550C/5590/7650 Workgroup/Document scanners
de: sane-hp5590 - SANE-Backend für Hewlett-Packard 4500C/4570C/5500C/5550C/5590/7650 Arbeitsgruppen/Dokumentenscanner

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-hp5590> library implements a SANE (Scanner Access Now Easy) backend that provides access to the following Hewlett-Packard Workgroup/Document scanners:
de: Die Bibliothek B<sane-sane-hp5590> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die folgenden Hewlett-Packard Arbeitsgruppen-/Dokumentenscanner:

source: If you own a scanner other than the ones listed above that works with this backend, please let us know this by sending the scanner\[cq]s exact model name and the USB vendor and device ids (e.g.\ from I</sys/bus/usb/devices>, B<sane-find-scanner>(1) or syslog) to us. Even if the scanner\[cq]s name is only slightly different from the models mentioned above, please let us know.
de: Falls Sie einen anderen als die oben aufgeführten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie uns die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Gerätekennungen (zum Beispiel aus I</sys/bus/usb/devices>, mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben genannten Modellen unterscheidet, lassen Sie es uns bitte wissen.

source: OPTIONS
de: OPTIONEN

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xscanimage>(1) or B<xsane>(1). Valid command line options and their syntax can be listed by using:
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden. Gültige Optionen für die Befehlszeilenoptionen und ihre Syntax können durch Ausführung von

source: \f[C] scanimage --help -d hp5590:interface:device\fR
de: \f[C] scanimage --help -d hp5590:Schnittstelle:Gerät\fR

source: where \f[I]interface\f[R] and \f[I]device\f[R] specify the device in question, as in the configuration file. Add B<--all-options> to also list the hardware read-out options. The B<-d> parameter and its argument can be omitted to obtain information on the first scanner identified.
de: aufgelistet werden, wobei \f[I]Schnittstelle\f[R] und \f[I]Gerät\f[R] das gewünschte Gerät angeben, wie in der Konfigurationsdatei. Fügen Sie B<--all-options> hinzu, um auch die Hardware-bezogenen Optionen aufzulisten. Der Parameter B<-d> und dessen Argument können weggelassen werden, um Informationen zum ersten identifizierten Scanner zu erhalten.

source: Use the command:
de: Mit dem Befehl

source: to list all devices recognized by your SANE installation.
de: können Sie alle von Ihrer SANE-Installation erkannten Geräte auflisten.

source: DEVICE SPECIFIC OPTIONS
de: GERÄTESPEZIFISCHE OPTIONEN

source: Top-left X position of scan area in \f[B]mm\f[R]. Allowed range: 0 .. 215.889.\fR
de: Obere linke X-Position des Scan-Bereichs in \f[B]mm\f[R]. Erlaubter Bereich: 0 … 215.889.\fR

source: Top-left Y position of scan area in \f[B]mm\f[R]. Allowed range: 0 .. 297.699.\fR
de: Obere linke Y-Position des Scan-Bereichs in \f[B]mm\f[R]. Erlaubter Bereich: 0 … 297.699.\fR

source: X width of scan-area in \f[B]mm\f[R]. Allowed range: 0 .. 215.889.\fR
de: X-Breite des Scan-Bereichs \f[B]mm\f[R]. Erlaubter Bereich: 0 … 215.889.\fR

source: Y height of scan-area in \f[B]mm\f[R]. Allowed range: 0 .. 297.699.\fR
de: Y-Höhe des Scan-Bereichs in \f[B]mm\f[R]. Erlaubter Bereich: 0 … 297.699.\fR

source: By default, the maximum size will be scanned.
de: Standardmäßig wird die Maximalgröße gescannt.

source: B<--mode >\f[I]mode\fR
de: B<--mode >\f[I]Modus\fR

source: Select color mode. \f[I]mode\f[R] must be one of: \[lq]Color\[rq], \[lq]Color (48 bits)\[rq], \[lq]Gray\[rq], \[lq]Lineart\[rq].\fR
de: wählt den Farbmodus. \f[I]Modus\f[R] muss einer der folgenden sein: »Color«, »Color (48 bits)«, »Gray«, »Lineart«.\fR

source: \[lq]Color\[rq] - Scanning is done with 3 * 8 bit RGB color values per pixel.
de: »Color« - Scannen erfolgt mit 3*8 bit RGB-Farbwerten pro Pixel.

source: \[lq]Color (48 bits)\[rq] - Scanning is done with 3 * 16 bit RGB color values per pixel.
de: »Color (48 bits)« - Scannen erfolgt mit 3*16 bit RGB-Farbwert pro Pixel.

source: \[lq]Gray\[rq] - Scanning is done with 1 * 8 bit gray value per pixel.
de: »Gray« - Scannen erfolgt mit 1 * 8 bit Grauwert pro Pixel.

source: \[lq]Lineart\[rq] - Scanning is done with 1 bit black and white value per pixel.
de: »Lineart« - Scannen erfolgt mit 1 bit Schwarz- und Weißwert pro Pixel.

source: B<--source >\f[I]source\fR
de: B<--source >\f[I]Quelle\fR

source: Select the source for scanning. \f[I]source\f[R] must be one of: \[lq]Flatbed\[rq], \[lq]ADF\[rq], \[lq]ADF Duplex\[rq], \[lq]TMA Slides\[rq], \[lq]TMA Negatives\[rq].\fR
de: wählt die Quelle zum Scannen. \f[I]Quelle\f[R] muss eine der folgenden sein: »Flatbed«, »ADF«, »ADF Duplex«, »TMA Slides«, »TMA Negatives«.\fR

source: \[lq]Flatbed\[rq] - Scan document on the flat document glass.
de: »Flatbed« - Scannen von Dokumenten auf dem flachen Dokumentenglass.

source: \[lq]ADF\[rq] - Scan frontsides of documents with automatic document feeder.
de: »ADF« - Scannen der Oberseiten von Dokumenten mit dem automatischen Dokumenteneinzug.

source: \[lq]ADF Duplex\[rq] - Scan front- and backsides of documents with automatic document feeder. Note, the backside images must be rotated in a separate post process step.
de: »ADF Duplex« - Scannen der Vorder- und Rückseiten von Dokumenten mit dem automatischen Dokumenteneinzug. Beachten Sie, dass die Rückseitenabbildung in einem separaten Nachbearbeitungsschritt gedreht werden muss.

source: \[lq]TMA Slides\[rq] - Slide scanning with transparent media adapter. (Not fully supported by hp5590 backend).
de: »TMA Slides« - Dia-Scannen mit einem Adapter für transparente Medien. (Vom hp5590-Backend nicht vollständig unterstützt).

source: \[lq]TMA Negatives\[rq] - Negative film scanning with transparent media adapter. (Not fully supported by hp5590 backend).
de: »TMA Negatives« - Scannen von Filmnegativen mit einem Adapter für transparente Medien. (Vom hp5590-Backend nicht vollständig unterstützt).

source: B<--resolution >\f[I]res\fR
de: B<--resolution >\f[I]Auflösung\fR

source: Set the resolution of the scanned image in \f[B]dpi\f[R]. \f[I]res\f[R] must be one of: 100, 200, 300, 600, 1200, 2400.\fR
de: setzt die Auflösung des gescannen Bildes in \f[B]DPI\f[R]. \f[I]Auflösung\fR muss einer der folgenden Werte sein: 100, 200, 300, 600, 1200, 2400.\fR

source: Default settings: Lineart, Flatbed, 100dpi.
de: Standardeinstellung: Lineart, Flatbed, 100dpi.

source: Extend lamp timeout period. no = 15 minutes, yes = 1 hour. (Default: no)
de: erhöht die Zeitüberschreitungsperiode für die Lampe. no = 15 Minuten, yes = 1 Stunde. (Vorgabe: no)

source: Wait for button press before scanning starts. (Default: no)
de: wartet vor dem Starten des Scannens auf den Knopfdruck. (Vorgabe: no)

source: Request a preview-quality scan. (Default: no)
de: fordert einen Vorschau-Scan an. (Vorgabe: no)

source: Hide end-of-page indicator pixels and overwrite with color of next neighbor pixels. (Default: yes)
de: versteckt die Pixel zur Anzeige des Seitenendes und überschreibt diese mit den Farben der benachbarten Pixel. (Vorgabe: yes)

source: The scanner uses the last pixel in every scan line for storing the end-of-page status. This is needed to detect the end of the document sheet when the automatic document feeder (ADF) is used. Unfortunately the end-of-page pixels are also generated in flatbed scans. It is recommended to hide these pixels.
de: Der Scanner verwendet das letzte Pixel in jeder Scanzeile zum Speichern des Zeilenendestatus. Dies wird benötigt, um das letzte Blatt eines Dokuments zu erkennen, wenn der automatische Dokumenteneinzug (ADF) verwendet wird. Unglücklicherweise werden die Seitenende-Pixel auch bei Flachbett-Scans erzeugt. Es wird empfohlen, diese zu verstecken.

source: B<--trailing-lines-mode >\f[I]mode\fR
de: B<--trailing-lines-mode >\f[I]Modus\fR

source: Filling mode of trailing lines after end of page when automatic document feeder (ADF) is used. \f[I]mode\f[R] must be one of: \[lq]last\[rq], \[lq]raw\[rq], \[lq]raster\[rq], \[lq]white\[rq], \[lq]black\[rq], \[lq]color\[rq]. (Default: \[lq]last\[rq])\fR
de: Auffüllmodus für nachlaufende Zeilen nach dem Seitenende, wenn der automatische Dokumenteneinzug (ADF) verwendet wird. \f[I]Modus\fR muss einen der folgenden Werte annehmen: »last«, »raw«, »raster«, »white«, »black«, »color«. (Vorgabe: »last«)\fR

source: \[lq]last\[rq] = repeat the last scan line (recommended),
de: »last« = die letzte Scan-Zeile wiederholen (empfohlen),

source: \[lq]raw\[rq] = read raw scan data (not recommended),
de: »raw« = rohe Scan-Daten lesen (nicht empfohlen),

source: \[lq]raster\[rq] = generate black and white pixel pattern,
de: »raster« = schwarze und weiße Pixel-Muster erzeugen,

source: \[lq]white\[rq] = white pixels,
de: »white« = weiße Pixel,

source: \[lq]black\[rq] = black pixels,
de: »black« = schwarze Pixel,

source: \[lq]color\[rq] = RGB or gray colored pixels (see next option).
de: »color« = RGB oder grau gefärbte Pixel (siehe nächste Option).

source: Set color value for filling trailing scan lines in trailing lines mode \[lq]color\[rq] (see previous option). (Default color: violet)
de: setzt den Farbwert zum Auffüllen nachlaufender Scan-Zeilen im Modus nachlaufender Zeilen »color« (siehe vorherige Option). (Vorgabefarbe: violet)

source: The RGB color value must be specified and calculated as 65536 * r + 256 * g + b, with r, g, b being values in the range of 0 .. 255.
de: Der RGB-Farbwert muss mittels 65536 * r + 256 * g + b, wobei r, g, b Werte im Bereich 0 … 255 sind, festgelegt und berechnet werden.

source: READ OUT OPTIONS
de: AUSLESEOPTIONEN

source: The following options allow reading out the button state, counter value, color setting, and the state of document in ADF. This can be used to programmatically control corresponding scanner options like switching between \f[I]flatbed\f[R] and \f[I]ADF\f[R] mode, or triggering post processing tasks after scanning.\fR
de: Die folgenden Optionen erlauben das Auslesen des Knopfzustandes, des Zählerwertes, der Farbeinstellung und des Zustandes von Dokumenten im ADF. Dies kann zur programmatischen Steuerung der entsprechenden Scanneroptionen verwendet werden, wie dem Umschalten zwischen den Modi \f[I]flatbed\f[R] und \f[I]ADF\f[R] oder dem Auslösen von Nachverarbeitungsaufgaben nach dem Scannen.\fR

source: Get the id of the last button pressed. Id is one of \[lq]none\[rq], \[lq]power\[rq], \[lq]scan\[rq], \[lq]collect\[rq], \[lq]file\[rq], \[lq]email\[rq], \[lq]copy\[rq], \[lq]up\[rq], \[lq]down\[rq], \[lq]mode\[rq], \[lq]cancel\[rq].
de: Ermittelt die Kennung des zuletzt gedrückten Knopfes, Kennung ist einer der folgenden Werte: »none«, »power«, »scan«, »collect«, »file«, »email«, »copy«, »up«, »down«, »mode«, »cancel«.

source: The scanner stores the id of the last button pressed until it is read. After read out, the state is reset and subsequent readings will return \[lq]none\[rq].
de: Der Scanner speichert die Kennung des zuletzt gedrückten Knopfes, bis dieser ausgelesen wird. Nach dem Auslesen wird der Zustand zurückgesetzt und nachfolgende Lesevorgänge liefern den Wert »none« zurück.

source: Get the state of the color LED indicators. The state is either \[lq]color\[rq] or \[lq]black_white\[rq].
de: Ermittelt den Zustand der Farb-LED-Statusanzeige. Der Zustand ist entweder »color« oder »black_white«.

source: Get the counter value as shown on LCD. The value is in the range of 1 .. 99.
de: Setzt den Zählerwert wie im LCD gesetzt. Der Wert ist im Bereich 1 … 99.

source: Get the state of the document-available indicator of the automatic document feeder (ADF). The state is either \[lq]yes\[rq] or \[lq]no\[rq].
de: ermittelt den Zustand der Anzeige des automatischen Dokumenteneinzugs (ADF), ob ein Dokument verfügbar ist. Der Status ist entweder »yes« oder »no«.

source: HINTS FOR USERS OF SCANBD
de: HINWEISE FÜR NUTZER VON SCANBD

source: B<scanbd>(8) is a scanner button daemon, which can read scanner buttons and trigger scan actions.
de: B<scanbd>(8) ist ein Scannerknopf-Daemon, der Scannerknöpfe auslesen und Scan-Aktionen auslösen kann.

source: Do not use the old B<scanbuttond>(8) interface with hp5590. It is outdated and shall not be used any more. The regular interface of B<scanbd>(8) is fully supported by the current version of the \f[I]hp5590\f[R] backend.\fR
de: Verwenden Sie mit dem hp5590 nicht die alte Schnittstelle B<scanbuttond>(8). Sie ist veraltet und darf nicht mehr verwendet werden. Die normale Schnittstelle von B<scanbd>(8) wird von der aktuellen Version des Backends \f[I]hp5590\f[R] voll unterstützt.\fR

source: This example shows a minimum configuration file and the corresponding script file for B<scanbd>(8) to be included in I<scanbd.conf>.
de: Dieses Beispiel zeigt eine minimale Konfigurationsdatei und die entsprechende Skriptdatei für B<scanbd>(8), wie sie in I<scanbd.conf> aufgenommen werden kann.

source: \f[C] device hp5590 { # Device matching filter = \[dq]\[ha]hp5590.*\[dq] desc = \[dq]HP5590 Scanner Family\[dq]\fR
de: \f[C] device hp5590 { # Geräteabgleich filter = \[dq]\[ha]hp5590.*\[dq] desc = \[dq]HP5590-Scanner-Familie\[dq]\fR

source: \f[C] # Read out counter value and store in environment variable. function function_lcd_counter { filter = \[dq]\[ha]counter-value.*\[dq] desc = \[dq]hp5590: LCD counter\[dq] env = \[dq]SCANBD_FUNCTION_LCD_COUNTER\[dq] }\fR
de: \f[C] # Zählerwert auslesen und in einer Umgebungsvariable speichern. function function_lcd_counter { filter = \[dq]\[ha]counter-value.*\[dq] desc = \[dq]hp5590: LCD-Zähler\[dq] env = \[dq]SCANBD_FUNCTION_LCD_COUNTER\[dq] }\fR

source: \f[C] # Run scan script when button is pressed. action do-scan { filter = \[dq]\[ha]button-pressed.*\[dq] desc = \[dq]hp5590: Scan button pressed\[dq] script = \[dq]scan_action.script\[dq] string-trigger { from-value = \[dq]none\[dq] to-value = \[dq]scan\[dq] } } }\fR
de: \f[C] # Skript ausführen, wenn der Knopf gedrückt wird. action do-scan { filter = \[dq]\[ha]button-pressed.*\[dq] desc = \[dq]hp5590: Scan-Knopf gedrückt\[dq] script = \[dq]scan_action.script\[dq] string-trigger { from-value = \[dq]none\[dq] to-value = \[dq]scan\[dq] } } }\fR

source: \f[C] #!/bin/bash echo device = $SCANBD_DEVICE echo action = $SCANBD_ACTION echo counter = $SCANBD_FUNCTION_LCD_COUNTER scanfile=\[dq]$HOME/tmp/scans/scan-$(date +%s).pnm\[dq] case $SCANBD_ACTION in do-scan) scanimage -d \[dq]$SCANBD_DEVICE\[dq] E<gt> \[dq]$scanfile\[dq] ;; *) echo Warning: Unknown scanbd action: \[dq]$SCANBD_ACTION\[dq] ;; esac\fR
de: \f[C] #!/bin/bash echo device = $SCANBD_DEVICE echo action = $SCANBD_ACTION echo counter = $SCANBD_FUNCTION_LCD_COUNTER scanfile=\[dq]$HOME/tmp/scans/scan-$(date +%s).pnm\[dq] case $SCANBD_ACTION in do-scan) scanimage -d \[dq]$SCANBD_DEVICE\[dq] E<gt> \[dq]$scanfile\[dq] ;; *) echo Warnung: Unbekannte Scanbd-Aktion: \[dq]$SCANBD_ACTION\[dq] ;; esac\fR

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend.

source: Higher debug levels increase the verbosity of the output:
de: Größere Werte erhöhen die Ausführlichkeit der Ausgabe:

source: \f[C] 10 - generic processing 20 - verbose backend messages 40 - HP5590 high-level commands 50 - HP5590 low-level (USB-in-USB) commands\fR
de: \f[C] 10 - allgemeine Verarbeitung 20 - ausführliche Meldungen vom Backend 40 - HP5590 abstrakte Befehle 50 - HP5590 systemnahe (USB-in-USB) Befehle\fR

source: B<Example:>
de: B<Beispiel:>

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: The \f[B]sane-hp5590\f[R] library implements a SANE (Scanner Access Now Easy) backend that provides access to the following Hewlett-Packard Workgroup/Document scanners:\fR
de: Die Bibliothek \f[B]sane-hp5590\f[R] implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die folgenden Hewlett-Packard Arbeitsgruppen-/Dokumentenscanner:\fR

source: If you own a scanner other than the ones listed above that works with this backend, please let us know this by sending the scanner\[cq]s exact model name and the USB vendor and device ids (e.g.\ from \f[I]/sys/bus/usb/devices\f[R], \f[I]sane-find-scanner\f[R] or syslog) to us. Even if the scanner\[cq]s name is only slightly different from the models mentioned above, please let us know.\fR
de: Falls Sie einen anderen als die oben aufgeführten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie uns die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Gerätekennungen (zum Beispiel aus \f[I]/sys/bus/usb/devices\f[R], mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben genannten Modellen unterscheidet, lassen Sie es uns bitte wissen.\fR

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in \f[I]xscanimage\f[R] or \f[I]xsane\f[R]. Valid command line options and their syntax can be listed by using:\fR
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie Scanimage übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in \f[I]xscanimage\f[R] oder \f[I]xsane\f[R] gesteuert werden. Gültige Optionen für die Befehlszeilenoptionen und ihre Syntax können durch Ausführung von\fR

source: where \f[I]interface\f[R] and \f[I]device\f[R] specify the device in question, as in the configuration file. Add \f[I]--all-options\f[R] to also list the hardware read-out options. The -d parameter and its argument can be omitted to obtain information on the first scanner identified.\fR
de: aufgelistet werden, wobei \f[I]Schnittstelle\f[R] und \f[I]Gerät\f[R] das gewünschte Gerät angeben, wie in der Konfigurationsdatei. Fügen Sie B<--all-options> hinzu, um auch die Hardware-bezogenen Optionen aufzulisten. Der Parameter B<-d> und dessen Argument können weggelassen werden, um Informationen zum ersten identifizierten Scanner zu erhalten.

source: The following options allow reading out the button state, counter value, color setting, and the state of document in ADF. This can be used to programmatically control corresponding scanner options like switching between \f[I]flatbed\f[R] and \f[I]ADF\f[R] mode, or triggering prost processing tasks after scanning.\fR
de: Die folgenden Optionen erlauben das Auslesen des Knopfzustandes, des Zählerwertes, der Farbeinstellung und des Zustandes von Dokumenten im ADF. Dies kann zur programmatischen Steuerung der entsprechenden Scanneroptionen verwendet werden, wie dem Umschalten zwischen den Modi \f[I]flatbed\f[R] und \f[I]ADF\f[R] oder dem Auslösen von Nachverarbeitungsaufgaben nach dem Scannen.\fR

source: \f[I]Scanbd\f[R] is a scanner button daemon, which can read scanner buttons and trigger scan actions.\fR
de: \f[I]Scanbd\f[R] ist ein Scannerknopf-Daemon, der Scannerknöpfe auslesen und Scan-Aktionen auslösen kann.\fR

source: Do not use the old \f[I]scanbuttond\f[R] interface with hp5590. It is outdated and shall not be used any more. Scanbd\[cq]s regular interface is fully supported by the current version of the \f[I]hp5590\f[R] backend.\fR
de: Verwenden Sie mit dem hp5590 nicht die alte Schnittstelle \f[I]scanbuttond\f[R]. Sie ist veraltet und darf nicht mehr verwendet werden. Die normale Schnittstelle von Scanbd wird von der aktuellen Version des Backends \f[I]hp5590\f[R] voll unterstützt.\fR

source: This example shows a minimum configuration file and the corresponding script file for scanbd to be included in \f[I]scanbd.conf\f[R].\fR
de: Dieses Beispiel zeigt eine minimale Konfigurationsdatei und die entsprechende Skriptdatei für Scanbd, wie sie in \f[I]scanbd.conf\f[R] aufgenommen werden kann.\fR
