Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-epson2.5.po
Languages: de

source: If the scanner is not even recognized as an Epson scanner this is probably because the device name reported by the scanner is not in the correct format. Please send this information to the backend maintainer (email address is in the AUTHOR section of this man page or in the AUTHORS file of the SANE distribution).
de: Falls der Scanner noch nicht einmal als Epson-Scanner erkannt wird, liegt das wahrscheinlich daran, dass der vom Scanner berichtete Gerätename nicht im korrekten Format vorliegt. Bitte schicken Sie diese Information an den Backend-Betreuer (die E-Mail-Adresse finden Sie im Abschnitt AUTOR dieser Handbuchseite oder in der Datei AUTHORS in der SANE-Distribution).

source: AUTHOR
de: AUTOR

source: The package is written by Alessandro Zummo and is based on previous work done by Karl Hienz Kremer in the epson package as well as based on work by Christian Bucher and Kazuhiro Sasayama.
de: Dieses Paket wurde von Alessandro Zummo geschrieben. Es basiert auf vorheriger Arbeit von Karl Heinz Kremer im Epson-Paket sowie auf Arbeiten von Christian Bucher und Kazuhiro Sasayama.

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in programs like xscanimage or xsane.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in Programmen wie B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: The I<--mode> switch selects the basic mode of operation of the scanner. Valid choices are Binary, Gray and Color. The Binary mode is black and white only, Gray will produce 256 levels of gray or more depending on the scanner and Color means 24 bit color mode or more depending on the scanner. Some scanners will internally use 36 bit color, their external interface however may only support 24 bits.
de: Der Schalter B<--mode> wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind Binary, Gray und Color. Der Modus Binary ist nur Schwarz und Weiß, Gray wird 256 Graustufen erzeugen oder mehr, abhängig vom Scanner, und Color bedeutet 24-bit-Farbmodus oder mehr, abhängig vom Scanner. Einige Scanner werden intern 36 bit Farbe verwenden, ihre externe Schnittstelle könnte allerdings nur 24 bit unterstützen.

source: The I<--depth> option selects the bit depth the scanner is using. This option is only available for scanners that support more than one bit depth. Older scanners will always transfer the image in 8bit mode. Newer scanners allow one to select either 8 bits, 12 or 14 bits per color channel. For a color scan this means an effective color depth of 36 or 42 bits over all three channels. The valid choices depend on the scanner model.
de: Die Option B<--depth> wählt die Bit-Tiefe, die der Scanner verwendet. Diese Option ist nur für Scanner verfügbar, die mehr als eine Bit-Tiefe unterstützen. Ältere Scanner werden das Bild immer im 8-bit-Modus übertragen. Neuere Scanner erlauben die Auswahl von 8, 12 oder 14 bit pro Farbkanal. Für einen Farbscan bedeutet dies eine wirksame Farbtiefe von 36 oder 42 bit über alle drei Kanäle. Die gültigen Wahlmöglichkeiten hängen vom Scannermodell ab.

source: The I<--halftoning> switch selects the mode that is used in Binary mode. Valid options are "None", "Halftone A (Hard Tone)", "Halftone B (Soft Tone)", "Halftone C (Net Screen)", "Dither A (4x4 Bayer)", "Dither B (4x4 Spiral)", "Dither C (4x4 Net Screen)", "Dither D (8x4 Net Screen)", "Text Enhanced Technology", "Download pattern A", and "Download pattern B".
de: Der Schalter B<--halftoning> wählt einen Modus aus, der im Binärmodus verwendet wird. Gültige Optionen sind »None«, »Halftone A (Hard Tone)«, »Halftone B (Soft Tone)«, »Halftone C (Net Screen)«, »Dither A (4x4 Bayer)«, »Dither B (4x4 Spiral)«, »Dither C (4x4 Net Screen)«, »Dither D (8x4 Net Screen)«, »Text Enhanced Technology«, »Download pattern A« und »Download pattern B«.

source: The I<--dropout> switch selects the so called dropout color. Valid options are None, Red, Green and Blue. The default is None. The dropout color is used for monochrome scanning and selects the color that is not scanned. This can be used to e.g. scan an original with a colored background.
de: Der Schalter B<--dropout> wählt die sogenannte Ausfallfarbe. Gültige Optionen sind None, Red, Green und Blue. Die Vorgabe ist None. Die Ausfallfarbe wird beim monochromen Scannen verwendet und wählt die Farbe, die nicht gescannt wird. Dies kann zum Beispiel zum Scannen eines Originals mit einem farbigen Hintergrund verwendet werden.

source: The I<--brightness> switch controls the brightness of the scan. Valid options are integer values from -3 to 3. The default is 0. The larger the brightness value, the brighter the image gets. If a user defined table for the gamma correction is selected, the brightness parameter is not available.
de: Der Schalter B<--brightness> steuert die Helligkeit des Scans. Gültige Optionen sind Ganzahlwerte von -3 bis 3. Die Vorgabe ist 0. Je größer der Helligkeitswert ist, desto heller wird das Bild. Falls eine benutzerdefinierte Tabelle für die Gamma-Korrektur verwendet wird, steht der Helligkeitsparameter nicht zur Verfügung.

source: The I<--sharpness> switch sets the sharpness of the image data. Valid options are integer values from -2 to 2, with -2 meaning "Defocus", -1 "Defocus slightly", 0 "Normal", 1 "Sharpen slightly" and 2 "Sharpen".
de: Der Schalter B<--sharpness> setzt die Schärfe der Bilddaten. Gültige Optionen sind Ganzzahlwerte von -2 bis 2, wobei -2 »defokussiert«, -1 »leicht defokussiert«, 0 »normal«, 1 »leicht geschärft« und 2 »geschärft« bedeutet.

source: The I<--gamma-correction> switch controls the scanner's internal gamma correction. Valid options are "Default", "User defined", "High density printing" "Low density printing" and "High contrast printing".
de: Der Schalter B<--gamma-correction> steuert die Scanner-interne Gamma-Korrektur. Gültige Optionen sind »Default«, »User defined«, »High density printing«, »Low density printing« und »High contrast printing«.

source: The I<--color-correction> switch controls the scanner's internal color correction function. Valid options are "No Correction", "Impact-dot printers", "Thermal printers", "Ink-jet printers" and "CRT monitors". The default is "CRT monitors".
de: Der Schalter B<--color-correction> steuert die Scanner-interne Farbkorrekturfunktion. Gültige Optionen sind »No Correction«, »Impact-dot printers«, »Thermal printers«, »Ink-jet printers« und »CRT monitors«. Die Vorgabe ist »CRT monitors«.

source: The I<--resolution> switch selects the resolution for a scan. Some EPSON scanners will scan in any resolution between the lowest and highest possible value. The list reported by the scanner can be displayed using the "--help -d epson" parameters to scanimage.
de: Der Schalter B<--resolution> wählt die Scan-Auflösung. Einige EPSON-Scanner scannen in jeder Auflösung zwischen dem niedrigsten und dem höchsten möglichen Wert. Die vom Scanner berichtete Liste kann mit den Parametern »--help -d epson« von B<scanimage>(1) angezeigt werden.

source: The I<--threshold> switch selects the minimum brightness to get a white point.
de: Der Schalter B<--threshold> wählt die minimale Helligkeit, um einen Weißpunkt zu erreichen.

source: The I<--mirror> option controls the way the image is scanned. By reading the image data from right to left the image is mirrored. Valid options are "yes" and "no". The default is "no".
de: Die Option B<--mirror> steuert die Art, wie das Bild gescannt wird. Durch Lesen der Bilddaten von rechts nach links wird das Bild gespiegelt. Gültige Optionen sind »yes« und »no«. Die Vorgabe ist »no«.

source: The I<--auto-area-segmentation> switch activates the automatic area segmentation for monochrome scans. The scanner will try to determine which areas are text and which contain images. The image areas will be halftoned, and the text will be improved. Valid options are "yes" and "no". The default is "yes".
de: Der Schalter B<--auto-area-segmentation> aktiviert die automatische Bereichsunterteilung für monochrome Scans. Der Scanner wird versuchen, die Bereiche zu erkennen, die Text sind und die Bilder enthalten. Die Bildbereiche werden gerastert und der Text wird verbessert. Gültige Optionen sind »yes« oder »no«. Die Vorgabe ist »yes«.

source: The I<--red-gamma-table> parameter can be used to download a user defined gamma table for the red channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--red-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den roten Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The I<--green-gamma-table> parameter can be used to download a user defined gamma table for the green channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--green-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den grünen Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The I<--blue-gamma-table> parameter can be used to download a user defined gamma table for the blue channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--blue-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den blauen Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The I<--wait-for-button> parameter can be used to wait until the button on the scanner is pressed to actually start the scan process.
de: Der Parameter B<--wait-for-button> kann dazu verwandt werden, auf den Druck des Knopfes am Scanner zu warten, bevor der Scan-Prozess tatsächlich startet.

source: The color correction coefficients I<--cct-1 --cct-2 --cct-3 ... --cct-9> will install color correction coefficients for the user defined color correction. Values are specified as integers in the range -127..127.
de: Die Farbkorrekturkoeffizienten B<--cct-1 --cct-2 --cct-3 … --cct-9> installieren Farbkorrekturkoeffizienten für die benutzerdefinierten Farbkorrekturen. Werte werden als Ganzzahlen im Bereich -127..127 angegeben.

source: The I<--preview> option requests a preview scan. The frontend software automatically selects a low resolution. Valid options are "yes" and "no". The default is "no".
de: Die Option B<--preview> fordert einen Vorschauscan an. Die Oberfläche wählt automatisch eine niedrige Auflösung. Gültige Optionen sind »yes« oder »no«. Die Vorgabe ist »no«.

source: The geometry options I<-l -t -x -y> control the scan area: -l sets the top left x coordinate, -t the top left y coordinate, -x selects the width and -y the height of the scan area. All parameters are specified in millimeters.
de: Die Geometrie-Optionen B<-l -t -x -y> steuern den Scan-Bereich: »-l« setzt die obere linke X-Koordinate, »-t« die obere linke Y-Koordinate, »-x« wählt die Breite und »-y« die Höhe des Scan-Bereichs. Alle Parameter werden in Millimetern angegeben.

source: The I<--source> option selects the scan source. Valid options depend on the installed options. The default is "Flatbed".
de: Die Option B<--source> wählt die Scan-Quelle. Gültige Optionen hängen von den installierten Optionen ab. Die Vorgabe ist »Flatbed«.

source: The I<--auto-eject> option will eject a page after scanning from the document feeder.
de: Die Option B<--auto-eject> wird eine Seite nach dem Scannen vom Dokumenteneinzug auswerfen.

source: The I<--film-type> option will select the film type for scans with the transparency unit. This option is only activated if the TPU is selected as scan source. Valid options are "Negative Film" and "Positive Film".
de: Die Option B<--film-type> wird den Filmtyp für Scans mit der Durchlichteinheit auswählen. Diese Option ist nur aktiviert, falls ein TPU als Scan-Quelle ausgewählt ist. Gültige Optionen sind »Negative Film« und »Positive Film«.

source: The I<--focus-position> option selects the focus position for all scans. Valid options are "Focus 2.5mm above glass" and "Focus on glass". The focus on the 2.5mm point above the glass is necessary for scans with the transparency unit, so that the scanner can focus on the film if one of the film holders is used. This option is only functional for selected scanners, all other scanners will ignore this option.
de: Die Option B<--focus-position> wählt die Fokusposition für alle Scans. Gültige Optionen sind »Focus 2.5mm above glass« und »Focus on glass«. Der Fokuspunkt 2,5 mm oberhalb des Glases ist für die Durchlichteinheit notwendig, so dass der Scanner auf den Film fokussieren kann, falls einer der Filmhalter verwendet wird. Diese Option ist nur für ausgewählte Scanner wirksam, alle anderen Scanner werden diese Option ignorieren.

source: The I<--bay> option selects which bay to scan
de: Die Option B<--bay> wählt den Schacht aus, der gescannt werden soll.

source: The I<--eject> option ejects the sheet in the ADF.
de: Die Option B<--eject> wirft das Blatt aus dem automatischen Dokumenteneinzug aus.

source: The I<--adf-mode> option select the ADF mode (simplex/duplex).
de: Die Option B<--adf-mode> wählt den Modus des automatischen Dokumenteneinzugs (simplex/duplex, einseitig oder beidseitig).

source: The configuration file /etc/sane.d/epson2.conf specifies the device(s) that the backend will use. Possible connection types are:
de: Die Konfigurationsdatei I</etc/sane.d/epson2.conf> gibt das Gerät oder die Geräte an, die das Backend verwenden wird. Mögliche Anschlusstypen sind:

source: This is the default, and if nothing else is specified the backend software will open a given path as SCSI device. More information about valid syntax for SCSI devices can be found in sane-scsi(5).
de: Dies ist die Vorgabe und falls nichts anderes festgelegt ist, wird die Backend-Software einen angegebenen Pfad als SCSI-Gerät öffnen. Weitere Informationen über die für SCSI-Geräte gültige Syntax können in B<sane-scsi>(5) gefunden werden.

source: I<PIO - Parallel Interface>
de: I<PIO - Parallelschnittstelle>

source: The parallel interface can be configured in two ways: An integer value starting at the beginning of a line will be interpreted as the IO address of the parallel port. To make it clearer that a configured IO address is a parallel port the port address can be preceded by the string "PIO". The PIO connection does not use a special device file in the /dev directory. The IO address can be specified in hex mode (prefixed with "0x").
de: Die Parallelschnittstelle kann auf zwei Arten konfiguriert werden: Ein Ganzzahlwert am Anfang der Zeile wird als E/A-Adresse des Parallel-Ports interpretiert. Um klarzustellen, dass eine konfigurierte E/A-Adresse ein Parallel-Port ist, kann der Port-Adresse die Zeichenkette »PIO« vorangestellt werden. Die PIO-Verbindung verwendet die besondere Gerätedatei im Verzeichnis I</dev> nicht. Die E/A-Adresse kann im Hexadezimalmodus (mit vorangestelltem »0x«) festgelegt werden.

source: For USB scanners not automatically detect, their VENDOR and PRODUCT ID can be specified manually in the config file. More information about valid syntax for USB devices can be found in sane-usb(5).
de: Für nicht automatisch erkannte USB-Scanner kann ihre LIEFERANTEN- und PRODUKTKENNUNG händisch in der Konfigurationsdatei festgelegt werden. Weitere Informationen über die gültige Syntax für USB-Geräte kann in B<sane-usb>(5) gefunden werden.

source: I<Network>
de: I<Netzwerk>

source: Network scanners can be auto-discovered if I<autodiscovery> is specified after I<net> keyword. An IP address to connect to can also be used.
de: Netzwerkscanner können automatisch erkannt werden, wenn I<autodiscovery> nach dem Schlüsselwort I<net> angegeben wird. Eine IP-Adresse kann ebenfalls zum Verbinden verwendet werden.

source: sane-scsi(5), sane-usb(5), scanimage(1), xscanimage(1), xsane(1)
de: B<sane-scsi>(5), B<sane-usb>(5), B<scanimage>(1), B<xscanimage>(1), B<xsane>(1)

source: The package is written by Alessandro Zummo and is based on previous work done by Karl Hienz Kremer in the epson package as well as based on work by Christian Bucher and Kazuhiro Sasayama
de: Dieses Paket wurde von Alessandro Zummo geschrieben. Es basiert auf vorheriger Arbeit von Karl Heinz Kremer im Epson-Paket sowie auf Arbeiten von Christian Bucher und Kazuhiro Sasayama.
