Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-agfafocus.5.po
Languages: de

source: 10 Jul 2008
de: 10. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-agfafocus - SANE backend for AGFA Focus flatbed scanners
de: sane-agfafocus - SANE backend for AGFA Focus-Flachbettscanner

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-agfafocus> library implements a SANE (Scanner Access Now Easy) backend that provides access to AGFA Focus flatbed scanners. At present, the following scanners are supported from this backend:
de: Die Bibliothek B<sane-agfafocus> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die Focus-Flachbettscanner von AGFA. Gegenwärtig unterstützt dieses Backend die folgenden Scanner:

source: AGFA Focus GS Scanner (6 bit gray scale) (untested)
de: AGFA Focus GS Scanner (6 Bit Graustufen) (nicht getestet)

source: AGFA Focus Lineart Scanner (lineart) (untested)
de: AGFA Focus Lineart Scanner (lineart) (nicht getestet)

source: AGFA Focus II (8 bit gray scale) (untested)
de: AGFA Focus II (8 Bit Graustufen) (nicht getestet)

source: AGFA Focus Color (24 bit color 3-pass)
de: AGFA Focus Color (24 Bit Farbe, 3 Durchläufe)

source: AGFA Focus Color Plus (24 bit color 3-pass)
de: AGFA Focus Color Plus (24 Bit Farbe, 3 Durchläufe)

source: Siemens S9036 (8 bit gray scale) (untested)
de: Siemens S9036 (8 Bit Graustufen) (nicht getestet)

source: The driver supports line art, 6bpp and 8bpp gray, 18bpp and 24bpp color scans.
de: Der Treiber unterstützt Strichzeichung-, Graustufenscans in 6 bpp und 8 bpp sowie Farbscans in 18 bpp und 24 bpp.

source: If you own a scanner other than the ones listed above that works with this backend, please let us know by sending the scanner's model name, SCSI id, and firmware revision to I<sane-devel@alioth-lists.debian.net>. Have a look at I<http://www.sane-project.org/mailing-lists.html> concerning subscription to sane-devel.
de: Falls Sie einen anderen als die genannten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie uns die Modellbezeichnung des Scanners, die SCSI-Kennung und die Firmware-Revision an I<sane-devel@alioth-lists.debian.net>. Auf I<http://www.sane-project.org/mailing-lists.html> finden Sie Informationen, wie Sie Sane-devel abonnieren können.

source: All of these scanners are pre-SCSI-2, and do not even report properly to SCSI Inquiry. This is typically evident in SCSI bus scans, where the scanner will come up with only garbage as vendor and models strings.
de: Alle diese Scanner datieren vor SCSI-2 und geben noch nicht einmal bei SCSI-Anfragen korrekte Rückmeldungen aus. Dies ist typischerweise bei SCSI-Bus-Durchläufen sichtbar, bei denen der Scanner Müll für die Zeichenketten des Lieferanten und Modells zurückliefert.

source: DEVICE NAMES
de: GERÄTENAMEN

source: This backend expects device names of the form:
de: Dieses Backend erwartet Gerätenamen der folgenden Form:

source: I<special>
de: I<Spezialdatei>

source: where I<special> is the path-name for the special device that corresponds to a SCSI scanner. For SCSI scanners, the special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sge>, for example. See B<sane-scsi>(5) for details.
de: Die angegebene I<Spezialdatei> ist der Pfadname eines Spezialgeräts, das einem SCSI-Scanner entspricht. Für SCSI-Scanner muss der Name des Spezialgeräts ein generisches SCSI-Gerät oder ein symbolischer Link zu so einem Gerät sein. Unter Linux könnte ein solcher Gerätename beispielsweise I</dev/sga> oder I</dev/sge> sein. Siehe B<sane-scsi>(5) für Details.

source: CONFIGURATION
de: KONFIGURATION

source: The contents of the I<agfafocus.conf> file is a list of device names that correspond to AGFA Focus scanners. Empty lines and lines starting with a hash mark (#) are ignored. A sample configuration file is shown below:
de: Die Datei I<agfafocus.conf> enthält eine Liste von Gerätenamen, die AGFA-Focus-Scannern entsprechen. Leere Zeilen und solche, die mit einer Raute (#) beginnen, werden ignoriert. Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: # this is a comment
de: # Dies ist ein Kommentar

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity. B<SANE_DEBUG_AGFAFOCUS> values:
de: Falls die Bibliothek mit aktivierter Debug-Unterstützung übersetzt wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Ein Wert von 128 fordert z.B. die Ausgabe von Debug-Meldungen. Kleinere Werte reduzieren die Ausgabemenge. B<SANE_DEBUG_AGFAFOCUS>-Werte:

source: \f(CRNumber Remark 0 print important errors (printed each time) 1 print errors 2 print sense 3 print warnings 4 print scanner-inquiry 5 print information 6 print less important information 7 print called procedures 8 print reader_process messages 10 print called sane-init-routines 11 print called sane-procedures 12 print sane infos 13 print sane option-control messages\fR
de: \f(CRNummer Bemerkung 0 Ausgabe wichtiger Fehler (jedes Mal ausgegeben) 1 Ausgabe von Fehlern 2 Ausgabe des Sinns 3 Ausgabe von Warnungen 4 Ausgabe Scanner-Abfrage 5 Ausgabe von Informationen 6 Ausgabe weniger wichtiger Informationen 7 Ausgabe aufgerufener Prozeduren 8 Ausgabe von reader_process-Meldungen 10 Ausgabe aufgerufener sane-init-Routinen 11 Ausgabe aufgerufener Sane-Prozeduren 12 Ausgabe von Sane-Informationen 13 Ausgabe von Sane-Option-Steuer-Meldungen\fR

source: MISSING FUNCTIONALITY
de: FEHLENDE FUNKTIONALITÄT

source: Uploading of dither matrices and tonecurves has been implemented, but so far has not proven to be useful for anything. For this reason these options have been disabled.
de: Das Hochladen von Dither-Matrizen und Gradationskurven wurde implementiert, hat sich aber bisher für nichts als nützlich erwiesen. Aus diesem Grund wurden diese Optionen deaktiviert.

source: BUGS
de: FEHLER

source: The scanners that do not support disconnect have problems with SCSI timeouts if the SCSI bus gets loaded, eg. if you do a kernel build at the same time as scanning. To see if your scanner supports disconnect, run I<SANE_DEBUG_AGFAFOCUS=128 scanimage -L> in a terminal and look for the "disconnect:" line.
de: Die Scanner, die »disconnect« nicht unterstützen, haben Probleme mit SCSI-Zeitüberschreitungen, falls der SCSI-Bus unter Last kommt, z.B. falls Sie zeitgleich zum Scannen einen Kernel bauen. Um zu prüfen, ob Ihr Scanner »disconnect« unterstützt, führen Sie in einem Terminal I<SANE_DEBUG_AGFAFOCUS=128 scanimage -L> aus und schauen Sie nach der Zeile »disconnect:«.

source: DEBUG
de: DEBUGGING

source: If you have problems with SANE not detecting your scanner, make sure the Artec backend is disabled. Somehow, this backend causes at least my scanner not to respond correctly to SCSI inquiry commands.
de: Falls Sie Probleme haben, dass SANE Ihren Scanner nicht erkennt, stellen Sie sicher, dass das Backend Artec deaktiviert ist. Irgendwie führt dieses Backend dazu, dass zumindest mein Scanner nicht korrekt auf SCSI-Abfrage-Befehle reagiert.

source: If you encounter a bug please set the environment variable B<SANE_DEBUG_AGFAFOCUS> to 128 and try to regenerate the problem. Then send me a report with the log attached.
de: Falls Sie einen Fehler beobachten, setzen Sie bitte die Umgebungsvariable B<SANE_DEBUG_AGFAFOCUS> auf 128 und versuchen Sie, das Problem zu reproduzieren. Dann schicken Sie mir auf Englisch einen Bericht mit angehängtem Protokoll.

source: If you encounter a SCSI bus error or trimmed and/or displaced images please also set the environment variable B<SANE_DEBUG_SANEI_SCSI> to 128 before sending me the report.
de: Falls Sie auf einen SCSI-Fehler oder abgeschnittene und/oder versetzte Abbildungen treffen, setzen Sie bitte auch die Umgebungsvariable B<SANE_DEBUG_SANEI_SCSI> auf 128, bevor Sie mir den Bericht senden.

source: TODO
de: OFFENE PUNKTE

source: B<More scanners?>
de: B<Weitere Scanner?>

source: The AGFA ACS and ARCUS scanners are similar to the FOCUS scanners. The driver could probably be extended to support these scanners without too many changes. I do not have access to such scanners, and cannot add support for it. However, if you are in possession of such a scanner, I could be helpful in adding support for these scanners.
de: Die Scanner AGFA ACS und ARCUS sind ähnlich zu den FOCUS-Scannern. Der Treiber könnte wahrscheinlich ohne große Änderungen erweitert werden, um diese auch zu unterstützen. Ich habe auf diese Scanner keinen Zugriff und kann keine Unterstützung dafür hinzufügen. Falls Sie allerdings einen solchen Scanner in Ihrem Besitz haben, könnte ich dabei helfen, die Unterstützung für diese Scanner hinzuzufügen.

source: The AGFA HORIZON scanners are SCSI-2 scanners, and it would probably be easier to support these scanners in a SCSI-2 compliant backend.
de: Die Scanner AGFA HORIZON sind SCSI-2-Scanner und es wäre wahrscheinlich einfacher, diese Scanner in einem SCSI-2-konformen Backend zu unterstützen.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: Ingo Schneider and Karl Anders \[/O]ygard.
de: Ingo Schneider und Karl Anders \[/O]ygard.

source: If you own a scanner other than the ones listed above that works with this backend, please let us know by sending the scanner's model name, SCSI id, and firmware revision to I<sane-devel@alioth-lists.debian.net>. Have a look at http://www.sane-project.org/mailing-lists.html concerning subscription to sane-devel.
de: Falls Sie einen anderen als die genannten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie uns die Modellbezeichnung des Scanners, die SCSI-Kennung und die Firmware-Revision an I<sane-devel@alioth-lists.debian.net>. Auf I<http://www.sane-project.org/mailing-lists.html> finden Sie Informationen, wie Sie Sane-devel abonnieren können.

source: Where I<special> is either the path-name for the special device that corresponds to a SCSI scanner. For SCSI scanners, the special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sge>, for example. See sane-scsi(5) for details.
de: Die angegebene I<Spezialdatei> ist der Pfadname eines Spezialgeräts, das einem SCSI-Scanner entspricht. Für SCSI-Scanner muss der Name des Spezialgeräts ein generisches SCSI-Gerät oder ein symbolischer Link zu so einem Gerät sein. Unter Linux könnte ein solcher Gerätename beispielsweise I</dev/sga> oder I</dev/sge> sein. Siehe B<sane-scsi>(5) für Details.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity. SANE_DEBUG_AGFAFOCUS values:
de: Falls die Bibliothek mit aktivierter Debug-Unterstützung übersetzt wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Ein Wert von 128 fordert z.B. die Ausgabe von Debug-Meldungen. Kleinere Werte reduzieren die Ausgabemenge. SANE_DEBUG_AGFAFOCUS-Werte:

source: The scanners that do not support disconnect have problems with SCSI timeouts if the SCSI bus gets loaded, eg. if you do a kernel build at the same time as scanning. To see if your scanner supports disconnect, run "SANE_DEBUG_AGFAFOCUS=128 scanimage -L" in sh and look for the "disconnect:" line)
de: Die Scanner, die »disconnect« nicht unterstützen, haben Probleme mit SCSI-Zeitüberschreitungen, falls der SCSI-Bus unter Last kommt, z.B. falls Sie zeitgleich zum Scannen einen Kernel bauen. Um zu prüfen, ob Ihr Scanner »disconnect« unterstützt, führen Sie auf der Shell »SANE_DEBUG_AGFAFOCUS=128 scanimage -L« aus und schauen Sie nach der Zeile »disconnect:«.

source: If you encounter a bug please set the environment variable SANE_DEBUG_AGFAFOCUS to 128 and try to regenerate the problem. Then send me a report with the log attached.
de: Falls Sie einen Fehler beobachten, setzen Sie bitte die Umgebungsvariable B<SANE_DEBUG_AGFAFOCUS> auf 128 und versuchen Sie, das Problem zu reproduzieren. Dann schicken Sie mir auf Englisch einen Bericht mit angehängtem Protokoll.

source: If you encounter a SCSI bus error or trimmed and/or displaced images please also set the environment variable SANE_DEBUG_SANEI_SCSI to 128 before sending me the report.
de: Falls Sie auf einen SCSI-Fehler oder abgeschnittene und/oder versetzte Abbildungen treffen, setzen Sie bitte auch die Umgebungsvariable B<SANE_DEBUG_SANEI_SCSI> auf 128, bevor Sie mir den Bericht senden.

source: sane(7), sane-scsi(5)
de: B<sane>(7), B<sane-scsi>(5)

source: Where I<special> is either the path-name for the special device that corresponds to a SCSI scanner. For SCSI scanners, the special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sge>, for example. See B<sane-scsi>(5) for details.
de: Die angegebene I<Spezialdatei> ist der Pfadname eines Spezialgeräts, das einem SCSI-Scanner entspricht. Für SCSI-Scanner muss der Name des Spezialgeräts ein generisches SCSI-Gerät oder ein symbolischer Link zu so einem Gerät sein. Unter Linux könnte ein solcher Gerätename beispielsweise I</dev/sga> oder I</dev/sge> sein. Siehe B<sane-scsi>(5) für Details.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).
