Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-gt68xx.5.po
Languages: de

source: 13 Jul 2008
de: 13. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-gt68xx - SANE backend for GT-68XX based USB flatbed scanners
de: sane-gt68xx - SANE-Backend für GT-68XX-basierte USB-Flachbett-Scanner

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-gt68xx> library implements a SANE (Scanner Access Now Easy) backend that provides access to USB flatbed scanners based on the Grandtech GT-6801 and GT-6816 chips. A list of supported scanners can be found on the gt68xx backend homepage: I<http://www.meier-geinitz.de/sane/gt68xx-backend/>.
de: Die Bibliothek B<sane-gt68xx> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf USB-Flachbett-Scanner, die auf den Grandtech GT-6801- und GT-6816-Chips basieren. Eine Liste der unterstützten Scanner kann auf der Homepage des gt68xx-Backends gefunden werden: I<http://www.meier-geinitz.de/sane/gt68xx-backend/>.

source: This is BETA software. Especially if you test new or untested scanners, keep your hand at the scanner's plug and unplug it, if the head bumps at the end of the scan area.
de: Dies ist BETA-Software. Insbesondere dann, wenn Sie neue oder bisher noch nicht getestete Scanner testen, behalten Sie den Netzstecker des Scanners in der Hand und ziehen Sie ihn, falls der Schlitten ans Ende des Scanbereichs stößt.

source: If you own a scanner other than the ones listed on the gt68xx homepage that works with this backend, please let me know this by sending the scanner's exact model name and the USB vendor and device ids (e.g. from B<sane-find-scanner>(1) or syslog) to me. Even if the scanner's name is only slightly different from the models already listed as supported, please let me know.
de: Falls Sie einen Scanner besitzen, der mit diesem Backend funktioniert, aber auf der gt68xx-Homepage nicht aufgeführt ist, senden Sie mir die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Gerätekennungen (zum Beispiel mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben als unterstützt aufgeführten Modellen unterscheidet, lassen Sie es mich bitte wissen.

source: If you own a scanner that isn't detected by the gt68xx backend but has a GT-6801 or GT-6816 chipset, you can try to add it to the backend. Have a look at the following web page: I<http://www.meier-geinitz.de/sane/gt68xx-backend/adding.html>
de: Falls Sie einen Scanner besitzen, der vom gt68xx-Backend nicht erkannt wird, aber einen GT-6801- oder GT-6816-Chipsatz hat, können Sie versuchen, ihn zum Backend hinzuzufügen. Schauen Sie auf folgende Webseite: I<http://www.meier-geinitz.de/sane/gt68xx-backend/adding.html>.

source: LIBUSB ISSUES
de: LIBUSB-PROBLEME

source: Please use libusb-0.1.8 or later. Without libusb or with older libusb versions all kinds of trouble can be expected. The scanner should be found by B<sane-find-scanner>(1) without further actions. For setting permissions and general USB information, look at B<sane-usb>(5).
de: Bitte verwenden Sie libusb-0.1.8 oder neuer. Ohne libusb oder mit älteren libusb-Versionen können Sie mit allem möglichen Ärger rechnen. Der Scanner sollte von B<sane-find-scanner>(1) ohne weiteres Eingreifen gefunden werden. Für das Setzen von Zugriffsrechten und allgemeine USB-Informationen lesen Sie B<sane-usb>(5).

source: FIRMWARE FILE
de: FIRMWARE-DATEI

source: You need a firmware file for your scanner. That's a small file containing software that will be uploaded to the scanner's memory. It's usually named *.usb, e.g. I<PS1fw.usb>. It comes on the installation CD that was provided by the manufacturer, but it may be packaged together with the installation program in an .exe file. For Mustek scanners, the file can be downloaded from the gt68xx backend homepage. For other scanners, check the CD for .usb files. If you only find *.cab files, try B<cabextract>(1) to unpack. If everything else fails, you must install the Windows driver and get the firmware from there (usually in the I<windows/system> or I<system32> directories). Put that firmware file into I</usr/share/sane/gt68xx/>. Make sure that it's readable by everyone.
de: Sie benötigen eine Firmware-Datei für Ihren Scanner. Das ist eine kleine Datei mit Software, die in den Speicher Ihres Scanners hochgeladen wird. Sie heißt typischerweise *.usb, z.B. I<PS1fw.usb>. Sie befindet sich auf der Installations-CD, die vom Hersteller bereitgestellt wurde, kann aber zusammen mit einem Installationsprogramm in einer .exe-Datei gepackt sein. Für Mustek-Scanner kann die Datei von der gt68xx-Backend-Homepage heruntergeladen werden. Für andere Scanner überprüfen Sie die CD auf .usb-Dateien. Falls Sie nur *.cab-Dateien finden, versuchen Sie B<cabextract>(1) zum Entpacken. Falls alles andere fehlschlägt, müssen Sie den Windows-Treiber installieren und die Firmware von dort holen (normalerweise in den Verzeichnissen I<windows/system> oder I<system32>). Legen Sie die Firmware in I</usr/share/sane/gt68xx/> ab. Sie muss von jedem lesbar sein.

source: CONFIGURATION
de: KONFIGURATION

source: The contents of the I<gt68xx.conf> file is a list of usb lines containing vendor and product ids that correspond to USB scanners. The file can also contain option lines. Empty lines and lines starting with a hash mark (#) are ignored. The scanners are autodetected by B<usb vendor_id product_id> statements which are already included into I<gt68xx.conf>. "vendor_id" and "product_id" are hexadecimal numbers that identify the scanner.
de: Der Inhalt der Datei I<gt68xx.conf> ist eine Liste von usb-Zeilen, die die Lieferanten- und Produktkennung enthalten, die USB-Scannern entsprechen. Die Datei kann auch Options-Zeilen enthalten. Leere Zeilen und Zeilen, die mit einer Raute (#) beginnen, werden ignoriert. Die Scanner werden automatisch durch B<usb vendor_id product_id>-Angaben erkannt, welche bereits in I<gt68xx.conf> aufgenommen sind. »vendor_id« und »product_id« sind hexadezimale Zahlen, die den Scanner identifizieren.

source: The B<override>, B<firmware>, B<vendor>, B<model>, and B<afe> options must be placed after the B<usb> line they refer to.
de: Die Optionen B<override>, B<firmware>, B<vendor>, B<model> und B<afe> müssen nach der B<usb>-Zeile, auf die sie sich beziehen, abgelegt werden.

source: Option B<override> is used to override the default model parameters. That's necessary for some scanners that use the same vendor/product ids but are different. For these scanners there are already commented out override lines in the configuration file. B<override mustek-scanexpress-1200-ub-plus> is necessary for the Mustek Scanexpress 1200 UB Plus, the Medion/Lifetec/Tevion LT 9452, and the Trust Compact Scan USB 19200. B<override artec-ultima-2000> is used for the Artec Ultima 2000, the Boeder SmartScan Slim Edition, the Medion/ Lifetec/ Tevion/ Cytron MD/LT 9385, the Medion/ Lifetec/ Tevion MD 9458, and the Trust Flat Scan USB 19200. B<override mustek-bearpaw-2400-cu> is necessary for the Mustek BearPaw 2400 CU and the Fujitsu 1200CUS. The B<override> option must be the first one after the B<usb> line.
de: Die Option B<override> wird zum Außerkraftsetzen von Vorgabe-Modellparametern verwendet. Das ist für einige Scanner notwendig, die die gleichen Lieferanten-/Produktkennungen verwenden, sich aber unterscheiden. Für diese Scanner gibt es bereits auskommentierte Zeilen zum Außerkraftsetzen in der Konfigurationsdatei. B<override mustek-scanexpress-1200-ub-plus> ist für den Mustek Scanexpress 1200 UB Plus, den Medion/Lifetec/Tevion LT 9452 und den Trust Compact Scan USB 19200 notwendig. B<override artec-ultima-2000> wird für den Artec Ultima 2000, den Boeder SmartScan Slim Edition, den Medion/Lifetec/Tevion/Cytron MD/LT 9385, den Medion/Lifetec/Tevion MD 9458 und den Trust Flat Scan USB 19200 verwendet. B<override mustek-bearpaw-2400-cu> ist für den Mustek BearPaw 2400 CU und den Fujitsu 1200CUS notwendig. Die Option B<override> muss die erste nach der B<usb>-Zeile sein.

source: Option B<firmware> selects the name and path of the firmware file. It's only necessary if the default (or override) doesn't work. The default firmware directory is I</usr/share/sane/gt68xx/>. You may need to create this directory. If you want to place the firmware files at a different path, use a B<firmware> line.
de: Die Option B<firmware> wählt den Namen und den Pfad der Firmware-Datei. Dies ist nur notwendig, wenn die Vorgabe (oder Außerkraftsetzung) nicht funktioniert. Das Vorgabe-Firmware-Verzeichnis ist I</usr/share/sane/gt68xx/>. Es kann sein, dass Sie dieses Verzeichnis erstellen müssen. Falls Sie die Firmware an einem anderen Ort ablegen möchten, verwenden Sie eine B<firmware>-Zeile.

source: The B<vendor> and B<model> options are not absolutely necessary but for convenience. Quite a lot of scanners from different manufacturers share the same vendor/product ids so you can set the "correct" name here.
de: Die Optionen B<vendor> und B<model> sind nicht absolut notwendig, sondern zur Bequemlichkeit. Eine ganze Reihe von Scannern von verschiedenen Herstellern verwenden die gleiche Lieferanten-/Produktkennung, so dass Sie hier den »korrekten« Namen setzen können.

source: The B<afe> option allows one to set custom offset and gain values for the Analog FrontEnd of the scanner. This option can be either used to select the AFE values if automatic coarse calibration is disabled, or to make automatic coarse calibration faster. For the latter usage, enable debug level 3 (see below), scan an image and look for debug line string with "afe". Copy this line to I<gt68xx.conf>. The option has six parameters: red offset, red gain, green offset, green gain, blue offset, and blue gain.
de: Die Option B<afe> ermöglicht es, angepasste Offsets und Verstärkungswerte für die Analog-Oberfläche (AFE) des Scanners zu setzen. Diese Option kann entweder zur Auswahl der AFE-Werte verwendet werden, falls automatische Grobkalibrierung deaktiviert ist oder um die automatische Grobkalibrierung zu beschleunigen. In letzterem Falle aktivieren Sie Debug-Stufe 3 (siehe unten), scannen ein Bild und suchen nach Debug-Zeilen mit »afe«. Kopieren Sie diese Zeilen in I<gt68xx.conf>. Die Option hat sechs Parameter: roter Offset, rote Verstärkung, grüner Offset, grüne Verstärkung, blauer Offset und blaue Verstärkung.

source: A sample configuration file is shown below:
de: Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output. If the debug level is set to 1 or higher, some debug options become available that are normally hidden. Handle them with care.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Höhere Debug-Stufen erhöhen die Ausführlichkeit der Ausgabe. Falls die Debug-Stufe auf 1 oder höher gesetzt ist, stehen einige Debug-Optionen zur Verfügung, die normalerweise versteckt sind. Verwenden Sie diese vorsichtig.

source: Example: export SANE_DEBUG_GT68XX=4
de: Beispiel: export SANE_DEBUG_GT68XX=4

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: The original gt68xx driver was written by Sergey Vlasov, Andreas Nowack, and David Stevenson. Thanks for sending patches and answering questions to them and all the other contributors.
de: Der ursprüngliche gt68xx-Treiber wurde durch Sergey Vlasov, Andreas Nowack und David Stevenson geschrieben. Vielen Dank an sie und alle anderen Beitragenden für das Einschicken von Patches und Beantworten von Fragen.

source: BUGS
de: FEHLER

source: The first few lines of the image are garbage for the 2400 TA Plus.
de: Die ersten paar Zeilen des Bildes sind beim 2400 TA Plus Müll.

source: Interpolation should be used instead of just copying data, when the X- and Y-resolution differ.
de: Statt einfach Daten zu kopieren sollte interpoliert werden, wenn sich die X- und Y-Auflösung unterscheiden.

source: Support for buttons is missing.
de: Die Knöpfe werden nicht unterstützt.

source: More detailed bug information is available at the gt68xx backend homepage I<http://www.meier-geinitz.de/sane/gt68xx-backend/>.
de: Weitere, detailliertere Fehlerinformationen sind auf der Homepage des gt68xx-Backends verfügbar: I<http://www.meier-geinitz.de/sane/gt68xx-backend/>.

source: Please contact us if you find a bug or missing feature: E<lt>I<sane-devel@alioth-lists.debian.net>E<gt>.
de: Bitte schreiben Sie uns (auf Englisch) an, falls Sie einen Fehler finden oder eine Funktion vermissen: E<lt>I<sane-devel@alioth-lists.debian.net>E<gt>.

source: Please send a debug log if your scanner isn't detected correctly (see B<SANE_DEBUG_GT68XX> above).
de: Bitte schicken Sie uns ein Debug-Protokoll, falls Ihr Scanner nicht korrekt erkannt wird (siehe B<SANE_DEBUG_GT68XX> weiter oben).

source: If you own a scanner other than the ones listed on the gt68xx homepage that works with this backend, please let me know this by sending the scanner's exact model name and the USB vendor and device ids (e.g. from I<sane-find-scanner> or syslog) to me. Even if the scanner's name is only slightly different from the models already listed as supported, please let me know.
de: Falls Sie einen anderen als die auf der gt68xx-Homepage aufgeführten Scanner besitzen, der mit diesem Backend funktioniert, senden Sie mir die genaue Modellbezeichnung des Scanners und die USB-Anbieter- und Gerätekennungen (zum Beispiel mit B<sane-find-scanner>(1) ermittelt oder aus dem Systemprotokoll). Selbst wenn sich der Name des Scanners nur geringfügig von den oben als unterstützt aufgeführten Modellen unterscheidet, lassen Sie es mich bitte wissen.

source: Please use libusb-0.1.8 or later. Without libusb or with older libusb versions all kinds of trouble can be expected. The scanner should be found by sane-find-scanner without further actions. For setting permissions and general USB information looks at B<sane-usb>(5).
de: Bitte verwenden Sie libusb-0.1.8 oder neuer. Ohne libusb oder mit älteren libusb-Versionen können Sie mit allem möglichen Ärger rechnen. Der Scanner sollte von B<sane-find-scanner>(1) ohne weiteres Eingreifen gefunden werden. Für das Setzen von Zugriffsrechten und allgemeine USB-Informationen lesen Sie B<sane-usb>(5).

source: You need a firmware file for your scanner. That's a small file containing software that will be uploaded to the scanner's memory. It's usually named *.usb, e.g. I<PS1fw.usb>. It comes on the installation CD that was provided by the manufacturer, but it may be packaged together with the installation program in an .exe file. For Mustek scanners, the file can be downloaded from the gt68xx backend homepage. For other scanners, check the CD for .usb files. If you only find *.cab files, try cabextract to unpack. If everything else fails, you must install the Windows driver and get the firmware from there (usually in the I<windows/system> or I<system32> directories). Put that firmware file into I</usr/share/sane/gt68xx/>. Make sure that it's readable by everyone.
de: Sie benötigen eine Firmware-Datei für Ihren Scanner. Das ist eine kleine Datei mit Software, die in den Speicher Ihres Scanners hochgeladen wird. Sie heißt typischerweise *.usb, z.B. I<PS1fw.usb>. Sie befindet sich auf der Installations-CD, die vom Hersteller bereitgestellt wurde, kann aber zusammen mit einem Installationsprogramm in einer .exe-Datei gepackt sein. Für Mustek-Scanner kann die Datei von der gt68xx-Backend-Homepage heruntergeladen werden. Für andere Scanner überprüfen Sie die CD auf .usb-Dateien. Falls Sie nur *.cab-Dateien finden, versuchen Sie B<cabextract>(1) zum Entpacken. Falls alles andere fehlschlägt, müssen Sie den Windows-Treiber installieren und die Firmware von dort holen (normalerweise in den Verzeichnissen I<windows/system> oder I<system32>). Legen Sie die Firmware in I</usr/share/sane/gt68xx/> ab. Sie muss von jedem lesbar sein.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: More detailed bug information is available at the gt68xx backend homepage I<http://www.meier-geinitz.de/sane/gt68xx-backend/>. Please contact us if you find a bug or missing feature: E<lt>sane-devel@alioth-lists.debian.netE<gt>. Please send a debug log if your scanner isn't detected correctly (see SANE_DEBUG_GT68XX above).
de: Weitere, detailliertere Fehlerinformationen sind auf der Homepage des gt68xx-Backends verfügbar: I<http://www.meier-geinitz.de/sane/gt68xx-backend/>. Bitte schreiben Sie uns (auf Englisch) an, falls Sie einen Fehler finden oder eine Funktion vermissen: E<lt>sane-devel@alioth-lists.debian.netE<gt>. Bitte schicken Sie uns ein Debug-Protokoll, falls Ihr Scanner nicht korrekt erkannt wird (siehe SANE_DEBUG_GT68XX weiter oben).

source: Please use libusb-0.1.8 or later. Without libusb or with older libusb versions all kinds of trouble can be expected. The scanner should be found by B<sane-find-scanner>(1) without further actions. For setting permissions and general USB information looks at B<sane-usb>(5).
de: Bitte verwenden Sie libusb-0.1.8 oder neuer. Ohne libusb oder mit älteren libusb-Versionen können Sie mit allem möglichen Ärger rechnen. Der Scanner sollte von B<sane-find-scanner>(1) ohne weiteres Eingreifen gefunden werden. Für das Setzen von Zugriffsrechten und allgemeine USB-Informationen lesen Sie B<sane-usb>(5).

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).
