Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-airscan.5.po
Languages: de

source: May 2021
de: Mai 2021

source: AirScan (eSCL) and WSD SANE backend
de: AirScan- (eSCL-) und WSD-SANE-Backend

source: NAME
de: BEZEICHNUNG

source: B<sane-airscan> - SANE backend for AirScan (eSCL) and WSD scanners and MFP
de: B<sane-airscan> - SANE-Backend für AirScan- (eSCL-) und WSD-Scanner und MFP

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-airscan> is the universal backend for "driverless" document scanning. Currently it supports two protocols:
de: B<sane-airscan> ist das universelle Backend für »treiberloses« Dokumenten-Scannen. Derzeit werden zwei Protokolle unterstützt:

source: 1. eSCL, also known as AirScan or AirPrint scan 2. WSD, also known as WS-Scan
de: 1. eSCL, auch als AirScan oder AirPrint-Scan bekannt 2. WSD, auch als WS-Scan bekannt

source: CONFIGURATION
de: KONFIGURATION

source: The sane-airscan loads its configuration files from the following places:
de: B<sane-airscan> lädt seine Konfigurationsdatei aus den folgenden Orten:

source: The configuration file syntax is very similar to the .INI file syntax. It consist of sections, each section contains some variables. Comments are started from # or ; characters and continies until end of line
de: Die Konfigurationsdateisyntax ist sehr ähnlich der .INI-Dateisyntax. Sie besteht aus Abschnitten, jeder Abschnitt enthält einige Variablen. Kommentare beginnen mit dem Zeichen # oder ; und gehen bis zum Zeilenende.

source: # This is a comment [section 1] variable 1 = value 1 ; and another comment variable 2 = value 2
de: # Dies ist ein Kommentar [section 1] Variable 1 = Wert 1 ; und ein weiterer Kommentare Variable 2 = Wert 2

source: Leading and trailing spaces of variable name and value are striped. If you want to preserve them, put name or value into quotes ("like this").
de: Leerzeichen vor und nach Variablennamen und -werten werden entfernt. Falls Sie sie erhalten möchten, stellen Sie den Namen oder den Wert in englische Anführungszeichen (»so wie hier«).

source: CONFIGURATION OF DEVICES
de: GERÄTEKONFIGURATION

source: If scanner and computer are connected to the same LAN segment, everything expected to "just work" out of box, without any need of manual configuration.
de: Falls der Scanner und der Computer im gleichen LAN-Segment verbunden sind, sollte alles erwartete »einfach funktionieren«, ohne irgendwelche manuelle Konfiguration.

source: However, in some cases manual configuration can be useful. For example:
de: Allerdings kann in manchen Fällen eine manuelle Konfiguration nützlich sein, beispielsweise:

source: 1. If computer and scanner are connected via IP router 2. There are a lot of devices on a corporate network, but only few of them are interesting 3. Automatic discovery works unreliable
de: 1. Falls der Computer und Scanner über einen IP-Router verbunden sind 2. Im Firmennetzwerk gibt es viele Geräte, aber nue ein paar davon sind von interesse 3. Die Automatische Erkennung funktioniert unzuverlässig

source: To manually configure a device, add the following section to the configuration file:
de: Um ein Gerät manuell zu konfigurieren, fügen Sie den folgenden Abschnitt zur Konfigurationsdatei hinzu:

source: [devices] "Kyocera eSCL" = http://192.168.1.102:9095/eSCL, eSCL "Kyocera WSD" = http://192.168.1.102:5358/WSDScanner, WSD "Device I do not want to see" = disable
de: [devices] "Kyocera eSCL" = http://192.168.1.102:9095/eSCL, eSCL "Kyocera WSD" = http://192.168.1.102:5358/WSDScanner, WSD "Geräte, die ich nicht sehen möchte" = disable

source: The B<[devices]> section contains all manually configured devices, one line per device, and each line contains a device name on a left side of equation and device URL on a rights side, followed by protocol (eSCL or WSD). If protocol is omitted, eSCL is assumed. You may also disable particular device by using the B<disable> keyword instead of URL.
de: Der Abschnitt B<[devices]> enthält alle manuell konfigurierten Geräte, eine Zeile pro Gerät und jede Zeile enthält einen Gerätenamen auf der linken Seite der Gleichung und eine Geräte-URL auf der rechten Seite, gefolgt vom Protokoll (eSCL oder WSD). Falls das Protokoll nicht angegeben ist, wird eSCL angenommen. Sie können ein bestimmtes Gerät auch mit dem Schlüsselwort B<disable> an Stelle der URL deaktivieren.

source: In addition, you can manually configure a device by directly passing its URL in a device name without adding it to the configuration file. This takes the format B<protocol:Device Name:URL>. The examples above could be written as B<escl:Kyocera eSCL:http://192.168.1.102:9095/eSCL> and B<wsd:Kyocera WSD:http://192.168.1.102:5358/WSDScanner>.
de: Zusätzlich können Sie ein Gerät manuell konfigurieren, indem Sie seine URL in einem Gerätenamen übergeben, ohne sie zur Konfigurationsdatei hinzuzufügen. Das Format ist hier B<Protokoll:Gerätename:URL>. Die obigen Beispiele können damit als B<escl:Kyocera eSCL:http://192.168.1.102:9095/eSCL> und B<wsd:Kyocera WSD:http://192.168.1.102:5358/WSDScanner> geschrieben werden.

source: To figure out URLs of available devices, the simplest way is to run a supplied B<airscan-discover> tool on a computer connected with scanner to the same LAN segment. On success, this program will dump to its standard output a list of discovered devices in a format suitable for inclusion into the configuration file.
de: Um die URLs der verfügbaren Geräte herauszufinden, ist es am einfachsten, das Werkzeug B<airscan-discover>(1) auf einem Computer auszuführen, der mit dem Scanner auf dem gleichen LAN-Segment verbunden ist. Im Erfolgsfall wird das Programm auf seiner Standardausgabe eine Liste von erkannten Geräten in einem Format rausschreiben, das für die Einbindung in die Konfigurationsdatei geeignet ist.

source: If running B<airscan-discover> on same LAN segment as a scanner is not possible, you will have to follow a hard way. Your administrator must know device IP address, consult your device manual for the eSCL port, and the URL path component most likely is the "/eSCL", though on some devices it may differ. Discovering WSD URLs doing this way is much harder, because it is very difficult to guess TCP port and URL path, that in a case of eSCL.
de: Falls es nicht möglich ist, B<airscan-discover>(1) in dem gleichen LAN-Segment wie der Scanner auszuführen, müssen Sie die aufwändige Methode wählen. Ihr Administrator muss die Geräte-IP-Adressen kennen, lesen Sie das Gerätehandbuch für den eSCL-Port und die URL-Pfadkomponente ist höchstwahrscheinlich »/eSCL« (allerdings kann sie auf einigen Geräten auch anders lauten). Die Ermittlung von WSD-URLs auf diese Weise ist viel aufwändiger, da es sehr schwer ist, den TCP-Port und den URL-Pfad zu raten (für den Fall eSCL).

source: For eSCL devices, the URL can also use the unix:// scheme, such as unix://scanner.sock/eSCL. The "host" from the URL is a file name that will be searched for in the directory specified by socket_dir (see below). When connecting to the scanner, all traffic will be sent to the specified UNIX socket instead of a TCP connection.
de: Für eSCL-Geräte kann die URL auch dem Schema unix:// folgen, wie bei unix://Scanner.Socket/eSCL. Der Rechneranteil aus der URL ist ein Dateiname, nach dem in dem durch socket_dir festgelegten Verzeichnis gesucht wird (siehe unten). Bei der Verbindung mit dem Scanner wird sämtlicher Datenverkehr zu dem angegebenen UNIX-Socket statt zu einer TCP-Verbindung gesandt.

source: CONFIGURATION OPTIONS
de: KONFIGURATIONSOPTIONEN

source: Miscellaneous options all goes to the B<[options]> section. Currently the following options are supported:
de: In den Abschnitt B<[options]> gehen verschiedene Optionen. Derzeit werden die folgenden Optionen unterstützt:

source: [options] ; If there are a lot of scanners around and you are only ; interested in few of them, disable auto discovery and ; configure scanners manually discovery = enable | disable
de: [options] ; Falls es viele Scanner gibt und Sie nur an einigen davon interessiert ; sind, schalten Sie die automatische Erkennung aus und konfigurieren Sie ; die Scanner manuell discovery = enable | disable

source: ; Choose what SANE apps will show in a list of devices: ; scanner network name (the default) or hardware model name model = network | hardware
de: ; Wählen Sie aus, welche SANE-Apps in einer Geräteliste auftauchen: ; Scanner-Netezwerkname (die Vorgabe) oder den Hardware-Modellnamen model = network | hardware

source: ; If device supports both eSCL and WSD protocol, sane-airscan ; may either choose the "best" protocol automatically, or ; expose all variants for user, allowing manual protocol selection. ; The default is "auto" protocol = auto | manual
de: ; Falls Geräte sowohl eSCL- als auch das WSD-Protokoll unterstützen, kann ; Sane-airscan entweder das »beste« Protokoll automatisch auswählen oder ; dem Benutzer alle Varianten offenlegen und ihm eine manuelle ; Protokollauswahl ermöglichen. ; Die Vorgabe ist »auto« protocol = auto | manual

source: ; Discovery of WSD devices may be "fast" or "full". The "fast" ; mode works as fast as DNS-SD discovery, but in some cases ; may be unreliable. The "full" mode is slow and reliable. ; This is also possible to disable automatic discovery ; of WSD devices. The default is "fast". ws-discovery = fast | full | off
de: ; Die Ermittlung von WSD-Geräten kann »fast« (schnell) oder »full« ; (vollständig) erfolgen. Der Modus »fast« arbeitet so schnell wie die ; DNS-SD-Ermittlung, kann aber in einigen Fällen unzuverlässig sein. Der ; Modus »full« ist langsam und zuverlässig. Es ist auch möglich, die ; automatische Ermittlung von WSD-Geräten zu deaktivieren. ; Die Vorgabe ist »fast«. ws-discovery = fast | full | off

source: ; Scanners that use the unix:// schema in their URL can only specify a ; socket name (not a full path). The name will be searched for in the ; directory specified here. The default is /var/run. socket_dir = /path/to/directory
de: ; Scanner, die das Schema unix:// in ihrer URL verwenden, können nur einen ; Socket-Namen (keinen vollständigen Pfad) festlegen. In dem hier ; festgelegten Verzeichnis wird nach dem Namen gesucht. ; Die Vorgabe ist /var/run. socket_dir = /path/to/directory

source: BLACKLISTING DEVICES
de: GERÄTE-AUSSCHLUSSLISTE

source: This feature can be useful, if you are on a very big network and have a lot of devices around you, while interesting only in a few of them.
de: Diese Funktionalität kann nützlich sein, wenn Sie an einem sehr großen Netzwerk hängen und es um Sie herum viele Geräte gibt, von denen Sie aber nur wenige interessieren.

source: [blacklist] model = "Xerox*" ; blacklist by model name name = "HP*" ; blacklist by network name ip = 192.168.0.1 ; blacklist by address ip = 192.168.0.0/24 ; blacklist the whole subnet
de: [blacklist] model = "Xerox*" ; Ausschluss über Modellname name = "HP*" ; Ausschluss über Netzwerkname ip = 192.168.0.1 ; Ausschluss über Adresse ip = 192.168.0.0/24 ; Ausschluss des gesamten Subnetzes

source: Network names come from DNS-SD, WS-Discovery doesn\'t provide this information. For filtering by network name to work, Avahi must be enabled and device must be discoverable via DNS-SD (not necessarily as a scanner, it\'s enough if WSD scanner is discoverable as a printer via DNS-SD).
de: Netzwerknamen kommen von DNS-SD, WS-Discovery stellt diese Information nicht zur Verfügung. Damit das Filtern nach Netzwerknamen funktioniert, muss Avahi aktiviert sein und die Geräte müssen mittels DNS-SD erkennbar sein (nicht notwendigerweise als Scanner, es reicht, wenn WSD-Scanner als Drucker über DNS-SD erkannt werden können).

source: Blacklisting only affects automatic discovery, and doesn\'t affect manually configured devices
de: Ausschlusslisten betreffen nur die automatische Erkennung und betreffen nicht die manuell konfigurierten Geräte.

source: sane-airscan provides very good instrumentation for troubleshooting without physical access to the problemmatic device.
de: Sane-airscan stellt eine sehr gute Instrumentierung für die Fehlersuche ohne physischen Zugriff auf das problematische Gerät bereit.

source: Debugging facilities can be controlled using the B<[debug]> section of the configuration file:
de: Die Debugging-Einrichtungen können über den Abschnitt B<[debug]> der Konfigurationsdatei gesteuert werden.

source: [debug] ; Enable or disable console logging enable = false | true
de: [debug] ; Protokollieren auf der Konsole aktivieren oder deaktivieren enable = false | true

source: ; Enable protocol trace and configure output directory ; for trace files. Like in shell, to specify path relative to ; the home directory, start it with tilda character, followed ; by slash, i.e., "~/airscan/trace". The directory will ; be created automatically. trace = path
de: : Protokoll-Nachverfolgung aktivieren und Ausgabeverzeichnis für ; Nachverfolgungsdateien konfigurieren. Um einen Pfad relativ zum Home- ; Verzeichnis festzulegen, starten Sie ihn wie in der Shell mit einer ; Tilde, gefolgt von einem Schrägstrich, d.h. »~/airscan/trace«. Das ; Verzeichnis wird automatisch erstellt. trace = Pfad

source: ; Hex dump all traffic to the trace file (very verbose!) hexdump = false | true
de: ; Sämtlichen Verkehr zur Nachverfolgungsdatei hexadezimal rausschreiben ; (sehr ausführlich!) hexdump = false | true

source: FILES
de: DATEIEN

source: The backend configuration files
de: Die Konfigurationsdatei des Backends.

source: The shared library implementing this backend
de: Die dynamische Bibliothek, die dieses Backend implementiert.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This variable if set to B<true> or non-zero numerical value, enables debug messages, that are printed to stdout
de: Falls diese Variable auf B<true> oder einen von Null verschiedenen numerischen Wert gesetzt wird, dann werden Debug-Meldungen aktiviert, die auf die Standardausgabe geschrieben werden.

source: This variable alters the search path for configuration files. This is a colon-separated list of directories. These directories are searched for the airscan.conf configuration file and for the airscan.d subdirectory, before the standard path (/etc/sane.d) is searched.
de: Diese Variable ändert den Suchpfad für Konfigurationsdateien. Dies ist eine Doppelpunkt-getrennte Liste von Verzeichnissen. In diesen Verzeichnissen wird nach der Konfigurationsdatei I<airscan.conf> und dem Unterverzeichnis I<airscan.d> gesucht, bevor der Standardpfad (I</etc/sane.d>) durchsucht wird.

source: BUGS AND SUPPORT
de: FEHLER UND UNTERSTÜTZUNG

source: If you have found a bug, please file a GitHub issue on a GitHub project page: B<https://github.com/alexpevzner/sane-airscan>
de: Falls Sie einen Fehler gefunden haben, reichen Sie auf der GitHub-Projektseite bitte eine Meldung (»issue«) auf Englisch ein: B<https://github.com/alexpevzner/sane-airscan>.

source: SEE ALSO
de: SIEHE AUCH

source: sane(7), scanimage(1), xsane(1), airscan-discover(1)
de: B<sane>(7), B<scanimage>(1), B<xsane>(1), B<airscan-discover>(1)

source: AUTHOR
de: AUTOR

source: Debuggung facilities can be controlled using the B<[debug]> section of the configuration file:
de: Die Debugging-Einrichtungen können über den Abschnitt B<[debug]> der Konfigurationsdatei gesteuert werden.
