Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-lexmark.5.po
Languages: de

source: 12 Jul 2008
de: 12. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-lexmark - SANE backend for Lexmark X1100/X1200 Series scanners
de: sane-lexmark - SANE-Backend für die Scanner der X1100/X1200-Baureihe von Lexmark

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-lexmark> library implements a SANE (Scanner Access Now Easy) backend that provides access to the scanner part of Lexmark X1100/X1200 AIOs. This backend should be considered B<beta-quality> software!
de: Die Bibliothek B<sane-lexmark> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf den Scannerteil von Lexmark X1100/X1200-Multifunktionsgeräten. Dieses Backend sollte als B<Beta-Qualität>-Software betrachtet werden!

source: The scanners that should work with this backend are:
de: Die folgenden Scanner sollten mit diesem Backend funktionieren:

source: \f(CR Vendor Model status ---------------------- ----------- Lexmark X74 good Lexmark X1110 untested Lexmark X1140 untested Lexmark X1150 good Lexmark X1170 good Lexmark X1180 good Lexmark X1185 complete Lexmark X12xx good in USB1.1, not fully tested in USB2.0 Dell A920 good\fR
de: \f(CR Marke Modell Status ---------------------- ----------- Lexmark X74 gut Lexmark X1110 nicht getestet Lexmark X1140 nicht getestet Lexmark X1150 gut Lexmark X1170 gut Lexmark X1180 gut Lexmark X1185 vollständig Lexmark X12xx gut in USB1.1, nicht vollständig getestet in USB2.0 Dell A920 gut\fR

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xscanimage>(1) or B<xsane>(1).
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: If you notice any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie seltsames Verhalten bemerken, melden Sie dies an den Betreuer des Backends oder an die Mailingliste der SANE-Entwickler.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: B<Scan Mode Options>
de: B<Scanmodus-Optionen>

source: selects the basic mode of operation of the scanner. Valid choices are I<Color>, I<Gray> and I<Lineart>. The default mode is I<Color>. The I<Lineart> mode is black and white only (1 bit). I<Gray> mode will produce 256 levels of gray (8 bits). I<Color> mode allows for over 16 million different colors produced from 24 bits of color information.
de: wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind I<Color>, I<Gray> und I<Lineart>. Der Standardmodus ist I<Color>. Der Modus I<Lineart> ist nur schwarz und weiß (1 bit). Der Modus I<Gray> wird 256 Graustufen erzeugen (8 bit). Der Modus I<Color> erlaubt mehr als 16 Millionen verschiedene Farben in 24 bit Farbtiefe.

source: selects the resolution for a scan. The horizontal and vertical resolutions are set by the value of this option. The scanner is capable of the following resolutions for the specified option value:
de: wählt die Scan-Auflösung. Die horizontalen und vertikalen Auflösungen werden durch Werte dieser Option gesetzt. Der Scanner ist in der Lage, folgende Auflösungen für den angegebenen Optionswert zu realisieren:

source: \f(CR Value Hor. Resolution Vert. Resolution ----- --------------- ------------------- 75 75dpi 75dpi 150 150dpi 150dpi 300 300dpi 300dpi 600 600dpi 600dpi 1200 600dpi 1200dpi (only for X11xx models with 'B2' sensor)\fR
de: \f(CR Wert Hor. Auflösung Vert. Auflösung ----- --------------- ------------------- 75 75dpi 75dpi 150 150dpi 150dpi 300 300dpi 300dpi 600 600dpi 600dpi 1200 600dpi 1200dpi (nur für X11xx-Modelle mit »B2«-Sensor)\fR

source: requests a preview scan. The resolution used for that scan is 75 dpi and the scan area and the scan mode are as specified through their options, or the default if not specified. The default value for preview mode is "no".
de: fordert einen Vorschau-Scan an. Die für diesen Scan verwendete Auflösung ist 75 DPI und der Scan-Bereich und der Scan-Modus werden über ihre jeweiligen Optionen ausgewählt oder sind die Vorgabe, falls nicht angegeben. Der Vorgabewert für den Vorschaumodus ist »no«.

source: selects the minimum-brightness to get a white point. The threshold is only used with Lineart mode scans. It is specified as a percentage in the range 0..100% (in steps of 1). The default value of the threshold option is 50.
de: wählt die minimale Helligkeit, um einen Weißpunkt zu erhalten. Die Schwelle wird nur bei Scans im Modus I<Lineart> verwandt. Sie wird als Prozentanteil im Bereich 0…100% (in Schritten von 1) angegeben. Der Vorgabewert der Option »threshold« ist 50.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/lexmark.conf> contains only the usb device id (eg usb 0x043d 0x007c).
de: Die Konfigurationsdatei I</etc/sane.d/lexmark.conf> enthält nur die USB-Gerätekennung (z.B. usb 0x043d 0x007c).

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 255 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 255 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: Provides debug output for low level Lexmark functions.
de: stellt Debug-Ausgabe für systemnahe Lexmark-Funktionen bereit.

source: LIMITATIONS
de: EINSCHRÄNKUNGEN

source: The windows TWAIN driver has many more options than this SANE backend. However they are only software adjustments. This backend only implements what the scanner can support. For instance, shading correction (vertical stripes due to sensor variation across its width) is done in software. Head park position is also detected by software. The data compression isn't supported for the X1200 series on USB 1.1, leading to slow scans.
de: Der TWAIN-Treiber für Windows verfügt über weitaus mehr Optionen als dieses SANE-Backend. Dieses Backend implementiert nur das, was der Scanner unterstützen kann. Beispielsweise erfolgt die Schattenkorrektur (vertikale Streifen aufgrund von Sensorvariationen über seine Breite) in Software. Kopfparkposition wird auch in Software erkannt. Die Datenkompression wird von der X1200-Serie auf USB 1.1 nicht unterstützt, was zu langsamen Scans führt.

source: BUGS
de: FEHLER

source: No bugs currently known.
de: Gegenwärtig sind keine Fehler bekannt.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: The backend was originally written by Fred Odendaal.
de: Das Backend wurde ursprünglich von Fred Odendaal geschrieben.

source: The new version is currently developed by St\['e]phane Voltz.
de: Die neue Version wird derzeit von St\['e]phane Voltz entwickelt.

source: X74 support was written by Torsten Houwaart
de: X74-Unterstützung wurde von Torsten Houwaart geschrieben.

source: CREDITS
de: DANKSAGUNGEN

source: Many thanks go to:
de: Vielen Dank an:

source: Julien Furgerot who lent me a Dell A920. Robert Price, Dani Ele and Dalai Felinto for the time they spent recording USB activity and testing the experimental version.
de: Julien Furgerot, der mir einen Dell A920 lieh. Robert Price, Dani Ele und Dalai Felinto für die Zeit, die sie mit der Aufzeichnung von USB-Aktivitäten und dem Testen der experimentellen Version verbrachten.

source: \f(CR Vendor Model status ---------------------- ----------- Lexmark X74 good Lexmark X1110 untested Lexmark X1140 untested Lexmark X1150 good Lexmark X1170 good Lexmark X1180 good Lexmark X1185 complete Lexmark X12xx good in USB1.1, not fully tested in USB2.0 Dell A920 good\fR
de: \f(CR Marke Modell Status ---------------------- ----------- Lexmark X74 gut Lexmark X1110 nicht getestet Lexmark X1140 nicht getestet Lexmark X1150 gut Lexmark X1170 gut Lexmark X1180 gut Lexmark X1185 vollständig Lexmark X12xx gut in USB1.1, nicht vollständig getestet in USB2.0 Dell A920 gut\fR

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in xscanimage or xsane.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: If you have any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie merkwürdiges Verhalten beobachten, berichten Sie das bitte (auf Englisch) an den Backend-Betreuer oder an die SANE-Mailingliste.

source: selects the basic mode of operation of the scanner valid choices are I<Color>, I<Gray> and I<Lineart> The default mode is Color. The Lineart mode is black and white only (1 bit). Grayscale will produce 256 levels of gray (8 bits). Color mode allows for over 16 million different colors produced from 24 bits of color information.
de: wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind I<Color>, I<Gray> und I<Lineart>. Der Standardmodus ist I<Color>. Der Modus I<Lineart> ist nur schwarz und weiß (1 bit). I<Grayscale> wird 256 Graustufen erzeugen (8 bit). Der Modus I<Color> erlaubt mehr als 16 Millionen verschiedene Farben in 24 bit Farbtiefe.

source: The configuration file /etc/sane.d/lexmark.conf contains only the usb device id (eg usb 0x043d 0x007c).
de: Die Konfigurationsdatei I</etc/sane.d/lexmark.conf> enthält nur die USB-Gerätekennung (z.B. usb 0x043d 0x007c).

source: B<SANE_DEBUG_LEXMARK_LOW> If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 255 requests all debug output to be printed. Smaller levels reduce verbosity.
de: B<SANE_DEBUG_LEXMARK_LOW> Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 255 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: sane-scsi(5), scanimage(1), xscanimage(1), xsane(1), sane(7)
de: B<sane-scsi>(5), B<scanimage>(1), B<xscanimage>(1), B<xsane>(1), B<sane>(7)

source: X74 support was written by Torsten Houwaart (E<lt>ToHo@gmx.deE<gt>)
de: X74-Unterstützung wurde von Torsten Houwaart (E<lt>ToHo@gmx.deE<gt>) geschrieben.

source: Julien Furgerot who lend me a Dell A920. Robert Price, Dani Ele and Dalai Felinto for the time they spent recording USB activity and testing the experimental version.
de: Julien Furgerot, der mir einen Dell A920 lieh. Robert Price, Dani Ele und Dalai Felinto für die Zeit, die sie mit der Aufzeichnung von USB-Aktivitäten und dem Testen der experimentellen Version verbrachten.
