Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-hp.5.po
Languages: de

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: For use of the ADF with xscanimage(1), first place paper in the ADF and then change option scan source to 'ADF'. Press 'change document' to load a sheet. Then press 'scan' to start a scan. Maybe it is sufficient to press 'scan' without 'change document' for repeated scans. The use of the preview window is not recommended when working with the ADF. Setting a window to scan from ADF is not supported with xscanimage(1). Try xsane(1).
de: Um den ADF mit B<xscanimage>(1) zu verwenden, legen Sie zuerst Papier in den ADF und ändern dann die Scan-Quelle-Option auf »ADF«. Klicken Sie »change document«, um ein Blatt zu laden. Klicken Sie dann »scan«, um den Scan zu starten. Vielleicht reicht es auch, »Scan« ohne »change document« für Serien-Scans zu drücken. Bei der Verwendung von ADF wird die Einsatz des Vorschaufensters nicht empfohlen. Das Setzen eines Scan-Fensters beim Einsatz von ADF wird von B<xscanimage>(1) nicht unterstützt. Versuchen Sie B<xsane>(1).

source: Some actions in xscanimage(1) (i.e. unload, select media, calibrate) have an immediate effect on the scanner without starting a scan. These options can not be used with scanimage.
de: Einige Aktionen in B<xscanimage>(1) (d.h. entladen, Medien auswählen, kalibrieren) haben eine sofortige Auswirkung auf den Scanner, ohne einen Scan zu starten. Diese Optionen können mit B<scanimage>(1) nicht verwendet werden.

source: sane(7), sane-scsi(5), sane-usb(5)
de: B<sane>(7), B<sane-scs>i(5), B<sane-usb>(5)

source: The sane-hp backend was written by Geoffrey T. Dairiki. HP PhotoSmart PhotoScanner support by Peter Kirchgessner.
de: Das Backend »sane-hp« wurde von Geoffrey T. Dairiki geschrieben. HP PhotoSmart PhotoScanner-Unterstützung von Peter Kirchgessner.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (I<.>) and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (I<.>) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf I</tmp/config:> setzen, wird in den Verzeichnissen I<tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).
