Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-canon.5.po
Languages: de

source: 11 Jul 2008
de: 11. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-canon - SANE backend for Canon SCSI scanners
de: sane-canon - SANE-Backend für SCSI-Scanner von Canon

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-canon> library implements a SANE (Scanner Access Now Easy) backend that provides access to the following Canon flatbed and film scanners:
de: Die Bibliothek B<sane-canon> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die folgenden Flachbett- und Filmscanner von Canon:

source: Parallel port and USB scanners are not supported by this backend; see the manual pages for B<sane-canon_pp>(5) and B<sane-canon630u>(5) for further information.
de: Parallelport- und USB-Scanner werden von diesem Backend nicht unterstützt; in den Handbuchseiten B<sane-canon_pp>(5) und B<sane-canon630u>(5) finden Sie weitere Informationen.

source: IMPORTANT: This is beta code. We tested the code on the scanners listed above, using the computers and operating systems available to us, but we cannot guarantee that the backend will work smoothly with future operating systems, SCSI adapters, SANE frontend programs, or Canon scanners not contained in the list above. In some cases your computer might even hang. It cannot be excluded (although we consider it extremely unlikely) that your scanner will be damaged.
de: WICHTIG: Dies ist Beta-Code. Wir haben den Code mit den vorstehend aufgeführten Scannern mit den uns zur Verfügung stehenden Rechnern und Betriebssystemen getestet. Aber wir können nicht garantieren, dass das Backend richtig mit zukünftigen Betriebssystemen, SCSI-Adaptern, SANE-Frontends oder Scannern funktioniert, die in der Liste nicht enthalten sind. In einigen Fällen kann Ihr Rechner sogar hängenbleiben. Obwohl wir es für extrem unwahrscheinlich halten, kann nicht ausgeschlossen werden, dass Ihr Scanner beschädigt wird.

source: That said, TESTERS ARE WELCOME. Send your bug reports and comments to Manuel Panea I<E<lt>mpd@rzg.mpg.deE<gt>>; for questions concerning the FB620 and FB1200S contact Mitsuru Okaniwa I<E<lt>m-okaniwa@bea.hi-ho.ne.jpE<gt>>, for the FS2710S Ulrich Deiters I<E<lt>ukd@xenon.pc.uni-koeln.deE<gt>>.
de: Mit anderen Worten: TESTER SIND WILLKOMMEN. Senden Sie Fehlermeldungen und Kommentare (auf Englisch) an Manuel Panea I<E<lt>mpd@rzg.mpg.deE<gt>>; für Fragen zum FB620 und FB1200S kontaktieren Sie Mitsuru Okaniwa I<E<lt>m-okaniwa@bea.hi-ho.ne.jpE<gt>>, für den FS2710S Ulrich Deiters I<E<lt>ukd@xenon.pc.uni-koeln.deE<gt>>.

source: TIPS (FS2700F)
de: TIPPS (FS2700F)

source: Scanning either slides or negatives has been found to require rather large gamma corrections of about 2.2 to 2.4 (same value for red, green, and blue). It is recommended to use the automatic exposure controls of the frontend B<xsane>(1) for best results.
de: Beim Scannen von Dias oder Negativen hat sich ergeben, dass recht große Gamma-Korrekturen auf etwa 2.2 bis 2.4 erforderlich sind (gleicher Wert für Rot, Grün und Blau). Für beste Ergebnisse wird empfohlen, die automatische Belichtungssteuerung des Frontends B<xsane>(1) zu verwenden.

source: The "Auto Focus" function triggers a special pass to determine the focus value. After that, the real scanning pass takes place.
de: Die Funktion »Automatischer Fokus« löst einen speziellen Durchlauf aus, um den Fokuswert zu ermitteln. Danach wird der echte Scandurchlauf ausgeführt.

source: Even with "Auto Focus" turned on, the scanned image is often a bit too blurred. Using the B<gimp>(1) to do a "Filter-E<gt>Enhance-E<gt>Sharpen" at about 40 to 60 improves the image considerably.
de: Selbst bei eingeschalteter automatischer Fokussierung ist das Bild oft etwas zu unscharf. Mit B<gimp>(1) können Sie mit »Filter-E<gt>Verbessern-E<gt>Schärfen« bei einer Einstellung zwischen 40 und 60 die Bildqualität deutlich verbessern.

source: TIPS (FS2710S)
de: TIPPS (FS2710S)

source: Gamma corrections are done not by the scanner, but by the backend. The scanner is always run in 12-bit mode. In "color" mode the image data are corrected for gamma, shadow point, etc., and then truncated to 8-bit intensities; the default gamma value is 2.0. In "raw" mode the image data are exported without corrections as 16-bit intensities; this mode can be recommended if extensive adjustments have to be made to a picture (and if the frontend can handle 16-bit intensities).
de: Gamma-Korrekturen werden nicht vom Scanner, sondern vom Backend vorgenommen. Der Scanner läuft immer im 12-Bit-Modus. Im »color«-Modus werden die Bilddaten hinsichtlich Gamma, Schattenpunkt usw. korrigiert und dann auf 8 Bit Farbtiefe gekürzt; der vorgegebene Gamma-Wert ist 2.0. Im »raw«-Modus werden die Bilddaten ohne Korrektur in 16 Bit Farbtiefe exportiert; dieser Modus ist zu empfehlen, falls umfangreiche Anpassungen am Bild vorgenommen werden sollen (und falls das Frontend mit 16 bit Farbtiefe umgehen kann).

source: Negatives are handled by simple color inversion and will require manual removal of blue discoloration.
de: Negative durchlaufen eine einfache Farbumkehrung und erfordern die manuelle Korrektur des Blaustichs.

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Größere Werte erhöhen die Ausführlichkeit der Ausgabe.

source: Example: export SANE_DEBUG_CANON=4
de: Beispiel: export SANE_DEBUG_CANON=4

source: SEE ALSO
de: SIEHE AUCH

source: I<http://www.rzg.mpg.de/~mpd/sane/doc/canon.install2700F.txt> (installation of a CanoScan 2700F)
de: I<http://www.rzg.mpg.de/~mpd/sane/doc/canon.install2700F.txt> (Installation eines CanoScan 2700F)

source: AUTHOR
de: AUTOR

source: Helmut Koeberle, Manuel Panea, and Markus Mertinat;
de: Helmut Koeberle, Manuel Panea und Markus Mertinat;

source: FB620S and FB1200S support by Mitsuru Okaniwa;
de: Unterstützung für FB620S and FB1200S von Mitsuru Okaniwa;

source: FS2710S support by Ulrich Deiters
de: Unterstützung für FS2710S von Ulrich Deiters

source: Man page by Henning Meier-Geinitz (mostly based on canon.README)
de: Handbuchseite von Henning Meier-Geinitz (größtenteils auf canon.README basierend)

source: Parallel port and USB scanners are not supported by this backend; see the manual pages for sane-canon_pp and sane-canon630u for further information.
de: Parallelport- und USB-Scanner werden von diesem Backend nicht unterstützt; in den Handbuchseiten B<sane-canon_pp>(5) und B<sane-canon630u>(5) finden Sie weitere Informationen.

source: That said, TESTERS ARE WELCOME. Send your bug reports and comments to Manuel Panea E<lt>mpd@rzg.mpg.deE<gt>; for questions concerning the FB620 and FB1200S contact Mitsuru Okaniwa E<lt>m-okaniwa@bea.hi-ho.ne.jpE<gt>, for the FS2710S Ulrich Deiters E<lt>ukd@xenon.pc.uni-koeln.deE<gt>.
de: Mit anderen Worten: TESTER SIND WILLKOMMEN. Senden Sie Fehlermeldungen und Kommentare (auf Englisch) an Manuel Panea E<lt>mpd@rzg.mpg.deE<gt>; für Fragen zum FB620 und FB1200S kontaktieren Sie Mitsuru Okaniwa E<lt>m-okaniwa@bea.hi-ho.ne.jpE<gt>, für den FS2710S Ulrich Deiters E<lt>ukd@xenon.pc.uni-koeln.deE<gt>.

source: Scanning either slides or negatives has been found to require rather large gamma corrections of about 2.2 to 2.4 (same value for red, green, and blue). It is recommended to use the automatic exposure controls of the frontend xsane for best results.
de: Beim Scannen von Dias oder Negativen hat sich ergeben, dass recht große Gamma-Korrekturen auf etwa 2.2 bis 2.4 erforderlich sind (gleicher Wert für Rot, Grün und Blau). Für beste Ergebnisse wird empfohlen, die automatische Belichtungssteuerung des Frontends Xsane zu verwenden.

source: Even with "Auto Focus" turned on, the scanned image is often a bit too blurred. Using the GIMP to do a "Filter-E<gt>Enhance-E<gt>Sharpen" at about 40 to 60 improves the image considerably.
de: Selbst bei eingeschalteter automatischer Fokussierung ist das Bild oft etwas zu unscharf. Mit GIMP können Sie mit »Filter-E<gt>Verbessern-E<gt>Schärfen« bei einer Einstellung zwischen 40 und 60 die Bildqualität deutlich verbessern.

source: Negatives are handled by simple color inversion and may require manual removal of blue discoloration.
de: Negative durchlaufen eine einfache Farbumkehrung und erfordern die manuelle Korrektur des Blaustichs.

source: doc/canon.install2700F.txt (installation of a CanoScan 2700F
de: doc/canon.install2700F.txt (Installation eines CanoScan 2700F)

source: Helmut Koeberle, Manuel Panea, and Markus Mertinat; FB620S and FB1200S support by Mitsuru Okaniwa; FS2710S support by Ulrich Deiters
de: Helmut Koeberle, Manuel Panea und Markus Mertinat; Unterstützung für FB620S und FB1200S von Mitsuru Okaniwa; Unterstützung für FS2710S von Ulrich Deiters
