Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-hp.5.po
Languages: de

source: 13 Jul 2008
de: 13. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-hp - SANE backend for HP ScanJet scanners
de: sane-hp - SANE-Backend für Scanner der ScanJet-Reihe von HP

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-hp> library implements a SANE (Scanner Access Now Easy) backend that provides access to HP ScanJet scanners which support SCL (Scanner Control Language by HP). The following scanners are known positively to work with this backend:
de: Die Bibliothek B<sane-hp> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf HP-ScanJet-Scanner, die SCL (die »Scanner Control Language« von HP) unterstützen. Gegenwärtig unterstützt dieses Backend die folgenden Scanner bekanntermaßen:

source: \f(CRModel: Product id: Interface: ---------- ----------- ---------- ScanJet Plus C9195A HP Parallel Interface Card ScanJet IIc C1750A 3226 SCSI ScanJet IIcx C2500A 3332 SCSI ScanJet IIp C1790A SCSI ScanJet 3C C2520A 3503 SCSI ScanJet 3P C2570A 3406 SCSI ScanJet 4C C2520A SCSI ScanJet 4P C1130A 3540 SCSI ScanJet 4100C C6290A USB ScanJet 5P C5110A SCSI ScanJet 5100C C5190A parallel port ScanJet 5200C C7190A 3846 parallel port/USB ScanJet 6100C C2520A 3644 SCSI ScanJet 6200C C6270A 3828 SCSI/USB ScanJet 6250C C6270A 3828 SCSI/USB ScanJet 6300C C7670A SCSI/USB ScanJet 6350C C7670A SCSI/USB ScanJet 6390C C7670A SCSI/USB PhotoSmart C5100A R029,R030,R032 SCSI\fR
de: \f(CRModell: Produktkennung: Schnittstelle: ---------- ----------- ---------- ScanJet Plus C9195A HP Parallele Schnittstellenkarte ScanJet IIc C1750A 3226 SCSI ScanJet IIcx C2500A 3332 SCSI ScanJet IIp C1790A SCSI ScanJet 3C C2520A 3503 SCSI ScanJet 3P C2570A 3406 SCSI ScanJet 4C C2520A SCSI ScanJet 4P C1130A 3540 SCSI ScanJet 4100C C6290A USB ScanJet 5P C5110A SCSI ScanJet 5100C C5190A paralleler Port ScanJet 5200C C7190A 3846 paralleler Port/USB ScanJet 6100C C2520A 3644 SCSI ScanJet 6200C C6270A 3828 SCSI/USB ScanJet 6250C C6270A 3828 SCSI/USB ScanJet 6300C C7670A SCSI/USB ScanJet 6350C C7670A SCSI/USB ScanJet 6390C C7670A SCSI/USB PhotoSmart C5100A R029,R030,R032 SCSI\fR

source: Support for models 5100C/5200C connected to the parallel port requires the ppSCSI driver available at I<http://cyberelk.net/tim/parport/ppscsi.html> and I<http://penguin-breeder.org/kernel/download/>.
de: Die Unterstützung für die am Parallel-Port angeschlossenen Modelle 5100C/5200C benötigt den unter I<http://cyberelk.net/tim/parport/ppscsi.html> und I<http://penguin-breeder.org/kernel/download/> verfügbaren ppSCSI-Treiber.

source: Support for models 5200C/62X0C/63X0C connected to the USB require the kernel scanner driver or libusb. See B<sane-usb>(5) for more details.
de: Unterstützung für die mittels USB angeschlossenen Modelle 5200C/62X0C/63X0C benötigen den Scanner-Treiber des Kernels oder Libusb. Siehe B<sane-usb>(5) für weitere Details.

source: The B<sane-hp> backend no longer supports OfficeJet multi-function peripherals. For these devices use the external "hpoj" backend in version 0.90 and later of the "HP OfficeJet Linux driver", available at
de: Das Backend B<sane-hp> unterstützt keine OfficeJet-Multifunktionsgeräte mehr. Benutzen Sie das externe Backend »hpoj« in Version 0.90 oder neuer für diese Geräte. Es ist unter folgender Adresse verfügbar:

source: Because Hewlett-Packard does no longer produce scanners that support SCL (beside the OfficeJets), the above list of supported scanners is complete. Other HP scanners are not supported by the B<sane-hp> backend, but might be supported by another one. See I<http://www.sane-project.org/>. You can also watch the sane-devel mailing list at I<http://www.sane-project.org/mailing-lists.html>.
de: Da Hewlett-Packard keine Scanner mehr herstellt, die SCL unterstützen (außer den OfficeJets), ist die obige Liste der unterstützten Scanner vollständig. Andere HP-Scanner werden von dem Backend B<sane-hp> nicht unterstützt, könnten dies aber von einem anderen Backend sein. Siehe I<http://www.sane-project.org/>. Sie können auch die SANE-Mailingliste unter I<http://www.sane-project.org/mailing-lists.html> beobachten.

source: More details about the hp backend can be found on its homepage I<http://www.kirchgessner.net/sane.html>.
de: Weitere Details über das hp-Backend können auf seiner Homepage I<http://www.kirchgessner.net/sane.html> gefunden werden.

source: DEVICE NAMES
de: GERÄTENAMEN

source: This backend expects device names of the form:
de: Dieses Backend erwartet Gerätenamen der folgenden Form:

source: I<special>
de: I<Spezialdatei>

source: Where I<special> is the UNIX path-name for the special device that corresponds to the scanner. For SCSI scanners the special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sg2>, for example. If the special device name contains "usb", "uscanner" or "ugen", it is assumed that the scanner is connected by USB. For the HP ScanJet Plus the special device name must be the device that corresponds to the parallel interface card that was shipped with the scanner. That is I</dev/hpscan>. A special driver is required for this card. See I<ftp://rvs.ctrl-c.liu.se/pub/wingel/hpscan> for details. If the link does not work, try I<ftp://sunsite.unc.edu/pub/Linux/kernel/patches/scanners>.
de: Hierbei ist I<Spezialdatei> der UNIX-Pfadname für das Spezialgerät, das dem Scanner entspricht. Für SCSI-Scanner muss der Spezialgerätname ein generisches SCSI-Gerät oder ein Symlink auf ein solches Gerät sein. Unter Linux könnten solche Gerätenamen beispielsweise I</dev/sga> oder I</dev/sg2> sein. Falls der Spezialgerätename »usb«, »uscanner« oder »ugen« enthält, wird angenommen, dass der Scanner mittels USB verbunden ist. Für den HP ScanJet Plus mus der Spezialgerätename das Gerät sein, das der parallelen Schnittstellenkarte entspricht, die mit dem Scanner ausgeliefert wurde. Das ist I</dev/hpscan>. Für diese Karte wird ein Spezialtreiber benötigt. Siehe I<ftp://rvs.ctrl-c.liu.se/pub/wingel/hpscan> für Details. Falls dieser Link nicht funktioniert, versuchen Sie I<ftp://sunsite.unc.edu/pub/Linux/kernel/patches/scanners>.

source: CONFIGURATION
de: KONFIGURATION

source: The contents of the I<hp.conf> file is a list of options and device names that correspond to HP ScanJet scanners. Empty lines and lines starting with a hash mark (#) are ignored. See B<sane-scsi>(5) and B<sane-usb>(5) on details of what constitutes a valid device name.
de: Der Inhalt der Datei I<hp.conf> ist eine Liste von Optionen und Gerätenamen, die HP-ScanJet-Scannern entsprechen. Leere Zeilen und Zeilen, die mit einer Raute (#) beginnen, werden ignoriert. Siehe B<sane-scsi>(5) und B<sane-usb>(5) für Details dazu, woraus ein gültiger Gerätename besteht.

source: Options specified in front of the first line that contains a device name are defaults for all devices. Options specified below a line that contains a device name apply just to the most recently mentioned device.
de: Optionen, die vor der ersten Zeile mit Gerätenamen angegeben werden, sind Vorgaben für alle Geräte. Optionen, die nach einer Zeile mit Gerätenamen angegeben werden, gelten nur für das zuletzt erwähnte Gerät.

source: Supported options are B<connect-scsi>, B<connect-device>, B<enable-image-buffering>, and B<dumb-read>.
de: Unterstützte Optionen sind B<connect-scsi>, B<connect-device>, B<enable-image-buffering> und B<dumb-read>.

source: Option B<connect-scsi> specifies that the scanner is connected to the system by SCSI. Input/output is performed using SCSI-commands. This is the default. But if your SCSI device name contains "usb", "uscanner" or "ugen", option connect-scsi must be specified. Otherwise it is assumed that the scanner is connected by USB.
de: Die Option B<connect-scsi> legt fest, dass der Scanner über SCSI an das System angebunden ist. Ein- und Ausgabe erfolgt über SCSI-Befehle. Dies ist die Vorgabe. Falls Ihr SCSI-Gerätename »usb«, »uscanner« oder »ugen« enthält, muss die Option »connect-scsi« angegeben werden. Andernfalls wird angenommen, dass der Scanner über USB angebunden ist.

source: Option B<connect-device> specifies that the scanner is connected to the system by a special device. Input/output is performed by B<read>()/B<write>()-operations on the device. This option must be used for HP ScanJet Plus or scanners connected to USB which are accessed through a named device (e.g. I</dev/usb/scanner0>). For device names that contain "usb", "uscanner" or "ugen", it is not necessary to specify option connect-device.
de: Die Option B<connect-device> legt fest, dass der Scanner über ein besonderes Gerät an das System angebunden ist. Ein- und Ausgabe erfolgen über B<read>()/B<write>()-Aktionen auf dem Gerät. Diese Option muss für HP ScanJet Plus oder Scanner, die über USB angebunden sind und auf die über ein benanntes Gerät (z.B. I</dev/usb/scanner0>) zugegriffen wird, verwendet werden. Für Gerätenamen, die »usb«, »uscanner« oder »ugen« enthalten, ist es notwendig, die Option »connect-device« anzugeben.

source: Option B<enable-image-buffering> stores the scanned image in memory before passing it to the frontend. Could be used in case of forward/backward moving scanner lamp.
de: Die Option B<enable-image-buffering> speichert das gescannte Bild im Arbeitsspeicher, bevor es an die Oberfläche weitergegeben wird. Könnte im Falle einer vorwärts-/rückwärts bewegenden Scannerlampe verwendet werden.

source: Option B<dumb-read> can be used to work around problems with "Error during device I/O". These problems may occur with certain SCSI-to-USB converters or Buslogic SCSI cards. The option should not be used for SCSI devices which are working correctly. Otherwise startup of frontends and changing parameters might be slower.
de: Die Option B<dumb-read> kann zum Umgehen von Problemen mit »Error during device I/O« verwendet werden. Diese Probleme können mit bestimmten SCSI-zu-USB-Konvertern oder Buslogic SCSI-Karten auftreten. Diese Option sollte nicht für korrekt funktionierende SCSI-Geräte verwendet werden. Andernfalls könnte das Starten und Parameterändern langsamer sein.

source: A sample configuration file is shown below:
de: Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: \f(CR/dev/scanner # this is a comment /dev/hpscan option connect-device\fR
de: \f(CR/dev/scanner # dies ist ein Kommentar /dev/hpscan option connect-device\fR

source: I</dev/scanner> is typically a symlink to the actual SCSI scanner device.
de: I</dev/scanner> ist typischerweise ein Symlink auf ein tatsächliches SCSI-Scanner-Gerät.

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: I<$HOME/.sane/calib-hp:E<lt>deviceE<gt>.dat>
de: I<$HOME/.sane/calib-hp:E<lt>GerätE<gt>.dat>

source: Calibration data for HP PhotoSmart PhotoScanner that is retrieved from the scanner after calibration. The data is uploaded to the scanner at start of the backend if it is in media mode 'print media' or if the media mode is changed to 'print media'.
de: Kalibrierungssdaten für HP PhotoSmart PhotoScanner, die nach der Kalibrierung vom Scanner abgerufen wurden. Die Daten werden beim Starten des Backends zum Scanner hochgeladen, falls er in dem Medienmodus »Druckmedien« ist oder der Medienmodus auf »Druckmedien« geändert wird.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (I<.>) and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (I<.>) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf I</tmp/config:> setzen, wird in den Verzeichnissen I<tmp/config>, I<.> und I</etc/sane.d> gesucht (in dieser Reihenfolge).

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: Only used for OS/2 and along with use of HP PhotoSmart PhotoScanner. Must be set to the directory where the directory .sane is located. Is used to save and read the calibration file.
de: Nur auf OS/2 und zusammen mit HP PhotoSmart PhotoScanner verwendet. Muss auf das Verzeichnis gesetzt werden, das das Verzeichnis I<.sane> enthält. Es wird zum Speichern und Lesen der Kalibrierungsdatei verwendet.

source: For each type of connection (connect-scsi, connect-usb, connect-device) it can be specified if the connection to the device should be kept open ("1") or not ("0"). Usually the connections are closed after an operation is performed. Keeping connection open to SCSI-devices can result in errors during device IO when the scanner has not been used for some time. By default, USB-connections are kept open. Other connections are closed.
de: Für jeden Verbindungstyp (»connect-scsi«, »connect-usb«, »connect-device«) kann festgelegt werden, ob die Verbindung zu dem Gerät offengehalten werden soll (»1«) oder nicht (»0«). Normalerweise werden nach der Ausführung einer Aktion die Verbindungen geschlossen. Wird die Verbindung zu SCSI-Geräten offengehalten, kann dies zu Fehlern während der Geräte-E/A führen, wenn der Scanner eine Zeit lange nicht verwendet wurde. Standardmäßig werden USB-Verbindungen offengehalten und andere Verbindungen geschlossen.

source: Specifies number of retries for read operation before returning an EOF error. Only supported for non-SCSI devices. Default: 1 retry. Time between retries is 0.1 seconds.
de: Legt die Anzahl der Wiederholungsversuche bei Leseaktionen fest, bevor ein EOF-Fehler zurückgeliefert wird. Wird nur bei Nicht-SCSI-Geräten unterstützt. Vorgabe: 1 Wiederholungsversuch. Die Zeit zwischen Wiederholungen ist 0,1 Sekunden.

source: BUGS
de: FEHLER

source: In media mode 'slide' and 'negative', scan resolutions are rounded to multiple of 300 dpi. The scanner does not scale the data correctly on other resolutions. Some newer models (firmware code R030 and later) do not support adjustment of contrast/intensity level and tone map. The backend will simulate this by software, but only for gray and 24 bit color.
de: Im Medienmodus »Dia« und »Negativ« werden die Scan-Auflösungen auf Vielfache von 300 DPI gerundet. Der Scanner skaliert die Daten bei anderen Auflösungen nicht korrekt. Einige neuere Modelle (Firmware-Code R030 und neuer) unterstützen die Anpassung der Kontrast-/Intensitätsstufe und der Tonwerte nicht. Das Backend wird dies mittels Software simulieren, aber nur für Graustufen und 24-Bit-Farbe.

source: B<Automatic Document Feeder (ADF)>
de: B<Automatischer Dokumenteneinzug (ADF)>

source: For use of the ADF with B<xscanimage>(1), first place paper in the ADF and then change option scan source to 'ADF'. Press 'change document' to load a sheet. Then press 'scan' to start a scan. Maybe it is sufficient to press 'scan' without 'change document' for repeated scans. The use of the preview window is not recommended when working with the ADF. Setting a window to scan from ADF is not supported with B<xscanimage>(1). Try B<xsane>(1).
de: Um den ADF mit B<xscanimage>(1) zu verwenden, legen Sie zuerst Papier in den ADF und ändern dann die Scan-Quelle-Option auf »ADF«. Klicken Sie »change document«, um ein Blatt zu laden. Klicken Sie dann »scan«, um den Scan zu starten. Vielleicht reicht es auch, »Scan« ohne »change document« für Serien-Scans zu drücken. Bei der Verwendung von ADF wird der Einsatz des Vorschaufensters nicht empfohlen. Das Setzen eines Scan-Fensters beim Einsatz von ADF wird von B<xscanimage>(1) nicht unterstützt. Versuchen Sie B<xsane>(1).

source: B<Immediate actions>
de: B<Sofortige Aktionen>

source: Some actions in B<xscanimage>(1) (i.e. unload, select media, calibrate) have an immediate effect on the scanner without starting a scan. These options can not be used with B<scanimage>(1).
de: Einige Aktionen in B<xscanimage>(1) (d.h. entladen, Medien auswählen, kalibrieren) haben eine sofortige Auswirkung auf den Scanner, ohne einen Scan zu starten. Diese Optionen können mit B<scanimage>(1) nicht verwendet werden.

source: TODO
de: OFFENE PUNKTE

source: PhotoScanners with firmware release R030 and up have no firmware support for contrast/brightness/gamma table. In the current backend this is simulated by software on 24 bits data. Simulation on 30 bits should give better results.
de: PhotoScanner mit Firmware-Veröffentlichung R030 und höher haben keine Firmware-Unterstützung für Kontrast/Helligkeit/Gamma-Tabelle. Im aktuellen Backend wird dies durch Software auf 24-bit-Daten simuliert. Simulation auf 30 bit sollte bessere Ergebnisse liefern.

source: B<Data widths greater than 8 bits>
de: B<Datenbreiten größer als 8 bit>

source: Custom gamma table does not work.
de: Angepasste Gamma-Tabellen funktionieren nicht.

source: B<Parallel scanner support>
de: B<Unterstützung für Parallelportscanner>

source: Beside the ScanJet Plus which came with its own parallel interface card, currently only the HP ScanJet 5100C/5200C are supported. These scanners are using an internal parallel-to-SCSI converter which is supported by the ppSCSI-driver (see above).
de: Neben dem ScanJet Plus, der mit seiner eigenen parallelen Schnittstellenkarte geliefert wurde, wird derzeit nur der HP ScanJet 5100C/5200C unterstützt. Diese Scanner verwenden einen internen Parallel-zu-SCSI-Konverter, der vom ppSCSI-Treiber (siehe oben) unterstützt wird.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: The sane-hp backend was written by Geoffrey T. Dairiki.
de: Das Backend »sane-hp« wurde von Geoffrey T. Dairiki geschrieben.

source: HP PhotoSmart PhotoScanner support by Peter Kirchgessner.
de: HP PhotoSmart PhotoScanner-Unterstützung von Peter Kirchgessner.

source: The "hp" backend no longer supports OfficeJet multi-function peripherals. For these devices use the external "hpoj" backend in version 0.90 and later of the "HP OfficeJet Linux driver", available at
de: Das Backend B<sane-hp> unterstützt keine OfficeJet-Multifunktionsgeräte mehr. Benutzen Sie das externe Backend »hpoj« in Version 0.90 oder neuer für diese Geräte. Es ist unter folgender Adresse verfügbar:

source: Because Hewlett-Packard does no longer produce scanners that support SCL (beside the OfficeJets), the above list of supported scanners is complete. Other HP scanners are not supported by the "hp" backend, but might be supported by another one. See I<http://www.sane-project.org/>. You can also watch the sane-devel mailing list at I<http://www.sane-project.org/mailing-lists.html>.
de: Da Hewlett-Packard keine Scanner mehr herstellt, die SCL unterstützen (außer den OfficeJets), ist die obige Liste der unterstützten Scanner vollständig. Andere HP-Scanner werden von dem Backend B<sane-hp> nicht unterstützt, könnten dies aber von einem anderen Backend sein. Siehe I<http://www.sane-project.org/>. Sie können auch die SANE-Mailingliste unter I<http://www.sane-project.org/mailing-lists.html> beobachten.

source: Where I<special> is the UNIX path-name for the special device that corresponds to the scanner. For SCSI scanners the special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sg2>, for example. If the special device name contains "usb", "uscanner" or "ugen", it is assumed that the scanner is connected by USB. For the HP ScanJet Plus the special device name must be the device that corresponds to the parallel interface card that was shipped with the scanner. That is I</dev/hpscan>. A special driver is required for this card. See ftp://rvs.ctrl-c.liu.se/pub/wingel/hpscan for details. If the link does not work, try ftp://sunsite.unc.edu/pub/Linux/kernel/patches/scanners.
de: Hierbei ist I<Spezialdatei> der UNIX-Pfadname für das Spezialgerät, das dem Scanner entspricht. Für SCSI-Scanner muss der Spezialgerätname ein generisches SCSI-Gerät oder ein Symlink auf ein solches Gerät sein. Unter Linux könnten solche Gerätenamen beispielsweise I</dev/sga> oder I</dev/sg2> sein. Falls der Spezialgerätename »usb«, »uscanner« oder »ugen« enthält, wird angenommen, dass der Scanner mittels USB verbunden ist. Für den HP ScanJet Plus mus der Spezialgerätename das Gerät sein, das der parallelen Schnittstellenkarte entspricht, die mit dem Scanner ausgeliefert wurde. Das ist I</dev/hpscan>. Für diese Karte wird ein Spezialtreiber benötigt. Siehe I<ftp://rvs.ctrl-c.liu.se/pub/wingel/hpscan> für Details. Falls dieser Link nicht funktioniert, versuchen Sie I<ftp://sunsite.unc.edu/pub/Linux/kernel/patches/scanners>.

source: Option B<connect-device> specifies that the scanner is connected to the system by a special device. Input/output is performed by read()/write()-operations on the device. This option must be used for HP ScanJet Plus or scanners connected to USB which are accessed through a named device (e.g. /dev/usb/scanner0). For device names that contain "usb", "uscanner" or "ugen", it is not necessary to specify option connect-device.
de: Die Option B<connect-device> legt fest, dass der Scanner über ein besonderes Gerät an das System angebunden ist. Ein- und Ausgabe erfolgen über B<read>()/B<write>()-Aktionen auf dem Gerät. Diese Option muss für HP ScanJet Plus oder Scanner, die über USB angebunden sind und auf die über ein benanntes Gerät (z.B. I</dev/usb/scanner0>) zugegriffen wird, verwendet werden. Für Gerätenamen, die »usb«, »uscanner« oder »ugen« enthalten, ist es notwendig, die Option »connect-device« anzugeben.

source: \f(CR/dev/scanner # this is a comment /dev/hpscan option connect-device\fR
de: \f(CR/dev/scanner # dies ist ein Kommentar /dev/hpscan option connect-device\fR

source: /dev/scanner is typically a symlink to the actual SCSI scanner device.
de: I</dev/scanner> ist typischerweise ein Symlink auf ein tatsächliches SCSI-Scanner-Gerät.
