Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-scsi.5.po
Languages: de

source: 14 Jul 2008
de: 14. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-scsi - SCSI adapter tips for scanners
de: sane-scsi - SCSI-Adapter-Tipps für Scanner

source: DESCRIPTION
de: BESCHREIBUNG

source: This manual page contains various operating-system specific tips and tricks on how to get scanners with a SCSI interface working.
de: Diese Handbuchseite enthält verschiedene betriebssystemabhängige Tipps und Tricks, wie Sie Scanner mit einer SCSI-Schnittstelle zum Laufen bekommen.

source: GENERAL INFO
de: ALLGEMEINE INFORMATIONEN

source: For scanners with a SCSI interface, it may be necessary to edit the appropriate backend configuration file before using SANE for the first time. For most systems, the configuration file should list the name of the generic SCSI device that the scanner is connected to (e.g., under Linux, I</dev/sg4> or I</dev/sge> is such a generic SCSI device). It is customary to create a symlink from I</dev/scanner> to the generic SCSI device that the scanner is connected to. In this case, the configuration file simply lists the line I</dev/scanner>. For a detailed description of each backend's configuration file, please refer to the relevant backend manual page (e.g., B<sane-epson>(5) for Epson scanners, B<sane-hp>(5) for HP scanners, etc.).
de: Für Scanner mit einer SCSI-Schnittstelle kann es notwendig sein, die geeignete Backend-Konfigurationsdatei zu bearbeiten, bevor SANE erstmalig verwendet wird. Für die meisten Systeme sollte die Konfigurationsdatei die Namen der generischen SCSI-Geräte aufführen, mit denen der Scanner verbunden ist (z.B. ist unter Linux I</dev/sg4> oder I</dev/sge> ein solches generisches SCSI-Gerät). Es ist üblich, einen Symlink von I</dev/scanner> auf das generische SCSI-Gerät zu erstellen, mit dem der Scanner verbunden ist. In diesem Fall führt die Konfigurationsdatei einfach die Zeile I</dev/scanner> auf. Für eine detaillierte Beschreibung der Backend-Konfigurationsdateien schauen Sie bitte in die Handbuchseite des relevanten Backends (z.B. B<sane-epson>(5) für Epson-Scanner, B<sane-hp>(5) für HP-Scanner usw.).

source: For some operating systems (e.g. Linux and OS/2), there is an alternate way of specifying scanner devices. This alternate way allows one to identify scanners by the SCSI vendor and model string and/or by the SCSI device address (consisting of bus number, channel number, id, and logical unit number). The syntax for specifying a scanner in this way is:
de: Bei einigen Betriebssystemen (z.B. Linux und OS/2) gibt es eine alternative Möglichkeit, Scanner-Geräte festzulegen. Diese alternative Art ermöglicht es, Scanner über den SCSI-Lieferanten und die Modellbezeichnungs-Zeichenkette und/oder über die SCSI-Geräte-Adresse (bestehend aus der Bus-Nummer, der Kanalnummer, der Kennung und der logischen Einheitennummer) zu identifizieren. Die Syntax für die Festlegung eines Scanners auf diese Art ist wie folgt:

source: scsi I<VENDOR MODEL TYPE BUS CHANNEL ID LUN>
de: scsi I<LIEFERANT MODELL TYP BUS KANAL KENNUNG LUN>

source: where I<VENDOR> is the SCSI vendor string, I<MODEL> is the SCSI model string, I<TYPE> is type SCSI device type string, I<BUS> is the SCSI bus number (named "host" in I</proc/scsi/scsi>), I<CHANNEL> is the SCSI channel number, I<ID> is the SCSI id, and I<LUN> is the logical unit number of the scanner device. The first two fields are strings which must be enclosed in double-quotes if they contain any whitespace. The remaining four fields are non-negative integer numbers. The correct values for these fields can be found by using operating system specific tools, e.g. for Linux by looking at the output of the command I<cat /proc/scsi/scsi>. To simplify configuration, a field's value can be replaced with an asterisk symbol (``*''). An asterisk has the effect that any value is allowed for that particular field. This can have the effect that a single scsi-line matches multiple devices. When this happens, each matching device will be probed by the backend one by one and registered if the backend thinks it is a compatible device. For example, the line
de: wobei I<LIEFERANT> die Zeichenkette mit dem SCSI-Lieferanten, I<MODELL> ist die SCSI-Modellbezeichnungs-Zeichenkette, I<TYP> ist die SCSI-Gerätetypzeichenkette, I<BUS> ist die SCSI-Bus-Nummer (genannt »host« in I</proc/scsi/scsi>), I<KANAL> ist die SCSI-Kanalnummer, I<KENNUNG> ist die SCSI-Kennung und I<LUN> ist die logische Einheitennummer des Scanner-Geräts. Die ersten zwei Felder sind Zeichenketten, die in doppelten englischen Anführungszeichen eingeschlossen werden müssen, falls sie Leerraumzeichen enthalten. Die verbleibenden vier Felder sind nicht-negative Ganzzahlen. Die korrekten Werte für diese Felder können mit betriebssystemspezifischen Werkzeugen ermittelt werden, z.B. für Linux durch Prüfen der Ausgabe des Befehls I<cat /proc/scsi/scsi>. Um die Konfiguration zu erleichtern, kann der Wert eines Feldes durch ein Sternsymbol (»*«) ersetzt werden. Ein Stern hat den Effekt, dass für dieses bestimmte Feld jeder Wert erlaubt ist. Dies kann dazu führen, dass eine einzelne SCSI-Zeile auf mehrere Geräte passt. Wenn dies passiert, wird nacheinander jedes passende Gerät durch das Backend geprüft und registriert, falls das Backend glaubt, dass dies ein kompatibles Gerät ist. Die Zeile

source: would attach the Mustek SCSI scanner with the following /proc/scsi/scsi entry:
de: würde beispielsweise einen Mustek-SCSI-Scanner mit dem folgenden /proc/scsi/scsi-Eintrag anhängen:

source: Usually it's sufficient to use vendor and model strings only or even only the vendor string. The following example
de: Normalerweise reicht es aus, nur die Zeichenketten für den Lieferanten und das Modell oder sogar nur für den Lieferanten zu verwenden. Das folgende Beispiel

source: would have the effect that all SCSI devices in the system with a vendor string of MUSTEK would be probed and recognized by the backend.
de: hätte den Effekt, das alle SCSI-Geräte in dem System, deren Lieferantenzeichenkette MUSTEK lautet, geprüft und durch das Backend registriert würden.

source: If the remainder of a scsi-string consists of asterisks only, the asterisks can be omitted. For example, the following line is equivalent to the one specified previously:
de: Falls der Rest einer SCSI-Zeichenkette nur aus Sternchen besteht, können die Sternchen entfallen. Beispielweise ist die folgende Zeile äquivalent zu der vorher festgelegten:

source: On some platforms (e.g., OpenStep), SANE device names take a special form. This is explained below in the relevant platform-specific section.
de: Auf einigen Plattformen (z.B. OpenStep) nehmen die SANE-Gerätenamen eine besondere Form an. Dies ist nachfolgend in dem relevanten Plattform-spezifischen Abschnitt beschrieben.

source: When using a SCSI scanner, ensure that the access permission for the generic SCSI device is set appropriately. We recommend to add a group "scanner" to I</etc/group> which contains all users that should have access to the scanner. The permission of the device should then be set to allow group read and write access. For example, if the scanner is at generic SCSI device I</dev/sg0>, then the following two commands would set the permission correctly:
de: Beim Einsatz von SCSI-Scannern stellen Sie sicher, dass die Zugriffsberechtigungen für das generische SCSI-Gerät geeignet gesetzt sind. Wir empfehlen, eine Gruppe »scanner« zu I</etc/group> hinzuzufügen, die alle Benutzer enthält, die Zugriff auf den Scanner haben sollen. Die Berechtigungen für das Gerät sollten dann so gesetzt werden, dass sie der Gruppe Lese- und Schreibzugriff erlauben. Falls der Scanner beispielsweise das generische SCSI-Gerät I</dev/sg0> ist, dann würden die folgenden zwei Befehle die Berechtigungen korrekt setzen:

source: When your system uses the device filesystem (devfs), you have to edit I</etc/devfs/perms.> There you should search the line
de: Wenn Ihr System das Gerätedateisystem (devfs) verwendet, müssen Sie I</etc/devfs/perms> bearbeiten. Dort müssen Sie nach der Zeile

source: and add a new line (eg. for changing permissions of sg4):
de: suchen, und eine neue Zeile (z.B. zur Änderung der Berechtigung von sg4) hinzufügen:

source: FREEBSD INFO
de: FREEBSD-INFORMATIONEN

source: Auto-configuration using the "scsi *" lines in the config files only works if the user running the frontend has read/write access to I</dev/xpt0>. Instead, you can also set a link I</dev/scanner> to the appropriate I</dev/uk> device.
de: Die automatische Konfiguration mittels der Zeilen »scsi *« in den Konfigurationsdateien funktioniert nur, falls der Benutzer, der die Oberfläche ausführt, Lese-/Schreibzugriff auf I</dev/xpt0> hat. Sie können stattdessen auch einen Link I</dev/scanner> auf das geeignete Gerät I</dev/uk> setzen.

source: Reported to work fine under FreeBSD 2.2.2R with the B<aha> driver.
de: Läuft Berichten zu Folge gut unter FreeBSD 2.2.2R mit dem Treiber B<aha>.

source: Reported to work fine under FreeBSD 2.2.2.
de: Soll unter FreeBSD 2.2.2 gut laufen.

source: The scanner probes ok but any attempt to access it I<hangs> the entire system. It looks like something is disabling interrupts and then not re-enabling them, so it looks like a bug in the FreeBSD B<aic> driver.
de: Der Scanner wird korrekt erkannt, aber jeder Zugriffsversuch darauf I<hängt> das gesamte System auf. Es sieht so aus, als ob etwas Interrupts deaktivieren und dann nicht wieder aktivieren würde, es sieht also wie ein Fehler im Treiber B<aic> von FreeBSD aus.

source: Works on FreeBSD 2.2.5R and 3.0 using the B<aic> driver, provided that Plug-and-Play support is disabled on the card. If there are no I<uk> devices, just do a I<sh MAKEDEV uk0> in the I</dev> directory. The scanner should then be accessible as I</dev/uk0> if it was probed during boot.
de: Funktioniert unter FreeBSD 2.2.5R und 3.0 mittels des Treibers B<aic>, vorausgesetzt, dass die Unterstützung für »Plug-and-Play« für die Karte deaktiviert ist. Falls es keine I<uk>-Geräte gibt, führen Sie einfach ein I<sh MAKEDEV uk0> in dem Verzeichnis B</dev> durch. Auf den Scanner sollte dann über I</dev/uk0> zugegriffen werden können, so, als ob er während des Systemstarts erkannt worden wäre.

source: Reported to work fine under FreeBSD 2.2.2R with the B<amd> driver.
de: Soll unter FreeBSD 2.2.2R mit dem Treiber B<amd> gut laufen.

source: LINUX INFO
de: LINUX-INFORMATION

source: First, make sure your kernel has SCSI generic support enabled. In I<make xconfig>, this shows up under ``SCSI support-E<gt>SCSI generic support''.
de: Als erstes stellen Sie bitte sicher, dass die generische SCSI-Unterstützung im Kernel aktiviert ist. In I<make xconfig> taucht dies unter »SCSI support-E<gt>SCSI generic support« auf.

source: To keep scanning times to a minimum, it is strongly recommended to use a large buffer size for the generic SCSI driver. From SG driver version 2.0 on, the maximum buffer size can be changed at program run time, and there is no restriction in size. This driver version is part of the Linux kernels from version 2.2.7 on. If the new SG driver is available some backends (e.g. B<sane-umax>(5), B<sane-mustek>(5)B<,> B<sane-sharp>(5)) automatically request larger SCSI buffers. If a backend does not automatically request a larger SCSI buffer, set the environment variable B<SANE_SG_BUFFERSIZE> to the desired buffer size in bytes. It is not recommended to use more than 1 MB, because for large values the probability increases that the SG driver cannot allocate the necessary buffer(s). For ISA cards, even 1 MB might be a too large value. For a detailed discussion of memory issues of the SG driver, see I<http://www.torque.net/sg.>
de: Um Scanzeiten zu minimieren, wird nachdrücklich empfohlen, einen großen Puffer für den generischen SCSI-Treiber zu verwenden. Seit SG-Treiber Version 2.0 kann die Puffergröße zur Laufzeit verändert werden und es gibt keine Größenbeschränkung. Diese Treiberversion ist seit Version 2.2.7 Teil des Linux-Kernels. Falls der neuere SG-Treiber verfügbar ist, erbitten einige Backends (z.B. B<sane-umax>(5), B<sane-mustek>(5), B<sane-sharp>(5)) automatisch größere Puffergrößen. Falls ein Backend nicht automatisch einen größeren SCSI-Puffer anfordert, setzen Sie die Umgebungsvariable B<SANE_SG_BUFFERSIZE> auf die gewünschte Puffergröße in Byte. Es wird nicht empfohlen, mehr als 1 Megabyte zu verwenden, da für größere Werte die Wahrscheinlichkeit zunimmt, dass der SG-Treiber den/die notwendigen Puffer nicht reservieren kann. Für ISA-Karten kann selbst 1 MB ein zu großer Wert sein. Für eine detaillierte Beschreibung von Speicherproblemen des SG-Treibers lesen Sie I<http://www.torque.net/sg>.

source: For Linux kernels before version 2.2.7 the size of the buffer is only 32KB. This works, but for many cheaper scanners this causes scanning to be slower by about a factor of four than when using a size of 127KB. Linux defines the size of this buffer by macro B<SG_BIG_BUFF> in header file I</usr/include/scsi/sg.h>. Unless a system is seriously short on memory, it is recommended to increase this value to the maximum legal value of 128*1024-512=130560 bytes. After changing this value, it is necessary to recompile both the kernel (or the SCSI generic module) and the SCSI backends. Keep in mind that this is only necessary with older Linux kernels.
de: Für Linux-Kernel vor Version 2.2.7 ist die Puffergröße nur 32 kB. Das funktioniert, aber viele günstigere Geräte scannen dadurch nur noch mit ungefähr einem Viertel der Geschwindigkeit wie bei der Verwendung von 127 kB. Linux definiert die Größe dieses Puffers durch das Makro B<SG_BIG_BUFF> in der Header-Datei I</usr/include/scsi/sg.h>. Wenn das System nicht extrem speicherarm ist, wird empfohlen, diesen Wert auf den maximal gültigen Wert von 128*1024-512=130560 byte zu erhöhen. Nach der Änderung dieses Werts ist es notwendig, sowohl den Kernel (oder das generische SCSI-Modul) als auch die SCSI-Backends neu zu kompilieren. Beachten Sie, dass dies nur mit älteren Linux-Kerneln notwendig ist.

source: A common issue with SCSI scanners is what to do when you booted the system while the scanner was turned off. In such a case, the scanner won't be recognized by the kernel and SANE won't be able to access it. Fortunately, Linux provides a simple mechanism to probe a SCSI device on demand. Suppose you have a scanner connected to SCSI bus 2 and the scanner has a SCSI id of 5. When the system is up and running and the scanner is turned on, you can issue the command:
de: Ein häufiges Problem bei SCSI-Scannern besteht darin, was Sie machen müssen, wenn Sie Ihr System gestartet haben, während der Scanner ausgeschaltet war. In diesem Fall wird der Scanner nicht vom Kernel erkannt und SANE ist nicht in der Lage, darauf zuzugreifen. Glücklicherweise stellt Linux einen einfachen Mechanismus bereit, um bei Bedarf nach SCSI-Geräten zu suchen. Nehmen wir an, Ihr Scanner hängt an SCSI-Bus 2 und der Scanner hat die SCSI-Kennung 5. Wenn das System hochgefahren ist und der Scanner eingeschaltet ist, können Sie folgenden Befehl eingeben:

source: and the kernel will probe and recognize your scanner (this needs to be done as root). It's also possible to dynamically remove a SCSI device by using the ``remove-single-device'' command. For details, please refer to to the SCSI-2.4-HOWTO.
de: Dann wird der Kernel Ihren Scanner untersuchen und erkennen (dies muss als Root erfolgen). Es ist auch möglich, ein SCSI-Gerät dynamisch mit dem Befehl »remove-single-device« zu entfernen. Für Details schauen Sie bitte in das SCSI-2.4-HOWTO.

source: Scanners are known to work with the following SCSI adapters under Linux. This list isn't complete, usually any SCSI adapter supported by Linux should work.
de: Scanner funktionieren bekanntermaßen mit den nachfolgend aufgeführten SCSI-Adaptern unter Linux. Die Liste ist nicht vollständig, normalerweise sollte jeder unter Linux unterstützte SCSI-Adapter funktionieren.

source: Acard/Advance SCSI adapters
de: Acard/Advance SCSI-Adapter

source: Some old versions of the kernel driver (I<atp870u.c>) cut the inquiry information. Therefore the scanner couldn't be detected correctly. Use a current kernel.
de: Einige alte Versionen des Kerneltreibers (I<atp870u.c>) schnitten die Abfrageinformationen ab. Daher konnte der Scanner nicht korrekt erkannt werden. Verwenden Sie einen aktuellen Kernel.

source: Reported to work fine with Linux since v2.0. If you encounter kernel freezes or other unexpected behaviour get the latest Linux kernel (2.2.17 seems to work) or reduce SCSI buffer size to 32 kB.
de: Soll unter Linux seit Version 2.0 gut funktionieren. Falls der Kernel bei Ihnen einfriert oder anderes unerwartetes Verhalten auftritt, verwenden Sie den neusten Kernel (2.2.17 scheint zu funktionieren) oder reduzieren Sie die SCSI-Puffergröße auf 32 kB.

source: Reported to work fine with Linux v2.0.
de: Soll unter Linux seit Version 2.0 gut funktionieren.

source: To configure the BusLogic card, you may need to follow these instructions (contributed by Jeremy E<lt>jeremy@xxedgexx.comE<gt>): During boot, when your BusLogic adapter is being initialized, press Ctrl-B to enter your BusLogic adapter setup. Choose the address which your BusLogic containing your scanner is located. Choose ``SCSI Device Configuration''. Choose ``Scan SCSI Bus''. Choose whatever SCSI id that contains your scanner and then choose ``View/Modify SCSI configuration''. Change ``Negotiation'' to ``async'' and change ``Disconnect'' to ``off''. Press Esc, save, and Esc again until you are asked to reboot.
de: Zur Konfiguration des BusLogic-Karte könnte es notwendig sein, den folgenden Anweisungen (beigesteuert von Jeremy E<lt>jeremy@xxedgexx.comE<gt>) zu folgen: Während des Systemstarts, wenn Ihr BusLogic-Adapter initialisiert wird, drücken Sie Strg-B, um in das BusLogic-Adapter-Setup zu kommen. Wählen Sie die Adresse, unter der Ihr Scanner im BusLogic enthalten ist. Wählen Sie »SCSI Device Configuration«. Wählen Sie »Scan SCSI Bus«. Wählen Sie die SCSI-Kennung, die Ihr Scanner enthält, aus und wählen Sie dann »View/Modify SCSI configuration«. Ändern Sie »Negotiation« auf »async« und »Disconnect« auf »off«. Drücken Sie Esc, speichern Sie und erneut Esc, bis Sie zum Neustart aufgefordert werden.

source: NCR/Symbios 53c400/53c400a or Domex DTC3181E/L/LE (DTCT436/436P) ISA SCSI card
de: NCR/Symbios 53c400/53c400a oder Domex DTC3181E/L/LE (DTCT436/436P) ISA-SCSI-Karte

source: This card is supplied by Mustek (and other vendors). It's supported since Linux 2.2. The SCSI cards are supported by the module g_NCR5380. It's necessary to tell the kernel the io port and type of card. Example for a 53c400a: I<modprobe g_NCR5380 ncr_addr=0x280 ncr_53c400a=1 .> Once the kernel detects the card, it should work all right. However, while it should work, do not expect good performance out of this card---it has no interrupt line and therefore while a scan is in progress, the system becomes almost unusable. You may change the values of the USLEEP macros in I<drivers/scsi/g_NCR5380.c>. Some documentation is in this file and I<NCR5380.c>.
de: Diese Karte wird von Mustek (und anderen Lieferanten) bereitgestellt. Sie wird seit Linux 2.2 unterstützt. Die SCSI-Karten werden von dem Modul »g_NCR5380« unterstützt. Es ist notwendig, dem Kernel den E/A-Port und den Typ der Karte mitzuteilen. Beispiel für ein 53c400a: I<modprobe g_NCR5380 ncr_addr=0x280 ncr_53c400a=1>. Sobald der Kernel die Karte erkennt, sollte alles korrekt funktionieren. Obwohl alles funktioniert, erwarten Sie keine gute Leistung von dieser Karte. Sie verfügt über keine Interrupt-Leitung und daher wird das System fast unbenutzbar, während der Scan läuft. Sie können den Wert des Makros USLEEP in I<drivers/scsi/g_NCR5380.c> ändern. Etwas Dokumentation befindet sich in dieser Datei und in I<NCR5380.c>.

source: For some scanners it may be necessary to disable disconnect/reconnect. To achieve this use the option ncr53c8xx="disc:n". Some people reported that their scanner only worked with the 53c7,8xx driver, not the ncr53c8xx. Try both if you have trouble.
de: Bei einigen Scannern kann es notwendig sein, »disconnect/reconnect« zu deaktivieren. Um dies zu erreichen, verwenden Sie die Option ncr53c8xx="disc:n". Einige Leute berichten, dass ihr Scanner nur mit dem Treiber »53c7,8xx« funktioniert, nicht mit dem »ncr53c8xx«. Verwenden Sie beide, wenn Sie Probleme haben.

source: For Linux kernels before 2.0.33 it may be necessary to increase the SCSI timeout. The default timeout for the Linux kernels before 2.0.33 is 10 seconds, which is way too low when scanning large area. If you get messages of the form ``restart (ncr dead ?)'' in your I</var/log/messages> file or on the system console, it's an indication that the timeout is too short. In this case, find the line ``if (np-E<gt>latetimeE<gt>10)'' in file I<ncr53c8xx.> (normally in directory I</usr/src/linux/drivers/scsi>) and change the constant 10 to, say, 60 (one minute). Then rebuild the kernel/module and try again.
de: Für Linux-Kernel vor 2.0.33 kann es notwendig sein, die SCSI-Zeitüberschreitung zu erhöhen. Die Vorgabezeitüberschreitung für Linux-Kernel vor 2.0.33 ist 10 Sekunden, was für das Scannen großer Bereiche zu klein ist. Falls Sie Nachrichten der Form »restart (ncr dead ?)« in Ihrer Datei I</var/log/messages> oder auf der System-Konsole erhalten, ist das ein Anzeichen, dass die Zeitüberschreitung zu klein ist. In diesem Fall, suchen Sie die Zeile »if (np-E<gt>latetimeE<gt>10)« in der Datei I<ncr53c8xx.> (normalerweise im Verzeichnis I</usr/src/linux/drivers/scsi>) und ändern die Konstante auf beispielsweise 60 (eine Minute). Dann bauen Sie das Kernelmodul neu und versuchen es erneut.

source: The driver can be downloaded from I<http://www.garloff.de/kurt/linux/dc395/>. For some older scanners it may be necessary to disable all the more advanced features by using e.g. I<modprobe dc395x_trm dc395x_trm=7,5,1,32>.
de: Der Treiber kann von I<http://www.garloff.de/kurt/linux/dc395/> heruntergeladen werden. Für einige ältere Scanner kann es notwendig sein, sämtliche fortgeschrittene Funktionalitäten zu deaktivieren, beispielsweise mittels I<modprobe dc395x_trm dc395x_trm=7,5,1,32>.

source: Version 1.11 of the Tekram driver seems to work fine mostly, except that the scan does not terminate properly (it causes a SCSI timeout after 10 minutes). The generic AM53C974 also seems to work fine and does not suffer from the timeout problems.
de: Version 1.11 des Tekram-Treibers scheint größtenteils korrekt zu funktionieren, außer dass der Scan nicht korrekt beendet wird (er führt zu einer SCSI-Zeitüberschreitung nach 10 Minuten). Der generische AM53C974 scheint auch korrekt zu funktionieren und leidet nicht unter den Zeitüberschreitungsproblemen.

source: SOLARIS, OPENSTEP AND NEXTSTEP INFO
de: SOLARIS-, OPENSTEP- UND NEXTSTEP-INFOMATION
