Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-plustek.5.po
Languages: de

source: * The driver does not support these manic scalings up to 16 times the physical resolution. The only scaling is done on resolutions between the physical resolution of the CCD-/CIS-sensor and the stepper motor i.e. you have a 600x1200 dpi scanner and you are scanning using 800dpi, so scaling is necessary, because the sensor only delivers 600dpi but the motor is capable to perform 1200dpi steps.
de: * Der Treiber unterstützt diese durchgeknallten Skalierungen (bis zum 16-fachen der physischen Auflösung) nicht. Die einzige Skalierung erfolgt bei Auflösungen zwischen der physischen Auflösung des CCD-/CIS-Sensors und dem Schrittmotor, d.h. Sie haben einen 600x1200-DPI-Scanner und Sie scannen mit 800 DPI, so dass eine Skalierung notwendig ist, da der Sensor nur 600 DPI ausliefern kann, aber der Motor in der Lage ist, 1200 DPI-Schritte durchzuführen.

source: * Plusteks' model policy is somewhat inconsistent. They sell technically different devices under the same product name. Therefore it is possible that some devices like the UT12 or U12 won't work - please check the model list above and compare the product-id to the one your device has.
de: * Plusteks Modellpolitik ist etwas inkonsistent. Sie verkaufen technisch verschiedene Geräte unter dem gleichen Produktnamen. Daher ist es möglich, dass einige Geräte wie der UT12 oder der U12 nicht funktionieren werden - bitte prüfen Sie die obige Modellliste und vergleichen Sie die Produktkennung mit der, die Ihr Gerät hat.

source: * Negative/Slide scanning quality is poor.
de: * Die Scanqualität von Negativen/Dias ist schlecht.

source: The B<sane-plustek> library implements a SANE (Scanner Access Now Easy) backend that provides access to USB flatbed scanners based on National Semiconductor Merlin chipsets (LM9831, 9832 and 9833). If you're looking for parallel-port support for Plustek scanner please refer to the B<sane-plustek_pp> backend.
de: Die Bibliothek B<sane-plustek> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf USB-Flachbettscanner, die auf den National Semiconductor Merlin-Chipsätzen (LM9831, 9832 und 9833) basieren. Falls Sie nach der Unterstützung von Plustek-Scannern mit Parallel-Port suchen, schauen Sie sich bitte das B<sane-plustek_pp>(5)-Backend an.

source: For parallelport device support see the B<plustek_pp> backend.
de: Siehe das Backend B<sane-plustek_pp>(5) für die Unterstützung von Parallelport-Geräten.

source: The SCSI scanner OpticPro 19200S is a rebadged Artec AM12S scanner and is supported by the B<Artec> backend.
de: Der SCSI-Scanner OpticPro 19200S ist ein umetikettierter Artec AM12S-Scanner und wird vom Backend B<Artec> unterstützt.

source: For a more complete and up to date list see: B<http://www.sane-project.org/sane-supported-devices.html>
de: Für eine vollständigere und aktuellere Liste siehe I<http://www.sane-project.org/sane-supported-devices.html>.

source: I<b> 0 --E<gt> do not invert the picture during negativ scans,
de: I<b> 0 --E<gt> invertiert das Bild während des Scans von Negativen nicht,

source: 1 --E<gt> save results of calibration in ~/.sane/ directory
de: 1 --E<gt> Ergebnisse der Kalibrierung im Verzeichnis I<~/.sane/> speichern

source: You have to make sure, that the USB subsystem is loaded correctly and you have access to the device-node. For more details see B<sane-usb (5)> manpage. You might use B<sane-find-scanner> to check that you have access to your device.
de: Sie müssen sicherstellen, dass das USB-Subsystem korrekt geladen ist und dass Sie auf den Geräteknoten Zugriff haben. Für weitere Details siehe die Handbuchseite B<sane-usb>(5). Sie könnten B<sane-find-scanner>(1) zur Überprüfung des Zugriffs auf Ihr Gerät verwenden.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: To obtain debug messages from the backend, please set the environment-variable I<SANE_DEBUG_PLUSTEK> before calling your favorite scan-frontend (i.e. scanimage).
de: Um Fehlersuchnachrichten vom Backend zu erhalten, setzen Sie bitte die Umgebungsvariable B<SANE_DEBUG_PLUSTEK>, bevor Sie Ihre Lieblingsoberfläche starten (d.h. Scanimage):

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).
