Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-epson2.5.po
Languages: de

source: 22 Jan 2009
de: 22. Januar 2009

source: NAME
de: BEZEICHNUNG

source: sane-epson2 - SANE backend for EPSON scanners
de: sane-epson2 - SANE-Backend für EPSON-Scanners

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-epson2> library implements a SANE (Scanner Access Now Easy) backend that provides access to Epson flatbed scanners. This library supports a similar set of scanners as the sane-epson driver but was developed to support a wider range of connections to the scanner; include network access.
de: Die Bibliothek B<sane-epson2> implementiert ein SANE-Backend (Scanner Access Now Easy), das den Zugriff auf Epson-Flachbettscanner ermöglicht. Diese Bibliothek unterstützt eine ähnliche Gruppe von Scannern wie der Treiber Sane-epson, wurde aber entwickelt, um eine größere Vielfalt an Verbindungen zu dem Scanner zu unterstützen, einschließlich Netzwerkzugriff.

source: Because B<sane-epson> and B<sane-epson2> drivers support many of the same devices, if one driver gives you problems you may try disabling it to try the other. This can be done by removing the driver name from the I<dll.conf> or perhaps by commenting out the options in I<epson.conf> or I<epson2.conf.>
de: Da viele Geräte sowohl von B<sane-epson> als auch B<sane-epson2> unterstützt werden, sollten Sie bei Problemen mit einem Treiber versuchen, ihn zu deaktivieren und den anderen zu verwenden. Dies kann erfolgen, indem Sie den Treibernamen aus I<dll.conf> entfernen oder möglicherweise die Optionen in I<epson.conf> oder I<epson2.conf> auskommentieren.

source: At present, the following scanners are known to work with this backend:
de: Gegenwärtig sollten die folgenden Scanner mit diesem Backend funktionieren:

source: \f(CRModel: Connection Type --------------------------- ------------------- ActionScanner II SCSI, parallel AcuLaser CX11 Series USB, Network AcuLaser CX21 Series USB, Network CX-3200 USB CX-3600 USB CX-3650 USB CX-4050 USB CX-4600 USB CX-4800 USB CX-5000 USB CX-5200 USB CX-5400 USB CX-6300 USB CX-6400 USB CX-6500 USB CX-6600 USB DX-3800 USB DX-5000 USB DX-5050 USB DX-6000 USB DX-7400 USB ES-300C SCSI, parallel ES-300GS SCSI ES-600C parallel ES-1200C parallel Expression 636 SCSI Expression 800 SCSI Expression 1600 USB, SCSI, IEEE-1394 Expression 1680 USB, SCSI, IEEE-1394 FilmScan 200 SCSI GT-5000 SCSI, parallel GT-5500 SCSI GT-6000 parallel GT-6500 parallel GT-7000 SCSI GT-8000 SCSI GT-8500 SCSI Perfection 610 USB Perfection 636S SCSI Perfection 636U USB Perfection 640 USB Perfection 1200S SCSI Perfection 1200U USB Perfection 1240 USB, SCSI Perfection 1640 USB, SCSI Perfection 1650 USB Perfection 1660 USB Perfection 2400 USB Perfection 2450 USB, IEEE-1394 Perfection 3200 USB Perfection 4870 USB Perfection 4990 USB RX-425 USB RX-500 USB RX-600 USB RX-700 USB V700 USB, IEEE-1394 V750 USB, IEEE-1394\fR
de: \f(CRModell: Verbindungstyp --------------------------- ------------------- ActionScanner II SCSI, parallel AcuLaser CX11-Reihe USB, Netzwerk AcuLaser CX21-Reihe USB, Netzwerk CX-3200 USB CX-3600 USB CX-3650 USB CX-4050 USB CX-4600 USB CX-4800 USB CX-5000 USB CX-5200 USB CX-5400 USB CX-6300 USB CX-6400 USB CX-6500 USB CX-6600 USB DX-3800 USB DX-5000 USB DX-5050 USB DX-6000 USB DX-7400 USB ES-300C SCSI, parallel ES-300GS SCSI ES-600C parallel ES-1200C parallel Expression 636 SCSI Expression 800 SCSI Expression 1600 USB, SCSI, IEEE-1394 Expression 1680 USB, SCSI, IEEE-1394 FilmScan 200 SCSI GT-5000 SCSI, parallel GT-5500 SCSI GT-6000 parallel GT-6500 parallel GT-7000 SCSI GT-8000 SCSI GT-8500 SCSI Perfection 610 USB Perfection 636S SCSI Perfection 636U USB Perfection 640 USB Perfection 1200S SCSI Perfection 1200U USB Perfection 1240 USB, SCSI Perfection 1640 USB, SCSI Perfection 1650 USB Perfection 1660 USB Perfection 2400 USB Perfection 2450 USB, IEEE-1394 Perfection 3200 USB Perfection 4870 USB Perfection 4990 USB RX-425 USB RX-500 USB RX-600 USB RX-700 USB V700 USB, IEEE-1394 V750 USB, IEEE-1394\fR

source: and many more. The official list is on the Sane web site.
de: und viele weitere. Die offizielle Liste finden Sie auf der SANE-Projektseite.

source: For other scanners the software may or may not work. Please send mail to the sane-backend mailing list to report success with scanners not on the list or problems with scanners that are listed.
de: Mit anderen Scanner mag die Software funktionieren oder auch nicht. Bitte schicken Sie eine E-Mail (auf Englisch) an die sane-backend-Mailingliste, um Erfolg mit Scannern, die nicht auf der Liste sind, oder Probleme mit aufgeführten Scannern zu berichten.

source: OPTIONS
de: OPTIONEN

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in programs like B<xscanimage>(1) or B<xsane>(1).
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in Programmen wie B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: Not all devices support all options.
de: Nicht alle Geräte unterstützen alle Optionen.

source: I<Scan Mode>
de: I<Scanmodus>

source: The B<--mode> switch selects the basic mode of operation of the scanner. Valid choices are Binary, Gray and Color. The Binary mode is black and white only, Gray will produce 256 levels of gray or more depending on the scanner and Color means 24 bit color mode or more depending on the scanner. Some scanners will internally use 36 bit color, their external interface however may only support 24 bits.
de: Der Schalter B<--mode> wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind Binary, Gray und Color. Der Modus Binary ist nur Schwarz und Weiß, Gray wird 256 Graustufen erzeugen oder mehr, abhängig vom Scanner, und Color bedeutet 24-bit-Farbmodus oder mehr, abhängig vom Scanner. Einige Scanner werden intern 36 bit Farbe verwenden, ihre externe Schnittstelle könnte allerdings nur 24 bit unterstützen.

source: The B<--depth> option selects the bit depth the scanner is using. This option is only available for scanners that support more than one bit depth. Older scanners will always transfer the image in 8bit mode. Newer scanners allow one to select either 8 bits, 12 or 14 bits per color channel. For a color scan this means an effective color depth of 36 or 42 bits over all three channels. The valid choices depend on the scanner model.
de: Die Option B<--depth> wählt die Bit-Tiefe, die der Scanner verwendet. Diese Option ist nur für Scanner verfügbar, die mehr als eine Bit-Tiefe unterstützen. Ältere Scanner werden das Bild immer im 8-bit-Modus übertragen. Neuere Scanner erlauben die Auswahl von 8, 12 oder 14 bit pro Farbkanal. Für einen Farbscan bedeutet dies eine wirksame Farbtiefe von 36 oder 42 bit über alle drei Kanäle. Die gültigen Wahlmöglichkeiten hängen vom Scannermodell ab.

source: The B<--halftoning> switch selects the mode that is used in Binary mode. Valid options are "None", "Halftone A (Hard Tone)", "Halftone B (Soft Tone)", "Halftone C (Net Screen)", "Dither A (4x4 Bayer)", "Dither B (4x4 Spiral)", "Dither C (4x4 Net Screen)", "Dither D (8x4 Net Screen)", "Text Enhanced Technology", "Download pattern A", and "Download pattern B".
de: Der Schalter B<--halftoning> wählt einen Modus aus, der im Binärmodus verwendet wird. Gültige Optionen sind »None«, »Halftone A (Hard Tone)«, »Halftone B (Soft Tone)«, »Halftone C (Net Screen)«, »Dither A (4x4 Bayer)«, »Dither B (4x4 Spiral)«, »Dither C (4x4 Net Screen)«, »Dither D (8x4 Net Screen)«, »Text Enhanced Technology«, »Download pattern A« und »Download pattern B«.

source: The B<--dropout> switch selects the so called dropout color. Valid options are None, Red, Green and Blue. The default is None. The dropout color is used for monochrome scanning and selects the color that is not scanned. This can be used to e.g. scan an original with a colored background.
de: Der Schalter B<--dropout> wählt die sogenannte Ausfallfarbe. Gültige Optionen sind None, Red, Green und Blue. Die Vorgabe ist None. Die Ausfallfarbe wird beim monochromen Scannen verwendet und wählt die Farbe, die nicht gescannt wird. Dies kann zum Beispiel zum Scannen eines Originals mit einem farbigen Hintergrund verwendet werden.

source: The B<--brightness> switch controls the brightness of the scan. Valid options are integer values from -3 to 3. The default is 0. The larger the brightness value, the brighter the image gets. If a user defined table for the gamma correction is selected, the brightness parameter is not available.
de: Der Schalter B<--brightness> steuert die Helligkeit des Scans. Gültige Optionen sind Ganzahlwerte von -3 bis 3. Die Vorgabe ist 0. Je größer der Helligkeitswert ist, desto heller wird das Bild. Falls eine benutzerdefinierte Tabelle für die Gamma-Korrektur verwendet wird, steht der Helligkeitsparameter nicht zur Verfügung.

source: The B<--sharpness> switch sets the sharpness of the image data. Valid options are integer values from -2 to 2, with -2 meaning "Defocus", -1 "Defocus slightly", 0 "Normal", 1 "Sharpen slightly" and 2 "Sharpen".
de: Der Schalter B<--sharpness> setzt die Schärfe der Bilddaten. Gültige Optionen sind Ganzzahlwerte von -2 bis 2, wobei -2 »defokussiert«, -1 »leicht defokussiert«, 0 »normal«, 1 »leicht geschärft« und 2 »geschärft« bedeutet.

source: The B<--gamma-correction> switch controls the scanner's internal gamma correction. Valid options are "Default", "User defined", "High density printing" "Low density printing" and "High contrast printing".
de: Der Schalter B<--gamma-correction> steuert die Scanner-interne Gamma-Korrektur. Gültige Optionen sind »Default«, »User defined«, »High density printing«, »Low density printing« und »High contrast printing«.

source: The B<--color-correction> switch controls the scanner's internal color correction function. Valid options are "No Correction", "Impact-dot printers", "Thermal printers", "Ink-jet printers" and "CRT monitors". The default is "CRT monitors".
de: Der Schalter B<--color-correction> steuert die Scanner-interne Farbkorrekturfunktion. Gültige Optionen sind »No Correction«, »Impact-dot printers«, »Thermal printers«, »Ink-jet printers« und »CRT monitors«. Die Vorgabe ist »CRT monitors«.

source: The B<--resolution> switch selects the resolution for a scan. Some EPSON scanners will scan in any resolution between the lowest and highest possible value. The list reported by the scanner can be displayed using the "--help -d epson" parameters to B<scanimage>(1).
de: Der Schalter B<--resolution> wählt die Scan-Auflösung. Einige EPSON-Scanner scannen in jeder Auflösung zwischen dem niedrigsten und dem höchsten möglichen Wert. Die vom Scanner berichtete Liste kann mit den Parametern »--help -d epson« von B<scanimage>(1) angezeigt werden.

source: The B<--threshold> switch selects the minimum brightness to get a white point.
de: Der Schalter B<--threshold> wählt die minimale Helligkeit, um einen Weißpunkt zu erreichen.

source: The B<--mirror> option controls the way the image is scanned. By reading the image data from right to left the image is mirrored. Valid options are "yes" and "no". The default is "no".
de: Die Option B<--mirror> steuert die Art, wie das Bild gescannt wird. Durch Lesen der Bilddaten von rechts nach links wird das Bild gespiegelt. Gültige Optionen sind »yes« und »no«. Die Vorgabe ist »no«.

source: The B<--auto-area-segmentation> switch activates the automatic area segmentation for monochrome scans. The scanner will try to determine which areas are text and which contain images. The image areas will be halftoned, and the text will be improved. Valid options are "yes" and "no". The default is "yes".
de: Der Schalter B<--auto-area-segmentation> aktiviert die automatische Bereichsunterteilung für monochrome Scans. Der Scanner wird versuchen, die Bereiche zu erkennen, die Text sind und die Bilder enthalten. Die Bildbereiche werden gerastert und der Text wird verbessert. Gültige Optionen sind »yes« oder »no«. Die Vorgabe ist »yes«.

source: The B<--red-gamma-table> parameter can be used to download a user defined gamma table for the red channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--red-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den roten Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The B<--green-gamma-table> parameter can be used to download a user defined gamma table for the green channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--green-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den grünen Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The B<--blue-gamma-table> parameter can be used to download a user defined gamma table for the blue channel. The valid options are the same as for --gamma-table.
de: Der Parameter B<--blue-gamma-table> kann zum Herunterladen einer benutzerdefinierten Gammatabelle für den blauen Kanal verwendet werden. Die gültigen Optionen sind identisch wie für »--gamma-table«.

source: The B<--wait-for-button> parameter can be used to wait until the button on the scanner is pressed to actually start the scan process.
de: Der Parameter B<--wait-for-button> kann dazu verwandt werden, auf den Druck des Knopfes am Scanner zu warten, bevor der Scan-Prozess tatsächlich startet.

source: The color correction coefficients B<--cct-1 --cct-2 --cct-3 ... --cct-9> will install color correction coefficients for the user defined color correction. Values are specified as integers in the range -127..127.
de: Die Farbkorrekturkoeffizienten B<--cct-1 --cct-2 --cct-3 … --cct-9> installieren Farbkorrekturkoeffizienten für die benutzerdefinierten Farbkorrekturen. Werte werden als Ganzzahlen im Bereich -127..127 angegeben.

source: The B<--preview> option requests a preview scan. The frontend software automatically selects a low resolution. Valid options are "yes" and "no". The default is "no".
de: Die Option B<--preview> fordert einen Vorschauscan an. Die Oberfläche wählt automatisch eine niedrige Auflösung. Gültige Optionen sind »yes« oder »no«. Die Vorgabe ist »no«.

source: The geometry options B<-l -t -x -y> control the scan area: B<-l> sets the top left x coordinate, B<-t> the top left y coordinate, B<-x> selects the width and B<-y> the height of the scan area. All parameters are specified in millimeters.
de: Die Geometrie-Optionen B<-l -t -x -y> steuern den Scan-Bereich: B<-l> setzt die obere linke X-Koordinate, B<-t> die obere linke Y-Koordinate, B<-x> wählt die Breite und B<-y> die Höhe des Scan-Bereichs. Alle Parameter werden in Millimetern angegeben.

source: The B<--source> option selects the scan source. Valid options depend on the installed options. The default is "Flatbed".
de: Die Option B<--source> wählt die Scan-Quelle. Gültige Optionen hängen von den installierten Optionen ab. Die Vorgabe ist »Flatbed«.

source: The B<--auto-eject> option will eject a page after scanning from the document feeder.
de: Die Option B<--auto-eject> wird eine Seite nach dem Scannen vom Dokumenteneinzug auswerfen.

source: The B<--film-type> option will select the film type for scans with the transparency unit. This option is only activated if the TPU is selected as scan source. Valid options are "Negative Film" and "Positive Film".
de: Die Option B<--film-type> wird den Filmtyp für Scans mit der Durchlichteinheit auswählen. Diese Option ist nur aktiviert, falls ein TPU als Scan-Quelle ausgewählt ist. Gültige Optionen sind »Negative Film« und »Positive Film«.

source: The B<--focus-position> option selects the focus position for all scans. Valid options are "Focus 2.5mm above glass" and "Focus on glass". The focus on the 2.5mm point above the glass is necessary for scans with the transparency unit, so that the scanner can focus on the film if one of the film holders is used. This option is only functional for selected scanners, all other scanners will ignore this option.
de: Die Option B<--focus-position> wählt die Fokusposition für alle Scans. Gültige Optionen sind »Focus 2.5mm above glass« und »Focus on glass«. Der Fokuspunkt 2,5 mm oberhalb des Glases ist für die Durchlichteinheit notwendig, so dass der Scanner auf den Film fokussieren kann, falls einer der Filmhalter verwendet wird. Diese Option ist nur für ausgewählte Scanner wirksam, alle anderen Scanner werden diese Option ignorieren.

source: The B<--bay> option selects which bay to scan
de: Die Option B<--bay> wählt den Schacht aus, der gescannt werden soll.

source: The B<--eject> option ejects the sheet in the ADF.
de: Die Option B<--eject> wirft das Blatt aus dem automatischen Dokumenteneinzug aus.

source: The B<--adf-mode> option select the ADF mode (simplex/duplex).
de: Die Option B<--adf-mode> wählt den Modus des automatischen Dokumenteneinzugs (simplex/duplex, einseitig oder beidseitig).

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/epson2.conf> specifies the device(s) that the backend will use. Possible connection types are:
de: Die Konfigurationsdatei I</etc/sane.d/epson2.conf> gibt das Gerät oder die Geräte an, die das Backend verwenden wird. Mögliche Anschlusstypen sind:

source: This is the default, and if nothing else is specified the backend software will open a given path as SCSI device. More information about valid syntax for SCSI devices can be found in B<sane-scsi>(5).
de: Dies ist die Vorgabe und falls nichts anderes festgelegt ist, wird die Backend-Software einen angegebenen Pfad als SCSI-Gerät öffnen. Weitere Informationen über die für SCSI-Geräte gültige Syntax können in B<sane-scsi>(5) gefunden werden.

source: Usually SCSI scanners are configured with a line "scsi EPSON" in this file. In some cases it may be necessary to only use the string "scsi" (e.g. for the GT-6500).
de: Normalerweise werden SCSI-Scanner mit einer Zeile »scsi EPSON« in dieser Datei konfiguriert. In einigen Fällen könnte es notwendig sein, nur die Zeichenkette »scsi« zu verwenden (z.B. für den GT-6500).

source: B<PIO - Parallel Interface>
de: B<PIO - Parallelschnittstelle>

source: The parallel interface can be configured in two ways: An integer value starting at the beginning of a line will be interpreted as the IO address of the parallel port. To make it clearer that a configured IO address is a parallel port the port address can be preceded by the string "PIO". The PIO connection does not use a special device file in the I</dev> directory. The IO address can be specified in hex mode (prefixed with "0x").
de: Die Parallelschnittstelle kann auf zwei Arten konfiguriert werden: Ein Ganzzahlwert am Anfang der Zeile wird als E/A-Adresse des Parallel-Ports interpretiert. Um klarzustellen, dass eine konfigurierte E/A-Adresse ein Parallel-Port ist, kann der Port-Adresse die Zeichenkette »PIO« vorangestellt werden. Die PIO-Verbindung verwendet die besondere Gerätedatei im Verzeichnis I</dev> nicht. Die E/A-Adresse kann im Hexadezimalmodus (mit vorangestelltem »0x«) festgelegt werden.

source: For USB scanners not automatically detect, their VENDOR and PRODUCT ID can be specified manually in the config file. More information about valid syntax for USB devices can be found in B<sane-usb>(5).
de: Für nicht automatisch erkannte USB-Scanner kann ihre LIEFERANTEN- (VENDOR) und PRODUKTKENNUNG (PRODUCT ID) händisch in der Konfigurationsdatei festgelegt werden. Weitere Informationen über die gültige Syntax für USB-Geräte kann in B<sane-usb>(5) gefunden werden.

source: B<Network>
de: B<Netzwerk>

source: Network scanners can be auto-discovered if B<autodiscovery> is specified after B<net> keyword. An IP address to connect to can also be used.
de: Netzwerkscanner können automatisch erkannt werden, wenn B<autodiscovery> nach dem Schlüsselwort B<net> angegeben wird. Eine IP-Adresse kann ebenfalls zum Verbinden verwendet werden.

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: If the library was compiled with debug support enabled, this environment variable controls the SCSI related debug level for this backend. Only a value of 2 is supported.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die SCSI-bezogene Debug-Stufe für dieses Backend. Es wird nur der Wert 2 unterstützt.

source: If the library was compiled with debug support enabled, this environment variable controls the network related debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die netzwerkbezogene Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: This allows one to override the function or command level that the backend uses to communicate with the scanner. The function level a scanner supports is determined during the initialization of the device. If the backend does not recognize the function level reported by the scanner it will default to function level B3. Valid function levels are A1, A2, B1, B2, B3, B4, B5, B6, B7, B8, D1 and F5. Use this feature only if you know what you are doing!
de: Dies ermöglicht es Ihnen, die Funktions- oder Befehlsstufe, die das Backend für die Kommunikation mit dem Scanner verwendet, außer Kraft zu setzen. Die vom Scanner unterstützte Funktionsstufe wird während der Initialisierung des Gerätes ermittelt. Falls das Backend die vom Scanner gemeldete Funktionsstufe nicht erkennt, wird es die Funktionsstufe B3 verwenden. Gültige Funktionsstufen sind A1, A2, B1, B2, B3, B4, B5, B6, B7, B8, D1 und F5. Verwenden Sie diese Funktionalität nur, wenn Sie wissen, was Sie tun!

source: SEE ALSO
de: SIEHE AUCH

source: BUGS
de: FEHLER

source: None :-) At least none are currently known.
de: Keine :-) Zumindest sind gegenwärtig keine Fehler bekannt.

source: UNSUPPORTED DEVICES
de: NICHT UNTERSTÜTZTE GERÄTE

source: The backend may be used with Epson scanners that are not yet listed under the list of supported devices. A scanner that is not recognized may default to the function level B3, which means that not all functions that the scanner may be capable of are accessible.
de: Das Backend kann mit Epson-Scannern verwendet werden, die noch nicht unter der Liste der unterstützten Geräte aufgeführt sind. Ein nicht erkannter Scanner kann standardmäßig die Funktionsstufe B3 verwenden, was bedeutet, dass nicht alle vom Scanner ermöglichten Funktionen verfügbar sein könnten.
