Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-coolscan2.5.po
Languages: de

source: 11 Jul 2008
de: 11. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-coolscan2 - SANE backend for Nikon Coolscan film scanners
de: sane-coolscan2 - SANE-Backend für Coolscan-Filmscanner von Nikon

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-coolscan2> library implements a SANE (Scanner Access Now Easy) backend that provides access to Nikon Coolscan film scanners. Some functions of this backend should be considered B<beta-quality> software. Most functions have been stable for a long time, but of course new development can not and will not function properly from the very first day. Please report any strange behaviour to the maintainer of the backend.
de: Die Bibliothek B<sane-coolscan2> implementiert ein SANE-Backend (Scanner Access Now Easy), das den Zugriff auf Coolscan-Filmscanner von Nikon ermöglicht. Einige Funktionen dieses Backends sollten als Software im B<Beta-Stadium> betrachtet werden. Die meisten Funktionen sind bereits seit langer Zeit stabil, aber neue Entwicklungen können und werden natürlich nicht vom ersten Tag an korrekt funktionieren. Bitte melden Sie jedes ungewöhnliche Verhalten an den Betreuer des Backends.

source: At present, the following scanners are known to work with this backend:
de: Gegenwärtig sollten die folgenden Scanner mit diesem Backend funktionieren:

source: \f(CRModel: Connection Type --------------------------- ------------------- LS-30 (Coolscan III) SCSI LS-2000 SCSI LS-40 ED (Coolscan IV) USB LS-4000 ED IEEE 1394 LS-8000 ED IEEE 1394\fR
de: \f(CRModell: Verbindungstyp --------------------------- ------------------- LS-30 (Coolscan III) SCSI LS-2000 SCSI LS-40 ED (Coolscan IV) USB LS-4000 ED IEEE 1394 LS-8000 ED IEEE 1394\fR

source: Please send mail to the backend author (andras@users.sourceforge.net) to report successes or failures.
de: Bitte senden Sie eine E-Mail an den Autor des Backends (andras@users.sourceforge.net), um Erfolge oder Fehlschläge zu melden.

source: OPTIONS
de: OPTIONEN

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xscanimage>(1) or B<xsane>(1).
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: Valid command line options and their syntax can be listed by using:
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: scanimage --help -d coolscan2:E<lt>interfaceE<gt>:E<lt>deviceE<gt>
de: scanimage --help -d coolscan2:E<lt>SchnittstelleE<gt>:E<lt>GerätE<gt>

source: where E<lt>interfaceE<gt> and E<lt>deviceE<gt> specify the device in question, as in the configuration file (see next section). The B<-d> parameter and its argument can be omitted to obtain information on the first scanner identified. Use the command:
de: wobei E<lt>SchnittstelleE<gt> und E<lt>GerätE<gt> das gewünschte Gerät angeben, wie in der Konfigurationsdatei (siehe nächster Abschnitt). Der Parameter B<-d> und dessen Argument können weggelassen werden, um Informationen zum ersten identifizierten Scanner zu erhalten. Mit dem Befehl

source: to list all devices recognized by your SANE installation.
de: können Sie alle von Ihrer SANE-Installation erkannten Geräte auflisten.

source: The options should be fully described by the description or tooltips given by frontend. Here is a description of some of the most important options, in the syntax with which they must be supplied to B<scanimage>(1):
de: Die Optionen sollten in der Beschreibung oder den Tooltipps des Frontends vollständig erklärt sein. Es folgt eine Beschreibung einiger der wichtigsten Optionen in der Syntax, wie sie an B<scanimage>(1) übergeben werden muss:

source: This option specifies which frame to operate on, if a motorized film strip feeder or APS adapter are used. The frame number I<E<lt>nE<gt>> ranges from 1 to the number of frames available, which is sensed each time the backend is initialized (usually each time you start the frontend).
de: Diese Option gibt an, welches Bild verarbeitet werden soll, falls ein motorisierter Filmstreifeneinzug oder ein APS-Adapter verwendet werden. Die Bildnummer I<E<lt>nE<gt>> kann von 1 bis zur Anzahl der maximal verfügbaren Bilder angegeben werden, was bei jeder Initialisierung des Backends ermittelt wird (üblicherweise bei jedem Start des Frontends).

source: This option shifts the scan window by the specified amount (default unit is mm).
de: verschiebt den Scanbereich um den angegebenen Betrag (Vorgabeeinheit ist mm).

source: If set to "yes", the scanner will read the infrared channel, thus allowing defect removal in software. The infrared image is read during a second scan, with no options altered. The backend must not be restarted between the scans. If you use B<scanimage>(1), perform a batch scan with B<--batch-count=2> to obtain the IR information.
de: Falls auf »yes« gesetzt, wertet der Scanner den Infrarotkanal aus und ermöglicht so die softwareseitige Staub- und Kratzerentfernung. Das Infrarotbild wird in einem zweiten Scanvorgang ohne Änderung von Optionen erstellt. Das Backend darf zwischen den Scanvorgängen nicht neu gestartet werden. Falls Sie B<scanimage>(1) verwenden, wird ein Serienscan mit der Option B<--batch-count=2> ausgeführt, um die Infrarotinformationen zu gewinnen.

source: Here E<lt>nE<gt> can either be 8 or the maximum number of bits supported by the scanner (10, 12, or 14). It specifies whether or not the scanner reduces the scanned data to 8 bits before sending it to the backend. If 8 bits are used, some information and thus image quality is lost, but the amount of data is smaller compared to higher depths. Also, many imaging programs and image formats cannot handle depths greater than 8 bits.
de: Hierbei kann E<lt>nE<gt> entweder 8 oder die maximale Bittiefe sein, die der Scanner unterstützt (10, 12 oder 14). Die Option gibt an, ob der Scanner die eingescannten Daten auf 8 Bit reduzieren soll, bevor sie zum Backend übermittelt werden. Falls 8 Bit verwendet werden, gehen einige Informationen verloren, was sich auf die Bildqualität auswirkt, aber die Datenmenge gegenüber größeren Bittiefen verringert. Außerdem können viele Bildbearbeitungsprogramme und Bilddateiformate nicht mit Bittiefen größer als 8 umgehen.

source: Perform autofocus operation. Unless otherwise specified by the other options ( B<--focus-on-centre> and friends), focusing is performed on the centre of the selected scan area.
de: führt die automatische Fokussierung aus. Wenn nicht anderweitig durch entsprechende Optionen angegeben (B<--focus-on-centre> usw.), wird auf die Mitte des ausgewählten Scanbereichs fokussiert.

source: Perform a pre-scan to calculate exposure values automatically. B<--ae-wb> will maintain the white balance, while B<--ae> will adjust each channel separately.
de: führt einen Vorschauscan aus, um die Belichtungswerte automatisch zu ermitteln. B<--ae-wb> führt den Weißabgleich aus, während B<--ae> lediglich jeden Farbkanal separat anpasst.

source: Multiply all exposure times with this value. This allows exposure correction without modifying white balance.
de: multipliziert alle Belichtungszeiten mit diesem Wert. Dies ermöglicht Belichtungskorrekturen ohne Beeinflussung des Weißabgleichs.

source: Load the next slide when using the slide loader (applies only to the SF-200 bulk feeder).
de: lädt das nächste Dia (nur mit dem Diazuführungsadapter SF-200).

source: Eject the film strip or mounted slide when using the slide loader.
de: wirft den Filmstreifen oder, wenn die Diazuführung verwendet wird, das eingelegte Dia aus.

source: Reset scanner. The scanner will perform the same action as when power is turned on: it will eject the film strip (with the SF-200 bulk feeder) and calibrate itself. Use this whenever the scanner refuses to load a film strip properly, as a result of which B<--eject> does not work.
de: setzt den Scanner zurück. Der Scanner führt die gleichen Aktionen wie beim Einschalten aus: Der Filmstreifen wird ausgeworfen und der Scanner führt die Kalibrierung aus. Verwenden Sie diese Option, wenn der Scanner den Filmstreifen nicht korrekt einzieht und auch B<--eject> nicht funktioniert.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/coolscan2.conf> specifies the device(s) that the backend will use. Owing to the nature of the supported connection types SCSI, USB, and IEEE 1394, the default configuration file supplied with the SANE distribution should work without being edited.
de: Die Konfigurationsdatei I</etc/sane.d/coolscan2.conf> gibt das Gerät oder die Geräte an, die das Backend verwenden wird. Aufgrund der Art der unterstützten Verbindungstypen SCSI, USB und IEEE 1394 sollte die mit der SANE-Distribution gelieferte Standard-Konfigurationsdatei ohne Anpassungen funktionieren.

source: Each line in the configuration file is either of the following, where all entries are case-sensitive:
de: Jede Zeile in der Konfigurationsdatei ist von einer der folgenden Arten, wobei für alle Einträge die Groß- oder Kleinschreibung beachtet wird:

source: I<blank or starting with a '#' character>
de: I<leer oder mit einem »#« beginnend>

source: These lines are ignored, thus '#' can be used to include comments.
de: Diese Zeilen werden ignoriert, so dass »#« zum Einfügen von Kommentaren verwendet werden kann.

source: I<containing only the word "auto">
de: I<enthält nur das Wort »auto«>

source: This instructs the backend to probe for a scanner by scanning the buses for devices with known identifiers. This is the default action when no configuration file is present.
de: Hiermit wird das Backend angewiesen, auf den Bussen nach Scannern mit bekannten Bezeichnern zu suchen. Dies ist die Vorgabeaktion, falls es keine Konfigurationsdatei gibt.

source: I<a line of the form E<lt>interfaceE<gt>:E<lt>deviceE<gt>>
de: I<eine Zeile der Form E<lt>SchnittstelleE<gt>:E<lt>GerätE<gt>>

source: Here E<lt>interfaceE<gt> can be one of "scsi" or "usb", and E<lt>deviceE<gt> is the device file of the scanner. Note that IEEE 1394 devices are handled by the SBP-2 module in the kernel and appear to SANE as SCSI devices.
de: Hier kann die E<lt>SchnittstelleE<gt> entweder »scsi« oder »usb« sein und E<lt>GerätE<gt> bezeichnet die Gerätedatei des Scanners. Beachten Sie, dass IEEE-1394-Geräte vom SBP-2-Modul im Kernel verwaltet werden, so dass Sie für SANE als SCSI-Geräte erscheinen.

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: Configuration file for this backend, read each time the backend is initialized.
de: Die Konfigurationsdatei für dieses Backend, die bei jeder Initialisierung des Backends gelesen wird.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: SEE ALSO
de: SIEHE AUCH

source: BUGS
de: FEHLER

source: Currently, the SANE protocol does not allow automatically updating options whenever the hardware changes. Thus the number of choices for the B<--frame> option will be fixed when the backend is initialized (usually when the user runs the frontend). In particular, if there is no film strip in the automatic film strip feeder when the backend is initialized, the B<--frame> option will not appear at all. Also, restarting the frontend after swapping film adapters is strongly recommended.
de: Derzeit ermöglicht es das SANE-Protokoll nicht, bei Änderungen der Hardware die Optionen automatisch anzupassen. Daher sind die Wahlmöglichkeiten für die Option B<--frame> festgelegt, wenn das Backend initialisiert ist (üblicherweise dann, wenn der Benutzer das Frontend startet). Wenn insbesondere bei der Initialisierung des Backends kein Filmstreifen in die automatische Zuführung eingelegt ist, steht die Option B<--frame> nicht zur Verfügung. Außerdem wird nach dem Wechsel des Filmadapters ein Neustart des Frontends dringend empfohlen.

source: Linux kernels prior to 2.4.19 had a patch that truncated INQUIRY data from IEEE 1394 scanners to 36 bytes, discarding vital information about the scanner. The IEEE 1394 models therefore only work with 2.4.19 or later.
de: Linux-Kernel in Versionen vor 2.4.19 hatten einen Patch, der die INQUIRY-Informationen von IEEE-1394-Scannern auf 36 Byte kürzte, wodurch wichtige Informationen über den Scanner verloren gingen. Die IEEE-1394-Modelle funktionieren daher nur mit der Kernelversion 2.4.19 oder neuer.

source: No real bugs currently known, please report any to the backend maintainer or the SANE developers' email list.
de: Derzeit sind keine wirklichen Fehler bekannt. Melden Sie auftretende Fehler an den Betreuer des Backends oder an die Mailingliste der SANE-Entwickler.

source: AUTHORS
de: AUTOREN

source: The backend is written and maintained by Andr\['a]s Major I<E<lt>andras@users.sourceforge.netE<gt>>.
de: Das Backend wurde von Andr\['a]s Major I<E<lt>andras@users.sourceforge.netE<gt>> geschrieben und wird von ihm betreut.

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in xscanimage or xsane.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: where E<lt>interfaceE<gt> and E<lt>deviceE<gt> specify the device in question, as in the configuration file (see next section). The -d parameter and its argument can be omitted to obtain information on the first scanner identified. Use the command
de: wobei E<lt>SchnittstelleE<gt> und E<lt>GerätE<gt> das gewünschte Gerät angeben, wie in der Konfigurationsdatei (siehe nächster Abschnitt). Der Parameter B<-d> und dessen Argument können weggelassen werden, um Informationen zum ersten identifizierten Scanner zu erhalten. Mit dem Befehl

source: The options should be fully described by the description or tooltips given by frontend. Here is a description of some of the most important options, in the syntax with which they must be supplied to scanimage:
de: Die Optionen sollten in der Beschreibung oder den Tooltipps des Frontends vollständig erklärt sein. Es folgt eine Beschreibung einiger der wichtigsten Optionen in der Syntax, wie sie an B<scanimage>(1) übergeben werden muss:

source: If set to "yes", the scanner will read the infrared channel, thus allowing defect removal in software. The infrared image is read during a second scan, with no options altered. The backend must not be restarted between the scans. If you use scanimage, perform a batch scan with batch-count=2 to obtain the IR information.
de: Falls auf »yes« gesetzt, wertet der Scanner den Infrarotkanal aus und ermöglicht so die softwareseitige Staub- und Kratzerentfernung. Das Infrarotbild wird in einem zweiten Scanvorgang ohne Änderung von Optionen erstellt. Das Backend darf zwischen den Scanvorgängen nicht neu gestartet werden. Falls Sie B<scanimage>(1) verwenden, wird ein Serienscan mit der Option B<--batch-count=2> ausgeführt, um die Infrarotinformationen zu gewinnen.

source: Perform autofocus operation. Unless otherwise specified by the other options ( I<--focus-on-centre> and friends), focusing is performed on the centre of the selected scan area.
de: führt die automatische Fokussierung aus. Wenn nicht anderweitig durch entsprechende Optionen angegeben (I<--focus-on-centre> usw.), wird auf die Mitte des ausgewählten Scanbereichs fokussiert.

source: Perform a pre-scan to calculate exposure values automatically. I<--ae-wb> will maintain the white balance, while I<--ae> will adjust each channel separately.
de: führt einen Vorschauscan aus, um die Belichtungswerte automatisch zu ermitteln. I<--ae-wb> führt den Weißabgleich aus, während I<--ae> lediglich jeden Farbkanal separat anpasst.

source: Load the next slide when using the slide loader.
de: lädt bei der Verwendung der Diazuführung das nächste Dia.

source: Reset scanner. The scanner will perform the same action as when power is turned on: it will eject the film strip and calibrate itself. Use this whenever the scanner refuses to load a film strip properly, as a result of which I<--eject> does not work.
de: setzt den Scanner zurück. Der Scanner führt die gleichen Aktionen wie beim Einschalten aus: Der Filmstreifen wird ausgeworfen und der Scanner führt die Kalibrierung aus. Verwenden Sie diese Option, wenn der Scanner den Filmstreifen nicht korrekt einzieht und auch I<--eject> nicht funktioniert.

source: The configuration file /etc/sane.d/coolscan2.conf specifies the device(s) that the backend will use. Owing to the nature of the supported connection types SCSI, USB, and IEEE 1394, the default configuration file supplied with the SANE distribution should work without being edited.
de: Die Konfigurationsdatei /etc/sane.d/coolscan2.conf gibt das Gerät oder die Geräte an, die das Backend verwenden wird. Aufgrund der Art der unterstützten Verbindungstypen SCSI, USB und IEEE 1394 sollte die mit der SANE-Distribution gelieferte Standard-Konfigurationsdatei ohne Anpassungen funktionieren.

source: This instructs the backend to probe for a scanner by scanning the buses for devices with know identifiers. This is the action taken when no configuration file is present.
de: Hiermit wird das Backend angewiesen, auf den Bussen nach Scannern mit bekannten Bezeichnern zu suchen. Dies ist die Vorgabeaktion, falls es keine Konfigurationsdatei gibt.

source: sane-scsi(5), sane-usb(5), scanimage(1), xscanimage(1), xsane(1)
de: B<sane-scsi>(5), B<sane-usb>(5), B<scanimage>(1), B<xscanimage>(1), B<xsane>(1)

source: Currently, the SANE protocol does not allow automatically updating options whenever the hardware changes. Thus the number of choices for the B<--frame> option will be fixed when the backend is initialized (usually when the user runs the frontend). In particular, if there is no film strip in the automatic film strip feeder when the backend is initialized, the frame option will not appear at all. Also, restarting the frontend after swapping film adapters is strongly recommended.
de: Derzeit ermöglicht es das SANE-Protokoll nicht, bei Änderungen der Hardware die Optionen automatisch anzupassen. Daher sind die Wahlmöglichkeiten für die Option B<--frame> festgelegt, wenn das Backend initialisiert ist (üblicherweise dann, wenn der Benutzer das Frontend startet). Wenn insbesondere bei der Initialisierung des Backends kein Filmstreifen in die automatische Zuführung eingelegt ist, steht die Option B<--frame> nicht zur Verfügung. Außerdem wird nach dem Wechsel des Filmadapters ein Neustart des Frontends dringend empfohlen.

source: The backend is written and maintained by Andr\['a]s Major (andras@users.sourceforge.net).
de: Das Backend wurde von Andr\['a]s Major (andras@users.sourceforge.net) geschrieben und wird von ihm betreut.

source: If set to "yes", the scanner will read the infrared channel, thus allowing defect removal in software. The infrared image is read during a second scan, with no options altered. The backend must not be restarted between the scans. If you use B<scanimage>(1), perform a batch scan with B<batch-count=2> to obtain the IR information.
de: Falls auf »yes« gesetzt, wertet der Scanner den Infrarotkanal aus und ermöglicht so die softwareseitige Staub- und Kratzerentfernung. Das Infrarotbild wird in einem zweiten Scanvorgang ohne Änderung von Optionen erstellt. Das Backend darf zwischen den Scanvorgängen nicht neu gestartet werden. Falls Sie B<scanimage>(1) verwenden, wird ein Serienscan mit der Option B<--batch-count=2> ausgeführt, um die Infrarotinformationen zu gewinnen.

source: Reset scanner. The scanner will perform the same action as when power is turned on: it will eject the film strip and calibrate itself. Use this whenever the scanner refuses to load a film strip properly, as a result of which B<--eject> does not work.
de: setzt den Scanner zurück. Der Scanner führt die gleichen Aktionen wie beim Einschalten aus: Der Filmstreifen wird ausgeworfen und der Scanner führt die Kalibrierung aus. Verwenden Sie diese Option, wenn der Scanner den Filmstreifen nicht korrekt einzieht und auch B<--eject> nicht funktioniert.
