Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-scsi.5.po
Languages: de

source: Under Solaris, OpenStep and NeXTStep, the generic SCSI device name refers to a SCSI bus, not to an individual device. For example, I</dev/sg0> refers to the first SCSI bus. To tell SANE which device to use, append the character 'a'+target-id to the special device name. For example, the SCSI device connected to the first SCSI controller and with target-id 0 would be called I</dev/sg0a>, and the device with target-id 1 on that same bus would be called I</dev/sg0b,> and so on.
de: Unter Solaris, OpenStep und NeXTStep bezieht sich der generische SCSI-Gerätename auf einen SCSI-Bus, nicht ein individuelles Gerät. Beispielsweise bezieht sich I</dev/sg0> auf den ersten SCSI-Bus. Um SANE mitzuteilen, welches Gerät verwendet werden soll, hängen Sie das Zeichen »a«+Zielkennung an den besonderen Gerätenamen an. Das SCSI-Gerät, das am ersten SCSI-Controller mit der Zielgerätekennung 0 hängt, würde beispielsweise I</dev/sg0a> genannt werden und das Gerät mit der Zielgerätekennung 1 auf dem gleichen Bus würde I</dev/sg0b> genannt werden und so weiter.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for the generic SCSI I/O subsystem. E.g., a value of 128 requests all debug output to be printed by the backend. A value of 255 also prints kernel messages from the SCSI subsystem (where available). Smaller levels reduce verbosity.
de: Falls die Bibliothek mit aktivierter Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für das generische SCSI-E/A-Subsystem. Ein Wert von 128 fordert beispielsweise, dass sämtliche Debug-Ausgabe vom Backend dargestellt wird. Ein Wert von 255 gibt auch die Kernelnachrichten vom SCSI-Subsystem aus (soweit verfügbar). Kleinere Stufen reduzieren die Ausführlichkeit.

source: sets the timeout value for SCSI commands in seconds. Overriding the default value of 120 seconds should only be necessary for very slow scanners.
de: setzt den Zeitüberschreitungswert für SCSI-Befehle in Sekunden. Nur bei sehr langsamen Scannern sollte das Außerkraftsetzen des Vorgabewertes von 120 Sekunden notwendig sein.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: For scanners with a SCSI interface, it may be necessary to edit the appropriate backend configuration file before using SANE for the first time. For most systems, the configuration file should list the name of the generic SCSI device that the scanner is connected to (e.g., under Linux, B</dev/sg4> or B</dev/sge> is such a generic SCSI device). It is customary to create a symlink from B</dev/scanner> to the generic SCSI device that the scanner is connected to. In this case, the configuration file simply lists the line B</dev/scanner>. For a detailed description of each backend's configuration file, please refer to the relevant backend manual page (e.g., B<sane-epson>(5) for Epson scanners, B<sane-hp>(5) for HP scanners, etc.).
de: Für Scanner mit einer SCSI-Schnittstelle kann es notwendig sein, die geeignete Backend-Konfigurationsdatei zu bearbeiten, bevor SANE erstmalig verwendet wird. Für die meisten Systeme sollte die Konfigurationsdatei die Namen der generischen SCSI-Geräte aufführen, mit denen der Scanner verbunden ist (z.B. ist unter Linux I</dev/sg4> oder I</dev/sge> ein solches generisches SCSI-Gerät). Es ist üblich, einen Symlink von I</dev/scanner> auf das generische SCSI-Gerät zu erstellen, mit dem der Scanner verbunden ist. In diesem Fall führt die Konfigurationsdatei einfach die Zeile I</dev/scanner> auf. Für eine detaillierte Beschreibung der Backend-Konfigurationsdateien schauen Sie bitte in die Handbuchseite des relevanten Backends (z.B. B<sane-epson>(5) für Epson-Scanner, B<sane-hp>(5) für HP-Scanner usw.).

source: where I<VENDOR> is the SCSI vendor string, I<MODEL> is the SCSI model string, I<TYPE> is type SCSI device type string, I<BUS> is the SCSI bus number (named "host" in /proc/scsi/scsi), I<CHANNEL> is the SCSI channel number, I<ID> is the SCSI id, and I<LUN> is the logical unit number of the scanner device. The first two fields are strings which must be enclosed in double-quotes if they contain any whitespace. The remaining four fields are non-negative integer numbers. The correct values for these fields can be found by using operating system specific tools, e.g. for Linux by looking at the output of the command "cat /proc/scsi/scsi". To simplify configuration, a field's value can be replaced with an asterisk symbol (``*''). An asterisk has the effect that any value is allowed for that particular field. This can have the effect that a single scsi-line matches multiple devices. When this happens, each matching device will be probed by the backend one by one and registered if the backend thinks it is a compatible device. For example, the line
de: wobei I<LIEFERANT> die Zeichenkette mit dem SCSI-Lieferanten, I<MODELL> ist die SCSI-Modellbezeichnungs-Zeichenkette, I<TYP> ist die SCSI-Gerätetypzeichenkette, I<BUS> ist die SCSI-Bus-Nummer (genannt »host« in I</proc/scsi/scsi>), I<KANAL> ist die SCSI-Kanalnummer, I<KENNUNG> ist die SCSI-Kennung und I<LUN> ist die logische Einheitennummer des Scanner-Geräts. Die ersten zwei Felder sind Zeichenketten, die in doppelten englischen Anführungszeichen eingeschlossen werden müssen, falls sie Leerraumzeichen enthalten. Die verbleibenden vier Felder sind nicht-negative Ganzzahlen. Die korrekten Werte für diese Felder können mit betriebssystemspezifischen Werkzeugen ermittelt werden, z.B. für Linux durch Prüfen der Ausgabe des Befehls I<cat /proc/scsi/scsi>. Um die Konfiguration zu erleichtern, kann der Wert eines Feldes durch ein Sternsymbol (»*«) ersetzt werden. Ein Stern hat den Effekt, dass für dieses bestimmte Feld jeder Wert erlaubt ist. Dies kann dazu führen, dass eine einzelne SCSI-Zeile auf mehrere Geräte passt. Wenn dies passiert, wird nacheinander jedes passende Gerät durch das Backend geprüft und registriert, falls das Backend glaubt, dass dies ein kompatibles Gerät ist. Die Zeile

source: When using a SCSI scanner, ensure that the access permission for the generic SCSI device is set appropriately. We recommend to add a group "scanner" to /etc/group which contains all users that should have access to the scanner. The permission of the device should then be set to allow group read and write access. For example, if the scanner is at generic SCSI device B</dev/sg0>, then the following two commands would set the permission correctly:
de: Beim Einsatz von SCSI-Scannern stellen Sie sicher, dass die Zugriffsberechtigungen für das generische SCSI-Gerät geeignet gesetzt sind. Wir empfehlen, eine Gruppe »scanner« zu I</etc/group> hinzuzufügen, die alle Benutzer enthält, die Zugriff auf den Scanner haben sollen. Die Berechtigungen für das Gerät sollten dann so gesetzt werden, dass sie der Gruppe Lese- und Schreibzugriff erlauben. Falls der Scanner beispielsweise das generische SCSI-Gerät I</dev/sg0> ist, dann würden die folgenden zwei Befehle die Berechtigungen korrekt setzen:

source: When your system uses the device filesystem (devfs), you have to edit B</etc/devfs/perms.> There you should search the line
de: Wenn Ihr System das Gerätedateisystem (devfs) verwendet, müssen Sie B</etc/devfs/perms> bearbeiten. Dort müssen Sie nach der Zeile

source: Auto-configuration using the "scsi *" lines in the config files only works if the user running the frontend has read/write access to /dev/xpt0. Instead, you can also set a link I</dev/scanner> to the appropriate /dev/uk device.
de: Die automatische Konfiguration mittels der Zeilen »scsi *« in den Konfigurationsdateien funktioniert nur, falls der Benutzer, der die Oberfläche ausführt, Lese-/Schreibzugriff auf I</dev/xpt0> hat. Sie können stattdessen auch einen Link I</dev/scanner> auf das geeignete Gerät I</dev/uk> setzen.

source: Works on FreeBSD 2.2.5R and 3.0 using the B<aic> driver, provided that Plug-and-Play support is disabled on the card. If there are no I<uk> devices, just do a ``sh MAKEDEV uk0'' in the B</dev> directory. The scanner should then be accessible as B</dev/uk0 if it was probed> during boot.
de: Funktioniert unter FreeBSD 2.2.5R und 3.0 mittels des Treibers B<aic>, vorausgesetzt, dass die Unterstützung für »Plug-and-Play« für die Karte deaktiviert ist. Falls es keine I<uk>-Geräte gibt, führen Sie einfach ein I<sh MAKEDEV uk0> in dem Verzeichnis B</dev> durch. Auf den Scanner sollte dann über I</dev/uk0> zugegriffen werden können, so, als ob er während des Systemstarts erkannt worden wäre.

source: First, make sure your kernel has SCSI generic support enabled. In ``make xconfig'', this shows up under ``SCSI support-E<gt>SCSI generic support''.
de: Als erstes stellen Sie bitte sicher, dass die generische SCSI-Unterstützung im Kernel aktiviert ist. In I<make xconfig> taucht dies unter »SCSI support-E<gt>SCSI generic support« auf.

source: To keep scanning times to a minimum, it is strongly recommended to use a large buffer size for the generic SCSI driver. From SG driver version 2.0 on, the maximum buffer size can be changed at program run time, and there is no restriction in size. This driver version is part of the Linux kernels from version 2.2.7 on. If the new SG driver is available some backends (e.g. sane-umax, sane-mustek, sane-sharp) automatically request larger scsi buffers. If a backend does not automatically request a larger scsi buffer, set the environment variable B<SANE_SG_BUFFERSIZE> to the desired buffer size in bytes. It is not recommended to use more than 1 MB, because for large values the probability increases that the SG driver cannot allocate the necessary buffer(s). For ISA cards, even 1 MB might be a too large value. For a detailed discussion of memory issues of the SG driver, see http://www.torque.net/sg.
de: Um Scanzeiten zu minimieren, wird nachdrücklich empfohlen, einen großen Puffer für den generischen SCSI-Treiber zu verwenden. Seit SG-Treiber Version 2.0 kann die Puffergröße zur Laufzeit verändert werden und es gibt keine Größenbeschränkung. Diese Treiberversion ist seit Version 2.2.7 Teil des Linux-Kernels. Falls der neuere SG-Treiber verfügbar ist, erbitten einige Backends (z.B. B<sane-umax>(5), B<sane-mustek>(5), B<sane-sharp>(5)) automatisch größere Puffergrößen. Falls ein Backend nicht automatisch einen größeren SCSI-Puffer anfordert, setzen Sie die Umgebungsvariable B<SANE_SG_BUFFERSIZE> auf die gewünschte Puffergröße in Byte. Es wird nicht empfohlen, mehr als 1 Megabyte zu verwenden, da für größere Werte die Wahrscheinlichkeit zunimmt, dass der SG-Treiber den/die notwendigen Puffer nicht reservieren kann. Für ISA-Karten kann selbst 1 MB ein zu großer Wert sein. Für eine detaillierte Beschreibung von Speicherproblemen des SG-Treibers lesen Sie I<http://www.torque.net/sg>.

source: A common issue with SCSI scanners is what to do when you booted the system while the scanner was turned off? In such a case, the scanner won't be recognized by the kernel and SANE won't be able to access it. Fortunately, Linux provides a simple mechanism to probe a SCSI device on demand. Suppose you have a scanner connected to SCSI bus 2 and the scanner has a SCSI id of 5. When the system is up and running and the scanner is turned on, you can issue the command:
de: Ein häufiges Problem bei SCSI-Scannern besteht darin, was Sie machen müssen, wenn Sie Ihr System gestartet haben, während der Scanner ausgeschaltet war? In diesem Fall wird der Scanner nicht vom Kernel erkannt und SANE ist nicht in der Lage, darauf zuzugreifen. Glücklicherweise stellt Linux einen einfachen Mechanismus bereit, um bei Bedarf nach SCSI-Geräten zu suchen. Nehmen wir an, Ihr Scanner hängt an SCSI-Bus 2 und der Scanner hat die SCSI-Kennung 5. Wenn das System hochgefahren ist und der Scanner eingeschaltet ist, können Sie folgenden Befehl eingeben:

source: Some old versions of the kernel driver (atp870u.c) cut the inquiry information. Therefore the scanner couldn't be detected correctly. Use a current kernel.
de: Einige alte Versionen des Kerneltreibers (I<atp870u.c>) schnitten die Abfrageinformationen ab. Daher konnte der Scanner nicht korrekt erkannt werden. Verwenden Sie einen aktuellen Kernel.

source: This card is supplied by Mustek (and other vendors). It's supported since Linux 2.2. The SCSI cards are supported by the module g_NCR5380. It's necessary to tell the kernel the io port and type of card. Example for a 53c400a: ``modprobe g_NCR5380 ncr_addr=0x280 ncr_53c400a=1''. Once the kernel detects the card, it should work all right. However, while it should work, do not expect good performance out of this card---it has no interrupt line and therefore while a scan is in progress, the system becomes almost unusable. You may change the values of the USLEEP macros in drivers/scsi/g_NCR5380.c. Some documentation is in this file and NCR5380.c.
de: Diese Karte wird von Mustek (und anderen Lieferanten) bereitgestellt. Sie wird seit Linux 2.2 unterstützt. Die SCSI-Karten werden von dem Modul »g_NCR5380« unterstützt. Es ist notwendig, dem Kernel den E/A-Port und den Typ der Karte mitzuteilen. Beispiel für ein 53c400a: I<modprobe g_NCR5380 ncr_addr=0x280 ncr_53c400a=1>. Sobald der Kernel die Karte erkennt, sollte alles korrekt funktionieren. Obwohl alles funktioniert, erwarten Sie keine gute Leistung von dieser Karte. Sie verfügt über keine Interrupt-Leitung und daher wird das System fast unbenutzbar, während der Scan läuft. Sie können den Wert des Makros USLEEP in I<drivers/scsi/g_NCR5380.c> ändern. Etwas Dokumentation befindet sich in dieser Datei und in I<NCR5380.c>.

source: For Linux kernels before 2.0.33 it may be necessary to increase the SCSI timeout. The default timeout for the Linux kernels before 2.0.33 is 10 seconds, which is way too low when scanning large area. If you get messages of the form ``restart (ncr dead ?)'' in your /var/log/messages file or on the system console, it's an indication that the timeout is too short. In this case, find the line ``if (np-E<gt>latetimeE<gt>10)'' in file ncr53c8xx.c (normally in directory /usr/src/linux/drivers/scsi) and change the constant 10 to, say, 60 (one minute). Then rebuild the kernel/module and try again.
de: Für Linux-Kernel vor 2.0.33 kann es notwendig sein, die SCSI-Zeitüberschreitung zu erhöhen. Die Vorgabezeitüberschreitung für Linux-Kernel vor 2.0.33 ist 10 Sekunden, was für das Scannen großer Bereiche zu klein ist. Falls Sie Nachrichten der Form »restart (ncr dead ?)« in Ihrer Datei I</var/log/messages> oder auf der System-Konsole erhalten, ist das ein Anzeichen, dass die Zeitüberschreitung zu klein ist. In diesem Fall, suchen Sie die Zeile »if (np-E<gt>latetimeE<gt>10)« in der Datei I<ncr53c8xx.> (normalerweise im Verzeichnis I</usr/src/linux/drivers/scsi>) und ändern die Konstante auf beispielsweise 60 (eine Minute). Dann bauen Sie das Kernelmodul neu und versuchen es erneut.

source: The driver can be downloaded from http://www.garloff.de/kurt/linux/dc395/. For some older scanners it may be necessary to disable all the more advanced features by using e.g. modprobe dc395x_trm dc395x_trm=7,5,1,32.
de: Der Treiber kann von I<http://www.garloff.de/kurt/linux/dc395/> heruntergeladen werden. Für einige ältere Scanner kann es notwendig sein, sämtliche fortgeschrittene Funktionalitäten zu deaktivieren, beispielsweise mittels I<modprobe dc395x_trm dc395x_trm=7,5,1,32>.

source: Under Solaris, OpenStep and NeXTStep, the generic SCSI device name refers to a SCSI bus, not to an individual device. For example, B</dev/sg0> refers to the first SCSI bus. To tell SANE which device to use, append the character 'a'+target-id to the special device name. For example, the SCSI device connected to the first SCSI controller and with target-id 0 would be called B</dev/sg0a>, and the device with target-id 1 on that same bus would be called B</dev/sg0b,> and so on.
de: Unter Solaris, OpenStep und NeXTStep bezieht sich der generische SCSI-Gerätename auf einen SCSI-Bus, nicht ein individuelles Gerät. Beispielsweise bezieht sich I</dev/sg0> auf den ersten SCSI-Bus. Um SANE mitzuteilen, welches Gerät verwendet werden soll, hängen Sie das Zeichen »a«+Zielkennung an den besonderen Gerätenamen an. Das SCSI-Gerät, das am ersten SCSI-Controller mit der Zielgerätekennung 0 hängt, würde beispielsweise I</dev/sg0a> genannt werden und das Gerät mit der Zielgerätekennung 1 auf dem gleichen Bus würde I</dev/sg0b> genannt werden und so weiter.

source: When your system uses the device filesystem (devfs), you have to edit
de: Wenn Ihr System das Gerätedateisystem (devfs) verwendet, müssen Sie die Datei

source: There you should search the line
de: bearbeiten und dort nach der Zeile

source: Works on FreeBSD 2.2.5R and 3.0 using the B<aic> driver, provided that Plug-and-Play support is disabled on the card. If there are no I<uk> devices, just do a I<sh MAKEDEV uk0> in the
de: Funktioniert unter FreeBSD 2.2.5R und 3.0 mittels des Treibers B<aic>, vorausgesetzt, dass die Unterstützung für »Plug-and-Play« für die Karte deaktiviert ist. Falls es keine I<uk>-Geräte gibt, führen Sie einfach ein I<sh MAKEDEV uk0> in dem

source: directory. The scanner should then be accessible as I</dev/uk0> if it was probed during boot.
de: Verzeichnis durch. Auf den Scanner sollte dann über I</dev/uk0> zugegriffen werden können, so, als ob er während des Systemstarts erkannt worden wäre.
