Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-fujitsu.5.po
Languages: de

source: 13 Feb 2021
de: 13. Februar 2021

source: NAME
de: BEZEICHNUNG

source: sane-fujitsu - SANE backend for Fujitsu flatbed and ADF scanners
de: sane-fujitsu - SANE-Backend für Flachbett- und ADF-Scanner von Fujitsu

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-fujitsu> library implements a SANE (Scanner Access Now Easy) backend which provides access to most Fujitsu flatbed and ADF scanners.
de: Die Bibliothek B<sane-fujitsu> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die meisten Fujitsu-Flachbett- und -ADF-Scanner.

source: This document describes backend version 137, which shipped with SANE 1.0.32.
de: Dieses Dokument beschreibt Backend-Version 137, die mit SANE 1.0.32 ausgeliefert wurde.

source: SUPPORTED HARDWARE
de: UNTERSTÜTZTE HARDWARE

source: This version supports every known model which speaks the Fujitsu SCSI and SCSI-over-USB protocols. Specifically, the SCSI M309x and M409x series, the SCSI fi-series, most of the USB fi-series, the USB ScanSnap S5xx/S15xx, and the USB iX1xx/5xx series scanners are supported. Please see the list at I<http://www.sane-project.org/sane-supported-devices.html> for details.
de: Diese Version unterstützt jedes bekannte Modell, das die Fujitsu-SCSI- und -SCSI-über-USB-Protokolle verwendet. Insbesondere werden die Serie SCSI M309x und M409x, die SCSI fi-Serie, die meisten der USB fi-Serie, der USB ScanSnap S5xx/S15xx und die Scanner der Serie USB iX1xx/5xx unterstützt. Bitte schauen Sie auf die Liste unter I<http://www.sane-project.org/sane-supported-devices.html> für Details.

source: This backend may support other Fujitsu scanners. The best way to determine level of support is to test the scanner directly, or to collect a trace of the windows driver in action. Please contact the author for help or with test results.
de: Dieses Backend könnte weitere Fujitsu-Scanner unterstützen. Die beste Art, den Grad der Unterstützung zu ermitteln, ist den Scanner direkt zu testen oder einen Datenmitschnitt des laufenden Windows-Treibers einzusammeln. Bitte nehmen Sie mit dem Autor für Hilfe oder mit Testergebnissen (auf Englisch) Kontakt auf.

source: UNSUPPORTED HARDWARE
de: NICHT UNTERSTÜTZTE HARDWARE

source: The following scanners are known NOT to work with this backend, either because they have a non-fujitsu chipset, or an unsupported interface type. Some of these scanners may be supported by another backend.
de: Die folgenden Scanner funktionieren bekanntermaßen NICHT mit diesem Backend, entweder weil sie einen Chipsatz haben, der nicht von Fujitsu stammt oder weil sie einen nicht unterstützten Schnittstellentyp haben. Einige dieser Scanner könnten von einem anderen Backend unterstützt werden.

source: \f(CR-------------------------------------- SCSI: SERIAL: USB: ------------ ------------ ------------ ScanStation M3093E/DE/EX fi-4110EOX/2 ScanPartner M3096EX fi-4010CU SP-Jr M3097E+/DE S300/S300M SP-10/10C M3099A/EH/EX S1300/S1100 SP-15C/300C fi-60F/65F SP-600C/620C fi-5015C SP-2x/3x\fR
de: \f(CR-------------------------------------- SCSI: SERIELL: USB: ------------ ------------ ------------ ScanStation M3093E/DE/EX fi-4110EOX/2 ScanPartner M3096EX fi-4010CU SP-Jr M3097E+/DE S300/S300M SP-10/10C M3099A/EH/EX S1300/S1100 SP-15C/300C fi-60F/65F SP-600C/620C fi-5015C SP-2x/3x\fR

source: OPTIONS
de: OPTIONEN

source: Effort has been made to expose all hardware options, including:
de: Es wurde versucht, alle Hardware-Optionen offenzulegen, einschließlich:

source: B<source s>
de: B<source> I<s>

source: Selects the source for the scan. Options may include "Flatbed", "ADF Front", "ADF Back", "ADF Duplex", "Card Front", "Card Back", "Card Duplex".
de: wählt die Scan-Quelle. Optionen können »Flatbed«, »ADF Front«, »ADF Back«, »ADF Duplex«, »Card Front«, »Card Back« und »Card Duplex« sein.

source: Selects the mode for the scan. Options may include "Lineart", "Halftone", "Gray", and "Color".
de: wählt den Scanmodus. Optionen können »Lineart«, »Halftone«, »Gray« und »Color« sein.

source: Controls scan resolution. Setting B<--resolution> also sets B<--y-resolution,> though this behavior is overridden by some frontends.
de: steuert die Scan-Auflösung. Setzen von B<--resolution> setzt auch B<--y-resolution>, allerdings wird dieses Verhalten von einigen Oberflächen außer Kraft gesetzt.

source: Sets scan area upper left and lower right coordinates. These are renamed B<t, l, x, y> by some frontends.
de: setzt die oberen linken und unteren rechten Koordinaten des Scan-Bereiches. Diese werden durch einige Oberflächen in B<t, l, x, y> umbenannt.

source: Sets paper size. Used by scanner to determine centering of scan coordinates when using the ADF (Automatic Document Feeder) and to detect double feed errors.
de: setzt die Papiergröße. Wird von Scannern verwendet, um beim Einsatz des automatischen Dokumenteneinzugs (ADF) die Zentrierung der Scan-Koordinaten zu bestimmen und zu erkennen, ob mehrere Seiten gleichzeitig eingezogen wurden.

source: Other options will be available based on the capabilities of the scanner: machines with IPC or DTC will have additional enhancement options, those with CMP will have compression options, those with a printer will have a group of endorser options.
de: Weitere Optionen sind verfügbar, abhängig von den Fähigkeiten des Scanners: Maschinen mit IPC oder DTC werden zusätzliche Verbesserungsoptionen haben, solche mit CMP werden Komprimierungsoptionen haben, solche mit einem Drucker werden eine Gruppe von Markiereroptionen haben.

source: Additionally, several 'software' options are exposed by the backend. These are reimplementations of features provided natively by larger scanners, but running on the host computer. This enables smaller machines to have similar capabilities. Please note that these features are somewhat simplistic, and may not perform as well as the native implementations. Note also that these features all require that the driver cache the entire image in memory. This will almost certainly result in a reduction of scanning speed.
de: Zusätzlich werden eine Reihe von »Software«-Optionen vom Backend offengelegt. Diese sind Reimplementierungen von Funktionalitäten, die von größeren Scannern selbst bereitgestellt werden, aber stattdessen auf dem Rechner laufen. Dies ermöglicht es kleineren Maschinen, ähnliche Fähigkeiten zu haben. Bitte beachten Sie, dass diese Funktionalitäten etwas vereinfachend sind und nicht so gut funktionieren könnten wie die Implementierungen der Scanner. Beachten Sie auch, dass diese Funktionalitäten es notwendig machen, dass der Treiber das gesamte Bild im Hauptspeicher zwischenspeichert. Dies führt fast sicher zu einer Reduzierung der Scangeschwindigkeit.

source: Requests the driver to detect the extremities of the paper within the larger image, and crop the empty edges.
de: weist den Treiber an, die Grenzen des Papiers innerhalb des größeren Bildes zu erkennen und die leeren Kanten abzuschneiden.

source: Requests the driver to detect the rotation of the paper within the larger image, and counter the rotation.
de: weist den Treiber an, die Orientierung innerhalb des größeren Bildes zu erkennen und die Drehung anzupassen.

source: Requests the driver to find and remove dots of X diameter or smaller from the image, and fill the space with the average surrounding color.
de: weist den Treiber an, Punkte vom Durchmesser X zu finden und vom Bild zu entfernen und den Bereich mit dem Durchschnitt der umgebenen Farbe zu füllen.

source: Use I<'scanimage --help'> to get a list, but be aware that some options may be settable only when another option has been set, and that advanced options may be hidden by some frontend programs.
de: Verwenden Sie »B<scanimage --help>«, um eine Liste zu erhalten, berücksichtigen Sie aber, dass einige Optionen nur gesetzt werden können, wenn andere gesetzt wurden, und die fortgeschrittenen Optionen durch einige Programmoberflächen versteckt sein können.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I<fujitsu.conf> is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts. If the configuration file is missing, the backend will be unable to locate any scanners.
de: Aus der Konfigurationsdatei I<fujitsu.conf> ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird. Falls die Konfigurationsdatei fehlt, wird das Backend keine Scanner finden.

source: Scanners can be specified in the configuration file in 4 ways:
de: Scanner können in der Konfigurationsdatei auf vier Arten angegeben werden:

source: Requests backend to search all scsi buses in the system for a device which reports itself to be a scanner made by 'FUJITSU'.
de: weist das Backend an, alle SCSI-Busse im System nach einem Gerät zu durchsuchen, das sich selbst als ein von »FUJITSU« hergestellter Scanner meldet.

source: "scsi /dev/sg0" (or other scsi device file)
de: »scsi /dev/sg0« (oder eine andere SCSI-Gerätedatei)

source: Requests backend to open the named scsi device. Only useful if you have multiple compatible scanners connected to your system, and need to specify one. Probably should not be used with the other "scsi" line above.
de: weist das Backend an, das benannte SCSI-Gerät zu öffnen. Nur nützlich, wenn mehrere kompatible Scanner an Ihrem System angeschlossen sind und Sie einen auswählen müssen. Dies sollte wahrscheinlich nicht mit einer der anderen oben dargestellten »scsi«-Zeilen verwendet werden.

source: "usb 0x04c5 0x1042" (or other vendor/product ids)
de: »usb 0x04c5 0x1042« (oder andere Lieferanten-/Produktkennungen)

source: Requests backend to search all usb buses in the system for a device which uses that vendor and product id. The device will then be queried to determine if it is a Fujitsu scanner.
de: weist das Backend an, alle USB-Busse im System nach einem Gerät zu durchsuchen, das diese Lieferanten- und Produktkennung verwendet. Das Gerät wird abgefragt, um zu bestimmen, ob es ein Fujitsu-Scanner ist.

source: "usb /dev/usb/scanner0" (or other device file)
de: "usb /dev/usb/scanner0" (oder eine andere Gerätedatei)

source: Some systems use a kernel driver to access usb scanners. This method is untested.
de: Einige Systeme benötigen einen Kerneltreiber zum Zugriff auf USB-Scanner. Diese Methode ist nicht getestet.

source: The only configuration option supported is "buffer-size=xxx", allowing you to set the number of bytes in the data buffer to something other than the compiled-in default, 65536 (64K). Some users report that their scanner will "hang" mid-page, or fail to transmit the image if the buffer is not large enough.
de: Die einzige unterstützte Konfigurationsoption ist »buffer-size=xxx«. Sie erlaubt es Ihnen, die Anzahl der Bytes im Datenpuffer auf etwas anderes als die einkompilierte Vorgabe von 65536 (64 kB) zu setzen. Einige Benutzer berichten, dass Ihr Scanner auf der Mitte der Seite hängen bleibt oder kein Bild überträgt, falls der Puffer nicht groß genug ist.

source: Note: This option may appear multiple times in the configuration file. It only applies to scanners discovered by 'scsi/usb' lines that follow this option.
de: Hinweis: Diese Option kann mehrfach in der Konfigurationsdatei auftauchen. Sie gilt nur für Scanner, die mit den »scsi/usb«-Zeilen ermittelt werden, die dieser Option folgen.

source: Note: The backend does not place an upper bound on this value, as some users required it to be quite large. Values above the default are not recommended, and may crash your OS or lockup your scsi card driver. You have been warned.
de: Hinweis: Das Backend legt keine obere Grenze an diesen Wert an, da einige Benutzer einen sehr großen Wert benötigen. Werte oberhalb der Vorgabe werden nicht empfohlen und könnten Ihr Betriebssystem zum Absturz bringen oder Ihren SCSI-Kartentreiber sperren. Sie wurden gewarnt.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The backend uses a single environment variable, B<SANE_DEBUG_FUJITSU>, which enables debugging output to stderr. Valid values are:
de: Das Backend verwendet eine einzelne Umgebungsvariable B<SANE_DEBUG_FUJITSU>, die das Debugging auf die Standardfehlerausgabe ermöglicht. Gültige Werte sind:

source: 5 Errors
de: 5 Fehler

source: 10 Function trace
de: 10 Funktionsdatenspuren

source: 15 Function detail
de: 15 Funktionsdetails

source: 20 Option commands
de: 20 Optionsbefehle

source: 25 SCSI/USB trace
de: 25 SCSI-/USB-Verfolgung

source: 30 SCSI/USB writes
de: 30 SCSI-/USB-Schreibvorgang

source: 31 SCSI/USB reads
de: 31 SCSI-/USB-Lesevorgang

source: 35 Useless noise
de: 35 Nutzloses Rauschen

source: KNOWN ISSUES
de: BEKANNTE PROBLEME

source: Flatbed units may fail to scan at maximum area, particularly at high resolution.
de: Insbesondere bei hohen Auflösungen könnte es Flachbett-Einheiten nicht gelingen, den maximal möglichen Bereich zu scannen.

source: Any model that does not support VPD during inquiry will not function until an override is added to the backend.
de: Alle Modelle, die während der Abfrage kein VPD unterstützen, werden nicht funktionieren, bis eine Außerkraftsetzung zu diesem Backend hinzugefügt worden ist.

source: CCITT Fax compression used by older scanners is not supported.
de: CCIT-Fax-Komprimierung (von älteren Scannern verwendet) wird nicht unterstützt.

source: JPEG output is supported by the backend, but not by the SANE protocol, so is disabled in this release. It can be enabled if you rebuild from source.
de: JPEG-Ausgabe wird vom Backend, aber nicht vom SANE-Protokoll unterstützt, daher ist dies in dieser Veröffentlichung deaktiviert. Um es zu aktivieren, bauen Sie das Backend aus den Quellen neu.

source: CREDITS
de: DANKSAGUNGEN

source: (with credit to the unnamed author of the coolscan driver)
de: (mit Danksagungen an den unbenannten Autor des Coolscan-Treibers)

source: fujitsu backend, m3093, fi-4340C, ipc, cmp, long-time maintainer:
de: fujitsu-Backend, m3093, fi-4340C, ipc, cmp, Langzeitbetreuer:

source: fi-4220C and basic USB support: Ron Cemer E<lt>I<ron a t roncemer d o t com>E<gt>
de: fi-4220C und grundlegende USB-Unterstützung: Ron Cemer E<lt>I<ron a t roncemer d o t com>E<gt>

source: fi-4120, fi-series color, backend re-write, jpeg, current maintainer: m. allan noah: E<lt>I<kitno455 a t gmail d o t com>E<gt>
de: fi-4120, fi-series-Farbe, grundlegende Backend-Überarbeitung, JPEG, aktueller Betreuer: m. allan noah: E<lt>I<kitno455 a t gmail d o t com>E<gt>

source: JPEG output and low memory usage support funded by: Archivista GmbH I<www.archivista.ch>
de: JPEG-Ausgabe und Verwendung bei wenig Arbeitsspeicher, finanziert durch: Archivista GmbH I<www.archivista.ch>

source: Endorser support funded by: O A S Oilfield Accounting Service Ltd 1500, 840 - 7th Avenue S.W. Calgary, Alberta T2P 3G2 Canada 1-403-263-2600 I<www.oas.ca>
de: Markierer-Unterstützung, finanziert durch: O A S Oilfield Accounting Service Ltd 1500, 840 - 7th Avenue S.W. Calgary, Alberta T2P 3G2 Kanada 1-403-263-2600 I<www.oas.ca>

source: Automatic length detection support funded by: Martin G. Miller I<mgmiller at optonline.net>
de: Automatische Längenerkennungsunterstützung, finanziert durch: Martin G. Miller I<mgmiller at optonline.net>

source: Hardware donated, software image enhancement and fi-6/7xxx support funded by: Fujitsu Computer Products of America, Inc. I<www.fcpa.com>
de: Hardware-Spenden, Software-Bildverbesserung und fi-6/7xxx-Unterstützung finanziert durch: Fujitsu Computer Products of America, Inc. I<www.fcpa.com>

source: iX500 support funded by: Prefix Computer Services I<www.prefixservice.com>
de: iX500-Unterstützung finanziert durch: Prefix Computer Services I<www.prefixservice.com>

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: 07 Feb 2020
de: 7. Februar 2020

source: This document describes backend version 136, which shipped with SANE 1.0.30.
de: Dieses Dokument beschreibt Backend-Version 136, die mit SANE 1.0.30 ausgeliefert wurde.

source: This version supports every known model which speaks the Fujitsu SCSI and SCSI-over-USB protocols. Specifically, the SCSI M309x and M409x series, the SCSI fi-series, most of the USB fi-series, the USB ScanSnap S5xx/S15xx, and the USB iX1xx/5xx series scanners are supported. Please see the list at http://www.sane-project.org/sane-supported-devices.html for details.
de: Diese Version unterstützt jedes bekannte Modell, das die Fujitsu-SCSI- und -SCSI-über-USB-Protokolle verwendet. Insbesondere werden die Serie SCSI M309x und M409x, die SCSI fi-Serie, die meisten der USB fi-Serie, der USB ScanSnap S5xx/S15xx und die Scanner der Serie USB iX1xx/5xx unterstützt. Bitte schauen Sie auf die Liste unter I<http://www.sane-project.org/sane-supported-devices.html> für Details.

source: Controls scan resolution. Setting --resolution also sets --y-resolution, though this behavior is overridden by some frontends.
de: regelt die Scan-Auflösung. Die Einstellung B<--resolution> setzt auch die B<--y-resolution>, allerdings wird diese Einstellung von einigen Oberflächen außer Kraft gesetzt.

source: Sets scan area upper left and lower right coordinates. These are renamed t, l, x, y by some frontends.
de: setzt die Koordinaten der oberen linken und der unteren rechten Ecken. Diese werden von einigen Frontends in t, l, x, y umbenannt.

source: Sets paper size. Used by scanner to determine centering of scan coordinates when using ADF and to detect double feed errors.
de: setzt die Papiergröße. Wird von Scannern verwendet, um beim Einsatz des automatischen Dokumenteneinzugs die Zentrierung der Scan-Koordinaten zu bestimmen und zu erkennen, ob mehrere Seiten gleichzeitig eingezogen wurden.

source: Use 'scanimage --help' to get a list, but be aware that some options may be settable only when another option has been set, and that advanced options may be hidden by some frontend programs.
de: Verwenden Sie »scanimage --help«, um eine Liste zu bekommen. Beachten Sie, dass einige Optionen nur gesetzt werden können, wenn andere Optionen gesetzt wurden und dass fortgeschrittene Optionen bei einigen Programmoberflächen versteckt werden könnten.

source: The configuration file "fujitsu.conf" is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts. If the configuration file is missing, the backend will be unable to locate any scanners.
de: Aus der Konfigurationsdatei "fujitsu.conf" ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird. Falls die Konfigurationsdatei fehlt, wird das Backend keine Scanner finden.

source: Requests backend to search all scsi busses in the system for a device which reports itself to be a scanner made by 'FUJITSU'.
de: weist das Backend an, alle SCSI-Busse im System nach einem Gerät zu durchsuchen, das sich selbst als ein von »FUJITSU« hergestellter Scanner meldet.

source: Requests backend to search all usb busses in the system for a device which uses that vendor and product id. The device will then be queried to determine if it is a Fujitsu scanner.
de: weist das Backend an, alle USB-Busse im System nach einem Gerät zu durchsuchen, das diese Lieferanten- und Produktkennung verwendet. Das Gerät wird abgefragt, um zu bestimmen, ob es ein Fujitsu-Scanner ist.

source: The backend uses a single environment variable, SANE_DEBUG_FUJITSU, which enables debugging output to stderr. Valid values are:
de: Das Backend verwendet eine einzelne Umgebungsvariable B<SANE_DEBUG_FUJITSU>, die das Debugging auf die Standardfehlerausgabe ermöglicht. Gültige Werte sind:

source: fi-4220C and basic USB support: Ron Cemer E<lt>ron a t roncemer d o t comE<gt>
de: fi-4220C und grundlegende USB-Unterstützung: Ron Cemer E<lt>I<ron a t roncemer d o t com>E<gt>

source: fi-4120, fi-series color, backend re-write, jpeg, current maintainer: m. allan noah: E<lt>kitno455 a t gmail d o t comE<gt>
de: fi-4120, fi-series-Farbe, grundlegende Backend-Überarbeitung, JPEG, aktueller Betreuer: m. allan noah: E<lt>I<kitno455 a t gmail d o t com>E<gt>

source: JPEG output and low memory usage support funded by: Archivista GmbH www.archivista.ch
de: JPEG-Ausgabe und Verwendung bei wenig Arbeitsspeicher, finanziert durch: Archivista GmbH I<www.archivista.ch>

source: Endorser support funded by: O A S Oilfield Accounting Service Ltd 1500, 840 - 7th Avenue S.W. Calgary, Alberta T2P 3G2 Canada 1-403-263-2600 www.oas.ca
de: Markierer-Unterstützung, finanziert durch: O A S Oilfield Accounting Service Ltd 1500, 840 - 7th Avenue S.W. Calgary, Alberta T2P 3G2 Kanada 1-403-263-2600 I<www.oas.ca>

source: Automatic length detection support funded by: Martin G. Miller mgmiller at optonline.net
de: Automatische Längenerkennungsunterstützung, finanziert durch: Martin G. Miller I<mgmiller at optonline.net>

source: Hardware donated, software image enhancement and fi-6/7xxx support funded by: Fujitsu Computer Products of America, Inc. www.fcpa.com
de: Hardware-Spenden, Software-Bildverbesserung und fi-6/7xxx-Unterstützung finanziert durch: Fujitsu Computer Products of America, Inc. I<www.fcpa.com>

source: iX500 support funded by: Prefix Computer Services www.prefixservice.com
de: iX500-Unterstützung finanziert durch: Prefix Computer Services I<www.prefixservice.com>

source: sane(7), sane-scsi(5), sane-usb(5), sane-sp15c(5), sane-avision(5), sane-epjitsu(5)
de: B<sane>(7), B<sane-scsi>(5), B<sane-usb>(5), B<sane-sp15c>(5), B<sane-avision>(5), B<sane-epjitsu>(5)
