Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-net.5.po
Languages: de

source: 14 Jul 2008
de: 14. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-net - SANE network backend
de: sane-net - SANE-Netzwerk-Backend

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-net> library implements a SANE (Scanner Access Now Easy) backend that provides access to image acquisition devices through a network connection. This makes it possible to control devices attached to a remote host and also provides a means to grant users access to protected resources.
de: Die Bibliothek B<sane-net> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf Bilderfassungsgeräte über eine Netzwerkverbindung. Dies ermöglicht es, Geräte zu steuern, die an einem fernen Rechner angebunden sind und stellt auch eine Möglichkeit dar, Benutzern Zugriff auf geschützte Ressourcen zu geben.

source: DEVICE NAMES
de: GERÄTENAMEN

source: This backend expects device names of the form:
de: Dieses Backend erwartet Gerätenamen der folgenden Form:

source: I<host>:I<device>
de: I<Rechner>:I<Gerät>

source: Where I<host> is the name (or IP address) of the (remote) host and I<device> is the name of the device on this host that should be addressed. If the device name does not contain a colon (:), then the entire string is treated as the I<device> string for the default host. The default host is the host listed last in the configuration file (see below).
de: Hierbei ist I<Rechner> der Name (oder die IP-Adresse) des (fernen) Rechners und I<Gerät> ist der Name des Geräts an diesem Rechner, das adressiert werden soll. Falls der Gerätename keinen Doppelpunkt (»:«) enthält, dann wird die gesamte Zeichenkette als I<Gerät>-Zeichenkette für den Standardrechner behandelt. Der Standardrechner ist der Rechner, der als letztes in der Konfigurationsdatei aufgeführt ist (siehe unten).

source: An IPv6 address can be specified enclosed in square brackets:
de: Eine IPv6-Adresse kann in eckigen Klammern festgelegt werden:

source: I<[::1]>:I<device>
de: I<[::1]>:I<Gerät>

source: CONFIGURATION
de: KONFIGURATION

source: The I<net.conf> file contains both backend options and a list of host names (or IP addresses) that should be contacted for scan requests. Anything that isn't one of the options listed below will be treated as an host name.
de: Die Datei I<net.conf> enthält sowohl Backend-Optionen als auch eine Liste von Rechnernamen (oder IP-Adressen), die für Scan-Anfragen kontaktiert werden sollen. Alles, was keine der nachfolgend aufgeführten Optionen ist, wird als Rechnername behandelt.

source: Timeout (in seconds) for the initial connection to the B<saned>(8) server. This will prevent the backend from blocking for several minutes trying to connect to an unresponsive B<saned>(8) host (network outage, host down, ...). The environment variable B<SANE_NET_TIMEOUT> can also be used to specify the timeout at runtime.
de: Zeitüberschreitung (in Sekunden) für die anfängliche Verbindung zum B<saned>(8)-Server. Dies verhindert, dass das Backend mehrere Minuten lang blockiert und versucht, sich mit einem nicht reagierenden B<saned>(8)-Rechner zu verbinden (Netzwerkzusammenbruch, Rechner ausgeschaltet, …). Auch die Umgebungsvariable B<SANE_NET_TIMEOUT> kann dazu verwendet werden, zur Laufzeit die Zeitüberschreitung festzulegen.

source: Empty lines and lines starting with a hash mark (#) are ignored. Note that IPv6 addresses in this file do not need to be enclosed in square brackets. A sample configuration file is shown below:
de: Leere Zeilen und Zeilen, die mit einer Raute (»#«) beginnen, werden ignoriert. Beachten Sie, dass IPv6-Adressen in dieser Datei nicht in eckige Klammern eingeschlossen werden müssen. Ein Beispiel für eine Konfiguration ist nachfolgend dargestellt:

source: scan-server.somedomain.firm
de: scan-server.eine_Domain.firma

source: # this is a comment
de: # Dies ist ein Kommentar

source: The above list of hosts can be extended at run-time using environment variable B<SANE_NET_HOSTS>. This environment variable is a colon-separated list of hostnames or IP addresses that should be contacted in addition to the hosts mentioned in the configuration file. For example, a user could set the environment variable to the string:
de: Die obige Liste kann zur Laufzeit mit der Umgebungsvariable B<SANE_NET_HOSTS> erweitert werden. Die Umgebungsvariable besteht aus einer Doppelpunkt-getrennten Liste von Rechnernamen oder IP-Adressen, die zusätzlich zu den Rechnern in der Konfigurationsdatei kontaktiert werden sollen. Beispielsweise könnte ein Benutzer die Umgebungsvariable auf folgende Zeichenkette setzen:

source: To request that hosts I<new.scanner.com> , I<[::1]> , I<192.168.0.2> and I<scanner.univ.edu> are contacted in addition to the hosts listed above.
de: Damit wird erbeten, dass die Rechner I<new.scanner.com>, I<[::1]>, I<192.168.0.2> und I<scanner.univ.edu> zusätzlich zu den oben aufgeführten Rechnern kontaktiert werden.

source: For this backend to function properly, it is also necessary to define the B<sane-port> service in I</etc/services>. The B<sane> service should be defined using a line of the following form:
de: Damit dieses Backend korrekt funktioniert, ist es auch notwendig, den Dienst B<sane-port> in I</etc/services> zu definieren. Der Dienst B<sane> sollte mittels einer Zeile der folgenden Form definiert werden:

source: sane-port 6566/tcp # SANE network scanner daemon
de: sane-port 6566/tcp # SANE-Netzwerkscanner-Daemon

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. On *NIX systems, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Auf *NIX-Systemen sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: A colon-separated list of host names or IP addresses to be contacted by this backend.
de: Eine Doppelpunkt-getrennte Liste von Rechnernamen oder IP-Adressen, die von diesem Backend kontaktiert werden sollen.

source: Number of seconds to wait for a response from the B<saned>(8) server for the initial connection request.
de: Anzahl an Sekunden, die auf eine Reaktion von dem B<saned>(8)-Server für die anfängliche Verbindungsanfrage gewartet werden soll.

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: BUGS
de: FEHLER

source: If B<saned>(8) has timed out, the net backend may loop with authorization requests.
de: Falls B<saned>(8) in eine Zeitüberschreitung gelaufen ist, kann das Backend in einer Endlosschleife mit Autorisierungsanfragen gefangen sein.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: David Mosberger and Andreas Beck
de: David Mosberger und Andreas Beck

source: Timeout (in seconds) for the initial connection to the I<saned> server. This will prevent the backend from blocking for several minutes trying to connect to an unresponsive I<saned> host (network outage, host down, ...). The environment variable B<SANE_NET_TIMEOUT> can also be used to specify the timeout at runtime.
de: Zeitüberschreitung (in Sekunden) für die anfängliche Verbindung zum I<saned>-Server. Dies verhindert, dass das Backend mehrere Minuten lang blockiert und versucht, sich mit einem nicht reagierenden I<saned>-Rechner zu verbinden (Netzwerkzusammenbruch, Rechner ausgeschaltet, …). Auch die Umgebungsvariable B<SANE_NET_TIMEOUT> kann dazu verwendet werden, zur Laufzeit die Zeitüberschreitung festzulegen.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: Number of seconds to wait for a response from the I<saned> server for the initial connection request.
de: Anzahl an Sekunden, die auf eine Reaktion von dem I<saned>-Server für die anfängliche Verbindungsanfrage gewartet werden soll.

source: If saned has timed out, the net backend may loop with authorization requests.
de: Falls Saned in eine Zeitüberschreitung gelaufen ist, kann das Backend in einer Endlosschleife mit Autorisierungsanfragen gefangen sein.

source: sane(7), saned(8), sane-dll(5), scanimage(1)
de: B<sane>(7), B<saned>(8), B<sane-dll>(5), B<scanimage>(1)

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d>. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).
