Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-microtek2.5.po
Languages: de

source: 13 Jul 2008
de: 13. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-microtek2 - SANE backend for Microtek scanners with SCSI-2 command set
de: sane-microtek2 - SANE-Backend für Scanner von Microtek mit dem SCSI-2-Befehlssatz

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-microtek2> library implements a SANE (Scanner Access Now Easy) backend that provides access to Microtek scanners with a SCSI-2 command set. This backend can be considered alpha to beta. Some scanner models are reported to work well, others not. New development versions of this backend can be obtained from I<http://karstenfestag.gmxhome.de>.
de: Die Bibliothek B<sane-microtek2> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf Microtek-Scanner mit einem SCSI-2-Befehlssatz. Dieses Backend kann als Alpha bis Beta betrachtet werden. Es wird berichtet, dass einige Scanner-Modelle gut funktionieren, andere nicht. Neue Entwicklungsversionen dieses Backends können von I<http://karstenfestag.gmxhome.de> erhalten werden.

source: There exists a different backend for Microtek scanners with SCSI-1 command set. Refer to B<sane-microtek>(5) for details.
de: Es gibt ein anderes Backend für Microtek-Scanner mit einem SCSI-1-Befehlssatz. Siehe B<sane-microtek>(5) für Details.

source: And there is work in progress for the ScanMaker 3600. See I<http://sourceforge.net/projects/sm3600>.
de: Und derzeit macht die Arbeit für den ScanMaker 3600 Fortschritte. Siehe I<http://sourceforge.net/projects/sm3600>.

source: At present, the following scanners are known positively to work with this backend:
de: Derzeit ist von folgenden Scannern bekannt, dass sie mit diesem Backend funktionieren:

source: \f(CRVendor Product id Remark -------------------------------------------------------------------- Microtek E3+ Parport and SCSI Microtek X6 SCSI Microtek X6EL SCSI Microtek X6USB USB Microtek ScanMaker V300 Parport and SCSI Microtek ScanMaker V310 Parport and SCSI Microtek ScanMaker V600 Parport and SCSI Microtek ScanMaker 330 SCSI Microtek ScanMaker 630 SCSI Microtek ScanMaker 636 SCSI Microtek ScanMaker 9600XL SCSI; only flatbed mode? Microtek Phantom 330CX Parport Microtek SlimScan C3 Parport Microtek SlimScan C6 USB Microtek Phantom 636 SCSI Microtek Phantom 636CX Parport Microtek V6USL SCSI and USB Microtek V6UPL USB; not stable Microtek X12USL SCSI; only 8bit color, work in progress Vobis HighScan SCSI (E3+ based models) Scanport SQ300 Parport? Scanport SQ4836 SCSI Scanpaq SQ2030 Parport\fR
de: \f(CRLieferant Produktkennung Bemerkung -------------------------------------------------------------------- Microtek E3+ Parallel-Port und SCSI Microtek X6 SCSI Microtek X6EL SCSI Microtek X6USB USB Microtek ScanMaker V300 Parallel-Port und SCSI Microtek ScanMaker V310 Parallel-Port und SCSI Microtek ScanMaker V600 Parallel-Port und SCSI Microtek ScanMaker 330 SCSI Microtek ScanMaker 630 SCSI Microtek ScanMaker 636 SCSI Microtek ScanMaker 9600XL SCSI; nur Flachbett-Modus? Microtek Phantom 330CX Parallel-Port Microtek SlimScan C3 Parallel-Port Microtek SlimScan C6 USB Microtek Phantom 636 SCSI Microtek Phantom 636CX Parallel-Port Microtek V6USL SCSI und USB Microtek V6UPL USB; nicht stabil Microtek X12USL SCSI; nur 8bit-Farbe, in Entwicklung Vobis HighScan SCSI (E3+-basierte Modelle) Scanport SQ300 Parallel-Port? Scanport SQ4836 SCSI Scanpaq SQ2030 Parallel-Port\fR

source: Additional information can be found at I<http://www.sane-project.org/>.
de: Zusätzliche Informationen können unter I<http://www.sane-project.org/> gefunden werden.

source: If you own a Microtek scanner other than the ones listed above, it may or may not work with SANE! Because equal scanners are sold under different names in different countries your model may be equivalent to one of the above.
de: Falls Sie einen Microtek-Scanner besitzen, der oben nicht aufgeführt ist, könnte er mit SANE funktionieren oder auch nicht! Da identische Scanner unter verschiedenen Namen in verschiedenen Ländern verkauft werden, könnte Ihr Modell zu einem der obigen äquivalent sein.

source: The parport scanners work with the ppscsi + onscsi kernel modules. See I<http://cyberelk.net/tim/parport/ppscsi.html> and I<http://penguin-breeder.org/kernel/download/>.
de: Die Parallel-Port-Scanner funktionieren mit den Kernelmodulen ppscsi + onscsi. Siehe I<http://cyberelk.net/tim/parport/ppscsi.html> und I<http://penguin-breeder.org/kernel/download/>.

source: The USB scanners work with the microtek kernel module. You may have to add the vendor and model codes to microtek.c if they aren't yet listed there.
de: Die USB-Scanner funktionieren mit dem Kernelmodul »microtek«. Es könnte notwendig sein, dass Sie den Lieferanten- und Modell-Code zu microtek.c hinzufügen müssen, falls sie dort noch nicht aufgeführt sind.

source: Both parport and USB scanners need the generic SCSI support, so check if you have loaded the scsi_mod and sg modules!
de: Sowohl Parallelport- als auch USB-Scanner benötigen die generische SCSI-Unterstützung, daher müssen die Module »scsi_mod« und »sg« geladen sein.

source: If you try your scanner for the first time keep an eye on it. If it gets commands that it doesn't understand the scanhead may go beyond the scan area. The scanner then makes strange noises. In this case immediately switch off the scanner or disconnect its power cable to prevent damages!
de: Wenn Sie Ihren Scanner erstmalig ausprobieren, beobachten Sie ihn. Falls er Befehle erhält, die er nicht versteht, könnte sich der Scankopf außerhalb des Scanbereichs bewegen. Der Scanner macht dann merkwürdige Geräusche. Schalten Sie ihn in diesem Fall sofort aus oder entfernen Sie das Stromkabel, um Schäden zu vermeiden!

source: If your scanner is a different one than the models mentioned above and it is working please tell the author about it. It would be nice if you add a logfile to this information (creation of the logfile: see below).
de: Falls Ihr Scanner keines der oben erwähnten Modelle ist, aber dennoch funktioniert, dann teilen Sie das dem Autor (auf Englisch) mit. Es wäre nett, wenn Sie eine Protokolldatei zu dieser Information hinzufügen könnten (siehe unten bezüglich Erstellung einer Protokolldatei).

source: If your scanner is not working properly you also should create a logfile and send it to the author. He will use the information to improve the backend and possibly make your scanner work.
de: Falls Ihr Scanner nicht korrekt funktioniert, sollten Sie auch eine Protokolldatei erstellen und sie an den Autor senden. Er wird die Informationen verwenden, um das Backend zu verbessern und möglicherweise Ihren Scanner zum Laufen bekommen.

source: How to create the logfile?
de: Wie erstelle ich eine Protokolldatei?

source: - put the line
de: - schreiben Sie die Zeile

source: "option dump 2" into your I<microtek2.conf> file or change the existing "option dump" to "2"
de: »option dump 2« in Ihre Datei I<microtek2.conf> oder ändern Sie die bestehende »option dump« auf »2«

source: - in a terminal (bash) type
de: - geben Sie in einem Terminal (bash)

source: "export SANE_DEBUG_MICROTEK2=30" and then
de: »export SANE_DEBUG_MICROTEK2=30« ein und dann

source: You get two files: scan.log contains the logfile and sout.pnm the scanned image (if there was scanned something). Zip them before sending.
de: Sie erhalten zwei Dateien: scan.log enthält die Protokolldatei und sout.pnm das gescannte Bild (falls etwas gescannt wurde). Verpacken Sie sie vor dem Senden mit B<zip>(1).

source: FRONTEND OPTIONS
de: OBERFLÄCHEN-OPTIONEN

source: This backend dynamically enables the options for the frontend, that are supported by the scanner in dependence of the scanning-mode and other options. Not supported options are disabled.
de: Dieses Backend aktiviert die Optionen für die Oberfläche dynamisch, die vom Scanner, abhängig vom Scanmodus und anderen Optionen, unterstützt werden. Nicht unterstützte Optionen sind deaktiviert.

source: The following options are supported by the B<sane-microtek2> driver:
de: Die folgenden Optionen werden vom B<sane-microtek2>-Treiber unterstützt:

source: Color, grayscale, halftone and lineart scans.
de: Farb-, Graustufen-, Halbton- und Strichzeichnung-Scans.

source: Highlight, midtone, shadow, contrast, brightness, exposure time control, gamma correction, threshold (dependent of the scan mode and the scanner capabilities)
de: Glanzlichter, Mitteltönung, Schatten, Kontrast, Helligkeit, Belichtungszeitsteuerung, Gammakorrektur, Schwellwert (abhängig vom Scanmodus und den Scanner-Fähigkeiten).

source: Transparency media adapter, automatic document feeder
de: Durchlichtadapter, automatischer Dokumenteneinzug

source: Additional options can be enabled or disabled in the I<microtek2.conf> file. See the configuration section of this manpage.
de: Zusätzliche Optionen können in der Datei I<microtek2.conf> aktiviert oder deaktiviert werden. Siehe den Konfigurationsabschnitt dieser Handbuchseite.

source: DEVICE NAMES
de: GERÄTENAMEN

source: This backend expects device names of the form:
de: Dieses Backend erwartet Gerätenamen der folgenden Form:

source: I<special>
de: I<Spezialdatei>

source: Where I<special> is the UNIX path-name for the special device that corresponds to the scanner. The special device name must be a generic SCSI device or a symlink to such a device. Under Linux, such a device name could be I</dev/sga> or I</dev/sge> for example.
de: wobei I<Spezialdatei> der UNIX-Pfadname für das besondere Gerät ist, das dem Scanner entspricht. Der Spezialdateiname muss ein generisches SCSI-Gerät oder ein Symlink auf ein solches Gerät sein. Unter Linux könnte ein solcher Gerätename beispielsweise I</dev/sga> oder I</dev/sge> sein.

source: CONFIGURATION
de: KONFIGURATION

source: The configuration file for this backend resides in I</etc/sane.d/microtek2.conf>.
de: Die Konfigurationsdatei für dieses Backend befindet sich in I</etc/sane.d/microtek2.conf>.

source: Its contents is a list of device names that correspond to Microtek scanners with SCSI-2 interface. Empty lines and lines starting with a hash mark (#) are ignored.
de: Sein Inhalt ist eine Liste von Gerätenamen, die Microtek-Scannern mit SCSI-2-Schnittstelle entsprechen. Leere Zeilen und solche, die mit einer Raute (#) beginnen, werden ignoriert.

source: The configuration file may also contain options. Global options that are valid for all devices are placed above the device names. Device-specific options are placed under the device name. Note that, except for option dump E<lt>nE<gt> and option strip-height E<lt>nE<gt>, the entry in the microtek2.conf file only enables the corresponding option for being showed in the frontend. There, in the frontend, you can switch the options on and off. Currently the following options are supported:
de: Die Konfigurationsdatei darf auch Optionen enthalten. Globale Optionen sind für alle Geräte gültig, die oberhalb der Gerätenamen abgelegt sind. Gerätespezifische Optionen werden unterhalb der Gerätenamen abgelegt. Beachten Sie, dass der Eintrag in der Datei I<microtek2.conf> nur die Anzeige der entsprechenden Option in der Oberfläche aktiviert (außer für die Optionen dump E<lt>nE<gt> und strip-height E<lt>nE<gt>). Dort, in der Oberfläche, können Sie die Optionen ein- und ausschalten. Derzeit werden die folgenden Optionen unterstützt:

source: I<option dump E<lt>nE<gt>> enables printing of additional information about the SCSI commands that are sent to the scanner to stderr. This option is primarily useful for debugging purpose. This option has to be a global option and is best placed at the top of the I<microtek2.conf> file.
de: I<option dump E<lt>nE<gt>> aktiviert die Ausgabe zusätzlicher Informationen auf der Standardfehlerausgabe über die SCSI-Befehle, die zu dem Scanner gesendet werden. Diese Option ist hauptsächlich zur Fehlersuche nützlich. Diese Option muss eine globale Option sein und wird am besten an den Anfang der Datei I<microtek2.conf> abgelegt.

source: If n=1 the contents of the command blocks and the results for the INQUIRY and READ SCANNER ATTRIBUTES command are printed to stderr.
de: Falls n=1, wird der Inhalt der Befehlsblöcke und die Ergebnisse für die Befehle INQUIRY und READ SCANNER ATTRIBUTES auf die Standardfehlerausgabe ausgegeben.

source: If n=2 the contents of the command blocks for all other SCSI commands are printed to stderr, too. If n=3 the contents of the gamma table is printed, too. If n=4 all scan data is additionally printed to stderr.
de: Falls n=2, wird der Inhalt der Befehlsblöcke für alle anderen SCSI-Befehle auch auf der Standardfehlerausgabe ausgegeben. Falls n=3, wird der Inhalt der Gammatabelle auch ausgegeben. Falls n=4, werden zusätzlich alle Scandaten auf die Standardfehlerausgabe ausgegeben.

source: The default is n=1.
de: Die Vorgabe ist n=1.

source: I<option strip-height E<lt>nE<gt>> , where E<lt>nE<gt> is a floating point number, limits the amount of data that is read from the scanner with one read command. The unit is inch and E<lt>nE<gt> defaults to 1.0, if this option is not set in the configuration file. If less than E<lt>nE<gt> inch of data fit into the SCSI buffer, then the smaller value is used and this option has no effect.
de: I<option strip-height E<lt>nE<gt>>, wobei E<lt>nE<gt> eine Fließkommazahl ist, begrenzt die Datenmenge, die vom Scanner in einem Lesebefehl eingelesen wird. Die Einheit ist Zoll und E<lt>nE<gt> ist standardmäßig 1.0, falls diese Option nicht in der Konfigurationsdatei gesetzt ist. Falls weniger als E<lt>nE<gt> Zoll von Daten in den SCSI-Puffer passen, dann wird der kleinere Wert verwendet und diese Option hat keine Auswirkung.

source: If your system has a big SCSI buffer and you want to make use of the whole buffer, increase the value for E<lt>nE<gt>. For example, if E<lt>nE<gt> is set to 14.0, no restrictions apply for scanners with a letter, legal or A4 sized scan area.
de: Falls Ihr System einen großen SCSI-Puffer hat und Sie den gesamten Puffer benützen wollen, erhöhen Sie den Wert für E<lt>nE<gt>. Falls beispielsweise E<lt>nE<gt> auf 14.0 gesetzt ist, gelten für Scanner mit einer Scanbereichsgröße von Letter, Legal oder A4 keine Begrenzungen.

source: The following options enable or disable additional frontend options. If an option is set to E<lt>onE<gt> an appropriate option will appear in the frontend.
de: Die folgenden Optionen aktivieren oder deaktivieren zusätzliche Oberflächen-Optionen. Falls eine Option auf E<lt>onE<gt> gesetzt ist, werden geeignete Optionen in der Oberfläche auftauchen.

source: I<option no-backtrack-option E<lt>on/offE<gt>> prevents the scanner head from moving backwards between the read commands. This speeds up scanning. Try it.
de: Die Option I<option no-backtrack-option E<lt>on/offE<gt>> verhindert, dass sich der Scannerkopf zwischen zwei Lesebefehlen rückwärts bewegt. Dies beschleunigt das Scannen. Probieren Sie es aus.

source: I<option lightlid-35 E<lt>on/offE<gt>> If you use the LightLid-35 transparency adapter you get an advanced option which switches off the flatbed lamp during the scan.
de: I<option lightlid-35 E<lt>on/offE<gt>> Falls Sie den LightLid-35-Transparenzadapter verwenden, erhalten Sie eine weiterführende Option, die die Flachbettlampe während des Scans ausschaltet.

source: I<option toggle-lamp E<lt>on/offE<gt>> You get a button in the frontend where you can switch on and off the flatbed lamp.
de: I<option toggle-lamp E<lt>on/offE<gt>> Sie erhalten einen Knopf in der Oberfläche, mit der Sie die Flachbettlampe ein- und ausschalten können.

source: I<option lineart-autoadjust E<lt>on/offE<gt>> You can tell the backend to try to determine a good value for the lineart threshold.
de: I<option lineart-autoadjust E<lt>on/offE<gt>> Sie können dem Backend mitteilen, zu versuchen, einen guten Wert für den Lineart-Schwellwert zu ermitteln:

source: I<option backend-calibration E<lt>on/offE<gt>> Some scanners (e.g. Phantom 330CX and 636CX) need to have calibrated the data by the backend. Try this option if you see vertical stripes in your pictures.
de: I<option backend-calibration E<lt>on/offE<gt>> Einige Scanner (z.B. Phantom 330CX und 636CX) benötigen, dass das Backend Daten kalibriert. Probieren Sie diese Option aus, falls Sie vertikale Streifen in Ihren Bildern sehen.

source: I<option colorbalance-adjust E<lt>on/offE<gt>> Some scanners (e.g. Phantom 330CX and 636CX) need to have corrected the color balance. If this option is enabled you get advanced options where you can balance the colors. And you will have a button to use the values that the firmware of the scanner provides.
de: I<option colorbalance-adjust E<lt>on/offE<gt>> Einige Scanner (z.B. Phantom 330CX und 636CX) benötigen eine Korrektur des Farbabgleichs. Falls diese Option aktiviert ist, erhalten Sie weiterführende Optionen, mit denen Sie die Farben abgleichen können. Und Sie erhalten einen Knopf, um die Werte zu verwenden, die die Firmware des Scanners bereitstellt.

source: A sample configuration file is shown below:
de: Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: # this is a comment
de: # Dies ist ein Kommentar

source: This backend also supports the new configuration file format which makes it easier to detect scanners under Linux. If you have only one scanner it would be best to use the following configuration file for this backend:
de: Das Backend unterstützt auch das neue Konfigurationsdateiformat, welches die Erkennung von Scannern unter Linux erleichtert. Falls Sie nur einen Scanner haben, wäre es am besten, die nachfolgende Konfigurationsdatei zu verwenden:

source: In this case all SCSI-Scanners should be detected automatically because of the
de: In diesem Fall sollten alle SCSI-Scanner aufgrund der Zeile

source: line.
de: automatisch erkannt werden.

source: FILES
de: DATEIEN

source: The backend configuration file.
de: Die Backend-Konfigurationsdatei.

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 255 requests all debug output to be printed. Smaller levels reduce verbosity. To see error messages on stderr set B<SANE_DEBUG_MICROTEK2> to 1 (Remark: The whole debugging levels should be better revised).
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 255 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit. Um Fehlermeldungen auf der Standardfehlerausgabe zu sehen, setzen Sie B<SANE_DEBUG_MICROTEK2> auf 1 (Anmerkung: Die gesamten Debugging-Stufen sollten besser überarbeitet werden).

source: E.g. just say:
de: Zum Beispiel:

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: Bernd Schroeder (not active anymore)
de: Bernd Schroeder (nicht mehr aktiv)

source: The B<sane-microtek2> library implements a SANE (Scanner Access Now Easy) backend that provides access to Microtek scanners with a SCSI-2 command set. This backend can be considered alpha to beta. Some scanner models are reported to work well, others not. New development versions of this backend can be obtained from B<http://karstenfestag.gmxhome.de>
de: Die Bibliothek B<sane-microtek2> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf Microtek-Scanner mit einem SCSI-2-Befehlssatz. Dieses Backend kann als Alpha bis Beta betrachtet werden. Es wird berichtet, dass einige Scanner-Modelle gut funktionieren, andere nicht. Neue Entwicklungsversionen dieses Backends können von I<http://karstenfestag.gmxhome.de> erhalten werden.

source: There exists a different backend for Microtek scanners with SCSI-1 command set. Refer to sane-microtek(5) for details.
de: Es gibt ein anderes Backend für Microtek-Scanner mit einem SCSI-1-Befehlssatz. Siehe B<sane-microtek>(5) für Details.

source: And there is work in progress for the ScanMaker 3600. See B<http://sourceforge.net/projects/sm3600>
de: Und derzeit macht die Arbeit für den ScanMaker 3600 Fortschritte. Siehe I<http://sourceforge.net/projects/sm3600>.

source: Additional information can be found at B<http://www.sane-project.org/>.
de: Zusätzliche Informationen können unter I<http://www.sane-project.org/> gefunden werden.

source: The following options are supported by the Microtek2-driver:
de: Die folgenden Optionen werden vom Microtek2-Treiber unterstützt:

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 255 requests all debug output to be printed. Smaller levels reduce verbosity. To see error messages on stderr set SANE_DEBUG_MICROTEK2 to 1 (Remark: The whole debugging levels should be better revised).
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 255 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.Um Fehlermeldungen auf der Standardfehlerausgabe zu sehen, setzen Sie SANE_DEBUG_MICROTEK2 auf 1 (Anwerkung: Die gesamten Debugging-Stufen sollten besser überarbeitet werden).

source: sane-scsi(5), sane(7)
de: B<sane-scsi>(5), B<sane>(7)
