Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-kodakaio.5.po
Languages: de

source: 17 Jun 2012
de: 17. Juni 2012

source: NAME
de: BEZEICHNUNG

source: sane-kodakaio - SANE backend for Kodak aio printer / scanners
de: sane-kodakaio - SANE-Backend für AiO-Drucker/-Scanner von Kodak

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-kodakaio> library implements a SANE (Scanner Access Now Easy) backend which provides access to Kodak aio printer/scanners, like the ESP and Hero series.
de: Die Bibliothek B<sane-kodakaio> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die AiO-Drucker/-Scanner von Kodak, wie die ESP- und Hero-Baureihen.

source: This document describes backend version 2.4, which is the first candidate for incorporation in sane-backends.
de: Dieses Dokument beschreibt das Backend in der Version 2.4, welches der erste Kandidat für die Einbeziehung in sane-backends ist.

source: SUPPORTED HARDWARE
de: UNTERSTÜTZTE HARDWARE

source: This version should support models of the Kodak ESP and Hero series, and possibly some Advent AiO scanners. The ESP 5250 and Hero 9.1 were used to develop the backend, but other models may work. Please see the supported devices list at I<http://www.sane-project.org/sane-backends.html#S-KODAKAIO>.
de: Diese Version sollte Modelle der ESP- und Hero-Baureihen von Kodak sowie möglicherweise einige Advent-AiO-Scanner. Zum Entwickeln des Backends wurden der ESP 5250 und der Hero 9.1 verwendet, aber andere Modelle könnten auch funktionieren. Eine Liste der unterstützten Geräte finden Sie auf I<http://www.sane-project.org/sane-backends.html#S-KODAKAIO>.

source: If you have a model not on that list, or reported as 'untested': the best way to determine level of support is to test the scanner directly.
de: Falls Sie ein Modell haben, das nicht in der Liste aufgeführt oder als »untested« bezeichnet ist, dann ist der beste Weg zur Ermittlung des Unterstützungsumfangs, den Scanner direkt zu testen.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I<kodakaio.conf> is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts.
de: Aus der Konfigurationsdatei I<kodakaio.conf> ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. Higher debug levels increase the verbosity of the output.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Größere Werte erhöhen die Ausführlichkeit der Ausgabe.

source: KNOWN ISSUES
de: BEKANNTE PROBLEME

source: Most hardware options are either not supported or not exposed for control by the user, including: multifeed detection, image compression etc.
de: Die meisten Hardwareoptionen werden entweder nicht unterstützt oder können vom Benutzer nicht direkt gesteuert werden. Dies betrifft die Erkennung von Mehrfacheinzügen, die Bildkompression usw.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: The B<sane-kodakaio> library implements a SANE (Scanner Access Now Easy) backend which provides access to Kodak aio printer / scanners, like the ESP and Hero series.
de: Die Bibliothek B<sane-kodakaio> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die AiO-Drucker/-Scanner von Kodak, wie die ESP- und Hero-Baureihen.

source: This version should support models of the Kodak ESP and Hero series, and possibly some Advent AiO scanners. The ESP 5250 and Hero 9.1 were used to develop the backend, but other models may work. Please see the desc file.
de: Diese Version sollte Modelle der ESP- und Hero-Baureihen von Kodak sowie möglicherweise einige Advent-AiO-Scanner. Zum Entwickeln des Backends wurden der ESP 5250 und der Hero 9.1 verwendet, aber andere Modelle könnten auch funktionieren. Bitte schauen Sie in die Beschreibungsdatei.

source: The configuration file "kodakaio.conf" is used to tell the backend how to look for scanners, and provide options controlling the operation of the backend. This file is read each time the frontend asks the backend for a list of scanners, generally only when the frontend starts.
de: Aus der Konfigurationsdatei I<kodakaio.conf> ermittelt das Backend, wie nach Scannern gesucht werden soll. Außerdem stellt sie Optionen zur Steuerung der Aktionen des Backends bereit. Diese Datei wird immer dann gelesen, wenn das Frontend vom Backend eine Liste der Scanner anfordert, im Allgemeinen nur, wenn das Frontend gestartet wird.

source: The backend uses a single environment variable, SANE_DEBUG_KODAKAIO, which enables debugging output to stderr.
de: Das Backend verwendet B<SANE_DEBUG_KODAKAIO> als einzige Umgebungsvariable, welche bewirkt, dass Debugging-Ausgaben in die Standardfehlerausgabe geschrieben werden.
