Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-dc240.5.po
Languages: de

source: 11 Jul 2008
de: 11. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-dc240 - SANE backend for Kodak DC240 Digital Camera
de: sane-dc240 - SANE-Backend für die Digitalkamera DC240 von Kodak

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-dc240> library implements a SANE (Scanner Access Now Easy) backend that provides access to the Kodak DC240 camera. THIS IS EXTREMELY ALPHA CODE! USE AT YOUR OWN RISK!!
de: Die Bibliothek B<sane-dc240> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die Kodak-Digitalkamera DC240. DIES IST ALPHA-CODE IN EINEM SEHR FRÜHEN STADIUM! BENUTZUNG AUF EIGENE GEFAHR!

source: DEVICE NAMES
de: GERÄTENAMEN

source: The current version of the backend only allows one camera to be connected. The device name is always "0".
de: Die aktuelle Version des Backends erlaubt nur eine angeschlossene Kamera. Der Gerätename ist immer »0«.

source: CONFIGURATION
de: KONFIGURATION

source: The contents of the I<dc240.conf> specify the serial port and baud rate to use. The B<baud> rate specifies the maximum rate to use while downloading pictures. (The camera is always initialized using 9600 baud, then switches to the higher rate). On a 450MHz Pentium, I usually have no problems downloading at 115200 baud, though the camera sometimes has to resend packets due to lost characters. Results are better when the "interrupt-unmask flag" is set in the IDE driver (I<hdparm -u1>). Supported baud rates are: 9600, 19200, 38400, 57600, and 115200.
de: Der Inhalt der I<dc240.conf> legt den seriellen Port und die zu verwendende Baud-Rate fest. Die B<Baud>-Rate legt die maximale Rate fest, die beim Herunterladen von Bildern verwendet wird. (Die Kamera wird immer mittels 9600 baud initialisiert und schaltet dann auf eine höhere Rate um). Auf meinem 450-MHz-Pentium habe ich normalerweise keine Probleme beim Herunterladen mit 115200 baud, obwohl die Kamera manchmal Pakete aufgrund verlorener Zeichen erneut senden muss. Die Ergebnisse sind besser, wenn das »interrupt-unmask flag« im IDE-Treiber gesetzt ist (I<hdparm -u1>). Unterstützte Baud-Raten sind: 9600, 19200, 38400, 57600 und 115200.

source: The B<dumpinquiry> line causes some information about the camera to be printed.
de: Die Zeile B<dumpinquiry> führt dazu, dass einige Informationen über die Kamera angezeigt werden.

source: B<cmdrespause> specifies how many usec (1,000,000ths of a) between writing the command and reading the result should be used. 125000 seems to be the lowest I could go reliably.
de: B<cmdrespause> legt fest, wieviele µs (1.000.000-tel einer Sekunde) zwischen dem Schreiben des Befehls und dem Lesen des Ergebnisses verwendet werden soll. 125000 scheint der kleinste Wert zu sein, den ich zuverlässig verwenden könnte.

source: B<breakpause> is the time in 1,000,000ths of a usec between sending the "back to default" break sending commands.
de: B<breakpause> ist die Zeit in 1.000.000-tel einer Sekunde (µs) zwischen dem Senden der Unterbrechung »Zurück zur Vorgabe« und dem Senden von Befehlen.

source: Empty lines and lines starting with a hash mark (#) are ignored. A sample configuration file is shown below:
de: Leere Zeilen und Zeilen, die mit einer Raute (»#«) beginnen, werden ignoriert. Nachfolgend sehen Sie ein Beispiel für eine Konfigurationsdatei:

source: # this is a comment
de: # Dies ist ein Kommentar

source: FILES
de: DATEIEN

source: The backend configuration file (see also description of B<SANE_CONFIG_DIR> below).
de: Die Backend-Konfigurationsdatei (siehe auch die nachfolgende Beschreibung von B<SANE_CONFIG_DIR>).

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in I</etc/sane.d.> If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories I<tmp/config>, I<.>, and I</etc/sane.d> being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: If the library was compiled with debugging support enabled, this environment variable controls the debug level for this backend. A value of 128 requests maximally copious debug output; smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debugging-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Ein Wert von 128 bewirkt eine maximal umfassende Debug-Ausgabe. Kleinere Werte reduzieren die Ausführlichkeit.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: This backend borrows heavily from the dc210 backend by Brian J. Murrell which is based somewhat on the dc25 backend by Peter Fales.
de: Dieses Backend borgt sich viel aus dem Backend dc210 von Brian J. Murrell aus, das wiederum etwas auf dem Backend dc25 von Peter Fales basiert.

source: The manpage was largely copied from the dc210 manpage.
de: Diese Handbuchseite würde größtenteils aus der Handbuchseite zum I<dc210>-Backend kopiert.

source: BUGS
de: FEHLER

source: The major limitation that I know of is that the backend assumes the directory in the camera is 100dc240. Once the camera has taken more than 9999 pictures, the directory will increment to 101dc240. Not only should we check for the additional directory, but pictures may actually be found in multiple directories.
de: Die mir bekannte Haupteinschränkung besteht darin, dass das Backend annimmt, dass das Verzeichnis in der Kamera 100dc240 ist. Sobald die Kamera mehr als 9999 Bilder aufgenommen hat, wird das Verzeichnis auf 101dc240 erhöht. Es sollte nicht nur auf zusätzliche Verzeichnisse überprüft werden, aber die Bilder könnten tatsächlich in mehreren Verzeichnissen gefunden werden.

source: More general comments, suggestions, and inquiries about frontends or SANE should go to the SANE Developers mailing list (see I<http://www.sane-project.org/mailing-lists.html> for details). You must be subscribed to the list, otherwise your mail won't be sent to the subscribers.
de: Allgemeinere Kommentare, Vorschläge und Fragen über Frontends oder SANE sollten (auf Englisch) an die SANE-Entwickler-Mailingliste gehen (siehe I<http://www.sane-project.org/mailing-lists.html> für Details). Sie müssen die Liste abonnieren, ansonsten werden Ihre E-Mails nicht an die Teilnehmer gesendet.

source: The contents of the I<dc240.conf> specify the serial port and baud rate to use. The baud rate specifies the maximum rate to use while downloading pictures. (The camera is always initialized using 9600 baud, then switches to the higher rate). On a 450MHz Pentium, I usually have no problems downloading at 115200 baud, though the camera sometimes has to resend packets due to lost characters. Results are better when the "interrupt-unmask flag" is set in the IDE driver (hdparm -u1). Supported baud rates are: 9600, 19200, 38400, 57600, and 115200.
de: Der Inhalt der I<dc240.conf> legen den seriellen Port und die zu verwendende Baud-Rate fest. Die B<Baud>-Rate legt die maximale Rate fest, die beim Herunterladen von Bildern verwendet wird. (Die Kamera wird immer mittels 9600 baud initialisiert und schaltet dann auf eine höhere Rate um). Auf meinem 450-MHz-Pentium habe ich normalerweise keine Probleme beim Herunterladen mit 115200 baud, obwohl die Kamera manchmal Pakete aufgrund verlorener Zeichen erneut senden muss. Die Ergebnisse sind besser, wenn das »interrupt-unmask flag« im IDE-Treiber gesetzt ist (I<hdparm -u1>). Unterstützte Baud-Raten sind: 9600, 19200, 38400, 57600 und 115200.

source: The dumpinquiry line causes some information about the camera to be printed.
de: Die Zeile »dumpinquiry« führt dazu, dass einige Informationen über die Kamera angezeigt werden.

source: cmdrespause specifies how many usec (1,000,000ths of a) between writing the command and reading the result should be used. 125000 seems to be the lowest I could go reliably.
de: B<cmdrespause> legt fest, wieviele µs (1.000.000-tel einer Sekunde) zwischen dem Schreiben des Befehls und dem Lesen des Ergebnisses verwendet werden soll. 125000 scheint der kleinste Wert zu sein, den ich zuverlässig verwenden könnte.

source: breakpause is the time in 1,000,000ths of a usec between sending the "back to default" break sending commands.
de: B<breakpause> ist die Zeit in 1.000.000-tel einer Sekunde (µs) zwischen dem Senden der Unterbrechung »Zurück zur Vorgabe« und dem Senden von Befehlen.

source: This environment variable specifies the list of directories that may contain the configuration file. Under UNIX, the directories are separated by a colon (`:'), under OS/2, they are separated by a semi-colon (`;'). If this variable is not set, the configuration file is searched in two default directories: first, the current working directory (".") and then in /etc/sane.d. If the value of the environment variable ends with the directory separator character, then the default directories are searched after the explicitly specified directories. For example, setting B<SANE_CONFIG_DIR> to "/tmp/config:" would result in directories "tmp/config", ".", and "/etc/sane.d" being searched (in this order).
de: Diese Umgebungsvariable gibt eine Liste von Verzeichnissen an, die die Konfigurationsdatei enthalten können. Unter UNIX sind die Verzeichnisse durch Doppelpunkte (:) getrennt, unter OS/2 durch Semikola (;). Falls diese Variable nicht gesetzt ist, wird in zwei Standardverzeichnissen nach der Konfigurationsdatei gesucht: zuerst im aktuellen Arbeitsverzeichnis (.) und dann in I</etc/sane.d>. Falls der Wert der Umgebungsvariable mit dem Verzeichnis-Trennzeichen endet, dann werden die Standardverzeichnisse nach den explizit angegebenen Verzeichnissen durchsucht. Wenn Sie beispielsweise B<SANE_CONFIG_DIR> auf »/tmp/config:« setzen, wird in den Verzeichnissen »tmp/config«, ».« und »/etc/sane.d« gesucht (in dieser Reihenfolge).

source: sane(7)
de: B<sane>(7)

source: More general comments, suggestions, and inquiries about frontends or SANE should go to the SANE Developers mailing list (see http://www.sane-project.org/mailing-lists.html for details). You must be subscribed to the list, otherwise your mail won't be sent to the subscribers.
de: Allgemeinere Kommentare, Vorschläge und Fragen über Frontends oder SANE sollten (auf Englisch) an die SANE-Entwickler-Mailingliste gehen (siehe »http://www.sane-project.org/mailing-lists.html« für Details). Sie müssen die Liste abonnieren, ansonsten werden Ihre E-Mails nicht an die Teilnehmer gesendet.
