Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-teco1.5.po
Languages: de

source: 14 Jul 2008
de: 14. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-teco1 - SANE backend for TECO / RELISYS scanners
de: sane-teco1 - SANE-Backend für Scanner von TECO/RELISYS

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-teco1> library implements a SANE (Scanner Access Now Easy) backend that provides access to some TECO SCSI flatbed scanners. This backend should be considered B<beta-quality> software! TECO scanners are sold under various brands like RELISYS, PIOTECH, TRUST. This backend may or may not support yours.
de: Die Bibliothek B<sane-teco1> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf einige TECO-SCSI-Flachbett-Scanner. Dieses Backend sollte als B<Beta-Qualität>-Software betrachtet werden! TECO-Scanner werden unter verschiedenen Marken wie Relisys, Piotech und Trust verkauft. Dieses Backend könnte Ihren Scanner unterstützen oder auch nicht.

source: The scanners that should work with this backend are:
de: Die folgenden Scanner sollten mit diesem Backend funktionieren:

source: \f(CR Vendor Model TECO model status ---------------------- -------------- ----------- Relisys AVEC 2400 VM3520 tested Relisys AVEC 2412 VM3520+ tested Relisys AVEC 4800 VM4530 untested Relisys AVEC 4816 VM4530+ untested Relisys RELI 2400 VM3530 untested Relisys RELI 2412 VM3530+ tested Relisys RELI 2412 VM3530+ untested Relisys RELI 4816 VM4540 tested Relisys RELI 4830 VM4542 tested Relisys RELI 9600 VM6530 untested Relisys RELI 9612 VM6530* untested Relisys RELI 9624 VM6530+ untested Relisys RELI 9630 VM6540 untested Relisys RELI DS15 VM3440 untested Relisys RELI DS6 VM3420 untested Dextra DF-600P VM3510 tested Dextra DF-4830T VM4542 untested Dextra DF-1200T+ VM3530+ untested Dextra DF-9624 VM6530+ untested\fR
de: \f(CR Marke Modell TECO-Modell Status ---------------------- -------------- ----------- Relisys AVEC 2400 VM3520 getestet Relisys AVEC 2412 VM3520+ getestet Relisys AVEC 4800 VM4530 nicht getestet Relisys AVEC 4816 VM4530+ nicht getestet Relisys RELI 2400 VM3530 nicht getestet Relisys RELI 2412 VM3530+ getestet Relisys RELI 2412 VM3530+ nicht getestet Relisys RELI 4816 VM4540 getestet Relisys RELI 4830 VM4542 getestet Relisys RELI 9600 VM6530 nicht getestet Relisys RELI 9612 VM6530* nicht getestet Relisys RELI 9624 VM6530+ nicht getestet Relisys RELI 9630 VM6540 nicht getestet Relisys RELI DS15 VM3440 nicht getestet Relisys RELI DS6 VM3420 nicht getestet Dextra DF-600P VM3510 getestet Dextra DF-4830T VM4542 nicht getestet Dextra DF-1200T+ VM3530+ nicht getestet Dextra DF-9624 VM6530+ nicht getestet\fR

source: Note that the untested scanner will not be directly supported. You should contact the author for that.
de: Beachten Sie, dass nicht getestete Scanner nicht direkt unterstützt werden. Sie sollten dafür zum Autor Kontakt aufnehmen.

source: The TECO VM number can usually be found at the back of the scanner. It is also part of the FCC ID. I<sane-find-scanner -v> will also show the SCSI inquiry, and if it is a TECO scanner, the name will be there too.
de: Die TECO-VM-Nummer kann normalerweise auf der Rückseite des Scanners gefunden werden. Sie ist auch Teil der FCC-Kennung. I<sane-find-scanner -v> wird auch die SCSI-Anfrage zeigen, und falls es ein TECO-Scanner ist, wird der Name auch dort sein.

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xscanimage>(1) or B<xsane>(1).
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: If you have any success with a scanner not listed here, or if you notice any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einem hier nicht aufgeführten Scanner Erfolg haben oder falls Sie merkwürdiges Verhalten beobachten, berichten Sie das bitte (auf Englisch) an den Backend-Betreuer oder an die SANE-Mailingliste.

source: Valid command line options and their syntax can be listed by using:
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: B<Scan Mode>
de: B<Scanmodus>

source: Selects the basic mode of operation of the scanner valid choices are The I<Black & White> mode is black and white only (1 bit). I<Grayscale> will produce 256 levels of gray (8 bits). I<Color> will produce a 24 bits color image.
de: wählt den grundlegenden Betriebsmodus des Scanners. Der Modus I<Black & White> ist nur schwarz und weiß (1 bit). I<Grayscale> wird 256 Graustufen erzeugen (8 bit). I<Color> erstellt ein 24-bit-Farbbild.

source: Selects the resolution for a scan. The scanner can do all resolutions between 1 and 600, in increments of 1.
de: wählt die Scan-Auflösung. Der Scanner beherrscht alle Auflösungen von 1 bis 600 in Schritten von 1.

source: B<Geometry options>
de: B<Geometrieoptionen>

source: Controls the scan area: B<-l> sets the top left x coordinate, B<-t> the top left y coordinate, B<-x> selects the width and B<-y> the height of the scan area. All parameters are specified in millimeters by default.
de: steuert den Scan-Bereich: B<-l> setzt die obere linke x-Koordinate, B<-t> die obere linke y-Koordinate, B<-x> wählte die Breite und B<-y> die Höhe des Scan-Bereichs. Alle Parameter werden standardmäßig in Millimetern angegeben.

source: B<Enhancement options>
de: B<Verbesserungsoptionen>

source: (color mode only) allows the user to specify a gamma table (see the next 3 parameters).
de: erlaubt dem Benutzer, eine Gamma-Tabelle anzugeben (nur im Farb-Modus, siehe die nächsten drei Parameter)

source: Can be used to download a user defined gamma table for the red channel. The table must be 256 bytes long. Color mode only.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den roten Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. Nur im Farbmodus.

source: Can be used to download a user defined gamma table for the green channel. The table must be 256 bytes long. Color mode only.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den grünen Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. Nur im Farbmodus.

source: Can be used to download a user defined gamma table for the blue channel. The table must be 256 bytes long. Color mode only.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den blauen Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. Nur im Farbmodus.

source: Select the dither mask to use. Black & White only.
de: wählt die zu verwendende Dither-Maske aus. Nur bei schwarz/weiß.

source: Requests a preview scan. The resolution used is 22 dpi and the scan area is the maximum allowed. The scan mode is user selected. The default is "no".
de: erbittet einen Vorschau-Scan. Die verwendete Auflösung ist 22 DPI und der Scan-Bereich ist der größte erlaubte. Der Scan-Modus wird vom Anwender ausgewählt. Die Vorgabe ist »no«.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/teco1.conf> supports only one item: the device name to use (eg I</dev/scanner>).
de: Die Konfigurationsdatei I</etc/sane.d/teco1.conf> unterstützt nur einen Eintrag: den Namen des zu verwendenden Geräts (zum Beispiel I</dev/scanner>).

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: LIMITATIONS
de: EINSCHRÄNKUNGEN

source: The windows TWAIN driver has many more options than this SANE backend. However they are only software adjustments. This backend only implements what the scanner can support.
de: Der TWAIN-Treiber für Windows verfügt über weitaus mehr Optionen als dieses SANE-Backend. Allerdings sind diese nur softwareseitige Anpassungen. Dieses Backend implementiert nur das, was der Scanner unterstützen kann.

source: BUGS
de: FEHLER

source: None known.
de: Keine bekannt.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: The package is actively maintained by Frank Zago.
de: Das Paket wird aktiv von Frank Zago betreut.

source: CREDITS
de: DANKSAGUNGEN

source: Thanks to Gerard Delafond for the VM4542 support. Thanks to Jean-Yves Simon for the VM3510 support.
de: Danke an Gerard Delafond für die VM4542-Unterstützung. Danke an Jean-Yves Simon für die VM3510-Unterstützung.

source: \f(CR Vendor Model TECO model status ---------------------- -------------- ----------- Relisys AVEC 2400 VM3520 tested Relisys AVEC 2412 VM3520+ tested Relisys AVEC 4800 VM4530 untested Relisys AVEC 4816 VM4530+ untested Relisys RELI 2400 VM3530 untested Relisys RELI 2412 VM3530+ tested Relisys RELI 2412 VM3530+ untested Relisys RELI 4816 VM4540 tested Relisys RELI 4830 VM4542 tested Relisys RELI 9600 VM6530 untested Relisys RELI 9612 VM6530* untested Relisys RELI 9624 VM6530+ untested Relisys RELI 9630 VM6540 untested Relisys RELI DS15 VM3440 untested Relisys RELI DS6 VM3420 untested Dextra DF-600P VM3510 tested Dextra DF-4830T VM4542 untested Dextra DF-1200T+ VM3530+ untested Dextra DF-9624 VM6530+ untested\fR
de: \f(CR Marke Modell TECO-Modell Status ---------------------- -------------- ----------- Relisys AVEC 2400 VM3520 getestet Relisys AVEC 2412 VM3520+ getestet Relisys AVEC 4800 VM4530 nicht getestet Relisys AVEC 4816 VM4530+ nicht getestet Relisys RELI 2400 VM3530 nicht getestet Relisys RELI 2412 VM3530+ getestet Relisys RELI 2412 VM3530+ nicht getestet Relisys RELI 4816 VM4540 getestet Relisys RELI 4830 VM4542 getestet Relisys RELI 9600 VM6530 nicht getestet Relisys RELI 9612 VM6530* nicht getestet Relisys RELI 9624 VM6530+ nicht getestet Relisys RELI 9630 VM6540 nicht getestet Relisys RELI DS15 VM3440 nicht getestet Relisys RELI DS6 VM3420 nicht getestet Dextra DF-600P VM3510 getestet Dextra DF-4830T VM4542 nicht getestet Dextra DF-1200T+ VM3530+ nicht getestet Dextra DF-9624 VM6530+ nicht getestet\fR

source: The TECO VM number can usually be found at the back of the scanner. It is also part of the FCC ID. "sane-find-scanner -v" will also show the scsi inquiry, and if it is a TECO scanner, the name will be there too.
de: Die TECO-VM-Nummer kann normalerweise auf der Rückseite des Scanners gefunden werden. Sie ist auch Teil der FCC-Kennung. I<sane-find-scanner -v> wird auch die SCSI-Anfrage zeigen, und falls es ein TECO-Scanner ist, wird der Name auch dort sein.

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in xscanimage or xsane.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xscanimage>(1) oder B<xsane>(1) gesteuert werden.

source: If you have any success with a scanner not listed here, or if you have any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einem hier nicht aufgeführten Scanner Erfolg haben oder falls Sie merkwürdiges Verhalten beobachten, berichten Sie das bitte (auf Englisch) an den Backend-Betreuer oder an die SANE-Mailingliste.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: selects the basic mode of operation of the scanner valid choices are I<Black & White> , I<Grayscale> and I<Color> The Black & White mode is black and white only (1 bit). Grayscale will produce 256 levels of gray (8 bits). Color will produce a 24 bits color image.
de: wählt den grundlegenden Betriebsmodus des Scanners. Gültige Auswahlen sind I<Black & White>, I<Grayscale> und I<Color>. Der Modus I<Black & White> ist nur schwarz und weiß (1 bit). I<Grayscale> wird 256 Graustufen erzeugen (8 bit). I<Color> erstellt ein 24-bit-Farbbild.

source: selects the resolution for a scan. The scanner can do all resolutions between 1 and 600, in increments of 1.
de: wählt die Scan-Auflösung. Der Scanner beherrscht alle Auflösungen von 1 bis 600 in Schritten von 1.

source: control the scan area: -l sets the top left x coordinate, -t the top left y coordinate, -x selects the width and -y the height of the scan area. All parameters are specified in millimeters by default.
de: steuern den Scan-Bereich: »-l« setzt die obere linke X-Koordinate, »-t« die obere linke Y-Koordinate, »-x« wählt die Breite und »-y« die Höhe des Scan-Bereichs. Alle Parameter werden in Millimetern angegeben.

source: (color mode only) can be used to download a user defined gamma table for the red channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Rot-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (color mode only) can be used to download a user defined gamma table for the green channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Grün-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (color mode only) can be used to download a user defined gamma table for the blue channel. The table must be 256 bytes long.
de: kann zum Herunterladen einer benutzerdefinierten Gamma-Tabelle für den Blau-Kanal verwendet werden. Die Tabelle muss 256 byte lang sein. (nur im Farb-Modus)

source: (Black & White only) select the dither mask to use. Possible values are I<Line art> , I<2x2> , I<3x3> , I<4x4 bayer> , I<4x4 smooth> , I<8x8 bayer> , I<8x8 smooth> , I<8x8 horizontal> and I<8x8 vertical>
de: wählt die zu verwendende Dither-Maske aus (nur bei schwarz/weiß). Mögliche Werte sind I<Line art>, I<2x2>, I<3x3> , I<4x4 bayer>, I<4x4 smooth>, I<8x8 bayer>, I<8x8 smooth>, I<8x8 horizontal> und I<8x8 vertical>.

source: requests a preview scan. The resolution used for that scan is 22 dpi and the scan area is the maximum allowed. The scan mode is user selected. The default is "no".
de: erbittet einen Vorschau-Scan. Die für diesen Scan verwendete Auflösung ist 22 DPI und der Scan-Bereich ist der größte erlaubte. Der Scan-Modus wird vom Anwender ausgewählt. Die Vorgabe ist »no«.

source: The configuration file @CONFIGDIR@/teco1.conf supports only one information: the device name to use (eg /dev/scanner).
de: Die Konfigurationsdatei @CONFIGDIR@/teco1.conf unterstützt nur eine Information: den Namen des zu verwendenden Geräts (zum Beispiel I</dev/scanner>).

source: The configuration file /etc/sane.d/teco1.conf supports only one information: the device name to use (eg /dev/scanner).
de: Die Konfigurationsdatei /etc/sane.d/teco1.conf unterstützt nur eine Information: den Namen des zu verwendenden Geräts (zum Beispiel I</dev/scanner>).
