Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-kvs40xx.5.po
Languages: de

source: 03 Jun 2011
de: 3. Juni 2011

source: NAME
de: BEZEICHNUNG

source: sane-kvs40xx - SANE backend for Panasonic KV-S40xxC USB/SCSI ADF scanners.
de: sane-kvs40xx - SANE-Backend für KV-S40xxC USB/SCSI-ADF-Scanner von Panasonic

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-kvs40xx> library implements a SANE (Scanner Access Now Easy) backend which provides access to the Panasonic KV-S40xxC and KV-S70xxC scanners.
de: Die Bibliothek B<sane-kvs40xx> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf die Scanner KV-S40xxC und KV-S70xxC von Panasonic.

source: KNOWN ISSUES
de: BEKANNTE PROBLEME

source: This document was written by the SANE project, which has no information regarding the capabilities or reliability of the backend. All information contained here is suspect.
de: Dieses Dokument wurde vom SANE-Projekt geschrieben, welches nicht über Informationen bezüglich der Fähigkeiten oder der Zuverlässigkeit des Backends verfügt. Alle hier enthaltenen Informationen sind als Vermutungen zu betrachten.

source: The backend uses pthreads directly, and so requires pthreads to be enabled.
de: Das Backend verwendet Pthreads direkt; daher muss Pthreads aktiviert werden.

source: CREDITS
de: DANKSAGUNGEN

source: The backend was written by Panasonic Russia Ltd.
de: Das Backend wurde von Panasonic Russia Ltd. geschrieben.

source: The backend was ported to sane-backends 1.0.23 and downgraded to C89 by m. allan noah.
de: Das Backend wurde von M. Allan Noah auf sane-backends 1.0.22 portiert und auf den Sprachumfang von C89 reduziert.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHOR
de: AUTOR

source: sane(7), sane-usb(5), sane-scsi(5)
de: B<sane>(7), B<sane-usb>(5), B<sane-scsi>(5)
