Repository: sebras/manpages-l10n
Catalog: po/*/man5/sane-stv680.5.po
Languages: de

source: 11 Jul 2008
de: 11. Juli 2008

source: NAME
de: BEZEICHNUNG

source: sane-stv680 - SANE backend for STV680 camera's
de: sane-stv680 - SANE-Backend für STV680-Kameras

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<sane-stv680> library implements a SANE (Scanner Access Now Easy) backend that provides access to some STV680 cameras. This backend should be considered B<beta-quality> software! STV680 cameras are sold under various brands like Aiptek. This backend may or may not support yours.
de: Die Bibliothek B<sane-stv680> implementiert ein SANE-(Scanner Access Now Easy) Backend zum Zugriff auf einige STV680-Kameras. Dieses Backend sollte als Software im B<Beta-Stadium> betrachtet werden! STV680-Kameras werden unter verschiedenen Marken wie Aiptek verkauft. Dieses Backend könnte Ihre Kamera unterstützen oder auch nicht.

source: The cameras that should work with this backend are:
de: Die folgenden Kameras sollten mit diesem Backend funktionieren:

source: \f(CRVendor Model USB vendor id USB product id status ------------------------ ------------- -------------- -------- AIPTEK stv680 0x0553 0x0202 basic Konica e-mini 0x04c8 0x0722 untested DigitalDream l'espion XS 0x1183 0x0001 untested Creative WebCam Go mini 0x041e 0x4007 untested\fR
de: \f(CRMarke Modell USB-Marken- USB-Produkt- Status \f(CR Kennung Kennung ------------------------ ------------- -------------- -------- AIPTEK stv680 0x0553 0x0202 grundlegend Konica e-mini 0x04c8 0x0722 nicht getestet DigitalDream l'espion XS 0x1183 0x0001 nicht getestet Creative WebCam Go mini 0x041e 0x4007 nicht getestet\fR

source: For all these cameras, see the backend home page (under AUTHOR) for the exact status of each camera.
de: Für alle diese Kameras siehe die Homepage des Backends (unter AUTOR) für den genauen Status der jeweiligen Kamera.

source: For startup of this backend check that if present the stv680 kernel module is removed or disabled.
de: Zum Starten dieses Backends prüfen Sie, ob das stv680K-Kernelmodul, falls vorhanden, entladen oder deaktiviert ist.

source: Also before using, enable the backend by editing the I</etc/sane.d/dll.conf> file, change #stv680 to stv680.
de: Vor der Verwendung aktivieren Sie auch das Backend durch Bearbeiten der Datei I</etc/sane.d/dll.conf>. Ändern Sie »#stv680« in »stv680«.

source: For problems with the untested cameras, you should contact the author for that.
de: Für Probleme mit nicht getesteten Kameras sollten Sie den Autor kontaktieren.

source: The options the backend supports can either be selected through command line options to programs like B<scanimage>(1) or through GUI elements in B<xcam>(1). For both programs use the B<-B> option needed for size buffer.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xcam>(1) gesteuert werden. Verwenden Sie für beide Programme die Option B<-B>, die für die Größe des Puffers benötigt wird.

source: Some frontends examples:
de: Einige Beispiele für Oberflächen:

source: B<scanimage>(1): for writing in batch mode to a file or to a new file each time:
de: B<scanimage>(1): Zum Schreiben im Stapelverarbeitungsmodus in eine Datei oder jedes Mal in eine neue Datei:

source: scanimage -B -d stv680:libusb:001:002 --batch=out.ppm --batch-count 5 --mode "Color RGB"
de: scanimage -B -d stv680:libusb:001:002 --batch=ausgabe.ppm --batch-count 5 --mode "Color RGB"

source: scanimage -B -d stv680:libusb:001:002 --batch=out%d.ppm --batch-count 5 --mode "Color RGB"
de: scanimage -B -d stv680:libusb:001:002 --batch=ausgabe%d.ppm --batch-count 5 --mode "Color RGB"

source: If you have any success with a camera not listed here, or if you observe any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einer hier nicht aufgeführten Kamera Erfolg haben oder falls Sie merkwürdiges Verhalten beobachten, berichten Sie dies bitte auf Englisch dem Backend-Betreuer oder auf der SANE-Mailingliste.

source: Valid command line options and their syntax can be listed by using:
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: B<Scan Mode>
de: B<Scanmodus>

source: selects the basic mode of operation of the webcams valid choices.
de: wählt den grundlegenden Betriebsmodus aus der gültigen Auswahl der Webcam.

source: The read resolution mode is 8 bits, output resolution is 24 bits. Selects the resolution for a scan. The camera can do only the resolutions listed.
de: Der Lese-Auflösungsmodus ist 8 bit, die Ausgabeauflösung ist 24 bit. Wählen Sie für einen Scan die Auflösung. Die Kamera beherrscht nur die aufgeführten Auflösungen.

source: In this mode raw data is displayed
de: In diesem Modus werden rohe Daten dargestellt.

source: In this mode the bayer unshuffle is done but no color correction
de: In diesem Modus erfolgt die Bayer-Entmischung, aber keine Farbkorrektur.

source: Bayer unshuffle, color correction
de: Bayer-Entmischung, Farbkorrektur.

source: Bayer unshuffle, color correction, textline with date and time is added
de: Bayer-Entmischung, Farbkorrektur, Textzeile mit Datum und Zeit hinzugefügt

source: B<Enhancement options>
de: B<Verbesserungsoptionen>

source: Selects what red radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale -32 .. 0 .. +32 in steps of 1.
de: wählt die Helligkeitstufe für rot aus, die als »weiß« betrachtet werden soll, wenn einige Blätter gescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist -32 .. 0 .. +32 in Schritten von 1.

source: Selects what green radiance level should be considered "white", when scanning some sheets by changing the calibration i value loaded into the scanner. Scale -32 .. 0 .. +32 in steps of 1.
de: wählt die Helligkeitstufe für grün aus, die als »weiß« betrachtet werden soll, wenn einige Blätter gescannt werden, indem der in den Scanner geladene Kalibrierungswert i geändert wird. Die Skala ist -32 .. 0 .. +32 in Schritten von 1.

source: Selects what blue radiance level should be considered "white", when scanning some sheets by changing the calibration value loaded into the scanner. Scale -32 .. 0 .. +32 in steps of 1.
de: wählt die Helligkeitstufe für blau aus, die als »weiß« betrachtet werden soll, wenn einige Blätter gescannt werden, indem der in den Scanner geladene Kalibrierungswert geändert wird. Die Skala ist -32 .. 0 .. +32 in Schritten von 1.

source: CONFIGURATION FILE
de: KONFIGURATIONSDATEI

source: The configuration file I</etc/sane.d/stv680.conf> supports only one item: the device name to use (eg usb 0x.... 0x....).
de: Die Konfigurationsdatei I</etc/sane.d/stv680.conf> unterstützt nur einen Eintrag: den zu verwendenden Gerätenamen (z.B. usb 0x… 0x…).

source: FILES
de: DATEIEN

source: The static library implementing this backend.
de: Die statische Bibliothek, die dieses Backend implementiert.

source: The shared library implementing this backend (present on systems that support dynamic loading).
de: Die dynamische Bibliothek, die dieses Backend implementiert (auf Systemen verfügbar, die dynamisches Laden unterstützen).

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: If the library was compiled with debug support enabled, this environment variable controls the debug level for this backend. E.g., a value of 128 requests all debug output to be printed. Smaller levels reduce verbosity.
de: Falls die Bibliothek mit Debug-Unterstützung kompiliert wurde, steuert diese Umgebungsvariable die Debug-Stufe für dieses Backend. Beispielsweise bewirkt ein Wert von 128 die Anzeige sämtlicher Debug-Ausgaben. Kleinere Werte reduzieren die Ausführlichkeit.

source: LIMITATIONS
de: EINSCHRÄNKUNGEN

source: The windows TWAIN driver has many more options than this SANE backend. However they are only software adjustments. This backend only implements what the webcam can support.
de: Der TWAIN-Treiber für Windows verfügt über weitaus mehr Optionen als dieses SANE-Backend. Allerdings sind diese nur softwareseitige Anpassungen. Dieses Backend implementiert nur das, was die Webcam unterstützen kann.

source: BUGS
de: FEHLER

source: Plenty. Parts of this backend are still under development.
de: Viele. Teile dieses Backends befinden sich noch in der Entwicklung.

source: 1. Some untested cameras.
de: 1. Einige ungetestete Kameras.

source: 2. Video streaming slow and stops sometimes (scanimage).
de: 2. Video-Übertragung langsam und stoppt manchmal (Scanimage).

source: 3. Sometimes 1/3 of image is NOK (xcam).
de: 3. Manchmal ist 1/3 des Bildes nicht in Ordnung (Xcam).

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: CREDITS
de: DANKSAGUNGEN

source: Thanks to developers of the other stv680 programs:
de: Dank an die Entwickler der anderen Stv680-Programme:

source: STV680 kernel module
de: STV680-Kernelmodul

source: pencam2 program
de: pencam2-Programm

source: B<libghoto2>(3) program (camlib stv0680)
de: B<libghoto2>(3)-Programm (Camlib stv0680)

source: Also before using, enable the backend by editing the /etc/sane.d/dll.conf file, change #stv680 to stv680.
de: Vor der Verwendung aktivieren Sie auch das Backend durch Bearbeiten der Datei I</etc/sane.d/dll.conf>. Ändern Sie »#stv680« in »stv680«.

source: The options the backend supports can either be selected through command line options to programs like scanimage or through GUI elements in xcam. For both programs use the -B option needed for size buffer.
de: Die vom Backend unterstützten Optionen können entweder in der Befehlszeile an Programme wie B<scanimage>(1) übergeben oder über Bedienelemente der grafischen Benutzeroberoberfläche in B<xcam>(1) gesteuert werden. Verwenden Sie für beide Programme die Option B<-B>, die für die Größe des Puffers benötigt wird.

source: scanimage: for writing in batch mode to a file or to a new file each time.
de: Scanimage: Zum Schreiben im Stapelverarbeitungsmodus in eine Datei oder jedes Mal in eine neue Datei:

source: If you have any success with a camera not listed here, or if you have any strange behavior, please report to the backend maintainer or to the SANE mailing list.
de: Falls Sie mit einer hier nicht aufgeführten Kamera Erfolg haben oder falls Sie merkwürdiges Verhalten haben, berichten Sie dies bitte auf Englisch dem Backend-Betreuer oder auf der SANE-Mailingliste.

source: Valid command line options and their syntax can be listed by using
de: Gültige Befehlszeilenoptionen und deren Syntax können Sie mit folgendem Befehl auflisten:

source: The configuration file /etc/sane.d/stv680.conf supports only one information: the device name to use (eg usb 0x.... 0x....).
de: Die Konfigurationsdatei I</etc/sane.d/stv680.conf> unterstützt nur eine Information: den zu verwendenden Gerätenamen (z.B. usb 0x… 0x…).

source: sane-usb(5), scanimage(1), xcam(1), sane(7)
de: B<sane-usb>(5), B<scanimage>(1), B<xcam>(1), B<sane>(7)

source: libghoto2 program (camlib stv0680)
de: Libghoto2-Programm (Camlib stv0680)
