Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.device.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.device - Device unit configuration
de: systemd.device - Geräte-Unit-Konfiguration

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: A unit configuration file whose name ends in "\&.device" encodes information about a device unit as exposed in the sysfs/B<udev>(7) device tree\&. This may be used to define dependencies between devices and other units\&.
de: Eine Unit-Konfigurationsdatei, deren Namen in »\&.device« endet, kodiert Informationen über eine Geräte-Unit, wie diese von dem Gerätebaum sysfs/B<udev>(7) offengelegt wird\&. Dies kann zur Definition von Abhängigkeiten zwischen Geräten und anderen Units verwandt werden\&.

source: This unit type has no specific options\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. A separate [Device] section does not exist, since no device-specific options may be configured\&.
de: Dieser Unit-Typ hat keine spezifischen Optionen\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien\&. Die gemeinsamen Konfigurationseinträge werden in den generischen Abschnitten [Unit] und [Install] konfiguriert\&. Es existiert kein separater Abschnitt »[Device]«, da keine gerätespezifischen Optionen konfiguriert werden können\&.

source: systemd will dynamically create device units for all kernel devices that are marked with the "systemd" udev tag (by default all block and network devices, and a few others)\&. Note that I<if >I<systemd-udevd\&.service>I< is not running, no device units will be available (for example in a typical container)>\&.
de: Systemd wird dynamisch Geräte-Units für alle Kernelgeräte, die mit der Udev-Markierung »systemd« markiert sind (standardmäßig alle Block- und Netzwerkgeräte sowie ein paar andere), erstellen\&. Beachten Sie, dass I<keine Geräte-Units verfügbar sein werden (beispielsweise in einem typischen Container), falls >I<systemd-udevd\&.service>I< nicht läuft>\&.

source: Device units are named after the /sys/ and /dev/ paths they control\&. Example: the device /dev/sda5 is exposed in systemd as dev-sda5\&.device\&. For details about the escaping logic used to convert a file system path to a unit name see B<systemd.unit>(5)\&.
de: Geräte-Units werden nach den /sys/- und /dev/-Pfaden, die sie steuern, benannt\&. Beispiel: Das Gerät /dev/sda5 wird in Systemd durch dev-sda5\&.device offengelegt\&. Für Details über die Maskierungslogik zur Umwandlung eines Dateisystempfades in einen Unit-Namen siehe B<systemd.unit>(5)\&.

source: To tag a udev device, use "TAG+="systemd"" in the udev rules file, see B<udev>(7) for details\&.
de: Um ein Udev-Gerät zu markieren, verwenden Sie in der Udev-Regel-Datei »TAG+="systemd"«, siehe B<udev>(7) für Details\&.

source: Device units will be reloaded by systemd whenever the corresponding device generates a "changed" event\&. Other units can use I<ReloadPropagatedFrom=> to react to that event\&.
de: Geräte-Units werden von Systemd neu geladen, wenn das entsprechende Gerät ein »Änderungs«-Ereignis erstellt\&. Andere Units können I<ReloadPropagatedFrom=> verwenden, um auf solche Ereignisse zu reagieren\&.

source: AUTOMATIC DEPENDENCIES
de: AUTOMATISCHE ABHÄNGIGKEITEN

source: Implicit Dependencies
de: Implizite Abhängigkeiten

source: Many unit types automatically acquire dependencies on device units of devices they require\&. For example, \&.socket unit acquire dependencies on the device units of the network interface specified in I<BindToDevice=>\&. Similar, swap and mount units acquire dependencies on the units encapsulating their backing block devices\&.
de: Viele Unit-Typen erlangen automatisch Abhängigkeiten von Geräte-Units von Geräten, die sie benötigen\&. Beispielsweise erlangt eine Unit \&.socket eine Abhängigkeit auf die Geräte-Unit der in I<BindToDevice=> festgelegten Netzwerkschnittstelle\&. Ähnlich erlangen Auslagerungs- und Einhänge-Units Abhängigkeiten auf die Units, die die darunterliegenden Blockgeräte kapseln\&.

source: Default Dependencies
de: Standardabhängigkeiten

source: There are no default dependencies for device units\&.
de: Für Geräte-Units gibt es keine Standardabhängigkeiten\&.

source: THE UDEV DATABASE
de: DIE UDEV-DATENBANK

source: Unit settings of device units may either be configured via unit files, or directly from the udev database\&. The following udev device properties are understood by the service manager:
de: Unit-Einstellungen von Geräte-Units können entweder über Unit-Dateien oder direkt aus der Udev-Datenbank konfiguriert werden\&. Die folgenden Udev-Geräteeigenschaften werden vom Diensteverwalter verstanden:

source: Adds dependencies of type I<Wants=> from the device unit to the specified units\&. I<SYSTEMD_WANTS=> is read by the system service manager, I<SYSTEMD_USER_WANTS=> by user service manager instances\&. These properties may be used to activate arbitrary units when a specific device becomes available\&.
de: Fügt Abhängigkeiten vom Typ I<Wants=> von der Geräte-Unit auf die festgelegten Units hinzu\&. I<SYSTEMD_WANTS=> wird vom Systemdiensteverwalter gelesen, I<SYSTEMD_USER_WANTS=> durch Benutzerdiensteverwalterinstanzen\&. Diese Eigenschaften können dazu benutzt werden, beliebige Units zu aktivieren, wenn ein festgelegtes Gerät verfügbar wird\&.

source: Note that this and the other udev device properties are not taken into account unless the device is tagged with the "systemd" tag in the udev database, because otherwise the device is not exposed as a systemd unit (see above)\&.
de: Beachten Sie, dass diese und andere Udev-Geräteeigenschaften nicht berücksichtigt werden, außer das Gerät ist mit der Markierung »systemd« in der Udev-Datenbank gekennzeichnet, da andernfalls das Gerät nicht als eine Systemd-Unit offengelegt ist (siehe oben)\&.

source: Note that systemd will only act on I<Wants=> dependencies when a device first becomes active\&. It will not act on them if they are added to devices that are already active\&. Use I<SYSTEMD_READY=> (see below) to configure when a udev device shall be considered active, and thus when to trigger the dependencies\&.
de: Beachten Sie, dass Systemd nur auf I<Wants=>-Abhängigkeiten agiert, wenn das Gerät erstmalig aktiviert wird\&. Es wird nicht darauf agieren, wenn sie zu Geräten hinzugefügt werden, die bereits aktiv sind\&. Verwenden Sie I<SYSTEMD_READY=> (siehe unten), um zu konfigurieren, wann Udev als aktiv betrachtet werden soll und daher wann die Abhängigkeiten ausgelöst werden sollen\&.

source: The specified property value should be a space-separated list of valid unit names\&. If a unit template name is specified (that is, a unit name containing an "@" character indicating a unit name to use for multiple instantiation, but with an empty instance name following the "@"), it will be automatically instantiated by the device\*(Aqs "sysfs" path (that is: the path is escaped and inserted as instance name into the template unit name)\&. This is useful in order to instantiate a specific template unit once for each device that appears and matches specific properties\&.
de: Der angegebene Eigenschaftswert sollte die Form einer durch Leerzeichen getrennten Liste von gültigen Unit-Namen sein\&. Unit-Vorlagennamen können ein »@«-Zeichen enthalten, das einen für den Einsatz in mehrere Instanziierungen gedachten Unit-Namen anzeigt, aber mit einem leeren Instanznamen nach dem »@«\&. In einem solchen Fall wird aus diesem automatisch eine Instanz für den »sysfs«-Pfad des Gerätes\&. Das heißt, dass der Pfad maskiert und als Instanzname in den Unit-Vorlagennamen eingefügt wird\&. Dies ist nützlich, um einmalig eine Instanz einer bestimmten Vorlagen-Unit für jedes auftauchende Gerät zu erstellen, das auf bestimmte Eigenschaften passt\&.

source: Adds an additional alias name to the device unit\&. This must be an absolute path that is automatically transformed into a unit name\&. (See above\&.)
de: Fügt einen zusätzlichen Alias-Namen zu der Geräte-Unit hinzu\&. Dies muss ein absoluter Pfad sein, der automatisch in einen Unit-Namen umgewandelt wird\&. (Siehe oben\&.)

source: If set to 0, systemd will consider this device unplugged even if it shows up in the udev tree\&. If this property is unset or set to 1, the device will be considered plugged if it is visible in the udev tree\&.
de: Falls auf 0 gesetzt, wird Systemd das Gerät als ausgesteckt betrachten, selbst falls es im Udev-Baum auftaucht\&. Falls diese Eigenschaft nicht gesetzt oder auf 1 gesetzt ist, wird das Gerät als eingesteckt betrachtet, falls es im Udev-Baum sichtbar ist\&.

source: This option is useful for devices that initially show up in an uninitialized state in the tree, and for which a "changed" event is generated the moment they are fully set up\&. Note that I<SYSTEMD_WANTS=> (see above) is not acted on as long as I<SYSTEMD_READY=0> is set for a device\&.
de: Diese Option ist für Geräte nützlich, die anfänglich in einem nicht initialisierten Zustand in dem Baum auftauchen und für die in dem Moment, wo sie komplett eingerichtet sind, ein »Änderungs«-Ereignis generiert wird\&. Beachten Sie, dass auf I<SYSTEMD_WANTS=> (siehe oben) nicht agiert wird, solange I<SYSTEMD_READY=0> für ein Gerät gesetzt ist\&.

source: If set, this property is used as description string for the device unit\&.
de: Falls gesetzt, wird diese Eigenschaft als Beschreibungszeichenkette für die Geräte-Unit verwandt\&.

source: OPTIONS
de: OPTIONEN

source: Device unit files may include [Unit] and [Install] sections, which are described in B<systemd.unit>(5)\&. No options specific to this file type are supported\&.
de: Geräte-Unit-Dateien können Abschnitte [Unit] und [Install] enthalten, die in B<systemd.unit>(5) beschrieben sind\&. Es werden keine für diesen Dateityp spezifischen Optionen unterstützt\&.

source: SEE ALSO
de: SIEHE AUCH

source: systemd will dynamically create device units for all kernel devices that are marked with the "systemd" udev tag (by default all block and network devices, and a few others)\&. Note that I<if >I<systemd-udev\&.service>I< is not running, no device units will be available (for example in a typical container)>\&.
de: Systemd wird dynamisch Geräte-Units für alle Kernelgeräte, die mit der Udev-Markierung »systemd« markiert sind (standardmäßig alle Block- und Netzwerkgeräte sowie ein paar andere), erstellen\&. Beachten Sie, dass I<keine Geräte-Units verfügbar sein werden (beispielsweise in einem typischen Container), falls >I<systemd-udev\&.service>I< nicht läuft>\&.
