Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: For this, systemd knows the setting I<RemainAfterExit=>B<yes>, which causes systemd to consider the unit to be active if the start action exited successfully\&. This directive can be used with all types, but is most useful with I<Type=>B<oneshot> and I<Type=>B<simple>\&. With I<Type=>B<oneshot>, systemd waits until the start action has completed before it considers the unit to be active, so dependencies start only after the start action has succeeded\&. With I<Type=>B<simple>, dependencies will start immediately after the start action has been dispatched\&. The following unit provides an example for a simple static firewall\&.
uk: Для цього systemd отримує параметр I<RemainAfterExit=>B<yes>, який спричиняє те, що systemd вважатиме модуль активним, якщо дію із запуску буде успішно завершено\&. Цю директиву може бути використано із усіма типами, але найкорисніша вона з I<Type=>B<oneshot> і I<Type=>B<simple>\&. З I<Type=>B<oneshot> systemd очікує, доки буде завершено дію із запуску, перш ніж почне вважати, що модуль є активним, тому запуск залежностей розпочнеться після успішного завершення дії із запуску\&. З I<Type=>B<simple> залежності буде запущено негайно після розміщення у розкладі дії із запуску\&. Наведений нижче модуль є прикладом для простого статичного брандмауера\&.

source: Since the unit is considered to be running after the start action has exited, invoking B<systemctl start> on that unit again will cause no action to be taken\&.
uk: Оскільки модуль вважається таким, що працює, після завершення дії зі запуску, повторний виклик B<systemctl start> для цього модуля не призведе до виконання жодних дій\&.

source: B<Example\ \&5.\ \&Traditional forking services>
uk: B<Приклад\ \&5.\ \&Традиційні служби із відгалуженням>

source: Many traditional daemons/services background (i\&.e\&. fork, daemonize) themselves when starting\&. Set I<Type=>B<forking> in the service\*(Aqs unit file to support this mode of operation\&. systemd will consider the service to be in the process of initialization while the original program is still running\&. Once it exits successfully and at least a process remains (and I<RemainAfterExit=>B<no>), the service is considered started\&.
uk: Багато традиційних фонових та звичайних служб під час запуску переводять себе у фоновий режим (тобто виконують відгалуження, переведення у режим демона)\&. Встановіть I<Type=>B<forking> у файлі модуля служби для підтримки цього режиму роботи\&. systemd вважатиме службу такою, що перебуває у процесі ініціалізації, доки початкова програма продовжуватиме роботу\&. Щойно роботу програми буде успішно завершено, і лишиться принаймні один процес (і I<RemainAfterExit=>B<no>), служба вважатиметься запущеною\&.

source: Often, a traditional daemon only consists of one process\&. Therefore, if only one process is left after the original process terminates, systemd will consider that process the main process of the service\&. In that case, the I<$MAINPID> variable will be available in I<ExecReload=>, I<ExecStop=>, etc\&.
uk: Часто традиційна фонова служба складається з одного процесу\&. Тому, якщо після завершення початкового процесу лишається лише один процес, systemd вважатиме цей процес основним процесом служби\&. У цьому випадку змінна I<$MAINPID> буде доступною у I<ExecReload=>, I<ExecStop=> тощо\&.

source: In case more than one process remains, systemd will be unable to determine the main process, so it will not assume there is one\&. In that case, I<$MAINPID> will not expand to anything\&. However, if the process decides to write a traditional PID file, systemd will be able to read the main PID from there\&. Please set I<PIDFile=> accordingly\&. Note that the daemon should write that file before finishing with its initialization\&. Otherwise, systemd might try to read the file before it exists\&.
uk: Якщо лишиться більше одного процесу, systemd не зможе визначити основний процес, тому не вважатиме, що такий процес існує\&. У такому випадку I<$MAINPID> матиме порожнє значення\&. Втім, якщо процес вирішить записати традиційний PID, systemd зможе прочитати основний PID з нього\&. Будь ласка, встановіть I<PIDFile=> відповідним чином\&. Зауважте, що фонова служба має записати цей файл до завершення ініціалізації\&. Якщо цього не буде зроблено, systemd може спробувати прочитати файл, перш ніж він почне існувати\&.

source: The following example shows a simple daemon that forks and just starts one process in the background:
uk: У наведеному нижче прикладі показано просту фонову службу, яка відгалужує і просто запускає один процес у фоновому режимі:

source: [Unit] Description=Some simple daemon
uk: [Unit] Description=Якась проста фонова служба

source: Please see B<systemd.kill>(5) for details on how you can influence the way systemd terminates the service\&.
uk: Будь ласка, ознайомтеся зі сторінкою підручника щодо B<systemd.kill>(5), щоб дізнатися більше про те, як вплинути на спосіб, у який systemd перериває роботу служби\&.

source: B<Example\ \&6.\ \&DBus services>
uk: B<Приклад\ \&6.\ \&Служби DBus>

source: For services that acquire a name on the DBus system bus, use I<Type=>B<dbus> and set I<BusName=> accordingly\&. The service should not fork (daemonize)\&. systemd will consider the service to be initialized once the name has been acquired on the system bus\&. The following example shows a typical DBus service:
uk: Для служб, яка надсилає запит щодо назви на системному каналі DBus, скористайтеся I<Type=>B<dbus> і встановіть I<BusName=> відповідним чином\&. Служба не повинна виконувати відгалуження (переходити у фоновий режим)\&. systemd вважатиме службу ініціалізованою, щойно буде отримано назву на системному каналі\&. У наведеному нижче прикладі показано типову службу DBus:

source: [Unit] Description=Simple DBus service
uk: [Unit] Description=Проста служба DBus

source: For I<bus-activatable> services, do not include a [Install] section in the systemd service file, but use the I<SystemdService=> option in the corresponding DBus service file, for example (/usr/share/dbus-1/system-services/org\&.example\&.simple-dbus-service\&.service):
uk: Для служб I<bus-activatable> не включайте розділ [Install] у файлі служби systemd, а скористайтеся параметром I<SystemdService=> у відповідному файлі служби DBus\&. Приклад (/usr/share/dbus-1/system-services/org\&.example\&.simple-dbus-service\&.service):

source: B<Example\ \&7.\ \&Services that notify systemd about their initialization>
uk: B<Приклад\ \&7.\ \&Служби, які сповіщають systemd про свою ініціалізацію>

source: I<Type=>B<simple> services are really easy to write, but have the major disadvantage of systemd not being able to tell when initialization of the given service is complete\&. For this reason, systemd supports a simple notification protocol that allows daemons to make systemd aware that they are done initializing\&. Use I<Type=>B<notify> for this\&. A typical service file for such a daemon would look like this:
uk: Служби I<Type=>B<simple> дуже просто писати, але у них є великий недолік — для таких служб systemd не зможе визначити, коли завершено ініціалізацію служби\&. Через це, у systemd передбачено підтримку простого протоколу сповіщення, за допомогою якого фонові служби можуть повідомляти systemd про завершення ініціалізації\&. Для того, щоб ним скористатися, використайте I<Type=>B<notify>\&. Типовий файл служби для такої фонової служби має виглядати ось так:

source: [Unit] Description=Simple notifying service
uk: [Unit] Description=Проста служба сповіщення

source: Note that the daemon has to support systemd\*(Aqs notification protocol, else systemd will think the service has not started yet and kill it after a timeout\&. For an example of how to update daemons to support this protocol transparently, take a look at B<sd_notify>(3)\&. systemd will consider the unit to be in the \*(Aqstarting\*(Aq state until a readiness notification has arrived\&.
uk: Зауважте, що у фоновій службі має бути передбачено підтримку протоколу сповіщень systemd, інакше systemd вважатиме, що службу ще не запущено і завершить її роботу, щойно завершиться відлік часу очікування\&. Приклад того, як оновлювати фонові служби для забезпечення прозорої підтримки цього протоколу, наведено у підручнику з B<sd_notify>(3)\&. systemd вважатиму модуль таким, що перебуває у стані «запуск», доки не буде отримано сповіщення про готовність\&.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: NOTES
uk: ПРИМІТКИ

source: kernel documentation
uk: документація до ядра

source: Configure the Out-Of-Memory (OOM) killer policy\&. On Linux, when memory becomes scarce the kernel might decide to kill a running process in order to free up memory and reduce memory pressure\&. This setting takes one of B<continue>, B<stop> or B<kill>\&. If set to B<continue> and a process of the service is killed by the kernel\*(Aqs OOM killer this is logged but the service continues running\&. If set to B<stop> the event is logged but the service is terminated cleanly by the service manager\&. If set to B<kill> and one of the service\*(Aqs processes is killed by the OOM killer the kernel is instructed to kill all remaining processes of the service, too\&. Defaults to the setting I<DefaultOOMPolicy=> in B<systemd-system.conf>(5) is set to, except for services where I<Delegate=> is turned on, where it defaults to B<continue>\&.
uk: Налаштувати правила засобу припинення роботи при перевищенні об'єму пам'яті (Out-Of-Memory або OOM)\&. У Linux, коли вільної пам'яті стає замало, ядра може вирішити завершити роботу запущеного процесу з метою вивільнити пам'ять і зменшити перевантаження оперативної пам'яті\&. Цей параметр приймає одне з таких значень: B<continue>, B<stop> або B<kill>\&. Якщо встановлено значення B<continue>, і процес служби буде завершено засобом припинення роботи OOM ядра, дані буде записано до журналу, але служба продовжить роботу\&. Якщо встановлено значення B<stop>, дані про подію буде записано до журналу, але роботу служби буде штатно припинено засобом керування службами\&. Якщо встановлено значення B<kill>, і один із процесів служби буде завершено засобом припинення роботи OOM, ядру буде наказано припинити роботу решти процесів служби\&. Типовим є значення параметра I<DefaultOOMPolicy=> у B<systemd-system.conf>(5), окрім служб, для яких увімкнено I<Delegate=>\&. Для таких служб типовим є варіант B<continue>\&.

source: If a service is requested under a certain name but no unit configuration file is found, systemd looks for a SysV init script by the same name (with the \&.service suffix removed) and dynamically creates a service unit from that script\&. This is useful for compatibility with SysV\&. Note that this compatibility is quite comprehensive but not 100%\&. For details about the incompatibilities, see the \m[blue]B<Incompatibilities with SysV>\m[]\&\s-2\u[1]\d\s+2 document\&.
uk: Якщо надіслано запит щодо служби із певною назвою, але не знайдено файл налаштувань модуля, systemd виконає пошук скрипту ініціалізації SysV із такою самою назвою (без суфікса \&.service) і динамічно створить модуль служби на основі цього скрипту\&. Це корисно для забезпечення сумісності із SysV\&. Зауважте, що ця сумісність є доволі повною, але не на 100%\&. Докладніший опис несумісностей наведено у документі \m[blue]B<Несумісності з SysV>\m[]\&\s-2\u[1]\d\s+2\&.

source: Service files must include a [Service] section, which carries information about the service and the process it supervises\&. A number of options that may be used in this section are shared with other unit types\&. These options are documented in B<systemd.exec>(5), B<systemd.kill>(5) and B<systemd.resource-control>(5)\&. The options specific to the [Service] section of service units are the following:
uk: Файли модулів служб мають включати розділ [Service], який містить відомості щодо служби і процесу, за яким вона наглядає\&. Численні параметри, які може буде використано у цьому розділі, є спільними із іншими типами модулів\&. Ці параметри документовано на сторінках підручника щодо B<systemd.exec>(5), B<systemd.kill>(5) і B<systemd.resource-control>(5)\&. Параметрами, які є специфічними для розділу [Service] модулів служб, є такими:

source: Configure the location of a file containing \m[blue]B<USB FunctionFS>\m[]\&\s-2\u[2]\d\s+2 descriptors, for implementation of USB gadget functions\&. This is used only in conjunction with a socket unit with I<ListenUSBFunction=> configured\&. The contents of this file are written to the ep0 file after it is opened\&.
uk: Налаштувати місце для файл, який містить дескриптори \m[blue]B<USB FunctionFS>\m[]\&\s-2\u[2]\d\s+2 для реалізації функціональних можливостей гаджетів USB\&. Використовують у поєднанні із модулем сокетів із налаштованим I<ListenUSBFunction=>\&. Вміст цього файла буде записано до файла ep0 після того, як його буде відкрито\&.

source: Check B<systemd.exec>(5) and B<systemd.kill>(5) for more settings\&.
uk: Ознайомтеся зі сторінками підручника щодо B<systemd.exec>(5) і B<systemd.kill>(5), щоб дізнатися більше про інші параметри\&.

source: Incompatibilities with SysV
uk: Несумісності з SysV
