Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.resource-control.5.po
Languages: de

source: \&... # Allow binding IPv6 socket addresses with a port greater than or equal to 10000\&. [Service] SocketBindAllow=ipv6:10000-65535 SocketBindDeny=any \&... # Allow binding IPv4 and IPv6 socket addresses with 1234 and 4321 ports\&. [Service] SocketBindAllow=1234 SocketBindAllow=4321 SocketBindDeny=any \&... # Deny binding IPv6 socket addresses\&. [Service] SocketBindDeny=ipv6 \&... # Deny binding IPv4 and IPv6 socket addresses\&. [Service] SocketBindDeny=any \&... # Allow binding only over TCP [Service] SocketBindAllow=tcp SocketBindDeny=any \&... # Allow binding only over IPv6/TCP [Service] SocketBindAllow=ipv6:tcp SocketBindDeny=any \&... # Allow binding ports within 10000-65535 range over IPv4/UDP\&. [Service] SocketBindAllow=ipv4:udp:10000-65535 SocketBindDeny=any \&...
de: \&... # Erlaubt das Anbinden von IPv6-Socket-Adressen mit Ports größer oder gleich 10000\&. [Service] SocketBindAllow=ipv6:10000-65535 SocketBindDeny=any … # Erlaubt das Anbinden von IPv4- und IPv6-Socket-Adressen mit 1234 und 4321 Ports\&. [Service] SocketBindAllow=1234 SocketBindAllow=4321 SocketBindDeny=any … # Verweigert das Anbinden von IPv6-Socket-Adressen\&. [Service] SocketBindDeny=ipv6 … # Verweigert das Anbinden von IPv4- und IPv6-Socket-Adressen\&. [Service] SocketBindDeny=any … # Erlaubt das Anbinden nur über TCP [Service] SocketBindAllow=tcp SocketBindDeny=any … # Erlaubt das Anbinden nur über IPv6/TCP [Service] SocketBindAllow=ipv6:tcp SocketBindDeny=any … # Erlaubt das Anbinden von Ports innerhalb des Bereichs 10000-65535 über IPv4/UDP\&. [Service] SocketBindAllow=ipv4:udp:10000-65535 SocketBindDeny=any …

source: Takes a list of space-separated network interface names\&. This option restricts the network interfaces that processes of this unit can use\&. By default processes can only use the network interfaces listed (allow-list)\&. If the first character of the rule is "~", the effect is inverted: the processes can only use network interfaces not listed (deny-list)\&.
de: Akzeptiert eine Leerzeichen-getrennte Liste von Netzwerkschnittstellennamen\&. Diese Option beschränkt die Netzwerkschnittstellen, die Prozesse dieser Unit verwenden können\&. Standardmäßig können Prozesse nur die aufgeführten Netzwerknamen verwenden (Erlaubnisliste)\&. Falls das erste Zeichen der Regel eine »~« ist, dann wird die Auswirkung invertiert: die Prozesse können nur Netzwerkschnittstellen verwenden, die nicht aufgeführt sind (Verbotsliste)\&.

source: This option can appear multiple times, in which case the network interface names are merged\&. If the empty string is assigned the set is reset, all prior assignments will have not effect\&.
de: Diese Option kann mehrfach aufauchen, dann werden die Netzwerkschnittstellennamen vereinigt\&. Falls die leere Zeichenkette zugewiesen wird, wird die Gruppe zurückgesetzt, alle vorherigen Zuweisungen haben keine Wirkung\&.

source: If you specify both types of this option (i\&.e\&. allow-listing and deny-listing), the first encountered will take precedence and will dictate the default action (allow vs deny)\&. Then the next occurrences of this option will add or delete the listed network interface names from the set, depending of its type and the default action\&.
de: Falls Sie beide Typen dieser Option festlegen (d\&.h\&. Erlaubnisliste und Verbotsliste), wird die zuerst vorkommende Vorrang haben und die Standardaktion vorgeben (erlauben oder verbieten)\&. Dann wird das nächste Vorkommen dieser Option die aufgeführten Netzwerkschnittstellennamen zu der Menge hinzufügen oder sie daraus entfernen, abhängig von seinem Typ und der Vorgabeaktion\&.

source: The loopback interface ("lo") is not treated in any special way, you have to configure it explicitly in the unit file\&.
de: Die Loopback-Schnittstelle (»lo«) wird auf keine Weise besonders behandelt, Sie müssen sie explizit in der Unit-Datei konfigurieren\&.

source: Example 1: allow-list
de: Beispiel 1: Erlaubnisliste

source: Programs in the unit will be only able to use the eth1 and eth2 network interfaces\&.
de: Programme in dieser Unit-Datei werden nur in der Lage sein, die Netzwerkschnittstellen eth1 und eth2 zu verwenden\&.

source: Example 2: deny-list
de: Beispiel 2: Verbotsliste

source: Programs in the unit will be able to use any network interface but eth1 and eth2\&.
de: Programme in dieser Unit-Datei werden in der Lage sein, alle Netzwerkschnittstellen außer eth1 und eth2 zu verwenden\&.

source: Example 3: mixed
de: Beispiel 3: gemischt

source: Programs in the unit will be only able to use the eth2 network interface\&.
de: Programme in der Unit-Datei werden nur in der Lage sein, die Netzwerkschnittstelle eth2 zu verwenden\&.

source: Control access to specific device nodes by the executed processes\&. Takes two space-separated strings: a device node specifier followed by a combination of B<r>, B<w>, B<m> to control I<r>eading, I<w>riting, or creation of the specific device node(s) by the unit (I<m>knod), respectively\&. On cgroup-v1 this controls the "devices\&.allow" control group attribute\&. For details about this control group attribute, see \m[blue]B<Device Whitelist Controller>\m[]\&\s-2\u[9]\d\s+2\&. In the unified cgroup hierarchy this functionality is implemented using eBPF filtering\&.
de: Steuert Zugriff auf bestimmte Geräteknoten durch ausgeführte Prozesse\&. Akzeptiert zwei Leerzeichen-getrennte Zeichenketten: einen Geräteknotenkennzeichner, gefolgt von einer Kombination aus B<r>, B<w>, B<m>, um das Lesen, Schreiben bzw\&. Erstellen von bestimmten Geräteknoten der Unit (mit mknod) zu steuern\&. Unter cgroup-v1 steuert dies das Control-Gruppen-Attribut »devices\&.allow«\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Geräte-Positivliste-Controller>\m[]\&\s-2\u[9]\d\s+2\&. In der vereinigten Cgroup-Hierarchie ist diese Funktionalität mittels eBPF-Filterung implementiert\&.

source: When access to I<all> physical devices should be disallowed, I<PrivateDevices=> may be used instead\&. See B<systemd.exec>(5)\&.
de: Wenn der Zugriff auf I<alle> physischen Geräte verboten werden soll, kann stattdessen I<PrivateDevices=> verwandt werden\&. Siehe B<systemd.exec>(5)\&.

source: The device node specifier is either a path to a device node in the file system, starting with /dev/, or a string starting with either "char-" or "block-" followed by a device group name, as listed in /proc/devices\&. The latter is useful to allow-list all current and future devices belonging to a specific device group at once\&. The device group is matched according to filename globbing rules, you may hence use the "*" and "?" wildcards\&. (Note that such globbing wildcards are not available for device node path specifications!) In order to match device nodes by numeric major/minor, use device node paths in the /dev/char/ and /dev/block/ directories\&. However, matching devices by major/minor is generally not recommended as assignments are neither stable nor portable between systems or different kernel versions\&.
de: Der Geräteknotenkennzeichner ist entweder ein Pfad zu einem Geräteknoten in dem Dateisystem, beginnend mit /dev/, oder eine Zeichenkette, die entweder mit »char-« oder »block-« beginnt und von einem Gerätegruppennamen, wie in /proc/devices aufgeführt, gefolgt wird\&. Letzteres ist nützlich, um eine Positivliste aller aktuellen und zukünftigen Geräte, die zu einer bestimmten Gerätegruppe gehören, auf einmal anzulegen\&. Die Gerätegruppe wird entsprechend der Dateinamen-Glob-Muster-Regeln abgeglichen, Sie können daher die Metazeichen »*« und »?« verwenden\&. (Beachten Sie, dass solche Glob-Metazeichen nicht für Geräteknotenpfadspezifikationen verfügbar sind) Um Geräteknoten gemäß Major-/Minor-Nummern abzugleichen, verwenden Sie Geräteknotenpfade in den Verzeichnissen /dev/char/ und /dev/block/\&. Allerdings wird das Abgleichen von Geräten mittels Major-/Minor-Nummer im Allgemeinen nicht empfohlen, da die Zuweisungen zwischen Systemen oder verschiedenen Kernelversionen weder stabil noch portierbar sind\&.

source: Examples: /dev/sda5 is a path to a device node, referring to an ATA or SCSI block device\&. "char-pts" and "char-alsa" are specifiers for all pseudo TTYs and all ALSA sound devices, respectively\&. "char-cpu/*" is a specifier matching all CPU related device groups\&.
de: Beispiel: /dev/sda5 ist ein Pfad zu einem Geräteknoten, der sich auf ein ATA- oder SCSI-Blockgerät bezieht\&. »char-pts« und »char-alsa« sind Kennzeichner für alle Pseudo-TTY- bzw\&. alle ALSA-Sound-Geräte\&. »char-cpu/*« ist ein Kennzeichner, der auf alle Gerätegruppen mit CPU-Bezug passt\&.

source: Note that allow lists defined this way should only reference device groups which are resolvable at the time the unit is started\&. Any device groups not resolvable then are not added to the device allow list\&. In order to work around this limitation, consider extending service units with a pair of B<After=modprobe@xyz\&.service> and B<Wants=modprobe@xyz\&.service> lines that load the necessary kernel module implementing the device group if missing\&. Example:
de: Beachten Sie, dass auf diese Weise definierte Positivlisten nur Gerätegruppen referenzieren sollten, die zum Startzeitpunkt der Unit auflösbar sind\&. Sämtliche Geräte, die zu diesem Zeitpunkt nicht auflösbar sind, werden nicht zur Positivliste hinzugefügt\&. Um diese Einschränkung zu umgehen, können Sie Dienste-Units um eine Paar von B<After=modprobe@xyz\&.service>- und B<Wants=modprobe@xyz\&.service>-Zeilen ergänzen, die die notwendigen Kernelmodule laden, die die Gerätegruppe implementieren, falls sie fehlen\&. Beispiel:

source: Control the policy for allowing device access:
de: Steuert die Richtlinien zum Erlauben des Gerätezugriffs:

source: means to only allow types of access that are explicitly specified\&.
de: bedeutet, nur Zugriffstypen zu erlauben, die explizit festgelegt wurden\&.

source: in addition, allows access to standard pseudo devices including /dev/null, /dev/zero, /dev/full, /dev/random, and /dev/urandom\&.
de: erlaubt zusätzlich Zugriff auf die Standard-Pseudo-Geräte einschließlich /dev/null, /dev/zero, /dev/full, /dev/random und /dev/urandom\&.

source: in addition, allows access to all devices if no explicit I<DeviceAllow=> is present\&. This is the default\&.
de: erlaubt zusätzlich Zugriff auf alle Geräte, falls kein explizites I<DeviceAllow=> vorhanden ist\&. Dies ist die Vorgabe\&.

source: The name of the slice unit to place the unit in\&. Defaults to system\&.slice for all non-instantiated units of all unit types (except for slice units themselves see below)\&. Instance units are by default placed in a subslice of system\&.slice that is named after the template name\&.
de: Der Name der Scheiben-Unit, in die die Unit hineingelegt werden soll\&. Standardmäßig system\&.slice für alle noch nicht instanziierten Units aller Unit-Typen (außer für Scheiben-Units selbst, siehe unten)\&. Instanzen-Units werden standardmäßig in eine Unterscheibe von system\&.slice gelegt, die nach dem Vorlagennamen benannt ist\&.

source: This option may be used to arrange systemd units in a hierarchy of slices each of which might have resource settings applied\&.
de: Diese Option kann zur Anordnung von Systemd-Units in einer Hierarchie von Scheiben verwandt werden, bei der bei jeder Scheibe Ressourceneinstellungen angewandt werden können\&.

source: For units of type slice, the only accepted value for this setting is the parent slice\&. Since the name of a slice unit implies the parent slice, it is hence redundant to ever set this parameter directly for slice units\&.
de: Für Units vom Typ »Scheibe« ist der einzige für diese Einstellung akzeptierte Wert die Elternscheibe\&. Da der Name einer Scheiben-Unit die Elternscheibe impliziert, ist es daher immer redundant, diesen Parameter direkt für Scheiben-Units zu setzen\&.

source: Special care should be taken when relying on the default slice assignment in templated service units that have I<DefaultDependencies=no> set, see B<systemd.service>(5), section "Default Dependencies" for details\&.
de: Besondere Vorsicht sollten Sie walten lassen, wenn Sie sich auf die Vorgabe-Scheibenzuweisung in vorlagenbasierten Dienste-Units, die I<DefaultDependencies=no> gesetzt haben, verlassen, siehe B<systemd.service>(5) Abschnitt »Standardabhängigkeiten« für Details\&.

source: Turns on delegation of further resource control partitioning to processes of the unit\&. Units where this is enabled may create and manage their own private subhierarchy of control groups below the control group of the unit itself\&. For unprivileged services (i\&.e\&. those using the I<User=> setting) the unit\*(Aqs control group will be made accessible to the relevant user\&. When enabled the service manager will refrain from manipulating control groups or moving processes below the unit\*(Aqs control group, so that a clear concept of ownership is established: the control group tree above the unit\*(Aqs control group (i\&.e\&. towards the root control group) is owned and managed by the service manager of the host, while the control group tree below the unit\*(Aqs control group is owned and managed by the unit itself\&. Takes either a boolean argument or a list of control group controller names\&. If true, delegation is turned on, and all supported controllers are enabled for the unit, making them available to the unit\*(Aqs processes for management\&. If false, delegation is turned off entirely (and no additional controllers are enabled)\&. If set to a list of controllers, delegation is turned on, and the specified controllers are enabled for the unit\&. Note that additional controllers than the ones specified might be made available as well, depending on configuration of the containing slice unit or other units contained in it\&. Note that assigning the empty string will enable delegation, but reset the list of controllers, all assignments prior to this will have no effect\&. Defaults to false\&.
de: Schaltet die Delegation weiterer Ressourcensteuerungspartitionierung an Prozesse der Unit ein\&. Units, bei denen dies aktiviert ist, können ihre eigenen Unterhierarchien von Control-Gruppen unterhalb der Control-Gruppe der Unit selbst erstellen und verwalten\&. Für unprivilegierte Dienste (d\&.h\&. solche, die die Einstellung I<User=> verwenden) wird die Control-Gruppe der Unit für den relevanten Benutzer zugreifbar gemacht\&. Wenn aktiviert, wird der Dienstevewalter es unterlassen, die Control-Gruppen zu verändern oder Prozesse unterhalb der Control-Gruppe der Unit zu schieben, so dass ein klares Konzept der Eigentümerschaft etabliert ist: der Control-Gruppenbaum oberhalb der Control-Gruppe der Unit (d\&.h\&. in Richtung der Wurzel der Control-Gruppe) gehört dem Diensteverwalter des Rechners, der sie auch verwaltet, während der Control-Gruppenbaum unterhalb der Control-Gruppe der Unit der Unit selbst gehört, die diesen auch verwaltet\&. Akzeptiert entweder ein logisches Argument oder eine Liste von Control-Gruppen-Controller-Namen\&. Falls wahr, wird die Delegierung eingeschaltet und alle unterstützten Controller werden für die Unit aktiviert und damit den Prozessen der Unit zur Verwaltung verfügbar gemacht\&. Falls falsch, wird die Delegation komplett ausgeschaltet (und keine zusätzlichen Controller werden aktiviert)\&. Falls auf eine Liste von Controllern gesetzt, wird die Delegation eingeschaltet und die angegebenen Controller werden für die Unit aktiviert\&. Beachten Sie, dass abhängig von der Konfiguration der enthaltenden Unit oder anderen, darin enthaltenen Units zusätzliche Controller (neben den angegebenen) auch verfügbar gemacht werden könnten\&. Beachten Sie, dass die Zuweisung der leeren Zeichenkette die Delegation aktivieren, die Liste der Controller aber zurücksetzen wird; alle Zuweisungen vorher ohne Wirkung bleiben werden\&. Standardmäßig falsch\&.

source: Note that controller delegation to less privileged code is only safe on the unified control group hierarchy\&. Accordingly, access to the specified controllers will not be granted to unprivileged services on the legacy hierarchy, even when requested\&.
de: Beachten Sie, dass Controller-Delegation an weniger privilegierten Code nur auf der vereinigten Control-Gruppenhierarchie sicher ist\&. Entsprechend wird der Zugriff auf die angegebenen Controller nicht an unprivilegierte Dienste auf der veralteten Hierarchie gewährt, selbst falls dies angefragt wurde\&.

source: The following controller names may be specified: B<cpu>, B<cpuacct>, B<cpuset>, B<io>, B<blkio>, B<memory>, B<devices>, B<pids>, B<bpf-firewall>, and B<bpf-devices>\&.
de: Die folgenden Controller-Namen können festgelegt werden: B<cpu>, B<cpuacct>, B<cpuset>, B<io>, B<blkio>, B<memory>, B<devices>, B<pids>, B<bpf-firewall>, und B<bpf-devices>\&.

source: Not all of these controllers are available on all kernels however, and some are specific to the unified hierarchy while others are specific to the legacy hierarchy\&. Also note that the kernel might support further controllers, which aren\*(Aqt covered here yet as delegation is either not supported at all for them or not defined cleanly\&.
de: Nicht alle dieser Controller sind allerdings auf allen Kerneln verfügbar und einige sind spezifisch für die vereinigte Hierarchie, während andere für die veraltete Hierarchie spezifisch sind\&. Beachten Sie auch, dass der Kernel weitere Controller unterstützen könnte, die hier noch nicht berücksichtigt sind, da Delegation hierfür überhaupt noch nicht unterstützt wird oder noch nicht sauber definiert ist\&.

source: For further details on the delegation model consult \m[blue]B<Control Group APIs and Delegation>\m[]\&\s-2\u[10]\d\s+2\&.
de: Für weitere Details über das Delegationsmodell ziehen Sie bitte \m[blue]B<Control-Gruppen-APIs und Delegierung>\m[]\&\s-2\u[10]\d\s+2 heran\&.

source: Disables controllers from being enabled for a unit\*(Aqs children\&. If a controller listed is already in use in its subtree, the controller will be removed from the subtree\&. This can be used to avoid child units being able to implicitly or explicitly enable a controller\&. Defaults to not disabling any controllers\&.
de: Deaktiviert Controller, so dass sie für die Kinder einer Unit nicht eingeschaltet werden können\&. Falls ein aufgeführter Controller bereits in seinem Unterbaum in Verwendung ist, wird der Controller aus dem Unterbaum entfernt\&. Damit können Sie vermeiden, dass Kind-Units in die Lage versetzt werden, implizit oder explizit einen Controller einzuschalten\&. Standardmäßig werden keine Controller deaktiviert\&.

source: It may not be possible to successfully disable a controller if the unit or any child of the unit in question delegates controllers to its children, as any delegated subtree of the cgroup hierarchy is unmanaged by systemd\&.
de: Es mag nicht möglich sein, einen Controller erfolgreich zu deaktivieren, falls die Unit oder eines der Kinder dieser Unit Controller an seine Kinder delegiert, da kein delegierter Unterbaum der Control-Gruppenhierarchie durch Systemd verwaltet wird\&.

source: Multiple controllers may be specified, separated by spaces\&. You may also pass I<DisableControllers=> multiple times, in which case each new instance adds another controller to disable\&. Passing I<DisableControllers=> by itself with no controller name present resets the disabled controller list\&.
de: Es können mehrere Controller durch Leerzeichen getrennt angegeben werden\&. Sie können auch I<DisableControllers=> mehrfach angeben, dann wird jede neue Instanz einen anderen Controller zum Deaktivieren hinzufügen\&. Wird I<DisableControllers=> selbst ohne vorhandenen Controller-Namen übergeben, dann wird die Liste der deaktivierten Controller zurückgesetzt\&.

source: Specifies how B<systemd-oomd.service>(8) will act on this unit\*(Aqs cgroups\&. Defaults to B<auto>\&.
de: Gibt an, wie B<systemd-oomd.service>(8) mit den Cgroups dieser Unit umgeht\&. Standardmäßig B<auto>\&.

source: When set to B<kill>, the unit becomes a candidate for monitoring by B<systemd-oomd>\&. If the cgroup passes the limits set by B<oomd.conf>(5) or the unit configuration, B<systemd-oomd> will select a descendant cgroup and send B<SIGKILL> to all of the processes under it\&. You can find more details on candidates and kill behavior at B<systemd-oomd.service>(8) and B<oomd.conf>(5)\&.
de: Wird dies auf B<kill> gesetzt, dann wird die Unit ein Kandidat für die Überwachung durch B<systemd-oomd>\&. Falls die Cgroup die durch B<oomd.conf>(5) oder die Unit-Konfiguration gesetzten Beschränkungen überschreitet, dann wird B<systemd-oomd> eine Nachkommens-Cgroup auswählen und B<SIGKILL> an alle darunter befindlichen Prozesse senden\&. Sie erhalten weitere Details über Kandidaten und das Tötenverhalten unter B<systemd-oomd.service>(8) und B<oomd.conf>(5)\&.

source: Setting either of these properties to B<kill> will also result in I<After=> and I<Wants=> dependencies on systemd-oomd\&.service unless I<DefaultDependencies=no>\&.
de: Wird eine dieser Eigenschaften auf B<kill> gesetzt, führt dies zu Abhängigkeiten I<After=> und I<Wants=> auf systemd-oomd\&.service außer I<DefaultDependencies=no>\&.

source: When set to B<auto>, B<systemd-oomd> will not actively use this cgroup\*(Aqs data for monitoring and detection\&. However, if an ancestor cgroup has one of these properties set to B<kill>, a unit with B<auto> can still be a candidate for B<systemd-oomd> to terminate\&.
de: Wird dies auf B<auto> gesetzt, dann wird B<systemd-oomd> nicht aktiv diese Cgroup-Daten zur Überwachung und Erkennung verwenden\&. Falls allerdings eine Vorfahr-Cgroup eine dieser Eigenschaften auf B<kill> gesetzt hat, dann kann eine Unit mit B<auto> weiterhin ein Kandidat für B<systemd-oomd> zum Beenden sein\&.

source: Overrides the default memory pressure limit set by B<oomd.conf>(5) for this unit (cgroup)\&. Takes a percentage value between 0% and 100%, inclusive\&. This property is ignored unless I<ManagedOOMMemoryPressure=>B<kill>\&. Defaults to 0%, which means to use the default set by B<oomd.conf>(5)\&.
de: Setzt die durch B<oomd.conf>(5) für diese Unit (Cgroup) gesetzte Standard-Speicher-Belastungsgrenze außer Kraft\&. Akzeptiert einen Prozentwert zwischen (einschließlich) 0% und 100%\&. Diese Eigenschaft wird ignoriert, außer I<ManagedOOMMemoryPressure=>B<kill>\&. Standardmäßig 0%, was bedeutet, dass die in B<oomd.conf>(5) gesetzte Vorgabe verwandt wird\&.

source: Allows deprioritizing or omitting this unit\*(Aqs cgroup as a candidate when B<systemd-oomd> needs to act\&. Requires support for extended attributes (see B<xattr>(7)) in order to use B<avoid> or B<omit>\&. Additionally, B<systemd-oomd> will ignore these extended attributes if the unit\*(Aqs cgroup is not owned by the root user\&.
de: Erlaubt das Herunterpriorisieren oder Überspringen der Cgroup dieser Unit als Kandidat, wenn B<systemd-oomd> agieren muss\&. Benötigt Unterstützung für erweiterte Attribute (siehe B<xattr>(7)), um B<avoid> oder B<omit> zu verwenden\&. Zusätzlich wird B<systemd-oomd> diese erweiterten Attribute ignorieren, falls die Cgroup der Unit nicht dem Benutzer »root« gehört\&.

source: If this property is set to B<avoid>, the service manager will convey this to B<systemd-oomd>, which will only select this cgroup if there are no other viable candidates\&.
de: Falls diese Eigenschaft auf B<avoid> gesetzt ist, wird der Diensteverwalter dies B<systemd-oomd> mitteilen, der diese Cgroup nur auswählen wird, wenn es keinen anderen brauchbaren Kandidaten gibt\&.
