Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: NAME
uk: НАЗВА

source: systemd.service - Service unit configuration
uk: systemd.service — налаштування модуля служби

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: I<service>\&.service
uk: I<служба>\&.service

source: DESCRIPTION
uk: ОПИС

source: A unit configuration file whose name ends in "\&.service" encodes information about a process controlled and supervised by systemd\&.
uk: У файлі налаштувань модуля, назва якого завершується суфіксом «\&.service», закодовано відомості щодо процесу, керування і нагляд за яким здійснює systemd\&.

source: This man page lists the configuration options specific to this unit type\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. The service specific configuration options are configured in the [Service] section\&.
uk: На цій сторінці підручника наведено список параметрів налаштувань, які є специфічними для цього типу модулів\&. Див. B<systemd.unit>(5), щоб дізнатися більше про загальні параметри усіх файлів налаштувань модулів\&. Загальні пункти налаштувань визначаються у типових розділах [Unit] і [Install]\&. Специфічні для служби параметри налаштувань визначаються у розділі [Service]\&.

source: Additional options are listed in B<systemd.exec>(5), which define the execution environment the commands are executed in, and in B<systemd.kill>(5), which define the way the processes of the service are terminated, and in B<systemd.resource-control>(5), which configure resource control settings for the processes of the service\&.
uk: Список додаткових параметрів наведено на сторінці підручника з B<systemd.exec>(5), програми, яка визначає середовище виконання команд, B<systemd.kill>(5), програми, яка визначає спосіб, у який переривається робота процесів служби, та B<systemd.resource-control>(5), програми, яка налаштовує параметри керування ресурсами для процесів служби\&.

source: If SysV init compat is enabled, systemd automatically creates service units that wrap SysV init scripts (the service name is the same as the name of the script, with a "\&.service" suffix added); see B<systemd-sysv-generator>(8)\&.
uk: Якщо увімкнено сумісність із SysV init, systemd автоматично створює модулі, які включають скрипти ініціалізації SysV (назва служби збігатиметься із назвою скрипту, суфіксом буде «\&.service»); див. B<systemd-sysv-generator>(8)\&.

source: The B<systemd-run>(1) command allows creating \&.service and \&.scope units dynamically and transiently from the command line\&.
uk: Команда B<systemd-run>(1) уможливлює створення модулів \&.service і \&.scope динамічно і інтерактивно з командного рядка\&.

source: SERVICE TEMPLATES
uk: ШАБЛОНИ СЛУЖБ

source: It is possible for B<systemd> services to take a single argument via the "I<service>@I<argument>\&.service" syntax\&. Such services are called "instantiated" services, while the unit definition without the I<argument> parameter is called a "template"\&. An example could be a dhcpcd@\&.service service template which takes a network interface as a parameter to form an instantiated service\&. Within the service file, this parameter or "instance name" can be accessed with %-specifiers\&. See B<systemd.unit>(5) for details\&.
uk: Служби B<systemd> можуть приймати одинарний аргумент, який передають синтаксичною конструкцією «I<служба>@I<аргумент>\&.service»\&. Такі служби називають «реалізованими», а визначення модулів без параметра I<аргумент> називають «шаблоном»\&. Прикладом може бути шаблон служби dhcpcd@\&.service, який приймає назву інтерфейсу мережі яка параметр при формуванні реалізованої служби\&. У файлі служби доступ до цього параметра або «назви екземпляра» можна отримати за допомогою %-специфікаторів\&. Див. B<systemd.unit>(5), щоб дізнатися більше\&.

source: AUTOMATIC DEPENDENCIES
uk: АВТОМАТИЧНІ ЗАЛЕЖНОСТІ

source: Implicit Dependencies
uk: Неявні залежності

source: The following dependencies are implicitly added:
uk: Неявним чином додано такі залежності:

source: Services with I<Type=dbus> set automatically acquire dependencies of type I<Requires=> and I<After=> on dbus\&.socket\&.
uk: Служби із автоматичним встановленням I<Type=dbus> надсилають запит щодо залежностей типу I<Requires=> і I<After=> до dbus\&.socket\&.

source: Socket activated services are automatically ordered after their activating \&.socket units via an automatic I<After=> dependency\&. Services also pull in all \&.socket units listed in I<Sockets=> via automatic I<Wants=> and I<After=> dependencies\&.
uk: Активовані через сокет служби автоматично упорядковуються після активації модулів \&.socket за допомогою автоматичної залежності I<After=>\&. Служби також викликають усі модулі \&.socket зі списку у I<Sockets=> за допомогою автоматичних залежностей I<Wants=> і I<After=>\&.

source: Additional implicit dependencies may be added as result of execution and resource control parameters as documented in B<systemd.exec>(5) and B<systemd.resource-control>(5)\&.
uk: Додаткові неявні залежності можна додавати як результат параметри керування виконанням і ресурсами, як це документовано на сторінках підручника щодо B<systemd.exec>(5) і B<systemd.resource-control>(5)\&.

source: Default Dependencies
uk: Типові залежності

source: The following dependencies are added unless I<DefaultDependencies=no> is set:
uk: Буде додано такі залежності, якщо не встановлено I<DefaultDependencies=no>:

source: Service units will have dependencies of type I<Requires=> and I<After=> on sysinit\&.target, a dependency of type I<After=> on basic\&.target as well as dependencies of type I<Conflicts=> and I<Before=> on shutdown\&.target\&. These ensure that normal service units pull in basic system initialization, and are terminated cleanly prior to system shutdown\&. Only services involved with early boot or late system shutdown should disable this option\&.
uk: Модулі служб матиму залежності типу I<Requires=> і I<After=> від sysinit\&.target, залежність типу I<After=> від basic\&.target, а також залежності типу I<Conflicts=> і I<Before=> від shutdown\&.target\&. Таким чином забезпечено те, що звичайні модулі служб включають базову ініціалізацію системи, і штатно припиняють роботу перед вимиканням системи\&. Вимикати цей параметр слід лише для служб, які використовують на ранньому етапі завантаження або на пізньому етапі вимикання системи\&.

source: Instanced service units (i\&.e\&. service units with an "@" in their name) are assigned by default a per-template slice unit (see B<systemd.slice>(5)), named after the template unit, containing all instances of the specific template\&. This slice is normally stopped at shutdown, together with all template instances\&. If that is not desired, set I<DefaultDependencies=no> in the template unit, and either define your own per-template slice unit file that also sets I<DefaultDependencies=no>, or set I<Slice=system\&.slice> (or another suitable slice) in the template unit\&. Also see B<systemd.resource-control>(5)\&.
uk: Реалізовані модулі служб (тобто модулі служб із «@» у назвах) типово пов'язано із модулем зрізу окремого шаблона (див. B<systemd.slice>(5)), який названо за модулем шаблона, у якому містяться усі екземпляри певного шаблона\&. Цей зріз зазвичай буде зупинено під час завершення роботи системи разом із усіма екземплярами шаблонів\&. Якщо така поведінка є небажаною, встановіть I<DefaultDependencies=no> у модулі шаблона, і або визначте ваш власний файл модуля зрізу окремого шаблона, який також встановлює I<DefaultDependencies=no>, або встановіть I<Slice=system\&.slice> (або інший відповідний зріз) у модулі шаблона\&. Див. також B<systemd.resource-control>(5)\&.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Service unit files may include [Unit] and [Install] sections, which are described in B<systemd.unit>(5)\&.
uk: Файли модулів служб можуть включати розділи [Unit] і [Install], які описано на сторінці підручника щодо B<systemd.unit>(5)\&.

source: Service unit files must include a [Service] section, which carries information about the service and the process it supervises\&. A number of options that may be used in this section are shared with other unit types\&. These options are documented in B<systemd.exec>(5), B<systemd.kill>(5) and B<systemd.resource-control>(5)\&. The options specific to the [Service] section of service units are the following:
uk: Файли модулів служб мають включати розділ [Service], який містить відомості щодо служби і процесу, за яким вона наглядає\&. Численні параметри, які може буде використано у цьому розділі, є спільними із іншими типами модулів\&. Ці параметри документовано на сторінках підручника щодо B<systemd.exec>(5), B<systemd.kill>(5) і B<systemd.resource-control>(5)\&. Параметрами, які є специфічними для розділу [Service] модулів служб, є такими:

source: Configures the process start-up type for this service unit\&. One of B<simple>, B<exec>, B<forking>, B<oneshot>, B<dbus>, B<notify> or B<idle>:
uk: Налаштовує тип запуску для цього модуля служб\&. Одне зі значень B<simple>, B<exec>, B<forking>, B<oneshot>, B<dbus>, B<notify> або B<idle>:

source: If set to B<simple> (the default if I<ExecStart=> is specified but neither I<Type=> nor I<BusName=> are), the service manager will consider the unit started immediately after the main service process has been forked off\&. It is expected that the process configured with I<ExecStart=> is the main process of the service\&. In this mode, if the process offers functionality to other processes on the system, its communication channels should be installed before the service is started up (e\&.g\&. sockets set up by systemd, via socket activation), as the service manager will immediately proceed starting follow-up units, right after creating the main service process, and before executing the service\*(Aqs binary\&. Note that this means B<systemctl start> command lines for B<simple> services will report success even if the service\*(Aqs binary cannot be invoked successfully (for example because the selected I<User=> doesn\*(Aqt exist, or the service binary is missing)\&.
uk: Якщо встановлено значення B<simple> (типовий варіант, якщо вказано I<ExecStart=>, але не вказано ні I<Type=>, ні I<BusName=>), засіб керування службами намагатиметься запустити модуль негайно після того, як буде відгалужено процес основної служби\&. Очікується, що процес, який налаштовано за допомогою I<ExecStart=> є основним процесом служби\&. У цьому режимі, якщо процес надає функціональні можливості іншим процесам у системі, його канали обміну даними має бути встановлено до запуску служби (наприклад, сокети має бути налаштовано systemd за допомогою активації сокетів), оскільки засіб керування службами негайно продовжить запуск наступних модулів, одразу після створення процесу основної служби і до виконання виконуваного файла служби\&. Зауважте, що це означає, що рядки команд B<systemctl start> для служб B<simple> повідомлятимуть про успіх, навіть якщо виконуваний файл служби не вдасться викликати успішно (наприклад, оскільки вибраного користувача I<User=> не існує або не буде знайдено виконуваного файла служби)\&.

source: The B<exec> type is similar to B<simple>, but the service manager will consider the unit started immediately after the main service binary has been executed\&. The service manager will delay starting of follow-up units until that point\&. (Or in other words: B<simple> proceeds with further jobs right after B<fork()> returns, while B<exec> will not proceed before both B<fork()> and B<execve()> in the service process succeeded\&.) Note that this means B<systemctl start> command lines for B<exec> services will report failure when the service\*(Aqs binary cannot be invoked successfully (for example because the selected I<User=> doesn\*(Aqt exist, or the service binary is missing)\&.
uk: Тип B<exec> подібний до типу B<simple>, але засіб керування службами намагатиметься запустити модуль одразу після виконання виконуваного файла основної служби\&. Засіб керування службами затримає запуск наступних модулів, аж до цієї події\&. (Іншими словами: B<simple> продовжує роботу з наступними завданнями одразу після повернення з функції B<fork()>, а B<exec> не продовжуватиме обробку, доки не буде успішно виконано як B<fork()>, так і B<execve()> у процесі служби\&.) Зауважте, що це означає, що рядки команд B<systemctl start> для служб B<exec> повертатимуть помилку, якщо не вдасться успішно викликати виконуваний файл служби (наприклад, через те, що вибраного за допомогою I<User=> облікового запису користувача не існує або не буде знайдено виконуваного файла служби)\&.

source: If set to B<forking>, it is expected that the process configured with I<ExecStart=> will call B<fork()> as part of its start-up\&. The parent process is expected to exit when start-up is complete and all communication channels are set up\&. The child continues to run as the main service process, and the service manager will consider the unit started when the parent process exits\&. This is the behavior of traditional UNIX services\&. If this setting is used, it is recommended to also use the I<PIDFile=> option, so that systemd can reliably identify the main process of the service\&. systemd will proceed with starting follow-up units as soon as the parent process exits\&.
uk: Якщо встановлено значення B<forking>, процес, який налаштовано за допомогою I<ExecStart=>, має викликати B<fork()>, як частину свого запуску\&. Батьківський процес має завершити роботу при завершенні запуску, а усі канали обміну даними має бути налаштовано\&. Дочірній процес продовжуватиме працювати як основний процес служби, а засіб керування службами вважатиме модуль запущеним, коли батьківський процес завершить роботу\&. Це поведінка традиційних служб UNIX\&. Якщо використано цей параметр, рекомендуємо також скористатися параметром I<PIDFile=>, щоб systemd можна було надійно ідентифікувати основний процес служби\&. systemd продовжить запускати наступні модулі, щойно завершить роботу батьківський процес\&.

source: Behavior of B<oneshot> is similar to B<simple>; however, the service manager will consider the unit up after the main process exits\&. It will then start follow-up units\&. I<RemainAfterExit=> is particularly useful for this type of service\&. I<Type=>B<oneshot> is the implied default if neither I<Type=> nor I<ExecStart=> are specified\&. Note that if this option is used without I<RemainAfterExit=> the service will never enter "active" unit state, but directly transition from "activating" to "deactivating" or "dead" since no process is configured that shall run continuously\&. In particular this means that after a service of this type ran (and which has I<RemainAfterExit=> not set) it will not show up as started afterwards, but as dead\&.
uk: Поведінка у варіанті з B<oneshot> подібна до B<simple>. Втім, засіб керування службами вважатиме модуль запущеним після завершення роботи основного процесу\&. Далі, він запустить наступні модулі\&. Для цього типу служб корисним є зокрема встановлення I<RemainAfterExit=>\&. I<Type=>B<oneshot> є типовим неявним варіантом, якщо не встановлено ні I<Type=>, ні I<ExecStart=>\&. Зауважте, що якщо використано цей варіант без I<RemainAfterExit=>, служба ніколи не увійде до стану модуля «active», а безпосередньо перейде зі стану «activating» до стану «deactivating» або «dead», оскільки не налаштовано процесу, який має працювати неперервно\&. Це, зокрема, означає, що після запуску служби цього типу (для якої не встановлено I<RemainAfterExit=>) вона не потрапить до списку запущених, а лише до списку «мертвих»\&.

source: Behavior of B<dbus> is similar to B<simple>; however, it is expected that the service acquires a name on the D-Bus bus, as configured by I<BusName=>\&. systemd will proceed with starting follow-up units after the D-Bus bus name has been acquired\&. Service units with this option configured implicitly gain dependencies on the dbus\&.socket unit\&. This type is the default if I<BusName=> is specified\&. A service unit of this type is considered to be in the activating state until the specified bus name is acquired\&. It is considered activated while the bus name is taken\&. Once the bus name is released the service is considered being no longer functional which has the effect that the service manager attempts to terminate any remaining processes belonging to the service\&. Services that drop their bus name as part of their shutdown logic thus should be prepared to receive a B<SIGTERM> (or whichever signal is configured in I<KillSignal=>) as result\&.
uk: Поведінка у варіанті B<dbus> подібна до B<simple>. Втім, служба має отримати назву з каналу D-Bus, як налаштовано параметром I<BusName=>\&. systemd продовжить запуском наступних модулів після отримання назви каналу D-Bus\&. Модулі служб, якщо вказано цей варіант, неявно отримуватимуть залежності від модуля dbus\&.socket\&. Цей тип є типовим, якщо вказано I<BusName=>\&. Модуль служби цього типу вважається таким, що перебуває в активному стані, аж доки не буде отримано вказаної назви каналу\&. Він вважається активованим, доки чинною є отримана назва каналу\&. Щойно назву каналу буде вивільнено, служба вважається нефункціональною, що спричиняє те, що засіб керування службами спробує перервати будь-які залишкові процеси, що належать службі\&. Через це, служби, які скидають назву каналу у процесі логіки завершення своєї роботи, слід приготувати до отримання B<SIGTERM> (або будь-якого іншого сигналу, який налаштовано у I<KillSignal=>)\&.

source: Behavior of B<notify> is similar to B<exec>; however, it is expected that the service sends a notification message via B<sd_notify>(3) or an equivalent call when it has finished starting up\&. systemd will proceed with starting follow-up units after this notification message has been sent\&. If this option is used, I<NotifyAccess=> (see below) should be set to open access to the notification socket provided by systemd\&. If I<NotifyAccess=> is missing or set to B<none>, it will be forcibly set to B<main>\&.
uk: Поведінка у варіанті B<notify> є подібною до B<exec>. Втім, служба має надіслати повідомлення-сповіщення за допомогою B<sd_notify>(3) або еквівалентного виклику під час завершення запуску\&. systemd продовжить запуском наступних модулів після надсилання цього повідомлення-сповіщення\&. Якщо використано цей варіант, має бути встановлено значення I<NotifyAccess=> (див. нижче) для відкриття доступу до сокета сповіщення, який надається systemd\&. Якщо I<NotifyAccess=> не вказано або встановлено у значення B<none>, для нього примусово буде встановлено значення B<main>\&.

source: Behavior of B<idle> is very similar to B<simple>; however, actual execution of the service program is delayed until all active jobs are dispatched\&. This may be used to avoid interleaving of output of shell services with the status output on the console\&. Note that this type is useful only to improve console output, it is not useful as a general unit ordering tool, and the effect of this service type is subject to a 5s timeout, after which the service program is invoked anyway\&.
uk: Поведінка у варіанті B<idle> є дуже подібною до B<simple>. Втім, справжнє виконання програми служби буде відкладено до того, як буде розподілено усі активні завдання\&. Цим можна скористатися для уникнення змішування виведення служб оболонки із виведенням стану до консолі\&. Зауважте, що цей тип корисний лише для удосконалення виведення до консолі, він не придатний як загальний інструмент упорядковування модулів, а вплив цього типу служб обмежено п'ятисекундним часом очікування, після якого службову програму буде викликано попри усе\&.

source: It is generally recommended to use I<Type=>B<simple> for long-running services whenever possible, as it is the simplest and fastest option\&. However, as this service type won\*(Aqt propagate service start-up failures and doesn\*(Aqt allow ordering of other units against completion of initialization of the service (which for example is useful if clients need to connect to the service through some form of IPC, and the IPC channel is only established by the service itself \(em in contrast to doing this ahead of time through socket or bus activation or similar), it might not be sufficient for many cases\&. If so, B<notify> or B<dbus> (the latter only in case the service provides a D-Bus interface) are the preferred options as they allow service program code to precisely schedule when to consider the service started up successfully and when to proceed with follow-up units\&. The B<notify> service type requires explicit support in the service codebase (as B<sd_notify()> or an equivalent API needs to be invoked by the service at the appropriate time) \(em if it\*(Aqs not supported, then B<forking> is an alternative: it supports the traditional UNIX service start-up protocol\&. Finally, B<exec> might be an option for cases where it is enough to ensure the service binary is invoked, and where the service binary itself executes no or little initialization on its own (and its initialization is unlikely to fail)\&. Note that using any type other than B<simple> possibly delays the boot process, as the service manager needs to wait for service initialization to complete\&. It is hence recommended not to needlessly use any types other than B<simple>\&. (Also note it is generally not recommended to use B<idle> or B<oneshot> for long-running services\&.)
uk: Загалом, рекомендуємо користуватися, коли можна, I<Type=>B<simple> для служб, які працюють довго, оскільки це найпростіший і найшвидший варіант\&. Втім, використання цього типу служби заважає передаванню засобу керування службами помилок запуску служби і не дозволяє упорядковування інших модулів за результатами завершення ініціалізації служби (що, наприклад, є корисним, якщо клієнти потребують з'єднання із службою за допомогою певної форми IPC, а канал IPC буде встановлено самою службою, на відміну від виконання цього завдання наперед за допомогою сокета, активації каналу або подібної дії), його може бути недостатньо у багатьох випадках\&. Якщо це так, B<notify> або B<dbus> (останній лише у випадку, якщо служба надає інтерфейс D-Bus) є пріоритетнішими варіантами, оскільки вони уможливлюють для коду програм служб точне планування того, коли слід вважати запуск служби успішним, і коли слід слід продовжити обробку наступних модулів\&. Тип служби B<notify> потребує явної підтримки у коді служби (оскільки службі доведеться у відповідний момент викликати B<sd_notify()> або еквівалентний програмний інтерфейс) — якщо її підтримки не передбачено, альтернативою є B<forking>: у цьому варіанті передбачено підтримку традиційного протоколу запуску служб UNIX\&. Нарешті, B<exec> може бути прийнятним варіантом для випадків, коли достатньо переконатися, що викликано виконуваний файл служби, і коли сам виконуваний файл служби не виконує своєї ініціалізації або виконує мінімальну ініціалізацію (і помилка його ініціалізації є малоймовірною)\&. Зауважте, що використання будь-якого типу, відмінного від B<simple>, ймовірно, затримає процес завантаження системи, оскільки засобу керування системою доведеться чекати на завершення ініціалізації служби\&. Через це, рекомендуємо не використовувати без потреби жодного з типів, окрім B<simple>\&. (Також зауважте, що, загалом, не рекомендовано користуватися B<idle> або B<oneshot> для служб, які працюватимуть довго\&.)

source: Specifies when the manager should consider the service to be finished\&. One of B<main> or B<cgroup>:
uk: Вказує, коли засіб керування може вважати службу завершеною\&. Значення — B<main> або B<cgroup>:
