Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: If set to B<main> (the default), the service manager will consider the unit stopped when the main process, which is determined according to the I<Type=>, exits\&. Consequently, it cannot be used with I<Type=>B<oneshot>\&.
uk: Якщо встановлено значення B<main> (типовий варіант), засіб керування службами вважатиме модуль зупиненим, якщо основний процес, який визначено відповідно до I<Type=>, завершить роботу\&. Отже, його не можна використовувати у поєднанні із I<Type=>B<oneshot>\&.

source: If set to B<cgroup>, the service will be considered running as long as at least one process in the cgroup has not exited\&.
uk: Якщо встановлено значення B<cgroup>, служба вважатиметься запущено, якщо існує принаймні один процес у cgroup, який не завершив роботу\&.

source: It is generally recommended to use I<ExitType=>B<main> when a service has a known forking model and a main process can reliably be determined\&. I<ExitType=> B<cgroup> is meant for applications whose forking model is not known ahead of time and which might not have a specific main process\&. It is well suited for transient or automatically generated services, such as graphical applications inside of a desktop environment\&.
uk: Загалом, рекомендовано використовувати I<ExitType=>B<main>, якщо служба має відому модель відгалуження і основний процес може бути надійно визначено\&. Варіант I<ExitType=> B<cgroup> призначено для програм, чия модель відгалуження є наперед невідомою і які можуть не мати певного основного процесу\&. Його добре пристосовано для тимчасових або автоматично створених служб, зокрема графічних програм у стільничному середовищі\&.

source: Takes a boolean value that specifies whether the service shall be considered active even when all its processes exited\&. Defaults to B<no>\&.
uk: Приймає булеве значення, яке визначає, чи слід вважати службу активною, навіть якщо усі її процеси завершили роботу\&. Типовий значенням є B<no> («ні»)\&.

source: Takes a boolean value that specifies whether systemd should try to guess the main PID of a service if it cannot be determined reliably\&. This option is ignored unless B<Type=forking> is set and B<PIDFile=> is unset because for the other types or with an explicitly configured PID file, the main PID is always known\&. The guessing algorithm might come to incorrect conclusions if a daemon consists of more than one process\&. If the main PID cannot be determined, failure detection and automatic restarting of a service will not work reliably\&. Defaults to B<yes>\&.
uk: Приймає булеве значення, яке визначає, чи має systemd намагатися визначити основний PID служби, якщо його не вдасться надійно визначити\&. Цей параметр буде проігноровано, якщо не встановлено B<Type=forking> і не встановлено B<PIDFile=>, оскільки для інших типів або при явним чином налаштованому файлі PID, основний PID буде завжди відомим\&. Алгоритм визначення може призвести до помилкових результатів, якщо фонова служба складається з декількох процесів\&. Якщо основний PID не може бути визначено, виявлення помилок і автоматичний перезапуск служби не працюватиме надійним чином\&. Типовим значенням є B<yes>\&.

source: Takes a path referring to the PID file of the service\&. Usage of this option is recommended for services where I<Type=> is set to B<forking>\&. The path specified typically points to a file below /run/\&. If a relative path is specified it is hence prefixed with /run/\&. The service manager will read the PID of the main process of the service from this file after start-up of the service\&. The service manager will not write to the file configured here, although it will remove the file after the service has shut down if it still exists\&. The PID file does not need to be owned by a privileged user, but if it is owned by an unprivileged user additional safety restrictions are enforced: the file may not be a symlink to a file owned by a different user (neither directly nor indirectly), and the PID file must refer to a process already belonging to the service\&.
uk: Приймає шлях, що посилається на файл PID служби\&. Цей параметр рекомендовано використовувати для служб, для яких I<Type=> встановлено у значення B<forking>\&. Заданий шлях, типово, вказує на файл у каталозі /run/\&. Отже, якщо вказано відносний шлях, до нього буде дописано префікс /run/\&. Засіб керування службами прочитає PID основного процесу служби з цього файла після запуску служби\&. Засіб керування службами не записуватиме даних до налаштованого цим параметром файла, хоча він і вилучить файл після того, як роботу служби буде завершено, якщо цей файл ще існуватиме\&. Власником файла PID не обов'язково має бути привілейований користувач, але якщо він належатиме непривілейованому користувачу, буде вжито додаткові заходи безпеки: файл не зможе бути символічним посиланням на файл, власником якого є інший користувач (безпосередньо або опосередковано), і файл PID має посилатися на процес, який вже належить службі\&.

source: Note that PID files should be avoided in modern projects\&. Use B<Type=notify> or B<Type=simple> where possible, which does not require use of PID files to determine the main process of a service and avoids needless forking\&.
uk: Зауважте, що у сучасних проєктах слід уникати файлів PID\&. Де це можливо, використовуйте B<Type=notify> або B<Type=simple>, типи, які не вимагають використання файлів PID для визначення основного процесу служби, і не потребують зайвого відгалуження\&.

source: Takes a D-Bus destination name that this service shall use\&. This option is mandatory for services where I<Type=> is set to B<dbus>\&. It is recommended to always set this property if known to make it easy to map the service name to the D-Bus destination\&. In particular, B<systemctl service-log-level/service-log-target> verbs make use of this\&.
uk: Приймає назву призначення D-Bus, яку має використовувати ця служба\&. Цей параметр є обов'язковим для служб, де для I<Type=> встановлено значення B<dbus>\&. Рекомендуємо завжди встановлювати цю властивість, якщо вона відома, щоб спростити прив'язку назви служби до призначення D-Bus\&. Зокрема, цими прив'язками користуються команди B<systemctl service-log-level/service-log-target>\&.

source: Commands with their arguments that are executed when this service is started\&. The value is split into zero or more command lines according to the rules described below (see section "Command Lines" below)\&.
uk: Команди з їхніми аргументами, які буде виконано при запуску цієї служби\&. Це значення буде поділено на нуль або більшу кількість рядків команд, відповідно до правил, які описано нижче (див. розділ «РЯДКИ КОМАНД» нижче)\&.

source: Unless I<Type=> is B<oneshot>, exactly one command must be given\&. When I<Type=oneshot> is used, zero or more commands may be specified\&. Commands may be specified by providing multiple command lines in the same directive, or alternatively, this directive may be specified more than once with the same effect\&. If the empty string is assigned to this option, the list of commands to start is reset, prior assignments of this option will have no effect\&. If no I<ExecStart=> is specified, then the service must have I<RemainAfterExit=yes> and at least one I<ExecStop=> line set\&. (Services lacking both I<ExecStart=> and I<ExecStop=> are not valid\&.)
uk: Якщо для I<Type=> не встановлено значення B<oneshot>, має бути задано точно одну команду\&. Якщо використано I<Type=oneshot>, може бути вказано нуль або більшу кількість команд\&. Команди можна вказати заданням декількох рядків команд у одній інструкції або, інакше, цей параметр можна вказати декілька разів з тими самими наслідками\&. Якщо цьому параметру надано порожнє значення, список команд, які слід запустити, буде скинуто, попередні надання значень цьому параметру втратять чинність\&. Якщо значення I<ExecStart=> не вказано, служба повинна мати I<RemainAfterExit=yes> і принаймні один встановлений рядок I<ExecStop=>\&. (Служби, для яких не вказано обох, I<ExecStart=> і I<ExecStop=>, не є чинними\&.)

source: For each of the specified commands, the first argument must be either an absolute path to an executable or a simple file name without any slashes\&. Optionally, this filename may be prefixed with a number of special characters:
uk: Для кожної з вказаних команд першим аргументом має бути або абсолютний шлях до виконуваного файла, або проста назва файла без будь-яких похилих рисок\&. Додатково, до цієї назви файла може бути дописано префікс із декількома спеціальними символами:

source: B<Table\ \&1.\ \&Special executable prefixes>
uk: B<Таблиця\ \&1.\ \&Особливі префікси виконуваних файлів>

source: Prefix
uk: Префікс

source: Effect
uk: Результат

source: If the executable path is prefixed with "@", the second specified token will be passed as "argv[0]" to the executed process (instead of the actual filename), followed by the further arguments specified\&.
uk: Якщо шлях до виконуваного файла має префікс «@», другий вказаний елемент буде передано як «argv[0]» до виконуваного процесу (замість справжньої назви файла), а потім подальші вказані аргументи\&.

source: If the executable path is prefixed with "-", an exit code of the command normally considered a failure (i\&.e\&. non-zero exit status or abnormal exit due to signal) is recorded, but has no further effect and is considered equivalent to success\&.
uk: Якщо шлях до виконуваного файла має префікс «-», код виходу з команди, який за звичайних умов вважається критичною помилкою (тобто ненульовий стан виходу або ненормальний вихід через надсилання сигналу), буде записано, але не матиме подальшого впливу на роботу і вважатиметься еквівалентом успіху\&.

source: If the executable path is prefixed with ":", environment variable substitution (as described by the "Command Lines" section below) is not applied\&.
uk: Якщо шлях до виконуваного файла має префікс «:», не буде застосовано заміну змінних середовища (як це описано у розділі «РЯДКИ КОМАНД» нижче)\&.

source: If the executable path is prefixed with "+" then the process is executed with full privileges\&. In this mode privilege restrictions configured with I<User=>, I<Group=>, I<CapabilityBoundingSet=> or the various file system namespacing options (such as I<PrivateDevices=>, I<PrivateTmp=>) are not applied to the invoked command line (but still affect any other I<ExecStart=>, I<ExecStop=>, \&... lines)\&.
uk: Якщо шлях до виконуваного файла має префікс «+», процес буде виконано із усіма привілеями\&. У цьому режимі обмеження привілеїв, яке налаштовано за допомогою I<User=>, I<Group=>, I<CapabilityBoundingSet=> або різноманітних параметрів простору назв файлової системи (зокрема I<PrivateDevices=>, I<PrivateTmp=>), не буде застосовано до викликаного рядка команди (але вони усе ще впливатимуть на будь-які інші рядки I<ExecStart=>, I<ExecStop=>, \&...)\&.

source: Similar to the "+" character discussed above this permits invoking command lines with elevated privileges\&. However, unlike "+" the "!" character exclusively alters the effect of I<User=>, I<Group=> and I<SupplementaryGroups=>, i\&.e\&. only the stanzas that affect user and group credentials\&. Note that this setting may be combined with I<DynamicUser=>, in which case a dynamic user/group pair is allocated before the command is invoked, but credential changing is left to the executed process itself\&.
uk: Подібно до символу «+», обговорення якого наведено вище, цей символ надає змогу викликати рядки команд із розширеними привілеями\&. Втім, на відміну від «+», символ «!» виключно змінює наслідки застосування I<User=>, I<Group=> і I<SupplementaryGroups=>, тобто лише фрагменти, які стосуються реєстраційних даних користувача і групи\&. Зауважте, що цей параметр можна поєднувати із I<DynamicUser=>, у випадку чого динамічну пару користувач/група буде створено перед викликом команди, але зміна реєстраційних даних буде покладено на сам виконуваний процес\&.

source: This prefix is very similar to "!", however it only has an effect on systems lacking support for ambient process capabilities, i\&.e\&. without support for I<AmbientCapabilities=>\&. It\*(Aqs intended to be used for unit files that take benefit of ambient capabilities to run processes with minimal privileges wherever possible while remaining compatible with systems that lack ambient capabilities support\&. Note that when "!!" is used, and a system lacking ambient capability support is detected any configured I<SystemCallFilter=> and I<CapabilityBoundingSet=> stanzas are implicitly modified, in order to permit spawned processes to drop credentials and capabilities themselves, even if this is configured to not be allowed\&. Moreover, if this prefix is used and a system lacking ambient capability support is detected I<AmbientCapabilities=> will be skipped and not be applied\&. On systems supporting ambient capabilities, "!!" has no effect and is redundant\&.
uk: Цей префікс є дуже подібним до «!», втім, він працює лише у системах, де немає підтримки можливості зовнішніх процесів, тобто без підтримки I<AmbientCapabilities=>\&. Його призначено для використання для файлів модулів, у яких використано зовнішні можливості для запуску, де це можливо, процесів з мінімальними привілеями, не порушуючи сумісності з системами, у яких не передбачено підтримки зовнішніх можливостей\&. Зауважте, що якщо використано «!!» і буде виявлено, що у системі немає підтримки зовнішніх можливостей, усі налаштовані команди I<SystemCallFilter=> і I<CapabilityBoundingSet=> буде неявним чином змінено, щоб надати змогу породженим процесам скидати реєстрацію та можливості самостійно, навіть якщо налаштуваннями це заборонено\&. Більше того, якщо буде використано цей префікс, і буде виявлено нестачу підтримки зовнішніх можливостей, I<AmbientCapabilities=> буде пропущено і не буде застосовано\&. У системах з підтримкою зовнішніх можливостей, «!!» ні на що не впливає і є зайвим\&.

source: "@", "-", ":", and one of "+"/"!"/"!!" may be used together and they can appear in any order\&. However, only one of "+", "!", "!!" may be used at a time\&. Note that these prefixes are also supported for the other command line settings, i\&.e\&. I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=> and I<ExecStopPost=>\&.
uk: «@», «-», «:» і один із префіксів «+»/«!»/«!!» можна поєднати у будь-якому порядку\&. Втім, одночасно можна використовувати лише один з префіксів «+», «!», «!!»\&. Зауважте, що підтримку цих префіксів передбачено для інших параметрів командного рядка, тобто I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=> і I<ExecStopPost=>\&.

source: If more than one command is specified, the commands are invoked sequentially in the order they appear in the unit file\&. If one of the commands fails (and is not prefixed with "-"), other lines are not executed, and the unit is considered failed\&.
uk: Якщо вказано декілька команд, команди буде викликано послідовно у тому порядку, у якому їх вказано у файлі модуля\&. Якщо виконання однієї з команд завершиться помилкою (і для неї не вказано префікса «-»), інші рядки не буде виконано, а модуль вважатиметься таким, виконання якого завершилося помилкою\&.

source: Unless I<Type=forking> is set, the process started via this command line will be considered the main process of the daemon\&.
uk: Якщо не встановлено I<Type=forking>, процес, який запущено за допомогою цього рядка команди, буде вважатися основним процесом фонової служби\&.

source: Additional commands that are executed before or after the command in I<ExecStart=>, respectively\&. Syntax is the same as for I<ExecStart=>, except that multiple command lines are allowed and the commands are executed one after the other, serially\&.
uk: Додаткові команди, які буде виконано до або після команди I<ExecStart=>, відповідно\&. Синтаксис є таким самим, як і для I<ExecStart=>, окрім того, що можна використовувати декілька рядків команд, а команди буде виконано одна за одною, послідовно\&.

source: If any of those commands (not prefixed with "-") fail, the rest are not executed and the unit is considered failed\&.
uk: Якщо виконання будь-якої з цих команд (у якої немає префікса «-») завершиться помилкою, решту команд не буде виконано, а виконання модуля вважатиметься таким, що завершилося помилкою\&.

source: I<ExecStart=> commands are only run after all I<ExecStartPre=> commands that were not prefixed with a "-" exit successfully\&.
uk: Команди I<ExecStart=> буде виконано лише після того, як виконання усіх команд I<ExecStartPre=>, до яких не було додано префікса «-», буде успішно завершено\&.

source: I<ExecStartPost=> commands are only run after the commands specified in I<ExecStart=> have been invoked successfully, as determined by I<Type=> (i\&.e\&. the process has been started for I<Type=simple> or I<Type=idle>, the last I<ExecStart=> process exited successfully for I<Type=oneshot>, the initial process exited successfully for I<Type=forking>, "READY=1" is sent for I<Type=notify>, or the I<BusName=> has been taken for I<Type=dbus>)\&.
uk: Команди I<ExecStartPost=> буде запущено лише після успішного виклику команд, які вказано в I<ExecStart=>, якщо це визначено I<Type=> (тобто запуску процесу для I<Type=simple>, або успішного завершення останнього процесу I<ExecStart=> для I<Type=oneshot>, успішного завершення початкового процесу для I<Type=forking>, надсилання «READY=1» для I<Type=notify>, або отримання I<BusName=> для I<Type=dbus>)\&.

source: Note that I<ExecStartPre=> may not be used to start long-running processes\&. All processes forked off by processes invoked via I<ExecStartPre=> will be killed before the next service process is run\&.
uk: Зауважте, що I<ExecStartPre=> не можна використовувати для запуску довготривалих процесів\&. Усі процеси, які відгалужено процесами, які викликано за допомогою I<ExecStartPre=>, буде завершено примусово до того, як буде запущено наступний процес служби\&.

source: Note that if any of the commands specified in I<ExecStartPre=>, I<ExecStart=>, or I<ExecStartPost=> fail (and are not prefixed with "-", see above) or time out before the service is fully up, execution continues with commands specified in I<ExecStopPost=>, the commands in I<ExecStop=> are skipped\&.
uk: Зауважте, що якщо будь-яка з цих команд, вказаних у I<ExecStartPre=>, I<ExecStart=> або I<ExecStartPost=>, завершить роботу критичною помилкою (і для неї не буде вказано префікса «-», див. вище) або перевищить час очікування на дані до повного запуску служби, буде продовжено виконання команд, які вказано у I<ExecStopPost=>. Команди в I<ExecStop=> буде пропущено\&.

source: Note that the execution of I<ExecStartPost=> is taken into account for the purpose of I<Before=>/I<After=> ordering constraints\&.
uk: Зауважте, що виконання I<ExecStartPost=> буде взято до уваги для упорядковувальних обмежень I<Before=>/I<After=>\&.

source: Optional commands that are executed before the command(s) in I<ExecStartPre=>\&. Syntax is the same as for I<ExecStart=>, except that multiple command lines are allowed and the commands are executed one after the other, serially\&.
uk: Необов'язкові команди, які буде виконано до команди I<ExecStartPre=>, відповідно\& Синтаксис є таким самим, як і для I<ExecStart=>, окрім того, що можна використовувати декілька рядків команд, а команди буде виконано одна за одною, послідовно\&.

source: The behavior is like an I<ExecStartPre=> and condition check hybrid: when an I<ExecCondition=> command exits with exit code 1 through 254 (inclusive), the remaining commands are skipped and the unit is I<not> marked as failed\&. However, if an I<ExecCondition=> command exits with 255 or abnormally (e\&.g\&. timeout, killed by a signal, etc\&.), the unit will be considered failed (and remaining commands will be skipped)\&. Exit code of 0 or those matching I<SuccessExitStatus=> will continue execution to the next command(s)\&.
uk: Поведінка буде подібною до I<ExecStartPre=> і гібриду перевірки умов: якщо команда I<ExecCondition=> завершить роботу із кодом виходу від 1 до 254 (включно), решту команд буде пропущено, а модуль I<не> буде позначено як такий, виконання якого завершилося помилкою\&. Втім, якщо команда I<ExecCondition=> завершить роботу зі станом виходу 255 або у критичному режимі (тобто через перевищення часу очікування, переривання сигналом тощо), модуль вважатиметься таким, виконання якого завершилося помилкою (і решту команд буде пропущено)\&. Якщо кодом виходу буде 0 або код із I<SuccessExitStatus=>, буде продовжено виконання наступних команд\&.

source: The same recommendations about not running long-running processes in I<ExecStartPre=> also applies to I<ExecCondition=>\&. I<ExecCondition=> will also run the commands in I<ExecStopPost=>, as part of stopping the service, in the case of any non-zero or abnormal exits, like the ones described above\&.
uk: Ті самі рекомендації щодо того, що не слід запускати довготривалі процеси в I<ExecStartPre=>, стосуються і I<ExecCondition=>\&. I<ExecCondition=> також запускатиме команди в I<ExecStopPost=>, як частину процедури зупинення роботи служби у випадку будь-яких ненульових або нештатних виходів, подібних до тих, які описано вище\&.

source: Commands to execute to trigger a configuration reload in the service\&. This argument takes multiple command lines, following the same scheme as described for I<ExecStart=> above\&. Use of this setting is optional\&. Specifier and environment variable substitution is supported here following the same scheme as for I<ExecStart=>\&.
uk: Команди, які слід виконати для ініціалізації перезавантаження налаштувань служби\&. Цей аргумент приймає декілька рядків команд за тією самою схемою, яку описано для I<ExecStart=> вище\&. Використання цього параметра є необов'язковим\&. Тут передбачено підтримку заміни специфікаторів та змінних середовища за тією самою схемою, що і для I<ExecStart=>\&.

source: One additional, special environment variable is set: if known, I<$MAINPID> is set to the main process of the daemon, and may be used for command lines like the following:
uk: Буде встановлено одну додаткову спеціальну змінну середовища: буде встановлено I<$MAINPID> у значення, якщо воно відоме, назви основного процесу фонової служби, і цією змінною можна буде скористатися у рядках команд, подібних до такого:

source: Note however that reloading a daemon by sending a signal (as with the example line above) is usually not a good choice, because this is an asynchronous operation and hence not suitable to order reloads of multiple services against each other\&. It is strongly recommended to set I<ExecReload=> to a command that not only triggers a configuration reload of the daemon, but also synchronously waits for it to complete\&. For example, B<dbus-broker>(1) uses the following:
uk: Втім, зауважте, що перезавантаження фонової служби надсиланням сигналу (як і з прикладом рядка вище), зазвичай, не дуже вдалий вибір, оскільки це асинхронна дія, яка є непридатною для пов'язаного перезавантаження одразу декількох служб\&. Наполегливо рекомендуємо встановити для I<ExecReload=> значення команди, яка не лише ініціює перезавантаження налаштувань фонової служби, але також синхронно очікує на його завершення\&. Наприклад, B<dbus-broker>(1) використовує таке:
