Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: Commands to execute to stop the service started via I<ExecStart=>\&. This argument takes multiple command lines, following the same scheme as described for I<ExecStart=> above\&. Use of this setting is optional\&. After the commands configured in this option are run, it is implied that the service is stopped, and any processes remaining for it are terminated according to the I<KillMode=> setting (see B<systemd.kill>(5))\&. If this option is not specified, the process is terminated by sending the signal specified in I<KillSignal=> or I<RestartKillSignal=> when service stop is requested\&. Specifier and environment variable substitution is supported (including I<$MAINPID>, see above)\&.
uk: Команди, які слід виконати для зупинення служби, яку запущено за допомогою I<ExecStart=>\&. Цей аргумент приймає декілька рядків команд у тій самій схемі, яку описано для I<ExecStart=> вище\&. Цей параметр є необов'язковим\&. Після того, як буде запущено команди, які налаштовано цим параметром, припускається, що роботу служби зупинено, і усі залишкові процеси для неї буде перервано, відповідно до параметра I<KillMode=> (див. B<systemd.kill>(5))\&. Якщо цей параметр не вказано, процес буде перервано надсиланням сигналу, який вказано за допомогою I<KillSignal=> або I<RestartKillSignal=>, коли надіслано запит щодо зупинення служби\&. Передбачено підтримку заміни специфікаторів та змінних середовища (зокрема I<$MAINPID>, див. вище)\&.

source: Note that it is usually not sufficient to specify a command for this setting that only asks the service to terminate (for example, by sending some form of termination signal to it), but does not wait for it to do so\&. Since the remaining processes of the services are killed according to I<KillMode=> and I<KillSignal=> or I<RestartKillSignal=> as described above immediately after the command exited, this may not result in a clean stop\&. The specified command should hence be a synchronous operation, not an asynchronous one\&.
uk: Зауважте, що, зазвичай, для цього параметра недостатньо вказати команду, якщо лише попросить службу припинити роботу (наприклад, надсиланням у певній формі сигналу щодо переривання), але не очікує на завершення припинення роботи\&. Оскільки роботу решти процесів служби буде припинено відповідно до I<KillMode=> і I<KillSignal=> або I<RestartKillSignal=>, як це описано вище, негайно після завершення роботи команди, зупинення роботи може статися нештатно\&. Отже, вказана команда має бути синхронною, а не асинхронною дією\&.

source: Note that the commands specified in I<ExecStop=> are only executed when the service started successfully first\&. They are not invoked if the service was never started at all, or in case its start-up failed, for example because any of the commands specified in I<ExecStart=>, I<ExecStartPre=> or I<ExecStartPost=> failed (and weren\*(Aqt prefixed with "-", see above) or timed out\&. Use I<ExecStopPost=> to invoke commands when a service failed to start up correctly and is shut down again\&. Also note that the stop operation is always performed if the service started successfully, even if the processes in the service terminated on their own or were killed\&. The stop commands must be prepared to deal with that case\&. I<$MAINPID> will be unset if systemd knows that the main process exited by the time the stop commands are called\&.
uk: Зауважте, що команди, вказані в I<ExecStop=>, буде виконано, лише коли спочатку запущено службу\&. Їх не буде викликано, якщо службу не було взагалі запущено або якщо спроба запуску завершилася помилкою, наприклад, оскільки спроба виконання якоїсь із команд, які вказано в I<ExecStart=>, I<ExecStartPre=> або I<ExecStartPost=>, завершилося помилкою (і до команди не було дописано префікс «-», див. вище) або було перевищено час очікування на дані\&. Скористайтеся I<ExecStopPost=> для виклику команд, якщо служба не може запуститися належним чином і завершує роботу знову\&. Також зауважте, що дію з зупинення завжди буде виконано, якщо службу успішно запущено, навіть якщо процеси у службі перервано самим процесом або ззовні\&. Команди зупинення має бути приготовано для роботи у цьому випадку\&. Встановлення значення I<$MAINPID> буде скасовано, якщо systemd стане відомо, що основний процес завершив роботу на момент виклику команд зупинення\&.

source: Service restart requests are implemented as stop operations followed by start operations\&. This means that I<ExecStop=> and I<ExecStopPost=> are executed during a service restart operation\&.
uk: Запити щодо перезапуску служби реалізовано як дії з зупинення, за якими слідують дії із запуску\&. Це означає, що I<ExecStop=> і I<ExecStopPost=> буде виконано під час дії із перезапуску служби\&.

source: It is recommended to use this setting for commands that communicate with the service requesting clean termination\&. For post-mortem clean-up steps use I<ExecStopPost=> instead\&.
uk: Рекомендуємо скористатися цим параметром для команд, які обмінюються даними зі службою, яка потребує штатного переривання роботи\&. Для кроків чищення після завершення роботи скористайтеся замість цього параметра параметром I<ExecStopPost=>\&.

source: Additional commands that are executed after the service is stopped\&. This includes cases where the commands configured in I<ExecStop=> were used, where the service does not have any I<ExecStop=> defined, or where the service exited unexpectedly\&. This argument takes multiple command lines, following the same scheme as described for I<ExecStart=>\&. Use of these settings is optional\&. Specifier and environment variable substitution is supported\&. Note that \(en unlike I<ExecStop=> \(en commands specified with this setting are invoked when a service failed to start up correctly and is shut down again\&.
uk: Додаткові команди, які буде виконано після зупинення служби\&. Це стосується випадків, коли було використано команди, які налаштовано у I<ExecStop=>, де для служби не визначено якихось I<ExecStop=>, або служб, які завершили роботу нештатно\&. Цей аргумент приймає декілька рядків команд за тією самою схемою, яку описано для I<ExecStart=>\&. Використання цих параметрів є необов'язковим\&. Передбачено підтримку заміни специфікаторів та змінних середовища\&. Зауважте, що — на відміну від I<ExecStop=> — команди, які вказано за допомогою цього параметра, буде викликано, коли службу не вдасться запустити належним чином і її роботу знову буде завершено\&.

source: It is recommended to use this setting for clean-up operations that shall be executed even when the service failed to start up correctly\&. Commands configured with this setting need to be able to operate even if the service failed starting up half-way and left incompletely initialized data around\&. As the service\*(Aqs processes have been terminated already when the commands specified with this setting are executed they should not attempt to communicate with them\&.
uk: Рекомендуємо скористатися цим параметром для дій з чищення, які буде виконано, навіть якщо службу не вдасться запустити належним чином\&. Команди, які налаштовано за допомогою цього параметра повинні діяти, навіть якщо запуск служби завершився невдачею десь на проміжному етапі і лишив десь неповністю ініціалізовані дані\&. Оскільки процеси служби вже перервали роботу на момент виконання команд, які задано цим параметром, команди не повинні обмінюватися даними із процесами служби\&.

source: Note that all commands that are configured with this setting are invoked with the result code of the service, as well as the main process\*(Aq exit code and status, set in the I<$SERVICE_RESULT>, I<$EXIT_CODE> and I<$EXIT_STATUS> environment variables, see B<systemd.exec>(5) for details\&.
uk: Зауважте, що усі команди, які налаштовано за допомогою цього параметра, буде викликано із кодом результату служби, а також кодом виходу і стану основного процесу, які встановлено у змінних середовища I<$SERVICE_RESULT>, I<$EXIT_CODE> і I<$EXIT_STATUS>. Див. B<systemd.exec>(5), щоб дізнатися більше\&.

source: Note that the execution of I<ExecStopPost=> is taken into account for the purpose of I<Before=>/I<After=> ordering constraints\&.
uk: Зауважте, що виконання I<ExecStopPost=> буде взято до уваги для упорядковувальних обмежень I<Before=>/I<After=>\&.

source: Configures the time to sleep before restarting a service (as configured with I<Restart=>)\&. Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Defaults to 100ms\&.
uk: Налаштовує час присипляння до перезапуску служби (як налаштовано за допомогою I<Restart=>)\&. Приймає безрозмірне значення у секундах або значення проміжку часу, подібне до «5min 20s»\&. Типовим значенням є 100 мс\&.

source: Configures the time to wait for start-up\&. If a daemon service does not signal start-up completion within the configured time, the service will be considered failed and will be shut down again\&. The precise action depends on the I<TimeoutStartFailureMode=> option\&. Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Pass "infinity" to disable the timeout logic\&. Defaults to I<DefaultTimeoutStartSec=> from the manager configuration file, except when I<Type=oneshot> is used, in which case the timeout is disabled by default (see B<systemd-system.conf>(5))\&.
uk: Налаштовує час очікування на запуск\&. Якщо фонова служба не сигналізує про завершення запуску протягом налаштованого часу, запуск служби вважатиметься таким, що завершився помилкою, а роботу служби буде знову завершено\&. Точна дія залежить від параметра I<TimeoutStartFailureMode=>\&. Приймає безрозмірне значення у секундах або значення проміжку часу, наприклад «5min 20s»\&. Передайте значення «infinity» для вимикання механізму граничного часу очікування\&. Типове значення I<DefaultTimeoutStartSec=> буде взято з файла налаштування засобу керування служб, окрім випадку, коли використано I<Type=oneshot>. У випадку використання цього типу час очікування буде типово вимкнено (див. B<systemd-system.conf>(5))\&.

source: If a service of I<Type=notify> sends "EXTEND_TIMEOUT_USEC=\&...", this may cause the start time to be extended beyond I<TimeoutStartSec=>\&. The first receipt of this message must occur before I<TimeoutStartSec=> is exceeded, and once the start time has extended beyond I<TimeoutStartSec=>, the service manager will allow the service to continue to start, provided the service repeats "EXTEND_TIMEOUT_USEC=\&..." within the interval specified until the service startup status is finished by "READY=1"\&. (see B<sd_notify>(3))\&.
uk: Якщо служба із типом I<Type=notify> надсилає «EXTEND_TIMEOUT_USEC=\&...», це може спричинити розширення часу запуску за межі I<TimeoutStartSec=>\&. Перше отримання цього повідомлення має статися до перевищення I<TimeoutStartSec=>, і щойно час запуску було розширено за межі I<TimeoutStartSec=>, засіб керування службами дозволить продовження запуску служби, якщо служба повторює «EXTEND_TIMEOUT_USEC=\&...» протягом вказаного інтервалу, аж доки стан запуску служби буде завершено «READY=1»\&. (див. B<sd_notify>(3))\&.

source: This option serves two purposes\&. First, it configures the time to wait for each I<ExecStop=> command\&. If any of them times out, subsequent I<ExecStop=> commands are skipped and the service will be terminated by B<SIGTERM>\&. If no I<ExecStop=> commands are specified, the service gets the B<SIGTERM> immediately\&. This default behavior can be changed by the I<TimeoutStopFailureMode=> option\&. Second, it configures the time to wait for the service itself to stop\&. If it doesn\*(Aqt terminate in the specified time, it will be forcibly terminated by B<SIGKILL> (see I<KillMode=> in B<systemd.kill>(5))\&. Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Pass "infinity" to disable the timeout logic\&. Defaults to I<DefaultTimeoutStopSec=> from the manager configuration file (see B<systemd-system.conf>(5))\&.
uk: У цього параметра два призначення\&. По-перше, він налаштовує час очікування для кожної з команд I<ExecStop=>\&. Якщо під час виконання якоїсь з них буде перевищено час очікування, наступні команди I<ExecStop=> буде пропущено, а роботу служби буде перервано сигналом B<SIGTERM>\&. Якщо не буде вказано команд I<ExecStop=>, служба отримає сигнал B<SIGTERM> негайно\&. Цю типову поведінку може бути змінено за допомогою параметра I<TimeoutStopFailureMode=>\&. По-друге, параметр налаштовує час очікування за самостійне завершення роботи службою\&. Якщо роботу служби не буде завершено протягом вказаного часу, її буде завершено примусово сигналом B<SIGKILL> (див. I<KillMode=> у B<systemd.kill>(5))\&. Приймає безрозмірне значення у секундах або значення часового проміжку, наприклад, «5min 20s»\&. Передайте значення «infinity» для вимикання механізму граничного часу очікування\&. Типове значення I<DefaultTimeoutStopSec=> буде взято з файла налаштування засобу керування служб (див. B<systemd-system.conf>(5))\&.

source: If a service of I<Type=notify> sends "EXTEND_TIMEOUT_USEC=\&...", this may cause the stop time to be extended beyond I<TimeoutStopSec=>\&. The first receipt of this message must occur before I<TimeoutStopSec=> is exceeded, and once the stop time has extended beyond I<TimeoutStopSec=>, the service manager will allow the service to continue to stop, provided the service repeats "EXTEND_TIMEOUT_USEC=\&..." within the interval specified, or terminates itself (see B<sd_notify>(3))\&.
uk: Якщо служба із типом I<Type=notify> надсилає «EXTEND_TIMEOUT_USEC=\&...», це може спричинити розширення часу зупинення за межі I<TimeoutStopSec=>\&. Перше отримання цього повідомлення має статися до перевищення I<TimeoutStopSec=>, і щойно час зупинення було розширено за межі I<TimeoutStopSec=>, засіб керування службами дозволить продовження зупинення служби, якщо служба повторює «EXTEND_TIMEOUT_USEC=\&...» протягом вказаного інтервалу, або сама не припинить свою роботу\& (див. B<sd_notify>(3))\&.

source: This option configures the time to wait for the service to terminate when it was aborted due to a watchdog timeout (see I<WatchdogSec=>)\&. If the service has a short I<TimeoutStopSec=> this option can be used to give the system more time to write a core dump of the service\&. Upon expiration the service will be forcibly terminated by B<SIGKILL> (see I<KillMode=> in B<systemd.kill>(5))\&. The core file will be truncated in this case\&. Use I<TimeoutAbortSec=> to set a sensible timeout for the core dumping per service that is large enough to write all expected data while also being short enough to handle the service failure in due time\&.
uk: Цей параметр налаштовує час очікування на завершення служби, коли її виконання було перервано через перевищення часу очікування у засобі нагляду (див. I<WatchdogSec=>)\&. Якщо для служби визначено короткий час I<TimeoutStopSec=>, можна скористатися цим параметром, щоб дати системі більше часу на запис дампу ядра служби\&. Після завершення часу очікування службу роботу служби буде примусово перервано сигналом B<SIGKILL> (див. I<KillMode=> у B<systemd.kill>(5))\&. Файл дампу ядра у цьому випадку буде обрізано\&. Скористайтеся I<TimeoutAbortSec=> для встановлення притомного часу очікування для створення дампів ядра для окремих служб, щоб він був достатньо довгим для запису усіх очікуваних даних, але достатньо коротким для обробки помилки служби протягом короткого проміжку часу\&.

source: Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Pass an empty value to skip the dedicated watchdog abort timeout handling and fall back I<TimeoutStopSec=>\&. Pass "infinity" to disable the timeout logic\&. Defaults to I<DefaultTimeoutAbortSec=> from the manager configuration file (see B<systemd-system.conf>(5))\&.
uk: Приймає безрозмірне значення у секундах або значення проміжку часу, наприклад, «5min 20s»\&. Передайте порожнє значення, щоб пропустити обробку часу очікування на переривання відповідним засобом нагляду і повернутися до I<TimeoutStopSec=>\&. Передайте значення «infinity» для вимикання механізму граничного часу очікування\&. Типове значення I<DefaultTimeoutAbortSec=> буде взято з файла налаштування засобу керування служб (див. B<systemd-system.conf>(5))\&.

source: If a service of I<Type=notify> handles B<SIGABRT> itself (instead of relying on the kernel to write a core dump) it can send "EXTEND_TIMEOUT_USEC=\&..." to extended the abort time beyond I<TimeoutAbortSec=>\&. The first receipt of this message must occur before I<TimeoutAbortSec=> is exceeded, and once the abort time has extended beyond I<TimeoutAbortSec=>, the service manager will allow the service to continue to abort, provided the service repeats "EXTEND_TIMEOUT_USEC=\&..." within the interval specified, or terminates itself (see B<sd_notify>(3))\&.
uk: Якщо служба із типом I<Type=notify> надсилає B<SIGABRT> самостійно (замість того, щоб покластися на запис дампу ядра програми ядром системи), вона може надіслати «EXTEND_TIMEOUT_USEC=\&...», щоб продовжити час переривання за межі I<TimeoutAbortSec=>\&. Перше отримання цього повідомлення має статися до перевищення I<TimeoutAbortSec=>, і щойно час переривання було розширено за межі I<TimeoutAbortSec=>, засіб керування службами дозволить продовження переривання служби, якщо служба повторює «EXTEND_TIMEOUT_USEC=\&...» протягом вказаного інтервалу, або сама не припинить свою роботу\& (див. B<sd_notify>(3))\&.

source: A shorthand for configuring both I<TimeoutStartSec=> and I<TimeoutStopSec=> to the specified value\&.
uk: Скорочення для визначення одразу для I<TimeoutStartSec=> і I<TimeoutStopSec=> вказаного значення\&.

source: These options configure the action that is taken in case a daemon service does not signal start-up within its configured I<TimeoutStartSec=>, respectively if it does not stop within I<TimeoutStopSec=>\&. Takes one of B<terminate>, B<abort> and B<kill>\&. Both options default to B<terminate>\&.
uk: Ці параметри налаштовують дію, яку буде виконано у випадку, коли фонова служба не надішле сигналу запуску протягом налаштованого для неї I<TimeoutStartSec=>, і, відповідно, якщо вона не зупинить роботу протягом I<TimeoutStopSec=>\&. Приймає одне з таких значень: B<terminate>, B<abort> і B<kill>\&. Типовими значенням для обох параметрів є B<terminate>\&.

source: If B<terminate> is set the service will be gracefully terminated by sending the signal specified in I<KillSignal=> (defaults to B<SIGTERM>, see B<systemd.kill>(5))\&. If the service does not terminate the I<FinalKillSignal=> is sent after I<TimeoutStopSec=>\&. If B<abort> is set, I<WatchdogSignal=> is sent instead and I<TimeoutAbortSec=> applies before sending I<FinalKillSignal=>\&. This setting may be used to analyze services that fail to start-up or shut-down intermittently\&. By using B<kill> the service is immediately terminated by sending I<FinalKillSignal=> without any further timeout\&. This setting can be used to expedite the shutdown of failing services\&.
uk: Якщо встановлено значення B<terminate>, службу буде штатно перервано надсиланням сигналу, який вказано за допомогою I<KillSignal=> (типовим сигналом є B<SIGTERM>, див. B<systemd.kill>(5))\&. Якщо роботу служби не буде перервано, I<FinalKillSignal=> буде надіслано після I<TimeoutStopSec=>\&. Якщо встановлено значення B<abort>, буде, натомість, надіслано I<WatchdogSignal=>, а I<TimeoutAbortSec=> буде застосовано до надсилання I<FinalKillSignal=>\&. Цим параметром можна скористатися для аналізу служб, які періодично не вдається запустити або завершити\&. Якщо використано B<kill>, роботу служби буде негайно перервано надсиланням I<FinalKillSignal=> без будь-якого подальшого часу очікування\&. Цим параметром можна скористатися для спрощення вимикання служб, роботу яких було завершено помилками\&.

source: Configures a maximum time for the service to run\&. If this is used and the service has been active for longer than the specified time it is terminated and put into a failure state\&. Note that this setting does not have any effect on I<Type=oneshot> services, as they terminate immediately after activation completed\&. Pass "infinity" (the default) to configure no runtime limit\&.
uk: Налаштовує максимальний час роботи служби\&. Якщо використано цей параметр, і служба працює довше, ніж вказаний час, її роботу буде перервано і переведено у стан помилки\&. Зауважте, що цей параметр не впливає на служби I<Type=oneshot>, оскільки їхню роботу буде перервано негайно після завершення активації\&. Передайте «infinity» (типове значення), щоб усунути обмеження на час роботи\&.

source: If a service of I<Type=notify> sends "EXTEND_TIMEOUT_USEC=\&...", this may cause the runtime to be extended beyond I<RuntimeMaxSec=>\&. The first receipt of this message must occur before I<RuntimeMaxSec=> is exceeded, and once the runtime has extended beyond I<RuntimeMaxSec=>, the service manager will allow the service to continue to run, provided the service repeats "EXTEND_TIMEOUT_USEC=\&..." within the interval specified until the service shutdown is achieved by "STOPPING=1" (or termination)\&. (see B<sd_notify>(3))\&.
uk: Якщо служба I<Type=notify> надсилає «EXTEND_TIMEOUT_USEC=\&...», це може спричинити розширення часу виконання за I<RuntimeMaxSec=>\&. Перше отримання цього повідомлення має статися до перевищення I<RuntimeMaxSec=>, і щойно час виконання буде розширено за межі I<RuntimeMaxSec=>, засіб керування службами дозволить службі продовжити роботу, якщо служба повторить «EXTEND_TIMEOUT_USEC=\&...» протягом проміжку часу, який вказано до досягнення завершення роботи служби шляхом «STOPPING=1» (або переривання роботи)\&. (див. B<sd_notify>(3))\&.

source: This option modifies I<RuntimeMaxSec=> by increasing the maximum runtime by an evenly distributed duration between 0 and the specified value (in seconds)\&. If I<RuntimeMaxSec=> is unspecified, then this feature will be disabled\&.
uk: Цей параметр вносить зміни до I<RuntimeMaxSec=> збільшенням максимального часу роботи на рівномірно розподілені проміжки від 0 до вказаного значення (у секундах)\&. Якщо не вказано I<RuntimeMaxSec=>, цю можливість буде вимкнено\&.
