Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.resource-control.5.po
Languages: de

source: Takes a boolean argument\&. If true, turns on IPv4 and IPv6 network traffic accounting for packets sent or received by the unit\&. When this option is turned on, all IPv4 and IPv6 sockets created by any process of the unit are accounted for\&.
de: Akzeptiert ein logisches Argument\&. Falls wahr, wird die IPv4- und IPv6-Netzwerkverkehrsbuchführung für Pakete, die von dieser Unit gesandt oder empfangen werden, eingeschaltet\&. Wenn diese Option eingeschaltet wird, erfolgt für alle von einem der Prozesse der Unit erstellten IPv4- und IPv6-Sockets die Buchführung\&.

source: When this option is used in socket units, it applies to all IPv4 and IPv6 sockets associated with it (including both listening and connection sockets where this applies)\&. Note that for socket-activated services, this configuration setting and the accounting data of the service unit and the socket unit are kept separate, and displayed separately\&. No propagation of the setting and the collected statistics is done, in either direction\&. Moreover, any traffic sent or received on any of the socket unit\*(Aqs sockets is accounted to the socket unit \(em and never to the service unit it might have activated, even if the socket is used by it\&.
de: Wenn diese Option in Socket-Units verwandt wird, wird sie auf alle hierzu zugeordneten IPv4- und IPv6-Socket (einschließlich der auf Anfragen wartenden und der Verbindugssockets, wo dies zutrifft) angewandt\&. Beachten Sie, dass für Socket-aktivierte Dienste diese Konfigurationseinstellung und die Buchuführungsdaten der Dienste-Unit und der Socket-Unit getrennt bleiben und getrennt dargestellt werden\&. Es erfolgt keine Weitergabe der Einstellung und der gesammelten Daten, in keine Richtung\&. Zudem wird sämtlicher Verkehr, der auf einem der Sockets der Socket-Unit empfangen oder gesandt wird für die Socket-Unit buchgeführt \(em und niemals für die Dienste-Unit, die sie aktiviert haben könnte, selbst falls der Socket von dieser verwandt wird\&.

source: The system default for this setting may be controlled with I<DefaultIPAccounting=> in B<systemd-system.conf>(5)\&.
de: Die Systemvorgabe für diese Einstellung kann mit I<DefaultIPAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: I<IPAddressAllow=>I<ADDRESS[/PREFIXLENGTH]\&...>, I<IPAddressDeny=>I<ADDRESS[/PREFIXLENGTH]\&...>
de: I<IPAddressAllow=>I<ADRESSE[/PRÄFIXLÄNGE]…>, I<IPAddressDeny=>I<ADRESSE[/PRÄFIXLÄNGE]…>

source: Turn on network traffic filtering for IP packets sent and received over B<AF_INET> and B<AF_INET6> sockets\&. Both directives take a space separated list of IPv4 or IPv6 addresses, each optionally suffixed with an address prefix length in bits after a "/" character\&. If the suffix is omitted, the address is considered a host address, i\&.e\&. the filter covers the whole address (32 bits for IPv4, 128 bits for IPv6)\&.
de: Schaltet Netzwerkverkehrsfilterung für IP-Pakete, die über B<AF_INET>- und B<AF_INET6>-Sockets gesandt oder empfangen werden, ein\&. Beide Anweisungen akzeptieren eine Leerzeichen-getrennte Liste von IPv4- oder IPv6-Adressen, an jede kann optional eine Adresspräfixlänge in Bits nach einem Zeichen »/« angehängt werden\&. Falls die Endung entfällt, wird die Adresse als Rechneradresse betrachtet, d\&.h\&. der Filter deckt die gesamte Adresse ab (32 Bit für IPv4, 128 Bit für IPv6)\&.

source: The access lists configured with this option are applied to all sockets created by processes of this unit (or in the case of socket units, associated with it)\&. The lists are implicitly combined with any lists configured for any of the parent slice units this unit might be a member of\&. By default both access lists are empty\&. Both ingress and egress traffic is filtered by these settings\&. In case of ingress traffic the source IP address is checked against these access lists, in case of egress traffic the destination IP address is checked\&. The following rules are applied in turn:
de: Die mit dieser Option konfigurierten Zugriffslisten werden auf allen von dieser Unit erstellten Sockets (oder im Falle von Socket-Units, allen der Unit zugeordneten) angewandt\&. Die Liste wird implzit mit jeder für irgendeine Elternscheibe, bei der diese Unit Mitglied sein könnte, kombiniert\&. Standardmäßig sind beide Zugriffslisten leer\&. Durch diese Einstellung wird sowohl ein- als auch ausgehender Verkehr gefiltert\&. Im Falle des eingehenden Verkehrs wird die Quell-IP-Adresse gegen diese Zugriffslisten geprüft, im Falle des ausgehenden Verkehrs wird die Ziel-IP-Adresse geprüft\&. Die folgenden Regeln werden nacheinander angewandt:

source: Access is granted when the checked IP address matches an entry in the I<IPAddressAllow=> list\&.
de: Falls die überpüfte IP-Adresse auf einen Eintrag in der Einstellung I<IPAddressAllow=> passt, wird der Zugriff erlaubt\&.

source: Otherwise, access is denied when the checked IP address matches an entry in the I<IPAddressDeny=> list\&.
de: Falls die überprüfte IP-Adresse auf einen Eintrag in der Liste I<IPAddressDeny=> passt, wird andernfalls der Zugriff verweigert\&.

source: Otherwise, access is granted\&.
de: Andernfalls wird der Zugriff gewährt\&.

source: In order to implement an allow-listing IP firewall, it is recommended to use a I<IPAddressDeny=>B<any> setting on an upper-level slice unit (such as the root slice -\&.slice or the slice containing all system services system\&.slice \(en see B<systemd.special>(7) for details on these slice units), plus individual per-service I<IPAddressAllow=> lines permitting network access to relevant services, and only them\&.
de: Um eine IP-Firewall mit Positivliste zu implementieren, wird empfohlen, eine Einstellung I<IPAddressDeny=>B<any> in einer höherstufigen Scheiben-Unit (wie der Wurzel-Scheibe -\&.slice oder der Scheibe, die alle Systemdienste enthält, system\&.slice \(en siehe B<systemd.special>(7) für Details über diese Scheiben-Units) zu verwenden, ergänzt um individuelle, dienstebezogene I<IPAddressAllow=>-Zeilen, die Netzwerkzugriff auf relevante Dienste, und nur diese, erlauben\&.

source: Note that for socket-activated services, the IP access list configured on the socket unit applies to all sockets associated with it directly, but not to any sockets created by the ultimately activated services for it\&. Conversely, the IP access list configured for the service is not applied to any sockets passed into the service via socket activation\&. Thus, it is usually a good idea to replicate the IP access lists on both the socket and the service unit\&. Nevertheless, it may make sense to maintain one list more open and the other one more restricted, depending on the usecase\&.
de: Beachten Sie, dass für Socket-aktivierte Dienste die IP-Zugriffsliste, die in der Socket-Unit konfiguriert ist, auf alle direkt zugeordneten Sockets angewandt wird, aber nicht auf irgendein Socket, das von den dafür schließlich aktivierten Diensten erstellt wurde\&. Umgekehrt werden die für die Dienste konfigurierten IP-Zugriffslisten nicht auf irgendein Socket angewandt, das dem Dienst über Socket-Aktivierung weitergegeben wird\&. Daher ist es im Allgemeinen eine gute Idee, die IP-Zugriffsliste sowohl in der Socket- als auch der Dienste-Unit zu replizieren\&. Es kann sinnvoll sein, eine Liste offener und eine Liste beschränkter zu verwalten, abhängig vom Einsatzfall\&.

source: If these settings are used multiple times in the same unit the specified lists are combined\&. If an empty string is assigned to these settings the specific access list is reset and all previous settings undone\&.
de: Falls diese Einstellungen mehrfach in der gleichen Unit verwandt werden, werden die angegebenen Listen kombiniert\&. Falls diesen Einstellungen eine leere Zeichenkette zugewiesen wird, werden die angegebenen Zugriffslisten zurückgesetzt und alle vorherigen Einstellungen aufgehoben\&.

source: In place of explicit IPv4 or IPv6 address and prefix length specifications a small set of symbolic names may be used\&. The following names are defined:
de: Anstelle expliziter IPv4- oder IPv6-Adressen und Präfixlängenfestlegungen kann auch eine kleine Gruppe von symbolischen Namen verwandt werden\&. Die folgenden Namen sind definiert:

source: B<Table\ \&1.\ \&Special address/network names>
de: B<Tabelle\ \&1.\ \&Besondere Adress-/Netzwerknamen>

source: Symbolic Name
de: Symbolischer Name

source: Meaning
de: Bedeutung

source: Any host
de: jeder Rechner

source: All addresses on the local loopback
de: alle Adressen auf dem lokalen Loopback

source: All link-local IP addresses
de: alle linklokalen IP-Adressen

source: All IP multicasting addresses
de: alle IP-multicasting-Adressen

source: Note that these settings might not be supported on some systems (for example if eBPF control group support is not enabled in the underlying kernel or container manager)\&. These settings will have no effect in that case\&. If compatibility with such systems is desired it is hence recommended to not exclusively rely on them for IP security\&.
de: Beachten Sie, dass diese Einstellungen auf einigen Systemen nicht unterstützt werden könnten (beispielsweise falls eBPF-Control-Gruppen-Unterstützung nicht im unterliegenden Kernel oder Container-Verwalter aktiviert ist)\&. Diese Einstellungen haben in diesem Fall keine Auswirkung\&. Falls Kompatibilität mit solchen Systemen gewünscht ist, wird daher empfohlen, sich nicht exklusiv auf sie für IP-Sicherheit zu verlassen\&.

source: Add custom network traffic filters implemented as BPF programs, applying to all IP packets sent and received over B<AF_INET> and B<AF_INET6> sockets\&. Takes an absolute path to a pinned BPF program in the BPF virtual filesystem (/sys/fs/bpf/)\&.
de: Fügt angepasste Netzwerkverkehrsfilter hinzu, die als BPF-Programme implementiert und auf alle über B<AF_INET>- und B<AF_INET6>-Sockets gesandten und empfangenen IP-Pakete angewandt werden\&. Akzeptiert einen absoluten Pfad zu einem im virtuellen BPF-Dateisystem ((/sys/fs/bpf/) verankerten BPF-Programm\&.

source: The filters configured with this option are applied to all sockets created by processes of this unit (or in the case of socket units, associated with it)\&. The filters are loaded in addition to filters any of the parent slice units this unit might be a member of as well as any I<IPAddressAllow=> and I<IPAddressDeny=> filters in any of these units\&. By default there are no filters specified\&.
de: Die mit dieser Option konfigurierten Filter werden auf allen von dieser Unit erstellten Sockets (oder im Falle von Socket-Units, allen der Unit zugeordneten) angewandt\&. Die Filter werden zusätzlich zu den Filter aller Eltern-Scheiben-Units, bei denen diese Unit ein Mitglied sein könnte, sowie sämtlichen I<IPAddressAllow=>- und I<IPAddressDeny=>-Filtern in jeden dieser Units geladen\&. Standardmäßig sind keine Filter festgelegt\&.

source: If these settings are used multiple times in the same unit all the specified programs are attached\&. If an empty string is assigned to these settings the program list is reset and all previous specified programs ignored\&.
de: Falls diese Einstellungen mehrfach in der gleichen Unit verwandt werden, werden alle angegebenen Programme angehängt\&. Falls diesen Einstellungen eine leere Zeichenkette zugewiesen wird, wird die Programmliste zurückgesetzt und alle vorher angegebenen Programme ignoriert\&.

source: If the path I<BPF_FS_PROGRAM_PATH> in I<IPIngressFilterPath=> assignment is already being handled by I<BPFProgram=> ingress hook, e\&.g\&. I<BPFProgram=>B<ingress>:I<BPF_FS_PROGRAM_PATH>, the assignment will be still considered valid and the program will be attached to a cgroup\&. Same for I<IPEgressFilterPath=> path and B<egress> hook\&.
de: Falls der Pfad I<BPF_FS_PROGRAM_PATH> in der Zuweisung I<IPIngressFilterPath=> bereits durch einen Eingangs-Hook I<BPFProgram=> gehandhabt wird, z\&.B\&. I<BPFProgram=>B<ingress>:I<BPF_FS_PROGRAM_PATH>, dann wird die Zuweisung immer noch als gültig betrachtet und das Programm an eine Cgroup angehängt\&. Genauso für den Pfad I<IPEgressFilterPath=> und den Hook B<egress>\&.

source: Note that for socket-activated services, the IP filter programs configured on the socket unit apply to all sockets associated with it directly, but not to any sockets created by the ultimately activated services for it\&. Conversely, the IP filter programs configured for the service are not applied to any sockets passed into the service via socket activation\&. Thus, it is usually a good idea, to replicate the IP filter programs on both the socket and the service unit, however it often makes sense to maintain one configuration more open and the other one more restricted, depending on the usecase\&.
de: Beachten Sie, dass für Socket-aktivierte Dienste die IP-Filterprogramme, die in der Socket-Unit konfiguriert sind, auf alle direkt zugeordneten Sockets angewandt werden, aber nicht auf irgendein Socket, das von den dafür schließlich aktivierten Diensten erstellt wurde\&. Umgekehrt werden die für die Dienste konfigurierten IP-Filterprogramme nicht auf irgendein Socket angewandt, das dem Dienst über Socket-Aktivierung weitergegeben wird\&. Daher ist es im Allgemeinen eine gute Idee, die IP-Filterprogramme sowohl in der Socket- als auch der Dienste-Unit zu replizieren, allerdings ergibt es oft Sinn, eine Konfiguration offener und eine andere beschränkter zu verwalten, abhängig vom Einsatzfall\&.

source: Note that these settings might not be supported on some systems (for example if eBPF control group support is not enabled in the underlying kernel or container manager)\&. These settings will fail the service in that case\&. If compatibility with such systems is desired it is hence recommended to attach your filter manually (requires I<Delegate=>B<yes>) instead of using this setting\&.
de: Beachten Sie, dass diese Einstellungen auf einigen Systemen nicht unterstützt werden könnten (beispielsweise falls eBPF-Control-Gruppen-Unterstützung nicht im unterliegenden Kernel oder Container-Verwalter aktiviert ist)\&. Diese Einstellungen führen in diesem Fall zu einem Fehlschlag des Dienstes\&. Falls Kompatibilität mit solchen Systemen gewünscht ist, wird daher empfohlen, ihre Filter manuell (benötigt I<Delegate=>B<yes>) anzuhängen, statt diese Einstellung zu verwenden\&.

source: I<BPFProgram=>I<type>B<:>I<program-path>
de: I<BPFProgram=>I<Typ>B<:>I<Programmpfad>

source: Add a custom cgroup BPF program\&.
de: Fügt ein angepasstes Cgrup-BPF-Programm hinzu\&.

source: I<BPFProgram=> allows attaching BPF hooks to the cgroup of a systemd unit\&. (This generalizes the functionality exposed via I<IPEgressFilterPath=> for egress and I<IPIngressFilterPath=> for ingress\&.) Cgroup-bpf hooks in the form of BPF programs loaded to the BPF filesystem are attached with cgroup-bpf attach flags determined by the unit\&. For details about attachment types and flags see \m[blue]B<\%https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/plain/include/uapi/linux/bpf.h>\m[]\&. For general BPF documentation please refer to \m[blue]B<\%https://www.kernel.org/doc/html/latest/bpf/index.html>\m[]\&.
de: I<BPFProgram=> erlaubt das Anhängen von BPF-Hooks an die Cgroup einer Systemd-Unit\&. (Dies verallgemeinert die mittels I<IPEgressFilterPath=> für ausgehenden und I<IPIngressFilterPath=> für eingehenden Verkehr offengelegte Funktionalität\&.) Cgroup-bpf-Hooks in der Form von BPF-Programmen, die in das BPF-Dateisystem geladen werden, werden mit den durch die Unit ermittelten Cgroup-Bpf-Anhänge-Schaltern angehängt\&. Für Details über Anhänge-Typen und Schalter siehe \m[blue]B<\%https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/plain/include/uapi/linux/bpf.h>\m[]\&. Für allgemeine BPF-Dokumentation lesen Sie bitte \m[blue]B<\%https://www.kernel.org/doc/html/latest/bpf/index.html>\m[]\&.

source: The specification of BPF program consists of a I<type> followed by a I<program-path> with ":" as the separator: I<type>B<:>I<program-path>\&.
de: Die Spezifikation eines BPF-Programms besteht aus einem I<Typ> gefolgt von einem I<Programmpfad> mit einem »:« als Trenner: I<Typ>B<:>I<Programmpfad>\&.

source: I<type> is the string name of BPF attach type also used in B<bpftool>\&. I<type> can be one of B<egress>, B<ingress>, B<sock_create>, B<sock_ops>, B<device>, B<bind4>, B<bind6>, B<connect4>, B<connect6>, B<post_bind4>, B<post_bind6>, B<sendmsg4>, B<sendmsg6>, B<sysctl>, B<recvmsg4>, B<recvmsg6>, B<getsockopt>, B<setsockopt>\&.
de: I<Typ> ist der auch in B<bpftool> verwandte Zeichenkettenname des BFP-Anhängetyps\&. I<Typ> kann sein: B<egress>, B<ingress>, B<sock_create>, B<sock_ops>, B<device>, B<bind4>, B<bind6>, B<connect4>, B<connect6>, B<post_bind4>, B<post_bind6>, B<sendmsg4>, B<sendmsg6>, B<sysctl>, B<recvmsg4>, B<recvmsg6>, B<getsockopt>, B<setsockopt>\&.

source: Setting I<BPFProgram=> to an empty value makes previous assignments ineffective\&.
de: Durch Setzen von I<BPFProgram=> auf einen leeren Wert werden vorherige Zuweisungen unwirksam\&.

source: Multiple assignments of the same I<type>:I<program-path> value have the same effect as a single assignment: the program with the path I<program-path> will be attached to cgroup hook I<type> just once\&.
de: Mehrfache Zuweisungen des gleichen Werts von I<Typ>B<:>I<Programmpfad> haben die gleiche Auswirkung wie eine einzelne Zuweisung: Das Programm mit dem Pfad I<Programmpfad> wird an den Cgroup-Hook I<Typ> nur einmal angehängt\&.

source: If BPF B<egress> pinned to I<program-path> path is already being handled by I<IPEgressFilterPath=>, I<BPFProgram=> assignment will be considered valid and I<BPFProgram=> will be attached to a cgroup\&. Similarly for B<ingress> hook and I<IPIngressFilterPath=> assignment\&.
de: Falls das auf I<Programmpfad> befestigte BPF-B<egress> bereits durch I<IPEgressFilterPath=> behandelt wird, wird die Zuweisung I<BPFProgram=> als gültig betrachtet und I<BPFProgram=> an eine Cgroup angehängt\&. Ähnlich für den Hook B<ingress> die Zuweisung I<IPIngressFilterPath=>\&.

source: BPF programs passed with I<BPFProgram=> are attached to the cgroup of a unit with BPF attach flag B<multi>, that allows further attachments of the same I<type> within cgroup hierarchy topped by the unit cgroup\&.
de: Mit I<BPFProgram=> übergebene BPF-Programme werden an die Cgroup einer Unit mit dem BFP-Anhängeschalter B<multi> angehängt, der weitere Anhängungen des gleichen I<Typ>s innerhalb der Cgroup-Hierarchie mit der Unit-Cgroup an der Spitze erlaubt\&.

source: Examples:
de: Beispiele:

source: I<SocketBindAllow=>I<bind-rule>, I<SocketBindDeny=>I<bind-rule>
de: I<SocketBindAllow=>I<Binderegel>, I<SocketBindDeny=>I<Binderegel>

source: Allow or deny binding a socket address to a socket by matching it with the I<bind-rule> and applying a corresponding action if there is a match\&.
de: Erlaubt oder verweigert das Anbinden einer Socket-Adresse an ein Socket durch Vergleich mit der I<Binderegel> und Anwendung der entsprechenden Aktion, falls ein Treffer vorliegt\&

source: I<bind-rule> describes socket properties such as I<address-family>, I<transport-protocol> and I<ip-ports>\&.
de: I<Binderegel> beschreibt Socket-Eigenschaften wie I<Adressfamilie>, I<Transportprotokoll> und I<IP-Ports>\&.

source: I<bind-rule> := { [I<address-family>B<:>][I<transport-protocol>B<:>][I<ip-ports>] | B<any> }
de: I<Binderegel> := { [I<Adressfamilie>B<:>][I<Transportprotokoll>B<:>][I<IP-Ports>] | B<any> }

source: I<address-family> := { B<ipv4> | B<ipv6> }
de: I<Adressfamilie> := { B<ipv4> | B<ipv6> }

source: I<transport-protocol> := { B<tcp> | B<udp> }
de: I<Transportprotokoll> := { B<tcp> | B<udp> }

source: I<ip-ports> := { I<ip-port> | I<ip-port-range> }
de: I<IP-Ports>:= { I<IP-Port> | I<IP-Port-Bereich> }

source: An optional I<address-family> expects B<ipv4> or B<ipv6> values\&. If not specified, a rule will be matched for both IPv4 and IPv6 addresses and applied depending on other socket fields, e\&.g\&. I<transport-protocol>, I<ip-port>\&.
de: Eine optionale I<Adressfamilie> erwartet die Werte B<ipv4> oder B<ipv6>\&. Falls nicht angegeben, passt eine Regel auf sowohl IPv4- als auch IPv6-Adressen und wird abhängig von anderen Socket-Felder angewendet, z\&.B\&. I<Transportprotokoll>, I<IP-Port>\&.

source: An optional I<transport-protocol> expects B<tcp> or B<udp> transport protocol names\&. If not specified, a rule will be matched for any transport protocol\&.
de: Ein optionales I<Transportprotokoll> erwartet den Transportprotokollnamen B<tcp> oder B<udp>\&. Falls nicht festgelegt, passt eine Regel auf jedes Transportprotokoll\&.

source: An optional I<ip-port> value must lie within 1\&...65535 interval inclusively, i\&.e\&. dynamic port B<0> is not allowed\&. A range of sequential ports is described by I<ip-port-range> := I<ip-port-low>B<->I<ip-port-high>, where I<ip-port-low> is smaller than or equal to I<ip-port-high> and both are within 1\&...65535 inclusively\&.
de: Ein optionaler Wert I<IP-Port> muss innerhalb des Intervalls 1…65535 (einschließlich) liegen, d\&.h\&. der dynamische Port B<0> ist nicht erlaubt\&. Ein Bereich von fortlaufenden Ports wird durch I<IP-Port-Bereich> I<IP-Port-niedrig>B<->I<IP-Port-hoch> beschrieben, wobei I<IP-Port-niedrig> kleiner oder gleich I<IP-Port-hoch> ist und beide innerhalb von 1…65535 (einschließlich) liegen\&.

source: A special value B<any> can be used to apply a rule to any address family, transport protocol and any port with a positive value\&.
de: Ein besonderer Wert B<any> kann zum Anwenden einer Regel für jede Adressfamilie, jedes Transportprotokoll und jeden Port mit einem positiven Wert verwandt werden\&.

source: To allow multiple rules assign I<SocketBindAllow=> or I<SocketBindDeny=> multiple times\&. To clear the existing assignments pass an empty I<SocketBindAllow=> or I<SocketBindDeny=> assignment\&.
de: Um mehrere Regeln zu erlauben, weisen Sie I<SocketBindAllow=> oder I<SocketBindDeny=> mehrfach zu\&. Um eine Zuweisung zurückzusetzen, übergeben Sie eine leere Zuweisung I<SocketBindAllow=> oder I<SocketBindDeny=>\&.

source: For each of I<SocketBindAllow=> and I<SocketBindDeny=>, maximum allowed number of assignments is B<128>\&.
de: Für sowohl I<SocketBindAllow=> als auch I<SocketBindDeny=> ist die maximale Anzahl an Zuweisungen B<128>\&.

source: Binding to a socket is allowed when a socket address matches an entry in the I<SocketBindAllow=> list\&.
de: Anbinden an ein Socket wird erlaubt, wenn die Socket-Adresse auf einen Eintrag in der Liste I<SocketBindAllow=> passt\&.

source: Otherwise, binding is denied when the socket address matches an entry in the I<SocketBindDeny=> list\&.
de: Andernfalls wir das Anbinden verweigert, falls die Socket-Adresse auf einen Eintrag in der Liste I<SocketBindDeny=> passt\&.

source: Otherwise, binding is allowed\&.
de: Andernfalls wird das Anbinden erlaubt\&.

source: The feature is implemented with B<cgroup/bind4> and B<cgroup/bind6> cgroup-bpf hooks\&.
de: Die Funktionalität ist mit Cgroup-BPF-Hooks B<cgroup/bind4> und B<cgroup/bind6> implementiert\&.
