Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: Note that the same socket file descriptors may be passed to multiple processes simultaneously\&. Also note that a different service may be activated on incoming socket traffic than the one which is ultimately configured to inherit the socket file descriptors\&. Or, in other words: the I<Service=> setting of \&.socket units does not have to match the inverse of the I<Sockets=> setting of the \&.service it refers to\&.
uk: Зауважте, що ті самі дескриптори файлів сокетів може бути передано одночасно декільком процесам\&. Також зауважте, що для вхідного обміну даними сокетом може бути активовано іншу службу, ніж та, для якої зрештою налаштовано успадкування дескрипторів файлів сокетів\&. Або, іншими словами, параметр I<Service=> модулів \&.socket не повинен за значенням збігатися зі зворотним параметром I<Sockets=> файла \&.service, на який він посилається\&.

source: This option may appear more than once, in which case the list of socket units is merged\&. Note that once set, clearing the list of sockets again (for example, by assigning the empty string to this option) is not supported\&.
uk: Цей параметр може бути вказано декілька разів — список модулів сокетів буде об'єднано\&. Зауважте, що можливості очищення списку сокетів після встановлення (наприклад, встановленням для цього параметра порожнього значення) не передбачено\&.

source: Configure how many file descriptors may be stored in the service manager for the service using B<sd_pid_notify_with_fds>(3)\*(Aqs "FDSTORE=1" messages\&. This is useful for implementing services that can restart after an explicit request or a crash without losing state\&. Any open sockets and other file descriptors which should not be closed during the restart may be stored this way\&. Application state can either be serialized to a file in /run/, or better, stored in a B<memfd_create>(2) memory file descriptor\&. Defaults to 0, i\&.e\&. no file descriptors may be stored in the service manager\&. All file descriptors passed to the service manager from a specific service are passed back to the service\*(Aqs main process on the next service restart (see B<sd_listen_fds>(3) for details about the precise protocol used and the order in which the file descriptors are passed)\&. Any file descriptors passed to the service manager are automatically closed when B<POLLHUP> or B<POLLERR> is seen on them, or when the service is fully stopped and no job is queued or being executed for it\&. If this option is used, I<NotifyAccess=> (see above) should be set to open access to the notification socket provided by systemd\&. If I<NotifyAccess=> is not set, it will be implicitly set to B<main>\&.
uk: Налаштувати кількість дескрипторів файлів, які може бути збережено у засобі керування службами для служби за допомогою повідомлень «FDSTORE=1» B<sd_pid_notify_with_fds>(3)\&. Корисно для реалізації служб, які можуть перезапускатися після явного запиту або аварії без втрати стану\&. У цей спосіб може бути збережено будь-які відкриті сокети та інші дескриптори файлів, які не слід закривати під час перезапуску\&. Стан програми може бути або послідовно переведено до файла у /run/, або, що краще, збережено у дескрипторі файла у пам'яті B<memfd_create>(2)\&. Типовою кількістю є 0, тобто у засобі керування службами не можна зберігати дескриптори файлів\&. Усі дескриптори файлів, які передано до засобу керування службами з певної служби, буде передано назад до основного процесу служби під час наступного перезапуску служби (див. B<sd_listen_fds>(3), щоб дізнатися більше про подробиці використаного протоколу та порядок, у якому передаються дескриптори файлів)\&. Будь-які дескриптори файлів, які передано засобу керування службами, буде автоматично закрито, коли для них стане видимим B<POLLHUP> або B<POLLERR>, або коли роботу служби буде повністю зупинено, і для неї не лишиться завдання у черзі або виконуваного завдання\&. Якщо використано цей параметр, має бути встановлено I<NotifyAccess=> (див. вище) для відкриття доступу до сокета сповіщень, який надається systemd\&. Якщо значення I<NotifyAccess=> не встановлено, неявним чином буде використано значення B<main>\&.

source: Configure the location of a file containing \m[blue]B<USB FunctionFS>\m[]\&\s-2\u[1]\d\s+2 descriptors, for implementation of USB gadget functions\&. This is used only in conjunction with a socket unit with I<ListenUSBFunction=> configured\&. The contents of this file are written to the ep0 file after it is opened\&.
uk: Налаштувати місце для файл, який містить дескриптори \m[blue]B<USB FunctionFS>\m[]\&\s-2\u[1]\d\s+2 для реалізації функціональних можливостей гаджетів USB\&. Використовують у поєднанні із модулем сокетів із налаштованим I<ListenUSBFunction=>\&. Вміст цього файла буде записано до файла ep0 після того, як його буде відкрито\&.

source: Configure the location of a file containing USB FunctionFS strings\&. Behavior is similar to I<USBFunctionDescriptors=> above\&.
uk: Налаштувати розташування файла, який містить рядки FunctionFS USB\&. Поведінка подібна до I<USBFunctionDescriptors=>, описаного вище\&.

source: Configure the out-of-memory (OOM) kernel killer policy\&. Note that the userspace OOM killer B<systemd-oomd.service>(8) is a more flexible solution that aims to prevent out-of-memory situations for the userspace, not just the kernel\&.
uk: Налаштувати правила роботи засобу ядра для завершення роботи у випадках нестачі пам'яті (out-of-memory або OOM)\&. Зауважте, що засіб завершення роботи у випадку OOM B<systemd-oomd.service>(8) є гнучкішим рішенням, призначеним для запобігання ситуаціям із нестачею пам'яті у просторі користувача, а не лише у ядрі\&.

source: On Linux, when memory becomes scarce to the point that the kernel has trouble allocating memory for itself, it might decide to kill a running process in order to free up memory and reduce memory pressure\&. This setting takes one of B<continue>, B<stop> or B<kill>\&. If set to B<continue> and a process of the service is killed by the kernel\*(Aqs OOM killer this is logged but the service continues running\&. If set to B<stop> the event is logged but the service is terminated cleanly by the service manager\&. If set to B<kill> and one of the service\*(Aqs processes is killed by the OOM killer the kernel is instructed to kill all remaining processes of the service too, by setting the memory\&.oom\&.group attribute to B<1>; also see \m[blue]B<kernel documentation>\m[]\&\s-2\u[2]\d\s+2\&.
uk: У Linux, коли пам'яті стає замало, до стану, коли у ядра системи виникають проблеми із отриманням пам'яті для самого себе, система може завершити запущений процес з метою вивільнення пам'яті і усування проблем з її нестачею\&. Цей параметр приймає одне з таких значень: B<continue>, B<stop> або B<kill>\&. Якщо встановлено значення B<continue>, і процес служби буде завершено засобом запобігання OOM ядра, дані про завершення роботи буде записано до журналу, але служба продовжить роботу\&. Якщо встановлено значення B<stop>, запис події буде додано до журналу, а роботу служби буде штатно перервано засобом керування службами\&. Якщо встановлено значення B<kill>, і один із процесів служби буде завершено засобом припинення роботи OOM, ядру буде наказано припинити роботу решти процесів служби встановленням атрибуту memory\&.oom\&.group у значення B<1>; див. також \m[blue]B<документацію до ядра системи>\m[]\&\s-2\u[2]\d\s+2\&.

source: Defaults to the setting I<DefaultOOMPolicy=> in B<systemd-system.conf>(5) is set to, except for services where I<Delegate=> is turned on, where it defaults to B<continue>\&.
uk: Типовим для параметра є значення I<DefaultOOMPolicy=> у B<systemd-system.conf>(5), окрім служб, для яких увімкнено I<Delegate=>, де типовим значенням є B<continue>\&.

source: Use the I<OOMScoreAdjust=> setting to configure whether processes of the unit shall be considered preferred or less preferred candidates for process termination by the Linux OOM killer logic\&. See B<systemd.exec>(5) for details\&.
uk: Скористайтеся параметром I<OOMScoreAdjust=> для налаштовування того, чи будуть процеси модуля пріоритетними кандидатами на переривання роботи механізмами завершення роботи у результаті OOM Linux\&. Див. B<systemd.exec>(5), щоб дізнатися більше\&.

source: This setting also applies to B<systemd-oomd>, similar to the kernel OOM kills this setting determines the state of the service after B<systemd-oomd> kills a cgroup associated with the service\&.
uk: Цей параметр також стосується B<systemd-oomd>; подібно до OOM-завершень, цей параметр визначає стан служби після того, як B<systemd-oomd> знищить cgroup, яку пов'язано із службою\&.

source: Check B<systemd.unit>(5), B<systemd.exec>(5), and B<systemd.kill>(5) for more settings\&.
uk: Ознайомтеся зі сторінками підручника щодо B<systemd.unit>(5), B<systemd.exec>(5) і B<systemd.kill>(5), щоб дізнатися більше про інші параметри\&.

source: COMMAND LINES
uk: РЯДКИ КОМАНД

source: This section describes command line parsing and variable and specifier substitutions for I<ExecStart=>, I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=>, and I<ExecStopPost=> options\&.
uk: У цьому розділі описано обробку рядка команди і підставляння змінних і специфікаторів для параметрів I<ExecStart=>, I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=> і I<ExecStopPost=>\&.

source: Multiple command lines may be concatenated in a single directive by separating them with semicolons (these semicolons must be passed as separate words)\&. Lone semicolons may be escaped as "\e;"\&.
uk: Декілька рядків команд може бути об'єднано у одну інструкцію, розділивши їх крапкою з комою (ці крапки з комами має бути передано як окремі слова)\&. Окремі крапки з комами можна екранувати: «\e;»\&.

source: Each command line is unquoted using the rules described in "Quoting" section in B<systemd.syntax>(7)\&. The first item becomes the command to execute, and the subsequent items the arguments\&.
uk: Екранування у кожному з рядків команд буде вилучено з використанням правил, які описано у розділі «Нейтралізація» («Quoting») на сторінці підручника B<systemd.syntax>(7)\&. Перший запис стане командою, яку слід виконати, а наступні записи є аргументами команди\&.

source: This syntax is inspired by shell syntax, but only the meta-characters and expansions described in the following paragraphs are understood, and the expansion of variables is different\&. Specifically, redirection using "E<lt>", "E<lt>E<lt>", "E<gt>", and "E<gt>E<gt>", pipes using "|", running programs in the background using "&", and I<other elements of shell syntax are not supported>\&.
uk: Цей синтаксис є похідним від синтаксису командної оболонки, але буде розпізнано лише метасимволи і розгортання з наступних абзаців, а розгортання змінних є іншим\&. Зокрема, I<не передбачено підтримки елементів синтаксису командної оболонки>, зокрема переспрямування за допомогою «E<lt>», «E<lt>E<lt>», «E<gt>» і «E<gt>E<gt>», каналів переспрямовування за допомогою «|», запуску програм у фоновому режимі за допомогою «&»\&.

source: The command to execute may contain spaces, but control characters are not allowed\&.
uk: Запис команди для виконання може містити пробіли, але не можна використовувати керівні символи\&.

source: The command line accepts "%" specifiers as described in B<systemd.unit>(5)\&.
uk: У рядку команди можна використовувати специфікатори «%», як їх описано на сторінці підручника щодо B<systemd.unit>(5)\&.

source: Basic environment variable substitution is supported\&. Use "${FOO}" as part of a word, or as a word of its own, on the command line, in which case it will be erased and replaced by the exact value of the environment variable (if any) including all whitespace it contains, always resulting in exactly a single argument\&. Use "$FOO" as a separate word on the command line, in which case it will be replaced by the value of the environment variable split at whitespace, resulting in zero or more arguments\&. For this type of expansion, quotes are respected when splitting into words, and afterwards removed\&.
uk: Передбачено підтримку заміни базових змінних середовища\&. Скористайтеся «${ЩОСЬ}», як частиною слова, або окремим словом у рядку команди; цей рядок буде замінено точним значенням змінної середовища (якщо таке визначено) разом із усіма пробілами, які у ньому містяться, так, щоб результатом був завжди один аргумент\&. Скористайтеся «$FOO», як окремим словом, у рядку команди; цей рядок буде замінено на значення змінної середовища, поділену на пробілах — результатом буде нуль або більше аргументів\&. Для цього типу розгортання лапки буде враховано при поділі на слова, а після цього буде вилучено\&.

source: If the command is not a full (absolute) path, it will be resolved to a full path using a fixed search path determined at compilation time\&. Searched directories include /usr/local/bin/, /usr/bin/, /bin/ on systems using split /usr/bin/ and /bin/ directories, and their sbin/ counterparts on systems using split bin/ and sbin/\&. It is thus safe to use just the executable name in case of executables located in any of the "standard" directories, and an absolute path must be used in other cases\&. Using an absolute path is recommended to avoid ambiguity\&. Hint: this search path may be queried using B<systemd-path search-binaries-default>\&.
uk: Якщо команда не є повним (абсолютним) шляхом, її буде оброблено як повний шлях з використанням фіксованого шляху пошуку, який визначено під час компіляції\&. Серед каталогів для пошуку /usr/local/bin/, /usr/bin/, /bin/ у системах, у яких використано окремі каталоги /usr/bin/ і /bin/, та їхні відповідники з sbin/ у системах, де використано окремі каталоги bin/ і sbin/\&. Таким чином, можна безпечно скористатися простою назвою виконуваного файла, якщо виконувані файли зберігаються у будь-якому із «стандартних» каталогів\&. У інших випадках слід користуватися абсолютним шляхом\&. Рекомендовано для уникнення неоднозначності користуватися абсолютними шляхами\&. Підказка: список шляхів для пошуку можна отримати за допомогою команди B<systemd-path search-binaries-default>\&.

source: Example:
uk: Приклад:

source: This will execute B</bin/echo> with four arguments: "one", "two", "two", and "two two"\&.
uk: Буде виконано B</bin/echo> із чотирма аргументами: «one», «two», «two» і «two two»\&.

source: This results in /bin/echo being called twice, the first time with arguments "\*(Aqone\*(Aq", "\*(Aqtwo\ \&two\*(Aq\ \&too", "", and the second time with arguments "one", "two\ \&two", "too"\&.
uk: Результатом буде виклик /bin/echo двічі, перший раз із аргументами "\*(Aqone\*(Aq", "\*(Aqtwo\ \&two\*(Aq\ \&too", "", а другий раз із аргументами "one", "two\ \&two", "too"\&.

source: To pass a literal dollar sign, use "$$"\&. Variables whose value is not known at expansion time are treated as empty strings\&. Note that the first argument (i\&.e\&. the program to execute) may not be a variable\&.
uk: Щоб передати сам символ долара, скористайтеся "$$"\&. Змінні, чиї значення є невідомими, під час розгортання буде оброблено як порожні рядки\&. Зауважте, що перший аргумент (тобто програма, яку слід виконати) не може бути змінною\&.

source: Variables to be used in this fashion may be defined through I<Environment=> and I<EnvironmentFile=>\&. In addition, variables listed in the section "Environment variables in spawned processes" in B<systemd.exec>(5), which are considered "static configuration", may be used (this includes e\&.g\&. I<$USER>, but not I<$TERM>)\&.
uk: Змінні, які буде використано у цей спосіб, можна визначити за допомогою I<Environment=> і I<EnvironmentFile=>\&. Крім того, може бути використано змінні зі списку «Змінні середовища у породжених процесах» («Environment variables in spawned processes») сторінки підручника щодо B<systemd.exec>(5), які вважають «статичними налаштуваннями» (це стосується, зокрема, I<$USER>, але не I<$TERM>)\&.

source: Note that shell command lines are not directly supported\&. If shell command lines are to be used, they need to be passed explicitly to a shell implementation of some kind\&. Example:
uk: Зауважте, безпосередньої підтримки рядків команд оболонки не передбачено\&. Якщо має бути використано рядки команд оболонки, їх слід передати явним чином до реалізації командної оболонки якогось типу\&. Приклад:

source: This will execute B<echo> two times, each time with one argument: "one" and "two two", respectively\&. Because two commands are specified, I<Type=oneshot> must be used\&.
uk: Буде виконано B<echo> двічі, кожного разу із одним аргументом: "one" і "two two", відповідно\&. Оскільки задано дві команди, слід використовувати I<Type=oneshot>\&.

source: This will execute B<echo> with five arguments: "/", "E<gt>/dev/null", "&", ";", and "ls"\&.
uk: Буде виконано B<echo> із п'ятьма аргументами: "/", "E<gt>/dev/null", "&", ";" і "ls"\&.

source: EXAMPLES
uk: ПРИКЛАДИ

source: B<Example\ \&2.\ \&Simple service>
uk: B<Приклад\ \&2.\ \&Проста служба>

source: The following unit file creates a service that will execute /usr/sbin/foo-daemon\&. Since no I<Type=> is specified, the default I<Type=>B<simple> will be assumed\&. systemd will assume the unit to be started immediately after the program has begun executing\&.
uk: Вказаний нижче файл модуля створює службу, яка виконає фонову службу /usr/sbin/foo-daemon\&. Оскільки I<Type=> не вказано, буде неявним чином використано I<Type=>B<simple>\&. systemd припускатиме, що модуль буде запущено негайно після того, як почнеться виконання програми\&.

source: Note that systemd assumes here that the process started by systemd will continue running until the service terminates\&. If the program daemonizes itself (i\&.e\&. forks), please use I<Type=>B<forking> instead\&.
uk: Зауважте, що systemd тут припускає, що виконання процесу, запущеного за допомогою systemd, продовжуватиметься, аж доки роботу служби не буде припинено\&. Якщо програма сама себе переводить у режим фонової служби (тобто виконує відгалуження), будь ласка, скористайтеся I<Type=>B<forking>\&.

source: Since no I<ExecStop=> was specified, systemd will send SIGTERM to all processes started from this service, and after a timeout also SIGKILL\&. This behavior can be modified, see B<systemd.kill>(5) for details\&.
uk: Оскільки не вказано I<ExecStop=>, systemd надішле SIGTERM усім процесам, які запущено з цієї служби, і після завершення часу очікування, також SIGKILL\&. Цю поведінку можна змінити, див. B<systemd.kill>(5), щоб дізнатися більше\&.

source: Note that this unit type does not include any type of notification when a service has completed initialization\&. For this, you should use other unit types, such as I<Type=>B<notify> if the service understands systemd\*(Aqs notification protocol, I<Type=>B<forking> if the service can background itself or I<Type=>B<dbus> if the unit acquires a DBus name once initialization is complete\&. See below\&.
uk: Зауважте, що до цього типу модулів не включено жодного типу сповіщень щодо завершення службою ініціалізації\&. Для цього вам слід користуватися іншими типами модулів, зокрема I<Type=>B<notify>, якщо служба розуміє протокол сповіщень systemd, I<Type=>B<forking>, якщо служба може перевести себе у фоновий режим, або I<Type=>B<dbus>, якщо модуль отримує назву DBus, щойно ініціалізацію буде завершено\&. Див. нижче\&.

source: B<Example\ \&3.\ \&Oneshot service>
uk: B<Приклад\ \&3.\ \&Служба oneshot>

source: Sometimes, units should just execute an action without keeping active processes, such as a filesystem check or a cleanup action on boot\&. For this, I<Type=>B<oneshot> exists\&. Units of this type will wait until the process specified terminates and then fall back to being inactive\&. The following unit will perform a cleanup action:
uk: Іноді, модулі мають просто виконати дію без підтримання процесів активними, зокрема виконати перевірку файлової системи або дію з чищення при завантаженні системи\&. Для цього існує I<Type=>B<oneshot>\&. Модулі цього типу чекатимуть на завершення вказаного процесу, а потім повертатимуться до неактивного стану\&. Дію з чищення буде виконано таким модулем:

source: [Unit] Description=Cleanup old Foo data
uk: [Unit] Description=Чищення якихось застарілих даних

source: Note that systemd will consider the unit to be in the state "starting" until the program has terminated, so ordered dependencies will wait for the program to finish before starting themselves\&. The unit will revert to the "inactive" state after the execution is done, never reaching the "active" state\&. That means another request to start the unit will perform the action again\&.
uk: Зауважте, що systemd вважатиме модуль таким, що перебуває у стані «запуск», аж доки роботу програми не буде перервано, отже, упорядковані залежності чекатимуть на завершення роботи програми до свого запуску\&. Модуль повернеться до стану «неактивний» після завершення виконання — він ніколи не досягне стану «активний»\&. Це означає, що ще один запит щодо запуску модуля, призведе до повторного виконання дії\&.

source: I<Type=>B<oneshot> are the only service units that may have more than one I<ExecStart=> specified\&. For units with multiple commands (I<Type=oneshot>), all commands will be run again\&.
uk: I<Type=>B<oneshot> є єдиними модулями служб, для яких можна вказувати декілька I<ExecStart=>\&. Для модулів із декількома командами (I<Type=oneshot>), буде знову запущено усі команди\&.

source: For I<Type=oneshot>, I<Restart=>B<always> and I<Restart=>B<on-success> are I<not> allowed\&.
uk: Для I<Type=oneshot> I<not> можна використовувати I<Restart=>B<always> і I<Restart=>B<on-success>\&.

source: B<Example\ \&4.\ \&Stoppable oneshot service>
uk: B<Приклад\ \&4.\ \&Придатна до зупинки одноразова служба>

source: Similarly to the oneshot services, there are sometimes units that need to execute a program to set up something and then execute another to shut it down, but no process remains active while they are considered "started"\&. Network configuration can sometimes fall into this category\&. Another use case is if a oneshot service shall not be executed each time when they are pulled in as a dependency, but only the first time\&.
uk: Подібно до одноразових служб, іноді існують модулі, які мають виконати програму для налаштовування чогось, а потім виконати іншу програму для завершення цієї програми, але не буде активного процесу, доки ці програми вважатимуться «запущеними»\&. Налаштування мережі можуть іноді потрапляти до цієї категорії\&. Іншим випадком може бути одноразова служба, яку не буде виконано кожного разу, а лише першого разу, коли її викликатимуть як залежність\&.
