Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.target.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.target - Target unit configuration
de: systemd.target - Ziel-Unit-Konfiguration

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: A unit configuration file whose name ends in "\&.target" encodes information about a target unit of systemd, which is used for grouping units and as well-known synchronization points during start-up\&.
de: Eine Unit-Konfigurationsdatei, deren Name in »\&.target« endet, kodiert Informationen über eine Ziel-Unit von Systemd, die zur Gruppierung von Units sowie für wohlbekannte Synchronisationspunkte während des Startens verwandt werden\&.

source: This unit type has no specific options\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. A separate [Target] section does not exist, since no target-specific options may be configured\&.
de: Dieser Unit-Typ hat keine bestimmten Optionen\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien\&. Die gemeinsamen Konfigurationseinträge werden in den generischen Abschnitten »[Unit]« und »[Install]« konfiguriert\&. Ein separater Abschnitt »[Target]« existiert nicht, da keine Ziel-spezifischen Optionen konfiguriert werden können\&.

source: Target units do not offer any additional functionality on top of the generic functionality provided by units\&. They exist merely to group units via dependencies (useful as boot targets), and to establish standardized names for synchronization points used in dependencies between units\&. Among other things, target units are a more flexible replacement for SysV runlevels in the classic SysV init system\&. (And for compatibility reasons special target units such as runlevel3\&.target exist which are used by the SysV runlevel compatibility code in systemd\&. See B<systemd.special>(7) for details)\&.
de: Ziel-Units ergänzen die generische Funktionalität von Units nicht\&. Sie existieren nur, um Units mittels Abhängigkeiten zu gruppieren (nützlich als Systemstart-Ziele) und um standardisierte Namen für Synchronisationspunkte (zur Verwendung in Abhängigkeiten zwischen Units) zu etablieren\&. Unter anderem sind Ziel-Units ein flexiblerer Ersatz für SysV-Runlevel im klassischen SysV-Init-System\&. (Aus Kompatibilitätsgründen existieren spezielle Ziel-Units wie runlevel3\&.target, die von SysV-Runlevel-Kompatibliltäts-Code in Systemd verwandt werden\&. Siehe B<systemd.special>(7) für Details)\&.

source: AUTOMATIC DEPENDENCIES
de: AUTOMATISCHE ABHÄNGIGKEITEN

source: Implicit Dependencies
de: Implizite Abhängigkeiten

source: There are no implicit dependencies for target units\&.
de: Es gibt keine impliziten Abhängigkeiten für Ziel-Units\&.

source: Default Dependencies
de: Standardabhängigkeiten

source: The following dependencies are added unless I<DefaultDependencies=no> is set:
de: Die folgenden Abhängigkeiten werden hinzugefügt, es sei denn, I<DefaultDependencies=no> ist gesetzt:

source: Target units will automatically complement all configured dependencies of type I<Wants=> or I<Requires=> with dependencies of type I<After=> unless I<DefaultDependencies=no> is set in the specified units\&. Note that I<Wants=> or I<Requires=> must be defined in the target unit itself \(em if you for example define I<Wants=>some\&.target in some\&.service, the automatic ordering will not be added\&.
de: Ziel-Units werden automatisch alle konfigurierten Abhängigkeiten von Typ I<Wants=> oder I<Requires=> mit Abhängigkeiten vom Typ I<After=> ergänzen, außer I<DefaultDependencies=no> ist in den festgelegten Units gesetzt\&. Beachten Sie, dass I<Wants=> oder I<Requires=> in der Ziel-Unit selbst definiert sein muss \(em falls Sie beispielsweise I<Wants=>ein\&.target in ein\&.service definieren, wird die automatische Ordnung nicht hinzugefügt\&.

source: Target units automatically gain I<Conflicts=> and I<Before=> dependencies against shutdown\&.target\&.
de: Ziel-Units erhalten automatische Abhängigkeiten I<Conflicts=> und I<Before=> von shutdown\&.target\&.

source: OPTIONS
de: OPTIONEN

source: Target unit files may include [Unit] and [Install] sections, which are described in B<systemd.unit>(5)\&. No options specific to this file type are supported\&.
de: Ziel-Unit-Dateien können Abschnitte [Unit] und [Install] enthalten, die in B<systemd.unit>(5) beschrieben sind\&. Es werden keine für diesen Dateityp spezifischen Optionen unterstützt\&.

source: EXAMPLE
de: BEISPIEL

source: B<Example\ \&1.\ \&Simple standalone target>
de: B<Beispiel\ \&1.\ \&Einfaches einzelstehendes Ziel>

source: [Unit] Description=Emergency Mode with Networking Requires=emergency\&.target systemd-networkd\&.service After=emergency\&.target systemd-networkd\&.service AllowIsolate=yes
de: [Unit] Description=Notfallmodus mit Netz Requires=emergency\&.target systemd-networkd\&.service After=emergency\&.target systemd-networkd\&.service AllowIsolate=yes

source: When adding dependencies to other units, it\*(Aqs important to check if they set I<DefaultDependencies=>\&. Service units, unless they set I<DefaultDependencies=no>, automatically get a dependency on sysinit\&.target\&. In this case, both emergency\&.target and systemd-networkd\&.service have I<DefaultDependencies=no>, so they are suitable for use in this target, and do not pull in sysinit\&.target\&.
de: Beim Hinzufügen von Abhängigkeiten von anderen Units ist es wichtig zu prüfen, ob sie I<DefaultDependencies=> setzen\&. Dienste-Units erhalten automatisch eine Abhängigkeit von sysinit\&.target, außer sie setzen I<DefaultDependencies=no>\&. In diesem Fall haben sowohl emergency\&.target als auch systemd-networkd\&.service I<DefaultDependencies=no>, so dass sie für den Einsatz in diesem Ziel geeignet sind und nicht sysinit\&.target hereinziehen\&.

source: You can now switch into this emergency mode by running I<systemctl isolate emergency-net\&.target> or by passing the option I<systemd\&.unit=emergency-net\&.target> on the kernel command line\&.
de: Sie können jetzt durch Ausführung von I<systemctl isolate emergency-net\&.target> oder durch Übergabe der Option I<systemd\&.unit=emergency-net\&.target> auf der Kernelbefehlszeile in diesen Notfallmodus umschalten\&.

source: Other units can have I<WantedBy=emergency-net\&.target> in the I<[Install]> section\&. After they are enabled using B<systemctl enable>, they will be started before I<emergency-net\&.target> is started\&. It is also possible to add arbitrary units as dependencies of emergency\&.target without modifying them by using B<systemctl add-wants>\&.
de: Andere Units können I<WantedBy=emergency-net\&.target> in dem Abschnitt I<[Install]> haben. Nachdem sie mittels B<systemctl enable> aktiviert wurden, werden sie vor dem Starten von I<emergency-net\&.target> gestartet\&. Es ist auch möglich, beliebige Units als Abhängigkeiten von emergency\&.target mittels B<systemctl add-wants> hinzuzufügen, ohne sie zu verändern\&.

source: SEE ALSO
de: SIEHE AUCH
