Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.resource-control.5.po
Languages: de

source: If this property is set to B<omit>, the service manager will convey this to B<systemd-oomd>, which will ignore this cgroup as a candidate and will not perform any actions on it\&.
de: Falls diese Eigenschaft auf B<omit> gesetzt ist, wird der Diensteverwalter dies B<systemd-oomd> mitteilen, der diese Cgroup als Kandidat ignorieren und keinerlei Aktion auf ihr ausführen wird\&.

source: It is recommended to use B<avoid> and B<omit> sparingly, as it can adversely affect B<systemd-oomd>\*(Aqs kill behavior\&. Also note that these extended attributes are not applied recursively to cgroups under this unit\*(Aqs cgroup\&.
de: Es wird empfohlen, B<avoid> und B<omit> nur vereinzelt zu verwenden, da es das Kill-Verhalten von B<systemd-oomd> negativ beeinflussen kann. Beachten Sie auch, dass diese erweiterten Attribute nicht rekursiv auf Cgroups unterhalb der Cgroup dieser Unit angewandt werden\&.

source: Defaults to B<none> which means B<systemd-oomd> will rank this unit\*(Aqs cgroup as defined in B<systemd-oomd.service>(8) and B<oomd.conf>(5)\&.
de: Standardmäßig B<none>, was bedeutet, dass B<systemd-oomd> die Cgroup dieser Unit wie in B<systemd-oomd.service>(8) und B<oomd.conf>(5) definiert einordnen wird\&.

source: DEPRECATED OPTIONS
de: MISSBILLIGTE OPTIONEN

source: The following options are deprecated\&. Use the indicated superseding options instead:
de: Die folgenden Optionen werden missbilligt\&. Verwenden Sie stattdessen die angezeigten Optionen:

source: I<CPUShares=>I<weight>, I<StartupCPUShares=>I<weight>
de: I<CPUShares=>I<Gewicht>, I<StartupCPUShares=>I<Gewicht>

source: Assign the specified CPU time share weight to the processes executed\&. These options take an integer value and control the "cpu\&.shares" control group attribute\&. The allowed range is 2 to 262144\&. Defaults to 1024\&. For details about this control group attribute, see \m[blue]B<CFS Scheduler>\m[]\&\s-2\u[4]\d\s+2\&. The available CPU time is split up among all units within one slice relative to their CPU time share weight\&.
de: Weist dem ausgeführten Prozess die festgelegte CPU-Zeitanteilsgewichtung zu\&. Diese Optionen akzeptieren einen Ganzzahlwert und steuern das Control-Gruppenattribut »cpu\&.shares«\&. Der erlaubte Bereich ist 2 bis 262144\&. Standardmäßig 1024\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<CFS-Auftragsplaner>\m[]\&\s-2\u[4]\d\s+2\&. Die verfügbare CPU-Zeit wird zwischen allen Units innerhalb einer Scheibe relativ zu ihren CPU-Zeitanteilsgewichtungen aufgeteilt\&.

source: While I<StartupCPUShares=> applies to the startup and shutdown phases of the system, I<CPUShares=> applies to normal runtime of the system, and if the former is not set also to the startup and shutdown phases\&. Using I<StartupCPUShares=> allows prioritizing specific services at boot-up and shutdown differently than during normal runtime\&.
de: Während I<StartupCPUShares=> für die Hoch- und Runterfahrphase des Systems gilt, gilt I<CPUShares=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hoch- und Runterfahrphasen\&. Durch Verwendung von I<StartupCPUShares=> ist eine abweichende Priorisierung bestimmter Dienste während des Hoch- und Runterfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: Implies "CPUAccounting=yes"\&.
de: Impliziert »CPUAccounting=yes«\&.

source: These settings are deprecated\&. Use I<CPUWeight=> and I<StartupCPUWeight=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<CPUWeight=> und I<StartupCPUWeight=>\&.

source: I<MemoryLimit=>I<bytes>
de: I<MemoryLimit=>I<Byte>

source: Specify the limit on maximum memory usage of the executed processes\&. The limit specifies how much process and kernel memory can be used by tasks in this unit\&. Takes a memory size in bytes\&. If the value is suffixed with K, M, G or T, the specified memory size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. Alternatively, a percentage value may be specified, which is taken relative to the installed physical memory on the system\&. If assigned the special value "infinity", no memory limit is applied\&. This controls the "memory\&.limit_in_bytes" control group attribute\&. For details about this control group attribute, see \m[blue]B<Memory Resource Controller>\m[]\&\s-2\u[11]\d\s+2\&.
de: Legt die maximale Speicherbegrenzung der ausgeführten Prozesse fest\&. Die Begrenzung legt fest, wieviel Prozess- und Kernelspeicher von den Prozessen in dieser Unit verwandt werden kann\&. Akzeptiert eine Speichergröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die angegebene Speichergröße in Kilobyte, Megabyte, Gigabyte bzw\&. Terabytes (zur Basis 1024) ausgewertet\&. Alternativ kann ein Prozentwert festgelegt werden, der relativ zum installierten physischen Speicher im System akzeptiert wird\&. Falls zugewiesen, besagt der besondere Wert »infinity«, dass keine Speicherbegrenzung angewandt wird\&. Dies steuert das Control-Gruppenattribut »memory\&.limit_in_bytes«\&. Für Details über dieses Control-Gruppenattribut siehe \m[blue]B<Speicherressourcen-Controller>\m[]\&\s-2\u[11]\d\s+2\&.

source: Implies "MemoryAccounting=yes"\&.
de: Impliziert »MemoryAccounting=yes«\&.

source: This setting is deprecated\&. Use I<MemoryMax=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<MemoryMax=>\&.

source: Turn on Block I/O accounting for this unit, if the legacy control group hierarchy is used on the system\&. Takes a boolean argument\&. Note that turning on block I/O accounting for one unit will also implicitly turn it on for all units contained in the same slice and all for its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultBlockIOAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet Block-E/A-Buchführung für diese Unit ein, falls die veraltete Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert ein logisches Argument\&. Beachten Sie, dass das Einschalten der Block-E/A-Buchführung für eine Unit dies implizit auch für alle Units, die in der gleichen Scheibe enthalten sind und für alle Elternscheiben und die darin befindlichen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann durch I<DefaultBlockIOAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: This setting is deprecated\&. Use I<IOAccounting=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<IOAccounting=>\&.

source: I<BlockIOWeight=>I<weight>, I<StartupBlockIOWeight=>I<weight>
de: I<BlockIOWeight=>I<Gewicht>, I<StartupBlockIOWeight=>I<Gewicht>

source: Set the default overall block I/O weight for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a single weight value (between 10 and 1000) to set the default block I/O weight\&. This controls the "blkio\&.weight" control group attribute, which defaults to 500\&. For details about this control group attribute, see \m[blue]B<Block IO Controller>\m[]\&\s-2\u[12]\d\s+2\&. The available I/O bandwidth is split up among all units within one slice relative to their block I/O weight\&.
de: Setzt die vorgegebene Gesamt-Block-E/A-Gewichtung für die ausgeführten Prozesse, falls die veraltete Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert einen einzelnen Gewichtungswert (zwischen 10 und 10000), um die vorgegebene Block-E/A-Gewichtung zu setzen\&. Dies steuert das Control-Gruppen-Attribut »blkio\&.weight«, das standardmäßig 500 beträgt\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Block-E/A-Controller>\m[]\&\s-2\u[12]\d\s+2\&. Die verfügbare E/A-Bandbreite wird zwischen allen Units innerhalb einer Scheibe relativ zu ihren Block-E/A-Gewichtungen aufgeteilt\&.

source: While I<StartupBlockIOWeight=> only applies to the startup and shutdown phases of the system, I<BlockIOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup and shutdown phases\&. This allows prioritizing specific services at boot-up and shutdown differently than during runtime\&.
de: Während I<StartupBlockIOWeight=> nur für die Hoch- und Runterfahrphase des Systems gilt, gilt I<BlockIOWeight=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hoch- und Runterfahrphasen\&. Dies erlaubt eine abweichende Priorisierung bestimmter Dienste während des Hoch- und Runterfahrens des Systems im Vergleich zur normalen Laufzeit\&.

source: Implies "BlockIOAccounting=yes"\&.
de: Impliziert »BlockIOAccounting=yes«\&.

source: These settings are deprecated\&. Use I<IOWeight=> and I<StartupIOWeight=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<IOWeight=> und I<StartupIOWeight=>\&.

source: I<BlockIODeviceWeight=>I<device>I< >I<weight>
de: I<BlockIODeviceWeight=>I<Gerät>I< >I<Gewicht>

source: Set the per-device overall block I/O weight for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a weight value to specify the device specific weight value, between 10 and 1000\&. (Example: "/dev/sda 500")\&. The file path may be specified as path to a block device node or as any other file, in which case the backing block device of the file system of the file is determined\&. This controls the "blkio\&.weight_device" control group attribute, which defaults to 1000\&. Use this option multiple times to set weights for multiple devices\&. For details about this control group attribute, see \m[blue]B<Block IO Controller>\m[]\&\s-2\u[12]\d\s+2\&.
de: Setzt die geräteabhängige Gesamt-Block-E/A-Gewichtung für die ausgeführten Prozesse, falls die veraltete Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert eine Leerzeichen-getrennte Liste von Paaren von einem Dateipfad und einem Gewichtungswert, um den geräteabhängigen Gewichtungswert, zwischen 10 und 1000, festzulegen\&. (Beispiel: »/dev/sda 500«)\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Dies steuert das Control-Gruppen-Attribut »blkio\&.weight_device«, das standardmäßig 1000 beträgt\&. Verwenden Sie die Option mehrfach, um Gewichtungen für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Block-E/A-Controller>\m[]\&\s-2\u[12]\d\s+2\&.

source: This setting is deprecated\&. Use I<IODeviceWeight=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<IODeviceWeight=>\&.

source: I<BlockIOReadBandwidth=>I<device>I< >I<bytes>, I<BlockIOWriteBandwidth=>I<device>I< >I<bytes>
de: I<BlockIOReadBandwidth=>I<Gerät>I< >I<Byte>, I<BlockIOWriteBandwidth=>I<Gerät>I< >I<Byte>

source: Set the per-device overall block I/O bandwidth limit for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a bandwidth value (in bytes per second) to specify the device specific bandwidth\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the bandwidth is suffixed with K, M, G, or T, the specified bandwidth is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M")\&. This controls the "blkio\&.throttle\&.read_bps_device" and "blkio\&.throttle\&.write_bps_device" control group attributes\&. Use this option multiple times to set bandwidth limits for multiple devices\&. For details about these control group attributes, see \m[blue]B<Block IO Controller>\m[]\&\s-2\u[12]\d\s+2\&.
de: Setzt die gerätebezogene Gesamt-Block-E/A-Bandbreitenbegrenzung für den ausgeführten Prozess, falls die veraltete Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert ein Leerzeichen-getrenntes Paar eines Dateipfades und eines Bandbreitenwertes (in Byte pro Sekunde), um die gerätespezifische Bandbreite festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls der Bandbreite K, M, G oder T angehängt ist, wird die Bandbreite als Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M«)\&. Dies steuert die Control-Gruppen-Attribute »blkio\&.throttle\&.read_bps_device« und »blkio\&.throttle\&.write_bps_device«\&. Verwenden Sie diese Option mehrfach, um Bandbreitenbegrenzungen für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Block-E/A-Controller>\m[]\&\s-2\u[12]\d\s+2\&.

source: These settings are deprecated\&. Use I<IOReadBandwidthMax=> and I<IOWriteBandwidthMax=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<IOReadBandwidthMax=> und I<IOWriteBandwidthMax=>\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<systemd>(1), B<systemd-system.conf>(5), B<systemd.unit>(5), B<systemd.service>(5), B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.socket>(5), B<systemd.mount>(5), B<systemd.swap>(5), B<systemd.exec>(5), B<systemd.directives>(7), B<systemd.special>(7), B<systemd-oomd.service>(8), The documentation for control groups and specific controllers in the Linux kernel: \m[blue]B<Control Groups v2>\m[]\&\s-2\u[2]\d\s+2\&.
de: B<systemd>(1), B<systemd-system.conf>(5), B<systemd.unit>(5), B<systemd.service>(5), B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.socket>(5), B<systemd.mount>(5), B<systemd.swap>(5), B<systemd.exec>(5), B<systemd.directives>(7), B<systemd.special>(7), B<systemd-oomd.service>(8), Die Dokumentation für Control-Gruppen und bestimmte Controller im Linux-Kernel: \m[blue]B<Control-Gruppen v2>\m[]\&\s-2\u[2]\d\s+2\&.

source: NOTES
de: ANMERKUNGEN

source: New Control Group Interfaces
de: Neue Control-Gruppen-Schnittstellen

source: Control Groups v2
de: Control-Gruppen v2

source: Control Groups version 1
de: Control-Gruppen Version 1

source: Memory Interface Files
de: Speicherschnittstellen-Dateien

source: Process Number Controller
de: Prozessanzahl-Controller

source: IO Interface Files
de: E/A-Schnittstellen-Dateien

source: Device Whitelist Controller
de: Geräte-Positivliste-Controller

source: Control Group APIs and Delegation
de: Control-Gruppen-APIs und Delegierung

source: Memory Resource Controller
de: Speicherressourcen-Controller

source: Block IO Controller
de: Block-E/A-Controller

source: While I<StartupCPUWeight=> only applies to the startup phase of the system, I<CPUWeight=> applies to normal runtime of the system, and if the former is not set also to the startup phase\&. Using I<StartupCPUWeight=> allows prioritizing specific services at boot-up differently than during normal runtime\&.
de: Während I<StartupCPUWeight=> nur für die Hochfahrphase des Systems gilt, gilt I<CPUWeight=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hochfahrphase\&. Durch Verwendung von I<StartupCPUWeight=> ist eine abweichende Priorisierung bestimmter Dienste während des Hochfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: Setting I<AllowedCPUs=> doesn\*(Aqt guarantee that all of the CPUs will be used by the processes as it may be limited by parent units\&. The effective configuration is reported as I<EffectiveCPUs=>\&.
de: Setzen von I<AllowedCPUs=> garantiert nicht, dass sämtliche CPUs von den Prozessen verwandt werden, da es durch Eltern-Units eingeschränkt sein könnte\&. Die wirksame Konfiguration wird durch I<EffectiveCPUs=> berichtet\&.

source: Setting I<AllowedMemoryNodes=> doesn\*(Aqt guarantee that all of the memory NUMA nodes will be used by the processes as it may be limited by parent units\&. The effective configuration is reported as I<EffectiveMemoryNodes=>\&.
de: Setzen von I<AllowedMemoryNodes> garantiert nicht, dass sämtliche Speicher-NUMA-Knoten von den Prozessen verwandt werden, da es durch Eltern-Units eingeschränkt sein könnte\&. Die wirksame Konfiguration wird durch I<EffectiveMemoryNodes=> berichtet\&.

source: While I<StartupIOWeight=> only applies to the startup phase of the system, I<IOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup phase\&. This allows prioritizing specific services at boot-up differently than during runtime\&.
de: Während I<StartupIOWeight=> nur in der Hochfahrphase des Systems angewandt wird, wird I<IOWeight=> später zur Laufzeit des Systems angewandt und falls erstere nicht gesetzt ist, auch während der Hochfahrphase\&. Dies erlaubt es, bestimmte Dienste beim Hochfahren anders als zur Laufzeit zu priorisieren\&.

source: When set to B<kill>, B<systemd-oomd> will actively monitor this unit\*(Aqs cgroup metrics to decide whether it needs to act\&. If the cgroup passes the limits set by B<oomd.conf>(5) or its overrides, B<systemd-oomd> will send a B<SIGKILL> to all of the processes under the chosen candidate cgroup\&. Note that only descendant cgroups can be eligible candidates for killing; the unit that set its property to B<kill> is not a candidate (unless one of its ancestors set their property to B<kill>)\&. You can find more details on candidates and kill behavior at B<systemd-oomd.service>(8) and B<oomd.conf>(5)\&. Setting either of these properties to B<kill> will also automatically acquire I<After=> and I<Wants=> dependencies on systemd-oomd\&.service unless I<DefaultDependencies=no>\&.
de: Wird dies auf B<kill> gesetzt, dann wird B<systemd-oomd> aktiv die Cgroup-Metriken dieser Unit überwachen, um zu entscheiden, ob es handeln muss\&. Falls die Cgroup die durch B<oomd.conf>(5) oder seine Außerkraftsetzungen gesetzten Beschränkungen überschreitet, wird B<systemd-oomd> ein B<SIGKILL> an alle Prozesse unter der ausgewählten Kandidaten-Cgroup senden\&. Beachten Sie, dass nur Nachfahr-Cgroups als Kandidaten zum Töten in Frage kommen; die Unit, die ihre Eigenschaft auf B<kill> setzt, ist kein Kandidat (außer einer ihrer Vorfahren setzt seine Eigenschaft auf B<kill>)\&. Weitere Details über Kandidaten und ihr Tötungs-Verhalten können Sie in B<systemd-oomd.service>(8) und B<oomd.conf>(5) finden\&. Wird eine dieser Eigenschaften auf B<kill> und I<DefaultDependencies> nicht auf I<no> gesetzt, dann wird auch automatisch eine Abhängigkeit I<After=> und I<Wants=> auf systemd-oomd\&.service erlangt\&.

source: When set to B<auto>, B<systemd-oomd> will not actively use this cgroup\*(Aqs data for monitoring and detection\&. However, if an ancestor cgroup has one of these properties set to B<kill>, a unit with B<auto> can still be an eligible candidate for B<systemd-oomd> to act on\&.
de: Wird dies auf B<auto> gesetzt, dann wird B<systemd-oomd> nicht aktiv diese Cgroup-Daten zur Überwachung und Erkennung verwenden\&. Falls allerdings eine Vorfahr-Cgroup eine dieser Eigenschaften auf B<kill> gesetzt hat, dann kann eine Unit mit B<auto> weiterhin als Kandidat für das Handeln von B<systemd-oomd> geeignet sein\&.

source: While I<StartupCPUShares=> only applies to the startup phase of the system, I<CPUShares=> applies to normal runtime of the system, and if the former is not set also to the startup phase\&. Using I<StartupCPUShares=> allows prioritizing specific services at boot-up differently than during normal runtime\&.
de: Während I<StartupCPUShares=> nur für die Hochfahrphase des Systems gilt, gilt I<CPUShares=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hochfahrphase\&. Durch Verwendung von I<StartupCPUShares=> ist eine abweichende Priorisierung bestimmter Dienste während des Hochfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: While I<StartupBlockIOWeight=> only applies to the startup phase of the system, I<BlockIOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup phase\&. This allows prioritizing specific services at boot-up differently than during runtime\&.
de: Während I<StartupBlockIOWeight=> nur für die Hochfahrphase des Systems gilt, gilt I<BlockIOWeight=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hochfahrphase\&. Dies erlaubt eine abweichende Priorisierung bestimmter Dienste während des Hochfahrens des Systems im Vergleich zur normalen Laufzeit\&.
