Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.resource-control.5.po
Languages: de

source: This setting is supported only if the unified control group hierarchy is used and disables I<MemoryLimit=>\&.
de: Diese Einstellung wird nur unterstützt, falls die vereinigte Control-Gruppenhierarchie verwandt wird und deaktiviert I<MemoryLimit=>\&.

source: Units may have their children use a default "memory\&.min" or "memory\&.low" value by specifying I<DefaultMemoryMin=> or I<DefaultMemoryLow=>, which has the same semantics as I<MemoryMin=> and I<MemoryLow=>\&. This setting does not affect "memory\&.min" or "memory\&.low" in the unit itself\&. Using it to set a default child allocation is only useful on kernels older than 5\&.7, which do not support the "memory_recursiveprot" cgroup2 mount option\&.
de: Durch Angabe von I<DefaultMemoryMin=> oder I<DefaultMemoryLow=> (hat die gleiche Semantik wie I<MemoryMin=> und I<MemoryLow=>) können Units ihren Kindern einen Vorgabewert für »memory\&.\&.min« oder »memory\&.low« verwenden lassen\&. Diese Einstellung beeinflusst nicht »memory\&.\&.min« oder »memory\&.low« in der Unit selbst\&. Die Verwendung zum Setzen einer Vorgabe-Zuweisung ist nur auf Kerneln vor 5\&.7 nützlich, die die Cgroup2-Einhängeoption »memory_recursiveprot« nicht unterstützen\&.

source: I<MemoryHigh=>I<bytes>
de: I<MemoryHigh=>I<Byte>

source: Specify the throttling limit on memory usage of the executed processes in this unit\&. Memory usage may go above the limit if unavoidable, but the processes are heavily slowed down and memory is taken away aggressively in such cases\&. This is the main mechanism to control memory usage of a unit\&.
de: Legt die Drosselungs-Speicherverbrauchsbegrenzung der ausgeführten Prozesse in dieser Unit fest\&. Speicherverbrauch darf diese Begrenzung überschreiten, falls es unvermeidbar ist, aber die Prozesse werden drastisch verlangsamt und der Speicher wird in solchen Fällen aggressiv fortgenommen\&. Dies ist der Hauptmechanismus, um den Speicherverbrauch einer Unit zu steuern\&.

source: Takes a memory size in bytes\&. If the value is suffixed with K, M, G or T, the specified memory size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. Alternatively, a percentage value may be specified, which is taken relative to the installed physical memory on the system\&. If assigned the special value "infinity", no memory throttling is applied\&. This controls the "memory\&.high" control group attribute\&. For details about this control group attribute, see \m[blue]B<Memory Interface Files>\m[]\&\s-2\u[6]\d\s+2\&.
de: Akzeptiert eine Speichergröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die angegebene Speichergröße in Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte (zur Basis 1024) ausgewertet\&. Alternativ kann ein Prozentwert festgelegt werden, der relativ zum installierten physischen Speicher im System ist\&. Falls der besondere Wert »infinity« zugewiesen wird, wird keine Speicherdrosselung angewandt\&. Dies steuert das Control-Gruppen-Attribut »memory\&.high«\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Speicherschnittstellen-Dateien>\m[]\&\s-2\u[6]\d\s+2\&.

source: I<MemoryMax=>I<bytes>
de: I<MemoryMax=>I<Byte>

source: Specify the absolute limit on memory usage of the executed processes in this unit\&. If memory usage cannot be contained under the limit, out-of-memory killer is invoked inside the unit\&. It is recommended to use I<MemoryHigh=> as the main control mechanism and use I<MemoryMax=> as the last line of defense\&.
de: Legt die absolute Grenze der Speicherverwendung durch den ausgeführten Prozess in dieser Unit fest\&. Falls der Speicherverbrauch nicht unterhalb dieser Grenze gehalten werden kann, wird der Speicherknappheits-Killer innerhalb der Unit aufgerufen\&. Es wird empfohlen, I<MemoryHigh=> als Hauptsteuermechanismus und I<MemoryMax=> als letzte Verteidigungslinie zu verwenden\&.

source: Takes a memory size in bytes\&. If the value is suffixed with K, M, G or T, the specified memory size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. Alternatively, a percentage value may be specified, which is taken relative to the installed physical memory on the system\&. If assigned the special value "infinity", no memory limit is applied\&. This controls the "memory\&.max" control group attribute\&. For details about this control group attribute, see \m[blue]B<Memory Interface Files>\m[]\&\s-2\u[6]\d\s+2\&.
de: Akzeptiert eine Speichergröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die angegebene Speichergröße in Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte (zur Basis 1024) ausgewertet\&. Alternativ kann ein Prozentwert festgelegt werden, der relativ zum installierten physischen Speicher im System ist\&. Falls der besondere Wert »infinity« zugewiesen wird, wird keine Speicherbegrenzung angewandt\&. Dies steuert das Control-Gruppen-Attribut »memory\&.max«\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Speicherschnittstellen-Dateien>\m[]\&\s-2\u[2]\d\s+2\&.

source: This setting replaces I<MemoryLimit=>\&.
de: Diese Einstellung ersetzt I<MemoryLimit=>\&.

source: Specify the absolute limit on swap usage of the executed processes in this unit\&.
de: Legt die absolute Begrenzung bezüglich Auslagerungsverwendung von in dieser Unit ausgeführten Prozessen fest\&.

source: Takes a swap size in bytes\&. If the value is suffixed with K, M, G or T, the specified swap size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. If assigned the special value "infinity", no swap limit is applied\&. This controls the "memory\&.swap\&.max" control group attribute\&. For details about this control group attribute, see \m[blue]B<Memory Interface Files>\m[]\&\s-2\u[6]\d\s+2\&.
de: Akzeptiert eine Auslagerungsgröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die angegebene Speichergröße in Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte (zur Basis 1024) ausgewertet\&. Falls der besondere Wert »infinity« zugewiesen wird, wird keine Auslagerungsbegrenzung angewandt\&. Dies steuert das Control-Gruppen-Attribut »memory\&.swap\&.max«\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Speicherschnittstellen-Dateien>\m[]\&\s-2\u[6]\d\s+2\&.

source: Turn on task accounting for this unit\&. Takes a boolean argument\&. If enabled, the system manager will keep track of the number of tasks in the unit\&. The number of tasks accounted this way includes both kernel threads and userspace processes, with each thread counting individually\&. Note that turning on tasks accounting for one unit will also implicitly turn it on for all units contained in the same slice and for all its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultTasksAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet Prozessbuchführung für diese Unit ein\&. Akzeptiert ein logisches Argument\&. Falls aktiviert, wird der Systemverwalter die Anzahl der Prozesse in der Unit nachverfolgen\&. Die Anzahl der auf diese Art buchgeführten Prozesse enthält sowohl Kernel-Threads als auch Benutzerprozesse, wobei jeder Thread einzeln zählt\&. Beachten Sie, dass das Einschalten der Prozessbuchführung für eine Unit dies implizit auch für alle Units, die in der gleichen Scheibe enthalten sind und für alle Elternscheiben und die darin befindlichen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann durch I<DefaultTasksAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: Specify the maximum number of tasks that may be created in the unit\&. This ensures that the number of tasks accounted for the unit (see above) stays below a specific limit\&. This either takes an absolute number of tasks or a percentage value that is taken relative to the configured maximum number of tasks on the system\&. If assigned the special value "infinity", no tasks limit is applied\&. This controls the "pids\&.max" control group attribute\&. For details about this control group attribute, see \m[blue]B<Process Number Controller>\m[]\&\s-2\u[7]\d\s+2\&.
de: Legt die maximale Anzahl an Prozessen, die in dieser Unit erstellt werden dürfen, fest\&. Dies stellt sicher, dass die Anzahl der Prozesse, für die die Unit buchführt (siehe oben), unterhalb einer festgelegten Begrenzung bleibt\&. Dies akzeptiert entweder eine absolute Anzahl an Prozessen oder einen Prozentwert, der relativ zu der konfigurierten Maximalzahl an Prozessen im System ist\&. Falls der besondere Wert »infinity« zugewiesen wird, wird keine Prozessbegrenzung angewandt\&. Dies steuert das Control-Gruppen-Attribut »pids\&.max«\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Prozessanzahl-Controller>\m[]\&\s-2\u[6]\d\s+2\&.

source: The system default for this setting may be controlled with I<DefaultTasksMax=> in B<systemd-system.conf>(5)\&.
de: Die Systemvorgabe für diese Einstellung kann mit I<DefaultTasksMax=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: Turn on Block I/O accounting for this unit, if the unified control group hierarchy is used on the system\&. Takes a boolean argument\&. Note that turning on block I/O accounting for one unit will also implicitly turn it on for all units contained in the same slice and all for its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultIOAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet Block-E/A-Buchführung für diese Unit ein, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert ein logisches Argument\&. Beachten Sie, dass das Einschalten der Block-E/A-Buchführung für eine Unit dies implizit auch für alle Units, die in der gleichen Scheibe enthalten sind und für alle Elternscheiben und die darin befindlichen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann durch I<DefaultIOAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: This setting replaces I<BlockIOAccounting=> and disables settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellung ersetzt I<BlockIOAccounting=> und deaktiviert Einstellungen, denen I<BlockIO> oder I<StartupBlockIO> vorangestellt sind\&.

source: I<IOWeight=>I<weight>, I<StartupIOWeight=>I<weight>
de: I<IOWeight=>I<Gewicht>, I<StartupIOWeight=>I<Gewicht>

source: Set the default overall block I/O weight for the executed processes, if the unified control group hierarchy is used on the system\&. Takes a single weight value (between 1 and 10000) to set the default block I/O weight\&. This controls the "io\&.weight" control group attribute, which defaults to 100\&. For details about this control group attribute, see \m[blue]B<IO Interface Files>\m[]\&\s-2\u[8]\d\s+2\&. The available I/O bandwidth is split up among all units within one slice relative to their block I/O weight\&. A higher weight means more I/O bandwidth, a lower weight means less\&.
de: Setzt die vorgegebene Gesamt-Block-E/A-Gewichtung für die ausgeführten Prozesse, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert einen einzelnen Gewichtungswert (zwischen 1 und 10000), um die vorgegebene Block-E/A-Gewichtung zu setzen\&. Dies steuert das Control-Gruppen-Attribut »io\&.weight«, das standardmäßig 100 beträgt\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<E/A-Schnittstellen-Dateien>\m[]\&\s-2\u[8]\d\s+2\&. Die verfügbare E/A-Bandbreite wird zwischen allen Units innerhalb einer Scheibe relativ zu ihrer Block-E/A-Gewichtung aufgeteilt\&. Ein höherer Wert bedeutet mehr E/A-Bandbreite, ein geringerer Wert weniger\&.

source: While I<StartupIOWeight=> applies to the startup and shutdown phases of the system, I<IOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup and shutdown phases\&. This allows prioritizing specific services at boot-up and shutdown differently than during runtime\&.
de: Während I<StartupIOWeight=> in der Hoch- und Runterfahrphase des Systems angewandt wird, wird I<IOWeight=> später zur Laufzeit des Systems angewandt und falls erstere nicht gesetzt ist, auch während der Hoch- und Runterfahrphasen\&. Dies erlaubt es, bestimmte Dienste beim Hoch- und Runterfahren anders als zur Laufzeit zu priorisieren\&.

source: These settings replace I<BlockIOWeight=> and I<StartupBlockIOWeight=> and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellungen ersetzen I<BlockIOWeight=> und I<StartupBlockIOWeight=> und deaktivieren Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> anfangen\&.

source: I<IODeviceWeight=>I<device>I< >I<weight>
de: I<IODeviceWeight=>I<Gerät>I< >I<Gewicht>

source: Set the per-device overall block I/O weight for the executed processes, if the unified control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a weight value to specify the device specific weight value, between 1 and 10000\&. (Example: "/dev/sda 1000")\&. The file path may be specified as path to a block device node or as any other file, in which case the backing block device of the file system of the file is determined\&. This controls the "io\&.weight" control group attribute, which defaults to 100\&. Use this option multiple times to set weights for multiple devices\&. For details about this control group attribute, see \m[blue]B<IO Interface Files>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt die gerätebezogene Gesamt-Block-E/A-Gewichtung für den ausgeführten Prozess, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert ein Leerzeichen-getrenntes Paar eines Dateipfades und eines Gewichtungswertes, um den gerätespezifischen Gewichtungswert zwischen 1 und 10000 festzulegen\&. (Beispiel: "/dev/sda 1000")\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Dies steuert das Control-Gruppen-Attribut »io\&.weight«, das standardmäßig 100 ist\&. Verwenden Sie diese Option mehrfach, um Gewichtungen für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<E/A-Schnittstellen-Dateien>\m[]\&\s-2\u[8]\d\s+2\&.

source: This setting replaces I<BlockIODeviceWeight=> and disables settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellung ersetzt I<BlockIODeviceWeight=> und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: The specified device node should reference a block device that has an I/O scheduler associated, i\&.e\&. should not refer to partition or loopback block devices, but to the originating, physical device\&. When a path to a regular file or directory is specified it is attempted to discover the correct originating device backing the file system of the specified path\&. This works correctly only for simpler cases, where the file system is directly placed on a partition or physical block device, or where simple 1:1 encryption using dm-crypt/LUKS is used\&. This discovery does not cover complex storage and in particular RAID and volume management storage devices\&.
de: Der festgelegte Geräteknoten sollte ein Blockgerät referenzieren, der einen E/A-Scheduler zugeordnet hat, d\&.h\&. er sollte sich nicht auf eine Partition oder Loopback-Blockgeräte beziehen, sondern auf das ursprüngliche, physische Gerät\&. Wenn ein Pfad zu einer regulären Datei oder einem regulären Verzeichnis angegeben wird, wird versucht, das korrekte ursprüngliche, zugrundeliegende Geräte für den festgelegten Pfad zu entdecken\&. Dies funktioniert nur für die einfacheren Fälle korrekt, bei denen das Dateisystem direkt auf einer Partition oder einem physischen Blockgerät angelegt ist, oder bei denen einfache 1:1-Verschlüsselung mittels dm-crypt/LUKS verwandt wird\&. Diese Erkennung deckt komplexe Speicher und insbesondere RAID und Datenträger-Verwaltungs-Speichergeräte nicht ab\&.

source: I<IOReadBandwidthMax=>I<device>I< >I<bytes>, I<IOWriteBandwidthMax=>I<device>I< >I<bytes>
de: I<IOReadBandwidthMax=>I<Gerät>I< >I<Byte>, I<IOWriteBandwidthMax=>I<Gerät>I< >I<Byte>

source: Set the per-device overall block I/O bandwidth maximum limit for the executed processes, if the unified control group hierarchy is used on the system\&. This limit is not work-conserving and the executed processes are not allowed to use more even if the device has idle capacity\&. Takes a space-separated pair of a file path and a bandwidth value (in bytes per second) to specify the device specific bandwidth\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the bandwidth is suffixed with K, M, G, or T, the specified bandwidth is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M")\&. This controls the "io\&.max" control group attributes\&. Use this option multiple times to set bandwidth limits for multiple devices\&. For details about this control group attribute, see \m[blue]B<IO Interface Files>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt die gerätebezogene maximale Gesamt-Block-E/A-Bandbreitenbegrenzung für den ausgeführten Prozess, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Diese Begrenzung ist nicht arbeitserhaltend und den ausgeführten Prozessen wird nicht mehr erlaubt, selbst falls das Gerät Leerlaufkapazität hat\&. Akzeptiert ein Leerzeichen-getrenntes Paar eines Dateipfades und eines Bandbreitenwertes (in Byte pro Sekunde), um die gerätespezifische Bandbreite festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls der Bandbreite K, M, G oder T angehängt ist, wird die Bandbreite als Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M«)\&. Dies steuert das Control-Gruppen-Attribut »io\&.max«\&. Verwenden Sie diese Option mehrfach, um Bandbreitenbegrenzungen für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<E/A-Schnittstellen-Dateien>\m[]\&\s-2\u[8]\d\s+2\&.

source: These settings replace I<BlockIOReadBandwidth=> and I<BlockIOWriteBandwidth=> and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellung ersetzt I<BlockIOReadBandwidth=> und I<BlockIOWriteBandwidth=> und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: Similar restrictions on block device discovery as for I<IODeviceWeight=> apply, see above\&.
de: Ähnliche Beschränkungen für die Blockgeräte-Erkennung gelten wie bei I<IODeviceWeight=>, siehe oben\&.

source: I<IOReadIOPSMax=>I<device>I< >I<IOPS>, I<IOWriteIOPSMax=>I<device>I< >I<IOPS>
de: I<IOReadIOPSMax=>I<Gerät>I< >I<EAPS>, I<IOWriteIOPSMax=>I<Gerät>I< >I<EAPS>

source: Set the per-device overall block I/O IOs-Per-Second maximum limit for the executed processes, if the unified control group hierarchy is used on the system\&. This limit is not work-conserving and the executed processes are not allowed to use more even if the device has idle capacity\&. Takes a space-separated pair of a file path and an IOPS value to specify the device specific IOPS\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the IOPS is suffixed with K, M, G, or T, the specified IOPS is parsed as KiloIOPS, MegaIOPS, GigaIOPS, or TeraIOPS, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 1K")\&. This controls the "io\&.max" control group attributes\&. Use this option multiple times to set IOPS limits for multiple devices\&. For details about this control group attribute, see \m[blue]B<IO Interface Files>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt die gerätebezogene maximale Gesamt-Block-E/A-EA-Pro-Sekunden-Begrenzung für den ausgeführten Prozess, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Diese Begrenzung ist nicht arbeitserhaltend und den ausgeführten Prozessen wird nicht mehr als dieser Wert erlaubt, selbst falls das Gerät Leerlaufkapazität hat\&. Akzeptiert ein Leerzeichen-getrenntes Paar eines Dateipfades und eines EAPS-Wertes, um den gerätespezifischen EAPS festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls dem EAPS K, M, G oder T angehängt ist, wird der EAPS als KiloEAPS, MegaEAPS, GigaEAPS bzw\&. TeraEAPS zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 1K«)\&. Dies steuert das Control-Gruppen-Attribut »io\&.max«\&. Verwenden Sie diese Option mehrfach, um EAPS-Begrenzungen für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<E/A-Schnittstellen-Dateien>\m[]\&\s-2\u[8]\d\s+2\&.

source: These settings are supported only if the unified control group hierarchy is used and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellungen werden nur unterstützt, falls die vereinigte Control-Gruppenhierarchie verwandt wird und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: I<IODeviceLatencyTargetSec=>I<device>I< >I<target>
de: I<IODeviceLatencyTargetSec=>I<Gerät>I< >I<Ziel>

source: Set the per-device average target I/O latency for the executed processes, if the unified control group hierarchy is used on the system\&. Takes a file path and a timespan separated by a space to specify the device specific latency target\&. (Example: "/dev/sda 25ms")\&. The file path may be specified as path to a block device node or as any other file, in which case the backing block device of the file system of the file is determined\&. This controls the "io\&.latency" control group attribute\&. Use this option multiple times to set latency target for multiple devices\&. For details about this control group attribute, see \m[blue]B<IO Interface Files>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt die gerätebezogene durchschnittliche Ziel-E/A-Latenz für den ausgeführten Prozess, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Akzeptiert einen Dateipfad und eine Zeitspanne, getrennt durch ein Leerzeichen, um das gerätespezifische Latenzziel festzulegen\&. (Beispiel: "/dev/sda 25ms")\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei angegeben werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Dies steuert das Control-Gruppen-Attribut »io\&.latency«\&. Verwenden Sie diese Option mehrfach, um Latenzziele für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<E/A-Schnittstellen-Dateien>\m[]\&\s-2\u[8]\d\s+2\&.

source: Implies "IOAccounting=yes"\&.
de: Impliziert »IOAccounting=yes«\&.

source: These settings are supported only if the unified control group hierarchy is used\&.
de: Diese Einstellungen werden nur unterstützt, falls die vereinigte Control-Gruppenhierarchie verwandt wird\&.
