Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.swap.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.swap - Swap unit configuration
de: systemd.swap - Auslagerungs-Unit-Konfiguration

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: A unit configuration file whose name ends in "\&.swap" encodes information about a swap device or file for memory paging controlled and supervised by systemd\&.
de: Eine Unit-Konfigurationsdatei, deren Name in »\&.swap« endet, kodiert Informationen über ein Auslagerungsgerät oder eine Auslagerungsdatei für durch Systemd gesteuertes und überwachtes Speicherauslagern\&.

source: This man page lists the configuration options specific to this unit type\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. The swap specific configuration options are configured in the [Swap] section\&.
de: Diese Handbuchseite führt die für diesen Unit-Typ spezifischen Konfigurationsoptionen auf\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien\&. Die gemeinsamen Konfigurationseinträge werden in den generischen Abschnitten »[Unit]« und »[Install]« konfiguriert\&. Die Auslagerungs-spezifischen Konfigurationsoptionen werden in dem Abschnitt »[Swap]« konfiguriert\&.

source: Additional options are listed in B<systemd.exec>(5), which define the execution environment the B<swapon>(8) program is executed in, in B<systemd.kill>(5), which define the way these processes are terminated, and in B<systemd.resource-control>(5), which configure resource control settings for these processes of the unit\&.
de: Zusätzliche Optionen finden Sie in folgenden Handbuchseiten: B<systemd.exec>(5) zur Ausführungsumgebung, in der das Programm B<swapon>(8) ausgeführt wird; B<systemd.kill>(5) zur Art der Beendigung dieser Prozesse des Dienstes; B<systemd.resource-control>(5) zur Konfiguration der Ressourcensteuerungseinstellungen für diese Prozesse der Unit\&.

source: Swap units must be named after the devices or files they control\&. Example: the swap device /dev/sda5 must be configured in a unit file dev-sda5\&.swap\&. For details about the escaping logic used to convert a file system path to a unit name, see B<systemd.unit>(5)\&. Note that swap units cannot be templated, nor is possible to add multiple names to a swap unit by creating additional symlinks to it\&.
de: Auslagerungs-Units müssen nach den Geräten oder Dateien, die sie steuern, benannt sein\&. Beispiel: Das Auslagerungsgerät /dev/sda5 muss in einer Unit-Datei dev-sda5\&.swap konfiguriert werden\&. Für Details über die Maskierungslogik zur Umwandlung eines Dateisystempfades in einen Unit-Namen siehe B<systemd.unit>(5)\&. Beachten Sie, dass Auslagerungs-Units weder in Vorlagen genutzt werden können noch es möglich ist, mehrere Namen zu einer Auslagerungs-Unit durch Erstellung zusätzlicher Symlinks darauf hinzuzufügen\&.

source: Note that swap support on Linux is privileged, swap units are hence only available in the system service manager (and root\*(Aqs user service manager), but not in unprivileged user\*(Aqs service manager\&.
de: Beachten Sie, dass die Auslagerungs-Unterstützung unter Linux Privilegien benötigt und daher die Auslagerungs-Units nur für den Systemdiensteverwalter (und dem Benutzerdiensteverwalter von Root) verfügbar sind, nicht aber den Diensteverwaltern unprivilegierter Benutzer\&.

source: AUTOMATIC DEPENDENCIES
de: AUTOMATISCHE ABHÄNGIGKEITEN

source: Implicit Dependencies
de: Implizite Abhängigkeiten

source: The following dependencies are implicitly added:
de: Die folgenden Abhängigkeiten werden implizit hinzugefügt:

source: All swap units automatically get the I<BindsTo=> and I<After=> dependencies on the device units or the mount units of the files they are activated from\&.
de: Alle Auslagerungs-Units erhalten automatisch die Abhängigkeiten I<BindsTo=> und I<After=> von den Geräte-Units oder Einhänge-Units der Dateien, aus denen sie aktiviert werden\&.

source: Additional implicit dependencies may be added as result of execution and resource control parameters as documented in B<systemd.exec>(5) and B<systemd.resource-control>(5)\&.
de: Zusätzliche implizite Abhängigkeiten als Ergebnis der Ausführung und der gemäß B<systemd.exec>(5) und B<systemd.resource-control>(5) dokumentierten Ressourcen-Steuerungsparameter können hinzugefügt werden.

source: Default Dependencies
de: Standardabhängigkeiten

source: The following dependencies are added unless I<DefaultDependencies=no> is set:
de: Die folgenden Abhängigkeiten werden hinzugefügt, es sei denn, I<DefaultDependencies=no> ist gesetzt:

source: Swap units automatically acquire a I<Conflicts=> and a I<Before=> dependency on umount\&.target so that they are deactivated at shutdown as well as a I<Before=swap\&.target> dependency\&.
de: Auslagerungs-Units erlangen automatisch eine Abhängigkeit I<Conflicts=> und I<Before=> von umount\&.target, so dass sie beim Herunterfahren deaktiviert werden sowie eine Abhängigkeit I<Before=swap\&.target>\&.

source: Swap units may either be configured via unit files, or via /etc/fstab (see B<fstab>(5) for details)\&. Swaps listed in /etc/fstab will be converted into native units dynamically at boot and when the configuration of the system manager is reloaded\&. See B<systemd-fstab-generator>(8) for details about the conversion\&.
de: Auslagerungs-Units können entweder über Unit-Dateien oder mittels /etc/fstab (siehe B<fstab>(5) für Details) konfiguriert werden\&. In /etc/fstab aufgeführte Auslagerungen werden automatisch beim Systemstart und wenn die Konfiguration des Systemverwalters neu geladen wird, in native Units umgewandelt\&, Siehe B<systemd-fstab-generator>(8) für Details über die Umwandlung\&.

source: If a swap device or file is configured in both /etc/fstab and a unit file, the configuration in the latter takes precedence\&.
de: Falls ein Auslagerungsgerät oder eine -Datei sowohl in /etc/fstab als auch einer Unit-Datei konfiguriert ist, hat die Konfiguration in letzterer Vorrang\&.

source: When reading /etc/fstab, a few special options are understood by systemd which influence how dependencies are created for swap units\&.
de: Beim Lesen von /etc/fstab werden ein paar besondere Optionen von Systemd verstanden, die beeinflussen, wie Abhängigkeiten für Auslagerungs-Units erstellt werden\&.

source: With B<noauto>, the swap unit will not be added as a dependency for swap\&.target\&. This means that it will not be activated automatically during boot, unless it is pulled in by some other unit\&. The B<auto> option has the opposite meaning and is the default\&.
de: Mit B<noauto> wird die Auslagerungs-Unit nicht als Abhängigkeit für swap\&.target hinzugefügt\&. Dies bedeutet, dass sie nicht während des Systemstarts automatisch aktiviert wird, außer sie wird durch eine andere Unit hereingezogen\&. Die Option B<auto> hat die gegenteilige Bedeutung und ist die Vorgabe\&.

source: With B<nofail>, the swap unit will be only wanted, not required by swap\&.target\&. This means that the boot will continue even if this swap device is not activated successfully\&.
de: Mit B<nofail> wird die Auslagerungs-Unit von swap\&.target nur erwünscht, nicht verlangt\&. Das bedeutet, dass der Systemstart fortfahren wird, selbst wenn das Auslagerungsgerät nicht erfolgreich aktiviert wurde\&.

source: Configure how long systemd should wait for a device to show up before giving up on an entry from /etc/fstab\&. Specify a time in seconds or explicitly append a unit such as "s", "min", "h", "ms"\&.
de: Konfiguriert, wie lange Systemd auf das Auftauchen eines Gerätes warten soll, bevor es bei einem Eintrag aus /etc/fstab aufgibt\&. Geben Sie eine Zeit in Sekunden oder hängen Sie explizit eine Einheit wie »s«, »min«, »h«, »ms« an\&.

source: Note that this option can only be used in /etc/fstab, and will be ignored when part of the I<Options=> setting in a unit file\&.
de: Beachten Sie, dass diese Option nur in /etc/fstab genutzt werden kann und ignoriert wird, falls sie Teil der Einstellungen I<Options=> in einer Unit-Datei ist\&.

source: The swap structure will be initialized on the device\&. If the device is not "empty", i\&.e\&. it contains any signature, the operation will be skipped\&. It is hence expected that this option remains set even after the device has been initialized\&.
de: Die Auslagerungsstruktur wird auf dem Gerät initialisiert\&. Falls das Gerät nicht »leer« ist, d\&.h\&. eine Signatur enthält, wird die Aktion übersprungen\&. Es wird daher erwartet, dass diese Option gesetzt bleibt, selbst nachdem das Gerät initialisiert wurde\&.

source: See B<systemd-mkswap@.service>(8) and the discussion of B<wipefs>(8) in B<systemd.mount>(5)\&.
de: Siehe B<systemd-mkswap@.service>(8) und die Diskussion von B<wipefs>(8) in B<systemd.mount>(5)\&.

source: OPTIONS
de: OPTIONEN

source: Swap unit files may include [Unit] and [Install] sections, which are described in B<systemd.unit>(5)\&.
de: Auslagerungs-Unit-Datei können Abschnitte [Unit] und [Install] enthalten, die in B<systemd.unit>(5) beschrieben sind:

source: Swap unit files must include a [Swap] section, which carries information about the swap device it supervises\&. A number of options that may be used in this section are shared with other unit types\&. These options are documented in B<systemd.exec>(5) and B<systemd.kill>(5)\&. The options specific to the [Swap] section of swap units are the following:
de: Auslagerungs-Unit-Dateien müssen einen Abschnitt »[Swap]« enthalten, der Informationen über das von diesen Dateien überwachte Auslagerungsgerät weiterträgt\&. Eine Reihe von Optionen, die in diesem Abschnitt verwandt werden können, werden auch von anderen Unit-Typen verwandt\&. Diese Optionen sind in B<systemd.exec>(5) und B<systemd.kill>(5) dokumentiert\&. Die für den Abschnitt [Swap] speziellen Optionen sind die folgenden:

source: Takes an absolute path of a device node or file to use for paging\&. See B<swapon>(8) for details\&. If this refers to a device node, a dependency on the respective device unit is automatically created\&. (See B<systemd.device>(5) for more information\&.) If this refers to a file, a dependency on the respective mount unit is automatically created\&. (See B<systemd.mount>(5) for more information\&.) This option is mandatory\&. Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as "%%"\&.
de: Akzeptiert einen absoluten Pfad eines Geräteknotens oder einer Datei zum Auslagern\&. Siehe B<swapon>(8) für Details\&. Falls sich dies auf einen Geräteknoten bezieht, wird eine Abhängigkeit auf die entsprechende Geräte-Unit automatisch erstellt\&. (Siehe B<systemd.device>(5) für weitere Informationen\&.) Falls sich dies auf eine Datei bezieht, wird eine Abhängigkeit auf die entsprechende Einhänge-Unit automatisch erstellt\&. (Siehe B<systemd.mount>(5) für weitere Informationen\&.) Diese Option ist zwingend erforderlich\&. Beachten Sie, dass die normale Expansion von Kennzeichnern auf diese Einstellung angewandt wird, daher sollten wörtliche Prozentzeichen als »%%« geschrieben werden\&.

source: Swap priority to use when activating the swap device or file\&. This takes an integer\&. This setting is optional and ignored when the priority is set by B<pri=> in the I<Options=> key\&.
de: Zu verwendende Auslagerungspriorität bei der Aktivierung des Auslagerungsgerätes oder der Auslagerungsdatei\&. Dies akzeptiert eine Ganzzahl\&. Diese Einstellung ist optional und wird ignoriert, wenn die Priorität durch B<pri=> im Schlüssel I<Options=> gesetzt wird\&.

source: May contain an option string for the swap device\&. This may be used for controlling discard options among other functionality, if the swap backing device supports the discard or trim operation\&. (See B<swapon>(8) for more information\&.) Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as "%%"\&.
de: Kann eine Optionszeichenkette für das Auslagerungsgerät enthalten\&. Dies kann neben weiterer Funktionalität für das Steuern der »discard«-Optionen verwandt werden, falls das der Auslagerung zugrunde liegende Gerät die Aktion »discard« oder »trim« unterstützt\&. (Siehe B<swapon>(8) für weitere Informationen\&.) Beachten Sie, dass die normale Expansion von Kennzeichnern auf diese Einstellung angewandt wird, daher sollten wörtliche Prozentzeichen als »%%« geschrieben werden\&.

source: Configures the time to wait for the swapon command to finish\&. If a command does not exit within the configured time, the swap will be considered failed and be shut down again\&. All commands still running will be terminated forcibly via B<SIGTERM>, and after another delay of this time with B<SIGKILL>\&. (See B<KillMode=> in B<systemd.kill>(5)\&.) Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Pass "0" to disable the timeout logic\&. Defaults to I<DefaultTimeoutStartSec=> from the manager configuration file (see B<systemd-system.conf>(5))\&.
de: Konfiguriert die Zeit, die auf das Beenden des Befehls »swapon« gewartet wird\&. Falls ein Befehl sich nicht innerhalb der konfigurierten Zeit beendet, wird die Auslagerung als fehlgeschlagen betrachtet und wieder heruntergefahren\&. Alle noch laufenden Befehle werden zwangsweise mittels B<SIGTERM> und nach einer weiteren Verzögerung dieser Zeitdauer mit B<SIGKILL> beendet\&. (Siehe B<KillMode=> in B<systemd.kill>(5)\&.) Akzeptiert einen einheitenfreien Wert in Sekunden oder einen Zeitdauerwert wie »5min 20s«\&. Durch Übergabe von »0« wird die Zeitüberschreitungslogik deaktiviert\&. Standardmäßig I<DefaultTimeoutStartSec=> aus der Verwalterkonfigurationsdatei (siehe B<systemd-system.conf>(5))\&.

source: Check B<systemd.unit>(5), B<systemd.exec>(5), and B<systemd.kill>(5) for more settings\&.
de: Lesen Sie B<systemd.unit>(5), B<systemd.exec>(5) und B<systemd.kill>(5) für weitere Einstellungen\&.

source: SEE ALSO
de: SIEHE AUCH

source: Check B<systemd.exec>(5) and B<systemd.kill>(5) for more settings\&.
de: Lesen Sie B<systemd.exec>(5) und B<systemd.kill>(5) für weitere Einstellungen\&.
