Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.automount.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.automount - Automount unit configuration
de: systemd.automount - Unit-Konfiguration für Selbsteinhängungen

source: SYNOPSIS
de: ÜBERSICHT

source: I<automount>\&.automount
de: I<Selbsteinhängung>\&.automount

source: DESCRIPTION
de: BESCHREIBUNG

source: A unit configuration file whose name ends in "\&.automount" encodes information about a file system automount point controlled and supervised by systemd\&. Automount units may be used to implement on-demand mounting as well as parallelized mounting of file systems\&.
de: Eine Unit-Konfigurationsdatei, deren Namen in »\&.automount« endet, kodiert Informationen über einen von Systemd gesteuerten und überwachten Dateisystem-Selbsteinhängepunkt\&. Selbsteinhängungs-Units können zur Realisierungs bedarfsgesteuerter Einhängung sowie parallelisierter Einhängung von Dateisystemen verwandt werden.

source: This man page lists the configuration options specific to this unit type\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. The automount specific configuration options are configured in the [Automount] section\&.
de: Diese Handbuchseite führt die für diesen Unit-Typ spezifischen Konfigurationsoptionen auf\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien\&. Die gemeinsamen Konfigurationseinträge werden in den generischen Abschnitten »[Unit]« und »[Install]« konfiguriert\&. Die Selbsteinhängung-spezifischen Konfigurationsoptionen werden in dem Abschnitt »[Automount]« konfiguriert\&.

source: Automount units must be named after the automount directories they control\&. Example: the automount point /home/lennart must be configured in a unit file home-lennart\&.automount\&. For details about the escaping logic used to convert a file system path to a unit name see B<systemd.unit>(5)\&. Note that automount units cannot be templated, nor is it possible to add multiple names to an automount unit by creating additional symlinks to its unit file\&.
de: Automount-Units müssen nach dem Selbsteinhängungsverzeichnis, das sie steuern, benannt sein\&. Beispiel: Der Selbsteinhängepunkt /home/lennart muss in einer Unit-Datei home-lennart\&.automount konfiguriert sein\&. Für Details über die Maskierungslogik, die zur Umwandlung eines Dateisystempfades in einen Unit-Namen verwandt wird, siehe B<systemd.unit>(5)\&. Beachten Sie, dass Automount-Units nicht aus Vorlagen erstellt werden können und dass es auch nicht möglich ist, mehrere Namen zu einer Automount-Unit durch Erstellung zusätzlicher Symlinks auf seine Unit-Datei hinzuzufügen\&.

source: For each automount unit file a matching mount unit file (see B<systemd.mount>(5) for details) must exist which is activated when the automount path is accessed\&. Example: if an automount unit home-lennart\&.automount is active and the user accesses /home/lennart the mount unit home-lennart\&.mount will be activated\&.
de: Für jede Automount-Unit-Datei muss eine passende Einhänge-Unit-Datei (siehe B<systemd.mount>(5) für Details) existieren, die aktiviert wird, wenn auf den Selbsteinhängungspfad zugegriffen wird\&. Beispiel: Falls eine Automount-Unit home-lennart\&.automount aktiv ist und der Benutzer auf /home/lennart zugreift, wird die Einhänge-Unit home-lennart\&.mount aktiviert\&.

source: Note that automount units are separate from the mount itself, so you should not set I<After=> or I<Requires=> for mount dependencies here\&. For example, you should not set I<After=network-online\&.target> or similar on network filesystems\&. Doing so may result in an ordering cycle\&.
de: Beachten Sie, dass Selbsteinhänge-Units unabhängig von der Einhängung selbst sind, daher sollten Sie hier keine I<After=>- oder I<Requires=>-Einhängeabhängigkeiten setzen\&. Beispielsweise sollten Sie bei Netzwerkdateisystemen nicht I<After=network-online\&.target> oder ähnliches setzen\&. Falls Sie dies machen, könnte dies zu einem Ordnungszyklus führen\&.

source: Note that automount support on Linux is privileged, automount units are hence only available in the system service manager (and root\*(Aqs user service manager), but not in unprivileged users\*(Aq service managers\&.
de: Beachten Sie, dass die Unterstützung für Selbsteinhängungen unter Linux Privilegien benötigt und daher die Selbsteinhänge-Units nur für den Systemdiensteverwalter (und dem Benutzerdiensteverwalter von Root) verfügbar sind, nicht aber den Diensteverwaltern unprivilegierter Benutzer\&.

source: Note that automount units should not be nested\&. (The establishment of the inner automount point would unconditionally pin the outer mount point, defeating its purpose\&.)
de: Beachten Sie, dass Selbsteinhänge-Units nicht verschachtelt werden sollten\&. (Die Errichtung des inneren Selbsteinhängepunktes würde bedingungslos den äußeren Einhängepunkt fixieren und damit seinen Zweck vereiteln\&.

source: AUTOMATIC DEPENDENCIES
de: AUTOMATISCHE ABHÄNGIGKEITEN

source: Implicit Dependencies
de: Implizite Abhängigkeiten

source: The following dependencies are implicitly added:
de: Die folgenden Abhängigkeiten werden implizit hinzugefügt:

source: If an automount unit is beneath another mount unit in the file system hierarchy, a requirement and ordering dependencies are created to the on the unit higher in the hierarchy\&.
de: Falls eine Automount-Unit unterhalb einer anderen Einhänge-Unit in der Dateisystemhierarchie ist, wird eine Anforderungs- und eine Ordnungsabhängigkeit auf die Unit, die hierarchisch höher ist, erstellt\&.

source: An implicit I<Before=> dependency is created between an automount unit and the mount unit it activates\&.
de: Zwischen einer Automount-Unit und der von ihr aktivierten Einhänge-Unit wird eine implizite I<Before=>-Abhängigkeit erstellt\&.

source: Default Dependencies
de: Standardabhängigkeiten

source: The following dependencies are added unless I<DefaultDependencies=no> is set:
de: Die folgenden Abhängigkeiten werden hinzugefügt, es sei denn, I<DefaultDependencies=no> ist gesetzt:

source: Automount units acquire automatic I<Before=> and I<Conflicts=> on umount\&.target in order to be stopped during shutdown\&.
de: Automount-Units erhalten automatisch I<Before=> und I<Conflicts=> von umount\&.target, um während des Herunterfahrens gestoppt zu werden\&.

source: Automount units automatically gain an I<After=> dependency on local-fs-pre\&.target, and a I<Before=> dependency on local-fs\&.target\&.
de: Automount-Units erlangen automatisch eine Abhängigkeit I<After=> auf local-fs-pre\&.target und eine Abhängigkeit I<Before=> auf local-fs\&.target\&.

source: Automount units may either be configured via unit files, or via /etc/fstab (see B<fstab>(5) for details)\&.
de: Automount-Units können entweder über Unit-Dateien oder mittels /etc/fstab (siehe B<fstab>(5) für Details) konfiguriert werden\&.

source: For details how systemd parses /etc/fstab see B<systemd.mount>(5)\&.
de: Für Details darüber, wie Systemd /etc/fstab auswertet, siehe B<systemd.mount>(5)\&.

source: If an automount point is configured in both /etc/fstab and a unit file, the configuration in the latter takes precedence\&.
de: Falls ein Selbsteinhängepunkt sowohl in /etc/fstab als auch in einer Unit-Datei konfiguriert wird, hat die letzte Konfiguration Vorrang\&.

source: OPTIONS
de: OPTIONEN

source: Automount unit files may include [Unit] and [Install] sections, which are described in B<systemd.unit>(5)\&.
de: Selbsteinhängungs-Unit-Dateien können Abschnitte [Unit] und [Install] enthalten, die in B<systemd.unit>(5) beschrieben sind\&.

source: Automount unit files must include an [Automount] section, which carries information about the file system automount points it supervises\&. The options specific to the [Automount] section of automount units are the following:
de: Selbsteinhängungs-Unit-Dateien müssen einen Abschnitt [Automount] enthalten, der Informationen über die Dateisystem-Selbsteinhängungen, die sie überwacht, transportiert\&. Die für den Abschnitt [Automount] speziellen Optionen von Automount-Units sind die folgenden:

source: Takes an absolute path of a directory of the automount point\&. If the automount point does not exist at time that the automount point is installed, it is created\&. This string must be reflected in the unit filename\&. (See above\&.) This option is mandatory\&.
de: Akzeptiert einen absoluten Pfad eines Verzeichnisses des Selbsteinhängungspunkt\&. Falls der Selbsteinhängepunkt zum Zeitpunkt der Installation des Selbsteinhängepunktes nicht existiert, wird er erstellt\&. Diese Zeichenkette muss sich im Dateinamen der Unit wiederspiegeln\&. (Siehe oben\&.) Diese Option ist verpflichtend\&.

source: Extra mount options to use when creating the autofs mountpoint\&. This takes a comma-separated list of options\&. This setting is optional\&. Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as "%%"\&.
de: Extra-Einhängeoptionen, die bei der Erstellung des Autofs-Einhängepunkts verwandt werden sollen\&. Dies akzeptiert eine Kommata-getrennte Liste von Optionen\&. Diese Einstellung ist optional\&. Beachten Sie, dass die übliche Kennzeichner-Expansionen auf diese Einstellung angewandt wird, wörtliche Prozentzeichen sollten daher als »%%« geschrieben werden\&.

source: Directories of automount points (and any parent directories) are automatically created if needed\&. This option specifies the file system access mode used when creating these directories\&. Takes an access mode in octal notation\&. Defaults to 0755\&.
de: Verzeichnisse von Selbsteinhängepunkten (und alle Elternverzeichnisse) werden falls notwendig automatisch erstellt\&. Diese Option legt den beim Erstellen dieser Verzeichnisse zu verwendenden Dateizugriffsmodus fest\&. Akzeptiert einen Zugriffsmodus in oktaler Schreibweise\&. Standardmäßig 0755\&.

source: Configures an idle timeout\&. Once the mount has been idle for the specified time, systemd will attempt to unmount\&. Takes a unit-less value in seconds, or a time span value such as "5min 20s"\&. Pass 0 to disable the timeout logic\&. The timeout is disabled by default\&.
de: Konfiguriert eine Leerlaufzeitüberschreitung\&. Sobald die Einhängung für die festgelegte Zeit im Leerlauf war, wird Systemd ein Aushängen versuchen\&. Akzeptiert einen einheitenfreien Wert in Sekunden oder einen Zeitbereichswert wie »5min 20s«\&. Übergeben Sie 0, um die Zeitüberschreitungslogik zu deaktivieren\&. Die Zeitüberschreitung ist standardmäßig deaktiviert\&.

source: Check B<systemd.unit>(5), B<systemd.exec>(5), and B<systemd.kill>(5) for more settings\&.
de: Lesen Sie B<systemd.unit>(5), B<systemd.exec>(5) und B<systemd.kill>(5) für weitere Einstellungen\&.

source: SEE ALSO
de: SIEHE AUCH

source: A unit configuration file whose name ends in "\&.automount" encodes information about a file system automount point controlled and supervised by systemd\&.
de: Eine Unit-Konfigurationsdatei, deren Namen in »\&.automount« endet, kodiert Informationen über einen von Systemd gesteuerten und überwachten Dateisystem-Selbsteinhängepunkt\&.

source: Automount units may be used to implement on-demand mounting as well as parallelized mounting of file systems\&.
de: Automount-Units können für die Implementierung bedarfsgesteuerter Einhängungen sowie zur parallelisierten Einhängung von Dateisystemen benutzt werden\&.

source: Note that automount support on Linux is privileged, automount units are hence only available in the system service manager (and root\*(Aqs user service manager), but not in unprivileged user\*(Aqs service manager\&.
de: Beachten Sie, dass die Unterstützung für Selbsteinhängungen unter Linux Privilegien benötigt und daher die Selbsteinhänge-Units nur für den Systemdiensteverwalter (und dem Benutzerdiensteverwalter von Root) verfügbar sind, nicht aber den Diensteverwaltern unprivilegierter Benutzer\&.

source: If an automount unit is beneath another mount unit in the file system hierarchy, both a requirement and an ordering dependency between both units are created automatically\&.
de: Falls eine Automount-Unit unterhalb einer anderen Einhänge-Unit in der Dateisystemhierarchie ist, wird automatisch sowohl eine Anforderungs- und eine Ordnungsabhängigkeit zwischen beiden Units erstellt\&.

source: Automount files must include an [Automount] section, which carries information about the file system automount points it supervises\&. The options specific to the [Automount] section of automount units are the following:
de: Selbsteinhängungsdateien müssen einen Abschnitt [Automount] enthalten, der Informationen über die Dateisystem-Selbsteinhängungen, die sie überwacht, transportiert\&. Die für den Abschnitt [Automount] speziellen Optionen von Automount-Units sind die folgenden:
