Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.resource-control.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.resource-control - Resource control unit settings
de: systemd.resource-control - Resourcensteuerungs-Unit-Einstellungen

source: SYNOPSIS
de: ÜBERSICHT

source: I<slice>\&.slice, I<scope>\&.scope, I<service>\&.service, I<socket>\&.socket, I<mount>\&.mount, I<swap>\&.swap
de: I<Scheibe>\&.slice, I<Bereich>\&.scope, I<Dienst>\&.service, I<Socket>\&.socket, I<Einhängung>\&.mount, I<Swap>\&.swap

source: DESCRIPTION
de: BESCHREIBUNG

source: Unit configuration files for services, slices, scopes, sockets, mount points, and swap devices share a subset of configuration options for resource control of spawned processes\&. Internally, this relies on the Linux Control Groups (cgroups) kernel concept for organizing processes in a hierarchical tree of named groups for the purpose of resource management\&.
de: Unit-Konfigurationsdateien für Dienste, Scheiben, Bereiche, Sockets, Einhängepunkte und Swap-Geräte nutzen eine Teilmenge der Konfigurationsoptionen für die Ressourcensteuerung von erzeugten Prozessen gemeinsam\&. Intern verlässt sich dies auf das Konzept der Linux Control Groups (cgroups) des Kernels zur Organisation von Prozessen in einem hierarchischen Baum benannter Gruppen zum Zwecke der Ressourcensteuerung\&.

source: This man page lists the configuration options shared by those six unit types\&. See B<systemd.unit>(5) for the common options of all unit configuration files, and B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.service>(5), B<systemd.socket>(5), B<systemd.mount>(5), and B<systemd.swap>(5) for more information on the specific unit configuration files\&. The resource control configuration options are configured in the [Slice], [Scope], [Service], [Socket], [Mount], or [Swap] sections, depending on the unit type\&.
de: Diese Handbuchseite listet die von diesen sechs Unit-Typen gemeinsam benutzten Optionen auf\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien und B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.service>(5), B<systemd.socket>(5), B<systemd.mount>(5) und B<systemd.swap>(5) für weitere Informationen über die speziellen Unit-Konfigurationsdateien\&. Die Ressourcensteuerungskonfigurationsoptionen werden in den Abschnitten [Slice], [Scope], [Service], [Socket], [Mount] oder [Swap], abhängig vom Unit-Typ, konfiguriert\&.

source: In addition, options which control resources available to programs I<executed> by systemd are listed in B<systemd.exec>(5)\&. Those options complement options listed here\&.
de: Zusätzlich werden Optionen, die die verfügbaren Ressourcen der von Systemd I<gestarteten> Programme steuern, in B<systemd.exec>(5) aufgeführt\&. Diese Optionen ergänzen die hier aufgeführten Optionen\&.

source: See the \m[blue]B<New Control Group Interfaces>\m[]\&\s-2\u[1]\d\s+2 for an introduction on how to make use of resource control APIs from programs\&.
de: Siehe die \m[blue]B<Neue Control-Gruppen-Schnittstellen>\m[]\&\s-2\u[1]\d\s+2 für eine Einführung, wie die Ressourcensteuerungs-APIs von Programmen genutzt werden können\&.

source: Setting resource controls for a group of related units
de: Ressourcensteuerungen für eine Cgroup zugehöriger Units setzen

source: As described in B<systemd.unit>(5), the settings listed here may be set through the main file of a unit and drop-in snippets in *\&.d/ directories\&. The list of directories searched for drop-ins includes names formed by repeatedly truncating the unit name after all dashes\&. This is particularly convenient to set resource limits for a group of units with similar names\&.
de: Wie in B<systemd.unit>(5) beschrieben, können die hier aufgeführten Einstellungen über die Hauptkonfigurationsdatei einer Unit und Ergänzungsschnipsel in *\&.d/-Verzeichnissen gesetzt werden\&. Die Liste der nach Ergänzungen durchsuchten Verzeichnisse enthält Namen, die durch wiederholtes Abschneiden des Units-Namens nach allen Gedankenstrichen geformt werden\&. Dies ist insbesondere praktisch, um Ressourcenbegrenzungen für eine Gruppe von Units mit ähnlichen Namen zu setzen\&.

source: For example, every user gets their own slice user-I<nnn>\&.slice\&. Drop-ins with local configuration that affect user 1000 may be placed in /etc/systemd/system/user-1000\&.slice, /etc/systemd/system/user-1000\&.slice\&.d/*\&.conf, but also /etc/systemd/system/user-\&.slice\&.d/*\&.conf\&. This last directory applies to all user slices\&.
de: Beispielsweise erhält jeder Benutzer seine eigene Scheibe user-I<nnn>\&.slice\&. Ergänzungen mit lokaler Konfiguration, die Benutzer 1000 betreffen, können in /etc/systemd/system/user-1000\&.slice, /etc/systemd/system/user-1000\&.slice\&.d/*\&.conf, aber auch in /etc/systemd/system/user-\&.slice\&.d/*\&.conf abgelegt werden\&. Das letzte Verzeichnis gilt für alle Benutzer-Scheiben\&.

source: IMPLICIT DEPENDENCIES
de: IMPLIZITE ABHÄNGIGKEITEN

source: The following dependencies are implicitly added:
de: Die folgenden Abhängigkeiten werden implizit hinzugefügt:

source: Units with the I<Slice=> setting set automatically acquire I<Requires=> and I<After=> dependencies on the specified slice unit\&.
de: Units mit der gesetzten Einstellung I<Slice=> erlangen automatisch I<Requires=>- und I<After=>-Abhängigkeiten auf die festgelegte Scheiben-Unit\&.

source: UNIFIED AND LEGACY CONTROL GROUP HIERARCHIES
de: VEREINIGTE UND VERALTETE CONTROL-GRUPPENHIERARCHIEN

source: The unified control group hierarchy is the new version of kernel control group interface, see \m[blue]B<Control Groups v2>\m[]\&\s-2\u[2]\d\s+2\&. Depending on the resource type, there are differences in resource control capabilities\&. Also, because of interface changes, some resource types have separate set of options on the unified hierarchy\&.
de: Die vereinigte Control-Gruppenhierarchie ist die neue Version der Schnittstelle der Kernel-Control-Gruppenhierarchie, siehe \m[blue]B<Control-Gruppen v2>\m[]\&\s-2\u[2]\d\s+2\&. Abhängig von dem Ressourcentyp gibt es Unterschiede in den Ressourcensteuerfähigkeiten\&. Da auch die Schnittstelle sich ändert, haben einige Ressourcentypen separate Gruppen von Optionen für die vereinigte Hierarchie\&.

source: I<CPUWeight=> and I<StartupCPUWeight=> replace I<CPUShares=> and I<StartupCPUShares=>, respectively\&.
de: I<CPUWeight=> und I<StartupCPUWeight=> ersetzen I<CPUShares=> respektive I<StartupCPUShares=>\&.

source: The "cpuacct" controller does not exist separately on the unified hierarchy\&.
de: Der Controller »cpuacct« existiert auf der vereinigten Hierarchie nicht separat\&.

source: Memory
de: Speicher

source: I<MemoryMax=> replaces I<MemoryLimit=>\&. I<MemoryLow=> and I<MemoryHigh=> are effective only on unified hierarchy\&.
de: I<MemoryMax=> ersetzt I<MemoryLimit=>\&. I<MemoryLow=> und I<MemoryHigh=> sind nur auf der vereinigten Hierarchie effektiv.

source: IO
de: IO (E/A)

source: "IO"-prefixed settings are a superset of and replace "BlockIO"-prefixed ones\&. On unified hierarchy, IO resource control also applies to buffered writes\&.
de: Die Einstellungen, denen »IO« vorangestellt ist, sind eine Obermenge von und ersetzen die Einstellungen, denen »BlockIO« vorangestellt ist\&. Auf der vereinigten Hierarchie gilt die E/A-Ressourcensteuerung auch für gepufferte Schreibvorgänge\&.

source: To ease the transition, there is best-effort translation between the two versions of settings\&. For each controller, if any of the settings for the unified hierarchy are present, all settings for the legacy hierarchy are ignored\&. If the resulting settings are for the other type of hierarchy, the configurations are translated before application\&.
de: Um den Übergang zu erleichtern, erfolgt die Übersetzung zwischen den zwei Versionen der Einstellungen nach besten Kräften\&. Falls irgendeine der Einstellungen für die vereinigte Hierarchie vorhanden ist, werden für jeden Controller alle Einstellugnen aus der veralteten Hierarchie ignoriert\&. Falls die entstehenden Einstellungen für den anderen Hierarchietyp sind, wird die Konfiguration vor der Anwendung übersetzt\&.

source: Legacy control group hierarchy (see \m[blue]B<Control Groups version 1>\m[]\&\s-2\u[3]\d\s+2), also called cgroup-v1, doesn\*(Aqt allow safe delegation of controllers to unprivileged processes\&. If the system uses the legacy control group hierarchy, resource control is disabled for the systemd user instance, see B<systemd>(1)\&.
de: Die veraltete Control-Gruppenhierarchie (siehe \m[blue]B<Control-Gruppen Version 1>\m[]\&\s-2\u[3]\d\s+2), auch als Cgroup-v1 bekannt, erlaubt keine sichere Delegation von Controllern an unprivilegierte Prozesse\&. Falls das System die veraltete Control-Gruppenhierarchie benutzt, wird die Ressourcensteuerung für die Systemd-Benutzerinstanz deaktiviert, siehe B<systemd>(1)\&.

source: OPTIONS
de: OPTIONEN

source: Units of the types listed above can have settings for resource control configuration:
de: Units der oben aufgeführten Typen können Einstellungen für die Ressourcensteuerungskonfiguration haben:

source: Turn on CPU usage accounting for this unit\&. Takes a boolean argument\&. Note that turning on CPU accounting for one unit will also implicitly turn it on for all units contained in the same slice and for all its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultCPUAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet die Buchführung für die CPU-Benutzung für diese Unit ein\&. Akzeptiert ein logisches Argument\&. Beachten Sie, dass das Einschalten der CPU-Buchführung in einer Unit implizit die Buchführung für alle Units in der gleichen Scheibe und für alle ihre Eltern-Scheiben und die darin enthaltenen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann mit I<DefaultCPUAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: I<CPUWeight=>I<weight>, I<StartupCPUWeight=>I<weight>
de: I<CPUWeight=>I<Gewicht>, I<StartupCPUWeight=>I<Gewicht>

source: Assign the specified CPU time weight to the processes executed, if the unified control group hierarchy is used on the system\&. These options take an integer value and control the "cpu\&.weight" control group attribute\&. The allowed range is 1 to 10000\&. Defaults to 100\&. For details about this control group attribute, see \m[blue]B<Control Groups v2>\m[]\&\s-2\u[2]\d\s+2 and \m[blue]B<CFS Scheduler>\m[]\&\s-2\u[4]\d\s+2\&. The available CPU time is split up among all units within one slice relative to their CPU time weight\&. A higher weight means more CPU time, a lower weight means less\&.
de: Weist die festgelegte CPU-Zeitgewichtung den ausgeführten Prozessen zu, falls die vereinigte Control-Gruppenhierarchie auf dem System verwandt wird\&. Diese Optionen akzeptieren einen Ganzzahlwert und steuern das Control-Group-Attribut »cpu\&.weight«\&. Der erlaubte Bereich ist 1 bis 10000\&. Standardmäßig 100\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Control-Gruppen v2>\m[]\&\s-2\u[2]\d\s+2 und \m[blue]B<CFS-Auftragsplaner>\m[]\&\s-2\u[4]\d\s+2\&. Die verfügbare CPU-Zeit wird zwischen allen Units innerhalb einer Scheibe relativ zu ihrer CPU-Zeitgewichtung aufgeteilt\&. Ein höheres Gewicht bedeutet mehr CPU-Zeit, ein geringeres Gewicht weniger\&.

source: While I<StartupCPUWeight=> applies to the startup and shutdown phases of the system, I<CPUWeight=> applies to normal runtime of the system, and if the former is not set also to the startup and shutdown phases\&. Using I<StartupCPUWeight=> allows prioritizing specific services at boot-up and shutdown differently than during normal runtime\&.
de: Während I<StartupCPUWeight=> für die Hoch- und Runterfahrphase des Systems gilt, gilt I<CPUWeight=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hoch- und Runterfahrphasen\&. Durch Verwendung von I<StartupCPUWeight=> ist eine abweichende Priorisierung bestimmter Dienste während des Hoch- und Runterfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: These settings replace I<CPUShares=> and I<StartupCPUShares=>\&.
de: Diese Einstellungen ersetzen I<CPUShares=> und I<StartupCPUShares=>\&.

source: Assign the specified CPU time quota to the processes executed\&. Takes a percentage value, suffixed with "%"\&. The percentage specifies how much CPU time the unit shall get at maximum, relative to the total CPU time available on one CPU\&. Use values E<gt> 100% for allotting CPU time on more than one CPU\&. This controls the "cpu\&.max" attribute on the unified control group hierarchy and "cpu\&.cfs_quota_us" on legacy\&. For details about these control group attributes, see \m[blue]B<Control Groups v2>\m[]\&\s-2\u[2]\d\s+2 and \m[blue]B<sched-bwc\&.txt>\m[]\&\s-2\u[5]\d\s+2\&. Setting I<CPUQuota=> to an empty value unsets the quota\&.
de: Weist die festgelegte CPU-Zeitquote den ausgeführten Prozessen zu\&. Akzeptiert einen Prozentwert, dem »%« angehängt ist\&. Der Prozentwert gibt an, wieviel CPU-Zeit die Unit maximal erhalten soll, relativ zu der gesamten CPU-Zeit, die auf einer CPU verfügbar ist\&. Verwenden Sie Werte E<gt> 100%, um CPU-Zeit auf mehr als einer CPU vorzusehen\&. Dies steuert das Attribut »cpu\&.max« der vereinigten Control-Gruppenhierarchie und »cpu\&.max« auf der alten\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Control-Gruppen v2>\m[]\&\s-2\u[2]\d\s+2 und \m[blue]B<sched-bwc\&.txt>\m[]\&\s-2\u[5]\d\s+2\&. Durch Setzen von I<CPUQuota=> auf einen leeren Wert wird keine Quote gesetzt\&.

source: Example: I<CPUQuota=20%> ensures that the executed processes will never get more than 20% CPU time on one CPU\&.
de: Beispiel: I<CPUQuota=20%> stellt sicher, dass der ausgeführte Prozess niemals mehr als 20% CPU-Zeit auf einer CPU erhält\&.

source: Assign the duration over which the CPU time quota specified by I<CPUQuota=> is measured\&. Takes a time duration value in seconds, with an optional suffix such as "ms" for milliseconds (or "s" for seconds\&.) The default setting is 100ms\&. The period is clamped to the range supported by the kernel, which is [1ms, 1000ms]\&. Additionally, the period is adjusted up so that the quota interval is also at least 1ms\&. Setting I<CPUQuotaPeriodSec=> to an empty value resets it to the default\&.
de: Weist die Dauer zu, über den die durch I<CPUQuota=> festgelegte CPU-Zeit-Kontingent gemessen wird\&. Akzeptiert einen Zeitdauerwert in Sekunden mit einer optionalen Endung wie »ms« für Millisekunden (oder »s« für Sekunden)\&. Die Voreinstellung ist 100 ms\&. Die Periode wird an den durch den Kernel unterstützten Bereich, der [1ms, 1000ms] ist, befestigt\&. Zusätzlich wird die Periode angepasst, so dass das Kontingent-Intervall auch mindestens 1 ms ist\&. Wird I<CPUQuotaPeriodSec=> auf einen leeren Wert gesetzt, so wird er auf die Vorgabe zurückgesetzt\&.

source: This controls the second field of "cpu\&.max" attribute on the unified control group hierarchy and "cpu\&.cfs_period_us" on legacy\&. For details about these control group attributes, see \m[blue]B<Control Groups v2>\m[]\&\s-2\u[2]\d\s+2 and \m[blue]B<CFS Scheduler>\m[]\&\s-2\u[4]\d\s+2\&.
de: Dies steuert das zweite Feld des Attributs »cpu\&.max« der vereinigten Control-Gruppenhierarchie und »cpu\&.cfs_period_us« auf der alten\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<Control-Gruppen v2>\m[]\&\s-2\u[2]\d\s+2 und \m[blue]B<CFS-Auftragsplaner>\m[]\&\s-2\u[4]\d\s+2\&.

source: Example: I<CPUQuotaPeriodSec=10ms> to request that the CPU quota is measured in periods of 10ms\&.
de: Beispiel: Mit I<CPUQuotaPeriodSec=10ms> wird erbeten, das CPU-Kontingent in Perioden von 10 ms zu messen\&.

source: Restrict processes to be executed on specific CPUs\&. Takes a list of CPU indices or ranges separated by either whitespace or commas\&. CPU ranges are specified by the lower and upper CPU indices separated by a dash\&.
de: Beschränkt die Ausführung von Prozessen auf bestimmte CPUs\&. Akzeptiert eine Liste von CPU-Indicies oder -Bereichen, getrennt durch Leerraum oder Kommata\&. CPU-Bereiche werden durch den unteren und oberen CPU-Index, getrennt durch einen Bindestrich, angegeben\&.

source: Setting I<AllowedCPUs=> or I<StartupAllowedCPUs=> doesn\*(Aqt guarantee that all of the CPUs will be used by the processes as it may be limited by parent units\&. The effective configuration is reported as I<EffectiveCPUs=>\&.
de: Setzen von I<AllowedCPUs=> oder I<StartupAllowedCPUs=> garantiert nicht, dass sämtliche CPUs von den Prozessen verwandt werden, da es durch Eltern-Units eingeschränkt sein könnte\&. Die wirksame Konfiguration wird durch I<EffectiveCPUs=> berichtet\&.

source: While I<StartupAllowedCPUs=> applies to the startup and shutdown phases of the system, I<AllowedCPUs=> applies to normal runtime of the system, and if the former is not set also to the startup and shutdown phases\&. Using I<StartupAllowedCPUs=> allows prioritizing specific services at boot-up and shutdown differently than during normal runtime\&.
de: Während I<StartupAllowedCPU=> nur für die Hoch- und Runterfahrphasen des Systems gelten, gilt I<AllowedCPUs=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hoch- und Runterfahrphasen\&. Durch Verwendung von I<StartupAllowedCPUs=> ist eine abweichende Priorisierung bestimmter Dienste während des Hoch- und Runterfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: This setting is supported only with the unified control group hierarchy\&.
de: Diese Einstellung wird nur mit der vereinigten Control-Gruppenhierarchie unterstützt\&.

source: Restrict processes to be executed on specific memory NUMA nodes\&. Takes a list of memory NUMA nodes indices or ranges separated by either whitespace or commas\&. Memory NUMA nodes ranges are specified by the lower and upper NUMA nodes indices separated by a dash\&.
de: Beschränkt die Ausführung von Prozessen auf bestimmte Speicher-NUMA-Knoten\&. Akzeptiert eine Liste von Speicher-NUMA-Knoten oder -Bereichen, getrennt durch Leerraum oder Kommata\&. Speicher-NUMA-Knotenbereiche werden durch den unteren und oberen NUMA-Knotenindex, getrennt durch einen Bindestrich, angegeben\&.

source: Setting I<AllowedMemoryNodes=> or I<StartupAllowedMemoryNodes=> doesn\*(Aqt guarantee that all of the memory NUMA nodes will be used by the processes as it may be limited by parent units\&. The effective configuration is reported as I<EffectiveMemoryNodes=>\&.
de: Setzen von I<AllowedMemoryNodes> oder I<StartupAllowedMemoryNodes=> garantiert nicht, dass sämtliche Speicher-NUMA-Knoten von den Prozessen verwandt werden, da es durch Eltern-Units eingeschränkt sein könnte\&. Die wirksame Konfiguration wird durch I<EffectiveMemoryNodes=> berichtet\&.

source: While I<StartupAllowedMemoryNodes=> applies to the startup and shutdown phases of the system, I<AllowedMemoryNodes=> applies to normal runtime of the system, and if the former is not set also to the startup and shutdown phases\&. Using I<StartupAllowedMemoryNodes=> allows prioritizing specific services at boot-up and shutdown differently than during normal runtime\&.
de: Während I<StartupAllowedMemoryNodes=> für die Hoch- und Runterfahrphasen des Systems gilt, gilt I<AllowedMemoryNodes=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hoch- und Runterfahrphasen\&. Durch Verwendung von I<StartupAllowedMemoryNodes=> ist eine abweichende Priorisierung bestimmter Dienste während des Hoch- und Runterfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: Turn on process and kernel memory accounting for this unit\&. Takes a boolean argument\&. Note that turning on memory accounting for one unit will also implicitly turn it on for all units contained in the same slice and for all its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultMemoryAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet Prozess- und Kernelspeicherbuchführung für diese Unit ein\&. Akzeptiert ein logisches Argument\&. Beachten Sie, dass das Einschalten der Speicherbuchführung in einer Unit implizit die Buchführung für alle Units in der gleichen Scheibe und für alle ihre Eltern-Scheiben und die darin enthaltenen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann mit I<DefaultMemoryAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: I<MemoryMin=>I<bytes>, I<MemoryLow=>I<bytes>
de: I<MemoryMin=>I<Byte>, I<MemoryLow=>I<Byte>

source: Specify the memory usage protection of the executed processes in this unit\&. When reclaiming memory, the unit is treated as if it was using less memory resulting in memory to be preferentially reclaimed from unprotected units\&. Using I<MemoryLow=> results in a weaker protection where memory may still be reclaimed to avoid invoking the OOM killer in case there is no other reclaimable memory\&.
de: Legt den Speicherverwendungsschutz für die ausgeführten Prozesse in dieser Unit fest\&. Wenn Speicher zurückgewonnen wird, dann wird diese Unit so behandelt, als ob sie weniger Speicher verwenden würde, was dazu führt, dass Speicher bevorzugt von nicht geschützten Units zurückgewonnen wird\&. Die Verwendung von I<MemoryLow=> führt zu einem schwächeren Schutz, bei dem Speicher weiterhin zurückgewonnen werden kann, um den Aufruf des OOM-Killers zu vermeiden, falls es keinen anderen zurückgewinnbaren Speicher gibt\&.

source: For a protection to be effective, it is generally required to set a corresponding allocation on all ancestors, which is then distributed between children (with the exception of the root slice)\&. Any I<MemoryMin=> or I<MemoryLow=> allocation that is not explicitly distributed to specific children is used to create a shared protection for all children\&. As this is a shared protection, the children will freely compete for the memory\&.
de: Damit ein Schutz wirksam wird, ist es im Allgemeinen notwendig, die entsprechende Zuweisung für alle Vorfahren zu setzen, die dann zwischen den Kindern verteilt wird (mit der Ausnahme der Wurzel-Scheibe)\&. Jede Zuweisung I<MemoryMin=> oder I<MemoryLow=>, die nicht explizit zu den festgelegten Kindern verteilt wird, wird für einen gemeinsamen Schutz für alle Kinder verwandt\&. Da dies ein gemeinsamer Schutz ist, konkurrieren die Kinder frei um den Speicher\&.

source: Takes a memory size in bytes\&. If the value is suffixed with K, M, G or T, the specified memory size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. Alternatively, a percentage value may be specified, which is taken relative to the installed physical memory on the system\&. If assigned the special value "infinity", all available memory is protected, which may be useful in order to always inherit all of the protection afforded by ancestors\&. This controls the "memory\&.min" or "memory\&.low" control group attribute\&. For details about this control group attribute, see \m[blue]B<Memory Interface Files>\m[]\&\s-2\u[6]\d\s+2\&.
de: Akzeptiert eine Speichergröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die angegebene Speichergröße in Kilobyte, Megabyte, Gigabyte bzw\&. Terabyte (zur Basis 1024) ausgewertet\&. Alternativ kann ein Prozentwert festgelegt werden, der relativ zum installierten physischen Speicher im System ist\&. Falls der besondere Wert »infinity« zugewiesen wird, wird sämtlicher Speicher geschützt\&. Dies kann nützlich sein, um immer sämtlichen, bei den Vorgängern aufgewandten Schutz zu erben\&. Dies steuert das Control-Gruppen-Attribut »memory\&.min« oder »memory\&.low«\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<Speicherschnittstellen-Dateien>\m[]\&\s-2\u[6]\d\s+2\&.
