Repository: sebras/manpages-l10n
Catalog: po/*/man5/systemd.service.5.po
Languages: uk

source: Configures the watchdog timeout for a service\&. The watchdog is activated when the start-up is completed\&. The service must call B<sd_notify>(3) regularly with "WATCHDOG=1" (i\&.e\&. the "keep-alive ping")\&. If the time between two such calls is larger than the configured time, then the service is placed in a failed state and it will be terminated with B<SIGABRT> (or the signal specified by I<WatchdogSignal=>)\&. By setting I<Restart=> to B<on-failure>, B<on-watchdog>, B<on-abnormal> or B<always>, the service will be automatically restarted\&. The time configured here will be passed to the executed service process in the I<WATCHDOG_USEC=> environment variable\&. This allows daemons to automatically enable the keep-alive pinging logic if watchdog support is enabled for the service\&. If this option is used, I<NotifyAccess=> (see below) should be set to open access to the notification socket provided by systemd\&. If I<NotifyAccess=> is not set, it will be implicitly set to B<main>\&. Defaults to 0, which disables this feature\&. The service can check whether the service manager expects watchdog keep-alive notifications\&. See B<sd_watchdog_enabled>(3) for details\&. B<sd_event_set_watchdog>(3) may be used to enable automatic watchdog notification support\&.
uk: Налаштовує час очікування засобу нагляду для служби\&. Засіб нагляду буде активовано після завершення процедури запуску\&. Служба має регулярно викликати B<sd_notify>(3) із «WATCHDOG=1» (тобто здійснювати «зондування підтримання зв'язку»)\&. Якщо час між двома такими викликами перевищить налаштований час, службу буде переведено у режим помилки і перервано сигналом B<SIGABRT> (або сигналом, який задано параметром I<WatchdogSignal=>)\&. Якщо для I<Restart=> встановлено значення B<on-failure>, B<on-watchdog>, B<on-abnormal> або B<always>, службу буде автоматично перезапущено\&. Час, який буде налаштовано тут, буде передано до виконуваного процесу служби у змінній середовища I<WATCHDOG_USEC=>\&. Це надає змогу фоновим службам автоматично вмикати механізм зондування підтримання зв'язку, якщо для служби увімкнено підтримку засобу нагляду\&. Якщо використано цей параметр, має бути встановлено I<NotifyAccess=> (див. нижче), щоб відкрити доступ до сокета сповіщення, який надано systemd\&. Якщо I<NotifyAccess=> не встановлено, його буде неявним чином встановлено у значення B<main>\&. Типовим значенням є 0, значення, яке вимикає цю можливість\&. Служба може перевіряти, чи засіб керування службами очікує на сповіщення щодо підтримання зв'язку від засобу нагляду\&. Див. B<sd_watchdog_enabled>(3), щоб дізнатися більше\&. Може бути використано B<sd_event_set_watchdog>(3) для вмикання підтримки автоматичного сповіщення від засобу нагляду\&.

source: Configures whether the service shall be restarted when the service process exits, is killed, or a timeout is reached\&. The service process may be the main service process, but it may also be one of the processes specified with I<ExecStartPre=>, I<ExecStartPost=>, I<ExecStop=>, I<ExecStopPost=>, or I<ExecReload=>\&. When the death of the process is a result of systemd operation (e\&.g\&. service stop or restart), the service will not be restarted\&. Timeouts include missing the watchdog "keep-alive ping" deadline and a service start, reload, and stop operation timeouts\&.
uk: Налаштовує, чи має бути перезапущено службу, коли процес служби завершує роботу, його роботу завершують або буде досягнуто перевищення часу очікування\&. Процес служби може бути основним процесом служби, але він також може бути одним з процесів, який вказано за допомогою I<ExecStartPre=>, I<ExecStartPost=>, I<ExecStop=>, I<ExecStopPost=> або I<ExecReload=>\&. Якщо завершення роботи процесу є результатом роботи systemd (наприклад, зупинення або перезапуск служби), службу не буде перезапущено\&. До часів очікування включають пропущений строк дії «зондування підтримання зв'язку» засобу нагляду і запуску служби, часи очікування перезавантаження і дії із зупинення\&.

source: Takes one of B<no>, B<on-success>, B<on-failure>, B<on-abnormal>, B<on-watchdog>, B<on-abort>, or B<always>\&. If set to B<no> (the default), the service will not be restarted\&. If set to B<on-success>, it will be restarted only when the service process exits cleanly\&. In this context, a clean exit means any of the following:
uk: Приймає одне зі значень B<no>, B<on-success>, B<on-failure>, B<on-abnormal>, B<on-watchdog>, B<on-abort> або B<always>\&. Якщо встановлено значення B<no> (типове значення), службу не буде перезапущено\&. Якщо встановлено значення B<on-success>, перезапуск буде виконано, лише якщо вихід з процедури служби буде виконано штатно\&. У цьому контексті штатний вихід означає будь-який з вказаних нижче варіантів:

source: exit code of 0;
uk: код виходу 0;

source: for types other than I<Type=oneshot>, one of the signals B<SIGHUP>, B<SIGINT>, B<SIGTERM>, or B<SIGPIPE>;
uk: для типів, відмінних від I<Type=oneshot> один із сигналів B<SIGHUP>, B<SIGINT>, B<SIGTERM> або B<SIGPIPE>;

source: exit statuses and signals specified in I<SuccessExitStatus=>\&.
uk: стани виходу та сигнали, які вказано у I<SuccessExitStatus=>\&.

source: If set to B<on-failure>, the service will be restarted when the process exits with a non-zero exit code, is terminated by a signal (including on core dump, but excluding the aforementioned four signals), when an operation (such as service reload) times out, and when the configured watchdog timeout is triggered\&. If set to B<on-abnormal>, the service will be restarted when the process is terminated by a signal (including on core dump, excluding the aforementioned four signals), when an operation times out, or when the watchdog timeout is triggered\&. If set to B<on-abort>, the service will be restarted only if the service process exits due to an uncaught signal not specified as a clean exit status\&. If set to B<on-watchdog>, the service will be restarted only if the watchdog timeout for the service expires\&. If set to B<always>, the service will be restarted regardless of whether it exited cleanly or not, got terminated abnormally by a signal, or hit a timeout\&.
uk: Якщо встановлено значення B<on-failure>, службу буде перезапущено, коли процес завершує роботу із ненульовим кодом виходу, буде перервано сигналом (включно із дампом ядра, але без згаданих вище чотирьох сигналів),коли буде перевищено час очікування на завершення дії (зокрема перезавантаження служби), і якщо буде активовано налаштований час очікування для засобу нагляду\&. Якщо встановлено значення B<on-abnormal>, службу буде перезапущено, якщо процес буде перервано сигналом (включно із дампом ядра, але виключно для згаданих вище чотирьох сигналів), коли буде перевищено час очікування на завершення дії або коли буде активовано час очікування для засобу нагляду\&. Якщо встановлено значення B<on-abort>, службу буде перезапущено, лише якщо процес служи завершить роботу через неперехоплений сигнал, який не вказано як стан штатного завершення роботи\&. Якщо встановлено значення B<on-watchdog>, службу буде перезапущено, лише якщо буде перевищено час очікування на службу для засобу нагляду\&. Якщо встановлено значення B<always>, службу буде перезапущено, незалежно від того, чи було її завершено штатно, перервано у нештатному режимі сигналом або завершено унаслідок перевищення часу очікування\&.

source: B<Table\ \&2.\ \&Exit causes and the effect of the >I<Restart=> settings
uk: B<Таблиця\ \&2.\ \&Причини виходу та результат дії параметрів >I<Restart=>

source: Restart settings/Exit causes
uk: Параметри перезапуску/Причини виходу

source: Clean exit code or signal
uk: Безпроблемний код виходу або сигнал

source: Unclean exit code
uk: Проблемний код виходу

source: Unclean signal
uk: Проблемний сигнал

source: Timeout
uk: Час очікування

source: Watchdog
uk: Засіб нагляду

source: As exceptions to the setting above, the service will not be restarted if the exit code or signal is specified in I<RestartPreventExitStatus=> (see below) or the service is stopped with B<systemctl stop> or an equivalent operation\&. Also, the services will always be restarted if the exit code or signal is specified in I<RestartForceExitStatus=> (see below)\&.
uk: Як виключення наведеного вище параметра, службу буде перезапущено, якщо код виходу або сигнал буде вказано у I<RestartPreventExitStatus=> (див. нижче) або службу буде зупинено за допомогою B<systemctl stop> або еквівалентної дії\&. Також служби буде завжди перезапущено, якщо код виходу або сигнал буде вказано у I<RestartForceExitStatus=> (див. нижче)\&.

source: Note that service restart is subject to unit start rate limiting configured with I<StartLimitIntervalSec=> and I<StartLimitBurst=>, see B<systemd.unit>(5) for details\&. A restarted service enters the failed state only after the start limits are reached\&.
uk: Зауважте, перезапуск служби підлягатиме обмеженню на частоту запуску модуля, яку налаштовано за допомогою I<StartLimitIntervalSec=> і I<StartLimitBurst=>, див. B<systemd.unit>(5), щоб дізнатися більше\&. Перезапущена служба увійде до стану помилки лише після того, як буде досягнуто обмежень щодо запуску\&.

source: Setting this to B<on-failure> is the recommended choice for long-running services, in order to increase reliability by attempting automatic recovery from errors\&. For services that shall be able to terminate on their own choice (and avoid immediate restarting), B<on-abnormal> is an alternative choice\&.
uk: Встановлення для цього параметра значення B<on-failure> є рекомендованим варіантом для довготривалих служб, призначеним для підвищення надійності роботи шляхом спроб автоматично відновлення після помилок\&. Для служб, які повинні мати можливість переривати свою роботу самостійно (і уникати негайного перезапуску) альтернативним варіантом є B<on-abnormal>\&.

source: Takes a list of exit status definitions that, when returned by the main service process, will be considered successful termination, in addition to the normal successful exit status 0 and, except for I<Type=oneshot>, the signals B<SIGHUP>, B<SIGINT>, B<SIGTERM>, and B<SIGPIPE>\&. Exit status definitions can be numeric termination statuses, termination status names, or termination signal names, separated by spaces\&. See the Process Exit Codes section in B<systemd.exec>(5) for a list of termination status names (for this setting only the part without the "EXIT_" or "EX_" prefix should be used)\&. See B<signal>(7) for a list of signal names\&.
uk: Приймає список визначень станів виходу, які, якщо їх повернуто основним процесом служби, вважатимуться успішним завершенням роботи, окрім звичайних успішних станів виходу 0 і окрім I<Type=oneshot>, сигналів B<SIGHUP>, B<SIGINT>, B<SIGTERM> і B<SIGPIPE>\&. Визначеннями станів виходу можуть бути числові стани переривання, назви станів переривання або назви сигналів переривання, відокремлені пробілами\&. Див. розділ «Коди виходу з процесів» («Process Exit Codes») на сторінці підручника B<systemd.exec>(5), щоб ознайомитися зі списком назв станів переривання (для цього параметра знадобиться лише частина без префіксів «EXIT_» або «EX_»)\&. Див. B<signal>(7), щоб ознайомитися зі списком назв сигналів\&.

source: Note that this setting does not change the mapping between numeric exit statuses and their names, i\&.e\&. regardless how this setting is used 0 will still be mapped to "SUCCESS" (and thus typically shown as "0/SUCCESS" in tool outputs) and 1 to "FAILURE" (and thus typically shown as "1/FAILURE"), and so on\&. It only controls what happens as effect of these exit statuses, and how it propagates to the state of the service as a whole\&.
uk: Зауважте, що цей параметр не змінює зв'язку між числовими станами виходу та їхніми назвами, тобто, незалежно від того, чи використано цей параметр, 0 все одно буде пов'язано із «SUCCESS» (а отже, типово показано як «0/SUCCESS» у виведенні інструментів) і 1 буде пов'язано із «FAILURE» (а отже, типово показаний як «1/FAILURE») тощо\&. Параметр керує лише тим, що трапиться у результаті отримання цих станів виходу, і як ці коди буде поширено до стану служби цілком\&.

source: This option may appear more than once, in which case the list of successful exit statuses is merged\&. If the empty string is assigned to this option, the list is reset, all prior assignments of this option will have no effect\&.
uk: Цей параметр можна вказувати декілька разів, у випадку чого список успішних станів виходу буде об'єднано\&. Якщо для цього параметра буде встановлено значення порожнього рядка, буде відновлено початкове значення списку — усі попередні значення для цього параметра буде відкинуто\&.

source: B<Example\ \&1.\ \&A service with the >I<SuccessExitStatus=> setting
uk: B<Приклад\ \&1.\ \&Служба із параметром >I<SuccessExitStatus=>

source: Exit status 75 (B<TEMPFAIL>), 250, and the termination signal B<SIGKILL> are considered clean service terminations\&.
uk: Стан виходу 75 (B<TEMPFAIL>), 250 та сигнал переривання B<SIGKILL> вважатимуться штатними перериваннями роботи служби\&.

source: Note: B<systemd-analyze exit-status> may be used to list exit statuses and translate between numerical status values and names\&.
uk: Зауваження: для отримання списку станів виходу і трансляції між числовими значеннями стану та назвами можна скористатися B<systemd-analyze exit-status>\&.

source: Takes a list of exit status definitions that, when returned by the main service process, will prevent automatic service restarts, regardless of the restart setting configured with I<Restart=>\&. Exit status definitions can either be numeric exit codes or termination signal names, and are separated by spaces\&. Defaults to the empty list, so that, by default, no exit status is excluded from the configured restart logic\&. For example:
uk: Приймає список визначень станів виходу, які, якщо їх повернуто основним процесом служби, запобігатимуть автоматичному перезапуску служби, незалежно від параметра перезапуску, налаштованого за допомогою I<Restart=>\&. Визначення станів виходу може бути числовими кодами виходу або назвами сигналів переривання\&. Записи слід відокремлювати пробілами\&. Типовим є порожній список, тому, типово, із налаштованого механізму перезапуску не буде виключено жодного стану виходу\&. Приклад:

source: ensures that exit codes 1 and 6 and the termination signal B<SIGABRT> will not result in automatic service restarting\&. This option may appear more than once, in which case the list of restart-preventing statuses is merged\&. If the empty string is assigned to this option, the list is reset and all prior assignments of this option will have no effect\&.
uk: призводить до того, що коди виходу 1 і 6 та сигнал переривання B<SIGABRT> не призведуть до автоматичного перезавантаження служби\&. Цей параметр можна вказувати декілька разів — у цьому випадку списки станів запобігання перезапуску буде об'єднано\&. Якщо для цього параметра визначено порожній рядок, буде відновлено початкове значення списку, а усі попередні призначення для цього параметра буде відкинуто\&.

source: Note that this setting has no effect on processes configured via I<ExecStartPre=>, I<ExecStartPost=>, I<ExecStop=>, I<ExecStopPost=> or I<ExecReload=>, but only on the main service process, i\&.e\&. either the one invoked by I<ExecStart=> or (depending on I<Type=>, I<PIDFile=>, \&...) the otherwise configured main process\&.
uk: Зауважте, що цей параметр не впливає на процеси, які налаштовано за допомогою I<ExecStartPre=>, I<ExecStartPost=>, I<ExecStop=>, I<ExecStopPost=> або I<ExecReload=>, але лише для основного процесу служби, тобто процесу, який викликано за допомогою I<ExecStart=> або (залежно від I<Type=>, I<PIDFile=>, \&...) якимось іншим налаштованим основним процесом\&.

source: Takes a list of exit status definitions that, when returned by the main service process, will force automatic service restarts, regardless of the restart setting configured with I<Restart=>\&. The argument format is similar to I<RestartPreventExitStatus=>\&.
uk: Приймає список визначень станів виходу, які якщо їх повернуто основних процесом служби, накаже системі автоматично перезапускати службу, незалежно від налаштованого за допомогою I<Restart=> параметра перезапуску\&. Формат аргументу є подібним до формату I<RestartPreventExitStatus=>\&.

source: Takes a boolean argument\&. If true, the root directory, as configured with the I<RootDirectory=> option (see B<systemd.exec>(5) for more information), is only applied to the process started with I<ExecStart=>, and not to the various other I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=>, and I<ExecStopPost=> commands\&. If false, the setting is applied to all configured commands the same way\&. Defaults to false\&.
uk: Приймає булевий аргумент\&. Якщо істина (true), кореневий каталог, як його налаштовано за допомогою параметра I<RootDirectory=> (див. B<systemd.exec>(5), щоб дізнатися більше), буде застосовано лише до процесу, який запущено за допомогою I<ExecStart=>, і не до різноманітних інших команд I<ExecStartPre=>, I<ExecStartPost=>, I<ExecReload=>, I<ExecStop=> і I<ExecStopPost=>\&. Якщо хибність (false), параметр буде застосовано до усіх налаштованих команд у однаковий спосіб\&. Типовим є значення false\&.

source: Set the B<O_NONBLOCK> flag for all file descriptors passed via socket-based activation\&. If true, all file descriptors E<gt>= 3 (i\&.e\&. all except stdin, stdout, stderr), excluding those passed in via the file descriptor storage logic (see I<FileDescriptorStoreMax=> for details), will have the B<O_NONBLOCK> flag set and hence are in non-blocking mode\&. This option is only useful in conjunction with a socket unit, as described in B<systemd.socket>(5) and has no effect on file descriptors which were previously saved in the file-descriptor store for example\&. Defaults to false\&.
uk: Встановити прапорець B<O_NONBLOCK> для усіх дескрипторів файлів, які передано за допомогою активації на основі сокетів\&. Якщо істина (true), усі дескриптори файлів E<gt>= 3 (тобто дескриптори, окрім stdin, stdout, stderr), окрім тих, які передано за допомогою механізму сховища дескрипторів (див. I<FileDescriptorStoreMax=>, щоб дізнатися більше), матимуть встановлений прапорець B<O_NONBLOCK>, і отже, перебувають у незаблокованому режимі\&. Цей параметр буде корисним лише у поєднанні із модулем сокета, як це описано у B<systemd.socket>(5), і не впливає на дескриптори файлів, які, наприклад, було раніше збережено у сховищі дескрипторів файлів\&. Типовим є значення false\&.

source: Controls access to the service status notification socket, as accessible via the B<sd_notify>(3) call\&. Takes one of B<none> (the default), B<main>, B<exec> or B<all>\&. If B<none>, no daemon status updates are accepted from the service processes, all status update messages are ignored\&. If B<main>, only service updates sent from the main process of the service are accepted\&. If B<exec>, only service updates sent from any of the main or control processes originating from one of the I<Exec*=> commands are accepted\&. If B<all>, all services updates from all members of the service\*(Aqs control group are accepted\&. This option should be set to open access to the notification socket when using I<Type=notify> or I<WatchdogSec=> (see above)\&. If those options are used but I<NotifyAccess=> is not configured, it will be implicitly set to B<main>\&.
uk: Керує доступом до сокета сповіщень стану служби, який доступний через виклик B<sd_notify>(3)\&. Приймає одне з таких значень: B<none> (типовий варіант), B<main>, B<exec> або B<all>\&. Якщо вказано значення B<none>, від процесів служби не прийматимуться оновлення стану фонових служб, усі повідомлення про оновлення стану буде проігноровано\&. Якщо вказано значення B<main>, прийматимуться лише оновлення служб від основного процесу служби\&. Якщо вказано значення B<exec>, буде прийнято лише оновлення служб, які надіслано будь-якими основними або керівними процесами, які походять від однієї з команд I<Exec*=>\&. Якщо вказано значення B<all>, буде прийнято усі оновлення служб від усіх учасників групи керування служби\&. Значення цього параметра слід вказувати, щоб зробити відкритим доступ до сокета сповіщень при використанні I<Type=notify> або I<WatchdogSec=> (див. вище)\&. Якщо використано ці параметри, але не налаштовано I<NotifyAccess=>, для цього параметра буде неявним чином встановлено значення B<main>\&.

source: Note that B<sd_notify()> notifications may be attributed to units correctly only if either the sending process is still around at the time PID 1 processes the message, or if the sending process is explicitly runtime-tracked by the service manager\&. The latter is the case if the service manager originally forked off the process, i\&.e\&. on all processes that match B<main> or B<exec>\&. Conversely, if an auxiliary process of the unit sends an B<sd_notify()> message and immediately exits, the service manager might not be able to properly attribute the message to the unit, and thus will ignore it, even if I<NotifyAccess=>B<all> is set for it\&.
uk: Зауважте, що сповіщення B<sd_notify()> може бути належним чином пов'язано із модулями, лише якщо або процес, що їх надіслав, усе ще працює на момент, коли PID 1 обробляє повідомлення, або якщо за процесом, що їх надіслав, явним чином стежить у режимі виконання засіб керування службами\&. Другий випадок трапляється, якщо засіб керування службами спочатку відгалужує процес, тобто для усіх процесів, які відповідають B<main> або B<exec>\&. Навпаки, якщо допоміжний процес модуля надсилає повідомлення B<sd_notify()> і негайно завершує роботу, засіб керування службами може не змогти належним чином пов'язати повідомлення із модулем, а отже, проігнорує його, навіть якщо для нього встановлено I<NotifyAccess=>B<all>\&.

source: Hence, to eliminate all race conditions involving lookup of the client\*(Aqs unit and attribution of notifications to units correctly, B<sd_notify_barrier()> may be used\&. This call acts as a synchronization point and ensures all notifications sent before this call have been picked up by the service manager when it returns successfully\&. Use of B<sd_notify_barrier()> is needed for clients which are not invoked by the service manager, otherwise this synchronization mechanism is unnecessary for attribution of notifications to the unit\&.
uk: Отже, щоб усунути конкурентність у пошуку модуля клієнта та належної прив'язки сповіщень до модулів, можна скористатися B<sd_notify_barrier()>\&. Цей виклик працює як точка синхронізації і забезпечує надсилання усіх сповіщень до отримання результатів цього виклику засобом керування службами при успішному поверненні керування\&. Користуватися B<sd_notify_barrier()> слід для клієнтів, які не викликано засобом керування службами, інакше цей механізм синхронізації стане непотрібним для прив'язування сповіщень до модуля\&.

source: Specifies the name of the socket units this service shall inherit socket file descriptors from when the service is started\&. Normally, it should not be necessary to use this setting, as all socket file descriptors whose unit shares the same name as the service (subject to the different unit name suffix of course) are passed to the spawned process\&.
uk: Вказує назву модулів сокета цієї служби, від якої буде успадковано дескриптори файлів сокетів при запуску служби\&. Зазвичай, потреби у використанні цього параметра немає, оскільки усі дескриптори файлів сокетів, чий модуль має таку саму назву, як і служба (за винятком, звичайно ж, іншого суфікса назви модуля), буде передано породженому процесу\&.
