Repository: sebras/manpages-l10n
Catalog: po/*/man5/termcap.5.po
Languages: de, es

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: termcap - terminal capability database
de: termcap - Datenbank für Terminalfähigkeiten
es: termcap - base de datos con características de terminales

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: The termcap database is an obsolete facility for describing the capabilities of character-cell terminals and printers. It is retained only for compatibility with old programs; new programs should use the B<terminfo>(5) database and associated libraries.
de: Die Termcap-Datenbank ist eine veraltete Einrichtung zur Beschreibung der Fähigkeiten zeichenorientierter Terminals und Drucker. Sie wird nur noch für die Kompatibilität mit alten Programmen beibehalten, neue Programme sollten B<terminfo>(5) und die zugehörigen Bibliotheken verwenden.
es: La base de datos termcap es una utilidad -ya obsoleta- para describir las capacidades de impresoras y terminales matriciales. Se conserva para poder conservar la compatibilidad con antiguos programas; las aplicaciones más recientes deberían emplear la base de datos B<terminfo>(5) y las bibliotecas asociadas.

source: I</etc/termcap> is an ASCII file (the database master) that lists the capabilities of many different types of terminals. Programs can read termcap to find the particular escape codes needed to control the visual attributes of the terminal actually in use. (Other aspects of the terminal are handled by B<stty>(1).) The termcap database is indexed on the B<TERM> environment variable.
de: Die ASCII-Datei I</etc/termcap>, der »Database Master«, enthält eine Beschreibung der Fähigkeiten vieler verschiedener Terminaltypen. Programme können hier die Steuersequenzen nachlesen, mit denen die visuelle Darstellung des verwendeten Terminals gesteuert wird. (Weitere Terminalaspekte werden von B<stty>(1) behandelt.) Die Umgebungsvariable B<TERM> dient als Index in der Termcap-Datenbank.
es: I</etc/termcap> es un fichero ASCII que contiene las características de multitud de tipos de terminales. Los programas pueden leer termcap para encontrar los códigos de escape particulares que se necesitan para controlar los atributos visuales del terminal en uso (otros aspectos del terminal son controlados a través de B<stty>(1)). La base de datos termcap se indiza a partir de la variable de entorno B<TERM>.

source: Termcap entries must be defined on a single logical line, with \(aq\e\(aq used to suppress the newline. Fields are separated by \(aq:\(aq. The first field of each entry starts at the left-hand margin, and contains a list of names for the terminal, separated by \(aq|\(aq.
de: Einträge in Termcap dürfen nur aus einer einzigen logischen Zeile bestehen, mit \(aq\e\(aq werden Zeilenumbrüche unterdrückt. Die Felder eines Eintrags werden durch \(aq:\(aq getrennt. Das erste Feld jedes Eintrags beginnt am linken Rand und enthält eine Liste mit Namen für das Terminal, die ihrerseits durch \(aq|\(aq (das Pipe-Symbol) getrennt sind.
es: Las entradas en termcap se deben definir en una sola línea lógica, usando \(aq\e\(aq para suprimir el carácter de nueva línea. Los campos están separados por \(aq:\(aq. El primer campo de cada entrada comienza en el margen izquiero y contiene una lista de nombres de terminal separados por \(aq|\(aq.

source: The first subfield may (in BSD termcap entries from versions 4.3 and earlier) contain a short name consisting of two characters. This short name may consist of capital or small letters. In 4.4BSD, termcap entries this field is omitted.
de: Das erste Unterfeld kann (in BSD-Termcap-Einträgen bis Version 4.3) einen kurzen Namen aus zwei Zeichen enthalten. Die beiden Zeichen dürfen Klein- oder Großbuchstaben sein. In 4.4BSD-Termcap-Einträgen gibt es dieses Feld nicht mehr.
es: En las entradas de termcap de BSD 4.3 y anteriores, el primer subcampo puede incluir un breve nombre de dos letras mayúsculas o minúsculas. A partir de la versión 4.4BSD ya no se incluye este campo.

source: The second subfield (first, in the newer 4.4BSD format) contains the name used by the environment variable B<TERM>. It should be spelled in lowercase letters. Selectable hardware capabilities should be marked by appending a hyphen and a suffix to this name. See below for an example. Usual suffixes are w (more than 80 characters wide), am (automatic margins), nam (no automatic margins), and rv (reverse video display). The third subfield contains a long and descriptive name for this termcap entry.
de: Das zweite Unterfeld (im neueren 4.4BSD-Format ist es das erste) enthält den Namen, den die Umgebungsvariable B<TERM> verwendet. Er sollte aus Kleinbuchstaben bestehen. Wählbare Fähigkeiten der Hardware sollten durch hinzufügen eines Bindestrichs und eines Suffixes zum Namen gekennzeichnet werden. Weiter unten gibt es ein Beispiel dafür. Übliche Suffixe sind w (wide, Zeilenlänge größer als 80 Zeichen), am (automatic margins, automatische Randbegrenzung), nam (no automatic margins, keine automatische Randbegrenzung) und rv (reverse video, Darstellung in dunkler Schrift auf hellem Hintergrund). Das dritte Unterfeld enthält einen langen und aussagekräftigen Namen für diesen Termcap-Eintrag.
es: El segundo subcampo contiene el nombre usado por la variable de entorno B<TERM>, generalmente en minúsculas. Algunas características seleccionables del hardware se denotan añadiendo un guión y un sufijo a este nombre (véase un ejemplo a continuación). Algunos sufijos comunes son w (más de 80 caracteres por línea), am (márgenes automáticos), nam (sin márgenes automáticos) y rv (visualización en vídeo inverso). El tercer subcampo contiene un nombre largo y descriptivo para la entrada de la base de datos.

source: Subsequent fields contain the terminal capabilities; any continued capability lines must be indented one tab from the left margin.
de: Die folgenden Felder enthalten die Fähigkeiten, die das Terminal bietet. Fortsetzungszeilen müssen mit einem Tabulator-Zeichen vom linken Rand aus eingerückt werden.
es: Los campos siguientes contienen las características del terminal; cualquier línea siguiente de características se debe añadir un margen mediante un tabulador desde el margen izquierdo.

source: Although there is no defined order, it is suggested to write first boolean, then numeric, and then string capabilities, each sorted alphabetically without looking at lower or upper spelling. Capabilities of similar functions can be written in one line.
de: Obwohl es keine vorgeschriebene Reihenfolge gibt, sieht die Konvention Folgendes vor: Erst die booleschen, dann die numerischen und dann die Zeichenketten-Fähigkeiten, jede Gruppe in sich alphabetisch ohne Rücksicht auf Klein-/Großschreibung sortiert. Fähigkeiten ähnlicher Funktionalität können in eine Zeile geschrieben werden.
es: Aunque no hay un orden establecido, se sugiere escribir primero las características booleanas, luego las numéricas y para finalizar las características de cadena, cada una de ellas ordenada alfabéticamente sin importar mayúsculas o minúsculas. Las características para funciones similares se pueden escribir en la misma línea.

source: Example for:
de: Beispiel für:
es: Ejemplo:

source: Head line: vt|vt101|DEC VT 101 terminal in 80 character mode:\e Head line: Vt|vt101-w|DEC VT 101 terminal in (wide) 132 character mode:\e Boolean: :bs:\e Numeric: :co#80:\e String: :sr=\eE[H:\e
de: Kopfzeile: vt|vt101|DEC VT 101 Terminal im 80-Zeichen-Modus:\e Kopfzeile: Vt|vt101-w|DEC VT 101 Terminal im Wide-Modus (132 Zeichen):\e Boolescher Wert: :bs:\e Numerischer Wert: :co#80:\e Zeichenkette: :sr=\eE[H:\e
es: Línea de cabecera: vt|vt101|Terminal DEC VT 101 en modo 80 carac.:\e Línea de cabecera: Vt|vt101-w|Terminal DEC VT 101 en modo 132 carac.:\e Booleano: :bs:\e Numérico: :co#80:\e Cadena de caracteres: :sr=\eE[H:\e

source: Boolean capabilities
de: Boolesche Fähigkeiten
es: Características Booleanas

source: 5i Printer will not echo on screen am Automatic margins which means automatic line wrap bs Control-H (8 dec.) performs a backspace bw Backspace on left margin wraps to previous line and right margin da Display retained above screen db Display retained below screen eo A space erases all characters at cursor position es Escape sequences and special characters work in status line gn Generic device hc This is a hardcopy terminal HC The cursor is hard to see when not on bottom line hs Has a status line hz Hazeltine bug, the terminal can not print tilde characters in Terminal inserts null bytes, not spaces, to fill whitespace km Terminal has a meta key mi Cursor movement works in insert mode ms Cursor movement works in standout/underline mode NP No pad character NR ti does not reverse te nx No padding, must use XON/XOFF os Terminal can overstrike ul Terminal underlines although it can not overstrike xb Beehive glitch, f1 sends ESCAPE, f2 sends B<\(haC> xn Newline/wraparound glitch xo Terminal uses xon/xoff protocol xs Text typed over standout text will be displayed in standout xt Teleray glitch, destructive tabs and odd standout mode
de: 5i Drucker macht keine Bildschirmausgaben am Automatic margins = Automatischer Zeilenumbruch bs Strg-H (8 dez.) führt Rückschritt (backspace) aus bw Rückschritt am linken Rand führt zum rechten Rand der Vorzeile da Anzeige oberhalb des sichtbaren Bereichs bleibt erhalten db Anzeige unterhalb des sichtbaren Bereichs bleibt erhalten eo Ein Leerzeichen löscht jedes Zeichen ab der Cursorposition es Steuersequenzen und spezielle Zeichen arbeiten in der Statuszeile gn Generisches Gerät hc Hardcopy-Terminal (Konsolen-Drucker) HC Cursor schwer erkennbar, wenn nicht in letzter Zeile hs Hat eine Statuszeile hz Hazeltine Bug, das Terminal kann keine Tilde darstellen in Terminal füllt Lücken mit NULL-Bytes, nicht mit Leerzeichen km Terminal hat eine Meta-Taste mi Cursor-Bewegung funktioniert im Einfügemodus ms Cursor-Bewegung funktioniert im Hervorhebungsmodus NP Kein Füllzeichen NR ti kehrt te nicht um nx Kein Auffüllen, XON/XOFF muss verwendet werden os Terminal beherrscht »Fettschrift« ul Terminal unterstreicht, kann aber keine »Fettschrift« xb Beehive glitch, F1 sendet ESCAPE, F2 sendet B<\(haC> xn Newline/wraparound glitch (kleiner Fehler bei Zeilenvorschub/-umbruch) xo Terminal benutzt xon/xoff-Protokoll xs Wenn hervorgehobener Text überschrieben wird, wird der ersetzende Text ebenfalls hervorgehoben xt Teleray glitch, zerstörerische Tabulatoren und merkwürdige Hervorhebungen
es: 5i La impresora no producirá eco en pantalla am Márgenes automáticos (ajuste automático de palabras en la línea) bs Control-H (8 en decimal) realiza un retroceso bw Retroceso en margen izquierdo vuelve a línea anterior, margen derecho da La visualización se guarda por encima de la pantalla db La visualización se guarda por debajo de la pantalla eo Un espacio borra cualquier carácter en la posición del cursor es Las secuencias de escape y los caracteres especiales funcionan en la línea de estado gn Dispositivo genérico hc Este es un terminal hardcopy (terminal que genera copia impresa) HC El cursor es difícil de ver cuando no está en la última línea hs Tiene línea de estado hz Error Hazeltine, el terminal no puede imprimir caracteres con tilde in El terminal inserta caracteres nulos, no espacios, para rellenar los espacios en blanco km El terminal tiene una metatecla mi El movimiento del cursor funciona en modo Inserción ms El movimiento del cursor funciona en modo Resaltado/Subrayado NP No hay carácter de relleno NR La secuencia 'ti' no deshace el efecto de 'te' nx No hay relleno, debe usarse el control de flujo XON/XOFF os El terminal puede mostrar texto en Negrita ul El terminal puede mostrar texto Subrayado pero no Negrita xb Error Beehive, F1 envía ESCAPE, F2 envía B<\(haC> xn Error de recorte al final de línea xo El terminal usa control de flujo XON/XOFF xs El texto tecleado sobre texto Resaltado aparecerá Resaltado xt Error Teleray, Tabuladores destructivos y modo Resaltado "raro"

source: Numeric capabilities
de: Numerische Fähigkeiten
es: Características numéricas

source: co Number of columns dB Delay in milliseconds for backspace on hardcopy terminals dC Delay in milliseconds for carriage return on hardcopy terminals dF Delay in milliseconds for form feed on hardcopy terminals dN Delay in milliseconds for new line on hardcopy terminals dT Delay in milliseconds for tabulator stop on hardcopy terminals dV Delay in milliseconds for vertical tabulator stop on hardcopy terminals it Difference between tab positions lh Height of soft labels lm Lines of memory lw Width of soft labels li Number of lines Nl Number of soft labels pb Lowest baud rate which needs padding sg Standout glitch ug Underline glitch vt virtual terminal number ws Width of status line if different from screen width
de: co Anzahl Spalten dB Verzögerung in Millisekunden (V.i.M) bei Backspace an Hardcopy-Terminals dC V.i.M. bei Wagenrücklauf an Hardcopy-Terminals dF V.i.M. bei Seitenvorschub an Hardcopy-Terminals dN V.i.M. bei Zeilenvorschub an Hardcopy-Terminals dT V.i.M. bei Tabulatorstopp an Hardcopy-Terminals dV V.i.M. bei vertikalem Tabulatorstopp an Hardcopy-Terminals it Abstand zwischen Tabulatorpositionen lh Höhe von »soft labels« lm Speicherzeilen (Lines of memory) lw Breite der »soft labels« li Zeilenanzahl Nl Anzahl der »soft labels« pb Niedrigste Baudrate, die Auffüllen benötigt sg »Standout glitch« ug Underline glitch vt Nummer eines virtuellen Terminals ws Breite der Statuszeile, falls abweichend von der Bildschirmbreite
es: co Número de columnas dB Retraso en milisegundos para un retroceso en terminales hardcopy dC Retraso en milisegundos para un retorno de carro en terminales hardcopy dF Retraso en milisegundos para un salto de página en terminales hardcopy dN Retraso en milisegundos para un salto de línea en terminales hardcopy dT Retraso en milisegundos para un tabulador en terminales hardcopy dV Retraso en milisegundos para un tabulador vertical en terminales hardcopy it Diferencia entre posiciones de tabulación lh Altura de las etiquetas software lm Líneas de memoria lw Anchura de las etiquetas software li Número de líneas Nl Número de etiquetas software pb Velocidad (en baudios) mínima que necesita relleno sg Variación (glitch) en el resaltado ug Variación (glitch) en el subrayado vt Número de terminal virtual ws Ancho de la línea de estado (cuando difiere del ancho de la pantalla)

source: String capabilities
de: Zeichenketten-Fähigkeiten
es: Características de cadena
