Repository: sebras/manpages-l10n
Catalog: po/*/man5/termcap.5.po
Languages: de, es

source: !1 shifted save key !2 shifted suspend key !3 shifted undo key #1 shifted help key #2 shifted home key #3 shifted input key #4 shifted cursor left key %0 redo key %1 help key %2 mark key %3 message key %4 move key %5 next-object key %6 open key %7 options key %8 previous-object key %9 print key %a shifted message key %b shifted move key %c shifted next key %d shifted options key %e shifted previous key %f shifted print key %g shifted redo key %h shifted replace key %i shifted cursor right key %j shifted resume key &0 shifted cancel key &1 reference key &2 refresh key &3 replace key &4 restart key &5 resume key &6 save key &7 suspend key &8 undo key &9 shifted begin key *0 shifted find key *1 shifted command key *2 shifted copy key *3 shifted create key *4 shifted delete character *5 shifted delete line *6 select key *7 shifted end key *8 shifted clear line key *9 shifted exit key @0 find key @1 begin key @2 cancel key @3 close key @4 command key @5 copy key @6 create key @7 end key @8 enter/send key @9 exit key al Insert one line AL Insert %1 lines ac Pairs of block graphic characters to map alternate character set ae End alternative character set as Start alternative character set for block graphic characters bc Backspace, if not B<\(haH> bl Audio bell bt Move to previous tab stop cb Clear from beginning of line to cursor cc Dummy command character cd Clear to end of screen ce Clear to end of line ch Move cursor horizontally only to column %1 cl Clear screen and cursor home cm Cursor move to row %1 and column %2 (on screen) CM Move cursor to row %1 and column %2 (in memory) cr Carriage return cs Scroll region from line %1 to %2 ct Clear tabs cv Move cursor vertically only to line %1 dc Delete one character DC Delete %1 characters dl Delete one line DL Delete %1 lines dm Begin delete mode do Cursor down one line DO Cursor down #1 lines ds Disable status line eA Enable alternate character set ec Erase %1 characters starting at cursor ed End delete mode ei End insert mode ff Formfeed character on hardcopy terminals fs Return character to its position before going to status line F1 The string sent by function key f11 F2 The string sent by function key f12 F3 The string sent by function key f13 \&... \&... F9 The string sent by function key f19 FA The string sent by function key f20 FB The string sent by function key f21 \&... \&... FZ The string sent by function key f45 Fa The string sent by function key f46 Fb The string sent by function key f47 \&... \&... Fr The string sent by function key f63 hd Move cursor a half line down ho Cursor home hu Move cursor a half line up i1 Initialization string 1 at login i3 Initialization string 3 at login is Initialization string 2 at login ic Insert one character IC Insert %1 characters if Initialization file im Begin insert mode ip Insert pad time and needed special characters after insert iP Initialization program K1 upper left key on keypad K2 center key on keypad K3 upper right key on keypad K4 bottom left key on keypad K5 bottom right key on keypad k0 Function key 0 k1 Function key 1 k2 Function key 2 k3 Function key 3 k4 Function key 4 k5 Function key 5 k6 Function key 6 k7 Function key 7 k8 Function key 8 k9 Function key 9 k; Function key 10 ka Clear all tabs key kA Insert line key kb Backspace key kB Back tab stop kC Clear screen key kd Cursor down key kD Key for delete character under cursor ke turn keypad off kE Key for clear to end of line kF Key for scrolling forward/down kh Cursor home key kH Cursor hown down key kI Insert character/Insert mode key kl Cursor left key kL Key for delete line kM Key for exit insert mode kN Key for next page kP Key for previous page kr Cursor right key kR Key for scrolling backward/up ks Turn keypad on kS Clear to end of screen key kt Clear this tab key kT Set tab here key ku Cursor up key l0 Label of zeroth function key, if not f0 l1 Label of first function key, if not f1 l2 Label of first function key, if not f2 \&... \&... la Label of tenth function key, if not f10 le Cursor left one character ll Move cursor to lower left corner LE Cursor left %1 characters LF Turn soft labels off LO Turn soft labels on mb Start blinking MC Clear soft margins md Start bold mode me End all mode like so, us, mb, md, and mr mh Start half bright mode mk Dark mode (Characters invisible) ML Set left soft margin mm Put terminal in meta mode mo Put terminal out of meta mode mp Turn on protected attribute mr Start reverse mode MR Set right soft margin nd Cursor right one character nw Carriage return command pc Padding character pf Turn printer off pk Program key %1 to send string %2 as if typed by user pl Program key %1 to execute string %2 in local mode pn Program soft label %1 to show string %2 po Turn the printer on pO Turn the printer on for %1 (E<lt>256) bytes ps Print screen contents on printer px Program key %1 to send string %2 to computer r1 Reset string 1 to set terminal to sane modes r2 Reset string 2 to set terminal to sane modes r3 Reset string 3 to set terminal to sane modes RA disable automatic margins rc Restore saved cursor position rf Reset string filename RF Request for input from terminal RI Cursor right %1 characters rp Repeat character %1 for %2 times rP Padding after character sent in replace mode rs Reset string RX Turn off XON/XOFF flow control sa Set %1 %2 %3 %4 %5 %6 %7 %8 %9 attributes SA enable automatic margins sc Save cursor position se End standout mode sf Normal scroll one line SF Normal scroll %1 lines so Start standout mode sr Reverse scroll SR scroll back %1 lines st Set tabulator stop in all rows at current column SX Turn on XON/XOFF flow control ta move to next hardware tab tc Read in terminal description from another entry te End program that uses cursor motion ti Begin program that uses cursor motion ts Move cursor to column %1 of status line uc Underline character under cursor and move cursor right ue End underlining up Cursor up one line UP Cursor up %1 lines us Start underlining vb Visible bell ve Normal cursor visible vi Cursor invisible vs Standout cursor wi Set window from line %1 to %2 and column %3 to %4 XF XOFF character if not B<\(haS>
de: !1 Umschalt-Speichern-Taste !2 Umschalt-Suspend-Taste (stoppen, nicht beenden) !3 Umschalt-Rückgängig-Taste #1 Umschalt-Hilfe-Taste #2 Umschalt-Cursor-nach-links-oben-Taste #3 Umschalt-Eingabe-Taste #4 Umschalt-Cursor links-Taste %0 Wiederholen-Taste %1 Hilfe-Taste %2 Markieren-Taste %3 Nachricht-Taste %4 Verschieben-Taste %5 Nächstes-Objekt-Taste %6 Öffnen-Taste %7 Optionen-Taste %8 Voriges-Objekt-Taste %9 Drucken-Taste %a Umschalt-Nachricht-Taste %b Umschalt-Verschieben-Taste %c Umschalt-Weiter-Taste %d Umschalt-Optionen-Taste %e Umschalt-Zurück-Taste %f Umschalt-Drucken-Taste %g Umschalt-Wiederholen-Taste %h Umschalt-Ersetzen-Taste %i Umschalt-Cursor rechts-Taste %j Umschalt-Weitermachen-Taste (siehe 'suspend', w.o.) &0 Umschalt-Abbrechen-Taste &1 Referenz-Taste &2 Auffrisch-Taste &3 Ersetzen-Taste &4 Neustart-Taste &5 Weitermachen-Taste &6 Speichern-Taste &7 suspend-Taste &8 Rückgängig-Taste &9 Umschalt-BeginnenTaste *0 Umschalt-Suchen-Taste *1 Umschalt-Befehl-Taste *2 Umschalt-Kopieren-Taste *3 Umschalt-Erzeugen-Taste *4 Umschalt-Löschzeichen *5 Umschalt-Zeile entfernen *6 Auswahl-Taste *7 Umschalt-Ende-Taste *8 Umschalt-Zeileninhalt löschen-Taste *9 Umschalt-exit-Taste @0 Suchen-Taste @1 Beginnen-Taste @2 Abbrechen-Taste @3 Schließen-Taste @4 Befehl-Taste @5 Kopieren-Taste @6 Erzeugen-Taste @7 Ende-Taste @8 Eingabe/Absenden-Taste @9 exit-Taste al eine Zeile einfügen AL %1 Zeilen einrücken ac Paare von Blockgrafik-Zeichen zur Ersetzung eines anderen Zeichensatzes ae Ende alternativer Zeichensatz as Start alternativer Zeichensatz für Blockgrafik-Zeichen bc Rückschritt, falls nicht B<\(haH> bl Audio bell (Piep!) bt Zurück zum vorigen Tabulator-Stopp cb Zeile von Anfang bis Cursor löschen cc Dummy-Befehlszeichen cd Löschen bis Bildschirmende ce Löschen bis Zeilenende ch Cursor waagerecht verschieben bis Spalte %1 cl Bildschirm löschen, Cursor nach links oben cm Cursor verschieben nach Zeile %1 und Spalte %2 (auf dem Bildschirm) CM Cursor verschieben nach Zeile %1 und Spalte %2 (im Speicher) cr Carriage return (Wagenrücklauf, Eingabezeichen, dez. 13) cs Scroll-Bereich von Zeile %1 bis %2 ct Tabulatoren löschen cv Cursor verschieben bis Zeile %1 dc ein Zeichen löschen DC %1 Zeichen löschen dl eine Zeile löschen DL %1 Zeilen löschen dm Anfang Lösch-Modus do Cursor eine Zeile nach unten DO Cursor #1 Zeilen nach unten ds Statuszeile deaktivieren eA alternativen Zeichensatz aktivieren ec vom Cursor aus %1 Zeichen löschen ed Ende Lösch-Modus ei Ende Einfüge-Modus ff Seitenvorschub-Zeichen bei Hardcopy-Terminals fs ? Return character to its position before going to status line ? F1 Zeichenkette für Funktionstaste f11 F2 Zeichenkette für Funktionstaste f12 F3 Zeichenkette für Funktionstaste f13 … … F9 Zeichenkette für Funktionstaste f19 FA Zeichenkette für Funktionstaste f20 FB Zeichenkette für Funktionstaste f21 … … FZ Zeichenkette für Funktionstaste f45 Fa Zeichenkette für Funktionstaste f46 Fb Zeichenkette für Funktionstaste f47 … … Fr Zeichenkette für Funktionstaste f63 hd Cursor eine halbe Zeile nach unten ho Cursor nach links oben hu Cursor eine halbe Zeile nach oben i1 Initialisierungs-Zeichenkette 1 beim Anmelden i3 Initialisierungs-Zeichenkette 3 beim Anmelden is Initialisierungs-Zeichenkette 2 beim Anmelden ic ein Zeichen einfügen IC %1 Zeichen einfügen if Initialisierungs-Datei im Anfang Einfüge-Modus ip ? Insert pad time and needed special characters after insert ? iP Initialisierungs-Programm K1 obere linke Taste auf dem Tastenblock K2 mittlere Taste auf dem Tastenblock K3 obere rechte Taste auf dem Tastenblock K4 untere linke Taste auf dem Tastenblock K5 untere rechte Taste auf dem Tastenblock k0 Funktionstaste 0 k1 Funktionstaste 1 k2 Funktionstaste 2 k3 Funktionstaste 3 k4 Funktionstaste 4 k5 Funktionstaste 5 k6 Funktionstaste 6 k7 Funktionstaste 7 k8 Funktionstaste 8 k9 Funktionstaste 9 k; Funktionstaste 10 ka Taste, die alle Tabulatoren löscht kA Zeile einfügen-Taste kb Backspace (Rückschritt)-Taste kB Einen Tabulator zurück kC Bildschirm löschen-Taste kd Cursor herunter-Taste kD Entfernen-Taste ke Tastenblock abschalten kE Taste zum Löschen bis Zeilenende kF Taste für vorwärts-/herunterscrollen kh »Cursor oben links«-Taste kH »Cursor hown down«-Taste kI Zeichen einfügen/Einfügemodus-Taste kl Cursor links-Taste kL Zeile löschen-Taste kM Einfügemodus-Beenden-Taste kN Taste für nächste Seite kP Taste für vorige Seite kr Cursor rechts-Taste kR Taste für scrolling zurück/hoch ks Tastenblock einschalten kS Löschen bis Bildschirmende-Taste kt Diesen Tabulator löschen-Taste kT Hier Tabulator setzen-Taste ku Cursor hoch-Taste l0 Bezeichnung für nullte Funktionstaste, falls nicht f0 l1 Bezeichnung für erste Funktionstaste, falls nicht f1 l2 Bezeichnung für zweite Funktionstaste, falls nicht f2 … … la Bezeichnung für zehnte Funktionstaste, falls nicht f10 le Cursor ein Zeichen nach links ll Cursor nach links unten LE Cursor %1 Zeichen nach links LF soft labels abschalten LO soft labels einschalten mb Anfang Blinkmodus MC soft margins löschen md Start Fettschrift me Ende aller Modi wie so, us, mb, md und mr mh Start half bright mode mk Dunkelmodus (Zeichen nicht sichtbar) ML Linken soft margin setzen mm Meta Modus einschalten mo Meta Modus abschalten mp Eigenschaft 'gesichert' einschalten (protected attribute) mr Anfang Invers Modus MR Rechten soft margin setzen nd Cursor ein Zeichen nach recht nw Carriage return Befehl pc Padding Zeichen pf Drucker ausschalten pk Taste %1 sendet Zeichenkette %2 als ob vom Benutzer eingegeben pl Taste %1 führt Zeichenkette %2 im 'local' Modus aus pn Program soft label %1 to to show string %2 po Drucker einschalten pO Drucker einschalten für %1 (E<lt>256) Bytes ps Bildschirminhalt auf Drucker ausgeben px Taste %1 sendet Zeichenkette %2 an den Computer r1 Reset Zeichenkette 1, um Terminal in Standardeinstellung zu bringen r2 Reset Zeichenkette 2, um Terminal in Standardeinstellung zu bringen r3 Reset Zeichenkette 3, um Terminal in Standardeinstellung zu bringen RA automatische Zeilenumbrüche abschalten rc gespeicherte Cursor Position wiederherstellen rf Reset string file name RF Request for input (Eingabeanforderung) vom Terminal RI Cursor %1 Zeichen nach rechts rp Zeichen %1 %2-mal wiederholen rP Padding after character sent in replace mode rs Reset Zeichenkette RX XON/XOFF abschalten sa Eigenschaften %1 %2 %3 %4 %5 %6 %7 %8 %9 setzen SA automatischen Zeilenumbruch einschalten sc Cursor Position speichern se Ende Hervorhebungsmodus (standout mode) sf Normales Scrollen eine Zeile SF Normales Scrollen %1 Zeilen so Anfang Hervorhebungsmodus (standout mode) sr Rückwärts Scrollen SR %1 Zeilen rückwärts Scrollen st Tabulator Stopp in allen Zeilen an derzeitiger Spaltenposition SX XON/XOFF einschalten ta zum nächsten Hardware Tabulator tc Terminal Beschreibung einem anderen Eintrag entnehmen te Beenden des Programmes, das Cursorbewegungen verwendet ti Anfang des Programmes, das Cursorbewegungen verwendet ts Cursor in Spalte %1 der Statuszeile uc Zeichen unter Cursor unterstreichen und Cursor 1 nach rechts ue Ende Unterstreichung up Cursor eine Zeile hoch UP Cursor %1 Zeilen hoch us Anfang Unterstreichung vb Bildschirmdarstellung von 'Piep!' (Visible bell) ve Normaler Cursor sichtbar vi Cursor unsichtbar vs Hervorgehobener Cursor wi Setze Fenster von Zeile %1 auf %2 und Spalte von %3 auf %4 XF XOFF-Zeichen falls nicht B<\(haS>
es: !1 MAYUS + tecla E<lt>salvarE<gt> !2 MAYUS + tecla E<lt>suspenderE<gt> !3 MAYUS + tecla E<lt>deshacerE<gt> #1 MAYUS + tecla E<lt>ayudaE<gt> #2 MAYUS + tecla E<lt>inicioE<gt> (home) #3 MAYUS + tecla E<lt>entradaE<gt> (input) #4 MAYUS + tecla E<lt>mover cursor a la izquierdaE<gt> %0 tecla E<lt>rehacerE<gt> %1 tecla E<lt>ayudaE<gt> %2 tecla E<lt>marcarE<gt> %3 tecla E<lt>mensajeE<gt> %4 tecla E<lt>moverE<gt> %5 tecla E<lt>objeto siguienteE<gt> %6 tecla E<lt>abrirE<gt> %7 tecla E<lt>opcionesE<gt> %8 tecla E<lt>objeto anteriorE<gt> %9 tecla E<lt>imprimirE<gt> %a MAYUS + tecla E<lt>mensajeE<gt> %b MAYUS + tecla E<lt>moverE<gt> %c MAYUS + tecla E<lt>siguienteE<gt> %d MAYUS + tecla E<lt>opcionesE<gt> %e MAYUS + tecla E<lt>anteriorE<gt> %f MAYUS + tecla E<lt>imprimirE<gt> %g MAYUS + tecla E<lt>rehacerE<gt> %h MAYUS + tecla E<lt>reemplazarE<gt> %i MAYUS + tecla E<lt>mover cursor a la derechaE<gt> %j MAYUS + tecla E<lt>reanudarE<gt> &0 MAYUS + tecla E<lt>cancelarE<gt> &1 tecla E<lt>referenciaE<gt> &2 tecla E<lt>refrescarE<gt> &3 tecla E<lt>reemplazarE<gt> &4 tecla E<lt>reiniciarE<gt> &5 tecla E<lt>reanudarE<gt> &6 tecla E<lt>salvarE<gt> &7 tecla E<lt>suspenderE<gt> &8 tecla E<lt>deshacerE<gt> &9 MAYUS + tecla E<lt>inicioE<gt> *0 MAYUS + tecla E<lt>encontrarE<gt> *1 MAYUS + tecla E<lt>ordenE<gt> *2 MAYUS + tecla E<lt>copiarE<gt> *3 MAYUS + tecla E<lt>crearE<gt> *4 MAYUS + E<lt>borrar carácterE<gt> *5 MAYUS + E<lt>borrar líneaE<gt> *6 tecla E<lt>seleccionarE<gt> *7 MAYUS + tecla E<lt>finE<gt> *8 MAYUS + tecla E<lt>borrar líneaE<gt> *9 MAYUS + tecla E<lt>salirE<gt> @0 tecla E<lt>encontrarE<gt> @1 tecla E<lt>inicioE<gt> @2 tecla E<lt>cancelarE<gt> @3 tecla E<lt>cerrarE<gt> @4 tecla E<lt>ordenE<gt> @5 tecla E<lt>copiarE<gt> @6 tecla E<lt>crearE<gt> @7 tecla E<lt>finE<gt> @8 tecla E<lt>introducir/enviarE<gt> @9 tecla E<lt>salirE<gt> al Insertar una línea AL Insertar %1 líneas ac Pares de caracteres gráficos de bloque para "mapear" el conjunto alternativo de caracteres ae Finalizar conjunto alternativo de caracteres as Iniciar conjunto alternativo de caracteres para caracteres gráficos de bloque bc Retroceso, si no es B<^H> bl Campana acústica bt Mover a la marca de tabulación previa cb Borrar desde el inicio de línea hasta la posición del cursor cc Carácter de orden falsa cd Limpiar hasta el final de la pantalla ce Limpiar hasta el final de la línea ch Mover el cursor sólo horizontalmente hasta la columna %1 cl Limpiar la pantalla y colocar el cursor en la posición original cm Mover el cursor a la fila %1 y la columna %2 (de la pantalla) CM Mover el cursor a la fila %1 y la columna %2 (de la memoria) cr Retorno de carro cs Desplazar el contenido de la región que va de la línea %1 a la %2 ct Borrar tabuladores cv Mover el cursor sólo verticalmente hasta la línea %1 dc Borrar un carácter DC Borrar %1 caracteres dl Borrar una línea DL Borrar %1 líneas dm Iniciar modo "borrar" do Mover el cursor una línea hacia abajo DO Mover el cursor #1 líneas hacia abajo ds Desactivar la línea de estado eA Activar un conjunto de caracteres alternativo ec Borrar %1 caracteres comenzando en la posición del cursor ed Finalizar modo "borrar" ei Finalizar modo "inserción" ff Carácter de salto de página en terminales hardcopy fs Regresa el carácter a su posición antes de ir a la línea de estado F1 Cadena enviada por la tecla de función f11 F2 Cadena enviada por la tecla de función f12 F3 Cadena enviada por la tecla de función f13 \&... \&... F9 Cadena enviada por la tecla de función f19 FA Cadena enviada por la tecla de función f20 FB Cadena enviada por la tecla de función f21 \&... \&... FZ Cadena enviada por la tecla de función f45 Fa Cadena enviada por la tecla de función f46 Fb Cadena enviada por la tecla de función f47 \&... \&... Fr Cadena enviada por la tecla de función f63 hd Mover el cursor media línea hacia abajo ho Mover el cursor a su posición inicial (home) hu Mover el cursor media línea hacia arriba i1 Cadena 1 de inicialización en el momento del login i3 Cadena 3 de inicialización en el momento del login is Cadena 2 de inicialización en el momento del login ic Insertar un carácter IC Insertar %1 caracteres if Fichero de inicialización im Comenzar modo "inserción" ip Después de una inserción, introducir tiempo de relleno y se necesitan caracteres especiales iP Programa de inicialización K1 Tecla E<lt>arriba a la izquierdaE<gt> en el miniteclado (keypad) K2 Tecla E<lt>centroE<gt> en el miniteclado K3 Tecla E<lt>arriba a la derechaE<gt> en el miniteclado K4 Tecla E<lt>abajo a la izquierdaE<gt> en el miniteclado K5 Tecla E<lt>abajo a la derechaE<gt> en el miniteclado k0 Tecla 0 de función k1 Tecla 1 de función k2 Tecla 2 de función k3 Tecla 3 de función k4 Tecla 4 de función k5 Tecla 5 de función k6 Tecla 6 de función k7 Tecla 7 de función k8 Tecla 8 de función k9 Tecla 9 de función k; Tecla 10 de función ka Tecla E<lt>borrar todos los tabuladoresE<gt> kA Tecla E<lt>insertar líneaE<gt> kb Tecla E<lt>retrocesoE<gt> kB Retroceder una marca de tabulación kC Tecla E<lt>Borrar pantallaE<gt> kd Tecla E<lt>mover el cursor hacia abajoE<gt> kD Tecla para borrar el carácter bajo el cursor ke Desactivar miniteclado (keypad) kE Tecla E<lt>borrar hasta el final de líneaE<gt> kF Tecla E<lt>desplazar hacia adelante/abajoE<gt> kh Tecla E<lt>mover cursor a su posición inicial (home)E<gt> kH Tecla E<lt>mover cursor hacia abajoE<gt> kI Tecla E<lt>Insertar carácter/Modo "inserción"E<gt> kl Tecla E<lt>mover cursor hacia la izquierdaE<gt> kL Tecla E<lt>borrar líneaE<gt> kM Tecla E<lt>salir de modo "inserción"E<gt> kN Tecla E<lt>página siguienteE<gt> kP Tecla E<lt>página anteriorE<gt> kr Tecla E<lt>mover cursor hacia la derechaE<gt> kR Tecla E<lt>desplazar atrás/arribaE<gt> ks Activar miniteclado (keypad) kS Tecla E<lt>borrar hasta el final de la pantallaE<gt> kt Tecla E<lt>borrar este tabuladorE<gt> kT Tecla E<lt>fijar tabulador aquíE<gt> ku Tecla E<lt>mover cursor hacia arribaE<gt> l0 Etiqueta de la tecla 0 de función, si no es f0 l1 Etiqueta de la tecla 1 de función, si no es f1 l2 Etiqueta de la tecla 2 de función, si no es f2 \&... \&... la Etiqueta de la tecla 10 de función, si no es f10 le Mover el cursor a la izquierda un carácter ll Mover el cursor a la esquina inferior izquierda LE Mover el cursor a la izquierda %1 caracteres LF Desactivar las etiquetas software LO Activar las etiquetas software mb Comenzar parpadeo MC Borrar los márgenes software md Comenzar modo "negrita" me Finalizar los modos so, us, mb, md y mr mh Comenzar modo "brillo medio" mk Modo "oculto" (caracteres invisibles) ML Fijar margen software izquierdo mm Poner el terminal en modo "meta" mo Sacar el terminal del modo "meta" mp Activar atributo protegido mr Comenzar modo "inverso" MR Fijar margen software derecho nd Mover el cursor a la derecha un carácter nw Orden de retorno de carro pc Carácter de relleno pf Desactivar la impresora pk Programar la tecla %1 para enviar la cadena %2 como si hubiera sido tecleada por el usuario pl Programar la tecla %1 para ejecutar la cadena %2 en modo local pn Programar la etiqueta software %1 para mostrar la cadena %2 po Activar la impresora pO Activar la impresora para %1 (E<lt>256) bytes ps Imprimir el contenido de la pantalla en la impresora px Programar la tecla %1 para enviar la cadena %2 al ordenador r1 Cadena 1 de inicialización para colocar el terminal en modos de depuración r2 Cadena 2 de inicialización para colocar el terminal en modos de depuración r3 Cadena 3 de inicialización para colocar el terminal en modos de depuración RA Desactivar los márgenes automáticos rc Recuperar la posición guardada del cursor rf Cadena de inicialización de nombre de fichero RF Solicitar entrada (input) de la terminal RI Mover el cursor a la derecha %1 caracteres rp Repetir %2 veces el carácter %1 rP Rellenar después del carácter enviado en modo reemplazamiento rs Reiniciar cadena RX Desactivar el control de flujo XON/XOFF sa Dar valor a los atributos %1 %2 %3 %4 %5 %6 %7 %8 %9 SA Activar márgenes automáticos sc Guardar la posición del cursor se Finalizar el modo resaltado sf Desplazar de la forma habitual una línea SF Desplazar de la forma habitual %1 líneas so Comenzar modo "resaltado" sr Desplazar de forma inversa SR Desplazar hacia atrás %1 líneas st Fijar un tabulador en todas las filas de la columna actual SX Activar el control de flujo XON/XOFF ta Mover al siguiente tabulador hardware tc Leer la descripción de la terminal desde otra entrada te Terminar programa que usa el movimiento del cursor ti Comenzar programa que usa el movimiento del cursor ts Mover el cursor a la columna %1 de la línea de estado uc Subrayar el carácter bajo el cursor y mover el cursor a la derecha ue Terminar subrayado up Subir el cursor una línea UP Subir el cursor %1 líneas us Comenzar subrayado vb Campana visible ve Cursor visible normal vi Cursor invisible vs Cursor resaltado wi Fijar la ventana de la línea %1 a la %2 y de la columna %3 a la %4 XF El carácter XOFF no es B<^S>

source: There are several ways of defining the control codes for string capabilities:
de: Es gibt mehrere Methoden, Steuercodes für Zeichenketten-Fähigkeiten zu definieren:
es: Hay varias formas de definir los códigos de control para las características de cadena:

source: Every normal character represents itself, except \(aq\(ha\(aq, \(aq\e\(aq, and \(aq%\(aq.
de: Normale Zeichen außer »\(ha«, »\e« und »%« werden angezeigt.
es: Cada caracter normal se representa a si mismo salvo \(aq\(ha\(aq, \(aq\e\(aq, and \(aq%\(aq.

source: A B<\(hax> means Control-x. Control-A equals 1 decimal.
de: Ein B<\(hax> bedeutet Strg-x. Strg-A entspricht der Zahl 1.
es: B<\(hax> significa Control-x. Control-A equivale a 1 decimal.

source: \ex means a special code. x can be one of the following characters:
de: \ex ist ein Spezialcode. x kann eines der folgenden Zeichen sein:
es: \ex significa código especial. x puede ser uno de los siguientes caracteres:

source: n Linefeed (10)
de: n Linefeed (10) Zeilenvorschub
es: n Alimentación (salto) de línea (10)

source: r Carriage return (13)
de: r Carriage return (13) Eingabetaste/Wagenrücklauf
es: r Retorno de carro (13)

source: t Tabulation (9)
de: t Tabulation (9) Tabulator
es: t Tabulación (9)

source: b Backspace (8)
de: b Backspace (8) Rückschritt
es: b Retroceso (8)
