Repository: sebras/manpages-l10n
Catalog: po/*/man5/termcap.5.po
Languages: de, es

source: f Form feed (12)
de: f Form feed (12) Seitenvorschub
es: f Salto de página (12)

source: 0 Null character. A \exxx specifies the octal character xxx.
de: 0 Null-Zeichen. Ein \exxx bedeutet das Oktal-Zeichen xxx.
es: 0 Carácter nulo. \exxx especifica el carácter xxx en octal.

source: Increments parameters by one.
de: Erhöht Parameter um eins.
es: Incrementa los parámetros en uno.

source: Single parameter capability
de: Einzelparameterfähigkeit
es: Característica de parámetro único

source: Add value of next character to this parameter and do binary output
de: Addiert den Wert des nächsten Zeichens zu diesem Parameter und gibt ihn binär aus
es: Añade el valor del siguiente carácter a este parámetro y produce una salida binaria

source: Do ASCII output of this parameter with a field with of 2
de: ASCII-Ausgabe des Parameters mit einer Feldlänge von 2
es: Produce una salida ASCII de este parámetro con un ancho de campo de 2

source: Do ASCII output of this parameter with a field with of 3
de: ASCII Ausgabe des Parameters mit einer Feldlänge von 3
es: Produce una salida ASCII de este parámetro con un ancho de campo de 3

source: Print a \(aq%\(aq
de: Ausgabe des Zeichens »%«
es: Muestra un \(aq%\(aq

source: If you use binary output, then you should avoid the null character (\(aq\e0\(aq) because it terminates the string. You should reset tabulator expansion if a tabulator can be the binary output of a parameter.
de: Bei binären Ausgaben sollten Sie das Null-Zeichen (»\e0«) vermeiden, weil es die Zeichenkette beendet. Sie sollten die Ersetzung von Tabulatoren (tabulator expansion) abschalten, wenn ein Tabulator die binäre Ausgabe eines Parameters sein kann.
es: Si utiliza salida binaria, debería evitar el carácter nulo (\(aq\e0\(aq) ya que se interpreta como el final de la cadena. Si un tabulador puede ser la salida binaria de un parámetro, debe reajustar la expansión de tabuladores.

source: Warning:
de: Warnung:
es: Atención:

source: The above metacharacters for parameters may be wrong: they document Minix termcap which may not be compatible with Linux termcap.
de: Die oben vorgestellten Metazeichen können falsch sein: sie entstammen der Minix-Termcap, die nicht notwendigerweise kompatibel zu der von Linux ist.
es: Los metacaracteres anteriores para los parámetros pueden ser incorrectos: ya que documentan el termcap de Minix que puede no ser compatible con el termcap de Linux.

source: The block graphic characters can be specified by three string capabilities:
de: Die Blockgraphik-Zeichen können durch drei Zeichenketten-Fähigkeiten angegeben werden:
es: Los caracteres gráficos de bloque se pueden especificar mediante tres características de cadena:

source: start the alternative charset
de: Start des alternativen Zeichensatzes
es: comienza el conjunto de caracteres alternativo

source: end the alternative charset
de: Ende des alternativen Zeichensatzes
es: finaliza el conjunto de caracteres alternativo

source: pairs of characters. The first character is the name of the block graphic symbol and the second characters is its definition.
de: Zeichenpaare. Das erste Zeichen ist der Name des Blockgrafik-Symbols, das zweite seine Definition.
es: pares de caracteres. El primer carácter es el nombre del símbolo gráfico de bloque y el segundo carácter es su definición.

source: The following names are available:
de: Folgende Namen stehen zur Verfügung:
es: Los siguientes nombres están disponibles:

source: + right arrow (E<gt>) , left arrow (E<lt>) \&. down arrow (v) 0 full square (#) I lantern (#) - upper arrow (\(ha) \&' rhombus (+) a chess board (:) f degree (') g plus-minus (#) h square (#) j right bottom corner (+) k right upper corner (+) l left upper corner (+) m left bottom corner (+) n cross (+) o upper horizontal line (-) q middle horizontal line (-) s bottom horizontal line (_) t left tee (+) u right tee (+) v bottom tee (+) w normal tee (+) x vertical line (|) \(ti paragraph (???)
de: + right arrow (E<gt>) Pfeil rechts , left arrow (E<lt>) Pfeil links \&. down arrow (v) Pfeil abwärts 0 full square (#) ausgefülltes Rechteck I lantern (#) - upper arrow (\(ha) Pfeil aufwärts \&' rhombus (+) a chess board (:) Schachbrett f degree (') Grad g plus-minus (#) h square (#) Quadrat j right bottom corner (+) rechte untere Ecke k right upper corner (+) rechte obere Ecke l left upper corner (+) linke obere Ecke m left bottom corner (+) linke untere Ecke n cross (+) Kreuz o upper horizontal line (-) Oberstrich q middle horizontal line (-) Mittelstrich s bottom horizontal line (_) Unterstrich t left tee (+) Markierung links ? u right tee (+) Markierung rechts v bottom tee (+) Markierung unten w normal tee (+) normale Markierung x vertical line (|) vertikaler Strich, Pipe-Symbol \(ti paragraph (???) Absatz
es: + flecha derecha (E<gt>) , flecha izquierda (E<lt>) \&. flecha abajo (v) 0 cuadrado relleno (#) I linterna (#) - flecha arriba (^) \&' rombo (+) a tablero de ajedrez (:) f grado (') g mas-menos (#) h cuadrado (#) j esquina inferior derecha (+) k esquina superior derecha (+) l esquina superior izquierda (+) m esquina inferior izquierda (+) n cruce (+) o línea horizontal superior (-) q línea horizontal media (-) s línea horizontal inferior (_) t cruce por la izquierda (+) u cruce por la derecha (+) v cruce por abajo (+) w cruce por arriba (+) x línea vertical (|) ~ párrafo (???)

source: The values in parentheses are suggested defaults which are used by the I<curses> library, if the capabilities are missing.
de: Die Angaben in Klammern sind vorgeschlagene Standardwerte, wie sie von der I<curses>-Bibliothek verwendet werden, falls die Fähigkeiten fehlen.
es: Los valores entre paréntesis son los valores por defecto utilizados por I<curses> cuando no se encuentran las características.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: COLOPHON
de: KOLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: The termcap database is an obsolete facility for describing the capabilities of character-cell terminals and printers. It is retained only for capability with old programs; new programs should use the B<terminfo>(5) database and associated libraries.
de: Die Termcap-Datenbank ist eine veraltete Einrichtung zur Beschreibung der Fähigkeiten zeichenorientierter Terminals und Drucker. Sie wird nur noch für die Kompatibilität mit alten Programmen beibehalten, neue Programme sollten B<terminfo>(5) und die zugehörigen Bibliotheken verwenden.
es: La base de datos termcap es una utilidad -ya obsoleta- para describir las capacidades de impresoras y terminales matriciales. Se conserva para poder conservar la compatibilidad con antiguos programas; las aplicaciones más recientes deberían emplear la base de datos B<terminfo>(5) y las bibliotecas asociadas.

source: 5i Printer will not echo on screen am Automatic margins which means automatic line wrap bs Control-H (8 dec.) performs a backspace bw Backspace on left margin wraps to previous line and right margin da Display retained above screen db Display retained below screen eo A space erases all characters at cursor position es Escape sequences and special characters work in status line gn Generic device hc This is a hardcopy terminal HC The cursor is hard to see when not on bottom line hs Has a status line hz Hazeltine bug, the terminal can not print tilde characters in Terminal inserts null bytes, not spaces, to fill whitespace km Terminal has a meta key mi Cursor movement works in insert mode ms Cursor movement works in standout/underline mode NP No pad character NR ti does not reverse te nx No padding, must use XON/XOFF os Terminal can overstrike ul Terminal underlines although it can not overstrike xb Beehive glitch, f1 sends ESCAPE, f2 sends B<^C> xn Newline/wraparound glitch xo Terminal uses xon/xoff protocol xs Text typed over standout text will be displayed in standout xt Teleray glitch, destructive tabs and odd standout mode
de: 5i Drucker macht keine Bildschirmausgaben am Automatic margins = Automatischer Zeilenumbruch bs Strg-H (8 dez.) führt Rückschritt (backspace) aus bw Rückschritt am linken Rand führt zum rechten Rand der Vorzeile da Anzeige oberhalb des sichtbaren Bereichs bleibt erhalten db Anzeige unterhalb des sichtbaren Bereichs bleibt erhalten eo Ein Leerzeichen löscht jedes Zeichen ab der Cursorposition es Steuersequenzen und spezielle Zeichen arbeiten in der Statuszeile gn Generisches Gerät hc Hardcopy-Terminal (Konsolen-Drucker) HC Cursor schwer erkennbar, wenn nicht in letzter Zeile hs Hat eine Statuszeile hz Hazeltine Bug, das Terminal kann keine Tilde darstellen in Terminal füllt Lücken mit NULL-Bytes, nicht mit Leerzeichen km Terminal hat eine Meta-Taste mi Cursor-Bewegung funktioniert im Einfügemodus ms Cursor-Bewegung funktioniert im Hervorhebungsmodus NP Kein Füllzeichen NR ti kehrt te nicht um nx Kein Auffüllen, XON/XOFF muss verwendet werden os Terminal beherrscht »Fettschrift« ul Terminal unterstreicht, kann aber keine »Fettschrift« xb Beehive glitch, F1 sendet ESCAPE, F2 sendet B<^C> xn Newline/wraparound glitch (kleiner Fehler bei Zeilenvorschub/-umbruch) xo Terminal benutzt xon/xoff-Protokoll xs Wenn hervorgehobener Text überschrieben wird, wird der ersetzende Text ebenfalls hervorgehoben xt Teleray glitch, zerstörerische Tabulatoren und merkwürdige Hervorhebungen
es: 5i La impresora no producirá eco en pantalla am Márgenes automáticos (ajuste automático de palabras en la línea) bs Control-H (8 en decimal) realiza un retroceso bw Retroceso en margen izquierdo vuelve a línea anterior, margen derecho da La visualización se guarda por encima de la pantalla db La visualización se guarda por debajo de la pantalla eo Un espacio borra cualquier carácter en la posición del cursor es Las secuencias de escape y los caracteres especiales funcionan en la línea de estado gn Dispositivo genérico hc Este es un terminal hardcopy (terminal que genera copia impresa) HC El cursor es difícil de ver cuando no está en la última línea hs Tiene línea de estado hz Error Hazeltine, el terminal no puede imprimir caracteres con tilde in El terminal inserta caracteres nulos, no espacios, para rellenar los espacios en blanco km El terminal tiene una metatecla mi El movimiento del cursor funciona en modo Inserción ms El movimiento del cursor funciona en modo Resaltado/Subrayado NP No hay carácter de relleno NR La secuencia 'ti' no deshace el efecto de 'te' nx No hay relleno, debe usarse el control de flujo XON/XOFF os El terminal puede mostrar texto en Negrita ul El terminal puede mostrar texto Subrayado pero no Negrita xb Error Beehive, F1 envía ESCAPE, F2 envía B<^C> xn Error de recorte al final de línea xo El terminal usa control de flujo XON/XOFF xs El texto tecleado sobre texto Resaltado aparecerá Resaltado xt Error Teleray, Tabuladores destructivos y modo Resaltado "raro"
