Repository: sebras/manpages-l10n
Catalog: po/*/man5/termcap.5.po
Languages: de, es

source: + right arrow (E<gt>) , left arrow (E<lt>) \&. down arrow (v) 0 full square (#) I lantern (#) - upper arrow (^) \&' rhombus (+) a chess board (:) f degree (') g plus-minus (#) h square (#) j right bottom corner (+) k right upper corner (+) l left upper corner (+) m left bottom corner (+) n cross (+) o upper horizontal line (-) q middle horizontal line (-) s bottom horizontal line (_) t left tee (+) u right tee (+) v bottom tee (+) w normal tee (+) x vertical line (|) ~ paragraph (???)
de: + right arrow (E<gt>) Pfeil rechts , left arrow (E<lt>) Pfeil links \&. down arrow (v) Pfeil abwärts 0 full square (#) ausgefülltes Rechteck I lantern (#) - upper arrow (^) Pfeil aufwärts \&' rhombus (+) a chess board (:) Schachbrett f degree (') Grad g plus-minus (#) h square (#) Quadrat j right bottom corner (+) rechte untere Ecke k right upper corner (+) rechte obere Ecke l left upper corner (+) linke obere Ecke m left bottom corner (+) linke untere Ecke n cross (+) Kreuz o upper horizontal line (-) Oberstrich q middle horizontal line (-) Mittelstrich s bottom horizontal line (_) Unterstrich t left tee (+) Markierung links ? u right tee (+) Markierung rechts v bottom tee (+) Markierung unten w normal tee (+) normale Markierung x vertical line (|) vertikaler Strich, Pipe-Symbol ~ paragraph (???) Absatz
es: + flecha derecha (E<gt>) , flecha izquierda (E<lt>) \&. flecha abajo (v) 0 cuadrado relleno (#) I linterna (#) - flecha arriba (^) \&' rombo (+) a tablero de ajedrez (:) f grado (') g mas-menos (#) h cuadrado (#) j esquina inferior derecha (+) k esquina superior derecha (+) l esquina superior izquierda (+) m esquina inferior izquierda (+) n cruce (+) o línea horizontal superior (-) q línea horizontal media (-) s línea horizontal inferior (_) t cruce por la izquierda (+) u cruce por la derecha (+) v cruce por abajo (+) w cruce por arriba (+) x línea vertical (|) ~ párrafo (???)

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
