Repository: sebras/manpages-l10n
Catalog: po/*/man5/thinkfan.conf.5.po
Languages: de

source: The thinkpad_acpi interface documentation: https://www.kernel.org/doc/html/latest/admin-guide/laptops/thinkpad-acpi.html
de: Dokumentation zur I<thinkpad_acpi>-Schnittstelle: https://www.kernel.org/doc/html/latest/admin-guide/laptops/thinkpad-acpi.html

source: BUGS
de: FEHLER

source: Report bugs on the github issue tracker: https://github.com/vmatare/thinkfan/issues
de: Melden Sie Fehler auf Github: https://github.com/vmatare/thinkfan/issues
