Repository: sebras/manpages-l10n
Catalog: po/*/man5/tmpfiles.d.5.po
Languages: de

source: If the age field starts with a tilde character "~", clean-up is only applied to files and directories one level inside the directory specified, but not the files and directories immediately inside it\&.
de: Falls das Feld »Alter« mit einem Tildezeichen »~« beginnt, erfolgt die Bereinigung nur auf Dateien und Verzeichnisse eine Stufe innerhalb des festgelegten Verzeichnisses, aber nicht auf Dateien und Verzeichnisse direkt innerhalb davon\&.

source: The age of a file system entry is determined from its last modification timestamp (mtime), its last access timestamp (atime), and (except for directories) its last status change timestamp (ctime)\&. By default, any of these three (or two) values will prevent cleanup if it is more recent than the current time minus the age field\&. To restrict the deletion based on particular type of file timestamps, the age-by argument can be used\&.
de: Das Alter des Dateisystemeintrags wird von seinem letzten Änderungszeitstempel (mtime), seinem letzten Zugriffszeitstempel (atime) und (außer für Verzeichnisse) seinem letzten Statusänderungszeitstempel (ctime) bestimmt\&. Standardmäßig wird jeder der drei (oder zwei) Werte die Bereinigung verhindern, falls er neuer als die aktuelle Zeit minus des Feldes »Alter« ist\&. Um die Löschung basierend auf einer bestimmten Art von Dateistempel einzuschränken, kann das Argument »Alterungsdauer« verwandt werden.

source: The age-by argument overrides the timestamp types to be used for the age check\&. It can be specified by prefixing the age argument with a sequence of characters to specify the timestamp types and a colon (":"): "I<age-by>\&.\&.\&.:I<cleanup-age>"\&. The argument can consist of B<a> (B<A> for directories), B<b> (B<B> for directories), B<c> (B<C> for directories), or B<m> (B<M> for directories)\&. Those respectively indicate access, creation, last status change, and last modification time of a file system entry\&. The lower-case letter signifies that the given timestamp type should be considered for files, while the upper-case letter signifies that the given timestamp type should be considered for directories\&. See B<statx>(2) file timestamp fields for more details about timestamp types\&.
de: Das Argument »Alterungsdauer« setzt die Zeitstempeltypen, die für die Altersüberprüfung verwandt werden, außer Kraft\&. Es kann angegeben werden, indem dem Alter-Argument eine Reihe von Zeichen, zur Angabe des Zeitstempeltyps, und ein Doppelpunkt (»:«) vorangestellt werden: »I<Alterungsdauer>…:II<Bereinigungszeit>«\&. Das Argument kann aus B<a> (B<A> für Verzeichnisse), B<b> (B<B> für Verzeichnisse), B<c> (B<C> für Verzeichnisse) oder B<m> (B<M> für Verzeichnisse) bestehen\&. Diese geben Zugriff, Erstellung, letzte Statusänderung bzw. letzte Veränderungszeit eines Dateisystemeintrags an\&. Der Kleinbuchstabe gibt an, dass der übergebene Zeitstempeltyp für Dateien betrachtet werden soll, während der Großbuchstabe angibt, dass der übergebene Zeitstempeltyp für Verzeichnisse betrachtet werden soll\&. Siehe B<statx>(2) Dateistempelfelder (file stamp types) für weitere Details über Zeitstempeltypen\&.

source: If not specified, the age-by field defaults to B<abcmABM>, i\&.e\&. by default all file timestamps are taken into consideration, with the exception of the last status change timestamp (ctime) for directories\&. This is because the aging logic itself will alter the ctime whenever it deletes a file inside it\&. To ensure that running the aging logic does not feed back into the next iteration of itself, ctime for directories is ignored by default\&.
de: Falls nicht angegeben, ist die Vorgabe für das Feld »Alterungsdauer« B<abcmABM>, d\&.h\&. standardmäßig werden alle Datei-Zeitstempelfelder berücksichtigt mit der Ausnahme des Zeitstempels der letzten Statusänderung (ctime) bei Verzeichnissen\&. Dies erfolgt, da die Alterungslogik selbst die Ctime ändert, immer wenn sie eine Datei darin löscht\&. Um sicherzustellen, dass die laufende Alterungslogik nicht beim nächsten Durchlauf in sich selbst rückkoppelt, wird standardmäßig die ctime für Verzeichnisse ignoriert\&.

source: # Files created and modified, and directories accessed more than # an hour ago in "/tmp/foo/bar", are subject to time-based cleanup\&. d /tmp/foo/bar - - - - bmA:1h -
de: # Dateien, die vor mehr als einer Stunde erstellt und verändert bzw. # Verzeichnisse, auf die vor mehr als einer Stunde in »/tmp/foo/bar« # zugegriffen wurden unterliegen der zeitbasierten Bereinigung\&. d /tmp/foo/bar - - - - bmA:1h -

source: Note that while the aging algorithm is run a \*(Aqshared\*(Aq BSD file lock (see B<flock>(2)) is taken on each directory the algorithm descends into (and each directory below that, and so on)\&. If the aging algorithm finds a lock is already taken on some directory, it (and everything below it) is skipped\&. Applications may use this to temporarily exclude certain directory subtrees from the aging algorithm: the applications can take a BSD file lock themselves, and as long as they keep it aging of the directory and everything below it is disabled\&.
de: Beachten Sie, dass während der Ausführung des Alterungsalgorithmus eine gemeinsame BSD-Dateisperre (siehe B<flock>(2)) auf jedem Verzeichnis, in das der Algorithmus absteigt (und jedes Verzeichnis darunter usw.), erlangt wird\&. Falls der Alterungsalgorithmus eine bereits erlangte Sperre auf einem Verzeichnis findet, wird es (und alles darunter) übersprungen\&. Anwendungen können dies dazu verwenden, temporär bestimmte Verzeichnisunterbäume von dem Alterungsalgorithmus auszuschließen: die Anwendungen können selbst eine BSD-Dateisperre erlangen und solange sie diese behalten, wird das Altern des Verzeichnisses und alles darunter ausgeschaltet\&.

source: For I<L> lines determines the destination path of the symlink\&. For I<c> and I<b>, determines the major/minor of the device node, with major and minor formatted as integers, separated by ":", e\&.g\&. "1:3"\&. For I<f>, I<F>, and I<w>, the argument may be used to specify a short string that is written to the file, suffixed by a newline\&. For I<C>, specifies the source file or directory\&. For I<t> and I<T>, determines extended attributes to be set\&. For I<a> and I<A>, determines ACL attributes to be set\&. For I<h> and I<H>, determines the file attributes to set\&. Ignored for all other lines\&.
de: Für I<L>-Zeilen bestimmt es den Zielpfad des Symlinks\&. Für I<c> und I<b>-Zeilen bestimmt es den Major/Minor des Geräteknotens, wobei Major und Minor als Ganzzahlen getrennt durch »:« formatiert sind, z\&.B\&. »1:3«\&. Für I<f>, I<F> und I<w> kann das Argument zur Angabe einer kurzen Zeichenkette, die in eine Datei (abgeschlossen durch einen Zeilenumbruch) geschrieben wird, verwandt werden\&. Für I<C> legt es die Quelldatei oder das Quellverzeichnis fest\&. Für I<t> und I<T> bestimmt es die zu setzenden erweiterten Attribute\&. Für I<a> und I<A> bestimmt es die zu setzenden ACL-Attribute\&. Für I<h> und I<H> bestimmt es die zu setzenden Dateiattribute\&. Für alle anderen Zeilen ignoriert\&.

source: This field can contain specifiers, see below\&.
de: Dieses Feld kann Kennzeichner enthalten, siehe unten\&.

source: SPECIFIERS
de: KENNZEICHNER

source: Specifiers can be used in the "path" and "argument" fields\&. An unknown or unresolvable specifier is treated as invalid configuration\&. The following expansions are understood:
de: Kennzeichner können in den Feldern »Pfad« und »Argument« verwandt werden\&. Ein unbekannter oder unauflösbarer Kennzeichner wird als ungültige Konfiguration behandelt\&. Die folgenden Erweiterungen werden verstanden:

source: B<Table\ \&1.\ \&Specifiers available>
de: B<Tabelle\ \&1.\ \&Verfügbare Kennzeichner>

source: Specifier
de: Kennzeichner

source: Meaning
de: Bedeutung

source: Architecture
de: Architektur

source: A short string identifying the architecture of the local system\&. A string such as B<x86>, B<x86-64> or B<arm64>\&. See the architectures defined for I<ConditionArchitecture=> in B<systemd.unit>(5) for a full list\&.
de: Eine kurze Zeichenkette, die die Architektur des lokalen Systems identifiziert\&. Eine Zeichenkette wie B<x86>, B<x86-64> oder B<arm64>\&. Siehe die für I<ConditionArchitecture=> in B<systemd.unit>(5) definierten Architekturen für die vollständige Liste\&.

source: Operating system image version
de: Betriebssystemabbildversion

source: The operating system image version identifier of the running system, as read from the I<IMAGE_VERSION=> field of /etc/os-release\&. If not set, resolves to an empty string\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystemabbildversionskennzeichnung des laufenden Systems, wie aus dem Feld I<IMAGE_VERSION=> in /etc/os-release ausgelesen\&. Falls nicht gesetzt, wird es die leere Zeichenkette\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: Boot ID
de: Boot-Kennung

source: The boot ID of the running system, formatted as string\&. See B<random>(4) for more information\&.
de: Die Boot-Kennung des laufenden Systems, formatiert als Zeichenkette\&. Siehe B<random>(4) für weitere Informationen\&.

source: Operating system build ID
de: Betriebssystembaukennung

source: The operating system build identifier of the running system, as read from the I<BUILD_ID=> field of /etc/os-release\&. If not set, resolves to an empty string\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystembaukennung des laufenden Systems, wie aus dem Feld I<BUILD_ID=> in /etc/os-release ausgelesen\&. Falls nicht gesetzt, wird es zur leeren Zeichenkette aufgelöst\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: System or user cache directory
de: System- oder Benutzerzwischenspeicherverzeichnis

source: In B<--user> mode, this is the same as I<$XDG_CACHE_HOME>, and /var/cache otherwise\&.
de: Im Modus B<--user> ist dies identisch zu I<$XDG_CACHE_HOME>, andernfalls /var/cache\&.

source: User group
de: Benutzergruppe

source: This is the name of the group running the command\&. In case of the system instance this resolves to "root"\&.
de: Dies ist der Name der Gruppe, die den Befehl ausführt\&. Im Falle der Systeminstanz löst sich dies auf »root« auf\&.

source: User GID
de: Benutzer-GID

source: This is the numeric GID of the group running the command\&. In case of the system instance this resolves to B<0>\&.
de: Dies ist die numerische GID der Gruppe, die den Befehl ausführt\&. Im Falle der Systeminstanz löst sich dies auf B<0> auf\&.

source: User home directory
de: Benutzer-Home-Verzeichnis.

source: This is the home directory of the user running the command\&. In case of the system instance this resolves to "/root"\&.
de: Dies ist das Home-Verzeichnis des Benutzers, der den Befehl ausführt\&. Im Falle der Systeminstanz löst sich dies auf »/root« auf\&.

source: Host name
de: Rechnername

source: The hostname of the running system\&.
de: Der Rechnername des laufenden Systems\&.

source: Short host name
de: Kurzer Rechnername

source: The hostname of the running system, truncated at the first dot to remove any domain component\&.
de: Die Rechnername des laufenden Systems, abgeschnitten am ersten Punkt, um alle Domain-Komponenten zu entfernen\&.

source: System or user log directory
de: System- oder Benutzerprotokollierverzeichnis

source: In B<--user> mode, this is the same as I<$XDG_CONFIG_HOME> with /log appended, and /var/log otherwise\&.
de: Im Modus B<--user> ist dies identisch zu I<$XDG_CONFIG_HOME> mit angehängtem /log, andernfalls /var/log\&.

source: Machine ID
de: Maschinenkennung

source: The machine ID of the running system, formatted as string\&. See B<machine-id>(5) for more information\&.
de: Die Maschinenkennung des laufenden Systems, formatiert als Zeichenkette\&. Siehe B<machine-id>(5) für weitere Informationen\&.

source: Operating system image identifier
de: Betriebssystemabbildkennung

source: The operating system image identifier of the running system, as read from the I<IMAGE_ID=> field of /etc/os-release\&. If not set, resolves to an empty string\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystemabbildkennung des laufenden Systems, wie aus dem Feld I<IMAGE_ID=> in /etc/os-release ausgelesen\&. Falls nicht gesetzt, wird es die leere Zeichenkette\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: Operating system ID
de: Betriebssystemkennung

source: The operating system identifier of the running system, as read from the I<ID=> field of /etc/os-release\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystemkennung des laufenden Systems, wie aus dem Feld I<ID=> in /etc/os-release ausgelesen\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: System or user state directory
de: System- oder Benutzerzustandsverzeichnis

source: In B<--user> mode, this is the same as I<$XDG_CONFIG_HOME>, and /var/lib otherwise\&.
de: Im Modus B<--user> ist dies identisch zu I<$XDG_CONFIG_HOME>, andernfalls /var/lib\&.

source: System or user runtime directory
de: System- oder Benutzerlaufzeitverzeichnis

source: In B<--user> mode, this is the same I<$XDG_RUNTIME_DIR>, and /run/ otherwise\&.
de: Im Modus B<--user> ist dies identisch zu I<$XDG_RUNTIME_DIR>, andernfalls /run/\&.

source: Directory for temporary files
de: Verzeichnis für temporäre Dateien

source: This is either /tmp or the path "$TMPDIR", "$TEMP" or "$TMP" are set to\&. (Note that the directory may be specified without a trailing slash\&.)
de: Dies ist entweder /tmp oder der Pfad, auf den »$TMPDIR«, »$TEMP« oder »$TMP« gesetzt ist\&. (Beachten Sie, dass das Verzeichnis ohne abschließenden Schrägstrich angegeben werden kann\&.)

source: User name
de: Benutzername

source: This is the name of the user running the command\&. In case of the system instance this resolves to "root"\&.
de: Dies ist der Name des Benutzers, der den Befehl ausführt\&. Im Falle der Systeminstanz löst sich dies auf »root« auf\&.

source: User UID
de: Benutzer-UID

source: This is the numeric UID of the user running the command\&. In case of the system instance this resolves to B<0>\&.
de: Dies ist die numerische UID des Benutzers, der den Befehl ausführt\&. Im Falle der Systeminstanz löst sich dies auf B<0> auf\&.

source: Kernel release
de: Kernelveröffentlichung

source: Identical to B<uname -r> output\&.
de: Identisch zur Ausgabe von B<uname -r>\&.

source: Directory for larger and persistent temporary files
de: Verzeichnis für größere und dauerhafte temporäre Dateien

source: This is either /var/tmp or the path "$TMPDIR", "$TEMP" or "$TMP" are set to\&. (Note that the directory may be specified without a trailing slash\&.)
de: Dies ist entweder /var/tmp oder der Pfad, auf den »$TMPDIR«, »$TEMP« oder »$TMP« gesetzt ist\&. (Beachten Sie, dass das Verzeichnis ohne abschließenden Schrägstrich angegeben werden kann\&.)

source: Operating system version ID
de: Betriebssystemversionskennung

source: The operating system version identifier of the running system, as read from the I<VERSION_ID=> field of /etc/os-release\&. If not set, resolves to an empty string\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystemversionskennzeichnung des laufenden Systems, wie aus dem Feld I<VERSION_ID=> in /etc/os-release ausgelesen\&. Falls nicht gesetzt, wird es die leere Zeichenkette\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: Operating system variant ID
de: Betriebssystemvariantenkennung

source: The operating system variant identifier of the running system, as read from the I<VARIANT_ID=> field of /etc/os-release\&. If not set, resolves to an empty string\&. See B<os-release>(5) for more information\&.
de: Die Betriebssystemvariantenkennung des laufenden Systems, wie aus dem Feld I<VARIANT_ID=> in /etc/os-release ausgelesen\&. Falls nicht gesetzt, wird es die leere Zeichenkette\&. Siehe B<os-release>(5) für weitere Informationen\&.

source: Single percent sign
de: Einzelnes Prozentzeichen

source: Use "%%" in place of "%" to specify a single percent sign\&.
de: Verwenden Sie »%%« anstelle von »%«, um ein einzelnes Prozentzeichen anzugeben\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&Create directories with specific mode and ownership>
de: B<Beispiel\ \&1.\ \&Erstellt Verzeichnisse mit festgelegtem Modus und Eigentümerschaft>

source: B<screen>(1), needs two directories created at boot with specific modes and ownership:
de: B<screen>(1) benötigt beim Systemstart zwei Verzeichnisse mit bestimmten Modi und Eigentümerschaften:

source: Contents of /run/screens and /run/uscreens will be cleaned up after 10 and 10\(12 days, respectively\&.
de: Inhalte von /run/screens und /run/uscreens werden nach 10 bzw\&. 10 Tagen und 12 Stunden bereinigt\&.

source: B<Example\ \&2.\ \&Create a directory with a SMACK attribute>
de: B<Beispiel\ \&2.\ \&Erstellt ein Verzeichnis mit einem SMACK-Attribut>

source: The directory will be owned by root and have default mode\&. Its contents are not subject to time based cleanup, but will be obliterated when B<systemd-tmpfiles --remove> runs\&.
de: Das Verzeichnis wird root gehören und den Standardmodus haben\&. Seine Inhalte unterliegen nicht der zeitbasierten Bereinigung, werden aber gelöscht, wenn B<systemd-tmpfiles --remove> ausgeführt wird\&.

source: B<Example\ \&3.\ \&Create a directory and prevent its contents from cleanup>
de: B<Beispiel\ \&3.\ \&Erstellt ein Verzeichnis und verhindert die Bereinigung seiner Inhalte>

source: B<abrt>(1), needs a directory created at boot with specific mode and ownership and its content should be preserved from the automatic cleanup applied to the contents of /var/tmp:
de: B<abrt>(1) benötigt ein beim Systemstart erstelltes Verzeichnis mit bestimmten Modi und Eigentümerschaften, dessen Inhalte vor der automatischen, auf /var/tmp angewandten Bereinigung geschützt werden sollten:

source: B<Example\ \&4.\ \&Apply clean up during boot and based on time>
de: B<Beispiel\ \&4.\ \&Wendet Bereinigung beim Systemstart und zeitbasiert an>

source: The lock files will be removed during boot\&. Any files and directories in /var/cache/dnf/ will be removed after they have not been accessed in 30 days\&.
de: Die Sperrdateien werden während des Systemstarts entfernt\&. Alle Dateien und Verzeichnisse in /var/cache/dnf/ werden entfernt, nachdem in 30 Tagen nicht auf sie zugegriffen wurde\&.

source: B<Example\ \&5.\ \&Empty the contents of a cache directory on boot>
de: B<Beispiel\ \&5.\ \&Den Inhalt eines Zwischenspeicherverzeichnisses beim Systemstart leeren>

source: Any files and subdirectories in /var/cache/krb5rcache/ will be removed on boot\&. The directory will not be created\&.
de: Alle Dateien und Unterverzeichnisse in /var/cache/krb5rcache/ werden beim Systemstart entfernt\&. Das Verzeichnis wird nicht erstellt\&.

source: /RUN/ AND /VAR/RUN/
de: /RUN/ UND /VAR/RUN/

source: /var/run/ is a deprecated symlink to /run/, and applications should use the latter\&. B<systemd-tmpfiles> will warn if /var/run/ is used\&.
de: /var/run/ ist ein veralteter Symlink auf /run/ und Anwendungen sollten Letzteres verwenden\&. B<systemd-tmpfiles> wird bei der Verwendung von /var/run warnen\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: System and Service Credentials
de: System- und Dienste-Zugangsberechtigungen

source: Notes on Resolvability of User and Group Names
de: Hinweise zur Auflösbarkeit von Benutzer- und Gruppennamen

source: The type consists of a single letter and optionally an exclamation mark ("!") minus sign ("-"), and/or equals sign ("=")\&.
de: Der Typ besteht aus einem einzelnen Buchstaben und optional einem Ausrufezeichen (»!«), einem Minuszeichen (»-«) und/oder einem Gleichheitszeichen (»=«)\&.

source: The format of the argument field is I<[+-=][aAcCdDeijPsStTu]>\&. The prefix I<+> (the default one) causes the attribute(s) to be added; I<-> causes the attribute(s) to be removed; I<=> causes the attributes to be set exactly as the following letters\&. The letters "aAcCdDeijPsStTu" select the new attributes for the files, see B<chattr>(1) for further information\&.
de: Das Format des Argumentenfelds lautet I<[+-=][aAcCdDeijPsStTu]>\&. Das Präfix I<+> (die Vorgabe) führt dazu, dass die Attribute hinzugfügt werden, I<-> führt dazu, dass die Attribute entfernt werden, I<=> führt dazu, dass die Attribute genau auf die nachfolgenden Buchstaben gesetzt werden\&. Die Buchstaben »aAcCdDeijPsStTu« wählen die neuen Attribute für die Dateien aus, siehe B<chattr>(1) für weitere Informationen\&.

source: This field should generally only reference system users/groups, i\&.e\&. users/groups that are guaranteed to be resolvable during early boot\&. If this field references users/groups that only become resolveable during later boot (i\&.e\&. after NIS, LDAP or a similar networked directory service become available), execution of the operations declared by the line will likely fail\&. Also see \m[blue]B<Notes on Resolvability of User and Group Names>\m[]\&\s-2\u[1]\d\s+2 for more information on requirements on system user/group definitions\&.
de: Dieses Feld sollte im Allgemeinen nur Systembenutzer/-gruppen, d\&.h\&. Benutzer/Gruppen, die während des frühen Systemstarts garantiert aufgelöst werden können, referenzieren\&. Falls dieses Feld Benutzer/Gruppen referenziert, die erst während des späteren Systemstarts auflösbar werden (d\&.h\&. nachdem NIS, LDAP oder ähnliche netzbasierte Verzeichnisdienste verfügbar werden), wird die Ausführung von Aktionen, die durch diese Zeile festgelegt werden, wahrscheinlich fehlschlagen\&. Siehe auch \m[blue]B<Hinweise zur Auflösbarkeit von Benutzer- und Gruppennamen>\m[]\&\s-2\u[1]\d\s+2 für weitere Informationen über die Anforderungen an die Definition von Systembenutzer/-gruppen\&.
