Repository: sebras/manpages-l10n
Catalog: po/*/man5/tmpfiles.d.5.po
Languages: de

source: #Type Path Mode User Group Age Argument f /file/to/create mode user group - content f+ /file/to/create-or-truncate mode user group - content w /file/to/write-to - - - - content w+ /file/to/append-to - - - - content d /directory/to/create-and-cleanup mode user group cleanup-age - D /directory/to/create-and-remove mode user group cleanup-age - e /directory/to/cleanup mode user group cleanup-age - v /subvolume-or-directory/to/create mode user group - - q /subvolume-or-directory/to/create mode user group - - Q /subvolume-or-directory/to/create mode user group - - p /fifo/to/create mode user group - - p+ /fifo/to/[re]create mode user group - - L /symlink/to/create - - - - symlink/target/path L+ /symlink/to/[re]create - - - - symlink/target/path c /dev/char-device-to-create mode user group - major:minor c+ /dev/char-device-to-[re]create mode user group - major:minor b /dev/block-device-to-create mode user group - major:minor b+ /dev/block-device-to-[re]create mode user group - major:minor C /target/to/create - - - - /source/to/copy x /path-or-glob/to/ignore/recursively - - - - - X /path-or-glob/to/ignore - - - - - r /empty/dir/to/remove - - - - - R /dir/to/remove/recursively - - - - - z /path-or-glob/to/adjust/mode mode user group - - Z /path-or-glob/to/adjust/mode/recursively mode user group - - t /path-or-glob/to/set/xattrs - - - - xattrs T /path-or-glob/to/set/xattrs/recursively - - - - xattrs h /path-or-glob/to/set/attrs - - - - file attrs H /path-or-glob/to/set/attrs/recursively - - - - file attrs a /path-or-glob/to/set/acls - - - - POSIX ACLs a+ /path-or-glob/to/append/acls - - - - POSIX ACLs A /path-or-glob/to/set/acls/recursively - - - - POSIX ACLs A+ /path-or-glob/to/append/acls/recursively - - - - POSIX ACLs
de: #Typ Pfad Modus Benutzer Gruppe Alter Argument f /Datei/zu/erstellen Modus Benutzer Gruppe - Inhalt f+ /Datei/zu/erstellen-oder-abzuschneiden Modus Benutzer Gruppe - Inhalt w /Datei/zu/hineinschreiben - - - - Inhalt w+ /Datei/zu/anzuhängen - - - - Inhalt d /Verzeichnis/zu/erstellen-und-aufzuräumen Modus Benutzer Gruppe Aufräumalter - D /Verzeichnis/zu/erstellen-und-entfernen Modus Benutzer Gruppe Aufräumalter - e /Verzeichnis/zu/aufzuräumen Modus Benutzer Gruppe Aufräumalter - v /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Gruppe - - q /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Grpppe - - Q /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Gruppe - - p /FIFO/zu/erstellen Modus Benutzer Gruppe - - p+ /FIFO/(neu)zu/erstellen Modus Benutzer Gruppe - - L /Symlink/zu/erstellen - - - - Symlink/Ziel/Pfad L+ /Symlink/(neu)zu/erstellen - - - - Symlink/Ziel/Pfad c /dev/zeichenorientiertes-Gerät-zu-erstellen Modus Benutzer Gruppe - major:minor c+ /dev/zeichenorientiertes-Gerät-(neu)zu-erstellen Modus Benutzer Gruppe - major:minor b /dev/Blockgerät-zu-erstellen Modus Benutzer Gruppe - major:minor b+ /dev/Blockgerät-(neu)zu-erstellen Modus Benutzer Gruppe - major:minor C /Ziel/zu/erstellen - - - - /Quelle/zu/kopieren x /Pfad-oder-Glob/zu/ignorieren/rekursiv - - - - - X /Pfad-oder-Glob/zu/ignorieren - - - - - r /leeres/Verzeichnis/zu/entfernen - - - - - R /Verzeichnis/zu/entfernen/rekursiv - - - - - z /Pfad-oder-Glob/zu/anpassen/Modus Modus Benutzer Gruppe - - Z /Pfad-oder-Glob/zu/anpassen/Modus/rekursiv Modus Benutzer Gruppe - - t /Pfad-oder-Glob/zu/setzen/Xattrs - - - - Xattrs T /Pfad-oder-Glob/zu/setzen/Xattrs/rekursiv - - - - Xattrs h /Pfad-oder-Glob/zu/setzen/Attrs - - - - Datei-Attrs H /Pfad-oder-Glob/zu/setzen/Attrs/rekursiv - - - - Datei-Attrs a /Pfad-oder-Glob/zu/setzen/ACLs - - - - POSIX ACLs a+ /Pfad-oder-Glob/zu/anzuhängen/ACLs - - - - POSIX ACLs A /Pfad-oder-Glob/zu/setzen/ACLs/rekursiv - - - - POSIX ACLs A+ /Pfad-oder-Glob/zu/anzuhängen/ACLs/rekursiv - - - - POSIX ACLs

source: Recursively copy a file or directory, if the destination files or directories do not exist yet or the destination directory is empty\&. Note that this command will not descend into subdirectories if the destination directory already exists and is not empty\&. Instead, the entire copy operation is skipped\&. If the argument is omitted, files from the source directory /usr/share/factory/ with the same name are copied\&. Does not follow symlinks\&.
de: Kopiert eine Datei oder ein Verzeichnis rekursiv, falls die Zieldateien oder -verzeichnisse noch nicht existieren oder das Zielverzeichnis leer ist\&. Beachten Sie, dass dieser Befehl nicht in Unterverzeichnisse absteigen wird, falls das Zielverzeichnis bereits existiert und nicht leer ist\&. Stattdessen wird die gesamte Kopieraktion übersprungen\&. Falls das Argument weggelassen wird, werden Dateien aus dem Quellverzeichnis /usr/share/factory/ mit dem gleichen Namen kopiert\&. Folgt keinen Symlinks\&.
