Repository: sebras/manpages-l10n
Catalog: po/*/man5/tmpfiles.d.5.po
Languages: de

source: It is recommended to use I<Q> for subvolumes that typically contain further subvolumes, and where it is desirable to have accounting and quota limits on all child subvolumes together\&. Examples for I<Q> are typically /home/ or /var/lib/machines/\&. In contrast, I<q> should be used for subvolumes that either usually do not include further subvolumes or where no accounting and quota limits are needed that apply to all child subvolumes together\&. Examples for I<q> are typically /var/ or /var/tmp/\&.
de: Es wird empfohlen, I<Q> für Teildatenträger zu verwenden, die typischerweise weitere Teildatenträger enthalten und bei denen es wünschenswert ist, Buchführung und Kontingentbegrenzungen auf allen Kind-Teildatenträger zusammen zu haben\&. Beispiele für I<Q> sind typischerweise /home/ oder /var/lib/machines/\&. I<q> sollte dagegen für Teildatenträger verwandt werden, die entweder normalerweise keine weiteren Teildatenträger enthalten oder bei denen keine Buchführung und Kontingentbegrenzungen benötigt werden, die auf alle Kind-Teildatenträger zusammen angewandt werden sollen\&. Beispiele für I<q> sind typischerweise /var/ oder /var/tmp/\&.

source: As with I<q>, I<Q> has no effect on the quota group hierarchy if the subvolume already exists, regardless of whether the subvolume already belong to a quota group or not\&.
de: Wie mit I<q> hat I<Q> keine Wirkung auf die Kontingentgruppenhierarchie, falls der Teildatenträger bereits existiert, unabhängig davon, ob der Teildatenträger bereits zu der Kontingentgruppe gehört\&.

source: Create a named pipe (FIFO) if it does not exist yet\&. If suffixed with I<+> and a file already exists where the pipe is to be created, it will be removed and be replaced by the pipe\&.
de: Erstellt eine benannte Pipe (FIFO), falls sie noch nicht existiert\&. Falls I<+> angehängt ist und eine Datei bereits existiert, wo die Pipe erstellt werden soll, wird sie entfernt und durch die Pipe ersetzt\&.

source: Create a symlink if it does not exist yet\&. If suffixed with I<+> and a file or directory already exists where the symlink is to be created, it will be removed and be replaced by the symlink\&. If the argument is omitted, symlinks to files with the same name residing in the directory /usr/share/factory/ are created\&. Note that permissions and ownership on symlinks are ignored\&.
de: Erstellt einen Symlink, falls er noch nicht existiert\&. Falls I<+> angehängt ist und eine Datei bereits existiert, wo der Symlink erstellt werden soll, wird sie entfernt und durch den Symlink ersetzt\&. Falls das Argument nicht angegeben wird werden Symlinks auf Dateien mit dem gleichen Namen, die in /usr/share/factory/ liegen, erstellt\&. Beachten Sie, dass Berechtigungen und Eigentümerschaften bei Symlinks ignoriert werden\&.

source: Create a character device node if it does not exist yet\&. If suffixed with I<+> and a file already exists where the device node is to be created, it will be removed and be replaced by the device node\&. It is recommended to suffix this entry with an exclamation mark to only create static device nodes at boot, as udev will not manage static device nodes that are created at runtime\&.
de: Erstellt einen Zeichengeräteknoten, falls er noch nicht existiert\&. Falls I<+> angehängt ist und eine Datei bereits existiert, wo der Geräteknoten erstellt werden soll, wird sie entfernt und durch den Geräteknoten ersetzt\&. Es wird empfohlen, an diesen Eintrag ein Ausrufezeichen anzuhängen, um statische Geräteknoten nur beim Systemstart zu erstellen, da Udev keine statischen Geräteknoten verwalten wird, die zur Laufzeit erstellt wurden\&.

source: Create a block device node if it does not exist yet\&. If suffixed with I<+> and a file already exists where the device node is to be created, it will be removed and be replaced by the device node\&. It is recommended to suffix this entry with an exclamation mark to only create static device nodes at boot, as udev will not manage static device nodes that are created at runtime\&.
de: Erstellt einen Blockgeräteknoten, falls er noch nicht existiert\&. Falls I<+> angehängt ist und eine Datei bereits existiert, wo der Geräteknoten erstellt werden soll, wird sie entfernt und durch den Geräteknoten ersetzt\&. Es wird empfohlen, an diesen Eintrag ein Ausrufezeichen anzuhängen, um statische Geräteknoten nur beim Systemstart zu erstellen, da Udev keine statischen Geräteknoten verwalten wird, die zur Laufzeit erstellt wurden\&.

source: Recursively copy a file or directory, if the destination files or directories do not exist yet or the destination directory is empty\&. Note that this command will not descend into subdirectories if the destination directory already exists and is not empty\&. Instead, the entire copy operation is skipped\&. If the argument is omitted, files from the source directory /usr/share/factory/ with the same name are copied\&. Does not follow symlinks\&. Contents of the directories are subject to time based cleanup if the age argument is specified\&.
de: Kopiert eine Datei oder ein Verzeichnis rekursiv, falls die Zieldateien oder -verzeichnisse noch nicht existieren oder das Zielverzeichnis leer ist\&. Beachten Sie, dass dieser Befehl nicht in Unterverzeichnisse absteigen wird, falls das Zielverzeichnis bereits existiert und nicht leer ist\&. Stattdessen wird die gesamte Kopieraktion übersprungen\&. Falls das Argument weggelassen wird, werden Dateien aus dem Quellverzeichnis /usr/share/factory/ mit dem gleichen Namen kopiert\&. Folgt keinen Symlinks\&. Die Inhalte der Verzeichnisse unterliegen zeitbasierten Bereinigungen, falls das Alter-Argument festgelegt wurde\&.

source: Ignore a path during cleaning\&. Use this type to exclude paths from clean-up as controlled with the Age parameter\&. Note that lines of this type do not influence the effect of I<r> or I<R> lines\&. Lines of this type accept shell-style globs in place of normal path names\&.
de: Ignoriert während der Bereinigung einen Pfad\&. Verwenden Sie diesen Typ, um Pfade von der Reinigung, wie sie mit dem Parameter Age gesteuert wird, auszuschließen\&. Beachten Sie, dass Zeilen von diesem Typ nicht den Effekt von I<r>- und I<R>-Zeilen beeinflussen\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&.

source: Ignore a path during cleaning\&. Use this type to exclude paths from clean-up as controlled with the Age parameter\&. Unlike I<x>, this parameter will not exclude the content if path is a directory, but only directory itself\&. Note that lines of this type do not influence the effect of I<r> or I<R> lines\&. Lines of this type accept shell-style globs in place of normal path names\&.
de: Ignoriert während der Bereinigung einen Pfad\&. Verwenden Sie diesen Typ, um Pfade von der Reinigung, wie sie mit dem Parameter Age gesteuert wird, auszuschließen\&. Anders als I<x> wird der Parameter keinen Inhalt ausschließen, falls Pfad ein Verzeichnis ist, sondern nur Verzeichnisse selbst\&. Beachten Sie, dass Zeilen von diesem Typ nicht den Effekt von I<r>- und I<R>-Zeilen beeinflussen\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&.

source: Remove a file or directory if it exists\&. This may not be used to remove non-empty directories, use I<R> for that\&. Lines of this type accept shell-style globs in place of normal path names\&. Does not follow symlinks\&.
de: Entfernt eine Datei oder ein Verzeichnis, falls sie/es bereits existiert\&. Dies kann nur zur Entfernung leerer Verzeichnisse verwandt werden, verwenden Sie andernfalls I<R>\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Folgt keinen Symlinks\&.

source: Recursively remove a path and all its subdirectories (if it is a directory)\&. Lines of this type accept shell-style globs in place of normal path names\&. Does not follow symlinks\&.
de: Entfernt einen Pfad und alle seine Unterverzeichnisse (falls es ein Verzeichnis ist) rekursiv\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Folgt keinen Symlinks\&.

source: Adjust the access mode, user and group ownership, and restore the SELinux security context of a file or directory, if it exists\&. Lines of this type accept shell-style globs in place of normal path names\&. Does not follow symlinks\&.
de: Passt den Zugriffsmodus, die Benutzer- und Gruppeneigentümerschaft an und stellt den SELinux-Sicherheitskontext einer Datei oder eines Verzeichnisses, falls sie/es existiert, wieder her\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Folgt keinen Symlinks\&.

source: Recursively set the access mode, user and group ownership, and restore the SELinux security context of a file or directory if it exists, as well as of its subdirectories and the files contained therein (if applicable)\&. Lines of this type accept shell-style globs in place of normal path names\&. Does not follow symlinks\&.
de: Setzt rekursiv den Zugriffsmodus, die Benutzer- und Gruppeneigentümerschaft und stellt den SELinux-Sicherheitskontext einer Datei oder eines Verzeichnisses, falls sie/es existiert, sowie, falls zutreffend, seiner Unterverzeichnisse und der darin enthaltenen Dateien, wieder her\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Folgt keinen Symlinks\&.

source: Set extended attributes, see B<attr>(5) for details\&. The argument field should take one or more assignment expressions in the form I<namespace>\&.I<attribute>=I<value>, for examples see below\&. Lines of this type accept shell-style globs in place of normal path names\&. This can be useful for setting SMACK labels\&. Does not follow symlinks\&.
de: Setzt erweiterte Attribute, siehe B<attr>(5) für Details\&. Das Argumentenfeld sollte eine oder mehrere Zuweisungen in der Form I<Namensraum>\&.I<Attribut>=I<Wert> akzeptieren, Beispiele finden Sie weiter unten\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Dies kann zum Setzen von SMACK-Label nützlich sein\&. Folgt keinen Symlinks\&.

source: Please note that extended attributes settable with this line type are a different concept from the Linux file attributes settable with I<h>/I<H>, see below\&.
de: Bitte beachten Sie, dass erweiterte Attribute, die mit diesem Zeilentyp setzbar sind, ein anderes Konzept als die mit I<h>/I<H> setzbaren Linux-Dateiattribute sind, siehe unten\&.

source: Same as I<t>, but operates recursively\&.
de: Identisch zu I<t>, arbeitet aber rekursiv\&.

source: Set Linux file/directory attributes\&. Lines of this type accept shell-style globs in place of normal path names\&.
de: Setzt Linux-Datei-/Verzeichnisattribute\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&.

source: Passing only I<=> as argument resets all the file attributes listed above\&. It has to be pointed out that the I<=> prefix limits itself to the attributes corresponding to the letters listed here\&. All other attributes will be left untouched\&. Does not follow symlinks\&.
de: Wird nur I<=> übergeben, werden alle oben aufgeführten Dateiattribute zurückgesetzt\&. Es muss daraufhingewiesen werden, dass sich das Präfix I<=> auf die Attribute beschränkt, die den hier aufgeführten Buchstaben entsprechen\&. Alle weiteren Attribute bleiben unverändert\&. Folgt keinen Symlinks\&.

source: Please note that the Linux file attributes settable with this line type are a different concept from the extended attributes settable with I<t>/I<T>, see above\&.
de: Bitte beachten Sie, dass die Linux-Datei-Attribute, die mit diesem Zeilentyp setzbar sind, ein anderes Konzept als die mit I<t>/I<T> setzbaren erweiterten Attribute sind, siehe oben\&.

source: Sames as I<h>, but operates recursively\&.
de: Identisch zu I<h>, arbeitet aber rekursiv\&.

source: Set POSIX ACLs (access control lists), see B<acl>(5)\&. If suffixed with I<+>, the specified entries will be added to the existing set\&. B<systemd-tmpfiles> will automatically add the required base entries for user and group based on the access mode of the file, unless base entries already exist or are explicitly specified\&. The mask will be added if not specified explicitly or already present\&. Lines of this type accept shell-style globs in place of normal path names\&. This can be useful for allowing additional access to certain files\&. Does not follow symlinks\&.
de: Setzt POSIX ACLs (Zugriffsteuerungslisten), siehe B<acl>(5)\&. Falls I<+> vorangestellt wird, werden die angegebenen Einträge zu der bestehenden Menge hinzugefügt\&. B<systemd-tmpfiles> wird automatisch die benötigten Basiseinträge für Benutzer und Gruppen basierend auf dem Zugriffsmodus der Datei hinzufügen, außer die Basiseinträge existieren bereits oder werden explizit festgelegt\&. Die Maske wird hinzugefügt, falls sie nicht explizit festgelegt oder bereits vorhanden ist\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Dies kann zum Erlauben von zusätzlichen Zugriffen auf bestimmte Dateien nützlich sein\&. Folgt keinen Symlinks\&.

source: Same as I<a> and I<a+>, but recursive\&. Does not follow symlinks\&.
de: Identisch zu I<a> und I<a+>, aber rekursiv\&. Folgt keinen Symlinks\&.

source: If the exclamation mark ("!") is used, this line is only safe to execute during boot, and can break a running system\&. Lines without the exclamation mark are presumed to be safe to execute at any time, e\&.g\&. on package upgrades\&. B<systemd-tmpfiles> will take lines with an exclamation mark only into consideration, if the B<--boot> option is given\&.
de: Falls das Ausrufezeichen (»!«) verwandt wird, ist diese Zeile nur bei der Ausführung während des Systemstarts sicher und kann ein laufendes System beschädigen\&. Bei Zeilen ohne Ausrufezeichen wird angenommen, dass ihr Aufruf jederzeit sicher ist, z\&.B\&. bei Paket-Upgrades\&. B<systemd-tmpfiles> wird Zeilen mit einem Ausrufezeichen nur in Betracht ziehen, falls die Option B<--boot> angegeben ist\&.

source: For example:
de: Beispiel:

source: # Make sure these are created by default so that nobody else can d /tmp/\&.X11-unix 1777 root root 10d
de: # Sicherstellen, dass diese standardmäßig erstellt werden, so dass es # kein anderer machen kann d /tmp/\&.X11-unix 1777 root root 10d

source: # Unlink the X11 lock files r! /tmp/\&.X[0-9]*-lock
de: # Lösen des X11-Sperrdatei-Links r! /tmp/\&.X[0-9]*-lock

source: The second line in contrast to the first one would break a running system, and will only be executed with B<--boot>\&.
de: Im Gegensatz zur ersten Zeile würde die zweite Zeile ein laufendes System beschädigen und wird daher nur mit B<--boot> ausgeführt\&.

source: If the minus sign ("-") is used, this line failing to run successfully during create (and only create) will not cause the execution of B<systemd-tmpfiles> to return an error\&.
de: Falls das Minuszeichen (»-«) verwandt wird, wird ein Fehlschlag bei der Ausführung dieser Zeile während der Erstellung (und nur der Erstellung) nicht zu der Ausführung von B<systemd-tmpfiles> führen und einen Fehler zurückliefern\&.

source: # Modify sysfs but don\*(Aqt fail if we are in a container with a read-only /proc w- /proc/sys/vm/swappiness - - - - 10
de: # Verändert sysfs, aber schlägt nicht fehl, falls es sich in einem Container mit schreibgeschütztem /proc befindet w- /proc/sys/vm/swappiness - - - - 10

source: If the equals sign ("=") is used, the file types of existing objects in the specified path are checked, and removed if they do not match\&. This includes any implicitly created parent directories (which can be either directories or directory symlinks)\&. For example, if there is a FIFO in place of one of the parent path components it will be replaced with a directory\&.
de: Falls das Gleichheitszeichen (»=«) verwandt wird, dann wird der Dateityp bestehender Objekte in dem festgelegten Pfad überprüft und dieser entfernt, falls sie nicht übereinstimmen\&. Hierzu gehören alle implizit erstellten Elternverzeichnisse (die entweder Verzeichnisse oder Verzeichnis-Symlinks sein können)\&. Ist beispielsweise ein FIFO anstelle eines der Elternpfadkomponenten, wird dieser durch ein Verzeichnis ersetzt\&.

source: Note that for all line types that result in creation of any kind of file node (i\&.e\&. I<f>/I<F>, I<d>/I<D>/I<v>/I<q>/I<Q>, I<p>, I<L>, I<c>/I<b> and I<C>) leading directories are implicitly created if needed, owned by root with an access mode of 0755\&. In order to create them with different modes or ownership make sure to add appropriate I<d> lines\&.
de: Beachten Sie, dass für alle Zeilentypen, die zur Erstellung irgendeiner Art von Dateimodus führen (d\&.h\&. I<f>/I<F>, I<d>/I<D>/I<v>/I<q>/I<Q>, I<p>, I<L>, I<c>/I<b> und I<C>) führende Verzeichnisse implizit falls notwendig erstellt werden, die root gehören und den Zugriffsmodus 0755 haben\&. Um sicherzustellen, dass Sie sie mit anderen Modi oder Eigentümerschaften erstellen, verwenden Sie geeignete I<d>-Zeilen\&.

source: Path
de: Pfad

source: The file system path specification supports simple specifier expansion, see below\&. The path (after expansion) must be absolute\&.
de: Die Dateisystempfadangabe unterstützt einfache Kennzeichnererweiterungen, siehe unten\&. Der Pfad muss (nach Erweiterung) absolut sein\&.

source: Mode
de: Modus

source: The file access mode to use when creating this file or directory\&. If omitted or when set to "-", the default is used: 0755 for directories, 0644 for all other file objects\&. For I<z>, I<Z> lines, if omitted or when set to "-", the file access mode will not be modified\&. This parameter is ignored for I<x>, I<r>, I<R>, I<L>, I<t>, and I<a> lines\&.
de: Der bei der Erstellung der Datei oder des Verzeichnisses zu verwendende Dateizugriffsmodus\&. Falls weggelassen oder auf »-« gesetzt, wird die Vorgabe benutzt: 0755 für Verzeichnisse, 0644 für alle anderen Dateiobjekte\&. Für I<z>-, I<Z>-Zeilen, weggelassen oder auf »-« gesetzt, wird der Dateizugriffsmodus nicht verändert\&. Dieser Parameter wird für I<x>-, I<r>-, I<R>-, I<L>-, I<t>- und I<a>-Zeilen ignoriert\&.

source: Optionally, if prefixed with "~", the access mode is masked based on the already set access bits for existing file or directories: if the existing file has all executable bits unset, all executable bits are removed from the new access mode, too\&. Similarly, if all read bits are removed from the old access mode, they will be removed from the new access mode too, and if all write bits are removed, they will be removed from the new access mode too\&. In addition, the sticky/SUID/SGID bit is removed unless applied to a directory\&. This functionality is particularly useful in conjunction with I<Z>\&.
de: Falls optional »~« vorangestellt wird, wird der Zugriffsmodus basierend auf Zugriffsbits von bereits bestehenden Dateien oder Verzeichnissen maskiert: falls die bestehende Datei alle Ausführ-Bits nicht gesetzt hat, werden auch alle Ausführ-Bits von dem neuen Zugriffsmodus entfernt\&. Ähnlicherweise werden alle Lese-Bits auch von dem neuen Zugriffsmodus entfernt, falls alle Lese-Bits von dem alten Zugriffsmodus entfernt sind und falls alle Schreib-Bits entfernt wurden, werden sie auch von dem neuen Zugriffsmodus entfernt\&. Zusätzlich wird auch das Bit sticky/SUID/SGID entfernt, außer es wird auf ein Verzeichnis angewandt\&. Diese Funktionalität ist insbesondere im Zusammenspiel mit I<Z> nützlich\&.

source: User, Group
de: Benutzer, Gruppe

source: The user and group to use for this file or directory\&. This may either be a numeric ID or a user/group name\&. If omitted or when set to "-", the user and group of the user who invokes B<systemd-tmpfiles> is used\&. For I<z> and I<Z> lines, when omitted or when set to "-", the file ownership will not be modified\&. These parameters are ignored for I<x>, I<r>, I<R>, I<L>, I<t>, and I<a> lines\&.
de: Die für diese Datei oder dieses Verzeichnis zu verwendenden Benutzer und Gruppe\&. Dies kann entweder eine numerische Kennung oder ein Benutzer- oder Gruppenname sein\&. Falls weggelassen oder auf »-« gesetzt, wird der Benutzer und die Gruppe des Benutzers, der B<systemd-tmpfiles> aufgerufen hat, verwandt\&. Für I<z>- und I<Z>-Zeilen, falls weggelassen oder auf »-« gesetzt, wird die Dateieigentümerschaft nicht geändert\&. Diese Parameter werden für I<x>-, I<r>-, I<R>-, I<L>-, I<t>- und I<a>-Zeilen ignoriert\&.

source: This field should generally only reference system users/groups, i\&.e\&. users/groups that are guaranteed to be resolvable during early boot\&. If this field references users/groups that only become resolveable during later boot (i\&.e\&. after NIS, LDAP or a similar networked directory service become available), execution of the operations declared by the line will likely fail\&. Also see \m[blue]B<Notes on Resolvability of User and Group Names>\m[]\&\s-2\u[3]\d\s+2 for more information on requirements on system user/group definitions\&.
de: Dieses Feld sollte im Allgemeinen nur Systembenutzer/-gruppen, d\&.h\&. Benutzer/Gruppen, die während des frühen Systemstarts garantiert aufgelöst werden können, referenzieren\&. Falls dieses Feld Benutzer/Gruppen referenziert, die erst während des späteren Systemstarts auflösbar werden (d\&.h\&. nachdem NIS, LDAP oder ähnliche netzbasierte Verzeichnisdienste verfügbar werden), wird die Ausführung von Aktionen, die durch diese Zeile festgelegt werden, wahrscheinlich fehlschlagen\&. Siehe auch \m[blue]B<Hinweise zur Auflösbarkeit von Benutzer- und Gruppennamen>\m[]\&\s-2\u[3]\d\s+2 für weitere Informationen über die Anforderungen an die Definition von Systembenutzer/-gruppen\&.

source: Age
de: Alter

source: The date field, when set, is used to decide what files to delete when cleaning\&. If a file or directory is older than the current time minus the age field, it is deleted\&. The field format is a series of integers each followed by one of the following suffixes for the respective time units: B<s>, B<m> or B<min>, B<h>, B<d>, B<w>, B<ms>, and B<us>, meaning seconds, minutes, hours, days, weeks, milliseconds, and microseconds, respectively\&. Full names of the time units can be used too\&.
de: Das Datumsfeld, falls gesetzt, wird zur Entscheidung, welche Dateien beim Bereinigen gelöscht werden sollen, verwandt\&. Falls eine Datei oder ein Verzeichnis älter als die aktuelle Zeit minus des Feldes »Alter« ist, wird sie gelöscht\&. Das Feldformat ist eine Serie von Ganzzahlen, an die eine der nachfolgenden entsprechenden Zeiteinheiten angehängt ist: B<s> (Sekunden), B<m> oder B<min> (Minuten), B<h> (Stunden), B<d> (Tage), B<w> (Wochen), B<ms> (Millisekunden) und B<us> (Mikrosekunden)\&. Es können auch die ausgeschriebenen englischen Namen verwandt werden\&.

source: If multiple integers and units are specified, the time values are summed\&. If an integer is given without a unit, B<s> is assumed\&.
de: Falls mehrere Ganzzahlen und Einheiten festgelegt werden, werden die Zeitwerte aufsummiert\&. Falls eine Ganzzahl ohne Einheit angegeben wird, wird B<s> angenommen\&.

source: When the age is set to zero, the files are cleaned unconditionally\&.
de: Wird das Alter auf Null gesetzt, werden die Dateien bedingungslos bereinigt\&.

source: The age field only applies to lines starting with I<d>, I<D>, I<e>, I<v>, I<q>, I<Q>, I<C>, I<x> and I<X>\&. If omitted or set to "-", no automatic clean-up is done\&.
de: Das Feld »Alter« wird nur auf Zeilen, die mit I<d>, I<D>, I<e>, I<v>, I<q>, I<Q>, I<C>, I<x> und I<X> beginnen, angewandt\&. Falls weggelassen oder auf »-« gesetzt, erfolgt keine automatische Bereinigung\&.
