Repository: sebras/manpages-l10n
Catalog: po/*/man5/tmpfiles.d.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: tmpfiles.d - Configuration for creation, deletion and cleaning of volatile and temporary files
de: tmpfiles.d - Konfiguration für die Erstellung, Löschung und Bereinigung von flüchtigen und temporären Dateien

source: SYNOPSIS
de: ÜBERSICHT

source: #Type Path Mode User Group Age Argument f /file/to/create mode user group - content f+ /file/to/create-or-truncate mode user group - content w /file/to/write-to - - - - content w+ /file/to/append-to - - - - content d /directory/to/create-and-cleanup mode user group cleanup-age - D /directory/to/create-and-remove mode user group cleanup-age - e /directory/to/cleanup mode user group cleanup-age - v /subvolume-or-directory/to/create mode user group cleanup-age - q /subvolume-or-directory/to/create mode user group cleanup-age - Q /subvolume-or-directory/to/create mode user group cleanup-age - p /fifo/to/create mode user group - - p+ /fifo/to/[re]create mode user group - - L /symlink/to/create - - - - symlink/target/path L+ /symlink/to/[re]create - - - - symlink/target/path c /dev/char-device-to-create mode user group - major:minor c+ /dev/char-device-to-[re]create mode user group - major:minor b /dev/block-device-to-create mode user group - major:minor b+ /dev/block-device-to-[re]create mode user group - major:minor C /target/to/create - - - cleanup-age /source/to/copy x /path-or-glob/to/ignore/recursively - - - cleanup-age - X /path-or-glob/to/ignore - - - cleanup-age - r /empty/dir/to/remove - - - - - R /dir/to/remove/recursively - - - - - z /path-or-glob/to/adjust/mode mode user group - - Z /path-or-glob/to/adjust/mode/recursively mode user group - - t /path-or-glob/to/set/xattrs - - - - xattrs T /path-or-glob/to/set/xattrs/recursively - - - - xattrs h /path-or-glob/to/set/attrs - - - - file attrs H /path-or-glob/to/set/attrs/recursively - - - - file attrs a /path-or-glob/to/set/acls - - - - POSIX ACLs a+ /path-or-glob/to/append/acls - - - - POSIX ACLs A /path-or-glob/to/set/acls/recursively - - - - POSIX ACLs A+ /path-or-glob/to/append/acls/recursively - - - - POSIX ACLs
de: #Typ Pfad Modus Benutzer Gruppe Alter Argument f /Datei/zu/erstellen Modus Benutzer Gruppe - Inhalt f+ /Datei/zu/erstellen-oder-abzuschneiden Modus Benutzer Gruppe - Inhalt w /Datei/zu/hineinschreiben - - - - Inhalt w+ /Datei/zu/anzuhängen - - - - Inhalt d /Verzeichnis/zu/erstellen-und-aufzuräumen Modus Benutzer Gruppe Aufräumalter - D /Verzeichnis/zu/erstellen-und-entfernen Modus Benutzer Gruppe Aufräumalter - e /Verzeichnis/zu/aufzuräumen Modus Benutzer Gruppe Aufräumalter - v /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Gruppe Aufräumalter - q /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Grpppe Aufräumalter - Q /Teildatenträger-oder-Verzeichnis/zu/erstellen Modus Benutzer Gruppe Aufräumalter - p /FIFO/zu/erstellen Modus Benutzer Gruppe - - p+ /FIFO/(neu)zu/erstellen Modus Benutzer Gruppe - - L /Symlink/zu/erstellen - - - - Symlink/Ziel/Pfad L+ /Symlink/(neu)zu/erstellen - - - - Symlink/Ziel/Pfad c /dev/zeichenorientiertes-Gerät-zu-erstellen Modus Benutzer Gruppe - major:minor c+ /dev/zeichenorientiertes-Gerät-(neu)zu-erstellen Modus Benutzer Gruppe - major:minor b /dev/Blockgerät-zu-erstellen Modus Benutzer Gruppe - major:minor b+ /dev/Blockgerät-(neu)zu-erstellen Modus Benutzer Gruppe - major:minor C /Ziel/zu/erstellen - - - Aufräumalter /Quelle/zu/kopieren x /Pfad-oder-Glob/zu/ignorieren/rekursiv - - - Aufräumalter - X /Pfad-oder-Glob/zu/ignorieren - - - Aufräumalter - r /leeres/Verzeichnis/zu/entfernen - - - - - R /Verzeichnis/zu/entfernen/rekursiv - - - - - z /Pfad-oder-Glob/zu/anpassen/Modus Modus Benutzer Gruppe - - Z /Pfad-oder-Glob/zu/anpassen/Modus/rekursiv Modus Benutzer Gruppe - - t /Pfad-oder-Glob/zu/setzen/Xattrs - - - - Xattrs T /Pfad-oder-Glob/zu/setzen/Xattrs/rekursiv - - - - Xattrs h /Pfad-oder-Glob/zu/setzen/Attrs - - - - Datei-Attrs H /Pfad-oder-Glob/zu/setzen/Attrs/rekursiv - - - - Datei-Attrs a /Pfad-oder-Glob/zu/setzen/ACLs - - - - POSIX ACLs a+ /Pfad-oder-Glob/zu/anzuhängen/ACLs - - - - POSIX ACLs A /Pfad-oder-Glob/zu/setzen/ACLs/rekursiv - - - - POSIX ACLs A+ /Pfad-oder-Glob/zu/anzuhängen/ACLs/rekursiv - - - - POSIX ACLs

source: DESCRIPTION
de: BESCHREIBUNG

source: tmpfiles\&.d configuration files provide a generic mechanism to define the I<creation> of regular files, directories, pipes, and device nodes, adjustments to their I<access mode, ownership, attributes, quota assignments, and contents>, and finally their time-based I<removal>\&. It is mostly commonly used for volatile and temporary files and directories (such as those located under /run/, /tmp/, /var/tmp/, the API file systems such as /sys/ or /proc/, as well as some other directories below /var/)\&.
de: tmpfiles\&.d-Konfigurationsdateien bieten einen generischen Mechanismus an, um die I<Erstellung> regulärer Dateien, Verzeichnisse, Pipes und Geräteknoten, Anpassungen ihres I<Zugriffsmodus>, ihrer I<Eigentümerschaft, Attribute, Kontingente, Zuweisungen> und ihres I<Kontextes> und schließlich ihrer zeitbasierten I<Entfernung> zu definieren\&. Es wird am häufigsten für flüchtige und temporäre Dateien und Verzeichnisse benutzt (wie solchen, die sich unterhalb von /run/, /tmp/, /var/tmp/, den API-Dateisystemen wie /sys/ oder /proc/, sowie einigen anderen Verzeichnissen unterhalb von /var/ befinden)\&.

source: B<systemd-tmpfiles> uses this configuration to create volatile files and directories during boot and to do periodic cleanup afterwards\&. See B<systemd-tmpfiles>(5) for the description of systemd-tmpfiles-setup\&.service, systemd-tmpfiles-clean\&.service, and associated units\&.
de: B<systemd-tmpfiles> verwendet diese Konfiguration, um während des Systemstarts und nachfolgenden periodischen Bereinigungen flüchtige Dateien und Verzeichnisse zu erstellen\&. Siehe B<systemd-tmpfiles>(5) für eine Beschreibung von systemd-tmpfiles-setup\&.service, systemd-tmpfiles-clean\&.service und zugehörigen Units\&.

source: System daemons frequently require private runtime directories below /run/ to store communication sockets and similar\&. For these, it is better to use I<RuntimeDirectory=> in their unit files (see B<systemd.exec>(5) for details), if the flexibility provided by tmpfiles\&.d is not required\&. The advantages are that the configuration required by the unit is centralized in one place, and that the lifetime of the directory is tied to the lifetime of the service itself\&. Similarly, I<StateDirectory=>, I<CacheDirectory=>, I<LogsDirectory=>, and I<ConfigurationDirectory=> should be used to create directories under /var/lib/, /var/cache/, /var/log/, and /etc/\&. tmpfiles\&.d should be used for files whose lifetime is independent of any service or requires more complicated configuration\&.
de: System-Daemons benötigen häufig private Laufzeitverzeichnisse unterhalb von /run/, um Kommunikations-Sockets und ähnliches abzuspeichern\&. Dafür sollte besser I<RuntimeDirectory=> in ihren Unit-Dateien verwandt werden (siehe B<systemd.exec>(5) für Details), falls die durch tmpfiles\&.d bereitgestellte Flexibilität nicht benötigt wird\&. Der Vorteil ist, dass die durch die Unit benötigte Konfiguration an einer Stelle zentralisiert ist und dass die Lebensdauer des Verzeichnisses an die Lebensdauer des Dienstes selbst gekoppelt ist\&. Ähnlich sollten I<StateDirectory=>, I<CacheDirectory=>, I<LogsDirectory=> und I<ConfigurationDirectory=> zur Erstellung von Verzeichnisse unterhalb von /var/lib/, /var/cache/, /var/log/ und /etc/ verwandt werden\&. tmpfiles\&.d sollte für Dateien verwandt werden, deren Lebensdauer unabhängig von irgendeinem Dienst ist oder die kompliziertere Konfiguration benötigen\&.

source: CONFIGURATION DIRECTORIES AND PRECEDENCE
de: KONFIGURATIONSVERZEICHNISSE UND RANGFOLGE

source: Each configuration file shall be named in the style of I<package>\&.conf or I<package>-I<part>\&.conf\&. The second variant should be used when it is desirable to make it easy to override just this part of configuration\&.
de: Jede Konfigurationsdatei muss in der Art I<Paket>\&.conf oder I<Paket>-I<Teil>\&.conf benannt werden\&. Die zweite Variante sollte genutzt werden, wenn es wünschenswert ist, es leicht zu machen, nur diesen Teil der Konfiguration außer Kraft zu setzen\&.

source: Files in /etc/tmpfiles\&.d override files with the same name in /usr/lib/tmpfiles\&.d and /run/tmpfiles\&.d\&. Files in /run/tmpfiles\&.d override files with the same name in /usr/lib/tmpfiles\&.d\&. Packages should install their configuration files in /usr/lib/tmpfiles\&.d\&. Files in /etc/tmpfiles\&.d are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. All configuration files are sorted by their filename in lexicographic order, regardless of which of the directories they reside in\&. If multiple files specify the same path, the entry in the file with the lexicographically earliest name will be applied (note that lines suppressed due to the "!" are filtered before application, meaning that if an early line carries the exclamation mark and is suppressed because of that, a later line matching in path will be applied)\&. All other conflicting entries will be logged as errors\&. When two lines are prefix path and suffix path of each other, then the prefix line is always created first, the suffix later (and if removal applies to the line, the order is reversed: the suffix is removed first, the prefix later)\&. Lines that take globs are applied after those accepting no globs\&. If multiple operations shall be applied on the same file (such as ACL, xattr, file attribute adjustments), these are always done in the same fixed order\&. Except for those cases, the files/directories are processed in the order they are listed\&.
de: Dateien in /etc/tmpfiles\&.d setzen Dateien mit dem gleichen Namen in /usr/lib/tmpfiles\&.d und /run/tmpfiles\&.d außer Kraft\&. Dateien in /run/tmpfiles\&.d setzen Dateien mit dem gleichen Namen in /usr/lib/tmpfiles\&.d außer Kraft\&. Pakete sollten ihre Konfigurationsdateien in /usr/lib/tmpfiles\&.d installieren\&. Dateien in /etc/tmpfiles\&.d sind für den lokalen Administrator reserviert, der diese Logik dazu verwenden kann, um vom Lieferanten installierte Pakete außer Kraft zu setzen\&. Alle Konfigurationsdateien werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem der Verzeichnisse sie sich befinden\&. Falls mehrere Dateien den gleichen Pfad festlegen, wird der Eintrag in der Datei mit dem lexikographisch kleinsten Namen angewandt\&. (Beachten Sie, dass aufgrund »!« unterdrückte Zeilen vor jeder Anwendung gefiltert werden, was bedeutet, dass eine spätere Zeile, die auf einen Pfad passt, angewandt wird, falls eine frührere Zeile das Ausrufezeichen trägt und daher unterdrückt wird\&.) Alle anderen im Konflikt stehenden Einträge werden als Fehler protokolliert\&. Wenn zwei Zeilen Präfix- und Suffixpfad von dem jeweils anderen sind, wird das Präfix zuerst, das Suffix später erstellt (und falls das Entfernen für die Zeile gilt, ist die Reihenfolge umgedreht: das Suffix wird zuerst entfernt, das Präfix später)\&. Zeilen, die Globs akzeptieren werden nach solchen, die keine Globs akzeptieren, verarbeitet. Falls mehrere Aktionen auf die gleiche Datei angewandt werden sollen (wie ACL, Xattr, Dateiatributsanpassungen), werden diese immer in der gleichen festen Reihenfolge vorgenommen\&. Außer für diese Fälle werden die Dateien/Verzeichnisse in der Reihenfolge verarbeitet, in der sie aufgeführt sind\&.

source: If the administrator wants to disable a configuration file supplied by the vendor, the recommended way is to place a symlink to /dev/null in /etc/tmpfiles\&.d/ bearing the same filename\&.
de: Falls der Administrator eine vom Lieferanten bereitgestellte Konfigurationsdatei außer Kraft setzen möchte, wird empfohlen, einen Symlink auf /dev/null in /etc/tmpfiles\&.d/, der den gleichen Dateinamen trägt, anzulegen\&.

source: CONFIGURATION FILE FORMAT
de: KONFIGURATIONSDATEIFORMAT

source: The configuration format is one line per path, containing type, path, mode, ownership, age, and argument fields\&. The lines are separated by newlines, the fields by whitespace:
de: Das Konfigurationsformat ist eine Zeile pro Pfad und enthält Typ-, Pfad-, Modus-, Eigentümerschaft-, Alter- und Argumentfelder\&. Die Zeilen werden durch Zeilenumbrüche, die Felder durch Leerraumzeichen getrennt:

source: #Type Path Mode User Group Age Argument\&... d /run/user 0755 root root 10d - L /tmp/foobar - - - - /dev/null
de: #Typ Pfad Modus Benutzer Gruppe Alter Argument… d /run/user 0755 root root 10d - L /tmp/foobar - - - - /dev/null

source: Fields may contain C-style escapes\&. With the exception of the seventh field (the "argument") all fields may be enclosed in quotes\&. Note that any whitespace found in the line after the beginning of the argument field will be considered part of the argument field\&. To begin the argument field with a whitespace character, use C-style escapes (e\&.g\&. "\ex20")\&.
de: Felder können C-artige Maskierungen enthalten\&. Mit Ausnahme des siebten Feldes (dem »Argument«) können alle Felder in englische Anführungszeichen eingeschlossen werden\&. Beachten Sie, dass sämtliche Leerraumzeichen, die in der Zeile nach dem Anfang des Argumentenfeldes angetroffen werden, als Teil des Argumentenfeldes angesehen werden\&. Um das Argumentenfeld mit einem Leerraumzeichen zu beginnen, verwenden Sie C-artige Maskierungen (z\&.B\&. »\ex20«)\&.

source: Type
de: Typ

source: The following line types are understood:
de: Die folgenden Zeilentypen werden verstanden:

source: I<f> will create a file if it does not exist yet\&. If the argument parameter is given and the file did not exist yet, it will be written to the file\&. I<f+> will create or truncate the file\&. If the argument parameter is given, it will be written to the file\&. Does not follow symlinks\&.
de: I<f> erstellt eine Datei, falls sie noch nicht existiert\&. Falls der Argumentparameter angegeben ist und die Datei noch nicht existierte, wird er in die Datei geschrieben\&. I<f+> erstellt eine Datei oder schneidet sie ab\&. Falls der Argumentparameter angegeben ist, wird er in die Datei geschrieben\&. Folgt keinen Symlinks\&.

source: Write the argument parameter to a file, if the file exists\&. If suffixed with I<+>, the line will be appended to the file\&. If your configuration writes multiple lines to the same file, use I<w+>\&. Lines of this type accept shell-style globs in place of normal path names\&. The argument parameter will be written without a trailing newline\&. C-style backslash escapes are interpreted\&. Follows symlinks\&.
de: Schreibt den Argumentparameter in eine Datei, falls die Datei existiert\&. Falls ein I<+> angehängt ist, wird die Zeile an die Datei angehängt\&. Falls Ihre Konfiguration mehrere Zeilen in die gleiche Datei schreibt, verwenden Sie I<w+>\&. Zeilen dieses Typs akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Der Argumentparameter wird ohne abschließenden Zeilenumbruch geschrieben\&. C-artige Rückwärtsschrägstrichmaskierungen werden interpretiert\&. Folgt Symlinks\&.

source: Create a directory\&. The mode and ownership will be adjusted if specified\&. Contents of this directory are subject to time based cleanup if the age argument is specified\&.
de: Erstellt ein Verzeichnis\&. Der Modus und die Eigentümerschaft werden angepasst, falls angegeben\&. Inhalte dieses Verzeichnisses unterliegen einer zeitbasierten Bereinigung, falls das Argument »Alter« festgelegt ist\&.

source: Similar to I<d>, but in addition the contents of the directory will be removed when B<--remove> is used\&.
de: Ähnlich zu I<d>, aber zusätzlich werden die Inhalte des Verzeichnisses entfernt, wenn B<--remove> verwandt wird\&.

source: Adjust the mode and ownership of existing directories and remove their contents based on age\&. Lines of this type accept shell-style globs in place of normal path names\&. Contents of the directories are subject to time based cleanup if the age argument is specified\&. If the age argument is "0", contents will be unconditionally deleted every time B<systemd-tmpfiles --clean> is run\&.
de: Passt den Modus und die Eigentümerschaft eines bestehenden Verzeichnisses an und entfernt altersbasiert die Inhalte darin\&. Zeilen von diesem Typ akzeptieren Shell-artige Globs anstelle von normalen Pfadnamen\&. Inhalte dieser Verzeichnisse unterliegen zeitbasierter Bereinigung, falls das Argument »Alter« festgelegt ist\&. Falls das Argument »Alter« »0« ist, werden die Inhalte bei jedem Aufruf von B<systemd-tmpfiles --clean> bedingungslos gelöscht\&.

source: For this entry to be useful, at least one of the mode, user, group, or age arguments must be specified, since otherwise this entry has no effect\&. As an exception, an entry with no effect may be useful when combined with I<!>, see the examples\&.
de: Damit dieser Eintrag nützlich ist, muss mindestens eines der Argumente Modus, Benutzer, Gruppe oder Alter festgelegt sein, da andernfalls dieser Eintrag keinen Effekt hat\&. Als Ausnahme kann ein Eintrag ohne Effekt bei der Kombination mit I<!> nützlich sein, siehe Beispiele\&.

source: Create a subvolume if the path does not exist yet, the file system supports subvolumes (btrfs), and the system itself is installed into a subvolume (specifically: the root directory / is itself a subvolume)\&. Otherwise, create a normal directory, in the same way as I<d>\&.
de: Erstellt einen Teildatenträger, falls der Pfad noch nicht existiert, das Dateisystem Teildatenträger unterstützt (Btrfs) und das System selbst in einen Teildatenträger installiert ist (konkret: das Wurzelverzeichnis / ist selbst ein Teildatenträger)\&. Andernfalls wird wie bei I<d> ein normales Verzeichnis erstellt\&.

source: A subvolume created with this line type is not assigned to any higher-level quota group\&. For that, use I<q> or I<Q>, which allow creating simple quota group hierarchies, see below\&.
de: Ein mit diesem Zeilentyp erstellter Teildatenträger wird keiner abstrakteren Kontingentgruppe zugeordnet\&. Verwenden Sie dafür I<q> oder I<Q>, die die Erstellung einfacher Kontingentgruppenhierarchien erlauben, siehe unten\&.

source: Create a subvolume or directory the same as I<v>, but assign the subvolume to the same higher-level quota groups as the parent\&. This ensures that higher-level limits and accounting applied to the parent subvolume also include the specified subvolume\&. On non-btrfs file systems, this line type is identical to I<d>\&.
de: Erstellt wie bei I<v> einen Teildatenträger oder Verzeichnis, weist den Teildatenträger aber der gleichen abstrakteren Kontingentgruppe wie dem Eltern-Teildatenträger zu\&. Dies stellt sicher, dass abstraktere Begrenzungen und Buchführungen auf den Eltern-Teildatenträger auch den angegebenen Teildatenträger einschließen\&. Auf von Btrfs verschiedenen Dateisystemen ist diese Zeile zu I<d> identisch\&.

source: If the subvolume already exists, no change to the quota hierarchy is made, regardless of whether the subvolume is already attached to a quota group or not\&. Also see I<Q> below\&. See B<btrfs-qgroup>(8) for details about the btrfs quota group concept\&.
de: Falls der Teildatenträger bereits existiert, erfolgen an der Kontingenthierarchie keine Änderungen, unabhängig davon, ob der Teildatenträger bereits an die Kontingentgruppe angehängt ist\&. Siehe auch I<Q> unten\&. Siehe B<btrfs-qgroup>(8) für Details über das Btrfs-Kontingentgruppenkonzept\&.

source: Create the subvolume or directory the same as I<v>, but assign the new subvolume to a new leaf quota group\&. Instead of copying the higher-level quota group assignments from the parent as is done with I<q>, the lowest quota group of the parent subvolume is determined that is not the leaf quota group\&. Then, an "intermediary" quota group is inserted that is one level below this level, and shares the same ID part as the specified subvolume\&. If no higher-level quota group exists for the parent subvolume, a new quota group at level 255 sharing the same ID as the specified subvolume is inserted instead\&. This new intermediary quota group is then assigned to the parent subvolume\*(Aqs higher-level quota groups, and the specified subvolume\*(Aqs leaf quota group is assigned to it\&.
de: Erstellt wie bei I<v> einen Teildatenträger oder ein Verzeichnis, weist dem neuen Teildatenträger eine neue Blatt-Kontingentgruppe zu\&. Statt wie bei I<q> die abstraktere Kontingentgruppenzuweisung vom Eltern-Teildatenträger zu kopieren, wird die niedrigste Kontingentgruppe des Eltern-Teildatenträgers bestimmt, die nicht in der Blatt-Kontingentgruppe ist\&. Dann wird eine »Zwischen«-Kontingentgruppe eingefügt, die eine Stufe unterhalb dieser Stufe ist und sich den Kennungsteil mit dem angegebenen Teildatenträger teilt\&. Falls keine abstraktere Kontingentgruppe für den Eltern-Teildatenträger existiert, wird stattdessen eine neue Kontingentgruppe auf Stufe 255 eingefügt, die die gleiche Kennung wie der angegebene Teildatenträger hat\&. Diese neue Zwischenkontingentgruppe wird dann der abstrakten Kontingentgruppe des Eltern-Teildatenträgers zugewiesen und die festgelegte Blatt-Kontingentgruppe des Teildatenträgers wird dieser zugewiesen\&.

source: Effectively, this has a similar effect as I<q>, however introduces a new higher-level quota group for the specified subvolume that may be used to enforce limits and accounting to the specified subvolume and children subvolume created within it\&. Thus, by creating subvolumes only via I<q> and I<Q>, a concept of "subtree quotas" is implemented\&. Each subvolume for which I<Q> is set will get a "subtree" quota group created, and all child subvolumes created within it will be assigned to it\&. Each subvolume for which I<q> is set will not get such a "subtree" quota group, but it is ensured that they are added to the same "subtree" quota group as their immediate parents\&.
de: Effektiv hat dies eine ähnliche Wirkung wie I<q>, führt allerdings eine neue abstrakte Kontingentgruppe für den angegebenen Teildatenträger ein, die zum Durchsetzen von Begrenzungen und Buchführungen für den angegebenen Teildatenträger und innerhalb darin erstellter Kinder-Teildatenträger verwandt werden kann\&. Werden daher Teildatenträger nur mittels I<q> und I<Q> erstellt, wird ein »Unterbaumkontingente«-Konzept implementiert\&. Für jeden Teildatenträger, für das I<Q> gesetzt ist, wird eine »Unterbaum«-Kontingentgruppe erstellt und alle darin erstellten Kinder-Teildatenträger werden ihr zugewiesen\&. Jeder Teildatenträger, für den I<q> gesetzt ist, wird keine solche »Unterbaum«-Kontingentgruppe erhalten, aber es wird sichergestellt, dass er zu der gleichen »Unterbaum«-Kontingentgruppe wie sein direkter Eltern-Teildatenträger zugewiesen wird\&.
