Repository: sebras/manpages-l10n
Catalog: po/*/man5/veritytab.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: veritytab - Configuration for verity block devices
de: veritytab - Konfiguration für Verity-Blockgeräte

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: The /etc/veritytab file describes verity protected block devices that are set up during system boot\&.
de: Die Datei /etc/veritytab beschreibt Verity-geschützte Blockgeräte, die während der Systemstartphase eingerichtet werden\&.

source: Empty lines and lines starting with the "#" character are ignored\&. Each of the remaining lines describes one verity protected block device\&. Fields are delimited by white space\&.
de: Leere Zeilen und Zeilen, die mit »#« beginnen, werden ignoriert\&. Jede der verbleibenden Zeilen beschreibt eines der Verity-geschützten Blockgeräte\&. Felder werden durch Leerraum getrennt\&.

source: Each line is in the form
de: Jede Zeile hat die Form

source: I<volume-name> I<data-device> I<hash-device> I<roothash> I<options>
de: I<Laufwerksname> I<Datengerät> I<Hash-Gerät> I<Wurzel-Hash> I<Optionen>

source: The first four fields are mandatory, the remaining one is optional\&.
de: Die ersten vier Felder sind verpflichtend, das verbleibende ist optional\&.

source: The first field contains the name of the resulting verity volume; its block device is set up below /dev/mapper/\&.
de: Das erste Feld enthält den Namen des sich ergebenden Verity-Datenträgers; sein Block-Gerät wird unterhalb von /dev/mapper/ eingerichtet\&.

source: The second field contains a path to the underlying block data device, or a specification of a block device via "UUID=" followed by the UUID\&.
de: Das zweite Feld enthält einen Pfad zu dem zugrundeliegenden Blockdatengerät oder eine Festlegung eines Blockgerätes mittels »UUID=« gefolgt von der UUID\&.

source: The third field contains a path to the underlying block hash device, or a specification of a block device via "UUID=" followed by the UUID\&.
de: Das dritte Feld enthält einen Pfad zu dem zugrundeliegenden Block-Hash-Gerät oder eine Festlegung eines Blockgerätes mittels »UUID=« gefolgt von der UUID\&.

source: The fourth field is the "roothash" in hexadecimal\&.
de: Das vierte Feld ist der »Wurzel-Hash« in hexadezimaler Schreibweise\&.

source: The fifth field, if present, is a comma-delimited list of options\&. The following options are recognized:
de: Das fünfte Feld, falls vorhanden, ist eine Kommata-getrennte Liste von Optionen\&. Die folgenden Felder werden erkannt:

source: Defines what to do if a data verity problem is detected (data corruption)\&. Without these options kernel fails the IO operation with I/O error\&. With "--ignore-corruption" option the corruption is only logged\&. With "--restart-on-corruption" or "--panic-on-corruption" the kernel is restarted (panicked) immediately\&. (You have to provide way how to avoid restart loops\&.)
de: Definiert, was zu tun ist, wenn ein Daten-Verity-Problem (Datenkorruption) festgestellt wurde\&. Ohne diese Optionen lässt der Kernel die E/A-Aktion mit einem E/A-Fehler fehlschlagen\&. Mit der Option »--ignore-corruption« wird die Korruption nur protokolliert\&. Mit »--restart-on-corruption« oder »--panic-on-corruption« wird der Kernel sofort neu gestartet (Panik)\&. (Sie müssen dafür sorgen, dass Neustart-Schleifen vermieden werden\&.)

source: Instruct kernel to not verify blocks that are expected to contain zeroes and always directly return zeroes instead\&. WARNING: Use this option only in very specific cases\&. This option is available since Linux kernel version 4\&.5\&.
de: Weist den Kernel an, keine Blöcke zu verifizieren, von denen erwartet wird, dass sie nur Nullen enthalten, und dass er stattdessen direkt Nullen zurückliefern soll\&. WARNUNG: Verwenden Sie diese Option nur in sehr bestimmten Fällen\&. Diese Option ist seit Kernelversion 4\&.5 verfügbar\&.

source: Instruct kernel to verify blocks only the first time they are read from the data device, rather than every time\&. WARNING: It provides a reduced level of security because only offline tampering of the data device\*(Aqs content will be detected, not online tampering\&. This option is available since Linux kernel version 4\&.17\&.
de: Weist den Kernel an, Blöcke nur beim erstmaligen Einlesen vom Datengerät statt jedes Mal zu überprüfen\&: WARNUNG: Dies reduziert die Datensicherheit, da nur Offline-Verfälschungen des Inhaltes des Datengeräts erkannt werden, aber keine Online-Verfälschung\&. Diese Option ist seit Kernelversion 4\&.17 verfügbar\&.

source: B<root-hash-signature=>I<PATH>B<|base64:>I<HEX>
de: B<root-hash-signature=>I<PFAD>B<|base64:>I<HEX>

source: A base64 string encoding the root hash signature prefixed by "base64:" or a path to roothash signature file used to verify the root hash (in kernel)\&. This feature requires Linux kernel version 5\&.4 or more recent\&.
de: Eine base64-Zeichenkette, die die Wurzel-Hash-Signatur kodiert und der »base64:« oder ein Pfad zu einer Wurzel-Hash-Signaturdatei zur Überpfüung des Wurzel-Hashes (im Kernel) vorangestellt ist\&. Diese Funktionalität benötigt einen Linux-Kernel der Version 5\&.4 oder neuer\&.

source: Marks this veritysetup device as requiring network\&. It will be started after the network is available, similarly to B<systemd.mount>(5) units marked with B<_netdev>\&. The service unit to set up this device will be ordered between remote-fs-pre\&.target and remote-veritysetup\&.target, instead of veritysetup-pre\&.target and veritysetup\&.target\&.
de: Markiert dieses Veritysetup-Gerät als netzwerkabhängig\&. Es wird gestartet, sobald das Netzwerk verfügbar ist, ähnlich wie B<systemd.mount>(5)-Units, die mit B<_netdev> markiert sind\&. Die Dienste-Unit zur Einrichtung dieses Gerätes wird zwischen remote-fs-pre\&.target und remote-veritysetup\&.target einsortiert, statt zwischen veritysetup-pre\&.target und veritysetup\&.target\&.

source: Hint: if this device is used for a mount point that is specified in B<fstab>(5), the B<_netdev> option should also be used for the mount point\&. Otherwise, a dependency loop might be created where the mount point will be pulled in by local-fs\&.target, while the service to configure the network is usually only started I<after> the local file system has been mounted\&.
de: Tipp: Falls dieses Gerät für einen in B<fstab>(5) festgelegten Einhängepunkt verwandt wird, sollte die Option B<_netdev> auch für den Einhängepunkt verwandt werden\&. Andernfalls könnte eine Abhängigkeitsschleife erstellt werden, bei der der Einhängepunkt durch local-fs\&.target hereingezogen, während der Dienst zur Konfiguration des Netzwerkes normalerweise I<nach> dem Einhängen des lokalen Dateisystems gestartet wird\&.

source: This device will not be added to veritysetup\&.target\&. This means that it will not be automatically enabled on boot, unless something else pulls it in\&. In particular, if the device is used for a mount point, it\*(Aqll be enabled automatically during boot, unless the mount point itself is also disabled with B<noauto>\&.
de: Dieses Gerät wird nicht zu veritysetup\&.target hinzugefügt\&. Dies bedeutet, dass es beim Systemstart nicht automatisch aktiviert wird, außer etwas anderes zieht es herein\&. Falls nämlich das Gerät für einen Einhängepunkt verwandt wird, wird es während des Systemstarts automatisch hereingezogen, außer der Einhängepunkt selbst ist auch mit B<noauto> deaktiviert\&.

source: This device will not be a hard dependency of veritysetup\&.target\&. It\*(Aqll still be pulled in and started, but the system will not wait for the device to show up and be enabled, and boot will not fail if this is unsuccessful\&. Note that other units that depend on the enabled device may still fail\&. In particular, if the device is used for a mount point, the mount point itself also needs to have the B<nofail> option, or the boot will fail if the device is not enabled successfully\&.
de: Dieses Gerät wird keine harte Abhängigkeit von veritysetup\&.target sein\&. Es wird weiterhin hereingezogen und gestartet, aber das System wird nicht darauf warten, dass das Gerät auftaucht und aktiviert wird und der Systemstart wird nicht fehlschlagen, falls dies nicht erfolgreich passieren kann\&. Beachten Sie, dass andere Units, die von dem aktivierten Gerät abhängen, weiterhin fehlschlagen können\&. Falls nämlich das Gerät für einen Einhängepunkt verwandt wird, muss der Einhängepunkt selbst auch über die Option B<nofail> verfügen oder der Systemstart wird fehlschlagen, falls das Gerät nicht erfolgreich aktiviert wurde\&.

source: Setup this verity protected block device in the initramfs, similarly to B<systemd.mount>(5) units marked with B<x-initrd\&.mount>\&.
de: Richtet dieses Verity-geschützte Blockgerät in der Initramfs ein, ähnlich wie mit B<x-initrd\&.mount> markierte B<systemd.mount>(5)-Units\&.

source: Although it\*(Aqs not necessary to mark the mount entry for the root file system with B<x-initrd\&.mount>, B<x-initrd\&.attach> is still recommended with the verity protected block device containing the root file system as otherwise systemd will attempt to detach the device during the regular system shutdown while it\*(Aqs still in use\&. With this option the device will still be detached but later after the root file system is unmounted\&.
de: Obwohl es nicht notwendig ist, den Einhängeeintrag für das Wurzeldateisystem mit B<x-initrd\&.mount> zu markieren, wird B<x-initrd\&.attach> weiterhin mit den Verity-geschützten Blockgeräten empfohlen, die das Wurzeldateisystem enthalten, da Systemd andernfalls versuchen wird, das Gerät während des normalen Herunterfahrens abzutrennen, während es noch benutzt wird\&. Mit dieser Option wird dieses Gerät weiterhin abgetrennt, aber später, nachdem das Wurzeldateisystem ausgehängt ist\&.

source: All other verity protected block devices that contain file systems mounted in the initramfs should use this option\&.
de: Alle anderen Verity-geschützten Blockgeräte, die in der Initramfs eingehängte Dateisysteme enthalten, sollten diese Option verwenden\&.

source: At early boot and when the system manager configuration is reloaded, this file is translated into native systemd units by B<systemd-veritysetup-generator>(8)\&.
de: In der frühen Systemstartphase und wenn die Systemverwalterkonfiguration neu geladen wird, wird diese Datei durch B<systemd-veritysetup-generator>(8) in native Systemd-Units übersetzt\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&/etc/veritytab example>
de: B<Beispiel\ \&1.\ \&/etc/veritytab-Beispiel>

source: Set up two verity protected block devices\&. One using device blocks, another using files\&.
de: Richtet zwei Verity-geschützte Blockgeräte ein\&. Eines mittels Geräteblöcken, ein anderes mittels Dateien\&.

source: SEE ALSO
de: SIEHE AUCH

source: Setup this verity protected block device in the initrd, similarly to B<systemd.mount>(5) units marked with B<x-initrd\&.mount>\&.
de: Richtet dieses Verity-geschützte Blockgerät in der Initrd ein, ähnlich wie mit B<x-initrd\&.mount> markierte B<systemd.mount>(5)-Units\&.

source: All other verity protected block devices that contain file systems mounted in the initrd should use this option\&.
de: Alle anderen Verity-geschützten Blockgeräte, die in der Initrd eingehängte Dateisysteme enthalten, sollten diese Option verwenden\&.
