Repository: sebras/manpages-l10n
Catalog: po/secondary-archlinux/man5/systemd.resource-control.5.po
Languages: de

source: Turns on delegation of further resource control partitioning to processes of the unit\&. Units where this is enabled may create and manage their own private subhierarchy of control groups below the control group of the unit itself\&. For unprivileged services (i\&.e\&. those using the I<User=> setting) the unit\*(Aqs control group will be made accessible to the relevant user\&. When enabled the service manager will refrain from manipulating control groups or moving processes below the unit\*(Aqs control group, so that a clear concept of ownership is established: the control group tree above the unit\*(Aqs control group (i\&.e\&. towards the root control group) is owned and managed by the service manager of the host, while the control group tree below the unit\*(Aqs control group is owned and managed by the unit itself\&. Takes either a boolean argument or a list of control group controller names\&. If true, delegation is turned on, and all supported controllers are enabled for the unit, making them available to the unit\*(Aqs processes for management\&. If false, delegation is turned off entirely (and no additional controllers are enabled)\&. If set to a list of controllers, delegation is turned on, and the specified controllers are enabled for the unit\&. Note that additional controllers than the ones specified might be made available as well, depending on configuration of the containing slice unit or other units contained in it\&. Note that assigning the empty string will enable delegation, but reset the list of controllers, all assignments prior to this will have no effect\&. Defaults to false\&.
de: Schaltet die Delegation weiterer Ressourcensteuerungspartitionierung an Prozesse der Unit ein\&. Units, bei denen dies aktiviert ist, können ihre eigenen Unterhierarchien von Control-Gruppen unterhalb der Control-Gruppe der Unit selbst erstellen und verwalten\&. Für unprivilegiert Dienste (d\&.h\&. solchen, die die Einstellung I<User=> verwenden) wird die Control-Gruppe der Unit für den relevanten Benutzer zugreifbar gemacht\&. Wenn aktiviert wird der Dienstevewalter es unterlassen, die Control-Gruppen zu verändern oder Prozesse unterhalb der Control-Gruppe der Unit zu schieben, so dass ein klares Konzept der Eigentümerschaft etabliert ist: der Control-Gruppenbaum oberhalb der Control-Gruppe der Unit (d\&.h\&. in Richtung der Wurzel der Control-Gruppe) gehört dem Diensteverwalter der Rechners, der sie auch verwaltet, während der Control-Gruppenbaum unterhalb der Control-Gruppe der Unit der Unit selbst gehört, die diesen auch verwaltet\&. Akzeptiert entweder ein logisches Argument oder eine Liste von Control-Gruppen-Controller-Namen\&. Falls wahr, wird die Delegierung eingeschaltet und alle unterstützten Controller werden für die Unit aktiviert und damit den Prozessen der Unit zur Verwaltung verfügbar gemacht\&. Falls falsch wird die Delegation komplett ausgeschaltet (und keine zusätzlichen Controller werden aktiviert)\&. Falls auf eine Liste von Controllern gesetzt, wird die Delegation eingeschaltet und die festgelegten Controller werden für die Unit aktiviert\&. Beachten Sie, dass abhängig von der Konfiguration der enthaltenden Unit oder anderen, darin enthaltenen Units zusätzliche Controller (neben den festgelegten) auch verfügbar gemacht werden könnten\&. Beachten Sie, dass die Zuweisung der leeren Zeichenkette die Delegation aktivieren, die Liste der Controller aber zurücksetzen wird; alle Zuweisungen vorher ohne Wirkung bleiben werden\&. Standardmäßig falsch\&.

source: Note that controller delegation to less privileged code is only safe on the unified control group hierarchy\&. Accordingly, access to the specified controllers will not be granted to unprivileged services on the legacy hierarchy, even when requested\&.
de: Bechten Sie, dass Controller-Delegation an weniger privilegierten Code nur auf der vereinigten Control-Gruppen-Hierarchie sicher ist\&. Entsprechend wird der Zugriff auf die festgelegten Controller nicht an unprivilegierte Dienste auf der veralteten Hierarchie gewährt, selbst falls dies angefragt wurde\&.

source: The following controller names may be specified: B<cpu>, B<cpuacct>, B<io>, B<blkio>, B<memory>, B<devices>, B<pids>\&. Not all of these controllers are available on all kernels however, and some are specific to the unified hierarchy while others are specific to the legacy hierarchy\&. Also note that the kernel might support further controllers, which aren\*(Aqt covered here yet as delegation is either not supported at all for them or not defined cleanly\&.
de: Die folgenden Controller-Namen können festgelegt werden: B<cpu>, B<cpuacct>, B<io>, B<blkio>, B<memory>, B<devices>, B<pids>\&. Nicht alle dieser Controller sind allerdings auf allen Kerneln verfügbar und einige sind spezifisch für die vereinigte Hierarchie während andere für die veraltete Hierarchie spezifisch sind\&. Beachten Sie auch, dass der Kernel weitere Controller unterstützen könnte, die hier noch nicht berücksichtigt sind, da Delegation hierfür überhaupt noch nicht unterstützt wird oder noch nicht sauber definiert ist\&.

source: DEPRECATED OPTIONS
de: MISSBILLIGTE OPTIONEN

source: The following options are deprecated\&. Use the indicated superseding options instead:
de: Die folgenden Optionen werden missbilligt\&. Verwenden Sie stattdessen die angezeigten Optionen:

source: I<CPUShares=>I<weight>, I<StartupCPUShares=>I<weight>
de: I<CPUShares=>I<Gewicht>, I<StartupCPUShares=>I<Gewicht>

source: Assign the specified CPU time share weight to the processes executed\&. These options take an integer value and control the "cpu\&.shares" control group attribute\&. The allowed range is 2 to 262144\&. Defaults to 1024\&. For details about this control group attribute, see \m[blue]B<sched-design-CFS\&.txt>\m[]\&\s-2\u[4]\d\s+2\&. The available CPU time is split up among all units within one slice relative to their CPU time share weight\&.
de: Weist dem asugeführten Prozess das festgelegten CPU-Zeitanteilsgewicht zu\&. Diese Optionen akzeptieren einen Ganzzahlwert und steuern das Control-Gruppenattribut »cpu\&.shares«\&. Der erlaubte Bereich ist 2 bis 262144\&. Standardmäßig 1024\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<sched-design-CFS\&.txt>\m[]\&\s-2\u[4]\d\s+2\&. Die verfügbare CPU-Zeit wird zwischen allen Units innerhalb einer Scheibe relativ zu ihren CPU-Zeitanteilsgewichten aufgeteilt\&.

source: While I<StartupCPUShares=> only applies to the startup phase of the system, I<CPUShares=> applies to normal runtime of the system, and if the former is not set also to the startup phase\&. Using I<StartupCPUShares=> allows prioritizing specific services at boot-up differently than during normal runtime\&.
de: Während I<StartupCPUShares=> nur für die Hochfahrphase des Systems gilt, gilt I<CPUShares=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hochfahrphase\&. Durch Verwendung von I<StartupCPUShares=> ist eine abweichende Priorisierung bestimmter Dienste während des Hochfahrens des Systems im Vergleich zur normalen Laufzeit möglich\&.

source: These settings are deprecated\&. Use I<CPUWeight=> and I<StartupCPUWeight=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<CPUWeight=> und I<StartupCPUWeight=>\&.

source: I<MemoryLimit=>I<bytes>
de: I<MemoryLimit=>I<Byte>

source: Specify the limit on maximum memory usage of the executed processes\&. The limit specifies how much process and kernel memory can be used by tasks in this unit\&. Takes a memory size in bytes\&. If the value is suffixed with K, M, G or T, the specified memory size is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes (with the base 1024), respectively\&. Alternatively, a percentage value may be specified, which is taken relative to the installed physical memory on the system\&. If assigned the special value "infinity", no memory limit is applied\&. This controls the "memory\&.limit_in_bytes" control group attribute\&. For details about this control group attribute, see \m[blue]B<memory\&.txt>\m[]\&\s-2\u[7]\d\s+2\&.
de: Legt die maximale Speicherbegrenzung der ausgeführten Prozesse fest\&. Die Begrenzung legt fest, wieviel Prozess- und Kernelspeicher von den Prozessen in dieser Unit verwandt werden kann\&. Akzeptiert eine Speichergröße in Byte\&. Falls dem Wert K, M, G oder T angehängt wird, wird die festgelegte Speichergröße in Kilobyte, Megabyte, Gigabyte bzw. Terabytes (zur Basis 1024) ausgewertet\&. Alternativ kann ein Prozentwert festgelegt werden, der relativ zum installierten physischen Speicher im System akzeptiert wird\&. Falls zugewiesen besagt der besondere Wert »infinity«, dass keine Speicherbegrenzung angewandt wird\&. Dies steuert das Control-Gruppenattribut »memory\&.limit_in_bytes«\&. Für Details über dieses Control-Gruppenattribut siehe \m[blue]B<memory\&.txt>\m[]\&\s-2\u[7]\d\s+2\&.

source: This setting is deprecated\&. Use I<MemoryMax=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<MemoryMax=>\&.

source: Turn on Block I/O accounting for this unit, if the legacy control group hierarchy is used on the system\&. Takes a boolean argument\&. Note that turning on block I/O accounting for one unit will also implicitly turn it on for all units contained in the same slice and all for its parent slices and the units contained therein\&. The system default for this setting may be controlled with I<DefaultBlockIOAccounting=> in B<systemd-system.conf>(5)\&.
de: Schaltet Block-E/A-Buchführung für diese Unit ein, falls die veraltete Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Akzeptiert ein logisches Argument\&. Beachten Sie, dass das Einschalten der Block-E/A-Buchführung für eine Unit dies implizit auch für alle Units, die in der gleichen Scheibe enthalten sind und für alle Elternscheiben und die darin befindlichen Units einschaltet\&. Die Systemvorgabe für diese Einstellung kann durch I<DefaultBlockIOAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: This setting is deprecated\&. Use I<IOAccounting=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<IOAccounting=>\&.

source: I<BlockIOWeight=>I<weight>, I<StartupBlockIOWeight=>I<weight>
de: I<BlockIOWeight=>I<Gewicht>, I<StartupBlockIOWeight=>I<Gewicht>

source: Set the default overall block I/O weight for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a single weight value (between 10 and 1000) to set the default block I/O weight\&. This controls the "blkio\&.weight" control group attribute, which defaults to 500\&. For details about this control group attribute, see \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&. The available I/O bandwidth is split up among all units within one slice relative to their block I/O weight\&.
de: Setzt das Vorgabe-Gesamt-Block-E/A-Gewicht für die ausgeführten Prozesse, falls die veraltete Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Akzeptiert einen einzelnen Gewichtswert (zwischen 10 und 10000), um das Vorgabe-Block-E/A-Gewicht zu setzen\&. Dies steuert das Control-Gruppen-Attribut »blkio\&.weight«, das standardmäßig 500 beträgt\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[2]\d\s+2\&. Die verfügbare E/A-Bandbreite wird zwischen allen Units innerhalb einer Scheibe relativ zu ihrem Block-E/A-Gewicht aufgeteilt\&.

source: While I<StartupBlockIOWeight=> only applies to the startup phase of the system, I<BlockIOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup phase\&. This allows prioritizing specific services at boot-up differently than during runtime\&.
de: Während I<StartupBlockIOWeight=> nur für die Hochfahrphase des Systems gilt, gilt I<BlockIOWeight=> während der normalen Laufzeit des Systems und falls ersteres nicht gesetzt ist, auch für die Hochfahrphase\&. Dies erlaubt eine abweichende Priorisierung bestimmter Dienste während des Hochfahrens des Systems im Vergleich zur normalen Laufzeit\&.

source: Implies "BlockIOAccounting=true"\&.
de: Impliziert »BlockIOAccounting=true«\&.

source: These settings are deprecated\&. Use I<IOWeight=> and I<StartupIOWeight=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<IOWeight=> und I<StartupIOWeight=>\&.

source: I<BlockIODeviceWeight=>I<device>I< >I<weight>
de: I<BlockIODeviceWeight=>I<Gerät>I< >I<Gewicht>

source: Set the per-device overall block I/O weight for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a weight value to specify the device specific weight value, between 10 and 1000\&. (Example: "/dev/sda 500")\&. The file path may be specified as path to a block device node or as any other file, in which case the backing block device of the file system of the file is determined\&. This controls the "blkio\&.weight_device" control group attribute, which defaults to 1000\&. Use this option multiple times to set weights for multiple devices\&. For details about this control group attribute, see \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt das geräteabhängige Gesamt-Block-E/A-Gewicht für die ausgeführten Prozesse, falls die veraltete Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Akzeptiert eine Leerraum-getrennte Liste von Paaren von einem Dateipfad und einem Gewichtswert, um den geräteabhängigen Gewichtswert, zwischen 10 und 1000, festzulegen\&. (Beispiel: »/dev/sda 500«)\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei festgelegt werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Dies steuert das Control-Gruppen-Attribut »blkio\&.weight_device«, das standardmäßig 1000 beträgt\&. Verwenden Sie die Option mehrfach, um Gewichte für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.

source: This setting is deprecated\&. Use I<IODeviceWeight=> instead\&.
de: Diese Einstellung ist missbilligt\&. Verwenden Sie stattdessen I<IODeviceWeight=>\&.

source: I<BlockIOReadBandwidth=>I<device>I< >I<bytes>, I<BlockIOWriteBandwidth=>I<device>I< >I<bytes>
de: I<BlockIOReadBandwidth=>I<Gerät>I< >I<Byte>, I<BlockIOWriteBandwidth=>I<Gerät>I< >I<Byte>

source: Set the per-device overall block I/O bandwidth limit for the executed processes, if the legacy control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a bandwidth value (in bytes per second) to specify the device specific bandwidth\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the bandwidth is suffixed with K, M, G, or T, the specified bandwidth is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M")\&. This controls the "blkio\&.throttle\&.read_bps_device" and "blkio\&.throttle\&.write_bps_device" control group attributes\&. Use this option multiple times to set bandwidth limits for multiple devices\&. For details about these control group attributes, see \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&.
de: Setzt die gerätebezogene Gesamt-Block-E/A-Bandbreitebegrenzung für den ausgeführten Prozess, falls die veraltete Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Akzeptiert ein Leerraum-getrenntes Paar eines Dateipfades und eines Bandbreitenwertes (in Byte pro Sekunde), um die gerätespezifische Bandbreite festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei festgelegt werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls der Bandbreite K, M, G oder T angehängt ist, wird die Bandbreite als Kilobyte, Megabyte, Gigabyte bzw. Terabyte zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M«)\&. Dies steuert die Control-Gruppen-Attribute »blkio\&.throttle\&.read_bps_device« und »blkio\&.throttle\&.write_bps_device«\&. Verwenden Sie diese Option mehrfach, um Bandbreitenbegrenzungen für mehrere Geräte zu setzen\&. Für Details über diese Control-Gruppen-Attribut siehe \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&.

source: These settings are deprecated\&. Use I<IOReadBandwidthMax=> and I<IOWriteBandwidthMax=> instead\&.
de: Diese Einstellungen sind missbilligt\&. Verwenden Sie stattdessen I<IOReadBandwidthMax=> und I<IOWriteBandwidthMax=>\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<systemd>(1), B<systemd.unit>(5), B<systemd.service>(5), B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.socket>(5), B<systemd.mount>(5), B<systemd.swap>(5), B<systemd.exec>(5), B<systemd.directives>(7), B<systemd.special>(7), The documentation for control groups and specific controllers in the Linux kernel: \m[blue]B<cgroups\&.txt>\m[]\&\s-2\u[3]\d\s+2, \m[blue]B<cpuacct\&.txt>\m[]\&\s-2\u[9]\d\s+2, \m[blue]B<memory\&.txt>\m[]\&\s-2\u[7]\d\s+2, \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&.
de: B<systemd>(1), B<systemd.unit>(5), B<systemd.service>(5), B<systemd.slice>(5), B<systemd.scope>(5), B<systemd.socket>(5), B<systemd.mount>(5), B<systemd.swap>(5), B<systemd.exec>(5), B<systemd.directives>(7), B<systemd.special>(7), Die Dokumentation für Control-Gruppen und bestimmte Controller im Linux-Kernel: \m[blue]B<cgroups\&.txt>\m[]\&\s-2\u[3]\d\s+2, \m[blue]B<cpuacct\&.txt>\m[]\&\s-2\u[9]\d\s+2, \m[blue]B<memory\&.txt>\m[]\&\s-2\u[7]\d\s+2, \m[blue]B<blkio-controller\&.txt>\m[]\&\s-2\u[8]\d\s+2\&.

source: NOTES
de: ANMERKUNGEN

source: New Control Group Interfaces
de: Neue Control-Group-Schnittstellen
