Repository: sebras/manpages-l10n
Catalog: po/secondary-archlinux/man5/systemd.resource-control.5.po
Languages: de

source: Set the default overall block I/O weight for the executed processes, if the unified control group hierarchy is used on the system\&. Takes a single weight value (between 1 and 10000) to set the default block I/O weight\&. This controls the "io\&.weight" control group attribute, which defaults to 100\&. For details about this control group attribute, see \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&. The available I/O bandwidth is split up among all units within one slice relative to their block I/O weight\&.
de: Setzt das Vorgabe-Gesamt-Block-E/A-Gewicht für die ausgeführten Prozesse, falls die vereinigte Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Akzeptiert einen einzelnen Gewichtswert (zwischen 1 und 10000), um das Vorgabe-Block-E/A-Gewicht zu setzen\&. Dies steuert das Control-Gruppen-Attribut »io\&.weight«, das standardmäßig 100 beträgt\&. Für Details über dieses Control-Gruppen-Attribut, siehe \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&. Die verfügbare E/A-Bandbreite wird zwischen allen Units innerhalb einer Scheibe relativ zu ihrem Block-E/A-Gewicht aufgeteilt\&.

source: While I<StartupIOWeight=> only applies to the startup phase of the system, I<IOWeight=> applies to the later runtime of the system, and if the former is not set also to the startup phase\&. This allows prioritizing specific services at boot-up differently than during runtime\&.
de: Während I<StartupIOWeight=> nur in der Hochfahrphase des Systems angewandt wird, wird I<IOWeight=> später zur Laufzeit des Systems angewandt und falls erstere nicht gesetzt ist, auch während der Hochfahrphase\&. Dies erlaubt es, bestimmte Dienste beim Hochfahren anders als zur Laufzeit zu priorisieren\&.

source: Implies "IOAccounting=true"\&.
de: Impliziert »IOAccounting=true«\&.

source: These settings replace I<BlockIOWeight=> and I<StartupBlockIOWeight=> and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellungen ersetzen I<BlockIOWeight=> und I<StartupBlockIOWeight=> und deaktivieren Eisntellungen, die mit I<BlockIO> oder I<StartupBlockIO> anfangen\&.

source: I<IODeviceWeight=>I<device>I< >I<weight>
de: I<IODeviceWeight=>I<Gerät>I< >I<Gewicht>

source: Set the per-device overall block I/O weight for the executed processes, if the unified control group hierarchy is used on the system\&. Takes a space-separated pair of a file path and a weight value to specify the device specific weight value, between 1 and 10000\&. (Example: "/dev/sda 1000")\&. The file path may be specified as path to a block device node or as any other file, in which case the backing block device of the file system of the file is determined\&. This controls the "io\&.weight" control group attribute, which defaults to 100\&. Use this option multiple times to set weights for multiple devices\&. For details about this control group attribute, see \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.
de: Setzt das gerätebezogene Gesamt-Block-E/A-Gewicht für den ausgeführten Prozess, falls die vereinigte Control-Gruppen-Hiererachie auf dem System verwandt wird\&. Akzeptiert ein Leerraum getrenntes Paar eines Dateipfades und eines Gewichtwertes, um den gerätespezifischen Gewichtswert zwischen 1 und 10000 festzulegen\&. (Beispiel: "/dev/sda 1000")\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei festgelegt werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Dies steuert das Control-Gruppen-Attribut »io\&.weight«, das standardmäßig 100 ist\&. Verwenden Sie diese Option mehrfach, um Gewichte für mehrere Geräte zu setzen\&. Für Details über dieses Control-Gruppen-Attribut siehe \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.

source: This setting replaces I<BlockIODeviceWeight=> and disables settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellung ersetzt I<BlockIODeviceWeight=> und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: I<IOReadBandwidthMax=>I<device>I< >I<bytes>, I<IOWriteBandwidthMax=>I<device>I< >I<bytes>
de: I<IOReadBandwidthMax=>I<Gerät>I< >I<Byte>, I<IOWriteBandwidthMax=>I<Gerät>I< >I<Byte>

source: Set the per-device overall block I/O bandwidth maximum limit for the executed processes, if the unified control group hierarchy is used on the system\&. This limit is not work-conserving and the executed processes are not allowed to use more even if the device has idle capacity\&. Takes a space-separated pair of a file path and a bandwidth value (in bytes per second) to specify the device specific bandwidth\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the bandwidth is suffixed with K, M, G, or T, the specified bandwidth is parsed as Kilobytes, Megabytes, Gigabytes, or Terabytes, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M")\&. This controls the "io\&.max" control group attributes\&. Use this option multiple times to set bandwidth limits for multiple devices\&. For details about this control group attribute, see \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.
de: Setzt die gerätebezogene maximale Gesamt-Block-E/A-Bandbreitebegrenzung für den ausgeführten Prozess, falls die vereinigte Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Diese Begrenzung ist nicht arbeitserhaltend und den ausgeführten Prozessen wird nicht mehr erlaubt, selbst falls das Gerät Leerlaufkapazität hat\&. Akzeptiert ein Leerraum-getrenntes Paar eines Dateipfades und eines Bandbreitenwertes (in Byte pro Sekunde), um die gerätespezifische Bandbreite festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei festgelegt werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls der Bandbreite K, M, G oder T angehängt ist, wird die Bandbreite als Kilobyte, Megabyte, Gigabyte bzw. Terabyte zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 5M«)\&. Dies steuert das Control-Gruppen-Attribut »io\&.max«\&. Verwenden Sie diese Option mehrfach, um Bandbreitenbegrenzungen für mehrere Geräte zu setzen\&. Für Details über diese Control-Gruppen-Attribut siehe \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.

source: These settings replace I<BlockIOReadBandwidth=> and I<BlockIOWriteBandwidth=> and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellung ersetzt I<BlockIOReadBandwidth=> und I<BlockIOWriteBandwidth=> und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: I<IOReadIOPSMax=>I<device>I< >I<IOPS>, I<IOWriteIOPSMax=>I<device>I< >I<IOPS>
de: I<IOReadIOPSMax=>I<Gerät>I< >I<EAPS>, I<IOWriteIOPSMax=>I<Gerät>I< >I<EAPS>

source: Set the per-device overall block I/O IOs-Per-Second maximum limit for the executed processes, if the unified control group hierarchy is used on the system\&. This limit is not work-conserving and the executed processes are not allowed to use more even if the device has idle capacity\&. Takes a space-separated pair of a file path and an IOPS value to specify the device specific IOPS\&. The file path may be a path to a block device node, or as any other file in which case the backing block device of the file system of the file is used\&. If the IOPS is suffixed with K, M, G, or T, the specified IOPS is parsed as KiloIOPS, MegaIOPS, GigaIOPS, or TeraIOPS, respectively, to the base of 1000\&. (Example: "/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 1K")\&. This controls the "io\&.max" control group attributes\&. Use this option multiple times to set IOPS limits for multiple devices\&. For details about this control group attribute, see \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.
de: Setzt die gerätebezogene maximale Gesamt-Block-E/A-EA-Pro-Sekunden-Begrenzung für den ausgeführten Prozess, falls die vereinigte Control-Gruppen-Hierarchie auf dem System verwandt wird\&. Diese Begrenzung ist nicht arbeitserhaltend und den ausgeführten Prozessen wird nicht mehr erlaubt, selbst falls das Gerät Leerlaufkapazität hat\&. Akzeptiert ein Leerraum-getrenntes Paar eines Dateipfades und eines EAPS-Wertes, um den gerätespezifischen EAPS festzulegen\&. Der Dateipfad kann als Pfad zu einem Blockgeräteknoten oder zu einer anderen Datei festgelegt werden\&. In letzterem Fall wird das zugrundeliegende Blockgerät des Dateisystems der Datei bestimmt\&. Falls dem EAPS K, M, G oder T angehängt ist, wird der EAPS als KiloEAPS, MegaEAPS, GigaEAPS bzw. TeraEAPS zu der Basis 1000 ausgewertet\&. (Beispiel: »/dev/disk/by-path/pci-0000:00:1f\&.2-scsi-0:0:0:0 1K«)\&. Dies steuert das Control-Gruppen-Attribut »io\&.max«\&. Verwenden Sie diese Option mehrfach, um EAPS-Begrenzungen für mehrere Geräte zu setzen\&. Für Details über diese Control-Gruppen-Attribut siehe \m[blue]B<cgroup-v2\&.txt>\m[]\&\s-2\u[2]\d\s+2\&.

source: These settings are supported only if the unified control group hierarchy is used and disable settings prefixed with I<BlockIO> or I<StartupBlockIO>\&.
de: Diese Einstellungen werden nur unterstützt, falls die vereinigte Control-Gruppen-Hierarchie verwandt wird und deaktiviert Einstellungen, die mit I<BlockIO> oder I<StartupBlockIO> beginnen\&.

source: Takes a boolean argument\&. If true, turns on IPv4 and IPv6 network traffic accounting for packets sent or received by the unit\&. When this option is turned on, all IPv4 and IPv6 sockets created by any process of the unit are accounted for\&.
de: Akzeptiert ein logisches Argument\&. Falls wahr, wird die IPv4- und IPv6-Netzwerkverkehrsbuchführung für Pakete, die von dieser Unit gesandt oder empfangen werden, eingeschaltet\&. Wenn diese Option eingeschaltet wird, erfolgt für alle von einem der Proezsse der Unit erstellten IPv4- und IPv6-Sockets die Buchführung\&.

source: When this option is used in socket units, it applies to all IPv4 and IPv6 sockets associated with it (including both listening and connection sockets where this applies)\&. Note that for socket-activated services, this configuration setting and the accounting data of the service unit and the socket unit are kept separate, and displayed separately\&. No propagation of the setting and the collected statistics is done, in either direction\&. Moreover, any traffic sent or received on any of the socket unit\*(Aqs sockets is accounted to the socket unit \(em and never to the service unit it might have activated, even if the socket is used by it\&.
de: Wenn diese Option in Socket-Units verwandt wird, wird sie auf alle hierzu zugeordneten IPv4- und IPv6-Socket (einschließlich der auf Anfragen wartenden und der Verbindugssockets, wo dies zutrifft) angewandt\&. Beachten Sie, dass für Socket-aktivierte Dienste diese Konfigurationseinstellung und die Buchuführungsdaten der Dienste-Unit und der Socket-Unit getrennt bleiben und getrennt dargestellt werden\&. Es erfolgt keine Weitergabe der Einstellung und der gesammelten Daten, in keine Richtung\&. Zudem wird sämtlicher Verkehr, der auf einem der Sockets der Socket-Unit empfangen oder gesandt wird für die Socket-Unit buchgeführt \(em und niemals für die Dienste-Unit, die sie aktiviert haben könnte, selbst falls der Socket von dieser verwandt wird\&.

source: The system default for this setting may be controlled with I<DefaultIPAccounting=> in B<systemd-system.conf>(5)\&.
de: Die Systemvorgabe für diese Einstellung kann mit I<DefaultIPAccounting=> in B<systemd-system.conf>(5) gesteuert werden\&.

source: I<IPAddressAllow=>I<ADDRESS[/PREFIXLENGTH]\&...>, I<IPAddressDeny=>I<ADDRESS[/PREFIXLENGTH]\&...>
de: I<IPAddressAllow=>I<ADRESSE[/PRÄFIXLÄNGE]…>, I<IPAddressDeny=>I<ADRESSE[/PRÄFIXLÄNGE]…>

source: Turn on address range network traffic filtering for packets sent and received over AF_INET and AF_INET6 sockets\&. Both directives take a space separated list of IPv4 or IPv6 addresses, each optionally suffixed with an address prefix length (separated by a "/" character)\&. If the latter is omitted, the address is considered a host address, i\&.e\&. the prefix covers the whole address (32 for IPv4, 128 for IPv6)\&.
de: Schaltet Adressbereichnetzwerkverkehrsfilterung für Pakete, die über AF_INET- und AF_INET6-Sockets gesandt oder empfangen werden, ein\&. Beide Direktiven akzeptieren eine Leerraum getrennte Liste von IPv4- oder IPv6-Adressen, an jede kann optional eine Adresspräfixlänge (getrennt durch das Zeichen »/«) angehängt werden\&. Falls letztere entfällt, wird die Adresse als Rechneradresse betrachtet, d\&.h\&. der Präfix deckt die gesamte Adresse ab (32 für IPv4, 128 für IPv6)\&.

source: The access lists configured with this option are applied to all sockets created by processes of this unit (or in the case of socket units, associated with it)\&. The lists are implicitly combined with any lists configured for any of the parent slice units this unit might be a member of\&. By default all access lists are empty\&. When configured the lists are enforced as follows:
de: Die mit dieser Option konfigurierten Zugriffslisten werden auf allen von dieser Unit erstellten Sockets (oder im Falle von Socket-Units, allen der Unit zugeordneten) angewandt\&. Die Liste wird implzit mit jeder für irgendeine Elternscheibe, bei der diese Unit Mitglied sein könnte, kombiniert\&. Standardmäßig sind alle Zugriffslisten leer\&. Wenn konfiguriert, werden die Listen wie folgt durchgesetzt:

source: Access will be granted in case its destination/source address matches any entry in the I<IPAddressAllow=> setting\&.
de: Falls seine Ziel-/Quelladresse auf einen Eintrag in der Einstellung I<IPAddressAllow=> passt wird der Zugriff erlaubt\&.

source: Otherwise, access will be denied in case its destination/source address matches any entry in the I<IPAddressDeny=> setting\&.
de: Falls seine Ziel-/Quelladresse auf einen Eintrag in der Einstellung I<IPAddressDeny=> passt wird andernfalls der Zugriff verweigert\&.

source: Otherwise, access will be granted\&.
de: Andernfalls wird der Zugriff gewährt\&.

source: In order to implement a whitelisting IP firewall, it is recommended to use a I<IPAddressDeny=>B<any> setting on an upper-level slice unit (such as the root slice -\&.slice or the slice containing all system services system\&.slice \(en see B<systemd.special>(7) for details on these slice units), plus individual per-service I<IPAddressAllow=> lines permitting network access to relevant services, and only them\&.
de: Um eine IP-Firewall mit Positivliste zu implementieren, wird empfohlen, eine Einstellung I<IPAddressDeny=>B<any> in einer höherstufigen Scheiben-Unit (wie der Wurzel-Scheibe -\&.slice oder der Scheibe, die alle Systemdienste enthält, system\&.slice \(en siehe B<systemd.special>(7) für Details über diese Scheiben-Units) zu verwenden, ergänzt um individuelle, dienstebezogene I<IPAddressAllow=>-Zeilen, die Netzwerkzugriff auf relevante Dienste, und nur diese, erlauben\&.

source: Note that for socket-activated services, the IP access list configured on the socket unit applies to all sockets associated with it directly, but not to any sockets created by the ultimately activated services for it\&. Conversely, the IP access list configured for the service is not applied to any sockets passed into the service via socket activation\&. Thus, it is usually a good idea, to replicate the IP access lists on both the socket and the service unit, however it often makes sense to maintain one list more open and the other one more restricted, depending on the usecase\&.
de: Beachten Sie, das für Socket-aktivierte Dienste die IP-Zugriffsliste, die in der Socket-Unit konfiguriert ist, auf alle direkt zugeordneten Sockets angewandt wird, aber nicht auf irgendein Socket, das von den dafür schließlich aktivierten Diensten erstellt wurde\&. Umgekehrt werden die für die Dienste konfigurierten IP-Zugriffslisten nicht auf irgendein Socket angewandt, das dem Dienst über Socket-Aktivierung weitergegeben wird\&. Daher ist es im Allgemeinen eine gute Idee, die IP-Zugriffsliste sowohl in der Socket- als auch der Dienste-Unit zu replizieren, allerdings ergibt es oft Sinn, eine Liste offener und eine Liste beschränkter zu verwalten, abhängig vom Einsatzfall\&.

source: If these settings are used multiple times in the same unit the specified lists are combined\&. If an empty string is assigned to these settings the specific access list is reset and all previous settings undone\&.
de: Falls diese Einstellungen mehrfach in der gleichen Unit verwandt werden, werden die festgelegten Listen kombiniert\&. Falls eine leere Zeichenkette diesen Einstellungen zugewiesen wird, werden die festgelegten Zugriffslisten zurückgesetzt und alle vorherigen Einstellungen aufgehoben\&.

source: In place of explicit IPv4 or IPv6 address and prefix length specifications a small set of symbolic names may be used\&. The following names are defined:
de: Anstelle expliziter IPv4- oder IPv6-Adressen und Präfixlängenfestlegungen können auch eine kleine Gruppe von symbolischen Namen verwandt werden\&. Die folgenden Namen sind definiert:

source: B<Table\ \&1.\ \&Special address/network names>
de: B<Tabelle\ \&1.\ \&Besondere Adress-/Netzwerknamen>

source: Symbolic Name
de: Symbolischer Name

source: Meaning
de: Bedeutung

source: Any host
de: jeder Rechner

source: All addresses on the local loopback
de: alle Adressen auf dem lokalen Loopback

source: All link-local IP addresses
de: alle linklokalen IP-Adressen

source: All IP multicasting addresses
de: alle IP-multicasting-Adressen

source: Note that these settings might not be supported on some systems (for example if eBPF control group support is not enabled in the underlying kernel or container manager)\&. These settings will have no effect in that case\&. If compatibility with such systems is desired it is hence recommended to not exclusively rely on them for IP security\&.
de: Beachten Sie, dass diese Einstellungen auf einigen Systemen nicht unterstützt werden könnten (beispielsweise falls eBPF-Control-Gruppen-Unterstützung nicht im unterliegenden Kernel oder Container-Verwalter aktiviert ist)\&. Diese Einstellungen haben in diesem Fall keine Auswirkung\&. Falls Kompatibilität mit solchen Systemen gewünscht ist, wird daher empfohlen, sich nicht exklusiv auf sie für IP-Sicherheit zu verlassen\&.

source: Control access to specific device nodes by the executed processes\&. Takes two space-separated strings: a device node specifier followed by a combination of B<r>, B<w>, B<m> to control I<r>eading, I<w>riting, or creation of the specific device node(s) by the unit (I<m>knod), respectively\&. This controls the "devices\&.allow" and "devices\&.deny" control group attributes\&. For details about these control group attributes, see \m[blue]B<devices\&.txt>\m[]\&\s-2\u[6]\d\s+2\&.
de: Steuert Zugriff auf bestimmte Geräteknoten durch ausgeführte Prozesse\&. Akzeptiert zwei Leerraum-getrennte Zeichenketten: einen Geräteknotenkennzeichner, gefolgt von einer Kombination aus B<r>, B<w>, B<m>, um das Lesen, Schreiben bzw. Erstellen von bestimmten Geräteknoten der Unit (mit mknod) zu steuern\&. Dies steuert die Control-Gruppen-Attribute »devices\&.allow« und »devices\&.deny«\&. Für Details über diese Control-Gruppen-Attribute siehe \m[blue]B<devices\&.txt>\m[]\&\s-2\u[6]\d\s+2\&.

source: The device node specifier is either a path to a device node in the file system, starting with /dev/, or a string starting with either "char-" or "block-" followed by a device group name, as listed in /proc/devices\&. The latter is useful to whitelist all current and future devices belonging to a specific device group at once\&. The device group is matched according to filename globbing rules, you may hence use the "*" and "?" wildcards\&. Examples: /dev/sda5 is a path to a device node, referring to an ATA or SCSI block device\&. "char-pts" and "char-alsa" are specifiers for all pseudo TTYs and all ALSA sound devices, respectively\&. "char-cpu/*" is a specifier matching all CPU related device groups\&.
de: Der Geräteknotenkennzeichner ist entweder ein Pfad zu einem Geräteknoten in dem Dateisystem, beginnend mit /dev/, oder eine Zeichenkette, die entweder mit »char-« oder "block-" beginnt und von einem Gerätegruppennamen, wie in /proc/devices aufgeführt, gefolgt wird\&. Letzteres ist nützlich, um eine Positivliste aller aktuellen und zukünftigen Geräte, die zu einer bestimmten Gerätegruppe gehören, auf einmal anzulegen\&. Die Gerätegruppe wird entsprechend der Dateinamen-Glob-Muster-Regeln abgeglichen, Sie können daher die Metazeichen »*« und »?« verwenden\&. Beispiel: /dev/sda5 ist ein Pfad zu einem Geräteknoten, der sich auf ein ATA- oder SCSI-Blockgerät bezieht\&. »char-pts« und »char-alsa« sind Kennzeichner für alle Pseudo-TTY- bzw. alle ALSA-Sound-Geräte\&. »char-cpu/*« ist ein Kennzeichner, der auf alle Gerätegruppn mit CPU-Bezug passt\&.

source: Control the policy for allowing device access:
de: Steuert die Richtlinien zum Erlauben von Gerätezugriff:

source: means to only allow types of access that are explicitly specified\&.
de: bedeutet, nur Zugriffstypen zu erlauben, die explizit festgelegt wurden\&.

source: in addition, allows access to standard pseudo devices including /dev/null, /dev/zero, /dev/full, /dev/random, and /dev/urandom\&.
de: erlaubt zusätzlich Zugriff auf die Standard-Pseudo-Geräte einschließlich /dev/null, /dev/zero, /dev/full, /dev/random und /dev/urandom\&.

source: in addition, allows access to all devices if no explicit I<DeviceAllow=> is present\&. This is the default\&.
de: erlaubt zusätzlich Zugriff auf alle Geräte, falls keine explizites I<DeviceAllow=> vorhanden ist\&. Dies ist die Vorgabe\&.

source: The name of the slice unit to place the unit in\&. Defaults to system\&.slice for all non-instantiated units of all unit types (except for slice units themselves see below)\&. Instance units are by default placed in a subslice of system\&.slice that is named after the template name\&.
de: Der Name der Scheiben-Unit, in der die Unit hineingelegt werden soll\&. Standardmäßig system\&.slice für alle noch nicht instanziierten Units aller Unit-Typen (außer für Scheiben-Units selbst, siehe unten)\&. Instanzen-Unit werden standardmäßig in eine Unterscheibe von system\&.slice gelegt, die nach dem Vorlagennamen benannt ist\&.

source: This option may be used to arrange systemd units in a hierarchy of slices each of which might have resource settings applied\&.
de: Diese Option kann zur Anordnung von Systemd-Units in einer Hierarchie von Scheiben verwandt werden, bei der bei jeder Ressourceneinstellungen angewandt werden können\&.

source: For units of type slice, the only accepted value for this setting is the parent slice\&. Since the name of a slice unit implies the parent slice, it is hence redundant to ever set this parameter directly for slice units\&.
de: Für Units vom Typ Scheibe ist der einzige für diese Einstellung akzeptierte Wert die Elternscheibe\&. Da der Name einer Scheiben-Unit die Elternscheibe impliziert ist es daher immer redundant, diesen Parameter direkt für Scheiben-Units zu setzen\&.
