Repository: sebras/manpages-l10n
Catalog: po/*/man6/banner.6.po
Languages: de, es

source: April 29, 1995
de: 29. April 1995
es: 29 de abril de 1995

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: print large banner on printer
de: Druckt große Banner auf einem Drucker.
es: imprime un título grande en la impresora

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: E<.Nm> E<.Op Fl w Ar width> E<.Ar message ...>
de: E<.Nm> E<.Op Fl w Ar Breite> E<.Ar Meldung …>
es: E<.Nm> E<.Op Fl w Ar ancho> E<.Ar mensaje ...>

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: E<.Nm> prints a large, high quality banner on the standard output. If the message is omitted, it prompts for and reads one line of its standard input. If E<.Fl w> is given, the output is scrunched down from a width of 132 to E<.Ar width>, suitable for a narrow terminal.
de: E<.Nm> druckt ein großes, hochqualitatives Banner auf der Standardausgabe. Falls die Nachricht nicht angegeben wird, wird danach gefragt und eine Zeile wird von der Standardeingabe gelesen. Falls E<.Fl w> angegeben wird, wird die Ausgabe von der Breite 132 auf E<.Ar Breite> zusammengedrückt, geeignet für ein schmaleres Terminal.
es: E<.Nm> imprime un título grande y de gran calidad en la salida estandar. Si se omite el mensaje, pregunta por él, y lee una línea de su entrada estandar. Si E<.Fl w> se incluye, la salida se achata desde una anchura de 132 a E<.Ar width>, conveniente para una terminal más estrecha.

source: The output should be printed on paper of the appropriate width, with no breaks between the pages.
de: Die Ausgabe sollte auf einem Papier der geeigneten Breite ohne Umbruch zwischen den Seiten ausgedruckt werden.

source: BUGS
de: FEHLER
es: ERRORES

source: Several ASCII characters are not defined, notably \*[Lt], \*[Gt], [, ], \e, ^, _, {, }, |, and ~. Also, the characters ", ', and \*[Am] are funny looking (but in a useful way.)
de: Eine Reihe von ASCII-Zeichen sind nicht definiert, insbesondere \*[Lt], \*[Gt], [, ], \e, ^, _, {, }, |, und ~. Auch die Zeichen ", ', und \*[Am] sehen lustig (aber brauchbar) aus.
es: Agunos caracteres ASCII no están definidos, destacando \*[Lt], \*[Gt], [, ], \e, ^, _, {, }, |, y ~. También, los caracteres ", ', y \*[Am] tienen un aspecto divertido (pero util.)

source: The E<.Fl w> option is implemented by skipping some rows and columns. The smaller it gets, the grainier the output. Sometimes it runs letters together.
de: Die Option E<.Fl w> wird implementiert, indem einige Zeilen und Spalten übersprungen werden. Je kleiner es wird, desto pixeliger die Ausgabe. Manchmal laufen dabei Buchstaben ineinander.
es: La opción E<.Fl w> se implementa saltando algunas filas y columnas. Cuanto más pequeño se haga, más grano tendrá la salida. Algunas veces mezcla las letras.

source: AUTHOR
de: AUTOR
es: AUTOR
