Repository: sebras/manpages-l10n
Catalog: po/*/man6/worms.6.po
Languages: de

source: May 31, 1993
de: 31. Mai 1993

source: NAME
de: BEZEICHNUNG

source: animate worms on a display terminal
de: Würmer auf einem Display-Terminal animieren

source: SYNOPSIS
de: ÜBERSICHT

source: E<.Nm> E<.Op Fl ft> E<.Op Fl d Ar delay> E<.Op Fl l Ar length> E<.Op Fl n Ar number>
de: E<.Nm> E<.Op Fl ft> E<.Op Fl d Ar Verzögerung> E<.Op Fl l Ar Länge> E<.Op Fl 2n Ar Anzahl>

source: DESCRIPTION
de: BESCHREIBUNG

source: A E<.Ux> version of the DEC-2136 program E<.Dq worms>.
de: Eine E<.Ux>-Version des DEC-2136-Programms E<.Dq worms>.

source: The options are as follows:
de: Folgende Optionen stehen zur Verfügung:

source: Makes a E<.Dq field> for the worm(s) to eat.
de: Erstellt ein »Feld«, das der Wurm/die Würmer fressen kann/können.

source: Makes each worm leave a trail behind it.
de: Führt dazu, dass jeder Wurm eine Spur hinterlässt.

source: Specifies a delay, in milliseconds, between each update. This is useful for fast terminals. Reasonable values are around 20-200. The default is 0.
de: Gibt eine Verzögerung zwischen jeder Aktualisierung in Millisekunden an. Dies ist für schnelle Terminals nützlich. Vernünftige Werte liegen im Bereich 20-200. Die Vorgabe ist 0.

source: Specifies a length for each worm; the default is 16.
de: Gibt eine Länge für jeden Wurm an; die Vorgabe ist 16.

source: Specifies the number of worms; the default is 3.
de: Gibt die Anzahl der Würmer an; die Vorgabe ist 3.
