Repository: sebras/manpages-l10n
Catalog: po/*/man6/worm.6.po
Languages: de

source: May 31, 1993
de: 31. Mai 1993

source: NAME
de: BEZEICHNUNG

source: Play the growing worm game
de: Das Spiel wachsender Wurm spielen

source: SYNOPSIS
de: ÜBERSICHT

source: E<.Nm> E<.Op Ar size>
de: E<.Nm> E<.Op Ar groesse>

source: DESCRIPTION
de: BESCHREIBUNG

source: In E<.Nm>, you are a little worm, your body is the "o"'s on the screen and your head is the "@". You move with the hjkl keys and the arrow keys (as in the game snake). If you don't press any keys, you continue in the direction you last moved.
de: In E<.Nm> sind Sie ein kleiner Wurm, Ihr Körper sind die »o« auf dem Bildschirm und Ihr Kopf ist das »@«. Sie bewegen sich mit den Tasten hjkl und den Pfeiltasten (wie im Spiel snake). Falls Sie keine Tasten drücken, fahren Sie in der Richtung der letzten Bewegung fort.

source: On the screen you will see a digit, if your worm eats the digit is will grow longer, the actual amount longer depends on which digit it was that you ate. The object of the game is to see how long you can make the worm grow.
de: Auf dem Bildschirm werden Sie eine Ziffer sehen. Falls Ihr Wurm die Ziffer frisst, dann wird er anwachsen (länger werden). Die Verlängerung hängt von der Ziffer ab, die der Wurm fraß. Das Ziel des Spiels besteht darin, herauszufinden, wie lange Sie den Wurm wachsen lassen können.

source: The game ends when the worm runs into either the sides of the screen, or itself. The current score (how much the worm has grown) is kept in the upper right corner of the screen.
de: Das Spiel wird beendet, wenn der Wurm entweder in die Seiten des Bildschirms oder in sich selbst läuft. Die aktuelle Punktzahl (wieviel der Wurm angewachsen ist) wird in der oberen rechten Ecke des Bildschirms dargestellt.

source: In E<.Nm>, you are a little worm, your body is the "o"'s on the screen and your head is the "@". You move with the hjkl keys and the arrow keys (as in the game snake). If you don't press any keys, you continue in the direction you last moved. The upper case HJKL keys move you as if you had pressed several (9 for HL and 5 for JK) of the corresponding lower case key (unless you run into a digit, then it stops).
de: In E<.Nm> sind Sie ein kleiner Wurm, Ihr Körper sind die »o« auf dem Bildschirm und Ihr Kopf ist das »@«. Sie bewegen sich mit den Tasten hjkl und den Pfeiltasten (wie im Spiel snake). Falls Sie keine Tasten drücken, fahren Sie in der Richtung der letzten Bewegung fort. Die Tasten HJKL in Großschreibung werden in mehrere (9 für HL und 5 für JK) der entsprechenden Tasten in Kleinschreibung umgesetzt (außer Sie laufen in eine Ziffer, dann wird angehalten).

source: The optional argument, if present, is the initial length of the worm.
de: Das optionale Argument, falls vorhanden, ist die anfängliche Länge des Wurms.
