Repository: sebras/manpages-l10n
Catalog: po/*/man7/attributes.7.po
Languages: fr

source: ATTRIBUTES
fr: ATTRIBUTS

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: attributes - POSIX safety concepts
fr: attributes – Concepts de sécurité POSIX

source: I<Note>: the text of this man page is based on the material taken from the "POSIX Safety Concepts" section of the GNU C Library manual. Further details on the topics described here can be found in that manual.
fr: I<Note> : le texte de cette page de manuel est basée sur des éléments pris dans la section « POSIX Safety Concepts » du manuel de la bibliothèque GNU C. Plus de détails sur les sujets décrits ici peuvent être trouvés dans ce manuel.

source: Various function manual pages include a section ATTRIBUTES that describes the safety of calling the function in various contexts. This section annotates functions with the following safety markings:
fr: Diverses pages de manuel de fonctions comportent une section ATTRIBUTES qui décrit la sécurité de l'appel d'une fonction dans divers contextes. Cette section annote les fonctions avec les balises de sécurité suivantes :

source: I<MT-Safe> or Thread-Safe functions are safe to call in the presence of other threads. MT, in MT-Safe, stands for Multi Thread.
fr: Les fonctions I<MT-Safe> ou I<Thread-Safe> sont sûres à appeler en présence d'autres threads. MT, dans MT-Safe, signifie « multithread ».

source: Being MT-Safe does not imply a function is atomic, nor that it uses any of the memory synchronization mechanisms POSIX exposes to users. It is even possible that calling MT-Safe functions in sequence does not yield an MT-Safe combination. For example, having a thread call two MT-Safe functions one right after the other does not guarantee behavior equivalent to atomic execution of a combination of both functions, since concurrent calls in other threads may interfere in a destructive way.
fr: L'état MT-Safe n'implique pas qu'une fonction est atomique, ni qu'elle utilise un des mécanismes de synchronisation de mémoire que POSIX expose aux utilisateurs. Il est même possible que l'appel de plusieurs fonctions MT-Safe à la suite ne produise pas une combinaison MT-Safe. Par exemple, le fait qu'un thread appelle deux fonctions MT-Safe l'une immédiatement après l'autre ne garantit pas un comportement équivalent à l'exécution atomique de la combinaison des deux fonctions, dans la mesure où des appels concomitants dans d'autres threads peuvent interférer de manière destructive.

source: Whole-program optimizations that could inline functions across library interfaces may expose unsafe reordering, and so performing inlining across the GNU C Library interface is not recommended. The documented MT-Safety status is not guaranteed under whole-program optimization. However, functions defined in user-visible headers are designed to be safe for inlining.
fr: Les optimisations à l'échelle du programme qui peuvent intégrer des fonctions à travers les interfaces des bibliothèques peuvent exposer à des réorganisations non sûres, aussi il n'est pas recommandé de réaliser des intégrations au moyen des interfaces de la bibliothèque GNU C. L'état documenté MT-Safety n'est pas garanti. Néanmoins, les fonctions définies dans les en-têtes visibles par l'utilisateur sont conçues pour être sûres pour l'intégration.

source: I<MT-Unsafe> functions are not safe to call in a multithreaded programs.
fr: Les fonctions I<MT-Unsafe> ne sont pas sûres pour des appels dans des programmes multithreadés.

source: Other keywords that appear in safety notes are defined in subsequent sections.
fr: D'autres mots-clefs qui apparaissent dans des notes de sûreté sont définis dans les sections suivantes.

source: Conditionally safe features
fr: Fonctionnalités sûres sous condition

source: For some features that make functions unsafe to call in certain contexts, there are known ways to avoid the safety problem other than refraining from calling the function altogether. The keywords that follow refer to such features, and each of their definitions indicates how the whole program needs to be constrained in order to remove the safety problem indicated by the keyword. Only when all the reasons that make a function unsafe are observed and addressed, by applying the documented constraints, does the function become safe to call in a context.
fr: Pour certaines fonctionnalités qui rendent non sûre l'appel de certaines fonctions dans certains contextes, il existe des moyens connus pour éviter un problème autres que de s'abstenir complètement d'appeler la fonction. Les mots-clés qui suivent font référence à ces fonctionnalités et chacune des définitions indique comment le programme dans son ensemble doit être contraint de manière à supprimer le problème de sûreté indiqué par le mot-clé. C'est seulement lorsque toutes les raisons qui rendent une fonction non sûre ont été observées et traitées, en appliquant les contraintes documentées, que l'appel d'une fonction devient sûr dans un contexte.

source: Functions marked with I<init> as an MT-Unsafe feature perform MT-Unsafe initialization when they are first called.
fr: Les fonctions marquées I<init> en tant que fonctionnalité I<MT-Unsafe> réalisent une initialisation I<MT-Unsafe> quand elles sont appelées en premier.

source: Calling such a function at least once in single-threaded mode removes this specific cause for the function to be regarded as MT-Unsafe. If no other cause for that remains, the function can then be safely called after other threads are started.
fr: L'appel d'une fonction de ce type au moins une fois en mode monothread supprime cette raison spécifique qui fait considérer la fonction comme I<MT-Unsafe>. S'il ne reste pas d'autre raison, la fonction peut alors être appelée de façon sûre après le démarrage d'autres threads.

source: Functions annotated with I<race> as an MT-Safety issue operate on objects in ways that may cause data races or similar forms of destructive interference out of concurrent execution. In some cases, the objects are passed to the functions by users; in others, they are used by the functions to return values to users; in others, they are not even exposed to users.
fr: Les fonctions marquées I<race> en tant que problème d'état I<MT-Safe> opèrent sur des objets d'une façon qui peut provoquer des situations de concurrences de données ou des formes similaires d'interférences destructives provoquées par une exécution concurrente. Dans certains cas, les objets sont passés aux fonctions par les utilisateurs ; dans d'autres, ils sont utilisés par les fonctions pour renvoyer des valeurs aux utilisateurs ; dans d'autres encore, ils ne sont même pas exposés aux utilisateurs.

source: Functions marked with I<const> as an MT-Safety issue non-atomically modify internal objects that are better regarded as constant, because a substantial portion of the GNU C Library accesses them without synchronization. Unlike I<race>, which causes both readers and writers of internal objects to be regarded as MT-Unsafe, this mark is applied to writers only. Writers remain MT-Unsafe to call, but the then-mandatory constness of objects they modify enables readers to be regarded as MT-Safe (as long as no other reasons for them to be unsafe remain), since the lack of synchronization is not a problem when the objects are effectively constant.
fr: Les fonctions marquées I<const> en tant que problème d'état MT-Safe modifient de façon non-atomique les objets internes qui sont plutôt à considérer comme constants, parce qu'une partie importante de la bibliothèque GNU C y accède sans synchronisation. À la différence de I<race> qui fait qu'à la fois lecteurs et écrivains d'objets internes sont considérés comme I<MT-Unsafe>, cette marque ne s'applique qu'aux écrivains. Leur appel demeure I<MT-Unsafe>, mais le caractère constant alors obligatoire des objets qu'ils modifient permet de considérer les lecteurs comme I<MT-safe> (aussi longtemps qu'il n'y a pas d'autre raison pour qu'ils soient non sûrs), dans la mesure où l'absence de synchronisation n'est pas un problème quand les objets sont effectivement constants.

source: The identifier that follows the I<const> mark will appear by itself as a safety note in readers. Programs that wish to work around this safety issue, so as to call writers, may use a non-recursive read-write lock associated with the identifier, and guard I<all> calls to functions marked with I<const> followed by the identifier with a write lock, and I<all> calls to functions marked with the identifier by itself with a read lock.
fr: L'identifiant qui suit la marque I<const> apparaîtra lui-même conne une note de sûreté dans les lecteurs. Les programmes qui souhaitent contourner ce problème de sûreté, afin d'appeler les écrivains, peuvent utiliser un verrou en lecture et écriture non récursif associé à l'identifiant et garder la I<totalité> des appels à des fonctions marquées I<const> suivies de l'identifiant avec un verrou en écriture et la I<totalité> des appels à des fonctions marquées par l'identifiant lui-même avec un verrou en lecture.

source: Functions marked with I<sig> as a MT-Safety issue may temporarily install a signal handler for internal purposes, which may interfere with other uses of the signal, identified after a colon.
fr: Les fonctions marquées I<sig> en tant que problème d'état MT-Safe peuvent installer de façon temporaire un gestionnaire de signal à des fins internes qui peut interférer avec d'autres usages du signal, identifié après deux-points.

source: This safety problem can be worked around by ensuring that no other uses of the signal will take place for the duration of the call. Holding a non-recursive mutex while calling all functions that use the same temporary signal; blocking that signal before the call and resetting its handler afterwards is recommended.
fr: Le problème de sûreté peut être contourné en s'assurant qu'aucun autre usage du signal n'interviendra pendant la durée de l'appel. Il est recommandé de maintenir un mutex non récursif pendant l'appel de toutes les fonctions qui utilisent le même signal temporaire, de bloquer ce signal avant l'appel et de réinitialiser son gestionnaire après.

source: Functions marked with I<term> as an MT-Safety issue may change the terminal settings in the recommended way, namely: call B<tcgetattr>(3), modify some flags, and then call B<tcsetattr>(3), this creates a window in which changes made by other threads are lost. Thus, functions marked with I<term> are MT-Unsafe.
fr: Les fonctions marquées I<term> en tant que problème d'état MT-Safe peuvent modifier la configuration du terminal de la façon recommandée, c'est-à-dire : appel de B<tcgetattr>(3), modification de certains attributs puis appel de B<tcsetattr>(3), cela crée une fenêtre dans laquelle les modifications effectuées par d'autres threads sont perdues. Donc, les fonctions marquées I<term> sont I<MT-Unsafe>.

source: It is thus advisable for applications using the terminal to avoid concurrent and reentrant interactions with it, by not using it in signal handlers or blocking signals that might use it, and holding a lock while calling these functions and interacting with the terminal. This lock should also be used for mutual exclusion with functions marked with I<race:tcattr(fd)>, where I<fd> is a file descriptor for the controlling terminal. The caller may use a single mutex for simplicity, or use one mutex per terminal, even if referenced by different file descriptors.
fr: Il est donc recommandé d'éviter, pour les applications utilisant le terminal, des interactions simultanées et réentrantes avec lui en nel'utilisant pas dans les gestionnaires de signal ou les signaux bloquants qui pourraient l'utiliser également, et de maintenir un verrou pendant l'utilisation de ces fonctions et l'interaction avec le terminal. Ce verrou devrait également être utilisé pour l'exclusion mutuelle avec les fonctions marquées I<race:tcattr(fd)> où I<fd> est un descripteur de fichier pour le terminal de contrôle. L'appelant peut utiliser un mutex unique pour simplifier ou utiliser un mutex par terminal même s'ils sont référencés par des descripteurs de fichier différents.

source: Other safety remarks
fr: Autres remarques sur la sûreté

source: Additional keywords may be attached to functions, indicating features that do not make a function unsafe to call, but that may need to be taken into account in certain classes of programs:
fr: Des mots clefs supplémentaires peuvent être ajoutés aux fonctions, indiquant des fonctionnalités qui ne rendent pas la fonction non sûre à appeler, mais il peut être nécessaire d'en tenir compte dans certaines classes de programmes.

source: Functions annotated with I<locale> as an MT-Safety issue read from the locale object without any form of synchronization. Functions annotated with I<locale> called concurrently with locale changes may behave in ways that do not correspond to any of the locales active during their execution, but an unpredictable mix thereof.
fr: Les fonctions marquées I<locale> en tant que problème d'état MT-Safe lisent à partir de l'objet locale sans aucune forme de synchronisation. Ces fonctions appelées en même temps que des modifications de I<locale> peuvent se comporter d'une manière qui ne correspond à aucune des I<locales> actives pendant leur exécution mais à un mélange imprévisible de celles-ci.

source: We do not mark these functions as MT-Unsafe, however, because functions that modify the locale object are marked with I<const:locale> and regarded as unsafe. Being unsafe, the latter are not to be called when multiple threads are running or asynchronous signals are enabled, and so the locale can be considered effectively constant in these contexts, which makes the former safe.
fr: Nous ne marquons pas ces fonctions comme I<MT-Unsafe> néanmoins, car les fonctions qui modifient l'objet I<locale> sont marquées I<const:locale> et considérées comme non sûres. Étant non sûres, ces dernières ne doivent pas être appelées quand plusieurs threads sont en exécution ou lorsque les signaux asynchrones sont activés, et ainsi la I<locale> peut être considérée comme effectivement constante dans ces contextes, ce qui rend les premières fonctions sûres.

source: Functions marked with I<env> as an MT-Safety issue access the environment with B<getenv>(3) or similar, without any guards to ensure safety in the presence of concurrent modifications.
fr: Les fonctions marquées I<env> en tant que problème d'état MT-Safe accèdent à l'environnement avec B<getenv>(3) ou une commande similaire sans aucune protection pour garantir la sûreté en présence de modifications simultanées.

source: We do not mark these functions as MT-Unsafe, however, because functions that modify the environment are all marked with I<const:env> and regarded as unsafe. Being unsafe, the latter are not to be called when multiple threads are running or asynchronous signals are enabled, and so the environment can be considered effectively constant in these contexts, which makes the former safe.
fr: Nous ne marquons pas ces fonctions comme I<MT-Unsafe> néanmoins, car les fonctions qui modifient l'environnement sont toutes marquées I<const:env> et considérées comme non sûres. Étant non sûres, ces dernières ne doivent pas être appelées quand plusieurs threads sont en exécution ou lorsque les signaux asynchrones sont activés, et ainsi l'environnement peut être considéré comme effectivement constant dans ces contextes, ce qui rend les premières fonctions sûres.

source: The function marked with I<hostid> as an MT-Safety issue reads from the system-wide data structures that hold the "host ID" of the machine. These data structures cannot generally be modified atomically. Since it is expected that the "host ID" will not normally change, the function that reads from it (B<gethostid>(3)) is regarded as safe, whereas the function that modifies it (B<sethostid>(3)) is marked with I<const:hostid>, indicating it may require special care if it is to be called. In this specific case, the special care amounts to system-wide (not merely intra-process) coordination.
fr: Les fonctions marquées I<hostid> en tant que problème d'état MT-Safe lisent à partir des structures de données communes à tout le système qui contiennent « l'ID d'hôte » de la machine. Ces structures de données ne peuvent pas en général être modifiées automatiquement. Dans la mesure où il est attendu que normalement « l'ID d'hôte » ne change pas, la fonction qui lit à partir d'elle (B<gethostid>(3)) est considérée comme sûre, tandis que la fonction qui la modifie (B<sethostid>(3)) est marquée I<const:hostid>, indiquant qu'elle requiert une attention particulière si elle doit être appelée. Dans ce cas particulier, cette attention particulière équivaut à une coordination à l'échelle de l'ensemble du système (pas seulement à l'intérieur du processus).

source: Functions marked with I<sigintr> as an MT-Safety issue access the GNU C Library I<_sigintr> internal data structure without any guards to ensure safety in the presence of concurrent modifications.
fr: Les fonctions marquées I<sigintr> en tant que problème d'état MT-Safe accèdent à la structure de données interne I<_sigintr> de la bibliothèque GNU C sans aucune protection pour garantir la sûreté en présence de modifications simultanées.

source: We do not mark these functions as MT-Unsafe, however, because functions that modify this data structure are all marked with I<const:sigintr> and regarded as unsafe. Being unsafe, the latter are not to be called when multiple threads are running or asynchronous signals are enabled, and so the data structure can be considered effectively constant in these contexts, which makes the former safe.
fr: Nous ne marquons pas ces fonctions comme I<MT-Unsafe> néanmoins, car les fonctions qui modifient cette structure de données sont toutes marquées I<const:sigintr> et considérées comme non sûres. Étant non sûres, ces dernières ne doivent pas être appelées quand plusieurs threads sont en exécution ou lorsque les signaux asynchrones sont activés, et ainsi l'environnement peut être considéré comme effectivement constant dans ces contextes, ce qui rend les premières fonctions sûres.

source: Functions marked with I<cwd> as an MT-Safety issue may temporarily change the current working directory during their execution, which may cause relative pathnames to be resolved in unexpected ways in other threads or within asynchronous signal or cancellation handlers.
fr: Les fonctions marquées I<cwd> en tant que problème d'état MT-Safe peuvent changer temporairement le répertoire actif actuel durant leur exécution ce qui fait que les noms de chemin relatifs peuvent être résolus de façon inattendue dans les autres threads ou dans les gestionnaires de signal ou d'annulation asynchrones.

source: This is not enough of a reason to mark so-marked functions as MT-Unsafe, but when this behavior is optional (e.g., B<nftw>(3) with B<FTW_CHDIR>), avoiding the option may be a good alternative to using full pathnames or file descriptor-relative (e.g., B<openat>(2)) system calls.
fr: Ce n'est pas une raison suffisante pour marquer comme I<MT-Unsafe> les fonctions ainsi marquées, mais quand ce comportement est optionnel (par exemple, B<nftw>(3) avec B<FTW_CHDIR>), éviter l'option peut être une bonne alternative à l'utilisation des noms de chemin complets ou d'appels système relatifs au descripteur de fichier (par exemple, B<openat>(2)).

source: I<:identifier>
fr: I<:identifiant>

source: Annotations may sometimes be followed by identifiers, intended to group several functions that, for example, access the data structures in an unsafe way, as in I<race> and I<const>, or to provide more specific information, such as naming a signal in a function marked with I<sig>. It is envisioned that it may be applied to I<lock> and I<corrupt> as well in the future.
fr: Les annotations peuvent parfois être suivies par des identifiants destinés à regrouper plusieurs fonctions qui, par exemple accèdent aux structures de données de façon non sûre, comme dans I<race> et I<const>, ou pour fournir des informations plus spécifiques, comme le nom d'un signal dans une fonction marquée I<sig>. Il est envisagé que cela pourrait aussi être appliqué à l'avenir à I<lock> et I<corrupt>.

source: In most cases, the identifier will name a set of functions, but it may name global objects or function arguments, or identifiable properties or logical components associated with them, with a notation such as, for example, I<:buf(arg)> to denote a buffer associated with the argument I<arg>, or I<:tcattr(fd)> to denote the terminal attributes of a file descriptor I<fd>.
fr: Dans la plupart des cas, l'identifiant désignera un ensemble de fonctions, mais il peut désigner des objets globaux ou des paramètres de fonction, des propriétés identifiables ou des composants logiques qui leur sont associés, avec une notation du type, par exemple, I<:buf(param)> pour désigner un tampon associé au paramètre I<param>, ou I<:tcattr(fd)> pour désigner les attributs de terminal d'un descripteur de fichier I<fd>.

source: The most common use for identifiers is to provide logical groups of functions and arguments that need to be protected by the same synchronization primitive in order to ensure safe operation in a given context.
fr: L'utilisation la plus courante des identifiants est de fournir des groupes logiques de fonctions et de paramètres qui nécessitent d'être protégés par la même primitive de synchronisation afin d'assurer une opération sûre dans un contexte donné.

source: Some safety annotations may be conditional, in that they only apply if a boolean expression involving arguments, global variables or even the underlying kernel evaluates to true. For example, I</!ps> and I</one_per_line> indicate the preceding marker only applies when argument I<ps> is NULL, or global variable I<one_per_line> is nonzero.
fr: Certaines annotations de sûreté peuvent être conditionnelles, dans le sens qu'elles ne s'appliquent que si une expression booléenne comprenant des paramètres, des variables globales ou même le noyau sous-jacent est évaluée vraie. Par exemple, I</!ps> et I</one_per_line> indiquent que le marqueur qui précède ne s'applique que si l'argument I<ps> est NULL ou la variable globale I<one_per_line> est différente de zéro.'

source: When all marks that render a function unsafe are adorned with such conditions, and none of the named conditions hold, then the function can be regarded as safe.
fr: Quand toutes les marques qui rendent non sûre une fonction sont agrémentées de conditions de ce type, et qu'aucune des conditions nommées ne tient, alors, la fonction peut être considérée comme sûre.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
