Repository: sebras/manpages-l10n
Catalog: po/*/man7/boot.7.po
Languages: es, fr

source: BOOT
es: INICIO

source: Linux Programmer's Manual
es: Manual del Programador de Linux
fr: Manuel du programmeur Linux

source: NAME
es: NOMBRE
fr: NOM

source: boot - System bootup process based on UNIX System V Release 4
es: inicio - Proceso de inicio de sistemas basados en la versión 4 de System V de Unix
fr: boot – processus de démarrage du système basé sur System V version 4 d'UNIX

source: DESCRIPTION
es: DESCRIPCIÓN

source: The B<bootup process> (or "B<boot sequence>") varies in details among systems, but can be roughly divided into phases controlled by the following components:
es: El B<proceso de incio> (o "secuencia de inicio") varía en ciertos detalles entre sistemas, pero puede dividirse en varias etapas en base al componente que lo controle:
fr: Le B<processus de démarrage> (ou « B<séquence de démarrage> ») dépend des systèmes, mais peut grossièrement être divisé en phases contrôlées par les composants suivants :

source: operating system (OS) loader
es: cargador de inicio del sistema operativo
fr: chargeur de démarrage

source: kernel
es: núcleo
fr: noyau

source: root user-space process (I<init> and I<inittab>)
es: proceso base en espacio de usuario (I<init> e I<inittab>)
fr: processus root en espace utilisateur (I<init> et I<inittab>)

source: boot scripts
es: scripts de inicio
fr: scripts de démarrage

source: Each of these is described below in more detail.
es: A continuación se describe cada uno de ellos con mayor detalle.
fr: Chaque composant est décrit plus en détails ci-dessous.

source: After power-on or hard reset, control is given to a program stored in read-only memory (normally PROM); for historical reasons involving the personal computer, this program is often called "the B<BIOS>".
es: Después de pulsar el botón de encendido o el botón reset, se pasa el control a un programa almacenado en memoria de sólo lectura (normalmente PROM). Por razones históricas de los PC, a este programa se suele denominar B<BIOS>.
fr: Après la mise sous tension ou une réinitialisation matérielle, un programme stocké en mémoire morte (souvent une PROM) prend le contrôle. Pour des raisons historiques liées au PC, on appelle généralement ce programme le B<BIOS>.

source: This program normally performs a basic self-test of the machine and accesses nonvolatile memory to read further parameters. This memory in the PC is battery-backed CMOS memory, so most people refer to it as "the B<CMOS>"; outside of the PC world, it is usually called "the B<NVRAM>" (nonvolatile RAM).
es: Este programa normalmente hace una autocomprobación básica del equipo y accede a la memoria no volátil para leer parámetros adicionales. En el PC, esta memoria es de tipo CMOS con respaldo de batería, por lo que la mayoría de la gente se refiere a ella como B<CMOS>, aunque fuera del mundo del PC se le llama usualmente B<nvram> (non-volatile ram, RAM no volátil).
fr: Ce programme effectue normalement un autotest de la machine et accède à la mémoire non volatile pour y lire quelques paramètres. Dans les PC, cette mémoire est maintenue par une mémoire CMOS entretenue par une batterie. Ainsi la plupart des gens l'appellent B<CMOS>, alors qu'en dehors du monde des PC, elle est généralement appelée B<NVRAM> (RAM non volatile).

source: The parameters stored in the NVRAM vary among systems, but as a minimum, they should specify which device can supply an OS loader, or at least which devices may be probed for one; such a device is known as "the B<boot device>". The hardware boot stage loads the OS loader from a fixed position on the boot device, and then transfers control to it.
es: La cantidad de parámetros almacenados en la NVRAM varía entre sistemas, pero debería -como mínimo- definir qué dispositivo puede proporcionar un cargador para el sistema operativo o en cuales se debería comprobar si existe uno. Este dispositivo se conoce como B<dispositivo de inicio>. Durante la primera etapa de inicio (hardware) se carga el cargador del sistema operativo desde una posición definida del dispositivo de inicio y luego se le transfiere el control.
fr: Les paramètres stockés dans la NVRAM dépendent des systèmes, mais doivent indiquer a minima quel périphérique peut fournir un chargeur de démarrage, ou quels périphériques peuvent être sondés pour en trouver un. Un tel périphérique est appelé « B<périphérique d'amorçage> ». La phase de démarrage matériel charge le chargeur de démarrage depuis une position fixe sur le périphérique d'amorçage et lui passe le contrôle.

source: Note:
es: Nota:

source: The device from which the OS loader is read may be attached via a network, in which case the details of booting are further specified by protocols such as DHCP, TFTP, PXE, Etherboot, etc.
es: El dispositivo desde el que se cargará el sistema operativo puede estar acoplado al equipo a través de una red, en cuyo caso los detalles para el inicio se darán mediante protocolos como DHCP, TFTP, PXE, Etherboot, etc...
fr: Le périphérique depuis lequel le chargeur d'amorçage est lu peut être attaché via un réseau, auquel cas les détails de démarrage sont indiqués par des protocoles tels que DHCP, TFTP, PXE, Etherboot, etc.

source: OS loader
es: Cargador de inicio del sistema operativo
fr: Chargeur de démarrage

source: The main job of the OS loader is to locate the kernel on some device, load it, and run it. Most OS loaders allow interactive use, in order to enable specification of an alternative kernel (maybe a backup in case the one last compiled isn't functioning) and to pass optional parameters to the kernel.
es: La principal tarea del cargador de inicio es localizar el núcleo, cargarlo y ejecutarlo. La mayoría de cargadores de inicio permiten un uso interactivo, para poder especificar un núcleo alternativo (posiblemente una copia de seguridad en caso de que el último núcleo compilado no funcione) y para pasar parámetros opcionales al núcleo.
fr: Le rôle principal du chargeur de démarrage est de localiser le noyau sur un périphérique, le charger et l'exécuter. La plupart des chargeurs de démarrage sont interactifs, pour permettre la spécification d'un noyau alternatif (par exemple un noyau de sauvegarde dans le cas où la dernière version compilée ne fonctionne pas) et le passage de paramètres optionnels au noyau.

source: In a traditional PC, the OS loader is located in the initial 512-byte block of the boot device; this block is known as "the B<MBR>" (Master Boot Record).
es: Tradicionalmente, en los PC, el cargador del SO está localizado en el primer sector del dispositivo de inicio - es el llamado B<MBR> (Master Boot Record).
fr: Sur les PC traditionnels, le chargeur de démarrage est situé sur le premier bloc de 512 octets du périphérique d'amorçage – ce bloc est appelé le B<MBR> (Master Boot Record).

source: In most systems, the OS loader is very limited due to various constraints. Even on non-PC systems, there are some limitations on the size and complexity of this loader, but the size limitation of the PC MBR (512 bytes, including the partition table) makes it almost impossible to squeeze much functionality into it.
es: En la mayoría de los sistemas, este cargador de inicio está limitado en base a varias restricciones. Incluso en sistemas que no son PC hay algunas limitaciones al tamaño y complejidad del cargador, así que, la limitación de tamaño del MBR en los PC (512 bytes incluyendo la tabla de particiones) hace casi imposible introducir un cargador de inicio completo dentro de él.
fr: Sur la plupart des systèmes, ce chargeur initial est très limité du fait de diverses contraintes. Même sur des systèmes autres que le PC, il existe des limitations concernant la taille et la complexité de ce chargeur, mais la taille du MBR des PC est limitée – 512 octets y compris la table de partition – et rend quasiment impossible d'y insérer beaucoup de fonctionnalités.

source: Therefore, most systems split the role of loading the OS between a primary OS loader and a secondary OS loader; this secondary OS loader may be located within a larger portion of persistent storage, such as a disk partition.
es: La mayoría de sistemas operativos dividen la tarea de iniciarse entre un cargador de inicio primario y otro secundario; éste último puede estar localizado dentro dentro de otra partición mayor de almacenamiento permanente como por ejemplo una partición de disco.
fr: Ainsi, sur la plupart des systèmes d'exploitation, le chargeur initial appelle un chargeur de démarrage secondaire situé sur une partition du disque. Ce chargeur de démarrage secondaire peut se trouver dans un plus grand emplacement de stockage persistant, comme une partition de disque.

source: In Linux, the OS loader is often either B<lilo>(8) or B<grub>(8).
es: En linux, el cargador de inicio suele ser B<lilo>(8) o B<grub>(8).
fr: Sous Linux, le chargeur de démarrage est souvent B<lilo>(8) ou B<grub>(8).

source: Kernel
es: Núcleo
fr: Noyau

source: When the kernel is loaded, it initializes various components of the computer and operating system; each portion of software responsible for such a task is usually consider "a B<driver>" for the applicable component. The kernel starts the virtual memory swapper (it is a kernel process, called "kswapd" in a modern Linux kernel), and mounts some filesystem at the root path, I</>.
es: Una vez que se carga el núcleo, éste inicializa diversos componentes del equipo y del sistema operativo. Cada porción de software responsable de esta tarea se suele considerar un I<controlador> o I<driver> para dicho componente. El núcleo arranca el intercambiador de memoria virtual (es un proceso del núcleo llamado "kswapd" en los núcleos recientes de Linux) y monta el sistema de archivos raíz: I</>.
fr: Quand le noyau est chargé, il initialise divers composants de l'ordinateur et du système d'exploitation. Chaque morceau de logiciel responsable d'une telle tâche est considéré comme un « B<pilote> » pour le composant concerné. Le noyau démarre le gestionnaire de swap (c'est un processus noyau, appelé B<kswapd> sur les noyaux Linux modernes), et monte le système de fichiers sur la racine « / »).

source: Some of the parameters that may be passed to the kernel relate to these activities (for example, the default root filesystem can be overridden); for further information on Linux kernel parameters, read B<bootparam>(7).
es: Algunos de los parámetros que se le pueden pasar al núcleo están relacionados con estas actividades (p.e: puede sobreescribir el sistema de archivos raíz por defecto). Para más información sobre los parámetros del núcleo Linux consulte B<bootparam>(7).
fr: Quelques paramètres relatifs à cela peuvent être passés au noyau (par exemple\ : on peut spécifier un autre système de fichiers racine que celui par défaut). Pour plus d'informations sur les paramètres du noyau Linux, consultez B<bootparam>(7).

source: Only then does the kernel create the initial userland process, which is given the number 1 as its B<PID> (process ID). Traditionally, this process executes the program I</sbin/init>, to which are passed the parameters that haven't already been handled by the kernel.
es: Después de esto, el núcleo creará el primer proceso en espacio de usuario al que asigna como número de B<PID> (ID de proceso) el número 1. Tradicionalmente, este proceso ejecuta el programa I</sbin/init>, pasándole cualquier parámetro que no haya podido ser manejado por el núcleo.
fr: C'est uniquement à cet instant que le noyau crée un premier processus en espace utilisateur, qui porte le numéro de processus 1 (B<PID>). Ce processus exécute le programme I</sbin/init>, en lui passant tout paramètre qui n'est pas déjà géré par le noyau.

source: Root user-space process
es: Proceso base en espacio de usuario
fr: Processus root en espace utilisateur

source: The following description applies to an OS based on UNIX System V Release 4. However, a number of widely used systems have adopted a related but fundamentally different approach known as B<systemd>(1), for which the bootup process is detailed in its associated B<bootup>(7).
es: La siguiente descripción es de aplicación en sistemas operativos basados en la versión 4 de System V de UNIX. Muchos sistemas ampliamente utiizados adoptaron un sistema relacionado pero con una base diferente conocido como B<systemd>(1) en el cual el proceso de inicio se describe en su B<bootup>(7) asociado.
fr: La description suivante s'applique aux systèmes basés sur System V release 4. Cependant, un certain nombre de systèmes très répandus ont adopté une approche semblable mais fondamentalement différente appelée B<systemd>(1), pour laquelle le processus de démarrage est détaillé dans B<bootup>(7).

source: When I</sbin/init> starts, it reads I</etc/inittab> for further instructions. This file defines what should be run when the I</sbin/init> program is instructed to enter a particular I<run-level>, giving the administrator an easy way to establish an environment for some usage; each run-level is associated with a set of services (for example, run-level B<S> is I<single-user> mode, and run-level B<2> entails running most network services).
es: Cuando se inicia I</sbin/init>, éste lee I</etc/inittab> en busca de instrucciones. En este archivo se define qué debe ejecutarse según el I<nivel de ejecución> permitiendo al administrador del sistema definir el entorno para ciertos usos de forma sencilla. Cada nivel de ejecución está asociado a un conjunto de servicios. Por ejemplo: el nivel de ejecución B<S> es el modo I<monousuario> y el nivel de ejecución B<2> implica la ejecución de la mayoría de servicios de red.
fr: Lorsque I</sbin/init> démarre, il lit I</etc/inittab> pour y trouver ses instructions. Ce fichier définit ce qui doit s'exécuter lorsque le programme I</sbin/init> doit entrer dans un mode de fonctionnement (I<run-level> particulier. Cela donne à l'administrateur une méthode simple pour établir un environnement pour un usage donné. Chaque mode de fonctionnement est associé à un ensemble de services (par exemple, B<S> correspond à un mode maintenance (I<single-user>) et B<2> implique le fonctionnement de la plupart des services réseaux).

source: The administrator may change the current run-level via B<init>(1), and query the current run-level via B<runlevel>(8).
es: El administrador puede modificar el nivel de ejecución actual mediante B<init>(1) y ver el que está actualmente en ejecución con B<runlevel>(8).
fr: L'administrateur peut modifier le mode de fonctionnement grâce à B<init>(1) et consulter le mode de fonctionnement actuel avec B<runlevel>(8).

source: However, since it is not convenient to manage individual services by editing this file, I</etc/inittab> only bootstraps a set of scripts that actually start/stop the individual services.
es: Sin embargo, puesto que no es conveniente gestionar los servicios individuales editando directamente este archivo, I</etc/inittab> solamente lanza un conjunto de scripts que son los que realmente arrancan/paran los servicios individuales.
fr: Toutefois, comme il n'est pas pratique de gérer les services individuellement en éditant ce fichier, I</etc/inittab> se limite à l'appel d'un ensemble de scripts qui démarrent/arrêtent les services.

source: Boot scripts
es: Scripts de inicio
fr: Scripts de démarrage

source: The following description applies to an OS based on UNIX System V Release 4. However, a number of widely used systems (Slackware Linux, FreeBSD, OpenBSD) have a somewhat different scheme for boot scripts.
es: La siguiente descripción se aplica a los sistemas basados en la versión de Unix System V. Sin embargo, algunos sistemas ampliamente usados (Slackware Linux, FreeBSD, OpenBSD) tienen una estructura para los scripts de inicio algo diferente.
fr: La description suivante s'applique aux systèmes basés sur System V release 4. Cependant, un certain nombre de systèmes très répandus (Slackware Linux, FreeBSD, OpenBSD) utilisent un procédé quelque peu différent pour les scripts de démarrage.

source: For each managed service (mail, nfs server, cron, etc.), there is a single startup script located in a specific directory (I</etc/init.d> in most versions of Linux). Each of these scripts accepts as a single argument the word "start" (causing it to start the service) or the word \&"stop" (causing it to stop the service). The script may optionally accept other "convenience" parameters (e.g., "restart" to stop and then start, "status" to display the service status, etc.). Running the script without parameters displays the possible arguments.
es: Para cada servicio gestionado (mail, nfs server, cron, etc.) hay un único script de inicialización ubicado en un directorio específico (I</etc/init.d> en la mayoría de versiones de Linux). Cada uno de estos scripts acepta como único argumento la palabra 'start' (haciendo que se inicie el servicio) y la palabra 'stop' (hace que se detenga). También podrán aceptar otros argumentos a conveniencia como por ejemplo 'restart' que hace que se detenga y se vuelva a iniciar, 'status' que muestra el estado en que se encuentra el servicio, etc... Si se ejecuta sin ningún argumento, se listan todas las posibilidades que ofrece.
fr: Pour chaque service géré (messagerie, serveur nfs, cron, etc.), il existe un script de démarrage simple stocké dans un répertoire spécifique (I</etc/init.d> dans la majorité des versions de Linux). Chacun de ces scripts accepte en unique argument le mot «\ start\ » (dont l'effet est le lancement du service) ou le mot «\ stop\ » (pour arrêter le service). Le script peut éventuellement accepter d'autres paramètres pratiques (par exemple\ : «\ restart\ », enchaîne un «\ stop\ » suivi d'un «\ start\ », «\ status\ » donne l'état du service). Un appel du script sans argument permet d'afficher tous ceux possibles.

source: Sequencing directories
es: Directorios de ejecución en orden
fr: Répertoires d'ordonnancement

source: To make specific scripts start/stop at specific run-levels and in a specific order, there are I<sequencing directories>, normally of the form I</etc/rc[0-6S].d>. In each of these directories, there are links (usually symbolic) to the scripts in the I</etc/init.d> directory.
es: Para conseguir que ciertos scripts se inicien o se paren en diferentes niveles de ejecución y en un orden concreto, se crearon los I<directorios de ejecución en orden>. Se encuentran habitualmente en I</etc/rc[0-6S].d>. En cada uno de estos directorios hay enlaces (normalmente simbólicos) a los scripts que se encuentran en el directorio I</etc/init.d>.
fr: Pour permettre aux scripts spécifiques de démarrer/arrêter dans un mode de fonctionnement (run-level) spécifique et dans un ordre particulier, il y a des B<répertoires d'ordonnancement>. Ce sont généralement I</etc/rc[0-6S].d>. Dans chacun de ces répertoires, il y a des liens (généralement symboliques) vers les scripts du répertoire I</etc/init.d>.

source: A primary script (usually I</etc/rc>) is called from B<inittab>(5); this primary script calls each service's script via a link in the relevant sequencing directory. Each link whose name begins with \(aqS\(aq is called with the argument "start" (thereby starting the service). Each link whose name begins with \(aqK\(aq is called with the argument "stop" (thereby stopping the service).
es: Un script principal (normalmente I</etc/rc>) es llamado desde B<inittab>(5) y es el encargado de invocar a los scripts de servicios a través de los enlaces de los directorios de ejecución en orden. Todos los enlaces cuyo nombre comienza con \(aqS\(aq son invocados con el argumento 'start' (por tanto, iniciando el servicio). Todos los enlaces que comienzan con \(aqK\(aq son invocados con el argumento 'stop' (por tanto, deteniendo el servicio).
fr: Un premier script (souvent I</etc/rc>) est appelé par B<inittab>(5) et appelle lui-même le script de chaque service grâce à un lien dans le répertoire d'ordonnancement correspondant. Tous les liens dont le nom commence par «\ S\ » sont appelés avec l'argument «\ start\ » (et démarrent le service concerné). Tous les liens dont le nom commence par «\ K\ » sont appelés avec l'argument «\ stop\ » (et arrêtent le service concerné).

source: To define the starting or stopping order within the same run-level, the name of a link contains an B<order-number>. Also, for clarity, the name of a link usually ends with the name of the service to which it refers. For example, the link I</etc/rc2.d/S80sendmail> starts the sendmail service on runlevel 2. This happens after I</etc/rc2.d/S12syslog> is run but before I</etc/rc2.d/S90xfs> is run.
es: Para establecer el orden de inico o parada dentro de un mismo nivel de ejecución, los nombres de los enlaces contienen B<números de orden>. Además, para hacer los nombres más claros, éstos terminan habitualmente con el nombre del servicio al que se refieren. Ejemplo: el enlace I</etc/rc2.d/S80sendmail> lanza el servicio sendmail en el nivel de ejecución 2. Esto ocurriría después de ejecutar I</etc/rc2.d/S12syslog> pero antes de ejecutar I</etc/rc2.d/S90xfs>.
fr: Pour définir l'ordre de démarrage ou d'arrêt au sein d'un même run-level, le nom d'un lien contient un B<numéro d'ordre>. Aussi, pour rendre les noms plus clairs, ceux-ci se terminent par le nom du service auquel ils se réfèrent. Exemple\ : le lien I</etc/rc2.d/S80sendmail> démarre le service sendmail dans le run-level 2. Cela est fait après l'exécution de I</etc/rc2.d/S12syslog> mais avant celle de I</etc/rc2.d/S90xfs>.

source: To manage these links is to manage the boot order and run-levels; under many systems, there are tools to help with this task (e.g., B<chkconfig>(8)).
es: Para gestionar el orden de inicio y los niveles de ejecución, tenemos que manejar estos enlaces. En muchos sistemas, existen herramientas que para esta tarea (p.ej: B<chkconfig>(8)).
fr: Gérer ces liens revient à gérer l'ordre de démarrage et les run-levels. Toutefois, sur beaucoup de systèmes, il existe des outils qui facilitent cela (exemple\ : B<chkconfig>(8)).

source: Boot configuration
es: Configuración de inicio
fr: Configuration de démarrage

source: A program that provides a service is often called a "B<daemon>". Usually, a daemon may receive various command-line options and parameters. To allow a system administrator to change these inputs without editing an entire boot script, some separate configuration file is used, and is located in a specific directory where an associated boot script may find it (I</etc/sysconfig> on older Red Hat systems).
es: Una aplicación que proporciona un servicio suele denominarse B<demonio>. Normalmente, los demonios lanzados pueden recibir opciones y parámetros en la línea de órdenes de manera opcional. Para permitir a los administradores de sistemas cambiar estos parámetros sin editar los scripts de inicio, se utilizan los archivos de configuración. Éstos están localizados en un directorio específico (I</etc/sysconfig> en sistemas RedHat antiguos) y son utilizados por los scripts de inicio.
fr: Un programme fournissant un service est souvent appelé « B<démon> ». Habituellement, un démon peut recevoir des options et arguments sur la ligne de commande. Pour permettre aux administrateurs système de modifier ces paramètres sans éditer un script complet de démarrage, un fichier de configuration séparé est utilisé. Il est stocké dans un répertoire spécifique (I</etc/sysconfig> sur les anciens systèmes Red Hat) où un script de démarrage associé pourra le trouver.
