Repository: sebras/manpages-l10n
Catalog: po/*/man7/boot.7.po
Languages: es, fr

source: In older UNIX systems, such a file contained the actual command line options for a daemon, but in modern Linux systems (and also in HP-UX), it just contains shell variables. A boot script in I</etc/init.d> reads and includes its configuration file (that is, it "B<sources>" its configuration file) and then uses the variable values.
es: En versiones antiguas de Unix, estos archivos contenían las opciones de línea de órdenes reales para un demonios, pero en sistemas Linux modernos (y también en HP-UX), tan solo contienen variables de la shell. Los scripts de inicio en I</etc/init.d> leen e incluyen sus archivos de configuración y usan los valores de las variables.
fr: Sur les anciens systèmes UNIX, ces fichiers contenaient les options de ligne de commande pour les démons, mais sur les systèmes Linux modernes (et aussi sur HP-UX), ces fichiers contiennent uniquement des variables shell. Un script de démarrage dans le répertoire I</etc/init.d> lit et incorpore son fichier de configuration (il « source » le fichier de configuration) et utilise ensuite les valeurs des variables.

source: FILES
es: ARCHIVOS
fr: FICHIERS

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page, peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: hardware
fr: matériel

source: Hardware
fr: Matériel

source: This page is part of release 5.11 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.11 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page, peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.04 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
