Repository: sebras/manpages-l10n
Catalog: po/*/man7/cgroup_namespaces.7.po
Languages: de

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG

source: cgroup_namespaces - overview of Linux cgroup namespaces
de: cgroup_namespaces - Überblick über Linux-Cgroup-Namensräume

source: DESCRIPTION
de: BESCHREIBUNG

source: For an overview of namespaces, see B<namespaces>(7).
de: Für einen Überblick über Namensräume, siehe B<namespaces>(7).

source: Cgroup namespaces virtualize the view of a process's cgroups (see B<cgroups>(7)) as seen via I</proc/>pidI</cgroup> and I</proc/>pidI</mountinfo>.
de: Cgroup-Namensräume virtualisieren den Blick auf die Cgroups eines Prozesses (siehe B<cgroups>(7)), wie er mittels I</proc/>PIDI</cgroup> und I</proc/>PIDI</mountinfo> gesehen wird.

source: Each cgroup namespace has its own set of cgroup root directories. These root directories are the base points for the relative locations displayed in the corresponding records in the I</proc/>pidI</cgroup> file. When a process creates a new cgroup namespace using B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag, its current cgroups directories become the cgroup root directories of the new namespace. (This applies both for the cgroups version 1 hierarchies and the cgroups version 2 unified hierarchy.)
de: Jeder Cgroup-Namensraum hat seine eigene Gruppe an Cgroup-Wurzelverzeichnissen. Diese Wurzelverzeichnisse sind die Basispunkte der relativen Orte, die in den entsprechenden Datensätzen in der Datei I</proc/>PIDI</cgroup> angezeigt werden. Wenn ein Prozess mittels B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWCGROUP> einen neuen Cgroup-Namensraum erstellt, werden seine aktuellen Cgroup-Verzeichnisse das Cgroup-Wurzelverzeichnis des neuen Namensraumes. (Dies gilt sowohl für die Cgroup-Version-1-Hierarchien als auch die vereinigte Cgroup-Version-2-Hierarchie.)

source: When reading the cgroup memberships of a "target" process from I</proc/>pidI</cgroup>, the pathname shown in the third field of each record will be relative to the reading process's root directory for the corresponding cgroup hierarchy. If the cgroup directory of the target process lies outside the root directory of the reading process's cgroup namespace, then the pathname will show I<../> entries for each ancestor level in the cgroup hierarchy.
de: Wenn die Cgroup-Mitgliedschaft eines »Ziel«-Prozesses aus I</proc/>PIDI</cgroup> gelesen wird, wird der im dritten Feld jedes Datensatzes angezeigte Pfadname relativ zu dem Wurzelverzeichnis der entsprechenden Cgroup-Hierarchie des lesenden Prozesses sein. Falls das Cgroup-Verzeichnis des Zielprozesses außerhalb des Wurzelverzeichnisses des Cgroup-Namensraums des lesenden Prozesses liegt, dann wird der Pfadname I<../>-Einträge für jede Vorgängerstufe in der Cgroup-Hierarchie anzeigen.

source: The following shell session demonstrates the effect of creating a new cgroup namespace.
de: Die folgende Shell-Sitzung zeigt die Auswirkung der Erstellung eines neuen Cgroup-Namensraumes.

source: First, (as superuser) in a shell in the initial cgroup namespace, we create a child cgroup in the I<freezer> hierarchy, and place a process in that cgroup that we will use as part of the demonstration below:
de: Zuerst wird (als Systemverwalter) in einer Shell im anfänglichen Cgroup-Namensraum eine Nachfolger-Cgroup in der I<freezer>-Hierarchie erstellt und ein Prozess in dieser Cgroup abgelegt, der als Teil der nachfolgenden Vorstellung verwandt wird:

source: # B<mkdir -p /sys/fs/cgroup/freezer/sub2> # B<sleep 10000 &> # Create a process that lives for a while [1] 20124 # B<echo 20124 E<gt> /sys/fs/cgroup/freezer/sub2/cgroup.procs>
de: # B<mkdir -p /sys/fs/cgroup/freezer/sub2> # B<sleep 10000 &> # Erzeugung eines Unterprozesses, der eine Zeit lebt [1] 20124 # B<echo 20124 E<gt> /sys/fs/cgroup/freezer/sub2/cgroup.procs>

source: We then create another child cgroup in the I<freezer> hierarchy and put the shell into that cgroup:
de: Dann wird eine andere Cgroup in der I<freezer>-Hierachie erstellt und die Shell in diese Gruppe versetzt:

source: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # Show PID of this shell 30655 # B<echo 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub
de: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # PID dieser Shell zeigen 30655 # B<echo 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub

source: Next, we use B<unshare>(1) to create a process running a new shell in new cgroup and mount namespaces:
de: Als nächstes wird B<unshare>(1) verwandt, um einen Prozess zu erzeugen, der in einer neuen Shell in dem neuen Cgroup- und Einhängenamensraum läuft:

source: From the new shell started by B<unshare>(1), we then inspect the I</proc/>pidI</cgroup> files of, respectively, the new shell, a process that is in the initial cgroup namespace (I<init>, with PID 1), and the process in the sibling cgroup (I<sub2>):
de: Von der neuen durch B<unshare>(1) gestarteten Shell werden dann die Dateien I</proc/>PIDI</cgroup> der neuen Shell, eines Prozesse in dem anfänglichen Cgroup-Namensraum ((I<init> mit PID 1) bzw. des Prozesses in der benachbarten Cgroup (I<sub2>) untersucht:

source: From the output of the first command, we see that the freezer cgroup membership of the new shell (which is in the same cgroup as the initial shell) is shown defined relative to the freezer cgroup root directory that was established when the new cgroup namespace was created. (In absolute terms, the new shell is in the I</sub> freezer cgroup, and the root directory of the freezer cgroup hierarchy in the new cgroup namespace is also I</sub>. Thus, the new shell's cgroup membership is displayed as \(aq/\(aq.)
de: In der Ausgabe des ersten Befehls kann gesehen werden, dass die Freezer-Cgroup-Mitgliedschaft der neuen Shell (die in der gleichen Cgroup wie die anfängliche Shell ist) relativ zum Wurzelverzeichnis der Freezer-Cgroup definiert angezeigt wird, die etabliert wurde, als der neue Cgroup-Namensraum erstellt wurde. (Absolut gesehen ist die neue Shell in der Freezer-Cgroup I</sub> und das Wurzelverzeichnis der Freezer-Cgroup-Hierarchie in dem neuen Cgroup-Namensraum auch I</sub>. Daher wird die Cgroup-Mitgliedschaft der neuen Shell als »/« angezeigt.)

source: However, when we look in I</proc/self/mountinfo> we see the following anomaly:
de: Wird allerdings in I</proc/self/mountinfo> geschaut, taucht folgende Anomalie auf:

source: The fourth field of this line (I</..>) should show the directory in the cgroup filesystem which forms the root of this mount. Since by the definition of cgroup namespaces, the process's current freezer cgroup directory became its root freezer cgroup directory, we should see \(aq/\(aq in this field. The problem here is that we are seeing a mount entry for the cgroup filesystem corresponding to the initial cgroup namespace (whose cgroup filesystem is indeed rooted at the parent directory of I<sub>). To fix this problem, we must remount the freezer cgroup filesystem from the new shell (i.e., perform the mount from a process that is in the new cgroup namespace), after which we see the expected results:
de: Das vierte Feld dieser Zeile (I</..>) sollte das Verzeichnis in dem Cgroup-Dateisystem anzeigen, das die Wurzel dieser Einhängung formt. Da per Definition von Cgroup-Namensräumen das aktuelle Freezer-Cgroup-Verzeichnis des aktuellen Prozesses sein Wurzel-Freezer-Cgroup-Verzeichnis wurde, sollte in diesem Feld »/« auftauchen. Das Problem hier ist, dass ein Einhängeeintrag für das Cgroup-Dateisystem gezeigt wird, das dem anfänglichen Cgroup-Namensraum entspricht (dessen Cgroup-Dateisystem tatsächlich am übergeordneten Verzeichnis von I<sub> verwurzelt ist). Um dieses Problem zu beheben, muss das Freezer-Cgroup-Dateisystem aus der neuen Shell neu eingehängt werden (d.h. die Einhängung muss von einem Prozess durchgeführt werden, der in dem neuen Cgroup-Namensraum ist). Danach kann das erwartete Ergebnis gesehen werden:

source: sh2# B<mount --make-rslave /> # Don\(aqt propagate mount events # to other namespaces sh2# B<umount /sys/fs/cgroup/freezer> sh2# B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> sh2# B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime ...
de: sh2# B<mount --make-rslave /> # Einhänge-Ereignisse nicht in # andere Namensräume weiterleiten sh2# B<umount /sys/fs/cgroup/freezer> sh2# B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> sh2# B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime …

source: Namespaces are a Linux-specific feature.
de: Namensräume sind eine Linux-spezifische Funktionalität.

source: NOTES
de: ANMERKUNGEN

source: Use of cgroup namespaces requires a kernel that is configured with the B<CONFIG_CGROUPS> option.
de: Die Verwendung von Cgroup-Namensräumen benötigt einen Kernel, der mit der Option B<CONFIG_CGROUPS> konfiguriert ist.

source: The virtualization provided by cgroup namespaces serves a number of purposes:
de: Die durch Cgroup-Namensräume bereitgestellte Virtualisierung dient einer Reihe von Zwecken:

source: It prevents information leaks whereby cgroup directory paths outside of a container would otherwise be visible to processes in the container. Such leakages could, for example, reveal information about the container framework to containerized applications.
de: Sie verhindert Informationslecks, durch die Cgroup-Verzeichnispfade außerhalb eines Containers andernfalls für Prozesse innerhalb des Containers sichtbar sind. Solche Lecks könnten beispielsweise Informationen über das umgebende Container-System an Anwendungen innerhalb von Containern offenlegen.

source: It eases tasks such as container migration. The virtualization provided by cgroup namespaces allows containers to be isolated from knowledge of the pathnames of ancestor cgroups. Without such isolation, the full cgroup pathnames (displayed in I</proc/self/cgroups>) would need to be replicated on the target system when migrating a container; those pathnames would also need to be unique, so that they don't conflict with other pathnames on the target system.
de: Sie erleichtern Aufgaben wie Container-Migration. Die durch Cgroup-Namensräume bereitgestellte Virtualisierung erlaubt es, Container vom Wissen über die Pfadnamen von Vorgängern-Cgroups zu isolieren. Ohne solche Isolierungen müssten die vollständigen Cgroup-Pfadnamen (angezeigt in I</proc/self/cgroups>) auf dem Zielsystem bei der Migration eines Containers repliziert werden; diese Pfadnamen müssten auch eindeutig sein, so dass sie nicht zu anderen Pfadnamen auf dem Zielsystem in Konflikt stehen.

source: It allows better confinement of containerized processes, because it is possible to mount the container's cgroup filesystems such that the container processes can't gain access to ancestor cgroup directories. Consider, for example, the following scenario:
de: Sie erlauben bessere Einsperrungen von Prozessen in Containern, da es möglich ist, das Cgroup-Dateisystem des Containers so einzuhängen, dass der Prozess im Container keinen Zugriff auf die Vorgänger-Cgroup-Verzeichnisse erlangen kann. Betrachten Sie beispielsweise folgendes Szenario:

source: We have a cgroup directory, I</cg/1>, that is owned by user ID 9000.
de: Es gibt ein Cgroup-Verzeichnis I</cg/1>, das der Benutzerkennung 9000 gehört.

source: We have a process, I<X>, also owned by user ID 9000, that is namespaced under the cgroup I</cg/1/2> (i.e., I<X> was placed in a new cgroup namespace via B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag).
de: Es gibt einen Prozess I<X>, der auch der Benutzerkennung 9000 gehört, der im Namensraum unterhalb der Cgroup I</cg/1/2> ist (d.h. I<X> wurde in einen neuen Cgroup-Namensraum mittels B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWCGROUP> gebracht).

source: In the absence of cgroup namespacing, because the cgroup directory I</cg/1> is owned (and writable) by UID 9000 and process I<X> is also owned by user ID 9000, process I<X> would be able to modify the contents of cgroups files (i.e., change cgroup settings) not only in I</cg/1/2> but also in the ancestor cgroup directory I</cg/1>. Namespacing process I<X> under the cgroup directory I</cg/1/2>, in combination with suitable mount operations for the cgroup filesystem (as shown above), prevents it modifying files in I</cg/1>, since it cannot even see the contents of that directory (or of further removed cgroup ancestor directories). Combined with correct enforcement of hierarchical limits, this prevents process I<X> from escaping the limits imposed by ancestor cgroups.
de: Da das Cgroup-Verzeichnis I</cg/1> der UID 9000 gehört (und für sie schreibbar ist) und I<X> auch der UID 9000 gehört, wäre der Prozess I<X>, in Abwesenheit von Cgroup-Namensräumen, in der Lage, die Inhalte der Cgroup-Dateien zu verändern (d.h. die Cgroup-Einstellungen zu ändern), nicht nur in I</cg/1/2>, sondern auch in dem Vorgänger-Cgroup-Verzeichnis I</cg/1>. Da der Prozess I<X> im Namensraum unter dem Cgroup-Verzeichnis I</cg/1/2> ist, wird, in Zusammenhang mit geeigneten Einhängeaktionen für das Cgroup-Dateisystem (wie oben gezeigt), verhindert, dass er Dateien in I</cg/1> verändert, da er noch nicht einmal die Inhalte dieses Verzeichnisses (oder von weiter entfernten Cgroup-Vorgänger-Verzeichnissen) sehen kann. In Zusammenspiel mit der korrekten Durchsetzung von hierarchischen Beschränkungen verhindert dies, dass Prozess I<X> diesen von den Vorgänger-Cgroups auferlegten Beschränkungen entkommt.

source: SEE ALSO
de: SIEHE AUCH

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: Cgroup namespaces virtualize the view of a process's cgroups (see B<cgroups>(7)) as seen via I</proc/[pid]/cgroup> and I</proc/[pid]/mountinfo>.
de: Cgroup-Namensräume virtualisieren den Blick auf die Cgroups eines Prozesses (siehe B<cgroups>(7)), wie er mittels I</proc/[PID]/cgroup> und I</proc/[PID]/mountinfo> gesehen wird.

source: Each cgroup namespace has its own set of cgroup root directories. These root directories are the base points for the relative locations displayed in the corresponding records in the I</proc/[pid]/cgroup> file. When a process creates a new cgroup namespace using B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag, its current cgroups directories become the cgroup root directories of the new namespace. (This applies both for the cgroups version 1 hierarchies and the cgroups version 2 unified hierarchy.)
de: Jeder Cgroup-Namensraum hat seine eigene Gruppe an Cgroup-Wurzelverzeichnissen. Diese Wurzelverzeichnisse sind die Basispunkte der relativen Orte, die in den entsprechenden Datensätzen in der Datei I</proc/[PID]/cgroup> angezeigt werden. Wenn ein Prozess mittels B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWCGROUP> einen neuen Cgroup-Namensraum erstellt, werden seine aktuellen Cgroup-Verzeichnisse das Cgroup-Wurzelverzeichnis des neuen Namensraumes. (Dies gilt sowohl für die Cgroup-Version-1-Hierarchien als auch die vereinigte Cgroup-Version-2-Hierarchie.)

source: When reading the cgroup memberships of a "target" process from I</proc/[pid]/cgroup>, the pathname shown in the third field of each record will be relative to the reading process's root directory for the corresponding cgroup hierarchy. If the cgroup directory of the target process lies outside the root directory of the reading process's cgroup namespace, then the pathname will show I<../> entries for each ancestor level in the cgroup hierarchy.
de: Wenn die Cgroup-Mitgliedschaft eines »Ziel«-Prozesses aus I</proc/[PID]/cgroup> gelesen wird, wird der im dritten Feld jedes Datensatzes angezeigte Pfadname relativ zu dem Wurzelverzeichnis der entsprechenden Cgroup-Hierarchie des lesenden Prozesses sein. Falls das Cgroup-Verzeichnis des Zielprozesses außerhalb des Wurzelverzeichnisses des Cgroup-Namensraums des lesenden Prozesses liegt, dann wird der Pfadname I<../>-Einträge für jede Vorgängerstufe in der Cgroup-Hierarchie anzeigen.

source: From the new shell started by B<unshare>(1), we then inspect the I</proc/[pid]/cgroup> files of, respectively, the new shell, a process that is in the initial cgroup namespace (I<init>, with PID 1), and the process in the sibling cgroup (I<sub2>):
de: Von der neuen durch B<unshare>(1) gestarteten Shell werden dann die Dateien I</proc/[PID]/cgroup> der neuen Shell, eines Prozesse in dem anfänglichen Cgroup-Namensraum ((I<init> mit PID 1) bzw. des Prozesses in der benachbarten Cgroup (I<sub2>) untersucht:

source: CONFORMING TO
de: KONFORM ZU

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: Each cgroup namespace has its own set of cgroup root directories. These root directories are the base points for the relative locations displayed in the corresponding records in the I</proc/[pid]/cgroup> file. When a process creates a new cgroup namespace using B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag, it enters a new cgroup namespace in which its current cgroups directories become the cgroup root directories of the new namespace. (This applies both for the cgroups version 1 hierarchies and the cgroups version 2 unified hierarchy.)
de: Jeder Cgroup-Namensraum hat seine eigene Gruppe an Cgroup-Wurzelverzeichnissen. Diese Wurzelverzeichnisse sind die Basispunkte der relativen Orte, die in den entsprechenden Datensätzen in der Datei I</proc/[PID]/cgroup> angezeigt werden. Wenn ein Prozess mittels B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWCGROUP> einen neuen Cgroup-Namensraum erstellt, dann betritt er einen neuen Cgroup-Namensraum, in dem seine aktuellen Cgroup-Verzeichnisse das Cgroup-Wurzelverzeichnis des neuen Namensraumes werden. (Dies gilt sowohl für die Cgroup-Version-1-Hierarchien als auch die vereinigte Cgroup-Version-2-Hierarchie.)

source: When viewing I</proc/[pid]/cgroup>, the pathname shown in the third field of each record will be relative to the reading process's root directory for the corresponding cgroup hierarchy. If the cgroup directory of the target process lies outside the root directory of the reading process's cgroup namespace, then the pathname will show I<../> entries for each ancestor level in the cgroup hierarchy.
de: Wenn I</proc/[PID]/cgroup> betrachtet wird, wird der im dritten Feld jedes Datensatzes angezeigte Pfadname relativ zu dem Wurzelverzeichnis der entsprechenden Cgroup-Hierarchie des lesenden Prozesses sein. Falls das Cgroup-Verzeichnis des Zielprozesses außerhalb des Wurzelverzeichnisses des Cgroup-Namensraums des lesenden Prozesses liegt, dann wird der Pfadname I<../>-Einträge für jede Vorgängerstufe in der Cgroup-Hierarchie anzeigen.

source: The following shell session demonstrates the effect of creating a new cgroup namespace. First, (as superuser) we create a child cgroup in the I<freezer> hierarchy, and put the shell into that cgroup:
de: Die folgende Shell-Sitzung zeigt die Auswirkung der Erstellung eines neuen Cgroup-Namensraumes. Zuerst erstellen wir (als Systemverwalter) eine Nachfolger-Cgroup in der I<freezer>-Hierarchie und legen eine Shell in diese Cgroup ab:

source: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # Show PID of this shell 30655 # B<sh -c \(aqecho 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs\(aq> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub
de: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # PID dieser Shell zeigen 30655 # B<sh -c \(aqecho 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs\(aq> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub

source: We then inspect the I</proc/[pid]/cgroup> files of, respectively, the new shell process started by the B<unshare>(1) command, a process that is in the original cgroup namespace (I<init>, with PID 1), and a process in a sibling cgroup (I<sub2>):
de: Dann werden die Dateien I</proc/[PID]/cgroup> der neuen Shell, die mit dem Befehl B<unshare>(1) gestartet wurde, eines Prozesses in dem ursprünglichen Cgroup-Namensraum ((I<init> mit PID 1) bzw. eines Prozesses in einer benachbarten Cgroup (I<sub2>) untersucht:

source: The fourth field of this line (I</..>) should show the directory in the cgroup filesystem which forms the root of this mount. Since by the definition of cgroup namespaces, the process's current freezer cgroup directory became its root freezer cgroup directory, we should see \(aq/\(aq in this field. The problem here is that we are seeing a mount entry for the cgroup filesystem corresponding to our initial shell process's cgroup namespace (whose cgroup filesystem is indeed rooted in the parent directory of I<sub>). We need to remount the freezer cgroup filesystem inside this cgroup namespace, after which we see the expected results:
de: Das vierte Feld dieser Zeile (I</..>) sollte das Verzeichnis in dem Cgroup-Dateisystem anzeigen, das die Wurzel dieser Einhängung formt. Da per Definition von Cgroup-Namensräumen das aktuelle Freezer-Cgroup-Verzeichnis des aktuellen Prozesses sein Wurzel-Freezer-Cgroup-Verzeichnis wurde, sollte in diesem Feld »/« auftauchen. Das Problem hier ist, dass ein Einhängeeintrag für das Cgroup-Dateisystem gezeigt wird, das dem anfänglichen Cgroup-Namensraum des Shell-Prozesses entspricht (dessen Cgroup-Dateisystem tatsächlich am übergeordneten Verzeichnis von I<sub> verwurzelt ist). Es muss das Freezer-Cgroup-Dateisystem innerhalb dieses Cgroup-Namensraums neu eingehängt werden. Danach kann das erwartete Ergebnis gesehen werden:

source: # B<mount --make-rslave /> # Don't propagate mount events # to other namespaces # B<umount /sys/fs/cgroup/freezer> # B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> # B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime ...
de: # B<mount --make-rslave /> # Einhänge-Ereignisse nicht in # andere Namensräume weiterleiten # B<umount /sys/fs/cgroup/freezer> # B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> # B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime …

source: Among the purposes served by the virtualization provided by cgroup namespaces are the following:
de: Die durch Cgroup-Namensräume bereitgestellte Virtualisierung dient unter anderem folgenden Zwecken:
