Repository: sebras/manpages-l10n
Catalog: po/*/man7/cgroup_namespaces.7.po
Languages: de

source: In the absence of cgroup namespacing, because the cgroup directory I</cg/1> is owned (and writable) by UID 9000 and process I<X> is also owned by user ID 9000, then process I<X> would be able to modify the contents of cgroups files (i.e., change cgroup settings) not only in I</cg/1/2> but also in the ancestor cgroup directory I</cg/1>. Namespacing process I<X> under the cgroup directory I</cg/1/2>, in combination with suitable mount operations for the cgroup filesystem (as shown above), prevents it modifying files in I</cg/1>, since it cannot even see the contents of that directory (or of further removed cgroup ancestor directories). Combined with correct enforcement of hierarchical limits, this prevents process I<X> from escaping the limits imposed by ancestor cgroups.
de: Da das Cgroup-Verzeichnis I</cg/1> der UID 9000 gehört (und für sie schreibbar ist) und I<X> auch der UID 9000 gehört, wäre der Prozess I<X>, in Abwesenheit von Cgroup-Namensräumen, in der Lage, die Inhalte der Cgroup-Dateien zu verändern (d.h. die Cgroup-Einstellungen zu ändern), nicht nur in I</cg/1/2>, sondern auch in dem Vorgänger-Cgroup-Verzeichnis I</cg/1>. Da der Prozess I<X> im Namensraum unter dem Cgroup-Verzeichnis I</cg/1/2> ist, wird, in Zusammenhang mit geeigneten Einhängeaktionen für das Cgroup-Dateisystem (wie oben gezeigt), verhindert, dass es Dateien in I</cg/1> verändert, da es noch nicht einmal die Inhalte dieses Verzeichnisses (oder von weiter entfernten Cgroup-Vorgänger-Verzeichnissen) sehen kann. In Zusammenspiel mit der korrekten Durchsetzung von hierarchischen Beschränkungen verhindert dies, dass Prozess I<X> diesen von den Vorgänger-Cgroups auferlegten Beschränkungen entkommt.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
