Repository: sebras/manpages-l10n
Catalog: po/*/man7/charsets.7.po
Languages: es, it

source: NAME
es: NOMBRE
it: NOME

source: charsets - character set standards and internationalization
es: charsets - internacionalización y estándares de conjuntos de caracteres
it: charsets - gli standard degli insiemi di caratteri e internazionalizzazione

source: DESCRIPTION
es: DESCRIPCIÓN
it: DESCRIZIONE

source: This manual page gives an overview on different character set standards and how they were used on Linux before Unicode became ubiquitous. Some of this information is still helpful for people working with legacy systems and documents.
es: Esta página de manual proporciona un breve repaso a los distintos estándares de codificación de caracteres y el modo en que se emplearon en Linux antes de que Unicode los reemplazase a todos. Alguna de esta información continúa siendo útil para las personas que trabajen con equipo o documentación antiguos.
it: Questa pagina di manuale fa una panoramica sui diversi standard per gli insiemi di caratteri e su come sono stati usati in Linux prima che Unicode diventasse onnipresente. Alcune di queste informazioni sono ancora utili per le persone che lavorano con sistemi e documentazione datati.

source: Standards discussed include such as ASCII, GB 2312, ISO 8859, JIS, KOI8-R, KS, and Unicode.
es: Se incluye información acerca de ASCII, GB 2312, ISO 8859, JIS, KOI8-R, KS y Unicode.
it: Gli standard discussi includono ASCII, GB 2312, ISO 8859, JIS, KOI8-R, KS, e Unicode.

source: The primary emphasis is on character sets that were actually used by locale character sets, not the myriad others that could be found in data from other systems.
es: Se enfatiza principalmente en las codificaciones que se pueden encontrar actualmente en las distintas localizaciones en lugar de en la miríada de ellas que pueden encontrarse en otros sistemas.
it: Verrà data maggiore importanza agli insiemi di caratteri effettivamente usati come insiemi di caratteri di localizzazione, non sulla miriade di altri insiemi presenti nei dati in altri sistemi.

source: ASCII (American Standard Code For Information Interchange) is the original 7-bit character set, originally designed for American English. Also known as US-ASCII. It is currently described by the ISO 646:1991 IRV (International Reference Version) standard.
es: ASCII (American Standard Code For Information Interchange, Código Estándar Americano para el Intercambio de Información) es el conjunto de caracteres original de 7 bits, diseñado inicialmente para el inglés americano. También llamado ASCII-US. Actualmente se describe en el estándar ISO 646:1991 IRV.
it: ASCII (American Standard Code For Information Interchange) è l'insieme di caratteri originale a 7 bit, creato in origine per l'inglese americano; è noto anche come US-ASCII. Viene ora descritto dallo standard ISO 646:1991 IRV (International Reference Version).

source: Various ASCII variants replacing the dollar sign with other currency symbols and replacing punctuation with non-English alphabetic characters to cover German, French, Spanish, and others in 7 bits emerged. All are deprecated; glibc does not support locales whose character sets are not true supersets of ASCII.
es: Existen diversas variantes del ASCII de 7 bits que reemplazan el signo del dolar por otros símbolos monetarios y caracteres de puntuación con caracteres alfabéticos no ingleses para cubrir el alemán, frances, español y otros. No se recomienda usar ningún de ellos; la libc de GNU no soporta localizaciones cuyos conjuntos de caracteres no sean verdaderos superconjuntos del ASCII.
it: Sono apparse diverse varianti ASCII che sostituiscono il simbolo del dollaro con i simboli di altre valute, e la punteggiatura con caratteri alfabetici non inglesi per includere altri caratteri a 7 bit tedeschi, francesi, spagnoli ed altri. Sono tutte deprecate, in quanto glibc non supporta localizzazioni in cui gli insiemi di caratteri non siano veri insiemi di ASCII.

source: As Unicode, when using UTF-8, is ASCII-compatible, plain ASCII text still renders properly on modern UTF-8 using systems.
es: Si se usa UTF-8, Unicode es compatible con ASCII por lo que el antiguo ASCII se verá perfectamente en sistemas modernos que utilicen UTF-8.
it: Poiché Unicode, quando si usa UTF-8, è compatibile con ASCII, un testo semplice in formato ASCII viene ugualmente interpretato correttamente sui sistemi moderni che usano UTF-8.

source: ISO 8859 is a series of 15 8-bit character sets, all of which have ASCII in their low (7-bit) half, invisible control characters in positions 128 to 159, and 96 fixed-width graphics in positions 160\(en255.
es: ISO 8859 es una serie de 15 conjuntos de caracteres de 8 bits, los cuales tienen como su primera mitad (7 bits) el ASCII, caracteres de control invisibles en las posiciones 128 a 159, y 96 gráficos fijos desde la posición 160 hasta la 255.
it: ISO 8859 è una serie di 15 insiemi di caratteri a 8 bit che contengono ASCII nella metà bassa (quella a 7 bit), caratteri invisibili di controllo nelle posizioni da 128 a 159 e 96 grafici a larghezza fissa nelle posizioni da 160 a 255.

source: Of these, the most important is ISO 8859-1 ("Latin Alphabet No .1" / Latin-1). It was widely adopted and supported by different systems, and is gradually being replaced with Unicode. The ISO 8859-1 characters are also the first 256 characters of Unicode.
es: El más importante es ISO 8859-1 (Alfabeto Latino nº1 / Latín 1). Fue ampliamente implementado en diversos sistemas y está siendo gradualmente sustituido por Unicode. Los primeros 256 caracteres de esta codificación coinciden con los 256 primeros caracteres de Unicode.
it: Di questi, il più importante è ISO 8859-1 ("Latin Alphabet No .1" / Latin-1). È adottato diffusamente e supportato da diversi sistemi, e lo si sta gradualmente sostituendo con Unicode.

source: Console support for the other 8859 character sets is available under Linux through user-mode utilities (such as B<setfont>(8)) that modify keyboard bindings and the EGA graphics table and employ the "user mapping" font table in the console driver.
es: El soporte de consola para los otros conjuntos de caracteres 8859 está disponible en Linux a través de utilidades de usuario (como B<setfont>(8)) que modifican las asociaciones de teclas y la tabla de gráficos EGA/VGA y emplean la tabla de tipos de letra de "correspondencia de usuario" en el controlador de consola.
it: Il supporto di console per gli altri insiemi di carattere 8859 è disponibile in Linux grazie a utilità in modalità utente (come B<setfont>(8)) che modificano le associazioni di tasti e la tabella grafica EGA, e impiegano una "mappa utente" per la tabella di caratteri nel driver di console.

source: Here are brief descriptions of each set:
es: Aquí se presentan breves descripciones de cada conjunto:
it: Ecco una breve descrizione di ciascun insieme:

source: Latin-3 was designed to cover of Esperanto, Maltese, and Turkish, but 8859-9 later superseded it for Turkish.
es: Latin-3 fue creado para el esperanto, el maltés y el turco aunque posteriormente el turco emplearía 8859-9.
it: Latin-3 è stato creato per esperanto, maltese e turco; per il turco è stato poi soppiantato da 8859-9.

source: Latin-4 introduced letters for North European languages such as Estonian, Latvian, and Lithuanian, but was superseded by 8859-10 and 8859-13.
es: Latin-4 introdujo letras para idiomas del norte de Europa como el estonio, letón y lituano. Fue reemplazado por 8859-10 (Latin-6) y 8859-13 (Latin 7).
it: Latin-4 ha introducotto lettere per le lingue nord-occidentali come estone, lettone e lituano, ma è stato soppiantato da 8859-10 e 8859-13.

source: Cyrillic letters supporting Bulgarian, Byelorussian, Macedonian, Russian, Serbian, and (almost completely) Ukrainian. It was never widely used, see the discussion of KOI8-R/KOI8-U below.
es: Letras cirílicas para el búlgaro, bielorruso, macedonio, ruso, serbio y (casi por completo) ucraniano. Nunca tuvo un amplio uso. Vea la discusión sobre el KOI8-R/KOI8-U más adelante.
it: Lettere cirilliche per bulgaro, bellorusso, macedone, russo, serbo e (quasi completamente) ucraino. Non è mai stato usato molto; vedere più avanti la discussione su KOI8-R.

source: Was created for Arabic. The 8859-6 glyph table is a fixed font of separate letter forms, but a proper display engine should combine these using the proper initial, medial, and final forms.
es: Para el árabe. La tabla de glifos 8859-6 es un tipo fijo de formas de letra separadas, pero un mecanismo de visualización correcto debería combinar éstas usando las formas iniciales, medias y finales apropiadas.
it: È stato creato per l'arabo. La tabella di glifi 8859-6 contiene un insieme di caratteri fissi con lettere distinte, ma un appropriato motore di visualizzazione dovrebbe combinarli usando le corrette forme iniziali, mediane e finali.

source: Was created for Modern Greek in 1987, updated in 2003.
es: Fue creado para el griego actual en 1987 y posteriormente actualizado en el año 2003.
it: È stato creato per il greco moderno nel 1987, e aggiornato nel 2003.

source: Supports Modern Hebrew without niqud (punctuation signs). Niqud and full-fledged Biblical Hebrew were outside the scope of this character set.
es: Para el hebreo moderno sin 'niqud' (signos de puntuación). Los 'niqud' y el hebreo bíblico 'oficial' se encuentran fuera del ámbito de este conjunto de caracteres; en Linux se prefiere la codificación UTF-8 para esto.
it: Supporta l'ebraico moderno senza niqud (segni di punteggiatura). Niqud e lo sviluppo completo dell'ebraico della Bibbia vanno al di là degli scopi di questo insieme di caratteri.

source: This is a variant of Latin-1 that replaces Icelandic letters with Turkish ones.
es: Ésta es una variante del Latin-1 que reemplaza letras islandesas con otras turcas.
it: Questa è una variante di Latin-1 che sostituisce le lettere islandesi con quelle turche.

source: Latin-6 added the Inuit (Greenlandic) and Sami (Lappish) letters that were missing in Latin-4 to cover the entire Nordic area.
es: El Latin 6 añade las últimas letras del inuit (esquimal de Groenlandia) y del sami (lapón) que faltaban en el Latin 4 para cubrir toda el área nórdica.
it: Latin-6 ha aggiunto le inuit (groenlandese) e sami (lappone) mancanti in Latin-4, così da coprire l'intera area nordica.

source: Supports the Thai alphabet and is nearly identical to the TIS-620 standard.
es: Implementa el alfabeto tailandés y es prácticamente idéntico al estándar TIS-620.
it: Supporta l'alfabeto thai ed è quasi era identica allo standard TIS-620.

source: This set does not exist.
es: Esta codificación no existe.
it: Questo insieme non esiste.

source: Supports the Baltic Rim languages; in particular, it includes Latvian characters not found in Latin-4.
es: Para las lenguas de la Ribera del Báltico; en particular, incluye los caracteres letones que no se encuentran en Latin-4.
it: Supporta il linguaggio baltico Rim: in particolare, include i caratteri lettoni non inseriti in Latin-4.

source: This is the Celtic character set, covering Old Irish, Manx, Gaelic, Welsh, Cornish, and Breton.
es: Éste es el conjunto de caracteres celta, que implementa: el antiguo irlandés, el gaélico manx, el galés, el gaélico, el cornuallés y el bretón.
it: Insieme di caratteri celtici, che comprende l'irlandese antico, la lingua dell'isola di Man, il gaelico, il gallese, la lingua della Cornovaglia e il bretone.

source: Latin-9 is similar to the widely used Latin-1 but replaces some less common symbols with the Euro sign and French and Finnish letters that were missing in Latin-1.
es: Latin-9 es parecido al -enormemente usado- Latin-1 salvo que reemplaza algunos de los símbolos menos usados con el símbolo del euro y algunos caracteres franceses y finlandeses no incuidos en Latin-1.
it: Latin-9 è simile al Latin-1 comunemente usato, ma sostituisce alcune simboli meno comuni con il simbolo dell'Euro e alcune lettere francesi e finlandesi assenti in Latin-1.

source: This set covers many Southeast European languages, and most importantly supports Romanian more completely than Latin-2.
es: Este conjunto abarca muchos idiomas del sudeste de Europa y soporta el rumano de forma más completa que Latin-2.
it: Questo insieme comprende molte lingue del sud-est europeo, e soprattutto supporta il rumeno in modo più completo del Latin-2.

source: KOI8-R is a non-ISO character set popular in Russia before Unicode. The lower half is ASCII; the upper is a Cyrillic character set somewhat better designed than ISO 8859-5. KOI8-U, based on KOI8-R, has better support for Ukrainian. Neither of these sets are ISO-2022 compatible, unlike the ISO 8859 series.
es: El KOI8-R es un conjunto de caracteres no ISO popular en Rusia antes de la aparición de Unicode. La primera mitad es el US ASCII; la segunda es un conjunto de caracteres cirílico algo mejor diseñado que el ISO 8859-5. KOI8-U está basado en KOI8-R, con un mejor soporte para el ucraniano. A diferencia de las series ISO 8859 , ninguno de estos conjuntos es compatible con el estándar ISO-2022.
it: KOI8-R è un insieme di caratteri non ISO molto diffuso in Russia prima dell'Unicode. La metà bassa è ASCII; la metà alta contiene un insieme di caratteri cirillici, concepito un po' meglio di quello di ISO 8859-5. KOI8-U, basato su KOI8-R, ha un miglior supporto per l'ucraino. Nessuno di questi insiemi è compatibile con ISO-2022, diversamente dalla serie ISO 8859.

source: Console support for KOI8-R is available under Linux through user-mode utilities that modify keyboard bindings and the EGA graphics table, and employ the "user mapping" font table in the console driver.
es: El soporte de consola para el KOI8-R está disponible en Linux a través de utilidades de usuario (como B<setfont>(8)) que modifican las asociaciones de teclas y la tabla de gráficos EGA y emplean la tabla de tipos de letra de "correspondencia de usuario" en el controlador de consola.
it: Il supporto di console per KOI8-R è disponibile in Linux grazie a utilità in modo utente che modificano le associazioni di tastiera e la tabella grafica EGA, e impiegano una "mappa utente" per la tabella di caratteri nel driver di console.

source: GB 2312 is a mainland Chinese national standard character set used to express simplified Chinese. Just like JIS X 0208, characters are mapped into a 94x94 two-byte matrix used to construct EUC-CN. EUC-CN is the most important encoding for Linux and includes ASCII and GB 2312. Note that EUC-CN is often called as GB, GB 2312, or CN-GB.
es: GB 2312 es un conjunto nacional estándar de caracteres para el chino continental que se usa para expresar chino simplificado. Al igual que JIS X 0208, los caracteres se proyectan en una matriz de 94x94 celdas de dos bytes que se usa para construir la codificación EUC-CN. EUC-CN es la codificación más importante para Linux e incluye ASCII y GB 2312. Dese cuenta que EUC-CN frecuentemente se identifica como GB, GB 2312 o CN-GB.
it: GB 2312 è un insieme nazionale di caratteri standard cinesi di terraferma usato per esprimere il cinese semplificato. Proprio come JIS X 0208, i caratteri vengono mappati in una matrice 94x94 a due byte usata per costruire EUC-CN. EUC-CN è la codifica più importante per Linux e include ASCII e GB 2312. Si noti che EUC-CN spesso è chiamato GB, GB 2312 o CN-GB.

source: Big5 was a popular character set in Taiwan to express traditional Chinese. (Big5 is both a character set and an encoding.) It is a superset of ASCII. Non-ASCII characters are expressed in two bytes. Bytes 0xa1\(en0xfe are used as leading bytes for two-byte characters. Big5 and its extension were widely used in Taiwan and Hong Kong. It is not ISO 2022 compliant.
es: Big5 es un conjunto de caracteres popular en Taiwan para expresar chino tradicional. (Big5 es tanto un conjunto de caracteres como una codificación.) Es un superconjunto del ASCII US. Los caracteres no ASCII se expresan con dos bytes. Los bytes 0xa1\(en0xfe se usan como primer byte en los caracteres de dos bytes. Big5 y sus extensiones se usan ampliamente en Taiwan y Hong Kong. No cumple con el estándar ISO-2022.
it: Big5 è un insieme di caratteri popolare in Taiwan che esprime il cinese tradizionale. (Big5 è sia un insieme di caratteri che una codifica). È un super-insieme di ASCII. I caratteri non ASCII vengono espressi in due byte. I byte 0xa1\(en0xfe vengono usati come byte iniziali per i caratteri a due byte. Big5 e la sua estensione sono largamente usati a Taiwan e Hong Kong. Non è conforme a ISO 2022.

source: JIS X 0208 is a Japanese national standard character set. Though there are some more Japanese national standard character sets (like JIS X 0201, JIS X 0212, and JIS X 0213), this is the most important one. Characters are mapped into a 94x94 two-byte matrix, whose each byte is in the range 0x21\(en0x7e. Note that JIS X 0208 is a character set, not an encoding. This means that JIS X 0208 itself is not used for expressing text data. JIS X 0208 is used as a component to construct encodings such as EUC-JP, Shift_JIS, and ISO-2022-JP. EUC-JP is the most important encoding for Linux and includes ASCII and JIS X 0208. In EUC-JP, JIS X 0208 characters are expressed in two bytes, each of which is the JIS X 0208 code plus 0x80.
es: JIS X 0208 es un conjunto nacional estándar de caracteres japoneses. Aunque hay algunos conjuntos nacionales estándares más de caracteres japoneses (como JIS X 0201, JIS X 0212 y JIS X 0213), éste es el más importante. Los caracteres se proyectan en una matriz de 94x94 celdas de 2 bytes, donde cada byte se encuentra en el rango 0x21\(en0x7e. Dese cuenta que JIS X 0208 es un conjunto de caracteres, no una codificación. Esto significa que el propio JIS X 0208 no se usa para expresar datos de texto. JIS X 0208 se usa como un componente para construir codificaciones como EUC-JP, Shift_JIS y ISO-2022-JP. EUC-JP es la codificación más importante para Linux e incluye ASCII y JIS X 0208. En EUC-JP, los caracteres JIS X 0208 se expresan con 2 dos bytes, cada uno de los cuales es el código JIS X 0208 más 0x80.
it: JIS X 0208 è un insieme nazionale di caratteri standard giapponesi. Anche se ci sono alcuni altri insiemi di caratteri standard in Giappone (come JIS X 0201, JIS X 0212 e JIS X 0213), questo è il più importante. I caratteri vengono mappati in una matrice 94x94 a due byte, e ogni byte è compreso nell'intervallo 0x21\(en0x7e. Si noti che JIS X 0208 è un insieme di caratteri, non una codifica: questo significa che JIS X 0208 non può essere usato per indicare dati di testo. Si usa come componente per costruire codifiche come EUC-JP, Shift_JIS e ISO-2022.JP. EUC-JP è la codifica più importante sotto Linux, e include ASCII e JIS X 0208. In questa codifica i caratteri JIS X 0208 vengono espressi in due byte, ognuno dei quali è il codice JIS X 0208 più 0x80.

source: KS X 1001 is a Korean national standard character set. Just as JIS X 0208, characters are mapped into a 94x94 two-byte matrix. KS X 1001 is used like JIS X 0208, as a component to construct encodings such as EUC-KR, Johab, and ISO-2022-KR. EUC-KR is the most important encoding for Linux and includes ASCII and KS X 1001. KS C 5601 is an older name for KS X 1001.
es: KS X 1001 es un conjunto nacional estándar de caracteres coreanos. Al igual que JIS X 0208, los caracteres se proyectan en una matriz de 94x94 celdas de 2 bytes. KS X 1001 se usa como JIS X 0208, como un componente para construir codificaciones tales como EUC-KR, Johab e ISO-2022-KR. EUC-KR es la codificación más importante para Linux e incluye ASCII y KS X 1001. KS C 5601 es el antiguo nombre de KS X 1001.
it: KS X 1001 è un insieme nazionale di caratteri standard coreani. Proprio come JIS X 0208, i caratteri vengono mappati in una matrice 94x94 a due byte. KS X 1001 si usa come JIS X 0208, come componente per costruire codifiche come EUC-KR, Johab e ISO-2022-KR. EUC-KR è la codifica più importante sotto Linux, e include ASCII E KS X 1001. KS C 5601 è il vecchio nome di KS X 1001.

source: ISO 2022 and ISO 4873
es: ISO 2022 y ISO 4873
it: ISO 2022 e ISO 4873

source: The ISO 2022 and 4873 standards describe a font-control model based on VT100 practice. This model is (partially) supported by the Linux kernel and by B<xterm>(1). Several ISO 2022-based character encodings have been defined, especially for Japanese.
es: Los estándares ISO 2022 y 4873 describen un modelo de control de tipo de letra basado en la VT100. Este modelo es (parcialmente) admitido por el núcleo de Linux y por B<xterm>(1). Se han definido varias codificaciones basadas en ISO 2022, sobretodo para el japonés.
it: Gli standard ISO 2022 e 4873 descrivono un modello di controllo dei caratteri basato sugli usi di VT100. Questo modello è (parzialmente) supportato dal kernel di Linux e da B<xterm>(1). Sono state definite diverse codifiche di caratteri basate su ISO 2002, specialmente per il giapponese.

source: There are 4 graphic character sets, called G0, G1, G2, and G3, and one of them is the current character set for codes with high bit zero (initially G0), and one of them is the current character set for codes with high bit one (initially G1). Each graphic character set has 94 or 96 characters, and is essentially a 7-bit character set. It uses codes either 040\(en0177 (041\(en0176) or 0240\(en0377 (0241\(en0376). G0 always has size 94 and uses codes 041\(en0176.
es: Hay 4 conjuntos de caracteres gráficos, llamados G0, G1, G2 y G3, y uno de ellos es el conjunto de caracteres actual para los códigos con el bit más alto a 0 (inicialmente G0), y uno de ellos es el conjunto de caracteres actual para los códigos con el bit más alto a 1 (inicialmente G1). Cada conjunto de caracteres gráfico tiene 94 ó 96 caracteres, y es esencialmente un conjunto de caracteres de 7 bits. Emplea códigos bien entre 040\(en0177 (041\(en0176) o bien entre 0240\(en0377 (0241\(en0376). G0 siempre tiene de tamaño 94 y emplea códigos en el rango 041\(en0176.
it: Ci sono quattro insiemi di caratteri grafici, chiamati G0, G1, G2 e G3: uno di loro è l'insieme di caratteri attuale per i codici con bit più alto zero (inizialmente G0), e uno di loro è l'insieme attuale per i codici con bit più alto uno (inizialmente G1). Ciascun insieme di caratteri grafici ha 94 o 96 caratteri ed è essenzialmente un insieme a sette bit. Usa i codici 040\(en0177 (041\(en0176) oppure 0240\(en0377 (0241\(en0376). G0 ha sempre 94 elementi e usa i codici 041\(en0176.
