Repository: sebras/manpages-l10n
Catalog: po/*/man7/charsets.7.po
Languages: es, it

source: Switching between character sets is done using the shift functions B<\(haN> (SO or LS1), B<\(haO> (SI or LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC \(ti (LS1R), ESC } (LS2R), ESC | (LS3R). The function LSI<n> makes character set GI<n> the current one for codes with high bit zero. The function LSI<n>R makes character set GI<n> the current one for codes with high bit one. The function SSI<n> makes character set GI<n> (I<n>=2 or 3) the current one for the next character only (regardless of the value of its high order bit).
es: El cambio entre los conjuntos de caracteres se realiza empleando las funciones de cambio B<\(haN> (SO o LS1), B<\(haO> (SI o LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC \(ti (LS1R), ESC } (LS2R), ESC | (LS3R). La función LSI<n> hace que el conjunto de caracteres GI<n> sea el actual para los códigos con el bit más alto a 0. La función LSI<n> hace que el conjunto de caracteres GI<n> sea el actual para los códigos con el bit más alto a 1. La función SSI<n> hace que el conjunto de caracteres GI<n> (I<n>=2 ó 3) sea el actual para el siguiente carácter solamente (tenga lo que tenga su bit más alto).
it: Si passa da un insieme all'altro attraverso le funzioni di cambiamento B<\(haN> (SO or LS1), B<\(haO> (SI or LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC \(ti (LS1R), ESC } (LS2R), ESC | (LS3R). La funzione LSI<n> fa sì che l'insieme GI<n> sia quello attuale per codici con bit più alto zero. La funzione LSI<n>R fa sì che l'insieme GI<n> sia quello attuale per codici con bit più alto uno. La funzione SSI<n> fa sì che l'insieme GI<n> (I<n>=2 o 3) sia quello attuale per il solo carattere successivo (qualsiasi sia il valore del suo bit più alto).

source: A 94-character set is designated as GI<n> character set by an escape sequence ESC ( xx (for G0), ESC ) xx (for G1), ESC * xx (for G2), ESC + xx (for G3), where xx is a symbol or a pair of symbols found in the ISO 2375 International Register of Coded Character Sets. For example, ESC ( @ selects the ISO 646 character set as G0, ESC ( A selects the UK standard character set (with pound instead of number sign), ESC ( B selects ASCII (with dollar instead of currency sign), ESC ( M selects a character set for African languages, ESC ( ! A selects the Cuban character set, and so on.
es: Un conjunto de 94 caracteres se designa como el conjunto de caracteres GI<n> por una secuencia de escape ESC ( xx (para G0), ESC ) xx (para G1), ESC * xx (para G2), ESC + xx (para G3), donde xx es un símbolo o un par de símbolos del Registro Internacional de Conjuntos de Caracteres Codificados ISO 2375. Por ejemplo, ESC ( @ selecciona el conjunto de caracteres ISO 646 como el G0, ESC ( A selecciona el conjunto de caracteres estándar de R.U. (con la libra esterlina en lugar del signo numeral #), ESC ( B selecciona el ASCII (con el dólar $ en lugar del símbolo monetario ¤), ESC ( M selecciona un conjunto de caracteres para lenguas africanas, ESC ( ! selecciona el conjunto de caracteres cubano, etc. etc. etc.
it: Un insieme da 94 caratteri viene denotato come insieme GI<n> da una sequenza di escape ESC ( xx (per G0), ESC ) xx (per G1), ESC * xx (per G2), ESC + xx (per G3), dove xx è un simbolo o una coppia di simboli trovati in ISO 2375 International Register of Coded Character Sets. Per esempio, ESC ( @ seleziona l'insieme di caratteri ISO 646 come G0, ESC ( A seleziona l'insieme standard UK (con la sterlina al posto del simbolo numerico), ESC ( B seleziona l'ASCII (col dollaro al posto del simbolo monetario), ESC ( M seleziona un insieme di caratteri per le lingue africane, ESC ( ! A seleziona l'insieme cubano, e così via.

source: A 96-character set is designated as GI<n> character set by an escape sequence ESC - xx (for G1), ESC . xx (for G2) or ESC / xx (for G3). For example, ESC - G selects the Hebrew alphabet as G1.
es: Un conjunto de 96 caracteres se designa como el conjunto de caracteres GI<n> por una secuencia de escape ESC - xx (para G1), ESC . xx (para G2) o ESC / xx (para G3). Por ejemplo, ESC - G selecciona el alfabeto hebreo como el G1.
it: Un insieme da 96 caratteri viene denotato come l'insieme GI<n> da una sequenza di escape ESC - xx (per G1), ESC . xx (per G2), o ESC / xx (per G3). Per esempio, ESC - G seleziona l'alfabeto ebraico come G1.

source: A multibyte character set is designated as GI<n> character set by an escape sequence ESC $ xx or ESC $ ( xx (for G0), ESC $ ) xx (for G1), ESC $ * xx (for G2), ESC $ + xx (for G3). For example, ESC $ ( C selects the Korean character set for G0. The Japanese character set selected by ESC $ B has a more recent version selected by ESC & @ ESC $ B.
es: Un conjunto de caracteres multibyte se designa como el conjunto de caracteres GI<n> por una secuencia de escape ESC $ xx o ESC $ ( xx (para G0), ESC $ ) xx (para G1), ESC $ * xx (para G2), ESC $ + xx (para G3). Por ejemplo, ESC $ ( C selecciona el conjunto de caracteres coreano para G0. El conjunto de caracteres japonés seleccionado por ESC $ B tiene una versión más reciente seleccionada por ESC & @ ESC $ B.
it: Un insieme multibyte viene denotato come insieme GI<n> da una sequenza di escape ESC $ xx o ESC $ ( xx (per G0), ESC $ ) xx (per G1), ESC $ * xx (per G2), ESC $ + xx (per G3). Per esempio, ESC $ ( C seleziona l'insieme di caratteri coreano come G0. L'insieme giapponese selezionato da ESC $ B ha una versione più recente selezionata da ESC & @ ESC $ B.

source: ISO 4873 stipulates a narrower use of character sets, where G0 is fixed (always ASCII), so that G1, G2, and G3 can be invoked only for codes with the high order bit set. In particular, B<\(haN> and B<\(haO> are not used anymore, ESC ( xx can be used only with xx=B, and ESC ) xx, ESC * xx, ESC + xx are equivalent to ESC - xx, ESC . xx, ESC / xx, respectively.
es: ISO 4873 estipula un uso más reducido de conjuntos de caracteres, donde G0 está fijo (siempre ASCII), de modo que G1, G2 y G3 sólo pueden ser llamados para códigos con el bit más alto a 1. En particular, B<\(haN> y B<\(haO> ya no se usan más, ESC ( xx sólo puede emplearse con xx=B y ESC ) xx, ESC * xx, ESC + xx son equivalentes a ESC - xx, ESC . xx, ESC / xx, respectivamente.
it: ISO 4873 stabilisce un uso più restrittivo degli insiemi, in cui G0 è fisso (sempre ASCII), facendo sì che G1, G2 e G3 possano essere invocati solo per codici in cui il bit più alto è impostato. In particolare, B<\(haN> e B<\(haO> non vengono più usati, ESC (xx può essere usato solo con xx=B, e ESC) xx, ESC * xx, ESC + xx sono equivalenti, rispettivamente, a ESC - xx, ESC . xx, ESC / xx.

source: TIS-620 is a Thai national standard character set and a superset of ASCII. In the same fashion as the ISO 8859 series, Thai characters are mapped into 0xa1\(en0xfe.
es: TIS 620 es un conjunto nacional estándar de caracteres tailandeses y un superconjunto del ASCII. Al igual que las series ISO 8859, los caracteres tailandeses se proyectan en el rango 0xa1\(en0xfe.
it: TIS 620 è un insieme nazionale di caratteri standard tailandesi, ed è un super-insieme di ASCII. Come le serie ISO 8859, i caratteri Thai sono mappati in 0xa1\(en0xfe.

source: Unicode (ISO 10646) is a standard which aims to unambiguously represent every character in every human language. Unicode's structure permits 20.1 bits to encode every character. Since most computers don't include 20.1-bit integers, Unicode is usually encoded as 32-bit integers internally and either a series of 16-bit integers (UTF-16) (needing two 16-bit integers only when encoding certain rare characters) or a series of 8-bit bytes (UTF-8).
es: Unicode (ISO 10646) es un estándar cuyo objetivo es representar inequívocamente cada carácter conocido en cada lenguaje humano. La estructura de Unicode admite 20'1 bits para codificar cada caracter. Sin embargo, ya que la mayoría de los computadores no incluyen enteros de 20'1 bits, normalmente Unicode se codifica internamente mediante enteros de 32 bits y, o bien una serie de enteros de 16 bits (UTF-16) (que necesita dos enteros de 16 bits sólo cuando se codifican ciertos caracteres poco comunes), o bien una serie de bytes de 8 bits (UTF-8).
it: Unicode (ISO 10646) è uno standard il cui scopo è rappresentare senza ambiguità ogni carattere di ogni lingua umana. La struttura di Unicode permette 20.1 bit per codificare qualunque carattere. Dato che molti computer non includono interi a 20.1 bit, Unicode solitamente è internamente codificato con interi a 32 bit e con una serie di interi a 16 bit (UTF-16, che ha bisogno di due interi a 16 bit solo quando codifica alcuni rari caratteri) o con una serie di byte a 8 bit (UTF-8).

source: Linux represents Unicode using the 8-bit Unicode Transformation Format (UTF-8). UTF-8 is a variable length encoding of Unicode. It uses 1 byte to code 7 bits, 2 bytes for 11 bits, 3 bytes for 16 bits, 4 bytes for 21 bits, 5 bytes for 26 bits, 6 bytes for 31 bits.
es: Linux representa Unicode empleando el Formato de Transformación Unicode de 8 bits (UTF-8). UTF-8 es una codificación de Unicode de longitud variable. Emplea 1 byte para codificar 7 bits, 2 bytes para 11 bits, 3 bytes para 16 bits, 4 bytes para 21 bits, 5 bytes para 26 bits, y 6 bytes para 31 bits.
it: Linux rappresenta Unicode tramite il "Formato di trasferimento Unicode" (Unicode Transfer Format) a 8 bit (UTF-8). UTF-8 è una codifica di Unicode a lunghezza variabile. Usa 1 byte per codificare 7 bit, 2 byte per 11 bit, 3 byte per 16 bit, 4 byte per 21 bit, 5 byte per 26 bit e 6 byte per 31 bit.

source: Let 0,1,x stand for a zero, one, or arbitrary bit. A byte 0xxxxxxx stands for the Unicode 00000000 0xxxxxxx which codes the same symbol as the ASCII 0xxxxxxx. Thus, ASCII goes unchanged into UTF-8, and people using only ASCII do not notice any change: not in code, and not in file size.
es: Sean 0, 1, x el 0, el 1 ó un bit arbitrario. Un byte 0xxxxxxx representa el carácter Unicode 00000000 0xxxxxxx que codifica el mismo símbolo que el ASCII 0xxxxxxx. Así, ASCII va sin cambio alguno dentro de UTF-8, y la gente que emplea ASCII no nota ningún cambio: ni en el código ni en tamaños de fichero.
it: Poniamo che 0,1,x sia uno zero, uno o un bit arbitrario. Un byte 0xxxxxxx rappresenta l'Unicode 00000000 0xxxxxxx, che codifica lo stesso simbolo dell'ASCII 0xxxxxxx. Perciò, ASCII rimane invariato in UTF-8 e coloro che usano solo ASCII non notano nessuna differenza: né nel codice, né nella dimensione del file.

source: A byte 110xxxxx is the start of a 2-byte code, and 110xxxxx 10yyyyyy is assembled into 00000xxx xxyyyyyy. A byte 1110xxxx is the start of a 3-byte code, and 1110xxxx 10yyyyyy 10zzzzzz is assembled into xxxxyyyy yyzzzzzz. (When UTF-8 is used to code the 31-bit ISO 10646 then this progression continues up to 6-byte codes.)
es: Un byte 110xxxxx es el comienzo de un código de 2 bytes, y 110xxxxx 10yyyyyy se ensambla en 00000xxx xxyyyyyy. Un byte 1110xxxx es el comienzo de un código de 3 bytes, y 1110xxxx 10yyyyyy 10zzzzzz se ensambla en xxxxyyyy yyzzzzzz. (Cuando se emplea UTF-8 para codificar el ISO 10646 de 31 bits, esta progresión continúa hasta códigos de 6 bytes.)
it: Un byte 110xxxxx è l'inizio di una codifica a due byte, dove 110xxxxx 10yyyyyy sta per 00000xxx xxyyyyyy. Un byte 1110xxxx è l'inizio di una codifica a tre byte, dove 1110xxxx 10yyyyyy 10zzzzzz sta per xxxxyyyy yyzzzzzz. (Se si usa UTF-8 per codificare l'ISO 10646 a 31 bit, la progressione continua fino alle codifiche a 6 byte.)

source: For most texts in ISO 8859 character sets, this means that the characters outside of ASCII are now coded with two bytes. This tends to expand ordinary text files by only one or two percent. For Russian or Greek texts, this expands ordinary text files by 100%, since text in those languages is mostly outside of ASCII. For Japanese users this means that the 16-bit codes now in common use will take three bytes. While there are algorithmic conversions from some character sets (especially ISO 8859-1) to Unicode, general conversion requires carrying around conversion tables, which can be quite large for 16-bit codes.
es: Para la mayoría de los textos que usan los conjuntos de caracteres ISO-8859, esto significa que los caracteres fuera de ASCII se codifican ahora con dos bytes. Esto tiende a expandir los ficheros de texto ordinarios en sólo un 1 o 2%. Para el ruso y el griegos, esto expande los ficheros de texto ordenarios en un 100%, ya que el texto en estos idiomas se encuentra en su mayor parte fuera de ASCII. Para los usuarios japoneses esto significa que los códigos de 16 bits de uso común actualmente necesitarán tres bytes. Aunque hay conversiones algorítmicas desde algunos conjuntos de caracteres (esp. ISO-8859-1) a Unicode, una conversión general requiere trabajar con tablas de conversión que puede ser bastante grandes para los códigos de 16 bits.
it: Per la maggior parte dei testi codificati con insiemi di caratteri ISO 8859, questo significa che i caratteri al di fuori dell'ASCII sono ora codificati con due byte. Ciò tende ad espandere un file ordinario di testo dell'uno o due per cento. Per i testi russi o greci, espande file ordinari di testo del 100%, dato che il testo in queste lingue è quasi tutto al di fuori dell'ASCII. Per gli utilizzatori giapponesi significa che la codifica a 16 bit oggi comunemente usata userà tre byte. Anche se ci sono algoritmi di conversione da alcuni insiemi di caratteri (specialmente ISO-8859-1) a Unicode, la conversione generale richiede l'uso di tabelle di conversione, che possono essere piuttosto grandi per codifiche a 16 bit.

source: Note that UTF-8 is self-synchronizing: 10xxxxxx is a tail, any other byte is the head of a code. Note that the only way ASCII bytes occur in a UTF-8 stream, is as themselves. In particular, there are no embedded NULs (\(aq\e0\(aq) or \(aq/\(aqs that form part of some larger code.
es: Observe que UTF-8 es auto-sincronizante: 10xxxxxx es una cola, y cualquier otro byte es la cabeza de un código. Observe que de la única manera que los bytes ASCII aparecen en un flujo UTF-8 es como ellos mismos. En particular, no hay NULs (\(aq\e0\(aq) or \(aq/\(aqs incluidos que formen parte de algún código más grande.
it: Si noti che UTF-8 è autosincronizzante: 10xxxxxx è una coda, e qualsiasi altro byte è la testa di un codice. Si noti anche che l'unico modo in cui un byte ASCII può comparire in una sequenza UTF-8 è come se stesso. In particolare, non ci sono byte NULL (\(aq\e0\(aq) inseriti o \(aq/\(aqs che formano una parte di un codice più lungo.

source: Since ASCII, and, in particular, NUL and \(aq/\(aq, are unchanged, the kernel does not notice that UTF-8 is being used. It does not care at all what the bytes it is handling stand for.
es: Puesto que ASCII, y, en particular, NUL y \(aq/\(aq, permanecen inalterados, el núcleo no se entera de que se está empleando UTF-8. No le importa en absoluto para qué son los bytes que está manejando.
it: Poiché ASCII e, in particolare, NUL e \(aq/\(aq sono invariati, il kernel non si rende conto che si sta usando UTF-8. Non gli interessa il significato dei byte di cui si occupa.

source: Rendering of Unicode data streams is typically handled through "subfont" tables which map a subset of Unicode to glyphs. Internally the kernel uses Unicode to describe the subfont loaded in video RAM. This means that in the Linux console in UTF-8 mode, one can use a character set with 512 different symbols. This is not enough for Japanese, Chinese, and Korean, but it is enough for most other purposes.
es: La representación de los flujos de datos Unicode se suele gestionar a través de tablas de `subtipo' que hacen corresponder un subconjunto de Unicode a glifos. Internamente el núcleo emplea Unicode para describir el subtipo de letra cargada en RAM de vídeo. Esto significa que en el modo UTF-8 uno puede emplear un conjunto de caracteres con 512 símbolos diferentes. Esto no es suficiente para el japonés, chino o coreano, pero si es adecuado para la mayoría de otros propósitos.
it: Le sequenze di dati Unicode sono solitamente rese attraverso tabelle di "sottocaratteri" che associano sottoinsiemi di Unicode a glifi. Internamente, il kernel usa Unicode per descrivere il sottoinsieme di caratteri caricato nella RAM video. Ciò significa che nella console Linux in modalità UTF-8 si può usare un insieme di caratteri con 512 simboli diversi. Questo non è sufficiente per giapponese, cinese e coreano, ma basta per la maggior parte degli altri utilizzi.

source: SEE ALSO
es: VÉASE TAMBIÉN
it: VEDERE ANCHE

source: Linux Programmer's Manual
es: Manual del Programador de Linux
it: Manuale del programmatore di Linux

source: ISO 4873 stipulates a narrower use of character sets, where G0 is fixed (always ASCII), so that G1, G2 and G3 can be invoked only for codes with the high order bit set. In particular, B<\(haN> and B<\(haO> are not used anymore, ESC ( xx can be used only with xx=B, and ESC ) xx, ESC * xx, ESC + xx are equivalent to ESC - xx, ESC . xx, ESC / xx, respectively.
es: ISO 4873 estipula un uso más reducido de conjuntos de caracteres, donde G0 está fijo (siempre ASCII), de modo que G1, G2 y G3 sólo pueden ser llamados para códigos con el bit más alto a 1. En particular, B<\(haN> y B<\(haO> ya no se usan más, ESC ( xx sólo puede emplearse con xx=B y ESC ) xx, ESC * xx, ESC + xx son equivalentes a ESC - xx, ESC . xx, ESC / xx, respectivamente.
it: ISO 4873 stabilisce un uso più restrittivo degli insiemi, in cui G0 è fisso (sempre ASCII), facendo sì che G1, G2 e G3 possano essere invocati solo per codici in cui il bit più alto è impostato. In particolare, B<\(haN> e B<\(haO> non vengono più usati, ESC (xx può essere usato solo con xx=B, e ESC) xx, ESC * xx, ESC + xx sono equivalenti, rispettivamente, a ESC - xx, ESC . xx, ESC / xx.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: Switching between character sets is done using the shift functions B<^N> (SO or LS1), B<^O> (SI or LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC ~ (LS1R), ESC } (LS2R), ESC | (LS3R). The function LSI<n> makes character set GI<n> the current one for codes with high bit zero. The function LSI<n>R makes character set GI<n> the current one for codes with high bit one. The function SSI<n> makes character set GI<n> (I<n>=2 or 3) the current one for the next character only (regardless of the value of its high order bit).
es: El cambio entre los conjuntos de caracteres se realiza empleando las funciones de cambio B<^N> (SO o LS1), B<^O> (SI o LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC ~ (LS1R), ESC } (LS2R), ESC | (LS3R). La función LSI<n> hace que el conjunto de caracteres GI<n> sea el actual para los códigos con el bit más alto a 0. La función LSI<n> hace que el conjunto de caracteres GI<n> sea el actual para los códigos con el bit más alto a 1. La función SSI<n> hace que el conjunto de caracteres GI<n> (I<n>=2 ó 3) sea el actual para el siguiente carácter solamente (tenga lo que tenga su bit más alto).
it: Si passa da un insieme all'altro attraverso le funzioni di cambiamento B<^N> (SO o LS1), B<^O> (SI o LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC ~ (LS1R), ESC } (LS2R), ESC | (LS3R). La funzione LSI<n> fa sì che l'insieme GI<n> sia quello attuale per codici con bit più alto zero. La funzione LSI<n>R fa sì che l'insieme GI<n> sia quello attuale per codici con bit più alto uno. La funzione SSI<n> fa sì che l'insieme GI<n> (I<n>=2 o 3) sia quello attuale per il solo carattere successivo (qualsiasi sia il valore del suo bit più alto).

source: ISO 4873 stipulates a narrower use of character sets, where G0 is fixed (always ASCII), so that G1, G2 and G3 can be invoked only for codes with the high order bit set. In particular, B<^N> and B<^O> are not used anymore, ESC ( xx can be used only with xx=B, and ESC ) xx, ESC * xx, ESC + xx are equivalent to ESC - xx, ESC . xx, ESC / xx, respectively.
es: ISO 4873 estipula un uso más reducido de conjuntos de caracteres, donde G0 está fijo (siempre ASCII), de modo que G1, G2 y G3 sólo pueden ser llamados para códigos con el bit más alto a 1. En particular, B<^N> y B<^O> ya no se usan más, ESC ( xx sólo puede emplearse con xx=B y ESC ) xx, ESC * xx, ESC + xx son equivalentes a ESC - xx, ESC . xx, ESC / xx, respectivamente.
it: ISO 4873 stabilisce un uso più restrittivo degli insiemi, in cui G0 è fisso (sempre ASCII), facendo sì che G1, G2 e G3 possano essere invocati solo per codici in cui il bit più alto è impostato. In particolare, B<^N> e B<^O> non vengono più usati, ESC (xx può essere usato solo con xx=B, e ESC) xx, ESC * xx, ESC + xx sono equivalenti, rispettivamente, a ESC - xx, ESC . xx, ESC / xx.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
