Repository: sebras/manpages-l10n
Catalog: po/*/man7/daemon.7.po
Languages: de

source: Note that "%systemd_post" and "%systemd_preun" expect the names of all units that are installed/removed as arguments, separated by spaces\&. "%systemd_postun" expects no arguments\&. "%systemd_postun_with_restart" expects the units to restart as arguments\&.
de: Beachten Sie, dass »%systemd_post« und »%systemd_preun« die Namen sämtlicher zu installierender/entfernender Units als durch Leerzeichen getrennte Argumente erwarten\&. »%systemd_postun« erwartet keine Argumente\&. »%systemd_postun_with_restart« erwartet die neu zu startenden Units als Argumente\&.

source: To facilitate upgrades from a package version that shipped only SysV init scripts to a package version that ships both a SysV init script and a native systemd service file, use a fragment like the following:
de: Um Aktualisierungen von einer Paketversion, die nur SysV-Init-Skripte auslieferte, zu einer Paketversion, die sowohl SysV-Init-Skripte als auch eine native Systemd-Dienstedatei ausliefert, zu unterstützen, verwenden Sie Fragmente der folgenden Art:

source: Where 0\&.47\&.11-1 is the first package version that includes the native unit file\&. This fragment will ensure that the first time the unit file is installed, it will be enabled if and only if the SysV init script is enabled, thus making sure that the enable status is not changed\&. Note that B<chkconfig> is a command specific to Fedora which can be used to check whether a SysV init script is enabled\&. Other operating systems will have to use different commands here\&.
de: Wobei 0\&.47\&.11-1 die erste Paketversion ist, die die native Unit-Datei enthält\&. Dieses Fragment bewirkt, dass bei der erstmaligen Installation der Unit-Datei diese nur aktiviert wird, falls das SysV-Init-Skript aktiviert ist und stellt damit sicher, dass der Aktivierungsstatus sich nicht ändert\&. Beachten Sie, dass der Befehl B<chkconfig>, der zum Überprüfen des Aktivitätsstandes eines SysV-Init-Skriptes verwandt werden kann, Fedora-spezifisch ist\&. Hier werden andere Betriebssysteme andere Befehle verwenden müssen\&.

source: PORTING EXISTING DAEMONS
de: EXISTIERENDE DAEMONS PORTIEREN

source: Since new-style init systems such as systemd are compatible with traditional SysV init systems, it is not strictly necessary to port existing daemons to the new style\&. However, doing so offers additional functionality to the daemons as well as simplifying integration into new-style init systems\&.
de: Da neuartige Init-Systeme wie Systemd zu traditionellen SysV-Init-Systemen kompatibel sind, ist es strenggenommen nicht notwendig, Daemons auf die neue Art zu portieren\&. Erfolgt dies, ermöglicht es aber, zusätzliche Funktionalitäten zum Daemon hinzuzufügen, sowie die Integration in das neuartige Init-System zu vereinfachen\&.

source: To port an existing SysV compatible daemon, the following steps are recommended:
de: Um einen bestehenden, SysV-kompatiblen Daemon zu portieren, werden die folgenden Schritte empfohlen:

source: If not already implemented, add an optional command line switch to the daemon to disable daemonization\&. This is useful not only for using the daemon in new-style init systems, but also to ease debugging\&.
de: Falls noch nicht implementiert, fügen Sie einen zusätzlichen Befehlszeilenschalter zu dem Daemon hinzu, um die Daemonisierung zu deaktivieren\&. Dies ist nicht nur für den Einsatz in neuartigen Init-Systemen, sondern auch zur Erleichterung der Fehlersuche nützlich\&.

source: If the daemon offers interfaces to other software running on the local system via local B<AF_UNIX> sockets, consider implementing socket-based activation (see above)\&. Usually, a minimal patch is sufficient to implement this: Extend the socket creation in the daemon code so that B<sd_listen_fds>(3) is checked for already passed sockets first\&. If sockets are passed (i\&.e\&. when B<sd_listen_fds()> returns a positive value), skip the socket creation step and use the passed sockets\&. Secondly, ensure that the file system socket nodes for local B<AF_UNIX> sockets used in the socket-based activation are not removed when the daemon shuts down, if sockets have been passed\&. Third, if the daemon normally closes all remaining open file descriptors as part of its initialization, the sockets passed from the init system must be spared\&. Since new-style init systems guarantee that no left-over file descriptors are passed to executed processes, it might be a good choice to simply skip the closing of all remaining open file descriptors if sockets are passed\&.
de: Falls der Daemon zu anderer, auf dem lokalen System laufenden Software Schnittstellen mittels lokaler B<AF_UNIX>-Sockets anbietet, sollte eine Socket-basierte Aktivierung (siehe oben) überlegt werden\&. Normalerweise reicht ein minimaler Patch, um dies zu implementieren: Erweitern Sie die Socket-Erstellung im Daemon-Code, so dass zuerst B<sd_listen_fds>(3) auf bereits übergebene Sockets geprüft wird\&. Falls Sockets übergeben wurden (d\&.h\&. wenn B<sd_listen_fds()> einen positiven Wert liefert), überspringen Sie den Socket-Erstellungsschritt und verwenden Sie die übergebenen Sockets\&. Zweitens sollten die System-Socket-Knoten für lokale, in der Socket-basierten Aktivierung verwandten B<AF_UNIX>-Sockets nicht entfernt werden, wenn der Daemon heruntergefahren wird, falls Sockets übergeben wurden\&. Falls der Daemon normalerweise alle verbliebenen offenen Dateideskriptoren als Teil seiner Initialisierung schließt, müssen drittens die vom Init-System übergebenen Sockets verschont werden\&. Da neuartige Init-Systeme garantieren, dass keine verbliebenen Dateideskriptoren an ausgeführte Prozesse übergeben werden, könnte es eine gute Idee sein, einfach das Schließen aller verbliebenen offenen Dateideskriptoren zu überspringen, falls Sockets übergeben wurden\&.

source: Write and install a systemd unit file for the service (and the sockets if socket-based activation is used, as well as a path unit file, if the daemon processes a spool directory), see above for details\&.
de: Schreiben und installieren Sie eine Systemd-Unit-Datei für den Dienst (und die Sockets, falls Socket-basierte Aktivierung verwandt wird, sowie eine Pfad-Unit-Datei, falls der Daemon ein Spool-Verzeichnis verarbeitet), siehe oben für Details\&.

source: If the daemon exposes interfaces via D-Bus, write and install a D-Bus activation file for the service, see above for details\&.
de: Falls der Daemon Schnittstellen mittels D-Bus offenlegt, schreiben Sie eine D-Bus-Aktivierungsdatei für den Dienst, siehe oben für Details\&.

source: PLACING DAEMON DATA
de: ABLAGE VON DAEMON-DATEN

source: It is recommended to follow the general guidelines for placing package files, as discussed in B<file-hierarchy>(7)\&.
de: Es wird empfohlen, den allgemeinen Richtlinien, beschrieben in B<file-hierarchy>(7), für die Ablage von Paketdateien zu folgen\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: LSB recommendations for SysV init scripts
de: LSB-Empfehlungen für SysV-Init-Skripte

source: Apple MacOS X Daemon Requirements
de: Apple-MacOS-X-Daemon-Anforderungen
