Repository: sebras/manpages-l10n
Catalog: po/*/man7/daemon.7.po
Languages: de

source: In order to maximize the possible parallelization and robustness and simplify configuration and development, it is recommended for all new-style daemons that communicate via listening sockets to employ socket-based activation\&. In a socket-based activation scheme, the creation and binding of the listening socket as primary communication channel of daemons to local (and sometimes remote) clients is moved out of the daemon code and into the init system\&. Based on per-daemon configuration, the init system installs the sockets and then hands them off to the spawned process as soon as the respective daemon is to be started\&. Optionally, activation of the service can be delayed until the first inbound traffic arrives at the socket to implement on-demand activation of daemons\&. However, the primary advantage of this scheme is that all providers and all consumers of the sockets can be started in parallel as soon as all sockets are established\&. In addition to that, daemons can be restarted with losing only a minimal number of client transactions, or even any client request at all (the latter is particularly true for state-less protocols, such as DNS or syslog), because the socket stays bound and accessible during the restart, and all requests are queued while the daemon cannot process them\&.
de: Um die Parallelisierung und Robustheit zu maximieren und die Konfiguration und Entwicklung zu vereinfachen, wird für alle neuartigen Daemons empfohlen, die über Warten an Sockets kommunizieren, eine Socket-basierte Aktivierung einzusetzen\&. In einem Socket-basierten Aktivierungsschema wird die Erstellung und das Binden des Sockets, an dem gewartet werden soll, als primären Kommunikationskanal von Daemons mit lokalen (und manchmal fernen) Clients aus dem Daemon-Code in das Init-System verschoben\&. Basierend auf einer Daemon-basierten Konfiguration installiert das Init-System die Sockets und gibt sie an die erstellten Prozesse, sobald der respektive Daemon gestartet wird\&. Optional kann die Aktivierung des Dienstes verzögert werden, bis der erste eingehende Verkehr auf dem Socket eintrifft, um eine bedarfsgesteuerte Aktivierung von Daemons zu realisieren\&. Allerdings ist der Hauptvorteil dieses Schemas, dass alle Anbieter und Konsumenten des Sockets parallel gestartet werden können, sobald alle Sockets etabliert sind\&. Zusätzlich können Daemons neugestartet werden und dabei nur eine minimale Anzahl an Client-Transaktionen verlieren oder sogar überhaupt keine Client-Anfrage (Letzteres stimmt insbesondere für zustandslose Protokolle wie DNS oder Syslog), da das Socket während des Neustarts angebunden und zugreifbar verbleibt und alle Anfragen in einer Warteschlange verbleiben, während der Daemon sie nicht verarbeiten kann\&.

source: New-style daemons which support socket activation must be able to receive their sockets from the init system instead of creating and binding them themselves\&. For details about the programming interfaces for this scheme provided by systemd, see B<sd_listen_fds>(3) and B<sd-daemon>(3)\&. For details about porting existing daemons to socket-based activation, see below\&. With minimal effort, it is possible to implement socket-based activation in addition to traditional internal socket creation in the same codebase in order to support both new-style and old-style init systems from the same daemon binary\&.
de: Neuartige Daemons, die Socket-Aktivierung unterstützen, müssen in der Lage sein, Sockets vom Init-System zu erhalten, statt sie selbst zu erstellen und sich daran zu binden\&. Für Details über die Programmierschnittstellen für dieses von Systemd bereitgestellte Schema, siehe B<sd_listen_fds>(3) und B<sd-daemon>(3)\&. Für Details über die Portierung bestehender Daemons zu Socket-basierter Aktivierung, siehe unten\&. Mit minimalem Einsatz ist es möglich, Socket-basierte Aktivierung zusätzlich zu traditioneller interner Socket-Erstellung in der gleichen Codebasis zu erstellen, um sowohl neuartige als auch Init-Systeme der alten Art im gleichen Daemon-Programm zu unterstützen\&.

source: systemd implements socket-based activation via \&.socket units, which are described in B<systemd.socket>(5)\&. When configuring socket units for socket-based activation, it is essential that all listening sockets are pulled in by the special target unit sockets\&.target\&. It is recommended to place a I<WantedBy=sockets\&.target> directive in the [Install] section to automatically add such a dependency on installation of a socket unit\&. Unless I<DefaultDependencies=no> is set, the necessary ordering dependencies are implicitly created for all socket units\&. For more information about sockets\&.target, see B<systemd.special>(7)\&. It is not necessary or recommended to place any additional dependencies on socket units (for example from multi-user\&.target or suchlike) when one is installed in sockets\&.target\&.
de: Systemd implementiert Socket-basierte Aktivierung mittels \&.socket-Units, die in B<systemd.socket>(5) beschrieben sind\&. Wenn Socket-Units für Socket-basierte Aktivierung konfiguriert werden, ist es wesentlich, dass alle Sockets, bei denen auf Anfragen gewartet wird, durch eine spezielle Ziel-Unit sockets\&.target hereingezogen werden\&. Es wird empfohlen, eine Anweisung I<WantedBy=sockets\&.target> in den Abschnitt »[Install]« zu setzen, um eine solche Abhängigkeit automatisch bei der Installation einer Socket-Unit hinzuzufügen\&. Die notwendigen Ordnungs-Abhängigkeiten werden für alle Socket-Units implizit erstellt, falls I<DefaultDependencies=no> nicht gesetzt ist\&. Für weitere Informationen über sockets\&.target, siehe B<systemd.special>(7)\&. Es ist nicht notwendig oder empfohlen, zusätzliche Abhängigkeiten auf Socket-Units abzulegen (zum Beispiel von multi-user\&.target oder ähnlichem), wenn eine in sockets\&.target installiert ist\&.

source: Bus-Based Activation
de: Bus-basierte Aktivierung

source: When the D-Bus IPC system is used for communication with clients, new-style daemons should employ bus activation so that they are automatically activated when a client application accesses their IPC interfaces\&. This is configured in D-Bus service files (not to be confused with systemd service unit files!)\&. To ensure that D-Bus uses systemd to start-up and maintain the daemon, use the I<SystemdService=> directive in these service files to configure the matching systemd service for a D-Bus service\&. e\&.g\&.: For a D-Bus service whose D-Bus activation file is named org\&.freedesktop\&.RealtimeKit\&.service, make sure to set I<SystemdService=rtkit-daemon\&.service> in that file to bind it to the systemd service rtkit-daemon\&.service\&. This is needed to make sure that the daemon is started in a race-free fashion when activated via multiple mechanisms simultaneously\&.
de: Wenn das D-Bus-IPC-System für die Kommunikation mit Clients verwandt wird, sollten neuartige Daemons Bus-Aktivierung einsetzen, so dass sie automatisch aktiviert werden, wenn eine Client-Anwendung auf ihre IPC-Schnittstelle zugreift\&. Dies wird in D-Bus-Dienste-Dateien (die nicht mit Systemds Dienste-Unit-Dateien durcheinandergebracht werden dürfen) konfiguriert\&. Um sicherzustellen, dass D-Bus Systemd verwendet, um den Daemon zu starten und zu verwalten, verwenden Sie die Anweisung I<SystemdService=> in diesen Dienste-Dateien, um den passenden Systemd-Dienst für einen D-Bus-Dienst zu konfigurieren. Stellen Sie beispielsweise für einen D-Bus-Dienst, dessen D-Bus-Aktivierungsdatei org\&.freedesktop\&.RealtimeKit\&.service heißt, sicher, dass I<SystemdService=rtkit-daemon\&.service> in dieser Datei gesetzt ist, um ihn an den Systemd-Dienst rtkit-daemon\&.service zu binden. Dies wird benötigt, um sicherzustellen, dass der Daemon ohne Ressourcenwettläufe gestartet wird, wenn er über mehrere Mechanismen simultan aktiviert wird\&.

source: Device-Based Activation
de: Geräte-basierte Aktivierung

source: Often, daemons that manage a particular type of hardware should be activated only when the hardware of the respective kind is plugged in or otherwise becomes available\&. In a new-style init system, it is possible to bind activation to hardware plug/unplug events\&. In systemd, kernel devices appearing in the sysfs/udev device tree can be exposed as units if they are tagged with the string "systemd"\&. Like any other kind of unit, they may then pull in other units when activated (i\&.e\&. plugged in) and thus implement device-based activation\&. systemd dependencies may be encoded in the udev database via the I<SYSTEMD_WANTS=> property\&. See B<systemd.device>(5) for details\&. Often, it is nicer to pull in services from devices only indirectly via dedicated targets\&. Example: Instead of pulling in bluetoothd\&.service from all the various bluetooth dongles and other hardware available, pull in bluetooth\&.target from them and bluetoothd\&.service from that target\&. This provides for nicer abstraction and gives administrators the option to enable bluetoothd\&.service via controlling a bluetooth\&.target\&.wants/ symlink uniformly with a command like B<enable> of B<systemctl>(1) instead of manipulating the udev ruleset\&.
de: Oft sollen Daemons, die einen besonderen Hardwaretyp verwalten, nur aktiviert werden, wenn die Hardware der entsprechenden Art eingesteckt oder andernfalls verfügbar gemacht wird\&. In einem neuartigen Init-System ist es möglich, die Aktivierung an Hardware-Einsteck-/Aussteck-Ereignisse zu binden\&. In Systemd können Kernel-Geräte, die in dem Gerätebaum sysfs/udev auftauchen, als Units offengelegt werden, falls sie mit der Zeichenkette »systemd« markiert sind\&. Wie andere Arten von Units können sie dann andere Units bei der Aktivierung (z\&.B\&. beim Einstecken) hereinziehen, und daher Geräte-basierte Aktivierung implementieren\&. Systemd-Abhängigkeiten können in der Udev-Datenbank mittels der Eigenschaft I<SYSTEMD_WANTS=> kodiert werden\&. Siehe B<systemd.device>(5) für Details\&. Oft ist es schöner, einen Dienst von Geräten nur indirekt über dedizierte Ziele hereinzuziehen\&. Beispiel: Statt bluetoothd\&.service von alle den verschiedenen Bluetooth-Dongles und anderen verfügbaren Hardwaren hereinzuziehen, ziehen Sie von ihnen bluetooth\&.target herein und dann bluetoothd\&.service von diesem Ziel\&. Dies stellt eine nettere Abstraktion bereit und ermöglicht Administratoren die Option, bluetoothd\&.service über einen Symlink bluetooth\&.target\&.wants/ uniform mit einem Befehl der Art B<enable> von B<systemctl>(1) zu steuern, statt den Udev-Regelsatz zu bearbeiten\&.

source: Path-Based Activation
de: Pfadbasierte Aktivierung

source: Often, runtime of daemons processing spool files or directories (such as a printing system) can be delayed until these file system objects change state, or become non-empty\&. New-style init systems provide a way to bind service activation to file system changes\&. systemd implements this scheme via path-based activation configured in \&.path units, as outlined in B<systemd.path>(5)\&.
de: Oft können Laufzeit-Daemons, die Spool-Dateien oder -Verzeichnisse (wie bei einem Drucksystem) verarbeiten, verzögert werden, bis diese Dateisystemobjekte den Zustand ändern oder nicht mehr leer sind\&. Neuartige Init-Systeme stellen einen Weg bereit, die Diensteaktivierung an Dateisystemänderungen zu binden\&. Systemd implementiert dieses Schema mittels in \&.path-Units konfigurierter pfadbasierter Aktivierung, wie in B<systemd.path>(5) skizziert\&.

source: Timer-Based Activation
de: Timer-basierte Aktivierung

source: Some daemons that implement clean-up jobs that are intended to be executed in regular intervals benefit from timer-based activation\&. In systemd, this is implemented via \&.timer units, as described in B<systemd.timer>(5)\&.
de: Einige Daemons, die Aufräumaufgaben erledigen, die regelmäßig ausgeführt werden sollen, ziehen aus Timer-basierter Aktivierung einen Nutzen\&. In Systemd ist dies mittels \&.timer-Units implementiert, wie in B<systemd.timer>(5) beschrieben\&.

source: Other Forms of Activation
de: Andere Formen der Aktivierung

source: Other forms of activation have been suggested and implemented in some systems\&. However, there are often simpler or better alternatives, or they can be put together of combinations of the schemes above\&. Example: Sometimes, it appears useful to start daemons or \&.socket units when a specific IP address is configured on a network interface, because network sockets shall be bound to the address\&. However, an alternative to implement this is by utilizing the Linux B<IP_FREEBIND>/B<IPV6_FREEBIND> socket option, as accessible via I<FreeBind=yes> in systemd socket files (see B<systemd.socket>(5) for details)\&. This option, when enabled, allows sockets to be bound to a non-local, not configured IP address, and hence allows bindings to a particular IP address before it actually becomes available, making such an explicit dependency to the configured address redundant\&. Another often suggested trigger for service activation is low system load\&. However, here too, a more convincing approach might be to make proper use of features of the operating system, in particular, the CPU or I/O scheduler of Linux\&. Instead of scheduling jobs from userspace based on monitoring the OS scheduler, it is advisable to leave the scheduling of processes to the OS scheduler itself\&. systemd provides fine-grained access to the CPU and I/O schedulers\&. If a process executed by the init system shall not negatively impact the amount of CPU or I/O bandwidth available to other processes, it should be configured with I<CPUSchedulingPolicy=idle> and/or I<IOSchedulingClass=idle>\&. Optionally, this may be combined with timer-based activation to schedule background jobs during runtime and with minimal impact on the system, and remove it from the boot phase itself\&.
de: Es wurden andere Formen der Aktivierung vorgeschlagen und in einigen Systemen implementiert\&. Allerdings gibt es oft einfachere und bessere Alternativen oder sie können als Kombination der obigen Schemata zusammengestellt werden\&. Beispiel: Manchmal erscheint es nützlich, Daemons oder \&.socket-Units zu starten, wenn eine bestimmte IP-Adresse an einer Netzwerkschnittstelle konfiguriert ist, da Netzwerk-Sockets an diese Adresse gebunden werden sollen\&. Eine Alternative zur Implementierung hiervon ist die Verwendung der Socket-Option B<IP_FREEBIND>/B<IPV6_FREEBIND> von Linux, die mittels I<FreeBind=yes> in Systemd-Socket-Dateien erreichbar ist (siehe B<systemd.socket>(5) für Details)\&. Diese Option erlaubt Sockets, wenn sie aktiviert ist, an nichtlokale, nichtkonfigurierte IP-Adressen gebunden zu werden und erlaubt damit Anbindungen an bestimmte IP-Adressen, bevor diese tatsächlich verfügbar werden; dies macht eine solche explizite Abhängigkeit auf die konfigurierte Adresse redundant\&. Ein anderer oft vorgeschlagener Auslöser für Dienste-Aktivierung ist niedrige Systemlast\&. Auch hier könnte allerdings ein überzeugender Ansatz sein, die Funktionalitäten des Betriebssystems korrekt zu benutzen, insbesondere des CPU- oder E/A-Schedulers von Linux\&. Anstatt Aufträge vom Anwenderbereich, basierend auf der Überwachung des Betriebssystem-Schedulers, einzuplanen, ist es empfehlenswert, die Einplanung von Prozessen dem Betriebssystem-Scheduler selbst zu überlassen\&. Systemd stellt einen feingranularen Zugriff auf die CPU- und E/A-Scheduler bereit\&. Falls ein vom Init-System ausgeführter Prozess den Umfang der für andere Prozesse verfügbaren CPU- oder E/A-Bandbreite nicht negativ beeinflussen soll, sollte er mit I<CPUSchedulingPolicy=idle> und/oder I<IOSchedulingClass=idle> konfiguriert werden\&. Optional kann dies mit Timer-basierter Aktivierung kombiniert werden, um Hintergrund-Aufträge während der Laufzeit und mit minimalen Auswirkungen auf das System einzuplanen und ihn aus der Systemstartphase selbst zu entfernen\&.

source: INTEGRATION WITH SYSTEMD
de: INTEGRATION MIT SYSTEMD

source: Writing systemd Unit Files
de: Schreiben von Systemd-Unit-Dateien

source: When writing systemd unit files, it is recommended to consider the following suggestions:
de: Beim Schreiben von Systemd-Unit-Dateien wird empfohlen, die folgenden Vorschläge zu berücksichtigen:

source: If possible, do not use the I<Type=forking> setting in service files\&. But if you do, make sure to set the PID file path using I<PIDFile=>\&. See B<systemd.service>(5) for details\&.
de: Falls möglich, nutzen Sie die Einstellung I<Type=forking> in Dienstedateien nicht\&. Falls Sie es aber machen, stellen Sie sicher, den PID-Dateipfad mit I<PIDFile=> zu setzen\&. Siehe B<systemd.service>(5) für Details\&.

source: If your daemon registers a D-Bus name on the bus, make sure to use I<Type=dbus> in the service file if possible\&.
de: Falls Ihr Daemon einen D-Bus-Namen auf dem Bus registriert, stellen Sie sicher, falls möglich I<Type=dbus> in der Dienstedatei zu verwenden\&.

source: Make sure to set a good human-readable description string with I<Description=>\&.
de: Setzen Sie eine gut lesbare Beschreibung in I<Description=>\&.

source: Do not disable I<DefaultDependencies=>, unless you really know what you do and your unit is involved in early boot or late system shutdown\&.
de: Deaktivieren Sie I<DefaultDependencies=> nicht, außer Sie wissen genau, was Sie tun und Ihre Unit ist in der frühen Systemstartphase oder im späten Herunterfahren beteiligt\&.

source: Normally, little if any dependencies should need to be defined explicitly\&. However, if you do configure explicit dependencies, only refer to unit names listed on B<systemd.special>(7) or names introduced by your own package to keep the unit file operating system-independent\&.
de: Normalerweise werden wenige, falls überhaupt, Abhängigkeiten explizit definiert werden müssen\&. Falls Sie allerdings explizite Abhängigkeiten definieren, beziehen Sie sich nur auf Units, die in B<systemd.special>(7) aufgeführt sind oder auf Namen, die von Ihrem eigenen Paket bekanntgegeben sind, um Ihre Unit-Datei Betriebssystem-unabhängig zu halten\&.

source: Make sure to include an [Install] section including installation information for the unit file\&. See B<systemd.unit>(5) for details\&. To activate your service on boot, make sure to add a I<WantedBy=multi-user\&.target> or I<WantedBy=graphical\&.target> directive\&. To activate your socket on boot, make sure to add I<WantedBy=sockets\&.target>\&. Usually, you also want to make sure that when your service is installed, your socket is installed too, hence add I<Also=foo\&.socket> in your service file foo\&.service, for a hypothetical program foo\&.
de: Nehmen Sie einen Abschnitt »[Install]« auf, der die Installationsinformation für die Unit-Datei enthält\&. Siehe B<systemd.unit>(5) für Details\&. Um Ihren Dienst beim Systemstart zu aktivieren, fügen Sie eine Anweisung I<WantedBy=multi-user\&.target> oder I<WantedBy=graphical\&.target> hinzu\&. Um Ihr Socket beim Systemstart zu aktivieren, fügen Sie I<WantedBy=sockets\&.target> hinzu\&. Normalerweise wollen Sie auch sicherstellen, dass bei der Installation Ihres Dienstes auch Ihr Socket installiert wird, daher fügen Sie I<Also=foo\&.socket> in Ihrer Dienstedatei foo\&.service für ein hypothetisches Programm foo hinzu\&.

source: Installing systemd Service Files
de: Systemd-Dienstedateien installieren

source: At the build installation time (e\&.g\&. B<make install> during package build), packages are recommended to install their systemd unit files in the directory returned by B<pkg-config systemd --variable=systemdsystemunitdir> (for system services) or B<pkg-config systemd --variable=systemduserunitdir> (for user services)\&. This will make the services available in the system on explicit request but not activate them automatically during boot\&. Optionally, during package installation (e\&.g\&. B<rpm -i> by the administrator), symlinks should be created in the systemd configuration directories via the B<enable> command of the B<systemctl>(1) tool to activate them automatically on boot\&.
de: Zum Bauinstallationszeitpunkt (d\&.h\&. B<make install> während des Paketbaus) wird empfohlen, dass Pakete ihre Systemd-Unit-Dateien im Verzeichnis, das von B<pkg-config systemd --variable=systemdsystemunitdir> (für Systemdienste) oder B<pkg-config systemd --variable=systemduserunitdir> (für Benutzerdienste) zurückgeliefert wird, zu installieren\&. Damit wird der Dienst im System für explizite Anfragen verfügbar gemacht, aber nicht beim Systemstart automatisch aktiviert\&. Optional sollten während der Paketinstallation (z\&.B\&. B<rpm -i> durch den Administrator) Symlinks in den Systemd-Konfigurationsverzeichnissen mit dem Befehl B<enable> des Werkzeuges B<systemctl>(1) erstellt werden, um sie beim Systemstart automatisch zu aktivieren\&.

source: Packages using B<autoconf>(1) are recommended to use a configure script excerpt like the following to determine the unit installation path during source configuration:
de: Für Pakete, die B<autoconf>(1) verwenden, wird empfohlen, einen Configure-Skript-Auszug wie den nachfolgenden zu verwenden, um den Unit-Installationspfad während der Quellkonfiguration zu ermitteln:

source: This snippet allows automatic installation of the unit files on systemd machines, and optionally allows their installation even on machines lacking systemd\&. (Modification of this snippet for the user unit directory is left as an exercise for the reader\&.)
de: Dieser Schnipsel ermöglicht die automatische Installation der Unit-Dateien auf Systemd-Maschinen und erlaubt optional ihre Installation selbst auf Maschinen, denen Systemd fehlt\&. (Die Anpassung des Schnipsels auf das Benutzer-Unit-Verzeichnis bleibt als Aufgabe für den Leser\&.)

source: Additionally, to ensure that B<make distcheck> continues to work, it is recommended to add the following to the top-level Makefile\&.am file in B<automake>(1)-based projects:
de: Damit B<make distcheck> weiterhin funktioniert, wird auf B<automake>(1) basierenden Projekten zusätzlich empfohlen, folgendes zur Datei Makefile\&.am auf oberster Ebene hinzuzufügen:

source: Finally, unit files should be installed in the system with an automake excerpt like the following:
de: Schließlich sollten Unit-Dateien im System mit einem Automake-Ausschnitt der folgenden Art installiert werden:

source: In the B<rpm>(8) \&.spec file, use snippets like the following to enable/disable the service during installation/deinstallation\&. This makes use of the RPM macros shipped along systemd\&. Consult the packaging guidelines of your distribution for details and the equivalent for other package managers\&.
de: In der \&.spec-Datei von B<rpm>(8) verwenden Sie Schnipsel der folgenden Art, um Dienste während der Installation/Deinstallation zu aktivieren/zu deaktivieren\&. Dies verwendet RPM-Makros, die zusammen mit Systemd ausgeliefert werden\&. Ziehen Sie die Paketierungsrichtlinien Ihrer Distribution für Details und die Äquivalente anderer Paketverwalter hinzu\&.

source: At the top of the file:
de: Am Anfang der Datei:

source: And as scriptlets, further down:
de: Und als Skriptteile, weiter unten:

source: If the service shall be restarted during upgrades, replace the "%postun" scriptlet above with the following:
de: Falls der Dienst während der Aktualisierung neu gestartet werden soll, ersetzen Sie den Skriptteil »%postun« mit nachfolgendem:
