Repository: sebras/manpages-l10n
Catalog: po/*/man7/daemon.7.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: daemon - Writing and packaging system daemons
de: daemon - Schreiben und Paketieren von System-Daemons

source: DESCRIPTION
de: BESCHREIBUNG

source: A daemon is a service process that runs in the background and supervises the system or provides functionality to other processes\&. Traditionally, daemons are implemented following a scheme originating in SysV Unix\&. Modern daemons should follow a simpler yet more powerful scheme (here called "new-style" daemons), as implemented by B<systemd>(1)\&. This manual page covers both schemes, and in particular includes recommendations for daemons that shall be included in the systemd init system\&.
de: Ein Daemon ist ein Diensteprozess, der im Hintergrund läuft und das System beaufsichtigt oder Funktionalitäten für andere Prozesse bereitstellt\&. Traditionell werden Daemons so implementiert, dass sie einem ursprünglich aus SysV-Unix stammenden Schema folgen\&. Moderne Daemons sollten einem einfacheren, aber dennoch leistungsfähigeren Schema folgen (hier »neuartige« Daemons genannt), wie es von B<systemd>(1) implementiert wird\&. Diese Handbuchseite deckt beide Schemata ab und enthält insbesondere Empfehlungen für Daemons, die im Systemd-Init-System aufgenommen werden sollen\&.

source: When a traditional SysV daemon starts, it should execute the following steps as part of the initialization\&. Note that these steps are unnecessary for new-style daemons (see below), and should only be implemented if compatibility with SysV is essential\&.
de: Wenn ein traditioneller SysV-Daemon startet, sollte er die folgenden Schritte als Teil seiner Initialisierung ausführen\&. Beachten Sie, dass diese Schritte von neuartigen Daemons (siehe unten) nicht benötigt werden\&. Sie sollten daher nur implementiert werden, wenn die Kompatibilität zu SysV essenziell ist\&.

source: Close all open file descriptors except standard input, output, and error (i\&.e\&. the first three file descriptors 0, 1, 2)\&. This ensures that no accidentally passed file descriptor stays around in the daemon process\&. On Linux, this is best implemented by iterating through /proc/self/fd, with a fallback of iterating from file descriptor 3 to the value returned by B<getrlimit()> for B<RLIMIT_NOFILE>\&.
de: Alle offenen Dateideskriptoren außer der Standardeingabe, -ausgabe und -fehlerausgabe (d\&.h\&. den drei ersten Dateideskriptoren 0, 1, 2) werden geschlossen\&. Dies stellt sicher, dass kein versehentlich geöffneter Dateideskriptor im Daemon-Prozess verbleibt\&. Unter Linux wird dies am besten dadurch implementiert, dass durch /proc/self/fd iteriert wird, mit der Rückfalloption, von Dateideskriptor 3 bis zu dem von B<getrlimit()> für B<RLIMIT_NOFILE> zurückgelieferten Wert durchzuiterieren\&.

source: Reset all signal handlers to their default\&. This is best done by iterating through the available signals up to the limit of B<_NSIG> and resetting them to B<SIG_DFL>\&.
de: Alle Signal-Handler werden auf ihre Vorgaben zurückgesetzt\&. Dies erfolgt am besten durch Iteration durch alle verfügbaren Signale bis zur Grenze von B<_NSIG> und dem Zurücksetzen dieser auf B<SIG_DFL>\&.

source: Reset the signal mask using B<sigprocmask()>\&.
de: Zurücksetzen der Signal-Maske mittels B<sigprocmask()>\&.

source: Sanitize the environment block, removing or resetting environment variables that might negatively impact daemon runtime\&.
de: Bereinigen des Umgebungsblocks, Entfernen oder Zurücksetzen der Umgebungsvariablen, die einen negativen Einfluss auf die Laufzeit des Daemons haben könnten\&.

source: Call B<fork()>, to create a background process\&.
de: Aufrufen von B<fork()>, um einen Hintergrundprozess zu erzeugen\&.

source: In the child, call B<setsid()> to detach from any terminal and create an independent session\&.
de: Aufruf von B<setsid()> im Kind, um von jedem Terminal zu trennen und eine unabhängige Sitzung zu erzeugen\&.

source: In the child, call B<fork()> again, to ensure that the daemon can never re-acquire a terminal again\&. (This relevant if the program \(em and all its dependencies \(em does not carefully specify `O_NOCTTY` on each and every single `open()` call that might potentially open a TTY device node\&.)
de: Erneuter Aufruf von B<fork()> im Kind, um sicherzustellen, dass der Daemon niemals wieder ein Terminal erlangen kann\&. (Dies ist relevant, falls das Programm und alle seine Abhängigkeiten nicht sorgfältig genug sind, um bei jedem »open()«-Aufruf, der möglicherweise einen TTY-Geräteknoten erlangen könnte, stets »O_NOCTTY« festzulegen\&.)

source: Call B<exit()> in the first child, so that only the second child (the actual daemon process) stays around\&. This ensures that the daemon process is re-parented to init/PID 1, as all daemons should be\&.
de: Aufruf von B<exit()> im ersten Kind, so dass nur das zweite Kind (der eigentliche Daemon) verbleibt\&. Dies stellt sicher, dass der Daemon-Prozess PID 1 als neuen Elternprozess bekommt, wie das bei allen Daemons der Fall sein sollte.

source: In the daemon process, connect /dev/null to standard input, output, and error\&.
de: Verbinden von /dev/null im Daemon-Prozess mit der Standardeingabe, -ausgabe und -fehlerausgabe\&.

source: In the daemon process, reset the umask to 0, so that the file modes passed to B<open()>, B<mkdir()> and suchlike directly control the access mode of the created files and directories\&.
de: Zurücksetzen der Umask auf 0 im Daemon-Prozess, so dass die an B<open()>, B<mkdir()> und ähnliche weitergegebenen Dateimodi direkt die Zugriffsmodi auf die erstellten Dateien und Verzeichnisse steuern\&.

source: In the daemon process, change the current directory to the root directory (/), in order to avoid that the daemon involuntarily blocks mount points from being unmounted\&.
de: Ändern des aktuellen Verzeichnisses im Daemon-Prozess auf das Wurzelverzeichnis (/), um zu vermeiden, dass der Daemon unfreiwillig die Einhängepunkte vor dem Aushängen blockiert\&.

source: In the daemon process, write the daemon PID (as returned by B<getpid()>) to a PID file, for example /run/foobar\&.pid (for a hypothetical daemon "foobar") to ensure that the daemon cannot be started more than once\&. This must be implemented in race-free fashion so that the PID file is only updated when it is verified at the same time that the PID previously stored in the PID file no longer exists or belongs to a foreign process\&.
de: Schreiben der Daemon-PID (wie von B<getpid()> zurückgeliefert) im Daemon-Prozess in eine PID-Datei, beispielsweise /run/foobar\&.pid (für einen hypothetischen Daemon »foobar«), um sicherzustellen, dass der Daemon nicht mehr als einmal gestartet wird\&. Dies muss so implementiert werden, dass kein Ressourcenwettlauf möglich ist, so dass die PID-Datei nur aktualisiert wird, wenn gleichzeitig sichergestellt ist, dass die vorher in der PID-Datei gespeicherte PID nicht mehr existiert oder zu einem fremden Prozess gehört\&.

source: In the daemon process, drop privileges, if possible and applicable\&.
de: Abgeben der Privilegien im Daemon-Prozess, falls möglich und zutreffend\&.

source: From the daemon process, notify the original process started that initialization is complete\&. This can be implemented via an unnamed pipe or similar communication channel that is created before the first B<fork()> and hence available in both the original and the daemon process\&.
de: Benachrichtigen des ursprünglich gestarteten Prozesses aus dem Daemon-Prozess, dass die Initialisierung abgeschlossen ist\&. Dies kann über eine unbenannte Pipe oder einen ähnlichen Kommunikationskanal, der vor dem ersten B<fork()> erstellt wurde und daher in sowohl dem ursprünglichen als auch dem Daemon-Prozess verfügbar ist, erfolgen\&.

source: Call B<exit()> in the original process\&. The process that invoked the daemon must be able to rely on that this B<exit()> happens after initialization is complete and all external communication channels are established and accessible\&.
de: Aufrufen von B<exit()> im ursprünglichen Prozess\&. Der Prozess, der den Daemon gestartet hat, muss in der Lage sein, sich darauf zu verlassen, dass dieser B<exit()> passiert, nachdem die Initialisierung abgeschlossen und die externen Kommunikationskanäle etabliert und zugreifbar sind\&.

source: The BSD B<daemon()> function should not be used, as it implements only a subset of these steps\&.
de: Die BSD-Funktion B<daemon()> sollte nicht verwandt werden, da sie nur eine Teilmenge dieser Schritte implementiert\&.

source: A daemon that needs to provide compatibility with SysV systems should implement the scheme pointed out above\&. However, it is recommended to make this behavior optional and configurable via a command line argument to ease debugging as well as to simplify integration into systems using systemd\&.
de: Ein Daemon, der Kompatibilität mit SysV-Systemen bereitstellen muss, sollte das oben dargestellte Schema implementieren\&. Es wird allerdings empfohlen, dieses Verhalten über eine Befehlszeilenoption optional und konfigurierbar zu gestalten, um die Fehlersuche zu erleichtern und um die Integration in Systeme, die Systemd verwenden, zu erleichtern\&.

source: New-Style Daemons
de: Neuartige Daemons

source: Modern services for Linux should be implemented as new-style daemons\&. This makes it easier to supervise and control them at runtime and simplifies their implementation\&.
de: Moderne Dienste für Linux sollten als neuartige Daemons implementiert werden\&. Dies erleichtert die Beaufsichtigung und Steuerung zur Laufzeit und vereinfacht ihre Implementierung\&.

source: For developing a new-style daemon, none of the initialization steps recommended for SysV daemons need to be implemented\&. New-style init systems such as systemd make all of them redundant\&. Moreover, since some of these steps interfere with process monitoring, file descriptor passing and other functionality of the init system, it is recommended not to execute them when run as new-style service\&.
de: Zur Entwicklung eines neuartigen Daemons muss keiner der für SysV-Daemons empfohlenen Initialisierungsschritte implementiert werden\&. Bei neuartigen Init-Systemen wie Systemd sind diese alle redundant\&. Da einige dieser Schritte sogar die Prozessüberwachung, Dateideskriptorweitergabe und andere Funktionalitäten des Init-Systems stören, wird empfohlen, sie nicht auszuführen, wenn sie als neuartiger Dienst ausgeführt laufen\&.

source: Note that new-style init systems guarantee execution of daemon processes in a clean process context: it is guaranteed that the environment block is sanitized, that the signal handlers and mask is reset and that no left-over file descriptors are passed\&. Daemons will be executed in their own session, with standard input connected to /dev/null and standard output/error connected to the B<systemd-journald.service>(8) logging service, unless otherwise configured\&. The umask is reset\&.
de: Beachten Sie, dass neuartige Init-Systeme die Ausführung eines Daemon-Prozesses in einem sauberen Prozesskontext garantieren: Es wird garantiert, dass der Umgebungsblock bereinigt ist, dass Signal-Handler und -Masken zurückgesetzt sind und dass kein übrig gebliebener Dateideskriptor weitergegeben wird\&. Daemons werden in ihrer eigenen Sitzung ausgeführt, wobei die Standardeingabe mit /dev/null und die Standardausgabe/Standardfehlerausgabe mit dem Protokollierungsdienst B<systemd-journald.service>(8) verbunden ist, außer dies ist anders konfiguriert\&. Die Umask ist zurückgesetzt\&.

source: It is recommended for new-style daemons to implement the following:
de: Es wird empfohlen, dass neuartige Daemons folgendes implementieren:

source: If B<SIGTERM> is received, shut down the daemon and exit cleanly\&.
de: Falls B<SIGTERM> empfangen wird, soll der Daemon sich herunterfahren und sauber beenden\&.

source: If B<SIGHUP> is received, reload the configuration files, if this applies\&.
de: Falls B<SIGHUP> empfangen wird, sollen die Konfigurationsdateien, falls zutreffend, neu geladen werden\&.

source: Provide a correct exit code from the main daemon process, as this is used by the init system to detect service errors and problems\&. It is recommended to follow the exit code scheme as defined in the \m[blue]B<LSB recommendations for SysV init scripts>\m[]\&\s-2\u[1]\d\s+2\&.
de: Es soll ein korrekter Exit-Code vom Haupt-Daemon-Prozess bereitgestellt werden, da dieser vom Init-System benutzt wird, um Dienstefehler und Probleme zu erkennen\&. Es wird empfohlen, dem in \m[blue]B<LSB-Empfehlungen für SysV-Init-Skripte>\m[]\&\s-2\u[1]\d\s+2 definierten Exit-Code-System zu folgen\&.

source: If possible and applicable, expose the daemon\*(Aqs control interface via the D-Bus IPC system and grab a bus name as last step of initialization\&.
de: Falls möglich und zutreffend sollte die Steuerschnittstelle mittels des D-Bus-IPC-Systems zugänglich gemacht und ein Bus-Name als letzten Schritt in der Initialisierung erlangt werden\&.

source: For integration in systemd, provide a \&.service unit file that carries information about starting, stopping and otherwise maintaining the daemon\&. See B<systemd.service>(5) for details\&.
de: Stellen Sie eine \&.service-Unit-Datei zur Integration mit Systemd bereit, die Informationen zum Starten, Beenden und anderseitigen Verwalten des Daemons enthält\&. Siehe B<systemd.service>(5) für Details\&.

source: As much as possible, rely on the init system\*(Aqs functionality to limit the access of the daemon to files, services and other resources, i\&.e\&. in the case of systemd, rely on systemd\*(Aqs resource limit control instead of implementing your own, rely on systemd\*(Aqs privilege dropping code instead of implementing it in the daemon, and similar\&. See B<systemd.exec>(5) for the available controls\&.
de: Verlassen Sie sich soweit möglich auf die Funktionalitäten des Init-Systems, den Zugriff des Daemons auf Dateien, Dienste und andere Ressourcen zu begrenzen, d\&.h\&. im Falle von Systemd, verlassen Sie sich auf Systemds Ressourenbegrenzungssteuerung statt Ihre eigene zu implementieren, verlassen Sie sich auf den Privilegienabgabe-Code von Systemd, statt ihn in Ihrem Daemon zu implementieren und ähnliches\&. SIehe B<systemd.exec>(5) für die verfügbaren Steuerungen\&.

source: If D-Bus is used, make your daemon bus-activatable by supplying a D-Bus service activation configuration file\&. This has multiple advantages: your daemon may be started lazily on-demand; it may be started in parallel to other daemons requiring it \(em which maximizes parallelization and boot-up speed; your daemon can be restarted on failure without losing any bus requests, as the bus queues requests for activatable services\&. See below for details\&.
de: Falls D-Bus verwandt wird, ermöglichen Sie die Bus-Aktivierung Ihres Daemons, indem Sie eine D-Bus-Dienste-Aktivierungsdatei bereitstellen\&. Dies hat eine Reihe von Vorteilen: Ihr Daemon kann erst bei Bedarf gestartet werden; er kann parallel zu anderen Daemons, die ihn benötigen, gestartet werden \(em wodurch die Parallelisierung und die Systemstartgeschwindigkeit maximiert wird; Ihr Daemon kann im Fehlerfall neu gestartet werden, ohne eine Bus-Anfrage zu verlieren, da die Bus-Warteschlagen aktivierbare Dienste erbitten\&. Siehe unten für Details\&.

source: If your daemon provides services to other local processes or remote clients via a socket, it should be made socket-activatable following the scheme pointed out below\&. Like D-Bus activation, this enables on-demand starting of services as well as it allows improved parallelization of service start-up\&. Also, for state-less protocols (such as syslog, DNS), a daemon implementing socket-based activation can be restarted without losing a single request\&. See below for details\&.
de: Falls Ihr Daemon Dienste für andere lokale Prozesse oder Clients in der Ferne über ein Socket anbietet, sollte es gemäß des nachfolgend dargestellten Schemas Socket-aktivierbar sein\&. Ähnlich der D-Bus-Aktivierung ermöglicht dies bedarfsgesteuertes Starten von Diensten sowie verbesserte Parallelisierung beim Starten der Dienste\&. Für zustandslose Protokolle (wie Syslog, DNS) kann ein Daemon, der Socket-basierte Aktivierung implementiert, auch ohne Verlust einer einzelnen Anfrage neu gestartet werden\&. Siehe unten für Details\&.

source: If applicable, a daemon should notify the init system about startup completion or status updates via the B<sd_notify>(3) interface\&.
de: Falls zutreffend sollte ein Daemon über den Abschluss des Startens oder Statusaktualisierungen mittels der Schnittstelle B<sd_notify>(3) informieren\&.

source: Instead of using the B<syslog()> call to log directly to the system syslog service, a new-style daemon may choose to simply log to standard error via B<fprintf()>, which is then forwarded to syslog by the init system\&. If log levels are necessary, these can be encoded by prefixing individual log lines with strings like "E<lt>4E<gt>" (for log level 4 "WARNING" in the syslog priority scheme), following a similar style as the Linux kernel\*(Aqs B<printk()> level system\&. For details, see B<sd-daemon>(3) and B<systemd.exec>(5)\&.
de: Statt den Aufruf B<syslog()> zum direkten Protokollieren in den Systemprotokolldienst zu verwenden, kann ein neuartiger Daemon einfach auf die Standardfehlerausgabe mittels B<fprintf()> protokollieren, was dann durch das Init-System an Syslog weitergeleitet wird\&. Falls Protokollierungsstufen notwendig sind, können diese durch Voranstellen von Zeichenketten wie »E<lt>4E<gt>« (für Protokollierungsstufe 4 »WARNING« im Syslog-Prioritätsschema) vor individuellen Protokollierzeilen kodiert werden. Dies folgt einem ähnlichen Stil wie das B<printk()>-Stufensystem des Linux-Kernels\&. Für Details siehe B<sd-daemon>(3) und B<systemd.exec>(5)\&.

source: As new-style daemons are invoked without a controlling TTY (but as their own session leaders) care should be taken to always specify `O_NOCTTY` on `open()` calls that possibly reference a TTY device node, so that no controlling TTY is accidentally acquired\&.
de: Da neuartige Daemons ohne ein steuerndes TTY (aber sie selbst als ihren eigenen Sitzungsleiter) aufgerufen werden, sollte sichergestellt werden, dass bei »open()«-Aufrufen, die möglicherweise einen TTY-Geräteknoten referenzieren, stets »O_NOCTTY« festgelegt wird, so dass nicht versehentlich ein steuerndes TTY erlangt wird\&.

source: These recommendations are similar but not identical to the \m[blue]B<Apple MacOS X Daemon Requirements>\m[]\&\s-2\u[2]\d\s+2\&.
de: Diese Empfehlungen sind ähnlich zu, aber nicht identisch mit den \m[blue]B<Apple-MacOS-X-Daemon-Anforderungen>\m[]\&\s-2\u[2]\d\s+2\&.

source: ACTIVATION
de: AKTIVIERUNG

source: New-style init systems provide multiple additional mechanisms to activate services, as detailed below\&. It is common that services are configured to be activated via more than one mechanism at the same time\&. An example for systemd: bluetoothd\&.service might get activated either when Bluetooth hardware is plugged in, or when an application accesses its programming interfaces via D-Bus\&. Or, a print server daemon might get activated when traffic arrives at an IPP port, or when a printer is plugged in, or when a file is queued in the printer spool directory\&. Even for services that are intended to be started on system bootup unconditionally, it is a good idea to implement some of the various activation schemes outlined below, in order to maximize parallelization\&. If a daemon implements a D-Bus service or listening socket, implementing the full bus and socket activation scheme allows starting of the daemon with its clients in parallel (which speeds up boot-up), since all its communication channels are established already, and no request is lost because client requests will be queued by the bus system (in case of D-Bus) or the kernel (in case of sockets) until the activation is completed\&.
de: Neuartige Init-Systeme stellen eine Reihe von zusätzlichen Mechanismen bereit, um Dienste zu aktivieren\&. Details dazu weiter unten\&. Es ist typisch, dass Dienste konfiguriert wurden, über mehr als einen Mechanismus gleichzeitig aktiviert zu werden\&. Beispielsweise könnte in einem Systemd-System bluetoothd\&.service aktiviert werden, wenn eine Bluetooth-Hardware eingesteckt wird oder wenn eine Anwendung mittels D-Bus auf seine Programmierschnittstelle zugreift\&. Oder ein Drucker-Server-Daemon könnte aktiviert werden, wenn Daten auf einem IPP-Port ankommen oder wenn ein Drucker eingesteckt wird oder wenn eine Datei im Drucker-Spool-Verzeichnis in die Warteschlange kommt\&. Selbst für Dienste, die dazu gedacht sind, beim Systemstart bedingungslos zu starten, ist es eine gute Idee, einige der unten dargestellten verschiedenen Aktivierungsschemata zu implementieren, um die Parallelisierung zu maximieren\&. Falls ein Daemon einen D-Bus-Dienst implementiert oder an einem Socket auf Anfragen wartet, erlaubt die Implementierung des kompletten Bus- und Socket-Aktivierungsschematas das Starten des Daemons mit seinen Clients parallel durchzuführen (womit der Systemstart beschleunigt wird), da bereits alle Kommunikationskanäle etabliert sind und keine Anfrage verloren geht, da Client-Anfragen vom Bus-System in Warteschlangen gestellt werden (im Falle von D-Bus) oder durch den Kernel (im Falle von Sockets), bis die Aktivierung abgeschlossen ist\&.

source: Activation on Boot
de: Aktivierung beim Systemstart

source: Old-style daemons are usually activated exclusively on boot (and manually by the administrator) via SysV init scripts, as detailed in the \m[blue]B<LSB Linux Standard Base Core Specification>\m[]\&\s-2\u[1]\d\s+2\&. This method of activation is supported ubiquitously on Linux init systems, both old-style and new-style systems\&. Among other issues, SysV init scripts have the disadvantage of involving shell scripts in the boot process\&. New-style init systems generally employ updated versions of activation, both during boot-up and during runtime and using more minimal service description files\&.
de: Daemons der alten Art werden typischerweise exklusiv beim Systemstart (oder manuell durch den Systemadministrator) mittels SysV-Init-Skripten aktiviert, wie dies in der \m[blue]B<LSB Linux Standard Base Kern-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 dargestellt ist\&. Diese Methode wird universell auf Linux-Init-Systemen unterstützt, sowohl bei denen der alten Art als auch bei neuartigen\&. Unter anderen Problemen haben die SysV-Init-Skripte den Nachteil, Shell-Skripte im Systemstartprozess zu involvieren\&. Neuartige Init-Systeme setzen im Allgemeinen aktualisierte Versionen der Aktivierung ein, sowohl während des Systemstarts als auch während der Laufzeit und verwenden minimalere Dienstebeschreibungsdateien\&.

source: In systemd, if the developer or administrator wants to make sure that a service or other unit is activated automatically on boot, it is recommended to place a symlink to the unit file in the \&.wants/ directory of either multi-user\&.target or graphical\&.target, which are normally used as boot targets at system startup\&. See B<systemd.unit>(5) for details about the \&.wants/ directories, and B<systemd.special>(7) for details about the two boot targets\&.
de: Falls der Entwickler oder Administrator in Systemd sicherstellen möchte, dass ein Dienst oder eine andere Unit automatisch beim Systemstart aktiviert ist, wird empfohlen, einen Symlink auf die Unit-Datei im Verzeichnis \&.wants/ von entweder multi-user\&.target oder graphical\&.target, die normalerweise als Systemstartziele beim Systemstart verwandt werden, zu legen\&. Siehe B<systemd.unit>(5) für Details über die Verzeichnisse \&.wants/ und B<systemd.special>(7) für Details über die zwei Systemstartziele\&.

source: Socket-Based Activation
de: Socket-basierte Aktivierung
