Repository: sebras/manpages-l10n
Catalog: po/*/man7/feature_test_macros.7.po
Languages: de, fr

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux

source: NAME
de: BEZEICHNUNG
fr: NOM

source: feature_test_macros - feature test macros
de: feature_test_macros - Feature-Test-Makros
fr: feature_test_macros – Macros de test de fonctionnalités

source: DESCRIPTION
de: BESCHREIBUNG

source: Feature test macros allow the programmer to control the definitions that are exposed by system header files when a program is compiled.
de: Mit Feature-Test-Makros kann der Programmierer steuern, welche Definitionen aus System-Header-Dateien bei der Kompilierung eines Programms verwendet werden.
fr: Les macros de test de fonctionnalités permettent au programmeur de contrôler quelles définitions sont exposées par les fichiers d'en\(hytêtes système lorsqu'un programme est compilé.

source: B<NOTE:> In order to be effective, a feature test macro I<must be defined before including any header files>. This can be done either in the compilation command (I<cc -DMACRO=value>) or by defining the macro within the source code before including any headers. The requirement that the macro must be defined before including any header file exists because header files may freely include one another. Thus, for example, in the following lines, defining the B<_GNU_SOURCE> macro may have no effect because the header I<E<lt>abc.hE<gt>> itself includes I<E<lt>xyz.hE<gt>> (POSIX explicitly allows this):
de: B<HINWEIS:> Um wirksam zu sein, I<muss die Definition eines Feature-Test-Makros im Quelltext vor den #include-Anweisungen für die Header-Dateien stehen>. Dies kann entweder im Kompilierbefehl (I<cc -DMACRO=value>) oder durch die Definition des Makros innerhalb des Quellcodes vor dem Einlesen aller Header erreicht werden. Die Anforderung, dass das Makro definiert sein muss, bevor es in irgendwelche Header-Dateien eingebunden wird, existiert, da sich Header-Dateien ohne Einschränkungen gegenseitig einbinden dürfen. Daher kann beispielsweise in den nachfolgenden Zeilen die Definition des Makros B<_GNU_SOURCE> keine Wirkung haben, da der Header I<E<lt>abc.hE<gt>> selbst I<E<lt>xyz.hE<gt>> einbindet (POSIX erlaubt dies explizit):
fr: B<NOTE :> pour avoir un effet, une macro de test de fonctionnalités I<doit être définie avant d'inclure tout fichier d'en\(hytête>. Cela peut être accompli soit dans la ligne de commande de compilation (I<cc\ -DMACRO=valeur>), soit en définissant la macro dans le code source avant d'inclure tout en\(hytête. L’exigence que la macro soit définie avant d’inclure n’importe quel fichier d’en-tête existe parce que les fichiers d’en-tête peuvent librement s’inclure mutuellement. Donc, par exemple, dans les lignes suivantes, définir la macro B<_GNU_SOURCE> peut n’avoir aucun effet parce que l’en-tête I<E<lt>abc.hE<gt>> lui-même inclut I<E<lt>xyz.hE<gt>> (POSIX le permet explicitement) :

source: Some feature test macros are useful for creating portable applications, by preventing nonstandard definitions from being exposed. Other macros can be used to expose nonstandard definitions that are not exposed by default.
de: Einige Feature-Test-Makros helfen bei der Erstellung von portablen Anwendungen, indem sie die Verwendung nicht standardgemäßer Definitionen verhindern. Andere Makros können verwendet werden, um gezielt nicht standardisierte Definitionen, die sonst per Voreinstellung nicht verwendet werden, zu verwenden.
fr: Certaines macros de test de fonctionnalités sont utiles pour créer des applications portables, en empêchant des définitions non normalisées d'être exposées. D'autres macros peuvent être utilisées pour exposer des définitions non normalisées qui ne sont pas exposées par défaut.

source: The precise effects of each of the feature test macros described below can be ascertained by inspecting the I<E<lt>features.hE<gt>> header file. B<Note>: applications do I<not> need to directly include I<E<lt>features.hE<gt>>; indeed, doing so is actively discouraged. See NOTES.
de: Die genauen Auswirkungen jedes der im Folgenden beschriebenen Feature-Test-Makros können Sie durch Auswertung der Header-Datei I<E<lt>features.hE<gt>> ermitteln. B<Anmerkung>: Applikationen müssen I<E<lt>features.hE<gt>> I<nicht> direkt einbinden; es ist im Gegenteil sogar unerwünscht. Siehe ANMERKUNGEN.
fr: Les effets précis de chacune des macros décrites ci\(hydessous peuvent être vérifiés en inspectant le fichier d'en\(hytête I<E<lt>features.hE<gt>>. B<Remarque> : les applications I<n’ont pas> besoin d’inclure directement I<E<lt>features.hE<gt>>. En fait, le faire est fortement déconseillé. Consultez les NOTES.

source: Specification of feature test macro requirements in manual pages
de: Spezifikation der Funktion-Test-Makro-Anforderungen in Handbuchseiten
fr: Spécification des exigences de macro de test de fonctionnalités dans les pages de manuel

source: When a function requires that a feature test macro is defined, the manual page SYNOPSIS typically includes a note of the following form (this example from the B<acct>(2) manual page):
de: Wenn eine Funktion die Definition eines Feature-Test-Makros erfordert, enthält die ÜBERSICHT einer Handbuchseit in der Regel einen Vermerk der folgenden Form (dieses Beispiel finden Sie in der Handbuchseite von B<acct>(2)):
fr: Quand une fonction nécessite qu'une macro de test de fonctionnalités soit définie, la section SYNOPSIS de la page de manuel comprend généralement une note de la forme suivante (exemple pris dans la page de manuel B<acct>(2)) :

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe feature_test_macros(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consultez B<feature_test_macros>(7)) :

source: The B<||> means that in order to obtain the declaration of B<acct>(2) from I<E<lt>unistd.hE<gt>>, I<either> of the following macro definitions must be made before including any header files:
de: Das B<||> bedeutet, dass zwecks Ermittlung der Deklaration von B<acct>(2) aus I<E<lt>unistd.hE<gt>> I<eine der beiden> folgenden Makro-Definitionen vor dem Einfügen jeglicher Header-Dateien erfolgen muss:
fr: Les doubles barres B<||> signifient que pour obtenir la déclaration de B<acct>(2) depuis I<E<lt>unistd.hE<gt>>, I<une> des définitions de macros doit être utilisée avant d'inclure les fichiers d'en-tête :

source: #define _BSD_SOURCE #define _XOPEN_SOURCE /* or any value E<lt> 500 */
de: #define _BSD_SOURCE #define _XOPEN_SOURCE /* oder jeder Wert E<lt> 500 */
fr: #define _BSD_SOURCE #define _XOPEN_SOURCE /* Ou toute valeur E<lt> 500 */

source: Alternatively, equivalent definitions can be included in the compilation command:
de: Alternativ können gleichwertige Definitionen in den Kompilierbefehl eingebettet werden:
fr: Autrement, des définitions équivalentes peuvent être faites lors de l'appel au compilateur :

source: cc -D_BSD_SOURCE cc -D_XOPEN_SOURCE # Or any value E<lt> 500
de: cc -D_BSD_SOURCE cc -D_XOPEN_SOURCE # Oder jeder Wert E<lt> 500
fr: cc -D_BSD_SOURCE cc -D_XOPEN_SOURCE # Ou toute valeur E<lt> 500

source: Note that, as described below, B<some feature test macros are defined by default>, so that it may not always be necessary to explicitly specify the feature test macro(s) shown in the SYNOPSIS.
de: Beachten Sie, dass B<einige Feature-Test-Makros standardmäßig definiert sind>. Daher ist es nicht immer erforderlich, die in der ÜBERSICHT angegebenen Feature-Test-Makro(s) explizit anzugeben.
fr: Veuillez noter que, comme décrit ci-dessous, B<certaines macros de test de fonctionnalités sont définies par défaut>, et il n'est donc pas toujours nécessaire de spécifier explicitement les macros indiquées dans le SYNOPSIS.

source: In a few cases, manual pages use a shorthand for expressing the feature test macro requirements (this example from B<readahead>(2)):
de: In wenigen Fällen verwenden Handbuchseiten eine Abkürzung für die Anforderungen der Feature-Test-Makros (dieses Beispiel stammt aus B<readahead>(2)):
fr: Dans certains cas, les pages de manuel utilisent des raccourcis pour exprimer la nécessité de certaines macros de test (exemple tiré de B<readahead>(2)) :

source: This format is employed in cases where only a single feature test macro can be used to expose the function declaration, and that macro is not defined by default.
de: Dieses Format wird immer dann angewendet, wenn nur ein einziges Feature-Test-Makro die Verwendung der Funktions-Deklaration ermöglicht und das Makro nicht standardmäßig definiert wird.
fr: Ce format est utilisé dans les cas où seule une macro de test de fonctionnalités peut être utilisée pour exposer la déclaration de la fonction et quand cette macro n'est pas définie par défaut.

source: Feature test macros understood by glibc
de: Von Glibc »verstandene« Feature-Test-Makros
fr: Macros de test de fonctionnalités comprises par la glibc

source: The paragraphs below explain how feature test macros are handled in glibc 2.I<x>, I<x> E<gt> 0.
de: In den Absätzen weiter unten wird erläutert, wie Feature-Test-Makros in Glibc 2.I<x>, I<x> E<gt> 0, behandelt werden.
fr: Les paragraphes suivants expliquent comment les macros de test de fonctionnalités sont gérées dans les glibc 2.I<x>, I<x> E<gt> 0.

source: First, though, a summary of a few details for the impatient:
de: Zuerst eine Zusammenfassung einiger Details für den Ungeduldigen:
fr: Tout d’abord, un aperçu de quelques détails pour l’impatient :

source: The macros that you most likely need to use in modern source code are B<_POSIX_C_SOURCE> (for definitions from various versions of POSIX.1), B<_XOPEN_SOURCE> (for definitions from various versions of SUS), B<_GNU_SOURCE> (for GNU and/or Linux specific stuff), and B<_DEFAULT_SOURCE> (to get definitions that would normally be provided by default).
de: In modernem Quellcode müssen Sie höchstwahrscheinlich B<_POSIX_C_SOURCE> (für Definitionen aus verschiedenen Versionen von POSIX.1), B<_XOPEN_SOURCE> (für Definitionen aus verschiedenen Versionen von SUS), B<_GNU_SOURCE> (für GNU- und/oder Linux-spezifischem Zeug) und B<_DEFAULT_SOURCE> (für normalerweise standardmäßig bereitgestellte Definitionen) verwenden.
fr: Les macros les plus susceptibles d’être utilisées dans des codes source modernes sont B<_POSIX_C_SOURCE> (pour des définitions de diverses versions de POSIX.1), B<_XOPEN_SOURCE> (pour des définitions de diverses versions de SUS), B<_GNU_SOURCE> (pour certaines choses spécifiques à GNU ou Linux) et B<_DEFAULT_SOURCE> (pour obtenir des définitions qui normalement devrait être fournies par défaut).

source: Certain macros are defined with default values. Thus, although one or more macros may be indicated as being required in the SYNOPSIS of a man page, it may not be necessary to define them explicitly. Full details of the defaults are given later in this man page.
de: Bestimmte Makros sind mit Vorgabewerten definiert. Daher mag es nicht notwendig sein, sie explizit zu definieren, obwohl eine oder mehrere Makros in der ÜBERSICHT einer Handbuchseite als benötigt markiert sind. Die vollständigen Details der Vorgaben sind später in dieser Handbuchseite dargestellt.
fr: Certaines macros sont définies avec des valeurs par défaut. Par conséquent, même si une ou plusieurs macros sont indiquées comme nécessaires dans le SYNOPSIS d’une page de manuel, il peut ne pas être nécessaire de les définir explicitement. Tous les détails sur les valeurs par défaut sont donnés ci-après dans cette page de manuel.

source: Defining B<_XOPEN_SOURCE> with a value of 600 or greater produces the same effects as defining B<_POSIX_C_SOURCE> with a value of 200112L or greater. Where one sees
de: Die Definition von B<_XOPEN_SOURCE> mit einem Wert von 600 oder mehr bewirkt den gleichen Effekt wie die Definition von B<_POSIX_C_SOURCE> mit einem Wert von 200112L oder größer. Hierbei kann
fr: Définir B<_XOPEN_SOURCE> avec une valeur de 600 ou plus produit le même effet que définir B<_POSIX_C_SOURCE> avec une valeur de 200112L ou supérieure. Lorsqu’apparaît

source: in the feature test macro requirements in the SYNOPSIS of a man page, it is implicit that the following has the same effect:
de: in den Feature-Test-Makro-Anforderungen in der ÜBERSICHT einer Handbuchseite ist implizit angenommen, dass das Folgende den gleichen Effekt hat:
fr: dans les nécessités des macros de test de fonctionnalités dans le SYNOPSIS d’une page de manuel, il est implicite que ce qui suit a le même effet :

source: Defining B<_XOPEN_SOURCE> with a value of 700 or greater produces the same effects as defining B<_POSIX_C_SOURCE> with a value of 200809L or greater. Where one sees
de: Die Definition von B<_XOPEN_SOURCE> mit einem Wert von 700 oder mehr bewirkt den gleichen Effekt wie die Definition von B<_POSIX_C_SOURCE> mit einem Wert von 200809L oder größer. Hierbei kann
fr: Définir B<_XOPEN_SOURCE> avec une valeur de 700 ou plus produit le même effet que définir B<_POSIX_C_SOURCE> avec une valeur de 200809L ou supérieure. Lorsqu’apparaît

source: Glibc understands the following feature test macros:
de: Die Glibc »versteht« die folgenden Feature-Test-Makros:
fr: La glibc comprend les macros de test de fonctionnalités suivantes\ :

source: ISO Standard C. This macro is implicitly defined by B<gcc>(1) when invoked with, for example, the I<-std=c99> or I<-ansi> flag.
de: ISO Standard C. Dieses Makro wird impliziert definiert, wenn B<gcc>(1) beispielsweise mit den Schaltern I<-std=c99> oder I<-ansi> aufgerufen wird.
fr: Norme C ISO. Cette macro est définie implicitement par B<gcc>(1) lors des appels avec, par exemple, l'indicateur I<-std=c99> ou I<-ansi>.

source: Defining this macro causes header files to expose definitions as follows:
de: Mit der Definition dieses Makros stellen Header-Dateien Definitionen wie folgt bereit:
fr: Si cette macro est définie, les en-têtes exposent les définitions suivantes :

source: The value 1 exposes definitions conforming to POSIX.1-1990 and ISO C (1990).
de: Der Wert 1 aktiviert Definitionen gemäß POSIX.1-1990 und ISO C (1990).
fr: La valeur 1 expose les définitions conformes à POSIX.1-1990 et C ISO (1990).

source: The value 2 or greater additionally exposes definitions for POSIX.2-1992.
de: Ein Wert gleich oder größer als 2 aktiviert zusätzlich Definitionen gemäß POSIX.2-1992.
fr: Les valeurs supérieures ou égales à 2 exposent en plus les définitions de POSIX.2-1992.

source: The value 199309L or greater additionally exposes definitions for POSIX.1b (real-time extensions).
de: Der Wert 199309L oder größer aktiviert Definitionen gemäß POSIX.1b (Echtzeiterweiterungen).
fr: Les valeurs supérieures ou égales à 199309L exposent en plus les définitions de POSIX.1b (extensions temps-réel).

source: The value 199506L or greater additionally exposes definitions for POSIX.1c (threads).
de: Der Wert 199506L oder größer aktiviert Definitionen gemäß POSIX.1c (Threads).
fr: Les valeurs supérieures ou égales à 199506L exposent en plus les définitions de POSIX.1c (threads).

source: (Since glibc 2.3.3) The value 200112L or greater additionally exposes definitions corresponding to the POSIX.1-2001 base specification (excluding the XSI extension). This value also causes C95 (since glibc 2.12) and C99 (since glibc 2.10) features to be exposed (in other words, the equivalent of defining B<_ISOC99_SOURCE>).
de: (Seit Glibc 2.3.3) Der Wert 200112L oder größer aktiviert zusätzlich Definitionen gemäß der POSIX.1-2001 Base Specification (ohne die XSI-Erweiterung). Dieser Wert führt auch zur Aktivierung von C95- (seit Glibc 2.12) und C99 (seit Glibc 2.10) Funktionalitäten (mit anderen Worten, dies ist äquivalent zur Definition von B<_ISOC99_SOURCE>).
fr: (Depuis la glibc 2.3.3) Les valeurs supérieures ou égales à 200112L exposent de plus les définitions correspondantes à la spécification de base POSIX.1-2001 (sans l'extension XSI) et activent également les fonctionnalités C95 (depuis la glibc 2.12) et C99 (depuis la glibc 2.10) — en d’autres mots, l’équivalent de définir B<_ISOC99_SOURCE>.

source: (Since glibc 2.10) The value 200809L or greater additionally exposes definitions corresponding to the POSIX.1-2008 base specification (excluding the XSI extension).
de: (Seit Glibc 2.10) Der Wert 200809L oder größer aktiviert zusätzlich Definitionen gemäß der POSIX.1-2008 Base Specification (ohne die XSI-Erweiterung).
fr: (Depuis la glibc 2.10) Les valeurs supérieures ou égales à 200809L exposent de plus les définitions correspondantes à la spécification de base POSIX.1-2008 (sans l'extension XSI).

source: Defining this obsolete macro with any value is equivalent to defining B<_POSIX_C_SOURCE> with the value 1.
de: Die Definition dieses überholten Makros mit einem beliebigen Wert hat die gleiche Wirkung wie die Definition von B<_POSIX_C_SOURCE> mit dem Wert 1.
fr: Définir cette macro obsolète (quelle que soit sa valeur) est équivalent à définir B<_POSIX_C_SOURCE> à la valeur 1.

source: Since this macro is obsolete, its usage is generally not documented when discussing feature test macro requirements in the man pages.
de: Da dieses Makro veraltet ist, ist es im Allgemeinen nicht dokumentiert, wenn Feature-Test-Makro-Anforderungen in Handbuchseiten beschrieben werden.
fr: Puisque cette macro est obsolète, son utilisation n’est généralement pas documentée lors de l’explication des nécessités de macros de test de fonctionnalités dans les pages de manuel.

source: Defining with any value exposes definitions conforming to POSIX.1, POSIX.2, and XPG4.
de: Die Zuweisung eines beliebigen Wertes aktiviert Definitionen nach POSIX.1, POSIX.2 und XPG4.
fr: Si elle est définie, quelle que soit sa valeur, les définitions de POSIX.1, POSIX.2 et XPG4 sont exposées.

source: The value 500 or greater additionally exposes definitions for SUSv2 (UNIX 98).
de: Der Wert 500 oder größer aktiviert zusätzlich die Definitionen für SUSv2 (UNIX 98).
fr: Les valeurs supérieures ou égales à 500 exposent les définitions de SUSv2 (UNIX 98).

source: (Since glibc 2.2) The value 600 or greater additionally exposes definitions for SUSv3 (UNIX 03; i.e., the POSIX.1-2001 base specification plus the XSI extension) and C99 definitions.
de: (Seit Glibc 2.2) Der Wert 600 oder größer aktiviert zusätzlich Definitionen für SUSv3 (UNIX 03, also die POSIX.1-2001 Base Specification und die XSI-Erweiterung) sowie C99-Definitionen.
fr: (Depuis la glibc 2.2) Les valeurs supérieures ou égales à 600 exposent les définitions de SUSv3 (UNIX 03, c'est-à-dire la spécification de base POSIX.1-2001 plus l'extension XSI) et de C99.

source: (Since glibc 2.10) The value 700 or greater additionally exposes definitions for SUSv4 (i.e., the POSIX.1-2008 base specification plus the XSI extension).
de: (Seit Glibc 2.10) Der Wert 700 oder größer aktiviert zusätzlich Definitionen für SUSv4 (d.h. die POSIX.1-2001 Base Specification und die XSI-Erweiterung).
fr: (Depuis la glibc 2.10) Les valeurs supérieures ou égales à 700 exposent les définitions de SUSv4 (c'est-à-dire la spécification de base POSIX.1-2008 plus l'extension XSI).

source: If B<__STRICT_ANSI__> is not defined, or B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500 I<and> neither B<_POSIX_SOURCE> nor B<_POSIX_C_SOURCE> is explicitly defined, then the following macros are implicitly defined:
de: Falls B<__STRICT_ANSI__> nicht definiert ist oder B<_XOPEN_SOURCE> mit einem Wert identisch zu oder größer als 500 I<und> weder B<_POSIX_SOURCE> noch B<_POSIX_C_SOURCE> explizit definiert sind dann werden die folgenden Makros implizit definiert:
fr: Si B<__STRICT_ANSI__> n'est pas définie, ou si B<_XOPEN_SOURCE> est définie avec une valeur supérieure ou égale à 500 I<et> que ni B<_POSIX_SOURCE> ni B<_POSIX_C_SOURCE> ne sont explicitement définies, alors les macros suivantes sont implicitement définies :

source: B<_POSIX_SOURCE> is defined with the value 1.
de: B<_POSIX_SOURCE> wird auf den Wert 1 gesetzt.
fr: B<_POSIX_SOURCE> est définie à la valeur 1.

source: B<_POSIX_C_SOURCE> is defined, according to the value of B<_XOPEN_SOURCE>:
de: B<_POSIX_C_SOURCE> wird definiert, entsprechend des Wertes von B<_XOPEN_SOURCE>:
fr: B<_POSIX_SOURCE> est définie d'après la valeur de B<_XOPEN_SOURCE> :

source: B<_POSIX_C_SOURCE> is defined with the value 2.
de: B<_POSIX_SOURCE> wird auf den Wert 2 gesetzt.
fr: B<_POSIX_C_SOURCE> est définie à la valeur 2.

source: B<_POSIX_C_SOURCE> is defined with the value 199506L.
de: B<_POSIX_SOURCE> wird auf den Wert 199506L gesetzt.
fr: B<_POSIX_C_SOURCE> est définie à la valeur 199506L.

source: B<_POSIX_C_SOURCE> is defined with the value 200112L.
de: B<_POSIX_SOURCE> wird auf den Wert 200112L gesetzt.
fr: B<_POSIX_C_SOURCE> est définie à la valeur 200112L.

source: 700 E<lt>= B<_XOPEN_SOURCE> (since glibc 2.10)
de: 700 E<lt>= B<_XOPEN_SOURCE> (seit Glibc 2.10)
fr: 700 E<lt>= B<_XOPEN_SOURCE> (depuis la glibc 2.10)

source: B<_POSIX_C_SOURCE> is defined with the value 200809L.
de: B<_POSIX_SOURCE> wird auf den Wert 200809L gesetzt.
fr: B<_POSIX_C_SOURCE> est définie à la valeur 200809L.

source: In addition, defining B<_XOPEN_SOURCE> with a value of 500 or greater produces the same effects as defining B<_XOPEN_SOURCE_EXTENDED>.
de: Zusätzlich bewirkt die Definition von B<_XOPEN_SOURCE> mit einem Wert von 500 oder mehr den gleichen Effekt wie die Definition von B<_XOPEN_SOURCE_EXTENDED>.
fr: De plus, définir B<_XOPEN_SOURCE> avec une valeur de 500 ou supérieure produit le même effet que définir B<_XOPEN_SOURCE_EXTENDED>.

source: If this macro is defined, I<and> B<_XOPEN_SOURCE> is defined, then expose definitions corresponding to the XPG4v2 (SUSv1) UNIX extensions (UNIX 95). Defining B<_XOPEN_SOURCE> with a value of 500 or more also produces the same effect as defining B<_XOPEN_SOURCE_EXTENDED>. Use of B<_XOPEN_SOURCE_EXTENDED> in new source code should be avoided.
de: Wenn dieses Makro I<und> B<_XOPEN_SOURCE> definiert sind, dann werden Definitionen entsprechend den XPG4v2- (SUSv1-)UNIX-Erweiterungen (UNIX 95) aktiviert. Wird B<_XOPEN_SOURCE> mit einem Wert von 500 oder mehr definiert, ist der Effekt identisch zur Definition von B<_XOPEN_SOURCE_EXTENDED>. Der Einsatz von B<_XOPEN_SOURCE_EXTENDED> in neuem Quellcode sollte vermieden werden.
fr: Si cette macro I<et> B<_XOPEN_SOURCE> sont définies, exposer les définitions correspondant aux extensions XPG4v2 (SUSv1) d'UNIX (UNIX 95). Définir B<_XOPEN_SOURCE> avec une valeur de 500 ou supérieure produit aussi le même effet que définir B<_XOPEN_SOURCE_EXTENDED>. L’utilisation de B<_XOPEN_SOURCE_EXTENDED> dans un nouveau code source est à éviter.

source: Since defining B<_XOPEN_SOURCE> with a value of 500 or more has the same effect as defining B<_XOPEN_SOURCE_EXTENDED>, the latter (obsolete) feature test macro is generally not described in the SYNOPSIS in man pages.
de: Da die Definition von B<_XOPEN_SOURCE> mit einem Wert von 500 oder mehr den gleichen Effekt wie die Definition von B<_XOPEN_SOURCE_EXTENDED> hat, wird das letztere (veraltete) Makro im Allgemeinen in der ÜBERSICHT in Handbuchseiten nicht beschrieben.
fr: Puisque définir B<_XOPEN_SOURCE> avec une valeur de 500 ou supérieure produit aussi le même effet que définir B<_XOPEN_SOURCE_EXTENDED>, cette dernière (obsolète) macro de test de fonctionnalités n’est généralement pas décrite dans le SYNOPSIS des pages de manuel.

source: B<_ISOC99_SOURCE> (since glibc 2.1.3)
de: B<_ISOC99_SOURCE> (seit Glibc 2.1.3)
fr: B<_ISOC99_SOURCE> (depuis la glibc 2.1.3)

source: Exposes declarations consistent with the ISO C99 standard.
de: Aktiviert Deklarationen, die mit dem ISO-C99-Standard konsistent sind.
fr: Exposer des déclarations cohérentes avec la norme ISO C99.
