Repository: sebras/manpages-l10n
Catalog: po/*/man7/feature_test_macros.7.po
Languages: de, fr

source: If B<_FORTIFY_SOURCE> is set to 1, with compiler optimization level 1 (I<gcc\ -O1>) and above, checks that shouldn't change the behavior of conforming programs are performed. With B<_FORTIFY_SOURCE> set to 2, some more checking is added, but some conforming programs might fail.
de: Ist der Wert von B<_FORTIFY_SOURCE> gleich 1 und die Compiler-Optimierungsstufe 1 (I<gcc\ -O1>) oder höher, erfolgt eine Beschränkung auf Kontrollen, die das Verhalten standardkonformer Programme nicht ändern sollten. Wird B<_FORTIFY_SOURCE> auf 2 gesetzt, werden ein paar Kontrollen hinzugefügt, die aber Fehler in einigen standardkonformen Programmen bewirken könnten.
fr: Si B<_FORTIFY_SOURCE> est défini à 1, avec un niveau 1 d'optimisation de compilateur (I<gcc\ -O1>) ou supérieur, des vérifications sans influence sur le comportement de programmes conformes sont faites. Avec B<_FORTIFY_SOURCE> défini à 2, des vérifications supplémentaires sont ajoutées, mais certains programmes conformes peuvent échouer.

source: Some of the checks can be performed at compile time (via macros logic implemented in header files), and result in compiler warnings; other checks take place at run time, and result in a run-time error if the check fails.
de: Einige der Prüfungen können bei der Kompilierung ausgeführt werden (mittels in Header-Dateien implementierter Makrologik) und führen zu Compiler-Warnungen, andere Kontrollen finden zur Laufzeit statt und führen zu einem Laufzeitfehler, wenn die Überprüfung fehlschlägt.
fr: Certaines vérifications peuvent être effectuées lors de la compilation (à l’aide d’une logique de macros implémentés dans les en-têtes) et génèrent des avertissements du compilateur. D'autres vérifications ont lieu à l'exécution et causent une erreur si le test échoue.

source: Use of this macro requires compiler support, available with B<gcc>(1) since version 4.0.
de: Die Verwendung dieses Makros benötigt die Unterstützung durch den Compiler. Diese ist in B<gcc>(1) seit Version 4.0 verfügbar.
fr: L'utilisation de cette macro nécessite une gestion par le compilateur, qui est disponible dans B<gcc>(1) depuis la version 4.0.

source: Default definitions, implicit definitions, and combining definitions
de: Standarddefinitionen, implizite Definitionen und Kombinationsdefinitionen
fr: Définitions par défaut, définitions implicites et combinaison de définitions

source: If no feature test macros are explicitly defined, then the following feature test macros are defined by default: B<_BSD_SOURCE> (in glibc 2.19 and earlier), B<_SVID_SOURCE> (in glibc 2.19 and earlier), B<_DEFAULT_SOURCE> (since glibc 2.19), B<_POSIX_SOURCE>, and B<_POSIX_C_SOURCE>=200809L (200112L in glibc versions before 2.10; 199506L in glibc versions before 2.4; 199309L in glibc versions before 2.1).
de: Ohne explizit definierte Feature-Test-Makros werden standardmäßig die folgenden Feature-Test-Makros definiert: B<_BSD_SOURCE> (bis Glibc 2.19), B<_SVID_SOURCE> (bis Glibc 2.19), B<_DEFAULT_SOURCE> (seit Glibc 2.19), B<_POSIX_SOURCE> und B<_POSIX_C_SOURCE>=200809L (200112L in Glibc-Versionen vor 2.10; 199506L in Glibc-Versionen vor 2.4; 199309L in Glibc-Versionen vor 2.1).
fr: Si aucune macro de test de fonctionnalités n'est définie explicitement, alors les macros de test suivantes sont définies par défaut : B<_BSD_SOURCE> (dans la glibc 2.19 et avant), B<_SVID_SOURCE> (dans la glibc 2.19 et avant), B<_DEFAULT_SOURCE> (depuis la glibc 2.19), B<_POSIX_SOURCE> et B<_POSIX_C_SOURCE>=200809L (200112L dans les versions de la glibc antérieures à 2.10, 199506L dans les versions de la glibc antérieures à 2.4, 199309L dans les versions de la glibc antérieures à 2.1).

source: If any of B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_ISOC11_SOURCE> (since glibc 2.18), B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> (in glibc 2.11 and earlier), B<_BSD_SOURCE> (in glibc 2.19 and earlier), or B<_SVID_SOURCE> (in glibc 2.19 and earlier) is explicitly defined, then B<_BSD_SOURCE>, B<_SVID_SOURCE>, and B<_DEFAULT_SOURCE> are not defined by default.
de: Wenn eines von B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_ISOC11_SOURCE> (seit Glibc 2.18), B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> (bis Glibc 2.11), B<_BSD_SOURCE> (bis Glibc 2.19) oder B<_SVID_SOURCE> (bis Glibc 2.19) explizit definiert ist, dann werden standardmäßig B<_BSD_SOURCE>, B<_SVID_SOURCE> und B<_DEFAULT_SOURCE> nicht definiert.
fr: Si une des macros B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_ISOC11_SOURCE> (depuis la glibc 2.18) B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> (dans la glibc 2.11 et avant), B<_BSD_SOURCE> (dans la glibc 2.19 et avant) ou B<_SVID_SOURCE> (dans la glibc 2.19 et avant) est définie explicitement, alors B<_BSD_SOURCE>, B<_SVID_SOURCE> et B<_DEFAULT_SOURCE> ne sont pas définies par défaut.

source: If B<_POSIX_SOURCE> and B<_POSIX_C_SOURCE> are not explicitly defined, and either B<__STRICT_ANSI__> is not defined or B<_XOPEN_SOURCE> is defined with a value of 500 or more, then
de: Sind B<_POSIX_SOURCE> und B<_POSIX_C_SOURCE> nicht explizit definiert und entweder B<__STRICT_ANSI__> ist nicht definiert oder B<_XOPEN_SOURCE> hat einen Wert von 500 oder mehr, dann
fr: Si ni B<_POSIX_SOURCE> ni B<_POSIX_C_SOURCE> ne sont définies explicitement et que soit B<__STRICT_ANSI__> n'est pas définie soit B<_XOPEN_SOURCE> est définie à une valeur supérieure ou égale à 500, alors

source: B<_POSIX_SOURCE> is defined with the value 1; and
de: wird B<_POSIX_SOURCE> auf den Wert 1 gesetzt und
fr: B<_POSIX_SOURCE> est définie à la valeur 1

source: B<_POSIX_C_SOURCE> is defined with one of the following values:
de: B<_POSIX_C_SOURCE> erhält einen der folgenden Werte:
fr: B<_POSIX_C_SOURCE> est définie avec une des valeurs suivantes :

source: 2, if B<_XOPEN_SOURCE> is defined with a value less than 500;
de: 2, falls B<_XOPEN_SOURCE> mit einem Wert kleiner als 500 definiert ist;
fr: 2, si B<_XOPEN_SOURCE> est définie avec une valeur inférieure à 500 ;

source: 199506L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500 and less than 600; or
de: 199506L, falls B<_XOPEN_SOURCE> mit einem Wert größer oder gleich 500 und kleiner als 600 definiert ist; oder
fr: 199506L, si B<_XOPEN_SOURCE> est définie à une valeur supérieure ou égale à 500 et inférieure à 600, ou

source: (since glibc 2.4) 200112L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 600 and less than 700.
de: (Seit Glibc 2.4) 200112L, falls B<_XOPEN_SOURCE> mit einem Wert größer oder gleich 600 und kleiner als 700 definiert ist.
fr: 200112L (depuis la glibc 2.4), si B<_XOPEN_SOURCE> est définie à une valeur supérieure ou égale à 600 et inférieure à 700 ;

source: (Since glibc 2.10) 200809L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 700.
de: (Seit Glibc 2.4) 200809L, falls B<_XOPEN_SOURCE> mit einem Wert größer oder gleich 700 definiert ist.
fr: 200809L (depuis la glibc 2.10), si B<_XOPEN_SOURCE> est définie à une valeur supérieure ou égale à 700.

source: Older versions of glibc do not know about the values 200112L and 200809L for B<_POSIX_C_SOURCE>, and the setting of this macro will depend on the glibc version.
de: Ältere Versionen von Glibc kennen die Werte 200112L und 200809L für B<_POSIX_C_SOURCE> nicht, der Wert für das Makro hängt also von der Glibc-Version ab.
fr: Les versions plus anciennes de la glibc ne connaissent pas les valeurs 200112L et 200809L pour B<_POSIX_C_SOURCE> et la configuration de cette macro dépendra de la version de la glibc.

source: If B<_XOPEN_SOURCE> is undefined, then the setting of B<_POSIX_C_SOURCE> depends on the glibc version: 199506L, in glibc versions before 2.4; 200112L, in glibc 2.4 to 2.9; and 200809L, since glibc 2.10.
de: Wenn B<_XOPEN_SOURCE> nicht definiert ist, hängt der zulässige Wert von B<_POSIX_C_SOURCE> von der Glibc-Version ab: 199506L für Glibc-Versionen vor 2.4; 200112L für Glibc 2.4 bis 2.9 und 200809L seit Glibc 2.10.
fr: Si B<_XOPEN_SOURCE> n'est pas défini, alors la configuration de B<_POSIX_C_SOURCE> dépend de la version de la glibc : 199506L pour les versions de la glibc antérieures à 2.4, 200112L pour les glibc 2.4 à 2.9 et 200809L depuis la glibc 2.10.

source: Multiple macros can be defined; the results are additive.
de: Es können mehrere Makros definiert werden, die Effekte akkumulieren sich.
fr: Plusieurs macros peuvent être définies, les résultats sont additifs.

source: CONFORMING TO
de: KONFORM ZU
fr: CONFORMITÉ

source: POSIX.1 specifies B<_POSIX_C_SOURCE>, B<_POSIX_SOURCE>, and B<_XOPEN_SOURCE>.
de: POSIX.1 legt B<_POSIX_C_SOURCE>, B<_POSIX_SOURCE> und B<_XOPEN_SOURCE> fest.
fr: POSIX.1 spécifie B<_POSIX_C_SOURCE>, B<_POSIX_SOURCE> et B<_XOPEN_SOURCE>.

source: B<_XOPEN_SOURCE_EXTENDED> was specified by XPG4v2 (aka SUSv1), but is not present in SUSv2 and later. B<_FILE_OFFSET_BITS> is not specified by any standard, but is employed on some other implementations.
de: B<_XOPEN_SOURCE_EXTENDED> wurde von XPG4v2 (auch bekannt als SUSv1) spezifiziert, ist aber seit SUSv2 vorhanden. B<_FILE_OFFSET_BITS> kommt in keinem Standard vor, wird aber auf verschiedenen anderen Implementierungen verwendet.
fr: B<_XOPEN_SOURCE_EXTENDED> était spécifiée par XPG4v2 (c’est-à-dire SUSv1), mais n’est pas présente dans SUSv2 et les versions suivantes. B<_FILE_OFFSET_BITS> n’est spécifiée par aucune norme, mais est employée dans quelques autres implémentations.

source: B<_BSD_SOURCE>, B<_SVID_SOURCE>, B<_DEFAULT_SOURCE>, B<_ATFILE_SOURCE>, B<_GNU_SOURCE>, B<_FORTIFY_SOURCE>, B<_REENTRANT>, and B<_THREAD_SAFE> are specific to Linux (glibc).
de: B<_BSD_SOURCE>, B<_SVID_SOURCE>, B<_DEFAULT_SOURCE>, B<_ATFILE_SOURCE>, B<_GNU_SOURCE>, B<_FORTIFY_SOURCE>, B<_REENTRANT> und B<_THREAD_SAFE> sind Linux-spezifisch (Glibc).
fr: B<_BSD_SOURCE>, B<_SVID_SOURCE>, B<_DEFAULT_SOURCE>, B<_ATFILE_SOURCE>, B<_GNU_SOURCE>, B<_FORTIFY_SOURCE>, B<_REENTRANT> et B<_THREAD_SAFE> sont spécifiques à Linux (glibc).

source: NOTES
de: ANMERKUNGEN

source: I<E<lt>features.hE<gt>> is a Linux/glibc-specific header file. Other systems have an analogous file, but typically with a different name. This header file is automatically included by other header files as required: it is not necessary to explicitly include it in order to employ feature test macros.
de: I<E<lt>features.hE<gt>> ist eine Linux/Glibc-spezifische Header-Datei. Andere Systeme verfügen über eine analoge Datei, die in der Regel einen anderen Namen trägt. Diese Header-Datei wird bei Bedarf automatisch durch andere Header-Dateien einbezogen: sie muss nicht explizit einbezogen werden, um Feature-Test-Makros zu verwenden.
fr: I<E<lt>features.hE<gt>> est un fichier d'en\(hytête spécifique à Linux/glibc. D'autres systèmes ont un fichier similaire, mais typiquement sous un nom différent. Ce fichier est inclus automatiquement par les autres en\(hytêtes si nécessaire\ : il n'est pas nécessaire de l'inclure explicitement pour utiliser les macros de test de fonctionnalités.

source: According to which of the above feature test macros are defined, I<E<lt>features.hE<gt>> internally defines various other macros that are checked by other glibc header files. These macros have names prefixed by two underscores (e.g., B<__USE_MISC>). Programs should I<never> define these macros directly: instead, the appropriate feature test macro(s) from the list above should be employed.
de: Je nachdem, welche der oben genannten Feature-Test-Makros definiert sind, definiert I<E<lt>features.hE<gt>> intern verschiedene weitere Makros, die von anderen Glibc-Header-Dateien überprüft werden. Die Namen dieser Makros beginnen mit zwei vorangestellten Unterstrichen (z. B. B<__USE_MISC>). Programme sollten diese Makros I<nie> direkt definieren: stattdessen sollten die passenden Feature-Test-Makro(s) aus der obigen Liste eingesetzt werden.
fr: Selon quelles macros de test de fonctionnalités ci\(hydessus sont définies, I<E<lt>features.hE<gt>> définit diverses autres macros qui sont testées par les en\(hytêtes de la glibc. Ces macros ont des noms préfixés par deux caractères de soulignement (par exemple B<__USE_MISC>). Les programmes ne doivent I<jamais> définir ces macros directement\ ; ils doivent utiliser les macros de test de fonctionnalités de la liste précédente.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: The program below can be used to explore how the various feature test macros are set depending on the glibc version and what feature test macros are explicitly set. The following shell session, on a system with glibc 2.10, shows some examples of what we would see:
de: Mit dem folgenden Programm können Sie erkunden, wie die verschiedenen Feature-Test-Makros abhängig von der Glibc-Version und welche explizit gesetzt werden. Die folgende Shell-Sitzung auf einem System mit Glibc 2.10 zeigt einige Beispiele für mögliche Ausgaben:
fr: Le programme ci-dessous peut être utilisé pour explorer comment les différentes macros de test de fonctionnalités sont configurées en fonction de la version de la glibc et quelle macros sont explicitement définies. L'exécution qui suit dans un interpréteur de commandes, sur un système avec la glibc 2.10, montre quelques exemples de ce qu'on peut voir :

source: $ B<cc ftm.c> $ B<./a.out> _POSIX_SOURCE defined _POSIX_C_SOURCE defined: 200809L _BSD_SOURCE defined _SVID_SOURCE defined _ATFILE_SOURCE defined $ B<cc -D_XOPEN_SOURCE=500 ftm.c> $ B<./a.out> _POSIX_SOURCE defined _POSIX_C_SOURCE defined: 199506L _XOPEN_SOURCE defined: 500 $ B<cc -D_GNU_SOURCE ftm.c> $ B<./a.out> _POSIX_SOURCE defined _POSIX_C_SOURCE defined: 200809L _ISOC99_SOURCE defined _XOPEN_SOURCE defined: 700 _XOPEN_SOURCE_EXTENDED defined _LARGEFILE64_SOURCE defined _BSD_SOURCE defined _SVID_SOURCE defined _ATFILE_SOURCE defined _GNU_SOURCE defined
de: $ B<cc ftm.c> $ B<./a.out> _POSIX_SOURCE definiert _POSIX_C_SOURCE definiert: 200809L _BSD_SOURCE definiert _SVID_SOURCE definiert _ATFILE_SOURCE definiert $ B<cc -D_XOPEN_SOURCE=500 ftm.c> $ B<./a.out> _POSIX_SOURCE definiert _POSIX_C_SOURCE definiert: 199506L _XOPEN_SOURCE definiert: 500 $ B<cc -D_GNU_SOURCE ftm.c> $ B<./a.out> _POSIX_SOURCE definiert _POSIX_C_SOURCE definiert: 200809L _ISOC99_SOURCE definiert _XOPEN_SOURCE definiert: 700 _XOPEN_SOURCE_EXTENDED definiert _LARGEFILE64_SOURCE definiert _BSD_SOURCE definiert _SVID_SOURCE definiert _ATFILE_SOURCE definiert _GNU_SOURCE definiert

source: Program source
de: Programmquelltext
fr: Source du programme

source: int main(int argc, char *argv[]) { #ifdef _POSIX_SOURCE printf("_POSIX_SOURCE defined\en"); #endif
de: int main(int argc, char *argv[]) { #ifdef _POSIX_SOURCE printf("_POSIX_SOURCE definiert\en"); #endif

source: #ifdef _POSIX_C_SOURCE printf("_POSIX_C_SOURCE defined: %jdL\en", (intmax_t) _POSIX_C_SOURCE); #endif
de: #ifdef _POSIX_C_SOURCE printf("_POSIX_C_SOURCE definiert: %jdL\en", (intmax_t) _POSIX_C_SOURCE); #endif

source: #ifdef _ISOC99_SOURCE printf("_ISOC99_SOURCE defined\en"); #endif
de: #ifdef _ISOC99_SOURCE printf("_ISOC99_SOURCE definiert\en"); #endif

source: #ifdef _ISOC11_SOURCE printf("_ISOC11_SOURCE defined\en"); #endif
de: #ifdef _ISOC11_SOURCE printf("_ISOC11_SOURCE definiert\en"); #endif

source: #ifdef _XOPEN_SOURCE printf("_XOPEN_SOURCE defined: %d\en", _XOPEN_SOURCE); #endif
de: #ifdef _XOPEN_SOURCE printf("_XOPEN_SOURCE definiert: %d\en", _XOPEN_SOURCE); #endif

source: #ifdef _XOPEN_SOURCE_EXTENDED printf("_XOPEN_SOURCE_EXTENDED defined\en"); #endif
de: #ifdef _XOPEN_SOURCE_EXTENDED printf("_XOPEN_SOURCE_EXTENDED definiert\en"); #endif

source: #ifdef _LARGEFILE64_SOURCE printf("_LARGEFILE64_SOURCE defined\en"); #endif
de: #ifdef _LARGEFILE64_SOURCE printf("_LARGEFILE64_SOURCE definiert\en"); #endif

source: #ifdef _FILE_OFFSET_BITS printf("_FILE_OFFSET_BITS defined: %d\en", _FILE_OFFSET_BITS); #endif
de: #ifdef _FILE_OFFSET_BITS printf("_FILE_OFFSET_BITS definiert: %d\en", _FILE_OFFSET_BITS); #endif

source: #ifdef _BSD_SOURCE printf("_BSD_SOURCE defined\en"); #endif
de: #ifdef _BSD_SOURCE printf("_BSD_SOURCE definiert\en"); #endif

source: #ifdef _SVID_SOURCE printf("_SVID_SOURCE defined\en"); #endif
de: #ifdef _SVID_SOURCE printf("_SVID_SOURCE definiert\en"); #endif

source: #ifdef _DEFAULT_SOURCE printf("_DEFAULT_SOURCE defined\en"); #endif
de: #ifdef _DEFAULT_SOURCE printf("_DEFAULT_SOURCE definiert\en"); #endif

source: #ifdef _ATFILE_SOURCE printf("_ATFILE_SOURCE defined\en"); #endif
de: #ifdef _ATFILE_SOURCE printf("_ATFILE_SOURCE definiert\en"); #endif

source: #ifdef _GNU_SOURCE printf("_GNU_SOURCE defined\en"); #endif
de: #ifdef _GNU_SOURCE printf("_GNU_SOURCE definiert\en"); #endif

source: #ifdef _REENTRANT printf("_REENTRANT defined\en"); #endif
de: #ifdef _REENTRANT printf("_REENTRANT definiert\en"); #endif

source: #ifdef _THREAD_SAFE printf("_THREAD_SAFE defined\en"); #endif
de: #ifdef _THREAD_SAFE printf("_THREAD_SAFE definiert\en"); #endif

source: #ifdef _FORTIFY_SOURCE printf("_FORTIFY_SOURCE defined\en"); #endif
de: #ifdef _FORTIFY_SOURCE printf("_FORTIFY_SOURCE definiert\en"); #endif

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: The section "Feature Test Macros" under I<info libc>.
de: Der Abschnitt »Feature Test Macros« unter I<info libc>.
fr: La section « Feature Test Macros » de I<info libc>.

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The paragraphs below explain how feature test macros are handled in Linux glibc 2.I<x>, I<x> E<gt> 0.
de: In den Absätzen weiter unten wird erläutert, wie Feature-Test-Makros in Linux-Glibc 2.I<x>, I<x>\ E<gt>\ 0, behandelt werden.
fr: Les paragraphes suivants expliquent comment les macros de test de fonctionnalités sont gérées dans les glibc 2.I<x> de Linux, I<x> E<gt> 0.

source: First, though a summary of a few details for the impatient:
de: Zuerst eine Zusammenfassung einiger Details für den Ungeduldigen:
fr: Tout d’abord, un aperçu de quelques détails pour l’impatient :

source: Linux glibc understands the following feature test macros:
de: Die Linux-Glibc »versteht« die folgenden Feature-Test-Makros:
fr: La glibc de Linux comprend les macros de test de fonctionnalités suivantes\ :

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<NOTE:> In order to be effective, a feature test macro I<must be defined before including any header files>. This can be done either in the compilation command (I<cc -DMACRO=value>) or by defining the macro within the source code before including any headers.
de: B<HINWEIS:> Um wirksam zu sein, I<muss die Definition eines Feature-Test-Makros im Quelltext vor den #include-Anweisungen für die Header-Dateien stehen>. Dies kann entweder im Kompilierbefehl (I<cc -DMACRO=value>) oder durch die Definition des Makros innerhalb des Quellcodes vor dem Einlesen aller Header erreicht werden.
fr: B<NOTE :> pour avoir un effet, une macro de test de fonctionnalités I<doit être définie avant d'inclure tout fichier d'en\(hytête>. Cela peut être accompli soit dans la ligne de commande de compilation (I<cc -DMACRO=valeur>), soit en définissant la macro dans le code source avant d'inclure tout en\(hytête.

source: This macro was historically used to expose certain functions (specifically B<fseeko>(3) and B<ftello>(3)) that address limitations of earlier APIs (B<fseek>(3) and B<ftell>(3)) that use I<long int> for file offsets. This macro is implicitly defined if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500. New programs should not employ this macro; defining B<_XOPEN_SOURCE> as just described or defining B<_FILE_OFFSET_BITS> with the value 64 is the preferred mechanism to achieve the same result.
de: Dieses Makro wurde traditionell verwandt, um bestimmte Funktionen (insbesondere B<fseeko>(3) und B<ftello>(3)) bereitzustellen, die sich um Beschränkungen älterer APIs (B<fseek>(3) und B<ftell>(3)) kümmerten, die I<long int> für Datei-Offsets verwandten. Dieses Makro ist implizit definiert, falls B<_XOPEN_SOURCE> mit einem Wert gleich oder größer als 500 definiert ist. Neue Programme sollten dieses Makro nicht einsetzen; um das gleiche Ergebnis zu erhalten, ist der empfohlene Mechanismus, B<_XOPEN_SOURCE> wie gerade beschrieben oder B<_FILE_OFFSET_BITS> mit einem Wert von 64 zu definieren.
fr: Cette macro a historiquement été utilisée pour exposer certaines fonctions (en particulier B<fseeko>(3) et B<ftello>(3)) qui contournent les limites d’interfaces de programmation précédentes (B<feek>(3) et B<ftell>(3)) qui utilisent I<long int> pour les positions de fichier. Cette macro est implicitement définie si B<_XOPEN_SOURCE> est définie avec une valeur supérieure ou égale à 500. Les nouveaux programmes ne devraient pas utiliser cette macro. Définir B<_XOPEN_SOURCE> comme cela vient d’être décrit ou définir B<_FILE_OFFSET_BITS> à la valeur 64 sont le meilleur moyen pour obtenir le même résultat.

source: If any of B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_BSD_SOURCE> (in glibc 2.19 and earlier), or B<_SVID_SOURCE> (in glibc 2.19 and earlier) is explicitly defined, then B<_BSD_SOURCE>, B<_SVID_SOURCE>, and B<_DEFAULT_SOURCE> are not defined by default.
de: Wenn eines von B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_BSD_SOURCE> (bis Glibc 2.19) oder B<_SVID_SOURCE> (bis Glibc 2.19) explizit definiert ist, dann werden standardmäßig B<_BSD_SOURCE>, B<_SVID_SOURCE> und B<_DEFAULT_SOURCE> nicht definiert.
fr: Si une des macros B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_BSD_SOURCE> (dans la glibc 2.19 et avant) ou B<_SVID_SOURCE> (dans la glibc 2.19 et avant) est définie explicitement, alors B<_BSD_SOURCE> et B<_SVID_SOURCE> ne sont pas définies par défaut.

source: EXAMPLE
de: BEISPIEL
fr: EXEMPLE

source: #ifdef _POSIX_C_SOURCE printf("_POSIX_C_SOURCE defined: %ldL\en", (long) _POSIX_C_SOURCE); #endif
de: #ifdef _POSIX_C_SOURCE printf("_POSIX_C_SOURCE definiert: %ldL\en", (long) _POSIX_C_SOURCE); #endif
