Repository: sebras/manpages-l10n
Catalog: po/*/man7/feature_test_macros.7.po
Languages: de, fr

source: Earlier glibc 2.1.x versions recognized an equivalent macro named B<_ISOC9X_SOURCE> (because the C99 standard had not then been finalized). Although the use of this macro is obsolete, glibc continues to recognize it for backward compatibility.
de: Frühere Glibc 2.1.x-Versionen verarbeiteten ein gleichwertiges Makro B<_ISOC9X_SOURCE> (weil der C99-Standard noch nicht fertig war). Obwohl die Verwendung dieses Makros obsolet ist, wird es von der Glibc weiter zwecks Abwärtskompatibilität unterstützt.
fr: Les versions antérieures de la glibc 2.1.x reconnaissaient une macro équivalente appelée B<_ISOC9X_SOURCE> (parce que la norme C99 n'était pas finalisée). Même si l'utilisation de cette dernière macro est à proscrire, la glibc continue à la reconnaître pour des raisons de compatibilité ascendante.

source: Defining B<_ISOC99_SOURCE> also exposes ISO C (1990) Amendment 1 ("C95") definitions. (The primary change in C95 was support for international character sets.)
de: Die Definition von B<_ISOC99_SOURCE> aktiviert auch ISO C (1990) Anhang 1-Definitionen (»C95«). (Die hauptsächliche Änderung in C95 war die Unterstützung für internationale Zeichensätze.)
fr: Si B<_ISOC99_SOURCE> est définie, les définitions du premier amendement au C ISO (1990) (aussi appelé C95) sont aussi exposées. La première modification de C95 était la prise en charge des jeux de caractères internationaux.

source: Invoking the C compiler with the option I<-std=c99> produces the same effects as defining this macro.
de: Der Aufruf des C-Compilers mit der Option I<-std=c99> bewirkt den gleichen Effekt wir die Definition dieses Makros.
fr: Invoquer le compilateur C avec l’option I<-std=c99> produit le même effet que définir cette macro.

source: B<_ISOC11_SOURCE> (since glibc 2.16)
de: B<_ISOC11_SOURCE> (seit Glibc 2.16)
fr: B<_ISOC11_SOURCE> (depuis la glibc 2.16)

source: Exposes declarations consistent with the ISO C11 standard. Defining this macro also enables C99 and C95 features (like B<_ISOC99_SOURCE>).
de: Aktiviert Deklarationen, die mit dem ISO-C11-Standard konsistent sind. Die Definition dieses Makros aktiviert auch C99- und C95-Funktionalitäten (wie B<_ISOC99_SOURCE>).
fr: Exposer des déclarations cohérentes avec la norme ISO C11. La définition de cette macro active également les fonctionnalités C99 et C95 (comme B<_ISOC99_SOURCE>).

source: Invoking the C compiler with the option I<-std=c11> produces the same effects as defining this macro.
de: Der Aufruf des C-Compilers mit der Option I<-std=c11> bewirkt den gleichen Effekt wie die Definition dieses Makros.
fr: Invoquer le compilateur C avec l’option I<-std=c11> produit le même effet que définir cette macro.

source: Expose definitions for the alternative API specified by the LFS (Large File Summit) as a "transitional extension" to the Single UNIX Specification. (See E<.UR http:\:/\:/opengroup.org\:/platform\:/lfs.html> E<.UE .)> The alternative API consists of a set of new objects (i.e., functions and types) whose names are suffixed with "64" (e.g., I<off64_t> versus I<off_t>, B<lseek64>() versus B<lseek>(), etc.). New programs should not employ this macro; instead I<_FILE_OFFSET_BITS=64> should be employed.
de: Aktiviert Definitionen für das durch LFS (Large File Summit) definierte alternative API als »Übergangserweiterungen« zu der »Single UNIX Specification«. (Siehe E<.UR http:\:/\:/opengroup.org\:/platform\:/lfs.html> E<.UE .)> Das alternative API besteht aus einer Reihe von neuen Objekten (d.h. Funktionen und Typen), deren Namen mit »64« endet (z. B. I<off64_t > versus I<off_t>, B<lseek64>() versus B<lseek>(), usw.). Neue Programme sollten dieses Makro nicht verwenden, sondern I<_FILE_OFFSET_BITS=64> einsetzen.
fr: Exposer les définitions pour l'API alternative définie par le LFS (« Large File Summit ») comme une extension de transition pour la « Single UNIX Specification ». Veuillez vous référer à E<.UR http:\:/\:/opengroup.org\:/platform\:/lfs.html> E<.UE .> L'API alternative consiste en un jeu de nouveaux objets (c'est-à-dire des fonctions et types) dont le nom est suffixé avec « 64 » (par exemple I<off64_t> pour I<off_t>, B<lseek64>() pour B<lseek>(), etc.). Les nouveaux programmes ne devraient pas utiliser cette macro ; à la place, I<_FILE_OFFSET_BITS=64> devrait être utilisée.

source: This macro was historically used to expose certain functions (specifically B<fseeko>(3) and B<ftello>(3)) that address limitations of earlier APIs (B<fseek>(3) and B<ftell>(3)) that use I<long> for file offsets. This macro is implicitly defined if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500. New programs should not employ this macro; defining B<_XOPEN_SOURCE> as just described or defining B<_FILE_OFFSET_BITS> with the value 64 is the preferred mechanism to achieve the same result.
de: Dieses Makro wurde traditionell verwandt, um bestimmte Funktionen (insbesondere B<fseeko>(3) und B<ftello>(3)) bereitzustellen, die sich um Beschränkungen älterer APIs (B<fseek>(3) und B<ftell>(3)) kümmerten, die I<long> für Datei-Offsets verwandten. Dieses Makro ist implizit definiert, falls B<_XOPEN_SOURCE> mit einem Wert gleich oder größer als 500 definiert ist. Neue Programme sollten dieses Makro nicht einsetzen; um das gleiche Ergebnis zu erhalten, ist der empfohlene Mechanismus, B<_XOPEN_SOURCE> wie gerade beschrieben oder B<_FILE_OFFSET_BITS> mit einem Wert von 64 zu definieren.
fr: Cette macro a historiquement été utilisée pour exposer certaines fonctions (en particulier B<fseeko>() et B<ftello>()) qui contournent les limites d’interfaces de programmation précédentes (B<feek>() et B<ftell>()) qui utilisent I<long> pour les positions de fichier. Cette macro est implicitement définie si B<_XOPEN_SOURCE> est définie avec une valeur supérieure ou égale à 500. Les nouveaux programmes ne devraient pas utiliser cette macro. Définir B<_XOPEN_SOURCE> comme cela vient d’être décrit ou définir B<_FILE_OFFSET_BITS> à la valeur 64 sont les mécanismes préférés pour obtenir le même résultat.

source: Defining this macro with the value 64 automatically converts references to 32-bit functions and data types related to file I/O and filesystem operations into references to their 64-bit counterparts. This is useful for performing I/O on large files (E<gt> 2 Gigabytes) on 32-bit systems. (Defining this macro permits correctly written programs to use large files with only a recompilation being required.)
de: Wird diesem Makro der Wert 64 zugewiesen, werden automatisch Verweise auf 32-Bit-Funktionen und -Datentypen für Datei-Ein/Ausgabe und Dateisystem-Operationen in Verweise auf ihre 64-Bit-Pendants konvertiert. Dies ist für die Ein-/Ausgabe in und aus großen Dateien (E<gt> 2 Gigabyte) auf 32-Bit-Systemen nützlich. (Mit der Definition dieses Makros können korrekt geschriebene Programme nach einer einfachen Neukompilierung große Dateien bearbeiten.)
fr: Définir cette macro à la valeur 64 convertit automatiquement les références aux fonctions et types de données 32 bits liés aux E/S sur les fichiers et aux opérations sur le système de fichiers en références à leurs équivalents 64 bits. C'est utile pour les E/S sur des gros fichiers (E<gt> 2 gigaoctets) sur les systèmes 32 bits. Cette macro permet aux programmes correctement écrits d'utiliser de gros fichiers avec seulement une recompilation.

source: 64-bit systems naturally permit file sizes greater than 2 Gigabytes, and on those systems this macro has no effect.
de: 64-Bit-Systeme erlauben natürlich Dateigrößen größer als 2 Gigabyte. Auf diesen Systemen dieses Makro hat keine Wirkung.
fr: Les systèmes 64 bits permettent d'office d'utiliser des fichiers de taille supérieure à 2 gigaoctets, et sur ces systèmes cette macro n'a aucun effet.

source: B<_BSD_SOURCE> (deprecated since glibc 2.20)
de: B<_BSD_SOURCE> (misbilligt seit Glibc 2.20)
fr: B<_BSD_SOURCE> (obsolète depuis la glibc 2.20)

source: Defining this macro with any value causes header files to expose BSD-derived definitions.
de: Mit der Definition dieses Makros mit irgend einem Wert stellen Header-Dateien BSD-abgeleitete Definitionen bereit.
fr: Si cette macro est définie avec n’importe quelle valeur, les définitions héritées de BSD sont exposées par les en-têtes.

source: In glibc versions up to and including 2.18, defining this macro also causes BSD definitions to be preferred in some situations where standards conflict, unless one or more of B<_SVID_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, or B<_GNU_SOURCE> is defined, in which case BSD definitions are disfavored. Since glibc 2.19, B<_BSD_SOURCE> no longer causes BSD definitions to be preferred in case of conflicts.
de: In Glibc bis einschließlich 2.18 bewirkte die Definition dieses Makros auch, dass BSD-Definitionen in manchen Situationen vorgezogen werden, wenn sich Standards widersprechen. Sind aber eines oder mehrere Makros aus der Gruppe B<_SVID_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> oder B<_GNU_SOURCE> definiert, werden BSD-Definitionen missachtet. Seit Glibc 2.19 führt B<_BSD_SOURCE> nicht mehr dazu, dass BSD-Definitionen im Konfliktfall bevorzugt werden.
fr: Jusqu’à la glibc 2.18 incluse, les définitions BSD sont préférées dans les situations où les normes sont en conflit, sauf si au moins une des macros B<_SVID_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> ou B<_GNU_SOURCE> est définie, auquel cas les définitions BSD sont défavorisées. Depuis la glibc 2.19, B<_BSD_SOURCE> ne force plus la préférence des définitions BSD en cas de conflit.

source: Since glibc 2.20, this macro is deprecated. It now has the same effect as defining B<_DEFAULT_SOURCE>, but generates a compile-time warning (unless B<_DEFAULT_SOURCE> is also defined). Use B<_DEFAULT_SOURCE> instead. To allow code that requires B<_BSD_SOURCE> in glibc 2.19 and earlier and B<_DEFAULT_SOURCE> in glibc 2.20 and later to compile without warnings, define I<both> B<_BSD_SOURCE> and B<_DEFAULT_SOURCE>.
de: Seit Glibc 2.20 wird dieses Makro misbilligt. Es hat jetzt den gleichen Effekt wie die Definition von B<_DEFAULT_SOURCE>, erzeugt aber eine Compiler-Warnung (außer B<_DEFAULT_SOURCE> ist auch definiert). Verwenden Sie stattdessen B<_DEFAULT_SOURCE>. Um Code zu erlauben, der bis Glibc 2.19 B<_BSD_SOURCE> und B<_DEFAULT_SOURCE> ab Glibc 2.20 benötigt, um ohne Warnung übersetzt zu werden, definieren Sie I<sowohl> B<_BSD_SOURCE> als auch B<_DEFAULT_SOURCE>.
fr: Depuis la glibc 2.20, cette macro est obsolète. Sa définition a le même effet que la définition de B<_DEFAULT_SOURCE>, mais génère un avertissement de compilation (à moins que B<_DEFAULT_SOURCE> soit également définie). Utilisez B<_DEFAULT_SOURCE> à la place. Pour permettre au code nécessitant B<_BSD_SOURCE> dans glibc 2.19 et versions antérieures, et B<_DEFAULT_SOURCE> dans glibc 2.20 et version suivantes, de compiler sans avertissement, définissez I<à la fois> B<_BSD_SOURCE> et B<_DEFAULT_SOURCE>.

source: B<_SVID_SOURCE> (deprecated since glibc 2.20)
de: B<_SVID_SOURCE> (misbilligt seit Glibc 2.20)
fr: B<_SVID_SOURCE> (obsolète depuis la glibc 2.20)

source: Defining this macro with any value causes header files to expose System V-derived definitions. (SVID == System V Interface Definition; see B<standards>(7).)
de: Die Definition dieses Makros mit einem beliebigen Wert veranlasst Header-Dateien zur Aktivierung von von System V abgeleiteten Definitionen. (SVID steht für System V Interface Definition; siehe B<standards>(7).)
fr: Si cette macro est définie (quelle que soit sa valeur), les en\(hytêtes exposent les définitions héritées de System V. (SVID == System V Interface Definition\ ; consultez B<standards>(7).)

source: Since glibc 2.20, this macro is deprecated in the same fashion as B<_BSD_SOURCE>.
de: Dieses Makro wird in der gleichen Art wie B<_BSD_SOURCE> seit Glibc 2.20 misbilligt.
fr: Depuis la glibc 2.20, cette macro est obsolète de la même manière que B<_BSD_SOURCE>.

source: B<_DEFAULT_SOURCE> (since glibc 2.19)
de: B<_DEFAULT_SOURCE> (seit Glibc 2.19)
fr: B<_DEFAULT_SOURCE> (depuis la glibc 2.19)

source: This macro can be defined to ensure that the "default" definitions are provided even when the defaults would otherwise be disabled, as happens when individual macros are explicitly defined, or the compiler is invoked in one of its "standard" modes (e.g., I<cc\ -std=c99>). Defining B<_DEFAULT_SOURCE> without defining other individual macros or invoking the compiler in one of its "standard" modes has no effect.
de: Dieses Makro kann definiert werden, um sicherzustellen, dass die »Standarddefinitionen« bereitgestellt werden, selbst wenn die Vorgaben ansonsten deaktiviert würden. Dies passiert beispielsweise, wenn individuelle Makros explizit definiert sind oder der Compiler in einem seiner »Standardmodi« aufgerufen wird (z.B. I<cc\ -std=c99>).
fr: Cette macro peut être définie pour s’assurer que les définitions par « défaut » sont fournies même si les valeurs par défaut avaient été désactivées, comme cela arrive quand les macros individuelles sont définies explicitement ou quand le compilateur est appelé dans un de ses modes « normalisés » (par exemple I<cc\ -std=c99>). Définir B<_DEFAULT_SOURCE> n'a aucun effet sans définir d'autres macros individuelles ou invoquer le compilateur dans un de ses modes « normalisés ».

source: The "default" definitions comprise those required by POSIX.1-2008 and ISO C99, as well as various definitions originally derived from BSD and System V. On glibc 2.19 and earlier, these defaults were approximately equivalent to explicitly defining the following:
de: Die »Standard«-Definition umfasst die von POSIX.1-2008 und C99 umfassten sowie verschiedene ursprünglich aus BDS und System V abgeleitete Definitionen. Bis Glibc 2.19 waren diese Standardwerte ungefähr zu der folgenden, expliziten Definition identisch:
fr: Les définitions par « défaut » incluent celles requises par POSIX.1-2008 et C99 ISO ainsi que plusieurs définitions dérivées de BSD et System V. Avec la glibc 2.19 et avant, ces définitions par défaut sont à peu près équivalentes à la définition explicite suivante :

source: B<_ATFILE_SOURCE> (since glibc 2.4)
de: B<_ATFILE_SOURCE> (seit Glibc 2.4)
fr: B<_ATFILE_SOURCE> (depuis la glibc 2.4)

source: Defining this macro with any value causes header files to expose declarations of a range of functions with the suffix "at"; see B<openat>(2). Since glibc 2.10, this macro is also implicitly defined if B<_POSIX_C_SOURCE> is defined with a value greater than or equal to 200809L.
de: Die Definition dieses Makros mit einem beliebigen Wert veranlasst Header-Dateien zur Aktivierung einer Auswahl von Funktion mit der Endung »at«, siehe B<openat>(2). Seit Glibc 2.10 wird dieses Makro auch implizit definiert, wenn B<_POSIX_C_SOURCE> mit einem Wert größer oder gleich 200809L definiert ist.
fr: Si cette macro est définie (quelle que soit sa valeur), les en-têtes exposent les définitions d'une série de fonctions avec le suffixe « at » ; consultez B<openat>(2). Depuis glibc 2.10, cette macro est aussi définie de manière implicite si B<_POSIX_C_SOURCE> est définie avec une valeur supérieure ou égale à 200809L.

source: Defining this macro (with any value) implicitly defines B<_ATFILE_SOURCE>, B<_LARGEFILE64_SOURCE>, B<_ISOC99_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE> with the value 200809L (200112L in glibc versions before 2.10; 199506L in glibc versions before 2.5; 199309L in glibc versions before 2.1) and B<_XOPEN_SOURCE> with the value 700 (600 in glibc versions before 2.10; 500 in glibc versions before 2.2). In addition, various GNU-specific extensions are also exposed.
de: Die Definition dieses Makros (mit einem beliebigen Wert) definiert implizit B<_ATFILE_SOURCE>, B<_LARGEFILE64_SOURCE>, B<_ISOC99_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE> mit dem Wert 200809L (200112L in Glibc-Versionen vor 2.10; 199506L in Glibc-Versionen vor 2.5; 199309L in Glibc-Versionen vor 2.1) und B<_XOPEN_SOURCE> mit dem Wert 700 (600 in Glibc-Versionen vor 2.10; 500 in Glibc-Versionen vor 2.2). Darüber hinaus werden verschiedene GNU-spezifische Erweiterungen aktiviert.
fr: Définir cette macro (avec n'importe quelle valeur) définit implicitement B<_ATFILE_SOURCE>, B<_LARGEFILE64_SOURCE>, B<_ISOC99_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE> avec la valeur 200809L (200112L dans les versions de la glibc antérieures à 2.10, 199506L dans les versions de la glibc antérieures à 2.5, 199309L dans les versions de la glibc antérieures à 2.1) et B<_XOPEN_SOURCE> avec la valeur 700 (600 dans les versions de la glibc antérieures à 2.10, 500 dans les versions de la glibc antérieures à 2.2). De plus, de nombreuses extensions spécifiques GNU sont exposées.

source: Since glibc 2.19, defining B<_GNU_SOURCE> also has the effect of implicitly defining B<_DEFAULT_SOURCE>. In glibc versions before 2.20, defining B<_GNU_SOURCE> also had the effect of implicitly defining B<_BSD_SOURCE> and B<_SVID_SOURCE>.
de: Seit Glibc 2.19 hat die Definition von B<_GNU_SOURCE> auch den Effekt, B<_DEFAULT_SOURCE> implizit zu definieren. In Glibc-Versionen vor 2.20 hatte die Definition von B<_GNU_SOURCE> auch den Effekt, B<_BSD_SOURCE> und B<_SVID_SOURCE> implizit zu definieren.
fr: Depuis la glibc 2.19, définir B<_GNU_SOURCE> provoque la définition implicite de B<_DEFAULT_SOURCE>. Dans les versions antérieures à 2.20, définir B<_GNU_SOURCE> provoque la définition implicite de B<_BSD_SOURCE> et B<_SVID_SOURCE>.

source: Historically, on various C libraries it was necessary to define this macro in all multithreaded code. (Some C libraries may still require this.) In glibc, this macro also exposed definitions of certain reentrant functions.
de: Historisch war es bei verschiedenen C-Bibliotheken notwendig, dieses Makro in allem Code, der multithreaded ist, zu definieren. (Einige C-Bibliotheken könnten dies noch immer benötigen). Unter Glibc legte dieses Makro auch Definitionen von bestimmten, wiedereintrittsfähigen Funktionen offen.
fr: Historiquement, dans diverses bibliothèques C il était nécessaire de définir cette macro dans tous les codes multithread (cela peut être encore nécessaire dans quelques bibliothèques C). Dans la glibc, cette macro expose aussi des définitions de certaines fonctions réentrantes.

source: However, glibc has been thread-safe by default for many years; since glibc 2.3, the only effect of defining B<_REENTRANT> has been to enable one or two of the same declarations that are also enabled by defining B<_POSIX_C_SOURCE> with a value of 199606L or greater.
de: Allerdings ist Glibc standardmäßig seit vielen Jahren Thread-sicher (seit Glibc 2.3). Der einzige Effekt der Definition von B<_REENTRANT> war, dass sie auch eine oder zwei der gleichen Deklarationen aktivierte, die auch durch die Definition von B<_POSIX_C_SOURCE> mit einem Wert von 199606L oder höher aktiviert werden.
fr: Cependant, la glibc est thread-safe par défaut depuis de nombreuses années. Depuis la glibc 2.3, le seul effet de définir B<_REENTRANT> est d’activer une ou deux des mêmes déclarations qui sont activées en définissant B<_POSIX_C_SOURCE> avec une valeur 199606L ou supérieure.

source: B<_REENTRANT> is now obsolete. In glibc 2.25 and later, defining B<_REENTRANT> is equivalent to defining B<_POSIX_C_SOURCE> with the value 199606L. If a higher POSIX conformance level is selected by any other means (such as B<_POSIX_C_SOURCE> itself, B<_XOPEN_SOURCE>, B<_DEFAULT_SOURCE>, or B<_GNU_SOURCE>), then defining B<_REENTRANT> has no effect.
de: B<_REENTRANT> ist jetzt veraltet. Seit Glibc 2.25 ist die Definition von B<_REENTRANT> äquivalent zur Definition von B<_POSIX_C_SOURCE> mit dem Wert 199606L. Falls durch eine andere Methode eine höhere Konformitätsstufe (wie B<_POSIX_C_SOURCE> selbst, B<_XOPEN_SOURCE>, B<_DEFAULT_SOURCE> oder B<_GNU_SOURCE>) ausgewählt wird, hat die Definition von B<_REENTRANT> keinen Effekt.
fr: B<_REENTRANT> est désormais obsolète. Dans la glibc 2.25 et les versions postérieures, définir B<_REENTRANT> est équivalent à définir B<_POSIX_C_SOURCE> avec comme valeur 199606L. Si un niveau de conformité POSIX supérieur est sélectionné par n’importe quel autre moyen (tel que B<_POSIX_C_SOURCE> lui-même, B<_XOPEN_SOURCE>, B<_DEFAULT_SOURCE> ou B<_GNU_SOURCE>), puis définir B<_REENTRANT> n’a aucun effet.

source: This macro is automatically defined if one compiles with I<cc\ -pthread>.
de: Dieses Makro wird automatisch definiert, falls mit I<cc\ -pthread> kompiliert wird.
fr: Cette macro est automatiquement définie si la compilation est faite avec I<cc\ -pthread>.

source: Synonym for the (deprecated) B<_REENTRANT>, provided for compatibility with some other implementations.
de: Synonym für das (veraltete) B<_REENTRANT>; wird für die Kompatibilität mit einigen anderen Implementierungen bereitgestellt.
fr: Synonyme de B<_REENTRANT> (obsolète), fourni pour la compatibilité avec d'autres implémentations.

source: B<_FORTIFY_SOURCE> (since glibc 2.3.4)
de: B<_FORTIFY_SOURCE> (seit Glibc 2.3.4)
fr: B<_FORTIFY_SOURCE> (depuis la glibc 2.3.4)

source: Defining this macro causes some lightweight checks to be performed to detect some buffer overflow errors when employing various string and memory manipulation functions (for example, B<memcpy>(3), B<memset>(3), B<stpcpy>(3), B<strcpy>(3), B<strncpy>(3), B<strcat>(3), B<strncat>(3), B<sprintf>(3), B<snprintf>(3), B<vsprintf>(3), B<vsnprintf>(3), B<gets>(3), and wide character variants thereof). For some functions, argument consistency is checked; for example, a check is made that B<open>(2) has been supplied with a I<mode> argument when the specified flags include B<O_CREAT>. Not all problems are detected, just some common cases.
de: Die Definition dieses Makros führt dazu, dass ein paar leichtgewichtige Prüfungen durchgeführt werden, um einige Pufferüberlauffehler beim Einsatz verschiedener Zeichenketten- und Speicherveränderungsfunktionen (beispielsweise bei B<memcpy>(3), B<memset>(3), B<stpcpy>(3), B<strcpy>(3), B<strncpy>(3), B<strcat>(3), B<strncat>(3), B<sprintf>(3), B<snprintf>(3), B<vsprintf>(3), B<vsnprintf>(3), B<gets>(3) und deren Weitzeichenvarianten) zu erkennen. Bei einigen Funktionen wird die Konsistenz der Argumente geprüft, beispielsweise dass bei B<open>(2) ein Argument I<mode> übergeben wurde, wenn die angegebenen Schalter B<O_CREAT> enthalten. Es werden nicht alle Probleme sondern lediglich einige häufige Fälle erkannt.
fr: Définir cette macro cause certaines vérifications peu poussées d’être réalisées pour détecter quelques dépassements de tampon lors de l’emploi de diverses chaînes et de fonctions de manipulation de mémoire (par exemple, B<memcpy>(3), B<memset>(3), B<stpcpy>(3), B<strcpy>(3), B<strncpy>(3), B<strcat>(3), B<strncat>(3), B<sprintf>(3), B<snprintf>(3), B<vsprintf>(3), B<vsnprintf>(3), B<gets>(3) et les variantes de caractères larges de celles-ci). Pour certaines fonctions, la pertinence de l’argument est vérifiée. Par exemple, une vérification est faite qu’un argument I<mode> soit fourni à B<open>(2) quand les indicateurs indiqués incluent B<O_CREAT>. Tous les problèmes ne sont pas détectés, seulement quelques cas courants.
