Repository: sebras/manpages-l10n
Catalog: po/*/man7/hostname.7.po
Languages: es, fr

source: NAME
es: NOMBRE
fr: NOM

source: hostname - hostname resolution description
es: hostname - descripción de la resolución del nombre de equipo
fr: hostname – Description de la résolution de noms

source: DESCRIPTION
es: DESCRIPCIÓN

source: Hostnames are domains, where a domain is a hierarchical, dot-separated list of subdomains; for example, the machine "monet", in the "example" subdomain of the "com" domain would be represented as "monet.example.com".
es: Los nombres de equipo son dominios. Un dominio es un lista jeráquica de subdominios separados por puntos; por ejemplo: el equipo "monet" dentro del subdominio "ejemplo" del dominio "com" se representaría como "monet.ejemplo.com".
fr: Un nom d’hôte est un domaine, où un domaine est une liste hiérarchique de sous-domaines séparés par des points. Par exemple la machine « monet », dans le sous-domaine « example » du domaine « com » est représentée par « monet.example.com ».

source: Each element of the hostname must be from 1 to 63 characters long and the entire hostname, including the dots, can be at most 253 characters long. Valid characters for hostnames are B<ASCII>(7) letters from I<a> to I<z>, the digits from I<0> to I<9>, and the hyphen (-). A hostname may not start with a hyphen.
es: Cada uno de los elementos del nombre del equipo deberá tener entre 1 y 63 caracteres y el nombre completo puede tener 253 caracteres como máximo, incluyendo los puntos. Pueden utilizarse letras del alfabeto B<ASCII>(7) de la I<a> a la I<z>, números del I<0> al I<9> y guiones (-). El nombre del equipo no puede empezar por un guión.
fr: Chaque élément du nom d’hôte doit avoir une longueur de 1 à 63 caractères et le nom d’hôte entier, y compris les points, peut se composer d’au plus 253 caractères. Les caractères autorisés pour le nom d’hôte sont les lettres B<ASCII>(7) de I<a> à I<z>, les chiffres de I<0> à I<9> et le trait d’union (-). Un nom de fichier ne peut pas commencer par un trait d’union.

source: Hostnames are often used with network client and server programs, which must generally translate the name to an address for use. (This task is generally performed by either B<getaddrinfo>(3) or the obsolete B<gethostbyname>(3).)
es: Los nombres de equipo suelen ser utilizados por clientes de red y por servidores que precisan traducir ese nombre por su correspondiente dirección para poder usarlos. Esta tarea la lleva a cabo B<getaddrinfo>(3) o el -ya obsoleto- B<gethostbyname>(3).
fr: Le nom d’hôte est souvent utilisé par un programme réseau, client ou serveur, qui doit en général traduire le nom en une adresse utilisable. Cette tâche est habituellement réalisée par B<getaddrinfo>(3) ou par la fonction obsolète B<gethostbyname>(3).

source: Hostnames are resolved by the NSS framework in glibc according to the B<hosts> configuration in B<nsswitch.conf>. The DNS-based name resolver (in the B<dns> NSS service module) resolves them in the following fashion.
es: Los nombres de equipo se resuelven mediante NSS de glibc según la configuración en B<nsswitch.conf>. El sistema de resolución basado en DNS (en el módulo B<dns> de NSS) lo hará del siguiente modo.
fr: Un nom d’hôte est résolu par le cadriciel NSS dans la glibc selon la valeur de l'entrée B<hosts> du fichier de configuration B<nsswitch.conf>. Le résolveur de nom basé sur DNS (dans le module B<dns> du service NSS) le résout de la façon suivante.

source: If the name consists of a single component, that is, contains no dot, and if the environment variable B<HOSTALIASES> is set to the name of a file, that file is searched for any string matching the input hostname. The file should consist of lines made up of two white-space separated strings, the first of which is the hostname alias, and the second of which is the complete hostname to be substituted for that alias. If a case-insensitive match is found between the hostname to be resolved and the first field of a line in the file, the substituted name is looked up with no further processing.
es: Si el nombre consta de un único componente, es decir, no contiene puntos y la variable B<HOSTALIASES> está definida con el valor del nombre de este archivo, se buscar alguna concordancia en este archivo con el nombre de equipo dado. El archivo debería constar de líneas con dos cadenas de texto separadas entre si por dos espacios siendo la primera de ellas el alias del equipo y la segunda el nombre completo por el que se sustituye al alias. Si se encuentra una concordancia sin distinguir entre mayúsculas y minúsculas entre el nombre del equipo que se quiere resolver y el primer campo de una de las líneas del archivo, se toma sin más procesamiento.
fr: Si le nom n'est constitué que d'un seul composant, c'est-à-dire qu'il ne contient pas de point, et si la variable d'environnement B<HOSTALIASES> contient le nom d'un fichier, ce dernier est parcouru à la recherche d'une chaîne correspondant au nom d'hôte. Le fichier doit être constitué de lignes composées de deux chaînes séparées par des caractères blancs, la première est l'alias du nom d'hôte et la seconde est le nom complet de l'hôte à substituer à l'alias. Si une correspondance (sans distinction de casse) est trouvée entre le nom d'hôte à résoudre et le premier champ d'une ligne, le nom de substitution est utilisé sans traitement supplémentaire.

source: If the input name ends with a trailing dot, the trailing dot is removed, and the remaining name is looked up with no further processing.
es: Si el nombre dado termina con un punto, éste se elimina y se busca la parte que queda sin más procesamiento.
fr: Si le nom d'hôte original se termine par un point, ce dernier est enlevé et le nom restant est recherché sans traitement supplémentaire.

source: If the input name does not end with a trailing dot, it is looked up by searching through a list of domains until a match is found. The default search list includes first the local domain, then its parent domains with at least 2 name components (longest first). For example, in the domain cs.example.com, the name lithium.cchem will be checked first as lithium.cchem.cs.example and then as lithium.cchem.example.com. lithium.cchem.com will not be tried, as there is only one component remaining from the local domain. The search path can be changed from the default by a system-wide configuration file (see B<resolver>(5)).
es: Si el nombre dado no termina con un punto, se buscará una concordancia en una lista de dominios. Por defecto, se buscará primero el dominio local, luego sus subdominios con al menos 2 componentes en su nombre (los más largos primero). Por ejemplo: en el dominio cs.ejemplo.com, el nombre lithium.cchem se buscará antes por lithium.cchem.cs.ejemplo.com y después por lithium.cchem.ejemplo.com. No se intentará lithium.cchem.com porque sólo tiene un componente del nombre del dominio local. Puede modificarse la ruta de búsqueda por defecto en un archivo de configuración general. Consulte B<resolver>(5).
fr: Si le nom d'entrée ne se termine pas par un point, il est recherché en parcourant une liste de domaines jusqu'à ce qu'une correspondance apparaisse. La liste de recherche par défaut inclut le domaine local, puis son domaine parent avec au moins deux composants de nom (le plus long d'abord). Par exemple, dans le domaine cs.example.com, le nom lithium.cchem sera d'abord recherché en tant que lithium.cchem.cs.example, puis comme lithium.cchem.example.com. En revanche, lithium.cchem.com ne sera pas essayé, car il ne reste qu'un seul composant du domaine local. Le chemin de recherche peut être modifié par un fichier de configuration générale pour le système (consultez B<resolver>(5)).

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI

source: Linux Programmer's Manual
es: Manual del Programador de Linux
fr: Manuel du programmeur Linux

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Hostnames are often used with network client and server programs, which must generally translate the name to an address for use. (This task is generally performed by either B<getaddrinfo>(3) or the obsolete B<gethostbyname>(3).) Hostnames are resolved by the Internet name resolver in the following fashion.
es: Los nombres de equipo suelen ser utilizados por clientes de red y por servidores que precisan traducir ese nombre por su correspondiente dirección para poder usarlos. Esta tarea la lleva a cabo B<getaddrinfo>(3) o el -ya obsoleto- B<gethostbyname>(3). Los nombres de equipo se resuelve de este modo.
fr: Le nom d’hôte est souvent utilisé par un programme réseau, client ou serveur, qui doit en général traduire le nom en une adresse utilisable. Cette tâche est habituellement réalisée par B<getaddrinfo>(3) ou par la fonction obsolète B<gethostbyname>(3). Le nom d'hôte est traduit par le résolveur de noms Internet de la façon suivante.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
