Repository: sebras/manpages-l10n
Catalog: po/*/man7/hwdb.7.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: hwdb - Hardware Database
de: hwdb - Hardware-Datenbank

source: DESCRIPTION
de: BESCHREIBUNG

source: The hardware database is a key-value store for associating modalias-like keys to udev-property-like values\&. It is used primarily by udev to add the relevant properties to matching devices, but it can also be queried directly\&.
de: Die Hardwaredatenbank ist ein Schlüssel-Wert-Speicher zur Zuordnung Modalias-artiger Schlüssel zu Udev-Eigenschaften-artigen Werten\&. Sie wird primär durch Udev zum Hinzufügen der relevanten Eigenschaften auf passende Geräte verwandt, kann aber auch direkt abgefragt werden\&.

source: HARDWARE DATABASE FILES
de: HARDWARE-DATENBANKDATEIEN

source: The hwdb files are read from the files located in the system hwdb directory /usr/lib/udev/hwdb\&.d and the local administration directory /etc/udev/hwdb\&.d\&. All hwdb files are collectively sorted and processed in lexical order, regardless of the directories in which they live\&. However, files with identical filenames replace each other\&. Files in /etc/ have the highest priority and take precedence over files with the same name in /usr/lib/\&. This can be used to override a system-supplied hwdb file with a local file if needed; a symlink in /etc/ with the same name as a hwdb file in /usr/lib/, pointing to /dev/null, disables that hwdb file entirely\&. hwdb files must have the extension \&.hwdb; other extensions are ignored\&.
de: Die hwdb-Dateien werden aus den im System-hwdb-Verzeichnis und dem lokalen Administrationsverzeichnis /usr/lib/udev/hwdb\&.d befindlichen Dateien gelesen\&. Alle hwdb-Dateien werden gemeinsam sortiert und in lexikalischer Reihenfolge, unabhängig von dem Verzeichnis, aus dem sie stammen, verarbeitet\&. Allerdings ersetzen Dateien mit gleichen Dateinamen einander\&. Dateien in /etc/ haben die höchste Priorität und haben Vorrang vor Dateien mit dem gleichen Namen in /usr/lib/\&. Dies kann bei Bedarf zum Außerkraftsetzen einer vom System bereitgestellten hwdb-Datei verwandt werden, ein auf /dev/null zeigender Symlink in /etc/ mit dem gleichen Namen wie eine hwdb-Datei in /usr/lib/ deaktiviert diese hwdb-Datei komplett\&. hwdb-Dateien müssen die Endung \&.hwdb haben, andere Endungen werden ignoriert\&.

source: Each hwdb file contains data records consisting of matches and associated key-value pairs\&. Every record in the hwdb starts with one or more match strings, specifying a shell glob to compare the lookup string against\&. Multiple match lines are specified in consecutive lines\&. Every match line is compared individually, and they are combined by OR\&. Every match line must start at the first character of the line\&.
de: Jede hwdb-Datei enthält Datensätze, die aus Treffern und zugeordneten Schlüssel-Wert-Paaren bestehen\&. Jeder Datensatz in der hwdb beginnt mit einem oder mehreren Trefferzeichenketten, die ein Shell-Glob festlegen, mit dem die Nachschlagezeichenkette verglichen wird\&. Mehrere Trefferzeilen werden in fortlaufenden Zeilen festgelegt\&. Jede Trefferzeile wird individuell verglichen und alle werden durch ODER verknüpft\&. Jede Trefferzeile muss am ersten Zeichen der Zeile beginnen\&.

source: Match patterns consist of literal characters, and shell-style wildcards:
de: Treffermuster bestehen aus echten Buchstaben und Shell-artigen Jokerzeichen:

source: Asterisk "*" matches any number of characters
de: Der Stern »*« passt auf eine beliebige Anzahl an Zeichen

source: Question mark "?" matches a single character
de: Das Fragezeichen »?« passt auf ein einzelnes Zeichen

source: Character list "[I<chars>]" matches one of the characters I<chars> listed between "[" and "]"\&. A range may be specified as with a dash as "[I<first>-I<last>]"\&. The match may be inverted with a caret "[^\&...]"\&.
de: Zeichenlisten »[I<Zeichen>]« passen auf eines der I<Zeichen>, das zwischen »[« und »]« aufgeführt ist\&. Ein Bereich kann mit einem Bindestrich als »[I<erstes>-I<letztes>]« angegeben werden\&. Ein Treffer kann mit einem Zirkumflex »[^…]« invertiert werden\&.

source: The match lines are followed by one or more key-value pair lines, which are recognized by a leading space character\&. The key name and value are separated by "="\&. An empty line signifies the end of a record\&. Lines beginning with "#" are ignored\&.
de: Den Trefferzeilen folgt eine oder mehrere Schlüssel-Wert-Paar-Zeilen, die durch das einleitende Leerzeichen erkannt werden\&. Der Schlüsselname und der Wert werden durch »=« getrennt\&. Eine leere Zeile kennzeichnet das Ende des Datensatzes\&. Mit »#« beginnende Zeilen werden ignoriert\&.

source: In case multiple records match a given lookup string, the key-value pairs from all records are combined\&. If a key is specified multiple times, the value from the record with the highest priority is used (each key can have only a single value)\&. The priority is higher when the record is in a file that sorts later lexicographically, and in case of records in the same file, later records have higher priority\&.
de: Falls mehrere Datensätze auf eine Nachschlagezeichenkette passen, werden die Schlüssel-Wert-Paare aller Datensätze zusammengefasst\&. Falls ein Schlüssel mehrfach angegeben ist, wird der Wert vom Datensatz mit der höchsten Priorität verwandt (jeder Schlüssel kann nur einen einzelnen Wert haben)\&. Die Priorität ist höher, wenn der Datensatz in einer Datei ist, die lexikographisch später einsortiert ist\&. Im Falle von Datensätzen in der gleichen Datei haben Datensätze weiter hinten höhere Priorität\&.

source: The content of all hwdb files is read by B<systemd-hwdb>(8) and compiled to a binary database located at /etc/udev/hwdb\&.bin, or alternatively /usr/lib/udev/hwdb\&.bin if you want ship the compiled database in an immutable image\&. During runtime, only the binary database is used\&.
de: Der Inhalt aller hwdb-Dateien wird durch B<systemd-hwdb>(8) eingelesen und in eine unter /etc/udev/hwdb\&.bin (oder alternativ in /usr/lib/udev/hwdb\&.bin, falls Sie eine zusammengestellte Datenbank in einem unveränderlichen Abbild ausliefern wollen) befindliche binäre Datenbank übersetzt\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&General syntax of hwdb files>
de: B<Beispiel\ \&1.\ \&Allgemeine Syntax von hwdb-Dateien>

source: # /usr/lib/udev/hwdb\&.d/example\&.hwdb # Comments can be placed before any records\&. This is a good spot # to describe what that file is used for, what kind of properties # it defines, and the ordering convention\&.
de: # /usr/lib/udev/hwdb\&.d/example\&.hwdb # Vor jeden Datensatz können Kommentare abgelegt werden\&. Dies ist # eine gute Stelle zu beschreiben, wofür die Datei verwandt wird, welche # Arten von Eigenschaften sie definiert und die Sortierkonvention\&.

source: # A record with three matches and one property mouse:*:name:*Trackball*:* mouse:*:name:*trackball*:* mouse:*:name:*TrackBall*:* ID_INPUT_TRACKBALL=1
de: # Ein Datensatz mit drei Vergleichen und einer Eigenschaft mouse:*:name:*Trackball*:* mouse:*:name:*trackball*:* mouse:*:name:*TrackBall*:* ID_INPUT_TRACKBALL=1

source: # The rule above could be also be written in a form that # matches Tb, tb, TB, tB: mouse:*:name:*[tT]rack[bB]all*:* ID_INPUT_TRACKBALL=1
de: # Die obigen Regeln könnten auch in einer Form geschrieben werden, # dass sie auf Tb, tb, TB, tB passen: mouse:*:name:*[tT]rack[bB]all*:* ID_INPUT_TRACKBALL=1

source: # A record with a single match and five properties mouse:usb:v046dp4041:name:Logitech MX Master:* MOUSE_DPI=1000@166 MOUSE_WHEEL_CLICK_ANGLE=15 MOUSE_WHEEL_CLICK_ANGLE_HORIZONTAL=26 MOUSE_WHEEL_CLICK_COUNT=24 MOUSE_WHEEL_CLICK_COUNT_HORIZONTAL=14
de: # Ein Datensatz mit einem einzelnen Vergleich und fünf Eigenschaften mouse:usb:v046dp4041:name:Logitech MX Master:* MOUSE_DPI=1000@166 MOUSE_WHEEL_CLICK_ANGLE=15 MOUSE_WHEEL_CLICK_ANGLE_HORIZONTAL=26 MOUSE_WHEEL_CLICK_COUNT=24 MOUSE_WHEEL_CLICK_COUNT_HORIZONTAL=14

source: B<Example\ \&2.\ \&Overriding of properties>
de: B<Beispiel\ \&2.\ \&Außerkraftsetzen von Eigenschaften>

source: # Match vendor name "Acer" and any product name starting with "X123" evdev:atkbd:dmi:bvn*:bvr*:bd*:svnAcer:pnX123*:* KEYBOARD_KEY_a2=wlan
de: # Passt auf den Lieferantennamen »Acer« und jeden Produktnamen, der mit »X123« beginnt evdev:atkbd:dmi:bvn*:bvr*:bd*:svnAcer:pnX123*:* KEYBOARD_KEY_a2=wlan

source: # /etc/udev/hwdb\&.d/70-keyboard\&.hwdb # disable wlan key on all at keyboards evdev:atkbd:* KEYBOARD_KEY_a2=reserved PROPERTY_WITH_SPACES=some string
de: # /etc/udev/hwdb\&.d/70-keyboard\&.hwdb # deaktiviert WLAN-Taste auf allen AT-Tastaturen evdev:atkbd:* KEYBOARD_KEY_a2=reserved EIGENSCHAFT_MIT_LEERZEICHEN=eine Zeichenkette

source: If the hwdb consists of those two files, a keyboard with the lookup string "evdev:atkbd:dmi:bvnAcer:bdXXXXX:bd08/05/2010:svnAcer:pnX123" will match all three records, and end up with the following properties:
de: Falls die hwdb aus diesen zwei Dateien besteht, wird eine Tastatur mit der Nachschlagezeichenkette »evdev:atkbd:dmi:bvnAcer:bdXXXXX:bd08/05/2010:svnAcer:pnX123« mit allen drei Datensätzen übereinstimmen und am Ende über folgende Eigenschaften verfügen:

source: KEYBOARD_KEY_a1=help KEYBOARD_KEY_a2=reserved KEYBOARD_KEY_a3=battery PROPERTY_WITH_SPACES=some string
de: KEYBOARD_KEY_a1=help KEYBOARD_KEY_a2=reserved KEYBOARD_KEY_a3=battery EIGENSCHAFT_MIT_LEERZEICHEN=eine Zeichenkette

source: SEE ALSO
de: SIEHE AUCH

source: The hwdb files are read from the files located in the system hwdb directory /lib/udev/hwdb\&.d and the local administration directory /etc/udev/hwdb\&.d\&. All hwdb files are collectively sorted and processed in lexical order, regardless of the directories in which they live\&. However, files with identical filenames replace each other\&. Files in /etc/ have the highest priority and take precedence over files with the same name in /lib/\&. This can be used to override a system-supplied hwdb file with a local file if needed; a symlink in /etc/ with the same name as a hwdb file in /lib/, pointing to /dev/null, disables that hwdb file entirely\&. hwdb files must have the extension \&.hwdb; other extensions are ignored\&.
de: Die hwdb-Dateien werden aus den im System-hwdb-Verzeichnis und dem lokalen Administrationsverzeichnis /lib/udev/hwdb\&.d befindlichen Dateien gelesen\&. Alle hwdb-Dateien werden gemeinsam sortiert und in lexikalischer Reihenfolge, unabhängig von dem Verzeichnis, aus dem sie stammen, verarbeitet\&. Allerdings ersetzen Dateien mit gleichen Dateinamen einander\&. Dateien in /etc/ haben die höchste Priorität und haben Vorrang vor Dateien mit dem gleichen Namen in /lib/\&. Dies kann bei Bedarf zum Außerkraftsetzen einer vom System bereitgestellten hwdb-Datei verwandt werden, ein auf /dev/null zeigender Symlink in /etc/ mit dem gleichen Namen wie eine hwdb-Datei in /lib/ deaktiviert diese hwdb-Datei komplett\&. hwdb-Dateien müssen die Endung \&.hwdb haben, andere Endungen werden ignoriert\&.

source: The content of all hwdb files is read by B<systemd-hwdb>(8) and compiled to a binary database located at /etc/udev/hwdb\&.bin, or alternatively /lib/udev/hwdb\&.bin if you want ship the compiled database in an immutable image\&. During runtime, only the binary database is used\&.
de: Der Inhalt aller hwdb-Dateien wird durch B<systemd-hwdb>(8) eingelesen und in eine unter /etc/udev/hwdb\&.bin (oder alternativ in /lib/udev/hwdb\&.bin, falls Sie eine zusammengestellte Datenbank in einem unveränderlichen Abbild ausliefern wollen) befindliche binäre Datenbank übersetzt\&.

source: # /lib/udev/hwdb\&.d/example\&.hwdb # Comments can be placed before any records\&. This is a good spot # to describe what that file is used for, what kind of properties # it defines, and the ordering convention\&.
de: # /lib/udev/hwdb\&.d/example\&.hwdb # Vor jeden Datensatz können Kommentare abgelegt werden\&. Dies ist # eine gute Stelle zu beschreiben, wofür die Datei verwandt wird, welche # Arten von Eigenschaften sie definiert und die Sortierkonvention\&.
