Repository: sebras/manpages-l10n
Catalog: po/*/man7/icmp.7.po
Languages: es

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: NAME
es: NOMBRE

source: icmp - Linux IPv4 ICMP kernel module.
es: icmp - Módulo IPv4 ICMP del núcleo de Linux

source: DESCRIPTION
es: DESCRIPCIÓN

source: This kernel protocol module implements the Internet Control Message Protocol defined in RFC\ 792. It is used to signal error conditions and for diagnosis. The user doesn't interact directly with this module; instead it communicates with the other protocols in the kernel and these pass the ICMP errors to the application layers. The kernel ICMP module also answers ICMP requests.
es: Este módulo de protocolo del núcleo implementa el Protocolo de Mensajes de Control de Internet (Internet Control Message Protocol, ICMP) definido en el documento RFC\ 792. Se utiliza para indicar condiciones de error y para diagnóstico. El usuario no interactúa directamente con este módulo. En vez de eso, se comunica con los otros protocolos del núcleo y éstos pasan los errores ICMP a las capas de la aplicación. El módulo ICMP del núcleo también responde a peticiones ICMP.

source: A user protocol may receive ICMP packets for all local sockets by opening a raw socket with the protocol B<IPPROTO_ICMP>. See B<raw>(7) for more information. The types of ICMP packets passed to the socket can be filtered using the B<ICMP_FILTER> socket option. ICMP packets are always processed by the kernel too, even when passed to a user socket.
es: Un protocolo de usuario puede recibir paquetes ICMP para todos los conectores locales abriendo un conector directo (raw) con el protocolo B<IPPROTO_ICMP>. Vea B<raw>(7) para más información. Los tipos de los paquetes ICMP pasados al conector se pueden filtrar usando la opción de conector B<ICMP_FILTER>. Los paquetes ICMP son también siempre procesados por el núcleo, aunque se pasen a un conector de usuario.

source: Linux limits the rate of ICMP error packets to each destination. B<ICMP_REDIRECT> and B<ICMP_DEST_UNREACH> are also limited by the destination route of the incoming packets.
es: Linux limita la tasa de paquetes de error ICMP para cada destino. B<ICMP_REDIRECT> y B<ICMP_DEST_UNREACH> también están limitados por la ruta de destino de los paquetes entrantes.

source: /proc interfaces
es: Interfaces /proc

source: ICMP supports a set of I</proc> interfaces to configure some global IP parameters. The parameters can be accessed by reading or writing files in the directory I</proc/sys/net/ipv4/>. Most of these parameters are rate limitations for specific ICMP types. Linux 2.2 uses a token bucket filter to limit ICMPs. The value is the timeout in jiffies until the token bucket filter is cleared after a burst. A jiffy is a system dependent unit, usually 10ms on i386 and about 1ms on alpha and ia64.
es: ICMP implementa una serie de interfaces I</proc> para configurar algunos parámetros IP globales. Estos parámetros son accesibles leyendo o escribiendo los ficheros del directorio B</proc/sys/net/ipv4>. La mayoría de estos parámetros son limitaciones de tasas para tipos ICMP específicos. Linux 2.2 usa un filtro de cubetas de fichas (token bucket) para limitar los ICMP. El valor es el plazo de tiempo en unidades de tiempo (jiffies) hasta que el filtro de cubetas de fichas desaparece después de una ráfaga. Un 'jiffy' es una unidad dependiente del sistema, típicamente 10ms en la arquitectura x86 y alrededor de 1ms en las arquitecturas alpha e IA64.

source: I<icmp_destunreach_rate> (Linux 2.2 to 2.4.9)
es: B<icmp_destunreach_rate> (Linux 2.2 a 2.4.9)

source: Maximum rate to send ICMP Destination Unreachable packets. This limits the rate at which packets are sent to any individual route or destination. The limit does not affect sending of B<ICMP_FRAG_NEEDED> packets needed for path MTU discovery.
es: Tasa máxima para enviar paquetes ICMP de "destino inalcanzable". Esto limita la tasa a la que se envían los paquetes a cualquier ruta o destino individual. El límite no afecta al envío de paquetes B<ICMP_FRAG_NEEDED> necesarios para descubrir la MTU de la ruta.

source: I<icmp_echo_ignore_all> (since Linux 2.2)
es: I<icmp_echo_ignore_all> (desde Linux 2.2)

source: If this value is nonzero, Linux will ignore all B<ICMP_ECHO> requests.
es: Si este valor es distinto de cero, Linux ignorará todas las peticiones B<ICMP_ECHO>.

source: I<icmp_echo_ignore_broadcasts> (since Linux 2.2)
es: I<icmp_echo_ignore_broadcasts> (desde Linux 2.2)

source: If this value is nonzero, Linux will ignore all B<ICMP_ECHO> packets sent to broadcast addresses.
es: Si este valor es distinto de cero, Linux ignorará todos los paquetes B<ICMP_ECHO> enviados a las direcciones de difusión (broadcast).

source: I<icmp_echoreply_rate> (Linux 2.2 to 2.4.9)
es: B<icmp_echoreply_rate> (Linux 2.2 hasta 2.4.9)

source: Maximum rate for sending B<ICMP_ECHOREPLY> packets in response to B<ICMP_ECHOREQUEST> packets.
es: Tasa máxima de envío de paquetes B<ICMP_ECHOREPLY> en respuesta a paquetes B<ICMP_ECHOREQUEST>.

source: I<icmp_errors_use_inbound_ifaddr> (Boolean; default: disabled; since Linux 2.6.12)
es: I<icmp_errors_use_inbound_ifaddr> (Booleano; por defecto: desactivado; a partir de Linux 2.6.12)

source: If disabled, ICMP error messages are sent with the primary address of the exiting interface.
es: Si está deshabilitado, los mensajes de error ICMP se envía con la dirección primaria de la interfaz existente.

source: If enabled, the message will be sent with the primary address of the interface that received the packet that caused the ICMP error. This is the behavior that many network administrators will expect from a router. And it can make debugging complicated network layouts much easier.
es: Si está activado, se enviará el mensaje con la dirección primaria de la interfaz que recibió el paquete causante del error ICMP. Esto es lo que esperan que haga un router la mayoría de administradores de red, ya que facilita mucho la depuración de errores en redes complejas.

source: Note that if no primary address exists for the interface selected, then the primary address of the first non-loopback interface that has one will be used regardless of this setting.
es: Observe que si la interfaz seleccionada no tiene una dirección primaria, se empleará la primera interfaz (distinta de la de loopback) que disponga de una con independencia de la configuración.

source: I<icmp_ignore_bogus_error_responses> (Boolean; default: disabled; since Linux 2.2)
es: I<icmp_ignore_bogus_error_responses> (Booleano; por defecto:desactivado; a partir de Linux 2.2)

source: Some routers violate RFC1122 by sending bogus responses to broadcast frames. Such violations are normally logged via a kernel warning. If this parameter is enabled, the kernel will not give such warnings, which will avoid log file clutter.
es: Algunos routers incumplen el RFC 1122 al responder a mensajes erróneos enviados a direcciones de difusión (broadcast). Estos incumplimientos suelen quedar registrados en los avisos del núcleo. Si se activa este parámetro, el núcleo no los registrará evitando en mucho casos que se llenen en exceso los archivos de registro.

source: I<icmp_paramprob_rate> (Linux 2.2 to 2.4.9)
es: B<icmp_paramprob_rate> (Linux 2.2 hasta 2.4.9)

source: Maximum rate for sending B<ICMP_PARAMETERPROB> packets. These packets are sent when a packet arrives with an invalid IP header.
es: Tasa máxima de envío de paquetes B<ICMP_PARAMETERPROB>. Estos paquetes se envían cuando un paquete llega con una cabecera IP inválida.

source: I<icmp_ratelimit> (integer; default: 1000; since Linux 2.4.10)
es: I<icmp_ratelimit> (número entero; por defecto: 1000; a partir de Linux 2.4.10)

source: Limit the maximum rates for sending ICMP packets whose type matches I<icmp_ratemask> (see below) to specific targets. 0 to disable any limiting, otherwise the minimum space between responses in milliseconds.
es: Limita el ritmo de envío de paquetes ICMP cuyo tipo coincidan con I<icmp_ratemask> (vea más adelante). Su valor representa el tiempo mínimo entre respuestas medido en milisegundos, el valor '0' descativará este límite.

source: I<icmp_ratemask> (integer; default: see below; since Linux 2.4.10)
es: I<icmp_ratemask> (entero; por defecto: vea más adelante; a partir de Linux 2.4.10)

source: Mask made of ICMP types for which rates are being limited.
es: Máscara creada a partir de los tipos ICMP a los cuales se les aplica un límite en su ratio.

source: Significant bits: IHGFEDCBA9876543210
es: Bits significativos: IHGFEDCBA9876543210

source: Default mask: 0000001100000011000 (0x1818)
es: Máscara por defecto: 0000001100000011000 (0x1818)

source: Bit definitions (see the Linux kernel source file I<include/linux/icmp.h>):
es: Definiciones de bits (consulte el archivo de encabezado del núcleo I<include/linux/icmp.h>):

source: 0 Echo Reply
es: 0 Repuesta Eco

source: 3 Destination Unreachable *
es: 3 Destino Inalcanzable *

source: 4 Source Quench *
es: 4 Ralentiza la Transmisión *

source: 5 Redirect
es: 5 Redirección

source: 8 Echo Request
es: 8 Solicitud de eco

source: B Time Exceeded *
es: Tiempo excedido *

source: C Parameter Problem *
es: C Problemas en parámetros *

source: D Timestamp Request
es: D Solicitud de marca temporal

source: E Timestamp Reply
es: E Respuesta a la solicitud de marca temporal

source: F Info Request
es: F Petición de información

source: G Info Reply
es: G Respuesta a la petición de información

source: H Address Mask Request
es: H Solicitud de máscara de red

source: I Address Mask Reply
es: I Respuesta a la solicitud de máscara de red

source: The bits marked with an asterisk are rate limited by default (see the default mask above).
es: Los bits señalados con un asterisco tienen limitada la tasa de envío por defecto. Vea la máscara por defecto descrita anteriormente.

source: I<icmp_timeexceed_rate> (Linux 2.2 to 2.4.9)
es: B<icmp_timeexceed_rate> (Linux 2.2 hasta 2.4.9)

source: Maximum rate for sending B<ICMP_TIME_EXCEEDED> packets. These packets are sent to prevent loops when a packet has crossed too many hops.
es: Tasa máxima de envío de paquetes B<ICMP_TIME_EXCEEDED>. Estos paquetes se envían para evitar ciclos cuando un paquete ha dado demasiados saltos.

source: I<ping_group_range> (two integers; default: see below; since Linux 2.6.39)
es: I<ping_group_range> (dos enteros; por defecto: vea más adelante; a partir de Linux 2.6.39)

source: Range of the group IDs (minimum and maximum group IDs, inclusive) that are allowed to create ICMP Echo sockets. The default is "1 0", which means no group is allowed to create ICMP Echo sockets.
es: Intervalo de ID de grupo (ambos inclusive) que pueden crear conectores ICMP Eco. Por defecto sería "1 0" es decir, que ningún grupo puede crearlos.

source: VERSIONS
es: VERSIONES

source: Support for the B<ICMP_ADDRESS> request was removed in 2.2.
es: El soporte para peticiones B<ICMP_ADDRESS> se eliminó en la versión 2.2.

source: Support for B<ICMP_SOURCE_QUENCH> was removed in Linux 2.2.
es: El soporte para B<ICMP_SOURCE_QUENCH> se eliminó en la versión 2.2.

source: NOTES
es: NOTAS

source: As many other implementations don't support B<IPPROTO_ICMP> raw sockets, this feature should not be relied on in portable programs.
es: Ya que muchas implementaciones no soportan conectores directos (raw) B<IPPROTO_ICMP>, no debería contarse con esta característica en programas transportables.

source: B<ICMP_REDIRECT> packets are not sent when Linux is not acting as a router. They are also accepted only from the old gateway defined in the routing table and the redirect routes are expired after some time.
es: No se envían paquetes B<ICMP_REDIRECT> cuando Linux no actúa como enrutador (router). También, estos sólo son aceptados cuando procesden de la pasarela (gateway) anterior definida en la tabla de enrutamiento y las rutas de redirección expiran después de un cierto tiempo.

source: The 64-bit timestamp returned by B<ICMP_TIMESTAMP> is in milliseconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
es: La marca de tiempo de 64 bits devuelta por B<ICMP_TIMESTAMP> viene dada en milisegundos desde el Inicio de Unix, es decir 01-01-1970 00:00:00 +0000 (UTC).

source: Linux ICMP internally uses a raw socket to send ICMPs. This raw socket may appear in B<netstat>(8) output with a zero inode.
es: El ICMP de Linux usa internamente un conector directo para enviar ICMPs. Este conector directo puede aparecer en la salida de B<netstat>(8) con un nodo-i cero.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: RFC\ 792 for a description of the ICMP protocol.
es: RFC\ 792 para una descripción del protocolo ICMP.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
