Repository: sebras/manpages-l10n
Catalog: po/*/man7/ipc_namespaces.7.po
Languages: es

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: NAME
es: NOMBRE

source: ipc_namespaces - overview of Linux IPC namespaces
es: ipc_namespaces - visión general de los nombres de espacio IPC de Linux

source: DESCRIPTION
es: DESCRIPCIÓN

source: IPC namespaces isolate certain IPC resources, namely, System V IPC objects (see B<sysvipc>(7)) and (since Linux 2.6.30) POSIX message queues (see B<mq_overview>(7)). The common characteristic of these IPC mechanisms is that IPC objects are identified by mechanisms other than filesystem pathnames.
es: Los nombres de espacio IPC aislan determinados recursos. Concretamente los objetos IPC de System V (consulte B<sysipc>(7)) y, a partir de la versión 2.6.30 del núcleo de Linux, también las colas de mensajes de POSIX (consulte B<mq_overview>(7)). La característica común de estos mecanismos IPC reside en que los objetos IPC se identifican mediante mecanismos en lugar de hacerlo mediante rutas del sistema de archivo.

source: Each IPC namespace has its own set of System V IPC identifiers and its own POSIX message queue filesystem. Objects created in an IPC namespace are visible to all other processes that are members of that namespace, but are not visible to processes in other IPC namespaces.
es: Cada espacio de nombres IPC incluye su propio conjunto de identificadores IP de System V y su propio sistema de archivo de colas de mensajes POSIX. Los objetos creados en un nombre de espacio IPC son visibles para todos los demás procesos miembros de este espacio de nombres pero no para los miembros de otros nombres de espacio IPC.

source: The following I</proc> interfaces are distinct in each IPC namespace:
es: Estas interfaces I</proc> difieren en cada espacio de nombres IPC:

source: The POSIX message queue interfaces in I</proc/sys/fs/mqueue>.
es: Interfaces de cola de mensajes POSIX en I</proc/sys/fs/mqueue>.

source: The System V IPC interfaces in I</proc/sys/kernel>, namely: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni>, and I<shm_rmid_forced>.
es: Interfaces IPC de System V en I</proc/sys/kernel>, concretamente: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni> y I<shm_rmid_forced>.

source: The System V IPC interfaces in I</proc/sysvipc>.
es: Interfaces IPC de System V en I</proc/sysvipc>.

source: When an IPC namespace is destroyed (i.e., when the last process that is a member of the namespace terminates), all IPC objects in the namespace are automatically destroyed.
es: Cuando se detruye un nombre de espacio IPC, esto es cuando finaliza el último proceso miembro de dicho espacio de nombres IPC, todos los objetos de ese espacio de nombres son detruidos automáticamente.

source: Use of IPC namespaces requires a kernel that is configured with the B<CONFIG_IPC_NS> option.
es: Para emplear nombres de espacio IPC, es necesario que el núcleo haya sido configurado con la opción B<CONFIG_IPC_NS>.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
