Repository: sebras/manpages-l10n
Catalog: po/*/man7/ipv6.7.po
Languages: es

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: NAME
es: NOMBRE

source: ipv6 - Linux IPv6 protocol implementation
es: ipv6 - Implementación Linux del protocolo IPv6

source: SYNOPSIS
es: SINOPSIS

source: I<tcp6_socket>B< = socket(AF_INET6, SOCK_STREAM, 0);> I<raw6_socket>B< = socket(AF_INET6, SOCK_RAW, >I<protocol>B<);> I<udp6_socket>B< = socket(AF_INET6, SOCK_DGRAM, >I<protocol>B<);>
es: I<tcp6_socket>B< = socket(AF_INET6, SOCK_STREAM, 0);> I<raw6_socket>B< = socket(AF_INET6, SOCK_RAW, >I<protocolo>B<);> I<udp6_socket>B< = socket(AF_INET6, SOCK_DGRAM, >I<protocolo>B<);>

source: DESCRIPTION
es: DESCRIPCIÓN

source: Linux 2.2 optionally implements the Internet Protocol, version 6. This man page contains a description of the IPv6 basic API as implemented by the Linux kernel and glibc 2.1. The interface is based on the BSD sockets interface; see B<socket>(7).
es: La versión 2.2 de Linux implementa opcionalmente el Protocolo de Internet, versión 6. Esta página de manual contiene una descripción de la API básica IPv6 tal como la implementa el núcleo de Linux y glibc 2.1. La interfaz está basada en la interfaz de conectores (sockets) BSD; véase B<socket>(7).

source: The IPv6 API aims to be mostly compatible with the IPv4 API (see B<ip>(7)). Only differences are described in this man page.
es: La API IPv6 pretende ser sobre todo compatible con la API IPv4 (consulte B<ip>(7)). En esta página de manual sólo se describen las diferencias.

source: To bind an B<AF_INET6> socket to any process, the local address should be copied from the I<in6addr_any> variable which has I<in6_addr> type. In static initializations, B<IN6ADDR_ANY_INIT> may also be used, which expands to a constant expression. Both of them are in network byte order.
es: Para enlazar un conector B<AF_INET6> a cualquier proceso debe copiarse la dirección local de la variable I<in6addr_any> cuyo tipo es I<in6_addr>. En inicializaciones estáticas puede utilizarse también B<IN6ADDR_ANY_INIT>, la cual se expande a una expresión constante. Ambas están en el orden de bytes de la red.

source: The IPv6 loopback address (::1) is available in the global I<in6addr_loopback> variable. For initializations, B<IN6ADDR_LOOPBACK_INIT> should be used.
es: La dirección de loopback IPv6 (::1) está disponible en la variable global I<in6addr_loopback>. Se debe utilizar B<IN6ADDR_LOOPBACK_INIT> para la inicialización.

source: IPv4 connections can be handled with the v6 API by using the v4-mapped-on-v6 address type; thus a program needs to support only this API type to support both protocols. This is handled transparently by the address handling functions in the C library.
es: Las conexiones IPv4 pueden ser manejadas con la API v6 usando el tipo de dirección v4-mapeada-a-v6; así un programa solamente necesita tener soporte para este tipo de API para gestionar ambos protocolos. Esto se gestiona de forma transparente por las funciones de direcciones de libc.

source: Address format
es: Formato de las direcciones

source: struct sockaddr_in6 { sa_family_t sin6_family; /* AF_INET6 */ in_port_t sin6_port; /* port number */ uint32_t sin6_flowinfo; /* IPv6 flow information */ struct in6_addr sin6_addr; /* IPv6 address */ uint32_t sin6_scope_id; /* Scope ID (new in 2.4) */ };
es: struct sockaddr_in6 { sa_family_t sin6_family; /* AF_INET6 */ in_port_t sin6_port; /* número de puerto */ uint32_t sin6_flowinfo; /* Información de flujo IPv6 */ struct in6_addr sin6_addr; /* dirección IPv6 */ uint32_t sin6_scope_id; /* identificador de ámbito (nuevo en 2.4) */ };

source: struct in6_addr { unsigned char s6_addr[16]; /* IPv6 address */ };
es: struct in6_addr { unsigned char s6_addr[16]; /* dirección IPv6 */ };

source: I<sin6_family> is always set to B<AF_INET6>; I<sin6_port> is the protocol port (see I<sin_port> in B<ip>(7)); I<sin6_flowinfo> is the IPv6 flow identifier; I<sin6_addr> is the 128-bit IPv6 address. I<sin6_scope_id> is an ID depending on the scope of the address. It is new in Linux 2.4. Linux supports it only for link-local addresses, in that case I<sin6_scope_id> contains the interface index (see B<netdevice>(7))
es: B<sin6_family> siempre contiene el valor B<AF_INET6>; B<sin6_port> es el puerto del protocolo (véase B<sin_port> en B<ip>(7)); B<sin6_flowinfo> es el identificador de flujo IPv6; B<sin6_addr> es la dirección IPv6 de 128 bits. B<sin6_scope_id> es un identificador que depende del ámbito de la dirección. Esto es nuevo en Linux 2.4. Linux sólo tiene soporte para direcciones del nivel de enlace, en cuyo caso I<sin6_scope_id> contiene el índice de la interfaz (vea B<netdevice>(7))

source: IPv6 supports several address types: unicast to address a single host, multicast to address a group of hosts, anycast to address the nearest member of a group of hosts (not implemented in Linux), IPv4-on-IPv6 to address an IPv4 host, and other reserved address types.
es: IPv6 soporta varios tipos de dirección: unidestino para referirse a un host individual, multidestino para referirse a un grupo de hosts, "cualquier destino" para referirse al miembro más cercano de un grupo de hosts (no implementado en Linux), IPv4-sobre-IPv6 para refererise a un host IPv4, y otros tipos de dirección reservados.

source: The address notation for IPv6 is a group of 8 4-digit hexadecimal numbers, separated with a \(aq:\(aq. \&"::" stands for a string of 0 bits. Special addresses are ::1 for loopback and ::FFFF:E<lt>IPv4 addressE<gt> for IPv4-mapped-on-IPv6.
es: La notación para direcciones IPv6 consiste en un grupo de 8 números hexadecimales de 4 dígitos, separados por \(aq:\(aq. \&"::" representa una cadena de 0 bits. Direcciones especiales son ::1 para I<loopback> y ::FFFF:E<lt>dirección IPv4E<gt> para IPv4-mapeada-a-IPv6.

source: The port space of IPv6 is shared with IPv4.
es: El espacio de puertos de IPv6 es compartido con IPv4.

source: Socket options
es: Opciones de los conectores

source: IPv6 supports some protocol-specific socket options that can be set with B<setsockopt>(2) and read with B<getsockopt>(2). The socket option level for IPv6 is B<IPPROTO_IPV6>. A boolean integer flag is zero when it is false, otherwise true.
es: IPv6 soporta algunas opciones de conectores específicas del protocolo que pueden ser activadas con B<setsockopt>(2) y leídas con B<getsockopt>(2). El nivel de opciones de conectores para IPv6 es B<IPPROTO_IPV6>. Una bandera entera booleana es cero cuando es falsa, en otro caso es verdadera.

source: Turn an B<AF_INET6> socket into a socket of a different address family. Only B<AF_INET> is currently supported for that. It is allowed only for IPv6 sockets that are connected and bound to a v4-mapped-on-v6 address. The argument is a pointer to an integer containing B<AF_INET>. This is useful to pass v4-mapped sockets as file descriptors to programs that don't know how to deal with the IPv6 API.
es: Convierte un conector B<AF_INET6> en un conector de una familia de direcciones diferente. Actualmente, solamente se soporta B<AF_INET>. Sólo está permitido para conectores IPv6 que estén conectados y enlazados a una dirección v4-mapeada-a-v6. El argumento es un puntero a un entero que contiene el valor B<AF_INET>. Esto es útil para pasar conectores v4-mapeados como descriptores de archivo a los programas que no saben comunicarse con la API IPv6.

source: Control membership in multicast groups. Argument is a pointer to a I<struct ipv6_mreq>.
es: Controla la pertenencia en grupos multicast. El argumento es un puntero a una estructura B<struct ipv6_mreq>.

source: B<getsockopt>(): Retrieve the current known path MTU of the current socket. Valid only when the socket has been connected. Returns an integer.
es: B<getsockopt>(): obtiene la actual ruta MTU del conector. Sólo es válido una vez se ha conectado. Es un número entero.

source: B<setsockopt>(): Set the MTU to be used for the socket. The MTU is limited by the device MTU or the path MTU when path MTU discovery is enabled. Argument is a pointer to integer.
es: B<setsockopt>(): Establece la MTU a usar para el conector. La MTU está limitada por la MTU de dispositivo o la MTU de la ruta cuando se ha activado el descubrimiento de la MTU de la ruta. El argumento es un puntero a un entero.

source: Control path-MTU discovery on the socket. See B<IP_MTU_DISCOVER> in B<ip>(7) for details.
es: Controla el descubrimiento de la MTU de la ruta en el conector. Vea B<IP_MTU_DISCOVER> en B<ip>(7) para más detalles.

source: Set the multicast hop limit for the socket. Argument is a pointer to an integer. -1 in the value means use the route default, otherwise it should be between 0 and 255.
es: Establece el límite de saltos multidestino para el conector. El argumento es un puntero a un entero. Un valor de -1 implica usar la ruta por defecto, en otro caso debe estar entre 0 y 255.

source: Set the device for outgoing multicast packets on the socket. This is allowed only for B<SOCK_DGRAM> and B<SOCK_RAW> socket. The argument is a pointer to an interface index (see B<netdevice>(7)) in an integer.
es: Establece el dispositivo para los paquetes multidestino de salida del conector. Sólo se permite para conectores B<SOCK_DGRAM> y B<SOCK_RAW>. El argumento es un puntero a un índice de interfaz (vea B<netdevice>(7)) representado como un número entero.

source: Control whether the socket sees multicast packets that it has send itself. Argument is a pointer to boolean.
es: Controla si el conector ve o no los paquetes multidestino que se ha enviado a sí mismo. El argumento es un puntero a un booleano.

source: B<IPV6_RECVPKTINFO> (since Linux 2.6.14)
es: B<IPV6_RECVPKTINFO> (desde Linux 2.6.14)

source: Set delivery of the B<IPV6_PKTINFO> control message on incoming datagrams. Such control messages contain a I<struct in6_pktinfo>, as per RFC 3542. Allowed only for B<SOCK_DGRAM> or B<SOCK_RAW> sockets. Argument is a pointer to a boolean value in an integer.
es: Activa la entrega del mensaje de control B<IPV6_PKTINFO> para los datagramas de entrada. En cumplimiento del RFC 3542, estos mensajes contienen una I<struct in6_pktinfo>. Sólo es válida para conectores B<SOCK_DGRAM> y B<SOCK_RAW>. El argumento es un puntero a un valor booleano dado como un número entero.

source: Set delivery of control messages for incoming datagrams containing extension headers from the received packet. B<IPV6_RTHDR> delivers the routing header, B<IPV6_AUTHHDR> delivers the authentication header, B<IPV6_DSTOPTS> delivers the destination options, B<IPV6_HOPOPTS> delivers the hop options, B<IPV6_FLOWINFO> delivers an integer containing the flow ID, B<IPV6_HOPLIMIT> delivers an integer containing the hop count of the packet. The control messages have the same type as the socket option. All these header options can also be set for outgoing packets by putting the appropriate control message into the control buffer of B<sendmsg>(2). Allowed only for B<SOCK_DGRAM> or B<SOCK_RAW> sockets. Argument is a pointer to a boolean value.
es: Activa la entrega de mensajes de control para los datagramas de entrada que contienen cabeceras de extensión procedentes del paquete recibido. B<IPV6_RTHDR> entrega la cabecera de enrutamiento, B<IPV6_AUTHHDR> entrega la cabecera de autenticación, B<IPV6_DSTOPTS> entrega las opciones de destino, B<IPV6_HOPOPTS> entrega las opciones de salto, B<IPV6_FLOWINFO> entrega un entero que contiene el identificador del flujo, B<IPV6_HOPLIMIT> entrega un entero que contiene el contador de saltos del paquete. Los mensajes de control tienen el mismo tipo que la opción de conector. Todas estas opciones de cabecera también se pueden activar para los paquetes de salida poniendo el mensaje de control apropiado en el buffer de control de B<sendmsg>(2). Esto es válido sólo para conectores B<SOCK_DGRAM> y B<SOCK_RAW>. El argumento es un puntero a un valor booleano.

source: Control receiving of asynchronous error options. See B<IP_RECVERR> in B<ip>(7) for details. Argument is a pointer to boolean.
es: Controla la recepción de opciones de error asíncronas. Vea B<IP_RECVERR> en B<ip>(7) para más detalles. El argumento es un puntero a un booleano.

source: Pass forwarded packets containing a router alert hop-by-hop option to this socket. Allowed only for B<SOCK_RAW> sockets. The tapped packets are not forwarded by the kernel, it is the user's responsibility to send them out again. Argument is a pointer to an integer. A positive integer indicates a router alert option value to intercept. Packets carrying a router alert option with a value field containing this integer will be delivered to the socket. A negative integer disables delivery of packets with router alert options to this socket.
es: Pasa paquetes reenviados y que contiene una alerta 'hop-by-hop' (que tiene que ser revisada por cada nodo por los que para el paquete) para ese conector. Sólo se permite en conectores B<SOCK_RAW>. Estos paquetes no son reenviados por el núcleo sino que correponde al usuario la responsabilidad de enviarlos. El argumento es un puntero a un número entero. Un número positivo indicará una alerta de router para interceptar el paquete y se entregará al conector. Un número negativo desactivará la entrega al conector.

source: Set the unicast hop limit for the socket. Argument is a pointer to an integer. -1 in the value means use the route default, otherwise it should be between 0 and 255.
es: Establece el límite de saltos unidestino para el conector. El argumento es un puntero a un entero. Un valor de -1 implica usar la ruta por defecto, en otro caso debe estar entre 0 y 255.

source: B<IPV6_V6ONLY> (since Linux 2.4.21 and 2.6)
es: B<IPV6_V6ONLY> (desde Linux 2.4.21 y 2.6)

source: If this flag is set to true (nonzero), then the socket is restricted to sending and receiving IPv6 packets only. In this case, an IPv4 and an IPv6 application can bind to a single port at the same time.
es: Si esta opción está como 'true' (distinto de cero), el conector sólo podrá enviar y recibir paquetes Ipv6. En éste caso, puede conectarse al mismo puerto una aplicación Ipv4 y una Ipv6 al mismo tiempo.

source: If this flag is set to false (zero), then the socket can be used to send and receive packets to and from an IPv6 address or an IPv4-mapped IPv6 address.
es: Si esta opción está como 'false' (cero), el conector podrá usarse para enviar paquetes entre direcciones Ipv6 y/o direcciones IPv6 mapeadas como IPv4.

source: The argument is a pointer to a boolean value in an integer.
es: El argumento es un puntero a un valor booleano como un entero.

source: The default value for this flag is defined by the contents of the file I</proc/sys/net/ipv6/bindv6only>. The default value for that file is 0 (false).
es: El valor por defecto de esta opción viene definida en el archivo I</proc/sys/net//ipv6/bindv6only> siendo '0' por defecto.

source: ERRORS
es: ERRORES

source: The user tried to B<bind>(2) to a link-local IPv6 address, but the I<sin6_scope_id> in the supplied I<sockaddr_in6> structure is not a valid interface index.
es: El intentó conectarse (con B<bind>(2)) a una dirección local IPv6, pero I<sin6_scope_id> en la estructura I<sockaddr_in6> proporcionada no es un índice de interfaz válido.

source: VERSIONS
es: VERSIONES

source: Linux 2.4 will break binary compatibility for the I<sockaddr_in6> for 64-bit hosts by changing the alignment of I<in6_addr> and adding an additional I<sin6_scope_id> field. The kernel interfaces stay compatible, but a program including I<sockaddr_in6> or I<in6_addr> into other structures may not be. This is not a problem for 32-bit hosts like i386.
es: Linux 2.4 rompe la compatibilidad binaria para I<sockaddr_in6> en hosts de 64bit al cambiar la alineación de I<in6_addr> y al añadir un campo I<sin6_scope_id> adicional. Las interfaces del núcleo siguen siendo compatibles, pero un programa que incluya I<sockaddr_in6> o I<in6_addr> en otras estructuras puede no serlo. Esto no es un problema para hosts de 32bits como i386.

source: The I<sin6_flowinfo> field is new in Linux 2.4. It is transparently passed/read by the kernel when the passed address length contains it. Some programs that pass a longer address buffer and then check the outgoing address length may break.
es: El campo I<sin6_flowinfo> es nuevo en la versión 2.4 de Linux. El núcleo lo pasa/lee transparentemente cuando la longitud de la dirección pasada lo contiene. Algunos programas que pasan un buffer de dirección mayor y comprueban después la longitud de la dirección de salida pueden fallar.

source: NOTES
es: NOTAS

source: The I<sockaddr_in6> structure is bigger than the generic I<sockaddr>. Programs that assume that all address types can be stored safely in a I<struct sockaddr> need to be changed to use I<struct sockaddr_storage> for that instead.
es: La estructura I<sockaddr_in6> es mayor que la genérica I<sockaddr>. Los programas que asumen que todos los tipos de dirección se pueden almacenar de manera segura en una I<struct sockaddr> necesitan cambiarse para usar en su lugar I<struct sockaddr_storage>.

source: B<SOL_IP>, B<SOL_IPV6>, B<SOL_ICMPV6>, and other B<SOL_*> socket options are nonportable variants of B<IPPROTO_*>. See also B<ip>(7).
es: B<SOL_IP>, B<SOL_IPV6>, B<SOL_ICMPV6> y otras opciones de conector de la forma B<SOL_*> son variantes no portables de B<IPPROTO_*>. Consulte B<ip>(7).

source: BUGS
es: ERRORES

source: The IPv6 extended API as in RFC\ 2292 is currently only partly implemented; although the 2.2 kernel has near complete support for receiving options, the macros for generating IPv6 options are missing in glibc 2.1.
es: Actualmente, la API IPv6 extendida, tal y como se describe en RFC\ 2292, sólo está parcialmente implementada; aunque el núcleo 2.2 soporta casi por completo las opciones de recepción, no existen macros en la glibc 2.1 para generar opciones IPv6.

source: IPSec support for EH and AH headers is missing.
es: No hay soporte IPSec para cabeceras EH y AH.

source: Flow label management is not complete and not documented here.
es: La gestión de las etiquetas de flujos no está completa y no se documenta aquí.

source: This man page is not complete.
es: Esta página de manual no está completa.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: RFC\ 2553: IPv6 BASIC API; Linux tries to be compliant to this. RFC\ 2460: IPv6 specification.
es: RFC\ 2553: IPv6 BASIC API. Linux intenta amoldarse a esto. RFC\ 2460: especificación de IPv6.

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: IPv4 and IPv6 share the local port space. When you get an IPv4 connection or packet to an IPv6 socket, its source address will be mapped to v6 and it will be mapped to v6.
es: IPv4 y IPv6 comparten el espacio de puertos local. Cuando se envía una petición de conexión o paquete IPv4 a un conector IPv6 la dirección de origen se convierte a v6.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: B<SOL_IP>, B<SOL_IPV6>, B<SOL_ICMPV6> and other B<SOL_>* socket options are nonportable variants of B<IPPROTO_>*. See also B<ip>(7).
es: B<SOL_IP>, B<SOL_IPV6>, B<SOL_ICMPV6> y otras opciones de conector de la forma B<SOL_*> son variantes no portables de B<IPPROTO_*>. Consulte B<ip>(7).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
