Repository: sebras/manpages-l10n
Catalog: po/*/man7/keyrings.7.po
Languages: de

source: If a process is upcalled from the kernel to instantiate a key (see B<request_key>(2)), then it also possesses the requester's keyrings as in rule (1) as if it were the requester.
de: Falls ein Prozess vom Kernel hochgerufen wurde, um einen Schlüssel zu instanziieren (siehe B<request_key>(2)), dann besitzt er auch den Schlüsselbund des Anfragenden gemäß Regel (1), als ob er der Anfragende wäre.

source: Note that possession is not a fundamental property of a key, but must rather be calculated each time the key is needed.
de: Beachten Sie, dass Besitz keine fundamentale Eigenschaft eines Schlüssels ist, sondern jedesmal bei Bedarf neu berechnet werden muss.

source: Possession is designed to allow set-user-ID programs run from, say a user's shell to access the user's keys. Granting permissions to the key possessor while denying them to the key owner and group allows the prevention of access to keys on the basis of UID and GID matches.
de: Besitz wurde entwickelt, um es set-user-ID-Programmen zu ermöglichen, beispielsweise von einer Benutzer-Shell ausgeführt zu werden und auf die Schlüssel des Benutzers zuzugreifen. Indem Zugriff auf Schlüssel im Besitz erlaubt, aber Zugriff auf Basis des Schlüsseleigentümers und dessen Gruppe verweigert wird, ist es möglich, den Zugriff auf Schlüssel auf der Basis von Vergleichen von UID und GID zu vermeiden.

source: When it creates the session keyring, B<pam_keyinit>(8) adds a link to the B<user-keyring>(7), thus making the user keyring and anything it contains possessed by default.
de: Wenn B<pam_keyinit>(8) einen Sitzungsschlüssel erstellt, fügt es einen Verweis zu dem B<user-keyring>(7) hinzu und damit gelangt der Benutzerschlüssel und alles was darin ist standardmäßig in den Besitz.

source: Each key has the following security-related attributes:
de: Jeder Schlüssel hat die folgenden sicherheitsbezogenen Attribute:

source: The owning user ID
de: Die Eigentümer-Benutzerkennung.

source: The ID of a group that is permitted to access the key
de: Die Kennung der Gruppe, der Zugriff auf den Schlüssel erlaubt wird.

source: A security label
de: Eine Sicherheitskennzeichnung

source: A permissions mask
de: Eine Berechtigungsmaske

source: The permissions mask contains four sets of rights. The first three sets are mutually exclusive. One and only one will be in force for a particular access check. In order of descending priority, these three sets are:
de: Diese Berechtigungsmaske enthält vier Gruppen an Rechten. Die ersten drei Gruppen schließen sich gegenseitig aus. Genau eine wird für eine bestimmte Berechtigungsprüfung aktiv sein. In absteigender Priorität sind dies die Gruppen:

source: I<user>
de: I<Benutzer>

source: The set specifies the rights granted if the key's user ID matches the caller's filesystem user ID.
de: Diese Gruppe legt die Berechtigungen fest, die gewährt werden, wenn die Benutzerkennung des Schlüssels auf die Dateisystem-Benutzerkennung des Aufrufenden passt.

source: I<group>
de: I<Gruppe>

source: The set specifies the rights granted if the user ID didn't match and the key's group ID matches the caller's filesystem GID or one of the caller's supplementary group IDs.
de: Diese Gruppe legt die Berechtigungen fest, die gewährt werden, wenn die Benutzerkennungen nicht übereinstimmten und die Schlüsselgruppenkennung auf die Dateisystem-GID des Aufrufenden oder eine der ergänzenden Gruppenkennungen des Aufrufenden passte.

source: I<other>
de: I<weitere>

source: The set specifies the rights granted if neither the key's user ID nor group ID matched.
de: Diese Gruppe legt die Berechtigungen fest, die gewährt werden, wenn weder die Benutzerkennung des Schlüssels noch die Gruppenkennung passt.

source: The fourth set of rights is:
de: Die vierte Gruppe an Berechtigungen ist:

source: I<possessor>
de: I<Besitzer>

source: The set specifies the rights granted if a key is determined to be possessed by the caller.
de: Diese Gruppe legt die Berechtigungen fest, die gewährt werden, wenn der Schlüssel vom Aufrufenden besessen wird.

source: The complete set of rights for a key is the union of whichever of the first three sets is applicable plus the fourth set if the key is possessed.
de: Der vollständige Satz an Berechtigungen für einen Schlüssel ist die Vereinigung von der ersten passenden der drei Gruppen mit der vierten Gruppe, falls der Schlüssel besessen wird.

source: The set of rights that may be granted in each of the four masks is as follows:
de: Die Gruppe an Rechten, die in jeder der vier Masken gewährt werden können, ist wie folgt:

source: I<view>
de: I<Betrachten>

source: The attributes of the key may be read. This includes the type, description, and access rights (excluding the security label).
de: Die Attribute des Schlüssels können gelesen werden. Dazu gehören der Typ, die Beschreibung und die Zugriffsrechte (ohne die Sicherheitskennzeichnung).

source: I<read>
de: I<Lesen>

source: For a key: the payload of the key may be read. For a keyring: the list of serial numbers (keys) to which the keyring has links may be read.
de: Für einen Schlüssel: Die Nutzlast des Schlüssels kann gelesen werden. Für einen Schlüsselbund: Die Liste der Seriennummern (Schlüssel), die mit dem Schlüsselbund verbunden sind, kann gelesen werden.

source: I<write>
de: I<Schreiben>

source: The payload of the key may be updated and the key may be revoked. For a keyring, links may be added to or removed from the keyring, and the keyring may be cleared completely (all links are removed),
de: Die Nutzlast des Schlüssels kann aktualisiert werden und der Schlüssel kann zurückgezogen werden. Für einen Schlüsselbund können Verweise hinzugefügt oder entfernt werden und der Schlüsselbund kann komplett bereinigt werden (alle Verweise entfernt).

source: I<search>
de: I<Suchen>

source: For a key (or a keyring): the key may be found by a search. For a keyring: keys and keyrings that are linked to by the keyring may be searched.
de: Für einen Schlüssel (oder einen Schlüsselbund): Der Schlüssel kann in einer Suche gefunden werden. Für einen Schlüsselbund: Schlüssel und Schlüsselbunde, auf die verwiesen wird, können durchsucht werden.

source: I<link>
de: I<Verweisen>

source: Links may be created from keyrings to the key. The initial link to a key that is established when the key is created doesn't require this permission.
de: Von Schlüsselbunden können Verweise auf Schlüssel erstellt werden. Der anfängliche Verweis auf einen Schlüssel, der bei der Schlüsselerstellung etabliert wird, benötigt diese Berechtigung nicht.

source: I<setattr>
de: I<Attributsetzen>

source: The ownership details and security label of the key may be changed, the key's expiration time may be set, and the key may be revoked.
de: Die Details zum Eigentümer und der Sicherheitskennzeichnung können geändert werden, die Ablaufzeit des Schlüssels kann gesetzt werden und der Schlüssel kann zurückgezogen werden.

source: In addition to access rights, any active Linux Security Module (LSM) may prevent access to a key if its policy so dictates. A key may be given a security label or other attribute by the LSM; this label is retrievable via B<keyctl_get_security>(3).
de: Zusätzlich zu den Zugriffsrechten kann jedes aktive Linux-Sicherheitsmodul (LSM) den Zugriff auf einen Schlüssel verhindern, falls die Richtlinie das vorgibt. Ein Schlüssel kann durch das LSM eine Sicherheitskennzeichnung oder andere Attribute erhalten; dieses Kennzeichen kann mit B<keyctl_get_security>(3) ermittelt werden.

source: See B<keyctl_chown>(3), B<keyctl_describe>(3), B<keyctl_get_security>(3), B<keyctl_setperm>(3), and B<selinux>(8) for more information.
de: Siehe B<keyctl_chown>(3), B<keyctl_describe>(3), B<keyctl_get_security>(3), B<keyctl_setperm>(3) und B<selinux>(8) für weitere Informationen.

source: Searching for keys
de: Schlüssel suchen

source: One of the key features of the Linux key-management facility is the ability to find a key that a process is retaining. The B<request_key>(2) system call is the primary point of access for user-space applications to find a key. (Internally, the kernel has something similar available for use by internal components that make use of keys.)
de: Eine der zentralen Funktionalitäten der Schlüsselverwaltungseinrichtung von Linux ist die Fähigkeit, einen Schlüssel zu finden, den ein Prozess aufbewahrt. Der Systemaufruf B<request_key>(2) ist der primäre Zugriffspunkt für Anwendungen aus dem Benutzerraum, um den Schlüssel zu finden. (Intern steht dem Kernel etwas ähnliches für interne Komponenten, die Schlüssel verwenden, zur Verfügung.)

source: The search algorithm works as follows:
de: Der Suchalgorithmus funktioniert wie folgt:

source: The process keyrings are searched in the following order: the thread B<thread-keyring>(7) if it exists, the B<process-keyring>(7) if it exists, and then either the B<session-keyring>(7) if it exists or the B<user-session-keyring>(7) if that exists.
de: Die Prozessschlüsselbunde werden in der folgenden Reihenfolge durchsucht: der B<thread-keyring>(7), falls er existiert, dann entweder der B<session-keyring>(7), falls er existiert, oder B<user-session-keyring>(7), falls dieser existiert.

source: If the caller was a process that was invoked by the B<request_key>(2) upcall mechanism, then the keyrings of the original caller of B<request_key>(2) will be searched as well.
de: Falls der Aufrufende ein Prozess war, der mittels des Hochruf-Mechanismus B<request_key>(2) aktiviert wurde, dann werden die Schlüsselbunde der ursprünglichen Aufrufenden von B<request_key>(2) auch durchsucht.

source: The search of a keyring tree is in breadth-first order: each keyring is searched first for a match, then the keyrings referred to by that keyring are searched.
de: Das Durchsuchen eines Schlüsselbundbaums ist eine Breitensuche: jeder Schlüsselbund wird zuerst auf einen Treffer durchsucht, dann werden die Schlüsselbunde durchsucht, auf die der erste Schlüsselbund verweist.

source: If a matching key is found that is valid, then the search terminates and that key is returned.
de: Falls ein passender Schlüssel gefunden wird, der gültig ist, dann wird die Suche beendet und der Schlüssel zurückgeliefert.

source: If a matching key is found that has an error state attached, that error state is noted and the search continues.
de: Falls ein passender Schlüssel gefunden wird, an dem ein Fehlerzustand hängt, dann wird dieser Fehlerzustand notiert und mit der Suche fortgefahren.

source: If no valid matching key is found, then the first noted error state is returned; otherwise, an B<ENOKEY> error is returned.
de: Falls kein gültiger Schlüssel gefunden wird, dann wird der zuerst notierte Fehlerzustand zurückgeliefert; andernfalls wird der Fehler B<ENOKEY> zurückgeliefert.

source: It is also possible to search a specific keyring, in which case only steps (3) to (6) apply.
de: Es kann auch nach einem bestimmten Schlüsselbund gesucht werden, dann gelten nur die Schritte (3) bis (6).

source: See B<request_key>(2) and B<keyctl_search>(3) for more information.
de: Siehe B<request_key>(2) und B<keyctl_search>(3) für weitere Informationen.

source: On-demand key creation
de: Bedarfsgesteuerte Schlüsselerstellung

source: If a key cannot be found, B<request_key>(2) will, if given a I<callout_info> argument, create a new key and then upcall to user space to instantiate the key. This allows keys to be created on an as-needed basis.
de: Falls ein Schlüssel nicht gefunden werden kann, wird B<request_key>(2) einen neuen Schlüssel erzeugen, falls das Argument I<callout_info> angegeben wurde, und dann in den Benutzerraum hochrufen, um den Schlüssel zu instanziieren. Damit ist es möglich, Schlüssel bedarfsgesteuert zu erstellen.

source: Typically, this will involve the kernel creating a new process that executes the B<request-key>(8) program, which will then execute the appropriate handler based on its configuration.
de: Typischerweise beteiligt dies den Kernel, der einen neuen Prozess erzeugt, der das Programm B<request-key>(8) ausführt, das dann den geeigneten Handler basierend auf seiner Konfiguration ausführt.

source: The handler is passed a special authorization key that allows it and only it to instantiate the new key. This is also used to permit searches performed by the handler program to also search the requester's keyrings.
de: Dem Handler wird ein besonderer Autorisierungsschlüssel übergeben, der es ihm und nur ihm erlaubt, den neuen Schlüssel zu instanziieren. Dies wird auch dazu verwandt, Suchen durch das Handler-Programm zu erlauben, die auch die Schlüsselbunde des Anfragenden durchsuchen.

source: See B<request_key>(2), B<keyctl_assume_authority>(3), B<keyctl_instantiate>(3), B<keyctl_negate>(3), B<keyctl_reject>(3), B<request-key>(8), and B<request-key.conf>(5) for more information.
de: Siehe B<request_key>(2), B<keyctl_assume_authority>(3), B<keyctl_instantiate>(3), B<keyctl_negate>(3), B<keyctl_reject>(3), B<request-key>(8) und B<request-key.conf>(5) für weitere Informationen.

source: /proc files
de: /proc-Dateien

source: The kernel provides various I</proc> files that expose information about keys or define limits on key usage.
de: Der Kernel stellt verschiedene I</proc>-Dateien bereit, die Informationen über Schlüssel offenlegen oder Beschränkungen für die Verwendung von Schlüsseln definieren.

source: I</proc/keys> (since Linux 2.6.10)
de: I</proc/keys> (seit Linux 2.6.10)

source: This file exposes a list of the keys for which the reading thread has I<view> permission, providing various information about each key. The thread need not possess the key for it to be visible in this file.
de: Diese Datei legt eine Liste von Schlüsseln offen, für die der lesende Thread die I<Betrachten>-Berechtigung hat und stellt verschiedene Informationen über jeden Schlüssel bereit. Der Thread muss den Schlüssel nicht besitzen, damit er in dieser Datei sichtbar ist.

source: The only keys included in the list are those that grant I<view> permission to the reading process (regardless of whether or not it possesses them). LSM security checks are still performed, and may filter out further keys that the process is not authorized to view.
de: Die einzigen in dieser Liste aufgenommenen Schlüssel sind diejenigen, die dem lesenden Prozess die I<Betrachten>-Berechtigung gewähren (unabhängig davon, ob er sie besitzt oder nicht). LSM-Sicherheitsüberprüfungen werden weiterhin durchgeführt und könnten weitere Schlüssel herausfiltern, für die dem Prozess die Autorisierung zur Betrachtung fehlt.

source: An example of the data that one might see in this file (with the columns numbered for easy reference below) is the following:
de: Nachfolgend ein Beispiel für die Daten, die Sie in der Datei sehen können (wobei die Spalten für einfachere Bezüge nachfolgend nummeriert sind):

source: The fields shown in each line of this file are as follows:
de: Die in jeder Zeile dieser Datei gezeigten Felder sind wie folgt:

source: ID (1)
de: KENNUNG (1)

source: The ID (serial number) of the key, expressed in hexadecimal.
de: Die Kennung (Seriennummer) des Schlüssels, hexadezimal dargestellt.

source: Flags (2)
de: Schalter (2)

source: A set of flags describing the state of the key:
de: Eine Gruppe von Schaltern, die den Status des Schlüssels beschreiben:

source: The key has been instantiated.
de: Der Schlüssel wurde instanziiert.

source: The key has been revoked.
de: Der Schlüssel wurde zurückgezogen.

source: The key is dead (i.e., the key type has been unregistered). (A key may be briefly in this state during garbage collection.)
de: Der Schlüssel ist tot (d.h. die Registrierung des Schlüsseltyps wurde aufgehoben). (Während der Speicherbereinigung kann ein Schlüssel kurzfristig in diesem Zustand sein).

source: The key contributes to the user's quota.
de: Der Schlüssel wird für das Benutzerkontingent berücksichtigt.

source: The key is under construction via a callback to user space; see B<request-key>(2).
de: Der Schlüssel wird derzeit über einen Rückruf zum Anwendungsraum konstruiert; siehe B<request-key>(2).

source: The key is negatively instantiated.
de: Der Schlüssel wird negativ instanziiert.

source: The key has been invalidated.
de: Der Schlüssel wurde entwertet.

source: Usage (3)
de: Einsatz (3)

source: This is a count of the number of kernel credential structures that are pinning the key (approximately: the number of threads and open file references that refer to this key).
de: Dies ist die Anzahl der Kernelzugangsberechtigungsstrukturen, die den Schlüssel anheften (ungefähr: die Anzahl der Threads und offenen Dateireferenzen, die sich auf diesen Schlüssel beziehen).

source: Timeout (4)
de: Zeitüberschreitung (4)

source: The amount of time until the key will expire, expressed in human-readable form (weeks, days, hours, minutes, and seconds). The string I<perm> here means that the key is permanent (no timeout). The string I<expd> means that the key has already expired, but has not yet been garbage collected.
de: Die Zeitdauer, bis der Schlüssel ablaufen wird, ausgedrückt in menschenlesbarer Form (Wochen, Tage, Stunden, Minuten und Sekunden). Die Zeichenkette I<perm> bedeutet hier, dass der Schlüssel permanent ist (keine Zeitüberschreitung). Die Zeichenkette I<expd> bedeutet, dass der Schlüssel bereits abgelaufen ist, aber die Speicherbereinigung noch nicht erfolgte.

source: Permissions (5)
de: Berechtigungen (5)

source: The key permissions, expressed as four hexadecimal bytes containing, from left to right, the possessor, user, group, and other permissions. Within each byte, the permission bits are as follows:
de: Die Schlüsselberechtigungen, ausgedrückt in vier hexadezimalen Bytes, die von links nach rechts den Besitzer, den Benutzer, die Gruppe und andere Berechtigungen enthalten. Innerhalb jedes Bytes sind die Berechtigungsbits wie folgt:

source: The user ID of the key owner.
de: Die Benutzerkennung des Schlüsseleigentümers.

source: The group ID of the key. The value -1 here means that the key has no group ID; this can occur in certain circumstances for keys created by the kernel.
de: Die Gruppenkennung des Schlüssels. Hier bedeutet der Wert -1, dass der Schlüssel keine Gruppenkennung hat. Dies kann unter bestimmten Umständen bei vom Kernel erstellten Schlüsseln auftreten.

source: Type (8)
de: Typ (8)

source: The key type (user, keyring, etc.)
de: Der Schlüsseltyp (Benutzer, Schlüsselbund, usw.)

source: Description (9)
de: Beschreibung (9)

source: The key description (name). This field contains descriptive information about the key. For most key types, it has the form
de: Die Schlüsselbeschreibung (Name). Dieses Feld enthält eine beschreibende Information über den Schlüssel. Für die meisten Schlüsseltypen hat es die folgende Form:

source: The I<name> subfield is the key's description (name). The optional I<extra-info> field provides some further information about the key. The information that appears here depends on the key type, as follows:
de: Das Unterfeld I<Name> ist die Schlüsselbeschreibung (der Name). Das optionale Feld I<Extra-Info> stellt einige weitere Informationen über den Schlüssel bereit. Die hier auftauchende Information hängt vom Schlüsseltyp wie folgt ab:

source: I<"user"> and I<"logon">
de: I<"user"> und I<"logon">

source: The size in bytes of the key payload (expressed in decimal).
de: Die Größe in Byte der Schlüsselnutzlast (dezimal dargestellt).

source: The number of keys linked to the keyring, or the string I<empty> if there are no keys linked to the keyring.
de: Die Anzahl der Schlüssel, auf die vom Schlüsselbund verwiesen wird, oder die Zeichenkette I<empty>, falls es keine Schlüssel gibt, auf die vom Schlüsselbund verwiesen wird.

source: The payload size in bytes, followed either by the string I<[file]>, if the key payload exceeds the threshold that means that the payload is stored in a (swappable) B<tmpfs>(5) filesystem, or otherwise the string I<[buff]>, indicating that the key is small enough to reside in kernel memory.
de: Die Nutzlastgröße in Byte, gefolgt entweder von der Zeichenkette I<[file]>, falls die Schlüsselnutzlast den Schwellwert übersteigt, was bedeutet, dass die Nutzlast in einem (auslagerungsfähigen) B<tmpfs>(5)-Dateisystem gespeichert ist, oder der Zeichenkette I<[buff]>, die anzeigt, dass der Schlüssel klein genug ist, um sich im Kernelspeicher zu befinden.

source: For the I<".request_key_auth"> key type (authorization key; see B<request_key>(2)), the description field has the form shown in the following example:
de: Für den Schlüsseltyp I<".request_key_auth"> (Autorisierungsschlüssel, siehe B<request_key>(2)) hat das Beschreibungsfeld die im folgenden Beispiel gezeigte Form:

source: The three subfields are as follows:
de: Die drei Unterfelder sind wie folgt definiert:

source: The hexadecimal ID of the key being instantiated in the requesting program.
de: Die hexadezimale Kennung des Schlüssels, der im anfragenden Programm instanziiert wird.

source: The PID of the requesting program.
de: Die PID (Prozesskennung) des anfragenden Programms.

source: The length of the callout data with which the requested key should be instantiated (i.e., the length of the payload associated with the authorization key).
de: Die Länge der Abrufdaten, mit denen der angefragte Schlüssel instanziiert werden soll (d.h. die Länge der Nutzlast, die dem Autorisierungsschlüssel zugeordnet ist).

source: I</proc/key-users> (since Linux 2.6.10)
de: I</proc/key-users> (seit Linux 2.6.10)

source: This file lists various information for each user ID that has at least one key on the system. An example of the data that one might see in this file is the following:
de: Diese Datei listet verschiedene Informationen über jede Benutzerkennung auf, die im System mindestens einen Schlüssel hat. Beispielsweise könnten Sie in dieser Datei Folgendes sehen:

source: The fields shown in each line are as follows:
de: Die Bedeutung der Felder in jeder Zeile im Einzelnen:

source: The user ID.
de: Die Benutzerkennung.

source: I<usage>
de: I<Verwendung>

source: This is a kernel-internal usage count for the kernel structure used to record key users.
de: Dies ist ein kernelinterner Verwendungszähler für die Kernelstruktur, die zur Aufzeichnung der Schlüsselbenutzer verwandt wird.

source: I<nkeys>/I<nikeys>
de: I<GAnzSchlüssel>/I<AnzISchlüssel>

source: The total number of keys owned by the user, and the number of those keys that have been instantiated.
de: Die Gesamtanzahl der von diesem Benutzer besessenen Schlüssel und die Anzahl dieser Schlüssel, die instanziiert wurden.

source: I<qnkeys>/I<maxkeys>
de: I<AnzSchlüssel>/I<Maxschlüssel>

source: The number of keys owned by the user, and the maximum number of keys that the user may own.
de: Die Anzahl der Schlüssel, die dieser Benutzer besitzt und die maximale Anzahl der Schlüssel, die der Benutzer besitzen kann.

source: I<qnbytes>/I<maxbytes>
de: I<AnzBytes>/I<MaxBytes>

source: The number of bytes consumed in payloads of the keys owned by this user, and the upper limit on the number of bytes in key payloads for that user.
de: Die Anzahl an Bytes, die in Nutzlasten von Schlüsseln, die im Besitz dieses Benutzers sind, konsumiert wurden und die obere Grenze der Anzahl an Bytes, die in Schlüsselnutzlasten für diesen Benutzer möglich sind.

source: I</proc/sys/kernel/keys/gc_delay> (since Linux 2.6.32)
de: I</proc/sys/kernel/keys/gc_delay> (seit Linux 2.6.32)
