Repository: sebras/manpages-l10n
Catalog: po/*/man7/keyrings.7.po
Languages: de

source: The value in this file specifies the interval, in seconds, after which revoked and expired keys will be garbage collected. The purpose of having such an interval is so that there is a window of time where user space can see an error (respectively B<EKEYREVOKED> and B<EKEYEXPIRED>) that indicates what happened to the key.
de: Der Wert in dieser Datei legt das Intervall in Sekunden fest, nachdem zurückgezogene und abgelaufene Schlüssel der Speicherbereinigung unterliegen. Der Zweck für ein solches Intervall besteht darin, dass es ein Zeitfenster gibt, in dem der Anwendungsraum einen Fehler sehen kann (B<EKEYREVOKED> bzw. B<EKEYEXPIRED>), der anzeigt, was mit dem Schlüssel passierte.

source: The default value in this file is 300 (i.e., 5 minutes).
de: Der Vorgabewert in dieser Datei ist 300 (d.h. 5 Minuten).

source: I</proc/sys/kernel/keys/persistent_keyring_expiry> (since Linux 3.13)
de: I</proc/sys/kernel/keys/persistent_keyring_expiry> (seit Linux 3.13)

source: This file defines an interval, in seconds, to which the persistent keyring's expiration timer is reset each time the keyring is accessed (via B<keyctl_get_persistent>(3) or the B<keyctl>(2) B<KEYCTL_GET_PERSISTENT> operation.)
de: Diese Datei definiert ein Intervall in Sekunden, auf das die Ablauf-Zeitüberschreitung bei jedem Zugriff auf den dauerhaften Schlüsselbund zurückgesetzt wird (mittels B<keyctl_get_persistent>(3) oder der Aktion B<KEYCTL_GET_PERSISTENT> von B<keyctl>(2)).

source: The default value in this file is 259200 (i.e., 3 days).
de: Der Vorgabewert in dieser Datei ist 259200 (d.h. 3 Tage).

source: The following files (which are writable by privileged processes) are used to enforce quotas on the number of keys and number of bytes of data that can be stored in key payloads:
de: Die folgenden Dateien (die von privilegierten Prozessen schreibbar sind) werden zur Durchsetzung von Kontingenten zur Anzahl der Schlüssel und der Anzahl an Daten-Bytes, die in der Schlüsselnutzlast gespeichert werden können, verwandt:

source: I</proc/sys/kernel/keys/maxbytes> (since Linux 2.6.26)
de: I</proc/sys/kernel/keys/maxbytes> (seit Linux 2.6.26)

source: This is the maximum number of bytes of data that a nonroot user can hold in the payloads of the keys owned by the user.
de: Dies ist die maximale Anzahl an Daten-Bytes, die ein von Root verschiedener Benutzer in Nutzlasten in Schlüsseln, die ihm gehören, halten kann.

source: The default value in this file is 20,000.
de: Der Vorgabewert in dieser Datei ist 20.000.

source: I</proc/sys/kernel/keys/maxkeys> (since Linux 2.6.26)
de: I</proc/sys/kernel/keys/maxkeys> (seit Linux 2.6.26)

source: This is the maximum number of keys that a nonroot user may own.
de: Dies ist die maximale Anzahl an Schlüsseln, die ein von root verschiedener Benutzer besitzen kann.

source: The default value in this file is 200.
de: Der Vorgabewert in dieser Datei ist 200.

source: I</proc/sys/kernel/keys/root_maxbytes> (since Linux 2.6.26)
de: I</proc/sys/kernel/keys/root_maxbytes> (seit Linux 2.6.26)

source: This is the maximum number of bytes of data that the root user (UID 0 in the root user namespace) can hold in the payloads of the keys owned by root.
de: Dies ist die maximale Anzahl an Daten-Bytes, die der Benutzer root (UID 0 in dem Wurzelbenutzernamensraum) in der Nutzlast der Schlüssel, die root gehören, halten kann.

source: The default value in this file is 25,000,000 (20,000 before Linux 3.17).
de: Der Vorgabewert in dieser Datei ist 25.000.000 (20.000 vor Linux 3.17).

source: I</proc/sys/kernel/keys/root_maxkeys> (since Linux 2.6.26)
de: I</proc/sys/kernel/keys/root_maxkeys> (seit Linux 2.6.26)

source: This is the maximum number of keys that the root user (UID 0 in the root user namespace) may own.
de: Dies ist die maximale Anzahl von Schlüsseln, die der Benutzer root (UID 0 in dem Wurzelbenutzernamensraum) besitzen kann.

source: The default value in this file is 1,000,000 (200 before Linux 3.17).
de: Der Vorgabewert in dieser Datei ist 1.000.000 (200 vor Linux 3.17).

source: With respect to keyrings, note that each link in a keyring consumes 4 bytes of the keyring payload.
de: Beachten Sie, dass in Bezug auf Schlüsselbunde jeder Verweis 4 byte der Schlüsselbundnutzlast verbraucht.

source: Users
de: Benutzer

source: The Linux key-management facility has a number of users and usages, but is not limited to those that already exist.
de: Die Schlüsselverwaltungseinrichtung von Linux hat eine Reihe von Benutzern und Verwendungen, aber sie ist nicht auf die bereits existierenden beschränkt.

source: In-kernel users of this facility include:
de: Kernelinterne Benutzer dieser Einrichtung sind unter anderem:

source: Network filesystems - DNS
de: Netzwerkdateisystem - DNS

source: The kernel uses the upcall mechanism provided by the keys to upcall to user space to do DNS lookups and then to cache the results.
de: Der Kernel verwendet den durch die Schlüssel bereitgestellten Hochruf-Mechanismus, um im Benutzerraum hochzurufen, DNS-Nachschlagen durchzuführen und die Ergebnisse zwischenzuspeichern.

source: AF_RXRPC and kAFS - Authentication
de: AF_RXRPC und kAFS - Authentifizierung

source: The AF_RXRPC network protocol and the in-kernel AFS filesystem use keys to store the ticket needed to do secured or encrypted traffic. These are then looked up by network operations on AF_RXRPC and filesystem operations on kAFS.
de: Das Netzwerkprotokoll AF_RXRPC und das kernelinterne AFS-Dateisystem verwenden Schlüssel, um die benötigten Tickets für gesicherten oder verschlüsselten Datenverkehr zu speichern. Diese werden dann bei Netzwerkaktionen für AF_RXRPC- und Dateisystem-Aktionen bei kAFS nachgeschlagen.

source: NFS - User ID mapping
de: NFS - Benutzerkennungsabbildung

source: The NFS filesystem uses keys to store mappings of foreign user IDs to local user IDs.
de: Das NFS-Dateisystem verwendet Schlüssel, um Abbildungen von fremden Benutzerkennungen auf lokale Benutzerkennungen zu speichern.

source: CIFS - Password
de: CIFS - Passwort

source: The CIFS filesystem uses keys to store passwords for accessing remote shares.
de: Das CIFS-Dateisystem verwendet Schlüssel, um Passwörter für den Zugriff auf ferne Laufwerksfreigaben zu speichern.

source: Module verification
de: Modulüberprüfung

source: The kernel build process can be made to cryptographically sign modules. That signature is then checked when a module is loaded.
de: Der Kernel-Bauprozess kann Module kryptographisch signieren. Diese Signatur wird beim Laden des Moduls überprüft.

source: User-space users of this facility include:
de: Anwendungsraum-Benutzer dieser Einrichtung sind unter anderem:

source: Kerberos key storage
de: Kerberos-Schlüsselspeicher

source: The MIT Kerberos 5 facility (libkrb5) can use keys to store authentication tokens which can be made to be automatically cleaned up a set time after the user last uses them, but until then permits them to hang around after the user has logged out so that B<cron>(8) scripts can use them.
de: Die MIT-Kerberos-5-Einrichtung (libkrb5) kann Schlüssel verwenden, um Authentifizierungs-Merkmale zu speichern, die dann so eingerichtet werden können, dass sie nach einer bestimmten Zeit nach der letzten Verwendung automatisch bereinigt werden, aber bis dahin vorhanden sein können, nachdem der Benutzer sich abgemeldet hat, so dass B<cron>(8)-Skripte sie verwenden können.

source: SEE ALSO
de: SIEHE AUCH

source: The kernel source files I<Documentation/crypto/asymmetric-keys.txt> and under I<Documentation/security/keys> (or, before Linux 4.13, in the file I<Documentation/security/keys.txt>).
de: Die Kernel-Quelldateien I<Documentation/crypto/asymmetric-keys.txt> und unter I<Documentation/security/keys> (oder in der Datei I<Documentation/security/keys.txt> vor Linux 4.13).

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: The description of a I<"logon"> key I<muststart with a non-empty colon-delimited prefix whose purpose> is to identify the service to which the key belongs. (Note that this differs from keys of the I<"user"> type, where the inclusion of a prefix is recommended but is not enforced.)
de: Die Beschreibung eines I<"logon">-Schlüssels I<muss mit einem nicht leeren, Doppelpunkt-begrenzten Präfix beginnen>, dessen Zweck darin besteht, den Dienst zu identifizieren, dem der Schlüssel gehört. (Beachten Sie, dass sich das von Schlüsseln des Typs I<"user"> unterscheidet, bei denen die Aufnahme eines Präfix empfohlen, dies aber nicht erzwungen wird.)

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
