Repository: sebras/manpages-l10n
Catalog: po/*/man7/keyrings.7.po
Languages: de

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG

source: keyrings - in-kernel key management and retention facility
de: keyrings - Kernel-interne Schlüsselverwaltungs- und -beibehaltungseinrichtung

source: DESCRIPTION
de: BESCHREIBUNG

source: The Linux key-management facility is primarily a way for various kernel components to retain or cache security data, authentication keys, encryption keys, and other data in the kernel.
de: Die Linux-Schlüsselverwaltungseinrichtung ist der primäre Zugang für verschiedene Kernelkomponenten, um Sicherheitsdaten, Authentifizierungsschlüssel, Verschlüsselungsschlüssel und andere Daten im Kernel beizubehalten oder zwischenzuspeichern.

source: System call interfaces are provided so that user-space programs can manage those objects and also use the facility for their own purposes; see B<add_key>(2), B<request_key>(2), and B<keyctl>(2).
de: Es werden Systemaufrufschnittstellen bereitgestellt, so dass Programme aus dem Anwendungsraum diese Objekte verwalten können und die Einrichtung auch für eigene Zwecke verwenden können; siehe B<add_key>(2), B<request_key>(2) und B<keyctl>(2).

source: A library and some user-space utilities are provided to allow access to the facility. See B<keyctl>(1), B<keyctl>(3), and B<keyutils>(7) for more information.
de: Eine Bibliothek und einige Hilfswerkzeuge im Benutzerraum werden bereitgestellt, um Zugriff auf die Einrichtung zu erlauben. Siehe B<keyctl>(1), B<keyctl>(3) und B<keyutils>(7) für weitere Informationen.

source: Keys
de: Schlüssel

source: A key has the following attributes:
de: Ein Schlüssel hat die folgenden Attribute:

source: Serial number (ID)
de: Seriennummer (ID)

source: This is a unique integer handle by which a key is referred to in system calls. The serial number is sometimes synonymously referred as the key ID. Programmatically, key serial numbers are represented using the type I<key_serial_t>.
de: Dies ist ein eindeutiger, ganzzahliger Aufhänger, über den bei Systemaufrufen der Schlüssel referenziert wird. Die Seriennummer wird manchmal synonym als Schlüssel-ID bezeichnet. In Programmen wird die Seriennummer durch den Typ I<key_serial_t> repräsentiert.

source: Type
de: Typ

source: A key's type defines what sort of data can be held in the key, how the proposed content of the key will be parsed, and how the payload will be used.
de: Ein Schlüsseltyp definiert, welche Arten an Daten im Schlüssel gehalten werden können, wie der vorgeschlagene Inhalt des Schlüssels ausgewertet und wie die Nutzlast verwandt wird.

source: There are a number of general-purpose types available, plus some specialist types defined by specific kernel components.
de: Es gibt eine Reihe von universellen Typen, sowie einige spezialisierte Typen, definiert durch bestimmte Kernelkomponenten.

source: Description (name)
de: Beschreibung (Name)

source: The key description is a printable string that is used as the search term for the key (in conjunction with the key type) as well as a display name. During searches, the description may be partially matched or exactly matched.
de: Die Schlüsselbeschreibung ist eine darstellbare Zeichenkette, die als Suchausdruck für den Schlüssel (im Zusammenspiel mit dem Schlüsseltyp) sowie als Anzeigename verwandt wird. Während des Suchens kann die Beschreibung teilweise oder exakt übereinstimmen.

source: Payload (data)
de: Nutzlast (Daten)

source: The payload is the actual content of a key. This is usually set when a key is created, but it is possible for the kernel to upcall to user space to finish the instantiation of a key if that key wasn't already known to the kernel when it was requested. For further details, see B<request_key>(2).
de: Die Nutzlast ist der eigentliche Inhalt eines Schlüssels. Dieser wird normalerweise gesetzt, wenn ein Schlüssel erzeugt wird, aber es ist möglich, dass der Kernel im Benutzerraum anfragt, um die Instanziierung eines Schlüssels abzuschließen, falls der Schlüssel dem Kernel bei der Anfrage noch nicht bekannt war. Weitere Details finden Sie in B<request_key>(2).

source: A key's payload can be read and updated if the key type supports it and if suitable permission is granted to the caller.
de: Die Nutzlast eines Schlüssel kann gelesen und aktualisiert werden, falls der Schlüsseltyp dies unterstützt und falls der Aufrufende ausreichende Berechtigungen erhalten hat.

source: Access rights
de: Zugriffsrechte

source: Much as files do, each key has an owning user ID, an owning group ID, and a security label. Each key also has a set of permissions, though there are more than for a normal UNIX file, and there is an additional category\(empossessor\(embeyond the usual user, group, and other (see I<Possession>, below).
de: Ähnlich wie bei Dateien hat jeder Schlüssel eine Eigentümer-Benutzerkennung, eine Eigentümer-Gruppenkennung und eine Sicherheitskennzeichnung. Jeder Schlüssel hat auch eine Gruppe an Berechtigungen, allerdings gibt es mehr als für eine normale UNIX-Datei, und es gibt die zusätzliche Kategorie »Besitzer« neben den gewöhnlichen Benutzer, Gruppe und andere (siehe I<Besitz> weiter unten).

source: Note that keys are quota controlled, since they require unswappable kernel memory. The owning user ID specifies whose quota is to be debited.
de: Beachten Sie, dass Schlüssel Kontingenten unterliegen, da sie nicht auslagerungsfähigen Kernelspeicher benötigen. Die Eigentümer-Benutzerkennung legt fest, auf wessen Kontingent dies läuft.

source: Expiration time
de: Ablaufzeit

source: Each key can have an expiration time set. When that time is reached, the key is marked as being expired and accesses to it fail with the error B<EKEYEXPIRED>. If not deleted, updated, or replaced, then, after a set amount of time, an expired key is automatically removed (garbage collected) along with all links to it, and attempts to access the key fail with the error B<ENOKEY>.
de: Jeder Schlüssel kann über eine Ablaufzeit verfügen. Wenn diese Zeit verstrichen ist, wird der Schlüssel als abgelaufen markiert und Zugriff darauf schlägt mit B<EKEYEXPIRED> fehl. Falls er nicht gelöscht, aktualisiert oder ersetzt wird, wird der abgelaufene Schlüssel nach einer einstellbaren Zeit automatisch gelöscht (Speicherbereinigung), zusammen mit allen Verweisen darauf, und Zugriffe auf den Schlüssel schlagen mit dem Fehler B<ENOKEY> fehl.

source: Reference count
de: Referenzzähler

source: Each key has a reference count. Keys are referenced by keyrings, by currently active users, and by a process's credentials. When the reference count reaches zero, the key is scheduled for garbage collection.
de: Jeder Schlüssel hat einen Referenzzähler. Schlüssel werden von Schlüsselbunden, von derzeit aktiven Benutzern und von Anmeldeberechtigungen von Prozessen referenziert. Wenn dieser Referenzzähler Null erreicht, dann wird der Schlüssel für die Speicherbereinigung eingeplant.

source: Key types
de: Schlüsseltypen

source: The kernel provides several basic types of key:
de: Der Kernel stellt mehrere gundlegende Schlüsseltypen bereit:

source: Keyrings are special keys which store a set of links to other keys (including other keyrings), analogous to a directory holding links to files. The main purpose of a keyring is to prevent other keys from being garbage collected because nothing refers to them.
de: Schlüsselbunde sind besondere Schlüssel, die eine Gruppe von Verweisen auf andere Schlüssel (einschließlich anderer Schlüsselbunde) speichern, ähnlich wie ein Verzeichnis Verweise auf Dateien speichert. Der Hauptzweck eines Schlüsselbundes ist es, zu verhindern, dass andere Schlüssel aus dem Speicher bereinigt werden, weil nichts mehr sie referenziert.

source: Keyrings with descriptions (names) that begin with a period (\(aq.\(aq) are reserved to the implementation.
de: Schlüsselbunde mit Beschreibungen (Namen), die mit einem Punkt (».«) beginnen, sind für die Implementierung reserviert.

source: This is a general-purpose key type. The key is kept entirely within kernel memory. The payload may be read and updated by user-space applications.
de: Dies ist ein Allzweck-Schlüsseltyp. Der Schlüssel wird im Gesamten im Kernelspeicher gehalten. Die Nutzlast kann von Anwendungen im Benutzerraum gelesen und aktualisiert werden.

source: The payload for keys of this type is a blob of arbitrary data of up to 32,767 bytes.
de: Die Nutzlast von Schlüsseln dieses Typs ist ein beliebiger Datenblock (blob) mit bis zu 32.767 byte.

source: The description may be any valid string, though it is preferred that it start with a colon-delimited prefix representing the service to which the key is of interest (for instance I<"afs:mykey">).
de: Die Beschreibung kann eine beliebige gültige Zeichenkette sein. Es wird aber bevorzugt, dass sie mit einem Präfix startet, das durch einen Doppelpunkt abgetrennt wird, der den Dienst darstellt, für den der Schlüssel von Interesse ist (beispielsweise I<"afs:mykey">).

source: I<"logon"> (since Linux 3.3)
de: I<"logon"> (seit Linux 3.3)

source: This key type is essentially the same as I<"user">, but it does not provide reading (i.e., the B<keyctl>(2) B<KEYCTL_READ> operation), meaning that the key payload is never visible from user space. This is suitable for storing username-password pairs that should not be readable from user space.
de: Dieser Schlüsseltyp ist im wesentlichen der gleiche wie I<"user">, er kann aber nicht gelesen werden (d.h. die Aktion B<KEYCTL_READ> von B<keyctl>(2)). Das bedeutet, dass die Schlüssel-Nutzlast im Anwendungsraum niemals sichtbar ist. Dies ist für Benutzername-Passwörter-Paare nützlich, die aus dem Anwendungsraum heraus nicht lesbar sein sollten.

source: The description of a I<"logon"> key I<must> start with a non-empty colon-delimited prefix whose purpose is to identify the service to which the key belongs. (Note that this differs from keys of the I<"user"> type, where the inclusion of a prefix is recommended but is not enforced.)
de: Die Beschreibung eines I<"logon">-Schlüssels I<muss> mit einem nicht leeren, Doppelpunkt-begrenzten Präfix beginnen, dessen Zweck darin besteht, den Dienst zu identifizieren, dem der Schlüssel gehört. (Beachten Sie, dass sich das von Schlüsseln des Typs I<"user"> unterscheidet, bei denen die Aufnahme eines Präfix empfohlen, dies aber nicht erzwungen wird.)

source: I<"big_key"> (since Linux 3.13)
de: I<"big_key"> (seit Linux 3.13)

source: This key type is similar to the I<"user"> key type, but it may hold a payload of up to 1\ MiB in size. This key type is useful for purposes such as holding Kerberos ticket caches.
de: Dieser Schlüssel ist ähnlich zum Schlüsseltyp I<"user">, kann aber eine Nutzlast von bis zu 1\ MiB Größe enthalten. Dieser Schlüssel ist für Zwecke wie Kerberos-Ticket-Zwischenspeicher nützlich.

source: The payload data may be stored in a tmpfs filesystem, rather than in kernel memory, if the data size exceeds the overhead of storing the data in the filesystem. (Storing the data in a filesystem requires filesystem structures to be allocated in the kernel. The size of these structures determines the size threshold above which the tmpfs storage method is used.) Since Linux 4.8, the payload data is encrypted when stored in tmpfs, thereby preventing it from being written unencrypted into swap space.
de: Die Nutzlastdaten können in einem tmpfs-Dateisystem statt im Kernelspeicher gespeichert werden, falls die Datengröße die Aufwandskosten des Speicherns der Daten im Dateisystem übersteigt. (Zum Speichern von Daten in einem Dateisystem muss der Kernel Dateisystemstrukturen im Kernel reservieren. Die Größe dieser Strukturen bestimmt den Schwellwert, über dem die Tmpfs-Speichermethode verwandt wird.) Seit Linux 4.8 werden die Nutzlastdaten beim Speichern im Tmpfs verschlüsselt, wodurch verhindert wird, dass sie in unverschlüsselten Auslagerungsspeicher geschrieben werden.

source: There are more specialized key types available also, but they aren't discussed here because they aren't intended for normal user-space use.
de: Es sind auch spezialisiertere Schlüsseltypen verfügbar, aber sie werden hier nicht beschrieben, da sie nicht für den normalen Anwendungsraum gedacht sind.

source: Key type names that begin with a period (\(aq.\(aq) are reserved to the implementation.
de: Schlüsselnamen, die mit einem Punkt (».«) beginnen, sind für die Implementierung reserviert.

source: Keyrings
de: Schlüsselbunde

source: As previously mentioned, keyrings are a special type of key that contain links to other keys (which may include other keyrings). Keys may be linked to by multiple keyrings. Keyrings may be considered as analogous to UNIX directories where each directory contains a set of hard links to files.
de: Wie bereits erwähnt, sind Schlüsselbunde besondere Schlüsseltypen, die Verweise auf andere Schlüssel enthalten (wozu auch Schlüsselbunde gehören können). Schlüssel können mit mehreren Schlüsselbunden verbunden sein. Schlüsselbunde können als Analogon zu UNIX-Verzeichnissen betrachtet werden, bei denen jedes Verzeichnis eine Reihe von harten Verweisen auf Dateien enthält.

source: Various operations (system calls) may be applied only to keyrings:
de: Auf Schlüsselbunde können verschiedene Aktionen (Systemaufrufe) durchgeführt werden:

source: Adding
de: Hinzufügen

source: A key may be added to a keyring by system calls that create keys. This prevents the new key from being immediately deleted when the system call releases its last reference to the key.
de: Durch einen Systemaufruf, der Schlüssel erstellt, kann ein Schlüssel zu einem Schlüsselbund hinzugefügt werden. Dies verhindert, dass ein neuer Schlüssel sofort gelöscht wird, wenn der Systemaufruf seine letzte Referenz auf den Schlüssel freigibt.

source: Linking
de: Verweisen

source: A link may be added to a keyring pointing to a key that is already known, provided this does not create a self-referential cycle.
de: Ein Verweis kann zu einem Schlüsselbund hinzugefügt werden, der auf einen Schlüssel zeigt, der bereits bekannt ist, vorausgesetzt, dies erzeugt keinen selbstreferenzierenden Zyklus.

source: Unlinking
de: Verweis entfernen

source: A link may be removed from a keyring. When the last link to a key is removed, that key will be scheduled for deletion by the garbage collector.
de: Ein Verweis kann von einem Schlüsselbund entfernt werden. Wenn der letzte Verweis auf einen Schlüssel entfernt wurde, wird der Schlüssel zum Löschen durch die Speicherbereinigung eingeplant.

source: Clearing
de: Bereinigen

source: All the links may be removed from a keyring.
de: Alle Verweise können von einem Schlüsselbund entfernt werden.

source: Searching
de: Suchen

source: A keyring may be considered the root of a tree or subtree in which keyrings form the branches and non-keyrings the leaves. This tree may be searched for a key matching a particular type and description.
de: Ein Schlüsselbund kann als Wurzel eines Baums oder Unterbaums betrachtet werden, bei dem Schlüsselbunde die Zweige und Nicht-Schlüsselbunde die Blätter darstellen. Dieser Baum kann nach einem Schlüssel durchsucht werden, der auf einen bestimmten Typ und Beschreibung passt.

source: See B<keyctl_clear>(3), B<keyctl_link>(3), B<keyctl_search>(3), and B<keyctl_unlink>(3) for more information.
de: Siehe B<keyctl_clear>(3), B<keyctl_link>(3), B<keyctl_search>(3) und B<keyctl_unlink>(3) für weitere Informationen.

source: Anchoring keys
de: Schlüsselverankerungen

source: To prevent a key from being garbage collected, it must be anchored to keep its reference count elevated when it is not in active use by the kernel.
de: Um zu verhindern, dass ein Schlüssel vom Speicher bereinigt wird, muss er verankert werden, um seinen Referenzzähler erhöht zu halten, wenn er vom Kernel nicht aktiv benutzt wird.

source: Keyrings are used to anchor other keys: each link is a reference on a key. Note that keyrings themselves are just keys and are also subject to the same anchoring requirement to prevent them being garbage collected.
de: Schlüsselbunde werden verwandt, um andere Schlüssel zu verankern: jede Referenz ist eine Referenz auf einen Schlüssel. Beachten Sie, dass Schlüsselbunde selbst einfach nur Schlüssel sind und den gleichen Verankerungsanforderungen unterliegen, um zu verhindern, dass sie speicherbereinigt werden.

source: The kernel makes available a number of anchor keyrings. Note that some of these keyrings will be created only when first accessed.
de: Der Kernel stellt eine Reihe von verankerten Schlüsselbunden bereit. Beachten Sie, das einige dieser Schlüsselbunde erst beim ersten Zugriff erstellt werden.

source: Process keyrings
de: Prozessschlüsselbunde

source: Process credentials themselves reference keyrings with specific semantics. These keyrings are pinned as long as the set of credentials exists, which is usually as long as the process exists.
de: Prozesszugangsberechtigungen selbst referenzieren Schlüsselbunde mit spezieller Semantik. Diese Schlüsselbunde sind angeheftet, solange die Gruppe der Zugangsberechtigungen existiert. Dies ist normalerweise so lange, wie der Prozess existiert.

source: There are three keyrings with different inheritance/sharing rules: the B<session-keyring>(7) (inherited and shared by all child processes), the B<process-keyring>(7) (shared by all threads in a process) and the B<thread-keyring>(7) (specific to a particular thread).
de: Es gibt drei Schlüsselbunde mit verschiedenen Vererbungs-/Mitbenutzungsregeln: B<session-keyring>(7) (vererbt an und von allen Kindprozessen mitbenutzt), B<process-keyring>(7) (vererbt von allen Threads in einem Prozess) und B<thread-keyring>(7) (spezifisch für einen bestimmten Thread).

source: As an alternative to using the actual keyring IDs, in calls to B<add_key>(2), B<keyctl>(2), and B<request_key>(2), the special keyring values B<KEY_SPEC_SESSION_KEYRING>, B<KEY_SPEC_PROCESS_KEYRING>, and B<KEY_SPEC_THREAD_KEYRING> can be used to refer to the caller's own instances of these keyrings.
de: Als Alternative zur Verwendung der tatsächlichen Schlüsselbundkennung können die besonderen Schlüsselbundwerte B<KEY_SPEC_SESSION_KEYRING>, B<KEY_SPEC_PROCESS_KEYRING> und B<KEY_SPEC_THREAD_KEYRING> in Aufrufen von B<add_key>(2), B<keyctl>(2) und B<request_key>(2) verwandt werden, um auf die eigenen Instanzen des Aufrufenden von diesen Schlüsselbunden zu verweisen.

source: User keyrings
de: Benutzerschlüsselbunde

source: Each UID known to the kernel has a record that contains two keyrings: the B<user-keyring>(7) and the B<user-session-keyring>(7). These exist for as long as the UID record in the kernel exists.
de: Jede dem Kernel bekannte UID hat einen Datensatz, der zwei Schlüsselbunde enthält: B<user-keyring>(7) und B<user-session-keyring>(7). Diese existieren solange wie der UID-Datensatz im Kernel existiert.

source: As an alternative to using the actual keyring IDs, in calls to B<add_key>(2), B<keyctl>(2), and B<request_key>(2), the special keyring values B<KEY_SPEC_USER_KEYRING> and B<KEY_SPEC_USER_SESSION_KEYRING> can be used to refer to the caller's own instances of these keyrings.
de: Als Alternative zur Verwendung der tatsächlichen Schlüsselbundkennungen können bei Aufrufen von B<add_key>(2), B<keyctl>(2) und B<request_key>(2) die besonderen Schlüsselbundwerte B<KEY_SPEC_USER_KEYRING> und B<KEY_SPEC_USER_SESSION_KEYRING> verwandt werden, um auf die eigenen Instanzen des Aufrufenden von diesen Schlüsselbunden zu verweisen.

source: A link to the user keyring is placed in a new session keyring by B<pam_keyinit>(8) when a new login session is initiated.
de: Durch B<pam_keyinit>(8) wird ein Verweis auf den Benutzerschlüsselbund in einem neuen Sitzungsschlüsselbund abgelegt, wenn eine neue Anmeldesitzung begonnen wird.

source: Persistent keyrings
de: Dauerhafte Schlüsselbunde

source: There is a B<persistent-keyring>(7) available to each UID known to the system. It may persist beyond the life of the UID record previously mentioned, but has an expiration time set such that it is automatically cleaned up after a set time. The persistent keyring permits, for example, B<cron>(8) scripts to use credentials that are left in the persistent keyring after the user logs out.
de: Für jede dem System bekannte UID ist ein B<persistent-keyring>(7) verfügbar. Er kann über den schon erwähnten UID-Datensatz hinaus bestehen bleiben, hat aber eine Ablaufzeit gesetzt, so dass er nach einer gesetzten Zeit automatisch bereinigt wird. Der dauerhafte Schlüsselbund erlaubt beispielsweise B<cron>(8)-Skripten, Berechtigungsnachweise zu verwenden, die im dauerhaften Schlüsselbund verbleiben, nachdem sich der Benutzer abgemeldet hat.

source: Note that the expiration time of the persistent keyring is reset every time the persistent key is requested.
de: Beachten Sie, dass die Ablaufzeit des dauerhaften Schlüsselbundes bei jeder Anfrage des dauerhaften Schlüssels zurückgesetzt wird.

source: Special keyrings
de: Besondere Schlüsselbunde

source: There are special keyrings owned by the kernel that can anchor keys for special purposes. An example of this is the I<system keyring> used for holding encryption keys for module signature verification.
de: Der Kernel besitzt besondere Schüsselbunde, die Schlüssel für besondere Zwecke verankern können. Ein Beispiel hiefür ist der I<Systemschlüsselbund>, der für das Halten der Verschlüsselungsschlüssel für Modulsignaturüberprüfung verwandt wird.

source: These special keyrings are usually closed to direct alteration by user space.
de: Diese besonderen Schlüsselbunde sind normalerweise für die Bearbeitung aus dem Anwendungsraum nicht zugänglich.

source: An originally planned "group keyring", for storing keys associated with each GID known to the kernel, is not so far implemented, is unlikely to be implemented. Nevertheless, the constant B<KEY_SPEC_GROUP_KEYRING> has been defined for this keyring.
de: Ein ursprünglich geplanter »Gruppenschlüsselbund«, zum Speichern von Schlüsseln, die jeder dem Kernel bekannten GID zugeordnet sind, ist bisher nicht implementiert und wird dies wahrscheinlich auch nicht. Trotzdem wurde die Konstante B<KEY_SPEC_GROUP_KEYRING> für diesen Schlüsselbund definiert.

source: Possession
de: Besitz

source: The concept of possession is important to understanding the keyrings security model. Whether a thread possesses a key is determined by the following rules:
de: Das Konzept des Besitzes ist zum Verständnis des Schlüsselbund-Sicherheitsmodells wichtig. Ob ein Thread einen Schlüssel besitzt, wird durch folgende Regeln bestimmt:

source: Any key or keyring that does not grant I<search> permission to the caller is ignored in all the following rules.
de: Jeder Schlüssel oder Schlüsselbund, der dem Aufrufenden keine I<Such>-Berechtigung gewährt, wird in den folgenden Regeln ignoriert.

source: A thread possesses its B<session-keyring>(7), B<process-keyring>(7), and B<thread-keyring>(7) directly because those keyrings are referred to by its credentials.
de: Ein Thread besitzt seinen B<session-keyring>(7), B<process-keyring>(7) und B<thread-keyring>(7) direkt, da diese Schlüsselbunde von seinen Zugangsberechtigungen referenziert werden.

source: If a keyring is possessed, then any key it links to is also possessed.
de: Falls ein Schlüsselbund besessen wird, dann werden auch alle darin verwiesenen Schlüssel besessen.

source: If any key a keyring links to is itself a keyring, then rule (3) applies recursively.
de: Falls ein Schlüssel, auf den ein Schlüsselbund verweist, selber wieder ein Schlüsselbund ist, dann gilt Regel (3) rekursiv.
