Repository: sebras/manpages-l10n
Catalog: po/*/man7/mailaddr.7.po
Languages: fr, it

source: NAME
fr: NOM
it: NOME

source: mailaddr - mail addressing description
fr: mailaddr – Description des adresses pour le courrier électronique
it: mailaddr - descrizione dell'indirizzamento per la posta elettronica

source: This manual page gives a brief introduction to SMTP mail addresses, as used on the Internet. These addresses are in the general format
fr: Cette page de manuel est une brève introduction aux adresses de courrier électronique SMTP telles qu'elles sont utilisées sur l'Internet. Les adresses sont dans le format général\ :
it: Questa pagina di manuale dà una breve introduzione agli indirizzi di posta elettronica SMTP, come sono usati in Internet. Tali indirizzi hanno il formato generale

source: where a domain is a hierarchical dot-separated list of subdomains. These examples are valid forms of the same address:
fr: où I<domaine> est une liste hiérarchique de sous-domaines séparés par des points. Les exemples suivants sont des formes autorisées de la même adresse\ :
it: dove dominio è una lista di sottodomini separata da punti. Questi esempi sono tutte forme valide dello stesso indirizzo:

source: The domain part ("monet.example.com") is a mail-accepting domain. It can be a host and in the past it usually was, but it doesn't have to be. The domain part is not case sensitive.
fr: La partie domaine («\ internetmobile.example.com\ ») est le nom d'un domaine qui accepte le courrier électronique. Cela peut être le nom d'un hôte et c'était généralement le cas dans le passé, mais ce n'est pas obligatoire. La partie domaine est insensible à la casse (différence capitale/minuscule).
it: La parte del dominio ("monet.example.com") è un dominio che accetta posta in ingresso. Esso può essere il nome di un host internet, e in passato solitamente lo era, ma non è obbligatorio. La parte del dominio non fa distinzione fra minuscole e maiuscole.

source: The local part ("john.doe") is often a username, but its meaning is defined by the local software. Sometimes it is case sensitive, although that is unusual. If you see a local-part that looks like garbage, it is usually because of a gateway between an internal e-mail system and the net, here are some examples:
fr: La partie locale («\ jean.dupont\ ») est généralement le nom d'un utilisateur, mais sa signification dépend des programmes locaux. Elle peut être sensible à la casse, mais c'est inhabituel. Si la partie locale d'une adresse vous semble être du charabia, c'est généralement dû à la présence d'une passerelle entre Internet et un système de courrier électronique interne, en voici quelques exemples\ :
it: La parte locale ("john.doe") è spesso un nome utente, ma il suo significato è definito dal software locale. Talvolta distingue minuscole/maiuscole, ma di solito non lo fa. Se ci si trova con una parte locale che sembra spazzatura, normalmente è a causa di un gateway tra un sistema interno di e-mail e la rete, come in questi esempi:

source: (These are, respectively, an X.400 gateway, a gateway to an arbitrary internal mail system that lacks proper internet support, an UUCP gateway, and the last one is just boring username policy.)
fr: Elles correspondent respectivement à une passerelle X.400, à une passerelle avec un système de courrier interne quelconque qui n'a pas accès à internet, à une passerelle UUCP et la dernière à une politique obscure de gestion des noms d'utilisateurs.
it: (dovuti, rispettivamente, ad un gateway X.400, un gateway per un qualche sistema interno di mail al qualche manca l'adeguato supporto internet, un gateway UUCP, e l'ultimo è solo una noiosa politica sui nomi utente).

source: The real-name part ("John Doe") can either be placed before E<lt>E<gt>, or in () at the end. (Strictly speaking the two aren't the same, but the difference is beyond the scope of this page.) The name may have to be quoted using "", for example, if it contains ".":
fr: La partie nom réel («\ Jean Dupont\ ») peut être placée soit devant la partie entre chevrons (E<lt>E<gt>) ou entre parenthèses à la fin. Strictement parlant, les deux formats ne sont pas équivalents, mais la différence sort du sujet de cette page. Le nom peut être entre guillemets ("") s'il contient «\ .\ »\ :
it: La parte del nome vero ("Eric Allman") può essere messa per prima fuori dai E<lt>E<gt>, o per ultima dentro () (per essere precisi le due cose non sono proprio la stessa cosa, ma la differenza esula lo scopo di questa pagina). Il nome può essere racchiuso tra virgolette usando "" se contiene alcuni caratteri particolari, di cui il più comune è ".":

source: Abbreviation
fr: Abréviation
it: Abbreviazioni

source: Some mail systems let users abbreviate the domain name. For instance, users at example.com may get away with "john.doe@monet" to send mail to John Doe. I<This behavior is deprecated.> Sometimes it works, but you should not depend on it.
fr: Plusieurs systèmes de courriels permettent à leurs utilisateurs d'abréger leur nom de domaine. Par exemple, les utilisateurs au sein de example.com peuvent utiliser «\ jean.dupont@internetmobile\ » pour écrire à Jean Dupont. I<Ce format est obsolète>. Parfois il fonctionne, mais il ne faut pas en dépendre.
it: Alcuni sistemi di posta elettronica permettono agli utenti di abbreviare il nome del dominio. Per esempio, gli utenti a example.com possono mandare mail a John Doe usando "john.doe@monet". I<Questo comportamento è deprecato>. Talvolta funziona, ma non deve dipendere da esso.

source: Route-addrs
fr: Adresses de routage.
it: Indirizzi di instradamento

source: In the past, sometimes one had to route a message through several hosts to get it to its final destination. Addresses which show these relays are termed "route-addrs". These use the syntax:
fr: Dans le passé, le message devait parfois être routé à travers plusieurs hôtes pour qu'il atteigne sa destination finale. Les adresses où ces relais apparaissent sont appelées des adresses de routage (route-addrs). Elles utilisent la syntaxe\ :
it: In alcune circostanze può essere necessario instradare un messaggio attraverso diversi host per raggiungere la destinazione finale. Gli indirizzi che mostrano queste ritrasmissioni sono detti "indirizzi route" (route-addrs). Questi usano la sintassi:

source: This specifies that the message should be sent to hosta, from there to hostb, and finally to hostc. Many hosts disregard route-addrs and send directly to hostc.
fr: Cela indique que le message doit être envoyé à hôte_a, qui l'enverra à hôte_b, qui le transmettra finalement à hôte_c. Beaucoup d'hôtes ne traitent pas les adresses de routage et envoient directement à hôte_c.
it: Ciò specifica che il messaggio dovrebbe essere spedito a hostA, da qua a hostB, e alla fine a hostC. Alcuni host non tengono in considerazione gli indirizzi route e spediscono direttamente a hostC.

source: Route-addrs are very unusual now. They occur sometimes in old mail archives. It is generally possible to ignore all but the "user@hostc" part of the address to determine the actual address.
fr: Les adresses de routages sont très rarement utilisées aujourd'hui. Elles apparaissent parfois dans de vieilles archives de messages électroniques. Il est généralement possible de tout ignorer sauf la partie «\ utilisateur@hôte_c\ » de l'adresse pour déterminer l'adresse réelle.
it: I route-addrs oggi sono molto rari. Essi si trovano talvolta in vecchi archivi mail. Di solito è possibile ignorre tutto tranne la parte "user@hostc" dell'indirizzo per determinare l'indirizzo giusto.

source: Postmaster
fr: Administrateur du courrier.

source: Every site is required to have a user or user alias designated "postmaster" to which problems with the mail system may be addressed. The "postmaster" address is not case sensitive.
fr: Chaque site doit avoir un utilisateur ou un alias d’utilisateur appelé «\ postmaster\ » à qui les réclamations concernant le courrier seront adressées. L'adresse «\ postmaster\ » est insensible à la casse.
it: Ad ogni sito è richiesto di avere un utente o un alias per un utente designato "postmaster" al quale possono essere indirizzati i problemi con il sistema delle mail. L'indirizzo del "postmaster" non fa distinzione tra minuscole e maiuscole.

source: FILES
fr: FICHIERS
it: FILE

source: SEE ALSO
fr: VOIR AUSSI
it: VEDERE ANCHE

source: Linux User's Manual
fr: Manuel de l'utilisateur Linux
it: Manuale dell'utente Linux

source: user@domain
fr: utilisateur@domaine
it: utente@dominio

source: john.doe@monet.example.com
fr: jean.dupont@internetmobile.example.com

source: John Doe E<lt>john.doe@monet.example.comE<gt>
fr: Jean Dupont E<lt>jean.dupont@internetmobile.example.comE<gt>

source: john.doe@monet.example.com (John Doe)
fr: jean.dupont@internetmobile.example.com (Jean Dupont)

source: "surname/admd=telemail/c=us/o=hp/prmd=hp"@some.where
fr: "nom/admd=telemail/c=us/o=hp/prmd=hp"@quelque.part
it: "cognome/admd=telemail/c=us/o=hp/prmd=hp"@in.un.posto

source: USER%SOMETHING@some.where
fr: UTILISATEUR%QUELQUECHOSE@quelque.part
it: UTENTE%QUALCOSA@da.qualche.parte

source: machine!machine!name@some.where
fr: machine!machine!nom@quelque.part
it: macchina!macchina!nome@da.qualche.parte

source: I2461572@some.where
fr: I2461572@quelque.part
it: I2461572@da.qualche.parte

source: "John Q. Doe" E<lt>john.doe@monet.example.comE<gt>
fr: "Jean P. Dupont" E<lt>jean.dupont@internetmobile.example.comE<gt>

source: E<lt>@hosta,@hostb:user@hostcE<gt>
fr: E<lt>@hôte_a,@hôte_b:utilisateur@hôte_cE<gt>

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: DESCRIPTION
it: DESCRIZIONE
