Repository: sebras/manpages-l10n
Catalog: po/*/man7/man-pages.7.po
Languages: de

source: A list of authors of the documentation or program.
de: Eine Liste der Autoren der Dokumentation oder des Programms

source: B<Use of an AUTHORS section is strongly discouraged>. Generally, it is better not to clutter every page with a list of (over time potentially numerous) authors; if you write or significantly amend a page, add a copyright notice as a comment in the source file. If you are the author of a device driver and want to include an address for reporting bugs, place this under the BUGS section.
de: B<Von einem AUTHORS-Bereich wird entschieden abgeraten>. Allgemein ist es besser, nicht jede Seite mit einer Liste von (im Laufe der Zeit potenziell zahlreichen) Autoren vollzustopfen. Wenn Sie eine Seite schreiben oder signifikant verändern, fügen Sie einen Copyright-Vermerk als Kommentar in die Quelldatei ein. Wenn Sie der Autor eines Gerätetreibers sind und eine Adresse für das Melden von Fehlern angeben wollen, tun Sie das im Abschnitt FEHLER.

source: The I<man-pages> project doesn't use a REPORTING BUGS section in manual pages. Information on reporting bugs is instead supplied in the script-generated COLOPHON section. However, various projects do use a REPORTING BUGS section. It is recommended to place it near the foot of the page.
de: Das Projekt I<man-pages> verwendet keinen Abschnitt REPORTING BUGS in den Handbuchseiten. Informationen zum Melden von Fehlern werden stattdessen in dem per Skript erzeugten Abschnitt COLOPHON bereitgestellt. Dennoch verwenden verschiedene Projekte einen Abschnitt REPORTING BUGS. Es wird empfohlen, diesen nahe dem Ende der Seite zu platzieren.

source: The I<man-pages> project doesn't use a COPYRIGHT section in manual pages. Copyright information is instead maintained in the page source. In pages where this section is present, it is recommended to place it near the foot of the page, just above SEE ALSO.
de: Das Projekt I<man-pages> verwendet keinen Abschnitt COPYRIGHT in den Handbuchseiten. Urheberrechtliche Informationen werden stattdessen im Seitenquelltext gepflegt. In Seiten, die diesen Abschnitt verwenden, wird empfohlen, diesen nahe dem Ende der Seite direkt oberhalb von SEE ALSO zu platzieren.

source: A comma-separated list of related man pages, possibly followed by other related pages or documents.
de: Eine durch Kommata gegliederte Liste thematisch verwandter Handbuchseiten; manchmal folgen weitere Handbuchseiten oder Dokumente mit inhaltlichem Bezug

source: The list should be ordered by section number and then alphabetically by name. Do not terminate this list with a period.
de: Die Liste sollte nach Abschnittsnummern und in den Abschnitten alphabetisch sortiert werden. Schließen Sie die Liste nicht mit einem Punkt ab.

source: Where the SEE ALSO list contains many long manual page names, to improve the visual result of the output, it may be useful to employ the I<.ad l> (don't right justify) and I<.nh> (don't hyphenate) directives. Hyphenation of individual page names can be prevented by preceding words with the string "\e%".
de: Wenn die »SEE ALSO«-Liste viele lange Namen von Handbuchseiten enthält, kann es zur Verbesserung der visuellen Darstellung sinnvoll sein, die Anweisungen I<.ad l> (nicht rechts anordnen) und I<.nh> (keine Silbentrennung) zu verwenden. Die Silbentrennung individueller Seitennamen können Sie vermeiden, indem Sie den Wörtern die Zeichenkette »\e%« voranstellen.

source: Given the distributed, autonomous nature of FOSS projects and their documentation, it is sometimes necessary\(emand in many cases desirable\(emthat the SEE ALSO section includes references to manual pages provided by other projects.
de: Aufgrund der autonomen und verteilten Natur von FOSS-Projekten und ihrer Dokumentation ist es manchmal notwendig – und in vielen Fällen wünschenswert –, dass der Abschnitt »SIEHE AUCH« Referenzen auf Handbuchseiten von anderen Projekten enthält.

source: FORMATTING AND WORDING CONVENTIONS
de: KONVENTIONEN ZU WORTWAHL UND FORMATIERUNG

source: The following subsections note some details for preferred formatting and wording conventions in various sections of the pages in the I<man-pages> project.
de: In den folgenden Unterabschnitten finden Sie einige Details für die bevorzugten Formatierungs- und Wortwahlkonventionen in den verschiedenen Abschnitten der Seiten im I<man-pages>-Projekt.

source: Wrap the function prototype(s) in a I<.nf>/I<.fi> pair to prevent filling.
de: Brechen Sie Funktionsprototypen in einem I<.nf>/I<.fi>-Paar um, damit Auffüllung vermieden wird.

source: In general, where more than one function prototype is shown in the SYNOPSIS, the prototypes should I<not> be separated by blank lines. However, blank lines (achieved using I<.PP>) may be added in the following cases:
de: Im Allgemeinen sollten Sie immer, wenn im Abschnitt SYNOPSIS mehrere Funktionsprototypen aufgeführt sind, diese I<nicht> durch Leerzeilen trennen. Jedoch dürfen Leerzeilen (mit I<.PP>) in folgenden Fällen hinzugefügt werden:

source: to separate long lists of function prototypes into related groups (see for example B<list>(3));
de: um lange Listen von Funktionsprototypen in logische Gruppen zu unterteilen (ein Beispiel finden Sie in B<list>(3));

source: in other cases that may improve readability.
de: in anderen Fällen, wo dies die Lesbarkeit verbessert.

source: In the SYNOPSIS, a long function prototype may need to be continued over to the next line. The continuation line is indented according to the following rules:
de: Im Abschnitt SYNOPSIS darf ein langer Funktionsprototyp in der nächsten Zeile fortgesetzt werden. Der Einzug der Fortsetzungszeile geschieht nach den folgenden Regeln:

source: If there is a single such prototype that needs to be continued, then align the continuation line so that when the page is rendered on a fixed-width font device (e.g., on an xterm) the continuation line starts just below the start of the argument list in the line above. (Exception: the indentation may be adjusted if necessary to prevent a very long continuation line or a further continuation line where the function prototype is very long.) As an example:
de: Falls eine einzelne Zeile eines solchen Prototyps fortgesetzt werden muss, richten Sie die Fortsetzungszeile so aus, dass später bei der Darstellung in einer dicktengleichen Schrift (zum Beispiel in einem xterm) die Fortsetzungszeile direkt unter dem Anfang der Argumentliste eine Zeile darüber beginnt. Eine Ausnahme wäre, wenn der der Funktionsprototyp sehr lang ist und der Einzug notfalls angepasst werden muss, um eine sehr lange oder eine weitere Fortsetzungszeile zu vermeiden. Ein Beispiel:

source: But, where multiple functions in the SYNOPSIS require continuation lines, and the function names have different lengths, then align all continuation lines to start in the same column. This provides a nicer rendering in PDF output (because the SYNOPSIS uses a variable width font where spaces render narrower than most characters). As an example:
de: Sollten aber mehrere Funktionen im Abschnitt SYNOPSIS Fortsetzungszeilen erfordern und die Funktionsnamen unterschiedlich lang sein, richten Sie die Fortsetzungszeilen so aus, dass sie alle in der gleichen Spalte beginnen. Dadurch ergibt sich in der PDF-Ausgabe eine wesentlich bessere Darstellung, da der SYNOPSIS-Abschnitt eine Schrift variabler Breite verwendet, wodurch Leerzeichen schmaler dargestellt werden als die meisten anderen Zeichen. Ein Beispiel:

source: The preferred wording to describe how I<errno> is set is "I<errno> is set to indicate the error" or similar. This wording is consistent with the wording used in both POSIX.1 and FreeBSD.
de: Die bevorzugte Formulierung für das Setzen von I<errno> ist »I<errno> is set to indicate the error« oder ähnlich. Diese Formulierung ist zu denen in POSIX.1 und FreeBSD konsistent.

source: Note the following:
de: Beachten Sie Folgendes:

source: Wrap the table in this section in a I<.ad\ l>/I<.ad> pair to disable text filling and a I<.nh>/I<.hy> pair to disable hyphenation.
de: Brechen Sie die Tabelle in diesem Abschnitt in ein I<.ad\ l>/I<.ad>-Paar um, um Textauffüllung zu vermeiden, und ein I<.nh>/I<.hy>-Paar, um die Silbentrennung zu verhindern.

source: Ensure that the table occupies the full page width through the use of an I<lbx> description for one of the columns (usually the first column, though in some cases the last column if it contains a lot of text).
de: Stellen Sie sicher, dass die Tabelle die gesamte Seitenbreite einnimmt, indem Sie eine I<lbx>-Beschreibung für eine der Spalten verwenden (normalerweise die erste Spalte, in einigen Fällen jedoch die letzte Spalte, falls sie viel Text enthält).

source: Make free use of I<T{>/I<T}> macro pairs to allow table cells to be broken over multiple lines (also bearing in mind that pages may sometimes be rendered to a width of less than 80 columns).
de: Verwenden Sie so viele I<T{>/I<T}>-Makro-Paare wie möglich, um damit Zeilen in den Tabellenzellen umzubrechen. Denken Sie auch daran, dass Seiten gelegentlich mit weniger als 80 Zeichen Breite dargestellt werden.

source: For examples of all of the above, see the source code of various pages.
de: Beispiele für alles vorstehend Aufgeführte finden Sie im Quelltext diverser Seiten.

source: STYLE GUIDE
de: STIL-RICHTLINIEN

source: The following subsections describe the preferred style for the I<man-pages> project. For details not covered below, the Chicago Manual of Style is usually a good source; try also grepping for preexisting usage in the project source tree.
de: Die folgenden Unterabschnitte beschreiben den bevorzugten Stil für das Projekt I<man-pages>. Im Folgenden nicht erwähnte Details finden Sie möglicherweise im Chicago Manual of Style. Versuchen sie auch, im Verzeichnisbaum des Projekts nach bereits vorhandenen Beispielen bestimmter Anwendungsfälle zu suchen.

source: Use of gender-neutral language
de: Geschlechtsneutrale Begriffswahl

source: As far as possible, use gender-neutral language in the text of man pages. Use of "they" ("them", "themself", "their") as a gender-neutral singular pronoun is acceptable.
de: Verwenden Sie, soweit möglich, eine geschlechtsneutrale Schreibweise in den Texten Ihrer Handbuchseiten. Die Verwendung von »they« (»them«, »themself«, »their«) als geschlechtsneutrales Pronomen für den Singular ist akzeptabel.

source: Formatting conventions for manual pages describing commands
de: Konventionen für die Formatierung von Handbuchseiten, die Befehle beschreiben

source: For manual pages that describe a command (typically in Sections 1 and 8), the arguments are always specified using italics, I<even in the SYNOPSIS section>.
de: Bei Handbuchseiten, die einen Befehl beschreiben (typischerweise in Abschnitt 1 und 8), werden die Argumente immer in kursiv spezifiziert, I<selbst im Abschnitt SYNOPSIS>.

source: The name of the command, and its options, should always be formatted in bold.
de: Der Name des Befehls und seine Optionen sollten stets fett formatiert werden.

source: Formatting conventions for manual pages describing functions
de: Konventionen für die Formatierung von Handbuchseiten, die Funktionen beschreiben

source: For manual pages that describe functions (typically in Sections 2 and 3), the arguments are always specified using italics, I<even in the SYNOPSIS section>, where the rest of the function is specified in bold:
de: Bei Handbuchseiten, die Funktionen beschreiben (typischerweise in Abschnitt 2 und 3), werden die Argumente immer in kursiv spezifiziert, I<selbst im Abschnitt SYNOPSIS>, wobei der Rest der Funktion in fett spezifiziert wird:

source: B< int myfunction(int >I<argc>B<, char **>I<argv>B<);>
de: B< int meineFunktion(int >I<argc>B<, char **>I<argv>B<);>

source: Variable names should, like argument names, be specified in italics.
de: Variablennamen sollten wie die Namen von Argumenten kursiv geschrieben werden.

source: Any reference to the subject of the current manual page should be written with the name in bold followed by a pair of parentheses in Roman (normal) font. For example, in the B<fcntl>(2) man page, references to the subject of the page would be written as: B<fcntl>(). The preferred way to write this in the source file is:
de: Jeder Hinweis auf den Gegenstand der aktuellen Handbuchseite sollte mit diesem Namen in Fettschrift geschrieben werden, gefolgt von einem Paar Klammern in Normalschrift (Roman). Zum Beispiel würden in der Handbuchseite von B<fcntl>(2) Verweise auf das Thema der Seite als B<fcntl>() geschrieben werden. Die empfohlene Schreibweise in der Quelldatei ist

source: (Using this format, rather than the use of "\efB...\efP()" makes it easier to write tools that parse man page source files.)
de: Die Verwendung dieses Formats anstatt »\efB…\efP()« erleichtert die Entwicklung von Werkzeugen für die Auswertung von Handbuch-Quelltexten.

source: Use semantic newlines
de: Semantische Zeilenvorschübe verwenden

source: Formatting conventions (general)
de: Formatierungskonventionen (Allgemeines)

source: Paragraphs should be separated by suitable markers (usually either I<.PP> or I<.IP>). Do I<not> separate paragraphs using blank lines, as this results in poor rendering in some output formats (such as PostScript and PDF).
de: Absätze sollten mit geeigneten Markierungen voneinander getrennt werden (üblicherweise entweder I<.PP> oder I<.IP>). Trennen Sie Absätze I<nicht> durch Einfügen von Leerzeilen, da diese Darstellungsfehler in einigen Ausgabeformaten verursachen (wie PostScript und PDF).

source: Filenames (whether pathnames, or references to header files) are always in italics (e.g., I<E<lt>stdio.hE<gt>>), except in the SYNOPSIS section, where included files are in bold (e.g., B<#include E<lt>stdio.hE<gt>>). When referring to a standard header file include, specify the header file surrounded by angle brackets, in the usual C way (e.g., I<E<lt>stdio.hE<gt>>).
de: Dateinamen (ob Pfadnamen oder Verweise auf Header-Dateien) werden immer kursiv gesetzt (z. B. I<E<lt>stdio.hE<gt>>), außer in der SYNOPSIS, wo eingefügte Dateien fett geschrieben werden (z. B. B<#include E<lt>stdio.hE<gt>>). Wenn Sie auf die Einbindung einer Standard-Header-Datei verweisen, setzen Sie die Header-Datei wie in C gebräuchlich in spitze Klammern (z.B. I<E<lt>stdio.hE<gt>>).

source: Special macros, which are usually in uppercase, are in bold (e.g., B<MAXINT>). Exception: don't boldface NULL.
de: Spezielle Makros, die in der Regel mit Großbuchstaben geschrieben werden, werden in Fettdruck gesetzt (z.B. B<MAXINT>). Ausnahme: Schreiben Sie NULL nicht fett.

source: When enumerating a list of error codes, the codes are in bold (this list usually uses the B<\&.TP> macro).
de: Bei der Aufzählung einer Liste von Fehlercodes werden die Codes in Fettschrift geschrieben. (Diese Liste verwendet in der Regel das Makro B<\&.TP>.)

source: Complete commands should, if long, be written as an indented line on their own, with a blank line before and after the command, for example
de: Vollständige Befehle sollten, wenn sie lang sind, eine eigene, eingerückte Zeile bekommen, der eine Leerzeile vor- und nachgestellt wird, zum Beispiel:

source: If the command is short, then it can be included inline in the text, in italic format, for example, I<man 7 man-pages>. In this case, it may be worth using nonbreaking spaces ("\e\ ") at suitable places in the command. Command options should be written in italics (e.g., I<-l>).
de: Kurze Befehle können, kursiv gesetzt, in den laufenden Text aufgenommen werden; z. B. I<man 7 man-pages>. In diesem Fall kann es sich lohnen, an geeigneten Stellen in der Befehlszeile geschützte Leerzeichen ("\e\ ") zu verwenden. Befehlsoptionen sollten kursiv geschrieben werden (z. B. I<-l>).

source: Expressions, if not written on a separate indented line, should be specified in italics. Again, the use of nonbreaking spaces may be appropriate if the expression is inlined with normal text.
de: Ausdrücke sollten kursiv gesetzt werden, wenn Sie nicht auf einer separaten Zeile eingerückt geschrieben werden. Auch hier kann die Verwendung von geschützten Leerzeichen angezeigt sein, wenn der Ausdruck in den Fließtext integriert ist.

source: When showing example shell sessions, user input should be formatted in bold, for example
de: Bei der Angabe von Shell-Sitzungen sollte die Benutzereingabe stets fett formatiert werden, bespielsweise

source: $ B<date> Thu Jul 7 13:01:27 CEST 2016
de: $ B<date> Do Jul 7 13:01:27 CEST 2016

source: Any reference to another man page should be written with the name in bold, I<always> followed by the section number, formatted in Roman (normal) font, without any separating spaces (e.g., B<intro>(2)). The preferred way to write this in the source file is:
de: Jeder Verweis auf eine andere Handbuchseite sollte den Namen in Fettschrift darstellen und I<immer> ohne Leerzeichen von der Nummer des Abschnitts in Normalschrift (Roman) gefolgt werden; (z. B. B<intro>(2)). Die empfohlene Schreibweise in der Quelldatei ist

source: (Including the section number in cross references lets tools like B<man2html>(1) create properly hyperlinked pages.)
de: (Die Angabe der Abschnittsnummer in Querverweisen ermöglicht es Werkzeugen wie B<man2html>(1), korrekte Hyperlinks zu erstellen.)

source: Control characters should be written in bold face, with no quotes; for example, B<\(haX>.
de: Steuerzeichen sollten in Fettschrift ohne Anführungszeichen geschrieben werden, beispielsweise B<\(haX>.

source: Spelling
de: Rechtschreibung

source: Starting with release 2.59, I<man-pages> follows American spelling conventions (previously, there was a random mix of British and American spellings); please write all new pages and patches according to these conventions.
de: Seit Release 2.39 folgen die I<man-pages> der amerikanischen Rechtschreibung (vorher bestanden sie aus einer zufälligen Mischung aus britischer und amerikanischer Rechtschreibung). Bitte verfassen Sie alle neuen Seiten und Patches nach diesen Konventionen.

source: Aside from the well-known spelling differences, there are a few other subtleties to watch for:
de: Abgesehen von den gut bekannten Rechtschreibunterschieden gibt es ein paar weitere Feinheiten, auf die Sie achten sollten:

source: American English tends to use the forms "backward", "upward", "toward", and so on rather than the British forms "backwards", "upwards", "towards", and so on.
de: Amerikanisches Englisch tendiert zu den Formen »backward«, »upward«, »toward« und so weiter, während im britischen Englisch eher »backwards«, »upwards«, »towards«, und so weiter verwendet werden.

source: Opinions are divided on "acknowledgement" vs "acknowledgment". The latter is predominant, but not universal usage in American English. POSIX and the BSD license use the former spelling. In the Linux man-pages project, we use "acknowledgement".
de: Hinsichtlich »acknowledgement« bzw. »acknowledgment« gehen die Meinungen auseinander. Letzteres dominiert, wird aber im amerikanischen Englisch nicht universell verwendet. POSIX und die BSD-Lizenz verwenden die erstgenannte Schreibweise. Im Linux-man-pages-Projekt verwenden wir »acknowledgement«.

source: BSD version numbers
de: BSD-Versionsnummern

source: The classical scheme for writing BSD version numbers is I<x.yBSD>, where I<x.y> is the version number (e.g., 4.2BSD). Avoid forms such as I<BSD 4.3>.
de: Das klassische Schema zum Schreiben von BSD-Versionsnummern lautet I<x.yBSD>, wobei I<x.y> die Versionsnummer ist (z.B. 4.2BSD). Vermeiden Sie Formen der Art I<BSD 4.3>.

source: Capitalization
de: Großschreibung

source: In subsection ("SS") headings, capitalize the first word in the heading, but otherwise use lowercase, except where English usage (e.g., proper nouns) or programming language requirements (e.g., identifier names) dictate otherwise. For example:
de: In den Überschriften der Unterabschnitte (»SS«) schreiben Sie das erste Wort groß, die anderen Wörter dagegen nicht, es sei denn, die Konventionen der englischen Sprache (zum Beispiel Eigennamen) oder Erfordernisse der Programmiersprache (zum Beispiel Identifizierernamen) erzwingen die Abweichung von dieser Regel. Beispiel:

source: Indentation of structure definitions, shell session logs, and so on
de: Einzug bei Strukturdefinitionen, Protokollen von Shell-Sitzungen und so weiter.

source: When structure definitions, shell session logs, and so on are included in running text, indent them by 4 spaces (i.e., a block enclosed by I<.in\ +4n> and I<.in>), format them using the I<.EX> and I<EE> macros, and surround them with suitable paragraph markers (either I<.PP> or I<.IP>). For example:
de: Wenn Struktur-Definitionen, Protokolle von Shell-Sitzungen usw. im laufenden Text eingefügt werden, rücken Sie diese um 4 Leerzeichen ein (d. h. umschließen Sie den Block mit I<.in\ +4n> und I<.in>), formatieren Sie sie mittels der Makros I<.EX> und I<EE> und schließen Sie sie mit geeigneten Absatzmarkierungen (entweder I<.PP> oder I<.IP>) ein. Beispiel:

source: Preferred terms
de: Bevorzugte Begriffe

source: The following table lists some preferred terms to use in man pages, mainly to ensure consistency across pages.
de: Die folgende Tabelle führt einige bevorzugte Begriffe auf, die in Handbuchseiten verwendet werden sollten, hauptsächlich um Konsistenz innerhalb der Sammlung der Handbuchseiten sicherzustellen.

source: Term
de: Begriff

source: Avoid using
de: Nicht verwenden

source: Notes
de: Hinweise

source: For the UNIX Epoch (00:00:00, 1 Jan 1970 UTC)
de: Für den Beginn der UNIX-Zeitrechnung (00:00:00, 1. Januar 1970 UTC)

source: filename
de: Dateiname

source: filesystem
de: Dateisystem

source: hostname
de: Rechnername

source: Except if referring to result of "uname\ -m" or similar
de: Außer beim Verweis auf das Ergebnis von »uname\ -m« oder ähnlichem

source: See also the discussion I<Hyphenation of attributive compounds> below.
de: Siehe auch den nachfolgenden Abschnitt I<Bindestriche in attributiven Zusammensetzungen>.

source: Terms to avoid
de: Zu vermeidende Ausdrücke

source: The following table lists some terms to avoid using in man pages, along with some suggested alternatives, mainly to ensure consistency across pages.
de: Die folgende Tabelle führt einige Ausdrücke (zusammen mit Alternativen) auf, die in Handbuchseiten vermieden werden sollten, hauptsächlich um Konsistenz innerhalb der Sammlung der Handbuchseiten sicherzustellen.

source: Avoid
de: Vermeiden

source: Use instead
de: Stattdessen

source: same for 8-bit, 16-bit, etc.
de: ebenfalls für 8-bit, 16-bit usw.

source: A common mistake made by kernel programmers when writing man pages
de: Ein häufiger Fehler der Kernel-Programmierer beim Schreiben von Handbuchseiten

source: Trademarks
de: Geschützte Marken

source: Use the correct spelling and case for trademarks. The following is a list of the correct spellings of various relevant trademarks that are sometimes misspelled:
de: Verwenden Sie die korrekte Schreibweise für geschützte Marken. Nachfolgend finden Sie eine Liste der korrekten Schreibweisen diverser relevanter Marken, die gelegentlich falsch geschrieben werden:

source: A I<null pointer> is a pointer that points to nothing, and is normally indicated by the constant I<NULL>. On the other hand, I<NUL> is the I<null byte>, a byte with the value 0, represented in C via the character constant I<\(aq\e0\(aq>.
de: Ein I<null pointer> ist ein Zeiger, der auf nichts verweist. Er wird normalerweise durch die Konstante I<NULL> angegeben. Andererseits bezeichnet I<NUL> das I<NULL-Byte>, ein Byte mit dem Wert 0, das in C durch die Zeichenkonstante I<\(aq\e0\(aq> ausgedrückt wird.

source: The preferred term for the pointer is "null pointer" or simply "NULL"; avoid writing "NULL pointer".
de: Der bevorzugte Begriff für den Zeiger ist »null pointer« oder einfach »NULL«, bitte schreiben Sie nicht »NULL pointer«.
