Repository: sebras/manpages-l10n
Catalog: po/*/man7/man-pages.7.po
Languages: de

source: The preferred term for the byte is "null byte". Avoid writing "NUL", since it is too easily confused with "NULL". Avoid also the terms "zero byte" and "null character". The byte that terminates a C string should be described as "the terminating null byte"; strings may be described as "null-terminated", but avoid the use of "NUL-terminated".
de: Der bevorzugte Begriff für das Byte ist »null byte«. Bitte schreiben Sie nicht »NUL«, da es zu leicht mit »NULL« verwechselt werden kann. Vermeiden Sie auch die Begriffe »zero byte« und »null character«. Das Byte, das eine C-Zeichenkette beendet, sollte als »the terminating null byte« beschrieben werden. Zeichenketten können als »null-terminated« bezeichnet werden, vermeiden Sie dagegen »NUL-terminated«.

source: For hyperlinks, use the I<.UR>/I<.UE> macro pair (see B<groff_man>(7)). This produces proper hyperlinks that can be used in a web browser, when rendering a page with, say:
de: Verwenden Sie für Hyperlinks das Makropaar I<.UR>/I<.UE> (siehe B<groff_man>(7)). Dieses erzeugt intakte Hyperlinks, die in einem Webbrowser geöffnet werden können, wenn die Seite etwa folgendermaßen dargestellt wird:

source: BROWSER=firefox man -H pagename
de: BROWSER=firefox man -H Seitenname

source: Use of e.g., i.e., etc., a.k.a., and similar
de: Verwendung von e.g., i.e., etc., a.k.a. und ähnlichem

source: In general, the use of abbreviations such as "e.g.", "i.e.", "etc.", "cf.", and "a.k.a." should be avoided, in favor of suitable full wordings ("for example", "that is", "and so on", "compare to", "also known as").
de: Im Allgemeinen sollten Abkürzungen wie »e.g.«, »i.e.«, »etc.«, »cf.« und »a.k.a.« vermieden werden. Schreiben Sie die Wörter stattdessen aus: »for example«, »that is«, »and so on«, »compare to«, »also known as«.

source: The only place where such abbreviations may be acceptable is in I<short> parenthetical asides (e.g., like this one).
de: Die einzige Stelle, wo solche Abkürzungen akzeptabel sind, ist in I<kurzen> in Klammern gesetzten Anmerkungen (z.B. wie in dieser hier).

source: Always include periods in such abbreviations, as shown here. In addition, "e.g." and "i.e." should always be followed by a comma.
de: Verwenden Sie stets Punkte in solchen Abkürzungen, wie hier gezeigt. Zusätzlich sollte auf »e.g.« und »i.e.« stets ein Komma folgen.

source: Em-dashes
de: Em-Gedankenstriche

source: The way to write an em-dash\(emthe glyph that appears at either end of this subphrase\(emin *roff is with the macro "\e(em". (On an ASCII terminal, an em-dash typically renders as two hyphens, but in other typographical contexts it renders as a long dash.) Em-dashes should be written I<without> surrounding spaces.
de: Einen em-Gedankenstrich – das Zeichen, das an beiden Enden dieses Satzteiles steht –, setzen Sie in *roff mit dem Makro »\e(em«. (Auf einem ASCII-Terminal wird ein em-Gedankenstrich üblicherweise als zwei Bindestriche, in anderen typografischen Kontexten als langer Gedankenstrich dargestellt.) Em-Gedankenstriche sollten I<ohne> vor- und nachstehendes Leerzeichen geschrieben werden.

source: Hyphenation of attributive compounds
de: Bindestriche in attributiven Zusammensetzungen

source: Compound terms should be hyphenated when used attributively (i.e., to qualify a following noun). Some examples:
de: Zusammengesetzte Begriffe sollten mit Bindestrich geschrieben werden, wenn Sie als Attribut verwendet werden, zum Beispiel, um ein nachfolgendes Nomen näher zu bestimmen. Einige Beispiele:

source: Hyphenation with multi, non, pre, re, sub, and so on
de: Zusammensetzungen mit multi, non, pre, re, sub, usw.

source: The general tendency in modern English is not to hyphenate after prefixes such as "multi", "non", "pre", "re", "sub", and so on. Manual pages should generally follow this rule when these prefixes are used in natural English constructions with simple suffixes. The following list gives some examples of the preferred forms:
de: Die allgemeine Tendenz im modernen Englisch ist es, nach Präfixen wie »multi«, »non«, »pre«, »re« oder »sub« keinen Bindestrich zu setzen. Die Handbuchseiten sollten generell dieser Regel folgen, wenn diese Präfixe in nativen englischen Konstrukten mit einfachen Suffixen verwendet werden. Die folgende Liste zeigt einige Beispiele der bevorzugten Formen:

source: Hyphens should be retained when the prefixes are used in nonstandard English words, with trademarks, proper nouns, acronyms, or compound terms. Some examples:
de: Bindestriche sollten gesetzt werden, wenn die Präfixe in Wörtern verwendet werden, die nicht zum englischen Standardwortschatz gehören, wie geschützte Marken, Eigennamen, Akronyme oder zusammengesetzte Begriffe. Einige Beispiele:

source: Finally, note that "re-create" and "recreate" are two different verbs, and the former is probably what you want.
de: Beachten Sie auch, dass »re-create« und »recreate« zwei Verben unterschiedlicher Bedeutung sind. Das erstere dürfte vermutlich jenes sein, was Sie benötigen.

source: Generating optimal glyphs
de: Erzeugen optimaler Glyphen

source: Where a real minus character is required (e.g., for numbers such as -1, for man page cross references such as B<utf-8>(7), or when writing options that have a leading dash, such as in I<ls\ -l>), use the following form in the man page source:
de: Wo ein echtes Minus-Zeichen benötigt wird, zum Beispiel für die Zahl -1, für Kreuzreferenzen zu anderen Handbuchseiten wie B<utf-8>(7) oder bei Optionen mit einem vorangestelltem Bindestrich, wie in I<ls\ -l>, verwenden Sie die folgende Form im Quelltext der Handbuchseite:

source: This guideline applies also to code examples.
de: Diese Richtlinie gilt auch für Code-Beispiele.

source: The use of real minus signs serves the following purposes:
de: Die Verwendung des echten Minuszeichens erfüllt die folgenden Zwecke:

source: To provide better renderings on various targets other than ASCII terminals, notably in PDF and on Unicode/UTF-8-capable terminals.
de: Verbesserung der Darstellung für verschiedene Ziele. Dies gilt insbesondere für die PDF-Ausgabe und Terminals, die Unicode/UTF-8 darstellen können, allerdings nicht für reine ASCII-Terminals.

source: To generate glyphs that when copied from rendered pages will produce real minus signs when pasted into a terminal.
de: Erzeugen von Glyphen, die beim Kopieren von dargestellten Seiten beim Einfügen in ein Terminal echte Minuszeichen erzeugen.

source: To produce unslanted single quotes that render well in ASCII, UTF-8, and PDF, use "\e(aq" ("apostrophe quote"); for example
de: Um einfache Anführungszeichen zu verwenden, die in ASCII, in UTF-8 und in PDF korrekt dargestellt werden können, verwenden Sie "\e(aq" ("Apostroph-Zitatzeichen"); zum Beispiel

source: where I<C> is the quoted character. This guideline applies also to character constants used in code examples.
de: wobei I<C> das zitierte Zeichen ist. Diese Richtlinie ist auch auf Zeichenkonstanten und in code-Beispielen anzuwenden.

source: Where a proper caret (\(ha) that renders well in both a terminal and PDF is required, use "\e(ha". This is especially necessary in code samples, to get a nicely rendered caret when rendering to PDF.
de: Wo ein korrektes Zirkumflex-Zeichen (\(ha) benötigt wird, das sowohl im Terminal als auch im PDF gut dargestellt wird, verwenden Sie »\e(ha«. Dies ist insbesondere in Beispielcode erforderlich, um in der daraus erzeugten PDF-Darstellung ein ansehnliches Zirkumflex zu erhalten.

source: Using a naked "\(ti" character results in a poor rendering in PDF. Instead use "\e(ti". This is especially necessary in code samples, to get a nicely rendered tilde when rendering to PDF.
de: Die Verwendung eines nackten »\(ti«-Zeichens führt zu einer fehlerhaften Darstellung in PDF. Verwenden Sie stattdessen »\e(ti«. Dies ist insbesondere in Beispielcode erforderlich, um in der daraus erzeugten PDF-Darstellung eine ansehnliche Tilde zu erhalten.

source: Example programs and shell sessions
de: Beispielprogramme und Shell-Sitzungen

source: Manual pages may include example programs demonstrating how to use a system call or library function. However, note the following:
de: Handbuchseiten können Beispielprogramme enthalten, die den Gebrauch von Systemaufrufen oder Bibliotheksfunktionen beschreiben. Beachten Sie jedoch das Folgende:

source: Example programs should be written in C.
de: Beispielprogramme sollten in C geschrieben sein.

source: An example program is necessary and useful only if it demonstrates something beyond what can easily be provided in a textual description of the interface. An example program that does nothing other than call an interface usually serves little purpose.
de: Ein Beispielprogramm ist nur dann notwendig und sinnvoll, wenn es inhaltlich weiter geht als das, was leicht in einer Textbeschreibung der Schnittstelle bereitgestellt werden kann. Ein Beispielprogramm, das nichts Anderes tut, als eine Schnittstelle aufzurufen, hat in der Regel wenig Sinn.

source: Example programs should ideally be short (e.g., a good example can often be provided in less than 100 lines of code), though in some cases longer programs may be necessary to properly illustrate the use of an API.
de: Beispielprogramme sollten idealerweise kurz sein (zum Beispiel können bereits weniger als 100 Codezeilen ein gutes Beispiel darstellen), doch können in einigen Fällen längere Programme nötig sein, um die Verwendung einer API korrekt zu veranschaulichen.

source: Expressive code is appreciated.
de: Ausdrucksstarker Code ist sehr begrüßenswert.

source: Comments should included where helpful. Complete sentences in free-standing comments should be terminated by a period. Periods should generally be omitted in "tag" comments (i.e., comments that are placed on the same line of code); such comments are in any case typically brief phrases rather than complete sentences.
de: Kommentare sollten dort eingefügt werden, wo sie hilfreich sind. Vollständige Sätze in freistehenden Kommentaren sollten durch einen Punkt abgeschlossen werden. Kein abschließender Punkt sollte nach »tag«-Kommentaren gesetzt werden (zum Beispiel Kommentare in einer Code-Zeile), da solche Kommentare eher kurze Phrasen und keine kompletten Sätze sind.

source: Example programs should do error checking after system calls and library function calls.
de: Beispielprogramme sollten nach dem Aufruf von System- und Bibliotheksfunktionen prüfen, ob Fehler aufgetreten sind.

source: Example programs should be complete, and compile without warnings when compiled with I<cc\ -Wall>.
de: Beispielprogramme sollten vollständig sein und keine Warnungen ausgeben, wenn sie mit I<cc\ -Wall> kompiliert werden.

source: Where possible and appropriate, example programs should allow experimentation, by varying their behavior based on inputs (ideally from command-line arguments, or alternatively, via input read by the program).
de: Soweit möglich und angebracht, sollten Beispielprogramme Experimente ermöglichen, wie sich ihr Verhalten durch Variation der Eingabe verändert (idealerweise mittels Befehlszeilenargumenten oder alternativ durch vom Programm gelesene Eingaben).

source: Example programs should be laid out according to Kernighan and Ritchie style, with 4-space indents. (Avoid the use of TAB characters in source code!) The following command can be used to format your source code to something close to the preferred style:
de: Beispielprogramme sollten im Stil von Kernighan und Ritchie (mit Einzügen von 4 Leerzeichen) verfasst werden. (Verwenden Sie in Quelltexten keine Tabulatoren!) Der folgende Befehl kann dazu verwandt werden, Ihren Quellcode ähnlich dem bevorzugten Stil zu formatieren:

source: For consistency, all example programs should terminate using either of:
de: Aus Konsistenzgründen sollten alle Beispielprogramm mit einer der folgenden Sequenzen beendet werden:

source: Avoid using the following forms to terminate a program:
de: Vermeiden Sie die folgenden Formen, um ein Programm zu beenden:

source: If there is extensive explanatory text before the program source code, mark off the source code with a subsection heading I<Program source>, as in:
de: Falls ein umfangreicher erklärender Text vor dem Programm-Quellcode steht, markieren Sie den Quellcode mit der Zwischenüberschrift I<Program source>, wie in:

source: Always do this if the explanatory text includes a shell session log.
de: Tun Sie dies immer, wenn der erklärende Text ein Sitzungsprotokoll der Shell enthält.

source: If you include a shell session log demonstrating the use of a program or other system feature:
de: Wenn Sie eine Shell-Sitzung einfügen, welche die Verwendung eines Programms oder andere Möglichkeiten des Systems demonstriert:

source: Place the session log above the source code listing
de: Setzen Sie das Sitzungsprotokoll vor die Quellcode-Auflistung.

source: Indent the session log by four spaces.
de: Rücken Sie das Sitzungsprotokoll um vier Zeichen ein.

source: Boldface the user input text, to distinguish it from output produced by the system.
de: Wählen Sie Fettschrift für vom Benutzer eingegebenen Text, um ihn von der vom System erzeugten Ausgabe zu unterscheiden.

source: For some examples of what example programs should look like, see B<wait>(2) and B<pipe>(2).
de: In B<wait>(2) und B<pipe>(2) finden Sie vorbildliche Beispielprogramme.

source: For canonical examples of how man pages in the I<man-pages> package should look, see B<pipe>(2) and B<fcntl>(2).
de: Kanonische Beispiele für die Gestaltung von Handbuchseiten für das I<man-pages>-Paket sind B<pipe>(2) und B<fcntl> (2).

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: Overviews or descriptions of various topics, conventions and protocols, character set standards, the standard filesystem layout, and miscellaneous other things.
de: Überblicke oder Beschreibungen verschiedener Themen, Konventionen und Protokolle, Zeichensatz-Standards, dem Standard-Dateisystemlayout und diversen anderen Dingen.

source: One or more examples demonstrating how this function, file or command is used.
de: Ein oder mehrere Beispiele für die Anwendung der Funktion, der Datei oder des Befehls

source: The I<man-pages> project doesn't use a REPORTING BUGS section in manual pages. Information on reporting bugs is instead supplied in the script-generated COLOPHON section. However, various projects do use a REPORTING BUGS section. it is recommended to place it near the foot of the page.
de: Das Projekt I<man-pages> verwendet keinen Abschnitt REPORTING BUGS in den Handbuchseiten. Informationen zum Melden von Fehlern werden stattdessen in dem per Skript erzeugten Abschnitt COLOPHON bereitgestellt. Dennoch verwenden verschiedene Projekte einen Abschnitt REPORTING BUGS. Es wird empfohlen, diesen nahe dem Ende der Seite zu platzieren.

source: In the source of a manual page, new sentences should be started on new lines, and long sentences should split into lines at clause breaks (commas, semicolons, colons, and so on). This convention, sometimes known as "semantic newlines", makes it easier to see the effect of patches, which often operate at the level of individual sentences or sentence clauses.
de: Im Quelltext einer Handbuchseite sollten neue Sätze in einer neuen Zeile beginnen und lange Sätze an Interpunktionszeichen, welche die Satzteile voneinander abgrenzen (Komma, Semikolon, Doppelpunkt usw.), geteilt werden. Diese Konvention, im englischen zuweilen »Semantic newlines« (semantische Zeilenvorschübe) genannt, erleichtert es, die Wirkung von Patches zu beurteilen, welche oft auf Ebene einzelner Sätze oder Satzteile arbeiten.

source: NULL, NUL, null pointer, and null character
de: NULL, NUL, Null-Zeiger und Null-Zeichen

source: Expressive code and useful comments are appreciated.
de: Ausdrucksstarker Code und hilfreiche Kommentare sind sehr begrüßenswert.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: Those commands that can be executed by the user from within a shell.
de: Diese Befehle kann ein Benutzer in der Shell ausführen.

source: Those functions which wrap operations performed by the kernel.
de: Diese Funktionen umhüllen (»wrap«) die vom Kernel ausgeführten Aktionen.

source: New sentences should be started on new lines. This makes it easier to see the effect of patches, which often operate at the level of individual sentences.
de: Neue Sätze sollten in einer neuen Zeile beginnen. Dadurch ist die Auswirkung von Patches leichter zu erkennen, die häufig auf der Ebene einzelner Sätze ausgeführt werden.

source: where:
de: wobei:

source: B<NAME> B<SYNOPSIS> CONFIGURATION [Normally only in Section 4] B<DESCRIPTION> OPTIONS [Normally only in Sections 1, 8] EXIT STATUS [Normally only in Sections 1, 8] RETURN VALUE [Normally only in Sections 2, 3] ERRORS [Typically only in Sections 2, 3] ENVIRONMENT FILES VERSIONS [Normally only in Sections 2, 3] ATTRIBUTES [Normally only in Sections 2, 3] CONFORMING TO NOTES BUGS EXAMPLE B<SEE ALSO>
de: B<NAME> B<SYNOPSIS> CONFIGURATION [im Allgemeinen nur in Abschnitt 4] B<DESCRIPTION> OPTIONS [im Allgemeinen nur in den Abschnitten 1, 8] EXIT STATUS [im Allgemeinen nur in den Abschnitten 1 und 8] RETURN VALUE [im Allgemeinen nur in den Abschnitten 2 und 3] ERRORS [typischerweise nur in den Abschnitten 2 und 3] ENVIRONMENT FILES ATTRIBUTES [im Allgemeinen nur in den Abschnitten 2 und 3] VERSIONS [im Allgemeinen nur in den Abschnitten 2 und 3] CONFORMING TO NOTES BUGS EXAMPLE B<SEE ALSO>

source: For details on writing example programs, see I<Example Programs> below.
de: Wie Beispielprogramme geschrieben werden sollten, beschreibt der Abschnitt I<Beispielprogramme> weiter unten.

source: Control characters should be written in bold face, with no quotes; for example, B<^X>.
de: Steuerzeichen sollten in Fettschrift ohne Anführungszeichen geschrieben werden, beispielsweise B<^X>.

source: In general, the use of abbreviations such as "e.g.", "i.e.", "etc.", "cf.", and "a.k.a." should be avoided, in favor of suitable full wordings ("for example", "that is", "compare to", "and so on", "also known as").
de: Im Allgemeinen sollten Abkürzungen wie »e.g.«, »i.e.«, »etc.«, »cf.« und »a.k.a.« vermieden werden. Schreiben Sie die Wörter stattdessen aus: »for example«, »that is«, »compare to«, »and so on«, »also known as«.

source: Real minus character
de: Echtes Minuszeichen

source: Character constants
de: Zeichenkonstanten

source: To produce single quotes that render well in both ASCII and UTF-8, use the following form for character constants in the man page source:
de: Um einfache Anführungszeichen zu verwenden, die sowohl in ASCII als auch in UTF-8 korrekt dargestellt werden können, schreiben Sie Zeichenkonstanten im Quelltext der Handbuchseite in der folgenden Form:

source: Example programs should be fairly short (preferably less than 100 lines; ideally less than 50 lines).
de: Beispielprogramme sollten eher kurz sein (vorzugsweise weniger als 100 Zeilen, idealerweise weniger als 50 Zeilen).

source: EXAMPLE
de: BEISPIEL

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
