Repository: sebras/manpages-l10n
Catalog: po/*/man7/man-pages.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: man-pages - conventions for writing Linux man pages
de: man-pages - Konventionen für das Schreiben von Linux-Handbuchseiten

source: SYNOPSIS
de: ÜBERSICHT

source: B<man> [I<section>] I<title>
de: B<man> [I<Abschnitt>] I<Titel>

source: DESCRIPTION
de: BESCHREIBUNG

source: This page describes the conventions that should be employed when writing man pages for the Linux I<man-pages> project, which documents the user-space API provided by the Linux kernel and the GNU C library. The project thus provides most of the pages in Section 2, many of the pages that appear in Sections 3, 4, and 7, and a few of the pages that appear in Sections 1, 5, and 8 of the man pages on a Linux system. The conventions described on this page may also be useful for authors writing man pages for other projects.
de: Diese Seite beschreibt die Konventionen, die Sie einhalten sollten, wenn Sie Handbuchseiten für das Projekt »Linux I<man-pages>« schreiben, das die vom Linux-Kernel und der GNU C-Bibliothek bereitgestellte API auf Anwendungsebene dokumentiert. Das Projekt pflegt die meisten Linux-Handbuchseiten des Abschnitts 2, viele der Seiten in den Abschnitten 3, 4 und 7 sowie einige Seiten in den Abschnitten 1, 5 und 8. Die hier beschriebenen Konventionen können auch für die Autoren der Handbuchseiten anderer Projekte von Nutzen sein.

source: Sections of the manual pages
de: Gliederung der Handbuchseiten

source: The manual Sections are traditionally defined as follows:
de: Die Handbuchseiten sind traditionell in die folgenden Abschnitte eingeteilt:

source: Commands that can be executed by the user from within a shell.
de: Befehle, die ein Benutzer in der Shell ausführen kann.

source: Functions which wrap operations performed by the kernel.
de: Funktionen, die vom Kernel ausgeführte Aktionen umhüllen (»wrap«).

source: All library functions excluding the system call wrappers (Most of the I<libc> functions).
de: Alle Bibliotheksfunktionen außer den Systemaufruf-Wrappern (die meisten der I<libc>-Funktionen).

source: Files found in I</dev> which allow to access to devices through the kernel.
de: Dateien, die in I</dev> liegen und den Zugriff auf Geräte über den Kernel erlauben.

source: Describes various human-readable file formats and configuration files.
de: Beschreibt verschiedene menschenlesbare Dateiformate und Konfigurationsdateien.

source: Games and funny little programs available on the system.
de: Auf dem System verfügbare Spiele und lustige kleine Programme.

source: Overviews or descriptions of various topics, conventions, and protocols, character set standards, the standard filesystem layout, and miscellaneous other things.
de: Überblicke oder Beschreibungen verschiedener Themen, Konventionen und Protokolle, Zeichensatz-Standards, dem Standard-Dateisystemlayout und diversen anderen Dingen.

source: Commands like B<mount>(8), many of which only root can execute.
de: Dazu gehören Befehle wie B<mount>(8). Viele davon können nur mit Administratorrechten ausgeführt werden.

source: Macro package
de: Makropaket

source: New manual pages should be marked up using the B<groff an.tmac> package described in B<man>(7). This choice is mainly for consistency: the vast majority of existing Linux manual pages are marked up using these macros.
de: Neue Handbuchseiten sollten das in B<man>(7) beschriebene Paket B<an.tmac> von B<groff> verwenden. Diese Wahl dient vor allem der Konsistenz: die überwiegende Mehrheit der existierenden Linux-Handbuchseiten wird mit diesen Makros formatiert.

source: Conventions for source file layout
de: Konventionen für die Gestaltung der Quelltexte

source: Please limit source code line length to no more than about 75 characters wherever possible. This helps avoid line-wrapping in some mail clients when patches are submitted inline.
de: Bitte beschränken Sie die Zeilenlänge im Quelltext, wo immer möglich, auf nicht mehr als etwa 75 Zeichen. So werden Zeilenumbrüche durch verschiedene E-Mail-Clients vermieden, wenn Patches eingebettet eingereicht werden.

source: Title line
de: Titelzeile

source: The first command in a man page should be a B<TH> command:
de: Der erste Befehl einer Handbuchseite sollte ein B<TH>-Befehl sein:

source: B<\&.TH> I<title section date source manual>
de: B<\&.TH> I<Titel Abschnitt Datum Quelle Handbuch>

source: The arguments of the command are as follows:
de: Die Argumente dieses Befehls sind wie folgt:

source: I<title>
de: I<Titel>

source: The title of the man page, written in all caps (e.g., I<MAN-PAGES>).
de: der Titel der Handbuchseite in Großbuchstaben (z. B. I<MAN-PAGES>)

source: I<section>
de: I<Abschnitt>

source: The section number in which the man page should be placed (e.g., I<7>).
de: die Nummer des Abschnitts, in dem die Handbuchseite eingeordnet werden sollte (z. B. I<7>)

source: I<date>
de: I<Datum>

source: The date of the last nontrivial change that was made to the man page. (Within the I<man-pages> project, the necessary updates to these timestamps are handled automatically by scripts, so there is no need to manually update them as part of a patch.) Dates should be written in the form YYYY-MM-DD.
de: Das Datum der letzten nicht trivialen Änderung, die an der Handbuchseite vorgenommen wurde. (Innerhalb des Projekts I<man-pages> werden die notwendigen Aktualisierungen dieser Zeitstempel automatisch durch Skripte erledigt, daher ist eine händische Aktualisierung als Teil des Patches nicht notwendig.) Daten sollten in der Form YYYY-MM-DD geschrieben werden.

source: I<source>
de: I<Quelle>

source: The source of the command, function, or system call.
de: die Quelle von Befehl, Funktion oder Systemaufruf

source: For those few I<man-pages> pages in Sections 1 and 8, probably you just want to write I<GNU>.
de: Für die wenigen I<Handbuchseiten> in den Abschnitten 1 und 8 werden Sie vielleicht nur I<GNU> schreiben wollen.

source: For system calls, just write I<Linux>. (An earlier practice was to write the version number of the kernel from which the manual page was being written/checked. However, this was never done consistently, and so was probably worse than including no version number. Henceforth, avoid including a version number.)
de: Für Systemaufrufe schreiben Sie einfach I<Linux>. (Eine frühere Praxis war es, die Kernel-Version anzugeben, für die die Seite geschrieben oder mit der sie überprüft wurde. Dies wurde jedoch nie konsequent durchgeführt und war vielleicht schlimmer als gar keine Versionsnummer. Vermeiden Sie künftig die Versionsnummer.)

source: For library calls that are part of glibc or one of the other common GNU libraries, just use I<GNU C Library>, I<GNU>, or an empty string.
de: Für Bibliotheksaufrufe, die Teil der Glibc oder einer der anderen gängigen GNU-Bibliotheken sind, schreiben Sie einfach I<GNU C Library>, I<GNU> oder eine leere Zeichenkette.

source: For Section 4 pages, use I<Linux>.
de: Verwenden Sie für Seiten aus Abschnitt 4 I<Linux>.

source: In cases of doubt, just write I<Linux>, or I<GNU>.
de: Wählen Sie in Zweifelsfällen einfach I<Linux> oder I<GNU>.

source: I<manual>
de: I<Handbuch>

source: The title of the manual (e.g., for Section 2 and 3 pages in the I<man-pages> package, use I<Linux Programmer's Manual>).
de: der Titel des Handbuchs (z. B. für Seiten der Abschnitte 2 und 3 aus dem Paket I<man-pages> verwenden Sie bitte I<Linux Programmer's Manual>.

source: Sections within a manual page
de: Abschnitte innerhalb einer Handbuchseite

source: The list below shows conventional or suggested sections. Most manual pages should include at least the B<highlighted> sections. Arrange a new manual page so that sections are placed in the order shown in the list.
de: Die folgende Liste enthält gebräuchliche und empfohlene Abschnitte. Die meisten Handbuchseiten sollten mindestens die B<hervorgehobenen> Abschnitte enthalten. Gliedern Sie eine neue Handbuchseite so, dass die Abschnitte in der Reihenfolge der Liste platziert werden.

source: CONFIGURATION
de: KONFIGURATION

source: [Normally only in Section 4]
de: [in der Regel nur in Abschnitt 4]

source: OPTIONS
de: OPTIONEN

source: [Normally only in Sections 1, 8]
de: [in der Regel nur in den Abschnitten 1 und 8]

source: RETURN VALUE
de: RÜCKGABEWERT

source: [Normally only in Sections 2, 3]
de: [in der Regel nur in den Abschnitten 2 und 3]

source: ERRORS
de: FEHLER

source: [Typically only in Sections 2, 3]
de: [typischerweise nur in den Abschnitten 2 und 3]

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: FILES
de: DATEIEN

source: VERSIONS
de: VERSIONEN

source: ATTRIBUTES
de: ATTRIBUTE

source: CONFORMING TO
de: KONFORM ZU

source: NOTES
de: ANMERKUNGEN

source: BUGS
de: FEHLER

source: EXAMPLES
de: BEISPIELE

source: AUTHORS
de: AUTOREN

source: [Discouraged]
de: [wird nicht empfohlen]

source: REPORTING BUGS
de: FEHLER MELDEN

source: [Not used in man-pages]
de: [wird in man-pages nicht verwendet]

source: I<Where a traditional heading would apply>, I<please use it>; this kind of consistency can make the information easier to understand. If you must, you can create your own headings if they make things easier to understand (this can be especially useful for pages in Sections 4 and 5). However, before doing this, consider whether you could use the traditional headings, with some subsections (I<.SS>) within those sections.
de: I<Bitte verwenden Sie eine traditionelle Überschrift>, I<wo sie zutreffen würde>; diese Art von Konsistenz kann die Informationen leichter verständlich machen. Wenn Sie müssen, können Sie eigene Überschriften wählen, wenn die Dinge dadurch leichter zu verstehen sind. (Das kann besonders für Seiten in den Abschnitten 4 und 5 nützlich sein.) Doch bevor Sie das tun, prüfen Sie bitte, ob Sie auch traditionelle Überschriften verwenden können (und innerhalb dieser Abschnitte einige Unterabschnitte (I<.SS>) einfügen).

source: The following list elaborates on the contents of each of the above sections.
de: Die folgende Liste geht näher auf den Inhalt jedes der oben genannten Abschnitte ein.

source: The name of this manual page.
de: Der Name dieser Handbuchseiten

source: See B<man>(7) for important details of the line(s) that should follow the B<.SH NAME> command. All words in this line (including the word immediately following the "\e-") should be in lowercase, except where English or technical terminological convention dictates otherwise.
de: Lesen Sie B<man>(7) für wichtige Hinweise zu der/den Zeile(n), die dem Befehl B<.SH NAME> folgen sollten. Alle Wörter in dieser Zeile (darunter auch das Wort, das unmittelbar auf das »\e-« folgt) sollten kleingeschrieben werden, außer wenn das Englische oder die Gepflogenheiten der Fachbegriffe es anders vorschreiben.

source: A brief summary of the command or function's interface.
de: Eine kurze Zusammenfassung des Befehls oder der Funktionsschnittstelle

source: For commands, this shows the syntax of the command and its arguments (including options); boldface is used for as-is text and italics are used to indicate replaceable arguments. Brackets ([]) surround optional arguments, vertical bars (|) separate choices, and ellipses (\&...) can be repeated. For functions, it shows any required data declarations or B<#include> directives, followed by the function declaration.
de: Für Befehle beschreibt dieser Abschnitt die Syntax des Befehls und seine Argumente (einschließlich Optionen). Fettschrift bedeutet, dass der Text genau so eingegeben werden muss, austauschbare Argumente werden durch Kursivschrift gekennzeichnet. Klammern ([]) umgeben optionale Argumente, senkrechte Striche (|) trennen Elemente, von denen eines auszuwählen ist, und Ellipsen (…) können wiederholt werden. Für Funktionen enthält er die Deklarationen aller erforderlichen Daten oder B<#include>-Anweisungen, gefolgt von der Funktionsdeklaration.

source: Where a feature test macro must be defined in order to obtain the declaration of a function (or a variable) from a header file, then the SYNOPSIS should indicate this, as described in B<feature_test_macros>(7).
de: Wenn ein Feature-Test-Makro definiert werden muss, um die Deklaration einer Funktion (oder einer Variable) aus einer Header-Datei zu erhalten, dann sollte das in SYNOPSIS angegeben werden. Wie es gemacht wird, ist in B<feature_test_macros>(7) beschrieben.

source: Configuration details for a device.
de: Konfigurationsdetails für ein Gerät

source: This section normally appears only in Section 4 pages.
de: Dieser Abschnitt kommt in der Regel nur in Seiten aus Abschnitt 4 vor.

source: An explanation of what the program, function, or format does.
de: Eine Bescheibung der Funktionsweise des Programms, der Funktion oder des Formats

source: Discuss how it interacts with files and standard input, and what it produces on standard output or standard error. Omit internals and implementation details unless they're critical for understanding the interface. Describe the usual case; for information on command-line options of a program use the B<OPTIONS> section.
de: Legen Sie die Interaktion mit Dateien und der Standardeingabe dar und was in der Standardausgabe oder der Standardfehlerausgabe ausgegeben wird. Lassen Sie Interna und Details der Implementierung aus, wenn sie nicht entscheidend für das Verständnis der Schnittstelle sind. Beschreiben Sie den üblichen Fall, für Informationen über Befehlszeilenoptionen eines Programms verwenden Sie den Abschnitt B<OPTIONS>.

source: When describing new behavior or new flags for a system call or library function, be careful to note the kernel or C library version that introduced the change. The preferred method of noting this information for flags is as part of a B<.TP> list, in the following form (here, for a new system call flag):
de: Achten Sie darauf, bei der Beschreibung eines neuen Verhaltens oder eines neuen Schalters für einen Systemaufruf oder eine Bibliotheksfunktion die Kernel- oder C-Bibliotheksversion anzugeben, bei der diese Änderung eingeführt wurde. Die bevorzugte Methode, auf diese Information hinzuweisen, ist bei Schaltern als Teil einer B<.TP>-Liste, in der folgenden Form (hier für einen neuen Schalter eines Systemaufrufes):

source: B<XYZ_FLAG> (since Linux 3.7)
de: B<XYZ_FLAG> (seit Linux 3.7)

source: Description of flag...
de: Beschreibung des Schalters …

source: Including version information is especially useful to users who are constrained to using older kernel or C library versions (which is typical in embedded systems, for example).
de: Die Versionsinformation anzugeben ist besonders hilfreich für Benutzer, die auf eine ältere Kernel- oder C-Bibliotheksversion angewiesen sind (dies ist zum Beispiel bei eingebetteten Systemen typisch).

source: A description of the command-line options accepted by a program and how they change its behavior.
de: Eine Beschreibung der von einem Programm akzeptierten Befehlszeilenoptionen und wie sie das Verhalten des Programms verändern.

source: This section should appear only for Section 1 and 8 manual pages.
de: Dieser Abschnitt sollte nur in Handbuchseiten der Abschnitte 1 und 8 enthalten sein.

source: A list of the possible exit status values of a program and the conditions that cause these values to be returned.
de: Eine Liste der möglichen Werte für den Exit-Status eines Programms und die Umstände, die zur Rückgabe dieser Werte führen

source: For Section 2 and 3 pages, this section gives a list of the values the library routine will return to the caller and the conditions that cause these values to be returned.
de: Dieser Abschnitt enthält für Handbuchseiten aus den Abschnitten 2 und 3 die Rückgabewerte der Bibliotheksroutine für die aufrufende Routine und erläutert die Bedingungen, die zu einem bestimmten Rückgabewert führen.

source: For Section 2 and 3 manual pages, this is a list of the values that may be placed in I<errno> in the event of an error, along with information about the cause of the errors.
de: Dieser Abschnitt enthält für Handbuchseiten aus den Abschnitten 2 und 3 mögliche Werte, die im Fehlerfall in I<errno> platziert werden und erläutert mögliche Ursachen der Fehler.

source: Where several different conditions produce the same error, the preferred approach is to create separate list entries (with duplicate error names) for each of the conditions. This makes the separate conditions clear, may make the list easier to read, and allows metainformation (e.g., kernel version number where the condition first became applicable) to be more easily marked for each condition.
de: Wenn mehrere unterschiedliche Umstände den gleichen Fehler erzeugen, wird bevorzugt, dass verschiedene Listeneinträge (mit gedoppelten Fehlernamen) für jeden dieser Umstände erstellt werden. Dadurch werden die unterschiedlichen Umstände deutlicher, die Liste einfacher zu lesen und dies erlaubt es, Metainformationen (z.B. Kernelversionsnummern, unter denen die Umstände erstmals zum Tragen kamen) leichter für jeden Umstand zu markieren.

source: I<The error list should be in alphabetical order>.
de: I<Die Fehlerliste sollte alphabetisch sortiert sein>.

source: A list of all environment variables that affect the program or function and how they affect it.
de: Eine Liste aller Umgebungsvariablen, die auf das Programm einwirken mit Erläuterung, was sie bewirken.

source: A list of the files the program or function uses, such as configuration files, startup files, and files the program directly operates on.
de: Eine Liste aller Dateien, die das Programm oder die Funktion verwenden, wie Konfigurationsdateien, Einrichtungsdateien und Dateien, auf denen das Programm direkt arbeitet

source: Give the full pathname of these files, and use the installation process to modify the directory part to match user preferences. For many programs, the default installation location is in I</usr/local>, so your base manual page should use I</usr/local> as the base.
de: Geben Sie den vollständigen Pfadnamen dieser Dateien an und nutzen Sie den Installationsprozess, um den Verzeichnisteil des Pfades an die Benutzereinstellungen anzupassen. Für viele Programme ist als Installationsverzeichnis I</usr/local> voreingestellt. Ihre grundlegende Handbuchseite sollte daher I</usr/local> als Basis verwenden.

source: A summary of various attributes of the function(s) documented on this page. See B<attributes>(7) for further details.
de: Eine Zusammenfassung der verschiedenen Attribute von Funktionen, die auf dieser Seite dokumentiert sind. Siehe B<attributes>(7) für weitere Details.

source: A brief summary of the Linux kernel or glibc versions where a system call or library function appeared, or changed significantly in its operation.
de: Hier steht eine kurze Zusammenfassung der Linux-Kernel- oder Glibc-Versionen, in denen ein Systemaufruf oder eine Bibliotheksfunktion erschien oder das Verhalten wesentlich veränderte.

source: As a general rule, every new interface should include a VERSIONS section in its manual page. Unfortunately, many existing manual pages don't include this information (since there was no policy to do so when they were written). Patches to remedy this are welcome, but, from the perspective of programmers writing new code, this information probably matters only in the case of kernel interfaces that have been added in Linux 2.4 or later (i.e., changes since kernel 2.2), and library functions that have been added to glibc since version 2.1 (i.e., changes since glibc 2.0).
de: Als allgemeine Regel gilt, dass jede neue Schnittstelle einen VERSIONS-Abschnitt in der Handbuchseite enthalten sollte. Leider verfügen viele bestehende Handbuchseiten nicht über diese Informationen (da es dafür keine entsprechende Richtlinie gab, als sie geschrieben wurden). Patches zur Ergänzung dieser Abschnitte sind willkommen. Aus der Sicht von Programmierern, die neuen Code schreiben, werden diese Informationen wohl nur für Kernel-Schnittstellen interessant sein, die in Linux 2.4 oder später hinzugefügt wurden, und für geänderte Bibliotheksfunktionen in der Glibc seit Version 2.1. (d. h. also Änderungen seit Kernel 2.2 und Glibc 2.0).

source: The B<syscalls>(2) manual page also provides information about kernel versions in which various system calls first appeared.
de: Auch die Handbuchseite über Systemaufrufe (B<syscalls>(2)) enthält Informationen über die Kernel-Versionen, in denen bestimmte Systemaufrufe erstmals vorkamen.

source: A description of any standards or conventions that relate to the function or command described by the manual page.
de: Eine Beschreibung aller Standards oder Konventionen, die die Funktionen oder den Befehle betrifft, die durch die Handbuchseite beschrieben wird.

source: The preferred terms to use for the various standards are listed as headings in B<standards>(7).
de: Die bevorzugten Ausdrücke für die verschiedenen Standards sind als Überschriften in B<standards>(7) aufgeführt.

source: For a page in Section 2 or 3, this section should note the POSIX.1 version(s) that the call conforms to, and also whether the call is specified in C99. (Don't worry too much about other standards like SUS, SUSv2, and XPG, or the SVr4 and 4.xBSD implementation standards, unless the call was specified in those standards, but isn't in the current version of POSIX.1.)
de: Für eine Handbuchseite in Abschnitt 2 oder 3 sollte(n) hier die POSIX.1-Version(en) stehen, denen der Aufruf entspricht. Auch sollte angegeben werden, ob der Aufruf in C99 beschrieben ist. (Sorgen Sie sich nicht zu sehr um andere Standards wie SUS, SUSv2 und XPG oder die SVr4- und 4.xBSD-Implementierungsstandards, es sei denn, der Aufruf wurde in diesen Standards beschrieben, ist aber nicht in der aktuellen Version von POSIX.1 enthalten.)

source: If the call is not governed by any standards but commonly exists on other systems, note them. If the call is Linux-specific, note this.
de: Wenn der Aufruf von keinen Standards geregelt ist, aber allgemein auf anderen Systemen vorhanden ist, erwähnen Sie diese Systeme. Wenn der Aufruf Linux-spezifisch ist, erwähnen Sie auch das.

source: If this section consists of just a list of standards (which it commonly does), terminate the list with a period (\(aq.\(aq).
de: Wenn dieser Abschnitt nur aus einer Liste von Standards besteht (das ist üblicherweise der Fall), beenden Sie die Liste mit einem Punkt (\(aq.\(aq).

source: Miscellaneous notes.
de: Verschiedene Anmerkungen

source: For Section 2 and 3 man pages you may find it useful to include subsections (B<SS>) named I<Linux Notes> and I<Glibc Notes>.
de: Für Handbuchseiten der Abschnitte 2 und 3 könnten die Aufnahme von Unterabschnitten (B<SS>) I<Linux Notes> und I<Glibc Notes> nützlich sein.

source: In Section 2, use the heading I<C library/kernel differences> to mark off notes that describe the differences (if any) between the C library wrapper function for a system call and the raw system call interface provided by the kernel.
de: In Abschnitt 2 verwenden Sie die Überschrift I<C library/kernel differences>, um Abschnitte zu markieren, die die Unterschiede (falls vorhanden) zwischen der C-Bibliothek-Wrapper-Funktion für einen Systemaufruf und der rohen Systemaufrufschnittstelle durch den Kernel beschreiben.

source: A list of limitations, known defects or inconveniences, and other questionable activities.
de: Eine Liste von Einschränkungen, bekannten Mängeln oder Unannehmlichkeiten und weiteren fragwürdigen Verhalten.

source: One or more examples demonstrating how this function, file, or command is used.
de: Ein oder mehrere Beispiele für die Anwendung der Funktion, der Datei oder des Befehls

source: For details on writing example programs, see I<Example programs> below.
de: Wie Beispielprogramme geschrieben werden sollten, beschreibt der Abschnitt I<Beispielprogramme> weiter unten.
