Repository: sebras/manpages-l10n
Catalog: po/*/man7/man.7.po
Languages: de, es, it, pt_br

source: Do not use the optional parameter for B<bp> (break page). Use only positive values for B<sp> (vertical space). Don't define a macro (B<de>) with the same name as a macro in this or the mdoc macro package with a different meaning; it's likely that such redefinitions will be ignored. Every positive indent (B<in>) should be paired with a matching negative indent (although you should be using the B<RS> and B<RE> macros instead). The condition test (B<if,ie>) should only have \(aqt\(aq or \(aqn\(aq as the condition. Only translations (B<tr>) that can be ignored should be used. Font changes (B<ft> and the B<\ef> escape sequence) should only have the values 1, 2, 3, 4, R, I, B, P, or CW (the ft command may also have no parameters).
de: Verwenden Sie nicht den optionalen Parameter für B<bp> (Seitenumbruch). Verwenden Sie nur positive Werte für B<sp> (vertikaler Abstand). Definieren Sie kein Makro (B<de>) mit dem gleichen Namen wie ein Makro in diesem oder dem mdoc-Makropaket mit einer anderen Bedeutung; wahrscheinlich werden solche Neudefinitionen ignoriert. Jeder positive Einzug (B<in>) sollte mit einem passenden negativen Einzug gekoppelt werden (obwohl Sie stattdessen die Makros B<RS> und B<RE> verwenden sollten). Beim Prüfen von Bedingungen (B<if,ie>) sollten Sie sich auf \(aqt\(aq oder \(aqn\(aq beschränken. Nur Übersetzungen (B<tr>), die ignoriert werden können, sollten verwendet werden. Änderungen der Schriftart (B<ft> und die Escape-Sequenz B<\ef> Escape-Sequenz) sollten nur die Werte 1, 2, 3, 4, R, I, B, P oder CW annehmen. (Der B< ft>-Befehl darf auch keine Parameter haben).
es: No use el parámetro opcional de B<bp> (break page, salto de página). Use sólo valores positivos para B<sp> (vertical space, espacio vertical). No defina una macro (B<de>) con el mismo nombre que una macro en éste o el paquete de macros mdoc, con un significado diferente. Es probable que tales redefiniciones se ignoren. Todo sangrado positivo (B<in>) debería ir acompañado por el correspondiente sangrado negativo (aunque debería usar las macros B<RS> y B<RE> en su lugar). La condición (B<if,ie>) sólo debería tener \(aqt\(aq o \(aqn\(aq como condición. Sólo se deberían utilizar traducciones (B<tr>) que se puedan ignorar. Los cambios de fuente (B<ft> y las secuencias de escape B<\ef>) sólo debería tener los valores 1, 2, 3, 4, R, I, B, P o CW (la orden ft también puede no tener parámetros).
it: Non usare il parametro opzionale per B<bp> (interruzione pagina). Usare solo valori positivi per B<sp> (spazio verticale). Non definire una macro (B<de>) con lo stesso nome di una macro in questo o nel pacchetto macro mdoc con un diverso significato; è facile che queste ridefinizioni vengano ignorate. Ogni rientro positivo (B<in>) deve essere accompagnato da un corrispondente rientro negativo (anche se si dovrebbero usare le macro B<RS> e B<RE> al loro posto). Il test condizionale (B<if,ie>) deve avere solo \(aqt\(aq o \(aqn\(aq come condizione. Solo le traduzioni ( B<tr>) che possono essere ignorate devono essere usate. I cambiamenti del tipo di carattere (B<\ft> e la sequenza di escape B<\ef>) devono avere solo i valori 1, 2, 3, 4, R, I, B, P, o CW (il comando ft può anche non avere parametri).
pt_br: Não use o parâmetro opcional de B<bp> (quebra de página). Use apenas valores positivos para B<sp> (espaço vertical). Não defina uma macro (B<de>) com o mesmo nome de uma macro neste pacote de macros ou no do mdoc com um significado diferente: é provável que estas redefinições sejam ignoradas. Toda indentação positiva (B<in>) deve ter uma indentação negativa correspondente. (É melhor, no entanto, usar as macros B<RS> e B<RE>). O teste condicional (B<if,ie>) deve ter apenas \(aqt\(aq ou \(aqn\(aq como condição. Apenas as traduções do tipo (B<tr>) que puderem ser ignoradas devem ser usadas. Mudanças de fonte (B<ft> ou a sequência de escape B<\ef>) devem usar apenas os valores 1, 2, 3, 4, R, I, B, P ou CW (o comando ft também pode ser usado sem parâmetros).

source: If you use capabilities beyond these, check the results carefully on several tools. Once you've confirmed that the additional capability is safe, let the maintainer of this document know about the safe command or sequence that should be added to this list.
de: Wenn Sie Fähigkeiten nutzen, die über das Erwähnte herausgehen, überprüfen Sie die Ergebnisse sorgfältig mit mehreren Programmen. Sobald Sie bestätigt haben, dass die zusätzliche Fähigkeit sicher ist, teilen Sie dem Betreuer dieses Dokuments den sicheren Befehl oder die Sequenz mit, damit sie zu dieser Liste hinzugefügt werden kann.
es: Si usa otras capacidades diferentes a éstas, compruebe el resultado cuidadosamente con diferentes herramientas. Una vez que haya confirmado que la capacidad adicional es segura, permita que el que mantiene este documento conozca la secuencia u orden segura que debería añadirse a esta lista.
it: Se si usano potenzialità oltre a queste, si verifichino attentamente i risultati con diversi strumenti. Una volta confermato che la capacità aggiuntiva è sicura mettete a conoscenza il curatore di questo documento del comando o sequenza sicura che deve essere aggiunta a questo elenco.
pt_br: Se você usar recursos que não sejam estes, confira cuidadosamente os resultados em vários programas. Tendo confirmado que o recurso adicional é seguro, informe ao mantenedor deste documento o comando seguro ou sequência segura que deveria ser adicionado(a) a esta lista.

source: FILES
de: DATEIEN
es: ARCHIVOS
it: FILE
pt_br: ARQUIVOS

source: NOTES
de: ANMERKUNGEN
es: NOTAS
it: NOTE
pt_br: NOTAS

source: By all means include full URLs (or URIs) in the text itself; some tools such as B<man2html>(1) can automatically turn them into hypertext links. You can also use the B<UR> and B<UE> macros to identify links to related information. If you include URLs, use the full URL (e.g., E<.UR http://www.kernel.org> E<.UE )> to ensure that tools can automatically find the URLs.
de: Geben Sie auf alle Fälle im Text vollständige URLs (oder URIs) an. Einige Werkzeuge wie B<man2html>(1) können sie automatisch in Hypertext-Links umwandeln. Sie können auch die Makros B<UR> und B<UE> verwenden, um Verweise zu verwandten Informationen zu kennzeichnen. Wenn Sie URLs einschließen, verwenden Sie die vollständige URLs (z. B. E<.UR http://www.kernel.org> E<.UE )>), um sicherzustellen, dass die Werkzeuge die URLs automatisch finden können.
es: Intente por todos los medios incluir URL (o URI) completas en el propio texto. Herramientas tales como B<man2html>(1) pueden convertirlas automáticamente en enlaces de hipertexto. También puede usar las macros B<UR> y B<UE> para identificar enlaces a información relacionada. Si incluye URL, use la URL completa (por ejemplo: E<.UR http://www.kernel.org> E<.UE )> para garantizar que las distintas aplicaciones puedan encontrarlas automáticamente.
it: Certamente includere URL (o URI) completi nello stesso testo; alcuni tool come B<man2html>(1) possono trasformarli automaticamente in collegamenti ipertestuali. Si può anche usare la nuova macro B<URL> per identificare collegamenti a informazioni correlate. Se si includono URL usare l'URL completo (es., E<.UR http://www.kernel.org> E<.UE )> per assicurarsi che gli strumenti possano trovare automaticamente gli URL.
pt_br: Procure incluir as URL (ou URIs) no próprio texto, porque algumas ferramentas como B<man2html>(1) podem transformá-las automaticamente em links de hipertexto. Você também pode usar as macros B<UR> e B<UE> para identificar links para informações relacionadas. Se você incluir URLs, coloque o endereço inteiro (por exemplo, E<.UR http://www.kernel.org> E<.UE )> para garantir que as ferramentas encontrem automaticamente as URLs.

source: Tools processing these files should open the file and examine the first nonwhitespace character. A period (.) or single quote (\(aq) at the beginning of a line indicates a troff-based file (such as man or mdoc). A left angle bracket (E<lt>) indicates an SGML/XML-based file (such as HTML or Docbook). Anything else suggests simple ASCII text (e.g., a "catman" result).
de: Werkzeuge, die solche Dateien verarbeiten, sollten die Datei öffnen und das erste Zeichen prüfen, das kein Leerraumzeichen ist. Ein Punkt (.) oder einfaches Anführungszeichen (\(aq) am Anfang einer Zeile kennzeichnet eine Troff-Datei (wie man oder mdoc). Eine linke spitze Klammer (E<lt>) zeigt eine SGML/XML-basierte Datei an (z. B. HTML oder DocBook). Alles Andere lässt einfachen ASCII-Text vermuten (z. B. ein Ergebnis von »catman«).
es: Las herramientas que procesan estos ficheros deben abrir el fichero y examinar el primer carácter distinto de espacio. Un punto (.) o una comilla simple (\(aq) al principio de una línea indica un fichero basado en troff (tal como man o mdoc). Un menor (E<lt>) indica un fichero basado en SGML/XML (tal como HTML o Docbook). Cualquier otra cosa sugiere un simple texto ASCII (por ej., el resultado de un "catman").
it: Gli strumenti che elaborano questi file devono aprire il file ed esaminare il primo carattere che non sia uno spazio. Un punto (.) o virgoletta singola (\(aq) all'inizio di una riga indicano un file basato su troff (come man o mdoc). Una parentesi angolare sinistra (E<lt>) indica un file basato su SGML/XML (come HTML o Docbook). Qualsiasi altra cosa suggerisce semplice testo ASCII (per esempio un risultato "catman").
pt_br: Ferramentas processando estes arquivos devem abrir o arquivo e examinar o primeiro caractere que não seja um espaço. Um ponto (.) ou aspa simples (\(aq) no começo da linha indica um arquivo tipo troff (como man ou mdoc). Um sinal de menor (E<lt>) indica um arquivo tipo SGML/XML (como HTML ou Docbook). Qualquer outra coisa indica texto simples em ASCII (por exemplo, a saída de "catman").

source: Many man pages begin with B<\(aq\e"> followed by a space and a list of characters, indicating how the page is to be preprocessed. For portability's sake to non-troff translators we recommend that you avoid using anything other than B<tbl>(1), and Linux can detect that automatically. However, you might want to include this information so your man page can be handled by other (less capable) systems. Here are the definitions of the preprocessors invoked by these characters:
de: Viele Handbuchseiten beginnen mit B<\(aq\e">, gefolgt von einem Leerzeichen und einer Liste von Zeichen, welche die Vorverarbeitung der Seite festlegt. Um der Portabilität zu anderen Programmen als Troff zu genügen, wird empfohlen, alles andere als B<tbl>(1) zu vermeiden, Linux kann das automatisch erkennen. Allerdings möchten Sie vielleicht diese Informationen in Ihre Handbuchseite aufnehmen, damit diese von anderen (weniger leistungsfähigen) Systemen verarbeitet werden kann. Mit diesen Zeichen rufen Sie die folgenden Präprozessoren auf:
es: Muchas páginas de manual comienzan con B<\(aq\e"> seguido por un espacio y una lista de caracteres que indican cómo se va a procesar la página. Por el bien de la portabilidad a traductores que no se basan en troff, recomendamos que evite usar cualquier otra cosa que no sea B<tbl>(1). Linux puede detectar eso automáticamente. Sin embargo, tal vez quiera incluir esta información de tal manera que su página man pueda ser tratada por otros sistemas (menos capaces). Aquí tiene las definiciones de los preprocesadores invocados por los siguientes caracteres:
it: Molte pagine di manuale cominciano con B<\aq\e"> seguito da uno spazio e un elenco di caratteri, che indicano come la pagina deve essere preprocessata. Per ragioni di portabilità verso traduttori non troff si raccomanda di evitare cose diverse da B<tbl>(1), e Linux lo può rilevare automaticamente. Tuttavia si possono includere queste informazioni in modo che le proprie pagine di manuale possano essere gestite da altri (meno capaci) sistemi. Queste sono le definizioni dei preprocessori invocate da questi caratteri:
pt_br: Muitas páginas man começam com B<\(aq\e"> seguido de espaço e uma lista de caracteres que indicam como a página deve ser preprocessada. Para portabilidade com tradutores não troff, recomendamos que não use nada além do B<tbl>(1) e o Linux detectará automaticamente. No entanto, você pode desejar incluir esta informação para que sua página man seja manuseada por outros sistemas (com menos recursos). Aqui estão as definições dos preprocessadores indicados por estes caracteres:

source: BUGS
de: FEHLER
es: ERRORES
it: BUG

source: Most of the macros describe formatting (e.g., font type and spacing) instead of marking semantic content (e.g., this text is a reference to another page), compared to formats like mdoc and DocBook (even HTML has more semantic markings). This situation makes it harder to vary the B<man> format for different media, to make the formatting consistent for a given media, and to automatically insert cross-references. By sticking to the safe subset described above, it should be easier to automate transitioning to a different reference page format in the future.
de: Im Vergleich zu Formaten wie mdoc und DocBook beschreibt die Mehrzahl der Makros Formatierungen (z. B. Schriftart und Zeilenabstand) statt semantische Inhalte zu kennzeichnen (z. B.: Dieser Text verweist auf eine andere Seite). Sogar HTML verfügt über mehr semantische Markierungen. Diese Situation macht es schwieriger, das B<man>-Format für verschiedene Medien zu variieren, die Formatierung für ein bestimmtes Medium konsistent zu machen und automatisch Querverweise einzufügen. Mit der Beschränkung auf die oben beschriebene sichere Teilmenge sollte es einfacher sein, den zukünftigen Übergang zu einem anderen Format für Referenzseiten (wie z. B. Manual Pages) zu automatisieren.
es: La mayoría de las macros describen aspectos del formato (por ej., el tipo de las fuentes y el espaciado) en vez de marcar contenidos semánticos (por ej., este texto es una referencia a otra página), en comparación con formatos como mdoc y Docbook (incluso HTML tiene más marcas semánticas). Esto hace que sea más difícil modificar el formato B<man> para diferentes medios, para hacer el formateo consistente para un medio dado y para insertar automáticamente referencias cruzadas. El adherirse al subconjunto seguro descrito antes debe facilitar la transición automática a un formato diferente de página de referencia en el futuro.
it: La maggior parte delle macro descrivono la formattazione (per esempio, tipo di carattere e spaziatura) invece di marcare il contenuto semantico (per esempio, questo testo è un riferimento ad un'altra pagina), rispetto a formati come mdoc e DocBook (anche HTML ha più marcatori semantici). Questa situazione rende difficile variare il formato di B<man> per media differenti, per rendere la formattazione coerente per un dato media, e inserire automaticamente riferimenti incrociati. Bloccandosi sul sottoinsieme sicure descritto prima, dovrebbe essere più facile automatizzare la transazione ad un diverso formato di riferimento delle pagine in futuro.
pt_br: A maioria das macros descreve formatação (por exemplo, tipo da fonte e espaçamento) em vez de marcar o conteúdo semântico (por exemplo, este texto é uma referência a outra página), comparado com formatos como mdoc e DocBook (até o HTML tem mais marcas semânticas). Isto dificulta a diversificação do formato B<man> para outros meios, a formatação consistente para um meio dado e a inserção automática de referências cruzadas. Ao se limitar ao subconjunto seguro acima, deve ser mais fácil automatizar a transição para outro formato de referência de página no futuro.

source: The Sun macro B<TX> is not implemented.
de: Der Sun-Makro B<TX> ist nicht implementiert.
es: La macro de Sun B<TX> no está implantada.
it: La macro di Sun B<TX> non è implementata.
pt_br: A macro B<TX> da Sun não está implementada.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN
it: VEDERE ANCHE
pt_br: VEJA TAMBÉM

source: COLOPHON
de: KOLOPHON
es: COLOFÓN
pt_br: COLOFÃO

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.12 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: Traditionally, each command can have up to six arguments, but the GNU implementation removes this limitation (you might still want to limit yourself to 6 arguments for portability's sake). Arguments are delimited by spaces. Double quotes can be used to specify an argument which contains spaces. All of the arguments will be printed next to each other without intervening spaces, so that the B<\&.BR> command can be used to specify a word in bold followed by a mark of punctuation in Roman. If no arguments are given, the command is applied to the following line of text.
de: Traditionell darf ein Befehl bis zu sechs Argumente haben, doch die GNU-Version überschreitet diese Begrenzung. (Sie werden sich aber vielleicht trotzdem auf sechs Argumente beschränken, um portable Handbuchseiten zu schreiben.) Die Argumente werden durch Leerzeichen getrennt. Sollen Argumente Leerzeichen enthalten, müssen die Argumente in doppelte Anführungszeichen eingeschlossen werden. Alle Argumente werden hintereinander ohne die dazwischenliegenden Leerzeichen ausgegeben, sodass beispielsweise mit dem Befehl B<\&.BR> ein Wort im Fettdruck, gefolgt von einem Wort in normalem Schrifttyp dargestellt werden kann. Ohne Argumente wird der Befehl auf die nächste Textzeile angewendet.

source: Below are other relevant macros and predefined strings. Unless noted otherwise, all macros cause a break (end the current line of text). Many of these macros set or use the "prevailing indent." The "prevailing indent" value is set by any macro with the parameter I<i> below; macros may omit I<i> in which case the current prevailing indent will be used. As a result, successive indented paragraphs can use the same indent without respecifying the indent value. A normal (nonindented) paragraph resets the prevailing indent value to its default value (0.5 inches). By default, a given indent is measured in ens; try to use ens or ems as units for indents, since these will automatically adjust to font size changes. The other key macro definitions are:
de: Im Folgenden werden weitere relevante Makros und vordefinierte Zeichenfolgen aufgelistet. Sofern nicht anders angegeben, beenden alle Makros die aktuelle Textzeile. Viele dieser Makros setzen oder verwenden den aktuellen »vorherrschenden Einzug« (prevailing indent). Der Wert für den Einzug wird für jedes Makro mit dem unten erläuterten Parameter I<i> bestimmt. Makros können I<i> auslassen und so der bisher verwendete Einzug beibehalten werden. Als Ergebnis können die folgenden Absätze den gleichen Einzug verwenden, ohne diesen erneut einzugeben. Ein normaler (nicht eingezogener) Absatz setzt den Einzug wieder auf den Standardwert (0,5 Zoll) zurück. Standardmäßig wird der Einzug in der typografischen Einheit En gemessen. Versuchen Sie, die Einzüge in den Einheiten En oder Em festzulegen, da diese sich automatisch an Änderungen der Schriftgröße anpassen. Weitere wichtige Makros sind wie folgt definiert:
es: A continuación hay otras macros relevantes y cadenas predefinidas. A no ser que se indique lo contrario, todas las macros provocan una ruptura (fin de la línea actual de texto). Muchas de estas macros configuran o usan el "sangrado predominante". Cualquier macro con el parámetro I<i> debajo, asigna un valor al "sangrado predominante". Las macros pueden omitir la I<i> en cuyo caso se usará el actual sangrado predominante. Como resultado, los párrafos indentados que hay a continuación pueden usar el mismo sangrado sin reespecificar el valor del sangrado. Un párrafo normal (no sangrado) restaura el valor del sangrado predominante a su valor por omisión (0,5 pulgadas). Por defecto, un sangrado dado se mide en ens. Trate a ens o ems como unidades de sangrado, ya que éstas se ajustarán automáticamente a los cambios en el tamaño de las fuentes. Las otras definiciones de macro claves son:
it: Seguono altre macro importanti e stringhe predefinite. A meno che sia specificato diversamente, ogni macro causa un'interruzione (la fine dell'attuale riga di testo). Molte di queste macro impostano o usano il «rientro dominante»: il suo valore viene impostato da ognuna delle seguenti macro grazie al parametro I<i>. Le macro possono omettere la I<i>, nel qual caso viene usato il rientro dominante attuale. Come risultato, paragrafi rientrati che si susseguano possono usare lo stesso rientro senza rispecificarne il valore. Un paragrafo normale (cioè non rientrato) reimposta il rientro dominante al suo valore predefinito (mezzo pollice). A priori, il rientro si misura in quadratini; è meglio utilizzare quadratini (en) e quadratoni (em) come unità, perché si adattano automaticamente al cambiamento di dimensione dei caratteri. Ulteriori definizioni di macro sono:
pt_br: Seguem abaixo outras macros e strings relevantes. Salvo indicação em contrário, todas as macros introduzem uma quebra (terminam a linha atual do texto). Muitas destas macros definem ou usam a "indentação predominante". O valor "indentação predominante" é definido por qualquer macro que tenha o parâmetro I<i>. As macros podem omitir I<i>, caso em que o valor atual de indentação predominante será usado. Consequentemente, parágrafos indentados sucessivos podem usar a mesma indentação sem que este valor tenha que ser especificado a cada vez. Um parágrafo normal (sem indentação) redefine a indentação predominante para seu valor padrão (0,5 polegada). Por padrão, a indentação dada é medida em "ens". Use "ens" ou "ems" como unidade, porque elas são ajustadas automaticamente quando se muda o tamanho da fonte. As outras macros principais são:

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.04 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
