Repository: sebras/manpages-l10n
Catalog: po/*/man7/man.7.po
Languages: de, es, it, pt_br

source: Start relative margin indent: moves the left margin I<i> to the right (if I<i> is omitted, the prevailing indent value is used). A new prevailing indent is set to 0.5 inches. As a result, all following paragraph(s) will be indented until the corresponding B<\&.RE>.
de: Anfang des relativen Randeinzugs: bewegt den linken Rand I<i> nach rechts (wenn I<i> weggelassen wird, wird der aktuelle Wert für den Einzug verwendet). Der Wert für den Einzug wird neu auf 0,5 Zoll festgesetzt. Als Ergebnis werden alle folgenden Absätze bis zum nächsten BB<\&.RE> eingezogen.
es: Comienza un sangrado de margen relativo: mueve el margen izquierdo I<i> pulgadas a la derecha (si se omite I<i>, se usa el valor del sangrado predominante). Se asigna al sangrado predominante un nuevo valor de 0,5 pulgadas. Como resultado, todos los párrafos siguientes se sangrarán hasta el correspondiente B<\&.RE>.
it: Inizia un rientro relativo del margine; sposta di I<i> il margine sinistro verso destra (se I<i> è omessa, viene usato il valore del rientro principale). Un nuovo rientro principale viene impostato a mezzo pollice; di conseguenza, tutti i paragrafi seguenti vengono rientrati fino al corrispondente B<\&.RE>.
pt_br: Inicia a indentação relativa à margem: move a margem esquerda I<i> para a direita. (Se o I<i> for omitido, é usado o valor da indentação predominante. Uma nova indentação predominante é definida em 0,5 polegada. Consequentemente, todos os parágrafos seguintes serão indentados até o B<\&.RE> correspondente.

source: End relative margin indent and restores the previous value of the prevailing indent.
de: Beendet den relativen Randeinzug und stellt den früheren Wert für den Randeinzug wieder her.
es: Finaliza un sangrado del margen relativo y restaura el valor anterior del sangrado predominante.
it: Termina il rientro relativo del margine e ripristina il valore precedente del rientro dominante.
pt_br: Termina a indentação de margem relativa e restaura os valores anteriores de indentação predominante.

source: Indented paragraph macros
de: Makros für Absätze mit Einzug
es: Macros para Párrafos Sangrados
it: Macro per paragrafi rientrati
pt_br: Macros de indentação de parágrafos

source: Begin paragraph with a hanging indent (the first line of the paragraph is at the left margin of normal paragraphs, and the rest of the paragraph's lines are indented).
de: Anfang eines Absatzes mit hängendem Einzug: Die linke Rand der ersten Zeile des Absatzes stimmt mit dem normaler Absätze überein, die restlichen Zeilen des Absatzes sind eingezogen.
es: Comienza un párrafo con un sangrado colgante (la primera línea del párrafo comienza en el margen izquierdo de los párrafos normales y el resto de líneas del párrafo se sangran).
it: Inizia il paragrafo con un rientro a bandiera (la prima riga del paragrafo inizia al margine sinistro dei paragrafi normali mentre il resto delle righe del paragrafo è indentato).
pt_br: Inicia o parágrafo com uma indentação fixa (a primeira linha do parágrafo está na margem esquerda dos parágrafos normais, e o resto das linhas do parágrafo são indentadas).

source: Indented paragraph with optional hanging tag. If the tag I<x> is omitted, the entire following paragraph is indented by I<i>. If the tag I<x> is provided, it is hung at the left margin before the following indented paragraph (this is just like B<\&.TP> except the tag is included with the command instead of being on the following line). If the tag is too long, the text after the tag will be moved down to the next line (text will not be lost or garbled). For bulleted lists, use this macro with \e(bu (bullet) or \e(em (em dash) as the tag, and for numbered lists, use the number or letter followed by a period as the tag; this simplifies translation to other formats.
de: Eingerückter Absatz mit optionaler hängender Beschriftung. Wenn der Hinweis (das Tag) I<x> weggelassen wird, wird der gesamte folgende Absatz um I<i> eingerückt. Wenn das Tag I<x> vorhanden ist, wird die Beschriftung am linken Rand vor dem folgenden eingerückten Absatz aufgehängt. (Dies entspricht B<\&.TP> mit dem Unterschied, dass die Beschriftung im Befehl enthalten ist und nicht auf der nächsten Zeile steht.) Wenn die Beschriftung zu lang ist, wird der Text nach der Beschriftung auf die nächste Zeile verschoben. (Es geht kein Text verloren, auch wird kein Text verstümmelt.) Für Aufzählungen mit Aufzählungszeichen verwenden Sie dieses Makro mit \e(bu (Aufzählungszeichen) oder \e(em (Geviertstrich) als Beschriftung. Für nummerierte Listen verwenden Sie eine Zahl oder einen Buchstaben, denen ein Punkt folgt. Dies vereinfacht die Übersetzung in andere Formate.
es: Párrafo sangrado con una etiqueta colgante opcional. Si se omite la etiqueta I<x>, todo el párrafo siguiente se sangra I<i> pulgadas. Si se da la etiqueta I<x>, ésta se cuelga en el margen izquierdo antes del siguiente párrafo sangrado (esto es como B<\&.TP> excepto que la etiqueta se incluye con la orden en lugar de al comienzo de la siguiente línea). Si la etiqueta es demasiado larga, el texto tras la etiqueta se bajará a la siguiente línea (el texto no se perderá o se mezclará). Para listas con viñetas, use esta macro con \e(bu (bullet) o \e(em (em dash) como etiqueta, y para listas numeradas, use como etiqueta el número o letra seguido por un punto. Esto simplifica la traducción a otros formatos.
it: Paragrafo rientrato con un'etichetta opzionale a bandiera. Se l'etichetta I<x> è omessa, l'intero paragrafo seguente è rientrato di I<i>. Se l'etichetta I<x> è presente, viene allineata al margine sinistro prima del paragrafo rientrato seguente (è la stessa cosa di B<\&.TP> tranne per il fatto che l'etichetta è inclusa nel comando invece di trovarsi sulla riga successiva). Se l'etichetta è troppo lunga, il testo che la segue viene spostato alla riga seguente (e non verrà né perso né impiastricciato). Per gli elenchi puntati, si usi questa macro con \e(bu (pallino) o \e(em (trattino lungo) come etichetta; per gli elenchi numerati, si usi il numero o la lettera seguiti da un punto come etichetta: ciò semplifica la conversione verso altri formati.
pt_br: Parágrafo indentado com uma tag opcional de fixação. Se a tag I<x> for omitida, o parágrafo seguinte inteiro é indentado com I<i>. Se a tag I<x> for fornecida, ele é colocado na margem esquerda antes do parágrafo indentado seguinte, da mesma forma que B<\&.TP>, exceto que a macro é incluída com o comando ao invés de na linha seguinte. Se a tag for muito longa, o texto que a segue será movido para a linha seguinte (o texto não será perdido ou distorção). Para listas de itens não numerados, usa esta macro com \e(bu (de "bullet" -- bolinha) ou \e(em (travessão) como marcador. Para listas numeradas, use o número ou letra seguido por um ponto como tag. Isto simplifica a tradução para outros formatos.

source: Begin paragraph with hanging tag. The tag is given on the next line, but its results are like those of the B<\&.IP> command.
de: Beginn eines Absatzes mit einer hängenden Beschriftung. Die Beschriftung wird auf der nächsten Zeile angegeben, aber die Ergebnisse ähneln denen des Befehls B<\&.IP>.
es: Comienza un párrafo con una etiqueta colgante. La etiqueta se da en la siguiente línea, su resultado es como el de la orden B<\&.IP>.
it: Incomincia il paragrafo con un'etichetta a bandiera: l'etichetta è sulla riga seguente, ma il risultato è lo stesso del comando B<\&.IP>.
pt_br: Inicia um parágrafo com uma tag pendente. A tag é dada na linha seguinte, mas seus resultados são os mesmos do comando B<\&.IP>.

source: Hypertext link macros
de: Makros für Hypertext-Links
es: Macros de Enlaces de Hipertexto
it: Macro per collegamenti ipertestuali
pt_br: Macros de link de hipertexto

source: Insert a hypertext link to the URI (URL) I<url>, with all text up to the following B<\&.UE> macro as the link text.
de: Fügt einen Hypertext-Link zu der URI (URL) I<URL> ein, wobei sämtlicher Text bis zum folgenden Makro B<\&.UE> der Link-Text ist.
es: Inserta un enlace de hipertexto a la URI (URL) I<url> con todo el texto hasta la siguiente macro B<\&.UE> como texto del enlace.
it: Inserisce un collegamento ipertestuale all'URI (URL) I<url>, con tutto il testo fino alla successiva macro B<\&.UE> come testo del collegamento.
pt_br: Insere um link de hipertexto para a URI (URL) I<url>, com todo o texto até a macro B<\&.UE> seguinte como o texto do link.

source: B<\&.UE> [ I<trailer> ]
de: B<\&.UE> [ I<Nachsatz> ]

source: Terminate the link text of the preceding B<\&.UR> macro, with the optional I<trailer> (if present, usually a closing parenthesis and/or end-of-sentence punctuation) immediately following. For non-HTML output devices (e.g., B<man -Tutf8>), the link text is followed by the URL in angle brackets; if there is no link text, the URL is printed as its own link text, surrounded by angle brackets. (Angle brackets may not be available on all output devices.) For the HTML output device, the link text is hyperlinked to the URL; if there is no link text, the URL is printed as its own link text.
de: Beendet den Link-Text des vorhergehenden Makros B<\&.UR>, wobei der optionale I<Nachsatz> (falls vorhanden, normalerweise eine schließende Klammer und/oder einen Satzendesatzzeichen) sofort folgt. For Ausgabegeräte ohne HTML (z.B. B<man -Tutf8>) folgt dem Link-Text die URL in spitzen Klammern; falls es keinen Link-Text gibt, wird die URL selbst als Link-Text, eingeschlossen in spitze Klammern, ausgegeben. (Nicht auf allen Ausgabegeräten könnten spitze Klammern verfügbar sein.) Für das HTML-Ausgabegerät wird der Link-Text als Hyperlink auf die URL ausgeführt, falls es keinen Link-Text gibt wird die URL selbst als Link-Text ausgegeben.
es: Termina el texto del enlace de la anterior macro B<\ &.UR>, opcionalmente, se puede añadir I<trailer> (si está presente, generalmente es un paréntesis de cierre y / o puntuación al final de la oración). Para los dispositivos de salida que no usan HTML (por ejemplo, B<man-Tutf8>), el texto del enlace va seguido de la URL entre paréntesis angulares; si no hay texto de enlace, se usa para ello la propia URL entre corchetes angulares. (Es posible que los corchetes angulares no estén disponibles en todos los dispositivos de salida). Para el dispositivo de salida HTML, el texto contiene un enlace a la URL; si no hay texto de enlace, se usa la propia URL.
it: Termina il testo del collegamento della precedente macro B<\&.UR>, con il I<trailer> opzionale (se è presente, normalmente una parentesi chiusa e/o una punteggiatura di fine frase) immediatamente dopo. Per i dispositivi di output non HTML (p.es. B<man -Tutf8>), il testo del collegamento è seguito dall'URL in parentesi angolate; se manca il testo del collegamento, l'URL viene stampata così com'è, delimitata da parentesi angolate. (Le parentesi angolate possono non essere disponibili su tutti i dispositivi di output.) Per i dispositivi di output HTML, il testo del collegamento è collegato come ipertesto all'URL; se manca il testo del collegamento, l'URL viene stampata così com'è.
pt_br: Encerra o texto do link da macro B<\&.UR> anterior, com o texto I<final> opcional (se presente, geralmente um parêntese de fechamento e/ou pontuação de fim de frase) imediatamente após. Para dispositivos de saída diferentes de HTML (por exemplo, B<man -Tutf8>), o texto do link é seguido pelo URL entre colchetes angulares (também conhecidos por sinais de maior e menor); se não houver texto de link, a URL é impressa como seu próprio texto de link, cercado por colchetes angulares. (Os colchetes angulares podem não estar disponíveis em todos os dispositivos de saída.) Para o dispositivo de saída HTML, o texto do link é um hiperlink para a URL; se não houver texto de link, a URL é impressa como seu próprio texto de link.

source: These macros have been supported since GNU Troff 1.20 (2009-01-05) and Heirloom Doctools Troff since 160217 (2016-02-17).
de: Diese Makros werden seit GNU-Troff 1.20 (2009-01-05) und Heirloom Doctools Troff seit 160217 (2016-02-17) unterstützt.
es: El soporte para estas macros se introdujo en en la versión 1.20 de GNU Troff (05-01-2009) y en Heirloom Doctools Troff en la versión 160217 (17-02-2016).
it: Queste macro sono state supportate a partire da GNU Troff 1.20 (2009-01-05) e da Heirloom Doctools Troff 160217 (2016-02-17).
pt_br: Estas macros têm suporte desde GNU Troff 1.20 (2009-01-05) e Heirloom Doctools Troff desde 160217 (2016-02-17).

source: Miscellaneous macros
de: Verschiedene Makros
es: Otras Macros
it: Macro varie
pt_br: Outras macros

source: Reset tabs to default tab values (every 0.5 inches); does not cause a break.
de: Stellt den Standardwert für Tabulatoren (alle 0,5 Zoll) wieder her; führt nicht zu einem Zeilenumbruch.
es: Restablece los tabuladores a sus valores por defecto (cada 0,5 pulgadas). No produce una ruptura.
it: Riporta le tabulazioni al valore di tabulazione predefinito (ogni mezzo pollice); non causa un'interruzione.
pt_br: Redefine tabulações com os valores padrão de tabulação (a cada 0,5 polegada) sem introduzir uma quebra.

source: Set inter-paragraph vertical distance to d (if omitted, d=0.4v); does not cause a break.
de: Setzt den vertikalen Abstand zwischen Absätzen auf d (ohne Angabe d=0,4v); führt nicht zu einem Zeilenumbruch.
es: Establece la distancia vertical entre párrafos a d (si se omite, d=0,4v). No produce una ruptura.
it: Imposta la distanza verticale tra paragrafi a d (se omesso, d=0.4v); non causa un'interruzione.
pt_br: Define a distância vertical entre parágrafos para d (se omitido, d=0.4v) sem introduzir uma quebra.

source: Subheading I<t> (like B<\&.SH>, but used for a subsection inside a section).
de: Unterüberschriften (ähnlich wie B<\&.SH>, aber für Unterabschnitte innerhalb eines Abschnitts).
es: Subencabezamiento I<t> (como B<\&.SH>, pero usado para subsecciones dentro de una sección).
it: Sottotitolo I<t> (come B<\&.SH>, ma usato per una sottosezione in una sezione).
pt_br: I<t> de subtítulo (mesmo que B<\&.SH>, mas usado para subseções dentro de uma seção).

source: Predefined strings
de: Vordefinierte Zeichenketten
es: Cadenas Predefinidas
it: Stringhe predefinite
pt_br: Strings predefinidas

source: The B<man> package has the following predefined strings:
de: Zum B<man>-Paket gehören die folgenden vordefinierten Zeichenketten:
es: El paquete B<man> tiene las siguientes cadenas predefinidas:
it: Il pacchetto B<man> ha le seguenti stringhe predefinite:
pt_br: O pacote B<man> tem as seguintes strings predefinidas:

source: Registration Symbol: \*R
de: Anmeldungssymbol: \*R
es: Símbolo de registro: \*R
it: Simbolo di registrazione: \*R
pt_br: Marca registrada: \*R

source: Change to default font size
de: Wechsel zur Standard-Schriftgröße
es: Cambia al tamaño de fuente por omisión
it: Torna alla dimensione predefinita del carattere
pt_br: Muda para tamanho padrão da fonte

source: Trademark Symbol: \*(Tm
de: Markenzeichen: \*(Tm
es: Símbolo de marca registrada: \*(Tm
it: Simbolo del marchio registrato: \*(Tm
pt_br: Marca comercial: \*(Tm

source: Left angled double quote: ``
de: links abgewinkeltes doppeltes Anführungszeichen: ``
es: Comillas dobles españolas izquierdas: ``
it: Doppie virgolette verso sinistra: ``
pt_br: Aspas duplas curvas à esquerda: ``

source: Right angled double quote: ''
de: rechts abgewinkeltes doppeltes Anführungszeichen: ''
es: Comillas dobles españolas derechas: ''
it: Doppie virgolette verso destra: ''
pt_br: Aspas duplas curvas à direito: ''

source: Safe subset
de: Sichere Teilmenge
es: Subconjunto seguro
it: Sottoinsieme sicuro
pt_br: Subconjunto seguro

source: Although technically B<man> is a troff macro package, in reality a large number of other tools process man page files that don't implement all of troff's abilities. Thus, it's best to avoid some of troff's more exotic abilities where possible to permit these other tools to work correctly. Avoid using the various troff preprocessors (if you must, go ahead and use B<tbl>(1), but try to use the B<IP> and B<TP> commands instead for two-column tables). Avoid using computations; most other tools can't process them. Use simple commands that are easy to translate to other formats. The following troff macros are believed to be safe (though in many cases they will be ignored by translators): B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.
de: Obwohl technisch gesehen B<man> ein Troff-Makropaket ist, gibt es eine große Zahl von anderen Werkzeugen, die Handbuchseitendateien verarbeiten und nicht alle Troff-Fähigkeiten implementieren. Daher vermeiden Sie am besten den Einsatz einiger eher exotischer Troff-Fähigkeiten soweit wie möglich, damit andere Werkzeuge korrekt arbeiten können. Vermeiden Sie die Verwendung der verschiedenen Troff-Präprozessoren. (Wenn es sein muss, verwenden Sie B<tbl>(1). Versuchen Sie aber, zweispaltige Tabellen mit den Befehlen B<IP> und B<TP> zu realisieren). Vermeiden Sie Berechnungen, die meisten anderen Werkzeuge können sie nicht verarbeiten. Verwenden Sie einfache Befehle, die leicht in andere Formate zu übersetzen sind. Die folgenden Troff-Makros werden als sicher angesehen: B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.
es: Aunque técnicamente B<man> es una paquete de macros troff, en realidad un gran número de otras herramientas procesan ficheros de páginas de manual que no implementan todas las capacidades de troff. Por tanto, es mejor evitar algunas de las capacidades más exóticas de troff cuando sea posible para permitir que esas otras herramientas funcionen correctamente. Evite usar los diferentes preprocesadores de troff (si debe hacerlo, adelante y use B<tbl>(1), pero intente usar las órdenes B<IP> y B<TP> en su lugar para tablas de dos columnas). Evite hacer cálculos. La mayoría de las otras herramientas no podrán procesarlos. Use órdenes simples que se puedan traducir fácilmente a otros formatos. Las siguientes macros troff se consideran seguras (aunque, en muchos casos, serán ignoradas por los traductores): B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.
it: Sebbene tecnicamente B<man> sia un pacchetto macro troff, in realtà un grande numero di altri strumenti che non implementano tutte le capacità di troff processano file di pagine di manuale. Pertanto è bene evitare alcune delle capacità più esotiche di troff quando possibile, per permettere a questi strumenti di funzionare correttamente. Evitare di usare i vari preprocessori di troff (se si deve, proseguire e usare B<tbl>(1), ma provare ad usare i comandi B<IP> e B<TP> invece delle tabelle a due colonne). Evitare di usare computazioni; molti altri tool non possono processarle. Si usino comandi semplici, che siano facili da tradurre in altri formati. Le seguenti macro troff sono ritenute sicure (anche se in molti casi verranno ignorate dai traduttori): B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.
pt_br: Embora o B<man> seja tecnicamente um pacote de macros troff, muitas ferramentas processam páginas man que não implementam todos os recursos do troff. Portanto, é melhor evitar os recursos mais exóticos para que seja possível permitir que tais ferramentas funcionem corretamente. Evite usar os vários preprocessadores troff. Se isto for inevitável, use o B<tbl>(1), mas tente usar os comandos B<IP> e B<TP> ao invés de tabelas de duas colunas. Evite usar cálculos: a maioria dos programas não os entende. Use comandos simples que sejam fáceis de traduzir para outros formatos. As seguintes macros troff são consideradas seguras, embora muitas vezes sejam ignoradas pelos tradutores: B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.

source: You may also use many troff escape sequences (those sequences beginning with \e). When you need to include the backslash character as normal text, use \ee. Other sequences you may use, where x or xx are any characters and N is any digit, include: B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx>, and B<\ef(xx>. Avoid using the escape sequences for drawing graphics.
de: Sie können auch viele Troff-Escape-Sequenzen verwenden (diese Sequenzen beginnen mit \e). Wenn Sie den umgekehrten Schrägstrich (Backslash) als normalen Text benötigen, verwenden Sie \ee. Sie können auch die folgenden Sequenzen, in denen x oder xx für einen beliebigen Buchstaben und N für eine beliebige Ziffer stehen, verwenden: B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx> und B<\ef(xx>. Vermeiden Sie es, mit Escape-Sequenzen Grafiken zu zeichnen.
es: También puede usar muchas secuencias de escape de troff (aquellas secuencias que comienzan por \e). Cuando necesite incluir el carácter de barra invertida como texto normal, use \ee. Otras secuencias que puede usar, donde x y xx son cualquier carácter y N es cualquier dígito, incluyen: B<\e(aq>, B<\e(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx> y B<\ef(xx>. Evite usar secuencias de escape para dibujar gráficos.
it: Si possono anche usare molte sequenze di escape di troff (queste sequenze iniziano con \e). Quando si ha la necessità di includere il carattere backslash come testo normale usare \ee. Altre sequenze che si possono usare, dove x o xx sono caratteri qualsiasi e N è un numero qualunque, includono: B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx> e B<\ef(xx>. Evitare di usare sequenze di escape per disegni grafici.
pt_br: Você também pode usar as sequências de escape troff (que começam com \e). Quando você precisar incluir um caractere de barra invertida como um texto normal, use \ee. Outras sequências que você pode usar, onde x ou xx são caracteres e N é um dígito, incluem: B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx> e B<\ef(xx>. Evite usar as sequências de escape para desenhar gráficos.
