Repository: sebras/manpages-l10n
Catalog: po/*/man7/man.7.po
Languages: de, es, it, pt_br

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux
it: Manuale del programmatore di Linux
pt_br: Manual do Programador do Linux

source: NAME
de: BEZEICHNUNG
es: NOMBRE
it: NOME
pt_br: NOME

source: man - macros to format man pages
de: man - Makros für das Formatieren von Handbuchseiten
es: man - macros para formatear páginas de manual
it: man - macro per formattare le pagine di manuale
pt_br: man - macros de formatação de páginas de manual

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS
it: SINTASSI
pt_br: SINOPSE

source: B<groff -Tascii -man> I<file> \&...
de: B<groff -Tascii -man> I<Datei> …
es: B<groff -Tascii -man> I<fichero> \&...
pt_br: B<groff -Tascii -man> I<arquivo> \&...

source: B<groff -Tps -man> I<file> \&...
de: B<groff -Tps -man> I<Datei> …
es: B<groff -Tps -man> I<fichero> \&...
pt_br: B<groff -Tps -man> I<arquivo> \&...

source: B<man> [I<section>] I<title>
de: B<man> [I<Abschnitt>] I<Titel>
es: B<man> [I<sección>] I<título>
it: B<man> [I<sezione>] I<titolo>
pt_br: B<man> [I<seção>] I<título>

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN
it: DESCRIZIONE
pt_br: DESCRIÇÃO

source: This manual page explains the B<groff an.tmac> macro package (often called the B<man> macro package). This macro package should be used by developers when writing or porting man pages for Linux. It is fairly compatible with other versions of this macro package, so porting man pages should not be a major problem (exceptions include the NET-2 BSD release, which uses a totally different macro package called mdoc; see B<mdoc>(7)).
de: Diese Handbuchseite beschreibt das B<Groff>-Makropaket B<tmac.an>, das oft als das B<man>-Paket bezeichnet wird. Es sollte von Entwicklern benutzt werden, die Handbuchseiten für Linux schreiben oder portieren. Es ist nahezu vollständig kompatibel zu älteren Versionen dieses Paketes. Daher sollte es relativ problemlos möglich sein, andere Handbuchseiten zu konvertieren. (Zu den Ausnahmen gehört die NET-2 BSD-Veröffentlichung, die das völlig andere Makropaket B<mdoc>(7) benutzt.)
es: Esta página del manual describe el paquete de macros B<groff an.tmac> (a menudo llamado el paquete de macros B<man>). El programador debe usar este paquete de macros cuando escriba o porte páginas del manual para Linux. Al ser bastante compatible con otras versiones, portar páginas del manual no debería dar mayores problemas (con excepción de la distribución incluida en NET-2 BSD, que utiliza un paquete de macros totalmente distinto llamado mdoc. Vea B<mdoc>(7)).
it: Questa pagina illustra il pacchetto di macro B<groff an.tmac> (spesso chiamato pacchetto macro B<man>). Questo pacchetto di macro dovrebbe essere usato dagli sviluppatori quando scrivono o fanno il port delle pagine di manuale per Linux. È abbastanza compatibile con altre versioni di questi pacchetti di macro, quindi fare il port delle pagine di manuale non dovrebbe essere un grosso problema (un'eccezione è NET-2 BSD, che usa un pacchetto di macro completamente differente chiamato mdoc; si veda B<mdoc>(7)).
pt_br: Esta página descreve o pacote de macros B<groff tmac.an> (frequentemente chamado de pacote de macros B<man>). Este pacote de macros deve ser usado por desenvolvedores ao escrever ou portar páginas man para o Linux. É razoavelmente compatível com outras versões do mesmo pacote de macros, de modo que portar as páginas man não deve ser muito difícil (exceções incluem o NET-2 BSD, que usa um pacote de macros totalmente diferente chamado mdoc; veja B<mdoc>(7).

source: Note that NET-2 BSD mdoc man pages can be used with B<groff> simply by specifying the B<-mdoc> option instead of the B<-man> option. Using the B<-mandoc> option is, however, recommended, since this will automatically detect which macro package is in use.
de: Beachten Sie, dass Handbuchseiten von NET-2 BSD mit B<Groff> durch die Nutzung der Option B<-mdoc> anstelle der Option B<-man> benutzt werden können. Es wird die Wahl der Option B<-mandoc> empfohlen, da diese automatisch das benutzte Makropaket erkennt.
es: Dése cuenta que las páginas de manual mdoc de NET-2 BSD se pueden usar con B<groff> simplemente especificando la opción B<-mdoc> en vez de la opción B<-man>. De todas formas, se recomienda utilizar la opción B<-mandoc> porque así detecta de forma automática qué paquete de macros se está utilizando.
it: Si noti che le pagine di manuale NET-2 BSD, in formato mdoc, possono essere usate con B<groff> semplicemente specificando l'opzione B<-mdoc> invece dell'opzione B<-man>. Usare l'opzione B<-mandoc> è, comunque, raccomandato, in quanto rileverà automaticamente quale pacchetto macro è in uso.
pt_br: Observe que as páginas mdoc do NET-2 BSD podem ser usadas com o B<groff> simplesmente especificando a opção B<-mdoc> em vez da opção B<-man>. É recomendável, no entanto, usar a opção B<-mandoc>, que detectará automaticamente o pacote de macros a ser utilizado.

source: For conventions that should be employed when writing man pages for the Linux I<man-pages> package, see B<man-pages>(7).
de: Wenn Sie Handbuchseiten für das Linux-Paket »I<man-pages>« schreiben, lesen Sie bitte B<man-pages>(7). Dort finden Sie die Konventionen, an die Sie sich halten sollten.
es: Por convención, debería usarse cuando se escriban páginas de manual para el paquete I<man-pages>, consulte B<man-pages>(7).
it: Per le convenzioni da usare nella scrittura di pagine di manuale per il pacchetto I<man-pages> di Linux, si veda B<man-pages>(7).
pt_br: Para convenções que devem ser aplicadas apenas ao escrever páginas man para o pacote I<man-pages> do Linux, veja B<man-pages>(7).

source: Title line
de: Titelzeile
es: Línea de título
it: Riga del titolo
pt_br: Linha de título

source: The first command in a man page (after comment lines, that is, lines that start with B<.\e">) should be
de: Der erste Befehl in einer Handbuchseite nach den Kommentarzeilen (die mit B<.\e"> beginnen) sollte
es: La primera orden en una página de manual (después de las líneas de comentarios que empieza por B<.\e">) debería ser
it: Il primo comando in una pagina di manuale (dopo le righe di commento, cioè le righe che iniziano con B<.\e">) dovrebbe essere
pt_br: O primeiro comando em uma página man (após linhas de comentários, ou seja, linhas que iniciam com B<\e">) deve ser

source: B<\&.TH> I<title section date source manual>
de: B<\&.TH> I<Titel Abschnitt Datum Quelle Handbuch>
es: B<\&.TH> I<título sección fecha fuente manual>
it: B<\&.TH> I<titolo sezione data sorgente manuale>
pt_br: B<\&.TH> I<título seção data origem manual>

source: For details of the arguments that should be supplied to the B<TH> command, see B<man-pages>(7).
de: sein. Für Details zu den Argumenten für den Befehlt B<TH> sei auf B<man-pages>(7) verwiesen.
es: Para más información sobre los argumentos de la orden B<TH>, consulte B<man-pages>(7).
it: Per i dettagli degli argomenti da fornire al comando B<TH> si veda B<man-pages>(7).
pt_br: Para detalhes dos argumentos que devem ser fornecidos ao comando B<TH>, veja B<man-pages>(7).

source: Note that BSD mdoc-formatted pages begin with the B<Dd> command, not the B<TH> command.
de: Beachten Sie, dass mit B<mdoc>(7) formatierte BSD-Seiten nicht mit dem Befehl B<TH> beginnen, sondern mit B<Dd>.
es: Dése cuenta que las páginas de manual de BSD con formato mdoc comienzan con la orden B<Dd>, no con la orden B<TH>.
it: Si noti che le pagine formattate con l'mdoc di BSD iniziano col comando B<Dd> invece che col comando B<TH>.
pt_br: Observe que as páginas formatadas em mdoc do BSD começam com o comando B<Dd>, e não com B<TH>.

source: Sections
de: Abschnitte
es: Secciones
it: Sezioni
pt_br: Seções

source: Sections are started with B<\&.SH> followed by the heading name.
de: Abschnitte beginnen mit B<\&.SH>, gefolgt von ihrem Titel.
es: El inicio de las secciones se etiqueta con B<\&.SH> seguido del título.
it: Le sezioni iniziano con un B<\&.SH> seguito dall'intestazione.
pt_br: Seções são iniciadas com B<\&.SH> seguidas pelo nome de cabeçalho.

source: The only mandatory heading is NAME, which should be the first section and be followed on the next line by a one-line description of the program:
de: Der einzige obligatorische Bestandteil ist BEZEICHNUNG. Er sollte der erste Abschnitt werden und in der nächsten Zeile eine einzeilige Beschreibung des Programms folgen:
es: El único encabezado obligatorio es NOMBRE. Debería ser la primera sección e ir seguido de una breve descripción del programa en la siguiente línea:
it: L'unica intestazione obbligatoria è NOME, che dovrebbe essere la prima sezione e dovrebbe essere seguita, sulla riga successiva, da una descrizione del programma della lunghezza di una riga:
pt_br: O único título obrigatório é NAME, que deve ser a primeira seção e ser seguido na próxima linha por uma descrição de uma linha do programa:

source: \&.SH NAME
de: \&.SH BEZEICHNUNG
es: \&.SH NOMBRE
it: \&.SH NOME

source: item \e- description
de: Element \e- Beschreibung
es: nombre \e- descripción
it: nome \e- descrizione
pt_br: item \e- descrição

source: It is extremely important that this format is followed, and that there is a backslash before the single dash which follows the item name. This syntax is used by the B<mandb>(8) program to create a database of short descriptions for the B<whatis>(1) and B<apropos>(1) commands. (See B<lexgrog>(1) for further details on the syntax of the NAME section.)
de: Es ist überaus wichtig, dass dieses Format eingehalten wird und dass ein Rückwärtsschrägstrich (\e) vor dem einzelnen Bindestrich nach dem Elementenamen steht. Dieses Format wird vom Programm B<mandb>(8) benutzt, um eine Datenbank mit Kurzbeschreibungen für die Befehle B<whatis>(1) und B<apropos>(1) aufzubauen. (Lesen Sie B<lexgrog>(1) für weitere Details bezüglich der Syntax des Abschnitts NAME.)
es: Es muy importante respetar este formato así como poner una barra invertida antes del guión que sigue al nombre. La aplicación B<mandb>(8) crea una base de datos con estas descripciones cortas que luego usarán las órdenes B<whatis>(1) y B<apropos>(1). Consulte B<lexrog>(1) para más detalles acerca de la sintaxis de la sección NOMBRE.
it: È molto importante che venga seguito questo formato e che ci sia una barra inversa prima del trattino singolo che segue il nome. Questa sintassi viene usata dal programma B<makewhatis>(8) per creare un database di brevi descrizioni per i comandi B<whatis>(1) e B<apropos>(1) (Si veda B<lexgrog>(1) per ulteriori dettagli sulla sintassi della sezione NOME).
pt_br: É extremamente importante que este formato seja seguido, que haja uma barra invertida antes do traço que segue o nome do item. Esta sintaxe é usada pelo programa B<mandb>(8) para criar um banco de dados de descrições breves para os comandos B<whatis>(1) e B<apropos>(1). (Veja B<lexgrog>(1) para mais detalhes sobre a sintaxe da seção NAME.)

source: For a list of other sections that might appear in a manual page, see B<man-pages>(7).
de: Eine Liste weiterer möglicher Abschnitte einer Handbuchseite finden Sie in B<man-pages>(7).
es: En B<man-pages>(7) tiene una lista de otras secciones que pueden aparecer en una página de manual.
it: Per un elenco di altre sezioni che potrebbero apparire in una pagina di manuale si veda B<man-pages>(7).
pt_br: Para uma lista de outras seções que podem aparecer em uma página de manual, veja B<man-pages>(7).

source: Fonts
de: Schriften
es: Tipos de letra
it: Tipi di carattere
pt_br: Fontes

source: The commands to select the type face are:
de: Die Befehle für die Auswahl der Schriftart sind:
es: Las órdenes para seleccionar el tipo de letra son:
it: I comandi per selezionare il tipo di carattere sono:
pt_br: Os comandos de seleção de tipografia são:

source: Bold
de: Fett
es: Negrita
it: Grassetto
pt_br: Negrito

source: Bold alternating with italics (especially useful for function specifications)
de: Fett, abwechselnd mit kursiv (besonders praktisch für Funktions-Deklarationen)
es: Negrita alternándose con itálica (especialmente útil para la especificación de funciones)
it: Grassetto alternato a corsivo (molto utile per le specifiche delle funzioni)
pt_br: Negrito alternando com itálico (especialmente útil em especificações de funções)

source: Bold alternating with Roman (especially useful for referring to other manual pages)
de: Fett, abwechselnd mit normalem Schrifttyp (besonders praktisch für den Verweis auf andere Handbuchseiten)
es: Negrita alternándose con romana (especialmente útil para referenciar a otras páginas de manual)
it: Grassetto alternato a tondo (molto utile per fare riferimento ad altre pagine di manuale)
pt_br: Negrito alternando com Roman (especialmente útil para referência a outras páginas de manual)

source: Italics
de: Kursiv
es: Itálica
it: Corsivo
pt_br: Itálico

source: Italics alternating with bold
de: Kursiv, abwechselnd mit fett
es: Itálica alternándose con negrita
it: Corsivo alternato a grassetto
pt_br: Itálico alternando com negrito

source: Italics alternating with Roman
de: Kursiv, abwechselnd mit normalem Schrifttyp
es: Itálica alternándose con romana
it: Corsivo alternato a tondo
pt_br: Itálico alternando com Roman

source: Roman alternating with bold
de: Normaler Schrifttyp, abwechselnd mit fett
es: Romana alternándose con negrita
it: Tondo alternato a grassetto
pt_br: Roman alternando com negrito

source: Roman alternating with italics
de: Normaler Schrifttyp, abwechselnd mit kursiv
es: Romana alternándose con itálica
it: Tondo alternato a corsivo
pt_br: Roman alternando com itálico

source: Small alternating with bold
de: Klein, abwechselnd mit fett
es: Pequeña alternándose con negrita
it: Maiuscoletto alternato a grassetto
pt_br: Pequeno alternando com negrito

source: Small (useful for acronyms)
de: Klein (praktisch für Akronyme)
es: Pequeña (útil para acrónimos)
it: Maiuscoletto (utile per gli acronimi)
pt_br: Pequeno (usado para acrônimos)

source: Traditionally, each command can have up to six arguments, but the GNU implementation removes this limitation (you might still want to limit yourself to 6 arguments for portability's sake). Arguments are delimited by spaces. Double quotes can be used to specify an argument which contains spaces. For the macros that produce alternating type faces, the arguments will be printed next to each other without intervening spaces, so that the B<\&.BR> command can be used to specify a word in bold followed by a mark of punctuation in Roman. If no arguments are given, the command is applied to the following line of text.
de: Traditionell darf ein Befehl bis zu sechs Argumente haben, doch die GNU-Version überschreitet diese Begrenzung. (Sie werden sich aber vielleicht trotzdem auf sechs Argumente beschränken, um portable Handbuchseiten zu schreiben.) Die Argumente werden durch Leerzeichen getrennt. Sollen Argumente Leerzeichen enthalten, müssen die Argumente in doppelte Anführungszeichen eingeschlossen werden. Für die Makros, die wechselnde Schriftarten erstellen, werden hintereinander ohne die dazwischenliegenden Leerzeichen ausgegeben, sodass beispielsweise mit dem Befehl B<\&.BR> ein Wort im Fettdruck, gefolgt von einem Wort im normalen Schrifttyp dargestellt werden kann. Ohne Argumente wird der Befehl auf die nächste Textzeile angewendet.
es: Tradicionalmente, cada orden puede tener seis argumentos como máximo, pero la implementación de GNU elimina esta limitación (aunque tal vez usted todavía quiera limitarse a 6 argumentos en aras de la portabilidad). Los argumentos se delimitan por espacios y si el propio argumento contiene espacios, se deben usar comillas dobles. Para las macros que producen tipos de letra alternos, los argumentos se imprimirán uno al lado del otro sin espacios intermedios, de modo que la orden B<\ &.BR> se puede utilizar para especificar una palabra en negrita seguida de un signo de puntuación. Si no se proporcionan argumentos, la orden se aplica a la siguiente línea de texto.
it: Tradizionalmente, ogni comando può avere fino a sei argomenti, ma l'implementazione GNU rimuove questa limitazione (ci si può comunque limitare a sei argomenti per compatibilità). Gli argomenti sono delimitati da spazi. Le virgolette doppie possono essere usate per specificare un argomento che contiene spazi. Per le macro che producono tipi di carattere alternati, gli argomenti verranno stampati uno vicino all'altro senza spazi, così il comando B<\&.BR> può essere usato per specificare una parola in grassetto seguita da un punto in tondo. Se non ci sono argomenti, il comando si applica alla successiva riga di testo.
pt_br: Tradicionalmente, cada comando pode ter até seis argumentos, mas a implementação do GNU remove esta limitação (você ainda pode querer se limitar a 6 argumentos visando a portabilidade). Os argumentos são separados por espaços. Aspas duplas podem ser usadas para especificar um argumento que contenha espaços. Para as macros que produzem tipografias alternativas, os argumentos serão impressos lado a lado sem espaços, de modo que o comando B<\&.BR> possa ser usado para especificar uma palavra em negrito seguida por pontuação em Roman. Se não houver argumentos, o comando se aplica à linha seguinte do texto.

source: Other macros and strings
de: Weitere Makros und Zeichenketten
es: Otras macros y cadenas
it: Altre macro e stringhe
pt_br: Outras macros e strings

source: Below are other relevant macros and predefined strings. Unless noted otherwise, all macros cause a break (end the current line of text). Many of these macros set or use the "prevailing indent". The "prevailing indent" value is set by any macro with the parameter I<i> below; macros may omit I<i> in which case the current prevailing indent will be used. As a result, successive indented paragraphs can use the same indent without respecifying the indent value. A normal (nonindented) paragraph resets the prevailing indent value to its default value (0.5 inches). By default, a given indent is measured in ens; try to use ens or ems as units for indents, since these will automatically adjust to font size changes. The other key macro definitions are:
de: Im Folgenden werden weitere relevante Makros und vordefinierte Zeichenfolgen aufgelistet. Sofern nicht anders angegeben, beenden alle Makros die aktuelle Textzeile. Viele dieser Makros setzen oder verwenden den aktuellen »vorherrschenden Einzug« (prevailing indent). Der Wert für den Einzug wird für jedes Makro mit dem unten erläuterten Parameter I<i> bestimmt. Makros können I<i> auslassen und so der bisher verwendete Einzug beibehalten werden. Als Ergebnis können die folgenden Absätze den gleichen Einzug verwenden, ohne diesen erneut einzugeben. Ein normaler (nicht eingezogener) Absatz setzt den Einzug wieder auf den Standardwert (0,5 Zoll) zurück. Standardmäßig wird der Einzug in der typografischen Einheit En gemessen. Versuchen Sie, die Einzüge in den Einheiten En oder Em festzulegen, da diese sich automatisch an Änderungen der Schriftgröße anpassen. Weitere wichtige Makros sind wie folgt definiert:
es: A continuación hay otras macros relevantes y cadenas predefinidas. A no ser que se indique lo contrario, todas las macros provocan un salto (fin de la línea actual de texto). Muchas de estas macros configuran o usan el "sangrado predominante". Cualquier macro con el parámetro I<i> debajo, asigna un valor al "sangrado predominante". Las macros pueden omitir la I<i> en cuyo caso se usará el actual sangrado predominante. Como resultado, los párrafos identados que hay a continuación pueden usar el mismo sangrado sin necesidad de redefinir su valor. Un párrafo normal (sin sangrado) restaura el valor del sangrado predominante a su valor por omisión (0,5 pulgadas). Por defecto, un sangrado dado se mide en ens. Intente utiliza siempre ens o ems como unidades de medida en las identaciones, ya que éstas se ajustarán automáticamente a los cambios en el tamaño de las fuentes. Las otras definiciones de macro claves son:
it: Seguono altre macro importanti e stringhe predefinite. A meno che non sia specificato diversamente, ogni macro causa un'interruzione (la fine dell'attuale riga di testo). Molte di queste macro impostano o usano il «rientro dominante». Il suo valore viene impostato da ognuna delle seguenti macro grazie al parametro I<i>; le macro possono omettere la I<i>, nel qual caso viene usato il rientro dominante attuale. Come risultato, paragrafi rientrati che si susseguano possono usare lo stesso rientro senza rispecificarne il valore. Un paragrafo normale (cioè non rientrato) reimposta il rientro dominante al suo valore predefinito (mezzo pollice). A priori, il rientro si misura in quadratini; è meglio utilizzare quadratini (en) e quadratoni (em) come unità, perché si adattano automaticamente al cambiamento di dimensione dei caratteri. Ulteriori definizioni di macro sono:
pt_br: Seguem abaixo outras macros e strings relevantes. Salvo indicação em contrário, todas as macros introduzem uma quebra (terminam a linha atual do texto). Muitas destas macros definem ou usam a "indentação predominante". O valor "indentação predominante" é definido por qualquer macro que tenha o parâmetro I<i>. As macros podem omitir I<i>, caso em que o valor atual de indentação predominante será usado. Consequentemente, parágrafos indentados sucessivos podem usar a mesma indentação sem que este valor tenha que ser especificado a cada vez. Um parágrafo normal (sem indentação) redefine a indentação predominante para seu valor padrão (0,5 polegada). Por padrão, a indentação dada é medida em "ens". Use "ens" ou "ems" como unidade, porque elas são ajustadas automaticamente quando se muda o tamanho da fonte. As outras macros principais são:

source: Normal paragraphs
de: Normale Absätze
es: Párrafos Normales
it: Paragrafi normali
pt_br: Parágrafos normais

source: Same as B<\&.PP> (begin a new paragraph).
de: Das Gleiche wie B<\&.PP> (einen neuen Absatz anfangen)
es: Lo mismo que B<\&.PP> (comienza un nuevo párrafo).
it: Lo stesso di B<\&.PP> (inzia un nuovo paragrafo).
pt_br: Assim como B<\&.PP> (começar novo parágrafo).

source: Begin a new paragraph and reset prevailing indent.
de: Einen neuen Absatz anfangen und den Einzug zurücksetzen
es: Comienza un nuevo párrafo y restaura el sangrado predominante.
it: Incomincia un nuovo paragrafo e reimposta il rientro dominante.
pt_br: Começa novo parágrafo e redefine a indentação predominante.

source: Relative margin indent
de: Relativer Randeinzug
es: Sangrado de Margen Relativo
it: Rientro relativo del margine
pt_br: Indentação relativa à margem
