Repository: sebras/manpages-l10n
Catalog: po/*/man7/namespaces.7.po
Languages: de, fr

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux

source: NAME
de: BEZEICHNUNG
fr: NOM

source: namespaces - overview of Linux namespaces
de: namespaces - Überblick über Linux-Namensräume
fr: espaces de noms – Présentation des espaces de noms sous Linux

source: DESCRIPTION
de: BESCHREIBUNG

source: A namespace wraps a global system resource in an abstraction that makes it appear to the processes within the namespace that they have their own isolated instance of the global resource. Changes to the global resource are visible to other processes that are members of the namespace, but are invisible to other processes. One use of namespaces is to implement containers.
de: Ein Namensraum hüllt eine globale Systemressource in eine Abstraktion ein, so dass es den Prozessen innerhalb des Namensraums so erscheint, als ob sie ihre eigene, isolierte Instanz der globalen Ressource hätten. Änderungen an der globalen Ressource sind für andere Prozesse, die Mitglied des Namensraums sind, sichtbar, sind aber für alle anderen Prozesse unsichtbar. Ein Anwendungsfall für Namensräume ist die Implementierung von Containern.
fr: Un espace de noms transforme une ressource globale du système en une abstraction qui la présente aux processus dans cet espace de noms comme une instance indépendante de la ressource globale. Seuls les processus qui appartiennent à l'espace de noms peuvent voir les changements apportés à la ressource globale. Les espaces de noms sont notamment utilisés mettre en œuvre les conteneurs.

source: This page provides pointers to information on the various namespace types, describes the associated I</proc> files, and summarizes the APIs for working with namespaces.
de: Diese Seite stellt Verweise auf Informationen über die verschiedenen Namensraumtypen bereit, beschreibt die zugehörigen Dateien in I</proc> und fasst das API zum Arbeiten mit Namensräumen zusammen.
fr: Cette page présente les différents espaces de noms, leurs fichiers I</proc> respectifs, et récapitule les API qui permettent de travailler avec ces espaces de noms.

source: Namespace types
de: Namensraumtypen
fr: Types d’espaces de noms

source: The following table shows the namespace types available on Linux. The second column of the table shows the flag value that is used to specify the namespace type in various APIs. The third column identifies the manual page that provides details on the namespace type. The last column is a summary of the resources that are isolated by the namespace type.
de: Die nachfolgende Tabelle zeigt die unter Linux verfügbaren Namensraumtypen. Die zweite Spalte der Tabelle zeigt den Schalterwert, der zur Angabe des Namensraumtyps in verschiedenen APIs verwandt wird. Die dritte Spalte identifiziert die Handbuchseite, die Details über den Namensraumtyp bereitstellt. Die letzte Spalte ist eine Zusammenfassung der Ressourcen, die durch den Namensraumtyp isoliert werden.
fr: La table suivante présente les types d’espace de noms disponibles dans Linux. La seconde colonne présente la valeur de l’indicateur utilisé pour indiquer le type d’espace de noms dans les diverses API. La troisième colonne indique la page de manuel qui fournit des détails sur le type d’espace de noms. La dernière colonne est un résumé des ressources qui sont isolées par le type d’espace de noms.

source: Namespace
de: Namensraum
fr: Espaces de noms

source: Flag
de: Schalter
fr: Indicateur

source: Page
de: Seite

source: Isolates
de: isoliert
fr: Isolation

source: Cgroup root directory
de: Cgroup-Wurzelverzeichnis
fr: Répertoire racine cgroup

source: System V IPC, POSIX message queues
de: System V IPC, POSIX-Nachrichtenwarteschlangen
fr: IPC System V, files de messages POSIX

source: Network
de: Netzwerk
fr: Réseau

source: Network devices, stacks, ports, etc.
de: Netzwerkgeräte, Stacks, Ports, usw.
fr: Périphériques réseau, piles, ports, etc.

source: Mount
de: Einhängungen
fr: Montage

source: Mount points
de: Einhängepunkte
fr: Points de montage

source: Process IDs
de: Prozesskennungen
fr: Identifiants de processus (PID)

source: Time
de: Zeit
fr: Temps

source: Boot and monotonic clocks
de: Startzeit und monotone Uhren
fr: Horloges de démarrage et monotones

source: User and group IDs
de: Benutzer- und Gruppenkennungen
fr: ID utilisateur et groupe

source: Hostname and NIS domain name
de: Rechnername und NIS- Domain-Name
fr: Nom d'hôte et nom de domaine NIS

source: The namespaces API
de: Das Namensraum-API
fr: API des espaces de noms

source: As well as various I</proc> files described below, the namespaces API includes the following system calls:
de: Neben verschiedenen, nachfolgend beschriebenen Dateien in I</proc> enthält das Namensraum-API die folgenden Systemaufrufe:
fr: En plus des divers fichiers I</proc> décrits plus bas, l'API des espaces de noms comprend les appels systèmes suivants :

source: The B<clone>(2) system call creates a new process. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed above, then new namespaces are created for each flag, and the child process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
de: Der Systemaufruf B<clone>(2) erstellt einen neuen Prozess. Falls das Argument I<Schalter> des Aufrufs einen oder mehrere der oben aufgeführten Schalter B<CLONE_NEW*> enthält, dann werden für jeden der Schalter neue Namensräume erstellt und der Kindprozess wird zum Mitglied in jedem dieser Namensräume gemacht. (Dieser Systemaufruf implementiert auch eine Reihe von Funktionalitäten ohne Bezug zu Namensräumen.)

source: The B<setns>(2) system call allows the calling process to join an existing namespace. The namespace to join is specified via a file descriptor that refers to one of the I</proc/[pid]/ns> files described below.
de: Der Systemaufruf B<setns>(2) erlaubt es dem aufrufenden Prozess, einem bestehenden Namensraum beizutreten. Der beizutretende Namensraum wird über einen Dateideskriptor festgelegt, der sich auf eine der nachfolgend beschriebenen Dateien in I</proc/[PID]/ns> bezieht.
fr: L'appel système B<setns>(2) permet à un processus appelant de rejoindre un espace de noms existant. Cet espace de noms est précisé au moyen d'un descripteur de fichier qui renvoie vers l'un des fichiers I</proc/[pid]/ns> décrits ci-dessous.

source: The B<unshare>(2) system call moves the calling process to a new namespace. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed above, then new namespaces are created for each flag, and the calling process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
de: Der Systemaufruf B<unshare>(2) verschiebt den aufrufenden Prozess in einen neuen Namensraum. Falls das Argument I<Schalter> des Aufrufs einen oder mehrere der oben aufgeführten Schalter B<CLONE_NEW*> enthält, dann werden für jeden der Schalter neue Namensräume erstellt und der Kindprozess wird zum Mitglied in jedem dieser Namensräume gemacht. (Dieser Systemaufruf implementiert auch eine Reihe von Funktionalitäten ohne Bezug zu Namensräumen.)

source: Various B<ioctl>(2) operations can be used to discover information about namespaces. These operations are described in B<ioctl_ns>(2).
de: Verschiedene B<ioctl>(2)-Aktionen können zum Ermitteln von Informationen über Namensräume verwandt werden. Diese Aktionen sind in B<ioctl_ns>(2) beschrieben.
fr: Diverses opérations B<ioctl>(2) peuvent être utilisées pour connaître des informations à propos des espaces de noms. Ces opérations sont décrites dans B<ioctl_ns>(2).

source: Creation of new namespaces using B<clone>(2) and B<unshare>(2) in most cases requires the B<CAP_SYS_ADMIN> capability, since, in the new namespace, the creator will have the power to change global resources that are visible to other processes that are subsequently created in, or join the namespace. User namespaces are the exception: since Linux 3.8, no privilege is required to create a user namespace.
de: In den meisten Fällen benötigt die Erstellung neuer Namensräume mittels B<clone>(2) und B<unshare>(2) die Capability B<CAP_SYS_ADMIN>, da der Ersteller in den neuen Namensräumen die Macht hat, globale Ressourcen zu ändern, die für andere Prozessen sichtbar sind, die nachfolgend in dem Namensraum erstellt werden oder diesem beitreten. Benutzernamensräume sind eine Ausnahme: seit Linux 3.8 werden keine Privilegien zur Erstellung eines Benutzernamensraums benötigt.
fr: Dans la plupart des cas, la création de nouveaux espaces de noms en utilisant B<clone>(2) ou B<unshare>(2) nécessite de disposer de la capacité B<CAP_SYS_ADMIN>, puisque, dans le nouvel espace de noms, le créateur aura le pouvoir de changer les ressources globales qui sont visibles aux autres processus qui y sont créés ultérieurement ou de joindre l’espace de noms. Les espaces de noms utilisateur forment une exception : à partir de Linux 3.8, la création d'un espace de noms utilisateur ne nécessite pas de privilège particulier.

source: The /proc/[pid]/ns/ directory
de: Das Verzeichnis /proc/[PID]/ns/
fr: Le répertoire /proc/[pid]/ns/

source: Each process has a I</proc/[pid]/ns/> subdirectory containing one entry for each namespace that supports being manipulated by B<setns>(2):
de: Jeder Prozess verfügt über ein Unterverzeichnis I</proc/[PID]/ns/>, das einen Eintrag für jeden Namensraum enthält, der die Manipulation mittels B<setns>(2) erlaubt:
fr: Chaque processus a un sous-répertoire I</proc/[pid]/ns/> contenant une entrée pour chaque espace de noms qui prend en charge sa manipulation par B<setns>(2) :

source: Bind mounting (see B<mount>(2)) one of the files in this directory to somewhere else in the filesystem keeps the corresponding namespace of the process specified by I<pid> alive even if all processes currently in the namespace terminate.
de: Durch Bind-Einhängungen (siehe B<mount>(2)) einer der Dateien in diesem Verzeichnis an einen anderen Platz im Dateisystem wird der entsprechende Namensraum des durch I<PID> festgelegten Prozesses am Leben erhalten, selbst wenn alle derzeit im Namensraum befindlichen Prozesse beendet werden.
fr: Lier le montage (consulter B<mount>(2)) d'un des fichiers de ce répertoire dans un autre emplacement du système de fichiers maintient l'espace de noms du processus désigné par I<pid> en fonctionnement, même si tous les processus de l'espace de noms sont terminés.

source: Opening one of the files in this directory (or a file that is bind mounted to one of these files) returns a file handle for the corresponding namespace of the process specified by I<pid>. As long as this file descriptor remains open, the namespace will remain alive, even if all processes in the namespace terminate. The file descriptor can be passed to B<setns>(2).
de: Öffnen einer der Dateien in diesem Verzeichnis (oder einer Datei, die auf eine dieser Dateien bind-eingehängt ist) liefert einen Datei-Handle auf den Namensraum zurück, der dem durch I<PID> festgelegten Prozess entspricht. Solange dieser Dateideskriptor offen bleibt, wird der Namensraum am Leben bleiben, selbst falls alle Prozesse in diesem Namensraum beendet werden. Der Dateideskriptor kann an B<setns>(2) weitergegeben werden.
fr: L'ouverture d'un des fichiers de ce répertoire (ou d'un fichier qui est un montage bind de l'un de ces fichiers) renvoie un gestionnaire de fichier pour l'espace de noms correspondant au processus désigné par I<pid>. Tant que ce descripteur de fichier est ouvert, l'espace de noms reste opérationnel, même si tous les processus de l'espace de noms sont terminés. Le descripteur de fichier peut être transmis au moyen de B<setns>(2).

source: In Linux 3.7 and earlier, these files were visible as hard links. Since Linux 3.8, they appear as symbolic links. If two processes are in the same namespace, then the device IDs and inode numbers of their I</proc/[pid]/ns/xxx> symbolic links will be the same; an application can check this using the I<stat.st_dev> and I<stat.st_ino> fields returned by B<stat>(2). The content of this symbolic link is a string containing the namespace type and inode number as in the following example:
de: Unter Linux 3.7 und älter waren diese Dateien als harte Links sichtbar. Seit Linux 3.8 erscheinen sie als symbolische Links. Falls zwei Prozesse im gleichen Namensraum sind, dann werden die Gerätekennungen und Inode-Nummern ihrer symbolischen Links I</proc/[PID]/ns/xxx> identisch sein; die Anwendung kann dies mittels der von B<stat>(2) zurückgelieferten Felder I<stat.st_dev> und I<stat.st_ino> überprüfen. Der Inhalt dieses symbolischen Links ist eine Zeichenkette, die den Namensraumtyp und die Inode-Nummer wie im folgenden Beispiel enthält:
fr: Jusqu’à la version 3.7 de Linux (incluse), ces fichiers apparaissaient comme des liens physiques. À partir de Linux 3.8, ils apparaissent comme des liens symboliques. Si deux processus sont dans le même espace de noms, alors ils auront les mêmes identifiants de périphérique et leurs numéros d’inœud pour leurs liens symboliques I</proc/[pid]/ns/xxx> seront les mêmes. Une application peut consulter cette information grâce aux champs I<stat.st_dev> et I<stat.st_ino> renvoyés par B<stat>(2). Le contenu de ce lien symbolique est une chaîne de caractères contenant le type de l'espace de noms et le numéro d'inœud, comme dans l'exemple suivant :

source: The symbolic links in this subdirectory are as follows:
de: Die symbolischen Links in diesem Unterverzeichnis sind wie folgt:
fr: Les liens symboliques dans ce sous-répertoire sont les suivants :

source: I</proc/[pid]/ns/cgroup> (since Linux 4.6)
de: I</proc/[PID]/ns/cgroup> (seit Linux 4.6)
fr: I</proc/[pid]/ns/cgroup> (depuis Linux 4.6)

source: This file is a handle for the cgroup namespace of the process.
de: Diese Datei ist ein Handle für den Cgroup-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms cgroup du processus.

source: I</proc/[pid]/ns/ipc> (since Linux 3.0)
de: I</proc/[PID]/ns/ipc> (seit Linux 3.0)
fr: I</proc/[pid]/ns/ipc> (depuis Linux 3.0)

source: This file is a handle for the IPC namespace of the process.
de: Diese Datei ist ein Handle für den IPC-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms IPC du processus.

source: I</proc/[pid]/ns/mnt> (since Linux 3.8)
de: I</proc/[PID]/ns/mnt> (seit Linux 3.8)
fr: I</proc/[pid]/ns/mnt> (depuis Linux 3.8)

source: This file is a handle for the mount namespace of the process.
de: Diese Datei ist ein Handle für den Einhänge-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms montage du processus.

source: I</proc/[pid]/ns/net> (since Linux 3.0)
de: I</proc/[PID]/ns/net> (seit Linux 3.0)
fr: I</proc/[pid]/ns/net> (depuis Linux 3.0)

source: This file is a handle for the network namespace of the process.
de: Diese Datei ist ein Handle für den Netzwerk-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms réseau du processus.

source: I</proc/[pid]/ns/pid> (since Linux 3.8)
de: I</proc/[PID]/ns/pid> (seit Linux 3.8)
fr: I</proc/[pid]/ns/pid> (depuis Linux 3.8)

source: This file is a handle for the PID namespace of the process. This handle is permanent for the lifetime of the process (i.e., a process's PID namespace membership never changes).
de: Diese Datei ist ein Handle für den PID-Namensraum des Prozesses. Dieses Handle ist für die Lebenszeit des Prozesses dauerhaft (d.h. die PID-Namensraumzugehörigkeit eines Prozesses ändert sich niemals).
fr: Ce fichier est un descripteur pour l'espace de noms PID du processus. Ce descripteur est permanent pour toute la durée de vie du processus (c’est-à-dire que l’appartenance de l’espace de noms PID ne change jamais).

source: I</proc/[pid]/ns/pid_for_children> (since Linux 4.12)
de: I</proc/[PID]/ns/pid_for_children> (seit Linux 4.12)
fr: I</proc/[pid]/ns/pid_for_children> (depuis Linux 4.12)

source: This file is a handle for the PID namespace of child processes created by this process. This can change as a consequence of calls to B<unshare>(2) and B<setns>(2) (see B<pid_namespaces>(7)), so the file may differ from I</proc/[pid]/ns/pid>. The symbolic link gains a value only after the first child process is created in the namespace. (Beforehand, B<readlink>(2) of the symbolic link will return an empty buffer.)
de: Diese Datei ist ein Handle für den PID-Namensraum des durch diesen Prozess erstellten Kind-Prozesses. Dieser kann sich als Konsequenz aus Aufrufen von B<unshare>(2) und B<setns>(2) ändern (siehe B<pid_namespaces>(7)), daher kann sich die Datei von I</proc/[PID]/ns/pid> unterscheiden. Der symbolische Link wird erst nach der Erstellung des ersten Kindprozesses in den Namensraum wertvoll. (Vorher wird ein B<readlink>(2) von dem symbolischen Link einen leeren Puffer zurückgeben.)
fr: Ce fichier est un descripteur pour l’espace de noms PID des processus enfant créés par ce processus. Cela peut changer comme conséquence des appels à B<unshare>(2) et B<setns>(2) (consultez B<pid_namespaces>(7)), aussi le fichier peut différer de I</proc/[pid]/ns/pid>. Le lien symbolique obtient une valeur seulement après que le premier processus enfant soit créé dans cet espace de noms. Auparavant, B<readlink>(2) sur le lien symbolique renvoyait un tampon vide.

source: I</proc/[pid]/ns/time> (since Linux 5.6)
de: I</proc/[PID]/ns/time> (seit Linux 5.6)
fr: I</proc/[pid]/ns/time> (depuis Linux 5.6)

source: This file is a handle for the time namespace of the process.
de: Diese Datei ist ein Handle für den Zeit-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms temps du processus.

source: I</proc/[pid]/ns/time_for_children> (since Linux 5.6)
de: I</proc/[PID]/ns/time_for_children> (seit Linux 5.6)
fr: I</proc/[pid]/ns/time_for_children> (depuis Linux 5.6)

source: This file is a handle for the time namespace of child processes created by this process. This can change as a consequence of calls to B<unshare>(2) and B<setns>(2) (see B<time_namespaces>(7)), so the file may differ from I</proc/[pid]/ns/time>.
de: Diese Datei ist ein Handle für den Zeit-Namensraum des durch diesen Prozess erstellten Kind-Prozesses. Dieser kann sich als Konsequenz aus Aufrufen von B<unshare>(2) und B<setns>(2) ändern (siehe B<time_namespaces>(7)), daher kann sich die Datei von I</proc/[PID]/ns/time> unterscheiden.
fr: Ce fichier est un descripteur pour l’espace de noms temps des processus enfant créés par ce processus. Cela peut changer comme conséquence des appels à B<unshare>(2) et B<setns>(2) (consultez B<time_namespaces>(7)), aussi le fichier peut différer de I</proc/[pid]/ns/time>.

source: I</proc/[pid]/ns/user> (since Linux 3.8)
de: I</proc/[PID]/ns/user> (seit Linux 3.8)
fr: I</proc/[pid]/ns/user> (depuis Linux 3.8)

source: This file is a handle for the user namespace of the process.
de: Diese Datei ist ein Handle für den Benutzer-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms utilisateur du processus.

source: I</proc/[pid]/ns/uts> (since Linux 3.0)
de: I</proc/[PID]/ns/uts> (seit Linux 3.0)
fr: I</proc/[pid]/ns/uts> (depuis Linux 3.0)

source: This file is a handle for the UTS namespace of the process.
de: Diese Datei ist ein Handle für den UTS-Namensraum des Prozesses.
fr: Ce fichier est un descripteur pour l'espace de noms UTS du processus.

source: Permission to dereference or read (B<readlink>(2)) these symbolic links is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS> check; see B<ptrace>(2).
de: Die Berechtigungen, diese symbolischen Links zu dereferenzieren oder zu lesen (B<readlink>(2)) werden durch eine Ptrace-Zugriffsmodusüberprüfung B<PTRACE_MODE_READ_FSCREDS> gesteuert; siehe B<ptrace>(2).
fr: La permission de déréférencer ou lire (B<readlink>(2)) ces liens symboliques est contrôlée par une vérification B<PTRACE_MODE_READ_FSCREDS> du mode d’accès ptrace. Consultez B<ptrace>(2).

source: The /proc/sys/user directory
de: Das Verzeichnis I</proc/sys/user>
fr: Répertoire /proc/sys/user

source: The files in the I</proc/sys/user> directory (which is present since Linux 4.9) expose limits on the number of namespaces of various types that can be created. The files are as follows:
de: Die Dateien im Verzeichnis I</proc/sys/user> (das seit Linux 4.9 vorhanden ist) legen die Begrenzungen für die Anzahl der Namensräume der verschiedenen Typen fest, die erstellt werden können. Die Dateien sind wie folgt:
fr: Les fichiers dans le répertoire I</proc/sys/user> (qui existe depuis Linux 4.9) expose les limites du nombre d’espaces de noms des divers types pouvant être créés. Ces fichiers sont les suivants :

source: The value in this file defines a per-user limit on the number of cgroup namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der Cgroup-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms cgroup pouvant être créés dans l’espace de noms utilisateur.

source: The value in this file defines a per-user limit on the number of ipc namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der IPC-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms IPC pouvant être créés dans l’espace de noms utilisateur.

source: The value in this file defines a per-user limit on the number of mount namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der Einhänge-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms montage pouvant être créés dans l’espace de noms utilisateur.

source: The value in this file defines a per-user limit on the number of network namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der Netzwerk-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms réseau pouvant être créés dans l’espace de noms utilisateur.

source: The value in this file defines a per-user limit on the number of PID namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der PID-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms PID pouvant être créés dans l’espace de noms utilisateur.

source: I<max_time_namespaces> (since Linux 5.7)
de: I<max_time_namespaces> (seit Linux 5.7)
fr: I<max_time_namespaces> (depuis Linux 5.7)

source: The value in this file defines a per-user limit on the number of time namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der Zeit-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms temps pouvant être créés dans l’espace de noms utilisateur.
