Repository: sebras/manpages-l10n
Catalog: po/*/man7/namespaces.7.po
Languages: de, fr

source: The value in this file defines a per-user limit on the number of user namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der Benutzer-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms utilisateur pouvant être créés dans l’espace de noms utilisateur.

source: The value in this file defines a per-user limit on the number of uts namespaces that may be created in the user namespace.
de: Der Wert in dieser Datei definiert eine benutzerbezogene Begrenzung für die Anzahl der UTS-Namensräume, die in dem Benutzernamensraum erstellt werden können.
fr: Cette valeur dans le fichier définit une limite par utilisateur du nombre d’espaces de noms UTS pouvant être créés dans l’espace de noms utilisateur.

source: Note the following details about these files:
de: Beachten Sie die folgenden Details über diese Dateien:
fr: Remarquez les points suivants concernant ces fichiers :

source: The values in these files are modifiable by privileged processes.
de: Die Werte in diesen Dateien können von privilegierten Prozessen verändert werden.
fr: Les valeurs dans ces fichiers sont modifiables par les processus privilégiés.

source: The values exposed by these files are the limits for the user namespace in which the opening process resides.
de: Die in diesen Dateien offengelegten Werte sind die Begrenzungen für die Benuzernamensräume, in denen sich der öffnende Prozess befindet.
fr: Les valeurs indiquées par ces fichiers sont les limites pour l’espace de noms utilisateur dans lequel le processus ouvert réside.

source: The limits are per-user. Each user in the same user namespace can create namespaces up to the defined limit.
de: Die Begrenzungen gelten pro Benutzer. Jeder Benutzer in dem gleichen Benutzernamensraum kann Namensräume bis zu der definierten Begrenzung erstellen.
fr: Les limites sont pour chaque utilisateur. Chaque utilisateur dans le même espace de noms peut créer des espaces de noms jusqu’à la limite définie.

source: The limits apply to all users, including UID 0.
de: Die Begrenzungen gelten für alle Benutzer, einschließlich UID 0.
fr: Les limites s’appliquent à tous les utilisateurs, incluant l’UID 0.

source: These limits apply in addition to any other per-namespace limits (such as those for PID and user namespaces) that may be enforced.
de: Diese Begrenzungen gelten zusätzlich zu anderen, auf Namensräume bezogenen Begrenzungen (wie diese für PID- und Benutzernamensräume), die durchgesetzt werden könnten.
fr: Ces limites s’appliquent en plus de n’importe quelles autres limites par espace de noms (tels que les espaces de noms PID ou utilisateur) qui peuvent être imposées.

source: Upon encountering these limits, B<clone>(2) and B<unshare>(2) fail with the error B<ENOSPC>.
de: Beim Erreichen dieser Beschränkungen werden B<clone>(2) und B<unshare>(2) mit dem Fehler B<ENOSPC> fehlschlagen.
fr: En cas de dépassement de ces limites, B<clone>(2) et B<unshare>(2) échouent avec l’erreur B<ENOSPC>.

source: For the initial user namespace, the default value in each of these files is half the limit on the number of threads that may be created (I</proc/sys/kernel/threads-max>). In all descendant user namespaces, the default value in each file is B<MAXINT>.
de: Für den anfänglichen Benutzernamensraum ist der Vorgabewert für jede dieser Dateien die Hälfte der Begrenzungen für die Anzahl der Threads, die erstellt werden dürfen (I</proc/sys/kernel/threads-max>). In allen abgeleiteten Benutzernamensräumen ist der Vorgabewert in jeder Datei B<MAXINT>.
fr: Pour l’espace de noms utilisateur de départ, la valeur par défaut dans chacun de ces fichiers est la moitié de la limite du nombre de threads pouvant être créés (I</proc/sys/kernel/threads-max>). Dans tous les espaces de noms de la descendance, la valeur par défaut dans chaque fichier est B<MAXINT>.

source: When a namespace is created, the object is also accounted against ancestor namespaces. More precisely:
de: Wenn ein Namensraum erstellt wird, wird das Objekt auch gegen die Vorgängernamensräume verrechnet. Genauer:
fr: Quand un espace de noms est créé, l’objet est aussi comptabilisé dans les espaces de noms ancêtre. Plus précisément :

source: Each user namespace has a creator UID.
de: Jeder Benutzernamensraum hat eine Ersteller-UID.
fr: Chaque espace de noms utilisateur à un UID créateur.

source: When a namespace is created, it is accounted against the creator UIDs in each of the ancestor user namespaces, and the kernel ensures that the corresponding namespace limit for the creator UID in the ancestor namespace is not exceeded.
de: Wenn ein Namensraum erstellt wird, wird er gegen die Ersteller-UIDs in jedem der Vorgängernamensräume verrechnet und der Kernel stellt sicher, dass die entsprechende Namensraumbegrenzung für die Ersteller-UID in den Vorgängernamensräumen nicht überschritten wird.
fr: Quand un espace de noms est créé, il est comptabilisé dans les UID créateurs dans chacun des espaces de noms ancêtre et le noyau assure que la limite de l’espace de noms correspondant pour l’UID créateur dans l’espace de noms ancêtre ne soit pas dépassée.

source: The aforementioned point ensures that creating a new user namespace cannot be used as a means to escape the limits in force in the current user namespace.
de: Der vorgehend erwähnte Punkt stellt sicher, dass das Erzeugen eines neuen Benutzernamensraums nicht als Mittel verwandt werden kann, um den im aktuellen Benutzernamensraum in Kraft gesetzten Beschränkungen zu entfliehen.
fr: Le point ci-dessus assure que la création d’un nouvel espace de noms utilisateur ne peut pas être utilisée pour se soustraire aux limites en vigueur dans l’espace de noms utilisateur actuel.

source: Namespace lifetime
de: Namensraum-Lebensdauer
fr: Durée de vie des espaces de noms

source: Absent any other factors, a namespace is automatically torn down when the last process in the namespace terminates or leaves the namespace. However, there are a number of other factors that may pin a namespace into existence even though it has no member processes. These factors include the following:
de: Falls keine weiteren Faktoren vorliegen, wird ein Namensraum automatisch entsorgt, wenn der letzte Prozess in dem Namensraum beendet wird oder den Namensraum verlässt. Allerdings gibt es eine Reihe von weiteren Faktoren, die einen Namensraum in der Existenz halten können, obwohl er keine Mitgliedprozesse hat. Zu diesen Faktoren gehören die folgenden:
fr: En l’absence d’autres facteurs, un espace de noms est automatiquement détruit quand le dernier processus de l’espace de noms se termine ou le quitte. Cependant, il existe un certain nombre d’autres facteurs qui peuvent obliger l’existence de l’espace de noms même s’il n’a plus de processus membre, dont les facteurs suivants :

source: An open file descriptor or a bind mount exists for the corresponding I</proc/[pid]/ns/*> file.
de: Ein offener Dateideskriptor oder eine Bind-Einhängung für die entsprechende Datei I</proc/[PID]/ns/*>.
fr: Un descripteur de fichier ouvert ou un montage bind existe pour le fichier correspondant I</proc/[pid]/ns/*>.

source: The namespace is hierarchical (i.e., a PID or user namespace), and has a child namespace.
de: Der Namensraum ist hierarchisch (d.h. ein PID- oder Benutzernamensraum) und hat einen Kindnamensraum.
fr: L’espace de noms est hiérarchique (c’est-à-dire un espace de noms PID ou utilisateur) et possède un espace de noms enfant.

source: It is a user namespace that owns one or more nonuser namespaces.
de: Es ist ein Benutzernamensraum, der einen oder mehrere nicht-Benutzer-Namensräume besitzt.
fr: C’est un espace de noms utilisateur qui possède un ou plusieurs espaces de noms non utilisateur.

source: It is a PID namespace, and there is a process that refers to the namespace via a I</proc/[pid]/ns/pid_for_children> symbolic link.
de: Es ist ein PID-Namensraum und es gibt einen Prozess, der sich mittels eines symbolischen Links I</proc/[PID]/ns/pid_for_children> auf einen Namensraum bezieht.
fr: C’est un espace de noms PID et il existe un processus qui se réfère à lui à l’aide d’un lien symbolique I</proc/[pid]/ns/pid_for_children>.

source: It is a time namespace, and there is a process that refers to the namespace via a I</proc/[pid]/ns/time_for_children> symbolic link.
de: Es ist ein Zeitnamensraum und es gibt einen Prozess, der sich mittels eines symbolischen Links I</proc/[PID]/ns/time_for_children> auf einen Namensraum bezieht.
fr: C’est un espace de noms temps et il existe un processus qui se réfère à lui à l’aide d’un lien symbolique I</proc/[pid]/ns/temps_for_children>.

source: It is an IPC namespace, and a corresponding mount of an I<mqueue> filesystem (see B<mq_overview>(7)) refers to this namespace.
de: Es ist ein IPC-Namensraum und eine entsprechende Einhängung eines I<mqueue>-Dateisystems (siehe B<mq_overview>(7)) bezieht sich auf diesen Namensraum.
fr: C’est un espace de noms IPC et un montage correspondant d’un système de fichiers I<mqueue> (file d'attente de message — consultez B<mq_overview>(7)) se réfère à cet espace de noms.

source: It is a PID namespace, and a corresponding mount of a B<proc>(5) filesystem refers to this namespace.
de: Es ist ein PID-Namensraum und eine entsprechende Einhängung eines I<proc>(5)-Dateisystems bezieht sich auf diesen Namensraum.
fr: C’est un espace de noms PID et un montage correspondant d’un système de fichiers B<proc>(5) se réfère à cet espace de noms.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: See B<clone>(2) and B<user_namespaces>(7).
de: Siehe B<clone>(2) und B<user_namespaces>(7).
fr: Consultez B<clone>(2) et B<user_namespaces>(7).

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: POSIX message queues
de: POSIX-Nachrichtenwarteschlangen
fr: files de messages POSIX

source: Network devices,
de: Netzwerkgeräte
fr: Périphériques réseau,

source: stacks, ports, etc.
de: stacks, Ports, usw.
fr: piles, ports, etc.

source: Boot and monotonic
de: Startzeit und monotone
fr: Horloges de

source: clocks
de: Uhren
fr: démarrage et monotones

source: Hostname and NIS
de: Rechnername und NIS-
fr: Nom de domaine

source: The B<clone>(2) system call creates a new process. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed below, then new namespaces are created for each flag, and the child process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
de: Der Systemaufruf B<clone>(2) erstellt einen neuen Prozess. Falls das Argument I<Schalter> des Aufrufs einen oder mehrere der unten aufgeführten Schalter B<CLONE_NEW*> enthält, dann werden für jeden der Schalter neue Namensräume erstellt und der Kindprozess wird zum Mitglied in jedem dieser Namensräume gemacht. (Dieser Systemaufruf implementiert auch eine Reihe von Funktionalitäten ohne Bezug zu Namensräumen.)
fr: L'appel système B<clone>(2) crée un nouveau processus. Si lors de l'appel, l'argument I<flags> précise un ou plusieurs des indicateurs B<CLONE_NEW*> décrits ci-dessous, un nouvel espace de noms sera créé pour chaque indicateur et le processus enfant sera membre de ces espaces de noms. Cet appel système implémente également plusieurs fonctionnalités sans lien avec les espaces de noms.

source: The B<unshare>(2) system call moves the calling process to a new namespace. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed below, then new namespaces are created for each flag, and the calling process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
de: Der Systemaufruf B<unshare>(2) verschiebt den aufrufenden Prozess in einen neuen Namensraum. Falls das Argument I<Schalter> des Aufrufs einen oder mehrere der unten aufgeführten Schalter B<CLONE_NEW*> enthält, dann werden für jeden der Schalter neue Namensräume erstellt und der Kindprozess wird zum Mitglied in jedem dieser Namensräume gemacht. (Dieser Systemaufruf implementiert auch eine Reihe von Funktionalitäten ohne Bezug zu Namensräumen.)
fr: L'appel système B<unshare>(2) déplace le processus appelant dans un nouvel espace de noms. Si lors de l'appel, son argument I<flags> précise un ou plusieurs des indicateurs B<CLONE_NEW*> décrits ci-dessous, un nouvel espace de noms sera créé pour chaque indicateur et le processus appelant sera membre de ces espaces de noms. Cet appel système implémente également plusieurs fonctionnalités sans lien avec les espaces de noms.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Linux provides the following namespaces:
de: Linux stellt die folgenden Namensräume bereit:
fr: Linux fournit les espaces de noms suivants :

source: Constant
de: Konstante
fr: Constante

source: System V IPC, POSIX message queues
de: System V IPC, POSIX-Nachrichtenwarteschlangen
fr: IPC System V, files de messages POSIX

source: Network devices, stacks, ports, etc.
de: Netzwerkgeräte, Stacks, Ports, usw.
fr: Périphériques réseau, piles, ports, etc.

source: Hostname and NIS domain name
de: Rechnername und NIS-Domain-Name
fr: Noms d'hôte et noms de domaine NIS

source: This page describes the various namespaces and the associated I</proc> files, and summarizes the APIs for working with namespaces.
de: Diese Seite beschreibt die verschiedenen Namensräume und die zugehörigen Dateien in I</proc> und fasst die APIs für die Arbeit mit Namensräumen zusammen.
fr: Cette page présente les différents espaces de noms et leurs fichiers I</proc> respectifs et récapitule les API qui permettent de travailler avec ces espaces de noms.

source: Creation of new namespaces using B<clone>(2) and B<unshare>(2) in most cases requires the B<CAP_SYS_ADMIN> capability. User namespaces are the exception: since Linux 3.8, no privilege is required to create a user namespace.
de: Die Erstellug von neuen Namensräumen mittels B<clone>(2) und B<unshare>(2) verlangt in den meisten Fällen die Capability B<CAP_SYS_ADMIN>. Benutzernamensräume sind die Ausnahme: seit Linux 3.8 werden keine Privilegien zur Erzeugung von Benutzernamensräumen benötigt.
fr: Dans la plupart des cas, la création de nouveaux espaces de noms en utilisant B<clone>(2) ou B<unshare>(2) nécessite de disposer de la capacité B<CAP_SYS_ADMIN>. Les espaces de noms utilisateur forment une exception : à partir de Linux 3.8, la création d'un espace de noms utilisateur ne nécessite pas de privilège particulier.

source: The value in this file defines a per-user limit on the number of pid namespaces that may be created in the user namespace.
de: Der Wert in diesem Namensraum definiert die benutzerbezogene Begrenzung der Anzahl der PID-Namensräume, die in dem Benutzernamensraum erstellt werden darf.
fr: La valeur dans ce fichier définit une limite pour chaque utilisateur du nombre d’espaces de noms PID pouvant être créés dans l’espace de noms utilisateur.

source: Cgroup namespaces (CLONE_NEWCGROUP)
de: Cgroup-Namensraum (CLONE_NEWCGROUP)
fr: Espaces de noms Cgroup (CLONE_NEWCGROUP)

source: See B<cgroup_namespaces>(7).
de: Siehe B<cgroup_namespaces>(7).
fr: Consultez B<cgroup_namespaces>(7).

source: IPC namespaces (CLONE_NEWIPC)
de: IPC-Namensraum (CLONE_NEWIPC)
fr: Espaces de noms IPC (CLONE_NEWIPC)

source: IPC namespaces isolate certain IPC resources, namely, System V IPC objects (see B<svipc>(7)) and (since Linux 2.6.30) POSIX message queues (see B<mq_overview>(7)). The common characteristic of these IPC mechanisms is that IPC objects are identified by mechanisms other than filesystem pathnames.
de: IPC-Namensräume isolieren bestimmte IPC-Ressouren, konkret System V IPC-Objekte (siehe B<svipc>(7)) und (seit Linux 2.6.30) POSIX-Nachrichtenwarteschlangen (siehe B<mq_overview>(7)). Die gemeinsame Charakteristik dieser IPC-Mechanismen besteht darin, dass IPC-Objekte durch andere Mechanismen als Dateisystem-Pfadnamen identifiziert werden.
fr: Les espaces de noms IPC isolent certaines ressources IPC, à savoir, les objets IPC System V (consultez B<svipc>(7)) et (depuis Linux 2.6.30) les files de messages POSIX (consultez B<mq_overview>(7)). La caractéristique commune de ces mécanismes IPC est que les objets IPC sont identifiés par des mécanismes autres que des noms de chemins de système de fichiers.

source: Each IPC namespace has its own set of System V IPC identifiers and its own POSIX message queue filesystem. Objects created in an IPC namespace are visible to all other processes that are members of that namespace, but are not visible to processes in other IPC namespaces.
de: Jeder IPC-Namensraum hat seine eigene Gruppe an System-V-IPC-Kennzeichnern und sein eigenes POSIX-Nachrichtenwarteschlangen-Dateisystem. In einem IPC-Namensraum erstellte Objekte sind für alle anderen Prozesse sichtbar, die Mitglied dieses Namensraums sind, aber nicht für Prozesse sichtbar, die in anderen IPC-Namensräumen sind.
fr: Chaque espace de noms IPC possède son propre ensemble d’identifiants IPC System V et son propre système de fichiers de file de messages POSIX. Les objets créés dans un espace de noms IPC sont visibles par tous les autres processus membres de cet espace de noms, mais ne sont pas visibles par d’autres processus dans d’autres espaces de noms IPC.

source: The following I</proc> interfaces are distinct in each IPC namespace:
de: Die folgenden I</proc>-Schnittstellen sind in jedem IPC-Namensraum eindeutig:
fr: Les interfaces I</proc> suivantes sont distinctes dans chaque espace de noms IPC :

source: The POSIX message queue interfaces in I</proc/sys/fs/mqueue>.
de: Die POSIX-Nachrichtenwarteschlangenschnittstelle in I</proc/sys/fs/mqueue>.
fr: Les interfaces de file de messages POSIX dans I</proc/sys/fs/mqueue>.

source: The System V IPC interfaces in I</proc/sys/kernel>, namely: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni>, and I<shm_rmid_forced>.
de: Die System-V-IPC-Schnittstellen in I</proc/sys/kernel>, konkret: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni> und I<shm_rmid_forced>.
fr: Les interfaces IPC System V dans I</proc/sys/kernel>, à savoir : I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni> et I<shm_rmid_forced>.

source: The System V IPC interfaces in I</proc/sysvipc>.
de: Die System-V-IPC-Schnittstellen in I</proc/sysvipc>.
fr: Les interfaces IPC System V dans I</proc/sysvipc>.

source: When an IPC namespace is destroyed (i.e., when the last process that is a member of the namespace terminates), all IPC objects in the namespace are automatically destroyed.
de: Wenn ein IPC-Namensraum zerstört wird (d.h. wenn der letzte Prozess, der Mitglied in einem Namensraum ist, sich beendet), dann werden alle IPC-Objekte in diesem Namensraum automatisch zerstört.
fr: Lors de la destruction d’un espace de noms IPC (c’est-à-dire quand le dernier processus membre de cet espace de noms se termine), tous les objets IPC de cet espace de noms sont détruits automatiquement.

source: Use of IPC namespaces requires a kernel that is configured with the B<CONFIG_IPC_NS> option.
de: Die Verwendung von IPC-Namensräumen benötigt einen Kernel, der mit der Option B<CONFIG_IPC_NS> konfiguriert wurde.
fr: L’utilisation des espaces de noms IPC requiert un noyau configuré avec l’option B<CONFIG_IPC_NS>.

source: Network namespaces (CLONE_NEWNET)
de: Netzwerk-Namensräume (CLONE_NEWNET)
fr: Espaces de noms réseau (CLONE_NEWNET)

source: See B<network_namespaces>(7).
de: Siehe B<network_namespaces>(7).
fr: Consultez B<network_namespaces>(7).

source: Mount namespaces (CLONE_NEWNS)
de: Einhänge-Namensräume (CLONE_NEWNS)
fr: Espaces de noms montage (CLONE_NEWNS)

source: See B<mount_namespaces>(7).
de: Siehe B<mount_namespaces>(7).
fr: Consultez B<mount_namespaces>(7).

source: PID namespaces (CLONE_NEWPID)
de: PID-Namensräume (CLONE_NEWPID)
fr: Espaces de noms PID (CLONE_NEWPID)

source: See B<pid_namespaces>(7).
de: Siehe B<pid_namespaces>(7).
fr: Consultez B<pid_namespaces>(7).

source: User namespaces (CLONE_NEWUSER)
de: Benutzernamensräume (CLONE_NEWUSER)
fr: Espaces de noms utilisateur (CLONE_NEWUSER)

source: See B<user_namespaces>(7).
de: Siehe B<user_namespaces>(7).
fr: Consultez B<user_namespaces>(7).

source: UTS namespaces (CLONE_NEWUTS)
de: UTS-Namensräume (CLONE_NEWUTS)
fr: Espaces de noms UTS (CLONE_NEWUTS)

source: UTS namespaces provide isolation of two system identifiers: the hostname and the NIS domain name. These identifiers are set using B<sethostname>(2) and B<setdomainname>(2), and can be retrieved using B<uname>(2), B<gethostname>(2), and B<getdomainname>(2).
de: UTS-Namensräume isolieren zwei Systemkennzeichner: den Rechnernamen und den NIS-Domain-Namen. Diese Kennzeichner werden mittels B<sethostname>(2) und B<setdomainname>(2) gesetzt und können mittels B<uname>(2), B<gethostname>(2) und B<getdomainname>(2) abgefragt werden.
fr: Les espaces de noms UTS fournissent une isolation entre les deux identifiants du système : le nom d’hôte et le nom de domaine NIS. Ces identifiants sont réglés en utilisant B<sethostname>(2) et B<setdomainname>(2), et peuvent être retrouvés en utilisant B<uname>(2), B<gethostname>(2) et B<getdomainname>(2).

source: Use of UTS namespaces requires a kernel that is configured with the B<CONFIG_UTS_NS> option.
de: Die Verwendung von UTS-Namensräumen benötigt einen Kernel, der mit der Option B<CONFIG_UTS_NS> konfiguriert wurde.
fr: L’utilisation des espaces de noms IPC requiert un noyau configuré avec l’option B<CONFIG_UTS_NS>.

source: EXAMPLE
de: BEISPIEL
fr: EXEMPLE
