Repository: sebras/manpages-l10n
Catalog: po/*/man7/nptl.7.po
Languages: fr

source: Linux man-pages (unreleased)
fr: Pages du manuel de Linux (inédites)

source: NAME
fr: NOM

source: nptl - Native POSIX Threads Library
fr: nptl — Bibliothèque native des threads POSIX

source: NPTL (Native POSIX Threads Library) is the GNU C library POSIX threads implementation that is used on modern Linux systems.
fr: NPTL (Native POSIX Threads Library — Bibliothèque native des threads POSIX) est l’implémentation de la bibliothèque GNU C de threads POSIX utilisée dans les systèmes Linux modernes.

source: NPTL and signals
fr: NPTL et signaux

source: To prevent accidental use of these signals in applications, which might interfere with the operation of the NPTL implementation, various glibc library functions and system call wrapper functions attempt to hide these signals from applications, as follows:
fr: Pour prévenir d’une utilisation accidentelle de ces signaux dans des applications, pouvant interférer avec le fonctionnement de la mise en œuvre de NPTL, diverses fonctions de la bibliothèque glibc et enveloppes d’appel système essaient de cacher ces signaux aux applications comme suit :

source: B<SIGRTMIN> is defined with the value 34 (rather than 32).
fr: B<SIGRTMIN> est réglé à la valeur 34 (plutôt que 32) ;

source: The B<sigwaitinfo>(2), B<sigtimedwait>(2), and B<sigwait>(3) interfaces silently ignore requests to wait for these two signals if they are specified in the signal set argument of these calls.
fr: les interfaces B<sigwaitinfo>(2), B<sigtimedwait>(2) et B<sigwait>(3) ignorent silencieusement les requêtes d’attente de ces deux signaux s’ils sont spécifiés dans l’argument d’ensemble de signaux de ces appels ;

source: The B<sigprocmask>(2) and B<pthread_sigmask>(3) interfaces silently ignore attempts to block these two signals.
fr: les interfaces B<sigprocmask>(2) et B<pthread_sigmask>(3) ignorent silencieusement les essais de bloquer ces deux signaux ;

source: The B<sigaction>(2), B<pthread_kill>(3), and B<pthread_sigqueue>(3) interfaces fail with the error B<EINVAL> (indicating an invalid signal number) if these signals are specified.
fr: les interfaces B<sigaction>(2), B<pthread_kill>(3) et B<pthread_sigqueue>(3) échouent avec l’erreur B<EINVAL> (indiquant un numéro de signal non autorisé) si ces signaux sont spécifiés ;

source: B<sigfillset>(3) does not include these two signals when it creates a full signal set.
fr: B<sigfillset>(3) n’inclut pas ces deux signaux lorsqu’il crée un ensemble complet de signaux.

source: NPTL and process credential changes
fr: Modifications des identifiants de processus et NPTL

source: At the Linux kernel level, credentials (user and group IDs) are a per-thread attribute. However, POSIX requires that all of the POSIX threads in a process have the same credentials. To accommodate this requirement, the NPTL implementation wraps all of the system calls that change process credentials with functions that, in addition to invoking the underlying system call, arrange for all other threads in the process to also change their credentials.
fr: Au niveau du noyau Linux, les identifiants (ID utilisateur et ID groupe) sont des attributs particuliers à chaque thread. Cependant, POSIX demande que tous les threads POSIX d’un processus aient les même identifiants. Pour satisfaire cette exigence, l’implémentation de NPTL enveloppe tous les appels système qui modifient les identifiants avec des fonctions qui, en plus d’invoquer l’appel système sous-jacent, organisent aussi la modification des identifiants de tous les autres threads du processus.

source: The implementation of each of these system calls involves the use of a real-time signal that is sent (using B<tgkill>(2)) to each of the other threads that must change its credentials. Before sending these signals, the thread that is changing credentials saves the new credential(s) and records the system call being employed in a global buffer. A signal handler in the receiving thread(s) fetches this information and then uses the same system call to change its credentials.
fr: La mise en œuvre de chacun de ces appels système implique l’utilisation d’un signal temps réel qui est envoyé (en utilisant B<tgkill>(2)) à chaque autre thread qui doit modifier ses identifiants. Avant l’envoi de ces signaux, le thread qui modifie ses identifiants stocke le ou les nouveaux identifiants et enregistre l’appel système à utiliser dans un tampon global. Un gestionnaire de signal dans le ou les threads récepteurs recherche cette information, puis utilise le même appel système pour modifier ses identifiants.

source: Wrapper functions employing this technique are provided for B<setgid>(2), B<setuid>(2), B<setegid>(2), B<seteuid>(2), B<setregid>(2), B<setreuid>(2), B<setresgid>(2), B<setresuid>(2), and B<setgroups>(2).
fr: Des fonctions enveloppe utilisant cette technique sont fournies pour B<setgid>(2), B<setuid>(2), B<setegid>(2), B<seteuid>(2), B<setregid>(2), B<setreuid>(2), B<setresgid>(2), B<setresuid>(2) et B<setgroups>(2).

source: For details of the conformance of NPTL to the POSIX standard, see B<pthreads>(7).
fr: Pour des précisions sur la conformité de NPTL avec la norme POSIX, consultez B<pthreads>(7).

source: POSIX says that any thread in any process with access to the memory containing a process-shared (B<PTHREAD_PROCESS_SHARED>) mutex can operate on that mutex. However, on 64-bit x86 systems, the mutex definition for x86-64 is incompatible with the mutex definition for i386, meaning that 32-bit and 64-bit binaries can't share mutexes on x86-64 systems.
fr: POSIX indique que tout thread dans chaque processus ayant accès à la mémoire contenant un mutex de processus partagé (B<PTHREAD_PROCESS_SHARED>) peut agir sur ce mutex. Cependant, sur les systèmes x86 64 bits, la définition du mutex pour x86-64 est incompatible avec celle pour i386, signifiant que les binaires 32 et 64 bits ne peuvent pas partager les mutex sur les systèmes x86-64.

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NPTL makes internal use of the first two real-time signals (signal numbers 32 and 33). One of these signals is used to support thread cancellation and POSIX timers (see B<timer_create>(2)); the other is used as part of a mechanism that ensures all threads in a process always have the same UIDs and GIDs, as required by POSIX. These signals cannot be used in applications.
fr: NPTL représente l’utilisation interne des deux premiers signaux temps réel (numéros de signal 32 et 33). Un de ces signaux est utilisé pour gérer l’annulation de threads et d’horloges POSIX (consultez B<timer_create>(2)), l’autre est utilisé comme partie d’un mécanisme qui garantit que tous les threads d’un processus aient toujours les mêmes UID et GID comme demandé par POSIX. Ces signaux ne peuvent pas être utilisés dans les applications.

source: CONFORMING TO
fr: CONFORMITÉ

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
