Repository: sebras/manpages-l10n
Catalog: po/*/man7/path_resolution.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: path_resolution - how a pathname is resolved to a file
de: path_resolution - Wie ein Pfadname zu einer Datei aufgelöst wird

source: DESCRIPTION
de: BESCHREIBUNG

source: Some UNIX/Linux system calls have as parameter one or more filenames. A filename (or pathname) is resolved as follows.
de: Einige UNIX/Linux-Systemaufrufe haben als Parameter einen oder mehrere Dateinamen. Ein Dateiname (oder Pfadname) wird wie folgt aufgelöst:

source: Step 1: start of the resolution process
de: Schritt 1: Start des Auflösungsprozesses

source: If the pathname starts with the \(aq/\(aq character, the starting lookup directory is the root directory of the calling process. A process inherits its root directory from its parent. Usually this will be the root directory of the file hierarchy. A process may get a different root directory by use of the B<chroot>(2) system call, or may temporarily use a different root directory by using B<openat2>(2) with the B<RESOLVE_IN_ROOT> flag set.
de: Falls der Pfadname mit dem Zeichen »/« beginnt, wird das Wurzelverzeichnis des aufrufenden Prozesses als Startverzeichnis beim Nachschlagen verwandt. Ein Prozess erbt sein Wurzelverzeichnis von seinem Elternprozess. Normalerweise wird dies das Wurzelverzeichnis der Dateihierarchie sein. Durch die Verwendung des Systemaufrufs B<chroot>(2) kann ein Prozess ein anderes Wurzelverzeichnis erhalten oder er kann mittels B<openat2>(2) mit dem gesetzten Schalter B<RESOLVE_IN_ROOT> temporär ein anderes Wurzelverzeichnis erhalten.

source: A process may get an entirely private mount namespace in case it\(emor one of its ancestors\(emwas started by an invocation of the B<clone>(2) system call that had the B<CLONE_NEWNS> flag set. This handles the \(aq/\(aq part of the pathname.
de: Ein Prozess kann einen komplett privaten Einhängenamensraum erhalten, falls er\(emoder einer seiner Vorgänger\(emdurch einen Systemaufruf von B<clone>(2) mit gesetztem Schalter B<CLONE_NEWNS> gestartet wurde. Dieser handhabt den »/«-Anteil des Pfadnamens.

source: If the pathname does not start with the \(aq/\(aq character, the starting lookup directory of the resolution process is the current working directory of the process \(em or in the case of B<openat>(2)-style system calls, the I<dfd> argument (or the current working directory if B<AT_FDCWD> is passed as the I<dfd> argument). The current working directory is inherited from the parent, and can be changed by use of the B<chdir>(2) system call.
de: Falls der Pfadname nicht mit dem Zeichen »/« beginnt, ist das Nachschlage-Startverzeichnis für den Pfadauflösungsprozess das aktuelle Arbeitsverzeichnis des Prozesses \(em oder im Falle von Systemaufrufen im Stil von B<openat>(2), das Argument I<dfd> (oder das aktuelle Arbeitsverzeichnis, falls B<AT_FDCWD> als Argument I<dfd> übergeben wurde). Das aktuelle Arbeitsverzeicnis wird vom Elternprozess geerbt und kann mittels des Systemaufrufs B<chdir>(2) geändert werden.

source: Pathnames starting with a \(aq/\(aq character are called absolute pathnames. Pathnames not starting with a \(aq/\(aq are called relative pathnames.
de: Pfadnamen, die mit dem Zeichen »/« beginnen, werden absolute Pfadnamen genannt. Alle anderen Pfadnamen heißen relative Pfadnamen.

source: Step 2: walk along the path
de: Schritt 2: Ablaufen entlang des Pfades

source: Set the current lookup directory to the starting lookup directory. Now, for each nonfinal component of the pathname, where a component is a substring delimited by \(aq/\(aq characters, this component is looked up in the current lookup directory.
de: Das aktuelle Nachschlageverzeichnis wird auf das Nachschlage-Startverzeichnis gesetzt. Jetzt wird für jede nicht abschließende Komponente des Pfadnamens diese im aktuellen Nachschlageverzeichnis nachgeschlagen. Hierbei ist eine Komponente eine Teilzeichenkette, die durch das Zeichen »/« abgetrennt wird.

source: If the process does not have search permission on the current lookup directory, an B<EACCES> error is returned ("Permission denied").
de: Falls der Prozess über keine Suchberechtigungen im aktuellen Nachschlage-Verzeichnis verfügt, wird der Fehler B<EACCES> (»Keine Berechtigung«) zurückgeliefert.

source: If the component is not found, an B<ENOENT> error is returned ("No such file or directory").
de: Falls die Komponente nicht gefunden wird, wird der Fehler B<ENOENT> (»Datei oder Verzeichnis nicht gefunden«) zurückgeliefert.

source: If the component is found, but is neither a directory nor a symbolic link, an B<ENOTDIR> error is returned ("Not a directory").
de: Falls eine Komponente gefunden wird, aber weder ein Verzeichnis noch ein symbolischer Link ist, wird der Fehler B<ENOTDIR> (»Ist kein Verzeichnis«) zurückgeliefert.

source: If the component is found and is a directory, we set the current lookup directory to that directory, and go to the next component.
de: Falls die Komponente gefunden wird und ein Verzeichnis ist, wird das aktuelle Nachschlage-Verzeichnis auf dieses Verzeichnis gesetzt und zur nächsten Komponenten gewechselt.

source: If the component is found and is a symbolic link (symlink), we first resolve this symbolic link (with the current lookup directory as starting lookup directory). Upon error, that error is returned. If the result is not a directory, an B<ENOTDIR> error is returned. If the resolution of the symbolic link is successful and returns a directory, we set the current lookup directory to that directory, and go to the next component. Note that the resolution process here can involve recursion if the prefix ('dirname') component of a pathname contains a filename that is a symbolic link that resolves to a directory (where the prefix component of that directory may contain a symbolic link, and so on). In order to protect the kernel against stack overflow, and also to protect against denial of service, there are limits on the maximum recursion depth, and on the maximum number of symbolic links followed. An B<ELOOP> error is returned when the maximum is exceeded ("Too many levels of symbolic links").
de: Falls die Komponente gefunden wird und ein symbolischer Link (Symlink) ist, wird zuerst dieser symbolische Link aufgelöst (mit dem anfänglichen Nachschlage-Verzeichnis). Im Fehlerfall wird dieser Fehler zurückgeliefert. Falls das Ergebnis kein Verzeichnis ist, wird der Fehler B<ENOTDIR> zurückgeliefert. Falls die Auflösung des symbolischen Links erfolgreich ist und ein Verzeichnis zurückliefert, wird das aktuelle Nachschlage-Verzeichnis auf dieses Verzeichnis gesetzt und zur nächsten Komponente gewechselt. Bachten Sie, dass dieser Auflösungsprozess Rekursionen enthalten kann, falls die Präfixkomponente (»dirname«) eines Pfadnamens einen Dateinamen enthält, der ein symbolischer Link ist, der sich auf ein Verzeichnis auflöst (wobei die Präfixkomponente dieses Verzeichnisses einen symbolischen Link enthalten könnte und so weiter). Um den Kernel gegen eine Stapelüberlauf und auch eine Diensteverweigerung zu schützen, gibt es Begrenzungen zur Rekursionstiefe und der maximalen Anzahl an gefolgten symbolischen Links. Ein Fehler B<ELOOP> wird zurückgeliefert, wenn das Maximum überschritten wurde (»Zu viele Ebenen aus symbolischen Links«).

source: As currently implemented on Linux, the maximum number of symbolic links that will be followed while resolving a pathname is 40. In kernels before 2.6.18, the limit on the recursion depth was 5. Starting with Linux 2.6.18, this limit was raised to 8. In Linux 4.2, the kernel's pathname-resolution code was reworked to eliminate the use of recursion, so that the only limit that remains is the maximum of 40 resolutions for the entire pathname.
de: Derzeit ist in Linux die maximale Anzahl von beim Auflösen von Pfadnamen gefolgten symbolischen Links auf 40 begrenzt. In Kerneln vor 2.6.18 war die Begrenzung der Rekursionstiefe 5. Seit Linux 2.6.18 wurde diese Begrenzung auf 8 erhöht. In Linux 4.2 wurde der Code für die Pfadnamenauflösung überarbeitet, um die Verwendung von Rekursion zu beseitigen, so dass die einzige verbliebene Begrenzung die maximalen 40 Auflösungen für den gesamten Pfadnamen ist.

source: The resolution of symbolic links during this stage can be blocked by using B<openat2>(2), with the B<RESOLVE_NO_SYMLINKS> flag set.
de: Die Auflösung symbolischer Links während dieser Stufe kann mittels B<openat2>(2) durch den gesetzten Schalter B<RESOLVE_NO_SYMLINKS> verhindert werden.

source: Step 3: find the final entry
de: Schritt 3: Finden des finalen Eintrags

source: The lookup of the final component of the pathname goes just like that of all other components, as described in the previous step, with two differences: (i) the final component need not be a directory (at least as far as the path resolution process is concerned\(emit may have to be a directory, or a nondirectory, because of the requirements of the specific system call), and (ii) it is not necessarily an error if the component is not found\(emmaybe we are just creating it. The details on the treatment of the final entry are described in the manual pages of the specific system calls.
de: Das Nachschlagen der finalen Komponente des Pfadnamens erfolgt genau wie der von allen anderen Komponenten, wie im vorherigen Schritt beschrieben, mit zwei Unterschieden: (i) die finale Komponente muss kein Verzeichnis sein (zumindest soweit, wie der Pfadauflösungsprozess betroffen ist \(en es mag ein Verzeichnis oder keines sein müssen, abhängig von den Anforderungen des spezifischen Systemaufrufs) und (ii) es ist nicht unbedingt ein Fehler, falls die Komponente nicht gefunden wird \(en vielleicht wird sie gerade erstellt. Die Details der Behandlung des abschließenden Eintrags werden in den Handbuchseiten der jeweiligen Systemaufrufe beschrieben.

source: . and ..
de: . und ..

source: By convention, every directory has the entries "." and "..", which refer to the directory itself and to its parent directory, respectively.
de: Herkömmlicherweise hat jedes Verzeichnis zwei Einträge (».« und »..«), die sich auf das Verzeichnis selbst bzw. sein übergeordnetes Verzeichnis beziehen.

source: The path resolution process will assume that these entries have their conventional meanings, regardless of whether they are actually present in the physical filesystem.
de: Der Pfadauflösungsprozess wird annehmen, dass diese zwei Einträge ihre konventionelle Bedeutung haben, unabhängig davon, ob sie im physischen Dateisystem tatsächlich vorhanden sind.

source: One cannot walk up past the root: "/.." is the same as "/".
de: Sie können nicht höher als die Wurzel aufsteigen: »/..« ist zu »/« identisch.

source: Mount points
de: Einhängepunkte

source: After a "mount dev path" command, the pathname "path" refers to the root of the filesystem hierarchy on the device "dev", and no longer to whatever it referred to earlier.
de: Nach einem Befehl »mount Gerät Pfad« bezieht sich der Pfadname »Pfad« auf die Wurzel der Dateisystemhierarchie auf dem Gerät »Gerät« und nicht auf etwas, worauf es sich vorher bezog.

source: One can walk out of a mounted filesystem: "path/.." refers to the parent directory of "path", outside of the filesystem hierarchy on "dev".
de: Sie können sich außerhalb des eingehängten Dateisystems bewegen: »Pfad/..« bezieht sich auf das übergeordnete Verzeichnis von »Pfad« außerhalb der Dateisystemhierarchie von »Gerät«.

source: Traversal of mount points can be blocked by using B<openat2>(2), with the B<RESOLVE_NO_XDEV> flag set (though note that this also restricts bind mount traversal).
de: Durchlauf von Einhängepunkten kann mittels B<openat2>(2) mit dem gesetzten Schalter B<RESOLVE_NO_XDEV> verhindert werden (beachten Sie allerdings, dass dies auch den Durchlauf von Bind-Einhängungen beschränkt).

source: Trailing slashes
de: Abschließende Schrägstriche

source: If a pathname ends in a \(aq/\(aq, that forces resolution of the preceding component as in Step 2: the component preceding the slash either exists and resolves to a directory or it names a directory that is to be created immediately after the pathname is resolved. Otherwise, a trailing \(aq/\(aq is ignored.
de: Falls ein Pfadname mit einem »/« endet, der die Auflösung der vorherigen Komponente gemäß Schritt 2 erzwingt: die Komponente vor dem Schrägstrich existiert entweder und wird zu einem Verzeichnis aufgelöst oder sie benennt ein Verzeichnis, das sofort nach der Auflösung des Pfadnamens erstellt werden soll. Andernfalls wird ein abschließender »/« ignoriert.

source: Final symlink
de: Finaler Symlink

source: If the last component of a pathname is a symbolic link, then it depends on the system call whether the file referred to will be the symbolic link or the result of path resolution on its contents. For example, the system call B<lstat>(2) will operate on the symlink, while B<stat>(2) operates on the file pointed to by the symlink.
de: Falls die letzte Komponente des Pfadnamens ein symbolischer Link ist, hängt es vom Systemaufruf ab, ob die Datei, auf die referenziert wird, ein symbolischer Link ist oder das Ergebnis der Pfadauflösung seiner Inhalte. Beispielsweise wird der Systemaufruf B<lstat>(2) auf einem Symlink agieren, während B<stat>(2) auf der Datei agiert, auf die der Symlink zeigt.

source: Length limit
de: Längenbeschränkung

source: There is a maximum length for pathnames. If the pathname (or some intermediate pathname obtained while resolving symbolic links) is too long, an B<ENAMETOOLONG> error is returned ("Filename too long").
de: Es gibt eine maximale Länge für Pfadnamen. Falls der Pfadname (oder ein Zwischenpfadname, der beim Auflösen von symbolischen Links erhalten wurde) zu lang ist, wird ein Fehler B<ENAMETOOLONG> zurückgeliefert (»Der Dateiname ist zu lang«).

source: Empty pathname
de: Leere Pfadnamen

source: In the original UNIX, the empty pathname referred to the current directory. Nowadays POSIX decrees that an empty pathname must not be resolved successfully. Linux returns B<ENOENT> in this case.
de: Im ursprünglichen UNIX bezogen sich leere Pfadnamen auf das aktuelle Verzeichnis. Heutzutage beschließt POSIX, dass ein leerer Pfadname nicht erfolgreich aufgelöst werden darf. Linux liefert in diesem Fall B<ENOENT> zurück.

source: Permissions
de: Berechtigungen

source: The permission bits of a file consist of three groups of three bits; see B<chmod>(1) and B<stat>(2). The first group of three is used when the effective user ID of the calling process equals the owner ID of the file. The second group of three is used when the group ID of the file either equals the effective group ID of the calling process, or is one of the supplementary group IDs of the calling process (as set by B<setgroups>(2)). When neither holds, the third group is used.
de: Die Berechtigungsbits einer Datei bestehen aus drei Gruppen von drei Bits: siehe B<chmod>(1) und B<stat>(2). Die erste Gruppe der drei wird verwandt, wenn die effektive Benutzerkennung des aufrufenden Prozesses identisch zu der Eigentümerkennung der Datei ist. Die zweite Gruppe der drei wird verwandt, wenn die Gruppenkennung der Datei entweder mit der effektiven Gruppenkennung des aufrufenden Prozesses übereinstimmt oder eine der ergänzenden Gruppenkennungen des aufrufenden Prozesses ist (wie durch B<setgroups>(2) gesetzt). Falls nichts davon zutrifft, wird die dritte Gruppe verwandt.

source: Of the three bits used, the first bit determines read permission, the second write permission, and the last execute permission in case of ordinary files, or search permission in case of directories.
de: Von den drei verwandten Bits bestimmt das erste Bit die Leseberechtigung, das zweite die Schreibberechtigung und das letzte die Ausführberechtigung im Falle von gewöhnlichen Dateien oder die Suchberechtigung im Falle von Verzeichnissen.

source: Linux uses the fsuid instead of the effective user ID in permission checks. Ordinarily the fsuid will equal the effective user ID, but the fsuid can be changed by the system call B<setfsuid>(2).
de: Linux verwendet fsuid anstelle der effektiven Benutzerkennung bei Berechtigungsprüfungen. Normalerweise ist die fsuid identisch mit der effektiven Benutzerkennung, aber die fsuid kann mit dem Systemaufruf B<setfsuid>(2) geändert werden.

source: (Here "fsuid" stands for something like "filesystem user ID". The concept was required for the implementation of a user space NFS server at a time when processes could send a signal to a process with the same effective user ID. It is obsolete now. Nobody should use B<setfsuid>(2).)
de: (Hier steht »fsuid« für etwas wie »Dateisystembenutzerkennung«. Das Konzept wurde für die Implementierung von NFS-Servern im Benutzerbereich zu einem Zeitpunkt benötigt, zu dem ein Prozess ein Signal zu einem anderen Prozess mit der gleichen effektiven Benutzerkennung senden konnte. Dies ist jetzt veraltet. Niemand sollte B<setfsuid>(2) verwenden.)

source: Similarly, Linux uses the fsgid ("filesystem group ID") instead of the effective group ID. See B<setfsgid>(2).
de: Auf ähnliche Weise verwendet Linux die fsgid (»Dateisystemgruppenkennung«) anstelle der effektiven Gruppenkennung. Siehe B<setfsgid>(2).

source: Bypassing permission checks: superuser and capabilities
de: Umgehen von Berechtigungsprüfungen: Superuser und Capabilitys

source: On a traditional UNIX system, the superuser (I<root>, user ID 0) is all-powerful, and bypasses all permissions restrictions when accessing files.
de: Auf einem traditionellen UNIX-System ist der Superuser (I<root>, Benutzerkennung 0) allmächtig und umgeht alle Berechtigungseinschränkungen beim Zugriff auf Dateien.

source: On Linux, superuser privileges are divided into capabilities (see B<capabilities>(7)). Two capabilities are relevant for file permissions checks: B<CAP_DAC_OVERRIDE> and B<CAP_DAC_READ_SEARCH>. (A process has these capabilities if its fsuid is 0.)
de: Unter Linux sind die Superuser-Privilegien in Capabilitys aufgeteilt (siehe B<capabilities>(7)). Zwei Capabilitys sind für Dateiberechtigungsüberprüfungen relevant: B<CAP_DAC_OVERRIDE> und B<CAP_DAC_READ_SEARCH>. (Ein Prozess hat diese Capabilitys, falls seine fsuid 0 ist.)

source: The B<CAP_DAC_OVERRIDE> capability overrides all permission checking, but grants execute permission only when at least one of the file's three execute permission bits is set.
de: Die Capability B<CAP_DAC_OVERRIDE> setzt alle Berechtigungsprüfungen außer Kraft, aber gewährt die Ausführberechtigung nur, falls mindestens eines der drei Ausführ-Berechtigungs-Bits der Datei gesetzt ist.

source: The B<CAP_DAC_READ_SEARCH> capability grants read and search permission on directories, and read permission on ordinary files.
de: Die Capability B<CAP_DAC_READ_SEARCH> gewährt Lese- und Suchberechtigungen für Verzeichnisse und Leseberechtigungen für gewöhnliche Dateien.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: If the pathname does not start with the \(aq/\(aq character, the starting lookup directory of the resolution process is the current working directory of the process \(em or in the case of B<openat>(2)-style system calls, the I<dfd> argument (or the current working directory if B<AT_FDCWD> is passed as the I<dfd> argument). The current working directory is inherited from the parent, and can be changed by use of the B<chdir>(2) system call.)
de: Falls der Pfadname nicht mit dem Zeichen »/« beginnt, ist das Nachschlage-Startverzeichnis für den Pfadauflösungsprozess das aktuelle Arbeitsverzeichnis des Prozesses \(em oder im Falle von Systemaufrufen im Stil von B<openat>(2), das Argument I<dfd> (oder das aktuelle Arbeitsverzeichnis, falls B<AT_FDCWD> als Argument I<dfd> übergeben wurde). Das aktuelle Arbeitsverzeicnis wird vom Elternprozess geerbt und kann mittels des Systemaufrufs B<chdir>(2) geändert werden.

source: If a pathname ends in a \(aq/\(aq, that forces resolution of the preceding component as in Step 2: it has to exist and resolve to a directory. Otherwise, a trailing \(aq/\(aq is ignored. (Or, equivalently, a pathname with a trailing \(aq/\(aq is equivalent to the pathname obtained by appending \(aq.\(aq to it.)
de: Falls ein Pfadname mit einem »/« endet, der die Auflösung der vorherigen Komponente gemäß Schritt 2 erzwingt: Sie muss existieren und sich auf ein Verzeichnis auflösen. Andernfalls wird ein abschließender »/« ignoriert. (Oder ein Pfadname mit einem abschließenden »/« ist äquivalent zu einem Pfadnamen, der durch Anhängen von ».« an ihn erhalten wird.)

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: If the pathname starts with the \(aq/\(aq character, the starting lookup directory is the root directory of the calling process. (A process inherits its root directory from its parent. Usually this will be the root directory of the file hierarchy. A process may get a different root directory by use of the B<chroot>(2) system call. A process may get an entirely private mount namespace in case it\(emor one of its ancestors\(emwas started by an invocation of the B<clone>(2) system call that had the B<CLONE_NEWNS> flag set.) This handles the \(aq/\(aq part of the pathname.
de: Falls der Pfadname mit dem Zeichen »/« beginnt, wird das Wurzelverzeichnis des aufrufenden Prozesses als Startverzeichnis beim Nachschlagen verwandt. (Ein Prozess erbt sein Wurzelverzeichnis von seinem Elternprozess. Normalerweise wird dies das Wurzelverzeichnis der Dateihierarchie sein. Durch die Verwendung des Systemaufrufs B<chroot>(2) kann ein Prozess ein anderes Wurzelverzeichnis erhalten. Ein Prozess kann einen komplett privaten Namensraum erhalten, falls er \(en oder einer seiner Vorgänger \(en mittels des Systemaufrufs B<clone>(2) gestartet wurde, bei dem der Schalter B<CLONE_NEWNS> gesetzt war.) Dies handhabt den »/«-Anteil des Pfadnamens.

source: If the pathname does not start with the \(aq/\(aq character, the starting lookup directory of the resolution process is the current working directory of the process. (This is also inherited from the parent. It can be changed by use of the B<chdir>(2) system call.)
de: Falls der Pfadname nicht mit dem Zeichen »/« beginnt, ist das Nachschlage-Startverzeichnis für den Pfadauflösungsprozess das aktuelle Arbeitsverzeichnis des Prozesses. (Dies wird auch vom Elternprozess geerbt. Es kann mittels des Systemaufrufs B<chdir>(2) geändert werden.)
