Repository: sebras/manpages-l10n
Catalog: po/*/man7/pid_namespaces.7.po
Languages: de, fr

source: After creating a new PID namespace, it is useful for the child to change its root directory and mount a new procfs instance at I</proc> so that tools such as B<ps>(1) work correctly. If a new mount namespace is simultaneously created by including B<CLONE_NEWNS> in the I<flags> argument of B<clone>(2) or B<unshare>(2), then it isn't necessary to change the root directory: a new procfs instance can be mounted directly over I</proc>.
de: Nach dem Erstellen eines neuen PID-Namensraumes ist es für den Kindprozess nützlich, sein Wurzelverzeichnis zu ändern und eine neue Procfs-Instanz unter I</proc> einzuhängen, so dass Werkzeuge wie B<ps>(1) korrekt funktionieren. Falls ein neuer Einhängenamensraum gleichzeitig durch Aufnahme von B<CLONE_NEWNS> in dem Argument I<flags> von B<clone>(2) oder B<unshare>(2) erstellt wird, dann ist es nicht notwendig, das Wurzelverzeichnis zu ändern: eine neue Procfs-Instanz kann direkt über I</proc> eingehängt werden.
fr: Après la création d'un nouvel espace de noms PID, un enfant peut avoir intérêt à changer son répertoire racine et à monter une nouvelle instance procfs sur I</proc> afin d'assurer que des commandes comme B<ps>(1) fonctionneront correctement. Si un nouvel espace de noms montage est créé simultanément en invoquant B<clone>(2) ou B<unshare>(2) avec l'argument B<CLONE_NEWNS>, il n'est alors pas nécessaire de changer le répertoire racine : une nouvelle instance procfs peut être montée directement dans I</proc>.

source: From a shell, the command to mount I</proc> is:
de: In einer Shell lautet der Einhängebefehl für I</proc>:
fr: Depuis un interpréteur de commandes, la commande permettant de monter I</proc> est :

source: Calling B<readlink>(2) on the path I</proc/self> yields the process ID of the caller in the PID namespace of the procfs mount (i.e., the PID namespace of the process that mounted the procfs). This can be useful for introspection purposes, when a process wants to discover its PID in other namespaces.
de: Der Aufruf von B<readlink>(2) auf dem Pfad I</proc/self> liefert die Prozesskennung des Aufrufenden in dem PID-Namensraum der Procfs-Einhängung (d.h. des PID-Namensraums, der Procfs einhängte). Dies kann zu Untersuchungszwecken nützlich sein, wenn ein Prozess seine PID in anderen Namensräumen herausfinden möchte.
fr: L'appel de B<readlink>(2) appliqué au chemin I</proc/self> affiche les identifiants des processus de l'appelant dans l'espace de noms PID du montage procfs (c'est-à-dire l'espace de noms PID du processus qui a monté procfs). Cela peut être utile lorsque qu'un processus a besoin de connaître son PID dans un autre espace de noms.

source: /proc files
de: /proc-Dateien
fr: Fichiers /proc

source: B</proc/sys/kernel/ns_last_pid> (since Linux 3.3)
de: B</proc/sys/kernel/ns_last_pid> (seit Linux 3.3)
fr: I</proc/sys/kernel/ns_last_pid> (depuis Linux 3.3)

source: This file (which is virtualized per PID namespace) displays the last PID that was allocated in this PID namespace. When the next PID is allocated, the kernel will search for the lowest unallocated PID that is greater than this value, and when this file is subsequently read it will show that PID.
de: Diese Datei (die pro PID-Namensraum virtualisiert ist) zeigt die letzte PID, die in diesem PID-Namensraum zugewiesen wurde. Wenn die nächste PID zugewiesen wird, wird der Kernel nach der kleinsten nicht zugewiesenen PID suchen, die größer als dieser Wert ist, und wenn danach diese Datei gelesen wird, wird diese PID dann gezeigt.
fr: Ce fichier (virtualisé par espace de noms PID) affiche le dernier PID qui a été alloué dans cet espace de noms PID. Quand le prochain PID est alloué, le noyau recherchera le plus petit PID non alloué qui est supérieur à cette valeur, et quand ce fichier est lu ultérieurement, il affiche ce PID.

source: This file is writable by a process that has the B<CAP_SYS_ADMIN> or (since Linux 5.9) B<CAP_CHECKPOINT_RESTORE> capability inside the user namespace that owns the PID namespace. This makes it possible to determine the PID that is allocated to the next process that is created inside this PID namespace.
de: Diese Datei ist für einen Prozess, der über die Capability B<CAP_SYS_ADMIN> oder (seit Linux 5.9) B<CAP_CHECKPOINT_RESTORE> innerhalb des Benutzernamensraums, der den PID-Namensraum besitzt, verfügt, schreibbar. Dies ermöglicht es, die PID zu bestimmen, die dem nächsten Prozess, der innerhalb des PID-Namensraums erstellt wird, zugewiesen wird.
fr: Un processus peut écrire sur ce fichier s’il a la capacité B<CAP_SYS_ADMIN> ou (depuis Linux 5.9) B<CAP_CHECKPOINT_RESTORE> à l’intérieur de l’espace de noms utilisateur qui possède l’espace de noms PID. Cela rend possible de déterminer le PID qui est alloué au prochain processus créé dans cet espace de noms PID.

source: Miscellaneous
de: Verschiedenes
fr: Divers

source: When a process ID is passed over a UNIX domain socket to a process in a different PID namespace (see the description of B<SCM_CREDENTIALS> in B<unix>(7)), it is translated into the corresponding PID value in the receiving process's PID namespace.
de: Wenn eine Prozesskennung über einen UNIX-Domain-Socket an einen Prozess in einem anderen PID-Namensraum übergeben wird (siehe die Beschreibung von B<SCM_CREDENTIALS> in B<unix>(7)), dann wird sie in den entsprechenden PID-Wert in dem PID-Namensraum des empfangenen Prozesses übersetzt.
fr: Lorsqu'un identifiant de processus est transmis à l’aide d’un socket de domaine UNIX à un processus d'un autre espace de noms PID (consultez B<SCM_CREDENTIALS> dans B<unix>(7)), il est transformé pour devenir le PID correspondant dans l'espace de noms PID du processus recevant.

source: Namespaces are a Linux-specific feature.
de: Namensräume sind eine Linux-spezifische Funktionalität.
fr: Les espaces de noms sont propres à Linux.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: See B<user_namespaces>(7).
de: Siehe B<user_namespaces>(7).
fr: Consultez B<user_namespaces>(7).

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux

source: If the "init" process of a PID namespace terminates, the kernel terminates all of the processes in the namespace via a B<SIGKILL> signal. This behavior reflects the fact that the "init" process is essential for the correct operation of a PID namespace. In this case, a subsequent B<fork>(2) into this PID namespace fail with the error B<ENOMEM>; it is not possible to create a new process in a PID namespace whose "init" process has terminated. Such scenarios can occur when, for example, a process uses an open file descriptor for a I</proc/[pid]/ns/pid> file corresponding to a process that was in a namespace to B<setns>(2) into that namespace after the "init" process has terminated. Another possible scenario can occur after a call to B<unshare>(2): if the first child subsequently created by a B<fork>(2) terminates, then subsequent calls to B<fork>(2) fail with B<ENOMEM>.
de: Falls sich der »Init«-Prozess eines PID-Namensraums beendet, beendet der Kernel mittels des Signals B<SIGKILL> alle Prozesse in dem Namensraum. Dieses Verhalten spiegelt die Tatsache wieder, dass der »Init«-Prozess für das korrekte Funktionieren eines PID-Namensraums wesentlich ist. In diesem Fall wird ein nachfolgender B<fork>(2) in den Namensraum mit dem Fehler B<ENOMEM> fehlschlagen; es ist nicht möglich, einen neuen Prozess in einem PID-Namensraum zu erstellen, dessen »Init«-Prozess sich beendet hat. Solche Szenarien können auftreten, wenn beispielsweise ein Prozess einen offenen Dateideskriptor für eine Datei I</proc/[PID]/ns/pid> verwendet, der einem Prozess entspricht, der in einem Namensraum war und der mit B<setns>(2) in einen Namensraum soll, nachdem sich der »Init«-Prozess beendet hat. Ein anderes mögliches Szenario kann direkt nach dem Aufruf von B<unshare>(2) auftreten: Falls sich der erste Kindprozess, der nach einem B<fork>(2) nachfolgend erstellt wurde, beendet, dann schlagen nachfolgende Aufrufe von B<fork>(2) mit B<ENOMEM> fehl.
fr: Si le processus « init » d'un espace de noms PID se termine, le noyau tue tous les processus de cet espace de noms au moyen du signal B<SIGKILL>. Ce comportement illustre le fait que le processus « init » est essentiel au bon fonctionnement de l'espace de noms PID. Dans ce cas, une commande B<fork>(2) ultérieure dans cet espace de noms PID échouera en renvoyant l'erreur B<ENOMEM>. Il n'est plus possible de créer des processus dans un espace de noms PID dont le processus « init » est terminé. Cela peut, par exemple, se produire lorsqu'un processus utilise un descripteur de fichier ouvert pour un fichier I</proc/[pid]/ns/pid> correspondant à un processus d'un espace de noms pour une réassociation (B<setns>(2)) dans cet espace de noms après que le processus « init » soit terminé. Un autre scénario est possible après un appel à B<unshare>(2) : si le premier enfant créé par un appel à B<fork>(2) se termine, alors les appels ultérieurs à B<fork>(2) échoueront en renvoyant l'erreur B<ENOMEM>.

source: Calls to B<setns>(2) that specify a PID namespace file descriptor and calls to B<unshare>(2) with the B<CLONE_NEWPID> flag cause children subsequently created by the caller to be placed in a different PID namespace from the caller. (Since Linux 4.12, that PID namespace is shown via the I</proc/[pid]/ns/pid_for_children> file, as described in B<namespaces>(7).) These calls do not, however, change the PID namespace of the calling process, because doing so would change the caller's idea of its own PID (as reported by B<getpid>()), which would break many applications and libraries.
de: Aufrufe von B<setns>(2), die einen PID-Namensraum-Dateideskriptor festlegen und Aufrufe von B<unshare>(2) mit dem Schalter B<CLONE_NEWPID> führen dazu, dass nachfolgend durch den Aufrufenden erstellte Kindprozesse in einem anderen PID-Namensraum als dem des Aufrufenden abgelegt werden. (Seit Linux 4.12 wird dieser PID-Namensraum über die Datei I</proc/[PID]/ns/pid_for_children> gezeigt, wie in B<namespaces>(7) beschrieben.) Diese Aufrufe ändern allerdings nicht den PID-Namensraum des aufrufenden Prozesses, da dies das Verständnis des Aufrufenden über seine eigene PID (wie sie mit B<getpid>() berichtet wird) ändern würde, wodurch viele Anwendungen und Bibliotheken beschädigt würden.
fr: Les appels à B<setns>(2) qui indiquent un descripteur de fichier d'un espace de noms PID et les appels à B<unshare>(2) avec l'attribut B<CLONE_NEWPID> font que les processus enfant qui seront créés par la suite seront placés dans un espace de noms PID différent de celui de l'appelant. Depuis Linux 4.12, cet espace de noms PID est affiché à l’aide du fichier I</proc/[pid]/ns/pid_for_children>, comme décrit dans B<namespaces>(7). Cependant, ces appels ne changent pas l’espace de noms PID du processus appelant, parce que le faire modifierait la perception par l'appelant de son propre PID (comme indiqué dans B<getpid>()), cassant de nombreuses applications et bibliothèques.

source: A process may call B<unshare>(2) with the B<CLONE_NEWPID> flag only once. After it has performed this operation, its I</proc/PID/ns/pid_for_children> symbolic link will be empty until the first child is created in the namespace.
de: Ein Prozess kann B<unshare>(2) mit dem Schalter B<CLONE_NEWPID> nur einmal aufrufen. Nachdem er diese Aktion durchgeführt hat, wird sein symbolischer Link I</proc/PID/ns/pid_for_children> leer sein, bis der erste Kindprozess in dem Namensraum erstellt wurde.
fr: Un processus peut appeler B<unshare>(2) avec l’indicateur B<CLONE_NEWPID> seulement une fois. Après avoir réalisé cette opération, son lien symbolique I</proc/PID/ns/pid_for_children> sera vide jusqu’à la création du premier enfant dans l’espace de noms.

source: In current versions of Linux, B<CLONE_NEWPID> can't be combined with B<CLONE_THREAD>. Threads are required to be in the same PID namespace such that the threads in a process can send signals to each other. Similarly, it must be possible to see all of the threads of a processes in the B<proc>(5) filesystem. Additionally, if two threads were in different PID namespaces, the process ID of the process sending a signal could not be meaningfully encoded when a signal is sent (see the description of the I<siginfo_t> type in B<sigaction>(2)). Since this is computed when a signal is enqueued, a signal queue shared by processes in multiple PID namespaces would defeat that.
de: In den aktuellen Versionen von Linux kann B<CLONE_NEWPID> nicht mit B<CLONE_THREAD> kombiniert werden. Threads müssen im gleichen PID-Namensraum sein, damit die Threads in einem Prozess sich gegenseitig Signale senden können. Entsprechend muss es möglich sein, alle Threads eines Prozesses in dem Dateisystem B<proc>(5) zu sehen. Ergänzend kommt hinzu, dass die Prozesskennung des Prozesses, der ein Signal sendet, nicht beim Senden eines Signals aussagekräftig kodiert werden könnte, falls die zwei Threads in verschiedenen PID-Namensräumen wären (siehe die Beschreibung des Typs I<siginfo_t> in B<sigaction>(2)). Da diese berechnet wird, wenn ein Signal in die Warteschlange gestellt wird, würde eine Signalwarteschlange, die von Prozesse in mehreren PID-Namensräumen gemeinsam benutzt würde, dies vereiteln.
fr: Dans les versions actuelles de Linux, B<CLONE_NEWPID> ne peut pas être combiné avec B<CLONE_THREAD>. Les threads doivent être dans le même espace de noms PID de telle façon que les threads puissent s’envoyer des signaux les uns aux autres. De la même façon, il doit être possible de voir tous les threads d’un processus dans le système de fichiers B<proc>(5). De plus, si deux threads étaient dans des espaces de noms PID différents, l’ID de processus du processus envoyant un signal ne pourrait pas être encodé judicieusement lors de l’envoi d’un signal (consultez la description du type I<siginfo_t> dans B<sigaction>(2)). Puisque que cela a du sens lorsqu'un signal est mis en file d’attente, une file de signaux partagée par des processus dans plusieurs espaces de noms PID irait à l’encontre de cela.

source: A I</proc> filesystem shows (in the I</proc/[pid]> directories) only processes visible in the PID namespace of the process that performed the mount, even if the I</proc> filesystem is viewed from processes in other namespaces.
de: Ein Dateisystem I</proc> zeigt (in den Verzeichnissen I</proc/[PID]>) nur Prozesse, die in dem PID-Namensraum des Prozesses sichtbar sind, der die Einhängung durchführte, selbst falls das Dateisystem I</proc> von Prozessen in anderen Namensräumen betrachtet wird.
fr: Un système de fichiers I</proc> ne présente (dans les répertoires I</proc/[pid]>) que les processus visibles dans l'espace de noms PID du processus qui a effectué le montage, même si le système de fichiers I</proc> est vu par des processus appartenant à d'autres espaces de noms.

source: CONFORMING TO
de: KONFORM ZU
fr: CONFORMITÉ

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The first process created in a new namespace (i.e., the process created using B<clone>(2) with the B<CLONE_NEWPID> flag, or the first child created by a process after a call to B<unshare>(2) using the B<CLONE_NEWPID> flag) has the PID 1, and is the "init" process for the namespace (see B<init>(1)). A child process that is orphaned within the namespace will be reparented to this process rather than B<init>(1) (unless one of the ancestors of the child in the same PID namespace employed the B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> command to mark itself as the reaper of orphaned descendant processes).
de: Der erste in einem neuen Namensraum erstellte Prozess (d.h. der mittels B<clone>(2) mit dem Schalter B<CLONE_NEWPID> erstellte Prozess oder der erste Prozess, der durch einen Prozess nach einem Aufruf von B<unshare>(2) mittels des Schalters B<CLONE_NEWPID> erstellt wurde) hat die PID 1 und ist der »Init«-Prozess für den Namensraum (siehe B<init>(1)). Ein Kindprozess der innerhalb des Namensraums verwaist ist erhält diesen Prozess als Elternprozess statt B<init>(1) (außer einer der Vorfahrprozesse des Kindprozesses in dem gleichen PID-Namensraum setzt den Befehl B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> ein, um sich selbst als Auffänger des verwaisten Nachfahrprozesses zu markieren.)
fr: Le premier processus créé dans un nouvel espace de noms (c'est-à-dire le processus créé par B<clone>(2) avec l'attribut B<CLONE_NEWPID> ou le premier processus enfant créé après un appel à B<unshare>(2) avec l'attribut B<CLONE_NEWPID>) a pour PID 1. Il est le processus « init » pour l'espace de noms (consultez B<init>(1)). Un processus enfant qui devient orphelin dans l'espace de noms sera réapparenté à ce processus plutôt que d’appliquer B<init>(1) (sauf dans le cas où un ancêtre de cet enfant dans le même espace de noms PID a employé la commande B<PR_SET_CHILD_SUBREAPER> de B<prctl>(2) pour se marquer comme récupérateur des processus de sa descendance orphelins).

source: If the "init" process of a PID namespace terminates, the kernel terminates all of the processes in the namespace via a B<SIGKILL> signal. This behavior reflects the fact that the "init" process is essential for the correct operation of a PID namespace. In this case, a subsequent B<fork>(2) into this PID namespace fail with the error B<ENOMEM>; it is not possible to create a new processes in a PID namespace whose "init" process has terminated. Such scenarios can occur when, for example, a process uses an open file descriptor for a I</proc/[pid]/ns/pid> file corresponding to a process that was in a namespace to B<setns>(2) into that namespace after the "init" process has terminated. Another possible scenario can occur after a call to B<unshare>(2): if the first child subsequently created by a B<fork>(2) terminates, then subsequent calls to B<fork>(2) fail with B<ENOMEM>.
de: Falls sich der »Init«-Prozess eines PID-Namensraums beendet, beendet der Kernel mittels des Signals B<SIGKILL> alle Prozesse in dem Namensraum. Dieses Verhalten spiegelt die Tatsache wieder, dass der »Init«-Prozess für das korrekte Funktionieren eines PID-Namensraums wesentlich ist. In diesem Fall wird ein nachfolgender B<fork>(2) in den Namensraum mit dem Fehler B<ENOMEM> fehlschlagen; es ist nicht möglich, einen neuen Prozess in einem PID-Namensraum zu erstellen, dessen »Init«-Prozess sich beendet hat. Solche Szenarien können auftreten, wenn beispielsweise ein Prozess einen offenen Dateideskriptor für eine Datei I</proc/[PID]/ns/pid> verwendet, der einem Prozess entspricht, der in einem Namensraum war und der mit B<setns>(2) in einen Namensraum soll, nachdem sich der »Init«-Prozess beendet hat. Ein anderes mögliches Szenario kann direkt nach dem Aufruf von B<unshare>(2) auftreten: Falls sich der erste Kindprozess, der nach einem B<fork>(2) nachfolgend erstellt wurde, beendet, dann schlagen nachfolgende Aufrufe von B<fork>(2) mit B<ENOMEM> fehl.
fr: Si le processus « init » d'un espace de noms PID se termine, le noyau tue tous les processus de l'espace de noms au moyen du signal B<SIGKILL>. Cette implémentation illustre le fait que le processus « init » est essentiel au bon fonctionnement de l'espace de noms PID. Dans ce cas, l'exécution d'une commande B<fork>(2) ultérieure dans l'espace de noms PID échouera en renvoyant l'erreur B<ENOMEM>. Il n'est plus possible de créer des processus dans un espace de noms PID dont le processus « init » est terminé. Cela peut, par exemple, se produire lorsqu'un processus tente d'accéder à un descripteur de fichier ouvert pour un fichier I</proc/[pid]/ns/pid> correspondant à un processus d'un espace de noms afin d'exécuter B<setns>(2) dans cet espace de noms après la fin du processus « init ». Un autre scénario possible peut se produire après un appel à B<unshare>(2) : si le premier enfant consécutivement créé par un appel à B<fork>(2) se termine, alors les appels ultérieurs à B<fork>(2) échouerons en renvoyant l'erreur B<ENOMEM>.

source: This file displays the last PID that was allocated in this PID namespace. When the next PID is allocated, the kernel will search for the lowest unallocated PID that is greater than this value, and when this file is subsequently read it will show that PID.
de: Diese Datei zeigt die letzte PID, die in diesem PID-Namensraum zugewiesen wurde. Wenn die nächste PID zugewiesen wird, wird der Kernel nach der kleinsten nicht zugewiesenen PID suchen, die größer als dieser Wert ist, und wenn danach diese Datei gelesen wird, wird diese PID dann gezeigt.
fr: Ce fichier affiche le dernier PID qui a été alloué dans cet espace de noms PID. Quand le prochain PID est alloué, le noyau recherchera le plus petit PID non alloué qui est supérieur à cette valeur, et quand ce fichier est lu ultérieurement, il affiche ce PID.

source: This file is writable by a process that has the B<CAP_SYS_ADMIN> capability inside its user namespace. This makes it possible to determine the PID that is allocated to the next process that is created inside this PID namespace.
de: Diese Datei ist für einen Prozess, der über die Capability B<CAP_SYS_ADMIN> innerhalb seines Benutzernamensraums verfügt, schreibbar. Dies ermöglicht es, die PID zu bestimmen, die dem nächsten Prozess, der innerhalb des PID-Namensraums erstellt wird, zugewiesen wird.
fr: Un processus peut écrire sur ce fichier s’il a la capacité B<CAP_SYS_ADMIN> à l’intérieur de son espace de noms utilisateur. Cela rend possible de déterminer le PID qui est alloué au prochain processus créé dans cet espace de noms PID.

source: EXAMPLE
de: BEISPIEL
fr: EXEMPLE

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
