Repository: sebras/manpages-l10n
Catalog: po/*/man7/pid_namespaces.7.po
Languages: de, fr

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
fr: NOM

source: pid_namespaces - overview of Linux PID namespaces
de: pid_namespaces - Überblick über PID-Namensräume
fr: pid_namespaces – Présentation des espaces de noms d'identifiants de processus (ou PID) sous Linux

source: DESCRIPTION
de: BESCHREIBUNG

source: For an overview of namespaces, see B<namespaces>(7).
de: Für einen Überblick über Namensräume, siehe B<namespaces>(7).
fr: Pour une présentation générale des espaces de noms, consultez B<namespaces>(7).

source: PID namespaces isolate the process ID number space, meaning that processes in different PID namespaces can have the same PID. PID namespaces allow containers to provide functionality such as suspending/resuming the set of processes in the container and migrating the container to a new host while the processes inside the container maintain the same PIDs.
de: PID-Namensräume isolieren den Raum der Prozesskennungen. Das bedeutet, dass Prozesse in verschiedenen PID-Namensräumen die gleiche PID haben können. PID-Namensräume erlauben Containern, Funktionalitäten wie Suspendierung/Wiederaufnahme der Gruppe an Prozessen in dem Container und der Migration des Containers auf einen neuen Rechner bereitzustellen, bei denen die Prozesse innerhalb des Containers die gleiche PID behalten.
fr: Les espaces de noms PID isolent les espaces de numéros d'identifiants de processus, ce qui signifie que des processus de différents espaces de noms PID peuvent avoir le même PID. Les espaces de noms PID permettent aux conteneurs de fournir des possibilités telles que la suspension et la reprise de l’ensemble des processus d’un conteneur et la migration du conteneur vers un nouvel hôte tout en permettant aux processus du conteneur de conserver leurs PID.

source: PIDs in a new PID namespace start at 1, somewhat like a standalone system, and calls to B<fork>(2), B<vfork>(2), or B<clone>(2) will produce processes with PIDs that are unique within the namespace.
de: PIDs in einem neuen PID-Namensraum beginnen bei 1, ähnlich wie in autonomen Systemen. Aufrufe von B<fork>(2), B<vfork>(2) oder B<clone>(2) werden Prozesse mit PIDs erstellen, die innerhalb des Namensraums eindeutig sind.
fr: Dans un nouvel espace de noms PID, la numérotation commence à 1 comme pour un système autonome et les appels à B<fork>(2), B<vfork>(2) ou B<clone>(2) génèrent des identifiants de processus uniques dans l'espace de noms PID.

source: Use of PID namespaces requires a kernel that is configured with the B<CONFIG_PID_NS> option.
de: Die Verwendung von PID-Namensräumen benötigt einen Kernel, der mit der Option B<CONFIG_PID_NS> konfiguriert wurde.
fr: Le noyau doit avoir été configuré avec l'option B<CONFIG_PID_NS> pour permettre l'utilisation des espaces noms PID.

source: The namespace init process
de: Der Init-Prozess des Namensraums
fr: Le processus d'initialisation (init) de l'espace de noms

source: The first process created in a new namespace (i.e., the process created using B<clone>(2) with the B<CLONE_NEWPID> flag, or the first child created by a process after a call to B<unshare>(2) using the B<CLONE_NEWPID> flag) has the PID 1, and is the "init" process for the namespace (see B<init>(1)). This process becomes the parent of any child processes that are orphaned because a process that resides in this PID namespace terminated (see below for further details).
de: Der erste in einem neuen Namensraum erstellte Prozess (d.h. der mittels B<clone>(2) mit dem Schalter B<CLONE_NEWPID> erstellte Prozess oder der erste Prozess, der durch einen Prozess nach einem Aufruf von B<unshare>(2) mittels des Schalters B<CLONE_NEWPID> erstellt wurde) hat die PID 1 und ist der »Init«-Prozess für den Namensraum (siehe B<init>(1)). Dieser Prozess wird der Elternprozess jedes Kindprozesses, die verwaist wurden, da sich ein Prozess, der sich in diesem Namensraum befindet, beendet hat (weitere Details finden Sie weiter unten).
fr: Le premier processus créé dans un nouvel espace de noms (c'est-à-dire le processus créé par B<clone>(2) avec l'attribut B<CLONE_NEWPID> ou le premier processus enfant créé après un appel à B<unshare>(2) avec l'attribut B<CLONE_NEWPID>) a pour PID 1. Il est le processus « init » pour l'espace de noms (consultez B<init>(1)). Ce processus devient le parent pour n’importe quel processus enfant qui devient orphelin parce qu’un processus résidant dans cet espace de noms PID se termine (voir ci-après pour plus de détails).

source: Only signals for which the "init" process has established a signal handler can be sent to the "init" process by other members of the PID namespace. This restriction applies even to privileged processes, and prevents other members of the PID namespace from accidentally killing the "init" process.
de: Nur Signale, für die der »Init«-Prozess einen Signal-Handler etabliert hat, können durch andere Mitglieder des PID-Namensraums an den »Init«-Prozess gesandt werden. Diese Einschränkung gilt sogar für privilegierte Prozesse und verhindert, dass andere Mitglieder des PID-Namensraums versehentlich den »Init«-Prozess töten.
fr: Seuls les signaux pour lesquels le processus « init » a défini un gestionnaire de signal peuvent être envoyés au processus « init » par les autres processus de l'espace de noms PID. Cette règle s'applique également aux processus disposant de privilèges et permet d'éviter qu'un processus membre de l'espace de noms PID ne tue accidentellement le processus « init ».

source: Likewise, a process in an ancestor namespace can\(emsubject to the usual permission checks described in B<kill>(2)\(emsend signals to the "init" process of a child PID namespace only if the "init" process has established a handler for that signal. (Within the handler, the I<siginfo_t> I<si_pid> field described in B<sigaction>(2) will be zero.) B<SIGKILL> or B<SIGSTOP> are treated exceptionally: these signals are forcibly delivered when sent from an ancestor PID namespace. Neither of these signals can be caught by the "init" process, and so will result in the usual actions associated with those signals (respectively, terminating and stopping the process).
de: Entsprechend kann ein Prozess in einem Vorgängernamensraum \(en gemäß der gewöhnlichen, in B<kill>(2) beschriebenen Berechtigungsprüfungen \(en nur Signale an den »Init«-Prozess eines Nachfolge-PID-Namensraums senden, falls der »Init«-Prozess einen Handler für das Signal etabliert hat. (Innerhalb des Handlers wird das B<sigaction>(2) I<siginfo_t>-Feld I<si_pid> Null sein.) B<SIGKILL> oder B<SIGSTOP> werden besonders behandelt: diese Signale werden zwangsweise zugestellt, wenn sie von einem Vorgänger-PID-Namensraum gesandt werden. Keines dieser Signale kann durch den »Init«-Prozess abgefangen werden. Daher führen sie zu den gewöhnlichen Aktionen, die diesen Signalen zugeordnet sind (beenden bzw. stoppen des Prozesses).
fr: De même, un processus d'un espace ancêtre peut \(em en tenant compte des vérifications de droits habituelles décrites dans B<kill>(2) \(em envoyer des signaux au processus « init » d’un espace de noms enfant, à la condition que le processus « init » ait établi un gestionnaire pour ce signal. Le champ I<si_pid> de I<siginfo_t> décrit dans B<sigaction>(2) pour ce gestionnaire vaudra zéro. B<SIGKILL> et B<SIGSTOP> font figure d'exception : ces signaux seront appliqués « de force » lorsqu'ils sont émis depuis un espace de noms PID ancêtre. Ces signaux ne peuvent pas être interceptés par le processus « init » et les actions associées à ces processus seront exécutées (respectivement, tuer ou suspendre l'exécution du processus).

source: Starting with Linux 3.4, the B<reboot>(2) system call causes a signal to be sent to the namespace "init" process. See B<reboot>(2) for more details.
de: Seit Linux 3.4 führt der Systemaufruf B<reboot>(2) zum Senden eines Signales an den »Init«-Prozess des Namensraumes. Siehe B<reboot>(2) für weitere Details.
fr: Depuis Linux 3.4, l’appel système B<reboot>(2) déclenche l'envoi d'un signal aux processus « init » des espaces de noms. Consultez B<reboot>(2) pour obtenir plus d'informations.

source: Nesting PID namespaces
de: Verschachtelung von PID-Namensräumen
fr: Imbrication des espaces de noms PID

source: PID namespaces can be nested: each PID namespace has a parent, except for the initial ("root") PID namespace. The parent of a PID namespace is the PID namespace of the process that created the namespace using B<clone>(2) or B<unshare>(2). PID namespaces thus form a tree, with all namespaces ultimately tracing their ancestry to the root namespace. Since Linux 3.7, the kernel limits the maximum nesting depth for PID namespaces to 32.
de: PID-Namensräume können verschachtelt werden: jeder PID-Namensraum hat einen Vorgänger, außer für den anfänglichen (»Wurzel-«) PID-Namensraum. Der Vorgänger eines PID-Namensraums ist der PID-Namensraum des Prozesses, der den Namensraum mittels B<clone>(2) oder B<unshare>(2) erstellte. PID-Namensräume formen somit einen Baum, wobei alle Namensräume in letzter Instanz ihren Vorgänger auf den Wurzelnamensraum zurückführen. Seit Linux 3.7 begrenzt der Kernel die maximale Schachtelungstiefe für PID-Namensräume auf 32.
fr: Les espaces de noms PID peuvent être imbriqués : tous les espaces de noms PID ont un parent, sauf l'espace de noms PID initial (« root »). Le parent d'un espace de noms PID est l'espace de noms PID du processus qui a créé l'espace de noms à l’aide de B<clone>(2) ou B<unshare>(2). Les espaces de noms PID forment donc une arborescence dans laquelle chaque espace de noms peut remonter jusqu'à l'espace « root ». Depuis Linux 3.7, le noyau limite la profondeur maximale d’imbrication pour les espace de noms PID à 32.

source: A process is visible to other processes in its PID namespace, and to the processes in each direct ancestor PID namespace going back to the root PID namespace. In this context, "visible" means that one process can be the target of operations by another process using system calls that specify a process ID. Conversely, the processes in a child PID namespace can't see processes in the parent and further removed ancestor namespaces. More succinctly: a process can see (e.g., send signals with B<kill>(2), set nice values with B<setpriority>(2), etc.) only processes contained in its own PID namespace and in descendants of that namespace.
de: Ein Prozess ist für andere Prozesse in seinem PID-Namensraum sichtbar und für Prozesse in jedem direkten Vorgänger-PID-Namensraum, direkt zurück bis zum Wurzel-PID-Namensraum. In diesem Zusammenhang bedeutet »sichtbar«, dass ein Prozess das Ziel von Aktionen eines anderen Prozesses durch Verwendung von Systemaufrufen sein kann, die eine Prozesskennung angeben können. Umgekehrt kann ein Prozess in einem Nachfolge-PID-Namensraum die Prozesse in dem Vorgänger und weiter entfernten Vorgänger-Namensräumen nicht sehen. Kurz gesagt: Ein Prozess kann nur Prozesse, die in seinem eigenen PID-Namensraum und in Nachfolgern dieses Namensraums sind, sehen (z.B. ihnen Signale mit B<kill>(2) senden, ihren Nice-Wert mit B<setpriority>(2) ändern usw.).
fr: Un processus est visible de tous les processus de son espace de noms PID, et de tous les processus des espaces de noms PID ancêtres qui le séparent de l'espace PID « root ». Ici, on entend par « visible » qu'un autre processus peut être la cible d’opérations d’un autre processus utilisant des appels système qui précisent l’ID du processus. Inversement, les processus d'un espace de noms PID enfant ne peuvent pas voir les processus de l’espace parent et des espaces de noms ancêtre éloignés. En résumé, un processus peut seulement voir (c'est-à-dire envoyer des signaux avec B<kill>(2), définir des valeurs de courtoisie avec B<setpriority>(2), etc.) les processus de son propre espace de noms PID et des espaces de noms de sa descendance.

source: A process has one process ID in each of the layers of the PID namespace hierarchy in which is visible, and walking back though each direct ancestor namespace through to the root PID namespace. System calls that operate on process IDs always operate using the process ID that is visible in the PID namespace of the caller. A call to B<getpid>(2) always returns the PID associated with the namespace in which the process was created.
de: Ein Prozess hat eine Prozesskennung in jedem der Ebenen der PID-Namensraum-Hierarchie, in der er sichtbar ist, sowie rückwärts durch jeden direkten Vorgängernamensraum bis zum Wurzel-PID-Namensraum. Systemaufrufe, die auf Prozesskennungen agieren, agieren immer auf Prozesskennungen, die in dem PID-Namensraum des aufrufenden Prozesses sichtbar sind. Ein Aufruf von B<getpid>(2) liefert immer die PID zurück, die dem Namensraum zugeordnet ist, in dem der Prozess erstellt wurde.
fr: Un processus a un identifiant dans chaque niveau de la hiérarchie des espaces de noms PID dans lequel il est visible, et ce en remontant chaque espace de noms ancêtre jusqu'à l'espace de noms PID « root ». Les appels système qui s'exécutent sur des identifiants de processus s'appliquent à l'identifiant du processus qui est visible dans l’espace de noms PID de l'appelant. Un appel à B<getpid>(2) renvoie toujours le PID associé à l'espace de noms dans lequel le processus a été créé.

source: Some processes in a PID namespace may have parents that are outside of the namespace. For example, the parent of the initial process in the namespace (i.e., the B<init>(1) process with PID 1) is necessarily in another namespace. Likewise, the direct children of a process that uses B<setns>(2) to cause its children to join a PID namespace are in a different PID namespace from the caller of B<setns>(2). Calls to B<getppid>(2) for such processes return 0.
de: Einige Prozesse in einem PID-Namensraum können Elternprozesse haben, die sich außerhalb des Namensraums befinden. Der Elternprozess des anfänglichen Prozesses in dem Namensraum (d.h. der B<init>(1)-Prozess mit der PID 1) befindet sich beispielsweise notwendigerweise in einem anderen Namensraum. Entsprechend sind die direkten Kindprozesses eines Prozesses, der B<setns>(2) verwendet, damit seine Kindprozesse einem PID-Namensraum beitreten, in einem anderen PID-Nemsraum als der Aufrufende von B<setns>(2). Wird für solche Prozesse B<getppid>(2) aufgerufen, dann wird 0 zurückgeliefert.
fr: Certains processus d'un espace de noms PID peuvent avoir des parents en dehors de cet espace. Par exemple, le parent du processus initial de l'espace de noms (B<init>(1), processus dont le PID est 1) se trouve forcément en dehors de cet espace. De même, l’enfant direct d'un processus qui a invoqué B<setns>(2) pour que son enfant rejoigne un espace de noms PID, se trouve dans un espace de noms PID différent de celui de l'appelant à B<setns>(2). Les appels à B<getppid>(2) pour de tels processus renvoient B<0>.

source: While processes may freely descend into child PID namespaces (e.g., using B<setns>(2) with a PID namespace file descriptor), they may not move in the other direction. That is to say, processes may not enter any ancestor namespaces (parent, grandparent, etc.). Changing PID namespaces is a one-way operation.
de: Während Prozesse frei in Nachfolge-PID-Namensräume absteigen können (z.B. mittels B<setns>(2) mit einem PID-Namensraum-Dateideskriptor), können sie sich nicht in die andere Richtung bewegen. Das bedeutet, Prozesse dürfen keine Vorgängernamensräume (direkte, zweiter Stufe, usw.) betreten. Das Ändern von PID-Namensräumen ist eine Einwegaktion.
fr: Alors que les processus peuvent descendre librement dans les espaces de noms enfant (par exemple, en utilisant B<setns>(2) avec un descripteur de fichier d’espace de noms PID), ils ne peuvent pas se déplacer dans l’autre direction. Cela veut dire que les processus ne peuvent entrer dans aucun espace de noms ancêtre (parent, grand-parent, etc.). La modification d’espace de noms PID est une opération à sens unique.

source: The B<NS_GET_PARENT> B<ioctl>(2) operation can be used to discover the parental relationship between PID namespaces; see B<ioctl_ns>(2).
de: Die Aktion B<NS_GET_PARENT> B<ioctl>(2) kann zum Erkennen der hierarchischen Beziehung zwischen PID-Namensräumen verwandt werden; siehe B<ioctl_ns>(2).
fr: L’opération B<NS_GET_PARENT> d’B<ioctl>(2) peut être utilisée pour découvrir la relation parentale entre les espaces de noms PID. Consultez B<ioctl_ns>(2).

source: setns(2) and unshare(2) semantics
de: Semantik von setns und unshare(2)
fr: Sémantiques de setns(2) et de unshare(2)

source: To put things another way: a process's PID namespace membership is determined when the process is created and cannot be changed thereafter. Among other things, this means that the parental relationship between processes mirrors the parental relationship between PID namespaces: the parent of a process is either in the same namespace or resides in the immediate parent PID namespace.
de: Um es anders zu sagen: die Mitgliedschaft eines Prozesses in einem PID-Namensraum wird bei der Erstellung des Prozesses bestimmt und kann danach nicht mehr geändert werden. Unter anderem bedeutet dies, dass die Eltern-Kind-Beziehung zwischen Prozessen die Vorgänger-Nachfolger-Beziehung zwischen PID-Namensräumen spiegelt: der Elternprozess ist entweder im gleichen Namensraum oder befindet sich im direkten Vorgänger-PID-Namensraum.
fr: Pour présenter les choses différemment, l'appartenance d'un processus à un espace de noms PID est déterminée lors de la création du processus et ne peut plus être changée ensuite. Cela signifie que la relation parent-enfant entre processus reproduit la relation parentale entre des espaces de noms PID : le parent d'un processus est soit dans le même espace de noms, soit dans l'espace de noms PID du parent immédiat.

source: Adoption of orphaned children
de: Adoption von verwaisten Kindprozessen
fr: Adoption d’un enfant orphelin

source: When a child process becomes orphaned, it is reparented to the "init" process in the PID namespace of its parent (unless one of the nearer ancestors of the parent employed the B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> command to mark itself as the reaper of orphaned descendant processes). Note that because of the B<setns>(2) and B<unshare>(2) semantics described above, this may be the "init" process in the PID namespace that is the I<parent> of the child's PID namespace, rather than the "init" process in the child's own PID namespace.
de: Wenn ein Kindprozess verwaist wird, wird der »Init«-Prozess in dem PID-Namensraum seines Elternprozesses sein neuer Elternprozess (außer einer der Vorfahrprozesse des Elternprozesses, der näher dran ist, setzt den Befehl B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> ein, um sich selbst als Auffänger des verwaisten Nachfahrprozesses zu markieren.) Beachten Sie, dass aufgrund der oben beschriebenen Semantik von B<setns>(2) und B<unshare>(2) dies der »Init«-Prozess in dem PID-Namensraum sein kann, der I<Vorgänger> des PID-Namensraums des Kindprozesses sein kann, statt des »Init«-Prozesses in dem eigenen PID-Namensraum des Kindprozesses.
fr: Quand un processus enfant devient orphelin, il est réapparenté au processus « init » dans l’espace de noms PID de son parent (sinon un des ancêtres les plus proches du parent employé dans la commande B<PR_SET_CHILD_SUBREAPER> de B<prctl>(2) pour être marqué comme le récupérateur des processus de descendants orphelins). Il est à noter qu’à cause des sémantiques de B<setns>(2) et B<unshare>(2) décrites ci-dessus, cela peut être le processus « init » dans l’espace de noms PID qui est le I<parent> de l’espace de noms PID de l’enfant, plutôt que le processus « init » dans le propre espace de noms PID de l’enfant.

source: Compatibility of CLONE_NEWPID with other CLONE_* flags
de: Kompatibilität von CLONE_NEWPID zu anderen CLONE_*-Schaltern
fr: Compatibilité de CLONE_NEWPID avec les autres attributs CLONE_*

source: In current versions of Linux, B<CLONE_NEWPID> can't be combined with B<CLONE_THREAD>. Threads are required to be in the same PID namespace such that the threads in a process can send signals to each other. Similarly, it must be possible to see all of the threads of a process in the B<proc>(5) filesystem. Additionally, if two threads were in different PID namespaces, the process ID of the process sending a signal could not be meaningfully encoded when a signal is sent (see the description of the I<siginfo_t> type in B<sigaction>(2)). Since this is computed when a signal is enqueued, a signal queue shared by processes in multiple PID namespaces would defeat that.
de: In den aktuellen Versionen von Linux kann B<CLONE_NEWPID> nicht mit B<CLONE_THREAD> kombiniert werden. Threads müssen im gleichen PID-Namensraum sein, damit die Threads in einem Prozess sich gegenseitig Signale senden können. Entsprechend muss es möglich sein, alle Threads eines Prozesses in dem Dateisystem B<proc>(5) zu sehen. Ergänzend kommt hinzu, dass die Prozesskennung des Prozesses, der ein Signal sendet, nicht beim Senden eines Signals aussagekräftig kodiert werden könnte, falls die zwei Threads in verschiedenen PID-Namensräumen wären (siehe die Beschreibung des Typs I<siginfo_t> in B<sigaction>(2)). Da diese berechnet wird, wenn ein Signal in die Warteschlange gestellt wird, würde eine Signalwarteschlange, die von Prozessen in mehreren PID-Namensräumen gemeinsam benutzt würde, dies vereiteln.

source: In earlier versions of Linux, B<CLONE_NEWPID> was additionally disallowed (failing with the error B<EINVAL>) in combination with B<CLONE_SIGHAND> (before Linux 4.3) as well as B<CLONE_VM> (before Linux 3.12). The changes that lifted these restrictions have also been ported to earlier stable kernels.
de: In früheren Versionen von Linux war zusätzlich B<CLONE_NEWPID> verboten (schlug mit dem Fehler B<EINVAL> fehl) zusammen mit B<CLONE_SIGHAND> (vor Linux 4.3) sowie B<CLONE_VM> (vor Linux 3.12). Die Änderungen, die diese Beschränkungen aufhoben, wurden auch in ältere stabile Kernel portiert.
fr: De plus dans les premières versions de Linux, B<CLONE_NEWPID> n’était pas autorisé (échouant avec l’erreur B<EINVAL>) en combinaison avec B<CLONE_SIGHAND> (avant Linux 4.3) ainsi que B<CLONE_VM> (avant Linux 3.12). Les modifications qui ont apporté ces restrictions ont été aussi portées sur les précédents noyaux stables.

source: /proc and PID namespaces
de: /proc und PID-Namensräume
fr: /proc et espaces de noms PID
