Repository: sebras/manpages-l10n
Catalog: po/*/man7/random.7.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: random - overview of interfaces for obtaining randomness
fr: random – aperçu d’interfaces pour obtenir un caractère aléatoire

source: The kernel random-number generator relies on entropy gathered from device drivers and other sources of environmental noise to seed a cryptographically secure pseudorandom number generator (CSPRNG). It is designed for security, rather than speed.
fr: Le générateur de nombres aléatoires du noyau repose sur l’entropie recueillie à partir de pilotes de périphérique et d’autres sources de bruit environnemental pour ensemencer un générateur de nombres pseudo-aléatoires (CSPRNG) sûr du point de vue cryptographie. Il est conçu pour la sécurité plutôt que pour la rapidité.

source: The following interfaces provide access to output from the kernel CSPRNG:
fr: Les interfaces suivantes fournissent un accès pour obtenir un résultat d’un générateur de nombres pseudo-aléatoires du noyau :

source: The I</dev/urandom> and I</dev/random> devices, both described in B<random>(4). These devices have been present on Linux since early times, and are also available on many other systems.
fr: Les périphériques I</dev/urandom> et I</dev/random>, tous deux décrits dans B<random>(4). Ces périphériques sont présents dans Linux depuis les premiers temps et sont aussi disponibles dans beaucoup d’autres systèmes.

source: The Linux-specific B<getrandom>(2) system call, available since Linux 3.17. This system call provides access either to the same source as I</dev/urandom> (called the I<urandom> source in this page) or to the same source as I</dev/random> (called the I<random> source in this page). The default is the I<urandom> source; the I<random> source is selected by specifying the B<GRND_RANDOM> flag to the system call. (The B<getentropy>(3) function provides a slightly more portable interface on top of B<getrandom>(2).)
fr: L’appel système B<getrandom>(2) spécifique à Linux, disponible depuis Linux 3.17. Cet appel système fournit un accès soit à la même source que I</dev/urandom> (appelée la source I<urandom> dans cette page) ou à la même source que I</dev/random> (appelée la source I<random> dans cette page). Celle par défaut est la source I<urandom>. La source I<random> est sélectionnée avec l’indicateur B<GRND_RANDOM> dans l’appel système. La fonction B<getentropy>(3) avec B<getrandom>(2) fournit une interface légèrement plus portable.

source: Initialization of the entropy pool
fr: Initialisation de la réserve d’entropie

source: The kernel collects bits of entropy from the environment. When a sufficient number of random bits has been collected, the entropy pool is considered to be initialized.
fr: Le noyau collecte les bits d’entropie à partir de l’environnement. Lorsque un nombre suffisant de bits a été collecté, la réserve d’entropie est considérée comme initialisée.

source: Choice of random source
fr: Choix de la source random

source: Unless you are doing long-term key generation (and most likely not even then), you probably shouldn't be reading from the I</dev/random> device or employing B<getrandom>(2) with the B<GRND_RANDOM> flag. Instead, either read from the I</dev/urandom> device or employ B<getrandom>(2) without the B<GRND_RANDOM> flag. The cryptographic algorithms used for the I<urandom> source are quite conservative, and so should be sufficient for all purposes.
fr: À moins de vouloir générer une clef pérenne (et très vraisemblablement même pas dans ce cas), la lecture ne sera probablement pas faite à partir du périphérique I</dev/random> ou en employant B<getrandom>(2) avec l’indicateur B<GRND_RANDOM>. À la place, la lecture sera faite soit à partir du périphérique I</dev/urandom> ou en utilisant B<getrandom>(2) sans l’indicateur B<GRND_RANDOM>. Les cryptosystèmes pour la source I<urandom> sont plutôt conservatifs et par conséquent devraient être suffisants pour toutes les utilisations.

source: The disadvantage of B<GRND_RANDOM> and reads from I</dev/random> is that the operation can block for an indefinite period of time. Furthermore, dealing with the partially fulfilled requests that can occur when using B<GRND_RANDOM> or when reading from I</dev/random> increases code complexity.
fr: L’inconvénient de B<GRND_RANDOM> et des lectures à partir de I</dev/random> est que l’opération peut bloquer pendant une période indéfinie. De plus, gérer des requêtes partiellement remplies pouvant se produire lors de l’utilisation de B<GRND_RANDOM> ou de la lecture à partir de I</dev/random> augmente la complexité du code.

source: Monte Carlo and other probabilistic sampling applications
fr: Monte-Carlo et autres applications d’échantillonnage probabiliste

source: Using these interfaces to provide large quantities of data for Monte Carlo simulations or other programs/algorithms which are doing probabilistic sampling will be slow. Furthermore, it is unnecessary, because such applications do not need cryptographically secure random numbers. Instead, use the interfaces described in this page to obtain a small amount of data to seed a user-space pseudorandom number generator for use by such applications.
fr: L’utilisation de ces interfaces pour fournir de grandes quantités de données pour les simulations de Monte-Carlo et d’autres programmes ou algorithmes réalisant un échantillonnage probabiliste, sera peu rapide. De plus, c’est inutile parce que de telles applications n’ont pas besoin de nombres aléatoires sûrs du point de vue chiffrement. À la place, les interfaces décrites dans cette page sont à utiliser pour obtenir une petite quantité de données pour ensemencer un générateur de nombres pseudo-aléatoires pour ce type d’applications.

source: Comparison between getrandom, /dev/urandom, and /dev/random
fr: Comparaison entre getrandom, /dev/urandom et /dev/random

source: The following table summarizes the behavior of the various interfaces that can be used to obtain randomness. B<GRND_NONBLOCK> is a flag that can be used to control the blocking behavior of B<getrandom>(2). The final column of the table considers the case that can occur in early boot time when the entropy pool is not yet initialized.
fr: Le tableau suivant résume le comportement des diverses interfaces qui peuvent être utilisées pour obtenir un caractère aléatoire. B<GRND_NONBLOCK> est un indicateur qui peut être utilisé pour contrôler le comportement bloquant de B<getrandom>(2). La dernière colonne du tableau tient compte du cas pouvant se produire au tout début du démarrage quand la réserve d’entropie n’est pas encore initialisée.

source: Pool
fr: Réserve

source: Blocking \%behavior
fr: Comportement \%de blocage

source: Behavior when pool is not yet ready
fr: Comportement si réserve pas encore prête

source: Blocking pool
fr: Réserve bloquante

source: If entropy too low, blocks until there is enough entropy again
fr: Si entropie trop faible, blocage jusqu’à assez d’entropie

source: Blocks until enough entropy gathered
fr: Blocage jusqu’à suffisamment d’entropie accumulée

source: CSPRNG output
fr: Sortie CSPRNG

source: Never blocks
fr: Aucun blocage

source: Returns output from uninitialized CSPRNG (may be low entropy and unsuitable for cryptography)
fr: CSPRNG non initialisé (entropie faible et inadaptée au chiffrement ?)

source: Same as I</dev/urandom>
fr: Identique à I</dev/urandom>

source: Does not block once is pool ready
fr: Aucun blocage si réserve prête

source: Blocks until pool ready
fr: Blocage jusqu’à réserve prête

source: Same as I</dev/random>
fr: Identique à I</dev/random>

source: B<EAGAIN> if not enough entropy available
fr: B<EAGAIN> si manque d’entropie disponible

source: Generating cryptographic keys
fr: Génération des clés de chiffrement

source: The amount of seed material required to generate a cryptographic key equals the effective key size of the key. For example, a 3072-bit RSA or Diffie-Hellman private key has an effective key size of 128 bits (it requires about 2^128 operations to break) so a key generator needs only 128 bits (16 bytes) of seed material from I</dev/random>.
fr: Le montant de matériel d’ensemencement nécessite de générer une clé de chiffrement égale à la taille effective de la clé. Par exemple, une clé privée ou Diffie-Hellman de 3072 bits a une taille effective de 128 bits (2^128 opérations sont nécessaires pour la casser), aussi un générateur de clé a besoin de seulement 128 bits (16 octets) de matériel d’ensemencement à partir de I</dev/random>.

source: While some safety margin above that minimum is reasonable, as a guard against flaws in the CSPRNG algorithm, no cryptographic primitive available today can hope to promise more than 256 bits of security, so if any program reads more than 256 bits (32 bytes) from the kernel random pool per invocation, or per reasonable reseed interval (not less than one minute), that should be taken as a sign that its cryptography is I<not> skillfully implemented.
fr: Bien qu’une marge de sécurité au-dessus de ce minimum soit raisonnable comme protection contre des défauts d’algorithme de CSPRNG, aucune primitive cryptographique disponible actuellement ne peut espérer promettre plus de 256 bits de sécurité, aussi, si un programme lit plus de 256 bits (32 octets) de la réserve de caractère aléatoire du noyau par invocation, ou par intervalle raisonnable de réensemencement (pas moins d’une minute), cela doit être pris comme un signe que son chiffrement n’a I<pas> été implémenté savamment.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
