Repository: sebras/manpages-l10n
Catalog: po/*/man7/raw.7.po
Languages: es, fr

source: NAME
es: NOMBRE
fr: NOM

source: raw - Linux IPv4 raw sockets
es: raw - Conectores directos (raw) IPv4 de Linux
fr: raw – Sockets raw IPv4 sous Linux

source: SYNOPSIS
es: SINOPSIS

source: B<#include E<lt>sys/socket.hE<gt>> B<#include E<lt>netinet/in.hE<gt>> B<raw_socket = socket(AF_INET, SOCK_RAW, int >I<protocol>B<);>
es: B<#include E<lt>sys/socket.hE<gt>> B<#include E<lt>netinet/in.hE<gt>> B<raw_socket = socket(AF_INET, SOCK_RAW, int >I<protocolo>B<);>
fr: B<#include E<lt>sys/socket.hE<gt>> B<#include E<lt>netinet/in.hE<gt>> B<raw_socket = socket(AF_INET, SOCK_RAW, int >I<protocole>B<);>

source: DESCRIPTION
es: DESCRIPCIÓN

source: Raw sockets allow new IPv4 protocols to be implemented in user space. A raw socket receives or sends the raw datagram not including link level headers.
es: Los conectores directos permiten implementar nuevos protocolos IPv4 en el espacio de usuario. Un conector directo recibe o envía el datagrama crudo sin incluir cabeceras del nivel de enlace.
fr: Les sockets raw (bruts, sans protocole) permettent d'implémenter de nouveaux protocoles IPv4 dans l'espace utilisateur. Un socket raw reçoit ou envoie des datagrammes bruts sans les en-têtes de couche de liaison.

source: The IPv4 layer generates an IP header when sending a packet unless the B<IP_HDRINCL> socket option is enabled on the socket. When it is enabled, the packet must contain an IP header. For receiving, the IP header is always included in the packet.
es: La capa IPv4 genera una cabecera IP cuando se envía un paquete, a menos que se active la opción B<IP_HDRINCL> en el conector. Cuando se activa, el paquete debe contener una cabecera IP. En la recepción, la cabecera IP siempre está incluida en el paquete.
fr: La couche IPv4 génère des en-têtes IP lorsqu'elle envoie un paquet, à moins que l'option B<IP_HDRINCL> de socket ne soit activée sur le socket. Lorsqu'elle est activée, le socket doit contenir l'en-tête IP. Pour la réception, l'en-tête IP est toujours inclus dans le paquet.

source: In order to create a raw socket, a process must have the B<CAP_NET_RAW> capability in the user namespace that governs its network namespace.
es: Para crea un conector directo, un proceso tiene que poseer la capacidad B<CAP_NET_RAW> en la red y con el usuario que lo ejecute.
fr: Dans le but de créer un socket raw, un processus doit avoir la capacité B<CAP_NET_RAW> dans l’espace de noms utilisateur qui régit son espace de noms réseau.

source: All packets or errors matching the I<protocol> number specified for the raw socket are passed to this socket. For a list of the allowed protocols, see the IANA list of assigned protocol numbers at E<.UR http://www.iana.org/assignments/protocol-numbers/> E<.UE> and B<getprotobyname>(3).
es: Todos los paquetes o errores cuyo protocolo coinciden con el número de I<protocolo> especificado por el conector directo, se pasan a este conector. Para una lista de los protocolos permitidos vea los números asignados en E<.UR http://www.iana.org/assignments/protocol-numbers/> E<.UE> y B<getprotobyname>(3).
fr: Tous les paquets ou les erreurs correspondant au numéro de I<protocole> indiqué pour le socket raw sont transmis à ce socket. Pour voir une liste des protocoles autorisés, consultez les numéros assignés dans E<.UR http://www.iana.org/assignments/protocol-numbers/> E<.UE> et B<getprotobyname>(3).

source: A protocol of B<IPPROTO_RAW> implies enabled B<IP_HDRINCL> and is able to send any IP protocol that is specified in the passed header. Receiving of all IP protocols via B<IPPROTO_RAW> is not possible using raw sockets.
es: Un protocolo B<IPPROTO_RAW> implica que B<IP_HDRINCL> está activa y preparada para enviar cualquier protocolo IP especificado en la cabecera pasada. Recibir todos los protocolos IP via B<IPPROTO_RAW> no es posible con conectores directos.
fr: Un protocole B<IPPROTO_RAW> implique l'activation de B<IP_HDRINCL> et autorise l'émission suivant n'importe quel protocole IP indiqué dans l'en-tête. La réception de tous les protocoles IP avec B<IPPROTO_RAW> n'est pas possible avec les sockets raw.

source: IP Header fields modified on sending by B<IP_HDRINCL>
es: Campos de cabecera IP modificados en el envío por B<IP_HDRINCL>
fr: Champs d'en-tête IP modifiés en émission par B<IP_HDRINCL>

source: IP Checksum
es: Suma de comprobación IP
fr: Somme de contrôle d’IP

source: Always filled in
es: Siempre se rellena
fr: Toujours rempli

source: Source Address
es: Dirección fuente
fr: Adresse de socket

source: Filled in when zero
es: Se rellena cuando es cero
fr: Rempli si composé de zéros

source: Packet ID
es: Identificador del paquete
fr: ID de paquet

source: Total Length
es: Longitud total
fr: Longueur totale

source: If B<IP_HDRINCL> is specified and the IP header has a nonzero destination address, then the destination address of the socket is used to route the packet. When B<MSG_DONTROUTE> is specified, the destination address should refer to a local interface, otherwise a routing table lookup is done anyway but gatewayed routes are ignored.
es: Si se especifica B<IP_HDRINCL> y la cabecera IP tiene una dirección de destino distinta de cero, la dirección de destino del conector se utiliza para enrutar el paquete. Cuando se especifica B<MSG_DONTROUTE>, la dirección de destino debe referirse a una interfaz local, de lo contrario, se realiza una búsqueda en la tabla de enrutamiento, aunque se ignoran las rutas que se dirigen a enrutadores.
fr: Si B<IP_HDRINCL> est indiqué et si l'en-tête IP a une adresse de destination différente de zéro, alors l'adresse de destination du socket est utilisée pour router le paquet. Quand B<MSG_DONTROUTE> est indiqué, l'adresse de destination devrait toujours viser une interface locale. Sinon, un examen de la table de routage a quand même lieu, mais les routes avec une passerelle sont ignorées.

source: If B<IP_HDRINCL> isn't set, then IP header options can be set on raw sockets with B<setsockopt>(2); see B<ip>(7) for more information.
es: Si no se activa B<IP_HDRINCL>, se pueden configurar las opciones de la cabecera IP de los conectores directos con B<setsockopt>(2). Vea B<ip>(7) para más información.
fr: Si B<IP_HDRINCL> n'est pas indiqué, les options d'en-tête IP peuvent être définies sur les sockets raw avec B<setsockopt>(2) ; consultez B<ip>(7) pour plus d'informations.

source: Starting with Linux 2.2, all IP header fields and options can be set using IP socket options. This means raw sockets are usually needed only for new protocols or protocols with no user interface (like ICMP).
es: A partir de Linux 2.2 todas las opciones y campos de las cabeceras IP se pueden configurar usando las opciones de los conectores IP. Esto significa que los conectores directos suelen ser necesarios sólo para protocolos nuevos o protocolos sin interfaz de usuario (como ICMP).
fr: Depuis Linux 2.2 tous les champs d'en-tête IP et les options peuvent être définis en utilisant les options IP de socket. Cela signifie que les sockets raw ne servent en général que pour les nouveaux protocoles ou les protocoles sans interface utilisateur (comme ICMP).

source: When a packet is received, it is passed to any raw sockets which have been bound to its protocol before it is passed to other protocol handlers (e.g., kernel protocol modules).
es: Cuando se recibe un paquete, se pasa a cualquier conector directo que haya sido asociado a su protocolo antes de que sea pasado al manejador de cualquier otro protocolo (por ejemplo, los módulos de protocolo del núcleo).
fr: Lorsqu'un paquet est reçu, il est passé à tous les sockets raw qui ont été attachés à son protocole avant d'être transmis aux gestionnaires des autres protocoles (par exemple les modules des protocoles du noyau).

source: Address format
es: Formato de las direcciones
fr: Format d'adresse

source: For sending and receiving datagrams (B<sendto>(2), B<recvfrom>(2), and similar), raw sockets use the standard I<sockaddr_in> address structure defined in B<ip>(7). The I<sin_port> field could be used to specify the IP protocol number, but it is ignored for sending in Linux 2.2 and later, and should be always set to 0 (see BUGS). For incoming packets, I<sin_port> is set to zero.
es: Para el envío y la recepción de datagramas (B<sendto>(2), B<recvfrom>(2) y similar) los conectores directos usan la estructura de direcciones estándar B<sockaddr_in> definida en B<ip>(7). El campo B<sin_port> se podría usar para especificar el número de protocolo IP, pero en Linux 2.2 se ignora al enviar y siempre debería valer 0 (vea FALLOS). Para los paquetes de entrada, a B<sin_port> se le asigna el protocolo del paquete. Vea el fichero cabecera B<E<lt>netinet/in.hE<gt>> para protocolos IP válidos.
fr: Pour envoyer et recevoir des datagrammes (B<sendto>(2), B<recvfrom>(2) et similaires), les sockets raw utilisent la structure d'adresse I<sockaddr_in> standard, définie dans B<ip>(7). Le champ I<sin_port> pourrait être utilisé pour indiquer un numéro de protocole IP, mais il est ignoré pour l'émission dans Linux 2.2 et les versions suivantes et devrait être toujours mis à zéro (voir paragraphe BOGUES). Pour les paquets entrants I<sin_port> est réglé à zéro.

source: Socket options
es: Opciones de los conectores
fr: Options de socket

source: Raw socket options can be set with B<setsockopt>(2) and read with B<getsockopt>(2) by passing the B<IPPROTO_RAW> family flag.
es: Las opciones de los conectores directos se pueden configurar con B<setsockopt>(2) y leer con B<getsockopt>(2), pasando la opción de familia B<IPPROTO_RAW>.
fr: Les options des sockets raw peuvent être écrites avec B<setsockopt>(2) et lues avec B<getsockopt>(2) en passant l'attribut de famille B<IPPROTO_RAW>.

source: Enable a special filter for raw sockets bound to the B<IPPROTO_ICMP> protocol. The value has a bit set for each ICMP message type which should be filtered out. The default is to filter no ICMP messages.
es: Activa un filtro especial para los conectores directos asociados al protocolo B<IPPROTO_ICMP>. El valor tiene un bit activo para cada tipo de mensaje ICMP que debe filtrarse. Por defecto, no se filtra ningún mensaje ICMP.
fr: Activer un filtre spécial sur les sockets raw liés au protocole B<IPPROTO_ICMP>. La valeur a un bit défini pour chaque type de message ICMP qui doit être rejeté. La valeur par défaut est de ne filtrer aucun message ICMP.

source: In addition, all B<ip>(7) B<IPPROTO_IP> socket options valid for datagram sockets are supported.
es: Además, todas las opciones B<ip>(7) del conector B<IPPROTO_IP> válidas para conectores de datagramas están implementadas.
fr: De plus, toutes les options B<IPPROTO_IP> de B<ip>(7) valables pour les sockets datagrammes sont prises en charge.

source: Error handling
es: Gestión de errores
fr: Traitement des erreurs

source: Errors originating from the network are passed to the user only when the socket is connected or the B<IP_RECVERR> flag is enabled. For connected sockets, only B<EMSGSIZE> and B<EPROTO> are passed for compatibility. With B<IP_RECVERR>, all network errors are saved in the error queue.
es: Sólo se pasan al usuario los errores generados por la red cuando el conector está conectado o está activa la opción B<IP_RECVERR>. Para conectores conectados, sólo se pasan B<EMSGSIZE> y B<EPROTO> por compatibilidad. Con B<IP_RECVERR> todos los errores de red se guardan en la cola de errores.
fr: Les erreurs provenant du réseau ne sont transmises à l'utilisateur que lorsque le socket est connecté ou si le drapeau B<IP_RECVERR> est actif. Pour les sockets connectés, seules B<EMSGSIZE> et B<EPROTO> sont transmises pour compatibilité. Avec B<IP_RECVERR>, toutes les erreurs réseau sont sauvegardées dans la file d'erreurs.

source: ERRORS
es: ERRORES
fr: ERREURS

source: User tried to send to a broadcast address without having the broadcast flag set on the socket.
es: El usuario ha intentado enviar a una dirección de difusión sin tener activa la opción de difusión en el conector.
fr: L'utilisateur essaye d'envoyer sur une adresse broadcast sans avoir le drapeau broadcast sur le socket.

source: An invalid memory address was supplied.
es: Se ha pasado una dirección de memoria inválida.
fr: Une adresse mémoire incorrecte a été fournie.

source: Invalid argument.
es: Argumento inválido.
fr: Argument incorrect.

source: Packet too big. Either Path MTU Discovery is enabled (the B<IP_MTU_DISCOVER> socket flag) or the packet size exceeds the maximum allowed IPv4 packet size of 64\ kB.
es: Paquete demasiado grande. O bien el descubrimiento del MTU de la ruta está activo (la opción B<IP_MTU_DISCOVER> de los conectores) o bien el tamaño del paquete excede el máximo tamaño de 64\ kB permitido por IPv4.
fr: Paquet trop grand. Soit la recherche du MTU d’un chemin donné (Path MTU discovery — PMTUd)) est active (voir l'attribut B<IP_MTU_DISCOVER> de socket), soit la taille du paquet dépasse le maximum autorisé par IPv4 (64\ Ko).

source: Invalid flag has been passed to a socket call (like B<MSG_OOB>).
es: Se ha pasado a la llamada socket una opción inválida (como B<MSG_OOB>).
fr: Un attribut incorrect a été transmis à un appel de socket (comme B<MSG_OOB>).

source: The user doesn't have permission to open raw sockets. Only processes with an effective user ID of 0 or the B<CAP_NET_RAW> attribute may do that.
es: El usuario no tiene permiso para abrir conectores directos. Sólo los procesos con un identificador de usuario efectivo de 0 o el atributo B<CAP_NET_RAW> pueden hacerlo.
fr: L'utilisateur n'a pas la permission d'ouvrir des sockets raw. Seuls les processus avec un UID effectif égal à zéro ou ayant la capacité B<CAP_NET_RAW> peuvent le faire.

source: An ICMP error has arrived reporting a parameter problem.
es: Ha llegado un error ICMP informando de un problema de parámetros.
fr: Une erreur ICMP est arrivée, indiquant un problème de paramétrage.

source: VERSIONS
es: VERSIONES

source: B<IP_RECVERR> and B<ICMP_FILTER> are new in Linux 2.2. They are Linux extensions and should not be used in portable programs.
es: B<IP_RECVERR> y B<ICMP_FILTER> son nuevos en la versión 2.2 de Linux. Ambos son extensiones de Linux y no deberían usarse en programas transportables.
fr: B<IP_RECVERR> et B<ICMP_FILTER> sont nouveaux dans Linux 2.2. Ce sont des extensions Linux qui ne doivent pas être employées dans des programmes portables.

source: Linux 2.0 enabled some bug-to-bug compatibility with BSD in the raw socket code when the B<SO_BSDCOMPAT> socket option was set; since Linux 2.2, this option no longer has that effect.
es: La versión 2.0 de Linux activaba cierta compatibilidad con BSD en el código de los conectores directos cuando se activaba la opción B<SO_BSDCOMPAT>. Ésto se ha eliminado en la versión 2.2.
fr: Linux 2.0 assurait une compatibilité bogue-à-bogue avec le code des sockets raw de BSD lorsque l’option B<SO_BSDCOMPAT> de socket était utilisée. Cela a été supprimé depuis Linux 2.2.

source: NOTES
es: NOTAS

source: By default, raw sockets do path MTU (Maximum Transmission Unit) discovery. This means the kernel will keep track of the MTU to a specific target IP address and return B<EMSGSIZE> when a raw packet write exceeds it. When this happens, the application should decrease the packet size. Path MTU discovery can be also turned off using the B<IP_MTU_DISCOVER> socket option or the I</proc/sys/net/ipv4/ip_no_pmtu_disc> file, see B<ip>(7) for details. When turned off, raw sockets will fragment outgoing packets that exceed the interface MTU. However, disabling it is not recommended for performance and reliability reasons.
es: Por defecto, los conectores directos averiguan el MTU de la ruta (unidad máxima de transmisión) por lo que el núcleo realiza un seguimiento del MTU hacia una IP de destino emitiendo B<EMSGSIZE> cuando la escritura deun conector directo lo sobrepasa. Cuando esto ocurre, la aplicación deberá reducir el tamaño de sus paquetes. La averiguación del MTU de las rutas puede desactivarse mediante la opción B<IP_MTU_DISCOVER> del conector o en el archivo I</proc/sys/net/ipv4/ip_no_pmtu_disc>, consulte B<ip>(7) para más información. Si está desactivada, los conectores directores fragmentarán los paquetes salientes que sobrepasen el MTU de la interfaz. Por razones de rendimiento y fiabilidad, no se recomienda desactivarlo.
fr: Par défaut, les sockets bruts utilisent la détection du MTU («\ Maximum Transmission Unit\ ») pour le chemin. Cela signifie que le noyau garde en mémoire le MTU vers une adresse IP cible spécifique et renvoie B<EMSGSIZE> lorsqu'un paquet raw dépasse cette taille. Dans ce cas, l'application doit diminuer la taille du paquet. La détection du MTU d’un chemin peut aussi être désactivée en utilisant l'option de socket B<IP_MTU_DISCOVER> ou le fichier I</proc/sys/net/ipv4/ip_no_pmtu_disc>, consultez B<ip>(7) pour plus de détails. Lorsque cette option est désactivée, les sockets raw fragmenteront les paquets sortants qui dépassent le MTU de l'interface. C’est cependant découragé, pour des raisons de performance et de fiabilité.

source: A raw socket can be bound to a specific local address using the B<bind>(2) call. If it isn't bound, all packets with the specified IP protocol are received. In addition, a raw socket can be bound to a specific network device using B<SO_BINDTODEVICE>; see B<socket>(7).
es: Se puede asociar un conector directo a una dirección local concreta mediante la llamada B<bind>(2). Si no está asociado, se recibirán todos los paquetes con el protocolo IP especificado. Además, se puede asociar un conector directo a un dispositivo de red específico usando B<SO_BINDTODEVICE>. Vea B<socket>(7).
fr: Un socket raw peut être attaché à une adresse locale spécifique en utilisant l'appel B<bind>(2). S’il n'est pas attaché, tous les paquets du protocole IP indiqué sont reçus. De plus, un socket raw peut être attaché à un périphérique réseau particulier avec B<SO_BINDTODEVICE>\ ; consultez B<socket>(7).

source: An B<IPPROTO_RAW> socket is send only. If you really want to receive all IP packets, use a B<packet>(7) socket with the B<ETH_P_IP> protocol. Note that packet sockets don't reassemble IP fragments, unlike raw sockets.
es: Un conector B<IPPROTO_RAW> es sólo de envío. Si verdaderamente quiere recibir todos los paquetes IP, use un conector B<packet>(7) con el protocolo B<ETH_P_IP>. Dése cuenta que, a diferencia de los conectores directos, los conectores de paquete no reensamblan fragmentos IP.
fr: Un socket B<IPPROTO_RAW> ne fonctionne qu'en émission. Si vous désirez vraiment recevoir tous les paquets IP, utilisez un socket B<packet>(7) avec le protocole B<ETH_P_IP>. Notez que les sockets packet ne réassemblent pas les fragments IP contrairement aux sockets raw.

source: If you want to receive all ICMP packets for a datagram socket, it is often better to use B<IP_RECVERR> on that particular socket; see B<ip>(7).
es: Si quiere recibir todos los paquetes ICMP para un conector de datagramas, normalmente es mejor usar B<IP_RECVERR> en ese conector particular. Vea B<ip>(7).
fr: Si vous voulez recevoir tous les paquets ICMP pour un socket datagram, il est souvent préférable d'utiliser B<IP_RECVERR> sur ce socket particulier, consultez B<ip>(7).

source: Raw sockets may tap all IP protocols in Linux, even protocols like ICMP or TCP which have a protocol module in the kernel. In this case, the packets are passed to both the kernel module and the raw socket(s). This should not be relied upon in portable programs, many other BSD socket implementation have limitations here.
es: Los conectores directos pueden interceptar todos los protocolos IP de Linux, incluso protocolos como ICMP o TCP que poseen un módulo de protocolo dentro del núcleo. En este caso, los paquetes se pasan tanto al módulo del núcleo como al conector (o conectores) directo. No se debería confiar en esto en programas transportables ya que muchas otras implementaciones de conectores BSD tienen limitaciones aquí.
fr: Les sockets raw peuvent exploiter tous les protocoles IP sous Linux, même les protocoles comme ICMP ou TCP qui ont un module de protocole dans le noyau. Dans ce cas, les paquets sont passés à la fois au module du noyau et au(x) socket(s) raw. Ce comportement n'est pas portable, de nombreuses autres implémentations des sockets BSD ont leurs propres limites à ce sujet.

source: Linux never changes headers passed from the user (except for filling in some zeroed fields as described for B<IP_HDRINCL>). This differs from many other implementations of raw sockets.
es: Linux nunca cambia las cabeceras pasadas por el usuario (salvo para rellenar algunos campos de valor 0 como se ha descrito en B<IP_HDRINCL>). Esto es diferente de muchas otras implementaciones de conectores directos.
fr: Linux ne modifie jamais les en-têtes fournis par l'utilisateur (sauf pour remplir les champs ne contenant que des zéros comme cela est décrit pour B<IP_HDRINCL>). Ça diffère de nombreuses autres implémentations des sockets raw.

source: Raw sockets are generally rather unportable and should be avoided in programs intended to be portable.
es: Generalmente, los conectores directos son bastante específicos y deberían evitarse en programas que pretendan ser portables.
fr: Les sockets raw sont en général peu portables et devraient être évités dans les programmes destinés à être portables.

source: Sending on raw sockets should take the IP protocol from I<sin_port>; this ability was lost in Linux 2.2. The workaround is to use B<IP_HDRINCL>.
es: En el envío a través de conectores directos se debería tomar el protocolo IP de B<sin_port>. Esta capacidad se perdió en Linux 2.2. La forma de solucionar esto es usar B<IP_HDRINCL>.
fr: L'émission sur les sockets raw devrait employer le protocole IP dans I<sin_port> ; cette possibilité a été perdue dans Linux 2.2. Une solution est d'utiliser B<IP_HDRINCL>.

source: BUGS
es: ERRORES
fr: BOGUES

source: Transparent proxy extensions are not described.
es: No se han descrito las extensiones de proxy transparente.
fr: Les extensions de mandataire transparent ne sont pas décrites.

source: When the B<IP_HDRINCL> option is set, datagrams will not be fragmented and are limited to the interface MTU.
es: Cuando se activa la opción B<IP_HDRINCL>, los datagramas no se fragmentan y están limitados por la MTU de la interfaz.
fr: Lorsque l'option B<IP_HDRINCL> est active, les datagrammes ne seront pas fragmentés et sont limités au MTU de l'interface.

source: Setting the IP protocol for sending in I<sin_port> got lost in Linux 2.2. The protocol that the socket was bound to or that was specified in the initial B<socket>(2) call is always used.
es: La posibilidad de especificar el protocolo IP en I<sin_port> durante el envío desapareció en Linux 2.2. Siempre se usa el protocolo al que se enlazó el conector o el que se especificó en la llamada inicial a B<socket>(2).
fr: Utiliser le protocole IP indiqué dans I<sin_port> en émission a été supprimé dans Linux 2.2. Le protocole auquel le socket a été lié ou celui indiqué dans l'appel B<socket>(2) initial est toujours utilisé.

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI

source: B<RFC\ 1191> for path MTU discovery. B<RFC\ 791> and the I<E<lt>linux/ip.hE<gt>> header file for the IP protocol.
es: B<RFC\ 1191> para el descubrimiento del MTU de la ruta. B<RFC\ 791> y el fichero cabecera I<E<lt>linux/ip.hE<gt>> para el protocolo IP.
fr: B<RFC\ 1191> pour la recherche du MTU de chemin. B<RFC\ 791> et le fichier d'en-tête I<E<lt>linux/ip.hE<gt>> pour le protocole IP.

source: Linux Programmer's Manual
es: Manual del Programador de Linux
fr: Manuel du programmeur Linux

source: COLOPHON
es: COLOFÓN
