Repository: sebras/manpages-l10n
Catalog: po/*/man7/standards.7.po
Languages: es, it

source: STANDARDS
es: ESTÁNDARES

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: NAME
es: NOMBRE
it: NOME

source: standards - C and UNIX Standards
es: estándares - Estándares de C y UNIX
it: standards - Standard C e UNIX

source: DESCRIPTION
es: DESCRIPCIÓN
it: DESCRIZIONE

source: The STANDARDS section that appears in many manual pages identifies various standards to which the documented interface conforms. The following list briefly describes these standards.
es: la sección 'CONFORME A' está incluida en muchas página de manual para indicar los diversos estándares a los que se adhieren las interfaces en ellas documentadas. Esta lista da una breve descripción de ellos.

source: Version 7 (also known as Seventh Edition) UNIX, released by AT&T/Bell Labs in 1979. After this point, UNIX systems diverged into two main dialects: BSD and System V.
es: Versión 7 de UNIX, también conocida como Séptima Edición. Fue publicada por AT&T/Bell en 1979. Después de esto, los sistemas UNIX divergieron en dos variantes principales: BSD y System V.
it: Versione 7 (noto anche come Seventh Edition) UNIX, rilasciata da AT&T/Bell Labs nel 1979. Da questo punto in poi, i sistemi UNIX si ramificarono in due dialetti principali: BSD e System V.

source: This is an implementation standard defined by the 4.2 release of the I<Berkeley Software Distribution>, released by the University of California at Berkeley. This was the first Berkeley release that contained a TCP/IP stack and the sockets API. 4.2BSD was released in 1983.
es: Se refiere a una implementación estándar definida por la versión 4.2 de I<Berkeley Software Distribution> publicada por la Universidad de California en Berkley. Fue la primera versión que contenía una pila TCP/IP y la API de los conectores. 4.2BSD fue publicada en 1983.
it: Questa è un'implementazione standard definita dal rilascio 4.2 della I<Berkeley Software Distribution>, rilasciata dalla University of California a Berkeley. Questo è stato il primo rilascio della Berkeley a contenere uno stack TCP/IP e le API dei socket. La 4.2BSD è stata rilasciata nel 1983.

source: Earlier major BSD releases included I<3BSD> (1980), I<4BSD> (1980), and I<4.1BSD> (1981).
es: Otras versiones anteriores de BSD fueron: I<3BSD> (1980), I<4BSD> (1980) y I<4.1BSD> (1981).
it: I principali rilasci precedenti di BSD inclusero I<3BSD> (1980), I<4BSD> (1980), e I<4.1BSD> (1981).

source: The successor to 4.2BSD, released in 1986.
es: El sucesor de 4.2BSD, publicado en 1986.
it: Il successore della 4.2BSD, rilasciato nel 1986.

source: The successor to 4.3BSD, released in 1993. This was the last major Berkeley release.
es: El sucesor de 4.3BSD, publicado en 1993. Fue la última versión principal de Berkeley.
it: Il successore della 4.3BSD, rilasciato nel 1993. Questo è stato l'ultimo rilascio principale della Berkeley.

source: This is an implementation standard defined by AT&T's milestone 1983 release of its commercial System V (five) release. The previous major AT&T release was I<System III>, released in 1981.
es: Esta es una implementación estándar definida por la publicación en 1983 de la versión comercial de System V de AT&T. La anterior versión de AT&T fue I<System III> en 1981.
it: Questa è un'implementazione standard definita dalla AT&T con il rilascio del 1983, pietra miliare del suo rilascio commerciale System V (cinque). Il principale rilascio precedente della AT&T è stato I<System III>, rilasciato nel 1981.

source: This was the next System V release, made in 1985. The SVr2 was formally described in the I<System V Interface Definition version 1> (I<SVID 1>) published in 1985.
es: Fue la siguiente versión de System V, publicada en 1985. Este SVr2 fue descrito formalmente en I<System V Interface Definition version 1> (I<SVID 1>) publicado en 1985.
it: Questo fu il rilascio successivo di System V, uscito nel 1985. La SVr2 fu formalmente descritta in I<System V Interface Definition version 1> (I<SVID 1>) pubblicato nel 1985.

source: This was the successor to SVr2, released in 1986. This release was formally described in the I<System V Interface Definition version 2> (I<SVID 2>).
es: Sucesor de SVr2, publicado en 1986. Esta versión fue formalmente descrita en I<System V Interface Definition version 2> (I<SVID 2>).
it: Questa succedette alla SVr2, e fu rilasciata nel 1986. Questo rilascio fu formalmente descritto in I<System V Interface Definition version 2> (I<SVID 2>).

source: This was the successor to SVr3, released in 1989. This version of System V is described in the "Programmer's Reference Manual: Operating System API (Intel processors)" (Prentice-Hall 1992, ISBN 0-13-951294-2) This release was formally described in the I<System V Interface Definition version 3> (I<SVID 3>), and is considered the definitive System V release.
es: Sucesor de SVr3 publicado en 1989. Esta versión de System V se describe en "Programmer's Reference Manual: Operating System API (Intel processors)" (Prentice-Hall 1992, ISBN 0-13-951294-2). Esta versión se describe formalmente en I<System V Interface Definition version 3> (I<SVID 3>). Está considerada como la versión definitiva de System V.
it: Questa succedette alla SVr3, e fu rilasciata nel 1989. Questa versione di System V è descritta nel "Programmer's Reference Manual: Operating System API (Intel processors)" (Prentice-Hall 1992, ISBN 0-13-951294-2) Questo rilascio fu formalmente descritto in I<System V Interface Definition version 3> (I<SVID 3>), ed è considerato il rilascio definitivo di System V.

source: System V Interface Definition version 4, issued in 1995. Available online at E<.UR http://www.sco.com\:/developers\:/devspecs/> E<.UE .>
es: Cuarta versión del System V Interface Definition pubicada en 1995. Disponible en E<.UR http://www.sco.com\:/developers\:/devspecs/> E<.UE .>
it: System V Interface Definition versione 4, emesso nel 1995. Disponibile online presso E<.UR http://www.sco.com\:/developers\:/devspecs/> E<.UE .>

source: This was the first C language standard, ratified by ANSI (American National Standards Institute) in 1989 (I<X3.159-1989>). Sometimes this is known as I<ANSI C>, but since C99 is also an ANSI standard, this term is ambiguous. This standard was also ratified by ISO (International Standards Organization) in 1990 (I<ISO/IEC 9899:1990>), and is thus occasionally referred to as I<ISO C90>.
es: Primer estándar del lenguaje C ratificado por el ANSI (American National Standards Institute) en 1989 (I<X3.159-1989>). A veces recibe la denominación de I<ANSI C> aunque es ambigua porque C99 también es un estándar ANSI. La ISO también ratificó este estándar en 1990 (I<ISO/IEC 9899:1990>) de ahí que a veces se denomine I<ISO C90>.
it: Questo fu il primo linguaggio C standard, ratificato da ANSI (American National Standards Institute) nel 1989 (I<X3.159-1989>). Talvolta esso è noto come I<ANSI C>, ma, poiché a partire da C99 è anche uno standard ANSI, questo termine è ambiguo. Questo standard fu anche ratificato da ISO (International Standards Organization) nel 1990 (I<ISO/IEC 9899:1990>), e quindi occasionalmente si fa riferimento a esso come I<ISO C90>.

source: This revision of the C language standard was ratified by ISO in 1999 (I<ISO/IEC 9899:1999>). Available online at E<.UR http://www.open-std.org\:/jtc1\:/sc22\:/wg14\:/www\:/standards> E<.UE .>
es: Esta versión del lenguaje C fue ratificada por la ISO en 1999 (I<ISO/IEC 9899:1999>). Disponible en E<.UR http://www.open-std.org\:/jtc1\:/sc22\:/wg14\:/www\:/standards> E<.UE .>
it: Questa revisione del linguaggio C standard fu ratificata da ISO nel 1999 (I<ISO/IEC 9899:1999>). È disponibile online presso E<.UR http://www.open-std.org\:/jtc1\:/sc22\:/wg14\:/www\:/standards> E<.UE .>

source: This revision of the C language standard was ratified by ISO in 2011 (I<ISO/IEC 9899:2011>).
es: Esta versión del estándar del lenguaje C fue ratificada por la ISO en 2011 (I<ISO/IEC 9899:2011>).
it: Questa revisione del linguaggio C standard fu ratificata da ISO nel 2011 (I<ISO/IEC 9899:2011>).

source: B<LFS> The Large File Summit specification, completed in 1996. This specification defined mechanisms that allowed 32-bit systems to support the use of large files (i.e., 64-bit file offsets). See E<.UR https://www.opengroup.org\:/platform\:/lfs.html> E<.UE .>
es: En 1996 tuvo lugar la Cumbre para las Especificaciones de Archivos Grande (B<LFS> por sus siglas en inglés). En ella se definieron mecanismos para que sistemas de 32 bits pudiesen emplear archivos grandes (p.ej: desplazamientos de archivos de 64 bites). Consulte E<.UR https://www.opengroup.org\:/platform\:/lfs.html> E<.UE .>
it: B<LFS> La specifica del Large File Summit, completata nel 1996. Questa specifica ha definito i meccanismi che consentono ai sistemi a 32 bit di supportare l'uso di file di grandi dimensioni (cioè offset a 64 bit). Si veda E<.UR https://www.opengroup.org\:/platform\:/lfs.html> E<.UE .>

source: This was the first POSIX standard, ratified by IEEE as IEEE Std 1003.1-1988, and subsequently adopted (with minor revisions) as an ISO standard in 1990. The term "POSIX" was coined by Richard Stallman.
es: Primer estándar POSIX, ratificado por la IEEE con el nombre 'IEEE Std 1003.1-1988' y posteriormente adoptado (con pequeñas modificaciones) como un estándar ISO en 1990. El término 'POSIX' fue acuñado por Richard Stallman.
it: Questo è stato il primo standard POSIX, ratificato dall'IEEE come IEEE Std 1003.1-1988, e successivamente adottato (con revisioni minori) come standard ISO nel 1990. Il termine "POSIX" fu coniato da Richard Stallman.

source: "Portable Operating System Interface for Computing Environments". IEEE 1003.1-1990 part 1, ratified by ISO in 1990 (I<ISO/IEC 9945-1:1990>).
es: Portable Operating System Interface for Computing Environments". IEEE 1003.1-1990 part 1, ratificado por la ISO en 1990 (I<ISO/IEC 9945-1:1990>).
it: "Portable Operating System Interface for Computing Environments". IEEE 1003.1-1990 parte 1, ratificato da ISO nel 1990 (I<ISO/IEC 9945-1:1990>).

source: IEEE Std 1003.2-1992, describing commands and utilities, ratified by ISO in 1993 (I<ISO/IEC 9945-2:1993>).
es: IEEE Std 1003.2-1992, describe órdenes y utlidades. Ratificado por la ISO en 1993 (I<ISO/IEC 9945-2:1993>).
it: IEEE Std 1003.2-1992, che descrive comandi e utilità, ratificato da ISO nel 1993 (I<ISO/IEC 9945-2:1993>).

source: B<POSIX.1b> (formerly known as I<POSIX.4>)
es: B<POSIX.1b> (anteriormente conocido como I<POSIX.4>)
it: B<POSIX.1b> (precedentemente conosciuto come I<POSIX.4>)

source: IEEE Std 1003.1b-1993, describing real-time facilities for portable operating systems, ratified by ISO in 1996 (I<ISO/IEC 9945-1:1996>).
es: IEEE Std 1003.1b-1993, describe servicios en tiempo real para sistemas operativos portables, ratificado por la ISO en 1996 (I<ISO/IEC 9945-1:1996>).
it: IEEE Std 1003.1b-1993, che descrive i servizi real-time per sistemi operativi portabili, ratificato da ISO nel 1996 (I<ISO/IEC 9945-1:1996>).

source: B<POSIX.1c (formerly known as >I<POSIX.4a>B<)>
es: B<POSIX.1c (anteriormente conocido como >I<POSIX.4a>B<)>
it: B<POSIX.1c (precedentemente conosciuto come>I<POSIX.4a>B<)>

source: IEEE Std 1003.1c-1995, which describes the POSIX threads interfaces.
es: IEEE Std 1003.1c-1995 que describe las interfaces de subprocesos POSIX.
it: IEEE Std 1003.1c-1995, che descrive le interfacce thread POSIX.

source: IEEE Std 1003.1d-1999, which describes additional real-time extensions.
es: IEEE Std 1003.1c-1999, que describe extensiones auxiliares de tiempo real.

source: IEEE Std 1003.1g-2000, which describes networking APIs (including sockets).
es: IEEE Std 1003.1g-2000, que describe API de red (incluidos los conectores).
it: IEEE Std 1003.1g-2000, che descrive le API di rete (inclusi i socket).

source: IEEE Std 1003.1j-2000, which describes advanced real-time extensions.
es: IEEE Std 1003.1j-2000, que describe extensiones avanzadas de tiempo real.
it: IEEE Std 1003.1j-2000, che descrive estensioni real-time avanzate.

source: A 1996 revision of POSIX.1 which incorporated POSIX.1b and POSIX.1c.
es: Revisión de POSIX de 1996 que incluye POSIX.1b y POSIX.1c.
it: Una revisione del 1996 di POSIX.1 che incorpora POSIX.1b e POSIX.1c.

source: Released in 1989, this was the first release of the X/Open Portability Guide to be based on a POSIX standard (POSIX.1-1988). This multivolume guide was developed by the X/Open Group, a multivendor consortium.
es: Publicado en 1989. Fue la primera verisón de la Guía de Portabilidad de X/Open basada en el estándar POSIX (POSIX.1-1988). Esta guía consta de varios tomos y fue publicada por el X/Open Group un consorcio participado por múltiples empresas.
it: Rilasciato nel 1989, questo fu il primo rilascio della guida I<X/Open Portability Guide> ad essere basata su uno standard POSIX (POSIX.1-1988). Questa guida a più volumi sviluppata da X/Open Group, un consorzio di aziende produttrici.

source: A revision of the X/Open Portability Guide, released in 1992. This revision incorporated POSIX.2.
es: Revisión de la Guía de Portabilidad de X/Open publicada en 1992. incorpora POSIX.2.
it: Una revisione della X/Open Portability Guide, rilasciata nel 1992. Questa revisione ha incorporato POSIX.2.

source: A 1994 revision of XPG4. This is also referred to as I<Spec 1170>, where 1170 referred to the number of interfaces defined by this standard.
es: Revisón de XPG4 publicada en 1994. También se suele llamar I<Spec 1170> donde 1170 se refiere a la cantidad de interfaces definidas por ese estándar.
it: Una revisione del 1994 di XPG4. Ad essa si fa anche riferimento come I<Spec 1170>, dove 1170 si riferisce al numero di interfacce definite da questo standard.

source: Single UNIX Specification. This was a repackaging of XPG4v2 and other X/Open standards (X/Open Curses Issue 4 version 2, X/Open Networking Service (XNS) Issue 4). Systems conforming to this standard can be branded I<UNIX 95>.
es: Especificación unificada de UNIX, en ella están agrupados XPG4v2 y otros Estándares Abiertos (X/Open Curses Issue 4 versión 2, X/Open Networking Service (XNS) Issue 4). Los sistemas que cumplen este estándar pueden denominarse I<UNIX 95>.
it: Single UNIX Specification. Questo è un ripacchettamento di XPG4v2 e altri standard X/Open (X/Open Curses Issue 4 versione 2, X/Open Networking Service (XNS) Issue 4). I sistemi conformi a questo standard possono essere marcati I<UNIX 95>.

source: Single UNIX Specification version 2. Sometimes also referred to (incorrectly) as I<XPG5>. This standard appeared in 1997. Systems conforming to this standard can be branded I<UNIX 98>. See also E<.UR http://www.unix.org\:/version2/> E<.UE .)>
es: Versión 2 de la Especificación Unificada de UNIX. Algunas veces se denomina de forma incorrect I<XPG5>. Fue publicada den 1997, los sistemas que cumplen este estándar pueden denominarse I<UNIX 98>. Consulte E<.UR http://www.unix.org\:/version2/> E<.UE .)>
it: Single UNIX Specification versione 2. Talvolta chiamata anche (erroneamente) I<XPG5>. Questo standard apparve nel 1997. I sistemi conformi a questo standard possono essere marcati I<UNIX 98>. Vedere anche E<.UR http://www.unix.org\:/version2/> E<.UE .)>

source: This was a 2001 revision and consolidation of the POSIX.1, POSIX.2, and SUS standards into a single document, conducted under the auspices of the Austin Group E<.UR http://www.opengroup.org\:/austin/> E<.UE .> The standard is available online at E<.UR http://www.unix.org\:/version3/> E<.UE .>
es: Publicado en el año 2001, fue una revisión y consolidación de los estándares POSIX.1, POSIX.2 y SUS bajo un único documento redactado bajo la supervisión del Austin Group E<.UR http://www.opengroup.org\:/austin/> E<.UE .>. Puede consultarse en la red: E<.UR http://www.unix.org\:/version3/> E<.UE .>
it: Questa fu una revisione e consolidamento del 2001 degli standard POSIX.1, POSIX.2 e SUS in un singolo documento, condotta sotto gli auspici del gruppo Austin E<.UR http://www.opengroup.org\:/austin/> E<.UE>. Lo standard è disponibile online all'indirizzo E<.UR http://www.unix.org\:/version3/> E<.UE .>.

source: The standard defines two levels of conformance: I<POSIX conformance>, which is a baseline set of interfaces required of a conforming system; and I<XSI Conformance>, which additionally mandates a set of interfaces (the "XSI extension") which are only optional for POSIX conformance. XSI-conformant systems can be branded I<UNIX 03>.
es: El estándar define dos niveles de conformidad: I<Conforme POSIX> que incluye un conjunto básico de interfaces requeridas en un sistema que lo cumpla y I<Conforme XSI> que incluye un conjunto de interfaces (las 'extensiones XSI') que son opcionales en la conformidad POSIX. Los sistemas conformes a XSI pueden denominarse I<UNIX 03>.
it: Lo standard definisce due livelli di conformità: I<POSIX conformance>, che è l'insieme di interfacce basilari necessarie per un sistema conforme; e I<XSI Conformance>, che in aggiunta impone una serie di interfacce (le "XSI extension") che sono solo opzionali per la conformità POSIX. I sistemi conformi XSI possono essere marcati I<UNIX 03>.

source: The POSIX.1-2001 document is broken into four parts:
es: El documento POSIX.1-2001 se divide en cuatro partes:
it: Il documento POSIX.1-2001 è diviso in quattro parti:

source: B<XBD>: Definitions, terms, and concepts, header file specifications.
es: B<XBD>: definiciones, términos, conceptos y especificaciones de archivos de encabezado.
it: B<XBD>: Definizioni, termini e concetti, specifiche dei file header.

source: B<XSH>: Specifications of functions (i.e., system calls and library functions in actual implementations).
es: B<XSH>: especificaciones de funciones como llamadas del sistema y biblioteca de funciones en las implementaciones actuales.
it: B<XSH>: Specifiche delle funzioni (cioè chiamate di sistema e funzioni di libreria nelle implementazioni reali).

source: B<XCU>: Specifications of commands and utilities (i.e., the area formerly described by POSIX.2).
es: B<XCU>: especificaciones de órdenes y utilidades, esto es, el área descrita formalmente por POSIX.2
it: B<XCU>: Specifiche di comandi e utilità (cioè l'area un tempo descritta da POSIX.2).

source: B<XRAT>: Informative text on the other parts of the standard.
es: B<XRAT>: información sobre las otras partes del estándar.
it: B<XRAT>: Testo informativo sulle altre parti dello standard.

source: POSIX.1-2001 is aligned with C99, so that all of the library functions standardized in C99 are also standardized in POSIX.1-2001.
es: POSIX.1-2001 sigue la misma línea que C99 por lo que las funciones de las bibliotecas estandarizadas en C99 también lo están en POSIX.1-2001.
it: POSIX.1-2001 è allineato con C99, in questo modo tutte le funzioni di libreria standardizzate in C99 sono anche standardizzate in POSIX.1-2001.

source: The Single UNIX Specification version 3 (SUSv3) comprises the Base Specifications containing XBD, XSH, XCU, and XRAT as above, plus X/Open Curses Issue 4 version 2 as an extra volume that is not in POSIX.1-2001.
es: La tercera versión de la Especificación Unificada de UNIX (SUSv3)contiene las especificaciones básicas XBD, XSH, XCU y XRAT como el anterior además también contiene X/open Curses Issue 4 versión 2 como un extra no incluido en POSIX.1-2001.
it: La Single UNIX Specification versione 3 (SUSv3) comprende le Base Specifications che contengono XBD, XSH, XCU e XRAT come precedentemente descritto, più X/Open Curses Issue 4 versione 2 come volume extra che non è in POSIX.1-2001.

source: Two Technical Corrigenda (minor fixes and improvements) of the original 2001 standard have occurred: TC1 in 2003 and TC2 in 2004.
es: Se publicaron dos correcciones técnicas (pequeños arreglos y mejoras) respeto del original de 2001: TC1 en 2003 y TC2 en 2004.
it: Ci sono stati due Technical Corrigenda (piccole correzioni e miglioramenti) dello standard originale del 2001: TC1 nel 2003, e TC2 nel 2004.

source: Work on the next revision of POSIX.1/SUS was completed and ratified in 2008. The standard is available online at E<.UR http://www.unix.org\:/version4/> E<.UE .>
es: La redacción de una nueva revisión de POSIX.1/SUS se completó y ratificó en 2008. El estándar está disponible en E<.UR http://www.unix.org\:/version4/> E<.UE .>
it: I lavori sulla prossima revisione di POSIX.1/SUS sono stati completati e ratificati nel 2008. Lo standard è disponibile online all'indirizzo E<.UR http://www.unix.org\:/version4/> E<.UE .>

source: The changes in this revision are not as large as those that occurred for POSIX.1-2001/SUSv3, but a number of new interfaces are added and various details of existing specifications are modified. Many of the interfaces that were optional in POSIX.1-2001 become mandatory in the 2008 revision of the standard. A few interfaces that are present in POSIX.1-2001 are marked as obsolete in POSIX.1-2008, or removed from the standard altogether.
es: En esta revisión se incluyen menos modificaciones que en el caso de POSIX.1-2001/SUSv3, aunque sí se añadieron varias interfaces nuevas y se modificaron algunas de las presentes. Muchas interfaces que eran opcionales en POSIX.1.2001 pasaron a ser obligatorias en la revisión de 2008. Unas pocas interfaces se consideraron obsoletas y se eliminaron en esta nueva revisión.
it: I cambiamenti in questa revisione non sono tanti quanti quelli verificatisi per POSIX.1-2001/SUSv3, ma sono state aggiunte molte nuove interfacce e sono stati modificati vari dettagli di specifiche esistenti. Molte interfacce che in POSIX.1-2001 erano opzionali diventano obbligatorie nella revisione 2008 dello standard. Alcune interfacce presenti in POSIX.1-2001 sono marcate come obsolete in POSIX.1-2008, o rimosse del tutto dallo standard.

source: The revised standard is structured in the same way as its predecessor. The Single UNIX Specification version 4 (SUSv4) comprises the Base Specifications containing XBD, XSH, XCU, and XRAT, plus X/Open Curses Issue 7 as an extra volume that is not in POSIX.1-2008.
es: La revisión del estándar está estructurada del mismo modo que su predecesor. La versión 4 de la Especificación Unificada de UNIX (SUSv4) incluye las especificaciones básicas XBD, XSH, XCU y XRAT. También incluye X/Open Curses Issue 7 como un volumen extra que no está incluido en POSIX.1-2008.
it: Lo standard rivisto è strutturato nello stesso modo del predecessore. La Single UNIX Specification versione 3 (SUSv3) comprende le Base Specifications che contengono XBD, XSH, XCU e XRAT, più X/Open Curses Issue 4 versione 2 come volume extra che non è in POSIX.1-2001.

source: Again there are two levels of conformance: the baseline I<POSIX Conformance>, and I<XSI Conformance>, which mandates an additional set of interfaces beyond those in the base specification.
es: De nuevo, existen dos niveles de conformidad: la básica I<Conformidad POSIX> y I<Conformidad XSI> que añade un conjunto adicional de interfaces respecto a la especificación básica.
it: Anche in questo caso ci sono due livelli di conformità: la linea di fondo I<POSIX Conformance>, e I<XSI Conformance>, che rende obbligatorio un insieme di interfacce aggiuntive oltre a quelle delle specifiche di base.

source: In general, where the STANDARDS section of a manual page lists POSIX.1-2001, it can be assumed that the interface also conforms to POSIX.1-2008, unless otherwise noted.
es: En general, si la sección 'CONFORME A' de una página de manual cita a POSIX.1-2001, se podrá asumir que también es conforme a POSIX.1-2008 salvo que se indique lo contrario.
