Repository: sebras/manpages-l10n
Catalog: po/*/man7/standards.7.po
Languages: es, it

source: Technical Corrigendum 1 (minor fixes and improvements) of this standard was released in 2013.
es: Corrección técnica 1 (pequeños arreglos y mejoras) de este estándar se publicó en el año 2013.
it: L'errata-corrige ("Technical Corrigendum 1") di questo standard (correzioni minori e miglioramenti) è stato rilasciata nel 2013.

source: Technical Corrigendum 2 of this standard was released in 2016.
es: Corrección técnica 2 de este estándar se publicó en el año 2016.
it: L'errata-corrige ("Technical Corrigendum 2") di questo standard è stata rilasciata nel 2016.

source: Further information can be found on the Austin Group web site, E<.UR http://www.opengroup.org\:/austin/> E<.UE .>
es: Tiene más información en la web del Austin Group: E<.UR http://www.opengroup.org\:/austin/> E<.UE .>
it: Si possono trovare ulteriori informazioni nel sito web del gruppo di Austin, E<.UR http://www.opengroup.org\:/austin/> E<.UE .>

source: This is equivalent to POSIX.1-2008, with the addition of Technical Corrigenda 1 and 2 and the XCurses specification.
es: Equivale a POSIX.1-2008 añadiéndole las Correciones Técnicas 1 y 2 así como la especificación de XCurses.
it: È equivalente a POSIX.1-2008, con l'aggiunta di Technical Corrigenda 1 e 2 e le specifiche XCurses.

source: This revision of POSIX is technically identical to POSIX.1-2008 with Technical Corrigenda 1 and 2 applied.
es: Esta revisión de POSIC es técnicamente idéntica a POSIX.1-2008 incluyendo las Correciones Técnicas 1 y 2.
it: Questa resivsione di POSIX è tecnicamente identica a POSIX.1-2008 con l'aggiunta di Technical Corrigenda 1 e 2.

source: This is equivalent to POSIX.1-2017, with the addition of the XCurses specification.
es: Equivale a POSIX-1.2017 añadiendo la especificación de XCurses.
it: È equivalente a POSIX.1-2017, con l'aggiunta delle specifiche XCurses.

source: The interfaces documented in POSIX.1/SUS are available as manual pages under sections 0p (header files), 1p (commands), and 3p (functions); thus one can write "man 3p open".
es: Las interfaces documentadas en POSIX.1/SUS están disponibles en formato de página de manual en las secciones 0p (archivos de encabezado), 1p (órdenes) y 3p (funciones). Por ejemplo, para ver la página de la función 'open' ejecutaría 'man 3p open'.
it: Le interfacce documentate in POSIX.1/SUS sono disponibili come pagine di manuale alla sezione 0p(file di intestazione), 1p (comandi) e 3p (funzioni); perciò uno può scrivere "man 3p open".

source: SEE ALSO
es: VÉASE TAMBIÉN
it: VEDERE ANCHE

source: Linux Programmer's Manual
es: Manual del Programador de Linux
it: Manuale del programmatore di Linux

source: The CONFORMING TO section that appears in many manual pages identifies various standards to which the documented interface conforms. The following list briefly describes these standards.
es: la sección 'CONFORME A' está incluida en muchas página de manual para indicar los diversos estándares a los que se adhieren las interfaces en ellas documentadas. Esta lista da una breve descripción de ellos.
it: La sezione "CONFORME A" che appare in molte pagine di manuale identifica vari standard a cui si conformano le interfacce documentate. L'elenco seguente descrive brevemente questi standard.

source: IEEE Std 1003.1c-1999, which describes additional real-time extensions.
es: IEEE Std 1003.1c-1999, que describe extensiones auxiliares de tiempo real.
it: IEEE Std 1003.1c-1999, che descrive estensioni real-time aggiuntive.

source: B<XBD>: Definitions, terms and concepts, header file specifications.
es: B<XBD>: definiciones, términos y conceptos. Especificaciones de los archivos de encabezado.
it: B<XBD>: Definizioni, termini e concetti, specifiche dei file header.

source: In general, where the CONFORMING TO section of a manual page lists POSIX.1-2001, it can be assumed that the interface also conforms to POSIX.1-2008, unless otherwise noted.
es: En general, si la sección 'CONFORME A' de una página de manual cita a POSIX.1-2001, se podrá asumir que también es conforme a POSIX.1-2008 salvo que se indique lo contrario.
it: In generale, quando la sezione CONFORME A di una pagina di manuale elenca POSIX.1-2001, si può assumere che l'interfaccia sia conforme anche a POSIX.1-2008, a meno che non sia indicato diversamente.

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: "Portable Operating System Interface for Computing Environments". IEEE 1003.1-1990 part 1, ratified by ISO in 1990 (I<ISO/IEC 9945-1:1990>). The term "POSIX" was coined by Richard Stallman.
es: "Interfaz de Sistemas Operativos Portables para Entornos de Computación". IEEE 1003.1-1990 parte 1 fue ratificado por la ISO en 1990 (I<ISO/IEC 9945-1:1990>). El término 'POSIX' fue acuñado por Richard Stallman
it: "Portable Operating System Interface for Computing Environments". IEEE 1003.1-1990 parte 1, ratificato da ISO nel 1990 (I<ISO/IEC 9945-1:1990>). Il termine "POSIX" è stato coniato da Richard Stallman.

source: Released in 1989, this was the first significant release of the I<X/Open Portability Guide>, produced by the X/Open Company, a multivendor consortium. This multivolume guide was based on the POSIX standards.
es: Publicada en 1989, fue la primera publicación significativa del I<X/Open Portability Guide> redactada por el consorcio X/Open que engloba diversas empresas. Esta guía está basada en los estándares POSIX.
it: Rilasciato nel 1989, questo fu il primo rilascio significativo della guida I<X/Open Portability Guide>, prodotta da X/Open Company, un consorzio di aziende produttrici. Questa guida a più volumi si basò sugli standard POSIX.

source: A revision of the X/Open Portability Guide, released in 1992.
es: Revisión de la Guía de Posrtabilidad de X/Open publicada en 1992.
it: Una revisione della X/Open Portability Guide, rilasciata nel 1992.

source: Single UNIX Specification version 2. Sometimes also referred to as I<XPG5>. This standard appeared in 1997. Systems conforming to this standard can be branded I<UNIX 98>. See also E<.UR http://www.UNIX-systems.org\:/version2/> E<.UE .)>
es: Segunda versión de la Especificación Unificada de UNIX. Algunas veces se la denomina I<XPG5>. Fue publicada en el año 1997 y los sistemas conformes a ella pueden denominarse I<UNIX 98>. Consulte E<.UR http://www.UNIX-systems.org\:/version2/> E<.UE .)>
it: Single UNIX Specification versione 2. Talvolta chiamata anche I<XPG5>. Questo standard apparve nel 1997. I sistemi conformi a questo standard possono essere marcati I<UNIX 98>. Vedere anche E<.UR http://www.UNIX-systems.org\:/version2/> E<.UE .)>

source: This was a 2001 revision and consolidation of the POSIX.1, POSIX.2, and SUS standards into a single document, conducted under the auspices of the Austin Group E<.UR http://www.opengroup.org\:/austin/> E<.UE .> The standard is available online at E<.UR http://www.unix-systems.org\:/version3/> E<.UE ,> and the interfaces that it describes are also available in the Linux manual pages package under sections 1p and 3p (e.g., "man 3p open").
es: Publicado en el año 2001, fue una revisión y consolidación de los estándares POSIX.1, POSIX.2 y SUS bajo un único documento redactado bajo la supervisión del Austin Group E<.UR http://www.opengroup.org\:/austin/> E<.UE .>. Puede consultarse en la red: E<.UR http://www.unix.org\:/version3/> E<.UE .>, las interfaces que describe también están disponibles en formato de página de manual en las secciones 1p y 3p.
it: Questa fu una revisione e consolidamento del 2001 degli standard POSIX.1, POSIX.2 e SUS in un singolo documento, condotta sotto gli auspici del gruppo Austin E<.UR http://www.opengroup.org\:/austin/> E<.UE>. Lo standard è disponibile online all'indirizzo E<.UR http://www.unix-systems.org\:/version3/> E<.UE>, e le interfacce che descrive sono disponibili anche nel pacchetto di pagine di manuale di Linux nelle sezioni 1p e 3p (per esempio "man 3p open").

source: The standard defines two levels of conformance: I<POSIX conformance>, which is a baseline set of interfaces required of a conforming system; and I<XSI Conformance>, which additionally mandates a set of interfaces (the "XSI extension") which are only optional for POSIX conformance. XSI-conformant systems can be branded I<UNIX 03>. (XSI conformance constitutes the I<Single UNIX Specification version 3> (I<SUSv3>).)
es: El estándar define dos niveles de conformidad: I<Conforme POSIX> que incluye un conjunto básico de interfaces requeridas en un sistema que lo cumpla y I<Conforme XSI> que incluye un conjunto de interfaces (las 'extensiones XSI') que son opcionales en la conformidad POSIX. Los sistemas conformes a XSI pueden denominarse I<UNIX 03>. La conformidad XSI equivale a la I<Versión 3 de la Especificación Unificada de UNIX> (I<SUSv3>).
it: Lo standard definisce due livelli di conformità: I<POSIX conformance>, che è l'insieme di interfacce basilari necessarie per un sistema conforme; e I<XSI Conformance>, che in aggiunta impone una serie di interfacce (le "XSI extension") che sono solo opzionali per la conformità POSIX. I sistemi conformi XSI possono essere marcati I<UNIX 03>. (La conformità a XSI costituisce la I<Single UNIX Specification version 3> (I<SUSv3>).)

source: Two Technical Corrigenda (minor fixes and improvements) of the original 2001 standard have occurred: TC1 in 2003 (also known as I<POSIX.1-2003>), and TC2 in 2004 (also known as I<POSIX.1-2004>).
es: Se publicaron dos Correciones Técnicas (con pequeños ajustes y mejoras) del estándar original de 200: TC1 en 2003 (también conocido como I<POSIX.1-2003> y TC2 en 2004 (también conocido como I<POSIX.1-2004>).
it: Ci sono stati due Technical Corrigenda (piccole correzioni e miglioramenti) dello standard originale del 2001: TC1 nel 2003 (chiamato anche I<POSIX.1-2003>), e TC2 nel 2004 (chiamato anche I<POSIX.1-2004>).

source: Work on the next revision of POSIX.1/SUS was completed and ratified in 2008.
es: El trabajo de la siguiente revisión de POSIX.1-SUS se terminó y ratificó en 2008.
it: I lavori sulla prossima revisione di POSIX.1/SUS sono stati completati e ratificati nel 2008.

source: The revised standard is broken into the same four parts as POSIX.1-2001, and again there are two levels of conformance: the baseline I<POSIX Conformance>, and I<XSI Conformance>, which mandates an additional set of interfaces beyond those in the base specification.
es: La revisión del estándar, al igual que POSIX.1-2001, también está dividido en cuatro partes e incluye dos niveles de conformidad: el básico I<Conformidad POSIX> y I<Conformidad XSI> que incluye un conjunto adicionales de interfaces respecto del la conformidad básica.
it: Lo standard rivisto è diviso nelle stesse quattro parti di POSIX.1-2001, e anche in questo caso ci sono due livelli di conformità: la linea di fondo I<POSIX Conformance>, e I<XSI Conformance>, che rende obbligatorio un insieme di interfacce aggiuntive oltre a quelle delle specifiche di base.

source: Technical Corrigendum 1 (minor fixes and improvements) of this standard was released in 2013 (also known as I<POSIX.1-2013>).
es: Una primera correción técnica (pequeños arreglos y mejoras) del estándar fue publicada en 2013. También conocida como I<POSIX.1-2013>.
it: L'errata-corrige ("Technical Corrigendum 1") di questo standard (correzioni minori e miglioramenti) è stato rilasciata nel 2013 (chiamata anche I<POSIX.1-2013>).

source: Technical Corrigendum 2 of this standard was released in 2016 (also known as I<POSIX.1-2016>).
es: Una segunda correción técnica del estándar fue publicada en 2016. También conocida como I<POSIX.1-2016>.
it: L'errata-corrige ("Technical Corrigendum 2") di questo standard è stata rilasciata nel 2016 (chiamata anche I<POSIX.1-2016>).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: B<SUSv4 2016 edition>
it: B<SUSv4 edizione 2016 edition>
