Repository: sebras/manpages-l10n
Catalog: po/*/man7/systemd-boot.7.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-boot, sd-boot - A simple UEFI boot manager
de: systemd-boot, sd-boot - Ein einfacher UEFI-Systemstartverwalter

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-boot> (short: B<sd-boot>) is a simple UEFI boot manager\&. It provides a textual menu to select the entry to boot and an editor for the kernel command line\&. B<systemd-boot> supports systems with UEFI firmware only\&.
de: B<systemd-boot> (kurz B<sd-boot>) ist ein einfacher UEFI-Systemstartverwalter\&. Er stellt ein textuelles Menü zur Auswahl des zu startenden Eintrags und einen Editor für die Kernelbefehlszeile zur Verfügung\&. B<systemd-boot> unterstützt nur Systeme mit UEFI-Firmware\&.

source: B<systemd-boot> loads boot entry information from the EFI system partition (ESP), usually mounted at /efi/, /boot/, or /boot/efi/ during OS runtime, as well as from the Extended Boot Loader partition if it exists (usually mounted to /boot/)\&. Configuration file fragments, kernels, initrds and other EFI images to boot generally need to reside on the ESP or the Extended Boot Loader partition\&. Linux kernels must be built with B<CONFIG_EFI_STUB> to be able to be directly executed as an EFI image\&. During boot B<systemd-boot> automatically assembles a list of boot entries from the following sources:
de: B<systemd-boot> lädt Systemstarteintragsinformationen aus der EFI-Systempartition (ESP), die zur Betriebssystemlaufzeit normalerweise unter /efi/, /boot/ oder /boot/efi/ eingehängt ist, sowie von der »Extended Boot Loader«-Partition, falls sie existiert (normalerweise unter /boot/ eingehängt)\&. Konfigurationsdateifragmente, Kernel, Initrds und andere zu startende EFI-Images müssen im Allgemeinen in der ESP oder der »Extended Boot Loader«-Partition liegen\&. Linux-Kernel müssen mit B<CONFIG_EFI_STUB> gebaut sein, damit sie direkt als EFI-Image ausgeführt werden können\&. Während des Systemstarts fügt B<systemd-boot> automatisch eine Liste von Systemstarteinträgen aus den folgenden Quellen zusammen:

source: Boot entries defined with \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 description files located in /loader/entries/ on the ESP and the Extended Boot Loader Partition\&. These usually describe Linux kernel images with associated initrd images, but alternatively may also describe arbitrary other EFI executables\&.
de: Systemstarteinträge, die in Beschreibungsdateien gemäß der \m[blue]B<Boot Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 in /loader/entries/ auf der ESP und der »Extended Boot Loader«-Partition liegen\&. Diese beschreiben normalerweise Linux-Kernel-Images mit zugehörigen Initrd-Images, können aber alternativ auch beliebige andere EFI-Programme beschreiben\&.

source: Unified kernel images following the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, as executable EFI binaries in /EFI/Linux/ on the ESP and the Extended Boot Loader Partition\&.
de: Vereinigte Kernel-Images, die der \m[blue]B<Boot Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 folgen, als ausführbare EFI-Programme in /EFI/Linux/ auf der ESP und der »Extended Boot Loader«-Partition\&.

source: The Microsoft Windows EFI boot manager, if installed
de: Der Microsoft-Windows-EFI-Systemstartverwalter, falls installiert\&.

source: The Apple macOS boot manager, if installed
de: Der Apple-macOS-Systemstartverwalter, falls installiert\&.

source: The EFI Shell binary, if installed
de: Das EFI-Shell-Programm, falls installiert\&.

source: A reboot into the UEFI firmware setup option, if supported by the firmware
de: Ein Neustart in die UEFI-Firmware-Einrichtungsoption, falls durch die Firmware unterstützt\&.

source: B<systemd-boot> supports the following features:
de: B<systemd-boot> unterstützt die folgenden Funktionalitäten:

source: Basic boot manager configuration changes (such as timeout configuration, default boot entry selection, \&...) may be made directly from the boot loader UI at boot-time, as well as during system runtime with EFI variables\&.
de: Grundlegende Änderungen an der Konfiguration des Systemstartverwalters (wie Konfiguration der Zeitüberschreitung, Vorgabe-Systemstartauswahl, …) können direkt zum Systemstartzeitpunkt von der Bedienoberfläche des Systemstartprogramms aus vorgenommen werden, sowie während der Laufzeit des Systems mit EFI-Variablen\&.

source: The boot manager integrates with the B<systemctl> command to implement features such as B<systemctl reboot --boot-loader-entry=\&...> (for rebooting into a specific boot menu entry, i\&.e\&. "reboot into Windows") and B<systemctl reboot --boot-loader-menu=\&...> (for rebooting into the boot loader menu), by implementing the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2\&. See B<systemctl>(1) for details\&.
de: Der Systemstartverwalter integriert mit dem Befehl B<systemctl>, um Funktionalitäten wie B<systemctl reboot --boot-loader-entry=…> (zum Neustart in einen bestimmten Systemstartmenüeintrag, d\&.h\&. »Neustart in Windows«) und B<systemctl reboot --boot-loader-menu=…> (zum Neustawrten in das Systemstartmenü) zu implementieren, indem die \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2 implementiert wird\&. Siehe B<systemctl>(1) für Details\&.

source: An EFI variable set by the boot loader informs the OS about the EFI System Partition used during boot\&. This is then used to automatically mount the correct EFI System Partition to /efi/ or /boot/ during OS runtime\&. See B<systemd-gpt-auto-generator>(8) for details\&.
de: Eine durch den Systemstartverwalter gesetzte EFI-Variable informiert das Betriebssystem über die während des Systemstarts verwandte EFI-System-Partition\&. Dies wird dann dazu benutzt, automatisch die korrekte EFI-System-Partition unter /efi/ oder /boot/ zur Betriebssystemlaufzeit einzuhängen\&. Siehe B<systemd-gpt-auto-generator>(8) für Details\&.

source: The boot manager provides information about the boot time spent in UEFI firmware using the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2\&. This information can be displayed using B<systemd-analyze>(1)\&.
de: Der Systemstartverwalter stellt unter Verwendung der \m[blue]B<Boot-Loader-Schnittstelle>\m[]\&\s-2\u[2]\d\s+2 Informationen über die in der UEFI-Firmware verbrachte Zeit bereit\&. Diese Information kann mittels B<systemd-analyze>(1) dargestellt werden\&.

source: The boot manager implements boot counting and automatic fallback to older, working boot entries on failure\&. See \m[blue]B<Automatic Boot Assessment>\m[]\&\s-2\u[3]\d\s+2\&.
de: Der Systemstartverwalter implementiert das Systemstartzählen und fällt bei Fehlschlägen automatisch zu älteren, funktionierenden Systemstarteinträgen zurück\&. Siehe \m[blue]B<Automatische Systemstartbeurteilung>\m[]\&\s-2\u[3]\d\s+2\&.

source: The boot manager optionally reads a random seed from the ESP partition, combines it with a \*(Aqsystem token\*(Aq stored in a persistent EFI variable and derives a random seed to use by the OS as entropy pool initialization, providing a full entropy pool during early boot\&.
de: Der Systemstartverwalter liest optional die Zufallsstartwerte aus der ESP-Partition, kombiniert sie mit einem in einer dauerhaften EFI-Variable abgelegten »Systemmerkmal« und leitet einen Zufallsstartwert ab, der vom Betriebssystem zur Initialisierung des Entropie-Fundus während der frühen Systemstartphase verwandt wird\&.

source: B<bootctl>(1) may be used from a running system to locate the ESP and the Extended Boot Loader Partition, list available entries, and install B<systemd-boot> itself\&.
de: B<bootctl>(1) kann aus dem laufenden System verwandt werden, um die ESP und die »Extended Boot Loader«-Partition zu ermitteln, verfügbare Einträge aufzulisten und B<systemd-boot> selbst zu installieren\&.

source: B<kernel-install>(8) may be used to copy kernel images onto the ESP or the Extended Boot Loader Partition and to generate description files compliant with the Boot Loader Specification\&.
de: B<kernel-install>(8) kann zum Kopieren des Kernel-Images auf die ESP oder die »Extended Boot Loader«-Partition und zur Erstellung von Beschreibungsdateien, die konform mit der Boot-Loader-Spezifikation sind, verwandt werden\&.

source: B<systemd-stub>(7) may be used as UEFI boot stub for executed kernels, which is useful to show graphical boot splashes before transitioning into the Linux world\&. It is also capable of automatically picking up auxiliary credential files (for boot parameterization) and system extension images, as companion files to the booted kernel images\&.
de: B<systemd-stub>(7) kann als UEFI-Systemstartrumpf für ausgeführte Kernel verwandt werden. Das ist nützlich, um graphische Systemstartbilder zu zeigen, bevor in die Linux-Welt übergeleitet wird\&. Es ist auch in der Lage, zusätzliche Zugangsberechtigungsdateien aufzusammeln (für die Parametrisierung des Systemstarts) und Erweiterungsabbilder für das System, wie Begleitdateien für die gestarteten Kernelabbilder\&.

source: KEY BINDINGS
de: TASTENBELEGUNGEN

source: The following keys may be used in the boot menu:
de: Im Boot-Menü können die folgenden Tasten verwandt werden:

source: ↑ (Up), ↓ (Down), j, k, PageUp, PageDown, Home, End
de: ↑ (Hoch), ↓ (Runter), j, k, SeiteHoch, SeiteRunter, Pos 1, Ende

source: Navigate up/down in the entry list
de: Die Eintragsliste hoch/runter navigieren

source: ↵ (Enter), → (Right)
de: ↵ (Eingabe), → (Rechts)

source: Boot selected entry
de: Den ausgewählten Eintrag starten

source: Make selected entry the default
de: Den ausgewählten Eintrag als Vorgabe setzen

source: Edit the kernel command line for selected entry
de: Für den ausgewählten Eintrag die Kernelbefehlszeile bearbeiten

source: Increase the timeout before default entry is booted
de: Die Zeitüberschreitung vor dem Starten des Vorgabeeintrags erhöhen

source: Decrease the timeout
de: Die Zeitüberschreitung verringern

source: Change screen resolution, skipping any unsupported modes\&.
de: Ändert die Bildschirmauflösung, überspringt nicht unterstützte Modi\&.

source: Reset screen resolution to firmware or configuration file default\&.
de: Setzt die Bildschirmauflösung auf die Vorgabe der Firmware oder der Konfigurationsdatei zurück\&.

source: Print status
de: Gibt den Status aus

source: Show a help screen
de: Zeigt einen Hilfebildschirm

source: Reboot into firmware interface\&.
de: Startet neu in die Firmware-Schnittstelle\&.

source: For compatibility with the keybindings of several firmware implementations this operation may also be reached with F2, F10, Del and Esc\&.
de: Zur Kompatibilität mit Tastaturbindungen mehrerer Firmware-Implementierungen kann diese Aktion auch mit F2, F10, Entf und Esc erreicht werden\&.

source: The following keys may be pressed during bootup or in the boot menu to directly boot a specific entry:
de: Die folgenden Tasten können während des Systemstarts oder im Startmenü gedrückt werden, um direkt einen bestimmten Eintrag zu starten:

source: Boot entry number 1 \&... 9
de: Boot-Eintrag Nummer 1 … 9

source: The boot menu is shown when a non-zero menu timeout has been configured\&. If the menu timeout has been set to zero, it is sufficient to press any key \(em before the boot loader initializes \(em to bring up the boot menu, except for the keys listed immediately above as they directly boot into the selected boot menu item\&. Note that depending on the firmware implementation the time window where key presses are accepted before the boot loader initializes might be short\&. If the window is missed, reboot and try again, possibly pressing a suitable key (e\&.g\&. the space bar) continuously; on most systems it should be possible to hit the time window after a few attempts\&. To avoid this problem, consider setting a non-zero timeout, thus showing the boot menu unconditionally\&. Some desktop environments might offer an option to directly boot into the boot menu, to avoid the problem altogether\&. Alternatively, use the command line B<systemctl reboot --boot-loader-menu=0> from the shell\&.
de: Das Boot-Menü wird angezeigt, wenn eine Zeitüberschreitung größer Null konfiguriert wurde\&. Falls die Menü-Zeitüberschreitung auf Null gesetzt wurde, reicht es aus, eine Taste zu drücken - bevor sich das Systemstartprogramm initialisiert -- um das Boot-Menü hochzubringen\&. Ausnahmen sind die direkt hierüber aufgeführten Tasten, da sie direkt in den ausgewählten Boot-Menü-Eintrag starten\&. Beachten Sie, dass das Zeitfenster, in dem Tastendrücke akzeptiert werden, bevor sich das Systemstartprogramm initialisiert, abhängig von der Firmware-Implementierung sehr kurz sein kann\&. Falls das Fenster verpasst wird, starten Sie neu und versuchen Sie es erneut, möglicherweise, indem sie eine geeignete Taste (beispielsweise die Leertaste) dauerhaft drücken: auf den meisten Systemen sollte es möglich sein, das Zeitfenster nach ein paar Versuchen zu treffen\&. Um das Problem zu vermeiden, sollten Sie darüber nachdenken, die Zeitüberschreitung auf einen Wert größer Null zu setzen, wodurch das Boot-Menü bedingungslos angezeigt wird\&. Einige Desktop-Umgebungen könnten anbieten, direkt in das Boot-Menü zu starten, um das Problem insgesamt zu vermeiden\&. Alternativ können Sie auch die Befehlszeile B<systemctl reboot --boot-loader-menu=0> auf der Shell verwenden\&.

source: In the editor, most keys simply insert themselves, but the following keys may be used to perform additional actions:
de: Im Editor fügen die meisten Tasten einfach sich selbst ein, aber die folgenden Tasten können zur Ausführung zusätzlicher Aktionen verwandt werden:

source: ← (Left), → (Right), Home, End
de: ← (Links), → (Rechts), Pos 1, Ende

source: Navigate left/right
de: Links/Rechts navigieren

source: Abort the edit and quit the editor
de: Die Bearbeitung abbrechen und den Editor beenden

source: Ctrl+k
de: Strg+k

source: Clear the command line
de: Die Befehlszeile leeren

source: Ctrl+w, Alt+Backspace
de: Strg+w, Alt+Rückschritt

source: Delete word backwards
de: Rückwärts ein Wort löschen

source: Delete word forwards
de: Vorwärts ein Wort löschen

source: ↵ (Enter)
de: ↵ (Eingabe)

source: Boot entry with the edited command line
de: Starteintrag mit der bearbeiteten Befehlszeile

source: Note that unless configured otherwise in the UEFI firmware, systemd-boot will use the US keyboard layout, so key labels might not match for keys like +/-\&.
de: Beachten Sie, dass Systemd-boot die US-Tastaturbelegung verwenden wird, falls es nicht anders konfiguriert wurde, und daher die Tastenbezeichnungen für Tasten wie +/- nicht passen könnten\&.

source: FILES
de: DATEIEN

source: The files B<systemd-boot> processes generally reside on the UEFI ESP which is usually mounted to /efi/, /boot/ or /boot/efi/ during OS runtime\&. It also processes files on the Extended Boot Loader partition which is typically mounted to /boot/, if it exists\&.
de: Die Dateien, die B<systemd-boot> verarbeitet, befinden sich im Allgemeinen auf der UEFI ESP, die normalweise während der Laufzeit des Betriebssystems auf /efi/, /boot/ oder /boot/efi/ eingehängt ist\&. Es verarbeitet auch Dateien auf der Erweiterten Systemlade-Partition, die normalerweise auf /boot/ eingehängt ist, falls sie existiert\&.

source: B<systemd-boot> reads runtime configuration such as the boot timeout and default entry from /loader/loader\&.conf on the ESP (in combination with data read from EFI variables)\&. See B<loader.conf>(5)\&.
de: B<systemd-boot> liest Laufzeitkonfiguration wie die Systemstart-Zeitüberschreitung und den Vorgabeeintrag aus /loader/loader\&.conf aus dem ESP (zusammen mit aus EFI-Variablen gelesenen Daten)\&. Siehe B<loader.conf>(5)\&.

source: Boot entry description files following the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 are read from /loader/entries/ on the ESP and the Extended Boot Loader partition\&.
de: Systemstarteintragbeschreibungsdateien, die der \m[blue]B<Boot Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 folgen, werden aus /loader/entries/ auf dem ESP und der Erweiterten Systemladepartition gelesen\&.

source: Unified kernel boot entries following the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 are read from /EFI/Linux/ on the ESP and the Extended Boot Loader partition\&.
de: Vereinigte Kernel-Einträge, die der \m[blue]B<Boot Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 folgen, werden aus /EFI/ Linux/ auf der ESP und der »Extended Boot Loader«-Partition gelesen\&.

source: Optionally, a random seed for early boot entropy pool provisioning is stored in /loader/random-seed in the ESP\&.
de: Optional wird ein Zufallsstartwert für die Bereitstellung der Entropie-Sammlung für die frühe Systemstartphase in /loader/random-seed in dem ESP gespeichert\&.

source: During initialization, B<sd-boot> automatically loads all driver files placed in the /EFI/systemd/drivers/ directory of the ESP\&. The files placed there must have an extension of the EFI architecture ID followed by \&.efi (e\&.g\&. for x86-64 this means a suffix of x64\&.efi)\&. This may be used to automatically load file system drivers and similar, to extend the native firmware support\&.
de: Während der Initialisierung lädt B<sd-boot> automatisch alle im Verzeichnis /EFI/systemd/drivers/ auf dem ESP abgelegten Treiberdateien\&. Die dort abgelegten Dateien müssen eine Erweiterung der EFI-Architekturkennung gefolgt von \&.efi haben (für x86-64 bedeutet dies beispielsweise eine Endung x64\&.efi)\&. Dies kann zum automatischen Laden von Dateisystemtreibern und ähnlichem verwandt werden, um die Unterstützung der nativen Firmware zu erweitern\&.

source: EFI VARIABLES
de: EFI-VARIABLEN

source: The following EFI variables are defined, set and read by B<systemd-boot>, under the vendor UUID "4a67b082-0a4c-41cf-b6c7-440b29bb8c4f", for communication between the boot loader and the OS:
de: Die folgenden EFI-Variablen sind definiert und werden durch B<systemd-boot> unter der Lieferanten-UUID »4a67b082-0a4c-41cf-b6c7-440b29bb8c4f« für die Kommunikation zwischen dem Boot-Loader und dem Betriebssystem gesetzt und gelesen:

source: If boot counting is enabled, contains the path to the file in whose name the boot counters are encoded\&. Set by the boot loader\&. B<systemd-bless-boot.service>(8) uses this information to mark a boot as successful as determined by the successful activation of the boot-complete\&.target target unit\&.
de: Falls Startzählung aktiviert ist, enthält dies den Pfad zu der Datei, in deren Namen die Startzähler kodiert sind\&. Wird durch den Boot-Loader gesetzt\&. B<systemd-bless-boot.service>(8) verwendet diese Informationen, um einen Systemstart als erfolgreich zu markieren, wie dies durch die erfolgreiche Aktivierung der Ziel-Unit boot-complete\&.target bestimmt wird\&.

source: The menu timeout in seconds\&. Read by the boot loader\&. I<LoaderConfigTimeout> is maintained persistently, while I<LoaderConfigTimeoutOneShot> is a one-time override which is read once (in which case it takes precedence over I<LoaderConfigTimeout>) and then removed\&. I<LoaderConfigTimeout> may be manipulated with the t/T keys, see above\&.
de: Die Menü-Zeitüberschreitung in Sekunden\&. Wird vom Boot-Loader gelesen\&. I<LoaderConfigTimeout> wird dauerhaft verwaltet, während I<LoaderConfigTimeoutOneShot> eine einmalige Außerkraftsetzung ist, die einmal gelesen wird (und in diesem Fall Vorrang vor I<LoaderConfigTimeout> hat) und dann entfernt wird\&. I<LoaderConfigTimeout> kann mit den Tasten t/T verändert werden, siehe oben\&.

source: Contains the partition UUID of the EFI System Partition the boot loader was run from\&. Set by the boot loader\&. B<systemd-gpt-auto-generator>(8) uses this information to automatically find the disk booted from, in order to discover various other partitions on the same disk automatically\&.
de: Enthält die Partitions-UUID der EFI-Systempartition, von der der Boot-Loader gestartet wurde\&. Wird vom Boot-Loader gesetzt\&. B<systemd-gpt-auto-generator>(8) verwendet diese Information, um automatisch die Platte zu finden, von der gestartet wurde, um die verschiedenen anderen Partitionen auf der gleichen Platte automatisch zu erkennen\&.

source: A list of the identifiers of all discovered boot loader entries\&. Set by the boot loader\&.
de: Eine Liste der Kennzeichner aller erkannten Boot-Loader-Einträge\&. Wird vom Boot-Loader gesetzt\&.

source: The identifier of the default boot loader entry\&. Set primarily by the OS and read by the boot loader\&. I<LoaderEntryOneShot> sets the default entry for the next boot only, while I<LoaderEntryDefault> sets it persistently for all future boots\&. B<bootctl>(1)\*(Aqs B<set-default> and B<set-oneshot> commands make use of these variables\&. The boot loader modifies I<LoaderEntryDefault> on request, when the d key is used, see above\&.
de: Der Kennzeichner des Standard-Boot-Loader-Eintrags\&. Wird primär vom Betriebssystem gesetzt und vom Boot-Loader gelesen\&. I<LoaderEntryOneShot> setzt den Vorgabeeintrag für nur den nächsten Systemstart, während I<LoaderEntryDefault> ihn dauerhaft für alle zukünftigen Systemstarts setzt\&. Die Befehle B<set-default> und B<set-oneshot> von B<bootctl>(1) verwenden diese Variablen\&. Der Boot-Loader verändert auf Anfrage I<LoaderEntryDefault>, wenn die Taste »d« gedrückt wird, siehe oben\&.

source: The identifier of the boot loader entry currently being booted\&. Set by the boot loader\&.
de: Der Kennzeichner des Boot-Loader-Eintrags, der derzeit gestartet wird\&. Wird vom Boot-Loader gesetzt\&.

source: A set of flags indicating the features the boot loader supports\&. Set by the boot loader\&. Use B<bootctl>(1) to view this data\&.
de: Eine Gruppe von Schaltern, die anzeigen, welche Funktionalitäten der Boot-Loader unterstützt\&. Wird vom Boot-Loader gesetzt\&. Verwenden Sie B<bootctl>(1), um diese Daten anzuschauen\&.

source: Brief firmware information\&. Set by the boot loader\&. Use B<bootctl>(1) to view this data\&.
de: Kurze Firmware-Information\&. Wird vom Boot-Loader gesetzt\&. Verwenden Sie B<bootctl>(1), um diese Daten anzuschauen\&.

source: The path of executable of the boot loader used for the current boot, relative to the EFI System Partition\*(Aqs root directory\&. Set by the boot loader\&. Use B<bootctl>(1) to view this data\&.
de: Der Pfad zu dem Programm des Boot-Loaders, der für den aktuellen Systemstart verwandt wurde, relativ zum Wurzelverzeichnis der EFI-Systempartition\&. Wird vom Boot-Loader gesetzt\&. Verwenden Sie B<bootctl>(1), um diese Daten anzuschauen\&.

source: Brief information about the boot loader\&. Set by the boot loader\&. Use B<bootctl>(1) to view this data\&.
de: Kurze Informationen über den Boot-Loader\&. Wird vom Boot-Loader gesetzt\&. Verwenden Sie B<bootctl>(1), um diese Daten anzuschauen\&.

source: Information about the time spent in various parts of the boot loader\&. Set by the boot loader\&. Use B<systemd-analyze>(1) to view this data\&.
de: Informationen über die in verschiedenen Teilen des Boot-Loaders verbrachte Zeit\&. Wird vom Boot-Loader gesetzt\&. Verwenden Sie B<systemd-analyze>(1), um diese Daten anzuschauen\&.
