Repository: sebras/manpages-l10n
Catalog: po/*/man7/systemd.environment-generator.7.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.environment-generator - systemd environment file generators
de: systemd.environment-generator - Systemd-Umgebungsdatei-Generatoren

source: SYNOPSIS
de: ÜBERSICHT

source: B</usr/lib/systemd/user-environment-generators/some-generator>
de: B</usr/lib/systemd/user-environment-generators/ein-Generator>

source: DESCRIPTION
de: BESCHREIBUNG

source: Generators are small executables that live in /usr/lib/systemd/system-environment-generators/ and other directories listed above\&. B<systemd>(1) will execute those binaries very early at the startup of each manager and at configuration reload time, before running the generators described in B<systemd.generator>(7) and before starting any units\&. Environment generators can override the environment that the manager exports to services and other processes\&.
de: Generatoren sind kleine Programme, die sich in /usr/lib/systemd/system-environment-generators/ und anderen oben aufgeführten Verzeichnissen befinden\&. B<systemd>(1) wird diese Programme sehr früh beim Hochfahren jedes Verwalters und zum Zeitpunkt des Neuladens der Konfiguration ausführen, bevor die in B<systemd.generator>(7) beschriebenen Generatoren ausgeführt werden und bevor irgendeine Unit gestartet wird\&. Umgebungsgeneratoren können die Umgebung, die der Verwalter an Dienste und andere Prozesse exportiert, außer Kraft setzen\&.

source: Generators are loaded from a set of paths determined during compilation, as listed above\&. System and user environment generators are loaded from directories with names ending in system-environment-generators/ and user-environment-generators/, respectively\&. Generators found in directories listed earlier override the ones with the same name in directories lower in the list\&. A symlink to /dev/null or an empty file can be used to mask a generator, thereby preventing it from running\&. Please note that the order of the two directories with the highest priority is reversed with respect to the unit load path, and generators in /run/ overwrite those in /etc/\&.
de: Generatoren werden aus einer Gruppe von Pfaden, die während der Compilierung bestimmt werden, wie diese oben aufgeführt sind, geladen\&. System- und Benutzerumgebungsgeneratoren werden aus Verzeichnissen geladen, deren Namen in system-environment-generators/ bzw\&. user-environment-generators/ enden\&. Generatoren, die in früher aufgeführten Verzeichnissen gefunden werden, setzen diejenigen außer Kraft, die mit dem gleichen Namen in Verzeichnissen weiter hinten in der Liste sind\&. Ein Symlink auf /dev/null oder eine leere Datei kann zur Ausmaskierung eines Generators verwandt werden, wodurch dessen Ausführung verhindert wird\&. Bitte beachten Sie, dass die Reihenfolge der zwei Verzeichnisse mit der höchsten Priorität in Hinblick auf den Unit-Ladepfad umgedreht ist und Generatoren in /run/ solche in /etc/ außer Kraft setzen\&.

source: After installing new generators or updating the configuration, B<systemctl daemon-reload> may be executed\&. This will re-run all generators, updating environment configuration\&. It will be used for any services that are started subsequently\&.
de: Nach der Installation neuer Generatoren oder der Aktualisierung ihrer Konfiguration kann B<systemctl daemon-reload> ausgeführt werden\&. Dies wird alle Generatoren erneut ausführen und ihre Umgebungskonfiguration aktualisieren\&. Sie wird für alle nachfolgend gestarteten Dienste verwandt\&.

source: Environment file generators are executed similarly to unit file generators described in B<systemd.generator>(7), with the following differences:
de: Umgebungsdateigeneratoren werden ähnlich wie die in B<systemd.generator>(7) beschriebenen Unit-Dateigeneratoren ausgeführt, mit den folgenden Unterschieden:

source: Generators are executed sequentially in the alphanumerical order of the final component of their name\&. The output of each generator output is immediately parsed and used to update the environment for generators that run after that\&. Thus, later generators can use and/or modify the output of earlier generators\&.
de: Generatoren werden der Reihe nach in der alphanumerischen Reihenfolge ihrer finalen Komponenten ihres Namens ausgeführt\&. Die Ausgabe jedes Generators wird sofort ausgewertet und zur Aktualisierung der Umgebung für Generatoren, die danach ausgeführt werden, verwandt\&. Daher können spätere Generatoren die Ausgabe von früheren Generatoren verwenden und/oder verändern\&.

source: Generators are run by every manager instance, their output can be different for each user\&.
de: Generatoren werden von jeder Verwalterinstanz ausgeführt, ihre Ausgabe kann für jeden Benutzer anders sein\&.

source: It is recommended to use numerical prefixes for generator names to simplify ordering\&.
de: Es wird empfohlen, Generatorennamen mit Zahlen zu beginnen, um ihre Ordnung zu vereinfachen\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&A simple generator that extends an environment variable if a directory exists in the file system>
de: B<Beispiel\ \&1.\ \&Ein einfacher Generator, der eine Umgebungsvariable erweitert, falls ein Verzeichnis im Dateisystem existiert>

source: # set the default value XDG_DATA_DIRS="${XDG_DATA_DIRS:-/usr/local/share/:/usr/share}"
de: # setzt den Vorgabewert XDG_DATA_DIRS="${XDG_DATA_DIRS:-/usr/local/share/:/usr/share}"

source: # add a directory if it exists if [[ -d /opt/foo/share ]]; then XDG_DATA_DIRS=/opt/foo/share:${XDG_DATA_DIRS} fi
de: # fügt ein Verzeichnis hinzu, falls es existiert if [[ -d /opt/foo/share ]]; then XDG_DATA_DIRS=/opt/foo/share:${XDG_DATA_DIRS} fi

source: # write our output echo XDG_DATA_DIRS=$XDG_DATA_DIRS
de: # schreibt unsere Ausgabe echo XDG_DATA_DIRS=$XDG_DATA_DIRS

source: B<Example\ \&2.\ \&A more complicated generator which reads existing configuration and mutates one variable>
de: B<Beispiel\ \&2.\ \&Ein komplizierterer Generator, der bestehende Konfiguration liest und eine Variable verändert>

source: Proof-of-concept systemd environment generator that makes sure that bin dirs are always after matching sbin dirs in the path\&. (Changes /sbin:/bin:/foo/bar to /bin:/sbin:/foo/bar\&.)
de: Konzept für einen beispielhaften Systemd-Umgebungsgenerator, der sicherstellt, dass bin-Verzeichnisse immer nach den passenden sbin-Verzeichnissen im Pfad sind\&. (Ändert /sbin:/bin:/foo/bar in /bin:/sbin:/foo/bar\&.)

source: This generator shows how to override the configuration possibly created by earlier generators\&. It would be easier to write in bash, but let\*(Aqs have it in Python just to prove that we can, and to serve as a template for more interesting generators\&.
de: Dieser Generator zeigt, wie die möglicherweise von vorhergehenden Generatoren erstellte Konfiguration außer Kraft gesetzt wird\&. In Bash-Code wäre es einfacher, wir haben es aber in Python geschrieben, um zu zeigen, dass das möglich ist und als Vorlage für noch interessantere Generatoren\&.

source: def rearrange_bin_sbin(path): """Make sure any pair of \&.../bin, \&.../sbin directories is in this order
de: def rearrange_bin_sbin(path): """Sicherstellen, dass alle Verzeichnispaare \&.../bin, \&.../sbin in dieser Reihenfolge sind

source: if __name__ == \*(Aq__main__\*(Aq: path = os\&.environ[\*(AqPATH\*(Aq] # This should be always set\&. # If it\*(Aqs not, we\*(Aqll just crash, we is OK too\&. new = rearrange_bin_sbin(path) if new != path: print(\*(AqPATH={}\*(Aq\&.format(new))
de: if __name__ == \*(Aq__main__\*(Aq: path = os\&.environ[\*(AqPATH\*(Aq] # Dies sollte immer gesetzt sein \&. # Falls nicht, stürzen wir einfach ab, wir sind auch i.O.\&. new = rearrange_bin_sbin(path) if new != path: print(\*(AqPATH={}\*(Aq\&.format(new))

source: B<Example\ \&3.\ \&Debugging a generator>
de: B<Beispiel\ \&3.\ \&Fehlersuche in einem Generator>

source: SYSTEMD_LOG_LEVEL=debug VAR_A=something VAR_B="something else" \e /usr/lib/systemd/system-environment-generators/path-to-generator
de: SYSTEMD_LOG_LEVEL=debug VAR_A=etwas VAR_B="etwas anderes" \e /usr/lib/systemd/system-environment-generators/pfad-zum-generator

source: SEE ALSO
de: SIEHE AUCH

source: B</lib/systemd/system-environment-generators/some-generator>
de: B</lib/systemd/system-environment-generators/ein-Generator>

source: Generators are small executables that live in /lib/systemd/system-environment-generators/ and other directories listed above\&. B<systemd>(1) will execute those binaries very early at the startup of each manager and at configuration reload time, before running the generators described in B<systemd.generator>(7) and before starting any units\&. Environment generators can override the environment that the manager exports to services and other processes\&.
de: Generatoren sind kleine Programme, die sich in /lib/systemd/system-environment-generators/ und anderen oben aufgeführten Verzeichnissen befinden\&. B<systemd>(1) wird diese Programme sehr früh beim Hochfahren jedes Verwalters und zum Zeitpunkt des Neuladens der Konfiguration ausführen, bevor die in B<systemd.generator>(7) beschriebenen Generatoren ausgeführt werden und bevor irgendeine Unit gestartet wird\&. Umgebungsgeneratoren können die Umgebung, die der Verwalter an Dienste und andere Prozesse exportiert, außer Kraft setzen\&.

source: SYSTEMD_LOG_LEVEL=debug VAR_A=something VAR_B="something else" \e /lib/systemd/system-environment-generators/path-to-generator
de: SYSTEMD_LOG_LEVEL=debug VAR_A=etwas VAR_B="etwas anderes" \e /lib/systemd/system-environment-generators/pfad-zum-generator

source: if __name__ == \*(Aq__main__\*(Aq: path = os\&.environ[\*(AqPATH\*(Aq] # This should be always set\&. # If it\*(Aqs not, we\*(Aqll just crash, which is OK too\&. new = rearrange_bin_sbin(path) if new != path: print(\*(AqPATH={}\*(Aq\&.format(new))
de: if __name__ == \*(Aq__main__\*(Aq: path = os\&.environ[\*(AqPATH\*(Aq] # Dies sollte immer gesetzt sein \&. # Falls nicht, stürzen wir einfach ab, was auch i.O. ist\&. new = rearrange_bin_sbin(path) if new != path: print(\*(AqPATH={}\*(Aq\&.format(new))

source: Generators are loaded from a set of paths determined during compilation, as listed above\&. System and user environment generators are loaded from directories with names ending in system-environment-generators/ and user-environment-generators/, respectively\&. Generators found in directories listed earlier override the ones with the same name in directories lower in the list\&. A symlink to /dev/null or an empty file can be used to mask a generator, thereby preventing it from running\&. Please note that the order of the two directories with the highest priority is reversed with respect to the unit load path, and generators in /run overwrite those in /etc\&.
de: Generatoren werden aus einer Gruppe von Pfaden, die während der Compilierung bestimmt werden, wie diese oben aufgeführt sind, geladen\&. System- und Benutzerumgebungsgeneratoren werden aus Verzeichnissen geladen, deren Namen in system-environment-generators/ bzw\&. user-environment-generators/ enden\&. Generatoren, die in früher aufgeführten Verzeichnissen gefunden werden, setzen diejenigen außer Kraft, die mit dem gleichen Namen in Verzeichnissen weiter hinten in der Liste sind\&. Ein Symlink auf /dev/null oder eine leere Datei kann zur Ausmaskierung eines Generators verwandt werden, wodurch dessen Ausführung verhindert wird\&. Bitte beachten Sie, dass die Reihenfolge der zwei Verzeichnisse mit der höchsten Priorität in Hinblick auf den Unit-Ladepfad umgedreht ist und Generatoren in /run solche in /etc außer Kraft setzen\&.
