Repository: sebras/manpages-l10n
Catalog: po/*/man7/systemd.generator.7.po
Languages: de

source: Each generator is called with three directory paths that are to be used for generator output\&. In these three directories, generators may dynamically generate unit files (regular ones, instances, as well as templates), unit file \&.d/ drop-ins, and create symbolic links to unit files to add additional dependencies, create aliases, or instantiate existing templates\&. Those directories are included in the unit load path of B<systemd>(1), allowing generated configuration to extend or override existing definitions\&.
de: Jeder Generator wird mit drei Verzeichnispfaden, die für die Ausgabe der Generatoren verwandt werden, aufgerufen\&. In diesen drei Verzeichnissen dürfen Generatoren Unit-Dateien (reguläre, Instanzen sowie Vorlagen) und für \&.d-Verzeichnisse für Unit-Ergänzungsdateien erstellen und symbolische Links auf Unit-Dateien erstellen, um zusätzliche Abhängigkeiten zu erstellen, Aliase zu erstellen oder bestehende Vorlagen zu instantiieren\&.

source: Generators are invoked with three arguments: paths to directories where generators can place their generated unit files or symlinks\&. By default those paths are runtime directories that are included in the search path of B<systemd>, but a generator may be called with different paths for debugging purposes\&.
de: Generatoren werden mit drei Argumenten aufgerufen: Pfade zu Verzeichnissen, in denen Generatoren ihre erstellten Unit-Dateien oder Symlinks ablegen können\&. Standardmäßig sind diese Pfade Laufzeitverzeichnisse, die im Suchpfad von B<systemd> enthalten sind, aber zu Fehlersuchzwecken kann ein Generator mit anderen Pfaden aufgerufen werden\&.

source: If the generator is run as part of an initial RAM file system (initrd) this is set to "1"\&. If it is run from the regular host (i\&.e\&. after the transition from initrd to host) it is set to "0"\&. This environment variable is only set for system generators\&.
de: Falls der Generator als Teil des anfänglichen RAM-Dateisystems (Initrd) ausgeführt wird, ist sie auf »1« gesetzt\&. Falls sie vom regulären Rechner ausgeführt wird (d\&.h\&. nach dem Übergang von der Initrd zum Rechner), dann ist sie auf »0« gesetzt\&. Diese Umgebungsvariable wird nur für Systemgeneratoren gesetzt\&.

source: Generators are small executables placed in /usr/lib/systemd/system-generators/ and other directories listed above\&. B<systemd>(1) will execute these binaries very early at bootup and at configuration reload time \(em before unit files are loaded\&. Their main purpose is to convert configuration that is not native to the service manager into dynamically generated unit files, symlinks or unit file drop-ins, so that they can extend the unit file hierarchy the service manager subsequently loads and operates on\&.
de: Generatoren sind kleine Programme, die sich in /usr/lib/systemd/system-generators/ und anderen oben aufgeführten Verzeichnissen befinden\&. B<systemd>(1) führt diese Programme sehr früh beim Systemstart und zum Zeitpunkt des Neuladens der Konfiguration aus, \(em bevor Unit-Dateien geladen werden\&. Ihr Hauptzweck besteht in der Umwandlung von Konfiguration, die für den Dienste-Verwalter nicht nativ ist, in dynamisch erstellte Unit-Dateien, Symlinks oder Unit-Ergänzungsdateien, so dass sie die Unit-Datei-Hierarchie des Diensteverwalters, auf dem er nachfolgend lädt und agiert, erweitern können\&.
