Repository: sebras/manpages-l10n
Catalog: po/*/man7/systemd-boot.7.po
Languages: de

source: A binary random seed B<systemd-boot> may optionally pass to the OS\&. This is a volatile EFI variable that is hashed at boot from the combination of a random seed stored in the ESP (in /loader/random-seed) and a "system token" persistently stored in the EFI variable I<LoaderSystemToken> (see below)\&. During early OS boot the system manager reads this variable and passes it to the OS kernel\*(Aqs random pool, crediting the full entropy it contains\&. This is an efficient way to ensure the system starts up with a fully initialized kernel random pool \(em as early as the initial RAM disk phase\&. B<systemd-boot> reads the random seed from the ESP, combines it with the "system token", and both derives a new random seed to update in-place the seed stored in the ESP, and the random seed to pass to the OS from it via SHA256 hashing in counter mode\&. This ensures that different physical systems that boot the same "golden" OS image \(em i\&.e\&. containing the same random seed file in the ESP \(em will still pass a different random seed to the OS\&. It is made sure the random seed stored in the ESP is fully overwritten before the OS is booted, to ensure different random seed data is used between subsequent boots\&.
de: B<systemd-boot> kann optional einen binären Zufallsstartwert an das Betriebssystem weitergeben\&. Dies ist eine flüchtige EFI-Variable, die einen während des Systemstarts ermittelten Hash aus der Kombination des in der ESP gespeicherten Zufallsstartwertes (in /loader/random-seed) und einem »Systemmerkmal«, das dauerhaft in der EFI-Variablen I<LoaderSystemToken> (siehe unten) enthält\&. Während der frühen Betriebssystemstartphase liest der Systemverwalter diese Variable und gibt sie an den Zufallsfundus des Kernels weiter und schreibt die vollständige Entropie, die es enthält, gut\&. Dies ist eine effiziente Art, um sicherzustellen, dass das System mit einem vollständig initialisierten Entropiefundus des Kernels startet, und zwar schon während der Phase der anfänglichen RAM-Platte\&. B<systemd-boot> liest den Zufallsstartwert aus dem ESP, kombiniert ihn mit dem »Systemmerkmal« und leitet einen neuen Zufallsstartwert ab, um an gleicher Stellen den im ESP gespeicherten Startwert zu ersetzen, sowie den Zufallsstartwert, um ihn an das Betriebssystem in einem SHA256-Hash im Zählermodus weiterzugeben\&. Dies stellt sicher, dass verschiedene physische Systeme, die mit dem gleichen »goldenen« Betriebssystemabbild starten, d\&.h\&. die die gleiche Zufallsstartwertedatei im ESP enthalten, dennoch einen verschiedenen Zufallsstartwert an das Betriebssystem weitergeben\&. Es wird sichergestellt, dass der im ESP gespeicherte Zufallsstartwert überschrieben ist, bevor das Betriebssystem startet, um sicherzustellen, dass zwischen nachfolgenden Systemstarts verschiedene Zufallsstartwerte verwandt werden\&.

source: See \m[blue]B<Random Seeds>\m[]\&\s-2\u[4]\d\s+2 for further information\&.
de: Siehe \m[blue]B<Zufallsstartwerte>\m[]\&\s-2\u[4]\d\s+2 für weitere Informationen\&.

source: A binary random data field, that is used for generating the random seed to pass to the OS (see above)\&. Note that this random data is generally only generated once, during OS installation, and is then never updated again\&.
de: Ein binäres Zufallsdatenfeld, das zur Erzeugung des an das Betriebssystem zu übergebenen Zufallsstartwertes verwandt wird (siehe oben)\&. Beachten Sie, dass diese Zufallsdaten im Allgemeinen nur einmal während der Betriebssysteminstallation erstellt und nie wieder aktualisiert werden\&.

source: Many of these variables are defined by the \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2\&.
de: Viele dieser Variablen werden durch die \m[blue]B<Systemladerschnittstelle>\m[]\&\s-2\u[2]\d\s+2 definiert\&.

source: BOOT COUNTING
de: STARTZÄHLUNG

source: B<systemd-boot> implements a simple boot counting mechanism on top of the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, for automatic and unattended fallback to older kernel versions/boot loader entries when a specific entry continuously fails\&. Any boot loader entry file and unified kernel image file that contains a "+" followed by one or two numbers (if two they need to be separated by a "-"), before the \&.conf or \&.efi suffix is subject to boot counting: the first of the two numbers (\*(Aqtries left\*(Aq) is decreased by one on every boot attempt, the second of the two numbers (\*(Aqtries done\*(Aq) is increased by one (if \*(Aqtries done\*(Aq is absent it is considered equivalent to 0)\&. Depending on the current value of these two counters the boot entry is considered to be in one of three states:
de: B<systemd-boot> implementiert einen einfachen Startzählungsmechanismus auf Grundlage der \m[blue]B<Boot-Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2, für automatischen und unbeaufsichtigten Rückfall zu älteren Kernelversionen/Boot-Loader-Einträgen, wenn ein bestimmter Eintrag dauerhaft fehlschlägt\&. Alle Boot-Loader-Eintragsdateien und vereinigte Kernel-Image-Dateien, bei denen ein »+« von einer oder mehreren Zahlen (falls es zwei sind, müssen sie durch ein »-« getrennt werden) vor der Endung »\&.conf« oder »\&.efi« gefolgt ist, unterliegen der Startzählung: die erste der zwei Zahlen (»verbliebene Einträge«) wird bei jedem Systemstartversuch heruntergezählt, die zweite der zwei Zahlen (»unternommene Versuche«) wird um einen erhöht (falls »unternommene Versuche« nicht vorhanden ist, wird es als 0 angenommen)\&. Abhängig vom aktuellen Wert dieser zwei Zähler wird der Boot-Eintrag einem der drei Zustände zugeordnet:

source: If the \*(Aqtries left\*(Aq counter of an entry is greater than zero the entry is considered to be in \*(Aqindeterminate\*(Aq state\&. This means the entry has not completed booting successfully yet, but also hasn\*(Aqt been determined not to work\&.
de: Falls der Zähler »verbliebene Einträge« eines Eintrages größer als Null ist, wird der Eintrag dem Zustand »unbestimmt« zugeordnet\&. Das bedeutet, dass der Eintrag noch nicht erfolgreich gestartet wurde, aber auch noch nicht als nicht funktionstüchtig erkannt wurde\&.

source: If the \*(Aqtries left\*(Aq counter of an entry is zero it is considered to be in \*(Aqbad\*(Aq state\&. This means no further attempts to boot this item will be made (that is, unless all other boot entries are also in \*(Aqbad\*(Aq state), as all attempts to boot this entry have not completed successfully\&.
de: Falls der Zähler »verbliebene Einträge« eines Eintrages gleich Null ist, wird der Eintrag in einem »schlechten« Zustand angenommen\&. Das bedeutet, dass keine weiteren Versuche unternommen werden, diesen Eintrag zu starten (das bedeutet, außer alle anderen Boot-Einträge sind auch in einem »schlechten« Zustand), da alle Versuche, diesen Eintrag zu starten, nicht erfolgreich abgeschlossen wurden\&.

source: If the \*(Aqtries left\*(Aq and \*(Aqtries done\*(Aq counters of an entry are absent it is considered to be in \*(Aqgood\*(Aq state\&. This means further boot counting for the entry is turned off, as it successfully booted at least once\&. The B<systemd-bless-boot.service>(8) service moves the currently booted entry from \*(Aqindeterminate\*(Aq into \*(Aqgood\*(Aq state when a boot attempt completed successfully\&.
de: Falls die Zähler »verbliebene Einträge« und »unternommene Versuche« eines Eintrags fehlen, wird er in einem »guten« Zustand angenommen\&. Das bedeutet, dass weiteres Startzählen für diesen Eintrag abgeschaltet ist, da er mindestens einmal erfolgreich startete\&. Der Dienst B<systemd-bless-boot.service>(8) verschiebt den aktuell gestarteten Eintrag vom Zustand »unbestimmt« in den Zustand »gut«, wenn ein Systemstartversuch erfolgreich abgeschlossen wurde\&.

source: Generally, when new entries are added to the boot loader, they first start out in \*(Aqindeterminate\*(Aq state, i\&.e\&. with a \*(Aqtries left\*(Aq counter greater than zero\&. The boot entry remains in this state until either it managed to complete a full boot successfully at least once (in which case it will be in \*(Aqgood\*(Aq state) \(em or the \*(Aqtries left\*(Aq counter reaches zero (in which case it will be in \*(Aqbad\*(Aq state)\&.
de: Im Allgemeinen befinden sich neu hinzugefügte Einträge zum Boot-Loader zuerst im Zustand »unbestimmt«, d\&.h\&. mit dem Zähler »verbliebene Einträge« größer als Null\&. Der Systemstarteintrag verbleibt in diesem Zustand, bis er entweder mindestens einmal erfolgreich durchgeführt wurde (woraufhin er sich im Zustand »gut« befindet) \(em oder der Zähler »verbliebene Einträge« erreicht Null (woraufhin er sich im Zustand »schlecht« befindet)\&.

source: Example: let\*(Aqs say a boot loader entry file foo\&.conf is set up for 3 boot tries\&. The installer will hence create it under the name foo+3\&.conf\&. On first boot, the boot loader will rename it to foo+2-1\&.conf\&. If that boot does not complete successfully, the boot loader will rename it to foo+1-2\&.conf on the following boot\&. If that fails too, it will finally be renamed foo+0-3\&.conf by the boot loader on next boot, after which it will be considered \*(Aqbad\*(Aq\&. If the boot succeeds however the entry file will be renamed to foo\&.conf by the OS, so that it is considered \*(Aqgood\*(Aq from then on\&.
de: Beispiel: Die Systemstartladereintragsdatei foo\&.conf ist für 3 Startversuche eingerichtet\&. Das Installationsprogramm wird es daher unter dem Namen foo+3\&.conf erstellen\&. Beim ersten Systemstart wird der Boot-Loader ihn in foo+2-1\&.conf umbenennen\&. Falls dieser Systemstart nicht erfolgreich abgeschlossen werden kann, wird ihn der Boot-Loader in foo+1-2\&.conf beim nachfolgenden Systemstart umbenennen\&. Falls dieser auch fehlschlägt, wird er schließlich in foo+0-3\&.conf beim nachfolgenden Systemstart umbenannt, anschließend wird er als »schlecht« betrachtet\&. Falls allerdings der Systemstart erfolgreich abgeschlossen wird, wird die Eintragsdatei durch das Betriebssystem in foo\&.conf umbenannt, so dass sie von diesem Zeitpunkt an als »gut« betrachtet wird\&.

source: The boot menu takes the \*(Aqtries left\*(Aq counter into account when sorting the menu entries: entries in \*(Aqbad\*(Aq state are ordered at the beginning of the list, and entries in \*(Aqgood\*(Aq or \*(Aqindeterminate\*(Aq at the end\&. The user can freely choose to boot any entry of the menu, including those already marked \*(Aqbad\*(Aq\&. If the menu entry to boot is automatically determined, this means that \*(Aqgood\*(Aq or \*(Aqindeterminate\*(Aq entries are generally preferred (as the bottom item of the menu is the one booted by default), and \*(Aqbad\*(Aq entries will only be considered if there are no \*(Aqgood\*(Aq or \*(Aqindeterminate\*(Aq entries left\&.
de: Das Systemstartmenü berücksichtigt den Zähler »verbliebene Einträge« bei der Sortierung der Menüeinträge: Einträge im »schlechten« Zustand werden am Anfang der Liste einsortiert und Einträge im »guten« oder »unbestimmten« Zustand am Ende\&. Der Benutzer kann frei den zu startenden Eintrag aus dem Menü aussuchen, auch die bereits als »schlecht« markierten\&. Falls der zu startende Eintrag automatisch bestimmt wird, bedeutet dies, dass »gute« oder »unbestimmte« Einträge im Allgemeinen bevorzugt werden (da der unterste Eintrag im Menü standardmäßig gestartet wird) und »schlechte« Einträge nur berücksichtigt werden, falls keine »guten« oder »unbestimmten« Einträge verblieben sind\&.

source: The B<kernel-install>(8) kernel install framework optionally sets the initial \*(Aqtries left\*(Aq counter to the value specified in /etc/kernel/tries when a boot loader entry is first created\&.
de: Das Kernelinstallationsrahmenwerk B<kernel-install>(8) setzt optional den anfänglichen Zähler »verbliebene Einträge« auf den in /etc/kernel/tries festgelegten Wert, wenn ein Systemstarteintrag erstmals erstellt wird\&.

source: SEE ALSO
de: SIEHE AUCH

source: B<bootctl>(1), B<loader.conf>(5), B<systemd-bless-boot.service>(8), B<systemd-boot-system-token.service>(8), B<kernel-install>(8), B<systemd-stub>(7), \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2
de: B<bootctl>(1), B<loader.conf>(5), B<systemd-bless-boot.service>(8), B<systemd-boot-system-token.service>(8), B<kernel-install>(8), B<systemd-stub>(7), \m[blue]B<Boot-Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Boot-Loader-Schnittstelle>\m[]\&\s-2\u[2]\d\s+2

source: NOTES
de: ANMERKUNGEN

source: Boot Loader Specification
de: Systemladerspezifikation

source: Boot Loader Interface
de: Boot-Loader-Schnittstelle

source: Automatic Boot Assessment
de: Automatische Systemstartbeurteilung

source: Random Seeds
de: Zufallsstartwerte

source: B<systemd-boot> loads boot entry information from the EFI system partition (ESP), usually mounted at /efi/, /boot/, or /boot/efi/ during OS runtime, as well as from the Extended Boot Loader partition (XBOOTLDR) if it exists (usually mounted to /boot/)\&. Configuration file fragments, kernels, initrds and other EFI images to boot generally need to reside on the ESP or the Extended Boot Loader partition\&. Linux kernels must be built with B<CONFIG_EFI_STUB> to be able to be directly executed as an EFI image\&. During boot B<systemd-boot> automatically assembles a list of boot entries from the following sources:
de: B<systemd-boot> lädt Systemstarteintragsinformationen aus der EFI-Systempartition (ESP), die zur Betriebssystemlaufzeit normalerweise unter /efi/, /boot/ oder /boot/efi/ eingehängt ist, sowie von der »Extended Boot Loader«-Partition (XBOOTLDR), falls sie existiert (normalerweise unter /boot/ eingehängt)\&. Konfigurationsdateifragmente, Kernel, Initrds und andere zu startende EFI-Images müssen im Allgemeinen in der ESP oder der »Extended Boot Loader«-Partition liegen\&. Linux-Kernel müssen mit B<CONFIG_EFI_STUB> gebaut sein, damit sie direkt als EFI-Image ausgeführt werden können\&. Während des Systemstarts fügt B<systemd-boot> automatisch eine Liste von Systemstarteinträgen aus den folgenden Quellen zusammen:

source: Boot entries defined with \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 Type #1 description files located in /loader/entries/ on the ESP and the Extended Boot Loader Partition\&. These usually describe Linux kernel images with associated initrd images, but alternatively may also describe other arbitrary EFI executables\&.
de: Systemstarteinträge, die in Typ-#1-Beschreibungsdateien gemäß der \m[blue]B<Boot Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 in /loader/entries/ auf der ESP und der »Extended Boot Loader«-Partition liegen\&. Diese beschreiben normalerweise Linux-Kernel-Images mit zugehörigen Initrd-Images, können aber alternativ auch beliebige andere EFI-Programme beschreiben\&.

source: The Microsoft Windows EFI boot manager, if installed\&.
de: Der Microsoft-Windows-EFI-Systemstartverwalter, falls installiert\&.

source: The Apple macOS boot manager, if installed\&.
de: Der Apple-macOS-Systemstartverwalter, falls installiert\&.

source: The EFI Shell binary, if installed\&.
de: Das EFI-Shell-Programm, falls installiert\&.

source: A reboot into the UEFI firmware setup option, if supported by the firmware\&.
de: Ein Neustart in die UEFI-Firmware-Einrichtungsoption, falls durch die Firmware unterstützt\&.

source: B<systemd-boot> (short: B<sd-boot>) is a simple UEFI boot manager\&. It provides a graphical menu to select the entry to boot and an editor for the kernel command line\&. B<systemd-boot> supports systems with UEFI firmware only\&.
de: B<systemd-boot> (kurz B<sd-boot>) ist ein einfacher UEFI-Systemstartverwalter\&. Er stellt ein graphisches Menü zur Auswahl des zu startenden Eintrags und einen Editor für die Kernelbefehlszeile zur Verfügung\&. B<systemd-boot> unterstützt nur Systeme mit UEFI-Firmware\&.

source: Show systemd-boot, UEFI, and firmware versions
de: Zeigt die Versionen von Systemd-boot, UEFI und der Firmware

source: Quit
de: Beendet

source: Ctrl+l
de: Strg+l

source: Reprint the screen
de: Gibt den Bildschirm erneut aus

source: The files B<systemd-boot> processes generally reside on the UEFI ESP which is usually mounted to /efi/, /boot/ or /boot/efi/ during OS runtime\&. It also processes files on the Extended Boot Loader partition which is typically mounted to /boot/, if it exists\&. B<systemd-boot> reads runtime configuration such as the boot timeout and default entry from /loader/loader\&.conf on the ESP (in combination with data read from EFI variables)\&. See B<loader.conf>(5)\&. Boot entry description files following the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 are read from /loader/entries/ on the ESP and the Extended Boot Loader partition\&. Unified kernel boot entries following the \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2 are read from /EFI/Linux/ on the ESP and the Extended Boot Loader partition\&. Optionally, a random seed for early boot entropy pool provisioning is stored in /loader/random-seed in the ESP\&.
de: Die Dateien, die B<systemd-boot> verarbeitet, liegen im Allgemeinen auf der UEFI ESP, die normalerweise während der Laufzeit des Betriebssystems nach /efi/, /boot/ oder /boot/efi/ eingehängt ist\&. Sie verarbeitet auch Dateien auf der »Extended Boot Loader«-Partition, die normalerweise auf /boot/ eingehängt ist, falls sie existiert\&. B<systemd-boot> liest Laufzeitkonfigurationen wie die Systemstartzeitüberschreitung und den Standardeintrag aus /loader/loader\&.conf in der ESP (in Kombination mit aus EFI-Variablen gelesenen Daten)\&. Siehe B<loader.conf>(5)\&. Systemeintragbeschreibungsdateien, die der \m[blue]B<Boot-Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 folgen, werden aus /loader/entries/auf der ESP und der »Extended Boot Loader«-Partition gelesen\&. Vereinigte Kernelsystemstarteinträge, die der \m[blue]B<Boot-Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2 folgen, werden aus /EFI/Linux/ auf der ESP und der »Extended Boot Loader«-Partition gelesen\&. Optional wird ein Zufallsstartwert für die Bereitstellung von Entropie im Fundus während der frühen Systemstartphase unter /loader/random-seed im ESP gespeichert\&.

source: The following EFI variables are defined, set and read by B<systemd-boot>, under the vendor UUID "4a67b082-0a4c-41cf-b6c7-440b29bb8c4f", for communication between the OS and the boot loader:
de: Die folgenden EFI-Variablen sind definiert und werden durch B<systemd-boot> unter der Lieferanten-UUID »4a67b082-0a4c-41cf-b6c7-440b29bb8c4f« für die Kommunikation zwischen dem Betriebssystem und dem Boot-Loader gesetzt und gelesen:

source: B<bootctl>(1), B<loader.conf>(5), B<systemd-bless-boot.service>(8), B<systemd-boot-system-token.service>(8), B<kernel-install>(8), \m[blue]B<Boot Loader Specification>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Boot Loader Interface>\m[]\&\s-2\u[2]\d\s+2
de: B<bootctl>(1), B<loader.conf>(5), B<systemd-bless-boot.service>(8), B<systemd-boot-system-token.service>(8), B<kernel-install>(8), \m[blue]B<Boot-Loader-Spezifikation>\m[]\&\s-2\u[1]\d\s+2, \m[blue]B<Boot-Loader-Schnittstelle>\m[]\&\s-2\u[2]\d\s+2
