Repository: sebras/manpages-l10n
Catalog: po/*/man7/systemd.generator.7.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.generator - systemd unit generators
de: systemd.generator - Systemd Unit-Generatoren

source: SYNOPSIS
de: ÜBERSICHT

source: B</path/to/generator> I<normal-dir> [I<early-dir>] [I<late-dir>]
de: B</Pfad/zum/Generator> I<normales-Verz> [I<frühes-Verz>] [I<spätes-Verz>]

source: DESCRIPTION
de: BESCHREIBUNG

source: Generators are small executables placed in /usr/lib/systemd/system-generators/ and other directories listed above\&. B<systemd>(1) will execute these binaries very early at bootup and at configuration reload time \(em before unit files are loaded\&. Their main purpose is to convert configuration and execution context parameters that are not native to the service manager into dynamically generated unit files, symlinks or unit file drop-ins, so that they can extend the unit file hierarchy the service manager subsequently loads and operates on\&.
de: Generatoren sind kleine Programme, die sich in /usr/lib/systemd/system-generators/ und anderen oben aufgeführten Verzeichnissen befinden\&. B<systemd>(1) führt diese Programme sehr früh beim Systemstart und zum Zeitpunkt des Neuladens der Konfiguration aus, \(em bevor Unit-Dateien geladen werden\&. Ihr Hauptzweck besteht in der Umwandlung von Konfigurations- und Ausführungs-Kontextparametern, die für den Dienste-Verwalter nicht nativ sind, in dynamisch erstellte Unit-Dateien, Symlinks oder Unit-Ergänzungsdateien, so dass sie die Unit-Datei-Hierarchie des Diensteverwalters, auf dem er nachfolgend lädt und agiert, erweitern können\&.

source: Directory paths for generator output differ by priority: \&.../generator\&.early has priority higher than the admin configuration in /etc/, while \&.../generator has lower priority than /etc/ but higher than vendor configuration in /usr/, and \&.../generator\&.late has priority lower than all other configuration\&. See the next section and the discussion of unit load paths and unit overriding in B<systemd.unit>(5)\&.
de: Verzeichnispfade unterscheiden sich durch Priorität: …/generator\&.early hat höhere Priorität als die Administratorkonfiguration in /etc/, während …/generator eine niedrigere Priorität als /etc/, aber eine höhere als die der Lieferantenkonfiguration in /usr/ hat. …/generator\&.late hat eine niederigere Priorität als alle anderen Konfigurationen\&. Siehe den nächsten Abschnitt und die Diskussion von Unit-Ladepfaden und Unit-Außerkraftsetzungen in B<systemd.unit>(5)\&.

source: Generators are loaded from a set of paths determined during compilation, as listed above\&. System and user generators are loaded from directories with names ending in system-generators/ and user-generators/, respectively\&. Generators found in directories listed earlier override the ones with the same name in directories lower in the list\&. A symlink to /dev/null or an empty file can be used to mask a generator, thereby preventing it from running\&. Please note that the order of the two directories with the highest priority is reversed with respect to the unit load path, and generators in /run/ overwrite those in /etc/\&.
de: Generatoren werden aus einer Gruppe von Pfaden, wie oben aufgeführt, die während der Übersetzung bestimmt wird, geladen\&. System- und Benutzergeneratoren werden von Verzeichnissen mit Namen, die auf system-generators/ bzw\&. user-generators/ enden, geladen\&. Zuerst in den Verzeichnissen gefundene Generatoren setzen diejenigen, mit dem gleichen Namen in Verzeichnissen weiter hinten in der Liste stehen, außer Kraft\&. Ein Symlink auf /dev/null oder eine leere Datei kann zum Ausmaskieren eines Generators verwandt und damit dessen Ausführung verhindert werden\&. Bitte beachten Sie, dass die Reihenfolge der zwei Verzeichnisse mit der höchsten Priorität in Hinblick auf den Unit-Ladepfad invertiert ist und dass Generatoren in /run/ solche in /etc/ außer Kraft setzen\&.

source: After installing new generators or updating the configuration, B<systemctl daemon-reload> may be executed\&. This will delete the previous configuration created by generators, re-run all generators, and cause B<systemd> to reload units from disk\&. See B<systemctl>(1) for more information\&.
de: Nach der Installation neuer Generatoren oder der Aktualisierung der Konfiguration darf B<systemctl daemon-reload> ausgeführt werden\&. Dies löscht die vorherige, von den Generatoren erstellte Konfiguration, führt alle Generatoren erneut aus und führt dazu, dass B<systemd> alle Units von Platte neu lädt\&. Siehe B<systemctl>(1) für weitere Informationen\&.

source: OUTPUT DIRECTORIES
de: AUSGABEVERZEICHNISSE

source: I<normal-dir>
de: I<normales-Verz>

source: In normal use this is /run/systemd/generator in case of the system generators and $XDG_RUNTIME_DIR/generator in case of the user generators\&. Unit files placed in this directory take precedence over vendor unit configuration but not over native user/administrator unit configuration\&.
de: Bei normaler Verwendung ist dies /run/systemd/generator im Falle von Systemgeneratoren und $XDG_RUNTIME_DIR/generator im Falle von Benutzergeneratoren\&. Unit-Dateien, die in diesen Verzeichnissen abgelegt sind, haben vor der Lieferanten-Unit-Konfiguration Vorrang, aber nicht vor der nativen Benutzer-/Administrator-Unit-Konfiguration\&.

source: I<early-dir>
de: I<frühes-Verz>

source: In normal use this is /run/systemd/generator\&.early in case of the system generators and $XDG_RUNTIME_DIR/generator\&.early in case of the user generators\&. Unit files placed in this directory override unit files in /usr/, /run/ and /etc/\&. This means that unit files placed in this directory take precedence over all normal configuration, both vendor and user/administrator\&.
de: Bei normaler Verwendung ist dies /run/systemd/generator\&.early im Falle von Systemgeneratoren und $XDG_RUNTIME_DIR/generator\&.early im Falle von Benutzergeneratoren\&. Unit-Dateien, die in diesen Verzeichnissen abgelegt sind, setzen Unit-Dateien in /usr/, /run/ und /etc/ außer Kraft\&. Dies bedeutet, dass Unit-Dateien, die in diesen Verzeichnissen abgelegt sind, Vorrang vor der gesamten normalen Konfiguration haben, sowohl von Lieferanten als auch vom Benutzer/Administrator\&.

source: I<late-dir>
de: I<spätes-Verz>

source: In normal use this is /run/systemd/generator\&.late in case of the system generators and $XDG_RUNTIME_DIR/generator\&.late in case of the user generators\&. This directory may be used to extend the unit file tree without overriding any other unit files\&. Any native configuration files supplied by the vendor or user/administrator take precedence\&.
de: Bei normaler Verwendung ist dies /run/systemd/generator\&.late im Falle von Systemgeneratoren und $XDG_RUNTIME_DIR/generator\&.late im Falle von Benutzergeneratoren\&. Dieses Verzeichnis kann dazu verwandt werden, den Unit-Dateibaum auszuweiten, ohne irgendeine andere Unit-Datei außer Kraft zu setzen. Jede vom Lieferanten oder vom Benutzer/Administrator bereitgestellte native Konfigurationsdatei hat Vorrang\&.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN

source: The service manager sets a number of environment variables when invoking generator executables\&. They carry information about the execution context of the generator, in order to simplify conditionalizing generators to specific environments\&. The following environment variables are set:
de: Der Diensteverwalter setzt beim Aufruf von Generator-Programmen eine Reihe von Umgebungsvariablen\&. Sie tragen Informationen über den Ausführungskontext des Generators, um die Anpassung von Generatoren an bestimmte Umgebungen zu vereinfachen\&. Es werden die folgenden Umgebungsvariablen gesetzt\&.

source: If the generator is invoked from the system service manager this variable is set to "system"; if invoked from the per-user service manager it is set to "user"\&.
de: Falls der Generator vom Systemdiensteverwalter aufgerufen wird, dann ist diese Variable auf »system« gesetzt; falls er vom benutzerbezogenen Diensteverwalter aufgerufen wurde, dann ist sie auf »user« gesetzt\&.

source: If the generator is run as part of an initrd this is set to "1"\&. If it is run from the regular host (i\&.e\&. after the transition from initrd to host) it is set to "0"\&. This environment variable is only set for system generators\&.
de: Falls der Generator als Teil der Initrd ausgeführt wird, ist sie auf »1« gesetzt\&. Falls sie vom regulären Rechner ausgeführt wird (d\&.h\&. nach dem Übergang von der Initrd zum Rechner), dann ist sie auf »0« gesetzt\&. Diese Umgebungsvariable wird nur für Systemgeneratoren gesetzt\&.

source: If this boot-up cycle is considered a "first boot", this is set to "1"; if it is a subsequent, regular boot it is set to "0"\&. For details see the documentation of I<ConditionFirstBoot=> in B<systemd.unit>(5)\&. This environment variable is only set for system generators\&.
de: Falls dieser Systemstartzyklus als »erster Systemstart« betrachtet wird, dann wird sie auf »1« gesetzt\&. Falls es ein nachfolgender, regulärer Systemstart ist, ist sie auf »0« gesetzt\&. Siehe die Dokumentation von I<ConditionFirstBoot=> in B<systemd.unit>(5) für Details\&. Diese Umgebungsvariable wird nur für Systemgeneratoren gesetzt\&.

source: If the service manager is run in a virtualized environment, I<$SYSTEMD_VIRTUALIZATION> is set to a pair of strings, separated by a colon\&. The first string is either "vm" or "container", categorizing the type of virtualization\&. The second string identifies the implementation of the virtualization technology\&. If no virtualization is detected this variable will not be set\&. This data is identical to what B<systemd-detect-virt>(1) detects and reports, and uses the same vocabulary of virtualization implementation identifiers\&.
de: Falls der Diensteverwalter in einer virtualisierten Umgebung ausgeführt wird, dann wird I<$SYSTEMD_VIRTUALIZATION> auf ein Paar von Zeichenketten gesetzt, getrennt durch einen Doppelpunkt\&. Die erste Zeichenkette ist entweder »vm« oder »container«; dies kategorisiert die Art der Virtualisierung\&. Die zweite Zeichenkette identifiziert die Implementierung der Virtualisierungstechnik\&. Falls keine Virtualisierung erkannt wurde, wird diese Variable nicht gesetzt\&. Diese Daten sind identisch zu dem, was B<systemd-detect-virt>(1) erkennt und berichten und verwenden das gleiche Vokabular wie Virtualisierungsimplementierungskennzeichner\&.

source: This variable is set to a short identifier of the reported architecture of the system\&. For details about defined values, see documentation of I<ConditionArchitecture=> in B<systemd.unit>(5)\&.
de: Diese Variable ist auf einen kurzen Kennzeichner der berichteten Architektur des Systems gesetzt\&. Siehe die Dokumentation von I<ConditionArchitecture=> in B<systemd.unit>(5) für Details über definierte Werte\&.

source: NOTES ABOUT WRITING GENERATORS
de: HINWEISE ZUM SCHREIBEN VON GENERATOREN

source: All generators are executed in parallel\&. That means all executables are started at the very same time and need to be able to cope with this parallelism\&.
de: Alle Generatoren werden parallel ausgeführt\&. Das bedeutet, alle Programme werden genau zur gleichen Zeit gestartet und müssen mit dieser Parallelisierung umgehen können\&.

source: Generators are run very early at boot and cannot rely on any external services\&. They may not talk to any other process\&. That includes simple things such as logging to B<syslog>(3), or B<systemd> itself (this means: no B<systemctl>(1))! Non-essential file systems like /var/ and /home/ are mounted after generators have run\&. Generators can however rely on the most basic kernel functionality to be available, as well as mounted /sys/, /proc/, /dev/, /usr/ and /run/ file systems\&.
de: Generatoren laufen sehr früh beim Systemstart und können sich nicht auf irgendeinen externen Dienst verlassen\&. Sie dürfen mit keinem anderen Prozess kommunizieren\&. Dies betrifft einfache Dinge wie die Protokollierung nach B<syslog>(3) oder B<systemd> selbst (dies heißt: kein B<systemctl>(1))! Nicht grundlegende Dateisysteme wie /var/ und /home/ werden nach dem Lauf der Generatoren eingehängt\&. Allerdings können sich die Generatoren darauf verlassen, dass die grundlegendsten Kernelfunktionalitäten vorhanden sind, sowie eingehängte /sys/-, /proc/-, /dev/-, /usr/- und /run/-Dateisysteme\&.

source: Units written by generators are removed when the configuration is reloaded\&. That means the lifetime of the generated units is closely bound to the reload cycles of B<systemd> itself\&.
de: Von Generatoren geschriebene Units werden entfernt, wenn die Konfiguration neu geladen wird\&. Das heißt, die Lebensdauer der generierten Units hängt eng mit den Neuladezyklen von B<systemd> selbst zusammen\&.

source: Generators should only be used to generate unit files, \&.d/*\&.conf drop-ins for them and symlinks to them, not any other kind of non-unit related configuration\&. Due to the lifecycle logic mentioned above, generators are not a good fit to generate dynamic configuration for other services\&. If you need to generate dynamic configuration for other services, do so in normal services you order before the service in question\&.
de: Generatoren sollten nur zur Generierung von Unit-Dateien, \&.d/*\&.conf-Ergänzungen für sie und Symlinks darauf verwandt werden, nicht für andere Arten von Konfiguration ohne Bezug zur Unit\&. Aufgrund der oben erwähnten Lebenszykluslogik sind Generatoren für die dynamische Konfiguration von anderen Diensten unpassend\&. Falls Sie dynamische Konfiguration für andere Dienste generieren müssen, erledigen Sie dies in normalen Diensten, die Sie vor dem in Frage kommenden Dienst anweisen\&.

source: Note that using the I<StandardInputData=>/I<StandardInputText=> settings of service unit files (see B<systemd.exec>(5)), it is possible to make arbitrary input data (including daemon-specific configuration) part of the unit definitions, which often might be sufficient to embed data or configuration for other programs into unit files in a native fashion\&.
de: Beachten Sie, dass mittels der Einstellungen I<StandardInputData=>/I<StandardInputText=> von Dienste-Unit-Dateien (siehe B<systemd.exec>(5)) es möglich ist, beliebige Eingabedaten (einschließlich Daemon-spezifischer Konfiguration) als Teil der Unit-Definition zu formulieren, was oft ausreicht, um Daten oder Konfiguration für andere Programme auf eine natürlich Weise in die Unit-Dateien einzubetten\&.

source: Since B<syslog>(3) is not available (see above), log messages have to be written to /dev/kmsg instead\&.
de: Da B<syslog>(3) nicht verfügbar ist (siehe oben), müssen Protokollmeldungen stattdessen nach /dev/kmsg geschrieben werden\&.

source: The generator should always include its own name in a comment at the top of the generated file, so that the user can easily figure out which component created or amended a particular unit\&.
de: Der Generator sollte immer seinen eigenen Namen in einem Kommentar am Anfang der erstellten Datei einbinden, so dass der Benutzer leicht herausfinden kann, welche Komponente eine bestimmte Unit erstellte oder ergänzte\&.

source: The I<SourcePath=> directive should be used in generated files to specify the source configuration file they are generated from\&. This makes things more easily understood by the user and also has the benefit that systemd can warn the user about configuration files that changed on disk but have not been read yet by systemd\&. The I<SourcePath=> value does not have to be a file in a physical filesystem\&. For example, in the common case of the generator looking at the kernel command line, B<SourcePath=/proc/cmdline> should be used\&.
de: Die Anweisung I<SourcePath=> sollte in erstellten Dateien verwandt werden, um die Quellkonfigurationsdatei, aus der die Unit erstellt wurde, anzugeben\&. Damit verstehen die Benutzer die Dinge leichter und dies hat auch den Vorteil, dass Systemd den Benutzer bezüglich Konfigurationsdateien, die sich auf Platte verändert haben, aber noch nicht von Systemd gelesen wurden, warnen kann\&. Der Wert I<SourcePath=> muss keine Datei in einem physischen Dateisystem sein\&. Im häufigen Beispiel, dass der Generator nach einer Kernelbefehlszeile sucht, sollte B<SourcePath=/proc/cmdline> verwandt werden\&.

source: Generators may write out dynamic unit files or just hook unit files into other units with the usual \&.wants/ or \&.requires/ symlinks\&. Often, it is nicer to simply instantiate a template unit file from /usr/ with a generator instead of writing out entirely dynamic unit files\&. Of course, this works only if a single parameter is to be used\&.
de: Generatoren dürfen dynamische Unit-Dateien schreiben oder mit den normalen Symlinks \&.wants/ oder \&.requires/ Unit-Dateien in andere Unit-Dateien einhängen\&. Oft ist es es besser, einfach eine Instanz einer Vorlagen-Unit-Datei aus /usr/ mit einem Generator zu erzeugen, statt komplett dynamische Unit-Dateien zu schreiben\&. Natürlich funktioniert dies nur, falls ein einzelner Parameter verwandt werden soll\&.

source: If you are careful, you can implement generators in shell scripts\&. We do recommend C code however, since generators are executed synchronously and hence delay the entire boot if they are slow\&.
de: Falls Sie vorsichtig sind, können Sie Generatoren in Shell-Skripten implementieren\&. Wir empfehlen allerdings C-Code, da Generatoren synchron ausgeführt werden und daher den Systemstart verzögern können, falls sie langsam sind\&.

source: Regarding overriding semantics: there are two rules we try to follow when thinking about the overriding semantics:
de: Bezüglich der Semantik beim Außer-Kraft-Setzen: Es gibt zwei Regeln, denen wir zu folgen versuchen, wenn wir über die Semantik beim Außer-Kraft-Setzen nachdenken:

source: User configuration should override vendor configuration\&. This (mostly) means that stuff from /etc/ should override stuff from /usr/\&.
de: Benutzerkonfiguration sollte die Lieferantenkonfiguration außer Kraft setzen\&. Das bedeutet (hauptsächlich), dass Zeug aus /etc/ Zeug aus /usr/ außer Kraft setzen sollte\&.

source: Native configuration should override non-native configuration\&. This (mostly) means that stuff you generate should never override native unit files for the same purpose\&.
de: Native Konfiguration sollte nicht native Konfiguration außer Kraft setzen\&. Das bedeutet (hauptsächlich), dass von Ihnen generiertes Zeug niemals native Unit-Dateien für den gleichen Zweck außer Kraft setzen sollte\&.

source: Of these two rules the first rule is probably the more important one and breaks the second one sometimes\&. Hence, when deciding whether to use argv[1], argv[2], or argv[3], your default choice should probably be argv[1]\&.
de: Von diesen Regeln ist die erste die wichtigere und bricht manchmal die zweite\&. Daher sollte die Vorgabewahl bei der Entscheidung, ob Sie argv[1], argv[2] oder argv[3] verwenden, wahrscheinlich argv[1] sein\&.

source: Instead of heading off now and writing all kind of generators for legacy configuration file formats, please think twice! It is often a better idea to just deprecate old stuff instead of keeping it artificially alive\&.
de: Statt jetzt loszulegen und alle möglichen Arten von Generatoren für veraltete Konfigurationsdateiformate zu schreiben, denken Sie bitte zwei Mal nach! Es ist oft besser, das alte Zeug als veraltet zu markieren, statt es künstlich am Leben zu erhalten\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&systemd-fstab-generator>
de: B<Beispiel\ \&1.\ \&systemd-fstab-generator>

source: B<systemd-fstab-generator>(8) converts /etc/fstab into native mount units\&. It uses argv[1] as location to place the generated unit files in order to allow the user to override /etc/fstab with their own native unit files, but also to ensure that /etc/fstab overrides any vendor default from /usr/\&.
de: B<systemd-fstab-generator>(8) konvertiert /etc/fstab in native Einhänge-Units\&. Es verwendet argv[1] als Ablageort der generierten Unit-Dateien, um dem Benutzer zu erlauben, /etc/fstab mit seinen eigenen nativen Unit-Dateien außer Kraft zu setzen, aber um auch sicherzustellen, dass /etc/fstab jede Lieferantenvorgabe aus /usr/ außer Kraft setzt\&.

source: After editing /etc/fstab, the user should invoke B<systemctl daemon-reload>\&. This will re-run all generators and cause B<systemd> to reload units from disk\&. To actually mount new directories added to fstab, B<systemctl start >I</path/to/mountpoint> or B<systemctl start local-fs\&.target> may be used\&.
de: Nach der Bearbeitung von /etc/fstab sollte der Benutzer B<systemctl daemon-reload> aufrufen\&. Dies wird alle Generatoren erneut ausführen und B<systemd> veranlassen, alle Units von Platte neu zu laden\&. Um tatsächlich neue Verzeichnisse zu Fstab hinzuzufügen, können B<systemctl start >I</Pfad/zum/Einhängepunkt> oder B<systemctl start local-fs\&.target> verwandt werden\&.

source: B<Example\ \&2.\ \&systemd-system-update-generator>
de: B<Beispiel\ \&2.\ \&systemd-system-update-generator>

source: B<systemd-system-update-generator>(8) temporarily redirects default\&.target to system-update\&.target, if a system update is scheduled\&. Since this needs to override the default user configuration for default\&.target, it uses argv[2]\&. For details about this logic, see B<systemd.offline-updates>(7)\&.
de: B<systemd-system-update-generator>(8) leitet default\&.target temporär auf system-update\&.target um, falls eine Systemaktualisierung angesetzt ist\&. Da dies die Vorgabebenutzerkonfiguration für default\&.target außer Kraft setzen muss, verwendet es argv[2]\&. Für Details zu dieser Logik lesen Sie bitte B<systemd.offline-updates>(7)\&.

source: B<Example\ \&3.\ \&Debugging a generator>
de: B<Beispiel\ \&3.\ \&Fehlersuche in einem Generator>

source: SEE ALSO
de: SIEHE AUCH

source: B</path/to/generator> I<normal-dir> I<early-dir> I<late-dir>
de: B</Pfad/zum/Generator> I<normales-Verz> I<frühes-Verz> I<spätes-Verz>

source: Generators are small executables placed in /lib/systemd/system-generators/ and other directories listed above\&. B<systemd>(1) will execute these binaries very early at bootup and at configuration reload time \(em before unit files are loaded\&. Their main purpose is to convert configuration and execution context parameters that are not native to the service manager into dynamically generated unit files, symlinks or unit file drop-ins, so that they can extend the unit file hierarchy the service manager subsequently loads and operates on\&.
de: Generatoren sind kleine Programme, die sich in /lib/systemd/system-generators/ und anderen oben aufgeführten Verzeichnissen befinden\&. B<systemd>(1) führt diese Programme sehr früh beim Systemstart und zum Zeitpunkt des Neuladens der Konfiguration aus, \(em bevor Unit-Dateien geladen werden\&. Ihr Hauptzweck besteht in der Umwandlung von Konfigurations- und Ausführungs-Kontextparametern, die für den Dienste-Verwalter nicht nativ sind, in dynamisch erstellte Unit-Dateien, Symlinks oder Unit-Ergänzungsdateien, so dass sie die Unit-Datei-Hierarchie des Diensteverwalters, auf dem er nachfolgend lädt und agiert, erweitern können\&.
