Repository: sebras/manpages-l10n
Catalog: po/*/man7/sysvipc.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: sysvipc - System V interprocess communication mechanisms
de: sysvipc - System-V-Mechanismen für Interprozesskommunikation

source: DESCRIPTION
de: BESCHREIBUNG

source: System V IPC is the name given to three interprocess communication mechanisms that are widely available on UNIX systems: message queues, semaphore, and shared memory.
de: System-V-IPC ist der Name, der drei auf UNIX-Systemen weitverbreiteten Interprozesskommunikationsmechanismen gegeben wurde: Nachrichtenwarteschlangen, Semaphoren und gemeinsam genutzter Speicher.

source: Message queues
de: Nachrichten-Warteschlangen (Message queues)

source: System V message queues allow data to be exchanged in units called messages. Each messages can have an associated priority, POSIX message queues provide an alternative API for achieving the same result; see B<mq_overview>(7).
de: System-V-Nachrichtenwarteschlangen erlauben den Datenaustausch in Einheiten, Nachrichten genannt. Jede Nachricht kann über eine zugehörige Priorität verfügen. POSIX-Nachrichtenwarteschlangen stellen eine alternative API zur Erzielung des gleichen Ergebnisses bereit, siehe B<mq_overview>(7).

source: The System V message queue API consists of the following system calls:
de: Das System-V-Nachrichtenwarteschlangen-API besteht aus den folgenden Systemaufrufen:

source: Create a new message queue or obtain the ID of an existing message queue. This call returns an identifier that is used in the remaining APIs.
de: Erstellt eine neue Nachrichtenwarteschlange oder erlangt die Kennung einer bestehenden Nachrichtenwarteschlange. Dieser Aufruf liefert einen Kennzeichner zurück, der in den verbleibenden APIs verwandt wird.

source: Add a message to a queue.
de: Fügt eine Nachricht zu einer Warteschlange hinzu.

source: Remove a message from a queue.
de: Entfernt eine Nachricht aus einer Warteschlange.

source: Perform various control operations on a queue, including deletion.
de: Führt verschiedene Steueraktionen, einschließlich Löschung, auf einer Warteschlange aus.

source: Semaphore sets
de: Semaphoren-Gruppen (Semaphore Sets)

source: System V semaphores allow processes to synchronize their actions System V semaphores are allocated in groups called sets; each semaphore in a set is a counting semaphore. POSIX semaphores provide an alternative API for achieving the same result; see B<sem_overview>(7).
de: Semaphoren gemäß System V erlauben es Prozessen, ihre Aktionen zu synchronisieren. System-V-Semaphoren werden in Gruppen zugeordnet; jede Semaphore in einer Gruppe ist eine Zähl-Semaphore. Semaphoren gemäß POSIX ist eine alternative API zur Erreichung des gleichen Ergebnisses; siehe B<shm_overview>(7).

source: The System V semaphore API consists of the following system calls:
de: Die Sempahore-API gemäß System V besteht aus den folgenden Systemaufrufen:

source: Create a new set or obtain the ID of an existing set. This call returns an identifier that is used in the remaining APIs.
de: Erstellt eine neue Gruppe oder erlangt die Kennung einer bestehenden Gruppe. Dieser Aufruf liefert einen Kennzeichner zurück, der in der restlichen API verwandt wird.

source: Perform operations on the semaphores in a set.
de: Führt Aktionen auf eine Semaphore in der Gruppe aus.

source: Perform various control operations on a set, including deletion.
de: Führt auf eine Gruppe verschiedene Steueraktionen aus, einschließlich Löschung.

source: Shared memory segments
de: Gemeinsame Speichersegmente

source: System V shared memory allows processes to share a region a memory (a "segment"). POSIX shared memory is an alternative API for achieving the same result; see B<shm_overview>(7).
de: Gemeinsamer Speicher gemäß System V erlaubt es Prozessen, eine Speicherregion (ein »Segment«) gemeinsam zu benutzen. Gemeinsamer Speicher gemäß POSIX ist eine alternative API zur Erreichung des gleichen Ergebnisses; siehe B<shm_overview>(7).

source: The System V shared memory API consists of the following system calls:
de: Das API für gemeinsamen Speicher gemäß System V besteht aus den folgenden Systemaufrufen:

source: Create a new segment or obtain the ID of an existing segment. This call returns an identifier that is used in the remaining APIs.
de: Erstellt ein neues Segment oder erlangt die Kennung eines bestehenden Segments. Dieser Aufruf liefert einen Kennzeichner zurück, der in den restlichen APIs verwandt wird.

source: Attach an existing shared memory object into the calling process's address space.
de: Blendet ein bestehendes, gemeinsam benutztes Speicherobjekt in den Adressraum des aufrufenden Prozesses ein.

source: Detach a segment from the calling process's address space.
de: Blendet ein Segment aus dem Adressraum des aufrufenden Prozesses aus.

source: Perform various control operations on a segment, including deletion.
de: Führt auf einem Segment verschiedene Steueraktionen aus, einschließlich Löschung.

source: IPC namespaces
de: IPC-Namensräume

source: For a discussion of the interaction of System V IPC objects and IPC namespaces, see B<ipc_namespaces>(7).
de: Für eine Diskussion der Interaktion von System-V-IPC-Objekten und IPC-Namensräumen lesen Sie B<ipc_namespaces>(7).

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.12 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: SYNOPSIS
de: ÜBERSICHT

source: This manual page refers to the Linux implementation of the System V interprocess communication (IPC) mechanisms: message queues, semaphore sets, and shared memory segments. In the following, the word I<resource> means an instantiation of one among such mechanisms.
de: Diese Handbuchseite bezieht sich auf die Linux-Implementierung der System-V-Mechanismen für Interprozesskommunikation: Nachrichten-Warteschlangen (Message Queues), Semaphoren-Gruppen (Semaphore Sets) und gemeinsam genutzte Speichersegmente (Shared Memory Segments). Im Folgenden bedeutet das Wort B<Ressource> eine konkrete Umsetzung eines dieser Mechanismen.

source: Resource access permissions
de: Ressourcen-Zugriffsrechte

source: For each resource, the system uses a common structure of type I<struct ipc_perm> to store information needed in determining permissions to perform an IPC operation. The I<ipc_perm> structure includes the following members:
de: Für jede Ressource verwaltet das System in einer allgemeinen Struktur des Typs I<struct ipc_perm> die Informationen, die zur Bestimmung der Rechte für eine IPC-Aktion notwendig sind. Die Struktur I<ipc_perm> enthält die folgenden Elemente:

source: struct ipc_perm { uid_t cuid; /* creator user ID */ gid_t cgid; /* creator group ID */ uid_t uid; /* owner user ID */ gid_t gid; /* owner group ID */ unsigned short mode; /* r/w permissions */ };
de: struct ipc_perm { uid_t cuid; /* Benutzerkennung des Urhebers */ gid_t cgid; /* Gruppenkennung des Urhebers */ uid_t uid; /* Benutzerkennung des Eigentümers */ gid_t gid; /* Gruppenkennung des Eigentümers */ unsigned short mode; /* Lese- und Schreibrechte */ };

source: The I<mode> member of the I<ipc_perm> structure defines, with its lower 9 bits, the access permissions to the resource for a process executing an IPC system call. The permissions are interpreted as follows:
de: Die 9 niedrigstwertigen Bits des Elements I<mode> der Struktur I<ipc_perm> legen die Zugriffsrechte auf die Ressource für Prozesse fest, die einen IPC-Systemaufruf ausführen. Die Rechte werden wie folgt interpretiert:

source: 0400 Read by user. 0200 Write by user. 0040 Read by group. 0020 Write by group. 0004 Read by others. 0002 Write by others.
de: 0400 Lesen durch Benutzer. 0200 Schreiben durch Benutzer. 0040 Lesen durch Gruppe. 0020 Schreiben durch Gruppe. 0004 Lesen durch Andere. 0002 Schreiben durch Andere.

source: Bits 0100, 0010, and 0001 (the execute bits) are unused by the system. Furthermore, "write" effectively means "alter" for a semaphore set.
de: Die Bits 0100, 0010 und 0001 (die Ausführungsbits) werden nicht vom System benutzt. Darüber hinaus bedeutet »schreiben« für Semaphoren-Gruppen tatsächlich »verändern«.

source: The same system header file also defines the following symbolic constants:
de: Dieselbe System-Header-Datei definiert auch die folgenden symbolischen Konstanten:

source: Create entry if key doesn't exist.
de: Eintrag erzeugen, wenn Schlüssel nicht vorhanden.

source: Fail if key exists.
de: Misserfolg, wenn Schlüssel vorhanden.

source: Error if request must wait.
de: Fehler, wenn die Anforderung warten muss.

source: Private key.
de: Geheimer Schlüssel.

source: Remove resource.
de: Ressource entfernen.

source: Set resource options.
de: Optionen für Ressourcen setzen.

source: Get resource options.
de: Optionen für Ressourcen feststellen.

source: Note that B<IPC_PRIVATE> is a I<key_t> type, while all the other symbolic constants are flag fields and can be OR'ed into an I<int> type variable.
de: Beachten Sie, dass B<IPC_PRIVATE> vom Typ I<key_t> ist. Alle anderen symbolischen Konstanten sind Felder von Schaltern (Flags), für die eine ODER-Verknüpfung mit einer I<int>-Variablen möglich ist.

source: A message queue is uniquely identified by a positive integer (its I<msqid>) and has an associated data structure of type I<struct msqid_ds>, defined in I<E<lt>sys/msg.hE<gt>>, containing the following members:
de: Eine Nachrichten-Warteschlange wird eindeutig über ihre I<msqid> (eine positive Ganzzahl) identifiziert und ist mit einer Datenstruktur des Typs I<struct msquid_ds> verbunden. Die Struktur wird in I<E<lt>sys/msg.hE<gt>> definiert und besteht aus den folgenden Elementen:

source: struct msqid_ds { struct ipc_perm msg_perm; msgqnum_t msg_qnum; /* no of messages on queue */ msglen_t msg_qbytes; /* bytes max on a queue */ pid_t msg_lspid; /* PID of last msgsnd(2) call */ pid_t msg_lrpid; /* PID of last msgrcv(2) call */ time_t msg_stime; /* last msgsnd(2) time */ time_t msg_rtime; /* last msgrcv(2) time */ time_t msg_ctime; /* last change time */ };
de: struct msqid_ds { struct ipc_perm msg_perm; msgqnum_t msg_qnum; /* Anzahl der Nachrichten in */ /* der Warteschlange */ msglen_t msg_qbytes; /* maximale Nachrichtenlänge */ /* für die Warteschlange */ pid_t msg_lspid; /* PID des letzten Aufrufs von */ /* msgsnd(2) */ pid_t msg_lrpid; /* PID des letzten Aufrufs von */ /* msgrcv(2)-Aufrufs */ time_t msg_stime; /* Zeitpunkt des letzten /* msgsnd(2)-Aufrufs */ time_t msg_rtime; /* Zeitpunkt des letzten /* msgrcv(2)-Aufrufs */ time_t msg_ctime; /* Zeitpunkt der letzten */ /* Änderung */ };

source: I<ipc_perm> structure that specifies the access permissions on the message queue.
de: Die Struktur I<ipc_perm> legt die Zugriffsrechte auf die Nachrichtenwarteschlange fest.

source: Number of messages currently on the message queue.
de: Aktuelle Anzahl der Nachrichten in der Warteschlange.

source: Maximum number of bytes of message text allowed on the message queue.
de: Größte erlaubte Nachrichtenlänge in Byte für die Nachrichtenwarteschlange.

source: ID of the process that performed the last B<msgsnd>(2) system call.
de: Kennung des Prozesses, der als letzter B<msgsnd>(2) aufgerufen hat.

source: ID of the process that performed the last B<msgrcv>(2) system call.
de: Kennung des Prozesses, der als letzter B<msgrcv>(2) aufgerufen hat.

source: Time of the last B<msgsnd>(2) system call.
de: Zeitpunkt des letzten Aufrufs von B<msgsnd>(2)

source: Time of the last B<msgrcv>(2) system call.
de: Zeitpunkt des letzten Aufrufs von B<msgcv>(2)

source: Time of the last system call that changed a member of the I<msqid_ds> structure.
de: Zeitpunkt des letzten Systemaufrufs, bei dem ein Element von I<msqid_ds> geändert wurde.

source: A semaphore set is uniquely identified by a positive integer (its I<semid>) and has an associated data structure of type I<struct semid_ds>, defined in I<E<lt>sys/sem.hE<gt>>, containing the following members:
de: Eine Gruppe von Semaphoren wird eindeutig durch ihre I<semid> (eine positive Ganzzahl) identifiziert und ist mit einer Datenstruktur des Typs I<struct semid_ds> verbunden. Die Struktur wird in I<E<lt>sys/sem.hE<gt>> definiert und enthält die folgenden Elemente:

source: struct semid_ds { struct ipc_perm sem_perm; time_t sem_otime; /* last operation time */ time_t sem_ctime; /* last change time */ unsigned long sem_nsems; /* count of sems in set */ };
de: struct semid_ds { struct ipc_perm sem_perm; time_t sem_otime; /* Zeitpunkt der letzten Aktion */ time_t sem_ctime; /* Zeitpunkt der letzten Änderung */ unsigned long sem_nsems; /* Anzahl der Semaphoren in der Gruppe */ };

source: I<ipc_perm> structure that specifies the access permissions on the semaphore set.
de: Die Struktur I<ipc_perm> legt die Zugriffsrechte für die Semaphoren-Gruppe fest.

source: Time of last B<semop>(2) system call.
de: Zeitpunkt des letzten Aufrufs von B<semop>(2)

source: Time of last B<semctl>(2) system call that changed a member of the above structure or of one semaphore belonging to the set.
de: Zeitpunkt des letzten Aufrufs von B<semctl>(2), der einen Eintrag der oben genannten Struktur oder einen zur Gruppe gehörenden Semaphor geändert hat.

source: Number of semaphores in the set. Each semaphore of the set is referenced by a nonnegative integer ranging from B<0> to I<sem_nsems-1>.
de: Anzahl der Semaphoren in der Gruppe. Jeder Semaphor der Gruppe wird durch eine nicht negative Ganzzahl zwischen I<0> und I<sem_nsems-1> repräsentiert.

source: A semaphore is a data structure of type I<struct sem> containing the following members:
de: Ein Semaphor ist eine Datenstruktur des Typs I<struct sem> mit folgenden Elementen:

source: struct sem { int semval; /* semaphore value */ int sempid; /* PID of process that last modified */ };
de: struct sem { int semval; /* Wert des Semaphors */ int sempid; /* PID des Prozesses, der zuletzt veränderte */ };

source: Semaphore value: a nonnegative integer.
de: Wert des Semaphors: eine nicht negative Ganzzahl

source: PID of the last process that modified the value of this semaphore.
de: PID des letzten Prozesses, der den Wert dieses Semaphoren veränderte.

source: A shared memory segment is uniquely identified by a positive integer (its I<shmid>) and has an associated data structure of type I<struct shmid_ds>, defined in I<E<lt>sys/shm.hE<gt>>, containing the following members:
de: Ein gemeinsames Speichersegment wird eindeutig durch seine I<shmid> (eine positive Ganzzahl) identifiziert und ist mit einer Datenstruktur des Typs I<struct shmid_ds> verbunden. Die Struktur wird in I<E<lt>sys/shm.hE<gt>> definiert und enthält die folgenden Elemente:

source: struct shmid_ds { struct ipc_perm shm_perm; size_t shm_segsz; /* size of segment */ pid_t shm_cpid; /* PID of creator */ pid_t shm_lpid; /* PID, last operation */ shmatt_t shm_nattch; /* no. of current attaches */ time_t shm_atime; /* time of last attach */ time_t shm_dtime; /* time of last detach */ time_t shm_ctime; /* time of last change */ };
de: struct shmid_ds { struct ipc_perm shm_perm; size_t shm_segsz; /* Segmentgröße */ pid_t shm_cpid; /* PID des Urhebers */ pid_t shm_lpid; /* PID der letzten Aktion */ shmatt_t shm_nattch; /* Anzahl der zugreifenden */ /* Prozesse */ time_t shm_atime; /* Zeitpunkt der letzten */ /* Einblendung */ time_t shm_dtime; /* Zeitpunkt der letzten */ /* Ausblendung */ time_t shm_ctime; /* Zeitpunkt der letzten */ /* Änderung */ };

source: I<ipc_perm> structure that specifies the access permissions on the shared memory segment.
de: Struktur des Typs I<ipc_perm> für die Festlegung der Zugriffsrechte auf das gemeinsame Speichersegment.

source: Size in bytes of the shared memory segment.
de: Größe des gemeinsamen Speichersegments in Byte.

source: ID of the process that created the shared memory segment.
de: Kennung des Prozesses, der das gemeinsame Speichersegment eingerichtet hat.

source: ID of the last process that executed a B<shmat>(2) or B<shmdt>(2) system call.
de: Kennung des letzten Prozesses, der B<shmat>(2) oder B<shmdt>(2) aufgerufen hat.

source: Number of current alive attaches for this shared memory segment.
de: Anzahl von aktiven Einblendungen für dieses gemeinsame Speichersegment.

source: Time of the last B<shmat>(2) system call.
de: Zeitpunkt des letzten Aufrufs von B<shmat>(2)

source: Time of the last B<shmdt>(2) system call.
de: Zeitpunkt des letzten Aufrufs von B<shmdt>(2)

source: Time of the last B<shmctl>(2) system call that changed I<shmid_ds>.
de: Zeitpunkt des letzten Aufrufs von B<shmctl>(2), der I<shmid_ds> verändert hat.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.04 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
