Repository: sebras/manpages-l10n
Catalog: po/*/man7/uri.7.po
Languages: de, es

source: It is sometimes possible to construct a URL such that an attempt to perform a seemingly harmless operation, such as the retrieval of an entity associated with the resource, will in fact cause a possibly damaging remote operation to occur. The unsafe URL is typically constructed by specifying a port number other than that reserved for the network protocol in question. The client unwittingly contacts a site that is in fact running a different protocol. The content of the URL contains instructions that, when interpreted according to this other protocol, cause an unexpected operation. An example has been the use of a gopher URL to cause an unintended or impersonating message to be sent via a SMTP server.
de: Manchmal ist es möglich, eine URL zu konstruieren, so dass ein Versuch, etwas anscheinend Harmloses durchzuführen, wie den Abruf eines einer Ressource zugeordneten Objektes, tatsächlich zu einer möglicherweise beschädigenden Aktion auf dem fernen Rechner führen kann. Die unsichere URL ist oft so konstruiert, dass sie eine Port-Nummer enthält, die sich von der unterscheidet, die für das in Frage kommende Netzwerkprotokoll reserviert ist. Der Client nimmt dann unbeabsichtigt Kontakt zu einer Site auf, die tatsächlich ein anderes Protokoll ausführt. Der Inhalt der URL enthält Anweisungen, die zu einer unbeabsichtigten Aktion führen, wenn sie gemäß dieses anderen Protokolls interpretiert werden. Ein Beispiel war eine Gopher-URL, die zu einer ungewollten und jemand anders vorgebenden Nachricht führte, die über einen SMTP-Server versandt wurde.
es: A veces es posible construir un URL tal que al intentar realizar una operación aparentemente inofensiva, como la recuperación de una entidad asociada con el recurso, se produzca una posible operación remota peligrosa. El URL no seguro se construye típicamente especificando un número de puerto distinto del reservado por el protocolo de red en cuestión. El cliente, inconscientemente contacta con un sitio que de hecho está ejecutando un protocolo diferente. El contenido del URL contiene instrucciones que, cuando son interpretadas de acuerdo con este otro protocolo, causan una operación inexperada. Un ejemplo ha sido el uso de un URL gopher para enviar, a través de un servidor SMTP, un mensaje no intencionado o anónimo.

source: Caution should be used when using any URL that specifies a port number other than the default for the protocol, especially when it is a number within the reserved space.
de: Wird eine URL verwandt, die eine Port-Nummer verwendet, die sich von der Vorgabe für das Protokoll unterscheidet, sollte aufgepasst werden, insbesondere wenn es eine Nummer innerhalb des reservierten Bereichs ist.
es: Se debería llevar cuidado cuando se usa un URL que especifica un número de puerto diferente del que viene por defecto para el protocolo, especialmente cuando se trata de un número dentro del espacio reservado.

source: Care should be taken when a URI contains escaped delimiters for a given protocol (for example, CR and LF characters for telnet protocols) that these are not unescaped before transmission. This might violate the protocol, but avoids the potential for such characters to be used to simulate an extra operation or parameter in that protocol, which might lead to an unexpected and possibly harmful remote operation to be performed.
de: Wenn eine URI maskierte Begrenzungen für ein angegebenes Protokoll enthält (beispielsweise CR- und LF-Zeichen für das Telnet-Protokoll), sollte Vorsicht walten gelassen werden, dass diese Maskierung vor der Übertragung nicht aufgehoben wird. Dies könnte das Protokoll verletzen, aber vermeidet die Möglichkeit, dass solche Zeichen dazu verwandt werden, eine zusätzliche Aktion oder einen zusätzlichen Parameter in diesem Protokoll zu simulieren, der zur Ausführung von unerwarteten und möglicherweise schädigenden Aktionen führen kann.
es: Se debería andar con precaución cuando se usa un URI que contiene delimitadores de escape para un protocolo dado (por ejemplo, los caracteres CR y LF para protocolos de telnet) ya que no son decodificados antes de la transmisión. Esto puede violar el protocolo, pero evita el peligro de que algunos caracteres sean usados para simular una operación o parámetro extra en ese protocolo, el cual puede que conduzca a que se lleve a caba una inesperada y posiblemente dañina operación.

source: It is clearly unwise to use a URI that contains a password which is intended to be secret. In particular, the use of a password within the "userinfo" component of a URI is strongly recommended against except in those rare cases where the "password" parameter is intended to be public.
de: Es ist eindeutig eine sehr schlechte Idee, eine URI zu verwenden, die geheim zu haltende Passwörter enthält. Es wird insbesondere dringend davon abgeraten, Passwörter in der Komponente »userinfo« zu verwenden, außer in den sehr seltenen Fällen, bei denen eine Veröffentlichung des Parameters »password« gewünscht ist.
es: Es claramente una mala idea el uso de un URI que contenga una contraseña, la cual es -supuestamente- secreta. En particular, el uso de una contraseña con el componente 'userinfo' de un URI está muy desaconsejada excepto en el infrecuente supuesto de una contraseña para uso público.

source: BUGS
de: FEHLER
es: ERRORES

source: Documentation may be placed in a variety of locations, so there currently isn't a good URI scheme for general online documentation in arbitrary formats. References of the form E<lt>file:///usr/doc/ZZZE<gt> don't work because different distributions and local installation requirements may place the files in different directories (it may be in /usr/doc, or /usr/local/doc, or /usr/share, or somewhere else). Also, the directory ZZZ usually changes when a version changes (though filename globbing could partially overcome this). Finally, using the file: scheme doesn't easily support people who dynamically load documentation from the Internet (instead of loading the files onto a local filesystem). A future URI scheme may be added (e.g., "userdoc:") to permit programs to include cross-references to more detailed documentation without having to know the exact location of that documentation. Alternatively, a future version of the filesystem specification may specify file locations sufficiently so that the file: scheme will be able to locate documentation.
de: Dokumentation kann an beliebigen Orten abgelegt werden, daher gibt es derzeit kein gutes URI-Schema für allgemeine Online-Dokumentation in beliebigen Formaten. Referenzen der Form E<lt>file:///usr/doc/ZZZE<gt> funktionieren nicht, da verschiedene Distributionen und lokale Installationsanforderungen Dateien in verschiedenen Verzeichnissen ablegen könnten (sie könnten in »/usr/doc«, »/usr/local/doc«, »/usr/share« oder ganz woanders liegen). Auch ändert sich das Verzeichnis normalerweise, wenn sich die Version ändert (obwohl die Verwendung von Globbing das im Allgemeinen vermeiden könnte). Schließlich erlaubt das file:-Schema keine leichte Unterstützung für Leute, die Dokumentation dynamisch aus dem Internet laden (anstatt der Ablage der Dateien auf einem lokalen System). Es könnte zukünftig ein URI-Schema hinzugefügt werden (z.B. »userdoc:«), um es Programmen zu erlauben, Kreuzreferenzen auf detailliertere Dokumentation aufzunehmen, ohne den genauen Ablageort dieser Dokumentation zu kennen. Alternativ könnte eine zukünftige Version der Dateisystemspezifikation Dateiorte ausreichend festlegen, so dass das file:-Schema in der Lage ist, Dokumentation zu verorten.
es: La documentación puede estar situada en variedad de lugares, por lo que actualmente no es un buen esuqema URI para la documentación en linea de ámbito general con diferentes formatos. Referencias de la forma E<lt>file:///usr/doc/ZZZE<gt> no funcionan porque distribuciones diferentes y requisitos de instalación locales diferentes puede que situen los archivos en directorios diferentes (puede ser en /usr/doc, o /usr/local/doc, o /usr/share, o cualquier otro sitio). Además, el directorio ZZZ normalmente cambia con la versión. Por último, usar el esquema file: no es sencillo para las personas que cargan documentación dinámica de Internet (en lugar de cargar ficheros en un sistema de archivos local). Un futuro URI puede ser añadido (por ejemplo "userdoc:") para permitirle a los programas incluir referencias cruzadas a documentación con más detalle sin tener que saber la posición exacta de dicha documentación. Alternativamente, una versión futura de la especificación del sistema de ficheros puede que especifique suficientemente las localizaciones de los ficheros para que el esquema file: sea capaz de encontrar la documentación.

source: Many programs and file formats don't include a way to incorporate or implement links using URIs.
de: Viele Programme und Dateiformate enthalten keine Möglichkeit, Links mittels URIs aufzunehmen oder zu integrieren.
es: Muchos programas y formatos de ficheros no incluyen una forma de incorporar o implementar enlaces usando URI.

source: Many programs can't handle all of these different URI formats; there should be a standard mechanism to load an arbitrary URI that automatically detects the users' environment (e.g., text or graphics, desktop environment, local user preferences, and currently executing tools) and invokes the right tool for any URI.
de: Viele Programme können alle diese verschiedenen URI-Formate nicht handhaben. Es sollte einen Standardmechanismus geben, um eine beliebige URI zu laden, der dann automatisch die Umgebung des Benutzers erkennt (z.B. Text oder graphisch, Desktop-Umgebung, lokale Benutzervoreinstellungen und aktuell ausgeführte Werkzeuge) und das richtige Werkzeug für jede URI aufruft.
es: Algunos programas no pueden manejar todos los formatos URI. Debería haber un mecanismo estándar, para cargar un URI, que automáticamente detectara el entorno del usuario (por ejemplo, texto o gráfico, entorno de escritorio, preferencias de usuario local, y herramientas que se ejecutan actualmente) y que invocara la herramienta adecuada para cualquier URI.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: COLOPHON
de: KOLOPHON
es: COLOFÓN

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: The second format (e.g., E<lt>file:/etc/passwdE<gt>) is a correct format for referring to a local file. However, older standards did not permit this format, and some programs don't recognize this as a URI. A more portable syntax is to use an empty string as the server name, for example, E<lt>file:///etc/passwdE<gt>; this form does the same thing and is easily recognized by pattern matchers and older programs as a URI. Note that if you really mean to say "start from the current location," don't specify the scheme at all; use a relative address like E<lt>../test.txtE<gt>, which has the side-effect of being scheme-independent. An example of this scheme is E<lt>file:///etc/passwdE<gt>.
de: Das zweite Format (z.B. E<lt>file:/etc/passwdE<gt>) ist ein korrektes Format für Bezüge zu einer lokalen Datei. Allerdings erlaubten ältere Standards dieses Format nicht und einige Programme erkennen es nicht als URI. Eine portablere Syntax ist die Verwendung der leeren Zeichenkette als Servernamen, beispielsweise E<lt>file:///etc/passwdE<gt>. Diese Form erzielt das gleiche und wird leicht durch Mustererkenner und ältere Programme als URI erkannt. Beachten Sie, dass Sie das Schema überhaupt nicht verwenden sollten, wenn Sie wirklich »starte bei dem aktuellen Ort« angeben möchten. Verwenden Sie in diesem Fall Adressen wie E<lt>../test.txtE<gt>, die den Nebeneffekt haben, dass sie Schema-unabhängig sind. Ein Beispiel für dieses Schema ist E<lt>file:///etc/passwdE<gt>.
es: El segundo formato (por ejemplo, E<lt>file:/etc/passwdE<gt>) es un formato correcto para referirse a ficheros locales. Sin embargo, los estándares más antiguos no permitían este formato, y algunos programas no reconocen esto como un URI. Una sintaxis más portable es usar una cadena vacía como nombre del servidor, por ejemplo, E<lt>file:///etc/passwdE<gt>. Esto hace la misma cosa y es más sencillo de reconocer por los buscadores de patrones y programas más antiguos como un URI. Advierta que si lo que realmente quiere decir es "comienza desde la posición actual," no especificas todo el esquema. En cambio, usa la dirección relativa como E<lt>../test.txtE<gt> que tiene el efecto colateral de ser independiente del esquema. Un ejemplo de este esquema es E<lt>file:///etc/passwdE<gt>.

source: Unreserved characters may be included in a URI. Unreserved characters include uppercase and lowercase English letters, decimal digits, and the following limited set of punctuation marks and symbols:
de: Nicht reservierte Zeichen können in einer URI aufgenommen werden. Nicht reservierte Zeichen schließen englische Groß- und Kleinbuchstaben, dezimale Ziffern und die folgende begrenzte Menge an Satzzeichen und Symbolen ein:
es: Los caracteres no reservados se pueden incluir en un URI. Los caracteres no reservados incluyen las letras del alfabeto inglés en mayúsculas y minúscula, los dígitos, y el siguiente conjunto de marcas de puntuación y símbolos:

source: When written, URIs should be placed inside double quotes (e.g., "http://www.kernel.org"), enclosed in angle brackets (e.g., E<lt>http://lwn.netE<gt>), or placed on a line by themselves. A warning for those who use double-quotes: B<never> move extraneous punctuation (such as the period ending a sentence or the comma in a list) inside a URI, since this will change the value of the URI. Instead, use angle brackets instead, or switch to a quoting system that never includes extraneous characters inside quotation marks. This latter system, called the 'new' or 'logical' quoting system by "Hart's Rules" and the "Oxford Dictionary for Writers and Editors", is preferred practice in Great Britain and hackers worldwide (see the Jargon File's section on Hacker Writing Style, E<.UR http://www.fwi.uva.nl\:/\(times\:/jargon\:/h\:/HackerWritingStyle.html> E<.UE ,> for more information). Older documents suggested inserting the prefix "URL:" just before the URI, but this form has never caught on.
de: Beim Aufschreiben von URLs sollten diese innerhalb doppelter englischer Anführungszeichen (z.B. "http://www.kernel.org"), in spitze Klammern eingeschlossen (z.B. E<lt>http://lwn.netE<gt>) oder frei auf einer einzelnen Zeile angegeben werden. Eine Warnung an alle, die in englischen Texten doppelte englische Anführungszeichen verwenden: Packen Sie B<niemals> überflüssige Satzzeichen (wie einen Satzpunkt, der einen Satz beendet oder ein Komma in einer Liste) innerhalb der URI, da dies den Wert der URI ändert. Verwenden Sie stattdessen spitze Klammern oder wechseln Sie auf ein Zitiersystem, das niemals überflüssige Zeichen innerhalb der Anführungszeichen verwendet. Diese anderen Systeme, die in der englischen Literatur als »new« (neue) oder »logical« (logische) Zitiersysteme von »Hart's Rules« und dem »Oxford Dictionary for Writers and Editors« genannt werden, werden in Großbritannien und von Hackern weltweit der Vorzug gegeben (siehe den Abschnitt Über den Schreibstil von Hackern in der Jargon-Datei, E<.UR http://www.fwi.uva.nl\:/\(times\:/jargon\:/h\:/HackerWritingStyle.html> für weitere Informationen). Ältere Dokumente empfahlen, der URI den Text »URL:« voranzustellen, aber diese Form hat keine Anhänger gefunden.
es: Las URI deberían escribirse entrecomilladas (p.ej:"http://www.kernel.org"), encerrarse entre E<lt>E<gt> (p.ej:E<lt>http://lwn.netE<gt>), o situarse en una línea ellos solos. Si se usan comillas, debe recordar no incluir B<nunca> signos de puntuación ajenos a la URI dentro de ellas (tales como puntos de una frase o comas de una lista) ya que esto cambiaría su valor. En su lugar, use "E<lt>E<gt>", o cambie a un sistema de notación que no incluya nunca caracteres extraños dentro de las comillas. Este último sistema, llamado el 'nuevo' o 'lógico' sistema de notación según "Las reglas de Hart"y el "Diccionario Oxford para Ecritores y Editores", es la práctica más usual en Gran Bretaña y de hackers de todo el mundo (consulte E<.UR http://www.fwi.uva.nl/~mes/jargon/h/HackerWritingStyle.html> la sección Jargon File de Hacker Writing Style E<.UE>).

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: Unreserved characters can be escaped without changing the semantics of the URI, but this should not be done unless the URI is being used in a context that does not allow the unescaped character to appear. For example, "%7e" is sometimes used instead of "~" in an HTTP URL path, but the two are equivalent for an HTTP URL.
de: Nicht reservierte Zeichen können maskiert werden, ohne dass sich die Semantik der URI ändert. Dies sollte aber nur in Umgebungen erfolgen, bei denen das nicht maskierte Zeichen nicht auftauchen darf. Beispielsweise wird manchmal »%7e« anstatt von »~« in einem HTTP-URL-Pfad verwandt, aber die zwei sind für eine HTTP-URL äquivalent.
es: Los caracteres no reservados se pueden escapar sin cambiar la semántica de la URI, pero esto no se debería hacer a menos que la URI se esté usando en un contexto que no permite que aparezcan caracteres sin escapar. Por ejemplo, se usa "%7e" en lugar de "~" en una ruta HTTP URL pero las dos son equivalentes para una URL HTTP.

source: When written, URIs should be placed inside double quotes (e.g., "http://www.kernel.org"), enclosed in angle brackets (e.g., E<lt>http://lwn.netE<gt>), or placed on a line by themselves. A warning for those who use double-quotes: B<never> move extraneous punctuation (such as the period ending a sentence or the comma in a list) inside a URI, since this will change the value of the URI. Instead, use angle brackets instead, or switch to a quoting system that never includes extraneous characters inside quotation marks. This latter system, called the 'new' or 'logical' quoting system by "Hart's Rules" and the "Oxford Dictionary for Writers and Editors", is preferred practice in Great Britain and hackers worldwide (see the Jargon File's section on Hacker Writing Style, E<.UR http://www.fwi.uva.nl\:/~mes\:/jargon\:/h\:/HackerWritingStyle.html> E<.UE ,> for more information). Older documents suggested inserting the prefix "URL:" just before the URI, but this form has never caught on.
de: Beim Aufschreiben von URLs sollten diese innerhalb doppelter englischer Anführungszeichen (z.B. "http://www.kernel.org"), in spitze Klammern eingeschlossen (z.B. E<lt>http://lwn.netE<gt>) oder frei auf einer einzelnen Zeile angegeben werden. Eine Warnung an alle, die in englischen Texten doppelte englische Anführungszeichen verwenden: Packen Sie B<niemals> überflüssige Satzzeichen (wie einen Satzpunkt, der einen Satz beendet oder ein Komma in einer Liste) innerhalb der URI, da dies den Wert der URI ändert. Verwenden Sie stattdessen spitze Klammern oder wechseln Sie auf ein Zitiersystem, das niemals überflüssige Zeichen innerhalb der Anführungszeichen verwendet. Diese anderen Systeme, die in der englischen Literatur als »new« (neue) oder »logical« (logische) Zitiersysteme von »Hart's Rules« und dem »Oxford Dictionary for Writers and Editors« genannt werden, werden in Großbritannien und von Hackern weltweit der Vorzug gegeben (siehe den Abschnitt Über den Schreibstil von Hackern in der Jargon-Datei, E<.UR http://www.fwi.uva.nl\:/~mes\:/jargon\:/h\:/HackerWritingStyle.html> für weitere Informationen). Ältere Dokumente empfahlen, der URI den Text »URL:« voranzustellen, aber diese Form hat keine Anhänger gefunden.
es: Las URI deberían escribirse entrecomilladas (p.ej:"http://www.kernel.org"), encerrarse entre E<lt>E<gt> (p.ej:E<lt>http://lwn.netE<gt>), o situarse en una línea ellos solos. Si se usan comillas, debe recordar no incluir B<nunca> signos de puntuación ajenos a la URI dentro de ellas (tales como puntos de una frase o comas de una lista) ya que esto cambiaría su valor. En su lugar, use "E<lt>E<gt>", o cambie a un sistema de notación que no incluya nunca caracteres extraños dentro de las comillas. Este último sistema, llamado el 'nuevo' o 'lógico' sistema de notación según "Las reglas de Hart"y el "Diccionario Oxford para Ecritores y Editores", es la práctica más usual en Gran Bretaña y de hackers de todo el mundo (consulte E<.UR http://www.fwi.uva.nl/~mes/jargon/h/HackerWritingStyle.html> la sección Jargon File de Hacker Writing Style E<.UE>). Algunos documentos más antiguos sugieren incluir el prefijo "URL:" justo antes de la URI, aunque esta opción nunca llegó a cuajar.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: URI = [ absoluteURI | relativeURI ] [ "#" fragment ]
es: URI = [ absolutaURI | relativaURI ] [ "#" fragmento ]

source: B<http - Web (HTTP) server>
es: B<http - Servidor (HTTP) Web>

source: B<gopher - Gopher server>
es: B<gopher - servidor Gopher>

source: telnet://I<ip_server>/
es: telnet://I<servidor_ip>/

source: STANDARDS
es: ESTÁNDARES
