Repository: sebras/manpages-l10n
Catalog: po/*/man7/uri.7.po
Languages: de, es

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: uri, url, urn - uniform resource identifier (URI), including a URL or URN
de: uri, url, urn - einheitliche Bezeichner für Ressourcen (URI), einschließlich einer URL oder URN
es: uri, url, urn - identificador uniforme de recursos (URI), incluido un URL o URN

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: absoluteURI = scheme ":" ( hierarchical_part | opaque_part )
de: absoluteURI = Schema »:« ( hierarchischer_Anteil | undurchsichtiger_Anteil )
es: absolutoURI = esquema ":" ( parte_jerarquica | parte_opaca )

source: relativeURI = ( net_path | absolute_path | relative_path ) [ "?" query ]
de: relativeURI = ( Netzpfad | absoluter_Pfad | relativer_Pfad ) [ »?« Anfrage ]
es: relativoURI = ( ruta_red | ruta_absoluta | ruta_relativa ) [ "?" pregunta ]

source: scheme = "http" | "ftp" | "gopher" | "mailto" | "news" | "telnet" | "file" | "man" | "info" | "whatis" | "ldap" | "wais" | \&...
de: Schema= »http« | »ftp« | »gopher« | »mailto« | »news« | »telnet« | »file« | »man« | »info« | »whatis« | »ldap« | »wais« | …
es: esquema = "http" | "ftp" | "gopher" | "mailto" | "news" | "telnet" | "file" | "man" | "info" | "whatis" | "ldap" | "wais" | \&...

source: hierarchical_part = ( net_path | absolute_path ) [ "?" query ]
de: hierarchischer_Anteil = ( Netzpfad | absoluter_Pfad ) [ »?« Anfrage ]
es: parte_jerarquica = ( ruta_red | ruta_absoluta ) [ "?" pregunta ]

source: net_path = "//" authority [ absolute_path ]
de: Netzpfad = »//« Autorität [ absoluter_Pfad ]
es: ruta_red = "//" autoridad [ ruta_absoluta ]

source: absolute_path = "/" path_segments
de: absoluter_Pfad = »/« Pfadsegment
es: ruta_absoluta = "/" segmentos_ruta

source: relative_path = relative_segment [ absolute_path ]
de: relativer_Pfad = relatives_Segment [ absoluter_Pfad ]
es: ruta_relativa = segmento_relativo [ ruta_absoluta ]

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: A Uniform Resource Identifier (URI) is a short string of characters identifying an abstract or physical resource (for example, a web page). A Uniform Resource Locator (URL) is a URI that identifies a resource through its primary access mechanism (e.g., its network "location"), rather than by name or some other attribute of that resource. A Uniform Resource Name (URN) is a URI that must remain globally unique and persistent even when the resource ceases to exist or becomes unavailable.
de: Ein einheitlicher Bezeichner für Ressourcen (URI, »Uniform Resource Identifier«) ist eine kurze Zeichenkette, die eine abstrakte oder physische Ressource identifiziert (beispielsweise eine Webseite). Ein einheitlicher Ressourcenzeiger (URL, »Uniform Resource Locator«) ist eine URI, die eine Ressource über ihren primären Zugangsmechanismus kennzeichnet (z.B. seinen »Netzwerkort«), statt über seinen Namen oder ein anderes Attribut dieser Ressource. Ein einheitlicher Ressourcenname (URN, »Uniform Resource Name«) ist eine URI, die global eindeutig und dauerhaft sein muss, selbst wenn die Ressource aufhört zu existieren oder unverfügbar wird.
es: Un identificador uniforme de recursos (URI) es una cadena de caracteres corta que identifica un recurso abstracto o físico (por ejemplo, una página web). Localizador de Recursos Uniforme (URL) es un URI que identifica un recurso por su mecanismo de acceso primario (por ejemplo, su ubicación de), antes que por su nombre o algún otro atributo del recurso. Un Nombre de Recurso Uniforme (URN) es un URI que debe ser globalmente único y permanecer aun cuando el recurso deja de existir o pasa a ser inaccesible.

source: URIs are the standard way to name hypertext link destinations for tools such as web browsers. The string "http://www.kernel.org" is a URL (and thus it is also a URI). Many people use the term URL loosely as a synonym for URI (though technically URLs are a subset of URIs).
de: URIs sind die Standardart, Ziele von Hypertextlinks für Werkzeuge wie Webbrowser zu benennen. Die Zeichenkette »http://www.kernel.org« ist eine URL (und daher auch eine URI). Viele Leute verwenden den Ausdruck URL locker als Synonym für URI (obwohl URLs technisch eine Teilmenge von URIs sind).
es: Los URI son la forma estándar de nombrar los destinos de los hiperenlaces para herramientas tales como los navegadores web. La cadena "http://www.kernel.org" es un URL (y también un URI). Algunas personas usan el término URL únicamente como sinónimo de URI (aunque técnicamente URLs son parte de los URI).

source: URIs can be absolute or relative. An absolute identifier refers to a resource independent of context, while a relative identifier refers to a resource by describing the difference from the current context. Within a relative path reference, the complete path segments "." and ".." have special meanings: "the current hierarchy level" and "the level above this hierarchy level", respectively, just like they do in UNIX-like systems. A path segment which contains a colon character can't be used as the first segment of a relative URI path (e.g., "this:that"), because it would be mistaken for a scheme name; precede such segments with ./ (e.g., "./this:that"). Note that descendants of MS-DOS (e.g., Microsoft Windows) replace devicename colons with the vertical bar ("|") in URIs, so "C:" becomes "C|".
de: URIs können absolut oder relativ sein. Ein absoluter Bezeichner bezieht sich auf einen Ressourcen-unabhängigen Kontext, während sich ein relativer Bezeichner auf eine Ressource bezieht, indem der Unterschied vom aktuellen Kontext beschrieben wird. Innerhalb einer relativen Pfadreferenz haben die Segmente ».« und »..« eines kompletten Pfads eine besondere Bedeutung: »die aktuelle Hierarchieebene« bzw. »die Stufe oberhalb dieser Hierarchieebene«, genau wie es bei UNIX-artigen Systemen der Fall ist. Ein Pfadsegment, das einen Doppelpunkt enthält, kann nicht als erstes Segment eines relativen URI-Pfades verwandt werden (z.B. »dies:das«), da es als Schema-Namen missverstanden würde; stellen Sie solchen Segmenten »./« voran (z.B. »./dies:das«). Beachten Sie, dass Abkömmlinge von MS-DOS (z.B. Microsoft Windows) die Doppelpunkte von Gerätenamen in URIs durch einen vertikalen Strich ersetzen (»|«) ersetzen, so dass »C:« zu »C|« wird.
es: Los URI pueden ser absolutos o relativos. Un identificador absoluto se refiere a un recurso independiente del contexto, mientras que un identificador relativo apunta a un recurso a través de las diferencias del contexto actual. Dentro de una referencia a una ruta relativa, los segmentos de ruta completos "." y ".." tienen significados especiales: "el nivel jerárquico actual" y "el nivel superior a este nivel jerárquico", respectivamente, Tal y como lo hacen los sistemas al estilo UNIX. Un segmento de ruta que contiene el carácter ":" no puede ser usado como el primer segmento de ruta relativa URI (por ejemplo, "esto:aquello"), porque sería erróneo para el esquema de nombres. Preceda tales segmentos con ./ ((por ejemplo "./esto:aquello"). Advierta que los descendientes de MS-DOS (por ejemplo, Microsoft Windows) reemplazan los dos puntos de los nombres de dispositivo con la barra vertical ("|") en URI, por lo que "C:" se convierten en "C|".

source: A fragment identifier, if included, refers to a particular named portion (fragment) of a resource; text after a \(aq#\(aq identifies the fragment. A URI beginning with \(aq#\(aq refers to that fragment in the current resource.
de: Falls ein Fragmentbezeichner enthalten ist, bezieht er sich auf einen bestimmten benannten Anteil (Fragment) einer Ressource; Text nach »#« identifiziert das Fragment. Eine URI, die mit »#« anfängt, bezieht sich auf das Fragment in der aktuellen Ressource.
es: Un identificador de fragmento, si es incluido, se refiere a una porción particular identificada (fragmento) de un recurso. El texto después de un \(aq#\(aq identifica al fragmento. Un URI que comience con \(aq#\(aq se refiere al fragmento del recurso actual.

source: Usage
de: Verwendung
es: Modo de empleo

source: There are many different URI schemes, each with specific additional rules and meanings, but they are intentionally made to be as similar as possible. For example, many URL schemes permit the authority to be the following format, called here an I<ip_server> (square brackets show what's optional):
de: Es gibt viele verschiedene URI-Schemas, jede mit besonderen zusätzlichen Regeln und Bedeutungen, aber mit Absicht werden sie so ähnlich wie möglich gestaltet. Beispielsweise erlauben viele URL-Schemas, dass die Autorität im folgenden Format vorliegt, sie wird hier ein I<IP-Server> genannt (Anteile in eckigen Klammern sind optional).
es: Hay diferentes esquemas URI, cada uno con reglas y significados adicionales, pero intencionadamente se hacen tan similares como sea posible. Por ejemplo, muchos esquemas URL permiten que la autoridad tenga el siguiente formato, llamado aquí un I<servidor_ip> (los corchetes muestran qué es opcional):

source: I<ip_server = >[I<user> [ : I<password> ] @ ] I<host> [ : I<port>]
de: I<IP-Server = >[I<Benutzer> [ : I<Passwort> ] @ ] I<Rechner> [ : I<Port>]
es: I<servidor_ip = >[I<usuario> [ : I<contraseña> ] @ ] I<host> [ : I<puerto>]

source: This format allows you to optionally insert a username, a user plus password, and/or a port number. The I<host> is the name of the host computer, either its name as determined by DNS or an IP address (numbers separated by periods). Thus the URI E<lt>http://fred:fredpassword@example.com:8080/E<gt> logs into a web server on host example.com as fred (using fredpassword) using port 8080. Avoid including a password in a URI if possible because of the many security risks of having a password written down. If the URL supplies a username but no password, and the remote server requests a password, the program interpreting the URL should request one from the user.
de: Dieses Format erlaubt Ihnen, optional einen Benutzernamen, einen Benutzer plus ein Passwort und/oder eine Port-Nummer einzufügen. Der I<Rechner> ist der Name des Rechners, entweder sein Name, wie er durch DNS bestimmt wird, oder eine IP-Adresse (durch Punkte getrennte Nummern). Daher meldet sich die URI E<lt>http://fred:fredpassword@example.com:8080/E<gt> in einem Web-Server auf dem Rechner example.com als fred (mit fredpassword) über Port 8080 an. Vermeiden Sie die Angabe eines Passworts in einer URI falls möglich, da es viele Sicherheitsrisiken gibt, wenn Passwörter niedergeschrieben werden. Falls die URL einen Benutzernamen, aber kein Passwort bereitstellt, und der ferne Server ein Passwort verlangt, sollte das Programm, das die URL auswertet, dieses Passwort vom Benutzer abfragen.
es: Este formato te permite opcionalmente insertar un nombre de usuario, una contraseña y/o un número de puerto. El I<host> es el nombre del ordenador que hace de anfitrión, y su nombre se puede determinar mediante su DNS o una dirección IP (números separados por puntos). Por lo que el URI E<lt>http://fred:fredcontraseña@example.com:8080/E<gt> se introduce en el servidor web del anfitrión example.com como fred (usando fredcontraseña) usando el puerto 8080. Evite incluir contraseñas en un URI si es posible debido a los muchos riesgos para la seguridad que supone tener un password escrito. Si el URL facilita el nombre de usuario, pero no la contraseña, y el servidor remoto pide la contraseña, el programa que interpreta el URL debe requerir una del usuario.

source: Here are some of the most common schemes in use on UNIX-like systems that are understood by many tools. Note that many tools using URIs also have internal schemes or specialized schemes; see those tools' documentation for information on those schemes.
de: Es folgen einige der häufigsten Schemas, die in UNIX-artigen Systemen verwandt und von vielen Werkzeugen verstanden werden. Beachten Sie, dass viele Werkzeuge, die URIs verwenden, über interne Schemas oder spezialisierte Schemas verfügen. Lesen Sie die Dokumentation dieser Werkzeuge für Informationen über diese Schemas.
es: Aquí hay algunos de los esquemas más comunes usados por sistemas al estilo UNIX, los cuales son comprendidos por muchas aplicaciones. Advierta que algunas aplicaciones usan URI y también tienen esquemas internos o esquemas especializados. Vea en esas aplicaciones la documentación para informarse sobre esos esquemas.

source: http://I<ip_server>/I<path>
de: http://I<IP-Server>/I<Pfad>
es: http://I<servidor_ip>/I<ruta>

source: http://I<ip_server>/I<path>?I<query>
de: http://I<IP-Server>/I<Pfad>?I<Abfrage>
es: http://I<servidor_ip>/I<ruta>?I<cuestion>

source: This is a URL accessing a web (HTTP) server. The default port is 80. If the path refers to a directory, the web server will choose what to return; usually if there is a file named "index.html" or "index.htm" its content is returned, otherwise, a list of the files in the current directory (with appropriate links) is generated and returned. An example is E<lt>http://lwn.netE<gt>.
de: Dies ist eine URL, die auf einen Web- (HTTP-)Server zugreift. Der Standard-Port ist 80. Falls sich dieser Pfad auf ein Verzeichnis bezieht, wird der Web-Server auswählen, was er zurückliefert; normalerweise wird der Inhalt einer Datei namens »index.html« oder »index.htm«, falls sie existiert, zurückgeliefert, andernfalls wird eine Liste von Dateien im aktuellen Verzeichnis (mit geeigneten Links) erzeugt und zurückgeliefert. Ein Beispiel ist E<lt>http://lwn.netE<gt>.
es: Esto es un URL accediendo a un servidor (HTTP) Web. El puerto por defecto es 80. Si la ruta se refiere a un directorio, el servidor web elegirá que devolver. Normalmente, si existe un fichero llamado "index.html" o "index.htm" será mostrado, en otro caso, se devuelve una lista de los ficheros del directorio actual (con los enlaces apropiados). Un ejemplo es E<lt>http://lwn.netE<gt>.

source: A query can be given in the archaic "isindex" format, consisting of a word or phrase and not including an equal sign (=). A query can also be in the longer "GET" format, which has one or more query entries of the form I<key>=I<value> separated by the ampersand character (&). Note that I<key> can be repeated more than once, though it's up to the web server and its application programs to determine if there's any meaning to that. There is an unfortunate interaction with HTML/XML/SGML and the GET query format; when such URIs with more than one key are embedded in SGML/XML documents (including HTML), the ampersand (&) has to be rewritten as &amp;. Note that not all queries use this format; larger forms may be too long to store as a URI, so they use a different interaction mechanism (called POST) which does not include the data in the URI. See the Common Gateway Interface specification at E<.UR http://www.w3.org\:/CGI> E<.UE> for more information.
de: Eine Abfrage kann im archaischen »isindex«-Format erfolgen. Dieses besteht aus einem Wort oder einer Phrase und enthält kein Gleichheitszeichen (=). Eine Abfrage kann auch im längeren »GET«-Format erfolgen, bei dem eine oder mehrere Abfrageeinträge der Form I<Schlüssel>=I<Wert> durch ein kaufmännisches und-Zeichen (&) getrennt werden. Beachten Sie, dass I<Schlüssel> mehr als einmal angegeben werden kann, es aber von dem Web-Server und seinen Anwendungsprogrammen abhängt, ob dies einer Bedeutung zugeordnet wird. Es gibt eine unglückliche Interaktion zwischen HTML/XML/SGML und dem GET-Abfrageformat: Wenn solche URIs mit mehr als einem Schlüssel in SGML/XML-Dokumenten (einschließlich HTML) eingebettet werden, muss das kaufmännische Und (&) als &amp; umgeschrieben werden. Beachten Sie, dass nicht alle Abfragen dieses Format verwenden; längere Formulare könnten zu lang sein, um als URI abgespeichert zu werden, daher verwenden sie einen anderen Interaktionsmechanismus (genannt POST), bei dem die Daten nicht in der URI enthalten sind. Lesen Sie dazu die »Common Gateway Interface«-Spezifikation unter E<.UR http://www.w3.org\:/CGI> E<.UE> für weitere Informationen.
es: Una pregunta se puede dar en el formato obsoleto "isindex", constituido por una palabra o frase y no incluyendo un signo igual(=). Una petición también se puede dar en un formato más largo "GET", el cual tiene una o más peticiones de entrada para el formulario I<variable>=I<valor> separadas por el carácter ampersand (&). Advierta que I<variable> puede ser repetida más de una vez, piense que son el servidor web y sus aplicaciones los encargados de determinar si tiene significado. Existe una interacción desafortunada entre HTML/XML/SGML y este formato. Cuando tales URI con más de una variable se insertan en un documento SGML/XML (incluyendo HTML), el ampersand (&) es reescrito como &amp;. Advierta que no todas las preguntas tienen este formato. Formatos más largos puede que sean demasiado largos para ser almacenados como una URI, por lo que usan un mecanismo interactivo diferente llamado POST, el cual no incluye los datos en el URI. Véase la especificación del "Common Gateway Interface" en E<.UR http://www.w3.org\:/CGI> E<.UE> para más información.

source: B<ftp - File Transfer Protocol (FTP)>
de: B<ftp - Dateiübertragungsprotokoll (FTP)>
es: B<ftp - Protocolo de Transferencia de Ficheros (FTP)>

source: ftp://I<ip_server>/I<path>
de: ftp://I<IP-Server>/I<Pfad>
es: ftp://I<servidor_ip>/I<ruta>

source: This is a URL accessing a file through the file transfer protocol (FTP). The default port (for control) is 21. If no username is included, the username "anonymous" is supplied, and in that case many clients provide as the password the requestor's Internet email address. An example is E<lt>ftp://ftp.is.co.za/rfc/rfc1808.txtE<gt>.
de: Dies ist eine URL für den Zugriff auf eine Datei über das Dateiübertragungsprotokoll (FTP). Der Standardport (für die Steuerung) ist 21. Falls kein Benutzername enthalten ist, wird der Benutzername »anonymous« bereitgestellt, und in diesem Fall stellen viele Clients als Passwort die Internet-E-Mail-Adresse des Anfragenden bereit. Ein Beispiel ist E<lt>ftp://ftp.is.co.za/rfc/rfc1808.txtE<gt>.
es: Este es un URL de acceso a ficheros a través del protocolo de transferencia de ficheros (FTP). El puerto por defecto (para control) es el 21. Si no se incluye un nombre de usuario, se introduce el usuario llamado "anonymous", y en ese caso algunos clientes dan como contraseña su dirección de correo electrónico. Un ejemplo es E<lt>ftp://ftp.is.co.za/rfc/rfc1808.txtE<gt>.

source: gopher://I<ip_server>/I<gophertype selector>
de: gopher://I<IP-Server>/I<Gophertyp-Auswähler>
es: gopher://I<servidor_ip>/I<selector tipogopher>

source: gopher://I<ip_server>/I<gophertype selector>%09I<search>
de: gopher://I<IP-Server>/I<Gophertyp-Auswähler>%09I<Suche>
es: gopher://I<servidor_ip>/I<selector tipogopher>%09I<search>

source: gopher://I<ip_server>/I<gophertype selector>%09I<search>%09I<gopher+_string>
de: gopher89://I<IP-Server>/I<Gophertyp-Auswähler>%09I<Suche>%09I<Gopher+-Zeichenkette>
es: gopher://I<servidor_ip>/I<selector tipogopher>%09I<search>%09I<gopher+_cadena>

source: The default gopher port is 70. I<gophertype> is a single-character field to denote the Gopher type of the resource to which the URL refers. The entire path may also be empty, in which case the delimiting "/" is also optional and the gophertype defaults to "1".
de: Der Standard-Gopher-Port ist 70. I<Gophertyp> ist ein Feld mit einem einzelnen Zeichen, um den Typ der Ressource, auf den sich die URL bezieht, zu bezeichnen. Der gesamte Pfad darf auch leer sein. In diesem Fall ist das begrenzende »/« auch optional und der Gophertyp ist standardmäßig »1«.
es: El puerto por defecto es el 70. I<tipogopher> es un campo de un sólo carácter que indica el tipo de recurso Gopher al que se refiere el URL. La ruta entera también puede estar vacía, y en tal caso el delimitador "/" es también opcional, siendo el tipogopher por defecto "1".

source: I<selector> is the Gopher selector string. In the Gopher protocol, Gopher selector strings are a sequence of octets which may contain any octets except 09 hexadecimal (US-ASCII HT or tab), 0A hexadecimal (US-ASCII character LF), and 0D (US-ASCII character CR).
de: I<Auswähler> ist eine Gopher-Auswählerzeichenkette. Im Gopher-Protokoll ist die Gopher-Auswählerzeichenkette eine Sequenz von Oktetten, die sämtliche Oktets außer 09 hexadezimal (US-ASCII HT oder Tab), 0A hexadezimal (US-ASCII Zeichen LF) und 0D (US-ASCII Zeichen CR) enthalten dürfen.
es: I<selector> es la cadena de selección Gopher. En el protocolo Gopher, las cadenas de selección Gopher son una secuencia de octetos que pueden contener cualquier octeto excepto el 09 en hexadecimal (US-ASCII HT o tab), 0A en hexadecimal (US-ASCII carácter LF) y 0D (US-ASCII carácter CR).

source: B<mailto - Email address>
de: B<mailto - E-Mail-Adresse>
es: B<mailto - dirección de correo>

source: mailto:I<email-address>
de: mailto:I<E-Mail-Adresse>
es: mailto:I<dirección_de_correo>

source: This is an email address, usually of the form I<name>@I<hostname>. See B<mailaddr>(7) for more information on the correct format of an email address. Note that any % character must be rewritten as %25. An example is E<lt>mailto:dwheeler@dwheeler.comE<gt>.
de: Dies ist eine E-Mail-Adresse, normalerweise in der Form I<Name>@I<Rechnername>. Siehe B<mailaddr>(7) für weitere Informationen über das korrekte Format einer E-Mail-Adresse. Beachten Sie, dass sämtliche %-Zeichen als %25 umgeschrieben werden müssen. Ein Beispiel ist E<lt>mailto:dwheeler@dwheeler.comE<gt>.
es: Esto es una dirección de correo electrónico, normalmente de la forma I<nombre>@I<nombrehost>. Véase B<mailaddr>(7) para más información acerca del formato correcto de la dirección de correo electrónico. Advierta que cualquier carácter % debe ser reescrito como %25. Un ejemplo es E<lt>mailto:dwheeler@dwheeler.comE<gt>.

source: B<news - Newsgroup or News message>
de: B<news - Newsgruppe oder News-Nachricht>
es: B<news - Grupo de noticias o Mensaje de noticias>

source: news:I<newsgroup-name>
de: news:I<Newsgruppenname>
es: news:I<nombre-gruponoticias>

source: news:I<message-id>
de: news:I<Nachrichtenkennung>
es: news:I<identificador-mensaje>

source: A I<newsgroup-name> is a period-delimited hierarchical name, such as "comp.infosystems.www.misc". If E<lt>newsgroup-nameE<gt> is "*" (as in E<lt>news:*E<gt>), it is used to refer to "all available news groups". An example is E<lt>news:comp.lang.adaE<gt>.
de: Ein I<Newsgruppenname> ist ein durch Punkte getrennter hierarchischer Name, wie »comp.infosystems.www.misc«. Falls E<lt>NewsgruppennameE<gt> ein »*« ist (wie in E<lt>news:*E<gt>), so wird dieser als Bezug auf »alle verfügbaren Newsgruppen« verwandt. Ein Beispiel ist E<lt>news:comp.lang.adaE<gt>.
es: Un I<nombre-gruponoticias> es un nombre jerárquico delimitado por puntos, tal como "comp.infosystems.www.misc". Si E<lt>newsgroup-nameE<gt> es "*" (como E<lt>news:*E<gt>), se usa para referirse a "todos los grupos de noticias disponibles". Un ejemplo es E<lt>news:comp.lang.adaE<gt>.
