Repository: sebras/manpages-l10n
Catalog: po/*/man7/uri.7.po
Languages: de, es

source: There are many other URI schemes. Most tools that accept URIs support a set of internal URIs (e.g., Mozilla has the about: scheme for internal information, and the GNOME help browser has the toc: scheme for various starting locations). There are many schemes that have been defined but are not as widely used at the current time (e.g., prospero). The nntp: scheme is deprecated in favor of the news: scheme. URNs are to be supported by the urn: scheme, with a hierarchical name space (e.g., urn:ietf:... would identify IETF documents); at this time URNs are not widely implemented. Not all tools support all schemes.
de: Es gibt viele weitere URI-Schemata. Die meisten Werkzeuge, die URIs akzeptieren, unterstützen eine Reihe interner URIs (z.B. hat Mozilla das about:-Schema für interne Informationen und der GNOME-Hilfe-Browser hat das toc:-Schema für verschiedene Startorte). Es gibt viele Schemata, die definiert wurden, aber derzeit nicht so in der Breite genutzt werden (z.B. prospero). Das nntp:-Schema ist veraltet (verwenden Sie stattdessen das news:-Schema). URNs werden vom urn:-Schema mit einem hierarchischen Namensraum (z.B. würde urn:ietf:… IETF-Dokumente identifizieren) unterstützt. Derzeit sind URNs aber nicht in der Fläche implementiert. Nicht alle Werkzeuge unterstützen alle Schemata.
es: Existen muchos otros esquemas URI diferentes. La mayoría de las herramientas que aceptan URI, también soportan un conjunto de URI internos (por ejemplo, Mozilla tiene el esquema about: para información interna, y el navegador de ayuda de GNOME tiene el formato toc: para diversas localizaciones de comienzo. Hay muchos esquemas que han sido definidos, pero que actualmente no se usan de forma amplia. (por ejemplo, prospero). El esquema nntp: está en desuso en favor del esquema news:. Las URNs van a ser soportadas por el esquema urn:, con un espacio de nombres jerárquico (por ejemplo, urn:ietf:... identificaría documentos IETF). En este momento, las URNs no están ampliamente implementadas. No todas las herramientas soportan todos los esquemas.

source: Character encoding
de: Zeichenkodierung
es: Codificación de caracteres

source: URIs use a limited number of characters so that they can be typed in and used in a variety of situations.
de: URIs verwenden eine begrenzte Anzahl von Zeichen, so dass sie in einer Vielzahl von Situationen eingegeben und verwandt werden können.
es: Las URI usan un número limitado de caracteres que pueden ser tecleados y usados multitud de situaciones.

source: The following characters are reserved, that is, they may appear in a URI but their use is limited to their reserved purpose (conflicting data must be escaped before forming the URI):
de: Die folgenden Zeichen sind reserviert. Dies bedeutet, dass sie in einer URI erscheinen dürfen, ihr Einsatz aber auf ihren reservierten Zweck beschränkt ist (Daten, die dazu in Konflikt stehen, müssen maskiert werden, bevor sie in einer URI auftauchen):
es: Los siguientes caracteres son reservados, es decir, pueden aparecer en un URI, pero su uso está limitado a su propósito específico (los datos conflictivos deben ser precedidos por una carácter de escape antes de formar el URI):

source: Unreserved characters may be included in a URI. Unreserved characters include uppercase and lowercase Latin letters, decimal digits, and the following limited set of punctuation marks and symbols:
de: Nicht reservierte Zeichen können in einer URI aufgenommen werden. Nicht reservierte Zeichen schließen lateinische Groß- und Kleinbuchstaben, dezimale Ziffern und die folgende begrenzte Menge an Satzzeichen und Symbolen ein:
es: Los caracteres no reservados se pueden incluir en un URI. Los caracteres no reservados incluyen las letras del alfabeto latino en mayúsculas y minúscula, los dígitos, y el siguiente conjunto de marcas de puntuación y símbolos:

source: All other characters must be escaped. An escaped octet is encoded as a character triplet, consisting of the percent character "%" followed by the two hexadecimal digits representing the octet code (you can use uppercase or lowercase letters for the hexadecimal digits). For example, a blank space must be escaped as "%20", a tab character as "%09", and the "&" as "%26". Because the percent "%" character always has the reserved purpose of being the escape indicator, it must be escaped as "%25". It is common practice to escape space characters as the plus symbol (+) in query text; this practice isn't uniformly defined in the relevant RFCs (which recommend %20 instead) but any tool accepting URIs with query text should be prepared for them. A URI is always shown in its "escaped" form.
de: Alle anderen Zeichen müssen maskiert werden. Ein maskiertes Oktett wird als ein Zeichen-Triplett kodiert, das aus einem Prozentzeichen »%« gefolgt von zwei hexadezimalen Ziffern, die den Oktett-Code darstellen, besteht. Die hexadezimalen Ziffern können die Buchstaben in Groß- oder Kleinschreibung verwenden. Ein Leerzeichen muss beispielsweise als »%20«, ein Tabulatorzeichen als »%09« und das »&« als "%26" maskiert werden. Da das Prozentzeichen »%« immer den reservierten Zweck des Maskieranzeigers hat, muss es als »%25« maskiert werden. Es ist gängige Praxis, Leerzeichen in Abfragetexten als Plus-Symbol (+) zu maskieren. Diese Praxis ist in den relevanten RFC (die stattdessen %20 empfehlen), nicht durchgängig definiert, aber jedes Werkzeug, das URIs mit Abfragetext akzeptiert, sollte darauf vorbereitet sein. Eine URI wird immer in ihrer »maskierten« Form dargestellt.
es: Los demás caracteres se deben preceder con carácteres de escape. Un octeto con escape se codifica como un carácter triple, constituido por el carácter de porcentaje "%" seguido de dos dígitos hexadecimales que representan el código del octeto (puede usar letras mayúsculas y minúsculas para los dígitos hexadecimales). Por ejemplo, un espacio en blanco se debe representar como "%20", el carácter tabulador como "%09", y el "&" como "%26". Ya que el carácter de porcentaje siempre tiene el propósito reservado de comenzar una secuencia de escape, se debe representar como "%25". Es una práctica común indicar los caracteres de espacio con el símbolo (+) en frases para consulta. Esta práctica no está definida de forma concisa en los RFCs relevantes (los cuales recomiendan %20 en su lugar) pero cualquier aplicación que reciba URI debería estar preparada para ellos. Un URI siempre se muestra en su forma "de escape".

source: Unreserved characters can be escaped without changing the semantics of the URI, but this should not be done unless the URI is being used in a context that does not allow the unescaped character to appear. For example, "%7e" is sometimes used instead of "\(ti" in an HTTP URL path, but the two are equivalent for an HTTP URL.
de: Nicht reservierte Zeichen können maskiert werden, ohne dass sich die Semantik der URI ändert. Dies sollte aber nur in Umgebungen erfolgen, bei denen das nicht maskierte Zeichen nicht auftauchen darf. Beispielsweise wird manchmal »%7e« anstatt von »\(ti« in einem HTTP-URL-Pfad verwandt, aber die zwei sind für eine HTTP-URL äquivalent.
es: Los caracteres no reservados se pueden escapar sin cambiar la semántica de la URI, pero esto no se debería hacer a menos que la URI se esté usando en un contexto que no permite que aparezcan caracteres sin escapar. Por ejemplo, se usa "%7e" en lugar de "\(ti" en una ruta HTTP URL pero las dos son equivalentes para una URL HTTP.

source: For URIs which must handle characters outside the US ASCII character set, the HTML 4.01 specification (section B.2) and IETF RFC\ 2718 (section 2.2.5) recommend the following approach:
de: Für URIs, die mit Zeichen außerhalb des US-ASCII-Zeichensatzes umgehen müssen, empfiehlt die HTML 4.01-Spezifikation (Abschnitt B.2) und IETF RFC\ 2718 (Abschnitt 2.2.5) den folgenden Ansatz:
es: Para las URI que deban manejar caracteres fuera del conjunto de caracteres US ASCII, la especificación HTML 4.01 (sección B.2) y el IETF RFC\ 2718 (sección 2.2.5) recomiendan la siguiente aproximación:

source: translate the character sequences into UTF-8 (IETF RFC\ 2279)\(emsee B<utf-8>(7)\(emand then
de: Übersetzen der Zeichenabfolge in UTF-8 (IETF RFC\ 2279)\(emsiehe B<utf-8>(7)\(emund dann
es: traducir las secuencias de caracteres a UTF-8 (IETF RFC\ 2279) - vea B<utf-8>(7) - y después

source: use the URI escaping mechanism, that is, use the %HH encoding for unsafe octets.
de: Verwendung des URI-Maskierungsmechanismus, d.h. die Verwendung der %HH-Kodierung für unsichere Oktetts.
es: usar el mecanismo de escape URI, es decir, usar la codificación %HH para octetos problemáticos.

source: Writing a URI
de: Schreiben einer URI
es: Escritura de URI

source: When written, URIs should be placed inside double quotes (e.g., "http://www.kernel.org"), enclosed in angle brackets (e.g., E<lt>http://lwn.netE<gt>), or placed on a line by themselves. A warning for those who use double-quotes: B<never> move extraneous punctuation (such as the period ending a sentence or the comma in a list) inside a URI, since this will change the value of the URI. Instead, use angle brackets instead, or switch to a quoting system that never includes extraneous characters inside quotation marks. This latter system, called the 'new' or 'logical' quoting system by "Hart's Rules" and the "Oxford Dictionary for Writers and Editors", is preferred practice in Great Britain and in various European languages. Older documents suggested inserting the prefix "URL:" just before the URI, but this form has never caught on.
de: Beim Aufschreiben von URLs sollten diese innerhalb doppelter englischer Anführungszeichen (z.B. "http://www.kernel.org"), in spitze Klammern eingeschlossen (z.B. E<lt>http://lwn.netE<gt>) oder frei auf einer einzelnen Zeile angegeben werden. Eine Warnung an alle, die in englischen Texten doppelte englische Anführungszeichen verwenden: Packen Sie B<niemals> überflüssige Satzzeichen (wie einen Satzpunkt, der einen Satz beendet oder ein Komma in einer Liste) innerhalb der URI, da dies den Wert der URI ändert. Verwenden Sie stattdessen spitze Klammern oder wechseln Sie auf ein Zitiersystem, das niemals überflüssige Zeichen innerhalb der Anführungszeichen verwendet. Diese anderen Systeme, die in der englischen Literatur als »new« (neue) oder »logical« (logische) Zitiersysteme von »Hart's Rules« und dem »Oxford Dictionary for Writers and Editors« genannt werden, wird in Großbritannien und vielen europäischen Sprachen der Vorzug gegeben. Ältere Dokumente empfahlen, der URI den Text »URL:« voranzustellen, aber diese Form hat keine Anhänger gefunden.
es: Cuando son escritos, las URI deberían introducirse entre comillas (por ejemplo, "http://www.kernel.org"), encerrados entre E<lt>E<gt> (por ejemplo, E<lt>http://lwn.netE<gt>), o situados en una línea solos. Una advertencia para aquellos que usan comillas dobles: B<nunca> mueva símbolos de puntuación que no pertenezcan a la URI (tales como el punto y final de una frase o la coma en una lista) dentro de ella, ya que esto cambiará su valor. En lugar de eso, use "E<lt>E<gt>", o cambie a un sistema de notación para no incluir nunca en él caracteres extraños. Este último sistema, llamado el 'nuevo' o 'lógico' sistema de entrecomillado mediante "Las reglas de Hart"y el "Diccionario Oxford para Ecritores y Editores", se considera una buena práctica en Gran Bretaña y en varios idiomas europeos. Algunos documentos más antiguos sugerían añadir el prefijo "URL" justo antes de la URI, pero esta solución nunca llegó a adoptarse mayoritariamente.

source: The URI syntax was designed to be unambiguous. However, as URIs have become commonplace, traditional media (television, radio, newspapers, billboards, etc.) have increasingly used abbreviated URI references consisting of only the authority and path portions of the identified resource (e.g., E<lt>www.w3.org/AddressingE<gt>). Such references are primarily intended for human interpretation rather than machine, with the assumption that context-based heuristics are sufficient to complete the URI (e.g., hostnames beginning with "www" are likely to have a URI prefix of "http://" and hostnames beginning with "ftp" likely to have a prefix of "ftp://"). Many client implementations heuristically resolve these references. Such heuristics may change over time, particularly when new schemes are introduced. Since an abbreviated URI has the same syntax as a relative URL path, abbreviated URI references cannot be used where relative URIs are permitted, and can be used only when there is no defined base (such as in dialog boxes). Don't use abbreviated URIs as hypertext links inside a document; use the standard format as described here.
de: Die URI-Syntax wurde entwickelt, um eindeutig zu sein. Als URIs aber Gemeingut wurden, haben traditionelle Medien (Fehrnsehen, Radio, Zeitungen, Werbeplakate usw.) zunehmend abgekürzte URI-Referenzen verwandt, die nur aus den Anteilen der Autorität und dem Pfadabschnitt der identifizierten Ressource bestehen (z.B. E<lt>www.w3.org/AddressingE<gt>). Solche Referenzen sind primär zur menschlichen Auswertung (statt durch Maschinen) gedacht, unter der Annahme, dass Kontext-basierte Heuristiken ausreichen, um die URI zu vervollständigen (z.B. wird bei Rechnernamen, die mit »www« anfangen, angenommen, dass das URI-Präfix »http://« ist und bei Rechnernamen, die mit »ftp« anfangen, dass sie das Präfix »ftp://« haben). Viele Client-Implementierungen lösen diese Referenzen heuristisch auf. Solche Heuristiken können sich im Laufe der Zeit ändern, insbesondere wenn neue Schemata eingeführt werden. Da eine abgekürzte URI die gleiche Syntax wie ein relativer URI-Pfad hat, können abgekürzte URI-Referenzen nicht an Stellen eingesetzt werden, an denen relative URIs erlaubt sind, und können nur verwandt werden, wenn es keine definierte Basis gibt (wie in Dialog-Elementen). Verwenden Sie abgekürzte URIs nicht als Hypertext-Links innerhalb eines Dokuments, verwenden Sie das hier beschriebene Standardformat.
es: La sintáxis URI se diseñó para que no fuera ambigua. Además, como las URI se han convertido en un lugar común, los medios tradicionales (televisión, radio, periódicos, vallas publicitarias, etc.) han incrementado el uso de referencias abreviadas URI formadas sólo por la autoridad y partes de la ruta del identificativo del recurso (por ejemplo, E<lt>www.w3.org/AddressingE<gt>). Tales referencias son principalmente entendidas por la interpretación humana más que por las máquinas, asumiendo que el estudio del contexto es suficiente para completar el URI (es decir, nombres de host que comiencen por "www" son como tener un prefijo URI "http://" y los host que comiencen con "ftp" usualmente tendrán un prefijo "ftp://"). Algunas implementaciones de clientes resuelven heurísticamente estas referncias. Tales heurísticas pueden cambiar con el tiempo, particularmente cuando se introduzcan nuevos esquemas. Ya que un URI abreviado tiene la misma sintaxis que una ruta URL relativa, la referencia URI relativa no se puede usar donde los URI relativos son permitidos, y sólo se pueden usar cuando no hay una base definida (como en cuadros de diálogo). No use URI abreviados como enlaces de hipertexto dentro de un documento. Use el formato estándar como se describe aquí.

source: CONFORMING TO
de: KONFORM ZU
es: CONFORME A

source: NOTES
de: ANMERKUNGEN
es: NOTAS

source: Any tool accepting URIs (e.g., a web browser) on a Linux system should be able to handle (directly or indirectly) all of the schemes described here, including the man: and info: schemes. Handling them by invoking some other program is fine and in fact encouraged.
de: Jedes Werkzeug auf einem Linux-System, das URIs akzeptiert (z.B. ein Web-Browser), sollte in der Lage sein, alle hier beschriebenen Schemata (direkt oder indirekt) zu handhaben, einschließlich der Schemata man: und info:. Werden hierzu andere Programme aufgerufen, ist dies ausreichend und in der Tat sogar erwünscht.
es: Algunas herramientas de un sistema Linux que aceptan URI (por ejemplo, un navegador) deberían ser capaces de manejar (directa o indirectamente) todos los esquemas aquí descritos, incluyendo los esquemas man: e info:. Manejarlos invocando otros programas está bien, y de hecho es lo apropiado.

source: Technically the fragment isn't part of the URI.
de: Technisch ist das Fragment kein Teil der URI.
es: Tecnicamente el fragmento no es parte del URI.

source: For information on how to embed URIs (including URLs) in a data format, see documentation on that format. HTML uses the format E<lt>A HREF="I<uri>"E<gt> I<text> E<lt>/AE<gt>. Texinfo files use the format @uref{I<uri>}. Man and mdoc have the recently added UR macro, or just include the URI in the text (viewers should be able to detect :// as part of a URI).
de: Für Informationen, wie URIs (einschließlich URLs) in ein Datenformat eingebettet werden, siehe die Dokumentation des jeweiligen Formats. HTML verwendet das Format E<lt>A HREF="I<URI>"E<gt> I<Text> E<lt>/AE<gt>. Texinfo-Dateien verwenden das Format @uref{I<uri>}. Man und Mdoc haben kürzlich das Makro »UR« hinzugefügt - alternativ fügen Sie die URI einfach in den Text ein (Anzeigeprogramme sollten in der Lage sein, das »://« als Teil einer URI zu erkennen).
es: Para informarse sobre como incrustar URI (incluidos URLs) en formato de datos, véase la documentación sobre ese formato. HTML usa el formato E<lt>A HREF="I<uri>"E<gt> I<texto> E<lt>/AE<gt>. Los archivos Textinfo usan el formato @uref{I<uri>}. Man y mdoc han añadido recientemente la macro UR, o simplemente incluyendo el URI en el texto (los visores deben ser capaces de detectar :// como parte de un URI).

source: The GNOME and KDE desktop environments currently vary in the URIs they accept, in particular in their respective help browsers. To list man pages, GNOME uses E<lt>toc:manE<gt> while KDE uses E<lt>man:(index)E<gt>, and to list info pages, GNOME uses E<lt>toc:infoE<gt> while KDE uses E<lt>info:(dir)E<gt> (the author of this man page prefers the KDE approach here, though a more regular format would be even better). In general, KDE uses E<lt>file:/cgi-bin/E<gt> as a prefix to a set of generated files. KDE prefers documentation in HTML, accessed via the E<lt>file:/cgi-bin/helpindexE<gt>. GNOME prefers the ghelp scheme to store and find documentation. Neither browser handles file: references to directories at the time of this writing, making it difficult to refer to an entire directory with a browsable URI. As noted above, these environments differ in how they handle the info: scheme, probably the most important variation. It is expected that GNOME and KDE will converge to common URI formats, and a future version of this man page will describe the converged result. Efforts to aid this convergence are encouraged.
de: Die GNOME- und KDE-Desktop-Umgebungen unterscheiden sich derzeit in den URIs, die sie akzeptieren, insbesondere in ihren jeweiligen Hilfe-Browsern. Um Handbuchseiten aufzulisten, verwendet GNOME E<lt>toc:manE<gt>, während KDE E<lt>man:(index)E<gt> verwendet, und um Info-Seiten aufzulisten, verwendet GNOME E<lt>toc:infoE<gt>, während KDE E<lt>info:(dir)E<gt> verwendet (der Autor dieser Handbuchseite bevorzugt hier den KDE-Ansatz, obwohl ein noch regelmäßigeres Format noch besser wäre). Im Allgemeinen verwendet KDE E<lt>file:/cgi-bin/E<gt> als Präfix, um eine Gruppe von erstellten Dateien einzustellen. KDE bevorzugt Dokumentation in HTML, auf die mittels E<lt>file:/cgi-bin/helpindexE<gt> zugegriffen wird. GNOME bevorzugt das Ghelp-Schema, um Dokumentation zu speichern und zu finden. Zum Zeitpunkt der Erstellung dieses Textes kann keiner der Browser mit file:-Referenzen auf Verzeichnisse umgehen, wodurch es schwierig wird, sich auf ein ganzes Verzeichnis mit einer durchsuchbaren URI zu beziehen. Wie oben angegeben, unterscheiden sich diese Umgebungen darin, wie sie das info:-Schema handhaben, was wahrscheinlich der größte Unterschied ist. Es wird erwartet, dass GNOME und KDE zu einem gemeinsamen URI-Format zusammenfinden, und das zukünftige Versionen dieser Handbuchseite das zusammengeführte Ergebnis beschreiben. Wir begrüßen alle Bemühungen, die die Zusammenführung unterstützen.
es: Los gestores de escritorio KDE y GNOME actualmente varían en los URI que aceptan, en particular en sus respectivos navegadores de ayuda. Para listar las páginas del manual, GNOME usa E<lt>toc:manE<gt> mientras que KDE usa E<lt>info:(dir)E<gt> (el autor de esta página prefiere el sistema KDE mostrado aquí, aunque un formato más regular sería mejor). En general, KDE usa E<lt>file:/cgi-bin/E<gt> como prefijo para un conjunto de ficheros generados. KDE prefiere la documentación en formato HTML, siendo accedida a través de E<lt>file:/cgi-bin/helpindexE<gt>. GNOME prefiere el esquema ghelp para almacenar y encontrar documentación. Ningún navegador maneja referencias de tipo file: a directorios en el momento de crear este documento, haciendo difícil la referencia a entradas de directorio con un navegador URI. Como se ha indicado antes, estos entornos difieren sobre cómo manejar el esquema info:, probablemente es la mayor diferencia. Se espera que GNOME y KDE converjan a un mismo formato URI, y en el futuro esta página describirá el resultado de esa convergencia. Los esfuerzos para ayudar a esta convergencia son admirables.

source: Security
de: Sicherheit
es: Seguridad

source: A URI does not in itself pose a security threat. There is no general guarantee that a URL, which at one time located a given resource, will continue to do so. Nor is there any guarantee that a URL will not locate a different resource at some later point in time; such a guarantee can be obtained only from the person(s) controlling that namespace and the resource in question.
de: Eine URI an sich stellt kein Sicherheitsproblem dar. Es gibt keine allgemeine Garantie, dass eine URL, die sich zu einem Zeitpunkt unter einer bestimmten Ressource befand, dies auch weiterhin tut. Noch gibt es eine Garantie, dass eine URL nicht eine andere Ressource zu einem späteren Zeitpunkt verortet. Diese Garantien können nur von der oder den Person(en) erhalten werden, die den Namensraum und die in Frage stehende Ressource kontrollieren.
es: Un URI no posee por sí mismo un tratamiento de seguridad. No hay garantía general de que un URI, que en un tiempo localizó un recurso dado, continue haciéndolo. Ni hay ninguna garantía de que tal URL no localizará un recurso diferente pasado un tiempo. Tal garantía sólo se puede obtener de la(s) persona(s) que mantiene(n) el nombre y el recurso en cuestión.
