Repository: sebras/manpages-l10n
Catalog: po/*/man7/uri.7.po
Languages: de, es

source: A I<message-id> corresponds to the Message-ID of E<.UR http://www.ietf.org\:/rfc\:/rfc1036.txt> IETF RFC\ 1036, E<.UE> without the enclosing "E<lt>" and "E<gt>"; it takes the form I<unique>@I<full_domain_name>. A message identifier may be distinguished from a news group name by the presence of the "@" character.
de: Eine I<Nachrichtenkennung> entspricht einer Nachrichtenkennung gemäß E<.UR http://www.ietf.org\:/rfc\:/rfc1036.txt> IETF RFC\ 1036, E<.UE> ohne die einschließenden »E<lt>« und »E<gt>«; sie ist von der Form I<Eindeutiger>@I<vollständiger_Domain-Name>. Eine Nachrichtenkennung kann von einem Newsgruppennamen durch das Vorhandensein des Zeichens »@« unterschieden werden.
es: Un I<identificador-mensaje> corresponde a Message-ID de E<.UR http://www.ietf.org\:/rfc\:/rfc1036.txt> IETF RFC\ 1036, E<.UE> sin encerrarlo entre "E<lt>" y "E<gt>". Toma la forma I<unico>@I<nombre_completo_dominio>. Un identificador de mensaje puede ser distinguido de un nombre de grupo de noticias por la presencia del carácter "@".

source: B<telnet - Telnet login>
de: B<telnet - Telnet-Anmeldung>
es: B<telnet - sesión Telnet>

source: The Telnet URL scheme is used to designate interactive text services that may be accessed by the Telnet protocol. The final "/" character may be omitted. The default port is 23. An example is E<lt>telnet://melvyl.ucop.edu/E<gt>.
de: Das Telnet-URL-Schema wird zur Kennzeichnung von interaktiven Textdiensten verwandt, auf die über das Telnet-Protokoll zugegriffen werden kann. Das abschließende »/« kann entfallen. Der Standard-Port ist 23. Ein Beispiel ist E<lt>telnet://melvyl.ucop.edu/E<gt>.
es: El esquema de una URL de telnet se usa para designar servicios de texto interactivos a los que se puede acceder a través del protocolo Telnet. El carácter final "/" se puede omitir. El puerto por defecto es el 23. Un ejemplo es E<lt>telnet://melvyl.ucop.edu/E<gt>.

source: B<file - Normal file>
de: B<file - Normale Datei>
es: B<file - Fichero normal>

source: file://I<ip_server>/I<path_segments>
de: file://I<IP-Server>/I<Pfad-Segmente>
es: file://I<servidor_ip>/I<ruta>

source: file:I<path_segments>
de: file:I<Pfad-Segmente>
es: file:I<ruta>

source: This represents a file or directory accessible locally. As a special case, I<ip_server> can be the string "localhost" or the empty string; this is interpreted as "the machine from which the URL is being interpreted". If the path is to a directory, the viewer should display the directory's contents with links to each containee; not all viewers currently do this. KDE supports generated files through the URL E<lt>file:/cgi-binE<gt>. If the given file isn't found, browser writers may want to try to expand the filename via filename globbing (see B<glob>(7) and B<glob>(3)).
de: Dies stellt eine lokal zugreifbare Datei oder Verzeichnis dar. Als Spezialfall kann I<IP-Server> die Zeichenkette »localhost« oder die leere Zeichenkette sein; dies wird als »die Maschine, von der die URL aus interpretiert wird« verstanden. Falls der Pfad ein Verzeichnis ist, sollte das Anzeigeprogramm den Inhalt mit Links zu jedem Inhaltsobjekt anzeigen, derzeit machen das nicht alle Anzeigeprogramme. KDE unterstützt erzeugte Dateien über die URL E<lt>file:/cgi-binE<gt>. Falls die übergebene Datei nicht gefunden wird, könnten Browser-Programmierer implementieren, dass der Dateiname über Dateinamen-Globbing (siehe B<glob>(7) und B<glob>(3)) expandiert wird.
es: Esto representa un fichero o directorio que se puede acceder localmente. Como caso especial, I<servidor_ip> puede ser la cadena "localhost" o una cadena vacía. Esto se interpreta como `la máquina desde la que el URL está siendo interpretado'. Si la ruta es hacia un directorio, el visor debería mostrar el contenido del directorio con enlaces a cada uno de los contenidos. Actualmente, no todos los visores hacen esto. KDE suporta ficheros generados a través del URL E<lt>file:/cgi-binE<gt>. Si no se encuentra el fichero indicado, los escritores de visualizadores pueden querer el intentar expandir el nombre del fichero mediante comodines (vea B<glob>(7) y B<glob>(3)).

source: The second format (e.g., E<lt>file:/etc/passwdE<gt>) is a correct format for referring to a local file. However, older standards did not permit this format, and some programs don't recognize this as a URI. A more portable syntax is to use an empty string as the server name, for example, E<lt>file:///etc/passwdE<gt>; this form does the same thing and is easily recognized by pattern matchers and older programs as a URI. Note that if you really mean to say "start from the current location", don't specify the scheme at all; use a relative address like E<lt>../test.txtE<gt>, which has the side-effect of being scheme-independent. An example of this scheme is E<lt>file:///etc/passwdE<gt>.
de: Das zweite Format (z.B. E<lt>file:/etc/passwdE<gt>) ist ein korrektes Format für Bezüge zu einer lokalen Datei. Allerdings erlaubten ältere Standards dieses Format nicht und einige Programme erkennen es nicht als URI. Eine portablere Syntax ist die Verwendung der leeren Zeichenkette als Servernamen, beispielsweise E<lt>file:///etc/passwdE<gt>. Diese Form erzielt das gleiche und wird leicht durch Mustererkenner und ältere Programme als URI erkannt. Beachten Sie, dass Sie das Schema überhaupt nicht verwenden sollten, wenn Sie wirklich »starte bei dem aktuellen Ort« angeben möchten. Verwenden Sie in diesem Fall Adressen wie E<lt>../test.txtE<gt>, die den Nebeneffekt haben, dass sie Schema-unabhängig sind. Ein Beispiel für dieses Schema ist E<lt>file:///etc/passwdE<gt>.
es: El segundo formato (por ejemplo, E<lt>file:/etc/passwdE<gt>) es correcto para referirse a archivos locales. Sin embargo, los estándares más antiguos no permitían este formato, y algunos programas no lo reconocen como un URI. Una sintaxis más portable es usar una cadena vacía como nombre del servidor, por ejemplo, E<lt>file:///etc/passwdE<gt>. Esto hace lo mismo y es más sencillo de reconocer para las expresiones regulares y los programas más antiguos como un URI. Advierta que si lo que realmente quiere decir es "comienza desde la posición actual," no especificas todo el esquema. En cambio, usa la dirección relativa como E<lt>../test.txtE<gt> que tiene el efecto colateral de ser independiente del esquema. Un ejemplo de este esquema es E<lt>file:///etc/passwdE<gt>.

source: B<man - Man page documentation>
de: B<man - Handbuchseiten-Dokumentation>
es: B<man - páginas man de documentación>

source: man:I<command-name>
de: man:I<Befehlsname>
es: man:I<nombre-orden>

source: man:I<command-name>(I<section>)
de: man:I<Befehlsname>(I<Abschnitt>)
es: man:I<nombre-orden>(I<sección>)

source: This refers to local online manual (man) reference pages. The command name can optionally be followed by a parenthesis and section number; see B<man>(7) for more information on the meaning of the section numbers. This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF. An example is E<lt>man:ls(1)E<gt>.
de: Dies bezieht sich auf lokale Handbuchreferenzseiten (»man pages«). Dem Befehlsnamen kann optional eine Klammer und eine Abschnittsnummer folgen; siehe B<man>(7) für weitere Informationen zu der Bedeutung der Abschnittsnummern. Dieses URI-Schema ist für UNIX-artige Systeme (wie Linux) speziell und ist derzeit bei der IETF nicht registriert. Ein Beispiel ist E<lt>man:ls(1)E<gt>.
es: Esto se refiere a las páginas de referencia en línea del manual local. El nombre de la orden opcionalmente puede ir precedido por un paréntesis y un número de sección. Véase B<man>(7) para más información sobre el significado de los números de sección. Este modelo URI es único en los sistemas tipo UNIX (como Linux) y actualmente no está registrado por la IETF. Un ejemplo es E<lt>man:ls(1)E<gt>.

source: B<info - Info page documentation>
de: B<info - Infoseiten-Dokumentation>
es: B<info - Documentación en páginas info>

source: info:I<virtual-filename>
de: info:I<virtueller_Dateiname>
es: info:I<nombrefichero-virtual>

source: info:I<virtual-filename>#I<nodename>
de: info:I<virtueller_Dateiname>#I<Knotenname>
es: info:I<nombrefichero-virtual>#I<nombrenodo>

source: info:(I<virtual-filename>)
de: info:(I<virtueller_Dateiname>)
es: info:(I<nombrefichero-virtual>)

source: info:(I<virtual-filename>)I<nodename>
de: info:(I<virtueller_Dateiname>)I<Knotenname>
es: info:(I<nombrefichero-virtual>)I<nombrenodo>

source: This scheme refers to online info reference pages (generated from texinfo files), a documentation format used by programs such as the GNU tools. This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF. As of this writing, GNOME and KDE differ in their URI syntax and do not accept the other's syntax. The first two formats are the GNOME format; in nodenames all spaces are written as underscores. The second two formats are the KDE format; spaces in nodenames must be written as spaces, even though this is forbidden by the URI standards. It's hoped that in the future most tools will understand all of these formats and will always accept underscores for spaces in nodenames. In both GNOME and KDE, if the form without the nodename is used the nodename is assumed to be "Top". Examples of the GNOME format are E<lt>info:gccE<gt> and E<lt>info:gcc#G++_and_GCCE<gt>. Examples of the KDE format are E<lt>info:(gcc)E<gt> and E<lt>info:(gcc)G++ and GCCE<gt>.
de: Dieses Schema bezieht sich auf Online-Info-Referenzseiten (die aus Texinfo-Dateien erstellt werden). Dies ist ein von Programmen wie den GNU-Werkzeugen verwandtes Dokumentationsformat. Dieses URI-Schema ist für UNIX-artige Systeme (wie Linux) speziell und ist derzeit bei der IETF nicht registriert. Zum Zeitpunkt der Erstellung dieses Dokuments unterschieden sich GNOME und KDE in ihrer URI-Syntax und akzeptierten die jeweils andere Syntax nicht. Die ersten beiden Formate sind das GNOME-Format: in Knotennamen werden alle Leerzeichen als Unterstrich geschrieben. Die anderen beiden Formate sind das KDE-Format: Leerzeichen in Knotennamen müssen als Leerzeichen geschrieben werden, obwohl dies vom URI-Standard verboten ist. Es bleibt zu hoffen, dass in der Zukunft die meisten Werkzeuge alle diese Formate verstehen werden und immer Unterstriche für Leerzeichen in Knotennamen akzeptieren werden. Sowohl in GNOME als auch KDE wird bei der Form ohne Knotennamen angenommen, dass der Knotenname »Top« ist. Beispiele für das GNOME-Format sind E<lt>info:gccE<gt> und E<lt>info:gcc#G++_and_GCCE<gt>. Beispiele für das KDE-Format sind E<lt>info:(gcc)E<gt> und E<lt>info:(gcc)G++ and GCCE<gt>.
es: Este esquema hace referencia a las páginas de referencia en línea del sistema info (generadas a partir de ficheros texinfo), un formato de documentación usado por programas tales como las herramientas GNU. Este modelo URI es único en los sistemas tipo UNIX (tales como Linux) y actualmente no está registrado por el IETF. En el momento de escribir esto, GOME y KDE difieren en sus sintáxis URI y no aceptan la sistáxis del otro. Los primeros dos formatos son el formato de GNOME. Todos los espacios en los nombres de los nodos se escriben como subrayados. Los otros dos formatos son el formato de KDE. Los espacios en los nombres de los nodos se escriben como espacios, aunque esto está prohibido por los estándares URI. Se espera que en un futuro la mayoría de las herramientas comprendan ambos formatos y que acepten subrayados para los espacios en los nombres de los nodos. Tanto en GNOME como en KDE, si se usa la forma sin el nombre de nodo, se asume "Top" como nombre de nodo. Ejemplos del formato de GNOME son E<lt>info:gccE<gt> y E<lt>info:gcc#G++_and_GCCE<gt>.Ejemplos del formato de KDE son E<lt>info:(gcc)E<gt> y E<lt>info:(gcc)G++ and GCCE<gt>.

source: B<whatis - Documentation search>
de: B<whatis - Documentationssuche>
es: B<whatis - búsqueda de documentación>

source: whatis:I<string>
de: whatis:I<Zeichenkette>
es: whatis:I<cadena>

source: This scheme searches the database of short (one-line) descriptions of commands and returns a list of descriptions containing that string. Only complete word matches are returned. See B<whatis>(1). This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF.
de: Dieses Schema durchsucht die Datenbank der kurzen (einzeiligen) Beschreibungen von Befehlen und liefert eine Liste von Beschreibungen zurück, die diese Zeichenkette enthalten. Nur vollständige Worttreffer werden zurückgeliefert. Siehe B<whatis>(1). Dieses URI-Schema ist für UNIX-artige Systeme (wie Linux) speziell und ist derzeit bei der IETF nicht registriert.
es: Busca en la base de datos de descripciones cortas (una línea) de órdenes y devuelve una lista con las descripciones que contienen esa cadena. Sólo se muestran coincidencias de palabras completas. Véase B<whatis>(1). Este esquema URI es único en los sistemas al estilo UNIX (tales como Linux) y actualmente no está registrado por el IETF.

source: B<ghelp - GNOME help documentation>
de: B<ghelp - GNOME-Hilfedokumentation>
es: B<ghelp - documentación de ayuda de GNOME>

source: ghelp:I<name-of-application>
de: ghelp:I<Name_der_Anwendung>
es: ghelp:I<ghelp: nombre-de-aplicación>

source: This loads GNOME help for the given application. Note that not much documentation currently exists in this format.
de: Dies lädt GNOME-Hilfe für die angegebene Anwendung. Beachten Sie, dass derzeit nicht viele Dokumentation in diesem Format existiert.
es: Carga la ayuda de GNOME para la aplicación dada. Dese cuenta que actualmente no existe mucha documentación en este formato.

source: B<ldap - Lightweight Directory Access Protocol>
de: B<ldap - Leichtgewichtiges Verzeichniszugriffsprotokoll>
es: B<ldap - Protocolo Ligero de Acceso a Directorios>

source: ldap://I<hostport>
de: ldap://I<Rechnerport>

source: ldap://I<hostport>/
de: ldap://I<Rechnerport>/

source: ldap://I<hostport>/I<dn>
de: ldap://I<Rechnerport>/I<DN>

source: ldap://I<hostport>/I<dn>?I<attributes>
de: ldap://I<Rechnerport>/I<DN>?I<Attribute>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>
de: ldap://I<Rechnerport>/I<DN>?I<Attribute>?I<Geltungsbereich>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>?I<filter>
de: ldap://I<Rechnerport>/I<DN>?I<Attribute>?I<Geltungsbereich>?I<Filter>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>?I<filter>?I<extensions>
de: ldap://I<Rechnerport>/I<DN>?I<Attribute>?I<Geltungsbereich>?I<Filter>?I<Erweiterungen>

source: This scheme supports queries to the Lightweight Directory Access Protocol (LDAP), a protocol for querying a set of servers for hierarchically organized information (such as people and computing resources). See E<.UR http://www.ietf.org\:/rfc\:/rfc2255.txt> RFC\ 2255 E<.UE> for more information on the LDAP URL scheme. The components of this URL are:
de: Dieses Schema unterstützt Abfragen an das leichtgewichtige Verzeichniszugriffsprotokoll (LDAP), einem Protokoll zur Abfrage einer Reihe von Servern für hierarchische Informationen (wie Personen und Rechnerressourcen). Siehe E<.UR http://www.ietf.org\:/rfc\:/rfc2255.txt> RFC\ 2255 E<.UE> für weitere Informationen über das LDAP-URL-Schema. Die Komponenten dieser URL sind:
es: Este esquema soporta consultas al protocolo LDAP (Lightweight Directory Access Protocol), un protocolo para consultar a un conjunto de servidores sobre información organizada jerárquicamente (como personas y recursos del equipo). Puede encontrar más información sobre el esquema URL para LDAP en E<.UR http://www.ietf.org\:/rfc/rfc2255.txt> RFC\ 2255 E<.UE> Los componentes de esta URL son:

source: hostport
de: Rechnerport

source: the LDAP server to query, written as a hostname optionally followed by a colon and the port number. The default LDAP port is TCP port 389. If empty, the client determines which the LDAP server to use.
de: Der abzufragende LDAP-Server, geschrieben als Rechnername, optional gefolgt von einem Doppelpunkt und der Port-Nummer. Der Vorgabe-LDAP-Port ist TCP-Port 389. Falls leer, bestimmt der Client den zu verwendenden LDAP-Server.
es: el servidor LDAP a consultar, escrito como un nombre de anfitrión seguiro por dos puntos y un número de puerto. El puerto LDAP por omisión es el puerto TCP 389. Si no se indica, el cliente determina qué servidor LDAP usar.

source: the LDAP Distinguished Name, which identifies the base object of the LDAP search (see E<.UR http://www.ietf.org\:/rfc\:/rfc2253.txt> RFC\ 2253 E<.UE> section 3).
de: Der »ausgezeichnete Name« (distinguished name) des LDAPs, der das Basis-Objekt der LDAP-Suche identifiziert (siehe E<.UR http://www.ietf.org\:/rfc\:/rfc2253.txt> RFC\ 2253 E<.UE> Abschnitt 3).
es: el Nombre LDAP Distinguido, que identifica el objeto base de la búsqueda LDAP (vea E<.UR http://www.ietf.org\:/rfc\:/rfc2253.txt> RFC\ 2253 E<.UE> sección 3).

source: attributes
de: Attribute

source: a comma-separated list of attributes to be returned; see RFC\ 2251 section 4.1.5. If omitted, all attributes should be returned.
de: Eine Kommata-getrennte Liste von zurückzuliefernden Attributen; siehe RFC\ 2251 Abschnitt 4.1.5. Falls nicht angegeben, sollen alle Attribute zurückgeliefert werden.
es: una lista de atributos, separados por comas, a devolver. Vea RFC\ 2251 sección 4.1.5. Si se omite, se deberían devolver todos los atributos.

source: scope
de: Geltungsbereich

source: specifies the scope of the search, which can be one of "base" (for a base object search), "one" (for a one-level search), or "sub" (for a subtree search). If scope is omitted, "base" is assumed.
de: Gibt den Geltungsbereich der Suche an, der entweder »base« (für eine Basisobjekt-Suche), »one« (für eine einstufige Suche) oder »sub« (für eine Unterbaum-Suche) sein kann. Falls nicht angegeben, wird »base« angenommen.
es: especifica el ámbito de la búsqueda, que puede ser "base" (para una búsqueda de objetos base), "one" (para una búsqueda de un nivel) o "sub" (para una búsqueda de subárbol). Si se omite el ámbito, se asume "base".

source: specifies the search filter (subset of entries to return). If omitted, all entries should be returned. See E<.UR http://www.ietf.org\:/rfc\:/rfc2254.txt> RFC\ 2254 E<.UE> section 4.
de: Gibt den Suchfilter an (Teilmenge der zurückzuliefernden Einträge). Falls nicht angegeben, sollen alle Einträge zurückgeliefert werden. Siehe E<.UR http://www.ietf.org\:/rfc\:/rfc2254.txt> RFC\ 2254 E<.UE> Abschnitt 4.
es: especifica el filtro de la búsqueda (subconjunto de entradas a devolver). Si se omite, se deberían devolver todas las entradas. Vea E<.UR http://www.ietf.org\:/rfc\:/rfc2254.txt> RFC\ 2254 E<.UE> sección 4.

source: extensions
de: Erweiterungen

source: a comma-separated list of type=value pairs, where the =value portion may be omitted for options not requiring it. An extension prefixed with a \(aq!\(aq is critical (must be supported to be valid), otherwise it is noncritical (optional).
de: Eine Kommata-getrennte Liste von Typ=Wert-Paaren, wobei der =Wert-Anteil bei Optionen, die diesen nicht benötigen, entfallen kann. Eine Erweiterung, der »!« vorangestellt ist, ist kritisch (sie muss für die Gültigkeit unterstützt werden), andernfalls ist sie nicht kritisch (optional).
es: Una lista de parejas tipo=valor, separadas por comas, donde la porción =valor se puede omitir para opciones que no la necesiten. Una extensión prefijada con un \(aq!\(aq es crítica (debe estar soportada para ser válida), en otro caso no es crítica (opcional).

source: LDAP queries are easiest to explain by example. Here's a query that asks ldap.itd.umich.edu for information about the University of Michigan in the U.S.:
de: LDAP-Anfragen sind am einfachsten an einem Beispiel zu erklären. Hier ist eine Abfrage, die ldap.itd.umich.edu zu Informationen über die Universität von Michigan in den USA fragt:
es: Las consultas LDAP son más fáciles de explicar mediante ejemplos. Aquí tiene una consulta que pide a ldap.itd.umich.edu información sobre la Universidad de Michigan en los EE.UU.:

source: To just get its postal address attribute, request:
de: Um nur das Postadressen-Attribut zu erhalten, fordern Sie Folgendes an:
es: Para obtener simplemente su atributo de dirección postal, pregunte:

source: To ask a host.com at port 6666 for information about the person with common name (cn) "Babs Jensen" at University of Michigan, request:
de: Um einen host.com am Port 6666 nach Informationen über die Person mit dem allgemeinen Namen (cn) »Babs Jensen« an der Universität von Michigan zu fragen, fordern Sie Folgendes an:
es: Para pedir información a host.com en el puerto 6666 sobre la persona de nombre común (common name, cn) "Babs Jensen" de la Universidad de Michigan, pregunte:

source: B<wais - Wide Area Information Servers>
de: B<wais - Weitbereichs-Informations-Server>
es: B<wais - Wide Area Information Servers (Servidores de Información de Área Amplia)>

source: wais://I<hostport>/I<database>
de: wais://I<Rechnerport>/I<Datenbank>

source: wais://I<hostport>/I<database>?I<search>
de: wais://I<Rechnerport>/I<Datenbank>?I<Suche>

source: wais://I<hostport>/I<database>/I<wtype>/I<wpath>
de: wais://I<Rechnerport>/I<Datenbank>/I<WTyp>/I<WPfad>

source: This scheme designates a WAIS database, search, or document (see E<.UR http://www.ietf.org\:/rfc\:/rfc1625.txt> IETF RFC\ 1625 E<.UE> for more information on WAIS). Hostport is the hostname, optionally followed by a colon and port number (the default port number is 210).
de: Dieses Schema kennzeichnet eine WAIS-Datenbank, -Suche oder -Dokument (siehe E<.UR http://www.ietf.org\:/rfc\:/rfc1625.txt> IETF RFC\ 1625 E<.UE> für weitere Informationen zu WAIS). Rechnerport ist der Rechnername, optional gefolgt von einem Doppelpunkt und einer Port-Nummer (die Standard-Port-Nummer ist 210).
es: Este esquema designa a una base de datos, búsqueda o documento WAIS (vea E<.UR http://www.ietf.org\:/rfc\:/rfc1625.txt> IETF RFC\ 1625 E<.UE> para obtener más información sobre WAIS). Hostport es el nombre del anfitrión, seguido opcionalmente por dos puntos y un número de puerto (el número de puerto por omisión es 210).

source: The first form designates a WAIS database for searching. The second form designates a particular search of the WAIS database I<database>. The third form designates a particular document within a WAIS database to be retrieved. I<wtype> is the WAIS designation of the type of the object and I<wpath> is the WAIS document-id.
de: Die erste Form kennzeichnet eine WAIS-Datenbank zum Durchsuchen. Die zweite Form kennzeichnet eine bestimmte Suche in der WAIS-Datenbank I<Datenbank>. Die dritte Form kennzeichnet die Abfrage eines bestimmten Dokuments innerhalb einer WAIS-Datenbank. I<WTyp> ist die WAIS-Kennzeichnung des Objekttyps und I<WPfad> ist die WAIS-Dokumentenkennzeichnung.
es: La primera forma designa a una base de datos WAIS en la que buscar. La segunda forma designa una búsqueda particular en la base de datos WAIS I<database>. La tercer forma designa un documento particular a recuperar dentro de una base de datos WAIS. I<wtype> es una designación WAIS del tipo del objeto y I<wpath> es el identificador de documento WAIS.

source: B<other schemes>
de: B<andere Schemas>
es: B<Otros formatos>
