Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: In the case of I<gid_map>, use of the B<setgroups>(2) system call must first be denied by writing "I<deny>" to the I</proc/[pid]/setgroups> file (see below) before writing to I<gid_map>.
de: Im Falle von I<gid_map> muss zuerst die Verwendung des Systemaufrufs B<setgroups>(2) verboten werden, indem »I<deny>« in die Datei I</proc/[PID]/setgroups> geschrieben wird (siehe unten), bevor in I<gid_map> geschrieben wird.
fr: Dans le cas de I<gid_map>, l’utilisation de l’appel système B<setgroups>(2) doit être d’abord interdit en écrivant « I<deny> » dans le fichier I</proc/[pid]/setgroups> (voir ci-dessous) avant d’écrire dans I<gid_map>.

source: Writing "I<deny>" to the I</proc/[pid]/setgroups> file before writing to I</proc/[pid]/gid_map> will permanently disable B<setgroups>(2) in a user namespace and allow writing to I</proc/[pid]/gid_map> without having the B<CAP_SETGID> capability in the parent user namespace.
de: Durch Schreiben von »I<deny>« in die Datei I</proc/[PID]/setgroups> vor dem Schreiben von I</proc/[PID]/gid_map> wird B<setgroups>(2) in einem Benutzernamensraum dauerhaft deaktiviert und erlaubt Schreiben von I</proc/[PID]/gid_map>, ohne über die Capability B<CAP_SETGID> im Vorgängernamensraum zu verfügen.
fr: Écrire « I<deny> » dans le fichier I</proc/[pid]/setgroups> avant d’écrire dans I</proc/[pid]/gid_map> désactivera de manière permanente B<setgroups>(2) dans un espace de noms utilisateur et permettra d’écrire dans I</proc/[pid]/gid_map> sans avoir la capacité B<CAP_SETGID> dans l’espace de noms utilisateur parent.

source: The /proc/[pid]/setgroups file
de: Die Datei I</proc/[PID]/setgroups>
fr: Le fichier /proc/[pid]/setgroups

source: The I</proc/[pid]/setgroups> file displays the string "I<allow>" if processes in the user namespace that contains the process I<pid> are permitted to employ the B<setgroups>(2) system call; it displays "I<deny>" if B<setgroups>(2) is not permitted in that user namespace. Note that regardless of the value in the I</proc/[pid]/setgroups> file (and regardless of the process's capabilities), calls to B<setgroups>(2) are also not permitted if I</proc/[pid]/gid_map> has not yet been set.
de: Die Datei I</proc/[PID]/setgroups> zeigt die Zeichenkette »I<allow>«, falls Prozesse in dem Benutzernamensraum, der den Prozess I<PID> enthält, die Erlaubnis haben, den Systemaufruf B<setgroups>(2) einzusetzen. Sie zeigt »I<deny>« an, falls B<setgroups>(2) in diesem Benutzernamensraum nicht erlaubt ist. Beachten Sie, dass Aufrufe von B<setgroups>(2) auch nicht erlaubt sind, falls I</proc/[PID]/gid_map> noch nicht gesetzt wurde, unabhängig von dem Wert der Datei I</proc/[PID]/setgroups> (und unabhängig von den Capabilitys des Prozesses).
fr: Le fichier I</proc/[pid]/setgroups> affichera la chaîne « I<allow> » si les processus dans l’espace de noms utilisateur qui contient le processus I<pid> sont autorisés à employer l’appel système B<setgroups>(2). Il affichera « I<deny> » si B<setgroups>(2) n’est pas autorisé dans cet espace de noms utilisateur. Remarquez que quelque soit la valeur dans le fichier I</proc/[pid]/setgroups> (et quelque soient les capacités du processus), les appels à B<setgroups>(2) ne sont pas aussi permis si I</proc/[pid]/gid_map> n’a pas encore été défini.

source: A privileged process (one with the B<CAP_SYS_ADMIN> capability in the namespace) may write either of the strings "I<allow>" or "I<deny>" to this file I<before> writing a group ID mapping for this user namespace to the file I</proc/[pid]/gid_map>. Writing the string "I<deny>" prevents any process in the user namespace from employing B<setgroups>(2).
de: Ein privilegierter Prozess (einer mit der Capability B<CAP_SYS_ADMIN> in dem Namensraum) darf eine der Zeichenketten »I<allow>« oder »I<deny>« in diese Datei schreiben, I<bevor> eine Gruppenkennungsabbildung für diesen Benutzernamensraum in die Datei I</proc/[PID]/gid_map> geschrieben wird. Durch Schreiben der Zeichenkette »I<deny>« wird jedem Prozess in diesem Benutzernamensraum der Einsatz von B<setgroups>(2) verboten.
fr: Un processus privilégié (un avec la capacité B<CAP_SYS_ADMIN> dans l’espace de noms) peut écrire une des chaînes « I<allow> » ou « I<deny> » dans ce fichier I<avant> d’écrire un mappage d’ID de groupe pour cet espace de noms utilisateur dans le fichier I</proc/[pid]/gid_map>. Écrire la chaîne « I<deny> » empêche tout processus dans l’espace de noms utilisateur d’employer B<setgroups>(2).

source: The essence of the restrictions described in the preceding paragraph is that it is permitted to write to I</proc/[pid]/setgroups> only so long as calling B<setgroups>(2) is disallowed because I</proc/[pid]/gid_map> has not been set. This ensures that a process cannot transition from a state where B<setgroups>(2) is allowed to a state where B<setgroups>(2) is denied; a process can transition only from B<setgroups>(2) being disallowed to B<setgroups>(2) being allowed.
de: Die Essenz der in den vorhergehenden Absätzen beschriebenen Beschränkungen ist, dass das Schreiben in I</proc/[PID]/setgroups> nur so lange erlaubt ist, wie B<setgroups>(2) nicht erlaubt ist, da I</proc/[PID]/gid_map> noch nicht gesetzt wurde. Damit wird sichergestellt, dass ein Prozess nicht von einem Zustand, bei dem B<setgroups>(2) erlaubt ist, zu einem Zustand, bei dem B<setgroups>(2) verboten ist, übergehen kann; ein Prozess kann nur von B<setgroups>(2) nicht erlaubt zu B<setgroups>(2) erlaubt übergehen.
fr: L’idée de ces restrictions décrites dans le paragraphe précédent est qu’il est permis d’écrire dans I</proc/[pid]/setgroups> seulement à condition que l’appel à B<setgroups>(2) est désactivé parce que I</proc/[pid]/gid_map> n’a pas été défini. Cela garantit qu’un processus ne peut transiter d’un état dans lequel B<setgroups>(2) est autorisé vers un état dans lequel B<setgroups>(2) est interdit. Un processus peut transiter seulement de B<setgroups>(2) interdit vers B<setgroups>(2) autorisé.

source: Once I</proc/[pid]/gid_map> has been written to (which has the effect of enabling B<setgroups>(2) in the user namespace), it is no longer possible to disallow B<setgroups>(2) by writing "I<deny>" to I</proc/[pid]/setgroups> (the write fails with the error B<EPERM>).
de: Sobald I</proc/[PID]/gid_map> geschrieben wurde (wodurch B<setgroups>(2) in dem Benutzernamensraum aktiviert wird), ist es nicht mehr möglich, B<setgroups>(2) durch Schreiben von »I<deny>« in I</proc/[PID]/setgroups> zu verbieten (das Schreiben schlägt mit B<EPERM> fehl).
fr: Une fois que I</proc/[pid]/gid_map> ait été écrit (ce qui a pour effet d’activer B<setgroups>(2) dans l’espace de noms utilisateur), il n’est plus possible de désactiver B<setgroups>(2) en écrivant « I<deny> » dans I</proc/[pid]/setgroups> (l’écriture échoue avec l’erreur B<EPERM>).

source: A child user namespace inherits the I</proc/[pid]/setgroups> setting from its parent.
de: Ein Nachfolgernamensraum erbt die Einstellungen I</proc/[PID]/setgroups> von seinem Vorgänger.
fr: Un espace de noms utilisateur enfant hérite du réglage I</proc/[pid]/setgroups> de son parent.

source: The I</proc/[pid]/setgroups> file was added in Linux 3.19, but was backported to many earlier stable kernel series, because it addresses a security issue. The issue concerned files with permissions such as "rwx---rwx". Such files give fewer permissions to "group" than they do to "other". This means that dropping groups using B<setgroups>(2) might allow a process file access that it did not formerly have. Before the existence of user namespaces this was not a concern, since only a privileged process (one with the B<CAP_SETGID> capability) could call B<setgroups>(2). However, with the introduction of user namespaces, it became possible for an unprivileged process to create a new namespace in which the user had all privileges. This then allowed formerly unprivileged users to drop groups and thus gain file access that they did not previously have. The I</proc/[pid]/setgroups> file was added to address this security issue, by denying any pathway for an unprivileged process to drop groups with B<setgroups>(2).
de: Die Datei I</proc/[PID]/setgroups> wurde in Linux 3.19 hinzugefügt; allerdings wurde sie auch auf viele frühere stabile Kernel rückportiert, da sie ein Sicherheitsproblem adressiert. Das Problem betraf Dateien mit Berechtigungen wie »rwx---rwx«. Diese Dateien geben der »Gruppe« weniger Berechtigungen als sie »anderen« geben. Das bedeutet, dass die Abgabe von Gruppen mittels B<setgroups>(2) einem Prozess Dateizugriff erlauben könnte, den er vorher nicht hatte. Vor der Existenz von Benutzernamensräumen führte dies zu keine Sorgen, da nur ein privilegierter Prozess (einer mit der Capability B<CAP_SETGID>) B<setgroups>(2) aufrufen konnte. Mit der Einführung von Benutzernamensräumen wurde es für einen nicht privilegierten Prozess allerdings möglich, einen neuen Namensraum zu erstellen, in dem der Benutzer alle Privilegien hatte. Dies ermöglichte es dann vorher nicht privilegierten Benutzern Gruppen abzugeben und damit Dateizugriff zu erlangen, den sie vorher nicht hatten. Die Datei I</proc/[PID]/setgroups> wurde hinzugefügt, um dieses Sicherheitsproblem zu adressieren, indem jeder Pfad für einen nicht privilegierten Prozess, Gruppen mit B<setgroups>(2) abzugeben, verboten wurde.
fr: Le fichier I</proc/[pid]/setgroups> a été ajouté dans Linux 3.19, mais a été rétroporté vers plusieurs séries stables du noyau car il corrige un problème de sécurité. Cela concernait les fichiers avec les permissions telles que « rwx---rwx ». De tels fichiers accordent moins de permissions au « group » qu’elles ne donnent à « other ». Cela signifie qu’abandonner les groupes utilisant B<setgroups>(2) peut permettre un accès au fichier du processus que celui-ci n’avait pas auparavant. Avant l’existence des espaces de noms utilisateur cela n’était pas un problème, puisque seul un processus privilégié (un avec la capacité B<CAP_SETGID>) pouvait appeler B<setgroups>(2). Cependant, avec l’introduction des espaces de noms utilisateur, il est devenu possible pour un processus non privilégié de créer un nouvel espace de noms dans lequel l’utilisateur a tous les privilèges. Cela permet alors à des utilisateurs anciennement non privilégiés d’abandonner les groupes et donc obtenir l’accès à des fichiers auxquels ils ne pouvaient pas accéder. Le fichier I</proc/[pid]/setgroups> a été ajouté pour régler le problème de sécurité en refusant à tout chemin pour un processus non privilégié d’abandonner les groupes avec B<setgroups>(2).

source: The cases where unmapped IDs are mapped in this fashion include system calls that return user IDs (B<getuid>(2), B<getgid>(2), and similar), credentials passed over a UNIX domain socket, credentials returned by B<stat>(2), B<waitid>(2), and the System V IPC "ctl" B<IPC_STAT> operations, credentials exposed by I</proc/[pid]/status> and the files in I</proc/sysvipc/*>, credentials returned via the I<si_uid> field in the I<siginfo_t> received with a signal (see B<sigaction>(2)), credentials written to the process accounting file (see B<acct>(5)), and credentials returned with POSIX message queue notifications (see B<mq_notify>(3)).
de: Zu den Fällen, in denen nicht abgebildete Benutzerkennungen auf diese Art abgebildet werden, gehören Systemaufrufe, die Benutzerkennungen zurückliefern (B<getuid>(2), B<getgid>(2) und ähnliche), Benutzerberechtigungen, die über ein UNIX-Domain-Socket übergeben werden, Benutzerberechtigungen, die von B<stat>(2), B<waitid>(2) und den System-V-IPC-»ctl«-B<IPC_STAT>-Aktionen zurückgeliefert werden, Benutzerberechtigungen, die mittels I</proc/[PID]/status> und den Dateien in I</proc/sysvipc/*> offengelegt werden, Benutzerberechtigungen, die über das Feld I<si_uid> in dem mit einem Signal I<siginfo_t> empfangenen Feld zurückgeliefert werden (siehe B<sigaction>(2)), Benutzerberechtigungen, die in die Prozessbuchhaltungsdatei geschrieben werden (siehe B<acct>(5)) und Benutzerberechtigungen, die mit POSIX-Nachrichtenwarteschlangen-Benachrichtigungen zurückgeliefert werden (siehe B<mq_notify>(3)).
fr: Les situations dans lesquelles des identifiants non mappés sont transformés de cette façon comprennent les cas des appels système qui renvoient des identifiants utilisateur (B<getuid>(2), B<getgid>(2) et les appels similaires), les accréditations passées à l’aide d’un socket de domaine UNIX, les accréditations renvoyées par B<stat>(2), B<waitid>(2) et les autres opérations IPC « ctl » B<IPC_STAT> de System V, les accréditations présentées par I</proc/[pid]/status> et les fichiers I</proc/sysvipc/*>, les accréditations renvoyées par le champ I<si_uid> de I<siginfo_t> reçues avec un signal (consultez B<sigaction>(2)), les accréditations écrites dans le fichier du processus de tenue des comptes (consultez B<acct>(5)) et les accréditations renvoyées avec des notifications de files de messages POSIX (consultez B<mq_notify>(3)).

source: CONFORMING TO
de: KONFORM ZU
fr: CONFORMITÉ

source: Create a child process that executes a shell command in new namespace(s); allow UID and GID mappings to be specified when creating a user namespace. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
de: Erzeugt einen Kindprozess, der einen Shell-Befehl in einem oder mehreren neuen Namensräumen ausführt; erlaubt UID- und GID-Abbildungen anzugeben, wenn ein Benutzernamensraum erstellt wird */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
fr: Créer un processus enfant qui exécute une commande de shell dans un nouvel espace de noms. Il permet de préciser les mappages d'identifiants utilisateur et groupe lors de la création d’un nouvel espace de noms utilisateur. #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>

source: /* A simple error-handling function: print an error message based on the value in \(aqerrno\(aq and terminate the calling process */
de: /* Eine einfache Fehlerbehandlungsfunktion; gibt basierend auf dem Wert in »errno« eine Fehlermeldung aus und beendet den aufrufenden Prozess*/
fr: /* Une fonction de gestion des erreurs simple : afficher un message d'erreur dépendant de la valeur de \(aqerrno\(aq et terminer le processus appelant. */

source: #define errExit(msg) do { perror(msg); exit(EXIT_FAILURE); \e } while (0)
de: #define errExit(Nachricht) do { perror(Nachricht); exit(EXIT_FAILURE); \e } while (0)

source: /* Replace commas in mapping string with newlines */
de: /* Kommata durch Zeilenumbrüche in Abbildungszeichenkette ersetzen. */
fr: /* Remplacer les virgules de la chaîne de mappage avec des retours à la ligne */

source: close(args-E<gt>pipe_fd[1]); /* Close our descriptor for the write end of the pipe so that we see EOF when parent closes its descriptor */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Failure in child: read from pipe returned != 0\en"); exit(EXIT_FAILURE); }
de: close(args-E<gt>pipe_fd[1]); /* Unseren Deskriptor für das Ende des Schreibens schließen, so dass wir EOF sehen, wenn der Elternprozess seinen Deskriptor schließt. */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Fehler im Kind: Lesen von der Pipe lieferte != 0\en"); exit(EXIT_FAILURE); }
fr: close(args-E<gt>pipe_fd[1]); /* Fermer notre descripteur à la fin d’écriture du tube afin de présenter EOF lorsque le parent ferme son descripteur */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Échec du fils : donnée renvoyée par le tube != 0\en"); exit(EXIT_FAILURE); }

source: /* Execute a shell command */
de: /* Einen Shell-Befehl ausführen. */
fr: /* Lancer une commande de shell */

source: printf("About to exec %s\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); errExit("execvp"); }
de: printf("Gleich wird exec %s ausgeführt\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); errExit("execvp"); }

source: /* Create the child in new namespace(s) */
de: /* Den Kindprozess in dem oder den neuen Namensraum/-räumen erstellen. */
fr: /* Création de l’enfant dans le ou les nouveaux espaces de noms */

source: /* Parent falls through to here */
de: /* Elternprozess fällt bis hierher durch */
fr: /* Le parent se retrouve ici */

source: /* Update the UID and GID maps in the child */
de: /* Die UID- und GID-Abbildungen in dem Kindprozess aktualisieren. */
fr: /* Mise à jour des mappages d’UID et de PID pour l’enfant */

source: /* Close the write end of the pipe, to signal to the child that we have updated the UID and GID maps */
de: /* Das Schreibe-Ende der Pipe schließen, um dem Kindprozess zu signalisieren, dass wir die UID- und GID-Abbildungen aktualisiert haben. */
fr: /* Fermer le côté écriture du tube afin d'indiquer à l’enfant que les mappages d'UID et de GID ont été mis à jour */

source: if (waitpid(child_pid, NULL, 0) == -1) /* Wait for child */ errExit("waitpid");
de: if (waitpid(child_pid, NULL, 0) == -1) /* Warten auf Kindprozess */ errExit("waitpid");
fr: if (waitpid(child_pid, NULL, 0) == -1) /* Attente de l’enfant */ errExit("waitpid");

source: The kernel source file I<Documentation/namespaces/resource-control.txt>.
de: Die Kernelquelldatei I<Documentation/namespaces/resource-control.txt>.
fr: Le fichier I<Documentation/namespaces/resource-control.txt> des sources du noyau.

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: In order for a process to write to the I</proc/[pid]/uid_map> (I</proc/[pid]/gid_map>) file, all of the following permission requirements must be met:
de: Damit ein Prozess in die Datei I</proc/[PID]/uid_map> (I</proc/[PID]/gid_map>) schreiben kann, müssen alle der folgenden Berechtigungsanforderungen erfüllt sein:

source: If updating I</proc/[pid]/uid_map> to create a mapping that maps UID 0 in the parent namespace, then one of the following must be true:
de: Falls die Aktualisierung von I</proc/[PID]/uid_map> eine Abbildung erstellt, die die UID 0 in dem Vorgängernamensraum abbildet, dann muss eine der folgenden Bedingungen wahr sein:

source: Project ID mappings are defined by writing to the I</proc/[pid]/projid_map> file (present since Linux 3.7).
de: Projektkennungsabbildungen werden durch Schreiben in die Datei I</proc/[PID]/projid_map> definiert (vorhanden seit Linux 3.7).

source: The validity rules for writing to the I</proc/[pid]/projid_map> file are as for writing to the I<uid_map> file; violation of these rules causes B<write>(2) to fail with the error B<EINVAL>.
de: Die Gültigkeitsregeln für das Schreiben in die Datei I</proc/[PID]/projid_map> sind wie beim Schreiben in die Datei I<uid_map>; Verletzung dieser Regeln führt beim B<write>(2) zum Fehlschlag B<EINVAL>.

source: The permission rules for writing to the I</proc/[pid]/projid_map> file are as follows:
de: Die Erlaubnisregeln für das Schreiben in die Datei I</proc/[PID]/projid_map> sind wie folgt:

source: /* A simple error-handling function: print an error message based on the value in \(aqerrno\(aq and terminate the calling process. */
de: /* Eine einfache Fehlerbehandlungsfunktion; gibt basierend auf dem Wert in »errno« eine Fehlermeldung aus und beendet den aufrufenden Prozess. */
fr: /* Une fonction de gestion des erreurs simple : afficher un message d'erreur dépendant de la valeur de \(aqerrno\(aq et terminer le processus appelant. */

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: A call to B<clone>(2), B<unshare>(2), or B<setns>(2) using the B<CLONE_NEWUSER> flag sets the "securebits" flags (see B<capabilities>(7)) to their default values (all flags disabled) in the child (for B<clone>(2)) or caller (for B<unshare>(2), or B<setns>(2)). Note that because the caller no longer has capabilities in its original user namespace after a call to B<setns>(2), it is not possible for a process to reset its "securebits" flags while retaining its user namespace membership by using a pair of B<setns>(2) calls to move to another user namespace and then return to its original user namespace.
de: Ein Aufruf von B<clone>(2), B<unshare>(2) oder B<setns>(2) mit dem Schalter B<CLONE_NEWUSER> setzt die Schalter »securebits« (siehe B<capabilities>(7)) im Kind (für B<clone>(2)) oder dem Aufrufenden (für B<unshare>(2) oder B<setns>(2)) auf ihre Vorgabewerte (alle Schalter deaktiviert). Beachten Sie, dass der Aufrufende nach einem Aufruf von B<setns>(2) keine Capabilitys in seinem ursprünglichen Benutzernamensraum mehr hat und es daher für einen Prozess nicht möglich ist, seine Schalter »securebits« zurückzusetzen und gleichzeitig seine Mitgliedschaft im Benutzernamensraum zu erhalten, indem ein Paar von B<setns>(2)-Aufrufen verwandt wird, um sich in einen anderen Benutzernamensraum zu verschieben und dann zu seinem ursprünglichen Namensraum zurückzukehren.
fr: Un appel à B<clone>(2), B<unshare>(2) ou B<setns>(2) avec l'attribut B<CLONE_NEWUSER> positionne les attributs « securebits » (consultez B<capabilities>(7)) à leurs valeurs par défaut (tous les attributs désactivés) pour l’enfant (dans le cas d'un appel à B<clone>(2)) ou pour le processus appelant (dans le cas d'un appel à B<unshare>(2) ou à B<setns>(2)). Notez qu'après un appel à B<setns>(2), l'appelant a perdu ses capacités dans son espace de noms utilisateur initial. Un processus ne peut donc pas réinitialiser ses attributs « securebits » lorsqu'il conserve son appartenance à un espace de noms utilisateur en utilisant deux fois l'appel B<setns>(2) pour passer dans un autre espace de noms utilisateur, avant de revenir dans l'espace de noms utilisateur initial.
