Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: static void usage(char *pname) { fprintf(stderr, "Usage: %s [options] cmd [arg...]\en\en", pname); fprintf(stderr, "Create a child process that executes a shell " "command in a new user namespace,\en" "and possibly also other new namespace(s).\en\en"); fprintf(stderr, "Options can be:\en\en"); #define fpe(str) fprintf(stderr, " %s", str); fpe("-i New IPC namespace\en"); fpe("-m New mount namespace\en"); fpe("-n New network namespace\en"); fpe("-p New PID namespace\en"); fpe("-u New UTS namespace\en"); fpe("-U New user namespace\en"); fpe("-M uid_map Specify UID map for user namespace\en"); fpe("-G gid_map Specify GID map for user namespace\en"); fpe("-z Map user\(aqs UID and GID to 0 in user namespace\en"); fpe(" (equivalent to: -M \(aq0 E<lt>uidE<gt> 1\(aq -G \(aq0 E<lt>gidE<gt> 1\(aq)\en"); fpe("-v Display verbose messages\en"); fpe("\en"); fpe("If -z, -M, or -G is specified, -U is required.\en"); fpe("It is not permitted to specify both -z and either -M or -G.\en"); fpe("\en"); fpe("Map strings for -M and -G consist of records of the form:\en"); fpe("\en"); fpe(" ID-inside-ns ID-outside-ns len\en"); fpe("\en"); fpe("A map string can contain multiple records, separated" " by commas;\en"); fpe("the commas are replaced by newlines before writing" " to map files.\en");
de: static void usage(char *pname) { fprintf(stderr, "Aufruf: %s [Optionen] Bef [Arg…]\en\en", pname); fprintf(stderr, "Erstellt einen Kindprozess, der einen Shellbefehl " "in einem neuen Benutzernamensraum ausführt\en" "und möglicherweise auch anderen neuen Namensräumen.\en\en"); fprintf(stderr, "Optionen können sein:\en\en"); #define fpe(str) fprintf(stderr, " %s", str); fpe("-i Neuer IPC-Namensraum\en"); fpe("-m Neuer Einhänge-Namensraum\en"); fpe("-n Neuer Netzwerk-Namensraum\en"); fpe("-p Neuer PID-Namensraum\en"); fpe("-u Neuer UTS-Namensraum\en"); fpe("-U Neuer Benutzernamensraum\en"); fpe("-M uid_map Angabe einer UID-Abbildung für Benutzernamensraum\en"); fpe("-G gid_map Angabe einer GID-Abbildung für Benutzernamensraum\en"); fpe("-z Benutzer-UID und -GID auf 0 im Benutzernamensraum abbilden\en"); fpe(" (äquivalent zu: -M \(aq0 E<lt>uidE<gt> 1\(aq -G \(aq0 E<lt>gidE<gt> 1\(aq)\en"); fpe("-v Anzeige ausführlicher Meldungen\en"); fpe("\en"); fpe("Falls -z, -M oder -G angegeben wird, ist -U verpflichtend.\en"); fpe("Es ist nicht erlaubt, sowohl -z als auch entweder -M oder -G anzugeben.\en"); fpe("\en"); fpe("Abbildungszeichenketten für -M und -G bestehen aus Datensätzen der folgenden Form:\en"); fpe("\en"); fpe(" Namensrauminterne-Kennung Namensraumexterne-Kennung Länge\en"); fpe("\en"); fpe("Eine Abbildungszeichenkette kann mehrere Datensätze enthalten," " getrennt durch Kommata;\en"); fpe("die Kommata werden vor dem Schreiben in die Abbildungsdateien durch" " Zeilenumbrüche ersetzt.\en");
fr: static void usage(char *pname) { fprintf(stderr, "Utilisation: %s [options] cmd [arg...]\en\en", pname); fprintf(stderr, "Créer un processus enfant qui exécute une invite " "de commandes dans un nouvel espace de noms utilisateur et\en" "éventuellement au moins un nouvel espace de noms.\en\en"); fprintf(stderr, "Les options sont :\en\en"); #define fpe(str) fprintf(stderr, " %s", str); fpe("-i Nouvel espace de noms IPC\en"); fpe("-m Nouvel espace de noms de montage\en"); fpe("-n Nouvel espace de noms réseau \en"); fpe("-p Nouvel espace de noms PID\en"); fpe("-u Nouvel espace de noms UTS\en"); fpe("-U Nouvel espace de noms utilisateur\en"); fpe("-M uid_map Mappage UID pour l'espace de noms utilisateur\en"); fpe("-G gid_map Mappage GID pour l'espace de noms utilisateur\en"); fpe("-z Mappage des UID et GID à 0 dans l'espace de noms utilisateur\en"); fpe(" (équivalent à: -M \(aq0 E<lt>uidE<gt> 1\(aq -G \(aq0 E<lt>gidE<gt> 1\(aq)\en"); fpe("-v Affichage détaillé\en"); fpe("\en"); fpe("Si -z, -M, or -G est invoqué, -U doit être précisé.\en"); fpe("Il n'est pas possible d'utiliser -z et soit -M, soit -G.\en"); fpe("\en"); fpe("Les chaînes de mappages pour -M et -G se composent" "d'enregistrements de la forme :\en"); fpe("\en"); fpe(" ID-inside-ns ID-outside-ns len\en"); fpe("\en"); fpe("Une chaîne de mappage peut contenir plusieurs" "enregistrements séparés par des virgules;\en"); fpe("les virgules sont remplacées par des retours à la ligne" "avant l'écriture des fichiers de mappage.\en");

source: /* Update the mapping file \(aqmap_file\(aq, with the value provided in \(aqmapping\(aq, a string that defines a UID or GID mapping. A UID or GID mapping consists of one or more newline-delimited records of the form:
de: /* Aktualisiert die Abbildungsdatei »Datei« mit dem in »Abbildung« bereitgestellten Wert, einer Zeichenkette, die eine UID- oder GID- Abbildung definiert. Eine UID- oder GID-Abbildung besteht aus einem oder mehreren, durch Zeilenumbrüche getrennten Datensätzen der folgenden Form:
fr: /* Mise à jour du fichier de mappage \(aqmap_file\(aq, avec la valeur fournie dans \(aqmapping\(aq, une chaîne qui définit un mappage d'identifiant utilisateur ou groupe. Un mappage d'identifiant d'utilisateur ou groupe se compose d'un ou plusieurs enregistrements séparés par des retours à la ligne de la forme suivante :

source: ID_inside-ns ID-outside-ns length
de: Namensrauminterne-Kennung Namensraumexterne-Kennung Länge
fr: ID_dans-Espace ID-hors-Espace longueur

source: Requiring the user to supply a string that contains newlines is of course inconvenient for command-line use. Thus, we permit the use of commas to delimit records in this string, and replace them with newlines before writing the string to the file. */
de: Für die Befehlszeile zu verlangen, dass Zeichenketten mit Zeilenumbrüchen bereitgestellt werden, ist natürlich unbequem. Daher erlauben wir die Verwendung von Kommata zur Begrenzung von Datensätzen in dieser Zeichenkette und ersetzen sie vor dem Schreiben in die Datei durch Zeilenumbrüche. */
fr: La nécessité de fournir une chaîne qui contienne des retours à la ligne ne convient pas bien à une utilisation en ligne de commande. C'est pour cette raison que l'utilisation des virgules pour délimiter les champs de la chaîne est autorisée. Celles-ci sont remplacées par des retours à la ligne avant l'écriture de la chaîne dans le fichier. */

source: static void update_map(char *mapping, char *map_file) { int fd; size_t map_len; /* Length of \(aqmapping\(aq */
de: static void update_map(char *mapping, char *map_file) { int fd; size_t map_len; /* Länge der »Abbildung« */
fr: static void update_map(char *mapping, char *map_file) { int fd; size_t map_len; /* Longueur de \(aqmapping\(aq */

source: /* Replace commas in mapping string with newlines. */
de: /* Kommata durch Zeilenumbrüche in Abbildungszeichenkette ersetzen. */
fr: /* Remplacer les virgules de la chaîne de mappage par des retours à la ligne */

source: fd = open(map_file, O_RDWR); if (fd == -1) { fprintf(stderr, "ERROR: open %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }
de: fd = open(map_file, O_RDWR); if (fd == -1) { fprintf(stderr, "FEHLER: open %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }

source: if (write(fd, mapping, map_len) != map_len) { fprintf(stderr, "ERROR: write %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }
de: if (write(fd, mapping, map_len) != map_len) { fprintf(stderr, "FEHLER: write %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }

source: /* Linux 3.19 made a change in the handling of setgroups(2) and the \(aqgid_map\(aq file to address a security issue. The issue allowed *unprivileged* users to employ user namespaces in order to drop The upshot of the 3.19 changes is that in order to update the \(aqgid_maps\(aq file, use of the setgroups() system call in this user namespace must first be disabled by writing "deny" to one of the /proc/PID/setgroups files for this namespace. That is the purpose of the following function. */
de: /* Linux 3.19 änderte die Handhabung von setgroups(2) und die Datei »gid_map«, um ein Sicherheitsproblem zu adressieren. Das Problem erlaubte *nicht privilegierten* Benutzern einen Benutzernamensraum einzusetzen, um abzugeben. Das Fazit der 3.19er Änderung ist, dass die Verwendung des Systemaufrufs setgroups() in diesem Benutzernamensraum zuerst durch Schreiben von »deny« in eine der Dateien /proc/PID/setgroups für diesen Namensraum erfolgen muss, damit die Datei »gid_maps« aktualisert wird. Das ist der Zweck der folgenden Funktion. */
fr: /* Linux 3.19 a modifié la gestion de setgroups(2) et le fichier \(aqgid_map\(aq pour corriger le problème de sécurité. Celui-ci permet aux utilisateurs *non privilégiés* d’employer des espaces de noms utilisateur pour aboutir. Le résultat des modifications de 3.19 est que dans le but de mettre à jour le fichier \(aqgid_maps\(aq, l’utilisation de l’appel système setgroups() dans cet espace de noms utilisateur doit d’abord être désactivée en écrivant « deny » dans un des fichiers /proc/PID/setgroups pour cet espace de noms. C’est le but de la fonction suivante. */

source: /* We may be on a system that doesn\(aqt support /proc/PID/setgroups. In that case, the file won\(aqt exist, and the system won\(aqt impose the restrictions that Linux 3.19 added. That\(aqs fine: we don\(aqt need to do anything in order to permit \(aqgid_map\(aq to be updated.
de: /* Vielleicht sind wir auf einem System, das /proc/PID/setgroups nicht unterstützt. Dann wird diese Datei nicht existieren und das System wird nicht die Beschränkungen erzwingen, die Linux 3.19 hinzugefügt hat. Das ist OK, wir brauchen nichts zu machen, damit »gid_map« aktualisiert wird.
fr: /* Nous sommes peut être sur un système qui ne gère pas /proc/PID/setgroups. Dans ce cas, le fichier n’existe pas et le système n’impose pas les restrictions que Linux 3.19 a ajoutées. Bien, nous n’avons pas besoin de faire quelque chose pour permettre la mise à jour de \(aqgid_map\(aq.

source: However, if the error from open() was something other than the ENOENT error that is expected for that case, let the user know. */
de: Falls allerdings der Fehler von open() sich von ENOENT unterscheidet (der in diesem Fall zu erwarten ist), informieren wir den Benutzer. */
fr: Cependant, si l’erreur d’open() était quelque chose autre que l’erreur ENOENT attendue dans ce cas, faisons que l’utilisateur le sache. */

source: if (errno != ENOENT) fprintf(stderr, "ERROR: open %s: %s\en", setgroups_path, strerror(errno)); return; }
de: if (errno != ENOENT) fprintf(stderr, "FEHLER: open %s: %s\en", setgroups_path, strerror(errno)); return; }

source: if (write(fd, str, strlen(str)) == -1) fprintf(stderr, "ERROR: write %s: %s\en", setgroups_path, strerror(errno));
de: if (write(fd, str, strlen(str)) == -1) fprintf(stderr, "FEHLER: write %s: %s\en", setgroups_path, strerror(errno));

source: static int /* Start function for cloned child */ childFunc(void *arg) { struct child_args *args = arg; char ch;
de: static int /* Funktion für geklontes Kind starten */ childFunc(void *arg) { struct child_args *args = arg; char ch;
fr: static int /* Lancer la fonction pour l’enfant cloné */ childFunc(void *arg) { struct child_args *args = arg; char ch;

source: /* Wait until the parent has updated the UID and GID mappings. See the comment in main(). We wait for end of file on a pipe that will be closed by the parent process once it has updated the mappings. */
de: /* Warten, bis der Elternprozess seine UID- und GID-Abbildungen aktualisiert hat. Siehe den Kommentar in main(). Wir warten, bis auf einer Pipe das Dateiende kommt, die vom Elternprozess geschlossen wird, sobald er seine Abbildungen aktualisiert hat. */
fr: /* Attendre que le parent ait mis à jour les mappages d'identifiants d'utilisateur et de groupe. Consultez le commentaire de main(). On attend le signal de fin de fichier dans le tube qui sera fermé par le processus parent lorsque les mappages seront mis à jour. */

source: close(args-E<gt>pipe_fd[1]); /* Close our descriptor for the write end of the pipe so that we see EOF when parent closes its descriptor. */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Failure in child: read from pipe returned != 0\en"); exit(EXIT_FAILURE); }
de: close(args-E<gt>pipe_fd[1]); /* Unseren Deskriptor für das Ende des Schreibens schließen, so dass wir EOF sehen, wenn der Elternprozess seinen Deskriptor schließt. */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Fehler im Kind: Lesen von der Pipe lieferte != 0\en"); exit(EXIT_FAILURE); }
fr: close(args-E<gt>pipe_fd[1]); /* Fermer notre descripteur à la fin d’écriture du tube afin de présenter EOF lorsque le parent ferme son descripteur */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Échec dans l’enfant : donnée renvoyée par le tube != 0\en"); exit(EXIT_FAILURE); }

source: /* Execute a shell command. */
de: /* Einen Shell-Befehl ausführen. */
fr: /* Lancer une commande de shell */

source: printf("About to exec %s\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); err(EXIT_FAILURE, "execvp"); }
de: printf("Gleich wird exec %s ausgeführt\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); err(EXIT_FAILURE, "execvp"); }

source: static char child_stack[STACK_SIZE]; /* Space for child\(aqs stack */
de: static char child_stack[STACK_SIZE]; /* Platz für den Stack des Kindes */
fr: static char child_stack[STACK_SIZE]; /* Espace pour la pile de l’enfant */

source: /* Parse command-line options. The initial \(aq+\(aq character in the final getopt() argument prevents GNU-style permutation of command-line options. That\(aqs useful, since sometimes the \(aqcommand\(aq to be executed by this program itself has command-line options. We don\(aqt want getopt() to treat those as options to this program. */
de: /* Befehlszeilenoptionen auswerten. Das anfängliche »+«-Zeichen in dem abschließenden getopt()-Argument verhindert GNU-artige Vertauschungen der Befehlszeilenoptionen. Das ist nützlich, da manchmal der von diesem Programm selbst ausgeführte »Befehl« über Befehlszeilenoptionen verfügt. Wir wollen nicht, dass getopt() solche als Optionen für dieses Programm behandelt. */
fr: /* Analyser les options de la ligne de commande. Le caractère \(aq+\(aq initial de l'argument final de getopt() empêche la permutation des options de la ligne de commande de style GNU. Cela peut être utile dans les cas où la \(aqcommande\(aq exécutée par le programme lui-même a des options de ligne de commande. Cela évite que getopt() ne traite ces options comme étant celles du programme */

source: /* -M or -G without -U is nonsensical */
de: /* -M oder -G ohne -U ist sinnlos */
fr: /* -M ou -G sans -U est incohérent */

source: /* We use a pipe to synchronize the parent and child, in order to ensure that the parent sets the UID and GID maps before the child calls execve(). This ensures that the child maintains its capabilities during the execve() in the common case where we want to map the child\(aqs effective user ID to 0 in the new user namespace. Without this synchronization, the child would lose its capabilities if it performed an execve() with nonzero user IDs (see the capabilities(7) man page for details of the transformation of a process\(aqs capabilities during execve()). */
de: /* Wir verwenden eine Pipe, um den Eltern- und Kindprozess zu synchronisieren, damit sichergestellt wird, dass der Elternprozess die UID- und GID-Abbildungen einrichtet, bevor der Kindprozess execve() aufruft. Dies stellt sicher, dass das Kind seine Capabilitys während des execve() erhält, wenn der typische Fall vorliegt, dass wir möchten, dass die effektive Benutzerkennung des Kindprozesses auf 0 in dem neuen Benutzernamensraum abgebildet wird. Ohne diese Synchronisation würde der Kindprozess seine Capabilitys verlieren, falls es ein execve() mit einer von Null verschiedenen Benutzerkennung durchführen würde (siehe die Handbuchseite capabilities(7) für Details des Übergangs der Capabilitys eines Prozesses während execve()). */
fr: /* L'utilisation d'un tube pour réaliser la synchronisation du parent et de l’enfant a pour but d'obliger le parent à définir les mappages d'identifiants utilisateur et groupe avant que l’enfant n'appelle execve(). Cela permet d'assurer que l’enfant conserve ses capacités pendant l'exécution de execve() dans le cas classique où l'on souhaite mapper l’identifiant utilisateur effectif de l’enfant avec 0 dans le nouvel espace de noms utilisateur. Sans cette synchronisation, l’enfant perdrait ses capacités s'il effectuait execve() avec un identifiant utilisateur autre que 0 (consultez la page du manuel consacrée à capabilities(7) pour plus de détails sur la modification des capacités d'un processus lors de l'exécution de execve()). */

source: /* Create the child in new namespace(s). */
de: /* Den Kindprozess in dem oder den neuen Namensraum/-räumen erstellen. */
fr: /* Création de l’enfant dans le ou les nouveaux espaces de noms. */

source: /* Parent falls through to here. */
de: /* Elternprozess fällt bis hierher durch. */
fr: /* Le parent se retrouve ici. */

source: if (verbose) printf("%s: PID of child created by clone() is %jd\en", argv[0], (intmax_t) child_pid);
de: if (verbose) printf("%s: PID des durch clone() erstellten Kindprozesses lautet %jd\en", argv[0], (intmax_t) child_pid);
fr: if (verbose) printf("%s: le PID de l’enfant créé par clone() est %jd\en", argv[0], (intmax_t) child_pid);

source: /* Update the UID and GID maps in the child. */
de: /* Die UID- und GID-Abbildungen in dem Kindprozess aktualisieren. */
fr: /* Mise à jour des mappages de l'UID et du PID pour l’enfant. */

source: /* Close the write end of the pipe, to signal to the child that we have updated the UID and GID maps. */
de: /* Das Schreibe-Ende der Pipe schließen, um dem Kindprozess zu signalisieren, dass wir die UID- und GID-Abbildungen aktualisiert haben. */
fr: /* Fermer le côté écriture du tube afin d'indiquer à l’enfant que les mappages d'UID et de GID ont été mis à jour */

source: if (waitpid(child_pid, NULL, 0) == -1) /* Wait for child */ err(EXIT_FAILURE, "waitpid");
de: if (waitpid(child_pid, NULL, 0) == -1) /* Warten auf Kindprozess */ err(EXIT_FAILURE, "waitpid");

source: if (verbose) printf("%s: terminating\en", argv[0]);
de: if (verbose) printf("%s: beende\en", argv[0]);
fr: if (verbose) printf("%s: fin d'exécution\en", argv[0]);

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: The kernel source file I<Documentation/admin-guide/namespaces/resource-control.rst>.
de: Die Kernelquelldatei I<Documentation/admin-guide/namespaces/resource-control.rst>.

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux

source: Note however, that mounting block-based filesystems can be done only by a process that holds B<CAP_SYS_ADMIN> in the initial user namespace.
de: Beachten Sie, dass das Einhängen blockbasierter Dateisysteme nur von Prozessen erfolgen kann, die B<CAP_SYS_ADMIN> in dem anfänglichen Benutzernamensraum enthalten.
fr: Remarquez cependant que le montage de systèmes de fichiers basés sur les blocs peut être réalisé seulement par un processus ayant B<CAP_SYS_ADMIN> dans l’espace de noms utilisateur initial.

source: When a user namespace is created, it starts out without a mapping of user IDs (group IDs) to the parent user namespace. The I</proc/[pid]/uid_map> and I</proc/[pid]/gid_map> files (available since Linux 3.5) expose the mappings for user and group IDs inside the user namespace for the process I<pid>. These files can be read to view the mappings in a user namespace and written to (once) to define the mappings.
de: Wenn ein Benutzernamensraum erstellt wird, beginnt er mit einer Abbildung der Benutzerkennungen (Gruppenkennungen) auf die des Vorgängernamensraumes. Die Dateien I</proc/[PID]/uid_map> und I</proc/[PID]/gid_map> (verfügbar seit Linux 3.5) legen diese Abbildungen für die Benutzer- und Gruppenkennungen innerhalb des Benutzernamensraumes für den Prozess I<PID> offen. Diese Dateien können ausgelesen werden, um die Abbildungen innerhalb eines Benutzernamensraums zu betrachten und (einmal) beschrieben zu werden, um diese Abbildungen zu definieren.
fr: Lorsqu'un espace de noms utilisateur est créé, il s'initialise sans établir de mappage entre ses identifiants utilisateurs (identifiants de groupes) et ceux de l'espace de noms parent. Les fichiers I</proc/[pid]/uid_map> et I</proc/[pid]/gid_map> présentent (à partir de Linux 3.5) le mappage entre identifiants utilisateur et groupe à l'intérieur de l'espace de noms utilisateur pour le processus I<pid>. Ces fichiers peuvent être consultés pour prendre connaissance des mappages dans un espace de noms utilisateur et peuvent être modifiés (une seule fois) pour définir les mappages.

source: This mapping tells us that the range starting at user ID 0 in this namespace maps to a range starting at 0 in the (nonexistent) parent namespace, and the length of the range is the largest 32-bit unsigned integer. This leaves 4294967295 (the 32-bit signed -1 value) unmapped. This is deliberate: I<(uid_t)\ -1> is used in several interfaces (e.g., B<setreuid>(2)) as a way to specify "no user ID". Leaving I<(uid_t)\ -1> unmapped and unusable guarantees that there will be no confusion when using these interfaces.
de: Diese Abbildung teilt uns mit, dass der Bereich bei der Benutzerkennung 0 in diesem Namensraum auf den Bereich beginnend bei 0 in dem (nicht existierenden) Vorgängernamensraum abgebildet ist und die Länge des Bereichs die größte vorzeichenlose 32-bit-Ganzzahl ist. Dies lässt 4294967295 (der vorzeichenbehaftete 32-bit-Wert) nicht abgebildet. Dies ist absichtlich: I<(uid_t)\ -1> wird von einer Reihe von Schnittstellen (z.B. B<setreuid>(2)) dazu verwandt, »keine Benutzerkennung« festzulegen. Da I<(uid_t)\ -1> nicht abgebildet und unbenutzbar ist, wird sichergestellt, dass es keine Verwirrung bei der Verwendung dieser Schnittstellen gibt.
fr: Ce mappage nous indique que l'intervalle commençant avec l'identifiant utilisateur 0 dans cet espace de noms mappe avec un intervalle commençant à 0 dans l'espace de noms parent (qui n'existe pas), et que la longueur de cet intervalle est la valeur du plus grand entier 32 bits non signé. Cela laisse 4294967295 (la valeur 32 bits signé moins 1) non mappé. Cela est voulu : I<(uid_t)\ -1> est utilisé dans plusieurs interfaces (par exemple, B<setreuid>(2)) comme façon d’indiquer « pas d’ID utilisateur ». Laisser I<(uid_t)\ -1> non mappé et inutilisable garantit qu’il n’y aura aucune confusion lors de l’utilisation de ces interfaces.

source: The lines written to I<uid_map> (I<gid_map>) must conform to the following rules:
de: Die in I<uid_map> (I<gid_map>) geschriebenen Zeilen müssen die folgenden Regeln erfüllen:
fr: Les lignes inscrites dans I<uid_map> (I<gid_map>) doivent suivre les règles suivantes :

source: In order for a process to write to the I</proc/[pid]/uid_map> (I</proc/[pid]/gid_map>) file, all of the following requirements must be met:
de: Damit ein Prozess in die Datei I</proc/[PID]/uid_map> (I</proc/[PID]/gid_map>) schreiben kann, müssen alle der folgenden Anforderungen erfüllt sein:
fr: Un processus ne peut écrire dans le fichier I</proc/[pid]/uid_map> (I</proc/[pid]/gid_map>) qu'à la condition de respecter les contraintes suivantes :
