Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: The cases where unmapped IDs are mapped in this fashion include system calls that return user IDs (B<getuid>(2), B<getgid>(2), and similar), credentials passed over a UNIX domain socket, credentials returned by B<stat>(2), B<waitid>(2), and the System V IPC "ctl" B<IPC_STAT> operations, credentials exposed by I</proc/>pidI</status> and the files in I</proc/sysvipc/*>, credentials returned via the I<si_uid> field in the I<siginfo_t> received with a signal (see B<sigaction>(2)), credentials written to the process accounting file (see B<acct>(5)), and credentials returned with POSIX message queue notifications (see B<mq_notify>(3)).
de: Zu den Fällen, in denen nicht abgebildete Benutzerkennungen auf diese Art abgebildet werden, gehören Systemaufrufe, die Benutzerkennungen zurückliefern (B<getuid>(2), B<getgid>(2) und ähnliche), Benutzerberechtigungen, die über ein UNIX-Domain-Socket übergeben werden, Benutzerberechtigungen, die von B<stat>(2), B<waitid>(2) und den System-V-IPC-»ctl«-B<IPC_STAT>-Aktionen zurückgeliefert werden, Benutzerberechtigungen, die mittels I</proc/>PIDI</status> und den Dateien in I</proc/sysvipc/*> offengelegt werden, Benutzerberechtigungen, die über das Feld I<si_uid> in dem mit einem Signal I<siginfo_t> empfangenen Feld zurückgeliefert werden (siehe B<sigaction>(2)), Benutzerberechtigungen, die in die Prozessbuchhaltungsdatei geschrieben werden (siehe B<acct>(5)) und Benutzerberechtigungen, die mit POSIX-Nachrichtenwarteschlangen-Benachrichtigungen zurückgeliefert werden (siehe B<mq_notify>(3)).

source: There is one notable case where unmapped user and group IDs are I<not> converted to the corresponding overflow ID value. When viewing a I<uid_map> or I<gid_map> file in which there is no mapping for the second field, that field is displayed as 4294967295 (-1 as an unsigned integer).
de: Es gibt einen erwähnenswerten Fall, bei dem nicht abgebildete Benutzer- und Gruppenkennungen I<nicht> in die entsprechende Überlaufkennung konvertiert werden. Beim Betrachten einer Datei I<uid_map> oder I<gid_map>, bei der es keine Abbildung für das zweite Feld gibt, wird das Feld als 4294967295 (-1 als eine vorzeichenlose Ganzzahl) dargestellt.
fr: Il est un cas notable où des identifiants d'utilisateur et de groupe non mappés I<ne sont pas> convertis en des valeurs d’ID correspondantes au-delà de la limite. Lors de la consultation d'un fichier I<uid_map> ou I<gid_map> dans lequel il n'y a pas de mappage pour le second champ, ce champ apparaît comme 4294967295 (-1 représenté comme un entier non signé).

source: Accessing files
de: Dateizugriff
fr: Accession aux fichiers

source: In order to determine permissions when an unprivileged process accesses a file, the process credentials (UID, GID) and the file credentials are in effect mapped back to what they would be in the initial user namespace and then compared to determine the permissions that the process has on the file. The same is also of other objects that employ the credentials plus permissions mask accessibility model, such as System V IPC objects
de: Um Berechtigungen zu bestimmen, wenn ein nicht privilegierter Prozess auf eine Datei zugreift, werden die Prozessberechtigungen (UID, GID) und die Dateiberechtigungen letztendlich auf die zurückabgebildet, die sie im anfänglichen Benutzernamensraum wären und dann verglichen, um die Berechtigungen zu bestimmen, die der Prozess auf die Datei hat. Das gleiche trifft auch für andere Objekte zu, die das Zugriffsmodell mit Benutzerberechtigungen sowie Berechtigungsmasken einsetzen, wie System-V-IPC-Objekte.
fr: Dans le but de déterminer les permissions quand un processus non privilégié accède à un fichier, les accréditations du processus (UID, GID) et les accréditations du fichier sont en réalité mappées vers ce qu’elles seraient dans l’espace de noms utilisateur initial et alors comparées pour déterminer les permissions que le processus possède sur le fichier. La même chose est valable pour les autres objets qui emploient les accréditations plus le modèle d’accessibilité avec le masque de permission, tels que les objets IPC de System V.

source: Operation of file-related capabilities
de: Aktionen mit Datei-bezogenen Capabilitys
fr: Opérations sur les capacités relatives aux fichiers

source: Certain capabilities allow a process to bypass various kernel-enforced restrictions when performing operations on files owned by other users or groups. These capabilities are: B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, and B<CAP_FSETID>.
de: Bestimmte Capabilitys erlauben es einem Prozess, verschiedene, durch den Kernel durchgesetzte Beschränkungen zu umgehen, wenn Aktionen auf Dateien durchgeführt werden, die anderen Benutzern oder Gruppen gehören. Diese Capabilitys sind B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER> und B<CAP_FSETID>.
fr: Certaines capacités permettent à un processus de contourner diverses restrictions imposées par le noyau lors d’opérations sur des fichiers possédés par d’autres utilisateurs ou groupes. Ce sont B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER> et B<CAP_FSETID>.

source: Within a user namespace, these capabilities allow a process to bypass the rules if the process has the relevant capability over the file, meaning that:
de: Innerhalb eines Benutzernamensraumes erlauben diese Capabilitys einem Prozess, die Regeln zu umgehen, falls der Prozess über die relevante Capability über die Datei verfügt. Das bedeutet:
fr: Dans un espace de noms utilisateur, ces capacités permettent à un processus de contourner les règles si le processus possède la capacité adéquate sur le fichier, signifiant que :

source: the process has the relevant effective capability in its user namespace; and
de: Der Prozess hat die relevante effektive Capability in seinem eigenen Benutzernamensraum; und
fr: le processus a la capacité effective adéquate dans son espace de noms utilisateur;

source: the file's user ID and group ID both have valid mappings in the user namespace.
de: die Benutzer- und Gruppenkennung der Datei habe beide gültige Abbildungen in dem Benutzernamensraum.
fr: les ID utilisateur et groupe du fichier ont tous les deux des mappages valables dans l’espace de noms utilisateur.

source: The B<CAP_FOWNER> capability is treated somewhat exceptionally: it allows a process to bypass the corresponding rules so long as at least the file's user ID has a mapping in the user namespace (i.e., the file's group ID does not need to have a valid mapping).
de: Die Capability B<CAP_FOWNER> wird etwas besonders behandelt: sie erlaubt einem Prozess, die entsprechenden Regeln zu umgehen, solange zumindest die Benutzerkennung der Datei über eine Abbildung in dem Benutzernamensraum verfügt (d.h. die Gruppenkennung der Datei benötigt keine gültige Abbildung).
fr: La capacité B<CAP_FOWNER> est traitée de manière quelque peu exceptionnelle. Elle permet à un processus de contourner les règles correspondantes à condition qu’au moins l’ID utilisateur du fichier possède un mappage dans l’espace de noms utilisateur (c’est-à-dire que l’ID de groupe du fichier n’a nul besoin d’avoir un mappage valable).

source: Set-user-ID and set-group-ID programs
de: Set-user-ID- und set-group-ID-Programme
fr: Programmes set-user-ID et set-group-ID

source: When a process inside a user namespace executes a set-user-ID (set-group-ID) program, the process's effective user (group) ID inside the namespace is changed to whatever value is mapped for the user (group) ID of the file. However, if either the user I<or> the group ID of the file has no mapping inside the namespace, the set-user-ID (set-group-ID) bit is silently ignored: the new program is executed, but the process's effective user (group) ID is left unchanged. (This mirrors the semantics of executing a set-user-ID or set-group-ID program that resides on a filesystem that was mounted with the B<MS_NOSUID> flag, as described in B<mount>(2).)
de: Wenn ein Prozess innerhalb eines Benutzernamensraums ein set-user-ID- (set-group-ID)-Programm ausführt, wird die effektive Benutzer- (Gruppen-)Kennung des Prozesses innerhalb des Namensraums auf denjenigen Wert geändert, der für die Benutzer- (Gruppen)kennung der Datei abgebildet ist. Falls allerdings entweder die Benutzer- I<oder> die Gruppenkennung der Datei über keine Abbildung innerhalb des Namensraums verfügt, wird das set-user-ID- (set-group-ID-)Bit ohne Rückmeldung ignoriert: das neue Programm wird ausgeführt, aber die effektive Benutzer- (Gruppen-)Kennung des Prozesses bleibt unverändert. (Dies spiegelt die Semantik bei der Ausführung eines set-user-ID- oder set-group-ID-Programmes wider, das sich auf einem Dateisystem befindet, das mit dem Schalter B<MS_NOSUID> eingehängt wurde, wie dies in B<mount>(2) beschrieben ist.)
fr: Lorsqu'un processus appartenant à un espace de noms exécute un programme set-user-ID (set-group-ID), l'identifiant utilisateur (groupe) effectif du processus dans l'espace de noms est changé à n’importe quelle valeur mappée pour l’identifiant utilisateur (groupe) du fichier. Cependant, si l'identifiant utilisateur I<ou> groupe n'a pas de mappage dans l'espace de noms, le bit set-user-ID (set-group-ID) est ignoré silencieusement : le nouveau programme est exécuté, mais l'identifiant utilisateur (groupe) effectif n’est pas modifié. Cela reproduit la sémantique d'exécution d'un programme set-user-ID ou set-group-ID qui se trouve dans un système de fichiers monté avec l'indicateur B<MS_NOSUID>, comme indiqué dans B<mount>(2).

source: Miscellaneous
de: Verschiedenes
fr: Divers

source: When a process's user and group IDs are passed over a UNIX domain socket to a process in a different user namespace (see the description of B<SCM_CREDENTIALS> in B<unix>(7)), they are translated into the corresponding values as per the receiving process's user and group ID mappings.
de: Wenn die Benutzer- und Gruppenkennungen eines Prozesses über ein UNIX-Domain-Socket an einen Prozess in einem anderen Benutzernamensraum übergeben werden (siehe die Beschreibung von B<SCM_CREDENTIALS> in B<unix>(7)), werden sie in die entsprechenden Werte der Benutzer- und Gruppenkennungsabbildungen des empfangenen Prozesses übersetzt.
fr: Lorsque les identifiants utilisateur et groupe d'un processus sont transmis à l’aide d’un socket de domaine UNIX à un processus d'un autre espace de noms (consultez la description de B<SCM_CREDENTIALS> dans B<unix>(7)), ils sont transformés en leur valeur correspondante suivant les mappages des identifiants utilisateur et groupe du processus réceptionnaire.

source: Namespaces are a Linux-specific feature.
de: Namensräume sind eine Linux-spezifische Funktionalität.
fr: Les espaces de noms sont propres à Linux.

source: NOTES
de: ANMERKUNGEN

source: Over the years, there have been a lot of features that have been added to the Linux kernel that have been made available only to privileged users because of their potential to confuse set-user-ID-root applications. In general, it becomes safe to allow the root user in a user namespace to use those features because it is impossible, while in a user namespace, to gain more privilege than the root user of a user namespace has.
de: Über die Jahre wurden eine Reihe von Funktionalitäten zu dem Linux-Kernel hinzugefügt, die nur privilegierten Benutzern verfügbar gemacht wurden, da sie möglicherweise set-user-ID-root-Anwendungen durcheinander bringen könnten. Im Allgemeinen wird es sicher, einem Root-Benutzer in einem Benutzernamensraum die Verwendung dieser Funktionalitäten zu erlauben, da es unmöglich ist, mehr Privilegien zu erlangen, als der Root-Benutzer innerhalb eines Benutzernamensraumes hat, während der Prozess im Benutzernamensraum ist.
fr: Au fil des ans, de nombreuses fonctionnalités ont été ajoutées au noyau Linux mais réservées aux utilisateurs disposant de privilèges du fait de la confusion qu'elles peuvent induire dans les applications set-user-ID-root. En général, il n'est pas dangereux d'autoriser un superutilisateur d'un espace de noms à utiliser ces fonctionnalités parce qu'il est impossible, dans un espace de noms utilisateur, d'obtenir plus de droits que ce que peut obtenir le superutilisateur d’un espace de noms utilisateur.

source: Global root
de: Globaler Root

source: The term "global root" is sometimes used as a shorthand for user ID 0 in the initial user namespace.
de: Der Ausdruck »Globaler Root« wird manchmal als Abkürzung für die Benutzerkennung 0 im anfänglichen Benutzernamensraum verwandt.

source: Availability
de: Verfügbarkeit
fr: Disponibilité

source: Use of user namespaces requires a kernel that is configured with the B<CONFIG_USER_NS> option. User namespaces require support in a range of subsystems across the kernel. When an unsupported subsystem is configured into the kernel, it is not possible to configure user namespaces support.
de: Die Verwendung von Benutzernamensräumen benötigt einen Kernel, der mit der Option B<CONFIG_USER_NS> konfiguriert ist. Benutzernamensräume benötigen die Unterstützung in einer ganzen Reihe von Subsystemen im Kernel. Wird ein nicht unterstütztes Subsystem in den Kernel konfiguriert, dann ist es nicht möglich, die Unterstützung von Benutzernamensräumen zu konfigurieren.
fr: Le noyau doit avoir été configuré avec l'option B<CONFIG_USER_NS> pour permettre l'utilisation des espaces de noms utilisateur. Ces espaces doivent également être pris en charge par un ensemble de sous-systèmes du noyau. Si un sous-système non pris en charge est activé dans le noyau, il n'est pas possible de configurer la prise en charge des espaces de noms.

source: As at Linux 3.8, most relevant subsystems supported user namespaces, but a number of filesystems did not have the infrastructure needed to map user and group IDs between user namespaces. Linux 3.9 added the required infrastructure support for many of the remaining unsupported filesystems (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS, and OCFS2). Linux 3.12 added support for the last of the unsupported major filesystems, XFS.
de: Seit Linux 3.8 unterstützen die wichtigsten Subsysteme Benutzernamensräume, aber eine Reihe von Dateisystemen hatten noch nicht die benötigte Infrastruktur, um Benutzer- und Gruppenkennungen zwischen Benutzernamensräumen abzubilden. Linux 3.9 fügte die benötigte Infrastruktur für viele der verbliebenen, nicht unterstützten Dateisysteme (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS und OCFS2) hinzu. Linux 3.12 fügte Unterstützung für das letzte große verbliebene und nicht unterstützte Dateisystem hinzu: XFS.
fr: Depuis Linux 3.8, la plupart des principaux sous-systèmes prennent en charge les espaces de noms utilisateur, mais certains systèmes de fichiers n'ont pas l'infrastructure nécessaire pour mapper les identifiants utilisateur et groupe entre les espaces de noms utilisateur. Linux 3.9 a fourni l'infrastructure nécessaire à la prise en charge de nombreux systèmes de fichiers restants (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS et OCFS2). Linux 3.12 a apporté la prise en charge du dernier des principaux systèmes de fichiers non encore géré, XFS.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: The program below is designed to allow experimenting with user namespaces, as well as other types of namespaces. It creates namespaces as specified by command-line options and then executes a command inside those namespaces. The comments and I<usage()> function inside the program provide a full explanation of the program. The following shell session demonstrates its use.
de: Das nachfolgende Programm ist zum Experimentieren mit Benutzernamensräumen sowie anderen Arten von Namensräumen gedacht. Es erstellt einen Namensraum, wie er über die Befehlszeilenoptionen angegeben ist, und führt dann innerhalb dieser Namensräume einen Befehl aus. Die Kommentare und die Funktion I<usage>() innerhalb des Programmes bieten eine vollständige Erklärung des Programms. Die nachfolgende Shell-Sitzung zeigt seine Verwendung.
fr: Le programme suivant est conçu pour permettre de s'exercer avec les espaces de noms utilisateur, comme avec d'autres espaces de noms. Il crée des espaces de noms tels que définis dans les options de la ligne de commande et exécute une commande dans ces espaces de noms. Les commentaires et la fonction I<usage()> dans le programme fournissent une explication détaillée du programme. La session shell suivante illustre son utilisation.

source: First, we look at the run-time environment:
de: Zuerst schauen wir auf die Laufzeitumgebung:
fr: Tout d'abord, regardons l'environnement d'exécution :

source: $ B<uname -rs> # Need Linux 3.8 or later Linux 3.8.0 $ B<id -u> # Running as unprivileged user 1000 $ B<id -g> 1000
de: $ B<uname -rs> # Benötigt Linux 3.8 oder neuer Linux 3.8.0 $ B<id -u> # Ausführung als nicht privilegierter Benutzer 1000 $ B<id -g> 1000
fr: $ B<uname -rs> # à partir de Linux 3.8 Linux 3.8.0 $ B<id -u> # exécuté comme utilisateur sans privilèges 1000 $ B<id -g> 1000

source: Now start a new shell in new user (I<-U>), mount (I<-m>), and PID (I<-p>) namespaces, with user ID (I<-M>) and group ID (I<-G>) 1000 mapped to 0 inside the user namespace:
de: Jetzt wird eine neue Shell in neuen Benutzer- (I<-U>), Einhänge- (I<-m>) und PID- (I<-p>) Namensräumen gestartet, wobei innerhalb des Benutzernamensraums die Benutzerkennung (I<-M>) und Gruppenkennung (I<-G>) 1000 auf 0 abgebildet wird:
fr: Démarrons maintenant un nouveau shell dans les nouveaux espaces de noms utilisateur (I<-U>), de montage (I<-m>) et de PID (I<-p>), avec l'identifiant utilisateur (I<-M>) et groupe (I<-G>) 1000 mappés à 0 dans l'espace de noms utilisateur :

source: The shell has PID 1, because it is the first process in the new PID namespace:
de: Diese Shell hat PID 1, da sie der erste Prozess in dem neuen PID-Namensraum ist:
fr: Le shell a le PID 1 puisqu'il est le premier processus de l'espace de noms :

source: Mounting a new I</proc> filesystem and listing all of the processes visible in the new PID namespace shows that the shell can't see any processes outside the PID namespace:
de: Wird ein neues Dateisystem I</proc> eingehängt und alle in dem neuen PID-Namensraum sichtbaren Prozesse aufgelistet, kann gesehen werden, dass die Shell keinerlei Prozesse außerhalb des PID-Namensraumes sehen kann:
fr: Lorsque l'on monte un nouveau système de fichiers I</proc> et que l'on affiche tous les processus visibles dans le nouvel espace de noms PID, on constate que le shell peut voir tous les processus qui se trouvent à l'extérieur de l'espace de noms PID :

source: Inside the user namespace, the shell has user and group ID 0, and a full set of permitted and effective capabilities:
de: Innerhalb des Benutzernamensraumes hat die Shell die Benutzer- und Gruppenkennung 0 und eine vollständige Menge an erlaubten und effektiven Capabilitys:
fr: Dans l'espace de noms utilisateur, le shell a les identifiants utilisateur et groupe 0, ainsi qu'un ensemble complet de capacités autorisées et effectives :

source: Program source
de: Programmquelltext
fr: Source du programme

source: Licensed under GNU General Public License v2 or later
de: Lizenziert unter der GNU General Public License v2 oder neuer
fr: Sous licence publique générale GNU, versions 2 ou postérieures

source: Create a child process that executes a shell command in new namespace(s); allow UID and GID mappings to be specified when creating a user namespace. */ #define _GNU_SOURCE #include E<lt>err.hE<gt> #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
de: Erzeugt einen Kindprozess, der einen Shell-Befehl in einem oder mehreren neuen Namensräumen ausführt; erlaubt UID- und GID-Abbildungen anzugeben, wenn ein Benutzernamensraum erstellt wird */ #define _GNU_SOURCE #include E<lt>err.hE<gt> #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>

source: struct child_args { char **argv; /* Command to be executed by child, with args */ int pipe_fd[2]; /* Pipe used to synchronize parent and child */ };
de: struct child_args { char **argv; /* Vom Kind auszuführender Befehl, mit Argumenten */ int pipe_fd[2]; /* Zur Sychronisation Eltern/Kind verwandte Pipe */ };
fr: struct child_args { char **argv; /* Commande à exécuter par l’enfant, avec arguments */ int pipe_fd[2]; /* Tube utilisé pour synchroniser le parent et l’enfant */ };
