Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: The range of user IDs (group IDs) specified in each line cannot overlap with the ranges in any other lines. In the initial implementation (Linux 3.8), this requirement was satisfied by a simplistic implementation that imposed the further requirement that the values in both field 1 and field 2 of successive lines must be in ascending numerical order, which prevented some otherwise valid maps from being created. Linux 3.9 and later fix this limitation, allowing any valid set of nonoverlapping maps.
de: Die Bereiche der Benutzerkennungen (Gruppenkennungen), die in den einzelnen Zeilen angegeben sind, dürfen sich nicht gegenseitig überlappen. In der anfänglichen Implementierung (Linux 3.8) wurde diese Anforderung durch eine simplistische Implementierung erfüllt, die weitere Einschränkungen auferlegte, dass die Werte sowohl in Feld 1 als auch Feld 2 von aufeinanderfolgenden Zeilen in aufsteigender numerischer Reihenfolge sein mussten, womit andernfalls gültige Abbildungen nicht erstellt werden konnten. Linux 3.9 und neuer korrigierte diese Beschränkung und erlaubte jede Kombination von nichtüberlappenden Abbildungen.
fr: L'intervalle d'identifiants utilisateur (ou de groupe) indiqué dans chaque ligne ne peut recouvrir les intervalles des autres lignes. Dans l'implémentation initiale (Linux 3.8), cette règle était assurée par une implémentation plus sommaire qui comprenait une contrainte supplémentaire : les deux premiers champs de chaque ligne devaient apparaître en ordre croissant. Cela empêchait cependant la création de mappages valables. Ce problème a été réglé dans Linux 3.9 et suivants, et toutes les combinaisons valables de mappages non recouvrantes sont désormais acceptées.

source: At least one line must be written to the file.
de: Mindestens eine Zeile muss in die Datei geschrieben werden.
fr: Au moins une ligne doit être inscrite dans le fichier.

source: Writes that violate the above rules fail with the error B<EINVAL>.
de: Schreibvorgänge, die die obigen Regeln verletzen, schlagen mit dem Fehler B<EINVAL> fehl.
fr: Les opérations d'écritures qui ne respectent pas les règles énoncées précédemment échouent en renvoyant l'erreur B<EINVAL>.

source: In order for a process to write to the I</proc/>pidI</uid_map> (I</proc/>pidI</gid_map>) file, all of the following permission requirements must be met:
de: Damit ein Prozess in die Datei I</proc/>PIDI</uid_map> (I</proc/>PIDI</gid_map>) schreiben kann, müssen alle der folgenden Berechtigungsanforderungen erfüllt sein:

source: The writing process must have the B<CAP_SETUID> (B<CAP_SETGID>) capability in the user namespace of the process I<pid>.
de: Der schreibende Prozess muss über die Capability B<CAP_SETUID> (B<CAP_SETGID>) des Benutzernamensraums des Prozeses I<PID> verfügen.
fr: Le processus réalisant l'écriture doit disposer de la capacité B<CAP_SETUID> (B<CAP_SETGID>) dans l'espace de noms utilisateur du processus I<pid>.

source: The writing process must either be in the user namespace of the process I<pid> or be in the parent user namespace of the process I<pid>.
de: Der schreibende Prozess muss entweder in dem Benutzernamensraum des Prozesses I<PID> oder in dem Vorgängernamensraum des Prozesses I<PID> sein.
fr: Le processus réalisant l'écriture doit se trouver soit dans l'espace de noms utilisateur du processus I<pid>, soit dans l'espace de noms utilisateur parent du processus I<pid>.

source: The mapped user IDs (group IDs) must in turn have a mapping in the parent user namespace.
de: Die abgebildeten Benutzerkennungen (Gruppenkennungen) müssen wiederum eine Abbildung in dem Vorgänger-Benutzernamensraum haben.
fr: Les identifiants utilisateur (ou groupe) mappés doivent, en retour, avoir un mappage dans l'espace de noms utilisateur parent.

source: If updating I</proc/>pidI</uid_map> to create a mapping that maps UID 0 in the parent namespace, then one of the following must be true:
de: Falls die Aktualisierung von I</proc/>PIDI</uid_map> eine Abbildung erstellt, die die UID 0 in dem Vorgängernamensraum abbildet, dann muss eine der folgenden Bedingungen wahr sein:

source: if writing process is in the parent user namespace, then it must have the B<CAP_SETFCAP> capability in that user namespace; or
de: Falls der schreibende Prozess im Vorgänger-Benutzernamensraum liegt, dann muss er über die Capability B<CAP_SETFCAP> in diesem Benutzernamensraum verfügen; oder

source: if the writing process is in the child user namespace, then the process that created the user namespace must have had the B<CAP_SETFCAP> capability when the namespace was created.
de: falls der schreibende Prozess in dem nachfolgenden Benutzernamensraum liegt, dann muss der Prozess, der den Benutzernamensraum erstellte, über die Capability B<CAP_SETFCAP> verfügen, als der Benutzernamensraum erstellt wurde.

source: This rule has been in place since Linux 5.12. It eliminates an earlier security bug whereby a UID 0 process that lacks the B<CAP_SETFCAP> capability, which is needed to create a binary with namespaced file capabilities (as described in B<capabilities>(7)), could nevertheless create such a binary, by the following steps:
de: Diese Regel gibt es seit Linux 5.12. Sie beseitigt einen älteren Sicherheitsfehler, durch den ein UID-0-Prozess ohne die Capability B<CAP_SETFCAP> (die zum Erstellen eines Programms mit Datei-Capabilitys im Namensraum benötigt wird, wie das in B<capabilities>(7) beschrieben ist), trotzdem ein solches Programm erstellen konnte, indem es Folgendes durchführte:

source: Create a new user namespace with the identity mapping (i.e., UID 0 in the new user namespace maps to UID 0 in the parent namespace), so that UID 0 in both namespaces is equivalent to the same root user ID.
de: Erstellung eines neuen Benutzernamensraums mit der Identitätsabbildung (d.h. UID 0 in dem neuen Benutzernamensraum wird auf UID 0 im Vorgängernamensraum abgebildet), so dass UID 0 in beiden Namensräumen äquivalent zu der gleichen Root-Benutzerkennung ist.

source: Since the child process has the B<CAP_SETFCAP> capability, it could create a binary with namespaced file capabilities that would then be effective in the parent user namespace (because the root user IDs are the same in the two namespaces).
de: Da der Nachfolgerprozess über die Capability B<CAP_SETFCAP> verfügt, könnte er ein Programm mit den Datei-Capabilitys im Namensraum erstellen, die auch im Vorgängernamensraum wirksam wären (da die Root-Benutzerkennungen in beiden Namensräumen identisch sind).

source: One of the following two cases applies:
de: Einer der folgenden zwei Fälle trifft zu:
fr: L'un des deux points suivants est vérifié :

source: I<Either> the writing process has the B<CAP_SETUID> (B<CAP_SETGID>) capability in the I<parent> user namespace.
de: I<Entweder> verfügt der schreibende Prozess über die Capability B<CAP_SETUID> (B<CAP_SETGID>) in dem I<Vorgänger>namensraum.
fr: I<soit> le processus réalisant l'écriture doit disposer de la capacité B<CAP_SETUID> ( B<CAP_SETGID>) dans l'espace de noms utilisateur I<parent>.

source: No further restrictions apply: the process can make mappings to arbitrary user IDs (group IDs) in the parent user namespace.
de: Es gelten keine weiteren Einschränkungen; der Prozess kann Abbildungen auf beliebige Benutzerkennungen (Gruppenkennungen) im Vorgängernamensraum durchführen.
fr: Aucune autre restriction, le processus peut établir des mappages vers les ID utilisateur (groupe) dans l’espace de noms parent.

source: I<Or> otherwise all of the following restrictions apply:
de: I<Oder> es gelten alle der folgenden Beschränkungen:
fr: I<Ou> sinon toutes les restrictions suivantes s’appliquent :

source: The data written to I<uid_map> (I<gid_map>) must consist of a single line that maps the writing process's effective user ID (group ID) in the parent user namespace to a user ID (group ID) in the user namespace.
de: Die in I<uid_map> (I<gid_map>) geschriebenen Daten müssen aus einer einzelnen Zeile bestehen, die die effektive Benutzerkennung (Gruppenkennung) des schreibenden Prozesses in dem Vorgängernamensraum auf eine Benutzerkennung (Gruppenkennung) in den Benutzernamensraum abbildet.
fr: Les données inscrites dans I<uid_map> (I<gid_map>) doivent consister en une seule ligne qui mappe l'identifiant utilisateur effectif (groupe) du processus écrivant dans l’espace de noms utilisateur parent à un ID utilisateur (groupe) dans l’espace de noms utilisateur.

source: The writing process must have the same effective user ID as the process that created the user namespace.
de: Der schreibende Prozess muss die gleiche effektive Benutzerkennung wie der Prozess haben, der den Benutzernamensraum erstellte.
fr: Le processus réalisant l'écriture doit avoir le même ID utilisateur effectif que le processus ayant créé l’espace de noms utilisateur.

source: In the case of I<gid_map>, use of the B<setgroups>(2) system call must first be denied by writing "I<deny>" to the I</proc/>pidI</setgroups> file (see below) before writing to I<gid_map>.
de: Im Falle von I<gid_map> muss zuerst die Verwendung des Systemaufrufs B<setgroups>(2) verboten werden, indem »I<deny>« in die Datei I</proc/>PIDI</setgroups> geschrieben wird (siehe unten), bevor in I<gid_map> geschrieben wird.

source: Writes that violate the above rules fail with the error B<EPERM>.
de: Schreibaktionen, die die obigen Regeln verletzen, werden mit B<EPERM> fehlschlagen.
fr: Les écritures violant ces règles échouent avec l’erreur B<EPERM>.

source: Project ID mappings: projid_map
de: Projektkennungsabbildung: projid_map

source: Similarly to user and group ID mappings, it is possible to create project ID mappings for a user namespace. (Project IDs are used for disk quotas; see B<setquota>(8) and B<quotactl>(2).)
de: Ähnlich zu Benutzer- und Gruppenkennungsabbildungen ist es möglich, eine Projektkennungsabbildung für einen Benutzernamensraum zu erstellen. (Projektkennungen werden für Plattenkontingente verwandt, siehe B<setquota>(8) und B<quotactl>(2).)

source: Project ID mappings are defined by writing to the I</proc/>pidI</projid_map> file (present since Linux 3.7).
de: Projektkennungsabbildungen werden durch Schreiben in die Datei I</proc/>PIDI</projid_map> definiert (vorhanden seit Linux 3.7).

source: The validity rules for writing to the I</proc/>pidI</projid_map> file are as for writing to the I<uid_map> file; violation of these rules causes B<write>(2) to fail with the error B<EINVAL>.
de: Die Gültigkeitsregeln für das Schreiben in die Datei I</proc/>PIDI</projid_map> sind wie beim Schreiben in die Datei I<uid_map>; Verletzung dieser Regeln führt beim B<write>(2) zum Fehlschlag B<EINVAL>.

source: The permission rules for writing to the I</proc/>pidI</projid_map> file are as follows:
de: Die Erlaubnisregeln für das Schreiben in die Datei I</proc/>PIDI</projid_map> sind wie folgt:

source: The mapped project IDs must in turn have a mapping in the parent user namespace.
de: Die abgebildeten Projektkennungen müssen wiederum eine Abbildung im Vorgängernamensraum haben.

source: Violation of these rules causes B<write>(2) to fail with the error B<EPERM>.
de: Verletzung dieser Regeln führt dazu, dass B<write>(2) mit B<EPERM> fehlschlägt.

source: Interaction with system calls that change process UIDs or GIDs
de: Wechselwirkung mit Systemaufrufen, die Prozessbenutzerkennungen oder -gruppenkennungen ändern
fr: Interaction avec les appels système qui modifient les UID ou les GID

source: In a user namespace where the I<uid_map> file has not been written, the system calls that change user IDs will fail. Similarly, if the I<gid_map> file has not been written, the system calls that change group IDs will fail. After the I<uid_map> and I<gid_map> files have been written, only the mapped values may be used in system calls that change user and group IDs.
de: In einem Benutzernamensraum, in dem die Datei I<uid_map> noch nicht geschrieben wurde, werden die Systemaufrufe, die die Benutzerkennung ändern, fehlschlagen. Ähnlich werden die Systemaufrufe, die die Gruppenkennungen ändern, fehlschlagen, falls die Datei I<gid_map> noch nicht geschrieben wurde. Nachdem die Dateien I<uid_map> und I<gid_map> geschrieben wurden, können nur die abgebildeten Werte in Systemaufrufen verwandt werden, die die Benutzer- und Gruppenkennungen ändern.
fr: Dans un espace de noms utilisateur où aucun fichier I<uid_map> n’a été écrit, les appels système qui modifient l’ID utilisateur échoueront. De la même manière, si le fichier I<gid_map> n’a pas été écrit, les appels système modifiant les ID de groupe échoueront. Après que les fichiers I<uid_map> et I<gid_map> aient été écrits, seules les valeurs mappées peuvent être utilisées dans les appels système modifiant les ID utilisateur et groupe.

source: For user IDs, the relevant system calls include B<setuid>(2), B<setfsuid>(2), B<setreuid>(2), and B<setresuid>(2). For group IDs, the relevant system calls include B<setgid>(2), B<setfsgid>(2), B<setregid>(2), B<setresgid>(2), and B<setgroups>(2).
de: Für Benutzerkennungen sind die relevanten Systemaufrufe unter anderem B<setuid>(2), B<setfsuid>(2), B<setreuid>(2) und B<setresuid>(2). Für Gruppenkennungen sind die relevanten Systemaufrufe unter anderem B<setgid>(2), B<setfsgid>(2), B<setregid>(2), B<setresgid>(2) und B<setgroups>(2).
fr: Pour les ID utilisateur, les appels système concernés incluent B<setuid>(2), B<setfsuid>(2), B<setreuid>(2) et B<setresuid>(2). Pour les ID de groupe, les appels système concernés incluent B<setgid>(2), B<setfsgid>(2), B<setregid>(2), B<setresgid>(2) et B<setgroups>(2).

source: Writing "I<deny>" to the I</proc/ pid /setgroups> file before writing to I</proc/ pid /gid_map> will permanently disable B<setgroups>(2) in a user namespace and allow writing to I</proc/ pid /gid_map> without having the B<CAP_SETGID> capability in the parent user namespace.
de: Durch Schreiben von »I<deny>« in die Datei I</proc/>PIDI</setgroups> vor dem Schreiben von I</proc/>PIDI</gid_map> wird B<setgroups>(2) in einem Benutzernamensraum dauerhaft deaktiviert und erlaubt Schreiben von I</proc/>PIDI</gid_map>, ohne über die Capability B<CAP_SETGID> im Vorgängernamensraum zu verfügen.

source: The /proc/ pid /setgroups file
de: Die Datei I</proc/>PIDI</setgroups>

source: The I</proc/>pidI</setgroups> file displays the string "I<allow>" if processes in the user namespace that contains the process I<pid> are permitted to employ the B<setgroups>(2) system call; it displays "I<deny>" if B<setgroups>(2) is not permitted in that user namespace. Note that regardless of the value in the I</proc/>pidI</setgroups> file (and regardless of the process's capabilities), calls to B<setgroups>(2) are also not permitted if I</proc/>pidI</gid_map> has not yet been set.
de: Die Datei I</proc/>PIDI</setgroups> zeigt die Zeichenkette »I<allow>«, falls Prozesse in dem Benutzernamensraum, der den Prozess I<PID> enthält, die Erlaubnis haben, den Systemaufruf B<setgroups>(2) einzusetzen. Sie zeigt »I<deny>« an, falls B<setgroups>(2) in diesem Benutzernamensraum nicht erlaubt ist. Beachten Sie, dass Aufrufe von B<setgroups>(2) auch nicht erlaubt sind, falls I</proc/>PIDI</gid_map> noch nicht gesetzt wurde, unabhängig von dem Wert der Datei I</proc/>PIDI</setgroups> (und unabhängig von den Capabilitys des Prozesses).

source: A privileged process (one with the B<CAP_SYS_ADMIN> capability in the namespace) may write either of the strings "I<allow>" or "I<deny>" to this file I<before> writing a group ID mapping for this user namespace to the file I</proc/>pidI</gid_map>. Writing the string "I<deny>" prevents any process in the user namespace from employing B<setgroups>(2).
de: Ein privilegierter Prozess (einer mit der Capability B<CAP_SYS_ADMIN> in dem Namensraum) darf eine der Zeichenketten »I<allow>« oder »I<deny>« in diese Datei schreiben, I<bevor> eine Gruppenkennungsabbildung für diesen Benutzernamensraum in die Datei I</proc/>PIDI</gid_map> geschrieben wird. Durch Schreiben der Zeichenkette »I<deny>« wird jedem Prozess in diesem Benutzernamensraum der Einsatz von B<setgroups>(2) verboten.

source: The essence of the restrictions described in the preceding paragraph is that it is permitted to write to I</proc/>pidI</setgroups> only so long as calling B<setgroups>(2) is disallowed because I</proc/>pidI</gid_map> has not been set. This ensures that a process cannot transition from a state where B<setgroups>(2) is allowed to a state where B<setgroups>(2) is denied; a process can transition only from B<setgroups>(2) being disallowed to B<setgroups>(2) being allowed.
de: Die Essenz der in den vorhergehenden Absätzen beschriebenen Beschränkungen ist, dass das Schreiben in I</proc/>PIDI</setgroups> nur so lange erlaubt ist, wie B<setgroups>(2) nicht erlaubt ist, da I</proc/>PIDI</gid_map> noch nicht gesetzt wurde. Damit wird sichergestellt, dass ein Prozess nicht von einem Zustand, bei dem B<setgroups>(2) erlaubt ist, zu einem Zustand, bei dem B<setgroups>(2) verboten ist, übergehen kann; ein Prozess kann nur von B<setgroups>(2) nicht erlaubt zu B<setgroups>(2) erlaubt übergehen.

source: The default value of this file in the initial user namespace is "I<allow>".
de: Der Vorgabewert für diese Datei in dem anfänglichen Namensraum ist »I<allow>«.
fr: La valeur par défaut dans ce fichier dans l’espace de noms utilisateur initial est « I<allow> ».

source: Once I</proc/>pidI</gid_map> has been written to (which has the effect of enabling B<setgroups>(2) in the user namespace), it is no longer possible to disallow B<setgroups>(2) by writing "I<deny>" to I</proc/>pidI</setgroups> (the write fails with the error B<EPERM>).
de: Sobald I</proc/>PIDI</gid_map> geschrieben wurde (wodurch B<setgroups>(2) in dem Benutzernamensraum aktiviert wird), ist es nicht mehr möglich, B<setgroups>(2) durch Schreiben von »I<deny>« in I</proc/>PIDI</setgroups> zu verbieten (das Schreiben schlägt mit B<EPERM> fehl).

source: A child user namespace inherits the I</proc/>pidI</setgroups> setting from its parent.
de: Ein Nachfolgernamensraum erbt die Einstellungen I</proc/>PIDI</setgroups> von seinem Vorgänger.

source: If the I<setgroups> file has the value "I<deny>", then the B<setgroups>(2) system call can't subsequently be reenabled (by writing "I<allow>" to the file) in this user namespace. (Attempts to do so fail with the error B<EPERM>.) This restriction also propagates down to all child user namespaces of this user namespace.
de: Falls die Datei I<setgroups> den Wert »I<deny>« enthält, dann kann der Systemaufruf B<setgroups>(2) in diesem Namensraum nachfolgend nicht mehr aktiviert werden (durch Schreiben von »I<allow>« in die Datei). (Versuche, dies durchzuführen, schlagen mit B<EPERM> fehl.) Diese Beschränkung wird auch an alle Nachfolgerbenutzernamensräume dieses Benutzernamensraums weitergeleitet.
fr: Si le fichier I<setgroups> a la valeur « I<deny> », alors l’appel système B<setgroups>(2) ne peut pas par la suite être réactivé (en écrivant « I<allow> » dans le fichier) dans cet espace de noms utilisateur (toute tentative échouera avec l’erreur B<EPERM>). Cette restriction se propage vers les espaces de noms utilisateur enfant de cet espace de noms utilisateur.

source: The I</proc/ pid /setgroups> file was added in Linux 3.19, but was backported to many earlier stable kernel series, because it addresses a security issue. The issue concerned files with permissions such as "rwx---rwx". Such files give fewer permissions to "group" than they do to "other". This means that dropping groups using B<setgroups>(2) might allow a process file access that it did not formerly have. Before the existence of user namespaces this was not a concern, since only a privileged process (one with the B<CAP_SETGID> capability) could call B<setgroups>(2). However, with the introduction of user namespaces, it became possible for an unprivileged process to create a new namespace in which the user had all privileges. This then allowed formerly unprivileged users to drop groups and thus gain file access that they did not previously have. The I</proc/>pidI</setgroups> file was added to address this security issue, by denying any pathway for an unprivileged process to drop groups with B<setgroups>(2).
de: Die Datei I</proc/>PIDI</setgroups> wurde in Linux 3.19 hinzugefügt; allerdings wurde sie auch auf viele frühere stabile Kernel rückportiert, da sie ein Sicherheitsproblem adressiert. Das Problem betraf Dateien mit Berechtigungen wie »rwx---rwx«. Diese Dateien geben der »Gruppe« weniger Berechtigungen als sie »anderen« geben. Das bedeutet, dass die Abgabe von Gruppen mittels B<setgroups>(2) einem Prozess Dateizugriff erlauben könnte, den er vorher nicht hatte. Vor der Existenz von Benutzernamensräumen führte dies zu keine Sorgen, da nur ein privilegierter Prozess (einer mit der Capability B<CAP_SETGID>) B<setgroups>(2) aufrufen konnte. Mit der Einführung von Benutzernamensräumen wurde es für einen nicht privilegierten Prozess allerdings möglich, einen neuen Namensraum zu erstellen, in dem der Benutzer alle Privilegien hatte. Dies ermöglichte es dann vorher nicht privilegierten Benutzern Gruppen abzugeben und damit Dateizugriff zu erlangen, den sie vorher nicht hatten. Die Datei I</proc/>PIDI</setgroups> wurde hinzugefügt, um dieses Sicherheitsproblem zu adressieren, indem jeder Pfad für einen nicht privilegierten Prozess, Gruppen mit B<setgroups>(2) abzugeben, verboten wurde.

source: Unmapped user and group IDs
de: Nicht abgebildete Benutzer- und Gruppenkennungen
fr: ID utilisateur et groupe non mappés

source: There are various places where an unmapped user ID (group ID) may be exposed to user space. For example, the first process in a new user namespace may call B<getuid>(2) before a user ID mapping has been defined for the namespace. In most such cases, an unmapped user ID is converted to the overflow user ID (group ID); the default value for the overflow user ID (group ID) is 65534. See the descriptions of I</proc/sys/kernel/overflowuid> and I</proc/sys/kernel/overflowgid> in B<proc>(5).
de: Es gibt verschiedene Stellen, an denen nicht abgebildete Benutzerkennungen (Gruppenkennungen) im Anwendungsraum offengelegt werden können. Beispielsweise könnte der erste Prozess in einem neuen Benutzernamensraum B<getuid>(2) aufrufen, bevor eine Benutzerkennungsabbildung für den Namensraum definiert wurde. In den meisten solcher Fälle wird eine nicht abgebildete Benutzerkennung in die Überlauf-Benutzerkennung (Gruppenkennung) konvertiert; der Vorgabewert für die Überlauf-Benutzerkennung (Gruppenkennung) ist 65534. Siehe die Beschreibung von I</proc/sys/kernel/overflowuid> und I</proc/sys/kernel/overflowgid> in B<proc>(5).
fr: Il existe différentes situations dans lesquelles un identifiant utilisateur (ou de groupe) non mappé peut être exposé dans un espace de noms utilisateur. Par exemple, le premier processus d'un nouvel espace de noms utilisateur peut appeler B<getuid>() avant que le mappage des identifiants utilisateur ait été défini pour l'espace de noms. Dans la plupart de ces cas, l'identifiant utilisateur non mappé est converti en un identifiant utilisateur (groupe) au-delà de la limite de débordement ; la valeur par défaut au delà de cette limite pour un identifiant utilisateur (ou groupe) est 65534. Consultez les descriptions de I</proc/sys/kernel/overflowuid> et de I</proc/sys/kernel/overflowgid> dans B<proc>(5).
