Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: Having a capability inside a user namespace permits a process to perform operations (that require privilege) only on resources governed by that namespace. In other words, having a capability in a user namespace permits a process to perform privileged operations on resources that are governed by (nonuser) namespaces associated with the user namespace (see the next subsection).
de: Hat ein Prozess eine Capability innerhalb eines Benutzernamensraums, dann darf er Aktionen nur auf Ressourcen anwenden (die Privilegien benötigen), die durch diesen Namensraum reguliert werden. Mit anderen Worten erlaubt eine Capability in einem Benutzernamensraum einem Prozess, privilegierte Aktionen auf Ressourcen durchzuführen, die durch (Nichtbenutzer-)Namensräume gelenkt werden, die dem Benutzernamensräumen zugeordnet sind (siehe den nächsten Unterabschnitt).
fr: Un processus qui possède des capacités dans un espace de noms utilisateur a la possibilité d'effectuer des opérations (nécessitant des privilèges) seulement sur les ressources gérées par cet espace de noms. En d’autres mots, avoir une capacité dans un espace de noms utilisateur permet à un processus de réaliser des opérations privilégiées sur des ressources gérées par des espaces de noms (non utilisateur) associés avec l’espace de noms utilisateur (consultez la sous-section suivante).

source: On the other hand, there are many privileged operations that affect resources that are not associated with any namespace type, for example, changing the system time (governed by B<CAP_SYS_TIME>), loading a kernel module (governed by B<CAP_SYS_MODULE>), and creating a device (governed by B<CAP_MKNOD>). Only a process with privileges in the I<initial> user namespace can perform such operations.
de: Auf der anderen Seite gibt es viele privilegierte Aktionen, die Ressourcen betreffen, die keinem Namensraumtyp zugeordnet sind, beispielsweise dem Ändern der Systemzeit (wird durch B<CAP_SYS_TIME> reguliert), dem Laden eines Kernelmoduls (wird durch B<CAP_SYS_MODULE> reguliert) und dem Erstellen eines Gerätes (wird durch B<CAP_MKNOD> reguliert). Nur Prozesse, die über Privilegien in dem I<ursprünglichen> Benutzernamensraum verfügen, können solche Aktionen durchführen.
fr: D’un autre coté, il existe beaucoup d’opérations privilégiées affectant les ressources qui ne sont associées à aucun type d’espace de noms, par exemple, modifier l’heure du système (régi par B<CAP_SYS_TIME>), charger un module du noyau (régi par B<CAP_SYS_MODULE>) et créer un périphérique (régi par B<CAP_MKNOD>). Seuls les processus avec privilèges dans l’espace de noms I<initial> peuvent réaliser de telles opérations.

source: Holding B<CAP_SYS_ADMIN> within the user namespace associated with a process's mount namespace allows that process to create bind mounts and mount the following types of filesystems:
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der dem Einhängenamensraum des Prozesses zugeordnet ist, dann kann er Bind-Einhängungen erstellen und die folgenden Arten an Dateisystemen einhängen:
fr: Avoir B<CAP_SYS_ADMIN> dans un espace de noms utilisateur associé à un espace de noms de montage de processus permet à ce processus de créer des remontages (bind mount) et monter les types suivants de système de fichiers :

source: Holding B<CAP_SYS_ADMIN> within the user namespace associated with a process's cgroup namespace allows (since Linux 4.6) that process to the mount the cgroup version 2 filesystem and cgroup version 1 named hierarchies (i.e., cgroup filesystems mounted with the B<"none,name="> option).
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der dem Cgroup-Namensraum des Prozesses zugeordnet ist, dann kann er (seit Linux 4.6) das Cgroup-Version-2-Dateisystem und die benannten Cgroup-Version-1-Hierarchien (d.h. Cgroup-Dateisysteme, die mit der Option B<"none,name="> eingehängt sind) einhängen.
fr: Avoir B<CAP_SYS_ADMIN> dans l’espace de noms utilisateur associé à un espace de noms cgroup de processus permet (depuis Linux 4.6) à ce processus de monter un système de fichiers cgroup version 2 ou cgroup version 1 appelés hiérarchies (c’est-à-dire des systèmes de fichiers cgroup avec l’option « I<none,name=> »).

source: Holding B<CAP_SYS_ADMIN> within the user namespace associated with a process's PID namespace allows (since Linux 3.8) that process to mount I</proc> filesystems.
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der dem PID-Namensraum des Prozesses zugeordnet ist, dann kann er (seit Linux 3.8) I</proc>-Dateisysteme einhängen.
fr: Avoir B<CAP_SYS_ADMIN> dans un espace de noms utilisateur associé à un espace de noms PID de processus permet (depuis Linux 3.8) à ce processus de monter des systèmes de fichiers I</proc>.

source: Starting in Linux 3.8, unprivileged processes can create user namespaces, and other the other types of namespaces can be created with just the B<CAP_SYS_ADMIN> capability in the caller's user namespace.
de: Seit Linux 3.8 können nicht privilegierte Prozesse Benutzernamensräume erstellen und andere Arten von Namensräumen können nur mit der Capability B<CAP_SYS_ADMIN> im Benutzernamensraum des Aufrufenden erstellt werden.
fr: À partir de Linux 3.8, les processus sans privilèges peuvent créer des espaces de noms utilisateur et d’autres types d’espace de noms peuvent être créés avec simplement la capacité B<CAP_SYS_ADMIN> dans l'espace de noms utilisateur de l'appelant.

source: When a non-user-namespace is created, it is owned by the user namespace in which the creating process was a member at the time of the creation of the namespace. Actions on the non-user-namespace require capabilities in the corresponding user namespace.
de: Wenn ein Nichtbenutzer-Namensraum erstellt wird, gehört er dem Benutzernamensraum, in dem der erstellende Prozess zum Erstellungszeitraum des Namensraums Mitglied war. Aktionen in dem Nichtbenutzer-Namensraum benötigen Capabilitys in dem entsprechenden Benutzernamensraum.
fr: Lorsqu'un espace de noms autre qu'utilisateur est créé, il appartient à l'espace de noms utilisateur dont le processus créateur était membre au moment de la création de l’espace de noms. Les actions sur un espace de noms non utilisateur nécessitent des capacités dans l’espace de noms utilisateur correspondant.

source: When a new namespace (other than a user namespace) is created via B<clone>(2) or B<unshare>(2), the kernel records the user namespace of the creating process against the new namespace. (This association can't be changed.) When a process in the new namespace subsequently performs privileged operations that operate on global resources isolated by the namespace, the permission checks are performed according to the process's capabilities in the user namespace that the kernel associated with the new namespace. For example, suppose that a process attempts to change the hostname (B<sethostname>(2)), a resource governed by the UTS namespace. In this case, the kernel will determine which user namespace is associated with the process's UTS namespace, and check whether the process has the required capability (B<CAP_SYS_ADMIN>) in that user namespace.
de: Wenn ein neuer Namensraum (der kein Benutzernamensraum ist) mittels B<clone>(2) oder B<unshare>(2) erstellt wird, zeichnet der Kernel den Benutzernamensraum des erstellenden Prozesses gegen den neuen Namensraum auf. (Diese Zuordnung kann nicht geändert werden). Wenn nachfolgend ein Prozess in dem neuen Namensraum eine privilegierte Aktion durchführt, die auf globalen Ressourcen agiert, die durch den Namensraum isoliert werden, dann erfolgen die Berechtigungsprüfungen gemäß der Capabilitys des Prozesses in dem Benutzernamensraum, den der Kernel dem neuen Namensraum zuordnet. Wird beispielsweise angenommen, dass ein Prozess versucht, den Rechnernamen, eine durch UTS-Namensräume regulierte Ressource, zu ändern (B<sethostname>(2)), dann wird der Kernel bestimmen, welchem Benutzernamensraum der UTS-Namensraum des Prozesses zugeordnet ist und prüfen, ob der Prozess über die benötigte Capability (B<CAP_SYS_ADMIN>) in diesem Benutzernamensraum verfügt.
fr: Lorsqu'un nouvel espace de noms (autre qu’un espace de noms utilisateur) est créé à l’aide de B<clone>(2) ou B<unshare>(2), le noyau enregistre l'espace de noms utilisateur du processus créateur par rapport au nouvel espace de noms. (Cette association ne peut pas être changée). Lorsqu'un processus du nouvel espace de noms effectue ensuite une opération privilégiée sur une ressource globale isolée par l'espace de noms, les vérifications de permissions sont réalisées en fonction des capacités du processus dans l'espace de noms utilisateur que le noyau a associé au nouvel espace de noms. Par exemple, supposons qu’un processus essaie de modifier le nom d’hôte (B<sethostname>(2)), une ressource régie par l’espace de noms UTS. Dans ce cas le noyau déterminera quel espace de noms utilisateur possède l’espace de noms UTS du processus et vérifiera si le processus à la capacité requise (B<CAP_SYS_ADMIN>) dans cet espace de noms utilisateur.

source: The B<NS_GET_USERNS> B<ioctl>(2) operation can be used to discover the user namespace with which a non-user namespace is associated; see B<ioctl_ns>(2).
de: Die Aktion B<NS_GET_USERNS> B<ioctl>(2) kann zum Erkennen des Benutzernamensraums verwandt werden, dem der Nichtbenutzer-Namensraum zugeordnet ist; siehe B<ioctl_ns>(2).
fr: L’opération B<NS_GET_USERNS> d’B<ioctl>(2) peut être utilisée pour découvrir l’espace de noms utilisateur avec lequel l’espace de noms non utilisateur est associé. Consultez B<ioctl_ns>(2).

source: The essence of the restrictions described in the preceding paragraph is that it is permitted to write to I</proc/[pid]/setgroups> only so long as calling B<setgroups>(2) is disallowed because I</proc/[pid]gid_map> has not been set. This ensures that a process cannot transition from a state where B<setgroups>(2) is allowed to a state where B<setgroups>(2) is denied; a process can transition only from B<setgroups>(2) being disallowed to B<setgroups>(2) being allowed.
de: Die Essenz der in den vorhergehenden Absätzen beschriebenen Beschränkungen ist, dass das Schreiben in I</proc/[PID]/setgroups> nur so lange erlaubt ist, wie B<setgroups>(2) nicht erlaubt ist, da I</proc/[PID]/gid_map> noch nicht gesetzt wurde. Damit wird sichergestellt, dass ein Prozess nicht von einem Zustand, bei dem B<setgroups>(2) erlaubt ist, zu einem Zustand, bei dem B<setgroups>(2) verboten ist, übergehen kann; ein Prozess kann nur von B<setgroups>(2) nicht erlaubt zu B<setgroups>(2) erlaubt übergehen.
fr: L’idée de ces restrictions décrites dans le paragraphe précédent est qu’il est permis d’écrire dans I</proc/[pid]/setgroups> seulement à condition que l’appel à B<setgroups>(2) est désactivé parce que I</proc/[pid]/gid_map> n’a pas été défini. Cela garantit qu’un processus ne peut transiter d’un état dans lequel B<setgroups>(2) est autorisé vers un état dans lequel B<setgroups>(2) est interdit. Un processus peut transiter seulement de B<setgroups>(2) interdit vers B<setgroups>(2) autorisé.

source: As at Linux 3.8, most relevant subsystems supported user namespaces, but a number of filesystems did not have the infrastructure needed to map user and group IDs between user namespaces. Linux 3.9 added the required infrastructure support for many of the remaining unsupported filesystems (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS, and OCFS2). Linux 3.12 added support the last of the unsupported major filesystems, XFS.
de: Seit Linux 3.8 unterstützen die wichtigsten Subsysteme Benutzernamensräume, aber eine Reihe von Dateisystemen hatten noch nicht die benötigte Infrastruktur, um Benutzer- und Gruppenkennungen zwischen Benutzernamensräumen abzubilden. Linux 3.9 fügte die benötigte Infrastruktur für viele der verbliebenen, nicht unterstützten Dateisysteme (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS und OCFS2) hinzu. Linux 3.12 fügte Unterstützung für das letzte große verbliebene und nicht unterstützte Dateisystem hinzu: XFS.
fr: Depuis Linux 3.8, la plupart des principaux sous-systèmes prennent en charge les espaces de noms utilisateur, mais certains systèmes de fichiers n'ont pas l'infrastructure nécessaire pour mapper les identifiants utilisateur et groupe entre les espaces de noms utilisateur. Linux 3.9 a fourni l'infrastructure nécessaire à la prise en charge de nombreux systèmes de fichiers restants (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS et OCFS2). Linux 3.12 a apporté la prise en charge du dernier des principaux systèmes de fichiers non encore géré, XFS.

source: EXAMPLE
de: BEISPIEL
fr: EXEMPLE

source: Create a child process that executes a shell command in new namespace(s); allow UID and GID mappings to be specified when creating a user namespace. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
de: Erzeugt einen Kindprozess, der einen Shell-Befehl in einem oder mehreren neuen Namensräumen ausführt; erlaubt UID- und GID-Abbildungen anzugeben, wenn ein Benutzernamensraum erstellt wird */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
fr: Créer un processus enfant qui exécute une commande de shell dans un nouvel espace de noms. Il permet de préciser les mappages d'identifiants utilisateur et groupe lors de la création d’un espace de noms utilisateur. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>

source: static void update_map(char *mapping, char *map_file) { int fd, j; size_t map_len; /* Length of \(aqmapping\(aq */
de: static void update_map(char *mapping, char *map_file) { int fd, j; size_t map_len; /* Länge der »Abbildung« */
fr: static void update_map(char *mapping, char *map_file) { int fd, j; size_t map_len; /* Longueur de \(aqmapping\(aq */

source: static int /* Start function for cloned child */ childFunc(void *arg) { struct child_args *args = (struct child_args *) arg; char ch;
de: static int /* Funktion für geklontes Kind starten */ childFunc(void *arg) { struct child_args *args = (struct child_args *) arg; char ch;
fr: static int /* Lancer la fonction pour l’enfant dupliqué */ childFunc(void *arg) { struct child_args *args = (struct child_args *) arg; char ch;

source: if (verbose) printf("%s: PID of child created by clone() is %ld\en", argv[0], (long) child_pid);
de: if (verbose) printf("%s: PID des durch clone() erstellten Kindprozesses lautet %ld\en", argv[0], (long) child_pid);
fr: if (verbose) printf("%s: le PID de l’enfant créé par clone() est %ld\en", argv[0], (long) child_pid);

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
