Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG
fr: NOM

source: user_namespaces - overview of Linux user namespaces
de: user_namespaces - Überblick über Benutzernamensräume in Linux
fr: user_namespaces – Présentation des espaces de noms utilisateur sous Linux

source: DESCRIPTION
de: BESCHREIBUNG

source: For an overview of namespaces, see B<namespaces>(7).
de: Für einen Überblick über Namensräume, siehe B<namespaces>(7).
fr: Pour une présentation générale des espaces de noms, consultez B<namespaces>(7).

source: User namespaces isolate security-related identifiers and attributes, in particular, user IDs and group IDs (see B<credentials>(7)), the root directory, keys (see B<keyrings>(7)), and capabilities (see B<capabilities>(7)). A process's user and group IDs can be different inside and outside a user namespace. In particular, a process can have a normal unprivileged user ID outside a user namespace while at the same time having a user ID of 0 inside the namespace; in other words, the process has full privileges for operations inside the user namespace, but is unprivileged for operations outside the namespace.
de: Benutzernamensräume isolieren sicherheitsrelevante Kennzeichner und Attribute, insbesondere Benutzer- und Gruppenkennungen (siehe B<credentials>(7)), das Wurzelverzeichnis, Schlüssel (siehe B<keyrings>(7)) und Capabilitys (siehe B<capabilities>(7)). Die Benutzer- und Gruppenkennung eines Prozesses kann innerhalb und außerhalb eines Benutzernamensraums verschieden sein. Insbesondere kann ein Prozess eine normale, nicht privilegierte Benutzerkennung außerhalb eines Benutzernamensraums haben, während er gleichzeitig eine Benutzerkennung 0 innerhalb des Namensraums hat; mit anderen Worten, der Prozess hat volle Privilegien für Aktionen innerhalb des Benutzernamensraums, ist aber für Aktionen außerhalb des Namensraums nicht privilegiert.
fr: Les espaces de noms utilisateur isolent les identifiants et attributs liés à la sécurité, en particulier les identifiants d'utilisateurs et de groupes (consultez B<credentials>(7)), le répertoire racine, les clefs (consultez B<keyctl>(2)) et les capacités (consultez B<capabilities>(7)). Les identifiants d'utilisateur et de groupe d'un processus peuvent être différents selon que l'on se trouve à l'intérieur ou à l'extérieur d'un espace de noms utilisateur. Un processus peut notamment avoir un identifiant sans privilège particulier en dehors d'un espace de noms et avoir l'identifiant 0 à l'intérieur d'un espace de noms. Autrement dit, le processus dispose de tous les privilèges pour des opérations effectuées dans l'espace de noms, tandis qu'il n'en a aucun pour les opérations réalisées en dehors de l'espace de noms utilisateur.

source: Nested namespaces, namespace membership
de: Verschachtelte Namensräume, Namensraum-Mitgliedschaft
fr: Espaces de noms imbriqués, appartenance aux espaces de noms

source: User namespaces can be nested; that is, each user namespace\(emexcept the initial ("root") namespace\(emhas a parent user namespace, and can have zero or more child user namespaces. The parent user namespace is the user namespace of the process that creates the user namespace via a call to B<unshare>(2) or B<clone>(2) with the B<CLONE_NEWUSER> flag.
de: Benutzernamensräume können verschachtelt werden, das bedeutet, dass jeder Benutzernamensraum\(emaußer dem anfänglichen (»Wurzel-«)Namensraum\(emüber einen Vorgängernamensraum verfügt und keinen oder mehrere Nachfolgernamensräume haben kann. Der Vorgängernamensraum ist der Benutzernamensraum des Prozesses, der den Benutzernamensraum mittels eines Aufrufs von B<unshare>(2) oder B<clone>(2) mit dem Schalter B<CLONE_NEWUSER> erstellte.
fr: Les espaces de noms utilisateur peuvent être imbriqués. Cela signifie que chaque espace de noms utilisateur \(em\ à l'exception de l'espace de noms initial (« root »)\ \(em a un espace de noms parent et peut avoir éventuellement un ou plusieurs espaces de noms utilisateur enfant. L'espace de noms utilisateur parent est l'espace de noms du processus qui a créé l'espace de noms utilisateur au moyen de B<unshare>(2) ou de B<clone>(2) invoqué avec l'attribut B<CLONE_NEWUSER>.

source: The kernel imposes (since version 3.11) a limit of 32 nested levels of user namespaces. Calls to B<unshare>(2) or B<clone>(2) that would cause this limit to be exceeded fail with the error B<EUSERS>.
de: (Seit Version 3.11) erzwingt der Kernel eine Begrenzung von 32 verschachtelten Stufen an Benutzernamensräumen. Aufrufe an B<unshare>(2) oder B<clone>(2), die zum Überschreiten dieser Begrenzung führen würden, schlagen mit dem Fehler B<EUSERS> fehl.
fr: Le noyau impose (à partir de Linux 3.11) une limite de 32 niveaux d'imbrication pour les espaces de noms utilisateur. Si un appel à B<unshare>(2) ou à B<clone>(2) provoque le dépassement de cette limite, la commande échoue en renvoyant l'erreur B<EUSERS>.

source: Each process is a member of exactly one user namespace. A process created via B<fork>(2) or B<clone>(2) without the B<CLONE_NEWUSER> flag is a member of the same user namespace as its parent. A single-threaded process can join another user namespace with B<setns>(2) if it has the B<CAP_SYS_ADMIN> in that namespace; upon doing so, it gains a full set of capabilities in that namespace.
de: Jeder Prozess ist Mitglied in genau einem Benutzernamensraum. Ein mit B<fork>(2) oder B<clone>(2) ohne den Schalter B<CLONE_NEWUSER> erstellter Prozess ist ein Mitglied im gleichen Benutzernamensraum wie sein Elternprozess. Ein Prozess mit nur einem Thread kann einem anderen Benutzernamensraum mit B<setns>(2) beitreten, falls er über B<CAP_SYS_ADMIN> in diesem Namensraum verfügt; wenn er dies durchführt, erlangt er den vollständigen Satz an Capabilitys in diesem Namensraum.
fr: Chaque processus est membre d'exactement un espace de noms utilisateur. Un processus créé par B<fork>(2) ou par B<clone>(2) sans l'attribut B<CLONE_NEWUSER> est membre du même espace de noms que son processus parent. Un processus mono-threadé peut rejoindre un autre espace de noms en utilisant B<setns>(2) s'il dispose de la capacité B<CAP_SYS_ADMIN> dans cet espace de noms ; cette action lui octroie un ensemble de capacités dans cet espace de noms.

source: A call to B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWUSER> flag makes the new child process (for B<clone>(2)) or the caller (for B<unshare>(2)) a member of the new user namespace created by the call.
de: Ein Aufruf von B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWUSER> führt dazu, dass der Kindprozess (für B<clone>(2)) oder der Aufrufende (für B<unshare>(2)) ein Mitglied des neuen, durch den Aufruf erstellten Benutzernamensraums wird.
fr: Un appel à B<clone>(2) ou à B<unshare>(2) avec l'attribut B<CLONE_NEWUSER> place le nouveau processus enfant (pour B<clone>(2)) ou l'appelant (pour B<unshare>(2)) dans le nouvel espace de noms utilisateur créé par l'appel.

source: The B<NS_GET_PARENT> B<ioctl>(2) operation can be used to discover the parental relationship between user namespaces; see B<ioctl_ns>(2).
de: Die Aktion B<NS_GET_PARENT> B<ioctl>(2) kann zum Erkennen der Vorgänger-/Nachfolger-Beziehung von Benutzernamensräumen verwandt werden; siehe B<ioctl_ns>(2).
fr: L’opération B<ioctl>(2) B<NS_GET_PARENT> peut être utilisée pour découvrir les relations de parenté entre les espaces de noms utilisateur. Consultez B<ioctl_ns>(2).

source: Capabilities
de: Capabilitys
fr: Capacités

source: The child process created by B<clone>(2) with the B<CLONE_NEWUSER> flag starts out with a complete set of capabilities in the new user namespace. Likewise, a process that creates a new user namespace using B<unshare>(2) or joins an existing user namespace using B<setns>(2) gains a full set of capabilities in that namespace. On the other hand, that process has no capabilities in the parent (in the case of B<clone>(2)) or previous (in the case of B<unshare>(2) and B<setns>(2)) user namespace, even if the new namespace is created or joined by the root user (i.e., a process with user ID 0 in the root namespace).
de: Der durch B<clone>(2) mit dem Schalter B<CLONE_NEWUSER> erstellte Kindprozess beginnt mit einem vollständigen Satz an Capabilitys in dem neuen Benutzernamensraum. Entsprechend erlangt ein Prozess, der einen neuen Benutzernamensraum mittels B<unshare>(2) erstellt oder ihm mittels B<setns>(2) beitritt, einen vollständigen Satz an Capabilitys in diesem Namensraum. Anderserseits hat dieser Prozess keine Capabilitys in dem Vorgänger- (im Falle von B<clone>(2)) oder vorhergehenden (im Falle von B<unshare>(2) und B<setns>(2)) Benutzernamensraum, selbst falls der neue Namensraum vom Benutzer root erstellt wird oder dieser ihm beitritt (d.h. einem Prozess mit der Benutzerkennung 0 im Wurzel-Namensraum).
fr: Le processus enfant créé par B<clone>(2) avec l'attribut B<CLONE_NEWUSER> s’initialise avec un nouvel ensemble de capacités dans le nouvel espace de noms utilisateur. De même, un processus qui crée un nouvel espace de noms au moyen de B<unshare>(2) ou qui rejoint un espace de noms existant à l’aide de B<setns>(2) reçoit un ensemble de capacités dans cet espace de noms. D’un autre côté, le processus n’a aucune capacité dans le parent (dans le cas de B<clone>(2)) ou dans le précédent espace de noms utilisateur (dans le cas de B<unshare>(2) et B<setns>(2)), même si le nouvel espace de noms utilisateur est créé ou rejoint par l’utilisateur racine (c’est-à-dire un processus avec l’ID utilisateur 0 dans l’espace de noms racine).

source: Note that a call to B<execve>(2) will cause a process's capabilities to be recalculated in the usual way (see B<capabilities>(7)). Consequently, unless the process has a user ID of 0 within the namespace, or the executable file has a nonempty inheritable capabilities mask, the process will lose all capabilities. See the discussion of user and group ID mappings, below.
de: Beachten Sie, dass ein Aufruf von B<execve>(2) dazu führt, dass die Capabilitys eines Prozesses auf die normale Art und Weise erneut berechnet werden (siehe B<capabilities>(7)). Folglich wird der Prozess alle Capabilitys verlieren, außer er hat eine Benutzerkennung von 0 innerhalb des Namensraums oder die ausführbare Datei hat eine vererbbare Capability-Maske, die nicht leer ist. Siehe die nachfolgende Diskussion von Benutzer- und Gruppenkennungabbildung.
fr: Remarquez qu'un appel à B<execve>(2) déclenche la réévaluation des capacités selon la méthode habituelle (consultez B<capabilities>(7)), de sorte que le processus perdra ses capacités, sauf si son identifiant utilisateur vaut 0 dans l'espace de noms ou si le fichier exécutable a un masque de capacités héritable non vide. Pour en savoir plus, consultez les commentaires sur le mappage entre utilisateurs et groupes ci-dessous.

source: A call to B<clone>(2) or B<unshare>(2) using the B<CLONE_NEWUSER> flag or a call to B<setns>(2) that moves the caller into another user namespace sets the "securebits" flags (see B<capabilities>(7)) to their default values (all flags disabled) in the child (for B<clone>(2)) or caller (for B<unshare>(2) or B<setns>(2)). Note that because the caller no longer has capabilities in its original user namespace after a call to B<setns>(2), it is not possible for a process to reset its "securebits" flags while retaining its user namespace membership by using a pair of B<setns>(2) calls to move to another user namespace and then return to its original user namespace.
de: Ein Aufruf von B<clone>(2) oder B<unshare>(2) mit dem Schalter B<CLONE_NEWUSER> oder ein Aufruf von B<setns>(2), der den Aufrufenden in einen anderen Benutzernamensraum verschiebt, setzt die Schalter »securebits« (siehe B<capabilities>(7)) im Kind (für B<clone>(2)) oder dem Aufrufenden (für B<unshare>(2) oder B<setns>(2)) auf ihre Vorgabewerte (alle Schalter deaktiviert). Beachten Sie, dass der Aufrufende nach einem Aufruf von B<setns>(2) keine Capabilitys in seinem ursprünglichen Benutzernamensraum mehr hat und es daher für einen Prozess nicht möglich ist, seine Schalter »securebits« zurückzusetzen und gleichzeitig seine Mitgliedschaft im Benutzernamensraum zu erhalten, indem ein Paar von B<setns>(2)-Aufrufen verwandt wird, um sich in einen anderen Benutzernamensraum zu verschieben und dann zu seinem ursprünglichen Namensraum zurückzukehren.
fr: Un appel à B<clone>(2) ou B<unshare>(2) en utilisant l'attribut B<CLONE_NEWUSER> ou un appel à B<setns>(2) qui déplace l’appelant dans d’autres jeux d’espaces de noms utilisateur positionne les indicateurs « securebits » (consultez B<capabilities>(7)) à leurs valeurs par défaut (tous les indicateurs désactivés) dans l’enfant (pour B<clone>(2)) ou l’appelant (pour B<unshare>(2) ou B<setns>(2)). Remarquez que parce que l’appelant n’a plus de capacités dans son espace de noms utilisateur après un appel à B<setns>(2), il n’est pas possible à un processus de réinitialiser ses indicateurs « securebits » tout en conservant son appartenance à un espace de noms utilisateur en utilisant une paire d’appels B<setns>(2) pour se déplacer vers un autre espace de noms utilisateur et ensuite retourner vers son espace de noms utilisateur original.

source: The rules for determining whether or not a process has a capability in a particular user namespace are as follows:
de: Die Regeln zur Bestimmung, ob ein Prozess eine Capability in einem bestimmten Benutzernamensraum hat, sind wie folgt:
fr: Les règles pour déterminer si un processus a ou n’a pas de capacités dans un espace de noms utilisateur particulier sont comme suit :

source: A process has a capability inside a user namespace if it is a member of that namespace and it has the capability in its effective capability set. A process can gain capabilities in its effective capability set in various ways. For example, it may execute a set-user-ID program or an executable with associated file capabilities. In addition, a process may gain capabilities via the effect of B<clone>(2), B<unshare>(2), or B<setns>(2), as already described.
de: Ein Prozess hat eine Capability innerhalb eines Benutzernamensraums, falls er ein Mitglied dieses Namensraums ist und er die Capability in seiner effektiven Capability-Menge hat. Ein Prozess kann Capabilitys in seiner effektiven Capability-Menge auf verschiedene Arten erlangen. Beispielsweise könnte er ein set-user-ID-Programm oder eine ausführbare Datei mit zugeordneten Datei-Capabilitys ausführen. Zusätzlich könnte ein Prozess Capabilitys mittels der bereits beschriebenen Auswirkungen von B<clone>(2), B<unshare>(2) oder B<setns>(2) erlangen.
fr: Un processus dispose d'une capacité dans un espace de noms utilisateur s'il est membre de cet espace de noms et si cette capacité est activée dans son jeu de capacités. Un processus peut obtenir une nouvelle capacité dans son jeu de capacités de plusieurs façons. Il peut, par exemple, exécuter un programme set-user-ID ou un exécutable avec des capacités de fichier associées. Il peut également obtenir des capacités à l’aide de l'action de B<clone>(2), B<unshare>(2) ou B<setns>(2) comme indiqué précédemment.

source: If a process has a capability in a user namespace, then it has that capability in all child (and further removed descendant) namespaces as well.
de: Falls ein Prozess eine Capability in einem Benutzernamensraum hat, dann hat es diese Capability in allen nachfolgenden (und weiter entfernten Nachfolge-) Namensräumen ebenfalls.
fr: Si un processus dispose d'une capacité dans un espace de noms utilisateur, alors il a cette même capacité dans tous les espaces de noms enfant (et les espaces descendants supprimés).

source: When a user namespace is created, the kernel records the effective user ID of the creating process as being the "owner" of the namespace. A process that resides in the parent of the user namespace and whose effective user ID matches the owner of the namespace has all capabilities in the namespace. By virtue of the previous rule, this means that the process has all capabilities in all further removed descendant user namespaces as well. The B<NS_GET_OWNER_UID> B<ioctl>(2) operation can be used to discover the user ID of the owner of the namespace; see B<ioctl_ns>(2).
de: Wenn ein Benutzernamensraum erstellt wird, zeichnet der Kernel die effektive Benutzerkennung des erstellenden Prozesses als »Eigentümer« des Namensraums auf. Ein Prozess, der sich im Vorgänger des Benutzernamensraums befindet und dessen effektive Benutzerkennung auf die des Eigentümers des Namensraums passt, hat alle Capabilitys in diesem Namensraum. Dank der vorherigen Regel bedeutet dies, dass der Prozess auch über alle Capabilitys in allen weiteren entfernten nachfolgenden Benutzerräumen verfügt. Die Aktion B<NS_GET_OWNER_UID> B<ioctl>(2) kann zum Ermitteln der Benutzerkennung des Eigentümers des Namensraums verwandt werden; siehe B<ioctl_ns>(2).
fr: Lorsqu'un espace de noms est créé, le noyau enregistre l'identifiant utilisateur effectif du processus de création comme étant le « propriétaire » de l'espace de noms. Un processus qui se trouve dans le parent d'un espace de noms utilisateur et qui a un identifiant utilisateur effectif qui correspond au propriétaire de l'espace de noms dispose de toutes les capacités dans cet espace de noms. En vertu de la règle précédente, cela signifie que ce processus a également toutes les capacités dans tous les descendants supprimés de cet espace de noms. L’opération B<NS_GET_OWNER_UID> d’B<ioctl>(2) peut être utilisée pour découvrir l’ID d’utilisateur du propriétaire de l’espace de noms. Consultez B<ioctl_ns>(2).

source: Effect of capabilities within a user namespace
de: Auswirkungen von Capabilitys innerhalb eines Benutzernamensraums
fr: Effet des capacités à l’intérieur d’un espace de noms utilisateur

source: Having a capability inside a user namespace permits a process to perform operations (that require privilege) only on resources governed by that namespace. In other words, having a capability in a user namespace permits a process to perform privileged operations on resources that are governed by (nonuser) namespaces owned by (associated with) the user namespace (see the next subsection).
de: Hat ein Prozess eine Capability innerhalb eines Benutzernamensraums, dann darf er Aktionen nur auf Ressourcen anwenden (die Privilegien benötigen), die durch diesen Namensraum reguliert werden. Mit anderen Worten erlaubt eine Capability in einem Benutzernamensraum einem Prozess, privilegierte Aktionen auf Ressourcen durchzuführen, die durch (Nichtbenutzer-)Namensräume gelenkt werden, die den Benutzernamensräumen gehören bzw. diesen zugeordnet sind (siehe den nächsten Unterabschnitt).
fr: Un processus qui possède des capacités dans un espace de noms utilisateur a la possibilité d'effectuer des opérations (nécessitant des privilèges) seulement sur les ressources gérées par cet espace de noms. En d’autres mots, avoir une capacité dans un espace de noms permet à un processus de réaliser des opérations privilégiées sur des ressources gérées par des espaces de noms (non utilisateur) possédés par (associés avec) l’espace de noms utilisateur (consultez la sous-section suivante).

source: On the other hand, there are many privileged operations that affect resources that are not associated with any namespace type, for example, changing the system (i.e., calendar) time (governed by B<CAP_SYS_TIME>), loading a kernel module (governed by B<CAP_SYS_MODULE>), and creating a device (governed by B<CAP_MKNOD>). Only a process with privileges in the I<initial> user namespace can perform such operations.
de: Auf der anderen Seite gibt es viele privilegierte Aktionen, die Ressourcen betreffen, die keinem Namensraumtyp zugeordnet sind, beispielsweise dem Ändern der Systemzeit (z.B. Kalender) (wird durch B<CAP_SYS_TIME> reguliert), dem Laden eines Kernelmoduls (wird durch B<CAP_SYS_MODULE> reguliert) und dem Erstellen eines Gerätes (wird durch B<CAP_MKNOD> reguliert). Nur Prozesse, die über Privilegien in dem I<ursprünglichen> Benutzernamensraum verfügen, können solche Aktionen durchführen.
fr: D’un autre coté, il existe beaucoup d’opérations privilégiées affectant les ressources qui ne sont associées à aucun type d’espace de noms, par exemple, modifier l’heure du système (c’est-à-dire le calendrier) (régi par B<CAP_SYS_TIME>), charger un module du noyau (régi par B<CAP_SYS_MODULE>) et créer un périphérique (régi par B<CAP_MKNOD>). Seuls les processus avec privilèges dans l’espace de noms I<initial> peuvent réaliser de telles opérations.

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's mount namespace allows that process to create bind mounts and mount the following types of filesystems:
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der den Einhängenamensraum des Prozesses besitzt, dann kann er Bind-Einhängungen erstellen und die folgenden Arten an Dateisystemen einhängen:
fr: Avoir B<CAP_SYS_ADMIN> dans un espace de noms utilisateur qui possède un espace de noms de montage de processus permet à ce processus de créer des remontages (bind mount) et de monter les types suivants de système de fichiers :

source: I</proc> (since Linux 3.8)
de: I</proc> (seit Linux 3.8)
fr: I</proc/> (depuis Linux 3.8)

source: I</sys> (since Linux 3.8)
de: I</sys> (seit Linux 3.8)
fr: I</sys> (depuis Linux 3.8)

source: I<devpts> (since Linux 3.9)
de: I<devpts> (seit Linux 3.9)
fr: I<devpts> (depuis Linux 3.9)

source: B<tmpfs>(5) (since Linux 3.9)
de: B<tmpfs>(5) (seit Linux 3.9)
fr: B<tmpfs>(5) (depuis Linux 3.9)

source: I<ramfs> (since Linux 3.9)
de: I<ramfs> (seit Linux 3.9)
fr: I<ramfs> (depuis Linux 3.9)

source: I<mqueue> (since Linux 3.9)
de: I<mqueue> (seit Linux 3.9)
fr: I<mqueue> (depuis Linux 3.9)

source: I<bpf> (since Linux 4.4)
de: I<bpf> (seit Linux 4.4)
fr: I<bpf> (depuis Linux 4.4)

source: I<overlayfs> (since Linux 5.11)
de: I<overlayfs> (seit Linux 5.11)
fr: I<overlayfs> (depuis Linux 5.11)

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's cgroup namespace allows (since Linux 4.6) that process to the mount the cgroup version 2 filesystem and cgroup version 1 named hierarchies (i.e., cgroup filesystems mounted with the I<"none,name="> option).
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der den Cgroup-Namensraum des Prozesses besitzt, dann kann er (seit Linux 4.6) das Cgroup-Version-2-Dateisystem und die benannten Cgroup-Version-1-Hierarchien (d.h. Cgroup-Dateisysteme, die mit der Option I<"none,name="> eingehängt sind) einhängen.
fr: Avoir B<CAP_SYS_ADMIN> dans l’espace de noms utilisateur qui possède un espace de noms cgroup de processus permet (depuis Linux 4.6) à ce processus de monter un système de fichiers cgroup version 2 ou cgroup version 1 appelés hiérarchies (c’est-à-dire des systèmes de fichiers cgroup avec l’option « I<none,name=> »).

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's PID namespace allows (since Linux 3.8) that process to mount I</proc> filesystems.
de: Wenn ein Prozess B<CAP_SYS_ADMIN> innerhalb eines Namensraums hält, der den PID-Namensraum des Prozesses besitzt, dann kann er (seit Linux 3.8) I</proc>-Dateisysteme einhängen.
fr: Avoir B<CAP_SYS_ADMIN> dans un espace de noms utilisateur qui possède un espace de noms PID de processus permet (depuis Linux 3.8) à ce processus de monter des systèmes de fichiers I</proc>.

source: Note, however, that mounting block-based filesystems can be done only by a process that holds B<CAP_SYS_ADMIN> in the initial user namespace.
de: Beachten Sie, dass das Einhängen blockbasierter Dateisysteme nur von Prozessen erfolgen kann, die B<CAP_SYS_ADMIN> in dem anfänglichen Benutzernamensraum enthalten.
