Repository: sebras/manpages-l10n
Catalog: po/*/man7/user_namespaces.7.po
Languages: de, fr

source: Interaction of user namespaces and other types of namespaces
de: Wechselwirkung von Benutzernamensräumen und anderen Arten von Namensräumen
fr: Liens entre les espaces de noms utilisateur et les autres espaces de noms

source: Starting in Linux 3.8, unprivileged processes can create user namespaces, and the other types of namespaces can be created with just the B<CAP_SYS_ADMIN> capability in the caller's user namespace.
de: Seit Linux 3.8 können nicht privilegierte Prozesse Benutzernamensräume erstellen und andere Arten von Namensräumen können nur mit der Capability B<CAP_SYS_ADMIN> im Benutzernamensraum des Aufrufenden erstellt werden.
fr: À partir de Linux 3.8, les processus sans privilèges peuvent créer des espaces de noms utilisateur et les autres espaces de noms peuvent être créés avec simplement la capacité B<CAP_SYS_ADMIN> dans l'espace de noms utilisateur de l'appelant.

source: When a nonuser namespace is created, it is owned by the user namespace in which the creating process was a member at the time of the creation of the namespace. Privileged operations on resources governed by the nonuser namespace require that the process has the necessary capabilities in the user namespace that owns the nonuser namespace.
de: Wenn ein Nichtbenutzer-Namensraum erstellt wird, gehört er dem Benutzernamensraum, in dem der erstellende Prozess zum Erstellungszeitraum des Namensraums Mitglied war. Privilegierte Aktionen auf Ressourcen, die von einem Nichtbenutzer-Namensraum reguliert werden, benötigen, dass der Prozess über die notwendigen Capabilitys in dem Benutzernamensraum verfügt, der den Nichtbenutzer-Namensraum besitzt.
fr: Lorsqu'un espace de noms autre qu'utilisateur est créé, il appartient à l'espace de noms utilisateur auquel appartenait à ce moment là le processus à l'origine de la création de cet espace de noms. Les opérations privilégiées sur des ressources régies par un espace de noms non utilisateur nécessitent que le processus aient les capacités requises dans l’espace de noms utilisateur qui possède l’espace de noms non utilisateur.

source: If B<CLONE_NEWUSER> is specified along with other B<CLONE_NEW*> flags in a single B<clone>(2) or B<unshare>(2) call, the user namespace is guaranteed to be created first, giving the child (B<clone>(2)) or caller (B<unshare>(2)) privileges over the remaining namespaces created by the call. Thus, it is possible for an unprivileged caller to specify this combination of flags.
de: Falls B<CLONE_NEWUSER> zusammen mit anderen Schaltern B<CLONE_NEW*> in einem einzelnen Aufruf von B<clone>(2) oder B<unshare>(2) angegeben wird, wird garantiert, dass der Namensraum zuerst erstellt wird, und damit dem Kindprozess (B<clone>(2)) oder dem aufrufenden Prozess (B<unshare>(2)) Privilegien über den durch den Aufruf erstellten Namensraum gegeben wird. Daher ist es für einen nicht privilegierten Aufrufenden möglich, diese Schalterkombination festzulegen.
fr: Si B<CLONE_NEWUSER> est indiqué en complément de l'attribut B<CLONE_NEW*> lors d'un appel simple à B<clone>(2) ou à B<unshare>(2), l'espace de noms utilisateur est garanti d'être créé en premier. Cela donne des privilèges à l’enfant (dans le cas de B<clone>(2)) ou à l'appelant (dans le cas de B<unshare>(2)) dans les espaces de noms subsistants créés par l'appel. Il est ainsi possible à un appelant sans privilèges d'indiquer ce jeu d'attributs.

source: When a new namespace (other than a user namespace) is created via B<clone>(2) or B<unshare>(2), the kernel records the user namespace of the creating process as the owner of the new namespace. (This association can't be changed.) When a process in the new namespace subsequently performs privileged operations that operate on global resources isolated by the namespace, the permission checks are performed according to the process's capabilities in the user namespace that the kernel associated with the new namespace. For example, suppose that a process attempts to change the hostname (B<sethostname>(2)), a resource governed by the UTS namespace. In this case, the kernel will determine which user namespace owns the process's UTS namespace, and check whether the process has the required capability (B<CAP_SYS_ADMIN>) in that user namespace.
de: Wenn ein neuer Namensraum (der kein Benutzernamensraum ist) mittels B<clone>(2) oder B<unshare>(2) erstellt wird, zeichnet der Kernel den Benutzernamensraum des erstellenden Prozesses als Eigentümer des neuen Namensraums auf. (Diese Zuordnung kann nicht geändert werden). Wenn nachfolgend ein Prozess in dem neuen Namensraum eine privilegierte Aktion durchführt, die auf globalen Ressourcen agiert, die durch den Namensraum isoliert werden, dann erfolgen die Berechtigungsprüfungen gemäß der Capabilitys des Prozesses in dem Benutzernamensraum, den der Kernel dem neuen Namensraum zuordnet. Wird beispielsweise angenommen, dass ein Prozess versucht, den Rechnernamen, eine durch UTS-Namensräume regulierte Ressource, zu ändern (B<sethostname>(2)), dann wird der Kernel bestimmen, welchem Benutzernamensraum der UTS-Namensraum des Prozesses gehört und prüfen, ob der Prozess über die benötigte Capability (B<CAP_SYS_ADMIN>) in diesem Benutzernamensraum verfügt.
fr: Lorsqu'un nouvel espace de noms (autre qu’un espace de noms utilisateur) est créé à l’aide de B<clone>(2) ou B<unshare>(2), le noyau enregistre l'espace de noms utilisateur du processus créateur comme le propriétaire du nouvel espace de noms. (Cette association ne peut pas être changée). Lorsqu'un processus du nouvel espace de noms effectue ensuite une opération privilégiée sur une ressource globale isolée par l'espace de noms, les vérifications de permissions sont réalisées en fonction des capacités du processus dans l'espace de noms utilisateur que le noyau a associé au nouvel espace de noms. Par exemple, supposons qu’un processus essaie de modifier le nom d’hôte (B<sethostname>(2)), une ressource régie par l’espace de noms UTS. Dans ce cas le noyau déterminera quel espace de noms utilisateur possède l’espace de noms UTS du processus et vérifiera si le processus à la capacité requise (B<CAP_SYS_ADMIN>) dans cet espace de noms utilisateur.

source: The B<NS_GET_USERNS> B<ioctl>(2) operation can be used to discover the user namespace that owns a nonuser namespace; see B<ioctl_ns>(2).
de: Die Aktion B<NS_GET_USERNS> B<ioctl>(2) kann zum Erkennen des Benutzernamensraums verwandt werden, dem der Nichtbenutzer-Namensraum gehört; siehe B<ioctl_ns>(2).
fr: L’opération B<NS_GET_USERNS> d’B<ioctl>(2) peut être utilisée pour découvrir l’espace de noms utilisateur possédant l’espace de noms non utilisateur. Consultez B<ioctl_ns>(2).

source: User and group ID mappings: uid_map and gid_map
de: Benutzer- und Gruppenkennungabbildungen: uid_map und gid_map
fr: Correspondance des identifiants d'utilisateur et de groupe : uid_map et gid_map

source: When a user namespace is created, it starts out without a mapping of user IDs (group IDs) to the parent user namespace. The I</proc/>pidI</uid_map> and I</proc/>pidI</gid_map> files (available since Linux 3.5) expose the mappings for user and group IDs inside the user namespace for the process I<pid>. These files can be read to view the mappings in a user namespace and written to (once) to define the mappings.
de: Wenn ein Benutzernamensraum erstellt wird, beginnt er mit einer Abbildung der Benutzerkennungen (Gruppenkennungen) auf die des Vorgängernamensraumes. Die Dateien I</proc/>PIDI</uid_map> und I</proc/>PIDI</gid_map> (verfügbar seit Linux 3.5) legen diese Abbildungen für die Benutzer- und Gruppenkennungen innerhalb des Benutzernamensraumes für den Prozess I<PID> offen. Diese Dateien können ausgelesen werden, um die Abbildungen innerhalb eines Benutzernamensraums zu betrachten und (einmal) beschrieben zu werden, um diese Abbildungen zu definieren.

source: The description in the following paragraphs explains the details for I<uid_map>; I<gid_map> is exactly the same, but each instance of "user ID" is replaced by "group ID".
de: Die Beschreibung in den folgenden Absätzen erklärt die Details für I<uid_map>; I<gid_map> ist vollständig identisch, sofern jedes Vorkommen von »Benutzerkennung« durch »Gruppenkennung« ersetzt wird.
fr: Les paragraphes suivants décrivent I<uid_map> en détails. I<gid_map> est parfaitement analogue, chaque instance de « identifiant utilisateur » étant remplacée par « identifiant groupe ».

source: The I<uid_map> file exposes the mapping of user IDs from the user namespace of the process I<pid> to the user namespace of the process that opened I<uid_map> (but see a qualification to this point below). In other words, processes that are in different user namespaces will potentially see different values when reading from a particular I<uid_map> file, depending on the user ID mappings for the user namespaces of the reading processes.
de: Die Datei I<uid_map> legt die Abbildung der Benutzerkennung von dem Benutzernamensraum des Prozesses I<PID> in den Benutzernamensraum des Prozesses offen, der I<uid_map> öffnete (siehe aber auch die nachfolgende Qualifizierung dieses Punktes). Mit anderen Worten, Prozesse, die sich in verschiedenen Benutzernamensräumen befinden, werden möglicherweise andere Werte sehen, wenn sie aus einer bestimmten Datei I<uid_map> lesen, abhängig von der Benutzerkennungsabbildung für den Benutzernamensraum des lesenden Prozesses.
fr: Le fichier I<uid_map> présente le mappage entre les identifiants utilisateur de l'espace de noms utilisateur du processus I<pid> et ceux de l'espace de noms utilisateur du processus qui a ouvert I<uid_map> (mais consultez la réserve concernant ce point exposée ci-dessous). En d'autres termes, des processus qui se trouvent dans différents espaces de noms verront des valeurs différentes lors de la lecture d'un fichier I<uid_map> selon les mappages des identifiants utilisateur pour l'espace de noms utilisateur du processus qui effectue la lecture.

source: Each line in the I<uid_map> file specifies a 1-to-1 mapping of a range of contiguous user IDs between two user namespaces. (When a user namespace is first created, this file is empty.) The specification in each line takes the form of three numbers delimited by white space. The first two numbers specify the starting user ID in each of the two user namespaces. The third number specifies the length of the mapped range. In detail, the fields are interpreted as follows:
de: Jede Zeile der Datei I<uid_map> legt eine 1-zu-1-Abbildung des Bereichs fortlaufender Benutzerkennungen zwischen zwei Benutzernamensräumen fest. (Wenn ein Benutzernamensraum erstmalig erstellt wird, ist diese Datei leer.) Die Festlegung in jeder Zeile hat die Form von drei durch Leerraum getrennten Zahlen. Die ersten zwei Zahlen geben die am Anfang befindliche Benutzerkennung in jedem der zwei Benutzernamensräume an. Die dritte Zahl gibt die Länge des abgebildeten Bereichs an. Im Detail werden die Felder wie folgt interpretiert:
fr: Chaque ligne du fichier I<uid_map> affiche un mappage un-pour-un d'un intervalle d'identifiants utilisateur contigus de deux espaces de noms utilisateur. Lorsqu'un espace de noms utilisateur vient d'être créé, ce fichier est vide. Chaque ligne contient trois nombres délimités par des espaces. Les deux premiers nombres indiquent les premiers identifiants utilisateur de chacun des deux espaces de noms. Le troisième nombre indique la longueur de l'intervalle de mappage. Plus précisément, les champs sont interprétés de la façon suivante :

source: The start of the range of user IDs in the user namespace of the process I<pid>.
de: Der Anfang des Bereichs von Benutzerkennungen in dem Benutzernamensraum des Prozesses I<PID>.
fr: Le début de l'intervalle d'identifiants utilisateur dans l'espace de noms utilisateur du processus I<pid>.

source: The start of the range of user IDs to which the user IDs specified by field one map. How field two is interpreted depends on whether the process that opened I<uid_map> and the process I<pid> are in the same user namespace, as follows:
de: Der Anfang des Bereichs von Benutzerkennungen, auf die die Benutzerkennungen aus Feld eins abgebildet werden. Wie Feld zwei interpretiert wird, hängt davon ab, ob der Prozess, der I<uid_map> öffnete und der Prozess I<PID> sich in dem gleichen Benutzernamensraum befinden, wie folgt:
fr: Le début de l'intervalle d'identifiants utilisateur auquel mappe l'identifiant utilisateur indiqué dans le premier champ. Selon que le processus qui a ouvert le fichier I<uid_map> et le processus I<pid> sont ou non dans le même espace de noms, le deuxième champ est interprété de l'une des façons suivantes :

source: If the two processes are in different user namespaces: field two is the start of a range of user IDs in the user namespace of the process that opened I<uid_map>.
de: Falls sich die zwei Prozesse in verschiedenen Benutzernamensräumen befinden: Feld zwei ist der Anfang des Bereichs von Benutzerkennungen in dem Benutzernamensraum des Prozesses, der I<uid_map> öffnete.
fr: Si les deux processus sont dans différents espaces de noms utilisateur : le deuxième champ est le début de l'intervalle d'identifiants utilisateur dans l'espace de noms utilisateur du processus qui a ouvert I<uid_map>.

source: If the two processes are in the same user namespace: field two is the start of the range of user IDs in the parent user namespace of the process I<pid>. This case enables the opener of I<uid_map> (the common case here is opening I</proc/self/uid_map>) to see the mapping of user IDs into the user namespace of the process that created this user namespace.
de: Falls die zwei Prozesse im gleichen Benutzernamensraum sind: Feld zwei ist der Anfang des Bereichs von Benutzerkennungen in dem Vorgängerbenutzernamensraum des Prozesses I<PID>. Dieser Fall ermöglicht es dem Öffnenden von I<uid_map> (der typische Fall hier ist das Öffnen von I</proc/self/uid_map>) die Abbildung der Benutzerkennungen in den Benutzernamensraum des Prozesses, der diesen Benutzernamensraum erstellte, zu sehen.
fr: Si les deux processus sont dans le même espace de noms utilisateur : le second champ correspond au début de la séquence d'identifiants utilisateur dans l'espace de noms utilisateur parent du processus I<pid>. Cela permet au processus qui a ouvert I<uid_map> (généralement, le processus ouvre I</proc/self/uid_map>) de voir le mappage des identifiants utilisateur dans l'espace de noms utilisateur du processus qui a créé cet espace de noms utilisateur.

source: The length of the range of user IDs that is mapped between the two user namespaces.
de: Die Länge des Bereichs von Benutzerkennungen, die zwischen den zwei Benutzernamensräumen abgebildet wird.
fr: La longueur de l'intervalle des identifiants utilisateur qui est mappé entre les deux espaces de noms utilisateur.

source: System calls that return user IDs (group IDs)\(emfor example, B<getuid>(2), B<getgid>(2), and the credential fields in the structure returned by B<stat>(2)\(emreturn the user ID (group ID) mapped into the caller's user namespace.
de: Systemaufrufe, die Benutzerkennungen (Gruppenkennungen) zurückliefern\(embeispielsweise B<getuid>(2), B<getgid>(2) und die Berechtigungsdatenfelder in der durch B<stat>(2) zurückgelieferten Struktur\(emliefern die Benutzerkennung (Gruppenkennung) abgebildet auf den Benutzernamensraum des Aufrufenden zurück.
fr: Les appels système qui renvoient des identifiants utilisateur (des identifiant de groupes) \(em comme par exemple, B<getuid>(2), B<getgid>(2), et les champs relatifs aux droits dans la structure renvoyée par B<stat>(2) \(em affichent la valeur de l'identifiant utilisateur (l'identifiant de groupe) mappé dans l'espace de noms utilisateur de l'appelant.

source: When a process accesses a file, its user and group IDs are mapped into the initial user namespace for the purpose of permission checking and assigning IDs when creating a file. When a process retrieves file user and group IDs via B<stat>(2), the IDs are mapped in the opposite direction, to produce values relative to the process user and group ID mappings.
de: Wenn ein Prozess auf eine Datei zugreift, werden seine Benutzer- und Gruppenkennungen zum Zwecke der Zugriffsprüfung und der Zuweisungen von Kennungen beim Erstellen von Dateien auf die des anfänglichen Benutzernamensraumens abgebildet. Wenn ein Prozess die Dateibenutzer- und -gruppenkennungen über B<stat>(2) ermittelt, werden die Kennungen in die andere Richtung abgebildet, um Werte relativ zu den Prozessbenutzer- und -gruppenkennungsabildungen zu erstellen.
fr: Lorsqu'un processus accède à un fichier, ses identifiant utilisateur et groupe sont mappés dans l’espace de noms utilisateur initial pour pouvoir vérifier les droits ou pour assigner des identifiants lors de la création d'un fichier. Lorsqu'un processus obtient les identifiants utilisateur et groupe d'un fichier par la commande B<stat>(2), les identifiants sont évalués dans le sens inverse, afin de renvoyer les valeurs relatives aux mappages des ID utilisateur et de groupe du processus.

source: The initial user namespace has no parent namespace, but, for consistency, the kernel provides dummy user and group ID mapping files for this namespace. Looking at the I<uid_map> file (I<gid_map> is the same) from a shell in the initial namespace shows:
de: Der anfängliche Benutzernamensraum hat keinen Vorgängernamensraum. Aus Konsistenzgründen stellt der Kernel Pseudo-Benutzer- und -Gruppenkennungsabbildungsdateien für diesen Namensraum bereit. Wird vom anfänglichen Namensraum aus auf die Datei I<uid_map> (I<gid_map> ist identisch) geschaut, ergibt sich:
fr: L'espace de noms utilisateur initial n'a pas d'espace de noms parent, mais pour conserver la cohérence, le noyau lui attribue des fichiers de mappage d'identifiants utilisateur et groupe factices pour cet espace de noms. Si l'on consulte le fichier I<uid_map> (ou I<gid_map> de la même façon) depuis une invite de commande dans l'espace de noms initial, on peut voir :

source: This mapping tells us that the range starting at user ID 0 in this namespace maps to a range starting at 0 in the (nonexistent) parent namespace, and the length of the range is the largest 32-bit unsigned integer. This leaves 4294967295 (the 32-bit signed -1 value) unmapped. This is deliberate: I<(uid_t)\~-1> is used in several interfaces (e.g., B<setreuid>(2)) as a way to specify "no user ID". Leaving I<(uid_t)\~-1> unmapped and unusable guarantees that there will be no confusion when using these interfaces.
de: Diese Abbildung teilt uns mit, dass der Bereich bei der Benutzerkennung 0 in diesem Namensraum auf den Bereich beginnend bei 0 in dem (nicht existierenden) Vorgängernamensraum abgebildet ist und die Länge des Bereichs die größte vorzeichenlose 32-bit-Ganzzahl ist. Dies lässt 4294967295 (der vorzeichenbehaftete 32-bit-Wert) nicht abgebildet. Dies ist absichtlich: I<(uid_t)\~-1> wird von einer Reihe von Schnittstellen (z.B. B<setreuid>(2)) dazu verwandt, »keine Benutzerkennung« festzulegen. Da I<(uid_t)\~-1> nicht abgebildet und unbenutzbar ist, wird sichergestellt, dass es keine Verwirrung bei der Verwendung dieser Schnittstellen gibt.

source: Defining user and group ID mappings: writing to uid_map and gid_map
de: Definieren von Benutzer- und Gruppenkennungsabbildungen; Schreiben in uid_map und gid_map
fr: Création des mappages d'ID utilisateur et groupe : écriture dans uid_map et gid_map

source: After the creation of a new user namespace, the I<uid_map> file of I<one> of the processes in the namespace may be written to I<once> to define the mapping of user IDs in the new user namespace. An attempt to write more than once to a I<uid_map> file in a user namespace fails with the error B<EPERM>. Similar rules apply for I<gid_map> files.
de: Nach der Erstellung eines neuen Benutzernamensraumes kann die Datei I<uid_map> von I<einem> der Prozesse in dem Namensraum I<einmalig> geschrieben werden, um die Abbildung der Benutzerkennungen in dem neuen Benutzernamensraum zu definieren. Jeder Versuch, mehr als einmal in eine Datei I<uid_map> in einem Benutzernamensraum zu schreiben, schlägt mit dem Fehler B<EPERM> fehl. Ähnliche Regeln gelten für Dateien I<gid_map>.
fr: Après la création d'un nouvel espace de noms utilisateur, le fichier I<uid_map> de l'I<un> des processus de l'espace de noms peut être ouvert en écriture I<une seule fois> pour y consigner le mappage des identifiants utilisateur dans le nouvel espace de noms utilisateur. Toute tentative d'écrire plus d'une fois dans un fichier I<uid_map> se solde par un échec qui renvoie l'erreur B<EPERM>. Des règles analogues s'appliquent aux fichiers I<gid_map>.

source: The lines written to I<uid_map> (I<gid_map>) must conform to the following validity rules:
de: Die in I<uid_map> (I<gid_map>) geschriebenen Zeilen müssen die folgenden Gültigkeitsregeln erfüllen:

source: The three fields must be valid numbers, and the last field must be greater than 0.
de: Die drei Felder müssen gültige Zahlen sein und das letzte Feld muss größer als 0 sein.
fr: Les trois champs doivent être des nombres valables et le dernier champ doit être strictement positif.

source: Lines are terminated by newline characters.
de: Zeilen werden durch einen Zeilenumbruch beendet.
fr: Les lignes doivent se terminer par un saut de ligne.

source: There is a limit on the number of lines in the file. In Linux 4.14 and earlier, this limit was (arbitrarily) set at 5 lines. Since Linux 4.15, the limit is 340 lines. In addition, the number of bytes written to the file must be less than the system page size, and the write must be performed at the start of the file (i.e., B<lseek>(2) and B<pwrite>(2) can't be used to write to nonzero offsets in the file).
de: Es gibt eine Beschränkung bezüglich der Anzahl der Zeilen in der Datei. In Linux 4.14 und älter war diese Beschränkung (willkürlich) auf 5 Zeilen gesetzt. Seit Linux 4.15 ist diese Beschränkung 340 Zeilen. Zusätzlich muss die Anzahl an in diese Datei geschriebenen Bytes kleiner als die Seitengröße des Systems sein und das Schreiben muss am Anfang der Datei beginnen (d.h. B<lseek>(2) und B<pwrite>(2) können nicht zum Schreiben an einen von Null verschiedenen Versatz in der Datei verwandt werden).
fr: Il y a une limite (arbitraire) du nombre de lignes que peut contenir le fichier. Dans Linux 4.14 et précédents, la limite est (arbitrairement) de 5 lignes. Depuis Linux 4.15, la limite est de 340 lignes. En outre, le nombre d'octets inscrits dans le fichier doit être inférieur à la taille d'une page du système, et l'écriture doit être réalisée au début du fichier (c’est-à-dire B<lseek>(2) et B<pwrite>(2) ne peuvent être utilisées pour écrire dans le fichier avec un décalage non nul).
