Repository: sebras/manpages-l10n
Catalog: po/*/man7/x25.7.po
Languages: de, es

source: Linux man-pages (unreleased)
es: Páginas de manual de Linux (no publicado)

source: NAME
de: BEZEICHNUNG
es: NOMBRE

source: x25 - ITU-T X.25 / ISO-8208 protocol interface
es: x25 - interfaz del protocolo ITU-T X.25 / ISO-8208

source: SYNOPSIS
de: ÜBERSICHT
es: SINOPSIS

source: DESCRIPTION
de: BESCHREIBUNG
es: DESCRIPCIÓN

source: X25 sockets provide an interface to the X.25 packet layer protocol. This allows applications to communicate over a public X.25 data network as standardized by International Telecommunication Union's recommendation X.25 (X.25 DTE-DCE mode). X25 sockets can also be used for communication without an intermediate X.25 network (X.25 DTE-DTE mode) as described in ISO-8208.
de: X25-Sockets bieten eine Schnittstelle zur Netzwerkschicht (Packet Layer) des X.25-Protokolls. Dies ermöglicht es Anwendungen, über ein öffentliches X.25-Datennetz zu kommunizieren, wie es von der International Telecommunication Union in der Empfehlung X.25 (X.25 DTE-DCE-Modus) genormt ist. X25-Sockets können auch für die Kommunikation ohne zwischengeschaltetes X.25-Netz verwendet werden (X.25 DTE-DTE-Modus, wie in ISO-8208 beschrieben).
es: Los conectores (sockets) X25 proporcionan una interfaz al protocolo de la capa de paquetes X.25. Éstos permiten a las aplicaciones comunicarse a través de una red pública de datos X.25 según establece la recomendación X.25 de la International Telecommunication Union (X.25 modo DTE-DCE). Los conectores X25 también se pueden usar para comunicarse sin una red X.25 intermedia (X.25 modo DTE-DTE) como se describe en ISO-8208.

source: Message boundaries are preserved \(em a B<read>(2) from a socket will retrieve the same chunk of data as output with the corresponding B<write>(2) to the peer socket. When necessary, the kernel takes care of segmenting and reassembling long messages by means of the X.25 M-bit. There is no hard-coded upper limit for the message size. However, reassembling of a long message might fail if there is a temporary lack of system resources or when other constraints (such as socket memory or buffer size limits) become effective. If that occurs, the X.25 connection will be reset.
de: Nachrichtengrenzen bleiben erhalten \(em ein B<read>(2) von einem Socket wird die gleiche Datenmenge abrufen wie das entsprechende B<write>(2) an den Socket des Peer-Rechners. Wenn nötig, erledigt der Kernel die Segmentierung und das Zusammensetzen langer Nachrichten mittels des X.25-M-Bits. Es gibt keine hart codierte Obergrenze für die Größe von Nachrichten. Allerdings kann die Rekonstruktion einer langen Nachricht fehlschlagen, wenn ein vorübergehender Mangel an System-Ressourcen oder andere Einschränkungen (wie z.B. Begrenzungen für Socket-Speicher oder Puffer) wirksam werden. In solchen Fällen wird die X.25-Verbindung zurückgesetzt.
es: Se conservan los límites de los mensajes (una operación B<read>(2) de un conector recuperará la misma cantidad de datos que la salida producida con la correspondiente operación B<write(2)> en el conector asociado del otro extremo). Cuando es necesario, el núcleo se preocupa de segmentar y reensamblar los mensajes largos mediante el bit M de X.25. No existe un límite superior fijo para el tamaño de mensaje. Sin embargo, el reensamblaje de un mensaje largo puede fallar si se produce una escasez temporal de recursos del sistema o cuando se ponen de manifiesto otras limitaciones (como la memoria de los conectores o los límites de los tamaños de los buffers). En tal caso, se reiniciará la conexión X.25.

source: Socket addresses
de: Socket-Adressen
es: Direcciones de los conectores

source: The B<AF_X25> socket address family uses the I<struct sockaddr_x25> for representing network addresses as defined in ITU-T recommendation X.121.
de: Die B<AF_X25>-Socket-Adressfamilie nutzt die I<struct sockaddr_x25> für die Darstellung von Netzwerkadressen, wie sie in der ITU-T-Empfehlung X.121 definiert sind.
es: La familia de direcciones de los conectores B<AF_X25> usa la estructura I<struct sockaddr_x25> para representar las direcciones de red tal y como se definen en la recomendación X.121 del ITU-T.

source: struct sockaddr_x25 { sa_family_t sx25_family; /* must be AF_X25 */ x25_address sx25_addr; /* X.121 Address */ };
de: struct sockaddr_x25 { sa_family_t sx25_family; /* muss auf AF_X25 gesetzt werden*/ x25_address sx25_addr; /* X.121-Adresse */ };
es: struct sockaddr_x25 { sa_family_t sx25_family; /* debe ser AF_X25 */ x25_address sx25_addr; /* Dirección X.121 */ };

source: I<sx25_addr> contains a char array I<x25_addr[]> to be interpreted as a null-terminated string. I<sx25_addr.x25_addr[]> consists of up to 15 (not counting the terminating null byte) ASCII characters forming the X.121 address. Only the decimal digit characters from \(aq0\(aq to \(aq9\(aq are allowed.
de: I<sx25_addr> enthält ein Zeichenfeld I<x25_addr[]>, das als nullterminierte Zeichenkette zu interpretieren ist. I<sx25_addr.x25_addr[]> besteht aus bis zu 15 (ohne das abschließende Null-Byte) ASCII-Zeichen, die die X.121-Adresse bilden. Es sind nur die Dezimalziffern von \(aq0\(aq bis \(aq9\(aq erlaubt.
es: I<sx25_addr> contiene un array de caracteres, I<x25_addr[]>, que se interpreta como una cadena terminada en un carácter nulo. I<sx25_addr.x25_addr[]>consiste en un máximo de 15 caracteres ASCII (sin contar el 0 del final) que forman la dirección X.121. Sólo se permiten los caracteres del \(aq0\(aq al \(aq9\(aq

source: Socket options
de: Socket-Optionen
es: Opciones de los conectores

source: The following X.25-specific socket options can be set by using B<setsockopt>(2) and read with B<getsockopt>(2) with the I<level> argument set to B<SOL_X25>.
de: Die folgenden für X.25 spezifischen Socket-Optionen können mit B<setsockopt>(2) gesetzt und mit B<getsockopt>(2) gelesen werden. Das Argument I<level> muss dafür auf B<SOL_X25> gesetzt werden.
es: Las siguientes opciones específicas de los conectores X.25 se pueden configurar usando B<setsockopt>(2) y se pueden leer con B<getsockopt>(2), asignándole al parámetro de I<nivel> el valor B<SOL_X25>.

source: Controls whether the X.25 Q-bit (Qualified Data Bit) is accessible by the user. It expects an integer argument. If set to 0 (default), the Q-bit is never set for outgoing packets and the Q-bit of incoming packets is ignored. If set to 1, an additional first byte is prepended to each message read from or written to the socket. For data read from the socket, a 0 first byte indicates that the Q-bits of the corresponding incoming data packets were not set. A first byte with value 1 indicates that the Q-bit of the corresponding incoming data packets was set. If the first byte of the data written to the socket is 1, the Q-bit of the corresponding outgoing data packets will be set. If the first byte is 0, the Q-bit will not be set.
es: Controla si el usuario puede acceder al bit Q de X.25 (Qualified Data Bit, bit de datos acreditados). Se espera un argumento entero. Si es 0 (valor por defecto), nunca se activa el bit Q para los paquetes de salida y se ignora el bit Q de los paquetes de entrada. Si es 1, se añade un primer byte adicional a cada mensaje leído de o escrito en el conector. Para los datos leídos del conector, un primer byte 0 indica que no estaba activo el bit Q de los paquetes de datos de entrada correspondientes. Un primer byte con valor 1 indica que estaba activo el bit Q de los paquetes de datos de entrada correspondientes. Si el primer byte de los datos escritos en el conector es 1, se activa el bit Q de los paquetes de datos de salida correspondientes. Si el primer byte es 0, no se activará el bit Q.

source: VERSIONS
de: VERSIONEN
es: VERSIONES

source: The AF_X25 protocol family is a new feature of Linux 2.2.
de: Die AF_X25-Protokollfamilie ist ein neues Merkmal von Linux 2.2.
es: La familia de procotolo AF_X25 es una nueva característica de la versión 2.2 de Linux.

source: BUGS
de: FEHLER
es: ERRORES

source: Plenty, as the X.25 PLP implementation is B<CONFIG_EXPERIMENTAL>.
de: viele, weil die X.25-PLP-Implementierung als B<CONFIG_EXPERIMENTAL> gekennzeichnet ist
es: Bastantes, ya que la implementación X.25 PLP es B<CONFIG_EXPERIMENTAL>.

source: This man page is incomplete.
de: Diese Handbuchseite ist nicht vollständig.
es: Esta página de manual está incompleta.

source: There is no dedicated application programmer's header file yet; you need to include the kernel header file I<E<lt>linux/x25.hE<gt>>. B<CONFIG_EXPERIMENTAL> might also imply that future versions of the interface are not binary compatible.
de: Es gibt noch keine spezielle Header-Datei für Anwendungsprogrammierer; Sie müssen die Kernel-Header-Datei I<E<lt> linux/x25.hE<gt>> verwenden. B<CONFIG_EXPERIMENTAL> könnte auch bedeuten, dass zukünftige Versionen der Schnittstelle nicht binärkompatibel sind.
es: Todavía no existe un fichero cabecera específico para el programador de aplicaciones. Necesita incluir el fichero cabecera I<E<lt>linux/x25.hE<gt>> del núcleo. B<CONFIG_EXPERIMENTAL> también implica que la versiones futuras de la interfaz podrían no ser compatibles a nivel binario.

source: X.25 N-Reset events are not propagated to the user process yet. Thus, if a reset occurred, data might be lost without notice.
de: X.25-N-Reset-Ereignisse werden derzeit noch nicht an den Prozess des Anwenders weitergereicht. Somit können im Fall eines Resets (Zurücksetzens) Daten verloren gehen, ohne dass der Verlust gemeldet wird.
es: Los eventos N-Reset de X.25 todavía no se propagan al proceso de usuario. Por eso, si se produce un reinicio, se podrían perder datos sin darse cuenta.

source: SEE ALSO
de: SIEHE AUCH
es: VÉASE TAMBIÉN

source: Jonathan Simon Naylor: \(lqThe Re-Analysis and Re-Implementation of X.25.\(rq The URL is E<.UR ftp://ftp.pspt.fi\:/pub\:/ham\:/linux\:/ax25\:/x25doc.tgz> E<.UE .>
es: Jonathan Simon Naylor: \(lqReanálisis y reimplementación de X.25.\(rq La URL es: E<.UR ftp://ftp.pspt.fi\:/pub\:/ham\:/linux\:/ax25\:/ x25doc.tgz> E<.UE .>

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
es: Manual del Programador de Linux

source: COLOPHON
de: KOLOPHON
es: COLOFÓN

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.13 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: x25 - ITU-T X.25 / ISO-8208 protocol interface.
de: x25 - Protokollschnittstelle für ITU-T X.25 / ISO-8208
es: x25 - interfaz del protocolo ITU-T X.25 / ISO-8208.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 3.65 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at \%http://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 3.65 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts und Informationen, wie Fehler gemeldet werden können, finden sich unter \%http://www.kernel.org/doc/man-pages/.
