Repository: sebras/manpages-l10n
Catalog: po/primary/man5/machine-*.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: machine-id - Local machine ID configuration file
de: machine-id - Lokale Maschinenkennungkonfigurationsdatei

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: The /etc/machine-id file contains the unique machine ID of the local system that is set during installation or boot\&. The machine ID is a single newline-terminated, hexadecimal, 32-character, lowercase ID\&. When decoded from hexadecimal, this corresponds to a 16-byte/128-bit value\&. This ID may not be all zeros\&.
de: Die Datei /etc/machine-id enthält eine eindeutige Maschinenkennung des lokalen Systems, die während der Installation oder des Systemstarts gesetzt wird\&. Die Maschinenkennung ist eine einzelne hexadezimale 32-Zeichen (Kleinbuchstaben) Kennung, die mit einem Zeilenumbruch abgeschlossen wird\&. Nach der Dekodierung aus dem hexadezimalen entspricht sie einem 16-Byte/128-Bit-Wert\&. Diese Kennung darf nicht komplett nur aus Nullen bestehen\&.

source: The machine ID is usually generated from a random source during system installation or first boot and stays constant for all subsequent boots\&. Optionally, for stateless systems, it is generated during runtime during early boot if necessary\&.
de: Die Maschinenkennung wird normalerweise während der Systeminstallation oder des ersten Systemstarts aus einer Zufallsquelle erstellt und bleibt für alle nachfolgenden Systemstarts konstant\&. Für zustandslose Systeme kann sie optional falls notwendig während der Laufzeit während des frühen Systemstarts erstellt werden\&.

source: The machine ID may be set, for example when network booting, with the I<systemd\&.machine_id=> kernel command line parameter or by passing the option B<--machine-id=> to systemd\&. An ID is specified in this manner has higher priority and will be used instead of the ID stored in /etc/machine-id\&.
de: Die Maschinenkennung kann beispielsweise beim Systemstart über Netz mit dem Kernelbefehlszeilenparameter I<systemd\&.machine_id=> oder durch Übergabe der Option B<--machine-id=> an Systemd gesetzt werden\&. Eine in dieser Weise festgelegte Maschinenkennung hat eine höhere Priorität und wird statt der in /etc/machine-id gespeicherten Kennung verwandt\&.

source: The machine ID does not change based on local or network configuration or when hardware is replaced\&. Due to this and its greater length, it is a more useful replacement for the B<gethostid>(3) call that POSIX specifies\&.
de: Die Maschinenkennung ändert sich nicht, wenn sich die lokale oder Netzkonfiguration ändert oder die Hardware ausgetauscht wird\&. Daher und aufgrund seiner größeren Länge ist sie eine nützlichere Ersetzung des von POSIX festgelegten Aufrufs B<gethostid>(3)\&.

source: This machine ID adheres to the same format and logic as the D-Bus machine ID\&.
de: Diese Maschinenkennung folgt dem gleichen Format und der gleichen Logik wie die Maschinenkennung von D-Bus\&.

source: This ID uniquely identifies the host\&. It should be considered "confidential", and must not be exposed in untrusted environments, in particular on the network\&. If a stable unique identifier that is tied to the machine is needed for some application, the machine ID or any part of it must not be used directly\&. Instead the machine ID should be hashed with a cryptographic, keyed hash function, using a fixed, application-specific key\&. That way the ID will be properly unique, and derived in a constant way from the machine ID but there will be no way to retrieve the original machine ID from the application-specific one\&. The B<sd_id128_get_machine_app_specific>(3) API provides an implementation of such an algorithm\&.
de: Diese Kennung identifiziert den Rechner eindeutig\&. Sie sollte »vertraulich« behandelt und nicht in unvertrauenswürdigen Umgebungen, insbesondere im Netz offengelegt werden\&. Falls für einige Anwendungen eine stabile Kennung, die an eine Maschine gebunden ist, benötigt wird, darf die Maschinenkennung oder Teile davon nicht direkt verwandt werden\&. Stattdessen sollte die Maschinenkennung mit einer kryptographischen, mit einem Schlüssel versehenen Funktion in einen Hash verwandelt werden, wobei ein fester, anwendungsbezogener Schlüssel verwandt werden sollte\&. Damit ist die Kennung ausreichend eindeutig und in einer konstanten Art und Weise von der Maschinenkennung abgeleitet, aber es gibt dann keine Möglichkeit, die ursprüngliche Maschinenkennung aus der anwendungsspezifischen abzuleiten\&. Das API B<sd_id128_get_machine_app_specific>(3) stellt eine Implementierung eines solchen Algorithmus bereit\&.

source: INITIALIZATION
de: INITIALISIERUNG

source: For normal operating system installations, where a custom image is created for a specific machine, /etc/machine-id should be populated during installation\&.
de: Für normale Betriebssysteminstallationen, bei denen ein angepasstes Abbild für eine bestimmte Maschine erstellt wird, sollte /etc/machine-id während der Installation befüllt werden\&.

source: B<systemd-machine-id-setup>(1) may be used by installer tools to initialize the machine ID at install time, but /etc/machine-id may also be written using any other means\&.
de: B<systemd-machine-id-setup>(1) kann von Installationswerkzeugen verwandt werden, um die Maschinenkennung zum Installationszeitpunkt zu initialisieren, aber /etc/machine-id kann auch mit anderen Mitteln geschrieben werden\&.

source: When a machine is booted with B<systemd>(1) the ID of the machine will be established\&. If I<systemd\&.machine_id=> or B<--machine-id=> options (see first section) are specified, this value will be used\&. Otherwise, the value in /etc/machine-id will be used\&. If this file is empty or missing, systemd will attempt to use the D-Bus machine ID from /var/lib/dbus/machine-id, the value of the kernel command line option I<container_uuid>, the KVM DMI product_uuid (on KVM systems), and finally a randomly generated UUID\&.
de: Wenn eine Maschine mit B<systemd>(1) gestartet wird, wird die Kennung der Maschine etabliert\&. Falls die Optionen I<systemd\&.machine_id=> oder B<--machine-id=> (siehe ersten Abschnitt) festgelegt werden, wird dieser Wert verwandt\&. Falls diese Datei leer ist oder fehlt, wird Systemd versuchen, die D-Bus-Maschinenkennung aus /var/lib/dbus/machine-id, den Wert der Kernelbefehlszeilenoption I<container_uuid>, die KVM-DMI-product_uuid (auf KVM-Systemen) und schließlich eine zufällig erstellte UUID zu verwenden\&.

source: B<systemd-machine-id-commit.service>(8) will attempt to write the machine ID to the file system if /etc/machine-id or /etc are read-only during early boot but become writable later on\&.
de: B<systemd-machine-id-commit.service>(8) wird versuchen, die Maschinenkennung in das Dateisystem zu schreiben, falls /etc/machine-id oder /etc während des frühen Systemstarts nur lesbar sind aber später schreibbar werden\&.

source: RELATION TO OSF UUIDS
de: BEZUG ZU OSF UUIDS

source: Note that the machine ID historically is not an OSF UUID as defined by \m[blue]B<RFC 4122>\m[]\&\s-2\u[1]\d\s+2, nor a Microsoft GUID; however, starting with systemd v30, newly generated machine IDs do qualify as v4 UUIDs\&.
de: Beachten Sie, dass die Maschinenkennung historisch gesehen keine OSF-UUID, wie sie durch \m[blue]B<RFC 4122>\m[]\&\s-2\u[1]\d\s+2 definiert wird, noch eine Microsoft GUID ist; beginnend mit Systemd v30 werden sich allerdings neu erstellte Kennungen als v4 UUIDs eignen\&.

source: In order to maintain compatibility with existing installations, an application requiring a UUID should decode the machine ID, and then apply the following operations to turn it into a valid OSF v4 UUID\&. With "id" being an unsigned character array:
de: Zur Wahrung der Kompatibilität mit bestehenden Installationen sollte jede Anwendung, die eine UUID benötigt, die Maschinenkennung dekodieren und dann die nachfolgenden Aktionen anwenden, um sie in eine gültige OSF-v4-UUID zu wandeln (hierbei ist »id« ein vorzeichenfreies Zeichenfeld):

source: /* Set UUID version to 4 --- truly random generation */ id[6] = (id[6] & 0x0F) | 0x40; /* Set the UUID variant to DCE */ id[8] = (id[8] & 0x3F) | 0x80;
de: /* UUID auf Version 4 setzen --- wirklich zufällige Erzeugung */ id[6] = (id[6] & 0x0F) | 0x40; /* Die UUID-Variante auf DCE setzen */ id[8] = (id[8] & 0x3F) | 0x80;

source: (This code is inspired by "generate_random_uuid()" of drivers/char/random\&.c from the Linux kernel sources\&.)
de: (Dieser Code ist von »generate_random_uuid()« von drivers/char/random\&.c aus den Linux-Kernelquellen inspiriert\&.)

source: HISTORY
de: GESCHICHTE

source: The simple configuration file format of /etc/machine-id originates in the /var/lib/dbus/machine-id file introduced by D-Bus\&. In fact, this latter file might be a symlink to /etc/machine-id\&.
de: Das einfache Konfigurationsdateiformat von /etc/machine-id entspringt der durch D-Bus eingeführten Datei /var/lib/dbus/machine-id\&. Tatsächlich kann letztere Datei ein Symlink auf /etc/machine-id sein\&.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN
