Repository: sebras/manpages-l10n
Catalog: po/primary/man5/systemd.path.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd.path - Path unit configuration
de: systemd.path - Pfad-Unit-Konfiguration

source: SYNOPSIS
de: ÜBERSICHT

source: I<path>\&.path
de: I<Pfad>\&.path

source: DESCRIPTION
de: BESCHREIBUNG

source: A unit configuration file whose name ends in "\&.path" encodes information about a path monitored by systemd, for path-based activation\&.
de: Eine Unit-Konfigurationsdatei, deren Namen in »\&.path« endet, kodiert Informationen über einen durch Systemd überwachten Pfad, für Pfad-basierte Aktivierung\&.

source: This man page lists the configuration options specific to this unit type\&. See B<systemd.unit>(5) for the common options of all unit configuration files\&. The common configuration items are configured in the generic [Unit] and [Install] sections\&. The path specific configuration options are configured in the [Path] section\&.
de: Diese Handbuchsseite führt die für diesen Unit-Typ spezifischen Konfigurationsoptionen auf\&. Siehe B<systemd.unit>(5) für die gemeinsamen Optionen aller Unit-Konfigurationsdateien\&. Die gemeinsamen Konfigurationseinträge werden in den generischen Abschnitten [Unit] und [Install] konfiguriert\&. Die Pfad-spezifischen Konfigurationsoptionen werden in dem Abschnitt [Path] konfiguriert\&.

source: For each path file, a matching unit file must exist, describing the unit to activate when the path changes\&. By default, a service by the same name as the path (except for the suffix) is activated\&. Example: a path file foo\&.path activates a matching service foo\&.service\&. The unit to activate may be controlled by I<Unit=> (see below)\&.
de: Für jede Pfaddatei muss eine passende Unit-Datei existieren, die die bei Änderungen von Pfaden zu aktivierende Unit beschreibt\&. Standardmäßig wird ein Dienst mit dem gleichen Namen (außer der Endung) wie der Pfad aktiviert\&. Beispiel: Eine Pfad-Datei foo\&.path aktiviert einen passenden Dienst foo\&.service\&. Die zu aktivierende Unit kann mit I<Unit=> (siehe unten) gesteuert werden\&.

source: Internally, path units use the B<inotify>(7) API to monitor file systems\&. Due to that, it suffers by the same limitations as inotify, and for example cannot be used to monitor files or directories changed by other machines on remote NFS file systems\&.
de: Intern verwenden Pfad-Units das B<inotify>(7)-API, um Dateisysteme zu überwachen\&. Daher unterliegen sie den gleichen Beschränkungen wie Inotify und können beispielsweise keine Dateien oder Verzeichnisse überwachen, die von anderen Maschinen auf fernen NFS-Dateisystemen geändert werden\&.

source: The following dependencies are implicitly added:
de: Die folgenden Abhängigkeiten werden implizit hinzugefügt:

source: If a path unit is beneath another mount unit in the file system hierarchy, both a requirement and an ordering dependency between both units are created automatically\&.
de: Falls eine Pfad-Unit unterhalb einer anderen Einhänge-Unit in der Dateisystem-Hierarchie ist, werden sowohl eine Bedingungs- als auch eine Ordnungsabhängigkeit automatisch erstellt\&.

source: An implicit I<Before=> dependency is added between a path unit and the unit it is supposed to activate\&.
de: Zwischen einer Pfad-Unit und der Unit, die sie aktivieren soll, wird eine implizite I<Before=>-Abhängigkeit hinzugefügt\&.

source: The following dependencies are added unless I<DefaultDependencies=no> is set:
de: Die folgenden Abhängigkeiten werden hinzugefügt, es sei denn, I<DefaultDependencies=no> ist gesetzt:

source: Path units will automatically have dependencies of type I<Before=> on paths\&.target, dependencies of type I<After=> and I<Requires=> on sysinit\&.target, and have dependencies of type I<Conflicts=> and I<Before=> on shutdown\&.target\&. These ensure that path units are terminated cleanly prior to system shutdown\&. Only path units involved with early boot or late system shutdown should disable I<DefaultDependencies=> option\&.
de: Pfad-Units werden automatisch Abhängigkeiten vom Typ I<Before=> von paths\&.target, Abhängigkeiten vom Typ I<After=> und I<Requires=> von sysinit\&.target und Abhängigkeiten vom Typ I<Conflicts=> und I<Before=> von shutdown\&.target haben\&. Dies stellt sicher, dass Pfad-Units sauber vor dem Herunterfahren des Systems beendet werden\&. Nur Pfad-Units, die im frühen Systemstart oder spät beim Herunterfahren beteiligt sind, sollten die Option I<DefaultDependencies=> deaktivieren\&.

source: OPTIONS
de: OPTIONEN

source: Path files must include a [Path] section, which carries information about the path(s) it monitors\&. The options specific to the [Path] section of path units are the following:
de: Pfad-Units müssen einen Abschnitt [Path] enthalten, der Informationen über den/die überwachten Pfad(e) transportiert\&. Die für den Abschnitt [Path] von Pfad-Units speziellen Optionen sind:

source: Defines paths to monitor for certain changes: I<PathExists=> may be used to watch the mere existence of a file or directory\&. If the file specified exists, the configured unit is activated\&. I<PathExistsGlob=> works similar, but checks for the existence of at least one file matching the globbing pattern specified\&. I<PathChanged=> may be used to watch a file or directory and activate the configured unit whenever it changes\&. It is not activated on every write to the watched file but it is activated if the file which was open for writing gets closed\&. I<PathModified=> is similar, but additionally it is activated also on simple writes to the watched file\&. I<DirectoryNotEmpty=> may be used to watch a directory and activate the configured unit whenever it contains at least one file\&.
de: Definiert die auf bestimmte Änderungen zu überwachenden Pfade: I<PathExists=> kann zum Beobachten der simplen Existenz einer Datei oder eines Verzeichnisses verwandt werden\&. Falls die Datei existiert, wird die konfigurierte Unit aktiviert\&. I<PathExistsGlob=> funktioniert ähnlich, aber prüft auf die Existenz mindestens einer Datei, die auf das festgelegte Glob-Muster passt\&. I<PathChanged=> kann zum Beobachten einer Datei oder eines Verzeichnisses und zum Aktivieren der konfigurierten Unit, wenn es/sie sich ändert, verwandt werden\&. Sie wird nicht bei jedem Schreibzugriff auf die beobachtete Datei aktiviert, sondern sie wird aktiviert, wenn die für das Schreiben geöffnete Datei geschlossen wird\&. I<PathModified=> ist ähnlich, aber zusätzlich wird sie bei einfachen Schreibzugriffen auf die beobachtete Datei aktiviert\&. I<DirectoryNotEmpty=> kann dazu verwandt werden, ein Verzeichnis zu beobachten und die konfigurierte Unit zu aktivieren, wenn es mindestens eine Datei enthält\&.

source: The arguments of these directives must be absolute file system paths\&.
de: Die Argumente dieser Direktiven müssen absolute Dateisystempfade sein\&.

source: Multiple directives may be combined, of the same and of different types, to watch multiple paths\&. If the empty string is assigned to any of these options, the list of paths to watch is reset, and any prior assignments of these options will not have any effect\&.
de: Mehrere Verzeichnisse können kombiniert werden, vom gleichen und verschiedenen Typen, um mehrere Pfade zu beobachten\&. Falls einer der Optionen die leere Zeichenkette zugeordnet wird, wird die Liste der zu beobachtenden Pfade zurückgesetzt und jede vorherige Zuweisung von diesen Optionen wird keinen Effekt zeigen\&.

source: If a path already exists (in case of I<PathExists=> and I<PathExistsGlob=>) or a directory already is not empty (in case of I<DirectoryNotEmpty=>) at the time the path unit is activated, then the configured unit is immediately activated as well\&. Something similar does not apply to I<PathChanged=> and I<PathModified=>\&.
de: Falls zum Zeitpunkt der Aktivierung der Unit ein Pfad bereits existiert (im Falle von I<PathExists=> und I<PathExistsGlob=>) oder ein Verzeichnis bereits nicht leer ist (im Falle von I<DirectoryNotEmpty=>), dann wird die konfigurierte Unit auch sofort aktiviert\&. Für I<PathChanged=> und I<PathModified=> gilt etwas ähnliches nicht\&.

source: If the path itself or any of the containing directories are not accessible, B<systemd> will watch for permission changes and notice that conditions are satisfied when permissions allow that\&.
de: Falls der Pfad selbst oder eines der enthaltenen Verzeichnisse nicht zugreifbar ist, wird B<systemd> auf Rechteänderungen prüfen und bemerken, dass die Bedingungen erfüllt sind, wenn die Berechtigungen es erlauben\&.

source: The unit to activate when any of the configured paths changes\&. The argument is a unit name, whose suffix is not "\&.path"\&. If not specified, this value defaults to a service that has the same name as the path unit, except for the suffix\&. (See above\&.) It is recommended that the unit name that is activated and the unit name of the path unit are named identical, except for the suffix\&.
de: Die zu aktivierende Unit, wenn sich eine der konfigurierten Pfade ändert\&. Das Argument ist ein Unit-Name, deren Endung nicht »\&.path« ist\&. Falls nicht festgelegt, ist die Vorgabe für diesen Wert der Dienst, der bis auf die Endung den gleichen Namen wie die Pfad-Unit hat\&. (Siehe oben\&.) Es wird empfohlen, dass der Unit-Name, der aktiviert wird, und der Unit-Name der Pfad-Unit abgesehen von der Endung identisch sind\&.

source: Takes a boolean argument\&. If true, the directories to watch are created before watching\&. This option is ignored for I<PathExists=> settings\&. Defaults to B<false>\&.
de: Akzeptiert ein logisches Argument\&. Falls wahr, werden die zu beobachtenden Verzeichnis vor der Beobachtung erstellt\&. Diese Option wird für I<PathExists=>-Einstellungen ignoriert\&. Standardmäßig B<false>\&.

source: If I<MakeDirectory=> is enabled, use the mode specified here to create the directories in question\&. Takes an access mode in octal notation\&. Defaults to B<0755>\&.
de: Falls I<MakeDirectory=> aktiviert ist, wird der hier festgelegte Modus verwandt, um die in Frage kommenden Verzeichnisse zu erstellen\&. Akzeptiert einen Zugriffsmodus in oktaler Notation\&. Standardmäßig B<0755>\&.

source: SEE ALSO
de: SIEHE AUCH
