Repository: sebras/manpages-l10n
Catalog: po/*/man3/atan2.3.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: atan2, atan2f, atan2l - arc tangent function of two variables
de: atan2, atan2f, atan2l - die Arkustangens-Funktion zweier Variablen

source: SYNOPSIS
de: ÜBERSICHT

source: Link with I<-lm>.
de: Linken Sie mit der Option I<-lm>.

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: _ISOC99_SOURCE || _POSIX_C_SOURCE E<gt>= 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
de: _ISOC99_SOURCE || _POSIX_C_SOURCE E<gt>= 200112L || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: DESCRIPTION
de: BESCHREIBUNG

source: These functions calculate the principal value of the arc tangent of I<y/x>, using the signs of the two arguments to determine the quadrant of the result.
de: Diese Funktionen berechnen den Hauptwert des Arkustangens von I<y/x>. Mit den Vorzeichen der beiden Argumente wird der Quadrant des Ergebnisses bestimmt.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, these functions return the principal value of the arc tangent of I<y/x> in radians; the return value is in the range [-pi,\ pi].
de: Bei Erfolg geben diese Funktionen den Hauptwert des Arkustangens von I<y/x> im Bogenmaß zurück; der Rückgabewert liegt im Intervall [-Pi,\ Pi].

source: If I<y> is +0 (-0) and I<x> is less than 0, +pi (-pi) is returned.
de: Wenn I<y> gleich +0 (-0) und I<x> kleiner als 0 ist, wird +Pi (-Pi) zurückgegeben.

source: If I<y> is +0 (-0) and I<x> is greater than 0, +0 (-0) is returned.
de: Wenn I<y> gleich +0 (-0) und I<x> größer als 0 ist, wird +0 (-0) zurückgegeben.

source: If I<y> is less than 0 and I<x> is +0 or -0, -pi/2 is returned.
de: Wenn I<y> kleiner als 0 ist und I<x> ist +0 oder -0, wird -Pi/2 zurückgegeben.

source: If I<y> is greater than 0 and I<x> is +0 or -0, pi/2 is returned.
de: Wenn I<y> größer als 0 und I<x> gleich +0 oder -0 ist, wird Pi/2 zurückgegeben.

source: If either I<x> or I<y> is NaN, a NaN is returned.
de: Wenn entweder I<x> oder I<y> ein NaN (»Not a Number«, keine Zahl) ist, wird ein NaN zurückgegeben.

source: If I<y> is +0 (-0) and I<x> is -0, +pi (-pi) is returned.
de: Wenn I<y> gleich +0 (-0) und I<x> gleich -0 ist, wird +Pi (-Pi) zurückgegeben.

source: If I<y> is +0 (-0) and I<x> is +0, +0 (-0) is returned.
de: Wenn I<y> gleich +0 (-0) und I<x> gleich +0 ist, wird +0 (-0) zurückgegeben.

source: If I<y> is a finite value greater (less) than 0, and I<x> is negative infinity, +pi (-pi) is returned.
de: Ist I<y> ein endlicher Wert größer (kleiner) als 0 und ist I<x> minus unendlich, wird +Pi (-Pi) zurückgegeben.

source: If I<y> is a finite value greater (less) than 0, and I<x> is positive infinity, +0 (-0) is returned.
de: Ist I<y> ein endlicher Wert größer (kleiner) als 0 und ist I<x> plus unendlich, wird +0 (-0) zurückgegeben.

source: If I<y> is positive infinity (negative infinity), and I<x> is finite, pi/2 (-pi/2) is returned.
de: Ist I<y> plus unendlich (minus unendlich) und ist I<x> endlich, wird Pi/2 (-Pi/2) zurückgegeben.

source: If I<y> is positive infinity (negative infinity) and I<x> is negative infinity, +3*pi/4 (-3*pi/4) is returned.
de: Ist I<y> plus unendlich (minus unendlich) und ist I<x> minus unendlich, wird 3*Pi/4 (-3*Pi/4) zurückgegeben.

source: If I<y> is positive infinity (negative infinity) and I<x> is positive infinity, +pi/4 (-pi/4) is returned.
de: Ist I<y> plus unendlich (minus unendlich) und ist I<x> plus unendlich, wird Pi/4 (-Pi/4) zurückgegeben.

source: ERRORS
de: FEHLER

source: No errors occur.
de: Es treten keine Fehler auf.

source: ATTRIBUTES
de: ATTRIBUTE

source: For an explanation of the terms used in this section, see B<attributes>(7).
de: Siehe B<attributes>(7) für eine Erläuterung der in diesem Abschnitt verwandten Ausdrücke.

source: Interface
de: Schnittstelle

source: Attribute
de: Attribut

source: Value
de: Wert

source: Thread safety
de: Multithread-Fähigkeit

source: CONFORMING TO
de: KONFORM ZU

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
de: Die Variante, die I<double> zurückgibt, ist außerdem konform zu SVr4, 4.3BSD, C89.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
de: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
