Repository: sebras/manpages-l10n
Catalog: po/*/man3/ctime.3.po
Languages: de

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG

source: asctime, ctime, gmtime, localtime, mktime, asctime_r, ctime_r, gmtime_r, localtime_r - transform date and time to broken-down time or ASCII
de: asctime, ctime, gmtime, localtime, mktime - Datum und Zeit in aufgeschlüsselte Zeit oder ASCII umwandeln

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT

source: B<struct tm *gmtime(const time_t *>I<timep>B<);> B<struct tm *gmtime_r(const time_t *restrict >I<timep>B<,> B< struct tm *restrict >I<result>B<);>
de: B<struct tm *gmtime(const time_t *>I<zeitz>B<);> B<struct tm *gmtime_r(const time_t *restrict >I<zeitz>B<,> B< struct tm *restrict >I<Ergebnis>B<);>

source: B<struct tm *localtime(const time_t *>I<timep>B<);> B<struct tm *localtime_r(const time_t *restrict >I<timep>B<,> B< struct tm *restrict >I<result>B<);>
de: B<struct tm *localtime(const time_t *>I<zeitz>B<);> B<struct tm *localtime_r(const time_t *restrict >I<zeitz>B<,> B< struct tm *restrict >I<Ergebnis>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<ctime>(), B<gmtime>(), and B<localtime>() functions all take an argument of data type I<time_t>, which represents calendar time. When interpreted as an absolute time value, it represents the number of seconds elapsed since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
de: Die Funktionen B<ctime>(), B<gmtime>() und B<localtime>() benötigen ein Argument des Datentyps I<time_t>, welches die Kalenderzeit darstellt. Wenn sie als absoluter Zeitwert interpretiert wird, stellt sie die Unixzeit dar, die Sekunden, die seit dem 1. Januar 1970, 00:00.00 Uhr koordinierter Weltzeit (UTC) verstrichen sind.

source: The B<asctime>() and B<mktime>() functions both take an argument representing broken-down time, which is a representation separated into year, month, day, and so on.
de: Die Funktionen B<asctime>() und B<mktime>() benötigen jeweils ein Argument das eine aufgeschlüsselte Zeitangabe darstellt, die in Jahr, Monat, Tag usw. aufgeteilt ist.

source: The call B<ctime(>I<t>B<)> is equivalent to B<asctime(localtime(>I<t>B<))>. It converts the calendar time I<t> into a null-terminated string of the form
de: Der Aufruf B<ctime(>I<t>B<)> entspricht B<asctime(localtime(>I<t>B<))>. Er konvertiert die Kalenderzeit I<t> in eine durch Null beendete Zeichenkette der Form

source: The abbreviations for the days of the week are "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", and "Sat". The abbreviations for the months are "Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", and "Dec". The return value points to a statically allocated string which might be overwritten by subsequent calls to any of the date and time functions. The function also sets the external variables I<tzname>, I<timezone>, and I<daylight> (see B<tzset>(3)) with information about the current timezone. The reentrant version B<ctime_r>() does the same, but stores the string in a user-supplied buffer which should have room for at least 26 bytes. It need not set I<tzname>, I<timezone>, and I<daylight>.
de: Die Abkürzungen für die Wochentage sind »Sun«, »Mon«, »Tue«, »Wed«, »Thu«, »Fri« und »Sat«. Die Abkürzungen für die Monate sind »Jan«, »Feb«, »Mar«, »Apr«, »May«, »Jun«, »Jul«, »Aug«, »Sep«, »Oct«, »Nov« und »Dec«. Der Rückgabewert zeigt auf eine statisch reservierte Zeichenkette, die durch nachfolgende Aufrufe von Datums- und Zeitfunktionen überschrieben werden darf. Die Funktion setzt auch die externen Variablen I<tzname>, I<timezone> und I<daylight> (siehe B<tzset>(3)) mit Informationen über die aktuelle Zeitzone. Die ablaufinvariante Version B<ctime_r>() tut dasselbe, speichert aber die Zeichenkette in einem vom Benutzer gelieferten Zeichenkettenpuffer, der Platz für mindestens 26 Byte haben sollte. I<tzname>, I<timezone> und I<daylight> müssen nicht gesetzt sein.

source: The B<gmtime>() function converts the calendar time I<timep> to broken-down time representation, expressed in Coordinated Universal Time (UTC). It may return NULL when the year does not fit into an integer. The return value points to a statically allocated struct which might be overwritten by subsequent calls to any of the date and time functions. The B<gmtime_r>() function does the same, but stores the data in a user-supplied struct.
de: Die Funktion B<gmtime>() wandelt die Kalenderzeit I<zeitz> in eine aufgeschlüsselte Entsprechung der Zeit um, die in koordinierter Weltzeit (UTC) ausgedrückt wird. Sie kann NULL zurückgeben, wenn das Jahr nicht in eine Ganzzahl passt. Der Rückgabewert zeigt auf eine statisch reservierte Struktur, die von nachfolgenden Aufrufen irgendwelcher Datums- und Zeitfunktionen überschrieben werden kann. Die Funktion B<gmtime_r>() tut das gleiche, speichert aber die Daten in einer vom Benutzer gelieferten Struktur.

source: The B<localtime>() function converts the calendar time I<timep> to broken-down time representation, expressed relative to the user's specified timezone. The function acts as if it called B<tzset>(3) and sets the external variables I<tzname> with information about the current timezone, I<timezone> with the difference between Coordinated Universal Time (UTC) and local standard time in seconds, and I<daylight> to a nonzero value if daylight savings time rules apply during some part of the year. The return value points to a statically allocated struct which might be overwritten by subsequent calls to any of the date and time functions. The B<localtime_r>() function does the same, but stores the data in a user-supplied struct. It need not set I<tzname>, I<timezone>, and I<daylight>.
de: Die Funktion B<localtime>() wandelt die Kalenderzeit I<zeitz> in eine aufgeschlüsselte Entsprechung der Zeit um, ausgedrückt relativ zu der vom Benutzer angegebenen Zeitzone. Die Funktion arbeitet, als ob sie B<tzset>(3) aufrufen würde und setzt die externen Variablen I<tzname> auf die Informationen über die aktuelle Zeitzone, I<timezone> auf die Differenz zwischen koordinierter Weltzeit (UTC) und der lokalen Standardzeit in Sekunden und I<daylight> auf einen Wert ungleich Null, falls während einem Teil des Jahres Sommerzeitregeln gelten. Der Rückgabewert zeigt auf eine statisch reservierte Struktur, die von nachfolgenden Aufrufen irgendwelcher Datums- und Zeitfunktionen überschrieben werden kann. Die Funktion B<localtime_r>() tut das gleiche, speichert aber die Daten in einer vom Benutzer gelieferten Struktur. I<tzname>, I<timezone> und I<daylight> müssen nicht gesetzt sein.

source: The B<asctime>() function converts the broken-down time value I<tm> into a null-terminated string with the same format as B<ctime>(). The return value points to a statically allocated string which might be overwritten by subsequent calls to any of the date and time functions. The B<asctime_r>() function does the same, but stores the string in a user-supplied buffer which should have room for at least 26 bytes.
de: Die Funktion B<asctime>() wandelt den aufgeschlüsselten Zeitwert I<tm> in eine durch Null beendete Zeichenkette mit dem gleichen Format wie B<ctime>(). Der Rückgabewert zeigt auf eine statisch reservierte Zeichenkette, die von nachfolgenden Aufrufen irgendwelcher Datums- und Zeitfunktionen überschrieben werden kann. Die Funktion B<asctime_r>() tut das gleiche, speichert aber die Zeichenkette in einem vom Benutzer gelieferten Zeichenkettenpuffer, der Platz für mindestens 26 Byte haben sollte.

source: The B<mktime>() function converts a broken-down time structure, expressed as local time, to calendar time representation. The function ignores the values supplied by the caller in the I<tm_wday> and I<tm_yday> fields. The value specified in the I<tm_isdst> field informs B<mktime>() whether or not daylight saving time (DST) is in effect for the time supplied in the I<tm> structure: a positive value means DST is in effect; zero means that DST is not in effect; and a negative value means that B<mktime>() should (use timezone information and system databases to) attempt to determine whether DST is in effect at the specified time.
de: Die Funktion B<mktime>() wandelt die aufgeschlüsselten Zeitstruktur, die als lokale Zeit ausgedrückt wird, in eine Entsprechung der Kalenderzeit. Die Funktion ignoriert die Werte, die der Aufrufende in den Feldern I<tm_wday> und I<tm_yday> mitgegeben hat, egal ob in der Zeit der mitgegebenen Struktur I<tm> Sommerzeit ist oder nicht: Ein positiver Wert bedeutet, dass Sommerzeit ist, Null bedeutet, dass keine Sommerzeit ist und ein negativer Wert bedeutet, dass B<mktime>() (mit Zeitzoneninformationen und Systemdatenbanken) versuchen sollte zu bestimmen, ob zur angegebenen Zeit Sommerzeit ist oder nicht.

source: The B<mktime>() function modifies the fields of the I<tm> structure as follows: I<tm_wday> and I<tm_yday> are set to values determined from the contents of the other fields; if structure members are outside their valid interval, they will be normalized (so that, for example, 40 October is changed into 9 November); I<tm_isdst> is set (regardless of its initial value) to a positive value or to 0, respectively, to indicate whether DST is or is not in effect at the specified time. Calling B<mktime>() also sets the external variable I<tzname> with information about the current timezone.
de: Die Funktion B<mktime>() ändert die Felder der Struktur I<tm> wie folgt: I<tm_wday> und I<tm_yday> werden auf die Werte gesetzt, die vom Inhalt anderer Felder bestimmt werden; falls Elemente der Stuktur außerhalb ihres erlaubten Intervalls liegen, werden sie normalisiert (so dass zum Beispiel der 40. Oktober auf 9. November geändert wird); I<tm_isdst> wird (unabhängig vom anfänglichen Wert) auf einen positiven Wert beziehungsweise 0 gesetzt, um anzuzeigen, ob zur angegebenen Zeit Sommerzeit ist oder nicht. Der Aufruf von B<mktime>() setzt außerdem die Variable I<tzname> mit Informationen über die aktuelle Zeitzone.

source: If the specified broken-down time cannot be represented as calendar time (seconds since the Epoch), B<mktime>() returns I<(time_t)\ -1> and does not alter the members of the broken-down time structure.
de: Falls die angegebene aufgeschlüsselte Zeit nicht als Kalenderzeit (Unixzeit in Sekunden) dargestellt werden kann, gibt B<mktime>() I<(time_t)\ -1> zurück und verändert die Elemente der aufgeschlüsselten Zeitstruktur nicht.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, B<gmtime>() and B<localtime>() return a pointer to a I<struct\ tm>.
de: Im Erfolgsfall liefern B<gmtime>() und B<localtime>() einen Zeiger auf ein I<struct\ tm> zurück.

source: On success, B<gmtime_r>() and B<localtime_r>() return the address of the structure pointed to by I<result>.
de: Im Erfolgsfall liefern B<gmtime_r>() und B<localtime_r>() die Adresse der Struktur zurück, auf die I<result> zeigt.

source: On success, B<asctime>() and B<ctime>() return a pointer to a string.
de: Im Erfolgsfall liefern B<asctime>() und B<ctime>() einen Zeiger auf eine Zeichenkette zurück.

source: On success, B<asctime_r>() and B<ctime_r>() return a pointer to the string pointed to by I<buf>.
de: Im Erfolgsfall liefern B<asctime_r>() und B<ctime_r>() einen Zeiger zurück, auf den I<buf> zeigt.

source: On success, B<mktime>() returns the calendar time (seconds since the Epoch), expressed as a value of type I<time_t>.
de: Im Erfolgsfall liefert B<mktime>() die Kalenderzeit (Sekunden seit der Epoch) zurück, ausgedrückt als Wert des Typs I<time_t>.

source: On error, B<mktime>() returns the value I<(time_t)\ -1>. The remaining functions return NULL on error. On error, I<errno> is set to indicate the error.
de: Im Fehlerfall liefert B<mktime>() den Wert I<(time_t)\ -1> zurück. Die verbliebenen Funktionen liefern NULL im Fehlerfall zurück. Im Fehlerfall wird I<errno> gesetzt, um den Fehler anzuzeigen.

source: ERRORS
de: FEHLER

source: The result cannot be represented.
de: Das Ergebnis kann nicht dargestellt werden.

source: ATTRIBUTES
de: ATTRIBUTE

source: For an explanation of the terms used in this section, see B<attributes>(7).
de: Siehe B<attributes>(7) für eine Erläuterung der in diesem Abschnitt verwandten Ausdrücke.

source: Interface
de: Schnittstelle

source: Attribute
de: Attribut

source: Value
de: Wert

source: Thread safety
de: Multithread-Fähigkeit

source: POSIX.1-2001. C89 and C99 specify B<asctime>(), B<ctime>(), B<gmtime>(), B<localtime>(), and B<mktime>(). POSIX.1-2008 marks B<asctime>(), B<asctime_r>(), B<ctime>(), and B<ctime_r>() as obsolete, recommending the use of B<strftime>(3) instead.
de: POSIX.1-2001. C89 und C99 spezifizieren B<asctime>(), B<ctime>(), B<gmtime>(), B<localtime>() und B<mktime>(). POSIX.1-2008 kennzeichnet B<asctime_r>(), B<ctime>() und B<ctime_r>() als veraltet und empfiehlt stattdessen die Benutzung von B<strftime>(3).

source: POSIX doesn't specify the parameters of B<ctime_r>() to be I<restrict>; that is specific to glibc.
de: POSIX spezifiziert die Parameter von B<ctime_r>() nicht als I<restrict>; dies ist Glibc-spezifisch.

source: NOTES
de: ANMERKUNGEN

source: The four functions B<asctime>(), B<ctime>(), B<gmtime>(), and B<localtime>() return a pointer to static data and hence are not thread-safe. The thread-safe versions, B<asctime_r>(), B<ctime_r>(), B<gmtime_r>(), and B<localtime_r>(), are specified by SUSv2.
de: Die vier Funktionen B<asctime>(), B<ctime>(), B<gmtime>() und B<localtime>() geben einen Zeiger auf statische Daten zurück und sind daher nicht multithread-fähig. Multithread-fähige Versionen B<asctime_r>(), B<ctime_r>(), B<gmtime_r>() und B<localtime_r> werden durch SUSv2 spezifiziert.

source: POSIX.1-2001 says: "The B<asctime>(), B<ctime>(), B<gmtime>(), and B<localtime>() functions shall return values in one of two static objects: a broken-down time structure and an array of type I<char>. Execution of any of the functions may overwrite the information returned in either of these objects by any of the other functions." This can occur in the glibc implementation.
de: POSIX.1-2001 sagt: »Die Funktionen B<asctime>(), B<ctime>(), B<gmtime>() und B<localtime>() müssen Rückgabewerte in einem von zwei statischen Objekten liefern: einer aufgeschlüsselten Zeit und einem Feld des Typs I<char>. Das Ausführen irgendeiner der Funktionen könnte die zurückgegebene Information überschreiben, die von diesen beiden Objekten durch andere Funktionen zurückgegeben wurden.« Dies kann in der Glibc-Implementierung vorkommen.

source: In many implementations, including glibc, a 0 in I<tm_mday> is interpreted as meaning the last day of the preceding month.
de: In vielen Implementierungen, einschließlich Glibc, wird a 0 in I<tm_mday> als letzter Tag des vorhergehenden Monats interpretiert.

source: According to POSIX.1-2001, B<localtime>() is required to behave as though B<tzset>(3) was called, while B<localtime_r>() does not have this requirement. For portable code, B<tzset>(3) should be called before B<localtime_r>().
de: Gemäß POSIX.1-2001 wird B<localtime>() benötigt, um sich so zu verhalten, als sei B<tzset>(3) aufgerufen worden, während B<localtime_r>() nicht diese Anforderung stellt. Für portierbaren Code sollte B<tzset>(3) vor B<localtime_r>() aufgerufen werden.

source: SEE ALSO
de: SIEHE AUCH

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: B<char *asctime(const struct tm *>I<tm>B<);> B<char *asctime_r(const struct tm *>I<tm>B<, char *>I<buf>B<);>
de: B<char *asctime(const struct tm *>I<tm>B<);> B<char *asctime_r(const struct tm *>I<tm>B<, char *>I<Puffer>B<);>

source: B<char *ctime(const time_t *>I<timep>B<);> B<char *ctime_r(const time_t *>I<timep>B<, char *>I<buf>B<);>
de: B<char *ctime(const time_t *>I<zeitz>B<);> B<char *ctime_r(const time_t *>I<zeitz>B<, char *>I<Puffer>B<);>

source: B<struct tm *gmtime(const time_t *>I<timep>B<);> B<struct tm *gmtime_r(const time_t *>I<timep>B<, struct tm *>I<result>B<);>
de: B<struct tm *gmtime(const time_t *>I<zeitz>B<);> B<struct tm *gmtime_r(const time_t *>I<zeitz>B<, struct tm *>I<Ergebnis>B<);>

source: B<struct tm *localtime(const time_t *>I<timep>B<);> B<struct tm *localtime_r(const time_t *>I<timep>B<, struct tm *>I<result>B<);>
de: B<struct tm *localtime(const time_t *>I<zeitz>B<);> B<struct tm *localtime_r(const time_t *>I<zeitz>B<, struct tm *>I<Ergebnis>B<);>

source: _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
de: _POSIX_C_SOURCE || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: Broken-down time is stored in the structure I<tm>, which is defined in I<E<lt>time.hE<gt>> as follows:
de: Aufgeschlüsselte Zeit wird in der Struktur I<tm> gespeichert, die in I<E<lt>time.hE<gt>> wie folgt definiert ist:

source: struct tm { int tm_sec; /* Seconds (0-60) */ int tm_min; /* Minutes (0-59) */ int tm_hour; /* Hours (0-23) */ int tm_mday; /* Day of the month (1-31) */ int tm_mon; /* Month (0-11) */ int tm_year; /* Year - 1900 */ int tm_wday; /* Day of the week (0-6, Sunday = 0) */ int tm_yday; /* Day in the year (0-365, 1 Jan = 0) */ int tm_isdst; /* Daylight saving time */ };
de: struct tm { int tm_sec; /* Sekunden (0-60) */ int tm_min; /* Minuten (0-59) */ int tm_hour; /* Stunden (0-23) */ int tm_mday; /* Monatstag (1-31) */ int tm_mon; /* Monat (0-11) */ int tm_year; /* Jahr - 1900 */ int tm_wday; /* Wochentag (0-6, Sonntag = 0) */ int tm_yday; /* Jahrestag (0-365, 1. Jan = 0) */ int tm_isdst; /* Sommerzeit */ };

source: The members of the I<tm> structure are:
de: Die Elemente der Struktur I<tm> sind:

source: The number of seconds after the minute, normally in the range 0 to 59, but can be up to 60 to allow for leap seconds.
de: die Anzahl der Sekunden nach der vollen Minute, normalerweise im Bereich 0 bis 59, kann aber bis zu 60 sein, um Schaltsekunden zu erlauben.

source: The number of minutes after the hour, in the range 0 to 59.
de: die Anzahl der Minuten nach der vollen Stunde, im Bereich 0 bis 59.

source: The number of hours past midnight, in the range 0 to 23.
de: die Anzahl der Stunden nach Mitternacht, im Bereich 0 bis 23.

source: The day of the month, in the range 1 to 31.
de: der Tag des Monats, im Bereich 1 bis 31.

source: The number of months since January, in the range 0 to 11.
de: die Anzahl der Monate seit Januar, im Bereich 0 bis 11.

source: The number of years since 1900.
de: die Anzahl der Jahre nach 1900.

source: The number of days since Sunday, in the range 0 to 6.
de: die Anzahl der Tage seit Sonntag, im Bereich 0 bis 6.

source: The number of days since January 1, in the range 0 to 365.
de: die Anzahl der Tage seit dem 1. Januar, im Bereich 0 bis 365.

source: A flag that indicates whether daylight saving time is in effect at the time described. The value is positive if daylight saving time is in effect, zero if it is not, and negative if the information is not available.
de: ein Schalter, der anzeigt, ob in der angegebenen Zeit Sommerzeit ist. Der Wert ist in der Sommerzeit positiv, Null wenn nicht und negativ wenn die Information nicht verfügbar ist.

source: On error, B<mktime>() returns the value I<(time_t)\ -1>. The remaining functions return NULL on error. On error, I<errno> is set to indicate the cause of the error.
de: Im Fehlerfall liefert B<mktime>() den Wert I<(time_t)\ -1> zurück. Die verbliebenen Funktionen liefern NULL im Fehlerfall zurück. Im Fehlerfall wird I<errno> gesetzt, um die Fehlerursache anzuzeigen.

source: CONFORMING TO
de: KONFORM ZU

source: The glibc version of I<struct tm> has additional fields
de: Die Glibc-Version von I<struct tm> hat zusätzliche Felder.

source: const char *tm_zone; /* Timezone abbreviation */
de: const char *tm_zone; /* Abkürzung der Zeitzone */

source: defined when B<_BSD_SOURCE> was set before including I<E<lt>time.hE<gt>>. This is a BSD extension, present in 4.3BSD-Reno.
de: definiert, wenn B<_BSD_SOURCE> gesetzt war, bevor I<E<lt>time.hE<gt>> eingebunden wurde. Dies ist eine BSD-Erweiterung, die in 4.3BSD-Reno enthalten ist.

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: B<char *asctime(const struct tm *>I<tm>B<);> B<char *asctime_r(const struct tm *restrict >I<tm>B<, char *restrict >I<buf>B<);>
de: B<char *asctime(const struct tm *>I<tm>B<);> B<char *asctime_r(const struct tm *restrict >I<tm>B<, char *restrict >I<Puffer>B<);>

source: B<char *ctime(const time_t *>I<timep>B<);> B<char *ctime_r(const time_t *restrict >I<timep>B<, char *restrict >I<buf>B<);>
de: B<char *ctime(const time_t *>I<zeitz>B<);> B<char *ctime_r(const time_t *restrict >I<zeitz>B<, char *restrict >I<Puffer>B<);>

source: long tm_gmtoff; /* Seconds east of UTC */ const char *tm_zone; /* Timezone abbreviation */
de: long tm_gmtoff; /* Sekunden östlich der Weltzeit (UTC) */ const char *tm_zone; /* Abkürzung der Zeitzone */

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: The B<ctime>(), B<gmtime>() and B<localtime>() functions all take an argument of data type I<time_t>, which represents calendar time. When interpreted as an absolute time value, it represents the number of seconds elapsed since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
de: Die Funktionen B<ctime>(), B<gmtime>() und B<localtime>() benötigen ein Argument des Datentyps I<time_t>, welches die Kalenderzeit darstellt. Wenn sie als absoluter Zeitwert interpretiert wird, stellt sie die Unixzeit dar, die Sekunden, die seit dem 1. Januar 1970, 00:00.00 Uhr koordinierter Weltzeit (UTC) verstrichen sind.

source: The four functions B<asctime>(), B<ctime>(), B<gmtime>() and B<localtime>() return a pointer to static data and hence are not thread-safe. The thread-safe versions, B<asctime_r>(), B<ctime_r>(), B<gmtime_r>() and B<localtime_r>(), are specified by SUSv2.
de: Die vier Funktionen B<asctime>(), B<ctime>(), B<gmtime>() und B<localtime>() geben einen Zeiger auf statische Daten zurück und sind daher nicht multithread-fähig. Multithread-fähige Versionen B<asctime_r>(), B<ctime_r>(), B<gmtime_r>() und B<localtime_r> werden durch SUSv2 spezifiziert.

source: According to POSIX.1-2004, B<localtime>() is required to behave as though B<tzset>(3) was called, while B<localtime_r>() does not have this requirement. For portable code, B<tzset>(3) should be called before B<localtime_r>().
de: Gemäß POSIX.1-2004 wird B<localtime>() benötigt, um sich so zu verhalten, als sei B<tzset>(3) aufgerufen worden, während B<localtime_r>() nicht diese Anforderung stellt. Für portierbaren Code sollte B<tzset>(3) vor B<localtime_r>() aufgerufen werden.
