Repository: sebras/manpages-l10n
Catalog: po/*/man3/dbopen.3.po
Languages: es, fr, pl

source: Sequential key/data pair retrieval may begin at any time, and the position of the "cursor" is not affected by calls to the I<del>, I<get>, I<put>, or I<sync> routines. Modifications to the database during a sequential scan will be reflected in the scan, that is, records inserted behind the cursor will not be returned while records inserted in front of the cursor will be returned.
es: La recuperación secuencial de pares clave/datos pueden empezar en cualquier momento y la posición del "cursor" no se ve afectada por las llamadas a las rutinas I<del>, I<get>, I<put>, o I<sync>. Las modificaciones a la base de datos durante el recorrido secuencial se reflejarán en el recorrido, es decir, no se devolverán los registros insertados detrás del cursos mientras que los registros insertados delante del cursor sí se devolverán.
fr: La rechercher séquentielle de paire clé/donnée peut avoir lieu à tout moment, et la position du «\ curseur\ » n'est pas affectée par les routine I<del>(), I<get>(), I<put>(), ou I<sync>(). Les modifications de la base de données durant un balayage séquentiel seront visibles par le balayage, c'est-à-dire que les enregistrements insérés avant le curseur ne seront pas vus, mais les enregistrements insérés après le curseur seront renvoyés.
pl: Sekwencyjne pobieranie par klucz/dane może się rozpocząć w dowolnym momencie, a wywołania funkcji I<del>, I<get>, I<put> i I<sync> nie mają wpływu na pozycję "kursora". Zmiany bazy danych podczas sekwencyjnego czytania będą odwzorowane podczas odczytów, tzn. rekordy wstawione za kursorem nie będą zwrócone, podczas gdy rekordy wstawione przed kursorem zostaną zwrócone.

source: The flag value B<must> be set to one of the following values:
es: El valor de la opción B<debe> ser uno de los siguientes valores:
fr: La valeur de I<flags> B<doit> être l'une des valeurs suivantes\ :
pl: Wartość argumentu I<flag> B<musi> być ustawiona na jedną z poniższych wartości:

source: The data associated with the specified key is returned. This differs from the I<get> routines in that it sets or initializes the cursor to the location of the key as well. (Note, for the B<DB_BTREE> access method, the returned key is not necessarily an exact match for the specified key. The returned key is the smallest key greater than or equal to the specified key, permitting partial key matches and range searches.)
es: Se devolverán los datos asociados con la clave especificada. Esto difiere de las rutinas I<get> en las que también se posiciona o inicializa el cursor a las posición de la clave. (Dése cuenta que para el método de acceso B<DB_BTREE> la clave devuelta no es necesariamente una coincidencia exacta de la clave especificada. La clave devuelta es la clave más pequeña mayor o igual que la clave especificada, permitiendo así las coincidencias parciales de claves y las búsquedas dentro de un intervalo).
fr: La routine renvoie les données associées avec la clé indiquée. C'est différent du comportement de la routine I<get>() car le curseur est également positionné ou initialisé. (Veuillez noter que pour la méthode d'accès B<DB_BTREE>, la clé renvoyée ne correspond pas nécessairement à la clé indiquée. On retourne la plus petite clé supérieure ou égale à celle indiquée, ce qui permet des correspondances partielles ou des recherches d'intervalles).
pl: Zwracane są dane stowarzyszone z podanym kluczem. Różni się to od funkcji I<get> tym, że również ustawia lub inicjuje kursor w pozycji klucza. (Należy zauważyć, że dla metody dostępu B<DB_BTREE> zwracany klucz nie musi być identyczny z kluczem podanym. Zwracany klucz jest najmniejszym kluczem większym lub równym podanemu kluczowi, dopuszczając częściowe dopasowywanie klucza i przeszukiwanie zakresów).

source: The first key/data pair of the database is returned, and the cursor is set or initialized to reference it.
es: Se devuelve el primer par clave/datos de la base de datos y el cursor se posiciona o inicializa para referenciarlo.
fr: On renvoie la première paire clé/donnée de la base, et le curseur est initialisé ou positionné pour la référencer.
pl: Zwracana jest pierwsza para klucz/dane występująca w bazie danych. Kursor jest ustawiany lub inicjowany tak, by wskazywał tę parę.

source: The last key/data pair of the database is returned, and the cursor is set or initialized to reference it. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
es: Se devuelve el último par clave/datos de la base de datos y el cursor se posiciona o inicializa para referenciarlo. (Aplicable sólo en los métodos de acceso B<DB_BTREE> y B<DB_RECNO>).
fr: On renvoie la dernière paire clé/donnée de la base, et le curseur est initialisé ou positionné pour la référencer. (Disponible uniquement pour les méthodes B<DB_BTREE> et B<DB_RECNO>).
pl: Zwracana jest ostatnia para klucz/dane występująca w bazie danych. Kursor jest ustawiany lub inicjowany tak, by wskazywał tę parę. (Dotyczy jedynie metod dostępu B<DB_BTREE> oraz B<DB_RECNO>).

source: Retrieve the key/data pair immediately after the cursor. If the cursor is not yet set, this is the same as the B<R_FIRST> flag.
es: Recupera el par clave/datos inmediatamente después del cursor. Si el cursor todavía no está colocado, ésta opción es la misma que B<R_FIRST>.
fr: Renvoyer la paire clé/donnée immédiatement après le curseur. Si le curseur n'est pas positionné, le comportement est le même que B<R_FIRST>.
pl: Pobiera parę klucz/dane znajdującą się bezpośrednio po pozycji kursora. Jeśli kursor nie został jeszcze ustawiony, zachowuje się tak samo, jak znacznik B<R_FIRST>.

source: Retrieve the key/data pair immediately before the cursor. If the cursor is not yet set, this is the same as the B<R_LAST> flag. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
es: Recupera el par clave/datos inmediatamente antes del cursor. Si el cursor todavía no está colocado, ésta opción es la misma que B<R_LAST>. (Aplicable sólo en los métodos de acceso B<DB_BTREE> y B<DB_RECNO>).
fr: Renvoyer la paire clé/donnée immédiatement avant le curseur. Si le curseur n'est pas positionné, le comportement est le même que B<R_LAST>. (Disponible uniquement pour les méthodes B<DB_BTREE> et B<DB_RECNO>).
pl: Pobiera parę klucz/dane znajdującą się bezpośrednio przed pozycją kursora. Jeśli kursor nie został jeszcze ustawiony, zachowuje się tak samo jak znacznik B<R_LAST>. (Dotyczy jedynie metod dostępu B<DB_BTREE> i B<DB_RECNO>).

source: B<R_LAST> and B<R_PREV> are available only for the B<DB_BTREE> and B<DB_RECNO> access methods because they each imply that the keys have an inherent order which does not change.
es: B<R_LAST> y B<R_PREV> sólo están disponibles para los métodos B<DB_BTREE> y B<DB_RECNO> yaque cada una de ellas implica que las claves tienen un orden inherente que no cambia.
fr: B<R_LAST> et B<R_PREV> ne sont disponibles que pour les méthodes B<DB_BTREE> et B<DB_RECNO> car ils impliquent que les clés aient un ordre inhérent immuable.
pl: B<R_LAST> i B<R_PREV> są dostępne jedynie dla metod dostępu B<DB_BTREE> i B<DB_RECNO>, gdyż zakładają, że klucze mają ustaloną, niezmienną kolejność.

source: I<seq> routines return -1 on error (setting I<errno>), 0 on success and 1 if there are no key/data pairs less than or greater than the specified or current key. If the B<DB_RECNO> access method is being used, and if the database file is a character special file and no complete key/data pairs are currently available, the I<seq> routines return 2.
es: Las rutinas I<seq> devuelven -1 en caso de error (asignando un valor a I<errno>), 0 en caso de éxito y 1 si no existen pares clave/datos menores o mayores que la clave especificada o actual. Si se usa el método de acceso B<DB_RECNO> y si el fichero de la base de datos es un fichero especial de caracteres y no se dispone actualmente de pares clave/datos completos, la rutina I<seq> devuelve 2.
fr: La routine I<seq>() renvoie -1 en cas d'erreur (et remplit I<errno>), 0 en cas de succès, et 1 s'il n'y a pas de paire clé/donnée supérieure ou égale à la clé indiquée ou courante. Si on utilise la méthode B<DB_RECNO>, si le fichier de base de données est un fichier spécial en mode caractères, et si aucune paire clé/donnée complète n'est actuellement disponible, la routine I<seq> renvoie 2.
pl: Funkcje I<seq> zwracają -1 w przypadku błędu (ustawiając I<errno>), 0 w przypadku pomyślnego zakończenia albo 1, gdy brak w bazie pary klucz/dane mniejszej lub większej niż podany lub bieżący klucz. Dla metody dostępu B<DB_RECNO>, gdy plik bazy danych jest specjalnym plikiem znakowym, a żadna pełna para klucz/dane nie jest w danej chwili dostępna, funkcje I<seq> zwracają 2.

source: A pointer to a routine to flush any cached information to disk. If the database is in memory only, the I<sync> routine has no effect and will always succeed.
es: Un puntero a una rutina para vaciar a disco cualquier información en caché. Si la base de datos está sólo en memoria, la rutina I<sync> no hace nada y siempre tendrá éxito.
fr: Un pointeur vers une routine permettant de vider sur disque toutes les informations en cache. Si la base de données est uniquement en mémoire, la routine I<sync>() n'a pas d'effet et réussira toujours.
pl: Wskaźnik do funkcji zrzucającej zbuforowane informacje na dysk. Jeśli baza danych znajduje się wyłącznie w pamięci, to funkcja I<sync> nic nie robi i kończy się zawsze pomyślnie.

source: The flag value may be set to the following value:
es: Al valor de la opción se le debe asignar el siguiente valor:
fr: La valeur de I<flags> peut être la suivante\ :
pl: Wartość znacznika może być jedną z następujących wartości:

source: If the B<DB_RECNO> access method is being used, this flag causes the sync routine to apply to the btree file which underlies the recno file, not the recno file itself. (See the I<bfname> field of the B<recno>(3) manual page for more information.)
es: Si se usa el método de acceso B<DB_RECNO>, esta opción hace que la rutina de sincronización se aplique al fichero árbolB que subyace al fichero de registros numerados, no al propio fichero de registros numerados. (Véase el campo I<bfname> de la página de manual de B<recno>(3) para más información.)
fr: Si on utilise la méthode B<DB_RECNO>, ce drapeau oblige la synchronisation à s'appliquer au fichier btree sous-jacent du fichier recno, et non pas à ce dernier. (Consultez le champ I<bfname> de la page de manuel B<recno>(3) pour plus d'informations.)
pl: Jeśli używana jest metoda B<DB_RECNO>, ten znacznik powoduje, że funkcja sync dotyczy pliku btree stanowiącego bazę pliku numerów rekordów, nie zaś samego pliku numerów rekordów. (Więcej informacji znajduje się w opisie pola I<bfname> na stronie podręcznika B<recno>(3)).

source: I<sync> routines return -1 on error (setting I<errno>) and 0 on success.
es: Las rutinas I<sync> devuelven -1 en caso de error (asignando un valor a I<errno>) y 0 en caso de éxito.
fr: La routine I<sync>() renvoie -\1 en cas d'erreur (et remplit I<errno>) ou 0 en cas de réussite.
pl: Funkcje I<sync> zwracają -1 w przypadku błędu (ustawiając I<errno>), 0 w przypadku pomyślnego zakończenia.

source: Key/data pairs
fr: Paires clé/données
pl: Pary klucz/dane

source: Access to all file types is based on key/data pairs. Both keys and data are represented by the following data structure:
es: El acceso a todos los tipos de fichero se basa en los pares clave/datos. Tanto las claves como los datos se representan mediante la siguiente estructura de datos:
fr: L'accès à tous les types de fichiers est basé sur les paires clés/données. La structure de donnée suivante représente à la fois les clés et les données.
pl: Dostęp do wszystkich rodzajów plików jest oparty na parach klucz/dane. Zarówno klucze, jak i dane są reprezentowane za pomocą następującej struktury danych:

source: The elements of the I<DBT> structure are defined as follows:
es: Los elementos de la estructura I<DBT> se definen como sigue:
fr: Les éléments de la structure I<DBT> sont définis ainsi\ :
pl: Elementy struktury I<DBT> są zdefiniowane następująco:

source: A pointer to a byte string.
es: Un puntero a un cadena de bytes.
fr: Un pointeur vers une chaîne d'octets.
pl: Wskaźnik do łańcucha bajtów.

source: The length of the byte string.
es: La longitud de la cadena de bytes.
fr: La longueur de la chaîne d'octets.
pl: Długość łańcucha bajtów.

source: Key and data byte strings may reference strings of essentially unlimited length although any two of them must fit into available memory at the same time. It should be noted that the access methods provide no guarantees about byte string alignment.
es: Las cadenas de bytes de claves y datos pueden referenciar a cadenas de, esencialmente, longitudes ilimitadas aunque cualesquiera dos de ellas deben caber en memoria al mismo tiempo. Debe darse cuenta que los métodos de acceso no garantizan la alineación de las cadenas de bytes.
fr: Les chaînes d'octets des clés et des données peuvent avoir n'importe quelle longueur, avec la limitation que deux quelconques d'entre elles doivent pouvoir tenir simultanément en mémoire. Remarquez que les méthodes d'accès ne fournissent aucune garantie en ce qui concerne les alignements des chaînes d'octets.
pl: Łańcuchy bajtowe klucza i danych zasadniczo mogą wskazywać na łańcuchy o nieograniczonej długości, ale dowolne dwa z nich muszą się mieścić jednocześnie w dostępnej pamięci. Należy zauważyć, że metody dostępu nie dają żadnych gwarancji dotyczących wyrównania łańcuchów bajtowych.

source: ERRORS
es: ERRORES
fr: ERREURS
pl: BŁĘDY

source: The B<dbopen>() routine may fail and set I<errno> for any of the errors specified for the library routines B<open>(2) and B<malloc>(3) or the following:
es: La rutina B<dbopen>() puede fallar y asignar a I<errno> cualquiera de los errores especificados para las rutinas de biblioteca B<open>(2) y B<malloc>(3) o uno de los siguientes:
fr: La routine B<dbopen>() peut échouer et placer dans I<errno> n'importe laquelle des erreurs renvoyées par les routines B<open>(2) et B<malloc>(3) ou l'une des erreurs suivantes\ :
pl: Funkcja B<dbopen>() może zawieść i ustawić I<errno> na dowolny z błędów określonych dla funkcji bibliotecznych B<open>(2) i B<malloc>(3) albo na jeden z następujących błędów:

source: A file is incorrectly formatted.
es: Un fichero está incorrectamente formateado.
fr: Un fichier est mal formaté.
pl: Plik jest niepoprawnie sformatowany.

source: A parameter has been specified (hash function, pad byte, etc.) that is incompatible with the current file specification or which is not meaningful for the function (for example, use of the cursor without prior initialization) or there is a mismatch between the version number of file and the software.
es: Se ha especificado un parámetro (función de dispersión, byte de relleno, etc.) que es incompatible con la especificación actual del fichero o que no tiene sentido para la función (por ejemplo, el uso del cursor sin una inicialización previa) o lo números de versión del fichero y del software no coinciden.
fr: Un paramètre indiqué (par exemple fonction de hachage) est incompatible avec les spécifications du fichier actuel, ou n'a pas de sens pour la fonction (par exemple utiliser le curseur sans initialisation préalable). Ou encore, il y a une incompatibilité dans les numéros de version du fichier et du logiciel.
pl: Podano parametr (funkcję mieszającą, bajt wyrównania, itp.) niezgodny z bieżącą specyfikacją pliku lub taki, który nie ma sensu dla funkcji (na przykład użycie kursora bez uprzedniej inicjacji), lub występuje niezgodność wersji pomiędzy plikiem i oprogramowaniem.

source: The I<close> routines may fail and set I<errno> for any of the errors specified for the library routines B<close>(2), B<read>(2), B<write>(2), B<free>(3), or B<fsync>(2).
es: Las rutinas I<close> pueden fallar y asignar a I<errno> cualquiera de los errores especificados para las rutinas de biblioteca B<close>(2), B<read>(2), B<write>(2), B<free>(3) o B<fsync>(2).
fr: Les routines I<close>() peuvent échouer et définir dans I<errno> l'une des erreurs spécifiées par les routines de bibliothèque B<close>(2), B<read>(2), B<write>(2), B<free>(3), ou B<fsync>(2).
pl: Funkcje I<close> mogą zawieść i ustawić w I<errno> dowolny z błędów określonych dla funkcji bibliotecznych B<close>(2), B<read>(2), B<write>(2), B<free>(3) lub B<fsync>(2).

source: The I<fd> routines will fail and set I<errno> to B<ENOENT> for in memory databases.
es: Las rutinas I<fd> pueden fallar y asignar a I<errno> el valor B<ENOENT> para las bases de datos residentes en memoria.
fr: Les routine I<fd> peuvent échouer et définir I<errno> à B<ENOENT> pour les bases de données en mémoire.
pl: Funkcje I<fd> mogą zawieść i ustawić I<errno> na B<ENOENT> dla baz danych w pamięci.

source: The I<sync> routines may fail and set I<errno> for any of the errors specified for the library routine B<fsync>(2).
es: Las rutinas I<sync> pueden fallar y asignar a I<errno> cualquiera de los errores especificados para la rutina de biblioteca B<fsync>(2).
fr: Les routines I<sync> peuvent échouer et définir dans I<errno> l'une des erreurs spécifiées par la routine de bibliothèque B<fsync>(2).
pl: Funkcje I<sync> mogą zawieść i ustawić w I<errno> dowolny z błędów określonych dla funkcji bibliotecznej B<fsync>(2).

source: BUGS
es: ERRORES
fr: BOGUES
pl: BŁĘDY

source: The typedef I<DBT> is a mnemonic for "data base thang", and was used because no one could think of a reasonable name that wasn't already used.
es: El typedef I<DBT> es un nemónico para "base de datos thang" (data base thang), y se usó porque nadie pudo pensar en un nombre razonable que no exisitiera ya.
fr: Le typedef I<DBT> est un mnémonique pour «\ data base thang\ », qui a été choisi car personne n'arrivait à trouver un nom raisonnable et pas encore utilisé.
pl: Nazwa typu I<DBT> jest skrótem od "data base thang", który był używany tylko dlatego, że nikt nie wymyślił sensownej, jeszcze nieużywanej nazwy.

source: The file descriptor interface is a kludge and will be deleted in a future version of the interface.
es: La interfaz de descriptores de fichero es un latazo y se eliminará en una futura versión de la interfaz.
fr: L'interface avec les descripteurs de fichier est une bidouille et sera supprimée dans les versions futures de l'interface.
pl: Interfejs wykorzystujący deskryptory plików stanowi obejście i będzie w przyszłości usunięty.

source: None of the access methods provide any form of concurrent access, locking, or transactions.
es: Ninguno de los métodos de acceso proporciona ninguna forma de acceso concurrente, bloqueo o transacción.
fr: Aucune méthode d'accès ne fournit de transactions, de verrouillages ou d'accès concurrents.
pl: Żadna z metod dostępu nie zapewnia jakiejkolwiek formy dostępu równoległego, blokowania ani transakcji.

source: SEE ALSO
es: VÉASE TAMBIÉN
fr: VOIR AUSSI
pl: ZOBACZ TAKŻE

source: COLOPHON
es: COLOFÓN
pl: O STRONIE

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.12 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: B<dbopen>() is the library interface to database files. The supported file formats are btree, hashed and UNIX file oriented. The btree format is a representation of a sorted, balanced tree structure. The hashed format is an extensible, dynamic hashing scheme. The flat-file format is a byte stream file with fixed or variable length records. The formats and file-format-specific information are described in detail in their respective manual pages B<btree>(3), B<hash>(3), and B<recno>(3).
es: B<dbopen> es la interfaz de biblioteca para los ficheros de bases de datos. Los formatos de fichero soportados son árbolB, dispersión y ficheros orientados a UNIX. El formato árbolB es una representación de una estructura de árbol balanceada y ordenada. El formato disperso es un esquema de dispersión dinámico y extensible. El formato fichero plano es un fichero de flujo de bytes con registros de longitud fija o variable. Los formatos y la información específica de los formatos de los ficheros se describen en detalle en sus páginas de manual respectivas B<btree>(3), B<hash>(3) y B<recno>(3).
fr: B<dbopen>() est l'interface de bibliothèque pour les fichiers de bases de données. Les formats de fichiers pris en charge sont les arbres binaires (btree), les fichiers hachés et les fichiers UNIX. L'arbre binaire est une représentation d'une structure équilibrée et triée. Les fichiers hachés représentent des tables de hachage extensibles et dynamiques. Le format de fichier UNIX est un flux d'octets avec des enregistrements de longueur fixe ou variable. Les formats et les informations spécifiques aux fichiers sont fournis en détail dans les pages de manuel respectives de B<btree>(3), B<hash>(3) et B<recno>(3).
pl: B<dbopen>() jest funkcją biblioteczną stanowiącą interfejs do plików baz danych. Obsługiwane formaty plików to: btree, rozproszony (hashed) i uniksowy zorientowany na pliki. Format btree stanowi reprezentację posortowanej, zrównoważonej struktury drzewa. Format rozproszony (hashed) jest rozszerzalnym, dynamicznym schematem mieszania. Format płaskiego pliku jest plikiem stanowiącym strumień bajtów z rekordami o stałej lub zmiennej długości. Informacje o formatach i specyficzne dla poszczególnych formatów plików są szczegółowo opisane na odpowiednich stronach podręcznika: B<btree>(3), B<hash>(3) i B<recno>(3)

source: The I<del>, I<get>, I<put>, and I<seq> routines may fail and set I<errno> for any of the errors specified for the library routines B<read>(2), B<write>(2), B<free>(3) or B<malloc>(3).
es: Las rutinas I<del>, I<get>, I<put> y I<seq> pueden fallar y asignar a I<errno> cualquiera de los errores especificados para las rutinas de biblioteca B<read>(2), B<write>(2), B<free>(3) o B<malloc>(3).
fr: Les routines I<del>, I<get>, I<put> et I<seq> peuvent échouer et définir dans I<errno> l'une des erreurs spécifiées par les routines de bibliothèque B<read>(2), B<write>(2), B<free>(3) ou B<malloc>(3).
pl: Funkcje I<del>, I<get>, I<put> i I<seq> mogą zawieść i ustawić w I<errno> dowolny z błędów określonych dla funkcji bibliotecznych B<read>(2), B<write>(2), B<free>(3) lub B<malloc>(3).

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
