Repository: sebras/manpages-l10n
Catalog: po/*/man3/dbopen.3.po
Languages: es, fr, pl

source: Linux Programmer's Manual
es: Manual del Programador de Linux
fr: Manuel du programmeur Linux
pl: Podręcznik programisty Linuksa

source: NAME
es: NOMBRE
fr: NOM
pl: NAZWA

source: dbopen - database access methods
es: dbopen - métodos de acceso a bases de datos
fr: dbopen - Méthodes d'accès aux bases de données
pl: dbopen - metody dostępu do baz danych

source: SYNOPSIS
es: SINOPSIS
pl: SKŁADNIA

source: DESCRIPTION
es: DESCRIPCIÓN
pl: OPIS

source: I<Note well>: This page documents interfaces provided in glibc up until version 2.1. Since version 2.2, glibc no longer provides these interfaces. Probably, you are looking for the APIs provided by the I<libdb> library instead.
fr: I<NOTE> : cette page décrit des interfaces fournies par la glibc jusque dans sa version 2.1. Depuis la version 2.2, la glibc ne fournit plus ces interfaces. Veuillez consulter les API fournies par la bibliothèque I<libdb>.
pl: I<Ważna uwaga>: Ta strona podręcznika ekranowego opisuje interfejsy dostarczane przez bibliotekę glibc aż do wersji 2.1. Od wersji 2.2 glibc już nie zawiera tych interfejsów. Najprawdopodobniej to, czego szukasz, to API dostarczane przez bibliotekę I<libdb>.

source: B<dbopen>() opens I<file> for reading and/or writing. Files never intended to be preserved on disk may be created by setting the I<file> argument to NULL.
es: B<dbopen> abre el fichero I<file> para lectura y/o escritura. Los ficheros destinados a ser conservados en disco nunca pueden crearse con un parámetro I<file> con valor NULL.
fr: B<dbopen>() ouvre le fichier I<file> en lecture et/ou en écriture. Les fichiers qui n'ont en aucun cas besoin d'être sauvegardés sur le disque peuvent être créés avec le paramètre I<file> à NULL.
pl: B<dbopen>() otwiera plik podany w parametrze I<file> do odczytu i/lub do zapisu. Pliki, których zachowywanie na dysku nie jest zamierzone, mogą być tworzone przez ustawienie parametru I<file> na NULL.

source: The I<flags> and I<mode> arguments are as specified to the B<open>(2) routine, however, only the B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK>, and B<O_TRUNC> flags are meaningful. (Note, opening a database file B<O_WRONLY> is not possible.)
es: Las opciones, I<flags>, y los argumentos de modo, I<mode>, son los mismos que los indicados para la rutina B<open>(2), aunque sólo las opciones B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK> y B<O_TRUNC> tienen sentido. (Dese cuenta que no es posible abrir un fichero de base de datos con la opción B<O_WRONLY>).
fr: Les arguments I<flags> et I<mode> doivent être spécifiés à la routine B<open>(2). Toutefois, seuls les attributs B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK> et B<O_TRUNC> ont un sens (veuillez noter que l'ouverture d'un fichier d'une base de données en mode B<O_WRONLY> n'est pas possible).
pl: Argumenty I<flags> i I<mode> są takie same, jak w funkcji B<open>(2), jednakże brane pod uwagę są jedynie znaczniki B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK> oraz B<O_TRUNC>. (Należy zauważyć, że nie jest możliwe otwarcie pliku bazy danych jako B<O_WRONLY>).

source: The I<type> argument is of type I<DBTYPE> (as defined in the I<E<lt>db.hE<gt>> include file) and may be set to B<DB_BTREE>, B<DB_HASH>, or B<DB_RECNO>.
es: El argumento I<type> es de tipo B<DBTYPE> (tal y como se define en el fichero cabecera I<E<lt>db.hE<gt>>) y puede tener el valor B<DB_BTREE>, B<DB_HASH> o B<DB_RECNO>.
fr: L'argument I<type> est du type I<DBTYPE> (défini dans le fichier d'en-tête I<E<lt>db.hE<gt>>) et peut prendre les valeurs B<DB_BTREE>, B<DB_HASH> ou B<DB_RECNO>.
pl: Argument I<type> jest typu I<DBTYPE> (który jest zdefiniowany w pliku nagłówkowym I<E<lt>db.hE<gt>>) i może przybierać wartości B<DB_BTREE>, B<DB_HASH> lub B<DB_RECNO>.

source: The I<openinfo> argument is a pointer to an access-method-specific structure described in the access method's manual page. If I<openinfo> is NULL, each access method will use defaults appropriate for the system and the access method.
es: El argumento I<openinfo> es un puntero a una estructura específica del método de acceso y descrita en la página de manual del método de acceso. Si I<openinfo> es NULL, cada método de acceso usará valor por defecto apropiados para el sistema y para el método de acceso.
fr: L'argument I<openinfo> est un pointeur vers une structure spécifique à la méthode d'accès décrite dans la page de manuel de cette méthode d'accès. Si I<openinfo> est NULL, chaque méthode d'accès utilisera un comportement par défaut approprié pour le système et le type de base de données.
pl: Argument I<openinfo> jest wskaźnikiem do struktury specyficznej dla metody dostępu, opisanej na stronie podręcznika danej metody dostępu. Jeśli I<openinfo> jest równe NULL, to każda z metod dostępu będzie korzystać z wartości domyślnych, właściwych dla systemu i tej metody dostępu.

source: B<dbopen>() returns a pointer to a I<DB> structure on success and NULL on error. The I<DB> structure is defined in the I<E<lt>db.hE<gt>> include file, and contains at least the following fields:
es: B<dbopen> devuelve un puntero a una estructura I<DB> en caso de éxito y NULL en caso de error. La estructura I<DB> se define en el fichero cabecera I<E<lt>db.hE<gt>> y contiene, al menos, los siguientes campos:
fr: B<dbopen>() renvoie un pointeur sur une structure I<DB> si elle réussit, ou NULL en cas d'erreur. La structure I<DB> est définie dans le fichier d'en-tête I<E<lt>db.hE<gt>> et contient, au moins, les champs suivants\ :
pl: B<dbopen>() po pomyślnym zakończeniu zwraca wskaźnik do struktury I<DB>, a NULL w przypadku błędu. Struktura I<DB> jest zdefiniowana w pliku nagłówkowym I<E<lt>db.hE<gt>> i zawiera przynajmniej następujące pola:

source: These elements describe a database type and a set of functions performing various actions. These functions take a pointer to a structure as returned by B<dbopen>(), and sometimes one or more pointers to key/data structures and a flag value.
es: Estos elementos describen un tipo de base de datos y un conjunto de funciones que realizan diversas acciones. Estas funciones toman un puntero a una estructura como las devueltas por B<dbopen>(), y algunas veces uno o más punteros a estructuras clave/datos y a un valor de opción.
fr: Ces éléments décrivent un type de base de données et un jeu de fonctions effectuant diverses actions. Ces fonctions reçoivent un pointeur sur une structure semblable à celle renvoyée par B<dbopen>(), et parfois un ou plusieurs pointeurs sur des structures clés/données et une valeur d'attribut.
pl: Elementy te opisują rodzaj bazy danych i zestaw funkcji wykonujących różne operacje. Funkcje te biorą jako argument wskaźnik do struktury takiej, jak zwracana przez B<dbopen>() i - czasami - jeden lub więcej wskaźników do struktur klucz/dane oraz wartość znacznika.

source: The type of the underlying access method (and file format).
es: El tipo del método de acceso subyacente (y del formato de fichero).
fr: Le type de méthode d'accès sous-jacent (et le type de fichier).
pl: Rodzaj właściwej metody dostępu (i format plików).

source: A pointer to a routine to flush any cached information to disk, free any allocated resources, and close the underlying file(s). Since key/data pairs may be cached in memory, failing to sync the file with a I<close> or I<sync> function may result in inconsistent or lost information. I<close> routines return -1 on error (setting I<errno>) and 0 on success.
es: Un puntero a una rutina para vaciar a disco cualquier información en caché, liberar cualquier recurso reservado y cerrar el(los) fichero(s) subyacentes. Puesto que los pares clave/datos pueden estar en la memoria caché, el dejar de sincronizar el fichero con las funciones I<close> o I<sync> puede producir inconsistencias o pérdida de información. Las rutinas I<close> devuelve -1 en caso de error (asignando un valor a I<errno>) y 0 en caso de éxito.
fr: Un pointeur sur une routine qui vide vers le disque toutes les informations en cache, libère les ressources allouées, et ferme le(s) fichier(s). Comme les paires clés/données peuvent être cachées en mémoire, l'oubli de synchronisation du fichier avec les fonctions I<close>() ou I<sync>() peut avoir pour conséquence des données incohérentes ou perdues. La routine I<close>() renvoie -1 en cas d'erreur (et remplit I<errno>) et 0 si elle réussit.
pl: Wskaźnik do funkcji zrzucającej zbuforowane informacje ma dysk, zwalniającej przydzielone zasoby i zamykającej podległe pliki. Ze względu na to, że pary klucz/dane mogą być buforowane w pamięci, niepomyślne zrzucenie buforów pliku za pomocą funkcji I<close> lub I<sync> może prowadzić do niespójności lub utraty informacji. Funkcje I<close> zwracają -1 w przypadku błędu (ustawiając I<errno>), a 0 w przypadku pomyślnego zakończenia.

source: A pointer to a routine to remove key/data pairs from the database.
es: Un puntero a una rutina para eliminar pares clave/datos de la base de datos.
fr: Un pointeur vers une routine permettant de supprimer des paires clés/données de la base de données.
pl: Wskaźnik do funkcji usuwającej pary klucz/dane z bazy danych.

source: The argument I<flag> may be set to the following value:
fr: Le paramètre I<flag> peut prendre l'une des valeurs suivantes\ :
pl: Argument I<flag> może mieć jedną z następujących wartości:

source: Delete the record referenced by the cursor. The cursor must have previously been initialized.
es: Borra el registro referenciado por el cursor. El cursor debe haber sido inicializado previamente.
fr: Supprimer l'enregistrement référencé par le curseur. Ce curseur doit bien entendu avoir été précédemment initialisé.
pl: Usuwa rekord wskazywany przez kursor. Kursor musi zostać wcześniej zainicjowany.

source: I<delete> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the specified I<key> was not in the file.
es: La rutina I<delete> devuelve -1 en caso de error (asignando un valor a I<errno>), 0 en caso de éxito y 1 si la clave I<key> no estaba en el fichero.
fr: La routine I<delete>() renvoie 0 si elle réussit, -1 en cas d'erreur (et définit I<errno>), ou 1 si la clé I<key> indiquée n'a pas été trouvée dans le fichier.
pl: Funkcje I<delete> zwracają -1 w przypadku błędu (ustawiając I<errno>), 0 w przypadku pomyślnego zakończenia albo 1, gdy klucz podany w parametrze I<key> nie występuje w pliku.

source: A pointer to a routine which returns a file descriptor representative of the underlying database. A file descriptor referencing the same file will be returned to all processes which call B<dbopen>() with the same I<file> name. This file descriptor may be safely used as an argument to the B<fcntl>(2) and B<flock>(2) locking functions. The file descriptor is not necessarily associated with any of the underlying files used by the access method. No file descriptor is available for in memory databases. I<fd> routines return -1 on error (setting I<errno>), and the file descriptor on success.
es: Un puntero a una rutina que devuelve un descriptor de fichero representante de la base de datos subyacente. A todos los procesos que llamen a B<dbopen>() con el mismo nombre fichero I<file>, se les devolverá un descriptor de fichero referenciando al mismo fichero. El descriptor de fichero se puede usar de forma segura como argumento de las funciones de bloqueo B<fcntl>(2) y B<flock>(2). El descriptor de fichero no está asociado necesariamente con ninguno de los ficheros subyacentes usados por el método de acceso. No se dispone de ningún descriptor de fichero para las bases de datos residentes en memoria. Las rutinas I<fd> devuelven -1 en caso de error (asignando un valor a I<errno>), y el descriptor de fichero en caso de éxito.
fr: Un pointeur vers une routine qui renvoie le descripteur du fichier représentant la base de données. Le même descripteur de fichier doit être fourni à tous les processus qui invoquent B<dbopen>() avec le même nom I<file>. Ce descripteur de fichier doit pouvoir servir d'argument aux fonctions de verrouillage B<fcntl>(2) et B<flock>(2). Le descripteur de fichier n'est pas nécessairement associé avec l'un des fichiers sous-jacents utilisés par les méthodes d'accès. Aucun descripteur n'est disponible pour les bases de données en mémoire. La routine I<fd> renvoie -1 en cas d'erreur (et définit I<errno>), et le descripteur de fichiers en cas de succès.
pl: Wskaźnik do funkcji zwracającej deskryptor pliku odpowiadający używanej bazie danych. Dla wszystkich procesów wywołujących B<dbopen>() dla tej samej nazwy pliku I<file> zostanie zwrócony deskryptor pliku wskazujący na ten sam plik. Tego deskryptora pliku można bezpiecznie używać jako argumentu funkcji blokujących B<fcntl>(2) i B<flock>(2). Deskryptor pliku nie musi być związany z którymkolwiek z plików używanych przez daną metodę dostępu. Deskryptor pliku nie jest dostępny dla baz danych zawartych w pamięci. Funkcje I<fd> zwracają -1 w przypadku błędu (ustawiając I<errno>), a deskryptor pliku w przypadku pomyślnego zakończenia.

source: A pointer to a routine which is the interface for keyed retrieval from the database. The address and length of the data associated with the specified I<key> are returned in the structure referenced by I<data>. I<get> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the I<key> was not in the file.
es: Un puntero a una rutina que es la interfaz para la recuperación por clave de la base de datos. La dirección y longitud de los datos asociados con la clave especificada, I<key>, se devuelven en la estructura referenciada por I<data>. Las rutinas I<get> devuelven -1 en caso de error (asignando un valor a I<errno>), 0 e caso de éxito y 1 si la clave I<key> no estaba en el fichero.
fr: Un pointeur vers la routine d'interface de recherche assistée d'une clé dans la base de données. L'adresse et la longueur des données associées avec la clé I<key> indiquée sont fournies dans une structure référencée par l'argument I<data>. La routine I<get>() renvoie -1 en cas d'erreur (et remplit I<errno>), 0 en cas de réussite, ou 1 si la clé I<key> n'a pas été trouvée dans le fichier.
pl: Wskaźnik do funkcji stanowiącej interfejs dla pobierania danych z bazy według klucza. Adres i rozmiar danych związanych z podanym kluczem I<key> są zwracane w strukturze wskazywanej przez I<data>. Funkcje I<get> zwracają -1 w przypadku błędu (ustawiając I<errno>), 0 w przypadku pomyślnego zakończenia albo 1, gdy podany I<key> nie występuje w pliku.

source: A pointer to a routine to store key/data pairs in the database.
es: Un puntero a una rutina para almacenar pares clave/datos en la base de datos.
fr: Un pointeur vers une routine permettant de stocker les paires clés/données dans la base de données.
pl: Wskaźnik do funkcji przechowującej pary klucz/dane w bazie danych.

source: The argument I<flag> may be set to one of the following values:
fr: Le paramètre I<flag> peut prendre l'une des valeurs suivantes\ :
pl: Parametr I<flag> może mieć jedną z następujących wartości:

source: Replace the key/data pair referenced by the cursor. The cursor must have previously been initialized.
es: Reemplazar el par clave/datos referenciado por el cursos. El cursor debe haber sido inicializado previamente.
fr: Remplacer la paire clé/donnée référencée par le curseur. Ce curseur doit avoir été positionné précédemment.
pl: Zastępuje parę klucz/dane wskazywaną przez kursor. Kursor musi zostać wcześniej zainicjowany.

source: Append the data immediately after the data referenced by I<key>, creating a new key/data pair. The record number of the appended key/data pair is returned in the I<key> structure. (Applicable only to the B<DB_RECNO> access method.)
es: Añadir los datos inmediatamente después de los datos referenciados por I<key>, creando un nuevo par clave/datos. El número de registro del par clave/datos añadido se devuelve en la estructura I<key>. (Aplicable sólo al método de acceso B<DB_RECNO>).
fr: Ajouter les données immédiatement après les données référencées par la clé I<key>, créant ainsi une nouvelle paire clé/donnée. Le numéro d'enregistrement de la paire ajoutée est renvoyé dans la structure I<key> (utilisable uniquement avec la méthode d'accès B<DB_RECNO>).
pl: Dołącza dane bezpośrednio po danych wskazywanych przez I<key>, tworząc nową parę klucz/dane. Numer rekordu dodanej pary klucz/dane jest zwracany w strukturze I<key>. (Dotyczy jedynie metody dostępu B<DB_RECNO>).

source: Insert the data immediately before the data referenced by I<key>, creating a new key/data pair. The record number of the inserted key/data pair is returned in the I<key> structure. (Applicable only to the B<DB_RECNO> access method.)
es: Insertar los datos inmediatamente antes de los datos referenciados por I<key>, creando un nuevo par clave/datos. El número de registro del par clave/datos insertado se devuelve en la estructura I<key>. (Aplicable sólo al método de acceso B<DB_RECNO>).
fr: Ajouter les données immédiatement avant les données référencées par I<key>, créant ainsi une nouvelle paire clé/donnée. Le numéro d'enregistrement de la paire insérée est renvoyé dans la structure I<key> (utilisable uniquement avec la méthode d'accès B<DB_RECNO>).
pl: Wstawia dane bezpośrednio przed danymi wskazywanymi przez I<key>, tworząc nową parę klucz/dane. Numer rekordu wstawionej pary klucz/dane jest zwracany w strukturze I<key>. (Dotyczy jedynie metody dostępu B<DB_RECNO>).

source: Enter the new key/data pair only if the key does not previously exist.
es: Introducir el nuevo par clave/datos sólo si la clave no existe ya.
fr: N'ajouter la paire clé/donnée que si la clé n'existe pas précédemment.
pl: Wprowadza nową parę klucz/dane tylko gdy klucz wcześniej nie istniał.

source: Store the key/data pair, setting or initializing the position of the cursor to reference it. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
es: Almacenar el par clave/datos, poniendo o inicializando la posición del cursor para que lo referencie. (Aplicable sólo a los métodos de acceso B<DB_BTREE> y B<DB_RECNO>).
fr: Enregistrer la paire clé/donnée, en positionnant ou initialisant la position du curseur pour la référencer (utilisable uniquement avec les méthodes d'accès B<DB_RECNO> et B<DB_TREE>).
pl: Przechowuje parę klucz/dane, ustawiając lub inicjując pozycję kursora tak, aby na nią wskazywała. (Dotyczy jedynie metod dostępu B<DB_BTREE> i B<DB_RECNO>).

source: B<R_SETCURSOR> is available only for the B<DB_BTREE> and B<DB_RECNO> access methods because it implies that the keys have an inherent order which does not change.
es: B<R_SETCURSOR> sólo está disponible para los métodos de acceso B<DB_BTREE> y B<DB_RECNO> porque implica que las claves tienen un orden inherente que no cambia.
fr: B<R_SETCURSOR> n'est disponible que pour les méthodes B<DB_BTREE> et B<DB_RECNO> car cela implique que les clés ont un ordre inhérent immuable.
pl: B<R_SETCURSOR> jest dostępne jedynie dla metod dostępu B<DB_BTREE> i B<DB_RECNO>, gdyż zakłada, że klucze mają ustaloną, niezmienną kolejność.

source: B<R_IAFTER> and B<R_IBEFORE> are available only for the B<DB_RECNO> access method because they each imply that the access method is able to create new keys. This is true only if the keys are ordered and independent, record numbers for example.
es: B<R_IAFTER> y B<R_IBEFORE> sólo están disponibles para el método de acceso B<DB_RECNO> porque cada una de ellas implica que el método de acceso es capaz de crear nuevas claves. Esto sólo es cierto si las claves están ordenadas y son independientes, por ejemplo, los números de registro.
fr: B<R_IAFTER> et B<R_IBEFORE> ne sont disponibles qu'avec la méthode B<DB_RECNO> car ils impliquent que la méthode d'accès soit capable de créer de nouvelles clés. Cela n'est vrai que si les clés sont ordonnées et indépendantes, comme des numéros d'enregistrement.
pl: B<R_IAFTER> i B<R_IBEFORE> są dostępne jedynie dla metody dostępu B<DB_RECNO>, gdyż każde z nich zakłada, że metoda dostępu umożliwia tworzenie nowych kluczy. Jest to prawda jedynie w przypadku, gdy klucze są uporządkowane i niezależne, na przykład numery rekordów.

source: The default behavior of the I<put> routines is to enter the new key/data pair, replacing any previously existing key.
es: El comportamiento por defecto de las rutinas I<put> es introducir el nuevo par clave/datos, reemplazando cualquier clave ya existente.
fr: Le comportement par défaut de la routine I<put> est de stocker une nouvelle paire clé/donnée, en remplaçant toute clé existant précédemment.
pl: Domyślne zachowanie funkcji I<put> polega na wprowadzeniu nowej pary klucz/dane, zastępując uprzednio istniejący klucz.

source: I<put> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the B<R_NOOVERWRITE> I<flag> was set and the key already exists in the file.
es: Las rutinas I<put> devuelven -1 en caso de error (asignando un valor a I<errno>), 0 en caso de éxito y 1 si se especificó la opción B<R_NOOVERWRITE> en I<flag> y la clave ya existía en el fichero.
fr: Les routines I<put>() renvoient -1 en cas d'erreur (et remplissent I<errno>), 0 en cas de succès, ou 1 si l'attribut B<R_NOOVERWRITE> a été indiqué dans I<flag>, et si la clé existait déjà dans le fichier.
pl: Funkcje I<put> zwracają -1 w przypadku błędu (ustawiając I<errno>), 0 w przypadku pomyślnego zakończenia oraz 1, gdy I<flag> jest ustawiony na B<R_NOOVERWRITE>, a klucz już istnieje w pliku.

source: A pointer to a routine which is the interface for sequential retrieval from the database. The address and length of the key are returned in the structure referenced by I<key>, and the address and length of the data are returned in the structure referenced by I<data>.
es: Un puntero a una rutina que es la interfaz para la recuperación secuencial de la base de datos. La dirección y longitud de la clave se devuelven en la estructura referenciada por I<key>, y la dirección y la longitud de los datos se devuelven en la esctructura referenciada por I<data>.
fr: Un pointeur vers la routine d'interface pour la recherche séquentielle dans la base de données. L'adresse et la longueur de la clé sont renvoyées dans une structure référencée par I<key>, et l'adresse et la longueur des données dans une structure référencée par I<data>.
pl: Wskaźnik do funkcji stanowiącej interfejs dla sekwencyjnego pobierania danych z bazy. Adres i długość klucza są zwracane w strukturze wskazywanej przez I<key>, a adres i rozmiar danych są zwracane w strukturze wskazywanej przez I<data>.
