Repository: sebras/manpages-l10n
Catalog: po/*/man3/dlinfo.3.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: dlinfo - obtain information about a dynamically loaded object
fr: dlinfo - Obtenir des informations sur un objet chargé dynamiquement

source: LIBRARY
fr: BIBLIOTHÈQUE

source: The B<dlinfo>() function obtains information about the dynamically loaded object referred to by I<handle> (typically obtained by an earlier call to B<dlopen>(3) or B<dlmopen>(3)). The I<request> argument specifies which information is to be returned. The I<info> argument is a pointer to a buffer used to store information returned by the call; the type of this argument depends on I<request>.
fr: La fonction B<dlinfo>() obtient des informations sur l'objet chargé dynamiquement et référencé par I<handle> (habituellement obtenu par un appel préalable à B<dlopen>(3) ou B<dlmopen>(3)). Le paramètre I<request> spécifie quelle information doit être renvoyée. Le paramètre I<info> est un pointeur vers un tampon utilisé pour stocker les informations renvoyées par l'appel ; le type de ce paramètre dépend de I<request>.

source: The following values are supported for I<request> (with the corresponding type for I<info> shown in parentheses):
fr: Les valeurs suivantes sont prises en charge pour I<request> (avec le type correspondant pour I<info> entre parenthèses) :

source: Obtain the ID of the link-map list (namespace) in which I<handle> is loaded.
fr: Récupérer l'identifiant de la liste d'association des liens (espace de noms) dans lequel I<handle> est chargé.

source: Obtain a pointer to the I<link_map> structure corresponding to I<handle>. The I<info> argument points to a pointer to a I<link_map> structure, defined in I<E<lt>link.hE<gt>> as:
fr: Récupèrer un pointeur vers la structure I<link_map> correspondant à I<handle>. Le paramètre I<info> pointe vers un pointeur sur une structure I<link_map>, définie dans I<E<lt>link.hE<gt>> comme :

source: struct link_map { ElfW(Addr) l_addr; /* Difference between the address in the ELF file and the address in memory */ char *l_name; /* Absolute pathname where object was found */ ElfW(Dyn) *l_ld; /* Dynamic section of the shared object */ struct link_map *l_next, *l_prev; /* Chain of loaded objects */
fr: struct link_map { ElfW(Addr) l_addr; /* Difference entre l'adresse dans le fichier ELF et l'adresse en mémoire */ char *l_name; /* Chemin absolu du fichier où l'objet a été trouvé */ ElfW(Dyn) *l_ld; /* La section dynamique de l'objet partagé */ struct link_map *l_next, *l_prev; /* Chaîne des objets chargés */

source: /* Plus additional fields private to the implementation */ };
fr: /* Plus des champs supplémentaires privés de l'implementation */ };

source: Copy the pathname of the origin of the shared object corresponding to I<handle> to the location pointed to by I<info>.
fr: Copie le chemin du fichier de l'objet partégé correspondant à I<handle> vers l'endroit pointé vers I<info>.

source: Obtain the library search paths for the shared object referred to by I<handle>. The I<info> argument is a pointer to a I<Dl_serinfo> that contains the search paths. Because the number of search paths may vary, the size of the structure pointed to by I<info> can vary. The B<RTLD_DI_SERINFOSIZE> request described below allows applications to size the buffer suitably. The caller must perform the following steps:
fr: Obtient les chemins de recherche de bibliothèques pour un objet partagé indiqué par I<handle>. L'argument I<info> est un pointeur vers un I<Dl_serinfo> qui contient les chemins de recherche. Parce que le nombre de chemins de recherche peut varier, la taille de la structure sur laquelle I<info> pointe peut aussi varier. La requête B<RTLD_DI_SERINFOSIZE> décrite ci-dessous permet aux applications de déterminer convenablement la taille du tampon. L'appelant doit effectur les étapes suivantes :

source: Use a B<RTLD_DI_SERINFOSIZE> request to populate a I<Dl_serinfo> structure with the size (I<dls_size>) of the structure needed for the subsequent B<RTLD_DI_SERINFO> request.
fr: Utiliser une requête B<RTLD_DI_SERINFOSIZE> pour renseigner une structure I<Dl_serinfo> avec la taille (I<dls_size>) de la structure requise pour la requête B<RTLD_DI_SERINFO> ultérieure.

source: Allocate a I<Dl_serinfo> buffer of the correct size (I<dls_size>).
fr: Allouer un tampon I<Dl_serinfo> de la bonne taille (I<dls_size>).

source: Use a further B<RTLD_DI_SERINFOSIZE> request to populate the I<dls_size> and I<dls_cnt> fields of the buffer allocated in the previous step.
fr: Utiliser un requête B<RTLD_DI_SERINFOSIZE> pour remplir les champs I<dls_size> et I<dls_cnt> du tampon alloué à l'étape précédante.

source: Use a B<RTLD_DI_SERINFO> to obtain the library search paths.
fr: Utiliser un B<RTLD_DI_SERINFO> pour obtenir les chemins de recherche de bibliothèques.

source: The I<Dl_serinfo> structure is defined as follows:
fr: La structure I<Dl_serinfo> est définie comme suit :

source: typedef struct { size_t dls_size; /* Size in bytes of the whole buffer */ unsigned int dls_cnt; /* Number of elements in \(aqdls_serpath\(aq */ Dl_serpath dls_serpath[1]; /* Actually longer, \(aqdls_cnt\(aq elements */ } Dl_serinfo;
fr: typedef struct { size_t dls_size; /* Taille en octets du tampon entier */ unsigned int dls_cnt; /* Nombre d'éléments dans \(aqdls_serpath\(aq */ Dl_serpath dls_serpath[1]; /* En fait plus long, \(aqdls_cnt\(aq éléments */ } Dl_serinfo;

source: Each of the I<dls_serpath> elements in the above structure is a structure of the following form:
fr: Chacun des éléments I<dls_serpath> dans la structure ci-dessus sont structurés sous la forme suivantes\ :

source: typedef struct { char *dls_name; /* Name of library search path directory */ unsigned int dls_flags; /* Indicates where this directory came from */ } Dl_serpath;
fr: typedef struct { char *dls_name; /* Nom du répertoire de recherche de chemin de bibliothèque */ unsigned int dls_flags; /* Indique d'où ce répertoire provient */ } Dl_serpath;

source: The I<dls_flags> field is currently unused, and always contains zero.
fr: Le champ I<dls_flags> n'est pas utilisé pour le moment et contient toujours zéro.

source: Populate the I<dls_size> and I<dls_cnt> fields of the I<Dl_serinfo> structure pointed to by I<info> with values suitable for allocating a buffer for use in a subsequent B<RTLD_DI_SERINFO> request.
fr: Renseigne les champs I<dls_size> et I<dls_cnt> de la structure I<Dl_serinfo> sur laquelle pointe I<info> avec des valeurs appropriées pour allouer un tampon pouvant être utilisé dans une requête B<RTLD_DI_SERINFO> ultérieure.

source: B<RTLD_DI_TLS_MODID> (I<size_t *>, since glibc 2.4)
fr: B<RTLD_DI_TLS_MODID> (I<size_t *>, depuis la version 2.4 de la glibc)

source: Obtain the module ID of this shared object's TLS (thread-local storage) segment, as used in TLS relocations. If this object does not define a TLS segment, zero is placed in I<*info>.
fr: Obtient l'identifiant de module du segment TLS (stockage local au thread) de l'objet partagé, comme utilisé dans les relocalisations TLS. Si cet objet ne définit pas de segment TLS, zéro est mis dans I<*info>.

source: B<RTLD_DI_TLS_DATA> (I<void **>, since glibc 2.4)
fr: B<RTLD_DI_TLS_DATA> (I<void **>, depuis la version 2.4 de la glibc)

source: Obtain a pointer to the calling thread's TLS block corresponding to this shared object's TLS segment. If this object does not define a PT_TLS segment, or if the calling thread has not allocated a block for it, NULL is placed in I<*info>.
fr: Obtenir un pointeur au bloc TLS du thread appelant correspondant au segment TLS des objets partagés. Si cet objet ne définit pas un segment PT_TLS, ou si le thread appelant ne lui a pas alloué de bloc, NULL est placé dans I<*info>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<dlinfo>() returns 0. On failure, it returns -1; the cause of the error can be diagnosed using B<dlerror>(3).
fr: En cas de succès, B<dlinfo>() renvoie B<0>. En cas d'erreur, elle renvoie B<-1> ; la cause de l'erreur peut être diagnostiquée avec B<dlerror>(3).

source: B<dlinfo>() first appeared in glibc 2.3.3.
fr: B<dlinfo>() est apparue la première fois dans la version 2.3.3 de la glibc.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: This function is a nonstandard GNU extension.
fr: Cette fonction est une extension GNU non standard.

source: This function derives from the Solaris function of the same name and also appears on some other systems. The sets of requests supported by the various implementations overlaps only partially.
fr: Cette fonction dérive de la fonction Solaris de même nom et existe aussi sur d'autres systèmes. Les ensembles de requêtes prises en charge par les diverses implémentations ne se recouvrent que partiellement.

source: EXAMPLES
fr: EXEMPLES

source: The program below opens a shared objects using B<dlopen>(3) and then uses the B<RTLD_DI_SERINFOSIZE> and B<RTLD_DI_SERINFO> requests to obtain the library search path list for the library. Here is an example of what we might see when running the program:
fr: Le programme ci-dessous ouvre un objet partagé en utilisant B<dlopen>(3) et utilise par la suite les requêtes B<RTLD_DI_SERINFOSIZE> et B<RTLD_DI_SERINFO> pour obtenir la liste de chemin de recherche de bibliothèques pour la bibliothèque. Voici un exemple de ce qui pourrait être observé lors de l'exécution du programme :

source: Program source
fr: Source du programme

source: /* Obtain a handle for shared object specified on command line. */
fr: /* Obtenir un gestionnaire pour l'objet partagé indiqué sur la ligne de commande. */

source: /* Discover the size of the buffer that we must pass to RTLD_DI_SERINFO. */
fr: /* Découvrir la taille du tampon qu'il faut passer à RTLD_DI_SERINFO. */

source: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, &serinfo) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
fr: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, &serinfo) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE a échoué : %s\en", dlerror()); exit(EXIT_FAILURE); }

source: /* Allocate the buffer for use with RTLD_DI_SERINFO. */
fr: /* Allouer le tampon pour l'utiliser avec RTLD_DI_SERINFO. */

source: /* Initialize the \(aqdls_size\(aq and \(aqdls_cnt\(aq fields in the newly allocated buffer. */
fr: /* Initialiser les champs \(aqdls_size\(aq et \(aqdls_cnt\(aq fields dans le tampon nouvellement alloué. */

source: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
fr: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE a échoué : %s\en", dlerror()); exit(EXIT_FAILURE); }

source: /* Fetch and print library search list. */
fr: /* Récupérer et afficher la liste de recherche des bibliothques. */

source: if (dlinfo(handle, RTLD_DI_SERINFO, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFO failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
fr: if (dlinfo(handle, RTLD_DI_SERINFO, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFO a échoué : %s\en", dlerror()); exit(EXIT_FAILURE); }

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Link with I<-ldl>.
fr: Éditez les liens avec I<-ldl>.

source: CONFORMING TO
fr: CONFORMITÉ

source: /* Obtain a handle for shared object specified on command line */
fr: /* Obtenir un gestionnaire pour l'objet partagé indiqué sur la ligne de commande */

source: /* Discover the size of the buffer that we must pass to RTLD_DI_SERINFO */
fr: /* Récupérer la taille du tampon qui doit être passé à RTLD_DI_SERINFO */

source: /* Allocate the buffer for use with RTLD_DI_SERINFO */
fr: /* Allouer le tampon pour l'utiliser avec RTLD_DI_SERINFO */

source: /* Initialize the \(aqdls_size\(aq and \(aqdls_cnt\(aq fields in the newly allocated buffer */
fr: /* Initialiser les champs \(aqdls_size\(aq et \(aqdls_cnt\(aq dans le tampon nouvellement alloué */

source: /* Fetch and print library search list */
fr: /* Récupère et affiche la liste de recherche de bibliothèques */

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: typedef struct { size_t dls_size; /* Size in bytes of the whole buffer */ unsigned int dls_cnt; /* Number of elements in 'dls_serpath' */ Dl_serpath dls_serpath[1]; /* Actually longer, 'dls_cnt' elements */ } Dl_serinfo;
fr: typedef struct { size_t dls_size; /* Taille en octets du tampon entier */ unsigned int dls_cnt; /* Nombre d'éléments dans \(aqdls_serpath\(aq */ Dl_serpath dls_serpath[1]; /* En fait plus long, \(aqdls_cnt\(aq éléments */ } Dl_serinfo;

source: EXAMPLE
fr: EXEMPLE

source: /* Obtain a handle for shared objects specified on command line */
fr: /* Obtenir un gestionnaire pour l'objet partagé indiqué sur la ligne de commande */

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
