Repository: sebras/manpages-l10n
Catalog: po/*/man3/fmemopen.3.po
Languages: fr

source: NAME
fr: NOM

source: fmemopen - open memory as stream
fr: fmemopen - Ouvrir de la mémoire en tant que flux

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: B<FILE *fmemopen(void *>I<buf>B<, size_t >I<size>B<, const char *>I<mode>B<);>
fr: B<FILE *fmemopen(void *>I<tampon>, B<size_t> I<taille>, B< const char *>I<mode>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: Since glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Before glibc 2.10: _GNU_SOURCE
fr: Depuis la version 2.10 de la glibc : _POSIX_C_SOURCE E<gt>= 200809L Avant la version 2.10 de la glibc : _GNU_SOURCE

source: The B<fmemopen>() function opens a stream that permits the access specified by I<mode>. The stream allows I/O to be performed on the string or memory buffer pointed to by I<buf>.
fr: La fonction B<fmemopen>() ouvre un flux qui permet l'accès spécifié par I<mode>. Le flux permet d'effectuer des entrées/sorties sur la chaîne ou le tampon mémoire pointé par I<tampon>.

source: The I<mode> argument specifies the semantics of I/O on the stream, and is one of the following:
fr: L'argument I<mode> spécifie le mode d'ouverture du flux et peut avoir pour valeurs :

source: The stream is opened for reading.
fr: Le flux est ouvert en lecture.

source: The stream is opened for writing.
fr: Le flux est ouvert en écriture.

source: Append; open the stream for writing, with the initial buffer position set to the first null byte.
fr: Ajout ; le flux est ouvert en écriture, la position initiale du tampon étant définie au premier octet de valeur zéro.

source: Open the stream for reading and writing.
fr: Le flux est ouvert en lecture et en écriture.

source: Open the stream for reading and writing. The buffer contents are truncated (i.e., \(aq\e0\(aq is placed in the first byte of the buffer).
fr: Le flux est ouvert en lecture et en écriture. Le contenu du tampon est écrasé (autrement dit, \(aq\e0\(aq) est placé dans le premier octet du tampon.

source: Append; open the stream for reading and writing, with the initial buffer position set to the first null byte.
fr: Ajout ; le flux est ouvert en lecture et écriture, la position initiale du tampon étant définie au premier octet de valeur zéro.

source: The stream maintains the notion of a current position, the location where the next I/O operation will be performed. The current position is implicitly updated by I/O operations. It can be explicitly updated using B<fseek>(3), and determined using B<ftell>(3). In all modes other than append, the initial position is set to the start of the buffer. In append mode, if no null byte is found within the buffer, then the initial position is I<size+1>.
fr: Le flux conserve la notion de position actuelle qui est l'endroit du tampon où la prochaine opération d'entrée/sortie aura lieu. La position actuelle est automatiquement mise à jour par les opérations d'entrées/sorties. Elle peut aussi être définie de manière explicite à l'aide de B<fseek>(3) et obtenue à l'aide de B<ftell>(3). Dans tous les modes autres que Ajout, la position actuelle est initialisée au début du tampon. En mode Ajout, si aucun octet de valeur zéro n'est trouvé dans le tampon, la position actuelle est initialisée à I<taille+1>.

source: If I<buf> is specified as NULL, then B<fmemopen>() allocates a buffer of I<size> bytes. This is useful for an application that wants to write data to a temporary buffer and then read it back again. The initial position is set to the start of the buffer. The buffer is automatically freed when the stream is closed. Note that the caller has no way to obtain a pointer to the temporary buffer allocated by this call (but see B<open_memstream>(3)).
fr: Si l'argument I<tampon> vaut NULL, alors la fonction B<fmemopen>() alloue un tampon de I<taille> octets. C'est utile pour les applications qui veulent écrire des données dans un tampon temporaire et les lire ensuite. La position initiale est définie au début du tampon. Le tampon est automatiquement supprimé lorsque le flux est fermé. Notez que l'appelant ne peut pas obtenir de pointeur vers le tampon temporaire alloué avec cette fonction (voir à ce sujet B<open_memstream>(3)).

source: When a stream that has been opened for writing is flushed (B<fflush>(3)) or closed (B<fclose>(3)), a null byte is written at the end of the buffer if there is space. The caller should ensure that an extra byte is available in the buffer (and that I<size> counts that byte) to allow for this.
fr: Lorsqu'un flux ouvert en écriture est vidé (consultez B<fflush>(3)), ou fermé (consultez B<fclose>(3)), un octet nul est écrit à la fin du tampon s'il y a de la place. Pour ce faire, l'appelant doit s'assurer qu'un octet supplémentaire est disponible dans le tampon (et que I<taille> en tient compte).

source: In a stream opened for reading, null bytes (\(aq\e0\(aq) in the buffer do not cause read operations to return an end-of-file indication. A read from the buffer will indicate end-of-file only when the current buffer position advances I<size> bytes past the start of the buffer.
fr: Avec un flux ouvert en lecture, si le tampon contient des octets de valeur (\(aq\e0\(aq), les opérations de lecture ne renverront pas une indication de fin de fichier. Une lecture depuis le tampon n'indiquera la fin du fichier que lorsque la position actuelle du tampon aura atteint la valeur I<taille>.

source: Write operations take place either at the current position (for modes other than append), or at the current size of the stream (for append modes).
fr: Les opérations d'écriture s'effectuent soit à la position actuelle (pour les modes autres que Ajout), ou à une position correspondant à la taille du flux (pour les mode Ajout).

source: Attempts to write more than I<size> bytes to the buffer result in an error. By default, such errors will be visible (by the absence of data) only when the I<stdio> buffer is flushed. Disabling buffering with the following call may be useful to detect errors at the time of an output operation:
fr: Essayer d'écrire plus de I<taille> octets dans le tampon crée une erreur. Par défaut, de telles erreurs ne seront visibles (en l'absence de données) que lorsque le tampon I<stdio> sera vidé. Désactiver cette mise en tampon avec l'appel suivant peut s'avérer utile pour détecter les erreurs au moment d'une opération de sortie :

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: Upon successful completion, B<fmemopen>() returns a I<FILE> pointer. Otherwise, NULL is returned and I<errno> is set to indicate the error.
fr: En cas de succès, B<fmemopen>() renvoie un pointeur de type I<FILE>. Sinon, elle renvoie NULL et I<errno> contient le code d'erreur.

source: B<fmemopen>() was already available in glibc 1.0.x.
fr: B<fmemopen>() était déjà disponible dans la version 1.0.x. de la glibc.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: POSIX.1-2008. This function is not specified in POSIX.1-2001, and is not widely available on other systems.
fr: POSIX.1-2008. Cette fonction n'est pas spécifiée dans POSIX.1-2001 et n'est que rarement disponible sur d'autres systèmes.

source: POSIX.1-2008 specifies that \(aqb\(aq in I<mode> shall be ignored. However, Technical Corrigendum 1 adjusts the standard to allow implementation-specific treatment for this case, thus permitting the glibc treatment of \(aqb\(aq.
fr: POSIX.1-2008 spécifie que « b » dans I<mode> sera ignoré. Cependant, Technical Corrigendum 1 ajuste la norme pour permettre un traitement spécifique à l'implémentation dans ce cas, permettant ainsi à la glibc de traiter « b ».

source: There is no file descriptor associated with the file stream returned by this function (i.e., B<fileno>(3) will return an error if called on the returned stream).
fr: Il n'y a pas de descripteur de fichier associé avec le flux renvoyé par cette fonction (par exemple, B<fileno>(3) retournera une erreur si elle est appelée avec un tel flux).

source: With version 2.22, binary mode (see below) was removed, many longstanding bugs in the implementation of B<fmemopen>() were fixed, and a new versioned symbol was created for this interface.
fr: Avec la version 2.22, le mode binaire a été supprimé (voir ci-dessous), de nombreux bogues anciens ont été résolus et un nouveau symbole versionné a été créé pour cette interface.

source: Binary mode
fr: Mode binaire

source: From version 2.9 to 2.21, the glibc implementation of B<fmemopen>() supported a "binary" mode, enabled by specifying the letter \(aqb\(aq as the second character in I<mode>. In this mode, writes don't implicitly add a terminating null byte, and B<fseek>(3) B<SEEK_END> is relative to the end of the buffer (i.e., the value specified by the I<size> argument), rather than the current string length.
fr: Avec les versions 2.9 à 2.21, l'implémentation dans la glibc de B<fmemopen>() prenait en charge un mode «binaire» qui pouvait être activé en spécifiant la lettre \(aqb\(aq comme second caractère de I<mode>. Dans ce mode, les opérations d'écriture n'ajoutaient pas de manière implicite l'octet de valeur zéro terminal, et la valeur B<SEEK_END> du troisième argument de B<fseek>(3) définissait la position courante à la fin du tampon (autrement dit la valeur spécifiée par l'argument I<taille>), et non à la longueur de la chaîne courante.

source: An API bug afflicted the implementation of binary mode: to specify binary mode, the \(aqb\(aq must be the I<second> character in I<mode>. Thus, for example, "wb+" has the desired effect, but "w+b" does not. This is inconsistent with the treatment of I<mode> by B<fopen>(3).
fr: Un bogue de l'API affectait l'implémentation du mode binaire : pour indiquer le mode binaire, le « b » doit être le I<second> caractère de I<mode>. Ainsi, par exemple, « wb+ » a le comportement attendu, mais pas « w+b ». Ce n'était pas cohérent avec le traitement de I<mode> par B<fopen>(3).

source: Binary mode was removed in glibc 2.22; a \(aqb\(aq specified in I<mode> has no effect.
fr: Le mode binaire a été supprimé à partir de la version 2.22 de la glibc et un \(aqb\(aq spécifié dans I<mode> n'a dorénavant aucun effet.

source: BUGS
fr: BOGUES

source: In versions of glibc before 2.22, if I<size> is specified as zero, B<fmemopen>() fails with the error B<EINVAL>. It would be more consistent if this case successfully created a stream that then returned end-of-file on the first attempt at reading; since version 2.22, the glibc implementation provides that behavior.
fr: Avec les versions de la glibc antérieures à 2.22, si I<taille> est égale à zéro, B<fmemopen>() échoue avec l'erreur B<EINVAL>. Il est plus cohérent dans ce cas de créer un flux renvoyant la fin de fichier au premier essai de lecture, et c'est ce que fait l'implémentation de la glibc depuis la version 2.22.

source: In versions of glibc before 2.22, specifying append mode ("a" or "a+") for B<fmemopen>() sets the initial buffer position to the first null byte, but (if the current position is reset to a location other than the end of the stream) does not force subsequent writes to append at the end of the stream. This bug is fixed in glibc 2.22.
fr: Avec les versions de la glibc antérieures à 2.22, indiquer un mode d'ajout (« a » ou « a+ ») pour B<fmemopen>() définit la position initiale du fichier au premier octet de valeur zéro, mais ne force pas l'ajout des écritures suivantes à la fin du flux si la position actuelle dans le fichier est réinitialisée à un autre endroit que la fin du flux. Ce bogue a été corrigé avec la version 2.22 de la glibc.

source: In versions of glibc before 2.22, if the I<mode> argument to B<fmemopen>() specifies append ("a" or "a+"), and the I<size> argument does not cover a null byte in I<buf>, then, according to POSIX.1-2008, the initial buffer position should be set to the next byte after the end of the buffer. However, in this case the glibc B<fmemopen>() sets the buffer position to -1. This bug is fixed in glibc 2.22.
fr: Avec les versions de la glibc antérieures à 2.22, si l'argument I<mode> de B<fmemopen>() indiquait un ajout (« a » ou « a+ »), et si l'argument I<taille> ne couvrait pas d'octet de valeur zéro dans I<tampon>, alors, d'après POSIX.1-2008, la position initiale du fichier devait être définie à l'octet qui suit la fin du tampon. Dans ce cas cependant, l'implémentation de B<fmemopen>() de la glibc définissait la position du fichier à B<-1>. Ce bogue a été corrigé avec la version 2.22 de la glibc.

source: In versions of glibc before 2.22, when a call to B<fseek>(3) with a I<whence> value of B<SEEK_END> was performed on a stream created by B<fmemopen>(), the I<offset> was I<subtracted> from the end-of-stream position, instead of being added. This bug is fixed in glibc 2.22.
fr: Dans les versions de la glibc antérieures à 2.22, lorsqu'un appel à B<fseek>(3) avec une valeur de I<départ> égale à B<SEEK_END> était effectué sur un flux créé à l'aide de B<fmemopen>(), le I<décalage> était I<soustrait> à la position de fin de flux au lieu d'y être ajouté. Ce bogue a été corrigé à partir de la version 2.22 de la glibc.

source: The glibc 2.9 addition of "binary" mode for B<fmemopen>() silently changed the ABI: previously, B<fmemopen>() ignored \(aqb\(aq in I<mode>.
fr: L'ajout du mode « binaire » dans la glibc 2.9 pour B<fmemopen>() a modifié silencieusement l'ABI : auparavant, B<fmemopen>() ignorait « b » dans I<mode>.

source: EXAMPLES
fr: EXEMPLES

source: The program below uses B<fmemopen>() to open an input buffer, and B<open_memstream>(3) to open a dynamically sized output buffer. The program scans its input string (taken from the program's first command-line argument) reading integers, and writes the squares of these integers to the output buffer. An example of the output produced by this program is the following:
fr: Le programme ci-dessous utilise B<fmemopen>() pour ouvrir un tampon d'entrée et B<open_memstream>(3) pour ouvrir un tampon de sortie de taille dynamique. Ce programme scrute la chaîne en entrée (récupérée du premier argument de la ligne de commande du programme) sous forme d'entiers, et écrit le carré de ces entiers dans le tampon de sortie. Voici un exemple de la sortie produite par ce programme\ :

source: $B< ./a.out \(aq1 23 43\(aq> size=11; ptr=1 529 1849
fr: $B< ./a.out \(aq1 23 43\(aq> taille=11; ptr=1 529 1849

source: Program source
fr: Source du programme

source: int main(int argc, char *argv[]) { FILE *out, *in; int v, s; size_t size; char *ptr;
fr: int main(int argc, char *argv[]) { FILE *out, *in; int v, s; size_t taille; char *ptr;

source: if (argc != 2) { fprintf(stderr, "Usage: %s \(aqE<lt>numE<gt>...\(aq\en", argv[0]); exit(EXIT_FAILURE); }
fr: if (argc != 2) { fprintf(stderr, "Utilisation : %s \(aqE<lt>nombreE<gt>...\(aq\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("size=%zu; ptr=%s\en", size, ptr);
fr: printf("taille=%zu; ptr=%s\en", taille, ptr);

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Since glibc 2.10:
fr: Depuis la glibc 2.10 :

source: Before glibc 2.10:
fr: Avant la glibc 2.10 :

source: If I<buf> is not NULL, then it should point to a buffer of at least I<len> bytes allocated by the caller.
fr: Si I<tampon> est différent de NULL, il doit pointer vers un tampon d'une taille minimale de I<taille> octets alloués par l'appelant.

source: setbuf(stream, NULL);
fr: setbuf(flux, NULL);

source: CONFORMING TO
fr: CONFORMITÉ

source: out = open_memstream(&ptr, &size); if (out == NULL) handle_error("open_memstream");
fr: out = open_memstream(&ptr, &taille); if (out == NULL) handle_error("open_memstream");

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: EXAMPLE
fr: EXEMPLE

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
