Repository: sebras/manpages-l10n
Catalog: po/*/man3/fpathconf.3.po
Languages: pl

source: NAME
pl: NAZWA

source: fpathconf, pathconf - get configuration values for files
pl: fpathconf, pathconf - pobranie konfiguracji dla plików

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: B<fpathconf>() gets a value for the configuration option I<name> for the open file descriptor I<fd>.
pl: Funkcja B<fpathconf>() pobiera wartość opcji konfiguracyjnej I<name> dla otwartego deskryptora pliku I<fd>.

source: B<pathconf>() gets a value for configuration option I<name> for the filename I<path>.
pl: Funkcja B<pathconf>() pobiera wartość opcji konfiguracyjnej I<name> dla pliku o nazwie I<path>.

source: The corresponding macros defined in I<E<lt>unistd.hE<gt>> are minimum values; if an application wants to take advantage of values which may change, a call to B<fpathconf>() or B<pathconf>() can be made, which may yield more liberal results.
pl: Odpowiednie makra zdefiniowane w I<E<lt>unistd.hE<gt>> są wartościami minimalnymi. Jeśli aplikacja chce korzystać z wartości, które mogą się zmieniać, to może wywołać B<fpathconf>() lub B<pathconf>(), które zwracają bardziej liberalne wyniki.

source: Setting I<name> equal to one of the following constants returns the following configuration options:
pl: Przekazanie w argumencie I<name> jednej z poniższych wartości zwraca następujące opcje konfiguracji:

source: The maximum number of links to the file. If I<fd> or I<path> refer to a directory, then the value applies to the whole directory. The corresponding macro is B<_POSIX_LINK_MAX>.
pl: Maksymalna liczba dowiązań do pliku. Jeśli I<fd> lub I<path> odnoszą się do katalogu, to wartość dotyczy całego katalogu. Odpowiadające temu makro to B<_POSIX_LINK_MAX>.

source: The maximum length of a formatted input line, where I<fd> or I<path> must refer to a terminal. The corresponding macro is B<_POSIX_MAX_CANON>.
pl: Maksymalna długość sformatowanej linii wejściowej, przy czym I<fd> lub I<path> musi odnosić się do terminala. Odpowiadające temu makro to B<_POSIX_MAX_CANON>.

source: The maximum length of an input line, where I<fd> or I<path> must refer to a terminal. The corresponding macro is B<_POSIX_MAX_INPUT>.
pl: Maksymalna długość linii wejściowej, przy czym I<fd> lub I<path> musi odnosić się do terminala. Odpowiadające temu makro to B<_POSIX_MAX_INPUT>.

source: The maximum length of a filename in the directory I<path> or I<fd> that the process is allowed to create. The corresponding macro is B<_POSIX_NAME_MAX>.
pl: Maksymalna długość nazwy pliku w katalogu I<path> lub I<fd>, jaką proces może utworzyć. Odpowiadające temu makro to B<_POSIX_NAME_MAX>.

source: The maximum length of a relative pathname when I<path> or I<fd> is the current working directory. The corresponding macro is B<_POSIX_PATH_MAX>.
pl: Maksymalna długość względnej ścieżki, gdy I<path> lub I<fd> jest katalogiem bieżącym. Odpowiadające temu makro to B<_POSIX_PATH_MAX>.

source: The maximum number of bytes that can be written atomically to a pipe of FIFO. For B<fpathconf>(), I<fd> should refer to a pipe or FIFO. For B<fpathconf>(), I<path> should refer to a FIFO or a directory; in the latter case, the returned value corresponds to FIFOs created in that directory. The corresponding macro is B<_POSIX_PIPE_BUF>.
pl: Maksymalna liczba bajtów, które można niepodzielnie (atomicznie) zapisać do potoku lub kolejki FIFO. W przypadku B<fpathconf>() argument I<fd> powinien odnosić się do potoku lub kolejki FIFO. Dla B<fpathconf>(), argument I<path> powinien odnosić się do kolejki FIFO lub katalogu; w tym drugim przypadku wartość zwracana jest odpowiednia dla kolejek FIFO tworzonych w tym katalogu. Odpowiadające temu makro to B<_POSIX_PIPE_BUF>.

source: This returns a positive value if the use of B<chown>(2) and B<fchown>(2) for changing a file's user ID is restricted to a process with appropriate privileges, and changing a file's group ID to a value other than the process's effective group ID or one of its supplementary group IDs is restricted to a process with appropriate privileges. According to POSIX.1, this variable shall always be defined with a value other than -1. The corresponding macro is B<_POSIX_CHOWN_RESTRICTED>.
pl: Zwraca wartość dodatnią, jeśli użycie B<chown>(2) i B<fchown>(2), w celu zmiany identyfikatora właściciela pliku albo w celu zmienienia identyfikatora grupy pliku na wartość inną niż efektywny identyfikator grupy procesu lub jeden z dodatkowych identyfikatorów grup, jest ograniczone do procesu mającego odpowiednie uprawnienia. Zgodnie z POSIX.1 wartość ta powinna zawsze być różna od -1. Odpowiadające temu makro to B<_POSIX_CHOWN_RESTRICTED>.

source: If I<fd> or I<path> refers to a directory, then the return value applies to all files in that directory.
pl: Jeśli I<fd> lub I<path> odnoszą się do katalogu, to wartość zwracana dotyczy to wszystkich plików w tym katalogu.

source: This returns nonzero if accessing filenames longer than B<_POSIX_NAME_MAX> generates an error. The corresponding macro is B<_POSIX_NO_TRUNC>.
pl: Zwraca wartość niezerową, jeśli dostęp do plików o nazwach dłuższych od B<_POSIX_NAME_MAX> powoduje błąd. Odpowiadające temu makro to B<_POSIX_NO_TRUNC>.

source: This returns nonzero if special character processing can be disabled, where I<fd> or I<path> must refer to a terminal.
pl: Zwraca wartość niezerową, jeśli przetwarzanie znaków specjalnych może być wyłączone, przy czym I<fd> lub I<path> muszą odnosić się do terminala.

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: The return value of these functions is one of the following:
pl: Funkcje te zwracają jedną z następujących wartości:

source: If I<name> corresponds to a maximum or minimum limit, and that limit is indeterminate, -1 is returned and I<errno> is not changed. (To distinguish an indeterminate limit from an error, set I<errno> to zero before the call, and then check whether I<errno> is nonzero when -1 is returned.)
pl: Jeśli I<name> odpowiada jakiemuś ograniczeniu typu maksimum lub minimum, ale nie można określić wartości tego ograniczenia, to zwracane jest -1 bez zmieniana wartości I<errno>. (W celu odróżnienia nieokreślalnego ograniczenia od innego błędu, należy ustawić I<errno> na zero przed wywołaniem tej funcji, i następnie sprawdzić, czy I<errno> jest niezerowe, jeśli funkcja zwróci wartość -1).

source: If I<name> corresponds to an option, a positive value is returned if the option is supported, and -1 is returned if the option is not supported.
pl: Jeśli I<name> odpowiada jakiejś nazwie opcji, to zwracana jest wartość dodatnia, gdy ta opcja jest wspierana, w przeciwnym wypadku zwracane jest -1.

source: Otherwise, the current value of the option or limit is returned. This value will not be more restrictive than the corresponding value that was described to the application in I<E<lt>unistd.hE<gt>> or I<E<lt>limits.hE<gt>> when the application was compiled.
pl: W przeciwnym wypadku zwracana jest bieżąca wartość opcji lub ograniczenia. Wartość ta nie będzie bardziej restrykcyjna niż odpowiednia wartość dostępna w pliku I<E<lt>unistd.hE<gt>> lub I<E<lt>limits.hE<gt>> w czasie kompilowania aplikacji.

source: ERRORS
pl: BŁĘDY

source: (B<pathconf>()) Search permission is denied for one of the directories in the path prefix of I<path>.
pl: (B<pathconf>()) Brak uprawnień do przeszukiwania jednego z katalogów w ścieżce zaczynającej I<path>.

source: (B<fpathconf>()) I<fd> is not a valid file descriptor.
pl: (B<fpathconf>()) I<fd> nie jest prawidłowym deskryptorem pliku.

source: I<name> is invalid.
pl: I<name> jest niepoprawne.

source: The implementation does not support an association of I<name> with the specified file.
pl: Ta implementacja nie wspiera skojarzenia I<name> z podanym plikiem.

source: (B<pathconf>()) Too many symbolic links were encountered while resolving I<path>.
pl: (B<pathconf>()) Podczas rozwiązywania I<path> napotkano zbyt wiele dowiązań symbolicznych.

source: (B<pathconf>()) I<path> is too long.
pl: (B<pathconf>()) I<path> jest za długa.

source: (B<pathconf>()) A component of I<path> does not exist, or I<path> is an empty string.
pl: (B<pathconf>()) Składnik ścieżki I<path> nie istnieje lub I<path> jest pustym łańcuchem znaków.

source: (B<pathconf>()) A component used as a directory in I<path> is not in fact a directory.
pl: (B<pathconf>()) Jeden ze składników ścieżki I<path> nie jest katalogiem.

source: ATTRIBUTES
pl: ATRYBUTY

source: For an explanation of the terms used in this section, see B<attributes>(7).
pl: Informacje o pojęciach używanych w tym rozdziale można znaleźć w podręczniku B<attributes>(7).

source: Interface
pl: Interfejs

source: Attribute
pl: Atrybut

source: Value
pl: Wartość

source: Thread safety
pl: Bezpieczeństwo wątkowe

source: STANDARDS
pl: STANDARDY

source: NOTES
pl: UWAGI

source: Files with name lengths longer than the value returned for I<name> equal to B<_PC_NAME_MAX> may exist in the given directory.
pl: W danym katalogu mogą istnieć pliki o nazwach dłuższych niż wartość zwrócona dla I<name> równego B<_PC_NAME_MAX>.

source: Some returned values may be huge; they are not suitable for allocating memory.
pl: Niektóre ze zwracanych wartości mogą być olbrzymie, więc nie nadają się do alokowania pamięci.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: On error, -1 is returned and I<errno> is set to indicate the cause of the error (for example, B<EINVAL>, indicating that I<name> is invalid).
pl: W razie wystąpienia błędu zwracane jest -1 i ustawiana jest odpowiednia wartość zmiennej I<errno> (na przykład na B<EINVAL> wskazujące, że I<name> jest niepoprawna).

source: CONFORMING TO
pl: ZGODNE Z

source: COLOPHON
pl: O STRONIE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
