Repository: sebras/manpages-l10n
Catalog: po/*/man3/getentropy.3.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: getentropy - fill a buffer with random bytes
fr: getentropy - Remplir un tampon avec des octets aléatoires

source: B<int getentropy(void *>I<buffer>B<, size_t >I<length>B<);>
fr: B<int getentropy(void *>I<tampon>B<, size_t >I<longueur>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: The B<getentropy>() function writes I<length> bytes of high-quality random data to the buffer starting at the location pointed to by I<buffer>. The maximum permitted value for the I<length> argument is 256.
fr: La fonction B<getentropy>() écrit I<longueur> octets de données à caractère aléatoire de haute qualité dans le tampon débutant à la position mémoire pointée par I<tampon>. L'argument I<longueur> ne doit pas dépasser 256.

source: A successful call to B<getentropy>() always provides the requested number of bytes of entropy.
fr: En cas de succès, B<getentropy>() génère toujours le nombre d'octets d'entropie demandé.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, this function returns zero. On error, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas de succès, cette fonction renvoie zéro. En cas d'erreur, elle renvoie B<-1> et I<errno> est définie de façon à indiquer la nature de l'erreur.

source: ERRORS
fr: ERREURS

source: Part or all of the buffer specified by I<buffer> and I<length> is not in valid addressable memory.
fr: Tout ou partie du tampon spécifié par I<tampon> et I<longueur> n'est pas dans une zone de mémoire adressable valable.

source: I<length> is greater than 256.
fr: I<longueur> est supérieure à 256.

source: An unspecified error occurred while trying to overwrite I<buffer> with random data.
fr: Une erreur inconnue est survenue en tentant d'écraser I<tampon> avec des données aléatoires.

source: This kernel version does not implement the B<getrandom>(2) system call required to implement this function.
fr: Cette version du noyau ne prend pas en charge l'appel système B<getrandom>(2) nécessaire à l'implémentation de cette fonction.

source: The B<getentropy>() function first appeared in glibc 2.25.
fr: La fonction B<getentropy>() a été introduite dans la version 2.25 de la glibc.

source: CONFORMING TO
fr: CONFORMITÉ

source: This function is nonstandard. It is also present on OpenBSD.
fr: Cette fonction n'est pas normalisée. Elle est aussi présente dans OpenBSD.

source: The B<getentropy>() function is implemented using B<getrandom>(2).
fr: La fonction B<getentropy>() est implémentée en utilisant B<getrandom>(2).

source: Whereas the glibc wrapper makes B<getrandom>(2) a cancellation point, B<getentropy>() is not a cancellation point.
fr: Alors que l'interface de la glibc fait de B<getrandom>(2) un point d'annulation (cancellation point), B<getentropy>() n'en est pas un.

source: B<getentropy>() is also declared in B<E<lt>sys/random.hE<gt>>. (No feature test macro need be defined to obtain the declaration from that header file.)
fr: B<getentropy>() est aussi déclarée dans B<E<lt>sys/random.hE<gt>> (il n'est pas nécessaire de définir une macro de test de fonctionnalité pour obtenir la déclaration à partir de ce fichier d'en-têtes).

source: A call to B<getentropy>() may block if the system has just booted and the kernel has not yet collected enough randomness to initialize the entropy pool. In this case, B<getentropy>() will keep blocking even if a signal is handled, and will return only once the entropy pool has been initialized.
fr: Un appel à B<getentropy>() peut se bloquer si le système vient juste de démarrer et si le noyau n'a pas encore collecté assez de données aléatoires pour initialiser la réserve d'entropie. Dans ce cas, B<getentropy>() restera bloqué même si un signal est envoyé, et ne rendra la main que lorsque le jeu d'entropie aura été initialisé.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<int getentropy(void *>I<buffer>B<, size_t >I<length>B<);>
fr: B<int getentropy(void *>I<tampon>B<, size_t >I<longueur>B<);>

source: On success, this function returns zero. On error, -1 is returned, and I<errno> is set appropriately.
fr: En cas de succès, cette fonction renvoie zéro. En cas d'erreur, elle renvoie B<-1> et I<errno> est définie de façon à indiquer la nature de l'erreur.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
