Repository: sebras/manpages-l10n
Catalog: po/*/man3/resolver.3.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: res_ninit, res_nclose, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - resolver routines
fr: res_ninit, res_nclose, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - Routines de résolution de noms

source: B<int res_nquery(res_state >I<statep>B<,> B< const char *>I<dname>B<, int >I<class>B<, int >I<type>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_nquery(res_state >I<statep>B<,> B< const char *>I<nom_dom>B<, int >I<classe>B<, int >I<type>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: B<int res_nsearch(res_state >I<statep>B<,> B< const char *>I<dname>B<, int >I<class>B<, int >I<type>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_nsearch(res_state >I<statep>B<,> B< const char *>I<nom_dom>B<, int >I<classe>B<, int >I<type>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: B<int res_nquerydomain(res_state >I<statep>B<,> B< const char *>I<name>B<, const char *>I<domain>B<,> B< int >I<class>B<, int >I<type>B<, unsigned char *>I<answer>B<,> B< int >I<anslen>B<);>
fr: B<int res_nquerydomain(res_state >I<statep>B<,> B< const char *>I<nom>B<, const char *>I<domaine>B<,> B< int >I<classe>B<, int >I<type>B<, unsigned char *>I<réponse>B<,> B< int >I<long_réponse>B<);>

source: B<int res_nmkquery(res_state >I<statep>B<,> B< int >I<op>B<, const char *>I<dname>B<, int >I<class>B<,> B< int >I<type>B<, const unsigned char *>I<data>B<, int >I<datalen>B<,> B< const unsigned char *>I<newrr>B<,> B< unsigned char *>I<buf>B<, int >I<buflen>B<);>
fr: B<int res_nmkquery(res_state >I<statep>B<,> B< int >I<op>B<, const char *>I<nom_dom>B<, int >I<classe>B<,> B< int >I<type>B<, const unsigned char *>I<données>B<, int >I<long_données>B<,> B< const unsigned char *>I<newrr>B<,> B< unsigned char *>I<tampon>B<, int >I<long_tampon>B<);>

source: B<int res_nsend(res_state >I<statep>B<,> B< const unsigned char *>I<msg>B<, int >I<msglen>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_nsend(res_state >I<statep>B<,> B< const unsigned char *>I<msg>B<, int >I<long_msg>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: B<int dn_comp(const char *>I<exp_dn>B<, unsigned char *>I<comp_dn>B<,> B< int >I<length>B<, unsigned char **>I<dnptrs>B<,> B< unsigned char **>I<lastdnptr>B<);>
fr: B<int dn_comp(const char *>I<dom_exp>B<, unsigned char *>I<dom_comp>B<,> B< int >I<longueur>B<, unsigned char **>I<dnptrs>B<,> B< unsigned char **>I<lastdnptr>B<);>

source: B<int dn_expand(const unsigned char *>I<msg>B<,> B< const unsigned char *>I<eomorig>B<,> B< const unsigned char *>I<comp_dn>B<, char *>I<exp_dn>B<,> B< int >I<length>B<);>
fr: B<int dn_expand(const unsigned char *>I<msg>B<,> B< const unsigned char *>I<eomorig>B<,> B< const unsigned char *>I<dom_comp>B<, char *>I<dom_exp>B<,> B< int >I<longueur>B<);>

source: Deprecated
fr: Obsolète

source: B<int res_query(const char *>I<dname>B<, int >I<class>B<, int >I<type>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_query(const char *>I<nom_dom>B<, int >I<classe>B<, int >I<type>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: B<int res_search(const char *>I<dname>B<, int >I<class>B<, int >I<type>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_search(const char *>I<nom_dom>B<, int >I<classe>B<, int >I<type>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: B<int res_querydomain(const char *>I<name>B<, const char *>I<domain>B<,> B< int >I<class>B<, int >I<type>B<, unsigned char *>I<answer>B<,> B< int >I<anslen>B<);>
fr: B<int res_querydomain(const char *>I<nom>B<, const char *>I<domaine>B<,> B< int >I<classe>B<, int >I<type>B<, unsigned char *>I<réponse>B<,> B< int >I<long_réponse>B<);>

source: B<int res_mkquery(int >I<op>B<, const char *>I<dname>B<, int >I<class>B<,> B< int >I<type>B<, const unsigned char *>I<data>B<, int >I<datalen>B<,> B< const unsigned char *>I<newrr>B<,> B< unsigned char *>I<buf>B<, int >I<buflen>B<);>
fr: B<int res_mkquery(int >I<op>B<, const char *>I<nom_dom>B<, int >I<classe>B<,> B< int >I<type>B<, const unsigned char *>I<données>B<, int >I<long_données>B<,> B< const unsigned char *>I<newrr>B<,> B< unsigned char *>I<tampon>B<, int >I<long_tampon>B<);>

source: B<int res_send(const unsigned char *>I<msg>B<, int >I<msglen>B<,> B< unsigned char *>I<answer>B<, int >I<anslen>B<);>
fr: B<int res_send(const unsigned char *>I<msg>B<, int >I<long_msg>B<,> B< unsigned char *>I<réponse>B<, int >I<long_réponse>B<);>

source: Link with I<-lresolv>.
fr: Effectuez l'édition des liens avec l'option I<-lresolv>.

source: B<Note:> This page is incomplete (various resolver functions provided by glibc are not described) and likely out of date.
fr: B<Note :> Cette page est incomplète (diverses fonctions resolver fournies par la glibc n'y sont pas décrites) et probablement plus d'actualité.

source: The functions described below make queries to and interpret the responses from Internet domain name servers.
fr: Les fonctions ci-dessous interrogent et interprètent les réponses de serveurs de noms Internet.

source: The API consists of a set of more modern, reentrant functions and an older set of nonreentrant functions that have been superseded. The traditional resolver interfaces such as B<res_init>() and B<res_query>() use some static (global) state stored in the I<_res> structure, rendering these functions non-thread-safe. BIND 8.2 introduced a set of new interfaces B<res_ninit>(), B<res_nquery>(), and so on, which take a I<res_state> as their first argument, so you can use a per-thread resolver state.
fr: L'API consiste en un jeu de fonctions réentrantes plus moderne et d'un ancien jeu de fonctions non réentrantes qui ont été supplantées. Les interfaces traditionnelles de resolver telles que B<res_init>() et B<res_query> utilisent des états statiques (globaux) stockés dans la structure B<_res>, rendant ces fonctions « non-thread-safe ». BIND 8.2 introduit un ensemble de nouvelles interfaces B<res_ninit>(), B<res_nquery>, et ainsi de suite, qui prennent un I<res_state> comme premier argument, afin de pouvoir utiliser un état de résolution par thread.

source: The B<res_ninit>() and B<res_init>() functions read the configuration files (see B<resolv.conf>(5)) to get the default domain name and name server address(es). If no server is given, the local host is tried. If no domain is given, that associated with the local host is used. It can be overridden with the environment variable B<LOCALDOMAIN>. B<res_ninit>() or B<res_init>() is normally executed by the first call to one of the other functions. Every call to B<res_ninit>() requires a corresponding call to B<res_nclose>() to free memory allocated by B<res_ninit>() and subsequent calls to B<res_nquery>().
fr: Les fonctions B<res_init>() et B<res_init> lisent les fichiers de configuration (consultez B<resolv.conf>(5)) pour obtenir le nom de domaine par défaut et l'adresse du ou des serveurs de noms. Si aucun serveur n'est donné, l'hôte local est essayé. Si aucun domaine n'est donné, celui associé à l'hôte local est utilisé. Cela peut être surchargé par la variable d'environnement B<LOCALDOMAIN>. B<res_init>() ou B<res_ninit> est normalement exécutée lors du premier appel à l'une des autres fonctions. Tout appel à B<res_ninit>() nécessite un appel correspondant à B<res_nclose> pour libérer la mémoire allouée à B<res_ninit>() et les appels suivants à B<res_nquery>().

source: The B<res_nquery>() and B<res_query>() functions query the name server for the fully qualified domain name I<name> of specified I<type> and I<class>. The reply is left in the buffer I<answer> of length I<anslen> supplied by the caller.
fr: Les fonctions B<res_nquery>() et B<res_query>() interrogent le serveur de noms pour le nom de domaine pleinement qualifié I<nom> du I<type> indiqué, et de la I<classe> donnée. La réponse est placée dans le tampon I<réponse> de longueur I<long_réponse> qui doit être fourni par l'appelant.

source: The B<res_nsearch>() and B<res_search>() functions make a query and waits for the response like B<res_nquery>() and B<res_query>(), but in addition they implement the default and search rules controlled by B<RES_DEFNAMES> and B<RES_DNSRCH> (see description of I<_res> options below).
fr: Les fonctions B<res_nsearch>() et B<res_search>() interrogent un serveur et attendent la réponse, comme B<res_nquery>() et B<res_query>(), mais implémentent en plus les règles de recherche et de valeurs par défaut contrôlées par B<RES_DEFNAMES> et B<RES_DNSRCH> (voir les options de I<_res> plus bas).

source: The B<res_nquerydomain>() and B<res_querydomain>() functions make a query using B<res_nquery>()/B<res_query>() on the concatenation of I<name> and I<domain>.
fr: La fonction B<res_querydomain>() ou B<res_nquerydomain> interroge le serveur en appelant B<res_nquery>() ou B<res_query>() avec la concaténation de I<nom> et I<domaine>.

source: The following functions are lower-level routines used by B<res_nquery>()/B<res_query>().
fr: Les fonctions suivantes sont des routines bas niveau utilisées par B<res_nquery>() et B<res_query>().

source: The B<res_nmkquery>() and B<res_mkquery>() functions construct a query message in I<buf> of length I<buflen> for the domain name I<dname>. The query type I<op> is one of the following (typically B<QUERY>):
fr: Les fonctions B<res_mkquery>() et B<res_nmkquery> construisent une requête dans I<tampon> de longueur I<long_tampon> concernant le nom de domaine I<nom_dom>. Le type I<op> de requête est l'un des suivants (généralement B<QUERY>) :

source: Standard query.
fr: Requête standard.

source: Inverse query. This option was removed in glibc 2.26, since it has not been supported by DNS servers for a very long time.
fr: Requête inverse. Cette option a été supprimée dans la glibc 2.26, car elle n'est plus prise en charge par les serveurs DNS depuis très longtemps.

source: Notify secondary of SOA (Start of Authority) change.
fr: Notifier au secondaire le changement de SOA (Start of Authority).

source: I<newrr> is currently unused.
fr: I<newrr> est actuellement inutilisé.

source: The B<res_nsend>() and B<res_send>() function send a preformatted query given in I<msg> of length I<msglen> and returns the answer in I<answer> which is of length I<anslen>. They will call B<res_ninit>()/B<res_init>() if it has not already been called.
fr: Les fonctions B<res_nsend>() et B<res_send>() envoient une requête préformatée, située dans I<msg> de longueur I<long_msg> et renvoient la réponse dans I<réponse> qui est de longueur I<long_réponse>. Elles appellent B<res_ninit>() ou B<res_init>(), si ça n'a pas encore été fait.

source: The B<dn_comp>() function compresses the domain name I<exp_dn> and stores it in the buffer I<comp_dn> of length I<length>. The compression uses an array of pointers I<dnptrs> to previously compressed names in the current message. The first pointer points to the beginning of the message and the list ends with NULL. The limit of the array is specified by I<lastdnptr>. If I<dnptr> is NULL, domain names are not compressed. If I<lastdnptr> is NULL, the list of labels is not updated.
fr: La fonction B<dn_comp>() compresse le nom de domaine I<dom_exp> et le stocke dans le tampon I<dom_comp> de longueur I<taille>. La compression utilise une table de pointeurs I<dnptrs> vers les noms précédemment compressés du message en cours. Le premier pointeur vise le début du message, et la table se termine par NULL. La limite de la table est indiquée par I<lastdnptr>. Si I<dnptr> est NULL, les noms de domaines ne sont pas compressés. Si I<lastdnptr> est NULL, la liste d'étiquettes n'est pas mise à jour.

source: The B<dn_expand>() function expands the compressed domain name I<comp_dn> to a full domain name, which is placed in the buffer I<exp_dn> of size I<length>. The compressed name is contained in a query or reply message, and I<msg> points to the beginning of the message.
fr: La fonction B<dn_expand>() développe le nom de domaine compressé I<dom_comp> en un nom de domaine complet qui est ensuite placé dans le tampon I<dom_exp> de taille I<taille>. Le nom compressé est contenu dans une requête ou dans un message de réponse, et I<msg> pointe sur le début du message.

source: The resolver routines use configuration and state information contained in a I<__res_state> structure (either passed as the I<statep> argument, or in the global variable I<_res>, in the case of the older nonreentrant functions). The only field of this structure that is normally manipulated by the user is the I<options> field. This field can contain the bitwise "OR" of the following options:
fr: Les routines de résolution de noms utilisent une configuration globale et des informations d'état contenues dans la structure I<_res_state> (soit transmis en tant qu'argument I<statep>, soit dans la variable globale I<_res>, dans le cas des anciennes fonctions non réentrantes). Le seul champ de cette structure habituellement manipulé par l'utilisateur est le champ I<options>. Il contient un I<OU binaire> entre les options suivantes\ :

source: True if B<res_ninit>() or B<res_init>() has been called.
fr: Vrai si B<res_init>() ou B<res_ninit>() a été appelée.

source: Print debugging messages. This option is available only if glibc was built with debugging enabled, which is not the default.
fr: Afficher les messages de débogage. Cette option n'est disponible que si le débogage a été activé lors de la construction la gblic, ce qui n'est pas le cas par défaut.

source: B<RES_AAONLY> (unimplemented; deprecated in glibc 2.25)
fr: B<RES_AAONLY> (non implémenté ; obsolète depuis la glibc 2.25)

source: Accept authoritative answers only. B<res_send>() continues until it finds an authoritative answer or returns an error. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
fr: N'accepter que les réponses des serveurs faisant autorité. B<res_send>() continue jusqu'à trouver un serveur faisant autorité ou renvoie une erreur. Cette option était présente, mais non implémentée, dans la glibc jusqu'à la version 2.24 ; elle est obsolète depuis la glibc 2.25 et provoque un avertissement si elle est utilisée.

source: Use TCP connections for queries rather than UDP datagrams.
fr: Utiliser des connexions TCP pour les interrogations plutôt que des datagrammes UDP.

source: B<RES_PRIMARY> (unimplemented; deprecated in glibc 2.25)
fr: B<RES_PRIMARY> (non implémenté ; obsolète depuis la glibc 2.25)

source: Query primary domain name server only. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
fr: Interroger uniquement le serveur primaire de noms de domaine. Cette option était présente, mais non implémentée, dans la glibc jusqu'à la version 2.24 ;mais elle est obsolète depuis la glibc 2.25 et son usage provoque un avertissement.

source: Ignore truncation errors. Don't retry with TCP.
fr: Ignorer les erreurs de troncature. Ne pas réessayer avec TCP.

source: Set the recursion desired bit in queries. Recursion is carried out by the domain name server, not by B<res_send>(). [Enabled by default].
fr: Définir le bit de récursion dans les requêtes. La récursion est prise en charge par le serveur de noms du domaine et non par B<res_send>() [activé par défaut].

source: If set, B<res_search>() will append the default domain name to single component names\(emthat is, those that do not contain a dot. [Enabled by default].
fr: B<res_search>() ajoutera le nom de domaine par défaut aux noms simples, c'est-à-dire ceux ne contenant pas de point [activé par défaut].

source: Used with B<RES_USEVC> to keep the TCP connection open between queries.
fr: Utilisée avec B<RES_USEVC> pour garder ouverte une connexion TCP entre des interrogations successives.

source: If set, B<res_search>() will search for hostnames in the current domain and in parent domains. This option is used by B<gethostbyname>(3). [Enabled by default].
fr: B<res_search>() recherchera les noms d'hôtes dans le domaine courant et dans les domaines parents. Cette option est utilisée par B<gethostbyname>(3) [activé par défaut].

source: Accept a response from a wrong server. This can be used to detect potential security hazards, but you need to compile glibc with debugging enabled and use B<RES_DEBUG> option (for debug purpose only).
fr: Accepter une réponse d'un mauvais serveur. Cela peut être utilisé pour détecter de potentiels risques de sécurité, mais vous devez compiler la glibc avec le débogage activé et utiliser l'option B<RES_DEBUG> (aux fins de débogage uniquement).

source: Accept a response which contains a wrong query. This can be used to detect potential security hazards, but you need to compile glibc with debugging enabled and use B<RES_DEBUG> option (for debug purpose only).
fr: Accepter les réponses contenant une mauvaise requête. Cela peut-être utilisé pour détecter des failles de sécurité, mais vous devez compiler glibc avec le débogage activé et utiliser l'option B<RES_DEBUG> (aux fins de débogage uniquement).

source: Disable usage of B<HOSTALIASES> environment variable.
fr: Désactiver l'utilisation de la variable d'environnement B<HOSTALIASES>.

source: Try an AAAA query before an A query inside the B<gethostbyname>(3) function, and map IPv4 responses in IPv6 "tunneled form" if no AAAA records are found but an A record set exists. Since glibc 2.25, this option is deprecated, and its usage produces a warning; applications should use B<getaddrinfo>(3), rather than B<gethostbyname>(3).
fr: Essayer une requête AAAA avant une requête A dans la fonction B<gethostbyname>(3) et mapper les réponses IPv4 dans la « forme tunnellisée » de IPv6 si aucun enregistrement AAAA n'est trouvé alors qu'un enregistrement A existe. Cette option est obsolète depuis la glibc 2.25 et son utilisation provoque un avertissement ; les applications doivent utiliser B<getaddrinfo>(3) à la place de B<gesthostbyname>(3).

source: Causes round-robin selection of name servers from among those listed. This has the effect of spreading the query load among all listed servers, rather than having all clients try the first listed server first every time.
fr: Provoque une sélection en tourniquet (« round-robin ») des serveurs de noms parmi ceux qui sont listés. Cela a pour effet de diffuser la requête vers tous les serveurs listés et d'éviter ainsi que les clients essaient chaque fois le premier serveur listé.

source: B<RES_NOCHECKNAME> (unimplemented; deprecated in glibc 2.25)
fr: B<RES_NOCHECKNAME> (non implémenté ; obsolète depuis la glibc 2.25)

source: Disable the modern BIND checking of incoming hostnames and mail names for invalid characters such as underscore (_), non-ASCII, or control characters. This option was present in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
fr: Désactiver la vérification BIND moderne des noms d'hôtes et de courriers entrants pour les caractères incorrects comme le caractère souligné «\ _\ », les caractères non ASCII ou les caractères de contrôle. Cette option était présente jusqu'à la glibc 2.24, mais est obsolète depuis la glibc 2.25 et son usage provoque un avertissement.

source: B<RES_KEEPTSIG> (unimplemented; deprecated in glibc 2.25)
fr: B<RES_KEEPTSIG> (non implémenté ; obsolète dans la glibc 2.25)

source: Do not strip TSIG records. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
fr: Ne pas défaire les enregistrements TSIG. Cette option était présente, mais non implémentée, dans la glibc jusqu'à la version 2.24 ; depuis glibc 2.25 cette option est obsolète et son utilisation provoque un avertissement.

source: B<RES_BLAST> (unimplemented; deprecated in glibc 2.25)
fr: B<RES_BLAST> (non implémenté ; obsolète depuis la glibc 2.25)

source: Send each query simultaneously and recursively to all servers. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
fr: Envoyer chaque requête simultanément et récursivement à tous les serveurs. Cette option était pésente, mais non implémentée, dans la glibc jusqu'à sa version 2.24 ; depuis la glibc 2.25 cette option est obsolète et son utilisation provoque un avertissement.

source: B<RES_USEBSTRING> (glibc 2.3.4 to 2.24)
fr: B<RES_USEBSTRING> (versions de la glibc 2.3.4 à 2.24)

source: Make reverse IPv6 lookups using the bit-label format described in RFC 2673; if this option is not set (which is the default), then nibble format is used. This option was removed in glibc 2.25, since it relied on a backward-incompatible DNS extension that was never deployed on the Internet.
fr: Effectuer des recherches inversées sur IPv6 en utilisant le format bit-label décrit dans la RFC 2673 ; si cette option n'est pas présente (ce qui est le cas par défaut), alors le format nibble est utilisé. Cette option a été supprimée dans la glibc 2.25, car elle faisait appel à une extension DNS non rétrocompatible qui n'était jamais employée sur l'internet.

source: B<RES_NOIP6DOTINT> (glibc 2.24 and earlier)
fr: B<RES_NOIP6DOTINT> (glibc 2.24 et précédentes)

source: Use I<ip6.arpa> zone in IPv6 reverse lookup instead of I<ip6.int>, which is deprecated since glibc 2.3.4. This option is present in glibc up to and including version 2.24, where it is enabled by default. In glibc 2.25, this option was removed.
fr: Utiliser la zone I<ip6.arpa> dans une recherche inversée IPv6 au lieu de I<ip6.int> qui est obsolète depuis la glibc 2.3.4. Cette option est présente dans la glibc jusqu'à la version 2.24 incluse, où elle est activée par défaut. Cette option a été supprimée dans la glibc version 2.25.

source: B<RES_USE_EDNS0> (since glibc 2.6)
fr: B<RES_USE_EDNS0> (depuis la glibc 2.6)

source: Enables support for the DNS extensions (EDNS0) described in RFC 2671.
fr: Active la prise en charge des extensions DNS (EDNS0) décrites dans la RFC 2671.

source: B<RES_SNGLKUP> (since glibc 2.10)
fr: B<RES_SNGLKUP> (depuis la glibc 2.10)

source: By default, glibc performs IPv4 and IPv6 lookups in parallel since version 2.9. Some appliance DNS servers cannot handle these queries properly and make the requests time out. This option disables the behavior and makes glibc perform the IPv6 and IPv4 requests sequentially (at the cost of some slowdown of the resolving process).
fr: Par défaut, la glibc réalise des résolutions IPv4 et IPv6 en parallèle depuis la version 2.9. Certains serveurs d'application DNS ne peuvent pas traiter correctement ces demandes et font expirer les requêtes. Cette option désactive ce comportement et force la glibc à réaliser les requêtes IPv4 et IPv6 de façon séquentielle (au prix d'un certain ralentissement du processus de résolution).

source: When B<RES_SNGLKUP> option is enabled, opens a new socket for the each request.
fr: Ouvre un nouveau socket à chaque requête quand l'option B<RES_SNGLKUP> est activée.

source: Use DNSSEC with OK bit in OPT record. This option implies B<RES_USE_EDNS0>.
fr: Utiliser DNSSEC avec un bit OK dans l'enregistrement OPT. Cette option implique B<RES_USE_ENDS0>.

source: Do not look up unqualified name as a top-level domain (TLD).
fr: Ne pas rechercher un nom non qualifié comme domaine de premier niveau (top-level domain (TLD)).
