Repository: sebras/manpages-l10n
Catalog: po/*/man3/resolver.3.po
Languages: fr

source: Default option which implies: B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH>, and B<RES_NOIP6DOTINT>.
fr: Option par défaut qui implique : B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH> et B<RES_NOIP6DOTINT>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: The B<res_ninit>() and B<res_init>() functions return 0 on success, or -1 if an error occurs.
fr: Les fonctions B<res_ninit>() et B<res_init>() renvoient B<0> si elles réussissent ou B<-1> si une erreur se produit.

source: The B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), B<res_querydomain>(), B<res_nmkquery>(), B<res_mkquery>(), B<res_nsend>(), and B<res_send>() functions return the length of the response, or -1 if an error occurs.
fr: Les fonctions B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), B<res_querydomain>(), B<res_nmkquery>(), B<res_mkquery>(), B<res_nsend>() et B<res_send>() renvoient la longueur de la réponse ou B<-1> si une erreur se produit.

source: The B<dn_comp>() and B<dn_expand>() functions return the length of the compressed name, or -1 if an error occurs.
fr: Les fonctions B<dn_comp>() et B<dn_expand>() renvoient la longueur du nom compressé ou B<-1> si une erreur se produit.

source: In the case of an error return from B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), or B<res_querydomain>(), the global variable I<h_errno> (see B<gethostbyname>(3)) can be consulted to determine the cause of the error.
fr: Dans le cas d'une erreur renvoyée par B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>() ou B<res_querydomain>(), la variable globale I<h_erno> (voir B<gethostbyname>(3)) peut être consultée pour déterminer la cause de l'erreur.

source: FILES
fr: FICHIERS

source: resolver configuration file
fr: Fichier de configuration de resolver (résolution de noms)

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: CONFORMING TO
fr: CONFORMITÉ

source: SEE ALSO
fr: VOIR AUSSI

source: The GNU C library source file I<resolv/README>.
fr: Le fichier source I<resolv/README> de la bibliothèque GNU C.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: res_ninit, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - resolver routines
fr: res_ninit, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - Routines de résolution de noms

source: The B<res_ninit>() and B<res_init>() functions read the configuration files (see B<resolv.conf>(5)) to get the default domain name and name server address(es). If no server is given, the local host is tried. If no domain is given, that associated with the local host is used. It can be overridden with the environment variable B<LOCALDOMAIN>. B<res_ninit>() or B<res_init>() is normally executed by the first call to one of the other functions.
fr: Les fonctions B<res_init>() et B<res_ninit>() lisent les fichiers de configuration (consultez B<resolv.conf>(5)) pour obtenir le nom de domaine par défaut et l'adresse du ou des serveurs de noms. Si aucun serveur n'est donné, l'hôte local est essayé. Si aucun domaine n'est donné, celui associé à l'hôte local est utilisé. Cela peut être surchargé par la variable d'environnement B<LOCALDOMAIN>. B<res_init>() ou B<res_ninit>() est normalement exécutée lors du premier appel à l'une des autres fonctions.

source: The following functions are lower-level routines used by B<res_query>()/B<res_query>().
fr: Les fonctions suivantes sont des routines bas niveau utilisées par B<res_query>() et B<res_nquery>().

source: B<RES_BLAST (unimplemented; deprecated in glibc 2.25)>
fr: B<REST_BLAST> (non implémenté ; B<obsolète depuis la glibc 2.25>)

source: Default option which implies: B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH> and B<RES_NOIP6DOTINT>.
fr: Option par défaut qui implique : B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH> et B<RES_NOIP6DOTINT>.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
