Repository: sebras/manpages-l10n
Catalog: po/*/man3/setjmp.3.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: setjmp, sigsetjmp, longjmp, siglongjmp - performing a nonlocal goto
fr: setjmp, sigsetjmp, longjmp, siglongjmp - Effectuer un saut non local

source: B<int setjmp(jmp_buf >I<env>B<);> B<int sigsetjmp(sigjmp_buf >I<env>B<, int >I<savesigs>B<);>
fr: B<int setjmp(jmp_buf >I<env>B<);> B<int sigsetjmp(sigjmp_buf >I<env>B<, int >I<sauvsigs>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: B<setjmp>(): see NOTES.
fr: B<setjmp>() : consultez la section NOTES.

source: The functions described on this page are used for performing "nonlocal gotos": transferring execution from one function to a predetermined location in another function. The B<setjmp>() function dynamically establishes the target to which control will later be transferred, and B<longjmp>() performs the transfer of execution.
fr: Les fonctions décrites dans cette page sont utilisées pour effectuer des « sauts non locaux » : transfert de l'exécution d'une fonction à un emplacement prédéterminé d'une autre fonction. La fonction B<setjmp>() établit de façon dynamique l'emplacement vers lequel le contrôle sera transféré ultérieurement et B<longjmp>() se charge de transférer l'exécution.

source: The B<setjmp>() function saves various information about the calling environment (typically, the stack pointer, the instruction pointer, possibly the values of other registers and the signal mask) in the buffer I<env> for later use by B<longjmp>(). In this case, B<setjmp>() returns 0.
fr: La fonction B<setjmp>() sauvegarde diverses informations concernant l'environnement de l'appelant (typiquement le pointeur de pile, le pointeur d'instruction, potentiellement les valeurs d'autres registres ainsi que le masque de signaux) dans le tampon I<env> pour son utilisation ultérieure par B<longjmp>(). Dans ce cas, B<setjmp>() renvoie B<0>.

source: The B<longjmp>() function uses the information saved in I<env> to transfer control back to the point where B<setjmp>() was called and to restore ("rewind") the stack to its state at the time of the B<setjmp>() call. In addition, and depending on the implementation (see NOTES), the values of some other registers and the process signal mask may be restored to their state at the time of the B<setjmp>() call.
fr: La fonction B<longjmp>() utilise les informations stockées dans I<env> pour transférer le contrôle à l'endroit où B<setjmp>() fut appelé et restaurer (« rewind ») la pile à son état lors de l'appel à B<setjmp>(). De plus, et en fonction de l'implémentation (voir NOTES), les valeurs d'autres registres et le masque de signaux du processus peuvent également être restaurées à leur état lors de l'appel à B<setjmp>().

source: Following a successful B<longjmp>(), execution continues as if B<setjmp>() had returned for a second time. This "fake" return can be distinguished from a true B<setjmp>() call because the "fake" return returns the value provided in I<val>. If the programmer mistakenly passes the value 0 in I<val>, the "fake" return will instead return 1.
fr: Après un appel réussi à B<longjmp>(), l'exécution continue comme si B<setjmp>() avait renvoyé une deuxième fois. Ce renvoi « factice » peut être distingué d'un vrai appel à B<setjmp>() car il renvoie la valeur contenue dans I<val>. Si le programmeur passe la valeur B<0> à I<val> par inadvertance, le renvoi « factice » retourne B<1> à la place.

source: sigsetjmp() and siglongjmp()
fr: sigsetjmp() et siglongjmp()

source: B<sigsetjmp>() and B<siglongjmp>() also perform nonlocal gotos, but provide predictable handling of the process signal mask.
fr: B<sigsetjmp>() et B<siglongjmp>() effectuent également des sauts non locaux mais permettent une gestion prévisible du masque de signaux du processus.

source: If, and only if, the I<savesigs> argument provided to B<sigsetjmp>() is nonzero, the process's current signal mask is saved in I<env> and will be restored if a B<siglongjmp>() is later performed with this I<env>.
fr: Si, et seulement si, l'argument I<sauvsigs> passé à B<sigsetjmp>() est non nul, le masque de signaux actuel du processus est sauvegardé dans I<env> et sera rétabli lorsque B<siglongjmp>() sera invoquée avec ce contexte I<env>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: B<setjmp>() and B<sigsetjmp>() return 0 when called directly; on the "fake" return that occurs after B<longjmp>() or B<siglongjmp>(), the nonzero value specified in I<val> is returned.
fr: B<setjmp>() et B<sigsetjmp>() renvoient B<0> lorsqu'elles sont appelées directement ; la valeur non nulle spécifiée dans I<val> est renvoyée lors du renvoi « factice » qui se produit après un appel à B<longjmp>() ou B<siglongjmp>().

source: The B<longjmp>() or B<siglongjmp>() functions do not return.
fr: Les fonctions B<longjmp>() et B<siglongjmp>() ne renvoient pas.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: CONFORMING TO
fr: CONFORMITÉ

source: POSIX does not specify whether B<setjmp>() will save the signal mask (to be later restored during B<longjmp>()). In System V it will not. In 4.3BSD it will, and there is a function B<_setjmp>() that will not. The behavior under Linux depends on the glibc version and the setting of feature test macros. On Linux with glibc versions before 2.19, B<setjmp>() follows the System V behavior by default, but the BSD behavior is provided if the B<_BSD_SOURCE> feature test macro is explicitly defined and none of B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_GNU_SOURCE>, or B<_SVID_SOURCE> is defined. Since glibc 2.19, I<E<lt>setjmp.hE<gt>> exposes only the System V version of B<setjmp>(). Programs that need the BSD semantics should replace calls to B<setjmp>() with calls to B<sigsetjmp>() with a nonzero I<savesigs> argument.
fr: POSIX ne spécifie pas si B<setjmp>() sauve le masque de signaux (pour être ensuite restauré lors de B<longjmp>()). Sous System V, ce n'est pas le cas. Sous 4.3BSD, le masque sera sauvé et il y a une fonction B<_setjmp> qui ne fait pas la copie. Le comportement sous Linux dépend de la version de la glibc ainsi que de la configuration des macros de test de fonctionnalités. Sous Linux avec glibc avant la version 2.19, B<setjmp>() suit le comportement de System V par défaut, mais le comportement BSD est fourni si la macro de test de fonctionnalités B<_BSD_SOURCE> est définie et qu’aucune des macros B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_GNU_SOURCE> ou B<_SVID_SOURCE> n'est définie. Depuis glibc 2.19, I<E<lt>setjmp.hE<gt>> n’expose que la version System V de B<setjmp>(). Les programmes ayant besoin de le sémantique BSD devraient remplacer les appels de B<setjmp>() par des appels de B<sigsetjmp>() avec un argument I<sauvsigs> non nul.

source: B<setjmp>() and B<longjmp>() can be useful for dealing with errors inside deeply nested function calls or to allow a signal handler to pass control to a specific point in the program, rather than returning to the point where the handler interrupted the main program. In the latter case, if you want to portably save and restore signal masks, use B<sigsetjmp>() and B<siglongjmp>(). See also the discussion of program readability below.
fr: B<setjmp>() et B<longjmp>() peuvent être utiles pour gérer des erreurs dans des appels profondément imbriqués ou pour permettre à un gestionnaire de signal de passer le contrôle à un point précis du programme, plutôt que de renvoyer là où le gestionnaire a interrompu le programme principal. Dans ce dernier cas, si vous désirez sauvegarder et restaurer les masques de signaux de manière portable, utilisez B<sigsetjmp>() et B<siglongjmp>(). Consultez également la sous-section sur la lisibilité des programmes ci-dessous.

source: The compiler may optimize variables into registers, and B<longjmp>() may restore the values of other registers in addition to the stack pointer and program counter. Consequently, the values of automatic variables are unspecified after a call to B<longjmp>() if they meet all the following criteria:
fr: Le compilateur peut optimiser certaines variables dans des registres et B<longjmp>() peut restaurer les valeurs d'autres registres en plus des pointeurs de pile et d'instruction. Par conséquent, les valeurs de variables automatiques ne sont pas spécifiées après un appel à B<longjmp>() si elles satisfont à tous les critères suivants :

source: they are local to the function that made the corresponding B<setjmp>() call;
fr: elles sont locales à la fonction qui a effectué l'appel correspondant à B<setjmp>() ;

source: their values are changed between the calls to B<setjmp>() and B<longjmp>(); and
fr: leur valeur est changée entre les appels à B<setjmp>() et B<longjmp>() ;

source: they are not declared as I<volatile>.
fr: elles ne sont pas déclarées comme I<volatile>.

source: Analogous remarks apply for B<siglongjmp>().
fr: Ces remarques s'appliquent aussi à B<siglongjmp>().

source: Nonlocal gotos and program readability
fr: Sauts non locaux et lisibilité des programmes

source: While it can be abused, the traditional C "goto" statement at least has the benefit that lexical cues (the goto statement and the target label) allow the programmer to easily perceive the flow of control. Nonlocal gotos provide no such cues: multiple B<setjmp>() calls might employ the same I<jmp_buf> variable so that the content of the variable may change over the lifetime of the application. Consequently, the programmer may be forced to perform detailed reading of the code to determine the dynamic target of a particular B<longjmp>() call. (To make the programmer's life easier, each B<setjmp>() call should employ a unique I<jmp_buf> variable.)
fr: Bien que la déclaration C traditionnelle « goto » puisse être exploitée, elle a pour bénéfice que les repères lexicaux (la déclaration de saut ainsi que l'étiquette cible) permettent au programmeur de percevoir de façon claire le flux de contrôle. Les sauts non locaux ne fournissent pas de tels repères : plusieurs appels à B<setjmp>() peuvent utiliser la même variable I<jmp_buf> de telle sorte que son contenu change au cours du déroulement de l'application. Par conséquent, le programmeur peut être astreint à une lecture détaillée du code afin de déterminer la cible dynamique d'un appel B<longjmp>() particulier (pour rendre la tâche du programmeur plus simple, chaque appel à B<setjmp>() devrait utiliser une variable I<jmp_buf> unique).

source: Adding further difficulty, the B<setjmp>() and B<longjmp>() calls may not even be in the same source code module.
fr: De façon encore plus compliquée, les appels à B<setjmp>() et B<longjmp>() peuvent même provenir de modules de code source différents.

source: In summary, nonlocal gotos can make programs harder to understand and maintain, and an alternative should be used if possible.
fr: En résumé, les sauts non locaux peuvent rendre les programmes plus difficiles à comprendre et à maintenir, et une alternative devrait être utilisée lorsque c'est possible.

source: Caveats
fr: Mises en garde

source: If the function which called B<setjmp>() returns before B<longjmp>() is called, the behavior is undefined. Some kind of subtle or unsubtle chaos is sure to result.
fr: Si la fonction qui a appelé B<setjmp>() renvoie avant que B<longjmp>() ne soit appelée, le comportement n'est pas défini. Une sorte de chaos plus ou moins subtil en résulterait de façon certaine.

source: If, in a multithreaded program, a B<longjmp>() call employs an I<env> buffer that was initialized by a call to B<setjmp>() in a different thread, the behavior is undefined.
fr: Si, dans un programme à plusieurs fils d'exécution, un appel à B<longjmp>() utilise un tampon I<env> initialisé préalablement par B<setjmp>() dans un fil d'exécution différent, le comportement n'est pas défini.

source: POSIX.1-2008 Technical Corrigendum 2 adds B<longjmp>() and B<siglongjmp>() to the list of async-signal-safe functions. However, the standard recommends avoiding the use of these functions from signal handlers and goes on to point out that if these functions are called from a signal handler that interrupted a call to a non-async-signal-safe function (or some equivalent, such as the steps equivalent to B<exit>(3) that occur upon a return from the initial call to I<main>()), the behavior is undefined if the program subsequently makes a call to a non-async-signal-safe function. The only way of avoiding undefined behavior is to ensure one of the following:
fr: Le Technical Corrigendum 2 de POSIX.1-2008 ajoute B<longjmp>() et B<siglongjmp>() à la liste des fonctions sûres vis-à-vis des signaux asynchrones. Cependant, la norme recommande de ne pas utiliser ces fonctions dans un gestionnaire de signal et indique ensuite que si ces fonctions sont appelées depuis un gestionnaire de signal qui a interrompu un appel à une fonction non sûre vis-à-vis des signaux asynchrones (ou similaire tels que les étapes équivalentes à B<exit>(3) se produisant après un renvoi de l'appel initial I<main>()), le comportement n'est pas défini si le programme fait par la suite un appel à une fonction non sûre vis-à-vis des signaux asynchrones. La seule façon d'éviter ce comportement non défini est de s'assurer de la chose suivante :

source: After long jumping from the signal handler, the program does not call any non-async-signal-safe functions and does not return from the initial call to I<main>().
fr: Après un saut non local depuis un gestionnaire de signal, le programme n'appelle pas de fonction non sûre vis-à-vis des signaux asynchrones et ne renvoie pas depuis l'appel initial à I<main>().

source: Any signal whose handler performs a long jump must be blocked during I<every> call to a non-async-signal-safe function and no non-async-signal-safe functions are called after returning from the initial call to I<main>().
fr: Chaque signal dont le gestionnaire effectue un saut non local doit être bloqué lors de I<chaque> appel à une fonction non sûre vis-à-vis des signaux asynchrones et aucune fonction non sûre vis-à-vis des signaux asynchrones n'est appelée après un renvoi depuis l'appel initial à I<main>().

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
