Repository: sebras/manpages-l10n
Catalog: po/*/man3/shm_open.3.po
Languages: fr

source: /* Write modified data in shared memory to standard output */
fr: /* Afficher les données modifiées en mémoire partagée sur la sortie standard */

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: On success, B<shm_open>() returns a nonnegative file descriptor. On failure, B<shm_open>() returns -1. B<shm_unlink>() returns 0 on success, or -1 on error.
fr: S'il réussit, l'appel B<shm_open>() renvoie un descripteur de fichier non négatif. S'il échoue, B<shm_open>() renvoie B<-1>. B<shm_unlink>() renvoie B<0> s'il réussit ou B<-1> en cas d'erreur.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
