Repository: sebras/manpages-l10n
Catalog: po/*/man3/shm_open.3.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: shm_open, shm_unlink - create/open or unlink POSIX shared memory objects
fr: shm_open, shm_unlink - Créer, ouvrir ou supprimer des objets en mémoire partagée POSIX

source: B<#include E<lt>sys/mman.hE<gt>> B<#include E<lt>sys/stat.hE<gt>> /* For mode constants */ B<#include E<lt>fcntl.hE<gt>> /* For O_* constants */
fr: B<#include E<lt>sys/mman.hE<gt>> B<#include E<lt>sys/stat.hE<gt>> /* Pour les constantes de mode */ B<#include E<lt>fcntl.hE<gt>> /* Pour les constantes O_* */

source: B<int shm_open(const char *>I<name>B<, int >I<oflag>B<, mode_t >I<mode>B<);> B<int shm_unlink(const char *>I<name>B<);>
fr: B<int shm_open(const char *>I<nom>B<, int >I<masque>B<, mode_t >I<mode>B<);> B<int shm_unlink(const char *>I<nom>B<);>

source: Link with I<-lrt>.
fr: Éditer les liens avec I<-lrt>.

source: B<shm_open>() creates and opens a new, or opens an existing, POSIX shared memory object. A POSIX shared memory object is in effect a handle which can be used by unrelated processes to B<mmap>(2) the same region of shared memory. The B<shm_unlink>() function performs the converse operation, removing an object previously created by B<shm_open>().
fr: La fonction B<shm_open>() crée et ouvre un nouvel objet en mémoire partagée POSIX, ou ouvre un objet existant. Il s'agit d'un descripteur utilisable par des processus indépendants pour projeter la même région mémoire à l'aide de B<mmap>(2). La fonction B<shm_unlink>() réalise l'opération inverse en supprimant l'objet créé précédemment par B<shm_open>().

source: The operation of B<shm_open>() is analogous to that of B<open>(2). I<name> specifies the shared memory object to be created or opened. For portable use, a shared memory object should be identified by a name of the form I</somename>; that is, a null-terminated string of up to B<NAME_MAX> (i.e., 255) characters consisting of an initial slash, followed by one or more characters, none of which are slashes.
fr: Le fonctionnement de B<shm_open>() est analogue à celui de B<open>(2). I<nom> indique l'objet en mémoire partagée à créer ou ouvrir. Pour un fonctionnement portable, un objet en mémoire partagée doit être identifié par un nom au format I</un_nom> ; c'est-à-dire une chaîne terminée par un octet de valeur zéro d'au plus B<NAME_MAX> (c'est-à-dire 255) caractères, et commençant par une barre oblique (« / ») suivie d'un caractère ou plus, ces derniers n'étant pas des barres obliques.

source: I<oflag> is a bit mask created by ORing together exactly one of B<O_RDONLY> or B<O_RDWR> and any of the other flags listed here:
fr: I<masque> est un masque de bits associant à l'aide d'un OU logique une et une seule des deux constantes B<O_RDONLY> ou B<O_RDWR> et un ou plusieurs des attributs décrits ci-après :

source: Open the object for read access. A shared memory object opened in this way can be B<mmap>(2)ed only for read (B<PROT_READ>) access.
fr: Ouvrir l'objet en lecture seule. Un tel objet ne pourra être projeté en mémoire avec B<mmap>(2) qu'avec un accès en lecture (B<PROT_READ>).

source: Open the object for read-write access.
fr: Ouvrir l'objet en lecture et écriture.

source: Create the shared memory object if it does not exist. The user and group ownership of the object are taken from the corresponding effective IDs of the calling process, and the object's permission bits are set according to the low-order 9 bits of I<mode>, except that those bits set in the process file mode creation mask (see B<umask>(2)) are cleared for the new object. A set of macro constants which can be used to define I<mode> is listed in B<open>(2). (Symbolic definitions of these constants can be obtained by including I<E<lt>sys/stat.hE<gt>>.)
fr: Créer l'objet en mémoire partagée s'il n'existe pas. L'utilisateur et le groupe propriétaires de l'objet proviennent des ID effectifs du processus appelant, et les bits de permission sont définis en fonction des 9\ bits de poids faible de I<mode>, excepté que les bits qui sont définis dans le masque de mode de fichier pour la création du processus (consultez B<umask>(2)) sont effacés pour le nouvel objet. Un jeu de constantes de macroutilisables pour définir le I<mode> est décrit dans B<open>(2) (les définitions symboliques de ces constantes peuvent être obtenues en incluant I<E<lt>sys/stat.hE<gt>>).

source: A new shared memory object initially has zero length\(emthe size of the object can be set using B<ftruncate>(2). The newly allocated bytes of a shared memory object are automatically initialized to 0.
fr: Un nouvel objet en mémoire partagée a une taille initiale nulle — elle peut être définie avec B<ftruncate>(2). Les octets d'un objet en mémoire partagée nouvellement créé sont automatiquement initialisés à zéro.

source: If B<O_CREAT> was also specified, and a shared memory object with the given I<name> already exists, return an error. The check for the existence of the object, and its creation if it does not exist, are performed atomically.
fr: Si B<O_CREAT> était aussi précisé et si un objet en mémoire partagée avec le même I<nom> existait déjà, renvoyer une erreur. La vérification de l'existence de l'objet et sa création s'il n'existe pas sont réalisées de manière atomique.

source: If the shared memory object already exists, truncate it to zero bytes.
fr: Si l'objet en mémoire partagée existe déjà, tronquer sa taille à zéro.

source: Definitions of these flag values can be obtained by including I<E<lt>fcntl.hE<gt>>.
fr: Les définitions des valeurs de ces attributs peuvent être obtenues en incluant I<E<lt>fcntl.hE<gt>>.

source: On successful completion B<shm_open>() returns a new file descriptor referring to the shared memory object. This file descriptor is guaranteed to be the lowest-numbered file descriptor not previously opened within the process. The B<FD_CLOEXEC> flag (see B<fcntl>(2)) is set for the file descriptor.
fr: Si elle réussit, la fonction B<shm_open>() renvoie un nouveau descripteur de fichierréférençant l'objet en mémoire partagée. Ce descripteur sera le plus petit numéro disponible dans la table des descripteurs du processus. L'attribut B<FD_CLOEXEC> (consultez B<fcntl>(2)) sera activé pour le descripteur de fichier.

source: The file descriptor is normally used in subsequent calls to B<ftruncate>(2) (for a newly created object) and B<mmap>(2). After a call to B<mmap>(2) the file descriptor may be closed without affecting the memory mapping.
fr: Le descripteur de fichier est utilisé normalement pour les appels ultérieurs à B<ftruncate>(2) (pour un objet nouvellement créé) et B<mmap>(2). Après un appel à B<mmap>(2) le descripteur peut être fermé sans affecter la projection mémoire.

source: The operation of B<shm_unlink>() is analogous to B<unlink>(2): it removes a shared memory object name, and, once all processes have unmapped the object, deallocates and destroys the contents of the associated memory region. After a successful B<shm_unlink>(), attempts to B<shm_open>() an object with the same I<name> fail (unless B<O_CREAT> was specified, in which case a new, distinct object is created).
fr: Le fonctionnement de B<shm_unlink>() est analogue à celui de B<unlink>(2)\ : il supprime le nom d'un objet en mémoire partagée, et, une fois que tous les processus ont supprimé leur projection en mémoire, libère et détruit le contenu de la portion de mémoire associée. Après un appel réussi à B<shm_unlink>(), les tentatives d'appeler B<shm_open>() avec le même I<nom> échoueront (sauf si B<O_CREAT> est spécifié, auquel cas un nouvel objet distinct sera créé).

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<shm_open>() returns a file descriptor (a nonnegative integer). On success, B<shm_unlink>() returns 0. On failure, both functions return -1 and set I<errno> to indicate the error.
fr: Si elles réussissent, B<shm_open>() renvoie un descripteur de fichier (un entier non négatif) et B<shm_unlink>() renvoie B<0>. En cas d'échec, les deux fonctions renvoient B<-1> et définissent I<errno> pour indiquer le code d'erreur.

source: ERRORS
fr: ERREURS

source: Permission to B<shm_unlink>() the shared memory object was denied.
fr: La permission d'utiliser B<shm_unlink>() sur l'objet en mémoire partagée a été refusée.

source: Permission was denied to B<shm_open>() I<name> in the specified I<mode>, or B<O_TRUNC> was specified and the caller does not have write permission on the object.
fr: L'utilisation de B<shm_open>() pour ouvrir l'objet I<nom> dans le I<mode> spécifié a été refusée, ou B<O_TRUNC> a été spécifié et l'appelant n'a pas les permissions d'écriture sur l'objet.

source: Both B<O_CREAT> and B<O_EXCL> were specified to B<shm_open>() and the shared memory object specified by I<name> already exists.
fr: B<O_CREAT> et B<O_EXCL> ont été spécifiés dans B<shm_open>() et un objet de mémoire partagée du même I<nom> existe déjà.

source: The I<name> argument to B<shm_open>() was invalid.
fr: L'argument I<nom> de B<shm_open>() n'était pas valable.

source: The per-process limit on the number of open file descriptors has been reached.
fr: La limite du nombre de descripteurs de fichiers par processus a été atteinte.

source: The length of I<name> exceeds B<PATH_MAX>.
fr: La longueur du I<nom> dépasse B<PATH_MAX>.

source: The system-wide limit on the total number of open files has been reached.
fr: La limite du nombre total de fichiers ouverts pour le système entier a été atteinte.

source: An attempt was made to B<shm_open>() a I<name> that did not exist, and B<O_CREAT> was not specified.
fr: Tentative d'ouvrir avec B<shm_open>() un objet I<nom> qui n'existe pas, alors que l'attribut B<O_CREAT> n'a pas été spécifié.

source: An attempt was to made to B<shm_unlink>() a I<name> that does not exist.
fr: Tentative d'utiliser B<shm_unlink>() sur un objet I<nom> qui n'existe pas.

source: These functions are provided in glibc 2.2 and later.
fr: Ces fonctions sont fournies depuis la glibc 2.2.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: CONFORMING TO
fr: CONFORMITÉ

source: POSIX.1-2001 says that the group ownership of a newly created shared memory object is set to either the calling process's effective group ID or "a system default group ID". POSIX.1-2008 says that the group ownership may be set to either the calling process's effective group ID or, if the object is visible in the filesystem, the group ID of the parent directory.
fr: POSIX.1-2001 indique que le groupe propriétaire d'un objet en mémoire partagée nouvellement créé utilise soit l'ID de groupe du processus appelant, soit un «\ ID de groupe par défaut défini par le système\ ». POSIX.1-2008 indique que le groupe propriétaire peut être défini soit avec l'ID de groupe du processus appelant, soit, si l'objet est visible dans le système de fichiers, avec l'ID de groupe du répertoire parent.

source: POSIX leaves the behavior of the combination of B<O_RDONLY> and B<O_TRUNC> unspecified. On Linux, this will successfully truncate an existing shared memory object\(emthis may not be so on other UNIX systems.
fr: POSIX ne précise pas le comportement de la combinaison B<O_RDONLY> et B<O_TRUNC>. Sous Linux, la troncature aura lieu — cela n'est pas nécessairement le cas sous d'autres systèmes UNIX.

source: The POSIX shared memory object implementation on Linux makes use of a dedicated B<tmpfs>(5) filesystem that is normally mounted under I</dev/shm>.
fr: L'implémentation sous Linux des objets de mémoire partagée POSIX utilise un système de fichiers B<tmpfs>(5) dédié, monté en principe sous I</dev/shm>.

source: EXAMPLES
fr: EXEMPLES

source: The programs below employ POSIX shared memory and POSIX unnamed semaphores to exchange a piece of data. The "bounce" program (which must be run first) raises the case of a string that is placed into the shared memory by the "send" program. Once the data has been modified, the "send" program then prints the contents of the modified shared memory. An example execution of the two programs is the following:
fr: Les programmes ci-dessous utilisent la mémoire partagée POSIX et des sémaphores non nommés POSIX pour échanger des données. Le programme « bounce » (qui doit être exécuté en premier) illustre le cas d'une chaîne placée en mémoire partagée par le programme « send ». Lorsque les données ont été modifiées, le programme « send » affiche le contenu de la mémoire partagée modifié. Voici un exemple d'exécution des deux programmes :

source: $ B<./pshm_ucase_bounce /myshm &> [1] 270171 $ B<./pshm_ucase_send /myshm hello> HELLO
fr: $ B<./pshm_ucase_bounce /myshm &> [1] 270171 $ B<./pshm_ucase_send /myshm bonjour> BONJOUR

source: Further detail about these programs is provided below.
fr: Vous trouverez plus de détails à propos de ces programmes ci-dessous.

source: Program source: pshm_ucase.h
fr: Source du programme : pshm_ucase.h

source: The following header file is included by both programs below. Its primary purpose is to define a structure that will be imposed on the memory object that is shared between the two programs.
fr: Ce fichier d'en-tête est inclus par les deux programmes ci-dessous. Sa principale fonction consiste à définir une structure qui sera imposée à l'objet en mémoire partagé entre les deux programmes.

source: #define BUF_SIZE 1024 /* Maximum size for exchanged string */
fr: #define BUF_SIZE 1024 /* Taille maximale de la chaîne échangée */

source: /* Define a structure that will be imposed on the shared memory object */
fr: /* Définir une structure qui sera imposée à l'objet en mémoire partagée */

source: struct shmbuf { sem_t sem1; /* POSIX unnamed semaphore */ sem_t sem2; /* POSIX unnamed semaphore */ size_t cnt; /* Number of bytes used in \(aqbuf\(aq */ char buf[BUF_SIZE]; /* Data being transferred */ };
fr: struct shmbuf { sem_t sem1; /* Sémaphore POSIX non nommé */ sem_t sem2; /* Sémaphore POSIX non nommé */ size_t cnt; /* Nombre d'octets utilisés dans \(aqbuf\(aq */ char buf[BUF_SIZE]; /* Données en cours de transfert */ };

source: Program source: pshm_ucase_bounce.c
fr: Source programme : pshm_ucase_bounce.c

source: The "bounce" program creates a new shared memory object with the name given in its command-line argument and sizes the object to match the size of the I<shmbuf> structure defined in the header file. It then maps the object into the process's address space, and initializes two POSIX semaphores inside the object to 0.
fr: Le programme « bounce » crée un nouvel objet en mémoire partagée avec le nom spécifié comme argument de la ligne de commande et le dimensionne de manière à correspondre à la taille de la structure I<shmbuf> définie dans le fichier d'en-tête. Il projette ensuite l'objet dans l'espace d'adressage du processus et initialise deux sémaphores POSIX à B<0> à l'intérieur de l'objet.

source: After the "send" program has posted the first of the semaphores, the "bounce" program upper cases the data that has been placed in the memory by the "send" program and then posts the second semaphore to tell the "send" program that it may now access the shared memory.
fr: Une fois le premier sémaphore posté par le programme « send », le programme « bounce » met en capitales les données placées en mémoire par le programme « send », puis poste le second sémaphore pour indiquer au programme « send » qu'il peut maintenant accéder à la mémoire partagée.

source: /* Create shared memory object and set its size to the size of our structure. */
fr: /* Créer l'objet en mémoire partagée et le dimensionner à la taille de notre structure. */

source: /* Map the object into the caller\(aqs address space. */
fr: /* Projeter l'objet dans l'espace d'adressage de l'appelant. */

source: /* Initialize semaphores as process-shared, with value 0. */
fr: /* Initialiser les sémaphores comme partagés entre processus avec la valeur B<0>. */

source: /* Wait for \(aqsem1\(aq to be posted by peer before touching shared memory. */
fr: /* Attendre que \(aqsem1\(aq ait été posté par le processus pair avant de toucher à la mémoire partagée. */

source: /* Convert data in shared memory into upper case. */
fr: /* Convertir en capitales les données en mémoire partagée. */

source: /* Post \(aqsem2\(aq to tell the peer that it can now access the modified data in shared memory. */
fr: /* Poster \(aqsem2\(aq pour informer le processus pair qu'il peut dorénavant accéder aux données modifiées en mémoire partagée. */

source: /* Unlink the shared memory object. Even if the peer process is still using the object, this is okay. The object will be removed only after all open references are closed. */
fr: /* Supprimer le lien avec l'objet en mémoire partagée. Cela ne posera pas de problème, même si le processus pair utilise encore l'objet, car ce dernier ne sera supprimé que lorsque tous les liens ouverts qui y font référence auront été fermés. */

source: Program source: pshm_ucase_send.c
fr: Source du programme : pshm_ucase_send.c

source: The "send" program takes two command-line arguments: the pathname of a shared memory object previously created by the "bounce" program and a string that is to be copied into that object.
fr: Le programme « send » accepte deux arguments de ligne de commande : le nom d'un objet en mémoire partagée préalablement créé par le programme « bounce » et une chaîne à copier dans cet objet.

source: The program opens the shared memory object and maps the object into its address space. It then copies the data specified in its second argument into the shared memory, and posts the first semaphore, which tells the "bounce" program that it can now access that data. After the "bounce" program posts the second semaphore, the "send" program prints the contents of the shared memory on standard output.
fr: Le programme ouvre l'objet en mémoire partagée et le projette dans son espace d'adressage. Ensuite, il copie les données spécifiées à l'aide du second argument vers la mémoire partagée et poste le premier sémaphore pour informer le programme « bounce » qu'il peut maintenant accéder aux données. Lorsque le programme « bounce » a posté le second sémaphore, le programme « send » affiche le contenu de la mémoire partagée sur la sortie standard.

source: if (len E<gt> BUF_SIZE) { fprintf(stderr, "String is too long\en"); exit(EXIT_FAILURE); }
fr: if (len E<gt> BUF_SIZE) { fprintf(stderr, "La chaîne est trop longue\en"); exit(EXIT_FAILURE); }

source: /* Open the existing shared memory object and map it into the caller\(aqs address space. */
fr: /* Ouvrir l'objet en mémoire partagée existant et le projeter dans l'espace d'adressage de l'appelant. */

source: /* Copy data into the shared memory object. */
fr: /* Copier les données dans l'objet en mémoire partagée. */

source: /* Tell peer that it can now access shared memory. */
fr: /* Informer le processus pair qu'il peut maintenant accéder à la mémoire partagée. */

source: /* Wait until peer says that it has finished accessing the shared memory. */
fr: /* Attendre que le processus pair indique qu'il a fini d'accéder à la mémoire partagée. */

source: /* Write modified data in shared memory to standard output. */
fr: /* Afficher les données qui ont été modifiées en mémoire partagée sur la sortie standard. */

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<#include E<lt>sys/stat.hE<gt>> /* For mode constants */
fr: B<#include E<lt>sys/stat.hE<gt>> /* Pour les constantes des modes */

source: B<#include E<lt>fcntl.hE<gt>> /* For O_* constants */
fr: B<#include E<lt>fcntl.hE<gt>> /* Pour les constantes O_* */

source: B<int shm_open(const char *>I<name>B<, int >I<oflag>B<, mode_t >I<mode>B<);>
fr: B<int shm_open(const char *>I<nom>B<, int >I<masque>B<, mode_t >I<mode>B<);>

source: B<int shm_unlink(const char *>I<name>B<);>
fr: B<int shm_unlink(const char *>I<nom>B<);>

source: The operation of B<shm_unlink>() is analogous to B<unlink>(2): it removes a shared memory object name, and, once all processes have unmapped the object, de-allocates and destroys the contents of the associated memory region. After a successful B<shm_unlink>(), attempts to B<shm_open>() an object with the same I<name> fail (unless B<O_CREAT> was specified, in which case a new, distinct object is created).
fr: Le fonctionnement de B<shm_unlink>() est analogue à celui de B<unlink>(2)\ : elle supprime le nom d'un objet en mémoire partagée, et, lorsque tous les processus ont supprimé leur projection en mémoire de l'objet considéré, libère et détruit le contenu de la portion de mémoire associée. Après un appel réussi à B<shm_unlink>(), les tentatives d'appeler B<shm_open>() avec le même I<nom> échoueront (sauf si B<O_CREAT> est spécifié, auquel cas un nouvel objet distinct sera créé).

source: On success, B<shm_open>() returns a file descriptor (a nonnegative integer). On failure, B<shm_open>() returns -1. B<shm_unlink>() returns 0 on success, or -1 on error.
fr: S'il réussit, l'appel B<shm_open>() renvoie un descripteur de fichier (un entier non négatif). S'il échoue, B<shm_open>() renvoie B<-1>. B<shm_unlink>() renvoie B<0> s'il réussit ou B<-1> en cas d'erreur.

source: On failure, I<errno> is set to indicate the cause of the error. Values which may appear in I<errno> include the following:
fr: En cas d'échec, I<errno> indique la cause de l'erreur. Les valeurs possibles de I<errno> sont les suivantes :

source: /* Create shared memory object and set its size to the size of our structure */
fr: /* Créer l'objet en mémoire virtuelle et définir sa taille égale à celle de notre structure */

source: /* Map the object into the caller\(aqs address space */
fr: /* Projeter l'objet dans l'espace d'adressage de l'appelant */

source: /* Initialize semaphores as process-shared, with value 0 */
fr: /* Initialiser les sémaphores comme partagés entre processus avec une valeur de B<0> */

source: /* Wait for \(aqsem1\(aq to be posted by peer before touching shared memory */
fr: /* Attendre que le sémaphore \(aqsem1\(aq soit posté par le processus pair avant de toucher à la mémoire partagée */

source: /* Convert data in shared memory into upper case */
fr: /* Convertir en capitales les données en mémoire partagée */

source: /* Post \(aqsem2\(aq to tell the to tell peer that it can now access the modified data in shared memory */
fr: /* Poster \(aqsem2\(aq pour informer le processus pair qu'il peut maintenant accéder aux données modifiées en mémoire partagée */

source: /* Open the existing shared memory object and map it into the caller\(aqs address space */
fr: /* Ouvrir l'objet en mémoire partagée existant et projeter ce dernier dans l'espace d'adressage de l'appelant */

source: /* Copy data into the shared memory object */
fr: /* Copier les données dans l'objet en mémoire partagée */

source: /* Tell peer that it can now access shared memory */
fr: /* Informer le processus pair qu'il peut maintenant accéder à la mémoire partagée */

source: /* Wait until peer says that it has finished accessing the shared memory */
fr: /* Attendre que le processus pair signale qu'il a fini d'accéder à la mémoire partagée */
