Repository: sebras/manpages-l10n
Catalog: po/*/man3/stdio_ext.3.po
Languages: es

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: NAME
es: NOMBRE

source: __fbufsize, __flbf, __fpending, __fpurge, __freadable, __freading, __fsetlocking, __fwritable, __fwriting, _flushlbf - interfaces to stdio FILE structure
es: __fbufsize, __flbf, __fpending, __fpurge, __freadable, __freading, __fsetlocking, __fwritable, __fwriting, _flushlbf - interfaces para la estructura FILE de stdio

source: SYNOPSIS
es: SINOPSIS

source: DESCRIPTION
es: DESCRIPCIÓN

source: Solaris introduced routines to allow portable access to the internals of the I<FILE> structure, and glibc also implemented these.
es: Solaris introdujo rutinas para permitir el acceso portable a los detalles internos de la estructura I<FILE>, y glibc también las implementa.

source: The B<__fbufsize>() function returns the size of the buffer currently used by the given stream.
es: La función B<__fbufsize>() devuelve el tamaño del buffer usado actualmente por el flujo dado.

source: The B<__fpending>() function returns the number of bytes in the output buffer. For wide-oriented streams the unit is wide characters. This function is undefined on buffers in reading mode, or opened read-only.
es: La función B<__fpending>() devuelve el número de bytes en el buffer de salida. Para flujos orientados a caracteres anchos la unidad es el carácter ancho. Esta función no está definida sobre buffers en modo lectura, o abiertos como solo-lectura.

source: The B<__flbf>() function returns a nonzero value if the stream is line-buffered, and zero otherwise.
es: La función B<__flbf>() devuelve un valor distinto de cero si el flujo usa buffer de línea, y cero en otro caso.

source: The B<__freadable>() function returns a nonzero value if the stream allows reading, and zero otherwise.
es: La función B<__freadable>() devuelve un valor distinto de cero si el flujo permite lectura, y cero en otro caso.

source: The B<__fwritable>() function returns a nonzero value if the stream allows writing, and zero otherwise.
es: La función B<__fwritable>() devuelve un valor distinto de cero si el flujo permite escritura, y cero en caso contrario.

source: The B<__freading>() function returns a nonzero value if the stream is read-only, or if the last operation on the stream was a read operation, and zero otherwise.
es: La función B<__freading>() devuelve un valor distinto de cero si el flujo es de solo-lectura, o si la última operación sobre el flujo fue una operación de lectura, y cero en otro caso.

source: The B<__fwriting>() function returns a nonzero value if the stream is write-only (or append-only), or if the last operation on the stream was a write operation, and zero otherwise.
es: La función B<__fwriting>() devuelve un valor distinto de cero si el flujo es de solo-lectura (o solo-añadidura), o si la última operación sobre el flujo fue una operación de escritura, y cero en otro caso.

source: Perform implicit locking around every operation on the given stream (except for the *_unlocked ones). This is the default.
es: Realiza bloqueo implícito en cada operación sobre el flujo dado (excepto para las que se especifican en *_unlocked). Éste es el valor por defecto.

source: The caller will take care of the locking (possibly using B<flockfile>(3) in case there is more than one thread), and the stdio routines will not do locking until the state is reset to B<FSETLOCKING_INTERNAL>.
es: El invocador se preocupará del bloqueo (posiblemente usando B<flockfile>(3) en el caso de que haya más de un hilo), y las rutinas de stdio no realizarán bloqueo hasta que el estado sea restablecido a B<FSETLOCKING_INTERNAL>.

source: Don't change the type of locking. (Only return it.)
es: No cambia el tipo de bloqueo. (Sólo lo devuelve.)

source: The B<_flushlbf>() function flushes all line-buffered streams. (Presumably so that output to a terminal is forced out, say before reading keyboard input.)
es: La función B<_flushlbf>() vacía todos los flujos con buffer de línea. (Presumiblemente para forzar la salida a la terminal, digamos antes de leer la entrada de teclado.)

source: The B<__fpurge>() function discards the contents of the stream's buffer.
es: La función B<__fpurge>() desecha el contenido del buffer del flujo.

source: ATTRIBUTES
es: ATRIBUTOS

source: For an explanation of the terms used in this section, see B<attributes>(7).
es: Para obtener una explicación de los términos usados en esta sección, véase B<attributes>(7).

source: Interface
es: Interfaz

source: Attribute
es: Atributo

source: Value
es: Valor

source: Thread safety
es: Seguridad del hilo

source: MT-Safe
es: Multi-hilo seguro

source: SEE ALSO
es: VÉASE TAMBIÉN

source: COLOPHON
es: COLOFÓN

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.12 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 5.10 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
es: Esta página es parte de la versión 4.16 del proyecto Linux I<man-pages>. Puede encontrar una descripción del proyecto, información sobre cómo informar errores y la última versión de esta página en \%https://www.kernel.org/doc/man-pages/.
