Repository: sebras/manpages-l10n
Catalog: po/*/man3/strcmp.3.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: strcmp, strncmp - compare two strings
fr: strcmp, strncmp - Comparer deux chaînes

source: The B<strcmp>() function compares the two strings I<s1> and I<s2>. The locale is not taken into account (for a locale-aware comparison, see B<strcoll>(3)). The comparison is done using unsigned characters.
fr: La fonction B<strcmp>() compare les deux chaînes I<s1> et I<s2>. La locale n'est pas prise en compte (pour une comparaison basée sur la locale, consultez B<strcoll>(3)). La comparaison est effectuée sur des caractères non signés.

source: B<strcmp>() returns an integer indicating the result of the comparison, as follows:
fr: B<strcmp>() retourne un entier indiquant le résultat de la comparaison comme suit :

source: 0, if the I<s1> and I<s2> are equal;
fr: B<0> si I<s1> et I<s2> sont égales ;

source: a negative value if I<s1> is less than I<s2>;
fr: une valeur négative si I<s1> est inférieure à I<s2> ;

source: a positive value if I<s1> is greater than I<s2>.
fr: une valeur positive si I<s1> est supérieure à I<s2>.

source: The B<strncmp>() function is similar, except it compares only the first (at most) I<n> bytes of I<s1> and I<s2>.
fr: La fonction B<strncmp>() est similaire, mais elle ne compare (au plus) que les I<n> premiers octets de I<s1> et I<s2>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: The B<strcmp>() and B<strncmp>() functions return an integer less than, equal to, or greater than zero if I<s1> (or the first I<n> bytes thereof) is found, respectively, to be less than, to match, or be greater than I<s2>.
fr: Les fonctions B<strcmp>() et B<strncmp>() renvoient un entier inférieur, égal ou supérieur à zéro si I<s1> (ou ses I<n> premiers octets) est respectivement inférieure, égale ou supérieure à I<s2>.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: CONFORMING TO
fr: CONFORMITÉ

source: POSIX.1 specifies only that:
fr: POSIX.1 ne spécifie uniquement que :

source: The sign of a nonzero return value shall be determined by the sign of the difference between the values of the first pair of bytes (both interpreted as type I<unsigned char>) that differ in the strings being compared.
fr: Le signe d'une valeur non nulle renvoyée doit être déterminé par le signe de la différence entre les valeurs de la première paire d'octets (interprétées comme des I<unsigned char>) qui différent dans les chaînes comparées.

source: In glibc, as in most other implementations, the return value is the arithmetic result of subtracting the last compared byte in I<s2> from the last compared byte in I<s1>. (If the two characters are equal, this difference is 0.)
fr: Dans la glibc, et comme dans la plupart des implémentations, la valeur retournée est le résultat arithmétique de la soustraction du dernier octet comparé de I<s2> au dernier octet comparé dans I<s1> (si les deux caractères sont identiques, la différence est B<0>).

source: EXAMPLES
fr: EXEMPLES

source: The program below can be used to demonstrate the operation of B<strcmp>() (when given two arguments) and B<strncmp>() (when given three arguments). First, some examples using B<strcmp>():
fr: Le programme suivant peut être utilisé pour illustrer le fonctionnement de B<strcmp>() (recevant deux arguments) et B<strncmp>() (recevant trois arguments). Tout d'abord, quelques exemples utilisant B<strcmp>() :

source: $ B<./string_comp ABC ABC> E<lt>str1E<gt> and E<lt>str2E<gt> are equal $ B<./string_comp ABC AB> # \(aqC\(aq is ASCII 67; \(aqC\(aq - \(aq\e0\(aq = 67 E<lt>str1E<gt> is greater than E<lt>str2E<gt> (67) $ B<./string_comp ABA ABZ> # \(aqA\(aq is ASCII 65; \(aqZ\(aq is ASCII 90 E<lt>str1E<gt> is less than E<lt>str2E<gt> (-25) $ B<./string_comp ABJ ABC> E<lt>str1E<gt> is greater than E<lt>str2E<gt> (7) $ .B</string_comp $\(aq\e201\(aq A> # 0201 - 0101 = 0100 (or 64 decimal) E<lt>str1E<gt> is greater than E<lt>str2E<gt> (64)
fr: $ B<./string_comp ABC ABC> E<lt>str1E<gt> et E<lt>str2E<gt> sont égales $ B<./string_comp ABC AB> # le code ASCII de \(aqC\(aq est 67; \(aqC\(aq - \(aq\0\(aq = 67 E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (67) $ B<./string_comp ABA ABZ> # le code ASCII de \(aqA\(aq est 65; le code ASCII de \(aqZ\(aq est 90 E<lt>str1E<gt> est inférieure à E<lt>str2E<gt> (-25) $ B<./string_comp ABJ ABC> E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (7) $ .B</string_comp $\(aq\e201\(aq A> # 0201 - 0101 = 0100 (ou 64 en décimal) E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (64)

source: The last example uses B<bash>(1)-specific syntax to produce a string containing an 8-bit ASCII code; the result demonstrates that the string comparison uses unsigned characters.
fr: Le dernier exemple utilise une syntaxe spécifique à B<bash>(1) pour générer un chaîne de caractères contenant un code ASCII 8 bits ; le resultat met en évidence que la comparaison des chaînes travaille sur des caractères non signés.

source: And then some examples using B<strncmp>():
fr: Et quelques exemples utilisant B<strncmp>() :

source: $ B<./string_comp ABC AB 3> E<lt>str1E<gt> is greater than E<lt>str2E<gt> (67) $ B<./string_comp ABC AB 2> E<lt>str1E<gt> and E<lt>str2E<gt> are equal in the first 2 bytes
fr: $ B<./string_comp ABC AB 3> E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (67) $ B<./string_comp ABC AB 2> E<lt>str1E<gt> et E<lt>str2E<gt> ont leurs deux premiers octets égaux

source: Program source
fr: Source du programme

source: Licensed under GNU General Public License v2 or later. */ #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>string.hE<gt>
fr: Sous licence GNU General Public License version 2 ou supérieure. */ #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>string.hE<gt>

source: if (argc E<lt> 3) { fprintf(stderr, "Usage: %s E<lt>str1E<gt> E<lt>str2E<gt> [E<lt>lenE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }
fr: if (argc E<lt> 3) { fprintf(stderr, "Usage : %s E<lt>str1E<gt> E<lt>str2E<gt> [E<lt>longE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }

source: if (res == 0) { printf("E<lt>str1E<gt> and E<lt>str2E<gt> are equal"); if (argc E<gt> 3) printf(" in the first %d bytes\en", atoi(argv[3])); printf("\en"); } else if (res E<lt> 0) { printf("E<lt>str1E<gt> is less than E<lt>str2E<gt> (%d)\en", res); } else { printf("E<lt>str1E<gt> is greater than E<lt>str2E<gt> (%d)\en", res); }
fr: if (res == 0) { printf("E<lt>str1E<gt> et E<lt>str2E<gt> sont égaux"); if (argc E<gt> 3) printf(" pour les %d premiers caractères\en", atoi(argv[3])); printf("\en"); } else if (res E<lt> 0) { printf("E<lt>str1E<gt> est inférieure à E<lt>str2E<gt> (%d)\en", res); } else { printf("E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (%d)\en", res); }

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: $ B<./string_comp ABC ABC> E<lt>str1E<gt> and E<lt>str2E<gt> are equal $ B<./string_comp ABC AB> # \(aqC\(aq is ASCII 67; \(aqC\(aq - \(aq\0\(aq = 67 E<lt>str1E<gt> is greater than E<lt>str2E<gt> (67) $ B<./string_comp ABA ABZ> # \(aqA\(aq is ASCII 65; \(aqZ\(aq is ASCII 90 E<lt>str1E<gt> is less than E<lt>str2E<gt> (-25) $ B<./string_comp ABJ ABC> E<lt>str1E<gt> is greater than E<lt>str2E<gt> (7) $ .B</string_comp $\(aq\e201\(aq A> # 0201 - 0101 = 0100 (or 64 decimal) E<lt>str1E<gt> is greater than E<lt>str2E<gt> (64)
fr: $ B<./string_comp ABC ABC> E<lt>str1E<gt> et E<lt>str2E<gt> sont égales $ B<./string_comp ABC AB> # le code ASCII de \(aqC\(aq est 67; \(aqC\(aq - \(aq\0\(aq = 67 E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (67) $ B<./string_comp ABA ABZ> # le code ASCII de \(aqA\(aq est 65; le code ASCII de \(aqZ\(aq est 90 E<lt>str1E<gt> est inférieure à E<lt>str2E<gt> (-25) $ B<./string_comp ABJ ABC> E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (7) $ .B</string_comp $\(aq\e201\(aq A> # 0201 - 0101 = 0100 (ou 64 en décimal) E<lt>str1E<gt> est supérieure à E<lt>str2E<gt> (64)

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The B<strcmp>() function compares the two strings I<s1> and I<s2>. It returns an integer less than, equal to, or greater than zero if I<s1> is found, respectively, to be less than, to match, or be greater than I<s2>.
fr: La fonction B<strcmp>() compare les deux chaînes I<s1> et I<s2>. Elle renvoie un entier inférieur, égal ou supérieur à zéro, si I<s1> est respectivement inférieure, égale ou supérieure à I<s2>.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
