Repository: sebras/manpages-l10n
Catalog: po/*/man3/strerror.3.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: strerror, strerrorname_np, strerrordesc_np, strerror_r, strerror_l - return string describing error number
de: strerror, strerrorname_np, strerrordesc_np, strerror_r, strerror_l - gibt eine Zeichenkette zurück, die den Fehlercode beschreibt

source: SYNOPSIS
de: ÜBERSICHT

source: B<int strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* XSI-compliant */
de: B<int strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* XSI-konform */

source: B<char *strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* GNU-specific */
de: B<char *strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* GNU-spezifisch */

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: The XSI-compliant version is provided if: (_POSIX_C_SOURCE E<gt>= 200112L) && ! _GNU_SOURCE Otherwise, the GNU-specific version is provided.
de: Die XSI-konforme Version wird bereitgestellt, falls: (_POSIX_C_SOURCE E<gt>= 200112L) && ! _GNU_SOURCE Anderenfalls wird die GNU-spezifische Version bereitgestellt.

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<strerror>() function returns a pointer to a string that describes the error code passed in the argument I<errnum>, possibly using the B<LC_MESSAGES> part of the current locale to select the appropriate language. (For example, if I<errnum> is B<EINVAL>, the returned description will be "Invalid argument".) This string must not be modified by the application, but may be modified by a subsequent call to B<strerror>() or B<strerror_l>(). No other library function, including B<perror>(3), will modify this string.
de: Die Funktion B<strerror>() gibt einen Zeiger auf eine Zeichenkette mit der Beschreibung des Fehlercodes für das übergebene Argument I<errnum> zurück. Möglicherweise wertet sie dabei den B<LC_MESSAGES>-Teil der aktuellen Locale aus, um die passende Sprache zu wählen. (Falls beispielsweise I<errnum> B<EINVAL> ist, dann wird die zurückgelieferte Beschreibung »Invalid argument« sein.). Diese Zeichenkette darf nicht von der Anwendung verändert werden, wohl aber von einem nachfolgenden Aufruf von B<strerror>() oder B<strerror_l>(). Diese Zeichenkette wird von keiner anderen Bibliotheksfunktion, inklusive B<perror>(3), verändert.

source: Like B<strerror>(), the B<strerrordesc_np>() function returns a pointer to a string that describes the error code passed in the argument I<errnum>, with the difference that the returned string is not translated according to the current locale.
de: Wie B<strerror>() gibt die Funktion B<strerrordesc_np>() einen Zeiger auf eine Zeichenkette zurück, die den Fehlercode des im Argument I<errnum> übergebenen Fehlers enthält, jedoch mit dem Unterschied, dass die zurückgegebene Zeichenkette nicht anhand der aktuellen Locale übersetzt ist.

source: The B<strerrorname_np>() function returns a pointer to a string containing the name of the error code passed in the argument I<errnum>. For example, given B<EPERM> as an argument, this function returns a pointer to the string "EPERM".
de: Die Funktion B<strerrorname_np>() gibt einen Zeiger auf eine Zeichenkette zurück, die den Namen des im Argument I<errnum> übergebenen Fehlers enthält. Ist beispielsweise B<EPERM> als Argument angegeben, gibt diese Funktion einen Zeiger auf die Zeichenkette »EPERM« zurück.

source: The B<strerror_r>() function is similar to B<strerror>(), but is thread safe. This function is available in two versions: an XSI-compliant version specified in POSIX.1-2001 (available since glibc 2.3.4, but not POSIX-compliant until glibc 2.13), and a GNU-specific version (available since glibc 2.0). The XSI-compliant version is provided with the feature test macros settings shown in the SYNOPSIS; otherwise the GNU-specific version is provided. If no feature test macros are explicitly defined, then (since glibc 2.4) B<_POSIX_C_SOURCE> is defined by default with the value 200112L, so that the XSI-compliant version of B<strerror_r>() is provided by default.
de: Die Funktion B<strerror_r>() ähnelt B<strerror>(), ist aber threadsicher. Diese Funktion ist in zwei Versionen verfügbar: eine in POSIX.1-2001 beschriebene XSI-konforme Version (verfügbar seit Glibc 2.3.4, aber vor Glibc 2.13 nicht POSIX-konform) und eine GNU-spezifische Version (verfügbar seit Glibc 2.0). Die XSI-konforme Version wird durch die in der ÜBERSICHT angegebenen Feature-Test-Makroeinstellungen bereitgestellt; anderenfalls wird die GNU-Version verwendet. Ohne explizit vereinbarte Feature-Test-Makros wird (seit Glibc 2.4) standardmäßig B<_POSIX_C_SOURCE> mit dem Wert 200112L belegt, sodass standardmäßig die XSI-Variante von B<strerror_r>() verwendet wird.

source: The XSI-compliant B<strerror_r>() is preferred for portable applications. It returns the error string in the user-supplied buffer I<buf> of length I<buflen>.
de: Die XSI-konforme B<strerror_r>() ist für portable Anwendungen vorzuziehen. Sie gibt die Fehlerzeichenkette im vom Nutzer bereitgestellten Puffer I<buf> der Länge I<buflen> zurück.

source: The GNU-specific B<strerror_r>() returns a pointer to a string containing the error message. This may be either a pointer to a string that the function stores in I<buf>, or a pointer to some (immutable) static string (in which case I<buf> is unused). If the function stores a string in I<buf>, then at most I<buflen> bytes are stored (the string may be truncated if I<buflen> is too small and I<errnum> is unknown). The string always includes a terminating null byte (\(aq\e0\(aq).
de: Die GNU-spezifische B<strerror_r>() gibt einen Zeiger auf eine Zeichenkette zurück, die die Fehlernachricht enthält. Dies kann entweder ein Zeiger auf eine Zeichenkette sein, die die Funktion in I<buf> speichert, oder ein Zeiger auf irgendeine (unveränderbare statische) Zeichenkette(wobei dann I<buf> nicht genutzt wird). Wenn die Funktion in I<buf> eine Zeichenkette speichert, werden höchstens I<buflen> Bytes gespeichert (die Zeichenkette kann gekürzt werden, wenn I<buflen> zu klein und I<errnum> unbekannt ist). Die Zeichenkette enthält immer ein abschließendes NULL-Byte (\(aq\e0\(aq).

source: B<strerror_l>() is like B<strerror>(), but maps I<errnum> to a locale-dependent error message in the locale specified by I<locale>. The behavior of B<strerror_l>() is undefined if I<locale> is the special locale object B<LC_GLOBAL_LOCALE> or is not a valid locale object handle.
de: B<strerror_l>() verhält sich wie B<strerror>(), aber weist I<errnum> einer locale-abhängigen Fehlermeldung in der durch I<locale> angegebenen Locale zu. Das Verhalten von B<strerror_l>() ist nicht definiert, wenn I<locale> das spezielle Locale-Objekt B<LC_GLOBAL_LOCALE> ist oder kein gültiges Handle für ein Locale-Objekt.

source: RETURN VALUE
de: RÜCKGABEWERT

source: The B<strerror>(), B<strerror_l>(), and the GNU-specific B<strerror_r>() functions return the appropriate error description string, or an "Unknown error nnn" message if the error number is unknown.
de: Die Funktionen B<strerror>(), B<strerror_l>() und die GNU-spezifische B<strerror_r>() geben die entsprechende Zeichenkette mit der Fehlerbeschreibung zurück oder eine Nachricht »Unbekannter Fehler nnn«, wenn die Fehlernummer unbekannt ist.

source: On success, B<strerrorname_np>() and B<strerrordesc_np>() return the appropriate error description string. If I<errnum> is an invalid error number, these functions return NULL.
de: Bei Erfolg geben B<strerrorname_np>() und B<strerrordesc_np>() die entsprechende den Fehler beschreibende Zeichenkette zurück. Falls I<errnum> eine unzulässige Fehlernummer ist, geben diese Funktionen NULL zurück.

source: The XSI-compliant B<strerror_r>() function returns 0 on success. On error, a (positive) error number is returned (since glibc 2.13), or -1 is returned and I<errno> is set to indicate the error (glibc versions before 2.13).
de: Die XSI-konforme Funktion B<strerror_r>() gibt bei Erfolg 0 zurück. Im Fehlerfall wird eine positive Fehlernummer (seit Glibc 2.13) oder -1 zurückgegeben und I<errno> mit einem Wert belegt, der den Fehler angibt (Glibc vor Version 2.13).

source: POSIX.1-2001 and POSIX.1-2008 require that a successful call to B<strerror>() or B<strerror_l>() shall leave I<errno> unchanged, and note that, since no function return value is reserved to indicate an error, an application that wishes to check for errors should initialize I<errno> to zero before the call, and then check I<errno> after the call.
de: POSIX.1-2001 und POSIX.1-2008 verlangen, dass ein erfolgreicher Aufruf von B<strerror>() oder B<strerror_l>() I<errno> unverändert belässt. Sie merken an, dass wegen des nicht definierten Rückgabewerts zur Anzeige eines Fehlers eine Anwendung zur Fehlerprüfung vor dem Aufruf I<errno> auf Null setzen und nach dem Aufruf überprüfen sollte.

source: ERRORS
de: FEHLER

source: The value of I<errnum> is not a valid error number.
de: Der Wert von I<errnum> ist keine gültige Fehlernummer.

source: Insufficient storage was supplied to contain the error description string.
de: Es wurde unzureichender Speicher für die Aufnahme der Fehler-Zeichenkette bereitgestellt.

source: VERSIONS
de: VERSIONEN

source: The B<strerror_l>() function first appeared in glibc 2.6.
de: Die Funktion B<strerror_l>() kamen erstmals in Glibc 2.6 vor.

source: The B<strerrorname_np>() and B<strerrordesc_np>() functions first appeared in glibc 2.32.
de: Die Funktionen B<strerrorname_np>() und B<strerrordesc_np>() kamen erstmals in Glibc 2.32 vor.

source: ATTRIBUTES
de: ATTRIBUTE

source: For an explanation of the terms used in this section, see B<attributes>(7).
de: Siehe B<attributes>(7) für eine Erläuterung der in diesem Abschnitt verwandten Ausdrücke.

source: Interface
de: Schnittstelle

source: Attribute
de: Attribut

source: Value
de: Wert

source: Thread safety
de: Multithread-Fähigkeit

source: CONFORMING TO
de: KONFORM ZU

source: B<strerror>() is specified by POSIX.1-2001, POSIX.1-2008, C89, and C99. B<strerror_r>() is specified by POSIX.1-2001 and POSIX.1-2008.
de: B<strerror>() wird von POSIX.1-2001, POSIX.1-2008, C89 und C99 spezifiziert. B<strerror_r>() wird von POSIX.1-2001 spezifiziert.

source: B<strerror_l>() is specified in POSIX.1-2008.
de: B<strerror_l>() ist in POSIX.1-2008 spezifiziert.

source: The GNU-specific functions B<strerror_r>(), B<strerrorname_np>(), and B<strerrordesc_np>() are nonstandard extensions.
de: Die GNU-spezifischen Funktionen B<strerror_r>(), B<strerrorname_np>() und B<strerrordesc_np>() sind eine nicht standardisierte Erweiterungen.

source: POSIX.1-2001 permits B<strerror>() to set I<errno> if the call encounters an error, but does not specify what value should be returned as the function result in the event of an error. On some systems, B<strerror>() returns NULL if the error number is unknown. On other systems, B<strerror>() returns a string something like "Error nnn occurred" and sets I<errno> to B<EINVAL> if the error number is unknown. C99 and POSIX.1-2008 require the return value to be non-NULL.
de: POSIX.1-2001 gestattet B<strerror>() das Setzen von I<errno> wenn der Aufruf einen Fehler bewirkt, gibt aber nicht vor, welchen Wert die Funktion im Fehlerfall zurückgeben sollte. Auf einigen Systemen gibt B<strerror>() NULL zurück, wenn die Fehlernummer nicht bekannt ist. Auf anderen Systemen gibt B<strerror>() eine Meldung etwa wie »Fehler nnn aufgetreten« und setzt I<errno> auf B<EINVAL>, wenn die Fehlernummer unbekannt ist. C99 und POSIX.1-2008 verlangen, dass der Rückgabewert von NULL verschieden ist.

source: NOTES
de: ANMERKUNGEN

source: The GNU C Library uses a buffer of 1024 characters for B<strerror>(). This buffer size therefore should be sufficient to avoid an B<ERANGE> error when calling B<strerror_r>().
de: Die GNU-C-Bibliothek verwendet einen Puffer von 1024 Zeichen für B<strerror>(). Diese Puffergröße sollte daher ausreichen, um einen Fehler B<ERANGE> beim Aufruf von B<strerror_r>() zu vermeiden.

source: B<strerrorname_np>() and B<strerrordesc_np>() are thread-safe and async-signal-safe.
de: B<strerrorname_np>() und B<strerrordesc_np>() sind weder multithread-fähig noch asynchronsignalsicher.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: B<int strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* XSI-compliant */
de: B<int strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* XSI-konform */

source: B<char *strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* GNU-specific */
de: B<char *strerror_r(int >I<errnum>B<, char *>I<buf>B<, size_t >I<buflen>B<);> /* GNU-spezifisch */

source: The XSI-compliant version is provided if:
de: Die XSI-konforme Version wird bereitgestellt, falls:

source: Otherwise, the GNU-specific version is provided.
de: Anderenfalls wird die GNU-spezifische Version bereitgestellt.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: strerror, strerror_r, strerror_l - return string describing error number
de: strerror, strerror_r, strerror_l - gibt eine Zeichenkette zurück, die den Fehlercode beschreibt

source: The GNU-specific B<strerror_r>() function is a nonstandard extension.
de: Die GNU-spezifische Funktion B<strerror_r>() ist eine nicht standardisierte Erweiterung.

source: The GNU C Library uses a buffer of 1024 characters for B<strerror>(). This buffer size therefore should be sufficient to avoid an B<ERANGE> error when calling B<strerror_r>() and B<strerror_l>().
de: Die GNU-C-Bibliothek verwendet einen Puffer von 1024 Zeichen für B<strerror>(). Diese Puffergröße sollte daher ausreichen, um einen Fehler B<ERANGE> beim Aufruf von B<strerror_r>() und B<strerror_l>() zu vermeiden.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
