Repository: sebras/manpages-l10n
Catalog: po/*/man3/strptime.3.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: strptime - convert a string representation of time to a time tm structure
fr: strptime - Conversion d'une chaîne de dates en une structure tm

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: The B<strptime>() function is the converse of B<strftime>(3); it converts the character string pointed to by I<s> to values which are stored in the "broken-down time" structure pointed to by I<tm>, using the format specified by I<format>.
fr: La fonction B<strptime>() est l’inverse de la fonction B<strftime>(3). Elle convertit la chaîne de caractères pointée par I<s> en une valeur qui est stockée dans la structure I<tm> pointée par l'argument I<tm>, la conversion étant réalisée en suivant les indications contenues dans la chaîne I<format>.

source: The I<format> argument is a character string that consists of field descriptors and text characters, reminiscent of B<scanf>(3). Each field descriptor consists of a B<%> character followed by another character that specifies the replacement for the field descriptor. All other characters in the I<format> string must have a matching character in the input string, except for whitespace, which matches zero or more whitespace characters in the input string. There should be white\%space or other alphanumeric characters between any two field descriptors.
fr: Le paramètre I<format> contient des descripteurs de champ et du texte, rappelant B<scanf>(3). Chaque descripteur consiste en un caractère B<%> suivi d'un second caractère indiquant la substitution pour le descripteur de champ. Tous les autres sont considérés comme du texte, qui doit être présent dans la chaîne fournie en entrée. Toutefois un espace blanc se trouvant dans la chaîne de format peut être mis en correspondance avec zéro ou plusieurs espaces. Il devrait toujours y avoir un espace ou un autre caractère alphanumérique entre deux descripteurs de champ.

source: The B<strptime>() function processes the input string from left to right. Each of the three possible input elements (whitespace, literal, or format) are handled one after the other. If the input cannot be matched to the format string, the function stops. The remainder of the format and input strings are not processed.
fr: La fonction B<strptime>() traite la chaîne d'entrée de gauche à droite. Les trois types d'éléments d'entrée possibles (espace, caractère littéral, format) sont manipulés l'un après l'autre. Si l'entrée ne peut pas être mise en correspondance avec la chaîne de format, la fonction s'arrête. Le reste du format et de la chaîne d'entrée ne sont pas traités.

source: The supported input field descriptors are listed below. In case a text string (such as the name of a day of the week or a month name) is to be matched, the comparison is case insensitive. In case a number is to be matched, leading zeros are permitted but not required.
fr: Les descripteurs applicables sont décrits ci-dessous. Dans le cas d'une chaîne de caractères (comme le nom d’un jour de la semaine ou d’un mois), la comparaison ne tient pas compte des majuscules/minuscules. Dans le cas d'un nombre, les zéros au début sont autorisés mais pas obligatoires.

source: The B<%> character.
fr: Le caractère B<%>

source: B<%a> or B<%A>
fr: B<%a> ou B<%A>

source: The name of the day of the week according to the current locale, in abbreviated form or the full name.
fr: Le jour de la semaine en utilisant les noms correspondants à la localisation. Les noms abrégés ou entiers peuvent être utilisés.

source: B<%b> or B<%B> or B<%h>
fr: B<%b> ou B<%B> ou B<%h>

source: The month name according to the current locale, in abbreviated form or the full name.
fr: Le mois en utilisant les noms correspondants à la localisation. Les noms abrégés ou entiers peuvent être utilisés.

source: The date and time representation for the current locale.
fr: La date et l'heure en utilisant le format de la localisation.

source: The century number (0\(en99).
fr: Le numéro de siècle [B<0>,B<99>].

source: B<%d> or B<%e>
fr: B<%d> ou B<%e>

source: The day of month (1\(en31).
fr: Le jour du mois [B<1>,B<31>]

source: Equivalent to B<%m/%d/%y>. (This is the American style date, very confusing to non-Americans, especially since B<%d/%m/%y> is widely used in Europe. The ISO 8601 standard format is B<%Y-%m-%d>.)
fr: La date, ainsi\ : B<%m/%d/%y>. C'est la date au format américain, très gênante dans les autres pays, notamment en Europe où la notation B<%d/%m/%y> est plus souvent utilisée. Le format standard ISO 8601 est B<%Y-%m-%d>.

source: The hour (0\(en23).
fr: L'heure [B<0>,B<23>].

source: The hour on a 12-hour clock (1\(en12).
fr: L'heure sur 12 heures [B<1>,B<12>].

source: The day number in the year (1\(en366).
fr: Le numéro du jour dans l'année [B<1>,B<366>].

source: The month number (1\(en12).
fr: Le numéro du mois [B<1>,B<12>].

source: The minute (0\(en59).
fr: La minute [B<0>,B<59>].

source: Arbitrary whitespace.
fr: Un espace blanc quelconque

source: The locale's equivalent of AM or PM. (Note: there may be none.)
fr: Équivalent local de AM ou PM (éventuellement rien).

source: The 12-hour clock time (using the locale's AM or PM). In the POSIX locale equivalent to B<%I:%M:%S %p>. If I<t_fmt_ampm> is empty in the B<LC_TIME> part of the current locale, then the behavior is undefined.
fr: L'heure sur 12 heures avec l'équivalent local de AM ou PM. Dans la localisation POSIX, équivalent à B<%I:%M:%S %p>. Si le champ I<t_fmt_ampm> de la catégorie B<LC_TIME> de la localisation est vide, le comportement est indéfini.

source: Equivalent to B<%H:%M>.
fr: Équivalent de B<%H:%M>.

source: The second (0\(en60; 60 may occur for leap seconds; earlier also 61 was allowed).
fr: Les secondes [B<0>,B<60>], B<60> peut être utilisé pour les secondes de rattrapage ; B<61> était possible antérieurement.

source: Equivalent to B<%H:%M:%S>.
fr: Équivalent de B<%H:%M:%S>.

source: The week number with Sunday the first day of the week (0\(en53). The first Sunday of January is the first day of week 1.
fr: Le numéro de la semaine [B<0>,B<53>] avec dimanche pour premier jour de la semaine. Le premier dimanche de janvier est le premier jour de la semaine B<1>.

source: The ordinal number of the day of the week (0\(en6), with Sunday = 0.
fr: Le numéro du jour dans la semaine [B<0>,B<6>], B<0> correspondant au dimanche.

source: The week number with Monday the first day of the week (0\(en53). The first Monday of January is the first day of week 1.
fr: Le numéro de la semaine [B<0>,B<53>] avec lundi pour premier jour de la semaine. Le premier lundi de janvier est le premier jour de la semaine B<1>.

source: The date, using the locale's date format.
fr: La date, en utilisant le format usuel de la localisation.

source: The time, using the locale's time format.
fr: L'heure, en utilisant le format usuel de la localisation.

source: The year within century (0\(en99). When a century is not otherwise specified, values in the range 69\(en99 refer to years in the twentieth century (1969\(en1999); values in the range 00\(en68 refer to years in the twenty-first century (2000\(en2068).
fr: L'année dans le siècle [B<0>,B<99>]. Lorsque le siècle n'est pas indiqué par une autre conversion, les années B<69> à B<99> sont considérées comme étant du vingtième siècle (1969 à 1999), et les années B<00> à B<68> du vingt-et-unième siècle (2000-2068).

source: The year, including century (for example, 1991).
fr: L'année en incluant le siècle (par exemple, 1996)

source: Some field descriptors can be modified by the E or O modifier characters to indicate that an alternative format or specification should be used. If the alternative format or specification does not exist in the current locale, the unmodified field descriptor is used.
fr: Certains descripteurs peuvent être complétés par les caractères modificateurs E et O, indiquant qu'il faut employer un autre format ou une autre spécification. Si cet autre format, ou cette autre conversion n'est pas disponible dans la localisation en cours, le descripteur n'est pas modifié.

source: The E modifier specifies that the input string may contain alternative locale-dependent versions of the date and time representation:
fr: Le modificateur E indique que la chaîne d'entrée peut contenir des versions différentes de la date et de l'heure, en fonction de la localisation\ :

source: The locale's alternative date and time representation.
fr: Une représentation différente de la date et de l'heure.

source: The name of the base year (period) in the locale's alternative representation.
fr: Le nom de l'année de base (période) dans la représentation locale alternative.

source: The locale's alternative date representation.
fr: Une autre représentation de la date.

source: The locale's alternative time representation.
fr: Une autre représentation de l'heure.

source: The offset from B<%EC> (year only) in the locale's alternative representation.
fr: Le décalage (en année) par rapport à l'année B<%EC> dans la représentation locale alternative.

source: The full alternative year representation.
fr: La représentation alternative complète de l'année.

source: The O modifier specifies that the numerical input may be in an alternative locale-dependent format:
fr: Le modificateur O indique que les saisies numériques peuvent être effectuées dans un format différent, dépendant de la localisation.

source: The day of the month using the locale's alternative numeric symbols; leading zeros are permitted but not required.
fr: Le jour du mois en utilisant les symboles numériques alternatifs. Les zéros en tête sont permis mais pas obligatoires.

source: The hour (24-hour clock) using the locale's alternative numeric symbols.
fr: L'heure, sur 24 heures, utilisant les symboles numériques alternatifs.

source: The hour (12-hour clock) using the locale's alternative numeric symbols.
fr: L'heure, sur 12 heures, utilisant les symboles numériques alternatifs.

source: The month using the locale's alternative numeric symbols.
fr: Le numéro du mois en utilisant les symboles numériques alternatifs.

source: The minutes using the locale's alternative numeric symbols.
fr: Les minutes en utilisant les symboles numériques alternatifs.

source: The seconds using the locale's alternative numeric symbols.
fr: Les secondes en utilisant les symboles numériques alternatifs..

source: The week number of the year (Sunday as the first day of the week) using the locale's alternative numeric symbols.
fr: Le numéro de la semaine en utilisant les symboles numériques alternatifs. Dimanche premier jour de la semaine.

source: The week number of the year (Monday as the first day of the week) using the locale's alternative numeric symbols.
fr: Le numéro du jour de la semaine en utilisant les symboles numériques alternatifs, en commençant le lundi.

source: The year (offset from B<%C>) using the locale's alternative numeric symbols.
fr: L'année (ou décalage par rapport à B<%C>) en utilisant les symboles numériques régionaux alternatifs.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: The return value of the function is a pointer to the first character not processed in this function call. In case the input string contains more characters than required by the format string, the return value points right after the last consumed input character. In case the whole input string is consumed, the return value points to the null byte at the end of the string. If B<strptime>() fails to match all of the format string and therefore an error occurred, the function returns NULL.
fr: La fonction B<strptime>() renvoie un pointeur sur le premier caractère de la chaîne I<s> n'ayant pas été traité. Dans le cas où la chaîne de saisie est plus longue que ce que réclame le format, la valeur renvoyée pointe juste après le dernier caractère d'entrée ayant été analysé. Si toute la chaîne a été traitée, le pointeur est dirigé sur l’octet NULL en fin de chaîne. Si B<strptime>() n'arrive pas à effectuer toutes les conversions, elle renvoie NULL.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: In principle, this function does not initialize I<tm> but stores only the values specified. This means that I<tm> should be initialized before the call. Details differ a bit between different UNIX systems. The glibc implementation does not touch those fields which are not explicitly specified, except that it recomputes the I<tm_wday> and I<tm_yday> field if any of the year, month, or day elements changed.
fr: En principe cette fonction n'initialise pas I<tm>, mais n'y stocke que les valeurs lues. Cela signifie que le contenu de I<tm> doit être initialisé avant l'appel. Les détails diffèrent suivant les systèmes UNIX. L'implémentation de la bibliothèque glibc ne modifie pas les champs non mentionnés explicitement, sauf I<tm_wday>, et I<tm_yday> qui sont recalculés si un champ d'année, de mois ou de jour est modifié.

source: The \(aqy\(aq (year in century) specification is taken to specify a year in the range 1950\(en2049 by glibc 2.0. It is taken to be a year in 1969\(en2068 since glibc 2.1.
fr: La conversion «\ y\ » (année dans le siècle) est toujours considérée comme appartenant à l'intervalle [1950,2049] par la glibc 2.0, et [1969,2068] par la glibc 2.1.

source: Glibc notes
fr: Notes de la glibc

source: For reasons of symmetry, glibc tries to support for B<strptime>() the same format characters as for B<strftime>(3). (In most cases, the corresponding fields are parsed, but no field in I<tm> is changed.) This leads to
fr: Pour des raisons de symétrie, la glibc essaye d'offrir pour B<strptime>() les mêmes caractères de formatage que ceux de B<strftime>(3) (dans la plupart des cas, les champs sont lus mais aucun membre de I<tm> n'est modifié). Ceci conduit à\ :

source: Equivalent to B<%Y-%m-%d>, the ISO 8601 date format.
fr: Équivalent à B<%Y-%m-%d>, le format ISO 8601 pour la date.

source: The year corresponding to the ISO week number, but without the century (0\(en99).
fr: L'année correspondant au numéro de semaine ISO, sans le siècle [B<0>,B<99>].

source: The year corresponding to the ISO week number. (For example, 1991.)
fr: L'année correspondant au numéro de semaine ISO (par exemple 1991).

source: The day of the week as a decimal number (1\(en7, where Monday = 1).
fr: Le numéro du jour de la semaine [B<1>,B<7>], B<1> correspondant au lundi.

source: The ISO 8601:1988 week number as a decimal number (1\(en53). If the week (starting on Monday) containing 1 January has four or more days in the new year, then it is considered week 1. Otherwise, it is the last week of the previous year, and the next week is week 1.
fr: Le numéro de semaine ISO 8601:1988 [B<1>,B<53>]. Si la semaine (commençant lundi) contenant le 1er janvier a quatre jours ou plus de la nouvelle année, elle est comptée en semaine B<1>. Sinon elle est considérée comme dernière semaine de l'année précédente, et c'est la suivante qui est la semaine B<1>.

source: An RFC-822/ISO 8601 standard timezone specification.
fr: Spécification standard RFC-822/ISO 8601 pour le fuseau horaire.

source: The timezone name.
fr: Le nom du fuseau horaire.

source: Similarly, because of GNU extensions to B<strftime>(3), B<%k> is accepted as a synonym for B<%H>, and B<%l> should be accepted as a synonym for B<%I>, and B<%P> is accepted as a synonym for B<%p>. Finally
fr: De même, à cause des extensions GNU de B<strftime>(3), B<%k> est accepté en synonyme de B<%H>, et B<%l> est accepté comme synonyme de B<%I>, et B<%P> en synonyme de B<%p>. Enfin,

source: The number of seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC). Leap seconds are not counted unless leap second support is available.
fr: Le nombre de secondes depuis l'époque, 1er\ janvier 1970 à\ 00:00:00 (UTC). Les secondes de rattrapage ne sont pas comptées, sauf si une prise en charge spécifique est disponible.

source: The glibc implementation does not require whitespace between two field descriptors.
fr: L'implémentation de la glibc n'impose pas la présence de caractères blancs entre deux descripteurs de champs.

source: EXAMPLES
fr: EXEMPLES

source: The following example demonstrates the use of B<strptime>() and B<strftime>(3).
fr: L'exemple suivant montre l'utilisation de B<strptime>() et B<strftime>(3).

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: B<#define _XOPEN_SOURCE> /* See feature_test_macros(7) */
fr: B<#define _XOPEN_SOURCE> /* Consultez feature_test_macros(7) */

source: The broken-down time structure I<tm> is defined in I<E<lt>time.hE<gt>> as follows:
fr: Les champs de la structure I<tm> définie dans I<E<lt>time.hE<gt>> sont\ :

source: struct tm { int tm_sec; /* Seconds (0-60) */ int tm_min; /* Minutes (0-59) */ int tm_hour; /* Hours (0-23) */ int tm_mday; /* Day of the month (1-31) */ int tm_mon; /* Month (0-11) */ int tm_year; /* Year - 1900 */ int tm_wday; /* Day of the week (0-6, Sunday = 0) */ int tm_yday; /* Day in the year (0-365, 1 Jan = 0) */ int tm_isdst; /* Daylight saving time */ };
fr: struct tm { int tm_sec; /* secondes [0,60] */ int tm_min; /* minutes [0,59] */ int tm_hour; /* heures [0,23] */ int tm_mday; /* jour du mois [1,31] */ int tm_mon; /* mois [0,11] */ int tm_year; /* année - 1900 */ int tm_wday; /* jour de la semaine [0,6] où Dimanche = 0 */ int tm_yday; /* jour de l'année [0,365] où 1er Jan = 0 */ int tm_isdst; /* décalage été/hiver */ };

source: For more details on the I<tm> structure, see B<ctime>(3).
fr: Pour plus de détails sur la structure I<tm>, consultez B<ctime>(3).

source: The ordinal number of the day of the week (Sunday=0), using the locale's alternative numeric symbols.
fr: Le numéro du jour dans la semaine en utilisant les symboles numériques alternatifs, le dimanche étant zéro.

source: CONFORMING TO
fr: CONFORMITÉ

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<#define _XOPEN_SOURCE> /* glibc2 needs this */
fr: B<#define _XOPEN_SOURCE> /* Nécessaire pour la glibc2 */

source: strptime function
fr: fonction strptime

source: \fLstrptime()\fR \(em date and time conversion
fr: \fLstrptime()\fR \(em conversion de date et d'heure

source: The B<strptime(\|)> function is the converse function to B<strftime(\|)> and converts the character string pointed to by I<s> to values which are stored in the B<tm> structure pointed to by I<tm>, using the format specified by I<format>. Here I<format> is a character string that consists of field descriptors and text characters, reminiscent of B<scanf>(3). Each field descriptor consists of a B<%> character followed by another character that specifies the replacement for the field descriptor. All other characters in the I<format> string must have a matching character in the input string, except for whitespace, which matches zero or more whitespace characters in the input string.
fr: La fonction B<strptime(\|)> est la fonction inverse de la fonction B<strftime(\|)> et convertit la chaîne de caractères pointée par I<s> en valeurs stockées dans la structure B<tm> pointée par I<tm> en utilisant le format indiqué dans I<format>. I<format> est une chaîne de caractères composée de descripteurs de champ et de texte, rappelant B<scanf>(3). Chaque descripteur de champ consiste en un caractère « % » suivi d'un autre caractère qui indique le remplacement à effectuer pour le descripteur de champ. Tous les autres caractères dans la chaîne I<format> doivent avoir un caractère correspondant dans la chaîne d'entrée, excepté pour les espaces qui peuvent correspondre à zéro ou plusieurs caractères espace dans la chaîne d'entrée.

source: The B<strptime()> function processes the input string from left to right. Each of the three possible input elements (whitespace, literal, or format) are handled one after the other. If the input cannot be matched to the format string the function stops. The remainder of the format and input strings are not processed.
fr: La fonction B<strptime>() traite la chaîne d'entrée de gauche à droite. Les trois types d'éléments d'entrée possibles (espace, caractère littéral, format) sont manipulés l'un après l'autre. Si l'entrée ne peut pas être mise en correspondance avec la chaîne de format, la fonction s'arrête. Le reste du format et de la chaîne d'entrée ne sont pas traités.

source: The supported input field descriptors are listed below. In case a text string (such as a weekday or month name) is to be matched, the comparison is case insensitive. In case a number is to be matched, leading zeros are permitted but not required.
fr: Les descripteurs applicables sont décrits ci-dessous. Dans le cas d'une chaîne de caractères (comme le nom d’un jour de la semaine ou d’un mois), la comparaison ne tient pas compte des majuscules/minuscules. Dans le cas d'un nombre, les zéros au début sont autorisés mais pas obligatoires.

source: The weekday name according to the current locale, in abbreviated form or the full name.
fr: Le jour de la semaine correspondants à la localisation, en abrégé ou en totalité.

source: The century number (0-99).
fr: Le numéro de siècle [B<0>,B<99>].

source: The day of month (1-31).
fr: Le jour du mois [B<1>,B<31>].

source: Equivalent to %m/%d/%y. (This is the American style date, very confusing to non-Americans, especially since %d/%m/%y is widely used in Europe. The ISO 8601 standard format is %Y-%m-%d.)
fr: Équivalent de B<%m/%d/%y>. C'est la date au format américain, très gênante dans d'autres pays, notamment en Europe où la notation B<%d/%m/%y> est très répandue. Le format standard ISO 8601 est B<%Y-%m-%d>.

source: The hour (0-23).
fr: L'heure [B<0>,B<23>].

source: The hour on a 12-hour clock (1-12).
fr: L'heure en format B<12> heures [B<1>,B<12>]

source: The day number in the year (1-366).
fr: Le numéro du jour dans l'année [B<1>,B<366>].

source: The month number (1-12).
fr: Le numéro du mois [B<1>,B<12>].

source: The minute (0-59).
fr: La minute [B<0>,B<59>].

source: B<%n> or B<%t>
fr: B<%n> ou B<%t>

source: The locale's equivalent of AM or PM. (Note: there may be none.)
fr: Équivalent local de AM ou PM (éventuellement rien).

source: The 12-hour clock time (using the locale's AM or PM). In the POSIX locale equivalent to %I:%M:%S %p. If I<t_fmt_ampm> is empty in the LC_TIME part of the current locale then the behaviour is undefined.
fr: L'heure sur 12 heures avec l'équivalent local de AM ou PM. Équivalent dans la localisation POSIX à B<%I:%M:%S %p>. Si le champ I<t_fmt_ampm> de la catégorie B<LC_TIME> de la localisation est vide, le comportement est indéfini.
