Repository: sebras/manpages-l10n
Catalog: po/*/man3/strptime.3.po
Languages: fr

source: Equivalent to %H:%M.
fr: Équivalent de B<%H:%M>.

source: The second (0-60; 60 may occur for leap seconds; earlier also 61 was allowed).
fr: Les secondes [B<0>,B<60>], B<60> étant utilisé pour des secondes de rattrapage ; B<61> étant autorisé antérieurement.

source: Equivalent to %H:%M:%S.
fr: Équivalent de B<%H:%M:%S>.

source: The week number with Sunday the first day of the week (0-53). The first Sunday of January is the first day of week 1.
fr: Le numéro de la semaine [B<0>,B<53>], le premier dimanche de janvier étant le premier jour de la semaine B<1>.

source: The weekday number (0-6) with Sunday = 0.
fr: Le numéro du jour dans la semaine [B<0>,B<6>], le B<0> correspondant au dimanche.

source: The week number with Monday the first day of the week (0-53). The first Monday of January is the first day of week 1.
fr: Le numéro de la semaine [B<0>,B<53>] avec lundi pour premier jour de la semaine et le premier lundi de janvier étant le premier jour de la semaine B<1>.

source: The year within century (0-99). When a century is not otherwise specified, values in the range 69-99 refer to years in the twentieth century (1969-1999); values in the range 00-68 refer to years in the twenty-first century (2000-2068).
fr: L'année sans le siècle [B<0>,B<99>]. Lorsque le siècle n'est pas indiqué par une autre conversion, les années B<69> à B<99> sont considérées comme étant du vingtième siècle (de 1969 à 1999), et les années B<00> à B<68> du vingt-et-unième siècle (de 2000 à 2068).

source: Some field descriptors can be modified by the E or O modifier characters to indicate that an alternative format or specification should be used. If the alternative format or specification does not exist in the current locale, the unmodified field descriptor is used.
fr: Certains descripteurs peuvent être complétés par les caractères modificateurs B<E> et B<O>, indiquant qu'il faut employer un autre format ou une autre spécification. Si cet autre format, ou cette autre conversion n'est pas disponible dans la localisation en cours, le descripteur n'est pas modifié.

source: The offset from %EC (year only) in the locale's alternative representation.
fr: Le décalage (en année) par rapport à l'année B<%EC> dans la représentation alternative de la locale.

source: The number of the weekday (Sunday=0) using the locale's alternative numeric symbols.
fr: Le numéro du jour dans la semaine, le dimanche étant B<0>, en utilisant les symboles numériques alternatifs de la locale.

source: The year (offset from %C) using the locale's alternative numeric symbols.
fr: L'année (ou décalage par rapport à B<%C>) en utilisant les symboles numériques alternatifs de la locale.

source: struct tm { int tm_sec; /* seconds */ int tm_min; /* minutes */ int tm_hour; /* hours */ int tm_mday; /* day of the month */ int tm_mon; /* month */ int tm_year; /* year */ int tm_wday; /* day of the week */ int tm_yday; /* day in the year */ int tm_isdst; /* daylight saving time */ };
fr: struct tm { int tm_sec; /* secondes */ int tm_min; /* minutes */ int tm_hour; /* heures */ int tm_mday; /* jour du mois */ int tm_mon; /* mois */ int tm_year; /* année */ int tm_wday; /* jour de la semaine */ int tm_yday; /* jour de l'année */ int tm_isdst; /* décalage été/hiver */ };

source: The return value of the function is a pointer to the first character not processed in this function call. In case the input string contains more characters than required by the format string the return value points right after the last consumed input character. In case the whole input string is consumed the return value points to the NUL byte at the end of the string. If B<strptime()> fails to match all of the format string and therefore an error occurred the function returns B<NULL>.
fr: La valeur renvoyée par la fonction est un pointeur sur le premier caractère de la chaîne qui n'a pas été traité. Dans le cas où la chaîne en entrée est plus longue que ce que réclame le format, la valeur renvoyée pointe juste après le dernier caractère d'entrée ayant été traité. Si toute la chaîne a été traitée, le pointeur est dirigé sur l’octet NULL en fin de chaîne. Si B<strptime>() n'arrive pas à effectuer toutes les conversions présentes dans la chaîne de formatage, la fonction renvoie NULL indiquant qu'une erreur s'est produite.

source: GNU EXTENSIONS
fr: EXTENSIONS GNU

source: For reasons of symmetry, glibc tries to support for B<strptime> the same format characters as for B<strftime.> (In most cases the corresponding fields are parsed, but no field in I<tm> is changed.) This leads to
fr: Pour des raisons de symétrie, la glibc essaye d'offrir pour B<strptime> les mêmes caractères de formatage que ceux de B<strftime> (dans la plupart des cas, les champs sont lus mais aucun membre de I<tm> n'est modifié). Ceci conduit à\ :

source: The year corresponding to the ISO week number, but without the century (0-99).
fr: L'année correspondant au numéro de semaine ISO mais sans le siècle [B<0>,B<99>].

source: The year corresponding to the ISO week number. (For example, 1991.)
fr: L'année correspondant au numéro de semaine ISO (par exemple 1991).

source: The day of the week as a decimal number (1-7, where Monday = 1).
fr: Le numéro du jour de la semaine [B<1>,B<7>], lundi valant B<1>.

source: The ISO 8601:1988 week number as a decimal number (1-53). If the week (starting on Monday) containing 1 January has four or more days in the new year, then it is considered week 1. Otherwise, it is the last week of the previous year, and the next week is week 1.
fr: Le numéro de semaine ISO 8601:1988 [B<1>,B<53>]. Si la semaine (commençant lundi) contenant le 1er janvier a quatre jours ou plus que la nouvelle année, elle est comptée en semaine B<1>. Sinon elle est considérée comme dernière semaine de l'année précédente, et c'est la suivante qui est la semaine B<1>.

source: An RFC-822/ISO 8601 standard time zone specification.
fr: Spécification standard RFC-822/ISO 8601 pour le fuseau horaire.

source: Similarly, because of GNU extensions to I<strftime>, %k is accepted as a synonym for %H, and %l should be accepted as a synonym for %I, and %P is accepted as a synonym for %p. Finally
fr: De même, à cause des extensions GNU de B<strftime>(3), B<%k> est accepté en synonyme de B<%H>, B<%l> est accepté comme synonyme de B<%I> et B<%P> en synonyme de B<%p>. Enfin,

source: The number of seconds since the epoch, i.e., since 1970-01-01 00:00:00 UTC. Leap seconds are not counted unless leap second support is available.
fr: Le nombre de secondes depuis l'époque, 1er\ janvier 1970 à\ 00:00:00 (UTC). Les secondes de rattrapage ne sont pas comptées, sauf si une prise en charge spécifique est disponible.

source: In principle, this function does not initialize B<tm> but only stores the values specified. This means that B<tm> should be initialized before the call. Details differ a bit between different Unix systems. The GNU libc implementation does not touch those fields which are not explicitly specified, except that it recomputes the I<tm_wday> and I<tm_yday> field if any of the year, month, or day elements changed.
fr: En principe cette fonction n'initialise pas I<tm> mais n'y stocke que les valeurs lues. Cela signifie que le contenu de I<tm> doit être initialisé avant l'appel. Les détails diffèrent suivant les systèmes UNIX. L'implémentation de la bibliothèque libc GNU ne modifie pas les champs non mentionnés explicitement, sauf pour I<tm_wday> et I<tm_yday> qui sont recalculés si un champ d'année, de mois ou de jour est modifié.

source: This function is available since libc 4.6.8. Linux libc4 and libc5 includes define the prototype unconditionally; glibc2 includes provide a prototype only when _XOPEN_SOURCE or _GNU_SOURCE are defined.
fr: Cette fonction est disponible depuis la glibc 4.6.8. Les en-têtes des bibliothèques Linux libc4 et libc5 définissent le prototype de façon inconditionnelle ; la bibliothèque glibc2 ne fournit le prototype que si les constantes B<_XOPEN_SOURCE> ou B<_GNU_SOURCE> sont définies.

source: Before libc 5.4.13 whitespace (and the 'n' and 't' specifications) was not handled, no 'E' and 'O' locale modifier characters were accepted, and the 'C' specification was a synonym for the 'c' specification.
fr: Avant la libc 5.4.13, les espaces (et les conversions « n » et « t ») n'étaient pas prises en charge ; les caractères de modification de locale « E » et « O » n'étaient pas acceptés et la spécification « C » était un synonyme de « c ».

source: The 'y' (year in century) specification is taken to specify a year in the 20th century by libc4 and libc5. It is taken to be a year in the range 1950-2049 by glibc 2.0. It is taken to be a year in 1969-2068 since glibc 2.1.
fr: La conversion «\ y\ » (année dans le siècle) détermine une année du 20ème siècle dans la libc4 et la libc5. L'année est comprise entre 1950 et 2049 dans la glibc 2.0 et entre 1969 et 2068 depuis la glibc 2.1.

source: EXAMPLE
fr: EXEMPLE

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
