Repository: sebras/manpages-l10n
Catalog: po/*/man3/strtoul.3.po
Languages: nl

source: NAME
nl: NAAM

source: strtoul, strtoull, strtouq - convert a string to an unsigned long integer
nl: strtoul, strtoull, strtouq - converteert een tekenreeks naar een positief lang geheel getal

source: SYNOPSIS
nl: SAMENVATTING

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: DESCRIPTION
nl: BESCHRIJVING

source: The B<strtoul>() function converts the initial part of the string in I<nptr> to an I<unsigned long> value according to the given I<base>, which must be between 2 and 36 inclusive, or be the special value 0.
nl: De B<strtuol>() functie converteert het initiële deel van een tekenreeks in I<nptr> naar een positief lang geheel getal met als I<grondtal> als grondtal, grondtal moet liggen tussen 2 en 36 (inclusief deze grenzen), of de speciale waarde 0.

source: The string may begin with an arbitrary amount of white space (as determined by B<isspace>(3)) followed by a single optional \(aq+\(aq or \(aq-\(aq sign. If I<base> is zero or 16, the string may then include a "0x" prefix, and the number will be read in base 16; otherwise, a zero I<base> is taken as 10 (decimal) unless the next character is \(aq0\(aq, in which case it is taken as 8 (octal).
nl: De tekenreeks mag beginnen met een willekeurig aantal witruimtes (zoals bepaald door B<isspace>(3)) gevolgd door een enkel optioneel teken \(aq+\(aq or \(aq-\(aq. Als het I<grondtal> nul of 16 is, dan mag de string "0x" of "0X" bevatten en wordt het getal gelezen met 16 als grondtal; in andere gevallen zal het I<grondtal> 0 geïnterpreteerd worden als 10 (decimaal) behalve als het volgende teken \(aq0\(aq is, in welk geval het geïnterpreteerd wordt als 8 (octaal).

source: The remainder of the string is converted to an I<unsigned long> value in the obvious manner, stopping at the first character which is not a valid digit in the given base. (In bases above 10, the letter \(aqA\(aq in either uppercase or lowercase represents 10, \(aqB\(aq represents 11, and so forth, with \(aqZ\(aq representing 35.)
nl: De rest van de tekenreeks zal geconverteerd worden naar een I<long> waarde in de voor de hand liggende manier, eindigende bij het eerste ongeldige teken in het gekozen grondtal. (Grondtallen groter dan 10, vertegenwoordigd de letter \(aqA\(aq in zowel hoofd- als kleine letter 10, \(aqB\(aq vertegenwoordigd 11, en zo voorts, met \(aqZ\(aq vertegenwoordigde 35.)

source: If I<endptr> is not NULL, B<strtoul>() stores the address of the first invalid character in I<*endptr>. If there were no digits at all, B<strtoul>() stores the original value of I<nptr> in I<*endptr> (and returns 0). In particular, if I<*nptr> is not \(aq\e0\(aq but I<**endptr> is \(aq\e0\(aq on return, the entire string is valid.
nl: Zodra I<endptr> niet NULL is, zal B<strtoul> het adres van het eerste ongeldige teken in I<*endptr> opslaan. Als er geen enkel cijfer was dan bewaart B<strtoul>() de originele waarde van I<nptr> in I<*endptr> (en geeft een 0 terug). In het bijzonder, als I<*nptr> niet gelijk is aan \(aq\e0\(aq maar I<**endptr> is \(aq\e0\(aq bij terugkeer, dan is de hele tekenreeks geldig.

source: The B<strtoull>() function works just like the B<strtoul>() function but returns an I<unsigned long long> value.
nl: De B<strtoull>() functie werkt net als de B<strtoul>() functie maar geeft een positief-lang-lang gehele waarde terug.

source: RETURN VALUE
nl: EIND WAARDE

source: The B<strtoul>() function returns either the result of the conversion or, if there was a leading minus sign, the negation of the result of the conversion represented as an unsigned value, unless the original (nonnegated) value would overflow; in the latter case, B<strtoul>() returns B<ULONG_MAX> and sets I<errno> to B<ERANGE>. Precisely the same holds for B<strtoull>() (with B<ULLONG_MAX> instead of B<ULONG_MAX>).
nl: De B<strtoul>() functie retourneert het resultaat van een conversie, of als er sprake was van een leidend min-teken, de negatie van het resultaat van de conversie gerepresenteerd als een positieve waarde,, behalve als de originele (niet-negatie) waarde zou onderlopen; in het laatste geval, retourneert B<strtoul>() B<ULONG_MAX> en zet I<errno> op B<ERANGE>. Precies hetzelfde is geldig voor B<strtoull>() (met B<ULLONG_MAX> in plaats van B<ULONG_MAX>).

source: ERRORS
nl: FOUTEN

source: (not in C99) The given I<base> contains an unsupported value.
nl: (niet in C99) Het gegeven I<grondtal> bevat een niet ondersteunde waarde.

source: The resulting value was out of range.
nl: De resulterende waarde was buiten bereik.

source: The implementation may also set I<errno> to B<EINVAL> in case no conversion was performed (no digits seen, and 0 returned).
nl: De implementatie mag I<errno> zetten op B<EINVAL> in het geval dat er geen omzetting plaats vond (geen cijfers gezien en 0 geretourneerd).

source: ATTRIBUTES
nl: ATTRIBUTEN

source: For an explanation of the terms used in this section, see B<attributes>(7).
nl: Voor een uitleg van de termen in deze sectie, zie B<attributes>(7).

source: Attribute
nl: Attribuut

source: Value
nl: Waarde

source: Thread safety
nl: Thread veiligheid

source: MT-Safe locale
nl: MT-Safe taalgebied

source: NOTES
nl: OPMERKINGEN

source: Since B<strtoul>() can legitimately return 0 or B<ULONG_MAX> (B<ULLONG_MAX> for B<strtoull>()) on both success and failure, the calling program should set I<errno> to 0 before the call, and then determine if an error occurred by checking whether I<errno> has a nonzero value after the call.
nl: Omdat B<strtoul>() legitiem 0, B<ULONG_MAX>, of B<ULONG_MIN> (B<LLONG_MAX> of B<LLONG_MIN> voor B<strtoull>()) kan retourneren bij zowel succes of falen, moet het aanroepende programma I<errno> op 0 zetten voor de aanroep, en vervolgens bepalen of een fout optrad door te controleren of I<errno> een niet-nul waarde heeft na de aanroep.

source: In locales other than the "C" locale, other strings may be accepted. (For example, the thousands separator of the current locale may be supported.)
nl: Volgens POSIX.1, in taalgebieden anders dan "C" en "POSIX", mogen deze functies andere, implementatie afhankelijke numerieke tekenreeksen accepteren.

source: BSD also has
nl: BSD heeft ook

source: B<u_quad_t strtouq(const char *>I<nptr>B<, char **>I<endptr>B<, int >I<base>B<);>
nl: B<u_quad_t strtouq(const char *>I<nptr>B<, char **>I<endptr>B<, int >I<grondtal>B<);>

source: with completely analogous definition. Depending on the wordsize of the current architecture, this may be equivalent to B<strtoull>() or to B<strtoul>().
nl: met complete vergelijkbare definitie. Afhankelijk van de woordgrootte van de huidige architectuur, kan dit equivalent zijn aan B<strtoull>() of aan B<strtoul>().

source: Negative values are considered valid input and are silently converted to the equivalent I<unsigned long> value.
nl: Negatieve waarden worden beschouwd als geldige invoer and worden stilzwijgend omgezet naar een equivalente I<unsigned long> waarde.

source: EXAMPLES
nl: VOORBEELDEN

source: See the example on the B<strtol>(3) manual page; the use of the functions described in this manual page is similar.
nl: Zie het voorbeeld in de B<strtol>(3) handleiding; het gebruik van de functies beschreven in deze handleiding is vergelijkbaar.

source: SEE ALSO
nl: ZIE OOK

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: B<unsigned long strtoul(const char *>I<nptr>B<, char **>I<endptr>B<, int >I<base>B<);>
nl: B<unsigned long int strtoul(const char *>I<nptr>B<, char **>I<endptr>B<, int >I<grondtal>B<);>

source: B<unsigned long long strtoull(const char *>I<nptr>B<, char **>I<endptr>B<,> B< int >I<base>B<);>
nl: B<unsigned long long int strtoull(const char *>I<nptr>B<, char **>I<endptr>B<,> B< int >I<grondtal>B<);>

source: _ISOC99_SOURCE || || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
nl: _ISOC99_SOURCE || || /* Glibc versies E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: CONFORMING TO
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: The B<strtoul>() function converts the initial part of the string in I<nptr> to an I<unsigned long int> value according to the given I<base>, which must be between 2 and 36 inclusive, or be the special value 0.
nl: De B<strtoul>() functie converteert het initiële deel van een tekenreeks in I<nptr> naar een positief lang geheel getal met als I<grondtal> als grondtal, welk moet liggen tussen 2 en 36 (inclusief deze grenzen), of de speciale waarde 0.

source: The remainder of the string is converted to an I<unsigned long int> value in the obvious manner, stopping at the first character which is not a valid digit in the given base. (In bases above 10, the letter \(aqA\(aq in either uppercase or lowercase represents 10, \(aqB\(aq represents 11, and so forth, with \(aqZ\(aq representing 35.)
nl: De rest van de tekenreeks zal geconverteerd worden naar een I<unsigned long> waarde in de voor de hand liggende manier, eindigende bij het eerste ongeldige teken in het gekozen grondtal. (Grondtallen groter dan 10, vertegenwoordigd de letter \(aqA\(aq in zowel hoofd- als kleine letter 10, \(aqB\(aq vertegenwoordigd 11, en zo voorts, met \(aqZ\(aq vertegenwoordigde 35.)

source: The B<strtoull>() function works just like the B<strtoul>() function but returns an I<unsigned long long int> value.
nl: De B<strtoull>() functie werkt net als de B<strtoul>() functie maar geeft een I<unsigned long long int> waarde terug.

source: Negative values are considered valid input and are silently converted to the equivalent I<unsigned long int> value.
nl: Negatieve waarden worden beschouwd als geldige invoer and worden stilzwijgend omgezet naar een equivalente I<unsigned long int> waarde.

source: EXAMPLE
nl: VOORBEELD

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
