Repository: sebras/manpages-l10n
Catalog: po/*/man2/adjtimex.2.po
Languages: de, fr, it

source: Interface
de: Schnittstelle
it: Interfaccia

source: Attribute
de: Attribut
fr: Attribut
it: Attributo

source: Value
de: Wert
fr: Valeur
it: Valore

source: Thread safety
de: Multithread-Fähigkeit
fr: Sécurité des threads

source: CONFORMING TO
de: KONFORM ZU
fr: CONFORMITÉ
it: CONFORME A

source: None of these interfaces is described in POSIX.1
de: Keiner dieser Schnittstellen ist in POSIX.1 beschrieben.
fr: Aucune de ces interfaces n'est décrite par POSIX.1
it: Nessuna di queste interfacce è descritta in POSIX.1

source: B<adjtimex>() and B<clock_adjtime>() are Linux-specific and should not be used in programs intended to be portable.
de: B<adjtimex>() und B<clock_adjtime>() sind Linux-spezifisch und sollte nicht in portierbaren Programmen benutzt werden.
fr: B<adjtimex>() et B<clock_adjtime>() sont spécifiques à Linux et ils ne doivent pas être employés dans des programmes destinés à être portés sur d'autres systèmes.
it: B<adjtimex>() e B<clock_adjtime>() sono specifici di Linux e non dovrebbe essere usato in programmi pensati per la portabilità.

source: The preferred API for the NTP daemon is B<ntp_adjtime>().
de: Das bevorzugte API für den NTP-Daemon ist B<ntp_adjtime>().
fr: L'API préférée pour le démon NTP est B<ntp_adjtime>().
it: L'API da preferire per il demone NTP è B<ntp_adjtime>(3).

source: NOTES
de: ANMERKUNGEN
it: NOTE

source: In struct I<timex>, I<freq>, I<ppsfreq>, and I<stabil> are ppm (parts per million) with a 16-bit fractional part, which means that a value of 1 in one of those fields actually means 2^-16 ppm, and 2^16=65536 is 1 ppm. This is the case for both input values (in the case of I<freq>) and output values.
de: Im Struct I<timex> sind I<freq>, I<ppsfreq> und I<stabil> ppm (parts per million, Teile pro Million) mit einem 16-Bit-Bruchteil. Das bedeutet, ein Wert von 1 in diesen Feldern bedeutet tatsächlich 2^-16 ppm und 2^16=65536 ist 1 ppm. Dies ist sowohl für Eingabefelder (für I<freq>) und Ausgabefelder der Fall.
fr: Dans une structure I<timex>, I<freq>, I<ppsfreq> et I<stabil> sont des ppm (parts per million) avec une partie décimale de 16 bits, ce qui veut dire qu'une valeur de 1 dans un de ces champs veut dire en fait 2^-16 ppm et 2^16=65536 vaut 1 ppm. Cela vaut tant pour les valeurs en entrée (dans le cas de I<freq>) que celles en sortie.
it: In struct I<timex>, I<freq>, I<ppsfreq> e I<stabil> sono espressi in ppm (parti per milione) con una parte frazionale di 16-bit, il che significa che il valore 1 in uno di quei campi sta a indicare un valore di 2^-16 ppm, mentre 2^16=65536 significa 1 ppm. Questo vale sia per i valori in input (nel caso di I<freq>) sia per quelli di output.

source: The leap-second processing triggered by B<STA_INS> and B<STA_DEL> is done by the kernel in timer context. Thus, it will take one tick into the second for the leap second to be inserted or deleted.
de: Die von B<STA_INS> und B<STA_DEL> ausgelöste Schaltsekundenverarbeitung wird vom Kernel im Timer-Kontext durchgeführt. Daher wird ein Tick in die Sekunde benötigt, damit die Schaltsekunde eingefügt oder gelöscht wird.
fr: Le traitement du saut de seconde effectué par B<STA_INS> et B<STA_DEL> se fait par le noyau dans le contexte de l’ordonnanceur. Ainsi, il prendra un tic de la seconde pour insérer ou supprimer un saut de seconde.
it: L'elaborazione del secondo intercalare innescato da B<STA_INS> e B<STA_DEL> è fatto dal kernel nell'ambito del timer. Quindi, è allo scoccare esatto di un secondo che il secondo intercalare sarà aggiunto o tolto.

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
it: VEDERE ANCHE

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: On failure, these calls return -1 and set I<errno>.
de: Im Fehlerfall geben diese Aufrufe -1 zurück und setzen I<errno>.
fr: En cas d'échec, ces appels renvoient B<-1> et définissent I<errno>.
it: Se falliscono, queste chiamate restituiscono -1 e impostano I<errno>.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: adjtimex, ntp_adjtime - tune kernel clock
de: adjtimex, ntp_adjtime - Kernel-Uhr einstellen
fr: adjtimex, ntp_adjtime - Régler l'horloge du noyau (kernel clock)
it: adjtimex, ntp_adjtime - regola l'orologio del kernel

source: Linux uses David L. Mills' clock adjustment algorithm (see RFC\ 5905). The system call B<adjtimex>() reads and optionally sets adjustment parameters for this algorithm. It takes a pointer to a I<timex> structure, updates kernel parameters from (selected) field values, and returns the same structure updated with the current kernel values. This structure is declared as follows:
de: Linux verwendet den Algorithmus von David L. Mills für die Einstellung von Uhren (siehe RFC\ 5905). Der Systemaufruf B<adjtimex>() liest und setzt optional Einstellparameter für diesen Algorithmus. Ihm wird ein Zeiger auf eine Struktur I<timex> übergeben. Aus ausgewählten Feldwerten davon aktualisiert er Kernel-Parameter. Abschließend wird die gleiche Struktur mit aus den aktuellen Kernelwerten aktualisierten Parametern zurückgeliefert. Die Struktur ist wie folgt deklariert:
it: Linux usa l'algoritmo di correzione dell'ora di David L. Mill (vedere RFC 5905). La chiamata di sistema B<adjtimex>() legge e può all'occorrenza modificare i parametri di correzione per questo algoritmo. Richiede un puntatore a una struttura I<timex>, aggiorna i parametri del kernel in base ai valori dei campi (selezionati) e restituisce la medesima struttura aggiornata con i valori correnti del kernel. La struttura è dichiarata nel seguento modo:

source: Old-fashioned B<adjtime>(): (gradually) adjust time by value specified in I<buf.offset>, which specifies an adjustment in microseconds.
de: Altertümliches B<adjtime>(): passt die Zeit (graduell) durch den in I<Puffer.offset>, der Anpassungen in Mikrosekunden spezifiziert, festgelegten Wert an.
fr: B<adjtime>() à l'ancienne : ajuster (graduellement) l'heure avec des valeurs spécifiées dans I<buf.offset>, ce qui indique un ajustement en microseconde.
it: Il vecchio B<adjtime>(): (gradualmente) aggiusta il tempo secondo il valore contenuto in I<buf.offset>, che specifica una regolazione in microsecondi.

source: The B<ntp_adjtime>() library function (described in the NTP "Kernel Application Program API", KAPI) is a more portable interface for performing the same task as B<adjtimex>(). Other than the following points, it is identical to B<adjtime>():
de: Die Bibliotheksfunktion B<ntp_adjtime>() (beschrieben in dem NTP »Kernel Application Program API«, KAPI) ist eine portierbarere Schnittstelle für die Erledigung der gleichen Aufgaben wie B<adjtimex>(). Abgesehen von den folgenden Punkten ist sie zu B<adjtime>() identisch:
fr: La fonction de bibliothèque B<ntp_adjtime>() (décrite dans le « Kernel Application Program API », KAPI) est une interface plus portable pour effectuer la même tâche que B<adjtimex>(). À part les points suivants, elle est identique à B<adjtime>() :
it: La funzione di libreria B<ntp_adjtime>() (descritta in NTP "Kernel Application Program API", KAPI) è un'interfaccia più portabile per eseguire lo stesso compito di B<adjtimex>(). A parte i punti seguenti, è identica a B<adjtime>():

source: Neither of these interfaces is described in POSIX.1
de: Keiner dieser Schnittstellen ist in POSIX.1 beschrieben.
fr: Aucune de ces interfaces n'est décrite par POSIX.1
it: Nessuna di queste interfacce è descritta in POSIX.1

source: B<adjtimex>() is Linux-specific and should not be used in programs intended to be portable.
de: B<adjtimex>() ist Linux-spezifisch und sollte nicht in portierbaren Programmen benutzt werden.
fr: B<adjtimex>() est spécifique à Linux, et ne doit pas être employé dans des programmes destinés à être portés sur d'autres systèmes.
it: B<adjtimex>() è specifico di Linux e non dovrebbe essere usato in programmi pensati per la portabilità.

source: The leap-second processing triggered by B<STA_INS> and B<STA_DEL> is done by the kernel in timer context Thus, it will take one tick into the second for the leap second to be inserted or deleted.
de: Die von B<STA_INS> und B<STA_DEL> ausgelöste Schaltsekundenverarbeitung wird vom Kernel im Timer-Kontext durchgeführt. Daher wird ein Tick in die Sekunde benötigt, damit die Schaltsekunde eingefügt oder gelöscht wird.
it: L'elaborazione del secondo intercalare innescato da B<STA_INS> e B<STA_DEL> è fatto dal kernel nell'ambito del timer. Quindi, è allo scoccare esatto di un secondo che il secondo intercalare sarà aggiunto o tolto.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
