Repository: sebras/manpages-l10n
Catalog: po/*/man2/adjtimex.2.po
Languages: de, fr, it

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux
it: Manuale del programmatore di Linux

source: NAME
de: BEZEICHNUNG
fr: NOM
it: NOME

source: adjtimex, clock_adjtime, ntp_adjtime - tune kernel clock
de: adjtimex, clock_adjtime, ntp_adjtime - Kernel-Uhr einstellen
fr: adjtimex, clock_adjtime, ntp_adjtime - Régler l'horloge du noyau (kernel clock)
it: adjtimex, clock_adjtime, ntp_adjtime - regola l'orologio del kernel

source: SYNOPSIS
de: ÜBERSICHT
it: SINTASSI

source: B<int adjtimex(struct timex *>I<buf>B<);>
de: B<int adjtimex(struct timex *>I<Puffer>B<);>

source: B<int clock_adjtime(clockid_t >I<clk_id,>B< struct timex *>I<buf>B<);>
de: B<int clock_adjtime(clockid_t >I<Uhrken,>B< struct timex *>I<Puffer>B<);>

source: B<int ntp_adjtime(struct timex *>I<buf>B<);>
de: B<int ntp_adjtime(struct timex *>I<Puffer>B<);>

source: DESCRIPTION
de: BESCHREIBUNG
it: DESCRIZIONE

source: Linux uses David L.\& Mills' clock adjustment algorithm (see RFC\ 5905). The system call B<adjtimex>() reads and optionally sets adjustment parameters for this algorithm. It takes a pointer to a I<timex> structure, updates kernel parameters from (selected) field values, and returns the same structure updated with the current kernel values. This structure is declared as follows:
de: Linux verwendet den Algorithmus von David L.\& Mills für die Einstellung von Uhren (siehe RFC\ 5905). Der Systemaufruf B<adjtimex>() liest und setzt optional Einstellparameter für diesen Algorithmus. Ihm wird ein Zeiger auf eine Struktur I<timex> übergeben. Aus ausgewählten Feldwerten davon aktualisiert er Kernel-Parameter. Abschließend wird die gleiche Struktur mit aus den aktuellen Kernelwerten aktualisierten Parametern zurückgeliefert. Die Struktur ist wie folgt deklariert:
fr: Linux utilise l'algorithme d'ajustement d'horloge de David L. Mills (voir la RFC 5905). L'appel système B<adjtimex>() lit et écrit éventuellement les paramètres d'ajustement pour cet algorithme. Il utilise un pointeur sur une structure I<timex> pour mettre à jour les paramètres du noyau avec les valeurs des champs (sélectionnés), et renvoyer la même structure avec les valeurs actuelles du noyau. La structure est déclarée comme suit\ :
it: Linux usa l'algoritmo di correzione dell'ora di David L.\& Mill (vedere RFC 5905). La chiamata di sistema B<adjtimex>() legge e può all'occorrenza modificare i parametri di correzione per questo algoritmo. Richiede un puntatore a una struttura I<timex>, aggiorna i parametri del kernel in base ai valori dei campi (selezionati) e restituisce la medesima struttura aggiornata con i valori correnti del kernel. La struttura è dichiarata nel seguento modo:

source: struct timex { int modes; /* Mode selector */ long offset; /* Time offset; nanoseconds, if STA_NANO status flag is set, otherwise microseconds */ long freq; /* Frequency offset; see NOTES for units */ long maxerror; /* Maximum error (microseconds) */ long esterror; /* Estimated error (microseconds) */ int status; /* Clock command/status */ long constant; /* PLL (phase-locked loop) time constant */ long precision; /* Clock precision (microseconds, read-only) */ long tolerance; /* Clock frequency tolerance (read-only); see NOTES for units */ struct timeval time; /* Current time (read-only, except for ADJ_SETOFFSET); upon return, time.tv_usec contains nanoseconds, if STA_NANO status flag is set, otherwise microseconds */ long tick; /* Microseconds between clock ticks */ long ppsfreq; /* PPS (pulse per second) frequency (read-only); see NOTES for units */ long jitter; /* PPS jitter (read-only); nanoseconds, if STA_NANO status flag is set, otherwise microseconds */ int shift; /* PPS interval duration (seconds, read-only) */ long stabil; /* PPS stability (read-only); see NOTES for units */ long jitcnt; /* PPS count of jitter limit exceeded events (read-only) */ long calcnt; /* PPS count of calibration intervals (read-only) */ long errcnt; /* PPS count of calibration errors (read-only) */ long stbcnt; /* PPS count of stability limit exceeded events (read-only) */ int tai; /* TAI offset, as set by previous ADJ_TAI operation (seconds, read-only, since Linux 2.6.26) */ /* Further padding bytes to allow for future expansion */ };
de: struct timex { int modes; /* Modusauswahl */ long offset; /* Zeitversatz; Nanosekunden, falls STA_NANO Statusschalter gesetzt ist, andernfalls Mikrosekunden */ long freq; /* Frequenzversatz; siehe ANMERKUNGEN für Einheiten */ long maxerror; /* Maximaler Fehler (Mikrosekunden) */ long esterror; /* Abgeschätzter Fehler (Mikrosekunden) */ int status; /* Uhrbefehl/-status */ long constant; /* PLL (Phasenregelschleife) Zeitkonstante */ long precision; /* Uhr-Genauigkeit (Mikrosekunden, nur lesbar) */ long tolerance; /* Uhrfrequenztoleranz (nur lesbar); siehe ANMERKUNGEN für Einheiten */ struct timeval time; /* Aktuelle Zeit (nur lesbar, außer für ADJ_SETOFFSET); nach Rückkehr enthält time.tv_usec Nanosekunden, falls der STA_NANO-Status- schalter gesetzt ist, andernfalls Mikrosekunden */ long tick; /* Mikrosekunden zwischen Uhr-Ticks */ long ppsfreq; /* PPS- (Impulse pro Sekunde) Frequenz (nur lesbar); siehe ANMERKUNGEN für Einheiten */ long jitter; /* PPS-Jitter (nur lesbar); Nanosekunden, falls STA_NANO Statusschalter gesetzt ist, andernfalls Mikrosekunden */ int shift; /* PPS-Intervalldauer (Sekunden, nur lesbar) */ long stabil; /* PPS-Stabilität (nur lesbar); siehe ANMERKUNGEN für Einheiten */ long jitcnt; /* PPS-Anzahl der Ereignisse, die die Jitter-Begrenzung überschreiten (nur lesbar) */ long calcnt; /* PPS-Anzahl der Kalibrierungsintervalle (nur lesbar) */ long errcnt; /* PPS-Anzahl der Kalibrierungsfehler (nur lesbar) */ long stbcnt; /* PPS-Anzahl der Ereignisse, die die Stabilitäts-Begrenzung überschreiten (nur lesbar) */ int tai; /* TAI-Versatz, wie durch frühere ADJ_TAI- Aktionen gesetzt (Sekunden, nur lesbar, seit Linux 2.6.26) */ /* Weitere Füll-Bytes, um zukünftige Erweiterungen zu ermöglichen */ };
fr: struct timex { int modes; /* choix du mode */ long offset; /* décalage temporel ; nanosecondes, si drapeau STA_NANO est défini, sinon microseconde*/ long freq; /* décalage de fréquence ; unités, voir NOTES */ long maxerror; /* erreur maximale (microseconde) */ long esterror; /* erreur estimée (microseconde) */ int status; /* commande horloge/état */ long constant; /* constante de temps PLL */ long precision; /* précision de l’horloge (microseconde, lecture seule) */ long tolerance; /* tolérance fréquence horloge (lecture seule); unités, voir NOTES */ struct timeval time; /* heure actuelle (lecture seule, sauf pour ADJ_SETOFFSET) ; sur renvoi, time.tv_usec contient nanosecondes, si le drapeau STA_NANO défini, sinon microsecondes */ long tick; /* microsecondes entre tics horloge */ long ppsfreq; /* fréquence PPS (pulse per second) (lecture seule) ; unités, voir NOTES */ long jitter; /* jitter PPS (lecture seule) ; nanosecondes, si drapeau état STA_NANO défini, sinon microsecondes */ int shift; /* durée intervalle PPS (secondes, lecture seule) */ long stabil; /* stabilité PPS (lecture seule); unités, voir NOTES */ long jitcnt; /* nombre PPS dépassements limite de jitter évènements (lecture seule) long calcnt; /* nombre PPS d’intervalles de calibration (lecture seule) */ long errcnt; /* nombre PPS d’erreurs de calibration (lecture seule) */ long stbcnt; /* nombre PPS dépassements limite stabilité évènements (lecture seule) int tai; /* décalage TAI, comme défini par l’opération ADJ_TAI (secondes, lecture seule, depuis Linux 2.6.26) */ /* octets de remplissage supplémentaires pour une extension future*/ };
it: struct timex { int modes; /* Selettore modalità */ long offset; /* Scostamento orario; nanosecondi, se è impostato il flag STA_NANO, altrimenti microsecondi */ long freq; /* Scostamento frequenza; per le unità vedi NOTE) */ long maxerror; /* Errore massimo (microsecondi) */ long esterror; /* Errore stimato (microsecondi) */ int status; /* Comando/stato orologio */ long constant; /* Costante di tempo PLL (anello ad aggancio di fase [Phase-Locked Loop])*/ long precision; /* Precisione orologio (microsecondi, sola lettura) */ long tolerance; /* Tolleranza frequenza orologio (sola lettura); vedi NOTE per le unità */ struct timeval time; /* Ora attuale (sola lettura, eccetto che per ADJ_SETOFFSET); a chiamata eseguita, time.tv_usec ccontiene nanosecondi, se il flag di stato STA_NANO è impostato, altrimenti microsecondi) */ long tick; /* Microsecondi tra i battiti dell'orologio */ long ppsfreq; /* Frequenza PPS (impulsi al secondo) (sola lettura); vedi NOTE per le unità */ long jitter; /* Variazione PPS (sola lettura); nanosecondi, se il flag di stato STA_NANO è impostato, altrimenti microsecondi */ int shift; /* Durata dell'intervallo PPS (secondsi, sola lettura) */ long stabil; /* Stabilità PPS (sola lettura); vedi NOTE per le unità */ long jitcnt; /* Conteggio degli eventi di limite variazione PPS superato (sola lettura) */ long calcnt; /* Conteggio degli intervalli di calibrazione PPS (sola lettura) */ long errcnt; /* Conteggio degli errori di calibrazione PPS (sola lettura) */ long stbcnt; /* Conteggio degli eventi di limite di stabilità PPS superato (sola lettura) */ int tai; /* Scostamento TAI, come impostato dall'ultima operazione ADJ_TAI (secondi, sola lettura, a partire da Linux 2.6.26) */ /* Ulteriori byte disponibili in previsione di future espansioni */ };

source: The I<modes> field determines which parameters, if any, to set. (As described later in this page, the constants used for B<ntp_adjtime>() are equivalent but differently named.) It is a bit mask containing a bitwise-I<or> combination of zero or more of the following bits:
de: Das Feld I<modes> bestimmt, welche Parameter, falls vorhanden, zu setzen sind. (Wie später auf dieser Seite beschrieben wird, sind die Konstanten für B<ntp_adjtime>() äquivalent, aber anders benannt.) Es darf eine bitweise I<Oder>-Verknüpfung von Null oder mehr der folgenden Bits enthalten:
fr: Le champ I<modes> détermine les paramètres éventuels à écrire (comme décrit plus loin dans cette page, les constantes pour B<ntp_adjtime>() sont équivalentes mais ont un nom différent). Il s'agit d'un masque binaire contenant une combinaison I<or> bit à bit de zéros ou plusieurs des bits suivants\ :
it: Il campo I<modes> determina quali eventuali parametri impostare. (Come descritto più avanti in questa pagina, le costanti usate per B<ntp_adjtime>() sono equivalenti ma denominate in modo diverso.) Consiste in una maschera I<bit a bit di tipo> OR che imposta zero o più dei seguenti bit:

source: Set time offset from I<buf.offset>. Since Linux 2.6.26, the supplied value is clamped to the range (-0.5s, +0.5s). In older kernels, an B<EINVAL> error occurs if the supplied value is out of range.
de: Setzt den Zeitversatz aus I<Puffer.offset>. Seit Linux 2.6.26 ist der bereitgestellte Wert auf den Bereich (-0.5s, +0.5s) festgelegt. Unter älteren Kerneln tritt ein Fehler B<EINVAL> auf, falls der bereitgestellte Wert außerhalb des Bereichs liegt.
fr: Définir la position de l'heure à partir de I<buf.offset>. Depuis Linux 2.6.26, la valeur fournie figure sur la plage (-0.5s, +0.5s). Sur les anciens noyaux, une erreur B<EINVAL> survient si la valeur fournie sort de cette plage.
it: Imposta lo scostamento dell'orario da I<buf.offset>.A partire da Linux 2.6.26, il valore fornito è fissato all'intervallo (-0.5s, +0.5s). Nei kernel più vecchi, si ha un errore B<EINVAL> se il valore fornito è fuori intervallo.

source: Set frequency offset from I<buf.freq>. Since Linux 2.6.26, the supplied value is clamped to the range (-32768000, +32768000). In older kernels, an B<EINVAL> error occurs if the supplied value is out of range.
de: Setzt den Zeitversatz aus I<Puffer.freq>. Seit Linux 2.6.26 ist der bereitgestellte Wert auf den Bereich (-32768000, +32768000) festgelegt. Unter älteren Kerneln tritt ein Fehler B<EINVAL> auf, falls der bereitgestellte Wert außerhalb des Bereichs liegt.
fr: Définir la position de la fréquence à partir de I<buf.freq>. Depuis Linux 2.6.26, la valeur fournie figure sur la plage (-32768000, +32768000). Sur les anciens noyaux, une erreur B<EINVAL> survient si la valeur fournie sort de cette plage.
it: Imposta lo scostamento della frequenza da I<buf.freq>. A partire da Linux 2.6.26, il valore fornito è fissato all'intervallo (-32768000, +32768000). Nei kernel più vecchi, si ha un errore B<EINVAL> se il valore fornito è fuori intervallo.

source: Set maximum time error from I<buf.maxerror>.
de: Setzt den maximalen Zeitfehler aus I<Puffer.maxerror>.
fr: Définir l'erreur de temps maximale à partir de I<buf.maxerror>.
it: Imposta l'errore massimmo di tempo da I<buf.maxerror>.

source: Set estimated time error from I<buf.esterror>.
de: Setzt den abgeschätzten Zeitfehler aus I<Puffer.esterror>.
fr: Définir l'erreur de temps estimée à partir de I<buf.esterror>.
it: Imposta l'errore stimato di tempo da I<buf.esterror>.

source: Set clock status bits from I<buf.status>. A description of these bits is provided below.
de: Setzt die Uhrstatus-Bits aus I<Puffer.status>. Eine Beschreibung dieser Bits erfolgt weiter unten.
fr: Définir les bits de l'état de l'horloge à partir de I<buf.status>. Une description de ces bits est disponible ci-dessous.
it: Imposta i bit di stato dell'orologio da I<buf.status>. Una descrizione di questi bit viene fatta più avanti.

source: Set PLL time constant from I<buf.constant>. If the B<STA_NANO> status flag (see below) is clear, the kernel adds 4 to this value.
de: Setzt die PLL-Zeitkonstante aus I<Puffer.constant>. Falls der Statusschalter B<STA_NANO> (siehe unten) zurückgesetzt ist, fügt der Kernel 4 zu diesem Wert hinzu.
fr: Définir la constante PLL de l'heure à partir de I<buf.constant>. Si le drapeau d'état B<STA_NANO> (voir ci-dessous) est vide, le noyau ajoute B<4> à cette valeur.
it: Imposta la costante di tempo PLL da I<buf.constant>. Se il flag di stato B<STA_NANO> (vedi oltre) è a zero, il kernel aggiunge 4 a questo valore.

source: B<ADJ_SETOFFSET> (since Linux 2.6.39)
de: B<ADJ_SETOFFSET> (seit Linux 2.6.39)
fr: B<ADJ_SETOFFSET> (depuis Linux 2.6.39)
it: B<ADJ_SETOFFSET> (a partire da Linux 2.6.39)

source: Add I<buf.time> to the current time. If I<buf.status> includes the B<ADJ_NANO> flag, then I<buf.time.tv_usec> is interpreted as a nanosecond value; otherwise it is interpreted as microseconds.
de: Fügt I<Puffer.time> zu der aktuellen Zeit hinzu. Falls I<Puffer.status> den Schalter B<ADJ_NANO> enthält, dann wird I<Puffer.time.tv_usec> als Nanosekundenwert interpretiert; andernfalls wird er als Mikrosekunden interpretiert.
fr: Ajouter I<buf.time> à l'heure actuelle. Si I<buf.status> inclut le drapeau B<ADJ_NANO>, I<buf.time.tv_usec> est interprété comme une valeur en nanoseconde ; sinon il est interprété en microseconde.
it: Aggiunge I<buf.time> al tempo corrente. Se I<buf.status> include il flag B<ADJ_NANO>, I<buf.time.tv_usec> è interpretato come un valore in nanosecondi; altrimenti è considerato espresso in microsecondi.

source: The value of I<buf.time> is the sum of its two fields, but the field I<buf.time.tv_usec> must always be nonnegative. The following example shows how to normalize a I<timeval> with nanosecond resolution.
de: Der Wert von I<Puffer.time> ist die Summe seiner zwei Felder, aber das Feld I<Puffer.time.tv_usec> darf nie negativ sein. Das folgende Beispiel zeigt, wie ein I<timeval> auf Nanosekundenauflösung normiert wird.
fr: La valeur de I<buf.time> est la somme de ses deux champs, mais le champ I<buf.time.tv_usec> doit toujours être positif. L'exemple suivant montre la manière de normaliser une I<timeval> avec une résolution en nanoseconde.
it: Il valore di I<buf.time> è la somma dei suoi due campi, ma il campo I<buf.time.tv_usec> dev'essere sempre non negativo. L'esempio seguente mostra come normalzzare un I<timeval> con una risoluzione di nanosecondi.

source: while (buf.time.tv_usec E<lt> 0) { buf.time.tv_sec -= 1; buf.time.tv_usec += 1000000000; }
de: while (Puffer.time.tv_usec E<lt> 0) { Puffer.time.tv_sec -= 1; Puffer.time.tv_usec += 1000000000; }

source: B<ADJ_MICRO> (since Linux 2.6.26)
de: B<ADJ_MICRO> (seit Linux 2.6.26)
fr: B<ADJ_MICRO> (depuis Linux 2.6.26)
it: B<ADJ_MICRO> (a partire da Linux 2.6.26)

source: Select microsecond resolution.
de: Wählt Mikrosekundenauflösung.
fr: Sélectionner la résolution en microseconde.
it: Seleziona la risoluzione in microsecondi.

source: B<ADJ_NANO> (since Linux 2.6.26)
de: B<ADJ_NANO> (seit Linux 2.6.26)
fr: B<ADJ_NANO> (depuis Linux 2.6.26)
it: B<ADJ_NANO> (a partire da Linux 2.6.26)

source: Select nanosecond resolution. Only one of B<ADJ_MICRO> and B<ADJ_NANO> should be specified.
de: Wählte Nanosekundenauflösung. Nur einer von B<ADJ_MICRO> und B<ADJ_NANO> sollte angegeben werden.
fr: Sélectionner la résolution en nanoseconde. Vous ne devriez spécifier que B<ADJ_MICRO> ou B<ADJ_NANO>.
it: Seleziona la risoluzione in nanosecondi. Dei due flag, B<ADJ_MICRO> e B<ADJ_NANO>, solo uno dovrebbe essere specificato.

source: B<ADJ_TAI> (since Linux 2.6.26)
de: B<ADJ_TAI> (seit Linux 2.6.26)
fr: B<ADJ_TAI> (depuis Linux 2.6.26)
it: B<ADJ_TAI> (a partire da Linux 2.6.26)

source: Set TAI (Atomic International Time) offset from I<buf.constant>.
de: Setzt den TAI- (Atomic International Time)-Versatz auf I<Puffer.constant>.
fr: Définir la position du TAI (temps atomique international) à partir de I<buf.constant>.
it: Imposta lo scostamento dal TAI (Tempo Atomico Internazionale) di I<buf.constant>.

source: B<ADJ_TAI> should not be used in conjunction with B<ADJ_TIMECONST>, since the latter mode also employs the I<buf.constant> field.
de: B<ADJ_TAI> sollte nicht zusammen mit B<ADJ_TIMECONST> verwandt werden, da letzterer Modus auch das Feld I<Puffer.constant> einsetzt.
fr: B<ADJ_TAI> ne devrait pas être utilisé avec B<ADJ_TIMECONST>, puisque le dernier mode utilise également le champ I<buf.constant>.
it: B<ADJ_TAI> non si dovrebbe usare insieme a B<ADJ_TIMECONST>, poiché anche quest'ultimo impiega il campo I<buf.constant>.

source: For a complete explanation of TAI and the difference between TAI and UTC, see E<.UR http://www.bipm.org/en/bipm/tai/tai.html> I<BIPM> E<.UE>
de: Für eine vollständige Erklärung von TAI und dem Unterschied zwischen TAI und UTC siehe E<.UR http://www.bipm.org/en/bipm/tai/tai.html> I<BIPM> E<.UE>
fr: Pour une explication complète du temps atomique international (TAI) et de la différence entre ce temps et celui universel coordonné (UTC), voir E<.UR http://www.bipm.org/en/bipm/tai/tai.html> I<BIPM> E<.UE>
it: Per una spiegazione completa del TAI e della differenza tra TAI e UTC, vedere E<.UR http://www.bipm.org/en/bipm/tai/tai.html> I<BIPM> E<.UE>

source: Set tick value from I<buf.tick>.
de: Setzt den Tick-Wert aus I<Puffer.tick>.
fr: Définir la valeur d'un tic à partir de I<buf.tick>.
it: Imposta il valore del battito da I<buf.tick>.

source: Alternatively, I<modes> can be specified as either of the following (multibit mask) values, in which case other bits should not be specified in I<modes>:
de: Alternativ kann I<modes> als einer der folgenden (Mehrfach-Bitmasken-)Werte angegeben werden; in diesem Fall sollten andere Bits nicht in I<modes> angegeben werden:
fr: Autrement, I<modes> peut être indiqué sous la forme de valeurs suivantes (masque multibit), auquel cas aucun autre bit ne devrait être spécifié dans I<modes> :
it: In alternativa, I<modes> può essere specificato come uno dei seguenti valori (maschera multibit), nel qual caso non si dovrebbero utilizzare altri bit in I<modes>:

source: Old-fashioned B<adjtime>(3): (gradually) adjust time by value specified in I<buf.offset>, which specifies an adjustment in microseconds.
de: Altertümliches B<adjtime>(3): passt die Zeit (graduell) durch den in I<Puffer.offset>, der Anpassungen in Mikrosekunden spezifiziert, festgelegten Wert an.
fr: B<adjtime>(3) à l'ancienne : ajuster (graduellement) l'heure avec des valeurs spécifiées dans I<buf.offset>, ce qui indique un ajustement en microseconde.
it: Il vecchio B<adjtime>(3): (gradualmente) aggiusta il tempo secondo il valore contenuto in I<buf.offset>, che specifica una regolazione in microsecondi.

source: B<ADJ_OFFSET_SS_READ> (functional since Linux 2.6.28)
de: B<ADJ_OFFSET_SS_READ> (funktionell seit Linux 2.6.28)
fr: B<ADJ_OFFSET_SS_READ> (fonctionnel depuis Linux 2.6.28)
it: B<ADJ_OFFSET_SS_READ> (disponibile a partire da Linux 2.6.28)

source: Return (in I<buf.offset>) the remaining amount of time to be adjusted after an earlier B<ADJ_OFFSET_SINGLESHOT> operation. This feature was added in Linux 2.6.24, but did not work correctly until Linux 2.6.28.
de: Liefert (in I<Puffer.offset>) die verbleibende Dauer zurück, die nach einer früheren B<ADJ_OFFSET_SINGLESHOT>-Aktion noch angepasst werden muss. Diese Funktionalität wurde in Linux 2.6.24 hinzugefügt, funktionierte aber erst richtig ab Linux 2.6.28.
fr: Renvoyer (dans I<buf.offset>) le temps restant à ajuster après une précédente opération B<ADJ_OFFSET_SINGLESHOT>. Cette fonctionnalité a été ajoutée dans Linux 2.6.24, mais elle ne fonctionnait pas correctement jusqu'à Linux 2.6.28.
it: Restituisce (in I<buf.offset>) la quantità di tempo ancora da regolare dopo una precedente operazione B<ADJ_OFFSET_SINGLESHOT>. Questa funzionalità è stata aggiunta in Linux 2.6.24, ma non ha funzionato correttamenteprima di Linux 2.6.28.

source: Ordinary users are restricted to a value of either 0 or B<ADJ_OFFSET_SS_READ> for I<modes>. Only the superuser may set any parameters.
de: Normale Benutzer sind auf einen Wert von entweder 0 oder B<ADJ_OFFSET_SS_READ> für I<modes> eingeschränkt. Nur der Superuser darf Parameter setzen.
fr: Les utilisateurs normaux sont limités à une valeur de I<modes> nulle ou B<ADJ_OFFSET_SS_READ>. Seul le superutilisateur peut écrire n'importe quel paramètre.
it: Gli utenti ordinari sono limitati al valore 0 o B<ADJ_OFFSET_SS_READ> per I<modes>. Solo il superutente può impostare qualsiasi parametro.

source: The I<buf.status> field is a bit mask that is used to set and/or retrieve status bits associated with the NTP implementation. Some bits in the mask are both readable and settable, while others are read-only.
de: Das Feld I<Puffer.status> ist eine Bitmaske, die zum Setzen und/oder Abfragen von der NTP-Implementierung zugeordneten Statusbits verwandt wird. Einige Bits in der Maske sind sowohl les- als auch setzbar, während andere nur lesbar sind.
fr: Le champ I<buf.status> est un masque de bits utilisé pour définir et/ou récupérer les bits d'état associés à l'implémentation NTP. Certains bits du masque sont lisibles et modifiables, alors que d'autres ne sont qu'en lecture seule.
it: Il campo I<buf.status> è una maschera di bit usata per impostare e/o leggere bit di stato associati con l'implementazione NTP. Alcuni bit nella maschera possono essere usati sia per leggere che per impostare, mentre altri sono in sola lettura.

source: B<STA_PLL> (read-write)
de: B<STA_PLL> (lesen/schreiben)
fr: B<STA_PLL> (lecture-écriture)
it: B<STA_PLL> (lettura-scrittura)

source: Enable phase-locked loop (PLL) updates via B<ADJ_OFFSET>.
de: Aktiviert Aktualisierungen von Phasenregelschleifen (PLL) per B<ADJ_OFFSET>.
fr: Activer les mises à jour « phase-locked loop » (PLL) à l’aide de B<ADJ_OFFSET>.
it: Abilita gli aggiornamenti dell'anello ad aggancio di fase (PLL - phase-locked loop) via B<ADJ_OFFSET>.

source: B<STA_PPSFREQ> (read-write)
de: B<STA_PPSFREQ> (lesen/schreiben)
fr: B<STA_PPSFREQ> (lecture-écriture)
it: B<STA_PPSFREQ> (lettura-scrittura)

source: Enable PPS (pulse-per-second) frequency discipline.
de: Aktiviert PPS- (Impulse pro Sekunde) Frequenzeinhaltung.
fr: Activer le mode de fréquence PPS (pulse-per-second ou battement par seconde).
it: Abilita la disciplina di frequenza PPS (impulsi al secondo.
