Repository: sebras/manpages-l10n
Catalog: po/*/man2/adjtimex.2.po
Languages: de, fr, it

source: B<STA_PPSTIME> (read-write)
de: B<STA_PPSTIME> (lesen/schreiben)
fr: B<STA_PPSTIME> (lecture-écriture)
it: B<STA_PPSTIME> (lettura-scrittura)

source: Enable PPS time discipline.
de: Aktiviert PPS (Impulse pro Sekunde) Zeiteinhaltung.
fr: Activer le mode temporel PPS.
it: Abilita la disciplina di tempo PPS.

source: B<STA_FLL> (read-write)
de: B<STA_FLL> (lesen/schreiben)
fr: B<STA_FLL> (lecture-écriture)
it: B<STA_FLL> (lettura-scrittura)

source: Select frequency-locked loop (FLL) mode.
de: Wählt Frequenz-verriegelten- (FLL) Modus.
fr: Sélectionner le mode « frequency-locked loop » (FLL).
it: Seleziona la modalità di anello ad aggancio di frequenza (FLL - frequency-locked loop).

source: B<STA_INS> (read-write)
de: B<STA_INS> (lesen/schreiben)
fr: B<STA_INS> (lecture-écriture)
it: B<STA_INS> (lettura-scrittura)

source: Insert a leap second after the last second of the UTC day, thus extending the last minute of the day by one second. Leap-second insertion will occur each day, so long as this flag remains set.
de: Fügt eine Schaltsekunde nach der letzten Sekunde des UTC-Tages ein. Damit wird die letzte Minute des Tages um eine Sekunde verlängert. Die Einfügung von Schaltsekunden erfolgt solange wie dieser Schalter gesetzt bleibt.
fr: Insérer un saut d’une seconde après la dernière seconde de la journée UTC, ce qui étend ainsi la dernière minute de la journée d'une seconde. L'insertion d'un tel saut s'effectuera chaque jour tant que ce drapeau est positionné.
it: Inserisce un secondo intercalare dopo l'ultimo secondo del giorno UTC, estendendo così di un secondo l'ultimo minuto del giorno. L'inserimento del secondo intercalare avverrà ogni giorno, purché questo flag rimanga impostato.

source: B<STA_DEL> (read-write)
de: B<STA_DEL> (lesen/schreiben)
fr: B<STA_DEL> (lecture-écriture)
it: B<STA_DEL> (lettura-scrittura)

source: Delete a leap second at the last second of the UTC day. Leap second deletion will occur each day, so long as this flag remains set.
de: Löscht eine Schaltsekunde in der letzten Sekunde des UTC-Tages. Schaltsekundenlöschung wird jeden Tag erfolgen, solange dieser Schalter gesetzt bleibt.
fr: Supprimer le saut d’une seconde à la dernière seconde de la journée UTC. Une telle suppression se produira chaque jour tant que ce drapeau est positionné.
it: Toglie un secondo intercalare all'ultimo secondo del giorno UTC. L'eliminazione del secondo intercalare avverrà ogni giorno, purché questo flag rimanga impostato.

source: B<STA_UNSYNC> (read-write)
de: B<STA_UNSYNC> (lesen/schreiben)
fr: B<STA_UNSYNC> (lecture-écriture)
it: B<STA_UNSYNC> (lettura-scrittura)

source: Clock unsynchronized.
de: Uhr nicht synchronisiert.
fr: Horloge non synchronisée.
it: Orologio non sincronizzato.

source: B<STA_FREQHOLD> (read-write)
de: B<STA_FREQHOLD> (lesen/schreiben)
fr: B<STA_FREQHOLD> (lecture-écriture)
it: B<STA_FREQHOLD> (lettura-scrittura)

source: Hold frequency. Normally adjustments made via B<ADJ_OFFSET> result in dampened frequency adjustments also being made. So a single call corrects the current offset, but as offsets in the same direction are made repeatedly, the small frequency adjustments will accumulate to fix the long-term skew.
de: Haltefrequenz. Normale Anpassungen, die über B<ADJ_OFFSET> gemacht wurden, führten dazu, dass auch gedämpfte Frequenzanpassungen gemacht wurden. Daher korrigiert ein einzelner Aufruf den derzeitigen Versatz, da Versätze jedoch in der selben Richtung wiederholt wurden, summieren sich die kleinen Frequenzanpassungen, um die Verzerrung über einen längeren Zeitraum zu beheben.
fr: Conserver la fréquence. Normalement, il résulte des ajustements effectués avec B<ADJ_OFFSET> des ajustements de fréquence amortis. Un seul appel corrige donc la position actuelle, mais comme les compensations dans le même sens se répètent, les petits ajustements de fréquence s'accumuleront pour corriger le décalage à long terme.
it: Mantiene la frequenza. Normalmente gli aggiustamenti fatti tramite B<ADJ_OFFSET> implicano anche aggiustamenti minori della frequenza. Così una chiamata singola corregge lo scostamento orario corrente, ma applicando tali scostamenti ripetutamente nella stessa direzione, i piccoli aggiustamenti della frequenza si accumuleranno per correggere la distorsione.

source: This flag prevents the small frequency adjustment from being made when correcting for an B<ADJ_OFFSET> value.
de: Dieser Schalter verhindert die Durchführungen der kleinen Frequenzanpassungen, wenn für einen Wert B<ADJ_OFFSET> korrigiert wird.
fr: Ce drapeau empêche les petits ajustements de fréquence lors de la correction d'une valeur B<ADJ_OFFSET>.
it: Questo flag evita che venga fatto il piccolo aggiustamente della frequenza quando si effettua una correzione usando il valore B<ADJ_OFFSET>.

source: B<STA_PPSSIGNAL> (read-only)
de: B<STA_PPSSIGNAL> (nur lesend)
fr: B<STA_PPSSIGNAL> (lecture seule)
it: B<STA_PPSSIGNAL> (sola lettura)

source: A valid PPS (pulse-per-second) signal is present.
de: Ein gültiges PPS- (Impulse-pro-Sekunde-)Signal ist vorhanden.
fr: Un signal PPS (pulse-per-second, ou battement par seconde) valable est présent.
it: Un segnale PPS (impulsi al secondo) è presente.

source: B<STA_PPSJITTER> (read-only)
de: B<STA_PPSJITTER> (nur lesend)
fr: B<STA_PPSJITTER> (lecture seule)
it: B<STA_PPSJITTER> (sola lettura)

source: PPS signal jitter exceeded.
de: PPS-Signal-Jitter überschritten.
fr: Fluctuation de signal (jitter) PPS excessive.
it: Eccessiva variazione segnale PPS.

source: B<STA_PPSWANDER> (read-only)
de: B<STA_PPSWANDER> (nur lesend)
fr: B<STA_PPSWANDER> (lecture seule)
it: B<STA_PPSWANDER> (sola lettura)

source: PPS signal wander exceeded.
de: PPS-Signalwandern überschritten.
fr: Dérive de signal (wander) PPS excessive.
it: Eccessiva dispersione segnale PPS.

source: B<STA_PPSERROR> (read-only)
de: B<STA_PPSERROR> (nur lesend)
fr: B<STA_PPSERROR> (lecture seule)
it: B<STA_PPSERROR> (sola lettura)

source: PPS signal calibration error.
de: PPS-Signal-Kalibrierungsfehler.
fr: Erreur de calibrage du signal PPS.
it: Errore di calibrazione segnale PPS.

source: B<STA_CLOCKERR> (read-only)
de: B<STA_CLOCKERR> (nur lesend)
fr: B<STA_CLOCKERR> (lecture seule)
it: B<STA_CLOCKERR> (sola lettura)

source: Clock hardware fault.
de: Uhr-Hardware-Ausnahmebehandlung.
fr: Erreur d'horloge matérielle.
it: Difetto hardware dell'orologio.

source: B<STA_NANO> (read-only; since Linux 2.6.26)
de: B<STA_NANO> (nur lesend; seit Linux 2.6.26)
fr: B<STA_NANO> (lecture seule ; depuis Linux 2.6.26)
it: B<STA_NANO> (sola lettura; a partire da Linux 2.6.26)

source: Resolution (0 = microsecond, 1 = nanoseconds). Set via B<ADJ_NANO>, cleared via B<ADJ_MICRO>.
de: Auflösung (0=Mikrosekunden, 1=Nanosekunden). Gesetzt über B<ADJ_NANO>, entfernt über B<ADJ_MICRO>.
fr: Résolution (0 = microseconde, 1 = nanoseconde). Positionné à l’aide de B<ADJ_NANO>, annulé à l’aide de B<ADJ_MICRO>.
it: Risoluzione (0 = microsecondi, 1 = nanosecondi). Impostata con B<ADJ_NANO>, annullata con B<ADJ_MICRO>.

source: B<STA_MODE> (since Linux 2.6.26)
de: B<STA_MODE> (seit Linux 2.6.26)
fr: B<STA_MODE> (depuis Linux 2.6.26)
it: B<STA_MODE> (a partire da Linux 2.6.26)

source: Mode (0 = Phase Locked Loop, 1 = Frequency Locked Loop).
de: Modus (0 = Phasenregelschleife, 1 = Frequenz-verriegelte Schleife).
it: Modalità (0 = Anello ad aggancio di fase , 1 = Anello ad aggancio di frequenza; sola lettura).

source: B<STA_CLK> (read-only; since Linux 2.6.26)
de: B<STA_CLK> (nur lesend; seit Linux 2.6.26)
fr: B<STA_CLK> (en lecture seule ; depuis Linux 2.6.26)
it: B<STA_CLK> (sola lettura; a partire da Linux 2.6.26)

source: Clock source (0 = A, 1 = B); currently unused.
de: Uhrquelle (0=A, 1=B); derzeit nicht verwandt.
fr: Source de l'horloge (0 = A, 1 = B) ; actuellement inusité.
it: Sorgente dell'orologio (0 = A, 1 = B;; attualmente non usata).

source: Attempts to set read-only I<status> bits are silently ignored.
de: Versuche, nur lesbare I<Status>-Bits zu ändern, werden ohne Meldung ignoriert.
fr: Les tentatives de positionner des bits d'I<état> qui sont en lecture seule sont ignorées silencieusement.
it: I tentativi di modificare i bit di I<stato> in sola lettura sono ignorati senza emettere messaggi.

source: The B<clock_adjtime>() system call (added in Linux 2.6.39) behaves like B<adjtimex>() but takes an additional I<clk_id> argument to specify the particular clock on which to act.
de: Der Systemaufruf B<clock_adjtime>() (in Linux 2.6.39 hinzugefügt) verhält sich wie B<adjtimex>(), akzeptiert aber ein zusätzliches Argument I<Uhrken>, um die bestimmte Uhr anzugeben, auf der agiert werden soll.
fr: L'appel système B<clock_adjtime>() (ajouté à Linux 2.6.39) se comporte comme B<adjtimex>() mais il prend un paramètre I<clk_id> supplémentaire pour indiquer sur quelle horloge spécifique agir.
it: La chiamata di sistema B<clock_adjtime>() (aggiunta in in Linux 2.6.39) si comporta come B<adjtimex>() ma ha un uteriore argomento I<clk_id> per indicare lo specifico orologio sul quale agisce.

source: The B<ntp_adjtime>() library function (described in the NTP "Kernel Application Program API", KAPI) is a more portable interface for performing the same task as B<adjtimex>(). Other than the following points, it is identical to B<adjtimex>():
de: Die Bibliotheksfunktion B<ntp_adjtime>() (beschrieben in dem NTP »Kernel Application Program API«, KAPI) ist eine portierbarere Schnittstelle für die Erledigung der gleichen Aufgaben wie B<adjtimex>(). Abgesehen von den folgenden Punkten ist sie zu B<adjtimex>() identisch:
fr: La fonction de bibliothèque B<ntp_adjtime>() (décrite dans le « Kernel Application Program API », KAPI) est une interface plus portable pour effectuer la même tâche que B<adjtimex>(). À part les points suivants, elle est identique à B<adjtimex>() :
it: La funzione di libreria B<ntp_adjtime>() (descritta in NTP "Kernel Application Program API", KAPI) è un'interfaccia più portabile per eseguire lo stesso compito di B<adjtimex>(). A parte i punti seguenti, è identica a B<adjtimex>():

source: The constants used in I<modes> are prefixed with "MOD_" rather than "ADJ_", and have the same suffixes (thus, B<MOD_OFFSET>, B<MOD_FREQUENCY>, and so on), other than the exceptions noted in the following points.
de: Den in I<modes> verwandten Konstanten wird »MOD_« statt »ADJ_« vorangestellt und sie haben die gleichen Endungen (daher B<MOD_OFFSET>, B<MOD_FREQUENCY> und so weiter), außer den in den folgenden Punkten bemerkten Ausnahmen.
fr: Les constantes utilisées dans les I<modes> sont préfixées de « MOD_ » au lieu de « ADJ_ » et elles ont les mêmes suffixes (B<MOD_OFFSET>, B<MOD_FREQUENCY>, et ainsi de suite), sauf les exceptions indiquées dans les points suivants.
it: Le costanti usate in I<modes> hanno il prefisso "MOD_" al posto di "ADJ_", e hanno gli stessi suffissi (quindi, B<MOD_OFFSET>, B<MOD_FREQUENCY>, e così via), oltre alle eccezioni di cui ai seguenti punti.

source: B<MOD_CLKA> is the synonym for B<ADJ_OFFSET_SINGLESHOT>.
de: B<MOD_CLKA> ist das Synonym für B<ADJ_OFFSET_SINGLESHOT>.
fr: B<MOD_CLKA> est le synonyme de B<ADJ_OFFSET_SINGLESHOT>.
it: B<MOD_CLKA> è il sinonimo di B<ADJ_OFFSET_SINGLESHOT>.

source: B<MOD_CLKB> is the synonym for B<ADJ_TICK>.
de: B<MOD_CLKB> ist das Synonym für B<ADJ_TICK>.
fr: B<MOD_CLKB> est le synonyme de B<ADJ_TICK>.
it: B<MOD_CLKB> è il sinonimo di B<ADJ_TICK>.

source: The is no synonym for B<ADJ_OFFSET_SS_READ>, which is not described in the KAPI.
de: Es gibt kein Synonym für B<ADJ_OFFSET_SS_READ>, das nicht in der KAPI beschrieben ist.
fr: Il n’existe pas de synonyme pour B<ADJ_OFFSET_SS_READ>, non décrit dans la KAPI.
it: Non ci sono sinonimi per B<ADJ_OFFSET_SS_READ>, che non è descritto nel KAPI.

source: RETURN VALUE
de: RÜCKGABEWERT
fr: VALEUR RENVOYÉE
it: VALORE RESTITUITO

source: On success, B<adjtimex>() and B<ntp_adjtime>() return the clock state; that is, one of the following values:
de: Bei Erfolg geben B<adjtimex>() und B<ntp_adjtime>() den Status der Uhr, d.h. einen der folgenden Werte, zurück:
fr: S'ils réussissent, B<adjtimex>() et B<ntp_adjtime>() renvoient l'état de l'horloge\ ; c'est-à-dire une des valeurs suivantes :
it: In caso di successo, B<adjtimex>() e B<ntp_adjtime>() restituiscono lo stato dell'orologio; cioè, uno dei seguenti valori:

source: Clock synchronized, no leap second adjustment pending.
de: Uhr synchronisiert, keine Schaltsekundenanpassung anhängig.
fr: Horloge synchronisée, aucun ajustement de saut de seconde en attente.
it: Orologio sincronizzato, nessun aggiustamento in sospeso per il secondo intercalare.

source: Indicates that a leap second will be added at the end of the UTC day.
de: Anzeige, dass am Ende des UTC-Tages eine Schaltsekunde hinzugefügt wird.
fr: Indication qu'un saut de seconde sera ajouté à la fin de la journée UTC.
it: Indica che verrà aggiunto un secondo intercalare alla fine del giorno UTC.

source: Indicates that a leap second will be deleted at the end of the UTC day.
de: Anzeige, dass am Ende des UTC-Tages eine Schaltsekunde entfernt wird.
fr: Indication que le saut de seconde sera retiré en fin de journée UTC.
it: Indica che verrà tolto un secondo intercalare alla fine del giorno UTC.

source: Insertion of a leap second is in progress.
de: Einfügen einer Schaltsekunde erfolgt derzeit.
fr: L'insertion d'un saut de seconde est en cours.
it: Aggiunta di un secondo intercalare in corso.

source: A leap-second insertion or deletion has been completed. This value will be returned until the next B<ADJ_STATUS> operation clears the B<STA_INS> and B<STA_DEL> flags.
de: Es erfolgte eine Einfügung oder Entfernung einer Schaltsekunde. Dieser Wert wird zurückgeliefert, bis die nächste Aktion B<ADJ_STATUS> die Schalter B<STA_INS> und B<STA_DEL> zurücksetzt.
fr: L'insertion ou la suppression d'un saut de seconde a été terminée. Cette valeur sera renvoyée jusqu'à ce qu'une prochaine opération B<ADJ_STATUS> ne vide les drapeaux B<STA_INS> et B<STA_DEL>.
it: L'aggiunta o la cancellazione di un secondo intercalare è stata completata. Questo valore sarà restituito prima che la successiva operazione B<ADJ_STATUS> annulli i flag B<STA_INS> e B<STA_DEL>.

source: The system clock is not synchronized to a reliable server. This value is returned when any of the following holds true:
de: Die Systemuhr ist nicht mit einem zuverlässigen Server synchronisiert. Dieser Wert wird zurückgeliefert, solange eines der Folgenden zutrifft:
fr: L'horloge système n'est pas synchronisée avec un serveur fiable. Cette valeur est renvoyée si un des éléments suivants reste vrai :
it: L'orologio di sistema non è sincronizzato con un server affidabile. Questo valore viene restituito quando uno dei seguenti è vero:

source: Either B<STA_UNSYNC> or B<STA_CLOCKERR> is set.
de: Entweder B<STA_UNSYNC> oder B<STA_CLOCKERR> ist gesetzt.
fr: B<STA_UNSYNC> ou B<STA_CLOCKERR> est défini.
it: B<STA_UNSYNC> o B<STA_CLOCKERR> è impostato.

source: B<STA_PPSSIGNAL> is clear and either B<STA_PPSFREQ> or B<STA_PPSTIME> is set.
de: B<STA_PPSSIGNAL> ist nicht gesetzt und entweder B<STA_PPSFREQ> oder B<STA_PPSTIME> ist gesetzt.
fr: B<STA_PPSSIGNAL> est vide et soit B<STA_PPSFREQ>, soit B<STA_PPSTIME> est positionné.
it: B<STA_PPSSIGNAL> è a zero e o B<STA_PPSFREQ> o B<STA_PPSTIME> è impostato.

source: B<STA_PPSTIME> and B<STA_PPSJITTER> are both set.
de: B<STA_PPSTIME> und B<STA_PPSJITTER> sind beide gesetzt.
fr: B<STA_PPSTIME> B<STA_PPSJITTER> sont tous deux définis.
it: B<STA_PPSTIME> e B<STA_PPSJITTER> sono entrambi impostati.

source: B<STA_PPSFREQ> is set and either B<STA_PPSWANDER> or B<STA_PPSJITTER> is set.
de: B<STA_PPSFREQ> ist gesetzt und entweder B<STA_PPSWANDER> oder B<STA_PPSJITTER> ist gesetzt.
fr: B<STA_PPSFREQ> est défini et soit B<STA_PPSWANDER>, soit B<STA_PPSJITTER> est défini.
it: B<STA_PPSFREQ> è impostato e o B<STA_PPSWANDER> o B<STA_PPSJITTER> è impostato.

source: The symbolic name B<TIME_BAD> is a synonym for B<TIME_ERROR>, provided for backward compatibility.
de: Der symbolische Name B<TIME_BAD> ist ein Synonym für B<TIME_ERROR>, bereitgestellt zur Rückwärtskompatibilität.
fr: Le nom symbolique B<TIME_BAD> est synonyme de B<TIME_ERROR>, fourni pour des raisons de rétrocompatibilité.
it: Il nome simbolico B<TIME_BAD> è un sinonimo di B<TIME_ERROR>, fornito per retrocompatibilità.

source: Note that starting with Linux 3.4, the call operates asynchronously and the return value usually will not reflect a state change caused by the call itself.
de: Beachten Sie, dass seit Linux 3.4 der Aufruf asynchron erfolgt und der Rückgabewert normalerweise nicht die vom Aufruf selbst ausgelösten Zustandsänderung wiedergibt.
fr: Remarquez qu'à partir de Linux 3.4, l'appel agit de manière asynchrone et la valeur renvoyée ne reflètera en général pas un changement d'état provoqué par l'appel lui-même.
it: Si noti che a partire da Linux 3.4, la chiamata opera in modo asincrono e il valore restituito usualmente non non riflette un cambiamento di stato causato dalla chiamata stessa.

source: On failure, these calls return -1 and set I<errno> to indicate the error.
de: Im Fehlerfall geben diese Aufrufe -1 zurück und setzen I<errno>, um den Fehler anzuzeigen.
it: Se falliscono, queste chiamate restituiscono -1 e impostano I<errno> per indicare l'errore.

source: ERRORS
de: FEHLER
fr: ERREURS
it: ERRORI

source: I<buf> does not point to writable memory.
de: I<Puffer> zeigt nicht auf beschreibbaren Speicher.
fr: I<buf> pointe en dehors de l'espace d'adressage accessible en écriture.
it: I<buf> non punta a una zona di memoria scrivibile.

source: B<EINVAL> (kernels before Linux 2.6.26)
de: B<EINVAL> (Kernel vor Linux 2.6.26)
fr: B<EINVAL> (noyaux avant Linux 2.6.26)
it: B<EINVAL> (kernel precedenti a Linux 2.6.26)

source: An attempt was made to set I<buf.freq> to a value outside the range (-33554432, +33554432).
de: Es wurde versucht, I<Puffer.freq> auf einen Wert außerhalb des Bereichs (-33554432, +33554432) zu setzen.
fr: Vous avez essayé de positionner I<buf.freq> sur une valeur au-delà de la plage (-33554432, +33554432).
it: É stato fatto un tentativo per impostare I<buf.freq> a un valore al di fuori dell'intervallo (-33554432, +33554432).

source: An attempt was made to set I<buf.offset> to a value outside the permitted range. In kernels before Linux 2.0, the permitted range was (-131072, +131072). From Linux 2.0 onwards, the permitted range was (-512000, +512000).
de: Es wurde versucht, I<Puffer.offset> auf einen Wert außerhalb des erlaubten Bereichs zu setzen. In Kerneln vor Linux 2.0 war der erlaubte Bereich (-131072,+131072). Seit Linux 2.0 ist der erlaubte Bereich (-512000, +512000).
fr: Vous avez essayé de positionner I<buf.offset> sur une valeur au-delà de la plage autorisée. Sur les noyaux précédant Linux 2.0, la plage autorisée était (-131072, +131072). Depuis Linux 2.0, la plage autorisée est (-512000, +512000).
it: É stato fatto un tentativo per impostare I<buf.offset> a un valore al di fuori dell'intervallo consentito. Nei kernel precedenti a Linux 2.0 gli intervalli consentiti erano (-131072, +131072). Da Linux 2.0 in poi, gli intervalli consentiti erano (-512000, +512000).

source: An attempt was made to set I<buf.status> to a value other than those listed above.
de: Es wurde versucht, I<Puffer.status> auf einen anderen als einen der aufgeführten Werte zu setzen.
fr: Vous avez essayé de positionner I<buf.status> sur une valeur différente de celles indiquées ci-dessus.
it: É stato fatto un tentativo per impostare I<buf.status> a un valore diverso da quelli elencati in precedenza.

source: The I<clk_id> given to B<clock_adjtime>() is invalid for one of two reasons. Either the System-V style hard-coded positive clock ID value is out of range, or the dynamic I<clk_id> does not refer to a valid instance of a clock object. See B<clock_gettime>(2) for a discussion of dynamic clocks.
de: Das an B<clock_adjtime>() übergebene I<Uhrken> ist aus einem von zwei Gründen ungültig. Entweder ist der hartkodierte Uhrenkennungswert gemäß System-V außerhalb des Bereichs oder der dynamische I<Uhrken> bezieht sich nicht auf eine gültige Instanz eines Uhrenobjektes. Siehe B<clock_gettime>(2) für eine Besprechung von dynamischen Uhren.
fr: Le I<clk_id> donné à B<clock_adjtime>() n'est pas valable pour une de ces deux raisons. Soit la valeur positive de l'ID de l'horloge codée en dur à la manière de System-V dépasse l'intervalle, soit le I<clk_id> dynamique ne se rapporte pas à une instance valable d'une horloge. Voir B<clock_gettime>(2) pour un point sur les horloges dynamiques.
it: L'argomento I<clk_id> dato a B<clock_adjtime>() non è valido per una o due ragioni. Il valore di clock ID positivo in stile System-V prefissato è fuori intervallo, o il I<clk_id> dinamico non fa riferimento a un'istanza valida di un oggetto orologio (clock object). Si veda B<clock_gettime>(2) per una spiegazione degli orologi dinamici.

source: An attempt was made to set I<buf.tick> to a value outside the range 900000/B<HZ> to 1100000/B<HZ>, where B<HZ> is the system timer interrupt frequency.
de: Es wurde versucht, I<Puffer.tick> auf einen Wert außerhalb des Bereichs (900000/B<HZ>,1100000/B<HZ>), zu setzen, wobei B<HZ> die Interruptfrequenz des System-Timers ist.
fr: Une tentative a été faite de définir I<buf.tick> en dehors de l'intervalle 900000/B<HZ> à 1100000/B<HZ>, où B<HZ> est la fréquence d'interruption de l’ordonnanceur du système.
it: É stato fatto un tentativo per impostare I<buf.tick> a un valore esterno all'intervallo da 900000/B<HZ> a 1100000/ B<HZ>, dove B<HZ> è la frequenza dell'interruzione del timer di sistema.

source: The hot-pluggable device (like USB for example) represented by a dynamic I<clk_id> has disappeared after its character device was opened. See B<clock_gettime>(2) for a discussion of dynamic clocks.
de: Das zur Laufzeit einsteckbare Gerät (wie beispielsweise USB), das durch eine dynamische I<Uhrken> dargestellt wurde, ist nach der Öffnung seines zeichenbasierten Gerätes verschwunden. Siehe B<clock_gettime>(2) für eine Besprechung dynamischer Uhren.
fr: Le périphérique qu'on peut brancher à chaud (comme en USB par exemple) représenté par un I<clk_id> dynamique a disparu après avoir été ouvert. Voir B<clock_gettime>(2) pour un point sur les horloges dynamiques.
it: Il dispositivo collegabile "al volo" (come per esempio USB) rapresentato da un I<clk_id> dinamico è scomparso dopo che il suo dispositivo a caratteri è stato aperto. Si veda B<clock_gettime>(2) per una spiegazione degli orologi dinamici.

source: The given I<clk_id> does not support adjustment.
de: Das übergebene I<Uhrken> unterstützt keine Anpassung.
fr: Le I<clk_id> fourni ne prend pas en charge l'ajustement.
it: Il I<clk_id> dato non supporta regolazioni.

source: I<buf.modes> is neither 0 nor B<ADJ_OFFSET_SS_READ>, and the caller does not have sufficient privilege. Under Linux, the B<CAP_SYS_TIME> capability is required.
de: I<Puffer.mode> ist weder 0 noch B<ADJ_OFFSET_SS_READ> und der aufrufende Prozess verfügt nicht über ausreichende Privilegien. Unter Linux ist die B<CAP_SYS_TIME>-Capability erforderlich.
fr: I<buf.modes> n'est ni nul ni B<ADJ_OFFSET_SS_READ>, et l'appelant n'a pas suffisamment de privilèges. Sous Linux, la capacité B<CAP_SYS_TIME> est nécessaire.
it: I<buf.modes> non è né a zero né a B<ADJ_OFFSET_SS_READ>, e il chiamante non ha privilegi sufficienti. In Linux è richiesta l'abilitazione a B<CAP_SYS_TIME>.

source: ATTRIBUTES
de: ATTRIBUTE
fr: ATTRIBUTS
it: ATTRIBUTI

source: For an explanation of the terms used in this section, see B<attributes>(7).
de: Siehe B<attributes>(7) für eine Erläuterung der in diesem Abschnitt verwandten Ausdrücke.
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).
it: Per la spiegazione dei termini usati in questa sezione, vedere B<attributes>(7).
