Repository: sebras/manpages-l10n
Catalog: po/*/man2/arch_prctl.2.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: arch_prctl - set architecture-specific thread state
fr: arch_prctl - Définir l'état spécifique à l'architecture d’un processus

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: B<#include E<lt>asm/prctl.hE<gt>> /* Definition of B<ARCH_*> constants */ B<#include E<lt>sys/syscall.hE<gt>> /* Definition of B<SYS_*> constants */ B<#include E<lt>unistd.hE<gt>>
fr: B<#include E<lt>asm/prctl.hE<gt>> /* Définition des constantes B<ARCH_*> */ B<#include E<lt>sys/syscall.hE<gt>> /* Définition des constantes B<SYS_*> */ B<#include E<lt>unistd.hE<gt>>

source: I<Note>: glibc provides no wrapper for B<arch_prctl>(), necessitating the use of B<syscall>(2).
fr: I<Note> : la glibc ne fournit pas d'enveloppe autour de B<arch_prctl>(), nécessitant l'utilisation de B<syscall>(2).

source: B<arch_prctl>() sets architecture-specific process or thread state. I<code> selects a subfunction and passes argument I<addr> to it; I<addr> is interpreted as either an I<unsigned long> for the "set" operations, or as an I<unsigned long\ *>, for the "get" operations.
fr: La fonction B<arch_prctl>() définit l'état spécifique à l'architecture pour le thread ou le processus. I<code> sélectionne une sous\(hyfonction et lui passe l'argument I<addr> ; I<addr> est interprété comme un I<unsigned long> pour les opérations « set », ou comme un I<unsigned long\ *>, pour les opérations « get ».

source: Subfunctions for both x86 and x86-64 are:
fr: Les sous\(hyfonctions pour les architectures x86 et x86-64 sont\ :

source: B<ARCH_SET_CPUID> (since Linux 4.12)
fr: B<ARCH_SET_CPUID> (depuis Linux 4.12)

source: Enable (I<addr != 0>) or disable (I<addr == 0>) the I<cpuid> instruction for the calling thread. The instruction is enabled by default. If disabled, any execution of a I<cpuid> instruction will instead generate a B<SIGSEGV> signal. This feature can be used to emulate I<cpuid> results that differ from what the underlying hardware would have produced (e.g., in a paravirtualization setting).
fr: Activer (I<addr != 0>) ou désactiver (I<addr == 0>) l'instruction I<cpuid> pour le thread appelant. L'instruction est activée par défaut. Si elle est désactivée, l'exécution de l'instruction I<cpuid> générera un signal B<SIGSEGV>. Cette fonctionnalité peut être utilisée pour émuler des résultats de I<cpuid> qui diffèrent de ceux obtenus normalement sur le matériel sous-jacent (par exemple dans un environnement de paravirtualisation).

source: The B<ARCH_SET_CPUID> setting is preserved across B<fork>(2) and B<clone>(2) but reset to the default (i.e., I<cpuid> enabled) on B<execve>(2).
fr: Le paramètre B<ARCH_SET_CPUID> est préservé pendant un B<fork>(2) et un B<clone>(2) mais il est réinitialisé à l'état par défaut (donc I<cpuid> activé) en cas de B<execve>(2).

source: B<ARCH_GET_CPUID> (since Linux 4.12)
fr: B<ARCH_GET_CPUID> (depuis Linux 4.12)

source: Return the setting of the flag manipulated by B<ARCH_SET_CPUID> as the result of the system call (1 for enabled, 0 for disabled). I<addr> is ignored.
fr: Renvoyer la position de l'attribut manipulé par B<ARCH_SET_CPUID> sous forme d'un appel système (B<1> pour activé, B<0> pour désactivé). I<addr> est ignoré.

source: Subfunctions for x86-64 only are:
fr: Les sous\(hyfonctions pour l'architecture x86-64 sont\ :

source: Set the 64-bit base for the I<FS> register to I<addr>.
fr: Remplir la base 64 bits pour le registre I<FS> avec I<addr>.

source: Return the 64-bit base value for the I<FS> register of the calling thread in the I<unsigned long> pointed to by I<addr>.
fr: Renvoyer la valeur dans la base 64 bits pour le registre I<FS> du thread appelant dans la variable I<unsigned long> pointée par I<addr>.

source: Set the 64-bit base for the I<GS> register to I<addr>.
fr: Remplir la base 64 bits pour le registre I<GS> avec I<addr>.

source: Return the 64-bit base value for the I<GS> register of the calling thread in the I<unsigned long> pointed to by I<addr>.
fr: Renvoyer la valeur dans la base 64 bits pour le registre I<GS> du thread appelant dans la variable I<unsigned long> pointée par I<addr>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<arch_prctl>() returns 0; on error, -1 is returned, and I<errno> is set to indicate the error.
fr: S'il réussit, B<arch_prctl>() renvoie B<0>. En cas d'erreur, il renvoie B<-1> et remplit I<errno> avec la valeur d'erreur.

source: ERRORS
fr: ERREURS

source: I<addr> points to an unmapped address or is outside the process address space.
fr: I<addr> pointe vers une adresse non affectée ou est en dehors de l'espace d'adressage.

source: I<code> is not a valid subcommand.
fr: I<code> n'est pas une sous\(hycommande autorisée.

source: B<ARCH_SET_CPUID> was requested, but the underlying hardware does not support CPUID faulting.
fr: B<ARCH_SET_CPUID> a été sollicité mais le matériel ne prend pas en charge les erreurs CPUID.

source: I<addr> is outside the process address space.
fr: I<addr> pointe en dehors de l'espace d'adressage du processus.

source: B<arch_prctl>() is a Linux/x86-64 extension and should not be used in programs intended to be portable.
fr: B<arch_prctl>() est une extension Linux/x86-64 et ne doit pas être employée dans un programme portable.

source: B<arch_prctl>() is supported only on Linux/x86-64 for 64-bit programs currently.
fr: B<arch_prctl>() n'est pris en charge sur Linux/x86-64 que pour les programmes 64 bits.

source: The 64-bit base changes when a new 32-bit segment selector is loaded.
fr: La base 64 bits change lorsqu'un nouveau sélecteur de segment 32 bits est chargé.

source: B<ARCH_SET_GS> is disabled in some kernels.
fr: B<ARCH_SET_GS> est inactif dans certains noyaux.

source: Context switches for 64-bit segment bases are rather expensive. As an optimization, if a 32-bit TLS base address is used, B<arch_prctl>() may use a real TLS entry as if B<set_thread_area>(2) had been called, instead of manipulating the segment base register directly. Memory in the first 2\ GB of address space can be allocated by using B<mmap>(2) with the B<MAP_32BIT> flag.
fr: Les changements de contexte pour les bases 64 bits sont assez coûteux. Pour les optimiser, si une adresse de base 32 bits TLS est utilisée, B<arch_prctl>() peut utiliser une entrée TLS réelle comme si on avait appelé B<set_thread_area>(2) plutôt que de manipuler directement le registre de la base du segment. La mémoire dans les premiers 2\ Go d'adressage peut être allouée en utilisant B<mmap>(2) avec l'attribut B<MAP_32BIT>.

source: Because of the aforementioned optimization, using B<arch_prctl>() and B<set_thread_area>(2) in the same thread is dangerous, as they may overwrite each other's TLS entries.
fr: Du fait de l'optimisation précitée, l'utilisation de B<arch_prctl>() et de B<set_thread_area>(2) dans le même thread est dangereuse car elles peuvent écraser les entrées TLS entre elles.

source: I<FS> may be already used by the threading library. Programs that use B<ARCH_SET_FS> directly are very likely to crash.
fr: I<FS> peut être déjà utilisé par la bibliothèque de threading. Les programmes qui utilisent directement B<ARCH_SET_FS> vont très probablement planter.

source: SEE ALSO
fr: VOIR AUSSI

source: AMD X86-64 Programmer's manual
fr: Manuel du programmeur AMD X86-64

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: CONFORMING TO
fr: CONFORMITÉ

source: As of version 2.7, glibc provides no prototype for B<arch_prctl>(). You have to declare it yourself for now. This may be fixed in future glibc versions.
fr: Il n'y a pas de prototype pour B<arch_prctl>() dans la glibc 2.7. Vous devez le déclarer vous\(hymême. Cela sera peut\(hyêtre corrigé dans les futures versions de la glibc.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Subfunctions for x86-64 are:
fr: Les sous\(hyfonctions pour l'architecture x86-64 sont\ :

source: Return the 64-bit base value for the I<FS> register of the current thread in the I<unsigned long> pointed to by I<addr>.
fr: Renvoyer la valeur dans la base 64 bits pour le registre I<FS> du thread en cours dans la variable I<unsigned long> pointée par I<addr>.

source: Return the 64-bit base value for the I<GS> register of the current thread in the I<unsigned long> pointed to by I<addr>.
fr: Renvoyer la valeur dans la base 64 bits pour le registre I<GS> du thread en cours dans la variable I<unsigned long> pointée par I<addr>.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
