Repository: sebras/manpages-l10n
Catalog: po/*/man2/cacheflush.2.po
Languages: de, pt_br

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
pt_br: NOME

source: cacheflush - flush contents of instruction and/or data cache
de: cacheflush - Befehls- und/oder Datencache(s) zurückschreiben und freigeben
pt_br: cacheflush - descarrega o conteúdo do cache de instruções e/ou dados

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT
pt_br: SINOPSE

source: B<int cacheflush(void *>I<addr>B<, int >I<nbytes>B<, int >I<cache>B<);>
de: B<int cacheflush(void *>I<Adr>B<, int >I<aByte>B<, int >I<cache>B<);>

source: I<Note>: On some architectures, there is no glibc wrapper for this system call; see NOTES.
de: I<Hinweis:> Auf einigen Architekturen gibt es keinen Glibc-Wrapper für diesen Systemaufruf; siehe ANMERKUNGEN.

source: DESCRIPTION
de: BESCHREIBUNG
pt_br: DESCRIÇÃO

source: B<cacheflush>() flushes the contents of the indicated cache(s) for the user addresses in the range I<addr> to I<(addr+nbytes-1)>. I<cache> may be one of:
de: B<cacheflush>() schreibt den Inhalt der angegebenen Cache(s) für den Benutzeradressbereich I<Adr> bis I<(Adr+aByte-1)> in den Speicher zurück. I<cache> ist eine der folgenden Konstanten:
pt_br: B<cacheflush>() descarrega o conteúdo do(s) cache(s) indicado(s) pelos endereços do usuário no intervalo I<addr> até I<(addr+nbytes-1)>. I<cache> pode ser um entre:

source: Flush the instruction cache.
de: den Befehlscache freigeben.
pt_br: Descarrega o cache de instruções.

source: Write back to memory and invalidate the affected valid cache lines.
de: zurück in den Speicher schreiben und die betroffenen Bereiche des Caches für ungültig erklären, also freigeben.
pt_br: Escreve de volta para a memória e invalida as linhas válidas de cache afetadas.

source: Same as B<(ICACHE|DCACHE)>.
de: identisch mit B<(ICACHE>|I<DCACHE)>.
pt_br: O mesmo que B<(ICACHE|DCACHE)>.

source: RETURN VALUE
de: RÜCKGABEWERT
pt_br: VALOR DE RETORNO

source: B<cacheflush>() returns 0 on success. On error, it returns -1 and sets I<errno> to indicate the error.
de: B<cacheflush>() gibt 0 bei Erfolg zurück. Im Fehlerfall wird -1 zurückgeliefert und I<errno> gesetzt, um den Fehler anzuzeigen.

source: ERRORS
de: FEHLER
pt_br: ERROS

source: Some or all of the address range I<addr> to I<(addr+nbytes-1)> is not accessible.
de: Auf den Adressbereich von I<Adr> bis I<(Adr+aByte-1)> kann (ganz oder teilweise) nicht zugegriffen werden.
pt_br: Algum ou todos os endereços no intervalo de I<addr> até I<(addr+nbytes-1)> não estão acessíveis.

source: I<cache> is not one of B<ICACHE>, B<DCACHE>, or B<BCACHE> (but see BUGS).
de: Dem Parameter I<cache> ist keiner der Werte B<ICACHE>, B<DCACHE> oder B<BCACHE> zugewiesen (siehe aber auch FEHLER).
pt_br: I<cache> não é um de B<ICACHE>, B<DCACHE> ou B<BCACHE> (mas veja BUGS).

source: Historically, this system call was available on all MIPS UNIX variants including RISC/os, IRIX, Ultrix, NetBSD, OpenBSD, and FreeBSD (and also on some non-UNIX MIPS operating systems), so that the existence of this call in MIPS operating systems is a de-facto standard.
de: Historisch war dieser Systemaufruf auf allen MIPS-UNIX-Varianten, inklusive RISC/os, IRIX, Ultrix, NetBSD, OpenBSD und FreeBSD (und auf einigen nicht-UNIX-MIPS-Betriebssystemen) verfügbar, so dass die Existenz dieses Aufrufs in MIPS-Betriebssystemen der de-facto-Standard ist.
pt_br: Historicamente, essa chamada de sistema estava disponível em todas as variantes do MIPS UNIX, incluindo RISC/os, IRIX, Ultrix, NetBSD, OpenBSD e FreeBSD (e também em alguns sistemas operacionais MIPS não UNIX), de forma que a existência dessa chamada nos sistemas operacionais de MIPS é um padrão de fato.

source: Caveat
de: Vorsicht
pt_br: Problemas

source: B<cacheflush>() should not be used in programs intended to be portable. On Linux, this call first appeared on the MIPS architecture, but nowadays, Linux provides a B<cacheflush>() system call on some other architectures, but with different arguments.
de: B<cacheflush>() sollte nicht in Programmen verwandt werden, die portabel sein sollen. Unter Linux erschien dieser Aufruf zuerst auf der MIPS-Architektur, heutzutage stellt Linux einen Systemaufruf B<cacheflush>() aber auch auf einigen anderen Architekturen zur Verfügung, allerdings mit anderen Argumenten.
pt_br: B<cacheflush>() não deve ser usado em programas destinados a serem portáteis. No Linux, essa chamada apareceu pela primeira vez na arquitetura MIPS, mas atualmente o Linux fornece uma chamada do sistema B<cacheflush>() em algumas outras arquiteturas, mas com argumentos diferentes.

source: NOTES
de: ANMERKUNGEN

source: Architecture-specific variants
de: Architektur-spezifische Varianten

source: Glibc provides a wrapper for this system call, with the prototype shown in SYNOPSIS, for the following architectures: ARC, CSKY, MIPS, and NIOS2.
de: Glibc stellt einen Wrapper für die Architekturen ARC, CSKY, MIPS und NIOS2 für diesen Systemaufruf bereit, dessen Prototyp in der ÜBERSICHT gezeigt ist.

source: On some other architectures, Linux provides this system call, with different arguments:
de: Auf einigen anderen Architekturen stellt Linux diesen Systemaufruf mit anderen Argumenten bereit:

source: B<int cacheflush(unsigned long >I<addr>B<, int >I<scope>B<, int >I<cache>B<,> B< unsigned long >I<len>B<);>
de: B<int cacheflush(unsigned long >I<Adr>B<, int >I<scope>B<, int >I<cache>B<,> B< unsigned long >I<laenge>B<);>

source: B<int cacheflush(unsigned long >I<addr>B<, unsigned long >I<len>B<, int >I<op>B<);>
de: B<int cacheflush(unsigned long >I<Adr>B<, unsigned long >I<laenge>B<, int >I<op>B<);>

source: B<int cacheflush(unsigned int >I<start>B<, unsigned int >I<end>B<, int >I<cache>B<);>
de: B<int cacheflush(unsigned int >I<start>B<, unsigned int >I<ende>B<, int >I<cache>B<);>

source: On the above architectures, glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
de: Auf den obigen Architekturen stellt Glibc keinen Wrapper für diesen Systemaufruf bereit; rufen Sie ihn mittels B<syscall>(2) auf.

source: Unless you need the finer grained control that this system call provides, you probably want to use the GCC built-in function B<__builtin___clear_cache>(), which provides a portable interface across platforms supported by GCC and compatible compilers:
de: Sie werden wahrscheinlich die in GCC eingebaute Funktion B<__builtin___clear_cache>() verwenden wollen, die eine portierbare Schnittstelle über die von GCC und kompatiblen Compilern unterstützten Plattformen bereitstellt, außer Sie benötigen die feinere Steuerung, die dieser Systemaufruf bereitstellt.

source: B<void __builtin___clear_cache(void *>I<begin>B<, void *>I<end>B<);>
de: B<void __builtin___clear_cache(void *>I<anfang>B<, void *>I<ende>B<);>

source: On platforms that don't require instruction cache flushes, B<__builtin___clear_cache>() has no effect.
de: Auf Plattformen, bei denen der Instruktionszwischenspeicher nicht rausgeschrieben werden muss, hat B<__builtin___clear_cache>() keine Auswirkung.

source: I<Note>: On some GCC-compatible compilers, the prototype for this built-in function uses I<char *> instead of I<void *> for the parameters.
de: I<Hinweis>: Auf einigen GCC-kompatiblen Compilern verwendet der Prototyp für diese eingebaute Funktion I<char *> anstatt I<void *> für die Parameter.

source: BUGS
de: FEHLER

source: Linux kernels older than version 2.6.11 ignore the I<addr> and I<nbytes> arguments, making this function fairly expensive. Therefore, the whole cache is always flushed.
de: Linux-Kernel älter als Version 2.6.11 ignorieren die Argumente I<Adr> und I<aByte>. Dadurch wird die Funktion relativ aufwändig. Daher wird immer der ganze Cache freigegeben.
pt_br: Os kernels do Linux anteriores à versão 2.6.11 ignoram os argumentos I<addr> e I<nbytes>, tornando essa função bastante custosa. Portanto, todo o cache é sempre liberado.

source: This function always behaves as if B<BCACHE> has been passed for the I<cache> argument and does not do any error checking on the I<cache> argument.
de: Die Funktion verhält sich immer so, als ob B<BCACHE> als Argument für I<cache> übergeben worden wäre und führt keine Fehlerprüfung auf dem Argument I<cache> durch.
pt_br: Essa função sempre se comporta como se B<BCACHE> tivesse sido passado para o argumento I<cache> e não realiza nenhuma verificação de erro no argumento I<cache>.

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
pt_br: Manual do Programador do Linux

source: B<int cacheflush(char *>I<addr>B<, int >I<nbytes>B<, int >I<cache>B<);>
de: B<int cacheflush(char *>I<Adr>B<, int >I<aByte>B<, int >I<cache>B<);>

source: B<cacheflush>() returns 0 on success or -1 on error. If errors are detected, I<errno> will indicate the error.
de: B<cacheflush>() gibt 0 bei Erfolg oder -1 im Fehlerfall zurück. Sollten Fehler erkannt werden, ist der Fehler in I<errno> kodiert.
pt_br: B<cacheflush>() returna 0 em caso de sucesso ou -1 em caso de erro. Se erros forem detectados, I<errno> indicará o erro.

source: CONFORMING TO
de: KONFORM ZU
pt_br: DE ACORDO COM

source: COLOPHON
de: KOLOPHON
pt_br: COLOFÃO

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.09 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.09 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.04 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
