Repository: sebras/manpages-l10n
Catalog: po/*/man2/chdir.2.po
Languages: pt_br

source: Linux Programmer's Manual
pt_br: Manual do Programador do Linux

source: NAME
pt_br: NOME

source: chdir, fchdir - change working directory
pt_br: chdir, fchdir - altera o diretório de trabalho

source: SYNOPSIS
pt_br: SINOPSE

source: B<int chdir(const char *>I<path>B<);> B<int fchdir(int >I<fd>B<);>
pt_br: B<int chdir(const char *>I<caminho>B<);> B<int fchdir(int >I<fd>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
pt_br: Requisitos de macro de teste de recursos para o glibc (consulte B<feature_test_macros>(7)):

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc up to and including 2.19: */ _BSD_SOURCE
pt_br: _XOPEN_SOURCE E<gt>= 500 || /* Desde o glibc 2.12: */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc até e incluindo 2.19: */ _BSD_SOURCE

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: B<chdir>() changes the current working directory of the calling process to the directory specified in I<path>.
pt_br: B<chdir>() altera o diretório atual de trabalho do processo chamador para o diretório especificado em I<caminho>.

source: B<fchdir>() is identical to B<chdir>(); the only difference is that the directory is given as an open file descriptor.
pt_br: B<fchdir>() é idêntico a B<chdir>(); a única diferença é que o diretório é fornecido com um descritor de arquivo aberto.

source: RETURN VALUE
pt_br: VALOR DE RETORNO

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
pt_br: Em caso de sucesso, zero é retornado. Em caso de erro, -1 é retornado, e I<errno> é definido para indicar o erro.

source: ERRORS
pt_br: ERROS

source: Depending on the filesystem, other errors can be returned. The more general errors for B<chdir>() are listed below:
pt_br: Dependendo do sistema de arquivos, outros erros podem ser retornados. Os erros mais gerais para B<chdir>() são listados abaixo:

source: Search permission is denied for one of the components of I<path>. (See also B<path_resolution>(7).)
pt_br: Permissão de pesquisa é negada em um dos componentes de I<caminho>. (Veja também B<path_resolution>(7).)

source: I<path> points outside your accessible address space.
pt_br: I<caminho> aponta para fora de seu espaço de endereços acessíveis.

source: An I/O error occurred.
pt_br: Ocorreu um erro de E/S.

source: Too many symbolic links were encountered in resolving I<path>.
pt_br: Muitos links simbólicos foram encontrados na resolução de I<caminho>.

source: I<path> is too long.
pt_br: I<caminho> é muito longo.

source: The directory specified in I<path> does not exist.
pt_br: O diretório especificado em I<caminho> não existe.

source: Insufficient kernel memory was available.
pt_br: A memória do kernel disponível foi insuficiente.

source: A component of I<path> is not a directory.
pt_br: Um componente do I<caminho> não é um diretório.

source: The general errors for B<fchdir>() are listed below:
pt_br: Os erros gerais para B<fchdir>() são listados abaixo:

source: Search permission was denied on the directory open on I<fd>.
pt_br: Permissão de procura foi negada no diretório aberto em I<fd>.

source: I<fd> is not a valid file descriptor.
pt_br: I<fd> não é um descritor de arquivo válido.

source: I<fd> does not refer to a directory.
pt_br: I<fd> não se refere a um diretório.

source: CONFORMING TO
pt_br: DE ACORDO COM

source: NOTES
pt_br: NOTAS

source: The current working directory is the starting point for interpreting relative pathnames (those not starting with \(aq/\(aq).
pt_br: O diretório de trabalho atual é o ponto de partida para interpretar nomes de caminho relativos (aqueles que não começam com \(aq/\(aq)).

source: A child process created via B<fork>(2) inherits its parent's current working directory. The current working directory is left unchanged by B<execve>(2).
pt_br: Um processo filho criado via B<fork>(2) herda o diretório de trabalho atual de seu pai. O diretório de trabalho atual permanece inalterado por B<execve>(2).

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: COLOPHON
pt_br: COLOFÃO

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.13 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: B<int chdir(const char *>I<path>B<);>
pt_br: B<int chdir(const char *>I<caminho>B<);>

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc up to and including 2.19: */ _BSD_SOURCE
pt_br: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Desde glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc até e incluindo 2.19: */ _BSD_SOURCE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
pt_br: Em caso de sucesso, zero é retornado. Caso contrário, -1 é retornado, e I<errno> é selecionado adequadamente.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 4.16 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
