Repository: sebras/manpages-l10n
Catalog: po/*/man2/clock_getres.2.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: clock_getres, clock_gettime, clock_settime - clock and time functions
fr: clock_getres, clock_gettime, clock_settime - Fonctions d'horloge et de temps

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>), since glibc 2.17
fr: Bibliothèque C standard (I<libc>, I<-lc>), depuis la glibc 2.17

source: Before glibc 2.17, Real-time library (I<librt>, I<-lrt>)
fr: Avant la glibc 2.17, bibliothèque de temps réel (I<librt>, I<-lrt>)

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: The function B<clock_getres>() finds the resolution (precision) of the specified clock I<clockid>, and, if I<res> is non-NULL, stores it in the I<struct timespec> pointed to by I<res>. The resolution of clocks depends on the implementation and cannot be configured by a particular process. If the time value pointed to by the argument I<tp> of B<clock_settime>() is not a multiple of I<res>, then it is truncated to a multiple of I<res>.
fr: La fonction B<clock_getres>() cherche la résolution (précision) de l'horloge I<clockid> spécifiée et si I<res> est non NULL, elle l'enregistre dans la structure I<timespec> pointée par I<res>. La résolution des horloges dépend de l'implémentation et ne peut pas être configurée par un processus particulier. Si la valeur du temps pointé par l'argument I<tp> de B<clock_settime>() n'est pas un multiple de I<res>, cette valeur est tronquée à un multiple de I<res>.

source: The functions B<clock_gettime>() and B<clock_settime>() retrieve and set the time of the specified clock I<clockid>.
fr: Les fonctions B<clock_gettime>() et B<clock_settime>() récupèrent et configurent le temps de l'horloge I<clockid> spécifiée.

source: The I<res> and I<tp> arguments are B<timespec>(3) structures.
fr: Les arguments I<res> et I<tp> sont des structures B<timespec>(3).

source: The I<clockid> argument is the identifier of the particular clock on which to act. A clock may be system-wide and hence visible for all processes, or per-process if it measures time only within a single process.
fr: L'argument I<clockid> est l'identifiant d'une horloge particulière sur laquelle agir. Une horloge peut être globale au système, et par conséquent visible de tous les processus, ou propre à un processus, si elle mesure le temps uniquement pour celui-ci.

source: All implementations support the system-wide real-time clock, which is identified by B<CLOCK_REALTIME>. Its time represents seconds and nanoseconds since the Epoch. When its time is changed, timers for a relative interval are unaffected, but timers for an absolute point in time are affected.
fr: Toutes les implémentations prennent en charge l'horloge temps réel globale, laquelle est identifiée par B<CLOCK_REALTIME>. Son temps représente le nombre de secondes et nanosecondes écoulées depuis l'époque UNIX (1er\ janvier 1970 à\ 00:00:00 UTC). Lorsque son temps est modifié, les horloges mesurant un intervalle de temps ne sont pas affectées alors que celles indiquant une date (heure) absolue le sont.

source: More clocks may be implemented. The interpretation of the corresponding time values and the effect on timers is unspecified.
fr: Plusieurs horloges peuvent être implémentées. L'interprétation des valeurs de temps correspondantes et l'effet sur les temporisateurs ne sont pas spécifiés.

source: Sufficiently recent versions of glibc and the Linux kernel support the following clocks:
fr: Les versions suffisamment récentes de la glibc et du noyau Linux gèrent les horloges suivantes\ :

source: A settable system-wide clock that measures real (i.e., wall-clock) time. Setting this clock requires appropriate privileges. This clock is affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), and by the incremental adjustments performed by B<adjtime>(3) and NTP.
fr: Horloge système réglable qui mesure le temps réel (c'est-à-dire comme une pendule). Modifier cette horloge nécessite des privilèges adéquats. Cette horloge est concernée par les sauts discontinus de l'heure système (par exemple si l'administrateur modifie l'heure lui-même), et par les ajustements incrémentaux effectués par B<adjtime>(3) et NTP.

source: B<CLOCK_REALTIME_ALARM> (since Linux 3.0; Linux-specific)
fr: B<CLOCK_REALTIME_ALARM> (depuis Linux 3.0 ; spécifique à Linux)

source: Like B<CLOCK_REALTIME>, but not settable. See B<timer_create>(2) for further details.
fr: Comme B<CLOCK_REALTIME>, mais non réglable. Voir B<timer_create>(2) pour plus de détails.

source: B<CLOCK_REALTIME_COARSE> (since Linux 2.6.32; Linux-specific)
fr: B<CLOCK_REALTIME_COARSE> (depuis Linux 2.6.32 ; spécifique à Linux)

source: A faster but less precise version of B<CLOCK_REALTIME>. This clock is not settable. Use when you need very fast, but not fine-grained timestamps. Requires per-architecture support, and probably also architecture support for this flag in the B<vdso>(7).
fr: Horloge plus rapide mais moins précise que B<CLOCK_REALTIME>. Cette horloge n'est pas réglable. À utiliser pour obtenir rapidement des données d'horodatage avec une résolution grossière. Elle exige une prise en charge spécifique à chaque architecture et probablement d'être prise en charge par une architecture dans B<vdso>(7).

source: B<CLOCK_TAI> (since Linux 3.10; Linux-specific)
fr: B<CLOCK_TAI> (depuis Linux 3.10 ; spécifique à Linux)

source: A nonsettable system-wide clock derived from wall-clock time but ignoring leap seconds. This clock does not experience discontinuities and backwards jumps caused by NTP inserting leap seconds as B<CLOCK_REALTIME> does.
fr: Horloge système non réglable dérivée d’une pendule mais ignorant le franchissement de secondes. Cette horloge ne connaît ni discontinuités ni sauts en arrière suite à des insertions NTP de franchissement de secondes, contrairement à B<CLOCK_REALTIME>.

source: The acronym TAI refers to International Atomic Time.
fr: L'acronyme TAI renvoie à « International Atomic Time » (temps international atomique).

source: A nonsettable system-wide clock that represents monotonic time since\(emas described by POSIX\(em"some unspecified point in the past". On Linux, that point corresponds to the number of seconds that the system has been running since it was booted.
fr: Horloge système non réglable qui représente le temps monotone depuis — selon POSIX — « some unspecified point in the past » (un point indéfini du passé). Sur Linux, ce point correspond au nombre de secondes passées depuis le dernier démarrage du système.

source: The B<CLOCK_MONOTONIC> clock is not affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), but is affected by the incremental adjustments performed by B<adjtime>(3) and NTP. This clock does not count time that the system is suspended. All B<CLOCK_MONOTONIC> variants guarantee that the time returned by consecutive calls will not go backwards, but successive calls may\(emdepending on the architecture\(emreturn identical (not-increased) time values.
fr: L'horloge B<CLOCK_MONOTONIC> n'est pas concernée par les sauts discontinus de l'heure système (par exemple si l'administrateur modifie l'heure lui-même), mais est affectée par les ajustements incrémentaux effectués par B<adjtime>(3) et NTP. Cette horloge ne compte pas le temps durant lequel le système est en veille. Toutes les variantes de B<CLOCK_MONOTONIC> garantissent que le temps renvoyé par des appels consécutifs ne créeront pas de retour en arrière, tandis que les appels successifs — selon l'architecture — renvoient des valeurs temporelles identiques (sans augmentation).

source: B<CLOCK_MONOTONIC_COARSE> (since Linux 2.6.32; Linux-specific)
fr: B<CLOCK_MONOTONIC_COARSE> (depuis Linux 2.6.32 ; spécifique à Linux)

source: A faster but less precise version of B<CLOCK_MONOTONIC>. Use when you need very fast, but not fine-grained timestamps. Requires per-architecture support, and probably also architecture support for this flag in the B<vdso>(7).
fr: Horloge plus rapide mais moins précise que B<CLOCK_MONOTONIC>. À utiliser pour obtenir rapidement des données d'horodatage avec une résolution grossière. Elle exige une prise en charge spécifique à chaque architecture et probablement d'être prise en charge par une architecture dans B<vdso>(7).

source: B<CLOCK_MONOTONIC_RAW> (since Linux 2.6.28; Linux-specific)
fr: B<CLOCK_MONOTONIC_RAW> (depuis Linux 2.6.28 ; spécifique à Linux)

source: Similar to B<CLOCK_MONOTONIC>, but provides access to a raw hardware-based time that is not subject to NTP adjustments or the incremental adjustments performed by B<adjtime>(3). This clock does not count time that the system is suspended.
fr: Similaire à B<CLOCK_MONOTONIC>, mais fournit un accès direct à un temps matériel qui n'est pas sujet ni aux ajustements NTP ni aux ajustements incrémentaux effectués par B<adjtime>(3). Cette horloge ne compte pas le temps durant lequel le système est en veille.

source: B<CLOCK_BOOTTIME> (since Linux 2.6.39; Linux-specific)
fr: B<CLOCK_BOOTTIME> (depuis Linux 2.6.39 ; spécifique à Linux)

source: A nonsettable system-wide clock that is identical to B<CLOCK_MONOTONIC>, except that it also includes any time that the system is suspended. This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of B<CLOCK_REALTIME>, which may have discontinuities if the time is changed using B<settimeofday>(2) or similar.
fr: Horloge système non réglable identique à B<CLOCK_MONOTONIC>, mais qui prend également en compte le temps écoulé pendant la veille du système. Cela offre aux applications une horloge monotone tenant compte des veilles, sans avoir à s'occuper des problèmes de discontinuités de B<CLOCK_REALTIME> si l'horloge est mise à jour avec B<settimeofday>(2) ou équivalent.

source: B<CLOCK_BOOTTIME_ALARM> (since Linux 3.0; Linux-specific)
fr: B<CLOCK_BOOTTIME_ALARM> (depuis Linux 3.0 ; spécifique à Linux)

source: Like B<CLOCK_BOOTTIME>. See B<timer_create>(2) for further details.
fr: Comme B<CLOCK_BOOTTIME>. Voir B<timer_create>(2) pour plus de détails.

source: B<CLOCK_PROCESS_CPUTIME_ID> (since Linux 2.6.12)
fr: B<CLOCK_PROCESS_CPUTIME_ID> (depuis Linux 2.6.12)

source: This is a clock that measures CPU time consumed by this process (i.e., CPU time consumed by all threads in the process). On Linux, this clock is not settable.
fr: Il s'agit d'une horloge qui mesure le temps de processeur consommé par ce processus (à savoir le temps de processeur consommé par tous les threads du processus). Sur Linux, cette horloge n'est pas réglable.

source: B<CLOCK_THREAD_CPUTIME_ID> (since Linux 2.6.12)
fr: B<CLOCK_THREAD_CPUTIME_ID> (depuis Linux 2.6.12)

source: This is a clock that measures CPU time consumed by this thread. On Linux, this clock is not settable.
fr: Il s'agit d'une horloge qui mesure le temps de processeur consommé par ce thread. Sur Linux, cette horloge n'est pas réglable.

source: Linux also implements dynamic clock instances as described below.
fr: Linux implémente aussi des instances d'horloge dynamique comme décrit ci-dessous.

source: Dynamic clocks
fr: Horloges dynamiques

source: In addition to the hard-coded System-V style clock IDs described above, Linux also supports POSIX clock operations on certain character devices. Such devices are called "dynamic" clocks, and are supported since Linux 2.6.39.
fr: Outre les ID d'horloge à la manière System-V codés en dur décrits ci-dessus, Linux prend également en charge des opérations d'horloge POSIX sur certains fichiers de périphériques. De tels périphériques s'appellent des « horloges dynamiques » et ils sont gérés depuis Linux 2.6.39.

source: Using the appropriate macros, open file descriptors may be converted into clock IDs and passed to B<clock_gettime>(), B<clock_settime>(), and B<clock_adjtime>(2). The following example shows how to convert a file descriptor into a dynamic clock ID.
fr: Avec les macros adéquates, les descripteurs de fichier ouvert peuvent être convertis en ID d'horloge et passés à B<clock_gettime>(), B<clock_settime>() et B<clock_adjtime>(2). L'exemple suivant montre la manière de convertir un descripteur de fichier en ID d'horloge dynamique.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: B<clock_gettime>(), B<clock_settime>(), and B<clock_getres>() return 0 for success. On error, -1 is returned and I<errno> is set to indicate the error.
fr: B<clock_gettime>(), B<clock_settime>() et B<clock_getres>() renvoient B<0> si elles réussissent. Si elles échouent, B<-1> est renvoyé et I<errno> est positionné pour indiquer l'erreur.

source: ERRORS
fr: ERREURS

source: B<clock_settime>() does not have write permission for the dynamic POSIX clock device indicated.
fr: B<clock_settime>() n'a pas les droits d'écriture sur l'horloge POSIX dynamique spécifiée.

source: I<tp> points outside the accessible address space.
fr: I<tp> pointe en dehors de l'espace d'adressage accessible.

source: The I<clockid> specified is invalid for one of two reasons. Either the System-V style hard coded positive value is out of range, or the dynamic clock ID does not refer to a valid instance of a clock object.
fr: Le I<clockid> indiqué n'est pas valable pour une ou plusieurs raisons. Soit la valeur positive codée en dur à la manière de System-V est en dehors de l'intervalle, soit l'ID de l'horloge dynamique ne renvoie pas à une instance valable d'horloge.

source: (B<clock_settime>()): I<tp.tv_sec> is negative or I<tp.tv_nsec> is outside the range [0..999,999,999].
fr: (B<clock_settime>()) : I<tp.tv_sec> est négatif ou I<tp.tv_nsec> dépasse la plage [0..999 999 999].

source: The I<clockid> specified in a call to B<clock_settime>() is not a settable clock.
fr: La I<clockid> indiquée dans un appel à B<clock_settime>() n'est pas une horloge réglable.

source: B<EINVAL> (since Linux 4.3)
fr: B<EINVAL> (depuis Linux 4.3)

source: A call to B<clock_settime>() with a I<clockid> of B<CLOCK_REALTIME> attempted to set the time to a value less than the current value of the B<CLOCK_MONOTONIC> clock.
fr: Un appel à B<clock_settime>() avec un I<clockid> de B<CLOCK_REALTIME> a essayé de positionner l'heure sur une valeur inférieure à celle actuelle de l'horloge B<CLOCK_MONOTONIC>.

source: The hot-pluggable device (like USB for example) represented by a dynamic I<clk_id> has disappeared after its character device was opened.
fr: Le périphérique connectable à chaud (comme USB par exemple) représenté par un I<clk_id> dynamique a disparu après que son fichier de périphérique a été ouvert.

source: The operation is not supported by the dynamic POSIX clock device specified.
fr: L'opération n'est pas prise en charge par l'horloge POSIX dynamique indiquée.

source: B<clock_settime>() does not have permission to set the clock indicated.
fr: B<clock_settime>() n'a pas l'autorisation de configurer l'horloge spécifiée.

source: These system calls first appeared in Linux 2.6.
fr: Ces appels système sont apparus dans Linux 2.6.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: On POSIX systems on which these functions are available, the symbol B<_POSIX_TIMERS> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. The symbols B<_POSIX_MONOTONIC_CLOCK>, B<_POSIX_CPUTIME>, B<_POSIX_THREAD_CPUTIME> indicate that B<CLOCK_MONOTONIC>, B<CLOCK_PROCESS_CPUTIME_ID>, B<CLOCK_THREAD_CPUTIME_ID> are available. (See also B<sysconf>(3).)
fr: Sur les systèmes conformes à la spécification POSIX sur lesquels ces fonctions sont disponibles, la constante symbolique B<_POSIX_TIMERS> est définie dans I<E<lt>unistd.hE<gt>> comme étant une valeur supérieure à B<0>. Les constantes symboliques B<_POSIX_MONOTONIC_CLOCK>, B<_POSIX_CPUTIME>, B<_POSIX_THREAD_CPUTIME> indiquent que B<CLOCK_MONOTONIC>, B<CLOCK_PROCESS_CPUTIME_ID>, B<CLOCK_THREAD_CPUTIME_ID> sont disponibles. (Consultez aussi B<sysconf>(3).)

source: POSIX.1 specifies the following:
fr: POSIX.1 spécifie ce qui suit :

source: Setting the value of the B<CLOCK_REALTIME> clock via B<clock_settime>() shall have no effect on threads that are blocked waiting for a relative time service based upon this clock, including the B<nanosleep>() function; nor on the expiration of relative timers based upon this clock. Consequently, these time services shall expire when the requested relative interval elapses, independently of the new or old value of the clock.
fr: Configurer la valeur de l'horloge B<CLOCK_REALTIME> avec B<clock_settime>(2) ne doit avoir d'effet ni sur les threads bloqués attendant un service de temps relatif basé sur cette horloge, y compris la fonction B<nanosleep>()\ ; ni sur l'expiration des compteurs relatifs basés sur cette horloge. En conséquence, ces services de temps doivent expirer lorsque la durée relative demandée est atteinte, indépendamment de l'ancienne ou la nouvelle valeur de l'horloge.

source: According to POSIX.1-2001, a process with "appropriate privileges" may set the B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID> clocks using B<clock_settime>(). On Linux, these clocks are not settable (i.e., no process has "appropriate privileges").
fr: Selon POSIX.1-2001, un processus avec des «\ privilèges adéquats\ » peut changer les horloges B<CLOCK_PROCESS_CPUTIME_ID> et B<CLOCK_THREAD_CPUTIME_ID> avec B<clock_settime>(). Sous Linux, ces horloges ne peuvent pas être modifiées (c'est-à-dire qu'aucun processus n'a de «\ privilèges adéquats\ »).

source: C library/kernel differences
fr: différences entre bibliothèque C et noyau

source: On some architectures, an implementation of B<clock_gettime>() is provided in the B<vdso>(7).
fr: Sur certaines architectures; une implémentation de B<clock_gettime>() est fournie dans le B<vdso>(7).

source: Historical note for SMP systems
fr: Note historique pour les systèmes multiprocesseurs (SMP)

source: Before Linux added kernel support for B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID>, glibc implemented these clocks on many platforms using timer registers from the CPUs (TSC on i386, AR.ITC on Itanium). These registers may differ between CPUs and as a consequence these clocks may return B<bogus results> if a process is migrated to another CPU.
fr: Avant la prise en charge par le noyau Linux de B<CLOCK_PROCESS_CPUTIME_ID> et B<CLOCK_THREAD_CPUTIME_ID>, la glibc a mis en œuvre ces horloges sur bien des plate-formes en utilisant les registres temporisateurs des CPU (TSC sur i386, AR.ITC sur Itanium). Les registres peuvent être différents entre les CPU avec pour conséquence des B<résultats bidons> pour ces horloges si un processus a été transféré sur un autre CPU.

source: If the CPUs in an SMP system have different clock sources, then there is no way to maintain a correlation between the timer registers since each CPU will run at a slightly different frequency. If that is the case, then I<clock_getcpuclockid(0)> will return B<ENOENT> to signify this condition. The two clocks will then be useful only if it can be ensured that a process stays on a certain CPU.
fr: Si les CPU d'un système multiprocesseur ont différentes sources d'horloges, il n'y a aucun moyen de maintenir une corrélation entre les registres temporisateurs puisque chaque CPU tournera à une fréquence légèrement différente. Si c'est le cas, I<clock_getcpuclockid(0)> renverra B<ENOENT> pour signifier cette condition. Les deux horloges seront donc utiles si on peut être certain que le processus reste sur un CPU en particulier.

source: The processors in an SMP system do not start all at exactly the same time and therefore the timer registers are typically running at an offset. Some architectures include code that attempts to limit these offsets on bootup. However, the code cannot guarantee to accurately tune the offsets. Glibc contains no provisions to deal with these offsets (unlike the Linux Kernel). Typically these offsets are small and therefore the effects may be negligible in most cases.
fr: Les processeurs d'un système multiprocesseur ne démarrent pas exactement au même moment, ainsi les registres temporisateurs sont lancés avec un décalage. Certaines architectures incluent un code pour tenter de limiter ce décalage au démarrage. Toutefois, ce code ne garantit pas l'accord précis des décalages. La glibc ne contient rien pour gérer ces décalages (à la différence du noyau Linux). Typiquement, ces décalages sont petits et ainsi, leurs effets peuvent être négligeables dans la plupart des cas.

source: Since glibc 2.4, the wrapper functions for the system calls described in this page avoid the abovementioned problems by employing the kernel implementation of B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID>, on systems that provide such an implementation (i.e., Linux 2.6.12 and later).
fr: Depuis la glibc 2.4, les fonctions qui encapsulent les appels système décrits dans cette page permettent d'éviter les problèmes mentionnés ci-dessus en utilisant les horloges B<CLOCK_PROCESS_CPUTIME_ID> et B<CLOCK_THREAD_CPUTIME_ID> du noyau, lorsque celles-ci sont disponibles (c'est-à-dire les versions de Linux 2.6.12 et ultérieures).

source: EXAMPLES
fr: EXEMPLES

source: The program below demonstrates the use of B<clock_gettime>() and B<clock_getres>() with various clocks. This is an example of what we might see when running the program:
fr: Le programme ci-dessous montre l'utilisation de B<clock_gettime>() et de B<clock_getres>() avec différentes horloges. Il s'agit d'un exemple de ce qu'on pourrait voir en lançant le programme :

source: Program source
fr: Source du programme

source: Licensed under GNU General Public License v2 or later. */ #define _XOPEN_SOURCE 600 #include E<lt>stdbool.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>time.hE<gt>
fr: Sous licence GNU General Public v2 ou postérieure. */ #define _XOPEN_SOURCE 600 #include E<lt>stdbool.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>time.hE<

source: days = ts.tv_sec / SECS_IN_DAY; if (days E<gt> 0) printf("%ld days + ", days);
fr: days = ts.tv_sec / SECS_IN_DAY; if (days E<gt> 0) printf("%ld jours + ", days);

source: if (showRes) printf(" resolution: %10jd.%09ld\en", (intmax_t) ts.tv_sec, ts.tv_nsec); }
fr: if (showRes) printf(" résolution : %10jd.%09ld\en", (intmax_t) ts.tv_sec, ts.tv_nsec); }

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Link with I<-lrt> (only for glibc versions before 2.17).
fr: Lier avec I<-lrt> (seulement pour les versions de la glibc antérieures à 2.17).

source: The I<res> and I<tp> arguments are I<timespec> structures, as specified in I<E<lt>time.hE<gt>>:
fr: Les arguments I<res> et I<tp> sont des structures I<timespec> définies dans I<E<lt>time.hE<gt>>\ :

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
fr: struct timespec { time_t tv_sec; /* secondes */ long tv_nsec; /* nanosecondes */ };

source: B<clock_gettime>(), B<clock_settime>(), and B<clock_getres>() return 0 for success, or -1 for failure (in which case I<errno> is set appropriately).
fr: B<clock_gettime>(), B<clock_settime>() et B<clock_getres>() renvoient B<0> si elles réussissent ou B<-1> si elles échouent, auquel cas I<errno> est positionné en fonction.

source: CONFORMING TO
fr: CONFORMITÉ
