Repository: sebras/manpages-l10n
Catalog: po/*/man2/clock_getres.2.po
Languages: fr

source: Licensed under GNU General Public License v2 or later. */ #define _XOPEN_SOURCE 600 #include E<lt>time.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdbool.hE<gt> #include E<lt>unistd.hE<gt>
fr: Sous licence GNU General Public v2 ou postérieure. */ #define _XOPEN_SOURCE 600 #include E<lt>time.hE<gt> #include E<lt>stdint.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdbool.hE<gt> #include E<lt>unistd.hE<gt>

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The function B<clock_getres>() finds the resolution (precision) of the specified clock I<clk_id>, and, if I<res> is non-NULL, stores it in the I<struct timespec> pointed to by I<res>. The resolution of clocks depends on the implementation and cannot be configured by a particular process. If the time value pointed to by the argument I<tp> of B<clock_settime>() is not a multiple of I<res>, then it is truncated to a multiple of I<res>.
fr: La fonction B<clock_getres>() cherche la résolution (précision) de l'horloge I<clk_id> spécifiée et si I<res> est non NULL, elle l'enregistre dans la structure I<timespec> pointée par I<res>. La résolution des horloges dépend de l'implémentation et ne peut pas être configurée par un processus particulier. Si la valeur du temps pointé par l'argument I<tp> de B<clock_settime>() n'est pas un multiple de I<res>, cette valeur est tronquée à un multiple de I<res>.

source: The functions B<clock_gettime>() and B<clock_settime>() retrieve and set the time of the specified clock I<clk_id>.
fr: Les fonctions B<clock_gettime>() et B<clock_settime>() récupèrent et configurent le temps de l'horloge I<clk_id> spécifiée.

source: The I<clk_id> argument is the identifier of the particular clock on which to act. A clock may be system-wide and hence visible for all processes, or per-process if it measures time only within a single process.
fr: L'argument I<clk_id> est l'identifiant d'une horloge particulière sur laquelle agir. Une horloge peut être globale au système, et par conséquent visible de tous les processus, ou propre à un processus, si elle mesure le temps uniquement pour celui-ci.

source: System-wide clock that measures real (i.e., wall-clock) time. Setting this clock requires appropriate privileges. This clock is affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), and by the incremental adjustments performed by B<adjtime>(3) and NTP.
fr: Horloge système qui mesure le temps réel (c'est-à-dire comme une pendule). Modifier cette horloge nécessite des privilèges adéquats. Cette horloge est concernée par les sauts discontinus de l'heure système (c'est-à-dire si l'administrateur modifie l'heure lui-même), et par les ajustements incrémentaux effectués par B<adjtime>(3) et NTP.

source: A faster but less precise version of B<CLOCK_REALTIME>. Use when you need very fast, but not fine-grained timestamps. Requires per-architecture support, and probably also architecture support for this flag in the B<vdso>(7).
fr: Horloge plus rapide mais moins précise que B<CLOCK_REALTIME>. À utiliser pour obtenir rapidement des données d'horodatage avec une résolution grossière. Elle exige une prise en charge spécifique à chaque architecture et probablement d'être prise en charge par une architecture dans B<vdso>(7).

source: Clock that cannot be set and represents monotonic time since some unspecified starting point. This clock is not affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), but is affected by the incremental adjustments performed by B<adjtime>(3) and NTP.
fr: Horloge non modifiable qui mesure le temps monotonique à partir d'un point de départ non indiqué. Cette horloge n'est pas concernée par les sauts discontinus de l'heure système (par exemple si l'administrateur modifie l'heure lui-même), mais elle est concernée par les ajustements incrémentaux effectués par B<adjtime>(3) et NTP.

source: Similar to B<CLOCK_MONOTONIC>, but provides access to a raw hardware-based time that is not subject to NTP adjustments or the incremental adjustments performed by B<adjtime>(3).
fr: Similaire à B<CLOCK_MONOTONIC>, mais fournit un accès direct à un temps matériel qui n'est pas sujet ni aux ajustements NTP ni aux ajustements incrémentaux effectués par B<adjtime>(3).

source: Identical to B<CLOCK_MONOTONIC>, except it also includes any time that the system is suspended. This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of B<CLOCK_REALTIME>, which may have discontinuities if the time is changed using B<settimeofday>(2) or similar.
fr: Horloge identique à B<CLOCK_MONOTONIC>, mais qui prend également en compte le temps écoulé pendant la veille du système. Cela offre aux applications une horloge monotone tenant compte des veilles, sans avoir à s'occuper des problèmes de discontinuités de B<CLOCK_REALTIME> si l'horloge est mise à jour avec B<settimeofday>(2) ou équivalent.

source: Per-process CPU-time clock (measures CPU time consumed by all threads in the process).
fr: Horloge CPU par processus (mesurant le temps processeur consommé par tous les threads du processus).

source: Thread-specific CPU-time clock.
fr: Horloge CPU spécifique aux threads.

source: The I<clk_id> specified is not supported on this system.
fr: L'horloge I<clk_id> spécifiée n'est pas prise en charge sur ce système.

source: AVAILABILITY
fr: DISPONIBILITÉ

source: BUGS
fr: BOGUES

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
