Repository: sebras/manpages-l10n
Catalog: po/*/man2/epoll_ctl.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: epoll_ctl - control interface for an epoll file descriptor
fr: epoll_ctl - Interface de contrôle pour un descripteur de fichier epoll

source: This system call is used to add, modify, or remove entries in the interest list of the B<epoll>(7) instance referred to by the file descriptor I<epfd>. It requests that the operation I<op> be performed for the target file descriptor, I<fd>.
fr: Cet appel système est utilisé pour ajouter, modifier ou supprimer des entrées dans la liste des intérêts d'une instance B<epoll>(7) à laquelle se rapporte un descripteur de fichier I<epfd>. Il nécessite que l'opération I<op> soit effectuée sur le descripteur de fichier cible I<fd>.

source: Valid values for the I<op> argument are:
fr: Les valeurs autorisées pour le paramètre I<op> sont\ :

source: Add an entry to the interest list of the epoll file descriptor, I<epfd>. The entry includes the file descriptor, I<fd>, a reference to the corresponding open file description (see B<epoll>(7) and B<open>(2)), and the settings specified in I<event>.
fr: Ajouter une entrée à la liste d'intérêts du descripteur de fichier epoll I<epfd>. L'entrée comprend le descripteur de fichier, I<fd>, une référence à la description du fichier ouvert correspondant (voir B<epoll>(7) et B<open>(2)) et les paramètres indiqués dans I<event>.

source: Change the settings associated with I<fd> in the interest list to the new settings specified in I<event>.
fr: Passer les paramètres associés à I<fd> dans la liste des intérêts à ceux spécifiés dans I<event>.

source: Remove (deregister) the target file descriptor I<fd> from the interest list. The I<event> argument is ignored and can be NULL (but see BUGS below).
fr: Supprimer (désenregistrer) le descripteur de fichier cible I<fd> de la liste d'intérêts. Le paramètre I<event> est ignoré et peut être NULL (mais consultez la section BOGUES ci\(hydessous).

source: The I<event> argument describes the object linked to the file descriptor I<fd>. The I<struct epoll_event> is defined as:
fr: Le paramètre I<event> décrit l'objet lié au descripteur de fichier I<fd>. La I<struct epoll_event> est définie ainsi\ :

source: struct epoll_event { uint32_t events; /* Epoll events */ epoll_data_t data; /* User data variable */ };
fr: struct epoll_event { uint32_t events; /* Événements epoll */ epoll_data_t data; /* Variable utilisateur */ };

source: The I<data> member of the I<epoll_event> structure specifies data that the kernel should save and then return (via B<epoll_wait>(2)) when this file descriptor becomes ready.
fr: Le membre I<data> de la structure I<epoll_event> indique les données que le noyau doit enregistrer et renvoyer (via B<epoll_wait>(2)) quand ce descripteur de fichier est prêt.

source: The I<events> member of the I<epoll_event> structure is a bit mask composed by ORing together zero or more of the following available event types:
fr: Le membre I<events> de la structure I<epoll_event> est un masque de bits composé par un OU et zéro ou plusieurs des types d'événements disponibles suivants\ :

source: The associated file is available for B<read>(2) operations.
fr: Le fichier associé est disponible pour un appel B<read>(2).

source: The associated file is available for B<write>(2) operations.
fr: Le fichier associé est disponible pour un appel B<write>(2).

source: B<EPOLLRDHUP> (since Linux 2.6.17)
fr: B<EPOLLRDHUP> (depuis Linux 2.6.17)

source: Stream socket peer closed connection, or shut down writing half of connection. (This flag is especially useful for writing simple code to detect peer shutdown when using edge-triggered monitoring.)
fr: Le correspondant sur un socket en mode flux a fermé la connexion, ou bien a terminé d’écrire à la moitié de la connexion. (Cet attribut est particulièrement utile pour écrire du code simple permettant de détecter la fermeture de la connexion par surveillance du changement d’état.

source: There is an exceptional condition on the file descriptor. See the discussion of B<POLLPRI> in B<poll>(2).
fr: Il existe une condition exceptionnelle sur le descripteur de fichier. Voir le point sur B<POLLPRI> dans B<poll>(2).

source: Error condition happened on the associated file descriptor. This event is also reported for the write end of a pipe when the read end has been closed.
fr: Une condition d’erreur s'est produite sur le descripteur de fichier associé. Cet événement est aussi signalé pour la partie écriture d’un tube (pipe) lorsque la partie lecture a été arrêtée.

source: B<epoll_wait>(2) will always report for this event; it is not necessary to set it in I<events> when calling B<epoll_ctl>().
fr: B<epoll_wait>(2) signalera toujours cet événement, il n'est pas nécessaire de l'indiquer dans I<events> lors d'un appel B<epoll_ctl>().

source: Hang up happened on the associated file descriptor.
fr: Un blocage s'est produit sur le descripteur de fichier associé.

source: B<epoll_wait>(2) will always wait for this event; it is not necessary to set it in I<events> when calling B<epoll_ctl>().
fr: B<epoll_wait>(2) signalera toujours cet événement, il n'est pas nécessaire de l'indiquer dans I<events> lors d'un appel B<epoll_ctl>().

source: Note that when reading from a channel such as a pipe or a stream socket, this event merely indicates that the peer closed its end of the channel. Subsequent reads from the channel will return 0 (end of file) only after all outstanding data in the channel has been consumed.
fr: Remarquez que lors d'une lecture à partir d'un canal tel qu'un tube (pipe) ou un socket de flux, cet événement indique simplement que le correspondant a fermé sa partie de canal. Les lectures qui suivent issues du canal ne renverront B<0> (fin de fichier) qu'après que toutes les données restantes dans le canal aient été consommées.

source: Requests edge-triggered notification for the associated file descriptor. The default behavior for B<epoll> is level-triggered. See B<epoll>(7) for more detailed information about edge-triggered and level-triggered notification.
fr: Demande les notifications par changement d’état du descripteur de fichier associé. Par défaut B<epoll> fonctionne en détection de niveau. Consultez B<epoll>(7) pour plus de détails sur les comportements en détection de niveau et de changements d'état.

source: This flag is an input flag for the I<event.events> field when calling B<epoll_ctl>(); it is never returned by B<epoll_wait>(2).
fr: Cet drapeau est un drapeau d'entrée du champ I<event.events> lors d'un appel à B<epoll_ctl>() ; il n'est jamais renvoyé par B<epoll_wait>(2).

source: B<EPOLLONESHOT> (since Linux 2.6.2)
fr: B<EPOLLONESHOT> (depuis Linux 2.6.2)

source: Requests one-shot notification for the associated file descriptor. This means that after an event notified for the file descriptor by B<epoll_wait>(2), the file descriptor is disabled in the interest list and no other events will be reported by the B<epoll> interface. The user must call B<epoll_ctl>() with B<EPOLL_CTL_MOD> to rearm the file descriptor with a new event mask.
fr: Demande une notification en «\ coup unique\ » (Ndt\ : one\(hyshot) pour le descripteur de fichier associé. Cela signifie qu'après qu'un événement a été notifié par B<epoll_wait>(2) pour le descripteur de fichier, celui-ci est désactivé de la liste d'intérêts et aucun autre événement ne sera rapporté par l'interface B<epoll>. L'utilisateur doit appeler B<epoll_ctl>() avec B<EPOLL_CTL_MOD> pour réarmer le descripteur de fichier avec le nouveau masque d'événement.

source: B<EPOLLWAKEUP> (since Linux 3.5)
fr: B<EPOLLWAKEUP> (depuis Linux 3.5)

source: If B<EPOLLONESHOT> and B<EPOLLET> are clear and the process has the B<CAP_BLOCK_SUSPEND> capability, ensure that the system does not enter "suspend" or "hibernate" while this event is pending or being processed. The event is considered as being "processed" from the time when it is returned by a call to B<epoll_wait>(2) until the next call to B<epoll_wait>(2) on the same B<epoll>(7) file descriptor, the closure of that file descriptor, the removal of the event file descriptor with B<EPOLL_CTL_DEL>, or the clearing of B<EPOLLWAKEUP> for the event file descriptor with B<EPOLL_CTL_MOD>. See also BUGS.
fr: Si B<EPOLLONESHOT> et B<EPOLLET> sont vides et que le processus a la capacité B<CAP_BLOCK_SUSPEND>, s’assurer que le système n’entre pas en « veille » ou « hibernation » pendant que cet événement est en attente ou en train d’être traité. L’événement est considéré « traité » à partir du moment où il est renvoyé, par un appel d’B<epoll_wait>(2) avant le prochain appel d’B<epoll_wait>(2) sur le même descripteur de fichier B<epoll>(7), la fermeture de ce descripteur de fichier, la suppression du descripteur de fichier de l'événement avec B<EPOLL_CTL_DEL>, ou le vidage de B<EPOLLWAKEUP> pour le descripteur de fichier de l'événement avec B<EPOLL_CTL_MOD>. Consultez également B<BOGUES>.

source: B<EPOLLEXCLUSIVE> (since Linux 4.5)
fr: B<EPOLLEXCLUSIVE> (depuis Linux 4.5)

source: Sets an exclusive wakeup mode for the epoll file descriptor that is being attached to the target file descriptor, I<fd>. When a wakeup event occurs and multiple epoll file descriptors are attached to the same target file using B<EPOLLEXCLUSIVE>, one or more of the epoll file descriptors will receive an event with B<epoll_wait>(2). The default in this scenario (when B<EPOLLEXCLUSIVE> is not set) is for all epoll file descriptors to receive an event. B<EPOLLEXCLUSIVE> is thus useful for avoiding thundering herd problems in certain scenarios.
fr: Définit un mode de réveil exclusif pour le descripteur de fichier epoll qui va être attaché au descripteur de fichier cible, I<fd>. Quand un événement de réveil se produit et que plusieurs descripteurs de fichier epoll sont rattachés au même fichier cible en utilisant B<EPOLLEXCLUSIVE>, un ou plusieurs descripteurs de fichier epoll recevront un événement avec B<epoll_wait>(2). Le comportement par défaut dans ce scénario (quand B<EPOLLEXCLUSIVE> n'est pas défini) est que tous les descripteurs de fichier epoll reçoivent un événement. B<EPOLLEXCLUSIVE> est ainsi utile pour éviter des problèmes de « thundering herd » dans certains scénari.

source: If the same file descriptor is in multiple epoll instances, some with the B<EPOLLEXCLUSIVE> flag, and others without, then events will be provided to all epoll instances that did not specify B<EPOLLEXCLUSIVE>, and at least one of the epoll instances that did specify B<EPOLLEXCLUSIVE>.
fr: Si un même descripteur de fichier est dans plusieurs instances epoll, certains ayant l'attribut B<EPOLLEXCLUSIVE>, d'autres pas, les événements seront fournis à toutes les instances epoll qui n'ont pas indiqué B<EPOLLEXCLUSIVE> et à au moins une des instances epoll où B<EPOLLEXCLUSIVE> est indiqué.

source: The following values may be specified in conjunction with B<EPOLLEXCLUSIVE>: B<EPOLLIN>, B<EPOLLOUT>, B<EPOLLWAKEUP>, and B<EPOLLET>. B<EPOLLHUP> and B<EPOLLERR> can also be specified, but this is not required: as usual, these events are always reported if they occur, regardless of whether they are specified in I<events>. Attempts to specify other values in I<events> yield the error B<EINVAL>.
fr: Les valeurs suivantes peuvent être indiquées avec B<EPOLLEXCLUSIVE> : B<EPOLLIN>, B<EPOLLOUT>, B<EPOLLWAKEUP> et B<EPOLLET>. B<EPOLLHUP> et B<EPOLLERR> peuvent également être indiqués mais cela n'est pas nécessaire : comme d'habitude, ces événements sont toujours signalés s'ils arrivent, qu'ils soient ou non indiqués dans I<events>. Les tentatives d'indiquer d'autres valeurs dans I<events> provoquent l'erreur B<EINVAL>.

source: B<EPOLLEXCLUSIVE> may be used only in an B<EPOLL_CTL_ADD> operation; attempts to employ it with B<EPOLL_CTL_MOD> yield an error. If B<EPOLLEXCLUSIVE> has been set using B<epoll_ctl>(), then a subsequent B<EPOLL_CTL_MOD> on the same I<epfd>,\ I<fd> pair yields an error. A call to B<epoll_ctl>() that specifies B<EPOLLEXCLUSIVE> in I<events> and specifies the target file descriptor I<fd> as an epoll instance will likewise fail. The error in all of these cases is B<EINVAL>.
fr: B<EPOLLEXCLUSIVE> ne peut être utilisé que dans une opération B<EPOLL_CTL_ADD> ; les tentatives de l'utiliser avec B<EPOLL_CTL_MOD> provoquent une erreur. Si B<EPOLLEXCLUSIVE> a été positionné en utilisant B<epoll_ctl>(), le B<EPOLL_CTL_MOD> consécutif sur la même paire I<epfd>,\ I<fd> provoque une erreur. Un appel à B<epoll_ctl>() qui indique B<EPOLLEXCLUSIVE> dans I<events> et le descripteur de fichier cible I<fd> en instance epoll échouera probablement. Dans tous ces cas, l'erreur est B<EINVAL>.

source: The B<EPOLLEXCLUSIVE> flag is an input flag for the I<event.events> field when calling B<epoll_ctl>(); it is never returned by B<epoll_wait>(2).
fr: Le drapeau B<EPOLLEXCLUSIVE> est un drapeau d'entrée du champ I<event.events> lors d'un appel à B<epoll_ctl>() ; il n'est jamais renvoyé par B<epoll_wait>(2).

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: ERRORS
fr: ERREURS

source: I<epfd> or I<fd> is not a valid file descriptor.
fr: I<epfd> ou I<fd> n'est pas un descripteur de fichier valable.

source: I<op> was B<EPOLL_CTL_ADD>, and the supplied file descriptor I<fd> is already registered with this epoll instance.
fr: I<op> était B<EPOLL_CTL_ADD>, mais le descripteur de fichier I<fd> est déjà enregistré dans cette instance epoll.

source: I<epfd> is not an B<epoll> file descriptor, or I<fd> is the same as I<epfd>, or the requested operation I<op> is not supported by this interface.
fr: Le descripteur de fichier I<epfd>, n'est pas un descripteur B<epoll>, ou I<fd> et I<epfd> sont identiques, ou l'opération demandée I<op> n'est pas gérée par cette interface.

source: An invalid event type was specified along with B<EPOLLEXCLUSIVE> in I<events>.
fr: Un type d'événement non valable a été indiqué avec B<EPOLLEXCLUSIVE> dans I<events>.

source: I<op> was B<EPOLL_CTL_MOD> and I<events> included B<EPOLLEXCLUSIVE>.
fr: I<op> valait B<EPOLL_CTL_MOD> et I<events> comprenait un B<EPOLLEXCLUSIVE>.

source: I<op> was B<EPOLL_CTL_MOD> and the B<EPOLLEXCLUSIVE> flag has previously been applied to this I<epfd>,\ I<fd> pair.
fr: I<op> valait B<EPOLL_CTL_MOD> et le drapeau B<EPOLLEXCLUSIVE> a été appliqué précédemment à la paire I<epfd>,\ I<fd>.

source: B<EPOLLEXCLUSIVE> was specified in I<event> and I<fd> refers to an epoll instance.
fr: B<EPOLLEXCLUSIVE> était indiqué dans I<event> et I<fd> se rapporte à une instance epoll.

source: I<fd> refers to an epoll instance and this B<EPOLL_CTL_ADD> operation would result in a circular loop of epoll instances monitoring one another or a nesting depth of epoll instances greater than 5.
fr: I<fd> se rapporte à une instance epoll et cette opération B<EPOLL_CTL_ADD> créerait une boucle infinie d'instances epoll qui se surveilleraient mutuellement ou une profondeur d'arborescence d'instances epoll plus importante que 5.

source: I<op> was B<EPOLL_CTL_MOD> or B<EPOLL_CTL_DEL>, and I<fd> is not registered with this epoll instance.
fr: I<op> était B<EPOLL_CTL_MOD> ou B<EPOLL_CTL_DEL>, et I<fd> n'était pas enregistré dans cette instance epoll.

source: There was insufficient memory to handle the requested I<op> control operation.
fr: Pas assez de mémoire dans le noyau pour traiter l'opération I<op> demandée.

source: The limit imposed by I</proc/sys/fs/epoll/max_user_watches> was encountered while trying to register (B<EPOLL_CTL_ADD>) a new file descriptor on an epoll instance. See B<epoll>(7) for further details.
fr: La limite imposée par I</proc/sys/fs/epoll/max_user_watches> a été rencontrée en essayant d'enregistrer (B<EPOLL_CTL_ADD>) un nouveau descripteur de fichier sur une instance epoll. Consultez B<epoll>(7) pour plus de détails.

source: The target file I<fd> does not support B<epoll>. This error can occur if I<fd> refers to, for example, a regular file or a directory.
fr: Le ficher cible I<fd> ne prend pas en charge B<epoll>. Cette erreur peut arriver si I<fd> renvoie, par exemple, à un fichier ou à un répertoire régulier.

source: B<epoll_ctl>() was added to the kernel in version 2.6. Library support is provided in glibc starting with version 2.3.2.
fr: B<epoll_ctl>() a été ajouté au noyau dans la version 2.6. La prise en charge par la glibc a été ajoutée à partir de la version 2.3.2.

source: CONFORMING TO
fr: CONFORMITÉ

source: B<epoll_ctl>() is Linux-specific.
fr: B<epoll_ctl>() est spécifique à Linux.

source: The B<epoll> interface supports all file descriptors that support B<poll>(2).
fr: L'interface B<epoll> prend en charge tous les descripteurs de fichier gérés par B<poll>(2).

source: BUGS
fr: BOGUES

source: In kernel versions before 2.6.9, the B<EPOLL_CTL_DEL> operation required a non-null pointer in I<event>, even though this argument is ignored. Since Linux 2.6.9, I<event> can be specified as NULL when using B<EPOLL_CTL_DEL>. Applications that need to be portable to kernels before 2.6.9 should specify a non-null pointer in I<event>.
fr: Dans les versions du noyau antérieures à 2.6.9, l'opération B<EPOLL_CTL_DEL> nécessitait un pointeur non NULL dans I<event>, alors que ce paramètre est ignoré. Depuis Linux 2.6.9, I<event> peut être NULL lors d'une opération B<EPOLL_CTL_DEL>. Les applications qui doivent être portables pour les noyaux antérieurs à 2.6.9 devraient utiliser un pointeur différent de NULL dans I<event>.

source: If B<EPOLLWAKEUP> is specified in I<flags>, but the caller does not have the B<CAP_BLOCK_SUSPEND> capability, then the B<EPOLLWAKEUP> flag is I<silently ignored>. This unfortunate behavior is necessary because no validity checks were performed on the I<flags> argument in the original implementation, and the addition of the B<EPOLLWAKEUP> with a check that caused the call to fail if the caller did not have the B<CAP_BLOCK_SUSPEND> capability caused a breakage in at least one existing user-space application that happened to randomly (and uselessly) specify this bit. A robust application should therefore double check that it has the B<CAP_BLOCK_SUSPEND> capability if attempting to use the B<EPOLLWAKEUP> flag.
fr: Si B<EPOLLWAKEUP> est indiqué dans I<flags>, mais que l’appelant n’a pas la capacité B<CAP_BLOCK_SUSPEND>, alors l’attribut B<EPOLLWAKEUP> est I<ignoré silencieusement>. Ce comportement malheureux est nécessaire parce qu’aucune vérification de validité n’était réalisée sur l’argument I<flags> dans l’implémentation d’origine, et l’ajout du B<EPOLLWAKEUP> avec une vérification forçant l’échec de l’appel si l’appelant n’avait pas la capacité B<CAP_BLOCK_SUSPEND> cassait au moins une application en espace utilisateur qui indiquait aléatoirement (et inutilement) ce bit. Une application robuste devrait donc vérifier à deux fois d’avoir la capacité B<CAP_BLOCK_SUSPEND> avant d’essayer d’utiliser l’attribut B<EPOLLWAKEUP>.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: When successful, B<epoll_ctl>() returns zero. When an error occurs, B<epoll_ctl>() returns -1 and I<errno> is set appropriately.
fr: Lorsqu'il réussit, l'appel B<epoll_ctl>() renvoie zéro. Si une erreur se produit, B<epoll_ctl>() renvoie B<-1> et I<errno> contient le code approprié.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The I<events> member is a bit mask composed by ORing together zero or more of the following available event types:
fr: Le membre I<events> est un masque de bits composé à partir de OU et de zéro ou plusieurs des types d'événements disponibles suivants\ :

source: Stream socket peer closed connection, or shut down writing half of connection. (This flag is especially useful for writing simple code to detect peer shutdown when using Edge Triggered monitoring.)
fr: Le correspondant sur un socket en mode flux a fermé la connexion, ou bien a terminé d’écrire à la moitié de la connexion. (Cet attribut est particulièrement utile pour écrire du code simple permettant de détecter la fermeture de la connexion par surveillance du changement d’état.

source: Error condition happened on the associated file descriptor. This event is also reported for the write end of a pipe when the read end has been closed. B<epoll_wait>(2) will always report for this event; it is not necessary to set it in I<events>.
fr: Une condition d'erreur s'est produite sur le descripteur de fichier associé. Cet événement est aussi signalé pour la partie écriture d’un tube (pipe) lorsque la partie lecture a été arrêtée. B<epoll_wait>(2) signalera toujours cet événement, il n'est pas nécessaire de l'indiquer dans I<events>.

source: Hang up happened on the associated file descriptor. B<epoll_wait>(2) will always wait for this event; it is not necessary to set it in I<events>.
fr: Une déconnexion s'est produite sur le descripteur associé. B<epoll_wait>(2) attend toujours cet événement, il n'est pas nécessaire de l'indiquer dans I<events>.

source: Sets the Edge Triggered behavior for the associated file descriptor. The default behavior for B<epoll> is Level Triggered. See B<epoll>(7) for more detailed information about Edge and Level Triggered event distribution architectures.
fr: Définit le comportement en détection de changement d'état sur le descripteur. Par défaut B<epoll> fonctionne en détection de niveau. Consultez B<epoll>(7) pour plus de détails sur les comportements en détection de niveau et de changements d'état.

source: Sets the one-shot behavior for the associated file descriptor. This means that after an event is pulled out with B<epoll_wait>(2) the associated file descriptor is internally disabled and no other events will be reported by the B<epoll> interface. The user must call B<epoll_ctl>() with B<EPOLL_CTL_MOD> to rearm the file descriptor with a new event mask.
fr: Définit le comportement «\ coup unique\ » (Ndt\ : one\(hyshot) pour le descripteur de fichier associé. Cela signifie qu'après qu'un événement a été retiré avec B<epoll_wait>(2), le descripteur de fichier est désactivé de manière interne et aucun autre événement ne sera rapporté par l'interface B<epoll>. L'utilisateur doit appeler B<epoll_ctl>() avec B<EPOLL_CTL_MOD> pour réarmer le descripteur de fichier avec le nouveau masque d'événement.

source: I<fd> refers to an epoll instance and this B<EPOLL_CTL_ADD> operation would result in a circular loop of epoll instances monitoring one another.
fr: I<fd> se rapporte à une instance epoll et cette opération B<EPOLL_CTL_ADD> créerait une boucle infinie d'instances epoll qui se surveilleraient mutuellement.

source: B<epoll_ctl>() was added to the kernel in version 2.6.
fr: B<epoll_ctl>() a été ajouté au noyau Linux dans sa version 2.6.

source: B<epoll_ctl>() is Linux-specific. Library support is provided in glibc starting with version 2.3.2.
fr: B<epoll_ctl>() est spécifique à Linux. La prise en charge par la glibc a été ajoutée dans la version 2.3.2.
