Repository: sebras/manpages-l10n
Catalog: po/*/man2/fanotify_mark.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: fanotify_mark - add, remove, or modify an fanotify mark on a filesystem object
fr: fanotify_mark - Ajouter, supprimer ou modifier une marque fanotify sur un objet de système de fichiers

source: For an overview of the fanotify API, see B<fanotify>(7).
fr: Pour un aperçu de l’interface de programmation fanotify, consultez B<fanotify>(7).

source: B<fanotify_mark>() adds, removes, or modifies an fanotify mark on a filesystem object. The caller must have read permission on the filesystem object that is to be marked.
fr: B<fanotify_mark>() ajoute, supprime ou modifie une marque fanotify sur un objet de système de fichiers. L’appelant doit avoir le droit de lecture sur l’objet de système de fichiers à marquer.

source: The I<fanotify_fd> argument is a file descriptor returned by B<fanotify_init>(2).
fr: L’argument I<fanotify_fd> est un descripteur de fichier renvoyé par B<fanotify_init>(2).

source: I<flags> is a bit mask describing the modification to perform. It must include exactly one of the following values:
fr: I<flags> est un masque de bits décrivant la modification à réaliser. Il doit contenir exactement une des valeurs suivantes.

source: The events in I<mask> will be added to the mark mask (or to the ignore mask). I<mask> must be nonempty or the error B<EINVAL> will occur.
fr: Les événements dans I<mask> seront ajoutés au masque de marque (ou au masque ignore). I<mask> doit être non vide sinon l’erreur B<EINVAL> surviendra.

source: The events in argument I<mask> will be removed from the mark mask (or from the ignore mask). I<mask> must be nonempty or the error B<EINVAL> will occur.
fr: Les événements dans l’argument I<mask> seront supprimés du masque de marque (ou du masque ignore). I<mask> doit être non vide sinon l’erreur B<EINVAL> surviendra.

source: If none of the values above is specified, or more than one is specified, the call fails with the error B<EINVAL>.
fr: Si aucune des valeurs précédentes n’est indiquée, ou si plus d’une est indiquée, l’appel échoue avec l'erreur B<EINVAL>.

source: In addition, zero or more of the following values may be ORed into I<flags>:
fr: De plus, zéro ou plus des valeurs suivantes peuvent être incluses dans I<flags> (avec une opération OU bit à bit).

source: If I<pathname> is a symbolic link, mark the link itself, rather than the file to which it refers. (By default, B<fanotify_mark>() dereferences I<pathname> if it is a symbolic link.)
fr: Si I<pathname> est un lien symbolique, marquer le lien lui-même, plutôt que le fichier pointé (par défaut, B<fanotify_mark>() déréférence I<pathname> si c’est un lien symbolique).

source: If the filesystem object to be marked is not a directory, the error B<ENOTDIR> shall be raised.
fr: Si l’objet de système de fichiers à marquer n’est pas un répertoire, l’erreur B<ENOTDIR> surviendra.

source: B<FAN_MARK_FILESYSTEM> (since Linux 4.20)
fr: B<FAN_MARK_FILESYSTEM> (depuis Linux 4.20)

source: Mark the filesystem specified by I<pathname>. The filesystem containing I<pathname> will be marked. All the contained files and directories of the filesystem from any mount point will be monitored.
fr: Marquer le système de fichiers indiqué par I<pathname>. Le système de fichiers contenant I<pathname> sera marqué. Tous les fichiers et répertoires contenus dans le système de fichiers issus de n'importe quel point de montage seront surveillés.

source: The events in I<mask> shall be added to or removed from the ignore mask.
fr: Les événements dans I<mask> seront ajoutés ou supprimés du masque ignore.

source: The ignore mask shall survive modify events. If this flag is not set, the ignore mask is cleared when a modify event occurs for the ignored file or directory.
fr: Le masque ignore survivra aux événements de modification. Si cet attribut n’est pas défini, le masque ignore est effacé quand un événement de modification survient pour le fichier ou répertoire ignorés.

source: I<mask> defines which events shall be listened for (or which shall be ignored). It is a bit mask composed of the following values:
fr: I<mask> définit les événements à écouter (ou à ignorer). C’est un masque de bits constitué par les valeurs suivantes :

source: Create an event when a file or directory (but see BUGS) is accessed (read).
fr: Créer un événement quand un fichier ou un répertoire (mais consultez B<BOGUES>) est accédé (en lecture).

source: Create an event when a file is modified (write).
fr: Créer un événement quand un fichier est modifié (en écriture).

source: Create an event when a writable file is closed.
fr: Créer un événement quand un fichier modifiable en écriture est fermé.

source: Create an event when a read-only file or directory is closed.
fr: Créer un événement quand soit un fichier, soit un répertoire, en lecture seule, est fermé.

source: Create an event when a file or directory is opened.
fr: Créer un événement quand soit un fichier, soit un répertoire est ouvert.

source: B<FAN_OPEN_EXEC> (since Linux 5.0)
fr: B<FAN_OPEN_EXEC> (depuis Linux 5.0)

source: Create an event when a file is opened with the intent to be executed. See NOTES for additional details.
fr: Créer un événement quand un fichier est ouvert pour être exécuté. Voir les NOTES pour plus de détails.

source: B<FAN_ATTRIB> (since Linux 5.1)
fr: B<FAN_ATTRIB> (depuis Linux 5.1)

source: Create an event when the metadata for a file or directory has changed. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand les métadonnées d'un fichier ou d'un répertoire ont changé. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_CREATE> (since Linux 5.1)
fr: B<FAN_CREATE> (depuis Linux 5.1)

source: Create an event when a file or directory has been created in a marked parent directory. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier ou un répertoire a été créé dans un répertoire parent marqué. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_DELETE> (since Linux 5.1)
fr: B<FAN_DELETE> (depuis Linux 5.1)

source: Create an event when a file or directory has been deleted in a marked parent directory. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier ou un répertoire a été effacé d'un répertoire parent marqué. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_DELETE_SELF> (since Linux 5.1)
fr: B<FAN_DELETE_SELF> (depuis Linux 5.1)

source: Create an event when a marked file or directory itself is deleted. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier, ou même un répertoire, marqué est effacé. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_MOVED_FROM> (since Linux 5.1)
fr: B<FAN_MOVED_FROM> (depuis Linux 5.1)

source: Create an event when a file or directory has been moved from a marked parent directory. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier ou un répertoire a été déplacé depuis un répertoire parent marqué. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_MOVED_TO> (since Linux 5.1)
fr: B<FAN_MOVED_TO> (depuis Linux 5.1)

source: Create an event when a file or directory has been moved to a marked parent directory. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier ou un répertoire est déplacé vers un répertoire parent marqué. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: B<FAN_MOVE_SELF> (since Linux 5.1)
fr: B<FAN_MOVE_SELF> (depuis Linux 5.1)

source: Create an event when a marked file or directory itself has been moved. An fanotify group that identifies filesystem objects by file handles is required.
fr: Créer un événement quand un fichier, ou même un répertoire, marqué a été déplacé. Un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier est nécessaire.

source: Create an event when a permission to open a file or directory is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required.
fr: Créer un événement quand une permission d’ouvrir un fichier ou un répertoire est demandée. Un descripteur de fichier fanotify créé avec B<FAN_CLASS_PRE_CONTENT> ou B<FAN_CLASS_CONTENT> est nécessaire.

source: B<FAN_OPEN_EXEC_PERM> (since Linux 5.0)
fr: B<FAN_OPEN_EXEC_PERM> (depuis Linux 5.0)

source: Create an event when a permission to open a file for execution is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required. See NOTES for additional details.
fr: Créer un événement quand une permission d’ouvrir un fichier en exécution est demandée. Un descripteur de fichier fanotify créé avec B<FAN_CLASS_PRE_CONTENT> ou B<FAN_CLASS_CONTENT> est nécessaire. Voir les NOTES pour des détails supplémentaires.

source: Create an event when a permission to read a file or directory is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required.
fr: Créer un événement quand une permission de lire un fichier ou un répertoire est demandée. Un descripteur de fichier fanotify créé avec B<FAN_CLASS_PRE_CONTENT> ou B<FAN_CLASS_CONTENT> est nécessaire.

source: Create events for directories\(emfor example, when B<opendir>(3), B<readdir>(3) (but see BUGS), and B<closedir>(3) are called. Without this flag, events are created only for files. In the context of directory entry events, such as B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM>, and B<FAN_MOVED_TO>, specifying the flag B<FAN_ONDIR> is required in order to create events when subdirectory entries are modified (i.e., B<mkdir>(2)/ B<rmdir>(2)).
fr: Créer des événements pour les répertoires — par exemple quand B<opendir>(3), B<readdir>(3) (mais voir BOGUES) et B<closedir>(3) sont appelés. Sans cet attribut, les événements ne sont créés que pour les fichiers. Dans le contexte des événements d’entrée de répertoire tels que B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM> et B<FAN_MOVED_TO>, il est nécessaire d'indiquer le drapeau B<FAN_ONDIR> afin de créer des événements quand des entrées de sous-répertoire sont modifiées (à savoir B<mkdir>(2) ou B<rmdir>(2)).

source: Events for the immediate children of marked directories shall be created. The flag has no effect when marking mounts and filesystems. Note that events are not generated for children of the subdirectories of marked directories. More specifically, the directory entry modification events B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM>, and B<FAN_MOVED_TO> are not generated for any entry modifications performed inside subdirectories of marked directories. Note that the events B<FAN_DELETE_SELF> and B<FAN_MOVE_SELF> are not generated for children of marked directories. To monitor complete directory trees it is necessary to mark the relevant mount or filesystem.
fr: Des événements pour les enfants directs des répertoires marqués seront créés. L’attribut n’a pas d’effet lors du marquage de montages ou de systèmes de fichiers. Remarquez qu’aucun événement n’est créé pour les enfants des sous-répertoires des répertoires marqués. De manière plus spécifique, les événements de modification d’entrée d'un répertoire B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM> et B<FAN_MOVED_TO> ne sont pas générés pour des modifications effectuées dans les sous-répertoires de répertoires marqués. Remarquez que les événements B<FAN_DELETE_SELF> et B<FAN_MOVE_SELF> ne sont pas générés pour les enfants de répertoires marqués. Pour surveiller des arborescences complètes de répertoires, le montage ou le système de fichiers adéquat doit être marqué.

source: The following composed values are defined:
fr: Les valeurs composées suivantes sont définies :

source: A file is closed (B<FAN_CLOSE_WRITE>|B<FAN_CLOSE_NOWRITE>).
fr: Un fichier est fermé (B<FAN_CLOSE_WRITE>|B<FAN_CLOSE_NOWRITE>).

source: A file or directory has been moved (B<FAN_MOVED_FROM>|B<FAN_MOVED_TO>).
fr: Un fichier ou un répertoire a été déplacé (B<FAN_MOVED_FROM>|B<FAN_MOVED_TO>).

source: The filesystem object to be marked is determined by the file descriptor I<dirfd> and the pathname specified in I<pathname>:
fr: L’objet de système de fichiers à marquer est déterminé par le descripteur de fichier I<dirfd> et le chemin indiqué dans I<pathname> :

source: If I<pathname> is NULL, I<dirfd> defines the filesystem object to be marked.
fr: si I<pathname> est NULL, I<dirfd> définit l’objet de système de fichiers à marquer ;

source: If I<pathname> is NULL, and I<dirfd> takes the special value B<AT_FDCWD>, the current working directory is to be marked.
fr: si I<pathname> est NULL et que I<dirfd> prend la valeur spéciale B<AT_FDCWD>, le répertoire de travail actuel est à marquer ;

source: If I<pathname> is absolute, it defines the filesystem object to be marked, and I<dirfd> is ignored.
fr: si I<pathname> est absolu, il définit l’objet de système de fichiers à marquer et I<dirfd> est ignoré ;

source: If I<pathname> is relative, and I<dirfd> does not have the value B<AT_FDCWD>, then the filesystem object to be marked is determined by interpreting I<pathname> relative the directory referred to by I<dirfd>.
fr: si I<pathname> est relatif et que I<dirfd> n’a pas la valeur B<AT_FDCWD>, alors l’objet de système de fichiers à marquer est déterminé en interprétant I<pathname> comme relatif au répertoire référencé par I<dirfd> ;

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<fanotify_mark>() returns 0. On error, -1 is returned, and I<errno> is set to indicate the error.
fr: S'il réussit, B<fanotify_mark>() renvoie B<0>. En cas d'erreur, il renvoie B<-1> et remplit I<errno> avec la valeur d'erreur.

source: ERRORS
fr: ERREURS

source: An invalid file descriptor was passed in I<fanotify_fd>.
fr: Un descripteur de fichier incorrect a été passé dans I<fanotify_fd>.

source: I<pathname> is relative but I<dirfd> is neither B<AT_FDCWD> nor a valid file descriptor.
fr: I<pathname> est relatif mais I<dirfd> n'est ni B<AT_FDWCD> ni un descripteur de fichier valable.

source: An invalid value was passed in I<flags> or I<mask>, or I<fanotify_fd> was not an fanotify file descriptor.
fr: Une valeur incorrecte a été passée dans I<flags> ou I<mask>, ou I<fanotify_fd> n'était pas un descripteur de fichier fanotify.

source: The fanotify file descriptor was opened with B<FAN_CLASS_NOTIF> or the fanotify group identifies filesystem objects by file handles and mask contains a flag for permission events (B<FAN_OPEN_PERM> or B<FAN_ACCESS_PERM>).
fr: Le descripteur de fichier fanotify a été ouvert avec B<FAN_CLASS_NOTIF> ou le groupe fanotify identifie des systèmes de fichiers par des identificateurs de fichier et le masque contient un attribut pour des événements de permission (B<FAN_OPEN_PERM> ou B<FAN_ACCESS_PERM>).

source: The filesystem object indicated by I<pathname> is not associated with a filesystem that supports I<fsid> (e.g., B<tmpfs>(5)). This error can be returned only with an fanotify group that identifies filesystem objects by file handles.
fr: Le système de fichiers indiqué par I<pathname> n'est associé à aucun système de fichiers prenant en charge I<fsid> (comme B<tmpfs>(5)). Cette erreur ne peut être renvoyée qu'avec un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier.

source: The filesystem object indicated by I<dirfd> and I<pathname> does not exist. This error also occurs when trying to remove a mark from an object which is not marked.
fr: L’objet de système de fichiers indiqué par I<dirfd> et I<pathname> n’existe pas. Cette erreur survient aussi lors d’une tentative de supprimer une marque d’un objet qui n’est pas marqué.

source: The necessary memory could not be allocated.
fr: La mémoire nécessaire n’a pas pu être allouée.

source: The number of marks exceeds the limit of 8192 and the B<FAN_UNLIMITED_MARKS> flag was not specified when the fanotify file descriptor was created with B<fanotify_init>(2).
fr: Le nombre de marques dépasse la limite de 8192 et l’attribut B<FAN_UNLIMITED_MARKS> n’était pas indiqué quand le descripteur de fichier fanotify a été créé avec B<fanotify_init>(2).

source: This kernel does not implement B<fanotify_mark>(). The fanotify API is available only if the kernel was configured with B<CONFIG_FANOTIFY>.
fr: Ce noyau n’implémente pas B<fanotify_mark>(). L’interface de programmation fanotify n'est disponible que si le noyau a été configuré avec B<CONFIG_FANOTIFY>.

source: I<flags> contains B<FAN_MARK_ONLYDIR>, and I<dirfd> and I<pathname> do not specify a directory.
fr: I<flags> contient B<FAN_MARK_ONLYDIR>, et I<dirfd> et I<pathname> n’indiquent pas de répertoire.

source: The object indicated by I<pathname> is associated with a filesystem that does not support the encoding of file handles. This error can be returned only with an fanotify group that identifies filesystem objects by file handles.
fr: L'objet indiqué par I<pathname> est associé à un système de fichiers qui ne gère pas l'encodage d’identificateurs de fichier. Cette erreur ne peut être renvoyée que lorsqu'un groupe fanotify identifie les systèmes de fichiers par des identificateurs de fichier.

source: The filesystem object indicated by I<pathname> resides within a filesystem subvolume (e.g., B<btrfs>(5)) which uses a different I<fsid> than its root superblock. This error can be returned only with an fanotify group that identifies filesystem objects by file handles.
fr: Le système de fichiers indiqué par I<pathname> se trouve dans un sous-volume de système de fichiers (comme B<btrfs>(5)) qui utilise un I<fsid> différent de son superbloc racine. Cette erreur ne peut être renvoyée que par un groupe fanotify qui identifie les systèmes de fichiers par des identificateurs de fichier.

source: B<fanotify_mark>() was introduced in version 2.6.36 of the Linux kernel and enabled in version 2.6.37.
fr: B<fanotify_mark>() a été introduit dans la version 2.6.36 du noyau Linux et activé dans la version 2.6.37.

source: CONFORMING TO
fr: CONFORMITÉ

source: This system call is Linux-specific.
fr: Cet appel système est spécifique à Linux.

source: FAN_OPEN_EXEC and FAN_OPEN_EXEC_PERM
fr: FAN_OPEN_EXEC et FAN_OPEN_EXEC_PERM

source: When using either B<FAN_OPEN_EXEC> or B<FAN_OPEN_EXEC_PERM> within the I<mask>, events of these types will be returned only when the direct execution of a program occurs. More specifically, this means that events of these types will be generated for files that are opened using B<execve>(2), B<execveat>(2), or B<uselib>(2). Events of these types will not be raised in the situation where an interpreter is passed (or reads) a file for interpretation.
fr: Quand on utilise B<FAN_OPEN_EXEC> ou B<FAN_OPEN_EXEC_PERM> dans le I<mask>, des événements de ces types ne seront renvoyés que lorsque l'exécution directe d'un programme se produit. Plus particulièrement, cela signifie que les événements de ces types seront créés pour les fichiers ouverts en utilisant B<execve>(2), B<execveat>(2) ou B<uselib>(2). Les événements de ces types n'apparaîtront pas quand un interpréteur est passé pour interprétation d'un fichier (ou s'il est en cours de lecture).

source: Additionally, if a mark has also been placed on the Linux dynamic linker, a user should also expect to receive an event for it when an ELF object has been successfully opened using B<execve>(2) or B<execveat>(2).
fr: De plus, si une marque a aussi été placée sur l'éditeur de liens dynamiques de Linux, un utilisateur doit s'attendre aussi à recevoir un événement associé quand un objet ELF a été ouvert avec succès en utilisant B<execve>(2) ou B<execveat>(2).

source: For example, if the following ELF binary were to be invoked and a B<FAN_OPEN_EXEC> mark has been placed on /:
fr: Par exemple, si le binaire ELF suivant devait être appelé et si une marque B<FAN_OPEN_EXEC> a été placée sur I</> :

source: $ /bin/echo foo
fr: $ /bin/echo toto

source: The listening application in this case would receive B<FAN_OPEN_EXEC> events for both the ELF binary and interpreter, respectively:
fr: Dans ce cas, l'application à l'écoute devrait recevoir des événements B<FAN_OPEN_EXEC>, respectivement pour le binaire ELF et pour l'interpréteur :

source: BUGS
fr: BOGUES

source: The following bugs were present in Linux kernels before version 3.16:
fr: Les bogues suivants étaient présents dans les noyaux Linux avant la version 3.16 :

source: If I<flags> contains B<FAN_MARK_FLUSH>, I<dirfd>, and I<pathname> must specify a valid filesystem object, even though this object is not used.
fr: Si I<flags> contient B<FAN_MARK_FLUSH>, I<dirfd> et I<pathname> doivent indiquer un objet de système de fichiers valable, même si cet objet n’est pas utilisé.

source: B<readdir>(2) does not generate a B<FAN_ACCESS> event.
fr: B<readdir>(2) ne crée pas d’événement B<FAN_ACCESS> ;

source: If B<fanotify_mark>() is called with B<FAN_MARK_FLUSH>, I<flags> is not checked for invalid values.
fr: si B<fanotify_mark>() est appelé avec B<FAN_MARK_FLUSH>, les valeurs incorrectes de I<flags> ne sont pas vérifiées.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Remove either all marks for filesystems, all marks for mounts, or all marks for directories and files from the fanotify group. If I<flags> contains B<FAN_MARK_MOUNT>, all marks for mounts are removed from the group. If I<flags> contains B<FAN_MARK_FILESYSTEM>, all marks for filesystems are removed from the group. Otherwise, all marks for directories and files are removed. No flag other than and at most one of the flags B<FAN_MARK_MOUNT> or B<FAN_MARK_FILESYSTEM> can be used in conjunction with B<FAN_MARK_FLUSH>. I<mask> is ignored.
fr: Supprimer toutes les marques de systèmes de fichiers, de montages ou de répertoires et fichiers du groupe fanotify. Si I<flags> contient B<FAN_MARK_MOUNT>, toutes les marques de montage seront supprimées du groupe. Si I<flags> contient B<FAN_MARK_FILESYSTEM>, toutes les marques de systèmes de fichiers seront supprimées du groupe. Sinon, toutes les marques des répertoires et fichiers seront supprimées. Aucun autre attribut et au plus un des attributs B<FAN_MARK_MOUNT> ou B<FAN_MARK_FILESYSTEM> peut être utilisé avec B<FAN_MARK_FLUSH>. I<mask> est ignoré.
