Repository: sebras/manpages-l10n
Catalog: po/*/man2/fanotify_mark.2.po
Languages: fr

source: Mark the mount point specified by I<pathname>. If I<pathname> is not itself a mount point, the mount point containing I<pathname> will be marked. All directories, subdirectories, and the contained files of the mount point will be monitored. The events which require that filesystem objects are identified by file handles, such as B<FAN_CREATE>, B<FAN_ATTRIB>, B<FAN_MOVE>, and B<FAN_DELETE_SELF>, cannot be provided as a I<mask> when I<flags> contains B<FAN_MARK_MOUNT>. Attempting to do so will result in the error B<EINVAL> being returned.
fr: Marquer le point de montage indiqué par I<pathname>. Si I<pathname> n’est pas un point de montage lui-même, le point de montage contenant I<pathname> sera marqué. Tous les répertoires, sous-répertoires et fichiers contenus dans le point de montage seront surveillés. Les événements qui exigent que les systèmes de fichiers soient identifiés par des identificateurs de fichier, tels que B<FAN_CREATE>, B<FAN_ATTRIB>, B<FAN_MOVE> et B<FAN_DELETE_SELF>, ne peuvent pas être fournis comme I<mask> quand I<flags> contient B<FAN_MARK_MOUNT>. Une telle tentative renverra l'erreur B<EINVAL>.

source: If I<pathname> is relative, and I<dirfd> has the value B<AT_FDCWD>, then the filesystem object to be marked is determined by interpreting I<pathname> relative the current working directory.
fr: si I<pathname> est relatif et que I<dirfd> a la valeur B<AT_FDCWD>, alors l’objet de système de fichiers à marquer est déterminé en interprétant I<pathname> comme relatif au répertoire de travail actuel.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Create an event when an overflow of the event queue occurs. The size of the event queue is limited to 16384 entries if B<FAN_UNLIMITED_QUEUE> is not set in B<fanotify_init>(2).
fr: Créer un événement quand un dépassement de la file d'événements se produit. La taille de la file d'événements est limitée à 16384 entrées si B<FAN_UNLIMITED_QUEUE> n'est pas réglé dans B<fanotify_init>(2).

source: If I<flags> contains B<FAN_MARK_FLUSH>, I<dirfd> and I<pathname> must specify a valid filesystem object, even though this object is not used.
fr: si I<flags> contient B<FAN_MARK_FLUSH>, I<dirfd> et I<pathname> doivent indiquer un objet de système de fichiers valable, même si cet objet n’est pas utilisé ;

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
