Repository: sebras/manpages-l10n
Catalog: po/*/man2/fsync.2.po
Languages: nl

source: NAME
nl: NAAM

source: fsync, fdatasync - synchronize a file's in-core state with storage device
nl: fsync, fdatasync - synchroniseer de bestandsdata in het geheugen met het opslag apparaat

source: SYNOPSIS
nl: SAMENVATTING

source: B<int fsync(int >I<fd>B<);>
nl: B<int fsync(int >I<bi>B<);>

source: B<int fdatasync(int >I<fd>B<);>
nl: B<int fdatasync(int >I<bi>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: B<fsync>(): Glibc 2.16 and later: No feature test macros need be defined Glibc up to and including 2.15: _BSD_SOURCE || _XOPEN_SOURCE || /* Since glibc 2.8: */ _POSIX_C_SOURCE E<gt>= 200112L
nl: B<fsync>(): Glibc 2.16 en later: Geen feature test macros moet worden gedefinieerd Glibc tot en met 2.15: _BSD_SOURCE || _XOPEN_SOURCE || /* Vanaf glibc 2.8: */ _POSIX_C_SOURCE E<gt>= 200112L

source: DESCRIPTION
nl: BESCHRIJVING

source: B<fsync>() transfers ("flushes") all modified in-core data of (i.e., modified buffer cache pages for) the file referred to by the file descriptor I<fd> to the disk device (or other permanent storage device) so that all changed information can be retrieved even if the system crashes or is rebooted. This includes writing through or flushing a disk cache if present. The call blocks until the device reports that the transfer has completed.
nl: B<fsync>() transfereert ("spoelt") alle gewijzigde data in het geheugen (m.a.w. gemodificeerd buffer cache pagina´s) van het bestand aangewezen door de bestandsbeschrijving I<fd> naar het schijf apparaat (of een ander permanent opslag apparaat) zodat alle gewijzigde informatie kan worden opgehaald zelfs als het systeem vastloopt of wordt geherstart. Dit is omvat ook schrijven via of doorspoelen van een schijf cache als die aanwezig is). De aanroep blokkeert totdat het apparaat meldt dat de overdracht compleet is.

source: As well as flushing the file data, B<fsync>() also flushes the metadata information associated with the file (see B<inode>(7)).
nl: Net zoals het doorspoelen van de bestandsdata, spoelt B<fsync>() ook de metadata informatie die geassocieerd zijn met het bestand door (zie B<inode>(7)).

source: Calling B<fsync>() does not necessarily ensure that the entry in the directory containing the file has also reached disk. For that an explicit B<fsync>() on a file descriptor for the directory is also needed.
nl: Het aanroepen van B<fsync>() is geen garantie dat de ingang in de map die het bestand bevat ook op de schijf is terecht gekomen. Hiervoor is een expliciete aanroep van B<fsync>() met de bestandsbeschrijving voor die map ook nodig.

source: B<fdatasync>() is similar to B<fsync>(), but does not flush modified metadata unless that metadata is needed in order to allow a subsequent data retrieval to be correctly handled. For example, changes to I<st_atime> or I<st_mtime> (respectively, time of last access and time of last modification; see B<inode>(7)) do not require flushing because they are not necessary for a subsequent data read to be handled correctly. On the other hand, a change to the file size (I<st_size>, as made by say B<ftruncate>(2)), would require a metadata flush.
nl: B<fdatasync>() is vergelijkbaar met B<fsync>() maar spoelt gemodificeerde metadata niet door tenzij die metadata nodig is om een volgende data lees slag correct af te kunnen afhandelen. Bij voorbeeld veranderingen aan I<st_atime> of I<st_mtime> (respectievelijk tijd van laatste toegang en tijd van de laatste wijziging, zie B<inode>(7)) vereisen niet het doorspoelen omdat ze niet nodig zijn om de volgende data lees actie correct af te handelen. Aan de andere kant zou een verandering aan de bestandsgrootte (I<st_size> zoals gemaakt door zeg B<truncate>(2)) het doorspoelen van de metadata vereisen.

source: The aim of B<fdatasync>() is to reduce disk activity for applications that do not require all metadata to be synchronized with the disk.
nl: Het doel van B<fdatasync>() is om schijf activiteit te verminderen voor applicaties die niet vereisen dat metadata gesynchroniseerd wordt met de schijf.

source: RETURN VALUE
nl: EIND WAARDE

source: On success, these system calls return zero. On error, -1 is returned, and I<errno> is set to indicate the error.
nl: Bij succes retourneren deze systeem aanroepen. Bij falen wordt -1 teruggegeven, en I<errno> gezet om de fout aan te duiden.

source: ERRORS
nl: FOUTEN

source: I<fd> is not a valid open file descriptor.
nl: I<bi> is niet een geldige open-voor-schrijven bestandindicator.

source: An error occurred during synchronization. This error may relate to data written to some other file descriptor on the same file. Since Linux 4.13, errors from write-back will be reported to all file descriptors that might have written the data which triggered the error. Some filesystems (e.g., NFS) keep close track of which data came through which file descriptor, and give more precise reporting. Other filesystems (e.g., most local filesystems) will report errors to all file descriptors that were open on the file when the error was recorded.
nl: Een fout trad op gedurende synchroniseren. Deze fout kan verband houden met data geschreven naar een andere bestand beschrijving op hetzelfde bestand. Vanaf Linux 4.13 worden fouten van een schrijf-terug actie gerapporteerd naar alle bestandsbeschrijvingen die data geschreven kunnen hebben die de fout op riep. Sommige bestandssystemen (b.v. NFS) houden nauwgezet bij welke data kwam via welke bestandsbeschrijving en rapporteren dientengevolge nauwkeuriger. Andere bestandsystemen, meestal de lokale) zullen fouten naar alle bestandsbeschrijvingen rapporteren die open stonden op het bestand toen de fout werd opgetekend.

source: Disk space was exhausted while synchronizing.
nl: De schijfruimte raakte uitgeput tijdens het synchroniseren.

source: I<fd> is bound to a special file (e.g., a pipe, FIFO, or socket) which does not support synchronization.
nl: I<bi> is gebonden aan een speciaal bestand (b.v. een pijp, FIFO of socket) dat synchronseren niet ondersteund.

source: I<fd> is bound to a file on NFS or another filesystem which does not allocate space at the time of a B<write>(2) system call, and some previous write failed due to insufficient storage space.
nl: I<bi> is gebonden aan een bestand op NFS of een ander bestandsysteem dat geen ruimte toewijst ten tijde van de B<write>(2) systeem aanroep, en een eerdere schrijf actie faalde vanwege onvoldoende schijfruimte.

source: On POSIX systems on which B<fdatasync>() is available, B<_POSIX_SYNCHRONIZED_IO> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. (See also B<sysconf>(3).)
nl: Op POSIX systemen op welke B<fdatasync>() beschikbaar is, is B<_POSIX_SYNCHRONIZED_IO> gedefinieerd in I<E<lt>unistd.hE<gt>> met een waarde groter dan 0. (Zie ook B<sysconf>(3).)

source: NOTES
nl: OPMERKINGEN

source: On some UNIX systems (but not Linux), I<fd> must be a I<writable> file descriptor.
nl: Op sommige UNIX systemen (maar niet Linux), moet I<fd> een I<schrijfbare> bestandsbeschrijving zijn.

source: In Linux 2.2 and earlier, B<fdatasync>() is equivalent to B<fsync>(), and so has no performance advantage.
nl: In Linux 2.2 en eerder is B<fdatasync>() equivalent aan B<fsync>() en heeft daarom geen prestatie voordeel.

source: The B<fsync>() implementations in older kernels and lesser used filesystems do not know how to flush disk caches. In these cases disk caches need to be disabled using B<hdparm>(8) or B<sdparm>(8) to guarantee safe operation.
nl: De B<fsync>() implementatie in oudere kernels en minder gebruikte bestandssystemen weet niet hoe schijf caches door te spoelen. In deze gevallen moeten disk caches worden uitgezet door gebruik van B<hdparm>(8) of B<sdparm>(8) om een veilige operatie te garanderen.

source: SEE ALSO
nl: ZIE OOK

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: B<int fsync(int >I<fd>B<);>
nl: B<int fsync(int >I<bi>B<);>

source: B<int fdatasync(int >I<fd>B<);>
nl: B<int fdatasync(int >I<bi>B<);>

source: B<fsync>(): Glibc 2.16 and later: No feature test macros need be defined Glibc up to and including 2.15: _BSD_SOURCE || _XOPEN_SOURCE || /* since glibc 2.8: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
nl: B<fsync>(): Glibc 2.16 en later: Geen feature test macros moet worden gedefinieerd Glibc tot en met 2.15: _BSD_SOURCE || _XOPEN_SOURCE || /* since glibc 2.8: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: On success, these system calls return zero. On error, -1 is returned, and I<errno> is set appropriately.
nl: Bij success wordt nul teruggegeven. Bij falen wordt -1 teruggegeven, en I<errno> wordt naar behoren gezet.

source: CONFORMING TO
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: An error occurred during synchronization. This error may relate to data written to some other file descriptor on the same file. Since Linux 4.13, errors from write-back will be reported to all file descriptors that might have written the data which triggered the error. Some filesystems (e.g., NFS) keep close track of which data came through which file descriptor, and give more precise reporting. Other filesystems (e.g., most local filesystems) will report errors to all file descriptors that where open on the file when the error was recorded.
nl: Een fout trad op gedurende synchroniseren. Deze fout kan verband houden met data geschreven naar een andere bestand beschrijving op hetzelfde bestand. Vanaf Linux 4.13 worden fouten van een schrijf-terug actie gerapporteerd naar alle bestandsbeschrijvingen die data geschreven kunnen hebben die de fout op riep. Sommige bestandssystemen (b.v. NFS) houden nauwgezet bij welke data kwam via welke bestandsbeschrijving en rapporteren dientengevolge nauwkeuriger. Andere bestandsystemen, meestal de lokale) zullen fouten naar alle bestandsbeschrijvingen rapporteren die open stonden op het bestand toen de fout werd opgetekend.

source: AVAILABILITY
nl: BESCHIKBAARHEID

source: The B<fsync>() implementations in older kernels and lesser used filesystems does not know how to flush disk caches. In these cases disk caches need to be disabled using B<hdparm>(8) or B<sdparm>(8) to guarantee safe operation.
nl: De B<fsync>() implementatie in oudere kernels en minder gebruikte bestandssystemen weet niet hoe schijf caches door te spoelen. In deze gevallen moeten disk caches worden uitgezet door gebruik van B<hdparm>(8) of B<sdparm>(8) om een veilige operatie te garanderen.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
