Repository: sebras/manpages-l10n
Catalog: po/*/man2/getdomainname.2.po
Languages: pt_br

source: Linux Programmer's Manual
pt_br: Manual do Programador do Linux

source: NAME
pt_br: NOME

source: getdomainname, setdomainname - get/set NIS domain name
pt_br: getdomainname, setdomainname - obtém/define o nome de domínio NIS

source: SYNOPSIS
pt_br: SINOPSE

source: B<int getdomainname(char *>I<name>B<, size_t >I<len>B<);> B<int setdomainname(const char *>I<name>B<, size_t >I<len>B<);>
pt_br: B<int getdomainname(char *>I<nome>B<, size_t >I<comp>B<);> B<int setdomainname(const char *>I<nome>B<, size_t >I<comp>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
pt_br: Requisitos de macro de teste de recursos para o glibc (consulte B<feature_test_macros>(7)):

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500)
pt_br: Desde o glibc 2.21: _DEFAULT_SOURCE No glibc 2.19 e 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500) Até e incluindo o glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500)

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: These functions are used to access or to change the NIS domain name of the host system. More precisely, they operate on the NIS domain name associated with the calling process's UTS namespace.
pt_br: Essas funções são usadas para acessar ou alterar o nome de domínio NIS do sistema host. Mais precisamente, eles operam no nome de domínio NIS associado ao espaço de nome UTS do processo de chamada.

source: B<setdomainname>() sets the domain name to the value given in the character array I<name>. The I<len> argument specifies the number of bytes in I<name>. (Thus, I<name> does not require a terminating null byte.)
pt_br: B<setdomainname>() define o nome do domínio para o valor fornecido na matriz de caracteres I<nome>. O argumento I<comp> especifica o número de bytes em I<nome>. (Portanto, I<nome> não requer um byte nulo de terminação.)

source: B<getdomainname>() returns the null-terminated domain name in the character array I<name>, which has a length of I<len> bytes. If the null-terminated domain name requires more than I<len> bytes, B<getdomainname>() returns the first I<len> bytes (glibc) or gives an error (libc).
pt_br: B<getdomainname>() retorna o nome de domínio com terminação nula na matriz de caracteres I<nome>. a qual possui o comprimento de I<comp> bytes. Se o nome do domínio com terminação nula precisar de mais que I<comp> bytes, B<getdomainname>() retorna os primeiros I<comp> bytes (glibc) ou um erro (libc).

source: RETURN VALUE
pt_br: VALOR DE RETORNO

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
pt_br: Em caso de sucesso, zero é retornado. Em caso de erro, -1 é retornado, e I<errno> é definido para indicar o erro.

source: ERRORS
pt_br: ERROS

source: B<setdomainname>() can fail with the following errors:
pt_br: B<setdomainname>() pode falhar com os seguintes erros:

source: I<name> pointed outside of user address space.
pt_br: I<nome> aponta para fora do espaço de endereços.

source: I<len> was negative or too large.
pt_br: I<comp> era negativo ou muito grande.

source: The caller did not have the B<CAP_SYS_ADMIN> capability in the user namespace associated with its UTS namespace (see B<namespaces>(7)).
pt_br: O chamador não tinha a capacidade B<CAP_SYS_ADMIN> no espaço de nome de usuário associada ao seu espaço de nome UTS (consulte B<namespaces>(7)).

source: B<getdomainname>() can fail with the following errors:
pt_br: B<getdomainname>() pode falhar com os seguinte erros:

source: For B<getdomainname>() under libc: I<name> is NULL or I<name> is longer than I<len> bytes.
pt_br: Para B<getdomainname>(), na libc: I<nome> é NULL ou I<nome> ser maior que I<comp> bytes.

source: CONFORMING TO
pt_br: DE ACORDO COM

source: POSIX does not specify these calls.
pt_br: POSIX não especifíca esta chamada.

source: NOTES
pt_br: NOTAS

source: Since Linux 1.0, the limit on the length of a domain name, including the terminating null byte, is 64 bytes. In older kernels, it was 8 bytes.
pt_br: Desde o Linux 1.0, o limite para o comprimento de um nome de domínio, incluindo o byte nulo final, é de 64 bytes. Nos kernels antigos, eram 8 bytes.

source: On most Linux architectures (including x86), there is no B<getdomainname>() system call; instead, glibc implements B<getdomainname>() as a library function that returns a copy of the I<domainname> field returned from a call to B<uname>(2).
pt_br: Na maioria das arquiteturas Linux (incluindo x86), não há chamada de sistema B<getdomainname>(); em vez disso, o glibc implementa B<getdomainname>() como uma função de biblioteca que retorna uma cópia do campo I<domainname> retornada de uma chamada para B<uname>(2).

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: COLOPHON
pt_br: COLOFÃO

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.13 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
pt_br: Desde o glibc 2.21: _DEFAULT_SOURCE No glibc 2.19 e 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Até e incluindo o glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
pt_br: Em caso de sucesso, zero é retornado. Caso contrário, -1 é retornado, e I<errno> é selecionado adequadamente.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: These functions are used to access or to change the NIS domain name of the host system.
pt_br: Essas funções são usadas para acessar ou alterar o nome de domínio NIS do sistema host.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pt_br: Esta página faz parte da versão 4.16 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
