Repository: sebras/manpages-l10n
Catalog: po/*/man2/gethostname.2.po
Languages: nl, pt_br

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding
pt_br: Manual do Programador do Linux

source: NAME
nl: NAAM
pt_br: NOME

source: gethostname, sethostname - get/set hostname
nl: gethostname, sethostname - krijg/zet machinenaam
pt_br: gethostname, sethostname - obtém/define o nome da máquina

source: SYNOPSIS
nl: SAMENVATTING
pt_br: SINOPSE

source: B<int gethostname(char *>I<name>B<, size_t >I<len>B<);> B<int sethostname(const char *>I<name>B<, size_t >I<len>B<);>
nl: B<int gethostname(char *>I<naam>B<, size_t >I<len>B<);> B<int sethostname(const char *>I<naam>B<, size_t >I<len>B<);>
pt_br: B<int gethostname(char *>I<nome>B<, size_t >I<comp>B<);> B<int sethostname(const char *>I<nome>B<, size_t >I<comp>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):
pt_br: Requisitos de macro de teste de recursos para o glibc (consulte B<feature_test_macros>(7)):

source: _XOPEN_SOURCE E<gt>= 500 || _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 and earlier */ _BSD_SOURCE
nl: _XOPEN_SOURCE E<gt>= 500 || _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 en eerder */ _BSD_SOURCE
pt_br: _XOPEN_SOURCE E<gt>= 500 || _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 e anteriores */ _BSD_SOURCE

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500)
nl: Vanaf glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 en 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500) Tot en met glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500)
pt_br: Desde o glibc 2.21: _DEFAULT_SOURCE No glibc 2.19 e 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500) Até e incluindo o glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE E<lt> 500)

source: DESCRIPTION
nl: BESCHRIJVING
pt_br: DESCRIÇÃO

source: These system calls are used to access or to change the system hostname. More precisely, they operate on the hostname associated with the calling process's UTS namespace.
nl: Deze systeem aanroepen worden gebruikt om de machinenaam van het systeem op te vragen of te veranderen. Preciezer gezegd, ze werken op de machinenaam die geassocieerd is met de UTS naamruimte van het aanroepende proces.
pt_br: Estas chamadas de sistema são usadas para acessar ou alterar o nome da máquina do processador atual. Mais precisamente, elas operam no nome de máquina associado com o espaço de nomes de UTS do processo chamador.

source: B<sethostname>() sets the hostname to the value given in the character array I<name>. The I<len> argument specifies the number of bytes in I<name>. (Thus, I<name> does not require a terminating null byte.)
nl: B<sethostname>() zet de machinenaam op de waarde gegeven door de tekenreeks I<naam>. Het I<len> argument specificeert het aantal bytes in I<naam>. (Daarom vereist I<naam> geen afsluitend NULL byte.)
pt_br: B<sethostname>() define o nome de máquina com o valor fornecido na matriz de caracteres I<name>. O argumento I<len> especifica o número de bytes em I<name>. (Portanto, I<name> não requer um byte nulo final.)

source: B<gethostname>() returns the null-terminated hostname in the character array I<name>, which has a length of I<len> bytes. If the null-terminated hostname is too large to fit, then the name is truncated, and no error is returned (but see NOTES below). POSIX.1 says that if such truncation occurs, then it is unspecified whether the returned buffer includes a terminating null byte.
nl: B<gethostname>() retourneert een met NULL afgesloten machinenaam in de tekenreeks I<naam>, die een lengte van I<len> bytes heeft. Als de met NULL afgesloten machinenaam te lang is om te passen, dan wordt de naam afgekapt, en geen fout teruggegeven (let op: lees OPMERKINGEN hieronder). POSIX.1 zegt dat als dit afkappen optreedt, dat het niet bepaald is of de teruggegeven buffer een afsluitende NULL bevat of niet.
pt_br: B<gethostname>() retorna o nome da máquina terminado em nulo no vetor de caracteres I<name>, que possui um comprimento de I<len> bytes. Se o nome da máquina terminado em nulo for muito grande para caber, o nome será truncado e nenhum erro será retornado (mas consulte as NOTAS abaixo). O POSIX.1 diz que, se esse truncamento ocorrer, não será especificado se o buffer retornado inclui um byte nulo final.

source: RETURN VALUE
nl: EIND WAARDE
pt_br: VALOR DE RETORNO

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.
pt_br: Em caso de sucesso, zero é retornado. Em caso de erro, -1 é retornado, e I<errno> é definido para indicar o erro.

source: ERRORS
nl: FOUTEN
pt_br: ERROS

source: I<name> is an invalid address.
nl: I<naam> is een ongeldig adres.
pt_br: I<name> é um endereço inválido.

source: I<len> is negative or, for B<sethostname>(), I<len> is larger than the maximum allowed size.
nl: I<len> is negatief of, voor B<sethostname>(), I<len> is groter dat de maximum toegestane maat.
pt_br: I<len> é negativo ou, para B<sethostname>(), I<len> é maior que o tamanho permitido.

source: (glibc B<gethostname>()) I<len> is smaller than the actual size. (Before version 2.1, glibc uses B<EINVAL> for this case.)
nl: (glibc B<gethostname>()) I<len> is kleiner dan de benodigde grootte. (Voor version 2.1, gebruikte glibc in dit geval B<EINVAL>.)
pt_br: (glibc B<gethostname>()) I<len> é menor que o tamanho real. (Antes da versão 2.1, glibc usa B<EINVAL> para este caso.)

source: For B<sethostname>(), the caller did not have the B<CAP_SYS_ADMIN> capability in the user namespace associated with its UTS namespace (see B<namespaces>(7)).
nl: Met B<sethostname>() had de aanroeper niet de benodigde B<CAP_SYS_ADMIN> capaciteit in de gebruiker naamruimte geassocieerd met zijn UTS naamruimte (zie B<namespaces>(7)).
pt_br: Para B<sethostname>(), o chamador não tinha a capacidade B<CAP_SYS_ADMIN> no espaço de nomes de usuário associado ao seu espaço de nomes UTS (consulte B<namespaces>(7)).

source: CONFORMING TO
nl: VOLDOET AAN
pt_br: DE ACORDO COM

source: SVr4, 4.4BSD (these interfaces first appeared in 4.2BSD). POSIX.1-2001 and POSIX.1-2008 specify B<gethostname>() but not B<sethostname>().
nl: SVr4, 4.4BSD (deze functie verscheen voor het eerst in 4.2BSD).POSIX.1-2001 en POSIX.1-2008 bepalen B<gethostname>(), maar niet B<sethostname>().
pt_br: SVr4, 4.4BSD (esta função apareceu primeiramente no 4.2BSD). POSIX.1-2001 e POSIX.1-2008 especifica B<gethostname>(), mas não B<sethostname>().

source: NOTES
nl: OPMERKINGEN
pt_br: NOTAS

source: SUSv2 guarantees that "Host names are limited to 255 bytes". POSIX.1 guarantees that "Host names (not including the terminating null byte) are limited to B<HOST_NAME_MAX> bytes". On Linux, B<HOST_NAME_MAX> is defined with the value 64, which has been the limit since Linux 1.0 (earlier kernels imposed a limit of 8 bytes).
nl: SUSv2 garandeert dat "Machinenamen beperkt zijn tot 255 bytes". POSIX.1 garandeert dat "Machinenamen (exclusief het afsluitende NULL byte) beperkt zijn tot B<HOST_NAME_MAX> bytes". Op Linux, is B<HOST_NAME_MAX> is gedefinieerd met de waarde 64, hetgeen de limiet is geweest sinds Linux 1.0 (eerdere kernels kenden een limiet van 8 bytes).
pt_br: O SUSv2 garante que "Os nomes de máquina estão limitados a 255 bytes". O POSIX.1 garante que "Os nomes de máquina (não incluindo o byte nulo final) são limitados a B<HOST_NAME_MAX> bytes". No Linux, B<HOST_NAME_MAX> é definido com o valor 64, que tem sido o limite desde o Linux 1.0 (os kernels anteriores impuseram um limite de 8 bytes).

source: C library/kernel differences
nl: C library/kernel verschillen
pt_br: Diferenças entre kernel/biblioteca C

source: The GNU C library does not employ the B<gethostname>() system call; instead, it implements B<gethostname>() as a library function that calls B<uname>(2) and copies up to I<len> bytes from the returned I<nodename> field into I<name>. Having performed the copy, the function then checks if the length of the I<nodename> was greater than or equal to I<len>, and if it is, then the function returns -1 with I<errno> set to B<ENAMETOOLONG>; in this case, a terminating null byte is not included in the returned I<name>.
nl: De GNU C bibliotheek gebruikt de B<gethostname>() systeem aanroep niet; in plaats daarvan implementeert hij B<gethostname>() als een bibliotheek functie die B<uname>(2) aanroept en vervolgens maximaal I<len> bytes van het teruggegeven I<nodenaam> veld naar I<naam> kopieert. Na het uitvoeren van de kopie controleert de functie of de lengte van I<nodenaam> groter of gelijk was aan I<len> en als dat het geval was dan geeft de functie -1 terug en wordt I<errno> gezet op B<ENAMETOOLONG>; in dit geval wordt het afsluitend NULL byte niet toegevoegd aan de teruggegeven I<naam>.
pt_br: A biblioteca GNU C não emprega a chamada de sistema B<gethostname>(); em vez disso, implementa B<gethostname>() como uma função de biblioteca que chama B<uname>(2) e copia até I<len> bytes do campo I<nodename> retornado em I<name>. Depois de executar a cópia, a função verifica se o comprimento de I<nodename> foi maior ou igual a I<len> e, se for, então a função retorna -1 com I<errno> definido como B<ENAMETOOLONG >; nesse caso, um byte nulo final não é incluído no I<name> retornado.

source: Versions of glibc before 2.2 handle the case where the length of the I<nodename> was greater than or equal to I<len> differently: nothing is copied into I<name> and the function returns -1 with I<errno> set to B<ENAMETOOLONG>.
nl: Versies van glibc voor 2.2 behandelden het geval waar de lengte van de I<nodenaam> groter of gelijk was aan I<len> anders: niets werd gekopieerd naar I<naam> en de functie retourneert -1 met I<errno> gezet op B<ENAMETOOLONG>.
pt_br: As versões do glibc anteriores à 2.2 tratam do caso em que o comprimento de I<nodename> era maior ou igual a I<len> de maneira diferente: nada é copiado em I<name> e a função retorna -1 com I<errno> definido como B<ENAMETOOLONG>.

source: SEE ALSO
nl: ZIE OOK
pt_br: VEJA TAMBÉM

source: COLOPHON
nl: COLOFON
pt_br: COLOFÃO

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 5.13 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: B<int gethostname(char *>I<name>B<, size_t >I<len>B<);>
nl: B<int gethostname(char *>I<naam>B<, size_t >I<len>B<);>

source: B<int sethostname(const char *>I<name>B<, size_t >I<len>B<);>
nl: B<int sethostname(const char *>I<naam>B<, size_t >I<len>B<);>

source: Since glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
nl: Sinds glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
pt_br: Desde o glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
nl: || /* Sinds glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
pt_br: || /* Desde o glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
nl: Sinds glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 en 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Tot en met glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
pt_br: Desde o glibc 2.21: _DEFAULT_SOURCE No glibc 2.19 e 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Até e incluindo o glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.
pt_br: Em caso de sucesso, zero é retornado. Caso contrário, -1 é retornado, e I<errno> é selecionado adequadamente.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 5.10 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.

source: These system calls are used to access or to change the hostname of the current processor.
nl: Deze systeem aanroepen worden gebruikt om de machinenaam van het systeem op te vragen of te veranderen.
pt_br: Estas chamadas de sistema são usadas para acessar ou alterar o nome da máquina do processador atual.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pt_br: Esta página faz parte da versão 4.16 do projeto Linux I<man-pages>. Uma descrição do projeto, informações sobre relatórios de bugs e a versão mais recente desta página podem ser encontradas em \%https://www.kernel.org/doc/man-pages/.
