Repository: sebras/manpages-l10n
Catalog: po/*/man2/getrlimit.2.po
Languages: fr

source: B<RLIMIT_MEMLOCK> and B<RLIMIT_NPROC> derive from BSD and are not specified in POSIX.1; they are present on the BSDs and Linux, but on few other implementations. B<RLIMIT_RSS> derives from BSD and is not specified in POSIX.1; it is nevertheless present on most implementations. B<RLIMIT_MSGQUEUE>, B<RLIMIT_NICE>, B<RLIMIT_RTPRIO>, B<RLIMIT_RTTIME>, and B<RLIMIT_SIGPENDING> are Linux-specific.
fr: B<RLIMIT_MEMLOCK> et B<RLIMIT_NPROC> proviennent de BSD et ne sont pas définis dans POSIX.1\ ; ils sont présents dans les BSD et Linux, mais dans peu d'autres implémentations. B<RLIMIT_RSS> vient de BSD et n'est pas défini dans POSIX.1\ ; cependant, il est présent sur la plupart des implémentations. B<RLIMIT_MSGQUEUE>, B<RLIMIT_NICE>, B<RLIMIT_RTPRIO>, B<RLIMIT_RTTIME> et B<RLIMIT_SIGPENDING> sont spécifiques à Linux.

source: A child process created via B<fork>(2) inherits its parent's resource limits. Resource limits are preserved across B<execve>(2).
fr: Un processus enfant créé avec B<fork>(2) hérite des limites de ressource de son parent. Les limites de ressource sont préservées à travers un B<execve>(2).

source: Resource limits are per-process attributes that are shared by all of the threads in a process.
fr: Les limites de ressource sont des attributs par processus partagés par tous les threads d'un processus.

source: Lowering the soft limit for a resource below the process's current consumption of that resource will succeed (but will prevent the process from further increasing its consumption of the resource).
fr: Descendre la limite souple d'une ressource en dessous de l'actuelle utilisation par le processus de cette ressource fonctionne (mais cela empêchera le processus d'augmenter ultérieurement sa consommation de cette ressource).

source: One can set the resource limits of the shell using the built-in I<ulimit> command (I<limit> in B<csh>(1)). The shell's resource limits are inherited by the processes that it creates to execute commands.
fr: On peut définir les limites de ressource de l'interpréteur de commandes en utilisant la commande interne I<ulimit> (I<limit> dans B<csh>(1)). Les limites de ressource de l'interpréteur de commandes sont héritées par les processus qu'il crée pour exécuter les commandes.

source: Ancient systems provided a B<vlimit>() function with a similar purpose to B<setrlimit>(). For backward compatibility, glibc also provides B<vlimit>(). All new applications should be written using B<setrlimit>().
fr: Les systèmes anciens fournissent une fonction B<vlimit>() qui remplit le même rôle que B<setrlimit>(). Pour des raisons de compatibilité ascendante, la glibc fournit aussi une fonction B<vlimit>(), mais toutes les nouvelles applications devraient utiliser B<setrlimit>().

source: C library/kernel ABI differences
fr: Différences entre la bibliothèque C et l'ABI du noyau

source: Since version 2.13, the glibc B<getrlimit>() and B<setrlimit>() wrapper functions no longer invoke the corresponding system calls, but instead employ B<prlimit>(), for the reasons described in BUGS.
fr: A partir de la version 2.13, les fonctions d'enrobage B<getrlimit>() et B<setrlimit>() de la glibc n'appellent plus les appels systèmes correspondant, mais utilisent B<prlimit>(), pour les raisons indiquées dans BUGS.

source: The name of the glibc wrapper function is B<prlimit>(); the underlying system call is B<prlimit64>().
fr: Le nom de la fonction enveloppe dans la glibc est B<prlimit>() ; l'appel système sous-jacent est B<prlimit64>().

source: BUGS
fr: BOGUES

source: In older Linux kernels, the B<SIGXCPU> and B<SIGKILL> signals delivered when a process encountered the soft and hard B<RLIMIT_CPU> limits were delivered one (CPU) second later than they should have been. This was fixed in kernel 2.6.8.
fr: Dans les noyaux Linux plus anciens, les signaux B<SIGXCPU> et B<SIGKILL> envoyés lorsqu'un processus dépassait les limites souples et strictes pour B<RLIMIT_CPU> étaient envoyés une seconde (CPU) plus tard qu'ils n'auraient dû l'être. Cela a été corrigé dans le noyau 2.6.8.

source: In 2.6.x kernels before 2.6.17, a B<RLIMIT_CPU> limit of 0 is wrongly treated as "no limit" (like B<RLIM_INFINITY>). Since Linux 2.6.17, setting a limit of 0 does have an effect, but is actually treated as a limit of 1 second.
fr: Dans les noyaux de la série 2.6 antérieurs à 2.6.17, une limite B<RLIMIT_CPU> à 0 est interprétée par erreur comme «\ pas de limite\ » (comme B<RLIM_INFINITY>). Depuis Linux 2.6.17, définir la limite à 0 a un effet, mais la limite est en fait d'une seconde.

source: A kernel bug means that B<RLIMIT_RTPRIO> does not work in kernel 2.6.12; the problem is fixed in kernel 2.6.13.
fr: En raison d'un bogue du noyau, B<RLIMIT_RTPRIO> ne marche pas dans le noyau 2.6.12\ ; le problème a été corrigé dans le noyau 2.6.13.

source: In kernel 2.6.12, there was an off-by-one mismatch between the priority ranges returned by B<getpriority>(2) and B<RLIMIT_NICE>. This had the effect that the actual ceiling for the nice value was calculated as I<19\ -\ rlim_cur>. This was fixed in kernel 2.6.13.
fr: Dans le noyau 2.6.12, il y avait une différence de 1 entre les valeurs de priorité renvoyées par B<getpriority>(2) et B<RLIMIT_NICE>. Du coup, la limite réelle pour la valeur de politesse était calculée comme I<19\ -\ rlim_cur>. Cela est corrigé depuis le noyau 2.6.13.

source: Since Linux 2.6.12, if a process reaches its soft B<RLIMIT_CPU> limit and has a handler installed for B<SIGXCPU>, then, in addition to invoking the signal handler, the kernel increases the soft limit by one second. This behavior repeats if the process continues to consume CPU time, until the hard limit is reached, at which point the process is killed. Other implementations do not change the B<RLIMIT_CPU> soft limit in this manner, and the Linux behavior is probably not standards conformant; portable applications should avoid relying on this Linux-specific behavior. The Linux-specific B<RLIMIT_RTTIME> limit exhibits the same behavior when the soft limit is encountered.
fr: A partir de Linux 2.6.12, si un processus atteint sa limite souple B<RLIMIT_CPU> et qu'il dispose d'un gestionnaire pour B<SIGXCPU>, alors en plus d'invoquer le gestionnaire de signal, le noyau augmente la limite souple d'une seconde. Ce comportement se répète si le processus continue de consommer du temps processeur, jusqu'à ce que la limite stricte soit atteinte, auquel cas le processus est tué. D'autres implémentations ne modifient pas la limite souple B<RLIMIT_CPU> de cette façon, et le comportement de Linux n'est alors probablement pas conforme aux standards ; pour cette raison, les applications portables doivent éviter de tabler sur ce comportement. La limite propre à Linux B<RLIMIT_RTTIME> se comporte de façon analogue lorsque la limite souple est atteinte.

source: Kernels before 2.4.22 did not diagnose the error B<EINVAL> for B<setrlimit>() when I<rlim-E<gt>rlim_cur> was greater than I<rlim-E<gt>rlim_max>.
fr: Les noyaux antérieurs à 2.4.22 ne détectaient pas l'erreur B<EINVAL> pour B<setrlimit>() quand I<rlim-E<gt>rlim_cur> était plus grand que I<rlim-E<gt>rlim_max>.

source: Linux doesn't return an error when an attempt to set B<RLIMIT_CPU> has failed, for compatibility reasons.
fr: Pour des raisons de compatibilité, Linux ne renvoie pas d'erreur quand une tentative de positionnement de B<RLIMIT_CPU> a échoué.

source: Representation of "large" resource limit values on 32-bit platforms
fr: Représentation des limites de ressources de grande taille sur les plate-formes 32 bits

source: The glibc B<getrlimit>() and B<setrlimit>() wrapper functions use a 64-bit I<rlim_t> data type, even on 32-bit platforms. However, the I<rlim_t> data type used in the B<getrlimit>() and B<setrlimit>() system calls is a (32-bit) I<unsigned long>. Furthermore, in Linux, the kernel represents resource limits on 32-bit platforms as I<unsigned long>. However, a 32-bit data type is not wide enough. The most pertinent limit here is B<RLIMIT_FSIZE>, which specifies the maximum size to which a file can grow: to be useful, this limit must be represented using a type that is as wide as the type used to represent file offsets\(emthat is, as wide as a 64-bit B<off_t> (assuming a program compiled with I<_FILE_OFFSET_BITS=64>).
fr: Les fonctions d'enrobage de la glibc B<getrlimit>() et B<setrlimit>() utilisent un type 64 bits I<rlim_t>, et ce même sur les plateformes 32 bits. Cependant, le type I<rlim_t> utilisé dans les appels systèmes B<getrlimit>() et B<setrlimit>() est en fait un I<unsigned long> (de 32 bits). De plus, sur Linux, le noyau traite les limites de ressources sur les systèmes 32 bits au moyen du type I<unsigned long>. Un type 32 bits n'est pourtant pas assez grand. Dans le cas présent, la limite la plus pertinente est B<RLIMIT_FSIZE>, qui indique la taille maximum que peut atteindre un fichier : pour être utilisable, cette limite doit être représentée par un type de la même taille que celui utilisé pour représenter les positions de curseur dans le fichier \(emc'est à dire, de la taille d'un B<off_t> 64 bits (en considérant que le programme a été compilé avec l'option I<_FILE_OFFSET_BITS=64>).

source: To work around this kernel limitation, if a program tried to set a resource limit to a value larger than can be represented in a 32-bit I<unsigned long>, then the glibc B<setrlimit>() wrapper function silently converted the limit value to B<RLIM_INFINITY>. In other words, the requested resource limit setting was silently ignored.
fr: Pour contourner cette limitation du noyau, si un programme tente d'affecter à une limite de ressource une valeur trop grande pour être représentée par un type I<unsigned long> de 32 bits, la fonction d'enrobage de la glibc B<setrlimit>() change implicitement la valeur de la limite en B<RLIM_INFINITY>. Autrement dit, l'affectation de la limite de ressource n'est pas prise en compte, et cela sans aucune notification.

source: Since version 2.13, glibc works around the limitations of the B<getrlimit>() and B<setrlimit>() system calls by implementing B<setrlimit>() and B<getrlimit>() as wrapper functions that call B<prlimit>().
fr: Depuis la version 2.13, la glibc contourne ces limitations des appels système B<getrlimit>() et B<setrlimit>() en implémentant les fonctions B<setrlimit>() et B<getrlimit>() qui font appel à B<prlimit>().

source: EXAMPLES
fr: EXEMPLES

source: The program below demonstrates the use of B<prlimit>().
fr: Le programme ci-dessous démontre l'utilisation de B<prlimit>().

source: if (!(argc == 2 || argc == 4)) { fprintf(stderr, "Usage: %s E<lt>pidE<gt> [E<lt>new-soft-limitE<gt> " "E<lt>new-hard-limitE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }
fr: if (!(argc == 2 || argc == 4)) { fprintf(stderr, "Usage: %s E<lt>pidE<gt> [E<lt>nouvelle-limite-soupleE<gt> " "E<lt>nouvelle-limite-stricteE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }

source: pid = atoi(argv[1]); /* PID of target process */
fr: pid = atoi(argv[1]); /* PID du processus cible */

source: /* Set CPU time limit of target process; retrieve and display previous limit */
fr: /* Définir la limite de temps CPU du processus cible ; récupérer et afficher la limite de temps CPU antérieure */

source: /* Retrieve and display new CPU time limit */
fr: /* Récupérer et afficher la nouvelle limite de temps CPU */

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Since Linux 3.5:
fr: Depuis Linux 3.5 :

source: bytes = attr.mq_maxmsg * sizeof(struct msg_msg) + min(attr.mq_maxmsg, MQ_PRIO_MAX) * sizeof(struct posix_msg_tree_node)+ /* For overhead */ attr.mq_maxmsg * attr.mq_msgsize; /* For message data */
fr: bytes = attr.mq_maxmsg * sizeof(struct msg_msg) + min(attr.mq_maxmsg, MQ_PRIO_MAX) * sizeof(struct posix_msg_tree_node)+ /* Pour le dépassement */ attr.mq_maxmsg * attr.mq_msgsize; /* Pour les données du message */

source: Linux 3.4 and earlier:
fr: Linux 3.4 et antérieur :

source: bytes = attr.mq_maxmsg * sizeof(struct msg_msg *) + /* For overhead */ attr.mq_maxmsg * attr.mq_msgsize; /* For message data */
fr: bytes = attr.mq_maxmsg * sizeof(struct msg_msg *) + /* Pour le dépassement */ attr.mq_maxmsg * attr.mq_msgsize; /* Pour les données de message */

source: The B<RLIMIT_NPROC> limit is not enforced for processes that have either the B<CAP_SYS_ADMIN> or the B<CAP_SYS_RESOURCE> capability.
fr: La limite B<RLIMIT_NPROC> n'est pas gérée pour les processus qui ont la capacité B<CAP_SYS_ADMIN> ou B<CAP_SYS_RESOURCE>.

source: If the I<new_limit> argument is a not NULL, then the I<rlimit> structure to which it points is used to set new values for the soft and hard limits for I<resource>. If the I<old_limit> argument is a not NULL, then a successful call to B<prlimit>() places the previous soft and hard limits for I<resource> in the I<rlimit> structure pointed to by I<old_limit>.
fr: Si le paramètre I<new_limit> ne vaut pas NULL, alors la structure I<rlimit> vers laquelle il pointe est utilisée pour affecter de nouvelles valeurs aux limites souples et strictes pour I<resource>. Si le paramètres I<old_limit> ne vaut pas NULL, alors un appel à B<prlimit>() qui réussit place les limites antérieures souples et strictes pour I<resource> dans la structure I<rlimit> pointée par I<old_limit>.

source: On success, these system calls return 0. On error, -1 is returned, and I<errno> is set appropriately.
fr: Ces appels système renvoient B<0> en cas de succès ou B<-1> en cas d'échec, auquel cas I<errno> contient le code d'erreur.

source: CONFORMING TO
fr: CONFORMITÉ

source: Since Linux 2.6.24, the resource limits of any process can be inspected via I</proc/[pid]/limits>; see B<proc>(5).
fr: À partir de Linux 2.6.24, les limites de ressource de n'importe quel processus peuvent être examinées en consultant I</proc/[pid]/limits> ; consultez B<proc>(5).

source: if (prlimit(pid, RLIMIT_CPU, newp, &old) == -1) errExit("prlimit-1"); printf("Previous limits: soft=%jd; hard=%jd\en", (intmax_t) old.rlim_cur, (intmax_t) old.rlim_max);
fr: if (prlimit(pid, RLIMIT_CPU, newp, &old) == -1) errExit("prlimit-1"); printf("Limites précédentes : souple=%jd; stricte=%jd\en", (intmax_t) old.rlim_cur, (intmax_t) old.rlim_max);

source: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("New limits: soft=%jd; hard=%jd\en", (intmax_t) old.rlim_cur, (intmax_t) old.rlim_max);
fr: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("Nouvelles limites : souple=%jd; stricte=%jd\en", (intmax_t) old.rlim_cur, (intmax_t) old.rlim_max);

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<RLIMIT_LOCKS> (early Linux 2.4 only)
fr: B<RLIMIT_LOCKS> (premiers Linux 2.4 seulement)

source: EXAMPLE
fr: EXEMPLE

source: if (prlimit(pid, RLIMIT_CPU, newp, &old) == -1) errExit("prlimit-1"); printf("Previous limits: soft=%lld; hard=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);
fr: if (prlimit(pid, RLIMIT_CPU, newp, &old) == -1) errExit("prlimit-1"); printf("Limites précédentes : souple=%lld; stricte=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);

source: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("New limits: soft=%lld; hard=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);
fr: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("Nouvelles limites: souple=%lld; stricte=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
