Repository: sebras/manpages-l10n
Catalog: po/*/man2/getrandom.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: getrandom - obtain a series of random bytes
fr: getrandom - obtenir une série d'octets aléatoires

source: The B<getrandom>() system call fills the buffer pointed to by I<buf> with up to I<buflen> random bytes. These bytes can be used to seed user-space random number generators or for cryptographic purposes.
fr: L'appel système B<getrandom>() remplit le tampon vers lequel pointe I<buf> avec jusqu'à I<buflen> octets aléatoires. Ces octets peuvent être utilisés pour alimenter des générateurs de nombre aléatoire dans l'espace utilisateur ou à des fins de chiffrement.

source: By default, B<getrandom>() draws entropy from the I<urandom> source (i.e., the same source as the I</dev/urandom> device). This behavior can be changed via the I<flags> argument.
fr: Par défaut, B<getrandom>() dessine une entropie à partir d'une source I<urandom> (soit la même source que le périphérique I</dev/urandom>). Ce comportement peut être modifié avec le paramètre I<flags>.

source: If the I<urandom> source has been initialized, reads of up to 256 bytes will always return as many bytes as requested and will not be interrupted by signals. No such guarantees apply for larger buffer sizes. For example, if the call is interrupted by a signal handler, it may return a partially filled buffer, or fail with the error B<EINTR>.
fr: Si la source I<urandom> a été initialisée, les lectures jusqu'à 256 octets renverront toujours autant d'octets que demandé et ne seront pas interrompues par des signaux. Il n'y a pas une telle garantie pour les tampons plus gros. Par exemple, si l'appel est interrompu par un gestionnaire de signal, il peut renvoyer un tampon partiellement rempli ou échouer avec l'erreur B<EINTR>.

source: If the I<urandom> source has not yet been initialized, then B<getrandom>() will block, unless B<GRND_NONBLOCK> is specified in I<flags>.
fr: Si la source I<urandom> n'a pas encore été initialisée, B<getrandom>() se bloquera, sauf si B<GRND_NONBLOCK> est indiqué dans I<flags>.

source: The I<flags> argument is a bit mask that can contain zero or more of the following values ORed together:
fr: Le paramètre I<flags> est un masque de bit qui peut contenir aucune ou plusieurs des valeurs suivantes unies (OU logique) ensemble :

source: If this bit is set, then random bytes are drawn from the I<random> source (i.e., the same source as the I</dev/random> device) instead of the I<urandom> source. The I<random> source is limited based on the entropy that can be obtained from environmental noise. If the number of available bytes in the I<random> source is less than requested in I<buflen>, the call returns just the available random bytes. If no random bytes are available, the behavior depends on the presence of B<GRND_NONBLOCK> in the I<flags> argument.
fr: Si ce bit est positionné, les octets aléatoires seront dessinés à partir de la source I<random> (soit la même que le périphérique I</dev/random>) au lieu de la source I<urandom>. La source I<random> est limitée par l'entropie qui peut être récupérée à partir du bruit de l'environnement. Si le nombre d'octets disponibles dans la source I<random> est inférieur à celui demandé dans I<buflen>, l'appel ne renvoie que les octets aléatoires disponibles. S'il n'y pas d'octets aléatoires disponibles, le comportement dépend de la présence de B<GRND_NONBLOCK> dans le paramètre I<flags>.

source: By default, when reading from the I<random> source, B<getrandom>() blocks if no random bytes are available, and when reading from the I<urandom> source, it blocks if the entropy pool has not yet been initialized. If the B<GRND_NONBLOCK> flag is set, then B<getrandom>() does not block in these cases, but instead immediately returns -1 with I<errno> set to B<EAGAIN>.
fr: Par défaut, pendant une lecture depuis la source I<random>, B<getrandom>() se bloque si aucun octet aléatoire n'est disponible, tandis que pendant une lecture à partir de la source I<urandom>, il se bloque si la réserve (pool) d'entropie n'a pas encore été initialisée. Si le paramètre B<GRND_NONBLOCK> est positionné, B<getrandom>() ne se bloque pas dans ces cas, mais il renvoie immédiatement B<-1> et il positionne I<errno> sur B<EAGAIN>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<getrandom>() returns the number of bytes that were copied to the buffer I<buf>. This may be less than the number of bytes requested via I<buflen> if either B<GRND_RANDOM> was specified in I<flags> and insufficient entropy was present in the I<random> source or the system call was interrupted by a signal.
fr: En cas de succès, B<getrandom>() renvoie le nombre d'octets copiés dans le tampon I<buf>. Il peut être inférieur au nombre d'octets demandé par I<buflen> si B<GRND_RANDOM> a été indiqué dans I<flags> et qu'il n'y avait pas assez d'entropie dans la source I<random>, ou si l'appel système a été interrompu par un signal.

source: On error, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas d'erreur, la valeur de retour est B<-1> et I<errno> est définie pour préciser l'erreur.

source: ERRORS
fr: ERREURS

source: The requested entropy was not available, and B<getrandom>() would have blocked if the B<GRND_NONBLOCK> flag was not set.
fr: L'entropie demandée n'était pas disponible et B<getrandom>() se serait bloqué si le paramètre B<GRND_NONBLOCK> n'avait pas été positionné.

source: The address referred to by I<buf> is outside the accessible address space.
fr: L'adresse à laquelle renvoie I<buf> est en dehors de l'espace d'adressage accessible.

source: The call was interrupted by a signal handler; see the description of how interrupted B<read>(2) calls on "slow" devices are handled with and without the B<SA_RESTART> flag in the B<signal>(7) man page.
fr: L'appel a été interrompu par un gestionnaire de signal ; voir la description sur la manière dont sont gérés les appels B<read>(2) interrompus sur des périphériques « lents » avec et sans l'attribut B<SA_RESTART> dans la page de manuel de B<signal>(7).

source: An invalid flag was specified in I<flags>.
fr: Un paramètre non valable a été indiqué dans I<flags>.

source: The glibc wrapper function for B<getrandom>() determined that the underlying kernel does not implement this system call.
fr: La fonction enveloppe de la glibc pour B<getrandom>() a déterminé que le noyau sous-jacent n'implémente pas cet appel système.

source: B<getrandom>() was introduced in version 3.17 of the Linux kernel. Support was added to glibc in version 2.25.
fr: B<getrandom>() a été introduit dans la version 3.17 du noyau Linux. La prise en charge dans la glibc a été ajoutée à la version 2.25.

source: CONFORMING TO
fr: CONFORMITÉ

source: This system call is Linux-specific.
fr: Cet appel système est spécifique à Linux.

source: For an overview and comparison of the various interfaces that can be used to obtain randomness, see B<random>(7).
fr: Pour un aperçu et une comparaison des interfaces utilisables pour produire de l'aléatoire, voir B<random>(7).

source: Unlike I</dev/random> and I</dev/urandom>, B<getrandom>() does not involve the use of pathnames or file descriptors. Thus, B<getrandom>() can be useful in cases where B<chroot>(2) makes I</dev> pathnames invisible, and where an application (e.g., a daemon during start-up) closes a file descriptor for one of these files that was opened by a library.
fr: Contrairement à I</dev/random> et à I</dev/urandom>, B<getrandom>() n'implique pas d'utiliser des noms de chemin ou des descripteurs de fichier. Ainsi, B<getrandom>() peut être utile dans les cas où B<chroot>(2) rend invisibles les noms de chemin I</dev>, et où une application (comme un démon qui démarre) ferme un descripteur de fichier pour un de ces fichiers ouverts par une bibliothèque.

source: Maximum number of bytes returned
fr: Nombre maximal d'octets renvoyés

source: As of Linux 3.19 the following limits apply:
fr: À partir de Linux 3.19, les limites suivantes s'appliquent :

source: When reading from the I<urandom> source, a maximum of 33554431 bytes is returned by a single call to B<getrandom>() on systems where I<int> has a size of 32 bits.
fr: Pendant une lecture à partir d'une source I<urandom>, un maximum de 33554431 octets est renvoyé par un appel B<getrandom>() sur des systèmes où I<int> a une taille de 32 bits.

source: When reading from the I<random> source, a maximum of 512 bytes is returned.
fr: Lors d'une lecture à partir d'une source I<random>, un maximum de 512 octets est renvoyé.

source: Interruption by a signal handler
fr: Interruption par un gestionnaire de signal

source: When reading from the I<urandom> source (B<GRND_RANDOM> is not set), B<getrandom>() will block until the entropy pool has been initialized (unless the B<GRND_NONBLOCK> flag was specified). If a request is made to read a large number of bytes (more than 256), B<getrandom>() will block until those bytes have been generated and transferred from kernel memory to I<buf>. When reading from the I<random> source (B<GRND_RANDOM> is set), B<getrandom>() will block until some random bytes become available (unless the B<GRND_NONBLOCK> flag was specified).
fr: Lors de la lecture à partir d'une source I<urandom> (B<GRND_RANDOM> n'est pas positionné), B<getrandom>() se bloquera jusqu'à ce que la réserve (pool) d'entropie soit initialisée (sauf si l'attribut B<GRND_NONBLOCK> a été indiqué). Si une demande est faite pour lire un grand nombre d'octets (plus de 256), B<getrandom>() se bloquera jusqu'à ce que ces octets soient générés et transférés de la mémoire du noyau vers I<buf>. Lors d'une lecture à partir d'une source I<random> (B<GRND_RANDOM> est positionné), B<getrandom>() se bloquera jusqu'à ce que des octets aléatoires soient disponibles (sauf si l'attribut B<GRND_NONBLOCK> a été indiqué).

source: The behavior when a call to B<getrandom>() that is blocked while reading from the I<urandom> source is interrupted by a signal handler depends on the initialization state of the entropy buffer and on the request size, I<buflen>. If the entropy is not yet initialized, then the call fails with the B<EINTR> error. If the entropy pool has been initialized and the request size is large (I<buflen>\ E<gt>\ 256), the call either succeeds, returning a partially filled buffer, or fails with the error B<EINTR>. If the entropy pool has been initialized and the request size is small (I<buflen>\ E<lt>=\ 256), then B<getrandom>() will not fail with B<EINTR>. Instead, it will return all of the bytes that have been requested.
fr: Quand un appel B<getrandom>() se bloque pendant la lecture à partir d'une source I<urandom> du fait d'une interruption par un gestionnaire de signal, le comportement dépend de l'état d'initialisation du tampon d'entropie et de la taille de la requête, I<buflen>. Si la réserve d'entropie n'est pas encore initialisée, l'appel échoue avec l'erreur B<EINTR>. Si cette réserve d'entropie a été initialisée et si la taille de la requête est importante (I<buflen>\ E<gt>\ 256), soit l'appel réussit, en renvoyant un tampon partiellement rempli, soit il échoue avec l'erreur B<EINTR>. Si la réserve d'entropie a été initialisée et si la taille demandée est petite (I<buflen>\ E<lt>=\ 256), B<getrandom>() n'échouera pas avec B<EINTR>. Il renverra plutôt tous les octets demandés.

source: When reading from the I<random> source, blocking requests of any size can be interrupted by a signal handler (the call fails with the error B<EINTR>).
fr: Pendant une lecture avec une source I<random>, les requêtes bloquantes de n'importe quelle taille peuvent être interrompues par un gestionnaire de signal (l'appel échoue avec l'erreur B<EINTR>).

source: Using B<getrandom>() to read small buffers (E<lt>=\ 256 bytes) from the I<urandom> source is the preferred mode of usage.
fr: L'utilisation de B<getrandom>() pour lire de petits tampons (E<lt>=\ 256 octets) à partir d'une source I<urandom> est le cas d'utilisation privilégié.

source: The special treatment of small values of I<buflen> was designed for compatibility with OpenBSD's B<getentropy>(3), which is nowadays supported by glibc.
fr: Le traitement particulier des petites valeurs de I<buflen> a été conçu à des fins de compatibilité avec le B<getentropy>(3) d'OpenBSD, qui est aujourd'hui géré par la glibc.

source: The user of B<getrandom>() I<must> always check the return value, to determine whether either an error occurred or fewer bytes than requested were returned. In the case where B<GRND_RANDOM> is not specified and I<buflen> is less than or equal to 256, a return of fewer bytes than requested should never happen, but the careful programmer will check for this anyway!
fr: L'utilisateur de B<getrandom>() I<doit> toujours vérifier la valeur renvoyée, pour savoir si une erreur s'est produite ou si moins d'octets que le nombre demandé ont été renvoyés. Au cas où B<GRND_RANDOM> n'est pas indiqué et où I<buflen> est inférieur ou égal à 256, il ne devrait jamais y avoir de renvoi d'un nombre d'octets inférieur à celui demandé, mais un programmeur prudent le vérifiera quand même.

source: BUGS
fr: BOGUES

source: As of Linux 3.19, the following bug exists:
fr: À partir de Linux 3.19, le bogue suivant existe :

source: Depending on CPU load, B<getrandom>() does not react to interrupts before reading all bytes requested.
fr: Selon la charge du processeur, B<getrandom>() ne réagit pas aux interruptions avant de lire tous les octets demandés.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: On error, -1 is returned, and I<errno> is set appropriately.
fr: En cas d'erreur, la valeur de retour est B<-1>, et I<errno> est défini de façon appropriée.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The behavior when a call to B<getrandom>() that is blocked while reading from the I<urandom> source is interrupted by a signal handler depends on the initialization state of the entropy buffer and on the request size, I<buflen>. If the entropy is not yet initialized, then the call fails with the B<EINTR> error. If the entropy pool has been initialized and the request size is large (I<buflen>\ E<gt>\ 256), the call either succeeds, returning a partially filled buffer, or fails with the error B<EINTR.> If the entropy pool has been initialized and the request size is small (I<buflen>\ E<lt>=\ 256), then B<getrandom>() will not fail with B<EINTR>. Instead, it will return all of the bytes that have been requested.
fr: Quand un appel B<getrandom>() se bloque pendant la lecture à partir d'une source I<urandom> du fait d'une interruption par un gestionnaire de signal, le comportement dépend de l'état d'initialisation du tampon d'entropie et de la taille de la requête, I<buflen>. Si la réserve d'entropie n'est pas encore initialisée, l'appel échoue avec l'erreur B<EINTR>. Si cette réserve d'entropie a été initialisée et si la taille de la requête est importante (I<buflen>\ E<gt>\ 256), soit l'appel réussit, en renvoyant un tampon partiellement rempli, soit il échoue avec l'erreur B<EINTR>. Si la réserve d'entropie a été initialisée et si la taille demandée est petite (I<buflen>\ E<lt>=\ 256), B<getrandom>() n'échouera pas avec B<EINTR>. Il renverra plutôt tous les octets demandés.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
