Repository: sebras/manpages-l10n
Catalog: po/*/man2/getrlimit.2.po
Languages: fr

source: NAME
fr: NOM

source: getrlimit, setrlimit, prlimit - get/set resource limits
fr: getrlimit, setrlimit, prlimit - Lire et écrire les limites et utilisations des ressources

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: The B<getrlimit>() and B<setrlimit>() system calls get and set resource limits. Each resource has an associated soft and hard limit, as defined by the I<rlimit> structure:
fr: Les appels système B<getrlimit>() et B<setrlimit>() lisent ou écrivent les limites des ressources système. Chaque ressource a une limite souple et une limite stricte définies par la structure I<rlimit>\ :

source: struct rlimit { rlim_t rlim_cur; /* Soft limit */ rlim_t rlim_max; /* Hard limit (ceiling for rlim_cur) */ };
fr: struct rlimit { rlim_t rlim_cur; /* limite souple */ rlim_t rlim_max; /* limite stricte (plafond de rlim_cur) */ };

source: The soft limit is the value that the kernel enforces for the corresponding resource. The hard limit acts as a ceiling for the soft limit: an unprivileged process may set only its soft limit to a value in the range from 0 up to the hard limit, and (irreversibly) lower its hard limit. A privileged process (under Linux: one with the B<CAP_SYS_RESOURCE> capability in the initial user namespace) may make arbitrary changes to either limit value.
fr: La limite souple est la valeur que le noyau prend en compte pour la ressource correspondante. La limite stricte agit comme un plafond pour la limite souple\ : un processus non privilégié peut seulement modifier sa limite souple dans l'intervalle entre zéro et la limite stricte, et diminuer (de manière irréversible) sa limite stricte. Un processus privilégié (sous Linux\ : un processus ayant la capacité B<CAP_SYS_RESOURCE> dans l'espace de noms initial de l'utilisateur) peut modifier ses deux limites à sa guise.

source: The value B<RLIM_INFINITY> denotes no limit on a resource (both in the structure returned by B<getrlimit>() and in the structure passed to B<setrlimit>()).
fr: La valeur B<RLIM_INFINITY> indique une limite infinie pour la ressource (aussi bien pour B<getrlimit>() que pour B<setrlimit>()).

source: The I<resource> argument must be one of:
fr: Le paramètre I<resource> doit être l'un des éléments suivants\ :

source: This is the maximum size of the process's virtual memory (address space). The limit is specified in bytes, and is rounded down to the system page size. This limit affects calls to B<brk>(2), B<mmap>(2), and B<mremap>(2), which fail with the error B<ENOMEM> upon exceeding this limit. In addition, automatic stack expansion fails (and generates a B<SIGSEGV> that kills the process if no alternate stack has been made available via B<sigaltstack>(2)). Since the value is a I<long>, on machines with a 32-bit I<long> either this limit is at most 2\ GiB, or this resource is unlimited.
fr: Taille maximale de la mémoire virtuelle du processus (espace d'adressage). Cette limite est exprimée en octets et est arrondie à la taille inférieure de la page système. Cette limite affecte les appels à B<brk>(2), B<mmap>(2) et B<mremap>(2), qui échouent avec l'erreur B<ENOMEM> en cas de dépassement de cette limite. De même, l'extension automatique de la pile échouera (et générera un B<SIGSEGV> qui tuera le processus si aucune pile alternative n'a été définie par un appel à B<sigaltstack>(2)). Comme cette valeur est de type I<long>, sur les machines où le type I<long> est sur 32 bits, soit cette limite est au plus 2 GiB, soit cette ressource est illimitée.

source: This is the maximum size of a I<core> file (see B<core>(5)) in bytes that the process may dump. When 0 no core dump files are created. When nonzero, larger dumps are truncated to this size.
fr: Taille maximale d'un fichier I<core> (consulter B<core>(5)) qu'un processus peut générer. Lorsqu'elle vaut zéro, aucun fichier d'image noyau (Ndt\ : core dump) n'est créé. Lorsqu'elle ne vaut pas zéro, les fichiers d'image noyau plus grands sont tronqués à cette taille.

source: This is a limit, in seconds, on the amount of CPU time that the process can consume. When the process reaches the soft limit, it is sent a B<SIGXCPU> signal. The default action for this signal is to terminate the process. However, the signal can be caught, and the handler can return control to the main program. If the process continues to consume CPU time, it will be sent B<SIGXCPU> once per second until the hard limit is reached, at which time it is sent B<SIGKILL>. (This latter point describes Linux behavior. Implementations vary in how they treat processes which continue to consume CPU time after reaching the soft limit. Portable applications that need to catch this signal should perform an orderly termination upon first receipt of B<SIGXCPU>.)
fr: Limite de temps CPU en secondes consommable par le processus. Lorsqu'un processus atteint cette limite souple, il reçoit le signal B<SIGXCPU>. L'action par défaut pour ce signal est la terminaison du processus. Mais le signal peut être capturé et le gestionnaire peut rendre le contrôle au programme principal. Si le processus continue à consommer du temps CPU, il recevra B<SIGXCPU> toutes les secondes jusqu'à atteindre la limite stricte, où il recevra B<SIGKILL>. (Ce dernier point décrit le comportement de Linux. Les implémentations varient sur la façon de traiter le processus qui continue à consommer du temps CPU après dépassement de sa limite souple. Les applications portables qui doivent capturer ce signal devraient prévoir une terminaison propre dès la première réception de B<SIGXCPU>.)

source: This is the maximum size of the process's data segment (initialized data, uninitialized data, and heap). The limit is specified in bytes, and is rounded down to the system page size. This limit affects calls to B<brk>(2), B<sbrk>(2), and (since Linux 4.7) B<mmap>(2), which fail with the error B<ENOMEM> upon encountering the soft limit of this resource.
fr: Taille maximale du segment de données d'un processus (données initialisées, non initialisées, et tas). Cette limite est indiquée en octets et arrondie à la taille inférieure de la page système. Cette limite affecte les appels B<brk>(2), B<sbrk>(2) et (depuis Linux 4.7) B<mmap>(2)) qui échouent avec l'erreur B<ENOMEM> si la limite souple est dépassée.

source: This is the maximum size in bytes of files that the process may create. Attempts to extend a file beyond this limit result in delivery of a B<SIGXFSZ> signal. By default, this signal terminates a process, but a process can catch this signal instead, in which case the relevant system call (e.g., B<write>(2), B<truncate>(2)) fails with the error B<EFBIG>.
fr: Taille maximale, en octets, d'un fichier que le processus peut créer. Les tentatives d'extension d'un fichier au\(hydelà de cette limite aboutissent à un signal B<SIGXFSZ>. Par défaut ce signal termine le processus, mais il peut être capturé, et dans ce cas l'appel système concerné (par exemple B<write>(2), B<truncate>(2)) échoue avec l'erreur B<EFBIG>.

source: B<RLIMIT_LOCKS> (Linux 2.4.0 to 2.4.24)
fr: B<RLIMIT_LOCKS> (Linux 2.4.0 à 2.4.24)

source: This is a limit on the combined number of B<flock>(2) locks and B<fcntl>(2) leases that this process may establish.
fr: Limite pour le nombre combiné de verrous B<flock>(2) et B<fcntl>(2) que le processus peut établir.

source: This is the maximum number of bytes of memory that may be locked into RAM. This limit is in effect rounded down to the nearest multiple of the system page size. This limit affects B<mlock>(2), B<mlockall>(2), and the B<mmap>(2) B<MAP_LOCKED> operation. Since Linux 2.6.9, it also affects the B<shmctl>(2) B<SHM_LOCK> operation, where it sets a maximum on the total bytes in shared memory segments (see B<shmget>(2)) that may be locked by the real user ID of the calling process. The B<shmctl>(2) B<SHM_LOCK> locks are accounted for separately from the per-process memory locks established by B<mlock>(2), B<mlockall>(2), and B<mmap>(2) B<MAP_LOCKED>; a process can lock bytes up to this limit in each of these two categories.
fr: Le nombre maximal d'octets de mémoire que le processus peut verrouiller en RAM. En pratique cette limite est arrondie vers le bas au multiple de la taille de page le plus proche. Cette limite affecte B<mlock>(2) et B<mlockall>(2) ainsi que l'opération B<MAP_LOCKED> de B<mmap>(2). Depuis Linux 2.6.9, elle affecte aussi l'opération B<SHM_LOCK> de B<shmctl>(2), où elle limite le nombre total d'octets dans des segments de mémoire partagée (consultez B<shmget>(2)) que l'UID réel du processus appelant peut verrouiller. Les verrous B<SHM_LOCK> de B<shmctl>(2) sont comptés séparément des verrous de mémoire par processus établis par B<MAP_LOCKED> de B<mlock>(2), B<mlockall>(2) et B<mmap>(2)\ ; un processus peut verrouiller des octets jusqu'à cette limite dans ces deux catégories.

source: In Linux kernels before 2.6.9, this limit controlled the amount of memory that could be locked by a privileged process. Since Linux 2.6.9, no limits are placed on the amount of memory that a privileged process may lock, and this limit instead governs the amount of memory that an unprivileged process may lock.
fr: Dans les noyaux Linux antérieurs au 2.6.9, cette limite contrôlait la quantité de mémoire qui pouvait être verrouillée par un processus privilégié. Depuis Linux 2.6.9, il n'existe plus de limite de quantité de mémoire verrouillable par un processus privilégié, cette limite gère donc plutôt la quantité de mémoire qu'un processus non privilégié peut verrouiller.

source: B<RLIMIT_MSGQUEUE> (since Linux 2.6.8)
fr: B<RLIMIT_MSGQUEUE> (depuis Linux 2.6.8)

source: This is a limit on the number of bytes that can be allocated for POSIX message queues for the real user ID of the calling process. This limit is enforced for B<mq_open>(3). Each message queue that the user creates counts (until it is removed) against this limit according to the formula:
fr: Indique la limite du nombre d'octets pouvant être alloués pour les files de messages POSIX pour l'UID réel du processus appelant. Cette limite est appliquée pour B<mq_open>(3). Chaque file de message créée par l'utilisateur se calcule (jusqu'à sa destruction) par rapport à la limite via la formule suivante\ :

source: where I<attr> is the I<mq_attr> structure specified as the fourth argument to B<mq_open>(3), and the I<msg_msg> and I<posix_msg_tree_node> structures are kernel-internal structures.
fr: où I<attr> est la structure I<mq_attr> passée comme quatrième argument à B<mq_open>(3), et I<msg_msg> et I<posix_msg_tree_node> sont les structures internes du noyau.

source: The "overhead" addend in the formula accounts for overhead bytes required by the implementation and ensures that the user cannot create an unlimited number of zero-length messages (such messages nevertheless each consume some system memory for bookkeeping overhead).
fr: Le terme de « dépassement » de la formule représente les octets de dépassement nécessaires à l'implémentation. Ce dépassement assure que l'utilisateur ne peut pas créer un nombre illimité de messages vides (ces messages consomment tout de même de la mémoire système).

source: B<RLIMIT_NICE> (since Linux 2.6.12, but see BUGS below)
fr: B<RLIMIT_NICE> (depuis Linux 2.6.12, consultez la section BOGUES ci\(hydessous)

source: This specifies a ceiling to which the process's nice value can be raised using B<setpriority>(2) or B<nice>(2). The actual ceiling for the nice value is calculated as I<20\ -\ rlim_cur>. The useful range for this limit is thus from 1 (corresponding to a nice value of 19) to 40 (corresponding to a nice value of -20). This unusual choice of range was necessary because negative numbers cannot be specified as resource limit values, since they typically have special meanings. For example, B<RLIM_INFINITY> typically is the same as -1. For more detail on the nice value, see B<sched>(7).
fr: Indique un plafond pour la valeur de politesse du processus pouvant être définie par B<setpriority>(2) ou B<nice>(2). Le plafond réel pour la valeur de politesse est calculé par la formule I<20\ -\ rlim_cur>. La plage utile pour cette limite est ainsi de B<1> (pour une valeur de politesse de 19) à B<40> (pour une valeur de politesse de -20). Cette bizarrerie est nécessaire car des nombres négatifs ne peuvent pas être utilisés comme limite de ressource, en raison de leur signification souvent particulière. Par exemple, B<RLIM_INFINITY> est souvent la même chose que B<-1>. Pour plus de détails sur la valeur de politesse, consultez B<sched>(7).

source: This specifies a value one greater than the maximum file descriptor number that can be opened by this process. Attempts (B<open>(2), B<pipe>(2), B<dup>(2), etc.) to exceed this limit yield the error B<EMFILE>. (Historically, this limit was named B<RLIMIT_OFILE> on BSD.)
fr: Valeur supérieure de B<1> au nombre maximal de descripteurs de fichier que peut ouvrir ce processus. Les tentatives d'ouverture (B<open>(2), B<pipe>(2), B<dup>(2), etc) dépassant cette limite renverront l'erreur B<EMFILE> (historiquement, cette limite était appelée B<RLIMIT_OFILE> sur les BSD).

source: Since Linux 4.5, this limit also defines the maximum number of file descriptors that an unprivileged process (one without the B<CAP_SYS_RESOURCE> capability) may have "in flight" to other processes, by being passed across UNIX domain sockets. This limit applies to the B<sendmsg>(2) system call. For further details, see B<unix>(7).
fr: Depuis Linux 4.5, cette limite définit également le nombre maximal de descripteurs de fichier qu'un processus non privilégié (sans la capacité B<CAP_SYS_RESOURCE>) peut détenir « en vol » sur les autres processus, en les passant à travers des sockets du domaine UNIX. Cette limite s'applique à l'appel système B<sendmsg>(2). Pour plus de détails, voir B<unix>(7).

source: This is a limit on the number of extant process (or, more precisely on Linux, threads) for the real user ID of the calling process. So long as the current number of processes belonging to this process's real user ID is greater than or equal to this limit, B<fork>(2) fails with the error B<EAGAIN>.
fr: Limite du nombre de processus étendus (ou, plus précisément, sur Linux, de threads) pour l'identifiant de l'utilisateur réel du processus appelant. Tant que le nombre en cours de processus appartenant à l'identifiant de l'utilisateur réel du processus est supérieur ou égal à cette limite, B<fork>(2) échoue avec l'erreur B<EAGAIN>.

source: This is a limit (in bytes) on the process's resident set (the number of virtual pages resident in RAM). This limit has effect only in Linux 2.4.x, x E<lt> 30, and there affects only calls to B<madvise>(2) specifying B<MADV_WILLNEED>.
fr: Indique la limite (en octets) pour la taille de l'ensemble résident du processus (le nombre de pages de mémoire virtuelle en RAM). Cette limite n'a d'effet que sous Linux 2.4.x où x\ E<lt>\ 30, et n'affecte que les appels B<madvise>(2) indiquant B<MADV_WILLNEED>.

source: B<RLIMIT_RTPRIO> (since Linux 2.6.12, but see BUGS)
fr: B<RLIMIT_RTPRIO> (depuis Linux 2.6.12, mais consultez BOGUES)

source: This specifies a ceiling on the real-time priority that may be set for this process using B<sched_setscheduler>(2) and B<sched_setparam>(2).
fr: Indique un plafond pour la priorité temps\(hyréel pouvant être appliquée au processus par B<sched_setscheduler>(2) et B<sched_setparam>(2).

source: For further details on real-time scheduling policies, see B<sched>(7)
fr: Pour plus de détails sur les règles d'ordonnancement en temps réel, voir B<sched>(7)

source: B<RLIMIT_RTTIME> (since Linux 2.6.25)
fr: B<RLIMIT_RTTIME> (depuis Linux 2.6.25)

source: This is a limit (in microseconds) on the amount of CPU time that a process scheduled under a real-time scheduling policy may consume without making a blocking system call. For the purpose of this limit, each time a process makes a blocking system call, the count of its consumed CPU time is reset to zero. The CPU time count is not reset if the process continues trying to use the CPU but is preempted, its time slice expires, or it calls B<sched_yield>(2).
fr: Indique une limite de la quantité de temps (en microsecondes) CPU qu'un processus ordonnancé par une politique d'ordonnancement temps réel peut consommer sans provoquer un appel système bloquant. Pour les besoins de cette limite, le décompte du temps CPU qu'il a consommé est remis à zéro à chaque fois qu'un processus exécute un appel système bloquant. Le décompte du temps CPU n'est pas remis à zéro si le processus continue d'essayer d'utiliser le CPU mais est préempté, ou si sa tranche de temps expire, ou s'il appelle B<sched_yield>(2).

source: Upon reaching the soft limit, the process is sent a B<SIGXCPU> signal. If the process catches or ignores this signal and continues consuming CPU time, then B<SIGXCPU> will be generated once each second until the hard limit is reached, at which point the process is sent a B<SIGKILL> signal.
fr: Quand la limite douce est atteinte, un signal B<SIGXCPU> est envoyé au processus. Si le processus attrape ou ignore ce signal et continue à consommer du temps CPU, alors un signal B<SIGXCPU> sera généré une fois par seconde jusqu'à ce que la limite stricte soit atteinte, ce qui provoque l'envoi d'un signal B<SIGKILL> au processus.

source: The intended use of this limit is to stop a runaway real-time process from locking up the system.
fr: L'objectif de cette limite est d'empêcher un processus temps réel fou de bloquer le système.

source: B<RLIMIT_SIGPENDING> (since Linux 2.6.8)
fr: B<RLIMIT_SIGPENDING> (depuis Linux 2.6.8)

source: This is a limit on the number of signals that may be queued for the real user ID of the calling process. Both standard and real-time signals are counted for the purpose of checking this limit. However, the limit is enforced only for B<sigqueue>(3); it is always possible to use B<kill>(2) to queue one instance of any of the signals that are not already queued to the process.
fr: Spécifie la limite du nombre de signaux pouvant être mis en attente pour l'identifiant utilisateur réel du processus appelant. La vérification de cette limite prend en compte à la fois les signaux classiques et les signaux temps\(hyréel. Cependant, cette limite n'est appliquée que pour B<sigqueue>(3)\ ; il est toujours possible d'utiliser B<kill>(2) pour mettre en attente une instance de tout signal qui n'est pas déjà en attente pour le processus.

source: This is the maximum size of the process stack, in bytes. Upon reaching this limit, a B<SIGSEGV> signal is generated. To handle this signal, a process must employ an alternate signal stack (B<sigaltstack>(2)).
fr: La taille maximale de la pile du processus, en octets. Une fois cette limite atteinte, un signal B<SIGSEGV> est déclenché. Pour gérer ce signal, le processus doit utiliser une pile spécifique pour signaux (B<sigaltstack>(2)).

source: Since Linux 2.6.23, this limit also determines the amount of space used for the process's command-line arguments and environment variables; for details, see B<execve>(2).
fr: Depuis Linux 2.6.23, cette limite détermine également la quantité d'espace utilisé pour les paramètres et les variables d'environnement du processus ; consultez B<execve>(2) pour plus de détails.

source: The Linux-specific B<prlimit>() system call combines and extends the functionality of B<setrlimit>() and B<getrlimit>(). It can be used to both set and get the resource limits of an arbitrary process.
fr: L'appel système B<prlimit>() spécifique à Linux combine et étend les fonctionnalités de B<setrlimit>() et B<getrlimit>(). Il peut être utilisé pour affecter ou récupérer les limites de ressources de tout processus.

source: The I<resource> argument has the same meaning as for B<setrlimit>() and B<getrlimit>().
fr: Le paramètre I<resource> a le même sens que dans B<setrlimit>() et B<getrlimit>().

source: The I<pid> argument specifies the ID of the process on which the call is to operate. If I<pid> is 0, then the call applies to the calling process. To set or get the resources of a process other than itself, the caller must have the B<CAP_SYS_RESOURCE> capability in the user namespace of the process whose resource limits are being changed, or the real, effective, and saved set user IDs of the target process must match the real user ID of the caller I<and> the real, effective, and saved set group IDs of the target process must match the real group ID of the caller.
fr: L'argument I<pid> spécifie l'identifiant du processus sur lequel l'appel agit. Si I<pid> vaut B<0>, alors l'appel s'applique au processus appelant. Pour positionner ou interroger les ressources d'un processus autre que lui-même, l'appelant doit avoir la capacité B<CAP_SYS_RESOURCE> dans l'espace de noms utilisateur du processus dont les limites de ressources vont être modifiées ou bien les identifiants d'utilisateur réel, effectif et le set-UID sauvé du processus cible doivent correspondre à l'identifiant d'utilisateur réel de l'appelant I<et> les identifiants de groupe réel et effectif et le set-GID sauvé du processus cible doivent correspondre à l'identifiant de groupe réel de l'appelant.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: ERRORS
fr: ERREURS

source: A pointer argument points to a location outside the accessible address space.
fr: L'un des arguments pointe en dehors de l'espace d'adressage accessible.

source: The value specified in I<resource> is not valid; or, for B<setrlimit>() or B<prlimit>(): I<rlim-E<gt>rlim_cur> was greater than I<rlim-E<gt>rlim_max>.
fr: La valeur spécifiée dans I<resource> n'est pas autorisée\ ; ou, pour B<setrlimit>() ou B<prlimit>(), I<rlim-E<gt>rlim_cur> est plus grand que I<rlim-E<gt>rlim_max>.

source: An unprivileged process tried to raise the hard limit; the B<CAP_SYS_RESOURCE> capability is required to do this.
fr: Un processus non privilégié a essayé d’augmenter la limite stricte ; la capacité B<CAP_SYS_RESOURCE> est nécessaire pour faire cela.

source: The caller tried to increase the hard B<RLIMIT_NOFILE> limit above the maximum defined by I</proc/sys/fs/nr_open> (see B<proc>(5))
fr: L'appelant a essayé d'augmenter la limite stricte B<RLIMIT_NOFILE> au-delà de celle maximale définie dans I</proc/sys/fs/nr_open> (voir B<proc>(5))

source: (B<prlimit>()) The calling process did not have permission to set limits for the process specified by I<pid>.
fr: (B<prlimit>()) Le processus appelant n'avait pas les droits pour fixer des limites au processus indiqué par I<pid>.

source: Could not find a process with the ID specified in I<pid>.
fr: Impossible de trouver un processus dont l'identifiant est indiqué par I<pid>.

source: The B<prlimit>() system call is available since Linux 2.6.36. Library support is available since glibc 2.13.
fr: L'appel système B<prlimit>() est disponible depuis Linux 2.6.36 ; la prise en charge dans la glibc est disponible depuis la version\ 2.13.

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: B<prlimit>(): Linux-specific.
fr: B<prlimit>() : spécifique à Linux.
