Repository: sebras/manpages-l10n
Catalog: po/*/man2/gettimeofday.2.po
Languages: fr, nl

source: NAME
fr: NOM
nl: NAAM

source: gettimeofday, settimeofday - get / set time
fr: gettimeofday, settimeofday - Lire/écrire l'heure actuelle
nl: gettimeofday, settimeofday - verkrijg / zet tijd

source: SYNOPSIS
nl: SAMENVATTING

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
fr: Depuis la version 2.19 de la glibc : _DEFAULT_SOURCE Versions 2.19 et antérieures de la glibc : _BSD_SOURCE
nl: Vanaf glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 en eerder: _BSD_SOURCE

source: DESCRIPTION
nl: BESCHRIJVING

source: The functions B<gettimeofday>() and B<settimeofday>() can get and set the time as well as a timezone.
fr: Les fonctions B<gettimeofday>() et B<settimeofday>() servent à lire ou programmer l'heure ainsi que le fuseau horaire (timezone).
nl: De functies B<gettimeofday>() en B<settimeofday>() kunnen zowel de tijd als de tijdzone zetten en inspecteren.

source: The I<tv> argument is a I<struct timeval> (as specified in I<E<lt>sys/time.hE<gt>>):
fr: L'argument I<tv> est une structure I<timeval> (comme indiqué dans I<E<lt>sys/time.hE<gt>>)\ :
nl: Het I<tv> argument is een B<timeval> "struct" zoals bepaald in I<E<lt>sys/time.hE<gt>>):

source: struct timeval { time_t tv_sec; /* seconds */ suseconds_t tv_usec; /* microseconds */ };
fr: struct timeval { time_t tv_sec; /* secondes */ suseconds_t tv_usec; /* microsecondes */ };
nl: struct timeval { time_t tv_sec; /* seconden */ suseconds_t tv_usec; /* microseconden */ };

source: and gives the number of seconds and microseconds since the Epoch (see B<time>(2)).
fr: et donne le nombre de secondes et microsecondes écoulées depuis l'epoch (consultez B<time>(2)).
nl: en geeft het aantal seconden en microseconden sinds de Epoch (zie B<time>(2)).

source: The I<tz> argument is a I<struct timezone>:
fr: L'argument I<tz> est une structure I<timezone> :
nl: Het I<tz> argument is een I<struct tijdzone>:

source: struct timezone { int tz_minuteswest; /* minutes west of Greenwich */ int tz_dsttime; /* type of DST correction */ };
fr: struct timezone { int tz_minuteswest; /* minutes à l'ouest de Greenwich */ int tz_dsttime; /* type de changement d’heure d’été */ };
nl: struct timezone { int tz_minuteswest; /* minuten west van Greenwich */ int tz_dsttime; /* type zomertijd (dst) correctie */ };

source: If either I<tv> or I<tz> is NULL, the corresponding structure is not set or returned. (However, compilation warnings will result if I<tv> is NULL.)
fr: Si I<tv> ou I<tz> est NULL, la structure correspondante n'est ni remplie ni renvoyée. (Cependant, des avertissements à la compilation seront émis si I<tv> est NULL.)
nl: Als óf I<tv> óf I<tz> NULL is, dan wordt de corresponderende structure niet gezet of teruggegeven. (Echter, compilatie waarschuwingen zullen optreden als I<tv> NULL is.)

source: The use of the I<timezone> structure is obsolete; the I<tz> argument should normally be specified as NULL. (See NOTES below.)
fr: L'utilisation de la structure I<timezone> est obsolète ; le paramètre I<tz> doit normalement être NULL. Consultez la section NOTES ci-dessous.
nl: Het gebruik van de I<tijdzone> structuur is verouderd; het I<tz> argument moet normaliter opgegeven worden als NULL. (Zie OPMERKINGEN hieronder.)

source: Under Linux, there are some peculiar "warp clock" semantics associated with the B<settimeofday>() system call if on the very first call (after booting) that has a non-NULL I<tz> argument, the I<tv> argument is NULL and the I<tz_minuteswest> field is nonzero. (The I<tz_dsttime> field should be zero for this case.) In such a case it is assumed that the CMOS clock is on local time, and that it has to be incremented by this amount to get UTC system time. No doubt it is a bad idea to use this feature.
fr: Sous Linux, il existe une sémantique particulière associée à l'appel système B<settimeofday>() si durant la première invocation (après l’amorçage) il a un argument I<tz> non NULL, l'argument I<tv> est NULL et le champ I<tz_minuteswest> est différent de zéro (dans ce cas, le champ I<tz_dsttime> doit être nul). Dans ce cas, on suppose que l'horloge CMOS de la machine est configurée sur l'heure locale, et qu'on doit l'augmenter de cette valeur pour obtenir l'heure UTC. Bien entendu, il faut éviter autant que possible d'utiliser cette particularité.
nl: Onder Linux is er een eigenaardige `warp clock' semantiek geassocieerd met de B<settimeofday>() systeem aanroep als tijdens de allereerste aanroep (na opstarten van het systeem) die een niet-NULL I<tz> argument heeft, het I<tv> argument NULL is en het I<tz_minuteswest> niet-nul is. (Het I<tz_dsttime> veld moet nul zijn in dit geval.) In zo'n geval wordt aangenomen dat de CMOS klok op lokale tijd staat, en dat daar deze hoeveelheid bij moet worden opgeteld om de UTC systeem tijd te krijgen. Ongetwijfeld is het een slecht idee dit te gebruiken.

source: RETURN VALUE
fr: VALEUR RENVOYÉE
nl: EIND WAARDE

source: B<gettimeofday>() and B<settimeofday>() return 0 for success. On error, -1 is returned and I<errno> is set to indicate the error.
fr: B<gettimeofday> et B<settimeofday> renvoient B<0> s'ils réussissent, ou B<-1> s'ils échouent, auquel cas I<errno> est positionné pour indiquer l'erreur.
nl: B<gettimeofday>() en B<settimeofday>() retourneren 0 bij succes, of -1 voor falen (in welk geval I<errno> op die manier wordt gezet).

source: ERRORS
fr: ERREURS
nl: FOUTEN

source: One of I<tv> or I<tz> pointed outside the accessible address space.
fr: I<tv> ou I<tz> pointent en dehors de l'espace d'adressage autorisé.
nl: Een van I<tv> of I<tz> wijst buiten uw toegankelijke adres ruimte.

source: (B<settimeofday>()): I<timezone> is invalid.
fr: (B<settimeofday>()) : I<timezone> n'est pas valable.
nl: (B<settimeofday>()): I<timezone> is ongeldig.

source: (B<settimeofday>()): I<tv.tv_sec> is negative or I<tv.tv_usec> is outside the range [0..999,999].
fr: (B<settimeofday>()) : I<tv.tv_sec> est négatif ou I<tv.tv_usec> dépasse l'intervalle 0-999999.
nl: (B<settimeofday>()): I<tv.tv_sec> is negatief of I<tv.tv_usec> is buiten het bereik [0..999,999].

source: B<EINVAL> (since Linux 4.3)
fr: B<EINVAL> (depuis Linux 4.3)
nl: B<EINVAL> (sinds Linux 4.3)

source: (B<settimeofday>()): An attempt was made to set the time to a value less than the current value of the B<CLOCK_MONOTONIC> clock (see B<clock_gettime>(2)).
fr: (B<settimeofday>()) : tentative de positionner l'heure sur une valeur inférieure à l'heure actuelle de l'horloge B<CLOCK_MONOTONIC> (voir B<clock_gettime>(2)).
nl: (B<settimeofday>()): Een poging werd ondernomen om de tijd op een waarde in te stellen die eerder is dan de huidige waarde van de B<CLOCK_MONOTONIC> klok (zie B<clock_gettime>(2)).

source: The calling process has insufficient privilege to call B<settimeofday>(); under Linux the B<CAP_SYS_TIME> capability is required.
fr: Le processus appelant n'a pas les privilèges suffisants pour appeler B<settimeofday>()\ ; sous Linux, la capacité B<CAP_SYS_TIME> est nécessaire.
nl: Het huidige proces heeft onvoldoende rechten om B<settimeofday>() aan te roepen; onder Linux is de B<CAP_SYS_TIME> capaciteit vereist.

source: SVr4, 4.3BSD. POSIX.1-2001 describes B<gettimeofday>() but not B<settimeofday>(). POSIX.1-2008 marks B<gettimeofday>() as obsolete, recommending the use of B<clock_gettime>(2) instead.
fr: SVr4, 4.3BSD. POSIX.1-2001 décrit B<gettimeofday>() mais pas B<settimeofday>(). POSIX.1-2008 marque B<gettimeofday>() comme étant obsolète, en recommandant d'utiliser B<clock_gettime>(2) à la place.
nl: SVr4, 4.3BSD. POSIX.1-2001 beschrijven B<gettimeofday>() maar niet B<settimeofday>(). POSIX.1-2008 markeert B<gettimeofday>() als verouderd, en beveelt het gebruik van B<clock_gettime>(2) in plaats daarvan aan.

source: NOTES
nl: OPMERKINGEN

source: The time returned by B<gettimeofday>() I<is> affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the system time). If you need a monotonically increasing clock, see B<clock_gettime>(2).
fr: L'heure renvoyée par B<gettimeofday>() I<est> concernée par les sauts discontinus de l'heure système (c'est-à-dire si l'administrateur modifie l'heure système lui-même). Si vous devez incrémenter l'horloge de façon monotone, consultez B<clock_gettime>(2).
nl: De tijd teruggegeven door B<gettimeofday>() I<wordt> beïnvloed door niet continue sprongen in de systeem tijd (b.v. als de systeem beheerder handmatig de systeem tijd verandert). Als u een monotoon oplopende klok nodig heeft, zie dan B<clock_gettime>(2).

source: Macros for operating on I<timeval> structures are described in B<timeradd>(3).
fr: Les macros opérant sur les structures I<timeval> sont décrites dans B<timeradd>(3).
nl: Macros voor het gebruik van I<timeval> structuren zijn beschreven in B<timeradd>(3).

source: Traditionally, the fields of I<struct timeval> were of type I<long>.
fr: Traditionnellement, les champs de la structure I<timeval> étaient de type I<long>.
nl: Traditioneel waren de velden van I<struct timeval> van het type I<long>.

source: C library/kernel differences
fr: différences entre bibliothèque C et noyau
nl: C library/kernel verschillen

source: On some architectures, an implementation of B<gettimeofday>() is provided in the B<vdso>(7).
fr: Sur certaines architectures, une implémentation de B<gettimeofday>() est fournie dans B<vdso>(7).
nl: Op sommige architecturen wordt voorzien in een implementatie van B<gettimeofday>() in de B<vdso>(7).

source: The tz_dsttime field
fr: Le champ tz_dsttime
nl: Het tz_dsttime veld

source: On a non-Linux kernel, with glibc, the I<tz_dsttime> field of I<struct timezone> will be set to a nonzero value by B<gettimeofday>() if the current timezone has ever had or will have a daylight saving rule applied. In this sense it exactly mirrors the meaning of B<daylight>(3) for the current zone. On Linux, with glibc, the setting of the I<tz_dsttime> field of I<struct timezone> has never been used by B<settimeofday>() or B<gettimeofday>(). Thus, the following is purely of historical interest.
fr: Sur un noyau non Linux, avec la glibc, le champ I<tz_dsttime> de la structure I<timezone> sera positionné sur une valeur non nulle par B<gettimeofday>() si il a été appliqué ou sera appliqué au fuseau horaire actuel une règle de sauvegarde d’heure d’été. Dans ce sens, elle reflète exactement la signification de B<daylight>(3) pour la zone actuelle. Sur Linux avec la glibc, le positionnement du champ I<tz_dsttime> de la structure I<timezone> n'a jamais été utilisé par B<settimeofday>() ou B<gettimeofday>(). Ainsi, ce qui suit n'a qu'un intérêt historique.
nl: In een niet-Linux kernel, met glibc, wordt het I<tz_dsttime> veld van I<struct timezone> gezet op een niet-nul waarde door B<gettimeofday>() als op de huidige tijdzone een regel ooit toegepast is of ooit zal worden. Op deze manier spiegelt het precies de betekenis van B<daylight>(3) voor de huidige zone. Op Linux, met glibc, is de instelling van het I<tz_dsttime> veld van I<struct timezone> nooit gebruikt door B<settimeofday>() of B<gettimeofday>(). Daarom is het volgende puur uit historische interesse.

source: On old systems, the field I<tz_dsttime> contains a symbolic constant (values are given below) that indicates in which part of the year Daylight Saving Time is in force. (Note: this value is constant throughout the year: it does not indicate that DST is in force, it just selects an algorithm.) The daylight saving time algorithms defined are as follows:
fr: Sur d'anciens systèmes, le champ I<tz_dsttime> contient une constante symbolique (dont les valeurs sont fournies ci\(hydessous) qui indique quelle partie du changement d’heure d’été annuel est en cours. (Remarque\ : cette valeur est constante tout au long de l'année, elle n'indique pas réellement la valeur que cette heure d’été est en cours, elle sélectionne un algorithme). Les changements d’heure d’été (Daylight Saving Time - DST) sont définis comme suit\ :
nl: Op oude systemen bevat het I<tz_dsttime> veld een symbolische constante (waarden staan hieronder) dat aangeeft in welk deel van het jaar zomertijd van kracht is. (Let op: deze waarde is constant gedurende het jaar: het geeft niet aan dat de zomertijd van kracht is, het selecteert een algoritme.) De zomertijd algoritmes zijn als volgt gedefinieerd:

source: B<DST_NONE> /* not on DST */ B<DST_USA> /* USA style DST */ B<DST_AUST> /* Australian style DST */ B<DST_WET> /* Western European DST */ B<DST_MET> /* Middle European DST */ B<DST_EET> /* Eastern European DST */ B<DST_CAN> /* Canada */ B<DST_GB> /* Great Britain and Eire */ B<DST_RUM> /* Romania */ B<DST_TUR> /* Turkey */ B<DST_AUSTALT> /* Australian style with shift in 1986 */
fr: B<DST_NONE> /* pas sur DST */ B<DST_USA> /* DST à l'américaine */ B<DST_AUST> /* DST à l'australienne */ B<DST_WET> /* DST d'Europe occidentale */ B<DST_MET> /* DST d'Europe centrale */ B<DST_EET> /* DST d'Europe de l'Est */ B<DST_CAN> /* Canada */ B<DST_GB> /* Grande-Bretagne et Irlande */ B<DST_RUM> /* Roumanie */ B<DST_TUR> /* Turquie */ B<DST_AUSTALT> /* Style australien avec changement en 1986 */
nl: B<DST_NONE> /* geen zomertijd */ B<DST_USA> /* USA stijl zomertijd */ B<DST_AUST> /* Australische stijl zomertijd */ B<DST_WET> /* West Europese zomertijd */ B<DST_MET> /* Midden Europese zomertijd */ B<DST_EET> /* Oost Europese zomertijd */ B<DST_CAN> /* Canada */ B<DST_GB> /* Groot Britannië en Ierland */ B<DST_RUM> /* Roemenië */ B<DST_TUR> /* Turkije */ B<DST_AUSTALT> /* Australische stijl met verschuiving in 1986 */

source: Of course it turned out that the period in which Daylight Saving Time is in force cannot be given by a simple algorithm, one per country; indeed, this period is determined by unpredictable political decisions. So this method of representing timezones has been abandoned.
fr: Il est évident que la période de l’heure d’été en cours ne peut pas être uniquement fournie par un algorithme par pays. Ce décalage dépend de décisions politiques imprévisibles. Aussi, cette méthode de représentation des fuseaux horaires a été abandonnée.
nl: Natuurlijk bleek dat de periode waarin zomertijd geld niet met een eenvoudig algorithme per land bepaald kan worden. Inderdaad: deze periode wordt bepaald door onvoorspelbare politieke beslissingen. Daarom is deze methode van tijdzone representatie afgeschaft.

source: SEE ALSO
fr: VOIR AUSSI
nl: ZIE OOK

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux
nl: Linux Programmeurs Handleiding

source: B<settimeofday>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
fr: B<settimeofday>() : Depuis la glibc 2.19 : _DEFAULT_SOURCE Pour la gilbc 2.19 et antérieures : _BSD_SOURCE
nl: B<settimeofday>(): Sinds glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 en eerder: _BSD_SOURCE

source: B<gettimeofday>() and B<settimeofday>() return 0 for success, or -1 for failure (in which case I<errno> is set appropriately).
fr: B<gettimeofday> et B<settimeofday> renvoient B<0> s'ils réussissent, ou B<-1> s'ils échouent, auquel cas I<errno> contient le code d'erreur.
nl: B<gettimeofday>() en B<settimeofday>() geven 0 bij succes, of -1 voor falen (in welk geval I<errno> op die manier wordt gezet).

source: CONFORMING TO
fr: CONFORMITÉ
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: The functions B<gettimeofday>() and B<settimeofday>() can get and set the time as well as a timezone. The I<tv> argument is a I<struct timeval> (as specified in I<E<lt>sys/time.hE<gt>>):
fr: Les fonctions B<gettimeofday>() et B<settimeofday>() servent à lire ou programmer l'heure ainsi que le fuseau horaire (timezone). L'argument I<tv> est une structure I<timeval> décrite dans I<E<lt>sys/time.hE<gt>>\ :
nl: De functies B<gettimeofday>() en B<settimeofday>() kunnen zowel de tijd als de tijdzone zetten en inspecteren. Het I<tv> argument is een B<timeval> "struct" zoals bepaald in I<E<lt>sys/time.hE<gt>>):

source: and gives the number of seconds and microseconds since the Epoch (see B<time>(2)). The I<tz> argument is a I<struct timezone>:
fr: et donne le nombre de secondes et microsecondes écoulées depuis l'epoch (consultez B<time>(2)). L'argument I<tz> est une structure I<timezone> composée ainsi\ :
nl: en geeft het aantal seconden en microseconden sinds de Epoch (zie B<time>(2)). Het I<tz> argument is een I<struct tijdzone>:

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: Timezone (or something else) is invalid.
fr: Le fuseau horaire (ou quelque chose d'autre) n'est pas valable.
