Repository: sebras/manpages-l10n
Catalog: po/*/man2/ioctl_getfsmap.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: ioctl_getfsmap - retrieve the physical layout of the filesystem
fr: ioctl_getfsmap - récupérer la topographie physique du système de fichiers

source: This B<ioctl>(2) operation retrieves physical extent mappings for a filesystem. This information can be used to discover which files are mapped to a physical block, examine free space, or find known bad blocks, among other things.
fr: Cette opération B<ioctl>(2) récupère les plans de domaine (extent) d'un système de fichiers. Ces informations peuvent être utilisées, entre autres, pour rechercher les fichiers associés à un bloc physique, analyser l'espace libre, ou chercher les blocs connus comme défectueux.

source: The sole argument to this operation should be a pointer to a single I<struct fsmap_head>:
fr: Le seul paramètre de cette opération doit être un pointeur vers une I<struct fsmap_head> unique :

source: struct fsmap { __u32 fmr_device; /* Device ID */ __u32 fmr_flags; /* Mapping flags */ __u64 fmr_physical; /* Device offset of segment */ __u64 fmr_owner; /* Owner ID */ __u64 fmr_offset; /* File offset of segment */ __u64 fmr_length; /* Length of segment */ __u64 fmr_reserved[3]; /* Must be zero */ };
fr: struct fsmap { __u32 fmr_device; /* ID périphérique */ __u32 fmr_flags; /* Attributs de plan */ __u64 fmr_physical; /* Adresse du segment de périphérique */ __u64 fmr_owner; /* ID du propriétaire */ __u64 fmr_offset; /* Adresse du segment de fichier */ __u64 fmr_length; /* Longueur du segment */ __u64 fmr_reserved[3]; /* Obligatoirement à zéro */ };

source: struct fsmap_head { __u32 fmh_iflags; /* Control flags */ __u32 fmh_oflags; /* Output flags */ __u32 fmh_count; /* # of entries in array incl. input */ __u32 fmh_entries; /* # of entries filled in (output) */ __u64 fmh_reserved[6]; /* Must be zero */
fr: struct fsmap_head { __u32 fmh_iflags; /* Attributs de contrôle */ __u32 fmh_oflags; /* Attributs de sortie */ __u32 fmh_count; /* # of entries in array incl. input */ __u32 fmh_entries; /* Nb d’entrées remplies (sortie) */ __u64 fmh_reserved[6]; /* Obligatoirement à zéro */

source: struct fsmap fmh_keys[2]; /* Low and high keys for the mapping search */ struct fsmap fmh_recs[]; /* Returned records */ };
fr: struct fsmap fmh_keys[2]; /* Clés basse et haute pour la recherche de plan */ struct fsmap fmh_recs[]; /* Enregistrements renvoyés */ };

source: The two I<fmh_keys> array elements specify the lowest and highest reverse-mapping key for which the application would like physical mapping information. A reverse mapping key consists of the tuple (device, block, owner, offset). The owner and offset fields are part of the key because some filesystems support sharing physical blocks between multiple files and therefore may return multiple mappings for a given physical block.
fr: Les deux éléments de tableau I<fmh_keys> indiquent la clé la plus basse et la plus haute pour laquelle l'application veut les informations du plan physique par rétro-représentation. Une clé de rétro-représentation (« retro-mapping key ») consiste dans la séquence (périphérique, bloc, propriétaire, position). Les champs du propriétaire et de la position font partie de la clé car certains systèmes de fichiers prennent en charge le partage de blocs physiques entre plusieurs fichiers, ils peuvent donc renvoyer plusieurs associations pour un bloc physique donné.

source: Filesystem mappings are copied into the I<fmh_recs> array, which immediately follows the header data.
fr: Les plans des systèmes de fichiers sont copiés dans un tableau I<fmh_recs>, qui suit immédiatement les données d'en-tête.

source: Fields of struct fsmap_head
fr: Champs de la structure fsmap_head

source: The I<fmh_iflags> field is a bit mask passed to the kernel to alter the output. No flags are currently defined, so the caller must set this value to zero.
fr: Le champ I<fmh_iflags> est un masque de bit passé au noyau pour modifier la sortie. Aucun attribut n'est actuellement défini, l'appelant doit donc positionner cette valeur à zéro.

source: The I<fmh_oflags> field is a bit mask of flags set by the kernel concerning the returned mappings. If B<FMH_OF_DEV_T> is set, then the I<fmr_device> field represents a I<dev_t> structure containing the major and minor numbers of the block device.
fr: Le champ I<fmh_oflags> est un masque de bit d'attributs positionnés par le noyau concernant les plans renvoyés. Si B<FMH_OF_DEV_T> est positionné, le champ I<fmr_device> représente une structure I<dev_t> contenant les numéros majeur et mineur du périphérique bloc.

source: The I<fmh_count> field contains the number of elements in the array being passed to the kernel. If this value is 0, I<fmh_entries> will be set to the number of records that would have been returned had the array been large enough; no mapping information will be returned.
fr: Le champ I<fmh_count> contient le nombre d'éléments du tableau à passer au noyau. Si cette valeur vaut B<0>, I<fmh_entries> sera positionné au nombre d'enregistrements qui auraient été renvoyés avec un tableau plus grand ; aucune information de plan ne sera renvoyée.

source: The I<fmh_entries> field contains the number of elements in the I<fmh_recs> array that contain useful information.
fr: Le champ I<fmh_entries> contient le nombre d'éléments du tableau I<fmh_recs> qui contiennent des informations utiles.

source: The I<fmh_reserved> fields must be set to zero.
fr: Le champ I<fmh_reserved> doit être positionné à zéro.

source: Keys
fr: Clés

source: The two key records in I<fsmap_head.fmh_keys> specify the lowest and highest extent records in the keyspace that the caller wants returned. A filesystem that can share blocks between files likely requires the tuple (I<device>, I<physical>, I<owner>, I<offset>, I<flags>) to uniquely index any filesystem mapping record. Classic non-sharing filesystems might be able to identify any record with only (I<device>, I<physical>, I<flags>). For example, if the low key is set to (8:0, 36864, 0, 0, 0), the filesystem will only return records for extents starting at or above 36\ KiB on disk. If the high key is set to (8:0, 1048576, 0, 0, 0), only records below 1\ MiB will be returned. The format of I<fmr_device> in the keys must match the format of the same field in the output records, as defined below. By convention, the field I<fsmap_head.fmh_keys[0]> must contain the low key and I<fsmap_head.fmh_keys[1]> must contain the high key for the request.
fr: Les deux enregistrements de clés I<fsmap_head.fmh_keys> indiquent les enregistrements de domaines le plus bas et le plus haut de l'espace de clés (keyspace) pour lequel l'appelant a demandé le renvoi. Un système de fichiers qui peut partager des blocs entre les fichiers exige probablement la série (I<device>, I<physical>, I<owner>, I<offset>, I<flags>) pour n'indexer que les enregistrements de plan de système de fichiers. Les systèmes de fichiers classiques qui ne permettent pas ce partage pourraient identifier n'importe quel enregistrement avec uniquement (I<device>, I<physical>, I<flags>). Par exemple, si la clé basse est positionnée sur (8:0, 36864, 0, 0, 0), le système de fichiers ne renverra que les enregistrements des domaines commençant ou se trouvant après 36 Kio sur le disque. Si la clé haute est positionnée sur (8:0, 1048576, 0, 0, 0), seuls les enregistrements inférieurs à 1 Mio seront renvoyés. Le format de I<fmr_device> dans les clés doit correspondre au format de ces mêmes champs dans les enregistrements de sortie, comme défini ci-dessous. Par convention, le champ I<fsmap_head.fmh_keys[0]> doit contenir la clé basse et le champ I<fsmap_head.fmh_keys[1]> la clé haute pour la requête.

source: For convenience, if I<fmr_length> is set in the low key, it will be added to I<fmr_block> or I<fmr_offset> as appropriate. The caller can take advantage of this subtlety to set up subsequent calls by copying I<fsmap_head.fmh_recs[fsmap_head.fmh_entries - 1]> into the low key. The function I<fsmap_advance> (defined in I<linux/fsmap.h>) provides this functionality.
fr: Par commodité, si I<fmr_length> est positionné dans la clé basse, il sera ajouté en fonction à I<fmr_block> ou à I<fmr_offset>. L'appelant peut tirer parti de cette subtilité en positionnant les appels suivants à travers la copie de I<fsmap_head.fmh_recs[fsmap_head.fmh_entries\ -\ 1]> dans la clé basse. La fonction I<fsmap_advance> (définie dans I<linux/fsmap.h>) fournit cette possibilité.

source: Fields of struct fsmap
fr: Champs de la structure fsmap

source: The I<fmr_device> field uniquely identifies the underlying storage device. If the B<FMH_OF_DEV_T> flag is set in the header's I<fmh_oflags> field, this field contains a I<dev_t> from which major and minor numbers can be extracted. If the flag is not set, this field contains a value that must be unique for each unique storage device.
fr: Le champ I<fmr_device> identifie uniquement le périphérique de stockage sous-jacent. Si l'attribut B<FMH_OF_DEV_T> est positionné dans le champ I<fmh_oflags> de l'en-tête, ce champ contient un I<dev_t> à partir duquel les numéros majeur et mineur peuvent être extraits. Si l'attribut n'est pas positionné, ce champ contient une valeur qui doit être unique pour chaque périphérique de stockage.

source: The I<fmr_physical> field contains the disk address of the extent in bytes.
fr: Le champ I<fmr_physical> contient l'adresse sur le disque du domaine en octets.

source: The I<fmr_owner> field contains the owner of the extent. This is an inode number unless B<FMR_OF_SPECIAL_OWNER> is set in the I<fmr_flags> field, in which case the value is determined by the filesystem. See the section below about owner values for more details.
fr: Le champ I<fmr_owner> contient le propriétaire du domaine. Il s'agit d'un numéro d'inœud, sauf si B<FMR_OF_SPECIAL_OWNER> est positionné dans le champ I<fmr_flags>, auquel cas la valeur est déterminée par le système de fichiers. Voir la section ci-dessous concernant les valeurs du propriétaire pour plus de détails.

source: The I<fmr_offset> field contains the logical address in the mapping record in bytes. This field has no meaning if the B<FMR_OF_SPECIAL_OWNER> or B<FMR_OF_EXTENT_MAP> flags are set in I<fmr_flags>.
fr: Le champ I<fmr_offset> contient l'adresse logique sur l'enregistrement du plan en octets. Ce champ n'a aucun sens si les attributs B<FMR_OF_SPECIAL_OWNER> ou B<FMR_OF_EXTENT_MAP> sont positionnés dans I<fmr_flags>.

source: The I<fmr_length> field contains the length of the extent in bytes.
fr: Le champ I<fmr_length> contient la longueur du domaine en octets.

source: The I<fmr_flags> field is a bit mask of extent state flags. The bits are:
fr: Le champ I<fmr_flags> est un masque de bit des attributs d'état du domaine. Les bits sont :

source: The extent is allocated but not yet written.
fr: Le domaine est alloué mais pas encore écrit.

source: This extent contains extended attribute data.
fr: Ce domaine contient des données d'attributs étendus.

source: This extent contains extent map information for the owner.
fr: Ce domaine contient des informations sur le plan de domaine pour le propriétaire.

source: Parts of this extent may be shared.
fr: Certaines parties de ce domaine peuvent être partagées.

source: The I<fmr_owner> field contains a special value instead of an inode number.
fr: Le champ I<fmr_owner> contient une valeur spéciale et non un numéro d'inœud.

source: This is the last record in the data set.
fr: Il s'agit du dernier enregistrement du jeu de données.

source: The I<fmr_reserved> field will be set to zero.
fr: Le champ I<fmr_reserved> sera positionné à zéro.

source: Owner values
fr: valeur du propriétaire

source: Generally, the value of the I<fmr_owner> field for non-metadata extents should be an inode number. However, filesystems are under no obligation to report inode numbers; they may instead report B<FMR_OWN_UNKNOWN> if the inode number cannot easily be retrieved, if the caller lacks sufficient privilege, if the filesystem does not support stable inode numbers, or for any other reason. If a filesystem wishes to condition the reporting of inode numbers based on process capabilities, it is strongly urged that the B<CAP_SYS_ADMIN> capability be used for this purpose.
fr: Généralement, la valeur du champ I<fmr_owner> pour les domaines qui ne sont pas des métadonnées devrait être un numéro d'inœud. Cependant, les systèmes de fichiers ne sont pas obligés de signaler les numéros d'inœud ; ils peuvent plutôt renvoyer B<FMR_OWN_UNKNOWN> si le numéro d'inœud ne peut pas être récupéré facilement, si l'appelant n'a pas assez de privilèges, si le système de fichiers ne gère pas les numéros d'inœud stables, ou pour toute autre raison. Si un système de fichiers souhaite conditionner l'envoi des numéros d'inœuds aux capacités du processus, il est fortement recommandé d'utiliser la capacité B<CAP_SYS_ADMIN> à cette fin.

source: The following special owner values are generic to all filesystems:
fr: Les valeurs spéciales de propriétaire suivantes sont communes à tous les systèmes de fichiers :

source: Free space.
fr: Espace libre.

source: This extent is in use but its owner is not known or not easily retrieved.
fr: Ce domaine est utilisé mais son propriétaire n'est pas connu ou n’est pas facilement récupérable.

source: This extent is filesystem metadata.
fr: Ce domaine est une métadonnée d'un système de fichiers.

source: XFS can return the following special owner values:
fr: XFS peut renvoyer les valeurs spéciales de propriétaire suivantes :

source: Static filesystem metadata which exists at a fixed address. These are the AG superblock, the AGF, the AGFL, and the AGI headers.
fr: Les métadonnées de système de fichiers statiques qui existent à une adresse fixe. Il s'agit de superblocs AG et des en-têtes AGF, AGFL et AGI.

source: The filesystem journal.
fr: Le journal du système de fichiers.

source: Allocation group metadata, such as the free space btrees and the reverse mapping btrees.
fr: Métadonnées du groupe d'allocation telles que les btrees de l'espace libre ou du rétro-plan.

source: The inode and free inode btrees.
fr: L'inœud et les btrees de l'inœud libre.

source: Inode records.
fr: Enregistrements de l'inœud.

source: Reference count information.
fr: Informations du compte de référence.

source: This extent is being used to stage a copy-on-write.
fr: Ce domaine est utilisé pour préparer une copie sur écriture.

source: This extent has been marked defective either by the filesystem or the underlying device.
fr: Cette extension a été marquée comme étant défectueuse, soit par le système de fichiers, soit par le périphérique sous-jacent.

source: ext4 can return the following special owner values:
fr: ext4 peut renvoyer les valeurs spéciales de propriétaire :

source: Static filesystem metadata which exists at a fixed address. This is the superblock and the group descriptors.
fr: Métadonnées du système de fichiers statiques qui existent à une adresse fixe. Il s'agit du superbloc et des descripteurs de groupe.

source: Block bit map.
fr: Plan de bit de bloc.

source: Inode bit map.
fr: Plan de bit d'inœud.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On error, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas d'erreur, la valeur de retour est B<-1> et I<errno> est définie pour préciser l'erreur.

source: ERRORS
fr: ERREURS

source: The error placed in I<errno> can be one of, but is not limited to, the following:
fr: L'erreur inscrite dans I<errno> peut être, entre autres, une des suivantes :

source: I<fd> is not open for reading.
fr: I<fd> n'est pas ouvert en lecture.

source: The filesystem has detected a checksum error in the metadata.
fr: Le système de fichiers a détecté une erreur de somme de contrôle dans les métadonnées.

source: The pointer passed in was not mapped to a valid memory address.
fr: Le pointeur fourni ne correspond à aucune adresse mémoire valable.

source: The array is not long enough, the keys do not point to a valid part of the filesystem, the low key points to a higher point in the filesystem's physical storage address space than the high key, or a nonzero value was passed in one of the fields that must be zero.
fr: Le tableau n'est pas assez long, les clés ne pointent pas vers une partie valable du système de fichiers, la clé basse pointe vers un point de l'espace d'adresses de stockage physique du système de fichiers plus élevé que la clé haute ou une valeur non nulle a été inscrite dans un champ qui doit contenir zéro.

source: Insufficient memory to process the request.
fr: Pas assez de mémoire pour traiter la requête.

source: The filesystem does not support this command.
fr: Le système de fichiers ne prend pas en charge cette commande.

source: The filesystem metadata is corrupt and needs repair.
fr: Les métadonnées du système de fichiers sont corrompues et doivent être réparées.

source: The B<FS_IOC_GETFSMAP> operation first appeared in Linux 4.12.
fr: L'opération B<FS_IOC_GETFSMAP> est apparue pour la première fois dans Linux 4.12.

source: CONFORMING TO
fr: CONFORMITÉ

source: This API is Linux-specific. Not all filesystems support it.
fr: Cette API est spécifique à Linux. Tous les systèmes de fichiers ne la gèrent pas.

source: EXAMPLES
fr: EXEMPLES

source: See I<io/fsmap.c> in the I<xfsprogs> distribution for a sample program.
fr: Voir I<io/fsmap.c> dans les I<xfsprogs> pour un programme d'exemple.

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.11 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.11 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page, peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: EXAMPLE
fr: EXEMPLE

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.04 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page, peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
