Repository: sebras/manpages-l10n
Catalog: po/*/man2/iopl.2.po
Languages: nl

source: NAME
nl: NAAM

source: iopl - change I/O privilege level
nl: iopl - verander In/Uit privilege niveau

source: SYNOPSIS
nl: SAMENVATTING

source: DESCRIPTION
nl: BESCHRIJVING

source: B<iopl>() changes the I/O privilege level of the calling thread, as specified by the two least significant bits in I<level>.
nl: B<iopl>() verandert het Invoer/Uitvoer privilege niveau van de aanroepende thread, zoals zoals opgegeven in de twee minst significante bits in I<niveau>.

source: The I/O privilege level for a normal thread is 0. Permissions are inherited from parents to children.
nl: Het Invoer/Uitvoer privilege niveau voor een gewone thread is 0. Permissies worden geërfd van ouders naar kinderen.

source: This call is deprecated, is significantly slower than B<ioperm>(2), and is only provided for older X servers which require access to all 65536 I/O ports. It is mostly for the i386 architecture. On many other architectures it does not exist or will always return an error.
nl: Deze aanroep is verouderd, is significant langzamer dan B<ioperm>(2), en is alleen nog voorzien voor oudere X servers die toegang nodig hebben tot alle 65536 Invoer/Uitvoer poorten. Dit is voorzien voor de i386 architectuur. Op veel andere architecturen bestaat hij niet of zal altijd een fout terug geven.

source: RETURN VALUE
nl: EIND WAARDE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: ERRORS
nl: FOUTEN

source: I<level> is greater than 3.
nl: I<niveau> is groter dan 3.

source: This call is unimplemented.
nl: Deze aanroep is niet geïmplementeerd.

source: The calling thread has insufficient privilege to call B<iopl>(); the B<CAP_SYS_RAWIO> capability is required to raise the I/O privilege level above its current value.
nl: De aanroepende thread heeft een te laag privilege om B<iopl>() aan te roepen; de B<CAP_SYS_RAWIO> capaciteit is vereist om het Invoer/Uitvoer niveau te verhogen tot boven het huidige niveau.

source: B<iopl>() is Linux-specific and should not be used in programs that are intended to be portable.
nl: B<iopl>() is Linux-specifiek en zou niet gebruikt moeten worden in programma´s die overdraagbaar moeten zijn.

source: NOTES
nl: OPMERKINGEN

source: Glibc2 has a prototype both in I<E<lt>sys/io.hE<gt>> and in I<E<lt>sys/perm.hE<gt>>. Avoid the latter, it is available on i386 only.
nl: glibc2 heeft een prototype zowel in I<E<lt>sys/io.hE<gt>> als in I<E<lt>sys/perm.hE<gt>>. Vermijd de laatste, die is alleen beschikbaar in i386.

source: Prior to Linux 5.5 B<iopl>() allowed the thread to disable interrupts while running at a higher I/O privilege level. This will probably crash the system, and is not recommended.
nl: Vóór Linux 5.5 stond B<iopl>() toe aan de thread om interrupts uit te schakelen terwijl deze op een hoger Invoer/Uitvoer niveau draait. Dit zal waarschijnlijk het systeem crashen en wordt niet aanbevolen.

source: Prior to Linux 3.7, on some architectures (such as i386), permissions I<were> inherited by the child produced by B<fork>(2) and were preserved across B<execve>(2). This behavior was inadvertently changed in Linux 3.7, and won't be reinstated.
nl: Vóór Linux 3.7 I<werden> op een aantal architecturen (zoals i386), rechten geërfd van het kind geproduceerd door B<fork>(2) en werden behouden dwars door B<execve>(2). Dit gedrag werd per ongeluk veranderd in Linux 3.7, en zal niet worden hersteld.

source: SEE ALSO
nl: ZIE OOK

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: B<int iopl(int >I<level>B<);>
nl: B<int iopl(int >I<niveau>B<);>

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: CONFORMING TO
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<int iopl(int >I<level>B<);>
nl: B<int iopl(int >I<niveau>B<);>

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<iopl>() changes the I/O privilege level of the calling process, as specified by the two least significant bits in I<level>.
nl: B<iopl>() verandert het Invoer/Uitvoer privilege niveau van de aanroepende thread, zoals zoals opgegeven in de twee minst significante bits in I<niveau>.

source: This call is necessary to allow 8514-compatible X servers to run under Linux. Since these X servers require access to all 65536 I/O ports, the B<ioperm>(2) call is not sufficient.
nl: Deze aanroep is nodig om 8514-verenigbare X servers toe te staan onder Linux te draaien. Omdat deze X servers toegang tot alle 65536 Invoer/Uitvoer poorten vereisen is de B<ioperm>(2) aanroep niet voldoende.

source: In addition to granting unrestricted I/O port access, running at a higher I/O privilege level also allows the process to disable interrupts. This will probably crash the system, and is not recommended.
nl: In aanvulling op het toestaan van onbeperkte Invoer/Uitvoer poort toegang, staat het lopen met een hoger Invoer/Uitvoer privilege het proces ook toe interrupts uit te schakelen. Dit zal het systeem waarschijnlijk crashen en wordt niet aangeraden.

source: Permissions are not inherited by the child process created by B<fork>(2) and are not preserved across B<execve>(2) (but see NOTES).
nl: Toestemmingen worden niet geërfd door het kind proces aangemaakt met B<fork>(2) en blijven niet behouden dwars door B<execve>(2) (maar zie NOTITIES).

source: The I/O privilege level for a normal process is 0.
nl: Het Invoer/Uitvoer privilege niveau voor een gewoon proces is 0.

source: This call is mostly for the i386 architecture. On many other architectures it does not exist or will always return an error.
nl: Deze aanroep is meestal voor de i386 architectuur. Op veel andere architecture bestaat hij niet of zal een fout terug geven.

source: The calling process has insufficient privilege to call B<iopl>(); the B<CAP_SYS_RAWIO> capability is required to raise the I/O privilege level above its current value.
nl: Het huidige proces heeft onvoldoende rechten om B<iopl>() aan te roepen; de B<CAP_SYS_RAWIO> capaciteit is vereist om het Invoer/Uitvoer recht niveau boven zijn huidige niveau te tillen.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
