Repository: sebras/manpages-l10n
Catalog: po/*/man2/keyctl.2.po
Languages: fr

source: I<operation> was B<KEYCTL_DH_COMPUTE> and there was an error during crypto module initialization.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et une erreur s'est produite lors de l'initialisation du module de chiffrement.

source: I<operation> was B<KEYCTL_LINK> and the requested link would result in a cycle.
fr: I<operation> était B<KEYCTL_LINK> et le rattachement demandé conduirait à une boucle.

source: I<operation> was B<KEYCTL_RESTRICT_KEYRING> and the requested keyring restriction would result in a cycle.
fr: I<operation> était B<KEYCTL_RESTRICT_KEYRING> et la restriction de trousseau demandée aboutirait à une boucle.

source: The key quota for the caller's user would be exceeded by creating a key or linking it to the keyring.
fr: Le quota de clés de l'utilisateur appelant serait dépassé si la clé était créée ou ajoutée au trousseau.

source: I<operation> was B<KEYCTL_RESTRICT_KEYRING> and keyring provided in I<arg2> argument already has a restriction set.
fr: I<operation> était B<KEYCTL_RESTRICT_KEYRING> et le trousseau fourni dans le paramètre I<arg2> comporte déjà une restriction.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and one of the following has failed:
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et une des actions suivantes a échoué :

source: copying of the I<struct keyctl_dh_params>, provided in the I<arg2> argument, from user space;
fr: copie de la I<struct keyctl_dh_params>, fournie dans le paramètre I<arg2>, depuis l'espace utilisateur ;

source: copying of the I<struct keyctl_kdf_params>, provided in the non-NULL I<arg5> argument, from user space (in case kernel supports performing KDF operation on DH operation result);
fr: copie de la I<struct keyctl_kdf_params>, fournie dans l'argument non NULL I<arg5>, depuis l'espace utilisateur (si le noyau gère l'opération KDF lors du résultat de l'opération DH) ;

source: copying of data pointed by the I<hashname> field of the I<struct keyctl_kdf_params> from user space;
fr: copie des données vers lesquelles pointe le champ I<hashname> de la I<struct keyctl_kdf_params> à partir de l'espace utilisateur ;

source: copying of data pointed by the I<otherinfo> field of the I<struct keyctl_kdf_params> from user space if the I<otherinfolen> field was nonzero;
fr: copie des données vers lesquelles pointe le champ I<otherinfo> de la I<struct keyctl_kdf_params> depuis l'espace utilisateur si le champ I<otherinfolen> n'était pas zéro ;

source: copying of the result to user space.
fr: copie du résultat vers l'espace utilisateur.

source: I<operation> was B<KEYCTL_SETPERM> and an invalid permission bit was specified in I<arg3>.
fr: I<operation> était B<KEYCTL_SETPERM> et un bit de droit non valable a été indiqué dans I<arg3>.

source: B<EINVAL> (Linux kernels before 4.12)
fr: B<EINVAL> (noyaux Linux antérieurs à 4.12)

source: I<operation> was B<KEYCTL_DH_COMPUTE>, argument I<arg5> was non-NULL.
fr: I<operation> était B<KEYCTL_DH_COMPUTE>, le paramètre I<arg5> n'était pas NULL.

source: I<operation> was B<KEYCTL_DH_COMPUTE> And the digest size of the hashing algorithm supplied is zero.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et la taille de l’empreinte numérique de l'algorithme de hachage fourni est de zéro.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the buffer size provided is not enough to hold the result. Provide 0 as a buffer size in order to obtain the minimum buffer size.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et la taille du tampon fournie n'est pas suffisante pour contenir le résultat. Mettez B<0> en tant que taille de tampon pour obtenir la taille minimale du tampon.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the hash name provided in the I<hashname> field of the I<struct keyctl_kdf_params> pointed by I<arg5> argument is too big (the limit is implementation-specific and varies between kernel versions, but it is deemed big enough for all valid algorithm names).
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et le nom de hachage fourni dans le champ I<hashname> de la I<struct keyctl_kdf_params> vers laquelle pointe le paramètre I<arg5> est trop grand (la limite est spécifique à l'implémentation et varie entre les versions du noyau, mais elle est considérée comme suffisante pour tous les noms d'algorithmes valables).

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the I<__spare> field of the I<struct keyctl_kdf_params> provided in the I<arg5> argument contains nonzero values.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et le champ I<__spare> de la I<struct keyctl_kdf_params> fournie dans le paramètre I<arg5> contient des valeurs autres que zéro.

source: An expired key was found or specified.
fr: Une clé expirée a été trouvée ou spécifiée.

source: A rejected key was found or specified.
fr: Une clé rejetée a été trouvée ou spécifiée.

source: A revoked key was found or specified.
fr: Une clé révoquée a été trouvée ou spécifiée.

source: I<operation> was B<KEYCTL_LINK> and the requested link would cause the maximum nesting depth for keyrings to be exceeded.
fr: I<operation> était B<KEYCTL_LINK> et le rattachement demandé ferait dépasser la profondeur maximale d’imbrication des trousseaux.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the buffer length exceeds B<KEYCTL_KDF_MAX_OUTPUT_LEN> (which is 1024 currently) or the I<otherinfolen> field of the I<struct keyctl_kdf_parms> passed in I<arg5> exceeds B<KEYCTL_KDF_MAX_OI_LEN> (which is 64 currently).
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et la longueur du tampon dépasse B<KEYCTL_KDF_MAX_OUTPUT_LEN> (qui est actuellement de 1024) ou le champ I<otherinfolen> de la I<struct keyctl_kdf_parms> fournie dans I<arg5> dépasse B<KEYCTL_KDF_MAX_OI_LEN> (qui est actuellement de 64).

source: B<ENFILE> (Linux kernels before 3.13)
fr: B<ENFILE> (noyaux Linux avant le 3.13)

source: I<operation> was B<KEYCTL_LINK> and the keyring is full. (Before Linux 3.13, the available space for storing keyring links was limited to a single page of memory; since Linux 3.13, there is no fixed limit.)
fr: I<operation> était B<KEYCTL_LINK> et le trousseau est complet (avant Linux 3.13, l'espace disponible de stockage de rattachements de trousseaux était limité à une seule page mémoire ; depuis Linux 3.13, il n'y a pas de limite fixée).

source: I<operation> was B<KEYCTL_UNLINK> and the key to be unlinked isn't linked to the keyring.
fr: I<operation> était B<KEYCTL_UNLINK> et la clé à détacher n'est pas rattachée au trousseau.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the hashing algorithm specified in the I<hashname> field of the I<struct keyctl_kdf_params> pointed by I<arg5> argument hasn't been found.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et l'algorithme de hachage indiqué dans le champ I<hashname> de la I<struct keyctl_kdf_params> vers laquelle pointe le paramètre I<arg5> n'a pas été trouvé.

source: I<operation> was B<KEYCTL_RESTRICT_KEYRING> and the type provided in I<arg3> argument doesn't support setting key linking restrictions.
fr: I<operation> était B<KEYCTL_RESTRICT_KEYRING> et le type fourni dans le paramètre I<arg3> ne gère pas la définition de restrictions de rattachement de clés.

source: No matching key was found or an invalid key was specified.
fr: Aucune clé correspondante n'a été trouvée, ou une clé non valable a été spécifiée.

source: The value B<KEYCTL_GET_KEYRING_ID> was specified in I<operation>, the key specified in I<arg2> did not exist, and I<arg3> was zero (meaning don't create the key if it didn't exist).
fr: La valeur B<KEYCTL_GET_KEYRING_ID> était indiquée dans I<operation>, la clé indiquée dans I<arg2> n'existait pas et I<arg3> valait zéro (ce qui veut dire ne pas créer de clé si elle n'existe pas).

source: One of kernel memory allocation routines failed during the execution of the syscall.
fr: Une des routines de l'allocation mémoire du noyau a échoué lors de l'exécution de l'appel système.

source: A key of keyring type was expected but the ID of a key with a different type was provided.
fr: Une clé de type trousseau était attendue mais l'identifiant d'une clé de type différent a été fourni.

source: I<operation> was B<KEYCTL_READ> and the key type does not support reading (e.g., the type is I<"login">).
fr: I<operation> était B<KEYCTL_READ> et le type de clé ne gère pas la lecture (par exemple, le type est I<« login »>).

source: I<operation> was B<KEYCTL_UPDATE> and the key type does not support updating.
fr: I<operation> était B<KEYCTL_UPDATE> et le type de clé ne gère pas les mises à jour.

source: I<operation> was B<KEYCTL_RESTRICT_KEYRING>, the type provided in I<arg3> argument was "asymmetric", and the key specified in the restriction specification provided in I<arg4> has type other than "asymmetric" or "keyring".
fr: I<operation> était B<KEYCTL_RESTRICT_KEYRING>, le type fourni dans le paramètre I<arg3> était « asymmetric », et la clé indiquée dans la spécification de la restriction fournie dans I<arg4> a un autre type que « asymmetric » ou « keyring ».

source: I<operation> was B<KEYCTL_GET_PERSISTENT>, I<arg2> specified a UID other than the calling thread's real or effective UID, and the caller did not have the B<CAP_SETUID> capability.
fr: I<operation> était B<KEYCTL_GET_PERSISTENT>, I<arg2> indiquait un identifiant utilisateur différent de celui de l'utilisateur réel ou effectif du thread appelant, et l'appelant n'avait pas la capacité B<CAP_SETUID>.

source: I<operation> was B<KEYCTL_SESSION_TO_PARENT> and either: all of the UIDs (GIDs) of the parent process do not match the effective UID (GID) of the calling process; the UID of the parent's existing session keyring or the UID of the caller's session keyring did not match the effective UID of the caller; the parent process is not single-thread; or the parent process is B<init>(1) or a kernel thread.
fr: I<operation> était B<KEYCTL_SESSION_TO_PARENT> et : soit tous les identifiants utilisateur (ou de groupe) du processus parent ne correspondent pas à celui effectif du processus appelant ; soit l'identifiant utilisateur du trousseau de session du parent, ou celui du trousseau de session de l'appelant, ne correspondait pas à l'identifiant de l'utilisateur effectif de l'appelant ; soit le processus parent se compose de plus d'un thread ; soit le processus parent est B<init>(1) ou un thread du noyau.

source: I<operation> was B<KEYCTL_DH_COMPUTE> and the initialization of crypto modules has timed out.
fr: I<operation> était B<KEYCTL_DH_COMPUTE> et l'initialisation des modules de chiffrement a dépassé le délai.

source: This system call first appeared in Linux 2.6.10.
fr: Cet appel système est apparu pour la première fois dans Linux 2.6.10.

source: This system call is a nonstandard Linux extension.
fr: Cet appel système est une extension Linux non standard.

source: EXAMPLES
fr: EXEMPLES

source: The program below provide subset of the functionality of the B<request-key>(8) program provided by the I<keyutils> package. For informational purposes, the program records various information in a log file.
fr: Le programme ci-dessous fournit un sous-ensemble de fonctions du programme B<request-key>(8) fourni par le paquet I<keyutils>. Pour information, le programme enregistre diverses informations dans un fichier journal.

source: As described in B<request_key>(2), the B<request-key>(8) program is invoked with command-line arguments that describe a key that is to be instantiated. The example program fetches and logs these arguments. The program assumes authority to instantiate the requested key, and then instantiates that key.
fr: Comme indiqué dans B<request_key>(2), le programme B<request-key>(8) est appelé avec les paramètres de la ligne de commande qui décrivent une clé à instancier. Le programme exemple récupère et enregistre ces arguments. Le programme endosse l'autorité d'instancier la clé demandée, puis il instancie cette clé.

source: The following shell session demonstrates the use of this program. In the session, we compile the program and then use it to temporarily replace the standard B<request-key>(8) program. (Note that temporarily disabling the standard B<request-key>(8) program may not be safe on some systems.) While our example program is installed, we use the example program shown in B<request_key>(2) to request a key.
fr: La session d'interpréteur suivante montre l'utilisation de ce programme. Dans la session, nous compilons le programme, puis nous l'utilisons pour remplacer temporairement le programme B<request-key>(8) standard (remarquez que la désactivation temporaire du programme standard B<request-key>(8) peut ne pas être sure sur certains systèmes). Tant que notre programme exemple est installé, nous utilisons le programme exemple présent dans B<request_key>(2) pour demander une clé.

source: $ B<cc -o key_instantiate key_instantiate.c -lkeyutils> $ B<sudo mv /sbin/request-key /sbin/request-key.backup> $ B<sudo cp key_instantiate /sbin/request-key> $ B<./t_request_key user mykey somepayloaddata> Key ID is 20d035bf $ B<sudo mv /sbin/request-key.backup /sbin/request-key>
fr: $ B<cc -o key_instantiate key_instantiate.c -lkeyutils> $ B<sudo mv /sbin/request-key /sbin/request-key.backup> $ B<sudo cp key_instantiate /sbin/request-key> $ B<./t_request_key user mykey somepayloaddata> L'identifiant de clé est 20d035bf $ B<sudo mv /sbin/request-key.backup /sbin/request-key>

source: Looking at the log file created by this program, we can see the command-line arguments supplied to our example program:
fr: En regardant le fichier journal créé par ce programme, on peut voir les paramètres de la ligne de commande fournis à notre programme exemple :

source: The last few lines of the above output show that the example program was able to fetch:
fr: Les dernières lignes de la sortie ci-dessus montrent que le programme exemple a pu récupérer :

source: the description of the key to be instantiated, which included the name of the key (I<mykey>);
fr: la description de la clé à instanciée, qui incluait le nom de la clé (I<mykey>) ;

source: the payload of the authorization key, which consisted of the data (I<somepayloaddata>) passed to B<request_key>(2);
fr: la charge utile de la clé d'autorisation, qui consistait dans des données (I<somepayloaddata>) passées à B<request_key>(2) ;

source: the destination keyring that was specified in the call to B<request_key>(2); and
fr: le trousseau de destination indiqué dans l'appel à B<request_key>(2) ;

source: the description of the authorization key, where we can see that the name of the authorization key matches the ID of the key that is to be instantiated (I<20d035bf>).
fr: la description de la clé d'autorisation où on peut voir que le nom de la clé correspond à l'identifiant de celle à instancier (I<20d035bf>).

source: The example program in B<request_key>(2) specified the destination keyring as B<KEY_SPEC_SESSION_KEYRING>. By examining the contents of I</proc/keys>, we can see that this was translated to the ID of the destination keyring (I<0256e6a6>) shown in the log output above; we can also see the newly created key with the name I<mykey> and ID I<20d035bf>.
fr: Le programme exemple dans B<request_key>(2) indiquait le trousseau de destination en tant que B<KEY_SPEC_SESSION_KEYRING>. En examinant le contenu de I</proc/keys>, on peut voir que cela a été transcrit dans l'identifiant du trousseau de destination (I<0256e6a6>) affiché dans le fichier journal ci-dessus ; on peut aussi voir la clé nouvellement créée dont le nom est I<mykey> et l'identifiant est I<20d035bf>.

source: Program source
fr: Source du programme

source: /* * The kernel passes a fixed set of arguments to the program * that it execs; fetch them. */ operation = argv[1]; key_to_instantiate = atoi(argv[2]); uid = atoi(argv[3]); gid = atoi(argv[4]); thread_keyring = atoi(argv[5]); process_keyring = atoi(argv[6]); session_keyring = atoi(argv[7]);
fr: /* * Le noyau passe un ensemble fixe de paramètres au programme * qu'il exécute ; les récupérer. */ operation = argv[1]; key_to_instantiate = atoi(argv[2]); uid = atoi(argv[3]); gid = atoi(argv[4]); thread_keyring = atoi(argv[5]); process_keyring = atoi(argv[6]); session_keyring = atoi(argv[7]);

source: fprintf(fp, "Command line arguments:\en"); fprintf(fp, " argv[0]: %s\en", argv[0]); fprintf(fp, " operation: %s\en", operation); fprintf(fp, " key_to_instantiate: %jx\en", (uintmax_t) key_to_instantiate); fprintf(fp, " UID: %jd\en", (intmax_t) uid); fprintf(fp, " GID: %jd\en", (intmax_t) gid); fprintf(fp, " thread_keyring: %jx\en", (uintmax_t) thread_keyring); fprintf(fp, " process_keyring: %jx\en", (uintmax_t) process_keyring); fprintf(fp, " session_keyring: %jx\en", (uintmax_t) session_keyring); fprintf(fp, "\en");
fr: fprintf(fp, "Paramètres de la ligne de commande :\en"); fprintf(fp, " argv[0]: %s\en", argv[0]); fprintf(fp, " operation: %s\en", operation); fprintf(fp, " key_to_instantiate: %jx\en", (uintmax_t) key_to_instantiate); fprintf(fp, " UID: %jd\en", (intmax_t) uid); fprintf(fp, " GID: %jd\en", (intmax_t) gid); fprintf(fp, " thread_keyring: %jx\en", (uintmax_t) thread_keyring); fprintf(fp, " process_keyring: %jx\en", (uintmax_t) process_keyring); fprintf(fp, " session_keyring: %jx\en", (uintmax_t) session_keyring); fprintf(fp, "\en");

source: fprintf(fp, "Key description: %s\en", dbuf);
fr: fprintf(fp, "Description de clé : %s\en", dbuf);

source: auth_key_payload[akp_size] = \(aq\e0\(aq; fprintf(fp, "Auth key payload: %s\en", auth_key_payload);
fr: auth_key_payload[akp_size] = \(aq\e0\(aq; fprintf(fp, "Charge utile de la clé d'auth : %s\en", auth_key_payload);

source: fprintf(fp, "Auth key ID: %jx\en", (uintmax_t) auth_key);
fr: fprintf(fp, "Identifiant de la clé d'auth : %jx\en", (uintmax_t) auth_key);

source: /* * Fetch key ID for the request_key(2) destination keyring. */ dest_keyring = keyctl(KEYCTL_GET_KEYRING_ID, KEY_SPEC_REQUESTOR_KEYRING); if (dest_keyring == -1) { fprintf(fp, "KEYCTL_GET_KEYRING_ID failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Récupérer l'identifiant de clé pour le trousseau de destination * request_key(2). */ dest_keyring = keyctl(KEYCTL_GET_KEYRING_ID, KEY_SPEC_REQUESTOR_KEYRING); if (dest_keyring == -1) { fprintf(fp, "KEYCTL_GET_KEYRING_ID a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: fprintf(fp, "Destination keyring: %jx\en", (uintmax_t) dest_keyring);
fr: fprintf(fp, "Trousseau de destination : %jx\en", (uintmax_t) dest_keyring);

source: fprintf(fp, "Auth key description: %s\en", dbuf);
fr: fprintf(fp, "Description de la clé d'auth : %s\en", dbuf);

source: SEE ALSO
fr: VOIR AUSSI

source: The kernel source files under I<Documentation/security/keys/> (or, before Linux 4.13, in the file I<Documentation/security/keys.txt>).
fr: Les fichiers sources du noyau I<Documentation/security/keys/> (ou avant Linux 4.13, dans le fichier I<Documentation/security/keys.txt>).

source: Linux Key Management Calls
fr: Gestion des clés sous Linux

source: B</* For direct call via syscall(2): */> B<#include E<lt>asm/unistd.hE<gt>> B<#include E<lt>linux/keyctl.hE<gt>> B<#include E<lt>unistd.hE<gt>>
fr: B</* Pour un appel direct à l'aide de syscall(2) : */> B<#include E<lt>asm/unistd.hE<gt>> B<#include E<lt>linux/keyctl.hE<gt>> B<#include E<lt>unistd.hE<gt>>

source: No glibc wrapper is provided for this system call; see NOTES.
fr: Aucune enveloppe n'est fournie pour la glibc pour cet appel système ; voir les NOTES.

source: The ID of the key to be described is specified in I<arg2> (cast to I<key_serial_t>). The descriptive string is returned in the buffer pointed to by I<arg3> (cast to I<char\ *>); I<arg4> (cast to I<size_t>) specifies the size of that buffer in bytes.
fr: L'identifiant de la clé à décrire est indiqué dans I<arg2> (diffusé sur I<key_serial_t>). La chaîne de description est renvoyée dans le tampon vers lequel pointe I<arg3> (diffusé sur I<char\ *>) ; I<arg4> (diffusé sur I<size_t>) indique la taille de ce tampon en octets.

source: B<Note: the intention is that the descriptive string should> B<be extensible in future kernel versions>. In particular, the I<description> field will not contain semicolons; it should be parsed by working backwards from the end of the string to find the last semicolon. This allows future semicolon-delimited fields to be inserted in the descriptive string in the future.
fr: B<Note : l'objectif est d'étendre la chaîne de description dans les futures versions du noyau>. En particulier, le champ I<description> ne contiendra pas de point-virgule ; elle doit être analysée en partant de la fin pour chercher le dernier point-virgule. Cela permettra, à l'avenir, d'insérer des champs délimités avec des points-virgules.

source: The I<arg3> and I<arg4> arguments specify the key to be searched for: I<arg3> (cast as I<char\ *>) contains the key type (a null-terminated character string up to 32 bytes in size, including the terminating null byte), and I<arg4> (cast as I<char\ *>) contains the description of the key (a null-terminated character string up to 4096 bytes in size, including the terminating null byte).
fr: Les paramètres I<arg3> et I<arg4> indiquent la clé à rechercher : I<arg3> (diffusé en tant que I<char\ *>) contient le type de clé (une chaîne de caractères se terminant par NULL et mesurant jusqu'à 32 octets en comptant l'octet NULL final), et I<arg4> (diffusé en tant que I<char\ *>) contient la description de la clé (une chaîne de caractères se terminant par NULL et mesurant jusqu'à 4096 octets en comptant l'octet NULL final).

source: This operation is the same as B<KEYCTL_INSTANTIATE>, but the payload data is specified as an array of I<iovec> structures:
fr: Cette opération est la même que B<KEYCTL_INSTANTIATE>, mais les données de la charge utile sont indiquées sous forme d'un tableau de structures I<iovec> :

source: struct iovec { void *iov_base; /* Starting address of buffer */ size_t iov_len; /* Size of buffer (in bytes) */ };
fr: struct iovec { void *iov_base; /* Début de l'adresse du tampon */ size_t iov_len; /* Taille du tampon (en octets) */ };

source: The pointer to the payload vector is specified in I<arg3> (cast as I<const struct iovec\ *>). The number of items in the vector is specified in I<arg4> (cast as I<unsigned int>).
fr: Le pointeur vers le vecteur de charge utile est indiqué dans I<arg3> (diffusé en tant que I<const struct iovec\ *>). Le nombre d'éléments du vecteur est indiqué dans I<arg4> (diffusé en tant que I<unsigned int>).

source: The I<arg3> argument (cast to I<char\ *>) points to a buffer where the result of the calculation is placed. The size of that buffer is specified in I<arg4> (cast to I<size_t>).
fr: Le paramètre I<arg3> (diffusé sur I<char\*>) pointe vers un tampon où est mis le résultat du calcul. La taille de ce tampon est indiquée dans I<arg4> (diffusé sur I<size_t>).

source: On error, -1 is returned, and I<errno> is set appropriately to indicate the error.
fr: En cas d'erreur, B<-1> est renvoyé et I<errno> est positionné adéquatement pour indiquer l'erreur.

source: I<operation> was B<KEYCTL_SEARCH> and the size of the description in I<arg4> (including the terminating null byte) exceeded 4096 bytes. size of the string (including the terminating null byte) specified in I<arg3> (the key type) or I<arg4> (the key description) exceeded the limit (32 bytes and 4096 bytes respectively).
fr: I<operation> était B<KEYCTL_SEARCH> et la taille de la description dans I<arg4> (y compris l'octet NULL final) dépassait 4096 octets. La taille de la chaîne (y compris l'octet NULL final) indiquée dans I<arg3> (le type de clé) ou dans I<arg4> (la description de la clé) dépassait les limites (respectivement 32 et 4096 octets).

source: CONFORMING TO
fr: CONFORMITÉ
