Repository: sebras/manpages-l10n
Catalog: po/*/man2/keyctl.2.po
Languages: fr

source: The caller must have I<view> permission on the specified key.
fr: L'appelant doit avoir le droit I<view> sur la clé indiquée.

source: The returned security label string will be rendered in a form appropriate to the LSM in force. For example, with SELinux, it may look like:
fr: La chaîne de l'étiquette de sécurité renvoyée sera affichée sous la bonne forme sur le LSM en mode force. Par exemple, avec SELinux, elle peut ressembler à :

source: If no LSM is currently in force, then an empty string is placed in the buffer.
fr: Si aucun LSM n'est en mode force, une chaîne vide est placée dans le tampon.

source: This operation is exposed by I<libkeyutils> via the functions B<keyctl_get_security>(3) and B<keyctl_get_security_alloc>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide des fonctions B<keyctl_get_security>(3) et B<keyctl_get_security_alloc>(3).

source: B<KEYCTL_SESSION_TO_PARENT> (since Linux 2.6.32)
fr: B<KEYCTL_SESSION_TO_PARENT> (depuis Linux 2.6.32)

source: Replace the session keyring to which the I<parent> of the calling process subscribes with the session keyring of the calling process.
fr: Remplacer le trousseau de session auquel est enregistré le I<parent> du processus appelant par celui du processus appelant.

source: The keyring will be replaced in the parent process at the point where the parent next transitions from kernel space to user space.
fr: Le trousseau sera remplacé dans le processus parent sur les prochains points de transition du parent entre l'espace noyau et l'espace utilisateur.

source: The keyring must exist and must grant the caller I<link> permission. The parent process must be single-threaded and have the same effective ownership as this process and must not be set-user-ID or set-group-ID. The UID of the parent process's existing session keyring (f it has one), as well as the UID of the caller's session keyring much match the caller's effective UID.
fr: Le trousseau doit exister et accorder le droit I<link> à l'appelant. Le processus parent doit être single-threaded et appartenir au même utilisateur/groupe effectif que ce processus, et il ne doit pas être set-user-ID ou set-group-ID. L'identifiant utilisateur du trousseau de la session existante du processus parent (s'il en existe un) et celui du trousseau de session de l'appelant doivent correspondre à celui de l'identifiant utilisateur effectif de l'appelant.

source: The fact that it is the parent process that is affected by this operation allows a program such as the shell to start a child process that uses this operation to change the shell's session keyring. (This is what the B<keyctl>(1) B<new_session> command does.)
fr: Le fait que le processus parent soit touché par cette opération permet à un programme tel qu'un interpréteur de démarrer un processus enfant qui utilise cette opération pour modifier le trousseau de session de l'interpréteur (c'est ce que fait la commande B<new_session> de B<keyctl>(1)).

source: The arguments I<arg2>, I<arg3>, I<arg4>, and I<arg5> are ignored.
fr: Les paramètres I<arg2>, I<arg3>, I<arg4> et I<arg5> sont ignorés.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_session_to_parent>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_session_to_parent>(3).

source: B<KEYCTL_REJECT> (since Linux 2.6.39)
fr: B<KEYCTL_REJECT> (depuis Linux 2.6.39)

source: Mark a key as negatively instantiated and set an expiration timer on the key. This operation provides a superset of the functionality of the earlier B<KEYCTL_NEGATE> operation.
fr: Marquer une clé comme étant instanciée négativement et positionner une durée d'expiration sur la clé. Cette opération ajoute un supplément à l'opération B<KEYCTL_NEGATE> ci-dessus.

source: The ID of the key that is to be negatively instantiated is specified in I<arg2> (cast to I<key_serial_t>). The I<arg3> (cast to I<unsigned int>) argument specifies the lifetime of the key, in seconds. The I<arg4> argument (cast to I<unsigned int>) specifies the error to be returned when a search hits this key; typically, this is one of B<EKEYREJECTED>, B<EKEYREVOKED>, or B<EKEYEXPIRED>.
fr: L'identifiant de la clé à instancier négativement est indiqué dans I<arg2> (diffusé sur I<key_serial_t>). Le paramètre I<arg3> (diffusé sur I<unsigned int>) indique la durée de vie de la clé en seconde. Le paramètre I<arg4> (diffusé sur I<unsigned int>) indique l'erreur à renvoyer quand une recherche trouve cette clé ; généralement il s'agit de B<EKEYREJECTED>, B<EKEYREVOKED> ou B<EKEYEXPIRED>.

source: If I<arg5> (cast to I<key_serial_t>) is nonzero, then, subject to the same constraints and rules as B<KEYCTL_LINK>, the negatively instantiated key is linked into the keyring whose ID is specified in I<arg5>.
fr: Si I<arg5> (diffusé sur I<key_serial_t>) n'est pas nul, la clé instanciée négativement est rattachée au trousseau dont l'identifiant est indiqué dans I<arg5>, avec les mêmes contraintes et les mêmes règles que B<KEYCTL_LINK>.

source: The caller must have the appropriate authorization key. In other words, this operation is available only from a B<request-key>(8)-style program. See B<request_key>(2).
fr: L'appelant doit avoir la clé d'autorisation adéquate. Autrement dit, cette opération n'est disponible qu'à partir d'un programme dans le style B<request-key>(8). Voir B<request_key>(2).

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_reject>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_reject>(3).

source: B<KEYCTL_INSTANTIATE_IOV> (since Linux 2.6.39)
fr: B<KEYCTL_INSTANTIATE_IOV> (depuis Linux 2.6.39)

source: Instantiate an uninstantiated key with a payload specified via a vector of buffers.
fr: Instancier une clé non instanciée avec la charge utile indiquée à l'aide d'un vecteur de tampons.

source: The I<arg2> (key ID) and I<arg5> (keyring ID) are interpreted as for B<KEYCTL_INSTANTIATE>.
fr: I<arg2> (identifiant de clé) et I<arg5> (identifiant de trousseau) sont interprétés avec B<KEYCTL_INSTANTIATE>.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_instantiate_iov>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_instantiate_iov>(3).

source: B<KEYCTL_INVALIDATE> (since Linux 3.5)
fr: B<KEYCTL_INVALIDATE> (depuis Linux 3.5)

source: Mark a key as invalid.
fr: Marquer une clé comme non valable.

source: The ID of the key to be invalidated is specified in I<arg2> (cast to I<key_serial_t>).
fr: L'identifiant de la clé à rendre non valable est indiqué dans I<arg2> (diffusé sur I<key_serial_t>).

source: To invalidate a key, the caller must have I<search> permission on the key.
fr: Pour rendre une clé non valable, l'appelant doit avoir le droit I<search> sur la clé.

source: This operation marks the key as invalid and schedules immediate garbage collection. The garbage collector removes the invalidated key from all keyrings and deletes the key when its reference count reaches zero. After this operation, the key will be ignored by all searches, even if it is not yet deleted.
fr: Cette opération marque la clé comme non valable et programme sa mise immédiate à la corbeille. Le ramasse-miettes, supprime les clés non valables de tous les trousseaux et efface la clé quand son nombre de références atteint B<0>. Après cette opération, cette clé sera ignorée par toutes les recherches, même si elle n'est pas encore effacée.

source: Keys that are marked invalid become invisible to normal key operations immediately, though they are still visible in I</proc/keys> (marked with an 'i' flag) until they are actually removed.
fr: Les clés marquées comme non valables deviennent aussitôt invisibles pour les opérations de clé normales, bien qu'elle soient encore visibles dans I</proc/keys> (avec un drapeau « i ») jusqu'à ce qu'elles soient totalement supprimées.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_invalidate>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_invalidate>(3).

source: B<KEYCTL_GET_PERSISTENT> (since Linux 3.13)
fr: B<KEYCTL_GET_PERSISTENT> (depuis Linux 3.13)

source: Get the persistent keyring (B<persistent-keyring>(7)) for a specified user and link it to a specified keyring.
fr: Récupérer le trousseau persistant (B<persistent-keyring>(7)) d'un utilisateur indiqué et le rattacher au trousseau indiqué.

source: The user ID is specified in I<arg2> (cast to I<uid_t>). If the value -1 is specified, the caller's real user ID is used. The ID of the destination keyring is specified in I<arg3> (cast to I<key_serial_t>).
fr: L'identifiant utilisateur est indiqué dans I<arg2> (diffusé sur I<uid_t>). Si la valeur B<-1> est indiquée, l'identifiant de l'utilisateur réel de l'appelant est utilisé. L'identifiant du trousseau de destination est indiqué dans I<arg3> (diffusé sur I<key_serial_t>).

source: The caller must have the B<CAP_SETUID> capability in its user namespace in order to fetch the persistent keyring for a user ID that does not match either the real or effective user ID of the caller.
fr: L'appelant doit avoir la capacité B<CAP_SETUID> dans son espace de noms utilisateur afin de récupérer le trousseau persistant pour un identifiant utilisateur qui ne correspond pas à l'identifiant utilisateur réel ou effectif de l'appelant.

source: If the call is successful, a link to the persistent keyring is added to the keyring whose ID was specified in I<arg3>.
fr: Si l'appel réussit, un lien vers le trousseau persistant est ajouté au trousseau dont l'identifiant a été indiqué dans I<arg3>.

source: The persistent keyring will be created by the kernel if it does not yet exist.
fr: Le trousseau persistant sera créé par le noyau s'il n'existe pas encore.

source: Each time the B<KEYCTL_GET_PERSISTENT> operation is performed, the persistent keyring will have its expiration timeout reset to the value in:
fr: Chaque fois que l'opération B<KEYCTL_GET_PERSISTENT> est effectuée, le trousseau persistant aura un délai d'expiration réinitialisé à la valeur dans :

source: Should the timeout be reached, the persistent keyring will be removed and everything it pins can then be garbage collected.
fr: Lorsque le délai est atteint, le trousseau persistant sera supprimé et son contenu pourra être collecté par le ramasse-miettes.

source: Persistent keyrings were added to Linux in kernel version 3.13.
fr: Des trousseaux persistants ont été ajoutés à Linux dans le noyau version 3.13.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_get_persistent>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_get_persistent>(3).

source: B<KEYCTL_DH_COMPUTE> (since Linux 4.7)
fr: B<KEYCTL_DH_COMPUTE> (depuis Linux 4.7)

source: Compute a Diffie-Hellman shared secret or public key, optionally applying key derivation function (KDF) to the result.
fr: Calculer la clé secrète Diffie-Hellman partagée ou la clé publique, en appliquant éventuellement une fonction de dérivation de clé (KDF) au résultat.

source: The I<arg2> argument is a pointer to a set of parameters containing serial numbers for three I<"user"> keys used in the Diffie-Hellman calculation, packaged in a structure of the following form:
fr: Le paramètre I<arg2> est un pointeur vers un ensemble de paramètres contenant les numéros de série de trois clés I<« utilisateur »> utilisés dans le calcul Diffie-Hellman, empaquetés dans une structure de la forme suivante :

source: struct keyctl_dh_params { int32_t private; /* The local private key */ int32_t prime; /* The prime, known to both parties */ int32_t base; /* The base integer: either a shared generator or the remote public key */ };
fr: struct keyctl_dh_params { int32_t private; /* La clé privée locale */ int32_t prime; /* Le nombre premier, connue des deux côtés */ int32_t base; /* L'entier de base : soit un générateur partagé, soit la clé publique distante */ };

source: Each of the three keys specified in this structure must grant the caller I<read> permission. The payloads of these keys are used to calculate the Diffie-Hellman result as:
fr: Chacune des trois clés indiquées dans cette structure doit accorder le droit I<read> à l'appelant. Les charges utiles de ces clés sont utilisées pour calculer le résultat Diffie-Hellman ainsi :

source: If the base is the shared generator, the result is the local public key. If the base is the remote public key, the result is the shared secret.
fr: Si la base est le générateur partagé, le résultat est la clé publique locale. Si la base est la clé publique distante, le résultat est le code secret partagé.

source: The buffer must be large enough to accommodate the output data, otherwise an error is returned. If I<arg4> is specified zero, in which case the buffer is not used and the operation returns the minimum required buffer size (i.e., the length of the prime).
fr: Le tampon doit être assez grand pour accueillir les données de sortie, sans quoi une erreur est renvoyée. Si I<arg4> vaut zéro, le tampon n'est pas utilisé et l'opération renvoie la taille minimale requise du tampon (à savoir la longueur du nombre premier).

source: Diffie-Hellman computations can be performed in user space, but require a multiple-precision integer (MPI) library. Moving the implementation into the kernel gives access to the kernel MPI implementation, and allows access to secure or acceleration hardware.
fr: Les calculs Diffie-Hellman peuvent être effectués dans l'espace utilisateur mais exigent une bibliothèque multiprécision d'entiers (MPI). Le déplacement de l'implémentation dans le noyau donne accès à l'implémentation MPI du noyau et permet d'accéder à la sécurisation et à l'accélération matérielle.

source: Adding support for DH computation to the B<keyctl>() system call was considered a good fit due to the DH algorithm's use for deriving shared keys; it also allows the type of the key to determine which DH implementation (software or hardware) is appropriate.
fr: L'ajout de la prise en charge du calcul DH à l'appel système B<keyctl>() a été considéré comme convenable grâce à l'utilisation de l'algorithme DH pour faire dériver les clés partagées ; cela permet aussi au type de clé de déterminer l'implémentation DH adéquate (logicielle ou matérielle).

source: If the I<arg5> argument is B<NULL>, then the DH result itself is returned. Otherwise (since Linux 4.12), it is a pointer to a structure which specifies parameters of the KDF operation to be applied:
fr: Si le paramètre I<arg5> vaut B<NULL>, le résultat DH lui-même est renvoyé. Sinon, (depuis Linux 4.12), il s'agit d'un pointeur vers une structure qui indique les paramètres de l'opération KDF à appliquer :

source: struct keyctl_kdf_params { char *hashname; /* Hash algorithm name */ char *otherinfo; /* SP800-56A OtherInfo */ __u32 otherinfolen; /* Length of otherinfo data */ __u32 __spare[8]; /* Reserved */ };
fr: struct keyctl_kdf_params { char *hashname; /* Nom de l'algorithm de hachage */ char *otherinfo; /* SP800-56A OtherInfo */ __u32 otherinfolen; /* Taille des données otherinfo */ __u32 __spare[8]; /* Réservé */ };

source: The I<hashname> field is a null-terminated string which specifies a hash name (available in the kernel's crypto API; the list of the hashes available is rather tricky to observe; please refer to the E<.UR https://www.kernel.org\:/doc\:/html\:/latest\:/crypto\:/architecture.html> "Kernel Crypto API Architecture" E<.UE> documentation for the information regarding how hash names are constructed and your kernel's source and configuration regarding what ciphers and templates with type B<CRYPTO_ALG_TYPE_SHASH> are available) to be applied to DH result in KDF operation.
fr: Le champ I<hashname> est une chaîne se terminant par NULL qui indique un nom de hachage (disponible dans l'API de chiffrement du noyau ; la liste des hachages disponibles est plutôt difficile à examiner ; veuillez vous reporter à la documentation de la E<.UR https://www.kernel.org\:/doc\:/html\:/latest\:/crypto\:/architecture.html> « Kernel Crypto API Architecture » E<.UE> pour des informations sur la manière dont les noms de hachage sont construits, et aux sources et à la configuration de votre noyau concernant les chiffrements et les modèles de type B<CRYPTO_ALG_TYPE_SHASH> disponibles) à appliquer au résultat DH dans l'opération KDF.

source: The I<otherinfo> field is an I<OtherInfo> data as described in SP800-56A section 5.8.1.2 and is algorithm-specific. This data is concatenated with the result of DH operation and is provided as an input to the KDF operation. Its size is provided in the I<otherinfolen> field and is limited by B<KEYCTL_KDF_MAX_OI_LEN> constant that defined in I<security/keys/internal.h> to a value of 64.
fr: Le champ I<otherinfo> consiste dans des données I<OtherInfo> comme décrit dans la section 5.8.1.2 de SP800-56A et il est spécifique à l'algorithme. Ces données sont concaténées avec le résultat de l'opération DH et elles sont fournies comme entrée de l'opération KDF. Leur taille est fournie dans le champ I<otherinfolen> et limitée à la constante B<KEYCTL_KDF_MAX_OI_LEN> définie dans I<security/keys/internal.h> à la valeur 64.

source: The B<__spare> field is currently unused. It was ignored until Linux 4.13 (but still should be user-addressable since it is copied to the kernel), and should contain zeros since Linux 4.13.
fr: Le champ B<__spare> est actuellement inusité. Il était ignoré jusqu'à Linux 4.13 (mais il est encore visible par l'utilisateur puisqu'il est copié dans le noyau) et il devrait contenir des zéros depuis Linux 4.13.

source: The KDF implementation complies with SP800-56A as well as with SP800-108 (the counter KDF).
fr: L'implémentation KDF se conforme à SP800-56A et à SP800-108 (le compteur KDF).

source: This operation is exposed by I<libkeyutils> (from version 1.5.10 onwards) via the functions B<keyctl_dh_compute>(3) and B<keyctl_dh_compute_alloc>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> (depuis la version 1.5.10 jusqu'à aujourd'hui) à l'aide de la fonction B<keyctl_dh_compute>(3) et de B<keyctl_dh_compute_alloc>(3).

source: B<KEYCTL_RESTRICT_KEYRING> (since Linux 4.12)
fr: B<KEYCTL_RESTRICT_KEYRING> (depuis Linux 4.12)

source: Apply a key-linking restriction to the keyring with the ID provided in I<arg2> (cast to I<key_serial_t>). The caller must have I<setattr> permission on the key. If I<arg3> is NULL, any attempt to add a key to the keyring is blocked; otherwise it contains a pointer to a string with a key type name and I<arg4> contains a pointer to string that describes the type-specific restriction. As of Linux 4.12, only the type "asymmetric" has restrictions defined:
fr: Appliquer une restriction de rattachement de clé à un trousseau dont l'identifiant est fourni dans I<arg2> (diffusé sur I<key_serial_t>). L'appelant doit avoir le droit I<setattr> sur la clé. Si I<arg3> vaut NULL, toute tentative d'ajout au trousseau est bloquée ; sinon il contient un pointeur vers une chaîne contenant le nom du type de clé et I<arg4> contient un pointeur vers une chaîne contenant la restriction spécifique au type de clé. À partir de Linux 4.12, seul le type « asymmetric » a des restrictions définies :

source: Allows only keys that are signed by a key linked to the built-in keyring (".builtin_trusted_keys").
fr: N'autoriser que les clés signées par une clé rattachée au trousseau interne (« .builtin_trusted_keys »).

source: Allows only keys that are signed by a key linked to the secondary keyring (".secondary_trusted_keys") or, by extension, a key in a built-in keyring, as the latter is linked to the former.
fr: N'autoriser que les clés signées par une clé rattachée à un trousseau secondaire (« .secondary_trusted_keys ») ou, par extension, à une clé du trousseau interne, puisque le deuxième est lié au premier.

source: If I<key> specifies the ID of a key of type "asymmetric", then only keys that are signed by this key are allowed.
fr: Si I<key> indique l'identifiant d'une clé de type « asymmetric », seules les clés signées par cette clé sont autorisées.

source: If I<key> specifies the ID of a keyring, then only keys that are signed by a key linked to this keyring are allowed.
fr: Si I<key> indique l'identifiant d'un trousseau, seules les clés signées par une clé rattachée à ce trousseau sont autorisées.

source: If ":chain" is specified, keys that are signed by a keys linked to the destination keyring (that is, the keyring with the ID specified in the I<arg2> argument) are also allowed.
fr: Si « :chain » est indiqué, les clés signées par une clé rattachée au trousseau de destination (c'est-à-dire le trousseau dont l'identifiant est indiqué dans le paramètre I<arg2>) sont aussi autorisées.

source: Note that a restriction can be configured only once for the specified keyring; once a restriction is set, it can't be overridden.
fr: Remarquez qu'une restriction ne peut être configurée qu'une fois pour le trousseau indiqué ; une fois qu'une restriction est positionnée, elle ne peut pas être contournée.

source: The argument I<arg5> is ignored.
fr: Le paramètre I<arg5> est ignoré.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: For a successful call, the return value depends on the operation:
fr: Pour qu'un appel réussisse, le code de retour dépend de l'opération\ :

source: The ID of the requested keyring.
fr: L'identifiant du trousseau demandé.

source: The ID of the joined session keyring.
fr: L'identifiant du trousseau de la session qu'on vient de rejoindre.

source: The size of the description (including the terminating null byte), irrespective of the provided buffer size.
fr: La taille de la description (comprenant l'octet NULL de fin) indépendamment de la taille du tampon fournie.

source: The ID of the key that was found.
fr: L'identifiant de la clé trouvée.

source: The amount of data that is available in the key, irrespective of the provided buffer size.
fr: La quantité de données disponibles dans la clé, indépendamment de la taille du tampon fournie.

source: The ID of the previous default keyring to which implicitly requested keys were linked (one of B<KEY_REQKEY_DEFL_USER_*>).
fr: L'identifiant du trousseau par défaut précédent auquel ont été rattachées implicitement les clés sollicitées (un parmi B<KEY_REQKEY_DEFL_USER_*>).

source: Either 0, if the ID given was 0, or the ID of the authorization key matching the specified key, if a nonzero key ID was provided.
fr: B<0> si l'identifiant donné valait B<0>, ou l'identifiant de la clé d'autorisation correspondant à la clé indiquée, si un identifiant de clé autre que zéro a été fourni.

source: The size of the LSM security label string (including the terminating null byte), irrespective of the provided buffer size.
fr: La taille de la chaîne de l'étiquette de sécurité LSM (y compris l'octet NULL de fin), indépendamment de la taille du tampon fourni.

source: The ID of the persistent keyring.
fr: L'identifiant du trousseau persistant.

source: The number of bytes copied to the buffer, or, if I<arg4> is 0, the required buffer size.
fr: Le nombre d'octets copiés dans le tampon ou, si I<arg4> vaut B<0>, la taille du tampon nécessaire.

source: All other operations
fr: Toutes les autres opérations

source: Zero.
fr: Zéro.

source: On error, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas d'erreur, la valeur de retour est B<-1> et I<errno> est définie pour préciser l'erreur.

source: ERRORS
fr: ERREURS

source: The requested operation wasn't permitted.
fr: L'opération demandée n'était pas autorisée.
