Repository: sebras/manpages-l10n
Catalog: po/*/man2/keyctl.2.po
Languages: fr

source: NAME
fr: NOM

source: keyctl - manipulate the kernel's key management facility
fr: keyctl - Manipuler la gestion des clés du noyau

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: B<keyctl>() allows user-space programs to perform key manipulation.
fr: B<keyctl>() permet aux programmes de l'espace utilisateur de manipuler des clés.

source: The operation performed by B<keyctl>() is determined by the value of the I<operation> argument. Each of these operations is wrapped by the I<libkeyutils> library (provided by the I<keyutils> package) into individual functions (noted below) to permit the compiler to check types.
fr: L'opération qu'effectue B<keyctl>() dépend de la valeur du paramètre I<operation>. Chacune de ces opérations fait partie de l'enveloppe de la bibliothèque I<libkeyutils> (fournie par le paquet I<keyutils>) en tant que fonctions individuelles (indiquées ci-dessous) pour permettre au compilateur de vérifier les types.

source: The permitted values for I<operation> are:
fr: Les valeurs autorisées pour I<operation> sont :

source: B<KEYCTL_GET_KEYRING_ID> (since Linux 2.6.10)
fr: B<KEYCTL_GET_KEYRING_ID> (depuis Linux 2.6.10)

source: Map a special key ID to a real key ID for this process.
fr: Associer l'identifiant d'une clé spéciale à celui d'une clé réelle pour ce processus.

source: This operation looks up the special key whose ID is provided in I<arg2> (cast to I<key_serial_t>). If the special key is found, the ID of the corresponding real key is returned as the function result. The following values may be specified in I<arg2>:
fr: Cette opération recherche la clé spéciale dont l'identifiant est fourni dans I<arg2> (transmis à I<key_serial_t>). Si la clé spéciale est trouvée, l'identifiant de la clé réelle correspondante est renvoyé en tant que résultat de la fonction. Les valeurs suivantes peuvent être indiquées dans I<arg2> :

source: This specifies the calling thread's thread-specific keyring. See B<thread-keyring>(7).
fr: Pour indiquer le trousseau spécifique au thread du thread appelant. Voir B<thread-keyring>(7).

source: This specifies the caller's process-specific keyring. See B<process-keyring>(7).
fr: Pour indiquer le trousseau spécifique au processus de l'appelant. Voir B<process-keyring>(7).

source: This specifies the caller's session-specific keyring. See B<session-keyring>(7).
fr: Pour indiquer le trousseau spécifique à la session de l'appelant. Voir B<session-keyring>(7).

source: This specifies the caller's UID-specific keyring. See B<user-keyring>(7).
fr: Pour indiquer le trousseau spécifique à l'UID de l'appelant. Voir B<user-keyring>(7).

source: This specifies the caller's UID-session keyring. See B<user-session-keyring>(7).
fr: Pour indiquer le trousseau spécifique à la session de l'UID de l'appelant. Voir B<user-session-keyring>(7).

source: B<KEY_SPEC_REQKEY_AUTH_KEY> (since Linux 2.6.16)
fr: B<KEY_SPEC_REQKEY_AUTH_KEY> (depuis Linux 2.6.16)

source: This specifies the authorization key created by B<request_key>(2) and passed to the process it spawns to generate a key. This key is available only in a B<request-key>(8)-style program that was passed an authorization key by the kernel and ceases to be available once the requested key has been instantiated; see B<request_key>(2).
fr: Cela indique la clé d'autorisation créée par B<request_key>(2) et passée au processus qu'il produit pour générer une clé. Cette clé n'est disponible que dans un programme à la manière de B<request-key>(8) où une clé d'autorisation a été passée par le noyau et cesse d’être disponible lorsque la clé demandée a été instanciée ; voir B<request_key>(2).

source: B<KEY_SPEC_REQUESTOR_KEYRING> (since Linux 2.6.29)
fr: B<KEY_SPEC_REQUESTOR_KEYRING> (depuis Linux 2.6.29)

source: This specifies the key ID for the B<request_key>(2) destination keyring. This keyring is available only in a B<request-key>(8)-style program that was passed an authorization key by the kernel and ceases to be available once the requested key has been instantiated; see B<request_key>(2).
fr: Cela indique l'identifiant de la clé pour le trousseau de destination B<request_key>(2). Ce trousseau n'est disponible que dans un programme dans le style de B<request-key>(8) où une clé d'autorisation a été passée par le noyau et cesse d’être disponible une fois que la clé demandée a été instanciée ; voir B<request_key>(2).

source: The behavior if the key specified in I<arg2> does not exist depends on the value of I<arg3> (cast to I<int>). If I<arg3> contains a nonzero value, then\(emif it is appropriate to do so (e.g., when looking up the user, user-session, or session key)\(ema new key is created and its real key ID returned as the function result. Otherwise, the operation fails with the error B<ENOKEY>.
fr: Si la clé indiquée dans I<arg2> n'existe pas, le comportement dépend de la valeur de I<arg3> (diffusée dans I<int>). Si I<arg3> contient une valeur non nulle — et s'il est utile de le faire (comme pour rechercher un utilisateur, une session utilisateur ou une clé de session) —, une nouvelle clé est créée et son identifiant de clé réelle est renvoyé en tant que résultat de la fonction. Sinon, l'opération échoue avec l'erreur B<ENOKEY>.

source: If a valid key ID is specified in I<arg2>, and the key exists, then this operation simply returns the key ID. If the key does not exist, the call fails with error B<ENOKEY>.
fr: Si un identifiant de clé valable est indiqué dans I<arg2> et si la clé existe, cette opération renvoie simplement l'identifiant de la clé. Si la clé n'existe pas, l'appel échoue avec l'erreur B<ENOKEY>.

source: The caller must have I<search> permission on a keyring in order for it to be found.
fr: L'appelant doit avoir le droit I<search> sur un trousseau pour qu’il soit trouvable.

source: The arguments I<arg4> and I<arg5> are ignored.
fr: Les paramètres I<arg4> et I<arg5> sont ignorés.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_get_keyring_ID>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_get_keyring_ID>(3).

source: B<KEYCTL_JOIN_SESSION_KEYRING> (since Linux 2.6.10)
fr: B<KEYCTL_JOIN_SESSION_KEYRING> (depuis Linux 2.6.10)

source: Replace the session keyring this process subscribes to with a new session keyring.
fr: Remplacer le trousseau de la session à laquelle le processus est rattaché par un nouveau trousseau de session.

source: If I<arg2> is NULL, an anonymous keyring with the description "_ses" is created and the process is subscribed to that keyring as its session keyring, displacing the previous session keyring.
fr: Si I<arg2> vaut NULL, un trousseau anonyme dont la description est « _ses » est créé et le processus est inscrit à ce trousseau en tant que trousseau de sa session, remplaçant le trousseau de la session précédente.

source: Otherwise, I<arg2> (cast to I<char\ *>) is treated as the description (name) of a keyring, and the behavior is as follows:
fr: Sinon, I<arg2> (diffusé dans I<char *>) est traité comme la description (le nom) d'un trousseau et le comportement est ainsi :

source: If a keyring with a matching description exists, the process will attempt to subscribe to that keyring as its session keyring if possible; if that is not possible, an error is returned. In order to subscribe to the keyring, the caller must have I<search> permission on the keyring.
fr: Si un trousseau ayant une description correspondante existe, le processus tentera de s'inscrire à ce trousseau en tant que trousseau de session si c'est possible ; sans quoi une erreur est renvoyée. Pour s'inscrire au trousseau, l'appelant doit avoir le droit I<search> sur le trousseau.

source: If a keyring with a matching description does not exist, then a new keyring with the specified description is created, and the process is subscribed to that keyring as its session keyring.
fr: Si un trousseau avec une description correspondante n'existe pas, un nouveau trousseau ayant la description indiquée est créé et le processus est inscrit à ce trousseau en tant que trousseau de session.

source: The arguments I<arg3>, I<arg4>, and I<arg5> are ignored.
fr: Les paramètres I<arg3>, I<arg4> et I<arg5> sont ignorés.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_join_session_keyring>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> par la fonction B<keyctl_join_session_keyring>(3).

source: B<KEYCTL_UPDATE> (since Linux 2.6.10)
fr: B<KEYCTL_UPDATE> (depuis Linux 2.6.10)

source: Update a key's data payload.
fr: Mettre à jour la charge utile des données d'une clé.

source: The I<arg2> argument (cast to I<key_serial_t>) specifies the ID of the key to be updated. The I<arg3> argument (cast to I<void\ *>) points to the new payload and I<arg4> (cast to I<size_t>) contains the new payload size in bytes.
fr: Le paramètre I<arg2> (diffusé sur I<key_serial_t>) indique l'identifiant de la clé à mettre à jour. Le paramètre I<arg3> (diffusé sur I<void\ *>) pointe vers la nouvelle charge utile et I<arg4> (diffusé sur I<size_t>) contient la taille de la nouvelle charge utile (en octets).

source: The caller must have I<write> permission on the key specified and the key type must support updating.
fr: L'appelant doit avoir les droits I<write> sur la clé indiquée et le type de clé doit gérer les mises à jour.

source: A negatively instantiated key (see the description of B<KEYCTL_REJECT>) can be positively instantiated with this operation.
fr: Une clé instanciée négativement (voir la description de B<KEYCTL_REJECT>) peut être instanciée positivement avec cette opération.

source: The I<arg5> argument is ignored.
fr: Le paramètre I<arg5> est ignoré.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_update>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_update>(3).

source: B<KEYCTL_REVOKE> (since Linux 2.6.10)
fr: B<KEYCTL_REVOKE> (depuis Linux 2.6.10)

source: Revoke the key with the ID provided in I<arg2> (cast to I<key_serial_t>). The key is scheduled for garbage collection; it will no longer be findable, and will be unavailable for further operations. Further attempts to use the key will fail with the error B<EKEYREVOKED>.
fr: Révoquer la clé dont l'identifiant est fourni dans I<arg2> (diffusé sur I<key_serial_t>). La clé est vouée à aller à la poubelle ; elle ne sera plus trouvable et ne sera plus disponible pour de futures opérations. Les futures tentatives d'utiliser la clé échoueront avec l'erreur B<EKEYREVOKED>.

source: The caller must have I<write> or I<setattr> permission on the key.
fr: L'appelant doit avoir les droits I<write> ou I<setattr> sur la clé.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_revoke>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_revoke>(3).

source: B<KEYCTL_CHOWN> (since Linux 2.6.10)
fr: B<KEYCTL_CHOWN> (depuis Linux 2.6.10)

source: Change the ownership (user and group ID) of a key.
fr: Changer le propriétaire (identifiant de l'utilisateur et du groupe) d'une clé.

source: The I<arg2> argument (cast to I<key_serial_t>) contains the key ID. The I<arg3> argument (cast to I<uid_t>) contains the new user ID (or -1 in case the user ID shouldn't be changed). The I<arg4> argument (cast to I<gid_t>) contains the new group ID (or -1 in case the group ID shouldn't be changed).
fr: Le paramètre I<arg2> (diffusé sur I<key_serial_t>) contient l'identifiant de la clé. Le paramètre I<arg3> (diffusé sur I<uid_t>) contient l'identifiant du nouvel utilisateur (ou B<-1> s'il ne doit pas être modifié). Le paramètre I<arg4> (diffusé sur I<gid_t>) contient l'identifiant du nouveau groupe (ou B<-1> s'il ne doit pas être modifié).

source: The key must grant the caller I<setattr> permission.
fr: La clé doit accorder le droit I<setattr> à l'appelant.

source: For the UID to be changed, or for the GID to be changed to a group the caller is not a member of, the caller must have the B<CAP_SYS_ADMIN> capability (see B<capabilities>(7)).
fr: Pour pouvoir modifier l'identifiant utilisateur ou utiliser un identifiant de groupe dont l'appelant n'est pas membre, l'appelant doit avoir la capacité B<CAP_SYS_ADMIN> (voir B<capabilities>(7)).

source: If the UID is to be changed, the new user must have sufficient quota to accept the key. The quota deduction will be removed from the old user to the new user should the UID be changed.
fr: Si l'identifiant utilisateur doit être modifié, le nouvel utilisateur doit avoir un quota suffisant pour accepter la clé. La déduction du quota sera déplacée de l’ancien utilisateur vers le nouveau à condition que l’UID ait changé.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_chown>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_chown>(3).

source: B<KEYCTL_SETPERM> (since Linux 2.6.10)
fr: B<KEYCTL_SETPERM> (depuis Linux 2.6.10)

source: Change the permissions of the key with the ID provided in the I<arg2> argument (cast to I<key_serial_t>) to the permissions provided in the I<arg3> argument (cast to I<key_perm_t>).
fr: Passer les droits de la clé dont l'identifiant est fourni dans le paramètre I<arg2> (diffusé sur I<key_serial_t>) à ceux fournis dans le paramètre I<arg3> (diffusé sur I<key_perm_t>).

source: If the caller doesn't have the B<CAP_SYS_ADMIN> capability, it can change permissions only for the keys it owns. (More precisely: the caller's filesystem UID must match the UID of the key.)
fr: Si l'appelant n'a pas la capacité B<CAP_SYS_ADMIN>, il ne peut modifier que les droits des clés qu'il possède. (Plus précisément, l’UID du système de fichiers de l’appelant doit correspondre à l’UID de la clé.)

source: The key must grant I<setattr> permission to the caller I<regardless> of the caller's capabilities.
fr: La clé doit accorder le droit I<setattr> à l'appelant I<indépendamment> de ses capacités.

source: The permissions in I<arg3> specify masks of available operations for each of the following user categories:
fr: Les droits dans I<arg3> indiquent les masques des opérations disponibles pour chacune des catégories suivantes d'utilisateur :

source: I<possessor> (since Linux 2.6.14)
fr: I<possessor> (depuis Linux 2.6.14)

source: This is the permission granted to a process that possesses the key (has it attached searchably to one of the process's keyrings); see B<keyrings>(7).
fr: Il s'agit des droits accordés à un processus possédant la clé (en tant qu'il est rattaché à un des trousseaux du processus trouvables) ; voir B<keyrings>(7).

source: This is the permission granted to a process whose filesystem UID matches the UID of the key.
fr: Il s'agit du droit accordé à un processus dont l'identifiant utilisateur du système de fichiers correspond à celui de la clé.

source: This is the permission granted to a process whose filesystem GID or any of its supplementary GIDs matches the GID of the key.
fr: Il s'agit du droit accordé au processus dont l'identifiant de groupe du système de fichiers ou un de ses identifiants de groupes supplémentaires correspond à celui de la clé.

source: This is the permission granted to other processes that do not match the I<user> and I<group> categories.
fr: Il s'agit du droit accordé aux autres processus qui ne rentrent pas dans les catégories I<user> et I<group>.

source: The I<user>, I<group>, and I<other> categories are exclusive: if a process matches the I<user> category, it will not receive permissions granted in the I<group> category; if a process matches the I<user> or I<group> category, then it will not receive permissions granted in the I<other> category.
fr: Les catégories I<user>, I<group> et I<other> sont exclusives : si un processus rentre dans la catégorie I<user>, il ne recevra pas de droits dans la catégorie I<group> ; s'il rentre dans la catégorie I<user> ou I<group>, il ne recevra aucun droit de la catégorie I<other>.

source: The I<possessor> category grants permissions that are cumulative with the grants from the I<user>, I<group>, or I<other> category.
fr: La catégorie I<possessor> accorde des droits qui s'ajoutent à ceux accordés en vertu des catégories I<user>, I<group> ou I<other>.

source: Each permission mask is eight bits in size, with only six bits currently used. The available permissions are:
fr: Chaque masque de droits pèse huit bits, dont seuls six sont actuellement utilisés. Les droits disponibles sont :

source: This permission allows reading attributes of a key.
fr: Droit de lire les attributs d'une clé.

source: This permission is required for the B<KEYCTL_DESCRIBE> operation.
fr: Ce droit est nécessaire pour l'opération B<KEYCTL_DESCRIBE>.

source: The permission bits for each category are B<KEY_POS_VIEW>, B<KEY_USR_VIEW>, B<KEY_GRP_VIEW>, and B<KEY_OTH_VIEW>.
fr: Les bits de droit pour chaque catégorie sont B<KEY_POS_VIEW>, B<KEY_USR_VIEW>, B<KEY_GRP_VIEW> et B<KEY_OTH_VIEW>.

source: This permission allows reading a key's payload.
fr: Lire la charge utile d'une clé.

source: This permission is required for the B<KEYCTL_READ> operation.
fr: Ce droit est nécessaire pour l'opération B<KEYCTL_READ>.

source: The permission bits for each category are B<KEY_POS_READ>, B<KEY_USR_READ>, B<KEY_GRP_READ>, and B<KEY_OTH_READ>.
fr: Les bits de droit pour chaque catégorie sont B<KEY_POS_READ>, B<KEY_USR_READ>, B<KEY_GRP_READ> et B<KEY_OTH_READ>.

source: This permission allows update or instantiation of a key's payload. For a keyring, it allows keys to be linked and unlinked from the keyring,
fr: Mettre à jour ou instancier une clé. Pour un trousseau, attacher ou détacher des clés d'un trousseau.

source: This permission is required for the B<KEYCTL_UPDATE>, B<KEYCTL_REVOKE>, B<KEYCTL_CLEAR>, B<KEYCTL_LINK>, and B<KEYCTL_UNLINK> operations.
fr: Ce droit est nécessaire pour les opérations B<KEYCTL_UPDATE>, B<KEYCTL_REVOKE>, B<KEYCTL_CLEAR>, B<KEYCTL_LINK> et B<KEYCTL_UNLINK>.

source: The permission bits for each category are B<KEY_POS_WRITE>, B<KEY_USR_WRITE>, B<KEY_GRP_WRITE>, and B<KEY_OTH_WRITE>.
fr: Les bits des droits pour chaque catégorie sont B<KEY_POS_WRITE>, B<KEY_USR_WRITE>, B<KEY_GRP_WRITE> et B<KEY_OTH_WRITE>.

source: This permission allows keyrings to be searched and keys to be found. Searches can recurse only into nested keyrings that have I<search> permission set.
fr: Rechercher dans les trousseaux et rendre les clés trouvables. Les recherches ne peuvent parcourir des trousseaux imbriqués que si les droits I<search> y sont positionnés.

source: This permission is required for the B<KEYCTL_GET_KEYRING_ID>, B<KEYCTL_JOIN_SESSION_KEYRING>, B<KEYCTL_SEARCH>, and B<KEYCTL_INVALIDATE> operations.
fr: Ce droit est nécessaire pour les opérations B<KEYCTL_GET_KEYRING_ID>, B<KEYCTL_JOIN_SESSION_KEYRING>, B<KEYCTL_SEARCH> et B<KEYCTL_INVALIDATE>.

source: The permission bits for each category are B<KEY_POS_SEARCH>, B<KEY_USR_SEARCH>, B<KEY_GRP_SEARCH>, and B<KEY_OTH_SEARCH>.
fr: Les bits de droit pour chaque catégorie sont B<KEY_POS_SEARCH>, B<KEY_USR_SEARCH>, B<KEY_GRP_SEARCH> et B<KEY_OTH_SEARCH>.

source: This permission allows a key or keyring to be linked to.
fr: Rattacher une clé ou un trousseau.

source: This permission is required for the B<KEYCTL_LINK> and B<KEYCTL_SESSION_TO_PARENT> operations.
fr: Ce droit est nécessaire pour les opérations B<KEYCTL_LINK> et B<KEYCTL_SESSION_TO_PARENT>.

source: The permission bits for each category are B<KEY_POS_LINK>, B<KEY_USR_LINK>, B<KEY_GRP_LINK>, and B<KEY_OTH_LINK>.
fr: Les bits des droits pour cette catégorie sont B<KEY_POS_LINK>, B<KEY_USR_LINK>, B<KEY_GRP_LINK> et B<KEY_OTH_LINK>.

source: I<setattr> (since Linux 2.6.15).
fr: I<setattr> (depuis Linux 2.6.15).

source: This permission allows a key's UID, GID, and permissions mask to be changed.
fr: Modifier un identifiant d'utilisateur, de groupe ou le masque de droits d'une clé.

source: This permission is required for the B<KEYCTL_REVOKE>, B<KEYCTL_CHOWN>, and B<KEYCTL_SETPERM> operations.
fr: Ce droit est nécessaire pour les opérations B<KEYCTL_REVOKE>, B<KEYCTL_CHOWN> et B<KEYCTL_SETPERM>.

source: The permission bits for each category are B<KEY_POS_SETATTR>, B<KEY_USR_SETATTR>, B<KEY_GRP_SETATTR>, and B<KEY_OTH_SETATTR>.
fr: Les bits de droits pour chaque catégorie sont B<KEY_POS_SETATTR>, B<KEY_USR_SETATTR>, B<KEY_GRP_SETATTR> et B<KEY_OTH_SETATTR>.

source: As a convenience, the following macros are defined as masks for all of the permission bits in each of the user categories: B<KEY_POS_ALL>, B<KEY_USR_ALL>, B<KEY_GRP_ALL>, and B<KEY_OTH_ALL>.
fr: Par commodité, les macros suivantes sont définies en tant que masques pour tous les bits de droits de chacune des catégories de l'utilisateur : B<KEY_POS_ALL>, B<KEY_USR_ALL>, B<KEY_GRP_ALL> et B<KEY_OTH_ALL>.

source: The I<arg4> and I<arg5> arguments are ignored.
fr: Les paramètres I<arg4> et I<arg5> sont ignorés.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_setperm>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_setperm>(3).

source: B<KEYCTL_DESCRIBE> (since Linux 2.6.10)
fr: B<KEYCTL_DESCRIBE> (depuis Linux 2.6.10)

source: Obtain a string describing the attributes of a specified key.
fr: Obtenir une chaîne décrivant les attributs d'une clé indiquée.

source: The key must grant the caller I<view> permission.
fr: La clé doit accorder le droit I<view> à l'appelant.

source: The returned string is null-terminated and contains the following information about the key:
fr: La chaîne renvoyée se termine par NULL et contient les informations suivantes sur la clé :

source: In the above, I<type> and I<description> are strings, I<uid> and I<gid> are decimal strings, and I<perm> is a hexadecimal permissions mask. The descriptive string is written with the following format:
fr: Dans ce qui précède, I<type> et I<description> sont des chaînes, I<uid> et I<gid> sont des chaînes décimales et I<perm> est un masque de droits hexadécimal. La chaîne de description est écrite dans le format suivant :

source: Writing to the buffer is attempted only when I<arg3> is non-NULL and the specified buffer size is large enough to accept the descriptive string (including the terminating null byte). In order to determine whether the buffer size was too small, check to see if the return value of the operation is greater than I<arg4>.
fr: Une tentative d'écrire dans le tampon n'a lieu que lorsque I<arg3> n'est pas NULL et quand la taille du tampon indiquée est assez grande pour accepter la chaîne de description (y compris l'octet NULL final). Afin de déterminer si la taille du tampon était trop petite, vérifiez que la valeur de retour de l'opération est supérieure à I<arg4>.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_describe>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_describe>(3).

source: Clear the contents of (i.e., unlink all keys from) a keyring.
fr: Vider le contenu (à savoir détacher les clés) d'un trousseau.

source: The ID of the key (which must be of keyring type) is provided in I<arg2> (cast to I<key_serial_t>).
fr: L'identifiant de la clé (qui doit être de type trousseau) est fourni dans I<arg2> (diffusé sur I<key_serial_t>).

source: The caller must have I<write> permission on the keyring.
fr: L'appelant doit avoir le droit I<write> sur le trousseau.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_clear>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_clear>(3).
