Repository: sebras/manpages-l10n
Catalog: po/*/man2/keyctl.2.po
Languages: fr

source: No wrapper for this system call is provided in glibc. A wrapper is provided in the I<libkeyutils> library. When employing the wrapper in that library, link with I<-lkeyutils>. However, rather than using this system call directly, you probably want to use the various library functions mentioned in the descriptions of individual operations above.
fr: Aucune enveloppe pour cet appel système n'est fournie dans la glibc. Une enveloppe est fournie dans la bibliothèque I<libkeyutils>. Quand on utilise une enveloppe de cette bibliothèque, liez-la avec I<-lkeyutils>. Cependant, plutôt que d'utiliser cet appel système directement, vous voudrez probablement utiliser les fonctions de la bibliothèque mentionnées dans les descriptions des opérations individuelles ci-dessus.

source: /* * Assume the authority to instantiate the key named in argv[2] */ if (keyctl(KEYCTL_ASSUME_AUTHORITY, key_to_instantiate) == -1) { fprintf(fp, "KEYCTL_ASSUME_AUTHORITY failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Assumer l'autorité pour instancier la clé nommée dans argv[2] */ if (keyctl(KEYCTL_ASSUME_AUTHORITY, key_to_instantiate) == -1) { fprintf(fp, "KEYCTL_ASSUME_AUTHORITY a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: /* * Fetch the description of the key that is to be instantiated */ if (keyctl(KEYCTL_DESCRIBE, key_to_instantiate, dbuf, sizeof(dbuf)) == -1) { fprintf(fp, "KEYCTL_DESCRIBE failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Récupérer la description de la clé à instancier */ if (keyctl(KEYCTL_DESCRIBE, key_to_instantiate, dbuf, sizeof(dbuf)) == -1) { fprintf(fp, "KEYCTL_DESCRIBE a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: /* * Fetch the payload of the authorization key, which is * actually the callout data given to request_key() */ akp_size = keyctl(KEYCTL_READ, KEY_SPEC_REQKEY_AUTH_KEY, auth_key_payload, sizeof(auth_key_payload)); if (akp_size == -1) { fprintf(fp, "KEYCTL_READ failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Récupérer la charge utile de la clé d'autorisation, qui est en fait * les données d'appel (callout) données à request_key() */ akp_size = keyctl(KEYCTL_READ, KEY_SPEC_REQKEY_AUTH_KEY, auth_key_payload, sizeof(auth_key_payload)); if (akp_size == -1) { fprintf(fp, "KEYCTL_READ a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: /* * For interest, get the ID of the authorization key and * display it. */ auth_key = keyctl(KEYCTL_GET_KEYRING_ID, KEY_SPEC_REQKEY_AUTH_KEY); if (auth_key == -1) { fprintf(fp, "KEYCTL_GET_KEYRING_ID failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Par intérêt, récupérer l'identifiant de la clé d'autorisation et * l'afficher. */ auth_key = keyctl(KEYCTL_GET_KEYRING_ID, KEY_SPEC_REQKEY_AUTH_KEY); if (auth_key == -1) { fprintf(fp, "KEYCTL_GET_KEYRING_ID a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: /* * Fetch the description of the authorization key. This * allows us to see the key type, UID, GID, permissions, * and description (name) of the key. Among other things, * we will see that the name of the key is a hexadecimal * string representing the ID of the key to be instantiated. */ if (keyctl(KEYCTL_DESCRIBE, KEY_SPEC_REQKEY_AUTH_KEY, dbuf, sizeof(dbuf)) == -1) { fprintf(fp, "KEYCTL_DESCRIBE failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Récupérer la description de la clé d'autorisation. Cela nous permet * de voir le type de clé, l'identifiant utilisateur et de groupe, les * droits et la description (nom) de la clé. Entre autres choses, * on verra que le nom de la clé est une chaîne hexadécimale représentant * l'identifiant de la clé à instancier. */ if (keyctl(KEYCTL_DESCRIBE, KEY_SPEC_REQKEY_AUTH_KEY, dbuf, sizeof(dbuf)) == -1) { fprintf(fp, "KEYCTL_DESCRIBE a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: /* * Instantiate the key using the callout data that was supplied * in the payload of the authorization key. */ if (keyctl(KEYCTL_INSTANTIATE, key_to_instantiate, auth_key_payload, akp_size + 1, dest_keyring) == -1) { fprintf(fp, "KEYCTL_INSTANTIATE failed: %s\en", strerror(errno)); exit(EXIT_FAILURE); }
fr: /* * Instancier la clé en utilisant les données de l'appel (callout) * fournies dans la charge utile de la clé d'autorisation. */ if (keyctl(KEYCTL_INSTANTIATE, key_to_instantiate, auth_key_payload, akp_size + 1, dest_keyring) == -1) { fprintf(fp, "KEYCTL_INSTANTIATE a échoué : %s\en", strerror(errno)); exit(EXIT_FAILURE); }

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: EXAMPLE
fr: EXEMPLE

source: int main(int argc, char *argv[]) { FILE *fp; time_t t; char *operation; key_serial_t key_to_instantiate, dest_keyring; key_serial_t thread_keyring, process_keyring, session_keyring; uid_t uid; gid_t gid; char dbuf[256]; char auth_key_payload[256]; int akp_size; /* Size of auth_key_payload */
fr: int main(int argc, char *argv[]) { FILE *fp; time_t t; char *operation; key_serial_t key_to_instantiate, dest_keyring; key_serial_t thread_keyring, process_keyring, session_keyring; uid_t uid; gid_t gid; char dbuf[256]; char auth_key_payload[256]; int akp_size; /* Taille de auth_key_payload */

source: fprintf(fp, "Command line arguments:\en"); fprintf(fp, " argv[0]: %s\en", argv[0]); fprintf(fp, " operation: %s\en", operation); fprintf(fp, " key_to_instantiate: %lx\en", (long) key_to_instantiate); fprintf(fp, " UID: %ld\en", (long) uid); fprintf(fp, " GID: %ld\en", (long) gid); fprintf(fp, " thread_keyring: %lx\en", (long) thread_keyring); fprintf(fp, " process_keyring: %lx\en", (long) process_keyring); fprintf(fp, " session_keyring: %lx\en", (long) session_keyring); fprintf(fp, "\en");
fr: fprintf(fp, "Paramètres de la ligne de commande :\en"); fprintf(fp, " argv[0] : %s\en", argv[0]); fprintf(fp, " opération : %s\en", operation); fprintf(fp, " clé_à_instancier : %lx\en", (long) key_to_instantiate); fprintf(fp, " identifiant utilisateur : %ld\en", (long) uid); fprintf(fp, " identifiant utilisateur : %ld\en", (long) gid); fprintf(fp, " trousseau_thread : %lx\en", (long) thread_keyring); fprintf(fp, " trousseau_processus : %lx\en", (long) process_keyring); fprintf(fp, " trousseau_session : %lx\en", (long) session_keyring); fprintf(fp, "\en");

source: fprintf(fp, "Auth key ID: %lx\en", (long) auth_key);
fr: fprintf(fp, "Identifiant de la clé d'auth : %lx\en", (long) auth_key);

source: fprintf(fp, "Destination keyring: %lx\en", (long) dest_keyring);
fr: fprintf(fp, "Trousseau de destination : %lx\en", (long) dest_keyring);

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
