Repository: sebras/manpages-l10n
Catalog: po/*/man2/keyctl.2.po
Languages: fr

source: B<KEYCTL_LINK> (since Linux 2.6.10)
fr: B<KEYCTL_LINK> (depuis Linux 2.6.10)

source: Create a link from a keyring to a key.
fr: Créer un lien d'un trousseau vers une clé.

source: The key to be linked is specified in I<arg2> (cast to I<key_serial_t>); the keyring is specified in I<arg3> (cast to I<key_serial_t>).
fr: La clé à rattacher est indiquée dans I<arg2> (diffusé sur I<key_serial_t>) ; le trousseau est indiqué dans I<arg3> (diffusé sur I<key_serial_t>).

source: If a key with the same type and description is already linked in the keyring, then that key is displaced from the keyring.
fr: Si une clé du même type et ayant la même description se trouve déjà rattachée au trousseau, elle est éliminée du trousseau.

source: Before creating the link, the kernel checks the nesting of the keyrings and returns appropriate errors if the link would produce a cycle or if the nesting of keyrings would be too deep (The limit on the nesting of keyrings is determined by the kernel constant B<KEYRING_SEARCH_MAX_DEPTH>, defined with the value 6, and is necessary to prevent overflows on the kernel stack when recursively searching keyrings).
fr: Avant de créer le rattachement, le noyau vérifie la profondeur des trousseaux et renvoie les erreurs adéquates si le rattachement crée une boucle ou si la profondeur des trousseaux serait trop importante (la limite de profondeur est définie par la constante B<KEYRING_SEARCH_MAX_DEPTH> du noyau, fixée à 6, et elle est nécessaire pour empêcher les débordements de de la pile du noyau lors d'une recherche récursive de trousseaux).

source: The caller must have I<link> permission on the key being added and I<write> permission on the keyring.
fr: L'appelant doit avoir le droit I<link> sur la clé à ajouter et celui I<write> sur le trousseau.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_link>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_link>(3).

source: B<KEYCTL_UNLINK> (since Linux 2.6.10)
fr: B<KEYCTL_UNLINK> (depuis Linux 2.6.10)

source: Unlink a key from a keyring.
fr: Supprimer une clé d'un trousseau.

source: The ID of the key to be unlinked is specified in I<arg2> (cast to I<key_serial_t>); the ID of the keyring from which it is to be unlinked is specified in I<arg3> (cast to I<key_serial_t>).
fr: L'identifiant de la clé à détacher est indiqué dans I<arg2> (diffusé sur I<key_serial_t>) ; l'identifiant du trousseau d'où la clé doit être détachée est indiqué dans I<arg3> (diffusé sur I<key_serial_t>).

source: If the key is not currently linked into the keyring, an error results.
fr: Si la clé n'est pas rattachée au trousseau, cela produit une erreur.

source: The caller must have I<write> permission on the keyring from which the key is being removed.
fr: L'appelant doit avoir le droit I<write> sur le trousseau d'où doit être détachée la clé.

source: If the last link to a key is removed, then that key will be scheduled for destruction.
fr: Si le dernier rattachement d'une clé est supprimé, cette clé sera mise en destruction.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_unlink>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_unlink>(3).

source: B<KEYCTL_SEARCH> (since Linux 2.6.10)
fr: B<KEYCTL_SEARCH> (depuis Linux 2.6.10)

source: Search for a key in a keyring tree, returning its ID and optionally linking it to a specified keyring.
fr: Chercher une clé dans l'arborescence d'un trousseau, renvoyer son identifiant et, éventuellement, la rattacher à un trousseau indiqué.

source: The tree to be searched is specified by passing the ID of the head keyring in I<arg2> (cast to I<key_serial_t>). The search is performed breadth-first and recursively.
fr: L'arborescence où doit s'effectuer la recherche est indiquée en passant l'identifiant de la clé de tête à I<arg2> (diffusé sur I<key_serial_t>). La recherche s'effectue en largeur et récursivement.

source: The source keyring must grant I<search> permission to the caller. When performing the recursive search, only keyrings that grant the caller I<search> permission will be searched. Only keys with for which the caller has I<search> permission can be found.
fr: Le trousseau d'origine doit autoriser l'appelant à I<search>. Pendant la recherche récursive, seuls les trousseaux accordant le droit I<search> à l'appelant seront explorés. Seules les clés pour lesquelles l'appelant a le droit I<search> seront trouvées.

source: If the key is found, its ID is returned as the function result.
fr: Si la clé est trouvée, son identifiant est renvoyé en tant que résultat de la fonction.

source: If the key is found and I<arg5> (cast to I<key_serial_t>) is nonzero, then, subject to the same constraints and rules as B<KEYCTL_LINK>, the key is linked into the keyring whose ID is specified in I<arg5>. If the destination keyring specified in I<arg5> already contains a link to a key that has the same type and description, then that link will be displaced by a link to the key found by this operation.
fr: Si la clé est trouvée et si I<arg5> (diffusé sur I<key_serial_t>) n'est pas zéro, la clé est rattachée au trousseau indiqué dont l'identifiant est indiqué dans I<arg5>, avec les mêmes contraintes et les mêmes règles que B<KEYCTL_LINK>. Si le trousseau cible indiqué dans I<arg5> contient déjà une clé rattachée du même type et à la même description, cet attachement sera remplacé par un autre avec la clé trouvée avec cette opération.

source: Instead of valid existing keyring IDs, the source (I<arg2>) and destination (I<arg5>) keyrings can be one of the special keyring IDs listed under B<KEYCTL_GET_KEYRING_ID>.
fr: Plutôt que des identifiants de trousseaux existants valables, les trousseaux d'origine (I<arg2>) et cible (I<arg5>) peuvent être un des identifiants de trousseau de clés spéciales indiqué dans B<KEYCTL_GET_KEYRING_ID>.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_search>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_search>(3).

source: B<KEYCTL_READ> (since Linux 2.6.10)
fr: B<KEYCTL_READ> (depuis Linux 2.6.10)

source: Read the payload data of a key.
fr: Lire les données de la charge utile (I<payload>) d'une clé.

source: The ID of the key whose payload is to be read is specified in I<arg2> (cast to I<key_serial_t>). This can be the ID of an existing key, or any of the special key IDs listed for B<KEYCTL_GET_KEYRING_ID>.
fr: L'identifiant de la clé dont la charge utile va être lue est indiqué dans I<arg2> (diffusé sur I<key_serial_t>). Il peut s'agir de l'identifiant d'une clé existante ou un identifiant de clé spéciale listé dans B<KEYCTL_GET_KEYRING_ID>.

source: The payload is placed in the buffer pointed by I<arg3> (cast to I<char\ *>); the size of that buffer must be specified in I<arg4> (cast to I<size_t>).
fr: La charge utile est mise dans le tampon vers lequel pointe I<arg3> (diffusé sur I<char\ *>) ; la taille de ce tampon doit être indiquée dans I<arg4> (diffusé sur I<size_t>).

source: The returned data will be processed for presentation according to the key type. For example, a keyring will return an array of I<key_serial_t> entries representing the IDs of all the keys that are linked to it. The I<user> key type will return its data as is. If a key type does not implement this function, the operation fails with the error B<EOPNOTSUPP>.
fr: Les données renvoyées seront traitées pour être présentées en fonction du type de clé. Par exemple, un trousseau renverra un tableau d'entrées I<key_serial_t> qui représentent les identifiants de toutes les clés qui y sont rattachées. Le type de clé I<user> renverra ses données telles quelles. Si un type de clé n'implémente pas cette fonction, l'opération échoue avec l'erreur B<EOPNOTSUPP>.

source: If I<arg3> is not NULL, as much of the payload data as will fit is copied into the buffer. On a successful return, the return value is always the total size of the payload data. To determine whether the buffer was of sufficient size, check to see that the return value is less than or equal to the value supplied in I<arg4>.
fr: Si I<arg3> n'est pas NULL, autant de données que possible de la charge utile seront copiées dans le tampon. En cas de renvoi d'un succès, la valeur est toujours la taille totale des données de la charge utile. Pour savoir si le tampon était de taille suffisante, vérifiez que la valeur de retour est inférieure ou égale à celle fournie dans I<arg4>.

source: The key must either grant the caller I<read> permission, or grant the caller I<search> permission when searched for from the process keyrings (i.e., the key is possessed).
fr: La clé doit accorder à l'appelant le droit I<read>, ou bien lui accorder le droit I<search> quand elle est recherchée depuis les trousseaux d'un processus (à savoir quand elle est détenue).

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_read>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_read>(3).

source: B<KEYCTL_INSTANTIATE> (since Linux 2.6.10)
fr: B<KEYCTL_INSTANTIATE> (depuis Linux 2.6.10)

source: (Positively) instantiate an uninstantiated key with a specified payload.
fr: Instancier (positivement) une clé non instanciée avec une charge utile indiquée

source: The ID of the key to be instantiated is provided in I<arg2> (cast to I<key_serial_t>).
fr: L'identifiant de la clé à instancier est fournie dans I<arg2> (diffusée sur I<key_serial_t>).

source: The key payload is specified in the buffer pointed to by I<arg3> (cast to I<void\ *>); the size of that buffer is specified in I<arg4> (cast to I<size_t>).
fr: La charge utile de la clé est indiquée dans le tampon vers lequel pointe I<arg3> (diffusé sur I<void\ *>) ; la taille de ce tampon est indiquée dans I<arg4> (diffusée sur I<size_t>).

source: The payload may be a NULL pointer and the buffer size may be 0 if this is supported by the key type (e.g., it is a keyring).
fr: La charge utile peut être un pointeur NULL et la taille du tampon peut être de B<0> si cela est pris en charge par le type de clé (si c'est un trousseau, par exemple).

source: The operation may be fail if the payload data is in the wrong format or is otherwise invalid.
fr: L'opération peut échouer si les données de charge utile sont dans un mauvais format ou non valables pour toute autre raison.

source: If I<arg5> (cast to I<key_serial_t>) is nonzero, then, subject to the same constraints and rules as B<KEYCTL_LINK>, the instantiated key is linked into the keyring whose ID specified in I<arg5>.
fr: Si I<arg5> (diffusé sur I<key_serial_t>) n'est pas zéro, la clé instanciée est rattachée au trousseau dont l'identifiant a été indiqué dans I<arg5>, avec les mêmes contraintes et les mêmes règles que B<KEYCTL_LINK>.

source: The caller must have the appropriate authorization key, and once the uninstantiated key has been instantiated, the authorization key is revoked. In other words, this operation is available only from a B<request-key>(8)-style program. See B<request_key>(2) for an explanation of uninstantiated keys and key instantiation.
fr: L'appelant doit avoir la clé d'autorisation adéquate, et une fois que la clé non instanciée a été instanciée, la clé d'autorisation est révoquée. Autrement dit, cette opération n'est disponible qu'à partir d'un programme de style B<request-key>(8). Voir B<request_key>(2) pour une explication sur les clés non instanciées et l'instanciation de clés.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_instantiate>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_instantiate>(3).

source: B<KEYCTL_NEGATE> (since Linux 2.6.10)
fr: B<KEYCTL_NEGATE> (depuis Linux 2.6.10)

source: Negatively instantiate an uninstantiated key.
fr: Instancier négativement une clé non instanciée.

source: This operation is equivalent to the call:
fr: Cette opération est équivalente à l'appel :

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_negate>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_negate>(3).

source: B<KEYCTL_SET_REQKEY_KEYRING> (since Linux 2.6.13)
fr: B<KEYCTL_SET_REQKEY_KEYRING> (depuis Linux 2.6.10)

source: Set the default keyring to which implicitly requested keys will be linked for this thread, and return the previous setting. Implicit key requests are those made by internal kernel components, such as can occur when, for example, opening files on an AFS or NFS filesystem. Setting the default keyring also has an effect when requesting a key from user space; see B<request_key>(2) for details.
fr: Définir le trousseau par défaut auquel les clés demandées implicitement seront rattachées pour ce thread et renvoyer la configuration précédente. Les requêtes de clé implicites sont celles que des composants du noyau effectuent en interne, comme par exemple lors de l'ouverture de fichiers sur des systèmes de fichiers AFS ou NFS. Le fait de définir un trousseau par défaut produit également des effets lors d'une demande de clé depuis l'espace utilisateur ; voir B<request_key>(2) pour les détails.

source: The I<arg2> argument (cast to I<int>) should contain one of the following values, to specify the new default keyring:
fr: Le paramètre I<arg2> (diffusé sur I<int>) doit contenir une des valeurs suivantes pour indiquer le nouveau trousseau par défaut :

source: Don't change the default keyring. This can be used to discover the current default keyring (without changing it).
fr: Ne pas modifier le trousseau par défaut. Cela peut servir à rechercher le trousseau par défaut actuel (sans le modifier).

source: This selects the default behaviour, which is to use the thread-specific keyring if there is one, otherwise the process-specific keyring if there is one, otherwise the session keyring if there is one, otherwise the UID-specific session keyring, otherwise the user-specific keyring.
fr: Cela sélectionne le comportement par défaut qui consiste à utiliser le trousseau spécifique au thread s'il y en a un, ou sinon celui spécifique au processus s'il y en a un, ou bien celui spécifique à la session s'il y en a un, ou sinon celui de la session spécifique de l'identifiant utilisateur, ou celui spécifique à l'utilisateur.

source: Use the thread-specific keyring (B<thread-keyring>(7)) as the new default keyring.
fr: Utiliser le trousseau spécifique du thread (B<thread-keyring>(7)) en tant que nouveau trousseau par défaut.

source: Use the process-specific keyring (B<process-keyring>(7)) as the new default keyring.
fr: Utiliser le trousseau spécifique au processus (B<process-keyring>(7)) en tant que nouveau trousseau par défaut.

source: Use the session-specific keyring (B<session-keyring>(7)) as the new default keyring.
fr: Utiliser le trousseau spécifique à la session (B<session-keyring>(7)) en tant que nouveau trousseau par défaut.

source: Use the UID-specific keyring (B<user-keyring>(7)) as the new default keyring.
fr: Utiliser le trousseau spécifique à l'identifiant utilisateur (B<user-keyring>(7)) en tant que nouveau trousseau par défaut.

source: Use the UID-specific session keyring (B<user-session-keyring>(7)) as the new default keyring.
fr: Utiliser le trousseau de la session spécifique de l'identifiant utilisateur (B<user-session-keyring>(7)) en tant que nouveau trousseau par défaut.

source: B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING> (since Linux 2.6.29)
fr: B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING> (depuis Linux 2.6.29)

source: Use the requestor keyring.
fr: Utiliser le trousseau du demandeur.

source: All other values are invalid.
fr: Toutes les autres valeurs ne sont pas valables.

source: The setting controlled by this operation is inherited by the child of B<fork>(2) and preserved across B<execve>(2).
fr: Le paramètre que contrôle cette opération est récupéré par l'enfant de B<fork>(2) et conservé durant un B<execve>(2).

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_set_reqkey_keyring>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_set_reqkey_keyring>(3).

source: B<KEYCTL_SET_TIMEOUT> (since Linux 2.6.16)
fr: B<KEYCTL_SET_TIMEOUT> (depuis Linux 2.6.10)

source: Set a timeout on a key.
fr: Définir un délai d'expiration sur une clé.

source: The ID of the key is specified in I<arg2> (cast to I<key_serial_t>). The timeout value, in seconds from the current time, is specified in I<arg3> (cast to I<unsigned int>). The timeout is measured against the realtime clock.
fr: L'identifiant de la clé est indiqué dans I<arg2> (diffusé sur I<key_serial_t>). La valeur du délai, en seconde à partir de l'heure actuelle, est indiquée dans I<arg3> (diffusé sur I<unsigned int>). Le délai se mesure par rapport à l'horloge en temps réel.

source: Specifying the timeout value as 0 clears any existing timeout on the key.
fr: L'indication d'une valeur de délai de B<0> vide les délais existants de la clé.

source: The I</proc/keys> file displays the remaining time until each key will expire. (This is the only method of discovering the timeout on a key.)
fr: Le fichier I</proc/keys> affiche le temps restant avant l'expiration de chaque clé (il s'agit de la seule méthode de recherche du temps de vie d'une clé).

source: The caller must either have the I<setattr> permission on the key or hold an instantiation authorization token for the key (see B<request_key>(2)).
fr: L'appelant doit avoir le droit I<setattr> sur la clé ou détenir un jeton d'autorisation d’instanciation pour cette clé (voir B<request_key>(2)).

source: The key and any links to the key will be automatically garbage collected after the timeout expires. Subsequent attempts to access the key will then fail with the error B<EKEYEXPIRED>.
fr: La clé et les liens vis-à-vis d'elle seront automatiquement mis à la poubelle après le délai d'expiration. Les futurs essais d'y accéder échoueront avec l'erreur B<EKEYEXPIRED>.

source: This operation cannot be used to set timeouts on revoked, expired, or negatively instantiated keys.
fr: Cette opération ne peut pas être utilisée pour poser des limites à des clés révoquées, expirées ou instanciées négativement.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_set_timeout>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_set_timeout>(3).

source: B<KEYCTL_ASSUME_AUTHORITY> (since Linux 2.6.16)
fr: B<KEYCTL_ASSUME_AUTHORITY> (depuis Linux 2.6.10)

source: Assume (or divest) the authority for the calling thread to instantiate a key.
fr: Assumer (ou se débarrasser) de l'autorité pour le thread appelant pour instancier une clé.

source: The I<arg2> argument (cast to I<key_serial_t>) specifies either a nonzero key ID to assume authority, or the value 0 to divest authority.
fr: Ce paramètre I<arg2> (diffusé sur I<key_serial_t>) fait assumer l'autorité à un identifiant de clé autre que zéro, ou retire l'autorité grâce à la valeur B<0>.

source: If I<arg2> is nonzero, then it specifies the ID of an uninstantiated key for which authority is to be assumed. That key can then be instantiated using one of B<KEYCTL_INSTANTIATE>, B<KEYCTL_INSTANTIATE_IOV>, B<KEYCTL_REJECT>, or B<KEYCTL_NEGATE>. Once the key has been instantiated, the thread is automatically divested of authority to instantiate the key.
fr: Si I<arg2> n'est pas zéro, il indique un identifiant de clé non instanciée qui devra assumer l'autorité. Cette clé peut alors être instanciée en utilisant B<KEYCTL_INSTANTIATE>, B<KEYCTL_INSTANTIATE_IOV>, B<KEYCTL_REJECT> ou B<KEYCTL_NEGATE>. Quand la clé a été instanciée, le thread se voit automatiquement retirer le pouvoir d'instancier la clé.

source: Authority over a key can be assumed only if the calling thread has present in its keyrings the authorization key that is associated with the specified key. (In other words, the B<KEYCTL_ASSUME_AUTHORITY> operation is available only from a B<request-key>(8)-style program; see B<request_key>(2) for an explanation of how this operation is used.) The caller must have I<search> permission on the authorization key.
fr: Une clé ne peut assumer une autorité que si le thread appelant a dans ses trousseaux la clé d'autorisation associée à la clé (autrement dit, l'opération B<KEYCTL_ASSUME_AUTHORITY> n'est disponible qu'à partir d'un programme du style B<request-key>(8) ; voir B<request_key>(2) pour une explication sur la manière dont cette opération est utilisée). L'appelant doit avoir le droit I<search> sur la clé d'autorisation.

source: If the specified key has a matching authorization key, then the ID of that key is returned. The authorization key can be read (B<KEYCTL_READ>) to obtain the callout information passed to B<request_key>(2).
fr: Si la clé indiquée a une clé d'autorisation associée, l'identifiant de cette clé est renvoyé. La clé d'autorisation peut être lue (B<KEYCTL_READ>) pour obtenir les informations d'appel transmises à B<request_key>(2).

source: If the ID given in I<arg2> is 0, then the currently assumed authority is cleared (divested), and the value 0 is returned.
fr: Si l'identifiant fourni dans I<arg2> est B<0>, l'autorité actuellement assumée est retirée et la valeur B<0> est renvoyée.

source: The B<KEYCTL_ASSUME_AUTHORITY> mechanism allows a program such as B<request-key>(8) to assume the necessary authority to instantiate a new uninstantiated key that was created as a consequence of a call to B<request_key>(2). For further information, see B<request_key>(2) and the kernel source file I<Documentation/security/keys-request-key.txt>.
fr: Le mécanisme B<KEYCTL_ASSUME_AUTHORITY> permet à un programme tel que B<requestkey>(8) d'assumer l'autorité nécessaire pour instancier une nouvelle clé non instanciée créée suite à un appel à B<request_key>(2). Pour plus d'informations, voir B<request_key>(2) et le fichier I<Documentation/security/keys-request-key.txt> des sources du noyau.

source: This operation is exposed by I<libkeyutils> via the function B<keyctl_assume_authority>(3).
fr: Cette opération est mise à disposition par I<libkeyutils> à l'aide de la fonction B<keyctl_assume_authority>(3).

source: B<KEYCTL_GET_SECURITY> (since Linux 2.6.26)
fr: B<KEYCTL_GET_SECURITY> (depuis Linux 2.6.26)

source: Get the LSM (Linux Security Module) security label of the specified key.
fr: Récupérer l'étiquette de sécurité LSM (Linux Security Module) de la clé indiquée.

source: The ID of the key whose security label is to be fetched is specified in I<arg2> (cast to I<key_serial_t>). The security label (terminated by a null byte) will be placed in the buffer pointed to by I<arg3> argument (cast to I<char\ *>); the size of the buffer must be provided in I<arg4> (cast to I<size_t>).
fr: L'identifiant de la clé dont l'étiquette doit être récupérée est indiqué dans I<arg2> (diffusé sur I<key_serial_t>). L'étiquette de sécurité (qui se termine par un octet NULL) sera mis dans le tampon vers lequel pointe I<arg3> (diffusé sur I<char\ *>) ; la taille du tampon doit être fournie dans I<arg4> (diffusée sur I<size_t>).

source: If I<arg3> is specified as NULL or the buffer size specified in I<arg4> is too small, the full size of the security label string (including the terminating null byte) is returned as the function result, and nothing is copied to the buffer.
fr: Si I<arg3> est indiqué en tant que NULL ou si la taille du tampon indiquée dans I<arg4> est trop petite, toute la taille de la chaîne de l'étiquette de sécurité (y compris l'octet NULL de fin) est renvoyée en tant que résultat de la fonction et rien n'est copié dans le tampon.
