Repository: sebras/manpages-l10n
Catalog: po/*/man2/link.2.po
Languages: nl

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: NAME
nl: NAAM

source: link, linkat - make a new name for a file
nl: link, linkat - maak een nieuwe naam voor een bestand

source: SYNOPSIS
nl: SAMENVATTING

source: B<int link(const char *>I<oldpath>B<, const char *>I<newpath>B<);>
nl: B<int link(const char *>I<oudpad>B<, const char *>I<nieuwpad>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of B<AT_*> constants */ B<#include E<lt>unistd.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van B<AT_*> constanten */ B<#include E<lt>unistd.hE<gt>>

source: B<int linkat(int >I<olddirfd>B<, const char *>I<oldpath>B<,> B< int >I<newdirfd>B<, const char *>I<newpath>B<, int >I<flags>B<);>
nl: B<int linkat(int >I<oudmapbi>B<, const char *>I<oudpad>B<,> B< int >I<nieuwmapbi>B<, const char *>I<nieuwpad>B<, int >I<vlaggen>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: Since glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Before glibc 2.10: _ATFILE_SOURCE
nl: Vanaf glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Voor glibc 2.10: _ATFILE_SOURCE

source: DESCRIPTION
nl: BESCHRIJVING

source: B<link>() creates a new link (also known as a hard link) to an existing file.
nl: B<link>() maakt een nieuwe koppeling (ook bekend als harde koppeling) naar een bestaand bestand.

source: If I<newpath> exists, it will I<not> be overwritten.
nl: Als I<nieuwpad> al bestaat, dan zal het I<niet> worden overschreven.

source: This new name may be used exactly as the old one for any operation; both names refer to the same file (and so have the same permissions and ownership) and it is impossible to tell which name was the "original".
nl: De nieuwe naam kan net zo gebruikt als de oude naam voor wat voor opdracht dan ook; beide namen wijzen naar hetzelfde bestand (en hebben daarom dezelfde toestemmingen en eigenaar) en het is onmogelijk te achterhalen wat de "oorspronkelijke" naam was.

source: The B<linkat>() system call operates in exactly the same way as B<link>(), except for the differences described here.
nl: De B<linkat>() systeem aanroep werkt op exact dezelfde manier als B<link>(), behalve dan voor de hier beschreven verschillen.

source: If the pathname given in I<oldpath> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<olddirfd> (rather than relative to the current working directory of the calling process, as is done by B<link>() for a relative pathname).
nl: Als de padnaam gegeven in I<oudpad> relatief is, dan wordt deze geïnterpreteerd als relatief aan de map aangewezen door de bestandsindicator I<oudpadbi> (in plaats van relatief aan de werk map van het aanroepende proces, zoals gedaan door B<link>() voor een relatieve padnaam).

source: If I<oldpath> is relative and I<olddirfd> is the special value B<AT_FDCWD>, then I<oldpath> is interpreted relative to the current working directory of the calling process (like B<link>()).
nl: Als I<oudpad> relatief is en I<oudpadbi> heeft de speciale waard B<AT_FDCWD>, dan wordt I<oudpad> geïnterpreteerd als relatief aan de huidige werk map van het aanroepende proces (zoals B<link>()).

source: If I<oldpath> is absolute, then I<olddirfd> is ignored.
nl: Als I<oudpad> absoluut is, dan wordt I<oudpadbi> genegeerd.

source: The interpretation of I<newpath> is as for I<oldpath>, except that a relative pathname is interpreted relative to the directory referred to by the file descriptor I<newdirfd>.
nl: De interpretatie van I<nieuwpad> is zoals voor I<oudpad> behalve dat een relatieve padnaam wordt geïnterpreteerd als relatief aan de map aangewezen door de bestandsindicator I<nieuwmapbi>.

source: The following values can be bitwise ORed in I<flags>:
nl: De volgende waarden kunnen per bit worden geOF´ed in I<vlaggen>:

source: B<AT_EMPTY_PATH> (since Linux 2.6.39)
nl: B<AT_EMPTY_PATH> (vanaf Linux 2.6.39)

source: If I<oldpath> is an empty string, create a link to the file referenced by I<olddirfd> (which may have been obtained using the B<open>(2) B<O_PATH> flag). In this case, I<olddirfd> can refer to any type of file except a directory. This will generally not work if the file has a link count of zero (files created with B<O_TMPFILE> and without B<O_EXCL> are an exception). The caller must have the B<CAP_DAC_READ_SEARCH> capability in order to use this flag. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
nl: Als I<oudpad> een lege tekenreeks is, maak dan een koppeling naar een bestand aangewezen door I<oudmapbi> (die kan zijn verkregen door de B<open>(2) B<O_PATH> vlag). In dit geval kan I<oudmapbi> wijzen naar elk type bestand behalve een map. Dit zal in het algemeen niet werken als het bestand een aantal koppelingen van nul heeft (bestanden aangemaakt met B<O_TMPFILE> en zonder B<O_EXCL> zijn een uitzondering). De aanroeper moet de B<CAP_DAC_READ_SEARCH> capaciteit hebben om deze vlag te kunnen gebruiken. Deze vlag is Linux-specifiek; definieer B<_GNU_SOURCE> om zijn definitie te verkrijgen.

source: B<AT_SYMLINK_FOLLOW> (since Linux 2.6.18)
nl: B<AT_SYMLINK_FOLLOW> (sinds Linux 2.6.18)

source: By default, B<linkat>(), does not dereference I<oldpath> if it is a symbolic link (like B<link>()). The flag B<AT_SYMLINK_FOLLOW> can be specified in I<flags> to cause I<oldpath> to be dereferenced if it is a symbolic link. If procfs is mounted, this can be used as an alternative to B<AT_EMPTY_PATH>, like this:
nl: Standaard ontkoppeld B<linkat>() I<oudpad> niet als het een symbolische koppeling (zoals B<link>()) is. De vlag B<AT_SYMLINK_FOLLOW> kan worden opgegeven in I<vlaggen> om er voor te zorgen dat I<oudpad> ontkoppeld wordt als het een symbolische koppeling is. Als procfs gekoppeld is, dan kan deze als alternatief voor B<AT_EMPTH_PATH> gebruikt worden, zoals hier:

source: Before kernel 2.6.18, the I<flags> argument was unused, and had to be specified as 0.
nl: Voor kernel 2.6.18 werd het I<vlaggen> argument niet gebruikt en moest worden opgegeven als 0.

source: See B<openat>(2) for an explanation of the need for B<linkat>().
nl: Zie B<openat>(2) voor een uitleg over de noodzaak van B<linkat>().

source: RETURN VALUE
nl: EIND WAARDE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: ERRORS
nl: FOUTEN

source: Write access to the directory containing I<newpath> is denied, or search permission is denied for one of the directories in the path prefix of I<oldpath> or I<newpath>. (See also B<path_resolution>(7).)
nl: Schrijf toegang in de map waar I<nieuwpad> in zou komen is niet toegestaan voor het geldende uid van het proces,of een van de mappen in I<oudpad> of I<nieuwpad> stond zoek (uitvoer) toestemming niet toe. (Zie ook B<path_resolution>(7).)

source: The user's quota of disk blocks on the filesystem has been exhausted.
nl: De gebruiker quota van schijf blokken op het bestandssysteem zijn uitgeput.

source: I<newpath> already exists.
nl: I<nieuwpad> bestaat al.

source: I<oldpath> or I<newpath> points outside your accessible address space.
nl: I<oudpad> of I<nieuwpad> wijzen buiten door u toegankelijke adres ruimte.

source: An I/O error occurred.
nl: Een Invoer/Uitvoer fout trad op.

source: Too many symbolic links were encountered in resolving I<oldpath> or I<newpath>.
nl: Teveel symbolische koppelingen werden tegengekomen bij het vaststellen van I<oudpad> of I<nieuwpad>.

source: The file referred to by I<oldpath> already has the maximum number of links to it. For example, on an B<ext4>(5) filesystem that does not employ the I<dir_index> feature, the limit on the number of hard links to a file is 65,000; on B<btrfs>(5), the limit is 65,535 links.
nl: Het bestand waar I<oudpad> naar wijst, heeft al het hoogste aantal mogelijke koppelingen. Bijvoorbeeld op een B<ext4>(5) bestandssysteem dat niet voorzien is van I<dir_index>, is de limiet van het aantal harde koppeling naar een bestand 65.000; op B<btrfs>(5) is de limiet 65.535 koppelingen.

source: I<oldpath> or I<newpath> was too long.
nl: I<oudpad> of I<nieuwpad> was te lang.

source: A directory component in I<oldpath> or I<newpath> does not exist or is a dangling symbolic link.
nl: Een map gedeelte van I<oudpad> of I<nieuwpad> bestaat niet of is een loshangende symbolische koppeling.

source: Insufficient kernel memory was available.
nl: Onvoldoende kernelgeheugen voorhanden.

source: The device containing the file has no room for the new directory entry.
nl: Het apparaat waar het bestand op zit heeft geen ruimte voor een nieuwe map.

source: A component used as a directory in I<oldpath> or I<newpath> is not, in fact, a directory.
nl: Een deel dat gebruikt wordt als map van I<oudpad> of I<nieuwpad> is in feite geen map.

source: I<oldpath> is a directory.
nl: I<oudpad> is een map.

source: The filesystem containing I<oldpath> and I<newpath> does not support the creation of hard links.
nl: Het bestandssysteem dat I<oudpad> en I<nieuwpad> bevat ondersteunt de aanmaak van harde koppelingen niet.

source: B<EPERM> (since Linux 3.6)
nl: B<EPERM> (sinds Linux 3.6)

source: The caller does not have permission to create a hard link to this file (see the description of I</proc/sys/fs/protected_hardlinks> in B<proc>(5)).
nl: De aanroeper heeft geen rechten om een harde koppeling naar dit bestand te maken (zie de beschrijving van I</proc/sys/fs/protected_hardlinks> in B<proc>(5)).

source: I<oldpath> is marked immutable or append-only. (See B<ioctl_iflags>(2).)
nl: I<oudpad> is gemarkeerd als onveranderlijk of alleen-toevoegen. (Zie B<ioctl_iflags>(2).)

source: The file is on a read-only filesystem.
nl: Het bestand staat op een alleen-lezen bestandssysteem.

source: I<oldpath> and I<newpath> are not on the same mounted filesystem. (Linux permits a filesystem to be mounted at multiple points, but B<link>() does not work across different mounts, even if the same filesystem is mounted on both.)
nl: I<oudpad> en I<nieuwpad> staan niet op hetzelfde aangekoppelde bestandssysteem. (Linux staat toe een bestandssysteem op verschillende punten aan te koppelen, maar B<link>() werkt niet over verschillende aankoppel punten, zelfs als hetzelfde bestandssysteem is aangekoppeld op beide.)

source: The following additional errors can occur for B<linkat>():
nl: De volgende additionele fouten kunnen optreden in B<linkat>():

source: I<oldpath> (I<newpath>) is relative but I<olddirfd> (I<newdirfd>) is neither B<AT_FDCWD> nor a valid file descriptor.
nl: I<oldpath> (I<newpath>) is relatief maar I<olddirfd> (I<newdirfd>) is noch B<AT_FDCWD> noch een geldige bestandsindicator.

source: An invalid flag value was specified in I<flags>.
nl: Een ongeldige vlag werd opgegeven in I<vlaggen>.

source: B<AT_EMPTY_PATH> was specified in I<flags>, but the caller did not have the B<CAP_DAC_READ_SEARCH> capability.
nl: B<AT_EMPTY_PATH> werd opgegeven in I<vlaggen>, maar de aanroeper heeft niet de B<CAP_DAC_READ_SEARCH> capaciteit.

source: An attempt was made to link to the I</proc/self/fd/NN> file corresponding to a file descriptor created with
nl: Een poging werd gedaan om het I</proc/self/fd/NN> bestand overeenkomende met een bestandsindicator aangemaakt met

source: See B<open>(2).
nl: Zie B<open>(2).

source: An attempt was made to link to a I</proc/self/fd/NN> file corresponding to a file that has been deleted.
nl: Een poging werd gedaan om een koppeling naar een I</proc/self/fd/NN> bestand te maken die overeen kwam met een bestand die werd gewist.

source: I<oldpath> is a relative pathname and I<olddirfd> refers to a directory that has been deleted, or I<newpath> is a relative pathname and I<newdirfd> refers to a directory that has been deleted.
nl: I<oudpad> is een relatieve padnaam en I<oudmapbi> wijst naar een map die gewist werd, of I<nieuwpad> is een relatieve padnaam en I<nieuwmapbi> wijst naar een map die gewist werd.

source: I<oldpath> is relative and I<olddirfd> is a file descriptor referring to a file other than a directory; or similar for I<newpath> and I<newdirfd>
nl: I<oudpad> is relatief en I<oudmapbi> is een bestandsindicator die naar een bestand anders dan een map wijst; of vergelijkbaar voor I<nieuwpad> en I<nieuwmapbi>

source: B<AT_EMPTY_PATH> was specified in I<flags>, I<oldpath> is an empty string, and I<olddirfd> refers to a directory.
nl: B<AT_EMPTY_PATH> werd opgegeven in I<vlaggen>, I<oudpad> is een lege tekenreeks, en I<oudmapbi> wijst naar een map.

source: VERSIONS
nl: VERSIES

source: B<linkat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
nl: B<linkat>() werd toegevoegd aan Linux in kernel 2.6.16; bibliotheek ondersteuning werd toegevoegd aan glibc in versie 2.4.

source: CONFORMING TO
nl: VOLDOET AAN

source: B<link>(): SVr4, 4.3BSD, POSIX.1-2001 (but see NOTES), POSIX.1-2008.
nl: B<link>(): SVr4, 4.3BSD, POSIX.1-2001 (maar zie OPMERKINGEN), POSIX.1-2008.

source: NOTES
nl: OPMERKINGEN

source: Hard links, as created by B<link>(), cannot span filesystems. Use B<symlink>(2) if this is required.
nl: Harde koppelingen, zoals die gemaakt worden door B<link>(), kunnen niet over meerdere bestandsystemen heen reiken. Gebruik B<symlink>() als dat nodig is.

source: POSIX.1-2001 says that B<link>() should dereference I<oldpath> if it is a symbolic link. However, since kernel 2.0, Linux does not do so: if I<oldpath> is a symbolic link, then I<newpath> is created as a (hard) link to the same symbolic link file (i.e., I<newpath> becomes a symbolic link to the same file that I<oldpath> refers to). Some other implementations behave in the same manner as Linux. POSIX.1-2008 changes the specification of B<link>(), making it implementation-dependent whether or not I<oldpath> is dereferenced if it is a symbolic link. For precise control over the treatment of symbolic links when creating a link, use B<linkat>().
nl: POSIX.1-2001 schrijft voor dat B<link>() I<oudpad> moet ontkoppelen als het een symbolische koppeling is. Echter vanaf kernel 2.0 doet dit niet: als I<oudpad> een symbolische koppeling is, dan wordt I<nieuwpad> aangemaakt als een harde koppeling naar hetzelfde symbolische koppeling bestand (m.a.w. I<nieuwpad> wordt een symbolische koppeling naar hetzelfde bestand waar I<oudpad> naar wijst). Sommige andere implementaties gedragen zich op dezelfde manier als Linux. POSIX.1-2008 verandert de specificatie van B<link>() daarbij wordt het implementatie-afhankelijk van het ontkoppeld zijn of niet van I<oudpad> als het een symbolische koppeling is. Om precieze controle over de behandeling van symbolische koppelingen te krijgen bij het aanmaken van koppelingen gebruik B<linkat>().

source: Glibc notes
nl: Glibc-opmerkingen

source: On older kernels where B<linkat>() is unavailable, the glibc wrapper function falls back to the use of B<link>(), unless the B<AT_SYMLINK_FOLLOW> is specified. When I<oldpath> and I<newpath> are relative pathnames, glibc constructs pathnames based on the symbolic links in I</proc/self/fd> that correspond to the I<olddirfd> and I<newdirfd> arguments.
nl: Op oudere kernels waar B<linkat> niet beschikbaar is, valt de glibc omwikkel functie terug op het gebruik van B<link>(), behalve als B<AT_SYMLINK_FOLLOW> werd opgegeven. Als I<oudpad> en I<nieuwpad> relatieve padnamen zijn, dan construeert glibc padnamen gebaseerd op de symbolische koppelingen die overeenkomen met de I<oudpadbi> en I<nieuwmapbi> argumenten.

source: On NFS filesystems, the return code may be wrong in case the NFS server performs the link creation and dies before it can say so. Use B<stat>(2) to find out if the link got created.
nl: Op NFS bestandsystemen kan de teruggeef code fout zijn als de NFS server de koppeling uitvoert maar sterft voordat het dat kan doen. Gebruik B<stat>(2) om uit te vinden of de koppeling gemaakt werd.

source: SEE ALSO
nl: ZIE OOK

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van AT_* constanten */ B<#include E<lt>unistd.hE<gt>>

source: Since glibc 2.10:
nl: Vanaf glibc 2.10:

source: Before glibc 2.10:
nl: Vóór glibc 2.10:

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: I<oldpath> and I<newpath> are not on the same mounted filesystem. (Linux permits a filesystem to be mounted at multiple points, but B<link>() does not work across different mount points, even if the same filesystem is mounted on both.)
nl: I<oudpad> en I<nieuwpad> staan niet op hetzelfde bestandssysteem. (Linux staat toe een bestandssysteem op verschillende punten aan te koppelen, maar B<link>() werkt niet over verschillende aankoppel punten, zelfs als hetzelfde bestandssysteem is aangekoppeld op beide.)

source: I<olddirfd> or I<newdirfd> is not a valid file descriptor.
nl: I<oudmapbi> of I<nieuwmapbi> is geen geldige bestandsindicator.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
