Repository: sebras/manpages-l10n
Catalog: po/*/man2/lseek.2.po
Languages: nl

source: NAME
nl: NAAM

source: lseek - reposition read/write file offset
nl: lseek - herplaats lees/schrijf bestand-positie

source: SYNOPSIS
nl: SAMENVATTING

source: B<off_t lseek(int >I<fd>B<, off_t >I<offset>B<, int >I<whence>B<);>
nl: B<off_t lseek(int >I<bi>B<, off_t >I<positie>B<, int >I<vanaf>B<);>

source: DESCRIPTION
nl: BESCHRIJVING

source: B<lseek>() repositions the file offset of the open file description associated with the file descriptor I<fd> to the argument I<offset> according to the directive I<whence> as follows:
nl: De B<lseek>() functie herplaatst de positie van de bestandindicator I<bi> naar het argument I<positie> volgens de aanwijzing I<vanaf> als volgt:

source: The file offset is set to I<offset> bytes.
nl: De positie wordt naar I<positie> bytes gezet.

source: The file offset is set to its current location plus I<offset> bytes.
nl: De positie wordt naar de huidige plaats plus I<positie> bytes gezet.

source: The file offset is set to the size of the file plus I<offset> bytes.
nl: De positie wordt naar de lengte van het bestand plus I<positie> bytes gezet.

source: B<lseek>() allows the file offset to be set beyond the end of the file (but this does not change the size of the file). If data is later written at this point, subsequent reads of the data in the gap (a "hole") return null bytes (\(aq\e0\(aq) until data is actually written into the gap.
nl: De B<lseek> functie staat toe de bestand plaats te zetten ná het einde van het bestand (dit verandert niet de grootte van het bestand). Als later gegevens op deze positie worden geschreven, geven navolgende lees opdrachten in het gat ge-Nulde (\(aq\e0\(aq) bytes terug (totdat er daadwerkelijk gegevens in het gat worden geschreven).

source: Seeking file data and holes
nl: Zoeken bestand data en gaten

source: Since version 3.1, Linux supports the following additional values for I<whence>:
nl: Vanaf versie 3.1 ondersteund Linux de volgende additionele waarden voor I<vanaf>:

source: Adjust the file offset to the next location in the file greater than or equal to I<offset> containing data. If I<offset> points to data, then the file offset is set to I<offset>.
nl: Pas de bestandsplaats aan de volgende locatie in het bestand groter dan of gelijk aan I<positie> die data bevat. Als I<positie> naar data wijst, zet dan de bestandsplaats op I<positie>.

source: Adjust the file offset to the next hole in the file greater than or equal to I<offset>. If I<offset> points into the middle of a hole, then the file offset is set to I<offset>. If there is no hole past I<offset>, then the file offset is adjusted to the end of the file (i.e., there is an implicit hole at the end of any file).
nl: Pas de bestandsplaats aan naar het volgende gat in het bestand groter dan of gelijk aan I<positie>. Als I<positie> naar het midden van een gat wijst, dan wordt de plaats gezet op I<positie> gezet. Als er geen gat is voorbij I<positie>, dan wordt de plaats gezet op het einde van het bestand (m.a.w. er is een impliciet gat aan het einde van elk bestand).

source: In both of the above cases, B<lseek>() fails if I<offset> points past the end of the file.
nl: In beide bovenstaande gevallen faalt B<lseek>() als I<positie> voorbij het einde van het bestand wijst.

source: These operations allow applications to map holes in a sparsely allocated file. This can be useful for applications such as file backup tools, which can save space when creating backups and preserve holes, if they have a mechanism for discovering holes.
nl: Deze operaties staan applicaties toe om gaten in dun toegekende bestanden in kaart te brengen. Dit kan nuttig zijn voor applicaties zoals backup gereedschap, die ruimte kunnen sparen bij het aanmaken van backups en gaten kunnen bewaren, mits ze een mechanisme hebben om gaten de ontdekken.

source: For the purposes of these operations, a hole is a sequence of zeros that (normally) has not been allocated in the underlying file storage. However, a filesystem is not obliged to report holes, so these operations are not a guaranteed mechanism for mapping the storage space actually allocated to a file. (Furthermore, a sequence of zeros that actually has been written to the underlying storage may not be reported as a hole.) In the simplest implementation, a filesystem can support the operations by making B<SEEK_HOLE> always return the offset of the end of the file, and making B<SEEK_DATA> always return I<offset> (i.e., even if the location referred to by I<offset> is a hole, it can be considered to consist of data that is a sequence of zeros).
nl: Binnen de doelen van deze operaties bedoelen we met een gat een serie van nullen die (normaliter) niet zijn toegekend in de onderliggende bestandsopslag. Het is echter zo dat een bestandssysteem niet verplicht is gaten te rapporteren, daarom zijn deze operaties geen gegarandeerd mechanisme om de aan een bestand toegekende opslag ruimte in kaart te brengen. (Bovendien hoeft een serie van nullen die daadwerkelijk is geschreven naar de onderliggende opslag niet gerapporteerd te worden als een gat.) In de meest eenvoudige implementatie kan een bestandssysteem de operatie ondersteunen door te zorgen dat B<SEEK_HOLE> altijd de afstand naar het einde van het bestand teruggeeft, en te zorgen dat B<SEEK_DATA> altijd I<positie> teruggeeft (m.a.w. zelfs als de locatie aangewezen door I<positie> een gat is, kan het beschouwd worden te bestaan uit data die een serie van nullen is).

source: The B<_GNU_SOURCE> feature test macro must be defined in order to obtain the definitions of B<SEEK_DATA> and B<SEEK_HOLE> from I<E<lt>unistd.hE<gt>>.
nl: De B<_GNU_SOURCE> test macro moet zijn gedefinieerd om de definities te verkrijgen van B<SEEK_DATA> en B<SEEK_HOLE> uit I<E<lt>unistd.hE<gt>>.

source: The B<SEEK_HOLE> and B<SEEK_DATA> operations are supported for the following filesystems:
nl: De B<SEEK_HOLE> en B<SEEK_DATA> operaties worden ondersteund door de volgende bestandssystemen:

source: Btrfs (since Linux 3.1)
nl: Btrfs (sinds Linux 3.1)

source: OCFS (since Linux 3.2)
nl: OCFS (sinds Linux 3.2)

source: XFS (since Linux 3.5)
nl: XFS (sinds Linux 3.5)

source: ext4 (since Linux 3.8)
nl: ext4 (sinds Linux 3.8)

source: B<tmpfs>(5) (since Linux 3.8)
nl: B<tmpfs>(5) (sinds Linux 3.8)

source: NFS (since Linux 3.18)
nl: NFS (sinds Linux 3.18)

source: FUSE (since Linux 4.5)
nl: FUSE (sinds Linux 4.5)

source: GFS2 (since Linux 4.15)
nl: GFS2 (sinds Linux 4.15)

source: RETURN VALUE
nl: EIND WAARDE

source: Upon successful completion, B<lseek>() returns the resulting offset location as measured in bytes from the beginning of the file. On error, the value I<(off_t)\ -1> is returned and I<errno> is set to indicate the error.
nl: Bij geslaagde afronding geeft B<lseek> de opgeleverde plaats zoals gemeten in bytes van het begin van het bestand, terug. Anders wordt een waarde van I<(off_t)\ -1> teruggegeven, en I<errno> wordt gezet om de fout duidelijk te maken.

source: ERRORS
nl: FOUTEN

source: I<fd> is not an open file descriptor.
nl: I<bi> is niet een open bestandindicator..

source: I<whence> is not valid. Or: the resulting file offset would be negative, or beyond the end of a seekable device.
nl: I<Vanaf> is niet geldig. Of: de resulterende bestand plaats zou negatief zijn, of voorbij het einde van een doorzoekbaar apparaat.

source: I<whence> is B<SEEK_DATA> or B<SEEK_HOLE>, and I<offset> is beyond the end of the file, or I<whence> is B<SEEK_DATA> and I<offset> is within a hole at the end of the file.
nl: I<whence> is B<SEEK_DATA> of B<SEEK_HOLE>, en I<positie> is voorbij het einde van het bestand, of I<whence> is B<SEEK_DATA> en I<positie> is in een gat aan het einde van het bestand.

source: The resulting file offset cannot be represented in an I<off_t>.
nl: De resulterende bestand plaats kan niet gerepresenteerd worden in een I<off_t>.

source: I<fd> is associated with a pipe, socket, or FIFO.
nl: I<bi> hoort bij een pijp, een socket, of een FIFO.

source: B<SEEK_DATA> and B<SEEK_HOLE> are nonstandard extensions also present in Solaris, FreeBSD, and DragonFly BSD; they are proposed for inclusion in the next POSIX revision (Issue 8).
nl: B<SEEK_DATA> en B<SEEK_HOLE> zijn niet-standaard uitbreidingen ook aanwezig inSolaris, FreeBSD, en DragonFly BSD; zij zijn voorgesteld voor opname in de volgende POSIX revisie (Issue 8).

source: NOTES
nl: OPMERKINGEN

source: See B<open>(2) for a discussion of the relationship between file descriptors, open file descriptions, and files.
nl: Zie B<open>(2) voor een discussie over de relatie tussen bestandsbeschrijvingen, open bestandsbeschrijvingen en bestanden.

source: If the B<O_APPEND> file status flag is set on the open file description, then a B<write>(2) I<always> moves the file offset to the end of the file, regardless of the use of B<lseek>().
nl: Als de B<O_APPEND> bestand status vlag is gezet op de open bestandsbeschrijving, dan zal B<write>(2) I<altijd> de bestandsafstand naar het einde van het bestand verplaatsen, onafhankelijk van het gebruik van B<lseek>().

source: The I<off_t> data type is a signed integer data type specified by POSIX.1.
nl: Het I<off_t> data type is een positief of negatief geheel getal data type zoals gespecificeerd in POSIX.1.

source: Some devices are incapable of seeking and POSIX does not specify which devices must support B<lseek>().
nl: Sommige apparaten zijn niet in status tot zoeken, en POSIX bepaald nietwelke apparaten het moeten B<lseek>() ondersteunen.

source: On Linux, using B<lseek>() on a terminal device fails with the error B<ESPIPE>.
nl: Op Linux: het gebruik van B<lseek>() zal op een terminal apparaat falen met de foutB<ESPIPE>.

source: SEE ALSO
nl: ZIE OOK

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: B<off_t lseek(int >I<fd>B<, off_t >I<offset>B<, int >I<whence>B<);>
nl: B<off_t lseek(int >I<bi>B<, off_t >I<positie>B<, int >I<vanaf>B<);>

source: CONFORMING TO
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<tmpfs>(5) (since Linux 3.8)
nl: B<tmpfs>(5) (sinds Linux 3.8)

source: I<whence> is B<SEEK_DATA> or B<SEEK_HOLE>, and the file offset is beyond the end of the file.
nl: I<whence> is B<SEEK_DATA> of B<SEEK_HOLE>, en de I<positie> in het bestand staat voorbij het einde van het bestand.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
