Repository: sebras/manpages-l10n
Catalog: po/*/man2/madvise.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: madvise - give advice about use of memory
fr: madvise - Configurer l'utilisation de la mémoire

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: The B<madvise>() system call is used to give advice or directions to the kernel about the address range beginning at address I<addr> and with size I<length> bytes In most cases, the goal of such advice is to improve system or application performance.
fr: L'appel système B<madvise>() est utilisé pour conseiller ou orienter le noyau quant à la plage d'adresses commençant à I<addr> et de taille I<length> octets. Dans la plupart des cas, le but de tels conseils est d'améliorer les performances du système ou d'une application.

source: Initially, the system call supported a set of "conventional" I<advice> values, which are also available on several other implementations. (Note, though, that B<madvise>() is not specified in POSIX.) Subsequently, a number of Linux-specific I<advice> values have been added.
fr: Initialement, l'appel système gérait un ensemble de valeurs de I<advice> « conventionnelles », disponibles aussi sur d'autres implémentations (notez toutefois que B<madvise>() n'est pas spécifié dans POSIX). Par conséquent, un certain nombre de valeurs de I<advice> spécifiques à Linux ont été ajoutées.

source: Conventional advice values
fr: Valeurs de conseil conventionnelles

source: The I<advice> values listed below allow an application to tell the kernel how it expects to use some mapped or shared memory areas, so that the kernel can choose appropriate read-ahead and caching techniques. These I<advice> values do not influence the semantics of the application (except in the case of B<MADV_DONTNEED>), but may influence its performance. All of the I<advice> values listed here have analogs in the POSIX-specified B<posix_madvise>(3) function, and the values have the same meanings, with the exception of B<MADV_DONTNEED>.
fr: Les valeurs de I<advice> (conseil) listées ci-dessous permettent à une application d'indiquer au noyau l'utilisation qu'elle compte faire de certaines zones de mémoire partagée ou projetée de façon à ce que le noyau puisse choisir les techniques de lecture anticipée et de mise en cache appropriées. Ces valeurs I<advice> ne modifient pas la sémantique de l'application (sauf dans le cas de B<MADV_DONTNEED>), mais peuvent avoir un impact sur ses performances. Toutes les valeurs de I<advice> listées ici ont un pendant dans la fonction B<posix_madvise>(3) spécifiée par POSIX et elles ont la même signification, sauf B<MADV_DONTNEED>.

source: The advice is indicated in the I<advice> argument, which is one of the following:
fr: Le conseil est spécifié par le paramètre I<advice> qui peut être un des suivants :

source: No special treatment. This is the default.
fr: Pas de traitement particulier. Il s'agit du comportement par défaut.

source: Expect page references in random order. (Hence, read ahead may be less useful than normally.)
fr: Prévoir des références de page dans un ordre aléatoire. (Ainsi, la lecture anticipée sera moins utile qu'elle ne l'est en général.)

source: Expect page references in sequential order. (Hence, pages in the given range can be aggressively read ahead, and may be freed soon after they are accessed.)
fr: Prévoir des références de page dans un ordre séquentiel. (Aussi, les pages d'une plage donnée peuvent être systématiquement lues par anticipation, et peuvent être libérées rapidement après avoir été accédées.)

source: Expect access in the near future. (Hence, it might be a good idea to read some pages ahead.)
fr: Prévoir un accès dans un futur proche. (Ainsi, lire quelques pages de façon anticipée peut être une bonne idée.)

source: Do not expect access in the near future. (For the time being, the application is finished with the given range, so the kernel can free resources associated with it.)
fr: Ne pas s'attendre à un accès dans un futur proche (quant au temps, l'application est finie avec la plage donnée, pour que le noyau puisse libérer des ressources qui lui sont associées).

source: After a successful B<MADV_DONTNEED> operation, the semantics of memory access in the specified region are changed: subsequent accesses of pages in the range will succeed, but will result in either repopulating the memory contents from the up-to-date contents of the underlying mapped file (for shared file mappings, shared anonymous mappings, and shmem-based techniques such as System V shared memory segments) or zero-fill-on-demand pages for anonymous private mappings.
fr: Après une opération B<MADV_DONTNEED> réussie, la sémantique de l'accès en mémoire dans la région indiquée est modifiée : les accès suivants des pages réussiront, mais provoqueront un nouveau remplissage de la mémoire soit avec le contenu à jour du fichier transposé sous-jacent (pour les tableaux de fichiers partagés, ceux anonymes partagés, les techniques basées sur shmem telles que les segments de mémoire partagée de System V), soit avec les pages remplies de zéro à la demande pour les tableaux privés anonymes.

source: Note that, when applied to shared mappings, B<MADV_DONTNEED> might not lead to immediate freeing of the pages in the range. The kernel is free to delay freeing the pages until an appropriate moment. The resident set size (RSS) of the calling process will be immediately reduced however.
fr: Remarquez qu'appliquée à des tableaux partagés, B<MADV_DONTNEED> pourrait ne pas aboutir à une libération immédiate des pages dans la plage. Le noyau est libre de retarder la libération des pages jusqu'au bon moment. La mémoire résidente (resident set size, ou RSS) du processus appelant sera par contre immédiatement réduite.

source: B<MADV_DONTNEED> cannot be applied to locked pages, Huge TLB pages, or B<VM_PFNMAP> pages. (Pages marked with the kernel-internal B<VM_PFNMAP> flag are special memory areas that are not managed by the virtual memory subsystem. Such pages are typically created by device drivers that map the pages into user space.)
fr: B<MADV_DONTNEED> ne peut pas s'appliquer à des pages verrouillées, d'immenses pages TLB ou à des pages B<VM_PFNMAP> (les pages marquées par l'attribut B<VM_PFNMAP> interne au noyau sont des régions de mémoire spéciales non gérées par le sous-système de mémoire virtuelle. De telles pages sont généralement créées par des pilotes de périphérique transposant les pages dans l'espace utilisateur).

source: Linux-specific advice values
fr: Valeurs de conseil spécifiques à Linux

source: The following Linux-specific I<advice> values have no counterparts in the POSIX-specified B<posix_madvise>(3), and may or may not have counterparts in the B<madvise>() interface available on other implementations. Note that some of these operations change the semantics of memory accesses.
fr: Les valeurs I<advice> suivantes spécifiques à Linux n'ont pas d'équivalent dans le B<posix_madvise>(3) spécifié par POSIX et peuvent en avoir ou pas dans l'interface B<madvise>() disponible sur d'autres implémentations. Notez que certaines de ces opérations modifient la sémantique des accès en mémoire.

source: B<MADV_REMOVE> (since Linux 2.6.16)
fr: B<MADV_REMOVE> (depuis Linux 2.6.16)

source: Free up a given range of pages and its associated backing store. This is equivalent to punching a hole in the corresponding byte range of the backing store (see B<fallocate>(2)). Subsequent accesses in the specified address range will see bytes containing zero.
fr: Libération jusqu'à une plage donnée de pages et son stockage de repli associé. Cela revient à percer un trou dans la plage d'octets correspondante du stockage de secours (voir B<fallocate>(2)). Les accès suivants à la plage d'adresses indiquée verront des octets contenant zéro.

source: The specified address range must be mapped shared and writable. This flag cannot be applied to locked pages, Huge TLB pages, or B<VM_PFNMAP> pages.
fr: Le plage d'adresses indiquée doit être transposée partagée et accessible en écriture. Cet attribut ne peut pas être appliqué à des pages verrouillées, d'immenses pages TLB ou à des pages B<VM_PFNMAP>.

source: In the initial implementation, only B<tmpfs>(5) was supported B<MADV_REMOVE>; but since Linux 3.5, any filesystem which supports the B<fallocate>(2) B<FALLOC_FL_PUNCH_HOLE> mode also supports B<MADV_REMOVE>. Hugetlbfs fails with the error B<EINVAL> and other filesystems fail with the error B<EOPNOTSUPP>.
fr: Dans l'implémentation initiale, seul B<tmpfs>(5) prenait en charge B<MADV_REMOVE> ; mais depuis Linux 3.5, tous les systèmes de fichiers qui prennent en charge le mode B<FALLOC_FL_PUNCH_HOLE> de B<fallocate>(2) gèrent également B<MADV_REMOVE>. Hugetlbfs échoue avec l'erreur B<EINVAL> et d'autres systèmes de fichiers échouent avec l'erreur B<EOPNOTSUPP>.

source: B<MADV_DONTFORK> (since Linux 2.6.16)
fr: B<MADV_DONTFORK> (depuis Linux 2.6.16)

source: Do not make the pages in this range available to the child after a B<fork>(2). This is useful to prevent copy-on-write semantics from changing the physical location of a page if the parent writes to it after a B<fork>(2). (Such page relocations cause problems for hardware that DMAs into the page.)
fr: Ne pas rendre les pages de cette plage disponibles à l'enfant après un B<fork>(2). Cela est utile pour empêcher la sémantique de copie à l'écriture de changer l'emplacement physique d'une page si le parent y écrit après un B<fork>(2) (de tels déplacements posent des problèmes si le matériel accède directement à la page (DMA)).

source: B<MADV_DOFORK> (since Linux 2.6.16)
fr: B<MADV_DOFORK> (depuis Linux 2.6.16)

source: Undo the effect of B<MADV_DONTFORK>, restoring the default behavior, whereby a mapping is inherited across B<fork>(2).
fr: Annuler l'effet de B<MADV_DONTFORK> et restaurer le comportement par défaut, où une projection en mémoire est héritée après un B<fork>(2).

source: B<MADV_HWPOISON> (since Linux 2.6.32)
fr: B<MADV_HWPOISON> (depuis Linux 2.6.32)

source: Poison the pages in the range specified by I<addr> and I<length> and handle subsequent references to those pages like a hardware memory corruption. This operation is available only for privileged (B<CAP_SYS_ADMIN>) processes. This operation may result in the calling process receiving a B<SIGBUS> and the page being unmapped.
fr: Empoisonner les pages dans la plage indiquée par I<addr> et I<length> et traiter les références ultérieures à ces pages comme une corruption de la mémoire matérielle. Cette opération n'est disponible que pour les processus privilégiés (B<CAP_SYS_ADMIN>). À la suite de cette opération, le processus appelant peut recevoir un B<SIGBUS> et la page devenir non affectée.

source: This feature is intended for testing of memory error-handling code; it is available only if the kernel was configured with B<CONFIG_MEMORY_FAILURE>.
fr: Cette fonctionnalité est conçue pour tester du code de gestion des erreurs de mémoire ; elle n'est disponible que si le noyau a été configuré avec B<CONFIG_MEMORY_FAILURE>.

source: B<MADV_MERGEABLE> (since Linux 2.6.32)
fr: B<MADV_MERGEABLE> (depuis Linux 2.6.32)

source: Enable Kernel Samepage Merging (KSM) for the pages in the range specified by I<addr> and I<length>. The kernel regularly scans those areas of user memory that have been marked as mergeable, looking for pages with identical content. These are replaced by a single write-protected page (which is automatically copied if a process later wants to update the content of the page). KSM merges only private anonymous pages (see B<mmap>(2)).
fr: Activer la fusion des pages identiques par le noyau (I<Kernel Samepage Merging>, ou KSM) pour les pages dans la plage spécifiée par I<addr> et I<length>. Le noyau analyse régulièrement les régions de la mémoire utilisateur qui ont été marquées comme pouvant être fusionnées, à la recherche de pages avec un contenu identique. Elles sont remplacées par une page unique protégée en écriture (qui sera automatiquement recopiée si un processus veut plus tard modifier le contenu de la page). KSM ne fusionne que les pages anonymes privées (consultez B<mmap>(2)).

source: The KSM feature is intended for applications that generate many instances of the same data (e.g., virtualization systems such as KVM). It can consume a lot of processing power; use with care. See the Linux kernel source file I<Documentation/admin-guide/mm/ksm.rst> for more details.
fr: La fonctionnalité KSM est prévue pour des applications qui génèrent de nombreuses instances avec les mêmes données (comme les systèmes de virtualisation tels que KVM). Cela consomme beaucoup de puissance de calcul ; utilisez-la prudemment. Voir le fichier I<Documentation/admin-guide/mm/ksm.rst> des sources du noyau Linux pour plus de détails.

source: The B<MADV_MERGEABLE> and B<MADV_UNMERGEABLE> operations are available only if the kernel was configured with B<CONFIG_KSM>.
fr: Les opérations B<MADV_MERGEABLE> et B<MADV_UNMERGEABLE> ne sont disponibles que si le noyau a été configuré avec B<CONFIG_KSM>.

source: B<MADV_UNMERGEABLE> (since Linux 2.6.32)
fr: B<MADV_UNMERGEABLE> (depuis Linux 2.6.32)

source: Undo the effect of an earlier B<MADV_MERGEABLE> operation on the specified address range; KSM unmerges whatever pages it had merged in the address range specified by I<addr> and I<length>.
fr: Annuler l'effet d'une opération B<MADV_MERGEABLE> précédente sur la plage d'adresses spécifiée ; KSM annule la fusion sur les pages qui avaient été fusionnées dans la plage spécifiée par I<addr> et I<length>.

source: B<MADV_SOFT_OFFLINE> (since Linux 2.6.33)
fr: B<MADV_SOFT_OFFLINE> (depuis Linux 2.6.33)

source: Soft offline the pages in the range specified by I<addr> and I<length>. The memory of each page in the specified range is preserved (i.e., when next accessed, the same content will be visible, but in a new physical page frame), and the original page is offlined (i.e., no longer used, and taken out of normal memory management). The effect of the B<MADV_SOFT_OFFLINE> operation is invisible to (i.e., does not change the semantics of) the calling process.
fr: Déconnecter en douceur les pages dans la plage spécifiée par I<addr> et I<length>. La mémoire de chaque page dans la plage spécifiée est préservée (lors du prochain accès, le même contenu sera visible, mais dans une nouvelle page physique), et la page originale est déconnectée (ce qui signifie qu'elle n'est plus utilisée, et plus prise en compte par les mécanismes habituels de gestion de la mémoire). L'effet de l'opération B<MADV_SOFT_OFFLINE> est invisible au processus appelant (c'est-à-dire qu'elle n'en change pas la sémantique).

source: B<MADV_HUGEPAGE> (since Linux 2.6.38)
fr: B<MADV_HUGEPAGE> (depuis Linux 2.6.38)

source: Enable Transparent Huge Pages (THP) for pages in the range specified by I<addr> and I<length>. Currently, Transparent Huge Pages work only with private anonymous pages (see B<mmap>(2)). The kernel will regularly scan the areas marked as huge page candidates to replace them with huge pages. The kernel will also allocate huge pages directly when the region is naturally aligned to the huge page size (see B<posix_memalign>(2)).
fr: Activer la gestion transparente des pages immenses (I<Transparent Huge Pages>, ou THP) pour les pages dans la plage spécifiée par I<addr> et I<length>. Actuellement, THP ne fonctionne qu'avec les pages anonymes privées (consultez B<mmap>(2)). Le noyau analysera régulièrement les régions qui ont été marquées comme candidates aux pages immenses pour les remplacer par des pages immenses. Le noyau allouera aussi des pages immenses directement quand la région est naturellement alignée sur la taille de page immense (consultez B<posix_memalign>(2)).

source: This feature is primarily aimed at applications that use large mappings of data and access large regions of that memory at a time (e.g., virtualization systems such as QEMU). It can very easily waste memory (e.g., a 2\ MB mapping that only ever accesses 1 byte will result in 2\ MB of wired memory instead of one 4\ KB page). See the Linux kernel source file I<Documentation/admin-guide/mm/transhuge.rst> for more details.
fr: Cette fonctionnalité est d'abord destinée aux applications qui utilisent tout à la fois de grands tableaux, beaucoup de données et de grandes régions d'accès à la mémoire (comme les systèmes de virtualisation tels que QEMU). Elle peut facilement consommer beaucoup de mémoire (par exemple un tableau de 2\ Mo qui n'accède qu'à un octet dépensera 2\ Mo de mémoire et non une page de 4\ Ko). Voir le fichier I<Documentation/admin-guide/mm/transhuge.rst> des sources du noyau Linux pour plus de détails.

source: Most common kernels configurations provide B<MADV_HUGEPAGE>-style behavior by default, and thus B<MADV_HUGEPAGE> is normally not necessary. It is mostly intended for embedded systems, where B<MADV_HUGEPAGE>-style behavior may not be enabled by default in the kernel. On such systems, this flag can be used in order to selectively enable THP. Whenever B<MADV_HUGEPAGE> is used, it should always be in regions of memory with an access pattern that the developer knows in advance won't risk to increase the memory footprint of the application when transparent hugepages are enabled.
fr: La plupart des configurations de noyaux classiques fournissent un comportement à la manière de B<MADV_HUGEPAGE> par défaut, et ainsi B<MADV_HUGEPAGE> n'est normalement pas nécessaire. Il est le plus souvent utile pour les systèmes embarqués où un comportement de type B<MADV_HUGEPAGE> peut ne pas être activé par défaut dans le noyau. Sur de tels systèmes, cet attribut peut être utilisé pour activer THP de manière sélective. À chaque fois que B<MADV_HUGEPAGE> est utilisé, il devrait toujours l'être dans des régions de la mémoire où le développeur sait à l'avance que le motif d'accès ne risquera pas d'augmenter l'empreinte de l'application quand les pages immenses transparentes sont actives.

source: The B<MADV_HUGEPAGE> and B<MADV_NOHUGEPAGE> operations are available only if the kernel was configured with B<CONFIG_TRANSPARENT_HUGEPAGE>.
fr: Les opérations B<MADV_HUGEPAGE> et B<MADV_NOHUGEPAGE> ne sont disponibles que si le noyau a été configuré avec B<CONFIG_TRANSPARENT_HUGEPAGE>.

source: B<MADV_NOHUGEPAGE> (since Linux 2.6.38)
fr: B<MADV_NOHUGEPAGE> (depuis Linux 2.6.38)

source: Ensures that memory in the address range specified by I<addr> and I<length> will not be backed by transparent hugepages.
fr: S'assurer que la mémoire dans la plage spécifiée par I<addr> et I<length> ne sera pas gérée dans des pages immenses transparentes.

source: B<MADV_DONTDUMP> (since Linux 3.4)
fr: B<MADV_DONTDUMP> (depuis Linux 3.4)

source: Exclude from a core dump those pages in the range specified by I<addr> and I<length>. This is useful in applications that have large areas of memory that are known not to be useful in a core dump. The effect of B<MADV_DONTDUMP> takes precedence over the bit mask that is set via the I</proc/[pid]/coredump_filter> file (see B<core>(5)).
fr: Exclure de l'image mémoire (« core dump ») les pages dans la plage indiquée par I<addr> et I<length>. C'est utile pour les applications dont de larges zones de mémoire sont notoirement inutiles dans une image mémoire. L'effet de B<MADV_DONTDUMP> est prioritaire sur le masque de bits configuré à l’aide de I</proc/PID/coredump_filter>, consultez B<core>(5).

source: B<MADV_DODUMP> (since Linux 3.4)
fr: B<MADV_DODUMP> (depuis Linux 3.4)

source: Undo the effect of an earlier B<MADV_DONTDUMP>.
fr: Annuler l'effet d’un B<MADV_DONTDUMP> antérieur.

source: B<MADV_FREE> (since Linux 4.5)
fr: B<MADV_FREE> (depuis Linux 4.5)

source: The application no longer requires the pages in the range specified by I<addr> and I<len>. The kernel can thus free these pages, but the freeing could be delayed until memory pressure occurs. For each of the pages that has been marked to be freed but has not yet been freed, the free operation will be canceled if the caller writes into the page. After a successful B<MADV_FREE> operation, any stale data (i.e., dirty, unwritten pages) will be lost when the kernel frees the pages. However, subsequent writes to pages in the range will succeed and then kernel cannot free those dirtied pages, so that the caller can always see just written data. If there is no subsequent write, the kernel can free the pages at any time. Once pages in the range have been freed, the caller will see zero-fill-on-demand pages upon subsequent page references.
fr: L'application n'a plus besoin des pages dans la plage indiquée par I<addr> et I<length>. Le noyau peut ainsi libérer ces pages mais cela pourrait être différé jusqu'à une pression de la mémoire. Pour chacune des pages marquées comme libérables mais non encore libérées, l'opération sera annulée si l'appelant écrit dans la page. Après une opération B<MADV_FREE> réussie, toutes les données périmées (c'est-à-dire les pages sales ou non écrites) seront perdues quand le noyau libèrera les pages. Cependant, les écritures suivantes dans les pages de la plage auront lieu et le noyau ne pourra pas libérer ces pages salies, de sorte que l'appelant pourra toujours voir les données qui viennent d'être écrites. S'il n'y a pas d'écriture ultérieure, le noyau peut libérer les pages n'importe quand. Une fois que les pages de la plage ont été libérées, l'appelant verra des pages remplies de zéro à la demande à chaque référence ultérieure aux pages.

source: The B<MADV_FREE> operation can be applied only to private anonymous pages (see B<mmap>(2)). In Linux before version 4.12, when freeing pages on a swapless system, the pages in the given range are freed instantly, regardless of memory pressure.
fr: L'opération B<MADV_FREE> ne peut s'appliquer qu'à des pages anonymes privées (voir B<mmap>(2)). Avant Linux 4.12, avant de libérer des pages sur un système sans espace d'échange, les pages dans la plage donnée étaient libérées instantanément indépendamment de la pression sur la mémoire.

source: B<MADV_WIPEONFORK> (since Linux 4.14)
fr: B<MADV_WIPEONFORK> (depuis Linux 4.14

source: Present the child process with zero-filled memory in this range after a B<fork>(2). This is useful in forking servers in order to ensure that sensitive per-process data (for example, PRNG seeds, cryptographic secrets, and so on) is not handed to child processes.
fr: Afficher le processus enfant avec une mémoire pleine de zéros dans cette plage après un B<fork>(2). Cela est utile quand on réplique (fork) un serveur pour s'assurer que les données sensibles au processus (par exemple les sièges PRNG, les codes de chiffrement et ainsi de suite) ne soient pas capturées par les processus enfants.

source: The B<MADV_WIPEONFORK> operation can be applied only to private anonymous pages (see B<mmap>(2)).
fr: L'opération B<MADV_WIPEONFORK> ne peut s'appliquer qu'aux pages anonymes privées (voir B<mmap>(2)).

source: Within the child created by B<fork>(2), the B<MADV_WIPEONFORK> setting remains in place on the specified address range. This setting is cleared during B<execve>(2).
fr: Dans l'enfant créé par B<fork>(2), le paramètre B<MADV_WIPEONFORK> reste en place à la plage d'adresses indiquée. Ce paramètre est vidé lors d'un B<execve>(2).

source: B<MADV_KEEPONFORK> (since Linux 4.14)
fr: B<MADV_KEEPONFORK> (depuis Linux 4.14)

source: Undo the effect of an earlier B<MADV_WIPEONFORK>.
fr: Annuler l'effet d’un B<MADV_WIPEONFORK> antérieur.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: ERRORS
fr: ERREURS
