Repository: sebras/manpages-l10n
Catalog: po/*/man2/madvise.2.po
Languages: fr

source: I<advice> is B<MADV_REMOVE>, but the specified address range is not a shared writable mapping.
fr: I<advice> est B<MADV_REMOVE>, mais la plage d'adresses indiquée n'est pas un tableau partagé où on peut écrire.

source: A kernel resource was temporarily unavailable.
fr: Une ressource du noyau est temporairement indisponible.

source: The map exists, but the area maps something that isn't a file.
fr: La projection existe, mais la zone n'est pas associée à un fichier.

source: I<addr> is not page-aligned or I<length> is negative.
fr: I<addr> n'est pas aligné sur une page ou I<length> est négatif.

source: I<advice> is not a valid.
fr: I<advice> n'est pas valable.

source: I<advice> is B<MADV_DONTNEED> or B<MADV_REMOVE> and the specified address range includes locked, Huge TLB pages, or B<VM_PFNMAP> pages.
fr: I<advice> vaut B<MADV_DONTNEED> ou B<MADV_REMOVE> et la plage d'adresses indiquée inclut des pages verrouillées, immenses TLB ou B<VM_PFNMAP>.

source: I<advice> is B<MADV_MERGEABLE> or B<MADV_UNMERGEABLE>, but the kernel was not configured with B<CONFIG_KSM>.
fr: I<advice> vaut B<MADV_MERGEABLE> ou B<MADV_UNMERGEABLE>, mais le noyau n'a pas été configuré avec l'option B<CONFIG_KSM>.

source: I<advice> is B<MADV_FREE> or B<MADV_WIPEONFORK> but the specified address range includes file, Huge TLB, B<MAP_SHARED>, or B<VM_PFNMAP> ranges.
fr: I<advice> vaut B<MADV_FREE> ou B<MADV_WIPEONFORK> mais la plage d'adresses indiquée inclut un fichier, des TLB immenses, B<MAP_SHARED> ou des plages B<VM_PFNMAP>.

source: (for B<MADV_WILLNEED>) Paging in this area would exceed the process's maximum resident set size.
fr: (pour B<MADV_WILLNEED>) Suivre la consigne de pagination sur cette zone dépasserait la limite maximale de mémoire physique utilisable par le processus.

source: (for B<MADV_WILLNEED>) Not enough memory: paging in failed.
fr: (pour B<MADV_WILLNEED>) Mémoire insuffisante\ ; échec de pagination.

source: Addresses in the specified range are not currently mapped, or are outside the address space of the process.
fr: Les adresses de la plage spécifiée ne sont pas projetées actuellement, ou n'appartiennent pas à l'espace d'adressage du processus.

source: I<advice> is B<MADV_HWPOISON>, but the caller does not have the B<CAP_SYS_ADMIN> capability.
fr: I<advice> vaut B<MADV_HWPOISON>, mais l'appelant n'a pas la capacité B<CAP_SYS_ADMIN>.

source: Since Linux 3.18, support for this system call is optional, depending on the setting of the B<CONFIG_ADVISE_SYSCALLS> configuration option.
fr: Depuis Linux 3.18, la gestion de cet appel système est optionnelle, à partir de l'option de configuration B<CONFIG_ADVISE_SYSCALLS>.

source: CONFORMING TO
fr: CONFORMITÉ

source: B<madvise>() is not specified by any standards. Versions of this system call, implementing a wide variety of I<advice> values, exist on many other implementations. Other implementations typically implement at least the flags listed above under I<Conventional advice flags>, albeit with some variation in semantics.
fr: B<madvise>() n'est spécifié dans aucun standard. Des versions de cet appel système, qui implémentent une grande variété de valeurs I<advice>, existent sur de nombreuses autres implémentations. D'autres implémentent au moins les attributs ci-dessus sous I<Conventional advice flags> (attributs de conseil conventionnels), avec d'autres variantes de sémantique.

source: POSIX.1-2001 describes B<posix_madvise>(3) with constants B<POSIX_MADV_NORMAL>, B<POSIX_MADV_RANDOM>, B<POSIX_MADV_SEQUENTIAL>, B<POSIX_MADV_WILLNEED>, and B<POSIX_MADV_DONTNEED>, and so on, with behavior close to the similarly named flags listed above.
fr: POSIX.1-2001 spécifie B<posix_madvise>(3) avec des constantes B<POSIX_MADV_NORMAL>, B<POSIX_MADV_RANDOM>, B<POSIX_MADV_SEQUENTIAL>, B<POSIX_MADV_WILLNEED>, B<POSIX_MADV_DONTNEED> et ainsi de suite, avec un comportement proche des attributs nommés de la même manière que ceux listés ci-dessus.

source: Linux notes
fr: Notes pour Linux

source: The Linux implementation requires that the address I<addr> be page-aligned, and allows I<length> to be zero. If there are some parts of the specified address range that are not mapped, the Linux version of B<madvise>() ignores them and applies the call to the rest (but returns B<ENOMEM> from the system call, as it should).
fr: L'implémentation Linux nécessite que l'adresse I<addr> soit alignée sur une page, et permet que I<length> vaille zéro. S'il y a des parties de la plage d'adresses spécifiée qui ne sont pas projetées, la version Linux de B<madvise>() les ignore et applique l'appel au reste de la plage (mais renvoie B<ENOMEM> comme il se doit).

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Since glibc 2.19:
fr: Depuis la glibc 2.19 :

source: Up to and including glibc 2.19:
fr: Jusqu'à la version 2.19 incluse de la glibc :

source: On success, B<madvise>() returns zero. On error, it returns -1 and I<errno> is set appropriately.
fr: En cas de succès B<madvise>() renvoie zéro. En cas d'erreur, il renvoie B<-1> et I<errno> est positionné de façon adéquate.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: Ensures that memory in the address range specified by I<addr> and I<length> will not be collapsed into huge pages.
fr: S'assurer que la mémoire dans la plage spécifiée par I<addr> et I<length> ne sera pas dissimulée dans des pages immenses.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
