Repository: sebras/manpages-l10n
Catalog: po/*/man2/mbind.2.po
Languages: fr

source: NAME
fr: NOM

source: mbind - set memory policy for a memory range
fr: mbind - Définir la politique mémoire pour une zone de mémoire

source: B<mbind>() sets the NUMA memory policy, which consists of a policy mode and zero or more nodes, for the memory range starting with I<addr> and continuing for I<len> bytes. The memory policy defines from which node memory is allocated.
fr: B<mbind>() configure la politique mémoire NUMA, qui consiste en un mode de politique et zéro ou plusieurs nœuds, pour l'intervalle mémoire démarrant à I<addr> et s'étalant sur I<len> octets. La politique mémoire définit à partir de quel nœud la mémoire sera allouée.

source: If the memory range specified by the I<addr> and I<len> arguments includes an "anonymous" region of memory\(emthat is a region of memory created using the B<mmap>(2) system call with the B<MAP_ANONYMOUS>\(emor a memory-mapped file, mapped using the B<mmap>(2) system call with the B<MAP_PRIVATE> flag, pages will be allocated only according to the specified policy when the application writes (stores) to the page. For anonymous regions, an initial read access will use a shared page in the kernel containing all zeros. For a file mapped with B<MAP_PRIVATE>, an initial read access will allocate pages according to the memory policy of the thread that causes the page to be allocated. This may not be the thread that called B<mbind>().
fr: Si la plage mémoire spécifiée par les paramètres I<addr> et I<len> inclut une région « anonyme » de mémoire (c'est-à-dire une région de mémoire créée avec l'appel système B<mmap>(2) et l'attribut B<MAP_ANONYMOUS>) ou un fichier de mémoire projetée, projection créée en utilisant l'appel système B<mmap>(2) et l'attribut B<MAP_PRIVATE>, les pages seront seulement allouées conformément à la politique spécifiée lorsque l'application écrit (enregistre) dans la page. Pour les régions anonymes, un accès initial en lecture utilisera une page partagée du noyau contenant des zéros. Pour un fichier projeté avec B<MAP_PRIVATE>, un accès initial en lecture allouera des pages conformément à la politique du thread qui a fait que cette page a été allouée. Cela peut ne pas être le thread qui a appelé B<mbind>().

source: The specified policy will be ignored for any B<MAP_SHARED> mappings in the specified memory range. Rather the pages will be allocated according to the memory policy of the thread that caused the page to be allocated. Again, this may not be the thread that called B<mbind>().
fr: La politique spécifiée sera ignorée pour toute projection B<MAP_SHARED> dans la plage mémoire spécifiée. Les pages seront plutôt allouées conformément à la politique de mémoire du thread qui a fait que la page a été allouée. Cela peut ne pas être le thread qui a appelé B<mbind>().

source: If the specified memory range includes a shared memory region created using the B<shmget>(2) system call and attached using the B<shmat>(2) system call, pages allocated for the anonymous or shared memory region will be allocated according to the policy specified, regardless of which process attached to the shared memory segment causes the allocation. If, however, the shared memory region was created with the B<SHM_HUGETLB> flag, the huge pages will be allocated according to the policy specified only if the page allocation is caused by the process that calls B<mbind>() for that region.
fr: Si la plage de mémoire spécifiée inclut une région de mémoire partagée créée avec l'appel système B<shmget>(2) et attachée avec l'appel système B<shmat>(2), les pages allouées pour la région de mémoire anonyme ou partagée seront allouées conformément à la politique spécifiée, sans se soucier du processus attaché au segment de mémoire partagé qui a provoqué l'allocation. Si toutefois la région de mémoire partagée a été créée avec l'attribut B<SHM_HUGETLB>, les grosses pages seront allouées conformément à la politique spécifiée seulement si l'allocation de pages est provoquée par le processus qui a appelé B<mbind>() pour cette région.

source: By default, B<mbind>() has an effect only for new allocations; if the pages inside the range have been already touched before setting the policy, then the policy has no effect. This default behavior may be overridden by the B<MPOL_MF_MOVE> and B<MPOL_MF_MOVE_ALL> flags described below.
fr: Par défaut, B<mbind>() n'a d'effet que sur les nouvelles allocations ; s'il y a déjà eu un accès aux pages dans la plage avant de configurer la politique, alors la politique n'a pas d'effet. Ce comportement par défaut peut être écrasé par les attributs B<MPOL_MF_MOVE> et B<MPOL_MF_MOVE_ALL> décrits plus loin.

source: The I<mode> argument must specify one of B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED>, or B<MPOL_LOCAL> (which are described in detail below). All policy modes except B<MPOL_DEFAULT> require the caller to specify the node or nodes to which the mode applies, via the I<nodemask> argument.
fr: Le paramètre I<mode> doit spécifier l'un des attributs parmi B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED> ou B<MPOL_LOCAL> (qui sont décrits en détails ci-dessous). Tous les modes de politique excepté B<MPOL_DEFAULT> nécessitent que l'appelant spécifie, dans le paramètre I<nodemask>, le ou les nœuds auxquels s'appliquent le mode.

source: The I<mode> argument may also include an optional I<mode flag>. The supported I<mode flags> are:
fr: L'argument I<mode> peut aussi contenir des attributs optionnels. Les valeurs possibles sont :

source: B<MPOL_F_STATIC_NODES> (since Linux-2.6.26)
fr: B<MPOL_F_STATIC_NODES> (depuis Linux 2.6.26)

source: A nonempty I<nodemask> specifies physical node IDs. Linux does not remap the I<nodemask> when the thread moves to a different cpuset context, nor when the set of nodes allowed by the thread's current cpuset context changes.
fr: Un paramètre I<nodemask> non vide indique des identifiants de nœuds physiques. Linux ne réassocie pas I<nodemask> quand le thread change de contexte de cpuset ou après une modification de l'ensemble de nœuds autorisés par le contexte de cpuset en cours du thread.

source: B<MPOL_F_RELATIVE_NODES> (since Linux-2.6.26)
fr: B<MPOL_F_RELATIVE_NODES> (depuis Linux 2.6.26)

source: A nonempty I<nodemask> specifies node IDs that are relative to the set of node IDs allowed by the thread's current cpuset.
fr: Un paramètre I<nodemask> non vide indique des identifiants de nœuds relatifs à l'ensemble des identifiants de nœuds autorisés par le cpuset en cours du thread.

source: I<nodemask> points to a bit mask of nodes containing up to I<maxnode> bits. The bit mask size is rounded to the next multiple of I<sizeof(unsigned long)>, but the kernel will use bits only up to I<maxnode>. A NULL value of I<nodemask> or a I<maxnode> value of zero specifies the empty set of nodes. If the value of I<maxnode> is zero, the I<nodemask> argument is ignored. Where a I<nodemask> is required, it must contain at least one node that is on-line, allowed by the thread's current cpuset context (unless the B<MPOL_F_STATIC_NODES> mode flag is specified), and contains memory.
fr: I<nodemask> pointe sur un masque de bits qui contient jusqu'à I<maxnode> bits. La taille du masque de bits est arrondie au multiple supérieur de I<sizeof(unsigned long)>, mais le noyau n'utilisera que jusqu'à I<maxnode> bits. Une valeur NULL pour I<nodemask> ou une valeur I<maxnode> de zéro indique un ensemble vide de nœuds. Si la valeur de I<maxnode> est zéro, l'argument I<nodemask> est ignoré. Quand un I<nodemask> est exigé, il doit contenir au moins un nœud de connecté, autorisé dans le contexte de cpuset en cours du thread appelant (à moins que le drapeau B<MPOL_F_STATIC_NODES> ne soit fourni) et doit contenir de la mémoire.

source: The I<mode> argument must include one of the following values:
fr: Le paramètre I<mode> doit contenir une des valeurs suivantes :

source: This mode requests that any nondefault policy be removed, restoring default behavior. When applied to a range of memory via B<mbind>(), this means to use the thread memory policy, which may have been set with B<set_mempolicy>(2). If the mode of the thread memory policy is also B<MPOL_DEFAULT>, the system-wide default policy will be used. The system-wide default policy allocates pages on the node of the CPU that triggers the allocation. For B<MPOL_DEFAULT>, the I<nodemask> and I<maxnode> arguments must be specify the empty set of nodes.
fr: Ce mode demande à ce que toute politique n'étant pas une politique par défaut soit retirée, ce qui restaure le comportement par défaut. Lorsqu'il est appliqué à une plage mémoire à l’aide de B<mbind>(), cela signifie d'utiliser la politique mémoire du thread qui peut être définie avec B<set_mempolicy>(2). Si le mode de la politique de mémoire du thread est également B<MPOL_DEFAULT>, la politique par défaut du système sera utilisée. La politique par défaut du système alloue des pages sur le nœud du processeur qui a déclenché l'allocation. Pour B<MPOL_DEFAULT>, les paramètres I<nodemask> et I<maxnode> doivent spécifier l'ensemble vide de nœuds.

source: This mode specifies a strict policy that restricts memory allocation to the nodes specified in I<nodemask>. If I<nodemask> specifies more than one node, page allocations will come from the node with sufficient free memory that is closest to the node where the allocation takes place. Pages will not be allocated from any node not specified in the IR nodemask . (Before Linux 2.6.26, page allocations came from the node with the lowest numeric node ID first, until that node contained no free memory. Allocations then came from the node with the next highest node ID specified in I<nodemask> and so forth, until none of the specified nodes contained free memory.)
fr: Ce mode spécifie une politique stricte qui restreint l'allocation mémoire aux nœuds indiqués dans I<nodemask>. Si I<nodemask> indique plus d'un nœud, les allocations de pages se feront à partir du nœud ayant assez d'espace libre et étant le plus proche de celui où elles ont lieu. Il n'y aura pas d'allocation de pages à partir de nœuds non indiqués dans I<nodemask> (avant Linux 2.6.26, les allocations de pages se faisaient d'abord à partir du nœud dont l'identifiant numérique était le plus petit jusqu'à ce que ce nœud ne contienne plus de mémoire libre. Les allocations se faisaient ensuite à partir du nœud dont l'identifiant était le prochain plus grand spécifié dans I<nodemask> et ainsi de suite jusqu'à ce que plus un seul nœud indiqué ne contienne de mémoire libre).

source: This mode specifies that page allocations be interleaved across the set of nodes specified in I<nodemask>. This optimizes for bandwidth instead of latency by spreading out pages and memory accesses to those pages across multiple nodes. To be effective the memory area should be fairly large, at least 1\ MB or bigger with a fairly uniform access pattern. Accesses to a single page of the area will still be limited to the memory bandwidth of a single node.
fr: Ce mode spécifie que les allocations de pages sont entrelacées à travers l'ensemble de nœuds spécifiés dans I<nodemask>. Cela optimise la bande passante au lieu de la latence en étalant les pages et l'accès mémoire à ces pages à travers plusieurs nœuds. Pour être efficace, la zone mémoire doit être relativement grande, au moins 1 Mo ou plus avec un modèle d'accès assez uniforme. Les accès à une unique page de la zone seront toujours limités à la capacité mémoire d'un seul nœud.

source: This mode sets the preferred node for allocation. The kernel will try to allocate pages from this node first and fall back to other nodes if the preferred nodes is low on free memory. If I<nodemask> specifies more than one node ID, the first node in the mask will be selected as the preferred node. If the I<nodemask> and I<maxnode> arguments specify the empty set, then the memory is allocated on the node of the CPU that triggered the allocation.
fr: Ce mode définit le nœud préféré pour les allocations. Le noyau essaiera d'abord d'allouer sur ce nœud, avant de ce rabattre sur d'autres nœuds si celui-ci n'a plus assez de mémoire libre. Si I<nodemask> précise plus d'un identifiant de nœud, le premier nœud du masque sera choisi comme le nœud préféré. Si les paramètres I<nodemask> et I<maxnode> indiquent un ensemble vide, la mémoire est allouée sur le nœud du processeur qui a déclenché l'allocation.

source: B<MPOL_LOCAL> (since Linux 3.8)
fr: B<MPOL_LOCAL> (depuis Linux 3.8)

source: This mode specifies "local allocation"; the memory is allocated on the node of the CPU that triggered the allocation (the "local node"). The I<nodemask> and I<maxnode> arguments must specify the empty set. If the "local node" is low on free memory, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever memory for this node is available. If the "local node" is not allowed by the thread's current cpuset context, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever it becomes allowed by the thread's current cpuset context. By contrast, B<MPOL_DEFAULT> reverts to the memory policy of the thread (which may be set via B<set_mempolicy>(2)); that policy may be something other than "local allocation".
fr: Ce mode indique « allocation locale » ; la mémoire est allouée sur le nœud du processeur qui a déclenché l'allocation (le « nœud local »). Les paramètres I<nodemask> et I<maxnode> doivent indiquer un ensemble vide. Si le « nœud local » possède peu de mémoire libre, le noyau essaiera d'allouer de la mémoire à partir d'autres nœuds. Le noyau allouera de la mémoire du « nœud local » à chaque fois qu'il y en aura de disponible. Si le « nœud local » n'est pas autorisé par le contexte de cpuset actuel du thread, le noyau essaiera d'allouer de la mémoire à partir d'autres nœuds. Le noyau allouera de la mémoire à partir du « nœud local » à chaque fois qu'il y sera autorisé par le contexte de cpuset actuel du thread. Au contraire, B<MPOL_DEFAULT> ramène à la politique mémoire du thread (qui peut être définie par B<set_mempolicy>(2)) ; il peut s'agir d'une autre politique que l'« allocation locale ».

source: If B<MPOL_MF_STRICT> is passed in I<flags> and I<mode> is not B<MPOL_DEFAULT>, then the call fails with the error B<EIO> if the existing pages in the memory range don't follow the policy.
fr: Si l'option B<MPOL_MF_STRICT> est passée dans I<flags> et si I<mode> n'est pas B<MPOL_DEFAULT>, l'appel échoue avec l'erreur B<EIO> si les pages de la plage mémoire ne suivent pas la politique.

source: If B<MPOL_MF_MOVE> is specified in I<flags>, then the kernel will attempt to move all the existing pages in the memory range so that they follow the policy. Pages that are shared with other processes will not be moved. If B<MPOL_MF_STRICT> is also specified, then the call fails with the error B<EIO> if some pages could not be moved.
fr: Si B<MPOL_MF_MOVE> est passé dans I<flags>, le noyau essaiera de déplacer toutes les pages existantes dans la plage de mémoire pour qu'elles suivent la politique. Les pages partagées avec d'autres processus ne sont pas déplacées. Si B<MPOL_MF_STRICT> est également indiqué, l'appel échouera avec l'erreur B<EIO> si certaines pages ne peuvent pas être déplacées.

source: If B<MPOL_MF_MOVE_ALL> is passed in I<flags>, then the kernel will attempt to move all existing pages in the memory range regardless of whether other processes use the pages. The calling thread must be privileged (B<CAP_SYS_NICE>) to use this flag. If B<MPOL_MF_STRICT> is also specified, then the call fails with the error B<EIO> if some pages could not be moved.
fr: Si B<MPOL_MF_MOVE_ALL> est indiqué dans I<flags>, alors le noyau essaiera de déplacer toutes les pages existantes dans la plage mémoire, même si d'autres processus les utilisent. Le thread appelant doit être privilégié (avoir la capacité B<CAP_SYS_NICE>) pour utiliser cette option. Si B<MPOL_MF_STRICT> est également utilisé, l'appel renverra l'erreur B<EIO> si certaines pages ne peuvent pas être déplacées.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<mbind>() returns 0; on error, -1 is returned and I<errno> is set to indicate the error.
fr: S'il réussit, B<mbind>() renvoie B<0>. En cas d'erreur, il renvoie B<-1> et remplit I<errno> avec la valeur d'erreur.

source: ERRORS
fr: ERREURS

source: Part or all of the memory range specified by I<nodemask> and I<maxnode> points outside your accessible address space. Or, there was an unmapped hole in the specified memory range specified by I<addr> and I<len>.
fr: Une partie ou toute la plage mémoire spécifiée par I<nodemask> et I<maxnode> pointe en dehors de votre espace d'adressage accessible. Ou il y a eu un trou non projeté dans la plage de mémoire spécifiée avec I<addr> et I<len>.

source: An invalid value was specified for I<flags> or I<mode>; or I<addr + len> was less than I<addr>; or I<addr> is not a multiple of the system page size. Or, I<mode> is B<MPOL_DEFAULT> and I<nodemask> specified a nonempty set; or I<mode> is B<MPOL_BIND> or B<MPOL_INTERLEAVE> and I<nodemask> is empty. Or, I<maxnode> exceeds a kernel-imposed limit. Or, I<nodemask> specifies one or more node IDs that are greater than the maximum supported node ID. Or, none of the node IDs specified by I<nodemask> are on-line and allowed by the thread's current cpuset context, or none of the specified nodes contain memory. Or, the I<mode> argument specified both B<MPOL_F_STATIC_NODES> and B<MPOL_F_RELATIVE_NODES>.
fr: Une valeur non valable a été spécifiée pour I<flags> ou I<mode> ; ou I<addr + len> est plus petite que I<addr> ; ou I<addr> n'est pas un multiple de la taille de page système. Ou, I<mode> est B<MPOL_DEFAULT> et I<nodemask> spécifiait un ensemble non vide ; ou I<mode> est B<MPOL_BIND> ou B<MPOL_INTERLEAVE> et I<nodemask> est vide. Ou, I<maxnode> dépasse une limite imposée par le noyau. Ou, I<nodemask> spécifie un ou plusieurs identifiants de nœud qui sont plus grands que l'identifiant maximal de nœud pris en charge. Ou aucun des identifiants de nœuds spécifiés par I<nodemask> ne sont disponibles et autorisés dans le contexte de cpuset du thread en cours, ou aucun des nœuds spécifiés ne contient de mémoire. Ou le paramètre I<mode> indiquait à la fois B<MPOL_F_STATIC_NODES> et B<MPOL_F_RELATIVE_NODES>.

source: B<MPOL_MF_STRICT> was specified and an existing page was already on a node that does not follow the policy; or B<MPOL_MF_MOVE> or B<MPOL_MF_MOVE_ALL> was specified and the kernel was unable to move all existing pages in the range.
fr: B<MPOL_MF_STRICT> a été utilisé et une page existante était déjà sur un nœud ne suivant pas la politique ; ou soit B<MPOL_MF_MOVE> soit B<MPOL_MF_MOVE_ALL> a été spécifié et le noyau n'a pas été capable de déplacer toutes les pages existantes dans la plage.

source: Insufficient kernel memory was available.
fr: La mémoire disponible du noyau n'était pas suffisante.

source: The I<flags> argument included the B<MPOL_MF_MOVE_ALL> flag and the caller does not have the B<CAP_SYS_NICE> privilege.
fr: Le paramètre I<flags> incluait l'attribut B<MPOL_MF_MOVE_ALL> et l'appelant n'avait pas le privilège B<CAP_SYS_NICE>.

source: The B<mbind>() system call was added to the Linux kernel in version 2.6.7.
fr: L'appel système B<mbind>() a été ajouté au noyau Linux dans la version 2.6.7.

source: This system call is Linux-specific.
fr: Cet appel système est spécifique à Linux.

source: For information on library support, see B<numa>(7).
fr: Pour des informations sur la prise en charge des bibliothèques, consultez B<numa>(7).

source: NUMA policy is not supported on a memory-mapped file range that was mapped with the B<MAP_SHARED> flag.
fr: La politique NUMA n'est pas gérée sur les plages de fichiers projetés en mémoire qui ont été projetées avec l'attribut B<MAP_SHARED>.

source: The B<MPOL_DEFAULT> mode can have different effects for B<mbind>() and B<set_mempolicy>(2). When B<MPOL_DEFAULT> is specified for B<set_mempolicy>(2), the thread's memory policy reverts to the system default policy or local allocation. When B<MPOL_DEFAULT> is specified for a range of memory using B<mbind>(), any pages subsequently allocated for that range will use the thread's memory policy, as set by B<set_mempolicy>(2). This effectively removes the explicit policy from the specified range, "falling back" to a possibly nondefault policy. To select explicit "local allocation" for a memory range, specify a I<mode> of B<MPOL_LOCAL> or B<MPOL_PREFERRED> with an empty set of nodes. This method will work for B<set_mempolicy>(2), as well.
fr: Le mode B<MPOL_DEFAULT> peut avoir des effets différents sur B<mbind>() et sur B<set_mempolicy>(2). Lorsque B<MPOL_DEFAULT> est spécifié pour B<set_mempolicy>(2), la politique mémoire du thread est remise à la politique par défaut du système ou l'allocation locale. Lorsque B<MPOL_DEFAULT> est spécifié pour une plage de mémoire utilisant B<mbind>(), toutes les pages allouées par la suite pour cette plage utiliseront la politique du thread telle qu'elle a été définie par B<set_mempolicy>(2). Cela supprime de manière effective la politique explicite de la plage spécifiée, ce qui peut éventuellement remettre une politique autre que celle par défaut. Pour choisir explicitement une « allocation locale » pour une plage mémoire, spécifiez I<mode> de B<MPOL_LOCAL> ou B<MPOL_PREFERRED> avec un ensemble vide de nœuds. Cette méthode fonctionnera aussi avec B<set_mempolicy>(2).

source: Support for huge page policy was added with 2.6.16. For interleave policy to be effective on huge page mappings the policied memory needs to be tens of megabytes or larger.
fr: La gestion de politique pour les pages immenses a été ajoutée dans le noyau 2.6.16. Pour que la politique d'entrelacement soit efficace sur les projections de pages immenses, la taille de la zone mémoire doit être au moins de dizaines de mégaoctets.

source: Before Linux 5.7. B<MPOL_MF_STRICT> was ignored on huge page mappings.
fr: Avant Linux 5.7. B<MPOL_MF_STRICT> était ignoré sur les projections de pages immenses.

source: B<MPOL_MF_MOVE> and B<MPOL_MF_MOVE_ALL> are available only on Linux 2.6.16 and later.
fr: B<MPOL_MF_MOVE> et B<MPOL_MF_MOVE_ALL> ne sont disponibles qu'à partir de Linux 2.6.16.

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Link with I<-lnuma>.
fr: Effectuez l'édition des liens avec l'option I<-lnuma>.

source: CONFORMING TO
fr: CONFORMITÉ

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
fr: I<Note> : il n'existe pas d'enveloppe pour cet appel système dans la glibc ; voir NOTES.

source: Glibc does not provide a wrapper for this system call. For information on library support, see B<numa>(7).
fr: La glibc ne fournit pas de fonction autour de cet appel système. Consultez B<numa>(7) pour des informations sur la prise en charge par des bibliothèques.
