Repository: sebras/manpages-l10n
Catalog: po/*/man2/membarrier.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: membarrier - issue memory barriers on a set of threads
fr: membarrier - Poser des barrières mémoire sur un ensemble de threads

source: The B<membarrier>() system call helps reducing the overhead of the memory barrier instructions required to order memory accesses on multi-core systems. However, this system call is heavier than a memory barrier, so using it effectively is I<not> as simple as replacing memory barriers with this system call, but requires understanding of the details below.
fr: L'appel système B<membarrier>() aide à réduire le temps-système des instructions de barrières mémoire nécessaire pour organiser les accès à la mémoire sur des systèmes à plusieurs cœurs. Cependant, cet appel système est plus lourd qu'une barrière mémoire, donc l'utiliser efficacement «I< n'est pas >» aussi simple que de remplacer une barrière mémoire par cet appel système, mais nécessite de comprendre les détails ci-dessous.

source: Use of memory barriers needs to be done taking into account that a memory barrier always needs to be either matched with its memory barrier counterparts, or that the architecture's memory model doesn't require the matching barriers.
fr: L'utilisation de barrières mémoire doit se faire en tenant compte du fait qu'elles doivent soit être associées avec leurs homologues, ou que le modèle de mémoire de l'architecture n'a pas besoin de barrières associées.

source: There are cases where one side of the matching barriers (which we will refer to as "fast side") is executed much more often than the other (which we will refer to as "slow side"). This is a prime target for the use of B<membarrier>(). The key idea is to replace, for these matching barriers, the fast-side memory barriers by simple compiler barriers, for example:
fr: Dans certains cas, une face des barrières associées (qu'on appellera la « face rapide ») est sollicitée beaucoup plus souvent que l'autre (qu'on appellera la « face lente »). C'est le motif principal pour utiliser B<membarrier>(). L'idée clé est de remplacer, pour ces barrières associées, les barrières mémoire de la face rapide par de simples barrières du compilateur, par exemple :

source: and replace the slow-side memory barriers by calls to B<membarrier>().
fr: et de remplacer les barrières mémoire de la face lente par des appels à B<membarrier>().

source: This will add overhead to the slow side, and remove overhead from the fast side, thus resulting in an overall performance increase as long as the slow side is infrequent enough that the overhead of the B<membarrier>() calls does not outweigh the performance gain on the fast side.
fr: Cela ajoutera du temps-système à la face lente et en supprimera de la face rapide, d'où une augmentation globale de performances tant que la face lente est si peu utilisée que le temps-système d'appels B<membarrier>() ne l’emporte pas sur le gain de performance de la face rapide.

source: The I<cmd> argument is one of the following:
fr: Le paramètre I<cmd> est l'un des suivants :

source: B<MEMBARRIER_CMD_QUERY> (since Linux 4.3)
fr: B<MEMBARRIER_CMD_QUERY> (depuis Linux 4.3)

source: Query the set of supported commands. The return value of the call is a bit mask of supported commands. B<MEMBARRIER_CMD_QUERY>, which has the value 0, is not itself included in this bit mask. This command is always supported (on kernels where B<membarrier>() is provided).
fr: Rechercher l'ensemble des commandes prises en charge. Le code de retour de l'appel est un masque de bits des commandes prises en charge. B<MEMBARRIER_CMD_QUERY>, dont la valeur est B<0>, n'est pas inclus dans ce masque de bits. Cette commande est toujours prise en charge (sur les noyaux où B<membarrier>() est fourni).

source: B<MEMBARRIER_CMD_GLOBAL> (since Linux 4.16)
fr: B<MEMBARRIER_CMD_GLOBAL> (depuis Linux 4.16)

source: Ensure that all threads from all processes on the system pass through a state where all memory accesses to user-space addresses match program order between entry to and return from the B<membarrier>() system call. All threads on the system are targeted by this command.
fr: S'assurer que tous les threads de tous les processus du système passent par un état où tous les accès mémoire aux adresses de l'espace utilisateur correspondent à l'organisation du programme entre l'entrée et le retour de l'appel système B<membarrier>(). Tous les threads du système sont visés par cette commande.

source: B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> (since Linux 4.16)
fr: B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> (depuis Linux 4.16)

source: Execute a memory barrier on all running threads of all processes that previously registered with B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
fr: Mettre une barrière mémoire sur tous les threads en cours de tous les processus qui se sont enregistrés précédemment avec B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: Upon return from the system call, the calling thread has a guarantee that all running threads have passed through a state where all memory accesses to user-space addresses match program order between entry to and return from the system call (non-running threads are de facto in such a state). This guarantee is provided only for the threads of processes that previously registered with B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
fr: Lors du retour de l'appel système, le thread appelant a la garantie que tous les threads en cours sont passés par un état où tous les accès mémoire aux adresses de l'espace utilisateur correspondent à l'organisation du programme entre l'entrée et le retour de l'appel système (les threads non en cours sont dans cet état de facto). Cette garantie n'est apportée qu'aux threads des processus qui se sont précédemment enregistrés avec B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: Given that registration is about the intent to receive the barriers, it is valid to invoke B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> from a process that has not employed B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
fr: Étant donné que l'enregistrement concerne l'intention de recevoir des barrières, il est possible d'appeler B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED> à partir d’un processus qui n’a pas utilisé B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: The "expedited" commands complete faster than the non-expedited ones; they never block, but have the downside of causing extra overhead.
fr: Les commandes « accélérées » (expedited) se terminent plus vite que celles non accélérées ; elles ne se bloquent jamais, mais elles causent aussi un temps-système supplémentaire.

source: B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED> (since Linux 4.16)
fr: B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED> (depuis Linux 4.16)

source: Register the process's intent to receive B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> memory barriers.
fr: Enregistrer l'intention du processus de recevoir des barrières mémoire B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>.

source: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED> (since Linux 4.14)
fr: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED> (depuis Linux 4.14)

source: Execute a memory barrier on each running thread belonging to the same process as the calling thread.
fr: Poser une barrière mémoire sur chaque thread en cours appartenant au même processus que le thread appelant.

source: Upon return from the system call, the calling thread has a guarantee that all its running thread siblings have passed through a state where all memory accesses to user-space addresses match program order between entry to and return from the system call (non-running threads are de facto in such a state). This guarantee is provided only for threads in the same process as the calling thread.
fr: Au retour de l'appel système, le thread appelant a la garantie que tous ses homologues en cours passent par un état où tous les accès mémoire aux adresses de l'espace utilisateur correspondent à l'ordre du programme entre l'entrée et le retour de l'appel système (les threads non en cours sont dans cet état de facto). Cette garantie n'est apportée qu'aux threads du même processus que le thread appelant.

source: A process must register its intent to use the private expedited command prior to using it.
fr: Un processus doit enregistrer son intention d'utiliser la commande accélérée privée avant de le faire.

source: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED> (since Linux 4.14)
fr: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED> (depuis Linux 4.14)

source: Register the process's intent to use B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>.
fr: Enregistrer l'intention du processus d'utiliser B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>.

source: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> (since Linux 4.16)
fr: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> (depuis Linux 4.16)

source: In addition to providing the memory ordering guarantees described in B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, upon return from system call the calling thread has a guarantee that all its running thread siblings have executed a core serializing instruction. This guarantee is provided only for threads in the same process as the calling thread.
fr: Outre les garanties d'organisation de la mémoire décrites dans B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, lors du retour de l'appel système, le thread appelant a la garantie que tous ses homologues ont exécuté une instruction de sérialisation du cœur. Cette garantie n'est apportée que pour les threads du même processus que celui appelant.

source: The "expedited" commands complete faster than the non-expedited ones, they never block, but have the downside of causing extra overhead.
fr: Les commandes « accélérées » se terminent plus vite que celles non accélérées, elles ne se bloquent jamais, mais demandent aussi un temps-système supplémentaire.

source: A process must register its intent to use the private expedited sync core command prior to using it.
fr: Un processus doit enregistrer son intention d'utiliser la commande accélérée privée de synchronisation de cœur avant de le faire.

source: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> (since Linux 4.16)
fr: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> (depuis Linux 4.16)

source: Register the process's intent to use B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>.
fr: Enregistrer l'intention du processus d'utiliser B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>.

source: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ> (since Linux 5.10)
fr: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ> (depuis Linux 5.10)

source: Ensure the caller thread, upon return from system call, that all its running thread siblings have any currently running rseq critical sections restarted if I<flags> parameter is 0; if I<flags> parameter is B<MEMBARRIER_CMD_FLAG_CPU>, then this operation is performed only on CPU indicated by I<cpu_id>. This guarantee is provided only for threads in the same process as the calling thread.
fr: Assurer au thread appelant, pendant le retour de l'appel système, que tous ses homologues en cours ont toutes les sections critiques rseq (restartable sequence) en cours redémarrées si le paramètre I<flags> vaut B<0> ; s'il vaut B<MEMBARRIER_CMD_FLAG_CPU>, cette opération n'est effectuée que sur le processeur indiqué par I<cpu_id>. Cette garantie n'est apportée qu'aux threads du même processus que le thread appelant.

source: RSEQ membarrier is only available in the "private expedited" form.
fr: RSEQ membarrier n'est disponible que sous la forme « private expedited ».

source: A process must register its intent to use the private expedited rseq command prior to using it.
fr: Un processus doit enregistrer son intention d'utiliser la commande accélérée privée rseq avant de le faire.

source: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_RSEQ> (since Linux 5.10)
fr: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_RSEQ> (depuis Linux 5.10)

source: Register the process's intent to use B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ>.
fr: Enregistrer l'intention du processus d'utiliser B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ>.

source: B<MEMBARRIER_CMD_SHARED> (since Linux 4.3)
fr: B<MEMBARRIER_CMD_SHARED> (depuis Linux 4.3)

source: This is an alias for B<MEMBARRIER_CMD_GLOBAL> that exists for header backward compatibility.
fr: Il s'agit d'un alias pour B<MEMBARRIER_CMD_GLOBAL> pour la rétrocompatibilité de l'entête.

source: The I<flags> argument must be specified as 0 unless the command is B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ>, in which case I<flags> can be either 0 or B<MEMBARRIER_CMD_FLAG_CPU>.
fr: Le paramètre I<flags> doit être indiqué en tant que B<0>, sauf si la commande est B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_RSEQ>, auquel cas I<flags> peut être soit B<0>, soit B<MEMBARRIER_CMD_FLAG_CPU>.

source: The I<cpu_id> argument is ignored unless I<flags> is B<MEMBARRIER_CMD_FLAG_CPU>, in which case it must specify the CPU targeted by this membarrier command.
fr: Le paramètre I<cpu_id> est ignoré sauf si I<flags> est B<MEMBARRIER_CMD_FLAG_CPU>, auquel cas il doit indiquer le processeur ciblé par cette commande membarrier.

source: All memory accesses performed in program order from each targeted thread are guaranteed to be ordered with respect to B<membarrier>().
fr: Tous les accès mémoire effectués dans l'organisation du programme à partir de chaque thread visé sont garantis d'être organisés par rapport à B<membarrier>().

source: If we use the semantic I<barrier()> to represent a compiler barrier forcing memory accesses to be performed in program order across the barrier, and I<smp_mb()> to represent explicit memory barriers forcing full memory ordering across the barrier, we have the following ordering table for each pairing of I<barrier()>, B<membarrier>(), and I<smp_mb()>. The pair ordering is detailed as (O: ordered, X: not ordered):
fr: Si nous utilisons la sémantique I<barrier()> pour représenter une barrière du compilateur qui force les accès mémoire à s'opérer dans l'ordre du programme le long des barrières, et I<smp_mb()> pour représenter les barrières explicites de la mémoire qui forcent toute la mémoire à s'organiser le long de la barrière, nous obtenons le tableau d'organisation suivant pour chaque paire de I<barrier()>, B<membarrier>() et I<smp_mb()>. L'organisation de la paire est détaillée ainsi (O : organisée, X : non organisée) :

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: For a given command, with I<flags> set to 0, this system call is guaranteed to always return the same value until reboot. Further calls with the same arguments will lead to the same result. Therefore, with I<flags> set to 0, error handling is required only for the first call to B<membarrier>().
fr: Pour une commande donnée, quand I<flags> est positionné sur B<0>, cet appel système est garanti de renvoyer toujours la même valeur jusqu'au redémarrage. Les appels suivants ayant les mêmes paramètres conduiront au même résultat. Donc, quand I<flags> est positionné sur B<0>, une gestion des erreurs n'est nécessaire que pour le premier appel à B<membarrier>().

source: ERRORS
fr: ERREURS

source: I<cmd> is invalid, or I<flags> is nonzero, or the B<MEMBARRIER_CMD_GLOBAL> command is disabled because the I<nohz_full> CPU parameter has been set, or the B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> and B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> commands are not implemented by the architecture.
fr: I<cmd> n'est pas valable ou I<flags> ne vaut pas zéro ou la commande B<MEMBARRIER_CMD_GLOBAL> est désactivée car le paramètre I<nohz_full> du processeur a été positionné ou les commandes B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> et B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> ne sont pas implémentées par l'architecture.

source: The B<membarrier>() system call is not implemented by this kernel.
fr: L'appel système B<membarrier>() n'est pas implémenté par ce noyau.

source: The current process was not registered prior to using private expedited commands.
fr: Le processus actuel n'était pas enregistré avant d'utiliser les commandes accélérées privées.

source: The B<membarrier>() system call was added in Linux 4.3.
fr: L'appel système B<membarrier>() a été ajouté dans Linux 4.3.

source: Before Linux 5.10, the prototype for B<membarrier>() was:
fr: Avant Linux 5.10, le prototype de B<membarrier>() était :

source: CONFORMING TO
fr: CONFORMITÉ

source: B<membarrier>() is Linux-specific.
fr: B<membarrier>() est spécifique à Linux.

source: A memory barrier instruction is part of the instruction set of architectures with weakly ordered memory models. It orders memory accesses prior to the barrier and after the barrier with respect to matching barriers on other cores. For instance, a load fence can order loads prior to and following that fence with respect to stores ordered by store fences.
fr: Une instruction de barrière mémoire fait partie du jeu d'instructions des architectures ayant des modèles de mémoire faiblement organisés. Elle organise les accès mémoire avant et après la barrière par rapport à celles correspondantes sur les autres cœurs. Par exemple, une barrière de charge peut organiser les charges avant et après elle par rapport aux stockages conservés dans les barrières de stockage.

source: Program order is the order in which instructions are ordered in the program assembly code.
fr: L'organisation du programme est l'ordre dans lequel les instructions sont ordonnées dans le code d'assembleur du programme.

source: Examples where B<membarrier>() can be useful include implementations of Read-Copy-Update libraries and garbage collectors.
fr: Parmi les exemples où B<membarrier>() peut être utile, figurent les implémentations des bibliothèques Read-Copy-Update et des ramasse-miettes

source: EXAMPLES
fr: EXEMPLES

source: Assuming a multithreaded application where "fast_path()" is executed very frequently, and where "slow_path()" is executed infrequently, the following code (x86) can be transformed using B<membarrier>():
fr: Supposons une application multithreadée où « fast_path() » est exécutée très souvent et où « slow_path() » l'est rarement, alors le code suivant (x86) peut être transformé en utilisant B<membarrier>() :

source: /* * Real applications would call fast_path() and slow_path() * from different threads. Call those from main() to keep * this example short. */
fr: /* * De vraies applications appelleraient fast_path() et slow_path() * à partir de différents threads. Appel à partir de main() * pour garder cet exemple court. */

source: /* * read_b == 0 implies read_a == 1 and * read_a == 0 implies read_b == 1. */
fr: /* * read_b == 0 implique que read_a == 1 et * read_a == 0 implique que read_b == 1. */

source: The code above transformed to use B<membarrier>() becomes:
fr: Le code ci-dessus transformé pour utiliser B<membarrier>() donne :

source: /* Check that membarrier() is supported. */
fr: /* Vérifier que membarrier() est pris en charge. */

source: if (!(ret & MEMBARRIER_CMD_GLOBAL)) { fprintf(stderr, "membarrier does not support MEMBARRIER_CMD_GLOBAL\en"); return -1; }
fr: if (!(ret & MEMBARRIER_CMD_GLOBAL)) { fprintf(stderr, "membarrier ne gère pas MEMBARRIER_CMD_GLOBAL\en"); return -1; }

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
fr: I<Note> : il n'existe pas d'enveloppe pour cet appel système dans la glibc ; voir NOTES.

source: On success, the B<MEMBARRIER_CMD_QUERY> operation returns a bit mask of supported commands, and the B<MEMBARRIER_CMD_GLOBAL>, B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>, and B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> operations return zero. On error, -1 is returned, and I<errno> is set appropriately.
fr: En cas de succès, l'opération B<MEMBARRIER_CMD_QUERY> renvoie un masque de bits des commandes prises en charge, et les opérations B<MEMBARRIER_CMD_GLOBAL>, B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> et B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> renvoient B<0>. En cas d'erreur, B<-1> est renvoyé et I<errno> est positionné adéquatement.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
fr: La glibc ne fournit pas de fonction autour de cet appel système ; appelez-le avec B<syscall>(2).

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: The I<flags> argument is currently unused and must be specified as 0.
fr: Le paramètre I<flags> est inusité actuellement et doit être spécifié à B<0>.

source: If we use the semantic I<barrier()> to represent a compiler barrier forcing memory accesses to be performed in program order across the barrier, and I<smp_mb()> to represent explicit memory barriers forcing full memory ordering across the barrier, we have the following ordering table for each pairing of I<barrier()>, B<membarrier>() and I<smp_mb()>. The pair ordering is detailed as (O: ordered, X: not ordered):
fr: Si nous utilisons la sémantique I<barrier()> pour représenter une barrière du compilateur qui force les accès mémoire à s'opérer dans l'ordre du programme le long des barrières, et I<smp_mb()> pour représenter les barrières explicites de la mémoire qui forcent toute la mémoire à s'organiser le long de la barrière, nous obtenons le tableau d'organisation suivant pour chaque paire de I<barrier()>, B<membarrier>() et I<smp_mb()>. L'organisation de la paire est détaillée ainsi (O : organisée, X : non organisée) :

source: A memory barrier instruction is part of the instruction set of architectures with weakly-ordered memory models. It orders memory accesses prior to the barrier and after the barrier with respect to matching barriers on other cores. For instance, a load fence can order loads prior to and following that fence with respect to stores ordered by store fences.
fr: Une instruction de barrière mémoire fait partie du jeu d'instructions des architectures ayant des modèles de mémoire faiblement organisés. Elle organise les accès mémoire avant et après la barrière par rapport à celles correspondantes sur les autres cœurs. Par exemple, une barrière de charge peut organiser les charges avant et après elle par rapport aux stockages conservés dans les barrières de stockage.

source: EXAMPLE
fr: EXEMPLE
