Repository: sebras/manpages-l10n
Catalog: po/*/man2/mknod.2.po
Languages: nl

source: NAME
nl: NAAM

source: mknod, mknodat - create a special or ordinary file
nl: mknod, mknodat - maak een map, een speciaal- of een normaal bestand

source: SYNOPSIS
nl: SAMENVATTING

source: B<int mknod(const char *>I<pathname>B<, mode_t >I<mode>B<, dev_t >I<dev>B<);>
nl: B<int mknod(const char *>I<padnaam>B<, mode_t >I<toestand>B<, dev_t >I<app>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>sys/stat.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van AT_* constanten */ B<#include E<lt>sys/stat.hE<gt>>

source: B<int mknodat(int >I<dirfd>B<, const char *>I<pathname>B<, mode_t >I<mode>B<, dev_t >I<dev>B<);>
nl: B<int mknodat(int >I<map_bi>B<, const char *>I<padnaam>B<, mode_t >I<toestand>B<, dev_t >I<app>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
nl: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Sinds glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versies E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: DESCRIPTION
nl: BESCHRIJVING

source: The system call B<mknod>() creates a filesystem node (file, device special file, or named pipe) named I<pathname>, with attributes specified by I<mode> and I<dev>.
nl: B<mknod>() probeert een bestandsysteem node te maken (bestand, apparaat speciaal bestand of een benoemde pijp) met de naam I<padnaam>, bepaald door I<toestand> en I<app>.

source: The I<mode> argument specifies both the file mode to use and the type of node to be created. It should be a combination (using bitwise OR) of one of the file types listed below and zero or more of the file mode bits listed in B<inode>(7).
nl: I<toestand> bepaald de bestandsmodus die zal worden gebruikt, en het soort node dat gemaakt zal worden. Dat hoort een combinatie (met bit wijze OF) ) van een hieronder genoemde bestand soorten en nul of meer van de bestandsmodi zoals te lezen in B<inode>(7).

source: The file mode is modified by the process's I<umask> in the usual way: in the absence of a default ACL, the permissions of the created node are (I<mode> & \(tiI<umask>).
nl: De toestemmingen worden aangepast door het I<umask> van het proces op de bekende manier: de toestemmingen van de gemaakte node worden (I<toestemmingen> & \(tiI<umask>).

source: The file type must be one of B<S_IFREG>, B<S_IFCHR>, B<S_IFBLK>, B<S_IFIFO>, or B<S_IFSOCK> to specify a regular file (which will be created empty), character special file, block special file, FIFO (named pipe), or UNIX domain socket, respectively. (Zero file type is equivalent to type B<S_IFREG>.)
nl: De bestand soort zou een van B<S_IFREG>, B<S_IFCHR>, B<S_IFBLK>, B<S_IFIFO> of B<S_IFSOCK> moeten zijn, om: een normaal bestand te specificeren (dat leeg aangemaakt zal worden), een speciaal teken bestand, een speciaal blok-bestand, of een FIFO (pijp met naam), of UNIX domein socket, respectievelijk. (Het nul bestand type is equivalent aan B<S_IFREG>.)

source: If the file type is B<S_IFCHR> or B<S_IFBLK>, then I<dev> specifies the major and minor numbers of the newly created device special file (B<makedev>(3) may be useful to build the value for I<dev>); otherwise it is ignored.
nl: Als het bestand soort B<S_IFCHR> of B<S_IFBLK> is, dan bepaald I<app> de grote en de kleine nummers van het nieuw gemaakte apparaat speciale bestand; anders wordt het genegeerd.

source: If I<pathname> already exists, or is a symbolic link, this call fails with an B<EEXIST> error.
nl: Als I<padnaam> al bestaat, of als het een symbolische koppeling is, dan faalt deze aanroep met de B<EEXIST> foutmelding.

source: The newly created node will be owned by the effective user ID of the process. If the directory containing the node has the set-group-ID bit set, or if the filesystem is mounted with BSD group semantics, the new node will inherit the group ownership from its parent directory; otherwise it will be owned by the effective group ID of the process.
nl: De nieuw gemaakte node zal eigendom zijn van het effectieve gebruiker ID van het proces. Als de map waar de node in zit het set-group-id bit aan heeft staan of als het bestandssysteem gekoppeld is met BSD groep regels, dan zal de nieuwe node het groep eigendom van zijn ouder-mappen erven; anders zal het eigendom zijn van het geldende groep ID van het proces.

source: The B<mknodat>() system call operates in exactly the same way as B<mknod>(), except for the differences described here.
nl: De B<mknodat>() systeem aanroep werkt op exact dezelfde manier als B<mknod>(), behalve voor de hier beschreven verschillen.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<mknod>() for a relative pathname).
nl: Als de padnaam gegeven in I<padnaam> relatief is, dan wordt deze geïnterpreteerd als relatief aan de map zoals gerefereerd door de bestand beschrijving I<dirfd> (liever dan relatief aan de huidige werkmap van het aanroepende proces, zoals gedaan wordt door B<mknod>() bij een relatieve padnaam).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<mknod>()).
nl: Als I<padnaam> relatief is en I<dirfd> is de speciale waarde B<AT_FDCWD>, dan wordt I<padnaam> geïnterpreteerd als relatief aan de huidige werkmap van het aanroepende proces (zoals B<mkdnod>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
nl: Als I<padnaam> absoluut is, dan wordt I<mapbi> genegeerd.

source: See B<openat>(2) for an explanation of the need for B<mknodat>().
nl: Zie B<openat>(2) voor een uitleg over de noodzaak van B<mknodat>().

source: RETURN VALUE
nl: EIND WAARDE

source: B<mknod>() and B<mknodat>() return zero on success. On error, -1 is returned and I<errno> is set to indicate the error.
nl: B<mknod>() en B<mknodat>() geven nul terug bij slagen, of -1 als een fout optrad (in welk geval I<errno> overeenkomstig wordt gezet).

source: ERRORS
nl: FOUTEN

source: The parent directory does not allow write permission to the process, or one of the directories in the path prefix of I<pathname> did not allow search permission. (See also B<path_resolution>(7).)
nl: De ouder map staat schrijven naar het proces niet toe, of een van de mappen in het voorvoegsel van I<padnaam> stond zoeken niet toe. (Zie ook B<path_resolution>(7).)

source: B<(>mknodatB<())> I<pathname> is relative but I<dirfd> is neither B<AT_FDCWD> nor a valid file descriptor.
nl: B<(>mknodatB<())> I<pathname> is relatief maar I<mapbi> is noch B<AT_FDCWD> noch een geldige bestandsindicator.

source: The user's quota of disk blocks or inodes on the filesystem has been exhausted.
nl: De gebruiker quota aan schijf blokken of inodes van het bestandssysteem is uitgeput.

source: I<pathname> already exists. This includes the case where I<pathname> is a symbolic link, dangling or not.
nl: I<padnaam> bestaat al. Inclusief het geval waar I<padnaam> een symbolische koppeling is, al dan niet bungelend.

source: I<pathname> points outside your accessible address space.
nl: I<padnaam> wijst buiten de voor u toegankelijke adresruimte.

source: I<mode> requested creation of something other than a regular file, device special file, FIFO or socket.
nl: I<toestand> vroeg om het maken van iets anders dan een normaal bestand, apparaat speciaal bestand, of FIFO.

source: Too many symbolic links were encountered in resolving I<pathname>.
nl: Teveel symbolische koppelingen werden tegengekomen bij het vaststellen van I<padnaam>.

source: I<pathname> was too long.
nl: I<padnaam> was te lang.

source: A directory component in I<pathname> does not exist or is a dangling symbolic link.
nl: Een map deel van I<padnaam> bestaat niet of is een loshangende symbolische koppeling.

source: Insufficient kernel memory was available.
nl: Onvoldoende kernelgeheugen voorhanden.

source: The device containing I<pathname> has no room for the new node.
nl: Het apparaat dat I<padnaam> bevat heeft geen ruimte voor een nieuwe node.

source: A component used as a directory in I<pathname> is not, in fact, a directory.
nl: Een onderdeel gebruikt als map in I<padnaam> is in feite geen map.

source: B<(>mknodatB<())> I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
nl: B<(>mknodatB<())> I<padnaam> is relatief en I<mapbi> is een bestandsindicator die naar een bestand wijst dat geen map is.

source: I<mode> requested creation of something other than a regular file, FIFO (named pipe), or UNIX domain socket, and the caller is not privileged (Linux: does not have the B<CAP_MKNOD> capability); also returned if the filesystem containing I<pathname> does not support the type of node requested.
nl: I<toestand> vroeg om het aanmaken van iets anders dan een normaal bestand, FIFO (pijp met naam), of een UNIX domein socket, en de aanroeper is niet de gerechtigd; (Linux: heeft niet de B<CAP_MKNOD> capaciteit); wordt ook teruggegeven als het bestandssysteem waar I<padnaam> op zit, het gevraagde type node niet ondersteund.

source: I<pathname> refers to a file on a read-only filesystem.
nl: I<padnaam> verwijst naar een bestand op een alleen-lezen bestandsysteem.

source: VERSIONS
nl: VERSIES

source: B<mknodat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
nl: B<mknodat>() werd toegevoegd aan Linux in kernel 2.6.16; bibliotheek ondersteuning werd toegevoegd aan glibc in versie 2.4.

source: NOTES
nl: OPMERKINGEN

source: POSIX.1-2001 says: "The only portable use of B<mknod>() is to create a FIFO-special file. If I<mode> is not B<S_IFIFO> or I<dev> is not 0, the behavior of B<mknod>() is unspecified." However, nowadays one should never use B<mknod>() for this purpose; one should use B<mkfifo>(3), a function especially defined for this purpose.
nl: POSIX.1-2001 schrijft: "Het enige overdraagbare gebruikt van B<mknod>() is door een FIFO-speciaal bestand aan te maken. Als I<mode> niet gelijk is aan B<S_IFIFO> of I<dev> is niet 0, dan is het gedrag van B<mknod>() niet gespecificeerd". Echter zou men tegenwoordig nooit B<mknod>() voor dit doel moeten gebruiken; men zou B<mkfifo>(3) moeten gebruiken, een aanroep die speciaal voor dit doel bedoeld is.

source: Under Linux, B<mknod>() cannot be used to create directories. One should make directories with B<mkdir>(2).
nl: Onder Linux, kan B<mknod>() niet gebruikt worden om mappen aan te maken. Men zou mappen moeten aanmaken met B<mkdir>(2).

source: There are many infelicities in the protocol underlying NFS. Some of these affect B<mknod>() and B<mknodat>().
nl: Er bestaan veel ongelukkigheden in het NFS protocol. Enkele van deze beïnvloeden B<mkdnod>() en B<mknodat>().

source: SEE ALSO
nl: ZIE OOK

source: Linux Programmer's Manual
nl: Linux Programmeurs Handleiding

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
nl: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Sinds glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versies E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: B<mknod>() and B<mknodat>() return zero on success, or -1 if an error occurred (in which case, I<errno> is set appropriately).
nl: B<mknod>() en B<mknodat>() geven nul terug bij slagen, of -1 als een fout optrad (in welk geval I<errno> overeenkomstig gezet).

source: The following additional errors can occur for B<mknodat>():
nl: De volgende additionele fouten kunnen optreden voor B<mknodat>():

source: I<dirfd> is not a valid file descriptor.
nl: I<mapbi> is geen geldige bestandsindicator.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
nl: I<padnaam> is relatief en I<mapbi> is een bestandsindicator die naar een bestand wijst die geen map is.

source: CONFORMING TO
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: The file mode is modified by the process's I<umask> in the usual way: in the absence of a default ACL, the permissions of the created node are (I<mode> & ~I<umask>).
nl: De toestemmingen worden aangepast door het I<umask> van het proces op de bekende manier: de toestemmingen van de gemaakte node worden (I<toestemmingen> & ~I<umask>).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
