Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: The I<mountflags> argument may have the magic number 0xC0ED (B<MS_MGC_VAL>) in the top 16 bits. (All of the other flags discussed in DESCRIPTION occupy the low order 16 bits of I<mountflags>.) Specifying B<MS_MGC_VAL> was required in kernel versions prior to 2.4, but since Linux 2.4 is no longer required and is ignored if specified.
de: Das Argument I<Einhängeschalter> hat die Magische Zahl 0xC0ED (B<MS_MGC_VAL>) in den oberen 16 Bits. (Alle andere in BESCHREIBUNG vorgestellten Schalter liegen in den unteren 16 Bits von I<Einhängeschalter>.). In Kernel-Versionen vor 2.4 war die Angabe von B<MS_MGC_VAL> notwendig, aber seit Linux 2.4 ist dies nicht mehr notwendig und wird, falls angegeben, ignoriert.
fr: L'argument I<mountflags> peut avoir le nombre magique 0xC0ED (B<MS_MGC_VAL>) dans ses 16 bits de poids fort (tous les autres attributs abordés dans DESCRIPTION sont dans les 16 bits de poids faible de I<mountflags>). L'indication de B<MS_MGC_VAL> était obligatoire dans les noyaux des versions antérieure à 2.4, mais depuis ne l'est plus et est ignoré si vous le faites.
it: L'argomento I<mountflags> può avere il "magic number" 0xC0ED (B<MS_MGC_VAL>) nei 16 bit più alti. (Tutti gli altri flag visti in DESCRIZIONE occupano i 16 bit meno significativi di I<mountflags>.) Specificare B<MS_MGC_VAL> era necessario nelle versioni di kernel precedenti alla 2.4, ma dalla 2.4 non è più necessario ed è ignorato se specificato.
uk: Аргумент I<прапорці_монтування> може містити магічне число 0xC0ED (B<MS_MGC_VAL>) у верхніх 16 бітах. (Усі інші прапорці, обговорення яких можна знайти у розділі «ОПИС», займають нижні за порядком 16 бітів I<прапорців_монтування>.) Визначення B<MS_MGC_VAL> було необхідним у версіях ядра до 2.4, але, починаючи з Linux 2.4, вже не є необхідним — його буде проігноровано, якщо його вказано.

source: The original B<MS_SYNC> flag was renamed B<MS_SYNCHRONOUS> in 1.1.69 when a different B<MS_SYNC> was added to I<E<lt>mman.hE<gt>>.
de: Der Originalschalter B<MS_SYNC> wurde in 1.1.69 in B<MS_SYNCHRONOUS> umbenannt, als ein anderer B<MS_SYNC> zu I<E<lt>mman.hE<gt>> hinzugefügt wurde.
fr: L'attribut original B<MS_SYNC> a été renommé B<MS_SYNCHRONOUS> dans Linux 1.1.69 car un B<MS_SYNC> différent a été ajouté dans I<E<lt>mman.hE<gt>>.
it: Il flag originale B<MS_SYNC> è stato rinominato B<MS_SYNCHRONOUS> in 1.1.69 quando è stato aggiunto un diverso B<MS_SYNC> a I<E<lt>mman.hE<gt>>.
uk: Початковий прапорець B<MS_SYNC> було перейменовано на B<MS_SYNCHRONOUS> у 1.1.69, коли було додано різні B<MS_SYNC> до I<E<lt>mman.hE<gt>>.

source: Before Linux 2.4 an attempt to execute a set-user-ID or set-group-ID program on a filesystem mounted with B<MS_NOSUID> would fail with B<EPERM>. Since Linux 2.4 the set-user-ID and set-group-ID bits are just silently ignored in this case.
de: Vor Linux 2.4 würde ein Versuch, ein Set-User-ID- oder Set-Group-ID-Programm auf einem Dateisystem auszuführen, das mit B<MS_NOSUID> eingehängt ist, mit B<EPERM> fehlschlagen. Seit Linux 2.4 werden die Bits Set-User-ID und Set-User-Group-ID in diesem Fall einfach stillschweigend ignoriert.
fr: Avant Linux 2.4, une tentative d'exécution d'un programme Set-UID ou Set-GID sur un système de fichiers monté avec l'attribut B<MS_NOSUID> échouait avec l'erreur B<EPERM>. Depuis Linux 2.4 les bits Set-UID et Set-GID sont simplement ignorés silencieusement dans ce cas.
it: Prima di Linux 2.4, un tentativo di eseguire un programma che usa set-user-ID o set-group-ID su un filesystem montato con B<MS_NOSUID> falliva con B<EPERM>. A partire da Linux 2.4 la richiesta di set-user-ID e set-group-ID in questo caso è ignorata senza emettere messaggi.
uk: До Linux 2.4 спроба виконати програму із set-user-ID або set-group-ID для файлової системи, яку змонтовано з B<MS_NOSUID>, завершиться помилкою з B<EPERM>. Починаючи з Linux 2.4, у цьому випадку біти set-user-ID і set-group-ID буде просто без повідомлень проігноровано.

source: Mount namespaces
de: Einhänge-Namensräume
fr: Espaces de noms montage
it: Spazi dei nomi di montaggio
uk: Простори назв монтування

source: Starting with kernel 2.4.19, Linux provides mount namespaces. A mount namespace is the set of filesystem mounts that are visible to a process. Mount namespaces can be (and usually are) shared between multiple processes, and changes to the namespace (i.e., mounts and unmounts) by one process are visible to all other processes sharing the same namespace. (The pre-2.4.19 Linux situation can be considered as one in which a single namespace was shared by every process on the system.)
de: Seit Kernel 2.4.19 stellt Linux Einhänge-Namensräume bereit. Ein Einhänge-Namensraum ist eine Zusammenstellung von eingehängten Dateisystemen, die für einen Prozess sichtbar sind. Einhängepunkt-Namensräume können (und werden gewöhnlich) gemeinsam von mehreren Prozessen benutzt und Änderungen am Namensraum (d.h. Ein- und Aushängen) durch einen Prozess sind für alle anderen Prozesse sichtbar, die den gleichen Namensraum mitverwenden. (Die Situation in Linux vor 2.4.19 kann so betrachtet werden, als ob ein einzelner Namensraum von jedem Prozess im System mitbenutzt würde.)
fr: À partir du noyau 2.4.19, Linux fournit des espaces de noms montage. Un espace de noms montage est un ensemble de montages de systèmes de fichiers qui sont visibles par un processus. Les espaces de noms montage peuvent être (ils le sont généralement) partagés entre différents processus et les modifications de l'espace de noms (c'est-à-dire les montages et démontages) par un processus sont visibles pour tous les autres processus qui partagent le même espace de noms (la situation des versions antérieures à 2.4.19 de Linux peut être considérée comme l'utilisation d'un unique espace de noms partagé par tous les processus du système).
it: A partire dal kernel 2.4.19, Linux fornisce spazi dei nomi di montaggio. Lo spazio dei nomi di montaggio è l'insieme di montaggi di filesystem che un processo può vedere. Gli spazi dei nomi di montaggio possono essere (e di solito sono) condivisi tra più processi, e i cambiamenti provocati da un processo (cioè montaggi e smontaggi) sono visibili a tutti i processi che condividano lo stesso spazio dei nomi. (La situazione prima di Linux 2.4.19 prevedeva che un singolo spazio dei nomi fosse condiviso da tutti i processi nel sistema.)
uk: Починаючи з версії ядра 2.4.19, у Linux передбачено простори назв монтування. Простір назв монтування — це набір монтувань файлової системи, які є видимими для процесу. Простори назв монтування можуть поділятися (і, зазвичай, поділяються) декількома процесами, а зміни у просторі назв (тобто монтування і демонтування) у результаті роботи одного процесру є видимими для усіх інших процесів, які спільно використовують той самий простір назв. (Ситуацію у Linux до версії 2.4.19 можна розглядати як таку, коли один простір назв спільно використовували усі процеси у системі.)

source: A child process created by B<fork>(2) shares its parent's mount namespace; the mount namespace is preserved across an B<execve>(2).
de: Ein Kindprozess, der durch B<fork>(2) erzeugt wurde, nutzt den Einhängenamensraum seines Elternprozesses; der Einhängenamensraum wird über ein B<execve>(2) beibehalten.
fr: Un processus enfant créé avec B<fork>(2) partage l'espace de noms montage de son parent ; l'espace de noms montage est préservé au travers d'un B<execve>(2).
it: Un processo figlio creato da B<fork>(2) condivide lo spazio dei nomi di montaggio del suo genitore: lo spazio dei nomi di montaggio viene preservato se si invoca B<execve>(2).
uk: Дочірній процес, створений B<fork>(2), матиме той самий простір назв монтування, що і батьківський; простір назв монтування зберігається у межах B<execve>(2).

source: A process can obtain a private mount namespace if: it was created using the B<clone>(2) B<CLONE_NEWNS> flag, in which case its new namespace is initialized to be a I<copy> of the namespace of the process that called B<clone>(2); or it calls B<unshare>(2) with the B<CLONE_NEWNS> flag, which causes the caller's mount namespace to obtain a private copy of the namespace that it was previously sharing with other processes, so that future mounts and unmounts by the caller are invisible to other processes (except child processes that the caller subsequently creates) and vice versa.
de: Ein Prozess kann einen privat eingehängten Namensraum erhalten, falls er unter Benutzung des Schalters B<CLONE_NEWNS> von B<clone>(2) erstellt wurde. In diesem Fall wird sein neuer Namensraum als eine I<Kopie> des Namensraums des Prozesses, der B<clone>(2) aufrief, initialisiert oder er ruft B<unshare>(2) mit dem Schalter B<CLONE_NEWNS> auf, was veranlasst, dass der Einhänge-Namensraum des Aufrufenden eine private Kopie des Namensraums erhält, der vorher mit anderen Prozessen gemeinsam benutzt wurde, so dass zukünftiges Ein- und Aushängen durch den Aufrufenden für andere Prozesse unsichtbar ist (außer Kindprozesse, die der Aufrufende hinterher erzeugt) und umgekehrt.
fr: Un processus peut obtenir un espace de noms montage privé si : il a été créé en utilisant l'attribut B<CLONE_NEWNS> de B<clone>(2), dans ce cas son nouvel espace de noms est initialisé comme une I<copie> de l'espace de noms du processus qui a appelé B<clone>(2) ; ou il appelle B<unshare>(2) avec l'attribut B<CLONE_NEWNS>, ce qui provoque l'obtention d'une copie privée de l'environnement de l'appelant, qui était auparavant partagé avec d'autres processus, de telle sorte que les montages ou démontages futurs de l'appelant ne seront pas visibles des autres processus (à l'exception des processus enfants que le processus pourrait créer), et vice-versa.
it: Un processo può ottenere uno spazio dei nomi di montaggio privato se: è stato creato usando il flag B<CLONE_NEWNS> di B<clone>(), e in questo caso il suo nuovo spazio dei nomi viene inizializzato come I<copia> degli spazi dei nomi del processo che ha chiamato B<clone>(); oppure se chiama B<unshare>(2) con il flag B<CLONE_NEWNS>, che permette allo spazio dei nomi del chiamante di ottenere una copia privata dello spazio dei nomi che in precedenza condivideva con altri processi, in modo che chiamate a montaggi e smontaggi futuri siano invisibili agli altri processi (ad eccezione di processi figli creati successivamente dal chiamante), e viceversa.
uk: Процес може отримувати приватний простір назв монтування, якщо його було створено за допомогою прапорця B<CLONE_NEWNS> B<clone>(2). У цьому випадку його новий простір назв буде ініціалізовано так, щоб він був I<копією> простору назв процесу, який викликав B<clone>(2). Також це можливе, якщо процес викликає B<unshare>(2) із прапорцем B<CLONE_NEWNS>, що спричиняє те, що простір монтування процесу виклику отримує приватну копію простору назв, який він раніше поділяв із іншими процесами, отже наступні монтування і демонтування з процесу виклику будуть невидимими для інших процесів (окрім дочірніх процесів, які процес виклику надалі створюватиме), і навпаки.

source: For further details on mount namespaces, see B<mount_namespaces>(7).
de: Für weitere Details über Einhänge-Namensräume, siehe B<mount_namespaces>(7).
fr: Pour plus de détails sur les espaces de noms montage, voir B<mount_namespaces>(7).
it: Per ulteriori dettagli sugli spazi dei nomi dei montaggi si veda: B<mount_namespaces>(7).
uk: Щоб дізнатися про простори назв монтувань, ознайомтеся із сторінкою підручника щодо B<mount_namespaces>(7).

source: Parental relationship between mounts
de: Elterliche Beziehung zwischen Einhängungen
uk: Батьківські зв'язки між монтуваннями

source: Each mount has a parent mount. The overall parental relationship of all mounts defines the single directory hierarchy seen by the processes within a mount namespace.
de: Jede Einhängung hat eine Eltern-Einhängung. Die allgemeine elterliche Beziehung aller Einhängungen definiert die einzelne Verzeichnishierarchie, wie sie Prozesse innerhalb eines Einhänge-Namensraums sehen.
uk: У кожного монтування є батьківське монтування. Загалом, родинні зв'язки усіх монтувань визначають єдину ієрархію каталогів, яку бачать процес у просторі назв монтування.

source: The parent of a new mount is defined when the mount is created. In the usual case, the parent of a new mount is the mount of the filesystem containing the directory or file at which the new mount is attached. In the case where a new mount is stacked on top of an existing mount, the parent of the new mount is the previous mount that was stacked at that location.
de: Die Eltern-Einhängung einer neuen Einhängung wird definiert, wenn die Einhängung erstellt wird. Üblicherweise ist die Eltern-Einhängung einer neuen Einhängung die Einhängung des Dateisystems, welches das Verzeichnis oder die Datei enthält, an dem oder der die neue Einhängung geschieht. In dem Fall, in dem der Eltern-Einhängepunkt einer neuen Einhängung über die oberste Ebene einer existierenden Einhängung gesetzt wird, ist der Eltern-Einhängepunkt der neuen Einhängung die vorherige Einhängung, die an diesem Ort gesetzt war.
uk: Батьківське монтування нового монтування визначається при створенні монтування. У звичному випадку батьківським монтуванням нового монтування є монтування файлової системи, яке містить каталог або файл, до якого долучено нове монтування. У випадку, коли нове монтування розташовано у стосі вище за наявне монтування, батьківським монтуванням нового монтування буде попереднє монтування, яке було у стосі у відповідному місці.

source: The parental relationship between mounts can be discovered via the I</proc/[pid]/mountinfo> file (see below).
de: Die elterliche Beziehung zwischen Einhängungen können Sie in der Datei I</proc/[PID]/mountinfo> herausfinden (siehe unten).
uk: Батьківський взаємозв'язок між монтуваннями можна виявити за допомогою файла I</proc/[pid]/mountinfo> (див. нижче).

source: /proc/[pid]/mounts and /proc/[pid]/mountinfo
de: /proc/[PID]/mounts und /proc/[PID]/mountinfo
fr: /proc/[pid]/mounts et /proc/[pid]/mountinfo
it: /proc/[pid]/mounts e /proc/[pid]/mountinfo
uk: /proc/[pid]/mounts та /proc/[pid]/mountinfo

source: The Linux-specific I</proc/[pid]/mounts> file exposes the list of mounts in the mount namespace of the process with the specified ID. The I</proc/[pid]/mountinfo> file exposes even more information about mounts, including the propagation type and mount ID information that makes it possible to discover the parental relationship between mounts. See B<proc>(5) and B<mount_namespaces>(7) for details of this file.
de: Die Linux-spezifische Datei I</proc/[PID]/mounts> legt die Liste der Einhängungen in dem Einhängenamensraum des Prozesses mit der festgelegten Kennung offen. Die Datei I</proc/[PID]/mountinfo> legt sogar weitere Informationen über Einhängungen offen, einschließlich des Ausbreitungstyps und der Einhängekennungsinformation, die es ermöglichen, die Eltern-Kind-Beziehungen zwischen Einhängungen zu ermitteln. Siehe B<proc>(5) und B<mount_namespaces>(7) für Details über diese Dateien.
uk: Специфічний для Linux файл I</proc/[pid]/mounts> надає доступ до списку точок монтування у просторі назв монтування процесу із вказаним ідентифікатором. Крім того, файл I</proc/[pid]/mountinfo> надає доступ до навіть ширших відомостей щодо монтувань, зокрема типу поширення та даних щодо ідентифікатора монтування, що уможливлює виявлення батьківських зв'язків між монтуваннями. Подробиці щодо цього файла наведено на сторінках підручника щодо B<proc>(5) і B<mount_namespaces>(7).

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI
it: VEDERE ANCHE
uk: ДИВ. ТАКОЖ

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
fr: Manuel du programmeur Linux
it: Manuale del programmatore di Linux
uk: Підручник програміста Linux

source: The I<data> argument is interpreted by the different filesystems. Typically it is a string of comma-separated options understood by this filesystem. See B<mount>(8) for details of the options available for each filesystem type.
de: Das Argument I<Daten> wird von den verschiedenen Dateisystemen interpretiert. Typischerweise ist es eine Zeichenkette aus Optionen, die durch Kommata getrennt sind und die von diesem Dateisystem verstanden werden. Lesen Sie B<mount>(8), um weitere Einzelheiten über die verfügbaren Optionen für jeden Dateisystemtyp zu erfahren.
fr: L'argument I<data> est interprété différemment suivant le type de système de fichiers. Typiquement, c'est une chaîne d'options comprises par le système de fichiers, séparées par des virgules. Consultez B<mount>(8) pour des détails sur les options disponibles pour chaque type de système.
it: L'argomento I<data> è interpretato dai differenti filesystem. Tipicamente è una stringa di opzioni, separate da virgole, riconosciute da un determinato filesystem. Vedere B<mount>(8) per dettagli sulle opzioni disponibili per ciascun tipo di filesystem.
uk: Аргумент I<дані> буде оброблено по-різному різними файловими системами. Типово, це рядок відокремлених комами параметрів, які може бути оброблено для файлової системи. Див. B<mount>(8), щоб дізнатися більше про параметри, які доступні для кожного з типів файлових систем.

source: Permit mandatory locking on files in this filesystem. (Mandatory locking must still be enabled on a per-file basis, as described in B<fcntl>(2).) Since Linux 4.5, this mount option requires the B<CAP_SYS_ADMIN> capability and a kernel configured with the B<CONFIG_MANDATORY_FILE_LOCKING> option.
de: Zwingendes Sperren von Dateien auf diesem Dateisystem erlauben. (Zwingendes Sperren muss immer noch für jede Datei eingeschaltet werden, wie es in B<fcntl>(2) beschrieben ist.) Seit Linux 4.5 benötigt diese Einhängeoption die Capability B<CAP_SYS_ADMIN> und einen Kernel, der mit der Option B<CONFIG_MANDATORY_FILE_LOCKING> konfiguriert wurde.
fr: Autoriser les verrouillages impératifs sur les fichiers de ce système de fichiers (le verrouillage impératif devra toutefois être validé fichier par fichier, comme décrit dans B<fcntl>(2)). Depuis Linux 4.5, cette option de montage exige la capacité B<CAP_SYS_ADMIN> et un noyau configuré avec l'option B<CONFIG_MANDATORY_FILE_LOCKING>.
it: Consente il blocco obbligatorio sui file in questo filesystem. (Il blocco obbligatorio deve ancora essere abilitato per i singoli file, come descritto in B<fcntl>(2).) A partire da Linux 4.5, quest'opzione di mount richiede la funzionalità B<CAP_SYS_ADMIN> e un kernel configurato con l'opzione B<CONFIG_MANDATORY_FILE_LOCKING>.
uk: Виконати обов'язкове блокування файлів у цій файловій системі. (Обов'язкове блокування все ще має бути увімкнено на рівні окремих файлів, як це описано у B<fcntl>(2).) Починаючи з версії Linux 4.5, цей параметр монтування потребує можливості B<CAP_SYS_ADMIN> і ядра, яке налаштовано з використанням параметра B<CONFIG_MANDATORY_FILE_LOCKING>.

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem.
de: respektiert die Bits oder Datei-Capabilities »set-user-ID« und »set-group-ID« bei der Ausführung von Programmen von diesem Dateisystem nicht.
fr: Ne pas tenir compte des bits Set-UID et Set-GID ou des capacités de fichier lors de l'exécution de programmes de ce système de fichiers.
it: Non onora le funzionalità dei file per impostare i bit set-user-ID e set-group-ID quando si eseguono programmi da questo filesystem.
uk: Не брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконання програм з цієї файлової системи.

source: The following flags are per-superblock: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT>, and B<MS_SYNCHRONOUS>. The initial settings of these flags are determined on the first mount of the filesystem, and will be shared by all subsequent mounts of the same filesystem. Subsequently, the settings of the flags can be changed via a remount operation (see below). Such changes will be visible via all mount points associated with the filesystem.
de: Die folgenden Schalter sind pro Superblock: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> und B<MS_SYNCHRONOUS>. Die anfänglichen Einstellungen dieser Schalter werden bei der ersten Einhängung des Dateisystems bestimmt und werden von allen nachfolgenden Einhängungen des gleichen Dateisystems mitbenutzt. Als Folge davon können die Einstellungen dieser Schalter mittels einer Neueinhängungsaktion (siehe unten) geändert werden. Solche Änderungen werden auf allen Einhängepunkten, die diesem Dateisystem zugeordnet sind, sichtbar.
fr: Les attributs suivants fonctionnent par superbloc : B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> et B<MS_SYNCHRONOUS>. Les réglages initiaux de ces attributs sont déterminés lors du premier montage du système de fichiers et seront partagés par tous les montages suivants du même système de fichiers. Par conséquent, les réglages des attributs peuvent être modifiés à l'aide d'une opération de remontage (voir ci-dessous). De telles modifications seront visibles à l'aide de tous les points de montage associés au système de fichiers.
it: I seguenti flag sono a livello di superblocco: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> e B<MS_SYNCHRONOUS>. Le impostazioni iniziali di questi flag sono stabilite al primo montaggio del filesystem, e verranno riutilizzate per tutti gli ulteriori montaggi dello stesso filesystem. Successivamente, le impostazioni dei flag possono essere cambiate attraverso un'operazione di rimontaggio (vedi sotto). Tali modifiche saranno applicate a tutti i punti di montaggio collegati con lo stesso filesystem.
uk: Для окремих суперблоків застосовуються такі прапорці: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> і B<MS_SYNCHRONOUS>. Початкові значення цих прапорців визначаються при першому монтуванні файлової системи. Їх буде використано для усіх наступних монтувань тієї самої файлової системи. Надалі, параметри прапорців може бути змінено дією з повторного монтування (див. нижче). Такі зміни стануть видимими через усі монтування, які пов'язано із файловою системою.
