Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: The following I<mountflags> can be changed: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (whose effect is to clear the B<MS_NOATIME> and B<MS_RELATIME> flags), and B<MS_SYNCHRONOUS>. Attempts to change the setting of the B<MS_DIRSYNC> and B<MS_SILENT> flags during a remount are silently ignored. Note that changes to per-superblock flags are visible via all mount points of the associated filesystem (because the per-superblock flags are shared by all mount points).
de: Die folgenden I<Einhängeschalter> können geändert werden: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (der bewirkt, dass die Schalter B<MS_NOATIME> und B<MS_RELATIME> bereinigt werden) und B<MS_SYNCHRONOUS>. Versuche, die Einstellung der Schalter B<MS_DIRSYNC> und B<MS_SILENT> während einer wiederholten Einhängung zu ändern, werden ohne Rückmeldung ignoriert. Beachten Sie, dass Änderungen der superblockbezogenen Schalter über alle Einhängepunkte der zugeordneten Dateisysteme hinweg sichtbar sind (da die superblockbezogenen Schalter von allen Einhängepunkten gemeinsam benutzt werden).
fr: Les I<mountflags> peuvent être modifiés : B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (dont l'effet est de vider les attributs B<MS_NOATIME> et B<MS_RELATIME>) et B<MS_SYNCHRONOUS>. Les tentatives de modification des attributs B<MS_DIRSYNC> et B<MS_SILENT> lors d'un remontage sont ignorées silencieusement. Remarquez que les modifications d'attributs par superbloc se voient à travers les points de montage de tous les systèmes de fichiers associés (parce que l'attribut par superbloc est partagé par tous les points de montage).
it: I seguenti bit di I<mountflags> possono essere modificati: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (il cui effetto è quello di azzerare i flag B<MS_NOATIME> e B<MS_RELATIME>), e B<MS_SYNCHRONOUS>. I tentativi di cambiare l'impostazione del flag B<MS_DIRSYNC> e B<MS_SILENT> durante un rimontaggio vengono ignorati senza emettere messaggi. Si noti che i cambiamenti ai flag a livello di superblocco sono visibili anche in tutti i punti di montaggio dei filesystem associati (perché i flag a livello di superblocco sono condivisi da tutti i punti di montaggio).
uk: Можна змінювати такі I<прапорці_монтування>: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (результатом зміни буде зняття прапорців B<MS_NOATIME> і B<MS_RELATIME>) і B<MS_SYNCHRONOUS>. Спроби змінити значення прапорців B<MS_DIRSYNC> і B<MS_SILENT> під час повторного монтування без питань буде проігноровано. Зауважте, що зміни до прапорців окремих суперблоків можна буде переглянути за усіма монтуваннями пов'язаної файлової системи (оскільки прапорці для окремих суперблоків спільно використовуються усіма монтуваннями).

source: Since Linux 2.6.26, the B<MS_REMOUNT> flag can be used with B<MS_BIND> to modify only the per-mount-point flags. This is particularly useful for setting or clearing the "read-only" flag on a mount point without changing the underlying filesystem. Specifying I<mountflags> as:
de: Seit Linux 2.6.26 kann der Schalter B<MS_REMOUNT> mit B<MS_BIND> verwandt werden, um nur die einhängepunktabhängigen Schalter zu verändern. Dies ist besonders nützlich, um den »nur-lesbar«-Schalter auf einem Einhängepunkt (zurück-)zusetzen, ohne das unterliegende Dateisystem zu verändern. Wird I<Einhängeschalter> als
fr: Depuis Linux 2.6.26, l'attribut B<MS_REMOUNT> peut être utilisé avec B<MS_BIND> pour ne modifier que les attributs sur la base des points de montage. Cela est particulièrement utile pour positionner ou effacer l'attribut « read-only » d'un point de montage sans modifier le système de fichiers sous-jacent. Si on indique I<mountflags> ainsi :
it: A partire da Linux 2.6.26, il flag B<MS_REMOUNT> può essere usato con B<MS_BIND> per modificare solo i flag relativi ai punti di montaggio Questo è particolarmente utile per impostare o annullare il flag "read-only" su un punto di montaggio senza cambiare il filesystem sottostante. Specificando I<mountflags> come:
uk: Починаючи з Linux 2.6.26, прапорцем B<MS_REMOUNT> можна скористатися у поєднанні із B<MS_BIND> для зміни прапорців монтування окремої точки монтування. Це, зокрема, корисно для встановлення або зняття прапорця «лише читання» для монтування без зміни базової файлової системи. Визначення I<прапорців_монтування> так:

source: will make access through this mountpoint read-only, without affecting other mount points.
de: angegeben, dann wird der Zugriff über diesen Einhängepunkt nur-lesbar, ohne andere Einhängepunkte zu beeinflussen.
fr: donnera accès à ce point de montage en lecture seule, sans modifier les autres points de montage.
it: si farà l'accesso attraverso questo punto di montaggio, senza influenzare altri punti di montaggio.
uk: зробить доступ за допомогою цієї точки монтування придатним лише для читання, не впливаючи на інші точки монтування.

source: The remaining bits (other than B<MS_REC>, described below) in the I<mountflags> argument are also ignored. (The bind mount has the same mount options as the underlying mount point.) However, see the discussion of remounting above, for a method of making an existing bind mount read-only.
de: Die verbleibenden Bits (außer das unten beschriebene B<MS_REC>) im Argument I<Einhängeschalter> werden auch ignoriert. (Die Bind-Einhängung hat die gleichen Einhängeoptionen wie der unterliegende Einhängepunkt.) Lesen Sie allerdings die Diskussion zum erneuten Einhängen weiter oben für eine Methode, wie Sie eine bestehende Bind-Einhängung auf nur-lesend ändern.
fr: Les autres bits (sauf B<MS_REC> décrit ci-dessous) du paramètre I<mountflags> sont ignorés également (le montage miroir a les mêmes options de montage que celui sous-jacent). Cependant, consultez le point sur le remontage ci-dessus pour une méthode permettant de rendre un montage miroir en lecture seule.
it: I restanti bit (diversi da B<MS_REC>, descritto sotto) nell'argomento I<mountflags> vengono anch'essi ignorati. (Il montaggio di tipo bind ha le stesse opzioni di montaggio del punto di montaggio su cui viene applicato.) Si veda comunque la spiegazione sul rimontaggio vista prima, per il modo di rendere in sola lettura un punto di montaggio già in essere.
uk: Решту бітів (окрім B<MS_REC>, як це описано нижче) в аргументі I<прапорці_монтування> також буде проігноровано (Монтування з прив'язкою матиме ті самі параметри монтування, що і базове монтування.) Втім, ознайомтеся із обговоренням щодо повторного монтування вище, щоб дізнатися про спосіб зробити наявне монтування з прив'язкою придатним лише до читання.

source: Make this mount point shared. Mount and unmount events immediately under this mount point will propagate to the other mount points that are members of this mount's peer group. Propagation here means that the same mount or unmount will automatically occur under all of the other mount points in the peer group. Conversely, mount and unmount events that take place under peer mount points will propagate to this mount point.
de: Damit wird dies ein Mehrfacheinhängepunkt. Ein- und Aushängeereignisse, die direkt unter diesem Einhängepunkt sind, werden sich zu allen Einhängepunkten, die Mitglieder der Peer-Gruppe dieser Einhängung sind. Ausbreitung bedeutet hier, dass die gleiche Ein- oder Aushängung automatisch unter allen anderen Einhängepunkten in der Peer-Gruppe erfolgen wird. Umgekehrt werden Ein- und Aushängeereignisse, die unter den Peer-Einhängepunkten stattfinden, sich zu diesem Einhängepunkt ausbreiten.
fr: Rendre le point de montage partagé. Les événements de montage et de démontage se produisant immédiatement dans ce point de montage seront propagés à tous les points de montage membres de ce groupe de montages pairs. Une propagation signifie ici que le même montage et le même démontage se produiront automatiquement sur tous les points de montage du groupe. Inversement, les événements de montage et de démontage qui se produiront dans les montages pairs se propageront à ce point de montage.
it: Rende condiviso questo punto di montaggio. Gli eventi di montaggio e smontaggio che stanno subito sotto questo punto di montaggio si propagheranno agli altri punti di mount che sono membri di questo "gruppo di pari" (peer group) nel montaggio. Qui condivisione significa che lo stesso montaggio o smontaggio avverrà automaticamente sotto tutti gli altri punti di mount nel "gruppo di pari". Simmetricamente, gli eventi di montaggio e smontaggio che hanno luogo nel "gruppo di pari" si propagheranno a questo punto di montaggio.
uk: Зробити це монтування спільним. Події з монтування та демонтування безпосередньо під цим монтуванням поширюватимуться на інші монтування, які є учасниками групи вузлів цього монтування. Поширення тут означає, що ту саму дію з монтування або демонтування буде автоматично виконано для усіх інших монтувань у групі вузлів. І навпаки, події з монтування або демонтування, які виконуватимуться під монтуваннями вузлів, поширюватимуться до цього монтування.

source: Make this mount point private. Mount and unmount events do not propagate into or out of this mount point.
de: Dieser Einhängepunkt wird privat. Ein- und Aushängeereignisse breiten sich nicht in oder aus diesem Einhängepunkt heraus aus.
fr: Rendre ce point de montage privé. Les événements de montage et de démontage ne se propageront pas à ce point de montage ou à d'autres.
it: Rende privato questo punto di montaggio. Gli eventi di montaggio e smontaggio non vengono condivisi dentro o fuori a questo punto di montaggio.
uk: Зробити цю точку монтування приватним. Події з монтування і демонтування не поширюватимуться всередину і назовні від цієї точки монтування.

source: If this is a shared mount point that is a member of a peer group that contains other members, convert it to a slave mount. If this is a shared mount point that is a member of a peer group that contains no other members, convert it to a private mount. Otherwise, the propagation type of the mount point is left unchanged.
de: Wenn dies ein gemeinsamer Einhängepunkt ist, der ein Mitglied einer Peer-Gruppe, die andere Mitglieder enthält, ist, dann wird er in eine Slave-Einhängung umgewandelt. Falls dies ein gemeinsamer Einhängepunkt ist, der ein Mitglied einer Peer-Gruppe, die keine anderen Mitglieder enthält, ist, dann wird er in eine private Einhängung umgewandelt. Andernfalls bleibt der Ausbreitungstyp des Einhängepunkts unverändert.
fr: S'il s'agit d'un point de montage partagé membre d'un groupe de pairs qui contient d'autres membres, le convertir en montage esclave. S'il s'agit d'un point de montage partagé membre d'un groupe qui n'en contient pas d'autres, le convertir en montage privé. Sinon, le type de propagation du montage est inchangé.
it: Se questo è un punto di montaggio condiviso che è membro di un "gruppo di pari" (peer group) che contiene altri membri, viene convertito in un montaggio asservito (slave mount). Se questo è un punto di montaggio condiviso che è membro di un "gruppo di pari" che non contiene altri membri, viene convertito in un montaggio privato (private mount). Altrimenti, il tipo di condivisione del punto di montaggio rimane invariato.
uk: Якщо це спільне монтування, яке є учасником групи вузлів, яка містить інших учасників, перетворити його на підлегле монтування. Якщо це спільне монтування, яке є учасником групи вузлів, яка не містить інших учасників, перетворити його на приватне монтування. В інших випадках тип поширення монтування буде залишено без змін.

source: When a mount point is a slave, mount and unmount events propagate into this mount point from the (master) shared peer group of which it was formerly a member. Mount and unmount events under this mount point do not propagate to any peer.
de: Wenn ein Einhängepunkt ein Slave ist, breiten sich Ein- und Aushängeereignisse in diesen Einhängepunkt von der gemeinsamen (Master-)Peer-Gruppe aus, bei der er früher ein Mitglied war. Ein- und Aushängeereignisse unterhalb dieses Einhängepunktes breiten sich nicht zu einem Peer aus.
fr: Lorsqu'un point de montage est esclave, les événements de montage et de démontage se propagent à ce point de montage depuis le groupe de pairs partagé (maître) dont il était membre. Les événements de montage et de démontage de ce point de montage ne se propagent à aucun autre pair.
it: Quando un punto di montaggio è asservito ad altri (slave mount), gli eventi di montaggio e smontaggio si propagano in questo punto di montaggio dal "gruppo di pari" (master) condiviso del quale era stato membro in precedenza. Gli eventi di montaggio e smontaggio sotto questo punto di montaggio non si propagano a nessun "pari" (peer).
uk: Якщо монтування є підлеглим, події з монтування або демонтування поширюватимуться до цього монтування з (основної) спільної групи вузлів, учасником якої було раніше це монтування. Події з монтування і демонтування під цим монтуванням не поширюватимуться до жодного вузла.

source: A mount point can be the slave of another peer group while at the same time sharing mount and unmount events with a peer group of which it is a member.
de: Ein Einhängepunkt kann ein Slave einer anderen Peer-Gruppe sein und gleichzeitig die Ein- und Aushängeereignisse gemeinsam mit einer Peer-Gruppe nutzen, bei der er Mitglied ist.
fr: Un point de montage peut être esclave d'un autre groupe de pairs en même temps qu'il partage les événements de montage et de démontage avec un autre groupe de pairs dont il est membre.
it: Un punto di montaggio può essere asservito (slave) a un altro "gruppo di pari" condividendo nel contempo eventi di montaggio e smontaggio con un "gruppo di pari" di cui è membro.
uk: Монтування може бути підлеглим монтуванням іншої групи вузлів, одночасно поділяючи події з монтування і демонтування з групою вузлів, учасником якої воно є.

source: By default, changing the propagation type affects only the I<target> mount point. If the B<MS_REC> flag is also specified in I<mountflags>, then the propagation type of all mount points under I<target> is also changed.
de: Standardmäßig betrifft die Änderung des Ausbreitungstyps nur den I<Ziel>-Einhängepunkt. Falls auch der Schalter B<MS_REC> in I<Einhängeschalter> angegeben ist, dann wird der Ausbreitungstyp aller Einhängepunkte unter I<Ziel> auch geändert.
fr: Par défaut, la modification du type de propagation ne concerne que le point de montage I<target>. Si l'attribut B<MS_REC> est aussi indiqué dans I<mountflags>, le type de propagation de tous les points de montage de I<target> est aussi modifié.
it: In modo predefinito, il cambio del tipo di condivisione influisce solo sul punto di montaggio I<target>. Se viene specificato anche il flag B<MS_REC> in I<mountflags>, viene cambiato anche il tipo di condivisione di tutti i punti di montaggio sotto I<target>.
uk: Типово, зміна типу поширення стосується лише точку монтування I<ціль>. Якщо також вказано прапорець B<MS_REC> у I<прапорці_монтування>, буде також змінено тип поширення для усіх точок монтувань у I<цілі>.

source: If I<mountflags> contains the flag B<MS_MOVE> (available since Linux 2.4.18), then move a subtree: I<source> specifies an existing mount point and I<target> specifies the new location to which that mount point is to be relocated. The move is atomic: at no point is the subtree unmounted.
de: Falls I<Einhängeschalter> den Schalter B<MS_MOVE> enthält (verfügbar seit Linux 2.4.18), dann wird ein Unterbaum verschoben. I<Quelle> gibt einen existierenden Einhängepunkt und I<Ziel> den neuen Ort an, zu dem der bestehende Einhängpunkt hin verlegt werden soll. Das Verschieben ist atomar: Das Unterbaum wird zu keinem Zeitpunkt ausgehängt.
fr: Si I<mountflags> contient l'attribut B<MS_MOVE> (disponible depuis linux 2.4.18), déplacer une sous-arborescence : I<source> indique un point de montage existant et I<target> le nouvel emplacement où replacer le point de montage. Le déplacement est atomique : à aucun moment la sous-arborescence n'est démontée.
it: Se I<mountflags> contiene il flag B<MS_MOVE> (disponibile a partire da Linux 2.4.18), viene spostato un sottoalbero: I<source> specifica un punto di montaggio esistente e I<target> specifica la nuova posizione nella quale dev'essere ricollocato quel punto di montaggio. Lo spostamento avviene senza soluzione di continuità: il sottoalbero non viene mai smontato.
uk: Якщо I<прапорці_монтування> містить прапорець B<MS_MOVE> (доступний з версії Linux 2.4.18), пересунути підлеглу ієрархію: I<джерело> вказує на наявне монтування, а I<ціль> вказує нове місце, до якого має бути переміщено монтування. Пересування є атомарним: без точки підлеглу ієрархією буде демонтовано.

source: Creating a new mount point
de: Erstellung eines neuen Einhängepunktes
fr: Création d'un nouveau point de montage
it: Creare un nuovo punto di montaggio
uk: Створення точки монтування

source: If none of B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> is specified in I<mountflags>, then B<mount>() performs its default action: creating a new mount point. I<source> specifies the source for the new mount point, and I<target> specifies the directory at which to create the mount point.
de: Falls kein Schalter aus B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> und B<MS_UNBINDABLE> in I<Einhängeschalter> angegeben ist, führt B<mount>() seine Vorgabeaktion aus: Erstellung eines neuen Einhängepunktes. I<Quelle> gibt die Quelle für den neuen Einhängepunkt an und I<Ziel> gibt das Verzeichnis an, an dem der Einhängepunkt erstellt werden soll.
fr: Si ni B<MS_REMOUNT>, ni B<MS_BIND>, ni B<MS_MOVE>, ni B<MS_SHARED>, ni B<MS_PRIVATE>, ni B<MS_SLAVE> ni B<MS_UNBINDABLE> ne sont indiqués dans I<mountflags>, B<mount>() opère son action par défaut : créer un nouveau point de montage. I<source> indique la source du nouveau point de montage et I<target> indique le répertoire où créer le point de montage.
it: Se nessuno di questi flag B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> o B<MS_UNBINDABLE> viene specificato in I<mountflags>, B<mount>() esegue la sua azione predefinita: creare un nuovo punto di montaggio. I<source> specifica l'origine per il nuovo punto di montaggio, e I<target> specifica la directory nella quale creare il punto di montaggio.
uk: Якщо не вказано жодного з прапорців B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> і B<MS_UNBINDABLE> у I<прапорцях_монтування>, B<mount>() виконає типову дію: створення монтування I<Джерело> вказує на джерело для нового монтування, а I<ціль> вказує на каталог, у якому слід створити точку монтування.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.
fr: En cas de succès, zéro est renvoyé. En cas d'erreur, B<-1> est renvoyé et I<errno> reçoit une valeur adéquate.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato di conseguenza.
uk: Якщо функцію буде успішно виконано, буде повернуто нуль. Якщо станеться помилка, буде повернуто -1 і належним чином встановлено I<errno>.

source: A move operation (B<MS_MOVE>) was attempted, but the mount tree under I<source> includes unbindable mounts and I<target> is a mount point that has propagation type B<MS_SHARED>.
de: Eine Verschiebeaktion (B<MS_MOVE>) wurde versucht, aber der Einhängebaum unter I<Quelle> enthält nicht bindbare Einhängungen und I<Ziel> ist ein Einhängepunkt, der den Ausbreitungstyp B<MS_SHARED> hat.
fr: Tentative d'une opération de déplacement (B<MS_MOVE>), mais l'arborescence de montage sous I<source> comprend des montages impossibles à monter en miroir et I<target> est un point de montage dont le type de propagation est B<MS_SHARED>.
it: È stato tentata un'operazione di spostamento (B<MS_MOVE>), ma l'albero di montaggio sotto I<source> include montaggi non condivisibili (unbindable) e I<target> è un punto di montaggio che ha una propagazione di tipo B<MS_SHARED>.
uk: Було виконано спробу пересування (B<MS_MOVE>), але в ієрархії монтування у I<джерело> включено непридатні до прив'язування монтування, а I<ціль> є монтуванням, типом поширення якого є B<MS_SHARED>.

source: A move operation (B<MS_MOVE>) was attempted, but I<source> was not a mount point, or was \(aq/\(aq.
de: Eine Verschiebeaktion (B<MS_MOVE>) wurde versucht, aber I<Quelle> war kein Einhängepunkt oder war »/«.
fr: Tentative d'opération de déplacement (B<MS_MOVE>) mais I<source> n'était pas un point de montage ou il valait « / ».
it: È stata tentata un'operazione di spostamento (B<MS_MOVE>), ma I<source> non era un punto di montaggio, o era \(aq/\(aq.
uk: Було виконано спробу пересування (B<MS_MOVE>), але I<джерело> не було монтуванням або було «/».

source: CONFORMING TO
de: KONFORM ZU
fr: CONFORMITÉ
it: CONFORME A
uk: ВІДПОВІДНІСТЬ

source: Parental relationship between mount points
de: Elterliche Beziehung zwischen Einhängepunkten
fr: Relation de parenté entre les points de montage
it: Relazioni parentali tra punti di montaggio
uk: Батьківські зв'язки між точками монтування

source: Each mount point has a parent mount point. The overall parental relationship of all mount points defines the single directory hierarchy seen by the processes within a mount namespace.
de: Jeder Einhängepunkt hat einen Eltern-Einhängepunkt. Die allgemeine elterliche Beziehung aller Einhängepunkte definiert die einzelne Verzeichnishierarchie, wie sie Prozesse innerhalb eines Einhänge-Namensraums sehen.
fr: Chaque point de montage a un point de montage parent. La relation de parenté entre tous les points de montage définit la seule hiérarchie de répertoires que voient les processus à l'intérieur d'un espace de noms montage.
it: Ogni punto di montaggio ha un punto di montaggio genitore. La relazione globale fra tutti i punti di montaggio definisce la singola gerarchia delle directory visibile dai processi all'interno di uno spazio dei nomi di montaggio.
uk: У кожного монтування є батьківське монтування. Загалом, родинні зв'язки усіх монтувань визначають єдину ієрархію каталогів, яку бачать процес у просторі назв монтування.
