Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem. In addition, SELinux domain transitions require the permission I<nosuid_transition>, which in turn needs also the policy capability I<nnp_nosuid_transition>.
de: Die Bits set-user-ID und set-group-ID oder Datei-Capabilities nicht berücksichtigen, wenn Programme aus diesem Dateisystem ausgeführt werden. Außerdem erfordern SELinux-Domain-Übergänge das Zugriffsrecht I<nosuid_transition>, welches seinerseits das Regel-Capability I<nnp_nosuid_transition> erfordert.
uk: Не брати до уваги біти set-user-ID і set-group-ID або можливості файла при виконанні програм з цієї файлової системи. Крім того, переходи домену SELinux потребують прав доступу I<nosuid_transition>, що потребує можливості правил I<nnp_nosuid_transition>.

source: Mount filesystem read-only.
de: Dateisystem nur zum Lesen einhängen.
fr: Monter le système de fichiers en lecture seule.
it: Monta il filesystem in sola lettura.
uk: Змонтувати файлову систему в режимі тільки читання.

source: B<MS_REC> (since Linux 2.4.11)
de: B<MS_REC> (seit Linux 2.4.11)
fr: B<MS_REC> (depuis Linux 2.4.11)
it: B<MS_REC> (a partire da Linux 2.4.11)
uk: B<MS_REC> (починаючи з Linux 2.4.11)

source: Used in conjunction with B<MS_BIND> to create a recursive bind mount, and in conjunction with the propagation type flags to recursively change the propagation type of all of the mounts in a subtree. See below for further details.
de: Wird zusammen mit B<MS_BIND> verwandt, um eine rekursive Bind-Einhängung zu erstellen und im Zusammenhang mit Ausbreitungstypschaltern, um rekursiv den Ausbreitungstyp aller Einhängungen in einem Unterbaum zu ändern. Details sind weiter unten beschrieben.
fr: Utilisé avec B<MS_BIND> pour créer un montage miroir récursif, et ajouté aux attributs de type de propagation, pour modifier récursivement le type de propagation de tous les montages d'une sous-arborescence. Voir ci-dessous pour plus de détails.
it: Usata insieme a B<MS_BIND> per creare un montaggio "bind" ricorsivo, e assieme ai flag per il tipo di condivisione per cambiare ricorsivamente il tipo di condivisione di tutti i montaggi in un sottoalbero. Vedere più avanti per ulteriori dettagli.
uk: Використовують у поєднанні із B<MS_BIND> для створення монтування з прив'язкою і у поєднанні із прапорцями типу поширення для рекурсивної зміни типу поширення усіх монтувань у піддереві. Див. нижче, щоб дізнатися більше.

source: B<MS_RELATIME> (since Linux 2.6.20)
de: B<MS_RELATIME> (seit Linux 2.6.20)
fr: B<MS_RELATIME> (depuis Linux 2.6.20)
it: B<MS_RELATIME> (a partire da Linux 2.6.20)
uk: B<MS_RELATIME> (починаючи з Linux 2.6.20)

source: When a file on this filesystem is accessed, update the file's last access time (atime) only if the current value of atime is less than or equal to the file's last modification time (mtime) or last status change time (ctime). This option is useful for programs, such as B<mutt>(1), that need to know when a file has been read since it was last modified. Since Linux 2.6.30, the kernel defaults to the behavior provided by this flag (unless B<MS_NOATIME> was specified), and the B<MS_STRICTATIME> flag is required to obtain traditional semantics. In addition, since Linux 2.6.30, the file's last access time is always updated if it is more than 1 day old.
de: Wenn auf eine Datei auf diesem Dateisystem zugegriffen wird, nur die letzte Zugriffzeit der Datei (atime) aktualisieren, falls der aktuelle Wert von »atime« kleiner oder gleich der letzten Änderungszeit der Datei (mtime) oder der Zeit der letzten Statusänderung (ctime) ist. Diese Option ist für Programme wie B<mutt>(1) sinnvoll, die wissen müssen, ob eine Datei seit der letzten Änderung gelesen wurde. Seit Linux 2.6.30 verhält sich der Kernel wie es dieser Schalter vorgibt (falls nicht B<MS_NOATIME> angegeben wurde) und der Schalter B<MS_STRICTATIME> wird benötigt, um traditionelle Semantiken zu erhalten. Zusätzlich wird seit Linux 2.6.30 die letzte Zugriffszeit der Datei immer aktualisiert, wenn sie älter als einen Tag ist.
fr: Lorsqu'un fichier sur ce système de fichiers est utilisé, ne mettre à jour sa date d'accès (atime) que si la valeur actuelle de atime est inférieure ou égale à sa date de dernière modification (mtime) ou de changement d'état (ctime). Cette option est utile pour les programmes tels que B<mutt>(1) qui veulent savoir si un fichier a été lu depuis sa dernière modification. Depuis Linux\ 2.6.30, les noyaux suivent le comportement fourni par cet attribut (à moins que B<MS_NOATIME> soit indiqué), et l’attribut B<MS_STRICTATIME> est nécessaire pour avoir la sémantique traditionnelle. De plus, depuis Linux\ 2.6.30, la date du dernier accès à un fichier est toujours mise à jour s'il est plus ancienne d'un jour.
it: Quando si accede a un file in questo filesystem, aggiorna l'ora dell'ultimo accesso al file (atime) solo se il valore attuale di atime è minore o uguale a quello dell'ultima modifica del file (mtime) o all'ora dell'ultimo cambiamento di stato (ctime). Quest'opzione è utile per programmi come B<mutt>(1), che hanno bisogno di sapere quando un file è stato letto dopo l'ultima modifica. A partire da Linux 2.6.30, il kernel rende predefinito il comportamento fornito da questo flag (a meno che non sia stata specificato B<MS_NOATIME>), e il flag B<MS_STRICTATIME> è richiesto per ottenere il comportamento tradizionale. Inoltre, a partire da Linux 2.6.30, il tempo dell'ultimo accesso al file viene sempre aggiornato se risale a più di 1 giorno prima.
uk: Якщо буде виконано доступ до файла у цій файловій системі, оновити час останнього доступу до файла (atime), лише якщо поточне значення atime є меншим або рівним за час останнього внесення змін до файла (mtime) або час останньої зміни стану (ctime). Цей параметр корисний для програм, зокрема B<mutt>(1), які потребують даних щодо того, коли було прочитано файл з часу останнього внесення змін до нього. Починаючи з версії Linux 2.6.30, типовою поведінкою ядра є поведінка, яка забезпечується цим прапорцем (якщо не вказано B<MS_NOATIME>), а для отримання традиційної семантики потрібен прапорець B<MS_STRICTATIME>. Крім того, починаючи з версії Linux 2.6.30, час останнього доступу до файла завжди оновлюється, якщо його вік перевищує 1 день.

source: B<MS_SILENT> (since Linux 2.6.17)
de: B<MS_SILENT> (seit Linux 2.6.17)
fr: B<MS_SILENT> (depuis Linux 2.6.17)
it: B<MS_SILENT> (a partire da Linux 2.6.17)
uk: B<MS_SILENT> (починаючи з Linux 2.6.17)

source: Suppress the display of certain (I<printk>()) warning messages in the kernel log. This flag supersedes the misnamed and obsolete B<MS_VERBOSE> flag (available since Linux 2.4.12), which has the same meaning.
de: Die Anzeige bestimmter Warnungen (I<printk>()) im Kernel-Protokoll unterdrücken. Dieser Schalter ersetzt den falsch benannten und veralteten Schalter B<MS_VERBOSE> (verfügbar seit Linux 2.4.12), der die gleiche Bedeutung hat.
fr: Supprimer l'affichage de certains messages d'avertissement (I<printk>()) dans le journal noyau. Cet attribut remplace l'attribut B<MS_VERBOSE> qui avait un mauvais nom et est obsolète (il était disponible depuis Linux 2.4.12), et qui a la même signification.
it: Sopprime la visualizzazione di alcuni messaggi di avvertimento (I<printk>()) nelle registrazioni del kernel.Questo flag sostituisce il flag (disponibile da Linux 2.4.12) B<MS_VERBOSE>, che ha lo stesso significato.
uk: Придушити виведення певних (I<printk>()) повідомлень-попереджень до журналу ядра. Цей прапорець став замінником помилково названого та застарілого прапорця B<MS_VERBOSE> (доступного з часу появи Linux 2.4.12), який мав те саме призначення.

source: B<MS_STRICTATIME> (since Linux 2.6.30)
de: B<MS_STRICTATIME> (seit Linux 2.6.30)
fr: B<MS_STRICTATIME> (depuis Linux 2.6.30)
it: B<MS_STRICTATIME> (a partire da Linux 2.6.30)
uk: B<MS_STRICTATIME> (починаючи з Linux 2.6.30)

source: Always update the last access time (atime) when files on this filesystem are accessed. (This was the default behavior before Linux 2.6.30.) Specifying this flag overrides the effect of setting the B<MS_NOATIME> and B<MS_RELATIME> flags.
de: Die letzte Zugriffszeit (atime) immer aktualisieren, wenn auf Dateien auf diesem Dateisystem zugegriffen wird (dies war das Standardverhalten vor Linux 2.6.30). Die Angabe dieses Schalters überschreibt den Effekt der Schalter B<MS_NOATIME> und B<MS_RELATIME>.
fr: Toujours mettre à jour la date du dernier d'accès (atime) lorsque des fichiers sur le système de fichiers sont lus (c'était le comportement par défaut avant Linux\ 2.6.30). Indiquer cet attribut annule l'effet des attributs B<MS_NOATIME> et B<MS_RELATIME>.
it: L'ultimo tempo di accesso è sempre aggiornato (atime) quando i file su questo filesystem sono acceduti. (Questo era il comportamento predefinito prima di Linux 2.6.30.) Specificando questo flag l'effetto dell'impostazione dei flag B<MS_NOATIME> e B<MS_RELATIME> viene ignorato.
uk: Завжди оновлювати час останнього доступу (atime) при доступі до файлів у цій файловій системі. (Це типова поведінка ядра до Linux 2.6.30.) Визначення цього прапорця перевизначає ефект встановлення прапорців B<MS_NOATIME> і B<MS_RELATIME>.

source: Make writes on this filesystem synchronous (as though the B<O_SYNC> flag to B<open>(2) was specified for all file opens to this filesystem).
de: Schreiben auf diesem Dateisystem synchronisieren (als ob der Schalter B<O_SYNC> für B<open>(2) für alle offenen Dateien auf diesem Dateisystem angegeben worden wäre).
fr: Rendre synchrones les écritures sur le système de fichiers (comme si l'option B<O_SYNC> de B<open>(2) était indiquée à chaque appel sur ce système de fichiers).
it: Rende sincrone le scritture su questo filesystem (come se il flag B<O_SYNC> di B<open>(2) fosse specificata per tutti i file aperti in questo filesystem).
uk: Зробити запис у цій файловій системі синхронним (наче вказано прапорець B<O_SYNC> B<open>(2) для усіх відкриттів файлів у цій файловій системі).

source: B<MS_NOSYMFOLLOW> (since Linux 5.10)
de: B<MS_NOSYMFOLLOW> (seit Linux 5.10)
fr: B<MS_NOSYMFOLLOW> (depuis Linux 5.10)
it: B<MS_NOSYMFOLLOW> (a partire da Linux 5.10)
uk: B<MS_NOSYMFOLLOW> (починаючи з Linux 5.10)

source: Do not follow symbolic links when resolving paths. Symbolic links can still be created, and B<readlink>(1), B<readlink>(2), B<realpath>(1), and B<realpath>(3) all still work properly.
de: Beim Auflösen von Pfaden keinen Symlinks folgen. Symlinks können noch angelegt werden und B<readlink>(1), B<readlink>(2), B<realpath>(1) und B<realpath>(3) werden noch korrekt funktionieren.
fr: Ne pas suivre les liens symboliques lors de la résolution des chemins. Des liens symboliques peuvent toujours être créés et B<readlink>(1), B<readlink>(2), B<realpath>(1) ainsi que B<realpath>(3) fonctionneront encore correctement.
it: Non segue i collegamenti simbolici nella risoluzione dei percorsi. I collegamenti simbolici possono essere sempre creati, e B<readlink>(1), B<readlink>(2), B<realpath>(1) e B<realpath>(3) continueranno a funzionare in modo appropriato.
uk: Не переходити за символічними посиланням при визначенні шляхів. Попри це, символічні посилання можна буде створювати, а B<readlink>(1), B<readlink>(2), B<realpath>(1) і B<realpath>(3) працюватимуть належним чином.

source: From Linux 2.4 onward, some of the above flags are settable on a per-mount basis, while others apply to the superblock of the mounted filesystem, meaning that all mounts of the same filesystem share those flags. (Previously, all of the flags were per-superblock.)
de: Seit Linux 2.4 können einige der obigen Schalter pro Einhängepunkt gesetzt werden, während andere für den Superblock des eingehängten Dateisystems gelten, was bedeutet, dass alle Einhängungen des gleichen Dateisystems diese Schalter gemeinsam benutzen (vorher waren alle Schalter superblockabhängig).
fr: De Linux 2.4 jusqu'à aujourd'hui, certains des attributs ci-dessus sont positionnables sur une base par montage, tandis que d'autres s'appliquent au superbloc du système de fichier monté, ce qui veut dire que tous les montages du même système de fichiers partagent ces attributs (précédemment, tous les attributs étaient sur une base par superbloc).
it: Da Linux 2.4 in poi, alcuni dei flag visti sopra sono impostabili a livello di ogni singolo montaggio, mentre altri si applicano al superblocco del filesystem montato, il che vuol dire che tutti i montaggi dello stesso filesystem condividono tali flag. (Precedentemente, tutti i flag erano a livello di superblocco.)
uk: Починаючи з Linux 2.4, деякі з вказаних вище прапорців можна встановити на основі окремих монтувань, а інші застосувати до суперблоку змонтованої файлової системи, що означає, що усі монтування тієї самої файлової системи спільно використовують ці прапорці. (У попередніх версіях усі прапорці застосовувалися на рівні суперблоку.)

source: The per-mount-point flags are as follows:
de: Die einhängepunktabhängigen Schalter haben folgende Bedeutung:
fr: Les attributs par point de montage sont les suivants\ :
it: I flag per singolo punto di montaggio sono i seguenti:
uk: Прапорці для окремих точок монтування є такими:

source: Since Linux 2.4: B<MS_NODEV>, B<MS_NOEXEC>, and B<MS_NOSUID> flags are settable on a per-mount-point basis.
de: Seit Linux 2.4: Die Schalter B<MS_NODEV>, B<MS_NOEXEC> und B<MS_NOSUID> sind pro Einhängepunkt setzbar.
fr: Depuis Linux 2.4 : les attributs B<MS_NODEV>, B<MS_NOEXEC> et B<MS_NOSUID> sont positionnables sur une base par point de montage.
it: Da Linux 2.4: B<MS_NODEV>, B<MS_NOEXEC> e B<MS_NOSUID> possono essere impostati a livello di ogni singolo punto di montaggio.
uk: Починаючи з версії Linux 2.4, прапорці B<MS_NODEV>, B<MS_NOEXEC> і B<MS_NOSUID> встановлюються на рівні точки монтування.

source: Additionally, since Linux 2.6.16: B<MS_NOATIME> and B<MS_NODIRATIME>.
de: Zusätzlich seit Linux 2.6.16: B<MS_NOATIME> und B<MS_NODIRATIME>.
fr: En outre, depuis Linux 2.6.20 : B<MS_RELATIME> et B<MS_NODIRATIME>.
it: Inoltre, dal kernel 2.6.16: B<MS_NOATIME> e B<MS_NODIRATIME>.
uk: Додатково, починаючи з Linux 2.6.16: B<MS_NOATIME> і B<MS_NODIRATIME>.

source: Additionally, since Linux 2.6.20: B<MS_RELATIME>.
de: Zusätzlich seit Linux 2.6.20: B<MS_RELATIME>.
fr: De plus, depuis Linux 2.6.20 : B<MS_RELATIME>.
it: Inoltre, da Linux 2.6.20: B<MS_RELATIME>.
uk: Додатково, починаючи з Linux 2.6.20: B<MS_RELATIME>.

source: The following flags are per-superblock: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT>, and B<MS_SYNCHRONOUS>. The initial settings of these flags are determined on the first mount of the filesystem, and will be shared by all subsequent mounts of the same filesystem. Subsequently, the settings of the flags can be changed via a remount operation (see below). Such changes will be visible via all mounts associated with the filesystem.
de: Die folgenden Schalter sind pro Superblock: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> und B<MS_SYNCHRONOUS>. Die anfänglichen Einstellungen dieser Schalter werden bei der ersten Einhängung des Dateisystems bestimmt und werden von allen nachfolgenden Einhängungen des gleichen Dateisystems mitbenutzt. Als Folge davon können die Einstellungen dieser Schalter mittels einer Neueinhängungsaktion (siehe unten) geändert werden. Solche Änderungen werden auf allen Einhängungen, die diesem Dateisystem zugeordnet sind, sichtbar.
uk: Для окремих суперблоків застосовуються такі прапорці: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_SILENT> і B<MS_SYNCHRONOUS>. Початкові значення цих прапорців визначаються при першому монтуванні файлової системи. Їх буде використано для усіх наступних монтувань тієї самої файлової системи. Надалі, параметри прапорців може бути змінено дією з повторного монтування (див. нижче). Такі зміни стануть видимими через усі монтування, які пов'язано із файловою системою.

source: Since Linux 2.6.16, B<MS_RDONLY> can be set or cleared on a per-mount-point basis as well as on the underlying filesystem superblock. The mounted filesystem will be writable only if neither the filesystem nor the mountpoint are flagged as read-only.
de: Seit Linux 2.6.16 kann B<MS_RDONLY> sowohl auf einer einhängepunktabhängigen Basis als auch auf den unterliegenden Dateisystemsuperblock (zurück)gesetzt werden. Das eingehängte Dateisystem wird nur schreibbar sein, falls weder das Dateisystem noch der Einhängepunkt als nur-lesbar gekennzeichnet sind.
fr: Depuis Linux 2.6.16, B<MS_RDONLY> peut être positionné ou effacé sur une base par point de montage ou par superbloc du système de fichiers sous-jacent. Le système de fichiers monté ne sera accessible en écriture que si ni lui, ni le point de montage, n'ont l’attribut de lecture seule.
it: Da Linux 2.6.16 B<MS_RDONLY> può essere impostato o annullato a livello di ogni singolo punto di montaggio, nonché a livello del superblocco del filesystem sottostante. Il filesystem montato sarà scrivibile solo se né il filesystem né il punto di montaggio sono marcati come di sola lettura.
uk: Починаючи з Linux 2.6.16, B<MS_RDONLY> можна встановлювати або знімати на основі окремої точки монтування, а також суперблоку базової файлової системи. Змонтована файлова система буде придатною до запису, лише якщо ні файлову систему, ні точку монтування буде позначено прапорцем «лише для читання».

source: Remounting an existing mount
de: Eine existierende Einhängung erneut einhängen
fr: Remontage d'un montage existant
it: Rimontare un montaggio esistente
uk: Повторне монтування наявного монтування

source: An existing mount may be remounted by specifying B<MS_REMOUNT> in I<mountflags>. This allows you to change the I<mountflags> and I<data> of an existing mount without having to unmount and remount the filesystem. I<target> should be the same value specified in the initial B<mount>() call.
de: Die existierende Einhängung kann erneut eingehängt werden, indem B<MS_REMOUNT> in den I<Einhängeschaltern> angegeben wird. Dies erlaubt Ihnen, die I<Einhängeschalter> und I<Daten> von einer existierenden Einhängung zu ändern, ohne das Dateisystem aus- und wieder einzuhängen. I<Ziel> sollte der gleiche Wert sein, wie beim anfänglichen Aufruf von B<mount>() angegeben wurde.
fr: Un montage existant peut être remonté en utilisant B<MS_REMOUNT> dans I<mountflags>. Cela permet de modifier I<mountflags> et I<data> du montage existant sans être obligé de démonter et de remonter le système de fichiers. I<target> devrait valoir la même valeur que celle indiquée dans l'appel B<mount>() initial.
it: Un montaggio esistente può essere montato di nuovo specificando B<MS_REMOUNT> in I<mountflags>. Questo permette di cambiare I<mountflags> e i I<dati> di un montaggio già in essere senza dover smontare e rimontare il filesystem. I<target> deve avere gli stessi valori specificati nella chiamata B<mount>() iniziale.
uk: Наявне монтування можна повторно змонтувати, вказавши B<MS_REMOUNT> у I<mountflags>. Це надає вам змогу змінювати I<прапорці_монтування> та I<дані> наявного монтування без виконання демонтування і повторного монтування файлової системи. I<ціль> повинна мати таке саме значення, що і у початковому виклику B<mount>().

source: The I<source> and I<filesystemtype> arguments are ignored.
de: Die Argumente I<Quelle> und I<Dateisystemtyp> werden ignoriert.
fr: Les arguments I<source> et I<filesystemtype> sont ignorés.
it: Gli argomenti I<source> e I<filesystemtype> sono ignorati.
uk: Аргументи I<джерело> і I<тип_файлової_системи> буде проігноровано.

source: The I<mountflags> and I<data> arguments should match the values used in the original B<mount>() call, except for those parameters that are being deliberately changed.
de: Die Argumente I<Einhängeschalter> und I<Daten> sollten den im originalen B<mount>()-Aufruf verwendeten Werten entsprechen, außer für jene Parameter, die bewusst geändert werden.
fr: Les arguments I<mountflags> et I<data> devraient correspondre aux valeurs utilisées dans l'appel B<mount>() originel, sauf ceux qui seront délibérément modifiés.
it: Gli argomenti I<mountflags> e I<data> dovrebbero corrispondere ai valori nella chiamata B<mount>() originale, ad eccezione dei parametri che si desidera modificare.
uk: Аргументи I<прапорці_монтування> і I<дані> мають збігатися за значеннями з початковим викликом B<mount>(), окрім тих параметрів, які має бути змінено.

source: The following I<mountflags> can be changed: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (whose effect is to clear the B<MS_NOATIME> and B<MS_RELATIME> flags), and B<MS_SYNCHRONOUS>. Attempts to change the setting of the B<MS_DIRSYNC> and B<MS_SILENT> flags during a remount are silently ignored. Note that changes to per-superblock flags are visible via all mounts of the associated filesystem (because the per-superblock flags are shared by all mounts).
de: Die folgenden I<Einhängeschalter> können geändert werden: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (der bewirkt, dass die Schalter B<MS_NOATIME> und B<MS_RELATIME> bereinigt werden) und B<MS_SYNCHRONOUS>. Versuche, die Einstellung der Schalter B<MS_DIRSYNC> und B<MS_SILENT> während einer wiederholten Einhängung zu ändern, werden ohne Rückmeldung ignoriert. Beachten Sie, dass Änderungen der superblockbezogenen Schalter über alle Einhängungen der zugeordneten Dateisysteme hinweg sichtbar sind (da die superblockbezogenen Schalter von allen Einhängungenen gemeinsam benutzt werden).
uk: Можна змінювати такі I<прапорці_монтування>: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (результатом зміни буде зняття прапорців B<MS_NOATIME> і B<MS_RELATIME>) і B<MS_SYNCHRONOUS>. Спроби змінити значення прапорців B<MS_DIRSYNC> і B<MS_SILENT> під час повторного монтування без питань буде проігноровано. Зауважте, що зміни до прапорців окремих суперблоків можна буде переглянути за усіма монтуваннями пов'язаної файлової системи (оскільки прапорці для окремих суперблоків спільно використовуються усіма монтуваннями).

source: Since Linux 3.17, if none of B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>, or B<MS_STRICTATIME> is specified in I<mountflags>, then the remount operation preserves the existing values of these flags (rather than defaulting to B<MS_RELATIME>).
de: Seit Linux 3.17 hält die Neueinhänge-Aktion die bestehenden Werte der Schalter B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME> und B<MS_STRICTATIME> bei, falls keiner davon explizit angegeben wurde, statt als Vorgabe B<MS_RELATIME> zu verwenden.
fr: Depuis Linux 3.17, si ni B<MS_NOATIME>, ni B<MS_NODIRATIME>, ni B<MS_RELATIME>, ni B<MS_STRICTATIME> n'est indiqué dans I<mountflags>, l'opération de remontage préserve les valeurs existantes de ces attributs (au lieu de revenir à B<MS_RELATIME> par défaut).
it: A partire da Linux 3.17, se nessuno tra B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>, or B<MS_STRICTATIME> viene specificato in I<mountflags>, l'operazione di rimontaggio preserva i valori esistenti di questi flag (piuttosto che impostarli al valore predefinito B<MS_RELATIME>).
uk: Починаючи з Linux 3.17, якщо не вказано жодного з прапорців B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME> і B<MS_STRICTATIME> у I<прапорцях_монтування>, дія з повторного монтування зберігатиме наявні значення цих прапорців (а не використовуватиме типове значення B<MS_RELATIME>).
