Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)
uk: Сторінки підручника Linux (не випущене)

source: NAME
de: BEZEICHNUNG
fr: NOM
it: NOME
uk: НАЗВА

source: mount - mount filesystem
de: mount - Dateisystem einhängen
fr: mount - Monter un système de fichiers
it: mount - monta i filesystem
uk: mount — змонтувати файлову систему

source: LIBRARY
de: BIBLIOTHEK
uk: БІБЛІОТЕКА

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)
uk: Стандартна бібліотека C (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT
it: SINTASSI
uk: КОРОТКИЙ ОПИС

source: B<int mount(const char *>I<source>B<, const char *>I<target>B<,> B< const char *>I<filesystemtype>B<, unsigned long >I<mountflags>B<,> B< const void *>I<data>B<);>
de: B<int mount(const char *>I<Quelle>B<, const char *>I<Ziel>B<,> B< const char *>I<Dateisystemtyp>B<,> B< unsigned long >I<Einhängeschalter>B<,> B< const void *>I<Daten>B<);>
uk: B<int mount(const char *>I<джерело>B<, const char *>I<ціль>B<,> B< const char *>I<тип_файлової_системи>B<, unsigned long >I<прапорці_монтування>B<,> B< const void *>I<дані>B<);>

source: DESCRIPTION
de: BESCHREIBUNG
it: DESCRIZIONE
uk: ОПИС

source: B<mount>() attaches the filesystem specified by I<source> (which is often a pathname referring to a device, but can also be the pathname of a directory or file, or a dummy string) to the location (a directory or file) specified by the pathname in I<target>.
de: B<mount>() hängt das als I<Quelle> angegebene Dateisystem (was oft ein Pfadname, der sich auf ein Gerät bezieht, ist; es kann aber auch der Pfadname eines Verzeichnisses oder einer Datei oder eine Platzhalterzeichenkette sein) an dem durch den Pfadnamen in I<Ziel> angegebenen Ort (einem Verzeichnis oder einer Datei) ein.
fr: B<mount>() attache le système de fichiers indiqué par I<source> (qui est généralement un nom de périphérique, mais peut aussi être un répertoire ou un objet fictif) à un emplacement (un répertoire ou à un fichier) indiqué par le chemin dans I<target>.
it: B<mount>() collega il filesystem specificato da I<source> (che è spesso un nome di percorso che individua un dispositivo, ma può anche essere il nome di percorso di una directory o di un file, o una stringa fittizia) alla posizione (una directory o un file) specificata dal nome di percorso in I<target>.
uk: B<mount>() долучає файлову систему, яку вказано як I<джерело> (яка часто є шляхом, який посилається на пристрій, але також може бути шляхом до каталогу або файла або фіктивним рядком), до місця (каталогу або файла), який вказано шляхом I<ціль>.

source: Appropriate privilege (Linux: the B<CAP_SYS_ADMIN> capability) is required to mount filesystems.
de: Zum Einhängen von Dateisystemen sind geeignete Rechte erforderlich (Linux: B<CAP_SYS_ADMIN>-Capability).
fr: Des privilèges appropriés (sous Linux\ : la capacité B<CAP_SYS_ADMIN>) sont nécessaires pour monter des systèmes de fichiers.
it: Per montare dei filesystem è necessario avere le autorizzazioni adeguate (Linux: la funzionalità B<CAP_SYS_ADMIN>).
uk: Для монтування файлових систем потрібні відповідні права доступу (Linux: можливість B<CAP_SYS_ADMIN>).

source: Values for the I<filesystemtype> argument supported by the kernel are listed in I</proc/filesystems> (e.g., "btrfs", "ext4", "jfs", "xfs", "vfat", "fuse", "tmpfs", "cgroup", "proc", "mqueue", "nfs", "cifs", "iso9660"). Further types may become available when the appropriate modules are loaded.
de: Die Werte für das Argument I<dateisystemtyp>, die der Kernel unterstützt, werden in I</proc/filesystems> aufgelistet (z.B. »btrfs«, »ext4«, »jfs«, »xfs«, »vfat«, »fuse«, »tmpfs«, »cgroup«, »proc«, »mqueue«, »nfs«, »cifs«, »iso9660« ). Weitere Typen könnten verfügbar werden, wenn geeignete Module geladen sind.
fr: Les valeurs de l'argument I<filesystemtype> prises en charge par le noyau sont listées dans I</proc/filesystems> (par exemple « btrfs » «\ ext4\ », «\ jfs\ », «\ xfs\ », «\ vfat\ », «\ fuse\ », «\ tmpfs\ », «\ cgroup\ », «\ proc\ », « mqueue », « nfs », « fifs », « iso9660 »). Des types supplémentaires peuvent être disponibles lorsque les modules appropriés sont chargés.
it: I valori dell'argomento I<filesystemtype> supportati dal kernel sono elencati in I</proc/filesystems> (p.es, "btrfs", "ext4", "jfs", "xfs", "vfat", "fuse", "tmpfs", "cgroup", "proc", "mqueue", "nfs", "cifs", "iso9660"). Ulteriori tipi di filesystem possono essere resi disponibili se sono stati caricati i moduli appropriati.
uk: Список значень для аргументу I<тип_файлової_системи>, підтримку яких передбачено у ядрі системи, наведено у файлі I</proc/filesystems> (наприклад, "btrfs", "ext4", "jfs", "xfs", "vfat", "fuse", "tmpfs", "cgroup", "proc", "mqueue", "nfs", "cifs", "iso9660"). Доступ до додаткових типів можна отримати завантаженням відповідних модулів.

source: The I<data> argument is interpreted by the different filesystems. Typically it is a string of comma-separated options understood by this filesystem. See B<mount>(8) for details of the options available for each filesystem type. This argument may be specified as NULL, if there are no options.
de: Das Argument I<Daten> wird von den verschiedenen Dateisystemen interpretiert. Typischerweise ist es eine Zeichenkette aus Optionen, die durch Kommata getrennt sind und die von diesem Dateisystem verstanden werden. Lesen Sie B<mount>(8), um weitere Einzelheiten über die verfügbaren Optionen für jeden Dateisystemtyp zu erfahren. Falls es keine Optionen gibt, kann dieses Argument als NULL angegeben werden.
it: L'argomento I<data> è interpretato dai differenti filesystem. Tipicamente è una stringa di opzioni, separate da virgole, riconosciute da un determinato filesystem. Vedere B<mount>(8) per dettagli sulle opzioni disponibili per ciascun tipo di filesystem. Questo argomento può essere specificato come NULL, se non ci sono opzioni.
uk: Аргумент I<дані> буде оброблено по-різному різними файловими системами. Типово, це рядок відокремлених комами параметрів, які може бути оброблено для файлової системи. Див. B<mount>(8), щоб дізнатися більше про параметри, які доступні для кожного з типів файлових систем. Цей аргумент може мати значення NULL (бути порожнім), якщо параметрів не задано.

source: A call to B<mount>() performs one of a number of general types of operation, depending on the bits specified in I<mountflags>. The choice of which operation to perform is determined by testing the bits set in I<mountflags>, with the tests being conducted in the order listed here:
de: Ein Aufruf von B<mount>() führt eine aus einer Reihe von allgemeinen Aktionsarten durch, abhängig von den in I<Einhängeschalter> angegebenen Bits. Die Wahl der auszuführenden Aktion wird durch Testen der in I<Einhängeschalter> gesetzten Bits bestimmt, wobei die Tests in der hier aufgeführten Reihenfolge abgearbeitet werden:
fr: Un appel à B<mount>() effectue un des nombreux types généraux d'opération en fonction des bits indiqués dans I<mountflags>. Le choix de l'opération à effectuer se fait en testant l'ensemble de bits I<mountflags>, les tests étant menés dans l'ordre indiqué ici :
it: Una chiamata a B<mount>() esegue una tra le molte operazioni di tipo generale, basandosi sui bit specificati in I<mountflags>. La scelta dell'operazione da eseguire è determinata controllando i bit impostati in I<mountflags>, effettuando dei test nell'ordine qui elencato:
uk: Виклик B<mount>() виконує один із декількох загальних типів дій, залежно від бітів, які вказано аргументом I<прапорці_монтування>. Вибір дії, яку буде виконано, визначається перевіркою бітів, які встановлено в аргументі I<прапорці_монтування>. Перевірки виконуватимуться у такому порядку:

source: Remount an existing mount: I<mountflags> includes B<MS_REMOUNT>.
de: Eine bestehende Einhängung neu einhängen: I<Einhängeschalter> enthält B<MS_REMOUNT>.
fr: Remonter un montage existant : I<mountflags> inclut B<MS_REMOUNT>.
it: Rimontare un montaggio già in essere: I<mountflags> include B<MS_REMOUNT>.
uk: Повторно змонтувати наявне монтування: I<прапорці_монтування> включають B<MS_REMOUNT>.

source: Create a bind mount: I<mountflags> includes B<MS_BIND>.
de: Eine Bind-Einhängung erstellen: I<Einhängeschalter> enthält B<MS_BIND>.
fr: Créer un montage miroir : I<mountflags> inclut B<MS_BIND>.
it: Creare un montaggio di tipo bind: I<mountflags> include B<MS_BIND>.
uk: Створити монтування-прив'язку: I<прапорці_монтування> включають B<MS_BIND>.

source: Change the propagation type of an existing mount: I<mountflags> includes one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE>.
de: Den Ausbreitungstyp einer bestehenden Einhängung ändern: I<Einhängeschalter> enthält einen aus B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, B<MS_UNBINDABLE>.
fr: Modifier le type de propagation d'un montage existant : I<mountflags> inclut B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> ou B<MS_UNBINDABLE>.
it: Cambiare il tipo di propagazione di un montaggio esistente: I<mountflags> include uno tra B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> o B<MS_UNBINDABLE>.
uk: Змінити тип поширення наявного монтування: I<прапорці_монтування> включають один з прапорців B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> або B<MS_UNBINDABLE>.

source: Move an existing mount to a new location: I<mountflags> includes B<MS_MOVE>.
de: Eine bestehende Einhängung an einen neuen Ort verschieben: I<Einhängeschalter> enthält B<MS_MOVE>.
fr: Déplacer un point de montage existant vers un nouvel endroit : I<mountflags> inclut B<MS_MOVE>.
it: Spostare un montaggio esistente in una nuova posizione: I<mountflags> include B<MS_MOVE>.
uk: Пересунути наявне монтування до нового місця: I<прапорці_монтування> включають B<MS_MOVE>.

source: Create a new mount: I<mountflags> includes none of the above flags.
de: Eine neue Einhängung erstellen: I<Einhängeschalter> enthält keinen der obigen Schalter.
fr: Créer un nouveau montage : I<mountflags> n'inclut aucun des attributs ci-dessus.
it: Creare un nuovo montaggio: I<mountflags> non include nessuno dei flag di cui sopra.
uk: Створити монтування: I<прапорці_монтування> не містять жодного з наведених вище прапорців.

source: Each of these operations is detailed later in this page. Further flags may be specified in I<mountflags> to modify the behavior of B<mount>(), as described below.
de: Jede dieser Aktionen wird später auf dieser Seite genauer beschrieben. Wie weiter unten beschrieben ist, können weitere Schalter in I<Einhängeschalter> angegeben werden, um das Verhalten von B<mount>() zu verändern.
fr: Chacune de ces opérations est détaillée plus tard dans cette page. D'autres attributs peuvent être indiqués dans I<mountflags> pour modifier le comportement de B<mount>(), comme décrits ci-dessous.
it: Ciascuna di queste operazioni è descritta nel dettaglio più avanti in questa pagina. Ulteriori flag possono essere specificati in I<mountflags> per modificare il comportamento di B<mount>(), come'è descritto qua sotto.
uk: Кожну з цих дій докладно описано нижче на цій сторінці. Можна вказати додаткові прапорці в аргументі I<прапорці_монтування> для внесення змін до поведінки B<mount>(), як це описано нижче.

source: Additional mount flags
de: Zusätzliche Einhängeschalter
fr: Attributs de montage supplémentaires
it: Ulteriori flag per il montaggio
uk: Додаткові прапорці монтування

source: The list below describes the additional flags that can be specified in I<mountflags>. Note that some operation types ignore some or all of these flags, as described later in this page.
de: Die folgende Liste beschreibt zusätzliche Schalter, die in I<Einhängeschalter> angegeben werden können. Beachten Sie, dass einige Aktionstypen einige oder alle dieser Schalter ignorieren, wie dies später auf dieser Seite beschrieben ist.
fr: La liste ci-dessous décrit les attributs supplémentaires qui peuvent être indiqués dans I<mountflags>. Remarquez que certains types d'opération ignorent tout ou partie d'autres attributs, comme décrits plus loin dans cette page.
it: L'elenco seguente descrive i flag aggiuntivi che possono venir specificati in I<mountflags>. Si noti che alcuni tipi di operazione ignorano alcuni o tutti questi flag, come descritto più avanti in questa pagina.
uk: У наведеному нижче списку описано додаткові прапорці, які можна вказати в аргументі I<прапорці_монтування>. Зауважте, що при виконанні деяких типів дій буде проігноровано деякі або усі з цих прапорців, як це описано нижче на цій сторінці.

source: B<MS_DIRSYNC> (since Linux 2.5.19)
de: B<MS_DIRSYNC> (seit Linux 2.5.19)
fr: B<MS_DIRSYNC> (depuis Linux 2.5.19)
it: B<MS_DIRSYNC> (a partire da Linux 2.5.19)
uk: B<MS_DIRSYNC> (починаючи з Linux 2.5.19)

source: Make directory changes on this filesystem synchronous. (This property can be obtained for individual directories or subtrees using B<chattr>(1).)
de: Verzeichniswechsel auf diesem Dateisystem synchron ausführen. (Diese Eigenschaft kann für einzelne Verzeichnisse oder Unterverzeichnisse durch Benutzung von B<chattr>(1) erreicht werden.)
fr: Rendre synchrones les modifications sur les répertoires du système de fichiers. (Cette propriété peut être obtenue pour les répertoires individuels ou les sous\(hyarborescences en utilisant B<chattr>(1).)
it: Sincronizza le modifiche di directory in questo filesystem. (Questa funzionalità può essere richiesta per singole directory o per sottoalberi usando B<chattr>(1).)
uk: Зробити зміни у цій файловій системі синхронними. (Цю властивість можна отримати для окремих каталогів або піддерев ієрархії за допомогою B<chattr>(1).)

source: B<MS_LAZYTIME> (since Linux 4.0)
de: B<MS_LAZYTIME> (seit Linux 4.0)
fr: B<MS_LAZYTIME> (depuis Linux 4.0)
it: B<MS_LAZYTIME> (a partire da Linux 4.0)
uk: B<MS_LAZYTIME> (починаючи з Linux 4.0)

source: Reduce on-disk updates of inode timestamps (atime, mtime, ctime) by maintaining these changes only in memory. The on-disk timestamps are updated only when:
de: Reduziert die Aktualiserung der Inode-Zeitstempel (Atime, Mtime, Ctime) auf der Platte, indem diese Änderungen nur im Speicher verwaltet werden. Die Zeitstempel auf der Platte werden nur aktualisiert, wenn:
fr: Réduire les mises à jour sur disque des horodatages d'inœuds (atime, mtime, ctime) en gardant seulement en mémoire ces changements. Les horodatages sur le disque sont mis à jour quand :
it: Riduce gli aggiornamenti su disco delle marcature temporali dell'inode (atime, mtime, ctime) effettuando questi cambiamenti solo in memoria. Le marcature temporali su disco vengono aggiornato solo quando:
uk: Зменшити оновлення на диску для часових позначок inode (atime, mtime, ctime) шляхом зберігання цих змін лише в оперативній пам'яті. Часові позначки на диску буде оновлено лише за таких умов:

source: (a)
uk: (а)

source: the inode needs to be updated for some change unrelated to file timestamps;
de: der Inode aus einem anderen Grund (neben den Dateizeitstempeln) aktualisiert werden muss;
fr: l'inœud doit être mis à jour pour certains changements non liés aux horodatages du fichier ;
it: l'inode necessita di un aggiornamento per delle modifiche non correlate alle marcature temporali del file;
uk: inode потребує оновлення через деякі зміни, які не пов'язано із часовими позначками файла;

source: (b)
uk: (б)

source: the application employs B<fsync>(2), B<syncfs>(2), or B<sync>(2);
de: die Anwendung B<fsync>(2), B<syncfs>(2) oder B<sync>(2) einsetzt;
fr: l'application utilise B<fsync>(2), B<syncfs>(2) ou B<sync>(2) ;
it: l'applicazione si serve di B<fsync>(2), B<syncfs>(2) o B<sync>(2);
uk: програма використовує B<fsync>(2), B<syncfs>(2) або B<sync>(2);

source: (c)
uk: (в)

source: an undeleted inode is evicted from memory; or
de: ein wiederhergestellter Inode aus dem Speicher entfernt wird; oder
fr: un inœud non effacé est évincé de la mémoire ;
it: un inode ancora esistente è estromesso dalla memoria; o
uk: невилучений inode буде викинуто з оперативної пам'яті;

source: (d)
uk: (г)

source: more than 24 hours have passed since the inode was written to disk.
de: mehr als 24 Stunden vergangen sind, seitdem der Inode auf Platte geschrieben wurde.
fr: plus de 24 heures sont passées depuis que l'inœud a été écrit sur le disque.
it: son passate più di 24 ore da quando l'inode è stato scritto su disco.
uk: минуло понад 24 годин з часу, коли inode було записано на диск.

source: This mount option significantly reduces writes needed to update the inode's timestamps, especially mtime and atime. However, in the event of a system crash, the atime and mtime fields on disk might be out of date by up to 24 hours.
de: Diese Einhängeoption reduziert die Schreibaktionen für die Aktualisierung der Inode-Zeitstempel signifikant, besonders für Mtime und Atime. Im Falle eines Systemabsturzes könnten die Atime- und Mtime-Felder allerdings bis zu 24 Stunden veraltet sein.
fr: Cette option de montage réduit significativement les écritures nécessaires pour mettre à jour les horodatages de l'inœud, surtout mtime et atime. Cependant, si un système plante, les champs atime et mtime du disque pourraient être périmées jusqu'à un maximum de 24 heures.
it: Quest'opzione di mount riduce significativamente le scritture necessarie per aggiornare le marcature temporali dell'inode, specialmente mtime e atime. Comunque, nell'eventualità di un crash di sistema, i campi atime e mtime su disco potrebbero non contenere gli aggiornamenti già effettuati, fino a un massimo 24 ore prima del crash.
uk: Цей параметр монтування значно зменшує у кількості дій із запису, які потрібні для оновлення часових позначок inode, особливо mtime та atime. Втім, якщо трапиться аварійне завершення роботи системи, поля atime і mtime на диску можуть розсинхронізуватися, аж до 24 годин.

source: Examples of workloads where this option could be of significant benefit include frequent random writes to preallocated files, as well as cases where the B<MS_STRICTATIME> mount option is also enabled. (The advantage of combining B<MS_STRICTATIME> and B<MS_LAZYTIME> is that B<stat>(2) will return the correctly updated atime, but the atime updates will be flushed to disk only in the cases listed above.)
de: Zufälliges Schreiben in vorreservierte Dateien sowie andere Fälle, in denen die Einhängeoption B<MS_STRICTATIME> auch aktiviert ist, sind Beispiele für Betriebsbelastungen, bei denen diese Option deutlichen Vorteil bringen könnte. (Der Vorteil der Kombination von B<MS_STRICTATIME> und B<MS_LAZYTIME> besteht darin, dass B<stat>(2) die korrekt aktualisierte Atime zurückliefern wird, aber Atime-Aktualisierungen nur in den oben aufgeführten Fällen auf Platte rausgeschrieben werden.)
fr: Parmi les exemples de charge de travail où cette option peut représenter un grand intérêt, on trouve les écritures fréquentes aléatoires dans des fichiers préalloués, ainsi que les cas où l'option de montage B<MS_STRICTATIME> est également activée (l'avantage de combiner B<MS_STRICTATIME> et B<MS_LAZYTIME> est que B<stat>(2) renverra l'atime correctement mis à jour, mais les mises à jour atime ne seront envoyées sur le disque que dans les cas listés ci-dessus).
it: Come esempi di situazioni in cui quest'opzione potrebbe essere di notevole utilità si può citare il caso di frequenti scritture casuali su file preallocati, e anche i casi in cui anche l'opzione di mount B<MS_STRICTATIME> è abilitata. (Il vantaggio di combinare B<MS_STRICTATIME> e B<MS_LAZYTIME> è che B<stat>(2) restituirà il valore di atime correttamente aggiornato, ma gli aggiornamenti di atime verranno trasferiti su disco solo nei casi sopra elencati.)
uk: Прикладами навантаження, де цей параметр міг би дати суттєві переваги, є частий випадковий запис до попередньо розподілених на диску файлів, а також випадки, де також увімкнено параметр монтування B<MS_STRICTATIME>. (Перевагою поєднання B<MS_STRICTATIME> і B<MS_LAZYTIME> є те, що B<stat>(2) повертатиме належним часом оновлений час доступу (atime), але оновлення atime буде скинуто на диск лише у випадках з наведеного вище списку.)

source: Permit mandatory locking on files in this filesystem. (Mandatory locking must still be enabled on a per-file basis, as described in B<fcntl>(2).) Since Linux 4.5, this mount option requires the B<CAP_SYS_ADMIN> capability and a kernel configured with the B<CONFIG_MANDATORY_FILE_LOCKING> option. Mandatory locking has been fully deprecated in v5.15 kernels, so this flag should be considered deprecated.
de: Zwingendes Sperren von Dateien auf diesem Dateisystem erlauben. (Zwingendes Sperren muss immer noch für jede Datei eingeschaltet werden, wie es in B<fcntl>(2) beschrieben ist.) Seit Linux 4.5 benötigt diese Einhängeoption die Capability B<CAP_SYS_ADMIN> und einen Kernel, der mit der Option B<CONFIG_MANDATORY_FILE_LOCKING> konfiguriert wurde. Zwingendes Sperren wurde ab Kernel der Reihe 5.15 vollständig als veraltet markiert, so dass dieser Schalter als veraltet anzusehen ist.
uk: Виконати обов'язкове блокування файлів у цій файловій системі. (Обов'язкове блокування все ще має бути увімкнено на рівні окремих файлів, як це описано у B<fcntl>(2).) Починаючи з версії Linux 4.5, цей параметр монтування потребує можливості B<CAP_SYS_ADMIN> і ядра, яке налаштовано з використанням параметра B<CONFIG_MANDATORY_FILE_LOCKING>. Обов'язкове блокування було повністю вилучено як застаріле у ядрах 5.15, тому цей прапорець слід вважати застарілим.

source: Do not update access times for (all types of) files on this filesystem.
de: Nicht die Zugriffszeiten für (alle Typen von) Dateien auf diesem Dateisystem aktualisieren.
fr: Ne pas mettre à jour les dates d'accès pour (tous) les fichiers du système de fichiers.
it: Non aggiorna l'ora di accesso per (tutti i tipi di) file su questo filesystem.
uk: Не оновлювати часи доступу для файлів (усіх типів) у цій файловій системі.

source: Do not allow access to devices (special files) on this filesystem.
de: Keinen Zugriff auf Geräte (Spezialdateien) auf diesem Dateisystem erlauben.
fr: Ne pas autoriser l’accès aux périphériques (fichiers spéciaux) sur le système de fichiers.
it: Non permette l'accesso a dispositivi (file speciali) in questo filesystem.
uk: Не дозволяти доступ до пристроїв (особливих файлів) у цій файловій системі.

source: Do not update access times for directories on this filesystem. This flag provides a subset of the functionality provided by B<MS_NOATIME>; that is, B<MS_NOATIME> implies B<MS_NODIRATIME>.
de: Nicht die Zugriffszeiten für Verzeichnisse auf diesem Dateisystem aktualisieren. Dieser Schalter stellt eine Untermenge der Funktionalität von B<MS_NOATIME> bereit; sprich B<MS_NOATIME> impliziert B<MS_NODIRATIME>.
fr: Ne pas mettre à jour les dates d'accès pour les répertoires du système de fichiers. Cet attribut fournit un sous-ensemble de la fonctionnalité fournie par B<MS_NOATIME> ; c'est-à-dire, B<MS_NOATIME> implique B<MS_NODIRATIME>.
it: Non aggiorna l'ora di accesso per directory su questo filesystem. Questo flag fornisce un sottoinsieme di funzioni messe a disposizione da B<MS_NOATIME>; vale a dire che B<MS_NOATIME> implica B<MS_NODIRATIME>.
uk: Не оновлювати час доступу для каталогів у цій файловій системі. Цей прапорець надає доступ до підмножини функціональних можливостей, що надаються B<MS_NOATIME>; тобто, B<MS_NOATIME> неявним чином встановлює B<MS_NODIRATIME>.

source: Do not allow programs to be executed from this filesystem.
de: Nicht erlauben, dass Programme von diesem Dateisystem ausgeführt werden.
fr: Ne pas permettre l'exécution de programmes depuis le système de fichiers.
it: Non permette l'esecuzione di programmi su questo filesystem.
uk: Не дозволяти виконання програм з цієї файлової системи.
