Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: The parent of a new mount point is defined when the mount point is created. In the usual case, the parent of a new mount is the mount point of the filesystem containing the directory or file at which the new mount is attached. In the case where a new mount is stacked on top of an existing mount, the parent of the new mount is the previous mount that was stacked at that location.
de: Der Eltern-Einhängepunkt eines neuen Einhängepunkts wird definiert, wenn der Einhängepunkt erstellt wird. Üblicherweise ist der Eltern-Einhängepunkt eines neuen Einhängepunkts der Einhängepunkt des Dateisystems, welches das Verzeichnis oder die Datei enthält, an dem oder der die neue Einhängung geschieht. In dem Fall, in dem der Eltern-Einhängepunkt einer neuen Einhängung über die oberste Ebene einer existierenden Einhängung gesetzt wird, ist der Eltern-Einhängepunkt der neuen Einhängung die vorherige Einhängung, die an diesem Ort gesetzt war.
fr: Le parent d'un nouveau point de montage est défini quand le point de montage est créé. En général, le parent d'un nouveau montage est le point de montage du système de fichiers qui contient le répertoire ou le fichier sur lequel est rattaché le montage. Si un nouveau montage est empilé sur un montage existant, le parent du nouveau montage est le montage précédent empilé à cet endroit.
it: Il genitore di un nuovo punto di montaggio viene definito alla creazione del punto di montaggio. Normalmente, il genitore di un nuovo punto di montaggio è il punto di montaggio del filesystem contenente la directory o il file a cui il punto di montaggio è collegato. Nel caso in cui un nuovo punto di montaggio sia sovrapposto a un montaggio esistente, il genitore del nuovo montaggio è il precedente montaggio che era stato sovrapposto in quella posizione.
uk: Батьківське монтування нового монтування визначається при створенні монтування. У звичному випадку батьківським монтуванням нового монтування є монтування файлової системи, яке містить каталог або файл, до якого долучено нове монтування. У випадку, коли нове монтування розташовано у стосі вище за наявне монтування, батьківським монтуванням нового монтування буде попереднє монтування, яке було у стосі у відповідному місці.

source: The parental relationship between mount points can be discovered via the I</proc/[pid]/mountinfo> file (see below).
de: Die elterliche Beziehung zwischen Einhängepunkten können Sie in der Datei I</proc/[PID]/mountinfo> herausfinden (siehe unten).
fr: La relation de parenté entre les points de montage peut être examinée dans le fichier I</proc/[pid]/mountinfo> (voir ci-dessous).
it: La relazione parentale tra punti di montaggio si può vedere tramite il file I</proc/[pid]/mountinfo> (vedi sotto).
uk: Батьківський взаємозв'язок між монтуваннями можна виявити за допомогою файла I</proc/[pid]/mountinfo> (див. нижче).

source: The Linux-specific I</proc/[pid]/mounts> file exposes the list of mount points in the mount namespace of the process with the specified ID. The I</proc/[pid]/mountinfo> file exposes even more information about mount points, including the propagation type and mount ID information that makes it possible to discover the parental relationship between mount points. See B<proc>(5) and B<mount_namespaces>(7) for details of this file.
de: Die Linux-spezifische Datei I</proc/[PID]/mounts> legt die Liste der Einhängepunkte in dem Einhängenamensraum des Prozesses mit der festgelegten Kennung offen. Die Datei I</proc/[PID]/mountinfo> legt sogar weitere Informationen über Einhängepunkte offen, einschließlich des Ausbreitungstyps und der Einhängekennungsinformation, die es ermöglichen, die Eltern-Kind-Beziehungen zwischen Einhängepunkten zu ermitteln. Siehe B<proc>(5) und B<mount_namespaces>(7) für Details über diese Dateien.
fr: Le fichier I</proc/[pid]/mounts> spécifique à Linux présente la liste des points de montage dans l'espace de noms montage du processus ayant l'identifiant indiqué. Le fichier I</proc/[pid]/mountinfo> présente encore plus d'informations sur les points de montage, notamment le type de propagation et les informations d'identification du montage, ce qui permet de visualiser la relation de parenté entre les points de montage. Voir B<proc>(5) et B<mount_namespaces>(7) pour plus de détails sur ce fichier.
it: Il file specifico di Linux I</proc/[pid]/mounts> mostra l'elenco dei punti di montaggio negli spazi dei nomi dei processi con l'ID specificato. Il file I</proc/[pid]/mountinfo> fornisce anche ulteriori informazioni sui punti di montaggio, compreso il tipo di propagazione e l'informazione sull'ID di montaggio, e ciò rende possible scoprire la relazione parentale fra i punti di montaggio. Si veda B<proc>(5) e B<mount_namespaces>(7) per i dettagli di questo file.
uk: Специфічний для Linux файл I</proc/[pid]/mounts> надає доступ до списку точок монтування у просторі назв монтування процесу із вказаним ідентифікатором Крім того, файл I</proc/[pid]/mountinfo> надає доступ до навіть ширших відомостей щодо монтувань, зокрема типу поширення та даних щодо ідентифікатора монтування, що уможливлює виявлення батьківських зв'язків між монтуваннями. Подробиці щодо цього файла наведено на сторінках підручника щодо B<proc>(5) і B<mount_namespaces>(7).

source: COLOPHON
de: KOLOPHON
uk: ПІСЛЯМОВА

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 5.10 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 5.13 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.

source: Permit mandatory locking on files in this filesystem. (Mandatory locking must still be enabled on a per-file basis, as described in B<fcntl>(2).) Since Linux 4.5, this mount option requires the B<CAP_SYS_ADMIN> capability.
de: Zwingendes Sperren von Dateien auf diesem Dateisystem erlauben. (Zwingendes Sperren muss immer noch für jede Datei eingeschaltet werden, wie es in B<fcntl>(2) beschrieben ist.) Seit Linux 4.5 benötigt diese Einhängeoption die Capability B<CAP_SYS_ADMIN>.
it: Consente il blocco obbligatorio sui file in questo filesystem. (Il blocco obbligatorio deve ancora essere abilitato per i singoli file, come descritto in B<fcntl>(2).) A partire da Linux 4.5, quest'opzione di mount richiede la funzionalità B<CAP_SYS_ADMIN>.
uk: Виконати обов'язкове блокування файлів у цій файловій системі (Обов'язкове блокування все ще має бути увімкнено на рівні окремих файлів, як це описано у B<fcntl>(2).) Починаючи з версії Linux 4.5, цей параметр монтування потребує можливості B<CAP_SYS_ADMIN>.

source: From Linux 2.4 onward, the B<MS_NODEV>, B<MS_NOEXEC>, and B<MS_NOSUID> flags are settable on a per-mount-point basis. From kernel 2.6.16 onward, B<MS_NOATIME> and B<MS_NODIRATIME> are also settable on a per-mount-point basis. The B<MS_RELATIME> flag is also settable on a per-mount-point basis. Since Linux 2.6.16, B<MS_RDONLY> can be set or cleared on a per-mount-point basis as well as on the underlying filesystem. The mounted filesystem will be writable only if neither the filesystem nor the mountpoint are flagged as read-only.
de: Von Linux 2.4 aufwärts können die Schalter B<MS_NODEV>, B<MS_NOEXEC> und B<MS_NOSUID> pro Einhängepunkt gesetzt werden. Von Linux 2.6.16 aufwärts können auch die Schalter B<MS_NOATIME> und B<MS_NODIRATIME> pro Einhängepunkt gesetzt werden. Außerdem kann der Schalter B<MS_RELATIME> pro Einhängepunkt gesetzt werden. Seit Linux 2.6.16 kann B<MS_RDONLY> sowohl auf einer einhängepunktabhängigen Basis als auch auf den unterliegenden Dateisystem (zurück)gesetzt werden. Das eingehängte Dateisystem wird nur schreibbar sein, falls weder das Dateisystem noch der Einhängepunkt als nur-lesbar gekennzeichnet sind.
uk: Починаючи з Linux 2.4, прапорці B<MS_NODEV>, B<MS_NOEXEC> і B<MS_NOSUID> можна встановлювати для окремих точок монтування. Починаючи з версії ядра 2.6.16, B<MS_NOATIME> і B<MS_NODIRATIME> також можна встановлювати для окремих точок монтування. Прапорець B<MS_RELATIME> також можна встановлювати для окремих точок монтування. Починаючи з Linux 2.6.16, B<MS_RDONLY> можна встановлювати або знімати на основі окремої точки монтування, а також суперблоку базової файлової системи. Змонтована файлова система буде придатною до запису, лише якщо ні файлову систему, ні точку монтування буде позначено прапорцем «лише для читання».

source: The I<mountflags> and I<data> arguments should match the values used in the original B<mount>() call, except for those parameters that are being deliberately changed. Another exception is that B<MS_BIND> has a different meaning for remount, and it should be included only if explicitly desired.
de: Die Argumente I<Einhängeschalter> und I<Daten> sollten den im originalen B<mount>()-Aufruf verwendeten Werten entsprechen, außer für jene Parameter, die bewusst geändert werden. Eine weitere Ausnahme ist, dass B<MS_BIND> beim erneuten Einhängen eine andere Bedeutung hat und daher nur aufgenommen werden sollte, wenn es explizit erwünscht ist.
uk: Аргументи I<прапорці_монтування> і I<дані> мають збігатися за значеннями з початковим викликом B<mount>(), окрім тих параметрів, які має бути змінено. Іншим виключенням є те, що B<MS_BIND> має інше значення для повторного монтування, і його слід включати, лише він є явно бажаним.

source: The following I<mountflags> can be changed: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, and B<MS_SYNCHRONOUS>. Attempts to change the setting of the B<MS_DIRSYNC> flag during a remount are silently ignored.
de: Die folgenden I<Einhängeschalter> können geändert werden: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY> und B<MS_SYNCHRONOUS>. Versuche, die Einstellung des Schalters B<MS_DIRSYNC> zu ändern, werden ohne Rückmeldung ignoriert.
it: I seguenti bit di I<mountflags> possono essere modificati: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY> e B<MS_SYNCHRONOUS>. I tentativi di cambiare l'impostazione del flag B<MS_DIRSYNC> durante un rimontaggio vengono ignorati senza emettere messaggi.
uk: Можна змінювати такі I<прапорці_монтування>: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (результатом зміни буде зняття прапорців B<MS_NOATIME> і B<MS_RELATIME>) і B<MS_SYNCHRONOUS>. Спроби змінити значення прапорців B<MS_DIRSYNC> і B<MS_SILENT> під час повторного монтування без питань буде проігноровано.

source: Since Linux 2.6.26, this flag can be used with B<MS_BIND> to modify only the per-mount-point flags. This is particularly useful for setting or clearing the "read-only" flag on a mount point without changing the underlying filesystem. Specifying I<mountflags> as:
de: Seit Linux 2.6.26 kann dieser Schalter mit B<MS_BIND> verwandt werden, um nur die einhängepunktabhängigen Schalter zu verändern. Dies ist besonders nützlich, um den »nur-lesbar«-Schalter auf einem Einhängepunkt (zurück-)zusetzen, ohne das unterliegende Dateisystem zu verändern. Wird I<Einhängeschalter> als
it: A partire da Linux 2.6.26, questo il flag può essere usato con B<MS_BIND> per modificare solo i flag relativi ai punti di montaggio Questo è particolarmente utile per impostare o annullare il flag "read-only" su un punto di montaggio senza cambiare il filesystem sottostante. Specificando I<mountflags> come:
uk: Починаючи з Linux 2.6.26, цим прапорцем можна скористатися у поєднанні із B<MS_BIND> для зміни прапорців монтування окремої точки монтування. Це, зокрема, корисно для встановлення або зняття прапорця «лише читання» для монтування без зміни базової файлової системи. Визначення I<прапорців_монтування> так:

source: The remaining bits in the I<mountflags> argument are also ignored, with the exception of B<MS_REC>. (The bind mount has the same mount options as the underlying mount point.) However, see the discussion of remounting above, for a method of making an existing bind mount read-only.
de: Die verbleibenden Bits im Argument I<Einhängeschalter> werden außer B<MS_REC> auch ignoriert. (Die Bind-Einhängung hat die gleichen Einhängeoptionen wie der unterliegende Einhängepunkt.) Lesen Sie allerdings die Diskussion zum erneuten Einhängen weiter oben für eine Methode, wie Sie eine bestehende Bind-Einhängung auf nur-lesend ändern.
it: I restanti bit nell'argomento I<mountflags> vengono anch'essi ignorati, ad eccezione di B<MS_REC>. (Il montaggio di tipo bind ha le stesse opzioni di montaggio del punto di montaggio su cui viene applicato.) Si veda comunque la spiegazione sul rimontaggio vista prima, per il modo di rendere in sola lettura un punto di montaggio già in essere.
uk: Решту бітів в аргументі I<прапорці_монтування> також буде проігноровано, за винятком B<MS_REC>. (Монтування з прив'язкою матиме ті самі параметри монтування, що і базове монтування) Втім, ознайомтеся із обговоренням щодо повторного монтування вище, щоб дізнатися про спосіб зробити наявне монтування з прив'язкою придатним лише до читання.

source: The only flags that can be used with changing the propagation type are B<MS_REC> and B<MS_SILENT>.
de: Die einzigen Schalter, die beim Ändern des Ausbreitungstyps verwendet werden können, sind B<MS_REC> und B<MS_SILENT>.
it: I soli flag che possono essere usati con la modifica del tipo di propagazione sono B<MS_REC> e B<MS_SILENT>.
uk: Єдиними іншими прапорцями, які може бути вказано при зміні типу поширення, є B<MS_REC> і B<MS_SILENT>.

source: Make this mount unbindable. This is like a private mount, and in addition this mount can't be bind mounted. When a recursive bind mount (B<mount>() with the B<MS_BIND> and B<MS_REC> flags) is performed on a directory subtree, any bind mounts within the subtree are automatically pruned (i.e., not replicated) when replicating that subtree to produce the target subtree.
de: Diesen Einhängepunkt nicht bind-einhängbar machen. Dies ähnelt einer privaten Einhängung, zusätzlich kann diese Einhängung nicht bind-eingehängt werden. Wenn eine rekursive Bind-Einhängung (B<mount>() mit den Schaltern B<MS_BIND> und B<MS_REC>) auf einem Verzeichnisunterbaum durchgeführt wird, werden alle Bind-Einhängepunkte innerhalb des Unterbaums automatisch abgeschnitten (d.h. nicht reproduziert), wenn der Unterbaum zum Erstellen des Zielbaumes reproduziert wird.
it: Rende questo montaggio non condivisibile unbindaable) con un'operazione di bind. È come un montaggio privato (private mount), e in più questo montaggio non può essere montato con un montaggio di tipo bind. Quando un montaggio di tipo bind ricorsivo (B<mount>() con i flag B<MS_BIND> e B<MS_REC>) è effettuato su un sottoalbero di directory, qualsiasi montaggio di tipo "bind" all'interno del sottoalbero è automaticamente smontato (cioè, non replicato) quando si replica questo sottoalbero per produrre il sottoalbero di destinazione.
uk: Зробити це монтування неприв'язним. Таке монтування подібне до приватного, а на додачу, це монтування не можна буде використати як монтування з прив'язкою. Коли виконується рекурсивне монтування з прив'язкою (B<mount>() з прапорцями B<MS_BIND> і B<MS_REC>) для підлеглої ієрархії каталогу, усі неприв'язні монтування у підлеглій ієрархії буде автоматично прибрано (тобто не відтворено) при відтворенні цієї підлеглої ієрархії для відтворення підлеглої ієрархії цілі.

source: The definitions of B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> and B<MS_UNBINDABLE> were added to glibc headers in version 2.12.
de: Die Definitionen von B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> und B<MS_UNBINDABLE> wurden in der Version 2.12 in die Glibc-Header aufgenommen.
it: Le definizioni di B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> e B<MS_UNBINDABLE> sono state aggiunte alle intestazioni di glibc nella versione 2.12.
uk: Визначення B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> та B<MS_UNBINDABLE> було додано до заголовків glibc у версії 2.12.

source: Per-process namespaces
de: Namensräume pro Prozess
uk: Простори назв для окремих процесів

source: Starting with kernel 2.4.19, Linux provides per-process mount namespaces. A mount namespace is the set of filesystem mounts that are visible to a process. Mount-point namespaces can be (and usually are) shared between multiple processes, and changes to the namespace (i.e., mounts and unmounts) by one process are visible to all other processes sharing the same namespace. (The pre-2.4.19 Linux situation can be considered as one in which a single namespace was shared by every process on the system.)
de: Seit Kernel 2.4.19 stellt Linux Einhänge-Namensräume pro Prozess bereit. Ein Einhänge-Namensraum ist eine Zusammenstellung von eingehängten Dateisystemen, die für einen Prozess sichtbar sind. Einhängepunkt-Namensräume können (und werden gewöhnlich) gemeinsam von mehreren Prozessen benutzt und Änderungen am Namensraum (d.h. Ein- und Aushängen) durch einen Prozess sind für alle anderen Prozesse sichtbar, die den gleichen Namensraum mitverwenden. (Die Situation in Linux vor 2.4.19 kann so betrachtet werden, als ob ein einzelner Namensraum von jedem Prozess im System mitbenutzt würde.)
uk: Починаючи з версії ядра 2.4.19, у Linux передбачено простори назв монтування для окремих процесів. Простір назв монтування — це набір монтувань файлової системи, які є видимими для процесу. Простори назв монтування можуть поділятися (і, зазвичай, поділяються) декількома процесами, а зміни у просторі назв (тобто монтування і демонтування) у результаті роботи одного процесру є видимими для усіх інших процесів, які спільно використовують той самий простір назв. (Ситуацію у Linux до версії 2.4.19 можна розглядати як таку, коли один простір назв спільно використовували усі процеси у системі.)

source: The Linux-specific I</proc/[pid]/mounts> file exposes the list of mount points in the mount namespace of the process with the specified ID; see B<proc>(5) for details.
de: Die Linux-spezifische Datei I</proc/[PID]/mounts> stellt die Liste der Einhängepunkte in dem Einhänge-Namensraum des Prozesses mit der angegebenen Kennung dar; in B<proc>(5) finden Sie Details hierzu.
uk: Специфічний для Linux файл I</proc/[pid]/mounts> надає доступ до списку точок монтування у просторі назв монтування процесу із вказаним ідентифікатором; див. B<proc>(5), щоб дізнатися більше.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
uk: Ця сторінка є частиною випуску 4.16 проєкту I<man-pages> Linux. Опис проєкту, дані щодо звітування про вади та найсвіжішу версію цієї сторінки можна знайти за адресою \%https://www.kernel.org/doc/man-pages/.
