Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: A component of a path was not searchable. (See also B<path_resolution>(7).)
de: Eine Komponente eines Pfades war nicht durchsuchbar. (Siehe auch B<path_resolution>(7).)
fr: Un élément du chemin d'accès ne permet pas le parcours (consultez aussi B<path_resolution>(7)).
it: Un componente di un percorso non poteva essere acceduto. (Vedere anche B<path_resolution>(7).)
uk: Компонент шляху виявився непридатним для пошуку. (Див. також B<path_resolution>(7).)

source: Mounting a read-only filesystem was attempted without giving the B<MS_RDONLY> flag.
de: Es wurde versucht, ein nur-lesbares Dateisystem einzuhängen, ohne den Schalter B<MS_RDONLY> zu verwenden.
fr: Le montage d'un système de fichiers en lecture seule a été tenté sans donner l'attribut B<MS_RDONLY>.
it: È stato tentato il montaggio di un filesystem in sola lettura senza dare il flag B<MS_RDONLY>.
uk: Було виконано спробу монтування придатної лише для читання файлової системи без зазначення прапорця B<MS_RDONLY>.

source: The filesystem may be read-only for various reasons, including: it resides on a read-only optical disk; it is resides on a device with a physical switch that has been set to mark the device read-only; the filesystem implementation was compiled with read-only support; or errors were detected when initially mounting the filesystem, so that it was marked read-only and can't be remounted as read-write (until the errors are fixed).
de: Das Dateisystem kann aus verschiedenen Gründen nur lesbar sein. Dazu gehören: es liegt auf einer nur lesbaren optischen Platte, es liegt auf einem Gerät mit einem physischen Schalter, der auf der Einstellung »nur lesbar« steht, die Dateisystemimplementierung wurde ohne Schreibunterstützung kompiliert oder es wurden Fehler erkannt, als das Dateisystem erstmalig eingehängt wurde, so dass es nur lesbar markiert wurde und nicht erneut schreibbar eingehängt werden kann (bis die Fehler behoben wurden).
fr: Le système de fichiers peut être en lecture seule pour diverses raisons, dont : il réside sur un disque optique en lecture seule ; il se trouve sur un périphérique possédant un commutateur physique positionné sur lecture seule ; l'implémentation du système de fichiers a été compilée avec la prise en charge de la lecture seulement ; ou des erreurs ont été détectées lors du montage initial du système de fichiers. Il est donc marqué en lecture seule et ne peut pas être remonté en lecture-écriture (jusqu'à ce que les erreurs soient corrigées).
it: Il filesystem può essere di sola lettura per diverse ragioni, tra le quali: risiede in un disco ottico di sola lettura;risiede su un dispositivo con un interrutore fisico che è stato impostato per marcare il dispositivo come di sola lettura; il filesystem in questione è stato creato per supportare la sola lettura; oppure sono stati riscontrati errori durante montaggio iniziale del filesystem, per cui esso è stato marcato come di sola lettura e non può essere rimontato in lettura-scrittura (fino a quando gli errori non siano stati corretti).
uk: Файлова система може бути придатною лише для читання з різних причин, зокрема: файлову систему розташовано на придатному лише для читання оптичному диску; файлову систему розташовано на пристрої із фізичним перемикачем, який переведено у стан, який робить диск придатним лише для читання; реалізацію файлової системи було зібрано із підтримкою лише читання; або під час початкового монтування файлової системи було виявлено помилки, отже файлову систему позначено як придатну лише для читання і її не може бути повторно змонтовано для читання і запису (аж до виправлення помилок).

source: Some filesystems instead return the error B<EROFS> on an attempt to mount a read-only filesystem.
de: Einige Dateisysteme liefern bei einem Versuch, ein nur lesbares Dateisystem einzuhängen, stattdessen den Fehler B<EROFS>.
fr: Certains systèmes de fichiers renvoient plutôt l'erreur B<EROFS> si on essaie de monter un système de fichiers en lecture seule.
it: Alcuni filesystem restituiscono l'errore B<EROFS> su un tentativo di montaggio di un filesystem di sola lettura.
uk: У деяких файлових системах, замість цього, буде повернуто помилку B<EROFS> у відповідь на спробу монтування придатної лише для читання файлової системи.

source: The block device I<source> is located on a filesystem mounted with the B<MS_NODEV> option.
de: Das Blockgerät I<Quelle> befindet sich auf einem Dateisystem, das mit der Option B<MS_NODEV> eingehängt wurde.
fr: Le périphérique bloc I<source> se trouve sur un système de fichiers monté avec l'option B<MS_NODEV>.
it: Il dispositivo a blocchi I<source> si trova su un filesystem montato con l'opzione B<MS_NODEV>.
uk: Блоковий пристрій I<source> розташовано у файловій системі, яку змонтовано з параметром B<MS_NODEV>.

source: An attempt was made to stack a new mount directly on top of an existing mount point that was created in this mount namespace with the same I<source> and I<target>.
de: Es wurde versucht, eine neue Einhängung auf einen existierenden Einhängepunkt, der in diesem Einhängenamensraum mit den gleichen I<Quelle> und I<Ziel> erzeugt worden war, zu stapeln.
fr: Tentative d'empiler un nouveau montage directement sur un point de montage existant créé dans cet espace de noms montage avec la même I<source> et la même I<target>.
it: È stato fatto un tentativo per sistemare un nuovo punto di montaggio in cima a un punto di montaggio esistente che era stato creato in questo "namespace" di montaggio con lo stesso I<source> e I<target>.
uk: Виконано спробу насаджування нової точки монтування безпосередньо на наявну точку монтування, яку було створено у цьому просторі назв монтування із тим самим I<джерелом> і I<ціллю>.

source: I<source> cannot be remounted read-only, because it still holds files open for writing.
de: I<Quelle> kann nicht nur-lesend neu eingehängt werden, da dort immer noch Dateien zum Schreiben offen sind.
fr: I<source> ne peut pas être remonté en lecture seule car il a encore des fichiers ouverts en écriture.
it: I<source> non può essere rimontato in sola lettura, perché contiene ancora file aperti in scrittura.
uk: I<джерело> не може бути повторно змонтовано у режимі лише читання, оскільки на ньому усе ще зберігаються файли, які відкрито для запису.

source: One of the pointer arguments points outside the user address space.
de: Eines der Zeiger-Argumente zeigt außerhalb des Adressraums der Benutzer.
fr: L'un des arguments pointe en dehors de l'espace d'adressage accessible.
it: Uno dei puntatori agli argomenti punta fuori dallo spazio di indirizzamento dell'utente.
uk: Один із аргументів-вказівників вказує на місце поза простором адрес користувача.

source: I<source> had an invalid superblock.
de: I<Quelle> hat einen ungültigen Superblock.
fr: I<source> avait un superbloc non valable.
it: I<source> ha un superblocco non valido.
uk: I<джерело> містить некоректний суперблок.

source: A remount operation (B<MS_REMOUNT>) was attempted, but I<source> was not already mounted on I<target>.
de: Eine Neueinhängungsaktion (B<MS_REMOUNT>) wurde versucht, aber I<Quelle> war nicht bereits auf I<Ziel> eingehängt.
fr: Tentative d'une opération de remontage (B<MS_REMOUNT>) mais I<source> n'était pas déjà monté sur I<target>.
it: È stato tentata un'operazione di rimontaggio (B<MS_REMOUNT>), ma I<source> non era ancora stato montato su I<target>.
uk: Було виконано спробу повторного монтування (B<MS_REMOUNT>), але I<джерело> не було вже змонтовано до I<цілі>.

source: A move operation (B<MS_MOVE>) was attempted, but the mount tree under I<source> includes unbindable mounts and I<target> is a mount that has propagation type B<MS_SHARED>.
de: Eine Verschiebeaktion (B<MS_MOVE>) wurde versucht, aber der Einhängebaum unter I<Quelle> enthält nicht bindbare Einhängungen und I<Ziel> ist eine Einhängung, die den Ausbreitungstyp B<MS_SHARED> hat.
uk: Було виконано спробу пересування (B<MS_MOVE>), але в ієрархії монтування у I<джерело> включено непридатні до прив'язування монтування, а I<ціль> є монтуванням, типом поширення якого є B<MS_SHARED>.

source: A move operation (B<MS_MOVE>) was attempted, but the parent mount of I<source> mount has propagation type B<MS_SHARED>.
de: Eine Verschiebeaktion (B<MS_MOVE>) wurde versucht, aber die Elterneinhängung von I<Quelle> hat den Ausbreitungstyp B<MS_SHARED>.
fr: Tentative d'une opération de déplacement (B<MS_MOVE>), mais le montage parent du montage I<source> a un type de propagation B<MS_SHARED>.
it: È stata tentata un'operazione di spostamento (B<MS_MOVE>), ma il montaggio del filesystem genitore I<source> di questo montaggio ha una propagazione di tipo B<MS_SHARED>.
uk: Було виконано спробу пересування (B<MS_MOVE>), але батьківське монтування монтування I<джерело> належить до типу поширення B<MS_SHARED>.

source: A move operation (B<MS_MOVE>) was attempted, but I<source> was not a mount, or was \(aq/\(aq.
de: Eine Verschiebeaktion (B<MS_MOVE>) wurde versucht, aber I<Quelle> war keine Einhängung oder war »/«.
uk: Було виконано спробу пересування (B<MS_MOVE>), але I<джерело> не було монтуванням або було «/».

source: A bind operation (B<MS_BIND>) was requested where I<source> referred a mount namespace magic link (i.e., a I</proc/[pid]/ns/mnt> magic link or a bind mount to such a link) and the propagation type of the parent mount of I<target> was B<MS_SHARED>, but propagation of the requested bind mount could lead to a circular dependency that might prevent the mount namespace from ever being freed.
de: Es wurde eine Bind-Aktion (B<MS_BIND>) angefordert, wobei I<Quelle> sich auf einen magischen Einhängenamensraum-Link bezog (d.h. einen magischen Link I</proc/[PID]/ns/mnt> oder eine Bind-Einhängung auf solch einen Link) und der Ausbreitungstyp der übergeordneten Einhängung von I<Ziel> war B<MS_SHARED>, aber die Ausbreitung der angeforderten Bind-Einhängung könnte zu einer zirkulären Abhängigkeit führen, die verhindern könnte, dass der Einhänge-Namensraum jemals wieder freigegeben werden könnte.
fr: Une opération miroir (B<MS_BIND>) a été demandée alors que I<source> renvoyait à un lien magique d'espace de noms de montage (c'est-à-dire à un lien magique I</proc/[pid]/ns/mnt> ou à un montage miroir vers un tel lien) et le type de propagation du montage parent de I<target> était B<MS_SHARED>, mais la propagation du montage miroir demandée créerait une dépendance circulaire qui pourrait empêcher l'espace de noms de montage d'être libéré.
it: È stata richiesta un'operazione di tipo bind (B<MS_BIND>) dove I<source> fa riferimento a un collegamento I<magic link> dello spazio dei nomi di mount (p.es. un magic link I</proc/[pid]/ns/mnt> o un montaggio di tipo bind a tale collegamento) e il tipo di propagazione del montaggio genitore di I<target> era B<MS_SHARED>, ma la propagazione del montaggio di tipo bind richiesta potrebbe determinare una dipendenza circolare che potrebbe impedire che lo spazio dei nomi di mount sia liberato.
uk: Було надіслано запит щодо дії з прив'язки (B<MS_BIND>), де I<джерело> вказує на магічне посилання простору назв монтування (тобто магічне посилання I</proc/[pid]/ns/mnt> або монтування з прив'язкою до такого посилання), а типом поширення батьківського монтування I<цілі> було B<MS_SHARED>, але поширення бажаного монтування з прив'язкою може призвести до циклічних залежностей, що може заважати будь-якому вивільненню простору назв монтування.

source: I<mountflags> includes more than one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE>.
de: I<mountflags> enthält mehr als einen aus B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> und B<MS_UNBINDABLE>.
fr: I<mountflags> comprend plus d'un B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> ou B<MS_UNBINDABLE>.
it: I<mountflags> include più d'uno di questi flag: B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> o B<MS_UNBINDABLE>.
uk: У параметрі I<прапорці_монтування> містилося декілька B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> або B<MS_UNBINDABLE>.

source: I<mountflags> includes B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> and also includes a flag other than B<MS_REC> or B<MS_SILENT>.
de: I<mountflags> enthält B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> oder B<MS_UNBINDABLE> und enthält auch einen von B<MS_REC> oder B<MS_SILENT> verschiedenen Schalter.
fr: I<mountflags> comprend un B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> ou B<MS_UNBINDABLE> ainsi qu'un autre attribut que B<MS_REC> ou B<MS_SILENT>.
it: I<mountflags> include B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> o B<MS_UNBINDABLE> e include anche un flag diverso da B<MS_REC> o B<MS_SILENT>.
uk: У параметрі I<прапорці_монтування> міситься B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> або B<MS_UNBINDABLE>, а також міститься прапорець, відмінний від B<MS_REC> або B<MS_SILENT>.

source: An attempt was made to bind mount an unbindable mount.
de: Es wurde versucht, ein nicht-bind-einhängbare Einhängung bind-einzuhängen.
fr: Tentative de monter en miroir un montage impossible à monter ainsi.
it: Si è tentato di montare in modalità bind un montaggio non montabile in modalità bind (unbindable mount).
uk: Спроба монтування прив'язки для непридатного до прив'язки монтування.

source: In an unprivileged mount namespace (i.e., a mount namespace owned by a user namespace that was created by an unprivileged user), a bind mount operation (B<MS_BIND>) was attempted without specifying (B<MS_REC>), which would have revealed the filesystem tree underneath one of the submounts of the directory being bound.
de: In einem nicht privilegierten Einhängenamensraum (d.h. einem Einhängenamensraum, der einem Benutzernamensraum gehört, der durch einen nicht privilegierten Benutzer erstellt wurde) wurde eine Bind-Einhängeaktion (B<MS_BIND>) ohne Angabe von (B<MS_REC>) versucht, womit der Dateisystembaum unterhalb einer der Untereinhängungen des Bind-eingehängten Verzeichnisses offengelegt worden wäre.
fr: Dans un espace de noms montage non privilégié (c'est-à-dire appartenant à un espace de noms utilisateur créé par un utilisateur non privilégié), tentative d'opération de montage en miroir (B<MS_BIND>) sans indiquer B<MS_REC>, qui aurait révélé une arborescence de système de fichiers en-dessous d'un des sous-montages du répertoire à refléter.
it: In uno spazio dei nomi di montaggio senza privilegi (i.e., uno spazio dei nomi di montaggio di proprietà di uno spazio dei nomi utente che era stato creato da un utente senza privilegi), è stata tentata un'operazione di montaggio di tipo bind (B<MS_BIND>) senza specificare (B<MS_REC>), che avrebbe rivelato la posizione dell'albero del filesystem sotto uno dei submontaggi della directory da collegare.
uk: У непривілейованому просторі назв монтування (тобто просторі назв монтування, власником якого є простір назв користувача, який було створено непривілейованим користувачем) було виконано спробу монтування з прив'язкою (B<MS_BIND>) без визначення (B<MS_REC>), яка б відкрила ієрархію файлової системи під одним з підлеглих монтувань каталогу, прив'язка якого виконується.

source: Too many links encountered during pathname resolution.
de: Bei der Auflösung des Pfadnamens wurden zu viele Links gefunden.
fr: Trop de liens rencontrés dans la résolution du chemin d'accès.
it: Troppi collegamenti incontrati durante la risoluzione di un percorso.
uk: Під час обробки шляху виявлено забагато посилань.

source: A move operation was attempted, and I<target> is a descendant of I<source>.
de: Es wurde eine Verschiebeaktion versucht und I<Ziel> liegt unterhalb von I<Quelle>.
fr: Tentative d'une opération de déplacement ou I<target> est un descendant de I<source>.
it: È stato tentato uno spostamento, mentre I<target> è discendente (è un sottoalbero) di I<source>.
uk: Було виконано спробу пересування, а I<ціль> є нащадком I<джерела>.

source: (In case no block device is required:) Table of dummy devices is full.
de: (Falls kein blockorientiertes Gerät benötigt wird:) Die Tabelle der Platzhaltergeräte ist voll.
fr: (Dans le cas où un périphérique bloc n'est pas nécessaire\ :) Table de périphériques factices pleine.
it: (Nel caso non sia necessario un dispositivo a blocchi:) La tabella dei dispositivi fittizi è piena.
uk: (У випадку, коли не потрібен блоковий пристрій:) Таблицю фіктивних пристроїв переповнено.

source: A pathname was longer than B<MAXPATHLEN>.
de: Ein Pfadname war länger als B<MAXPATHLEN>.
fr: Un des arguments est plus long que B<MAXPATHLEN>.
it: Un nome di percorso è più lungo di B<MAXPATHLEN>.
uk: Довжина шляху перевищує B<MAXPATHLEN>.

source: I<filesystemtype> not configured in the kernel.
de: Der I<Dateisystemtyp> ist nicht im Kernel konfiguriert.
fr: I<filesystemtype> n'est pas configuré dans le noyau.
it: I<filesystemtype> non configurato nel kernel.
uk: У ядрі не налаштовано I<тип_файлової_системи>.

source: A pathname was empty or had a nonexistent component.
de: Ein Pfadname war leer oder hatte eine nichtvorhandene Komponente.
fr: Un des chemins est vide ou a un composant inexistant.
it: Un nome di percorso era vuoto o aveva un componente inesistente.
uk: Шлях є порожнім або містить компонент, якого не існує.

source: The kernel could not allocate a free page to copy filenames or data into.
de: Der Kernel konnte keine freie Seite reservieren, um Dateinamen oder Daten hinein zu kopieren.
fr: Le noyau n'a pas pu allouer suffisamment de mémoire.
it: Il kernel non può allocare una pagina libera in cui copiare nomi di file o dati.
uk: Ядру не вдалося розмістити у пам'яті вільну сторінку для копіювання туди назв файлів або даних.

source: I<source> is not a block device (and a device was required).
de: Die I<Quelle> ist kein blockorientiertes Gerät (und ein Gerät war erforderlich).
fr: I<source> n'est pas un périphérique bloc (et un périphérique était nécessaire).
it: I<source> non è un dispositivo a blocchi (ed era necessario un dispositivo di questo tipo).
uk: I<джерело> не є блоковим пристроєм (і пристрій є обов'язковим).

source: I<target>, or a prefix of I<source>, is not a directory.
de: Das I<Ziel> oder ein Präfix der I<Quelle> ist kein Verzeichnis.
fr: I<target> ou un préfixe de I<source> n'est pas un répertoire.
it: I<target>, o un prefisso di I<source>, non è una directory.
uk: I<ціль> або префікс I<джерела>, не є каталогом.

source: The major number of the block device I<source> is out of range.
de: Die Major-Nummer des blockorientierten Gerätes I<Quelle> liegt außerhalb des Bereichs.
fr: Le nombre majeur du périphérique bloc I<source> est non autorisé.
it: Il "numero principale" del dispositivo a blocchi I<source> è fuori limite.
uk: Основний номер блокового пристрою I<джерело> перебуває поза припустимим діапазоном.

source: The caller does not have the required privileges.
de: Der Aufrufende verfügt nicht über die erforderlichen Rechte.
fr: L'appelant n'a pas les privilèges appropriés.
it: Il chiamante non ha i privilegi necessari.
uk: Команда, з якої викликано функцію, не має потрібних прав доступу.

source: An attempt was made to modify (B<MS_REMOUNT>) the B<MS_RDONLY>, B<MS_NOSUID>, or B<MS_NOEXEC> flag, or one of the "atime" flags (B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>) of an existing mount, but the mount is locked; see B<mount_namespaces>(7).
de: Es wurde versucht, die Schalter B<MS_RDONLY>, B<MS_NOSUID> oder B<MS_NOEXEC> oder einen der »atime«-Schalter (B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>) einer existierenden Einhängung zu verändern (B<MS_REMOUNT>), aber die Einhängung ist gesperrt; siehe B<mount_namespaces>(7).
uk: Було виконано спробу змінити (B<MS_REMOUNT>) прапорець B<MS_RDONLY>, B<MS_NOSUID> або B<MS_NOEXEC> або один з прапорців «atime» (B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>) наявного монтування, але монтування заблоковано; див. B<mount_namespaces>(7).

source: Mounting a read-only filesystem was attempted without giving the B<MS_RDONLY> flag. See B<EACCES>, above.
de: Es wurde versucht, ein nur-lesbares Dateisystem einzuhängen, ohne den Schalter B<MS_RDONLY> zu verwenden. Siehe B<EACCES> oben.
fr: Tentative de montage d'un système de fichiers en lecture seule sans donner l'attribut B<MS_RDONLY>. Voir B<EACCES> ci-dessus.
it: Si è tentato di montare un filesystem di sola lettura senza specificare il flag B<MS_RDONLY>. Si veda B<EACCES>, sopra.
uk: Було виконано спробу монтування придатної лише для читання файлової системи без зазначення прапорця B<MS_RDONLY>. Див. B<EACCES> вище.

source: VERSIONS
de: VERSIONEN
it: VERSIONI
uk: ВЕРСІЇ

source: The definitions of B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME>, and B<MS_UNBINDABLE> were added to glibc headers in version 2.12.
de: Die Definitionen von B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> und B<MS_UNBINDABLE> wurden in der Version 2.12 in die Glibc-Header aufgenommen.
fr: Les définitions de B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> et B<MS_UNBINDABLE> ont été ajoutées aux en-têtes de la glibc depuis la version 2.12.
it: Le definizioni di B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> e B<MS_UNBINDABLE> sono state aggiunte alle intestazioni di glibc nella versione 2.12.
uk: Визначення B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> та B<MS_UNBINDABLE> було додано до заголовків glibc у версії 2.12.

source: STANDARDS
uk: СТАНДАРТИ

source: This function is Linux-specific and should not be used in programs intended to be portable.
de: Diese Funktion ist Linux-spezifisch und sollte nicht in Programmen benutzt werden, die portabel gehalten werden sollen.
fr: Cette fonction est spécifique à Linux et ne doit pas être employée dans des programmes destinés à être portables.
it: Questa funzione è specifica di Linux e non deve essere usata in programmi pensati per essere portabili.
uk: Ця функція є специфічною для Linux. Нею не слід користуватися у програмах, які підлягають портуванню на інші операційні системи.

source: NOTES
de: ANMERKUNGEN
it: NOTE
uk: ПРИМІТКИ

source: Since Linux 2.4 a single filesystem can be mounted at multiple mount points, and multiple mounts can be stacked on the same mount point.
de: Seit Linux 2.4 kann ein einzelnes Dateisystem an mehreren Einhängepunkten eingehängt sein und mehrere Einhängungen können auf dem gleichen Einhängepunkt gestapelt werden.
fr: Depuis Linux 2.4 un même système de fichiers peut être visible en différents points, et plusieurs montages peuvent être empilés au même point.
it: A partire da Linux 2.4 un singolo filesystem può essere montato su punti di montaggio multipli, e su uno stesso punto di montaggio possono essere impilati più montaggi.
uk: Починаючи Linux 2.4, одну файлову систему може бути змонтовано до декількох точок монтування, а декілька монтувань може бути накладено на ту саму точку монтування.
