Repository: sebras/manpages-l10n
Catalog: po/*/man2/mount.2.po
Languages: de, fr, it, uk

source: Since Linux 2.6.26, the B<MS_REMOUNT> flag can be used with B<MS_BIND> to modify only the per-mount-point flags. This is particularly useful for setting or clearing the "read-only" flag on a mount without changing the underlying filesystem. Specifying I<mountflags> as:
de: Seit Linux 2.6.26 kann der Schalter B<MS_REMOUNT> mit B<MS_BIND> verwandt werden, um nur die einhängepunktabhängigen Schalter zu verändern. Dies ist besonders nützlich, um den »nur-lesbar«-Schalter auf einer Einhängung (zurück-)zusetzen, ohne das unterliegende Dateisystem zu verändern. Wird I<Einhängeschalter> als
uk: Починаючи з Linux 2.6.26, прапорцем B<MS_REMOUNT> можна скористатися у поєднанні із B<MS_BIND> для зміни прапорців монтування окремої точки монтування. Це, зокрема, корисно для встановлення або зняття прапорця «лише читання» для монтування без зміни базової файлової системи. Визначення I<прапорців_монтування> так:

source: will make access through this mountpoint read-only, without affecting other mounts.
de: angegeben, dann wird der Zugriff über diesen Einhängepunkt nur-lesbar, ohne andere Einhängungen zu beeinflussen.
uk: зробить доступ за допомогою цієї точки монтування придатним лише для читання, не впливаючи на інші точки монтування.

source: Creating a bind mount
de: Eine Bind-Einhängung erstellen
fr: Créer un montage miroir
it: Creare un montaggio di tipo bind
uk: Створення монтування з прив'язкою

source: If I<mountflags> includes B<MS_BIND> (available since Linux 2.4), then perform a bind mount. A bind mount makes a file or a directory subtree visible at another point within the single directory hierarchy. Bind mounts may cross filesystem boundaries and span B<chroot>(2) jails.
de: Falls I<Einhängeschalter> B<MS_BIND> (verfügbar seit Linux 2.4) enthält, dann wird eine Bind-Einhängung durchgeführt. Eine Bind-Einhängung macht eine Datei oder ein Verzeichnisunterbaum an einem anderen Punkt innerhalb der einzelnen Verzeichnishierarchie sichtbar. Bind-Einhängungen können Dateisystemgrenzen überwinden und sich über B<chroot>(2)-Gefängnisse hinweg erstrecken.
fr: Si I<mountflags> comprend B<MS_BIND> (disponible depuis Linux 2.4), effectuer un montage miroir. Un montage miroir rend visible un fichier ou la sous-arborescence d'un répertoire à un autre endroit d'une même hiérarchie de répertoires. Les montages miroir peuvent franchir les limites du système de fichiers et outrepasser les verrous B<chroot>(2).
it: Se I<mountflags> comprende B<MS_BIND> (disponibile da Linux 2.4 in poi) viene eseguito un montaggio di tipo bind. Un montaggio di tipo bind rende un file o un sottoalbero di directory visibile a un altro punto all'interno dell'unica gerarchia di directory. I montaggi di tipo bind possono attraversare i filesystem e oltrepassare le gabbie B<chroot>(2).
uk: Якщо до I<прапорців_монтування> включено B<MS_BIND> (доступний з Linux 2.4), буде виконано монтування з прив'язкою. Монтування з прив'язкою робить файл або ієрархію каталогу видимою із іншої точки у у тій самій ієрархії каталогів. Монтування з прив'язкою можуть перетинати межі файлової системи і виходити за межі пісочниць B<chroot>(2).

source: The I<filesystemtype> and I<data> arguments are ignored.
de: Die Argumente I<Dateisystemtyp> und I<Daten> werden ignoriert.
fr: Les paramètres I<filesystemtype> et I<data> sont ignorés.
it: Gli argomenti I<filesystemtype> e I<data> sono ignorati.
uk: Аргументи I<тип_файлової_системи> і I<дані> буде проігноровано.

source: The remaining bits (other than B<MS_REC>, described below) in the I<mountflags> argument are also ignored. (The bind mount has the same mount options as the underlying mount.) However, see the discussion of remounting above, for a method of making an existing bind mount read-only.
de: Die verbleibenden Bits (außer das unten beschriebene B<MS_REC>) im Argument I<Einhängeschalter> werden auch ignoriert. (Die Bind-Einhängung hat die gleichen Einhängeoptionen wie die unterliegende Einhängung.) Lesen Sie allerdings die Diskussion zum erneuten Einhängen weiter oben für eine Methode, wie Sie eine bestehende Bind-Einhängung auf nur-lesend ändern.
uk: Решту бітів (окрім B<MS_REC>, як це описано нижче) в аргументі I<прапорці_монтування> також буде проігноровано. (Монтування з прив'язкою матиме ті самі параметри монтування, що і базове монтування.) Втім, ознайомтеся із обговоренням щодо повторного монтування вище, щоб дізнатися про спосіб зробити наявне монтування з прив'язкою придатним лише до читання.

source: By default, when a directory is bind mounted, only that directory is mounted; if there are any submounts under the directory tree, they are not bind mounted. If the B<MS_REC> flag is also specified, then a recursive bind mount operation is performed: all submounts under the I<source> subtree (other than unbindable mounts) are also bind mounted at the corresponding location in the I<target> subtree.
de: Wenn ein Verzeichnis bind-eingehängt ist, ist standardmäßig nur dieses Verzeichnis eingehängt; falls es Untereinhängungen unter dem Verzeichnisbaum gibt, sind diese nicht bind-eingehängt. Falls auch der Schalter B<MS_REC> angegeben ist, dann wird eine rekursive Bind-Einhängung durchgeführt: Alle Untereinhängungen unter dem Unterbaum I<Quelle> (außer nicht bind-einhängbaren Einhängungen) werden auch an dem entsprechenden Ort im I<Ziel>-Unterbaum bind-eingehängt.
fr: Par défaut, quand un répertoire est monté en miroir, seul ce répertoire est monté ; s'il y a des sous-montages dans l'arborescence de répertoires, ils ne sont pas montés en miroir. Si l'attribut B<MS_REC> est indiqué également, une opération de montage miroir récursif est effectuée : tous les sous-montages de la sous-arborescnece de I<source> (sauf les montages qu'il n'est pas possible de monter en miroir) sont également montés en miroir à l'endroit correspondant dans la sous-arborescence I<target>.
it: In modo predefinito, quando una directory è montata con un montaggio di tipo bind, viene montata solo quella particolare directory; se ci sono dei sottomontaggi nell'albero della directory, questi non sono montati nel montaggio di tipo bind. Se viene specificato anche il flag B<MS_REC>, viene effettuata un'operazione di montaggio di tipo bind ricorsiva: tutti i sottomontaggi nel sottoalbero I<source> (tranne i montaggi non condivisibile (unbindable) con un'operazione di bind) sono anche montati con un montaggio di tipo bind alla posizione corrispondente nel sottoalbero I<target>.
uk: Типово, якщо каталог є змонтованим із прив'язкою, буде змонтовано лише цей каталог; якщо у ієрархії каталогів є якісь інші підлеглі монтування, їх не буде змонтовано з прив'язкою. Якщо також вказано прапорець B<MS_REC>, буде виконано рекурсивну дію з монтування з прив'язкою: усі підлеглі монтування у підлеглій ієрархії I<джерело> (окрім неприв'язуваних монтувань) також буде змонтовано з прив'язкою до відповідних місць у підлеглій ієрархії I<ціль>.

source: Changing the propagation type of an existing mount
de: Den Ausbreitungstyp einer bestehenden Einhängung ändern
fr: Modifier le type de propagation d'un montage existant
it: Cambiare il tipo di condivisione di un montaggio esistente
uk: Зміна типу поширення наявного монтування

source: If I<mountflags> includes one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> (all available since Linux 2.6.15), then the propagation type of an existing mount is changed. If more than one of these flags is specified, an error results.
de: Falls I<Einhängeschalter> einen aus B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, B<MS_UNBINDABLE> (alle seit Linux 2.6.15 verfügbar) enthält, dann wird der Ausbreitungstyp einer bestehenden Einhängung geändert. Falls mehr als einer dieser Schalter angegeben wird, entsteht ein Fehler.
fr: Si I<mountflags> comprend B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> ou B<MS_UNBINDABLE> (disponibles depuis Linux 2.6.15), le type de propagation d'un montage existant est modifié. Si plus d'un de ces attributs est indiqué, cela provoque une erreur.
it: Se I<mountflags> include uno tra B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> o B<MS_UNBINDABLE> (tutti disponibili a partire da Linux 2.6.15), il tipo di condivisione di un montaggio esistente viene cambiato. Se si specifica più d'uno di questi flag, viene prodotto un errore.
uk: Якщо до I<прапорців_монтування> включено одне зі значень B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> або B<MS_UNBINDABLE> (усі доступні з версії Linux 2.6.15), буде змінено тип поширення наявного монтування. Якщо вказано декілька з цих прапорців, результатом буде помилка.

source: The only other flags that can be specified while changing the propagation type are B<MS_REC> (described below) and B<MS_SILENT> (which is ignored).
de: Die einzigen anderen Schalter, die beim Ändern des Ausbreitungstyps verwandt werden können, sind B<MS_REC> (nachfolgend beschrieben) und B<MS_SILENT> (der stillschweigend ignoriert wird).
fr: Les seuls autres attributs qui peuvent être indiqués pendant un changement de type de propagation sont B<MS_REC> (décrit ci-dessous) et B<MS_SILENT> (qui est ignoré).
it: I soli altri flag che possono essere specificati nel cambiare il tipo di condivisione sono B<MS_REC> (descritto sotto) e B<MS_SILENT> (che viene ignorato).
uk: Єдиними іншими прапорцями, які може бути вказано при зміні типу поширення, є B<MS_REC> (описано нижче) і B<MS_SILENT> (який буде проігноровано).

source: The I<source>, I<filesystemtype>, and I<data> arguments are ignored.
de: Die Argumente I<Quelle>, I<Dateisystemtyp> und I<Daten> werden ignoriert.
fr: Les paramètres I<source>, I<filesystemtype> et I<data> sont ignorés.
it: Gli argomenti I<source>, I<filesystemtype> e I<data> sono ignorati.
uk: Аргументи I<джерело>, I<тип_файлової_системи> і I<дані> буде проігноровано.

source: The meanings of the propagation type flags are as follows:
de: Die Ausbreitungstypschalter haben folgende Bedeutung:
fr: Voici la signification des attributs de types de propagation :
it: I tipi di condivisione richiesti dai flag hanno il seguente significato:
uk: Призначення прапорців типу поширення є таким:

source: Make this mount shared. Mount and unmount events immediately under this mount will propagate to the other mounts that are members of this mount's peer group. Propagation here means that the same mount or unmount will automatically occur under all of the other mounts in the peer group. Conversely, mount and unmount events that take place under peer mounts will propagate to this mount.
de: Damit wird dies eine Mehrfacheinhängung. Ein- und Aushängeereignisse, die direkt unter dieser Einhängung sind, werden sich zu allen Einhängungen, die Mitglieder der Peer-Gruppe dieser Einhängung sind, ausbreiten. Ausbreitung bedeutet hier, dass die gleiche Ein- oder Aushängung automatisch unter allen anderen Einhängungen in der Peer-Gruppe erfolgen wird. Umgekehrt werden Ein- und Aushängeereignisse, die unter den Peer-Einhängungen stattfinden, sich zu dieser Einhängung ausbreiten.
uk: Зробити це монтування спільним. Події з монтування та демонтування безпосередньо під цим монтуванням поширюватимуться на інші монтування, які є учасниками групи вузлів цього монтування. Поширення тут означає, що ту саму дію з монтування або демонтування буде автоматично виконано для усіх інших монтувань у групі вузлів. І навпаки, події з монтування або демонтування, які виконуватимуться під монтуваннями вузлів, поширюватимуться до цього монтування.

source: Make this mount private. Mount and unmount events do not propagate into or out of this mount.
de: Diese Einhängung wird privat. Ein- und Aushängeereignisse breiten sich nicht in oder aus dieser Einhängung heraus aus.
uk: Зробити це монтування приватним. Події з монтування і демонтування не поширюватимуться всередину і назовні від цього монтування.

source: If this is a shared mount that is a member of a peer group that contains other members, convert it to a slave mount. If this is a shared mount that is a member of a peer group that contains no other members, convert it to a private mount. Otherwise, the propagation type of the mount is left unchanged.
de: Wenn dies eine gemeinsame Einhängung ist, die ein Mitglied einer Peer-Gruppe ist, die andere Mitglieder enthält, dann wird sie in eine Slave-Einhängung umgewandelt. Falls dies eine gemeinsame Einhängung ist, die ein Mitglied einer Peer-Gruppe ist, die keine anderen Mitglieder enthält, dann wird sie in eine private Einhängung umgewandelt. Andernfalls bleibt der Ausbreitungstyp der Einhängung unverändert.
uk: Якщо це спільне монтування, яке є учасником групи вузлів, яка містить інших учасників, перетворити його на підлегле монтування. Якщо це спільне монтування, яке є учасником групи вузлів, яка не містить інших учасників, перетворити його на приватне монтування. В інших випадках тип поширення монтування буде залишено без змін.

source: When a mount is a slave, mount and unmount events propagate into this mount from the (master) shared peer group of which it was formerly a member. Mount and unmount events under this mount do not propagate to any peer.
de: Wenn eine Einhängung ein Slave ist, breiten sich Ein- und Aushängeereignisse in dieser Einhängung von der gemeinsamen (Master-)Peer-Gruppe aus, bei der sie früher ein Mitglied war. Ein- und Aushängeereignisse unterhalb dieser Einhängung breiten sich nicht zu einem Peer aus.
uk: Якщо монтування є підлеглим, події з монтування або демонтування поширюватимуться до цього монтування з (основної) спільної групи вузлів, учасником якої було раніше це монтування. Події з монтування і демонтування під цим монтуванням не поширюватимуться до жодного вузла.

source: A mount can be the slave of another peer group while at the same time sharing mount and unmount events with a peer group of which it is a member.
de: Eine Einhängung kann ein Slave einer anderen Peer-Gruppe sein und gleichzeitig die Ein- und Aushängeereignisse gemeinsam mit einer Peer-Gruppe nutzen, bei der er Mitglied ist.
uk: Монтування може бути підлеглим монтуванням іншої групи вузлів, одночасно поділяючи події з монтування і демонтування з групою вузлів, учасником якої воно є.

source: Make this mount unbindable. This is like a private mount, and in addition this mount can't be bind mounted. When a recursive bind mount (B<mount>() with the B<MS_BIND> and B<MS_REC> flags) is performed on a directory subtree, any unbindable mounts within the subtree are automatically pruned (i.e., not replicated) when replicating that subtree to produce the target subtree.
de: Diesen Einhängepunkt nicht bind-einhängbar machen. Dies ähnelt einer privaten Einhängung, zusätzlich kann diese Einhängung nicht bind-eingehängt werden. Wenn eine rekursive Bind-Einhängung (B<mount>() mit den Schaltern B<MS_BIND> und B<MS_REC>) auf einem Verzeichnisunterbaum durchgeführt wird, werden alle nicht-bind-einhängbaren Einhängepunkte innerhalb des Unterbaums automatisch abgeschnitten (d.h. nicht reproduziert), wenn der Unterbaum zum Erstellen des Zielbaumes reproduziert wird.
fr: Rendre impossible un montage en miroir. C'est comme un montage privé mais en plus, il n'est pas possible de monter ce montage en miroir. Quand un montage miroir (B<mount>() avec les attributs B<MS_BIND> et B<MS_REC>) récursif est effectué dans une sous-arborescence de répertoire, tous les points de montage qu'il n'est pas possible de monter en miroir dans la sous-arborescence sont automatiquement éliminés (c'est-à-dire non répliqués) lors de la réplication de cette sous-arborescence pour générer la sous-arborescence cible.
it: Rende questo montaggio non condivisibile unbindaable) con un'operazione di bind. È come un montaggio privato (private mount), e in più questo montaggio non può essere montato con un montaggio di tipo bind. Quando un montaggio di tipo bind ricorsivo (B<mount>() con i flag B<MS_BIND> e B<MS_REC>) è effettuato su un sottoalbero di directory, qualsiasi montaggio non condivisibile (unbindable) con un'operazione di bind all'interno del sottoalbero è automaticamente smontato (cioè, non replicato) quando si replica questo sottoalbero per produrre il sottoalbero di destinazione.
uk: Зробити це монтування неприв'язним. Таке монтування подібне до приватного, а на додачу, це монтування не можна буде використати як монтування з прив'язкою. Коли виконується рекурсивне монтування з прив'язкою (B<mount>() з прапорцями B<MS_BIND> і B<MS_REC>) для підлеглої ієрархії каталогу, усі неприв'язні монтування у підлеглій ієрархії буде автоматично прибрано (тобто не відтворено) при відтворенні цієї підлеглої ієрархії для відтворення підлеглої ієрархії цілі.

source: By default, changing the propagation type affects only the I<target> mount. If the B<MS_REC> flag is also specified in I<mountflags>, then the propagation type of all mounts under I<target> is also changed.
de: Standardmäßig betrifft die Änderung des Ausbreitungstyps nur die I<Ziel>-Einhängung. Falls auch der Schalter B<MS_REC> in I<Einhängeschalter> angegeben ist, dann wird der Ausbreitungstyp aller Einhängungen unter I<Ziel> auch geändert.
uk: Типово, зміна типу поширення стосується лише монтування I<ціль>. Якщо також вказано прапорець B<MS_REC> у I<прапорці_монтування>, буде також змінено тип поширення для усіх монтувань у I<цілі>.

source: For further details regarding mount propagation types (including the default propagation type assigned to new mounts), see B<mount_namespaces>(7).
de: Für weitere Details bezüglich Einhängeausbreitungstypen (einschließlich der neuen Einhängungen zugewiesenen Vorgabeausbreitungstypen) siehe B<mount_namespaces>(7).
fr: Pour plus de détails sur les types de propagation des montages (notamment celui par défaut affecté aux nouveaux montages), voir B<mount_namespaces>(7).
it: Per ulteriori dettagli sui tipi di condivisione del montaggio (compreso il tipo di condivisione predefinito assegnato ai nuovi montaggi, si veda B<mount_namespaces>(7).
uk: Докладніший опис типів поширення монтування (включно зі стандартним типом поширення, який надається новим монтуванням), див. B<mount_namespaces>(7).

source: Moving a mount
de: Verschieben einer Einhängung
fr: Déplacer un montage
it: Spostare un montaggio
uk: Пересування монтування

source: If I<mountflags> contains the flag B<MS_MOVE> (available since Linux 2.4.18), then move a subtree: I<source> specifies an existing mount and I<target> specifies the new location to which that mount is to be relocated. The move is atomic: at no point is the subtree unmounted.
de: Falls I<Einhängeschalter> den Schalter B<MS_MOVE> enthält (verfügbar seit Linux 2.4.18), dann wird ein Unterbaum verschoben. I<Quelle> gibt eine existierende Einhängung und I<Ziel> den neuen Ort an, zu dem die bestehende Einhängung hin verlegt werden soll. Das Verschieben ist atomar: Das Unterbaum wird zu keinem Zeitpunkt ausgehängt.
uk: Якщо I<прапорці_монтування> містить прапорець B<MS_MOVE> (доступний з версії Linux 2.4.18), пересунути підлеглу ієрархію: I<джерело> вказує на наявне монтування, а I<ціль> вказує нове місце, до якого має бути переміщено монтування. Пересування є атомарним: без точки підлеглу ієрархією буде демонтовано.

source: The remaining bits in the I<mountflags> argument are ignored, as are the I<filesystemtype> and I<data> arguments.
de: Die verbliebenen Bits im Argument I<Einhängeschalter> werden ignoriert, wie auch die Argumente I<Dateisystemtyp> und I<Daten>.
fr: Les autres bits du paramètre I<mountflags> sont ignorés, ainsi que les paramètres I<filesystemtype> et I<data>.
it: I rimanenti bit nell'argomento I<mountflags> vengono ignorati, poiché essi sono gli argomenti di I<filesystemtype> e I<data>.
uk: Решту бітів у аргументі I<прапорці_монтування> буде проігноровано, так само, як аргументи I<тип_файлової_системи> і I<дані>.

source: Creating a new mount
de: Eine Bind-Einhängung erstellen
uk: Створення нової точки монтування

source: If none of B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> is specified in I<mountflags>, then B<mount>() performs its default action: creating a new mount. I<source> specifies the source for the new mount, and I<target> specifies the directory at which to create the mount point.
de: Falls kein Schalter aus B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> und B<MS_UNBINDABLE> in I<Einhängeschalter> angegeben ist, führt B<mount>() seine Vorgabeaktion aus: Erstellung einer neuen Einhängung. I<Quelle> gibt die Quelle für die neue Einhängung an und I<Ziel> gibt das Verzeichnis an, an dem der Einhängepunkt erstellt werden soll.
uk: Якщо не вказано жодного з прапорців B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> і B<MS_UNBINDABLE> у I<прапорцях_монтування>, B<mount>() виконає типову дію: створення монтування. I<Джерело> вказує на джерело для нового монтування, а I<ціль> вказує на каталог, у якому слід створити точку монтування.

source: The I<filesystemtype> and I<data> arguments are employed, and further bits may be specified in I<mountflags> to modify the behavior of the call.
de: Die Argumente I<Dateisystemtyp> und I<Daten> werden eingesetzt und weitere Bits können in I<Einhängeschalter> angegeben werden, um das Verhalten des Aufrufs zu verändern.
fr: Les paramètres I<filesystemtype> et I<data> sont utilisés et d'autres bits peuvent être indiqués dans I<mountflags> pour modifier le comportement de l'appel.
it: Vengono impiegati gli argomenti I<filesystemtype> e I<data>, e ulteriori bit possono essere specificati in I<mountflags> per modificare il comportamento della chiamata.
uk: Для внесення змін до поведінки виклику буде використано аргументи I<тип_файлової_системи> і I<дані> і подальші біти, які може бути вказано у I<прапорцях_монтування>.

source: RETURN VALUE
de: RÜCKGABEWERT
fr: VALEUR RENVOYÉE
it: VALORE RESTITUITO
uk: ПОВЕРНУТЕ ЗНАЧЕННЯ

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.
fr: En cas de succès, zéro est renvoyé. En cas d'erreur, B<-1> est renvoyé et I<errno> est définie pour préciser l'erreur.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato per indicare l'errore.
uk: Якщо функцію буде успішно виконано, буде повернуто нуль. Якщо станеться помилка, буде повернуто -1 і встановлено I<errno> для позначення помилки.

source: ERRORS
de: FEHLER
fr: ERREURS
it: ERRORI
uk: ПОМИЛКИ

source: The error values given below result from filesystem type independent errors. Each filesystem type may have its own special errors and its own special behavior. See the Linux kernel source code for details.
de: Die im Folgenden aufgeführten Fehlerwerte resultieren aus vom Dateisystemtyp unabhängigen Fehlern. Jeder Dateisystemtyp kann seine eigenen speziellen Fehler und sein eigenes spezielles Verhalten aufweisen. Lesen Sie den Linux-Kernel-Quellcode, um Einzelheiten zu erfahren.
fr: Les erreurs détaillées ici sont indépendantes du type de système de fichiers. Chaque type de système peut avoir des codes d'erreurs spécifiques, et un comportement particulier. Consultez les sources du noyau Linux pour plus de détails.
it: I valori di errore indicati di seguito sono causati da errori indipendenti dal tipo di filesystem. Ciascun tipo di filesystem può avere i propri errori speciali e il suo comportamento speciale. Vedere il codice sorgente del kernel per dettagli.
uk: Значення помилок, які вказано нижче, є результатом обчислення кодів помилок, які є незалежними від типу файлової системи. У кожного типу файлової системи можуть бути власні спеціалізовані коди помилок і власна спеціалізована поведінка. Див. початковий код ядра Linux, щоб дізнатися більше.
