Repository: sebras/manpages-l10n
Catalog: po/*/man2/msgop.2.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: msgrcv, msgsnd - System V message queue operations
pl: msgrcv, msgsnd - przekazywanie komunikatów kolejki Systemu V

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: The I<msgp> argument is a pointer to a caller-defined structure of the following general form:
pl: Parametr I<msgp> jest wskaźnikiem do zdefiniowanej przez proces wywołujący struktury, której ogólna postać wygląda tak:

source: struct msgbuf { long mtype; /* message type, must be E<gt> 0 */ char mtext[1]; /* message data */ };
pl: struct msgbuf { long mtype; /* typ wiadomości, musi być E<gt> 0 */ char mtext[1]; /* dane wiadomości */ };

source: The I<mtext> field is an array (or other structure) whose size is specified by I<msgsz>, a nonnegative integer value. Messages of zero length (i.e., no I<mtext> field) are permitted. The I<mtype> field must have a strictly positive integer value. This value can be used by the receiving process for message selection (see the description of B<msgrcv>() below).
pl: Pole I<mtext> jest tablicą (lub inna strukturą) o rozmiarze określonym przez I<msgsz>, będącym nieujemną liczbą całkowitą. Dozwolone są komunikaty o zerowej długości (tzn. niezawierające pola I<mtext>). Wartość pola I<mtype> musi być liczbą ściśle dodatnią, która może służyć procesowi odbierającemu komunikaty do filtrowania kolejki (zobacz opis B<msgrcv>() poniżej).

source: The B<msgsnd>() system call appends a copy of the message pointed to by I<msgp> to the message queue whose identifier is specified by I<msqid>.
pl: Wywołanie systemowe B<msgsnd>() dołącza kopię komunikatu wskazywanego przez I<msgp> do kolejki o identyfikatorze określonym przez I<msqid>.

source: If sufficient space is available in the queue, B<msgsnd>() succeeds immediately. The queue capacity is governed by the I<msg_qbytes> field in the associated data structure for the message queue. During queue creation this field is initialized to B<MSGMNB> bytes, but this limit can be modified using B<msgctl>(2). A message queue is considered to be full if either of the following conditions is true:
pl: Gdy w kolejce jest wystarczająco dużo miejsca, to B<msgsnd>() natychmiast kończy się pomyślnie. (Pojemność kolejki określona jest w polu I<msg_qbytes> struktury danych stowarzyszonej z kolejką. Podczas tworzenia kolejki polu temu jest przypisywana wartość początkowa wynosząca B<MSGMNB> bajtów, lecz ograniczenie to może zostać zmienione za pomocą B<msgctl>(2)). Kolejka komunikatów jest uważana za pełną w jednym z następujących przypadków:

source: Adding a new message to the queue would cause the total number of bytes in the queue to exceed the queue's maximum size (the I<msg_qbytes> field).
pl: Dodanie nowego komunikatu do kolejki spowoduje, że suma bajtów w kolejki przekroczy maksymalny rozmiar kolejki (pole I<msg_qbytes>).

source: Adding another message to the queue would cause the total number of messages in the queue to exceed the queue's maximum size (the I<msg_qbytes> field). This check is necessary to prevent an unlimited number of zero-length messages being placed on the queue. Although such messages contain no data, they nevertheless consume (locked) kernel memory.
pl: Dodanie kolejnego komunikatu do kolejki spowoduje, że całkowita liczba komunikatów w kolejce przekroczy maksymalny rozmiar kolejki (pole I<msg_qbytes>). To sprawdzenie jest konieczne aby zapobiec umieszczaniu w kolejce nieograniczonej liczby komunikatów o zerowej długości. Choć takie komunikaty nie zawierają danych, to wciąż zajmują (zablokowaną) pamięć jądra.

source: If insufficient space is available in the queue, then the default behavior of B<msgsnd>() is to block until space becomes available. If B<IPC_NOWAIT> is specified in I<msgflg>, then the call instead fails with the error B<EAGAIN>.
pl: Jeśli w kolejce obecna jest niewystarczająca ilość wolnego miejsca, to domyślne zachowaniem B<msgsnd>() jest blokada do momentu uzyskania wolnej przestrzeni. Jeśli w I<msgflg> określono B<IPC_NOWAIT>, to zamiast tego wywołanie zwróci błąd B<EAGAIN>.

source: A blocked B<msgsnd>() call may also fail if:
pl: Wstrzymane wywołanie B<msgsnd>() może się także nie powieść, jeżeli:

source: the queue is removed, in which case the system call fails with I<errno> set to B<EIDRM>; or
pl: kolejka zostanie usunięta z systemu - w tym przypadku wywołanie systemowe zgłosi błąd, przypisując zmiennej I<errno> wartość B<EIDRM>;

source: a signal is caught, in which case the system call fails with I<errno> set to B<EINTR>;B<see> B<signal>(7). (B<msgsnd>() is never automatically restarted after being interrupted by a signal handler, regardless of the setting of the B<SA_RESTART> flag when establishing a signal handler.)
pl: zostanie przechwycony sygnał - wtedy wywołanie to powoduje przypisanie zmiennej I<errno> wartości B<EINTR>; patrz B<signal>(7) (B<msgsnd>() po przerwaniu przez obsługę sygnału nie jest nigdy automatycznie restartowane, niezależnie od ustawienia znacznika B<SA_RESTART> podanego podczas ustanawiania funkcji obsługi sygnału).

source: Upon successful completion the message queue data structure is updated as follows:
pl: Jeśli operacja zakończy się pomyślnie, to struktura danych opisująca kolejkę zostanie zmodyfikowana w następujący sposób:

source: I<msg_lspid> is set to the process ID of the calling process.
pl: I<msg_lspid> przypisany zostanie identyfikator procesu wykonującego tę operację.

source: I<msg_qnum> is incremented by 1.
pl: I<msg_qnum> zostanie zwiększone o 1.

source: I<msg_stime> is set to the current time.
pl: I<msg_stime> zostanie przypisany bieżący czas.

source: The B<msgrcv>() system call removes a message from the queue specified by I<msqid> and places it in the buffer pointed to by I<msgp>.
pl: Wywołanie systemowe B<msgrcv> usuwa komunikat z kolejki określonej przez I<msqid> i umieszcza go w buforze wskazywanym przez parametr I<msgp>.

source: The argument I<msgsz> specifies the maximum size in bytes for the member I<mtext> of the structure pointed to by the I<msgp> argument. If the message text has length greater than I<msgsz>, then the behavior depends on whether B<MSG_NOERROR> is specified in I<msgflg>. If B<MSG_NOERROR> is specified, then the message text will be truncated (and the truncated part will be lost); if B<MSG_NOERROR> is not specified, then the message isn't removed from the queue and the system call fails returning -1 with I<errno> set to B<E2BIG>.
pl: Parametr I<msgsz> określa maksymalny rozmiar w bajtach pola I<mtext> struktury wskazywanej przez parametr I<msgp>. Jeśli dane komunikatu zajmują więcej bajtów niż I<msgsz>, to wynik zależy od tego, czy w I<msgflg> przekazano znacznik B<MSG_NOERROR>. Jeżeli podano B<MSG_NOERROR>, to tekst komunikatu zostanie obcięty (obcięta część zostanie utracona); jeżeli B<MSG_NOERROR> nie występuje, to komunikat nie jest usuwany z kolejki, a wywołanie systemowe kończy się błędem, zwracając wartość -1 i ustawiając I<errno> na B<E2BIG>.

source: Unless B<MSG_COPY> is specified in I<msgflg> (see below), the I<msgtyp> argument specifies the type of message requested, as follows:
pl: Jeżeli podano B<MSG_COPY> w I<msgflg> (zob. poniżej), parametr I<msgtyp> określa rodzaj komunikatu w następujący sposób:

source: If I<msgtyp> is 0, then the first message in the queue is read.
pl: Jeśli I<msgtyp> jest równy 0, to czytany jest pierwszy komunikat z kolejki.

source: If I<msgtyp> is greater than 0, then the first message in the queue of type I<msgtyp> is read, unless B<MSG_EXCEPT> was specified in I<msgflg>, in which case the first message in the queue of type not equal to I<msgtyp> will be read.
pl: Jeśli I<msgtyp> ma wartość większą niż 0, to z kolejki odczytywany jest pierwszy komunikat o typie I<msgtyp>, chyba że w parametrze I<msgflg> zostanie ustawiony znacznik B<MSG_EXCEPT>, co spowoduje, że z kolejki zostanie odczytany pierwszy komunikat o typie różnym od I<msgtyp>.

source: If I<msgtyp> is less than 0, then the first message in the queue with the lowest type less than or equal to the absolute value of I<msgtyp> will be read.
pl: Jeśli I<msgtyp> ma wartość mniejszą niż 0, to z kolejki zostanie odczytany pierwszy komunikat o najniższym numerze typu, mniejszym lub równym wartości bezwzględnej I<msgtyp>.

source: The I<msgflg> argument is a bit mask constructed by ORing together zero or more of the following flags:
pl: Parametr I<msgflg> jest maską bitową, utworzoną jako alternatywa (OR) zera lub więcej następujących znaczników:

source: Return immediately if no message of the requested type is in the queue. The system call fails with I<errno> set to B<ENOMSG>.
pl: Nie wstrzymuje pracy procesu, jeśli w kolejce nie ma komunikatów odpowiedniego typu. Wywołanie systemowe zwróci wówczas błąd, przypisując zmiennej I<errno> wartość B<ENOMSG>.

source: B<MSG_COPY> (since Linux 3.8)
pl: B<MSG_COPY> (od Linuksa 3.8)

source: Nondestructively fetch a copy of the message at the ordinal position in the queue specified by I<msgtyp> (messages are considered to be numbered starting at 0).
pl: Nieniszcząco pobiega kopię komunikatu w pozycję porządkową w kolejce określoną przez I<msgtyp> (komunikaty są pomyślane do numerowania od 0).

source: This flag must be specified in conjunction with B<IPC_NOWAIT>, with the result that, if there is no message available at the given position, the call fails immediately with the error B<ENOMSG>. Because they alter the meaning of I<msgtyp> in orthogonal ways, B<MSG_COPY> and B<MSG_EXCEPT> may not both be specified in I<msgflg>.
pl: Tę flagę należy podać w połączeniu z B<IPC_NOWAIT>, co skutkuje tym, że jeśli w danej pozycji nie ma dostępnego komunikatu, to wywołanie natychmiast zwraca błąd B<ENOMSG>. Ponieważ zmienia to znaczenie I<msgtyp> w różny sposób, B<MSG_COPY> i B<MSG_EXCEPT> nie mogą być podane równocześnie w I<msgflg>.

source: The B<MSG_COPY> flag was added for the implementation of the kernel checkpoint-restore facility and is available only if the kernel was built with the B<CONFIG_CHECKPOINT_RESTORE> option.
pl: Flaga B<MSG_COPY> została dodana dla zaimplementowania w jądrze funkcji przywracania do punktu kontrolnego (checkpoint-restore) i jest dostępna wyłącznie wtedy, jeśli jądro zbudowano z opcją B<CONFIG_CHECKPOINT_RESTORE>.

source: Used with I<msgtyp> greater than 0 to read the first message in the queue with message type that differs from I<msgtyp>.
pl: Użyte z parametrem I<msgtyp> większym od 0, spowoduje odczytanie z kolejki pierwszego komunikatu o typie różnym od I<msgtyp>.

source: To truncate the message text if longer than I<msgsz> bytes.
pl: Spowoduje obcięcie komunikatu, jeśli jego dane są dłuższe niż I<msgsz> bajtów.

source: If no message of the requested type is available and B<IPC_NOWAIT> isn't specified in I<msgflg>, the calling process is blocked until one of the following conditions occurs:
pl: Jeśli w kolejce nie ma komunikatu spełniającego te warunki, a znacznik B<IPC_NOWAIT> nie został ustawiony w I<msgflg>, to proces zostanie wstrzymany, dopóki nie nastąpi jedno z poniższych zdarzeń:

source: A message of the desired type is placed in the queue.
pl: Komunikat odpowiedniego typu zostanie umieszczony w kolejce.

source: The message queue is removed from the system. In this case, the system call fails with I<errno> set to B<EIDRM>.
pl: Kolejka zostanie usunięta z systemu. W tym przypadku wywołanie systemowe zgłosi błąd, przypisując zmiennej I<errno> wartość B<EIDRM>.

source: The calling process catches a signal. In this case, the system call fails with I<errno> set to B<EINTR>. (B<msgrcv>() is never automatically restarted after being interrupted by a signal handler, regardless of the setting of the B<SA_RESTART> flag when establishing a signal handler.)
pl: Proces wywołujący przechwytuje sygnał. W takim przypadku wywołanie systemowe kończy się niepowodzeniem, ustawiając I<errno> na B<EINTR>. (B<msgrcv>() po przerwaniu przez obsługę sygnału nie jest nigdy automatycznie restartowane, niezależnie od ustawienia znacznika B<SA_RESTART> podczas ustanawiania funkcji obsługi sygnału).

source: I<msg_lrpid> is set to the process ID of the calling process.
pl: I<msg_lrpid> przyjmie wartość równą identyfikatorowi wołającego procesu

source: I<msg_qnum> is decremented by 1.
pl: I<msg_qnum> zostanie zmniejszone o 1.

source: I<msg_rtime> is set to the current time.
pl: I<msg_rtime> zostanie przypisany bieżący czas.

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: ERRORS
pl: BŁĘDY

source: The message can't be sent due to the I<msg_qbytes> limit for the queue and B<IPC_NOWAIT> was specified in I<msgflg>.
pl: Komunikat nie może zostać wysłany z powodu ograniczenia I<msg_qbytes> dotyczącego kolejki, a nie przekazano znacznika B<IPC_NOWAIT> w parametrze I<mgsflg>.

source: The address pointed to by I<msgp> isn't accessible.
pl: Adres wskazywany przez I<msgp> jest niedostępny.

source: The message queue was removed.
pl: Kolejka komunikatów została usunięta.

source: Sleeping on a full message queue condition, the process caught a signal.
pl: Podczas oczekiwania na zwolnienie miejsca w kolejce, proces przechwycił sygnał.

source: Invalid I<msqid> value, or nonpositive I<mtype> value, or invalid I<msgsz> value (less than 0 or greater than the system value B<MSGMAX>).
pl: Niewłaściwa wartość I<msqid>, I<mtype> (powinna być dodatnia) lub I<msgsz> (powinna być większa lub równa B<0> i mniejsza lub równa B<MSGMAX>).

source: The system does not have enough memory to make a copy of the message pointed to by I<msgp>.
pl: Brak w systemie pamięci na skopiowanie komunikatu wskazywanego przez I<msgp>.

source: The message text length is greater than I<msgsz> and B<MSG_NOERROR> isn't specified in I<msgflg>.
pl: Tekst komunikatu jest dłuższy niż I<msgsz> i nie ustawiono znacznika B<MSG_NOERROR> w parametrze I<msgflg>.

source: While the process was sleeping to receive a message, the message queue was removed.
pl: Proces oczekiwał na komunikat, ale w międzyczasie kolejka została usunięta.

source: While the process was sleeping to receive a message, the process caught a signal; see B<signal>(7).
pl: Proces przechwycił sygnał podczas oczekiwania na odebranie komunikatu; patrz B<signal>(7).

source: I<msqid> was invalid, or I<msgsz> was less than 0.
pl: I<msqid> był niepoprawny lub I<msgsz> był mniejszy od 0.

source: B<EINVAL> (since Linux 3.14)
pl: B<EINVAL> (od Linuksa 3.14)

source: I<msgflg> specified B<MSG_COPY>, but not B<IPC_NOWAIT>.
pl: I<msgflg> określono jako B<MSG_COPY>, ale nie B<IPC_NOWAIT>.

source: I<msgflg> specified both B<MSG_COPY> and B<MSG_EXCEPT>.
pl: I<msgflg> określono jako B<MSG_COPY> i B<MSG_EXCEPT>.

source: B<IPC_NOWAIT> was specified in I<msgflg> and no message of the requested type existed on the message queue.
pl: Znacznik B<IPC_NOWAIT> został przekazany w I<msgflg>, ale w kolejce nie ma komunikatu żądanego typu.

source: B<IPC_NOWAIT> and B<MSG_COPY> were specified in I<msgflg> and the queue contains less than I<msgtyp> messages.
pl: B<IPC_NOWAIT> i B<MSG_COPY> zostały określone w I<msgflg>, a kolejka zawiera mniej niż I<msgtyp> komunikatów.

source: B<ENOSYS> (since Linux 3.8)
pl: B<ENOSYS> (od Linuksa 3.8)

source: CONFORMING TO
pl: ZGODNE Z

source: The B<MSG_EXCEPT> and B<MSG_COPY> flags are Linux-specific; their definitions can be obtained by defining the B<_GNU_SOURCE> feature test macro.
pl: Znaczniki B<MSG_EXCEPT> i B<MSG_COPY> są charakterystyczne dla Linuksa, ich definicje można pobrać przez zdefiniowane makra testującego funkcje B<_GNU_SOURCE>.

source: NOTES
pl: UWAGI

source: The I<msgp> argument is declared as I<struct msgbuf\ *> in glibc 2.0 and 2.1. It is declared as I<void\ *> in glibc 2.2 and later, as required by SUSv2 and SUSv3.
pl: Parametr I<msgp> jest deklarowany jako I<struct msgbuf\ *> w glibc 2.0 i glibc 2.1. W glibc 2.2 i późniejszych jest deklarowany jako I<void\ *>, zgodnie z wymaganiami SUSv2 i SUSv3.

source: The following limits on message queue resources affect the B<msgsnd>() call:
pl: Wywołania B<msgsnd>() dotyczą następujące ograniczenia systemowe:

source: Maximum size of a message text, in bytes (default value: 8192 bytes). On Linux, this limit can be read and modified via I</proc/sys/kernel/msgmax>.
pl: Maksymalny rozmiar tekstu komunikatu, w bajtach: (domyślna wartość: 8192 bajty). Pod Linuksem ten limit można odczytać i modyfikować, używając pliku I</proc/sys/kernel/msgmax>.

source: Maximum number of bytes that can be held in a message queue (default value: 16384 bytes). On Linux, this limit can be read and modified via I</proc/sys/kernel/msgmnb>. A privileged process (Linux: a process with the B<CAP_SYS_RESOURCE> capability) can increase the size of a message queue beyond B<MSGMNB> using the B<msgctl>(2) B<IPC_SET> operation.
pl: Maksymalna liczba bajtów która może być przechowywana w kolejce komunikatów (domyślna wartość: 16384 bajtów). Pod Linuksem można ten limit odczytać i zmienić, używając pliku I</proc/sys/kernel/msgmnb>. Proces uprzywilejowany (w Linuksie: proces z przywilejem B<CAP_SYS_RESOURCE>) może zwiększyć rozmiar kolejki komunikatów poza B<MSGMNB> za pomocą operacji B<IPC_SET> B<msgctl>(2).

source: The implementation has no intrinsic system-wide limits on the number of message headers (B<MSGTQL>) and the number of bytes in the message pool (B<MSGPOOL>).
pl: W tej implementacji nie ma jawnego systemowego ograniczenia liczby komunikatów przechowywanych w kolejce (B<MSGTQL>) i na rozmiar obszaru (w bajtach) przeznaczonego na komunikaty (B<MSGPOOL>).

source: BUGS
pl: BŁĘDY

source: In Linux 3.13 and earlier, if B<msgrcv>() was called with the B<MSG_COPY> flag, but without B<IPC_NOWAIT>, and the message queue contained less than I<msgtyp> messages, then the call would block until the next message is written to the queue. At that point, the call would return a copy of the message, I<regardless> of whether that message was at the ordinal position I<msgtyp>. This bug is fixed in Linux 3.14.
pl: W Linuksie 3.13 i wcześniejszych, jeśli B<msgrcv>() było wywołane ze znacznikiem B<MSG_COPY>, lecz bez B<IPC_NOWAIT>, a kolejka komunikatów zawierała mniej niż I<msgtyp> komunikatów, to wywołanie było zablokowane aż do zapisania kolejnego komunikatu do kolejki. W tym momencie wywołanie zwracało kopię komunikatu I<bez względu> na to czy komunikat był w pozycji I<msgtyp>. Błąd ten został naprawiony w jądrze Linux 3.14.

source: Specifying both B<MSG_COPY> and B<MSC_EXCEPT> in I<msgflg> is a logical error (since these flags impose different interpretations on I<msgtyp>). In Linux 3.13 and earlier, this error was not diagnosed by B<msgrcv>(). This bug is fixed in Linux 3.14.
pl: Podanie zarówno w I<msgflg> zarówno B<MSG_COPY> jak i B<MSC_EXCEPT> jest błędem logicznym (ponieważ oba te znaczniki wymagają innej interpretacji I<msgtyp>). W Linuksie 3.13 błąd ten nie był diagnozowany przez I<msgsrv>(). Zostało to naprawione w jądrze Linux 3.14.

source: EXAMPLES
pl: PRZYKŁADY

source: The program below demonstrates the use of B<msgsnd>() and B<msgrcv>().
pl: Program poniżej demonstruje użycie B<msgsnd>() i B<msgrcv>().

source: The example program is first run with the B<-s> option to send a message and then run again with the B<-r> option to receive a message.
pl: Przykładowy program jest początkowo uruchomiony z opcją B<-s>, aby wysłać komunikat, a następnie ponownie z opcją B<-r>, aby otrzymać komunikat.

source: The following shell session shows a sample run of the program:
pl: Poniższa sesja powłoki pokazuje przykładowy przebieg programu:

source: Program source
pl: Kod źródłowy programu

source: fprintf(stderr, "Usage: %s [options]\en", prog_name); fprintf(stderr, "Options are:\en"); fprintf(stderr, "-s send message using msgsnd()\en"); fprintf(stderr, "-r read message using msgrcv()\en"); fprintf(stderr, "-t message type (default is 1)\en"); fprintf(stderr, "-k message queue key (default is 1234)\en"); exit(EXIT_FAILURE); }
pl: fprintf(stderr, "Uzycie: %s [opcje]\en", nazwa_prog); fprintf(stderr, "Opcje:\en"); fprintf(stderr, "-s wysyła komunikat przez msgsnd()\en"); fprintf(stderr, "-r odczytuje komunikat przez msgrcv()\en"); fprintf(stderr, "-t typ komunikatu (domyślnie: 1)\en"); fprintf(stderr, "-k klucz kolejki komunikatu (domyślnie: 1234)\en"); exit(EXIT_FAILURE); }

source: time(&t); snprintf(msg.mtext, sizeof(msg.mtext), "a message at %s", ctime(&t));
pl: time(&t); snprintf(msg.mtext, sizeof(msg.mtext), "wiadomość o %s", ctime(&t));

source: int main(int argc, char *argv[]) { int qid, opt; int mode = 0; /* 1 = send, 2 = receive */ int msgtype = 1; int msgkey = 1234;
pl: int main(int argc, char *argv[]) { int qid, opt; int mode = 0; /* 1 = wysłanie, 2 = otrzymanie */ int msgtype = 1; int msgkey = 1234;

source: while ((opt = getopt(argc, argv, "srt:k:")) != -1) { switch (opt) { case \(aqs\(aq: mode = 1; break; case \(aqr\(aq: mode = 2; break; case \(aqt\(aq: msgtype = atoi(optarg); if (msgtype E<lt>= 0) usage(argv[0], "-t option must be greater than 0\en"); break; case \(aqk\(aq: msgkey = atoi(optarg); break; default: usage(argv[0], "Unrecognized option\en"); } }
pl: while ((opt = getopt(argc, argv, "srt:k:")) != -1) { switch (opt) { case \(aqs\(aq: mode = 1; break; case \(aqr\(aq: mode = 2; break; case \(aqt\(aq: msgtype = atoi(optarg); if (msgtype E<lt>= 0) usage(argv[0], "opcja -t musi być większa od 0\en"); break; case \(aqk\(aq: msgkey = atoi(optarg); break; default: usage(argv[0], "Nierozpoznana opcja\en"); } }

source: if (mode == 0) usage(argv[0], "must use either -s or -r option\en");
pl: if (mode == 0) usage(argv[0], "musi być opcją -s albo -r\en");

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: On failure both functions return -1 with I<errno> indicating the error, otherwise B<msgsnd>() returns 0 and B<msgrcv>() returns the number of bytes actually copied into the I<mtext> array.
pl: W przypadku niepowodzenia obydwa wywołania zwrócą -1 i przypiszą zmiennej I<errno> wartość określającą rodzaj błędu. W przeciwnym przypadku, B<msgsnd>() zwróci 0, a B<msgrvc>() zwróci liczbę bajtów skopiowanych z kolejki do tablicy I<mtext>.

source: When B<msgsnd>() fails, I<errno> will be set to one among the following values:
pl: Jeśli wywołanie B<msgsnd>() się nie powiedzie, to zmienna I<errno> przyjmie jedną z poniższych wartości:

source: When B<msgrcv>() fails, I<errno> will be set to one among the following values:
pl: Jeśli wywołanie B<msgrcv>() się nie powiedzie, to zmiennej I<errno> zostanie przypisana jedna z poniższych wartości:

source: The inclusion of I<E<lt>sys/types.hE<gt>> and I<E<lt>sys/ipc.hE<gt>> isn't required on Linux or by any version of POSIX. However, some old implementations required the inclusion of these header files, and the SVID also documented their inclusion. Applications intended to be portable to such old systems may need to include these header files.
pl: Dołączenie I<E<lt>sys/types.hE<gt>> i I<E<lt>sys/ipc.hE<gt>> nie jest wymagane na Linuksie ani przez żadną z wersji POSIX. Jednak niektóre stare implementacje wymagają dołączenia tych plików nagłówkowych, SVID również dokumentuje ich dołączenie. Aplikacje które mają być przenośne na tego typu stare systemy mogą wymagać dołączenia omawianych plików nagłówkowych.
