Repository: sebras/manpages-l10n
Catalog: po/*/man2/msgop.2.po
Languages: pl

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: I<MSG_COPY> was specified in I<msgflg>, and this kernel was configured without B<CONFIG_CHECKPOINT_RESTORE>.
pl: I<MSG_COPY> zostało określone w I<msgflg>, a jądro zostało skonfigurowane bez opcji B<CONFIG_CHECKPOINT_RESTORE>.

source: EXAMPLE
pl: PRZYKŁAD

source: if (msgsnd(qid, (void *) &msg, sizeof(msg.mtext), IPC_NOWAIT) == -1) { perror("msgsnd error"); exit(EXIT_FAILURE); } printf("sent: %s\en", msg.mtext); }
pl: if (msgsnd(qid, (void *) &msg, sizeof(msg.mtext), IPC_NOWAIT) == -1) { perror("błąd msgsnd"); exit(EXIT_FAILURE); } printf("wysłano: %s\en", msg.mtext); }

source: if (msgrcv(qid, (void *) &msg, sizeof(msg.mtext), msgtype, MSG_NOERROR | IPC_NOWAIT) == -1) { if (errno != ENOMSG) { perror("msgrcv"); exit(EXIT_FAILURE); } printf("No message available for msgrcv()\en"); } else printf("message received: %s\en", msg.mtext); }
pl: if (msgrcv(qid, (void *) &msg, sizeof(msg.mtext), msgtype, MSG_NOERROR | IPC_NOWAIT) == -1) { if (errno != ENOMSG) { perror("msgrcv"); exit(EXIT_FAILURE); } printf("Brak komunikatu dostępnego dla msgrcv()\en"); } else printf("komunikat otrzymano: %s\en", msg.mtext); }

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
