Repository: sebras/manpages-l10n
Catalog: po/*/man2/nice.2.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: nice - change process priority
de: nice - ändere die Prozesspriorität

source: SYNOPSIS
de: ÜBERSICHT

source: B<int nice(int >I<inc>B<);>
de: B<int nice(int >I<ink>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
de: _XOPEN_SOURCE || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: DESCRIPTION
de: BESCHREIBUNG

source: B<nice>() adds I<inc> to the nice value for the calling thread. (A higher nice value means a lower priority.)
de: B<nice>() fügt I<ink> zu dem Nice-Wert des aufrufenden Threads hinzu. (Ein höherer Nice-Wert bedeutet eine niedrigere Priorität.)

source: The range of the nice value is +19 (low priority) to -20 (high priority). Attempts to set a nice value outside the range are clamped to the range.
de: Der Bereich der Nice-Werte ist +19 (niedrige Priorität) bis -20 (hohe Priorität). Wird versucht, einen Nice-Wert außerhalb dieses Bereiches zu setzen, wird dieser auf diesen Bereich eingeschränkt.

source: Traditionally, only a privileged process could lower the nice value (i.e., set a higher priority). However, since Linux 2.6.12, an unprivileged process can decrease the nice value of a target process that has a suitable B<RLIMIT_NICE> soft limit; see B<getrlimit>(2) for details.
de: Traditionell konnten nur privilegierte Prozesse den Nice-Wert senken (d.h. eine höhere Priorität setzen). Seit Linux 2.6.12. kann allerdings ein nicht privilegierter Prozess den Nice-Wert des Zielprozesses senken, der eine geeignete weiche Begrenzung B<RLIMIT_NICE> hat, siehe B<getrlimit>(2) für Details.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, the new nice value is returned (but see NOTES below). On error, -1 is returned, and I<errno> is set to indicate the error.
de: Bei Erfolg wird der neue Nice-Wert zurückgegeben (siehe aber ANMERKUNGEN unten). Bei einem Fehler wird -1 zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.

source: A successful call can legitimately return -1. To detect an error, set I<errno> to 0 before the call, and check whether it is nonzero after B<nice>() returns -1.
de: Ein erfolgreicher Aufruf kann den gültigen Wert -1 zurückliefern. Um einen Fehler zu erkennen, setzen Sie vor dem Aufruf I<errno> auf 0 und prüfen Sie, ob er von Null verschieden ist, nachdem B<nice>() -1 zurückgeliefert hat.

source: ERRORS
de: FEHLER

source: The calling process attempted to increase its priority by supplying a negative I<inc> but has insufficient privileges. Under Linux, the B<CAP_SYS_NICE> capability is required. (But see the discussion of the B<RLIMIT_NICE> resource limit in B<setrlimit>(2).)
de: Der aufrufende Prozess hat versucht, seine Priorität zu erhöhen, indem für I<ink> eine negative Zahl übergeben wurde. Allerdings hat der Prozess dafür keine ausreichenden Privilegien. Unter Linux ist die Capability B<CAP_SYS_NICE> erforderlich (siehe aber auch die Erläuterung der Ressourcenbeschränkung B<RLIMIT_NICE> in B<setrlimit>(2)).

source: CONFORMING TO
de: KONFORM ZU

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. However, the raw system call and (g)libc (earlier than glibc 2.2.4) return value is nonstandard, see below.
de: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Allerdings ist der Rückgabewert unter Linux und (G)libc (vorGlibc 2.2.4) nicht standardisiert, siehe unten.

source: NOTES
de: ANMERKUNGEN

source: For further details on the nice value, see B<sched>(7).
de: Für weitere Details über den Nice-Wert siehe B<sched>(7).

source: I<Note>: the addition of the "autogroup" feature in Linux 2.6.38 means that the nice value no longer has its traditional effect in many circumstances. For details, see B<sched>(7).
de: I<Hinweis>: Die Hinzunahme der Funktionalität »autogroup« in Linux 2.6.38 bedeutet, dass der Nice-Wert in vielen Situationen nicht mehr seinen traditionellen Effekt erreicht. Für Details siehe B<sched>(7).

source: C library/kernel differences
de: Unterschiede C-Bibliothek/Kernel

source: POSIX.1 specifies that B<nice>() should return the new nice value. However, the raw Linux system call returns 0 on success. Likewise, the B<nice>() wrapper function provided in glibc 2.2.3 and earlier returns 0 on success.
de: POSIX.1 legt fest, dass B<nice>() den neuen Nice-Wert zurückgeben soll. Allerdings gibt der rohe Linux-Systemaufruf bei Erfolg Null zurück. Entsprechend liefert die durch Glibc 2.2.3 und älter bereitgestellte Wrapper-Funktion B<nice>() im Erfolgsfall Null zurück.

source: Since glibc 2.2.4, the B<nice>() wrapper function provided by glibc provides conformance to POSIX.1 by calling B<getpriority>(2) to obtain the new nice value, which is then returned to the caller.
de: Seit Glibc 2.2.4 stellt die durch Glibc bereitgestellte Wrapperfunktion von B<nice>() Konformität zu Posix.1 dar, indem sie B<getpriority>(2) aufruft, um den neue Nice-Wert zu ermitteln, der dann dem Aufrufenden zurückgeliefert wird.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: B<int nice(int >I<inc>B<);>
de: B<int nice(int >I<ink>B<);>

source: B<nice>(): _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
de: B<nice>(): _XOPEN_SOURCE || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: On success, the new nice value is returned (but see NOTES below). On error, -1 is returned, and I<errno> is set appropriately.
de: Bei Erfolg wird der neue Nice-Wert zurückgegeben (siehe aber ANMERKUNGEN unten). Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: B<nice>() adds I<inc> to the nice value for the calling thread. (A higher nice value means a low priority.)
de: B<nice>() fügt I<ink> zu dem Nice-Wert des aufrufenden Threads hinzu. (Ein höherer Nice-Wert bedeutet eine niedrigere Priorität.)

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
