Repository: sebras/manpages-l10n
Catalog: po/*/man2/pkey_alloc.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: pkey_alloc, pkey_free - allocate or free a protection key
fr: pkey_alloc, pkey_free - allouer ou libérer une clé de protection

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>
fr: B<#define _GNU_SOURCE> /* Consultez feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>

source: B<pkey_alloc>() allocates a protection key (pkey) and allows it to be passed to B<pkey_mprotect>(2).
fr: B<pkey_alloc>() alloue une clé de protection (pkey) et lui permet d'être transmise à B<pkey_mprotect>(2).

source: The B<pkey_alloc>() I<flags> is reserved for future use and currently must always be specified as 0.
fr: L'I<argument> de B<pkey_alloc>() est réservé à une utilisation future et doit toujours valoir B<0> actuellement.

source: The B<pkey_alloc>() I<access_rights> argument may contain zero or more disable operations:
fr: Le paramètre I<access_rights> de B<pkey_alloc>() peut contenir zéro ou plusieurs opérations désactivées :

source: Disable all data access to memory covered by the returned protection key.
fr: Désactiver tous les accès aux données de la mémoire gérée par la clé de protection renvoyée.

source: Disable write access to memory covered by the returned protection key.
fr: Désactiver l'accès en écriture à la mémoire gérée par la clé de protection renvoyée.

source: B<pkey_free>() frees a protection key and makes it available for later allocations. After a protection key has been freed, it may no longer be used in any protection-key-related operations.
fr: B<pkey_free>() libère une clé de protection et la rend disponible pour de futures allocations. Après qu'une clé de protection a été libérée, elle ne peut plus être utilisée dans aucune opération de protection liée à une clé.

source: An application should not call B<pkey_free>() on any protection key which has been assigned to an address range by B<pkey_mprotect>(2) and which is still in use. The behavior in this case is undefined and may result in an error.
fr: Une application ne doit pas appeler B<pkey_free>() sur une clé de protection qui a été affectée à une plage d'adresses par B<pkey_mprotect>(2) et en cours d'utilisation. Dans ce cas, le comportement n'est pas défini et peut aboutir à une erreur.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: ERRORS
fr: ERREURS

source: I<pkey>, I<flags>, or I<access_rights> is invalid.
fr: I<pkey>, I<flags> ou I<access_rights> n'est pas valable.

source: (B<pkey_alloc>()) All protection keys available for the current process have been allocated. The number of keys available is architecture-specific and implementation-specific and may be reduced by kernel-internal use of certain keys. There are currently 15 keys available to user programs on x86.
fr: (B<pkey_alloc>()) Toutes les clés de protection disponibles pour le processus actuel ont été allouées. Le nombre de clés disponibles est spécifique à l'architecture et à l'implémentation, il peut être réduit par une utilisation interne du noyau de certaines clés. Il y a actuellement 15 clés disponibles pour les programmes de l'utilisateur sur x86.

source: This error will also be returned if the processor or operating system does not support protection keys. Applications should always be prepared to handle this error, since factors outside of the application's control can reduce the number of available pkeys.
fr: Cette erreur sera aussi renvoyée si le processeur ou le système d'exploitation ne gère pas les clés de protection. Les applications doivent toujours être prêtes à gérer cette erreur, puisque des facteurs hors de contrôle de l'application peuvent réduire le nombre de clés disponibles.

source: B<pkey_alloc>() and B<pkey_free>() were added to Linux in kernel 4.9; library support was added in glibc 2.27.
fr: B<pkey_alloc>() et B<pkey_free>() ont été ajoutés à Linux dans le noyau 4.9 ; la glibc le gère depuis la version 2.27.

source: CONFORMING TO
fr: CONFORMITÉ

source: The B<pkey_alloc>() and B<pkey_free>() system calls are Linux-specific.
fr: Les appels système B<pkey_alloc>() et B<pkey_free>() sont spécifiques à Linux.

source: B<pkey_alloc>() is always safe to call regardless of whether or not the operating system supports protection keys. It can be used in lieu of any other mechanism for detecting pkey support and will simply fail with the error B<ENOSPC> if the operating system has no pkey support.
fr: Il est toujours sûr d'appeler B<pkey_alloc>(), que le système d'exploitation gère ou non les clés de protection. Il peut être utilisé à la place de tout autre mécanisme de détection de gestion de pkey et il échouera simplement avec l'erreur B<ENOSPC> si le système d'exploitation ne gère pas pkey.

source: The kernel guarantees that the contents of the hardware rights register (PKRU) will be preserved only for allocated protection keys. Any time a key is unallocated (either before the first call returning that key from B<pkey_alloc>() or after it is freed via B<pkey_free>()), the kernel may make arbitrary changes to the parts of the rights register affecting access to that key.
fr: Le noyau s'assure que le contenu des registres de droits du matériel (PKRU) ne sera conservé que pour les clés de protection allouées. À chaque fois qu'une clé n'est plus allouée (soit avant le premier appel renvoyant la clé à partir de B<pkey_alloc>(), soit après sa libération par B<pkey_free>()), le noyau peut effectuer des modifications arbitraires dans certaines parties du registre des droits concernant l'accès à cette clé.

source: EXAMPLES
fr: EXEMPLES

source: See B<pkeys>(7).
fr: Consultez B<pkeys>(7).

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.12 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: On success, B<pkey_alloc>() returns a positive protection key value. On success, B<pkey_free>() returns zero. On error, -1 is returned, and I<errno> is set appropriately.
fr: En cas de succès, B<pkey_alloc>() renvoie une valeur positive de clé de protection. En cas de succès, B<pkey_free>() renvoie zéro. En cas d'erreur, B<-1> est renvoyé et I<errno> est positionné en fonction.

source: EXAMPLE
fr: EXEMPLE

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.04 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
