Repository: sebras/manpages-l10n
Catalog: po/*/man2/poll.2.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: poll, ppoll - wait for some event on a file descriptor
fr: poll, ppoll - Attendre un événement concernant un descripteur de fichier

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: B<poll>() performs a similar task to B<select>(2): it waits for one of a set of file descriptors to become ready to perform I/O. The Linux-specific B<epoll>(7) API performs a similar task, but offers features beyond those found in B<poll>().
fr: B<poll>() fait la même chose que B<select>(2)\ : il attend que l'un des descripteurs de fichier soit prêt pour des entrées et sorties. L'API de B<epoll>(7) spécifique à Linux fait la même chose, mais avec des fonctionnalités allant au-delà de celles de B<poll>().

source: The set of file descriptors to be monitored is specified in the I<fds> argument, which is an array of structures of the following form:
fr: L'ensemble de descripteurs de fichier à surveiller est indiqué dans l'argument I<fds> qui est un tableau de structures de la forme suivante\ :

source: struct pollfd { int fd; /* file descriptor */ short events; /* requested events */ short revents; /* returned events */ };
fr: struct pollfd { int fd; /* Descripteur de fichier */ short events; /* Événements attendus */ short revents; /* Événements détectés */ };

source: The caller should specify the number of items in the I<fds> array in I<nfds>.
fr: L'appelant doit spécifier le nombre d'éléments du tableau I<fds> dans I<nfds>.

source: The field I<events> is an input parameter, a bit mask specifying the events the application is interested in for the file descriptor I<fd>. This field may be specified as zero, in which case the only events that can be returned in I<revents> are B<POLLHUP>, B<POLLERR>, and B<POLLNVAL> (see below).
fr: Le champ I<events> est un paramètre d'entrée, un masque de bits indiquant les événements qui intéressent l'application pour le descripteur de fichier I<fd>. Ce champ peut être nul, auquel cas les seuls événements qui peuvent être renvoyés dans I<revents> sont B<POLLHUP>, B<POLLERR> et B<POLLNVAL> (voir ci-dessous).

source: The field I<revents> is an output parameter, filled by the kernel with the events that actually occurred. The bits returned in I<revents> can include any of those specified in I<events>, or one of the values B<POLLERR>, B<POLLHUP>, or B<POLLNVAL>. (These three bits are meaningless in the I<events> field, and will be set in the I<revents> field whenever the corresponding condition is true.)
fr: Le champ I<revents> est un paramètre de sortie, rempli par le noyau avec les événements qui se sont effectivement produits, d'un des types demandés par I<events> ou de l'une des valeurs B<POLLERR>, B<POLLHUP> ou B<POLLNVAL>. (Ces trois bits n'ont pas de signification dans la demande I<events> et se trouvent positionnés dans la valeur de retour I<revents> si l'une des conditions correspondantes se produit.)

source: If none of the events requested (and no error) has occurred for any of the file descriptors, then B<poll>() blocks until one of the events occurs.
fr: Si aucun événement attendu (ni aucune erreur) ne s'est déjà produit, B<poll>() bloque jusqu'à ce que l'un des événements se produise.

source: The I<timeout> argument specifies the number of milliseconds that B<poll>() should block waiting for a file descriptor to become ready. The call will block until either:
fr: L'argument I<timeout> définit le temps en milliseconde pendant lequel B<poll>() devrait bloquer en attendant que le descripteur de fichier soit prêt. L’appel bloquera jusqu’au premier événement suivant :

source: a file descriptor becomes ready;
fr: un descripteur de fichier devient prêt ;

source: the call is interrupted by a signal handler; or
fr: l’appel est interrompu par un gestionnaire de signal ;

source: the timeout expires.
fr: le délai expire.

source: Note that the I<timeout> interval will be rounded up to the system clock granularity, and kernel scheduling delays mean that the blocking interval may overrun by a small amount. Specifying a negative value in I<timeout> means an infinite timeout. Specifying a I<timeout> of zero causes B<poll>() to return immediately, even if no file descriptors are ready.
fr: Remarquez que l’intervalle I<timeout> sera arrondi à la granularité de l'horloge système et que les délais d'ordonnancement du noyau signifient que l'intervalle de blocage pourrait être dépassé d'une petite quantité. Une valeur négative de I<timeout> signifie un délai infini, alors qu'un I<timeout> nul force B<epoll>() à se terminer immédiatement, même si aucun descripteur de fichier n'est prêt.

source: The bits that may be set/returned in I<events> and I<revents> are defined in I<E<lt>poll.hE<gt>>:
fr: Les bits qui peuvent être activés ou renvoyés dans I<events> et I<revents> sont définis par I<E<lt>poll.hE<gt>>\ :

source: There is data to read.
fr: Il y a des données en attente de lecture.

source: There is some exceptional condition on the file descriptor. Possibilities include:
fr: Il existe une condition d'exception sur le descripteur de fichier. Parmi celles possibles :

source: There is out-of-band data on a TCP socket (see B<tcp>(7)).
fr: Des données dépassent sur un socket TCP (voir B<tcp>(7)).

source: A pseudoterminal master in packet mode has seen a state change on the slave (see B<ioctl_tty>(2)).
fr: Un pseudoterminal maître en mode paquet a vu un changement d'état sur l'esclave (voir B<ioctl_tty>(2)).

source: A I<cgroup.events> file has been modified (see B<cgroups>(7)).
fr: Un fichier I<cgroup.events> a été modifié (voir B<cgroups>(7)).

source: Writing is now possible, though a write larger than the available space in a socket or pipe will still block (unless B<O_NONBLOCK> is set).
fr: L'écriture est maintenant possible, mais une écriture plus grande que l'espace disponible sur un socket ou un tube bloquera encore (sauf si B<O_NONBLOCK> est positionné).

source: B<POLLRDHUP> (since Linux 2.6.17)
fr: B<POLLRDHUP> (depuis Linux 2.6.17)

source: Stream socket peer closed connection, or shut down writing half of connection. The B<_GNU_SOURCE> feature test macro must be defined (before including I<any> header files) in order to obtain this definition.
fr: Le correspondant sur un socket en mode flux a fermé la connexion ou bien a terminé la partie écriture de la connexion. La macro de test de fonctionnalité B<_GNU_SOURCE> doit être définie (avant d'inclure I<tout> fichier d'en\(hytête) pour obtenir cette définition.

source: Error condition (only returned in I<revents>; ignored in I<events>). This bit is also set for a file descriptor referring to the write end of a pipe when the read end has been closed.
fr: Condition d'erreur (renvoyée seulement dans I<revents> ; ignorée dans I<events>). Ce bit est aussi positionné pour un descripteur de fichier qui se rapporte à une fin d'écriture sur un tube lorsque la fin de lecture a été fermée.

source: Hang up (only returned in I<revents>; ignored in I<events>). Note that when reading from a channel such as a pipe or a stream socket, this event merely indicates that the peer closed its end of the channel. Subsequent reads from the channel will return 0 (end of file) only after all outstanding data in the channel has been consumed.
fr: Plantage (renvoyé seulement dans I<revents> ; ignoré dans I<events>). Remarquez qu'en lecture à partir d'un canal tel qu'un tube ou un socket de flux, cet événement indique simplement que le pair a fermé la fin de son canal. Les lectures suivantes à partir du canal ne renverront B<0> (fin de fichier) qu'après que toutes les données du canal aient été consommées.

source: Invalid request: I<fd> not open (only returned in I<revents>; ignored in I<events>).
fr: Requête non valable\ : I<fd> n'est pas ouvert (renvoyé seulement dans I<revents> ; ignoré dans I<events>).

source: When compiling with B<_XOPEN_SOURCE> defined, one also has the following, which convey no further information beyond the bits listed above:
fr: Lorsque B<_XOPEN_SOURCE> est défini à la compilation, les macros suivantes sont également définies (mais n'apportent pas d'informations supplémentaires par rapport aux bits listés ci\(hydessus\ :

source: Equivalent to B<POLLIN>.
fr: Équivalent à B<POLLIN>.

source: Priority band data can be read (generally unused on Linux).
fr: Des données prioritaires sont en attente de lecture (généralement inutilisé sous Linux).

source: Equivalent to B<POLLOUT>.
fr: Équivalent à B<POLLOUT>.

source: Priority data may be written.
fr: Des données prioritaires peuvent être écrites.

source: Linux also knows about, but does not use B<POLLMSG>.
fr: Linux connaît aussi B<POLLMSG>, mais ne l'utilise pas.

source: The relationship between B<poll>() and B<ppoll>() is analogous to the relationship between B<select>(2) and B<pselect>(2): like B<pselect>(2), B<ppoll>() allows an application to safely wait until either a file descriptor becomes ready or until a signal is caught.
fr: La relation entre B<poll>() et B<ppoll>() est similaire à la relation entre B<select>(2) et B<pselect>(2)\ : comme B<pselect>(2), B<ppoll>() permet à une application d'attendre de façon sûre que soit un descripteur de fichier soit prêt, soit un signal soit reçu.

source: Other than the difference in the precision of the I<timeout> argument, the following B<ppoll>() call:
fr: Mise à part la différence de précision de l'argument I<timeout>, l'appel B<ppoll>() suivant\ :

source: is nearly equivalent to I<atomically> executing the following calls:
fr: est presque équivalent à exécuter de façon I<atomique> les appels suivants :

source: The above code segment is described as I<nearly> equivalent because whereas a negative I<timeout> value for B<poll>() is interpreted as an infinite timeout, a negative value expressed in I<*tmo_p> results in an error from B<ppoll>().
fr: Le bout de code ci-dessus est décrit comme I<presque> équivalent parce qu’une valeur négative dans I<*tmo_p> donne une erreur de B<ppoll>(), tandis qu’une valeur négative de I<timeout> pour B<poll>() est interprétée comme un délai infini.

source: See the description of B<pselect>(2) for an explanation of why B<ppoll>() is necessary.
fr: Consultez la description de B<pselect>(2) pour une explication de la nécessité de B<ppoll>().

source: If the I<sigmask> argument is specified as NULL, then no signal mask manipulation is performed (and thus B<ppoll>() differs from B<poll>() only in the precision of the I<timeout> argument).
fr: Si le paramètre I<sigmask> est défini comme NULL, aucune manipulation de masque de signaux n'est effectuée (et ainsi B<ppoll>() ne diffère de B<poll>() que dans la précision du paramètre I<timeout>).

source: If I<tmo_p> is specified as NULL, then B<ppoll>() can block indefinitely.
fr: Si I<tmo_p> est NULL, B<ppoll>() pourra bloquer indéfiniment.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On error, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas d'erreur, la valeur de retour est B<-1> et I<errno> est définie pour préciser l'erreur.

source: ERRORS
fr: ERREURS

source: I<fds> points outside the process's accessible address space. The array given as argument was not contained in the calling program's address space.
fr: I<fds> pointe hors de l'espace d'adressage accessible. Le tableau donné en argument ne se trouvait pas dans l'espace d'adressage du programme appelant.

source: A signal occurred before any requested event; see B<signal>(7).
fr: Un signal a été reçu avant qu'un événement intéressant ne se produise ; voir B<signal>(7).

source: The I<nfds> value exceeds the B<RLIMIT_NOFILE> value.
fr: La valeur I<nfds> dépasse la valeur B<RLIMIT_NOFILE>.

source: Unable to allocate memory for kernel data structures.
fr: Impossible d'allouer de la mémoire pour des structures de données du noyau.

source: The B<poll>() system call was introduced in Linux 2.1.23. On older kernels that lack this system call, the glibc B<poll>() wrapper function provides emulation using B<select>(2).
fr: L'appel système B<poll>() a été introduit dans Linux 2.1.23. Sur les anciens noyaux sans cet appel système, la fonction enveloppe B<poll>() de la glibc fournit une émulation en utilisant B<select>(2).

source: The B<ppoll>() system call was added to Linux in kernel 2.6.16. The B<ppoll>() library call was added in glibc 2.4.
fr: L'appel système B<ppoll>() a été introduit dans Linux 2.6.16. La fonction de bibliothèque correspondante a été ajoutée dans la glibc 2.4.

source: B<poll>() conforms to POSIX.1-2001 and POSIX.1-2008. B<ppoll>() is Linux-specific.
fr: B<poll>() est conforme à POSIX.1-2001 et POSIX.1-2008. B<ppoll>() est spécifique à Linux.

source: The operation of B<poll>() and B<ppoll>() is not affected by the B<O_NONBLOCK> flag.
fr: L'opération de B<poll>() et B<ppoll>() n'est pas concernée par l'attribut B<O_NONBLOCK>.

source: On some other UNIX systems, B<poll>() can fail with the error B<EAGAIN> if the system fails to allocate kernel-internal resources, rather than B<ENOMEM> as Linux does. POSIX permits this behavior. Portable programs may wish to check for B<EAGAIN> and loop, just as with B<EINTR>.
fr: Sur d'autres systèmes UNIX, B<poll>() peut échouer avec l'erreur B<EAGAIN> si le système n'arrive pas à allouer des ressources internes au noyau, et non avec B<ENOMEM> comme sur Linux. POSIX autorise ce comportement. Les programmes portables peuvent vouloir vérifier B<EAGAIN> et tourner en boucle, comme avec B<EINTR>.

source: Some implementations define the nonstandard constant B<INFTIM> with the value -1 for use as a I<timeout> for B<poll>(). This constant is not provided in glibc.
fr: Certaines implémentations définissent la constante symbolique non standard B<INFTIM> de valeur B<-1>, à utiliser comme I<timeout> pour B<poll>(). Cette constante n'est pas fournie par la glibc.

source: For a discussion of what may happen if a file descriptor being monitored by B<poll>() is closed in another thread, see B<select>(2).
fr: Consultez B<select>(2) pour une discussion sur ce qui pourrait arriver si un descripteur de fichier surveillé par B<poll>() est fermé dans un autre thread.

source: C library/kernel differences
fr: différences entre bibliothèque C et noyau

source: The Linux B<ppoll>() system call modifies its I<tmo_p> argument. However, the glibc wrapper function hides this behavior by using a local variable for the timeout argument that is passed to the system call. Thus, the glibc B<ppoll>() function does not modify its I<tmo_p> argument.
fr: L'appel système B<ppoll>() sous Linux modifie son argument I<tmo_p>. Cependant, l'enveloppe fournie par la glibc cache ce comportement en utilisant une variable locale pour le délai qui est fournie à l'appel système. Ainsi, la fonction B<ppoll>() de la glibc ne modifie donc pas son argument I<tmo_p>.

source: The raw B<ppoll>() system call has a fifth argument, I<size_t sigsetsize>, which specifies the size in bytes of the I<sigmask> argument. The glibc B<ppoll>() wrapper function specifies this argument as a fixed value (equal to I<sizeof(kernel_sigset_t)>). See B<sigprocmask>(2) for a discussion on the differences between the kernel and the libc notion of the sigset.
fr: L'appel système B<ppoll>() brut a un cinquième paramètre, I<size_t sigsetsize>, qui indique la taille en octets du paramètre I<sigmask>. La fonction enveloppe B<ppoll>() de la glibc indique ce paramètre comme une valeur fixe (égale à I<sizeof(kernel_sigset_t)>). Voir B<sigprocmask>(2) pour un point sur les différences entre l'approche du noyau et de la libc de sigset.

source: BUGS
fr: BOGUES

source: See the discussion of spurious readiness notifications under the BUGS section of B<select>(2).
fr: Consultez la discussion sur les notifications non voulues dans la section BOGUES de B<select>(2).

source: EXAMPLES
fr: EXEMPLES

source: The program below opens each of the files named in its command-line arguments and monitors the resulting file descriptors for readiness to read (B<POLLIN>). The program loops, repeatedly using B<poll>() to monitor the file descriptors, printing the number of ready file descriptors on return. For each ready file descriptor, the program:
fr: Le programme ci-dessous ouvre chacun des fichiers nommés sur ses paramètres de la ligne de commande et surveille les descripteurs de fichier qui en résultent quand à leur possibilité d'être lus (B<POLLIN>). Le programme effectue une boucle de B<poll>() pour surveiller les descripteurs de fichier, affichant en retour le nombre de descripteurs de fichier prêts. Pour chaque descripteur disponible, le programme :

source: displays the returned I<revents> field in a human-readable form;
fr: affiche le champ I<revents> renvoyé sous une forme lisible par un humain ;

source: if the file descriptor is readable, reads some data from it, and displays that data on standard output; and
fr: si le descripteur de fichier est lisible, y lit des données et affiche ces données sur la sortie standard ; et

source: Suppose we run the program in one terminal, asking it to open a FIFO:
fr: Supposons qu'on lance le programme dans un terminal, en lui demandant d'ouvrir un FIFO :

source: $ B<mkfifo myfifo> $ B<./poll_input myfifo>
fr: $ B<mkfifo monfifo> $ B<./poll_input monfifo>

source: In a second terminal window, we then open the FIFO for writing, write some data to it, and close the FIFO:
fr: Dans une deuxième fenêtre de terminal, on ouvre alors le FIFO en écriture, on y écrit des données et on ferme le FIFO :

source: $ B<echo aaaaabbbbbccccc E<gt> myfifo>
fr: $ B<echo aaaaabbbbbccccc E<gt> monfifo>

source: In the terminal where we are running the program, we would then see:
fr: Dans le terminal où on exécute le programme, on verrait alors :

source: Opened "myfifo" on fd 3 About to poll() Ready: 1 fd=3; events: POLLIN POLLHUP read 10 bytes: aaaaabbbbb About to poll() Ready: 1 fd=3; events: POLLIN POLLHUP read 6 bytes: ccccc
fr: "monfifo" ouvert sur le fd 3 Préparation pour poll() Prêt : 1 fd=3 ; événements: POLLIN POLLHUP 10 octets lus : aaaaabbbbb Va poll() Prêt : 1 fd=3 ; événements : POLLIN POLLHUP lecture de 6 octets : ccccc

source: About to poll() Ready: 1 fd=3; events: POLLHUP closing fd 3 All file descriptors closed; bye
fr: Préparation pour poll() Prêt : 1 fd=3 ; événements : POLLHUP fermeture de fd 3 Tous les descripteurs de fichier sont fermés ; au revoir

source: In the above output, we see that B<poll>() returned three times:
fr: Dans la sortie ci-dessus, on voit que B<poll>() a renvoyé trois fois :

source: On the first return, the bits returned in the I<revents> field were B<POLLIN>, indicating that the file descriptor is readable, and B<POLLHUP>, indicating that the other end of the FIFO has been closed. The program then consumed some of the available input.
fr: Sur le premier retour, les bits renvoyés dans le champ I<revents> étaient B<POLLIN>, indiquant que le descripteur de fichier est lisible, et B<POLLHUP>, indiquant que l'autre extrémité du FIFO a été fermée. Puis le programme a consommé une partie de l'entrée disponible.

source: The second return from B<poll>() also indicated B<POLLIN> and B<POLLHUP>; the program then consumed the last of the available input.
fr: Le deuxième retour de B<poll>() indiquait aussi B<POLLIN> et B<POLLHUP> ; le programme a alors consommé la dernière partie de l’entrée disponible.

source: On the final return, B<poll>() indicated only B<POLLHUP> on the FIFO, at which point the file descriptor was closed and the program terminated.
fr: Sur le dernier retour, B<poll>() n'indiquait que B<POLLHUP> sur le FIFO, lemoment où le descripteur de fichier a été fermé et où le programme s'est terminé.

source: Program source
fr: Source du programme

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s file...\en", argv[0]); exit(EXIT_FAILURE); }
fr: if (argc E<lt> 2) { fprintf(stderr, "Utilisation : %s fichier...\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("Opened \e"%s\e" on fd %d\en", argv[j + 1], pfds[j].fd);
fr: printf("\e"%s\e" ouvert sur le fd %d\en", argv[j + 1], pfds[j].fd);

source: printf("Ready: %d\en", ready);
fr: printf("Prêt : %d\en", ready);

source: printf("All file descriptors closed; bye\en"); exit(EXIT_SUCCESS); }
fr: printf("Tous les descripteurs de fichier sont fermés ; au revoir\en"); exit(EXIT_SUCCESS); }

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>signal.hE<gt>> B<#include E<lt>poll.hE<gt>>
fr: B<#define _GNU_SOURCE> /* Consultez feature_test_macros(7) */ B<#include E<lt>signal.hE<gt>> B<#include E<lt>poll.hE<gt>>

source: The field I<fd> contains a file descriptor for an open file. If this field is negative, then the corresponding I<events> field is ignored and the I<revents> field returns zero. (This provides an easy way of ignoring a file descriptor for a single B<poll>() call: simply negate the I<fd> field. Note, however, that this technique can't be used to ignore file descriptor 0.)
fr: Le champ I<fd> contient un descripteur de fichier pour un fichier ouvert. Si ce champ est négatif, alors le champ I<events> correspondant est ignoré et le champ I<revents> renvoie zéro (cela permet d'ignorer facilement un descripteur de fichier pour un seul appel B<poll>() : il suffit d'utiliser l'opposé du champ I<fd> ; remarquez cependant que cette technique ne peut pas être utilisée pour ignorer le descripteur de fichier B<0>).

source: The I<tmo_p> argument specifies an upper limit on the amount of time that B<ppoll>() will block. This argument is a pointer to a structure of the following form:
fr: L'argument I<tmo_p> définit une limite supérieure sur le temps pendant lequel B<ppoll>() bloquera. Cet argument est un pointeur vers une structure de la forme suivante\ :

source: struct timespec { long tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
fr: struct timespec { long tv_sec; /* secondes */ long tv_nsec; /* nanosecondes */ };

source: On success, B<poll>() returns a nonnegative value which is the number of elements in the I<pollfds> whose I<revents> fields have been set to a nonzero value (indicating an event or an error). A return value of zero indicates that the system call timed out before any file descriptors became read.
fr: En cas de succès, B<poll>() renvoie une valeur non négative qui est un nombre d'éléments dans I<pollfds> dont les champs I<revents> ont été positionnés sur une autre valeur que zéro (indiquant un événement ou une erreur). Un code de retour de zéro indique que l'appel système a atteint son délai avant qu'un descripteur de fichier ne soit lu.

source: On error, -1 is returned, and I<errno> is set to indicate the cause of the error.
fr: En cas d'erreur, la valeur de retour est B<-1> et I<errno> est définie pour indiquer la cause de l'erreur.

source: (B<ppoll>()) The timeout value expressed in I<*ip> is invalid (negative).
fr: (B<ppoll>()) La valeur du délai exprimée dans I<*ip> n'est pas valable (négative).

source: CONFORMING TO
fr: CONFORMITÉ

source: if the file descriptors was not readable, but some other event occurred (presumably B<POLLHUP>), closes the file descriptor.
fr: si le descripteur de fichier n'était pas lisible mais qu'un autre événement s'est produit (probablement B<POLLHUP>), ferme le descripteur de fichier.
