Repository: sebras/manpages-l10n
Catalog: po/*/man2/poll.2.po
Languages: fr

source: Licensed under GNU General Public License v2 or later. */ #include E<lt>poll.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>sys/types.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt>
fr: Sous licence GNU General Public License v2 ou postérieure. */ #include E<lt>poll.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>sys/types.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt>

source: /* Open each file on command line, and add it \(aqpfds\(aq array */
fr: /* Ouvrir chaque fichier de la ligne de commande et l'ajouter au tableau \(aqpfds\(aq */

source: /* Keep calling poll() as long as at least one file descriptor is open */
fr: /* Conserver poll() au moins aussi longtemps qu'un descripteur de fichier est ouvert */

source: printf("About to poll()\en"); ready = poll(pfds, nfds, -1); if (ready == -1) errExit("poll");
fr: printf("Va poll()\en"); ready = poll(pfds, nfds, -1); if (ready == -1) errExit("poll");

source: /* Deal with array returned by poll() */
fr: /* Gérer le tableau renvoyé par poll() */

source: if (pfds[j].revents != 0) { printf(" fd=%d; events: %s%s%s\en", pfds[j].fd, (pfds[j].revents & POLLIN) ? "POLLIN " : "", (pfds[j].revents & POLLHUP) ? "POLLHUP " : "", (pfds[j].revents & POLLERR) ? "POLLERR " : "");
fr: if (pfds[j].revents != 0) { printf(" fd=%d ; événements : %s%s%s\en", pfds[j].fd, (pfds[j].revents & POLLIN) ? "POLLIN " : "", (pfds[j].revents & POLLHUP) ? "POLLHUP " : "", (pfds[j].revents & POLLERR) ? "POLLERR " : "");

source: if (pfds[j].revents & POLLIN) { ssize_t s = read(pfds[j].fd, buf, sizeof(buf)); if (s == -1) errExit("read"); printf(" read %zd bytes: %.*s\en", s, (int) s, buf); } else { /* POLLERR | POLLHUP */ printf(" closing fd %d\en", pfds[j].fd); if (close(pfds[j].fd) == -1) errExit("close"); num_open_fds--; } } } }
fr: if (pfds[j].revents & POLLIN) { ssize_t s = read(pfds[j].fd, buf, sizeof(buf)); if (s == -1) errExit("read"); printf(" lecture de %zd octets : %.*s\en", s, (int) s, buf); } else { /* POLLERR | POLLHUP */ printf(" fermeture du fd %d\en", pfds[j].fd); if (close(pfds[j].fd) == -1) errExit("close"); num_open_fds--; } } } }

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<poll>() performs a similar task to B<select>(2): it waits for one of a set of file descriptors to become ready to perform I/O.
fr: B<poll>() fait la même chose que B<select>(2)\ : il attend que l'un des descripteurs de fichier soit prêt pour des entrées et sorties.

source: Writing is now possible, though a write larger that the available space in a socket or pipe will still block (unless B<O_NONBLOCK> is set).
fr: L'écriture est maintenant possible, mais une écriture plus grande que l'espace disponible d'un socket ou d'un tube bloquera (sauf si B<O_NONBLOCK> est positionné).

source: On success, a positive number is returned; this is the number of structures which have nonzero I<revents> fields (in other words, those descriptors with events or errors reported). A value of 0 indicates that the call timed out and no file descriptors were ready. On error, -1 is returned, and I<errno> is set appropriately.
fr: En cas de réussite, ces appels renvoient une valeur positive représentant le nombre de structures ayant un champ I<revents> non nul, c'est-à-dire le nombre de structures pour lesquelles un événement attendu ou une erreur se sont produits. Une valeur de retour nulle indique un dépassement du délai d'attente. En cas d'échec, ils renvoient B<-1>, et I<errno> contient le code d'erreur.

source: The array given as argument was not contained in the calling program's address space.
fr: Le tableau fourni en argument n'est pas dans l'espace d'adressage du processus appelant.

source: There was no space to allocate file descriptor tables.
fr: Pas assez de mémoire pour allouer la table des descripteurs de fichier.

source: The B<poll>() system call was introduced in Linux 2.1.23. On older kernels that lack this system call, the glibc (and the old Linux libc) B<poll>() wrapper function provides emulation using B<select>(2).
fr: L'appel système B<poll>() a été introduit dans Linux 2.1.23. Sur les anciens noyaux sans cet appel système, la fonction enveloppe B<poll>() de la glibc (et de l'ancienne libc Linux) fournit une émulation en utilisant B<select>(2).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
