Repository: sebras/manpages-l10n
Catalog: po/*/man2/reboot.2.po
Languages: de, nl

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG
nl: NAAM

source: reboot - reboot or enable/disable Ctrl-Alt-Del
de: reboot - Neustart oder Strg-Alt-Entf ein-/ausschalten
nl: reboot - herstarten of in/uitschakelen van Ctrl-Alt-Del

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT
nl: SAMENVATTING

source: /* Since kernel version 2.1.30 there are symbolic names B<LINUX_REBOOT_*> for the constants and a fourth argument to the call: */
de: /* Seit Kernel-Version 2.1.30 gibt es die symbolischen Namen B<LINUX_REBOOT_*> für die Konstanten und ein viertes Argument für den Aufruf: */

source: B<#include E<lt>linux/reboot.hE<gt> >/* Definition of B<LINUX_REBOOT_*> constants */ B<#include E<lt>sys/syscall.hE<gt> >/* Definition of B<SYS_*> constants */ B<#include E<lt>unistd.hE<gt>>
de: B<#include E<lt>linux/reboot.hE<gt> >/* Definition der B<LINUX_REBOOT_*>-Konstanten */ B<#include E<lt>sys/syscall.hE<gt> >/* Definition der B<SYS_*>-Konstanten */ B<#include E<lt>unistd.hE<gt>>

source: B<int syscall(SYS_reboot, int >I<magic>B<, int >I<magic2>B<, int >I<cmd>B<, void *>I<arg>B<);>
de: B<int syscall(SYS_reboot, int >I<Magik>B<, int >I<Magik2>B<, int >I<Befehl>B<, void *>I<Arg>B<);>

source: /* Under glibc and most alternative libc's (including uclibc, dietlibc, musl and a few others), some of the constants involved have gotten symbolic names B<RB_*>, and the library call is a 1-argument wrapper around the system call: */
de: /* Unter Glibc und der meisten alternativen Libcs (darunter Uclibc, Dietlibc, Musl und einige andere) haben einige beteiligte Konstanten symbolische B<RB_*>-Namen bekommen und der Bibliotheksaufruf ist ein Ein-Argument-Wrapper des Systemaufrufs: */

source: B<#include E<lt>sys/reboot.hE<gt> >/* Definition of B<RB_*> constants */ B<#include E<lt>unistd.hE<gt>>
de: B<#include E<lt>sys/reboot.hE<gt> >/* Definition der B<RB_*>-Konstanten */ B<#include E<lt>unistd.hE<gt>>

source: B<int reboot(int >I<cmd>B<);>
de: B<int reboot(int >I<Befehl>B<);>
nl: B<int reboot(int >I<vlag>B<);>

source: DESCRIPTION
de: BESCHREIBUNG
nl: BESCHRIJVING

source: The B<reboot>() call reboots the system, or enables/disables the reboot keystroke (abbreviated CAD, since the default is Ctrl-Alt-Delete; it can be changed using B<loadkeys>(1)).
de: Der B<reboot>()-Aufruf startet das System neu oder schaltet den Tastendruck für den Neustart ein/aus (Strg-Alt-Entf, englisch CAD für Ctrl-Alt-Delete; er kann mittels B<loadkeys>(1) geändert werden).
nl: De B<reboot>() aanroep herstart het systeem, of schakelt de herstart toetsaanslag in/uit (afgekort CAD, omdat de standaard Ctrl-Alt-Delete is; hij kan veranderd worden met B<loadkeys>(1)).

source: This system call fails (with the error B<EINVAL>) unless I<magic> equals B<LINUX_REBOOT_MAGIC1> (that is, 0xfee1dead) and I<magic2> equals B<LINUX_REBOOT_MAGIC2> (that is, 672274793). However, since 2.1.17 also B<LINUX_REBOOT_MAGIC2A> (that is, 85072278) and since 2.1.97 also B<LINUX_REBOOT_MAGIC2B> (that is, 369367448) and since 2.5.71 also B<LINUX_REBOOT_MAGIC2C> (that is, 537993216) are permitted as values for I<magic2>. (The hexadecimal values of these constants are meaningful.)
de: Dieser Systemaufruf schlägt (mit dem Fehler B<EINVAL>) fehl, außer wenn I<Magik> gleich B<LINUX_REBOOT_MAGIC1> (0xfee1dead) und I<Magik2> gleich B<LINUX_REBOOT_MAGIC2> (672274793) ist. Seit 2.1.17 ist jedoch auch B<LINUX_REBOOT_MAGIC2A> (85072278) und seit 2.1.97 außerdem B<LINUX_REBOOT_MAGIC2B> (369367448) und seit 2.5.71 auch B<LINUX_REBOOT_MAGIC2C> (537993216) als Wert für I<Magik2> erlaubt. (Die hexadezimalen Werte dieser Konstanten haben eine Bedeutung.)
nl: Deze systeem aanroep zal falen (met EINVAL) tenzij I<magie> gelijk is aan B<LINUX_REBOOT_MAGIC1> (dat is: 0xfee1dead) en I<magie2> gelijk is aan B<LINUX_REBOOT_MAGIC2> (dat is: 672274793). Sinds 2.1.17 worden echter ook B<LINUX_REBOOT_MAGIC2A> (dat is: 85072278), sinds 2.1.97 ook B<LINUX_REBOOT_MAGIC2B> (dat is: 369367448) en sinds 2.5.71 ook B<LINUX_REBOOT_MAGIC2C> (dat is, 537993216) toegestaan als waarde voor I<magie2>. (De hexadecimale waardes van deze constanten hebben betekenis.)

source: The I<cmd> argument can have the following values:
de: Das Argument I<Befehl> kann die folgenden Werte haben:
nl: Het I<vlag> argument kan de volgende waardes hebben:

source: (B<RB_DISABLE_CAD>, 0). CAD is disabled. This means that the CAD keystroke will cause a B<SIGINT> signal to be sent to init (process 1), whereupon this process may decide upon a proper action (maybe: kill all processes, sync, reboot).
de: (B<RB_DISABLE_CAD>, 0). Strg-Alt-Delete wird ausgeschaltet. Dies bedeutet, dass das Tastenkürzel Strg-Alt-Delete veranlasst, dass ein B<SIGINT>-Signal an Init (Prozess 1) gesandt wird, woraufhin dieser Prozess über die richtige Aktion entscheidet (möglicherweise: alle Prozesse beenden, Platten synchronisieren, Neustart).
nl: (B<RB_DISABLE_CAD>. CAD wordt uitgezet. Dit betekend dat de CAD toetsaanslag een B<SIGINT> signaal zal veroorzaken dat gezonden zal worden naar het init (proces 1), waarna dit proces kan beslissen wat een juiste actie is (wellicht: stop alle processen, synchroniseer ("sync"), en herstart).

source: (B<RB_ENABLE_CAD>, 0x89abcdef). CAD is enabled. This means that the CAD keystroke will immediately cause the action associated with B<LINUX_REBOOT_CMD_RESTART>.
de: (B<RB_ENABLE_CAD>, 0x89abcdef). Strg-Alt-Delete wird eingeschaltet. Dies bedeutet, dass das Tastenkürzel Strg-Alt-Delete sofort die mit B<LINUX_REBOOT_CMD_RESTART> verbundene Aktion veranlassen wird.
nl: (B<RB_ENABLE_CAD>, 0x89abcdef). CAD wordt gebruiksklaar gemaakt. Dit betekend dat de CAD toetsaanslag onmiddellijk de actie behorend bij B<LINUX_REBOOT_CMD_RESTART> zal veroorzaken.

source: (B<RB_HALT_SYSTEM>, 0xcdef0123; since Linux 1.1.76). The message "System halted." is printed, and the system is halted. Control is given to the ROM monitor, if there is one. If not preceded by a B<sync>(2), data will be lost.
de: (B<RB_HALT_SYSTEM>, 0xcdef0123; seit Linux 1.1.76). Die Nachricht »System halted.« wird ausgegeben und das System wird angehalten. Falls vorhanden, wird die Steuerung an den ROM-Monitor übergeben. Wenn kein B<sync>(2) vorausgeht, werden Daten verlorengehen.
nl: (B<RB_HALT_SYSTEM>, 0xcdef0123; sinds 1.1.76). Het bericht "System halted." wordt afgedrukt, en het systeem wordt gestopt. Controle wordt gegeven aan de ROM monitor, indien die bestaat. Als niet voorafgegaan werd door een B<sync>(2), zullen gegevens verloren gaan.

source: (B<RB_KEXEC>, 0x45584543, since Linux 2.6.13). Execute a kernel that has been loaded earlier with B<kexec_load>(2). This option is available only if the kernel was configured with B<CONFIG_KEXEC>.
de: (B<RB_KEXEC>, 0x45584543, since Linux 2.6.13). Einen Kernel ausführen, der vorher mit B<kexec_load>(2) geladen wurde. Diese Option ist nur verfügbar, falls der Kernel mit B<CONFIG_KEXEC> konfiguriert wurde.
nl: (B<RB_KEXEC>, 0x45584543, vanaf Linux 2.6.13). Voer een kernel uit die eerder werd geladen met B<kexec_load>(2). Deze optie is alleen beschikbaar als de kernel werd geconfigureerd met B<CONFIG_KEXEC>.

source: (B<RB_POWER_OFF>, 0x4321fedc; since Linux 2.1.30). The message "Power down." is printed, the system is stopped, and all power is removed from the system, if possible. If not preceded by a B<sync>(2), data will be lost.
de: (B<RB_POWER_OFF>, 0x4321fedc; seit Linux 2.1.30). Die Nachricht »Power down.« wird ausgegeben, das System wird gestoppt und jegliche Stromzufuhr unterbrochen, wenn möglich. Falls kein B<sync>(2) vorausgeht, werden Daten verlorengehen.
nl: (B<RB_POWER_OFF>, 0x4321fedc; sinds 2.1.30). Het bericht "Power down." wordt afgedrukt, het systeem wordt gestopt en alle voeding wordt losgekoppeld van het systeem als dat mogelijk is. Als niet voorafgegaan door B<sync>(2), zullen gegevens verloren gaan.

source: (B<RB_AUTOBOOT>, 0x1234567). The message "Restarting system." is printed, and a default restart is performed immediately. If not preceded by a B<sync>(2), data will be lost.
de: (B<RB_AUTOBOOT>, 0x1234567). Die Nachricht »Restarting system.« wird ausgegeben und es wird sofort ein Standard-Neustart ausgeführt. Wenn kein B<sync>(2) vorausgeht, werden Daten verlorengehen.
nl: (B<RB_AUTOBOOT>, 0x1234567). Het bericht "Restarting system." wordt afgedrukt, en een standaard herstart wordt onmiddellijk uitgevoerd. Als niet voorafgegaan door een B<sync>(2), zullen gegevens verloren gaan.

source: (0xa1b2c3d4; since Linux 2.1.30). The message "Restarting system with command \(aq%s\(aq" is printed, and a restart (using the command string given in I<arg>) is performed immediately. If not preceded by a B<sync>(2), data will be lost.
de: (0xa1b2c3d4; seit Linux 2.1.30). Die Nachricht »Restarting system with command \(aq%s\(aq« wird ausgegeben und sofort ein Neustart ausgeführt (unter Verwendung der in I<Arg> angegebenen Zeichenkette). Wenn kein B<sync>(2) vorausgeht, werden Daten verlorengehen.
nl: (0xa1b2c3d4; sinds 2.1.30). Het bericht "Restarting system with command \(aq%s\(aq" wordt afgedrukt, en een herstart (met gebruik van het opdracht-string gegeven met I<arg>) wordt onmiddellijk uitgevoerd. Als niet voorafgegaan door een B<sync>(2), zullen gegevens verloren gaan.

source: (B<RB_SW_SUSPEND>, 0xd000fce1; since Linux 2.5.18). The system is suspended (hibernated) to disk. This option is available only if the kernel was configured with B<CONFIG_HIBERNATION>.
de: (B<RB_SW_SUSPEND>, 0xd000fce1; seit Linux 2.5.18). Einen Kernel ausführen, der vorher mit B<kexec_load>(2) geladen wurde. Diese Option ist nur verfügbar, falls der Kernel mit B<CONFIG_KEXEC> konfiguriert wurde.
nl: (B<RB_SW_SUSPEND>, 0xd000fce1; sinds Linux 2.5.18). Het systeem wordt gestopt (in winterslaap) naar schijf. Deze optie is alleen beschikbaar als de kernel werd geconfigureerd met B<CONFIG_HIBERNATION>.

source: Only the superuser may call B<reboot>().
de: Nur der Superuser kann B<reboot>() aufrufen.
nl: Alleen de super-gebruiker mag B<reboot>() gebruiken.

source: The precise effect of the above actions depends on the architecture. For the i386 architecture, the additional argument does not do anything at present (2.1.122), but the type of reboot can be determined by kernel command-line arguments ("reboot=...") to be either warm or cold, and either hard or through the BIOS.
de: Die genauen Auswirkungen der vorangehenden Aktionen hängen von der Architektur ab. Für die i386-Architektur bewirkt das zusätzliche Argument derzeit nichts (2.1.122), aber der Typ des Neustarts kann durch Kernel-Befehlszeilenargumente (»reboot=…«) festgelegt werden, um entweder einen Warm- oder Kaltstart entweder hart oder über das BIOS durchzuführen.
nl: Het exacte gevolg van de bovenstaande acties hangt af van de architectuur. Voor de i386 architectuur doet het extra argument helemaal niets momenteel (2.1.122), maar het soort heropstart kan bepaald worden met een kernel opdracht-regel argument (`reboot=...'), het kan warm of koud zijn, en hard of door de BIOS.

source: Behavior inside PID namespaces
de: Verhalten innerhalb von PID-Namensräumen
nl: Gedrag binnen PID naamruimtes.

source: Since Linux 3.4, if B<reboot>() is called from a PID namespace other than the initial PID namespace with one of the I<cmd> values listed below, it performs a "reboot" of that namespace: the "init" process of the PID namespace is immediately terminated, with the effects described in B<pid_namespaces>(7).
de: Wird B<reboot>() in einem vom ursprünglichen PID-Namensraum verschiedenen Namensraum mit einem der nachfolgend aufgeführten I<Befehl>-Werte aufgerufen, dann führt es seit Linux 3.4 einen »Neustart« dieses Namensraumes durch: der »init«-Prozess des PID-Namensraums wird sofort mit den in B<pid_namespaces>(7) beschriebenen Effekten beendet.
nl: Sinds Linux 3.4 als B<reboot>() wordt aangeroepen vanuit een PID naamruimte anders dan de initiële PID naamruimte met een van de I<cmd> waardes hieronder getoond, dan zal het een "herstart" van die naamruimte uitvoeren: het "init" proces van de PID naamruimte wordt meteen beëindigd, met de effecten zoals beschreven in B<pid_namespaces>(7).

source: The values that can be supplied in I<cmd> when calling B<reboot>() in this case are as follows:
de: Die Werte, die in I<Befehl> beim Aufruf von B<reboot>() übergeben werden können, sind in diesem Fall die folgenden:
nl: De waarden die kunnen worden gegeven in I<cmd> bij het aanroepen van B<reboot>() zijn in dit geval als volgt:

source: The "init" process is terminated, and B<wait>(2) in the parent process reports that the child was killed with a B<SIGHUP> signal.
de: Der »init«-Prozess wird beendet und B<wait>(2) im Elternprozess berichtet, dass das Kind mit einem Signal B<SIGHUP> getötet wurde.
nl: Het "init" proces werd gestopt en B<wait>(2) in het ouder proces rapporteert dat het kind werd gestopt met een B<SIGINT> signaal.

source: The "init" process is terminated, and B<wait>(2) in the parent process reports that the child was killed with a B<SIGINT> signal.
de: Der »init«-Prozess wird beendet und B<wait>(2) im Elternprozess berichtet, dass das Kind mit einem Signal B<SIGINT> getötet wurde.
nl: Het "init" proces werd gestopt en B<wait>(2) in het ouder proces rapporteert dat het kind werd gestopt met een B<SIGINT> signaal.

source: For the other I<cmd> values, B<reboot>() returns -1 and I<errno> is set to B<EINVAL>.
de: Für andere Werte in I<Befehl> liefert B<reboot>() -1 zurück und I<errno> wird auf B<EINVAL> gesetzt.
nl: Voor de andere I<cmd> waarden geeft B<reboot>() -1 terug en wordt I<errno> gezet op B<EINVAL>.

source: RETURN VALUE
de: RÜCKGABEWERT
nl: EIND WAARDE

source: For the values of I<cmd> that stop or restart the system, a successful call to B<reboot>() does not return. For the other I<cmd> values, zero is returned on success. In all cases, -1 is returned on failure, and I<errno> is set to indicate the error.
de: Für die Werte von I<Befehl>, die das System stoppen oder neu starten, gibt ein erfolgreicher Aufruf von B<reboot>() nichts zurück. Für die anderen I<Befehl>-Werte wird bei Erfolg Null zurückgegeben. Bei einem Fehler wird immer -1 zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.
nl: Voor die waarden van I<cmd> die het systeem stoppen of herstarten zal een succesvolle aanroep van B<reboot>() niet terug keren. Voor de andere I<cmd> waarden wordt nul terug gegeven bij succes. In alle gevallen wordt -1 teruggegeven bij fouten en wordt I<errno> gezet om de fout te melden.

source: ERRORS
de: FEHLER
nl: FOUTEN

source: Problem with getting user-space data under B<LINUX_REBOOT_CMD_RESTART2>.
de: Problem bei der Abfrage von Daten aus dem Adressraum des Benutzers unter B<LINUX_REBOOT_CMD_RESTART2>.
nl: Probleem bij het verkrijgen van gebruiker-ruimte data onder B<LINUX_REBOOT_CMD_RESTART2>.

source: Bad magic numbers or I<cmd>.
de: falsche magische Zahlen oder I<Befehl>
nl: Verkeerde magische nummers of I<vlag>.

source: The calling process has insufficient privilege to call B<reboot>(); the caller must have the B<CAP_SYS_BOOT> inside its user namespace.
de: Der aufrufende Prozess verfügt nicht über ausreichende Privilegien, um B<reboot>() aufzurufen. Die Capability B<CAP_SYS_BOOT> wird innerhalb seines Benutzernamensraums benötigt.
nl: Het huidige proces heeft niet voldoende rechten om B<reboot>() aan te roepen; de aanroeper moet de B<CAP_SYS_BOOT> in zijn naamruimte hebben.

source: B<reboot>() is Linux-specific, and should not be used in programs intended to be portable.
de: B<reboot>() ist Linux-spezifisch und sollte nicht in portierbaren Programmen benutzt werden.
nl: B<reboot>() is Linux-eigen en zou niet gebruikt moeten worden in processen die overdraagbaar moeten zijn.

source: SEE ALSO
de: SIEHE AUCH
nl: ZIE OOK

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
nl: Linux Programmeurs Handleiding

source: /* Since kernel version 2.1.30 there are symbolic names LINUX_REBOOT_* for the constants and a fourth argument to the call: */
de: /* Seit Kernel-Version 2.1.30 gibt es die symbolischen Namen LINUX_REBOOT_* für die Konstanten und ein viertes Argument für den Aufruf: */
nl: /* Sinds kernel versie 2.1.30 zijn er symbolische namen LINUX_REBOOT_* voor constanten en een vierde argument in de aanroep: */

source: B<int reboot(int >I<magic>B<, int >I<magic2>B<, int >I<cmd>B<, void *>I<arg>B<);>
de: B<int reboot(int >I<Magik>B<, int >I<Magik2>B<, int >I<Befehl>B<, void *>I<Arg>B<);>
nl: B<int reboot(int >I<magie>B<, int >I<magie2>B<, int >I<vlag>B<, void *>I<arg>B<);>

source: /* Under glibc and most alternative libc's (including uclibc, dietlibc, musl and a few others), some of the constants involved have gotten symbolic names RB_*, and the library call is a 1-argument wrapper around the system call: */
de: /* Unter Glibc und der meisten alternativen Libcs (darunter Uclibc, Dietlibc, Musl und einige andere) haben einige beteiligte Konstanten symbolische RB_*-Namen bekommen und der Bibliotheksaufruf ist ein Ein-Argument-Wrapper des Systemaufrufs: */
nl: /* Onder glibc en de meeste alternatieve libc's (inclusief uclibc, dietlibc, musl en een aantal andere) hebben sommige van de constanten die hiermee te maken hebben symbolische namen RB_* gekregen, en de bibliotheek aanroep is een 1-argument wikkel om de systeem aanroep: */

source: B<int reboot(int >I<cmd>B<);>
de: B<int reboot(int >I<Befehl>B<);>
nl: B<int reboot(int >I<vlag>B<);>

source: For the values of I<cmd> that stop or restart the system, a successful call to B<reboot>() does not return. For the other I<cmd> values, zero is returned on success. In all cases, -1 is returned on failure, and I<errno> is set appropriately.
de: Für die Werte von I<Befehl>, die das System stoppen oder neu starten, gibt ein erfolgreicher Aufruf von B<reboot>() nichts zurück. Für die anderen I<Befehl>-Werte wird bei Erfolg Null zurückgegeben. Bei einem Fehler wird immer -1 zurückgegeben und I<errno> entsprechend gesetzt.
nl: Voor die waarden van I<cmd> die het systeem stoppen of herstarten zal een succesvolle aanroep van B<reboot>() niet terug keren. Voor de andere I<cmd> waarden wordt nul terug gegeven bij succes. In alle gevallen wordt -1 teruggegeven bij fouten en wordt I<errno> gezet om de fout te melden.

source: CONFORMING TO
de: KONFORM ZU
nl: VOLDOET AAN

source: COLOPHON
de: KOLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This system call fail (with the error B<EINVAL>) unless I<magic> equals B<LINUX_REBOOT_MAGIC1> (that is, 0xfee1dead) and I<magic2> equals B<LINUX_REBOOT_MAGIC2> (that is, 672274793). However, since 2.1.17 also B<LINUX_REBOOT_MAGIC2A> (that is, 85072278) and since 2.1.97 also B<LINUX_REBOOT_MAGIC2B> (that is, 369367448) and since 2.5.71 also B<LINUX_REBOOT_MAGIC2C> (that is, 537993216) are permitted as values for I<magic2>. (The hexadecimal values of these constants are meaningful.)
de: Dieser Systemaufruf schlägt (mit dem Fehler B<EINVAL>) fehl, außer wenn I<Magik> gleich B<LINUX_REBOOT_MAGIC1> (0xfee1dead) und I<Magik2> gleich B<LINUX_REBOOT_MAGIC2> (672274793) ist. Seit 2.1.17 ist jedoch auch B<LINUX_REBOOT_MAGIC2A> (85072278) und seit 2.1.97 außerdem B<LINUX_REBOOT_MAGIC2B> (369367448) und seit 2.5.71 auch B<LINUX_REBOOT_MAGIC2C> (537993216) als Wert für I<Magik2> erlaubt. (Die hexadezimalen Werte dieser Konstanten haben eine Bedeutung.)

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
