Repository: sebras/manpages-l10n
Catalog: po/*/man2/request_key.2.po
Languages: fr

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: No glibc wrapper is provided for this system call; see NOTES.
fr: Aucune enveloppe n'est fournie pour la glibc pour cet appel système ; voir les NOTES.

source: On success, B<request_key>() returns the serial number of the key it found or caused to be created. On error, -1 is returned and I<errno> is set to indicate the cause of the error.
fr: En cas de succès, B<request_key>() renvoie le numéro de série de la clé trouvée ou créée. En cas d'erreur, la valeur B<-1> est renvoyée et I<errno> est positionné pour indiquer la cause de l'erreur.

source: No wrapper for this system call is provided in glibc. A wrapper is provided in the I<libkeyutils> package. When employing the wrapper in that library, link with I<-lkeyutils>.
fr: Aucune enveloppe n'est fournie par la glibc pour cet appel système. Une enveloppe est fournie dans le paquet I<libkeyutils>. Si vous utilisez l'enveloppe de cette bibliothèque, éditez un lien avec I<-lkeyutils>.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: EXAMPLE
fr: EXEMPLE

source: $ sudo sh # B<echo 'create user mtk:* * /bin/keyctl instantiate %k %c %S' \e> B<E<gt> /etc/request-key.conf> # B<exit>
fr: $ sudo sh # B<echo 'création utilisateur mtk:* * /bin/keyctl instantiate %k %c %S' \e> B<E<gt> /etc/request-key.conf> # B<exit>

source: printf("Key ID is %lx\en", (long) key);
fr: printf("L'identifiant de la clé est %lx\en", (long) key);

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
