Repository: sebras/manpages-l10n
Catalog: po/*/man2/request_key.2.po
Languages: fr

source: Linux Key Management Calls
fr: Gestion des clés sous Linux

source: NAME
fr: NOM

source: request_key - request a key from the kernel's key management facility
fr: request_key - Demander une clé au gestionnaire de clés du noyau

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
fr: I<Note> : il n'existe pas d'enveloppe pour cet appel système dans la glibc ; voir NOTES.

source: B<request_key>() attempts to find a key of the given I<type> with a description (name) that matches the specified I<description>. If such a key could not be found, then the key is optionally created. If the key is found or created, B<request_key>() attaches it to the keyring whose ID is specified in I<dest_keyring> and returns the key's serial number.
fr: B<request_key>() essaie de trouver une clé d'un I<type> donné, qui correspond à la I<description> (au nom) spécifiée. Si aucune clé n'a pu être trouvée, la clé peut être créée. Si la clé a été trouvée ou créée, B<request_key>() la rattache au trousseau dont l'identifiant est indiqué dans I<dest_keyring> et il renvoie le numéro de série de la clé.

source: B<request_key>() first recursively searches for a matching key in all of the keyrings attached to the calling process. The keyrings are searched in the order: thread-specific keyring, process-specific keyring, and then session keyring.
fr: B<request_key>() cherche une clé correspondant aux critères d'abord récursivement à l'intérieur des trousseaux attachés au processus appelant, dans l'ordre suivant : trousseau spécifique au thread, trousseau spécifique au processus, et enfin le trousseau de session.

source: If B<request_key>() is called from a program invoked by B<request_key>() on behalf of some other process to generate a key, then the keyrings of that other process will be searched next, using that other process's user ID, group ID, supplementary group IDs, and security context to determine access.
fr: Si B<request_key>() est appelé depuis un programme lui-même appelé par B<request_key>() au nom d'un autre processus afin de générer une clé, alors les trousseaux de cet autre processus seront ensuite parcourus en utilisant les identifiants d’utilisateur, de groupe, du groupe supplémentaire et le contexte de sécurité de ce processus.

source: The search of the keyring tree is breadth-first: the keys in each keyring searched are checked for a match before any child keyrings are recursed into. Only keys for which the caller has I<search> permission be found, and only keyrings for which the caller has I<search> permission may be searched.
fr: La recherche dans l'arborescence d'un trousseau est de type parcours en largeur : une correspondance est d'abord recherchée avec toutes les clés d'un trousseau avant de chercher dans les trousseaux trouvés dans ce trousseau. Seules les clés et seuls les trousseaux pour lesquels le processus a l'autorisation I<search> peuvent être examinés.

source: If the key is not found and I<callout> is NULL, then the call fails with the error B<ENOKEY>.
fr: Si aucune clé n'est trouvée et si I<callout> est NULL, l'appel échoue avec l'erreur B<ENOKEY>.

source: If the key is not found and I<callout> is not NULL, then the kernel attempts to invoke a user-space program to instantiate the key. The details are given below.
fr: Si aucune clé n'est trouvée et si I<callout> n'est pas NULL, le noyau essaie d'appeler un programme de l'espace utilisateur pour instancier la clé. Les détails sont donnés ci-dessous.

source: The I<dest_keyring> serial number may be that of a valid keyring for which the caller has I<write> permission, or it may be one of the following special keyring IDs:
fr: Le numéro de série I<dest_keyring> peut être celui d'un trousseau valable sur lequel l'appelant possède les droits en écriture ou il peut s'agir d'un des identifiants de trousseau spécial suivants :

source: This specifies the caller's thread-specific keyring (see B<thread-keyring>(7)).
fr: Cela indique le trousseau spécifique au thread de l'appelant (voir B<thread-keyring>(7)).

source: This specifies the caller's process-specific keyring (see B<process-keyring>(7)).
fr: Cela indique le trousseau spécifique au processus de l'appelant (voir B<process-keyring>(7)).

source: This specifies the caller's session-specific keyring (see B<session-keyring>(7)).
fr: Cela indique le trousseau spécifique à la session de l'appelant (voir B<session-keyring>(7)).

source: This specifies the caller's UID-specific keyring (see B<user-keyring>(7)).
fr: Cela indique le trousseau spécifique à l'UID de l'appelant (voir B<user-keyring>(7)).

source: This specifies the caller's UID-session keyring (see B<user-session-keyring>(7)).
fr: Cela indique le trousseau spécifique à la session de l'UID de l'appelant (voir B<user-session-keyring>(7)).

source: When the I<dest_keyring> is specified as 0 and no key construction has been performed, then no additional linking is done.
fr: Quand I<dest_keyring> est indiqué comme B<0> et qu'aucune construction de clé n'ait été effectuée, aucune édition de liens supplémentaire n'est effectuée.

source: Otherwise, if I<dest_keyring> is 0 and a new key is constructed, the new key will be linked to the "default" keyring. More precisely, when the kernel tries to determine to which keyring the newly constructed key should be linked, it tries the following keyrings, beginning with the keyring set via the B<keyctl>(2) B<KEYCTL_SET_REQKEY_KEYRING> operation and continuing in the order shown below until it finds the first keyring that exists:
fr: Sinon, si I<dest_keyring> est B<0> et si une nouvelle clé est construite, la nouvelle clé sera attachée au trousseau par défaut. Plus précisément, quand le noyau essaie de déterminer le trousseau auquel rattacher la clé nouvellement créée, il essaie les trousseaux les uns à la suite des autres, en commençant par celui défini par l'opération B<KEYCTL_SET_REQKEY_KEYRING> de B<keyctl>(2), puis en continuant dans l'ordre ci-dessous jusqu'à ce qu'il trouve le premier trousseau existant :

source: The requestor keyring (B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING>, since Linux 2.6.29).
fr: Le trousseau du demandeur (B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING> depuis Linux 2.6.29).

source: The thread-specific keyring (B<KEY_REQKEY_DEFL_THREAD_KEYRING>; see B<thread-keyring>(7)).
fr: Le trousseau spécifique au thread (B<KEY_REQKEY_DEFL_THREAD_KEYRING> ; voir B<thread-keyring>(7)).

source: The process-specific keyring (B<KEY_REQKEY_DEFL_PROCESS_KEYRING>; see B<process-keyring>(7)).
fr: Le trousseau spécifique au processus (B<KEY_REQKEY_DEFL_PROCESS_KEYRING> ; voir B<process-keyring>(7)).

source: The session-specific keyring (B<KEY_REQKEY_DEFL_SESSION_KEYRING>; see B<session-keyring>(7)).
fr: Le trousseau spécifique à la session (B<KEY_REQKEY_DEFL_SESSION_KEYRING> ; voir B<session-keyring>(7)).

source: The session keyring for the process's user ID (B<KEY_REQKEY_DEFL_USER_SESSION_KEYRING>; see B<user-session-keyring>(7)). This keyring is expected to always exist.
fr: Le trousseau de la session associé à l'identifiant utilisateur du processus (B<KEY_REQKEY_DEFL_USER_SESSION_KEYRING> ; voir B<user-session-keyring>(7)). Ce trousseau est censé toujours exister.

source: The UID-specific keyring (B<KEY_REQKEY_DEFL_USER_KEYRING>; see B<user-keyring>(7)). This keyring is also expected to always exist.
fr: Le trousseau spécifique à l'identifiant utilisateur (B<KEY_REQKEY_DEFL_USER_KEYRING> ; voir B<user-keyring>(7)). Ce trousseau est toujours censé exister.

source: If the B<keyctl>(2) B<KEYCTL_SET_REQKEY_KEYRING> operation specifies B<KEY_REQKEY_DEFL_DEFAULT> (or no B<KEYCTL_SET_REQKEY_KEYRING> operation is performed), then the kernel looks for a keyring starting from the beginning of the list.
fr: Si l'opération B<KEYCTL_SET_REQKEY_KEYRING> de B<keyctl>(2) indique B<KEY_REQKEY_DEFL_DEFAULT> (ou si aucune opération B<KEYCTL_SET_REQKEY_KEYRING> n'est effectuée), le noyau cherche un trousseau à partir du début de la liste.

source: Requesting user-space instantiation of a key
fr: Demander l'instanciation d'une clé dans l'espace utilisateur

source: If the kernel cannot find a key matching I<type> and I<description>, and I<callout> is not NULL, then the kernel attempts to invoke a user-space program to instantiate a key with the given I<type> and I<description>. In this case, the following steps are performed:
fr: Si le noyau ne peut pas trouver de clé correspondant à I<type> et à I<description> et si I<callout> n'est pas NULL, le noyau essaie d'appeler un programme de l'espace utilisateur pour instancier une clé au I<type> et à la I<description> donnés. Dans ce cas, les étapes suivantes sont suivies :

source: The kernel creates an uninstantiated key, U, with the requested I<type> and I<description>.
fr: Le noyau crée une clé non instanciée, U, du I<type> et de la I<description> demandés.

source: The kernel creates an authorization key, V, that refers to the key U and records the facts that the caller of B<request_key>() is:
fr: Le noyau crée une clé d'autorisation, V, qui se rapporte à la clé U, et enregistre les faits que l'appelant de B<request_key>() est :

source: the context in which the key U should be instantiated and secured, and
fr: le contexte dans lequel la clé U doit être instanciée et sécurisée et

source: the context from which associated key requests may be satisfied.
fr: le contexte à partir duquel les requêtes associées à la clé peuvent être honorées.

source: The authorization key is constructed as follows:
fr: La clé d'autorisation est construite comme suit :

source: The key type is I<".request_key_auth">.
fr: Le type de clé est I<« .request_key_auth »>.

source: The key's UID and GID are the same as the corresponding filesystem IDs of the requesting process.
fr: Les identifiants utilisateur et de groupe de la clé sont les mêmes que ceux du système de fichiers correspondant du processus à l'origine de la demande.

source: The key grants I<view>, I<read>, and I<search> permissions to the key possessor as well as I<view> permission for the key user.
fr: La clé accorde le droit de I<visibilité>, I<lecture> et de I<recherche> au détenteur de la clé ainsi que celui de I<visibilité> à l'utilisateur de la clé.

source: The description (name) of the key is the hexadecimal string representing the ID of the key that is to be instantiated in the requesting program.
fr: La description (son nom) de la clé est la chaîne hexadécimale représentant l'identifiant de la clé à instancier dans le programme à l'origine de la demande.

source: The payload of the key is taken from the data specified in I<callout_info>.
fr: La charge utile de la clé est récupérée à partir des données indiquées dans I<callout_info>.

source: Internally, the kernel also records the PID of the process that called B<request_key>().
fr: En interne, le noyau enregistre aussi l'identifiant de processus de la B<request_key>() appelée.

source: The kernel creates a process that executes a user-space service such as B<request-key>(8) with a new session keyring that contains a link to the authorization key, V.
fr: Le noyau crée un processus qui exécute un service de l'espace utilisateur tel que B<request-key>(8) avec un nouveau trousseau de session contenant un lien vers la clé d'autorisation, V.

source: This program is supplied with the following command-line arguments:
fr: Ce programme est fourni avec les options suivantes en ligne de commande :

source: The string I<"/sbin/request-key">.
fr: La chaîne I<« /sbin/request-key »>.

source: The string I<"create"> (indicating that a key is to be created).
fr: I<« create »> (indiquant qu'une clé doit être créée).

source: The ID of the key that is to be instantiated.
fr: L'identifiant de la clé à instancier.

source: The filesystem UID of the caller of B<request_key>().
fr: L'identifiant utilisateur du système de fichiers de l'appelant de B<request_key>().

source: The filesystem GID of the caller of B<request_key>().
fr: L'identifiant de groupe du système de fichiers de l'appelant de B<request_key>().

source: The ID of the thread keyring of the caller of B<request_key>(). This may be zero if that keyring hasn't been created.
fr: L'identifiant du trousseau du thread de l’appelant de B<request_key>(). Il peut être zéro si le trousseau n'a pas été créé.

source: The ID of the process keyring of the caller of B<request_key>(). This may be zero if that keyring hasn't been created.
fr: L'identifiant du trousseau du processus de l'appelant de B<request_key>(). Il peut être zéro si le trousseau n'a pas été créé.

source: The ID of the session keyring of the caller of B<request_key>().
fr: L'identifiant du trousseau de session de l'appelant de B<request_key>().

source: I<Note>: each of the command-line arguments that is a key ID is encoded in I<decimal> (unlike the key IDs shown in I</proc/keys>, which are shown as hexadecimal values).
fr: I<Note> : chacune des options de la ligne de commande étant un identifiant de clé est encodé en I<décimal> (contrairement aux identifiants de clé affichés dans I</proc/keys>, affichés en valeurs hexadécimales).

source: The program spawned in the previous step:
fr: Le programme généré dans l'étape précédente :

source: Assumes the authority to instantiate the key U using the B<keyctl>(2) B<KEYCTL_ASSUME_AUTHORITY> operation (typically via the B<keyctl_assume_authority>(3) function).
fr: Assume l'autorité pour instancier la clé U en utilisant l'opération B<KEYCTL_ASSUME_AUTHORITY> de B<keyctl>(2) (généralement à l'aide de la fonction B<keyctl_assume_authority>(3)).

source: Obtains the callout data from the payload of the authorization key V (using the B<keyctl>(2) B<KEYCTL_READ> operation (or, more commonly, the B<keyctl_read>(3) function) with a key ID value of B<KEY_SPEC_REQKEY_AUTH_KEY>).
fr: Obtient les données de l'appel à partir de la charge utile de la clé d'autorisation V (en utilisant l'opération B<KEYCTL_READ> de B<keyctl>(2) (ou plus généralement, la fonction B<keyctl_read>(3)) avec une valeur d'identifiant de clé de B<KEY_SPEC_REQKEY_AUTH_KEY>).

source: Instantiates the key (or execs another program that performs that task), specifying the payload and destination keyring. (The destination keyring that the requestor specified when calling B<request_key>() can be accessed using the special key ID B<KEY_SPEC_REQUESTOR_KEYRING>.) Instantiation is performed using the B<keyctl>(2) B<KEYCTL_INSTANTIATE> operation (or, more commonly, the B<keyctl_instantiate>(3) function). At this point, the B<request_key>() call completes, and the requesting program can continue execution.
fr: Instancie la clé (ou exécute un autre programme pour faire cette tâche), en indiquant la charge utile et le trousseau de destination (on peut accéder à celui indiqué par le demandeur lors de l'appel B<request_key>() en utilisant l'identifiant de clé spécial B<KEY_SPEC_REQUESTOR_KEYRING>). L'instanciation est effectuée en utilisant l'opération B<KEYCTL_INSTANTIATE> de B<keyctl>(2) (ou plus généralement, la fonction B<keyctl_instantiate>(3)). À ce moment, l'appel B<request_key>() se termine et le programme à l'origine de la demande peut continuer son exécution.

source: If these steps are unsuccessful, then an B<ENOKEY> error will be returned to the caller of B<request_key>() and a temporary, negatively instantiated key will be installed in the keyring specified by I<dest_keyring>. This will expire after a few seconds, but will cause subsequent calls to B<request_key>() to fail until it does. The purpose of this negatively instantiated key is to prevent (possibly different) processes making repeated requests (that require expensive B<request-key>(8) upcalls) for a key that can't (at the moment) be positively instantiated.
fr: Si ces étapes ne réussissent pas, une erreur B<ENOKEY> sera renvoyée à l'appelant de B<request_key>() et une clé temporaire et instanciée de manière négative sera installée sur le trousseau indiqué par I<dest_keyring>. Elle expirera après quelques secondes mais elle permettra aux appels suivants à B<request_key>() d'échouer jusqu'à ce qu'elles réussissent. Le but de cette clé instanciée négativement est d'empêcher des processus (potentiellement différents) d'effectuer des demandes répétées (qui requièrent des appels B<request-key>(8) coûteux) pour une clé qui ne peut pas être instanciée positivement (pour l'instant).

source: Once the key has been instantiated, the authorization key (B<KEY_SPEC_REQKEY_AUTH_KEY>) is revoked, and the destination keyring (B<KEY_SPEC_REQUESTOR_KEYRING>) is no longer accessible from the B<request-key>(8) program.
fr: Une fois que la clé a été instanciée, la clé d'autorisation (B<KEY_SPEC_REQKEY_AUTH_KEY>) est révoquée et le trousseau de destination (B<KEY_SPEC_REQUESTOR_KEYRING>) n'est plus accessible au programme B<request-key>(8).

source: If a key is created, then\(emregardless of whether it is a valid key or a negatively instantiated key\(emit will displace any other key with the same type and description from the keyring specified in I<dest_keyring>.
fr: Si une clé est créée, qu'elle soit valable ou instanciée négativement, elle remplacera toute autre clé possédant le même type et la même description dans le trousseau indiqué dans I<dest_keyring>.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<request_key>() returns the serial number of the key it found or caused to be created. On error, -1 is returned and I<errno> is set to indicate the error.
fr: En cas de succès, B<request_key>() renvoie le numéro de série de la clé trouvée ou créée. En cas d'erreur, la valeur B<-1> est renvoyée et I<errno> est positionné pour indiquer l'erreur.

source: ERRORS
fr: ERREURS

source: The keyring wasn't available for modification by the user.
fr: Le trousseau n'était pas disponible pour pouvoir être modifié par l'utilisateur.

source: The key quota for this user would be exceeded by creating this key or linking it to the keyring.
fr: Le quota de clés de cet utilisateur serait dépassé si la clé était créée ou ajoutée au trousseau.

source: One of I<type>, I<description>, or I<callout_info> points outside the process's accessible address space.
fr: Le I<type>, la I<description> ou la I<callout_info> pointe en dehors de l'espace d'adressage accessible au processus.

source: The request was interrupted by a signal; see B<signal>(7).
fr: La requête a été interrompue par un signal ; voir B<signal>(7).

source: The size of the string (including the terminating null byte) specified in I<type> or I<description> exceeded the limit (32 bytes and 4096 bytes respectively).
fr: La taille de la clé (octet NULL final inclus) indiquée dans I<type> ou I<description> dépassait la limite (respectivement 32 et 4096 octets).

source: The size of the string (including the terminating null byte) specified in I<callout_info> exceeded the system page size.
fr: La taille de la clé (octet NULL final inclus) indiquée dans I<callout_info> dépassait la taille de la page du système.

source: An expired key was found, but no replacement could be obtained.
fr: Une clé expirée a été trouvée, mais aucun remplacement n'a pu être obtenu.

source: The attempt to generate a new key was rejected.
fr: La tentative de générer une nouvelle clé a été rejetée.

source: A revoked key was found, but no replacement could be obtained.
fr: Une clé révoquée a été trouvée, mais aucun remplacement n'a pu être obtenu.

source: No matching key was found.
fr: Aucune clé correspondante n'a été trouvée.

source: Insufficient memory to create a key.
fr: Il n'y a pas assez de mémoire pour créer une clé.

source: The I<type> argument started with a period (\(aq.\(aq).
fr: Le paramètre I<type> commençait par un point (\(aq.\(aq).

source: This system call first appeared in Linux 2.6.10. The ability to instantiate keys upon request was added in Linux 2.6.13.
fr: Cet appel système est apparu pour la première fois dans Linux 2.6.10. La possibilité d'instancier des clés à la demande a été ajoutée dans Linux 2.6.13.

source: CONFORMING TO
fr: CONFORMITÉ

source: This system call is a nonstandard Linux extension.
fr: Cet appel système est une extension Linux non standard.

source: EXAMPLES
fr: EXEMPLES

source: The program below demonstrates the use of B<request_key>(). The I<type>, I<description>, and I<callout_info> arguments for the system call are taken from the values supplied in the command-line arguments. The call specifies the session keyring as the target keyring.
fr: Le programme ci-dessous montre l'utilisation de B<request_key>(). Les paramètres I<type>, I<description> et I<callout_info> pour l'appel système sont récupérés à partir des valeurs fournies dans les options de la ligne de commande. L'appel indique le trousseau de session en tant que trousseau cible.

source: In order to demonstrate this program, we first create a suitable entry in the file I</etc/request-key.conf>.
fr: Pour montrer ce programme, on crée d'abord une entrée adéquate dans I</etc/request-key.conf>.

source: $ sudo sh # B<echo \(aqcreate user mtk:* * /bin/keyctl instantiate %k %c %S\(aq \e> B<E<gt> /etc/request-key.conf> # B<exit>
fr: $ sudo sh # B<echo \(aqcréation utilisateur mtk:* * /bin/keyctl instantiate %k %c %S\(aq \e> B<E<gt> /etc/request-key.conf> # B<exit>

source: This entry specifies that when a new "user" key with the prefix "mtk:" must be instantiated, that task should be performed via the B<keyctl>(1) command's B<instantiate> operation. The arguments supplied to the B<instantiate> operation are: the ID of the uninstantiated key (I<%k>); the callout data supplied to the B<request_key>() call (I<%c>); and the session keyring (I<%S>) of the requestor (i.e., the caller of B<request_key>()). See B<request-key.conf>(5) for details of these I<%> specifiers.
fr: Cette entrée indique que lorsqu'une nouvelle clé « utilisateur » avec le préfixe « mtk: » doit être instanciée, la tâche doit être effectuée par l'opération B<instantiate> de la commande B<keyctl>(1). Les paramètres fournis à l'opération B<instantiate> sont : l'identifiant de la clé non instanciée (I<%k>), les données de l'appel fournies à l'appel B<request_key>() (I<%c>) et le trousseau de session (I<%S>) du demandeur (à savoir l'appelant de B<request_key>()). Consulter B<request-key.conf>(5) pour les détails de ces spécificateurs I<%>.

source: Then we run the program and check the contents of I</proc/keys> to verify that the requested key has been instantiated:
fr: Puis on lance le programme et on vérifie que le contenu de I</proc/keys> pour vérifier que la clé demandée a été instanciée :

source: For another example of the use of this program, see B<keyctl>(2).
fr: Pour un autre exemple d'utilisation de ce programme, voir B<keyctl>(2).

source: Program source
fr: Source du programme

source: if (argc != 4) { fprintf(stderr, "Usage: %s type description callout-data\en", argv[0]); exit(EXIT_FAILURE); }
fr: if (argc != 4) { fprintf(stderr, "Utilisation : %s type description données-appel\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("Key ID is %jx\en", (uintmax_t) key);
fr: printf("L'identifiant de la clé est %jx\en", (uintmax_t) key);

source: SEE ALSO
fr: VOIR AUSSI

source: The kernel source files I<Documentation/security/keys/core.rst> and I<Documentation/keys/request-key.rst> (or, before Linux 4.13, in the files I<Documentation/security/keys.txt> and I<Documentation/security/keys-request-key.txt>).
fr: Les fichiers I<Documentation/security/keys/core.rst> et I<Documentation/keys/request-key.rst> des sources du noyau (ou, avant Linux 4.13, les fichiers I<Documentation/security/keys.txt> et I<Documentation/security/keys-request-key.txt>).
