Repository: sebras/manpages-l10n
Catalog: po/*/man2/seccomp.2.po
Languages: fr

source: Linux man-pages 6.01
fr: Pages du manuel de Linux 6.01

source: NAME
fr: NOM

source: seccomp - operate on Secure Computing state of the process
fr: seccomp - Agir sur l'état de calcul sécurisé (Secure Computing State) du processus

source: LIBRARY
fr: BIBLIOTHÈQUE

source: Standard C library (I<libc>, I<-lc>)
fr: Bibliothèque C standard (I<libc>, I<-lc>)

source: The B<seccomp>() system call operates on the Secure Computing (seccomp) state of the calling process.
fr: L'appel système B<seccomp>() agit sur l'état de calcul sécurisé (seccomp) du processus appelant.

source: Currently, Linux supports the following I<operation> values:
fr: Actuellement, Linux gère les valeurs d'I<operation> suivantes :

source: Note that although the calling thread can no longer call B<sigprocmask>(2), it can use B<sigreturn>(2) to block all signals apart from B<SIGKILL> and B<SIGSTOP>. This means that B<alarm>(2) (for example) is not sufficient for restricting the process's execution time. Instead, to reliably terminate the process, B<SIGKILL> must be used. This can be done by using B<timer_create>(2) with B<SIGEV_SIGNAL> and I<sigev_signo> set to B<SIGKILL>, or by using B<setrlimit>(2) to set the hard limit for B<RLIMIT_CPU>.
fr: Remarquez que si le thread appelant ne peut plus appeler B<sigprocmask>(2), il peut utiliser B<sigreturn>(2) pour bloquer tous les signaux, sauf ceux provenant de B<SIGKILL> et de B<SIGSTOP>. Cela veut dire que B<alarm>(2) (par exemple) n'est pas suffisant pour restreindre la durée d'exécution d'un processus. Pour terminer de manière fiable un processus, B<SIGKILL> doit être utilisé. On peut le faire en utilisant B<timer_create>(2) avec B<SIGEV_SIGNAL> et I<sigev_signo> positionné à B<SIGKILL> ou en utilisant B<setrlimit>(2) pour positionner la limite ferme de B<RLIMIT_CPU>.

source: This operation is available only if the kernel is configured with B<CONFIG_SECCOMP> enabled.
fr: Cette opération n'est disponible que si le noyau a été configuré avec B<CONFIG_SECCOMP>.

source: The value of I<flags> must be 0, and I<args> must be NULL.
fr: La valeur de I<flags> doit être de B<0> et I<args> doit être NULL.

source: This operation is functionally identical to the call:
fr: Cette opération est fonctionnellement identique à l'appel :

source: If B<fork>(2) or B<clone>(2) is allowed by the filter, any child processes will be constrained to the same system call filters as the parent. If B<execve>(2) is allowed, the existing filters will be preserved across a call to B<execve>(2).
fr: Si B<fork>(2) ou B<clone>(2) est autorisé par le filtre, les processus enfants seront contraints par les mêmes filtres d'appel système que leur parent. Si B<execve>(2) est autorisé, les filtres existants seront préservés lors d'un appel à B<execve>(2).

source: In order to use the B<SECCOMP_SET_MODE_FILTER> operation, either the calling thread must have the B<CAP_SYS_ADMIN> capability in its user namespace, or the thread must already have the I<no_new_privs> bit set. If that bit was not already set by an ancestor of this thread, the thread must make the following call:
fr: Pour utiliser l'opération B<SECCOMP_SET_MODE_FILTER>, soit le thread appelant doit avoir la capacité B<CAP_SYS_ADMIN> dans son espace de noms utilisateur, soit il doit avoir déjà le bit I<no_new_privs> défini. Si ce bit n'a pas déjà été positionné par un ascendant du thread, le thread doit effectuer l'appel suivant :

source: Otherwise, the B<SECCOMP_SET_MODE_FILTER> operation fails and returns B<EACCES> in I<errno>. This requirement ensures that an unprivileged process cannot apply a malicious filter and then invoke a set-user-ID or other privileged program using B<execve>(2), thus potentially compromising that program. (Such a malicious filter might, for example, cause an attempt to use B<setuid>(2) to set the caller's user IDs to nonzero values to instead return 0 without actually making the system call. Thus, the program might be tricked into retaining superuser privileges in circumstances where it is possible to influence it to do dangerous things because it did not actually drop privileges.)
fr: Sinon, l'opération B<SECCOMP_SET_MODE_FILTER> échoue et renvoie B<EACCES> dans I<errno>. Cette exigence garantit qu'un processus non privilégié ne peut pas appliquer un filtre malveillant et appeler un programme set-user-ID ou avec d'autres privilèges en utilisant B<execve>(2), compromettant ainsi le programme (un tel filtre malveillant pourrait, par exemple, conduire B<setuid>(2) à essayer de définir les identifiants utilisateur de l'appelant à des valeurs non nulles pour renvoyer plutôt B<0> sans faire d'appel système. Ainsi, le programme pourrait être bidouillé pour garder les privilèges du super-utilisateur à des moments où il est possible de l'influencer pour faire des choses dangereuses vu qu'il n'a pas abandonné ses privilèges).

source: If B<prctl>(2) or B<seccomp>() is allowed by the attached filter, further filters may be added. This will increase evaluation time, but allows for further reduction of the attack surface during execution of a thread.
fr: Si B<prctl>(2) ou B<seccomp>() est autorisé par le filtre rattaché, d'autres filtres peuvent être ajoutés. Cela augmentera le temps d'évaluation mais permet d'autres réductions de la surface d'attaque lors de l'exécution d'un thread.

source: The B<SECCOMP_SET_MODE_FILTER> operation is available only if the kernel is configured with B<CONFIG_SECCOMP_FILTER> enabled.
fr: L'opération B<SECCOMP_SET_MODE_FILTER> n'est disponible que si le noyau a été configuré avec B<CONFIG_SECCOMP_FILTER>.

source: When I<flags> is 0, this operation is functionally identical to the call:
fr: Quand I<flags> vaut B<0>, cette opération est fonctionnellement identique à l'appel :

source: The recognized I<flags> are:
fr: Les paramètres reconnus de I<flags> sont :

source: B<SECCOMP_FILTER_FLAG_LOG> (since Linux 4.14)
fr: B<SECCOMP_FILTER_FLAG_LOG> (depuis Linux 4.14)

source: All filter return actions except B<SECCOMP_RET_ALLOW> should be logged. An administrator may override this filter flag by preventing specific actions from being logged via the I</proc/sys/kernel/seccomp/actions_logged> file.
fr: Toutes les actions de renvoi des filtres, sauf B<SECCOMP_RET_ALLOW>, doivent être journalisées. Un administrateur peut outrepasser cet attribut de filtre en empêchant des actions spécifiques d'être journalisées à l'aide du fichier I</proc/sys/kernel/seccomp/actions_logged>.

source: B<SECCOMP_FILTER_FLAG_SPEC_ALLOW> (since Linux 4.17)
fr: B<SECCOMP_FILTER_FLAG_SPEC_ALLOW> (depuis Linux 4.17)

source: Disable Speculative Store Bypass mitigation.
fr: Désactiver la mitigation Speculative Store Bypass.

source: When adding a new filter, synchronize all other threads of the calling process to the same seccomp filter tree. A "filter tree" is the ordered list of filters attached to a thread. (Attaching identical filters in separate B<seccomp>() calls results in different filters from this perspective.)
fr: Lors de l'ajout d'un filtre, synchroniser tous les autres threads du processus appelant sur la même arborescence de filtres seccomp. Une « arborescence de filtres » est une liste ordonnée de filtres rattachés à un thread (le rattachement de filtres identiques dans des appels B<seccomp>() distincts génère différents filtres depuis cette perspective).

source: If any thread cannot synchronize to the same filter tree, the call will not attach the new seccomp filter, and will fail, returning the first thread ID found that cannot synchronize. Synchronization will fail if another thread in the same process is in B<SECCOMP_MODE_STRICT> or if it has attached new seccomp filters to itself, diverging from the calling thread's filter tree.
fr: Si un thread ne peut pas se synchroniser avec l'arborescence de filtres, l'appel ne rattachera pas le nouveau filtre seccomp et échouera en renvoyant le premier identifiant de thread qui n'a pas pu se synchroniser. La synchronisation échouera si un autre thread du même processus est en B<SECCOMP_MODE_STRICT> ou si des filtres seccomp lui sont rattachés, en décalage par rapport à l'arborescence de filtres du thread appelant.

source: B<SECCOMP_GET_ACTION_AVAIL> (since Linux 4.14)
fr: B<SECCOMP_GET_ACTION_AVAIL> (depuis Linux 4.14)

source: Test to see if an action is supported by the kernel. This operation is helpful to confirm that the kernel knows of a more recently added filter return action since the kernel treats all unknown actions as B<SECCOMP_RET_KILL_PROCESS>.
fr: Tester pour savoir si une action est prise en charge par le noyau. Cette opération peut aider à confirmer que le noyau connaît l'action de renvoi d'un filtre récemment ajouté puisque le noyau traite toutes les actions inconnues comme des B<SECCOMP_RET_KILL_PROCESS>.

source: The value of I<flags> must be 0, and I<args> must be a pointer to an unsigned 32-bit filter return action.
fr: La valeur de I<flags> doit être de B<0> et I<args> doit être un pointeur vers une action de renvoi de filtre 32 bits non signé.

source: Filters
fr: Filtres

source: When adding filters via B<SECCOMP_SET_MODE_FILTER>, I<args> points to a filter program:
fr: Lors de l'ajout d'un filtre à l'aide de B<SECCOMP_SET_MODE_FILTER>, I<args> pointe vers un programme de filtrage :

source: struct sock_fprog { unsigned short len; /* Number of BPF instructions */ struct sock_filter *filter; /* Pointer to array of BPF instructions */ };
fr: struct sock_fprog { unsigned short len; /* Nombre d'instructions BPF */ struct sock_filter *filter; /* Pointeur vers le tableau d'instructions BPF */ };

source: Each program must contain one or more BPF instructions:
fr: Chaque programme doit contenir une ou plusieurs instructions BPF :

source: struct sock_filter { /* Filter block */ __u16 code; /* Actual filter code */ __u8 jt; /* Jump true */ __u8 jf; /* Jump false */ __u32 k; /* Generic multiuse field */ };
fr: struct sock_filter { /* Filter block */ __u16 code; /* Code du filtre réel */ __u8 jt; /* Jump true (sauter le vrai) */ __u8 jf; /* Jump false (sauter le faux) */ __u32 k; /* Champ générique multiusages */ };

source: When executing the instructions, the BPF program operates on the system call information made available (i.e., use the B<BPF_ABS> addressing mode) as a (read-only) buffer of the following form:
fr: Lors de l'exécution des instructions, le programme BPF agit sur les informations de l'appel système qui sont rendues disponibles (c'est-à-dire qu'il utilise le mode d'adressage B<BPF_ABS>) en tant que tampon (en lecture seule) ayant la forme suivante :

source: struct seccomp_data { int nr; /* System call number */ __u32 arch; /* AUDIT_ARCH_* value (see E<lt>linux/audit.hE<gt>) */ __u64 instruction_pointer; /* CPU instruction pointer */ __u64 args[6]; /* Up to 6 system call arguments */ };
fr: struct seccomp_data { int nr; /* Numéro de l'appel système */ __u32 arch; /* Valeur AUDIT_ARCH_* (voir E<lt>linux/audit.hE<gt>) */ __u64 instruction_pointer; /* pointeur vers l'instruction du processeur */ __u64 args[6]; /* Jusqu'à 6 paramètres de l'appel système */ };

source: Because numbering of system calls varies between architectures and some architectures (e.g., x86-64) allow user-space code to use the calling conventions of multiple architectures (and the convention being used may vary over the life of a process that uses B<execve>(2) to execute binaries that employ the different conventions), it is usually necessary to verify the value of the I<arch> field.
fr: Comme la numérotation des appels système varie entre les architectures et comme certaines (comme x86-64) autorisent du code de l'espace utilisateur à utiliser les conventions de l'appelant d'autres architectures (et comme cette convention peut varier pendant la vie d'un processus qui utilise B<execve>(2) pour exécuter des binaires qui utilisent différentes conventions), il est généralement nécessaire de vérifier la valeur du champ I<arch>.

source: It is strongly recommended to use an allow-list approach whenever possible because such an approach is more robust and simple. A deny-list will have to be updated whenever a potentially dangerous system call is added (or a dangerous flag or option if those are deny-listed), and it is often possible to alter the representation of a value without altering its meaning, leading to a deny-list bypass. See also I<Caveats> below.
fr: Il est fortement recommandé d'utiliser une approche par liste d'autorisations autant que possible, parce qu'une telle approche est plus robuste et plus simple. Une liste d'interdictions devra être mise à jour à chaque fois qu'un appel système dangereux sera ajouté (ou un attribut ou une option si elles font partie de la liste des interdictions) et il est souvent possible de modifier la représentation d'une valeur sans changer sa signification, conduisant à contourner la liste d'interdictions. Voir aussi I<Mises en garde> ci-dessous.

source: The I<arch> field is not unique for all calling conventions. The x86-64 ABI and the x32 ABI both use B<AUDIT_ARCH_X86_64> as I<arch>, and they run on the same processors. Instead, the mask B<__X32_SYSCALL_BIT> is used on the system call number to tell the two ABIs apart.
fr: Le champ I<arch> n'est pas unique pour toutes les conventions d'appelant. Les ABI x86-64 et x32 utilisent B<AUDIT_ARCH_X86_64> en tant que I<arch> et elles fonctionnent sur les mêmes processeurs. Au contraire, le masque B<__X32_SYSCALL_BIT> est utilisé sur le numéro d'appel système pour parler indépendamment aux deux ABI.

source: This means that a policy must either deny all syscalls with B<__X32_SYSCALL_BIT> or it must recognize syscalls with and without B<__X32_SYSCALL_BIT> set. A list of system calls to be denied based on I<nr> that does not also contain I<nr> values with B<__X32_SYSCALL_BIT> set can be bypassed by a malicious program that sets B<__X32_SYSCALL_BIT>.
fr: Cela veut dire qu'une politique peut soit interdire tous les appels système avec B<__X32_SYSCALL_BIT>, soit elle doit les reconnaître avec le positionnement ou pas de B<__X32_SYSCALL_BIT>. Une liste des appels système à interdire qui s'appuie sur I<nr> et qui ne contient pas de valeurs I<nr> où B<__X32_SYSCALL_BIT> est positionné peut être contournée par un programme malveillant qui positionne B<__X32_SYSCALL_BIT>.

source: Additionally, kernels prior to Linux 5.4 incorrectly permitted I<nr> in the ranges 512-547 as well as the corresponding non-x32 syscalls ORed with B<__X32_SYSCALL_BIT>. For example, I<nr> == 521 and I<nr> == (101 | B<__X32_SYSCALL_BIT>) would result in invocations of B<ptrace>(2) with potentially confused x32-vs-x86_64 semantics in the kernel. Policies intended to work on kernels before Linux 5.4 must ensure that they deny or otherwise correctly handle these system calls. On Linux 5.4 and newer, such system calls will fail with the error B<ENOSYS>, without doing anything.
fr: En outre, les noyaux précédant Linux 5.4 autorisaient à tort I<nr> dans les intervalles 512–547 ainsi que les appels système non x32 correspondants reliés (opération OU) avec B<__X32_SYSCALL_BIT>. Par exemple, I<nr> == 521 et I<nr> == (101 | B<__X32_SYSCALL_BIT>) créeraient des appels B<ptrace>(2) avec une sémantique potentiellement confondue entre x32 et x86_64 dans le noyau. Les politiques prévues pour fonctionner sur des noyaux antérieurs à Linux 5.4 doivent garantir qu'elles interdisent ou qu'elles gèrent correctement ces appels système. Sur Linux 5.4 et plus récents, de tels appels système échoueront avec une erreur B<ENOSYS> sans rien faire.

source: When checking values from I<args>, keep in mind that arguments are often silently truncated before being processed, but after the seccomp check. For example, this happens if the i386 ABI is used on an x86-64 kernel: although the kernel will normally not look beyond the 32 lowest bits of the arguments, the values of the full 64-bit registers will be present in the seccomp data. A less surprising example is that if the x86-64 ABI is used to perform a system call that takes an argument of type I<int>, the more-significant half of the argument register is ignored by the system call, but visible in the seccomp data.
fr: Lors de la vérification des valeurs de I<args>, gardez en tête que les paramètres sont souvent tronqués silencieusement avant d'être traités mais après la vérification seccomp. Cela arrive par exemple si l'ABI i386 est utilisée sur un noyau x86-64 : bien que le noyau n'ira normalement pas regarder au-delà des 32 bits les plus faibles des paramètres, les valeurs des registres 64 bits complets seront présentes dans les données de seccomp. Un exemple moins surprenant est que si l'ABI x86-64 est utilisée pour effectuer un appel système prenant un paramètre de type I<int>, la moitié du registre du paramètre la plus significative est ignorée par l'appel système mais visible dans les données de seccomp.

source: A seccomp filter returns a 32-bit value consisting of two parts: the most significant 16 bits (corresponding to the mask defined by the constant B<SECCOMP_RET_ACTION_FULL>) contain one of the "action" values listed below; the least significant 16-bits (defined by the constant B<SECCOMP_RET_DATA>) are "data" to be associated with this return value.
fr: Un filtre seccomp renvoie une valeur 32 bits en deux parties : la plus significative, de 16 bits (correspondant au masque défini par la constante B<SECCOMP_RET_ACTION_FULL>), contient une des valeurs « action » listée ci-dessous ; la moins significative, de 16 bits (définie par la constante B<SECCOMP_RET_DATA>), contient des « data » à associer à ce code de retour.

source: If multiple filters exist, they are I<all> executed, in reverse order of their addition to the filter tree\(emthat is, the most recently installed filter is executed first. (Note that all filters will be called even if one of the earlier filters returns B<SECCOMP_RET_KILL>. This is done to simplify the kernel code and to provide a tiny speed-up in the execution of sets of filters by avoiding a check for this uncommon case.) The return value for the evaluation of a given system call is the first-seen action value of highest precedence (along with its accompanying data) returned by execution of all of the filters.
fr: Si plusieurs filtres existent, ils sont I<tous> exécutés dans l'ordre inverse de leur apparition dans l'arbre des filtres – si bien que le filtre le plus récemment installé est exécuté en premier) (remarquez que tous les filtres seront appelés même si l'un des premiers appellés renvoie B<SECCOMP_RET_KILL>. Cela pour simplifier le code du noyau et pour fournir une petite accélération d’exécution d’ensembles de filtres en évitant la vérification de ce cas particulier). La valeur renvoyée de l'évaluation d'un appel système donné est la première valeur vue de l'action de plus haute priorité (ainsi que ses données associées) renvoyée par l'exécution de tous les filtres.

source: In decreasing order of precedence, the action values that may be returned by a seccomp filter are:
fr: Dans l'ordre décroissant de priorité, les valeurs d'action qui peuvent être renvoyées par un filtre seccomp sont :

source: B<SECCOMP_RET_KILL_PROCESS> (since Linux 4.14)
fr: B<SECCOMP_RET_KILL_PROCESS> (depuis Linux 4.14)

source: This value results in immediate termination of the process, with a core dump. The system call is not executed. By contrast with B<SECCOMP_RET_KILL_THREAD> below, all threads in the thread group are terminated. (For a discussion of thread groups, see the description of the B<CLONE_THREAD> flag in B<clone>(2).)
fr: Cette valeur aboutit à la fin immédiate du processus, avec un vidage mémoire. L'appel système n'est pas exécuté. Contrairement à B<SECCOMP_RET_KILL_THREAD> ci-dessous, tous les threads du groupe de threads sont terminés (pour un point sur les groupes de thread, voir la description de l'attribut B<CLONE_THREAD> de B<clone>(2)).

source: The process terminates I<as though> killed by a B<SIGSYS> signal. Even if a signal handler has been registered for B<SIGSYS>, the handler will be ignored in this case and the process always terminates. To a parent process that is waiting on this process (using B<waitpid>(2) or similar), the returned I<wstatus> will indicate that its child was terminated as though by a B<SIGSYS> signal.
fr: Le processus se termine I<parce que> il a été tué par un signal B<SIGSYS>. Même si un gestionnaire de signal a été enregistré pour B<SIGSYS>, le gestionnaire sera ignoré dans ce cas et le processus se termine toujours. Le processus parent qui attend ce processus (en utilisant B<waitpid>(2) ou équivalent) reçoit I<wstatus> qui indique que son enfant s'est terminé suite à un signal B<SIGSYS>.

source: B<SECCOMP_RET_KILL_THREAD> (or B<SECCOMP_RET_KILL>)
fr: B<SECCOMP_RET_KILL_THREAD> (ou B<SECCOMP_RET_KILL>)

source: This value results in immediate termination of the thread that made the system call. The system call is not executed. Other threads in the same thread group will continue to execute.
fr: Cette valeur provoque la fin immédiate du thread qui a effectué l'appel système. L'appel système n'est pas exécuté. Les autres threads du même groupe de threads continueront à s'exécuter.

source: The thread terminates I<as though> killed by a B<SIGSYS> signal. See B<SECCOMP_RET_KILL_PROCESS> above.
fr: Le thread s'est terminé I<comme> tué par un signal B<SIGSYS>. Voir B<SECCOMP_RET_KILL_PROCESS> ci-dessus.

source: Before Linux 4.11, any process terminated in this way would not trigger a coredump (even though B<SIGSYS> is documented in B<signal>(7) as having a default action of termination with a core dump). Since Linux 4.11, a single-threaded process will dump core if terminated in this way.
fr: Avant Linux 4.11, tout processus qui se terminait de cette manière ne générait pas de vidage mémoire (bien que B<SIGSYS> soit documenté dans B<signal>(7) pour avoir comme action par défaut celle de terminer avec un vidage mémoire). Depuis Linux 4.11, un processus d'un seul thread créera un vidage mémoire s'il se termine dans ce cadre.

source: With the addition of B<SECCOMP_RET_KILL_PROCESS> in Linux 4.14, B<SECCOMP_RET_KILL_THREAD> was added as a synonym for B<SECCOMP_RET_KILL>, in order to more clearly distinguish the two actions.
fr: Avec l'apparition de B<SECCOMP_RET_KILL_PROCESS> dans Linux 4.14, B<SECCOMP_RET_KILL_THREAD> a été ajouté comme synonyme de B<SECCOMP_RET_KILL>, afin de distinguer plus clairement les deux actions.

source: B<Note>: the use of B<SECCOMP_RET_KILL_THREAD> to kill a single thread in a multithreaded process is likely to leave the process in a permanently inconsistent and possibly corrupt state.
fr: B<Remarque :> l'utilisation de B<SECCOMP_RET_KILL_THREAD> pour tuer un thread unique d'un processus de plusieurs threads va probablement mettre le processus dans un état incohérent et corrompre pour toujours son état.

source: This value results in the kernel sending a thread-directed B<SIGSYS> signal to the triggering thread. (The system call is not executed.) Various fields will be set in the I<siginfo_t> structure (see B<sigaction>(2)) associated with signal:
fr: Cette valeur fait envoyer par le noyau un signal B<SIGSYS> adressé au thread déclencheur (l'appel système n'est pas exécuté). Divers champs seront positionnés dans la structure I<siginfo_t> (voir B<sigaction>(2)) associée au signal :

source: I<si_signo> will contain B<SIGSYS>.
fr: I<si_signo> contiendra B<SIGSYS>.

source: I<si_call_addr> will show the address of the system call instruction.
fr: I<si_call_addr> affichera l'adresse de l'instruction de l'appel système.

source: I<si_syscall> and I<si_arch> will indicate which system call was attempted.
fr: I<si_syscall> et I<si_arch> indiqueront l'appel système qui a été essayé.

source: I<si_code> will contain B<SYS_SECCOMP>.
fr: I<si_code> contiendra B<SYS_SECCOMP>.
