Repository: sebras/manpages-l10n
Catalog: po/*/man2/seccomp.2.po
Languages: fr

source: I<si_errno> will contain the B<SECCOMP_RET_DATA> portion of the filter return value.
fr: I<si_errno> contiendra la partie B<SECCOMP_RET_DATA> du code de retour du filtre.

source: The program counter will be as though the system call happened (i.e., the program counter will not point to the system call instruction). The return value register will contain an architecture-dependent value; if resuming execution, set it to something appropriate for the system call. (The architecture dependency is because replacing it with B<ENOSYS> could overwrite some useful information.)
fr: Le compteur du programme sera arrêté sitôt l'appel système fait (c'est-à-dire que le compteur du programme ne pointera pas vers l'instruction de l'appel système). Le registre du code de retour contiendra une valeur dépendante de l'architecture ; en cas de relance de l'exécution, positionnez-la sur quelque chose adapté à l'appel système (la dépendance de l'architecture provient du fait que son remplacement par B<ENOSYS> écraserait des informations utiles).

source: This value results in the B<SECCOMP_RET_DATA> portion of the filter's return value being passed to user space as the I<errno> value without executing the system call.
fr: Cette valeur fait passer la partie B<SECCOMP_RET_DATA> du code de retour du filtre à l'espace utilisateur en tant que valeur I<errno> sans exécuter l'appel système.

source: When returned, this value will cause the kernel to attempt to notify a B<ptrace>(2)-based tracer prior to executing the system call. If there is no tracer present, the system call is not executed and returns a failure status with I<errno> set to B<ENOSYS>.
fr: Quand cette valeur est renvoyée, le noyau essaiera de notifier à un observateur basé sur B<ptrace>(2) avant d'exécuter l'appel système. Si aucun observateur n'est présent, l'appel système n'est pas exécuté et renvoie un échec en positionnant I<errno> sur B<ENOSYS>.

source: A tracer will be notified if it requests B<PTRACE_O_TRACESECCOMP> using I<ptrace(PTRACE_SETOPTIONS)>. The tracer will be notified of a B<PTRACE_EVENT_SECCOMP> and the B<SECCOMP_RET_DATA> portion of the filter's return value will be available to the tracer via B<PTRACE_GETEVENTMSG>.
fr: Un observateur sera notifié s'il demande B<PTRACE_O_TRACESECCOMP> en utilisant I<ptrace(PTRACE_SETOPTIONS)>. Il sera notifié d'un B<PTRACE_EVENT_SECCOMP> et la partie B<SECCOMP_RET_DATA> du code de retour du filtre sera mise à la disposition de l'observateur à l'aide de B<PTRACE_GETEVENTMSG>.

source: The tracer can skip the system call by changing the system call number to -1. Alternatively, the tracer can change the system call requested by changing the system call to a valid system call number. If the tracer asks to skip the system call, then the system call will appear to return the value that the tracer puts in the return value register.
fr: L'observateur peut ignorer l'appel système en modifiant le numéro de l'appel système à B<-1>. Autrement, l'observateur peut modifier l'appel système demandé en le passant à un numéro d'appel système valable. Si l'observateur demande à ignorer l'appel système, ce dernier renverra la valeur que l'observateur place dans le registre du code de retour.

source: Before kernel 4.8, the seccomp check will not be run again after the tracer is notified. (This means that, on older kernels, seccomp-based sandboxes B<must not> allow use of B<ptrace>(2)\(emeven of other sandboxed processes\(emwithout extreme care; ptracers can use this mechanism to escape from the seccomp sandbox.)
fr: Avant le noyau 4.8, la vérification seccomp ne sera pas refaite après que l'observateur ait reçu une notification (cela signifie que sur les anciens noyaux, les conteneurs basés sur seccomp B<ne doivent pas> autoriser l'utilisation de B<ptrace>(2) – même sur d'autres processus encapsulés – sans une prudence extrême ; les ptracers peuvent utiliser ce mécanisme pour sortir d'un conteneur seccomp).

source: Note that a tracer process will not be notified if another filter returns an action value with a precedence greater than B<SECCOMP_RET_TRACE>.
fr: Remarquez que le processus d'un observateur ne sera pas notifié si un autre filtre renvoie une valeur d'action ayant une priorité supérieure à B<SECCOMP_RET_TRACE>.

source: B<SECCOMP_RET_LOG> (since Linux 4.14)
fr: B<SECCOMP_RET_LOG> (depuis Linux 4.14)

source: This value results in the system call being executed after the filter return action is logged. An administrator may override the logging of this action via the I</proc/sys/kernel/seccomp/actions_logged> file.
fr: Cette valeur fait exécuter l'appel système après l'enregistrement de l'action de retour du filtre. Un administrateur peut supplanter la journalisation de cette action à l'aide du fichier I</proc/sys/kernel/seccomp/actions_logged>.

source: This value results in the system call being executed.
fr: Cette valeur provoque l'exécution de l'appel système.

source: If an action value other than one of the above is specified, then the filter action is treated as either B<SECCOMP_RET_KILL_PROCESS> (since Linux 4.14) or B<SECCOMP_RET_KILL_THREAD> (in Linux 4.13 and earlier).
fr: Si on indique un code d'action différent de ceux ci-dessus, l'action de filtre est traitée soit comme un B<SECCOMP_RET_KILL_PROCESS> (depuis Linux 4.14), soit comme un B<SECCOMP_RET_KILL_THREAD> (dans Linux 4.13 et antérieurs).

source: /proc interfaces
fr: Interfaces /proc

source: The files in the directory I</proc/sys/kernel/seccomp> provide additional seccomp information and configuration:
fr: Les fichiers du répertoire I</proc/sys/kernel/seccomp> offrent des informations et des configurations seccomp supplémentaires :

source: I<actions_avail> (since Linux 4.14)
fr: I<actions_avail> (depuis Linux 4.14)

source: A read-only ordered list of seccomp filter return actions in string form. The ordering, from left-to-right, is in decreasing order of precedence. The list represents the set of seccomp filter return actions supported by the kernel.
fr: Une liste ordonnée en lecture seule d'actions de renvoi de filtre seccomp sous la forme d'une chaîne. L'ordre, de gauche à droite, est décroissant pour la priorité. La liste représente l'ensemble des actions de renvoi de filtre seccomp gérées par le noyau.

source: I<actions_logged> (since Linux 4.14)
fr: I<actions_logged> (depuis Linux 4.14)

source: A read-write ordered list of seccomp filter return actions that are allowed to be logged. Writes to the file do not need to be in ordered form but reads from the file will be ordered in the same way as the I<actions_avail> file.
fr: Une liste ordonnée en lecture-écriture d'actions de renvoi de filtre seccomp autorisées pour la journalisation. Les écritures dans le fichier n'ont pas besoin d'être ordonnées, mais les lectures se feront dans le même ordre que pour I<actions_avail>.

source: It is important to note that the value of I<actions_logged> does not prevent certain filter return actions from being logged when the audit subsystem is configured to audit a task. If the action is not found in the I<actions_logged> file, the final decision on whether to audit the action for that task is ultimately left up to the audit subsystem to decide for all filter return actions other than B<SECCOMP_RET_ALLOW>.
fr: Il est important de remarquer que la valeur de I<actions_logged> n'empêche pas certaines actions de renvoi de filtre de s'enregistrer quand le sous-système d'audit est configuré pour auditer une tâche. Si l'action n'est pas retrouvée dans le fichier I<actions_logged>, la décision finale d'auditer l'action de cette tâche revient au sous-système d'audit pour toutes les actions de renvoi de filtre autres que B<SECCOMP_RET_ALLOW>.

source: The "allow" string is not accepted in the I<actions_logged> file as it is not possible to log B<SECCOMP_RET_ALLOW> actions. Attempting to write "allow" to the file will fail with the error B<EINVAL>.
fr: La chaîne « allow » n'est pas acceptée dans le fichier I<actions_logged> car il n'est pas possible d'enregistrer les actions B<SECCOMP_RET_ALLOW>. Essayer d'écrire « allow » dans le fichier échouera avec l'erreur B<EINVAL>.

source: Audit logging of seccomp actions
fr: Enregistrement d'audit des actions seccomp

source: Since Linux 4.14, the kernel provides the facility to log the actions returned by seccomp filters in the audit log. The kernel makes the decision to log an action based on the action type, whether or not the action is present in the I<actions_logged> file, and whether kernel auditing is enabled (e.g., via the kernel boot option I<audit=1>). The rules are as follows:
fr: Depuis Linux 4.14, le noyau offre la possibilité d'enregistrer les actions renvoyées par des filtres seccomp dans le compte-rendu d'audit. Le noyau prend la décision d'enregistrer une action à partir du type d'action, de sa présence dans le fichier I<actions_logged> et de l'activation de l'audit du noyau (par exemple avec l'option d'amorçage du noyau I<audit=1>). Les règles sont les suivantes :

source: If the action is B<SECCOMP_RET_ALLOW>, the action is not logged.
fr: Si l'action est B<SECCOMP_RET_ALLOW>, l'action n'est pas enregistrée.

source: Otherwise, if the action is either B<SECCOMP_RET_KILL_PROCESS> or B<SECCOMP_RET_KILL_THREAD>, and that action appears in the I<actions_logged> file, the action is logged.
fr: Sinon, si l'action est B<SECCOMP_RET_KILL_PROCESS> ou B<SECCOMP_RET_KILL_THREAD> et si elle apparaît dans le fichier I<actions_logged>, l'action est enregistrée.

source: Otherwise, if the filter has requested logging (the B<SECCOMP_FILTER_FLAG_LOG> flag) and the action appears in the I<actions_logged> file, the action is logged.
fr: Sinon, si le filtre a demandé l'enregistrement (l'attribut B<SECCOMP_FILTER_FLAG_LOG>) et si elle apparaît dans le fichier I<actions_logged>, l'action est enregistrée.

source: Otherwise, if kernel auditing is enabled and the process is being audited (B<autrace>(8)), the action is logged.
fr: Sinon, si l'audit du noyau est activé et si le processus doit être audité (B<autrace>(8)), l'action est enregistrée.

source: Otherwise, the action is not logged.
fr: Sinon, l'action n'est pas enregistrée.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<seccomp>() returns 0. On error, if B<SECCOMP_FILTER_FLAG_TSYNC> was used, the return value is the ID of the thread that caused the synchronization failure. (This ID is a kernel thread ID of the type returned by B<clone>(2) and B<gettid>(2).) On other errors, -1 is returned, and I<errno> is set to indicate the error.
fr: En cas de succès, B<seccomp>() renvoie B<0>. En cas d'erreur, si B<SECCOMP_FILTER_FLAG_TSYNC> a été utilisé, le code de retour est l'identifiant du thread à l'origine de l'échec de la synchronisation (cet identifiant est un identifiant de thread du noyau du type renvoyé par B<clone>(2) et B<gettid>(2)). Si une autre erreur arrive, B<-1> est renvoyé et I<errno> est positionné pour indiquer l'erreur.

source: ERRORS
fr: ERREURS

source: B<seccomp>() can fail for the following reasons:
fr: B<seccomp>() peut échouer pour les raisons suivantes :

source: The caller did not have the B<CAP_SYS_ADMIN> capability in its user namespace, or had not set I<no_new_privs> before using B<SECCOMP_SET_MODE_FILTER>.
fr: L'appelant n'avait pas la capacité B<CAP_SYS_ADMIN> dans son espace de noms utilisateur ou n'avait pas positionné I<no_new_privs> avant d'utiliser B<SECCOMP_SET_MODE_FILTER>.

source: I<args> was not a valid address.
fr: I<args> n'était pas une adresse valable.

source: I<operation> is unknown or is not supported by this kernel version or configuration.
fr: L'I<operation> est inconnue ou n'est pas prise en charge par cette version ou cette configuration du noyau.

source: The specified I<flags> are invalid for the given I<operation>.
fr: Les I<flags> spécifiés ne sont pas valables pour l'I<operation> donnée.

source: A secure computing mode has already been set, and I<operation> differs from the existing setting.
fr: Un mode de calcul sécurisé a déjà été défini et l'I<operation> diffère du paramétrage existant.

source: I<operation> specified B<SECCOMP_SET_MODE_FILTER>, but the filter program pointed to by I<args> was not valid or the length of the filter program was zero or exceeded B<BPF_MAXINSNS> (4096) instructions.
fr: I<operation> indiquait B<SECCOMP_SET_MODE_FILTER> mais le programme de filtre vers lequel pointait I<args> n'était pas valable ou sa longueur était de zéro ou dépassait B<BPF_MAXINSNS> instructions (4096).

source: Out of memory.
fr: Plus assez de mémoire.

source: The total length of all filter programs attached to the calling thread would exceed B<MAX_INSNS_PER_PATH> (32768) instructions. Note that for the purposes of calculating this limit, each already existing filter program incurs an overhead penalty of 4 instructions.
fr: La taille totale de tous les programmes de filtre rattachés au thread appelant dépasserait B<MAX_INSNS_PER_PATH> instructions (32768). Remarquez qu'afin de calculer cette limite, chaque programme de filtre déjà existant intègre une pénalité de dépassement de B<4> instructions.

source: I<operation> specified B<SECCOMP_GET_ACTION_AVAIL>, but the kernel does not support the filter return action specified by I<args>.
fr: I<operation> indiquait B<SECCOMP_GET_ACTION_AVAIL> mais le noyau ne gère pas l'action de renvoi de filtre indiquée par I<args>.

source: Another thread caused a failure during thread sync, but its ID could not be determined.
fr: Un autre thread a provoqué un échec pendant la synchronisation, mais son identifiant n'a pas pu être déterminé.

source: The B<seccomp>() system call first appeared in Linux 3.17.
fr: L'appel système B<seccomp>() est apparu pour la première fois dans Linux 3.17.

source: The B<seccomp>() system call is a nonstandard Linux extension.
fr: L'appel système B<seccomp>() est une extension Linux non standard.

source: Rather than hand-coding seccomp filters as shown in the example below, you may prefer to employ the I<libseccomp> library, which provides a front-end for generating seccomp filters.
fr: Au lieu de coder à la main des filtres seccomp comme démontré dans l'exemple ci-dessous, vous pourriez préférer utiliser la bibliothèque I<libseccomp> qui fournit une interface de génération de filtres seccomp.

source: B<seccomp>() provides a superset of the functionality provided by the B<prctl>(2) B<PR_SET_SECCOMP> operation (which does not support I<flags>).
fr: B<seccomp>() fournit un sur-ensemble de fonctionnalités de l'opération B<PR_SET_SECCOMP> de B<prctl>(2) (qui ne prend pas en charge les I<flags>).

source: Since Linux 4.4, the B<ptrace>(2) B<PTRACE_SECCOMP_GET_FILTER> operation can be used to dump a process's seccomp filters.
fr: Depuis Linux 4.4, l'opération B<PTRACE_SECCOMP_GET_FILTER> de B<ptrace>(2) peut être utilisée pour obtenir un fichier des filtres seccomp d'un processus.

source: Architecture support for seccomp BPF
fr: Gestion d'architecture pour le BPF seccomp

source: Architecture support for seccomp BPF filtering is available on the following architectures:
fr: La gestion d'architecture pour le filtrage de BPF seccomp est disponible sur les architectures suivantes :

source: x86-64, i386, x32 (since Linux 3.5)
fr: x86-64, i386, x32 (depuis Linux 3.5)

source: ARM (since Linux 3.8)
fr: ARM (depuis Linux 3.8)

source: s390 (since Linux 3.8)
fr: s390 (depuis Linux 3.8)

source: MIPS (since Linux 3.16)
fr: MIPS (depuis Linux 3.16)

source: ARM-64 (since Linux 3.19)
fr: ARM-64 (depuis Linux 3.19)

source: PowerPC (since Linux 4.3)
fr: PowerPC (depuis Linux 4.3)

source: Tile (since Linux 4.3)
fr: Tile (depuis Linux 4.3)

source: PA-RISC (since Linux 4.6)
fr: PA-RISC (depuis Linux 4.6)

source: Caveats
fr: Mises en garde

source: There are various subtleties to consider when applying seccomp filters to a program, including the following:
fr: Il y a beaucoup de subtilités à prendre en compte lorsqu'on applique des filtres seccomp à un programme, notamment :

source: Some traditional system calls have user-space implementations in the B<vdso>(7) on many architectures. Notable examples include B<clock_gettime>(2), B<gettimeofday>(2), and B<time>(2). On such architectures, seccomp filtering for these system calls will have no effect. (However, there are cases where the B<vdso>(7) implementations may fall back to invoking the true system call, in which case seccomp filters would see the system call.)
fr: Certains appels système traditionnels ont des implémentations dans l'espace utilisateur dans le B<vdso>(7) de nombreuses architectures. Parmi les exemples remarquables, se trouvent B<clock_gettime>(2), B<gettimeofday>(2) et B<time>(2). Sur de telles architectures, le filtrage seccomp de ces appels système sera sans effet (il y a cependant des cas où les implémentations B<vdso>(7) se rabattent sur le véritable appel système, alors les filtres seccomp verraient l'appel système).

source: Seccomp filtering is based on system call numbers. However, applications typically do not directly invoke system calls, but instead call wrapper functions in the C library which in turn invoke the system calls. Consequently, one must be aware of the following:
fr: Le filtrage seccomp s'appuie sur les numéros d'appel système. Cependant, les applications n'appellent généralement pas directement les appels système, mais plutôt les fonctions enveloppe de la bibliothèque C qui appellent à leur tour les appels système. Par conséquent, vous devez garder en tête ce qui suit :

source: The glibc wrappers for some traditional system calls may actually employ system calls with different names in the kernel. For example, the B<exit>(2) wrapper function actually employs the B<exit_group>(2) system call, and the B<fork>(2) wrapper function actually calls B<clone>(2).
fr: Les enveloppes de la glibc pour certains appels système traditionnels peuvent utiliser des appels système ayant des noms différents dans le noyau. Par exemple, la fonction enveloppe B<exit>(2) utilise en fait l'appel système B<exit_group>(2) et la fonction B<fork>(2) utilise en réalité les appels B<clone>(2).

source: The behavior of wrapper functions may vary across architectures, according to the range of system calls provided on those architectures. In other words, the same wrapper function may invoke different system calls on different architectures.
fr: Le comportement des fonctions enveloppe peut changer en fonction des architectures, selon la plage d'appels système fournie sur ces architectures. Autrement dit, la même fonction enveloppe peut appeler différents appels système selon les architectures.

source: Finally, the behavior of wrapper functions can change across glibc versions. For example, in older versions, the glibc wrapper function for B<open>(2) invoked the system call of the same name, but starting in glibc 2.26, the implementation switched to calling B<openat>(2) on all architectures.
fr: Enfin, le comportement des fonctions enveloppe peut changer selon les versions de la glibc. Par exemple, dans d'anciennes versions, la fonction enveloppe de la glibc de B<open>(2) appelait l'appel système du même nom, mais à partir de la 2.26, l'implémentation est passée à l'appel B<openat>(2) sur toutes les architectures.

source: The consequence of the above points is that it may be necessary to filter for a system call other than might be expected. Various manual pages in Section 2 provide helpful details about the differences between wrapper functions and the underlying system calls in subsections entitled I<C library/kernel differences>.
fr: La conséquence des points ci-dessus est qu'il pourrait être nécessaire de filtrer un appel système autre que celui prévu. Plusieurs pages de manuel de la section 2 donnent des détails utiles sur les différences entre les fonctions enveloppe et les appels système sous-jacents dans les sous-sections intitulées I<Différences entre le noyau et la bibliothèque C>.

source: Furthermore, note that the application of seccomp filters even risks causing bugs in an application, when the filters cause unexpected failures for legitimate operations that the application might need to perform. Such bugs may not easily be discovered when testing the seccomp filters if the bugs occur in rarely used application code paths.
fr: En outre, remarquez que l'application de filtres seccomp risque même de provoquer des bogues dans une application, quand les filtres provoquent des échecs inattendus d'opérations légitimes que l'application a besoin d'effectuer. De tels bogues pourraient ne pas être facilement identifiés lors d'un test des filtres seccomp s'ils se produisent à des endroits du code rarement utilisés.

source: Seccomp-specific BPF details
fr: Détails BPF spécifiques à seccomp

source: Note the following BPF details specific to seccomp filters:
fr: Remarquez que les détails BPF suivants sont spécifiques aux filtres seccomp :

source: The B<BPF_H> and B<BPF_B> size modifiers are not supported: all operations must load and store (4-byte) words (B<BPF_W>).
fr: Les modificateurs de taille B<BPF_H> et B<BPF_B> ne sont pas pris en charge : toutes les opérations doivent charger et stocker des mots (4 octets) (B<BPF_W>).

source: To access the contents of the I<seccomp_data> buffer, use the B<BPF_ABS> addressing mode modifier.
fr: Pour accéder au contenu du tampon I<seccomp_data>, utilisez le modificateur du mode d'adressage B<BPF_ABS>.

source: The B<BPF_LEN> addressing mode modifier yields an immediate mode operand whose value is the size of the I<seccomp_data> buffer.
fr: Le modificateur du mode d'adressage B<BPF_LEN> produit un opérande de mode immédiatement dont la valeur est la taille du tampon I<seccomp_data>.

source: EXAMPLES
fr: EXEMPLES

source: The program below accepts four or more arguments. The first three arguments are a system call number, a numeric architecture identifier, and an error number. The program uses these values to construct a BPF filter that is used at run time to perform the following checks:
fr: Le programme ci-dessous accepte quatre paramètres ou plus. Les trois premiers sont un numéro d'appel système, un identifiant numérique d'architecture et un numéro d'erreur. Le programme utilise ces valeurs pour construire un filtre BPF utilisé lors de l'exécution pour effectuer les vérifications suivantes :

source: If the program is not running on the specified architecture, the BPF filter causes system calls to fail with the error B<ENOSYS>.
fr: Si le programme ne tourne pas sur l'architecture indiquée, le filtre BPF fait échouer les appels système avec l'erreur B<ENOSYS>.

source: If the program attempts to execute the system call with the specified number, the BPF filter causes the system call to fail, with I<errno> being set to the specified error number.
fr: Si le programme essaie d'exécuter l'appel système ayant le numéro indiqué, le filtre BPF fait échouer l'appel système en positionnant I<errno> sur le numéro d'erreur indiqué.

source: The remaining command-line arguments specify the pathname and additional arguments of a program that the example program should attempt to execute using B<execv>(3) (a library function that employs the B<execve>(2) system call). Some example runs of the program are shown below.
fr: Les autres paramètres de la ligne de commande indiquent le chemin et les paramètres supplémentaires d'un programme que notre exemple doit essayer d'exécuter en utilisant B<execv>(3) (une fonction de bibliothèque qui utilise l'appel système B<execve>(2)). Certains exemples d’exécution du programme sont présentées ci-dessous.
