Repository: sebras/manpages-l10n
Catalog: po/*/man2/seccomp.2.po
Languages: fr

source: First, we display the architecture that we are running on (x86-64) and then construct a shell function that looks up system call numbers on this architecture:
fr: Tout d'abord, on affiche l'architecture sur laquelle on est (x86-64) puis on construit une fonction d’interpréteur qui cherche les numéros d'appels système sur cette architecture :

source: When the BPF filter rejects a system call (case [2] above), it causes the system call to fail with the error number specified on the command line. In the experiments shown here, we'll use error number 99:
fr: Quand le filtre BPF rejette un appel système (cas n° 2 ci-dessus), il fait échouer l'appel système avec le numéro d'erreur indiqué sur la ligne de commande. Dans les exemples présentés ici, nous utiliserons le numéro d'erreur 99 :

source: $ B<errno 99> EADDRNOTAVAIL 99 Cannot assign requested address
fr: $ B<errno 99> EADDRNOTAVAIL 99 Ne peut pas affecter l'adresse demandée

source: In the following example, we attempt to run the command B<whoami>(1), but the BPF filter rejects the B<execve>(2) system call, so that the command is not even executed:
fr: Dans l'exemple suivant, on essaie d'exécuter la commande B<whoami>(1), mais le filtre BPF rejette l'appel système B<execve>(2), donc la commande n'est même pas exécutée :

source: $ B<syscall_nr execve> 59 $ B<./a.out> Usage: ./a.out E<lt>syscall_nrE<gt> E<lt>archE<gt> E<lt>errnoE<gt> E<lt>progE<gt> [E<lt>argsE<gt>] Hint for E<lt>archE<gt>: AUDIT_ARCH_I386: 0x40000003 AUDIT_ARCH_X86_64: 0xC000003E $ B<./a.out 59 0xC000003E 99 /bin/whoami> execv: Cannot assign requested address
fr: $ B<syscall_nr execve> 59 $ B<./a.out> Utilisation : ./a.out E<lt>syscall_nrE<gt> E<lt>archE<gt> E<lt>errnoE<gt> E<lt>progE<gt> [E<lt>argsE<gt>] Astuce pour E<lt>archE<gt> : AUDIT_ARCH_I386: 0x40000003 AUDIT_ARCH_X86_64 : 0xC000003E $ B<./a.out 59 0xC000003E 99 /bin/whoami> execv : Ne peut pas affecter l'adresse demandée

source: In the next example, the BPF filter rejects the B<write>(2) system call, so that, although it is successfully started, the B<whoami>(1) command is not able to write output:
fr: Dans le prochain exemple, le filtre BPF rejette l'appel système B<write>(2) pour que, même si elle a pu démarrer, la commande B<whoami>(1) ne puisse pas écrire de sortie :

source: In the final example, the BPF filter rejects a system call that is not used by the B<whoami>(1) command, so it is able to successfully execute and produce output:
fr: Dans le dernier exemple, le filtre BPF rejette un appel système qui n'est pas utilisé par la commande B<whoami>(1), elle peut donc s'exécuter et produire une sortie :

source: Program source
fr: Source du programme

source: /* Assume that AUDIT_ARCH_X86_64 means the normal x86-64 ABI (in the x32 ABI, all system calls have bit 30 set in the \(aqnr\(aq field, meaning the numbers are E<gt>= X32_SYSCALL_BIT). */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;
fr: /* On suppose que AUDIT_ARCH_X86_64 renvoie à l'ABI x86-64 normale (dans l'ABI x32, tous les appels système ont le bit 30 positionné dans le champ \(aqnr\(aq, donc les numéros sont E<gt>= X32_SYSCALL_BIT). */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;

source: struct sock_filter filter[] = { /* [0] Load architecture from \(aqseccomp_data\(aq buffer into accumulator. */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),
fr: struct sock_filter filter[] = { /* [0] Charger l'architecture depuis le tampon \(aqseccomp_data\(aq dans l'accumulateur. */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),

source: /* [1] Jump forward 5 instructions if architecture does not match \(aqt_arch\(aq. */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),
fr: /* [1] Revenir en arrière de 5 instructions si l'architecture ne correspond pas à \(aqt_arch\(aq. */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),

source: /* [2] Load system call number from \(aqseccomp_data\(aq buffer into accumulator. */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),
fr: /* [2] Charger le numéro d'appel système depuis le tampon \(aqseccomp_data\(aq dans l'accumulateur. */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),

source: /* [3] Check ABI - only needed for x86-64 in deny-list use cases. Use BPF_JGT instead of checking against the bit mask to avoid having to reload the syscall number. */ BPF_JUMP(BPF_JMP | BPF_JGT | BPF_K, upper_nr_limit, 3, 0),
fr: /* [3] Vérifier l'ABI - nécessaire seulement pour x86-64 si on utilise une liste d'interdictions. Utiliser BPF_JGT au lieu de vérifier par rapport au masque de bits pour ne pas devoir recharger le numéro d'appel système. */ BPF_JUMP(BPF_JMP | BPF_JGT | BPF_K, upper_nr_limit, 3, 0),

source: /* [4] Jump forward 1 instruction if system call number does not match \(aqsyscall_nr\(aq. */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),
fr: /* [4] Reculer d'une instruction si le numéro d'appel système ne correspond pas à \(aqsyscall_nr\(aq. */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),

source: /* [5] Matching architecture and system call: don\(aqt execute the system call, and return \(aqf_errno\(aq in \(aqerrno\(aq. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),
fr: /* [5] Architecture et appel système correspondants : ne pas exécuter l'appel système et renvoyer \(aqf_errno\(aq dans \(aqerrno\(aq. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),

source: /* [6] Destination of system call number mismatch: allow other system calls. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ALLOW),
fr: /* [6] Cible du numéro d’appel système inadéquate : autoriser d'autres appels système. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ALLOW),

source: /* [7] Destination of architecture mismatch: kill process. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL_PROCESS), };
fr: /* [7] Cible de l’architecture inadéquate : tuer le processus. */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL_PROCESS), };

source: SEE ALSO
fr: VOIR AUSSI

source: Various pages from the I<libseccomp> library, including: B<scmp_sys_resolver>(1), B<seccomp_export_bpf>(3), B<seccomp_init>(3), B<seccomp_load>(3), and B<seccomp_rule_add>(3).
fr: Plusieurs pages de la bibliothèque I<libseccomp>, dont : B<scmp_sys_resolver>(1), B<seccomp_export_bpf>(3), B<seccomp_init>(3), B<seccomp_load>(3) et B<seccomp_rule_add>(3).

source: The kernel source files I<Documentation/networking/filter.txt> and I<Documentation/userspace-api/seccomp_filter.rst> (or I<Documentation/prctl/seccomp_filter.txt> before Linux 4.13).
fr: Les fichiers I<Documentation/networking/filter.txt> et I<Documentation/userspace-api/seccomp_filter.rst> des sources du noyau (ou I<Documentation/prctl/seccomp_filter.txt> avant Linux 4.13).

source: McCanne, S.\& and Jacobson, V.\& (1992) I<The BSD Packet Filter: A New Architecture for User-level Packet Capture>, Proceedings of the USENIX Winter 1993 Conference E<.UR http://www.tcpdump.org/papers/bpf-usenix93.pdf> E<.UE>
fr: McCanne, S.\& et Jacobson, V.\& (1992) I<The BSD Packet Filter : une nouvelle architecture de captation de paquets au niveau utilisateur>, colloque de la conférence USENIX à l'hiver 1993 E<.UR http://www.tcpdump.org/papers/bpf-usenix93.pdf> E<.UE>

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: The only system calls that the calling thread is permitted to make are B<read>(2), B<write>(2), B<_exit>(2) (but not B<exit_group>(2)), and B<sigreturn>(2). Other system calls result in the delivery of a B<SIGKILL> signal. Strict secure computing mode is useful for number-crunching applications that may need to execute untrusted byte code, perhaps obtained by reading from a pipe or socket.
fr: Les seuls appels système que le thread appelant est autorisé à faire sont B<read>(2), B<write>(2), B<_exit>(2) (mais pas B<exit_group>(2)) et B<sigreturn>(2). Les autres appels système envoient un signal B<SIGKILL>. Le mode de calcul sécurisé strict est utile pour les applications fonctionnant à coups de chiffres qui peuvent avoir besoin d'exécuter un code à octets non fiable, obtenu peut-être en lisant un tube ou un socket.

source: The system calls allowed are defined by a pointer to a Berkeley Packet Filter (BPF) passed via I<args>. This argument is a pointer to a I<struct\ sock_fprog>; it can be designed to filter arbitrary system calls and system call arguments. If the filter is invalid, B<seccomp>() fails, returning B<EINVAL> in I<errno>.
fr: Les appels système autorisés sont définis par un pointeur vers un filtre Berkeley Packet (BPF) fourni à l'aide de I<args>. Ce paramètre est un pointeur vers une I<struct\ sock_fprog> ; il peut être conçu pour filtrer des appels système de votre choix ainsi que des paramètres d'appel système. Si le filtre n'est pas valable, B<seccomp>() échoue en renvoyant B<EINVAL> dans I<errno>.

source: The I<instruction_pointer> field provides the address of the machine-language instruction that performed the system call. This might be useful in conjunction with the use of I</proc/[pid]/maps> to perform checks based on which region (mapping) of the program made the system call. (Probably, it is wise to lock down the B<mmap>(2) and B<mprotect>(2) system calls to prevent the program from subverting such checks.)
fr: Le champ I<instruction_pointer> fournit l'adresse de l'instruction en langage machine qui a effectué l'appel système. Cela pourrait être utile avec I</proc/[pid]/maps> pour effectuer des vérifications à partir de la région (projection) du programme qui a fait l'appel système (il est probablement raisonnable de verrouiller les appels système B<mmap>(2) et B<mprotect>(2) pour empêcher le programme de contourner de telles vérifications).

source: On success, B<seccomp>() returns 0. On error, if B<SECCOMP_FILTER_FLAG_TSYNC> was used, the return value is the ID of the thread that caused the synchronization failure. (This ID is a kernel thread ID of the type returned by B<clone>(2) and B<gettid>(2).) On other errors, -1 is returned, and I<errno> is set to indicate the cause of the error.
fr: En cas de succès, B<seccomp>() renvoie B<0>. En cas d'erreur, si B<SECCOMP_FILTER_FLAG_TSYNC> était utilisé, le code de retour est l'identifiant du thread qui a fait échouer la synchronisation (il s'agit d'un identifiant de thread du noyau du type renvoyé par B<clone>(2) et B<gettid>(2)). Si d'autres erreurs se produisent, B<-1> est renvoyé et I<errno> est positionné pour indiquer la cause de l'erreur.

source: I<operation> included B<BPF_ABS>, but the specified offset was not aligned to a 32-bit boundary or exceeded I<sizeof(struct\ seccomp_data)>.
fr: L'I<operation> comprenait B<BPF_ABS>, mais la position indiquée n'était pas alignée sur une limite 32 bits ou elle dépassait I<sizeof(struct\ seccomp_data)>.

source: CONFORMING TO
fr: CONFORMITÉ

source: The I<Seccomp> field of the I</proc/[pid]/status> file provides a method of viewing the seccomp mode of a process; see B<proc>(5).
fr: Le champ I<Seccomp> du fichier I</proc/[pid]/status> offre une méthode de visualisation du mode seccomp du processus ; voir B<proc>(5).

source: /* Assume that AUDIT_ARCH_X86_64 means the normal x86-64 ABI (in the x32 ABI, all system calls have bit 30 set in the \(aqnr\(aq field, meaning the numbers are E<gt>= X32_SYSCALL_BIT) */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;
fr: /* Supposer qu'AUDIT_ARCH_X86_64 signifie l'ABI x86-64 normale (dans l'ABI x32, tous les appels système ont 30 bits positionnés dans le champ \(aqnr\(aq, ce qui veut dire que les numéros sont E<gt>= X32_SYSCALL_BIT) */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;

source: struct sock_filter filter[] = { /* [0] Load architecture from \(aqseccomp_data\(aq buffer into accumulator */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),
fr: struct sock_filter filter[] = { /* [0] Charger l'architecture depuis le tampon \(aqseccomp_data\(aq dans l'accumulateur */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),

source: /* [1] Jump forward 5 instructions if architecture does not match \(aqt_arch\(aq */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),
fr: /* [1] Revenir de 5 instructions si l'architecture ne correspond pas à \(aqt_arch\(aq */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),

source: /* [2] Load system call number from \(aqseccomp_data\(aq buffer into accumulator */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),
fr: /* [2] Charger le numéro d'appel système à partir du tampon \(aqseccomp_data\(aq dans l'accumulateur */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),

source: /* [4] Jump forward 1 instruction if system call number does not match \(aqsyscall_nr\(aq */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),
fr: /* [4] Revenir d'une instruction si le numéro d'appel système ne correspond pas à \(aqsyscall_nr\(aq */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),

source: /* [5] Matching architecture and system call: don\(aqt execute the system call, and return \(aqf_errno\(aq in \(aqerrno\(aq */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),
fr: /* [5] Architecture et appel système correspondants : ne pas exécuter l'appel système et renvoyer \(aqf_errno\(aq dans \(aqerrno\(aq */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),

source: /* [6] Destination of system call number mismatch: allow other system calls */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ALLOW),
fr: /* [6] Cible du numéro d'appel système inadéquate : autoriser d'autres appels système */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ALLOW),

source: /* [7] Destination of architecture mismatch: kill process */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL_PROCESS), };
fr: /* [7] Cible de l'architecture inadéquate : tuer le processus */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL_PROCESS), };

source: int main(int argc, char **argv) { if (argc E<lt> 5) { fprintf(stderr, "Usage: " "%s E<lt>syscall_nrE<gt> E<lt>archE<gt> E<lt>errnoE<gt> E<lt>progE<gt> [E<lt>argsE<gt>]\en" "Hint for E<lt>archE<gt>: AUDIT_ARCH_I386: 0x%X\en" " AUDIT_ARCH_X86_64: 0x%X\en" "\en", argv[0], AUDIT_ARCH_I386, AUDIT_ARCH_X86_64); exit(EXIT_FAILURE); }
fr: int main(int argc, char **argv) { if (argc E<lt> 5) { fprintf(stderr, "Utilisation : " "%s E<lt>syscall_nrE<gt> E<lt>archE<gt> E<lt>errnoE<gt> E<lt>progE<gt> [E<lt>argsE<gt>]\en" "Astuce pour E<lt>archE<gt>: AUDIT_ARCH_I386: 0x%X\en" " AUDIT_ARCH_X86_64: 0x%X\en" "\en", argv[0], AUDIT_ARCH_I386, AUDIT_ARCH_X86_64); exit(EXIT_FAILURE); }

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: In order to use the B<SECCOMP_SET_MODE_FILTER> operation, either the caller must have the B<CAP_SYS_ADMIN> capability in its user namespace, or the thread must already have the I<no_new_privs> bit set. If that bit was not already set by an ancestor of this thread, the thread must make the following call:
fr: Pour utiliser l'opération B<SECCOMP_SET_MODE_FILTER>, soit l'appelant doit avoir la capacité B<CAP_SYS_ADMIN> dans son espace de noms utilisateur, soit le thread doit déjà avoir positionné le bit I<no_new_privs>. Si ce bit n'a pas déjà été positionné par un ascendant du thread, celui-ci doit effectuer l'appel suivant :

source: It is strongly recommended to use a whitelisting approach whenever possible because such an approach is more robust and simple. A blacklist will have to be updated whenever a potentially dangerous system call is added (or a dangerous flag or option if those are blacklisted), and it is often possible to alter the representation of a value without altering its meaning, leading to a blacklist bypass. See also I<Caveats> below.
fr: Il est fortement recommandé d'utiliser une approche par liste blanche dès que possible, car une telle approche est plus robuste et simple. Une liste noire devra être mise à jour à chaque fois qu'un appel système potentiellement dangereux sera ajouté (ou une option ou un attribut dangereux, s'ils sont sur une liste noire), et il est souvent possible de modifier la représentation d'une valeur sans changer sa signification, conduisant à contourner la liste noire. Voir aussi les I<Mises en garde> ci-dessous.

source: This means that in order to create a seccomp-based blacklist for system calls performed through the x86-64 ABI, it is necessary to not only check that I<arch> equals B<AUDIT_ARCH_X86_64>, but also to explicitly reject all system calls that contain B<__X32_SYSCALL_BIT> in I<nr>.
fr: Cela veut dire que pour créer une liste noire pour des appels système effectués à l'aide de l'ABI x86-64 à partir de seccomp, il faut non seulement vérifier que I<arch> est égale à B<AUDIT_ARCH_X86_64>, mais aussi rejeter explicitement tous les appels système contenant B<__X32_SYSCALL_BIT> dans I<nr>.

source: When checking values from I<args> against a blacklist, keep in mind that arguments are often silently truncated before being processed, but after the seccomp check. For example, this happens if the i386 ABI is used on an x86-64 kernel: although the kernel will normally not look beyond the 32 lowest bits of the arguments, the values of the full 64-bit registers will be present in the seccomp data. A less surprising example is that if the x86-64 ABI is used to perform a system call that takes an argument of type I<int>, the more-significant half of the argument register is ignored by the system call, but visible in the seccomp data.
fr: Lors de la vérification des valeurs de I<args> par rapport à la liste noire, gardez en tête que les paramètres sont souvent tronqués silencieusement avant d'être traités mais après la vérification seccomp. Cela arrive par exemple si l'ABI i386 est utilisée sur un noyau x86-64 : bien que le noyau n'ira normalement pas regarder au-delà des 32 bits les plus faibles des paramètres, les valeurs des registres 64 bits complets seront présentes dans les données de seccomp. Un exemple moins surprenant est que si l'ABI x86-64 est utilisée pour effectuer un appel système prenant un paramètre de type I<int>, la moitié du registre du paramètre la plus significative est ignorée par l'appel système mais visible dans les données de seccomp.

source: EXAMPLE
fr: EXEMPLE

source: /* Assume that AUDIT_ARCH_X86_64 means the normal x86-64 ABI (in the x32 ABI, all system calls have bit 30 set in the 'nr' field, meaning the numbers are E<gt>= X32_SYSCALL_BIT) */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;
fr: /* Supposer qu'AUDIT_ARCH_X86_64 signifie l'ABI x86-64 normale (dans l'ABI x32, tous les appels système ont positionné 30 bits dans le champ « nr », ce qui veut dire que les numéros sont E<gt>= X32_SYSCALL_BIT) */ if (t_arch == AUDIT_ARCH_X86_64) upper_nr_limit = X32_SYSCALL_BIT - 1;

source: struct sock_filter filter[] = { /* [0] Load architecture from 'seccomp_data' buffer into accumulator */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),
fr: struct sock_filter filter[] = { /* [0] Charger l'architecture depuis le tampon « seccomp_data » dans l'accumulateur */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, arch))),

source: /* [1] Jump forward 5 instructions if architecture does not match 't_arch' */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),
fr: /* [1] Revenir de 5 instructions si l'architecture ne correspond pas à « t_arch » */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, t_arch, 0, 5),

source: /* [2] Load system call number from 'seccomp_data' buffer into accumulator */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),
fr: /* [2] Charger le numéro d'appel système depuis le tampon « seccomp_data » dans l'accumulateur */ BPF_STMT(BPF_LD | BPF_W | BPF_ABS, (offsetof(struct seccomp_data, nr))),

source: /* [3] Check ABI - only needed for x86-64 in blacklist use cases. Use BPF_JGT instead of checking against the bit mask to avoid having to reload the syscall number. */ BPF_JUMP(BPF_JMP | BPF_JGT | BPF_K, upper_nr_limit, 3, 0),
fr: /* [3] Vérifier l'ABI - uniquement nécessaire pour x86-64 si on utilise une liste noire. Utilisez BPF_JGT au lieu de vérifier par rapport au masque de bit pour ne pas devoir recharger le numéro d'appel système. */ BPF_JUMP(BPF_JMP | BPF_JGT | BPF_K, upper_nr_limit, 3, 0),

source: /* [4] Jump forward 1 instruction if system call number does not match 'syscall_nr' */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),
fr: /* [4] Revenir d'une instruction si le numéro d'appel système ne correspond pas à « syscall_nr » */ BPF_JUMP(BPF_JMP | BPF_JEQ | BPF_K, syscall_nr, 0, 1),

source: /* [5] Matching architecture and system call: don't execute the system call, and return 'f_errno' in 'errno' */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),
fr: /* [5] Architecture et numéro d'appel système trouvés : ne pas exécuter l'appel système et renvoyer « f_errno » dans « errno » */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_ERRNO | (f_errno & SECCOMP_RET_DATA)),

source: /* [7] Destination of architecture mismatch: kill task */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL), };
fr: /* [7] Cible de l'architecture inadéquate : tuer la tâche */ BPF_STMT(BPF_RET | BPF_K, SECCOMP_RET_KILL), };

source: Various pages from the I<libseccomp> library, including: B<scmp_sys_resolver>(1), B<seccomp_init>(3), B<seccomp_load>(3), B<seccomp_rule_add>(3), and B<seccomp_export_bpf>(3).
fr: Plusieurs pages de la bibliothèque I<libseccomp>, notamment : B<scmp_sys_resolver>(1), B<seccomp_init>(3), B<seccomp_load>(3), B<seccomp_rule_add>(3) et B<seccomp_export_bpf>(3).

source: McCanne, S. and Jacobson, V. (1992) I<The BSD Packet Filter: A New Architecture for User-level Packet Capture>, Proceedings of the USENIX Winter 1993 Conference E<.UR http://www.tcpdump.org/papers/bpf-usenix93.pdf> E<.UE>
fr: McCanne, S.\& et Jacobson, V.\& (1992) I<The BSD Packet Filter : une nouvelle architecture de captation de paquets au niveau utilisateur>, colloque de la conférence USENIX à l'hiver 1993 E<.UR http://www.tcpdump.org/papers/bpf-usenix93.pdf> E<.UE>

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
