Repository: sebras/manpages-l10n
Catalog: po/*/man2/set_mempolicy.2.po
Languages: fr

source: NAME
fr: NOM

source: set_mempolicy - set default NUMA memory policy for a thread and its children
fr: set_mempolicy - Configurer la politique de la mémoire NUMA par défaut pour un thread et ses enfants

source: B<set_mempolicy>() sets the NUMA memory policy of the calling thread, which consists of a policy mode and zero or more nodes, to the values specified by the I<mode>, I<nodemask>, and I<maxnode> arguments.
fr: B<set_mempolicy>() définit la politique de la mémoire NUMA du thread appelant, qui consiste en un mode de politique et zéro ou plusieurs nœuds, aux valeurs spécifiées dans les arguments I<mode>, I<nodemask> et I<maxnode>.

source: A NUMA machine has different memory controllers with different distances to specific CPUs. The memory policy defines from which node memory is allocated for the thread.
fr: Une machine NUMA a différents contrôleurs mémoire à différentes distances des processeurs particuliers. La politique de la mémoire définit le nœud à partir duquel la mémoire est allouée pour le thread.

source: This system call defines the default policy for the thread. The thread policy governs allocation of pages in the process's address space outside of memory ranges controlled by a more specific policy set by B<mbind>(2). The thread default policy also controls allocation of any pages for memory-mapped files mapped using the B<mmap>(2) call with the B<MAP_PRIVATE> flag and that are only read (loaded) from by the thread and of memory-mapped files mapped using the B<mmap>(2) call with the B<MAP_SHARED> flag, regardless of the access type. The policy is applied only when a new page is allocated for the thread. For anonymous memory this is when the page is first touched by the thread.
fr: Cet appel système définit la politique par défaut pour le thread. La politique de thread gouverne l'allocation de page dans l'espace adressable du processus en dehors des plages mémoire contrôlées par une politique plus spécifique définie par B<mbind>(2). La politique de thread par défaut contrôle également l'allocation de toute page pour les fichiers projetés en mémoire en utilisant l'appel système B<mmap>(2) avec l'attribut B<MAP_PRIVATE>, qui n’est lue (chargée) que par le thread, et pour les fichiers projetés en mémoire en utilisant l'appel B<mmap>(2) avec l'attribut B<MAP_SHARED>, quel que soit le type d'accès. La politique ne s'applique que lorsqu'une nouvelle page est allouée pour le thread. Pour la mémoire anonyme, cela est fait lorsque la page est modifiée pour la première fois par le thread.

source: The I<mode> argument must specify one of B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED>, or B<MPOL_LOCAL> (which are described in detail below). All modes except B<MPOL_DEFAULT> require the caller to specify the node or nodes to which the mode applies, via the I<nodemask> argument.
fr: Le paramètre I<mode> doit spécifier l'un des attributs parmi B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED> et B<MPOL_LOCAL> (qui sont décrits en détails ci-dessous). Toutes les modes de politique excepté B<MPOL_DEFAULT> nécessitent que l'appelant spécifie, dans le paramètre I<nodemask>, le ou les nœuds auxquels s'appliquent le mode.

source: The I<mode> argument may also include an optional I<mode flag>. The supported I<mode flags> are:
fr: L'argument I<mode> peut aussi contenir des attributs optionnels. Les valeurs possibles sont :

source: B<MPOL_F_NUMA_BALANCING> (since Linux 5.12)
fr: B<MPOL_F_NUMA_BALANCING> (depuis Linux 5.12)

source: When I<mode> is B<MPOL_BIND>, enable the kernel NUMA balancing for the task if it is supported by the kernel. If the flag isn't supported by the kernel, or is used with I<mode> other than B<MPOL_BIND>, -1 is returned and I<errno> is set to B<EINVAL>.
fr: Quand I<mode> est B<MPOL_BIND>, activer l’équilibrage NUMA du noyau pour la tâche s’il est géré par le noyau. Si l'attribut n'est pas pris en charge par le noyau ou est utilisé avec un autre I<mode> que B<MPOL_BIND>, B<-1> est renvoyé et I<errno> est positionné sur B<EINVAL>.

source: B<MPOL_F_RELATIVE_NODES> (since Linux 2.6.26)
fr: B<MPOL_F_RELATIVE_NODES> (depuis Linux 2.6.26)

source: A nonempty I<nodemask> specifies node IDs that are relative to the set of node IDs allowed by the process's current cpuset.
fr: Un paramètre I<nodemask> non vide indique les identifiants des nœuds relatifs à l'ensemble des identifiants de nœuds autorisés pour le contexte de l'ensemble de processeurs en cours pour le processus.

source: B<MPOL_F_STATIC_NODES> (since Linux 2.6.26)
fr: B<MPOL_F_STATIC_NODES> (depuis Linux 2.6.26)

source: A nonempty I<nodemask> specifies physical node IDs. Linux will not remap the I<nodemask> when the process moves to a different cpuset context, nor when the set of nodes allowed by the process's current cpuset context changes.
fr: Une valeur non vide de I<nodemask> indique des identifiants de nœuds physiques. Linux ne va pas recalculer le I<nodemask> quand le processus est déplacé vers un contexte de processeurs différent, ni quand l'ensemble des nœuds autorisés par le contexte du processus actuel est modifié.

source: I<nodemask> points to a bit mask of node IDs that contains up to I<maxnode> bits. The bit mask size is rounded to the next multiple of I<sizeof(unsigned long)>, but the kernel will use bits only up to I<maxnode>. A NULL value of I<nodemask> or a I<maxnode> value of zero specifies the empty set of nodes. If the value of I<maxnode> is zero, the I<nodemask> argument is ignored.
fr: I<nodemask> pointe vers un masque de bits d'identifiants de nœuds qui contient jusqu'à I<maxnode> bits. La taille du masque de bits est arrondie au multiple supérieur de I<sizeof(unsigned long)>, mais le noyau n'utilisera que jusqu'à I<maxnode> bits. Une valeur NULL pour I<nodemask> ou une valeur I<maxnode> de zéro indique un ensemble vide de nœuds. Si la valeur de I<maxnode> est zéro, l'argument I<nodemask> est ignoré.

source: Where a I<nodemask> is required, it must contain at least one node that is on-line, allowed by the process's current cpuset context, (unless the B<MPOL_F_STATIC_NODES> mode flag is specified), and contains memory. If the B<MPOL_F_STATIC_NODES> is set in I<mode> and a required I<nodemask> contains no nodes that are allowed by the process's current cpuset context, the memory policy reverts to I<local allocation>. This effectively overrides the specified policy until the process's cpuset context includes one or more of the nodes specified by I<nodemask>.
fr: Quand une valeur de I<nodemask> est nécessaire, elle doit contenir au moins un nœud actuellement disponible et autorisé par le contexte du processus actuel (à moins que l'attribut B<MPOL_F_STATIC_NODES> ne soit spécifié), et qui contient de la mémoire. Si l'attribut B<MPOL_F_STATIC_NODES> est mis dans I<mode> et si un I<nodemask> nécessaire ne contient aucun nœud autorisé par le contexte du processus actuel, la politique pour la mémoire est forcée à allocation locale (I<local allocation>). La politique sera réellement modifiée, sauf si le contexte du processus actuel contient au moins un des nœuds spécifiés par I<nodemask>.

source: The I<mode> argument must include one of the following values:
fr: L'argument I<mode> doit inclure une des valeurs suivantes :

source: This mode specifies that any nondefault thread memory policy be removed, so that the memory policy "falls back" to the system default policy. The system default policy is "local allocation"\(emthat is, allocate memory on the node of the CPU that triggered the allocation. I<nodemask> must be specified as NULL. If the "local node" contains no free memory, the system will attempt to allocate memory from a "near by" node.
fr: Ce mode indique que toute politique de mémoire du thread autre que celle par défaut doit être supprimée, afin que la politique de mémoire se « rabatte » sur la politique par défaut du système. La politique par défaut du système est « local allocation », c'est-à-dire allouer la mémoire sur le nœud du processeur qui a déclenché l'allocation. I<nodemask> doit être spécifié comme NULL. Si le «\ nœud local\ » ne contient pas de mémoire libre, le système tentera d'allouer de la mémoire à partir d'un nœud «\ à proximité\ ».

source: This mode defines a strict policy that restricts memory allocation to the nodes specified in I<nodemask>. If I<nodemask> specifies more than one node, page allocations will come from the node with the lowest numeric node ID first, until that node contains no free memory. Allocations will then come from the node with the next highest node ID specified in I<nodemask> and so forth, until none of the specified nodes contain free memory. Pages will not be allocated from any node not specified in the I<nodemask>.
fr: Ce mode définit une politique stricte qui restreint l'allocation mémoire aux nœuds spécifiés dans I<nodemask>. Si I<nodemask> indique plus d'un nœud, les allocations de pages se feront d'abord à partir du nœud dont l'identifiant numérique est le plus petit jusqu'à ce que ce nœud ne contienne plus de mémoire libre. Les allocations se feront ensuite à partir du nœud dont l'identifiant est le prochain plus grand spécifié dans I<nodemask> et ainsi de suite jusqu'à ce que plus un seul nœud indiqué ne contienne de mémoire libre. Il n'y aura pas d'allocation de pages à partir de nœuds non indiqués dans I<nodemask>.

source: This mode interleaves page allocations across the nodes specified in I<nodemask> in numeric node ID order. This optimizes for bandwidth instead of latency by spreading out pages and memory accesses to those pages across multiple nodes. However, accesses to a single page will still be limited to the memory bandwidth of a single node.
fr: Ce mode entrelace les allocations de pages à travers les nœuds spécifiés dans I<nodemask> dans l'ordre de l'identifiant numérique de nœud. Cela optimise la bande passante au lieu de la latence en étalant les accès pages et mémoires à ces pages à travers plusieurs nœuds. Toutefois, les accès à une seule page seront limités à la bande passante mémoire d'un seul nœud.

source: This mode sets the preferred node for allocation. The kernel will try to allocate pages from this node first and fall back to "near by" nodes if the preferred node is low on free memory. If I<nodemask> specifies more than one node ID, the first node in the mask will be selected as the preferred node. If the I<nodemask> and I<maxnode> arguments specify the empty set, then the policy specifies "local allocation" (like the system default policy discussed above).
fr: Ce mode définit le nœud préféré pour l'allocation. Le noyau essaiera d'allouer des pages d'abord à partir de ce nœud et se repliera sur des nœuds voisins s'il ne reste que peu de mémoire libre sur le nœud préféré. Si I<nodemask> spécifie plus d'un identifiant de nœud, le premier nœud du masque sera choisi comme le nœud préféré. Si les arguments I<nodemask> et I<maxnode> spécifient l'ensemble vide, la politique indique « local allocation » (comme la politique par défaut du système abordée ci-dessus).

source: B<MPOL_LOCAL> (since Linux 3.8)
fr: B<MPOL_LOCAL> (depuis Linux 3.8)

source: This mode specifies "local allocation"; the memory is allocated on the node of the CPU that triggered the allocation (the "local node"). The I<nodemask> and I<maxnode> arguments must specify the empty set. If the "local node" is low on free memory, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever memory for this node is available. If the "local node" is not allowed by the process's current cpuset context, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever it becomes allowed by the process's current cpuset context.
fr: Ce mode indique « local allocation » ; la mémoire est allouée sur le nœud du processeur qui a déclenché l'allocation (le « local node »). Les paramètres I<nodemask> et I<maxnode> doivent indiquer l'ensemble vide. Si le « local node » est faible en mémoire, le noyau essaiera d'allouer de la mémoire à partir d'autres nœuds. Le noyau allouera de la mémoire à partir du « local node » à chaque fois que de la mémoire dans ce nœud sera disponible. Si le « local node » n'est pas autorisé par le contexte de l’ensemble de processeurs actuel du processus, le noyau essaiera d'allouer de la mémoire à partir d'autres nœuds. Le noyau allouera de la mémoire à partir du « local node » à chaque fois que ce sera autorisé par le contexte de l’ensemble de processeurs actuel du processus.

source: The thread memory policy is preserved across an B<execve>(2), and is inherited by child threads created using B<fork>(2) or B<clone>(2).
fr: La politique mémoire de thread est préservée au travers d'un B<execve>(2) et est récupérée par les processus enfant créés avec B<fork>(2) ou B<clone>(2).

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<set_mempolicy>() returns 0; on error, -1 is returned and I<errno> is set to indicate the error.
fr: S'il réussit, B<set_mempolicy>() renvoie B<0>\ ; s'il échoue, il renvoie B<-1> et écrit I<errno> en conséquence.

source: ERRORS
fr: ERREURS

source: Part of all of the memory range specified by I<nodemask> and I<maxnode> points outside your accessible address space.
fr: Une partie de la plage mémoire spécifiée par I<nodemask> et I<maxnode> pointe en dehors de l’espace d'adressage accessible.

source: I<mode> is invalid. Or, I<mode> is B<MPOL_DEFAULT> and I<nodemask> is nonempty, or I<mode> is B<MPOL_BIND> or B<MPOL_INTERLEAVE> and I<nodemask> is empty. Or, I<maxnode> specifies more than a page worth of bits. Or, I<nodemask> specifies one or more node IDs that are greater than the maximum supported node ID. Or, none of the node IDs specified by I<nodemask> are on-line and allowed by the process's current cpuset context, or none of the specified nodes contain memory. Or, the I<mode> argument specified both B<MPOL_F_STATIC_NODES> and B<MPOL_F_RELATIVE_NODES>. Or, the B<MPOL_F_NUMA_BALANCING> isn't supported by the kernel, or is used with I<mode> other than B<MPOL_BIND>.
fr: I<mode> n'est pas valable. Soit I<mode> est B<MPOL_DEFAULT> et I<nodemask> n'est pas vide, soit I<mode> est B<MPOL_BIND> ou B<MPOL_INTERLEAVE> et I<nodemask> est vide. Ou bien I<maxnode> spécifie plus qu'une page de bits. Ou alors I<nodemask> spécifie un ou plusieurs identifiants de nœud qui sont plus grands que l'identifiant maximal de nœud pris en charge, ou qui ne sont pas autorisés dans le contexte de l’ensemble de processeurs actuel du processus, ou bien aucun des nœuds n'a de mémoire. Ou alors le paramètre I<mode> spécifie B<MPOL_F_STATIC_NODES> et B<MPOL_F_RELATIVE_NODES>. Ou alors le B<MPOL_F_NUMA_BALANCING> n'est pas pris en charge par le noyau ou est utilisé avec un autre I<mode> que B<MPOL_BIND>.

source: Insufficient kernel memory was available.
fr: La mémoire disponible du noyau n'était pas suffisante.

source: The B<set_mempolicy>() system call was added to the Linux kernel in version 2.6.7.
fr: L'appel système B<set_mempolicy>() a été ajouté au noyau Linux dans la version 2.6.7.

source: This system call is Linux-specific.
fr: Cet appel système est spécifique à Linux.

source: Memory policy is not remembered if the page is swapped out. When such a page is paged back in, it will use the policy of the thread or memory range that is in effect at the time the page is allocated.
fr: La politique de mémoire n'est pas mémorisée si la page est transférée. Lorsqu'une telle page est réimportée en mémoire, elle utilisera la politique du thread ou de la plage mémoire qui était effective au moment où la page est allouée.

source: For information on library support, see B<numa>(7).
fr: Pour des informations sur la prise en charge des bibliothèques, consultez B<numa>(7).

source: SEE ALSO
fr: VOIR AUSSI

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: Link with I<-lnuma>.
fr: Effectuez l'édition des liens avec l'option I<-lnuma>.

source: I<mode> is invalid. Or, I<mode> is B<MPOL_DEFAULT> and I<nodemask> is nonempty, or I<mode> is B<MPOL_BIND> or B<MPOL_INTERLEAVE> and I<nodemask> is empty. Or, I<maxnode> specifies more than a page worth of bits. Or, I<nodemask> specifies one or more node IDs that are greater than the maximum supported node ID. Or, none of the node IDs specified by I<nodemask> are on-line and allowed by the process's current cpuset context, or none of the specified nodes contain memory. Or, the I<mode> argument specified both B<MPOL_F_STATIC_NODES> and B<MPOL_F_RELATIVE_NODES>.
fr: I<mode> n'est pas valable. Ou, I<mode> est B<MPOL_DEFAULT> et I<nodemask> n'est pas vide, ou I<mode> est B<MPOL_BIND> ou B<MPOL_INTERLEAVE> et I<nodemask> est vide. Ou, I<maxnode> spécifie plus d'une page de bits. Ou, I<nodemask> spécifie un ou plusieurs identifiants de nœud qui sont plus grands que l'identifiant maximal de nœud pris en charge. Ou aucun des identifiants de nœuds spécifiés par I<nodemask> ne sont disponibles et autorisés par le contexte en cours d’ensemble de processeurs du processus ou aucun des nœuds spécifiés ne contient de mémoire. Ou l’argument I<mode> spécifie à la fois B<MPOL_F_STATIC_NODES> et B<MPOL_F_RELATIVE_NODES>.

source: CONFORMING TO
fr: CONFORMITÉ

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<set_mempolicy>() sets the NUMA memory policy of the calling thread, which consists of a policy mode and zero or more nodes, to the values specified by the I<mode>, I<nodemask> and I<maxnode> arguments.
fr: B<set_mempolicy>() définit la politique de la mémoire NUMA du thread appelant, qui consiste en un mode de politique et zéro ou plusieurs nœuds, aux valeurs spécifiées dans les arguments I<mode>, I<nodemask> et I<maxnode>.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
