Repository: sebras/manpages-l10n
Catalog: po/*/man2/setfsuid.2.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: setfsuid - set user identity used for filesystem checks
de: setfsuid - Benutzeridentität für Dateisystemprüfungen setzen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: On Linux, a process has both a filesystem user ID and an effective user ID. The (Linux-specific) filesystem user ID is used for permissions checking when accessing filesystem objects, while the effective user ID is used for various other kinds of permissions checks (see B<credentials>(7)).
de: Unter Linux hat ein Prozess sowohl eine Dateisystembenutzerkennung als auch eine effektive Benutzerkennung. Die (Linux-spezifische) Dateisystembenutzerkennung wird für die Berechtigungsprüfung beim Zugriff auf Dateisystemobjekte verwandt, während die effektive Benutzerkennung für verschiedene andere Arten von Berechtigungsprüfungen verwandt wird (siehe B<credentials>(7)).

source: Normally, the value of the process's filesystem user ID is the same as the value of its effective user ID. This is so, because whenever a process's effective user ID is changed, the kernel also changes the filesystem user ID to be the same as the new value of the effective user ID. A process can cause the value of its filesystem user ID to diverge from its effective user ID by using B<setfsuid>() to change its filesystem user ID to the value given in I<fsuid>.
de: Normalerweise ist der Wert der Dateisystembenutzerkennung des Prozesses identisch zu dem Wert seiner effektiven Benutzerkennung. Dies kommt daher, dass der Kernel auch die Dateisystembenutzerkennung zu dem gleichen Wert der effektiven Benutzerkennung ändert, wenn sich die effektive Benutzerkennung eines Prozesses ändert. Mittels B<setfsuid>() kann ein Prozess veranlassen, dass sich der Wert seiner Dateisystembenutzerkennung von dem Wert seiner effektiven Benutzerkennung unterscheidet, womit dieser den Wert der Dateisystembenutzerkennung auf den in I<fsuid> angegeben Wert ändert.

source: Explicit calls to B<setfsuid>() and B<setfsgid>(2) are (were) usually used only by programs such as the Linux NFS server that need to change what user and group ID is used for file access without a corresponding change in the real and effective user and group IDs. A change in the normal user IDs for a program such as the NFS server is (was) a security hole that can expose it to unwanted signals. (However, this issue is historical; see below.)
de: Explizite Aufrufe von B<setfsuid>() und B<setfsgid>(2) werden (wurden) gewöhnlich nur von Programmen wie dem Linux-NFS-Server benutzt. Sie müssen die für Dateizugriffe verwendete Benutzer- und Gruppenkennung ändern, ohne die reale oder effektive Gruppenkennung zu ändern. Eine Änderung der normalen Benutzerkennungen bei Programmen wie dem NFS-Server ist (war) eine Sicherheitslücke, die es unerwünschten Signalen aussetzen kann. (Allerdings ist dieses Problem historischer Natur, lesen Sie Nachstehendes.)

source: B<setfsuid>() will succeed only if the caller is the superuser or if I<fsuid> matches either the caller's real user ID, effective user ID, saved set-user-ID, or current filesystem user ID.
de: B<setfsuid>() wird nur erfolgreich sein, wenn der Aufrufende der Superuser ist oder wenn I<fsuid> entweder der realen, effektiven Benutzerkennung, der gesicherten SUID oder der aktuellen Dateisystembenutzerkennung entspricht.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On both success and failure, this call returns the previous filesystem user ID of the caller.
de: Sowohl im Fehler- als auch im Erfolgsfall wird dieser Aufruf die vorherige Dateisystembenutzerkennung des Aufrufenden zurückliefern.

source: VERSIONS
de: VERSIONEN

source: This system call is present in Linux since version 1.2.
de: Dieser Systemaufruf ist in Linux seit Version 1.2 vorhanden.

source: CONFORMING TO
de: KONFORM ZU

source: B<setfsuid>() is Linux-specific and should not be used in programs intended to be portable.
de: B<setfsuid> ist Linux-spezifisch und sollte nicht in portierbaren Programmen benutzt werden.

source: NOTES
de: ANMERKUNGEN

source: At the time when this system call was introduced, one process could send a signal to another process with the same effective user ID. This meant that if a privileged process changed its effective user ID for the purpose of file permission checking, then it could become vulnerable to receiving signals sent by another (unprivileged) process with the same user ID. The filesystem user ID attribute was thus added to allow a process to change its user ID for the purposes of file permission checking without at the same time becoming vulnerable to receiving unwanted signals. Since Linux 2.0, signal permission handling is different (see B<kill>(2)), with the result that a process can change its effective user ID without being vulnerable to receiving signals from unwanted processes. Thus, B<setfsuid>() is nowadays unneeded and should be avoided in new applications (likewise for B<setfsgid>(2)).
de: Zum Zeitpunkt, an dem dieser Systemaufruf erfolgte, konnte ein Prozess ein Signal an einen anderen Prozess mit der selben effektiven Benutzerkennung senden. Dies bedeutete, dass ein privilegierter Prozess, falls er zum Prüfen von Dateizugriffsrechten seine effektive Benutzerkennung änderte, in die Lage versetzt wurde, Signale von einem anderen (nicht privilegierten) Prozess mit der selben Kennung zu empfangen. Daher wurde das Benutzerkennungsatttribut des Dateisystems hinzugefügt, um einem Prozess das Ändern seiner Benutzerkennung zum Prüfen der Dateizugriffsrechte zu ermöglichen, ohne gleichzeitig sensibel für den Empfang unerwünschter Signale zu werden. Seit Linux 2.0 ist der Umgang mit Signalrechten anders gelöst (siehe B<kill>(2)), was dazu führt, dass ein Prozess seine effektive Benutzerkennung ändern kann, ohne empfänglich für Signale von unerwünschten Prozessen zu werden. Daher wird B<setfsuid>() heutzutage nicht mehr benötigt und sollte in neuen Anwendungen vermieden werden (ebenso B<setfsgid>(2)).

source: The original Linux B<setfsuid>() system call supported only 16-bit user IDs. Subsequently, Linux 2.4 added B<setfsuid32>() supporting 32-bit IDs. The glibc B<setfsuid>() wrapper function transparently deals with the variation across kernel versions.
de: Der Original-Linux-Systemaufruf B<setfsuid>() unterstützte nur 16-Bit-Benutzerkennungen. Nachfolgend fügte Linux 2.4 B<setfsuid32>() hinzu, das 32-Bit-Kennungen unterstützte. Die Glibc-Wrapper-Funktion B<setfsuid>() stellt die Änderungen transparent über Kernel-Versionen hinweg bereit.

source: C library/kernel differences
de: Unterschiede C-Bibliothek/Kernel

source: In glibc 2.15 and earlier, when the wrapper for this system call determines that the argument can't be passed to the kernel without integer truncation (because the kernel is old and does not support 32-bit user IDs), it will return -1 and set I<errno> to B<EINVAL> without attempting the system call.
de: Wenn der Wrapper für diesen Systemaufruf unter Glibc 2.15 und älter feststellt, dass das Argument nicht ohne Ganzzahlschnitt an den Kernel übergeben werden kann (weil der Kernel alt ist und keine 32-Bit-Benutzerkennungen unterstützt), wird -1 zurückgegeben und I<errno> auf B<EINVAL> gesetzt. Der Systemaufruf unterbleibt.

source: BUGS
de: FEHLER

source: No error indications of any kind are returned to the caller, and the fact that both successful and unsuccessful calls return the same value makes it impossible to directly determine whether the call succeeded or failed. Instead, the caller must resort to looking at the return value from a further call such as I<setfsuid(-1)> (which will always fail), in order to determine if a preceding call to B<setfsuid>() changed the filesystem user ID. At the very least, B<EPERM> should be returned when the call fails (because the caller lacks the B<CAP_SETUID> capability).
de: Es werden keine Anhaltspunkte für Fehler an den Aufrufenden zurückgegeben und die Tatsache, dass sowohl erfolgreiche als auch nicht erfolgreiche Aufrufe den selben Wert zurückgeben, macht es unmöglich, direkt zu bestimmen, ob der Aufruf erfolgreich war oder fehlschlug. Stattdessen musste der Aufrufende auf die Betrachtung des Rückgabewerts eines weiteren Prozesses wie I<setfsuid(-1)> zurückgreifen (der immer fehlschlägt), um zu bestimmen, ob ein vorheriger Aufruf von B<setfsuid>() die Dateisystembenutzerkennung geändert hat. Zumindest sollte B<EPERM> zurückgegeben werden, wenn der Aufruf fehlschlägt (da dem Aufrufenden die B<CAP_SETUID>-Capability fehlt).

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: The system call B<setfsuid>() changes the value of the caller's filesystem user ID\(emthe user ID that the Linux kernel uses to check for all accesses to the filesystem. Normally, the value of the filesystem user ID will shadow the value of the effective user ID. In fact, whenever the effective user ID is changed, the filesystem user ID will also be changed to the new value of the effective user ID.
de: Der Systemaufruf B<setfsuid>() ändert den Wert der Dateisystembenutzerkennung des Aufrufenden – der Benutzerkennung, die der Linux-Kernel zum Prüfen aller Zugriffe auf das Dateisystem benutzt. Normalerweise stimmt der Wert der Benutzerkennung des Dateisystems mit der effektiven Benutzerkennung überein. Jedenfalls wird immer, wenn die effektive Benutzerkennung geändert wird, auch die Benutzerkennung des Dateisystems auf den neuen Wert der effektiven Benutzerkennung geändert.

source: Explicit calls to B<setfsuid>() and B<setfsgid>(2) are usually used only by programs such as the Linux NFS server that need to change what user and group ID is used for file access without a corresponding change in the real and effective user and group IDs. A change in the normal user IDs for a program such as the NFS server is a security hole that can expose it to unwanted signals. (But see below.)
de: Explizite Aufrufe von B<setfsuid>() und B<setfsgid>(2) werden gewöhnlich nur von Programmen wie dem Linux-NFS-Server benutzt. Sie müssen die für Dateizugriffe verwendeten Benutzer- und Gruppenkennungen ändern, ohne die realen oder effektiven Benutzer- und Gruppenkennungen zu ändern. Eine Änderung der normalen Benutzerkennungen bei Programmen wie dem NFS-Server ist eine Sicherheitslücke, die es unerwünschten Signalen aussetzen kann. Lesen Sie Nachstehendes.)

source: At the time when this system call was introduced, one process could send a signal to another process with the same effective user ID. This meant that if a privileged process changed its effective user ID for the purpose of file permission checking, then it could become vulnerable to receiving signals sent by another (unprivileged) process with the same user ID. The filesystem user ID attribute was thus added to allow a process to change its user ID for the purposes of file permission checking without at the same time becoming vulnerable to receiving unwanted signals. Since Linux 2.0, signal permission handling is different (see B<kill>(2)), with the result that a process change can change its effective user ID without being vulnerable to receiving signals from unwanted processes. Thus, B<setfsuid>() is nowadays unneeded and should be avoided in new applications (likewise for B<setfsgid>(2)).
de: Zum Zeitpunkt, an dem dieser Systemaufruf erfolgte, konnte ein Prozess ein Signal an einen anderen Prozess mit der selben effektiven Benutzerkennung senden. Dies bedeutete, dass ein privilegierter Prozess, falls er zum Prüfen von Dateizugriffsrechten seine effektive Benutzerkennung änderte, in die Lage versetzt wurde, Signale von einem anderen (nicht privilegierten) Prozess mit der selben Kennung zu empfangen. Daher wurde das Benutzerkennungsatttribut des Dateisystems hinzugefügt, um einem Prozess das Ändern seiner Benutzerkennung zum Prüfen der Dateizugriffsrechte zu ermöglichen, ohne gleichzeitig sensibel für den Empfang unerwünschter Signale zu werden. Seit Linux 2.0 ist der Umgang mit Signalrechten anders gelöst (siehe B<kill>(2)), was dazu führt, dass ein Prozess seine effektive Benutzerkennung ändern kann, ohne empfänglich für Signale von unerwünschten Prozessen zu werden. Daher wird B<setfsuid>() heutzutage nicht mehr benötigt und sollte in neuen Anwendungen vermieden werden (ebenso B<setfsgid>(2)).

source: In glibc 2.15 and earlier, when the wrapper for this system call determines that the argument can't be passed to the kernel without integer truncation (because the kernel is old and does not support 32-bit user IDs), they will return -1 and set I<errno> to B<EINVAL> without attempting the system call.
de: Wenn der Wrapper für diesen Systemaufruf unter Glibc 2.15 und älter feststellt, dass das Argument nicht ohne Ganzzahlschnitt an den Kernel übergeben werden kann (weil der Kernel alt ist und keine 32-Bit-Benutzerkennungen unterstützt), wird -1 zurückgegeben und I<errno> auf B<EINVAL> gesetzt. Der Systemaufruf unterbleibt.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
