Repository: sebras/manpages-l10n
Catalog: po/*/man2/shmget.2.po
Languages: de

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG

source: shmget - allocates a System V shared memory segment
de: shmget - ein gemeinsames System-V-Speichersegment reservieren

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT

source: B<int shmget(key_t >I<key>B<, size_t >I<size>B<, int >I<shmflg>B<);>
de: B<int shmget(key_t >I<Schlüssel>B<, size_t >I<Größe>B<, int >I<shmflg>B<);>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<shmget>() returns the identifier of the System\ V shared memory segment associated with the value of the argument I<key>. It may be used either to obtain the identifier of a previously created shared memory segment (when I<shmflg> is zero and I<key> does not have the value B<IPC_PRIVATE>), or to create a new set.
de: B<shmget>() gibt den Bezeichner des gemeinsamen System-V-Speichersegments zurück, der mit dem Wert des Arguments I<Schlüssel> verknüpft ist. Es kann entweder dazu verwandt werden, den Bezeichner eines vorher erstellten gemeinsamen Speichersegments zu erhalten (wenn I<shmflg> Null ist und I<Schlüssel> nicht den Wert B<IPC_PRIVATE> hat) oder um eine neue Gruppe zu erstellen.

source: A new shared memory segment, with size equal to the value of I<size> rounded up to a multiple of B<PAGE_SIZE>, is created if I<key> has the value B<IPC_PRIVATE> or I<key> isn't B<IPC_PRIVATE>, no shared memory segment corresponding to I<key> exists, and B<IPC_CREAT> is specified in I<shmflg>.
de: Es wird ein neues gemeinsames Speichersegment erstellt, dessen Größe dem auf ein Vielfaches von B<PAGE_SIZE> gerundeten Wert von I<Größe> entspricht, falls I<Schlüssel> den Wert B<IPC_PRIVATE> hat oder I<Schlüssel> nicht den Wert B<IPC_PRIVATE> hat, kein gemeinsames Speichersegment zu I<Schlüssel> existiert und B<IPC_CREAT> in I<shmflg> angegeben wurde.

source: If I<shmflg> specifies both B<IPC_CREAT> and B<IPC_EXCL> and a shared memory segment already exists for I<key>, then B<shmget>() fails with I<errno> set to B<EEXIST>. (This is analogous to the effect of the combination B<O_CREAT | O_EXCL> for B<open>(2).)
de: Wenn I<shmflg> sowohl B<IPC_CREAT> als auch B<IPC_EXCL> angibt und ein gemeinsames Speichersegment für I<Schlüssel> bereits existiert, dann schlägt B<shmget>() fehl und I<errno> wird auf B<EEXIST> gesetzt. (Dies ist mit dem Effekt der Kombination von B<O_CREAT | O_EXCL> für B<open>(2) vergleichbar.)

source: The value I<shmflg> is composed of:
de: Der Wert I<shmflg> besteht aus:

source: Create a new segment. If this flag is not used, then B<shmget>() will find the segment associated with I<key> and check to see if the user has permission to access the segment.
de: Erstellung eines neuen Segments. Wenn dieser Schalter nicht benutzt wird, dann wird B<shmget>() das mit I<Schlüssel> verbundene Segment suchen und prüfen, ob der Benutzer auf das Segment zugreifen darf.

source: This flag is used with B<IPC_CREAT> to ensure that this call creates the segment. If the segment already exists, the call fails.
de: Dieser Schalter wird mit B<IPC_CREAT> verwendet, um sucherzustellen, dass dieser Aufruf das Segment erzeugt. Falls das Segment bereits existiert, schlägt der Aufruf fehl.

source: B<SHM_HUGETLB> (since Linux 2.6)
de: B<SHM_HUGETLB> (seit Linux 2.6)

source: Allocate the segment using "huge" pages. See the Linux kernel source file I<Documentation/admin-guide/mm/hugetlbpage.rst> for further information.
de: Das Segment unter Benutzung von »großen« Speicherseiten reservieren. Die Linux-Kernel-Quelldatei I<Documentation/admin-guide/mm/hugetlbpage.rst> enthält weitere Informationen.

source: B<SHM_HUGE_2MB>, B<SHM_HUGE_1GB> (since Linux 3.8)
de: B<SHM_HUGE_2MB>, B<SHM_HUGE_1GB> (seit Linux 3.8)

source: Used in conjunction with B<SHM_HUGETLB> to select alternative hugetlb page sizes (respectively, 2\ MB and 1\ GB) on systems that support multiple hugetlb page sizes.
de: wird zusammen mit B<SHM_HUGETLB> verwendet, um alternative Hugetlb-Seitengrößen (2\ MB bzw. 1\ GB) auf Systemen auszuwählen, die mehrere Hugetlb-Seitengrößen unterstützen.

source: More generally, the desired huge page size can be configured by encoding the base-2 logarithm of the desired page size in the six bits at the offset B<SHM_HUGE_SHIFT>. Thus, the above two constants are defined as:
de: Allgemeiner ausgedrückt, kann die gewünschte Größe großer Speicherseiten durch Kodieren des Logarithmus zur Basis 2 der gewünschten Seitengröße in den ersten sechs Bit versetzt am Versatz B<SHM_HUGE_SHIFT> konfiguriert werden. Daher sind die beiden Konstanten oberhalb wie folgt definiert:

source: For some additional details, see the discussion of the similarly named constants in B<mmap>(2).
de: Für einige zusätzliche Details sehen Sie die Diskussion der ähnlich benannten Konstanten in B<mmap>(2).

source: B<SHM_NORESERVE> (since Linux 2.6.15)
de: B<SHM_NORESERVE> (seit Linux 2.6.15)

source: This flag serves the same purpose as the B<mmap>(2) B<MAP_NORESERVE> flag. Do not reserve swap space for this segment. When swap space is reserved, one has the guarantee that it is possible to modify the segment. When swap space is not reserved one might get B<SIGSEGV> upon a write if no physical memory is available. See also the discussion of the file I</proc/sys/vm/overcommit_memory> in B<proc>(5).
de: Dieser Schalter dient dem gleichen Zweck wie der B<mmap>(2)-Schalter B<MAP_NORESERVE>. Reserviert keinen Auslagerungsspeicher für dieses Segment. Wenn Auslagerungsspeicher reserviert ist, ist es sicher, dass das Segment verändert werden kann. Wenn kein Auslagerungsspeicher reserviert ist, könnte B<SIGSEGV> beim Schreiben empfangen werden, falls kein physischer Speicher verfügbar ist. Siehe auch die Diskussion der Datei I</proc/sys/vm/overcommit_memory> in B<proc>(5).

source: In addition to the above flags, the least significant 9 bits of I<shmflg> specify the permissions granted to the owner, group, and others. These bits have the same format, and the same meaning, as the I<mode> argument of B<open>(2). Presently, execute permissions are not used by the system.
de: Zusätzlich zu den oben genannten Schaltern geben die niederwertigsten neun Bits von I<shmflg> die Rechte des Besitzers, der Gruppe und dem Rest der Welt an. Diese Bits haben dasselbe Format und dieselbe Bedeutung wie das Argument I<mode> von B<open>(2). Zurzeit werden die Ausführungsrechte nicht vom System benutzt.

source: When a new shared memory segment is created, its contents are initialized to zero values, and its associated data structure, I<shmid_ds> (see B<shmctl>(2)), is initialized as follows:
de: Wenn ein neues gemeinsames Speichersegment erstellt wird, wird sein Inhalt mit Nullwerten initialisiert und die damit verbundene Datenstruktur I<shmid_ds> (siehe B<shmctl>(2)) wie folgt initialisiert:

source: I<shm_perm.cuid> and I<shm_perm.uid> are set to the effective user ID of the calling process.
de: B<shm_perm.cuid> und B<shm_perm.uid> werden auf die effektive Benutzerkennung des aufrufenden Prozesses gesetzt.

source: I<shm_perm.cgid> and I<shm_perm.gid> are set to the effective group ID of the calling process.
de: B<shm_perm.cgid> und B<shm_perm.gid> werden auf die effektive Gruppenkennung des aufrufenden Prozesses gesetzt.

source: The least significant 9 bits of I<shm_perm.mode> are set to the least significant 9 bit of I<shmflg>.
de: Die niederwertigsten 9 Bit von B<shm_perm.mode> werden auf die niederwertigsten 9 Bit von I<shmflg> gesetzt.

source: I<shm_segsz> is set to the value of I<size>.
de: B<shm_segsz> wird auf den Wert von I<Größe> gesetzt.

source: I<shm_lpid>, I<shm_nattch>, I<shm_atime>, and I<shm_dtime> are set to 0.
de: B<shm_lpid>, B<shm_nattch>, B<shm_atime> und B<shm_dtime> werden auf 0 gesetzt.

source: I<shm_ctime> is set to the current time.
de: I<shm_ctime> wird auf die aktuelle Zeit gesetzt.

source: If the shared memory segment already exists, the permissions are verified, and a check is made to see if it is marked for destruction.
de: Wenn das gemeinsame Speichersegment bereits existiert, werden die Zugriffsrechte überprüft und nachgesehen, ob es für die Freigabe markiert wurde.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, a valid shared memory identifier is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
de: Bei Erfolg wird ein gültiger Bezeichner für gemeinsam benutzten Speicher zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.

source: ERRORS
de: FEHLER

source: The user does not have permission to access the shared memory segment, and does not have the B<CAP_IPC_OWNER> capability in the user namespace that governs its IPC namespace.
de: Der Benutzer hat keine Zugriffsrechte auf das gemeinsame Speichersegment und keine B<CAP_IPC_OWNER>-Capability in dem Benutzernamensraum, der seinen IPC-Namensraum beherrscht.

source: B<IPC_CREAT> and B<IPC_EXCL> were specified in I<shmflg>, but a shared memory segment already exists for I<key>.
de: B<IPC_CREAT> und B<IPC_EXCL> wurden in I<shmflg> angegeben, aber für I<Schlüssel> existiert bereits ein gemeinsam benutztes Speichersegment.

source: A new segment was to be created and I<size> is less than B<SHMMIN> or greater than B<SHMMAX>.
de: Es wurde ein neues Segment erstellt und I<Größe> ist kleiner als B<SHMMIN> oder größer als B<SHMMAX>.

source: A segment for the given I<key> exists, but I<size> is greater than the size of that segment.
de: Es existiert ein Segment für den angegebenen I<Schlüssel>, aber I<Größe> ist größer als die Größe dieses Segments.

source: The system-wide limit on the total number of open files has been reached.
de: Die systemweite Beschränkung für die Gesamtzahl offener Dateien wurde erreicht.

source: No segment exists for the given I<key>, and B<IPC_CREAT> was not specified.
de: Für den angegebenen I<Schlüssel> existiert kein Segment und B<IPC_CREAT> wurde nicht angegeben.

source: No memory could be allocated for segment overhead.
de: Es konnte kein Speicher für Segment-Zuschlag reserviert werden.

source: All possible shared memory IDs have been taken (B<SHMMNI>), or allocating a segment of the requested I<size> would cause the system to exceed the system-wide limit on shared memory (B<SHMALL>).
de: Alle möglichen gemeinsamen Speicherkennungen wurden in Anspruch genommen (B<SHMMNI>) oder das Reservieren eines Segments der Größe I<Größe> würde dazu führen, dass die systemweite Begrenzung für gemeinsamen Speicher (B<SHMALL>) überschritten wird.

source: The B<SHM_HUGETLB> flag was specified, but the caller was not privileged (did not have the B<CAP_IPC_LOCK> capability) and is not a member of the I<sysctl_hugetlb_shm_group> group; see the description of I</proc/sys/vm/sysctl_hugetlb_shm_group> in B<proc>(5).
de: Der Schalter B<SHM_HUGETLB> wurde angegeben, der Aufrufende war aber nicht privilegiert (hatte nicht die Capability B<CAP_IPC_LOCK>) und ist auch kein Mitglied der Gruppe I<sysctl_hugetlb_shm_group>; siehe die Beschreibung von I</proc/sys/vm/sysctl_hugetlb_shm_group> in B<proc>(5).

source: B<SHM_HUGETLB> and B<SHM_NORESERVE> are Linux extensions.
de: B<SHM_HUGETLB> und B<SHM_NORESERVE> sind Linux-Erweiterungen.

source: NOTES
de: ANMERKUNGEN

source: B<IPC_PRIVATE> isn't a flag field but a I<key_t> type. If this special value is used for I<key>, the system call ignores all but the least significant 9 bits of I<shmflg> and creates a new shared memory segment.
de: B<IPC_PRIVATE> ist kein Schalterfeld, aber ein B<key_t>-Typ. Wenn dieser spezielle Wert für I<schalter> verwandt wird, ignoriert der Systemaufruf alles bis auf die niederwertigsten 9 Bit von I<shmflg> und erstellt ein neues gemeinsames Speichersegment.

source: Shared memory limits
de: Beschränkungen des gemeinsam genutzten Speichers

source: The following limits on shared memory segment resources affect the B<shmget>() call:
de: Es gelten die folgenden Einschränkungen für die Ressourcen gemeinsamer Speichersegmente, die einen B<shmget>()-Aufruf betreffen:

source: System-wide limit on the total amount of shared memory, measured in units of the system page size.
de: systemweite Beschränkung des Gesamtbetrags gemeinsam genutzten Speichers, gemessen in Einheiten der Seitengröße des Systems

source: On Linux, this limit can be read and modified via I</proc/sys/kernel/shmall>. Since Linux 3.16, the default value for this limit is:
de: Unter Linux kann diese Beschränkung über I</proc/sys/kernel/shmall> ermittelt und verändert werden. Seit Linux 3.16 ist der voreingestellte Wert für diese Beschränkung:

source: The effect of this value (which is suitable for both 32-bit and 64-bit systems) is to impose no limitation on allocations. This value, rather than B<ULONG_MAX>, was chosen as the default to prevent some cases where historical applications simply raised the existing limit without first checking its current value. Such applications would cause the value to overflow if the limit was set at B<ULONG_MAX>.
de: Dieser Wert (der sowohl auf 32- als auch auf 64-Bit-Systeme anwendbar ist) bewirkt, dass bei Speicherreservierungen keine Beschränkungen zum Zug kommen. Dieser Wert wurde anstelle von B<ULONG_MAX> als Voreinstellung gewählt, um Fälle zu vermeiden, in denen historische Anwendungen einfach die bestehende Beschränkung erhöht haben, ohne zuerst ihren aktuellen Wert zu prüfen. Derartige Anwendungen würden den Wert zum Überlaufen bringen, falls die Beschränkung auf B<ULONG_MAX> gesetzt wäre.

source: From Linux 2.4 up to Linux 3.15, the default value for this limit was:
de: Von Linux 2.4 bis 3.15 war der voreingestellte Wert für diese Beschränkung:

source: If B<SHMMAX> and B<SHMMNI> were not modified, then multiplying the result of this formula by the page size (to get a value in bytes) yielded a value of 8\ GB as the limit on the total memory used by all shared memory segments.
de: Falls B<SHMMAX> und B<SHMMNI> nicht verändert wurden, dann wird das Ergebnis dieser Formel mit der Seitengröße multipliziert (um einen Wert in Byte zu erhalten). Dies ergibt einen Wert von 8\ GB als Beschränkung des gesamten von allen gemeinsamen Speichersegmenten benutzten Speichers.

source: Maximum size in bytes for a shared memory segment.
de: maximale Größe in Byte für ein gemeinsames Speichersegment

source: On Linux, this limit can be read and modified via I</proc/sys/kernel/shmmax>. Since Linux 3.16, the default value for this limit is:
de: Unter Linux kann diese Einschränkung über I</proc/sys/kernel/shmmax> verändert werden. Seit Linux 3.16 ist der voreingestellte Wert für diese Beschränkung:

source: The effect of this value (which is suitable for both 32-bit and 64-bit systems) is to impose no limitation on allocations. See the description of B<SHMALL> for a discussion of why this default value (rather than B<ULONG_MAX>) is used.
de: Dieser Wert (der sowohl auf 32- als auch auf 64-Bit-Systeme anwendbar ist) bewirkt, dass bei Speicherreservierungen keine Beschränkungen zum Zug kommen. Lesen Sie die Beschreibung von B<SHMALL>, wenn Sie erfahren möchten, warum dieser Wert (anstelle von B<ULONG_MAX>) als Voreinstellung verwendet wird.

source: From Linux 2.2 up to Linux 3.15, the default value of this limit was 0x2000000 (32\ MB).
de: Von Linux 2.2 bis 3.15 war der voreingestellte Wert dieser Beschränkung 0x2000000 (32\ MB).

source: Because it is not possible to map just part of a shared memory segment, the amount of virtual memory places another limit on the maximum size of a usable segment: for example, on i386 the largest segments that can be mapped have a size of around 2.8\ GB, and on x86-64 the limit is around 127 TB.
de: Da es nicht möglich ist, nur einen Teil eines gemeinsamen Speichersegments zu mappen, setzt der Betrag des virtuellen Speichers eine weitere Beschränkung der maximalen Größe eines benutzbaren Segments: Zum Beispiel können auf i386 die größten Segmente, die gemappt werden können, eine Größe um 2,8\ GB haben. Auf x86_64 liegt die Beschränkung bei etwa 127 TB.

source: Minimum size in bytes for a shared memory segment: implementation dependent (currently 1 byte, though B<PAGE_SIZE> is the effective minimum size).
de: Minimalgröße eines gemeinsamen Speichersegments in Byte: abhängig vom der Implementierung (momentan 1 Byte, obwohl B<PAGE_SIZE> die effektive Minimalgröße darstellt).

source: System-wide limit on the number of shared memory segments. In Linux 2.2, the default value for this limit was 128; since Linux 2.4, the default value is 4096.
de: systemweite Beschränkung der Anzahl gemeinsam benutzter Speichersegmente. Unter Linux 2.2 war der Vorgabewert für diese Einschränkung 128, seit Linux 2.4 ist er 4096.

source: On Linux, this limit can be read and modified via I</proc/sys/kernel/shmmni>.
de: Unter Linux kann diese Einschränkung über I</proc/sys/kernel/shmmni> gelesen und verändert werden.

source: The implementation has no specific limits for the per-process maximum number of shared memory segments (B<SHMSEG>).
de: Die Implementierung hat keine besonderen Einschränkungen für die maximale Anzahl gemeinsamer Speichersegmente pro Prozess (B<SHMSEG>).

source: Linux notes
de: Linux-Anmerkungen

source: Until version 2.3.30, Linux would return B<EIDRM> for a B<shmget>() on a shared memory segment scheduled for deletion.
de: Bis Version 2.3.30 gab Linux B<EIDRM> für ein B<shmget>() auf einem gemeinsamen Speichersegment zurück, das zur Löschung vorgesehen war.

source: BUGS
de: FEHLER

source: The name choice B<IPC_PRIVATE> was perhaps unfortunate, B<IPC_NEW> would more clearly show its function.
de: Die Namenswahl B<IPC_PRIVATE> war vielleicht unglücklich, B<IPC_NEW> würde seine Funktion deutlicher anzeigen.

source: EXAMPLES
de: BEISPIELE

source: See B<shmop>(2).
de: Siehe B<shmop>(2).

source: SEE ALSO
de: SIEHE AUCH

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: B<int shmget(key_t >I<key>B<, size_t >I<size>B<, int >I<shmflg>B<);>
de: B<int shmget(key_t >I<Schlüssel>B<, size_t >I<Größe>B<, int >I<shmflg>B<);>

source: Allocate the segment using "huge pages." See the Linux kernel source file I<Documentation/admin-guide/mm/hugetlbpage.rst> for further information.
de: Das Segment unter Benutzung von »großer Speicherseiten« reservieren. Die Linux-Kernel-Quelldatei I<Documentation/admin-guide/mm/hugetlbpage.rst> enthält weitere Informationen.

source: On failure, I<errno> is set to one of the following:
de: Bei Fehlschlag wird I<errno> auf eines der Folgenden gesetzt:

source: The B<SHM_HUGETLB> flag was specified, but the caller was not privileged (did not have the B<CAP_IPC_LOCK> capability).
de: Der Schalter B<SHM_HUGETLB> wurde angegeben, der Aufrufende war aber nicht privilegiert (hatte nicht die Capability B<CAP_IPC_LOCK>).

source: CONFORMING TO
de: KONFORM ZU

source: The inclusion of I<E<lt>sys/types.hE<gt>> and I<E<lt>sys/ipc.hE<gt>> isn't required on Linux or by any version of POSIX. However, some old implementations required the inclusion of these header files, and the SVID also documented their inclusion. Applications intended to be portable to such old systems may need to include these header files.
de: Unter Linux und allen Versionen von POSIX ist die Einbindung von I<E<lt>sys/types.hE<gt>> und I<E<lt>sys/ipc.hE<gt>> nicht notwendig. Allerdings benötigten einige alte Implementierungen die Einbindung dieser Header-Dateien und SVID dokumentierte auch ihre Einbindung. Anwendungen, die auf solche alten Systeme portierbar sein müssen, könnten die Einbindung dieser Header-Dateien benötigen.

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: Allocate the segment using "huge pages." See the Linux kernel source file I<Documentation/vm/hugetlbpage.txt> for further information.
de: Das Segment unter Benutzung von »großer Speicherseiten« reservieren. Die Linux-Kernel-Quelldatei I<Documentation/vm/hugetlbpage.txt> enthält weitere Informationen.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
