Repository: sebras/manpages-l10n
Catalog: po/*/man2/sigaltstack.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: sigaltstack - set and/or get signal stack context
fr: sigaltstack - Consulter ou définir la pile de signal

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
fr: Exigences de macros de test de fonctionnalités pour la glibc (consulter B<feature_test_macros>(7)) :

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE
fr: _XOPEN_SOURCE E<gt>= 500 || /* Depuis la glibc 2.12 : */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc E<lt>= 2.19 : */ _BSD_SOURCE

source: B<sigaltstack>() allows a thread to define a new alternate signal stack and/or retrieve the state of an existing alternate signal stack. An alternate signal stack is used during the execution of a signal handler if the establishment of that handler (see B<sigaction>(2)) requested it.
fr: B<sigaltstack>() permet à un thread de définir une nouvelle pile spécifique pour les gestionnaires de signaux et/ou de récupérer l'état d'une pile spécifique de signal déjà existante. Une pile spécifique de signal est utilisée durant l'exécution d'un gestionnaire de signal si la mise en place de ce gestionnaire (consultez B<sigaction>(2)) le spécifiait.

source: The normal sequence of events for using an alternate signal stack is the following:
fr: La séquence d'actions nominale pour utiliser une pile spécifique de signal est la suivante\ :

source: Allocate an area of memory to be used for the alternate signal stack.
fr: Allouer une zone mémoire qui sera utilisée comme pile spécifique de signal.

source: Use B<sigaltstack>() to inform the system of the existence and location of the alternate signal stack.
fr: Utiliser B<sigaltstack>() afin d'informer le système de l'existence et de la position de la pile spécifique de signal.

source: When establishing a signal handler using B<sigaction>(2), inform the system that the signal handler should be executed on the alternate signal stack by specifying the B<SA_ONSTACK> flag.
fr: Lors de la mise en place du gestionnaire de signal en utilisant B<sigaction>(2), informer le système que ce gestionnaire de signal doit être exécuté sur la pile spécifique de signal en positionnant le drapeau B<SA_ONSTACK>.

source: The I<ss> argument is used to specify a new alternate signal stack, while the I<old_ss> argument is used to retrieve information about the currently established signal stack. If we are interested in performing just one of these tasks, then the other argument can be specified as NULL.
fr: L'argument I<ss> est utilisé afin de définir une nouvelle pile spécifique de signal, tandis que l'argument I<old_ss> est utilisé afin de récupérer des informations sur la pile de signal actuellement en place. Si une seule de ces actions vous intéresse, alors l'autre argument peut être positionné à NULL.

source: The I<stack_t> type used to type the arguments of this function is defined as follows:
fr: Le type I<stack_t> utilisé pour typer les paramètres de cette fonction est défini comme suit :

source: typedef struct { void *ss_sp; /* Base address of stack */ int ss_flags; /* Flags */ size_t ss_size; /* Number of bytes in stack */ } stack_t;
fr: typedef struct { void *ss_sp; /* Adresse de base de la pile*/ int ss_flags; /* Drapeaux */ size_t ss_size; /* Nombre d'octets dans la pile */ } stack_t;

source: To establish a new alternate signal stack, the fields of this structure are set as follows:
fr: Pour mettre en place une nouvelle pile de signal spécifique, les champs de cette structure sont définis comme suit :

source: This field contains either 0, or the following flag:
fr: Ce champ contient soit B<0>, soit le drapeau suivant :

source: B<SS_AUTODISARM> (since Linux 4.7)
fr: B<SS_AUTODISARM> (depuis Linux 4.7)

source: Clear the alternate signal stack settings on entry to the signal handler. When the signal handler returns, the previous alternate signal stack settings are restored.
fr: Effacer les paramètres de la pile de signal spécifique lors de l'entrée dans le gestionnaire de signal. Au renvoi du gestionnaire de signal, les paramètres de la pile de signal spécifique seront restaurés.

source: This flag was added in order to make it safe to switch away from the signal handler with B<swapcontext>(3). Without this flag, a subsequently handled signal will corrupt the state of the switched-away signal handler. On kernels where this flag is not supported, B<sigaltstack>() fails with the error B<EINVAL> when this flag is supplied.
fr: Ce drapeau a été ajouté afin de sécuriser la désactivation d'un gestionnaire de signal avec B<swapcontext>(3). Sans ce drapeau, un signal géré après cette désactivation corrompra l'état du gestionnaire de signal désactivé. Sur les noyaux où ce drapeau n'est pas pris en charge, B<sigaltstack>() échoue avec l'erreur B<EINVAL> quand ce drapeau est fourni.

source: This field specifies the starting address of the stack. When a signal handler is invoked on the alternate stack, the kernel automatically aligns the address given in I<ss.ss_sp> to a suitable address boundary for the underlying hardware architecture.
fr: Ce champ indique l'adresse de début de la pile. Lorsqu'un gestionnaire de signal est appelé sur la pile spécifique, le noyau aligne automatiquement l'adresse donnée dans I<ss.ss_sp> sur une valeur correcte pour l'architecture matérielle utilisée.

source: This field specifies the size of the stack. The constant B<SIGSTKSZ> is defined to be large enough to cover the usual size requirements for an alternate signal stack, and the constant B<MINSIGSTKSZ> defines the minimum size required to execute a signal handler.
fr: Ce champ spécifie l'adresse de la pile. La constante B<SIGSTKSZ> est définie de façon à être suffisamment grande pour couvrir les besoins typiques en espace mémoire d'une pile spécifique de signal, et la constante B<MINSIGSTKSZ> définit la taille minimale nécessaire à l'exécution d'un gestionnaire de signal.

source: To disable an existing stack, specify I<ss.ss_flags> as B<SS_DISABLE>. In this case, the kernel ignores any other flags in I<ss.ss_flags> and the remaining fields in I<ss>.
fr: Afin de désactiver une pile existante, positionnez I<ss.ss_flags> à B<SS_DISABLE>. Dans ce cas, le noyau ignore tous les autres drapeaux de I<ss.ss_flags> et les autres champs de I<ss>.

source: If I<old_ss> is not NULL, then it is used to return information about the alternate signal stack which was in effect prior to the call to B<sigaltstack>(). The I<old_ss.ss_sp> and I<old_ss.ss_size> fields return the starting address and size of that stack. The I<old_ss.ss_flags> may return either of the following values:
fr: Si I<old_ss> ne vaut pas NULL, alors il est utilisé afin de renvoyer des informations sur la pile spécifique de signal qui était utilisée avant l'appel à B<sigaltstack>(). Les champs I<old_ss.ss_sp> et I<old_ss.ss_size> renvoient l'adresse de départ et la taille de cette pile. Le champ I<old_ss.ss_flags> peut renvoyer l'une des valeurs suivantes\ :

source: The thread is currently executing on the alternate signal stack. (Note that it is not possible to change the alternate signal stack if the thread is currently executing on it.)
fr: Le thread s'exécute actuellement sur la pile spécifique de signal. (Remarquez qu'il n'est pas possible de changer la pile spécifique de signal si le thread est en train de s'exécuter sur cette dernière.)

source: The alternate signal stack is currently disabled.
fr: La pile spécifique de signal est actuellement désactivée.

source: Alternatively, this value is returned if the thread is currently executing on an alternate signal stack that was established using the B<SS_AUTODISARM> flag. In this case, it is safe to switch away from the signal handler with B<swapcontext>(3). It is also possible to set up a different alternative signal stack using a further call to B<sigaltstack>().
fr: Sinon, cette valeur est renvoyée si le processus s'exécute actuellement sur une pile de signal spécifique mise en place en utilisant le drapeau B<SS_AUTODISARM>. Dans ce cas, il est plus sûr de désactiver le gestionnaire de signal avec B<swapcontext>(3). Il est également possible de définir une autre pile spécifique en utilisant un autre appel B<sigaltstack>().

source: The alternate signal stack has been marked to be autodisarmed as described above.
fr: La pile spécifique de signal a été marquée pour être désactivée comme décrit ci-dessus.

source: By specifying I<ss> as NULL, and I<old_ss> as a non-NULL value, one can obtain the current settings for the alternate signal stack without changing them.
fr: En positionnant I<ss> sur NULL et I<old_ss> sur une valeur autre que NULL, on peut obtenir les paramètres de la pile de signal spécifique sans les modifier.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: B<sigaltstack>() returns 0 on success, or -1 on failure with I<errno> set to indicate the error.
fr: B<sigaltstack>() renvoie B<0> en cas de succès, ou B<-1> en cas d'échec en positionnant alors I<errno> pour préciser l'erreur.

source: ERRORS
fr: ERREURS

source: Either I<ss> or I<old_ss> is not NULL and points to an area outside of the process's address space.
fr: Un des paramètres I<ss> ou I<old_ss> ne vaut pas NULL et pointe vers une zone mémoire n'appartenant pas à l'espace d'adressage du processus.

source: I<ss> is not NULL and the I<ss_flags> field contains an invalid flag.
fr: I<ss> ne vaut pas NULL et le champ I<ss_flags> contient une valeur non valable.

source: The specified size of the new alternate signal stack I<ss.ss_size> was less than B<MINSIGSTKSZ>.
fr: La taille de la nouvelle pile spécifique de signal indiquée (I<ss.ss_size>) est inférieure à B<MINSIGSTKSZ>.

source: An attempt was made to change the alternate signal stack while it was active (i.e., the thread was already executing on the current alternate signal stack).
fr: On a essayé de modifier la pile spécifique de signal alors que celle-ci était active (c'est-à-dire, le thread était déjà en train de s'exécuter sur la pile spécifique de signal courante).

source: ATTRIBUTES
fr: ATTRIBUTS

source: For an explanation of the terms used in this section, see B<attributes>(7).
fr: Pour une explication des termes utilisés dans cette section, consulter B<attributes>(7).

source: Attribute
fr: Attribut

source: Value
fr: Valeur

source: Thread safety
fr: Sécurité des threads

source: CONFORMING TO
fr: CONFORMITÉ

source: The B<SS_AUTODISARM> flag is a Linux extension.
fr: Le drapeau B<SS_AUTODISARM> est une extension de Linux.

source: The most common usage of an alternate signal stack is to handle the B<SIGSEGV> signal that is generated if the space available for the standard stack is exhausted: in this case, a signal handler for B<SIGSEGV> cannot be invoked on the standard stack; if we wish to handle it, we must use an alternate signal stack.
fr: Le cas le plus courant d'utilisation d'une pile spécifique est pour la gestion du signal B<SIGSEGV> qui est généré si la place disponible pour la pile normale est épuisée. Dans ce cas, un gestionnaire pour B<SIGSEGV> ne peut pas être exécuté sur la pile standard ; si l'on souhaite l'intercepter, on doit utiliser une pile spécifique.

source: Establishing an alternate signal stack is useful if a thread expects that it may exhaust its standard stack. This may occur, for example, because the stack grows so large that it encounters the upwardly growing heap, or it reaches a limit established by a call to B<setrlimit(RLIMIT_STACK, &rlim)>. If the standard stack is exhausted, the kernel sends the thread a B<SIGSEGV> signal. In these circumstances the only way to catch this signal is on an alternate signal stack.
fr: La mise en place d'une pile spécifique de signal est utile si un thread soupçonne qu'il est susceptible d'épuiser sa pile standard. Cela peut se produire, par exemple, lorsque la pile grossit au point de rencontrer la limite supérieure du tas, ou si elle atteint une limite établie par un appel à B<setrlimit(RLIMIT_STACK, &rlim)>. Si la pile standard est épuisée, le noyau envoie au processus un signal B<SIGSEGV>. Dans ces circonstances, la seule façon d'intercepter ce signal est d'utiliser une pile spécifique de signal.

source: On most hardware architectures supported by Linux, stacks grow downward. B<sigaltstack>() automatically takes account of the direction of stack growth.
fr: Sur la plupart des architectures supportées par Linux, les piles s'étendent vers les adresses décroissantes. B<sigaltstack>() prend automatiquement en charge le sens d'expansion de la pile.

source: Functions called from a signal handler executing on an alternate signal stack will also use the alternate signal stack. (This also applies to any handlers invoked for other signals while the thread is executing on the alternate signal stack.) Unlike the standard stack, the system does not automatically extend the alternate signal stack. Exceeding the allocated size of the alternate signal stack will lead to unpredictable results.
fr: Les fonctions appelées depuis un gestionnaire de signal s'exécutant sur une pile spécifique de signal utilisent également cette pile. (Cela s'applique également à tous les gestionnaires invoqués pour d'autres signaux alors que le thread s'exécute sur la pile spécifique de signal.) Contrairement à la pile standard, le système n'accroît pas automatiquement la pile spécifique de signal. Dépasser la taille allouée pour la pile spécifique de signal conduit à des résultats imprévisibles.

source: A successful call to B<execve>(2) removes any existing alternate signal stack. A child process created via B<fork>(2) inherits a copy of its parent's alternate signal stack settings. The same is also true for a child process created using B<clone>(2), unless the clone flags include B<CLONE_VM> and do not include B<CLONE_VFORK>, in which case any alternate signal stack that was established in the parent is disabled in the child process.
fr: Un appel B<execve>(2) réussi supprime toutes les piles de signal spécifiques. Un processus enfant créé à l'aide de B<fork>(2) hérite d'une copie des paramètres de la pile de signal spécifique de son parent. Cela vaut aussi pour un processus enfant créé avec B<clone>(2), sauf si les drapeaux de clone incluent B<CLONE_VM> et n'incluent pas B<CLONE_VFORK>, auquel cas toutes les piles de signal spécifique mises en place dans le processus parent sont désactivées dans le processus enfant.

source: B<sigaltstack>() supersedes the older B<sigstack>() call. For backward compatibility, glibc also provides B<sigstack>(). All new applications should be written using B<sigaltstack>().
fr: B<sigaltstack>() succède à l'ancien appel B<sigstack>(). Pour des raisons de compatibilité, la glibc implémente B<sigstack>(). Toutes les nouvelles applications devraient être écrites en utilisant B<sigaltstack>().

source: History
fr: Historique

source: 4.2BSD had a B<sigstack>() system call. It used a slightly different struct, and had the major disadvantage that the caller had to know the direction of stack growth.
fr: BSD\ 4.2 possédait un appel système B<sigstack>(). Il utilisait une structure légèrement différente, et avait comme désavantage principal la nécessité pour l'appelant de connaître le sens d'expansion de la pile.

source: BUGS
fr: BOGUES

source: In Linux 2.2 and earlier, the only flag that could be specified in I<ss.sa_flags> was B<SS_DISABLE>. In the lead up to the release of the Linux 2.4 kernel, a change was made to allow B<sigaltstack>() to allow I<ss.ss_flags==SS_ONSTACK> with the same meaning as I<ss.ss_flags==0> (i.e., the inclusion of B<SS_ONSTACK> in I<ss.ss_flags> is a no-op). On other implementations, and according to POSIX.1, B<SS_ONSTACK> appears only as a reported flag in I<old_ss.ss_flags>. On Linux, there is no need ever to specify B<SS_ONSTACK> in I<ss.ss_flags>, and indeed doing so should be avoided on portability grounds: various other systems give an error if B<SS_ONSTACK> is specified in I<ss.ss_flags>.
fr: Dans Linux 2.2, le seul drapeau qui pouvait être indiqué dans I<ss.sa_flags> était B<SS_DISABLE>. À partir de la publication du noyau Linux 2.4, un changement a été apporté pour permettre à B<sigaltstack>() d'autoriser I<ss.ss_flags==SS_ONSTACK> à avoir le même sens que I<ss.ss_flags==0> (à savoir que l'inclusion de B<SS_ONSTACK> dans I<ss.ss_flags> est une non-op). Sur d'autres implémentations et selon POSIX.1, B<SS_ONSTACK> n'apparaît que comme un drapeau signalé dans I<old_ss.ss_flags>. Sur Linux, il n'y a même pas besoin d'indiquer B<SS_ONSTACK> dans I<ss.ss_flags>, et en effet, vous devriez éviter de le faire pour des raisons de portabilité : plusieurs autres systèmes donnent une erreur si B<SS_ONSTACK> est indiqué dans I<ss.ss_flags>.

source: EXAMPLES
fr: EXEMPLES

source: The following code segment demonstrates the use of B<sigaltstack>() (and B<sigaction>(2)) to install an alternate signal stack that is employed by a handler for the B<SIGSEGV> signal:
fr: Le bout de code suivant montre l'utilisation de B<sigaltstack>() (et de B<sigaction>(2)) pour installer une pile de signal spécifique utilisée par le gestionnaire pour le signal B<SIGSEGV> :

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.13 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: B<int sigaltstack(const stack_t *>I<ss>B<, stack_t *>I<old_ss>B<);>
fr: B<int sigaltstack(const stack_t *>I<ss>B<, stack_t *>I<ood_ss>B<);>

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
fr: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Depuis la glibc 2.12 : */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Versions de la glibc E<lt>= 2.19 : */ _BSD_SOURCE

source: This flag was added in order make it safe to switch away from the signal handler with B<swapcontext>(3). Without this flag, a subsequently handled signal will corrupt the state of the switched-away signal handler. On kernels where this flag is not supported, B<sigaltstack>() fails with the error B<EINVAL> when this flag is supplied.
fr: Ce drapeau a été ajouté afin de sécuriser la désactivation d'un gestionnaire de signal avec B<swapcontext>(3). Sans ce drapeau, un signal géré après cette désactivation corrompra l'état du gestionnaire de signal désactivé. Sur les noyaux où ce drapeau n'est pas pris en charge, B<sigaltstack>() échoue avec l'erreur B<EINVAL> quand ce drapeau est fourni.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: 20 September 1999
fr: 20 septembre 1999

source: sigaltstack - get or set alternate signal stack content
fr: sigaltstack - Consulter ou définir le contenu de la pile de signal spécifique

source: B<int sigaltstack(const stack_t *>I<ss,>B< stack_t *>I<oss>B<);>
fr: B<int sigaltstack(const stack_t *>I<ss>B<, stack_t *>I<old_ss>B<);>

source: where:
fr: où :

source: points to a signalstack structure defined in E<lt>signal.hE<gt> containing stack content after the call.
fr: pointe vers une structure signalstack définie dans E<lt>signal.hE<gt> et où se trouve le contenu de la pile après l'appel.

source: if not NULL, points to a signalstack structure containing stack content before the call.
fr: s'il ne vaut pas NULL, pointe vers une structure signalstack où se trouve le contenu de la pile avant l'appel.

source: I<sigaction>(2) may indicate that a signal should execute on an alternate stack. Where this is the case, B<sigaltstack>(2) stores the signal in an alternate stack structure I<ss> where its execution status may be examined prior to processing.
fr: I<sigaction>(2) peut indiquer qu'un signal doit s'exécuter sur une pile spécifique. Quand c'est le cas, B<sigaltstack>(2) stocke le signal dans une structure de pile spécifique I<ss> où son état d'exécution peut être examiné avant de s'effectuer.

source: The sigaltstack struct is defined in E<lt>signal.hE<gt> as follows:
fr: La structure sigaltstack est définie dans E<lt>signal.hE<gt> comme suit :

source: void *ss_sp /* SVID3 uses caddr_t ss_sp int ss_flags size_t ss_size
fr: void *ss_sp /* SVID3 utilise caddr_t ss_sp int ss_flags size_t ss_size

source: points to the stack structure.
fr: pointe vers la structure de pile.

source: specifies the stack state to SS_DISABLE or SS_ONSTACK as follows:
fr: indique l'état de la pile à SS_DISABLE ou à SS_ONSTACK comme suit :

source: If I<ss> is not NULL,the new state may be set to SS_DISABLE, which specifies that the stack is to be disabled and ss_sp and ss_size are ignored. If SS_DISABLE is not set, the stack will be enabled.
fr: Si I<ss> ne vaut pas NULL, le nouvel état peut être positionné sur SS_DISABLE, ce qui indique que la pile va être désactivée et que ss_sp et ss_size seront ignorées. Si SS_DISABLE n'est pas positionné, la pile sera activée.

source: If I<oss> is not NULL, the stack state may be either SS_ONSTACK or SS_DISABLE. The value SS_ONSTACK indicates that the process is currently executing on the alternate stack and that any attempt to modify it during execution will fail. The value SS_DISABLE indicates that the current signal stack is disabled.
fr: Si I<oss> ne vaut pas NULL, l'état de la pile peut être soit SS_ONSTACK, soit SS_DISABLE. La valeur SS_ONSTACK indique que le processus s'exécute actuellement sur la pile spécifique et que toute tentative de le modifier lors de cette exécution échouera. La valeur SS_DISABLE indique que la pile de signal actuelle est désactivée.

source: specifies the size of the stack.
fr: indique la taille de la pile.

source: The value SIGSTKSZ defines the average number of bytes used when allocating an alternate stack area. The value MINSIGSTKSZ defines the minimum stack size for a signal handler. When processing an alternate stack size, your program should include these values in the stack requirement to plan for the overhead of the operating system.
fr: La valeur SIGSTKSZ indique le nombre moyen d'octets utilisés lors de l'allocation d'une zone de pile spécifique. La valeur MINSIGSTKSZ définit la taille minimale de la pile pour un gestionnaire de signal. Quand votre programme gère une taille de pile spécifique, il doit inclure ces valeurs dans les prérequis de la pile pour planifier la charge du système d'exploitation.

source: RETURN VALUES
fr: VALEURS DE RENVOI

source: B<sigaltstack>(2) returns 0 on success and -1 on failure.
fr: B<sigaltstack>(2) renvoie B<0> si elle réussit et B<-1> en cas d'échec.

source: B<sigaltstack>(2) sets errno for the following conditions:
fr: B<sigaltstack>(2) positionne B<errno> pour les conditions suivantes :

source: EINVAL
fr: B<EINVAL>

source: I<ss> is not a null pointer the I<ss_flags> member pointed to by I<ss> contains flags other than SS_DISABLE.
fr: I<ss> n'est pas un pointeur null vers le membre I<ss_flags> vers lequel pointe I<ss>, il contient d'autres drapeaux que SS_DISABLE.

source: ENOMEM
fr: B<ENOMEM>
