Repository: sebras/manpages-l10n
Catalog: po/*/man2/sigaltstack.2.po
Languages: fr

source: The size of the alternate stack area is less than MINSIGSTKSZ.
fr: La taille de la zone de la pile spécifique est inférieure à MINSIGSTKSZ.

source: EPERM
fr: B<EPERM>

source: An attempt was made to modify an active stack.
fr: Vous avez tenté de modifier une pile active.

source: This function comforms to: XPG4-UNIX.
fr: Cette fonction respecte : XPG4-UNIX.

source: B<sigaltstack>() allows a process to define a new alternate signal stack and/or retrieve the state of an existing alternate signal stack. An alternate signal stack is used during the execution of a signal handler if the establishment of that handler (see B<sigaction>(2)) requested it.
fr: B<sigaltstack>() permet à un processus de définir une nouvelle pile spécifique pour les gestionnaires de signaux et/ou de récupérer l'état d'une pile spécifique de signal déjà existante. Une pile spécifique de signal est utilisée durant l'exécution d'un gestionnaire de signal si la mise en place de ce gestionnaire (consultez B<sigaction>(2)) le spécifiait.

source: The process is currently executing on the alternate signal stack. (Note that it is not possible to change the alternate signal stack if the process is currently executing on it.)
fr: Le processus s'exécute actuellement sur la pile spécifique de signal. (Remarquez qu'il n'est pas possible de changer la pile spécifique de signal si le processus est en train de s'exécuter sur cette dernière.)

source: Alternatively, this value is returned if the process is currently executing on an alternate signal stack that was established using the B<SS_AUTODISARM> flag. In this case, it is safe to switch away from the signal handler with B<swapcontext>(3). It is also possible to set up a different alternative signal stack using a further call to B<sigaltstack>().
fr: Sinon, cette valeur est renvoyée si le processus s'exécute actuellement sur une pile de signal spécifique mise en place en utilisant le drapeau B<SS_AUTODISARM>. Dans ce cas, il est plus sûr de désactiver le gestionnaire de signal avec B<swapcontext>(3). Il est également possible de définir une autre pile spécifique en utilisant un autre appel B<sigaltstack>().

source: The specified size of the new alternate signal stack I<ss.ss_size> was less than B<MINSTKSZ>.
fr: La taille de la nouvelle pile spécifique de signal indiquée (I<ss.ss_size>) était inférieure à B<MINSTKSZ>.

source: An attempt was made to change the alternate signal stack while it was active (i.e., the process was already executing on the current alternate signal stack).
fr: On a essayé de modifier la pile spécifique de signal alors que celle-ci était active (c'est-à-dire, le processus était déjà en train de s'exécuter sur la pile spécifique de signal courante).

source: The most common usage of an alternate signal stack is to handle the B<SIGSEGV> signal that is generated if the space available for the normal process stack is exhausted: in this case, a signal handler for B<SIGSEGV> cannot be invoked on the process stack; if we wish to handle it, we must use an alternate signal stack.
fr: Le cas le plus courant d'utilisation d'une pile spécifique est pour la gestion du signal B<SIGSEGV> qui est généré si la place disponible pour la pile normale du processus est épuisée. Dans ce cas, un gestionnaire pour B<SIGSEGV> ne peut pas être exécuté sur la pile du processus\ ; si l'on souhaite l'intercepter, on doit utiliser une pile spécifique.

source: Establishing an alternate signal stack is useful if a process expects that it may exhaust its standard stack. This may occur, for example, because the stack grows so large that it encounters the upwardly growing heap, or it reaches a limit established by a call to B<setrlimit(RLIMIT_STACK, &rlim)>. If the standard stack is exhausted, the kernel sends the process a B<SIGSEGV> signal. In these circumstances the only way to catch this signal is on an alternate signal stack.
fr: La mise en place d'une pile spécifique de signal est utile si un processus soupçonne qu'il est susceptible d'épuiser sa pile standard. Cela peut se produire, par exemple, lorsque la pile grossit au point de rencontrer la limite supérieure du tas, ou si elle atteint une limite établie par un appel à B<setrlimit(RLIMIT_STACK, &rlim)>. Si la pile standard est épuisée, le noyau envoie au processus un signal B<SIGSEGV>. Dans ces circonstances, la seule façon d'intercepter ce signal est d'utiliser une pile spécifique de signal.

source: Functions called from a signal handler executing on an alternate signal stack will also use the alternate signal stack. (This also applies to any handlers invoked for other signals while the process is executing on the alternate signal stack.) Unlike the standard stack, the system does not automatically extend the alternate signal stack. Exceeding the allocated size of the alternate signal stack will lead to unpredictable results.
fr: Les fonctions appelées depuis un gestionnaire de signal s'exécutant sur une pile spécifique de signal utilisent également cette pile. (Cela s'applique également à tous les gestionnaires invoqués pour d'autres signaux alors que le processus s'exécute sur la pile spécifique de signal.) Contrairement à la pile standard, le système n'accroît pas automatiquement la pile spécifique de signal. Dépasser la taille allouée pour la pile spécifique de signal conduit à des résultats imprévisibles.

source: A successful call to B<execve>(2) removes any existing alternate signal stack. A child process created via B<fork>(2) inherits a copy of its parent's alternate signal stack settings.
fr: Un appel B<execve>(2) réussi détruit toutes piles spécifiques de signal existantes. Un processus enfant créé avec B<fork>(2) hérite d'une copie des paramètres de la pile spécifique de signal de son parent.

source: EXAMPLE
fr: EXEMPLE

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
