Repository: sebras/manpages-l10n
Catalog: po/*/man2/stat.2.po
Languages: de, nl

source: On modern 64-bit systems, life is simpler: there is a single B<stat>() system call and the kernel deals with a I<stat> structure that contains fields of a sufficient size.
de: Auf modernen 64-Bit-Systemen ist das Leben einfacher: Es gibt einen einzigen Systemaufruf B<stat>() und der Kernel arbeitet mit einer Struktur I<stat>, die Felder einer ausreichenden Größe enthält.
nl: Op moderne 64-bit systemen is het leven eenvoudiger: daar bestaat een enkele B<stat>() systeem aanroep en de kernel werkt met een I<stat> structure die velden van voldoende grootte bevat.

source: The underlying system call employed by the glibc B<fstatat>() wrapper function is actually called B<fstatat64>() or, on some architectures, B<newfstatat>().
de: Der der Glibc-Wrapper-Funktion B<fstatat>() zugrunde liegende Systemaufruf ist tatsächlich B<fstatat64>() oder auf einigen Architekturen B<newfstatat>().
nl: De onderliggende systeem aanroep gebruikt door de glibc B<fstatat>() omwikkel functie heet eigenlijk B<fstatat64>() of op sommige architecturen B<newfstatat>().

source: EXAMPLES
de: BEISPIELE
nl: VOORBEELDEN

source: The following program calls B<lstat>() and displays selected fields in the returned I<stat> structure.
de: Das folgende Programm ruft B<lstat>() auf zeigt ausgewählte Felder der zurückgelieferten Struktur I<stat> an.
nl: Het volgende programma roept B<lstat>() aan en toont geselecteerde velden in de teruggegeven I<stat> structure.

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>pathnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
de: if (argc != 2) { fprintf(stderr, "Aufruf: %s E<lt>PfadnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
nl: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>padnaamE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("ID of containing device: [%x,%x]\en", major(sb.st_dev), minor(sb.st_dev));
de: printf("Kennung des enthaltenen Gerätes: [%x,%x]\en", major(sb.st_dev), minor(sb.st_dev));

source: printf("File type: ");
de: printf("Dateityp: ");
nl: printf("Bestandstype: ");

source: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("block device\en"); break; case S_IFCHR: printf("character device\en"); break; case S_IFDIR: printf("directory\en"); break; case S_IFIFO: printf("FIFO/pipe\en"); break; case S_IFLNK: printf("symlink\en"); break; case S_IFREG: printf("regular file\en"); break; case S_IFSOCK: printf("socket\en"); break; default: printf("unknown?\en"); break; }
de: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("blockorientiertes Gerät\en"); break; case S_IFCHR: printf("zeichenorientiertes Gerät\en"); break; case S_IFDIR: printf("Verzeichnis\en"); break; case S_IFIFO: printf("FIFO/Pipe\en"); break; case S_IFLNK: printf("symbolischer Link\en"); break; case S_IFREG: printf("reguläre Datei\en"); break; case S_IFSOCK: printf("Socket\en"); break; default: printf("unbekannt?\en"); break; }
nl: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("blok apparaat\en"); break; case S_IFCHR: printf("teken apparaat\en"); break; case S_IFDIR: printf("map\en"); break; case S_IFIFO: printf("FIFO/pijp\en"); break; case S_IFLNK: printf("symbolische koppeling\en"); break; case S_IFREG: printf("regulier bestand\en"); break; case S_IFSOCK: printf("socket\en"); break; default: printf("onbekend?\en"); break; }

source: printf("I-node number: %ju\en", (uintmax_t) sb.st_ino);
de: printf("I-Node-Nummer: %ju\en", (uintmax_t) sb.st_ino);

source: printf("Mode: %jo (octal)\en", (uintmax_t) sb.st_mode);
de: printf("Modus: %jo (oktal)\en", (uintmax_t) sb.st_mode);

source: printf("Last status change: %s", ctime(&sb.st_ctime)); printf("Last file access: %s", ctime(&sb.st_atime)); printf("Last file modification: %s", ctime(&sb.st_mtime));
de: printf("Letzte Statusänderung: %s", ctime(&sb.st_ctime)); printf("Letzter Dateizugriff: %s", ctime(&sb.st_atime)); printf("Letzte Dateiänderung: %s", ctime(&sb.st_mtime));

source: SEE ALSO
de: SIEHE AUCH
nl: ZIE OOK

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
nl: Linux Programmeurs Handleiding

source: B<int stat(const char *>I<pathname>B<, struct stat *>I<statbuf>B<);> B<int fstat(int >I<fd>B<, struct stat *>I<statbuf>B<);> B<int lstat(const char *>I<pathname>B<, struct stat *>I<statbuf>B<);>
de: B<int stat(const char *>I<Pfadname>B<, struct stat *>I<Statuspuffer>B<);> B<int fstat(int >I<dd>B<, struct stat *>I<Statuspuffer>B<);> B<int lstat(const char *>I<Pfadname>B<, struct stat *>I<Statuspuffer>B<);>
nl: B<int stat(const char *>I<padnaam>B<, struct stat *>I<statbuf>B<);> B<int fstat(int >I<fd>B<, struct stat *>I<statbuf>B<);> B<int lstat(const char *>I<padnaam>B<, struct stat *>I<statbuf>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>sys/stat.hE<gt>>
de: B<#include E<lt>fcntl.hE<gt> >/* Definition der AT_*-Konstanten */ B<#include E<lt>sys/stat.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van AT_* constanten */ B<#include E<lt>sys/stat.hE<gt>>

source: B<int fstatat(int >I<dirfd>B<, const char *>I<pathname>B<, struct stat *>I<statbuf>B<,> B< int >I<flags>B<);>
de: B<int fstatat(int >I<Verzdd>B<, const char *>I<Pfadname>B<, struct stat *>I<Statuspuffer>B<,> B< int >I<Schalter>B<);>
nl: B<int fstatat(int >I<dirfd>B<, const char *>I<padnaam>B<, struct stat *>I<statbuf>B<,> B< int >I<vlaggen>B<);>

source: /* glibc 2.19 and earlier */ _BSD_SOURCE || /* Since glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
de: /* Glibc 2.19 und älter */ _BSD_SOURCE || /* Seit Glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Seit Glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
nl: /* glibc 2.19 en eerder */ _BSD_SOURCE || /* Vanaf glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Vanaf glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: Since glibc 2.10:
de: Seit Glibc 2.10:
nl: Vanaf glibc 2.10:

source: Before glibc 2.10:
de: Vor Glibc 2.10:
nl: Vóór glibc 2.10:

source: All of these system calls return a I<stat> structure, which contains the following fields:
de: Alle diese Systemaufrufe geben eine Struktur I<stat> zurück, die folgendermaßen aufgebaut ist:
nl: Al deze systeem aanroepen retourneren een I<stat> structuur, die de volgende velden bevat:

source: struct stat { dev_t st_dev; /* ID of device containing file */ ino_t st_ino; /* Inode number */ mode_t st_mode; /* File type and mode */ nlink_t st_nlink; /* Number of hard links */ uid_t st_uid; /* User ID of owner */ gid_t st_gid; /* Group ID of owner */ dev_t st_rdev; /* Device ID (if special file) */ off_t st_size; /* Total size, in bytes */ blksize_t st_blksize; /* Block size for filesystem I/O */ blkcnt_t st_blocks; /* Number of 512B blocks allocated */
de: struct stat { dev_t st_dev; /* Gerät */ ino_t st_ino; /* Inode */ mode_t st_mode; /* Dateityp und -modus */ nlink_t st_nlink; /* Anzahl harter Links */ uid_t st_uid; /* UID des Besitzers */ gid_t st_gid; /* GID des Besitzers */ dev_t st_rdev; /* Typ (wenn Inode-Gerät) */ off_t st_size; /* Größe in Bytes*/ blksize_t st_blksize; /* Blockgröße für Dateisystem-E/A */ blkcnt_t st_blocks; /* Anzahl der zugewiesenen 512B-Blöcke */
nl: struct stat { dev_t st_dev; /* ID van het apparaat dat het bestand bevat */ ino_t st_ino; /* inode nummer */ mode_t st_mode; /* bestandstype en modus */ nlink_t st_nlink; /* aantal harde koppelingen */ uid_t st_uid; /* gebruiker ID van eigenaar */ gid_t st_gid; /* groep ID van eigenaar */ dev_t st_rdev; /* apparaat ID (als speciaal bestand) */ off_t st_size; /* totale grootte, in bytes */ blksize_t st_blksize; /* Blok grootte voor bestandssysteem I/O */ blkcnt_t st_blocks; /* Aantal toegekende 512B blokken */

source: /* Since Linux 2.6, the kernel supports nanosecond precision for the following timestamp fields. For the details before Linux 2.6, see NOTES. */
de: /* Seit Linux 2.6 unterstützt der Kernel Nanosekundengenauigkeit für die folgenden Zeitstempelfelder. Für Details vor Linux 2.6 lesen Sie ANMERKUNGEN. */
nl: /* Vanaf Linux 2.6, ondersteund de kernel nanoseconden precisie voor de volgende tijdstempel velden. Voor details over vóór Linux 2.6, zie OPMERKINGEN. */

source: struct timespec st_atim; /* Time of last access */ struct timespec st_mtim; /* Time of last modification */ struct timespec st_ctim; /* Time of last status change */
de: struct timespec st_atim; /* Zeit des letzten Zugriffs */ struct timespec st_mtim; /* Zeit der letzten Veränderung*/ struct timespec st_ctim; /* Zeit der letzten Statusänderung*/
nl: struct timespec st_atim; /* Tijdstip laatste toegang */ struct timespec st_mtim; /* Tijdstip laatste wijziging */ struct timespec st_ctim; /* Tijdstip laatste status verandering */

source: #define st_atime st_atim.tv_sec /* Backward compatibility */ #define st_mtime st_mtim.tv_sec #define st_ctime st_ctim.tv_sec };
de: #define st_atime st_atim.tv_sec /* Rückwärtskompatibilität */ #define st_mtime st_mtim.tv_sec #define st_ctime st_ctim.tv_sec };
nl: #define st_atime st_atim.tv_sec /* achterwaartse compatibiliteit */ #define st_mtime st_mtim.tv_sec #define st_ctime st_ctim.tv_sec };

source: I<Note>: the order of fields in the I<stat> structure varies somewhat across architectures. In addition, the definition above does not show the padding bytes that may be present between some fields on various architectures. Consult the glibc and kernel source code if you need to know the details.
de: I<Hinweis:> Die Reihenfolge der Felder in der I<stat>-Struktur ist in den verschiedenen Architekturen nicht gleich. Außerdem zeigt die oben genannte Definition nicht die Auffüll-Bytes, die in verschiedenen Architekturen zwischen einigen Feldern vorhanden sind. Im Quellcode von Glibc und Kernel finden Sie bei Bedarf Details hierzu.
nl: I<NOTITIE>: de volgorde van de velden in de I<stat> structuur varieert over de verschillende architecturen. Bovendien toont bovenstaande definitie niet de opvul bytes die aanwezig kunnen zijn tussen sommige velden op de diverse architecturen. Raadpleeg de glibc en kernel broncode als u deze details moet kennen.

source: The fields in the I<stat> structure are as follows:
de: Die Bedeutung der Felder in I<stat> im Einzelnen:
nl: De velden in de I<stat> structure zijn als volgt:

source: This field describes the device on which this file resides. (The B<major>(3) and B<minor>(3) macros may be useful to decompose the device ID in this field.)
de: Dieses Feld beschreibt das Gerät, auf dem sich die Datei befindet. (Die Makros B<major>(3) und B<minor>(3) können zum Zerlegen der Gerätekennungen in diesem Feld nützlich sein.)
nl: Dit veld beschrijft het apparaat op welk zich het bestand bevind. (De B<major>(3) en B<minor>(3) macro´s kunnen bruikbaar zijn om het apparaat ID in dit veld te ontleden.)

source: This field contains the file's inode number.
de: Dieses Feld enthält die Inode-Nummer der Datei.
nl: Dit veld bevat het inode nummer van het bestand.

source: This field contains the file type and mode. See B<inode>(7) for further information.
de: Dieses Feld enthält den Dateityp und -modus. Siehe B<inode>(7) für weitere Informationen.
nl: Dit veld bevat het type van het bestand en mode. Zie B<inode>(7) voor verdere informatie.

source: This field contains the number of hard links to the file.
de: Dieses Feld enthält die Anzahl der harten Links auf die Datei.
nl: Dit veld bevat het aantal harde koppelingen naar het bestand.

source: This field contains the user ID of the owner of the file.
de: Dieses Feld enthält die Benutzerkennung des Eigentümers der Datei.
nl: Dit veld bevat het gebruikers ID van de eigenaar van het bestand.

source: This field contains the ID of the group owner of the file.
de: Dieses Feld enthält die Kennung des Gruppeneigentümers der Datei.
nl: Dit veld beat het ID van de groep eigenaar van het bestand.

source: This field describes the device that this file (inode) represents.
de: Dieses Feld beschreibt das Gerät, das diese Datei (Inode) repräsentiert.
nl: Dit veld beschrijft het apparaat dat dit bestand (inode) voorsteld.

source: This field gives the size of the file (if it is a regular file or a symbolic link) in bytes. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
de: Dieses Feld gibt die Größe der Datei (falls sie eine reguläre Datei oder ein symbolischer Link ist) in Byte an. Die Größe eines symbolischen Links ist die Länge des enthaltenen Pfadnamens, ohne abschließendes NULL-Byte.
nl: Dit veld geeft de grootte van het bestand (als het een regulier bestand of een symbolische koppeling is) in bytes. De grootte van de een symbolische koppeling is gelijk aan de lengte van de padnaam die het bevat, zonder de afsluitende nul.

source: This field gives the "preferred" block size for efficient filesystem I/O.
de: Dieses Feld liefert die »bevorzugte« Blockgröße für effiziente Dateisystem-E/A.
nl: Dit veld geeft de "voorkeur" blok grootte voor efficiënte bestandssysteem invoer/uitvoer.

source: This field indicates the number of blocks allocated to the file, in 512-byte units. (This may be smaller than I<st_size>/512 when the file has holes.)
de: Dieses Feld gibt die Anzahl der Blöcke, die der Datei zugewiesen sind, in 512-Byte-Einheiten an. Dies kann kleiner als I<st_size>/512 sein, wenn die Datei Löcher enthält.
nl: Dit veld bevat een indicatie van het aantal blokken toegewezen aan het bestand, in 512-byte eenheden. (Deze kan kleiner zijn dan I<st_size>/512 als het bestand gaten bevat.)

source: This is the time of the last access of file data.
de: Dies ist der Zeitpunkt des letzten Zugriffs auf Dateidaten.
nl: Dit is de laatste toegangstijd van de bestands data.

source: This is the time of last modification of file data.
de: Dies ist der Zeitpunkt der letzten Veränderung von Dateidaten.
nl: Dit is de tijd van de laatste modificatie van de bestands data/.

source: This is the file's last status change timestamp (time of last change to the inode).
de: Dies ist der Zeitstempel der letzten Dateistatusveränderung (Zeitpunkt der letzten Änderung der Inode).
nl: Dit is de tijdsstempel van de laatste status verandering van het bestand (tijd van de laatste verandering van de inode).

source: For further information on the above fields, see B<inode>(7).
de: Weitere Informationen zu obigen Feldern finden Sie in B<inode>(7).
nl: Zie B<inode>(7) voor verdere informatie over de velden hierboven.

source: Don't automount the terminal ("basename") component of I<pathname> if it is a directory that is an automount point. This allows the caller to gather attributes of an automount point (rather than the location it would mount). Since Linux 4.14, also don't instantiate a nonexistent name in an on-demand directory such as used for automounter indirect maps. This flag has no effect if the mount point has already been mounted over.
de: Die Terminal-»basename«-Komponente von I<Pfadname> wird nicht automatisch eingehängt, wenn es ein Verzeichnis ist, das selbst ein Selbsteinhängepunkt ist. Dies ermöglicht dem Aufrufenden, Informationen zu einem Auto-Einhängepunkt zu sammeln, anstatt zu dem Ort, der eingehängt werden würde. Seit Linux 4.14 realisiert dies keinen nicht existierenden Namen in einem bei-Bedarf-Verzeichnis, sie für indirekte Zuordnungen von Selbsteinhängeprogrammen verwandt werden. Dieser Schalter ist unwirksam, wenn der Einhängepunkt bereits eingehängt wurde.
nl: Koppel de uiteinde ("basename") component van I<padnaam> niet automatisch aan als het een map is met een automatisch aankoppelpunt. Dit maakt het voor de aanroeper mogelijk om attributen van een automatisch aankoppelpunt te verzamelen (in plaats van die van de locatie die aangekoppeld zou worden). Instantieer vanaf Linux 4.14 geen niet-bestaande naam in een map die bedoeld is voor automatische aankoppelpunten. Deze vlag heeft geen effect als het aankoppelpunt al aangekoppeld was.

source: Both B<stat>() and B<lstat>() act as though B<AT_NO_AUTOMOUNT> was set.
de: Sowohl B<stat>() und B<lstat>() handeln, als ob B<AT_NO_AUTOMOUNT> gesetzt worden wäre.
nl: Beide B<stat>() en B<lstat>() werken alsof B<AT_NO_AUTOMOUNT> werd gezet.

source: The B<AT_NO_AUTOMOUNT> can be used in tools that scan directories to prevent mass-automounting of a directory of automount points.
de: Der Schalter B<AT_NO_AUTOMOUNT> kann in Werkzeugen verwendet werden, die Verzeichnisse einlesen, um automatische Masseneinhängungen eines Verzeichnisses zu verhindern, welches Auto-Einhängepunkte enthält.
nl: B<AT_NO_AUTOMOUNT> kan worden gebruikt in hulpmiddelen die mappen scannen om ter voorkoming van het massaal aankoppelen van een map van automatische aankoppelpunten.

source: This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
de: Dieser Schalter ist Linux-spezifisch; definieren Sie B<_GNU_SOURCE>, um dessen Definition zu ermitteln.
nl: De vlag is Linux specifiek; definieer B<_GNU_SOURCE> om zijn definitie te verkrijgen.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: The following additional errors can occur for B<fstatat>():
de: Die folgenden Fehler können zusätzlichen bei B<fstatat>() auftreten:
nl: De volgende extra fouten kunnen optreden voor B<fstatat>():

source: I<dirfd> is not a valid file descriptor.
de: I<Verzdd> ist kein zulässiger Dateideskriptor.
nl: I<mapbi> is geen geldige bestandsindicator.

source: Invalid flag specified in I<flags>.
de: Unzulässiger Schalter in I<Schalter> angegeben.
nl: Ongeldige vlag opgegeven in I<vlaggen>.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
de: I<Pfadname> ist relativ und I<Verzdd> ist ein Dateideskriptor, der sich auf eine Datei bezieht, die kein Verzeichnis ist.
nl: I<padnaam> is relatief en I<mapbi> is een bestandsindicator die naar een bestand wijst die geen map is.

source: CONFORMING TO
de: KONFORM ZU
nl: VOLDOET AAN

source: Timestamp fields
de: Zeitstempelfelder
nl: Tijdstempel velden

source: Older kernels and older standards did not support nanosecond timestamp fields. Instead, there were three timestamp fields\(emI<st_atime>, I<st_mtime>, and I<st_ctime>\(emtyped as I<time_t> that recorded timestamps with one-second precision.
de: Ältere Kernel und ältere Standards unterstützen keine Zeitstempel-Felder für Nanosekunden. Stattdessen gab es die drei Zeitstempel-Felder – I<st_atime>, I<st_mtime> und I<st_ctime> –, angegeben als I<time_t>, die Zeitstempel mit Sekundengenauigkeit ergaben.
nl: Oudere kernels en oudere standaarden ondersteunden nanoseconden tijdstempel velden niet. In plaats daarvan waren er drie tijdstempel velden \(emI<st_atime>, I<st_mtime>, en I<st_ctime>\(emaangeduid als I<time_t> die tijdstempels noteerden in een-seconde precisie.

source: Since kernel 2.5.48, the I<stat> structure supports nanosecond resolution for the three file timestamp fields. The nanosecond components of each timestamp are available via names of the form I<st_atim.tv_nsec>, if suitable feature test macros are defined. Nanosecond timestamps were standardized in POSIX.1-2008, and, starting with version 2.12, glibc exposes the nanosecond component names if B<_POSIX_C_SOURCE> is defined with the value 200809L or greater, or B<_XOPEN_SOURCE> is defined with the value 700 or greater. Up to and including glibc 2.19, the definitions of the nanoseconds components are also defined if B<_BSD_SOURCE> or B<_SVID_SOURCE> is defined. If none of the aforementioned macros are defined, then the nanosecond values are exposed with names of the form I<st_atimensec>.
de: Seit Kernel 2.5.48 unterstützt die I<stat>-Struktur die Nanosekunden-Auflösung für die drei Zeitstempel-Felder. Die Nanosekunden-Komponenten jedes Zeitstempels sind durch Namen der Form I<st_atim.tv_nsec> verfügbar, falls geeignete Feature-Test-Makros definiert sind. Nanosekunden-Zeitstempel wurden in POSIX.1-2008 standardisiert und seit Glibc-Version 2.12 legt Glibc die Nanosekundenkomponentennamen offen, falls B<_POSIX_C_SOURCE> mit einem Wert von 200809L oder größer oder B<_XOPEN_SOURCE> mit einem Wert von 700 oder größer definiert ist. Bis einschließlich Glibc 2.19 sind die Definitionen der Nanosekundenkomponenten auch definiert, falls B<_BSD_SOURCE> oder B<_SVID_SOURCE> definiert sind. Falls keines der erwähnten Makros definiert ist, dann werden die Nanosekunden-Werte mit Namen der Form I<st_atimensec> angezeigt.
nl: Vanaf kernel 2.5.48 ondersteund de I<stat> structure nanoseconden resolutie in de drie bestandstijdstepel velden. De nanoseconden componenten van elke tijdstempel zijn beschikbaar via namen van de vorm I<st_atim.tv_nsec>, mits geschikte test macros werden gedefinieerd. Nanoseconden tijdstempels zijn gestandaardiseerd in POSIX.1-2008, en vanaf versie 2.12 toont glibc de namen van de nanoseconden componenten als B<_POSIX_C_SOURCE> werd gedefinieerd met een waarde 200809L of hoger, of B<_XOPEN_SOURCE> werd gedefinieerd met een waarde 700 of hoger. Tot en met glibc 2.19 werd de definitie van de nanoseconden componenten ook gedefinieerd zodra B<_BSD_SOURCE> of B<_SVID_SOURCE> werden gedefinieerd. Als geen van de hier voor genoemde macros werd gedefinieerd dan worden de nanoseconden waarden getoond met de namen van de vorm I<st_atimensec>.

source: printf("ID of containing device: [%jx,%jx]\en", (uintmax_t) major(sb.st_dev), (uintmax_t) minor(sb.st_dev));
de: printf("Kennung des enthaltenen Gerätes: [%jx,%jx]\en", (uintmax_t) major(sb.st_dev), (uintmax_t) minor(sb.st_dev));
nl: printf("ID van het bevattende apparaat: [%jx,%jx]\en", (uintmax_t) major(sb.st_dev), (uintmax_t) minor(sb.st_dev));

source: printf("Mode: %jo (octal)\en", (uintmax_t) sb.st_mode);
de: printf("Modus: %jo (oktal)\en", (uintmax_t) sb.st_mode);

source: COLOPHON
de: KOLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: /* glibc 2.19 and earlier */ _BSD_SOURCE
de: /* Glibc 2.19 und älter */ _BSD_SOURCE
nl: /* glibc 2.19 en eerder */ _BSD_SOURCE

source: || /* Since glibc 2.20 */ _DEFAULT_SOURCE
de: || /* Seit Glibc 2.20 */ _DEFAULT_SOURCE
nl: || /* Sinds glibc 2.20 */ _DEFAULT_SOURCE
