Repository: sebras/manpages-l10n
Catalog: po/*/man2/stat.2.po
Languages: de, nl

source: Linux man-pages (unreleased)
de: Linux-Handbuchseiten (nicht veröffentlicht)

source: NAME
de: BEZEICHNUNG
nl: NAAM

source: stat, fstat, lstat, fstatat - get file status
de: stat, fstat, lstat, fstatat - Dateistatus ermitteln
nl: stat, fstat, lstat, fstatat - verkrijg bestand status.

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT
nl: SAMENVATTING

source: B<int stat(const char *restrict >I<pathname>B<,> B< struct stat *restrict >I<statbuf>B<);> B<int fstat(int >I<fd>B<, struct stat *>I<statbuf>B<);> B<int lstat(const char *restrict >I<pathname>B<,> B< struct stat *restrict >I<statbuf>B<);>
de: B<int stat(const char *restrict >I<Pfadname>B<,> B< struct stat *restrict >I<Statuspuffer>B<);> B<int fstat(int >I<dd>B<, struct stat *>I<Statuspuffer>B<);> B<int lstat(const char *restrict >I<Pfadname>B<,> B< struct stat *restrict >I<Statuspuffer>B<);>
nl: B<int stat(const char *beperk >I<padnaam>B<,> B< struct stat *beperk >I<statbuf>B<);> B<int fstat(int >I<fd>B<, struct stat *>I<statbuf>B<);> B<int lstat(const char *beperk >I<padnaam>B<,> B< struct stat *beperk >I<statbuf>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of B<AT_*> constants */ B<#include E<lt>sys/stat.hE<gt>>
de: B<#include E<lt>fcntl.hE<gt> >/* Definition der B<AT_*>-Konstanten */ B<#include E<lt>sys/stat.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van B<AT_*> constanten */ B<#include E<lt>sys/stat.hE<gt>>

source: B<int fstatat(int >I<dirfd>B<, const char *restrict >I<pathname>B<,> B< struct stat *restrict >I<statbuf>B<, int >I<flags>B<);>
de: B<int fstatat(int >I<Verzdd>B<, const char *restrict >I<Pfadname>B<,> B< struct stat *restrict >I<Statuspuffer>B<, int >I<Schalter>B<);>
nl: B<int fstatat(int >I<dirfd>B<, const char *restrict >I<padnaam>B<,> B< struct stat *beperk >I<statbuf>B<, int >I<vlaggen>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: /* Since glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.10: */ _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 and earlier */ _BSD_SOURCE
de: /* Seit Glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE E<gt>= 500 || /* Seit Glibc 2.10: */ _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 und älter */ _BSD_SOURCE
nl: /* Vanaf glibc 2.20 */ _DEFAULT_SOURCE || _XOPEN_SOURCE E<gt>= 500 || /* Vanaf glibc 2.10: */ _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc 2.19 en eerder */ _BSD_SOURCE

source: Since glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Before glibc 2.10: _ATFILE_SOURCE
de: Seit Glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Vor Glibc 2.10: _ATFILE_SOURCE
nl: Vanaf glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Voor glibc 2.10: _ATFILE_SOURCE

source: DESCRIPTION
de: BESCHREIBUNG
nl: BESCHRIJVING

source: These functions return information about a file, in the buffer pointed to by I<statbuf>. No permissions are required on the file itself, but\(emin the case of B<stat>(), B<fstatat>(), and B<lstat>()\(emexecute (search) permission is required on all of the directories in I<pathname> that lead to the file.
de: Diese Funktionen geben Informationen über eine Datei im Puffer zurück, auf den I<Statuspuffer> zeigt. Dazu werden keinerlei Rechte an der angegebenen Datei benötigt, aber – im Falle von B<stat>(), B<fstatat>() und B<lstat>() – müssen alle Verzeichnisse im I<Pfadnamen>, der zu der Datei führt, durchsucht werden dürfen.
nl: Deze functies retourneren informatie over een bestand in de buffer aangewezen door I<statbuf>. Er zijn geen rechten vereist op het bestand zelf, maar \(emin het geval van B<stat>(), B<fstatat>() en B<lstat>()\(em zijn uitvoer (zoek) rechten vereist op alle mappen in I<padnaam> die naar het bestand leiden.

source: B<stat>() and B<fstatat>() retrieve information about the file pointed to by I<pathname>; the differences for B<fstatat>() are described below.
de: B<stat>() und B<fstatat>() liefern die Informationen zu der in I<Pfadname> angegebenen Datei und übergibt diese an I<fstatat>(), wie nachfolgend beschrieben.
nl: B<stat>() en B<fstatat>() geven informatie over het bestand aangewezen door I<padnaam>; de verschillen voor B<fstatat>() worden hieronder beschreven.

source: B<lstat>() is identical to B<stat>(), except that if I<pathname> is a symbolic link, then it returns information about the link itself, not the file that the link refers to.
de: B<lstat>() ist ähnlich B<stat>(), nur dass falls I<Pfadname> ein symbolischer Link ist, Informationen zum Link zurückgegeben werden und nicht zur Datei, auf die der Link zeigt.
nl: B<lstat>() is gelijk aan B<stat>(), behalve dat als I<padnaam> een symbolische koppeling is, dan informatie over de koppeling zéqlf wordt teruggegeven, en niet van het bestand waar naar verwezen wordt.

source: B<fstat>() is identical to B<stat>(), except that the file about which information is to be retrieved is specified by the file descriptor I<fd>.
de: B<fstat> ist ähnlich B<stat>, außer dass die Datei, zu der Informationen ermittelt werden sollen, durch den Dateideskriptor I<dd> angegeben wird.
nl: B<fstat>() is gelijk aan B<stat>(), behalve dat het bestand van welk de informatie wordt opgevraagd wordt gespecificeerd door de bestandsindicator I<fd>.

source: The stat structure
de: Die Struktur stat
nl: De stat structuur

source: All of these system calls return a I<stat> structure (see B<stat>(3type)).
de: Alle diese Systemaufrufe geben eine Struktur I<stat> zurück, siehe B<stat>(3type)).

source: I<Note>: for performance and simplicity reasons, different fields in the I<stat> structure may contain state information from different moments during the execution of the system call. For example, if I<st_mode> or I<st_uid> is changed by another process by calling B<chmod>(2) or B<chown>(2), B<stat>() might return the old I<st_mode> together with the new I<st_uid>, or the old I<st_uid> together with the new I<st_mode>.
de: I<Hinweis>: Zur Leistungsverbesserung und aus Einfachheitsgründen können verschiedene Felder in der Struktur I<stat> Zustandsinformationen von verschiedenen Zeitpunkten während der Ausführung des Systemaufrufs enthalten. Wird beispielsweise I<st_mode> oder I<st_uid> von einem anderen Prozess während der Ausführung des Systemaufrufs durch Aufruf von B<chmod>(2) oder B<chown>(2) geändert, dann könnte B<stat>() den alten I<st_mode> zusammen mit dem neuen I<st_uid> oder den alten I<st_uid> zusammen mit dem neuen I<st_mode> zurückliefern.
nl: I<Opmerking>: vanwege prestatie redenen en vanwege de eenvoud, mogen diverse velden in de I<stat> structuur status informatie bevatten over verschillende momenten gedurende de uitvoer van de systeem aanroep. Bijvoorbeeld, als I<st_mode> of I<st_uid> werd veranderd door een ander proces door de aanroep van B<chmod>(2) of B<chown>(2), dan mag B<stat>(2) de oude I<st_mode> teruggeven, samen met de nieuwe I<st_uid>, of de oude I<st_uid> samen met de nieuwe I<st_mode>.

source: The B<fstatat>() system call is a more general interface for accessing file information which can still provide exactly the behavior of each of B<stat>(), B<lstat>(), and B<fstat>().
de: Der Systemaufruf B<fstatat>() ist eine allgemeinere Schnittstelle zum Zugriff auf Dateiinformationen, die immer noch das gleiche Verhalten wie einer aus B<stat>(), B<lstat>() und B<fstat>() bereitstellen kann.
nl: De B<fstatat>() systeem aanroep is een meer algemeen interface voor het verkrijgen van bestandsinformatie dat nog steeds exact hetzelfde gedrag kan bieden van elk van B<stat>(), B<lstat>(), and B<fstat>().

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<stat>() and B<lstat>() for a relative pathname).
de: Falls der in I<Pfadname> übergebene Pfadname relativ ist, wird er als relativ zu dem im Dateideskriptor I<Verzdd> referenzierten Verzeichnis interpretiert (statt relativ zum aktuellen Arbeitsverzeichnis des aufrufenden Prozesses, wie es bei B<stat>() und B<lstat>() für einen relativen Pfadnamen erfolgt).
nl: Als de padnaam opgegeven in I<padnaam> relatief is, dan wordt deze geïnterpreteerd als relatief aan de map aangewezen door de bestandsindicator I<dirfd> (in plaats van relatief ten opzichte van de huidige werkmap van het aanroepende proces, zoals dit gedaan wordt door B<stat>() en B<lstat>() voor een relatieve padnaam).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<stat>() and B<lstat>()).
de: Falls I<Pfadname> relativ ist und I<Verzdd> den besonderen Wert B<AT_FDCWD> annimmt, wird I<Pfadname> als relativ zum aktuellen Arbeitsverzeichnis des aufrufenden Prozesses interpretiert (wie B<stat>() und B<lstat>()).
nl: Als I<padnaam> relatief is en I<dirfd> heeft de speciale waarde B<AT_FDCWD>, dan wordt I<padnaam> geïnterpreteerd als relatief ten opzichte van de huidige werkmap van het aanroepende proces (zoals B<stat>() en B<lstat>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
de: Falls I<Pfadname> absolut ist, wird I<Verzdd> ignoriert.
nl: Als I<padnaam> absoluut is, dan wordt I<mapbi> genegeerd.

source: I<flags> can either be 0, or include one or more of the following flags ORed:
de: I<Schalter> kann entweder 0 sein oder durch bitweises ODER eines oder mehrere der folgenden Schalter gesetzt haben:
nl: I<vlaggen> kan ofwel 0 zijn, of kan een of meer van de volgende vlaggen ORed bevatten:

source: B<AT_EMPTY_PATH> (since Linux 2.6.39)
de: B<AT_EMPTY_PATH> (seit Linux 2.6.39)
nl: B<AT_EMPTY_PATH> (vanaf Linux 2.6.39)

source: If I<pathname> is an empty string, operate on the file referred to by I<dirfd> (which may have been obtained using the B<open>(2) B<O_PATH> flag). In this case, I<dirfd> can refer to any type of file, not just a directory, and the behavior of B<fstatat>() is similar to that of B<fstat>(). If I<dirfd> is B<AT_FDCWD>, the call operates on the current working directory. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
de: Falls I<Pfadname> eine leere Zeichenkette ist, wird mit der Datei gearbeitet, auf die I<Verzdd> verweist (dies kann mit dem B<O_PATH>-Schalter von B<open>(2) ermittelt werden). In diesem Fall kann sich I<Verzdd> auf jeden Dateityp beziehen, nicht nur einem Verzeichnis und das Verhalten von B<fstatat>() ist ähnlich zu dem von B<fstat>(). Falls I<Verzdd> B<AT_FDCWD> ist, erfolgt der Aufruf im aktuellen Arbeitsverzeichnis. Dieser Schalter ist Linux-spezifisch; definieren Sie B<_GNU_SOURCE>, um dessen Definition zu ermitteln.
nl: Als I<padnaam> een lege tekenreeks is, werk dan op het bestand aangewezen doorzoek I<dirfd> (die kan zijn verkregen door het gebruik van B<open>(2) B<O_PATH> vlag). In dit geval kan I<dirfd> naar elk type bestand wijzen, niet slechts een map, en het gedrag van B<fstatat>() is vergelijkbaar met dat van B<fstat>(). Als I<dirfd> gelijk is aan B<AT_FDCWD>, dan werkt de aanroep op de huidige werkmap. Deze vlag is Linux-specifiek; definieer B<_GNU_SOURCE> om de definiete te verkrijgen.

source: B<AT_NO_AUTOMOUNT> (since Linux 2.6.38)
de: B<AT_NO_AUTOMOUNT> (seit Linux 2.6.38)
nl: B<AT_NO_AUTOMOUNT> (vanaf Linux 2.6.38)

source: If I<pathname> is a symbolic link, do not dereference it: instead return information about the link itself, like B<lstat>(). (By default, B<fstatat>() dereferences symbolic links, like B<stat>().)
de: Falls I<Pfadname> ein symbolischer Link ist, wird er nicht dereferenziert: Stattdessen werden Informationen zum Link selbst zurückgegeben, wie B<lstat>(). In der Voreinstellung dereferenziert B<fstatat>() symbolische Links, wie auch B<stat>().
nl: Als I<padnaam> een symbolische koppeling is, volg deze niet: in plaats daarvan retourneer informatie over de koppeling zelf, zoals B<lstat>(). (Standaard volgt B<fstatat>() symbolische koppelingen, net als B<stat>().)

source: See B<openat>(2) for an explanation of the need for B<fstatat>().
de: Lesen Sie B<openat>(2) für eine Beschreibung der Notwendigkeit von B<fstatat>().
nl: Zie B<openat>(2) voor een uitleg over de noodzaak van B<fstatat>().

source: RETURN VALUE
de: RÜCKGABEWERT
nl: EIND WAARDE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: ERRORS
de: FEHLER
nl: FOUTEN

source: Search permission is denied for one of the directories in the path prefix of I<pathname>. (See also B<path_resolution>(7).)
de: Der Suchzugriff auf eines der Verzeichnisse im Pfadpräfix von I<Pfadname> wurde verweigert (siehe auch B<path_resolution>(7)).
nl: Het doorzoek recht werd geweigerd voor een van de mappen in de pad voorvoegsel van I<padnaam>. (Zie ook B<path_resolution>(7).)

source: I<fd> is not a valid open file descriptor.
de: I<dd> ist kein zulässiger offener Dateideskriptor.
nl: I<bi> is niet een geldige open-voor-schrijven bestandindicator.

source: (B<fstatat>()) I<pathname> is relative but I<dirfd> is neither B<AT_FDCWD> nor a valid file descriptor.
de: (B<fstatat>()) Der I<Pfadname> ist relativ, aber I<Verzdd> ist weder B<AT_FDCWD> noch ein gültiger Dateideskriptor.
nl: (B<fstatat>()) I<padnaam> is relatief maar I<dirfd> is noch B<AT_FDCWD> noch een geldige bestandsindicator.

source: Bad address.
de: Ungültige Adresse.
nl: Verkeerd adres.

source: (B<fstatat>()) Invalid flag specified in I<flags>.
de: (B<fstatat>()) Unzulässiger Schalter in I<Schalter> angegeben.
nl: (B<fstatat>()) Ongeldige vlag opgegeven in I<vlaggen>.

source: Too many symbolic links encountered while traversing the path.
de: Beim Pfaddurchlauf wurden zu viele symbolische Links gefunden.
nl: Teveel symbolische koppelingen werden tegengekomen bij het doorlopen van I<padnaam>.

source: I<pathname> is too long.
de: I<Pfadname> ist zu lang.
nl: I<padnaam> is te lang.

source: A component of I<pathname> does not exist or is a dangling symbolic link.
de: Eine Komponente von I<Pfadname> existiert nicht oder ist ein toter symbolischer Link.
nl: Een map-deel van I<padnaam> zou toegankelijk geweest zijn maar bestaat niet of was een zwevende symbolische koppeling.

source: I<pathname> is an empty string and B<AT_EMPTY_PATH> was not specified in I<flags>.
de: I<Pfadname> ist die leere Zeichenkette und B<AT_EMPTY_PATH> wurde in I<Schalter> nicht angegeben.
nl: I<padnaam> is een lege tekenreeks en B<AT_EMPTY_PATH> werd niet opgegeven in I<vlaggen>.

source: Out of memory (i.e., kernel memory).
de: Kein Speicher mehr (das bedeutet Speicher im Kernel).
nl: Geheugen is op (kernel geheugen).

source: A component of the path prefix of I<pathname> is not a directory.
de: Eine Komponente des Pfadpräfixes von I<Pfadname> ist kein Verzeichnis.
nl: Een onderdeel in het pad voorvoegsel in I<padnaam> is geen map.

source: (B<fstatat>()) I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
de: (B<fstatat>()) I<Pfadname> ist relativ und I<Verzdd> ist ein Dateideskriptor, der sich auf eine Datei bezieht, die kein Verzeichnis ist.
nl: (B<fstatat>()) I<padnaam> is relatief en I<mapbi> is een bestandsindicator die naar een bestand wijst dat geen map is.

source: I<pathname> or I<fd> refers to a file whose size, inode number, or number of blocks cannot be represented in, respectively, the types I<off_t>, I<ino_t>, or I<blkcnt_t>. This error can occur when, for example, an application compiled on a 32-bit platform without I<-D_FILE_OFFSET_BITS=64> calls B<stat>() on a file whose size exceeds I<(1E<lt>E<lt>31)-1> bytes.
de: I<Pfadname> oder I<dd> bezieht sich auf eine Datei, deren Name, Inode-Anzahl oder Anzahl der Blöcke nicht durch die Typen I<off_t>, I<ino_t> oder I<blkcnt_t> repräsentiert werden kann. Dieser Fehler kann beispielsweise auftreten, wenn eine auf einer 32-bit-Plattform kompilierte Anwendung ohne I<-D_FILE_OFFSET_BITS=64> B<stat>() für eine Datei aufruft, deren Größe I<(1E<lt>E<lt>31)-1> Byte übersteigt.
nl: I<padnaam> of I<fd> wijst naar een bestand waarvan grootte, inode nummer of aantal blokken niet kan worden gerepresenteerd in respectievelijk de velden I<off_t>, I<ino_t>, of I<blkcnt_t>. Deze fout kan optreden wanneer bij voorbeeld een applicatie die compileert werd op een 32-bit platform zonder I<-D_FILE_OFFSET_BITS=64>, B<stat>() aanroept op een bestand waarvan de grootte meer is dan I<(1E<lt>E<lt>31)-1> bytes.

source: VERSIONS
de: VERSIONEN
nl: VERSIES

source: B<fstatat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
de: B<fstatat>() wurde zu Linux in Kernel 2.6.16 hinzugefügt; Bibliotheksunterstützung wurde zu Glibc in Version 2.4 hinzugefügt.
nl: B<fstatat>() werd toegevoegd aan Linux in kernel 2.6.16; bibliotheek ondersteuning werd toegevoegd aan glibc in versie 2.4.

source: According to POSIX.1-2001, B<lstat>() on a symbolic link need return valid information only in the I<st_size> field and the file type of the I<st_mode> field of the I<stat> structure. POSIX.1-2008 tightens the specification, requiring B<lstat>() to return valid information in all fields except the mode bits in I<st_mode>.
de: Entsprechend POSIX.1-2001 benötigt B<lstat>() bei Anwendung auf einen symbolischen Link lediglich im Feld I<st_size> und im Dateityp des I<st_mode>-Feldes der I<stat>-Struktur gültige Rückgabeinformationen. POSIX.1-2008 engt diese Spezifikation ein, indem B<lstat>() in allen Feldern außer den Modus-Bits in I<st_mode> gültige Informationen zurückgeben muss.
nl: Volgens POSIX.1-2001, moet B<lstat>() voor een symbolische koppeling geldige informatie retourneren in het I<st_size> veld en het bestandstype van het I<st_mode> veld van de I<stat> structure. POSIX.1-2008 vernauwt deze specificatie door te vereisen dat B<lstat>() geldige informatie moet retourneren in alle velden behalve de mode bits in I<st_mode>.

source: Use of the I<st_blocks> and I<st_blksize> fields may be less portable. (They were introduced in BSD. The interpretation differs between systems, and possibly on a single system when NFS mounts are involved.)
de: Die Verwendung der Felder I<st_blocks> und I<st_blksize> kann die Portabilität einschränken. Diese wurden in BSD eingeführt. Die Interpretation unterscheidet sich auf verschiedenen Systemen, und möglicherweise auf einem einzelnen System, wenn NFS-Einhängungen bestehen.
nl: Gebruik van de I<st_blocks> en I<st_blksize> velden is minder overdraagbaar. (Deze werden geïntroduceerd in BSD. De interpretatie verschilt tussen systemen, en mogelijk zelfs op een enkel systeem waar NFS koppelingen gebruikt worden.)

source: NOTES
de: ANMERKUNGEN
nl: OPMERKINGEN

source: C library/kernel differences
de: Unterschiede C-Bibliothek/Kernel
nl: C library/kernel verschillen

source: Over time, increases in the size of the I<stat> structure have led to three successive versions of B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>), and I<sys_stat64()> (slot I<__NR_stat64>) on 32-bit platforms such as i386. The first two versions were already present in Linux 1.0 (albeit with different names); the last was added in Linux 2.4. Similar remarks apply for B<fstat>() and B<lstat>().
de: Mit der Zeit führte der Größenzuwachs der I<stat>-Struktur auf 32-Bit-Plattformen wie i386 zu drei Folgeversionen von B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>) und I<sys_stat64()> (slot I<__NR_stat64>). Die ersten zwei Versionen waren bereits in Linux 1.0. (allerdings mit anderen Namen) verfügbar; die letzte wurde in Linux 2.4 hinzugefügt. Ähnliches gilt für B<fstat>() und B<lstat>().
nl: In de loop van de tijd hebben vergrotingen van de I<stat> structure geleid tot drie opeenvolgende versies van B<stat>(0: I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>), en I<sys_stat64()> (slot I<__NR_stat64>) op 32-bit platformen zoals i386. De eerste twee versies waren al aanwezig in Linux 1.0 (hoewel met verschillende namen); de laatste werd toegevoegd in Linux 2.4. Vergelijkbare opmerkingen zijn van toepassing op B<fstat>() en B<lstat>().

source: The kernel-internal versions of the I<stat> structure dealt with by the different versions are, respectively:
de: Die Kernel-interne Version der Struktur I<stat> handhabte drei verschieden Versionen, und zwar:
nl: De interne kernel versies van de I<stat> structure die behandelt worden door de verschillende versies, zijn respectievelijk:

source: The original structure, with rather narrow fields, and no padding.
de: Die ursprüngliche Struktur, mit eher engen Felder und keiner Auffüllung.
nl: De originele structure, met nogal kleine velden en zonder opvulling.

source: Larger I<st_ino> field and padding added to various parts of the structure to allow for future expansion.
de: Größeres Feld I<st_ino> mit ergänzter Auffüllung an verschiedenen Teilen der Struktur, um zukünftige Erweiterungen zu erlauben.
nl: Een groter I<st_ino> veld en opvulling toegevoegd aan verschillende delen van de structure om toekomstige uitbreidingen toe te staan.

source: Even larger I<st_ino> field, larger I<st_uid> and I<st_gid> fields to accommodate the Linux-2.4 expansion of UIDs and GIDs to 32 bits, and various other enlarged fields and further padding in the structure. (Various padding bytes were eventually consumed in Linux 2.6, with the advent of 32-bit device IDs and nanosecond components for the timestamp fields.)
de: Noch größeres Feld I<st_ino>, größere Felder I<st_uid> und I<st_gid>, um der Linux-2.4-Erweiterung der UIDs und GIDs auf 32 bit Platz zu schaffen, und verschiedene andere vergrößerte Felder und weitere Auffüllungen in der Struktur. (Verschiedene Auffüllbytes wurden schließlich in Linux 2.6 mit dem Aufkommen von 32-bit-Gerätekennungen und Nanosekundenkomponenten der Zeitstempelfelder benutzt.)
nl: Een nog groter I<st_ino> veld, grotere I<st_uid> en I<st_gid> velden om in de expansie van UID´s EN GID´s naar 32 bits door Linux-2.4 te voorzien, en verschillende andere vergrote velden en meer opvulling in de structure. (Diverse opvul bytes werden geconsumeerd in Linux 2.6, met de aankomst van 32-bit apparaat ID´s en nanoseconden componenten in de tijdstempel velden.)

source: The glibc B<stat>() wrapper function hides these details from applications, invoking the most recent version of the system call provided by the kernel, and repacking the returned information if required for old binaries.
de: Die Wrapperfunktion der Glibc B<stat>() versteckt diese Details vor Anwendungen. Sie ruft die neuste Version des vom Kernel bereitgestellten Systemaufrufs auf und packt die zurückgelieferten Informationen neu, falls dies für alte Programme benötigt wird.
nl: De glibc B<stat>() omwikkel functies verbergen deze details van de applicaties, door het aanroepen van de meest recente versie van de systeem aanroep die door de kernel beschikbaar wordt gesteld en het opnieuw inpakken van de verkregen informatie indien nodig voor oude toepassingen.
