Repository: sebras/manpages-l10n
Catalog: po/*/man2/stat.2.po
Languages: de, nl

source: || /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
de: || /* Seit Glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
nl: || /* Sinds glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: B<lstat>() is identical to B<stat>(), except that if I<pathname> is a symbolic link, then it returns information about the link itself, not the file that it refers to.
de: B<lstat>() ist ähnlich B<stat>(), nur dass falls I<Pfadname> ein symbolischer Link ist, Informationen zum Link zurückgegeben werden und nicht zur Datei, auf die der Link zeigt.
nl: B<lstat>() is gelijk aan B<stat>(), behalve dat als I<padnaam> een symbolische koppeling is, dan geeft deze informatie terug over de koppeling zelf, en niet over het bestand waar deze naar wijst.

source: This is the file's last access timestamp.
de: Dies ist der Zeitstempel des letzten Dateizugriffs.
nl: Dit is de laatste tijd van toegang van het bestand.

source: This is the file's last modification timestamp.
de: Dies ist der Zeitstempel der letzten Dateiveränderung.
nl: Dit is de laatste modificatie tijd van het bestand.

source: This is the file's last status change timestamp.
de: Dies ist der Zeitstempel der letzten Dateistatusveränderung.
nl: Dit is het laatste tijdstip van status verandering van het bestand.

source: Don't automount the terminal ("basename") component of I<pathname> if it is a directory that is an automount point. This allows the caller to gather attributes of an automount point (rather than the location it would mount). Since Linux 4.14, also don't instantiate a nonexistent name in an on-demand directory such as used for automounter indirect maps. This flag can be used in tools that scan directories to prevent mass-automounting of a directory of automount points. The B<AT_NO_AUTOMOUNT> flag has no effect if the mount point has already been mounted over. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition. Both B<stat>() and B<lstat>() act as though B<AT_NO_AUTOMOUNT> was set.
de: Die Terminal-»basename«-Komponente von I<Pfadname> wird nicht automatisch eingehängt, wenn es ein Verzeichnis ist, das selbst ein Selbsteinhängepunkt ist. Dies ermöglicht dem Aufrufenden, Informationen zu einem Auto-Einhängepunkt zu sammeln, anstatt zu dem Ort, der eingehängt werden würde. Seit Linux 4.14 realisiert dies keinen nicht existierenden Namen in einem bei-Bedarf-Verzeichnis, sie für indirekte Zuordnungen von Selbsteinhängeprogrammen verwandt werden. Dieser Schalter kann in Werkzeugen verwendet werden, die Verzeichnisse einlesen, um automatische Masseneinhängungen eines Verzeichnisses zu verhindern, welches Auto-Einhängepunkte enthält. Der Schalter B<AT_NO_AUTOMOUNT> ist unwirksam, wenn der Einhängepunkt bereits eingehängt wurde. Dieser Schalter ist Linux-spezifisch; definieren Sie B<_GNU_SOURCE>, um dessen Definition zu ermitteln. Sowohl B<stat>() und B<lstat>() handeln, als ob B<AT_NO_AUTOMOUNT> gesetzt worden wäre.
nl: Koppel de uiteinde ("basename") component uit I<padnaam> niet aan, als het een map is in een automatisch aankoppelpunt. Dit maakt het mogelijk dat de aanroeper attributen van het aankoppelpunt kan verzamelen (in plaats van over de locatie die zou worden aangekoppeld). Instantieer vanaf Linux 4.14 ook geen niet bestaande naam in op-aanvraag mappen zoals gebruikt in mappen met automatische aankoppelpunten. Deze vlag kan worden gebruikt in hulpmiddelen die mappen scannen om te voorkomen van massa-aankoppelingen in een map van aankoppelpunten. De B<AT_NO_AUTOMOUNT> vlag heeft geen effect als het aankoppelpunt al was gebruikt. Deze vlag is Linux-specifiek; definieer B<_GNU_SOURCE> om zijn definitie te verkrijgen. Beide B<stat>() en B<lstat>() werken alsof B<AT_NO_AUTOMOUNT> was gezet.

source: A component of I<pathname> does not exist, or I<pathname> is an empty string and B<AT_EMPTY_PATH> was not specified in I<flags>.
de: Eine Komponente von I<Pfadname> existiert nicht oder I<Pfadname> ist eine leere Zeichenkette und B<AT_EMPTY_PATH> wurde nicht in I<Schalter> angegeben.
nl: Een onderdeel van I<padnaam> bestaat niet, of I<padnaam> is een lege tekenreeks en B<AT_EMPTY_PATH> werd niet opgegeven in I<vlaggen>.

source: EXAMPLE
de: BEISPIEL
nl: VOORBEELD

source: printf("ID of containing device: [%lx,%lx]\en", (long) major(sb.st_dev), (long) minor(sb.st_dev));
de: printf("Kennung des enthaltenen Gerätes: [%lx,%lx]\en", (long) major(sb.st_dev), (long) minor(sb.st_dev));

source: printf("Mode: %lo (octal)\en", (unsigned long) sb.st_mode);
de: printf("Modus: %lo (oktal)\en", (unsigned long) sb.st_mode);

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: printf("Preferred I/O block size: %jd bytes\en", (intmax_t) sb.st_blksize); printf("File size: %jd bytes\en", (intmax_t) sb.st_size); printf("Blocks allocated: %jd\en", (intmax_t) sb.st_blocks);
nl: printf("Voorkeur I/O blok grootte: %jd bytes\en", (intmax_t) sb.st_blksize); printf("Bestandsgrootte: %jd bytes\en", (intmax_t) sb.st_size); printf("Toegewezen blokken: %jd\en", (intmax_t) sb.st_blocks);
