Repository: sebras/manpages-l10n
Catalog: po/*/man2/swapon.2.po
Languages: it

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux

source: NAME
it: NOME

source: swapon, swapoff - start/stop swapping to file/device
it: swapon, swapoff - start/stop swapping sul file/dispositivo

source: SYNOPSIS
it: SINTASSI

source: DESCRIPTION
it: DESCRIZIONE

source: B<swapon>() sets the swap area to the file or block device specified by I<path>. B<swapoff>() stops swapping to the file or block device specified by I<path>.
it: B<swapon>() imposta lo swap sul dispositivo a blocchi o sul file specificato in I<path>. B<swapoff>() ferma lo swap sul dispositivo a blocchi o sul file specificato in I<path>.

source: If the B<SWAP_FLAG_PREFER> flag is specified in the B<swapon>() I<swapflags> argument, the new swap area will have a higher priority than default. The priority is encoded within I<swapflags> as:
it: Se nell'argomento I<swapflags> di B<swapon>() è specificata l'opzione B<SWAP_FLAG_PREFER>, la nuova area di swap avrà una priorità maggiore di quella predefinita. La priorità è codificata in I<swapflags> come:

source: If the B<SWAP_FLAG_DISCARD> flag is specified in the B<swapon>() I<swapflags> argument, freed swap pages will be discarded before they are reused, if the swap device supports the discard or trim operation. (This may improve performance on some Solid State Devices, but often it does not.) See also NOTES.
it: Se nell'argomento I<swapflags> di B<swapon>() è specificata l'opzione B<SWAP_FLAG_DISCARD>, le pagine di swap liberate saranno segnate come scartate prima di essere riutilizzate, se il dispositivo di swap supporta l'operazione discard o trim. (Questo potrebbe migliorare le prestazioni di alcuni Dispositivi a Stato Solido, ma spesso non avviene). Vedere anche la sezione NOTE.

source: These functions may be used only by a privileged process (one having the B<CAP_SYS_ADMIN> capability).
it: Queste funzioni possono essere usate solo da un processo privilegiato (uno che ha le funzionalità B<CAP_SYS_ADMIN>).

source: Priority
it: Priorità

source: Each swap area has a priority, either high or low. The default priority is low. Within the low-priority areas, newer areas are even lower priority than older areas.
it: Ogni area di swap ha una sua priorità, sia essa alta o bassa. Quella predefinita è bassa. Tra le aree a bassa priorità le aree più nuove hanno sempre una priorità più bassa delle aree più vecchie.

source: All priorities set with I<swapflags> are high-priority, higher than default. They may have any nonnegative value chosen by the caller. Higher numbers mean higher priority.
it: Tutte le priorità impostate attraverso I<swapflags> sono ad alta prorità, più alta di quella predefinita. Esse possono avere qualunque valore non negativo scelto dal chiamante. A numero maggiore corrisponde priorità maggiore.

source: Swap pages are allocated from areas in priority order, highest priority first. For areas with different priorities, a higher-priority area is exhausted before using a lower-priority area. If two or more areas have the same priority, and it is the highest priority available, pages are allocated on a round-robin basis between them.
it: Le pagine di swap sono allocate in aree in ordine di priorità, prima quelle con priorità maggiore. Per aree aventi priorità diverse, un'area con priorità più alta viene esaurita prima che venga usata un'area a priorità più bassa. Se vi sono due o più aree con la stessa priorità, ed è la massima priorità disponibile, le pagine sono allocate secondo uno schema a "round-robin".

source: As of Linux 1.3.6, the kernel usually follows these rules, but there are exceptions.
it: Fino al kernel 1.3.6, si seguivano queste regole, ma con alcune eccezioni.

source: RETURN VALUE
it: VALORE RESTITUITO

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato per indicare l'errore.

source: ERRORS
it: ERRORI

source: (for B<swapon>()) The specified I<path> is already being used as a swap area.
it: (per B<swapon>()) Il I<percorso> specificato è già stato usato come area di swap.

source: The file I<path> exists, but refers neither to a regular file nor to a block device;
it: Il I<percorso> del file esiste, ma non fa riferimento nè a un file regolare, nè a un dispositivo a blocchi.

source: (B<swapon>()) The indicated path does not contain a valid swap signature or resides on an in-memory filesystem such as B<tmpfs>(5).
it: (B<swapon>()) Il percorso indicato non contiene una firma di swap valida o risiede in un filesystem in memoria come B<tmpfs>(5).

source: B<EINVAL> (since Linux 3.4)
it: B<EINVAL> (a partire da Linux 3.4)

source: (B<swapon>()) An invalid flag value was specified in I<swapflags>.
it: (B<swapon>()) Un valore di opzione non valido è sato specificato in I<swapflags>.

source: (B<swapoff>()) I<path> is not currently a swap area.
it: (B<swapoff>()) I<percorso> attualmente non è un'area di swap.

source: The system-wide limit on the total number of open files has been reached.
it: E' stato raggiunto il limite per l'intero sistema sul numero totale di file aperti.

source: The file I<path> does not exist.
it: Il I<percorso> del file non esiste.

source: The system has insufficient memory to start swapping.
it: Il sistema ha memoria insufficiente per iniziare lo swapping.

source: The caller does not have the B<CAP_SYS_ADMIN> capability. Alternatively, the maximum number of swap files are already in use; see NOTES below.
it: Il chiamante non ha la funzionalità B<CAP_SYS_ADMIN>. In alternativa, il numero massimo di file di swap è già in uso; vedere le NOTE sotto.

source: CONFORMING TO
it: CONFORME A

source: These functions are Linux-specific and should not be used in programs intended to be portable. The second I<swapflags> argument was introduced in Linux 1.3.2.
it: Queste funzioni sono specifiche di Linux e non devono essere usate in programmi pensati per essere portabili. Il secondo argomento I<swapflags> è stato introdotto in Linux 1.3.2.

source: NOTES
it: NOTE

source: The partition or path must be prepared with B<mkswap>(8).
it: La partizione o percorso devono essere preparati con B<mkswap>(8).

source: There is an upper limit on the number of swap files that may be used, defined by the kernel constant B<MAX_SWAPFILES>. Before kernel 2.4.10, B<MAX_SWAPFILES> has the value 8; since kernel 2.4.10, it has the value 32. Since kernel 2.6.18, the limit is decreased by 2 (thus: 30) if the kernel is built with the B<CONFIG_MIGRATION> option (which reserves two swap table entries for the page migration features of B<mbind>(2) and B<migrate_pages>(2)). Since kernel 2.6.32, the limit is further decreased by 1 if the kernel is built with the B<CONFIG_MEMORY_FAILURE> option.
it: C'è un limite superiore al numero di file di swap che si possono usare, definito dalla costante del kernel B<MAX_SWAPFILES>. Prima del kernel 2.4.10, il valore di B<MAX_SWAPFILES> era 8; dal kernel 2.4.10 il valore è 32. A partire dal kernel 2.6.18 il limite è sceso di due unità (quindi: 30) se il kernel è compilato con l'opzione B<CONFIG_MIGRATION> (che riserva due voci nella tabella di swap per le funzionalità di migrazione di pagina del comando B<mbind>(2) e B<migrate_pages>(2)). A partire dal kernel 2.6.32, il limite è sceso ulteriormente di 1 se il kernel è compilato con l'opzione B<CONFIG_MEMORY_FAILURE>.

source: Discard of swap pages was introduced in kernel 2.6.29, then made conditional on the B<SWAP_FLAG_DISCARD> flag in kernel 2.6.36, which still discards the entire swap area when B<swapon>() is called, even if that flag bit is not set.
it: Lo scarto di pagine di swap è stato introdotto nel kernel 2.6.29 e reso in seguito dipendente dall'opzione B<SWAP_FLAG_DISCARD> nel kernel 2.6.36, che scarta ancora l'intera area di swap quando B<swapon>() viene chiamato, anche se il bit dell'opzione non è impostato.

source: SEE ALSO
it: VEDERE ANCHE

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.12 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato di conseguenza.

source: (B<swapon>()) An invalid flag value was specified in I<flags>.
it: (B<swapon>()) Un valore di opzione non valido è sato specificato in I<flags>.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.04 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
