Repository: sebras/manpages-l10n
Catalog: po/*/man2/symlink.2.po
Languages: it, nl

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux
nl: Linux Programmeurs Handleiding

source: NAME
it: NOME
nl: NAAM

source: symlink, symlinkat - make a new name for a file
it: symlink, symlinkat - crea un nuovo nome per un file
nl: symlink, symlinkat - maak een nieuwe naam voor een bestand

source: SYNOPSIS
it: SINTASSI
nl: SAMENVATTING

source: B<int symlink(const char *>I<target>B<, const char *>I<linkpath>B<);>
nl: B<int symlink(const char *>I<oudpad>B<, const char *>I<nieuwpad>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of B<AT_*> constants */ B<#include E<lt>unistd.hE<gt>>
it: B<#include E<lt>fcntl.hE<gt> >/* Definizione delle costanti B<AT_*> */ B<#include E<lt>unistd.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van B<AT_*> constanten */ B<#include E<lt>unistd.hE<gt>>

source: B<int symlinkat(const char *>I<target>B<, int >I<newdirfd>B<, const char *>I<linkpath>B<);>
nl: B<int symlinkat(const char *>I<oudpad>B<, int >I<nieuwmapbi>B<, const char *>I<nieuwpad>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
it: Macro per test di funzionalità per glibc (vedere B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: Since glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Before glibc 2.10: _ATFILE_SOURCE
it: A partire da glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Prima di glibc 2.10: _ATFILE_SOURCE
nl: Vanaf glibc 2.10: _POSIX_C_SOURCE E<gt>= 200809L Voor glibc 2.10: _ATFILE_SOURCE

source: DESCRIPTION
it: DESCRIZIONE
nl: BESCHRIJVING

source: B<symlink>() creates a symbolic link named I<linkpath> which contains the string I<target>.
it: B<symlink>() crea un collegamento simbolico con nome I<linkpath> che contiene la stringa I<target>.
nl: B<symlink>() maakt een symbolische koppeling genaamd I<nieuwpad> die het karakter-string I<oudpad> bevat.

source: Symbolic links are interpreted at run time as if the contents of the link had been substituted into the path being followed to find a file or directory.
it: I collegamenti simbolici sono interpretati all'esecuzione come se il contenuto del collegamento fosse stato sostituito nel percorso seguito per trovare un file o una directory.
nl: Symbolische koppelingen worden geïnterpreteerd tijdens draaien, alsof de inhoud van de koppeling vervangen werd door het pad dat gevolgd werd om een bestand of map te vinden.

source: Symbolic links may contain I<..> path components, which (if used at the start of the link) refer to the parent directories of that in which the link resides.
it: Un collegamento simbolico può contenere I<..> come componente del percorso, che (se usato all'inizio del collegamento) fa riferimento alle directory superiori a quella nella quale risiede il collegamento.
nl: Symbolische koppelingen kunnen B<..> pad onderdelen bevatten, die (als ze gebruikt worden aan het begin van de koppeling) wijzen naar de ouder mappen van die waarin de koppeling staat.

source: A symbolic link (also known as a soft link) may point to an existing file or to a nonexistent one; the latter case is known as a dangling link.
it: Un collegamento simbolico (conosciuto anche come soft link) può puntare ad un file esistente o ad uno non esistente: in quest'ultimo caso è detto dangling link.
nl: Een symbolische koppeling (ook bekend als zachte koppeling) mag wijzen naar een bestaand bestand of naar een niet bestaand; het laatste geval staat bekend als een loshangende koppeling.

source: The permissions of a symbolic link are irrelevant; the ownership is ignored when following the link, but is checked when removal or renaming of the link is requested and the link is in a directory with the sticky bit (B<S_ISVTX>) set.
it: I permessi di un collegamento simbolico sono irrilevanti. Quando si segue il collegamento il proprietario viene ignorato: viene invece verificato quando si richiede la rimozione o la rinomina del collegamento che si trovi in una directory con lo sticky bit (B<S_ISVTX>) impostato.
nl: De toestemmingen van een symbolische koppeling zijn onbelangrijk; het eigendom wordt genegeerd bij het volgen van de koppeling, maar wordt gecontroleerd als verwijdering of hernoemen van de koppeling wordt gevraagd en als de koppeling in een map staat met het sticky bit (B<S_ISVTX>) gezet.

source: If I<linkpath> exists, it will I<not> be overwritten.
it: Se I<linkpath> esiste I<non> verrà sovrascritto.
nl: Als I<nieuwpad> bestaat zal het I<niet> overschreven worden.

source: The B<symlinkat>() system call operates in exactly the same way as B<symlink>(), except for the differences described here.
it: La chiamata di sistema B<symlinkat>() opera esattamente nello stesso modo di B<symlink>(), tranne che per le differenze di seguito descritte.
nl: De B<symlinkat>() systeem aanroep functioneert op exact dezelfde manier als B<sysmlink>(), behalve voor die verschillen zoals hier beschreven.

source: If the pathname given in I<linkpath> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<newdirfd> (rather than relative to the current working directory of the calling process, as is done by B<symlink>() for a relative pathname).
it: Se il nome di percorso dato in I<linkpath> è relativo, è interpretato come relativo alla directory a cui il descrittore di file I<newdirfd> fa riferimento (piuttosto che relativo alla directory di lavoro corrente del processo chiamante, come fa B<symlink>() per un nome di percorso relativo).
nl: Als de padnaam gegeven in I<nieuwpad> relatief is, dan wordt deze geïnterpreteerd relatief aan de map gerefereerd door de bestand beschrijving I<nieuwmapbi> (anders dan relatief aan de huidige werk map van het aanroepende proces, zoals gedaan door B<sysmlink>() voor een relatieve padnaam).

source: If I<linkpath> is relative and I<newdirfd> is the special value B<AT_FDCWD>, then I<linkpath> is interpreted relative to the current working directory of the calling process (like B<symlink>()).
it: Se I<linkpath> è relativo e I<newdirfd> è il valore speciale B<AT_FDCWD>, I<linkpath> è interpretato come relativo alla directory di lavoro corrente del processo chiamante (come B<symlink>()).
nl: Als I<nieuwpad> relatief is en I<nieuwmapbi> is gelijk aan de speciale waarde B<AT_FDCWD>, dan wordt I<nieuwpad> geïnterpreteerd relatief aan de huidige werk map van het aanroepende proces (zoals B<symlink>().

source: If I<linkpath> is absolute, then I<newdirfd> is ignored.
it: Se I<linkpath> è assoluto, I<newdirfd> è ignorato.
nl: Als I<nieuwpad> absoluut is, dan wordt I<nieuwmapbi> genegeerd.

source: See B<openat>(2) for an explanation of the need for B<symlinkat>().
nl: Zie B<openat>(2) voor de uitleg over de noodzaak van B<readlinkat>().

source: RETURN VALUE
it: VALORE RESTITUITO
nl: EIND WAARDE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato per indicare l'errore.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: ERRORS
it: ERRORI
nl: FOUTEN

source: Write access to the directory containing I<linkpath> is denied, or one of the directories in the path prefix of I<linkpath> did not allow search permission. (See also B<path_resolution>(7).)
it: Non è possibile l'accesso in scrittura alla directory contenente I<linkpath>, o una delle directory contenute nel prefisso del percorso di I<linkpath> non ha il permesso di ricerca. (Vedere anche B<path_resolution>(7).)
nl: Schrijf toegang in de map die I<nieuwpad> bevat wordt niet toegestaan, of een van de mappen in het voorvoegsel van I<nieuwpad> liet zoeken niet toe. (Zie ook B<path_resolution>(7).)

source: (B<symlinkat>()) I<linkpath> is relative but I<newdirfd> is neither B<AT_FDCWD> nor a valid file descriptor.
it: (B<symlinkat>()) I<linkpath> è relativo ma I<newdirfd> non è né B<AT_FDCWD> né un descrittore di file valido.
nl: (B<symlinkat>()) I<linkpath> is relatief maar I<nieuwmapbi> is noch B<AT_FDCWD> noch een geldige bestandsindicator.

source: The user's quota of resources on the filesystem has been exhausted. The resources could be inodes or disk blocks, depending on the filesystem implementation.
it: La quota di risorse dell'utente sul filesystem è esaurita. Le risorse possono essere inode o blocchi del disco, a seconda dell'implementazione del filesystem.
nl: De gebruikers quota van bronnen op het bestandssysteem zijn uitgeput. De bronnen kunnen inodes of blokken op de schijf zijn, afhankelijk van de implementatie van het bestandssysteem.

source: I<linkpath> already exists.
it: I<linkpath> esiste già.
nl: I<nieuwpad> bestaat al.

source: I<target> or I<linkpath> points outside your accessible address space.
it: I<target> o I<linkpath> puntano fuori dallo spazio di indirizzamento accessibile.
nl: I<oudpad> of I<nieuwpad> wijzen buiten uw toegankelijk geheugen.

source: An I/O error occurred.
it: Si è verificato errore I/O.
nl: Een Invoer/Uitvoer fout trad op.

source: Too many symbolic links were encountered in resolving I<linkpath>.
it: Si sono incontrati troppi collegamenti simbolici nella risoluzione di I<linkpath>.
nl: Teveel symbolische koppelingen werden tegengekomen bij het vaststellen van I<nieuwpad>.

source: I<target> or I<linkpath> was too long.
it: I<target> o I<linkpath> è troppo lungo.
nl: I<oudpad> of I<nieuwpad> was te lang.

source: A directory component in I<linkpath> does not exist or is a dangling symbolic link, or I<target> or I<linkpath> is an empty string.
it: Una directory contenuta in I<linkpath> non esiste o è un collegamento simbolico scollegato, o I<target> o I<linkpath> è una stringa vuota.
nl: Een map deel in I<nieuwpad> bestaat niet of is een loshangende symbolische koppeling, of I<oudpad> of I<nieuwpad> is een lege string.

source: (B<symlinkat>()) I<linkpath> is a relative pathname and I<newdirfd> refers to a directory that has been deleted.
it: (B<symlinkat>()) I<linkpath> è un percorso relativo e I<newdirfd> fa riferimento a una directory che è stata eliminata.
nl: (B<symlinkat>()) I<nieuwpad> is een relatieve padnaam en I<nieuwmapbi> wijst naar een map die werd verwijderd.

source: Insufficient kernel memory was available.
it: Insufficiente memoria disponibile per il kernel.
nl: Onvoldoende kernelgeheugen voorhanden.

source: The device containing the file has no room for the new directory entry.
it: Il dispositivo contenente il file non ha spazio per la nuova directory.
nl: Het apparaat waar het bestand op zit heeft geen ruimte voor een nieuwe map.

source: A component used as a directory in I<linkpath> is not, in fact, a directory.
it: Un elemento usato come directory in I<linkpath> non è, in effetti, una directory.
nl: Een deel gebruikt als een map in I<nieuwpad> is in feite geen map.

source: (B<symlinkat>()) I<linkpath> is relative and I<newdirfd> is a file descriptor referring to a file other than a directory.
it: (B<symlinkat>()) I<linkpath> è relativo e I<newdirfd> è un descrittore di file fa riferimento a un file anziché a una directory.
nl: (B<symlinkat>()) I<nieuwpad> is relatief en I<nieuwmapbi> is een bestandsindicator die naar een bestand in plaats van een map wijst.

source: The filesystem containing I<linkpath> does not support the creation of symbolic links.
it: Il filesystem contenente I<linkpath> non supporta la creazione di collegamenti simbolici.
nl: Het bestandssysteem dat I<nieuwpad> bevat, ondersteund het maken van symbolische koppelingen niet.

source: I<linkpath> is on a read-only filesystem.
it: I<linkpath> è contenuto in un filesystem in sola lettura.
nl: I<nieuwpad> is op een alleen-lezen bestandssysteem.

source: VERSIONS
it: VERSIONI
nl: VERSIES

source: B<symlinkat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
it: B<symlinkat>() è stato aggiunto a Linux nel kernel 2.6.16; il supporto per le librerie è stato aggiunto a glibc nella versione 2.4.
nl: B<symlinkat>() is toegevoegd aan Linux in kernel 2.6.16; bibliotheek ondersteuning is toegevoegd aan glibc in versie 2.4.

source: CONFORMING TO
it: CONFORME A
nl: VOLDOET AAN

source: NOTES
it: NOTE
nl: OPMERKINGEN

source: No checking of I<target> is done.
it: Non viene effettuato nessun controllo su I<target>.
nl: I<oudpad> wordt niet gecontroleerd.

source: Deleting the name referred to by a symbolic link will actually delete the file (unless it also has other hard links). If this behavior is not desired, use B<link>(2).
it: La cancellazione del nome a cui fa riferimento un collegamento simbolico cancellerà il file (a meno che esso non abbia altri collegamenti fisici). Se non si desidera questo comportamento usare B<link>(2).
nl: Wissen van de naam waar de symbolische koppeling naar wijst zal daadwerkelijk het bestand wissen (tenzij het ook nog andere harde koppelingen heeft.) Als dit gedrag ongewenst is, gebruik B<link>(2).

source: Glibc notes
it: Note su glibc
nl: Glibc-opmerkingen

source: On older kernels where B<symlinkat>() is unavailable, the glibc wrapper function falls back to the use of B<symlink>(). When I<linkpath> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<newdirfd> argument.
it: Su vecchi kernel dove B<symlinkat>() non è disponibile, la funzione wrapper glibc retrocede all'uso di B<symlink>(). Dove I<linkpath> è un nome di percorso relativo, glibc costruisce un nome di percorso basato sul collegamento simbolico in I</proc/self/fd> che corrisponde all'argomento I<newdirfd>.
nl: Op oudere kernels waar B<symlinkat>() niet beschikbaar is, valt de glibc omwikkel functie terug op het gebruik van B<symlink>(). Als I<nieuwpad> een relatieve padnaam is, dan construeert glibc een padnaam gebaseerd op de symbolische koppeling in I</proc/self/df> die overeenkomt met het I<nieuwmapbi> argument.

source: SEE ALSO
it: VEDERE ANCHE
nl: ZIE OOK

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
it: B<#include E<lt>fcntl.hE<gt> >/* Definizione delle costanti AT_**/ B<#include E<lt>unistd.hE<gt>>
nl: B<#include E<lt>fcntl.hE<gt> >/* Definitie van AT_* constanten */ B<#include E<lt>unistd.hE<gt>>

source: _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
it: _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versioni E<lt>= 2.19: */ _BSD_SOURCE
nl: _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versies E<lt>= 2.19: */ _BSD_SOURCE

source: Since glibc 2.10:
it: Sin da glibc 2.10:
nl: Vanaf glibc 2.10:

source: Before glibc 2.10:
it: Prima di glibc 2.10:
nl: Vóór glibc 2.10:

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato di conseguenza.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: The following additional errors can occur for B<symlinkat>():
it: Altri errori si possono presentare per B<symlinkat>():
nl: De volgende extra fouten kunnen optreden voor B<symlinkat>():

source: I<newdirfd> is not a valid file descriptor.
it: I<newdirfd> non è un descrittore di file valido.
nl: I<nieuwmapbi> is geen geldige bestand beschrijving.

source: I<linkpath> is a relative pathname and I<newdirfd> refers to a directory that has been deleted.
it: I<linkpath> è un percorso relativo e I<newdirfd> fa riferimento a una directory che è stata eliminata.
nl: I<nieuwpad> is een relatieve padnaam en I<nieuwmapbi> wijst naar een map die werd verwijdert.

source: I<linkpath> is relative and I<newdirfd> is a file descriptor referring to a file other than a directory.
it: I<linkpath> è relativo e I<newdirfd> è un descrittore di file fa riferimento a un file anziché a una directory.
nl: I<nieuwpad> is relatief en I<nieuwmapbi> is een bestand beschrijving die naar een bestand in plaats van een map wijst.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
