Repository: sebras/manpages-l10n
Catalog: po/*/man2/sync_file_range.2.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: sync_file_range - sync a file segment with disk
fr: sync_file_range - Synchroniser un segment de fichier avec le disque

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>
fr: B<#define _GNU_SOURCE> /* Consultez feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>

source: B<sync_file_range>() permits fine control when synchronizing the open file referred to by the file descriptor I<fd> with disk.
fr: B<sync_file_range>() permet d'avoir un contrôle fin de la synchronisation d'un fichier ouvert, référencé par le descripteur de fichier I<fd>, sur le disque.

source: I<offset> is the starting byte of the file range to be synchronized. I<nbytes> specifies the length of the range to be synchronized, in bytes; if I<nbytes> is zero, then all bytes from I<offset> through to the end of file are synchronized. Synchronization is in units of the system page size: I<offset> is rounded down to a page boundary; I<(offset+nbytes-1)> is rounded up to a page boundary.
fr: I<offset> est le premier octet de la zone du fichier à synchroniser. I<nbytes> indique la taille, en octets, de la zone à synchroniser\ ; si I<nbytes> est nul, toute la zone entre I<offset> et la fin du fichier est synchronisée. La synchronisation se fait par multiples de la taille de page\ : I<offset> est arrondi par défaut à la frontière d'une page, et I<(offset+nbytes-1)> est arrondi par excès.

source: The I<flags> bit-mask argument can include any of the following values:
fr: L'argument I<flags> contient une ou plusieurs des valeurs suivantes\ :

source: Wait upon write-out of all pages in the specified range that have already been submitted to the device driver for write-out before performing any write.
fr: Attendre l'écriture de toutes les pages de la zone indiquée qui ont déjà été envoyées au pilote de périphérique pour écriture, avant d'effectuer cette écriture.

source: Initiate write-out of all dirty pages in the specified range which are not presently submitted write-out. Note that even this may block if you attempt to write more than request queue size.
fr: Commencer l'écriture physique de toutes les pages modifiées de la plage indiquée pour lesquelles l'écriture n'a pas encore été demandée. Veuillez noter que cela peut bloquer si vous tentez d'écrire plus que la taille de la file demandée.

source: Wait upon write-out of all pages in the range after performing any write.
fr: Attendre l'écriture physique de toutes les pages de la plage après toute demande d'écriture.

source: Specifying I<flags> as 0 is permitted, as a no-op.
fr: Indiquer 0 comme I<flags> est possible, dans ce cas l'appel système n'a pas d'effet.

source: Warning
fr: Avertissement

source: This system call is extremely dangerous and should not be used in portable programs. None of these operations writes out the file's metadata. Therefore, unless the application is strictly performing overwrites of already-instantiated disk blocks, there are no guarantees that the data will be available after a crash. There is no user interface to know if a write is purely an overwrite. On filesystems using copy-on-write semantics (e.g., I<btrfs>) an overwrite of existing allocated blocks is impossible. When writing into preallocated space, many filesystems also require calls into the block allocator, which this system call does not sync out to disk. This system call does not flush disk write caches and thus does not provide any data integrity on systems with volatile disk write caches.
fr: Cet appel système est extrêmement dangereux et ne devrait pas être utilisé dans des programmes portables. Aucune de ces opérations n'entraîne l'écriture physique des métadonnées du fichier. Par conséquent, à moins que l'application n'effectue strictement que des écrasements de blocs disque déjà instanciés, il n'y a aucune garantie que les données soient disponibles après un plantage.Il n'y a pas d'interface utilisateur pour savoir si une écriture consiste uniquement en un écrasement. Sur un système de fichiers avec une sémantique de copie sur écriture (I<copy-on-write>), tel que I<btrfs>, un écrasement de blocs existants est impossible. Pour écrire sur un espace déjà alloué, beaucoup de systèmes de fichiers nécessitent aussi des appels à l'allocateur de blocs, qui dans le cas de cet appel, ne seront pas synchronisés sur le disque. Cet appel système ne vide pas les caches d'écriture du disque, ainsi aucune garantie d'intégrité n'est possible sur des systèmes dont les caches de disque en écriture sont volatiles.

source: Some details
fr: Quelques détails

source: B<SYNC_FILE_RANGE_WAIT_BEFORE> and B<SYNC_FILE_RANGE_WAIT_AFTER> will detect any I/O errors or B<ENOSPC> conditions and will return these to the caller.
fr: B<SYNC_FILE_RANGE_WAIT_BEFORE> et B<SYNC_FILE_RANGE_WAIT_AFTER> détectent les erreurs d'entrées-sorties ou la condition B<ENOSPC>, et les signalent à l'appelant.

source: Useful combinations of the I<flags> bits are:
fr: Des combinaisons utiles pour I<flags> sont\ :

source: Ensures that all pages in the specified range which were dirty when B<sync_file_range>() was called are placed under write-out. This is a start-write-for-data-integrity operation.
fr: S'assurer de l'écriture physique de toutes les pages de la plage spécifiée qui étaient modifiées lorsque B<sync_file_range>() a été appelé. C'est l'opération «\ démarrer l'écriture pour l'intégrité des données\ ».

source: Start write-out of all dirty pages in the specified range which are not presently under write-out. This is an asynchronous flush-to-disk operation. This is not suitable for data integrity operations.
fr: Commencer l'écriture physique de toutes les pages modifiées de la plage indiquée pour lesquelles l'écriture n'a pas encore été demandée. C'est une opération «\ vidage vers le disque\ » asynchrone. Elle n'est pas convenable pour les opérations d'intégrité de données.

source: B<SYNC_FILE_RANGE_WAIT_BEFORE> (or B<SYNC_FILE_RANGE_WAIT_AFTER>)
fr: B<SYNC_FILE_RANGE_WAIT_BEFORE> (ou B<SYNC_FILE_RANGE_WAIT_AFTER>)

source: Wait for completion of write-out of all pages in the specified range. This can be used after an earlier B<SYNC_FILE_RANGE_WAIT_BEFORE | SYNC_FILE_RANGE_WRITE> operation to wait for completion of that operation, and obtain its result.
fr: Attendre la fin de l'écriture physique de toutes les pages de la plage indiquée. Cela peut être utilisé après une opération B<SYNC_FILE_RANGE_WAIT_BEFORE | SYNC_FILE_RANGE_WRITE> pour attendre la fin de cette opération et obtenir son résultat.

source: This is a write-for-data-integrity operation that will ensure that all pages in the specified range which were dirty when B<sync_file_range>() was called are committed to disk.
fr: C'est une opération «\ écriture pour intégrité des données\ » qui s'assure que toutes les pages modifiées dans la plage spécifiée lors de l'appel à B<sync_file_range>() sont bien envoyées sur le disque.

source: RETURN VALUE
fr: VALEUR RENVOYÉE

source: On success, B<sync_file_range>() returns 0; on failure -1 is returned and I<errno> is set to indicate the error.
fr: S'il réussit B<sync_file_range>() renvoie 0, sinon il renvoie -1 et remplit I<errno> avec le code d'erreur.

source: ERRORS
fr: ERREURS

source: I<fd> is not a valid file descriptor.
fr: I<fd> n'est pas un descripteur de fichier valable.

source: I<flags> specifies an invalid bit; or I<offset> or I<nbytes> is invalid.
fr: I<flags> contient un bit invalide, ou I<offset> ou I<nbytes> est invalide.

source: I/O error.
fr: Erreur d'entrée-sortie.

source: Out of memory.
fr: Plus assez de mémoire.

source: Out of disk space.
fr: Plus de place disque disponible.

source: B<sync_file_range>() appeared on Linux in kernel 2.6.17.
fr: B<sync_file_range>() est apparu dans Linux 2.6.17.

source: CONFORMING TO
fr: CONFORMITÉ

source: This system call is Linux-specific, and should be avoided in portable programs.
fr: Cet appel système est spécifique à Linux et ne devrait pas être utilisé dans des applications conçues pour être portable.

source: Some architectures (e.g., PowerPC, ARM) need 64-bit arguments to be aligned in a suitable pair of registers. On such architectures, the call signature of B<sync_file_range>() shown in the SYNOPSIS would force a register to be wasted as padding between the I<fd> and I<offset> arguments. (See B<syscall>(2) for details.) Therefore, these architectures define a different system call that orders the arguments suitably:
fr: Certaines architectures (par exemple PowerPC et ARM) nécessitent que les paramètres 64 bits soient alignés dans une paire de registres adéquate. Sur ces architectures, la signature d'appel de B<sync_file_range>() indiquée dans le SYNOPSIS imposerait le gaspillage d'un registre remplissage entre les paramètres I<fd> et I<offset> (consultez B<syscall>(2) pour plus de détails). Pour cette raison, ces architectures définissent un appel système différent qui réordonne correctement les paramètres :

source: The behavior of this system call is otherwise exactly the same as B<sync_file_range>().
fr: À part cela, le comportement de cet appel système est strictement identique à celui de B<sync_file_range>().

source: A system call with this signature first appeared on the ARM architecture in Linux 2.6.20, with the name B<arm_sync_file_range>(). It was renamed in Linux 2.6.22, when the analogous system call was added for PowerPC. On architectures where glibc support is provided, glibc transparently wraps B<sync_file_range2>() under the name B<sync_file_range>().
fr: Un appel système avec cette signature est d'abord apparu sur l'architecture ARM dans Linux 2.6.20, avec comme nom B<arm_sync_file_range>(). Il a été renommé dans Linux 2.6.22, quand un appel système analogue a été ajouté pour PowerPC. Sur des architectures où la glibc est prise en charge, elle remplace de manière transparente B<sync_file_range2>() sous le nom B<sync_file_range>().

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.12 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.04 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 4.16 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
