Repository: sebras/manpages-l10n
Catalog: po/*/man2/sync.2.po
Languages: de, it, nl

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
it: Manuale del programmatore di Linux
nl: Linux Programmeurs Handleiding

source: NAME
de: BEZEICHNUNG
it: NOME
nl: NAAM

source: sync, syncfs - commit filesystem caches to disk
de: sync, syncfs - Zwischenspeicher der Dateisysteme auf die Festplatte schreiben
it: sync, syncfs - svuota la cache del filesystem sul disco
nl: sync, syncfs - schrijf de bestandssysteem buffer naar schijf

source: SYNOPSIS
de: ÜBERSICHT
it: SINTASSI
nl: SAMENVATTING

source: B<int syncfs(int >I<fd>B<);>
de: B<int syncfs(int >I<dd>B<);>
nl: B<int syncfs(int >I<bb>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):
it: Macro per test di funzionalità per glibc (vedere B<feature_test_macros>(7)):
nl: Feature Test Macro´s eisen in glibc (zie B<feature_test_macros>(7)):

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE E<gt>= 500 || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE
it: _XOPEN_SOURCE E<gt>= 500 || /* Sin da glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE

source: DESCRIPTION
de: BESCHREIBUNG
it: DESCRIZIONE
nl: BESCHRIJVING

source: B<sync>() causes all pending modifications to filesystem metadata and cached file data to be written to the underlying filesystems.
de: B<sync>() bewirkt, dass alle anhängenden Änderungen an Dateisystemmetadaten und zwischengespeicherten Inhalten von Dateien auf die unterliegenden Dateisysteme geschrieben werden.
it: B<sync>() provoca la scrittura nei filesystem sottostanti di tutte le modifiche in sospeso ai metadati del file system e ai dati dei file memorizzati nella cache.
nl: B<sync>() zorgt ervoor dat aangebrachte modificaties aan de bestandssysteem metadata en gebufferde bestand data geschreven worden naar het onderliggende bestandssysteem

source: B<syncfs>() is like B<sync>(), but synchronizes just the filesystem containing file referred to by the open file descriptor I<fd>.
de: B<syncfs>() verhält sich wie B<sync>(), synchronisiert aber nur das Dateisystem, das die Datei enthält, auf die der offene Dateideskriptor I<dd> verweist.
it: B<syncfs>() è come B<sync>(), ma sincronizza solo il filesystem contenente il file a cui si riferisce il descrittore di file aperto I<fd>.
nl: B<syncfs>() is als B<sync>(), maar synchroniseert alleen het bestandssysteem dat het bestand aangewezen door de open bestandsbeschrijving I<bb> bevat.

source: RETURN VALUE
de: RÜCKGABEWERT
it: VALORE RESTITUITO
nl: EIND WAARDE

source: B<syncfs>() returns 0 on success; on error, it returns -1 and sets I<errno> to indicate the error.
de: B<syncfs>() gibt bei Erfolg 0 zurück. Bei Fehlern gibt es -1 zurück und setzt I<errno>, um den Fehler anzuzeigen.
it: B<syncfs>() ritorna 0 in caso di successo; in caso di errore, ritorna -1 e imposta I<errno> in modo che indichi l'errore.
nl: Bij succes geeft B<syncfs>() nul terug. Bij falen wordt -1 teruggegeven en wordt I<errno> naar behoren gezet.

source: ERRORS
de: FEHLER
it: ERRORI
nl: FOUTEN

source: B<sync>() is always successful.
de: B<sync>() ist immer erfolgreich.
it: B<sync>() termina sempre con successo.
nl: B<sync>() slaagd altijd.

source: B<syncfs>() can fail for at least the following reasons:
de: B<syncfs>() kann mindestens wegen der folgenden Gründe fehlschlagen:
it: B<syncfs>() può fallire per almeno il motivo seguente:
nl: B<syncfs>() kan falen door minstens een van de volgende redenen:

source: I<fd> is not a valid file descriptor.
de: I<dd> ist kein zulässiger Dateideskriptor.
it: I<fd> non è un descrittore di file valido.
nl: I<bb> is geen geldige bestandsbeschrijving.

source: An error occurred during synchronization. This error may relate to data written to any file on the filesystem, or on metadata related to the filesystem itself.
de: Während der Synchronisierung trat ein Fehler auf. Dieser Fehler kann in den in eine beliebige Datei auf dem Dateisystem geschriebenen Daten oder in den Metadaten des Dateisystems selbst liegen.
it: Si è verificato un errore durante la sincronizzazione. Quest'errore può riguardare i dati scritti su qualsiasi file sul filesystem, o su metadati relativi al filesystem stesso.
nl: Een fout opgetreden tijdens de synchronisatie. Deze fout kan betrekking hebben op de data geschreven naar elk bestand op het bestandssysteem, of op metadata gerelateerd aan het bestandssysteem zelf.

source: Disk space was exhausted while synchronizing.
de: Während der Synchronisierung war der Plattenplatz ausgeschöpft.
it: Lo spazio su disco è stato esaurito nel corso della sincronizzazione.
nl: De schijfruimte raakte uitgeput tijdens het synchroniseren.

source: Data was written to a file on NFS or another filesystem which does not allocate space at the time of a B<write>(2) system call, and some previous write failed due to insufficient storage space.
de: Die Daten wurden in eine Datei auf einem NFS- oder einem anderen Dateisystem geschrieben, welches zum Zeitpunkt des B<write>(2)-Systemaufrufs keinen Plattenplatz zugewiesen hat und vorherige Schreibvorgänge wegen unzureichenden Plattenplatzes fehlschlugen.
it: I dati sono stati scritti in un file su NFS o su un altro filesystem che non alloca spazio al momento di una chiamata di sistema a B<write>(2), e alcune scritture precedenti non sono andate a buon fine per mancanza di spazio di archiviazione.
nl: Data werd geschreven naar een bestand op een NFS of een ander bestandssysteem dat geen ruimte reserveerde op het tijdstip van de B<write>(2) systeem aanroep, en een vorige schrijfactie faalde vanwege niet voldoende opslag ruimte.

source: VERSIONS
de: VERSIONEN
it: VERSIONI
nl: VERSIES

source: B<syncfs>() first appeared in Linux 2.6.39; library support was added to glibc in version 2.14.
de: B<syncfs>() erschien erstmalig in Linux 2.6.39; die Bibliotheksunterstützung wurde zu Glibc in Version 2.14 hinzugefügt.
it: B<syncfs>() è apparso per la prima volta in Linux 2.6.39; il supporto alla libreria è stato aggiunto a glibc nella versione version 2.14.
nl: B<syncfs>() verscheen voor het eerste in Linux 2.6.39; bibliotheek ondersteuning werd toegevoegd aan glibc in versie 2.14.

source: CONFORMING TO
de: KONFORM ZU
it: CONFORME A
nl: VOLDOET AAN

source: B<syncfs>() is Linux-specific.
de: B<syncfs>() ist Linux-spezifisch.
it: B<syncfs>() è specifico di Linux.
nl: B<syncfs>() is Linux-eigen.

source: NOTES
de: ANMERKUNGEN
it: NOTE
nl: OPMERKINGEN

source: Since glibc 2.2.2, the Linux prototype for B<sync>() is as listed above, following the various standards. In glibc 2.2.1 and earlier, it was "int sync(void)", and B<sync>() always returned 0.
de: Seit Glibc 2.2.2 hat der Linux-Prototyp für B<sync>() die oben beschriebene Form, die den diversen Standards folgt. In Glibc bis 2.2.1 war der Prototyp »int sync(void)« und B<sync>() gab immer 0 zurück.
it: A partire da glibc 2.2.2 il prototipo Linux per B<sync>() è come elencato sopra, seguendo i vari standard. In libc4, libc5, e glibc 2.2.1 e precedenti era "int sync(void)", e B<sync>() restituiva sempre 0.
nl: Vanaf glibc 2.2.2, is het Linux prototype voor B<sync>() zoals hierboven getoond, daarbij de diverse standaarden volgend. In glibc 2.2.1 en eerder, was het "int sync(void)" en gaf B<sync>() altijd 0 terug.

source: According to the standard specification (e.g., POSIX.1-2001), B<sync>() schedules the writes, but may return before the actual writing is done. However Linux waits for I/O completions, and thus B<sync>() or B<syncfs>() provide the same guarantees as B<fsync>() called on every file in the system or filesystem respectively.
de: Nach den Vorgaben der Standards (z.B. POSIX.1-2001) kann B<sync>() den Schreibvorgang initiieren, aber vor dem eigentlichen Schreibvorgang zurückkehren. Allerdings wartet Linux auf den Abschluss der E/A und daher stellen B<sync>() und B<syncfs>() die gleichen Garantien wie der Aufruf von B<fsync>() nach jeder Datei im System oder entsprechend Dateisystem bereit.
it: Secondo le specifiche degli standard (per esempio, POSIX.1-2001), B<sync>() pianifica le scritture, ma potrebbe ritornare prima che la scrittura sia stata realmente effettuata. Comunque Linux attende il completamento degli I/O, e quindi B<sync>() o B<syncfs>() offrono la stessa garanzia di B<fsync>() chiamato su ogni file rispettivamente del sistema o del file system.
nl: Volgens de standaard specificatie (e.g. POSIX.1-2001) plant B<sync>() de schrijfacties, maar mag terugkeren voordat de echte schrijfacties wordt uitgevoerd. Echter wacht Linux op voltooiing van Invoer/Uitvoer en daarom geven B<sync>() en B<syncfs>() dezelfde garanties als het aanroepen van B<fsync>() op elk bestand in het respectievelijk systeem of bestandssysteem.

source: In mainline kernel versions prior to 5.8, B<syncfs>() will fail only when passed a bad file descriptor (B<EBADF>). Since Linux 5.8, B<syncfs>() will also report an error if one or more inodes failed to be written back since the last B<syncfs>() call.
de: In Mainline-Kernel-Versionen vor 5.8 schlägt B<syncfs>() nur dann fehl, wenn ein schlechter Dateideskriptor (B<EBADF>) übergeben wurde. Seit Linux 5.8 meldet B<syncfs>() auch einen Fehler, wenn das Zurückschreiben eines oder mehrerer Inodes seit dem letzten B<syncfs>()-Systemaufruf fehlschlug.
it: Nelle versioni del kernel precedenti alla 5.8, B<syncfs>() fallisce solo quando alla funzione viene fornito come parametro un descrittore di file non valido (B<EBADF>). A partire da Linux 5.8, B<syncfs>() riporta un errore anche se non è stato possibile riscrivere uno o più inode dall'ultima chiamata a B<syncfs>().
nl: In de hoofd kernel versies eerder dan 5.8, zal B<syncfs>() alleen falen als die een verkeerde bestand beschrijving (B<EBADF> krijgt. Vanaf Linux 5.8, zal B<syncfs>() ook een fout geven als een of meer inodes faalden om geschreven te worden sinds de laatste B<syncfs>() aanroep.

source: BUGS
de: FEHLER
it: BUG

source: Before version 1.3.20 Linux did not wait for I/O to complete before returning.
de: Vor Version 1.3.20 wartete Linux vor der Rückkehr nicht auf den Abschluss der E/A.
it: Prima della versione 1.3.20 Linux non aspettava il completamento degli I/O, prima di ritornare.
nl: Voor versie 1.3.20 wachtte Linux niet op voltooiing van de Invoer/Uitvoer voor terugkeer.

source: SEE ALSO
de: SIEHE AUCH
it: VEDERE ANCHE
nl: ZIE OOK

source: COLOPHON
de: KOLOPHON
nl: COLOFON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<int syncfs(int >I<fd>B<);>
de: B<int syncfs(int >I<dd>B<);>
nl: B<int syncfs(int >I<bb>B<);>

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Seit Glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE
it: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Sin da glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versioni E<lt>= 2.19: */ _BSD_SOURCE
nl: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Sinds glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versies E<lt>= 2.19: */ _BSD_SOURCE

source: Data was written to a files on NFS or another filesystem which does not allocate space at the time of a B<write>(2) system call, and some previous write failed due to insufficient storage space.
de: Die Daten wurden auf ein NFS- oder ein anderes Dateisystem geschrieben, welches zum Zeitpunkt des B<write>(2)-Systemaufrufs keinen Plattenplatz zugewiesen hat und vorherige Schreibvorgänge wegen unzureichenden Plattenplatzes fehlschlugen.
it: I dati sono stati scritti in un file su NFS o su un altro filesystem che non alloca spazio al momento di una chiamata di sistema a B<write>(2), e alcune scritture precedenti non sono andate a buon fine per mancanza di spazio di archiviazione.
nl: Data werd geschreven naar bestanden op een NFS of een ander bestandssysteem dat geen ruimte reserveerde op het tijdstip van de B<write>(2) systeem aanroep, en een vorige schrijfactie faalde vanwege niet voldoende opslag ruimte.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<syncfs>() can fail for at least the following reason:
de: B<syncfs>() kann mindestens wegen der folgenden Gründe fehlschlagen:
it: B<syncfs>() può fallire per almeno il motivo seguente:
nl: B<syncfs>() kan falen door minstens een van de volgende redenen:

source: According to the standard specification (e.g., POSIX.1-2001), B<sync>() schedules the writes, but may return before the actual writing is done. However Linux waits for I/O completions, and thus B<sync>() or B<syncfs>() provide the same guarantees as fsync called on every file in the system or filesystem respectively.
de: Nach den Vorgaben der Standards (z.B. POSIX.1-2001) kann B<sync>() den Schreibvorgang initiieren, aber vor dem eigentlichen Schreibvorgang zurückkehren. Allerdings wartet Linux auf den Abschluss der E/A und daher stellen B<sync>() und B<syncfs>() die gleichen Garantien wie der Aufruf von Fsync nach jeder Datei im System oder entsprechend Dateisystem bereit.
it: Secondo le specifiche degli standard (per esempio, POSIX.1-2001), B<sync>() pianifica le scritture, ma potrebbe ritornare prima che la scrittura sia stata realmente effettuata. Comunque Linux attende il completamento degli I/O, e quindi B<sync>() o B<syncfs>() offrono la stessa garanzia di fsync chiamato su ogni file rispettivamentedel sistema o del file system.
nl: Volgens de standaard specificatie (e.g. POSIX.1-2001) plant B<sync>() de schrijfacties, maar mag terugkeren voordat de echte schrijfacties wordt uitgevoerd. Echter wacht Linux op voltooiing van Invoer/Uitvoer en daarom geven B<sync>() en B<syncfs>() dezelfde garanties als het aanroepen van B<fsync>() op elk bestand in het respectievelijk systeem of bestandssysteem.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
