Repository: sebras/manpages-l10n
Catalog: po/*/man2/times.2.po
Languages: de, nl, pl

source: Linux man-pages 6.01
de: Linux-Handbuchseiten 6.01

source: NAME
de: BEZEICHNUNG
nl: NAAM
pl: NAZWA

source: times - get process times
de: times - Abfrage der Prozesszeiten
nl: times - verkrijg proces tijden
pl: times - pobiera czasy procesów

source: LIBRARY
de: BIBLIOTHEK

source: Standard C library (I<libc>, I<-lc>)
de: Standard-C-Bibliothek (I<libc>, I<-lc>)

source: SYNOPSIS
de: ÜBERSICHT
nl: SAMENVATTING
pl: SKŁADNIA

source: B<clock_t times(struct tms *>I<buf>B<);>
de: B<clock_t times(struct tms *>I<Puffer>B<);>

source: DESCRIPTION
de: BESCHREIBUNG
nl: BESCHRIJVING
pl: OPIS

source: B<times>() stores the current process times in the I<struct tms> that I<buf> points to. The I<struct tms> is as defined in I<E<lt>sys/times.hE<gt>>:
de: B<times>() speichert die aktuellen Prozesszeiten in der Struktur I<tms>, auf die I<Puffer> weist. Die I<tms>-Struktur wird in I<E<lt>sys/times.hE<gt>> wie folgt definiert:
nl: B<times>() slaat tijden van het huidige proces op in I<buf>. I<struct tms> is zoals bepaald in I<E<lt>sys/times.hE<gt>>:
pl: B<times>() przechowuje bieżące czasy wykonywania procesu w I<struct tms>, do której prowadzi I<buf>. I<struct tms> jest zdefiniowana w I<E<lt>sys/times.hE<gt>> następująco:

source: struct tms { clock_t tms_utime; /* user time */ clock_t tms_stime; /* system time */ clock_t tms_cutime; /* user time of children */ clock_t tms_cstime; /* system time of children */ };
de: struct tms { clock_t tms_utime; /* Benutzer-Zeit */ clock_t tms_stime; /* System-Zeit */ clock_t tms_cutime; /* Benutzer-Zeit der Kindprozesse */ clock_t tms_cstime; /* System-Zeit der Kindprozesse */ };
nl: struct tms { clock_t tms_utime; /* gebruiker tijd */ clock_t tms_stime; /* systeem tijd */ clock_t tms_cutime; /* gebruiker tijd van kinderen */ clock_t tms_cstime; /* systeem tijd van inderen */ };
pl: struct tms { clock_t tms_utime; /* czas w przestrzeni użytkownika */ clock_t tms_stime; /* czas systemowy */ clock_t tms_cutime; /* czas w przestrzeni użytkownika dla dzieci*/ clock_t tms_cstime; /* czas systemowy dzieci */ };

source: The I<tms_utime> field contains the CPU time spent executing instructions of the calling process. The I<tms_stime> field contains the CPU time spent executing inside the kernel while performing tasks on behalf of the calling process.
de: Das Feld I<tms_utime> enthält die CPU-Zeit, die mit dem Ausführen von Anweisungen des aufrufenden Prozesses verbracht wurde. Das Feld I<tms_stime> enthält die im Kernel verbrachte CPU-Zeit während der Ausführung von Aufgaben im Namen des aufrufenden Prozesses.
nl: Het I<tims_utime> veld bevat de tijd die de CPU besteed aan het uitvoeren van instructies van het huidige proces. De I<tms_stime> veld bevat de tijd die de CPU besteed aan het uitvoeren in de kernel terwijl taken worden uitgevoerd namens het huidige proces.
pl: Pole I<tms_utime> zawiera czas CPU spędzony na wykonywaniu instrukcji procesu wywołującego tę funkcję. Pole I<tms_stime> zawiera czas CPU spędzony w systemie podczas wykonywania zadań zleconych przez proces.

source: The I<tms_cutime> field contains the sum of the I<tms_utime> and I<tms_cutime> values for all waited-for terminated children. The I<tms_cstime> field contains the sum of the I<tms_stime> and I<tms_cstime> values for all waited-for terminated children.
de: Das Feld I<tms_cutime> enthält die Summe der I<tms_utime>- und I<tms_cutime> -Werte für alle Kindprozesse, auf deren Abschluss gewartet wurde. Das Feld I<tms_cstime> enthält die Summe der I<tms_stime>- und I<tms_cstime>-Werte für alle Kindprozesse, auf deren Abschluss gewartet wurde.
nl: Het I<tms_cutime> veld bevat de som van de I<tms_utime> en I<tms_cutime> waarden voor alle beëindigde kinderen waarop gewacht wordt. Het I<tms_cstime> veld bevat de som van de I<tms_stime> en I<tms_cstime> waarden voor alle beëindigde kinderen waarop gewacht wordt.
pl: Pole I<tms_cutime> zawiera sumę I<tms_utime> i I<tms_cutime> wartości dla wszystkich dzieci, na które proces czekał. Pole I<tms_cstime> zawiera sumę wartości I<tms_stime> i I<tms_cstime> dla wszystkich dzieci, na które proces czekał.

source: Times for terminated children (and their descendants) are added in at the moment B<wait>(2) or B<waitpid>(2) returns their process ID. In particular, times of grandchildren that the children did not wait for are never seen.
de: Zeiten für beendete Kindprozesse (und ihre Nachkommen) werden in dem Moment hinzugefügt, wenn B<wait>(2) oder B<waitpid>(2) deren Prozesskennung zurückgeben. Insbesondere werden die Zeiten der Enkel, auf die die Kinder nicht gewarten haben, nicht erfasst.
nl: Tijden voor beëindigde kinderen (en hun nakomelingen) wordt toegevoegd op het moment dan B<wait>(2) of B<waitpid>(2) hun proces ID teruggeven. In het bijzonder, worden tijden van kleinkinderen waarop de kinderen niet wachten nooit gezien.
pl: Czas zakończonych procesów-dzieci (i ich potomków) jest dodawany w momencie, gdy B<wait>(2) lub B<waitpid>(2) zwrócą ich identyfikatory procesu. W szczególności nigdy nie zostaną policzone czasy wnuków, na które dzieci nie poczekały.

source: All times reported are in clock ticks.
de: Alle Zeiten werden in Uhrticks angegeben.
nl: All gerapporteerde tijden zijn in klok tikken.
pl: Wszystkie raportowane czasy są wyrażone w tyknięciach zegara.

source: RETURN VALUE
de: RÜCKGABEWERT
nl: EIND WAARDE
pl: WARTOŚĆ ZWRACANA

source: B<times>() returns the number of clock ticks that have elapsed since an arbitrary point in the past. The return value may overflow the possible range of type I<clock_t>. On error, I<(clock_t)\ -1> is returned, and I<errno> is set to indicate the error.
de: B<times>() gibt die Zahl der Ticks an, die seit einem beliebigen Punkt in der Vergangenheit abgelaufen sind. Der Rückgabewert kann den möglichen Bereich von Typ I<clock_t> überlaufen. Tritt ein Fehler auf, wird I<(clock_t)\ -1> zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.
nl: B<times>() geeft het aantal klok tikken die verstreken zijn vanaf een willekeurig punt in het verleden. De uitvoer waarde kan het mogelijke bereik van het type I<clock_t> overlopen. Bij een fout wordt I<(clock_t)\ -1> teruggegeven, en wordt I<errno> gezet om de fout te melden.

source: ERRORS
de: FEHLER
nl: FOUTEN
pl: BŁĘDY

source: I<tms> points outside the process's address space.
de: I<tms> zeigt außerhalb des adressierbaren Adressraums des Prozesses.
nl: I<tms> wijst buiten de adres ruimte van het aanroepende proces.
pl: I<tms> wskazuje na pamięć poza przestrzenią adresową procesu.

source: NOTES
de: ANMERKUNGEN
nl: OPMERKINGEN
pl: UWAGI

source: The number of clock ticks per second can be obtained using:
de: Die Zahl der Uhrticks pro Sekunde kann wie folgt bestimmt werden:
nl: Het aantal klok tikken per seconde kan worden verkregen door:
pl: Liczbę tyknięć zegara na sekundę można uzyskać, używając:

source: In POSIX.1-1996 the symbol B<CLK_TCK> (defined in I<E<lt>time.hE<gt>>) is mentioned as obsolescent. It is obsolete now.
de: In POSIX.1-1996 wird das Symbol B<CLK_TCK> (definiert in I<E<lt>time.hE<gt>>) als veraltet erwähnt. Es ist jetzt überholt.
nl: In POSIX.1-1996 wordt het symbool B<CLK_TCK> (gedefinieerd in I<E<lt>time.hE<gt>>) genoemd als overbodig. Het is nu overbodig.
pl: W standardzie POSIX-1996 symbol B<CLK_TCK> (zdefiniowany w I<E<lt>time.hE<gt>>) jest uznany za starzejący się. Obecnie jest przestarzały.

source: In Linux kernel versions before 2.6.9, if the disposition of B<SIGCHLD> is set to B<SIG_IGN>, then the times of terminated children are automatically included in the I<tms_cstime> and I<tms_cutime> fields, although POSIX.1-2001 says that this should happen only if the calling process B<wait>(2)s on its children. This nonconformance is rectified in Linux 2.6.9 and later.
de: Falls in Linux-Kernel-Versionen vor 2.6.9 B<SIGCHLD> B<SIG_IGN> zugeordnet ist, werden die Zeiten der beendeten Kindprozesse automatisch in den Feldern I<tms_cstime> und I<tms_cutime> eingetragen, obwohl POSIX.1-2001 sagt, dass dies nur geschehen soll, wenn der aufrufende Prozess (mit B<wait>(2)) auf seine Kindprozesse wartet. Diese Nichtübereinstimmung wurde in Linux 2.6.9 und später behoben.
nl: In de Linux kernel versies voor 2.6.9, als de dispositie van B<SIGCHLD> op B<SIG_IGN> werd gezet, werden de tijden van beëindigde kinderen automatisch opgenomen in de I<tms_cstime> en I<tms_cutime> velden, hoewel POSIX.1-2001 zegt dat dit alleen mag gebeuren als het huidige proces B<wait>(2)s op zijn kinderen. Deze non-conformiteit werd gecorrigeerd in Linux 2.6.9 en later.
pl: W wersjach Linuksa przed 2.6.9, jeżeli obsługa sygnału B<SIGCHLD> jest ustawiona na B<SIG_IGN>, to czasy zakończonych dzieci są automatycznie zawarte w polach I<tms_cstime> i I<tms_cutime>, mimo że POSIX.1-2001 określa, że tak się powinno się zdarzyć tylko wtedy, gdy proces czeka na swoje dzieci za pomocą wywołania systemowego B<wait>(2). To niedostosowanie do standardu jest poprawione w Linuksie w wersji 2.6.9 i kolejnych.

source: On Linux, the I<buf> argument can be specified as NULL, with the result that B<times>() just returns a function result. However, POSIX does not specify this behavior, and most other UNIX implementations require a non-NULL value for I<buf>.
de: Unter Linux kann das Argument I<Puffer> als NULL angegeben werden, worauf B<times>() nur ein Funktionsergebnis zurückgibt. Dieses Verhalten wird aber nicht von POSIX beschrieben und die meisten UNIX-Implementierungen erfordern einen von NULL verschiedenen Wert für I<Puffer>.
nl: Op Linux mag het I<buf> argument worden opgegeven als NULL, met als resultaat dat B<times>() alleen het functie resultaat teruggeeft. Echter, specificeert POSIX dit gedrag niet en de meeste andere UNIX implementaties vereisen een niet-NULL waarde voor I<buf>.
pl: Pod Linuksem argument I<buf> może mieć wartość NULL, w czego wyniku B<times>() tylko zwróci wynik funkcji. Jednakże POSIX nie określa takiego zachowania i większość innych implementacji uniksowych wymaga, aby parametr I<buf> nie był NULL-em.

source: Note that B<clock>(3) also returns a value of type I<clock_t>, but this value is measured in units of B<CLOCKS_PER_SEC>, not the clock ticks used by B<times>().
de: Beachten Sie, dass auch B<clock>(3) einen Wert vom Typ I<clock_t> zurückgibt. Die Maßeinheit für diesen Wert ist B<CLOCKS_PER_SEC>, nicht die von B<times>() verwendeten Uhrticks.
nl: Let op dat B<clock>(3) ook een waarde van het type I<clock_t> terug geeft, maar dat deze waarde gemeten wordt in eenheden van B<CLOCKS_PER_SEC>, en niet de klok tikken zoals gebruikt door B<times>().
pl: Proszę zauważyć, że B<clock>(3) także zwraca wartości typu I<clock_t>, które są wyrażone w jednostkach B<CLOCKS_PER_SEC>, a nie w tyknięciach zegara, używanych przez B<times>().

source: On Linux, the "arbitrary point in the past" from which the return value of B<times>() is measured has varied across kernel versions. On Linux 2.4 and earlier, this point is the moment the system was booted. Since Linux 2.6, this point is I<(2^32/HZ) - 300> seconds before system boot time. This variability across kernel versions (and across UNIX implementations), combined with the fact that the returned value may overflow the range of I<clock_t>, means that a portable application would be wise to avoid using this value. To measure changes in elapsed time, use B<clock_gettime>(2) instead.
de: Unter Linux hat sich der »beliebige Punkt in der Vergangenheit«, auf den sich der Rückgabewert von B<times>() bezieht, über die Kernel-Versionen geändert. Unter Linux 2.4 und früher war dieser Punkt der Moment, an dem das System gestartet wurde. Seit Linux 2.6 ist dieser Punkt I<(2^32/HZ) - 300> Sekunden vor Systemstart. Diese Variabilität zwischen Kernel-Versionen (und über UNIX-Implementierungen) und die Tatsache, dass der Rückgabewert den Bereich I<clock_t> überlaufen lassen kann, bedeutet, dass eine portable Anwendung klug daran tut, diesen Wert nicht zu verwenden. Um Änderungen der verstrichenen Zeit zu messen, verwenden Sie stattdessen B<clock_gettime>(2).
nl: Op Linux heeft het "willekeurige punt in het verleden" van waar af de uitvoer waarde van B<times>() wordt gemeten gevarieerd over kernel versies. Op Linux 2.4 en vroeger, was dit het moment waarop het systeem werd opgestart. Vanaf Linux 2.6 ligt dit punt I<(2^32/Hz) - 300> seconden voor de start van het systeem. Deze variatie over kernel versies (en over UNIX implementaties), gecombineerd met het feit dat de teruggegeven waarde het bereik van I<clock_t> kan overlopen betekent dat het wijs is dat een overdraagbare applicatie het gebruik van deze waarde vermijd. Gebruik in zijn plaats beter B<clock_gettime>(2) om veranderingen in verstreken tijd te meten .
pl: Funkcja B<times>() zwraca liczbę tyknięć zegara, które upłynęły od pewnego wybranego punktu przeszłości. Pod Linuksem ów "pewien wybrany punkt w przyszłości" jest różny w różnych wersjach jądra systemu. W Linuksie 2.4 i wcześniejszych tym punktem jest moment uruchomienia systemu. Od wersji 2.6 Linuksa tym punktem jest I<(2^32/HZ) - 300> sekund przed momentem uruchomienia systemu. Ta wariantywność pomiędzy wersjami jądra (i pomiędzy różnymi implementacjami Uniksa) połączona z faktem, że wartość zwracana może przekroczyć dopuszczalny zakres typu I<clock_t>, oznacza, że przenośne aplikacje powinny unikać używania tej wartości. Aby zmierzyć upływ czasu, lepiej używać B<clock_gettime>(2).

source: Historical
de: Geschichtliches
nl: Historisch
pl: Historia

source: SVr1-3 returns I<long> and the struct members are of type I<time_t> although they store clock ticks, not seconds since the Epoch. V7 used I<long> for the struct members, because it had no type I<time_t> yet.
de: SVr1-3 gibt I<long> zurück und Bestandteile der Struktur sind vom Typ I<time_t>, obwohl sie Uhrticks speichern und nicht Sekunden seit dem Beginn der Unix-Zeit. V7 verwendete I<long> für die Bestandteile der Struktur, weil es damals noch keinen Typ I<time_t> gab.
nl: SVr1-3 retourneert I<long> waarvan de struc leden van het type I<time_t> zijn hoewel ze klok tikken bewaren, en niet seconden vanaf de Epoch. V7 gebruikte I<long> voor de struct leden, omdat het geen type I<time_t> had.
pl: SVr1-3 zwraca I<long>, a członkowie struktury są typu I<time_t>, chociaż przechowują tyknięcia zegara, a nie sekundy od początku epoki. V7 używał typu I<long> dla członków struktury, ponieważ nie miał jeszcze wtedy typu I<time_t>.

source: BUGS
de: FEHLER
pl: BŁĘDY

source: A limitation of the Linux system call conventions on some architectures (notably i386) means that on Linux 2.6 there is a small time window (41 seconds) soon after boot when B<times>() can return -1, falsely indicating that an error occurred. The same problem can occur when the return value wraps past the maximum value that can be stored in B<clock_t>.
de: Eine Beschränkung in den Linux-Konventionen für Systemaufrufe für einige Architekturen (insbesondere i386) bewirkt unter Linux 2.6 ein kleines Zeitfenster (41 Sekunden) kurz nach dem Systemstart, in dem B<times>() -1 zurückgeben und damit fälschlicherweise anzeigen kann, dass ein Fehler auftrat. Dasselbe Problem kann auftreten, wenn der Rückgabewert den größten in B<clock_t> speicherbaren Wert überschreitet.
nl: Een beperking van de Linux systeem aanroepen conventies op sommige architecturen (met name i386) betekent dat op Linux 2.6 er een kort tijd venster is (41 seconden) kort na de start dat B<times>() een -1 kan teruggeven, foutief aangevend dat een fout optrad. Het zelfde probleem kan optreden wanneer de uitvoer waarde de maximum waarde overschrijdt die opgeslagen kan worden in B<clock_t>.
pl: Ograniczenie w konwencjach tego wywołania systemowego na niektórych architekturach systemowych (zwłaszcza i386) oznacza, że w Linuksie 2.6 istnieje niewielkie okno czasowe (41 sekund) zaraz po uruchomieniu systemu, w którym B<times>() może zwrócić -1, niepoprawnie wskazując na wystąpienie błędu. Ten sam problem może wystąpić, kiedy wartość zwracana zostanie zawinięta, gdyż przekroczy maksymalną dopuszczalną wartość dla typu B<clock_t>.

source: SEE ALSO
de: SIEHE AUCH
nl: ZIE OOK
pl: ZOBACZ TAKŻE

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch
nl: Linux Programmeurs Handleiding
pl: Podręcznik programisty Linuksa

source: B<clock_t times(struct tms *>I<buf>B<);>
de: B<clock_t times(struct tms *>I<Puffer>B<);>

source: B<times>() returns the number of clock ticks that have elapsed since an arbitrary point in the past. The return value may overflow the possible range of type I<clock_t>. On error, I<(clock_t)\ -1> is returned, and I<errno> is set appropriately.
de: B<times>() gibt die Zahl der Ticks an, die seit einem beliebigen Punkt in der Vergangenheit abgelaufen sind. Der Rückgabewert kann den möglichen Bereich von Typ I<clock_t> überlaufen. Tritt ein Fehler auf, wird I<(clock_t)\ -1> zurückgegeben und I<errno> entsprechend gesetzt.
nl: B<times>() geeft het aantal klok tikken die verstreken zijn vanaf een willekeurig punt in het verleden. De uitvoer waarde kan het mogelijke bereik van het type I<clock_t> overlopen. Bij een fout wordt I<(clock_t)\ -1> teruggegeven, en wordt I<errno> gezet om de fout te melden.
pl: B<times>() zwraca liczbę tyknięć zegara, które upłynęły od pewnego wybranego punktu przeszłości. Wartość zwracana może przekroczyć dopuszczalny zakres typu I<clock_t>. W razie błędu zwracane jest I<(clock_t)\ -1> i odpowiednio jest ustawiana wartość zmiennej I<errno>.

source: CONFORMING TO
de: KONFORM ZU
nl: VOLDOET AAN
pl: ZGODNE Z

source: COLOPHON
de: KOLOPHON
nl: COLOFON
pl: O STRONIE

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pl: Angielska wersja tej strony pochodzi z wydania 5.10 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pl: Angielska wersja tej strony pochodzi z wydania 5.13 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
pl: Angielska wersja tej strony pochodzi z wydania 4.16 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.

source: STANDARDS
pl: STANDARDY
