Repository: sebras/manpages-l10n
Catalog: po/*/man2/truncate.2.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: truncate, ftruncate - truncate a file to a specified length
de: truncate, ftruncate - eine Datei auf eine bestimmte Länge verkürzen

source: SYNOPSIS
de: ÜBERSICHT

source: B<int truncate(const char *>I<path>B<, off_t >I<length>B<);> B<int ftruncate(int >I<fd>B<, off_t >I<length>B<);>
de: B<int truncate(const char *>I<Pfad>B<, off_t >I<Länge>B<);> B<int ftruncate(int >I<dd>B<, off_t >I<Länge>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: B<truncate>():
de: Für B<truncate>():

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE E<gt>= 500 || /* Seit Glibc 2.12: */ _POSIX_C_SOURCE E<gt>= 200809L || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE

source: B<ftruncate>():
de: Für B<ftruncate>():

source: _XOPEN_SOURCE E<gt>= 500 || /* Since glibc 2.3.5: */ _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE E<gt>= 500 || /* Seit Glibc 2.3.5: */ _POSIX_C_SOURCE E<gt>= 200112L || /* Glibc E<lt>= 2.19: */ _BSD_SOURCE

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<truncate>() and B<ftruncate>() functions cause the regular file named by I<path> or referenced by I<fd> to be truncated to a size of precisely I<length> bytes.
de: Die Funktionen B<truncate>() und B<ftruncate>() bewirken, dass die reguläre Datei, die durch I<Pfad> oder I<dd> angegeben ist, auf eine Größe von exakt I<Länge> Byte verkürzt wird.

source: If the file previously was larger than this size, the extra data is lost. If the file previously was shorter, it is extended, and the extended part reads as null bytes (\(aq\e0\(aq).
de: Falls die Datei vorher größer war, geht ein Teil der Daten verloren. Falls die Datei vorher kleiner war, wird sie vergrößert und der zusätzliche Teil wird als NULL-Bytes (\(aq\e0\(aq) gelesen.

source: The file offset is not changed.
de: Der Datei-Offset wird nicht geändert.

source: If the size changed, then the st_ctime and st_mtime fields (respectively, time of last status change and time of last modification; see B<inode>(7)) for the file are updated, and the set-user-ID and set-group-ID mode bits may be cleared.
de: Wenn die Größe geändert wurde, werden die Felder st_ctime und st_mtime (die Zeit der letzten Zustandsänderung und die Zeit der Modifikation; siehe B<inode>(7)) für die Datei aktualisiert; die Modus-Bits Set-User-ID und Set-Group-ID können gelöscht werden.

source: With B<ftruncate>(), the file must be open for writing; with B<truncate>(), the file must be writable.
de: Für B<ftruncate>() muss die Datei zum Schreiben geöffnet sein, für B<truncate>() muss die Datei schreibbar sein.

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> gesetzt, um den Fehler anzuzeigen.

source: ERRORS
de: FEHLER

source: For B<truncate>():
de: Für B<truncate>():

source: Search permission is denied for a component of the path prefix, or the named file is not writable by the user. (See also B<path_resolution>(7).)
de: Eine Komponente des Pfad-Präfix darf nicht durchsucht werden oder die benannte Datei kann vom Benutzer nicht geschrieben werden (siehe auch B<path_resolution>(7).)

source: The argument I<path> points outside the process's allocated address space.
de: Das Argument I<Pfad> zeigt aus dem dem Prozess zugewiesenen Adressraum heraus.

source: The argument I<length> is larger than the maximum file size. (XSI)
de: Das Argument I<Länge> ist größer als die maximale Dateigröße. (XSI)

source: While blocked waiting to complete, the call was interrupted by a signal handler; see B<fcntl>(2) and B<signal>(7).
de: Der Aufruf wurde von einem Signal-Handler unterbrochen, während er auf den Abschluss wartete (siehe B<fcntl>(2) und B<signal>(7)).

source: The argument I<length> is negative or larger than the maximum file size.
de: Das Argument I<Länge> ist negativ oder größer als die maximale Dateigröße.

source: An I/O error occurred updating the inode.
de: Bei der Aktualisierung des Inodes trat ein E/A-Fehler auf.

source: The named file is a directory.
de: Die angegebene Datei ist ein Verzeichnis.

source: Too many symbolic links were encountered in translating the pathname.
de: Beim Übersetzen des Pfadnamens wurden zu viele symbolische Links vorgefunden.

source: A component of a pathname exceeded 255 characters, or an entire pathname exceeded 1023 characters.
de: Ein Teil eines Pfades ist größer als 255 Zeichen oder ein kompletter Pfadname überschreitet eine Größe von 1023 Zeichen.

source: The named file does not exist.
de: Die angegebene Datei existiert nicht.

source: A component of the path prefix is not a directory.
de: Eine Komponente des Pfad-Präfixes ist kein Verzeichnis.

source: The underlying filesystem does not support extending a file beyond its current size.
de: Das unterliegende Dateisystem erlaubt keine Vergrößerung der Datei über ihre aktuelle Größe hinaus.

source: The operation was prevented by a file seal; see B<fcntl>(2).
de: Die Aktion wurde durch eine Dateiversiegelung verhindert; siehe B<fcntl>(2).

source: The named file resides on a read-only filesystem.
de: Die angegebene Datei befindet sich auf einem nur lesbaren (read-only) Dateisystem.

source: The file is an executable file that is being executed.
de: Die Datei ist eine ausführbare Datei, die ausgeführt wird.

source: For B<ftruncate>() the same errors apply, but instead of things that can be wrong with I<path>, we now have things that can be wrong with the file descriptor, I<fd>:
de: Für B<ftruncate>() gelten die gleichen Fehlermeldungen. Anstelle von Dingen, die mit I<Pfad> schieflaufen können, gibt es jetzt Dinge, die mit dem Dateideskriptor I<dd> schiefgehen können:

source: I<fd> is not a valid file descriptor.
de: I<dd> ist kein zulässiger Dateideskriptor.

source: B<EBADF> or B<EINVAL>
de: B<EBADF> oder B<EINVAL>

source: I<fd> is not open for writing.
de: I<dd> ist nicht zum Schreiben geöffnet.

source: I<fd> does not reference a regular file or a POSIX shared memory object.
de: I<dd> referenziert keine reguläre Datei oder ein gemeinsam benutztes POSIX-Speicherobjekt.

source: B<EINVAL> or B<EBADF>
de: B<EINVAL> oder B<EBADF>

source: The file descriptor I<fd> is not open for writing. POSIX permits, and portable applications should handle, either error for this case. (Linux produces B<EINVAL>.)
de: Der Dateideskriptor I<dd> ist nicht zum Schreiben offen. POSIX erlaubt beide Fehler für diesen Fall und portable Anwendungen sollten damit umgehen können. (Linux erzeugt B<EINVAL>.)

source: CONFORMING TO
de: KONFORM ZU

source: POSIX.1-2001, POSIX.1-2008, 4.4BSD, SVr4 (these calls first appeared in 4.2BSD).
de: POSIX.1-2001, POSIX.1-2008, 4.4BSD, SVr4 (diese Systemaufrufe traten zuerst in BSD 4.2 auf).

source: NOTES
de: ANMERKUNGEN

source: B<ftruncate>() can also be used to set the size of a POSIX shared memory object; see B<shm_open>(3).
de: B<ftruncate>() kann auch dazu verwandt werden, die Größe eines gemeinsam benutzten POSIX-Speicherobjektes zu setzen; siehe B<shm_open>(3).

source: The details in DESCRIPTION are for XSI-compliant systems. For non-XSI-compliant systems, the POSIX standard allows two behaviors for B<ftruncate>() when I<length> exceeds the file length (note that B<truncate>() is not specified at all in such an environment): either returning an error, or extending the file. Like most UNIX implementations, Linux follows the XSI requirement when dealing with native filesystems. However, some nonnative filesystems do not permit B<truncate>() and B<ftruncate>() to be used to extend a file beyond its current length: a notable example on Linux is VFAT.
de: Die BESCHREIBUNG oben ist für XSI-konforme Systeme gedacht. Für nicht XSI-konforme Systeme erlaubt der POSIX-Standard zweierlei Verhalten von B<ftruncate>, wenn I<Länge> größer ist als die Dateilänge (beachten Sie, dass B<truncate> für eine derartige Umgebung nicht spezifiziert ist): entweder wird ein Fehler zurückgeliefert oder die Datei wird vergrößert. Wie die meisten Unix-Implementierungen folgt Linux der XSI-Forderung, wenn es sich mit nativen Dateisystemen befasst. Aber einige nicht native Dateisysteme gestatten die Verwendung von B<truncate>() und B<ftruncate>() nicht, um eine Datei über ihre aktuelle Größe hinweg zu erweitern. Ein namhaftes Beispiel für Linux ist VFAT.

source: The original Linux B<truncate>() and B<ftruncate>() system calls were not designed to handle large file offsets. Consequently, Linux 2.4 added B<truncate64>() and B<ftruncate64>() system calls that handle large files. However, these details can be ignored by applications using glibc, whose wrapper functions transparently employ the more recent system calls where they are available.
de: Die ursprünglichen Linux-Systemaufrufe B<truncate>() und B<ftruncate>() wurden nicht entwickelt, um große Datei-Offsets zu behandeln. Folglich fügte Linux 2.4 die Systemaufrufe B<truncate64>() und B<ftruncate64>() für die Bearbeitung sehr großer Dateien hinzu. Allerdings können diese Details von Anwendungen ignoriert werden, welche die Glibc nutzen. Deren Wrapper-Funktionen verwenden die neueren Systemaufrufe transparent, wenn diese verfügbar sind.

source: On some 32-bit architectures, the calling signature for these system calls differ, for the reasons described in B<syscall>(2).
de: Auf einigen 32-Bit-Architekturen unterscheidet sich die Aufrufsignatur dieser Systemaufrufe. Die Gründe sind in B<syscall>(2) beschrieben.

source: BUGS
de: FEHLER

source: A header file bug in glibc 2.12 meant that the minimum value of B<_POSIX_C_SOURCE> required to expose the declaration of B<ftruncate>() was 200809L instead of 200112L. This has been fixed in later glibc versions.
de: Ein Fehler der Header-Dateien von Glibc 2.12 hatte zur Folge, dass der erforderliche Minimalwert von B<_POSIX_C_SOURCE> zur Bereitstellung der Deklaration von B<ftruncate>() 200809L war anstatt 200112L. Der Fehler ist in späteren Versionen der Glibc behoben.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.13 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: B<int truncate(const char *>I<path>B<, off_t >I<length>B<);>
de: B<int truncate(const char *>I<Pfad>B<, off_t >I<Länge>B<);>

source: B<int ftruncate(int >I<fd>B<, off_t >I<length>B<);>
de: B<int ftruncate(int >I<dd>B<, off_t >I<Länge>B<);>

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Seit Glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.3.5: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
de: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Seit Glibc 2.3.5: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 5.10 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
de: || /* Seit Glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc-Versionen E<lt>= 2.19: */ _BSD_SOURCE

source: B<ftruncate>() can also be used to set the size of a POSIX shared memory object; see B<shm_open>(7).
de: B<ftruncate>() kann auch dazu verwandt werden, die Größe eines gemeinsam benutzten POSIX-Speicherobjektes zu setzen; siehe B<shm_open>(7).

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 4.16 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%https://www.kernel.org/doc/man-pages/.
