Repository: sebras/manpages-l10n
Catalog: po/*/man2/umask.2.po
Languages: it, nl

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux
nl: Linux Programmeurs Handleiding

source: NAME
it: NOME
nl: NAAM

source: umask - set file mode creation mask
it: umask - imposta la maschera di creazione del modo di un file
nl: umask - zet het maak-bestand masker

source: SYNOPSIS
it: SINTASSI
nl: SAMENVATTING

source: DESCRIPTION
it: DESCRIZIONE
nl: BESCHRIJVING

source: B<umask>() sets the calling process's file mode creation mask (umask) to I<mask> & 0777 (i.e., only the file permission bits of I<mask> are used), and returns the previous value of the mask.
it: B<umask>() imposta la maschera di creazione dei permessi dei file del processo chiamante (umask) a I<mask> & 0777 (cioè vengono usati solo i bit dei permessi dei file di I<mask>), e restituisce il valore precedente della maschera.
nl: B<umask>() zet het maak-bestand mode masker (umask) van het aanroepende proces op I<masker> & 0777 (m.a.w. alleen de bestandsrechten bits van I<masker> worden gebruikt), en geeft de vorige waarde van het masker terug.

source: The umask is used by B<open>(2), B<mkdir>(2), and other system calls that create files to modify the permissions placed on newly created files or directories. Specifically, permissions in the umask are turned off from the I<mode> argument to B<open>(2) and B<mkdir>(2).
it: La umask è usata da B<open>(2), B<mkdir>(2), e altre chiamate di sistema che creano file per modificare i permessi dati ai nuovi file o directory. Nello specifico i permessi nella umask sono disattivati dall'argomento I<mode> in B<open>(2) e B<mkdir>(2).
nl: Het umask wordt gebruikt door B<open>(2), B<mkdir>(2) en andere systeem aanroepen die bestanden aanmaken door het modificeren van rechten ingesteld voor nieuw aangemaakte bestanden of mappen. Specifiek worden rechten in het umask uitgezet via het I<mode> argument van B<open>(2) en B<mkdir>(2).

source: Alternatively, if the parent directory has a default ACL (see B<acl>(5)), the umask is ignored, the default ACL is inherited, the permission bits are set based on the inherited ACL, and permission bits absent in the I<mode> argument are turned off. For example, the following default ACL is equivalent to a umask of 022:
it: In alternativa, se la directory genitrice ha un ACL predefnito (vedi B<acl>(5)), la umask viene ignorata, la ACL predefinita viene ereditata, i bit dei permessi vengono impostati sulla base della ACL ereditata, e i bit dei permessi assenti nell'argomento I<mode> vengono disattivati. Per esempio, la seguente ACL predefinita è equivalente a una umask di 022:
nl: Alternatief, als de ouder map een standaard ACL heeft (zie B<acl>(5)), dan wordt umask genegeerd, de standaard ACL wordt geërfd, de rechten bits worden gezet gebaseerd op de geërfde ACL, en de afwezige rechten bits in het I<mode> argument worden uitgezet. Bij voorbeeld, de volgende standaard ACL is equivalent aan een umask van 022:

source: Combining the effect of this default ACL with a I<mode> argument of 0666 (rw-rw-rw-), the resulting file permissions would be 0644 (rw-r--r--).
it: Combinando gli effetti di questa ACL predefinita con un argomento I<mode> di 0666 (rw-rw-rw-), i permessi sul file risultanti dovrebbero essere 0644 (rw-r--r--).
nl: Met het gecombineerde effect van deze standaard ACL met een I<mode> argument van 0666 (rw-rw-rw-), zouden de resulterende bestandsrechten 0644 (rw-r--r--) zijn.

source: The constants that should be used to specify I<mask> are described in B<inode>(7).
it: Le costanti che possono essere utilizzate per specificare la I<mask> sono descritte in B<inode>(7).
nl: De constanten die gebruikt moeten worden om I<masker> te specificeren zijn beschreven in B<inode>(7).

source: The typical default value for the process umask is I<S_IWGRP\ |\ S_IWOTH> (octal 022). In the usual case where the I<mode> argument to B<open>(2) is specified as:
it: Il tipico valore predefinito per il processo umask è I<S_IWGRP\ |\ S_IWOTH> (ottale 022). Nel caso comune in cui l'argomento I<mode> di B<open>(2) a specificato come:
nl: De typische standaard waarde voor een proces masker is I<S_IWGRP\ |\ S_IWOTH> (octaal 022). In het normale geval waar het I<mode> argument van B<open>(2) is gegeven als:

source: (octal 0666) when creating a new file, the permissions on the resulting file will be:
it: (ottale 0666) quando si crea un nuovo file, i permessi sul file risultante saranno:
nl: (octaal 0666) bij het aanmaken van een nieuw bestand, zullen de rechten van het resulterend bestand zijn:

source: (because 0666 & \(ti022 = 0644; i.e., rw-r--r--).
it: (perché 0666 & \(ti022 = 0644; i.e., rw-r--r--).
nl: (omdat 0666 & \(ti022 = 0644; m.a.w.., rw-r--r--).

source: RETURN VALUE
it: VALORE RESTITUITO
nl: EIND WAARDE

source: This system call always succeeds and the previous value of the mask is returned.
it: Questa chiamata di sistema ha sempre successo, e restituisce il valore precedente della maschera.
nl: Deze systeem aanroep lukt altijd en de vorige waarde van het masker wordt teruggegeven.

source: CONFORMING TO
it: CONFORME A
nl: VOLDOET AAN

source: NOTES
it: NOTE
nl: OPMERKINGEN

source: A child process created via B<fork>(2) inherits its parent's umask. The umask is left unchanged by B<execve>(2).
it: Un processo figlio creato attraverso B<fork>(2) eredita la umask del genitore. La umask viene lasciata inalterata da B<execve>(2).
nl: Een kind proces aangemaakt met B<fork>(2) erft het umask van zijn ouder. Het umask wordt niet verandert door B<execve>(2).

source: It is impossible to use B<umask>() to fetch a process's umask without at the same time changing it. A second call to B<umask>() would then be needed to restore the umask. The nonatomicity of these two steps provides the potential for races in multithreaded programs.
it: É impossibile chiamare B<umask>() per ottenere un "umask" del processo senza allo stesso tempo modificarlo. Una seconda chiamata a B<umask>() sarebbe poi necessaria per ripristinare la "umask" originale. Il fatto che queste due fasi non siano indipendenti fra loro rende possibili situazioni di conflitto nel caso di programmi multithread.
nl: Het is onmogelijk om B<umask>() te gebruiken om het umask van een proces op te halen zonder dit tegelijkertijd te veranderen. Een tweede aanroep van B<umask>() zou dan nodig zijn om de umask te herstellen. Het niet-atomair zijn van deze twee stappen zorgt er voor dat er z.g. races kunnen zijn in multi-threaded programma´s.

source: Since Linux 4.7, the umask of any process can be viewed via the I<Umask> field of I</proc/[pid]/status>. Inspecting this field in I</proc/self/status> allows a process to retrieve its umask without at the same time changing it.
it: A partire da Linux 4.7, l'umask può essere vista tramite il campo I<Umask> di I</proc/[pid]/status>. La visualizzazione di questo campo in I</proc/self/status> consente a un processo di ottenere la propria "umask" senza allo stesso tempo modificarla.
nl: Vanaf Linux 4.7, kan het umask van elk proces bekeken worden in het I<Umask> veld van I</proc/[pid]/status>. Door het inspecteren van dit veld in I</proc/self/status> kan een proces zijn umask ophalen zonder het tegelijkertijd te veranderen.

source: The umask setting also affects the permissions assigned to POSIX IPC objects (B<mq_open>(3), B<sem_open>(3), B<shm_open>(3)), FIFOs (B<mkfifo>(3)), and UNIX domain sockets (B<unix>(7)) created by the process. The umask does not affect the permissions assigned to System\ V IPC objects created by the process (using B<msgget>(2), B<semget>(2), B<shmget>(2)).
it: L'impostazione di umask influenza anche i permessi assegnati agli oggetti IPC POSIX (B<mq_open>(3), B<sem_open>(3), B<shm_open>(3)), FIFO (B<mkfifo>(3)) e sui socket di dominio Unix (B<unix>(7)) creati dai processi. L'umask non influenza i permessi assegnati agli oggetti IPC System V\ creati dal processo (usando B<msgget>(2), B<semget>(2), B<shmget>(2)).
nl: De umask instelling beïnvloed ook de rechten toegekend aan POSIX IPC objecten (B<mq_open>(3), B<sem_open>(3), B<shm_open>(3)), FIFOs (B<mkfifo>(3)), en UNIX domein sockets (B<unix>(7)) aangemaakt door het proces. Het umask beïnvloed de rechten toegekend aan System\ V IPC objecten aangemaakt door het proces niet (gebruik makend van B<msgget>(2), B<semget>(2), B<shmget>(2)).

source: SEE ALSO
it: VEDERE ANCHE
nl: ZIE OOK

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.12 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.12 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: B<mode_t umask(mode_t >I<mask>B<);>
nl: B<mode_t umask(mode_t >I<masker>B<);>

source: (because 0666 & ~022 = 0644; i.e., rw-r--r--).
it: (perché 0666 & ~022 = 0644; cioè rw-r--r--).
nl: (omdat 0666 & ~022 = 0644; i.e., rw-r--r--).

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.04 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
