Repository: sebras/manpages-l10n
Catalog: po/*/man2/utime.2.po
Languages: it, nl

source: NAME
it: NOME
nl: NAAM

source: utime, utimes - change file last access and modification times
it: utime, utimes - cambia l'ultimo orario di accesso e di modifica di un file
nl: utime, utimes - verander toegangs en/of wijzigings tijden van een bestand

source: SYNOPSIS
it: SINTASSI
nl: SAMENVATTING

source: B<#include E<lt>utime.hE<gt>>
nl: B<#include E<lt>time.hE<gt>>

source: B<int utime(const char *>I<filename>B<, const struct utimbuf *>I<times>B<);>
nl: B<int utime(const char *>I<bestandsnaam>B<, const struct utimbuf *>I<times>B<);>

source: B<int utimes(const char *>I<filename>B<, const struct timeval >I<times>B<[2]);>
nl: B<int utimes(const char *>I<bestandsnaam>B<, const struct timeval >I<times>B<[2]);>

source: DESCRIPTION
it: DESCRIZIONE
nl: BESCHRIJVING

source: B<Note:> modern applications may prefer to use the interfaces described in B<utimensat>(2).
it: B<Nota:> le applicaizoni moderne potrebbero preferire le interfacce descritte in B<utimensat>(2).
nl: B<OPMERKING:> moderne applicaties zouden beter de interfaces gebruiken zoals beschreven in B<utimensat>(2).

source: If I<times> is NULL, then the access and modification times of the file are set to the current time.
it: Se I<times> è NULL, allora gli orari di accesso e modifica del file sono impostati a quelli correnti.
nl: Als I<buf> NULL is, dan worden de toegangs- en wijzigingstijden van het bestand naar de huidige tijd gezet.

source: Changing timestamps is permitted when: either the process has appropriate privileges, or the effective user ID equals the user ID of the file, or I<times> is NULL and the process has write permission for the file.
it: Cambiare le marcature orarie è permesso quando: o il processo ha i privilegi appropriati, o la user ID effettiva dell'utente è uguale alla user ID del file, o I<times> è NULL e il processo ha permessi di scrittura sul file.
nl: Het veranderen van tijdstempels is toegestaan indien: of het proces heeft passende rechten, of het effectieve gebruiker ID is gelijk aan het gebruiker ID van het bestand, of I<times> is NULL en het proces heeft schrijfrechten voor het bestand.

source: The I<utimbuf> structure is:
it: La struttura I<utimbuf> è la seguente:
nl: De I<utimbuf> structuur is:

source: struct utimbuf { time_t actime; /* access time */ time_t modtime; /* modification time */ };
it: struct utimbuf { time_t actime; /* ora di accesso */ time_t modtime; /* ora di modifica */ };
nl: struct utimbuf { time_t actime; /* toegangs tijd */ time_t modtime; /* wijziging tijd */ };

source: The B<utime>() system call allows specification of timestamps with a resolution of 1 second.
it: La chiamata di sistema B<utime>() permette di specificare le marcature orarie con una risoluzione di 1 secondo.
nl: De B<utime>() systeem aanroep staat specificatie van de tijdstempels met een resolutie van 1 seconde toe.

source: The B<utimes>() system call is similar, but the I<times> argument refers to an array rather than a structure. The elements of this array are I<timeval> structures, which allow a precision of 1 microsecond for specifying timestamps. The I<timeval> structure is:
it: La chiamata di sistema B<utimes>() è simile, ma gli argomenti di I<times> fanno riferimento ad un array, non a una struttura. Gli elementi di questo array sono strutture I<timeval>, che permettono una precisione di 1 microsecondo nello specificare data e ora. La struttura I<timeval> è la seguente:
nl: De B<utimes>() systeem aanroep is vergelijkbaar, maar het I<times> argument verwijst naar een tabel in plaats van een structure. De elementen van de tabel zijn I<timeval> structures, die toestaan de precisie van tijdstempels met 1 microseconde op te geven. De I<timeval> structure is:

source: struct timeval { long tv_sec; /* seconds */ long tv_usec; /* microseconds */ };
it: struct timeval { long tv_sec; /* secondi */ long tv_usec; /* microsecondi */ };
nl: struct timeval { long tv_sec; /* seconden */ long tv_usec; /* microseconden */ };

source: I<times[0]> specifies the new access time, and I<times[1]> specifies the new modification time. If I<times> is NULL, then analogously to B<utime>(), the access and modification times of the file are set to the current time.
it: I<times[0]> specifica la nuova ora di accesso, e I<times[1]> specifica la nuova ora di modifica. Se I<times> è NULL, analogamente a B<utime>(), le date di accesso e modifica del file sono impostate a quelle correnti.
nl: I<times[0]> specificeert de nieuwe toegangstijd, en I<times[1]> specificeert te nieuwe wijzigingstijd. Als I<times> gelijk is aan NULL, dan worden analoog aan B<utime>(), de toegangs- en wijzigingstijd van het bestand gezet op de huidige tijd.

source: RETURN VALUE
it: VALORE RESTITUITO
nl: EIND WAARDE

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato per indicare l'errore.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: ERRORS
it: ERRORI
nl: FOUTEN

source: Search permission is denied for one of the directories in the path prefix of I<path> (see also B<path_resolution>(7)).
it: Il permesso di ricerca è negato per una delle directory nel prefisso del percorso di I<path> (vedere anche B<path_resolution>(7)).
nl: Zoek rechten werden geweigerd voor een van de mappen in het pad voorvoegsel van I<pad> (zie ook B<path_resolution>(7)).

source: I<times> is NULL, the caller's effective user ID does not match the owner of the file, the caller does not have write access to the file, and the caller is not privileged (Linux: does not have either the B<CAP_DAC_OVERRIDE> or the B<CAP_FOWNER> capability).
it: I<times> è NULL, l'ID effettivo dell'utente chiamante non corrisponde a quello del proprietario del file, il chiamante non ha accesso in scrittura al file, e il chiamante non ha i privilegi necessari (Linux: non ha capacità B<CAP_DAC_OVERRIDE> o B<CAP_FOWNER>).
nl: I<times> is NULL, de effectieve gebruiker ID komt niet overeen met de eigenaar van het bestand, de aanroeper heeft geen schrijfrechten naar het bestand en de aanroeper is niet gerechtigd (Linux: heeft ofwel de B<CAP_DAC_OVERRIDE> ofwel de B<CAP_FOWNER> capaciteit niet).

source: I<filename> does not exist.
it: I<filename> non esiste.
nl: I<bestandsnaam> bestaat niet.

source: I<times> is not NULL, the caller's effective UID does not match the owner of the file, and the caller is not privileged (Linux: does not have the B<CAP_FOWNER> capability).
it: I<times> non è NULL, l'UID effettivo del chiamante non corrisponde al proprietario del file, e il chiamante non ha i privilegi necessari (Linux: non ha capacità B<CAP_FOWNER>).
nl: I<times> is niet NULL, de effectieve gebruiker ID komt niet overeen met de eigenaar van het bestand, de aanroeper is niet gerechtigd (Linux: heeft ofwel de de B<CAP_FOWNER> capaciteit niet).

source: I<path> resides on a read-only filesystem.
it: I<path> risiede su un filesystem in sola lettura.
nl: I<pad> verblijft op een alleen-lezen bestandsysteem.

source: B<utime>(): SVr4, POSIX.1-2001. POSIX.1-2008 marks B<utime>() as obsolete.
it: B<utime>(): SVr4, POSIX.1-2001. POSIX.1-2008 marca B<utime>() come obsoleto.
nl: B<utime>(): SVr4, POSIX.1-2001. POSIX.1-2008 markeert B<utime>() als verouderd.

source: NOTES
it: NOTE
nl: OPMERKINGEN

source: Linux does not allow changing the timestamps on an immutable file, or setting the timestamps to something other than the current time on an append-only file.
it: Linux non permette di cambiare data e ora su un file immutabile, o di impostarle a qualcosa di diverso dall'ora corrente in un file di tipo append-only.
nl: Linux staat niet toe tijdstempels op een onveranderlijk bestand te veranderen, of het zetten van tijdstempels op iets anders dan de huidige tijd op een alleen-toevoegen bestand.

source: SEE ALSO
it: VEDERE ANCHE
nl: ZIE OOK

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux
nl: Linux Programmeurs Handleiding

source: The B<utime>() system call changes the access and modification times of the inode specified by I<filename> to the I<actime> and I<modtime> fields of I<times> respectively.
it: La chiamata di sistema B<utime>() cambia gli orari di accesso e di modifica dell'inode specificato da I<filename> rispettivamente con quelle contenute nei campi I<actime> e I<modtime> di I<times>.
nl: B<utime>() veranderd de toegangs- en wijzigingstijden van een inode, opgegeven in I<bestandsnaam> naar respectievelijk de I<actime> en I<modtime> velden van I<buf>.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
it: In caso di successo restituisce zero. In caso di errore restituisce -1, e I<errno> verrà impostato di conseguenza.
nl: Bij succes wordt nul teruggegeven. Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: CONFORMING TO
it: CONFORME A
nl: VOLDOET AAN

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: I<times>[0] specifies the new access time, and I<times>[1] specifies the new modification time. If I<times> is NULL, then analogously to B<utime>(), the access and modification times of the file are set to the current time.
it: I<times>[0] specifica la nuova ora di accesso, e I<times>[1] specifica la nuova ora di modifica. Se I<times> è NULL, analogamente a B<utime>(), le date di accesso e modifica del file sono impostate a quelle correnti.
nl: I<times[0]> specificeert de nieuwe toegangstijd, en I<times[1]> specificeert te nieuwe wijzigingstijd. Als I<times> gelijk is aan NULL, dan worden analoog aan B<utime>(), de toegangs- en wijzigingstijd van het bestand gezet op de huidige tijd.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.
