Repository: sebras/manpages-l10n
Catalog: po/*/man2/write.2.po
Languages: it, nl

source: NAME
it: NOME
nl: NAAM

source: write - write to a file descriptor
it: write - Scrive su un descrittore di file
nl: write - schrijf naar een bestandsindicator

source: SYNOPSIS
it: SINTASSI
nl: SAMENVATTING

source: B<ssize_t write(int >I<fd>B<, const void *>I<buf>B<, size_t >I<count>B<);>
nl: B<ssize_t write(int >I<bi>B<, const void *>I<buf>B<, size_t >I<tel>B<);>

source: DESCRIPTION
it: DESCRIZIONE
nl: BESCHRIJVING

source: B<write>() writes up to I<count> bytes from the buffer starting at I<buf> to the file referred to by the file descriptor I<fd>.
it: B<write>() scrive fino a I<count> byte dal buffer che inizia da I<buf> nel file a cui fa riferimento il descrittore di file I<fd>.
nl: B<write>() schrijft tot I<tel> bytes naar het bestand waar I<bi> naar wijst, van de buffer die begint op I<buf>.

source: The number of bytes written may be less than I<count> if, for example, there is insufficient space on the underlying physical medium, or the B<RLIMIT_FSIZE> resource limit is encountered (see B<setrlimit>(2)), or the call was interrupted by a signal handler after having written less than I<count> bytes. (See also B<pipe>(7).)
it: Il numero di byte scritti potrebbe essere meno di I<count> se, per esempio, non c'è spazio sufficiente sul supporto fisico sottostante, o se si raggiunge il limite della risorsa B<RLIMIT_FSIZE> (vedere B<setrlimit>(2)), o se la chiamata è stata interrotta da un handler di segnale dopo che ha scritto meno di I<count> byte (vedere anche B<pipe>(7)).
nl: Het aantal geschreven bytes kan kleiner zijn dan I<tel> als bijvoorbeeld er onvoldoende ruimte was op het onderliggende fysieke medium, of als de B<RLIMIT_FSIZE> hulpbron limiet werd bereikt (zie B<setrlimit>(2)), of als de aanroep werd geïnterrumpeerd door een signaal nadat het minder dan I<tel> bytes geschreven had. (Zie ook B<pipe>(7).)

source: For a seekable file (i.e., one to which B<lseek>(2) may be applied, for example, a regular file) writing takes place at the file offset, and the file offset is incremented by the number of bytes actually written. If the file was B<open>(2)ed with B<O_APPEND>, the file offset is first set to the end of the file before writing. The adjustment of the file offset and the write operation are performed as an atomic step.
it: Per un file che si può spostare (cioè un file a cui si può applicare B<lseek>(2), per esempio un file regolare), la scrittura viene eseguita all'offset del file, e l'offset del file viene incrementato dal numero di byte effettivamente scritti. Se il file è stato aperto da B<open>(2) con B<O_APPEND>, l'offset del file viene prima impostato alla fine del file, e poi scritto. La regolazione dell'offset del file e l'operazione di scrittura vengono eseguite come un'operazione atomica.
nl: In een doorzoekbaar bestand (m.a.w. een op welk B<lseek>(2) toegepast kan worden, bijvoorbeeld een regulier bestand) wordt geschreven aan de bestandspositie, en de positie wordt verhoogd met het daadwerkelijk geschreven aantal bytes. Als het bestand geB<open>(2)d werd met B<O_APPEND>. dan wordt de bestandspositie eerst gezet op het einde van het bestand voor schrijven. De aanpassing van de bestandspositie en de schrijf operatie worden in een ondeelbare stap gedaan.

source: POSIX requires that a B<read>(2) that can be proved to occur after a B<write>() has returned will return the new data. Note that not all filesystems are POSIX conforming.
it: POSIX richiede che una chiamata B<read>(2) avvenuta dopo l'esecuzione di una chiamata B<write>() restituisca i nuovi dati. Notare che non tutti i filesystem sono conformi a POSIX.
nl: POSIX eist dat een B<read>(2) die bewijsbaar na een B<write>() plaatsvindt de nieuwe gegevens oplevert. Merk op dat niet alle bestandsystemen voldoen aan POSIX.

source: According to POSIX.1, if I<count> is greater than B<SSIZE_MAX>, the result is implementation-defined; see NOTES for the upper limit on Linux.
it: Secondo POSIX.1, se I<count> è maggiore di B<SSIZE_MAX>, il risultato è definito dall'implementazione; vedi NOTE per il limite superiore in Linux.
nl: Volgens POSIX.1 als I<tel> groter is dan B<SSIZE_MAX> dan is het resultaat implementatie afhankelijk; zie OPMERKINGEN voor de boven grens op Linux.

source: RETURN VALUE
it: VALORE RESTITUITO
nl: EIND WAARDE

source: On success, the number of bytes written is returned. On error, -1 is returned, and I<errno> is set to indicate the error.
it: Se è andato tutto bene, la funzione restituisce il numero di byte scritti. In caso di errore viene restituito -1, e I<errno> viene impostato per indicare l'errore.
nl: Bij success wordt het aantal geschreven bytes teruggegeven. Bij falen wordt -1 teruggegeven en I<errno> wordt overeenkomstig gezet.

source: Note that a successful B<write>() may transfer fewer than I<count> bytes. Such partial writes can occur for various reasons; for example, because there was insufficient space on the disk device to write all of the requested bytes, or because a blocked B<write>() to a socket, pipe, or similar was interrupted by a signal handler after it had transferred some, but before it had transferred all of the requested bytes. In the event of a partial write, the caller can make another B<write>() call to transfer the remaining bytes. The subsequent call will either transfer further bytes or may result in an error (e.g., if the disk is now full).
it: Si noti che una chiamata B<write>() andata a buon fine può trasferire meno di I<count> byte. Tali scritture parziali possono avvenire per diverse ragioni; per esempio, perché lo spazio sul dispositivo del disco era insufficiente per scrivere tutti i byte richiesti, o perché una chiamata B<write>() bloccata su un socket, una pipe, o simili è stata interrotta da un gestore di segnale dopo che aveva trasferito alcuni byte, ma prima di aver trasferito tutti quelli richiesti. Nel caso di un write parziale, il chiamante può fare un'altra chiamata a B<write>() per trasferire i byte rimanenti. La chiamata successiva o trasferisce ulteriori byte o può determinare un errore (e.g., se il disco ora è pieno).
nl: Merk op dat een succesvolle B<write>() ook minder dan I<tel> bytes kan overdragen. Zulke partiële schrijf resultaten kunnen optreden door diverse redenen; bij voorbeeld, omdat er niet genoeg ruimte op het schijf apparaat was om alle gevraagde bytes te schrijven, of omdat een geblokkeerde B<write>() naar een socket, pijp, of vergelijkbaar werd onderbroken door een signaal nadat het enkele, maar voor dat het alle gevraagde bytes had geschreven. Als zulk een partieel schrijf resultaat optreedt dan kan de aanroeper een andere B<write>() aanroepen om de resterende bytes over te dragen. Deze aanroep kan de resterende bytes overdragen of resulteren in een fout (b.v. de schijf is nu vol).

source: If I<count> is zero and I<fd> refers to a regular file, then B<write>() may return a failure status if one of the errors below is detected. If no errors are detected, or error detection is not performed, 0 is returned without causing any other effect. If I<count> is zero and I<fd> refers to a file other than a regular file, the results are not specified.
it: Se I<count> è zero, e I<fd> fa riferimento ad un file regolare, B<write>() può restituire uno stato di insuccesso se viene rilevato uno degli errori descritti più avanti. Se non vengono rilevati errori, o se non la rilevazione degli errori non è eseguita, restituisce 0 senza causare altri effetti. Se I<count> è zero e I<fd> fa riferimento ad un file diverso da uno regolare, i risultati non sono specificati.
nl: Als I<tel> nul is en I<bi> wijst naar een normaal bestand dan kan B<write>() een fout status teruggeven als een van de hieronder gegeven fouten werd gedetecteerd. Als een fouten worden gedetecteerd of fout detectie is niet gedaan, dan wordt 0 teruggegeven zonder enig andere effect te veroorzaken. Als I<tel> nul is en I<bi> wijst naar een bestand anders dan een regulier bestand, dan zijn de resultaten onbepaald.

source: ERRORS
it: ERRORI
nl: FOUTEN

source: The file descriptor I<fd> refers to a file other than a socket and has been marked nonblocking (B<O_NONBLOCK>), and the write would block. See B<open>(2) for further details on the B<O_NONBLOCK> flag.
it: Il descrittore di file I<fd> fa riferimento a un file diverso da un socket ed è stato marcato come non bloccante (B<O_NONBLOCK>), e la scrittura si bloccherebbe. Vedi B<open>(2) per ulteriori dettagli sull'opzione B<O_NONBLOCK>.
nl: De file beschrijving I<bi> wijst naar een ander bestand dan een socket en is gemarkeerd als niet-blokkerend (B<O_NONBLOCK>), en de schrijf aanroep zou blokkeren. Zie B<open>(2) voor meer details over de B<O_NONBLOCK> vlag.

source: B<EAGAIN> or B<EWOULDBLOCK>
it: B<EAGAIN> o B<EWOULDBLOCK>
nl: B<EAGAIN> of B<EWOULDBLOCK>

source: The file descriptor I<fd> refers to a socket and has been marked nonblocking (B<O_NONBLOCK>), and the write would block. POSIX.1-2001 allows either error to be returned for this case, and does not require these constants to have the same value, so a portable application should check for both possibilities.
it: Il descrittore di file I<fd> fa riferimento a un diverso da un socket ed è stato marcato come non bloccante (B<O_NONBLOCK>), e la scrittura si bloccherebbe. POSIX.1-2001 consente che venga restituito uno qualsiasi dei due errori per questo caso, e non richiede che queste costanti abbiano lo stesso valore, per cui un'applicazione portabile dovrebbe verificare entrambe le possibilità.
nl: De file beschrijving I<bi> wijst naar een ander bestand dan een socket en is gemarkeerd als niet-blokkerend (B<O_NONBLOCK>), en de schrijf aanroep zou blokkeren. Zie B<open>(2) voor meer details over de B<O_NONBLOCK> vlag. POSIX.1-2001 staat toe in dit geval een fout terug te geven, en vereist niet dat deze constanten dezelfde waarde hebben, daarom moet een overdraagbare applicatie op beide mogelijkheden controleren.

source: I<fd> is not a valid file descriptor or is not open for writing.
it: I<fd> non è un decrittore di file valido o non è aperto in scrittura.
nl: I<bi> is geen geldige bestandsindicator, of is niet open voor lezen.

source: I<fd> refers to a datagram socket for which a peer address has not been set using B<connect>(2).
it: I<fd> fa riferimento a un socket a datagrammi per il quale un indirizzo dello stesso livello non è stato impostato usando B<connect>(2).
nl: I<bi> wijst naar een datagram socket waarvoor een gelijk adres niet ingesteld werd gebruikmakend van B<connect>(2).

source: The user's quota of disk blocks on the filesystem containing the file referred to by I<fd> has been exhausted.
it: La quota utente di blocchi del disco sul filesystem contenente il file a cui I<fd> fa riferimento è esaurita.
nl: De quota van de gebruiker van schijf blokken op het bestandssysteem bevattende het bestand aangewezen door I<bi> is opgebruikt.

source: I<buf> is outside your accessible address space.
it: I bufè al di fuori del proprio spazio di indirizzamento accessibile.
nl: I<buf> ligt buiten de door u toegankelijke adres ruimte.

source: An attempt was made to write a file that exceeds the implementation-defined maximum file size or the process's file size limit, or to write at a position past the maximum allowed offset.
it: È stato fatto un tentativo di scrivere un file che supera la massima dimensione del file definita dall'implementazione o il limite di dimensione del file del processo, o di scrivere ad una posizione oltre il massimo offset consentito.
nl: Een poging werd ondernomen om een bestand te schrijven dat de implementatie-bepaalde maximum bestand grootte of een proces bestand grootte limiet overschrijd, of naar een schrijf actie bij een positie voorbij de maximaal toegestane positie.

source: The call was interrupted by a signal before any data was written; see B<signal>(7).
it: La chiamata è stata interrotta da un segnale prima che sia stato scritto qualunque dato; vedere B<signal>(7).
nl: De aanroep werd onderbroken door een signaal voordat gegevens werden geschreven; zie B<signal>(7).

source: I<fd> is attached to an object which is unsuitable for writing; or the file was opened with the B<O_DIRECT> flag, and either the address specified in I<buf>, the value specified in I<count>, or the file offset is not suitably aligned.
it: I<fd> è attaccato a un oggetto su cui non si può scrivere; o il file è stato aperto con l'opzione B<O_DIRECT>, e l'indirizzo specificato in I<buf>, o il valore specificato in I<count>, o l'offset del file non è correttamente allineato.
nl: I<bi> is gekoppeld aan een object dat ongeschikt is om naar te schrijven; of het bestand werd geopend met de B<O_DIRECT> vlag, en ofwel het opgegeven adres in I<buf>, de waarde opgegeven in I<count>, of de bestandspositie is niet goed opgelijnd.

source: A low-level I/O error occurred while modifying the inode. This error may relate to the write-back of data written by an earlier B<write>(), which may have been issued to a different file descriptor on the same file. Since Linux 4.13, errors from write-back come with a promise that they I<may> be reported by subsequent. B<write>() requests, and I<will> be reported by a subsequent B<fsync>(2) (whether or not they were also reported by B<write>()). An alternate cause of B<EIO> on networked filesystems is when an advisory lock had been taken out on the file descriptor and this lock has been lost. See the I<Lost locks> section of B<fcntl>(2) for further details.
it: B<EIO> Un errore I/O di basso livello è accaduto mentre si modificava l'inode. Quest'errore può riguardare il "write-back" di dati scritti da un precedente B<write>(), che può essere stato eseguito usando un altro descrittore di file che serviva per accedere allo stesso file. A partire da Linux 4.13, gli errori derivanti da write-back si presentano con la speranza che I<possano> essere riportati da successive richieste di B<write>(), e I<verranno> riportati da un successivo B<fsync>(2) (che siano stati riportati o no anche da B<write>()). Un'altra causa di B<EIO> su filesystem collegati in rete è quando un lock consigliato (advisory lock) era già stato scaricato sul descrittore di file e questo lock è stato perso. Si veda la sezione I<Lost locks> di B<fcntl>(2) per ulteriori dettagli.
nl: Een laag-niveau Invoer/Uitvoer fout trad op terwijl de inode veranderd werd. Deze fout kan gerelateerd zijn aan een schrijf-terug van gegevens geschreven door een eerdere B<write>(), die kan zijn gedaan via een andere bestandsbeschrijving op hetzelfde bestand. Vanaf Linux 4.13, komen fouten van een schrijf-terug terug met de belofte dat ze gerapporteerd I<kunnen> worden door volgende B<write>() aanroepen en worden gerapporteerd door een volgende B<fsync>(2) (al dan niet ook gerapporteerd door B<write>()). Een alternatief geval van B<EIO> op netwerk bestandssystemen is wanneer een geadviseerde lock werd verwijderd op de bestandsbeschrijving en als die lock verloren werd. Zie de I<Verloren Locks> sectie van B<fcntl>(2) voor meer details.

source: The device containing the file referred to by I<fd> has no room for the data.
it: Il dispositivo contenente il file a cui fa riferimento I<fd> non ha spazio per i dati.
nl: Het apparaat dat het bestand bevat waar I<bi> naar wijst heeft geen ruimte voor de gegevens.

source: The operation was prevented by a file seal; see B<fcntl>(2).
it: L'operazione è stata impedita da una restrizione sul file; vedi B<fcntl>(2).
nl: De operatie werd voorkomen door een bestandszegel; zie B<fcntl>(2).

source: I<fd> is connected to a pipe or socket whose reading end is closed. When this happens the writing process will also receive a B<SIGPIPE> signal. (Thus, the write return value is seen only if the program catches, blocks or ignores this signal.)
it: I<fd> è connesso a una pipe o un socket la cui lettura è chiusa. Quando ciò accade il processo di scrittura riceverà anche un segnale B<SIGPIPE>. (Quindi il valore restituito in scrittura è visto solo se il programma intercetta, blocca o ignora questo segnale).
nl: I<bi> is verbonden met een pijp of socket waarvan de lees-uitgang gesloten is. Wanneer dit gebeurd ontvangt het schrijvende proces een B<SIGPIPE> signaal; (Dus, de uitvoer waarde van de write wordt alleen gezien als het programma het signaal ontvangt, blokkeert of negeert.)

source: Other errors may occur, depending on the object connected to I<fd>.
it: Possono accadere altri errori, in funzione dell'oggetto connesso a I<fd>.
nl: Andere fouten kunnen optreden afhankelijk van dat wat verbonden is met I<bi>.

source: Under SVr4 a write may be interrupted and return B<EINTR> at any point, not just before any data is written.
it: Sotto SVr4 una scrittura può essere interrotta e restituire B<EINTR> in qualsiasi punto, non solo prima che venga scritto un dato.
nl: Under SVr4 kan een write op elk punt onderbroken worden en B<EINTR> teruggeven, niet alleen voordat enige gegevens zijn geschreven.

source: NOTES
it: NOTE
nl: OPMERKINGEN

source: The types I<size_t> and I<ssize_t> are, respectively, unsigned and signed integer data types specified by POSIX.1.
it: Tipi I<size_t> e I<ssize_t> sono tipi di dati interi specificati da POSIX.1, rispettivamente senza segno e con segno.
nl: De typen I<size_t> en I<ssize_t> zijn, respectively, gehele getal typen met of zonder teken zoals gespecificeerd door POSIX.1.

source: A successful return from B<write>() does not make any guarantee that data has been committed to disk. On some filesystems, including NFS, it does not even guarantee that space has successfully been reserved for the data. In this case, some errors might be delayed until a future B<write>(), B<fsync>(2), or even B<close>(2). The only way to be sure is to call B<fsync>(2) after you are done writing all your data.
it: Un ritorno con successo da B<write>() non dà alcuna garanzia che i dati siano stati trasferiti sul disco. Su alcuni filesystem, compreso NFS, esso non garantisce che questo spazio sia stato riservato per i dati in modo corretto. In questo caso, alcuni errori potrebbero essere differiti fino a un futuro B<write>(), B<fsync>(2), o anche B<close>(2). Il solo modo per essere sicuri è di chiamare B<fsync>(2) dopo che si è eseguita la scrittura di tutti i propri dati.
nl: Een succesvolle terugkeer uit B<write>() is geen garantie dat de gegevens zijn toegekend aan de schijf. Op sommige bestandssystemen, inclusief NFS, is het zelfs geen garantie dat de ruimte succesvol werd gereserveerd voor de gegevens. In dit geval, kunnen sommige fouten worden vertraagd tot een toekomstige B<write>(), B<fsync>(2), of zelfs B<close>(2). De enige manier om zeker te zijn is door B<fsync>(2) aan te roepen, nadat u klaar bent met het schrijven van alle gegevens.

source: If a B<write>() is interrupted by a signal handler before any bytes are written, then the call fails with the error B<EINTR>; if it is interrupted after at least one byte has been written, the call succeeds, and returns the number of bytes written.
it: Se una scrittura con B<write>() viene interrotta da un handler di segnale prima che venga scritto qualunque byte, la chiamata fallisce con l'errore B<EINTR>; se viene interrotta dopo aver scritto almeno un byte, la chiamata ha successo e restituisce il numero di byte scritti.
nl: Als een B<write>() werd onderbroken door een signaal voordat enige bytes werden geschreven, dan zal de aanroep falen met de fout B<EINTR>; als hij werd onderbroken nadat op zijn minst een byte werd geschreven, dan is de aanroep succesvol, en retourneert het aantal geschreven bytes.

source: On Linux, B<write>() (and similar system calls) will transfer at most 0x7ffff000 (2,147,479,552) bytes, returning the number of bytes actually transferred. (This is true on both 32-bit and 64-bit systems.)
it: Su Linux, B<write>() (e chiamate di sistema simili) trasferiranno al massimo 0x7ffff000 (2,147,479,552) byte, restituendo il numero di byte effettivamente trasferiti. (Questo è vero sia sui sistemi a 32 bit sia su quelli a 64 bit)
nl: Op Linux zal B<write>() (en vergelijkbare systeem aanroepen) maximaal 0x7ffff000 (2,147,479,552) bytes overdragen, en het daadwerkelijk aantal geschreven bytes retourneren. (Dit is waar voor zowel 32-bit als 64-but systemen.)

source: An error return value while performing B<write>() using direct I/O does not mean the entire write has failed. Partial data may be written and the data at the file offset on which the B<write>() was attempted should be considered inconsistent.
it: Un valore di errore restituito mentre si esegue una chiamata B<write>() usando I/O diretto non significa che l'intera scrittura non abbia avuto successo. Possono venir scritti dati parziali e i dati all'offset del file sul quale è stata tentata la chiamata B<write>() dovrebbe essere considerata incongruente.
nl: Een foutmelding gedurende het uitvoeren van B<write>() onder gebruik van directe Invoer/Uitvoer betekent niet dat de volledige schrijf actie faalde. Een deel van de gegevens kan zijn geschreven en de gegevens op de bestandspositie waar de B<write>() werd geprobeerd dienen beschouwd te worden als inconsistent.

source: According to POSIX.1-2008/SUSv4 Section XSI 2.9.7 ("Thread Interactions with Regular File Operations"):
it: Secondo POSIX.1-2008/SUSv4 Section XSI 2.9.7 ("Thread Interactions with Regular File Operations"):
nl: Volgens POSIX.1-2008/SUSv4 Sectie XSI 2.9.7 ("Thread interacties met Reguliere Bestand Operaties"):

source: All of the following functions shall be atomic with respect to each other in the effects specified in POSIX.1-2008 when they operate on regular files or symbolic links: ...
it: Tutte le seguenti funzioni devono essere atomiche l'una rispetto all'altra nei risultati specificati in POSIX.1-2008 quando esse operano su file regolari o su collegamenti simbolici: ...
nl: Alle volgende functie zullen onderling atomair zijn voor wat betreft de effecten die in POSIX.1-2008 gespecificeerd zijn indien ze werken op reguliere bestanden of symbolische koppelingen: ...

source: Among the APIs subsequently listed are B<write>() and B<writev>(2). And among the effects that should be atomic across threads (and processes) are updates of the file offset. However, on Linux before version 3.14, this was not the case: if two processes that share an open file description (see B<open>(2)) perform a B<write>() (or B<writev>(2)) at the same time, then the I/O operations were not atomic with respect to updating the file offset, with the result that the blocks of data output by the two processes might (incorrectly) overlap. This problem was fixed in Linux 3.14.
it: Tra le API elencate susseguentemente ci sono B<write>() e B<writev>(2). E tra i risultati che dovrebbero essere atomici attraverso i thread (e i processi) ci sono gli aggiornamenti dell'offset dei file. Tuttavia, sulle versioni di Linux precedenti alla 3.14 non era così: se due processi che condividono una descrizione di file aperto (vedi B<open>(2)) effettuano un B<write>() (o B<writev>(2)) allo stesso tempo, le operazioni I/O non erano atomiche rispetto all'offset del file, col risultato che i blocchi di dati in uscita dai due processi potrebbero (non correttamente) sovrapporsi. Questo problema è stato risolto in Linux 3.14.
nl: Tussen de opeenvolgende API´s staan B<write>() en B<writev>(2). En tussen de effecten die atomair zouden moeten zijn langs threads (en processen) zijn de veranderingen aan de bestandspositie. Echter op Linux voor versie 3.14 was dit niet het geval: als twee processen die een open bestandsindicator delen (zie B<open>(2)) een B<write>() (or B<writev>(2)) tegelijkertijd uitvoeren, dan zijn de Invoer/Uitvoer operaties not atomair met betrekking tot het aanpassen van de bestandspositie, hetgeen kan resulteren dat de gegevens blokken geschreven door beide processen kunnen overlappen. Dit probleem werd opgelost in Linux 3.14.

source: SEE ALSO
it: VEDERE ANCHE
nl: ZIE OOK
