Repository: sebras/manpages-l10n
Catalog: po/*/man2/write.2.po
Languages: it, nl

source: Linux Programmer's Manual
it: Manuale del programmatore di Linux
nl: Linux Programmeurs Handleiding

source: B<ssize_t write(int >I<fd>B<, const void *>I<buf>B<, size_t >I<count>B<);>
nl: B<ssize_t write(int >I<bi>B<, const void *>I<buf>B<, size_t >I<tel>B<);>

source: On success, the number of bytes written is returned. On error, -1 is returned, and I<errno> is set to indicate the cause of the error.
it: Se è andato tutto bene, la funzione restituisce il numero di byte scritti. In caso di errore viene restituito -1, e I<errno> viene impostato per indicare la causa dell'errore.
nl: Bij success wordt het aantal geschreven bytes teruggegeven (nul betekend niks werd geschreven). Bij falen wordt -1 teruggegeven en I<errno> wordt naar behoren gezet.

source: If I<count> is zero and I<fd> refers to a regular file, then B<write>() may return a failure status if one of the errors below is detected. If no errors are detected, or error detection is not performed, 0 will be returned without causing any other effect. If I<count> is zero and I<fd> refers to a file other than a regular file, the results are not specified.
it: Se I<count> è zero, e I<fd> fa riferimento ad un file regolare, B<write>() può restituire uno stato di insuccesso se viene rilevato uno degli errori descritti più avanti. Se non vengono rilevati errori, o se non la rilevazione degli errori non è eseguita, restituisce 0 senza causare altri effetti. Se I<count> è zero e I<fd> fa riferimento ad un file diverso da uno regolare, i risultati non sono specificati.
nl: Als I<tel> nul is en I<bi> wijst naar een normaal bestand dan kan B<write>() een fout status teruggeven als een van de hieronder gegeven fouten werd gedetecteerd. Als een fouten worden gedetecteerd of fout detectie is niet gedaan, dan wordt 0 teruggegeven zonder enig andere effect te veroorzaken. Als I<tel> nul is en I<bi> wijst naar een bestand anders dan een regulier bestand, dan zijn de resultaten onbepaald.

source: CONFORMING TO
it: CONFORME A
nl: VOLDOET AAN

source: An error return value while performing B<write>() using direct I/O does not mean the entire write has failed. Partial data may be written and the data at the file offset on which the B<write>() was attempted should be considered inconsistent.
it: Un valore di errore restituito mentre si esegue una chiamata B<write>() usando I/O diretto non significa che l'intera scrittura non abbia avuto successo. Possono venir scritti dati parziali e i dati all'offset del file sul quale è stata tentata la chiamata B<write>() dovrebbe essere considerata incongruente.
nl: Een foutmelding gedurende het uitvoeren van B<write>() onder gebruik van directe Invoer/Uitvoer betekent niet dat de volledige schrijf actie faalde. Een deel van de gegevens kan zijn geschreven en de gegevens op de bestandspositie waar de B<write>() werd geprobeerd dient beschouwd te worden als inconsistent.

source: Among the APIs subsequently listed are B<write>() and B<writev>(2). And among the effects that should be atomic across threads (and processes) are updates of the file offset. However, on Linux before version 3.14, this was not the case: if two processes that share an open file description (see B<open>(2)) perform a B<write>() (or B<writev>(2)) at the same time, then the I/O operations were not atomic with respect updating the file offset, with the result that the blocks of data output by the two processes might (incorrectly) overlap. This problem was fixed in Linux 3.14.
it: Tra le API elencate susseguentemente ci sono B<write>() e B<writev>(2). E tra i risultati che dovrebbero essere atomici attraverso i thread (e i processi) ci sono gli aggiornamenti dell'offset dei file. Tuttavia, sulle versioni di Linux precedenti alla 3.14 non era così: se due processi che condividono una descrizione di file aperto (vedi B<open>(2)) effettuano un B<write>() (o B<writev>(2)) allo stesso tempo, le operazioni I/O non erano atomiche rispetto all'offset del file, col risultato che i blocchi di dati in uscita dai due processi potrebbero (non correttamente) sovrapporsi. Questo problema è stato risolto in Linux 3.14.
nl: Tussen de opeenvolgende API´s staan B<write>() en B<writev>(2). En tussen de effecten die atomair zouden moeten zijn langs threads (en processen) zijn de veranderingen aan de bestandspositie. Echter op Linux voor versie 3.14 was dit niet het geval: als twee processen die een open bestandsbeschrijving delen (zie B<open>(2)) een B<write>() (or B<writev>(2)) tegelijkertijd uitvoeren, dan zijn de Invoer/Uitvoer operaties not atomair met betrekking tot het aanpassen van de bestandspositie, hetgeen kan resulteren dat de gegevens blokken geschreven door beide processen kunnen overlappen. Dit probleem werd opgelost in Linux 3.14.

source: COLOPHON
nl: COLOFON

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.10 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.10 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: This page is part of release 5.13 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 5.13 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 5.13 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: On success, the number of bytes written is returned (zero indicates nothing was written). It is not an error if this number is smaller than the number of bytes requested; this may happen for example because the disk device was filled. See also NOTES.
nl: Bij succes wordt het aantal geschreven bytes teruggegeven (nul geeft aan dat niks geschreven werd). Dat is geen fout als dit getal kleiner is dan het aantal gevraagde bytes; dit kan bij voorbeeld optreden doordat een schijf apparaat werd gevuld. Zie ook OPMERKINGEN.

source: On error, -1 is returned, and I<errno> is set appropriately.
it: In caso di errore viene restituito -1 , e I<errno> è impostato appropriatamente.
nl: Bij falen wordt -1 teruggegeven en wordt I<errno> overeenkomstig gezet.

source: A low-level I/O error occurred while modifying the inode. This error may relate to the write-back of data written by an earlier B<write>(2), which may have been issued to a different file descriptor on the same file. Since Linux 4.13, errors from write-back come with a promise that they I<may> be reported by subsequent. B<write>(2) requests, and I<will> be reported by a subsequent B<fsync>(2) (whether or not they were also reported by B<write>(2)). An alternate cause of B<EIO> on networked filesystems is when an advisory lock had been taken out on the file descriptor and this lock has been lost. See the I<Lost locks> section of B<fcntl>(2) for further details.
it: B<EIO> Un errore I/O di basso livello è accaduto mentre si modificava l'inode. Quest'errore può riguardare il "write-back" di dati scritti da un precedente B<write>(2), che può essere stato eseguito usando un altro descrittore di file che serviva per accedere allo stesso file. A partire da Linux 4.13, gli errori derivanti da write-back si presentano con la speranza che I<possano> essere riportati da successive richieste di B<write>(2), e I<verranno> riportati da un successivo B<fsync>(2) (che siano stati riportati o no anche da B<write>(2)). Un'altra causa di B<EIO> su filesystem collegati in rete è quando un lock consigliato (advisory lock) era già stato scaricato sul descrittore di file e questo lock è stato perso. Si veda la sezione I<Lost locks> di B<fcntl>(2) per ulteriori dettagli.
nl: Een laag-niveau Invoer/Uitvoer fout trad op terwijl de inode veranderd werd. Deze fout kan gerelateerd zijn aan een schrijf-terug van gegevens geschreven door een eerdere B<write>(), die kan zijn gedaan via een andere bestandsbeschrijving op hetzelfde bestand. Vanaf Linux 4.13, komen fouten van een schrijf-terug terug met de belofte dat ze gerapporteerd I<kunnen> worden door volgende B<write>() aanroepen en worden gerapporteerd door een volgende B<fsync>(2) (al dan niet ook gerapporteerd door B<write>()). Een alternatief geval van B<EIO> op netwerk bestandssystemen is wanneer een geadviseerde lock werd verwijderd op de bestandsbeschrijving en als die lock verloren werd. Zie de I<Verloren Locks> sectie van B<fcntl>(2) voor meer details.

source: A successful return from B<write>() does not make any guarantee that data has been committed to disk. On some filesystems, including NFS, it does not even guarantee that space has successfully been reserved for the data. In this case, some errors might be delayed until a future B<write>(2), B<fsync>(2), or even B<close>(2). The only way to be sure is to call B<fsync>(2) after you are done writing all your data.
it: Un ritorno con successo da B<write>() non dà alcuna garanzia che i dati siano stati trasferiti sul disco. Su alcuni filesystem, compreso NFS, esso non garantisce che questo spazio sia stato riservato per i dati in modo corretto. In questo caso, alcuni errori potrebbero essere differiti fino a un futuro B<write>(2), B<fsync>(2), o anche B<close>(2). Il solo modo per essere sicuri è di chiamare B<fsync>(2) dopo che si è eseguita la scrittura di tutti i propri dati.
nl: Een succesvolle terugkeer uit B<write>() is geen garantie dat de gegevens zijn toegekend aan de schijf. Op sommige bestandssystemen, inclusief NFS, is het zelfs geen garantie dat de ruimte succesvol werd gereserveerd voor de gegevens. In dit geval, kunnen sommige fouten worden vertraagd tot een toekomstige B<write>(), B<fsync>(2), of zelfs B<close>(2). De enige manier om zeker te zijn is door B<fsync>(2) aan te roepen, nadat u klaar bent met het schrijven van alle gegevens.

source: This page is part of release 4.16 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
it: Questa pagina fa parte del rilascio 4.16 del progetto Linux I<man-pages>. Una descrizione del progetto, le istruzioni per la segnalazione degli errori, e l'ultima versione di questa pagina si trovano su \%https://www.kernel.org/doc/man-pages/.
nl: Deze pagina is onderdeel van release 4.16 van het Linux I<man-pages>-project. Een beschrijving van het project, informatie over het melden van bugs en de nieuwste versie van deze pagina zijn op \%https://www.kernel.org/doc/man-pages/ te vinden.

source: BUGS
it: BUG
