Repository: sebras/manpages-l10n
Catalog: po/primary/man8/systemd-socket-proxyd.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-socket-proxyd - Bidirectionally proxy local sockets to another (possibly remote) socket\&.
de: systemd-socket-proxyd - Bidirektionaler Proxy zwischen lokalen Sckets und anderen (möglicherweise nichtlokalen) Sockets\&.

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-socket-proxyd> [I<OPTIONS>...] I<HOST>:I<PORT>
de: B<systemd-socket-proxyd> [I<OPTIONEN>…] I<RECHNER>:I<PORT>

source: B<systemd-socket-proxyd> [I<OPTIONS>...] I<UNIX-DOMAIN-SOCKET-PATH>
de: B<systemd-socket-proxyd> [I<OPTIONEN>…] I<UNIX-DOMAIN-SOCKET-PFAD>

source: DESCRIPTION
de: BESCHREIBUNG

source: One use of this tool is to provide socket activation support for services that do not natively support socket activation\&. On behalf of the service to activate, the proxy inherits the socket from systemd, accepts each client connection, opens a connection to a configured server for each client, and then bidirectionally forwards data between the two\&.
de: Die Bereitstellung von Socket-Aktivierungsunterstützung für Dienste, die nativ keine Socket-Aktivierung unterstützen, ist eine Anwendung dieses Werkzeugs\&. Im Auftrag des zu aktivierenden Dienstes erbt der Proxy das Socket von Systemd, akzeptiert jede Client-Verbindung, öffnet die Verbindung zu einem konfigurierten Server für jeden Client und leitet dann Daten bidirektional zwischen den beiden weiter\&.

source: This utility\*(Aqs behavior is similar to B<socat>(1)\&. The main differences for B<systemd-socket-proxyd> are support for socket activation with "Accept=false" and an event-driven design that scales better with the number of connections\&.
de: Das Verhalten dieses Hilfswerkzeugs ist ähnlich B<socat>(1)\&. Der Hauptunterschied zu B<systemd-socket-proxyd> besteht darin, dass die Socket-Aktivierung mit »Accept=false« unterstützt wird und dass ein ereignisgesteuertes Design verwandt wird, das besser mit der Anzahl der Verbindungen skaliert\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: Print a short help text and exit\&.
de: zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: Sets the maximum number of simultaneous connections, defaults to 256\&. If the limit of concurrent connections is reached further connections will be refused\&.
de: Setzt die maximale Anzahl an gleichzeitigen Verbindungen, standardmäßig 256\&. Falls die Begrenzung der gleichzeitigen Verbindungen erreicht ist, werden weitere Verbindungen abgelehnt\&.

source: EXIT STATUS
de: RÜCKGABEWERT

source: On success, 0 is returned, a non-zero failure code otherwise\&.
de: Bei Erfolg wird 0 zurückgegeben, anderenfalls ein Fehlercode ungleich Null\&.

source: EXAMPLES
de: BEISPIELE

source: Simple Example
de: Einfaches Beispiel

source: Use two services with a dependency and no namespace isolation\&.
de: Zwei Dienste mit einer Abhängigkeit und keiner Namensraumisolation verwenden\&.

source: B<Example\ \&1.\ \&proxy-to-nginx\&.socket>
de: B<Beispiel\ \&1.\ \&proxy-to-nginx\&.socket>

source: B<Example\ \&2.\ \&proxy-to-nginx\&.service>
de: B<Beispiel\ \&2.\ \&proxy-to-nginx\&.service>

source: B<Example\ \&3.\ \&nginx\&.conf>
de: B<Beispiel\ \&3.\ \&nginx\&.conf>

source: B<Example\ \&4.\ \&Enabling the proxy>
de: B<Beispiel\ \&4.\ \&Enabling the proxy>

source: Namespace Example
de: Namespace-Beispiel

source: Similar as above, but runs the socket proxy and the main service in the same private namespace, assuming that nginx\&.service has I<PrivateTmp=> and I<PrivateNetwork=> set, too\&.
de: Ähnlich wie oben, führt aber den Socket-Proxy und den Hauptdienst im gleichen privaten Namensraum aus, wobei angenommen wird, dass nginx\&.service auch I<PrivateTmp=> und I<PrivateNetwork=> gesetzt hat\&.

source: B<Example\ \&5.\ \&proxy-to-nginx\&.socket>
de: B<Beispiel\ \&5.\ \&proxy-to-nginx\&.socket>

source: B<Example\ \&6.\ \&proxy-to-nginx\&.service>
de: B<Beispiel\ \&6.\ \&proxy-to-nginx\&.service>

source: B<Example\ \&7.\ \&nginx\&.conf>
de: B<Beispiel\ \&7.\ \&nginx\&.conf>

source: B<Example\ \&8.\ \&Enabling the proxy>
de: B<Beispiel\ \&8.\ \&Enabling the proxy>

source: SEE ALSO
de: SIEHE AUCH
