Repository: sebras/manpages-l10n
Catalog: po/primary/man8/systemd-tmpfiles.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-tmpfiles, systemd-tmpfiles-setup.service, systemd-tmpfiles-setup-dev.service, systemd-tmpfiles-clean.service, systemd-tmpfiles-clean.timer - Creates, deletes and cleans up volatile and temporary files and directories
de: systemd-tmpfiles, systemd-tmpfiles-setup.service, systemd-tmpfiles-setup-dev.service, systemd-tmpfiles-clean.service, systemd-tmpfiles-clean.timer - Temporäre und flüchtige Dateien sowie Verzeichnisse erstellen, löschen und aufräumen

source: SYNOPSIS
de: ÜBERSICHT

source: B<systemd-tmpfiles> [OPTIONS...] [I<CONFIGFILE>...]
de: B<systemd-tmpfiles> [OPTIONEN …] [I<KONFIGURATIONSDATEI> …]

source: User units:
de: Benutzer-Units:

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-tmpfiles> creates, deletes, and cleans up volatile and temporary files and directories, based on the configuration file format and location specified in B<tmpfiles.d>(5)\&.
de: B<systemd-tmpfiles> erstellt und löscht temporäre und flüchtige Dateien sowie Verzeichnisse und räumt diese auf, basierend auf dem Format und der Ort der in B<tmpfiles.d>(5) beschriebenen Konfigurationsdatei\&.

source: If invoked with no arguments, it applies all directives from all configuration files\&. When invoked with B<--replace=>I<PATH>, arguments specified on the command line are used instead of the configuration file I<PATH>\&. Otherwise, if one or more absolute filenames are passed on the command line, only the directives in these files are applied\&. If "-" is specified instead of a filename, directives are read from standard input\&. If only the basename of a configuration file is specified, all configuration directories as specified in B<tmpfiles.d>(5) are searched for a matching file and the file found that has the highest priority is executed\&.
de: Wenn der Befehl ohne Argumente aufgerufen wird, werden alle Anweisungen aus der Konfigurationsdatei angewendet\&. Beim Aufruf mit B<--replace=>I<PFAD> werden die auf der Befehlzeile festgelegten Argumente anstatt der Konfigurationsdatei I<PFAD> verwandt. Werden andernfalls ein oder mehrere absolute Dateinamen in der Befehlszeile übergeben, werden nur die in diesen Dateien enthaltenen Anweisungen ausgeführt\&. Wenn »-« statt eines Dateinamens angegeben wird, werden die Anweisungen von der Standardeingabe gelesen\&. In dem Fall, dass nur der Basisname einer Konfigurationsdatei angegeben wird, werden alle in B<tmpfiles.d>(5) angegebenen Verzeichnisse nach einer passenden Datei durchsucht und die gefundene Datei, die die höchste Priorität hat, wird ausgeführt\&.

source: OPTIONS
de: OPTIONEN

source: The following options are understood:
de: Die folgenden Optionen werden verstanden:

source: If this option is passed, all files and directories marked with I<f>, I<F>, I<w>, I<d>, I<D>, I<v>, I<p>, I<L>, I<c>, I<b>, I<m> in the configuration files are created or written to\&. Files and directories marked with I<z>, I<Z>, I<t>, I<T>, I<a>, and I<A> have their ownership, access mode and security labels set\&.
de: entfernt alle in der Konfigurationsdatei mit I<f>, I<F>, I<w>, I<d>, I<D>, I<v>, I<p>, I<L>, I<c>, I<b>, I<m> markierten Dateien und Verzeichnisse oder legt diese an\&. Mit I<z>, I<Z>, , I<t>, I<T>, I<a> und I<A> markierte Dateien und Verzeichnisse haben ihre eigenen Besitzer, Zugriffsmodi und Sicherheitskennzeichen\&.

source: If this option is passed, all files and directories with an age parameter configured will be cleaned up\&.
de: räumt alle Dateien und Verzeichnisse auf, für die ein Parameter konfiguriert ist, der sich auf das Alter bezieht\&.

source: If this option is passed, the contents of directories marked with I<D> or I<R>, and files or directories themselves marked with I<r> or I<R> are removed\&.
de: entfernt den Inhalt aller mit I<D> oder I<R> markierten Dateien und Verzeichnisse, sowie die mit I<r> oder I<R> markierten Verzeichnisse selbst\&.

source: Execute "user" configuration, i\&.e\&. tmpfiles\&.d files in user configuration directories\&.
de: führt »Benutzer«-Konfiguration aus, d\&.h\&. tmpfiles\&.d-Dateien in Benutzerkonfigurationsverzeichnissen\&.

source: Also execute lines with an exclamation mark\&.
de: wendet auch jene Regeln an, denen ein Ausrufezeichen vorangestellt ist\&.

source: B<--prefix=>I<path>
de: B<--prefix=>I<Pfad>

source: Only apply rules with paths that start with the specified prefix\&. This option can be specified multiple times\&.
de: wendet nur jene Regeln an, die auf Pfade mit dem angegebenen Präfix verweisen\&. Diese Option kann mehrmals angegeben werden\&.

source: B<--exclude-prefix=>I<path>
de: B<--exclude-prefix=>I<Pfad>

source: Ignore rules with paths that start with the specified prefix\&. This option can be specified multiple times\&.
de: ignoriert die Regeln zum Anwenden der Pfade mit dem angegebenen Präfix\&. Diese Option kann mehrmals angegeben werden\&.

source: B<--root=>I<root>
de: B<--root=>I<Wurzel>

source: Takes a directory path as an argument\&. All paths will be prefixed with the given alternate I<root> path, including config search paths\&.
de: akzeptiert einen Verzeichnispfad als Argument\&. Allen Pfaden wird der angegebene alternative I<Wurzel>-Pfad vorangestellt, einschließlich der Suchpfade für die Konfiguration\&.

source: Note that this option does not alter how the users and groups specified in the configuration files are resolved\&. With or without this option, users and groups are always resolved according to the host\*(Aqs user and group databases, any such databases stored under the specified root directories are not consulted\&.
de: Beachten Sie, dass diese Option nicht beeinflusst, wie die in den Konfigurationsdateien festgelegten Benutzer und Gruppen aufgelöst werden. Mit oder ohne diese Option werden Benutzer und Gruppen immer gemäß der Benutzer- und Gruppendatenbank des Rechners aufgelöst; alle solche Datenbanken, die unter den angegebenen Wurzelverzeichnissen gespeichert sind, werden nicht berücksichtigt\&.

source: B<--replace=>I<PATH>
de: B<--replace=>I<PFAD>

source: When this option is given, one ore more positional arguments must be specified\&. All configuration files found in the directories listed in B<tmpfiles.d>(5) will be read, and the configuration given on the command line will be handled instead of and with the same priority as the configuration file I<PATH>\&.
de: Wird diese Option angegeben, müssen eine oder mehrere positionsbezogene Argumente festgelegt werden\&. Alle in den in B<tmpfiles.d>(5) aufgeführten Verzeichnissen gefundenen Konfigurationsdateien werden gelesen und die auf der Befehlszeile übergebene Konfiguration wird statt der Konfigurationsdatei I<PFAD> mit der gleichen Priorität wie diese verwandt\&.

source: This option is intended to be used when package installation scripts are running and files belonging to that package are not yet available on disk, so their contents must be given on the command line, but the admin configuration might already exist and should be given higher priority\&.
de: Diese Option ist dazu gedacht, verwandt zu werden, wenn die Installationsskripte laufen und Dateien, die zu dem Paket gehören, noch nicht auf Platte verfügbar sind, so dass ihr Inhalt auf der Befehlszeile übergeben werden muss, aber die Konfigurationsskripte des Administrators bereits existieren und ihnen eine höherere Priorität gegeben werden soll\&.

source: Copy the contents of config files to standard output\&. Before each file, the filename is printed as a comment\&.
de: Kopiert den Inhalt der Konfigurationsdateien in die Standardausgabe\&. Vor jeder Datei wird der Dateiname als Kommentar ausgegeben\&.

source: Do not pipe output into a pager\&.
de: Die Ausgabe nicht an einen Pager weiterleiten\&.

source: Print a short help text and exit\&.
de: zeigt einen kurzen Hilfetext an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: zeigt eine kurze Versionszeichenkette an und beendet das Programm\&.

source: It is possible to combine B<--create>, B<--clean>, and B<--remove> in one invocation\&. For example, during boot the following command line is executed to ensure that all temporary and volatile directories are removed and created according to the configuration file:
de: Es ist möglich, B<--create>, B<--clean> und B<--remove> in einem Aufruf zu kombinieren\&. Zum Beispiel wird während des Systemstarts die folgende Befehlszeile ausgeführt, um sicherzustellen, dass alle flüchtigen und temporären Verzeichnisse entsprechend der Konfigurationsdatei entfernt beziehungsweise angelegt werden:

source: UNPRIVILEGED --CLEANUP OPERATION
de: UNPRIVILEGIERTE --CLEANUP-OPERATION

source: B<systemd-tmpfiles> tries to avoid changing the access and modification times on the directories it accesses, which requires B<CAP_FOWNER> privileges\&. When running as non-root, directories which are checked for files to clean up will have their access time bumped, which might prevent their cleanup\&.
de: B<systemd-tmpfiles> versucht die Änderungs- und Zugriffs-Zeitstempel der Verzeichnisse zu erhalten, auf die es zugreift\&. Dafür sind B<CAP_FOWNER>-Privilegien erforderlich\&. Wenn es nicht als Root ausgeführt wird, wird die Zugriffszeit der Verzeichnisse aktualisiert, die nach zu löschenden Dateien durchsucht werden\&. Dadurch kann der tatsächliche Löschvorgang verhindert werden\&.

source: EXIT STATUS
de: RÜCKGABEWERT

source: On success, 0 is returned\&. If the configuration was syntactically invalid (syntax errors, missing arguments, \&...), so some lines had to be ignored, but no other errors occurred, B<65> is returned (B<EX_DATAERR> from /usr/include/sysexits\&.h)\&. If the configuration was syntactically valid, but could not be executed (lack of permissions, creation of files in missing directories, invalid contents when writing to /sys/ values, \&...), B<73> is returned (B<EX_CANTCREAT> from /usr/include/sysexits\&.h)\&. Otherwise, B<1> is returned (B<EXIT_FAILURE> from /usr/include/stdlib\&.h)\&.
de: Im Erfolgsfall wird 0 zurückgeliefert\&. Falls die Konfigurationsdatei syntaktisch ungültig war (Syntaxfehler, fehlende Argumente, …) und einige Zeilen ignoriert werden mussten, aber keine weiteren Fehler aufgetreten sind, wird B<65> zurückgeliefert (B<EX_DATAERR> aus /usr/include/sysexits\&.h)\&. Falls die Konfiguration syntaktisch korrekt war, aber nicht ausgeführt werden konnte (unzureichende Rechte, Erstellung von Dateien in fehlenden Verzeichnissen, ungültige Inhalte beim Schreiben von /sys/-Werten, …), wird B<73> zurückgeliefert (B<EX_CANTCREAT> aus /usr/include/sysexits\&.h)\&. Andernfalls wird B<1> zurückgeliefert (B<EXIT_FAILURE> aus /usr/include/stdlib\&.h)\&.

source: SEE ALSO
de: SIEHE AUCH
