Repository: sebras/manpages-l10n
Catalog: po/primary/man8/systemd-debug-generator.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-debug-generator - Generator for enabling a runtime debug shell and masking specific units at boot
de: systemd-debug-generator - Generator für die Aktivierung einer Laufzeit-Fehlersuch-Shell und der Maskierung bestimmter Units beim Systemstart

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: systemd-debug-generator is a generator that reads the kernel command line and understands three options:
de: Systemd-debug-generator ist ein Generator, der die Kernel-Befehlszeile ausliest und drei Optionen versteht:

source: If the B<systemd\&.mask=> option is specified and followed by a unit name, this unit is masked for the runtime, similar to the effect of B<systemctl>(1)\*(Aqs B<mask> command\&. This is useful to boot with certain units removed from the initial boot transaction for debugging system startup\&. May be specified more than once\&.
de: Falls die Option B<systemd\&.mask=> festgelegt ist und ihr ein Unit-Name folgt, wird diese Unit zur Laufzeit maskiert, ähnlich des Effekts des Befehls B<mask> von B<systemctl>(1)\&. Dies ist nützlich, um zur Fehlersuche des Systemstarts beim Systemstart bestimmte Units aus der anfänglichen Systemstart-Transaktion zu entfernen\&.

source: If the B<systemd\&.wants=> option is specified and followed by a unit name, a start job for this unit is added to the initial transaction\&. This is useful to start one or more additional units at boot\&. May be specified more than once\&.
de: Falls die Option B<systemd\&.wants=> festgelegt ist und ihr ein Unit-Name folgt, wird diese Unit zur anfänglichen Transaktion hinzugefügt\&. Dies ist nützlich, um eine oder mehrere zusätzliche Units beim Systemstart hinzuzufügen\&. Kann mehr als einmal angegeben werden\&.

source: If the B<systemd\&.debug_shell> option is specified, the debug shell service "debug-shell\&.service" is pulled into the boot transaction\&. It will spawn a debug shell on tty9 during early system startup\&. Note that the shell may also be turned on persistently by enabling it with B<systemctl>(1)\*(Aqs B<enable> command\&.
de: Falls die Option B<systemd\&.debug_shell> festgelegt ist, wird der Fehlersuch-Dienst »debug-shell\&.service« in die Systemstarttransaktion hineingezogen\&. Es wird eine Fehlersuch-Shell auf TTY9 während des frühen Systemstarts öffnen\&. Beachten Sie, dass die Shell auch dauerhaft eingeschaltet werden kann, indem sie mit dem Befehl B<enable> von B<systemctl>(1) aktiviert wird\&.

source: systemd-debug-generator implements B<systemd.generator>(7)\&.
de: systemd-debug-generator implementiert B<systemd.generator>(7)\&.

source: SEE ALSO
de: SIEHE AUCH
